{
  "ayahs": [
    {
      "ayah": 1,
      "surah": 1,
      "text": "بسم الله الرحمن الرحيم سورة الفاتحة . يقال لها الفاتحة أي فاتحة الكتاب خطا وبها تفتح القراءة في الصلوات ويقال لها أيضا أم الكتاب عند الجمهور ذكره أنس , والحسن وابن سيرين كرها تسميتها بذلك قال الحسن وابن سيرين إنما ذلك اللوح المحفوظ وقال الحسن الآيات المحكمات هن أم الكتاب ولذا كرها أيضا أن يقال لها أم القرآن وقد ثبت في الصحيح عند الترمذي وصححه عن أبي هريرة قال - قال رسول الله صلى الله عليه وسلم \" الحمد لله رب العالمين أم القرآن وأم الكتاب والسبع المثاني والقرآن العظيم \" ويقال لها \" الحمد \" ويقال لها \" الصلاة \" لقوله صلى الله عليه وسلم عن ربه \" قسمت الصلاة بيني وبين عبدي نصفين فإذا قال العبد الحمد لله رب العالمين قال الله حمدني عبدي \" الحديث . فسميت الفاتحة صلاة لأنها شرط فيها ويقال لها \" الشفاء \" لما رواه الدارمي عن أبي سعيد مرفوعا \" فاتحة الكتاب شفاء من كل سم\" ويقال لها \" الرقية \" لحديث أبي سعيد في الصحيح حين رقى بها الرجل السليم فقال له رسول الله صلى الله عليه وسلم \" وما يدريك أنها رقية \" ؟ وروى الشعبي عن ابن عباس أنه سماها \" أساس القرآن\" قال وأساسها بسم الله الرحمن الرحيم وسماها سفيان بن عيينة \" بالواقية \" وسماها يحيى بن أبي كثير \" الكافية \" لأنها تكفي عما عداها ولا يكفي ما سواها عنها كما جاء في بعض الأحاديث المرسلة\" أم القرآن عوض من غيرها وليس من غيرها عوض منها \" ويقال لها سورة \" الصلاة والكنز \" ذكرهما الزمخشري في كشافه . وهي مكية قاله ابن عباس وقتادة وأبو العالية وقيل مدنية قاله أبو هريرة ومجاهد وعطاء بن يسار والزهري ويقال نزلت مرتين مرة بمكة ومرة بالمدينة . والأول أشبه لقوله تعالى : \" ولقد آتيناك سبعا من المثاني \" والله تعالى أعلم وحكى أبو الليث السمرقندي أن نصفها نزل بمكة ونصفها الآخر نزل بالمدينة وهو غريب جدا نقله القرطبي عنه وهي سبع آيات بلا خلاف وقال عمرو بن عبيد ثمان وقال حسين الجعفي ستة وهذان القولان شاذان وإنما اختلفوا في البسملة هل هي آية مستقلة من أولها كما هو عند جمهور قراء الكوفة وقول جماعة من الصحابة والتابعين وخلق من الخلف أو بعض آية أو لا تعد من أولها بالكلية كما هو قول أهل المدينة من القراء والفقهاء ؟ على ثلاثة أقوال كما سيأتي تقريرها في موضعه إن شاء الله تعالى وبه الثقة . قالوا وكلماتها خمس وعشرون كلمة وحروفها مائة وثلاثة عشر حرفا . قال البخاري في أول كتاب التفسير وسميت أم الكتاب لأنه يبدأ بكتابتها في المصاحف ويبدأ بقراءتها في الصلاة وقيل إنما سميت بذلك لرجوع معاني القرآن كله إلى ما تضمنته . قال ابن جرير : والعرب تسمي كل جامع أمر أو مقدم لأمر إذا كانت له توابع تتبعه هو لها إمام جامع - أما فتقول للجلدة التي تجمع الدماغ أم الرأس ويسمون لواء الجيش ورايتهم التي يجتمعون تحتها أما واستشهد بقول ذي الرمة : على رأسه أم لنا نقتدي بها جماع أمور ليس نعصي لها أمرا يعني الرمح - قال وسميت مكة أم القرى لتقدمها أمام جميعها وجمعها ما سواها . وقيل لأن الأرض دحيت منها. ويقال لها أيضا الفاتحة لأنها تفتتح بها القراءة وافتتحت الصحابة بها كتابة المصحف الإمام وصح تسميتها بالسبع المثاني قالوا لأنها تثنى في الصلاة فتقرأ في كل ركعة وإن كان للمثاني معنى آخر غير هذا كما سيأتي بيانه في موضعه إن شاء الله تعالى . قال الإمام أحمد : حدثنا يزيد بن هارون أنبأنا ابن أبي ذئب وهاشم بن هاشم عن ابن أبي ذئب عن المقبري عن أبي هريرة عن النبي صلى الله عليه وسلم أنه قال في أم القرآن \" هي أم القرآن وهي السبع المثاني وهي القرآن العظيم\" ثم رواه عن إسماعيل بن عمر عن ابن أبي ذئب به وقال أبو جعفر محمد بن جرير الطبري : حدثني يونس بن عبد الأعلى أنبأنا ابن وهب أخبرني ابن أبي ذئب عن سعيد المقبري عن أبي هريرة رضي الله عنه عن رسول الله صلى الله عليه وسلم قال \" هي أم القرآن وهي فاتحة الكتاب وهي السبع المثاني \" وقال الحافظ أبو بكر أحمد بن موسى بن مردويه في تفسيره حدثنا أحمد بن محمد بن زياد حدثنا محمد بن غالب بن حارث حدثنا إسحاق بن عبد الواحد الموصلي حدثنا المعافى بن عمران عن عبد الحميد بن جعفر عن نوح بن أبي بلال عن المقبري عن أبي هريرة قال : قال رسول الله صلى الله عليه وسلم \" الحمد لله رب العالمين سبع آيات : بسم الله الرحمن الرحيم إحداهن وهي السبع المثاني والقرآن العظيم وهي أم الكتاب وفاتحة الكتاب \" وقد رواه الدارقطني أيضا عن أبي هريرة مرفوعا بنحوه أو مثله وقال كلهم ثقات وروى البيهقي عن علي وابن عباس وأبي هريرة أنهم فسروا قوله تعالى : \" سبعا من المثاني \" بالفاتحة وأن البسملة هي الآية السابعة منها وسيأتي تمام هذا عند البسملة. وقد روى الأعمش عن إبراهيم قال : قيل لابن مسعود : لم لم تكتب الفاتحة في مصحفك ؟ فقال : لو كتبتها لكتبتها في أول كل سورة قال أبو بكر بن أبي داود يعني حيث يقرأ في الصلاة قال : واكتفيت بحفظ المسلمين لها عن كتابتها وقد قيل : إن الفاتحة أول شيء أنزل من القرآن كما ورد في حديث رواه البيهقي في دلائل النبوة ونقله الباقلاني أحد أقوال ثلاثة وقيل \" يا أيها المدثر \" كما في حديث جابر في الصحيح وقيل : \" اقرأ باسم ربك الذي خلق \" وهذا هو الصحيح كما سيأتي تقريره في موضعه والله المستعان \" . ذكر ما ورد في فضل الفاتحة \" قال الإمام أحمد بن محمد بن حنبل رحمه الله تعالى في مسنده : حدثنا يحيى بن سعيد عن شعبة حدثني حبيب بن عبد الرحمن عن حفص بن عاصم عن أبي سعيد بن المعلى رضي الله عنه قال : كنت أصلي فدعاني رسول الله صلى الله عليه وسلم فلم أجبه حتى صليت قال : فأتيته فقال \" ما منعك أن تأتيني ؟ \" قال قلت : يا رسول الله إني كنت أصلي قال : ألم يقل الله تعالى : \" يا أيها الذين آمنوا استجيبوا لله وللرسول إذا دعاكم لما يحييكم \" ثم قال \" لأعلمنك أعظم سورة في القرآن قبل أن تخرج من المسجد \" قال : فأخذ بيدي فلما أراد أن يخرج من المسجد قلت : يا رسول الله إنك قلت لأعلمنك أعظم سورة في القرآن قال \" نعم\" الحمد لله رب العالمين \" هي السبع المثاني والقرآن العظيم الذي أوتيته \" وهكذا رواه البخاري عن مسدد وعلي بن المديني كلاهما عن يحيى بن سعيد القطان به ورواه في موضع آخر من التفسير وأبو داود والنسائي وابن ماجه من طرق عن شعبة به ورواه الواقدي عن محمد بن معاذ الأنصاري عن خبيب بن عبد الرحمن عن حفص بن عاصم عن أبي سعيد بن المعلى عن أبي بن كعب فذكر نحوه . وقد وقع في الموطأ للإمام مالك بن أنس رحمه الله ما ينبغي التنبيه عليه فإنه رواه مالك عن العلاء بن عبد الرحمن بن يعقوب الحرقي أن أبا سعيد مولى ابن عامر بن كريز أخبرهم أن رسول الله صلى الله عليه وسلم نادى أبي بن كعب وهو يصلي في المسجد فلما فرغ من صلاته لحقه قال فوضع النبي صلى الله عليه وسلم يده على يدي وهو يريد أن يخرج من باب المسجد ثم قال صلى الله عليه وسلم \" إني لأرجو أن لا تخرج من باب المسجد حتى تعلم سورة ما أنزل في التوراة ولا في الإنجيل ولا في القرآن مثلها \" قال أبي رضي الله عنه فجعلت أبطئ في المشي رجاء ذلك ثم قلت يا رسول الله ما السورة التي وعدتني ؟ قال \" كيف تقرأ إذا افتتحت الصلاة ؟ قال فقرأت عليه \" الحمد لله رب العالمين\" حتى أتيت على آخرها فقال رسول الله صلى الله عليه وسلم \" هي هذه السورة وهي السبع المثاني والقرآن العظيم الذي أعطيت \" فأبو سعيد هذا ليس بأبي سعيد بن المعلى كما اعتقده ابن الأثير في جامع الأصول ومن تبعه فإن ابن المعلى صحابي أنصاري وهذا تابعي من موالي خزاعة وذاك الحديث متصل صحيح وهذا ظاهره أنه منقطع إن لم يكن سمعه أبو سعيد هذا من أبي بن كعب فإن كان قد سمعه منه فهو على شرط مسلم والله أعلم على أنه قد روي عن أبي بن كعب من غير وجه كما قال الإمام أحمد : حدثنا عفان حدثنا عبد الرحمن بن إبراهيم حدثنا العلاء بن عبد الرحمن عن أبيه عن أبي هريرة رضي الله تعالى عنه قال خرج رسول الله صلى الله عليه وسلم على أبي بن كعب وهو يصلي فقال \" يا أبي \" فالتفت ثم لم يجبه ثم قال أبي فخفف أبي ثم انصرف إلى رسول الله صلى الله عليه وسلم فقال السلام عليك أي رسول الله فقال \" وعليك السلام ما منعك أي أبي إذ دعوتك أن تجيبني \" فقال أي رسول الله إني كنت في الصلاة قال \" أولست تجد فيما أوحى الله إلي\" استجيبوا لله وللرسول إذا دعاكم لما يحييكم\" قال بلى يا رسول الله لا أعود قال \" أتحب أن أعلمك سورة لم تنزل لا في التوراة ولا في الإنجيل ولا في الزبور ولا في الفرقان مثلها \" ؟ قلت نعم أي رسول الله قال رسول الله صلى الله عليه وسلم\" إني لأرجو أن لا أخرج من هذا الباب حتى تعلمها\" قال فأخذ رسول الله بيدي يحدثني وأنا أتبطأ مخافة أن يبلغ قبل أن يقضي الحديث فلما دنونا من الباب قلت أي رسول الله ما السورة التي وعدتني ؟ قال \" ما تقرأ في الصلاة \" ؟ قال فقرأت عليه أم القرآن قال \" والذي نفسي بيده ما أنزل الله في التوراة ولا في الإنجيل ولا في الزبور ولا في الفرقان مثلها إنها السبع المثاني ورواه الترمذي عن قتيبة عن الدراوردي عن العلائي عن أبيه عن أبي هريرة رضي الله عنه فذكره وعنده \" إنها من السبع المثاني والقرآن العظيم الذي أعطيته\" ثم قال هذا حديث حسن صحيح وفي الباب عن أنس بن مالك ورواه عبد الله بن الإمام أحمد عن إسماعيل بن أبى معمر عن أبى أسامة عن عبد الحميد بن جعفر عن العلاء عن أبيه عن أبي هريرة عن أبي بن كعب فذكره مطولا بنحوه أو قريبا منه وقد رواه الترمذي والنسائي جميعا عن أبي عمار حسين بن حريث عن الفضل بن موسى عن عبد الحميد بن جعفر عن العلاء عن أبيه عن أبي هريرة عن أبي بن كعب قال : قال رسول الله صلى الله عليه وسلم \" ما أنزل الله في التوراة ولا في الإنجيل مثل أم القرآن وهي السبع المثاني وهي مقسومة بيني وبين عبدي نصفين \" هذا لفظ النسائي وقال الترمذي حديث حسن غريب وقال الإمام أحمد حدثنا محمد بن عبيد حدثنا هاشم يعني بن البريد حدثنا عبد الله بن محمد بن عقيل عن [ ابن ] جابر قال انتهيت إلى رسول الله صلى الله عليه وسلم وقد أهراق الماء فقلت السلام عليك يا رسول الله فلم يرد علي قال فقلت السلام عليك يا رسول الله فلم يرد علي قال فقلت السلام عليك يا رسول الله فلم يرد علي قال فانطلق رسول الله صلى الله عليه وسلم يمشي وأنا خلفه حتى دخل رحله ودخلت أنا المسجد فجلست كئيبا حزينا فخرج علي رسول الله صلى الله عليه وسلم وقد تطهر فقال \" عليك السلام ورحمة الله وبركاته وعليك السلام ورحمة الله وبركاته وعليك السلام ورحمة الله \" ثم قال \" ألا أخبرك يا عبد الله بن جابر بأخير سورة في القرآن ؟ قلت بلى يا رسول الله قال اقرأ الحمد لله رب العالمين حتى تختمها \" هذا إسناد جيد وابن عقيل هذا يحتج به الأئمة الكبار وعبد الله بن جابر هذا الصحابي ذكر ابن الجوزي أنه هو العبدي والله أعلم ويقال إنه عبد الله بن جابر الأنصاري البياضي فيما ذكره الحافظ ابن عساكر واستدلوا بهذا الحديث وأمثاله على تفاضل بعض الآيات والسور على بعض كما هو المحكي عن كثير من العلماء منهم إسحاق بن راهويه وأبو بكر بن العربي وابن الحفار من المالكية وذهبت طائفة أخرى إلى أنه لا تفاضل في ذلك لأن الجميع كلام الله ولئلا يوهم التفضيل نقص المفضل عليه وإن كان الجميع فاضلا نقله القرطبي عن الأشعري وأبي بكر الباقلاني وأبي حاتم بن حبان البستي وأبي حيان ويحيى بن يحيى ورواية عن الإمام مالك أيضا حديث آخر قال البخاري في فضائل القرآن حدثنا محمد بن المثنى حدثنا وهب حدثنا هشام عن محمد بن سعيد عن أبي سعيد الخدري قال : كنا في مسير لنا فنزلنا فجاءت جارية فقالت إن سيد الحي سليم وإن نفرنا غيب فهل منكم راق ؟ فقام معها رجل ما كنا نأبنه برقية فرقاه فبرأ فأمر له بثلاثين شاة وسقانا لبنا فلما رجع قلنا له أكنت تحسن رقية أو كنت ترقي ؟ قال لا ما رقيت إلا بأم الكتاب قلنا لا تحدثوا شيئا حتى نأتي ونسأل رسول الله صلى الله عليه وسلم فلما قدمنا المدينة ذكرناه للنبي صلى الله عليه وسلم فقال : \" وما كان يدريه أنها رقية اقسموا واضربوا لي بسهم \" وقال أبو معمر حدثنا عبد الوارث حدثنا هشام حدثنا محمد بن سيرين حدثني معبد بن سيرين عن أبي سعيد الخدري بهذا وهكذا رواه مسلم وأبو داود من رواية هشام وهو ابن حسان عن ابن سيرين به وفي بعض روايات مسلم لهذا الحديث أن أبا سعيد الخدري هو الذي رقى ذلك السليم يعني اللديغ يسمونه بذلك تفاؤلا. حديث آخر : روى مسلم في صحيحه والنسائي في سننه من حديث أبي الأحوص سلام بن سليم عن عمار بن زريق عن عبد الله بن عيسى بن عبد الرحمن بن أبى ليلى عن سعيد بن جبير عن ابن عباس قال : بينا رسول الله صلى الله عليه وسلم وعنده جبرائيل إذ سمع نقيضا فوقه فرفع جبريل بصره إلى السماء فقال \" هذا باب قد فتح من السماء ما فتح قط \" قال فنزل منه ملك فأتى النبي صلى الله عليه وسلم فقال : \" أبشر بنورين قد أوتيتهما لم يؤتهما نبي قبلك فاتحة الكتاب وخواتيم سورة البقرة لم تقرأ حرفا منها إلا أوتيته \" وهذا لفظ النسائي ولمسلم نحوه : حديث آخر قال مسلم حدثنا إسحاق بن إبراهيم الحنظلي هو ابن راهويه حدثنا سفيان بن عيينة عن العلاء يعني ابن عبد الرحمن بن يعقوب الخرقي عن أبي هريرة رضي الله عنه عن النبي صلى الله عليه وسلم قال : \" من صلى صلاة لم يقرأ فيها بأم القرآن فهي خداج ثلاثا غير تمام\" فقيل لأبي هريرة إنا نكون خلف الإمام فقال اقرأ بها في نفسك فإني سمعت رسول الله صلى الله عليه وسلم يقول : \" قال الله عز وجل : قسمت الصلاة بيني وبين عبدي نصفين ولعبدي ما سأل فإذا قال : \" الحمد لله رب العالمين \" قال الله حمدني عبدي وإذا قال \" الرحمن الرحيم \" قال الله أثنى علي عبدي فإذا قال : \" مالك يوم الدين \" قال الله مجدني عبدي وقال مرة فوض إلي عبدي فإذا قال \" إياك نعبد وإياك نستعين \" قال هذا بيني وبين عبدي ولعبدي ما سأل فإذا قال : \" اهدنا الصراط المستقيم صراط الذين أنعمت عليهم غير المغضوب عليهم ولا الضالين \" قال الله هذا لعبدي ولعبدي ما سأل \" وهكذا رواه النسائي عن إسحاق بن راهويه وقد روياه أيضا عن قتيبة عن مالك عن العلاء عن أبي السائب مولى هشام بن زهرة عن أبي هريرة وفي هذا السياق \" فنصفها لي ونصفها لعبدي ولعبدي ما سأل \" وهكذا رواه ابن إسحاق عن العلاء وقد رواه مسلم من حديث ابن جريج عن العلاء عن أبي السائب هكذا ورواه أيضا من حديث ابن أبي أويس عن العلاء عن أبيه وأبي السائب كلاهما عن أبي هريرة وقال الترمذي هذا حديث حسن وسألت أبا زرعة عنه فقال كلا الحديثين صحيح من قال عن العلاء عن أبي السائب وعن العلاء عن أبيه وقد روى هذا الحديث عبد الله ابن الإمام أحمد من حديث العلاء عن أبيه عن أبي هريرة عن أبي بن كعب مطولا وقال ابن جرير حدثنا صالح بن مسمار المروزي حدثنا زيد بن الحباب حدثنا عنبسة بن سعيد عن مطرف بن طريف عن سعيد بن إسحاق عن كعب بن عجرة عن جابر بن عبد الله قال : قال رسول الله صلى الله عليه وسلم \" قال الله تعالى : قسمت الصلاة بيني وبين عبدي نصفين وله ما سأل فإذا قال العبد \" الحمد لله رب العالمين\" قال حمدني عبدي وإذا قال \" الرحمن الرحيم \" قال أثنى علي عبدي ثم قال هذا لي وله ما بقي \" وهذا غريب من هذا الوجه . \" الكلام على ما يتعلق بهذا الحديث مما يختص بالفاتحة من وجوه \" \" أحدها\" أنه قد أطلق فيه لفظ الصلاة والمراد القراءة كقوله تعالى : \" ولا تجهر بصلاتك ولا تخافت بها وابتغ بين ذلك سبيلا \" أي بقراءتك كما جاء مصرحا به في الصحيح عن ابن عباس وهكذا قال في هذا الحديث\" قسمت الصلاة بيني وبين عبدي نصفين فنصفها لي ونصفها لعبدي ولعبدي ما سأل \" ثم بين تفصيل هذه القسمة في قراءة الفاتحة فدل على عظمة القراءة في الصلاة وأنها من أكبر أركانها إذ أطلقت العبادة وأريد بها جزء واحد منها وهو القراءة كما أطلق لفظ القراءة والمراد به الصلاة في قوله\" وقرآن الفجر إن قرآن الفجر كان مشهودا \" والمراد صلاة الفجر كما جاء مصرحا به في الصحيحين أنه يشهدها ملائكة الليل وملائكة النهار فدل هذا كله على أنه لا بد من القراءة في الصلاة وهو اتفاق من العلماء ولكن اختلفوا في مسألة نذكرها في الوجه الثاني وذلك أنه هل يتعين للقراءة في الصلاة غير فاتحة الكتاب أم تجزئ هي أو غيرها ؟ على قولين مشهورين فعند أبى حنيفة ومن وافقه من أصحابه وغيرهم : أنها لا تتعين بل مهما قرأ به من القرآن أجزأه في الصلاة واحتجوا بعموم قوله تعالى : \" فاقرءوا ما تيسر من القرآن \" وبما ثبت في الصحيحين من حديث أبي هريرة في قصة المسيء في صلاته أن رسول الله صلى الله عليه وسلم قال له \" إذا قمت إلى الصلاة فكبر ثم اقرأ ما تيسر معك من القرآن \" قالوا فأمره بقراءة ما تيسر ولم يعين له الفاتحة ولا غيرها فدل على ما قلنا . \" والقول الثاني \" أنه تتعين قراءة الفاتحة في الصلاة ولا تجزئ الصلاة بدونها وهو قول بقية الأئمة مالك والشافعي وأحمد بن حنبل وأصحابهم وجمهور العلماء واحتجوا على ذلك بهذا الحديث المذكور حيث قال صلوات الله وسلامه عليه \" من صلى صلاة لم يقرأ فيها بأم القرآن فهي خداج\" والخداج هو الناقص كما فسر به في الحديث \" غير تمام \" . واحتجوا أيضا بما ثبت في الصحيحين من حديث الزهري عن محمود بن الربيع عن عبادة بن الصامت قال : قال رسول الله صلى الله عليه وسلم \" لا صلاة لمن لم يقرأ بفاتحة الكتاب \" . وفي صحيح ابن خزيمة وابن حبان عن أبي هريرة رضي الله عنه قال : قال رسول الله صلى الله عليه وسلم\" لا تجزئ صلاة لا يقرأ فيها بأم القرآن \" والأحاديث في هذا الباب كثيرة ووجه المناظرة ههنا يطول ذكره وقد أشرنا إلى مأخذهم في ذلك رحمهم الله . ثم إن مذهب الشافعي وجماعة من أهل العلم أنه تجب قراءتها في كل ركعة . وقال آخرون : إنما تجب قراءتها في معظم الركعات وقال الحسن وأكثر البصريين : إنما تجب قراءتها في ركعة واحدة من الصلوات أخذا بمطلق الحديث \" لا صلاة لمن لم يقرأ بفاتحة الكتاب \" . وقال أبو حنيفة وأصحابه والثوري والأوزاعي : لا تتعين قراءتها بل لو قرأ بغيرها أجزأه لقوله تعالى : \" فاقرءوا ما تيسر من القرآن \" والله أعلم . وقد روى ابن ماجه من حديث أبي سفيان السعدي عن أبي نضرة عن أبي سعيد مرفوعا \" لا صلاة لمن لم يقرأ في كل ركعة بالحمد وسورة في فريضة أو غيرها \" وفي صحة هذا نظر وموضع تحرير هذا كله في كتاب الأحكام الكبير والله أعلم . \" الوجه الثالث \" هل تجب قراءة الفاتحة على المأموم ؟ فيه ثلاثة أقوال للعلماء \" أحدها \" أنه تجب عليه قراءتها كما تجب على إمامه لعموم الأحاديث المتقدمة \" والثاني \" لا تجب على المأموم قراءة بالكلية للفاتحة ولا غيرها لا في صلاة الجهرية ولا في صلاة السرية لما رواه الإمام أحمد بن حنبل في مسنده عن جابر بن عبد الله عن النبي صلى الله عليه وسلم أنه قال : \" من كان له إمام فقراءة الإمام له قراءة \" ولكن في إسناده ضعفا. ورواه مالك عن وهب بن كيسان عن جابر من كلامه وقد روي هذا الحديث من طرق ولا يصح شيء منها عن النبي صلى الله عليه وسلم والله أعلم\" والقول الثالث \" أنه تجب القراءة على المأموم في السرية لما تقدم ولا يجب ذلك في الجهرية لما ثبت في صحيح مسلم عن أبي موسى الأشعري قال : قال رسول الله صلى الله عليه وسلم \" إنما جعل الإمام ليؤتم به فإذا كبر فكبروا وإذا قرأ فأنصتوا \" وذكر بقية الحديث وهكذا رواه بقية أهل السنن أبو داود والترمذي والنسائي وابن ماجه عن أبي هريرة عن النبي صلى الله عليه وسلم أنه قال : \" وإذا قرأ فأنصتوا \" وقد صححه مسلم بن الحجاج أيضا فدل هذان الحديثان على صحة هذا القول وهو قول قديم للشافعي رحمه الله والله أعلم . ورواية عن الإمام أحمد بن حنبل رحمه الله تعالى - والغرض من ذكر هذه المسائل ههنا بيان اختصاص سورة الفاتحة بأحكام لا تتعلق بغيرها من السور . وقال الحافظ أبو بكر البزار حدثنا إبراهيم بن سعد الجوهري حدثنا غسان بن عبيد عن أبي عمران الجوني عن أنس رضي الله عنه قال : قال رسول الله صلى الله عليه وسلم : \" إذا وضعت جنبك على الفراش وقرأت فاتحة الكتاب وقل هو الله أحد فقد أمنت من كل شيء إلا الموت\" . \" تفسير الاستعاذة وأحكامها \" قال الله تعالى\" خذ العفو وأمر بالعرف وأعرض عن الجاهلين وإما ينزغنك من الشيطان نزغ فاستعذ بالله إنه سميع عليم \" وقال تعالى \" ادفع بالتي هي أحسن السيئة نحن أعلم بما يصفون وقل رب أعوذ بك من همزات الشياطين وأعوذ بك رب أن يحضرون\" وقال تعالى \" ادفع بالتي هي أحسن فإذا الذي بينك وبينه عداوة كأنه ولي حميم وما يلقاها إلا الذين صبروا وما يلقاها إلا ذو حظ عظيم وإما ينزغنك من الشيطان نزغ فاستعذ بالله إنه هو السميع العليم \" فهذه ثلاث آيات ليس لهن رابعة في معناها وهو أن الله تعالى يأمر بمصانعة العدو الإنسي والإحسان إليه ليرده عنه طبعه الطيب الأصل إلى الموالاة والمصافاة ويأمر بالاستعاذة به من العدو الشيطاني لا محالة إذ لا يقبل مصانعة ولا إحسانا ولا يبتغي غير هلاك ابن آدم لشدة العداوة بينه وبين أبيه آدم من قبل كما قال تعالى\" يا بني آدم لا يفتننكم الشيطان كما أخرج أبويكم من الجنة \" وقال تعالى \" إن الشيطان لكم عدو فاتخذوه عدوا إنما يدعو حزبه ليكونوا من أصحاب السعير \" وقال \" أفتتخذونه وذريته أولياء من دوني وهم لكم عدو بئس للظالمين بدلا \" وقد أقسم للوالد آدم عليه السلام أنه له لمن الناصحين وكذب فكيف معاملته لنا وقد قال \" فبعزتك لأغوينهم أجمعين إلا عبادك منهم المخلصين \" وقال تعالى\" فإذا قرأت القرآن فاستعذ بالله من الشيطان الرجيم إنه ليس له سلطان على الذين آمنوا وعلى ربهم يتوكلون إنما سلطانه على الذين يتولونه والذين هم به مشركون \" قالت طائفة من القراء وغيرهم يتعوذ بعد القراءة واعتمدوا على ظاهر سياق الآية ولدفع الإعجاب بعد فراغ العبادة وممن ذهب إلى ذلك حمزة فيمن نقله عنه ابن فلوفا وأبو حاتم السجستاني حكى ذلك أبو القاسم يوسف بن علي بن جنادة الهذلي المغربي في كتاب العيادة الكامل وروي عن أبي هريرة أيضا وهو غريب ونقله محمد بن عمر الرازي في تفسيره عن ابن سيرين في رواية عنه قال : وهو قول إبراهيم النخعي وداود بن علي الأصبهاني الظاهري وحكى القرطبي عن أبي بكر بن العربي عن المجموعة عن مالك رحمه الله : أن القارئ يتعوذ بعد الفاتحة واستغربه ابن العربي ! وحكى قولا ثالثا وهو الاستعاذة أولا وآخرا جمعا بين الدليلين نقله الرازي . والمشهور الذي عليه الجمهور أن الاستعاذة إنما تكون قبل التلاوة لدفع الموسوس عنها ومعنى الآية عندهم \" فإذا قرأت القرآن فاستعذ بالله من الشيطان الرجيم \" أي إذا أردت القراءة كقوله تعالى \" إذا قمتم إلى الصلاة فاغسلوا وجوهكم وأيديكم \" الآية أي إذا أردتم القيام والدليل على ذلك الأحاديث عن رسول الله صلى الله عليه وسلم بذلك . قال الإمام أحمد بن حنبل رحمه الله حدثنا محمد بن الحسن بن أنس حدثنا جعفر بن سليمان عن علي بن علي الرفاعي اليشكري عن أبي المتوكل الناجي عن أبي سعيد الخدري قال : كان رسول الله صلى الله عليه وسلم إذا قام من الليل فاستفتح صلاته وكبر قال \" سبحانك اللهم وبحمدك وتبارك اسمك وتعالى جدك ولا إله غيرك - ثم يقول - لا إله إلا الله ثلاثا ثم يقول أعوذ بالله السميع العليم من الشيطان الرجيم من همزه ونفخه ونفثه \" وقد رواه أهل السنن الأربعة من رواية جعفر بن سليمان عن علي بن علي وهو الرفاعي وقال الترمذي : هو أشهر شيء في هذا الباب وقد فسر الهمز بالموتة وهي الخنق والنفخ بالكبر والنفث بالشعر . كما رواه أبو داود وابن ماجه من حديث شعبة عن عمرو بن مرة عن عاصم العنزي عن نافع بن جبير المطعم عن أبيه قال : رأيت رسول الله صلى الله تعالى عليه وعلى آله وسلم حين دخل في الصلاة قال \" الله أكبر كبيرا ثلاثا الحمد لله كثيرا ثلاثا سبحان الله بكرة وأصيلا ثلاثا اللهم إني أعوذ بك من الشيطان من همزه ونفخه ونفثه \" قال عمر : وهمزه الموتة ونفخه الكبر ونفثه الشعر . وقال ابن ماجه : حدثنا علي بن المنذر حدثنا ابن فضيل حدثنا عطاء بن السائب عن أبي عبد الرحمن السلمي عن ابن مسعود عن النبي صلى الله عليه وسلم قال \" اللهم إني أعوذ بك من الشيطان الرجيم وهمزه ونفخه ونفثه قال : همزه الموتة ونفخه الكبر ونفثه الشعر وقال الإمام أحمد : حدثنا إسحاق بن يوسف حدثنا شريك عن يعلى بن عطاء عن رجل حدثه أنه سمع أبا أمامة الباهلي يقول : كان رسول الله صلى الله عليه وسلم إذا قام إلى الصلاة كبر ثلاثا ثم قال \" لا إله إلا الله ثلاث مرات وسبحان الله وبحمده ثلاث مرات \" ثم قال \" أعوذ بالله من الشيطان الرجيم من همزه ونفخه ونفثه \" وقال الحافظ أبو يعلى أحمد بن علي بن المثنى الموصلي في مسنده حدثنا عبد الله بن عمر بن أبان الكوفي حدثنا علي بن هشام بن البريد عن يزيد بن زياد عن عبد الملك بن عمير عن عبد الرحمن بن أبي ليلى عن أبي بن كعب رضي الله عنه قال : تلاحى رجلان عند النبي صلى الله عليه وسلم فتمزع أنف أحدهما غضبا فقال رسول الله صلى الله عليه وسلم\" إني لأعلم شيئا لو قاله لذهب عنه ما يجد : أعوذ بالله من الشيطان الرجيم \" وكذا رواه النسائي في اليوم والليلة عن يوسف بن عيسى المروزي عن الفضل بن موسى عن يزيد بن زياد بن أبي الجعدية وقد روى هذا الحديث أحمد بن حنبل عن أبي سعيد عن زائدة , وأبو داود عن يوسف بن موسى عن جرير بن عبد الحميد والترمذي والنسائي في اليوم والليلة عن بندار عن ابن مهدي عن الثوري والنسائي أيضا من حديث زائدة بن قدامة ثلاثتهم عن عبد الملك بن عمير عن عبد الرحمن بن أبي ليلى عن معاذ بن جبل رضي الله عنه قال : استب رجلان عند النبي صلى الله عليه وسلم فغضب أحدهما غضبا شديدا حتى يخيل إلي أن أحدهما يتمزع أنفه من شدة غضبه فقال النبي صلى الله عليه وسلم \" إني لأعلم كلمة لو قالها لذهب عنه ما يجد من الغضب \" فقال : ما هي يا رسول الله ؟ قال\" يقول اللهم إني أعوذ بك من الشيطان الرجيم \" قال : فجعل معاذ يأمره فأبى وجعل يزداد غضبا وهذا لفظ أبي داود وقال الترمذي : مرسل يعني أن عبد الرحمن بن أبي ليلى لم يلق معاذ بن جبل فإنه مات قبل سنة عشرين \" قلت \" وقد يكون عبد الرحمن بن أبي ليلى سمعه من أبي بن كعب كما تقدم وبلغه عن معاذ بن جبل فإن هذه القصة شهدها غير واحد من الصحابة رضي الله عنهم . قال البخاري : حدثنا عثمان بن أبي شيبة حدثنا جرير عن الأعمش عن عدي بن ثابت قال : قال سليمان بن صرد رضي الله عنه . استب رجلان عند النبي صلى الله عليه وسلم ونحن عنده جلوس فأحدهما يسب صاحبه مغضبا قد احمر وجهه فقال النبي صلى الله عليه وسلم \" إني لأعلم كلمة لو قالها لذهب عنه ما يجده لو قال أعوذ بالله من الشيطان الرجيم\" فقالوا للرجل : ألا تسمع ما يقول رسول الله صلى الله عليه وسلم قال : إني لست بمجنون وقد رواه أيضا مع مسلم وأبي داود والنسائي من طرق متعددة عن الأعمش به . وقد جاء في الاستعاذة أحاديث كثيرة يطول ذكرها ههنا وموطنها كتاب الأذكار وفضائل الأعمال والله أعلم وقد روي أن جبريل عليه السلام أول ما نزل بالقرآن على رسول الله صلى الله عليه وسلم أمره بالاستعاذة كما قال الإمام أبو جعفر بن جرير حدثنا أبو كريب حدثنا عثمان بن سعيد حدثنا بشر بن عمارة حدثنا أبو روق عن الضحاك عن عبد الله بن عباس قال : أول ما نزل جبريل على محمد صلى الله عليه وسلم قال \" يا محمد استعذ \" قال \" أستعيذ بالله السميع العليم من الشيطان الرجيم \" ثم قال \" قل بسم الله الرحمن الرحيم \" ثم قال \" اقرأ باسم ربك الذي خلق \" قال عبد الله : وهي أول سورة أنزلها الله على محمد صلى الله عليه وسلم بلسان جبريل. وهذا الأثر غريب وإنما ذكرناه ليعرف فإن في إسناده ضعفا وانقطاعا والله أعلم . \" مسألة\" وجمهور العلماء على أن الاستعاذة مستحبة ليست بمتحتمة يأثم تاركها وحكى الرازي عن عطاء بن أبي رباح وجوبها في الصلاة وخارجها كلما أراد القراءة قال : وقال ابن سيرين : إذا تعوذ مرة واحدة في عمره فقد كفى في إسقاط الوجوب واحتج الرازي لعطاء بظاهر الآية \" فاستعذ \" وهو أمر ظاهره الوجوب وبمواظبة النبي صلى الله عليه وسلم عليها ولأنها تدرأ شر الشيطان وما لا يتم الواجب إلا به فهو واجب ولأن الاستعاذة أحوط وهو أحد مسالك الوجوب وقال بعضهم : كانت واجبة على النبي صلى الله عليه وسلم دون أمته وحكي عن مالك أنه لا يتعوذ في المكتوبة ويتعوذ لقيام رمضان في أول ليلة منه . \" مسألة \" وقال الشافعي في الإملاء يجهر بالتعوذ وإن أسر فلا يضر وقال في الأم بالتخيير لأنه أسر ابن عمر وجهر أبو هريرة واختلف قول الشافعي فيما عدا الركعة الأولى هل يستحب التعوذ فيها على قولين ورجح عدم الاستحباب والله أعلم فإذا قال المستعيذ : أعوذ بالله من الشيطان الرجيم كفى ذلك عند الشافعي وأبي حنيفة وزاد بعضهم : أعوذ بالله السميع العليم وقال آخرون بل يقول : أعوذ بالله من الشيطان الرجيم إن الله هو السميع العليم قاله الثوري والأوزاعي وحكي عن بعضهم أنه يقول أستعيذ بالله من الشيطان الرجيم لمطابقة أمر الآية ولحديث الضحاك عن ابن عباس المذكور والأحاديث الصحيحة كما تقدم أولى بالاتباع من هذا والله أعلم . \" مسألة \" ثم الاستعاذة في الصلاة إنما هي للتلاوة وهو قول أبي حنيفة ومحمد . وقال أبو يوسف : بل للصلاة فعلى هذا يتعوذ المأموم وإن كان لا يقرأ ويتعوذ في العيد بعد الإحرام وقبل تكبيرات العيد والجمهور بعدها قبل القراءة ومن لطائف الاستعاذة أنها طهارة للفم مما كان يتعاطاه من اللغو والرفث وتطييب له وهو لتلاوة كلام الله وهي استعانة بالله واعتراف له بالقدرة وللعبد بالضعف والعجز عن مقاومة هذا العدو المبين الباطني الذي لا يقدر على منعه ودفعه إلا الله الذي خلقه ولا يقبل مصانعة ولا يدارى بالإحسان بخلاف العدو من نوع الإنسان كما دلت على ذلك آيات من القرآن في ثلاث من المثاني وقال تعالى \" إن عبادي ليس لك عليهم سلطان وكفى بربك وكيلا \" وقد نزلت الملائكة لمقاتلة العدو البشري فمن قتله العدو الظاهر البشري كان شهيدا ومن قتله العدو الباطني كان طريدا ومن غلبه العدو الظاهري كان مأجورا ومن قهره العدو الباطني كان مفتونا أو موزورا ولما كان الشيطان يرى الإنسان من حيث لا يراه استعاذ منه بالذي يراه ولا يراه الشيطان . \" فصل \" والاستعاذة هي الالتجاء إلى الله تعالى والالتصاق بجنابه من شر كل ذي شر والعياذة تكون لدفع الشر واللياذ يكون لطلب جلب الخير كما قاله المتنبي : يا من ألوذ به فيما أؤمله ومن أعوذ به ممن أحاذره لا يجبر الناس عظما أنت كاسره ولا يهيضون عظما أنت جابره ومعنى أعوذ بالله من الشيطان الرجيم أي أستجير بجناب الله من الشيطان الرجيم أن يضرني في ديني أو دنياي أو يصدني عن فعل ما أمرت به أو يحثني على فعل ما نهيت عنه فإن الشيطان لا يكفه عن الإنسان إلا الله ولهذا أمر تعالى بمصانعة شيطان الإنس ومداراته بإسداء الجميل إليه ليرده طبعه عما هو فيه من الأذى وأمر بالاستعاذة به من شيطان الجن لأنه لا يقبل رشوة ولا يؤثر فيه جميل لأنه شرير بالطبع ولا يكفه عنك إلا الذي خلقه وهذا المعنى في ثلاث آيات من القرآن لا أعلم لهن رابعة قوله في الأعراف \" خذ العفو وأمر بالعرف وأعرض عن الجاهلين \" فهذا فيما يتعلق بمعاملة الأعداء من البشر ثم قال \" وإما ينزغنك من الشيطان نزغ فاستعذ بالله إنه سميع عليم \" وقال تعالى في سورة قد أفلح المؤمنون \" ادفع بالتي هي أحسن السيئة نحن أعلم بما يصفون وقل رب أعوذ بك من همزات الشياطين وأعوذ بك رب أن يحضرون\" وقال تعالى في سورة حم السجدة \" ولا تستوي الحسنة ولا السيئة ادفع بالتي هي أحسن فإذا الذي بينك وبينه عداوة كأنه ولي حميم وما يلقاها إلا الذين صبروا وما يلقاها إلا ذو حظ عظيم وإما ينزغنك من الشيطان نزغ فاستعذ بالله إنه هو السميع العليم \" . الشيطان في لغة العرب مشتق من شطن إذا بعد فهو بعيد بطبعه عن طباع البشر وبعيد بفسقه عن كل خير وقيل مشتق من شاط لأنه مخلوق من نار ومنهم من يقول كلاهما صحيح في المعنى ولكن الأول أصح وعليه يدل كلام العرب . قال أمية بن أبي الصلت في ذكر ما أوتي سليمان عليه السلام : أيما شاطن عصاه عكاه ثم يلقى في السجن والأغلال فقال أيما شاطن ولم يقل أيما شائط وقال النابغة الذبياني وهو زياد بن عمرو بن معاوية بن جابر بن ضباب بن يربوع بن مرة بن سعد بن ذبيان : نأت بسعاد عنك نوى شطون فباتت والفؤاد بها رهين يقول بعدت بها طريق بعيدة وقال سيبويه العرب : تقول تشيطن فلان إذا فعل فعل الشياطين ولو كان من شاط لقالوا تشيط فالشيطان مشتق من البعد على الصحيح ولهذا يسمون كل من تمرد من جني وإنسي وحيوان شيطانا قال الله تعالى \" وكذلك جعلنا لكل نبي عدوا شياطين الإنس والجن يوحي بعضهم إلى بعض زخرف القول غرورا \" وفي مسند الإمام أحمد عن أبي ذر رضي الله عنه قال : قال رسول الله صلى الله عليه وسلم \" يا أبا ذر تعوذ بالله من شياطين الإنس والجن \" فقلت أوللإنس شياطين ؟ قال \" نعم\" وفي صحيح مسلم عن أبي ذر أيضا قال : قال رسول الله صلى الله عليه وسلم \" يقطع الصلاة المرأة والحمار والكلب الأسود \" فقلت : يا رسول الله ما بال الكلب الأسود من الأحمر والأصفر ؟ فقال :\" الكلب الأسود شيطان \" . وقال ابن وهب أخبرني هشام بن سعد عن زيد بن أسلم عن أبيه أن عمر بن الخطاب رضي الله عنه ركب برذونا فجعل يتبختر به فجعل يضربه فلا يزداد إلا تبخترا فنزل عنه وقال ما حملتموني إلا على شيطان ما نزلت عنه حتى أنكرت نفسي إسناده صحيح . والرجيم فعيل بمعنى مفعول أي أنه مرجوم مطرود عن الخير كله كما قال تعالى \" ولقد زينا السماء الدنيا بمصابيح وجعلناها رجوما للشياطين \" وقال تعالى \" إنا زينا السماء الدنيا بزينة الكواكب وحفظا من كل شيطان مارد لا يسمعون إلى الملأ الأعلى ويقذفون من كل جانب دحورا ولهم عذاب واصب إلا من خطف الخطفة فأتبعه شهاب ثاقب \" وقال تعالى \" ولقد جعلنا في السماء بروجا وزيناها للناظرين وحفظناها من كل شيطان رجيم إلا من استرق السمع فأتبعه شهاب مبين \" إلى غير ذلك من الآيات وقيل رجيم بمعنى راجم لأنه يرجم الناس بالوساوس والخبائث والأول أشهر وأصح . \" بسم الله الرحمن الرحيم \" افتتح بها الصحابة كتاب الله واتفق العلماء على أنها بعض آية من سورة النمل ثم اختلفوا : هل هي آية مستقلة في أول كل سورة أو من كل سورة كتبت في أولها أو أنها بعض آية من كل سورة أو أنها كذلك في الفاتحة دون غيرها أو أنها إنما كتبت للفصل لا أنها آية على أقوال العلماء سلفا وخلفا وذلك مبسوط في غير هذا الموضع وفي سنن أبي داود بإسناد صحيح عن ابن عباس رضي الله عنهما أن رسول الله صلى الله عليه وسلم كان لا يعرف فصل السورة حتى ينزل عليه \" بسم الله الرحمن الرحيم \" وأخرجه الحاكم أبو عبد الله النيسابوري في مستدركه أيضا وروي مرسلا عن سعيد بن جبير وفي صحيح ابن خزيمة عن أم سلمة رضي الله عنها أن رسول الله صلى الله عليه وسلم قرأ البسملة في أول الفاتحة في الصلاة وعدها آية لكنه من رواية عمر بن هارون البلخي وفيه ضعف عن ابن جريج عن ابن أبي مليكة عنها وروى له الدارقطني متابعا عن أبي هريرة مرفوعا وروى مثله عن علي وابن عباس وغيرهما وممن حكي عنه أنها آية من كل سورة إلا براءة ابن عباس وابن عمر وابن الزبير وأبو هريرة وعلي ومن التابعين عطاء وطاوس وسعيد بن جبير ومكحول والزهري وبه يقول عبد الله بن المبارك والشافعي وأحمد بن حنبل في رواية عنه وإسحاق بن راهويه وأبو عبيد القاسم بن سلام رحمهم الله وقال مالك وأبو حنيفة وأصحابهما ليست آية من الفاتحة ولا من غيرها من السور وقال الشافعي في قول في بعض طرق مذهبه هي آية من الفاتحة وليست من غيرها وعنه أنها بعض آية من أول كل سورة وهما غريبان وقال داود هي آية مستقلة في أول كل سورة لا منها وهذا رواية عن الإمام أحمد بن حنبل وحكاه أبو بكر الرازي عن أبي الحسن الكرخي وهما من أكابر أصحاب أبى حنيفة رحمهم الله . هذا ما يتعلق بكونها آية من الفاتحة أم لا . فأما الجهر بها ففرع على هذا فمن رأى أنها ليست من الفاتحة فلا يجهر بها وكذا من قال إنها آية في أولها وأما من قال بأنها من أوائل السور فاختلفوا فذهب الشافعي رحمه الله إلى أنه يجهر بها مع الفاتحة والسورة وهو مذهب طوائف من الصحابة والتابعين وأئمة المسلمين سلفا وخلفا فجهر بها من الصحابة أبو هريرة وابن عمر وابن عباس ومعاوية وحكاه ابن عبد البر والبيهقي عن عمر وعلي ونقله الخطيب عن الخلفاء الأربعة وهم أبو بكر وعمر وعثمان وعلي وهو غريب ومن التابعين عن سعيد بن جبير وعكرمة وأبي قلابة والزهري وعلي بن الحسن وابنه محمد وسعيد بن المسيب وعطاء وطاوس ومجاهد وسالم ومحمد بن كعب القرظي وعبيد وأبي بكر بن محمد بن عمرو بن حزم وأبي وائل وابن سيرين ومحمد بن المنكدر وعلي بن عبد الله بن عباس وابنه محمد ونافع مولى ابن عمر وزيد بن أسلم وعمر بن عبد العزيز والأزرق بن قيس وحبيب بن أبي ثابت وابن الشعثاء ومكحول وعبد الله بن مغفل بن مقرن زاد البيهقي وعبد الله بن صفوان ومحمد ابن الحنفية زاد ابن عبد البر وعمرو بن دينار والحجة في ذلك أنها بعض الفاتحة فيجهر فيها كسائر أبعاضها وأيضا فقد روى النسائي في سننه وابن خزيمة وابن حبان في صحيحيهما والحاكم في مستدركه عن أبي هريرة أنه صلى فجهر في قراءته بالبسملة وقال بعد أن فرغ إني لأشبهكم صلاة برسول الله صلى الله عليه وسلم وصححه الدارقطني والخطيب والبيهقي وغيرهم وروى أبو داود والترمذي عن ابن عباس أن رسول الله صلى الله عليه وسلم كان يفتح الصلاة ببسم الله الرحمن الرحيم ثم قال الترمذي وليس إسناده بذاك وقد رواه الحاكم في مستدركه عن ابن عباس قال : كان رسول الله صلى الله عليه وسلم يجهر ببسم الله الرحمن الرحيم ثم قال صحيح . وفي صحيح البخاري عن أنس بن مالك أنه سئل عن قراءة النبي صلى الله عليه وسلم فقال : كانت قراءته مدا ثم قرأ بسم الله الرحمن الرحيم يمد بسم الله ويمد الرحمن ويمد الرحيم . وفي مسند الإمام أحمد وسنن أبي داود وصحيح ابن خزيمة ومستدرك الحاكم عن أم سلمة رضي الله عنها قالت كان رسول الله صلى الله عليه وسلم يقطع قراءته\" بسم الله الرحمن الرحيم الحمد لله رب العالمين الرحمن الرحيم مالك يوم الدين \" وقال الدارقطني إسناد صحيح . وروى الإمام أبو عبد الله الشافعي والحاكم في مستدركه عن أنس بن معاوية صلى بالمدينة فترك البسملة فأنكر عليه من حضره من المهاجرين ذلك فلما صلى المرة الثانية بسمل . وفي هذه الأحاديث والآثار التي أوردناها كفاية ومقنع في الاحتجاج لهذا القول عما عداها . فأما المعارضات والروايات الغريبة وتطريقها وتعليلها وتضعيفها وتقريرها فله موضع آخر . وذهب آخرون إلى أنه لا يجهر بالبسملة في الصلاة وهذا هو الثابت عن الخلفاء الأربعة وعبد الله بن مغفل وطوائف من سلف التابعين والخلف وهو مذهب أبى حنيفة والثوري وأحمد بن حنبل . وعند الإمام مالك أنه لا يقرأ البسملة بالكلية لا جهرا ولا سرا واحتجوا بما في صحيح مسلم عن عائشة رضي الله عنها قالت : كان رسول الله صلى الله عليه وسلم يفتتح الصلاة بالتكبير والقراءة ب \" الحمد لله رب العالمين\" وبما في الصحيحين عن أنس بن مالك قال : صليت خلف النبي صلى الله عليه وسلم وأبي بكر وعمر وعثمان فكانوا يفتتحون ب \" الحمد لله رب العالمين\" ولمسلم لا يذكرون \" بسم الله الرحمن الرحيم\" في أول قراءة ولا في آخرها ونحوها في السنن عن عبد الله بن مغفل رضي الله عنه فهذه مآخذ الأئمة رحمهم الله في هذه المسألة وهي قريبة لأنهم أجمعوا على صحة صلاة من جهر بالبسملة ومن أسر ولله الحمد والمنة . فصل في فضلها قال الإمام العالم الحبر العابد أبو محمد عبد الرحمن بن أبي حاتم رحمه الله في تفسيره حدثنا جعفر بن مسافر حدثنا زيد بن المبارك الصنعاني حدثنا سلام بن وهب الجندي حدثنا أبي عن طاوس عن ابن عباس أن عثمان بن عفان سأل رسول الله صلى الله عليه وسلم عن \" بسم الله الرحمن الرحيم \" ؟ فقال\" هو اسم من أسماء الله وما بينه وبين اسم الله الأكبر إلا كما بين سواد العينين وبياضهما من القرب \" وهكذا رواه أبو بكر بن مردويه عن سليمان بن أحمد عن علي بن المبارك عن زيد بن المبارك به . وقد روى الحافظ ابن مردويه من طريقين عن إسماعيل بن عياش عن إسماعيل بن يحيى عن مسعر عن عطية عن أبي سعيد قال : قال رسول الله صلى الله عليه وسلم \" إن عيسى ابن مريم عليه السلام أسلمته أمه إلى الكتاب ليعلمه فقال له المعلم : اكتب فقال : ما أكتب ؟ قال : بسم الله قال له عيسى : وما بسم الله ؟ قال المعلم : ما أدري ؟ قال له عيسى : الباء بهاء الله والسين سناؤه والميم مملكته والله إله الآلهة والرحمن رحمن الدنيا والآخرة والرحيم رحيم الآخرة \" وقد رواه ابن جرير من حديث إبراهيم بن العلاء الملقب بابن زبريق عن إسماعيل بن عياش عن إسماعيل بن يحيى عن ابن أبي مليكة عمن حدثه عن ابن مسعود ومسعر عن عطية عن أبي سعيد . قال : قال رسول الله صلى الله عليه وسلم فذكره وهذا غريب جدا وقد يكون صحيحا إلى من دون رسول الله صلى الله عليه وسلم وقد يكون من الإسرائيليات لا من المرفوعات والله أعلم . وقد روى جويبر عن الضحاك نحوه من قبله وقد روى ابن مردويه من حديث يزيد بن خالد عن سليمان بن بريدة وفي رواية عن عبد الكريم أبي أمية عن أبى بريدة عن أبيه أن رسول الله صلى الله عليه وسلم قال \" أنزلت علي آية لم تنزل على نبي غير سليمان بن داود وغيري وهي \" بسم الله الرحمن الرحيم \" وروي بإسناده عن عبد الكريم الكبير بن المعافى بن عمران عن أبيه عن عمر بن ذر عن عطاء بن أبي رباح عن جابر بن عبد الله قال : لما نزل \" بسم الله الرحمن الرحيم \" هرب الغيم إلى المشرق وسكنت الرياح وهاج البحر وأصغت البهائم بآذانها ورجمت الشياطين من السماء وحلف الله تعالى بعزته وجلاله أن لا يسمى اسمه على شيء إلا بارك فيه . وقال وكيع عن الأعمش عن أبي وائل عن ابن مسعود قال : من أراد أن ينجيه الله من الزبانية التسعة عشر فليقرأ \" بسم الله الرحمن الرحيم \" فيجعل الله له من كل حرف منها جنة من كل واحد ذكره ابن عطية والقرطبي ووجهه ابن عطية ونصره بحديث \" لقد رأيت بضعة وثلاثين ملكا يبتدرونها \" لقول الرجل ربنا ولك الحمد حمدا كثيرا طيبا مباركا فيه من أجل أنها بضعة وثلاثون حرفا وغير ذلك . وقال الإمام أحمد بن حنبل في مسنده حدثنا محمد بن جعفر حدثنا شعبة عن عاصم قال : سمعت أبا تميمة يحدث عن رديف النبي صلى الله عليه وسلم قال : عثر بالنبي صلى الله عليه وسلم حماره فقلت : تعس الشيطان فقال النبي صلى الله عليه وسلم \" لا تقل تعس الشيطان فإنك إذا قلت تعس الشيطان تعاظم وقال بقوتي صرعته وإذا قلت بسم الله تصاغر حتى يصير مثل الذباب \" هكذا وقع في رواية الإمام أحمد وقد روى النسائي في اليوم والليلة وابن مردويه في تفسيره من حديث خاله الحذاء عن أبي تميمة وهو الهجيمي عن أبي المليح بن أسامة بن عمير عن أبيه قال : كنت رديف النبي صلى الله عليه وسلم فذكره وقال \" لا تقل هكذا"
    },
    {
      "ayah": 2,
      "surah": 1,
      "text": "القراء السبعة على ضم الدال في قوله الحمد لله هو مبتدأ وخبر وروي عن سفيان بن عيينه ورؤبة بن العجاج أنهما قالا \"الحمد لله\" بالنصب وهو على إضمار فعل وقرأ ابن أبي عبلة \"الحمد لله\" بضم الدال واللام اتباعا للثاني الأول وله شواهد لكنه شاذ وعن الحسن وزيد بن علي \"الحمد لله\" بكسر الدال اتباعا للأول الثاني قال أبو جعفر بن جرير معنى \"الحمد لله\" الشكر لله خالصا دون سائر ما يعبد من دونه ودون كل ما برأ من خلقه بما أنعم على عباده من النعم التي لا يحصيها العدد ولا يحيط بعددها غيره أحد في تصحيح الآلات لطاعته وتمكين جوارح أجسام المكلفين لأداء فرائضه مع ما بسط لهم في دنياهم من الرزق وغذاهم به من نعيم العيش من غير استحقاق منهم ذلك عليه ومع ما نبههم عليه ودعاهم إليه من الأسباب المؤدية إلى دوام الخلود في دار المقام في النعيم المقيم فلربنا الحمد على ذلك كله أولا وآخرا.  وقال ابن جرير رحمه الله: \"الحمد لله\" ثناء أثنى به على نفسه وفي ضمنه أمر عباده أن يثنوا عليه فكأنه قال قولوا \"الحمد لله\" قال وقد قيل إن قول القائل \"الحمد لله\" ثناء عليه بأسمائه الحسنى وصفاته العلى وقوله الشكر لله ثناء عليه بنعمه وأياديه. ثم شرع في رد ذلك بما حاصله أن جميع أهل المعرفة بلسان العرب يوقعون كلا من الحمد والشكر مكان الآخر وقد نقل السلمي هذا المذهب أنهما سواء عن جعفر الصادق وابن عطاء من الصوفية وقال ابن عباس \"الحمد لله\" كلمة كل شاكر وقد استدل القرطبي لابن جرير بصحة قول القائل \"الحمد لله\" شكرا. وهذا الذي ادعاه ابن جرير فيه نظر لأنه اشتهر عند كثير من العلماء من المتأخرين أن الحمد هو الثناء بالقول على المحمود بصفاته اللازمة والمتعدية والشكر لا يكون إلا على المتعدية ويكون بالجنان واللسان والأركان كما قال الشاعر: أفادتكم النعماء مني ثلاثة يدي ولساني والضمير المججبا ولكنهم اختلفوا أيهما أعم الحمد أو الشكر على قولين والتحقيق أن بينهما عموما وخصوصا فالحمد أعم من الشكر من حيث ما يقعان عليه لأنه يكون على الصفات اللازمة والمتعدية تقول حمدته لفروسيته وحمدته لكرمه وهو أخص لأنه لا يكون إلا بالقول والشكر أعم من حيث ما يقعان عليه لأنه يكون بالقول والفعل والنية كما تقدم وهو أخص لأنه لا يكون إلا على الصفات المتعدية لا يقال شكرته لفروسيته وتقول شكرته على كرمه وإحسانه إلي. هذا حاصل ما حرره بعض المتأخرين والله أعلم.  وقال أبو نصر إسماعيل بن حماد الجوهري: الحمد نقيض الذم تقول حمدت الرجل أحمده حمدا ومحمدة فهو حميد ومحمود والتحميد أبلغ من الحمد والحمد أعم من الشكر وقال في الشكر هو الثناء على المحسن بما أولاه من المعروف يقال شكرته وشكرت له وباللام أفصح. وأما المدح فهو أعم من الحمد لأنه يكون للحي وللميت وللجماد أيضا كما يمدح الطعام والمكان ونحو ذلك ويكون قبل الإحسان وبعده وعلى الصفات المتعدية واللازمة أيضا فهو أعم. ذكر أقوال السلف في الحمد قال ابن أبي حاتم حدثنا أبو معمر القطيعي حدثنا حفص عن حجاج عن ابن أبي مليكة عن ابن عباس رضي الله عنهما قال: قال عمر رضي الله عنه قد علمنا سبحان الله ولا إله إلا الله فما \"الحمد لله\"؟ فقال علي: كلمة رضيها الله لنفسه ورواه غير أبى معمر عن حفص فقال قال عمر لعلي - وأصحابه عنده - لا إله إلا الله وسبحان الله والله أكبر قد عرفناها فما \"الحمد لله\"؟ قال علي: كلمة أحبها الله تعالى لنفسه ورضيها لنفسه وأحب أن تقال وقال علي بن زيد بن جدعان عن يوسف بن مهران قال ابن عباس \"الحمد لله\" كلمة الشكر وإذا قال العبد \"الحمد لله\" قال شكرني عبدي. رواه ابن أبي حاتم وروى أيضا هو وابن جرير من حديث بشر بن عمارة عن أبي روق عن الضحاك عن ابن عباس أنه قال: \"الحمد لله\" هو الشكر لله هو الاستخذاء له والإقرار له بنعمته وهدايته وابتدائه وغير ذلك وقال كعب الأحبار \"الحمد لله\" ثناء الله وقال الضحاك \"الحمد لله\" رداء الرحمن وقد ورد الحديث بنحو ذلك.  قال ابن جرير حدثنا سعيد بن عمرو السكوني حدثنا بقية بن الوليد حدثني عيسى بن إبراهيم بن موسى بن أبي حبيب عن الحكم بن عمير وكانت له صحبة قال: قال رسول الله صلى الله عليه وسلم \"إذا قلت \"الحمد لله رب العالمين\" فقد شكرت الله فزادك\" وقد روى الإمام أحمد بن حنبل حدثنا روح حدثنا عوف عن الحسن عن الأسود بن سريع قال: قلت يا رسول الله ألا أنشدك محامد حمدت بها ربي تبارك وتعالى فقال \"أما إن ربك يحب الحمد\" ورواه النسائي عن علي بن حجر عن ابن علية عن يونس بن عبيد عن الحسن بن الأسود بن سريع به. وروى أبو عيسى الحافظ الترمذي والنسائي وابن ماجه من حديث موسى بن إبراهيم بن كثير عن طلحة بن خراش عن جابر بن عبدالله قال: قال رسول الله صلى الله عليه وسلم \"أفضل الذكر لا إله إلا الله وأفضل الدعاء الحمد لله\" وقال الترمذي حسن غريب. وروى ابن ماجه عن أنس بن مالك رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم \"ما أنعم الله على عبد نعمة فقال الحمد لله إلا كان الذي أعطى أفضل مما أخذ\" وقال القرطبي فى تفسيره وفى نوادر الأصول عن أنس عن النبي صلى الله عليه وسلم قال \"لو أن الدنيا بحذافيرها في يد رجل من أمتي ثم قال الحمد لله لكان الحمد لله أفضل من ذلك\" قال القرطبي وغيره أي لكان إلهامه الحمد لله أكثر نعمة عليه من نعم الدنيا لأن ثواب الحمد لا يفنى ونعيم الدنيا لا يبقى قال الله تعالى \"المال والبنون زينة الحياة الدنيا والباقيات الصالحات خير عند ربك ثوابا وخير أملا\" وفي سنن ابن ماجه عن ابن عمر أن رسول الله صلى الله عليه وسلم حدثهم \"أن عبدا من عباد الله قال يا رب لك الحمد كما ينبغي لجلال وجهك وعظيم سلطانك فعضلت بالملكين فلم يدريا كيف يكتبانها فصعدا إلى الله فقالا يا ربنا إن عبدا قد قال مقالة لا ندري كيف نكتبها قال الله وهو أعلم بما قال عبده: ماذا قال عبدي؟ قالا يا رب إنه قال لك الحمد يا رب كما ينبغي لجلال وجهك وعظيم سلطانك فقال الله لهما: اكتباها كما قال عبدي حتى يلقاني فأجزيه بها\"  وحكى القرطبي عن طائفة أنهم قالوا قول العبد \"الحمد لله رب العالمين\" أفضل من قوله لا إله إلا الله لاشتمال الحمد لله رب العالمين على التوحيد مع الحمد وقال آخرون لا إله إلا الله أفضل لأنها تفصل بين الإيمان والكفر وعليها يقاتل الناس حتى يقولوا لا إله إلا الله كما ثبت في الحديث المتفق عليه وفي الحديث الآخر \"أفضل ما قلت أنا والنبيون من قبلي لا إله إلا الله وحده لا شريك له\" وقد تقدم عن جابر مرفوعا \"أفضل الذكر لا إله إلا الله وأفضل الدعاء الحمد لله\" وحسنه الترمذي. والألف واللام في الحمد لاستغراق جميع أجناس الحمد وصنوفه لله تعالى كما جاء في الحديث \"اللهم لك الحمد كله ولك الملك كله وبيدك الخير كله وإليك يرجع الأمر كله\" الحديث.  والرب هو المالك المتصرف ويطلق في اللغة على السيد وعلى المتصرف للإصلاح وكل ذلك صحيح في حق الله تعالى ولا يستعمل الرب لغير الله بل بالإضافة تقول رب الدار كذا وأما الرب فلا يقال إلا لله عز وجل وقد قيل انه الاسم الأعظم.  والعالمين جمع عالم وهو كل موجود سوى الله عز وجل والعالم جمع لا واحد له من لفظه والعوالم أصناف المخلوقات في السماوات وفي البر والبحر وكل قرن منها وجيل يسمى عالما أيضا قال بشر بن عمارة عن أبي روق عن الضحاك عن ابن عباس \"الحمد لله رب العالمين\" الحمد لله الذي له الخلق كله السماوات والأرض وما فيهن وما بينهن مما نعلم ومما لا نعلم. وفي رواية سعيد بن جبير وعكرمة عن ابن عباس: رب الجن والإنس وكذلك قال سعيد بن جبير ومجاهد وابن جريج ورُوي عن علي نحوه قال ابن أبي حاتم بإسناده لا يعتمد عليه واستدل القرطبي لهذا القول بقوله تعالى \"ليكون للعالمين نذيرا\" وهم الجن والإنس قال الفراء وأبو عبيد العالم عبارة عما يعقل وهم الإنس والجن والملائكة والشياطين ولا يقال للبهائم عالم. وعن زيد بن أسلم وأبي محيصن العالم كل ما له روح ترفرف. وقال قتادة رب العالمين كل صنف عالم وقال الحافظ ابن عساكر في ترجمة مروان بن محمد وهو أحد خلفاء بني أمية وهو يعرف بالجعد ويلقب بالحمار أنه قال خلق الله سبعة عشر ألف عالم أهل السماوات وأهل الأرض ما لم واحد وسائرهم لا يعلمهم إلا الله عز وجل. وقال أبو جعفر الرازي عن الربيع بن أنس عن أبى العالية فى قوله تعالى \"رب العالمين\" قال الإنس عالم والجن عالم وما سوى ذلك ثمانية عشر ألف أو أربعة عشر ألف عالم - هو يشك - الملائكة على الأرض وللأرض أربع زوايا فى كل زاوية ثلاثة آلاف عالم وخمسمائة عالم خلقهم الله لعبادته ورواه ابن جرير وابن أبي حاتم. وهذا كلام غريب يحتاج مثله إلى دليل صحيح.  وقال ابن أبي حاتم حدثنا أبي حدثنا هشام بن خالد حدثنا الوليد بن مسلم حدثنا الفرات يعني ابن الوليد عن معتب بن سمي عن سبيع يعني الحميري في قوله تعالى \"رب العالمين\" قال العالمين ألف أمة فستمائة في البحر وأربعمائة في البر وحكى مثله عن سعيد بن المسيب وقد روى نحو هذا مرفوعا كما قال الحافظ أبو يعلى أحمد بن علي بن المثنى في مسنده: حدثنا محمد بن المثنى حدثنا عبيد بن واقد القيسي أبو عباد حدثني محمد بن عيسى بن كيسان حدثنا محمد بن المنكدر عن جابر بن عبدالله قال: قل الجراد في سنة من سني عمر التي ولي فيها فسأل عنه فلم يخبر بشيء فاغتم لذلك فأرسل راكبا يضرب إلى اليمن وآخر إلى الشام وآخر إلى العراق يسأل هل رئي من الجراد شيء أم لا قال فأتاه الراكب الذي من قبل اليمن بقبضة من جراد فألقاها بين يديه فلما رآها كبر ثم قال سمعت رسول الله صلى الله عليه وسلم يقول \"خلق الله ألف أمة ستمائة في البحر وأربعمائة في البر فأول شيء يهلك من هذه الأمم الجراد فإذا هلك تتابعت مثل النظام إذا قطع سلكه\" محمد بن عيسى هذا وهو الهلالي ضعيف وحكى البغوي عن سعيد بن المسيب أنه قال لله ألف عالم ستمائه في البحر وأربعمائة في البر وقال وهب بن منبه لله ثمانية عشر ألف عالم الدنيا عالم منها وقال مقاتل العوالم ثمانون ألفا وقال كعب الأحبار لا يعلم عدد العوالم إلا الله عز وجل نقله كله البغوي وحكى القرطبي عن أبى سعيد الخدري أنه قال إن لله أربعين ألف عالم الدنيا من شرقها إلى مغربها عالم واحد منها. وقال الزجاج العالم كل ما خلق الله في الدنيا والآخرة قال القرطبي وهذا هو الصحيح أنه شامل لكل العالمين كقوله \"قال فرعون وما رب العالمين قال رب السماوات والأرض وما بينهما إن كنتم موقنين\" والعالم مشتق من العلامة\"قلت\" لأنه علم دال على وجود خالقه وصانعه ووحدانيته كما قال ابن المعتز: فيا عجبا كيف يعصى الإله أم كيف يجحده الجاحد وفي كل شيء له آيـــــة تدل على أنه واحـــد."
    },
    {
      "ayah": 3,
      "surah": 1,
      "text": "وقوله تعالى \"الرحمن الرحيم\" تقدم الكلام عليه في البسملة بما أغنى عن الإعادة قال القرطبي إنما وصف نفسه بالرحمن الرحيم بعد قوله رب العالمين ليكون من باب قرن الترغيب بعد الترهيب كما قال تعالى \"نبئ عبادي أني أنا الغفور الرحيم وأن عذابي هو العذاب الأليم\" وقوله تعالى \"إن ربك لسريع العقاب وإنه لغفور رحيم\" قال فالرب فيه ترهيب والرحمن الرحيم ترغيب وفي صحيح مسلم عن أبي هريرة قال: قال رسول الله صلى الله عليه وسلم \"لو يعلم المؤمن ما عند الله من العقوبة ما طمع في جنته أحد ولو يعلم الكافر ما عند الله من الرحمة ما قنط من رحمته أحد\"."
    },
    {
      "ayah": 4,
      "surah": 1,
      "text": "قرأ بعض القراء \"ملك يوم الدين\" وقرأ آخرون \"مالك\" وكلاهما صحيح متواتر في السبع ويقال ملك بكسر اللام وبإسكانها ويقال مليك أيضا وأشبع نافع كسرة الكاف فقرأ \"ملكي يوم الدين\" وقد رجح كلا من القراءتين مرجحون من حيث المعنى وكلاهما صحيحة حسنة ورجح الزمخشري ملك لأنها قراءة أهل الحرمين ولقوله \"لمن الملك اليوم\" و \" قوله الحق وله الملك\" وحكي عن أبي حنيفة أنه قرأ \"ملك يوم الدين\" على أنه فعل وفاعل ومفعول وهذا شاذ غريب جدا وقد روى أبو بكر بن أبي داود فى ذلك شيئا غريبا حيث قال حدثنا أبو عبدالرحمن الأزدي حدثنا عبد الوهاب بن عدي بن الفضل عن أبي المطرف عن ابن شهاب أنه بلغه أن رسول الله صلى الله عليه وسلم وأبا بكر وعمر وعثمان ومعاوية وابنه يزيد بن معاوية كانوا يقرؤن \"مالك يوم الدين\" قال ابن شهاب وأول من أحدث \"ملك\" مروان \"قلت\" مروان عنده علم بصحة ما قرأه لم يطلع عليه ابن شهاب والله أعلم. وقد روي من طرق متعددة أوردها ابن مردويه أن رسول الله صلى الله عليه وسلم كان يقرؤها \"مالك يوم الدين\" ومالك مأخوذ من الملك كما قال تعالى: \"إنا نحن نرث الأرض ومن عليها وإلينا يرجعون\" وقال: \"قل أعوذ برب الناس ملك الناس\" وملك مأخوذ من الملك كما قال تعالى: \"لمن الملك اليوم لله الواحد القهار\" وقال: \"قوله الحق وله الملك\" وقال: \"الملك يومئذ الحق للرحمن وكان يوما على الكافرين عسيرا\" وتخصيص الملك بيوم الدين لا ينفيه عما عداه لأنه قد تقدم الإخبار بأنه رب العالمين وذلك عام في الدنيا والآخرة وإنما أضيف إلى يوم الدين لأنه لا يدعي أحد هنالك شيئا ولا يتكلم أحد إلا بإذنه كما قال تعالى: \"يوم يقوم الروح والملائكة صفا لا يتكلمون إلا من أذن له الرحمن وقال صوابا\" وقال تعالى: \"وخشعت الأصوات للرحمن فلا تسمع إلا همسا\" وقال تعالى: \"يوم يأتي لا تكلم نفس إلا بإذنه فمنهم شقي وسعيد\" وقال الضحاك عن ابن عباس \"مالك يوم الدين\" يقول لا يملك أحد معه في ذلك اليوم حكما كملكهم في الدنيا قال ويوم الدين يوم الحساب للخلائق وهو يوم القيامة يدينهم بأعمالهم إن خيرا فخير وإن شرا فشر إلا من عفا عنه وكذلك قال غيره من الصحابة والتابعين والسلف وهو ظاهر وحكي ابن جرير عن بعضهم أنه ذهب إلى تفسير \"مالك يوم الدين\" أنه القادر على إقامته ثم شرع يضعفه والظاهر أنه لا منافاة بين هذا القول وما تقدم وأن كلا من القائلين هذا القول وبما قبله يعترف بصحة القول الآخر ولا ينكره ولكن السياق أدل على المعنى الأول من هذا كما قال تعالى: \"الملك يومئذ الحق للرحمن وكان يوما على الكافرين عسيرا\" والقول الثاني يشبه قوله تعالى: \"ويوم يقول كن فيكون\" والله أعلم. والملك في الحقيقة هو الله عز وجل قال الله تعالى \"هو الله الذي لا إله إلا هو الملك القدوس السلام\" وفي الصحيحين عن أبي هريرة رضي الله عنه مرفوعا \"أخنع اسم عند الله رجل تسمى بملك الأملاك ولا مالك إلا الله\" وفيهما عنه عن رسول الله صلى الله عليه وسلم قال: \"يقبض الله الأرض ويطوي السماء بيمينه ثم يقول أنا الملك أين ملوك الأرض؟ أين الجبارون؟ أين المتكبرون؟ \" وفي القرآن العظيم \"لمن الملك اليوم لله الواحد القهار\" فأما تسمية غيره في الدنيا بملك فعلى سبيل المجاز كما قال تعالى: \"إن الله قد بعث لكم طالوت ملكا\" \"وكان وراءهم ملك\" \"إذ جعل فيكم أنبياء وجعلكم ملوكا\" وفي الصحيحين \"مثل الملوك على الأسرة\". والدين الجزاء والحساب كما قال تعالى: \"يومئذ يوفيهم الله دينهم الحق\" وقال: \"أئنا لمدينون\" أي مجزيون محاسبون وفي الحديث \"الكيس من دان نفسه وعمل لما بعد الموت\" أي حاسب نفسه لنفسه كما قال عمر رضي الله عنه حاسبوا أنفسكم قبل أن تحاسبوا وزنوا أنفسكم قبل أن توزنوا وتأهبوا للعرض الأكبر على من لا تخفى عليه أعمالكم \"يومئذ تعرضون لا تخفى منكم خافية\"."
    },
    {
      "ayah": 5,
      "surah": 1,
      "text": "قرأ السبعة والجمهور بتشديد الياء من \"إياك\" وقرأ عمرو بن فايد بتخفيفها مع الكسر وهي قراءة شاذة مردودة لأن إيا ضوء الشمس وقرأ بعضهم \"إياك\" بفتح الهمزة وتشديد الياء وقرأ بعضهم هياك بالهاء بدل الهمزة كما قال الشاعر: فهياك والأمر الذي إن تراحبت موارده ضاقت عليك مصادره ونستعين بفتح النون أول الكلمة في قراءة الجميع سوى يحيى بن وثاب والأعمش فإنهما كسراها وهي لغة بني أسد وربيعة وبني تميم  والعبادة في اللغة من الذل يقال طريق معبد وبعير معبد أي مذلل وفي الشرع عبارة عما يجمع كمال المحبة والخضوع والخوف. وقدم المفعول وهو إياك وكرر للاهتمام والحصر أي لا نعبد إلا إياك ولا نتوكل إلا عليك وهذا هو كمال الطاعة. والدين كله يرجع إلى هذين المعنيين. وهذا كما قال بعض السلف الفاتحة سر القرآن وسرها هذه الكلمة \"إياك نعبد وإياك نستعين\" فالأول تبرؤ من الشرك والثاني تبرؤ من الحول والقوة والتفويض إلى الله عز وجل وهذا المعنى في غير آية من القرآن كما قال تعالى: \"فاعبده وتوكل عليه وما ربك بغافل عما تعملون\" \"قل هو الرحمن آمنا به وعليه توكلنا\" \"رب المشرق والمغرب لا إله إلا هو فاتخذه وكيلا\" وكذلك هذه الآية الكريمة \"إياك نعبد وإياك نستعين\" وتحول الكلام من الغيبة إلى المواجهة بكاف الخطاب وهو مناسبة لأنه لما أثنى على الله فكانه اقترب وحضر بين يدي الله تعالى فلهذا قال: \"إياك نعبد وإياك نستعين\" وفي هذا دليل على أن أول السورة خبر من الله تعالى بالثناء على نفسه الكريمة بجميل صفاته الحسنى وإرشاد لعباده بأن يثنوا عليه بذلك ولهذا لا تصح صلاة من لم يقل ذلك وهو قادر عليه كما جاء في الصحيحين عن عبادة بن الصامت قال: قال رسول الله صلى الله عليه وسلم \"لا صلاة لمن لم يقرأ بفاتحة الكتاب\". وفي صحيح مسلم من حديث العلاء بن عبدالرحمن مولى الحرقة عن أبيه عن أبي هريره عن رسول الله صلى الله عليه وسلم \"يقول الله تعالى قسمت الصلاة بيني وبين عبدي نصفين فنصفها لي ونصفها لعبدي ولعبدي ما سأل إذا قال العبد \"الحمد لله رب العالمين\" قال الله حمدني عبدي وإذا قال \"الرحمن الرحيم\" قال الله أثنى علي عبدي فإذا قال: \"مالك يوم الدين\" قال الله مجدني عبدي وإذا قال \"إياك نعبد وإياك نستعين\" قال هذا بيني وبين عبدي ولعبدي ما سأل فإذا قال \"إهدنا الصراط المستقيم صراط الذين أنعمت عليهم غير المغضوب عليهم ولا الضالين\" قال هذا لعبدي ولعبدي ما سأل\"  وقال الضحاك عن ابن عباس رضي الله عنهما \"إياك نعبد\" يعني إياك نوحد ونخاف ونرجوك يا ربنا لا غيرك \"وإياك نستعين\" على طاعتك وعلى أمورنا كلها وقال قتادة \"إياك نعبد وإياك نستعين\" يأمركم أن تخلصوا له العبادة وأن تستعينوه على أموركم وإنما قدم \"إياك نعبد\" على \"وإياك نستعين\" لأن العبادة له هي المقصودة والاستعانة وسيلة إليها والاهتمام والحزم تقديم ما هو الأهم فالأهم والله أعلم. فإن قيل: فما معنى النون في قوله تعالى \"إياك نعبد وإياك نستعين\" فإن كانت للجمع فالداعي واحد وإن كانت للتعظيم فلا يناسب هذا المقام؟ وقد أجيب بأن المراد من ذلك الإخبار عن جنس العباد والمصلي فرد منهم ولا سيما إن كان في جماعة أو إمامهم فأخبر عن نفسه وعن إخوانه المؤمنين بالعبادة التي خلقوا لأجلها وتوسط لهم بخير ومنهم من قال يجوز أن تكون للتعظيم كأن العبد قيل له إذا كنت داخل العبادة فأنت شريف وجاهك عريض فقل \"إياك نعبد وإياك نستعين\" وإن كنت خارج العبادة فلا تقل نحن ولا فعلنا ولو كنت في مائة ألف أو ألف ألف لاحتياج الجميع إلى الله عز وجل وفقرهم إليه. ومنهم من قال إياك نعبد ألطف في التواضع من إياك عبدنا لما في الثاني من تعظيم نفسه من جعله نفسه وحده أهلا لعبادة الله تعالى الذي لا يستطيع أحد أن يعبده حق عبادته ولا يثني عليه كما يليق به والعبادة مقام عظيم يشرف به العبد لانتسابه إلى جناب الله تعالى كما قال بعضهم: لا تدعني إلا بياعبدها فإنه أشرف أسمائي  وقد سمى الله رسوله صلى الله عليه وسلم بعبده في أشرف مقاماته فقال: \"الحمد لله الذي أنزل على عبده الكتاب\" \"وأنه لما قام عبدالله يدعوه\" \"سبحان الذي أسرى بعبده ليلا\" فسماه عبدا عند إنزاله عليه وعند قيامه في الدعوة وإسرائه به وأرشده إلى القيام بالعبادة في أوقات يضيق صدره من تكذيب المخالفين حيث يقول \"ولقد نعلم أنك يضيق صدرك بما يقولون فسبح بحمد ربك وكن من الساجدين واعبد ربك حتى يأتيك اليقين\" وقد حكى الرازي في تفسيره عن بعضهم أن مقام العبودية أشرف من مقام الرسالة لكون العبادة تصدر من الخلق إلى الحق والرسالة من الحق إلى الخلق قال ولأن الله يتولى مصالح عبده والرسول يتولى مصالح أمته وهذا القول خطأ والتوجيه أيضا ضعيف لا حاصل له ولم يتعرض له الرازي بتضعيف ولا رد. وقال بعض الصوفية العبادة إما لتحصيل ثواب أو درء عقاب قالوا وهذا ليس بطائل إذ مقصوده تحصيل مقصوده وإما للتشريف بتكاليف الله تعالى وهذا أيضا عندهم ضعيف بل العالي أن يعبد الله لذاته المقدسة الموصوفة بالكمال قالوا ولهذا يقول المصلي: أصلي لله ولو كان لتحصيل الثواب ودرء العقاب لبطلت الصلاة وقد رد ذلك عليهم آخرون وقالوا: كون العبادة لله عز وجل لا ينافي أن يطلب معها ثوابا ولا أن يدفع عذابا كما قال ذلك الأعرابي: أما إني لا أحسن دندنتك ولا دندنة معاذ إنما أسأل الله الجنة وأعوذ به من النار فقال النبي صلى الله عليه وسلم \"حولها ندندن\"."
    },
    {
      "ayah": 6,
      "surah": 1,
      "text": "اهدنا الصراط المستقيمقراءة الجمهور بالصاد وقرئ السراط وقرئ بالزاي قال الفراء وهي لغة بني عذرة وبني كلب . لما تقدم الثناء على المسئول تبارك وتعالى ناسب أن يعقب بالسؤال كما قال\" فنصفها لي ونصفها لعبدي ولعبدي ما سأل \" وهذا أكمل أحوال السائل أن يمدح مسئوله ثم يسأل حاجته وحاجة إخوانه المؤمنين بقوله : \" اهدنا الصراط المستقيم \" لأنه أنجح للحاجة وأنجع للإجابة ولهذا أرشد الله إليه لأنه الأكمل وقد يكون السؤال بالإخبار عن حال السائل واحتياجه كما قال موسى عليه السلام \" رب إني لما أنزلت إلي من خير فقير \" وقد يتقدمه مع ذلك وصف مسئول كقول ذي النون \" لا إله إلا أنت سبحانك إني كنت من الظالمين \" وقد يكون بمجرد الثناء على المسئول كقول الشاعر : أأذكر حاجتي أم قد كفاني حياؤك إن شيمتك الحياء إذا أثنى عليك المرء يوما كفاه من تعرضه الثناء والهداية ههنا الإرشاد والتوفيق وقد تعدى الهداية بنفسها كما هنا\" اهدنا الصراط المستقيم \" فتضمن معنى ألهمنا أو وفقنا أو ارزقنا أو اعطنا \" وهديناه النجدين\" أي بينا له الخير والشر وقد تعدى بإلى كقوله تعالى : \" اجتباه وهداه إلى صراط مستقيم \" \" فاهدوهم إلى صراط الجحيم \" وذلك بمعنى الإرشاد والدلالة وكذلك قوله : \" وإنك لتهدي إلى صراط مستقيم \" وقد تعدى باللام كقول أهل الجنة \" الحمد لله الذي هدانا لهذا \" أي وفقنا لهذا وجعلنا له أهلا . وأما الصراط المستقيم فقال الإمام أبو جعفر بن جرير أجمعت الأمة من أهل التأويل جميعا على أن الصراط المستقيم هو الطريق الواضح الذي لا اعوجاج فيه وذلك في لغة جميع العرب فمن ذلك قول جرير بن عطية الخطفي : أمير المؤمنين على صراط إذا اعوج الموارد مستقيم قال والشواهد على ذلك أكثر من أن تحصر قال ثم تستعير العرب الصراط فتستعمله في كل قول وعمل ووصف باستقامة أو اعوجاج فتصف المستقيم باستقامته والمعوج باعوجاجه . ثم اختلفت عبارات المفسرين من السلف والخلف في تفسير الصراط وإن كان يرجع حاصلها إلى شيء واحد وهو المتابعة لله وللرسول فروي أنه كتاب الله قال ابن أبي حاتم حدثنا الحسن بن عرفة حدثني يحيى بن يمان عن حمزة الزيات عن سعيد وهو ابن المختار الطائي عن ابن أخي الحارث الأعور عن الحارث الأعور عن علي بن أبي طالب رضي الله عنه قال : قال رسول الله صلى الله عليه وسلم \" الصراط المستقيم كتاب الله \" وكذلك رواه ابن جرير من حديث حمزة ابن حبيب الزيات وقد تقدم في فضائل القرآن فيما رواه أحمد والترمذي من رواية الحارث الأعور عن علي مرفوعا \" وهو حبل الله المتين وهو الذكر الحكيم وهو الصراط المستقيم\" وقد روي موقوفا على علي رضي الله عنه وهو أشبه والله أعلم وقال الثوري عن منصور عن أبي وائل عن عبد الله قال الصراط المستقيم كتاب الله. وقيل هو الإسلام قال الضحاك عن ابن عباس قال : قال جبريل لمحمد عليهما السلام \" قل يا محمد اهدنا الصراط المستقيم \" يقول ألهمنا الطريق الهادي وهو دين الله الذي لا اعوجاج فيه وقال ميمون بن مهران عن ابن عباس في قوله تعالى : \" اهدنا الصراط المستقيم \" قال ذاك الإسلام وقال إسماعيل بن عبد الرحمن السدي الكبير عن أبي مالك وعن أبي صالح عن ابن عباس وعن مرة الهمداني عن ابن مسعود وعن ناس من أصحاب النبي \" اهدنا الصراط المستقيم\" قالوا هو الإسلام وقال عبد الله بن محمد بن عقيل عن جابر اهدنا الصراط المستقيم قال هو الإسلام أوسع مما بين السماء والأرض . وقال ابن الحنفية في قوله تعالى : \" اهدنا الصراط المستقيم \" قال هو دين الله الذي لا يقبل من العباد غيره وقال عبد الرحمن بن زيد بن أسلم اهدنا الصراط المستقيم قال هو الإسلام وفي هذا الحديث الذي رواه الإمام أحمد في مسنده حيث قال حدثنا الحسن بن سوار أبو العلاء حدثنا ليث يعني ابن سعد عن معاوية بن صالح أن عبد الرحمن بن جبير بن نفير حدثه عن أبيه عن النواس بن سمعان عن رسول الله صلى الله عليه وسلم قال : \" ضرب الله مثلا صراطا مستقيما وعلى جنبتي الصراط سوران فيهما أبواب مفتحة وعلى الأبواب ستور مرخاة وعلى باب الصراط داع يقول يا أيها الناس ادخلوا الصراط جميعا ولا تعوجوا وداع يدعو من فوق الصراط فإذا أراد الإنسان أن يفتح شيئا من تلك الأبواب قال ويحك لا تفتحه - فإنك إن تفتحه تلجه - فالصراط الإسلام والسوران حدود الله والأبواب المفتحة محارم الله وذلك الداعي على رأس الصراط كتاب الله والداعي من فوق الصراط واعظ الله في قلب كل مسلم \" . وهكذا رواه ابن أبي حاتم وابن جرير من حديث الليث بن سعد به. ورواه الترمذي والنسائي جميعا عن علي بن حجر عن بقية عن بجير بن سعد عن خالد بن معدان عن جبير بن نفير عن النواس بن سمعان به . وهو إسناد حسن صحيح والله أعلم . وقال مجاهد \" اهدنا الصراط المستقيم \" قال الحق وهذا أشمل ولا منافاة بينه وبين ما تقدم وروى ابن أبي حاتم وابن جرير من حديث أبي النضر هاشم بن القاسم أنا حمزة بن المغيرة عن عاصم الأحول عن أبي العالية \" اهدنا الصراط المستقيم \" قال هو النبي صلى الله عليه وسلم وصاحباه من بعده قال عاصم فذكرنا ذلك للحسن فقال صدق أبو العالية ونصح . وكل هذه الأقوال صحيحة وهي متلازمة فإن من اتبع النبي صلى الله عليه وسلم واقتدى باللذين من بعده أبي بكر وعمر فقد اتبع الحق ومن اتبع الحق فقد اتبع الإسلام ومن اتبع الإسلام فقد اتبع القرآن وهو كتاب الله وحبله المتين وصراطه المستقيم فكلها صحيحة يصدق بعضها بعضا ولله الحمد وقال الطبراني حدثنا محمد بن الفضل السقطي حدثنا إبراهيم بن مهدي المصيصي حدثنا يحيى بن زكريا بن أبي زائدة عن الأعمش عن أبي وائل عن عبد الله قال الصراط المستقيم الذي تركنا عليه رسول الله صلى الله عليه وسلم . ولهذا قال الإمام أبو جعفر بن جرير رحمه الله والذي هو أولى بتأويل هذه الآية عندي أعني \" اهدنا الصراط المستقيم\" - أن يكون معنيا به وفقنا للثبات على ما ارتضيته ووفقت له من أنعمت عليه من عبادك من قول وعمل وذلك هو الصراط المستقيم لأن من وفق لما وفق له من أنعم الله عليهم من النبيين والصديقين والشهداء والصالحين فقد وفق للإسلام وتصديق الرسل والتمسك بالكتاب والعمل بما أمره الله به والانزجار عما زجره عنه واتباع منهاج النبي صلى الله عليه وسلم ومنهاج الخلفاء الأربعة وكل عبد صالح وكل ذلك من الصراط المستقيم. \" فإن قيل \" فكيف يسأل المؤمن الهداية في كل وقت من صلاة وغيرها وهو متصف بذلك ؟ فهل هذا من باب تحصيل الحاصل أم لا ؟ فالجواب أن لا ولولا احتياجه ليلا ونهارا إلى سؤال الهداية لما أرشده الله تعالى إلى ذلك فإن العبد مفتقر في كل ساعة وحالة إلى الله تعالى في تثبيته على الهداية ورسوخه فيها وتبصره وازدياده منها واستمراره عليها فإن العبد لا يملك لنفسه نفعا ولا ضرا إلا ما شاء الله فأرشده تعالى إلى أن يسأله في كل وقت أن يمده بالمعونة والثبات والتوفيق فالسعيد من وفقه الله تعالى لسؤاله فإنه تعالى قد تكفل بإجابة الداعي إذا دعاه ولا سيما المضطر المحتاج المفتقر إليه آناء الليل وأطراف النهار وقد قال تعالى : \" يا أيها آمنوا آمنوا بالله ورسوله والكتاب الذي نزل على رسوله والكتاب الذي أنزل من قبل \" الآية فقد أمر الذين آمنوا بالإيمان وليس ذلك من باب تحصيل الحاصل لأن المراد الثبات والاستمرار والمداومة على الأعمال المعينة على ذلك والله أعلم . وقال تعالى آمرا لعباده المؤمنين أن يقولوا \" ربنا لا تزغ قلوبنا بعد إذ هديتنا وهب لنا من لدنك رحمة إنك أنت الوهاب \" وقد كان الصديق رضي الله عنه يقرأ بهذه الآية في الركعة الثالثة من صلاة المغرب بعد الفاتحة سرا فمعنى قوله تعالى : \" اهدنا الصراط المستقيم \" استمر بنا عليه ولا تعدل بنا إلى غيره ."
    },
    {
      "ayah": 7,
      "surah": 1,
      "text": "قد تقدم الحديث فيما إذا قال العبد \"اهدنا الصراط المستقيم\" إلى آخرها أن الله يقول \"هذا لعبدي ولعبدي ما سأل\" وقوله تعالى: \"صراط الذين أنعمت عليهم\" مفسر للصراط المستقيم وهو بدل منه عند النحاة ويجوز أن يكون عطف بيان والله أعلم. والذين أنعم الله عليهم هم المذكورون في سورة النساء حيث قال تعالى: \"ومن يطع الله والرسول فأولئك مع الذين أنعم الله عليهم من النبيين والصديقين والشهداء والصالحين وحسن أولئك رفيقا ذلك الفضل من الله وكفى بالله عليما\" وقال الضحاك عن ابن عباس \"صراط الذين أنعمت عليهم\" بطاعتك وعبادتك من ملائكتك وأنبيائك والصديقين والشهداء والصالحين وذلك نظير ما قال ربنا تعالى: \"ومن يطع الله والرسول فأولئك مع الذين أنعم الله عليهم\" الآية. وقال أبو جعفر الرازي عن الربيع بن أنس \"صراط الذين أنعمت عليهم\" قال هم النبيون. وقال ابن جريح عن ابن عباس هم المؤمنون وكذا قال مجاهد وقال وكيع هم المسلمون وقال عبدالرحمن بن زيد بن أسلم هم النبي صلى الله عليه وسلم ومن معه والتفسير المتقدم عن ابن عباس رضي الله عنهما أعم وأشمل والله أعلم.    وقوله تعالى: \"غير المغضوب عليهم ولا الضالين\" قرأ الجمهور غير بالجر على النعت قال الزمخشري وقرئ بالنصب على الحال وهي قراءة رسول الله صلى الله عليه وآله وسلم وعمر بن الخطاب ورويت عن ابن كثير وذو الحال الضمير في عليهم والعامل أنعمت عليهم ممن تقدم وصفهم ونعتهم وهم أهل الهداية والاستقامة والطاعة لله ورسله وامتثال أوامره وترك نواهيه وزواجره غير صراط المغضوب عليهم وهم الذين فسدت إرادتهم فعلموا الحق وعدلوا عنه ولا صراط الضالين وهم الذين فقدوا العلم فهم هائمون في الضلالة لا يهتدون إلى الحق. وأكد الكلام بلا ليدل على أن ثَمَّ مسلكين قاصدين وهما طريقة اليهود والنصارى    وقد زعم بعض النحاة أن غير ههنا استثنائية فيكون على هذا منقطعا لاستثنائهم من المنعم عليهم وليسوا منهم وما أوردناه أولى لقول الشاعر:    كأنك من جمال بني أقيش  يقعقع عند رجليه بشن    أي كأنك جمل من جمال بني أقيش فحذف الموصوف واكتفى بالصفة وهكذا غير المغضوب عليهم أي غير صراط المغضوب عليهم اكتفى بالمضاف إليه عن ذكر المضاف وقد دل عليه سياق الكلام وهو قوله تعالى \"اهدنا الصراط المستقيم صراط الذين أنعمت عليهم\" ثم قال تعالى \"غير المغضوب عليهم\" ومنهم من زعم أن لا فى قوله تعالى \"ولا الضالين\" زائدة وأن تقدير الكلام عنده غير المغضوب عليهم والضالين واستشهد ببيت معجاج. في بئر لا حور السعي وما شعر أي في بئر حور والصحيح ما قدمناه ولهذا روى أبو عبيدالقاسم بن سلام في كتاب فضائل القرآن عن أبي معاوية عن الأعمش عن إبراهيم عن الأسود عن عمر بن الخطاب رضي الله عنه أنه كان يقرأ غير المغضوب عليهم وغير الضالين وهذا إسناد صحيح وكذلك حُكي عن أبي بن كعب أنه قرأ كذلك وهو محمول على أنه صدر منهما على وجه التفسير. فيدل على ما قلناه من أنه إنما جيء لتأكيد النفي لئلا يتوهم أنه معطوف على الذين أنعمت عليهم والفرق بين الطريقتين ليجتنب كل واحد منهما فإن طريقة أهل الإيمان مشتملة على العلم بالحق والعمل به واليهود فقدوا العمل والنصارى فقدوا العلم ولهذا كان الغضب لليهود والضلال للنصارى لأن من علم وترك استحق الغضب بخلاف من لم يعلم والنصارى لما كانوا قاصدين شيئا لكنهم لا يهتدون إلى طريقة لأنهم لم يأتوا الأمر من بابه وهو اتباع الحق وضلوا    وكل من اليهود والنصاري ضال مغضوب عليه لكن أخص أوصاف اليهود الغضب كما قال تعالى عنهم \"من لعنه الله وغضب عليه\" وأخص أوصاف النصارى الضلال كما قال تعالى عنهم \"قد ضلوا من قبل وأضلوا كثيرا وضلوا عن سواء السبيل\" وبهذا جاءت الأحاديث والآثار وذلك واضح بين فيما قال الإمام أحمد حدثنا محمد بن جعفر ثنا شعبة قال سمعت سماك بن حرب يقول سمعت عباد بن حبيش يحدث عن عدي بن حاتم قال جاءت خيل رسول الله صلى الله عليه وسلم فأخذوا عمتي وناسا فلما أتوا بهم إلى رسول الله صلى الله عليه وسلم صفوا له فقالت يا رسول الله: نأى الوافد وانقطع الولد وأنا عجوز كبيرة ما بي من خدمة فمن علي من الله عليك قال \"من وافدك؟ \" قالت عدي بن حاتم قال \"الذي فر من الله ورسوله\" قالت فمن علي فلما رجع ورجل إلى جنبه ترى أنه علي قال سليه حملانا فسألته فأمر لها قال فأتتني فقالت لقد فعلت فعلة ما كان أبوك يفعلها فإنه أتاه فلان فأصاب منه وأتاه فلان فأصاب منه فأتيته فإذا عنده امرأة وصبيان وذكر قربهم من النبي صلى الله عليه وسلم قال فعرفت أنه ليس بملك كسرى ولا قيصر فقال \"يا عدي ما أفرك؟ أن يقال لا إله إلا الله؟ فهل من إله إلا الله ما أفرك أن يقال الله أكبر؟ فهل شيء أكبر من الله عز وجل\"؟ قال فأسلمت فرأيت وجهه استبشر وقال \"إن المغضوب عليهم اليهود وإن الضالين النصارى\" وذكر الحديث ورواه الترمذي من حديث سماك بن حرب وقال حسن غريب لا نعرفه إلا من حديثه. \"قلت\" وقد رواه حماد بن سلمة عن سماك عن مري بن قطري عن عدي بن حاتم قال: سألت رسول الله صلى الله عليه وسلم عن قوله تعالى \"غير المغضوب عليهم\" قال \"هم اليهود\" \"ولا الضالين\" قال: \"النصارى هم الضالون\" وهكذا رواه سفيان بن عيينة عن إسماعيل بن أبي خالد عن الشعبي عن عدي بن حاتم به    وقد روي حديث عدي هذا من طرق وله ألفاظ كثيرة يطول ذكرها وقال عبدالرزاق أنا معمر عن بديل العقيلي أخبرني عبدالله بن شقيق أنه أخبره من سمع رسول الله صلى الله عليه وسلم وهو بوادي القرى على فرسه وسأله رجل من بنى القين فقال يا رسول الله من هؤلاء قال \"المغضوب عليهم - وأشار إلى اليهود - والضالون هم النصارى\" وقد رواه الجريري وعروة وخالد الحذاء عن عبدالله بن شقيق فأرسلوه ولم يذكروا من سمع النبي صلى الله عليه وسلم ووقع في رواية عروة تسمية عبدالله بن عمرو فالله أعلم وقد روى ابن مردويه من حديث إبراهيم بن طهمان عن بديل بن ميسرة عن عبدالله بن شقيق عن أبي ذر قال سألت رسول الله صلى الله عليه وسلم عن المغضوب عليهم قال \"اليهود\" قلت الضالين قال \"النصارى\" وقال السدي عن أبي مالك وعن أبي صالح عن ابن عباس وعن مرة الهمذاني عن ابن مسعود وعن أناس من أصحاب النبي صلى الله عليه وسلم غير المغضوب عليهم هم اليهود ولا الضالين هم النصارى وقال الضحاك وابن جريج عن ابن عباس \"غير المغضوب عليهم\" اليهود \"ولا الضالين\" النصارى وكذا قال الربيع بن أنس و عبدالرحمن بن زيد بن أسلم وغير واحد وقال ابن أبي حاتم    ولا أعلم بين المفسرين في هذا اختلافا وشاهد ما قاله هؤلاء الأئمة من أن اليهود مغضوب عليهم والنصارى ضالون الحديث المتقدم وقوله تعالى في خطابه مع بني إسرائيل في سورة البقرة \"بئس ما اشتروا به أنفسهم أن يكفروا بما أنزل الله بغيا أن ينزل الله من فضله على من يشاء من عباده فباءوا بغضب على غضب وللكافرين عذاب مهين\" وقال في المائدة \"قل هل أنبئكم بشر من ذلك مثوبة عند الله من لعنه الله وغضب عليه وجعل منهم القردة والخنازير وعبد الطاغوت أولئك شر مكانا وأضل عن سواء السبيل\" وقال تعالى \"لعن الذين كفروا من بني إسرائيل على لسان داود وعيسى ابن مريم ذلك بما عصوا وكانوا يعتدون كانوا لا يتناهون عن منكر فعلوه لبئس ما كانوا يفعلون\" وفي السيرة عن زيد بن عمرو بن نفيل أنه لما خرج هو وجماعة من أصحابه إلى الشام يطلبون الدين الحنيف قالت له اليهود إنك لن تستطيع الدخول معنا حتى تأخذ بنصيبك من غضب الله فقال أنا من غضب الله أفر وقالت له النصارى إنك لن تستطيع الدخول معنا حتى تأخذ بنصيبك من سخط الله فقال لا أستطيعه فاستمر على فطرته وجانب عبادة الأوثان ودين المشركين ولم يدخل مع أحد من اليهود ولا النصارى وأما أصحابه فتنصروا ودخلوا في دين النصرانية لأنهم وجدوه أقرب من دين اليهود إذ ذاك وكان منهم ورقة بن نوفل حتى هداه الله بنبيه لما بعثه آمن بما وجد من الوحي رضي الله عنه \"   مسألة\" والصحيح من مذاهب العلماء أنه يغتفر الإخلال بتحرير ما بين الضاد والظاء لقرب مخرجيهما وذلك أن الضاد مخرجها من أول حافة اللسان وما يليها من الأضراس ومخرج الظاء من طرف اللسان وأطراف الثنايا العليا ولأن كلا من الحرفين من الحروف المجهورة ومن الحروف الرخوة ومن الحروف المطبقة فلهذا كله اغتفر استعمال أحدهما مكان الآخر لمن لا يميز ذلك والله أعلم وأما حديث \"أنا أفصح من نطق بالضاد\" فلا أصل له والله أعلم.    \"فصل\"    اشتملت هذه السورة الكريمة وهي سبع آيات على حمد الله وتمجيده والثناء عليه بذكر أسمائه الحسنى المستلزمة لصفاته العليا وعلى ذكر المعاد وهو يوم الدين وعلى إرشاده عبيده إلى سؤاله والتضرع إليه والتبرئ من حولهم وقوتهم وإلى إخلاص العبادة له وتوحده بالألوهية تبارك وتعالى وتنزيهه أن يكون له شريك أو نظير أو مماثل وإلى سؤالهم إياه الهداية إلى الصراط المستقيم وهو الدين القويم وتثبيتهم عليه حتى يقضي لهم بذلك إلى جواز الصراط الحسية يوم القيامة المفضي بهم إلى جنات النعيم في جوار النبيين والصديقين والشهداء والصالحين واشتملت على الترغيب في الأعمال الصالحة ليكونوا مع أهلها يوم القيامة والتحذير من مسالك الباطل لئلا يحشروا مع سالكيها يوم القيامة وهم المغضوب عليهم والضالون وما أحسن ما جاء إسناد الإنعام إليه في قوله تعالى \"صراط الذين أنعمت عليهم غير المغضوب عليهم\" وحذف الفاعل في الغضب في قوله تعالى \"غير المغضوب عليهم\" وإن كان هو الفاعل لذلك في الحقيقة كما قال تعالى \"ألم تر إلى الذين تولوا قوما غضب الله عليهم\" الآية.    وكذلك إسناد الضلال إلى من قام به وإن كان هو الذي أضلهم بقدره كما قال تعالى \"من يهد الله فهو المهتد ومن يضلل فلن تجد له وليا مرشدا\" وقال \"من يضلل الله فلا هادي له ويذرهم في طغيانهم يعمهون\" إلى غير ذلك من الآيات الدالة على أنه سبحانه هو المنفرد بالهداية والإضلال لا كما تقول الفرقة القدرية ومن حذا حذوهم من أن العباد هم الذين يختارون ذلك ويفعلونه ويحتجون على بدعتهم بمتشابه من القرآن ويتركون ما يكون فيه صريحا في الرد عليهم وهذا حال أهل الضلال والغي وقد ورد في الحديث الصحيح. \"إذا رأيتم الذين يتبعون ما تشابه منه فأولئك الذين سمى الله فاحذروهم\" يعني في قوله تعالى \"فأما الذين فى قلوبهم زيغ فيتبعون ما تشابه منه ابتغاء الفتنة وابتغاء تأويله\" فليس بحمد الله لمبتدع في القرآن حجة صحيحة لأن القرآن جاء ليفصل الحق من الباطل مفرقا بين الهدى والضلال وليس فيه تناقض ولا اختلاف لأنه من عند الله تنزيل من حكيم حميد.    \"فصل\"    يستحب لمن يقرأ الفاتحة أن يقول بعدها آمين مثل يس ويقال أمين بالقصر أيضا ومعناه اللهم استجب والدليل على استحباب التأمين ما رواه الإمام أحمد وأبو داود والترمذي عن وائل بن حجر قال: سمعت النبي صلى الله عليه وسلم قرأ \"غير المغضوب عليهم ولا الضالين\" فقال \"آمين\" مد بها صوته ولأبي داود رفع بها صوته وقال الترمذي هذا حديث حسن ورُوي عن علي وابن مسعود وغيرهم. وعن أبي هريرة قال: كان رسول الله صلى الله عليه وسلم إذا تلا \"غير المغضوب عليهم ولا الضالين\" قال \"آمين\" حتى يسمع من يليه من الصف الأول رواه أبو داود وابن ماجه وزاد فيه: فيرتج بها المسجد. والدارقطني وقال: هذا إسناد حسن. وعن بلال أنه قال: يا رسول الله لا تسبقني بآمين رواه أبو داود ونقل أبو نصر القشيري عن الحسن وجعفر الصادق أنهما شددا الميم من آمين مثل \"آمين البيت الحرام\" قال أصحابنا وغيرهم ويستحب ذلك لمن هو خارج الصلاة ويتأكد في حق المصلي وسواء كان منفردا أو إماما أو مأموما وفي جميع الأحوال لما جاء في الصحيحين عن أبي هريرة رضي الله عنه أن رسول الله صلى الله عليه وسلم \"إذا أمن الإمام فأمنوا فإنه من وافق تأمينه تأمين الملائكة غفر له ما تقدم من ذنبه\" ولمسلم أن رسول الله صلى الله عليه وسلم قال \" إذا قال أحدكم في الصلاة آمين والملائكة في السماء آمين فوافقت إحداهما الأخرى غفر له ما تقدم من ذنبه\" قيل بمعنى من وافق تأمينه تأمين الملائكة في الزمان وقيل في الإجابة وقيل في صفة الإخلاص.    وفي صحيح مسلم عن أبي موسى مرفوعا \"إذا قال - يعني الإمام - ولا الضالين فقولوا آمين يجبكم الله\" وقال جوبير عن الضحاك عن ابن عباس قال: قلت يا رسول الله ما معنى آمين؟ قال \"رب افعل\" وقال الجوهري معنى آمين كذلك فليكن. وقال الترمذي معناه لا تخيب رجاءنا. وقال الأكثرون معناه اللهم استجب لنا.    وحكى القرطبي عن مجاهد وجعفر الصادق وهلال بن يساف أن آمين اسم من أسماء الله تعالى. وروى عن ابن عباس مرفوعا ولا يصح قاله أبو بكر بن العربي المالكي.    وقال أصحاب مالك لا يؤمن الإمام ومؤمن المأموم لما رواه مالك عن سمي عن أبي صالح عن أبي هريرة أن رسول الله صلى الله عليه وسلم قال \"وإذا قال - يعني الإمام - ولا الضالين فقولوا آمين\" الحديث واستأنسوا أيضا بحديث أبي موسى عند مسلم \"وإذا قرأ ولا الضالين فقولوا آمين\" وقد قدمنا في المتفق عليه\" إذا أمن الإمام فأمنوا\" وأنه عليه الصلاة والسلام كان يؤمن إذا قرأ \"غير المغضوب عليهم ولا الضالين\" وقد اختلف أصحابنا في الجهر بالتأمين للمأموم في الجهرية وحاصل الخلاف أن الإمام إن نسي التأمين جهر المأموم به قولا واحدا وإن أمن الإمام جهرا فالجديد أنه لا يجهر المأموم وهو مذهب أبي حنيفة ورواية عن مالك لأنه ذكر من الأذكار فلا يجهر به كسائر أذكار الصلاة. والقديم أنه يجهر به وهو مذهب الإمام أحمد بن حنبل والرواية الأخرى عن مالك لما تقدم \"حتى يرتج المسجد\" ولنا قول آخر ثالث أنه إن كان المسجد صغيرا لم يجهر المأموم لأنهم يسمعون قراءة الإمام وإن كان كبيرا جهر ليبلغ التأمين من في أرجاء المسجد والله أعلم.    وقد روى الإمام أحمد في مسنده عن عائشة أن رسول الله صلى الله عليه وسلم ذكرت عنده اليهود فقال \"إنهم لن يحسدونا على شيء كما يحسدونا على الجمعة التي هدانا الله لها وضلوا عنها وعلى القبلة التي هدانا الله لها وضلوا عنها وعلى قولنا خلف الإمام آمين\" ورواه ابن ماجه ولفظه \"ما حسدتكم اليهود على شيء ما حسدتكم على قول آمين فأكثروا من قول آمين\" وفي إسناده طلحة بن عمرو وهو ضعيف وروى ابن مردويه عن أبي هريرة أن رسول الله صلى الله عليه وسلم قال \"آمين خاتم رب العالمين على عباده المؤمنين\" وعن أنس قال: قال رسول الله صلى الله عليه وآله وسلم \"أعطيت آمين في الصلاة وعند الدعاء لم يعط أحد قبلي إلا أن يكون موسى كان موسى يدعو وهرون يؤمن فاختموا الدعاء بآمين فإن الله يستجيبه لكم\" \"قلت\" ومن هنا نزع بعضهم في الدلالة بهذه الآية الكريمة وهي قوله تعالى \"وقال موسى ربنا إنك آتيت فرعون وملأه زينة وأموالا في الحياة الدنيا ربنا ليضلوا عن سبيلك ربنا اطمس على أموالهم واشدد على قلوبهم فلا يؤمنوا حتى يروا العذاب الأليم قال قد أجيبت دعوتكما فاستقيما ولا تتبعان سبيل الذين لا يعلمون\" فذكر الدعاء عن موسى وحده ومن سياق الكلام ما يدل على أن هارون أمن فنزل منزلة من دعا لقوله تعالى \"قد أجيبت دعوتكما\" فدل ذلك على أن من أمن على دعاء فكأنما قاله فلهذا قال من قال إن المأموم لا يقرأ لأن تأمينه على قراءة الفاتحة بمنزلة قراءتها ولهذا جاء في الحديث \"من كان له إمام فقراءة الإمام له قراءة\" رواه أحمد في مسنده وكان بلال يقول لا تسبقني بآمين يا رسول الله. فدل هذا المنزع على أن المأموم لا قراءة عليه في الجهرية والله أعلم.    ولهذا قال ابن مردويه حدثنا أحمد بن الحسن حدثنا عبدالله بن محمد بن سلام حدثنا إسحق حدثنا جرير عن ليث عن ابن أبي سليم عن كعب عن أبي هريرة قال: قال رسول الله صلى الله عليه وسلم \"إذا قال الإمام \"غير المغضوب عليهم ولا الضالين\" فقال آمين فوافق آمين أهل الأرض أهل السماء غفر الله للعبد ما تقدم من ذنبه ومثل من لا يقول آمين كمثل رجل غزا مع قوم فاقترعوا فخرجت سهامهم ولم يخرج سهمه فقال لِم لَم يخرج سهمي؟ فقيل: إن لم تقل آمين \"."
    }
  ]
}
