{
  "ayahs": [
    {
      "ayah": 1,
      "surah": 10,
      "text": "أما الحروف المقطعة في أوائل السور فقد تقدم الكلام عليها في أوائل سورة البقرة وقال أبو الضحى عن ابن عباس في قوله تعالى \"الر\" أي أنا الله أرى. وكذلك قال الضحاك وغيره \"تلك آيات الكتاب الحكيم\" أي هذه آيات القرآن المحكم المبين وقال مجاهد \"الر تلك آيات الكتاب الحكيم\" وقال الحسن التوراة والزبور وقال قتادة \"تلك آيات الكتاب\" قال الكتب التي كانت قبل القرآن. وهذا القول لا أعرف وجهه ولا معناه."
    },
    {
      "ayah": 10,
      "surah": 10,
      "text": "\"دعواهم فيها سبحانك اللهم وتحيتهم فيها سلام وآخر دعواهم أن الحمد لله رب العالمين\" أي هذا حال أهل الجنة. قال ابن جريج أخبر أن قوله \"دعواهم فيها سبحانك اللهم\" قال إذا مر بهم الطير يشتهونه قالوا سبحانك اللهم وذلك دعواهم فيأتيهم الملك بما يشتهونه فيسلم عليهم فيردون عليه فذلك قوله \"وتحيتهم فيها سلام\" قال فإذا أكلوا حمدوا الله ربهم فذلك قوله \"وآخر دعواهم أن الحمد لله رب العالمين\" وقال مقاتل بن حيان: إذا أراد أهل الجنة أن يدعوا بالطعام قال أحدهم \"سبحانك اللهم\" قال فيقوم على أحدهم عشرة آلاف خادم مع كل خادم صحفة من ذهب فيها طعام ليس في الأخرى قال فيأكل منهن كلهن وقال سفيان الثوري: إذا أراد أحدهم أن يدعو بشيء قال \"سبحانك اللهم\" وهذه الآية فيها شبه من قوله \"تحيتهم يوم يلقونه سلام\" الآية. وقوله \"لا يسمعون فيها لغوا ولا تأثيما إلا قيلا سلاما سلاما\" وقوله \"سلام قولا من رب رحيم\" وقوله \"والملائكة يدخلون عليهم من كل باب سلام عليكم\" الآية وقوله \"وآخر دعواهم أن الحمد للّه رب العالمين\" هذا فيه دلالة على أنه تعالى هو المحمود أبدا المعبود على طول المدى ولهذا حمد نفسه عند ابتداء خلقه واستمراره وفي ابتداء كتابه وعند ابتداء تنزيله حيث يقول تعالى \"الحمد للّه الذي أنزل على عبده الكتاب\" \"الحمد للّه الذي خلق السموات والأرض\" إلى غير ذلك من الأحوال التي يطول بسطها وأنه المحمود في الأولى والآخرة في الحياة الدنيا وفي الآخرة في جميع الأحوال ولهذا جاء في الحديث \"إن أهل الجنة يلهمون التسبيح والتحميد كما يلهمون النفس\" وإنما يكون ذلك كذلك لما يرون من تزايد نعم الله عليهم فتكرر وتعاد وتزداد فليس لها انقضاء ولا أمد فلا إله إلا هو ولا رب سواه."
    },
    {
      "ayah": 100,
      "surah": 10,
      "text": "ولهذا قال تعالى \"وما كان لنفس أن تؤمن إلا بإذن الله ويجعل الرجس\" وهو الخبال والضلال \"علي الذين لا يعقلون\" أي حجج الله وأدلته وهو العادل في كل ذلك في هداية من هدى وإضلال من ضل."
    },
    {
      "ayah": 101,
      "surah": 10,
      "text": "يرشد تعالى عباده إلى التفكر في آلائه وما خلق الله في السموات والأرض من الآيات الباهرة لذوي الألباب مما في السموات من كواكب نيرات ثوابت وسيارات; والشمس والقمر والليل والنهار واختلافهما وإيلاج أحدهما في الآخر حتى يطول هذا ويقصر هذا ثم يقصر هذا ويطول هذا وارتفاع السماء واتساعها وحسنها وزينتها وما أنزل الله منها من مطر فأحيا به الأرض بعد موتها وأخرج فيها من أفانين الثمار والزروع والأزاهير وصنوف النبات وما ذرأ فيها من دواب مختلفة الأشكال والألوان والمنافع وما فيها من جبال وسهول وقفار وعمران وخراب; وما في البحر من العجائب والأمواج وهو مع هذا مسخر مذلل للسالكين يحمل سفنهم ويجري بها برفق بتسخير القدير لا إله إلا هو ولا رب سواه. وقوله \"وما تغني الآيات والنذر عن قوم لا يؤمنون\" أي وأي شيء تغني الآيات السماوية والأرضية والرسل بآياتها وحججها وبراهينها الدالة على صدقها عن قوم لا يؤمنون كقوله \"إن الذين حقت عليهم كلمة ربك لا يؤمنون\" الآية."
    },
    {
      "ayah": 102,
      "surah": 10,
      "text": "أي فهل ينتظر هؤلاء المكذبون لك يا محمد من النقمة والعذاب إلا مثل أيام الله في الذين خلوا من قبلهم من الأمم الماضية المكذبة لرسلهم \"قل فانتظروا إني معكم من المنتظرين ثم ننجي رسلنا والذين آمنوا\" أي ونهلك المكذبين بالرسل."
    },
    {
      "ayah": 103,
      "surah": 10,
      "text": "\"كذلك حقا علينا ننجي المؤمنين\" أي حقا أوجبه الله على نفسه الكريمة كقوله \"كتب ربكم على نفسه الرحمة\" وكما جاء في الصحيحين عن رسول الله صلي الله عليه وسلم أنه قال \"إن الله كتب كتابا فهو عنده فوق العرش: إن رحمتي سبقت غضبي\"."
    },
    {
      "ayah": 104,
      "surah": 10,
      "text": "يقول تعالى لرسوله محمد صلي الله عليه وسلم قل يا أيها الناس إن كنتم في شك من صحة ما جئتكم به من الدين الحنيف الذي أوحاه الله إليه فأنا لا أعبد الذين تعبدون من دون الله ولكن أعبد الله وحده لا شريك له وهو الذي يتوفاكم كما أحياكم ثم إليه مرجعكم فإن كانت آلهتكم التي تدعون من دون الله حقا فأنا لا أعبدها فادعوها فلتضرني فإنها لا تضر ولا تنفع وإنما الذي بيده الضر والنفع هو الله وحده لا شريك له وأمرت أن أكون من المؤمنين."
    },
    {
      "ayah": 105,
      "surah": 10,
      "text": "وقوله \"وأن أقم وجهك للدين حنيفا \" الآية; أي أخلص العبادة لله وحده حنيفا أي منحرفا عن الشرك ولهذا قال \"ولا تكونن من المشركين\" وهو معطوف على قوله \"وأمرت أن أكون من المؤمنين\"."
    },
    { "ayah": 106, "surah": 10, "text": "لا يوجد تفسير لهذه الأية" },
    {
      "ayah": 107,
      "surah": 10,
      "text": "وقوله \"وإن يمسسك الله بضر\" الآية فيه بيان لأن الخير والشر والنفع والضر إنما هو راجع إلى الله تعالى وحده لا يشاركه في ذلك أحد فهو الذي يستحق العبادة وحده لا شريك له روى الحافظ ابن عساكر في ترجمة صفوان بن سليم من طريق عبدالله بن وهب أخبرني يحيى بن أيوب عن عيسى بن موسى عن صفوان بن سليم عن أنس بن مالك أن رسول الله صلي الله عليه وسلم قال \"اطلبوا الخير دهركم كله وتعرضوا لنفحات ربكم فإن لله نفحات من رحمته يصيب بها من يشاء من عباده واسألوه أن يستر عوراتكم ويؤمن روعاتكم\" ثم رواه من طريق الليث عن عيسى بن موسى عن صفوان عن رجل من أشجع عن أبي هريرة مرفوعا بمثله سواء وقوله \"وهو الغفور الرحيم\" أي لمن تاب إليه وتوكل عليه ولو من أي ذنب كان حتى من الشرك به فإنه يتوب عليه."
    },
    {
      "ayah": 108,
      "surah": 10,
      "text": "يقول تعالى آمرا لرسوله صلي الله عليه وسلم أن يخبر الناس أن الذي جاءهم به من عند الله هو الحق الذي لا مرية فيه ولا شك فيه فمن اهتدى به واتبعه فإنما يعود نفع ذلك الإتباع على نفسه ومن ضل عنه فإنما يرجع وبال ذلك عليه \"وما أنا عليكم بوكيل\" أي وما أنا موكل بكم حتى تكونوا مؤمنين وإنما أنا نذير لكم والهداية على الله تعالى."
    },
    {
      "ayah": 109,
      "surah": 10,
      "text": "وقوله \"واتبع ما يوحى إليك واصبر\" أي تمسك بما أنزل الله عليك وأوحاه إليك واصبر على مخالفة من خالفك من الناس \"حتى يحكم الله\" أي يفتح بينك وبينهم \"وهو خير الحاكمين\" أي خير الفاتحين بعدله وحكمته."
    },
    {
      "ayah": 11,
      "surah": 10,
      "text": "يخبر تعالى عن حلمه ولطفه بعباده أنه لا يستجيب لهم إذا دعوا على أنفسهم أو أموالهم أو أولادهم في حال ضجرهم وغضبهم وأنه يعلم منهم عدم القصد بالشر إلى إرادة ذلك فلهذا لا يستجيب لهم والحالة هذه لطفا ورحمة كما يستجيب لهم إذا دعوا لأنفسهم أو لأموالهم أو لأولادهم بالخير والبركة والنماء ولهذا قال \"ولو يعجل الله للناس الشر استعجالهم بالخير لقضي إليهم أجلهم\" الآية أي لو استجاب لهم كل ما دعوه به في ذلك لأهلكهم ولكن لا ينبغي الإكثار من ذلك كما جاء في الحديث الذي رواه الحافظ أبو بكر البزار في مسنده: حدثنا محمد بن معمر حدثنا يعقوب بن محمد حدثنا حاتم بن إسماعيل حدثنا يعقوب بن مجاهد أبو جزرة عن عبادة بن الوليد حدثنا جابر قال: قال رسول الله صلي الله عليه وسلم \"لا تدعوا على أنفسكم لا تدعوا على أولادكم لا تدعوا على أموالكم لا توافقوا من الله ساعة فيها إجابة فيستجيب لكم\" ورواه أبو داود من حديث حاتم بن إسماعيل به. وقال البزار وتفرد به عبادة بن الوليد بن عبادة بن الصامت الأنصاري لم يشاركه أحد فيه وهذا كقوله تعالى \"ويدع الإنسان بالشر دعاءه بالخير\" الآية. وقال مجاهد في تفسير هذه الآية \"ولو يعجل الله للناس الشر استعجالهم بالخير\" الآية هو قول الإنسان لولده أو ماله إذا غضب عليه: اللهم لا تبارك فيه والعنه. فلو يعجل لهم الاستجابة في ذلك كما يستجاب لهم في الخير لأهلكهم."
    },
    {
      "ayah": 12,
      "surah": 10,
      "text": "يخبر تعالى عن الإنسان وضجره وقلقه إذا مسه الشر \"وإذا مسه الشر فذو دعاء عريض\" أي كثير وهما في معنى واحد وذلك لأنه إذا أصابته شدة قلق لها وجزع منها وأكثر الدعاء عند ذلك فدعا الله في كشفها ورفعها عنه في حال اضطجاعه وقعوده وقيامه وفي جميع أحواله فإذا فرج الله شدته وكشف كربته أعرض ونأى بجانبه وذهب كأنه ما كان به من ذلك شيء \"مر كأن لم يدعنا إلى ضر مسه\" ثم ذم تعالى من هذه صفته وطريقته فقال \"كذلك زين للمسرفين ما كانوا يعملون\" فأما من رزقه الله الهداية والسداد والتوفيق والرشاد فإنه مستثنى من ذلك كقوله تعالى \"إلا الذين صبروا وعملوا الصالحات\" وكقول رسول الله صلي الله عليه وسلم \"عجبا لأمر المؤمن لا يقضي الله له قضاء إلا كان خيرا له: إن أصابته ضراء فصبر كأن خيرا له وإن أصابته سراء فشكر كان خيرا له وليس ذلك لأحد إلا للمؤمن\"."
    },
    {
      "ayah": 13,
      "surah": 10,
      "text": "أخبر تعالى عما أحل بالقرون الماضية في تكذيبهم الرسل فيما جاءوهم به من البينات والحجج الواضحات."
    },
    {
      "ayah": 14,
      "surah": 10,
      "text": "ثم استخلف الله هؤلاء القوم من بعدهم وأرسل إليهم رسولا لينظر طاعتهم له واتباعهم رسوله وفي صحيح مسلم من حديث أبي نضرة عن أبي سعيد قال: قال رسول الله صلي الله عليه وسلم \"إن الدنيا حلوة خضرة وإن الله مستخلفكم فيها فناظر كيف تعملون فاتقوا الدنيا واتقوا النساء فإن أول فتنة بني إسرائيل كانت من النساء\" وقال ابن جرير: حدثني المثنى حدثنا زيد بن عوف أبو ربيعة بهذا أنبأنا حماد عن ثابت البناني عن عبدالرحمن بن أبي ليلى أن عوف بن مالك قال لأبي بكر: رأيت فيما يرى النائم كأن سببا دلي من السماء فانتشط رسول الله صلي الله عليه وسلم ثم أعيد فانتشط أبو بكر ثم ذرع الناس حول المنبر ففضل عمر بثلاثة أذرع حول المنبر فقال عمر: دعنا من رؤياك لا أرب لنا فيها فلما استخلف عمر قال: يا عوف رؤياك؟ قال وهل لك في رؤياي من حاجة أو لم تنتهرني؟ قال ويحك إني كرهت أن تنعى لخليفة رسول الله صلي الله عليه وسلم نفسه فقص عليه الرؤيا حتى إذا بلغ ذرع الناس إلى المنبر بهذه الثلاث الأذرع قال: أما إحداهن فإنه كان خليفة وأما الثانية فإنه لا يخاف في الله لومة لائم وأما الثالثة فإنه شهيد. قال: فقال يقول الله تعالى \"ثم جعلناكم خلائف في الأرض من بعدهم لننظر كيف تعملون\" فقد استخلفت يا ابن أم عمر فانظر كيف تعمل؟ وأما قوله فإني لا أخاف في الله لومة لائم فيما شاء الله وأما قوله شهيد فأنى لعمر الشهادة والناس مطيفون به؟."
    },
    {
      "ayah": 15,
      "surah": 10,
      "text": "يخبر تعالى عن تعنت الكفار من مشركي قريش الجاحدين المعرضين عنه أنهم إذا قرأ عليهم الرسول صلي الله عليه وسلم كتاب الله وحجته الواضحة قالوا له ائت بقرآن غير هذا أي رد هذا وجئنا بغيره من نمط آخر أو بدله إلى وضع آخر قال الله تعالى لنبيه صلى الله عليه وآله وسلم \"قل ما يكون لي أن أبدله من تلقاء نفسي\" أي ليس هذا إلي إنما أنا عبد مأمور ورسول مبلغ عن الله \"إن أتبع إلا ما يوحى إلي إني أخاف إن عصيت ربي عذاب يوم عظيم\"."
    },
    {
      "ayah": 16,
      "surah": 10,
      "text": "ثم قال محتجا عليهم في صحة ما جاءهم به.\"قل لو شاء الله ما تلوته عليكم ولا أدراكم به\" أي هذا إنما جئتكم به عن إذن الله لي في ذلك ومشيئته وإرادته والدليل على أني لست أتقوله من عندي ولا أفتريته أنكم عاجزون عن معارضته وأنكم تعلمون صدقي وأمانتي منذ نشأت بينكم إلى حين بعثني الله عز وجل لا تنتقدون علي شيئا تغمصوني به ولهذا قال: \"فقد لبثت فيكم عمرا من قبله أفلا تعقلون\" أي أفليس لكم عقول تعرفون بها الحق من الباطل ولهذا لما سأل هرقل ملك الروم أبا سفيان ومن معه فيما سأله من صفة النبي صلي الله عليه وسلم قال هرقل لأبي سفيان هل كنتم تتهمونه بالكذب قبل أن يقول ما قال؟ قال أبو سفيان فقلت لا وكان أبو سفيان إذ ذاك رأس الكفرة وزعيم المشركين ومع هذا اعترف بالحق \"والفضل ما شهدت به الأعداء\" فقال له هرقل: فقد أعرف أنه لم يكن ليدع الكذب على الناس ثم يذهب فيكذب على الله وقال جعفر بن أبي طالب للنجاشي ملك الحبشة: بعث الله فينا رسولا نعرف صدقه ونسبه وأمانته وقد كانت مدة مقامه عليه السلام بين أظهرنا قبل النبوة أربعين سنة وعن سعيد بن المسيب ثلاثا وأربعين سنة والصحيح المشهور الأول."
    },
    {
      "ayah": 17,
      "surah": 10,
      "text": "يقول تعالى لا أحد أظلم ولا أعتى ولا أشد إجراما \"ممن افترى على الله كذبا\" وتقول على الله وزعم أن الله أرسله ولم يكن كذلك فليس أحد أكبر جرما ولا أعظم ظلما من هذا ومثل هذا لا يخفى أمره على الأغبياء فكيف يشتبه حال هذا بالأنبياء؟ فإنه من قال هذه المقالة صادقا أو كاذبا فلا بد أن الله ينصب عليه من الأدلة على بره أو فجوره ما هو أظهر من الشمس; فإن الفرق بين محمد صلي الله عليه وسلم وبين مسيلمة الكذاب لمن شاهدهما أظهر من الفرق بين وقت الضحى وبين نصف الليل في حندس الظلماء فمن شيم كل منهما وأفعاله وكلامه يستدل من له بصيرة على صدق محمد صلي الله عليه وسلم وكذب مسيلمة الكذاب وسجاح والأسود العنسي قال عبدالله بن سلام لما قدم رسول الله صلي الله عليه وسلم المدينة انجفل الناس فكنت فيمن انجفل فلما رأيته عرفت أن وجهه ليس بوجه رجل كذاب قال فكان أول ما سمعته يقول \"يا أيها الناس أفشوا السلام وأطعموا الطعام وصلوا الأرحام وصلوا بالليل والناس نيام تدخلون الجنة بسلام\" ولما قدم وفد ضمام بن ثعلبة على رسول الله صلي الله عليه وسلم في قومه بني سعد بن بكر قال لرسول الله صلي الله عليه وسلم فيما قال له: من رفع هذه السماء؟ قال \"الله\" قال ومن نصب هذه الجبال؟ قال \"الله\" قال ومن سطح هذه الأرض؟ قال \"الله\" قال: فبالذي رفع هذه السماء ونصب هذه الجبال وسطح هذه الأرض آلله أرسلك إلى الناس كلهم؟ قال \"اللهم نعم\" ثم سأله عن الصلاة والزكاة والحج والصيام ويحلف عند كل واحدة هذه اليمين ويحلف له رسول الله صلي الله عليه وسلم فقال له: صدقت والذي بعثك بالحق لا أزيد على ذلك ولا أنقص فاكتفي هذا الرجل بمجرد هذا وقد أيقن بصدقه صلوات الله وسلامه عليه بما رأى وشاهد من الدلائل الدالة عليه وقال حسان بن ثابت: لو لم تكن فيه آيات مبينة كانت بديهته تأتيك بالخبر وأما مسيلمة فمن شاهده من ذوي البصائر علم أمره لا محالة بأقواله الركيكة التي ليست بفصيحة وأفعاله غير الحسنة بل القبيحة وقرآنه الذي يخلد به في النار يوم الحسرة والفضيحة وكم من فرق بين قوله تعالى \"الله لا إله إلا هو الحي القيوم لا تأخذه سنة ولا نوم\" إلى آخرها وبين قول مسيلمة قبحه الله ولعنه: يا ضفدع بنت ضفدعين نقي كم تنقين لا الماء تكدرين ولا الشارب تمنعين. وقوله قبحه الله: لقد أنعم الله على الحبلى إذ أخرج منها نسمة تسعى من بين صفاق وحشا. وقوله خلده الله في نار جهنم وقد فعل: الفيل وما أدراك ما الفيل له خرطوم طويل وقوله أبعده الله عن رحمته: والعاجنات عجنا والخابزات خبزا واللاقمات لقما إهالة وسمنا إن قريش قوم يعتدون. إلى غير ذلك من الخرافات والهذيانات التي يأنف الصبيان أن يلفظوا بها إلا على وجه السخرية والاستهزاء ولهذا أرغم الله أنفه وشرب يوم الحديقة حتفه ومزق شمله ولعنه صحبه وأهله. وقدموا على الصديق تائبين وجاءوا في دين الله راغبين فسألهم الصديق خليفة الرسول صلوات الله وسلامه عليه ورضي عنه أن يقرءوا عليه شيئا من قرآن مسيلمة لعنه الله فسألوه أن يعفيهم من ذلك فأبى عليهم إلا أن يقرءوا شيئا منه ليسمعه من لم يسمعه من الناس فيعرفوا فضل ما هم عليه من الهدى والعلم فقرءوا عليه من هذا الذي ذكرناه وأشباهه فلما فرغوا قال لهم الصديق رضي الله عنه ويحكم أين كان يذهب بعقولكم؟ والله إن هذا لم يخرج من إل وذكروا أن عمرو بن العاص وفد على مسيلمة وكان صديقا له في الجاهلية وكان عمرو لم يسلم بعد فقال له مسيلمة ويحك يا عمرو ماذا أنزل على صاحبكم يعني رسول الله صلي الله عليه وسلم في هذه المدة؟ فقال: لقد سمعت أصحابه يقرءون سورة عظيمة قصيرة فقال: وما هي فقال \"والعصر إن الإنسان لفي خسر\" إلى آخر السورة ففكر مسيلمة ساعة ثم قال وأنا قد أنزل علي مثله فقال وما هو؟ فقال: يا وبر يا وبر إنما أنت أذنان وصدر وسائرك حفر نقر. كيف ترى يا عمرو؟ فقال له عمرو: والله إنك لتعلم أني أعلم أنك تكذب. فإذا كان هذا من مشرك في حال شركه لم يشتبه عليه حال محمد صلي الله عليه وسلم وصدقه وحال مسيلمة لعنه الله وكذبه فكيف بأولي البصائر والنهى وأصحاب العقول السليمة المستقيمة والحجا ولهذا قال الله تعالى \"فمن أظلم ممن افترى على الله كذبا أو قال أوحي إلي ولم يوح إليه شيء ومن قال سأنزل مثل ما أنزل الله\" وقال في هذه الآية الكريمة \"ومن أظلم ممن افترى على الله كذبا أو كذب بآياته إنه لا يفلح المجرمون\" وكذلك من كذب بالحق الذي جاءت به الرسل وقامت عليه الحجج لا أحد أظلم منه كما جاء في الحديث \" أعتى الناس على الله رجل قتل نبيا أو قتله نبي\"."
    },
    {
      "ayah": 18,
      "surah": 10,
      "text": "ينكر تعالى على المشركين الذين عبدوا مع الله غيره ظانين أن تلك الآلهة تنفعهم شفاعتها عند الله فأخبر تعالى أنها لا تضر ولا تنفع ولا تملك شيئا ولا يقع شيء مما يزعمون فيها ولا يكون هذا أبدا ولهذا قال تعالى \"قل أتنبئون الله بما لا يعلم في السموات ولا في الأرض\" وقال ابن جرير: معناه أتخبرون الله بما لا يكون في السموات ولا في الأرض؟ ثم نزه نفسه الكريمة عن شركهم وكفرهم فقال \"سبحانه وتعالى عما يشركون\"."
    },
    {
      "ayah": 19,
      "surah": 10,
      "text": "ثم أخبر تعالى أن هذا الشرك حادث الناس كائن بعد أن لم يكن وأن الناس كلهم كانوا على دين واحد وهو الإسلام. قال ابن عباس: كان بين آدم ونوح عشرة قرون كلهم على الإسلام ثم وقع الاختلاف بين الناس وعبدت الأصنام والأنداد والأوثان فبعث الله الرسل بآياته وبيناته وحججه البالغة وبراهينه الدامغة \" ليهلك من هلك عن بينة ويحيى من حي عن بينة\" وقوله \"ولولا كلمة سبقت من ربك\" الآية أي لولا ما تقدم من الله تعالى أنه لا يعذب أحدا إلا بعد قيام الحجة عليه وأنه قد أجل الخلق إلى أجل معدود لقضى بينهم فيما اختلفوا فيه فأسعد المؤمنين وأعنت الكافرين."
    },
    {
      "ayah": 2,
      "surah": 10,
      "text": "وقوله \"أكان للناس عجبا\" الآية. يقول تعالى منكرا على من تعجب من الكفار من إرسال المرسلين من البشر كما أخبر تعالى عن القرون الماضين من قولهم \"أبشر يهدوننا\" وقال هود وصالح لقومهما \"أوعجبتم أن جاءكم ذكر من ربكم على رجل منكم\" وقال تعالى مخبرا عن كفار قريش أنهم قالوا \"أجعل الآلهة إلها واحدا إن هذا لشيء عجاب\" وقال الضحاك عن ابن عباس لما بعث الله تعالى محمدا صلي الله عليه وسلم رسولا أنكرت العرب ذلك أو من أنكر منهم فقالوا الله أعظم من أن يكون رسوله بشرا مثل محمد قال فأنزل الله عز وجل\" أكان للناس عجبا\" الآية. وقوله \"أن لهم قدم صدق عند ربهم\" اختلفوا فيه فقال علي بن أبي طلحة عن ابن عباس في قوله \"وبشر الذين آمنوا أن لهم قدم صدق\" يقول سبقت لهم السعادة في الذكر الأول وقال العوفي عن ابن عباس \"أن لهم قدم صدق عند ربهم\" يقول أجرا حسنا بما قدموا وكذا قال الضحاك والربيع بن أنس وعبدالرحمن بن زيد بن أسلم وهذا كقوله تعالى \"لينذر بأسا شديدا\" الآية. وقال مجاهد\" أن لهم قدم صدق عند ربهم\" قال الأعمال الصالحة صلاتهم وصومهم وصدقتهم وتسبيحهم قال: ومحمد صلي الله عليه وسلم يشفع لهم وكذا قال زيد بن أسلم ومقاتل بن حيان وقال قتادة سلف صدق عند ربهم واختار ابن جرير قول مجاهد أن الأعمال الصالحة التي قدموها كما يقال له قدم في الإسلام كقول حسان: لنا القدم العليا إليك وخلفنا لأولنا في طاعة الله تابع وقول ذي الرمة: لكم قدم لا ينكر الناس إنها مع الحسب العادي طمت على البحر وقوله تعالى \"قال الكافرون إن هذا لساحر مبين\" أي مع أنا بعثنا إليهم رسولا منهم رجلا من جنسهم بشيرا ونذيرا\"قال الكافرون إن هذا لساحر مبين\" أي ظاهروهم الكاذبون في ذلك."
    },
    {
      "ayah": 20,
      "surah": 10,
      "text": "أي ويقول هؤلاء الكفرة المكذبون المعاندون: لولا أنزل على محمد آية من ربه يعنون كما أعطى الله ثمود الناقة أو أن يحول لهم الصفا ذهبا أو يزيح عنهم جبال مكة ويجعل مكانها بساتين وأنهارا أو نحو ذلك مما الله عليه قادر ولكنه حكيم في أفعاله وأقواله كما قال تعالى: \"تبارك الذي إن شاء جعل لك خيرا من ذلك جنات تجري من تحتها الأنهار ويجعل لك قصورا بل كذبوا بالساعة وأعتدنا لمن كذب بالساعة سعيرا\" وكقوله \"وما منعنا أن نرسل بالآيات إلا أن كذب بها الأولون\" الآية. يقول تعالى: إن سنتي في خلقي أني إذا آتيتهم ما سألوا فإن آمنوا وإلا عاجلتهم بالعقوبة. ولهذا لما خير رسول الله صلى الله عليه وآله وسلم بين إعطائهم ما سألوا فإن آمنوا وإلا عذبوا وبين إنظارهم اختار إنظارهم كما حلم عنهم غير مرة رسول الله صلى الله تعالى عليه وآله وسلم ولهذا قال تعالى إرشادا لنبيه صلى الله تعالى عليه وآله وسلم إلى الجواب عما سألوا \"فقل إنما الغيب للّه\" أي الأمر كله للّه وهو يعلم العواقب في الأمور \"فانتظروا إنى معكم من المنتظرين\" أي إن كنتم لا تؤمنون حتى تشاهدوا ما سألتم فانتظروا حكم الله في وفيكم. هذا مع أنهم قد شاهدوا من آياته صلي الله عليه وسلم أعظم مما سألوا حين أشار بحضرتهم إلى القمر ليلة إبداره فانشق اثنتين فرقة من وراء الجبل وفرقة من دونه. وهذا أعظم من سائر الآيات الأرضية مما سألوا وما لم يسألوا ولو علم الله منهم أنهم سألوا ذلك استرشادا وتثبيتا لأجابهم ولكن علم أنهم إنما يسألون عنادا وتعنتا فتركهم فيما رابهم وعلم أنهم لا يؤمن منهم أحد كقوله تعالى \"إن الذين حقت عليهم كلمة ربك لا يؤمنون ولو جاءتهم كل آية\" الآية وقوله تعالى \"ولو أننا نزلنا إليهم الملائكة وكلمهم الموتى وحشرنا عليهم كل شيء قبلا ما كانوا ليؤمنوا إلا أن يشاء الله\" الآية ولما فيهم من المكابرة كقوله تعالى \"ولو فتحنا عليهم بابا من السماء\" الآية وقوله تعالى \"وإن يروا كسفا من السماء ساقطا\" الآية وقال تعالى \"ولو نزلنا عليك كتابا في قرطاس فلمسوه بأيديهم لقال الذين كفروا إن هذا إلا سحر مبين\" فمثل هؤلاء أقل من أن يجابوا إلى ما سألوه لأنه لا فائده في جوابهم لأنه دائر على تعنتهم وعنادهم لكثرة فجورهم وفسادهم ولهذا قال \"فانتظروا إني معكم من المنتظرين\"."
    },
    {
      "ayah": 21,
      "surah": 10,
      "text": "يخبر تعالى أنه إذا أذاق الناس رحمة من بعد ضراء مستهم كالرخاء بعد الشدة والخصب بعد الجدب والمطر بعد القحط ونحو ذلك \"إذا لهم مكر في آياتنا\" قال مجاهد استهزاء وتكذيب كقوله \"وإذا مس الإنسان الضر دعانا لجنبه أو قاعدا أو قائما\" الآية وفي الصحيح أن رسول الله صلي الله عليه وسلم صلى بهم الصبح على أثر سماء كانت من الليل أي مطر ثم قال \"هل تدرون ماذا قال ربكم الليلة؟\" قالوا الله ورسوله أعلم قال \"قال أصبح من عبادي مؤمن بي وكافر فأما من قال مطرنا بفضل الله ورحمته فذاك مؤمن بي كافر بالكوكب وأما من قال مطرنا بنوء كذا وكذا فذاك كافر بي مؤمن بالكوكب\" وقوله \"قل الله أسرع مكرا\" أي أشد استدراجا وإمهالا حتى يظن الظان من المجرمين أنه ليس بمعذب وإنما هو في مهلة ثم يؤخذ على غرة منه والكاتبون الكرام يكتبون عليه جميع ما يفعله ويحصونه عليه ثم يعرضون على عالم الغيب والشهادة فيجازيه على الجليل والحقير والنقير والقطمير."
    },
    {
      "ayah": 22,
      "surah": 10,
      "text": "ثم أخبر تعالى أنه \"هو الذي يسيركم في البر والبحر\" أي يحفظكم ويكلؤكم بحراسته \"حتى إذا كنتم في الفلك وجرين بهم بريح طيبة وفرحوا بها\" أي بسرعة سيرهم رافقين فبينما هم كذلك إذ \"جاءتها\" أي تلك السفن \"ريح عاصف\" أي شديدة \"وجاءهم الموج من كل مكان\" أي اغتلم البحر عليهم \"وظنوا أنهم أحيط بهم\" أي هلكوا \"دعوا الله مخلصين له الدين\" أي لا يدعون معه صنما ولا وثنا بل يفردونه بالدعاء والابتهال كقوله تعالى \"وإذا مسكم الضر في البحر ضل من تدعون إلا إياه فلما نجاكم إلى البر أعرضتم وكان الإنسان كفورا\" * وقال ههنا \"دعوا الله مخلصين له الدين لئن أنجيتنا من هذه\" أي هذه الحال \"لنكونن من الشاكرين\" أي لا نشرك بك أحدا ولنفردنك بالعبادة هناك كما أفردناك بالدعاء."
    },
    {
      "ayah": 23,
      "surah": 10,
      "text": "ههنا قال تعالى \"فلما أنجاهم\" أي من تلك الورطة \"إذا هم يبغون في الأرض بغير الحق\" أي كأن لم يكن من ذلك شيء \"كأن لم يدعنا إلى ضر مسه\" ثم قال تعالى \"يا أيها الناس إنما بغيكم على أنفسكم\" أي إنما يذوق وبال هذا البغي أنتم أنفسكم ولا تضرون به أحدا غيركم كما جاء في الحديث \"ما من ذنب أجدر من أن يعجل الله عقوبته في الدنيا مع ما يدخر الله لصاحبه في الآخرة من البغي وقطيعة الرحم\" وقوله \"متاع الحياة الدنيا\" أي إنما لكم متاع في الحياة الدنيا الدنيئة الحقيرة \"ثم إلينا مرجعكم\" أي مصيركم ومآلكم \"فننبئكم\" أي فنخبركم بجميع أعمالكم ونوفيكم إياها فمن وجد خيرا فليحمد الله ومن وجد غير ذلك فلا يلومن إلا نفسه."
    },
    {
      "ayah": 24,
      "surah": 10,
      "text": "ضرب تبارك وتعالى مثلا لزهرة الحياة الدنيا وزينتها وسرعة انقضائها وزوالها بالنبات الذي أخرجه الله من الأرض بماء أنزل من السماء مما يأكل الناس من زروع وثمار على اختلاف أنواعها وأصنافها وما تأكل الأنعام من أب وقضب وغير ذلك \"حتى إذا أخذت الأرض زخرفها\" أي زينتها الفانية \"وازينت\" أي حسنت بما خرج في رباها من زهور نضرة مختلفة الأشكال والألوان \"وظن أهلها\" الذين زرعوها وغرسوها \"أنهم قادرون عليها\" أي على جذاذها وحصادها فبينما هم كذلك إذ جاءتها صاعقة أو ريح شديدة باردة فأيبست أوراقها وأتلفت ثمارها ولهذا قال تعالى \"أتاها أمرنا ليلا أو نهارا فجعلناها حصيدا\" أي يابسا بعد الخضرة والنضارة \"كأن لم تغن بالأمس\" أي كأنها ما كانت حينا قبل ذلك وقال قتادة: كأن لم تغن كأن لم تنعم وهكذا الأمور بعد زوالها كأنها لم تكن. ولهذا جاء في الحديث \"يؤتى بأنعم أهل الدنيا فيغمس في النار غمسة فيقال له هل رأيت خيرا قط؟ هل مر بك نعيم قط ؟ فيقول لا ويؤتى بأشد الناس عذابا في الدنيا فيغمس في النعيم غمسة ثم يقال له هل رأيت بؤسا قط؟ فيقول لا\" وقال تعالى إخبارا عن المهلكين \"فأصبحوا في دراهم جاثمين كأن لم يغنوا فيها\" ثم قال تعالى \"كذلك نفصل الآيات\" أي نبين الحجج والأدلة \"لقوم يتفكرون\" فيعتبرون بهذا المثل في زوال الدنيا من أهلها سريعا مع اغترارهم بها وتمكنهم وثقتهم بمواعيدها وتفلتها عنهم فإن من طبعها الهرب ممن طلبها والطلب لمن هرب منها وقد ضرب الله تعالى مثل الدنيا بنبات الأرض في غير ما آية من كتابه العزيز فقال في سورة الكهف \"واضرب لهم مثل الحياة الدنيا كماء أنزلناه من السماء فاختلط به نبات الأرض فأصبح هشيما تذروه الرياح وكان الله على كل شيء مقتدرا\" وكذا في سورة الزمر والحديد يضرب الله بذلك مثل الحياة الدنيا. وقال ابن جرير: حدثني الحارث حدثنا عبدالعزيز حدثنا ابن عيينة عن عمرو بن دينار عن عبدالرحمن بن أبي بكر بن عبدالرحمن بن الحارث بن هشام قال: سمعت مروان يعني ابن الحكم يقرأ على المنبر: \"وازينت وظن أهلها أنهم قادرون عليها وما كان الله ليهلكهم إلا بذنوب أهلها\" قال: قد قرئتها وليست في المصحف فقال عباس بن عبدالله بن عباس: هكذا يقرؤها ابن عباس فأرسلوا إلى ابن عباس فقال: هكذا أقرأني أبي بن كعب وهذه قراءة غريبة وكأنها زيدت للتفسير."
    },
    {
      "ayah": 25,
      "surah": 10,
      "text": "لما ذكر تعالى الدنيا وسرعة زوالها رغب في الجنة ودعا إليها وسماها دار السلام أي من الآفات والنقائص والنكبات فقال \"والله يدعو إلى دار السلام ويهدي من يشاء إلى صراط مستقيم\" قال أيوب عن أبي قلابة عن النبي صلي الله عليه وسلم قال \" قيل لي لتنم عينك وليعقل قلبك ولتسمع أذنك فنامت عيني وعقل قلبي وسمعت أذني ثم قيل لي مثلي ومثل ما جئت كمثل سيد بني دارا ثم صنع مأدبة وأرسل داعيا فمن أجاب الداعي دخل الدار وأكل من المأدبة ورضي عنه السيد ومن لم يجب الداعي لم يدخل الدار ولم يأكل من المأدبة ولم يرض عنه السيد والله السيد والدار الإسلام والمأدبة الجنة والداعي محمد صلي الله عليه وسلم\" وهذا حديث مرسل وقد جاء متصلا من حديث الليث عن خالد بن يزيد عن سعيد بن أبي هلال عن جابر بن عبدالله رضي الله عنه قال: خرج علينا رسول الله صلي الله عليه وسلم يوما فقال \"إني رأيت في المنام كأن جبريل عند رأسي وميكائيل عند رجلي يقول أحدهما لصاحبه اضرب له مثلا فقال: اسمع سمعت أذنك واعقل عقل قلبك إنما مثلك ومثل أمتك كمثل ملك اتخذ دارا ثم بنى فيها بيتا ثم جعل فيها مأدبة ثم بعث رسولا يدعو الناس إلى طعامه فمنهم من أجاب الرسول ومنهم من تركه فالله الملك والدار الإسلام والبيت الجنة وأنت يا محمد الرسول فمن أجابك دخل الإسلام ومن دخل الإسلام دخل الجنة ومن دخل الجنة أكل منها\" رواه ابن جرير وقال قتادة: حدثني خليد العصري عن أبي الدرداء مرفوعا قال: قال رسول الله صلي الله عليه وسلم \"ما من يوم طلعت فيه الشمس إلا وبجنبيها ملكان يناديان يسمعه خلق الله كلهم إلا الثقلين: يا أيها الناس هلموا إلى ربكم إن ما قل وكفى خير مما كثر وألهي\" قال وأنزل في قوله يا أيها الناس هلموا إلى ربكم \"والله يدعو إلى دار السلام\" الآية. رواه ابن أبي حاتم وابن جرير."
    },
    {
      "ayah": 26,
      "surah": 10,
      "text": "يخبر تعالى أن لمن أحسن العمل في الدنيا بالإيمان والعمل الصالح: الحسنى في الدار الآخرة كقوله تعالى \"هل جزاء الإحسان إلا الإحسان\" وقوله \"وزيادة\" هي تضعيف ثواب الأعمال بالحسنة عشر أمثالها إلى سبعمائة ضعف وزيادة على ذلك أيضا ويشمل ما يعطيهم الله في الجنان من القصور والحور والرضا عنهم وما أخفاه لهم من قرة أعين وأفضل من ذلك وأعلاه النظر إلى وجهه الكريم فإنه زيادة أعظم من جميع ما أعطوه لا يستحقونها بعملهم بل بفضله ورحمته وقد روي تفسير الزيادة بالنظر إلى وجهه الكريم عن أبي بكر الصديق وحذيفة بن اليمان وعبدالله بن عباس وسعيد بن المسيب وعبدالرحمن بن أبي ليلى وعبدالرحمن بن سابط ومجاهد وعكرمة وعامر بن سعد وعطاء والضحاك والحسن وقتادة والسدي ومحمد بن إسحاق وغيرهم من السلف والخلف وقد وردت فيه أحاديث كثيرة عن النبي صلي الله عليه وسلم فمن ذلك ما رواه الإمام أحمد: حدثنا عفان أخبرنا حماد بن سلمة عن ثابت البناني عن عبدالرحمن بن أبي ليلى عن صهيب رضي الله عنهم أن رسول الله صلي الله عليه وسلم تلا هذه الآية \"للذين أحسنوا الحسنى وزيادة\" وقال \"إذا دخل أهل الجنة الجنة وأهل النار النار نادى مناد يا أهل الجنة إن لكم عند الله موعدا يريد أن ينجزكموه فيقولون وما هو ألم يثقل موازيننا؟ ألم يبيض وجوهنا ويدخلنا الجنة ويجرنا من النار؟ - قال - فيكشف لهم الحجاب فينظرون إليه فوالله ما أعطاهم الله شيئا أحب إليهم من النظر إليه ولا أقر لأعينهم\" وهكذا رواه مسلم وجماعة من الأئمة من حديث حماد بن سلمة به وقال ابن جرير: حدثني يونس قال: أخبرنا ابن وهب قال: أخبرني شبيب عن أبان بن أبي تميمة الهجيمي أنه سمع أبا موسى الأشعري يحدث عن رسول الله صلي الله عليه وسلم \"إن الله يبعث يوم القيامة مناديا ينادي يا أهل الجنة - بصوت يسمع أولهم وآخرهم - إن الله وعدكم الحسنى وزيادة فالحسنى الجنة والزيادة النظر إلى وجه الرحمن عز وجل\" رواه أيضا ابن أبي حاتم من حديث أبي بكر الهذلي عن أبي تميمة الهجيمي به وقال ابن جرير أيضا: حدثنا ابن حميد حدثنا إبراهيم بن المختار عن ابن جرير عن عطاء عن كعب بن عجرة عن النبي صلى الله عليه وسلم في قوله \"للذين أحسنوا الحسنى وزيادة\" قال \"النظر إلى وجه الرحمن عز وجل\" وقال أيضا: حدثنا ابن عبدالرحيم حدثنا عمر بن أبي سلمة سمعت زهيرا عمن سمع أبا العالية حدثنا أبي بن كعب أنه سأل رسول الله صلي الله عليه وسلم عن قول الله عز وجل \"للذين أحسنوا الحسنى وزيادة\" قال \"الحسنى الجنة والزيادة النظر إلى وجه الله عز وجل\" ورواه ابن أبي حاتم أيضا من حديث زهير به. وقوله تعالى \"ولا يرهق وجوههم قتر\" أي قتام وسواد في عرصات المحشر كما يعتري وجوه الكفرة الفجرة من القترة والغبرة \"ولا ذلة\" أي هوان وصغار أي لا يحصل لهم إهانة في الباطن ولا في الظاهر بل هم كما قال تعالى في حقهم \"فوقاهم الله شر ذلك اليوم ولقاهم نضرة وسرورا\" أي نضرة في وجوههم وسرورا في قلوبهم جعلنا الله منهم بفضله ورحمته آمين."
    },
    {
      "ayah": 27,
      "surah": 10,
      "text": "لما أخبر تعالى عن حال السعداء الذين يضاعف لهم الحسنات ويزدادون على ذلك عطف بذكر حال الأشقياء فذكر تعالى عدله فيهم وأنه يجازيهم على السيئة بمثلها لا يزيدهم على ذلك \"وترهقهم\" أي تعتريهم وتعلوهم ذلة من معاصيهم وخوفهم منها كما قال \"وتراهم يعرضون عليها خاشعين من الذل\" الآية وقال تعالى \"ولا تحسبن الله غافلا عما يعمل الظالمون إنما يؤخرهم ليوم تشخص فيه الأبصار مهطعين مقنعي رءوسهم\" الآيات. وقوله \"ما لهم من الله من عاصم\" أي مانع ولا واق يقيهم العذاب كقوله تعالى \"يقول الإنسان يومئذ أين المفر كلا لا وزر إلى ربك يومئذ المستقر\" وقوله \"كأنما أغشيت وجوههم\" الآية إخبار عن سواد وجوههم في الدار الآخرة كقوله تعالى \"يوم تبيض وجوه وتسود وجوه فأما الذين اسودت وجوههم أكفرتم بعد إيمانكم فذوقوا العذاب بما كنتم تكفرون وأما الذين ابيضت وجوههم ففي رحمة الله هم فيها خالدون\" وقوله تعالى \"وجوه يومئذ مسفرة ضاحكة مستبشرة ووجوه يومئذ عليها غبرة\" الآية."
    },
    {
      "ayah": 28,
      "surah": 10,
      "text": "\"ويوم نحشرهم\" أي أهل الأرض كلهم من جن وإنس وبر وفاجر كقوله \"وحشرناهم فلم نغادر منهم أحدا\" \"ثم نقول للذين أشركوا\" الآية أي الزموا أنتم وهم مكانا معينا امتازوا فيه عن مقام المؤمنين كقوله تعالى \"وامتازوا اليوم أيها المجرمون\" وقوله \"ويوم تقوم الساعة يومئذ يتفرقون\" وفي الآية الأخرى \"يومئذ يصدعون\" أي يصيرون صدعين وهذا يكون إذا جاء الرب تبارك وتعالى لفصل القضاء ولهذا قيل ذلك يستشفع المؤمنون إلى الله تعالى أن يأتي لفصل القضاء ويريحنا من مقامنا هذا وفي الحديث الآخر \"نحن يوم القيامة على كوم فوق الناس\" وقال الله تعالى في الآية الكريمة إخبارا عما يأمر به المشركين وأوثانهم يوم القيامة \"مكانكم أنتم وشركاؤكم فزيلنا بينهم\" الآية أنهم أنكروا عبادتهم وتبرءوا منهم كقوله \"كلا سيكفرون بعبادتهم\" الآية وقوله \"إذ تبرأ الذين اتبعوا من الذين اتبعوا\" وقوله \"ومن أضل ممن يدعو من دون الله من لا يستجيب له إلى يوم القيامة وهم عن دعائهم غافلون وإذا حشر الناس كانوا لهم أعداء\" الآية وقوله في هذه الآية إخبارا عن قول الشركاء فيما راجعوا فيه عابديهم عند ادعائهم عبادتهم."
    },
    {
      "ayah": 29,
      "surah": 10,
      "text": "أي ما كنا نشعر بها ولا نعلم بها وإنما كنتم تعبدوننا من حيث لا ندري بكم والله شهيد بيننا وبينكم أنا ما دعوناكم إلى عبادتنا ولا أمرناكم بها ولا رضينا منكم بذلك وفي هذا تبكيت عظيم للمشركين الذين عبدوا مع الله غيره ممن لا يسمع ولا يبصر ولا يغني عنهم شيئا ولم يأمرهم بذلك ولا رضي به ولا أراده بل تبرأ منهم في وقت أحوج ما يكونون إليه وقد تركوا عبادة الحي القيوم السميع البصير القادر على كل شيء العليم بكل شيء وقد أرسل رسله وأنزل كتبه آمرا بعبادته وحده لا شريك له ناهيا عن عبادة ما سواه كما قال تعالى \"ولقد بعثنا في كل أمة رسولا أن اعبدوا الله واجتنبوا الطاغوت فمنهم من هدى الله ومنهم من حقت عليه الضلالة\" وقال تعالى \"وما أرسلنا من قبلك من رسول إلا نوحي إليه أنه لا إله إلا أنا فاعبدون\" وقال \"واسأل من أرسلنا قبلك من رسلنا أجعلنا من دون الرحمن آلهة يعبدون\" والمشركون أنواع وأقسام قد ذكرهم الله في كتابه وبين أحوالهم وأقوالهم ورد عليهم فيما هم فيه أتم رد."
    },
    {
      "ayah": 3,
      "surah": 10,
      "text": "يخبر تعالى أنه رب العالم جميعه وأنه خلق السموات والأرض في ستة أيام قيل كهذه الأيام وقيل كل يوم كألف سنة مما تعدون كما سيأتي بيانه ثم استوى على العرش والعرش أعظم المخلوقات وسقفها قال ابن أبي حاتم: حدثنا حجاج بن حمزة حدثنا أبو أسامة حدثنا إسماعيل بن أبي خالد قال: سمعت سعدا الطائي يقول: العرش ياقوتة حمراء وقال وهب بن منبه خلقه الله من نوره وهذا غريب وقوله \"يدبر الأمر\" أي يدبر أمر الخلائق \"لا يعزب عنه مثقال ذرة في السموات ولا في الأرض\" ولا يشغله شأن عن شأن ولا تغلطه المسائل ولا يتبرم بإلحاح الملحين ولا يلهيه تدبير الكبير عن الصغير في الجبال والبحار والعمران والقفار \"وما من دابة في الأرض إلا على الله رزقها\" الآية \"وما تسقط من ورقة إلا يعلمها ولا حبة في ظلمات الأرض ولا رطب ولا يابس إلا في كتاب مبين\" وقال الدراوردي عن سعد بن إسحاق بن كعب بن عجرة أنه قال حين نزلت هذه الآية \"إن ربكم الله الذي خلق السموات والأرض\" الآية لقيهم ركب عظيم لا يرون إلا أنهم من العرب فقالوا لهم من أنتم؟ قالوا من الجن خرجنا من المدينة أخرجتنا هذه الآية رواه أبن أبي حاتم وقوله \"ما من شفيع إلا من بعد إذنه\" كقوله تعالى \"من ذا الذي يشفع عنده إلا بإذنه\" وقوله تعالى \"وكم من ملك في السموات لا تغني شفاعتهم شيئا إلا من بعد أن يأذن الله لمن يشاء ويرضى\" وقوله \"ولا تنفع الشفاعة عنده إلا لمن أذن له\" وقوله \"ذلكم الله ربكم فاعبدوه أفلا تذكرون\" أي أفردوه بالعبادة وحده لا شريك له \"أفلا تذكرون\" أي أيها المشركون في أمركم تعبدون مع الله إلها غيره وأنتم تعلمون أنه المتفرد بالخلق كقوله تعالى \"ولئن سألتهم من خلقهم ليقولن الله \" وقوله \"قل من رب السموات السبع ورب العرش العظيم سيقولون الله قل أفلا تتقون\" وكذا الآية التي قبلها والتي بعدها."
    },
    {
      "ayah": 30,
      "surah": 10,
      "text": "أي في موقف الحساب يوم القيامة تختبر كل نفس وتعلم ما سلف من عملها من خير وشر كقوله تعالى \"يوم تبلى السرائر\" وقال تعالى \"ينبأ الإنسان يومئذ بما قدم وأخر\" وقال تعالى \"ونخرج له يوم القيامة كتابا يلقاه منشورا اقرأ كتابك كفى بنفسك اليوم عليك حسيبا\" وقد قرأ بعضهم \"هنالك تبلو كل نفس ما أسلفت\" وفسرها بعضهم بالقراءة وفسرها بعضهم بمعنى تتبع ما قدمت من خير وشر وفسرها بعضهم بحديث \" لتتبع كل أمة ما كانت تعبد فيتبع من كان يعبد الشمس الشمس ويتبع من كان يعبد القمر القمر ويتبع من كان يعبد الطواغيت الطواغيت...\" الحديث وقوله \"وردوا إلى الله مولاهم الحق\" أي ورجعت الأمور كلها إلى الله الحكم العدل ففصلها وأدخل أهل الجنة الجنة وأهل النار النار \"وضل عنهم\" أي ذهب عن المشركين \"ما كانوا يفترون\" أي ما كانوا يعبدون من دون الله افتراء عليه."
    },
    {
      "ayah": 31,
      "surah": 10,
      "text": "يحتج تعالى على المشركين باعترافهم بوحدانيته وربوبيته على وحدانية وإلاهيته فقال تعالى \"قل من يرزقكم من السماء والأرض\" أي من ذا الذي ينزل من السماء ماء المطر فيشق الأرض شقا بقدرته ومشيئته فيخرج منها \"حبا وعنبا وقضبا وزيتونا ونخلا وحدائق غلبا وفاكهة وأبا\" أإله مع الله ؟ فسيقولون الله \"أمن هذا الذي يرزقكم إن أمسك رزقه\" وقوله \"أمن يملك السمع والأبصار\" أي الذي وهبكم هذه القوة السامعة والقوة الباصرة ولو شاء لذهب بها ولسلبكم إياها كقوله تعالى \"قل هو الذي أنشأكم وجعل لكم السمع والأبصار\" الآية وقال \"قل أرأيتم إن أخذ الله سمعكم وأبصاركم\" الآية وقوله \"ومن يخرج الحي من الميت من ويخرج الميت من الحي\" أي بقدرته العظيمة ومنته العميمة; وقد تقدم ذكر الخلاف في ذلك وأن الآية عامة لذلك كله وقوله \"ومن يدبر الأمر\" أي من بيده ملكوت كل شيء وهو يجير ولا يجار عليه وهو المتصرف الحاكم الذي لا معقب لحكمه ولا يسئل عما يفعل وهم يسئلون \"يسأله من في السموات والأرض كل يوم هو في شأن\" فالملك كله العلوي والسفلي وما فيهما من ملائكة وإنس وجان فقيرون إليه عبيد له خاضعون لديه \"فسيقولون الله\" أي وهم يعلمون ذلك ويعترفون به \"فقل أفلا تتقون\" أي أفلا تخافون منه أن تعبدوا معه غيره بآرائكم وجهلكم."
    },
    {
      "ayah": 32,
      "surah": 10,
      "text": "الآية أي فهذا الذي اعترفتم بأنه فاعل ذلك كله هو ربكم وإلهكم الحق الذي يستحق أن يفرد بالعبادة \"فماذا بعد الحق إلا الضلال\" أي فكل معبود سواه باطل لا إله إلا هو واحد لا شريك له \"فأنى تصرفون\" أي فكيف تصرفون عن عبادته إلى عبادة ما سواه وأنتم تعلمون أنه الرب الذي خلق كل شيء والمتصرف في كل شيء."
    },
    {
      "ayah": 33,
      "surah": 10,
      "text": "وقوله \"كذلك حقت كلمة ربك على الذين فسقوا\" الآية أي كما كفر هؤلاء المشركون واستمروا على شركهم وعبادتهم مع الله غيره مع أنهم يعترفون بأنه الخالق الرازق المتصرف في الملك وحده الذي بعث رسله بتوحيده فلهذا حقت عليهم كلمة الله أنهم أشقياء من ساكني النار كقوله \"قالوا بلى ولكن حقت كلمة العذاب على الكافرين\"."
    },
    {
      "ayah": 34,
      "surah": 10,
      "text": "وهذا إبطال لدعواهم فيما أشركوا بالله غيره وعبدوا من الأصنام والأنداد \"قل هل من شركائكم من يبدأ الخلق ثم يعيده\" أي من بدأ خلق هذه السموات والأرض ثم ينشيء ما فيهما من الخلائق ويفرق أجرام السموات والأرض ويبدلهما بفناء ما فيهما ثم يعيد الخلق خلقا جديدا \"قل الله \" هو الذي يفعل هذا ويستقل به وحده لا شريك له \"فأني تؤفكون\" أي فكيف تصرفون عن طريق الرشد إلى الباطل."
    },
    {
      "ayah": 35,
      "surah": 10,
      "text": "\"قل هل من شركائكم من يهدي إلى الحق قل الله يهدي للحق\" أي أنتم تعلمون أن شركاءكم لا تقدر على هداية ضال وإنما يهدي الحيارى والضلال ويقلب القلوب من الغي إلى الرشد الله الذي لا إله إلا هو \"أفمن يهدي إلى الحق أحق أن يتبع أمن لا يهدي إلا أن يهدى\" أي أفيتبع العبد الذي يهدي إلى الحق ويبصر بعد العمى أم الذي لا يهدي إلى شيء إلا أن يهدى لعماه وبكمه كما قال تعالى إخبارا عن إبراهيم أنه قال \"يا أبت لم تعبد ما لا يسمع ولا يبصر ولا يغني عنك شيئا\" وقال لقومه \"أتعبدون ما تنحتون والله خلقكم وما تعملون\" إلى غير ذلك من الآيات وقوله \"فما لكم كيف تحكمون\" أي ما بالكم أن يذهب بعقولكم كيف سويتم بين الله وبين خلقه وعدلتم هذا بهذا وعبدتم هذا وهذا؟ وهلا أفردتم الرب جل جلاله المالك الحاكم الهادي من الضلالة بالعبادة وحده وأخلصتم إليه الدعوة والإنابة؟."
    },
    {
      "ayah": 36,
      "surah": 10,
      "text": "ثم بين تعالى أنهم لا يتبعون في دينهم هذا دليلا ولا برهانا وإنما هو ظن منهم أي توهم وتخيل وذلك لا يغني عنهم شيئا \"إن الله عليم بما يفعلون\" تهديد لهم ووعيد شديد لأنه تعالى أخبر أنه سيجازيهم على ذلك أتم الجزاء."
    },
    {
      "ayah": 37,
      "surah": 10,
      "text": "هذا بيان لإعجاز القرآن وأنه لا يستطيع البشر أن يأتوا بمثله ولا بعشر سور ولا بسورة من مثله لأنه بفصاحته وبلاغته ووجازته وحلاوته واشتماله على المعاني العزيزة الغزيرة النافعة في الدنيا والآخرة لا يكون إلا من عند الله الذي لا يشبهه شيء في ذاته ولا في صفاته ولا في أفعاله وأقواله فكلامه لا يشبه كلام المخلوقين ولهذا قال تعالى \"وما كان هذا القرآن أن يفترى من دون الله \" أي مثل هذا القرآن لا يكون إلا من عند الله ولا يشبه هذا كلام البشر \"ولكن تصديق الذي بين يديه\" أي من الكتب المتقدمة ومهيمنا عليه ومبينا لما وقع فيها من التحريف والتأويل والتبديل وقوله \"وتفصيل الكتاب لا ريب فيه من رب العالمين\" أي وبيان الأحكام والحلال والحرام بيانا شافيا كافيا حقا لا مرية فيه من الله رب العالمين كما تقدم في حديث الحارث الأعور عن علي بن أبي طالب فيه خبر ما قبلكم ونبأ ما بعدكم وفصل ما بينكم أي خبر عما سلف وعما سيأتي وحكم فيما بين الناس بالشرع الذي يحبه الله ويرضاه."
    },
    {
      "ayah": 38,
      "surah": 10,
      "text": "وقوله \"أم يقولون افتراه قل فأتوا بسورة مثله وأدعوا من استطعتم من دون الله إن كنتم صادقين\" أي إن ادعيتم وافتريتم وشككتم في أن هذا من عند الله وقلتم كذبا مبينا إن هذا من عند محمد فمحمد بشر مثلكم وقد جاء فيما زعمتم بهذا القرآن فأتوا أنتم بسورة مثله أي من جنس هذا القرآن واستعينوا على ذلك بكل من قدرتم عليه من إنس وجان; وهذا هو المقام الثالث في التحدي فإنه تعالى تحداهم ودعاهم إن كانوا صادقين في دعواهم أنه من عند محمد فليعارضوه بنظير ما جاء به وحده وليستعينوا بمن شاءوا وأخبر أنهم لا يقدرون على ذلك ولا سبيل لهم إليه فقال تعالى \"قل لئن اجتمعت الإنس والجن على أن يأتوا بمثل هذا القرآن لا يأتون بمثله ولو كان بعضهم لبعض ظهيرا\" ثم تقاصر معهم إلى عشر سور منه فقال في أول سورة هود \"أم يقولون افتراه قل فأتوا بعشر سور مثله مفتريات وادعوا من استطعتم من دون الله إن كنتم صادقين\" ثم تنازل إلى سورة فقال في هذه السورة \"أم يقولون افتراه قل فأتوا بسورة مثله وادعوا من استطعتم من دون الله إن كنتم صادقين\" وكذا في سورة البقرة وهي مدنية تحداهم بسورة منه وأخبر أنهم لا يستطيعون ذلك أبدا فقال \"فإن لم تفعلوا فاتقوا النار\" الآية هذا وقد كانت الفصاحة من سجاياهم وأشعارهم ومعلقاتهم إليها المنتهى في هذا الباب ولكن جاءهم من الله ما لا قبل لأحد به ولهذا آمن من آمن منهم بما عرف من بلاغة هذا الكلام وحلاوته وجزالته وطلاوته وإفادته وبراعته فكانوا أعلم الناس به وأفهمهم له وأتبعهم له وأشهرهم له انقيادا كما عرف السحرة لعلمهم بفنون السحر أن هذا الذي فعله موسى عليه السلام لا يصدر إلا عن مؤيد مسدد مرسل من الله وأن هذا لا يستطاع لبشر إلا بإذن الله وكذلك عيسى عليه السلام بعث في زمان علماء الطب ومعالجة المرضى فكان يبرئ الأكمه والأبرص ويحي الموتى بإذن الله ومثل هذا لا مدخل للعلاج والدواء فيه فعرف من عرف منهم أنه عبد الله ورسوله. ولهذا جاء في الصحيح عن رسول الله صلى الله عليه وسلم أنه قال \"ما من نبي من الأنبياء إلا وقد أوتي من الآيات ما آمن على مثله البشر وإنما كان الذي أوتيته وحيا أوحاه الله إلي فأرجو أن أكون أكثرهم تابعا\"."
    },
    {
      "ayah": 39,
      "surah": 10,
      "text": "وقوله \"بل كذبوا بما لم يحيطوا بعلمه ولم يأتهم تأويله\" يقول بل كذب هؤلاء بالقرآن ولم يفهموه ولا عرفوه \"ولما يأتهم تأويله\" أي ولم يحصلوا ما فيه من الهدى ودين الحق إلى حين تكذيبهم به جهلا وسفها \"كذلك كذب الذين من قبلهم\" أي من الأمم السالفة \"فانظر كيف كان عاقبة الظالمين\" أي فانظر كيف أهلكناهم بتكذيبهم رسلنا ظلما وعلوا وكفرا وعنادا وجهلا فاحذروا أيها المكذبون أن يصيبكم ما أصابهم."
    },
    {
      "ayah": 4,
      "surah": 10,
      "text": "يخبر تعالى أن إليه مرجع الخلائق يوم القيامة لا يترك منهم أحدا حتى يعيده كما بدأه ثم ذكر تعالى أنه كما بدأ الخلق كذلك يعيده \"وهو الذي يبدأ الخلق ثم يعيده وهو أهون عليه\" \"ليجزي الذين آمنوا وعملوا الصالحات بالقسط\" أي بالعدل والجزاء الأوفى \"والذين كفروا لهم شراب من حميم وعذاب أليم بما كانوا يكفرون\" أي بسبب كفرهم يعذبون يوم القيامة بأنواع العذاب من سموم وحميم وظل من يحموم \"هذا فليذوقوه حميم وغساق وآخر من شكله أزواج\" \"هذه جهنم التي يكذب بها المجرمون يطوفون بينها وبين حميم آن\"."
    },
    {
      "ayah": 40,
      "surah": 10,
      "text": "وقوله \"ومنهم من يؤمن به\" الآية أي ومن هؤلاء الذين بعثت إليهم يا محمد من يؤمن بهذا القرآن ويتبعك وينتفع بما أرسلت به \"ومنهم من لا يؤمن به\" بل يموت على ذلك ويبعث عليه \"وربك أعلم بالمفسدين\" أي وهو أعلم بمن يستحق الهداية فيهديه; ومن يستحق الضلالة فيضله وهو العادل الذي لا يجور بل يعطي كلا ما يستحقه تبارك وتعالى وتقدس وتنزه لا إله إلا هو."
    },
    {
      "ayah": 41,
      "surah": 10,
      "text": "يقول تعالى لنبيه صلى الله عليه وسلم وإن كذبك هؤلاء المشركون فتبرأ منهم ومن عملهم \"فقل لي عملي ولكم عملكم\" كقوله تعالى \"قل يا أيها الكافرون لا أعبد ما تعبدون\" إلى آخرها; وقال إبراهيم الخليل وأتباعه لقومهم المشركين \"إنا برآء منكم ومما تعبدون من دون الله \"الآية."
    },
    {
      "ayah": 42,
      "surah": 10,
      "text": "وقوله \"ومنهم من يستمعون إليك\" أي يسمعون كلامك الحسن والقرآن العظيم والأحاديث الصحيحة الفصيحة النافعة في القلوب والأديان والأبدان وفي هذا كفاية عظيمة; ولكن ليس ذلك إليك ولا إليهم فإنك لا تقدر على إسماع الأصم وهو الأطرش فكذلك لا تقدر على هداية هؤلاء إلا أن يشاء الله."
    },
    {
      "ayah": 43,
      "surah": 10,
      "text": "\"ومنهم من ينظر إليك\" أي ينظرون إليك وإلى ما أعطاك الله من التؤدة والسمت الحسن والخلق العظيم والدلالة الظاهرة على نبوءتك لأولي البصائر والنهي وهؤلاء ينظرون كما ينظر غيرهم ولا يحصل لهم من الهداية شيء كما يحصل لغيرهم بل المؤمنون ينظرون إليك بعين الوقار وهؤلاء الكفار ينظرون إليك بعين الاحتقار \"وإذا رأوك إن يتخذونك إلا هزوا\" الآية ثم أخبر تعالى أنه لا يظلم أحدا شيئا وإن كان قد هدى به من هدى وبصر به من العمى وفتح به أعينا عميا وآذانا صما وقلوبا غلفا وأضل به عن الإيمان آخرين فهو الحاكم المتصرف في ملكه بما يشاء الذي لا يسئل عما يفعل وهم يسئلون لعلمه وحكمته وعدله."
    },
    {
      "ayah": 44,
      "surah": 10,
      "text": "ولهذا قال تعالى \"إن الله لا يظلم الناس شيئا ولكن الناس أنفسهم يظلمون\" وفي الحديث عن أبي ذر عن النبي صلي الله عليه وسلم فيما يرويه عن ربه عز وجل \"يا عبادي إنى حرمت الظلم على نفسي وجعلته بينكم محرما فلا تظالموا - إلى أن قال في آخره- يا عبادي إنما هي أعمالكم أحصيها لكم ثم أوفيكم إياها فمن وجد خيرا فليحمد الله ومن وجد غير ذلك فلا يلومن إلا نفسه\" رواه مسلم بطوله."
    },
    {
      "ayah": 45,
      "surah": 10,
      "text": "يقول تعالى مذكرا للناس قيام الساعة وحصرهم من أجداثهم إلى عرصات القيامة \"ويوم يحشرهم\" الآية كقوله \"كأنهم يوم يرون ما يوعدون لم يلبثوا إلا ساعة من نهار\" وكقوله \"كأنهم يوم يرونها لم يلبثوا إلا عشية أو ضحاها\" وقال تعالى \"يوم ينفخ في الصور ونحشر المجرمين يومئذ زرقا يتخافتون بينهم إن لبثتم إلا عشرا نحن أعلم بما يقولون إذ يقول أمثلهم طريقة إن لبثتم إلا يوما\" وقال تعالى \"ويوم تقوم الساعة يقسم المجرمون ما لبثوا غير ساعة\" الآيتين وهذا كله دليل على استقصار الحياة الدنيا في الدار الآخرة كقوله \"قال كم لبثتم في الأرض عدد سنين قالوا لبثنا يوما أو بعض يوم فاسأل العادين قال إن لبثتم إلا قليلا لو أنكم كنتم تعلمون\" وقوله \"يتعارفون بينهم\" أي يعرف الأبناء والأباء والقرابات بعضهم لبعض كما كانوا في الدنيا ولكن كل مشغول بنفسه \"فإذا نفخ في الصور فلا أنساب بينهم\" الآية وقال تعالى \"ولا يسأل حميم حميما\" الآيات; وقوله \"قد خسر الذين كذبوا بلقاء الله وما كانوا مهتدين\" كقوله تعالى \"ويل للمكذبين\" لأنهم خسروا أنفسهم وأهليهم يوم القيامة ألا ذلك هو الخسران المبين ولا خسارة أعظم من خسارة من فرق بينه وبين أحبته يوم الحسرة والندامة."
    },
    {
      "ayah": 46,
      "surah": 10,
      "text": "يقول تعالى مخاطبا لرسوله صلى الله عليه وسلم \"وإما نرينك بعض الذي نعدهم\" أي ننتقم منهم في حياتك لتقر عينك منهم \"أو نتوفينك فإلينا مرجعهم\" أي مصيرهم ومنقلبهم والله شهيد على أفعالهم بعدك وقد قال الطبراني: حدثنا عبدالله بن أحمد حدثنا عقبة بن مكرم حدثنا أبو بكر الحنفي حدثنا داود بن الجارود عن أبي السليل عن حذيفة بن أسيد عن النبي صلى الله عليه وسلم قال \"عرضت علي أمتي البارحة لدى هذه الحجرة أولها وآخرها\" فقال رجل: يا رسول الله عرض عليك من خلق فكيف من لم يخلق؟ فقال \"صوروا لي في الطين حتى أني لأعرف بالإنسان منهم من أحدكم بصاحبه\" ورواه عن محمد بن عثمان بن أبي شيبة عن عقبة بن مكرم عن يونس بن بكير عن زياد بن المنذر عن أبي الطفيل عن حذيفة بن أسيد به نحوه."
    },
    {
      "ayah": 47,
      "surah": 10,
      "text": "وقوله \"ولكل أمة رسول فإذا جاء رسولهم\" قال مجاهد يعني يوم القيامة \"قضي بينهم بالقسط\" الآية كقوله تعالى \"وأشرقت الأرض بنور ربها\" الآية; فكل أمة تعرض على الله بحضرة رسولها وكتاب أعمالها من خير وشر موضوع شاهد عليهم وحفظتهم من الملائكة شهود أيضا أمة بعد أمة وهذه الأمة الشريفة وإن كانت آخر الأمم في الخلق إلا أنها أول الأمم يوم القيامة يفصل بينهم ويقضي لهم كما جاء في الصحيحين عن رسول الله صلي الله عليه وسلم أنه قال \"نحن الآخرون السابقون يوم القيامة المقضى لهم قبل الخلائق\" فأمته إنما حازت قصب السبق بشرف رسولها صلوات الله وسلامه عليه دائما إلى يوم الدين."
    },
    {
      "ayah": 48,
      "surah": 10,
      "text": "يقول تعالى مخبرا عن كفر هؤلاء المشركين في استعجالهم العذاب وسؤالهم عن وقته قبل التعين مما لا فائدة لهم فيه كقوله \"يستعجل بها الذين لا يؤمنون بها والذين آمنوا مشفقون منها ويعلمون أنها الحق\" أي كائنة لا محالة وواقعة وإن لم يعلموا وقتها عينا ولهذا أرشد تعالى رسوله صلى الله عليه وسلم إلى جوابهم."
    },
    {
      "ayah": 49,
      "surah": 10,
      "text": "فقال \"قل لا أملك لنفسي ضرا ولا نفعا\" الآية أي لا أقول إلا ما علمني ولا أقدر على شيء مما استأثر به إلا أن يطلعني الله عليه فأنا عبده ورسوله إليكم وقد أخبرتكم بمجيء الساعة وأنها كائنة ولم يطلعني على وقتها ولكن \"لكل أمة أجل\" أي لكل قرن مدة من العمر مقدرة فإذا انقضى أجلهم \"فلا يستأخرون ساعة ولا يستقدمون\" كقوله \"ولن يؤخر الله نفسا إذا جاء أجلها\" الآية ثم أخبر أن عذاب الله سيأتيهم بغتة."
    },
    {
      "ayah": 5,
      "surah": 10,
      "text": "يخبر تعالى عما خلق من الآيات الدالة على كمال قدرته وعظيم سلطانه أنه جعل الشعاع الصادر عن جرم الشمس ضياء وجعل شعاع القمر نورا هذا فن وهذا فن آخر ففاوت بينهما لئلا يشتبها وجعل سلطان الشمس بالنهار وسلطان القمر بالليل وقدر القمر منازل فأول ما يبدو صغيرا ثم يتزايد نوره وجرمه حتى يستوسق ويكمل إبداره ثم يشرع في النقص حتى يرجع إلى حالته الأولى في تمام شهر كقوله تعالى \"والقمر قدرناه منازل حتى عاد كالعرجون القديم لا الشمس ينبغي لها أن تدرك القمر ولا الليل سابق النهار وكل في فلك يسبحون\" وقوله تعالى \"والشمس والقمر حسبانا\" الآية وقوله في هذه الآية الكريمة \"وقدره\" أي القمر \"منازل لتعلموا عدد السنين والحساب\" فبالشمس تعرف الأيام وبسير القمر تعرف الشهور والأعوام \"ما خلق الله ذلك إلا بالحق\" أي لم يخلقه عبثا بل له حكمة عظيمة في ذلك وحجة بالغة كقوله تعالى \"وما خلقنا السماء والأرض وما بينهما باطلا ذلك ظن الذين كفروا فويل للذين كفروا من النار\" وقال تعالى \"أفحسبتم أنما خلقناكم عبثا وأنكم إلينا لا ترجعون فتعالى الله الملك الحق لا إله إلا هو رب العرش الكريم\" وقوله \"نفصل الآيات\" أي نبين الحجج والأدلة \"لقوم يعلمون\"."
    },
    {
      "ayah": 50,
      "surah": 10,
      "text": "فقال \"قل أرأيتم إن أتاكم عذابه بياتا أو نهارا\" أي ليلا أو نهارا \"ماذا يستعجل منه المجرمون\""
    },
    {
      "ayah": 51,
      "surah": 10,
      "text": "\"أثم إذا ما وقع آمنتم به الآن وقد كنتم به تستعجلون\" يعني أنهم إذا جاءهم العذاب قالوا \"ربنا أبصرنا وسمعنا\" الآية وقال تعالى \"فلما رأوا بأسنا قالوا آمنا بالله وحده وكفرنا بما كنا به مشـركين فلم يك ينفعهم إيمانهم لما رأوا بأسنا سنة الله التي قد خلت في عباده وخسر هنالك الكافرون\"."
    },
    {
      "ayah": 52,
      "surah": 10,
      "text": "\"ثم قيل للذين ظلموا ذوقوا عذاب الخلد\" أي يوم القيامة يقال لهم هذا تبكيتا وتقريعا كقوله \"يوم يدعون إلى نار جهنم دعا هذه النار التي كنتم بها تكذبون أفسحر هذا أم أنتم لا تبصرون اصلوها فاصبروا أو لا تصبروا سواء عليكم إنما تجزون ما كنتم تعملون\""
    },
    {
      "ayah": 53,
      "surah": 10,
      "text": "يقول تعالى ويستخبرونك \"أحق هو\" أي الميعاد والقيامة من الأجداث بعد صيرورة الأجسام ترابا \" قل إي وربي إنه لحق وما أنتم بمعجزين\" أي ليس صيرورتكم ترابا بمعجز الله عن إعادتكم كما بدأكم من العدم فـ\"إنما أمره إذا أراد شيئا أن يقول له كن فيكون\" وهذه الآية ليس لها نظير في القرآن إلا آيتان أخريان يأمر الله تعالى رسوله أن يقسم به على من أنكر المعاد في سورة سبأ \"وقال الذين كفروا لا تأتينا الساعة قل بلى وربي لتأتينكم\" وفي التغابن \"زعم الذين كفروا أن لن يبعثوا قل بلى وربي لتبعثن ثم لتنبؤن بما عملتم وذلك على الله يسير\"."
    },
    {
      "ayah": 54,
      "surah": 10,
      "text": "ثم أخبر تعالى أنه إذا قامت القيامة يود الكافر لو افتدى من عذاب الله بملء الأرض ذهبا \"وأسروا الندامة لما رأوا العذاب وقضي بينهم بالقسط\" أي بالحق \"وهم لا يظلمون\"."
    },
    { "ayah": 55, "surah": 10, "text": "يخبر تعالى أنه مالك السموات والأرض وأن وعده حق كائن لا محالة." },
    {
      "ayah": 56,
      "surah": 10,
      "text": "وأنه يحيي ويميت وإليه مرجعهم; وأنه القادر على ذلك العليم بما تفرق من الأجسام وتمزق في سائر أقطار الأرض والبحار والقفار."
    },
    {
      "ayah": 57,
      "surah": 10,
      "text": "يقول تعالى ممتنا على خلقه بما أنزله من القرآن العظيم على رسوله الكريم \"يا أيها الناس قد جاءتكم موعظة من ربكم\" أي زاجر عن الفواحش \"وشفاء لما في الصدور\" أي من الشبه والشكوك وهو إزالة ما فيها من رجس ودنس وهدى ورحمة أي يحصل به الهداية والرحمة من الله تعالى; وإنما ذلك للمؤمنين به والمصدقين الموقنين بما فيه كقوله تعالى \"وننزل من القرآن ما هو شفاء ورحمة للمؤمنين ولا يزيد الظالمين إلا خسارا\" وقوله \"قل هو للذين آمنوا هدى وشفاء\" الآية."
    },
    {
      "ayah": 58,
      "surah": 10,
      "text": "وقوله تعالى \"قل بفضل الله وبرحمته فبذلك فليفرحوا\" أي بهذا الذي جاءهم من الله من الهدى ودين الحق فليفرحوا فإنه أولى ما يفرحون به \"هو خير مما يجمعون\" أي من حطام الدنيا وما فيها من الزهرة الفانية الذاهبة لا محالة كما قال ابن أبي حاتم في تفسير هذه الآية وذكر بسنده عن بقية بن الوليد عن صفوان بن عمرو: سمعت أيفع بن عبدالله الكلاعي يقول لما قدم خراج العراق إلى عمر رضي الله عنه خرج عمر ومولى له فجعل عمر يعد الإبل فإذا هي أكثر من ذلك فجعل عمر يقول: الحمد للّه تعالى ويقول مولاه هذا والله من فضل الله ورحمته فقال عمر: كذبت ليس هذا هو الذي يقول الله تعالى \"قل بفضل الله وبرحمته\" الآية وهذا مما يجمعون وقد أسنده الحافظ أبو القاسم الطبراني فرواه عن أبي زرعة الدمشقي عن حيوة بن شريح عن بقية فذكره."
    },
    {
      "ayah": 59,
      "surah": 10,
      "text": "قال ابن عباس ومجاهد والضحاك وقتادة وعبدالرحمن بن زيد بن أسلم وغيرهم: نزلت إنكارا على المشركين فيما كانوا يحلون ويحرمون من البحائر والسوائب والوصايا كقوله تعالى \"وجعلوا للّه مما ذرأ من الحرث والأنعام نصيبا\" الآيات وقال الإمام أحمد: حدثنا محمد بن جعفر حدثنا شعبة عن أبي إسحق سمعت أبا الأحوص وهو عوف بن مالك بن نضلة يحدث عن أبيه قال: أتيت رسول الله صلي الله عليه وسلم وأنا رث الهيئة فقال \"هل لك مال؟ \"قلت نعم. قال \"من أي المال\"؟ قال قلت من كل المال من الإبل والرقيق والخيل والغنم فقال \"إذا آتاك الله مالا فلير عليك - وقال - هل تنتج إبلك صحاحا آذانها فتعمد إلى موسي فتقطع آذانها فتقول هذه بحر وتشق جلودها وتقول هذه صرم وتحرمها عليك وعلى أهلك\" قال نعم قال \"فإن ما أتاك الله لك حل ساعد الله أشد من ساعدك وموسي الله أحد من موساك\" وذكر تمام الحديث ثم رواه عن سفيان بن عيينة عن أبي الزعراء عمرو بن عمرو عن عمه أبي الأحوص وعن بهز بن أسد عن حماد بن سلمة عن عبدالملك بن عمير عن أبي الأحوص به وهذا حديث جيد قوي الإسناد وقد أنكر الله تعالى على من حرم ما أحل الله أو أحل ما حرم بمجرد الآراء والأهواء التي لا مستند لها ولا دليل عليها ثم توعدهم على ذلك يوم القيامة."
    },
    {
      "ayah": 6,
      "surah": 10,
      "text": "\"إن في اختلاف الليل والنهار\" أي تعاقبهما إذا جاء هذا ذهب هذا وإذا ذهب هذا جاء هذا لا يتأخر عنه شيئا كقوله تعالى \"يغشى الليل النهار يطلبه حثيثا\" وقال \"لا الشمس ينبغي لها أن تدرك القمر\" الآية. وقال تعالى \"فالق الإصباح وجعل الليل سكنا\" الآية وقوله \"وما خلق الله في السموات والأرض\" أي من الآيات الدالة على عظمته تعالى كما قال \"وكأين من آية في السموات والأرض\" الآية وقوله \"قل انظروا ماذا في السموات والأرض وما تغني الآيات والنذر عن قوم لا يؤمنون\" وقال \"أفلم يروا إلى ما بين أيديهم وما خلفهم من السماء والأرض\" وقال \"إن في خلق السموات والأرض واختلاف الليل والنهار لآيات لأولي الألباب\" أي العقول: وقال ههنا \"لآيات لقوم يتقون\" أي عقاب الله وسخطه وعذابه."
    },
    {
      "ayah": 60,
      "surah": 10,
      "text": "\"وما ظن الذين يفترون على الله الكذب يوم القيامة\" أي ما ظنهم أن يصنع بهم يوم مرجعهم إلينا يوم القيامة وقوله \"إن الله لذو فضل على الناس\" قال ابن جرير في تركه معاجلتهم بالعقوبة في الدنيا \"قلت\" ويحتمل أن يكون المراد لذو فضل على الناس فيما أباح لهم مما خلقه من المنافع في الدنيا ولم يحرم عليهم إلا ما هو ضار لهم في دنياهم أو دينهم \"ولكن أكثرهم لا يشكرون\" بل يحرمون ما أنعم الله به عليهم ويضيقون على أنفسهم فيجعلون بعضا حلالا وبعضا حراما. وهذا قد وقع فيه المشركون فيما شرعوه لأنفسهم وأهل الكتاب فيما ابتدعوه في دينهم. وقال ابن أبي حاتم في تفسير هذه الآية: حدثنا أبي حدثنا أحمد بن أبي الحواري حدثنا رباح حدثنا عبدالله بن سليمان حدثنا موسى بن الصباح في قوله عز وجل \"إن الله لذو فضل على الناس\" قال إذا كان يوم القيامة يؤتي بأهل ولاية الله عز وجل فيقومون بين يدي الله عز وجل ثلاثة أصناف فيؤتي برجل من الصنف الأول فيقول: عبدي لماذا عملت؟ فيقول يا رب خلقت الجنة وأشجارها وثمارها وأنهارها وحورها ونعيمها وما أعددت لأهل طاعتك فيها فأسهرت ليلي وأظمأت نهاري شوقا إليها - قال - فيقول الله تعالى عبدي إنما عملت للجنة هذه الجنة فادخلها ومن فضلي عليك قد أعتقتك من النار ومن فضلي عليك أن أدخلك جنتي فيدخل ومن معه الجنة - قال - ثم يؤتي برجل من الصنف الثاني فيقول عبدي لماذا عملت؟ فيقول يا رب خلقت نارا وخلقت أغلالها وسعيرها وسمومها ويحمومها وما أعددت لأعدائك وأهل معصيتك فيها فأسهرت ليلي وأظمأت نهاري خوفا منها فيقول عبدي إنما عملت ذلك. خوفا من ناري فإني قد أعتقتك من النار ومن فضلي عليك أن أدخلك جنتي فيدخل ومن معه الجنة. ثم يؤتي برجل من الصنف الثالث فيقول عبدي لماذا عملت؟ فيقول رب حبا لك وشوقا إليك وعزتك لقد أسهرت ليلى وأظمأت نهاري شوقا إليك وحبا لك فيقول تبارك وتعالى: عبدي إنما عملت حبا لي وشوقا إلي فيتجلى له الرب جل جلاله ويقول ها أنا ذا فانظر إلي ثم يقول من فضلي عليك أن أعتقك من النار وأبيحك جنتي وأزيرك ملائكتي وأسلم عليك بنفسي فيدخل هو ومن معه الجنة."
    },
    {
      "ayah": 61,
      "surah": 10,
      "text": "يخبر تعالى نبيه صلى الله عليه وسلم أنه يعلم جميع أحواله وأحوال أمته وجميع الخلائق في كل ساعة وأوان ولحظة وأنه لا يعزب عن علمه وبصره مثقال ذرة في حقارتها وصغرها في السموات ولا في الأرض ولا أصغر منها ولا أكبر إلا في كتاب مبين كقوله \"وعنده مفاتح الغيب لا يعلمها إلا هو ويعلم ما في البر والبحر وما تسقط من ورقة إلا يعلمها ولا حبة في ظلمات الأرض ولا رطب ولا يابس إلا في كتاب مبين\" فأخبر تعالى أنه يعلم حركة الأشجار وغيرها من الجمادات وكذلك الدواب السارحة في قوله \"وما من دابة في الأرض ولا طائر يطير بجناحيه إلا أمم أمثالكم\" الآية وقال تعالى \"وما من دابة في الأرض إلا على الله رزقها\" الآية وإذا كان هذا علمه بحركات هذه الأشياء فكيف علمه بحركات المكلفين المأمورين بالعبادة كما قال تعالى \"وتوكل على العزيز الرحيم الذي يراك حين تقوم وتقلبك في الساجدين\" ولهذا قال تعالى \"وما تكون في شأن وما تتلو منه من قرآن ولا تعملون من عمل إلا كنا عليكم شهودا إذ تفيضون فيه\" أي إذ تأخذون في ذلك الشيء نحن مشاهدون لكم راءون سامعون ولهذا قال صلى الله عليه وسلم لما سأله جبريل عن الإحسان \"أن تعبد الله كأنك تراه فإن لم تكن تراه فإنه يراك\""
    },
    {
      "ayah": 62,
      "surah": 10,
      "text": "يخبر تعالى أن أولياءه هم الذين آمنوا وكانوا يتقون كما فسرهم ربهم فكل من كان تقيا كان لله وليا فـ\"لا خوف عليهم\" أي فيما يستقبلونه من أهوال الآخرة \"ولا هم يحزنون\" على ما وراءهم في الدنيا وقال عبدالله بن مسعود وابن عباس وغير واحد من السلف أولياء الله الذين إذا رءوا ذكر الله وقد ورد هذا في حديث مرفوع كما قال البزار حدثنا علي بن حرب الرازي حدثنا محمد بن سعيد بن سابق حدثنا يعقوب بن عبدالله الأشعري وهو القمي عن جعفر بن أبي المغيرة عن سعيد بن جبير عن ابن عباس قال: قال رجل يا رسول الله من أولياء الله؟ قال \"الذين رءوا ذكر الله\" ثم قال البزار وقد روى عن سعيد مرسلا وقال ابن جرير حدثنا أبو هشام الرفاعي حدثنا أبو فضيل حدثنا أبي عن عمارة بن القعقاع عن أبي زرعة عن عمرو بن جرير البجلي عن أبي هريرة رضي الله عنه قال: قال رسول الله صلي الله عليه وسلم \"إن من عباد الله عبادا يغبطهم الأنبياء والشهداء\" قيل من هم يا رسول الله لعلنا نحبهم؟ قال \"هم قوم تحابوا في الله من غير أموال ولا أنساب وجوههم نور على منابر من نور لا يخافون إذا خاف الناس ولا يحزنون إذا حزن الناس\" ثم قرأ \"ألا إن أولياء الله لا خوف عليهم ولا هم يحزنون\" ثم رواه أيضا أبو داود من حديث جرير عن عمارة ابن القعقاع عن أبي زرعة بن عمرو بن جرير عن عمر بن الخطاب رضي الله عنه عن النبي صلي الله عليه وسلم بمثله وهذا أيضا إسناد جيد إلا أنه منقطع بين أبي زرعة وعمر بن الخطاب والله أعلم وفي حديث الإمام أحمد عن أبي النضر عن عبدالحميد بن بهرام عن شهر بن حوشب عن عبدالرحمن بن غنم عن أبي مالك الأشعري قال: قال رسول الله صلي الله عليه وسلم \"يأتي من أفناء الناس ونوازع القبائل قوم لم تتصل بينهم أرحام متقاربة تحابوا في الله وتصافوا في الله يضع الله لهم يوم القيامة منابر من نور فيجلسهم عليها يفزع الناس ولا يفزعون وهم أولياء الله الذين لا خوف عليهم ولا هم يحزنون\" والحديث مطول وقال الإمام أحمد حدثنا عبدالرزاق أخبرنا سفيان عن الأعمش عن ذكوان بن أبي صالح عن رجل عن أبي الدرداء رضي الله عنه عن النبي صلي الله عليه وسلم."
    },
    {
      "ayah": 63,
      "surah": 10,
      "text": "في قوله \"لهم البشرى في الحياة الدنيا وفي الآخرة\" قال \"الرؤيا الصالحة يراها المسلم أو ترى له\" وقال ابن جرير حدثني أبو السائب حدثنا أبو معاوية عن الأعمش عن أبي صالح عن عطاء بن يسار عن رجل من أهل مصر عن أبي الدرداء في قوله \"لهم البشرى في الحياة الدنيا وفي الآخرة\" قال سأل رجل أبا الدرداء عن هذه الآية فقال: لقد سألت عن شيء ما سمعت أحدا سأل عنه بعد رجل سأل عنه رسول الله صلي الله عليه وسلم فقال \"هي الرؤيا الصالحة يراها الرجل المسلم أو ترى له بشراه في الحياة الدنيا وبشراه في الآخرة الجنة\" ثم رواه ابن جرير عن سفيان عن ابن المنكدر عن عطاء بن يسار عن رجل من أهل مصر أنه سأل أبا الدرداء عن هذه الأية فذكر نحو ما تقدم ثم قال ابن جرير حدثني المثنى حدثنا حجاج بن منهال حدثنا حماد بن زيد عن عاصم بن بهدلة عن أبي صالح قال: سمعت أبا الدرداء سئل عن هذه الآية \"الذين آمنوا وكانوا يتقون لهم البشرى\" فذكر نحوه سواء وقال الإمام أحمد حدثنا عفان حدثنا أبان حدثنا يحيى عن أبي سلمة عن عبادة بن الصامت أنه سأل رسول الله صلي الله عليه وسلم فقال يا رسول الله أرأيت قول الله تعالى \"لهم البشرى في الحياة الدنيا وفي الآخرة\" فقال \"لقد سألتني عن شيء ما سألني عنه أحد من أمتي - أو قال أحد قبلك - تلك الرؤيا الصالحة يراها الرجل أو ترى له\" وكذا رواه أبو داود الطيالسي عن عمران القطان عن يحيى بن أبي كثير به ورواه الأوزاعي عن يحيى بن أبي كثير فذكره ورواه علي بن المبارك عن يحيى عن أبي سلمة قال: نبئنا عن عبادة بن الصامت سأل رسول الله صلي الله عليه وسلم عن هذه الآية فذكره وقال ابن جرير حدثني أبو حميد الحمصي حدثنا يحيى بن سعيد حدثنا عمر بن عمرو بن عبدالأخموشي عن حميد بن عبدالله المزني قال: أتى رجل عبادة بن الصامت فقال آية في كتاب الله أسألك عنها قول الله تعالى \"لهم البشرى في الحياة الدنيا\" فقال عبادة ما سألني عنها أحد قبلك سألت عنها نبي الله فقال مثل ذلك \"ما سألني عنها أحد قبلك الرؤيا الصالحة يراها العبد المؤمن في المنام أو ترى له\" ثم رواه من حديث موسى بن عبيدة عن أيوب بن خالد بن صفوان عن عبادة بن الصامت أنه قال لرسول الله صلي الله عليه وسلم صلى الله تعالى عليه وعلى آله وسلم\" لهم البشرى في الحياة الدنيا وفي الآخرة\" فقد عرفنا بشرى الآخرة الجنة فما بشرى الدنيا؟ قال \"الرؤيا الصالحة يراها العبد أو ترى له; وهي جزء من أربعة وأربعين جزءا أو سبعين جزءا من النبوة\" وقال الإمام أحمد أيضا حدثنا بهز حدثنا حماد حدثنا أبو عمران عن عبدالله بن الصامت عن أبي ذر أنه قال يا رسول الله الرجل يعمل العمل ويحمده الناس عليه ويثنون عليه به فقال رسول الله صلي الله عليه وسلم \"تلك عاجل بشرى المؤمن\" رواه مسلم وقال أحمد أيضا حدثنا حسن يعني الأشيب حدثنا ابن لهيعة حدثنا دراج عن عبدالرحمن بن جبير عن عبدالله بن عمرو عن رسول الله صلي الله عليه وسلم أنه قال \"لهم البشرى في الحياة الدنيا\" - قال - الرؤيا الصالحة يبشرها المؤمن جزء من تسعة وأربعين جزءا من النبوة فمن رأى ذلك فليخبر بها ومن رأى سوى ذلك فإنما هو من الشيطان ليحزنه فلينفث عن يساره ثلاثا وليكبر ولا يخبر بها أحدا\". لم يخرجوه وقال ابن جرير حدثني يونس أنبأنا ابن وهب حدثني عمرو بن الحارث أن دراجا أبا السمح حدثه عن عبدالرحمن بن جبر عن عبدالله بن عمرو عن رسول الله صلي الله عليه وسلم أنه قال \"هم البشرى في الحياة الدنيا\" الرؤيا الصالحة يبشرها المؤمن جزء من ستة وأربعين جزءا من النبوة\" وقال أيضا ابن جرير حدثني محمد بن أبي حاتم المؤدب حدثنا عمار بن محمد حدثنا الأعمش عن أبي صالح عن أبي هريرة عن النبي صلي الله عليه وسلم \"لهم البشرى في الحياة الدنيا وفي الآخرة\" - قال - \"في الدنيا الرؤيا الصالحة يراها العبد أو ترى له وهي في الآخرة الجنة\" ثم رواه عن أبي كريب عن أبي بكر بن عياش عن أبي حصين عن أبي صالح عن أبي هريرة أنه قال: الرؤيا الحسنة بشرى من الله وهي من المبشرات هكذا رواه من هذه الطريق موقوفا وقال أيضا حدثنا أبو كريب حدثنا أبو بكر حدثنا هشام عن ابن سيرين عن أبي هريرة قال: قال رسول الله صلي الله عليه وسلم \"الرؤيا الحسنة هي البشرى يراها المسلم أو ترى له\" وقال ابن جرير حدثني أحمد بن حماد الدولابي حدثنا سفيان عن عبيدالله بن أبي يزيد عن أبيه عن سباع بن ثابت عن أم كريز الكعبية سمعت رسول الله صلي الله عليه وسلم يقول \"ذهبت النبوة وبقيت المبشرات\"وهكذا روى عن ابن مسعود وأبي هريرة وابن عباس ومجاهد وعروة بن الزبير ويحي بن أبي كثير وإبراهيم النخعي وعطاء بن أبي رباح وغيرهم أنهم فسروا ذلك بالرؤيا الصالحة وقيل المراد بذلك بشرى الملائكة للمؤمن عند احتضاره بالجنة والمغفرة كقوله تعالي \"إن الذين قالوا ربنا الله ثم استقاموا تتنزل عليهم الملائكة ألا تخافوا ولا تحزنوا وأبشروا بالجنة التي كنتم توعدون نحن أولياؤكم في الحياة الدنيا وفي الآخرة ولكم فيها ما تشتهي أنفسكم ولكم فيها ما تدعون نزلا من غفور رحيم\" وفي حديث البراء رضي الله عنه أن المؤمن إذا حضره الموت جاءه ملائكة بيض الوجوه بيض الثياب فقالوا أخرجي أيتها الروح الطيبة إلى روح وريحان ورب غير غضبان فتخرج من فمه كما تسيل القطرة من فم السقاء وأما بشراهم في الآخرة فكما قال تعالى \"لا يحزنهم الفزع الأكبر وتتلقاهم الملائكة هذا يومكم الذي كنتم توعدون\" - وقال تعالى \"يوم ترى المؤمنين والمؤمنات يسعى نورهم بين أيديهم وبأيمانهم بشراكم اليوم جنات تجري من تحتها الأنهار خالدين فيها ذلك هو الفوز العظيم\" وقوله \"لا تبديل لكلمات الله\" أي هذا الوعد لا يبدل ولا يخلف ولا يغير بل هو مقرر مثبت كائن لا محالة ذلك هو الفوز العظيم\"."
    },
    {
      "ayah": 64,
      "surah": 10,
      "text": "في قوله \"لهم البشرى في الحياة الدنيا وفي الآخرة\" قال \"الرؤيا الصالحة يراها المسلم أو ترى له\" وقال ابن جرير حدثني أبو السائب حدثنا أبو معاوية عن الأعمش عن أبي صالح عن عطاء بن يسار عن رجل من أهل مصر عن أبي الدرداء في قوله \"لهم البشرى في الحياة الدنيا وفي الآخرة\"قال سأل رجل أبا الدرداء عن هذه الآية فقال: لقد سألت عن شيء ما سمعت أحدا سأل عنه بعد رجل سأل عنه رسول الله صلي الله عليه وسلم فقال \"هي الرؤيا الصالحة يراها الرجل المسلم أو ترى له بشراه في الحياة الدنيا وبشراه في الآخرة الجنة\" ثم رواه ابن جرير عن سفيان عن ابن المنكدر عن عطاء بن يسار عن رجل من أهل مصر أنه سأل أبا الدرداء عن هذه الأية فذكر نحو ما تقدم ثم قال ابن جرير حدثني المثنى حدثنا حجاج بن منهال حدثنا حماد بن زيد عن عاصم بن بهدلة عن أبي صالح قال: سمعت أبا الدرداء سئل عن هذه الآية \"الذين آمنوا وكانوا يتقون لهم البشرى\" فذكر نحوه سواء وقال الإمام أحمد حدثنا عفان حدثنا أبان حدثنا يحيى عن أبي سلمة عن عبادة بن الصامت أنه سأل رسول الله صلي الله عليه وسلم فقال يا رسول الله أرأيت قول الله تعالى \"لهم البشرى في الحياة الدنيا وفي الآخرة\" فقال \"لقد سألتني عن شيء ما سألني عنه أحد من أمتي - أو قال أحد قبلك - تلك الرؤيا الصالحة يراها الرجل أو ترى له\" وكذا رواه أبو داود الطيالسي عن عمران القطان عن يحيى بن أبي كثير به ورواه الأوزاعي عن يحيى بن أبي كثير فذكره ورواه علي بن المبارك عن يحيى عن أبي سلمة قال: نبئنا عن عبادة بن الصامت سأل رسول الله صلي الله عليه وسلم عن هذه الآية فذكره وقال ابن جرير حدثني أبو حميد الحمصي حدثنا يحيى بن سعيد حدثنا عمر بن عمرو بن عبدالأخموشي عن حميد بن عبدالله المزني قال: أتى رجل عبادة بن الصامت فقال آية في كتاب الله أسألك عنها قول الله تعالى \"لهم البشرى في الحياة الدنيا\" فقال عبادة ما سألني عنها أحد قبلك سألت عنها نبي الله فقال مثل ذلك \"ما سألني عنها أحد قبلك الرؤيا الصالحة يراها العبد المؤمن في المنام أو ترى له\" ثم رواه من حديث موسى بن عبيدة عن أيوب بن خالد بن صفوان عن عبادة بن الصامت أنه قال لرسول الله صلي الله عليه وسلم صلى الله تعالى عليه وعلى آله وسلم\" لهم البشرى في الحياة الدنيا وفي الآخرة\" فقد عرفنا بشرى الآخرة الجنة فما بشرى الدنيا؟ قال \"الرؤيا الصالحة يراها العبد أو ترى له; وهي جزء من أربعة وأربعين جزءا أو سبعين جزءا من النبوة\" وقال الإمام أحمد أيضا حدثنا بهز حدثنا حماد حدثنا أبو عمران عن عبدالله بن الصامت عن أبي ذر أنه قال يا رسول الله الرجل يعمل العمل ويحمده الناس عليه ويثنون عليه به فقال رسول الله صلي الله عليه وسلم \"تلك عاجل بشرى المؤمن\" رواه مسلم وقال أحمد أيضا حدثنا حسن يعني الأشيب حدثنا ابن لهيعة حدثنا دراج عن عبدالرحمن بن جبير عن عبدالله بن عمرو عن رسول الله صلي الله عليه وسلم أنه قال \"لهم البشرى في الحياة الدنيا\" - قال - الرؤيا الصالحة يبشرها المؤمن جزء من تسعة وأربعين جزءا من النبوة فمن رأى ذلك فليخبر بها ومن رأى سوى ذلك فإنما هو من الشيطان ليحزنه فلينفث عن يساره ثلاثا وليكبر ولا يخبر بها أحدا\". لم يخرجوه وقال ابن جرير حدثني يونس أنبأنا ابن وهب حدثني عمرو بن الحارث أن دراجا أبا السمح حدثه عن عبدالرحمن بن جبر عن عبدالله بن عمرو عن رسول الله صلي الله عليه وسلم أنه قال \"لهم البشرى في الحياة الدنيا\" الرؤيا الصالحة يبشرها المؤمن جزء من ستة وأربعين جزءا من النبوة\". وقال أيضا ابن جرير حدثني محمد بن أبي حاتم المؤدب حدثنا عمار بن محمد حدثنا الأعمش عن أبي صالح عن أبي هريرة عن النبي صلي الله عليه وسلم \"لهم البشرى في الحياة الدنيا وفي الآخرة\" - قال - \"في الدنيا الرؤيا الصالحة يراها العبد أو ترى له وهي في الآخرة الجنة\" ثم رواه عن أبي كريب عن أبي بكر بن عياش عن أبي حصين عن أبي صالح عن أبي هريرة أنه قال: الرؤيا الحسنة بشرى من الله وهي من المبشرات هكذا رواه من هذه الطريق موقوفا وقال أيضا حدثنا أبو كريب حدثنا أبو بكر حدثنا هشام عن ابن سيرين عن أبي هريرة قال: قال رسول الله صلي الله عليه وسلم \"الرؤيا الحسنة هي البشرى يراها المسلم أو ترى له\" وقال ابن جرير حدثني أحمد بن حماد الدولابي حدثنا سفيان عن عبيدالله بن أبي يزيد عن أبيه عن سباع بن ثابت عن أم كريز الكعبية سمعت رسول الله صلي الله عليه وسلم يقول \"ذهبت النبوة وبقيت المبشرات\" وهكذا روى عن ابن مسعود وأبي هريرة وابن عباس ومجاهد وعروة بن الزبير ويحي بن أبي كثير وإبراهيم النخعي وعطاء بن أبي رباح وغيرهم أنهم فسروا ذلك بالرؤيا الصالحة وقيل المراد بذلك بشرى الملائكة للمؤمن عند احتضاره بالجنة والمغفرة كقوله تعالي \"إن الذين قالوا ربنا الله ثم استقاموا تتنزل عليهم الملائكة ألا تخافوا ولا تحزنوا وأبشروا بالجنة التي كنتم توعدون نحن أولياؤكم في الحياة الدنيا وفي الآخرة ولكم فيها ما تشتهي أنفسكم ولكم فيها ما تدعون نزلا من غفور رحيم\" وفي حديث البراء رضي الله عنه أن المؤمن إذا حضره الموت جاءه ملائكة بيض الوجوه بيض الثياب فقالوا أخرجي أيتها الروح الطيبة إلى روح وريحان ورب غير غضبان فتخرج من فمه كما تسيل القطرة من فم السقاء وأما بشراهم في الآخرة فكما قال تعالى \"لا يحزنهم الفزع الأكبر وتتلقاهم الملائكة هذا يومكم الذي كنتم توعدون\" - وقال تعالى \"يوم ترى المؤمنين والمؤمنات يسعى نورهم بين أيديهم وبأيمانهم بشراكم اليوم جنات تجري من تحتها الأنهار خالدين فيها ذلك هو الفوز العظيم\" وقوله \"لا تبديل لكلمات الله \" أي هذا الوعد لا يبدل ولا يخلف ولا يغير بل هو مقرر مثبت كائن لا محالة ذلك هو الفوز العظيم\"."
    },
    {
      "ayah": 65,
      "surah": 10,
      "text": "يقول تعالى لرسوله صلي الله عليه وسلم \"ولا يحزنك\" قول هؤلاء المشركين واستعن بالله عليهم وتوكل عليه فإن العزة لله جميعا أي جميعها له ولرسوله وللمؤمنين \"هو السميع العليم\" أي السميع لأقوال عباده العليم بأحوالهم."
    },
    {
      "ayah": 66,
      "surah": 10,
      "text": "ثم أخبر تعالى أن له ملك السموات والأرض وأن المشركين يعبدون الأصنام وهي لا تملك شيئا لا ضرا ولا نفعا ولا دليل لهم على عبادتها بل إنما يتبعون في ذلك ظنونهم وتخرصهم وكذبهم وإفكهم."
    },
    {
      "ayah": 67,
      "surah": 10,
      "text": "ثم أخبر أنه الذي جعل لعباده الليل ليسكنوا فيه أي يستريحون من نصبهم وكلهم وحركاتهم \"والنهار مبصرا\" أي مضيئا لمعاشهم وسعيهم وأسفارهم ومصالحهم \"إن في ذلك لآيات لقوم يسمعون\" أي يسمعون هذه الحجج والأدلة فيعتبرون بها ويستدلون على عظمة خالقها ومقدرها ومسيرها."
    },
    {
      "ayah": 68,
      "surah": 10,
      "text": "يقول تعالى منكرا على من ادعى أن له \"ولدا سبحانه هو الغني\" أي تقدس عن ذلك هو الغني عن كل ما سواه وكل شيء فقير إليه\" له ما في السموات وما في الأرض\" أي فكيف يكون له ولد مما خلق وكل شيء مملوك له عبد له\" إن عندكم من سلطان بهذا\" أي ليس عندكم دليل على ما تقولونه من الكذب والبهتان أتقولون على الله ما لا تعلمون\" إنكار ووعيد أكيد وتهديد شديد كقوله تعالى\" وقالوا اتخذ الرحمن ولدا لقد جئتم شيئا إدا تكاد السموات يتفطرن منه وتنشق الأرض وتخر الجبال هدا أن دعوا للرحمن ولدا وما ينبغي للرحمن أن يتخذ ولدا إن كل من في السموات والأرض إلا آت الرحمن عبدا لقد أحصاهم وعدهم عدا وكلهم آتيه يوم القيامة فردا\"."
    },
    {
      "ayah": 69,
      "surah": 10,
      "text": "ثم توعد تعالى الكاذبين عليه المفترين ممن زعم أن له ولدا بأنهم لا يفلحون في الدنيا ولا في الآخرة فأما في الدنيا فإنهم إذا استدرجهم وأملى لهم متعهم قليلا ثم يضطرهم إلى عذاب غليظ."
    },
    {
      "ayah": 7,
      "surah": 10,
      "text": "يخبر الله تعالى عن حال الأشقياء الذين كفروا بلقاء الله يوم القيامة ولا يرجون في لقائه شيئا ورضوا بهذه الحياة الدنيا واطمأنت إليها نفوسهم. قال الحسن: والله ما زينوها ولا رفعوها حتى رضوا بها وهم غافلون عن آيات الله الكونية فلا يتفكرون فيها والشرعية فلا يأتمرون بها."
    },
    {
      "ayah": 70,
      "surah": 10,
      "text": "\"متاع في الدنيا\" أي مدة قريبة \"ثم إلينا مرجعهم\" أي يوم القيامة \"ثم نذيقهم العذاب الشديد\" أي الموجع المؤلم \"بما كانوا يكفرون\" أي بسبب كفرهم وافترائهم وكذبهم على الله فيما ادعوه من الإفك والزور."
    },
    {
      "ayah": 71,
      "surah": 10,
      "text": "يقول تعالى لنبيه صلوات الله وسلامه عليه \"واتل عليهم\" أي أخبرهم واقصص عليهم أي على كفار مكة الذين يكذبونك ويخالفونك \"نبأ نوح\" أي خبره مع قومه الذين كذبوه كيف أهلكهم الله ودمرهم بالغرق أجمعين عن آخرهم ليحذر هؤلاء أن يصيبهم من الهلاك والدمار ما أصاب أولئك \"إذ قال لقومه يا قوم إن كان كبر عليكم\" أي عظم عليكم \"مقامي\" أي فيكم بين أظهركم \"وتذكيري\" إياكم \"بآيات الله \" أي بحججه وبراهينه \"فعلى الله توكلت\" أي فإني لا أبالي ولا أكف عنكم سواء عظم عليكم أو لا\"فأجمعوا أمركم وشركاءكم\" أي فاجتمعوا أنتم وشركاؤكم الذين تدعون من دون الله من صنم ووثن \"ثم لا يكن أمركم عليكم غمة\" أي ولا تجعلوا أمركم عليكم ملتبسا بل افصلوا حالكم معي فإن كنتم تزعمون أنكم محقون فاقضوا إلي \"ولا تنظرون\" أي ولا تؤخروني ساعة واحدة أي مهما قدرتم فافعلوا فإني لا أباليكم ولا أخاف منكم لأنكم لستم على شيء كما قال هود لقومه \"إني أشهد الله واشهدوا أني بريء مما تشركون من دونه فكيدوني جميعا ثم لا تنظرون إني توكلت على الله ربي وربكم\" الآية."
    },
    {
      "ayah": 72,
      "surah": 10,
      "text": "\"فإن توليتم\" أي كذبتم وأدبرتم عن الطاعة \"فما سألتكم من أجر\" أي لم أطلب منكم على نصحي إياكم شيئا \"إن أجرى إلا على الله وأمرت أن أكون من المسلمين\" أي وأنا ممتثل ما أمرت به من الإسلام لله عز وجل والإسلام هو دين الأنبياء جميعا من أولهم إلى آخرهم وإن تنوعت شرائعهم وتعددت مناهلهم كما قال تعالى \"لكل جعلنا منكم شرعة ومنهاجا\" قال ابن عباس سبيلا وسنة فهذا نوح يقول \"وأمرت أن أكون من المسلمين\" وقال تعالى عن إبراهيم الخليل \"إذ قال له ربه أسلم قال أسلمت لرب العالمين ووصي بها إبراهيم بنيه ويعقوب يا بني إن الله اصطفى لكم الدين فلا تموتن إلا وأنتم مسلمون\" وقال يوسف \"رب قد آتيتني من الملك وعلمتني من تأويل الأحاديث فاطر السموات والأرض أنت وليي في الدنيا والآخرة توفني مسلما وألحقني بالصالحين\" وقال موسى \"يا قوم إن كنتم آمنتم بالله فعليه توكلوا إن كنتم مسلمين\" وقال السحرة \"ربنا أفرغ علينا صبرا وتوفنا مسلمين\" وقالت بلقيس \"رب إني ظلمت نفسي وأسلمت مع سليمان لله رب العالمين\". وقال تعالى \"إنا أنزلنا التوراة فيها هدى ونور يحكم بها النبيون الذين أسلموا\" وقال تعالى \"وإذ أوحيت إلى الحواريين أن آمنوا بي وبرسولي قالوا آمنا واشهد بأننا مسلمون\" وقال خاتم الرسل وسيد البشر صلى الله عليه وسلم \"إن صلاتي ونسكي ومحياي ومماتي لله رب العالمين لا شريك له وبذلك أمرت وأنا أول المسلمين\" أي من هذه الأمة ولهذا قال في الحديث الثابت عنه \"نحن معاشر الأنبياء أولاد علات وديننا واحد\". أي وهو عبادة الله وحده لا شريك له وإن تنوعت شرائعنا وذلك معنى قوله أولاد علات وهم الإخوة من أمهات شتى والأب واحد."
    },
    {
      "ayah": 73,
      "surah": 10,
      "text": "وقوله تعالى \"فكذبوه فنجيناه ومن معه\" أي على دينه \"في الفلك\" وهي السفينة \"وجعلناهم خلائف\" أي في الأرض \"وأغرقنا الذين كذبوا بآياتنا فانظر كيف كان عاقبة المنذرين\" أي يا محمد كيف أنجينا المؤمنين وأهلكنا المكذبين."
    },
    {
      "ayah": 74,
      "surah": 10,
      "text": "يقول تعالى ثم بعثنا من بعد نوح رسلا إلى قومهم فجاءوهم بالبينات أي بالحجج والأدلة والبراهين على صدق ما جاءوهم به \"فما كانوا ليؤمنوا بما كذبوا به من قبل\" أي فما كانت الأمم لتؤمن بما جاءتهم به رسلهم بسبب تكذيبهم إياهم أو ما أرسلوا إليهم كقوله تعالى \"ونقلب أفئدتهم وأبصارهم\" الآية. وقوله \"كذلك نطبع على قلوب المعتدين\" أي كما طبع الله على قلوب هؤلاء فما آمنوا بسبب تكذيبهم المتقدم هكذا يطبع الله على قلوب من أشبههم ممن بعدهم ويختم على قلوبهم فلا يؤمنوا حتى يروا العذاب الأليم والمراد أن الله تعالى أهلك الأمم المكذبة للرسل وأنجى من آمن بهم وذلك من بعد نوح عليه السلام فإن الناس كانوا من قبله من زمان آدم عليه السلام على الإسلام إلى أن أحدث الناس عبادة الأصنام فبعث الله إليهم نوحا عليه السلام ولهذا يقول له المؤمنون يوم القيامة أنت أول رسول بعثه الله إلى أهل الأرض. قال ابن عباس: كان بين آدم ونوح عشرة قرون كلهم على الإسلام وقال تعالى \"وكم أهلكنا من القرون من بعد نوح\" الآية وفي هذا إنذار عظيم لمشركي العرب الذين كذبوا سيد الرسل وخاتم الأنبياء والمرسلين فإنه إذا كان قد أصاب من كذب بتلك الرسل ما ذكره الله تعالى من العذاب والنكال فماذا ظن هؤلاء وقد ارتكبوا أكبر من أولئك؟."
    },
    {
      "ayah": 75,
      "surah": 10,
      "text": "يقول تعالى \"ثم بعثنا\" من بعد تلك الرسل \"موسى وهارون إلى فرعون وملئه\" أي قومه \"بأياتنا\" أي حججنا وبراهيننا \"فاستكبروا وكانوا قوما مجرمين\" أي استكبروا عن اتباع الحق والانقياد له وكانوا قوما مجرمين."
    },
    {
      "ayah": 76,
      "surah": 10,
      "text": "\"فلما جاءهم الحق من عندنا قالوا إن هذا لسحر مبين\" كأنهم قبحهم الله أقسموا على ذلك وهم يعلمون أن ما قالوه كذب وبهتان كما قال تعالى \"وجحدوا بها واستيقنتها أنفسهم ظلما وعلوا\" الآية."
    },
    {
      "ayah": 77,
      "surah": 10,
      "text": "\"قال\" لهم \"موسى\" منكرا عليهم \"أتقولون للحق لما جاءكم أسحر هذا ولا يفلح الساحرون\"."
    },
    {
      "ayah": 78,
      "surah": 10,
      "text": "قالوا أجئتنا لتلفتنا\" أي تثنينا \"عما وجدنا عليهم آباءنا\" أي الدين الذي كانوا عليه \"وتكون لكما\" أي لك ولهارون \"الكبرياء\" أي العظمة والرياسة \"في الأرض وما نحن لكما بمؤمنين\". وكثيرا ما يذكر الله تعالى قصة موسى عليه السلام مع فرعون في كتابه العزيز لأنها من أعجب القصص فإن فرعون حذر من موسى كل الحذر فسخره القدر أن رُبي هذا الذي يحذر منه على فراشه ومائدته بمنزلة الولد ثم ترعرع وعقد الله له سببا أخرجه من بين أظهرهم ورزقه النبوة والرسالة والتكليم وبعثه إليه ليدعوه إلى الله تعالى ليعبده ويرجع إليه هذا ما كان عليه فرعون من عظمة المملكة والسلطان فجاءه برسالة الله تعالى وليس له وزير سوى أخيه هارون عليه السلام فتمرد فرعون واستكبر وأخذته الحمية والنفس الخبيثة الأبية وقوى رأسه وتولى بركنه وادعى ما ليس له وتجهم على الله وعتا وبغى وأهان حزب الإيمان من بني إسرائيل والله تعالى يحفظ رسوله موسى عليه السلام وأخاه هارون ويحوطهما بعنايته ويحرسهما بعينه التي لا تنام ولم تزل المحاجة والمجادلة والآيات تقوم على يد موسى شيئا بعد شيء ومرة بعد مرة مما يبهر العقول ويدهش الألباب مما لا يقوم له شيء ولا يأتي به إلا من هو مؤيد من الله \"وما تأتيهم من آية إلا هي أكبر من أختها\" وصمم فرعون وملؤه قبحهم الله على التكذيب بذلك كله والجحد والعناد والمكابرة حتى أحل الله بهم بأسه الذي لا يرد وأغرقهم في صبيحة واحدة أجمعين \"فقطع دابر القوم الذين ظلموا والحمد لله رب العالمين\"."
    },
    {
      "ayah": 79,
      "surah": 10,
      "text": "ذكر الله سبحانه قصة السحرة مع موسى عليه السلام في سورة الأعراف وقد تقدم الكلام عليها هناك وفي هذه السورة وفي سورة طه وفي الشعراء وذلك أن فرعون لعنه الله أراد أن يبهرج على الناس ويعارض ما جاء به موسى عليه السلام من الحق المبين بزخارف السحرة والمشعوذين فانعكس عليه النظام ولم يحصل له من ذلك المرام وظهرت البراهين الإلهية في ذلك المحفل العام \"وألقي السحرة ساجدين قالوا آمنا برب العالمين رب موسى وهارون\" فظن فرعون أنه يستنصر بالسحار على رسول الله صلي الله عليه وسلم عالم الأسرار فخاب وخسر الجنة واستوجب النار \"وقال فرعون ائتوني بكل ساحر عليم\"."
    },
    {
      "ayah": 8,
      "surah": 10,
      "text": "فإن مأواهم يوم معادهم النار جزاء على ما كانوا يكسبون في دنياهم من الآثام والخطايا والإجرام مع ما هم فيه من الكفر بالله ورسوله واليوم الآخر."
    },
    {
      "ayah": 80,
      "surah": 10,
      "text": "وإنما قال لهم ذلك لأنهم لما اصطفوا وقد وعدوا من فرعون بالتقريب والعطاء الجزيل\" قالوا يا موسى إما أن تلقي وإما أن نكون أول من ألقى قال بل ألقوا\" فأراد موسى أن تكون البداءة منهم ليرى الناس ما صنعوا ثم يأتي بالحق بعده فيدمغ باطلهم. ولهذا لما ألقوا سحروا أعين الناس واسترهبوهم وجاءوا بسحر عظيم \"فأوجس في نفسه خيفة موسى قلنا لا تخف إنك أنت الأعلى وألق ما في يمينك تلقف ما صنعوا إنما صنعوا كيد ساحر ولا يفلح الساحر حيث أتى\"."
    },
    {
      "ayah": 81,
      "surah": 10,
      "text": "فعند ذلك قال موسى لما ألقوا \"ما جئتم به السحر إن الله سيبطله إن الله لا يصلح عمل المفسدين ويحق الله الحق بكلماته ولو كره المجرمون\" وقال ابن أبي حاتم حدثنا محمد بن عمار بن الحارث حدثنا عبدالرحمن يعني الدشتكي أخبرنا أبو جعفر الرازي عن ليث وهو ابن أبي سليم قال: بلغني أن هؤلاء الآيات شفاء من السحر بإذن الله تعالى تقرأ فيه إناء فيه ماء ثم يصب على رأس المسحور الآية التي من سورة يونس \"فلما ألقوا قال موسى ما جئتم به السحر إن الله سيبطله إن الله لا يصلح عمل المفسدين."
    },
    {
      "ayah": 82,
      "surah": 10,
      "text": "ويحق الله الحق بكلماته ولو كره المجرمون\" والآية الأخرى \"فوقع الحق وبطل ما كانوا يعملون\" إلى آخر أربع آيات وقوله \"إن ما صنعوا كيد ساحر ولا يفلح الساحر حيث أتى\"."
    },
    {
      "ayah": 83,
      "surah": 10,
      "text": "يخبر تعالى أنه لم يؤمن بموسى عليه السلام مع ما جاء به من الآيات البينات والحجج القاطعات والبراهين الساطعات إلا قليل من قوم فرعون من الذرية وهم الشباب على وجل وخوف منه ومن ملئه أن يردوهم إلى ما كانوا عليه من الكفر لأن فرعون لعنه الله كان جبارا عنيدا مسرفا في التمرد والعتو وكانت له سطوة ومهابة تخاف رعيته منه خوفا شديدا. قال العوفي عن ابن عباس \"فما آمن لموسى إلا ذرية من قومه على خوف من فرعون وملئهم أن يفتنهم\" قال فإن الذرية التي آمنت لموسى من أناس غير بني إسرائيل من قوم فرعون يسير منهم امرأة فرعون ومؤمن آل فرعون وخازن فرعون وامرأة خازنه وروى علي بن أبي طلحة عن ابن عباس في قوله \"فما آمن لموسى إلا ذرية من قومه\" يقول بني إسرائيل وعن ابن عباس والضحاك وقتادة الذرية القليل وقال مجاهد في قوله إلا ذرية من قومه قال هم أولاد الذين أرسل إليهم موسى من طول الزمان ومات آباؤهم; واختار ابن جرير قول مجاهد في الذرية أنها من بني إسرائيل لا من قوم فرعون لعود الضمير على أقرب المذكورين وفي هذا نظر لأنه أراد بالذرية الأحداث والشباب وأنهم من بني إسرائيل فالمعروف أن بني إسرائيل كلهم آمنوا بموسى عليه السلام واستبشروا به وقد كانوا يعرفون نعته وصفته والبشارة به من كتبهم المتقدمة وأن الله تعالى سينقذهم به من أسر فرعون ويظهرهم عليه ولهذا لما بلغ هذا فرعون حذر كل الحذر فلم يجد عنه شيئا ولما جاء موسى آذاهم فرعون أشد الأذى و\"قالوا أوذينا من قبل أن تأتينا ومن بعد ما جئنا قال عسى ربكم أن يهلك عدوكم ويستخلفكم في الأرض فينظر كيف تعملون\" وإذا تقرر هذا فكيف يكون المراد إلا ذرية من قوم موسى وهم بنو إسرائيل \"على خوف من فرعون وملئهم\" أي وأشراف قومهم أن يفتنهم ولم يكن في بني إسرائيل من يخاف منه أن يفتن عن الإيمان سوى قارون فإنه كان من قوم موسى فبغى عليهم لكنه كان طاويا إلى فرعون متصلا به متعلقا بحباله; ومن قال إن الضمير في قوله وملئهم عائد إلى فرعون وعظم الملك من أجل اتباعه أو بحذف آل فرعون وإقامة المضاف إليه مقامه فقد أبعد وإن كان ابن جرير قد حكاه عن بعض النحاة. ومما يدل على أنه لم يكن في بني إسرائيل إلا مؤمن قوله تعالى."
    },
    {
      "ayah": 84,
      "surah": 10,
      "text": "يقول تعالى مخبرا عن موسى أنه قال لبني إسرائيل \"يا قوم إن كنتم آمنتم بالله فعليه توكلوا إن كنتم مسلمين\" أي فإن الله كاف من توكل عليه \"أليس الله بكاف عبده\" \"ومن يتوكل على الله فهو حسبه\" وكثيرا ما يقرن الله تعالى بين العبادة والتوكل كقوله تعالى \"فاعبده وتوكل عليه\" \"قل هو الرحمن آمنا به وعليه توكلنا\" \"رب المشرق والمغرب لا إله إلا هو فاتخذه وكيلا\" وأمر الله تعالى المؤمنين أن يقولوا في كل صلواتهم مرات متعددة \"إياك نعبد وإياك نستعين\" وقد امتثل بنو إسرائيل ذلك."
    },
    {
      "ayah": 85,
      "surah": 10,
      "text": "أي لا تظفرهم بنا وتسلطهم علينا فيظنوا إنهم إنما سلطوا لأنهم على الحق ونحن على الباطل فيفتنوا بذلك هكذا روى عن أبي مجلز وأبي الضحى وقال ابن أبي نجيح وغيره عن مجاهد لا تعذبنا بأيدي آل فرعون ولا بعذاب من عندك فيقول قوم فرعون لو كانوا على حق ما عذبوا ولا سلطنا عليهم فيفتنوا بنا وقال عبدالرزاق أنبأنا ابن عيينة عن ابن أبي نجيح عن مجاهد \"ربنا لا تجعلنا فتنة للقوم الظالمين\" لا تسلطهم علينا فيفتنونا."
    },
    {
      "ayah": 86,
      "surah": 10,
      "text": "وقوله \"ونجنا برحمتك\" أي خلصنا برحمة منك وإحسان \"من القوم الكافرين\" أي الذين كفروا الحق وستروه ونحن قد آمنا بك وتوكلنا عليك."
    },
    {
      "ayah": 87,
      "surah": 10,
      "text": "يذكر تعالى سبب إنجائه بني إسرائيل من فرعون وقومه وكيفية خلاصهم منهم وذلك أن الله تعالى أمر موسى وأخاه هارون عليهما السلام أن يتبوءا أي يتخذا لقومها بمصر بيوتا واختلف المفسرون في معنى قوله تعالى \"واجعلوا بيوتكم قبلة\" فقال الثوري وغيره عن خصيف عن عكرمة عن ابن عباس \"واجعلوا بيوتكم قبلة\" قال أمروا أن يتخذوها مساجد وقال الثوري أيضا عن ابن منصور عن إبراهيم \"واجعلوا بيوتكم قبلة\" قال كانوا خائفين فأمروا أن يصلوا في بيوتهم وكذا قال مجاهد وأبو مالك والربيع بن أنس والضحاك وعبدالرحمن بن زيد بن أسلم وأبوه زيد بن أسلم وكأن هذا والله أعلم لما اشتد بهم البلاء من قبل فرعون وقومه وضيقوا عليهم أمروا بكثرة الصلاة كقوله تعالى \"يا أيها الذين آمنوا استعينوا بالصبر والصلاة\" وفي الحديث كان رسول الله صلي الله عليه وسلم إذا حزبه أمر صلى أخرجه أبو داود; ولهذا قال تعالى في هذه الآية \"واجعلوا بيوتكم قبلة وأقيموا الصلاة وبشر المؤمنين\" أي بالثواب والنصر القريب وقال العوفي عن ابن عباس في تفسير هذه الآية قال: قالت بنو إسرائيل لموسى عليه السلام لا نستطيع أن نظهر صلاتنا مع الفراعنة فأذن الله تعالى لهم أن يصلوا في بيوتهم وأمروا أن يجعلوا بيوتهم قبل القبلة وقال مجاهد \"واجعلوا بيوتكم قبلة\" لما خاف بنو إسرائيل من فرعون أن يقتلوا في الكنائس الجامعة أمروا أن يجعلوا بيوتهم مساجد مستقبلة الكعبة يصلون فيها سرا وكذا قال قتادة والضحاك وقال سعيد بن جبير \"واجعلوا بيوتكم قبلة\" أي يقابل بعضها بعضا."
    },
    {
      "ayah": 88,
      "surah": 10,
      "text": "هذا إخبار من الله تعالى عما دعا به موسى عليه السلام على فرعون وملئه لما أبوا قبول الحق واستمروا على ضلالهم وكفرهم معاندين جاحدين ظلما وعلوا وتكبرا وعتوا قال \"ربنا إنك آتيت فرعون وملأه زينة\" أي من أثاث الدنيا ومتاعها \"وأموالا\" أي جزيلة كثيرة \"في\" هذه \"الحياة الدنيا ربنا ليضلوا عن سبيلك\" بفتح الياء أي أعطيتهم ذلك وأنت تعلم أنهم لا يؤمنون بما أرسلتني به إليهم استدراجا منك لهم كقوله تعالى \"لنفتنهم فيه\" وقرأ أخرون ليضلوا بضم الياء أي ليفتتن بما أعطيتهم من شئت من خلقك ليظن من أغويته أنك إنما أعطيتهم هذا لحبك إياهم واعتنائك بهم \"ربنا اطمس على أموالهم\" قال ابن عباس ومجاهد أي أهلكها وقال الضحاك وأبو العالية والربيع بن أنس جعلها الله حجارة منقوشة كهيئة ما كانت وقال قتادة بلغنا أن زروعهم تحولت حجارة وقال محمد بن كعب القرظي جعل سكرهم حجارة وقال ابن أبي حاتم حدثنا إسماعيل بن أبي الحارث حدثنا يحيى بن أبي بكير عن أبي معشر حدثني محمد بن قيس أن محمد بن كعب قرأ سورة يونس على عمر بن عبدالعزيز حتى بلغ \"وقال موسى ربنا إنك آتيت فرعون وملأه زينة وأموالا في الحياة الدنيا\" إلى قوله \"ربنا اطمس على أموالهم\" الآية. فقال عمر يا أبا حمزة أي شيء الطمس؟ قال: عادت أموالهم كلها حجارة فقال عمر بن عبدالعزيز لغلام له ائتني بكيس فجاءه بكيس فإذا فيه حمص وبيض قد حول حجارة وقوله \"واشدد على قلوبهم\" قال ابن عباس أي اطبع عليها \"فلا يؤمنوا حتى يروا العذاب الأليم\" وهذه الدعوة كانت من موسى عليه السلام غضبا لله ولدينه على فرعون وملائه الذين تبين له أنهم لا خير فيهم ولا يجيء منهم شيء كما دعا نوح عليه السلام فقال \"رب لا تذر على الأرض من الكافرين ديارا إنك إن تذرهم يضلوا عبادك ولا يلدوا إلا فاجرا كفارا\" ولهذا استجاب الله تعالى لموسى عليه السلام فيهم هذه الدعوة التي أمن عليها أخوه هارون."
    },
    {
      "ayah": 89,
      "surah": 10,
      "text": "فقال تعالى \"قد أجيبت دعوتكما\" قال أبو العالية وأبو صالح وعكرمة ومحمد بن كعب القرظي والربيع بن أنس دعا موسى وأمن هارون أي قد أجبنا كما فيما سألتما من تدمير آل فرعون. وقد يحتج بهذه الآية من يقول إن تأمين المأموم على قراءة الفاتحة ينزل منزلة قراءتها لأن موسى دعا وهارون أمن وقال تعالى \"قد أجيبت دعوتكما فاستقيما\" الآية. أي كما أجيبت دعوتكما فاستقيما على أمري قال ابن جريج عن ابن عباس فاستقيما فامضيا لأمري وهي ألاستقامة; قال ابن جريج يقولون إن فرعون مكث بعد هذه الدعوة أربعين سنة وقال محمد بن كعب وعلي بن الحسين أربعين يوما."
    },
    {
      "ayah": 9,
      "surah": 10,
      "text": "هذا إخبار عن حال السعداء الذين آمنوا بالله وصدقوا المرسلين وامتثلوا ما أمروا به فعملوا الصالحات بأنه سيهديهم بإيمانهم يحتمل أن تكون الباء ههنا سببية فتقديره أي بسبب إيمانهم في الدنيا يهديهم الله يوم القيامة على الصراط المستقيم حتى يجوزوه ويخلصوا إلى الجنة. ويحتمل أن تكون للإستعانة كما قال مجاهد في قوله \"يهديهم ربهم بإيمانهم\" قال يكون لهم نورا يمشون به; وقال ابن جريج في الآية يمثل له عمله في صورة حسنة وريح طيبة إذا قام من قبره يعارض صاحبه ويبشره بكل خير فيقول له من أنت؟ فيقول أنا عملك فيجعل له نوره من بين يديه حتى يدخله الجنة فذلك قوله تعالى \"يهديهم ربهم بإيمانهم\" والكافر يمثل له عمله في صورة سيئة وريح منتنة فيلزم صاحبه ويلاده حتى يقذفه في النار وروي نحوه عن قتادة مرسلا فالله أعلم."
    },
    {
      "ayah": 90,
      "surah": 10,
      "text": "يذكر تعالى كيفية إغراقه فرعون وجنوده فإن بني إسرائيل لما خرجوا من مصر في صحبة موسى عليه السلام وهم فيما قيل ستمائة ألف مقاتل سوى الذرية وقد كانوا استعاروا من القبط حليا كثيرا فخرجوا به معهم فاشتد حنق فرعون عليهم فأرسل في المدائن حاشرين يجمعون له جنوده من أقاليمه فركب وراءهم في أبهة عظيمة وجيوش هائلة لما يريده الله تعالى بهم ولم يتخلف عنه أحد ممن له دولة وسلطان في سائر مملكته فلحقوهم وقت شروق الشمس \"فلما تراءى الجمعان قال أصحاب موسى إنا لمدركون\" وذلك أنهم لما انتهوا إلى ساحل البحر وفرعون وراءهم ولم يبق إلا أن يقاتل الجمعان وألح أصحاب موسى عليه السلام عليه في السؤال كيف المخلص مما نحن فيه؟ فيقول إني أمرت أن أسلك ههنا \"كلا إن معي ربي سيهدين\" فعند ما ضاق الأمر اتسع فأمره الله تعالى أن يضرب البحر بعصاه فضربه فانفلق البحر فكان كل فرق كالطود العظيم أي كالجبل العظيم وصار اثني عشر طريقا لكل سبط واحد وأمر الله الريح فنشفت أرضه \"فاضرب لهم طريقا في البحر يبسا لا تخاف دركا ولا تخشى\" وتخرق الماء بين الطرق كهيئة الشبابيك ليرى كل قوم الآخرين لئلا يظنوا أنهم هلكوا وجاوزت بنو إسرائيل البحر فلما خرج آخرهم منه انتهى فرعون وجنوده إلى حافته من الناحية الأخرى وهو في مائة ألف أدهم سوى بقية الألوان فلما رأى ذلك هاله وأحجم وهاب وهم بالرجوع وهيهات ولات حين مناص نفذ القدر واستجيبت الدعوة. وجاء جبريل عليه السلام على فرس وديق حائل فمر إلى جانب حصان فرعون فحمحم إليها واقتحم جبريل البحر فاقتحم الحصان وراءه ولم يبق فرعون يملك من نفسه شيئا فتجلد لأمرائه وقال لهم ليس بنو إسرائيل بأحق بالبحر منا فاقتحموا كلهم عن آخرهم وميكائيل في ساقتهم لا يترك منهم أحدا إلا ألحقه بهم فلما استوسقوا فيه وتكاملوا وهم أولهم بالخروج منه أمر الله القدير البحر أن يرتطم عليهم فارتطم عليهم فلم ينج منهم أحد وجعلت الأمواج ترفعهم وتخفضهم وتراكمت الأمواج فوق فرعون وغشيته سكرات الموت فقال وهو كذلك \"أمنت أنه لا إله إلا الذي آمنت به بنو إسرائيل وأنا من المسلمين\" فآمن حيث لا ينفعه الإيمان \"فلما رأوا بأسنا قالوا آمنا بالله وحده وكفرنا بما كنا به مشركين فلم يك ينفعهم إيمانهم لما رأوا بأسنا سنة الله التي قد خلت في عباده وخسر هنالك الكافرون\"."
    },
    {
      "ayah": 91,
      "surah": 10,
      "text": "ولهذا قال الله تعالى في جواب فرعون حين قال ما قال \"ءالآن وقد عصيت قبل\" أي أهذا الوقت تقول وقد عصيت الله قبل هذا فيما بينك وبينه \"وكنت من المفسدين\" أي في الأرض الذين أضلوا الناس \"وجعلناهم أئمة يدعون إلى النار ويوم القيامة لا ينصرون\" وهذا الذي حكى الله تعالى عن فرعون من قوله هذا في حاله ذلك من أسرار الغيب التي أعلم الله بها رسوله صلي الله عليه وسلم ولهذا قال الإمام أحمد بن حنبل رحمه الله حدثنا سليمان بن حرب حدثنا حماد بن سلمة عن علي بن زيد عن يوسف بن مهران عن ابن عباس قال: قال رسول الله صلي الله عليه وسلم \"لما قال فرعون آمنت أنه لا إله إلا الذي آمنت به بنو إسرائيل - قال - قال لي جبريل لو رأيتني وقد أخذت من حال البحر فدسسته في فيه مخافه أن تناله الرحمة\". رواه الترمذي وابن جرير وابن أبي حاتم في تفاسيرهم من حديث حماد بن سلمة به وقال الترمذي حديث حسن وقال أبو داود الطيالسي حدثنا شعبة عن عدي بن ثابت وعطاء بن السائب عن سعيد بن جبير عن ابن عباس قال: قال رسول الله صلي الله عليه وسلم \"قال لي جبريل لو رأيتني وأنا آخذ من حال البحر فأدسه في فم فرعون مخافة أن تدركه الرحمة\" وقد رواه أبو عيسى الترمذي أيضا وابن جرير أيضا من غير وجه عن شعبة به فذكر مثله وقال الترمذي حسن غريب صحيح; ووقع في رواية عند ابن جرير عن محمد بن المثنى عن غندر عن شعبة عن عطاء وعدي عن سعيد عن ابن عباس رفعه أحدهما فكأنه الآخر لم يرفع فالله أعلم وقال ابن أبي حاتم حدثنا أبو سعيد الأشج حدثنا أبو خالد الأحمر عن عمر بن عبدالله بن يعلى السقفي عن سعيد بن جبير عن ابن عباس رفعه أحدهما فكأن الآخر لم يرفع فالله أعلم وقال ابن أبي حاتم حدثنا أبو سعيد الأشج حدثنا أبو خالد الأحمر عن عمر بن عبدالله بن يعلى الثقفي عن سعيد بن جبير عن ابن عباس قال: لما أغرق الله فرعون أشار بأصبعه ورفع صوته \"آمنت أنه لا إله إلا الذي آمنت به بنو إسرائيل\" قال فخاف جبريل أن تسبق رحمة الله فيه غضبه فجعل يأخذ الحال بجناحيه فيضرب به وجهه فيرمسه وكذا رواه ابن جرير عن سفيان بن وكيع عن أبي خالد به موقوفا وقد روى من حديث أبي هريرة أيضا فقال ابن جرير حدثنا ابن حميد حدثنا حكام عن عنبسة هو ابن أبي سعيد عن كثير بن زاذان عن أبي حازم عن أبي هريرة رضي الله عنه قال: قال رسول الله صلي الله عليه وسلم \"قال لي جبريل يا محمد لو رأيتني وأنا أغطه وأدس من الحال في فيه مخافة أن تدركه رحمة الله فيغفر له\" يعني فرعون. كثير بن زاذان هذا قال ابن معين لا أعرفه وقال أبو زرعة وأبو حاتم مجهول وباقي رجاله ثقات وقد أرسل هذا الحديث جماعة من السلف قتادة وإبراهيم التيمي وميمون بن مهران ونقل عن الضحاك بن قيس أنه خطب بهذا للناس فالله أعلم."
    },
    {
      "ayah": 92,
      "surah": 10,
      "text": "وقوله \"فاليوم ننجيك ببدنك لتكون لمن خلفك آية\" قال ابن عباس وغيره من السلف إن بعض بني إسرائيل شكوا في موت فرعون فأمر الله تعالى البحر أن يلقيه بجسده سويا بلا روح وعليه درعه المعروفة على نجوة من الأرض وهو المكان المرتفع ليتحققوا موته وهلاكه ولهذا قال تعالى \"فاليوم ننجيك\" أي نرفعك على نشز من الأرض \"ببدنك\" قال مجاهد بجسدك وقال الحسن بجسم لا روح فيه وقال عبدالله بن شداد سويا صحيحا أي لم يتمزق ليتحققوه ويعرفوه وقال أبو صخر بدرعك. وكل هذه الأقوال لا منافاة بينها كما تقدم والله أعلم وقوله \"لتكون لمن خلفك آية\" أي لتكون لبني إسرائيل دليلا على موتك وهلاكك وأن الله هو القادر الذي ناصية كل دابة بيده وأنه لا يقوم لغضبه شيء ولهذا قرأ بعضهم \"لتكون لمن خلفك آية وإن كثيرا من الناس عن أياتنا لغافلون\" أي لا يتعظون بها ولا يعتبرون بها وقد كان إهلاكهم يوم عاشوراء كما قال البخاري حدثنا محمد بن بشار حدثنا غندر حدثنا شعبة عن أبي بشر عن سعيد بن جبير عن ابن عباس قال قدم النبي صلي الله عليه وسلم المدينة واليهود تصوم يوم عاشوراء فقال \"ما هذا اليوم الذي تصومونه\" فقالوا هذا يوم ظهر فيه موسى على فرعون. فقال النبي صلي الله عليه وسلم لأصحابه \"أنتم أحق بموسى منهم فصوموه\"."
    },
    {
      "ayah": 93,
      "surah": 10,
      "text": "يخبر تعالى عما أنعم به على بني إسرائيل من النعم الدينية والدنيوية وقوله \"مبوأ صدق\" قيل هو بلاد مصر والشام مما يلي بيت المقدس ونواحيه فإن الله تعالى لما أهلك فرعون وجنوده استقرت يد الدولة الموسوية على بلاد مصر بكمالها كما قال الله تعالى \"وأورثنا القوم الذي كانوا يستضعفون مشارق الأرض ومغاربها التي باركنا فيها وتمت كلمة ربك الحسنى على بني إسرائيل بما صبروا ودمرنا ما كان يصنع فرعون وقومه وما كانوا يعرشون\" وقال في الآية الأخرى \"فأخرجناهم من جنات وعيون وكنوز ومقام كريم كذلك وأورثناها بني إسرائيل\" وقال \"كم تركوا من جنات وعيون\" الآيات ولكن استمروا مع موسى عليه السلام طالبين إلى بلاد بيت المقدس وهي بلاد الخليل عليه السلام فاستمر موسى بمن معه طالبا بيت المقدس وكان فيه قوم من العمالقة فنكل بنو إسرائيل عن قتالهم فشردهم الله تعالى في التيه أربعين سنة ومات فيه هارون ثم موسى عليهما السلام وخرجوا بعدهما مع يوشع بن نون ففتح الله عليهم بيت المقدس واستقرت أيديهم عليها إلى أن أخذها منهم بختنصر حينا من الدهر ثم عادت إليهم ثم أخذها ملوك اليونان فكانت تحت أحكامهم مدة طويلة وبعث الله عيسى ابن مريم عليه السلام في تلك المدة فاستعانت اليهود قبحهم الله على معاداة عيسى عليه السلام بملوك اليونان وكانت تحت أحكامهم ووشوا عندهم وأوحوا إليهم أن هذا يفسد عليكم الرعايا فبعثوا من يقبض عليه فرفعه الله إليه وشبه لهم بعض الحواريين بمشيئة الله وقدره فأخذوه فصلبوه واعتقدوا أنه هو \"وما قتلوه يقينا بل رفعه الله إليه وكان الله عزيزا حكيما\" ثم بعد المسيح عليه السلام بنحو ثلثمائة سنة دخل قسطنطين أحد ملوك اليونان في دين النصرانية وكان فيلسوفا قبل ذلك فدخل في دين النصارى قيل تقية وقيل حيلة ليفسده فوضعت له الأساقفة منهم قوانين وشريعة بدعوها وأحدثوها فبنى لهم الكنائس والبيع الكبار والصغار والصوامع والهياكل والمعابد والقلايات وانتشر دين النصرانية في ذلك الزمان واشتهر على ما فيه من تبديل وتغيير وتحريف ووضع وكذب ومخالفة لدين المسيح ولم يبق على دين المسيح على الحقيقة منهم إلا القليل من الرهبان فاتخذوا لهم الصوامع في البراري والمهامه والقفار واستحوذت يد النصارى على مملكة الشام والجزيرة وبلاد الروم وبنى هذا الملك المذكور مدينة قسطنطينية والقمامة وبيت لحم وكنائس ببلاد بيت المقدس ومدن حوران كبصرى وغيرها من البلدان بناءات هائلة محكمة وعبدوا الصليب من حينئذ وصلوا إلى الشرق وصوروا الكنائس وأحلوا لحم الخنزير وغير ذلك مما أحدثوه من الفروع في دينهم والأصول ووضعوا له الأمانة الحقيرة التي يسمونها الكبيرة وصنفوا له القوانين وبسط هذا يطول. والغرض أن يدهم لم تزل على هذه البلاد إلى أن انتزعها منهم الصحابة رضي الله عنهم وكان فتح بيت المقدس على يدي أمير المؤمنين عمر بن الخطاب رضي الله عنه ولله الحمد والمنة وقوله \"ورزقناهم من الطيبات\" أي الحلال من الرزق الطيب النافع المستطاب طبعا وشرعا وقوله \"فما اختلفوا حتى جاءهم العلم\" أي ما اختلفوا في شيء من المسائل إلا من بعد ما جاءهم العلم أي ولم يكن لهم أن يختلفوا وقد بين الله لهم وأزال عنهم اللبس وقد ورد في الحديث \"إن اليهود اختلفوا على إحدى وسبعين فرقة وإن النصارى اختلفوا على اثنتين وسبعين فرقة وستفترق هذه الأمة على ثلاث وسبعين فرقة منها واحدة في الجنة وثنتان وسبعون في النار\". قيل من هم يا رسول الله ؟ قال \"ما أنا عليه وأصحابي\". رواه الحاكم في مستدركه بهذا اللفظ وهو في السنن والمسانيد ولهذا قال الله تعالى \"إن ربك يقضي بينهم\" أي يفصل بينهم \"يوم القيامة فيما كانوا فيه يختلفون\"."
    },
    {
      "ayah": 94,
      "surah": 10,
      "text": "قال قتادة بن دعامة بلغنا أن رسول الله صلي الله عليه وسلم قال \"لا أشك ولا أسأل \". وكذا قال ابن عباس وسعيد بن جبير والحسن البصري وهذا فيه تثبيت للأمة وإعلام لهم أن صفة نبيهم صلي الله عليه وسلم موجودة في الكتب المتقدمة التي بأيدي أهل الكتاب كما قال تعالى \"الذين يتبعون الرسول النبي الأمي الذي يجدونه مكتوبا عندهم في التوراة والإنجيل\" الآية. ثم مع هذا العلم الذي يعرفونه من كتبهم كما يعرفون أبناءهم يلبسون ذلك ويحرفونه ويبدلونه ولا يؤمنون به مع قيام الحجة عليهم."
    },
    {
      "ayah": 95,
      "surah": 10,
      "text": "قال قتادة بن دعامة بلغنا أن رسول الله صلي الله عليه وسلم قال \"لا أشك ولا أسأل \". وكذا قال ابن عباس وسعيد بن جبير والحسن البصري وهذا فيه تثبيت للأمة وإعلام لهم أن صفة نبيهم صلي الله عليه وسلم موجودة في الكتب المتقدمة التي بأيدي أهل الكتاب كما قال تعالى \"الذين يتبعون الرسول النبي الأمي الذي يجدونه مكتوبا عندهم في التوراة والإنجيل\" الآية. ثم مع هذا العلم الذي يعرفونه من كتبهم كما يعرفون أبناءهم يلبسون ذلك ويحرفونه ويبدلونه ولا يؤمنون به مع قيام الحجة عليهم."
    },
    {
      "ayah": 96,
      "surah": 10,
      "text": "ولهذا قال تعالى \"إن الذين حقت عليهم كلمة ربك لا يؤمنون ولو جاءتهم كل آية حتى يروا العذاب الأليم\" أي لا يؤمنون إيمانا ينفعهم بل حين لا ينفع نفسا إيمانها ولهذا لما دعا موسى عليه السلام على فرعون وملئه قال \"ربنا اطمس على أموالهم واشدد على قلوبهم فلا يؤمنوا حتى يروا العذاب الأليم\" كما قال تعالى \"ولو أننا نزلنا إليهم الملائكة وكلمهم الموتى وحشرنا عليهم كل شيء قبلا ما كانوا ليؤمنوا إلا أن يشاء الله ولكن أكثرهم يجهلون\"."
    },
    {
      "ayah": 97,
      "surah": 10,
      "text": "ولهذا قال تعالى \"إن الذين حقت عليهم كلمة ربك لا يؤمنون ولو جاءتهم كل آية حتى يروا العذاب الأليم\" أي لا يؤمنون إيمانا ينفعهم بل حين لا ينفع نفسا إيمانها ولهذا لما دعا موسى عليه السلام على فرعون وملئه قال \"ربنا اطمس على أموالهم واشدد على قلوبهم فلا يؤمنوا حتى يروا العذاب الأليم\" كما قال تعالى \"ولو أننا نزلنا إليهم الملائكة وكلمهم الموتى وحشرنا عليهم كل شيء قبلا ما كانوا ليؤمنوا إلا أن يشاء الله ولكن أكثرهم يجهلون\"."
    },
    {
      "ayah": 98,
      "surah": 10,
      "text": "يقول تعالى فهلا كانت قرية آمنت بكمالها من الأمم السالفة الذين بعثنا إليهم الرسل بل ما أرسلنا من قبلك يا محمد من رسول إلا كذبه قومه أو أكثرهم كقوله تعالى \"يا حسرة على العباد ما يأتيهم من رسول إلا كانوا به يستهزئون\" \"كذلك ما أتى الذين من قبلهم من رسول إلا قالوا ساحر أو مجنون\" \"وكذلك ما أرسلنا من قبلك في قرية من نذير إلا قال مترفوها إنا وجدنا آباءنا على أمة وإنا على آثارهم مقتدون\" وفي الحديث الصحيح \"عرض على الأنبياء فجعل النبي يمر ومعه الفئام من الناس والنبي يمر معه الرجل والنبي معه الرجلان والنبي ليس معه أحد\" ثم ذكر كثرة أتباع موسى عليه السلام ثم ذكر كثرة أمته صلوات الله وسلامه عليه كثرة سدت الخافقين الشرقي والغربي والغرض أنه لم توجد قرية آمنت بكمالها بنبيهم ممن سلف من القرى إلا قوم يونس وهم أهل نينوى وما كان إيمانهم إلا خوفا من وصول العذاب الذي أنذرهم به رسولهم بعد ما عاينوا أسبابه وخرج رسولهم من بين أظهرهم فعندها جأروا إلى الله واستغاثوا به وتضرعوا له واستكانوا وأحضروا أطفالهم ودوابهم ومواشيهم وسألوا الله تعالى أن يرفع عنهم العذاب الذي أنذرهم به نبيهم فعندها رحمهم الله وكشف عنهم العذاب وأخروا كما قال تعالى \"إلا قوم يونس لما آمنوا كشفنا عنهم عذاب الخزي في الحياة الدنيا ومتعناهم إلى حين\" واختلف المفسرون هل كشف عنهم العذاب الأخروي مع الدنيوي أو إنما كشف عنهم في الدنيا فقط ؟ على قولين: \"أحدهما\" إنما كان ذلك في الحياة الدنيا كما هو مقيد في هذه الآية. \"والثاني\" فيهما لقوله تعالى \"وأرسلناه إلى مائة ألف أو يزيدون فأمنوا فمتعناهم إلى حين\" فأطلق عليهم الإيمان والإيمان منقذ من العذاب الأخروي وهذا هو الظاهر والله أعلم. وقال قتادة في تفسير هذه الآية لم ينفع قرية كفرت ثم آمنت حين حضرها العذاب فتركت إلا قوم يونس لما فقدوا نبيهم وظنوا أن العذاب قد دنا منهم قذف الله في قلوبهم التوبة ولبسوا المسوح وفرقوا بين كل بهيمة وولدها ثم عجوا إلى الله أربعين ليلة فلما عرف الله منه الصدق من قلوبهم التوبة والندامة على ما مضى منهم كشف عنهم العذاب بعد أن تدلى عليهم قال قتادة وذكر أن قوم يونس بنينوى الموصل وكذا روي عن ابن مسعود ومجاهد وسعيد بن جبير وغير واحد من السلف وكان ابن مسعود يقرؤها \"فهلا كانت قرية آمنت\" وقال أبو عمران عن أبي الجلد قال لما نزل بهم العذاب جعل يدور على رءوسهم كقطع الليل المظلم فمشوا إلى رجل من علمائهم فقالوا علمنا دعاء ندعوا به لعل الله أن يكشف عنا العذاب فقال قولوا يا حي حين لا حي يا حي محيي الموتى يا حي لا إله إلا أنت قال فكشف عنهم العذاب وتمام القصة سيأتي مفصلا في سورة الصافات إن شاء الله."
    },
    {
      "ayah": 99,
      "surah": 10,
      "text": "يقول تعالى \"ولو شاء ربك\" يا محمد لأذن لأهل الأرض كلهم في الإيمان بما جئتهم به فآمنوا كلهم ولكن له حكمة فيما يفعله تعالى كقوله تعالى \"ولو شاء ربك لجعل الناس أمة واحدة ولا يزالون مختلفين إلا من رحم ربك ولذلك خلقهم وتمت كلمة ربك لأملأن جهنم من الجنة والناس أجمعين\" وقال تعالى \"أفلم ييأس الذين آمنوا أن لو يشاء الله لهدى الناس جميعا \" ولهذا قال تعالى \"أفانت تكره الناس\" أي تلزمهم وتلجئهم \"حتى يكونوا مؤمنين\" أي ليس ذلك عليك ولا إليك بل الله يضل من يشاء ويهدي من يشاء \"فلا تذهب نفسك عليهم حسرات\" \"ليس عليك هداهم ولكن الله يهدي من يشاء\" \"لعلك باخع نفسك أن لا يكونوا مؤمنين\" \"إنك لا تهدي من أحببت\" \"فإنما عليك البلاغ وعلينا الحساب\" \"فذكر إنما أنت مذكر لست عليهم بمصيطر\" إلى غير ذلك من الآيات الدالة على أن الله تعالى هو الفعال لما يريد الهادي من يشاء المضل لمن يشاء لعلمه وحكمته وعدله."
    }
  ]
}
