{
  "ayahs": [
    {
      "ayah": 1,
      "surah": 100,
      "text": "يقسم تعالى بالخيل إذا أجريت في سبيله فعدت وضبحت وهو الصوت الذي يسمع من الفرس حين تعدو \"والعاديات ضبحا\" قال الإبل وقال علي هي الإبل وقال ابن عباس هى الخيل فبلغ عليا قول ابن عباس فقال ما كانت لنا خيل يوم بدر قال ابن عباس إنما كان ذلك في سرية بعثت. قال ابن أبى حاتم وابن جرير وحدثنا يونس أخبرنا ابن وهب أخبرنى أبو صخر عن أبي معاوية البجلي عن سعيد بن جبير عن ابن عباس حدثه قال بينا أنا في الحجر جالسا جاء رجل فسألنى عن \" العاديات ضبحا \" فقلت له الخيل حين تغير في سبيل الله ثم تأوى إلى الليل فيصنعون طعامهم ويورون نارهم فانفتل عني فذهب إلى علي رضي الله عنه وهو عند سقاية زمزم فسأله عن العاديات ضبحا فقال سألت عنها أحدا قبلي؟ قال نعم سألت ابن عباس فقال الخيل حين تغير في سبيل الله قال اذهب فادعه لي فلما وقف على رأسه قال أتفتي الناس بما لا علم لك؟ والله لئن كان أول غزوة في الإسلام بدر وما كان معنا إلا فرسان فرس للزبير وفرس للمقداد فكيف تكون العاديات ضبح؟ إثما العاديات ضبحا من عرفة إلى المزدلفة ومن المزدلفة إلى منى قال ابن عباس فنزعت عن قولي ورجعت إلى الذي قال علي رضي الله عنه وبهذا الإسناد عن ابن عباس قال: قال علي إنما العاديات ضبحا من عرفة إلى المزدلفة فإذا أووا إلى المزدلفة أوروا النيران وقال العوفي وغيره عن ابن عباس هي الخيل. وقد قال بقول علي إنها الإبل جماعة منهم إبراهيم وعبد بن عمير وقال بقول ابن عباس آخرون منهم مجاهد وعكرمة وعطاء وقتادة والضحاك واختاره ابن جرير وقال ابن عباس وعطاء ما ضبحت دابة قط إلا فرس أو كلب وقال ابن جريج عن عطاء سمعت ابن عباس يصف الضبح أح أح. وقال أكثر هؤلاء في قوله \" فالموريات قدحا \" يعني بحوافرها وقيل أسعرت الرب بين ركبانهن قاله قتادة وعن ابن عباس ومجاهد فالموريات قدحا يعني مكر الرجال وقيل هو إيقاد النار إذا رجعوا إلى منازلهم من الليل وقيل المراد بذلك نيران القبائل وقال من فسرها بالخيل هو إيقاد النار بالمزدلقة وقال ابن جرير والصواب الأول: أنها الخيل حين تقدح بحوافرها. وقوله تعالى \" فالمغيرات صبحا \" قال ابن عباس ومجاهد وقتادة يعني إغارة الخيل صبحا في سبيل الله وقال من فسرها بالإبل هو الدفع صبحا من المزدلفة إلى منى وقالوا كلهم في قوله \" فأثرن به نقعا \" وهو المكان الذي حلت فيه أثارت به الغبار أما في حج أو غزو. وقوله تعالى \" فوسطن به جمعا \" قال العوفى عن ابن عباس وعطاء وعكرمة وقتادة والضحاك يعني جمع الكفار من العدو ومحتمل أن يكون فوسطن بذلك المكان جميعهن ويكون جمعا منصوبا على الحال المؤكدة وقد روى أبو بكر البزار ههنا حديثا غريبا جدا فقال حدثنا أحمد بن عبدة حدثنا حفص بن جميع حدثنا سماك عن عكرمة عن ابن عباس قال بعث رسول الله صلى الله عليه وسلم خيلا فأشهرت شهرا لا يأتيه منها خير فنزلت \" والعاديات ضبحا \" ضبحت بارجلها \" فالموريات قدحا \" قدحت بحوافرها الحجارة فأورت نارا \" فالمغيرات صبحا \" صبحت القوم بغارة \" فأثرن به نقعا \" أثارت بحوافرها الشراب \" فوسطن به جمعا \" قال صبحت القوم جميعا."
    },
    { "ayah": 10, "surah": 100, "text": "قال ابن عباس وغيره يعني أبرز وأظهر ما كانوا يسرون في نفوسهم." },
    {
      "ayah": 11,
      "surah": 100,
      "text": "أي لعالم بجميع ما كانوا يصنعون ويعملون ومجازيهم عليه أوفر الجزاء ولا يظلم مثقال ذرة. آخر تفسير سورة العاديات ولله الحمد و المنة."
    },
    { "ayah": 2, "surah": 100, "text": "\"فالموريات قدحا\" يعني اصطكاك نعالها للصخر فتقدح منه النار." },
    {
      "ayah": 3,
      "surah": 100,
      "text": "يعني الإغارة وقت الصباح كما كان رسول الله صلى الله عليه وسلم يغير صباحا ويستمع الأذان فإن سمع أذانا وإلا أغار."
    },
    { "ayah": 4, "surah": 100, "text": "يعني غبارا فى مكان معترك الخيول." },
    { "ayah": 5, "surah": 100, "text": "أي توسطن ذلك المكان كلهن جمع." },
    {
      "ayah": 6,
      "surah": 100,
      "text": "هذا هو المقسم عليه بمعنى أنه بنعم ربه لكفور جحود قال ابن عباس ومجاهد لإبراهيم النخعي وأبو الجوزاء وأبو العالية وأبو الضحى وسعيد بن جبير ومحمد بن قيس والضحاك والحسن وقتادة والربيع بن أنس وابن زيد: الكنود الكفور قال الحسن: الكنود هو الذي يعد المصائب وبني نعم الله عليه. وقال ابن أبي حاتم حدثنا أبو كريب حدثنا عبيد الله عن إسرائيل عن جعفر بن الزبير عن القاسم عن أبي أمامة قال: قال رسول الله صلى الله عليه وسلم\"إن الانسان لربه لكنود\" قال: الكنود الذي يأكل وحده ويضرب عبده ويمنع رفده\" رواه ابن أبي حاتم من طريق جعفر بن الزبير وهو متروك فهذا إسناد ضعيف. وقد رواه ابن جرير أيضا من حديث جرير ابن عثمان عن حمزة بن هانئ عن أبي أمامة موفوقا."
    },
    {
      "ayah": 7,
      "surah": 100,
      "text": "قال قتادة وسفيان الثوري وإن الله على ذلك لشهيد ويحتمل أن يعود الضمير على الإنسان قاله محمد بن كعب القرظي فيكون تقديره وإن الإنسان على كونه كنودا لشهيد أي بلسان حاله أي ظاهر ذلك عليه في أقواله وأفعاله كما قال تعالى \" ما كان للمشركين أن يعمروا مساجد الله شاهدين على أنفسهم بالكفر\"."
    },
    {
      "ayah": 8,
      "surah": 100,
      "text": "أي وإنه لحب الخير وهو المال لشديد وفيه مذهبا \"أحدهما\" أن المعنى وإنه لشديد المحبة للمال \"والثاني\" وإنه لحريص بخبل من محبة المال وكلاهما صحيح. ثم قال تبارك وتعالى مزهدا في الدنيا ومرغبا في الآخرة ومنبها على ما هو كائن بعد هذه الحال وما يستقبله الإنسان من الأهوال."
    },
    { "ayah": 9, "surah": 100, "text": "أي أخرج ما فيها من الأموات." }
  ]
}
