{
  "ayahs": [
    { "ayah": 1, "surah": 101, "text": "القارعة من أسماء القيامة كالحاقة والطامة والصاخة والغاشية وغير ذلك." },
    {
      "ayah": 10,
      "surah": 101,
      "text": "\"وما أدراك ماهيه نار حامية\" قال ابن جرير حدثنا ابن عبد الأعلى حدثنا ثور عن معمر عن الأشعث بن عبد الله الأعمى قال: إذا مات المؤمن ذهب بروحه إلى أرواح المؤمنين فيقولون روحوا أخاكم فإنه كان في غم الدنيا قال ويسألونه وما فعل فلان؟ فيقول مات أو ما جاءكم فيقولون ذهب به إلى أمه الهاوية وقد رواه ابن مردويه من طريق أنس بن مالك مرفوعا بأبسط من هذا وقد أوردناه كتاب صفة النار- أجارنا الله منها بمنه وكرمه."
    },
    {
      "ayah": 11,
      "surah": 101,
      "text": "وقوله تعالى \"نار حامية\" أي حارة شديدة الحر قوية اللهب والسعير قال أبو مصعب عن مالك عن أبي الزناد عن الأعرج عن أبي هريرة أن النبي صلى الله عليه وسلم قال \" نار بني آدم التي توقدون جزء من سبعين جزءا من نار جهنم قالوا يا رسول الله صلى الله عليه وسلم إن كانت لكافية؟ فقال \" إنها فضلت عليها بتسعة وستين جزءا \". ورواه البخاري عن إسماعيل بن أبي أويس عن مالك ورواه مسلم عن قتيبة عن المغيرة بن عبد الرحمن عن أبي الزناد به وفي بعض ألفاظه \" أنها فضلت عليها بتسعة وستين جزءا كلهن مثل حرها \" وقال الإمام أحمد حدثنا عبد الرحمن حدثنا حماد هو ابن سلمة عن محمد بن أبى زياد سمعت أبا هريرة يقول سمعت أبو القاسم صلى الله عليه وسلم يقول \" يقول بني آدم التي توقدون جزء من سبعين جزءا من نار جهنم \" فقال رجل إن كانت لكافية؟ فقال \" لقد فضلت عليها بتسعة وستين جزءا حرا فحرا \" تفرد به أحمد من هذا الوجه وهو على شرط مسلم وروى الإمام أحمد أيضا حدثنا سفيان عن أبي الزناد عن الأعرج عن أبي هريرة عن النبي صلى الله عليه وسلم وعمرو عن يحيى بن جعدة \" إن ناركم هذه جزء من سبعين جزءا من نار جهنم وضربت لبحر مرتين ولولا ذلك ما جعل الله فيها منفعة لأحد \" وهذا على شرط الصحيحين ولم يخرجوه من هذا الوجه وقد رواه مسلم في صححه من طريق\". ورواه البزار من حديث عبد الله بن مسعود وأبي سعيد الخدري \" ناركم هذه جزء من سبعن جزءا \". وقد قال الإمام أحمد حدثنا قتيبة حدثنا عبد العزيز هو ابن محمد الدراوردي عن سهل عن أبيه عن أبي هريرة رضي الله عنه عن النبي صلى الله عليه وسلم قال: \" هذه النار جزء من مائة جزء من جهنم \" تفرد به أيضا من هذا الوجه وهو على شرط مسلم أيضا وقال أبو القاسم الطبرانى حدثنا أحمد بن عمرو الخلال حدثنا إبراهيم بن المنذر الحزامي حدثنا معن بن عيسى القزاز عن مالك عن عمه أبي سهيل عن أبيه عن أبى هريرة قال: قال رسول الله صلى الله عليه وسلم \" أتدرون ما مثل ناركم هذه من نار جهنم؟ لهي أشد سوادا من دخان ناركم هذه بسبعين ضعفا \". وقد رواه أبو مصعب عن مالك ولم يرفعه. وروى الترمذي وابن ماجه عن عباس الدوري عن يحيى بن بكير حدثنا شريك عن عاصم عن أبي صالح عن أبي هريرة قال: قال رسول الله صلى الله عليه وسلم: \" أوقد على النار ألف سنة حتى أحمرت ثم أوقد عليها ألف سنة حتى ابيضت ثم أوقد عليها ألف سنة حتى اسودت فهي سوداء مظلمة \" وقد روي هذا من حديث أنس وعمر بن الخطاب. وجاء فى الحديث عند الإمام أحمد من طريق أبي عثمان النهدي عن أنس وأبي نضرة المعبدي عن أبي سعيد وعجلان مولى المشمعل عن أبي هريرة عن النبي صلى الله عليه وسلم أنه قال: \" وإن أهون أهل النار عذابا من له نعلان يغلي منهما دماغه \" وثبت في الصحيحين أن رسول الله صلى الله عليه وسلم قال \" اشتكت النار إلى ربها فقالت يا رب أكل بعضي بعضا فأذن لها بنفسين نفس في الشتاء ونفس في الصيف فأشد ما تجدون في الشتاء من بردها وأشد ما تجدون في الصيف من حرها \" وفي الصحيحين \" إذا اشتد الحر فأبردوا عن الصلاة فإن شدة الحر من فيح جهنم \". آخر تفسير سورة القارعة ولله الحمد والمنة."
    },
    { "ayah": 2, "surah": 101, "text": "القارعة من أسماء القيامة كالحاقة والطامة والصاخة والغاشية وغير ذلك." },
    { "ayah": 3, "surah": 101, "text": "ثم قال تعالى معظما ومهولا لشأنها وما أدراك ما القارعة." },
    {
      "ayah": 4,
      "surah": 101,
      "text": "\"ثم فسر ذلك بقوله \"يوم يكون الناس كالفراش المبثوث\" أي في انتشارهم وتفرقهم وذهابهم ومجيئهم من حيرتهم مما هم فيه كأنهم فراش مبثوث كما قال تعالى في الآية الأخرى \"كأنهم جراد منتشر\"."
    },
    {
      "ayah": 5,
      "surah": 101,
      "text": "يعني قد صارت كأنها الصوف المنفوش الذي قد شرع في الذهاب والتمزق قال مجاهد وعكرمة وسعيد بن جبير والحسن وقتادة وعطاء الخراساني والضحاك والسدي \" العهن \" الصوف ثم أخبر تعالى عما يئول آليه عمل العاملين وما يصيرون إليه من الكرامة والإهانة بحسب أعماله فقال."
    },
    { "ayah": 6, "surah": 101, "text": "أي رجحت حسناته على سيئاته." },
    { "ayah": 7, "surah": 101, "text": "يعني في الجنة." },
    { "ayah": 8, "surah": 101, "text": "أي رجحت سيئاته على حسناته." },
    {
      "ayah": 9,
      "surah": 101,
      "text": "قيل معناه فهو ساقط هاو بأم رأسه في نار جهنم وعبر عنه بأمه يعني ما غيره روى نحو هذا عن ابن عباس وعكرمة وأبي صالح وقتادة وقال قتادة: يهوى في النار على رأسه وكذا قال أبو صالح يهوون في النار على رءوسهم وقيل معناه فأمه التي يرجع إليها ويصير في المعاد إليها هاوية وهي اسم من أسماء النار قال ابن جرير وإنما قيل للهاوية أمه لأنه لا مأوى له غيرها. وقال ابن زيد الهاوية النار التي هي أمه ومأواه التي يرجع إليها ويأوي إليها وقرأ \" ومأواهم النار \" قال ابن أبي حاتم وروي عن قتادة أنه قال النار وهي مأواهم ولهذا قال تعالى مفسرا للهاوية."
    }
  ]
}
