{
  "ayahs": [
    {
      "ayah": 1,
      "surah": 102,
      "text": "يقول تعالى أشغلكم حب الدنيا ونعيمها وزهرتها عن طلب الآخرة وابتغائها وتمادى بكم ذلك حتى جاءكم الموت وزرتم المقابر وصرتم من أهلها. فال ابن أبي حاتم حدثنا أبى حدثنا زكريا بن يحيى الوقاد المصري حدثنا خالد بن عبد الدائم عن زيد بن أسلم عن أبيه قال: قال رسول الله صلى الله عليه وسلم \"ألهاكم التكاثر\" عن الطاعة \" حتى زرتم المقابر \"حتى يأتيكم الموت\" وقال الحسن البصري ألهاكم التكاثر فى الأموال والأولاد وفي صحيح البخاري في الرقاق منه وقال أخبرنا أبو الوليد حدثنا حماد بن سلمة عن ثابت عن أنس بن مالك عن أبي بن كعب قال: كنا نرى هذا من القرآن حتى نزلت \"ألهاكم التكاثر\" يعني \" لو كان لابن آدم واد من ذهب \" وقال الإمام أحمد حدثنا محمد بن جعفر حدثنا شعبة سمعت قتادة يحدث عن مطرف يعني ابن عبد الله بن الشخير عن أبيه قال: أنهيت إلى رسول الله صلى الله عليه وسلم وهو يقول \"ألهاكم التكاثر\" ويقول ابن آدم مالي مالي وهل لك من مالك إلا ما أكلت فأفنيت أو لبست فأبليت أو تصدقت فأمضيت؟ \" ورواه مسلم والترمذي والنسائي من طريق شعبة به وقال مسلم في صحيحه حدثنا سويد بن سعيد حدثنا حفمى بن ميسرة عن العلاء عن أبيه عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم \" يقول العيد مالي مالي وإنما له من ماله ثلاث: ما أكل فأفنى أو لبس فأبلى أو تصدق فأمضى وما سوى فذاهب وتاركه للناس \" تفرد به مسلم. وقال البخاري حدثنا الحميدي حدثنا سفيان حدثنا عبد الله بن أبي بكر بن محمد بن عمرو بن حزم سمع أنس بن مالك يقول: قال رسول الله صلى الله عليه وسلم \" يتبع الميت ثلاله فيرجع اثنان ويبقى معه واحد: يتبعه أهله وماله وعمله فيرجع أهله وماله ويبقى عمله \" وكذا رواه مسلم والترمذي والنسائى من حديث سفيان بن عيينة به. وقال الإمام أحمد حدثنا يحيى عن شعبة حدثنا قتادة عن أنس أن النبي صلى الله عليه وسلم قال \" يهرم ابن آدم ويبقى منه اثنتان الحرص والأمل \" أخرجاه في الصحيحين وذكر الحافظ ابن عساكر في ترجمة الأحنف بن قيس واسمه الضحاك أنه رأى في يد رجل درهما فقال لمن هذا الدرهم؟ فقال الرجل لي فقال إنما هو لك إذا أنفقته في أجر أو ابتغاء شكر ثم أنشد الأحنف متمثلا قول الشاعر: أنت للمال إذا أمسكته فإذا أنفقته فالمال لك وقال ابن أبي حاتم حدثنا أبو سعيد الأشج حدثنا أبو أسامة قال صالح بن حبان حدثني عن ابن بريدة في قوله \"ألهاكم التكاثر\" قال نزلت في قبيلتين من قبائل الأنصار بنى حارثة وبني الحارت تفاخروا وتكاثروا فقالت إحداهما فيكم مثل فلان بن فلان وفلان وقال الآخرون مثل ذلك تفاخروا بالأحياء ثم قالوا انطلقوا بنا إلى القبور فجعلت إحدى الطائفتين تقول فيكم مثل فلان يشيرون إلى القبور ومثل فلان وفعل الآخرون مثل ذلك فأنزل الله \"ألهاكم التكاثر حتى زرتم المقابر\" لقد كان لكم فيما رأيتم عبرة وشغل."
    },
    {
      "ayah": 2,
      "surah": 102,
      "text": "وقال قتادة \" ألهاكم التكاثر حتى زرتم المقابر\" كانوا يقولون نحن أكثر بني فلان ونحن أعد من بني فلان وهم كل يوم يتساقطون إلى آخرهم والله ما زالوا كذلك حتى صاروا من أهل القبور كلهم والصحيح أن المراد بقوله زرتم المقابر أي صرتم إليها ودفنتم فيها كما جاء في الصحيح أن رسول الله صلى الله عليه وسلم دخل على رجل من الأعراب يعوده فقال \" لا بأس طهور إن شاء الله \" فقال: قلت طهور بل هي حمى تفور على شيخ كبير تزيره القبور قال \" فنعم إذن \". وقال ابن أبي حاتم حدثنا أبو زرعة حدثنا محمد بن سعيد الأصبهاني أخبرنا حكام بن سالم الرازي عن عمرو بن أبي قيس عن الحجاج عن المنهال عن زر بن حبيش عن علي قال: ما زلنا نشك فى عذاب القبر حتى نزلت \" ألهاكم التكاثر حتى زرتم المقابر \" ورواه الترمذي عن أبي كريب عن حكام بن سالم به وقال غريب وقال ابن أبي حاتم حدثنا أبي حدثنا سلمة بن داود العرض حدثنا أبو المليح الرقي عن ميمون بن مهران قال كنت جالسا عند عمر بن عبد العزيز فقرأ \" ألهاكم التكاثر حتى زرتم المقابر \" فلبث هنيهة ثم قال: يا ميمون ما أرى المقابر إلا زيارة وما للزائر بد من أن يرجع إلى منزله وقال أبو محمد يعني أن يرجع إلى منزله أى إلى جنة أو إلى نار وهكذا ذكر أن بعض الأعراب سمع رجلا يتلو هذه الآية \" حتى زرتم المقابر \" فقال بعث القوم ورب الكعبة أي إن الزائر سيرحل من مقامه ذلك إلى غيره."
    },
    {
      "ayah": 3,
      "surah": 102,
      "text": "قال الحسن البصري هذا وعيد بعد وعيد وقال الضحاك \" كلا سوف تعلمون \" يعني الكفار."
    },
    { "ayah": 4, "surah": 102, "text": "يعني أيها المؤمنون." },
    {
      "ayah": 5,
      "surah": 102,
      "text": "وقوله تعالى \" كلا لو تعلمون علم اليقين \" أي لو علمتم حق العلم لما ألهاكم التكاثر عن طلب الدار الآخرة حتى صرتم إلى المقابر."
    },
    {
      "ayah": 6,
      "surah": 102,
      "text": "ثم قال \" لترون الجحيم ثم لترونا عين اليقين \" هذا تفسير الوعيد المتقدم وهو قوله \" كلا سوف تعلمون ثم كلا سوف تعلمون \" توعدهم بهذا الحال وهو رؤية أهل النار التي إذا زفرت زفرة واحدة خر كل ملك مقرب ونبي مرسل على ركبتييه من المهابة ولعظمه ومعاينة الأهوال على ما جاء به الأثر المروي في ذلك."
    },
    {
      "ayah": 7,
      "surah": 102,
      "text": "ثم قال \" لترون الجحيم ثم لترونا عين اليقين \" هذا تفسير الوعيد المتقدم وهو قوله \" كلا سوف تعلمون ثم كلا سوف تعلمون \" توعدهم بهذا الحال وهو رؤية أهل النار التي إذا زفرت زفرة واحدة خر كل ملك مقرب ونبي مرسل على ركبتييه من المهابة ولعظمه ومعاينة الأهوال على ما جاء به الأثر المروي في ذلك."
    },
    {
      "ayah": 8,
      "surah": 102,
      "text": "أي ثم لتسئلن يومئذ عن شكر ما أنعم به عليكم من الصحة والأمن والرزق وغير ذلك ما إذا قابلتم به نعمه من شكر وعبادته وقال ابن أبي حاتم حدثنا أبو زرعة حدثنا زكريا بن يحيى الجزار المقري حدثنا عبد الله بن عيسى أبو خالد الجزار حدثنا يونس بن عن عكرمة عن ابن عباس أنه سمع عمر بن الخطاب يقول: خرح رسول الله صلى الله عليه وسلم عند الظهيرة فوجد أبا بكر في المسجد فقال \" ما أخرجك هذه الساعة؟ \" فقال أخرجني الذي أخرجك يا رسول الله صلى الله عليه وسلم قال وجاء عمر بن الخطاب فقال \" ما أخرجك يا ابن الخطاب؟ \" قال أخرجني الذي أخرجكما قال فقعد عمر وأقبل رسول الله صلى الله عليه وسلم يحدثهما ثم قال \" هل بكما من قوة تنطلقان إلى هذا النخل فتصيبان طعاما وشرابا وظلا؟ \" قلنا نعم قال \" مروا بنا إلى منزل ابن التيهان أبي الهيثم الأنصاري \" قال فتقدم رسول الله صلى الله عليه وسلم بين أيدينا فسلم واستأذن ثلاث مرات وأم الهيثم من وراء الباب تسمع الكلام تريد أن يزيدها رسول الله صلى الله عليه وسلم من السلام فلما أراد أن ينصرف خرجت أم الهيثم تسعى خلفهم فقالت يا رسول الله قد والله سمعت تسليمك ولكن أردت أن تزيدنى من سلامك فقال لها رسول الله صلى الله عليه وسلم خيرا ثم قال \" أين أبو الهيثم لا أراه \" قالت يا رسول الله هو قريب ذهب يستعذب الماء ادخلوا فإنه يأتي الساعة إن شاء الله فبسطت بساطا تحت شجرة فجاء أبو الهيثم ففرح بهم وقرت عيناه بهم فصعد على نخلة فصرم لهم أعذاقا فقال له رسول الله صلى الله عليه وسلم \" حسبك يا أبا الهيثم \" فقال يا رسول الله صلى الله عليه وسلم تأكلون من بسره ومن رطبه ومن تذنوبه ثم أتاهم بماء فشربوا عليه فقال رسول الله صلى الله عليه وسلم \" هذا من النعيم الذي تسألون عنه \" هذا ريب من هذا لوجه وقال ابن جرير حدثني الحسين بن علي الصدائي حدثنا الوليد بن القاسم عن يزيد بن كيسان عن أبي حازم عن أبي هريرة رضي الله عنه قال: بينا أبو بكر وعمر جالسان إذ جاءهم النبي فقال \" ما أجلسكما ههنا؟ \" قالا والذي بعث بالحق ما أخرجنا من بيوتنا إلا الجوع قال \" والذي بعثني بالحق ما أخرجني غيره \" فانطلقوا حتى أتوا بيت رجل من الأنصار فاستقبلتهم المرأة فقال لها النبي \" أين فلان؟ \" فقالت ذهب يستعذب لنا ماء فجاء صاحبهم يحمل قربته فقال مرحبا ما زار العباد شيء أفضل من نني زارنى اليوم فعلق قربته بقرب نخلة وانطلق فجاءهم بعذق فقال النبي صلى الله عليه وسلم \" ألا كنت اجتنيت \" فقال أحببت أن تكونوا الذين تختارون على أعينكم ثم أخذ الشفرة فقال له النبي صلى الله عليه وسلم إياك والحلوب \" فذبح لهم يومئذ فأكلوا فقال النبي صلى الله عليه وسلم \" لتسئلن عن هذا يوم القيامة أخرجكم من بيوتكم الجوع فلم ترجعوا حتى أصبتم هذا فهذا من النعيم \" ورواه مسلم من حديث يزيد بن كيسان به ورواه أبو يعلى وابن ماجه من حديث المكاري عن يحيى بن عبيد الله عن أبيه عن أبي هريرة عن أبي بكر الصديق به. وقد رواه أهل السنن الأربعة من حديث عبد الملك بن عمير عن أبي سلمة عن أبى هريرة رضي الله عنه بنحو من هذا السياق وهذه القصة وقال الإمام أحمد حدثنا شريح حدثنا حشرج عن أبي نضرة عن أبي عسيب يعني مولى رسول الله صلى الله عليه وسلم قال: خرج رسول الله صلى الله عليه وسلم ليلا فمر بي فدعانى فخرجت إليه ثم مر بأبي بكر فدعاه فخرج إليه ثم مر بعمر فدعاه فخرج إليه فانطلق حتى دخل حائطا لبعض الأنصار فقال لصاحب الحائط \" أطعمنا \" فجاء بعذق فوضعه فأكل رسول الله صلى الله عليه وسلم وأصحابه ثم دعا بماء بارد فشرب وقال \" لتسئلن عن هذا يوم القيامة \" قال فأخذ عمر العذق فضرب به الأرض حتى تناثر البسر قبل رسول الله صلى الله عليه وسلم ثم قال يا رسول الله صلى الله عليه وسلم إنا لمسئولن عن هذا يوم القيامة؟ قال نعم إلا من ثلاثة: خرقة لف بها الرجل عورته أو كسرة سد بها جوعته أو جحر يدخل فيه من الحر والقر \" تفرد به أحمد وقال الإمام أحمد حدثنا عبد الصمد حدثنا حماد حدثنا عمار سمعت جابر بن عبد الله يقول: أكل رسول الله صلى الله عليه وسلم وأبو بكر وعمر رطبا وشربوا ماء فقال رسول الله صلى الله عليه وسلم \" هذا من النعيم الذي تسئلون عنه \" ورواه النسائي من حديث حماد بن سلمة عن عمار بن أبي عمار عن جابر به. وقال الإمام أحمد حدثنا يزيد حدثنا محمد بن عمرو عن صفوان بن سليم عن محمود بن الربيع قال لما نزلت \" ألهاكم التكاثر \" فقرأ حت بلغ \" لتسئلن يومئذ عن النعيم \" قالوا يا رسول الله صلى الله عليه وسلم عن أي نعيم نسأل؟ وإنما هما الأسودان الماء والتمر وسيوفنا على رقابنا والعدو حاضر فعن أي نعيم نسأل؟ قال \" أما إن ذلك سيكون \" وقال أحمد حدثنا أبو عامر عبد الملك بن عمرو حدثنا عبد الله بن سليمان حدثنا معاذ بن عبد الله بن حبيب عن أبيه عن عمه قال كنا في مجلس فطلع علينا النبي وعلى رأسه أثر ماء فقلنا يا رسول الله صلى الله عليه وسلم نراك طيب النفس قال \" أجل \" قال ثم خاض الناس في ذكر الغنى فقال رسول الله صلى الله عليه وسلم \" لا بأس بالغنى لمن اتقى الله والصحة لمن اتقى الله خير من الغنى وطيدب النفس من النعيم \" ورواه ابن ماجه عن أبي بكر بن أبي شيبة عن خالد بن مخلد عن عبد الله بن سليمان به. وقال الترمذي حدثنا عبد بن حميد حدثنا شبابة عن عبد الله بن العلاء عن الضحاك بن عبد الرحمن بن عرزب الأشعري قال سمعت أبا هريرة رضي الله عنه يقول: قال النبي صلى الله عليه وسلم \" إن أول ما يسئل عنه - يعني يوم القيامة - العبد من النعيم أن يقال له ألم نصح لك بدنك ونرويك من الماء البارد \" تفرد به الترمذى ورواه بن حبان في صحيحه من طريق الولد بن مسلم عن عبد الله بن العلاء بن زبير به. وقال ابن أبي حاتم حدثنا أبو زرعة حدثنا مسدد حدثنا سفيان عن محمد بن عمرو عن يحيى بن حاطب عن عبد الله بن الزبير قال: قال الزبير لما نزلت \" ثم لتسئلن يومئذ عن النعيم \" قالوا يا رسول الله لأي نعيم نسئل عنه وإنما هما الأسودان التمر والماء قال \" إن ذلك سيكون \" وقد رواه الترمذي وابن ماجه من حديث سفيان هو ابن عيينة به ورواه أحمد عنه وقال الترمذي حسن وقال ابن أبى حاتم حدثنا أبو عبد الله الطهراني حدثنا سفيان بن عمر العدني عن الحكم بن أبان عن عكرمة قال لما نزلت هذه الآية \" ثم لتسألن يومئذ عن النعيم \" قال الصحابة يا رسول الله صلى الله عليه وسلم أي نعيم نحن فيه وإنما نأكل في أنصاف بطوننا خبز الشعير؟ فأوحى الله إلى نبيه صلى الله عليه وسلم: قل لهم أليس تحتذون النعال وتشربون الماء البارد؟ فهذا من النعيم وقال ابن أبي حاتم حدثنا أبو زرعة حدثنا إبراهيم بن موسى أخبرنا محمد بن سليمان بن الأصبهاني عن ابن أبي ليلى أظنه عن عامر عن ابن مسعود عن النبي صلى الله عليه وسلم في قوله \" ثم لتسئلن يومئذ عن النعيم \" قال \" الأمن والصحة \" وقال زيد بن أسلم عن رسول الله صلى الله عليه وسلم \" ثم لتسئلن يومئذ عن النعيم \" يعني شبع البطون وبارد الشراب وظلال المساكن واعتدال الخلق ولذة النوم ورواه ابن أبي حاتم بإسناده المتقدم عنه في أول السورة. وقال سعيد بن جبير حتى عن شربه عسل. وقال مجاهد: عن كل لذة من لذات الدنيا وقال الحسن البصري من النعيم الغداء والعشاء وقال أبو قلابة: من النعيم أكل السمن والعسل بالخبز النقي وقول مجاهد أشمل هذه الأقوال وقال علي ابن أبي طلحة عن ابن عباس \" ثم لتسئلن يومئذ عن النعيم \" قال النعيم صحة الأبدان والأسماع والأبصار يسأل الله العباد فيما استعملوها وهو أعلم بذلك منهم وهو قوله تعالى \" إن السمع والبصر والفؤاد كل أولئك كان عنه مسئولا \" وثبت في صحيح البخاري وسنن الترمذي والنسائي وابن ماجه من حديث عبد الله بن سعيد بن أبي هند عن أبيه عن ابن عباس قال: قال رسول الله صلى الله عليه وسلم \" نعمتان مغبون فيهما كثير من الناس: الصحة والفراغ \" ومعنى هذا أنهم مقصرون فى شكر هاتين النعمتين لا يقومون بواجبهما ومن لا يقوم بحق ما وجب عليه فهو مغبون وقال الحافظ أبو بكر البزار حدثنا القاسم بن محمد بن يحيى المروزي حدثنا علي بن الحسين بن شقيق حدثنا أبو حمزة عن ليث عن أبي فزارة عن يزيد بن الأصم عن ابن عباس قال: قال رسول الله صلى الله عليه وسلم \" ما فوق الإزار وظل الحائط وجر الماء فضل يحاسب به العبد يوم القيامة أو يسئل عنه \" ثم قال لا نعرفه إلا بهذا الإسناد وقال الإمام أحمد حدثنا بهز وعفان قالا حدثنا حماد قال عفان في حديثه قال إسحاق بن عبد الله عن أبي صالح عن أبي هريرة رضي الله عنه عن النبي صلى الله عليه وسلم قال \" يقول الله عز وجل - قال عفان يوم القيامة - يا ابن آدم حملتك على الخيل والإبل وزوجتك النساء وجعلتك تربع وترأس فأين شكر ذلك؟ \" تفرد به من هذا الوجه اخر تفسير سورة التكاثر ولله الحمد والمنة."
    }
  ]
}
