{
  "ayahs": [
    {
      "ayah": 1,
      "surah": 104,
      "text": "الهماز بالقول واللماز بالفعل يعني يزدري الناس وينتقص بهم وقد تقدم بيان ذلك في قوله تعالى \"هماز مشاء بنميم\" قال ابن عباس همزة لمزة طعان معياب. وقال الربيع بن أنس الهمزة يهمزه في وجهه واللمزة من خلفه. وقال قتادة الهمزة واللمزة لسانه وعينه ويأكل لحوم الناس ويطعن عليهم. وقال مجاهد الهمزة باليد والعين واللمزة باللسان وهكذا قال ابن زيد. وقال مالك عن زيد بن أسلم همزة لحوم الناس ثم قال بعضهم المراد بذلك الأخنس بن شريق وقيل غيره وقال مجاهد هي عامة."
    },
    {
      "ayah": 2,
      "surah": 104,
      "text": "قوله تعالى \"الذي جمع مالا وعدده\" أي جمعه بعضه على بعض وأحصى عدده كقوله تعالى \"وجمع فأوعى\" قاله السدي وابن جرير وقال محمد بن كعب في قوله \"جمع مالا وعدده\" ألهاه ماله بالنهار هذا إلى هذا فإذا كان الليل نام كأنه جيفة منتنة."
    },
    {
      "ayah": 3,
      "surah": 104,
      "text": "أي يظن أن جمعه المال يخلده في هذه الدار \"كلا\" أي ليس الأمر كما زعم ولا كما حسب. ثم."
    },
    {
      "ayah": 4,
      "surah": 104,
      "text": "أي ليلقين هذا الذي جمع مالا فعدده في الحطمة وهي اسم طبقة من أسماء النار لأنها تحطم من فيها."
    },
    {
      "ayah": 5,
      "surah": 104,
      "text": "قال \"وما أدراك ما الحطمة نار الله الموقدة التي تطلع على الأفئدة\" قال ثابت البناني تحرقهم إلى الأفئدة وهم أحياء ثم يقول لقد بلغ منهم العذاب ثم يبكي وقال محمد بن كعب تأكل كل شيء من جسده حتى إذا بلغت فؤاده حذو حلقه ترجع على جسده."
    },
    { "ayah": 6, "surah": 104, "text": "تأكل كل شيء من جسده حتى إذا بلغت فؤاده حذو حلقه ترجع على جسده." },
    {
      "ayah": 7,
      "surah": 104,
      "text": "قال \"وما أدراك ما الحطمة نار الله الموقدة التي تطلع على الأفئدة\" قال ثابت البناني تحرقهم إلى الأفئدة وهم أحياء ثم يقول لقد بلغ منهم العذاب ثم يبكي وقال محمد بن كعب تأكل كل شيء من جسده حتى إذا بلغت فؤاده حذو حلقه ترجع على جسده."
    },
    {
      "ayah": 8,
      "surah": 104,
      "text": "قوله تعالى \"إنها عليهم مؤصدة\" أي مطبقة كما تقدم تفسيره في سورة البلد. وقال ابن مردويه حدثنا عبدالله بن محمد حدثنا علي بن سراج حدثنا حماد بن حرزاد حدثنا شجاع بن أشرس حدثنا شريك عن عاصم عن أبي صالح عن أبي هريرة رضي الله عنه عن النبي صلى الله عليه وسلم \"إنها عليهم مؤصدة\" قال مطبقة. وقد رواه أبو بكر بن أبي شيبة عن عبدالله بن أسد عن إسماعيل بن أبي خالد عن أبي صالح قوله ولم يرفعه."
    },
    {
      "ayah": 9,
      "surah": 104,
      "text": "قوله تعالى \"في عمد ممددة\" قال عطية العوفي عمد من حديد وقال السدي من نار وقال شبيب بن بشر عن عكرمة عن ابن عباس \"في عمد ممددة\" يعني الأبواب هي الممددة وقال فتادة في قراءة عبدالله بن مسعود إنها عليهم مؤصدة بعمد ممددة وقال العوفي عن ابن عباس أدخلهم في عمد ممددة عليهم بعماد في أعناقهم السلاسل فسدت بها الأبواب وقال قتادة كنا نحدث أنهم يعذبون بعمد في النار واختاره ابن جرير وقال أبو صالح \"في عمد ممددة\" يعني القيود الثقال. آخر تفسير سورة ويل لكل همزة ولله الحمد والمنة."
    }
  ]
}
