{
  "ayahs": [
    {
      "ayah": 1,
      "surah": 105,
      "text": "هذه من النعم التي امتن الله بها على قريش فيما صرف عنهم من أصحاب الفيل الذين كانوا قد عزموا على هدم الكعبة ومحو أثرها من الوجود فأبادهم الله وأرغم آنافهم وخيب سعيهم وأضل عملهم وردهم بشر خيبة وكانوا قوما نصارى وكان دينهم إذ ذاك أقرب حالا مما كان عليه قريش من عبادة الأوثان ولكن كان هذا من باب الإرهاص والتوطئة لمبعث رسول الله صلى الله عليه وسلم فإنه في ذلك العام ولد على أشهر الأقوال ولسان حال القدرة يقول لم ننصركم يا معشر قريش على الحبشة لخيريتكم عليهم ولكن صيانة للبيت العتيق الذي سنشرفه ونعظمه ونوقره ببعثه النبي الأمي محمد صلى الله عليه وسلم خاتم الأنبياء \"وهذه قصة أصحاب الفيل على وجه الإيجاز والاختصار والتقريب\" قد تقدم في قصة أصحاب الأخدود أن ذا نواس وكان آخر ملوك حمير وكان مشركا وهو الذي قتل أصحاب الأخدود وكانوا نصارى وكانوا قريبا من عشرين ألف فلم يفلت منهم إلا دوس ذو ثعلبان فذهب فاستغاث بقيصر ملك الشام وكان نصرانيا فكتب له إلى النجاشي ملك الحبشة لكونه أقرب إليهم فبعث معه أميرين أرياط وأبرهة بن الصباح أبا يكسوم في جيش كثيف فدخلوا اليمن فجاسوا خلال الديار وأسلبوا الملك من حمير وهلك ذا نواس غريقا في البحر واستقل الحبشة بملك اليمن وعليهم هذان الأميران أرياط وأبرهة فاختلفا في أمرهما وتصاولا وتقاتلا وتصافا فقال أحدهما للآخر لا حاجة بنا إلى اصطلام الجيشين بيننا ولكن أبرز إلى وأبرز إليك فأينا قتل الآخر استقل بعده بالملك فأجابه إلى ذلك فتبارزا وخلف كل واحد منهما قناة فحمل أرياط على أبرهة فضربه بالسيف فشرم أنفه وفمه وشق وجهه وحمل عتودة مولى أبرهة على أرياط فقتله ورجع أبرهة جريحا فداوى جرحه فبرأ واستقل بتدبير جيش الحبشة باليمن فكتب إليه النجاشي يلومه على ما كان منه ويتوعده ويحلف ليطأن بلاده ويجز ناصيته فأرسل إليه أبرهة يترقق له ويصانعه وبعث مع رسوله بهدايا وتحف وبجراب فيه من تراب اليمن وجز ناصيته فأرسلها معه ويقول في كتابه ليطأ الملك على هذا الجراب فيبر قسمه وهذه ناصيتي قد بعثت بها إليك فلما وصل ذلك إليه أعجبه منه ورضي عنه وأقره على عمله وأرسل أبرهة يقل للنجاشي إني سأبني كنيسة بأرض اليمن اليمن لم يبن قبلها مثلها فشرع في بناء كنيسة هائلة بصنعاء رفيعة البناء عالية الفناء مزخرفة الأرجاء سمتها العرب القليس لارتفاعها لأن الناظر إليها تكاد تسقط قلنسوته عن رأسه من ارتفاع بنائها وعرم أبرهة الأشرم على أن يصرف حج العرب إليها كما يحج إلى الكعبة بمكة ونادى بذلك في مملكته فكرهت العرب العدنانية والقحطانية ذلك وغضبت قريش لذلك غضبا شديدا حتى قصدها بعضهم وتوصل إلى أن دخلها ليلا فأحدث فيها وكر راجعا فلما رأى السدنة ذلك الحدث رفعوا أمره إلى ملكهم أبرهة وقالوا له إنما صنع هذا بعض قريش غضبا لبيتهم الذي ضاهيت هذا به فأقسم أبرهة ليسيرن إلى بيت مكة وليخربنه حجرا حجرا. وذكر مقاتل بن سليمان أن فتية من قريش دخلوها فأججوا فيها نارا وكان يوما فيه هواء شديد فاحترقت وسقطت إلى الأرض فتأهب أبرهة لذلك وصار في جيش كثيف عرمرم لئلا يصده أحد عنه واستصحب معه فيلا عظيما كبير الجنة لم ير مثله يقال له محمود وكان قد بعثه إليه النجاشي ملك الحبش لذلك ويقال كان معه أيضا ثمانية أفيال وقيل اثنا عشر فيلا غيره فالله أعلم يعني ليهدم به الكعبة بأن يجعل السلاسل في الأركان وتوضع في عنق الفيل ثم يزجر ليلقي الحائط جملة واحدة فلما سمعت العرب بمسيره أعظموا ذلك جدا ورأوا أن حقا عليهم المحاجبة دون البيت ورد من أراده بكيد فخرج إليه رجل من أشراف أهل اليمن وملوكهم يقال له ذو نفر فدعا قومه ومن أجابه من سائر العرب إلى حرب أبرهة وجهاده عن بيت الله وما يريده من هدمه وخرابه فأجابوه وقاتلوا أبرهة فهزمهم لما يريده الله عز وجل من كرامة البيت وتعظيمه وأسر ذو نفر فاستصحبه معه ثم مضى لوجهه حتى إذا كان بأرض خثعم اعترض له نفيل بن حبيب الخثعمي في قومه شهران وناهس فقاتلوه فهزمهم أبرهة وأسر نفيل بن حبيب فأراد قتله ثم عفا عنه واستصحبه معه ليدله في بلاد الحجاز فلما اقترب من أرض الطائف خرج إليه أهلها ثقيف وصانعوه خيفة على بيتهم الذي عندهم الذي يسمونه اللات فأكرمهم وبعثوا معه أبا رغال دليلا فلما انتهى أبرهة إلى المغمس وهو قريب من مكة نزل به وأغار جيشه على سرح أهل مكة من الإبل وغيرها فأخذوه وكان في السرج مائتا بعير لعبدالمطلب وكان الذي أغار على السرح بأمر أبرهة أمير المقدمة وكان يقال له الأسود بن مقصود فهجاه بعض العرب فيما ذكره ابن إسحاق وبعث أبرهة حناطة الحميري إلى مكة وأمره أن يأتيه بأشرف قريش وأن يخبره أن الملك لم يجىء لقتالكم إلا أن تصدوه عن البيت فجاء حناطة فدل على عبدالمطلب بن هاشم وبلغه عن أبرهة ما قال: فقال له عبدالمطلب والله ما نريد حربه وما لنا بذلك من طاقة هذا بيت الله الحرام وبيت خليله إبراهيم فإن يمنعه منه فهو بيته وحرمه وإن يخلي بينه وبينه فوالله ما عندنا دفع عنه فقال له حناطة فاذهب معي إليه فذهب معه فلما رآه أبرهة أجله وكان عبد المطلب رجلا جسيما حسن المنظر. ونزل أبرهة عن سريره وجلس معه على البساط وقال لترجمانه قل له ما حاجتك؟ فقال للترجمان إن حاجتي أن يرد علي الملك مائتي بعير أصابها لي فقال أبرهة لترجمانه قل له لقد كنت أعجبتني حين رأيتك ثم قد زهدت فيك حين كلمتني أتكلمني في مائتي بعير أصبتها لك وتترك بيتا هو دينك ودين آبائك قد جئت لهدمه لا تكلمني فيه؟ فقال له عبدالمطلب إني أنا رب الإبل وإن للبيت ربا سمينعه. قال ما كان ليمتنع مني قال أنت وذاك ويقال إنه ذهب مع عبدالمطلب جماعة من أشراف العرب فعرضوا على أبرهة ثلث أموال تهامة على أن يرجع عن البيت فأبى عليهم ورد أبرهة على عبدالمطلب إبله ورجع عبدالمطلب إلى قريش فأمرهم بالخروج من مكة والتحصن في رؤوس الجبال تخوفا عليهم من معرة الجيش ثم قام عبدالمطلب فأخذ بحلقة باب الكعبة وقام معه نفر من قريش يدعون الله ويستنصرون على أبرهة وجنده فقال عبدالمطلب وهو آخذ بحلقة باب الكعبة. لا هم إن المرء يمنع رحله فامنع رحالك لا يغلبن صليبهم ومحالهم أبدا محالك قال ابن إسحاق ثم أرسل عبدالمطلب حلقة الباب ثم خرجوا إلى رؤوس الجبال. وذكر عن ابن سليمان أنهم تركوا عند البيت مائة بدنة مقلدة لعل بعض الجيش ينال منها شيئا بغير حق فينتقم الله منهم فلما أصبح أبرهة تهيأ لدخول مكة وهيأ فيله وكان اسمه محمودا وعبأ جيشه فلما وجهوا الفيل نحو مكة أقبل نفيل بن حبيب حتى قام إلى جنبه ثم أخد بأذنه وقال ابرك محمود وارجع راشدا من حيث جئت فإنك في بلد الله الحرام ثم أرسل أذنه فبرك الفيل وخرج نفيل بن حبيب يشتد حتى أصعد في الجبل وضربوا الفيل ليقوم فأبى فضربوا في رأسه بالطبرزين وأدخلوا محاجن لهم في مراقه فنزعوه بها ليعوم فأبى فوجههوه راجعا إلى اليمن فقام يهرول ووجوه إلى الشام ففعل مثل ذلك ووجهوه إلى المشرق ففعل مثل ذلك ووجهوه إلى مكة فبرك."
    },
    { "ayah": 2, "surah": 105, "text": "بأن الله سبحانة أهلكهم ودمرهم وردهم بكيدهم وغيظهم لم ينالوا خيرا." },
    { "ayah": 3, "surah": 105, "text": "وأرسل الله عليهم طيرا من البحر أمثال الخطاطيف والبلسان." },
    {
      "ayah": 4,
      "surah": 105,
      "text": "مع كل طائر منها ثلاثة أحجار يحملها: حجر في منقاره وحجران في رجليه أمثال الحمص والعدس لا يصيب منهم أحدا إلا هلك وليس كلهم أصابت وخرجوا هاربين يبتدرون الطريق ويسألون عن نفيل ليدلهم على الطريق هذا ونفيل على رأس الجبل مع قريش وعرب الحجاز ينظرون ماذا أنزل الله بأصحاب الفيل من النقمة وجعل نفيل يقول. اين المفر والإله الطالب والأشرم المغلوب ليس الغالب قال ابن إسحاق وقال نفيل في ذلك أيضا: ألا حييت عنايا ودينا نعمناكم منع الأصباح عينا ودينة لو رأيت ولا تريه لدى جنب المحصب ما رأينا إذا لعذرتني وحمدت أمري ولم تأسى على ما فات بينا حمدت الله إذا أبصرت طيرا وخفت حجارة تلقى علينا فكل القوم تسأل عن نفيل كأن علي للحبشان دينا ذكر الواقدي بإسناده أنهم لما تعبوا لدخول الحرم وهيؤا الفيل جعلوا لا يصرفونه إلى جهة من سائر الجهات إلا ذهب فيها فإذا وجههوه إلى الحرم ربض وصاح وجعل أبرهة يحمل على سائس الفيل وينهره ويضربه ليقهر الفيل على دخول الحرم وطال الفصل في ذلك هذا وعبدالمطلب وجماعة من أشراف مكة فيهم المطعم بن عدي وعمرو بن عائد بن عمران بن مخزوم ومسعود بن عمرو الثقفي على حراء ينظرون ما الحبشة يصنعون وماذا يلقون من أمر الفيل وهو العجب العجاب فبينما هم كذلك إذ بعث الله عليهم طيرا أبابيل أي قطعا قطعا صفرا دون الحمام وأرجلها حمر ومع كل طائر ثلاثة أحجار وجاءت فحلقت عليهم وأرسلت تلك الأحجار عليهم فهلكوا. وقال محمد بن إسحاق جاءوا بفيلين فأما محمود فربض وأما الآخر فحصب. وقال وهب بن منبه كان معهم فيلة فأما محمود وهو فيل الملك فربض ليقتدي به بقية الفيلة وكان فيها فيل تشجع فحصب فهربت بقية الفيلة وقال عطاء بن يسار وغيره وليس كلهم أصابه العذاب في الساعة الراهنة بل منهم من هلك سريعا ومنهم من جعل يتساقط عضوا عضوا وهم هاربون وكان أبرهة ممن تساقط عضوا عضوا حتى مات ببلاد خثعم. وقال ابن إسحاق فخرجوا يتساقطون بكل طريق ويهلكون على كل منهل وأصيب أبرهة في جسده وخرجوا به معهم يسقط أنملة أنملة حتى فدموا به صنعاء وهو مثل فرخ الطائر فما مات حتى انصدع صدره عن لبه فيما يزعمون. وذكر مقاتل بن سليمان أن قريشا أصابوا مالا جزيلا من أسلابهم وما كان معهم وأن عبدالمطلب أصاب يومئذ من الذهب ما ملأ حفرة قال ابن إسحاق وحدثني يعقوب بن عتبة أنه حدث أن أول ما رؤيت الحصبة والجدري بأرض العرب ذلك العام وأنه أول ما رؤي به مرائر الشجر الحرمل والحنظل والعسر ذلك العام وهكذا روي عن عكرمة من طريق جيد. قال ابن إسحاق فلما بعث الله محمدا صلى الله عليه وسلم كان فيما يعد به على قريش من نعمته عليهم وفضله ما رد عنهم من أمر الحبشة لبقاء أمرهم ومدتهم فقال \"ألم تر كيف فعل ربك بأصحاب الفيل ألم يجعل كيدهم في تضليل وأرسل عليهم طيرا أبابيل ترميهم بحجاره من سجيل فجعلهم كعصف مأكول\" \"لإيلاف قريش إيلافهم رحلة الشتاء والصيف فليعبدوا رب هذا البيت الذي أطعمهم من جوع وآمنهم من خوف\" أي لئلا يغير شيئا من حالهم التي كانوا عليها لما أراد الله بهم من الخير لو قبلوه قال ابن هشام الأبابيل الجماعات ولم تتكلم العرب بواحدة قال وأما السجيل فأخبرني يونس النحوي وأبو عبيدة أنه عند العرب الشديد الصلب. قال وذكر بعض المفسرين أنهما كلمتان بالفارسية جعلتهما العرب كلمة واحدة وإنما هو سنج وجل يعني بالسنج الحجر والجل الطين يقول الحجارة من هذين الجنسين الحجر والطين قال والعصف ورق الزرع الذي لم يقضب واحدته عصفة انتهى ما ذكره. وقد قال حماد بن سلمة عن عامر عن زر عن عبدالله وأبو سلمة بن عبدالرحمن \"طيرا أبابيل\" قال الفرق وقال ابن عباس والضحاك أبابيل يتبع بعضها بعضا وقال الحسن البصري وقتادة الأبابيل الكثيرة وقال مجاهد أبابيل شتى متتابعة مجتمعة وقال ابن زيد الأبابيل المختلفة تأتي من ههنا ومن ههنا أتتهم من كل مكان وقال الكسائي سمعت بعض النحويين يقول واحد الأبابيل إبيل. وقال ابن جرير حدثني عبدالأعلى حدثني داود عن إسحاق بن عبدالله بن الحارث بن نوفل أنه قال في قوله تعالى \"وأرسل عليهم طيرا أبابيل\" هي الأقاطيع كالإبل المؤبلة وحدثنا أبو كريب حدثنا وكيع عن ابن عون عن ابن سيرين عن ابن عباس \"وأرسل علهيم طيرا أبابيل\" قال لها خراطيم كخراطيم الطير وأكف كأكف الكلاب وحدثنا يعقوب بن إبراهيم حدثنا هشيم أخبرنا حصين عن عكرمة في قوله تعالى \"طيرا أبابيل\" قال كانت طيرا خضرا خرجت من البحر لها رؤوس كرؤوس السباع وحدثنا ابن بشار حدثنا ابن مهدي عن سفيان عن الأعمش عن أبي سفيان عن عبيد بن عمير \"طيرا أبابيل\" قال هي طيور سود بحرية في مناقيرها وأظافرها الحجارة وهذه أسانيد صحيحة وقال سعيد بن جبير كانت طيرا حضرا لها مناقير صفر تختلف عليهم وعن ابن عباس ومجاهد وعطاء كانت الطير الأبابيل مثل التي يقال لها عنقاء مغرب ورواه عنهم ابن أبي حاتم. وقال ابن أبي حاتم حدثنا أبو زرعة حدثنا عبيد الله بن محمد بن أبي شيبة حدثنا أبو معاوية عن الأعمش عن أبي سفيان عن عبيد بن عمير قال لما أراد الله أن يهلك أصحاب الفيل بعث عليهم طيرا أنشئت من البحر أمثال الخطاطيف كل طير منها يحمل ثلاثة أحجار حجرين في رجليه وحجرا في منقاره قال فجاءت حتى صفت على رؤوسهم ثم صاحت وألقت ما في أرجلها ومناقيرها فما يقع حجر على رأس رجل إلا خرج من دبره ولا يقع على شيء من جسده إلا خرج من الجانب الآخر وبعث الله ريحا شديدة فضربت الحجارة فزادتها شدة فأهلكوا جميعا وقال السدي عن عكرمة عن ابن عباس حجارة من سجيل قال طين في حجارة سنك وكل وقد قدمنا بيان ذلك بما أغنى عن إعادته ههنا."
    },
    {
      "ayah": 5,
      "surah": 105,
      "text": "قوله تعالى \"فجعلهم كعصف مأكول\" قال سعيد بن جبير يعني التبن الذي تسميه العامة هبور وفي رواية عن سعيد ورق الحنطة وعنه أيضا العصف التبن والمأكول القصيل يجز للدواب وكذلك قال الحسن البصري وعن ابن عباس العصف القشرة التي على الحبة كالغلاف على الحنطة. وقال ابن زيد العصف ورق الزرع وورق البقل إذا أكلته البهائم فراثته فصار درينا والمعنى أن الله سبحانه وتعالى أهلكهم ودمرهم وردهم بكيدهم وغيظهم لم ينالوا خيرا وأهلك عامتهم ولم يرجع منهم مخبر إلا وهو جريح كما جرى لملكهم أبرهة فإنه انصدع صدره عن قلبه حين وصل إلى بلده صنعاء وأخبرهم بما جرى لهم ثم مات فملك بعده ابنه يكسوم ثم من بعده أخوه مسروق بن أبرهة. ثم خرج سيف بن ذي يزن الحميري إلى كسرى فاستعانه على الحبشة فأنفذ معه من جيوشه فقاتلوا معه فرد الله إليهم ملكهم وما كان في آبائهم من الملك وجاءته وفود العرب بالتهنئة. وقد قال محمد بن إسحاق: حدثنا عبدالله بن أبي بكير عن عمرة بنت عبد الرحمن بن أسعد بن زرارة عن عائشة رضي الله عنها قالت: لقد رأيت قائد الفيل وسائسه بمكة أعميين مقعدين يستطعمان. ورواه الواقدي عن عائشة مثله ورواه عن أسماء بنت أبي بكر أنها قالت كانا مقعدين يستطعمان الناس عند أساف ونائلة حيث يذبح المشركون ذبائحهم \"قلت\" كان اسم قائد الفيل أنيسا. وقد ذكر الحافظ أبو نعيم في كتاب دلائل النبوة من طريق ابن وهب عن ابن لهيعة عن عقيل بن خالد عن عثمان بن المغيرة قصة أصحاب الفيل ولم يذكر أن أبرهة قدم من اليمن وإنما بعث على الجيش رجلا يقال له شمر بن مقصود وكان الجيش عشرين ألفا وذكر أن الطير طرقتهمم ليلا فأصبحوا صرعى وهذا السياق غريب جدا وإن كان أبو نعيم قد قواه ورجحه على غيره والصحيح أن أبرهة الأشرم قدم من مكة كما دل على ذلك السياقات والأشعار. وهكذا روي عن ابن لهيعة عن الأسود عن عروة أن أبرهة بعث الأسود بن مقصود على كتيبة معهم الفيل ولم يذكر قدوم أبرهة نفسه. والصحيح قدومه ولعل ابن مقصود كان على مقدمة الجيش والله أعلم ثم ذكر ابن إسحاق شيئا من أشعار العرب فيما كان من قصة أصحاب الفيل فمن ذلك شعر عبدالله بن الزبعرى: تنكلوا عن بطن مكة إنها كانت قديما لا يرام حريمها لم تخلق الشعرى ليالي حرمت إذ لا عزيز من الأنام يرومها سائل أمير الجيش عنها ما رأى فلسوف ينبي الجاهلين عليمها ستون ألفا لم يؤبوا أرضهم بل لم يعش بعد الإياب سقيمها كانت بها عاد وجرهم قبلهم والله من فوق العباد يقيمها وقال أبو قيس بن الأسلت الأنصاري المدني: ومن صنعه يوم فيل الحبوش إذ كل ما بعثوه رزم محاجنهم تحت أقرابه وقد شرموا أنفه فانخرم وقد جعلوا سوطه مغولا إذا يمموه قفاه كلم فولى وأدبر أدراجه وقد باء بالظلم من كان ثم فأرسل من فوقهم حاصبا يلفهم مثل لف القزم يحض على الصبر أحبارهم وقد ثأجوا كثؤاج الغنم وقال أبو الصلت بن ربيعة الثقفي ويروى لأمية بن أبي الصلت بن أبي ربيعة: إن آيات ربنا باقيات ما يماري فيهن إلا الكفور خلق الليل والنهار فكل مستبين حسابه مقدور ثم يجلو النهار رب رحيم بمهاة شعاعها منشور حبس الفيل بالمغمس حتى صار يحبو كأنه معقور لازما حلقه الجران كما قطر من ظهر كبكب محذور حوله من ملوك كندة أبطال ملاويث في الحروب صقور خلفوه ثم ابذعروا جميعا كلهم عظم ساقه مكسور كل دين يوم القيامة عند الله إلا دين الحنيفة بور وقد قدمنا في تفسير سورة الفتح أن رسول الله صلى الله عليه وسلم لما أطل يوم الحديبية على الثنية التي تهبط به على قريش بركت ناقته فزجروها فألحت فقالوا خلأت القصواء أي حرنت فقال رسول الله صلى الله عليه وسلم \"ما خلأت القصواء وما ذاك لها بخلق ولكن حبسها حابس الفيل - ثم قال - والذي نفسي بيده لا يسألوني اليوم خطة يعظمون فيها حرمات الله إلا أجبتهم إليها\" ثم زجرها فقامت. والحديث من أفراد البخاري وفي الصحيحين أن رسول الله صلى الله عليه وسلم قال يوم فتح مكة\"إن الله حبس عن مكة الفيل وسلط عليها رسوله والمؤمنين وإنه قد عادت حرمتها اليوم كحرمتها بالأمس ألا فليبلغ الشاهد الغائب\". آخر تفسير سورة الفيل ولله الحمد والمنة."
    }
  ]
}
