{
  "ayahs": [
    {
      "ayah": 1,
      "surah": 106,
      "text": "سورة قريش: \"ذكر حديث غريب في فضلها\" قال البيهقي في كتاب الخلافيات حدثنا أبو عبدالله الحافظ حدثنا بكر بن محمد بن حمدان الصيرفي بمرو حدثنا أحمد بن عبدالله المديني حدثنا يعقوب بن محمد الزهري حدثنا إبراهيم بن محمد بن ثابت بن شرحبيل حدثني عثمان بن عبدالله بن أبي عتيق عن سعيد بن عمرو بن جعدة بن هبيرة عن أبيه عن جدته أم هانئ بنت أبي طالب أن رسول الله صلى الله عليه وسلم قال \"فضل الله قريشا بسبع خلال: إني منهم وإن النبوة فيهم والحجابة والسقاية فيهم وإن الله نصرهم على الفيل وإنهم عبدوا الله عز وجل عشر سنين لا يعبده غيرهم وإن الله أنزل فيهم سورة من القرآن - ثم تلا رسول الله صلى الله عليه وسلم - \"بسم الله الرحمن الرحيم لإيلاف قريش إيلافهم رحلة الشتاء والصيف فليعبدوا رب هذا البيت الذي أطعمهم من جوع وآمنهم من خوف\". هذه السورة مفصولة عن التي قبلها في المصحف الإمام كتبوا بينهما سطر بسم الله الرحمن الرحيم وإن كانت متعلقة بما قبلها كما صرح بذلك محمد بن إسحاق وعبدالرحمن بن زيد بن أسلم لأن المعنى عندهما حبسنا عن مكة الفيل وأهلكنا أهله لإيلاف قريش أي لإتلافهم واجتماعهم في بلدهم آمنين."
    },
    {
      "ayah": 2,
      "surah": 106,
      "text": "قيل المراد بذلك ما كانوا يألفونه من الرحلة في الشتاء إلى اليمن وفي الصيف إلى الشام في المتاجر وغير ذلك ثم يرجعون إلى بلدهم آمنين في أسفارهم لعظمتهم عند الناس لكونهم سكان حرم الله فمن عرفهم احترمهم بل من صوفي إليهم وسار معهم أمن بهم وهذا حالهم في أسفارهم ورحلتهم في شتائهم وصيفهم وأما في حال إقامتهم في البلد فكما قال الله تعالى \"أو لم يروا أنا جعلنا حرما آمنا ويتخطف الناس من حولهم\" ولهذا قال تعالى \"لإيلاف قريش إيلافهم\" بدل من الأول ومفسر له ولهذا قال تعالى \"إيلافهم رحلة الشتاء والصيف\" قال ابن جرير: الصواب أن اللام لام التعجب كأنه يقول اعجبوا لإيلاف قريش ونعم عليهم في ذلك قال وذلك لإجماع المسلمين على أنهما سورتان منفصلتان مستقلتان."
    },
    {
      "ayah": 3,
      "surah": 106,
      "text": "أرشدهم إلى شكر هذه النعمة العظيمة فقال \"فليعبدوا رب هذا البيت\" أي فليوحدوه بالعبادة كما جعل لهم حرما آمنا وبيتا محرما كما قال تعالى \"قل إنما أمرت أن أعبد رب هذه البلدة الذي حرمها وله كل شيء وأمرت أن أكون من المسلمين\"."
    },
    {
      "ayah": 4,
      "surah": 106,
      "text": "أي هو رب البيت وهو الذي أطعمهم من جوع \"وآمنهم من خوف\" أي تفضل عليهم بالأمن والرخص فليفردوه بالعبادة وحده لا شريك له ولا يعبدوا من دونه صنما ولا ندا ولا وثنا ولهذا من استجاب لهذا الأمر جمع الله له بين أمن الدنيا وأمن الآخرة ومن عصاه سلبهما منه كما قال تعالى \"ضرب الله مثلا قرية كانت آمنة مطمئنة يأتيها رزقها رغدا من كل مكان فكفرت بأنعم الله فأذاقها الله لباس الجوع والخوف بما كانوا يصنعون ولقد جاءهم رسول منهم فكذبوه فأخذهم العذاب وهم ظالمون\". وقد قال ابن أبي حاتم حدثنا عبدالله بن عمرو الغزي حدثنا قبيصة حدثنا سفيان عن ليث عن شهر بن حوشب عن أسماء بنت يزيد قالت سمعت رسول الله صلى الله عليه وسلم يقول \"ويل لكم لإيلاف قريش من قريش\" ثم قال حدثنا أبي حدثنا المؤمل بن الفضل الحراني حدثنا عيسى يعني ابن يونس عن عبدالله بن أبي زياد عن شهر بن حوشب عن أسامة بن زيد قال سمعت رسول الله صلى الله عليه وسلم يقول \"لإيلاف قريش إيلافهم رحلة الشتاء والصيف\" ويحكم يا معشر قريش اعبدوا رب هذا البيت الذي أطعمكم من جوع وآمنكم من خوف\" هكذا رأيته عن أسامة بن زيد وصوابه عن أسماء بنت يزيد بن السكن أم سلمة الأنصارية رضي الله عنها فلعله وقع غلط في النسخة أو في أصل الرواية والله أعلم. آخر تفسير سورة لإيلاف قريش ولله الحمد والمنة."
    }
  ]
}
