{
  "ayahs": [
    { "ayah": 1, "surah": 107, "text": "وهو المعاد والجزاء والثواب." },
    { "ayah": 2, "surah": 107, "text": "أي هو الذي يقهر اليتيم ويظلمه حقه ولا يطعمه ولا يحسن إليه." },
    { "ayah": 3, "surah": 107, "text": "يعني الفقير الذي لا شيء له يقوم بأوده وكفايته." },
    {
      "ayah": 4,
      "surah": 107,
      "text": "قال تعالى \"فويل للمصلين الذين هم عن صلاتهم ساهون\" قال ابن عباس وغيره يعني المنافقين الذين يصلون في العلانية ولا يصلون في السر ولهذا قال \"للمصلين\" الذي هم من أهل الصلاة وقد التزموا بها ثم هم عنها ساهون إما عن فعلها بالكلية كما قاله ابن عباس وإما عن فعلها في الوقت المقدر لها شرعا فيخرجها عن وقتها بالكليه كما قاله مسروق وأبو الضحى."
    },
    {
      "ayah": 5,
      "surah": 107,
      "text": "وقال عطاء بن دينار الحمد لله الذي قال \"عن صلاتهم ساهون\" ولم يقل في صلاتهم ساهون. وإما عن وقتها الأول فيؤخرونها إلى آخره دائما أو غالبا وإما عن أدائها بأركانها وشروطها على الوجه المأمور به. وإما عن الخشوع فيها والتدبر لمعانيها فاللفظ يشمل ذلك كله ولكن من اتصف بشيء من ذلك قسط من هذه الآية ومن اتصف بجميع ذلك فقد تم له نصيبه منها وكمل له النفاق العملي كما ثبت في الصحيحين أن رسول الله صلى الله عليه وسلم قال \"تلك صلاة المنافق تلك صلاة المنافق تلك صلاة المنافق يجلس يرقب الشمس إذا كانت بين قرني الشيطان قام فنقر أربعا لا يذكر الله فيها إلا قليلا\" فهذا آخر صلاة العصر التي هي الوسطى كما ثبت به النص إلى آخر وقتها وهو وقت كراهة ثم قام إليها فنقرها نقر الغراب لم يطمئن ولا خشع فيها أيضا ولهذا قال \"لا يذكر الله فيها إلا قليلا\" ولعله إنما حمله على القيام إليها مرآة الناس لا ابتغاء وجه الله فهو كما إذا لم يصل بالكلية. قال الله تعالى \"إن المنافقين يخادعون الله وهو خادعهم وإذا قاموا إلى الصلاة قاموا كسالى يراءون الناس ولا يذكرون الله إلا قليلا\"."
    },
    {
      "ayah": 6,
      "surah": 107,
      "text": "قال الطبراني حدثنا يحيى بن عبدالله بن عبد ربه البغدادي حدثني أبي حدثنا عبدالوهاب بن عطاء عن يونس عن الحسن عن ابن عباس رضي الله عنهما عن النبي صلى الله عليه وسلم قال \"إن في جهنم لواديا تستعيذ جهنم من ذلك الوادي في كل يوم أربعمائة مرة أعد ذلك الوادي للمرائين من أمة محمد لحامل كتاب الله وللمصدق في غير ذات الله وللحاج إلى بيت الله وللخارج في سبيل الله\". وقال الإمام أحمد حدثنا أبن نعيم حدثنا الأعمش عن عمرو بن مرة قال كنا جلوسا عند أبي عبيدة فذكروا الرياء فقال رجل يكنى بأبي يزيد سمعت عبدالله بن عمرو يقول قال رسول الله صلى الله عليه وسلم \"من سمع الناس بعمله سمع الله به سامع خلقه وحقره وصغره\" ورواه أيضا عن غندر ويحيى القطان عن شعبة عن عمرو بن مرة عن رجل عن عبدالله بن عمرو عن النبي صلى الله عليه وسلم فذكره ومما يتعلق بقوله تعالى \"الذين هم يراءون\" أن من عمل عملا لله فاطلع عليه الناس فأعجبه ذلك أن هذا لا يعد رياء والدليل على ذلك ما رواه الحافظ أبو يعلى الموصلي في سنده حدثنا هارون بن معروف حدثنا مخلد بن يزيد حدثنا سعيد بن بشير حدثنا الأعمش عن أبي صالح عن أبي هريرة رضي الله عنه قال: كنت أصلي فدخل علي رجل فأعجبني ذلك فذكرته لرسول الله صلى الله عليه وسلم فقال \"كتب لك أجران أجر السر وأجر العلانية\" قال أبو علي هارون بن معروف بلغني أن ابن المبارك قال نعم الحديث للمرائين وهذا حديث غريب من هذا الوجه وسعيد بن بشير متوسط وروايته عن الأعمش عزيزة وقد رواه غيره عنه قال أبو يعلى أيضا حدثنا محمد بن المثنى بن موسى حدثنا أبو داود حدثنا أبو سنان عن حبيب بن أبي ثابت عن أبي صالح عن أبي هريرة رضي الله عنه عنه قال: قال رجل يا رسول الله الرجل يعمل العمل يسره فإذا اطلع عليه أعجبه قال قال رسول الله صلى الله عليه وسلم \"له أجران أجر السر وأجر العلانية\" وقد رواه الترمذي عن محمد بن المثنى وابن ماجه عن بندار كلاهما عن أبي داود الطيالسي عن أبي ستان الشيباني واسمه ضرار بن مرة ثم قال الترمذي غريب وقد رواه الأعمش وغيره عن حبيب عن أبي صالح مرسلا. وقد قال أبو جعفر بن جرير حدثني أبو كريب حدثنا معاوية بن هشام عن شيبان النحوي عن جابر الجعفي حدثني رجل ن أبي برزة الأسلمي قال: قال رسول الله صلى الله عليه وسلم لما نزلت هذه الآية \"الذين هم عن صلاتهم ساهون\" قال \"الله أكبر هذا خير لكم من أن لو أعطي كل رجل منكم مثل جميع الدنيا هو الذي إن صلى لم يرج خير صلاته وإن تركها لم يخف ربه\" فيه جابر الجعفي وهو ضعيف وشيخه مبهم لم يسم والله أعلم. وقال ابن جرير أيضا حدثني زكريا بن أبان المصري حدثنا عمرو بن طارق حدثنا عكرمة بن إبراهيم حدثني عبدالملك بن عمير عن مصعب بن سعد عن سعد بن أبي وقاص قال سألت رسول الله صلى الله عليه وسلم عن \"الذين هم عن صلاتهم ساهون\" قال \"هم الذين يؤخرون الصلاة عن وقتها\" قلت وتأخير الصلاة عن وقتها يحتمل تركها بالكلية ويحتمل صلاتها بعد وقتها شرعا وتأخيرها عن أول الوقت وكذا رواه الحافظ أبو يعلى عن شيبان بن فروخ عن عكرمة بن إبراهيم به. ثم رواه عن أبي الربيع عن عاصم عن مصعب عن أبيه موقوفا: سهوا عنها حتى ضاع الوقت وهذا أصح إسنادا وقد ضعف البيهقي رفعه وصحح وقفه وكذلك الحاكم."
    },
    {
      "ayah": 7,
      "surah": 107,
      "text": "أي لا أحسنوا عبادة ربهم ولا أحسنوا إلى خلقه حتى ولا بإعارة ما ينتفع به ويستعان به مع بقاء عينه ورجوعه إليهم فهؤلاء لمنع الزكاة وأنواع القرابات أولى وأولى وقد قال ابن أبي نجيح عن مجاهد قال علي الماعون الزكاة وكذا رواه السدي عن أبي صالح عن علي وكذا روي من غير وجه عن ابن عمر وبه يقول محمد بن الحنفية وسعيد بن جبير وعكرمة ومجاهد وعطاء وعطية العوفي والزهري والحسن وقتادة والضحاك وابن زيد قال الحسن البصري إن صلى راءى وإن فاتته لم يأس عليها ويمنع زكاة ماله وفي لفظ صدقة ماله وقال زيد بن أسلم هم المنافقون ظهرت الصلاة فصلوها وخفيت الزكاة فمنعوها. وقال الأعمش وشعبة عن الحكم عن يحيى بن الخراز أن أبا العبيدين سأل عبدالله بن مسعود عن الماعون فقال هو ما يتعاوره الناس بينهم من الفأس والقدر وقال المسعودي عن سلمة بن كهيل عن أبي العبيدين أنه سأل ابن مسعود عن الماعون فقال هو ما يتعاطاه الناس بينهم من الفأس والقدر والدلو وأشباه ذلك. وقال ابن جرير حدثني محمد بن زيد المحاربي حدثنا أبو الأحوص عن أبي إسحاق عن أبي العبيدين وسعيد بن عياض عن عبدالله قال كنا أصحاب محمد صلى الله عليه وسلم نتحدث أن الماعون الدلو والفأس والقدر لا يستغنى عنهن وحدثنا خلاد بن أسلم أخبرنا النضر بن شميل أخبرنا شعبة عن أبي إسحاق قال سمعت سعد بن عياض يحدث عن أصحاب النبي صلى الله عليه وسلم مثله. وقال الأعمش عن إبراهيم عن الحارث بن سويد عن عبدالله أنه سئل عن الماعون فقال ما يتعاوره الناس بينهم الفأس والدلو وشبهه. وقال ابن جرير حدثنا عمرو بن علي الفلاس حدثنا أبو داود الطيالسي حدثنا أبو عوانة عن عاصم بن بهدلة عن أبي وائل عن عبدالله قال كنا مع نبينا صلى الله عليه وسلم ونحن نقول الماعون مع الدلو وأشباه ذلك. وقد رواه أبو داود والنسائي عن قتيبة عن أبي عوانة بإسناده نحوه ولفظ النسائي عن عبدالله قال: كل معروف صدقة وكنا نعد الماعون على عهد رسول الله صلى الله عليه وسلم عارية الدلو والقدر وقال ابن أبي حاتم حدثنا أبي حدثنا عفان حدثنا حماد بن سلمة عن عاصم عن زر عن عبدالله قال: الماعون العواري القدر والميزان والدلو وقال ابن أبي نجيح عن مجاهد عن ابن عباس \"ويمنعون الماعون\" يعني متاع البيت وكذا قال مجاهد وإبراهيم النخعي وسعيد بن جبير وأبو مالك وغير واحد إنها العارية للأمتعة وقال ليث بن أبي سليم ومجاهد عن ابن عباس \"ويمنعون الماعون\" قال لم يجيء أهلها بعد وقال العوفي عن ابن عباس \"ويمنعون الماعون\" قال اختلف الناس في ذلك فمنهم من قال يمنعون الزكاة ومنهم من قال يمنعون الطاعة ومنهم من قال يمنعون العارية رواه ابن جرير ثم روى عن يعقوب بن إبراهيم عن ابن عليه عن ليث بن أبي سليم عن أبي إسحاق عن الحارث عن علي: الماعون منع الناس الفأس والقدر والدلو وقال عكرمة رأس الماعون زكاة المال وأدناه المنخل والدلو والإبرة رواه ابن أبى حاتم وهذا الذي قاله عكرمة حسن فإنه يشمل الأقوال كلها وترجع كلها إلى شيء واحد هو ترك المعاونة بمال أو منفعة ولهذا قال محمد بن كعب \"ويمنعون الماعون\" قال المعروف ولهذا جاء في الحديث \"كل معروف صدقة\" وقال ابن أبي حاتم حدثنا أبو سعيد الأشج حدثنا وكيع عن ابن أبي ذئب عن الزهري \"ويمنعون الماعون\" قال بلسان قريش المال. وروى ههنا حديثا غريبا عجيبا في إسناده ومتنه فقال حدثنا أبي وأبو زرعة قالا حدثنا قيس بن حفص الدارمي حدثنا دلهم ابن دهيم العجلى حدثنا عائذ بن ربيعة النميري حدثني قرة بن دعموص النميري أنهم وفدوا على رسول الله صلى الله عليه وسلم فقالوا يا رسول الله ما تعهد إلينا قال \"لا تمنعون الماعون\" قالوا يا رسول الله وما الماعون؟ قال \"في الحجر وفي الحديدة وفي الماء\" قالوا فأي الحديدة؟ قال \"قدوركم النحاس وحديد الفأس الذي تمتهنون به\" قالوا ما الحجر؟ قال \"قدوركم الحجارة\" غريب جدا ورفعه منكر وفي إسناده من لا يعرف والله أعلم. وقد ذكر ابن الأثير في الصحابة ترجمة علي النميري فقال روى ابن مانع بسنده إلى عامر بن ربيعة بن قيس النميري عن علي بن فلان النميري سمعت رسول الله صلى الله عليه وسلم يقول \"المسلم أخو المسلم إذا لقيه جاء بالسلام ويرد عليه ما هو خير منه لا يمنع الماعون\" قلت يا رسول الله ما الماعون؟ قال \"الحجر والحديد وأشباه ذلك\" الله أعلم. آخر تفسير السورة ولله الحمد والمنة."
    }
  ]
}
