{
  "ayahs": [
    {
      "ayah": 1,
      "surah": 109,
      "text": "سورة الكافرون: ثبت في صحيح مسلم عن جابر أن رسول الله صلى الله عليه وسلم قرأ بهذه السورة وبـ \"قل هو الله أحد\" في ركعتي الطواف وفي صحيح مسلم من حديث أبي هريرة ان رسول الله صلى الله عليه وسلم قرأ بهما في ركعتي الفجر وقال الإمام أحمد حدثنا وكيع حدثنا إسرائيل عن أبي إسحاق عن مجاهد عن ابن عمر أن رسول الله صلى الله عليه وسلم قرأ في الركعتين قبل الفجر والركعتين بعد المغرب بضعا وعشرين مرة أو بضع عشرة مرة \"قل يا أيها الكافرون\" و \"قل هو الله أحد\". وقال أحمد أيضا حدثنا محمد بن عبدالله بن الزبير حدثنا إسرائيل عن أبي إسحاق عن مجاهد عن ابن عمر قال رمقت النبي صلى الله عليه وسلم أربعا وعشرين أو خمسا وعشرين مرة يقرأ في الركعتين قبل الفجر والركعتين بعد المغرب بـ \"قل يا أيها الكافرون\" و \"قل هو الله أحد\". وقال أحمد حدثنا أبو أحمد هو محمد بن عبدالله بن الزبير حدثنا سفيان هو الثوري عن أبي إسحاق عن مجاهد عن ابن عمر قال رمقت النبي صلى الله عليه وسلم شهرا وكان يقرأ في الركعتين قبل الفجر بـ \"قل يا أيها الكافرون\" و \"قل هو الله أحد\" وكذا رواه الترمذي وابن ماجه من حديث أبي أحمد الزبيري وأخرجه النسائي من وجه آخر عن أبي إسحاق به وقال الترمذي هذا حديث حسن وقد تقدم في الحديث أنها تعدل ربع القرآن وإذا زلزلت تعدل ربع القرآن وقال الإمام أحمد حدثنا هاشم بن القاسم حدثنا زهير حدثنا أبو إسحاق عن فروة بن نوفل هو ابن معاوية عن أبيه أن رسول الله صلى الله عليه وسلم قال له \"هل لك في ربيبة لنا تكفلها؟\" قال أراها زينب قال ثم جاء فسأله النبي صلى الله عليه وسلم عنها قال \"ما فعلت الجارية؟\" قال تركتها عند أمها قال \"فمجيء ما جاء بك\" قال جئت لتعلمني شيئا أقوله عند منامي قال \"اقرأ \"قل يا أيها الكافرون\" ثم نم على خاتمتها فإنها براءة من الشرك\". تفرد به أحمد وقال أبو القاسم الطبراني حدثنا أحمد بن عمر القطراني حدثنا محمد بن الطفيل حدثنا شريك عن أبي إسحاق عن جبلة بن حارثه وهو أخو زيد بن حارثة أن النبي صلى الله عليه وسلم قال \"إذا أويت إلى فراشك فاقرأ \"قل يا أيها الكافرون\" حتى تمر بآخرها فإنها براءة من الشرك\". وروى الطبراني من طريق شريك عن جابر عن معقل الزبيدي عن عبدالرحمن بن أن رسول الله صلى الله عليه وسلم كان إذا أخذ مضجعه قرأ \"قل يا أيها الكافرون\" حتى يختمها. وقال الإمام أحمد حدثنا حجاج حدثنا شريك عن أبي إسحاق عن فروة بن نوفل عن الحارث بن جبلة قال: قلت يا رسول الله علمني شيئا أقوله عند منامي قال \"إذا أخذت مضجعك من الليل فاقرأ \"قل يا أيها الكافرون\" فإنها براءة من الشرك\" والله أعلم. هذه السورة سورة البراءة من العمل الذي يعمله المشركون وهي آمره بالإخلاص فيه فقوله \"قل يا أيها الكافرون\" يشمل كل كافر على وجه الأرض ولكن المواجهون بهذا الخطاب هم كفار قريش وقيل إنهم من جهلهم دعوا رسول الله صلى الله عليه وسلم إلى عبادة أوثانهم سنة ويعبدون معبوده سنة فأنزل الله هذه السورة وأمر رسوله صلى الله عليه وسلم فيها أن يتبرأ من دينهم بالكلية."
    },
    { "ayah": 2, "surah": 109, "text": "يعني من الأصنام والأنداد." },
    { "ayah": 3, "surah": 109, "text": "وهو الله وحده لا شريك له." },
    {
      "ayah": 4,
      "surah": 109,
      "text": "فما ههنا بمعنى من قال \"ولا أنا عابد ما عبدتم ولا أنتم عابدون ما أعبد\" أي ولا أعبد عبادتكم أي لا أسلكها ولا أقتدي بها وإنما أعبد الله على الوجه الذي يحبه ويرضاه."
    },
    {
      "ayah": 5,
      "surah": 109,
      "text": "أي لا تقتدون بأوامر الله وشرعه في عبادته بل قد اخترعتم شيئا من تلقاء أنفسكم كما قال \"إن يتبعون إلا الظن وما تهوى الأنفس ولقد جاءهم من ربهم الهدى\" فتبرأ منهم في جميع ما هم فيه فإن العابد لا بد له من معبود يعبده وعبادة يسلكها إليه فالرسول صلى الله عليه وسلم وأتباعه يعبدون الله بما شرعه ولهذا كان كلمة الإسلام لا إله إلا الله محمد رسول الله أي لا معبود إلا الله ولا طريق إليه إلا ما جاء به الرسول صلى الله عليه وسلم والمشركون يعبدون غير الله عبادة لم يأذن بها الله."
    },
    {
      "ayah": 6,
      "surah": 109,
      "text": "قال لهم الرسول صلى الله عليه وسلم \"لكم دينكم ولي دين\" كما قال تعالى \"وإن كذبوك فقل لي عملي ولكم عملكم أنتم بريئون مما أعمل وأنا بريء مما تعملون\" وقال \"لنا أعمالنا ولكم أعمالكم\". وقال البخاري يقال \"لكم دينكم\" الكفر \"ولي دين\" الإسلام ولم يقل ديني لأن الآيات بالنون فحذف الياء كما قال \"فهو يهدين\" و \"يشفين\" وقال غيره لا أعبد ما تعبدون الآن ولا أجيبكم فيما بقي من عمري ولا أنتم عابدون ما أعبد وهم الذين قال \"وليزيدن كثيرا منهم ما أنزل إليك من ربك طغيانا وكفرا\" انتهى ما ذكره. ونقل ابن جرير عن بعض أهل العربية أن ذلك من باب التأكيد كقوله \"فإن مع العسر يسرا إن مع العسر يسرا\" وكقوله \"لترون الجحيم ثم لترونها عين اليقين\" وحكاه بعضهم كابن الجوزي وغيره عن ابن قتيبة فالله أعلم. فهذه ثلاثة أقوال \"أولها\" ما ذكرناه أولا \"الثاني\" ما حكاه البخاري وغيره من المفسرين أن المراد \"لا أعبد ما تعبدون ولا أنتم عابدون ما أعبد\" في الماضي \"ولا أنا عابد ما عبدتم\" نفي قبوله لذلك بالكلية لأن النفي بالجملة الاسمية آكد فكأنه نفي الفعل وكونه قابلا لذلك ومعناه نفي الوقوع ونفي الإمكان الشرعي أيضا وهو قول حسن أيضا والله أعلم. وقد استدل الإمام أبو عبدالله الشافعي وغيره بهذه الآية الكريمة \"لكم دينكم ولي دين\" على أن الكفر كله ملة واحدة فورث اليهود من النصارى وبالعكس إذا كان بينهما نسب أو سبب يتوارث به لأن الأديان ما عدا الإسلام كلها كالشيء الواحد في البطلان. وذهب أحمد بن حنبل ومن وافقه إلى عدم توريث النصارى من اليهود وبالعكس لحديث عمرو بن شعيب عن أبيه عن جده قال: قال رسول الله صلى الله عليه وسلم \"لا يتوارث أهل ملتين شتى\". آخر تفسير سورة قل يا أيها الكافرون."
    }
  ]
}
