{
  "ayahs": [
    {
      "ayah": 1,
      "surah": 11,
      "text": "سورة هود: قال الحافظ أبو يعلى حدثنا خلف بن هشام البزار حدثنا أبو الأحوص عن أبي إسحاق عن عكرمة قال: قال أبو بكر سألت رسول الله صلي الله عليه وسلم ما شيبك ؟ قال \"شيبتني هود والواقعة وعم يتساءلون وإذا الشمس كورت\" وقال أبو عيسى الترمذي حدثنا أبو كريب محمد بن العلاء حدثنا معاوية بن هشام عن شيبان عن أبي إسحاق عن عكرمة عن ابن عباس قال: قال أبو بكر يا رسول الله قد شبت قال \"شيبتني هود والواقعة والمرسلات وعم يتساءلون وإذا الشمس كورت\". وفي رواية \"هود وأخواتها\". وقال الطبراني حدثنا عبدان بن أحمد حدثنا حجاج بن الحسن حدثنا سعيد بن سلام حدثنا عمر بن محمد عن أبي حازم عن سهل بن سعد قال: قال رسول الله صلي الله عليه وسلم \"شيبتني هود وأخواتها: الواقعة والحاقة وإذا الشمس كورت\" وفي رواية \"هود وأخواتها\" وقد روى من حديث ابن مسعود نحوه فقال الحافظ أبن القاسم سليمان بن أحمد الطبراني في معجمه الكبير حدثنا محمد بن عثمان بن أبي شبيب حدثنا أحمد بن طارق الرابشي حدثنا عمرو بن ثابت عن أبي إسحاق عن عبدالله بن مسعود رضي الله عنه أن أبا بكر قال يا رسول الله ما شيبك ؟ قال \"هود والواقعة\". عمرو بن ثابت متروك وأبو إسحاق لم يدرك ابن مسعود والله أعلم. بسم الله الرحمن الرحيم قد اختلف المفسرون في الحروف المقطعة التي في أوائل السور فمنهم من قال هي مما استأثر الله بعلمه فردوا علمها إلى الله ولم يفسرها حكاه القرطبي في تفسـره عن أبي بكر وعمر وعثمان وعلي وابن مسعود رضي الله عنهم أجمعين وقاله عامر الشعبي وسفيان الثوري والربيع بن خيثم واختاره أبو حاتم بن حبان. ومنهم من فسرها واختلف هؤلاء في معناها فقال عبدالرحمن بن زيد بن أسلم إنما هي أسماء السور. قال العلامة أبو القاسم محمود بن عمر الزمخشري في تفسيره وعليه إطباق الأكثر ونقل عن سيبويه أنه نص عليه ويعتضد لهذا بما ورد في الصحيحين عن أبي هريرة أن رسول الله صلى الله عليه وسلم كان يقرأ في صلاة الصبح يوم الجمعة \"الم\" السجدة و \"هل أتى على الإنسان\" وقال سفيان الثوري عن ابن أبي نجيح عن مجاهد أنه قال: الم وحم والمص وص. فواتح افتتح الله بها القرآن وكذا وأما قوله \"أحكمت آياته ثم فصلت\" أي هي محكمة في لفظها مفصلة في معناها فهو كامل صورة ومعنى ; هذا معنى ما روى عن مجاهد وقتادة واختاره ابن جرير ومعنى قوله \"من لدن حكيم خبير\" أي من عند الله الحكيم في أقواله وأحكامه خبير بعواقب الأمور."
    },
    {
      "ayah": 10,
      "surah": 11,
      "text": "وهكذا إن أصابته نعمة بعد نقمة \"ليقولن ذهب السيئات عني\" أي يقول ما ينالني بعد هذا ضيم ولا سوء \"إنه لفرح فخور\" أي فرح بما في يده بطر فخور على غيره."
    },
    {
      "ayah": 100,
      "surah": 11,
      "text": "لما ذكر تعالى خبر الأنبياء وما جرى لهم مع أممهم وكيف أهلك الكافرين ونجي المؤمنين قال \"ذلك من أنباء القرى\" أي أخبارهم \"نقصه عليك منها قائم\" أي عامر \"وحصيد\" أي هالك."
    },
    {
      "ayah": 101,
      "surah": 11,
      "text": "\"وما ظلمناهم\" أي إذ أهلكناهم \"ولكن ظلموا أنفسهم\" بتكذيبهم رسلنا وكفرهم بهم \"فما أغنت عنهم آلهتهم\" أوثانهم التي يعبدونها ويدعونها \"من دون الله من شيء\" ما نفعوهم ولا أنقذوهم لما جاء أمر الله بإهلاكهم \"وما زادوهم غير تتبيب\" قال مجاهد وقتادة وغيرهما أي غير تخسير وذلك أن سبب هلاكهم ودمارهم إنما كان باتباعهم تلك الآلهة فلهذا خسروا في الدنيا والآخرة."
    },
    {
      "ayah": 102,
      "surah": 11,
      "text": "يقول تعالى وكما أهلكنا أولئك القرون الظالمة المكذبة لرسلنا كذلك نفعل بأشباههم \"إن أخذه أليم شديد\" وفي الصحيحين عن أبي موسى رضي الله عنه قال: قال رسول الله صلي الله عليه وسلم \"إن الله ليملي للظالم حتى إذا أخذه لم يفلته\" ثم قرأ رسول الله صلي الله عليه وسلم \"وكذلك أخذ ربك إذا أخذ القرى وهي ظالمة\" الآية."
    },
    {
      "ayah": 103,
      "surah": 11,
      "text": "يقول تعالى إن في إهلاكنا الكافرين وإنجائنا المؤمنين \"لآية\" أي عظة واعتبارا على صدق موعودنا في الآخرة \"إنا لننصر رسلنا والذين آمنوا وفي الحياة الدنيا ويوم يقوم الأشهاد\" وقال تعالى \"فأوحى إليهم ربهم لنهلكن الظالمين\" الآية وقوله \"ذلك يوم مجموع له الناس\" أي أولهم وآخرهم كقوله\"وحشرناهم فلم نغادر منهم أحدا\" \"وذلك يوم مشهود\" أي عظيم تحضره الملائكة ويجتمع فيه الرسل وتحشر الخلائق بأسرهم من الإنس والجن والطير والوحوش والدواب ويحكم فيه العادل الذي لا يظلم مثقال ذرة وإن تك حسنة يضاعفها."
    },
    {
      "ayah": 104,
      "surah": 11,
      "text": "وقوله \"وما نؤخره إلا لأجل معدود\" أي ما نؤخر إقامة القيامة إلا لأنه قد سبقت كلمة الله في وجود أناس معدودين من ذرية آدم وضرب مدة معينة إذا انقطعت وتكامل وجود أولئك المقدر خروجهم قامت الساعة ولهذا قال \"وما نؤخره إلا لأجل معدود\" أي لمدة مؤقتة لا يزاد عليها ولا ينتقص منها."
    },
    {
      "ayah": 105,
      "surah": 11,
      "text": "\"يوم يأت لا تكلم نفس إلا بإذنه\" أي يوم يأتي يوم القيامة لا يتكلم أحد إلا بإذن الله كقوله \"لا يتكلمون إلا من أذن له الرحمن وقال صوابا\" وقال \"وخشعت الأصوات للرحمن\" الآية. وفي الصحيحين من حديث الشفاعة \"ولا يتكلم يومئذ إلا الرسل ودعوى الرسل يومئذ اللهم سلم سلم\" وقوله \"فمنهم شقي وسعيد\" أي فمن أهل الجمع شقي ومنهم سعيد كما قال \"فريق في الجنة وفريق في السعير\" وقال الحافظ أبو يعلى في مسنده: ثنا موسى بن حسان ثنا عبدالملك بن عمرو ثنا سليمان أبو سفيان ثنا عبدالله بن دينار عن ابن عمر عن عمر قال: لما نزلت \"فمنهم شقي وسعيد\" سألت النبي صلي الله عليه وسلم فقلت: يا رسول الله علام نعمل؟ علي شيء قد فرغ منه أم على شيء لم يفرغ منه؟ فقال \"على شيء قد فرغ منه يا عمر وجرت به الأقلام ولكن كل ميسر لما خلق له\" ثم بين تعالى حال الأشقياء وحال السعداء فقال:."
    },
    {
      "ayah": 106,
      "surah": 11,
      "text": "يقول تعالى \"لهم فيها زفير وشهيق\" قال ابن عباس: الزفير في الحلق والشهيق في الصدر أي تنفسهم زفير وأخذهم النفس شهيق لما هم فيه من العذاب عياذا بالله من ذلك."
    },
    {
      "ayah": 107,
      "surah": 11,
      "text": "\"خالدين فيها ما دامت السموات والأرض\" قال الإمام أبو جعفر بن جرير: من عادة العرب إذا أرادت أن تصف الشيء بالدوام أبدا قالت هذا دائم دوام السموات والأرض وكذلك يقولون هو باق ما اختلف الليل والنهار وما سمر أبناء سمير وما لألأت العير بأذنابها. يعنون بذلك كله أبدا فخاطبهم جل ثناؤه وبما يتعارفونه بينهم فقال \"خالدين فيها ما دامت السموات والأرض\" قلت: ويحتمل أن المراد بما دامت السموات والأرض الجنس لأنه لا بد في عالم الآخرة من سموات وأرض كما قال تعالى \"يوم تبدل الأرض غير والأرض والسموات\" ولهذا قال الحسن البصري في قوله \"ما دامت السموات والأرض\" قال: يقول سماء غير هذه السماء وأرض غير هذه فما دامت تلك السماء وتلك الأرض. وقال ابن أبي حاتم: ذكر عن سفيان بن حسين عن الحكم عن مجاهد عن ابن عباس قوله \"ما دامت السموات والأرض\" قال: لكل جنة سماء وأرض وقال عبدالرحمن بن زيد بن أسلم: ما دامت الأرض أرضا والسماء سماء. وقوله \"إلا ما شاء ربك إن ربك فعال لما يريد\" كقوله \"النار مثواكم خالدين فيها إلا ما شاء الله إن ربك حكيم عليم\" وقد اختلف المفسرون في المراد من هذا الاستثناء على أقوال كثيرة حكاها الشيخ أبو الفرج بن الجوزي في كتابة زاد المسير وغيره من علماء التفسير ونقل كثيرا منها الإمام أبو جعفر بن جرير رحمه الله في كتابه واختار هو ما نقله عن خالد بن معدان والضحاك وقتادة وابن سنان ورواه ابن أبي حاتم عن ابن عباس والحسن أيضا أن الاستثناء عائد على العصاة من أهل التوحيد ممن يخرجهم الله من النار بشفاعة الشافعين من الملائكة والنبيين والمؤمنين حتي يشفعون في أصحاب الكبائر ثم تأتي رحمة أرحم الراحمين فتخرج من النار من لم يعمل خيرا قط وقال يوما من الدهر لا إله إلا الله كما وردت بذلك الأخبار الصحيحة المستفيضة عن رسول الله صلي الله عليه وسلم بمضمون ذلك من حديث أنس وجابر وأبي سعيد وأبي هريرة وغيرهم من الصحابة ولا يبقي بعد ذلك في النار إلا من وجب عليه الخلود فيها ولا محيد له عنها وهذا الذي عليه كثير من العلماء قديما وحديثا في تفسير هذه الآية الكريمة. وقد روي في تفسيرها عن أمير المؤمنين عمر بن الخطاب وابن مسعود وابن عباس وأبي هريرة وعبدالله بن عمرو وجابر وأبي سعيد من الصحابة وعن أبي مجلز والشعبي وغيرهما من التابعين وعن عبدالرحمن بن زيد بن أسلم وإسحاق بن راهويه وغيرهما من الأئمة في أقوال غريبة وورد حديث غريب في معجم الطبراني الكبير عن أبي أمامة صدي بن عجلان الباهلي ولكن سنده ضعيف والله أعلم. وقال قتادة: الله أعلم بثنياه; وقال السدي هي منسوخة بقوله \"خالدين فيها أبدا\"."
    },
    {
      "ayah": 108,
      "surah": 11,
      "text": "يقول تعالى \"وأما الذين سعدوا\" وهم أتباع الرسل \"ففي الجنة\" أي فمأواهم الجنة \"خالدين فيها\" أي ماكثين فيها أبدا \"ما دامت السموات والأرض إلا ما شاء ربك\" معنى الاسثتناء ههنا أن دوامهم فيما هم فيه من النعيم ليس أمرا واجبا بذاته بل هو موكول إلى مشيئة الله تعالى فله المنة عليهم دائما ولهذا يلهمون التسبيح والتحميد كما يلهمون النفس. وقال الضحاك والحسن البصري: هي في حق عصاة الموحدين الذين كانوا في النار ثم أخرجوا منها وعقب ذلك بقوله \"عطاء غير مجذوذ\" أي مقطوع قاله مجاهد وابن عباس وأبو العالية وغير واحد لئلا يتوهم بعد ذكره المشيئة أن ثم انقطاع أو لبس أو شيء بل حتم له بالدوام وعدم الانقطاع كما بين هناك أن عذاب أهل النار في النار دائما مردود إلى مشيئة وأنه بعدله وحكمته عذبهم ولهذا قال \"إن ربك فعال لما يريد\" كما قال \"لا يسئل عما يفعل وهم يسئلون\" وهنا طيب القلوب وثبت المقصود \"بقوله عطاء غير مجذوذ\" وقد جاء في الصحيحين \"يؤتى بالموت في صورة كبش أملح فيذبح بين الجنة والنار ثم يقال يا أهل الجنة خلود فلا موت ويا أهل النار خلود فلا موت\" وفي الصحيح أيضا \"فيقال يا أهل الجنة إن لكم أن تعيشوا فلا تموتوا أبدا وإن لكم أن تشبوا فلا تهرموا أبدا وإن لكم أن تصحوا فلا تسقموا أبدا وإن لكم أن تنعموا فلا تبأسوا أبدا\"."
    },
    {
      "ayah": 109,
      "surah": 11,
      "text": "يقول تعالى \"فلا تك في مرية مما يعبد هؤلاء المشركون\" إنه باطل وجهل وضلال فإنهم إنما يعبدون ما يعبد آباؤهم من قبل أي ليس لهم مستند فيما هم فيه إلا اتباع الآباء في الجهالات وسيجزيهم الله على ذلك أتم الجزاء فيعذبهم عذابا لا يعذبه احدا وإن كان لهم حسنات فقد وفاهم الله إياها في الدنيا قبل الآخرة قال سفيان الثوري عن جابر الجعفي عن مجاهد عن ابن عباس \"وإنا لموفوهم نصيبهم غير منقوص\" قال ما وعدوا من خير أو شر. وقال عبدالرحمن بن زيد بن أسلم: لموفوهم من العذاب نصيبهم غير منقوص."
    },
    {
      "ayah": 11,
      "surah": 11,
      "text": "قال الله تعالى \"إلا الذين صبروا\" أي على الشدائد والمكاره \"وعملوا الصالحات\" أي في الرخاء والعافية \"أولئك لهم مغفرة\" أي بما يصيبهم من الضراء \"وأجر كبير\" بما أسلفوه في زمن الرخاء كما جاء في الحديث \"والذي نفسي بيده لا يصيب المؤمن هم ولا غم ولا نصب ولا وصب ولا حزن حتى الشوكة يشاكها إلا كفر الله عنه بها من خطاياه\" وفي الصحيحين \"والذي نفسي بيده لا يقضي الله للمؤمن قضاء إلا كان خيرا له: إن أصابته سراء فشكر كان خيرا له وإن أصابته ضراء فصبر كان خيرا له وليس ذلك لأحد غير المؤمن\" ولهذا قال الله تعالى \"والعصر إن الأنسان لفي خسر إلا الذين آمنوا وعملوا الصالحات وتواصوا بالحق وتواصوا بالصبر\" وقال تعالى \"إن الإنسان خلق هلوعا\" الآيات."
    },
    {
      "ayah": 110,
      "surah": 11,
      "text": "ثم ذكر تعالى أنه آتى موسى الكتاب فاختلف الناس فيه فمن مؤمن به ومن كافر به ; فلك بمن سلف من الأنبياء قبلك يا محمد أسوة فلا يغيظنك تكذيبهم لك ولا يهمنك ذلك \"ولولا كلمة سبقت من ربك لقضى بينهم\" قال ابن جرير: لولا ما تقدم من تأجيله العذاب إلى أجل معلوم لقضى الله بينهم ويحتمل أن يكون المراد بالكلمة أنه لا يعذب أحدا إلا بعد قيام الحجة عليه وإرسال الرسول إليه كما قال \"وما كنا معذبين حتى نبعث رسولا\" فإنه قد قال في الآية الأخرى \"ولولا كلمة سبقت من ربك لكان لزاما وأجل مسمى فاصبر على ما يقولون\" ثم أخبر تعالى أنه سيجمع الأولين والآخرين من الأمم ويجزيهم بأعمالهم إن خيرا فخير وإن شرا فشر."
    },
    {
      "ayah": 111,
      "surah": 11,
      "text": "فقال \"وإن كلا لما ليوفينهم ربك أعمالهم إنه بما يعملون خبير\" أي عليم بأعمالهم جميعا جليلها وحقيرها صغيرها وكبيرها وفي هذه الآية قراءات كثيرة يرجع معناها إلى هذا الذي ذكرناه كما في قوله تعالى \"وإن كل لما جميع لدينا محضرون\"."
    },
    {
      "ayah": 112,
      "surah": 11,
      "text": "يأمر تعالى رسوله وعباده المؤمنين بالثبات والدوام على الاستقامة وذلك من أكبر العون على النصر على الأعداء ومخالفة الأضداد ونهى عن الطغيان وهو البغي إنه مصرعة حتى ولو كان على مشرك وأعلم تعالى أنه بصير بأعمال العباد فلا يغفل عن شيء ولا يخفي عليه شيء."
    },
    {
      "ayah": 113,
      "surah": 11,
      "text": "وقوله \"ولا تركنوا إلى الذين ظلموا\" قال علي بن أبي طلحة عن ابن عباس: لا تداهنوا وقال العوفي عن ابن عباس: هو الركون إلى الشرك. وقال أبو العالية لا ترضوا بأعمالهم وقال ابن جرير عن ابن عباس: ولا تميلوا إلى الذين ظلموا وهذا القول حسن أي لا تستعينوا بالظلمة فتكونوا كأنكم قد رضيتم بأعمالهم \"فتمسكم النار وما لكم من دون الله من أولياء ثم لا تنصرون\" أي ليس لكم من دونه من ولي ينقذكم ولا ناصر يخلصكم من عذابه."
    },
    {
      "ayah": 114,
      "surah": 11,
      "text": "قال علي بن أبي طلحة عن ابن عباس \"وأقم الصلاة طرفي النهار\" قال يعني الصبح والمغرب وكذا قال الحسن وعبدالرحمن بن زيد بن أسلم وقال الحسن في رواية وقتادة والضحاك وغيرهم هي الصبح والعصر وقال مجاهد: هي الصبح في أول النهار والظهر والعصر مرة أخرى \"وزلفا من الليل\" قال ابن عباس ومجاهد والحسن وغيرهم: يعني صلاة العشاء وقال الحسن في رواية ابن المبارك عن مبارك بن فضالة عنه \"وزلفا من الليل\" يعني المغرب والعشاء. قال رسول الله صلي الله عليه وسلم \"هما زلفا الليل المغرب والعشاء\" وكذا قال مجاهد ومحمد بن كعب وقتادة والضحاك إنها صلاة المغرب والعشاء وقد يحتمل أن تكون هذه الآية نزلت قبل فرض الصلوات الخمس ليلة الإسراء فإنه إنما كان يجب من الصلاة صلاتان. صلاة قبل طلوع الشمس وصلاة قبل غروبها وفي أثناء الليل قام عليه وعلي الأمة ثم نسخ في حق الأمة وثبت وجوبه عليه ثم نسخ عنه أيضا في قول والله أعلم. وقوله \"إن الحسنات يذهبن السيئات\" يقول إن فعل الخيرات يكفر الذنوب السالفة كما جاء في الحديث الذي رواه الإمام أحمد وأهل السنن عن أمير المؤمنين علي بن أبي طالب قال: كنت إذا سمعت من رسول الله حديثا نفعني الله بما شاء أن ينفعني منه وإذا حدثني عنه أحد استحلفته فإذا حلف لي صدقته وحدثني أبو بكر وصدق أبو بكر أنه سمع رسول الله صلي الله عليه وسلم يقول \"ما من مسلم يذنب ذنبا فيتوضأ ويصلي ركعتين إلا غفر له\" وفي الصحيحين عن أمير المؤمنين عثمان بن عفان أنه توضأ لهم كوضوء رسول الله صلي الله عليه وسلم ثم قال: هكذا رأيت رسول الله صلي الله عليه وسلم يتوضأ وقال \"من توضأ وضوئي هذا ثم صلى ركعتين لا يحدث فيهما نفسه غفر له ما تقدم من ذنبه\" وروى الإمام أحمد وأبو جعفر بن جرير من حديث أبي عقيل زهرة بن معبد أنه سمع الحارث مولى عثمان يقول: جلس عثمان يوما وجلسنا معه فجاءه المؤذن فدعا عثمان بماء في إناء أظنة سيكون فيه قدر مد فتوضأ ثم قال: رأيت رسول الله صلي الله عليه وسلم يتوضأ وضوئي هذا ثم قال \"من توضأ وضوئي هذا ثم قام فصلى صلاة الظهر غفر له ما بينه وبين صلاة الصبح ثم صلى العصر غفر له ما بينه وبين صلاة الظهر ثم صلى المغرب غفر له ما بينه وبين صلاة العصر ثم صلى العشاء غفر له ما بينه وبين صلاة المغرب ثم لعله يبيت يتمرغ ليلته ثم إن قام فتوضأ وصلى الصبح غفر له ما بينها وبين صلاة العشاء وهن الحسنات يذهبن السيئات \"وفي الصحيح عن أبي هريرة عن رسول الله صلي الله عليه وسلم أنه قال \"أرأيتم لو أن بباب أحدكم نهرا غمرا يغتسل فيه كل يوم خمس مرات هل يبقى من درنه شيئا؟ \"قالوا: لا يا رسول الله قال \"كذلك الصلوات الخمس يمحو الله بهن الذنوب والخطايا\" وقال مسلم في صحيحه: حدثنا أبو الطاهر وهو ابن سعيد قالا حدثنا ابن وهب عن أبي صخر أن عمر بن إسحاق مولى زائدة حدثنه عن أبيه عن أبي هريرة أن رسول الله صلي الله عليه وسلم كان يقول \"الصلوات الخمس والجمعة إلى الجمعة ورمضان إلى رمضان مكفرات لما بينهن ما اجتنبت الكبائر\" وقال الإمام أحمد: حدثنا الحكم بن نافع حدثنا إسماعيل بن عباس عن ضمضم بن زرعة عن \"شريح بن عبيد أن أبا رهم السمعي كان يحدث أن أبا أيوب الأنصاري حدثه أن رسول الله صلي الله عليه وسلم كان يقول \"إن كل صلاة تحط ما بين يديها من خطيئة\" وقال أبو جعفر بن جرير: حدثنا محمد بن إسماعيل حدثنا أبي عن ضمضم بن زرعة عن شريح بن عبيد عن أبي مالك الأشعري قال: قال رسول الله صلي الله عليه وسلم \"جعلت الصلوات كفارات لما بينهن فإن الله قال \"إن الحسنات يذهبن السيئات\". وقال البخاري: حدثنا قتيبة بن سعيد حدثنا يزيد بن زريع عن سليمان التيمي عن أبي عثمان النهدي عن ابن مسعود أن رجلا أصاب من امرأة قبلة فأتى النبي صلي الله عليه وسلم فأخبره فأنزل الله \"وأقم الصلاة طرفي النهار وزلفا من الليل إن الحسنات يذهبن السيئات\" فقال الرجلا: يا رسول الله ألي هذا؟ قال \"لجميع أمتي كلهم\" هكذا رواه في كتاب الصلاة وأخرجه في التفسير عن مسدد عن يزيد بن زريع بنحوه ورواه مسلم وأحمد وأهل السنن إلا أبا داود من طرق عن أبي عثمان النهدي واسمه عبدالرحمن بن مل به. ورواه الإمام أحمد ومسلم والترمذي والنسائي وابن جرير وهذا لفظه من طرق عن سماك بن حرب أنه سمع إبراهيم بن يزيد يحدث عن علقمة والأسود عن ابن مسعود قال: جاء رجل إلى رسول الله صلي الله عليه وسلم فقال: يا رسول الله إني وجدت امرأة في بستان ففعلت بها كل شيء غير أني لم أجامعها قبلتها ولزمتها ولم أفعل غير ذلك فافعل بي ما شئت فلم يقل رسول الله صلي الله عليه وسلم شيئا فذهب الرجل. فقال عمر لقد ستر الله عليه لو ستر على نفسه فأتبعه رسول الله بصره ثم قال \"ردوه علي\" فردوه عليه فقرأ عليه \"أقم الصلاة طرفي النهار وزلفا من الليل إن الحسنات يذهبن السيئات ذلك ذكرى للذاكرين\" فقال معاذ: وفي رواية عمر: يا رسول الله أله وحده أم للناس كافة؟ قال \"بل للناس كافة\" وقال الإمام أحمد: حدثنا محمد بن عبيد حدثنا أبان بن إسحق عن الصباح بن محمد عن مرة الهمذاني عن عبدالله بن مسعود قال: قال رسول الله صلي الله عليه وسلم \"إن الله قسم بينكم أخلاقكم كما قسم بينكم أرزاقكم وإن الله يعطي الدنيا من يحب ولا يحب ولا يعطي الدين إلا من أحب فمن أعطاه الله الدين فقد أحبه والذي نفسي بيده لا يسلم عبد حتى يسلم قلبه ولسانه ولا يؤمن حتى يأمن جاره بوائقه\" قال قلنا: وما بوائقه يا نبي الله؟ قال \"غشه وظلمه ولا يكسب عبد مالا حراما فينفق منه فيبارك له فيه ولا يتصدق فيقبل منه ولا يتركه خلف ظهره إلا كان زاده إلي النار إن الله لا يمحو السيء بالسيء ولكن يمحو السيء بالحسن إن الخبيث لا يمحو الخبيث\" وقال ابن جرير: حدثنا أبو السائب حدثنا أبو معاوية عن الأعمش عن إبراهيم قال: كان فلان ابن معتب رجلا من الأنصار فقال: يا رسول الله دخلت علي امرأة فنلت منها ما ينال الرجل من أهله إلا أني لم أواقعها فلم يدر رسول الله ما يجيبه حتى نزلت هذه الآية \"وأقم الصلاة طرفي النهار وزلفا من الليل إن الحسنات يذهبن السيئات ذلك ذكرى للذاكرين\" فدعاه رسول الله فقرأها عليه. وعن ابن عباس أنه عمرو بن غزية الأنصاري التمار وقال مقاتل هو أبو نفيل عامر بن قيس الأنصاري وذكر الخطيب البغدادي أنه أبو اليسر كعب بن عمرو وقال الإمام أحمد: حدثنا يونس وعفان قالا: حدثنا حماد يعني ابن سلمة عن علي بن زيد قال عفان: أنبأنا علي بن زيد عن يوسف بن مهران عن ابن عباس أن رجلا أتى عمر فقال: إن امرأة جاءت تبايعه فأدخلتها الدولج فأصبت منها ما دون الجماع فقال ويحك لعلها مغيبة في سبيل الله؟ قال أجل قال فائت أبا بكر فسله. قال فأتاه فسأله فقال لعلها مغيبة في سبيل الله ؟ فقال مثل قول عمر. ثم أتي النبي صلي الله عليه وسلم فقال له مثل ذلك قال \"فلعلها مغيبة في سبيل الله\" ونزل القرآن \"وأقم الصلاة طرفي النهار وزلفا من الليل إن الحسنات يذهبن السيئات\" إلى آخر الأية: فقال يا رسول الله لي خاصة أم للناس عامة؟ فضرب يعني عمر صدره بيده وقال لا ولا نعمة عين بل للناس عامة فقال رسول الله \"صدق عمر\" وروى الإمام أبو جعفر بن جرير من حديث قيس بن الربيع عن عثمان بن موهب عن موسى بن طلحة عن أبي اليسر كعب بن عمرو الأنصاري قال: أتتني امرأة تبتاع مني بدرهم تمرا فقلت إن في البيت تمرا أجود من هذا فدخلت فأهويت إليها فقبلتها فأتيت عمر فسألتة فقال اتق الله واستر على نفسك ولا تخبرن أحدا فلم أصبر حتى أتيت أبا بكر فسألته فقال اتق الله واستر على نفسك ولا تخبرن أحدا قال فلم أصبر حتى أتيت النبي صلي الله عليه وسلم فأخبرته فقال \"أخلفت رجلا غازيا في سبيل الله في أهله بمثل هذا؟\" حتي ظننت أني من أهل النار حتى تمنيت اني أسلمت ساعتئذ فأطرق رسول الله ساعة فنزل جبريل فقال أبو اليسر فجئت فقرأ علي رسول الله \"وأقم الصلاة طرفي النهار وزلفا من الليل إن الحسنات يذهبن السيئات ذلك ذكرى للذاكرين\" فقال إنسان: يا رسول الله له خاصة أم للناس عامة؟ قال \"للناس عامة\" وقال الحافظ أبو الحسن الدار قطني: حدثنا الحسين بن سهل المحاملي حدثنا يوسف بن موسى حدثنا جرير عن عبدالملك بن عمير عن عبدالرحمن بن أبي ليلى عن معاذ بن جبل انه كان قاعدا عند النبي صلي الله عليه وسلم فجاء رجل فقال: يا رسول الله ما تقول في رجل أصاب من امرأة لا تحل له فلم يدع شيئا يصيبه الرجل من امرأته إلا قد أصابه منها غير أنه لم يجامعها؟ فقال له النبي صلي الله عليه وسلم \"توضأ وضوءا حسنا ثم قم فصل\" فأنزل الله عز وجل هذه الآية يعنى قوله \"وأقم الصلاة طرفي النهار\" فقال معاذ أهي له خاصة أم للمسلمين عامة ؟ قال \"بل للمسلمين عامة\" ورواه ابن جرير من طرق عن عبدالملك بن عمير به. وقال عبدالرزاق: حدثنا محمد بن مسلم عن عمرو بن دينار عن يحيى بن جعدة أن رجلا من أصحاب النبي صلي الله عليه وسلم ذكر امرأة وهو جالس مع رسول الله فاستأذنه لحاجة فأذن له فذهب يطلبها فلم يجدها فأقبل الرجل يريد أن يبشر النبي صلي الله عليه وسلم بالمطر فوجد المرأة جالسة على غدير فدفع في صدرها وجلس بين رجليها فصار ذكره مثل الهدبة فقام نادما حتى أتى النبي صلي الله عليه وسلم فأخبره بما صنع فقال له \"استغفر ربك وصل أربع ركعات\" قال وتلا عليه \"وأقم الصلاة طرفي النهار وزلفا من الليل\" الآية وقال ابن جرير: حدثني عبدالله بن أحمد بن سيبويه حدثنا إسحق بن إبراهيم حدثني عمرو بن الحارث حدثني عبدالله بن سالم عن الزبيدي عن سليم بن عامر أنه سمع أبا أمامة يقول أن رجلا أتي النبي صلي الله عليه وسلم فقال: يا رسول الله أقم في حد الله - مرة أو اثنتين - فأعرض عنه رسول الله ثم أقيمت الصلاة فلما فرغ النبي صلي الله عليه وسلم قال \"أين هذا الرجل القائل أقم في حد الله؟\" قال أنا ذا قال \"أتممت الوضوء وصليت معنا آنفا؟\" قال نعم. قال \"فإنك من خطيتك كيوم ولدتك أمك فلا تعد\" وأنزل الله على رسول الله \"وأقم الصلاة طرفي النهار وزلفا من الليل إن الحسنات يذهبن السيئات ذلك ذكرى للذاكرين وقال الأمام أحمد: حدثنا عفان حدثنا حماد بن سلمة أنبأنا علي بن زيد عن أبي عثمان قال: كنت مع سلمان الفارسي تحت شجرة فأخذ منها غصنا يابسا فهزه حتى تحات ورقة ثم قال: يا أبا عثمان ألا تسألني لم أفعل هذا؟ قلت ولم تفعله؟ قال هكذا فعل رسول الله صلي الله فقال \"إن المسلم إذا توضأ فأحسن الوضوء ثم صلى الصلوات الخمس تحاتت خطاياه كما يتحات هذا الورق\" وقال \"وأقم الصلاة طرفي النهار وزلفا من الليل أن الحسنات يذهبن السيئات ذلك ذكرى للذاكرين\" وقال الإمام أحمد: حدثنا وكيع ثنا سفيان عن حبيب بن أبي ثابت عن ميمون بن أبي شبيب عن معاذ أن رسول الله صلي الله عليه وسلم قال له \"يا معاذ أتبع السيئة الحسنة تمحها وخالق الناس بخلق حسن\" وقال الإمام أحمد: حدثنا وكيع ثنا سفيان عن حبيب عن ميمون بن أبي شبيب عن أبي ذر أن رسول الله صلي الله عليه وسلم قال \"اتق الله حيثما كنت وأتبع السيئة الحسنة تمحها وخالق الناس بخلق حسن\" وقال أحمد: حدثنا أبو معاوية حدثنا الأعمش عن شمر بن عطية عن أشياخه عن أبي ذر قال: قلت يا رسول الله أوصني; قال \"إذا عملت سيئة فأتبعها بحسنة تمحها\" قال قلت يا رسول الله أمن الحسنات لا إله إلا الله؟ قال \"هي أفضل الحسنات\" وقال الحافظ أبو يعلى الموصلي: حدثنا هذيل بن إبراهيم الجماني حدثنا عثمان بن عبدالرحمن الزهري عن ولد سعد بن أبي وقاص عن الزهري عن أنس بن مالك قال: قال رسول الله صلي الله عليه وسلم \"ما قال عبد لا إله إلا الله في ساعة من ليل أو نهار إلا طلست ما في الصحيفة من السيئات حتى تسكن إلى مثلها من الحسنات\" عثمان بن عبدالرحمن يقال له الوقاصي فيه ضعف. وقال الحافظ أبو بكر البزار: حدثنا بشر بن آدم وزيد بن أخرم قالا: حدثنا الضحاك بن مخلد حدثنا مستور بن عباد عن ثابت عن أنس أن رجلا قال: يا رسول الله ما تركت من حاجة ولا داجة فقال رسول الله صلي الله عليه وسلم \"تشهد أن لا إله إلا الله وأني رسول الله؟\" قال بلى قال \"فإن هذا يأتي على ذلك\" تفرد به من هذا الوجه مستور."
    },
    {
      "ayah": 115,
      "surah": 11,
      "text": "قال علي بن أبي طلحة عن ابن عباس \"وأقم الصلاة طرفي النهار\" قال يعني الصبح والمغرب وكذا قال الحسن وعبدالرحمن بن زيد بن أسلم وقال الحسن في رواية وقتادة والضحاك وغيرهم هي الصبح والعصر وقال مجاهد: هي الصبح في أول النهار والظهر والعصر مرة أخرى \"وزلفا من الليل\" قال ابن عباس ومجاهد والحسن وغيرهم: يعني صلاة العشاء وقال الحسن في رواية ابن المبارك عن مبارك بن فضالة عنه \"وزلفا من الليل\" يعني المغرب والعشاء. قال رسول الله صلي الله عليه وسلم \"هما زلفا الليل المغرب والعشاء\" وكذا قال مجاهد ومحمد بن كعب وقتادة والضحاك إنها صلاة المغرب والعشاء وقد يحتمل أن تكون هذه الآية نزلت قبل فرض الصلوات الخمس ليلة الإسراء فإنه إنما كان يجب من الصلاة صلاتان. صلاة قبل طلوع الشمس وصلاة قبل غروبها وفي أثناء الليل قام عليه وعلي الأمة ثم نسخ في حق الأمة وثبت وجوبه عليه ثم نسخ عنه أيضا في قول والله أعلم. وقوله \"إن الحسنات يذهبن السيئات\" يقول إن فعل الخيرات يكفر الذنوب السالفة كما جاء في الحديث الذي رواه الإمام أحمد وأهل السنن عن أمير المؤمنين علي بن أبي طالب قال: كنت إذا سمعت من رسول الله حديثا نفعني الله بما شاء أن ينفعني منه وإذا حدثني عنه أحد استحلفته فإذا حلف لي صدقته وحدثني أبو بكر وصدق أبو بكر أنه سمع رسول الله صلي الله عليه وسلم يقول \"ما من مسلم يذنب ذنبا فيتوضأ ويصلي ركعتين إلا غفر له\" وفي الصحيحين عن أمير المؤمنين عثمان بن عفان أنه توضأ لهم كوضوء رسول الله صلي الله عليه وسلم ثم قال: هكذا رأيت رسول الله صلي الله عليه وسلم يتوضأ وقال \"من توضأ وضوئي هذا ثم صلى ركعتين لا يحدث فيهما نفسه غفر له ما تقدم من ذنبه\" وروى الإمام أحمد وأبو جعفر بن جرير من حديث أبي عقيل زهرة بن معبد أنه سمع الحارث مولى عثمان يقول: جلس عثمان يوما وجلسنا معه فجاءه المؤذن فدعا عثمان بماء في إناء أظنة سيكون فيه قدر مد فتوضأ ثم قال: رأيت رسول الله صلي الله عليه وسلم يتوضأ وضوئي هذا ثم قال \"من توضأ وضوئي هذا ثم قام فصلى صلاة الظهر غفر له ما بينه وبين صلاة الصبح ثم صلى العصر غفر له ما بينه وبين صلاة الظهر ثم صلى المغرب غفر له ما بينه وبين صلاة العصر ثم صلى العشاء غفر له ما بينه وبين صلاة المغرب ثم لعله يبيت يتمرغ ليلته ثم إن قام فتوضأ وصلى الصبح غفر له ما بينها وبين صلاة العشاء وهن الحسنات يذهبن السيئات \"وفي الصحيح عن أبي هريرة عن رسول الله صلي الله عليه وسلم أنه قال \"أرأيتم لو أن بباب أحدكم نهرا غمرا يغتسل فيه كل يوم خمس مرات هل يبقى من درنه شيئا؟ \"قالوا: لا يا رسول الله قال \"كذلك الصلوات الخمس يمحو الله بهن الذنوب والخطايا\" وقال مسلم في صحيحه: حدثنا أبو الطاهر وهو ابن سعيد قالا حدثنا ابن وهب عن أبي صخر أن عمر بن إسحاق مولى زائدة حدثنه عن أبيه عن أبي هريرة أن رسول الله صلي الله عليه وسلم كان يقول \"الصلوات الخمس والجمعة إلى الجمعة ورمضان إلى رمضان مكفرات لما بينهن ما اجتنبت الكبائر\" وقال الإمام أحمد: حدثنا الحكم بن نافع حدثنا إسماعيل بن عباس عن ضمضم بن زرعة عن \"شريح بن عبيد أن أبا رهم السمعي كان يحدث أن أبا أيوب الأنصاري حدثه أن رسول الله صلي الله عليه وسلم كان يقول \"إن كل صلاة تحط ما بين يديها من خطيئة\" وقال أبو جعفر بن جرير: حدثنا محمد بن إسماعيل حدثنا أبي عن ضمضم بن زرعة عن شريح بن عبيد عن أبي مالك الأشعري قال: قال رسول الله صلي الله عليه وسلم \"جعلت الصلوات كفارات لما بينهن فإن الله قال \"إن الحسنات يذهبن السيئات\". وقال البخاري: حدثنا قتيبة بن سعيد حدثنا يزيد بن زريع عن سليمان التيمي عن أبي عثمان النهدي عن ابن مسعود أن رجلا أصاب من امرأة قبلة فأتى النبي صلي الله عليه وسلم فأخبره فأنزل الله \"وأقم الصلاة طرفي النهار وزلفا من الليل إن الحسنات يذهبن السيئات\" فقال الرجلا: يا رسول الله ألي هذا؟ قال \"لجميع أمتي كلهم\" هكذا رواه في كتاب الصلاة وأخرجه في التفسير عن مسدد عن يزيد بن زريع بنحوه ورواه مسلم وأحمد وأهل السنن إلا أبا داود من طرق عن أبي عثمان النهدي واسمه عبدالرحمن بن مل به. ورواه الإمام أحمد ومسلم والترمذي والنسائي وابن جرير وهذا لفظه من طرق عن سماك بن حرب أنه سمع إبراهيم بن يزيد يحدث عن علقمة والأسود عن ابن مسعود قال: جاء رجل إلى رسول الله صلي الله عليه وسلم فقال: يا رسول الله إني وجدت امرأة في بستان ففعلت بها كل شيء غير أني لم أجامعها قبلتها ولزمتها ولم أفعل غير ذلك فافعل بي ما شئت فلم يقل رسول الله صلي الله عليه وسلم شيئا فذهب الرجل. فقال عمر لقد ستر الله عليه لو ستر على نفسه فأتبعه رسول الله بصره ثم قال \"ردوه علي\" فردوه عليه فقرأ عليه \"أقم الصلاة طرفي النهار وزلفا من الليل إن الحسنات يذهبن السيئات ذلك ذكرى للذاكرين\" فقال معاذ: وفي رواية عمر: يا رسول الله أله وحده أم للناس كافة؟ قال \"بل للناس كافة\" وقال الإمام أحمد: حدثنا محمد بن عبيد حدثنا أبان بن إسحق عن الصباح بن محمد عن مرة الهمذاني عن عبدالله بن مسعود قال: قال رسول الله صلي الله عليه وسلم \"إن الله قسم بينكم أخلاقكم كما قسم بينكم أرزاقكم وإن الله يعطي الدنيا من يحب ولا يحب ولا يعطي الدين إلا من أحب فمن أعطاه الله الدين فقد أحبه والذي نفسي بيده لا يسلم عبد حتى يسلم قلبه ولسانه ولا يؤمن حتى يأمن جاره بوائقه\" قال قلنا: وما بوائقه يا نبي الله؟ قال \"غشه وظلمه ولا يكسب عبد مالا حراما فينفق منه فيبارك له فيه ولا يتصدق فيقبل منه ولا يتركه خلف ظهره إلا كان زاده إلي النار إن الله لا يمحو السيء بالسيء ولكن يمحو السيء بالحسن إن الخبيث لا يمحو الخبيث\" وقال ابن جرير: حدثنا أبو السائب حدثنا أبو معاوية عن الأعمش عن إبراهيم قال: كان فلان ابن معتب رجلا من الأنصار فقال: يا رسول الله دخلت علي امرأة فنلت منها ما ينال الرجل من أهله إلا أني لم أواقعها فلم يدر رسول الله ما يجيبه حتى نزلت هذه الآية \"وأقم الصلاة طرفي النهار وزلفا من الليل إن الحسنات يذهبن السيئات ذلك ذكرى للذاكرين\" فدعاه رسول الله فقرأها عليه. وعن ابن عباس أنه عمرو بن غزية الأنصاري التمار وقال مقاتل هو أبو نفيل عامر بن قيس الأنصاري وذكر الخطيب البغدادي أنه أبو اليسر كعب بن عمرو وقال الإمام أحمد: حدثنا يونس وعفان قالا: حدثنا حماد يعني ابن سلمة عن علي بن زيد قال عفان: أنبأنا علي بن زيد عن يوسف بن مهران عن ابن عباس أن رجلا أتى عمر فقال: إن امرأة جاءت تبايعه فأدخلتها الدولج فأصبت منها ما دون الجماع فقال ويحك لعلها مغيبة في سبيل الله؟ قال أجل قال فائت أبا بكر فسله. قال فأتاه فسأله فقال لعلها مغيبة في سبيل الله ؟ فقال مثل قول عمر. ثم أتي النبي صلي الله عليه وسلم فقال له مثل ذلك قال \"فلعلها مغيبة في سبيل الله\" ونزل القرآن \"وأقم الصلاة طرفي النهار وزلفا من الليل إن الحسنات يذهبن السيئات\" إلى آخر الأية: فقال يا رسول الله لي خاصة أم للناس عامة؟ فضرب يعني عمر صدره بيده وقال لا ولا نعمة عين بل للناس عامة فقال رسول الله \"صدق عمر\" وروى الإمام أبو جعفر بن جرير من حديث قيس بن الربيع عن عثمان بن موهب عن موسى بن طلحة عن أبي اليسر كعب بن عمرو الأنصاري قال: أتتني امرأة تبتاع مني بدرهم تمرا فقلت إن في البيت تمرا أجود من هذا فدخلت فأهويت إليها فقبلتها فأتيت عمر فسألتة فقال اتق الله واستر على نفسك ولا تخبرن أحدا فلم أصبر حتى أتيت أبا بكر فسألته فقال اتق الله واستر على نفسك ولا تخبرن أحدا قال فلم أصبر حتى أتيت النبي صلي الله عليه وسلم فأخبرته فقال \"أخلفت رجلا غازيا في سبيل الله في أهله بمثل هذا؟\" حتي ظننت أني من أهل النار حتى تمنيت اني أسلمت ساعتئذ فأطرق رسول الله ساعة فنزل جبريل فقال أبو اليسر فجئت فقرأ علي رسول الله \"وأقم الصلاة طرفي النهار وزلفا من الليل إن الحسنات يذهبن السيئات ذلك ذكرى للذاكرين\" فقال إنسان: يا رسول الله له خاصة أم للناس عامة؟ قال \"للناس عامة\" وقال الحافظ أبو الحسن الدار قطني: حدثنا الحسين بن سهل المحاملي حدثنا يوسف بن موسى حدثنا جرير عن عبدالملك بن عمير عن عبدالرحمن بن أبي ليلى عن معاذ بن جبل انه كان قاعدا عند النبي صلي الله عليه وسلم فجاء رجل فقال: يا رسول الله ما تقول في رجل أصاب من امرأة لا تحل له فلم يدع شيئا يصيبه الرجل من امرأته إلا قد أصابه منها غير أنه لم يجامعها؟ فقال له النبي صلي الله عليه وسلم \"توضأ وضوءا حسنا ثم قم فصل\" فأنزل الله عز وجل هذه الآية يعنى قوله \"وأقم الصلاة طرفي النهار\" فقال معاذ أهي له خاصة أم للمسلمين عامة ؟ قال \"بل للمسلمين عامة\" ورواه ابن جرير من طرق عن عبدالملك بن عمير به. وقال عبدالرزاق: حدثنا محمد بن مسلم عن عمرو بن دينار عن يحيى بن جعدة أن رجلا من أصحاب النبي صلي الله عليه وسلم ذكر امرأة وهو جالس مع رسول الله فاستأذنه لحاجة فأذن له فذهب يطلبها فلم يجدها فأقبل الرجل يريد أن يبشر النبي صلي الله عليه وسلم بالمطر فوجد المرأة جالسة على غدير فدفع في صدرها وجلس بين رجليها فصار ذكره مثل الهدبة فقام نادما حتى أتى النبي صلي الله عليه وسلم فأخبره بما صنع فقال له \"استغفر ربك وصل أربع ركعات\" قال وتلا عليه \"وأقم الصلاة طرفي النهار وزلفا من الليل\" الآية وقال ابن جرير: حدثني عبدالله بن أحمد بن سيبويه حدثنا إسحق بن إبراهيم حدثني عمرو بن الحارث حدثني عبدالله بن سالم عن الزبيدي عن سليم بن عامر أنه سمع أبا أمامة يقول أن رجلا أتي النبي صلي الله عليه وسلم فقال: يا رسول الله أقم في حد الله - مرة أو اثنتين - فأعرض عنه رسول الله ثم أقيمت الصلاة فلما فرغ النبي صلي الله عليه وسلم قال \"أين هذا الرجل القائل أقم في حد الله؟\" قال أنا ذا قال \"أتممت الوضوء وصليت معنا آنفا؟\" قال نعم. قال \"فإنك من خطيتك كيوم ولدتك أمك فلا تعد\" وأنزل الله على رسول الله \"وأقم الصلاة طرفي النهار وزلفا من الليل إن الحسنات يذهبن السيئات ذلك ذكرى للذاكرين وقال الأمام أحمد: حدثنا عفان حدثنا حماد بن سلمة أنبأنا علي بن زيد عن أبي عثمان قال: كنت مع سلمان الفارسي تحت شجرة فأخذ منها غصنا يابسا فهزه حتى تحات ورقة ثم قال: يا أبا عثمان ألا تسألني لم أفعل هذا؟ قلت ولم تفعله؟ قال هكذا فعل رسول الله صلي الله فقال \"إن المسلم إذا توضأ فأحسن الوضوء ثم صلى الصلوات الخمس تحاتت خطاياه كما يتحات هذا الورق\" وقال \"وأقم الصلاة طرفي النهار وزلفا من الليل أن الحسنات يذهبن السيئات ذلك ذكرى للذاكرين\" وقال الإمام أحمد: حدثنا وكيع ثنا سفيان عن حبيب بن أبي ثابت عن ميمون بن أبي شبيب عن معاذ أن رسول الله صلي الله عليه وسلم قال له \"يا معاذ أتبع السيئة الحسنة تمحها وخالق الناس بخلق حسن\" وقال الإمام أحمد: حدثنا وكيع ثنا سفيان عن حبيب عن ميمون بن أبي شبيب عن أبي ذر أن رسول الله صلي الله عليه وسلم قال \"اتق الله حيثما كنت وأتبع السيئة الحسنة تمحها وخالق الناس بخلق حسن\" وقال أحمد: حدثنا أبو معاوية حدثنا الأعمش عن شمر بن عطية عن أشياخه عن أبي ذر قال: قلت يا رسول الله أوصني; قال \"إذا عملت سيئة فأتبعها بحسنة تمحها\" قال قلت يا رسول الله أمن الحسنات لا إله إلا الله؟ قال \"هي أفضل الحسنات\" وقال الحافظ أبو يعلى الموصلي: حدثنا هذيل بن إبراهيم الجماني حدثنا عثمان بن عبدالرحمن الزهري عن ولد سعد بن أبي وقاص عن الزهري عن أنس بن مالك قال: قال رسول الله صلي الله عليه وسلم \"ما قال عبد لا إله إلا الله في ساعة من ليل أو نهار إلا طلست ما في الصحيفة من السيئات حتى تسكن إلى مثلها من الحسنات\" عثمان بن عبدالرحمن يقال له الوقاصي فيه ضعف. وقال الحافظ أبو بكر البزار: حدثنا بشر بن آدم وزيد بن أخرم قالا: حدثنا الضحاك بن مخلد حدثنا مستور بن عباد عن ثابت عن أنس أن رجلا قال: يا رسول الله ما تركت من حاجة ولا داجة فقال رسول الله صلي الله عليه وسلم \"تشهد أن لا إله إلا الله وأني رسول الله؟\" قال بلى قال \"فإن هذا يأتي على ذلك\" تفرد به من هذا الوجه مستور."
    },
    {
      "ayah": 116,
      "surah": 11,
      "text": "يقول تعالى فهلا وجد من القرون الماضية بقايا من أهل الخير ينهون عما كان يقع بينهم من الشرور والمنكرات والفساد في الأرض وقوله \"إلا قليلا\" أي قد وجد منهم من هذا الضرب قليل لم يكونوا كثيرا وهم الذين أنجاهم الله عند حلول غضبه وفجأة نقمته ولهذا أمر الله تعالى هذه الأمة الشريفة أن يكون فيها من يأمر بالمعروف وينهى عن المنكر كما قال تعالى \"ولتكن منكم أمة يدعون إلى الخير ويأمرون بالمعروف وينهون عن المنكر وأولئك هم المفلحون\" وفي الحديث \"إن الناس إذا رأوا المنكر فلم يغيروه أوشك أن يعمهم الله بعقاب\" ولهذا قال تعالى \"فلولا كان من القرون من قبلكم أولوا بقية ينهون عن الفساد في الأرض إلا قليلا ممن أنجينا منهم\" وقوله \"واتبع الذين ظلموا ما أترفوا فيه\" أي استمروا على ما هم عليه من المعاصي والمنكرات ولم يلتفتوا إلى إنكار أو لئك حتى فجأهم العذاب \"وكانوا مجرمين\"."
    },
    {
      "ayah": 117,
      "surah": 11,
      "text": "ثم أخبر تعالى أنه لم يهلك قرية إلا وهي ظالمة لنفسها ولم يأت قرية مصلحة بأسه وعذابه قط حتى يكونوا هم الظالمين كما قال تعالى \"وما ظلمناهم ولكن ظلموا أنفسهم\" وقال \"وما ربك بظلام العبيد\"."
    },
    {
      "ayah": 118,
      "surah": 11,
      "text": "يخبر تعالى أنه قادر على جعل الناس كلهم أمة واحدة من إيمان أو كفر كما قال تعالى \"ولو شاء ربك لآمن من في الأرض كلهم جميعا\" وقوله \"ولا يزالون مختلفين إلا من رحم ربك\" أي ولا يزال الخلف بين الناس في أديانهم واعتقادات مللهم ونحلهم ومذاهبهم وآرائهم وقال عكرمة: مختلفين في الهدى. وقال الحسن البصري: مختلفين في الرزق يسخر بعضهم بعضا. والمشهور الصحيح الأول."
    },
    {
      "ayah": 119,
      "surah": 11,
      "text": "وقوله \"إلا من رحم ربك\" أي إلا المرحومين من أتباع الرسل الذين تمسكوا بما أمروا به من الذين أخبرتهم به رسل الله إليهم ولم يزل ذلك دأبهم حتى كان النبي وخاتم الرسل والأنبياء فاتبعوه وصدقوه ووازروه ففازوا بسعادة الدنيا والآخرة لأنهم الفرقة الناجية كما جاء في الحديث المروي في المسانيد والسنن من طرق يشد بعضها بعضا \"إن اليهود افترقت على إحدى وسبعين فرقة وأن النصارى افترقت على ثنتين وسبعين فرقة وستفترق هذه الأمة على ثلاث وسبعين فرقة كلها في النار إلا فرقة واحدة\" قالوا: ومن هم يا رسول لله؟ قال \"ما أنا عليه وأصحابي\" رواه الحاكم في مستدركه بهذه الزيادة وقال عطاء \"ولا يزالون مختلفين\" يعني اليهود والنصارى والمجوس \"إلا من رحم ربك\" يعني الحنيفية وقال قتادة: أهل رحمة الله أهل الجماعة وإن تفرقت ديارهم وأبدانهم وأهل معصيته أهل فرقة وإن أجتمعت ديارهم وأبدانهم وقوله \"ولذلك خلقهم\" قال الحسن البصري في رواية عنه وللاختلاف خلقهم وقال مكي بن أبي طلحة عن ابن عباس: خلقهم فريقين كقوله \"فمنهم شقي وسعيد وقيل للرحمة خلقهم قال ابن وهب: أخبرني مسلم بن خالد عن ابن أبي نجيح عن طاوس أن رجلين اختصما إليه فأكثرا فقال طاوس اختلفتما وأكثرتما فقال أحد الرجلين لذلك خلقنا فقال طاوس كذبت فقال أليس الله يقول \"ولا يزالون مختلفين إلا من رحم ربك ولذلك خلقهم\" قال لم يخلقهم ليختلفوا ولكن خلقهم للجماعة والرحمة كما قال الحكم بن أبان عن عكرمة عن ابن عباس قال: للرحمة خلقهم ولم يخلقهم للعذاب وكذا قال مجاهد والضحاك وقتادة ويرجع معني هذا القول إلى قوله تعالى \"وما خلقت الجن والإنس إلا ليعبدون\" وقيل بل المراد وللرحمة والاختلاف خلقهم كما قال الحسن البصري في رواية عنه في قوله \"ولا يزالون مختلفين إلا من رحم ربك ولذلك خلقهم\" قال الناس مختلفون على أديان شتى \"إلا من رحم ربك\" فمن رحم ربك غير مختلف فقيل له لذلك خلقهم قال خلق هؤلاء لجنته وخلق هؤلاء لناره وخلق هؤلاء لعذابه وكذا قال عطاء بن أبي رباح والأعمش وقال ابن وهب سألت مالكا عن قوله تعالى \"ولا يزالون مختلفين إلا من رحم ربك ولذلك خلقهم\" قال فريق في الجنة وفريق في السعير وقد اختار هذا القول ابن جرير وأبو عبيد الفراء وعن مالك فيما روينا عنه من التفسير \"ولذلك خلقهم\" قال للرحمة وقال قوم للاختلاف وقوله \"وتمت كلمة ربك لأملأن جهنم من الجنة والناس أجمعين\" يخبر تعالى أنه قد سبق في قضائه وقدره لعلمه التام وحكمته النافذة أن ممن خلقه من يستحق الجنة ومنهم من يستحق النار وأنه لا بد أن يملأ جهنم من هذين الثقلين الجن والإنس وله الحجة البالغة والحكمة التامة. وفي الصحيحين عن أبي هريرة قال: قال رسول الله صلي الله عليه وسلم \"اختصمت الجنة والنار فقالت الجنة ما لي لا يدخلني إلا ضعفاء الناس وسقطهم وقالت النار أوثرت بالمتكبرين والمتجبرين فقال الله عز وجل للجنة: أنت رحمتي أرحم بك من أشاء وقال للنار أنت عذابي أنتقم بك ممن أشاء ولكل واحدة منكما ملؤها فأما الجنة فلا يزال فيها فضل حتى ينشئ الله لها خلقا يسكن فضل الجنة وأما النار فلا تزال تقول هل من مزيد حتى يضع عليها رب العزة قدمه فتقول قط قط وعزتك\"."
    },
    {
      "ayah": 12,
      "surah": 11,
      "text": "يقول تعالى مسليا لرسوله الله صلي الله عليه وسلم عما كان يتعنت به المشركون فيما كانوا يقولونه عن الرسول كما أخبر تعالى عنهم في قوله \"وقالوا ما لهذا الرسول يأكل الطعام ويمشي في الأسواق لولا أنزل إليه ملك فيكون معه نذيرا أو يلقى إليه كنز أو تكون له جنة يأكل منها وقال الظالمون إن تتبعون إلا رجلا مسحورا \". فأمر الله تعالى رسوله صلوات الله تعالى وسلامه عليه وأرشده إلى أن لا يضيق بذلك منهم صدره ولا يصدنه ذلك ولا يثنينه عن دعائهم إلى الله عز وجل آناء الليل وأطراف النهار كما قال تعالى \"ولقد نعلم أنك يضيق صدرك بما يقولون\" الآية وقال ههنا \"فلعلك تارك بعض ما يوحى إليك وضائق به صدرك أن يقولوا\" أي لقولهم ذلك فإنما أنت نذير ولك أسوة بإخوانك من الرسل قبلك فإنهم كذبوا وأوذوا فصبروا حتى أتاهم نصر الله عز وجل."
    },
    {
      "ayah": 120,
      "surah": 11,
      "text": "يقول تعالى وكل أخبار نقصها عليك من أنباء الرسل المتقدمين من قبلك مع أممهم وكيف جرى لهم من المحاجات والخصومات وما احتمله الأنبياء من التكذيب والأذى وكيف نصر الله حزبه المؤمنين وخذل أعداءه الكافرين كل هذا مما نثبت به فؤادك أي قلبك يا محمد ليكون لك بمن مضى من إخوانك المرسلين أسوة وقوله \"وجاءك في هذه الحق\" أي هذه السورة قاله ابن عباس ومجاهد وجماعة من السلف وعن الحسن في رواية عنه وقتادة في هذه الدنيا والصحيح في هذه السورة المشتملة على قصص الأنبياء وكيف أنجاهم الله والمؤمنين بهم وأهلك الكافرين جاءك فيها قصص حق ونبأ صدق وموعظة يرتدع بها الكافرون وذكرى يتذكر بها المؤمنون."
    },
    {
      "ayah": 121,
      "surah": 11,
      "text": "يقول تعالى آمرا رسوله أن يقول للذين لا يؤمنون بما جاء به من ربه على وجه التهديد \"اعملوا على مكانتكم\" أي على طريقتكم ومنهجكم \"إنا عاملون\" أي على طريقتنا ومنهجنا."
    },
    {
      "ayah": 122,
      "surah": 11,
      "text": "\"وانتظروا إنا منتظرون\" أي فستعلمون من تكون له عاقبة الدار إنه لا يفلح الظالمون\" وقد أنجز الله لرسوله وعده ونصره وأيده وجعل كلمته هي العليا وكلمة الذين كفروا السفلى والله عزيز حكيم."
    },
    {
      "ayah": 123,
      "surah": 11,
      "text": "يخبر تعالى أنه عالم غيب السموات والأرض وأنه إليه المرجع والمآب وسيؤتي كل عامل عمله يوم الحساب فله الخلق والأمر ; فأمر تعالى بعبادته والتوكل عليه فإنه كاف من توكل عليه وأناب إليه وقوله \"وما ربك بغافل عما تعملون\" أي ليس يخفى عليه ما عليه مكذبوك يا محمد بل هو عليم بأحوالهم وأقوالهم وسيجزيهم على ذلك أتم الجزاء في الدنيا والأخرة وسينصرك وحزبك عليهم في الدارين وقال ابن جرير حدثنا ابن وكيع حدثنا زيد بن الحباب عن جعفر بن سليمان عن أبي عمران الجوني عن عبدالله بن رباح عن كعب قال خاتمة التوراة خاتمة هود. آخر تفسير سورة هود عليه السلام ولله الحمد والمنة."
    },
    {
      "ayah": 13,
      "surah": 11,
      "text": "ثم بين تعالى إعجاز القرآن وأنه لا يستطيع أحد أن يأتي بمثله ولا بعشر سور مثله ولا بسورة من مثله لأن كلام الرب تعالى لا يشبه كلام المخلوقين كما أن صفاته لا تشبه صفات المحدثات. وذاته لا يشبهها شيء تعالى وتقدس وتنزه لا إله إلا هو ولا رب سواه."
    },
    {
      "ayah": 14,
      "surah": 11,
      "text": "ثم قال تعالى فإن \"لم يستجيبوا لكم\" أي فإن لم يأتوا بمعارضة ما دعوتموهم إليه فاعلموا أنهم عاجزون عن ذلك وأن هذا الكلام منزل من عند الله متضمن علمه وأمره ونهيه \"وأن لا إله إلا هو فهل أنتم مسلمون\"."
    },
    {
      "ayah": 15,
      "surah": 11,
      "text": "قال العوفي عن ابن عباس في هذه الآية إن أهل الرياء يعطون بحسناتهم في الدنيا وذلك أنهم لا يظلمون نقيرا يقول من عمل صالحا التماس الدنيا صوما أو صلاة أو تهجدا بالليل لا يعمله إلا التماس الدنيا يقول الله تعالى: أوفيه الذي التمس في الدنيا من المثابة وحبط عمله الذي كان يعمله لالتماس الدنيا وهو في الآخرة من الخاسرين. وهكذا روى عن مجاهد والضحاك وغير واحد وقال أنس بن مالك والحسن:نزلت في اليهود والنصارى وقال مجاهد وغيره: نزلت في أهل الرياء وقال قتادة من كانت الدنيا همه ونيته وطلبته جازاه الله بحسناته في الدنيا ثم يفضي إلى الآخرة وليس له حسنة يعطى بها جزاء وأما المؤمن فيجازى بحسناته في الدنيا ويثاب عليها في الآخرة وقد ورد في الحديث المرفوع نحو من هذا."
    },
    {
      "ayah": 16,
      "surah": 11,
      "text": "وقال تعالى \"من كان يريد العاجلة عجلنا له فيها ما نشاء لمن نريد ثم جعلنا له جهنم يصلاها مذموما مدحورا ومن أراد الآخرة وسعى لها سعيها وهو مؤمن فأولئك كان سعيهم مشكورا كلا نمد هؤلاء وهؤلاء من عطاء ربك وما كان عطاء ربك محظورا انظر كيف فضلنا بعضهم على بعض وللأخرة أكبر درجات وأكبر تفضيلا\". وقال تعالى \"من كان يريد حرث الآخرة نزد له في حرثه ومن كان يريد حرث الدنيا نؤته منها وما له في الآخرة من نصيب\"."
    },
    {
      "ayah": 17,
      "surah": 11,
      "text": "يخبر تعالى عن حال المؤمنين الذين هم علي فطرة الله تعالى التي فطر عليها عبادة من الاعتراف له بأنه لا إلا إلا هو كما قال تعالى \"فأقم وجهك للدين حنيفا فطرة الله التي فطر عليها\" الآية وفي الصحيحين عن أبي هريرة قال: قال رسول الله صلي الله عليه وسلم \"كل مولود يولد علي الفطرة فأبواه يهودانه أو ينصرانه أو يمجسانه كما تولد البهيمة بهيمة جمعاء هل تحسون فيها من جدعاء؟\" الحديث وفي صحيح مسلم عن عياض بن حماد عن رسول الله صلي الله عليه وسلم قال \"يقول الله تعالى إني خلقت عبادي حنفاء فجاءتهم الشياطين فاجتالتهم عن دينهم وحرمت عليهم ما أحللت لهم وأمرتهم أن يشركوا بي ما لم أنزل به سلطانا \" وفي المسند والسنن \"كل مولود يولد علي هذه الملة حتي يعرب عنه لسانه\" الحديث فالمؤمن باق علي هذه الفطرة وقوله \"ويتلوه شاهد منه\" أي وجاءه شاهد من الله وهو ما أوحاه إلي الأنبياء من الشرائع المطهرة المكملة المعظمة المختتمة بشريعة محمد صلوات الله وسلامه عليه وعليهم أجمعين لهذا قال ابن عباس ومجاهد وعكرمة وأبوا العالية والضحاك وإبراهيم النخعي والسدي وغير واحد في قوله تعالى \"ويتلوه شاهد منه\" أنه جبريل عليه السلام وعن علي رضي الله عنه والحسن وقتادة هو محمد صلي الله عليه وسلم وكلاهما قريب في المعني لأن كلا من جبريل ومحمد صلوات الله عليهما بلغ رسالة الله تعالى فجبريل إلي محمد ومحمد إلي الأمة وقيل هو علّي وهو ضعيف لا يثبت له قائل ولأول هو الحق وذلك أن المؤمن عنده من الفطرة وما يشهد من حيث الجملة والتفاصيل تؤخذ من الشريعة والفطرة تصدقها وتؤمن بها لهذا قال تعالى \"أفمن كان علي بينة من ربه ويتلوه شاهد منه\" وهو القرآن بلغه جبريل إلي النبي صلي الله عليه وسلم وبلغه النبي محمد صلي الله عليه وسلم إلي أمته ثم قال تعالى \"ومن قبله كتاب موسي\" أي ومن قبل القرآن كتاب موسي وهو التوراة \"إماما ورحمة\" أي أنزل الله تعالى إلي تلك الأمة إماما لهم وقدوة يقتدون بها ورحمة من الله بهم فمن آمن بها حق الإيمان قادة ذلك إلى الإيمان بالقرآن ولهذا قال تعالى \"أولئك يؤمنون به\" ثم قال تعالى متوعدا لمن كذب بالقرآن أو بشيء منه \"ومن يكفر به من الأحزاب فالنار موعده\" أي ومن كفر بالقرآن من سائر أهل الأرض مشركهم وكافرهم وأهل الكتاب وغيرهم ومن سائر طوائف بني آدم علي اختلاف ألوانهم وأشكالهم وأجناسهم ممن بلغه القرآن كما قال تعالى \"لأنذركم به ومن بلغ\" وقال تعالى \"قل يا أيها الناس إني رسول إليكم جميعا \" وقال تعالى \"ومن يكفر به من الأحزاب فالنار موعده\" وفي صحيح مسلم من حديث شعبة عن أبي بشر عن سعيد بن جبير عن أبي موسى الأشعري رضي الله عنه أن رسول الله صلي الله عليه وسلم قال \"والذي نفسي بيده لا يسمع بي أحد من هذه الأمة يهودي أو نصراني ثم لا يؤمن بي إلا دخل النار\" وقال أيوب السختياني عن سعيد بن جبير قال: كنت لا أسمع بحديث عن النبي صلي الله عليه وسلم علي وجهه إلا وجدت مصداقه أو قال تصديقه في القرآن فبلغني أن النبي صلي الله عليه وسلم قال \"لا يسمع بي أحد من هذه الأمة يهودي ولا نصراني فلا يؤمن بي إلا دخل النار\" فجعلت أقول أين مصداقه في كتاب الله؟ وقال وقلما سمعت عن رسول الله صلي الله عليه وسلم إلا وجدت له تصديقا في القرآن حتي وجدت هذه الآية \"ومن يكفر به من الأحزاب فالنار موعده\" قال من الملل كلها وقوله \"فلا تك في مريه منه إنه الحق من ربك\" الآية أي القرآن حق من الله لا مرية ولا شك فيه قال تعالى \"ألم تنزيل الكتاب لا ريب فيه من رب العاليمن\" وقال تعالى \"ألم ذلك الكتاب لا ريب فيه\" وقوله \"ولكن أكثر الناس لا يؤمنون\" كقوله تعالي \"وما أكثر الناس ولو حرصت بمؤمنين\" وقال تعالى \"وإن تطع أكثر من في الأرض يضلوك عن سبيل الله\" وقال تعالى \"ولقد صدق عليهم إبليس ظنه فاتبعوه إلا فريقا من المؤمنين."
    },
    {
      "ayah": 18,
      "surah": 11,
      "text": "يبين تعالى حال المفترين عليه وفضيحتهم في الدار الآخرة علي رءوس الخلائق من الملائكة والرسل والأنبياء وسائر البشر والجان كما قال الإمام أحمد حدثنا بهز وعفان قالا أخبرنا همام حدثنا قتادة عن صفوان بن محرز قال: كنت آخذا بيد ابن عمر إذا عرض له رجل قال كيف سمعت رسول الله صلي الله عليه وسلم يقول في النجوي يوم القيامة ؟ قال سمعته يقول \"إن الله عز وجل يدنى المؤمن فيضع عليه كنفه ويستره من الناس ويقرره بذنوبه ويقول له أتعرف ذنب كذا؟ أتعرف ذنب كذا؟ أتعرف ذنب كذا؟ حتى إذا قرره بذنوبه ورأى في نفسه أنه قد هلك قال فإني قد سترتها عليك في الدنيا وإني أغفرها لك اليوم ثم يعطى كتاب حسناته وأما الكفار والمنافقون فيقول \"الأشهاد هؤلاء الذين كذبوا على ربهم ألا لعنة الله على الظالمين\" الآية. أخرجه البخاري ومسلم في الصحيحين من حديث قتادة."
    },
    {
      "ayah": 19,
      "surah": 11,
      "text": "وقوله \"الذين يصدون عن سبيل الله ويبغونها عوجا\" أي يردون الناس عن اتباع الحق وسلوك طريق الهدى الموصلة إلى الله عز وجل ويجنبونهم الجنة \"ويبغونها عوجا\" أي ويريدون أن يكون طريقهم عوجا غير معتدلة \"وهم بالآخرة هم كافرون\" أي جاحدون بها مكذبون بوقوعها وكونها."
    },
    {
      "ayah": 2,
      "surah": 11,
      "text": "\"ألا تعبدوا إلا الله\" أي نزل هذا القرآن المحكم المفصل لعبادة الله وحده لا شريك له كقوله تعالى \"وما أرسلنا من قبلك من رسول إلا نوحي إليه أنه لا إله إلا أنا فاعبدون\" وقال \"ولقد بعثنا في كل أمة رسولا أن اعبدوا الله واجتنبوا الطاغوت\" وقوله \"إنني لكم منه نذير وبشير\" أي إني لكم نذير من العذاب إن خالفتموه وبشير بالثواب إن أطعتموه كما جاء في الحديث الصحيح أن رسول الله صلي الله عليه وسلم صعد الصفا فدعا بطون قريش الأقرب ثم الأقرب فاجتمعوا فقال \"يا معشر قريش أرأيتم لو أخبرتكم أن خيلا تصبحكم ألستم مصدقي ؟\" فقالوا ما جربنا عليك كذبا قال \"فإنى نذير لكم بين يدي عذاب شديد\"."
    },
    {
      "ayah": 20,
      "surah": 11,
      "text": "\"أولئك لم يكونوا معجزين في الأرض وما كان لهم من دون الله من أولياء\" أي بل كانوا تحت قهره وغلبته وفي قبضته وسلطانه وهو قادر على الانتقام منهم في الدار الدنيا قبل الآخرة \"ولكن يؤخرهم ليوم تشخص فيه الأبصار وفي الصحيحين \"إن الله ليملي للظالم حتي إذا أخذه لم يفلته\" ولهذا قال تعالى \"يضاعف لهم العذاب\" الآية. أي يضاعف عليهم العذاب وذلك أن الله تعالى جعل لهم سمعا وأبصارا وأفئدة فما أغنى عنهم سمعهم ولا أبصارهم ولا أفئدتهم بل كانوا صما عن سماع الحق عميا عن اتباعه كما أخبر تعالى عنهم حين دخولهم النار كقوله \"وقالوا لو كنا نسمع أو نعقل ما كنا في أصحاب السعير\" وقال تعالى \"الذين كفروا وصدوا عن سبيل الله زدناهم عذابا فوق العذاب\" الآية ولهذا يعذبون على كل أمر تركوه وعلى كل نهي ارتكبوه ولهذا كان أصح الأقوال أنهم مكلفون بفروع الشرائع أمرها ونهيها بالنسبة إلى الدار الآخرة."
    },
    {
      "ayah": 21,
      "surah": 11,
      "text": "أي خسروا أنفسهم لأنهم أدخلوا نارا حامية فهم معذبون فيما لا يفتر عنهم من عذابها طرفة عين كما قال تعالى \"كلما خبت زدناهم سعيرا\" \"وضل عنهم\" أي ذهب عنهم \"ما كانوا يفترون\" من دون الله من الأنداد والأصنام فلم تجد عنهم شيئا بل ضرتهم كل الضرر كما قال تعالى \"إذا حشر الناس كانوا لهم أعداء وكانوا بعبادتهم كافرين\" وقال تعالى \"واتخذوا من دون الله آلهة ليكونوا لهم عزا كلا سيكفرون بعبادتهم ويكونون عليهم ضدا\" وقال الخليل لقومه \"إنما اتخذتم من دون الله أوثانا مودة بينكم في الحياة الدنيا ثم يوم القيامة يكفر بعضكم ببعض ويلعن بعضكم بعضا ومأواكم النار وما لكن من ناصرين\" وقوله \"إذ تبرأ الذين اتبعوا من الذين اتبعوا ورأوا العذاب وتقطعت بهم الأسباب إلى غير ذلك من الآيات الدالة على خسرهم ودمارهم."
    },
    {
      "ayah": 22,
      "surah": 11,
      "text": "ولهذا قال \"لا جرم أنهم في الآخرة هم الأخسرون\" يخبر تعالى عن مآلهم أنهم أخسر الناس صفقة في الدار الآخرة لأنهم استبدلوا الدركات عن الدرجات واعتاضوا عن نعيم الجنان بحميم آن وعن شرب الرحيق المختوم بسموم وحميم وظل من يحموم وعن الحور العين بطعام من غسلين وعن القصور العالية بالهاوية وعن قرب الرحمن ورؤيتة بغضب الديان وعقوبته فلا جرم أنهم في الآخرة هم الأخسرون."
    },
    {
      "ayah": 23,
      "surah": 11,
      "text": "لما ذكر تعالى حال الأشقياء ثنى بذكر السعداء وهم الذين آمنوا وعملوا الصالحات فآمنت قلوبهم وعملت جوارحهم الأعمال الصالحة قولا وفعلا من الإتيان بالطاعات وترك المنكرات وبهذا ورثوا الجنات المشتملة على الغرف العاليات والسرر المصفوفات والقطوف الدانيات والفرش المرتفعات والحسان الخيرات والفواكه المتنوعات والمآكل المشتهيات والمشارب المستلذات والنظر إلى خالق الأرض والسموات وهم في ذلك خالدون لا يموتون ولا يهرمون ولا يمرضون ولا ينامون ولا يتغوطون ولا يبصقون ولا يتمخطون إن هو إلا رشح مسك يعرقون ثم ضرب تعالى مثل الكافرين والمؤمنين."
    },
    {
      "ayah": 24,
      "surah": 11,
      "text": "فقال \"مثل الفريقين\" أي الذين وصفهم أولا بالشقاء والمؤمنين بالسعادة فأولئك كالأعمى والأصم وهؤلاء كالبصير والسميع فالكافر أعمى عن وجه الحق في الدنيا والآخرة لا يهتدي إلى خير ولا يعرفه أصم عن سماع الحجج فلا يسمع ما ينتفع به \"ولو علم الله فيهم خيرا لأسمعهم\" الآية وأما المؤمن ففطن ذكي لبيب بصير بالحق يميز بينه وبين الباطل فيتبع الخير ويترك الشر سميع للحجة يفرق بينها وبين الشبهة فلا يروج عليه باطل فهل يستوي هذا وهذا؟ \"أفلا تذكرون\" أفلا تعتبرون فتفرقون بين هؤلاء وهؤلاء كما قال في الآية الأخري \"لا يستوي أصحاب النار وأصحاب الجنة أصحاب الجنة هم الفائزون\" وكقوله \"وما يستوي الأعمي والبصير ولا الظلمات ولا النور ولا الظل ولا الحور وما يستوي الأحياء ولا الأموات إن الله يسمع من يشاء وما أنت بمسمع من في القبور إن أنت إلا نذير إنا أرسلناك بالحق بشيرا ونذيرا وإن من أمة إلا خلا فيها نذير\"."
    },
    {
      "ayah": 25,
      "surah": 11,
      "text": "يخبر تعالى عن نوح عليه السلام وكان أول رسول بعثه الله إلى أهل الأرض من المشركين عبدة الأصنام أنه قال لقومه \"إنى لكم نذير مبين\" أي ظاهر النذارة لكم من عذاب الله إن أنتم عبدتم غير الله."
    },
    {
      "ayah": 26,
      "surah": 11,
      "text": "ولهذا قال \"أن لا تعبدوا إلا الله\" وقوله \"إني أخاف عليكم عذاب يوم أليم\" أي إن استمررتم على ما أنتم عليه عذبكم الله عذابا أليما موجعا شاقا في الدار الآخرة."
    },
    {
      "ayah": 27,
      "surah": 11,
      "text": "فقال \"الملأ الذين كفروا من قومه\" والملأ هم السادة والكبراء من الكافرين منهم \"ما نراك إلا بشرا مثلنا\" أي لست بملك ولكنك بشر فكيف أوحي إليك من دوننا ثم ما نراك اتبعك إلا الذين هم أراذلنا كالباعة والحاكة وأشباههم ولم يتبعك الأشراف ولا الرؤساء منا ثم هؤلاء الذين اتبعوك لم يكن عن ترّو منهم ولا فكر ولا نظر بل بمجرد ما دعوتهم أجابوك فاتبعوك ولهذا قالوا \"وما نراك اتبعك إلا الذين هم أراذلنا بادي الرأي\" أي في أول بادئ \"وما نرى لكم علينا من فضل\" يقولون ما رأينا لكم علينا فضيلة في خلق ولا خلق ولا رزق ولا حال لما دخلتم في دينكم هذا \"بل نظنكم كاذبين\" أي فيما تدعونه لكم من البر والصلاح والعبادة والسعادة في الدار الآخرة إذ صرتم إليها هذا اعتراض الكافرين على نوح عليه السلام وأتباعه وهو دليل على جهلهم وقلة علمهم وعقلهم فإنه ليس بعار على الحق رذالة من اتبعه فإن الحق في نفسه صحيح سواء اتبعه الأشراف أو الأراذل بل الحق الذي لا شك فيه أن اتباع الحق هم الأشراف ولو كانوا فقراء والذين يأبونه هم الأراذل ولو كانوا أغنياء ثم الواقع غالبا أن ما يتبع الحق ضعفاء الناس. والغالب على الأشراف والكبراء مخالفته كما قال تعالى \"وكذلك ما أرسلنا من قبلك في قرية من نذير إلا قال مترفوها إنا وجدنا آباءنا على أمة وإنا على آثارهم مقتدون\" ولما سأل هرقل ملك الروم أبا سفيان صخر بن حرب عن صفات النبي صلي الله عليه وسلم قال له فيما قال: أشراف الناس اتبعوه أو ضعفاؤهم؟ قال بل ضعفاؤهم. فقال هرقل هم أتباع الرسل وقولهم \"بادي الرأي\" ليس بمذمة ولا عيب لأن الحق إذا وضح لا يبقى للرأي ولا للفكر مجال بل لا بد من اتباع الحق والحالة هذه لكل ذي زكاء وذكاء بل لا يفكر ههنا إلا غبي أو عيي والرسل صلوات الله وسلامه عليهم أجمعين إنما جاءوا بأمر جلي واضح. وقد جاء في الحديث أن رسول الله صلي الله عليه وسلم قال \"ما دعوت أحدا إلى الإسلام إلا كانت له كبوة غير أبي بكر فإنه لم يتلعثم\" أي ما تردد ولا تروى لأنه رأى أمرا جليا عظيما واضحا فبادر إليه وسارع. وقوله \"وما نرى لكم علينا من فضل\" هم لا يرون ذلك لأنهم عمي عن الحق لا يسمعون ولا يبصرون بل هم في ريبهم يترددون في ظلمات الجهل يعمهون وهم الأفاكون الكاذبون الأقلون الأرذلون وهم في الآخرة هم الأخسرون."
    },
    {
      "ayah": 28,
      "surah": 11,
      "text": "يقول تعالى مخبرا عما رد به نوح على قومه في ذلك \"أرأيتم إن كنت على بينة من ربي\" أي على يقين وأمر جلي ونبوة صادقة وهي الرحمة العظيمة من الله به وبهم \"فعميت عليكم\" أي خفيت عليكم فلم تهتدوا إليها ولا عرفتم قدرها بل بادرتم إلى تكذيبها وردها \"أنلزمكموها\" أي نغصبكم بقبولها وأنتم لها كارهون."
    },
    {
      "ayah": 29,
      "surah": 11,
      "text": "يقول لقومه لا أسألكم على نصحي لكم ما لا أجرة آخذها منكم إنما أبتغي الأجر من الله عز وجل \"وما أنا بطارد الذين آمنوا\" كأنهم طلبوا منه أن يطرد المؤمنين عنه احتشاما ونفاسة منهم أن يجلسوا معهم."
    },
    {
      "ayah": 3,
      "surah": 11,
      "text": "وقوله \"وأن استغفروا ربكم ثم توبوا إليه يمتعكم متاعا حسنا إلى أجل مسمى ويؤت كل ذي فضل فضله\" أي وآمركم بالاستغفار من الذنوب السالفة والتوبة منها إلى الله عز وجل فيما تستقبلونه وأن تستمروا على ذلك \"يمتعكم متاعا حسنا \" أي في الدنيا \"إلى أجل مسمى ويؤت كل ذي فضل فضله\" أي في الدار الآخرة قاله قتادة كقوله \"من عمل صالحا من ذكر أو أنثى وهو مؤمن فلنحيينه حياة طيبة\" الآية. وقد جاء في الصحيح أن رسول الله صلي الله عليه وسلم قال لسعد \"وإنك لن تنفق نفقة تبتغي بها وجه الله إلا أجرت بها حتى ما تجعل في في امرأتك\" وقال ابن جرير حدثني المسيب بن شريك عن أبي بكر عن سعيد بن جبير عن ابن مسعود رضي الله عنه في قوله \"ويؤت كل ذي فضل فضله\" قال من عمل سيئة كتبت عليه سيئة ومن عمل حسنة كتبت له عشر حسنات فإن عوقب بالسيئة التي كان عملها في الدنيا بقيت له عشر حسنات وإن لم يعاقب بها في الدنيا أخذ من الحسنات العشر واحدة وبقيت له تسع حسنات ثم يقول هلك من غلب آحاده على أعشاره وقوله \"وإن تولوا فإني أخاف عليكم عذاب يوم كبير\" هذا تهديد شديد لمن تولى عن أوامر الله تعالى وكذب رسله فإن العذاب يناله يوم القيامة لا محالة."
    },
    {
      "ayah": 30,
      "surah": 11,
      "text": "كما سأل أمثالهم خاتم الرسل صلي الله عليه وسلم أن يطرد عنهم جماعة من الضعفاء ويجلس معهم مجلسا خاصا فأنزل الله تعالى \"ولا تطرد الذين يدعون ربهم بالغداة والعشي\" الآية. وقال تعالى \"وكذلك فتنا بعضهم ببعض ليقولوا أهؤلاء من الله عليهم من بيننا أليس الله بأعلم بالشاكرين\" الآية."
    },
    {
      "ayah": 31,
      "surah": 11,
      "text": "ولا أقول لكم عندي خزائن الله ولا أعلم الغيب ولا أقول إني ملك ولا أقول للذين تزدري أعينكم لن يؤتيهم الله خيرا الله أعلم بما في أنفسهم إني إذا لمن الظالمينيخبرهم أنه رسول من الله يدعو إلى عبادة الله وحده لا شريك له بإذن الله له في ذلك ولا يسألهم على ذلك أجرا بل هو يدعو من لقيه من شريف ووضيع فمن استجاب له فقد نجا ويخبرهم أنه لا قدرة له على التصرف في خزائن الله ولا يعلم من الغيب إلا ما أطلعه الله عليه وليس هو بملك من الملائكة بل هو بشر مرسل مؤيد بالمعجزات ولا أقول عن هؤلاء الذين تحقرونهم وتزدرونهم إنهم ليس لهم عند الله ثواب على أعمالهم الله أعلم بما في أنفسهم فإن كانوا مؤمنين باطنا كما هو الظاهر من حالهم فلهم جزاء الحسنى ولو قطع لهم أحد بشر بعد ما آمنوا لكان ظالما قائلا ما لا علم له به ."
    },
    {
      "ayah": 32,
      "surah": 11,
      "text": "يقول تعالى مخبرا عن استعجال قوم نوح نقمة الله وعذابه وسخطه والبلاء موكل بالمنطق. \"قالوا يا نوح قد جادلتنا فأكثرت جدالنا\" أي حاججتنا فأكثرت من ذلك ونحن لا نتبعك \"فأتنا بما تعدنا\" أي من النقمة والعذاب ادع علينا بما شئت فليأتنا ما تدعو به \"إن كنت من الصادقين\"."
    },
    { "ayah": 33, "surah": 11, "text": "أي إنما الذي يعاقبكم ويعجلها لكم الله الذي لا يعجزه شيء." },
    {
      "ayah": 34,
      "surah": 11,
      "text": "\"ولا ينفعكم نصحي إن أردت أن أنصح لكم إن كان الله يريد أن يغويكم\" أي أي شيء يجدي عليكم إبلاغي لكم وإنذاري إياكم ونصحي \"إن كان الله يريد أن يغويكم\" أي إغواءكم ودماركم \"هو ربكم وإليه ترجعون\" أي هو مالك أزمة الأمور المتصرف الحاكم العادل الذي لا يجور له الخلق وله الأمر وهو المبدئ المعيد مالك الدنيا والآخرة."
    },
    {
      "ayah": 35,
      "surah": 11,
      "text": "هذا كلام معترض في وسط هذه القصة مؤكد لها مقرر لها يقول تعالى لمحمد صلي الله عليه وسلم أم يقول هؤلاء الكافرون الجاحدون افترى هذا وافتعله من عنده \"قل إن افتريته فعلي إجرامي\" أي فإثم ذلك علي \"وأنا بريء مما تجرمون\" أي ليس ذلك مفتعلا ولا مفترى لأني أعلم ما عند الله من العقوبة لمن كذب عليه."
    },
    {
      "ayah": 36,
      "surah": 11,
      "text": "يخبر تعالى أنه أوحى إلى نوح لما استعجل قومه نقمة الله بهم وعذابه لهم فدعا عليهم نوح دعوته التي قال الله تعالى مخبرا عنه أنه قال \"رب لا تذر على الأرض من الكافرين ديارا\" \"فدعا ربه أني مغلوب فانتصر\" فعند ذلك أوحى الله إليه \"أنه لا يؤمن من قومك إلا من قد آمن\" فلا تحزن عليهم ولا يهمنك أمرهم."
    },
    {
      "ayah": 37,
      "surah": 11,
      "text": "\"واصنع الفلك\" يعني السفينة \"بأعيننا\" أي بمرأى منا \"ووحينا\" أي تعليمنا لك ما تصنعه \"ولا تخاطبني في الذين ظلموا إنهم مغرقون\" فقال بعض السلف أمره الله تعالى أن يغرز الخشب ويقطعه وييبسه فكان ذلك في مائة سنة ونجرها في مائة سنة أخرى وقيل في أربعين سنة والله أعلم. وذكر محمد بن إسحاق عن التوراة أن الله أمره أن يصنعها من خشب الساج وأن يجعل طولها ثمانين ذراعا وعرضها خمسين ذراعا وأن يطلي باطنها وظاهرها بالقار وأن يجعل لها جؤجؤا أزورا يشق الماء وقال قتادة كان طولها ثلثمائة ذراع في عرض خمسين وعن الحسن طولها ستمائة ذراع وعرضها ثلثمائة وعنه مع ابن عباس طولها ألف ومائتا ذراع في عرض ستمائة وقيل طولها ألفا ذراع وعرضها مائة ذراع فالله أعلم قالوا كلهم وكان ارتفاعها في السماء ثلاثين ذراعا ثلاث طبقات كل طبقة عشرة أذرع فالسفلى للدواب والوحوش والوسطى للإنس والعليا للطيور وكان بابها في عرضها ولها غطاء من فوقها مطبق عليها وقد ذكر الإمام أبو جعفر بن جرير أثرا غريبا من حديث علي بن زيد بن جدعان عن يوسف بن مهران عن عبدالله بن عباس أنه قال: قال الحواريون لعيسى ابن مريم لو بعثت لنا رجلا شهد السفينة فحدثنا عنها قال فانطلق بهم حتى انتهى إلى كثيب من تراب فأخذ كفا من ذلك التراب بكفه فقال أتدرون ما هذا؟ قالوا الله ورسوله أعلم قال هذا كعب حام بن نوح قال فضرب الكثيب بعصاه قال قم بإذن الله فإذا هو قائم ينفض التراب عن رأسه قد شاب قال له عيسى عليه السلام أهكذا هلكت ؟ قال لا. ولكني مت وأنا شاب ولكني ظننت أنها الساعة فمن ثم شبت قال حدثنا عن سفينة نوح ؟ قال كان طولها ألف ذراع ومائتي ذراع وعرضها ستمائة ذراع وكانت ثلاث طبقات فطبقة فيها الدواب والوحوش وطبقة فيها الإنس وطبقة فيها الطير فلما كثر روث الدواب أوحي الله عز وجل إلى نوح عليه السلام أن اغمز ذنب الفيل فغمزه فوقع منه خنزير وخنزيرة فأقبلا على الروث فلما وقع الفأر بجوف السفينة يقرضها وحبالها أوحى الله إليه أن اضرب بين عيني الأسد فضرب فخرج من منخره سنور وسنورة فأقبلا على الفأر ; فقال له عيسى عليه السلام كيف علم نوح أن البلاد قد غرفت ؟ قال بعث الغراب يأتيه بالخبر فوجد جيفة فوقع عليها فدعا عليه بالخوف فلذلك لا يألف البيوت قال ثم بعث الحمامة فجاءت بورق زيتون بمنقارها وطين برجليها فعلم أن البلاد قد غرقت قال فطوقها الخصرة التي في عنقها ودعا لها أن تكون في أنس وأمان فمن ثم تألف البيوت قال: فقلنا يا رسول الله ألا ننطلق به إلى أهلينا فيجلس معنا ويحدثنا ؟ قال كيف يتبعكم من لا رزق له؟ قال: فقال له عد بإذن الله فعاد ترابا."
    },
    {
      "ayah": 38,
      "surah": 11,
      "text": "وقوله \"ويصنع الفلك وكلما مر عليه ملأ من قومه سخروا منه\" أي يهزءون به ومكذبون بما يتوعدهم به من الغرق \"قال إن تسخروا منا فإنا نسخر منكم\" الآية. وعيد شديد وتهديد أكيد."
    },
    {
      "ayah": 39,
      "surah": 11,
      "text": "\"من يأتيه عذاب يخزيه\" أي يهينه في الدنيا \"ويحل عليه عذاب مقيم\" أي دائم مستمر أبدا."
    },
    {
      "ayah": 4,
      "surah": 11,
      "text": "\"إلى الله مرجعكم\" أي معادكم يوم القيامة \"وهو على كل شيء قدير\" أي وهو القادر على ما يشاء من إحسانه إلى أوليائه وانتقامه من أعدائه وإعادة الخلائق يوم القيامة وهذا مقام الترهيب كما أن الأول مقام ترغيب."
    },
    {
      "ayah": 40,
      "surah": 11,
      "text": "هذه موعدة من الله تعالى لنوح عليه السلام إذا جاء أمر الله من الأمطار المتتابعة والهتان الذي لا يقلع ولا يفتر بل هو كما قال تعالى \"ففتحنا أبواب السماء بماء منهمر وفجرنا الأرض عيونا فالتقى الماء على أمر قد قدر وحملناه على ذات ألواح ودسر تجري بأعيننا جزاء لمن كان كفر\" وأما قوله \"وفار التنور\" فعن ابن عباس التنور وجه الأرض أي صارت الأرض عيونا تفور حتى فار الماء من التنانير التي هي مكان النار صارت تفور ماء وهذا قول جمهور السلف وعلماء الخلف وعن علي بن أبي طالب رضي الله عنه التنور فلق الصبح وتنوير الفجر وهو ضياؤه وإشراقه والأول أظهر وقال مجاهد والشعبي كان هذا التنور بالكوفة وعن ابن عباس عين بالهند وعن قتادة عين بالجزيرة يقال لها عين الوردة وهذه أقوال غريبة فحينئذ أمر الله نوحا عليه السلام أن يحمل معه في السفينة من كل زوجين اثنين من صنوف المخلوقات ذوات الأرواح قيل وغيرها من النباتات اثنين ذكرا وأنثي فقيل كان أول من أدخل من الطيور الدرة وآخر من أدخل من الحيوانات الحمار فتعلق إبليس بذنبه وجعل يريد أن ينهض فيثقله إبليس وهو متعلق بذنبه فجعل يقول له نوح عليه السلام: مالك ويحك ادخل فينهض ولا يقدر فقال ادخل وإن كان إبليس معك فدخلا في السفينة ; وذكر بعض السلف أنهم لم يستطيعوا أن يحملوا معهم الأسد حتى ألقيت عليه الحمى. وقال ابن أبي حاتم حدثنا أبي حدثنا عبدالله بن صالح كاتب الليث حدثني الليث حدثني هشام بن سعد عن زيد بن أسلم عن أبيه أن رسول الله صلي الله عليه وسلم قال \"لما حمل نوح في السفينة من كل زوجين اثنين قال أصحابه وكيف تطمئن المواشي ومعها الأسد ؟ فسلط الله عليه الحمى فكانت أول حمى نزلت في الأرض ثم شكوا الفأرة فقالوا الفويسقة تفسد علينا طعامنا ومتاعنا فأوحى الله إلى الأسد فعطس فخرجت الهرة منه فتخبأت الفأرة منها\". وقوله \"وأهلك إلا من سبق عليه القول\" أي واحمل فيها أهلك وهم أهل بيته وقرابته إلا من سبق عليه القول منهم ممن لم يؤمن بالله فكان منهم ابنه يام الذي انعزل وحده وامرأة نوح وكانت كافرة بالله ورسوله وقوله \"ومن آمن\" أي من قومك \"وما آمن معه إلا قليل\" أي نزر يسير مع طول المدة والمقام بين أظهرهم ألف سنة إلا خمسين عاما فعن ابن عباس كانوا ثمانين نفسا منهم نساؤهم وعن كعب الأحبار كانوا اثنين وسبعين نفسا وقيل كانوا عشرة وقيل إنما كان نوح وبنوه الثلاثة سام وحام ويافث وكنائنه الأربع نساء هؤلاء الثلاثة وامرأة يام وقيل بل امرأة نوح كانت معهم في السفينة وهذا فيه نظر بل الظاهر أنها هلكت لأنها كانت على دين قومها فأصابها ما أصابهم كما أصاب امرأة لوط ما أصاب قومها والله أعلم وأحكم."
    },
    {
      "ayah": 41,
      "surah": 11,
      "text": "يقول تعالى إخبارا عن نوح عليه السلام انه قال للذين أمر بحملهم معه في السفينة \"اركبوا فيها بسم الله مجريها ومرساها\" أي بسم الله يكون جريها على وجه الماء وبسم الله يكون منتهى سيرها وهو رسّوها وقرأ أبو رجاء العطاردي \"بسم الله مجريها ومرسيها\" وقال الله تعالى \"فإذا استويت أنت ومن معك على الفلك فقل الحمد لله الذي نجانا من القوم الظالمين وقل رب أنزلني منزلا مباركا وأنت خير المنزلين\" ولهذا تستحب التسمية في ابتداء الأمور عند الركوب على السفينة وعلى الدابة كما قال تعالى \"والذي خلق الأزواج كلها وجعل لكم من الفلك والأنعام ما تركبون لتستووا على ظهوره الآية وجاءت السنة بالحث على ذلك والندب إليه كما سيأتي في سورة الزخرف إن شاء الله وبه الثقة وقال أبو القاسم الطبراني حدثنا إبراهيم بن هشام البغوي حدثنا محمد بن أبي بكر المقدمي وحدثنا زكريا بن يحيى الساجي حدثنا محمد بن موسى الجرثي قالا حدثنا عبد الحميد بن الحسن الهلالي عن نهشل بن سعيد عن الضحاك عن ابن عباس عن النبي صلي الله عليه وسلم قال \"أمان أمتي من الغرق إذا ركبوا في السفن أن يقولوا بسم الله الملك \"وما قدروا الله حق قدره\" الآية. \"بسم الله مجريها ومرساها إن ربي لغفور رحيم\" وقوله \"إن ربي لغفور رحيم\" مناسب عند ذكر الانتقام من الكافرين بإغراقهم أجمعين فذكر أنه غفور رحيم كقوله \"إن ربك لسريع العقاب وإنه لغفور رحيم\" وقال \"وإن ربك لذو مغفرة للناس على ظلمهم وإن ربك لشديد العقاب\" إلى غير ذلك من الآيات التي يقرن فيها بين رحمته وانتقامه."
    },
    {
      "ayah": 42,
      "surah": 11,
      "text": "وقوله \"وهي تجري بهم في موج كالجبال\" أي السفينة سائرة بهم علي وجه الماء الذي قد طبق جميع الأرض حتى طفت على رؤوس الجبال وارتفع عليها بخمسة عشر ذراعا وقيل بثمانين ميلا وهذه السفينة جارية على وجه الماء سائرة بإذن الله وتحت كنفه وعنايته وحراسته وامتنانه كما قال تعالى \"إنا لما طغى الماء حملناكم في الجارية لنجعلها لكم تذكرة وتعيها أذن واعية\" وقال تعالى \"وحملناه على ذات ألواح ودسر تجري بأعيننا جزاء لمن كان كفر ولقد تركناها آية فهل من مدكر\" وقوله \"ونادى نوح ابنه\" الآية هذا هو الابن الرابع واسمه يام وكان كافرا دعاه أبوه عند ركوب السفينة أن يؤمن ويركب معهم ولا يغرق مثل ما يغرق الكافرون."
    },
    {
      "ayah": 43,
      "surah": 11,
      "text": "\"قال سآوي إلى جبل يعصمني من الماء\" وقيل إنه اتخذ له مركبا من زجاج وهذا من الإسرائيليات والله أعلم بصحته والذي نص عليه القرآن أنه قال \"سآوي إلى جبل يعصمني من الماء\" اعتقد بجهله أن الطوفان لا يبلغ إلى رؤوس الجبال وأنه لو تعلق في رأس جبل لنجاه ذلك من الغرق فقال لها أبوه نوح عليه السلام \"لا عاصم اليوم من أمر الله إلا من رحم\" أي ليس شيء يعصم اليوم من أمر الله وقيل إن عاصما بمعنى معصوم كما يقال طاعم وكاس بمعني مطعوم ومكسو \"وحال بينهما الموج فكان من المغرقين\"."
    },
    {
      "ayah": 44,
      "surah": 11,
      "text": "يخبر تعالى أنه لما أغرق أهل الأرض كلهم إلا أصحاب السفينة أمر الأرض أن تبلع ماءها الذي نبع منها واجتمع عليها وأمر السماء أن تقلع عن المطر \"وغيض الماء\" أي شرع في النقص \"وقضي الأمر\" أي فرغ من أهل الأرض قاطبة ممن كفر بالله لم يبق منهم ديار \"واستوت\" السفينة بمن فيها \"على الجودي\" قال مجاهد وهو جبل بالجزيرة تشامخت الجبال يومئذ من الغرق وتطاولت وتواضع هو لله عز وجل فلم يغرق وأرست عليه سفينة نوح عليه السلام وقال قتادة استوت عليه شهرا حتى نزلوا منها; قال قتادة: قد أبقى الله سفينة نوح عليه السلام على الجودي من أرض الجزيرة عبرة وآية حتى رآها أوائل هذه الأمة وكم من سفينة قد كانت بعدها فهلكت وصارت رمادا. وقال الضحاك: الجودي جبل بالموصل وقال بعضهم هو الطور وقال ابن أبي حاتم: حدثنا أبي حدثنا عمرو بن رافع حدثنا محمد بن عبيد عن توبة بن سالم قال رأيت زر بن حبيش يصلي في الزاوية حين يدخل من أبواب كندة على يمينك فسألته إنك لكثير الصلاة ههنا يوم الجمعة قال بلغني أن سفينة نوح أرست من ههنا. وقال علباء بن أحمر عن عكرمة عن ابن عباس قال: كان مع نوح في السفينة ثمانون رجلا معهم أهلوهم وأنهم كانوا فيها مائة وخمسين يوما وإن الله وجه السفينة إلى مكة فطافت بالبيت أربعين يوما ثم وجهها الله إلى الجودي فاستقرت عليه فبعث نوح الغراب ليأتيه بخبر الأرض فذهب فوقع على الجيف فأبطأ عليه فبعث الحمامة فأتته بورق الزيتون فلطخت رجليها بالطين فعرف نوح عليه السلام أن الماء قد نضب فهبط إلى أسفل الجودي فابتنى قرية وسماها ثمانين فأصبحوا ذات يوم وقد تبلبلت ألسنتهم على ثمانين لغة إحداها اللسان العربي فكان بعضهم لا يفقه كلام بعض فكان نوح عليه السلام يعبر عنهم. وقال كعب الأحبار: إن السفينة طافت ما بين المشرق والمغرب قبل أن تستقر على الجودي وقال قتادة وغيره ركبوا في عاشر شهر رجب فساروا مائه وخمسين يوما واستقرت بهم على الجودي شهرا وكان خروجهم من السفينة في عاشوراء من المحرم وقد ورد نحو هذا في حديث مرفوع رواه ابن جرير وأنهم صاموا يومهم ذلك والله أعلم. وقال الإمام أحمد حدثنا أبو جعفر حدثنا عبدالصمد بن حبيب الأزدي عن أبيه حبيب بن عبدالله عن شبل عن أبي هريرة قال: مر النبي صلي الله عليه وسلم بأناس من اليهود وقد صاموا يوم عاشوراء فقال \"ما هذا الصوم ؟\" قالوا هذا اليوم الذي نجى الله فيه موسى وبني إسرائيل من الغرق وغرق فيه فرعون وهذا يوم استوت فيه السفينة على الجودي فصام نوح وموسى عليهما السلام شكرا لله عز وجل: فقال النبي صلي الله عليه وسلم \"أنا أحق بموسى وأحق بصوم هذا اليوم\". فصام وقال لأصحابه \"من كان أصبح منكم صائما فليتم صومه ومن كان أصاب من غذاء أهله فليتم بقية يومه\" وهذا حديث غريب من هذا الوجه ولبعضه شاهد في الصحيح وقوله \"وقيل بعدا للقوم الظالمين\" أي هلاكا وخسارا لهم وبعدا من رحمة الله فإنهم قد هلكوا عن آخرهم فلم يبق لهم بقية وقد روى الإمام أبو جعفر بن جرير والحبر أبو محمد بن أبي حاتم في تفسيريهما من حديث يعقوب بن موسى الزمعي عن قائد مولى عبيدالله بن أبي رافع بن إبراهيم بن عبدالرحمن بن أبي ربيعة أخبره أن عائشة زوج النبي صلى الله عليه وآله وسلم أخبرته أن النبي صلي الله عليه وسلم قال \"لو رحم الله من قوم نوح أحدا لرحم أم الصبي\" قال رسول الله صلي الله عليه وسلم \"كان نوح عليه السلام مكث في قومه ألف سنة إلا خمسين عاما يعني وغرس مائة سنة الشجر فعظمت وذهبت كل مذهب ثم قطعها ثم جعلها سفينة ويمرون عليه ويسخرون منه ويقولون تعمل سفينة في البر فكيف تجري ؟ قال سوف تعلمون فلما فرغ ونبع الماء وصار في السكك خشيت أم الصبي عليه وكانت تحبه حبا شديدا فخرجت إلى الجبل حتى بلغت ثلثه فلما بلغها الماء ارتفعت حتى بلغت ثلثيه فلما بلغها الماء خرجت به حتى استوت على الجبل فلما بلغ الماء رقبتها رفعته بيديها فغرقا فلو رحم الله منهم أحدا لرحم أم الصبي\". وهذا حديث غريب من هذا الوجه وقد روى عن كعب الأحبار ومجاهد بن جبير قصة هذا الصبي وأمه بنحو من هذا."
    },
    {
      "ayah": 45,
      "surah": 11,
      "text": "هذا سؤال استعلام وكشف من نوح عليه السلام عن حال ولده الذي غرق \"قال رب إن ابني من أهلي\" أي وقد وعدتني بنجاة أهلي ووعدك الحق الذي لا يخلف فكيف غرق وأنت أحكم الحاكمين ؟."
    },
    {
      "ayah": 46,
      "surah": 11,
      "text": "\"قال يا نوح إنه ليس من أهلك\" أي الذين وعدت إنجاءهم لأني إنما وعدتك بنجاة من آمن من أهلك ولهذا قال وأهلك إلا من سبق عليه القول منهم\" فكان هذا الولد ممن سبق عليه القول بالغرق لكفره ومخالفته أباه نبي الله نوح عليه السلام وقد نص غير واحد من الأئمة على تخطئة من ذهب في تفسير هذا إلى أنه ليس بابنه وإنما كان ابن زنية ويحكى القول بأنه ليس بابنه وإنما كان ابن امرأته عن مجاهد والحسن وعبيد بن عمير وأبي جعفر الباقر وابن جريج واحتج بعضهم بقوله \"إنه عمل غير صالح\" وبقوله \"فخانتاهما\" فممن قاله الحسن البصري احتج بهاتين الآيتين وبعضهم يقول ابن امرأته وهذا يحتمل أن يكون أراد ما أراد الحسن أو أراد أنه نسب إليه مجازا لكونه كان ربيبا عنده فالله أعلم. وقال ابن عباس وغير واحد من السلف ما زنت امرأة نبي قط قال: وقوله \"إنه ليس من أهلك\" أي الذين وعدتك نجاتهم وقول ابن عباس في هذا هو الحق الذي لا محيد عنه فإن الله سبحانه أغير من أن يمكن امرأة نبي من الفاحشة ولهذا غضب الله علي الذين رموا أم المؤمنين عائشة بنت الصديق زوج النبي صلي الله عليه وسلم وأنكر على المؤمنين الذين تكلموا بهذا وأشاعوه ولهذا قال تعالى \"إن الذين جاءوا بالإفك عصبة منكم لا تحسبوه شرا لكم بل هو خير لكم لكل امرئ منهم ما اكتسب من الإثم والذي تولى كبره منهم له عذاب عظيم - إلى قوله - إذ تلقونه بألسنتكم وتقولون بأفواهكم ما ليس لكم به علم وتحسبونه هينا وهو عند الله عظيم. وقال عبدالرزاق أخبرنا معمر عن قتادة وغيره عن عكرمة عن أبن عباس قال: هو ابنه غير أنه خالفه في العمل والنية قال عكرمة في بعض الحروف إنه عمل عملا غير صالح والخيانة تكون على غير باب وقد ورد في الحديث أن رسول الله صلى الله عليه وآله وسلم قرأ بذلك فقال الإمام أحمد. حدثنا يزيد بن هارون حدثنا حماد بن سلمة عن ثابت عن شهر بن حوشب عن أسماء بنت يزيد قالت سمعت رسول الله صلى الله عليه وعلى آله وسلم يقرأ \"إنه عمل غير صالح\" وسمعته يقول \"يا عبادي الذين أسرفوا علي أنفسهم لا تقنطوا من رحمة الله إن الله يغفر الذنوب جميعا\" ولا يبالي \"إنه هو الغفور الرحيم\" وقال أحمد أيضا حدثنا وكيع حدثنا هارون النحوي عن ثابت البناني عن شهر بن حوشب عن أم سلمة أن رسول الله صلي الله عليه وسلم قرأها \"إنه عمل غير صالح\" أعاده أحمد أيضا في مسنده أم سلمة هي أم المؤمنين والظاهر والله أعلم أنها أسماء بنت يزيد فإنها تكنى بذلك أيضا وقال عبدالرزاق أيضا أنا الثوري عن ابن عيينة عن موسى بن أبي عائشة عن سليمان بن قبة قال سمعت ابن عباس سئل وهو إلى جنب الكعبة عن قول الله \"فخانتاهما\" قال أما إنه لم يكن بالزنا ولكن كانت هذه تخبر الناس أنه مجنون وكانت هذه تدل على الأضياف ثم قرأ \"إنه عمل غير صالح\" قال ابن عيينة وأخبرني عمار الذهبي أنه سأل سعيد بن جبير عن ذلك فقال: كان ابن نوح إن الله لا يكذب. قال تعالى \"ونادى نوح ابنه\" قال: وقال بعض العلماء ما فجرت امرأة نبي قط. وكذا روى عن مجاهد أيضا وعكرما والضحاك وميمون بن مهران وثابت بن الحجاج وهو اختيار أبي جعفر بن جرير وهو الصواب الذي لا شك فيه."
    },
    {
      "ayah": 47,
      "surah": 11,
      "text": "\"قال يا نوح إنه ليس من أهلك\" أي الذين وعدت إنجاءهم لأني إنما وعدتك بنجاة من آمن من أهلك ولهذا قال وأهلك إلا من سبق عليه القول منهم\" فكان هذا الولد ممن سبق عليه القول بالغرق لكفره ومخالفته أباه نبي الله نوح عليه السلام وقد نص غير واحد من الأئمة على تخطئة من ذهب في تفسير هذا إلى أنه ليس بابنه وإنما كان ابن زنية ويحكى القول بأنه ليس بابنه وإنما كان ابن امرأته عن مجاهد والحسن وعبيد بن عمير وأبي جعفر الباقر وابن جريج واحتج بعضهم بقوله \"إنه عمل غير صالح\" وبقوله \"فخانتاهما\" فممن قاله الحسن البصري احتج بهاتين الآيتين وبعضهم يقول ابن امرأته وهذا يحتمل أن يكون أراد ما أراد الحسن أو أراد أنه نسب إليه مجازا لكونه كان ربيبا عنده فالله أعلم. وقال ابن عباس وغير واحد من السلف ما زنت امرأة نبي قط قال: وقوله \"إنه ليس من أهلك\" أي الذين وعدتك نجاتهم وقول ابن عباس في هذا هو الحق الذي لا محيد عنه فإن الله سبحانه أغير من أن يمكن امرأة نبي من الفاحشة ولهذا غضب الله علي الذين رموا أم المؤمنين عائشة بنت الصديق زوج النبي صلي الله عليه وسلم وأنكر على المؤمنين الذين تكلموا بهذا وأشاعوه ولهذا قال تعالى \"إن الذين جاءوا بالإفك عصبة منكم لا تحسبوه شرا لكم بل هو خير لكم لكل امرئ منهم ما اكتسب من الإثم والذي تولى كبره منهم له عذاب عظيم - إلى قوله - إذ تلقونه بألسنتكم وتقولون بأفواهكم ما ليس لكم به علم وتحسبونه هينا وهو عند الله عظيم. وقال عبدالرزاق أخبرنا معمر عن قتادة وغيره عن عكرمة عن أبن عباس قال: هو ابنه غير أنه خالفه في العمل والنية قال عكرمة في بعض الحروف إنه عمل عملا غير صالح والخيانة تكون على غير باب وقد ورد في الحديث أن رسول الله صلى الله عليه وآله وسلم قرأ بذلك فقال الإمام أحمد. حدثنا يزيد بن هارون حدثنا حماد بن سلمة عن ثابت عن شهر بن حوشب عن أسماء بنت يزيد قالت سمعت رسول الله صلى الله عليه وعلى آله وسلم يقرأ \"إنه عمل غير صالح\" وسمعته يقول \"يا عبادي الذين أسرفوا علي أنفسهم لا تقنطوا من رحمة الله إن الله يغفر الذنوب جميعا\" ولا يبالي \"إنه هو الغفور الرحيم\" وقال أحمد أيضا حدثنا وكيع حدثنا هارون النحوي عن ثابت البناني عن شهر بن حوشب عن أم سلمة أن رسول الله صلي الله عليه وسلم قرأها \"إنه عمل غير صالح\" أعاده أحمد أيضا في مسنده أم سلمة هي أم المؤمنين والظاهر والله أعلم أنها أسماء بنت يزيد فإنها تكنى بذلك أيضا وقال عبدالرزاق أيضا أنا الثوري عن ابن عيينة عن موسى بن أبي عائشة عن سليمان بن قبة قال سمعت ابن عباس سئل وهو إلى جنب الكعبة عن قول الله \"فخانتاهما\" قال أما إنه لم يكن بالزنا ولكن كانت هذه تخبر الناس أنه مجنون وكانت هذه تدل على الأضياف ثم قرأ \"إنه عمل غير صالح\" قال ابن عيينة وأخبرني عمار الذهبي أنه سأل سعيد بن جبير عن ذلك فقال: كان ابن نوح إن الله لا يكذب. قال تعالى \"ونادى نوح ابنه\" قال: وقال بعض العلماء ما فجرت امرأة نبي قط. وكذا روى عن مجاهد أيضا وعكرما والضحاك وميمون بن مهران وثابت بن الحجاج وهو اختيار أبي جعفر بن جرير وهو الصواب الذي لا شك فيه."
    },
    {
      "ayah": 48,
      "surah": 11,
      "text": "يخبر تعالى عما قيل لنوح عليه السلام حين أرست السفينة على الجودي من السلام عليه وعلى من معه من المؤمنين وعلى كل مؤمن من ذريته إلى يوم القيامة كما قال محمد بن كعب دخل في هذا السلام كل مؤمن ومؤمنة إلى يوم القيامة وكذلك في العذاب والمتاع كل كافر وكافرة إلى يوم القيامة وقال محمد بن إسحاق لما أراد الله أن يكف الطوفان أرسل ريحا على وجه الأرض فسكن الماء وانسدت ينابيع الأرض الغمر الأكبر وأبواب السماء يقول الله تعالى \"وقيل يا أرض ابلعي ماءك\" الآية. فجعل الماء ينقص ويغيض ويدير وكان استواء الفلك على الجودي فيما يزعم أهل التوراة في الشهر السابع لسبع عشرة ليلة مضت منه في أول يوم من الشهر العاشر رأى رؤوس الجبال فلما مضى بعد ذلك أربعون يوما فتح نوح كوة الفلك التي ركب فيها ثم أرسل الغراب لينظر له ما صنع الماء فلم يرجع إليه فأرسل الحمامة فرجعت إليه لم تجد لرجليها موضعا فبسط يده للحمامة فأخذها فأدخلها ثم مضى سبعة أيام ثم أرسلها لتنظر له فرجعت حين أمست وفي فيها ورق زيتون فعلم نوح أن الماء قد قل عن وجه الأرض ثم مكث سبعة أيام ثم أرسلها فلم ترجع فعلم نوح أن الأرض فد برزت فلما كملت السنة فيما بين أن أرسل الله الطوفان إلى أن أرسل نوح الحمامة ودخل يوم واحد من الشهر الأول من سنة اثنتين برز وجه الأرض وظهر البر وكشف نوح غطاء الفلك وفي الشهر الثاني من سنة اثنتين في ست وعشرين ليلة منه \"قيل يا نوح اهبط بسلام منا\" الآية."
    },
    {
      "ayah": 49,
      "surah": 11,
      "text": "يقول تعالى لنبيه صلي الله عليه وسلم هذه القصة وأشباهها \"من أنباء الغيب\" يعني من أخبار الغيوب السالفة نوحيها إليك على وجهها كأنك شاهدها نوحيها إليك أي نعلمك بها وحيا منا إليك \"ما كنت تعلمها أنت ولا قومك من قبل هذا\" أي لم يكن عندك ولا عند أحد من قومك علم بها حتى يقول من يكذبك إنك تعلمتها منه بل أخبرك الله بها مطابقة لما كان عليه الأمر الصحيح كما تشهد به كتب الأنبياء قبلك فاصبر على تكذيب من كذبك من قومك وأذاهم لك فإنا سننصرك ونحوطك بعنايتنا ونجعل العاقبة لك ولأتبعاك في الدنيا والآخرة كما فعلنا بالمرسلين حيث نصرناهم على أعدائهم \"إنا لننصر رسلنا والذين آمنوا\" الآية. وقال تعالى \"ولقد سبقت كلمتنا لعبادنا المرسلين إنهم لهم المنصورون\"الآية. وقال تعالى \"فاصبر إن العاقية للمتقين\"."
    },
    {
      "ayah": 5,
      "surah": 11,
      "text": "قال ابن عباس كانوا يكرهون أن يستقبلوا السماء بفروجهم وحال وقاعهم فأنزل الله هذه الآية روى البخاري من طريق ابن جريج عن محمد بن عباد بن جعفر أن ابن عباس قرأ ألا إنهم تثنوني صدورهم الآية فقلت يا أبا العباس ما تثنوني صدورهم؟ قال الرجل كان يجامع امرأته فيستحي أو يتخلى فيستحي فنزلت \"ألا إنهم تثنوني صدورهم\" وفي لفظ آخر له قال ابن عباس أناس كانوا يستحيون أن يتخلوا فيفضوا إلى السماء وأن يجامعوا نساءهم فيفضوا إلى السماء فنزل ذلك فيهم ثم قال: حدثنا الحميدي حدثنا سفيان حدثنا عمرو قال قرأ ابن عباس \"ألا إنهم تثنوني صدورهم ليستخفوا منه ألا حين يستغشون ثيابهم\" قال البخاري: وقال غيره عن ابن عباس \"يستغشون\" يغطون رؤوسهم وقال ابن عباس في رواية أخرى في تفسير هذه الآية يعني به الشك في الله وعمل السيئات وكذا روى عن مجاهد والحسن وغيرهم أي أنهم كانوا يثنون صدورهم إذا قالوا شيئا أو عملوه فيظنون أنهم يستخفون من الله بذلك فأخبرهم الله تعالى أنهم حين يستغشون ثيابهم عند منامهم في ظلمة الليل \"يعلم ما يسرون\" من القول \"وما يعلنون إنه عليم بذات الصدور\" أي يعلم ما تكن صدورهم من النيات والضمائر والسرائر وما أحسن ما قال زهير بن أبي سلمى في معلقته المشهورة: فلا تكتمن الله ما في قلوبكم ليخفى ومهما يكتم الله يعلم يؤخر فيوضع في كتاب فيدخر ليوم حساب أو يعجل فينقم فقد اعترف هذا الشاعر الجاهلي بوجود الصانع وعلمه بالجزئيات وبالمعاد وبالجزاء وبكتابة الأعمال في الصحف ليوم القيامة وقال عبدالله بن شداد: كان أحدهم إذا مر برسول الله صلي الله عليه وسلم ثنى عنه صدره وغطى رأسه فأنزل الله ذلك وعود الضمير إلى الله أولى لقوله \"ألا حين يستغشون ثيابهم يعلم ما يسرون وما يعلنون\" وقرأ ابن عباس ألا إنهم تثنوني صدورهم يرفع الصدور على الفاعلية وهو قريب المعنى."
    },
    {
      "ayah": 50,
      "surah": 11,
      "text": "يقول تعالى \"و\" لقد أرسلنا \"إلى عاد أخاهم هودا\" آمرا لهم بعبادة الله وحده لا شريك له ناهيا لهم عن الأوثان التي افتروها واختلقوا لها أسماء الآلهة."
    },
    {
      "ayah": 51,
      "surah": 11,
      "text": "وأخبرهم أنه لا يريد منهم أجرة على هذا النصح والبلاغ من الله إنما يبغي ثوابه من الله الذي فطره أفلا تعقلون من يدعوكم إلي ما يصلحكم في الدنيا والآخرة من غير أجرة."
    },
    {
      "ayah": 52,
      "surah": 11,
      "text": "ثم أمرهم بالاستغفار الذي فيه تكفير الذنوب السالفة وبالتوبة عما يستقبلون ومن اتصف بهذه الصفة يسر الله عليه رزقه وسهل عليه أمره وحفظ شأنه ولهذا قال \"يرسل السماء عليكم مدرارا\" وفي الحديث \"من لزم الاستغفار جعل الله له من كل هم فرجا ومن كل ضيق مخرجا ورزقه من حيث لا يحتسب\"."
    },
    {
      "ayah": 53,
      "surah": 11,
      "text": "يخبر تعالى أنهم قالوا لنبيهم \"ما جئتنا ببينة\" أي بحجة وبرهان على ما تدعيه \"وما نحن بتاركي آلهتنا عن قولك\" أي بمجرد قولك اتركوهم نتركهم \"وما نحن لك بمؤمنين\" بمصدقين."
    },
    {
      "ayah": 54,
      "surah": 11,
      "text": "\"إن نقول إلا اعتراك بعض آلهتنا بسوء\" يقولون ما نظن إلا أن بعض الآلهة أصابك بجنون وخبل في عقلك بسبب نهيك عن عبادتها وعيبك لها \"قال إني أشهد الله واشهدوا أني بريء مما تشركون من دونه\" يقول إني بريء من جميع الأنداد والأصنام."
    },
    { "ayah": 55, "surah": 11, "text": "\"فكيدوني جميعا\" أي أنتم وآلهتكم إن كانت حقا \"ثم لا تنظرون\" أي طرفة عين." },
    {
      "ayah": 56,
      "surah": 11,
      "text": "وقوله \"إني توكلت على الله ربي وربكم ما من دابة إلا هو آخذ بناصيتها\" أي تحت قهره وسلطانه وهو الحاكم العادل الذي لا يجور في حكمه فإنه على صراط مستقيم قال الوليد بن مسلم عن صفوان بن عمرو عن أيفع بن عبدالكلاعي أنه قال في قوله تعالى \"ما من دابة إلا هو آخذ بناصيتها إن ربي على صراط مستقيم\" قال فيأخذ بنواصي عباده فيلقن المؤمن حتى يكون له أشفق من الوالد لولده ويقول \"ما غرك بربك الكريم\" وقد تضمن هذا المقام حجة بالغة ودلالة قاطعة على صدق ما جاءهم به وبطلان ما هم عليه من عبادة الأصنام التي لا تنفع ولا تضر بل هي جماد لا تسمع ولا تبصر ولا توالي ولا تعادي وإنما يستحق إخلاص العبادة الله وحده لا شريك له الذي بيده الملك وله التصرف وما من شيء إلا تحت ملكه وقهره وسلطانه فلا إله إلا هو ولا رب سواه."
    },
    {
      "ayah": 57,
      "surah": 11,
      "text": "يقول لهم هود فإن تولوا عما جئتكم به من عبادة الله ربكم وحده لا شريك له فقد قامت عليكم الحجة بإبلاغي إياكم رسالة الله التي بعثني بها \"ويستخلف ربي قوما غيركم\" يعبدونه وحده لا يشركون به ولا يبالي بكم فإنكم لا تضرونه بكفركم بل يعود وبال ذلك عليكم \"إن ربي على كل شيء حفيظ\" أي شاهد وحافظ لأقوال عباده وأفعالهم ويجزيهم عليها إن خيرا فخير وإن شرا فشر."
    },
    {
      "ayah": 58,
      "surah": 11,
      "text": "\"ولما جاء أمرنا\" وهو الريح العقيم فأهلكهم الله عن آخرهم ونجى هودا وأتباعه من عذاب غليظ برحمته تعالى ولطفه."
    },
    {
      "ayah": 59,
      "surah": 11,
      "text": "\"وتلك عاد جحدوا بآيات ربهم\" كفروا بها وعصوا رسل الله وذلك أن من كفر بنبي فقد كفر بجميع الأنبياء لأنه لا فرق بين أحد منهم في وجوب الإيمان به ; فعاد كفروا بهود فنزل كفرهم منزلة من كفر بجميع الرسل \"واتبعوا أمر كل جبار عنيد\" تركوا اتباع رسولهم الرشيد واتبعوا أمر كل جبار عنيد."
    },
    {
      "ayah": 6,
      "surah": 11,
      "text": "أخبر تعالى أنه متكفل بأرزاق المخلوقات من سائر دواب الأرض صغيرها وكبيرها بحريها وبريها وأنه يعلم مستقرها ومستودعها أي يعلم أبن منتهى سيرها في الأرض وأين تأوى إليه من وكرها وهو مستودعها. وقال علي بن أبي طلحة وغيره عن ابن عباس \"ويعلم مستقرها\" أي حيث تأوى \"ومستودعها\" حيث تموت وعن مجاهد \"مستقرها\" في الرحم. \"ومستودعها\" في الصلب كالتي في الأنعام وكذا روى عن ابن عباس والضحاك وجماعة وذكر ابن أبي حاتم أقوال المفسرين ههنا كما ذكره عند تلك الآية فالله أعلم وأن جميع ذلك مكتوب في كتاب عند الله مبين عن جميع ذلك كقوله \"وما من دابه في الأرض ولا طائر يطير بجناحيه إلا أمم أمثالكم ما فرطنا في الكتاب من شئ ثم إلى ربهم يحشرون\" وقوله \"وعنده مفاتح الغيب لا يعلمها إلا هو ويعلم ما في البر والبحر وما تسقط من ورقة إلا يعلمها ولا حبة في ظلمات الأرض ولا رطب ولا يابس إلا في كتاب مبين\"."
    },
    {
      "ayah": 60,
      "surah": 11,
      "text": "فلهذا أتبعوا في هذه الدنيا لعنة من الله ومن عباده المؤمنين كلما ذكروا وينادى عليهم يوم القيامة على رؤوس الأشهاد \"ألا إن عادا كفروا ربهم\" الآية قال السدي ما بعث نبي بعد عاد إلا لعنوا على لسانه."
    },
    {
      "ayah": 61,
      "surah": 11,
      "text": "يقول تعالى \"و\" لقد أرسلنا \"إلى ثمود\" وهم الذين كانوا يسكنون مدائن الحجر بين تبوك والمدينة وكانوا بعد عاد فبعث الله منهم أخاهم صالحا فأمرهم بعبادة الله وحده ولهذا قال \"هو أنشأكم من الأرض\" أي ابتدأ خلقكم منها خلق منها أباكم آدم \"واستعمركم فيها\" أي جعلكم عمارا تعمرونها وتستغلونها \"فاستغفروه\" لسالف ذنوبكم \"ثم توبوا إليه\" فيما تستقبلونه \"إن ربي قريب مجيب\" كما قال تعالى \"وإذا سألك عبادي عني فإني قريب أجيب دعوة الداع إذا دعان\" الآية."
    },
    {
      "ayah": 62,
      "surah": 11,
      "text": "يذكر تعالى ما كان من الكلام بين صالح عليه السلام وبين قومه وما كان عليه قومه من الجهل والعناد في قولهم \"قد كنت فينا مرجوا قبل هذا\" أي كنا نرجوك في عقلك قبل أن تقول ما قلت \"أتنهانا أن نعبد ما يعبد آباؤنا\" وما كان عليه أسلافنا \"وإننا لفي شك مما تدعوك إليه مريب\" أي شك كثير."
    },
    {
      "ayah": 63,
      "surah": 11,
      "text": "\"قال يا قوم أرأيتم إن كنت على بينة من ربي\" فيما أرسلني به إليكم على يقين وبرهان \"وآتاني منه رحمة فمن ينصرني من الله إن عصيته\" وتركت دعوتكم إلى الحق وعبادة الله وحده فلو تركته لما نفعتموني ولما زدتموني \"غير تخسير\" أي خسارة."
    },
    {
      "ayah": 64,
      "surah": 11,
      "text": "قال علماء التفسير والنسب ثمود بن عاثر بن إرم بن سام بن نوح وهو أخو جديس بن عاثر وكذلك قبيلة طسم كل هؤلاء كانوا أحياء من العرب العاربة قبل إبراهيم الخليل عليه السلام وكانت ثمود بعد عاد ومساكنهم مشهورة فيما بين الحجاز والشام إلى وادي القرى وما حوله وقد مر رسول الله صلى الله عليه وسلم على ديارهم ومساكنهم وهو ذاهب إلى تبوك في سنة تسع قال الإمام أحمد حدثنا عبدالصمد حدثنا صخر بن جويرية عن نافع عن ابن عمر قال لما نزل رسول الله صلى الله عليه وسلم بالناس علي تبوك نزل بهم الحجر عند بيوت ثمود فاستقى الناس من الآبار التي كانت تشرب منها ثمود فعجنوا منها ونصبوا لها القدور فأمرهم النبي صلى الله عليه وسلم فأهرقوا القدور وعلفوا العجين الإبل ثم ارتحل بهم حتى نزل بهم على البئر التي كانت تشرب منها الناقة ونهاهم أن يدخلوا علي القوم الذين عذبوا وقال \"إني أخشى أن يصيبكم مثل ما أصابهم فلا تدخلوا عليهم\" وقال أحمد أيضا حدثنا عفان حدثنا عبدالعزيز بن مسلم حدثنا عبدالله بن دينار عن عبدالله بن عمر قال: قال رسول الله صلى الله عليه وسلم وهو بالحجر \"لا تدخلوا على هؤلاء المعذبين إلا أن تكونوا باكين فإن لم تكونوا باكين فلا تدخلوا عليهم أن يصيبكم مثل ما أصابهم\" وأصل هذا الحديث مخرج في الصحيحين من غير وجه وقال الإمام أحمد أيضا حدثنا يزيد بن هارون المسعودي عن إسماعيل بن أوسط عن محمد بن أبي كبشة الأنماري عن أبيه قال لما كان في غزوة تبوك تسارع الناس إلى أهل الحجر يدخلون عليهم فبلغ ذلك رسول الله صلى الله عليه وسلم فنادى في الناس \"الصلاة جامعة\" قال فأتيت رسول الله صلى الله عليه وسلم وهو ممسك بعنزة وهو يقول \"ما تدخلون على قوم غضب الله عليهم \"فناداه رجل منهم نعجب منهم يا رسول الله؟ قال \"أفلا أنبئكم بأعجب من ذلك: رجل من أنفسكم ينبئكم بما كان قبلكم وبما هو كائن بعدكم فاستقيموا وسددوا فإن الله لا يعبأ بعذابكم شيئا وسيأتي قوم لا يدفعون عن أنفسهم شيئا \"لم يخرجه أحد من أصحاب السنن وأبو كبشة اسمه عمر بن سعد ويقال عامر بن سعد والله أعلم وقال الإمام أحمد حدثنا عبدالرزاق حدثنا معمر عن عبدالله بن عثمان بن خيثم عن أبي الزبير عن جابر قال لما مر رسول الله صلى الله عليه وسلم بالحجر قال \"لا تسألوا الآيات فقد سألها قوم صالح فكانت - يعني الناقة - ترد من هذا الفج وتصدر من هذا الفج فعتوا عن أمر ربهم فعقروها وكانت تشرب ماءهم يوما ويشربون لبنها يوما فعقروها فأخذتهم صيحة أخمد الله من تحت أديم السماء منهم إلا رجلا واحدا كان في حرم الله\" فقالوا من هو يا رسول الله قال: أبو رغال فلما خرج من الحرم أصاب ما أصاب قومه\" وهذا الحديث ليس في شيء من الكتب الستة وهو على شرط مسلم. قوله تعالى \"وإلى ثمود\" أي ولقد أرسلنا إلى قبيلة ثمود أخاهم صالحا \"قال يا قوم اعبدوا الله ما لكم من إله غيره\" فجميع الرسل يدعون إلى عبادة الله وحده لا شريك له كما قال تعالى \"وما أرسلنا من قبلك من رسول إلا نوحي إليه أنه لا إله إلا أنا فاعبدون\" وقال \"ولقد بعثنا في كل أمة رسولا أن اعبدوا الله واجتنبوا الطاغوت\" وقوله \"قد جاءتكم بينة من ربكم هذه ناقة الله لكم آية\" أي قد جاءتكم حجة من الله على صدق ما جئتكم به وكانوا هم الذين سألوا صالحا أن يأتيهم بآية واقترحوا عليه بأن تخرج لهم من صخرة صماء عينوها بأنفسهم وهي صخرة منفردة في ناحية الحجر يقال لها الكاتبة فطلبوا منه أن تخرج لهم منها ناقة عشراء تمخض فأخذ عليهم صالح العهود والمواثيق لئن أجابهم الله إلى سؤالهم وأجابهم إلى طلبتهم ليؤمنن به وليتبعنه فلما أعطوه على ذلك عهودهم ومواثيقهم قام صالح عليه السلام إلى صلاته ودعا الله عز وجل فتحركت تلك الصخرة ثم انصدعت عن ناقة جوفاء وبراء يتحرك جنينها بين جنبيها كما سألوا فعند ذلك آمن رئيسهم جندع بن عمرو ومن كان معه على أمره وأراد بقية أشراف ثمود أن يؤمنوا فصدهم ذؤاب بن عمرو بن لبيد والحباب صاحب أوثانهم ورباب بن صعر بن جلهس وكان جندع بن عمرو بن عم له شهاب بن خليفة بن محلاة بن لبيد بن حراس وكان من أشراف ثمود وأفاضلها فأراد أن يسلم أيضا فنهاه أولئك الرهط فأطاعهم فقال في ذلك رجل من مؤمني ثمود يقال له مهوش بن عثمة بن الدميل رحمه الله. وكانت عصبة من آل عمرو إلى دين النبي دعوا شهابا عزيز ثمود كلهم جميعا فهم بأن يجيب فلو أجابا لأصبح صالح فينا عزيزا وما عدلوا بصاحبهم ذؤابا ولكن الغواة من آل حجر تولوا بعد رشدهم ذيابا وأقامت الناقة وفصيلها بعد ما وضعته بين أظهرهم مدة تشرب من بئرها يوما وتدعه لهم يوما وكانوا يشربون لبنها يوم شربها يحتلبونها فيملؤن ما شاء من أوعيتهم وأوانيهم كما قال في الآية الأخرى \"ونبئهم أن الماء قسمة بينهم كل شرب محتضر\" وقال تعالى \"هذه ناقة لها شرب ولكم شرب يوم معلوم\" وكانت تسرح في بعض تلك الأودية ترد من فج وتصدر من غيره ليسعها لأنها كانت تتضلع من الماء وكانت على ما ذكر خلقا هائلا ومنظرا رائعا إذا مرت بأنعامهم نفرت منها فلما طال عليهم واشتد تكذيبهم لصالح النبي عليه السلام عزموا على قتلها ليستأثروا بالماء كل يوم فيقال إنهم اتفقوا كلهم على قتلها قال قتادة بلغني أن الذي قتلها طاف عليهم كلهم أنهم راضون بقتلها حتى على النساء في خدورهن وعلى الصبيان قلت وهذا هو الظاهر لقوله تعالى \"فكذبوه فعقروها فدمدم عليهم ربهم بذنبهم فسواها\" وقال \"وآتينا ثمود الناقة مبصرة فظلموا بها\" وقال \"فعقروا الناقة\" فأسند ذلك على مجموع القبيلة فدل على رضى جميعهم بذلك والله أعلم وذكر الإمام أبو جعفر بن جرير وغيره من علماء التفسير أن سبب قتلها أن امرأة منهم يقال لها عنيزة ابنة غنم بن مجلز وتكنى أم عثمان كانت عجوزا كافرة وكانت من أشد الناس عداوة لصالح عليه السلام وكانت لها بنات حسان ومال جزيل وكان زوجها ذؤاب بن عمرو أحد رؤساء ثمود وامرأة أخرى يقال لها صدقة بنت المحيا بن زهير بن المختار ذات حسب ومال وجمال وكانت تحت رجل مسلم من ثمود ففارقته فكانتا تجعلان لمن التزم لهما بقتل الناقة فدعت صدقة رجلا يقال له الحباب فعرضت عليه نفسها إن هو عقر الناقي فأبى عليها فدعت ابن عم لها يقال له مصدع بن مهرج بن المحيا فأجابها إلى ذلك ودعت عنيزة بنت غنم قدار بن سالف بن جذع وكان رجلا أحمر أزرق قصيرا يزعمون أنه كان ولد زنية وأنه لم يكن من أبيه الذي ينسب إليه وهو سالف وإنما هو من رجل يقال له صهياد ولكن ولد على فراش سالف وقالت له أعطيك أي بناتي شئت على أن تعقر الناقة فعند ذلك انطلق قدار بن سالف ومصدع بن مهرج فاستغويا غواة من ثمود فاتبعهما سبعة نفر فصاروا تسعة رهط وهم الذين قال الله تعالى \"وكان في المدينة تسعة رهط يفسدون في الأرض ولا يصلحون\" وكانوا رؤساء في قومهم فاستمالوا القبيلة الكافرة بكمالها فطاوعتهم على ذلك فانطلقوا فرصدوا الناقة حين صدرت من الماء وقد كمن لها قدار بن سالف في أصل صخرة على طريقها وكمن لها مصدع في أصل أخرى فمرت على مصدع فرماها بسهم فانتظم به عضلة ساقها وخرجت بنت غنم عنيزة وأمرت ابنتها وكانت من أحسن الناس وجها فسفرت عن وجهها لقدار وزمرته وشد عليها قدار بالسيف فكشف عن عرقوبها فخرجت ساقطة إلى الأرض ورغت رغاة واحدة تحذر سقبها ثم طعن في لبتها فنحرها وانطلق سقبها وهو فصيلها حتى أتى جبلا منيعا فصعد أعلى صخرة فيه ورغا فروى عبدالرزاق عن معمر عمن سمع الحسن البصري أنه قال يا رب أين أمي ويقال أنه رغا ثلات مرات وأنه دخل في صخرة فغاب فيها ويقال إنهم اتبعوه فعقروه مع أمه فالله أعلم. فلما فعلوا ذلك وفرغوا من عقر الناقة وبلغ الخبر صالحا عليه السلام فجاءهم وهم مجتمعون فلما رأى الناقة بكى وقال \"تمتعوا في داركم ثلاثة أيام\" الآية. وكان قتلهم الناقة يوم الأربعاء فلما أمسى أولئك التسعة الرهط عزموا على قتل صالح وقالوا إن كان صادقا عجلناه قبلنا وإن كان كاذبا ألحقناه بناقته \"قالوا تقاسموا بالله لنبيتنه وأهله ثم لنقولن لوليه ما شهدنا مهلك أهله وإنا لصادقون ومكروا مكرا ومكرنا مكرا وهم لا يشعرون فانظر كيف كان عاقبة مكرهم\" الآية. فلما عزموا على ذلك وتواطئوا عليه وجاءوا من الليل ليفتكوا بنبي الله فأرسل الله سبحانه وتعالى وله العزة ولرسوله عليهم حجارة فرضختهم سلفا وتعجيلا قبل قومهم وأصبح ثمود يوم الخميس وهو اليوم الأول من أيام النظرة ووجوههم مصفرة كما وعدهم صالح عليه السلام وأصبحوا في اليوم الثاني من أيام التأجيل وهو يوم الجمعة ووجوههم محمرة وأصبحوا في اليوم الثالث من أيام المتاع وهو يوم السبت ووجوههم مسودة فلما أصبحوا من يوم الأحد وقد تحنطوا وقعدوا ينتظرون نقمة الله وعذابه عياذا بالله من ذلك لا يدرون ماذا يفعل بهم ولا كيف يأتيهم العذاب وأشرقت الشمس جاءتهم صيحة من السماء ورجفة شديدة من أسفل منهم ففاضت الأرواح وزهقت النفوس في ساعة واحدة."
    },
    {
      "ayah": 65,
      "surah": 11,
      "text": "قال علماء التفسير والنسب ثمود بن عاثر بن إرم بن سام بن نوح وهو أخو جديس بن عاثر وكذلك قبيلة طسم كل هؤلاء كانوا أحياء من العرب العاربة قبل إبراهيم الخليل عليه السلام وكانت ثمود بعد عاد ومساكنهم مشهورة فيما بين الحجاز والشام إلى وادي القرى وما حوله وقد مر رسول الله صلى الله عليه وسلم على ديارهم ومساكنهم وهو ذاهب إلى تبوك في سنة تسع قال الإمام أحمد حدثنا عبدالصمد حدثنا صخر بن جويرية عن نافع عن ابن عمر قال لما نزل رسول الله صلى الله عليه وسلم بالناس علي تبوك نزل بهم الحجر عند بيوت ثمود فاستقى الناس من الآبار التي كانت تشرب منها ثمود فعجنوا منها ونصبوا لها القدور فأمرهم النبي صلى الله عليه وسلم فأهرقوا القدور وعلفوا العجين الإبل ثم ارتحل بهم حتى نزل بهم على البئر التي كانت تشرب منها الناقة ونهاهم أن يدخلوا علي القوم الذين عذبوا وقال \"إني أخشى أن يصيبكم مثل ما أصابهم فلا تدخلوا عليهم\" وقال أحمد أيضا حدثنا عفان حدثنا عبدالعزيز بن مسلم حدثنا عبدالله بن دينار عن عبدالله بن عمر قال: قال رسول الله صلى الله عليه وسلم وهو بالحجر \"لا تدخلوا على هؤلاء المعذبين إلا أن تكونوا باكين فإن لم تكونوا باكين فلا تدخلوا عليهم أن يصيبكم مثل ما أصابهم\" وأصل هذا الحديث مخرج في الصحيحين من غير وجه وقال الإمام أحمد أيضا حدثنا يزيد بن هارون المسعودي عن إسماعيل بن أوسط عن محمد بن أبي كبشة الأنماري عن أبيه قال لما كان في غزوة تبوك تسارع الناس إلى أهل الحجر يدخلون عليهم فبلغ ذلك رسول الله صلى الله عليه وسلم فنادى في الناس \"الصلاة جامعة\" قال فأتيت رسول الله صلى الله عليه وسلم وهو ممسك بعنزة وهو يقول \"ما تدخلون على قوم غضب الله عليهم \"فناداه رجل منهم نعجب منهم يا رسول الله؟ قال \"أفلا أنبئكم بأعجب من ذلك: رجل من أنفسكم ينبئكم بما كان قبلكم وبما هو كائن بعدكم فاستقيموا وسددوا فإن الله لا يعبأ بعذابكم شيئا وسيأتي قوم لا يدفعون عن أنفسهم شيئا \"لم يخرجه أحد من أصحاب السنن وأبو كبشة اسمه عمر بن سعد ويقال عامر بن سعد والله أعلم وقال الإمام أحمد حدثنا عبدالرزاق حدثنا معمر عن عبدالله بن عثمان بن خيثم عن أبي الزبير عن جابر قال لما مر رسول الله صلى الله عليه وسلم بالحجر قال \"لا تسألوا الآيات فقد سألها قوم صالح فكانت - يعني الناقة - ترد من هذا الفج وتصدر من هذا الفج فعتوا عن أمر ربهم فعقروها وكانت تشرب ماءهم يوما ويشربون لبنها يوما فعقروها فأخذتهم صيحة أخمد الله من تحت أديم السماء منهم إلا رجلا واحدا كان في حرم الله\" فقالوا من هو يا رسول الله قال: أبو رغال فلما خرج من الحرم أصاب ما أصاب قومه\" وهذا الحديث ليس في شيء من الكتب الستة وهو على شرط مسلم. قوله تعالى \"وإلى ثمود\" أي ولقد أرسلنا إلى قبيلة ثمود أخاهم صالحا \"قال يا قوم اعبدوا الله ما لكم من إله غيره\" فجميع الرسل يدعون إلى عبادة الله وحده لا شريك له كما قال تعالى \"وما أرسلنا من قبلك من رسول إلا نوحي إليه أنه لا إله إلا أنا فاعبدون\" وقال \"ولقد بعثنا في كل أمة رسولا أن اعبدوا الله واجتنبوا الطاغوت\" وقوله \"قد جاءتكم بينة من ربكم هذه ناقة الله لكم آية\" أي قد جاءتكم حجة من الله على صدق ما جئتكم به وكانوا هم الذين سألوا صالحا أن يأتيهم بآية واقترحوا عليه بأن تخرج لهم من صخرة صماء عينوها بأنفسهم وهي صخرة منفردة في ناحية الحجر يقال لها الكاتبة فطلبوا منه أن تخرج لهم منها ناقة عشراء تمخض فأخذ عليهم صالح العهود والمواثيق لئن أجابهم الله إلى سؤالهم وأجابهم إلى طلبتهم ليؤمنن به وليتبعنه فلما أعطوه على ذلك عهودهم ومواثيقهم قام صالح عليه السلام إلى صلاته ودعا الله عز وجل فتحركت تلك الصخرة ثم انصدعت عن ناقة جوفاء وبراء يتحرك جنينها بين جنبيها كما سألوا فعند ذلك آمن رئيسهم جندع بن عمرو ومن كان معه على أمره وأراد بقية أشراف ثمود أن يؤمنوا فصدهم ذؤاب بن عمرو بن لبيد والحباب صاحب أوثانهم ورباب بن صعر بن جلهس وكان جندع بن عمرو بن عم له شهاب بن خليفة بن محلاة بن لبيد بن حراس وكان من أشراف ثمود وأفاضلها فأراد أن يسلم أيضا فنهاه أولئك الرهط فأطاعهم فقال في ذلك رجل من مؤمني ثمود يقال له مهوش بن عثمة بن الدميل رحمه الله. وكانت عصبة من آل عمرو إلى دين النبي دعوا شهابا عزيز ثمود كلهم جميعا فهم بأن يجيب فلو أجابا لأصبح صالح فينا عزيزا وما عدلوا بصاحبهم ذؤابا ولكن الغواة من آل حجر تولوا بعد رشدهم ذيابا وأقامت الناقة وفصيلها بعد ما وضعته بين أظهرهم مدة تشرب من بئرها يوما وتدعه لهم يوما وكانوا يشربون لبنها يوم شربها يحتلبونها فيملؤن ما شاء من أوعيتهم وأوانيهم كما قال في الآية الأخرى \"ونبئهم أن الماء قسمة بينهم كل شرب محتضر\" وقال تعالى \"هذه ناقة لها شرب ولكم شرب يوم معلوم\" وكانت تسرح في بعض تلك الأودية ترد من فج وتصدر من غيره ليسعها لأنها كانت تتضلع من الماء وكانت على ما ذكر خلقا هائلا ومنظرا رائعا إذا مرت بأنعامهم نفرت منها فلما طال عليهم واشتد تكذيبهم لصالح النبي عليه السلام عزموا على قتلها ليستأثروا بالماء كل يوم فيقال إنهم اتفقوا كلهم على قتلها قال قتادة بلغني أن الذي قتلها طاف عليهم كلهم أنهم راضون بقتلها حتى على النساء في خدورهن وعلى الصبيان قلت وهذا هو الظاهر لقوله تعالى \"فكذبوه فعقروها فدمدم عليهم ربهم بذنبهم فسواها\" وقال \"وآتينا ثمود الناقة مبصرة فظلموا بها\" وقال \"فعقروا الناقة\" فأسند ذلك على مجموع القبيلة فدل على رضى جميعهم بذلك والله أعلم وذكر الإمام أبو جعفر بن جرير وغيره من علماء التفسير أن سبب قتلها أن امرأة منهم يقال لها عنيزة ابنة غنم بن مجلز وتكنى أم عثمان كانت عجوزا كافرة وكانت من أشد الناس عداوة لصالح عليه السلام وكانت لها بنات حسان ومال جزيل وكان زوجها ذؤاب بن عمرو أحد رؤساء ثمود وامرأة أخرى يقال لها صدقة بنت المحيا بن زهير بن المختار ذات حسب ومال وجمال وكانت تحت رجل مسلم من ثمود ففارقته فكانتا تجعلان لمن التزم لهما بقتل الناقة فدعت صدقة رجلا يقال له الحباب فعرضت عليه نفسها إن هو عقر الناقي فأبى عليها فدعت ابن عم لها يقال له مصدع بن مهرج بن المحيا فأجابها إلى ذلك ودعت عنيزة بنت غنم قدار بن سالف بن جذع وكان رجلا أحمر أزرق قصيرا يزعمون أنه كان ولد زنية وأنه لم يكن من أبيه الذي ينسب إليه وهو سالف وإنما هو من رجل يقال له صهياد ولكن ولد على فراش سالف وقالت له أعطيك أي بناتي شئت على أن تعقر الناقة فعند ذلك انطلق قدار بن سالف ومصدع بن مهرج فاستغويا غواة من ثمود فاتبعهما سبعة نفر فصاروا تسعة رهط وهم الذين قال الله تعالى \"وكان في المدينة تسعة رهط يفسدون في الأرض ولا يصلحون\" وكانوا رؤساء في قومهم فاستمالوا القبيلة الكافرة بكمالها فطاوعتهم على ذلك فانطلقوا فرصدوا الناقة حين صدرت من الماء وقد كمن لها قدار بن سالف في أصل صخرة على طريقها وكمن لها مصدع في أصل أخرى فمرت على مصدع فرماها بسهم فانتظم به عضلة ساقها وخرجت بنت غنم عنيزة وأمرت ابنتها وكانت من أحسن الناس وجها فسفرت عن وجهها لقدار وزمرته وشد عليها قدار بالسيف فكشف عن عرقوبها فخرجت ساقطة إلى الأرض ورغت رغاة واحدة تحذر سقبها ثم طعن في لبتها فنحرها وانطلق سقبها وهو فصيلها حتى أتى جبلا منيعا فصعد أعلى صخرة فيه ورغا فروى عبدالرزاق عن معمر عمن سمع الحسن البصري أنه قال يا رب أين أمي ويقال أنه رغا ثلات مرات وأنه دخل في صخرة فغاب فيها ويقال إنهم اتبعوه فعقروه مع أمه فالله أعلم. فلما فعلوا ذلك وفرغوا من عقر الناقة وبلغ الخبر صالحا عليه السلام فجاءهم وهم مجتمعون فلما رأى الناقة بكى وقال \"تمتعوا في داركم ثلاثة أيام\" الآية. وكان قتلهم الناقة يوم الأربعاء فلما أمسى أولئك التسعة الرهط عزموا على قتل صالح وقالوا إن كان صادقا عجلناه قبلنا وإن كان كاذبا ألحقناه بناقته \"قالوا تقاسموا بالله لنبيتنه وأهله ثم لنقولن لوليه ما شهدنا مهلك أهله وإنا لصادقون ومكروا مكرا ومكرنا مكرا وهم لا يشعرون فانظر كيف كان عاقبة مكرهم\" الآية. فلما عزموا على ذلك وتواطئوا عليه وجاءوا من الليل ليفتكوا بنبي الله فأرسل الله سبحانه وتعالى وله العزة ولرسوله عليهم حجارة فرضختهم سلفا وتعجيلا قبل قومهم وأصبح ثمود يوم الخميس وهو اليوم الأول من أيام النظرة ووجوههم مصفرة كما وعدهم صالح عليه السلام وأصبحوا في اليوم الثاني من أيام التأجيل وهو يوم الجمعة ووجوههم محمرة وأصبحوا في اليوم الثالث من أيام المتاع وهو يوم السبت ووجوههم مسودة فلما أصبحوا من يوم الأحد وقد تحنطوا وقعدوا ينتظرون نقمة الله وعذابه عياذا بالله من ذلك لا يدرون ماذا يفعل بهم ولا كيف يأتيهم العذاب وأشرقت الشمس جاءتهم صيحة من السماء ورجفة شديدة من أسفل منهم ففاضت الأرواح وزهقت النفوس في ساعة واحدة."
    },
    {
      "ayah": 66,
      "surah": 11,
      "text": "قال علماء التفسير والنسب ثمود بن عاثر بن إرم بن سام بن نوح وهو أخو جديس بن عاثر وكذلك قبيلة طسم كل هؤلاء كانوا أحياء من العرب العاربة قبل إبراهيم الخليل عليه السلام وكانت ثمود بعد عاد ومساكنهم مشهورة فيما بين الحجاز والشام إلى وادي القرى وما حوله وقد مر رسول الله صلى الله عليه وسلم على ديارهم ومساكنهم وهو ذاهب إلى تبوك في سنة تسع قال الإمام أحمد حدثنا عبدالصمد حدثنا صخر بن جويرية عن نافع عن ابن عمر قال لما نزل رسول الله صلى الله عليه وسلم بالناس علي تبوك نزل بهم الحجر عند بيوت ثمود فاستقى الناس من الآبار التي كانت تشرب منها ثمود فعجنوا منها ونصبوا لها القدور فأمرهم النبي صلى الله عليه وسلم فأهرقوا القدور وعلفوا العجين الإبل ثم ارتحل بهم حتى نزل بهم على البئر التي كانت تشرب منها الناقة ونهاهم أن يدخلوا علي القوم الذين عذبوا وقال \"إني أخشى أن يصيبكم مثل ما أصابهم فلا تدخلوا عليهم\" وقال أحمد أيضا حدثنا عفان حدثنا عبدالعزيز بن مسلم حدثنا عبدالله بن دينار عن عبدالله بن عمر قال: قال رسول الله صلى الله عليه وسلم وهو بالحجر \"لا تدخلوا على هؤلاء المعذبين إلا أن تكونوا باكين فإن لم تكونوا باكين فلا تدخلوا عليهم أن يصيبكم مثل ما أصابهم\" وأصل هذا الحديث مخرج في الصحيحين من غير وجه وقال الإمام أحمد أيضا حدثنا يزيد بن هارون المسعودي عن إسماعيل بن أوسط عن محمد بن أبي كبشة الأنماري عن أبيه قال لما كان في غزوة تبوك تسارع الناس إلى أهل الحجر يدخلون عليهم فبلغ ذلك رسول الله صلى الله عليه وسلم فنادى في الناس \"الصلاة جامعة\" قال فأتيت رسول الله صلى الله عليه وسلم وهو ممسك بعنزة وهو يقول \"ما تدخلون على قوم غضب الله عليهم \"فناداه رجل منهم نعجب منهم يا رسول الله؟ قال \"أفلا أنبئكم بأعجب من ذلك: رجل من أنفسكم ينبئكم بما كان قبلكم وبما هو كائن بعدكم فاستقيموا وسددوا فإن الله لا يعبأ بعذابكم شيئا وسيأتي قوم لا يدفعون عن أنفسهم شيئا \"لم يخرجه أحد من أصحاب السنن وأبو كبشة اسمه عمر بن سعد ويقال عامر بن سعد والله أعلم وقال الإمام أحمد حدثنا عبدالرزاق حدثنا معمر عن عبدالله بن عثمان بن خيثم عن أبي الزبير عن جابر قال لما مر رسول الله صلى الله عليه وسلم بالحجر قال \"لا تسألوا الآيات فقد سألها قوم صالح فكانت - يعني الناقة - ترد من هذا الفج وتصدر من هذا الفج فعتوا عن أمر ربهم فعقروها وكانت تشرب ماءهم يوما ويشربون لبنها يوما فعقروها فأخذتهم صيحة أخمد الله من تحت أديم السماء منهم إلا رجلا واحدا كان في حرم الله\" فقالوا من هو يا رسول الله قال: أبو رغال فلما خرج من الحرم أصاب ما أصاب قومه\" وهذا الحديث ليس في شيء من الكتب الستة وهو على شرط مسلم. قوله تعالى \"وإلى ثمود\" أي ولقد أرسلنا إلى قبيلة ثمود أخاهم صالحا \"قال يا قوم اعبدوا الله ما لكم من إله غيره\" فجميع الرسل يدعون إلى عبادة الله وحده لا شريك له كما قال تعالى \"وما أرسلنا من قبلك من رسول إلا نوحي إليه أنه لا إله إلا أنا فاعبدون\" وقال \"ولقد بعثنا في كل أمة رسولا أن اعبدوا الله واجتنبوا الطاغوت\" وقوله \"قد جاءتكم بينة من ربكم هذه ناقة الله لكم آية\" أي قد جاءتكم حجة من الله على صدق ما جئتكم به وكانوا هم الذين سألوا صالحا أن يأتيهم بآية واقترحوا عليه بأن تخرج لهم من صخرة صماء عينوها بأنفسهم وهي صخرة منفردة في ناحية الحجر يقال لها الكاتبة فطلبوا منه أن تخرج لهم منها ناقة عشراء تمخض فأخذ عليهم صالح العهود والمواثيق لئن أجابهم الله إلى سؤالهم وأجابهم إلى طلبتهم ليؤمنن به وليتبعنه فلما أعطوه على ذلك عهودهم ومواثيقهم قام صالح عليه السلام إلى صلاته ودعا الله عز وجل فتحركت تلك الصخرة ثم انصدعت عن ناقة جوفاء وبراء يتحرك جنينها بين جنبيها كما سألوا فعند ذلك آمن رئيسهم جندع بن عمرو ومن كان معه على أمره وأراد بقية أشراف ثمود أن يؤمنوا فصدهم ذؤاب بن عمرو بن لبيد والحباب صاحب أوثانهم ورباب بن صعر بن جلهس وكان جندع بن عمرو بن عم له شهاب بن خليفة بن محلاة بن لبيد بن حراس وكان من أشراف ثمود وأفاضلها فأراد أن يسلم أيضا فنهاه أولئك الرهط فأطاعهم فقال في ذلك رجل من مؤمني ثمود يقال له مهوش بن عثمة بن الدميل رحمه الله. وكانت عصبة من آل عمرو إلى دين النبي دعوا شهابا عزيز ثمود كلهم جميعا فهم بأن يجيب فلو أجابا لأصبح صالح فينا عزيزا وما عدلوا بصاحبهم ذؤابا ولكن الغواة من آل حجر تولوا بعد رشدهم ذيابا وأقامت الناقة وفصيلها بعد ما وضعته بين أظهرهم مدة تشرب من بئرها يوما وتدعه لهم يوما وكانوا يشربون لبنها يوم شربها يحتلبونها فيملؤن ما شاء من أوعيتهم وأوانيهم كما قال في الآية الأخرى \"ونبئهم أن الماء قسمة بينهم كل شرب محتضر\" وقال تعالى \"هذه ناقة لها شرب ولكم شرب يوم معلوم\" وكانت تسرح في بعض تلك الأودية ترد من فج وتصدر من غيره ليسعها لأنها كانت تتضلع من الماء وكانت على ما ذكر خلقا هائلا ومنظرا رائعا إذا مرت بأنعامهم نفرت منها فلما طال عليهم واشتد تكذيبهم لصالح النبي عليه السلام عزموا على قتلها ليستأثروا بالماء كل يوم فيقال إنهم اتفقوا كلهم على قتلها قال قتادة بلغني أن الذي قتلها طاف عليهم كلهم أنهم راضون بقتلها حتى على النساء في خدورهن وعلى الصبيان قلت وهذا هو الظاهر لقوله تعالى \"فكذبوه فعقروها فدمدم عليهم ربهم بذنبهم فسواها\" وقال \"وآتينا ثمود الناقة مبصرة فظلموا بها\" وقال \"فعقروا الناقة\" فأسند ذلك على مجموع القبيلة فدل على رضى جميعهم بذلك والله أعلم وذكر الإمام أبو جعفر بن جرير وغيره من علماء التفسير أن سبب قتلها أن امرأة منهم يقال لها عنيزة ابنة غنم بن مجلز وتكنى أم عثمان كانت عجوزا كافرة وكانت من أشد الناس عداوة لصالح عليه السلام وكانت لها بنات حسان ومال جزيل وكان زوجها ذؤاب بن عمرو أحد رؤساء ثمود وامرأة أخرى يقال لها صدقة بنت المحيا بن زهير بن المختار ذات حسب ومال وجمال وكانت تحت رجل مسلم من ثمود ففارقته فكانتا تجعلان لمن التزم لهما بقتل الناقة فدعت صدقة رجلا يقال له الحباب فعرضت عليه نفسها إن هو عقر الناقي فأبى عليها فدعت ابن عم لها يقال له مصدع بن مهرج بن المحيا فأجابها إلى ذلك ودعت عنيزة بنت غنم قدار بن سالف بن جذع وكان رجلا أحمر أزرق قصيرا يزعمون أنه كان ولد زنية وأنه لم يكن من أبيه الذي ينسب إليه وهو سالف وإنما هو من رجل يقال له صهياد ولكن ولد على فراش سالف وقالت له أعطيك أي بناتي شئت على أن تعقر الناقة فعند ذلك انطلق قدار بن سالف ومصدع بن مهرج فاستغويا غواة من ثمود فاتبعهما سبعة نفر فصاروا تسعة رهط وهم الذين قال الله تعالى \"وكان في المدينة تسعة رهط يفسدون في الأرض ولا يصلحون\" وكانوا رؤساء في قومهم فاستمالوا القبيلة الكافرة بكمالها فطاوعتهم على ذلك فانطلقوا فرصدوا الناقة حين صدرت من الماء وقد كمن لها قدار بن سالف في أصل صخرة على طريقها وكمن لها مصدع في أصل أخرى فمرت على مصدع فرماها بسهم فانتظم به عضلة ساقها وخرجت بنت غنم عنيزة وأمرت ابنتها وكانت من أحسن الناس وجها فسفرت عن وجهها لقدار وزمرته وشد عليها قدار بالسيف فكشف عن عرقوبها فخرجت ساقطة إلى الأرض ورغت رغاة واحدة تحذر سقبها ثم طعن في لبتها فنحرها وانطلق سقبها وهو فصيلها حتى أتى جبلا منيعا فصعد أعلى صخرة فيه ورغا فروى عبدالرزاق عن معمر عمن سمع الحسن البصري أنه قال يا رب أين أمي ويقال أنه رغا ثلات مرات وأنه دخل في صخرة فغاب فيها ويقال إنهم اتبعوه فعقروه مع أمه فالله أعلم. فلما فعلوا ذلك وفرغوا من عقر الناقة وبلغ الخبر صالحا عليه السلام فجاءهم وهم مجتمعون فلما رأى الناقة بكى وقال \"تمتعوا في داركم ثلاثة أيام\" الآية. وكان قتلهم الناقة يوم الأربعاء فلما أمسى أولئك التسعة الرهط عزموا على قتل صالح وقالوا إن كان صادقا عجلناه قبلنا وإن كان كاذبا ألحقناه بناقته \"قالوا تقاسموا بالله لنبيتنه وأهله ثم لنقولن لوليه ما شهدنا مهلك أهله وإنا لصادقون ومكروا مكرا ومكرنا مكرا وهم لا يشعرون فانظر كيف كان عاقبة مكرهم\" الآية. فلما عزموا على ذلك وتواطئوا عليه وجاءوا من الليل ليفتكوا بنبي الله فأرسل الله سبحانه وتعالى وله العزة ولرسوله عليهم حجارة فرضختهم سلفا وتعجيلا قبل قومهم وأصبح ثمود يوم الخميس وهو اليوم الأول من أيام النظرة ووجوههم مصفرة كما وعدهم صالح عليه السلام وأصبحوا في اليوم الثاني من أيام التأجيل وهو يوم الجمعة ووجوههم محمرة وأصبحوا في اليوم الثالث من أيام المتاع وهو يوم السبت ووجوههم مسودة فلما أصبحوا من يوم الأحد وقد تحنطوا وقعدوا ينتظرون نقمة الله وعذابه عياذا بالله من ذلك لا يدرون ماذا يفعل بهم ولا كيف يأتيهم العذاب وأشرقت الشمس جاءتهم صيحة من السماء ورجفة شديدة من أسفل منهم ففاضت الأرواح وزهقت النفوس في ساعة واحدة."
    },
    {
      "ayah": 67,
      "surah": 11,
      "text": "قال علماء التفسير والنسب ثمود بن عاثر بن إرم بن سام بن نوح وهو أخو جديس بن عاثر وكذلك قبيلة طسم كل هؤلاء كانوا أحياء من العرب العاربة قبل إبراهيم الخليل عليه السلام وكانت ثمود بعد عاد ومساكنهم مشهورة فيما بين الحجاز والشام إلى وادي القرى وما حوله وقد مر رسول الله صلى الله عليه وسلم على ديارهم ومساكنهم وهو ذاهب إلى تبوك في سنة تسع قال الإمام أحمد حدثنا عبدالصمد حدثنا صخر بن جويرية عن نافع عن ابن عمر قال لما نزل رسول الله صلى الله عليه وسلم بالناس علي تبوك نزل بهم الحجر عند بيوت ثمود فاستقى الناس من الآبار التي كانت تشرب منها ثمود فعجنوا منها ونصبوا لها القدور فأمرهم النبي صلى الله عليه وسلم فأهرقوا القدور وعلفوا العجين الإبل ثم ارتحل بهم حتى نزل بهم على البئر التي كانت تشرب منها الناقة ونهاهم أن يدخلوا علي القوم الذين عذبوا وقال \"إني أخشى أن يصيبكم مثل ما أصابهم فلا تدخلوا عليهم\" وقال أحمد أيضا حدثنا عفان حدثنا عبدالعزيز بن مسلم حدثنا عبدالله بن دينار عن عبدالله بن عمر قال: قال رسول الله صلى الله عليه وسلم وهو بالحجر \"لا تدخلوا على هؤلاء المعذبين إلا أن تكونوا باكين فإن لم تكونوا باكين فلا تدخلوا عليهم أن يصيبكم مثل ما أصابهم\" وأصل هذا الحديث مخرج في الصحيحين من غير وجه وقال الإمام أحمد أيضا حدثنا يزيد بن هارون المسعودي عن إسماعيل بن أوسط عن محمد بن أبي كبشة الأنماري عن أبيه قال لما كان في غزوة تبوك تسارع الناس إلى أهل الحجر يدخلون عليهم فبلغ ذلك رسول الله صلى الله عليه وسلم فنادى في الناس \"الصلاة جامعة\" قال فأتيت رسول الله صلى الله عليه وسلم وهو ممسك بعنزة وهو يقول \"ما تدخلون على قوم غضب الله عليهم \"فناداه رجل منهم نعجب منهم يا رسول الله؟ قال \"أفلا أنبئكم بأعجب من ذلك: رجل من أنفسكم ينبئكم بما كان قبلكم وبما هو كائن بعدكم فاستقيموا وسددوا فإن الله لا يعبأ بعذابكم شيئا وسيأتي قوم لا يدفعون عن أنفسهم شيئا \"لم يخرجه أحد من أصحاب السنن وأبو كبشة اسمه عمر بن سعد ويقال عامر بن سعد والله أعلم وقال الإمام أحمد حدثنا عبدالرزاق حدثنا معمر عن عبدالله بن عثمان بن خيثم عن أبي الزبير عن جابر قال لما مر رسول الله صلى الله عليه وسلم بالحجر قال \"لا تسألوا الآيات فقد سألها قوم صالح فكانت - يعني الناقة - ترد من هذا الفج وتصدر من هذا الفج فعتوا عن أمر ربهم فعقروها وكانت تشرب ماءهم يوما ويشربون لبنها يوما فعقروها فأخذتهم صيحة أخمد الله من تحت أديم السماء منهم إلا رجلا واحدا كان في حرم الله\" فقالوا من هو يا رسول الله قال: أبو رغال فلما خرج من الحرم أصاب ما أصاب قومه\" وهذا الحديث ليس في شيء من الكتب الستة وهو على شرط مسلم. قوله تعالى \"وإلى ثمود\" أي ولقد أرسلنا إلى قبيلة ثمود أخاهم صالحا \"قال يا قوم اعبدوا الله ما لكم من إله غيره\" فجميع الرسل يدعون إلى عبادة الله وحده لا شريك له كما قال تعالى \"وما أرسلنا من قبلك من رسول إلا نوحي إليه أنه لا إله إلا أنا فاعبدون\" وقال \"ولقد بعثنا في كل أمة رسولا أن اعبدوا الله واجتنبوا الطاغوت\" وقوله \"قد جاءتكم بينة من ربكم هذه ناقة الله لكم آية\" أي قد جاءتكم حجة من الله على صدق ما جئتكم به وكانوا هم الذين سألوا صالحا أن يأتيهم بآية واقترحوا عليه بأن تخرج لهم من صخرة صماء عينوها بأنفسهم وهي صخرة منفردة في ناحية الحجر يقال لها الكاتبة فطلبوا منه أن تخرج لهم منها ناقة عشراء تمخض فأخذ عليهم صالح العهود والمواثيق لئن أجابهم الله إلى سؤالهم وأجابهم إلى طلبتهم ليؤمنن به وليتبعنه فلما أعطوه على ذلك عهودهم ومواثيقهم قام صالح عليه السلام إلى صلاته ودعا الله عز وجل فتحركت تلك الصخرة ثم انصدعت عن ناقة جوفاء وبراء يتحرك جنينها بين جنبيها كما سألوا فعند ذلك آمن رئيسهم جندع بن عمرو ومن كان معه على أمره وأراد بقية أشراف ثمود أن يؤمنوا فصدهم ذؤاب بن عمرو بن لبيد والحباب صاحب أوثانهم ورباب بن صعر بن جلهس وكان جندع بن عمرو بن عم له شهاب بن خليفة بن محلاة بن لبيد بن حراس وكان من أشراف ثمود وأفاضلها فأراد أن يسلم أيضا فنهاه أولئك الرهط فأطاعهم فقال في ذلك رجل من مؤمني ثمود يقال له مهوش بن عثمة بن الدميل رحمه الله. وكانت عصبة من آل عمرو إلى دين النبي دعوا شهابا عزيز ثمود كلهم جميعا فهم بأن يجيب فلو أجابا لأصبح صالح فينا عزيزا وما عدلوا بصاحبهم ذؤابا ولكن الغواة من آل حجر تولوا بعد رشدهم ذيابا وأقامت الناقة وفصيلها بعد ما وضعته بين أظهرهم مدة تشرب من بئرها يوما وتدعه لهم يوما وكانوا يشربون لبنها يوم شربها يحتلبونها فيملؤن ما شاء من أوعيتهم وأوانيهم كما قال في الآية الأخرى \"ونبئهم أن الماء قسمة بينهم كل شرب محتضر\" وقال تعالى \"هذه ناقة لها شرب ولكم شرب يوم معلوم\" وكانت تسرح في بعض تلك الأودية ترد من فج وتصدر من غيره ليسعها لأنها كانت تتضلع من الماء وكانت على ما ذكر خلقا هائلا ومنظرا رائعا إذا مرت بأنعامهم نفرت منها فلما طال عليهم واشتد تكذيبهم لصالح النبي عليه السلام عزموا على قتلها ليستأثروا بالماء كل يوم فيقال إنهم اتفقوا كلهم على قتلها قال قتادة بلغني أن الذي قتلها طاف عليهم كلهم أنهم راضون بقتلها حتى على النساء في خدورهن وعلى الصبيان قلت وهذا هو الظاهر لقوله تعالى \"فكذبوه فعقروها فدمدم عليهم ربهم بذنبهم فسواها\" وقال \"وآتينا ثمود الناقة مبصرة فظلموا بها\" وقال \"فعقروا الناقة\" فأسند ذلك على مجموع القبيلة فدل على رضى جميعهم بذلك والله أعلم وذكر الإمام أبو جعفر بن جرير وغيره من علماء التفسير أن سبب قتلها أن امرأة منهم يقال لها عنيزة ابنة غنم بن مجلز وتكنى أم عثمان كانت عجوزا كافرة وكانت من أشد الناس عداوة لصالح عليه السلام وكانت لها بنات حسان ومال جزيل وكان زوجها ذؤاب بن عمرو أحد رؤساء ثمود وامرأة أخرى يقال لها صدقة بنت المحيا بن زهير بن المختار ذات حسب ومال وجمال وكانت تحت رجل مسلم من ثمود ففارقته فكانتا تجعلان لمن التزم لهما بقتل الناقة فدعت صدقة رجلا يقال له الحباب فعرضت عليه نفسها إن هو عقر الناقي فأبى عليها فدعت ابن عم لها يقال له مصدع بن مهرج بن المحيا فأجابها إلى ذلك ودعت عنيزة بنت غنم قدار بن سالف بن جذع وكان رجلا أحمر أزرق قصيرا يزعمون أنه كان ولد زنية وأنه لم يكن من أبيه الذي ينسب إليه وهو سالف وإنما هو من رجل يقال له صهياد ولكن ولد على فراش سالف وقالت له أعطيك أي بناتي شئت على أن تعقر الناقة فعند ذلك انطلق قدار بن سالف ومصدع بن مهرج فاستغويا غواة من ثمود فاتبعهما سبعة نفر فصاروا تسعة رهط وهم الذين قال الله تعالى \"وكان في المدينة تسعة رهط يفسدون في الأرض ولا يصلحون\" وكانوا رؤساء في قومهم فاستمالوا القبيلة الكافرة بكمالها فطاوعتهم على ذلك فانطلقوا فرصدوا الناقة حين صدرت من الماء وقد كمن لها قدار بن سالف في أصل صخرة على طريقها وكمن لها مصدع في أصل أخرى فمرت على مصدع فرماها بسهم فانتظم به عضلة ساقها وخرجت بنت غنم عنيزة وأمرت ابنتها وكانت من أحسن الناس وجها فسفرت عن وجهها لقدار وزمرته وشد عليها قدار بالسيف فكشف عن عرقوبها فخرجت ساقطة إلى الأرض ورغت رغاة واحدة تحذر سقبها ثم طعن في لبتها فنحرها وانطلق سقبها وهو فصيلها حتى أتى جبلا منيعا فصعد أعلى صخرة فيه ورغا فروى عبدالرزاق عن معمر عمن سمع الحسن البصري أنه قال يا رب أين أمي ويقال أنه رغا ثلات مرات وأنه دخل في صخرة فغاب فيها ويقال إنهم اتبعوه فعقروه مع أمه فالله أعلم. فلما فعلوا ذلك وفرغوا من عقر الناقة وبلغ الخبر صالحا عليه السلام فجاءهم وهم مجتمعون فلما رأى الناقة بكى وقال \"تمتعوا في داركم ثلاثة أيام\" الآية. وكان قتلهم الناقة يوم الأربعاء فلما أمسى أولئك التسعة الرهط عزموا على قتل صالح وقالوا إن كان صادقا عجلناه قبلنا وإن كان كاذبا ألحقناه بناقته \"قالوا تقاسموا بالله لنبيتنه وأهله ثم لنقولن لوليه ما شهدنا مهلك أهله وإنا لصادقون ومكروا مكرا ومكرنا مكرا وهم لا يشعرون فانظر كيف كان عاقبة مكرهم\" الآية. فلما عزموا على ذلك وتواطئوا عليه وجاءوا من الليل ليفتكوا بنبي الله فأرسل الله سبحانه وتعالى وله العزة ولرسوله عليهم حجارة فرضختهم سلفا وتعجيلا قبل قومهم وأصبح ثمود يوم الخميس وهو اليوم الأول من أيام النظرة ووجوههم مصفرة كما وعدهم صالح عليه السلام وأصبحوا في اليوم الثاني من أيام التأجيل وهو يوم الجمعة ووجوههم محمرة وأصبحوا في اليوم الثالث من أيام المتاع وهو يوم السبت ووجوههم مسودة فلما أصبحوا من يوم الأحد وقد تحنطوا وقعدوا ينتظرون نقمة الله وعذابه عياذا بالله من ذلك لا يدرون ماذا يفعل بهم ولا كيف يأتيهم العذاب وأشرقت الشمس جاءتهم صيحة من السماء ورجفة شديدة من أسفل منهم ففاضت الأرواح وزهقت النفوس في ساعة واحدة."
    },
    {
      "ayah": 68,
      "surah": 11,
      "text": "قال علماء التفسير والنسب ثمود بن عاثر بن إرم بن سام بن نوح وهو أخو جديس بن عاثر وكذلك قبيلة طسم كل هؤلاء كانوا أحياء من العرب العاربة قبل إبراهيم الخليل عليه السلام وكانت ثمود بعد عاد ومساكنهم مشهورة فيما بين الحجاز والشام إلى وادي القرى وما حوله وقد مر رسول الله صلى الله عليه وسلم على ديارهم ومساكنهم وهو ذاهب إلى تبوك في سنة تسع قال الإمام أحمد حدثنا عبدالصمد حدثنا صخر بن جويرية عن نافع عن ابن عمر قال لما نزل رسول الله صلى الله عليه وسلم بالناس علي تبوك نزل بهم الحجر عند بيوت ثمود فاستقى الناس من الآبار التي كانت تشرب منها ثمود فعجنوا منها ونصبوا لها القدور فأمرهم النبي صلى الله عليه وسلم فأهرقوا القدور وعلفوا العجين الإبل ثم ارتحل بهم حتى نزل بهم على البئر التي كانت تشرب منها الناقة ونهاهم أن يدخلوا علي القوم الذين عذبوا وقال \"إني أخشى أن يصيبكم مثل ما أصابهم فلا تدخلوا عليهم\" وقال أحمد أيضا حدثنا عفان حدثنا عبدالعزيز بن مسلم حدثنا عبدالله بن دينار عن عبدالله بن عمر قال: قال رسول الله صلى الله عليه وسلم وهو بالحجر \"لا تدخلوا على هؤلاء المعذبين إلا أن تكونوا باكين فإن لم تكونوا باكين فلا تدخلوا عليهم أن يصيبكم مثل ما أصابهم\" وأصل هذا الحديث مخرج في الصحيحين من غير وجه وقال الإمام أحمد أيضا حدثنا يزيد بن هارون المسعودي عن إسماعيل بن أوسط عن محمد بن أبي كبشة الأنماري عن أبيه قال لما كان في غزوة تبوك تسارع الناس إلى أهل الحجر يدخلون عليهم فبلغ ذلك رسول الله صلى الله عليه وسلم فنادى في الناس \"الصلاة جامعة\" قال فأتيت رسول الله صلى الله عليه وسلم وهو ممسك بعنزة وهو يقول \"ما تدخلون على قوم غضب الله عليهم \"فناداه رجل منهم نعجب منهم يا رسول الله؟ قال \"أفلا أنبئكم بأعجب من ذلك: رجل من أنفسكم ينبئكم بما كان قبلكم وبما هو كائن بعدكم فاستقيموا وسددوا فإن الله لا يعبأ بعذابكم شيئا وسيأتي قوم لا يدفعون عن أنفسهم شيئا \"لم يخرجه أحد من أصحاب السنن وأبو كبشة اسمه عمر بن سعد ويقال عامر بن سعد والله أعلم وقال الإمام أحمد حدثنا عبدالرزاق حدثنا معمر عن عبدالله بن عثمان بن خيثم عن أبي الزبير عن جابر قال لما مر رسول الله صلى الله عليه وسلم بالحجر قال \"لا تسألوا الآيات فقد سألها قوم صالح فكانت - يعني الناقة - ترد من هذا الفج وتصدر من هذا الفج فعتوا عن أمر ربهم فعقروها وكانت تشرب ماءهم يوما ويشربون لبنها يوما فعقروها فأخذتهم صيحة أخمد الله من تحت أديم السماء منهم إلا رجلا واحدا كان في حرم الله\" فقالوا من هو يا رسول الله قال: أبو رغال فلما خرج من الحرم أصاب ما أصاب قومه\" وهذا الحديث ليس في شيء من الكتب الستة وهو على شرط مسلم. قوله تعالى \"وإلى ثمود\" أي ولقد أرسلنا إلى قبيلة ثمود أخاهم صالحا \"قال يا قوم اعبدوا الله ما لكم من إله غيره\" فجميع الرسل يدعون إلى عبادة الله وحده لا شريك له كما قال تعالى \"وما أرسلنا من قبلك من رسول إلا نوحي إليه أنه لا إله إلا أنا فاعبدون\" وقال \"ولقد بعثنا في كل أمة رسولا أن اعبدوا الله واجتنبوا الطاغوت\" وقوله \"قد جاءتكم بينة من ربكم هذه ناقة الله لكم آية\" أي قد جاءتكم حجة من الله على صدق ما جئتكم به وكانوا هم الذين سألوا صالحا أن يأتيهم بآية واقترحوا عليه بأن تخرج لهم من صخرة صماء عينوها بأنفسهم وهي صخرة منفردة في ناحية الحجر يقال لها الكاتبة فطلبوا منه أن تخرج لهم منها ناقة عشراء تمخض فأخذ عليهم صالح العهود والمواثيق لئن أجابهم الله إلى سؤالهم وأجابهم إلى طلبتهم ليؤمنن به وليتبعنه فلما أعطوه على ذلك عهودهم ومواثيقهم قام صالح عليه السلام إلى صلاته ودعا الله عز وجل فتحركت تلك الصخرة ثم انصدعت عن ناقة جوفاء وبراء يتحرك جنينها بين جنبيها كما سألوا فعند ذلك آمن رئيسهم جندع بن عمرو ومن كان معه على أمره وأراد بقية أشراف ثمود أن يؤمنوا فصدهم ذؤاب بن عمرو بن لبيد والحباب صاحب أوثانهم ورباب بن صعر بن جلهس وكان جندع بن عمرو بن عم له شهاب بن خليفة بن محلاة بن لبيد بن حراس وكان من أشراف ثمود وأفاضلها فأراد أن يسلم أيضا فنهاه أولئك الرهط فأطاعهم فقال في ذلك رجل من مؤمني ثمود يقال له مهوش بن عثمة بن الدميل رحمه الله. وكانت عصبة من آل عمرو إلى دين النبي دعوا شهابا عزيز ثمود كلهم جميعا فهم بأن يجيب فلو أجابا لأصبح صالح فينا عزيزا وما عدلوا بصاحبهم ذؤابا ولكن الغواة من آل حجر تولوا بعد رشدهم ذيابا وأقامت الناقة وفصيلها بعد ما وضعته بين أظهرهم مدة تشرب من بئرها يوما وتدعه لهم يوما وكانوا يشربون لبنها يوم شربها يحتلبونها فيملؤن ما شاء من أوعيتهم وأوانيهم كما قال في الآية الأخرى \"ونبئهم أن الماء قسمة بينهم كل شرب محتضر\" وقال تعالى \"هذه ناقة لها شرب ولكم شرب يوم معلوم\" وكانت تسرح في بعض تلك الأودية ترد من فج وتصدر من غيره ليسعها لأنها كانت تتضلع من الماء وكانت على ما ذكر خلقا هائلا ومنظرا رائعا إذا مرت بأنعامهم نفرت منها فلما طال عليهم واشتد تكذيبهم لصالح النبي عليه السلام عزموا على قتلها ليستأثروا بالماء كل يوم فيقال إنهم اتفقوا كلهم على قتلها قال قتادة بلغني أن الذي قتلها طاف عليهم كلهم أنهم راضون بقتلها حتى على النساء في خدورهن وعلى الصبيان قلت وهذا هو الظاهر لقوله تعالى \"فكذبوه فعقروها فدمدم عليهم ربهم بذنبهم فسواها\" وقال \"وآتينا ثمود الناقة مبصرة فظلموا بها\" وقال \"فعقروا الناقة\" فأسند ذلك على مجموع القبيلة فدل على رضى جميعهم بذلك والله أعلم وذكر الإمام أبو جعفر بن جرير وغيره من علماء التفسير أن سبب قتلها أن امرأة منهم يقال لها عنيزة ابنة غنم بن مجلز وتكنى أم عثمان كانت عجوزا كافرة وكانت من أشد الناس عداوة لصالح عليه السلام وكانت لها بنات حسان ومال جزيل وكان زوجها ذؤاب بن عمرو أحد رؤساء ثمود وامرأة أخرى يقال لها صدقة بنت المحيا بن زهير بن المختار ذات حسب ومال وجمال وكانت تحت رجل مسلم من ثمود ففارقته فكانتا تجعلان لمن التزم لهما بقتل الناقة فدعت صدقة رجلا يقال له الحباب فعرضت عليه نفسها إن هو عقر الناقي فأبى عليها فدعت ابن عم لها يقال له مصدع بن مهرج بن المحيا فأجابها إلى ذلك ودعت عنيزة بنت غنم قدار بن سالف بن جذع وكان رجلا أحمر أزرق قصيرا يزعمون أنه كان ولد زنية وأنه لم يكن من أبيه الذي ينسب إليه وهو سالف وإنما هو من رجل يقال له صهياد ولكن ولد على فراش سالف وقالت له أعطيك أي بناتي شئت على أن تعقر الناقة فعند ذلك انطلق قدار بن سالف ومصدع بن مهرج فاستغويا غواة من ثمود فاتبعهما سبعة نفر فصاروا تسعة رهط وهم الذين قال الله تعالى \"وكان في المدينة تسعة رهط يفسدون في الأرض ولا يصلحون\" وكانوا رؤساء في قومهم فاستمالوا القبيلة الكافرة بكمالها فطاوعتهم على ذلك فانطلقوا فرصدوا الناقة حين صدرت من الماء وقد كمن لها قدار بن سالف في أصل صخرة على طريقها وكمن لها مصدع في أصل أخرى فمرت على مصدع فرماها بسهم فانتظم به عضلة ساقها وخرجت بنت غنم عنيزة وأمرت ابنتها وكانت من أحسن الناس وجها فسفرت عن وجهها لقدار وزمرته وشد عليها قدار بالسيف فكشف عن عرقوبها فخرجت ساقطة إلى الأرض ورغت رغاة واحدة تحذر سقبها ثم طعن في لبتها فنحرها وانطلق سقبها وهو فصيلها حتى أتى جبلا منيعا فصعد أعلى صخرة فيه ورغا فروى عبدالرزاق عن معمر عمن سمع الحسن البصري أنه قال يا رب أين أمي ويقال أنه رغا ثلات مرات وأنه دخل في صخرة فغاب فيها ويقال إنهم اتبعوه فعقروه مع أمه فالله أعلم. فلما فعلوا ذلك وفرغوا من عقر الناقة وبلغ الخبر صالحا عليه السلام فجاءهم وهم مجتمعون فلما رأى الناقة بكى وقال \"تمتعوا في داركم ثلاثة أيام\" الآية. وكان قتلهم الناقة يوم الأربعاء فلما أمسى أولئك التسعة الرهط عزموا على قتل صالح وقالوا إن كان صادقا عجلناه قبلنا وإن كان كاذبا ألحقناه بناقته \"قالوا تقاسموا بالله لنبيتنه وأهله ثم لنقولن لوليه ما شهدنا مهلك أهله وإنا لصادقون ومكروا مكرا ومكرنا مكرا وهم لا يشعرون فانظر كيف كان عاقبة مكرهم\" الآية. فلما عزموا على ذلك وتواطئوا عليه وجاءوا من الليل ليفتكوا بنبي الله فأرسل الله سبحانه وتعالى وله العزة ولرسوله عليهم حجارة فرضختهم سلفا وتعجيلا قبل قومهم وأصبح ثمود يوم الخميس وهو اليوم الأول من أيام النظرة ووجوههم مصفرة كما وعدهم صالح عليه السلام وأصبحوا في اليوم الثاني من أيام التأجيل وهو يوم الجمعة ووجوههم محمرة وأصبحوا في اليوم الثالث من أيام المتاع وهو يوم السبت ووجوههم مسودة فلما أصبحوا من يوم الأحد وقد تحنطوا وقعدوا ينتظرون نقمة الله وعذابه عياذا بالله من ذلك لا يدرون ماذا يفعل بهم ولا كيف يأتيهم العذاب وأشرقت الشمس جاءتهم صيحة من السماء ورجفة شديدة من أسفل منهم ففاضت الأرواح وزهقت النفوس في ساعة واحدة."
    },
    {
      "ayah": 69,
      "surah": 11,
      "text": "يقول تعالى \"ولقد جاءت رسلنا\" وهم الملائكة إبراهيم بالبشرى قيل تبشره بإسحاق وقيل بهلاك قوم لوط ويشهد للأول قوله تعالى \"ولما ذهب عن إبراهيم الروع وجاءته البشرى يجادلنا في قوم لوط\" \"قالوا سلاما قال سلام\" أي عليكم قال علماء البيان: هذا أحسن مما حيوه به لأن الرفع يدل على الثبوت والدوام \"فما لبث أن جاء بعجل حنيذ\" أي ذهب سريعا فأتاهم بالضيافة وهو عجل فتى البقر حنيذ: مشوي على الرضف وهي الحجارة المحماة. هذا معنى ما روي عن ابن عباس وقتادة وغير واحد كما قال في الآية الأخرى \"فراغ إلى أهله فجاء بعجل سمين فقربه إليهم قال ألا تأكلون\" وقد تضمنت هذه الآية آداب الضيافة من وجوه كثيرة."
    },
    {
      "ayah": 7,
      "surah": 11,
      "text": "يخبر تعالى عن قدرته على كل شيء وأنه خلق السموات والأرض في ستة أيام وأن عرشه كان على الماء قيل ذلك كما قال الإمام أحمد: حدثنا أبو معاوية حدثنا الأعمش عن جامع بن شداد عن صفوان بن محرز عن عمران بن حصين قال: قال رسول الله صلي الله عليه وسلم \"اقبلوا البشرى يا بني تميم\" قالوا قد بشرتنا فأعطنا قال \"اقبلوا البشري يا أهل اليمن\" قالوا قد قبلنا فأخبرنا عن أول هذا ألأمر كيف كان؟ قال \"كان الله قبل كل شيء وكان عرشه على الماء وكتب في اللوح المحفوظ ذكر كل شيء\". قال: فأتاني آت فقال يا عمران انحلت ناقتك من عقالها قال فخرجت في إثرها فلا أدري ما كان بعدي; وهذا الحديث مخرج في صحيحي البخاري ومسلم بألفاظ كثيرة فمنها قالوا جئناك نسألك عن أول هذا الأمر فقال \"كان الله ولم يكن شيء قبله وفي رواية - غيره- وفي رواية - معه- وكان عرشه على الماء وكتب في الذكر كل شيء ثم خلق السموات والأرض\" وفي صحيح مسلم عن عبدالله بن عمرو بن العاص قال: قال رسول الله صلي الله عليه وسلم \"إن الله قدر مقادير الخلائق قبل أن يخلق السموات والأرض بخمسين ألف سنة وكان عرشه على الماء\" وقال البخاري في تفسير هذه الآية: حدثنا أبو اليمان أخبرنا شعيب أخبرنا أبو الزناد عن الأعرج عن أبي هريرة رضي الله عنه أن رسول الله صلي الله عليه وسلم قال \"قال الله عز وجل أنفق أنفق عليك\". وقال \"يد الله ملأى لا يغيضها نفقة سحاء الليل والنهار\" وقال \"أفرأيتم ما أنفق منذ خلق السموات والأرض فإنه لم يغض ما في يمينه وكان عرشه على الماء وبيده الميزان يخفض ويرفع\". وقال الإمام أحمد: حدثنا يزيد بن هارون أخبرنا حماد بن سلمة عن يعلى بن عطاء عن وكيع بن عدس عن عمه أبي رزين واسمه لقيط بن عامر بن المنتفق العقيلي قال: قلت يا رسول الله أين كان ربنا قبل أن يخلق خلقه؟ قال \"كان في عماء ما تحته هواء وما فوقه هواء ثم خلق العرش بعد ذلك\". وقد رواه الترمذي في التفسير وابن ماجه في السنن من حديث يزيد بن هارون به وقال الترمذي هذا حديث حسن وقال مجاهد \"وكان عرشه على الماء\" قبل أن يخلق شيئا وكذا قال وهب بن منبه وضمرة وقتادة وابن جرير وغير واحد وقال قتادة في قوله \"وكان عرشه على الماء\" ينبئكم كيف كان بدء خلقه قبل أن يخلق السموات والأرض وقال الربيع بن أنس \"وكان عرشه على الماء\" فلما خلق السموات والأرض قسم ذلك الماء قسمين فجعل نصفا تحت العرش وهو البحر المسجور. وقال ابن عباس إنما سمي العرش عرشا لارتفاعه وقال إسماعيل بن أبي خالد سمعت سعدا الطائي يقول: العرش ياقوتة حمراء وقال محمد بن إسحاق في قوله تعالى \"هو الذي خلق السموات والأرض في ستة أيام وكان عرشه على الماء\" فكان كما وصف نفسه تعالى إذ ليس إلا الماء وعليه العرش وعلى العرش ذو الجلال والإكرام والعزة والسلطان والملك والقدرة والحلم والعلم والرحمة والنعمة الفعال لما يريد ; وقال الأعمش عن المنهال بن عمرو عن سعيد بن جبير قال: سئل ابن عباس عن قول الله \"وكان عرشه علي الماء\" على أي شيء كان الماء؟ قال على متن الريح وقوله تعالى \"ليبلوكم أيكم أحسن عملا\" أي خلق السموات والأرض لنفع عباده الذين خلقهم ليعبدوه ولا يشركوا به شيئا ولم يخلق ذلك عبثا كقوله \"وما خلقنا السماء والأرض وما بينهما باطلا ذلك ظن الذين كفروا فويل للذين كفروا من النار\" وقال تعالى \"أفحسبتم أنما خلقناكم عبثا وأنكم إلينا لا ترجعون فتعالى الله الملك الحق لا إله إلا هو رب العرش الكريم\" وقال تعالى \"ما خلقت الجن والإنس إلا ليعبدون\" الآية ; وقوله \"ليبلوكم\" أي ليختبركم \"أيكم أحسن عملا\" ولم يقل أكثر عملا بل أحسن عملا ولا يكون العمل حسنا حتى يكون خالصا لله عز وجل على شريعة رسول الله فمتى فقد العمل واحدا من هذين الشرطين حبط وبطل. وقوله \"ولئن قلت إنكم مبعوثون من بعد الموت\" الآية. يقول تعالى ولئن أخبرت يا محمد هؤلاء المشركين أن الله سيبعثهم بعد مماتهم كما بدأهم مع أنهم يعملون أن الله تعالى هو الذي خلق السموات والأرض كما قال تعالى \"ولئن سألتهم من خلقهم ليقولن الله\" \"ولئن سألتهم من خلق السموات والأرض وسخر الشمس والقمر ليقولن الله\" وهم مع هذا ينكرون البعث والمعاد يوم القيامة الذي هو بالنسبة إلى القدرة أهون من البداءة كما قال تعالى \"وهو الذي يبدا الخلق ثم يعيده وهو أهون عليه\" وقال تعالى \"ما خلقكم ولا بعثكم إلا كنفس واحدة\" وقولهم \"إن هذا إلا سحر مبين\" أي يقولون كفرا وعنادا ما نصدقك على وقوع البعث وما يذكر ذلك إلا من سحرته فهو يتبعك على ما تقول."
    },
    {
      "ayah": 70,
      "surah": 11,
      "text": "وقوله \"فلما رأى أيديهم لا تصل إليهم نكرهم\" تنكرهم \"وأوجس منهم خيفة\" وذلك أن الملائكة لا همة لهم إلى الطعام ولا يشتهونه ولا يأكلونه فلهذا رأى حالهم معرضين عما جاءهم به فارغين عنه بالكلية فعند ذلك نكرهم \"وأوجس منهم خيفة\" قال السدي: لما بعث الله الملائكة لقوم لوط أقبلت تمشي في صور رجال شبان حتى نزلوا على إبراهيم فتضيفوه فلما رآهم أجلهم \"فراغ إلى أهله فجاء بعجل سمين\" فذبحه ثم شواه في الرضف وأتاهم به فقعد معهم وقامت سارة تخدمهم فذلك حين يقول - وامرأته قائمة وهو جالس - في قراءة ابن مسعود \"فلما قربه إليهم قال ألا تأكلون\" قالوا يا إبراهيم إنا لا نأكل طعاما إلا بثمن قال فإن لهذا ثمنا قالوا وما ثمنه؟ قال تذكرون اسم الله على أوله وتحمدونه على آخره فنظر جبريل إلى ميكائيل فقال حق لهذا أن يتخذه ربه خليلا \"فلما رأى أيديهم لا تصل إليه نكرهم\" يقول فلما رآهم لا يأكلون فزع منهم وأوجس منهم خيفة فلما نظرت سارة أنه قد أكرمهم وقامت هي تخدمهم ضحكت وقالت: عجبا لأضيافنا هؤلاء نخدمهم بأنفسنا كرامة لهم وهم لا يأكلون طعامنا! وقال ابن حاتم: حدثنا علي بن الحسين حدثنا نصر بن علي حدثنا نوح بن قيس عن عثمان بن محيصن في ضيف إبراهيم قال: كانوا أربعة: جبريل وميكائيل وإسرافيل ورفائيل قال نوح بن قيس فزعم نوح بن أبي شداد أنهم لما دخلوا على إبراهيم فقرب إليهم العجل مسحه جبريل بجناحه فقام يدرج حتى لحق بأمه وأم العجل في الدار وقوله تعالى إخبارا عن الملائكة \"قالوا لا تخف\" أي قالوا لا تخف منا إنا ملائكة أرسلنا إلى قوم لوط لنهلكهم فضحكت سارة استبشارا بهلاكهم لكثرة فسادهم وغلظ كفرهم وعنادهم فلهذا جوزيت بالبشارة بالولد بعد الإياس وقال قتادة ضحكت وعجبت أن قوما يأتيهم العذاب وهم في غفلة وقوله \"ومن وراء إسحاق يعقوب\" قال العوفي عن ابن عباس: فضحكت أي حاضت وقول محمد بن قيس إنها إنما ضحكت من أنها ظنت أنهم يريدون أن يعملوا كما يعمل قوم لوط وقول الكلبي: إنها إنما ضحكت لما رأت من الروع بإبراهيم ضعفا ووجدا وإن كان ابن جرير قد رواهما بسنده إليهما فلا يلتفت إلى ذلك والله أعلم. وقال وهب بن منبه: إنما ضحكت لما بشرت بإسحاق وهذا مخالف لهذا السياق فإن البشارة صريحة مرتبة على ضحكها."
    },
    {
      "ayah": 71,
      "surah": 11,
      "text": "\"فبشرناها بإسحاق ومن وراء إسحاق يعقوب\" أي بولد لها يكون له ولد وعقب ونسل فإن يعقوب ولد إسحاق كما قال في آية البقرة \"أم كنتم شهداء إذ حضر يعقوب الموت إذ قال لبنيه ما تعبدون من بعدي قالوا نعبد إلهك وإله آبائك إبراهيم وإسحاق إلها واحدا ونحن له مسلمون\" ومن ههنا استدل من استدل بهذه الأية على أن الذبيح إنما هو إسماعيل وأنه يمتنع أن يكون هو إسحاق لأنه وقعت البشارة به وأنه سيوله له يعقوب فكيف يؤمر إبراهيم بذبحه وهو طفل صغير ولم يولد له بعد يعقوب الموعود بوجوده ووعد الله حق لا خلف فيه فيمتنع أن يؤمر بذبح هذا والحالة هذه فتعين أن يكون هو إسماعيل وهذا من أحسن الاستدلال وأصحه وأبينه ولله الحمد \"قالت يا ويلتى أألد وأنا عجوز وهذا بعلي شيخا\" الآية حكى قولها في هذه الآية كما حكي فعلها في الآية الأخرى."
    },
    {
      "ayah": 72,
      "surah": 11,
      "text": "فإنها \"قالت يا ويلتى أألد وأنا عجوز\" وفي الذاريات\" فأقبلت امرأته في صرة فصكت وجهها وقالت عجوز عقيم\" كما جرت به عادة النساء في أقوالهن وأفعالهن عند التعجب."
    },
    {
      "ayah": 73,
      "surah": 11,
      "text": "قالوا \"أتعجبن من أمر الله\" أي قالت الملائكة لها لا تعجبي من أمر الله فإنه إذا أراد شيئا أن يقول له كن فيكون. فلا تعجبي من هذا وإن كنت عجوزا عقيما وبعلك شيخا كبيرا فإن الله على ما يشاء قدير \"رحمة الله وبركاته عليكم أهل البيت إنه حميد مجيد\" أي هو الحميد في جميع أفعاله وأقواله محمود ممجد في صفاته وذاته ولهذا ثبت في الصحيحين أنهم قالوا: قد علمنا السلام عليك فكيف الصلاة عليك يا رسول الله ؟ قال \"قولوا اللهم صل على محمد وعلى آل محمد كما صليت على إبراهيم وآل إبراهيم وبارك على محمد وعلى آل محمد كما باركت على آل إبراهيم إنك حميد مجيد\"."
    },
    {
      "ayah": 74,
      "surah": 11,
      "text": "يخبر تعالى عن إبراهيم عليه السلام أنه لما ذهب عنه الروع وهو ما أوجس من الملائكة خيفة حين لم يأكلوا وبشروه بعد ذلك بالولد وأخبروه بهلاك قوم لوط أخذ يقول كما قال سعيد بن جبير في الآية: قال لما جاءه جبريل ومن معه قالوا له \"إنا مهلكوا أهل هذه القرية\" قال لهم أتهلكون قرية فيها ثلثمائة مؤمن؟ قالوا لا قال أفتهلكون قرية فيها مائتا مؤمن؟ قالوا لا قال أفتهلكون قرية فيها أربعون مؤمنا؟ قالوا لا قال ثلاثون؟ قالوا لا حتى بلغ خمسة قالوا لا. قال أرأيتكم إن كان فيها رجل واحد مسلم أتهلكونها؟ قالوا لا فقال إبراهيم عليه السلام عند ذلك \"إن فيها لوطا قالوا نحن أعلم بمن فيها لننجينه وأهله إلا امرأته\" الآية فسكت عنهم واطمأنت نفسه وقال قتادة وغيره قريبا من هذا زاد ابن إسحاق أفرأيتم إن كان فيها مؤمن واحد؟ قالوا لا قال: فإن كان فيها لوط يدفع به عنهم العذاب قالوا \"نحن أعلم بمن فيها\" الآية."
    },
    {
      "ayah": 75,
      "surah": 11,
      "text": "وقوله \"إن إبراهيم لحليم أواه منيب\" مدح لإبراهيم بهذه الصفات الجميلة وقد تقدم تفسيرها."
    },
    {
      "ayah": 76,
      "surah": 11,
      "text": "وقوله تعالى \"يا إبراهيم أعرض عن هذا إنه قد جاء أمر ربك\" الآية أي أنه قد نفذ فيهم القضاء وحقت عليهم الكلمة بالهلاك وحلول البأس الذي لا يرد عن القوم المجرمين."
    },
    {
      "ayah": 77,
      "surah": 11,
      "text": "يخبر تعالى عن قدوم رسله من الملائكة بعد ما أعلموا إبراهبم بهلاكهم وفارقوه وأخبروه بإهلاك الله قوم لوط هذه الليلة فانطلقوا من عنده فأتوا لوطا عليه السلام وهو علي ما قيل في أرض له وقيل في منزله ووردوا عليه وهم في أجمل صورة تكون على هيئة شبان حسان الوجوه ابتلاء من الله وله الحكمة والحجة البالغة فساءه شأنهم وضاقت نفسه بسببهم وخشي إن لم يضفهم أن يضيفهم أحد من قومه فينالهم بسوء \"وقال هذا يوم عصيب\" قال ابن عباس وغير واحد: شديد بلاؤه وذلك أنه علم أنه سيدافع عنهم ويشق عليه ذلك وذكر قتادة أنهم أتوه وهو في أرض له فتضيفوه فاستحيا منهم فانطلق أمامهم وقال لهم في أثناء الطريق كالمعرض لهم بأن ينصرفوا عنه أنه والله يا هؤلاء ما أعلم على وجه الأرض أهل بلد أخبث من هؤلاء ثم مشي قليلا ثم أعاد ذلك عليهم حتى كرره أربع مرات قال قتادة: وقد كانوا أمروا أن لا يهلكوهم حتى يشهد عليهم نبيهم بذلك. وقال السدي: خرجت الملائكة من عند إبراهيم نحو قرية لوط فبلغوا نهر سدوم نصف النهار ولقوا بنت لوط تستقي فقالوا يا جارية هل من منزل؟ فقالت مكانكم حتى آتيكم وفرقت عليهم من قومها فأتت أباها فقالت: يا أبتاه أدرك فتيانا على باب المدينة ما رأيت وجوه قوم أحسن منهم لا يأخذهم قومك وكان قومه نهوه أن يضيف رجلا فقالوا خل عنا فلنضيف الرجال فجاء بهم فلم يعلم بهم أحد إلا أهل بيته فخرجت امرأته فأخبرت قومها فجاءوا يهرعون إليه."
    },
    {
      "ayah": 78,
      "surah": 11,
      "text": "وقوله \"يهرعون إليه\" أي يسرعون ويهرولون من فرحهم بذلك وقوله \"ومن قبل كانوا يعملون السيئات\" أي لم يزل هذا من سجيتهم حتى أخذوا وهم علي ذلك الحال وقوله \"قال يا قوم هؤلاء بناتي هن أطهر لكم\" يرشدهم إلى نسائهم فإن النبي للأمة بمنزلة الوالد فأرشدهم إلي ما هو أنفع لهم في الدنيا والآخرة كما قال لهم في الآية الأخرى \"أتأتون الذكران من العالمين وتذرون ما خلق لكم ربكم من أزواجكم بل أنتم قوم عادون\" وقوله في الأية الأخرى \"قالوا أو لم ننهك عن العالمين\" أي ألم ننهك عن ضيافة الرجال \"قال هؤلاء بناتي إن كنتم فاعلين لعمرك إنهم لفي سكرتهم يعمهون\" وقال في هذه الآية الكريمة \"هؤلاء بناتي هن أطهر لكم\" قال مجاهد: لم يكن بناته لكن كن من أمته وكل نبي أبو أمته. وكذا روي عن قتادة وغير واحد وقال ابن جريج: أمرهم أن يتزوجوا النساء ولم يعرض عليهم سفاحا وقال سعيد بن جبير: يعني نساءهم هن بناته وهو أب لهم ويقال في بعض القراءات \"النبي أولى بالمؤمنين من أنفسهم وأزواجه أمهاتهم\" وهو أب لهم وكذا روي عن الربيع بن أنس وقتادة والسدي ومحمد بن إسحاق وغيرهم وقوله \"فاتقوا الله ولا تخزون في ضيفي\" أي اقبلوا ما آمركم به من الاقتصار على نسائكم \"أليس منكم رجل رشيد\" أي فيه خير يقبل ما آمره به ويترك ما أنهاه عنه."
    },
    {
      "ayah": 79,
      "surah": 11,
      "text": "قالوا لقد علمت ما لنا في بناتك من حق\" أي إنك لتعلم أن نساءك لا أرب لنا فيهن ولا نشتهيهن \"وإنك لتعلم ما نريد\" أي ليس لنا غرض إلا في الذكور وأنت تعلم ذلك فأي حاجة في تكرار القول علينا في ذلك ؟ قال السدي \"وإنك لتعلم ما نريد\" إنما نريد الرجال."
    },
    {
      "ayah": 8,
      "surah": 11,
      "text": "وقوله \"ولئن أخرنا عنهم العذاب إلى أمة معدودة\" الآية. يقول تعالى ولئن أخرنا العذاب والمؤاخذة عن هؤلاء المشركين إلى أجل معدود وأمد محصور وأوعدناهم إلى مدة مضروبة ليقولن تكذيبا واستعجالا: ما يحبسه أي يؤخر هذا العذاب عنا فإن سجاياهم قد ألفت التكذيب والشك فلم يبق لهم محيص عنه ولا محيد. والأمة تستعمل في القرآن والسنة في معان متعددة فيراد بها الأمد كقوله في هذه الآية \"إلى أمة معدودة\" وقوله في يوسف \"وقال الذي نجا منهما واذكر بعد أمة\" وتستعمل في الإمام المقتدى به كقوله \"إن إبراهيم كان أمة قانتا لله حنيفا ولم يك من المشركين\" وتستعمل في الملة والدين كقوله أخبارا عن المشركين إنهم قالوا \"إنا وجدنا آباءنا على أمة وإنا على آثارهم مقتدون\" وتستعمل في الجماعة كقوله \"ولما ورد ماء مدين وجد عليه أمة من الناس يسقون\" وقوله \"ولقد بعثنا في كل أمة رسولا أن اعبدوا الله واجتنبوا الطاغوت\" وقال تعالى \"ولكل أمة رسول فإذا جاء رسولهم قضي بينهم بالقسط وهم لا يظلمون\" والمراد من الأمة ههنا الذين يبعث فيهم الرسول مؤمنهم وكافرهم كما في صحيح مسلم \"والذي نفسي بيده لا يسمع بي أحد من هذه الأمة يهودي ولا نصراني ثم لا يؤمن بي إلا دخل النار\" وأما أمة الاتباع فهم المصدقون للرسل كما قال تعالى \"كنتم خير أمة أخرجت للناس\" وفي الصحيح \"فأقول أمتي أمتي\" وتستعمل الأمة في الفرقة والطائقة كقوله تعالى \"ومن قوم موسى أمة يهدون بالحق وبه يعدلون\" وكقوله \"من أهل الكتاب أمة قائمة\" الآية."
    },
    {
      "ayah": 80,
      "surah": 11,
      "text": "يقول تعالى مخبرا نبيه لوط عليه السلام إن لوطا توعدهم بقوله \"لو أن لي بكم قوة\" الآية أي لكنت نكلت بكم وفعلت بكم الأفاعيل بنفسي وعشيرتي ولهذا ورد في الحديث من طريق محمد بن عمرو بن علقمة بن أبي سلمة عن أبي هريرة أن رسول الله صلي الله عليه وسلم قال \"رحمة الله على لوط لقد كان يأوي إلى ركن شديد - يعنى الله عز وجل- فما بعث الله بعده من نبي إلا في ثروة من قومه \"فعند ذلك أخبرته الملائكة أنهم رسل الله إليهم وأنهم لا وصول لهم إليه."
    },
    {
      "ayah": 81,
      "surah": 11,
      "text": "قالوا \"يا لوط إنا رسل ربك لن يصلوا إليك\" وأمروه أن يسري بأهله من آخر الليل وأن يتبع أدبارهم أي يكون ساقة لأهله \"ولا يلتفت منكم أحد\" أي إذا سمعت ما نزل بهم ولا تهولنكم تلك الأصوات المزعجة ولكن استمروا ذاهبين \"إلا امرأتك\" قال الأكثرون هو استثناء من المثبت وهو قوله \"فأسر بأهلك تقديره \"إلا امرأتك\" وكذلك قرأها ابن مسعود ونصب هؤلاء امرأتك لأنه مثبت فوجب نصبه عندهم وقال آخرون من القراء والنحاة هو استثناء من قوله \"ولا يلتفت منكم أحد إلا امرأتك\" فجوزوا الرفع والنصب وذكر هؤلاء أنها خرجت معهم وأنها لما سمعت الوجبة التفتت وقالت: واقوماه فجاءها حجر من السماء فقتلها ثم قربوا له هلاك قومه تبشيرا له لأنه قال لهم أهلكوهم الساعة فقالوا \"إن موعدهم الصبح أليس الصبح بقريب\". هذا وقوم لوط وقوف على الباب عكوف قد جاءوا يهرعون إليه من كل جانب ولوط واقف على الباب يدافعهم ويردعهم وينهاهم عما هم فيه وهم لا يقبلون منه بل يتوعدونه ويتهددونه فعند ذلك خرج عليهم جبريل عليه السلام فضرب وجوههم بجناحه فطمس أعينهم فرجعوا وهم لا يهتدون الطريق كما قال تعالى \"ولقد راودوه عن ضيفه فطمسنا أعينهم فذوقوا عذابي ونذر\" الآية وقال معمر عن قتادة عن حذيفة بن اليمان قال: كان إبراهيم عليه السلام يأتي قوم لوط فيقول أنهاكم الله أن تعرضوا لعقوبته فلم يطيعوه حتى إذا بلغ الكتاب أجله انتهت الملائكة إلى لوط وهو يعمل في أرض له فدعاهم إلى الضيافة فقالوا إنا ضيوفك الليلة وكان الله قد عهد إلى جبريل ألا يعذبهم حتى يشهد عليهم لوط ثلات شهادات فلما توجه بهم لوط إلى الضيافة ذكر ما يعمل قومه من الشر فمشى معهم ساعة ثم التفت إليهم فقال أما تعلمون ما يعمل أهل هذه القرية؟ ما أعلم على وجه الأرض شرا منهم أين أذهب بكم؟ إلى قومي وهم أشر خلق الله؟ فالتفت جبريل إلى الملائكة فقال احفظوها هذه واحدة ثم مشى معهم ساعة فلما توسط القرية وأشفق عليهم واستحيا منهم قال: أما تعلمون ما يعمل أهل هذه القرية؟ ما أعلم على وجه الأرض أشر منهم إن قومي أشر خلق الله فالتفت جبريل إلى الملائكة فقال: احفظوها هاتان اثنتان فلما انتهى إلى باب الدار بكى حياء منهم وشفقة عليهم فقال: إن قومي أشر خلق الله؟ أما تعلمون ما يعمل أهل هذه القرية؟ ما أعلم على وجه الأرض أهل قرية شرا منهم فقال جبريل للملائكة احفظوا هذه ثلاث قد حق العذاب فلما دخلوا ذهبت عجوزه عجوز السوء فصعدت فلوحت بثوبها فأتاها الفساق يهرعون سراعا قالوا ما عندك؟ قالت ضيف لوط قوما ما رأيت قط أحسن وجوها منهم ولا أطيب ريحا منهم فهرعوا يسارعون إلى الباب فعالجهم لوط على الباب فدافعوه طويلا وهو داخل وهم خارج يناشدهم الله ويقول \"هؤلاء بناتي هن أطهر لكم\" فقام الملك فلز بالباب - يقول فشده - واستأذن جبريل في عقوبتهم فأذن الله له فقام في الصورة التي يكون فيها في السماء فنشر جناحه - ولجبريل جناحان - وعليه وشاح من در منظوم وهو براق الثنايا أجلى الجبين ورأسه حبك حبك مثل المرجان وهو اللؤلؤ كأنه الثلج ورجلاه إلي الخضرة فقال يا لوط \"إنا رسل ربك لن يصلوا إليك\" امض يا لوط عن الباب ودعني وإياهم فتنحى لوط عن الباب فخرج إليهم فنشر جناحه فضرب به وجوههم ضربه شدخ أعينهم فصاروا عميا لا يعرفون الطريق ثم أمر لوط فاحتمل بأهله في ليلته قال \"فأسر بأهلك بقطع من الليل\" وروي عن محمد بن كعب وقتادة والسدي نحو هذا."
    },
    {
      "ayah": 82,
      "surah": 11,
      "text": "يقول تعالى \"فلما جاء أمرنا\" وكان ذلك عند طلوع الشمس \"جعلنا عاليها\" وهي سدوم \"سافلها\" كقوله \"فغشاها ما غشى\" أي أمطرنا عليها حجارة من سجيل وهي بالفارسية حجارة من طين قاله ابن عباس وغيره وقال بعضهم: أي من سنك وهو الحجر وكل وهو الطين وقد قال في الآية الأخرى حجارة من طين أي مستحجرة قوية شديدة وقال بعضهم مشوية وقال البخاري سجيل: الشديد الكبير سجيل وسجين اللام والنون أختان وقال تميم بن مقبل: ورحله يضربون البيض صاحبة ضربا تواصت به الأبطال سجينا وقوله \"منضود\" قال بعضهم: منضودة في السماء أي معدة لذلك وقال آخرون \"منضود\" أي يتبع بعضها بعضا في نزولها عليهم."
    },
    {
      "ayah": 83,
      "surah": 11,
      "text": "وقوله \"مسومة\" أي معلمة مختومة عليها أسماء أصحابها كل حجر مكتوب عليه اسم الذي ينزل عليه وقال قتادة وعكرمة \"مسومة\" مطوقة بها نضح من حمرة وذكروا أنها نزلت على أهل البلد وعلى المتفرقين في القرى مما حولها فبينا أحدهم يكون عند الناس يتحدث إذ جاءه حجر من السماء فسقط عليه من بين الناس فدمره فتتبعهم الحجارة من سائر البلاد حتى أهلكتهم عن آخرهم فلم يبق منهم أحد وقال مجاهد: أخذ جبريل قوم لوط من سرحهم ودورهم حملهم بمواشيهم وأمتعتهم ورفعهم حتى سمع أهل السماء نباح كلابهم ثم كفأها وكان حملهم على حوافي جناحه الأيمن قال: ولما قلبها كان أول ما سقط منها شرقاتها. وقال قتادة: بلغنا أن جبريل أخذ بعروة القرية الوسطى ثم ألوى بها إلى جو السماء حتى سمع أهل السماء ضواغي كلابهم ثم دمر بعضها على بعض ثم أتبع شذاذ القوم صخرا قال: وذكر لنا أنهم كانوا أربع قرى في كل قرية مائة ألف وفي رواية ثلاث قرى الكبرى منها سدوم قال وبلغنا أن إبراهيم عليه السلام كان يشرف على سدوم ويقول سدوم يوم هالك. وفي رواية عن قتادة وغيره: بلغنا أن جبريل عليه السلام لما أصبح نشر جناحه فانتسف بها أرضهم بما فيها من قصورها ودوابها وحجارتها وشجرها وجميع ما فيها فضمها في جناحه فحواها وطواها في جوف جناحه ثم صعد بها إلى السماء الدنيا حتى سمع سكان السماء أصوات الناس والكلاب وكانوا أربعة آلاف ألف ثم قلبها فأرسلها إلى الأرض منكوسة ودمدم بعضها على بعض فجعل عاليها سافلها ثم أتبعها حجارة من سجيل. وقال محمد بن كعب القرظي: كانت قرى قوم لوط خمس قريات: سدوم وهي العظمى وصعبة وصعود وغمرة ودوحاء احتملها جبريل بجناحه ثم صعد بها حتى أن أهل السماء الدنيا ليسمعون نابحة كلابها وأصوات دجاجها ثم كفأها على وجهها ثم أتبعها الله بالحجارة يقول الله تعالى \"جعلنا عاليها سافلها وأمطرنا عليها حجارة من سجيل\" فأهلكها الله وما حولها من المؤتفكات. وقال السدي: لما أصبح قوم لوط نزل جبريل فاقتلع الأرض من سبع أرضين فحملها حتى بلغ بها السماء حتى سمع أهل السماء الدنيا نباح كلابهم وأصوات ديوكهم ثم قلبها فقتلهم فذلك قوله \"والمؤتفكة أهوى\" ومن لم يمت حتى سقط للأرض أمطر الله عليه وهو تحت الأرض الحجارة ومن كان منهم شاذا في الأرض يتبعهم في القرى فكان الرجل يتحدث فيأتيه الحجر فيقتله فذلك قوله عز وجل \"وأمطرنا عليهم\" أي في القرى حجارة من سجيل هكذا قال السدي وقوله \" وما هي من الظالمين ببعيد\" أي وما هذه النقمة ممن تشبه بهم في ظلمهم ببعيد عنه وقد ورد في الحديث المروى في السنن عن ابن عباس مرفوعا \"من وجدتموه يعمل عمل قوم لوط فاقتلوا الفاعل والمفعول به\" وذهب الإمام الشافعي في قول عنه وجماعة من العلماء إلى أن اللائط يقتل سواء كان محصنا أو غير محصن عملا بهذا الحديث وذهب الإمام أبو حنيفة إلى أنه يلقى من شاهق ويتبع بالحجارة كما فعل الله بقوم لوط والله سبحانه وتعالى أعلم بالصواب."
    },
    {
      "ayah": 84,
      "surah": 11,
      "text": "يقول تعالى ولقد أرسلنا إلى مدين وهم قبيلة من العرب كانوا يسكنون بين الحجاز والشام قريبا من معان. بلادا تعرف بهم يقال لها مدين فأرسل الله إليهم شعيبا وكان من أشرفهم نسبا ولهذا قال \"أخاهم شعيبا\" يأمرهم بعبادة الله تعالى وحده لا شريك له وينهاهم عن التطفيف في المكيال والميزان \"إني أراكم بخير\" أي في معيشتكم ورزقكم وإني أخاف أن تسلبوا ما أنتم فيه بانتهاككم محارم الله \"وإني أخاف عليكم عذاب يوم محيط\" أي في الدار الآخرة."
    },
    {
      "ayah": 85,
      "surah": 11,
      "text": "ينهاهم أولا عن نقص المكيال والميزان إذا أعطوا الناس ثم أمرهم بوفاء الكيل والوزن بالقسط آخذين ومعطين ونهاهم عن العثو في الأرض بالفساد وقد كانوا يقطعون الطريق."
    },
    {
      "ayah": 86,
      "surah": 11,
      "text": "وقوله \"بقية الله خير لكم\" قال ابن عباس: رزق الله خير لكم وقال الحسن رزق الله خير من بخسكم الناس وقال الربيع بن أنس وصية الله خير لكم وقال مجاهد طاعة الله وقال قتادة حظكم من الله خير لكم وقال عبدالرحمن بن زيد بن أسلم: الهلاك في العذاب والبقية في الرحمة وقال أبو جعفر بن جرير \"بقية الله خير لكم\" أي ما يفضل لكم من الربح بعد وفاء الكيل والميزان خير لكم من أخذ أموال الناس قال وقد روي هذا عن ابن عباس قلت ويشبه قوله تعالى \"قل لا يستوي الخبيث والطيب ولو أعجبك كثرة الخبيث\" الآية وقوله \"وما أنا عليكم بحفيظ\" أي برقيب ولا حفيظ أي افعلوا ذلك لله عز وجل لا تفعلوه ليراكم الناس بل لله عز وجل."
    },
    {
      "ayah": 87,
      "surah": 11,
      "text": "يقولون له على سبيل التهكم قبحهم الله \"أصلاتك\" قال الأعمش أي قراءتك \"تأمرك أن تترك ما يعبد آباؤنا\" أي الأوثان والأصنام أو أن نفعل في أموالنا ما نشاء فنترك التطفيف عن قولك وهي أموالنا نفعل فيها ما نريد قال الحسن في قوله \"أصلوتك تأمرك أن نترك ما يعبد آباؤنا\" أي والله إن صلاته لتأمرهم أن يتركوا ما كان يعبد آباؤهم وقال الثوري في قوله \"أو أن نفعل في أموالنا ما نشاء\" يعنون الزكاة \"إنك لأنت الحليم الرشيد\" قال ابن عباس وميمون بن مهران وابن جريج وأسلم وابن جرير: يقولون ذلك أعداء الله على سبيل الاستهزاء قبحهم الله ولعنهم عن رحمته وقد فعل."
    },
    {
      "ayah": 88,
      "surah": 11,
      "text": "يقول لهم أرأيتم يا قوم إن كنت \"علي بينة من ربي\" أي علي بصيرة فيما أدعوا إليه \"ورزقني منه رزقا حسنا\" قيل أرد النبوة وقيل أرد الرزق الحلال ويحتمل الأمرين وقال الثوري \"وما أريد أن أخالفكم إلي ما أنهاكم عنه\" أي لا أنهاكم عن الشيء وأخالف أنا في السر فافعله خفيه عنكم كما قال قتادة في قوله \"وما أريد أن أخالفكم إلي ما أنهاكم عنه\" يقول لم أكن أنهاكم عن أمر وارتكبه \"إن أريد إلا الإصلاح ما استطعت\" أي فيما آمركم وأنهاكم إنما أريد إصلاحكم جهدي وطاقتي \"وما توفيقي\" أي في إصابة الحق فيما أريده \"إلا بالله عليه توكلت\" في جميع أموري \"وإليه أنيب\" أي أرجع قاله مجاهد قال الإمام أحمد: حدثنا عفان حدثنا حماد بن سلمة حدثنا أبو قزعة سويد بن حجير الباهلي عن حكيم بن معاوية عن أبيه أن أخاه مالكا قال: يا معاوية إن محمدا أخذا جيراني فانطلق إليه فإنه قد كلمك وعرفك فانطلقت معه فقال: دع لي جيراني فقد كانوا أسلموا فأعرض عنه فقام مغضبا فقال: أما والله لئن فعلت إن الناس يزعمون أنك لتأمرنا بالأمر وتخالف إلي غيره وجعلت أجره وهو يتكلم فقال رسول الله \"ما تقول؟\" فقال إنك والله لئن فعلت ذلك إن الناس ليزعمون أنك لتأمر بالأمر وتخالف إلي غيره قال فقال \"أو قد قالوها: - أي قائلهم - ولئن فعلت ما ذاك إلا علي وما عليهم من ذلك من شيء أرسلوا له جيرانه\" وقال أيضا: حدثنا عبدالرزاق حدثنا معمر عن بهز بن حكيم عن أبيه عن جده قال: أخذ النبي صلي الله عليه وسلم ناسا من قومي في تهمة فحبسهم فجاء رجل من قومي إلي رسول الله صلي الله عليه وسلم وهو يخطب فقال يا محمد علام تحبس جيراني؟ فصمت رسول الله صلي الله عليه وسلم فقال: أن ناسا ليقولون إنك تنهي عن الشيء وتستخلي به فقال النبي صلي الله عليه وسلم \"ما تقول\" قال: فجعلت أعرض بينهما كلاما مخافة أن يسمعها فيدعو علي قومي دعوة لا يفلحون بعدها أبدا فلم يزل رسول الله صلي الله عليه وسلم حتي فهمها فقال \"قد قالوها أو قائلها منهم والله لو فعلت لكان علي وما كان عليهم خلوا عن جيرانه\" من هذا القبيل الحديث الذي رواه الإمام أحمد: حدثنا أبو عامر حدثنا سليمان بن بلال عن ربيعة بن أبي عبدالرحمن عن الملك بن سعيد بن سويد الأنصاري قال: سمعت أبا حميد وأبا أسيد يقولان عنه صلي الله عليه وسلم إنه قال \"إذا سمعتهم الحديث عني تعرفه قلوبكم وتلين له أشعاركم وأبشاركم وترون أنه منكم قريب فأنا أولاكم به وإذا سمعتم الحديث عني تنكره قلوبكم وتنفر منه أشعارهم وأبشاركم وترون أنه منكم بعيد فأنا أبعدكم منه\" إسناده صحيح وقد أخرج مسلم بهذا السند حديث \"إذا دخل أحدكم المسجد فليقل اللهم أفتح لي أبواب رحمتك وإذا خرج فليقل: اللهم إني أسالك من فضللك\" ومعناه والله أعلم مهما بلغكم عني من خير فأنا أولاكم به ومهما يكن من مكروه فأنا أبعدكم منه \"وما أريد أن أخالفكم إلي ما أنهاكم عنه\" وقال قتادة عن عروة عن الحسن العرني عن يحيى بن البزار عن مسروق قال: جاءت أمرأة إلي ابن مسعود فقالت تنهي عن الواصلة؟ قال نعم قالت: فعله بعض نسائك فقال: ما حفظت وصية العبد الصالح إذا \"وما أريد أن أخالفكم إلي ما نهاكم عنه\" وقال عثمان بن أبي شيبة حدثنا جرير عن أبي سليمان الضبي قال: كانت تجيئنا كتب عمر بن عبدالعزيز فيها الأمر والنهي فيكتب في آخرها وما كنت من ذلك إلا كما قال العبد الصالح \"وما توفيقي إلا بالله عليه توكلت وإليه أنيب\"."
    },
    {
      "ayah": 89,
      "surah": 11,
      "text": "يقول لهم \"ويا قوم لا يجر منكم شقاقي\" أي لا تحملنكم عدواتي وبغضي علي الإصرار علي ما أنتم عليه من الكفر والفساد فيصيبكم مثل ما أصاب قوم نوح وقوم هود وقوم صالح وقوم لوط ومن النقمة والعذاب وقال قتادة \"ويا قوم لا يجر منكم شقاقي\" يقول ويحملنكم فراقي وقال السدي: عدواتي علي أن تمادوا في الضلال والكفر فيصيبكم من العذاب وما أصابهم وقال ابن أبي حاتم: حدثنا ابن عوف الحمصي حدثنا أبو المغيرة عبدالقدوس بن الحجاج حدثنا ابن أبي عيينة حدثني عبدالملك بن أبي سليمان عن أبن أبي ليلى الكندي قال: كنت مع مولاي أمسك دابته وقد أحاط الناس بعثمان بن عفان إذ أشرف علينا من داره فقال \"يا قوم لا يجر منكم شقاقي أن يصيبكم مثل ما أصاب قوم نوح أو قوم هود أو قوم صالح\" يا قوم لا تقتلوني إنكم إن قتلتموني كنتم هكذا وشبك بين أصابعه وقوله \"وما قوم لوط منكم ببعيد\" قيل المراد في الزمان قال قتادة: يعني إنما هلكوا بين أيديكم بالأمس وقيل في المكان ويحتمل الأمران."
    },
    {
      "ayah": 9,
      "surah": 11,
      "text": "يخبر تعالى عن الإنسان وما فيه من الصفات الذميمة إلا من رحم الله من عباده المؤمنين أنه إذا أصابته شدة بعد نعمة حصل له يأس وقنوط من الخير بالنسبة إلى المستقبل وكفر وجحود لماضي الحال كأنه لم ير خيرا ولم يرج بعد ذلك فرجا."
    },
    {
      "ayah": 90,
      "surah": 11,
      "text": "\"واستغفروا\" ربكم من سالف الذنوب \"ثم توبوا إليه\" فما تستقبلونه من الأعمال السيئة وقوله \"إن ربي رحيم ودود\" أي لمن تاب."
    },
    {
      "ayah": 91,
      "surah": 11,
      "text": "يقولون \"يا شعيب ما نفقة\" ما نفهم \"كثيرا\" من قولك \"وإنا لنراك فينا ضعيفا\" قال سعيد بن جبير والثوري: وكان ضرير البصر. وقال الثوري: كان يقال له خطيب الأنبياء. قال السدي \"وإنا لنراك فينا ضعيفا\" قال أنت واحد وقال أبو روق يعنون ذليلا لأن عشيرتك ليسوا علي دينك \"ولولا رهطك لرجمناك\" أي قومك لولا معزتهم علينا لرجمناك قيل بالحجارة وقيل لسببناك \"وما أنت علينا بعزيز\" أي ليس عندنا لك معزة."
    },
    {
      "ayah": 92,
      "surah": 11,
      "text": "\"قال يا قوم أرهطي أعز عليكم من الله\" يقول أتتركوني لأجل قومي ولا تتركوني إعظاما لجناب الرب تبارك وتعالى أن تنالوا نبيه بمساءة وقد أتخذتم كتاب الله \"وراءكم ظهريا\" أي نبذتموه خلفكم ولا تطيعونه ولا تعظمونه \"وإن ربي بما تعلمون محيط\" أي هو يعلم جميع أعمالكم وسيجزيكم."
    },
    {
      "ayah": 93,
      "surah": 11,
      "text": "لما يئس نبي الله شعيب من استجابتهم له قال يا قوم \"أعملوا علي مكانتكم\" أي طريقتكم وهذا تهديد شديد \"إني عامل\" علي طريقتي \"سوف تعملون من يأتيه عذاب يخزيه ومن هو كاذب\" أي مني ومنكم \"وارتقبوا\" أي أنتظروا \"إني معكم رقيب\"."
    },
    {
      "ayah": 94,
      "surah": 11,
      "text": "قال الله تعالى \"ولما جاء أمرنا نجينا شعيبا والذين آمنوا معه برحمة منا وأخذت الذين ظلموا الصيحة فأصحبوا في ديارهم جاثمين\" وقوله جاثمين أي هامدين لا حراك بهم وذكر هنها أنه أتتم صحية وفي الأعراف رجفة وفي الشعراء عذاب يوم الظلة وهم أمة واحدة اجتمع عليهم يوم عذابهم هذه النقم كلهم وأنما ذكر في كل سياق ما يناسبه ففي الأعراف لما قالوا \"لنخرجنك يا شعيب والذين آمنوا معكم من قريتنا\" ناسب أن يذكر هناك الرجفة فرجفت بهم الأرض التي ظلموا بها وأرادوا إخراج نبيهم منها وههنا لما أساءوا الأدب في مقالتهم عل نبيهم ذكر الصحية التي استلبثتهم وأخمدتهم وفي الشعراء لما قالو \"فاسقط علينا كسفا من السماء إن كنت من الصادقين\" قال \"فأخذهم عذاب يوم الظلة إنه كان عذاب يوم عظيم\" وهذا من الأسرار الدقيقة ولله الحمد والمنة كثيرا دائما."
    },
    {
      "ayah": 95,
      "surah": 11,
      "text": "وقوله \"كأن لم يغنوا فيها\" أي يعيشوا في دارهم قبل ذلك \"ألا بعدا لمدين كما بعدت ثمود\" وكانوا جيرانهم قريبا منهم في الدار وشبيها بهم في الكفر وقطع الطرق وكانوا عربا مثلهم."
    },
    { "ayah": 96, "surah": 11, "text": "يقول تعالى مخبرا عن إرسال موسى بآياته ودلالاته الباهرة." },
    {
      "ayah": 97,
      "surah": 11,
      "text": "إلى فرعون ملك القبط وملائه \"فاتبعوا أمر فرعون\" أي منهجه ومسلكه وطريقته في الغي \"وما أمر فرعون برشيد\" أي ليس فيه رشد ولا هدى وإنما هو جهل وضلال وكفر وعناد وكما أنهم اتبعوه في الدنيا وكان مقدمهم ورئيسهم كذلك هو يقدمهم يوم القيامة إلى نار جهنم فأوردهم إياها وشربوا من حياض رداها وله في ذلك الحظ الأوفر من العذاب الأكبر كما قال تعالى \"فعصى فرعون الرسول فأخذناه أخذا وبيلا\" وقال تعالى \"فكذب وعصى ثم أدبر يسعى فحشر فنادى فقال أنا ربكم الأعلى فأخذه الله نكال الآخرة والأولى إن في ذلك لعبرة لمن يخشى\"."
    },
    {
      "ayah": 98,
      "surah": 11,
      "text": "وقال تعالى \"يقدم قومه يوم القيامة فأوردهم النار وبئس الورد المورود\" وكذلك شأن المتبوعين يكونون موفورين في العذاب يوم القيامة كما قال تعالى \"لكل ضعف ولكن لا تعلمون\" وقال تعالى إخبارا عن الكفرة أنهم يقولون في النار \"ربنا إنا أطعنا سادتنا وكبراءنا فأضلونا السبيلا ربنا آتهم ضعفين من العذاب\" الآية وقال الإمام أحمد: حدثنا هشيم حدثنا أبو الجهم عن الزهري عن أبي سلمة عن أبي هريرة قال: قال رسول الله صلي الله عليه وسلم \"امرؤ القيس حامل لواء شعراء الجاهلية إلى النار\"."
    },
    {
      "ayah": 99,
      "surah": 11,
      "text": "وقوله \"وأتبعوا في هذه لعنة ويوم القيامة\" الآية أي أتبعناهم زيادة على عذاب النار لعنة في الدنيا \"ويوم القيامة بئس الرفد المرفود\" قال مجاهد: زيدوا لعنة يوم القيامة فتلك لعنتان وقال علي بن أبي طلحة عن ابن عباس \"بئس الرفد المرفود\" قال لعنة الدنيا والآخرة وكذا قال الضحاك وقتادة وهو كقوله \"وجعلناهم أئمة يدعون إلى النار ويوم القيامة لا ينصرون وأتبعناهم في هذه الدنيا لعنة ويوم القيامة هم من المقبوحين\" وقال تعالى \"النار يعرضون عليها غذوا وعشيا ويوم تقوم الساعة أدخلوا آل فرعون أشد العذاب\"."
    }
  ]
}
