{
  "ayahs": [
    {
      "ayah": 1,
      "surah": 110,
      "text": "سورة النصر: قد تقدم أنها تعدل ربع القرآن وإذا زلزلت تعدل ربع القرآن. وقال النسائي أخبرنا محمد بن إبراهيم أخبرنا جعفر عن أبي العميس ح وأخبرنا محمد بن سليمان حدثنا جعفر بن عون حدثنا أبو العميس عن عبدالمجيد بن سهيل عن عبيدالله بن عبدالله بن عتبة قال: قال لي ابن عباس يا ابن عتبة أتعلم آخر سورة من القرآن نزلت؟ قلت نعم \"إذا جاء نصر الله والفتح\" قال صدقت. وروى الحافظان أبو بكر البزار والبيهقي من حديث موسى بن عبيدة البريدي عن صدقة بن يسار عن ابن عمر قال: أنزلت هذه السورة \"إذا جاء نصر الله والفتح\" على رسول الله صلى الله عليه وسلم أوسط أيام التشريق فعرف أنه الوداع فأمر براحلته القصواء فرحلت ثم قام فخطب الناس فذكر خطبته المشهورة. وقال الحافظ البيهقي أخبرنا علي بن أحمد بن عبدان أخبرنا أحمد بن عبيد الصفار حدثنا الإسقاطي حدثنا سعيد بن سليمان حدثنا عباد بن العوام عن هلال بن خباب عن عكرمة عن ابن عباس قال: لما نزلت \"إذا جاء نصر الله والفتح\" دعا رسول الله صلى الله عليه وسلم فاطمة وقال \"إنه قد نعيت إلي نفسي\" فبكت ثم ضحكت وقالت أخبرني أنه نعيت إليه نفسه فبكيت ثم قال اصبري فإنك أول أهلي لحاقا بي فضحكت وقد رواه النسائي كما سيأتي بدون ذكر فاطمة. قال البخاري حدثنا موسى بن إسماعيل حدثنا أبو عوانة عن أبي بشر عن سعيد بن جبير عن ابن عباس قال: كان عمر يدخلني مع أشياخ بدر فكأن بعضهم وجد في نفسه فقال لم يدخل هذا معنا ولنا أبناء مثله؟ فقال عمر إنه ممن فد علمتم فدعاهم ذات يوم فأدخلني معهم فما رأيت أنه دعاني فيهم يومئذ إلا ليريهم فقال ما تقولون في قول الله عز وجل \"إذا جاء نصر الله والفتح\"؟ فقال بعضهم أمرنا أن نحمد الله ونستغفره إذا نصرنا وفتح علينا وسكت بعضهم فلم يقل شيئا فقال لي أكذلك تقول يا ابن عباس؟ فقلت لا فقال ما تقول؟ فقلت هو أجل رسول الله صلى الله عليه وسلم أعلمه له قال \"إذا جاء نصر الله والفتح\" فذلك علامة أجلك قال عمر بن الخطاب لا أعلم منها إلا ما تقول تفرد به البخاري."
    },
    {
      "ayah": 2,
      "surah": 110,
      "text": "وروى ابن جرير عن محمد بن حميد عن مهران عن الثوري عن عاصم عن أبي رزين عن ابن عباس فذكر مثل هذه القصة أو نحوها. وقال الإمام أحمد حدثنا محمد بن فضيل حدثنا عطاء عن سعيد بن جبير عن ابن عباس قال لما نزلت \"إذا جاء نصر الله والفتح\" قال رسول الله صلى الله عليه وسلم \"نعيت إلي نفسي\" فإنه مقبوض في تلك السنة تفرد به أحمد وروى العوفي عن ابن عباس مثله وهكذا قال مجاهد وأبو العالية والضحاك وغير واحد إنها أجل رسول الله صلى الله عليه وسلم نعي إليه. وقال ابن جرير حدثني إسماعيل بن موسى حدثنا الحسن بن عيسى الحنفي عن معمر عن الزهري عن أبي حازم عن ابن عباس قال: بينما رسول الله صلى الله عليه وسلم في المدينة إذ قال \"الله اكبر الله اكبر جاء نصر الله والفتح جاء أهل اليمن - قيل يا رسول الله وما أهل اليمن؟ قال - قوم رقيقة قلوبهم لينة طباعهم الإيمان يمان والفقه يمان والحكمة يمانية\". ثم رواه ابن عبدالأعلى عن أبي عن معمر عن عكرمة مرسلا. وقال الطبراني حدثنا زكريا بن يحيى حدثنا أبو كامل الجحدري حدثنا أبو عوانة عن هلال بن خباب عن عكرمة عن ابن عباس قال لما نزلت \"إذا جاء نصر الله والفتح\" حتى ختم السورة قال: نعيت لرسول الله صلى الله عليه وسلم نفسه حين نزلت قال فأخذ بأشد ما كان قط اجتهادا في أمر الآخرة. وقال رسول الله صلى الله عليه وسلم: بعد ذلك \"جاء الفتح ونصر الله وجاء أهل اليمن\" فقال رجل يا رسول الله وما أهل اليمن؟ قال \"قوم رقيقة قلوبهم لينة طباعهم الإيمان يمان والفقه يمان\" وقال الإمام أحمد حدثنا أحمد حدثنا وكيع عن سفيان عن عاصم عن أبي رزين عن ابن عباس قال: لما نزلت \"إذا جاء نصر الله والفتح\" علم النبي صلى الله عليه وسلم أنه قد نعيت إليه نفسه فقيل إذا جاء نصر الله والفتح السورة كلها. حدثنا وكيع عن سفيان عن عاصم عن أبي رزين أن عمر سأل ابن عباس عن هذه الآية \"إذا جاء نصر الله والفتح\" قال لما نزلت نعيت إلى رسول الله صلى الله عليه وسلم نفسه. وقال الطبراني حدثنا إبراهيم بن أحمد بن عمر الوكيعي حدثنا أبي حدثنا جعفر عن عون عن أبي العميس عن أبي بكر بن أبي الجهم عن عبيد الله بن عتبة عن ابن عباس قال آخر سورة نزلت من القرآن جميعا \"إذا جاء نصر الله والفتح\" وقال الإمام أحمد أيضا حدثنا محمد بن جعفر حدثنا شعبة عن عمرو بن مرة عن أبي البحتري الطائي عن أبي سعيد الخدري أنه قال لما نزلت هذه السورة \"إذا جاء نصر الله والفتح\" قرأها رسول الله صلى الله عليه وسلم حتى ختمها فقال \"الناس خير وأنا وأصحابى خير - وقال - لا هجرة بعد الفتح ولكن جهاد ونية\" فقال له مروان كذبت وعنده رافع بن خديج وزيد بن ثابت قاعدان معه على السرير فقال أبو سعيد لو شاء هذان لحدثاك ولكن هذا يخاف أن تنزعه عن عرافة قومه وهذا يخشى أن تنزعه عن الصدقة فرفع مروان عليه الدرة ليضربه فلما رأيا ذلك قالا صدق. تفرد به أحمد وهذا الذي أنكره مروان على أبي سعيد ليس بمنكر فقد ثبت من رواية ابن عباس أن رسول الله صلى الله عليه وسلم قال يوم الفتح \"لا هجرة ولكن جهاد ونية ولكن إذا استنفرتم فانفروا\" أخرجه البخاري ومسلم في صحيحيهما فالذي فسر به بعض الصحابة من جلساء عمر رضي الله عنهم أجمعين من أنه قد أمرنا إذا فتح الله علينا المدائن والحصون أن نحمد الله ونشكره ونسبحه يعني نصلي له ونستغفره. معنى مليح صحيح. وقد ثبت له شاهد من صلاة النبي صلى الله عليه وسلم يوم فتح مكة وقت الضحى ثماني ركعات فقال قائلون هي صلاة الضحى وأجيبوا بأنه لم يكن يواظب عليها فكيف صلاها ذلك اليوم وقد كان مسافرا لم ينو الإقامة بمكة؟ ولهذا أقام فيها إلى آخر شهر رمضان قريبا من تسع عشرة يوما يقصر الصلاة ويفطر هو وجميع الجيش وكانوا نحوا من عشرة آلاف قال هؤلاء وإنما كانت صلاة الفتح قالوا فيستحب لأمير الجيش إذا فتح بلدا أن يصلي فيه أول ما يدخله ثماني ركعات وهكذا فعل سعد بن أبي وقاص يوم فتح المدائن ثم قال بعضهم يصليها كلها بتسليمة واحدة والصحيح أنه يسلم من كل ركعتين كما ورد في سنن أبي داود أن رسول الله صلى الله عليه وسلم كان يسلم يوم الفتح من كل ركعتين وأما ما فسر به ابن عباس وعمر رضي الله تعالى عنهما من أن هذه السورة نص فيها إلى رسول الله صلى الله عليه وسلم روحه الكريمة واعلم أنك إذا فتحت مكة وهي قريتك التي أخرجتك ودخل الناس في دين الله أفواجا فقد فرغ شغلنا بك في الدنيا فتهيأ للقدوم علينا والوفود إلينا فالآخرة خير لك من الدنيا ولسوف يعطيك ربك فترضى."
    },
    {
      "ayah": 3,
      "surah": 110,
      "text": "قال النسائي أخبرنا عمرو بن منصور حدثنا محمد بن محبوب حدثنا أبو عوانة عن هلال بن خباب عن عكرمة عن ابن عباس قال لما نزلت \"إذا جاء نصر الله والفتح\" إلى آخر السورة قال نعيت لرسول الله صلى الله عليه وسلم نفسه حين أنزلت فأخذ في أشد ما كان اجتهادا في أمر الآخرة وقال رسول الله صلى الله عليه وسلم بعد ذلك \"جاء الفتح وجاء نصر الله وجاء أهل اليمن\" فقال رجل يا رسول الله وما أهل اليمن؟ قال \"قوم رقيقة قلوبهم لينة قلوبهم الإيمان يمان والحكمة يمانية والفقه يمان\". وقال البخاري حدثنا عثمان بن أبي شيبة حدثنا جرير عن منصور عن أبي الضحى عن مسروق عن عائشة قالت: كان رسول الله صلى الله عليه وسلم يكثر أن يقول في ركوعه وسجوده \"سبحانك اللهم ربنا وبحمدك اللهم اغفر لي\" يتأول القرآن وأخرجه بقية الجماعة إلا الترمذي من حديث منصور به وقال الإمام أحمد حدثنا محمد بن أبي عدي عن داود عن الشعبي عن مسروق قال: قالت عائشة كان رسول الله صلى الله عليه وسلم يكثر في آخر أمره من قول \"سبحان الله وبحمده أستغفر الله وأتوب إليه\" وقال \"إن ربي كان أخبرني أني سأرى علامة في أمتي وأمرني إذا رأيتها أن أسبح بحمده وأستغفره إنه كان توابا فقد رأيتها \"إذا جاء نصر الله والفتح ورأيت الناس يدخلون في دين الله أفواجا فسبح بحمد ربك واستغفره إنه كان توابا\" ورواه مسلم من طريق داود بن أبي هند به. وقال ابن جرير حدثنا أبو السائب حدثنا حفص حدثنا عاصم عن الشعبي عن أم سلمة قالت كان رسول الله صلى الله عليه وسلم في آخر أمره لا يقوم ولا يقعد ولا يذهب ولا يجيء إلا قال \"سبحان الله وبحمده\" فقلت يا رسول الله رأيتك تكثر من سبحان الله وبحمده لا تذهب ولا يجيء ولا تقوم ولا تقعد إلا قلت: سبحان الله وبحمده قال: إني أمرت بها فقال \"إذا جاء نصر الله والفتح \"إلى آخر السورة. غريب وقد كتبنا حديث كفارة المجلس من جميع طرقه وألفاظه في جزء مفرد فيكتب ههنا. وقال الإمام أحمد حدثنا وكيع عن إسرائيل عن أبن إسحاق عن أبي عبيدة عن عبدالله قال لما نزلت على رسول الله صلى الله عليه وسلم \"إذا جاء نصر الله والفتح\" كان يكثر إذا قرأها وركع أن يقول \"سبحانك اللهم ربنا وبحمدك اللهم اغفر لي إنك أنت التواب الرحيم\" ثلاثا تفرد به أحمد. ورواه ابن أبي حاتم عن أبيه عن عمرو بن مرة عن شعبة عن إسحاق به والمراد بالفتح ههنا فتح مكة قولا واحدا فإن أحياء العرب كانت تتلوم بإسلامها فتح مكة يقولون إن ظهر على قومه فهو نبي فلما فتح الله عليه مكة دخلوا في دين الله أفواجا فلم تمض سنتان حتى استوسقت جزيرة العرب إيمانا ولم يبق في سائر قبائل العرب إلا مظهر للإسلام ولله الحمد والمنة. وقد روى البخاري في صحيحه عن عمرو بن سلمة قال: لما كان الفتح بادر كل قوم بإسلامهم إلى رسول الله صلى الله عليه وسلم وكانت الأحياء تتلوم بإسلامها فتح مكة يقولون دعوه وقومه فإن ظهر عليهم فهو نبي الحديث وقد حررنا غزوة الفتح في كتابنا \"السيرة\" فمن أراد فليراجعه هناك ولله الحمد والمنة. وقال الإمام أحمد حدثنا معاوية بن عمرو حدثنا أبو إسحاق عن الأوزاعي حدثني أبو عمار حدثني جار لجابر بن عبدالله قال قدمت من سفر فجاءني جابر بن عبدالله فسلم علي فجعلت أحدثه عن افتراق الناس ومما أحدثوا فجعل جابر يبكي ثم قال سمعت رسول الله صلى الله عليه وسلم يقول \"إن الناس دخلوا في دين الله أفواجا وسيخرجون منه أفواجا\". آخر تفسير سورة النصر ولله الحمد والمنة."
    }
  ]
}
