{
  "ayahs": [
    {
      "ayah": 1,
      "surah": 111,
      "text": "قال البخاري حدثنا محمد بن سلام حدثنا أبو معاوية حدثنا الأعمش عن عمرو بن مرة عن سعيد بن جبير عن ابن عباس أن النبي صلى الله عليه وسلم خرج إلى البطحاء فصعد الجبل فنادى \"يا صباحاه\" فاجتمعت إليه قريش فقال \"أرأيتم إن حدثتكم أن العدو مصبحكم أو ممسيكم أكنتم تصدقونى؟ - قالوا نعم قال- فإنى نذير لكم بين يدي عذاب شديد فقال أبو لهب ألهذا جمعتنا؟ تبا لك فأنزل الله \"تبت يدا أبي لهب وتب\" إلى آخرها. وفي رواية فقام ينفض يديه وهو يقول تبا لك سائر اليوم ألهذا جمعتنا؟ فأنزل الله \"تبت يدا أبي لهب وتب\" الأول دعاء عليه والثانى خبر عنه فأبو لهب هذا هو أحد أعمام رسول الله صلى الله عليه وسلم واسمه عبد العزي بن عبد المطلب وكنيته أبو عتيبة وإنما سمى أبا لهب لإشراق وجهه وكان كثير الأذية لرسول الله صلى الله عليه وسلم والبغضة له والازدراء به والتنقص له ولدينه. قال الإمام أحمد حدثنا إبراهيم بن أبي العباس حدثنا عبدالرحمن بن أبي الزناد عن أبيه قال أخبرني رجل يقال له ربيعة بن عباد من بني الديل وكان جاهليا فأسلم قال: رأيت النبي صلى الله عليه وسلم في الجاهليه في سوق ذي المجاز وهو يقول \"يا أيها الناس قولوا لا إله إلا الله تفلحوا\" والناس مجمعون عليه ووراءه رجل وضيء الوجه أحول ذو غديرتين يقول إنه صابئ كاذب يتبعه حيث ذهب فسألت عنه فقالوا هذا عمه أبو لهب ثم رواه عن شريح عن ابن أبي الزناد عن أبيه فذكره قال أبو الزناد قلت لربيعة كنت يومئذ صغيرا؟ قال لا والله إتي يومئذ لأعقل أني أزفر القربة تفرد به أحمد. وقال محمد بن إسحاق حدثني حسين بن عبدالله بن عبيدالله بن عباس قال سمعت ربيعة بن عباد الديلى يقول إنى لمع أبي رجل شاب أنظر إلى رسول الله صلى الله عليه وسلم يتبع القبائل ووراءه رجل أحول وضيء الوجه ذو جمة يقف رسول الله صلى الله عليه وسلم على القبيلة فيقول \"يا بني فلان إنى رسول الله إليكم آمركم أن تعبدوا الله لا تشركوا به شيئا وأن تصدقوني وتمنعوني حتى أنفذ عن الله ما بعثني به \"وإذا فرغ من مقالته قال الآخر من خلفه يا بني فلان هذا يريد منكم أن تسلخوا اللات والعزى وحلفاءكم من الجن من بني مالك بن أقيش إلى ما جاء به من البدعة والضلالة فلا تسمعوا له ولا تتبعوه فقلت لأبي من هذا؟ قال عمه أبو لهب رواه أحمد أيضا والطبراني بهذا اللفظ قوله تعالى \"تبت يدا أبي لهب\" أى خسر وخاب وضل عمله وسعيه \"وتب\" أي وقد تب تحقق خسارته وهلاكه."
    },
    {
      "ayah": 2,
      "surah": 111,
      "text": "قال ابن عباس وغيره \"وما كسب\" يعني ولده وروي عن عائشة ومجاهد وعطاء والحسن وابن سيرين مثله وذكر عن ابن مسعود أن رسول الله صلى الله عليه وسلم لما دعا قومه إلى الإيمان قال أبو لهب إن كان ما يقول ابن أخي حقا فإني أفتدي نفسي يوم القيامة من العذاب بمالي وولدي فأنزل الله تعالى \"ما أغنى عنه ماله وما كسب\"."
    },
    { "ayah": 3, "surah": 111, "text": "أي ذات شرر ولهب وإحراق شديد." },
    {
      "ayah": 4,
      "surah": 111,
      "text": "وكانت زوجته من سادات نساء قريش وهي أم جميل واسمها أروى بنت حرب بن أمية وهى أخت أبي سفيان وكانت عونا لزوجها على كفره وجحوده وعناده فلهذا تكون يوم القيامة عونا عليه في عذابه في نار جهنم ولهذا قال تعالى \"حمالة الحطب في جيدها حبل من مسد\" قال مجاهد وعروة من مسد النار وعن مجاهد وعكرمة والحسن وقتادة والثوري والسدي \"حمالة الحطب\" كانت تمشي بالنميمة واختاره ابن جرير. وقال العوفي عن ابن عباس وعطية الجدلي والضحاك وابن زيد كانت تضع الشوك في طريق رسول الله صلى الله عليه وسلم قال ابن جرير كانت تعير النبي صلى الله عليه وسلم بالفقر وكانت تحتطب فعيرت بذلك كذا حكاه ولم يعزه إلى أحد والصحيح الأول والله أعلم."
    },
    {
      "ayah": 5,
      "surah": 111,
      "text": "قال سعيد بن المسيب كانت لها قلادة فاخرة فقالت لأنفقنها في عداوة محمد يعني فأعقبها الله منها حبلا في جيدها من مسد النار: وقال ابن جرير حدثنا أبو كريب حدثنا وكيع عن سليم مولى الشعبي عن الشعبى قال المسد الليف وقال عروة بن الزبير: المسد سلسلة ذرعها سبعون ذراعا وعن الثوري هو قلادة من نار طولها سبعون ذراعا وقال الجوهري المسد الليف والمسد أيضا حبل من ليف أو خوص وقد يكون من جلود الإبل أو أوبارها ومسدت الحبل أمسده مسدا إذا أجدت فتله. وقال مجاهد \"في جيدها حبل من مسد\" أي طوق من حديد ألا ترى أن العرب يسمون البكرة مسدا؟ وقال ابن أبي حاتم حدثنا أبى وأبو زرعة قالا حدثنا عبدالله بن الزبير الحميدي حدثنا سفيان حدثنا الوليد بن كثير عن أبي بدرس عن أسماء بنت أبي بكر قالت لما نزلت \"تبت يدا أبي لهب\" أقبلت العوراء أم جميل بنت حرب ولها ولوله وفي يدها فهر وهي تقول: مذمما أبينا ودينه قلينا وأمره عصينا ورسول الله صلى الله عليه وسلم جالس فى المسجد ومعه أبو بكر فلما رآها أبو بكر قال يا رسول الله قد أقبلت وأنا أخاف عليك أن تراك فقال رسول الله صلى الله عليه وسلم \"إنها لن تراني\" وقرأ قرآنا اعتصم به كما قال تعالى \"وإذا قرأت القرآن جعلنا بينك وبين الذين لا يؤمنون بالآخرة حجابا مستورا\" فأقبلت حتى وقفت على أبي بكر ولم تر رسول الله صلى الله عليه وسلم فقالت يا أبا بكر إنى أخبرت أن صاحبك هجانى قال لا ورب هذا البيت ما هجاك فولت وهي تقول قد علمت قريش أني ابنة سيدها. قال: وقال الوليد في حديثه أو غيره فعثرت أم جميل في مرطها وهي تطوف بالبيت فقالت تعس مذمم فقالت أم حكيم بنت عبدالمطلب إني لحصان فما أكلم وثقاف فما أعلم وكلتانا من بني العم وقريش بعد أعلم وقال الحافظ أبو بكر البزار حدثنا إبراهيم بن سعيد وأحمد بن إسحاق قالا حدثنا أبو أحمد حدثنا عبد السلام بن حرب عن عطاء بن السائب عن سعيد بن جبير عن ابن عباس قال لما نزلت \"تبت يدا أبي لهب\" جاءت امرأة أبي لهب ورسول الله صلى الله عليه وسلم جالس ومعه أبو بكر فقال له أبو بكر لو تنحيت لا تؤذيك بشيء فقال رسول الله صلى الله عليه وسلم \"إنه سيحال بيني وبينها\" فأقبلت حتى وقفت على أبي بكر فقالت يا أبا بكر هجانا صاحبك فقال أبو بكر لا ورب هذه البيت ما ينطق بالشعر ولا يتفوه به فقالت إنك لمصدق فلما ولت قال أبو بكر ما رأتك؟ قال \"لا ما زال ملك يسترني حتى ولت\" ثم قال البزار لا نعلمه يروى بأحسن من هذا الإسناد عن أبي بكر رضي الله عنه. وقد قال بعض أهل العلم في قوله تعالى \"في جيدها حبل من مسد\" أي في عنقها حبل في نار جهنم ترفع به إلى شفيرها ثم ترمى إلى أسفلها ثم كذلك دائما قال أبو الخطاب بن دحية في كتابه التنوير وقد روى ذلك وعبر بالمسد عن حبل الدلو كما قال أبو حنيفة الدينوري في كتاب النبات كل مسد رشاء وأنشد في ذلك: وبكرة ومحورا صرارا ومسدا من أبق مغارا قال والأبق القنب: وقال آخر: يا مسد الخوص تعوذ مني إن تك لدنا لينا فإني ما شئت من أشمط مقسئن قال العلماء وفي هذه السورة معجزة ظاهرة ودليل واضح على النبوة فإنه منذ نزل قوله تعالى \"سيصلى نارا ذات لهب وامرأته حمالة الحطب في جيدها حبل من مسد\" فأخبر عنهما بالشقاء وعدم الإيمان لم يقيض لهما أن يؤمنا ولا واحد منهما لا باطنا ولا ظاهرا لا مسرا ولا معلنا فكان هذا من أقوى الأدلة الباهرة الباطنة على النبوة الظاهرة."
    }
  ]
}
