{
  "ayahs": [
    {
      "ayah": 1,
      "surah": 113,
      "text": "سورة الفلق: قال الإمام أحمد حدثنا عفان حدثنا حماد بن سلمة أخبرنا عاصم بن بهدلة عن زر بن حبيش قال: قلت لأبي بن كعب إن ابن مسعود لا يكتب المعوذتين في مصحفه فقال أشهد أن رسول الله صلي الله عليه وسلم أخبرني أن جبريل عليه السلام قال له: قل \"أعوذ برب الفلق\" فقلتها قال: \"قل أعوذ برب الناس\" فقلتها فنحن نقول ما قال النبي صلي الله عليه وسلم. ورواه أبو بكر الحميدي في مسنده عن سفيان بن عيينة حدثنا عبدة بن أبي لبابة وعاصم بن بهدلة أنهما سمعا زر بن حبيش قال سألت أبى بن كعب عن المعوذتين فقلت يا أبا المنذر إن أخاك ابن مسعود يحك المعوذتين من المصحف فقال: إني سألت رسول الله صلى الله عليه وسلم فقال \"قيل لي قل فقلت\" فنحن نقول كما قال رسول الله صلى الله عليه وسلم. وقال أحمد حدثنا وكيع حدثنا سفيان عن عاصم عن زر قال سألت ابن مسعود عن المعوذتين فقال سألت النبي صلى الله عليه وسلم عنهما فقال \"قيل لي فقلت لكم فقولوا\" قال أبي فقال لنا النبي صلى الله عليه وسلم فنحن نقول; وقال البخاري حدثنا علي بن عبدالله حدثنا سفيان حدثنا عبدة بن أبي لبابة عن زر بن حبيش وحدثنا عاصم بن زر قال سألت أبي بن كعب فقلت أبا المنذر إن أخاك ابن مسعود يقول كذا وكذا فقال إني سألت النبي صلى الله عليه وسلم فقال \"قيل لي فقلت\" فنحن نقول كما قال رسول الله صلى الله عليه وسلم ورواه البخاري أيضا والنسائي عن قتيبة عن سفيان بن عيينة عن عبدة وعاصم بن أبي النجود عن زر بن حبيش عن أبي بن كعب به. وقال الحافظ أبو يعلى حدثنا الأزرق بن علي حدثنا حسان بن إبراهيم حدثنا الصلت بن بهرام عن إبراهيم بن علقمة قال كان عبدالله يحك المعوذتين من المصحف ويقول إنما أمر رسول الله صلى الله عليه وسلم أن يتعوذ بهما ولم يكن عبدالله يقرأ بهما ورواه عبدالله بن أحمد من حديث الأعمش عن أبي إسحاق عن عبدالرحمن بن يزيد قال كان عبدالله يحك المعوذتين من مصاحفه ويقول إنهما ليستا من كتاب الله قال الأعمش وحدثنا عاصم عن زر بن حبيش عن أبى بن كعب قال سألنا عنهما رسول الله صلى الله عليه وسلم قال: \"قيل لي فقلت \"وهذا مشهور عند كثير من القراء والفقهاء وأن ابن مسعود كان لا يكتب المعوذتين في مصحفه فلعله لم يسمعهما من النبي صلى الله عليه وسلم ولم يتواتر عنده ثم لعله قد رجع عن قوله ذلك إلى قول الجماعة فإن الصحابة رضي الله عنهم أثبتوهما في المصاحف الأئمة ونفذوها إلي سائر الآفاق كذلك ولله الحمد والمنة. وقد روى مسلم فى صحيحه حدثنا قتيبة حدثنا جرير عن بيان عن قيس بن أبي حازم عن عقبة بن عامر قال: قال رسول الله صلى الله عليه وسلم \"ألم تر آيات انزلت هذه الليلة لم ير مثلهن قط \"قل أعوذ برب الفلق\" و \"قل أعوذ برب الناس\" ورواه أحمد ومسلم أيضا والترمذي والنسائي من حديث إسماعيل بن أبي خالد عن قيس بن أبي حازم عن عقبة وقال الترمذي حسن صحيح: \"طريق أخرى\" قال الإمام أحمد حدثنا الوليد بن مسلم حدثنا ابن جابر عن القاسم أبي عبدالرحمن عن عقبة بن عامر قال بينا أنا أقود برسول الله صلى الله عليه وسلم في نقب من تلك النقاب إذ قال لي \"يا عقبة ألا تركب\" قال فأشفقت أن تكون معصية قال فنزل رسول الله صلى الله عليه وسلم وركبت هنية ثم ركب ثم قال \"يا عقبة ألا أعلمك سورتين من خير سورتين قرأ بهما الناس\" قلت بلى يا رسول الله فأقرأني \"قل أعوذ برب الفلق\" و \"قل أعوذ برب الناس\" ثم أقيمت الصلاة فتقدم رسول الله صلى الله عليه وسلم فقرأ بهما ثم مر بي فقال \"كيف رأيت يا عقب أقرأ بهما كلما نمت وكلما قمت\" ورواه النسائي من حديث الوليد بن مسلم وعبدالله ابن المبارك كلاهما عن ابن جابر به ورواه أبو داود والنسائي أيضا من حديث ابن وهب عن ميمون بن صالح العلاء بن الحارث عن القاسم بن عبدالرحمن عن عقبة \"طريق أخرى\" قال أحمد حدثنا أبو عبدالرحمن حدثنا سعيد بن أبي أيوب حدثني يزيد بن عبدالعزيز الرعيني وأبو مرحوم عن يزيد بن محمد القرشى عن علي بن رباح عن عقبة بن عامر قال: أمرني رسول الله صلى الله عليه وسلم أن أقرأ بالمعوذات في دبر كل صلاة ورواه أبو داود والترمذي والنسائي من طرق عن علي بن أبي رباح وقال الترمذي غريب. \"طرق أخرى\" قال أحمد حدثنا محمد بن إسحاق حدثنا ابن لهيعة عن مشرح بن عاهان عن عقبة بن عامر قال: قال رسول الله صلى الله عليه وسلم \"اقرأ بالمعودتين فإنك لن تقرأ بمثلهما\" تفرد به أحمد \"طريق أخرى\" قال أحمد حدثنا حيوة بن شريح حدثنا بقية حدثنا بجير بن سعد عن خالد بن معدان عن جبير بن نفير عن عقبة بن عامر أنه قال إن رسول الله صلى الله عليه وسلم أهديت له بغلة شهباء فركبها فأخذ عقبة يقودها له فقال رسول الله اقرأ \"قل أعوذ برب الفلق\" فأعادها له حتى قرأها فعرف أني لم أفرح بها جدا فقال لعلك تهاونت بها؟ فما قمت تصلى بشيء مثلها\" ورواه النسائي عن عمرو بن عثمان عن بقية به ورواه النسائي أيضا من حديث الثوري عن معاوية بن صالح عن عبدالرحمن بن نفير عن أبيه عن عقبة بن عامر أنه سأل رسول الله صلى الله عليه وسلم عن المعوذتين فذكر نحوه \"طريق أخرى\" قال النسائي أخبرنا محمد بن عبدالأعلى حدثنا المعتمر سمعت النعمان عن زياد بن الأسد عن عقبة بن عامر أن رسول الله صلى الله عليه وسلم قال إن الناس لم يتعوذوا بمثل هذين \"قل أعوذ برب الفلق\" و \"قل أعوذ برب الناس\". \"طريق أخرى\" قال النسائي أخبرنا قتيبة حدثنا الليث عن أبي عجلان عن سعيد المقبري عن عقبة بن عامر قال كنت أمشي مع رسول الله صلى الله عليه وسلم فقال \"يا عقبة قل\" قلت ماذا أقول ؟ فسكت عني ثم قال \"قل\" قلت ماذا أقول يا رسول الله؟ قال \"قل أعوذ برب الفلق\" فقرأتها حتى أتيت على آخرها ثم قال \"قل\" فقلت: ماذا أقول يا رسول الله قال: \"قل أعوذ برب الناس\" فقرأتها ثم أتيت على آخرها ثم قال رسول الله صلى الله عليه وسلم عند ذلك \"ما سأل سائل بمثلها ولا استعاذ مستعيذ بمثلها\" \"طريق أخرى\" قال النسائي أخبرنا محمد بن يسار حدثنا عبدالرحمن حدثنا معاوية عن العلاء بن الحارث عن مكحول عن عقبة بن عامر أن رسول الله صلى الله عليه وسلم قرأ بهما فى صلاة الصبح \"طريق أخرى\" قال النسائي أخبرنا قتيبة حدثنا الليث عن يزيد بن أبي حبيب عن أبي عمران أسلم عن عقبة بن عامر قال اتبعت رسول الله صلى الله عليه وسلم وهو راكب فوضعت يدي على قدميه فقلت أقرئني سورة هود أو سورة يوسف فقال \"لن تقرأ شيئا أنفع عند الله من \"قل أعوذ برب الفلق\" \"حديث آخر\" قال النسائي أخبرنا محمود بن خالد حدثنا الوليد حدثنا أبو عمرو الأوزاعي عن يحيى بن أبي كثير عن محمد بن إبراهيم بن الحارث عن أبي عبدالله عن ابن عابس الجهني أن النبي صلى الله عليه وسلم قال له \"يا ابن عابس ألا أدلك - أو- ألا أخبرك بأفضل ما يتعوذ به المتعوذون؟ \"قال بلى يا رسول الله قال \"قل أعوذ برب الفلق\" و \"قل أعوذ برب الناس\" هاتان السورتان فهذه طرق عن عقبة كالمتواترة عنه تفيد القطع عند كثير من المحققين في الحديث. وقد تقدم في رواية صدي بن عجلان وفروة بن مجاهد عنه \"ألا أعلمك ثلاث سور لم ينزل في التوراة ولا في الإنجيل ولا في الزبور ولا في الفرقان مثلهن \"قل هو الله أحد - وقل أعوذ برب الفلق- وقل أعوذ برب الناس\" \"حديث آخر\" قال الإمام أحمد حدثنا إسماعيل حدثنا الجريري عن أبي العلاء قال: قال رجل كنا مع رسول الله صلى الله عليه وسلم في سفر والناس يعتقبون وفي الظهر قلة فحانت نزلة رسول الله صلى الله عليه وسلم ونزلتي فلحقني فضرب منكبي فقال \"قل أعوذ برب الفلق\" فقلت قل أعوذ برب الفلق فقرأها رسول الله صلى الله عليه وسلم فقرأتها معه ثم قال \"قل أعوذ برب الناس\" فقرأها رسول الله صلى الله عليه وسلم فقرأتها معه فقال \"إذا صليت فاقرأ بهما\" الظاهر أن هذا الرجل هو عقبة بن عامر والله أعلم ورواه النسائي عن يعقوب بن إبراهيم عن ابن علية به \"حديث آخر\" قال النسائي أخبرنا محمد بن المثنى حدثنا محمد بن جعفر عن عبدالله بن سعيد حدثني يزيد بن رومان عن عقبة بن عامر عن عبدالله الأسلمي هو ابن أنيس أن رسول الله صلى الله عليه وسلم وضع يده على صدره ثم قال \"قل\" فلم أدر ما أقول ثم قال لى \"قل\" قلت \"هو الله أحد\" ثم قال لي قل قلت \"أعوذ برب الفلق من شر ما خلق\" حتى فرغت منها ثم قال لي قل قلت \"أعوذ برب الناس\" حتى فرغت منها فقال رسول الله صلى الله عليه وسلم \"هكذا فتعوذ وما تعوذ المتعوذون بمثلهن قط\" \"حديث آخر\" قال النسائي أنا عمرو بن علي أبو جعفر حدثنا بدل حدثنا شداد بن سعيد أبو طلحة عن سعيد الجريري حدثنا أبو نضرة عن جابر بن عبدالله قال: قال لي رسول الله صلى الله عليه وسلم \"اقرأ يا جابر\" قلت وما أقرأ بأبي أنت وأمي؟ قال اقرأ \"قل أعوذ برب الفلق\"- و- \"قل أعوذ برب الناس\" \"فقرأتهما فقال \"اقرأ بهما ولن تقرأ بمثلهما\" وتقدم حديث عائشة أن رسول الله صلى الله عليه وسلم كان يقرأ بهن وينفث في كفيه ويمسح بهما رأسه ووجهه وما أقبل من جسده وقال الإمام مالك عن ابن شهاب عن عروة عن عائشة أن رسول الله صلى الله عليه وسلم كان إذا اشتكى يقرأ على نفسه بالمعوذتين وينفث فلما اشتد وجعه كنت اقرأ عليه بالمعوذات وأمسح بيده عليه رجاء بركتها ورواه البخاري عن عبدالله بن يوسف ومسلم عن يحيى بن يحيى وأبو داود عن القعنبي والنسائي عن قتيبة ومن حديث ابن القاسم وعيسى بن يونس وابن ماجه من حديث معن وبشر بن عمر ثمانيتهم عن مالك به. وتقدم في آخر سورة \"ن\" من حديث أبي نضرة عن أبي سعيد أن رسول الله صلى الله عليه وسلم كان يتعوذ من أعين الجان وأعين الانسان فلما نزلت المعوذتين أخذ بهما وترك ما سواهما. رواه الترمذي والنسائي وابن ماجه وقال الترمذي حديث حسن صحيح قال ابن أبي حاتم حدثنا أحمد بن عصام حدثنا أبو أحمد الزبيري حدثنا حسن بن صالح عن عبدالله بن محمد بن عقيل عن جابر قال: الفلق الصبح وقال العوفي عن ابن عباس \"الفلق\" الصبح وروي عن مجاهد وسعيد بن جبير وعبدالله بن محمد بن عقيل والحسن وقتادة ومحمد بن كعب القرظي وابن زيد ومالك عن زيد بن أسلم مثل هذا قال القرظي وابن زيد وابن جرير وهي كقوله تعالى \"فالق الإصباح\" وقال علي بن أبي طلحة عن ابن عباس \"الفلق\" الخلق وكذا قال الضحاك أمر الله نبيه أن يتعوذ من الخلق كله وقال كعب الأحبار \"الفلق\" بيت في جهنم إذا فتح صاح جميع أهل النار من شدة حره ورواه ابن أبي حاتم ثم قال حدثنا أبي حدثنا سهيل بن عثمان عن رجل سماه عن السدي عن زيد بن علي عن آبائه أنهم قالوا \"الفلق\" جب في قعر جهنم عليه غطاء فإذا كشف عنه خرجت منه نار تضج منه جهنم من شدة حر ما يخرج منه وكذا روي عن عمرو بن عنبسة وابن عباس والسدي وغيرهم. وقد ورد في ذلك حديث مرفوع منكر فقال ابن جرير حدثني إسحاق بن وهب الواسطي حدثنا مسعود بن موسى بن مشكان الواسطي حدثنا نصر بن خزيمة الخراساني عن شعيب بن صفوان عن محمد بن كعب القرظي عن أبي هريرة عن النبي صلى الله عليه وسلم قال \"الفلق جب فى جهنم مغطى\" إسناده غريب ولا يصح رفعه. وقال أبو عبدالرحمن الحبلي \"الفلق\" من أسماء جهنم. قال ابن جرير والصواب القول الأول أنه فلق الصبح وهذا هو الصحيح وهو اختيار البخاري في صحيحه رحمه الله تعالى."
    },
    {
      "ayah": 2,
      "surah": 113,
      "text": "وقوله تعالى \"من شر ما خلق\" أي من شر جميع المخلوقات وقال ثابت البناني والحسن البصري جهنم وإبليس وذريته مما خلق."
    },
    {
      "ayah": 3,
      "surah": 113,
      "text": "\"ومن شر غاسق إذا وقب\" قال مجاهد غاسق الليل إذا وقب غروب الشمس حكاه البخاري عنه وكذا رواه ابن أبي نجيح عنه وكذا قال ابن عباس ومحمد بن كعب القرظي والضحاك وخصيف والحسن وقتادة إنه الليل إذا أقبل بظلامه وقال الزهري \"ومن شر غاسق إذا وقب\" الشمس إذا غربت وعن عطية وقتادة إذا وقب الليل إذا ذهب وقال أبو المهزم عن أبي هريرة \"ومن شر غاسق إذا وقب\" الكوكب وقال أبن زيد: كانت العرب تقول الغاسق سقوط الثريا وكانت الأسقام والطواعين تكبر عند وقوعها وترتفع عند طلوعها قال ابن جرير ولهؤلاء من الآثار ما حدثني نصر بن علي حدثني بكار عن عبدالله بن أخى همام حدثنا محمد بن عبدالعزيز بن عمر بن عبدالرحمن بن عوف عن أبيه عن أبي سلمة عن أبي هريرة عن النبي صلى الله عليه وسلم \"ومن شر غاسق إذا وقب - النجم الغاسق\" \"قلت\" وهذا الحديث لا يصح رفعه إلى النبي صلى الله عليه وسلم. قال ابن جرير وقال آخرون هو القمر \"قلت\" وعمدة أصحاب هذا القول ما رواه الإمام أحمد حدثنا أبو داود الحفري عن ابن أبي ذئب عن الحارث بن أبي سلمة قال قالت عائشة رضي الله عنها أخذ رسول الله صلى الله عليه وسلم بيدي فأراني القمر حين طلع وقال \"تعوذي بالله من شر هذا الغاسق إذا وقب\" ورواه الترمذي والنسائي في كتابي التفسير من سننيهما من حديث محمد بن عبدالرحمن بن أبي ذئب عن خاله الحارث بن عبدالرحمن به وقال الترمذي حديث حسن صحيح ولفظه \"تعوذي بالله من شر هذا فإن هذا الغاسق إذا وقب\" ولفظ النسائي \"تعوذي بالله من شر هذا هذا الغاسق إذا وقب\" قال أصحاب القول الأول وهو آية الليل إذا ولج هذا لا ينافي قولنا لأن القمر آية الليل ولا يوجد له سلطان إلا فيه وكذلك النجوم لا تضيء إلا بالليل فهو يرجع إلى ما قلناه والله أعلم."
    },
    {
      "ayah": 4,
      "surah": 113,
      "text": "وقوله تعالى \"ومن شر النفاثات في العقد\" قال مجاهد وعكرمة والحسن وقتادة والضحاك: يعني السواحر قال مجاهد إذا رقين ونفثن في العقد. وقال ابن جرير حدثنا ابن عبدالأعلى حدثنا ابن ثور عن معمر عن ابن طاوس عن أبيه قال ما من شيء أقرب إلى الشرك من رقية الحية والمجانين. وفى الحديث الآخر أن جبريل جاء إلى النبي صلى الله عليه وسلم فقال اشتكيت يا محمد؟ فقال \"نعم\" فقال بسم الله أرقيك من كل داء يؤذيك ومن شر كل حاسد وعين الله يشفيك ولعل هذا كان من شكواه صلى الله عليه وسلم حين سحر ثم عافاه الله تعالى وشفاه ورد كيد السحرة الحساد من اليهود في رؤوسهم وجعل تدميرهم في تدبيرهم وفضحهم ولكن مع هذا لم يعاتبه رسول الله صلى الله عليه وسلم يوما من الدهر بل كفى الله وشفى وعافى. وقال الإمام أحمد حدثنا أبو معاوية حدثنا الأعمش عن يزيد بن حبان عن زيد بن أرقم قال سحر النبي صلى الله عليه وسلم رجل من اليهود فاشتكى لذلك أياما قال فجاءه جبريل فقال إن رجل من اليهود سحرك وعقد لك عقدا فى بئر كذا وكذا فأرسل إليها من يجيء بها فبعث رسول الله صلى الله عليه وسلم فاستخرجها فجاءه بها فحللها قال فقام رسول الله صلى الله عليه وسلم كأنما نشط من عقال فما ذكر ذلك لليهودي ولا رآه في وجهه حتى مات ورواه النسائي عن هناد عن أبي معاوية محمد بن حازم الضرير. وقال البخاري في كتاب الطب من صحيحه: حدثنا عبدالله بن محمد قال سمعت سفيان بن عيينة يقول أول من حدثنا به ابن جريج يقول حدثني آل عروة عن عروة فسألت هشاما عنه فحدثنا عن أبيه عن عائشة قالت كان رسول الله صلى الله عليه وسلم سحر حتى كان يرى أنه يأتي النساء ولا يأتيهن قال سفيان وهذا أشد ما يكون من السحر إذا كان كذا فقال \"يا عائشة أعلمت أن الله قد أفتاني فيما استفتيته فيه؟ أتاني رجلان فقعد أحدهما عند رأسي والآخر عند رجلي ققال الذي عند رأسي للآخر ما بال الرجل؟ قال مطبوب. قال ومن طبه؟ قال لبيد بن أعصم رجل من بني زريق حليف اليهود كان منافقا وقال وفيم؟ قال في مشط ومشاطة. وقال وأين؟ قال في جف طلعة ذكر تحت راعوفة في بئر ذروان\" قالت فأتى البئر حتى استخرجه فقال \"هذه البئر التي أريتها وكأن ماءها نقاعة الحناء وكان نخلها رءوس الشياطين \"قال فاستخرج فقلت أفلا تنشرت؟ فقال \"أما الله فقد شفاني وأكره أن أثير على أحد من الناس شرا\" وأسناده من حديث عيسى بن يونس وأبي ضمرة أنس بن عياض وأبي أسامة ويحيى القطان وفيه قالت حتى كان يخيل إليه أنه فعل الشيء ولم يفعله وعنده فأمر بالبئر فدفنت وذكر أنه رواه عن هشام أيضا ابن أبي الزناد والليث بن سعد وقد رواه مسلم من حديث أبي أسامة حماد بن أسامة وعبدالله بن نمير ورواه أحمد عن عفان عن وهب عن هشام به ورواه الإمام أحمد أيضا عن إبراهيم بن خالد عن معمر عن هشام عن أبيه عن عائشة قالت: لبث النبي صلى الله عليه وسلم ستة أشهر يرى أنه يأتي ولا يأتي فأتاه ملكان فجلس أحدهما عند رأسه والآخر عند رجليه فقال أحدهما للآخر ما باله؟ قال مطبوب قال ومن طبه؟ قال لبيد بن الأعصم وذكر تمام الحديث وقال الأستاذ المفسر الثعلبي في تفسيره قال ابن عباس وعائشة رضي الله عنهما كان غلام من اليهود يخدم رسول الله صلى الله عليه وسلم فدبت إليه اليهود فلم يزالوا به حتى أخذ مشاطة رأس النبي صلى الله عليه وسلم وعدة من أسنان مشطه فأعطاها اليهود فسحروه فيها وكان الذي تولى ذلك رجل منهم يقال له ابن أعصم ثم دسها في بئر لبني زريق ويقال له ذروان فمرض رسول الله صلى الله عليه وسلم وانتثر شعر رأسه ولبث ستة أشهر يرى أنه يأتي النساء ولا يأتيهن وجعل يذوب ولا يدرى ما عراه فبينما هو نائم إذ أتاه ملكان فجلس أحدهما عند رأسه والآخر عند رجليه فقال الذي عند رجليه للذي عند رأسه ما بال الرجل؟ قال طب. وقال وما طب قال سحر قال ومن سحره؟ قال لبيد بن الأعصم اليهودي قال وبم طبه؟ قال بمشط ومشاطة قال وأين هو؟ قال في جف طلعة ذكر تحت راعوفة في بئر ذروان والجف قشر الطلع والراعوفة حجر في أسفل البئر ناتئ يقوم عليه الماتح فانتبه رسول الله صلى الله عليه وسلم مذعورا وقال \"يا عائشة أما شعرت أن الله أخبرني بدائي\". ثم بعث رسول الله صلى الله عليه وسلم عليا والزبير وعمار بن ياسر فنزحوا ماء البئر كأنه نقاعة الحناء ثم رفعوا الصخرة وأخرجا الجف فإذا فيه مشاطة رأسه وأسنان من مشطه وإذا فيه وتر معقود فيه اثنا عشر عقدة مغروزة بالإبر فأنزل الله تعالى السورتين فجعل كلما قرأ آية انحلت عقدة ووجد رسول الله صلى الله عليه وسلم خفة حين انحلت العقدة الأخيرة فقام كأنما نشط من عقال وجعل جبريل عليه السلام يقول باسم الله أرقيك من كل شيء يؤذيك من حاسد وعين الله يشفيك. فقال يا رسول الله أفلا نأخذ الخبيث نقتله فقال رسول الله صلى الله عليه وسلم \"أما أنا فقد شفاني الله وأكره أن أثير على الناس شرا\" هكذا أورده بلا إسناد وفيه غرابة وفي بعضه نكارة شديدة ولبعضه شواهد مما تقدم والله أعلم."
    },
    {
      "ayah": 5,
      "surah": 113,
      "text": "وقوله تعالى \"ومن شر النفاثات في العقد\" قال مجاهد وعكرمة والحسن وقتادة والضحاك: يعني السواحر قال مجاهد إذا رقين ونفثن في العقد. وقال ابن جرير حدثنا ابن عبدالأعلى حدثنا ابن ثور عن معمر عن ابن طاوس عن أبيه قال ما من شيء أقرب إلى الشرك من رقية الحية والمجانين. وفى الحديث الآخر أن جبريل جاء إلى النبي صلى الله عليه وسلم فقال اشتكيت يا محمد؟ فقال \"نعم\" فقال بسم الله أرقيك من كل داء يؤذيك ومن شر كل حاسد وعين الله يشفيك ولعل هذا كان من شكواه صلى الله عليه وسلم حين سحر ثم عافاه الله تعالى وشفاه ورد كيد السحرة الحساد من اليهود في رؤوسهم وجعل تدميرهم في تدبيرهم وفضحهم ولكن مع هذا لم يعاتبه رسول الله صلى الله عليه وسلم يوما من الدهر بل كفى الله وشفى وعافى. وقال الإمام أحمد حدثنا أبو معاوية حدثنا الأعمش عن يزيد بن حبان عن زيد بن أرقم قال سحر النبي صلى الله عليه وسلم رجل من اليهود فاشتكى لذلك أياما قال فجاءه جبريل فقال إن رجل من اليهود سحرك وعقد لك عقدا فى بئر كذا وكذا فأرسل إليها من يجيء بها فبعث رسول الله صلى الله عليه وسلم فاستخرجها فجاءه بها فحللها قال فقام رسول الله صلى الله عليه وسلم كأنما نشط من عقال فما ذكر ذلك لليهودي ولا رآه في وجهه حتى مات ورواه النسائي عن هناد عن أبي معاوية محمد بن حازم الضرير. وقال البخاري في كتاب الطب من صحيحه: حدثنا عبدالله بن محمد قال سمعت سفيان بن عيينة يقول أول من حدثنا به ابن جريج يقول حدثني آل عروة عن عروة فسألت هشاما عنه فحدثنا عن أبيه عن عائشة قالت كان رسول الله صلى الله عليه وسلم سحر حتى كان يرى أنه يأتي النساء ولا يأتيهن قال سفيان وهذا أشد ما يكون من السحر إذا كان كذا فقال \"يا عائشة أعلمت أن الله قد أفتاني فيما استفتيته فيه؟ أتاني رجلان فقعد أحدهما عند رأسي والآخر عند رجلي ققال الذي عند رأسي للآخر ما بال الرجل؟ قال مطبوب. قال ومن طبه؟ قال لبيد بن أعصم رجل من بني زريق حليف اليهود كان منافقا وقال وفيم؟ قال في مشط ومشاطة. وقال وأين؟ قال في جف طلعة ذكر تحت راعوفة في بئر ذروان\" قالت فأتى البئر حتى استخرجه فقال \"هذه البئر التي أريتها وكأن ماءها نقاعة الحناء وكان نخلها رءوس الشياطين \"قال فاستخرج فقلت أفلا تنشرت؟ فقال \"أما الله فقد شفاني وأكره أن أثير على أحد من الناس شرا\" وأسناده من حديث عيسى بن يونس وأبي ضمرة أنس بن عياض وأبي أسامة ويحيى القطان وفيه قالت حتى كان يخيل إليه أنه فعل الشيء ولم يفعله وعنده فأمر بالبئر فدفنت وذكر أنه رواه عن هشام أيضا ابن أبي الزناد والليث بن سعد وقد رواه مسلم من حديث أبي أسامة حماد بن أسامة وعبدالله بن نمير ورواه أحمد عن عفان عن وهب عن هشام به ورواه الإمام أحمد أيضا عن إبراهيم بن خالد عن معمر عن هشام عن أبيه عن عائشة قالت: لبث النبي صلى الله عليه وسلم ستة أشهر يرى أنه يأتي ولا يأتي فأتاه ملكان فجلس أحدهما عند رأسه والآخر عند رجليه فقال أحدهما للآخر ما باله؟ قال مطبوب قال ومن طبه؟ قال لبيد بن الأعصم وذكر تمام الحديث وقال الأستاذ المفسر الثعلبي في تفسيره قال ابن عباس وعائشة رضي الله عنهما كان غلام من اليهود يخدم رسول الله صلى الله عليه وسلم فدبت إليه اليهود فلم يزالوا به حتى أخذ مشاطة رأس النبي صلى الله عليه وسلم وعدة من أسنان مشطه فأعطاها اليهود فسحروه فيها وكان الذي تولى ذلك رجل منهم يقال له ابن أعصم ثم دسها في بئر لبني زريق ويقال له ذروان فمرض رسول الله صلى الله عليه وسلم وانتثر شعر رأسه ولبث ستة أشهر يرى أنه يأتي النساء ولا يأتيهن وجعل يذوب ولا يدرى ما عراه فبينما هو نائم إذ أتاه ملكان فجلس أحدهما عند رأسه والآخر عند رجليه فقال الذي عند رجليه للذي عند رأسه ما بال الرجل؟ قال طب. وقال وما طب قال سحر قال ومن سحره؟ قال لبيد بن الأعصم اليهودي قال وبم طبه؟ قال بمشط ومشاطة قال وأين هو؟ قال في جف طلعة ذكر تحت راعوفة في بئر ذروان والجف قشر الطلع والراعوفة حجر في أسفل البئر ناتئ قوم عليه الماتح فانتبه رسول الله صلى الله عليه وسلم مذعورا وقال \"يا عائشة أما شعرت أن الله أخبرني بدائي\". ثم بعث رسول الله صلى الله عليه وسلم عليا والزبير وعمار بن ياسر فنزحوا ماء البئر كأنه نقاعة الحناء ثم رفعوا الصخرة وأخرجوا الجف فإذا فيه مشاطة رأسه وأسنان من مشطه وإذا فيه وتر معقود فيه اثنا عشر عقدة مغروزة بالإبر فأنزل الله تعالى السورتين فجعل كلما قرأ آية انحلت عقدة ووجد رسول الله صلى الله عليه وسلم خفة حين انحلت العقدة الأخيرة فقام كأنما نشط من عقال وجعل جبريل عليه السلام يقول باسم الله أرقيك من كل شيء يؤذيك من حاسد وعين الله يشفيك. فقال يا رسول الله أفلا نأخذ الخبيث نقتله فقال رسول الله صلى الله عليه وسلم \"أما أنا فقد شفاني الله وأكره أن أثير على الناس شرا\" هكذا أورده بلا إسناد وفيه غرابة وفي بعضه نكارة شديدة ولبعضه شواهد مما تقدم والله أعلم."
    }
  ]
}
