{
  "ayahs": [
    {
      "ayah": 1,
      "surah": 12,
      "text": "سورة يوسف روى الثعلبي وغيره من طريق سلام بن سليم ويقال سليم المدائني وهو متروك عن هارون بن كثير وقد نص على جهالته أبو حاتم عن زيد بن أسلم عن أبيه عن أبي أمامة عن أبي بن كعب قال: قال رسول الله صلي الله عليه وسلم \" علموا أرقاكم سورة يوسف فإنه أيما مسلم تلاها أو علمها أهله أو ما ملكت يمينه هون الله عليه سكرات الموت وأعطاه من القوة أن لا يحسد مسلما \"وهذا من هذا الوجه لا يصح لضعف إسناده بالكلية وقد ساقه الحافظ ابن عساكر متابعا من طريق القاسم بن الحكم عن هارون بن كثير به رمن طريق شبابة عن محمد بن عبد الواحد النضري عن علي بن زيد بن جدعان وعن عطاء بن أبي ميمونه عن زر بن حبيش عن أبي بن كعب عن النبي صلي الله عليه وسلم فذكر نحوه وهو منكر سائر طرقه وروى البيهقي في الدلائل أن طائفة من اليهود حين سمعوا رسول الله صلي الله عليه وسلم يتلو هذه السورة أسلموا لموافقتها ما عندهم وهو من رواية الكلبي عن أبي صالح عن ابن عباس. بسم الله الرحمن الرحيم أما الكلام على الحـروف المقطعة فقد تقدم في أول سورة البقرة وقوله \"تلك آيات الكتاب \" أي هذه آيات الكتاب وهو القرآن المبين أي الواضح الجلي الذي يفصح عن الأشياء المبهمة ويفسرها ويبينها."
    },
    {
      "ayah": 10,
      "surah": 12,
      "text": "\" قال قائل منهم \" قال قتادة ومحمد بن إسحاق: وكان أكبرهم واسمه روبيل. وقال السدي الذي قال ذلك يهوذا وقال مجاهد هو شمعون \" لا تقتلوا يوسف \" أي لا تصلوا في عداوته وبغضه إلى قتله ولم يكن لهم سبيل إلى قتله لأن الله تعالى كان يريد منه أمرأ لا بد من إمضائه وإتمامه من الإيحاء إليه بالنبوة ومن التمكين له ببلاد مصر والحكم بها فصرفهم الله عنه بمقالة روبيل فيه وإشارته عليهم بأن يلقوه في غيابة الجب وهو أسفله. قال قتادة: وهي بئر بيت المقدس \" يلتقطه بعض السيارة \" أي المارة من المسافرين فتستريحوا منه بهذا ولا حاجة إلى قتله \" إن كنتم فاعلين \" أي إن كنتم عازمين على ما تقولون. قال محمد بن إسحاق بن يسار: لقد اجتمعوا على أمر عظيم من قطيعة الرحم وعقوق الوالد وقلة الرأفة بالصغير الضرع الذي لا ذنب له وبالكبير الفاني ذي الحق والحرمة والفضل وخطره عند الله مع حق الوالد على ولده ليفرقوا بينه وبين أبيه وحبيبه على كبر سنه ورقة عظمه مع مكانه من الله فيمن أحبه طفلا صغيرا وبين ابنه على ضعف قوته وصغر سنه وحاجته إلى لطف والده وسكونه إليه يغفر الله لهم وهو أرحم الراحمين فقد احتملوا أمرا عظيما. رواه ابن أبي حاتم من طريق سلمة بن الفضل عنه."
    },
    {
      "ayah": 100,
      "surah": 12,
      "text": "وجاء بكم من البدو من بعد أن نزع الشيطان بيني وبين إخوتي إن ربي لطيف لما يشاء إنه هو العليم الحكيم وقوله \" ورفع أبويه على العرش \" قال ابن عباس ومجاهد وغير واحد يعنى السرير أي أجلسهما معه على سريره \" وخروا له سجدا \" أي سجد له أبواه وإخوته الباقون وكانوا أحد عشر رجلا \" وقال يا أبت هذا تأويل رؤياي من قبل \" أي التي كان قصها على أبيه من قبل \" إنى رأيت أحد عشر كوكبا \" الآية وقد كان هذا سائغا في شرائعهم إذا سلموا على الكبير يسجدون له ولم يزل هذا جائزا من لدن آدم إلى شريعة عيسى عليه السلام فحرم هذا في هذه الملة وجعل السجود مختص بجناب الرب سبحانه وتعالى هذا مضمون قول قتادة وغيره وفي الحديث أن معاوية قدم الشام فوجدهم يسجدون لأساقفتهم فلما رجع سجد لرسول الله صلي الله عليه وسلم فقال ما هذا يا معاذ؟ فقال إني رأيتهم يسجدون لأساقفتهم وأنت أحق أن يسجد لك يا رسول الله فقال لو كنت آمرا أحدا أن يسجد لأحد لأمرت المرأة أن تسجد لزوجها لعظم حقه عليها وفي حديث آخر: أن سلمان لقي النبي صلي الله عليه وسلم في بعض طرق المدينة وكان سلمان حديث عهد بالإسلام فسجد للنبي صلي الله عليه وسلم فقال لا تسجد لي يا سلمان واسجد للحي الذي لا يموت والغرض أن هذا كان جائزا في شريعتهم ولهذا خروا له سجدا فعندها قال يوسف \" يا أبت هذا تأويل رؤياي من قبل قد جعلها ربي حق \" أي هذا ما آل إليه الأمر فإن التأويل يطلق على ما يصير إليه الأمر كما قال تعالى \" هل ينظرون إلا تأويله يوم يأتي تأويله \" أي يوم القيامة يأتيهم ما وعدوا به من خير وشر وقوله \" قد جعلها ربي حقا \" أي صحيحة صدقا يذكر نعم الله عليه \" وقد أحسن بي إذ أخرجني من السجن وجاء بكم من البدو \" أي البادية قال ابن جريج وغيره كانوا أهل بادية وماشية وقال كانوا يسكنون بالعربات من أرض فلسطين من غور الشام قال وبعض يقول كانوا بالأولاج من ناحية شعب أسفل من حسمي وكانوا أصحاب بادية وشاء وإبل \" من بعد أن نزغ الشيطان بيني وبين إخوتي إن ربي لطيف لما يشاء \" أي إذا أراد أمرا قيض له أسبابا وقدره ويسره \" إنه هو العليم \" بمصالح عباده الحكيم \" في أقواله وأفعاله وقضائه وقدره وما يختاره ويريده قال أبو عثمان النهدي عن سليمان كان بين رؤيا يوسف وتأويلها أربعون سنة قال عبد الله بن شداد وإليها ينتهي أقص الرؤيا رواه ابن جرير وقال أيضا حدثنا عمر بن على حدثنا عبد الوهاب الثقفي حدثنا هشام عن الحسن قال كان منذ فارق يوسف يعقوب إلى أن التقيا ثمانون سنة لم يفارق الحزن قلبه ودموعه تجري على خديه وما على وجه الأرض عبد أحب إلى الله من يعقوب وقال هشيم عن يونس عن الحسن ثلاث وثمانون سنة وقال مبارك بن فضالة عن الحسن ألقي يوسف في الجب وهو ابن سبع عشرة سنة فغاب عن أبيه ثمانين سنة وما من بعد ذلك ثلاثا وعشرين سنة فمات وله عشرون ومائه وقال قتادة كان بينهما خمس وثلاثون سنة وقال محمد بن إسحاق: ذكر والله أعلم أن غيبة يوسف عن يعقوب كانت ثماني عشرة سنة قال وأهل الكتاب يزعمون أنها كانت أربعين سنة أو نحوها وأن يعقوب عليه السلام بقي مع يوسف بعد أن قدم عليه مصر سبع عشرة سنة ثم قبضه الله إليه وقال أبو إسحاق السبيعي عن أبي عبيدة عن عبدالله بن مسعود قال: دخل بنو إسرائيل مصر وهم ثلاثة وستون إنسانا وخرجوا منها وهم ستمائة ألف وسبعون ألفا وقال أبو إسحاق عن مسروق دخلوا وهم ثلثمائة وتسعون بين رجل وامرأة فالله أعلم وقال موسى بن عبيدة عن محمد بن كعب القرظي عن عبد الله بن سداد اجتمع آل يعقوب إلى يوسف بمصر وهم ست وثمانون إنسانا صغيرهم وكبيرهم وذكرهم وأنثاهم وخرجوا منها وهم ستمائة ألف ونيف."
    },
    {
      "ayah": 101,
      "surah": 12,
      "text": "هذا دعاء من يوسف الصديق دعا به ربه عز وجل لما تمت نعمة الله عليه باجتماعه بأبويه وأخويه وما من الله به عليه من النبوة والملك سأل ربه عز وجل كما أتم نعمته عليه في الدنيا أن يستمر بها عليه في الآخرة وأن يتوفاه مسلما حين يتوفاه قاله الضحاك وأن يلحقه بالصالحين وهم إخواته من النبيين والمرسلين صلوات الله وسلامه عليهم أجمعين وهذا الدعاء يحتمل أن يوسف عليه السلام قاله عند احتضاره كما ثبت في الصحيحين عن عائشة رضي الله عنها أن رسول الله صلي الله عليه وسلم جعل يرفع أصبعه عند الموت ويقول اللهم في الرفيق الأعلى ثلاثا ويحتمل أن سأل الوفاة على الإسلام واللحاق بالصالحين إذا جاء أجله وانقضى عمره لا أنه سأله ذلك منجزا كما يقول الداعي لغيره أماتك الله على الإسلام ويقول الداعي اللهم أحينا مسلمين وتوفنا مسلمين وألحقنا بالصالحين ويحتمل أنه سأل ذلك منجزا وكان ذلك سائغا في ملتهم كما قال قتادة قوله \" توفني مسلما وألحقني بالصالحين \" لما جمع الله شمله وأقر عينه وهو يومئذ مغمور في الدنيا وملكهـا ونضارتها اشتاق إلى الصالحين قبله وكان ابن عباس يقول ما تمن نبي قط الموت قبل يوسف عليه السلام وكذا ذكر ابن جرير والسدي عن ابن عباس أنه أول نبي دعا بذلك وهذا يحتمل أنه أول من سأل الوفاة على الإسلام كما أن نوحا أو من قال \" رب اغفر لي ولوالدي ولمن دخل بيتي مؤمنا \" ويحتمل أنه أول من سأل إنجاز ذلك وهو ظاهر سياق قول قتادة ولكن هذا لا يجوز في شريعتنا قال الإمام أحمد بن حنبل رحمه الله حدثنا إسماعيل بن إبراهيم حدثنا عبد العزيز بن صهيب عن أنس بن مالك قال: قال رسول الله صلي الله عليه وسلم لا يتمنين أحدكم الموت لضر نزل به فإن كان ولابد متمنيا الموت فليقل اللهم أحيني ما كانت الحياة خيرا لي وتوفني إذا كانت الوفاة خيرا لي وأخرجاه في الصحيحين وعندهما لا يتمنين أحدكم الموت بضر نزل به إن كان محسنا فيزداد وإن كان مسيئا فلعله يستعتب ولكن ليقل اللهم أحيني ما كانت الحياة خيرا لي وتوفني إذا كانت الوفاة خيرا لي وقال الإمام أحمد حدثنا أبو المغيرة حدثنا معاذ بن رفاعة حدثني علي بن يزيد عن القاسم عن أبي أمامة قال: جلسنا إلى رسول الله صلي الله عليه وسلم فذكرنا ورققنا فبكى سعد بن أبي وقاص فأكثر البكاء وقال يا ليتني مت فقال النبي صلي الله عليه وسلم يا سعد أعندي تتمني الموت ؟ فردد ذلك ثلاث مرات ثم قال يا سعد إن كنت خلقت للجنة فما طال من عمرك وحسن من عملك فهو خير لك وقال الإمام أحمد حدثنا حسن حدثنا ابن لهيعة حدثنا أبو يونس هو مسلم بن جبير عن أبي هريرة عن النبي صلي الله عليه وسلم أنه قال لا يتمنين أحدكم الموت لضر نزل به ولا يدع به من قبل أن يأتيه إلا أن يكون قد وثق بعمله فإنه إذا مات أحدكم انقطع عنه عمله لأنه لا يزيد المؤمن عمله إلا خيرا تفرد به أحمد وهذا فيما إذا كان الضر خاصا به وأما إذا كان فتنة في الدين فيجوز سؤال الموت كما قال الله تعالى إخبارا عن السحرة لما أرادهم فرعون عن دينهم وتهددهم بالقتل \" قالوا ربنا أفرغ علينا صبرا وتوفنا مسلمين \" وقالت مريم لما جاءها المخاض وهو الطلق إلى جذع النخلة \" يا ليتني مت قبل هذا وكنت نسيا منسيا \" لما علمت من أن الناس يقذفونهـا بالفاحشة لأنها لم تكن ذات زوج وقد حملت ووضعت وقد قالوا \" يا مريم لقد جئت شيئا فريا يا أخت هارون ما كان أبوك امرأ سوء وما كانت أمك بغيا \" فجعل الله لها من ذلك الحال فرجا ومخرجا وأنطق الصبي في المهد بأنه عبد الله ورسوله فكان آية عظيمة ومعجزة باهرة صلوات الله وسلامه عليه وفى حديث معاذ الذي رواه الإمام أحمد والترمذي في قصة المنام والدماء الذي فيه وإذا أردت بقوم فتنة فاقبضني إليك غير مفتون وقال الإمام أحمد حدثنا أبو سلمة أنا عبد العزيز بن محمد عن عمرو بن عاصم عن كثير بن قتادة عن محمود بن لبيد مرفوعا أن النبي صلي الله عليه وسلم قال اثنتان يكرههما ابن آدم: يكره الموت والموت خير للمؤمن من الفتن ويكره قلة المال وقلة المال أقل للحساب فعند حلول الفتن في الدين يجوز سؤال الموت ولهـذا قال علي بن أبي طالب رضي الله عنه في آخر خلافته لما رأى أن الأمور لا تجتمع له ولا يزداد الأمر إلا شدة فقال: اللهم خذني إليك فقد سئمتهم وسئموني وقال البخاري رحمه الله لما وقعت له تلك الفتنة وجرى له مع أمير خراسان ما جرى قال: اللهم توفني إليك وفي الحديث إن الرجل ليمر بالقبر أي في زمان الدجال فيقول يا ليتني مكانك لما يرى من الفتن والزلازل والبلابل والأمور الهائلة التي هي فتنة لكل مفتون قال أبو جعفر بن جرير: وذكر أن بني يعقوب الذين فعلوا بيوسف ما فعلوا استغفر لهم أبوهم فتاب الله عليهم وعفا عنهم وغفر لهم ذنوبهم \" ذكر من قال ذلك \" حدثنا القاسم حدثنا الحسين حدثني حجاج عن صالح المري عن يزيد الرقاع عن أنس بن مالك قال إن الله تعالى لما جمع ليعقوب شمله بعنيه خلا ولده نجيا فقال بعضهم لبعض ألستم قد علمتم ما صنعتم وما لقى منكم الشيخ وما لقى منكم يوسف؟ قالوا بلى قال فيغريكم عفوهما عنكم فكيف لكم بربكم؟ فاستقام أمرهم على أن أتوا الشيخ فجلسوا بين يديه ويوسف إلى جنب أبيه قاعد قالوا يا أبانا إنا أتيناك لأمر لم نأتك لأمر مثله قط ونزل بنا أمر لم ينزل بنا مثله قط حتى حركوه والأنبياء عليهم السلام أرحم البرية فقال ما لكم يا بنى ؟ قالوا ألست قد علمت ما كان منا إليك وما كان منا إلى أخينا يوسف؟ قال بلى قالوا أو لستما قد غفرتما لنا؟ قالا بلى قالوا فإن عفوكما لا يغني عنا شيئا إن كان الله لم يعف عنا قال فما تريدون يا بني؟ قالوا نريد أن تدعو الله لنا فإذا جاءك الوحي من الله بأنه قد عفا عنا قرت أعيننا واطمأنت قلوبنا وإلا فلا قرة عين في الدنيا لنا أبدا قال فقام الشيخ فاستقبل القبلة وقام يوسف خلف أبيه وقاموا خلفهما أذله خاشعين قال فدعا وأمن يوسف فلم اجب فيهم عشرين سنة قال صالح المري يخيفهم قال حتي إذا كان على رأس العشرين نزل جبريل عليه السلام على يعقوب عليه السلام فقال إن الله تعالى قد بعثني إليك أبشرك بأنه قد أجاب دعوتك في ولدك وأن الله تعالى قد عفا عما صنعوا وأنه قد اعتقد مواثيقهم من بعدك على النبوة هذا الأثر موقوف عن أنس ويزيد الرقاشي وصالح المري ضعيفان جدا وذكر السدي أن يعقوب عليه السلام لما حضره الموت أوصى إلى يوسف بأن يدفن عند إبراهيم وإسحاق فما مات صبره وأرسله إلى الشام دفن عندهما عليه السلام."
    },
    {
      "ayah": 102,
      "surah": 12,
      "text": "يقول تعالى لمحمد صلي الله عليه وسلم لما قص عليه نبأ إخوة يوسف وكيف رفعه الله عليهم وجعل له العاقبة والنصر والملك والحكم مع ما أرادوا به من السوء والهلاك والإعدام هذا وأماله يا محمد من أخبار الغيوب السابقة \" نوح يه إليك \" ونعلمك به يا محمد لما فيه من العبرة لك والاتعاظ لمن خالفك \" وما كنت لديهم \" حاضرا عندهم ولا مشاهدا لهم \" إذ أجمعوا أمرهم \" أي على إلقائه في الجب \" وهم يمكرون \" به ولكنا أعلمناك به وحيا إليك وإنزالا عليك كقوله \" وما كنت لديهم إذ يلقون أقلامهم \" آلآية وقال تعالى \" وما كت بجانب الغربي إذ قضينا إلى موسى الأمر \" الأية إلى قوله \" وما كنت بجانب الطور إذ نادينا \" الآية وقال \" وما كنت ثاويا في أهل مدين تتلو عليهم آياتنا \" الآية وقال \" ما كان لي من علم بالملأ الأعلى إذ يختصمون إن يوحى إلي أنما أنا نذير مبين \" يقول تعالى إنه رسوله وإنه قد أطلعه على أنباء ما قد سبق مما فيه عبرة للناس ونجاة لهم في دينهم ودنياهم ومع هذا ما آمن أكثر الناس ولهذا قال \" وما أكثر الناس ولو حرصت بمؤمنين \" وقال \" وإن تطع أكثر من في الأرض يضلوك عن سبيل الله \" كقوله \" إن في ذلك لآية وما كان أكثرهم مؤمنين \" إلى غير ذلك من الآيات."
    },
    {
      "ayah": 103,
      "surah": 12,
      "text": "يقول تعالى لمحمد صلي الله عليه وسلم لما قص عليه نبأ إخوة يوسف وكيف رفعه الله عليهم وجعل له العاقبة والنصر والملك والحكم مع ما أرادوا به من السوء والهلاك والإعدام هذا وأماله يا محمد من أخبار الغيوب السابقة \" نوح يه إليك \" ونعلمك به يا محمد لما فيه من العبرة لك والاتعاظ لمن خالفك \" وما كنت لديهم \" حاضرا عندهم ولا مشاهدا لهم \" إذ أجمعوا أمرهم \" أي على إلقائه في الجب \" وهم يمكرون \" به ولكنا أعلمناك به وحيا إليك وإنزالا عليك كقوله \" وما كنت لديهم إذ يلقون أقلامهم \" آلآية وقال تعالى \" وما كت بجانب الغربي إذ قضينا إلى موسى الأمر \" الأية إلى قوله \" وما كنت بجانب الطور إذ نادينا \" الآية وقال \" وما كنت ثاويا في أهل مدين تتلو عليهم آياتنا \" الآية وقال \" ما كان لي من علم بالملأ الأعلى إذ يختصمون إن يوحى إلي أنما أنا نذير مبين \" يقول تعالى إنه رسوله وإنه قد أطلعه على أنباء ما قد سبق مما فيه عبرة للناس ونجاة لهم في دينهم ودنياهم ومع هذا ما آمن أكثر الناس ولهذا قال \" وما أكثر الناس ولو حرصت بمؤمنين \" وقال \" وإن تطع أكثر من في الأرض يضلوك عن سبيل الله \" كقوله \" إن في ذلك لآية وما كان أكثرهم مؤمنين \" إلى غير ذلك من الآيات."
    },
    {
      "ayah": 104,
      "surah": 12,
      "text": "وقوله \" وما تسألهم عليه من أجر \" أي ما تسألهم يا محمد على هذا النصح والدعاء إلى الخير والرشد من أجر أى من جعالة ولا أجرة بل تفعله ابتغاء وجه الله ونصحا لخلقه \" إن هو إلا ذكر للعالمين \" أي يتذكرون به ويهتدون وينجون به في الدنيا والآخرة."
    },
    {
      "ayah": 105,
      "surah": 12,
      "text": "يخبر تعالى عن غفلة أكثر الناس عن التفكر في آيات الله ودلائل توحيده بما خلقه الله في السموات والأرض من كواكب زاهرات ثوابت وسيارات وأفلاك دائرات والجميع مسخرات; وكم في الأرض من قطع متجاورات وحدائق وجنات وجبال راسيات وبحار زاخرات وأمواج متلاطمات وقفار شاسعات وكم من أحياء وأموات وحيوان ونبات وثمرات متشابهة ومختلفات في الطعوم والروائح والألوان والصفات فسبحان الواحد الأحد خالق أنواع المخلوقات المتفرد بالدوام والبقاء والصمدية للأسماء والصفات وغير ذلك."
    },
    {
      "ayah": 106,
      "surah": 12,
      "text": "وقوله \" وما يؤمن أكثرهم بالله إلا وهم مشركون \" قال ابن عباس: من إيمانهم أنهم إذا قيل لهم: من خلق السموات ومن خلق الأرض ومن خلق الجبال؟ قالوا الله وهم مشركون به وكذا قال مجاهد وعطاء وعكرمة والشعبي وقتادة والضحاك وعبد الرحمن بن زيد بن أسلم وفي الصحيحين: أن المشركين كانوا يقولون في تلبيتهم: لبيك لا شريك لك إلا شريك هو لك تملكه وما ملك وفي صحيح مسلم أنهم كانوا إذا قالوا لبيك لا شريك لك قال رسول الله صلي الله عليه وسلم قد قد أي حسب حسب لا تريدوا على هذا; وقال الله تعالى \" إن الشرك لظلم عظيم \" وهذا هو الشرك الأعظم يعبد مع الله غيره كما في الصحيحين عن ابن مسعود قلت يا رسول الله: أي الذنب أعظم؟ قال أن تجعل لله ندا وهو خلقك وقال الحسن البصري في قوله \" وما يؤمن أكثرهم بالله إلا وهم مشركون \" قال ذلك المنافق يعمل إذا عمل رياء الناس وهو مشرك بعمله ذلك يعني قوله تعالى \" إن المنافقين يخادعون الله وهو خادعهم وإذا قاموا إلى الصلاة قاموا كسالى يراءون الناس ولا يذكرون الله إلا قليلا \" وثم شرك آخر خفي لا يشعر به غالبا فاعله كما روى حماد بن سلمة عن عاصم بن أبي النجود عن عروة قال: دخل حذيفة على مرمض فرأى في عضده سيرا فقطعه أو انتزعه ثم قال \" وما يؤمن أكثرهم بالله إلا وهم مشركون \" وفي الحديث من حلف بغير الله فقد أشرك رواه الترمذي وحسنه من رواية ابن عمر وفى الحديث الذي رواه أحمد وأبو داود وغيره عن ابن مسعود رضي الله عنه قال: قال رسول الله صلى الله عليه وآله وسلم إن الرقى والتمائم والتولة شرك وفي لفظ لهما الطيرة شرك وما منا إلا ولكن الله يذهبه بالتوكل ورواه الإمام أحمد بأبسط من هذا فقال حدثنا أبو معاوية حدثنا الأعمش عن عمرو بن مرة عن يحيى الجزار عن ابن أخي زينب عن زينب امرأة عبد الله بن مسعود قالت: كان عبد الله إذا جاء من حاجة فانتهى إلى الباب تنحنح وبزق كراهة أن يهجم منا على أمر يكرهه قالت لأنه جاء ذات يوم فتنحنح وعندي عجوز ترقيني من الحمرة فأدخلتها تحت السرير قالت فدخل فجلس إلى جانبي فرأى في عنقي خيطا فقال: ما هذا الخيط ؟ قالت: قلت خيط رقي لي فيه فأخذه فقطعه ثم قال إن آل عبد الله لأغنياء عن الشرك سمعت رسول الله صلي الله عليه وسلم يقول إن الرقى والتمائم والتولية شرك قالت: قلت له لم تقول هذا وقد كانت عيني تقذف فكنت أختلف إلى فلان اليهودي يرقيها فكان إذا رقاها سكنت؟ فقال إنما ذاك من الشيطان كأن ينخسها بيده فإذا رقاها كف عنها إنما كان يكفيك أن تقولي كما قال النبي صلي الله عليه وسلم أذهب الباس رب الناس اشف وأنت الشاف لا شفاء إلا شفاؤك شفاء لا يغادر سقما وفي حديث آخر رواه الإمام أحمد عن وكيع عن ابن أبي ليلى عن عيسى بن عبد الرحمن قال دخلت على عبد الله بن حكيم وهو مريض نعوده فقيل له لو تعلقت شيئا فقال أتعلق شيئا وقد قال رسول الله صلي الله عليه وسلم من تعلق شيئا وكل إليه ورواه النسائي عن أبي هريرة وفي مسند الإمام أحمد من حديث عقبة بن عامر قال: قال رسول الله صلي الله عليه وسلم من علق تميمة فقد أشرك وفي رواية من تعلق تميمة فلا أتم الله له ومن تعلق ودعة فلا ودعة الله له وعن العلاء عن أبيه عن أبي هريرة رضي الله عنه قال: قال رسول الله صلي الله عليه وسلم يقول الله أنا أغنى الشركاء عن الشرك من عمل عملا أشرك فيه معى غيري تركته وشركه رواه مسلم وعن أبي سعيد بن أبي فضاله قال: سمعت رسول الله صلي الله عليه وسلم يقول إذا جمع الله الأولين والآخرين ليوم لا ريب فيه ينادي مناد: من كان أشرك في عمل عمله لله فليطلب ثوابه من عند غير الله فإن الله أغنى الشركاء عن الشرك رواه الإمام أحمد وقال أحمد حدثنا يونس حدثنا ليث عن يزيد يعني ابن الهادي عن عمرو عن محمود بن لبيد أن رسول الله صلي الله عليه وسلم قال إن أخوف ما أخاف عليكم الشرك الأصغر قالوا وما الشرك الأصغر يا رسول الله؟ قال الرياء يقول الله تعالى يوم القيامة إذا جازى الناس بأعمالهم اذهبوا إلى الذين كنتم تراءون في الدنيا فانظروا هل تجدون عندهم جزاء؟ وقد رواه إسماعيل بن جعفر عن عمرو بن أبي عمرو مولى المطلب عن عاصم بن عمرو عن قتاده عن محمود بن لبيد به وقال الإمام أحمد حدثنا حسن أنبأنا ابن لهيعة أنبأنا ابن هبيرة عن أبي عبد الرحمن الحبلي عن عبد الله بن عمرو قال: قال رسول الله صلي الله عليه وسلم من ردته الطيرة عن حاجته فقد أشرك قالوا يا رسول الله ما كفارة ذلك؟ قال أن يقول أحدهم اللهم لا خير إلا خيرك ولا طير إلا طيرك ولا إله غيرك وقال الإمام أحمد حدثنا عبد الله بن نمير حدثنا عبد الملك بن أبي سليمان العرزمي عن أبي علي رجل من بني كاهل قال: خطبنا أبو موسى الأشعري فقال: يا أيها الناس اتقوا هذا الشرك فإنه أخفى من دبيب النمل فقام عبد الله بن حرب وقيس بن المضارب فقالا والله لتخرجن مما قلت أو لنأتين عمر مأذونا لنا أو غير مأذون قال بل أخرج مما قلت خطبنا رسول الله صلي الله عليه وسلم ذات يوم فقال يا أيها الناس اتقوا هذا الشرك فإنه أخفى من دبيب النمل فقال له من شاء الله أو يقول فكيف نتقيه وهو أخفى من دبيب النمل يا رسول الله؟ قال قالوا اللهم إنا نعوذ بك من أن نشرك بك شيئا نعلمه ونستغفرك لما لا نعلمه وقد روى من وجه آخر وفيه أن السائل في ذلك هو الصديق كما رواه الحافظ أبو يعلى الموصلي من حديث عبد العزيز بن مسلم عن ليث بن أبي سليم عن أبي محمد عن معقل بن يسار قال شهدت النبي صلي الله عليه وسلم أو قال حـدثني أبو بكر الصديق عن رسول الله صلي الله عليه وسلم أنه قال الشرك أخفى فيكم من دبيب النمل فقال أبو بكر وهل الشرك إلا من دعا مع الله إله آخر؟ فقال رسول الله صلي الله عليه وسلم الشرك فيكم أخفى من دبيب النمل ثم قال ألا أدلكم على ما يذهب عنك صغير ذلك وكبيره؟ قل اللهم إني أعوذ بك أن اشرك بك وأنا اعلم وأستغفرك مما لا أعلم وقد رواه الحافظ أبو القاسم البغوي عن شيبان بن فروي عن يحيى بن أبي كثير عن الثوري عن إسماعيل بن أبي خالد عن قيس بن أبي أبي بكر الصديق قال: قال رسول الله صلي الله عليه وسلم الشرك أخفى في أمتى من دبيب النمل على الصفا قال: فقال أبو بكر يا رسول الله فكيف النجاة والمخرج من ذلك؟ فقال ألا أخبرك بشيء إذا قلته برئت من قليله وكثيره وصغيره وكبيره؟ قال بلى يا رسول الله قال: قل اللهم إني أعوذ بك أن أشرك بك وأن أعلم وأستغفرك لما لا أعلم قال الدارقطني يحيي بن أبي كثير هذا يقال له أبو النضر متروك الحديث وقد روى الإمام أحمد والترمذي وصححه والنسائي من حديث يعلى بن عطاء سمعت عمرو بن عاصم سمعت أبا هريرة قال أبو بكر الصديق يا رسول الله علمني شيئا أقوله إذا أصبحت وإذا أمسيت وإذا أخذت مضجعي قل: اللهم فاطر السموات والأرض عالم الغيب والشهادة رب كل شيء ومليكه أشهد أن لا إله ألا أنت أعوذ بك من شر نفسي ومن شر الشيطان وشركه رواه أبو داود والنسائي وصححه وزاد الإمام أحمد لى رواية له من حديث ليث من أبي سليم عن مجاهد عن أبي بكر الصديق قال: أمرني رسول الله صلي الله عليه وسلم أن أقول - فذكر هذا الدعاء وزاد في آخره وأن أقترف على نفسي سوءا أو أجره إلى مسلم."
    },
    {
      "ayah": 107,
      "surah": 12,
      "text": "وقوله \" أفأمنوا أن تأتيهم غاشية من عذاب الله \" الآية: أي أفأمن هؤلاء المشركون بالله أن يأتيهم أمر يغشاهم من حيث لا يشعرون كقوله تعالى \" أفأمن الذين مكروا أن يخسف الله بهم الأرض أو يأتيهم العذاب من حيث لا يشعرون أو يأخذهم في تقلبهم فما هم بمعجزين أو يأخذهم على تخوف فإن ربكم لرءوف رحيم \" وقوله أفأمن أهل القرى أن يأتيهم بأسنا بياتا وهم نائمون أو أمن أهل القرى أن يأتيهم بأسنا ضحى وهم يلعبون\" أفأمنوا مكر الله فلا يأمن مكر الله إلا القوم الخاسرون \"."
    },
    {
      "ayah": 108,
      "surah": 12,
      "text": "يقول تعالى لرسوله صلي الله عليه وسلم إلى الثقلين الجن والإنس آمرا له أن يخبر الناس أن هذه سبيله أي طريقته ومسلكه وسنته وهي الدعوة إلى شهادة أن لا إله إلا الله وحده لا شريك له يدعو إلى الله بها على بصيرة من ذلك ويقين وبرهان وكل من اتبعه يدعو إلى ما دعا إليه رسول الله صلي الله عليه وسلم على بصيرة ويقين وبرهان عقلي وشرعي; وقوله \" وسبحان الله \" أي وأنزه الله وأحله وأعظمه وأقدسه عن أن يكون له شريك أو نظير أو عديل أو نديد أو ولد أو والد أو صاحبة أو وزير أو مشير تبارك وتقدس وتنزه وتعالى عن ذلك كله علوا كبيرا \" تسبح له السموات السبع والأرض ومن فيهن وإن من شي إلا يسبح بحمده ولكن لا تفقهون تسبيحهم إنه كان حليما غفورا \"."
    },
    {
      "ayah": 109,
      "surah": 12,
      "text": "عاقبة الذين من قبلهم ولدار الآخرة خير للذين اتقوا أفلا تعقلون يخبر تعالى أنه إنما أرسل رسله من الرجال لا من النساء وهذا قول جمهور العلماء كما دل عليه سياق هذه الآية الكريمة إن الله تعالى لم يوح إلى امرأة من بنات بني أدم وحى تشريع وزعم بعضهم أن سارة امرأة الخليل وأم موسى ومريم بنت عمران أم عيسى نبيات واحتجوا بأن الملائكة بشرت سارة بإسحاق ومن وراء إسحاق يعقوب وبقوله \" وأوحينا إلى أم موسى أن أرضعيه \" الآية وبأن الملك جاء إلى مريم وبشرها بعيسى عليه السلام وبقوله تعالى \" إذ قالت الملائكة يا مريم إن الله اصطفاك وطهرك واصطفاك على نساء العالمين يا مريم اقنتي لربك واسجدي وأركعي مع الراكعين \" وهذا القدر حاصل لهن ولكن لا يلزم من هذا أن يكن نبيات بذلك فإن أراد القائل بنبوتهن هذا القدر من التشريف فهذا لا شك فيه ويبقى الكلام معه في أن هذا هل يكفي في الانتظام في سلك النبوة بمجرده أم لا؟ الذي عليهم أهل السنة والجماعة وهو الذي نقله الشيخ أبو الحسن علي بن إسماعيل الأشعري عنهم أنه ليس فى النساء نبية وإنما فيهن صديقات كما قال تعالى مخبرا عن أشرفهن مريم بنت عمران حيث قال تعالى \" ما المسيح ابن مريم إلا رسول قد خلت من قبله الرسل وأمه صديقه كانا يأكلان الطعام \" فوصفها في أشرف مقاماتها بالصديقة فلو كانت نبية لذكر ذلك فى مقام التشريف والإعظام فهي صديقة بنعي القرآن وقال الضحاك عن ابن عباس في قوله \" وما أرسلنا من قبلك إلا رجال \" الآية أي ليسوا من أهل السماء كما قلتم وهذا القول من ابن عباس يعتضد بقوله تعالى \" وما أرسلنا قبلك من المرسلين إلا إنهم ليأكلون الطعام ويمشون في الأسواق \" الأية وقوله تعالى \" وما جعلناهم جسدا لا يأكلون الطعام وما كانوا خالدين ثم صدقناهم الوعد فأنجيناهم ومن نساء وأهلكنا المسرفين \" وقوله تعالى \" قل ما كنت بدعا من الرسل \" الآية وقوله من أهل القرى \" المراد بالقرى المدن لا أنهم من أهل البوادي الذين هم من أجفى الناس طباعا وأخلاقا وهذا هو المعهود المعروف أن أهل المدن أرق طباعا وألطف من أهل بواديهم وأهل الريف والسواد أقرب حالا من الذين يسكنون في البوادي ولهذا قال تعالى \" الأعراب أشد كفرا ونفاقا \" الآية وقال قتادة في قوله \" من أهل القرى \" لأنهم أعلم وأحلم من أهل العمور وفي الحديث الآخر أن رجل من الأعراب أهدى لرسول الله صلي الله عليه وسلم صدقة فلم يزل يعطيه ويزيده حتى رضي فقال رسول الله صلي الله عليه وسلم لقد هممت أن لا أتهب هبة إلا من قرشي أو أنصاري أو ثقفي أو دوسي وقال الإمام أحمد حدثنا حجاج حدثنا شعبة عن الأعمش عن يحيى بن وثاب عن شيخ من أصحاب رسول الله صلي الله عليه وسلم قال الأعمش هو عمر عن النبي صلي الله عليه وسلم أنه قال المؤمن الذي يخالط الناس ويصبر على أذاهم خير من الذي لا يخالطهم ولا يصبر على أذاهم وقوله \" أفلم يسيروا في الأرض \" يعني هؤلاء المكذبين لك يا محمد في الأرض فينظروا كيف كان عاقبة الذين من قبلهم \" أي أى من الأمم المكذبة للرسل كيف دمر الله عليهم وللكافرين أمثالها أفلم يسيروا في الأرض فتكون لهم قلوب يعقلون بها \" الآية فإذا استمعوا خبر ذلك رأوا أن الله قد أهلك الكافرين ونجى المؤمنين وهذه كانت سنته تعالى في خلقه ولهذا قال تعالى \" ولدار الآخرة خير للذين اتقوا \" أي وكما نجينا المؤمنين في الدنيا كذلك كتبنا لهم النجاة في الدار الآخرة وهي خير لهمم من الدنيا بكثير كقوله \" إنا لننصر رسلنا والذين آمنوا في الحياة الدنيا ويوم يقوم الأشهاد يوم لا ينفع الظالمين معذرتهم ولهم اللعنة ولهم سوء الدار \" وأضاف الدار إلى الآخرة فقال \" ولدار الآخرة \" كما يقال صلاة الأولى ومسجد الجامع وعام أول و بارحة الأولى ويوم الخميس; قال الشاعر أتمدح فقعسا وتذم عبسا ألا الله أمك من هجين ولو أقوت عليك ديار عبس عرفت الذل عرفان اليقين"
    },
    {
      "ayah": 11,
      "surah": 12,
      "text": "لما تواطئوا على أخذه وطرحه في البئر كما أشار به عليهم أخوهم الكبير روبيل جاءوا أباهم يعقوب عليه السلام فقالوا ما بالك \" لا تأمنا على يوسف وإنا له لناصحون \" وهذه توطئة ودعوى وهم يريدون خلاف ذلك لما له في قلوبهم من الحسد لحب أبيه له."
    },
    {
      "ayah": 110,
      "surah": 12,
      "text": "يذكر تعالى أن نصره ينزل على رسله صلوات الله وسلامه عليهم أجمعين عند ضيق الحال وانتظار الفرج من الله في أحوج الأوقات إلى ذلك كقوله تعالى \" زلزلوا حتى يقول الرسول والذين آمنوا معه متى نصر الله \" الآية وفي قوله \" كذبوا \" قراءتان إحداهما بالتشديد قد كذبوا وكذلك كانت عائشة رضي الله عنها تقرئها قال البخاري حدثنا عبد العزيز بن عبد الله حدثنا إبراهيم بن سعد بن صالح عن ابن شهاب قال أخبرني عروة بن الزبير عن عائشة أنها قالت له وهو يسألها عن قول الله تعالى \" حتى إذا استيأس الرسل \" قال: قلت أكذبوا أم كذبوا ؟ قالت عائشة كذبوا قلت فقد استيقنوا أن قومهم كذبوهم فما هو بالظن؟ قالت أجل لعمري لقد استيقنوا بذلك فقلت لها \" وظنوا أنهم قد كذبوا \" قالت معاذ الله لم تكن الرسل تظن ذلك بربها قلت فما هذه الآية ؟ قالت هم أتباع الرسل الذين آمنوا بربهم وصدقوهم فطال عليهم البلاء واستأخر عنهم النصر \" حتى إذا استيأس الرسل \" ممن كذبهم من قومهم وظنت الرسل أن أتباعهم قد كذبوهم جاءهم نصر الله عند ذلك حدثنا أبو اليمان أنبأنا شعبة عن الزهري قال أخبرنا عروة فقلت لها لعلها قد كذبوا مخففة؟ قالت معاذ الله انتهى ما ذكره وقال ابن جريج أخبرني ابن أبى مليكه أن ابن عباس قرأها \" وظنوا أنهم قد كذبوا \" خفيفة قال عبد الله هو ابن أبي مليكة ثم قال لي ابن عباس كانوا بشرا ثم تلا \" حتى يقول الرسول والذين آمنوا معه متى نصر الله ألا إن نصر الله قريب \" قال ابن جريج وقال ابن أبي مليكة وأخبرني عروة عن عائشة أنها خالفت ذلك وأبته وقالت ما وعد الله محمدا صلي الله عليه وسلم من شيء إلا قد علم أنه سيكون حتى مات ولكنه لم يزل البلاء بالرسل حتى ظنوا أن من معهم من المؤمنين قد كذبوهم قال ابن أبي مليكة في حديث عروة كانت عائشة تقرئها \" وظنوا أنهم قد كذبوا \" مثقلة من التكذيب وقال ابن أبي حاتم أن يونس بن عبد الأعلى قراءة أنا ابن وهب أخبرني سليمان بن بلال عن يحيى بن سعيد قال: جاء إنسان إلى القاسم بن محمد فقال إن محمد بن كعب القرظي قرأ هذه الآية \" حتى إذا استيأس الرسل وظنوا أنهم قد كذبوا \" فقال القاسم أخبره عني أنى سمعت عائسة زوح النبي صلي الله عليه وسلم تقوله \" حتى إذا استيأس الرسل وظنوا أنهم قد كذبوا \" تقول كذبتهم أتباعهم إسناد صحيح أيضا والقراءة الثانية بالخفيف; واختلفوا في تفسيرها فقال ابن عباس ما تقدم وعن ابن مسعود فيما رواه سفيان الثوري عن الأعمش عن أبي الضحى عن مسروق عن عبد الله أنه قرأ \" حتى إذا استيأس الرسل وظنوا أنهم قد كذبوا \" مخففة قال عبد الله هو الذي تكره وهذا عن ابن عباس وابن مسعود رضي الله عنهما مخالف لما رواه آخرون عنهما أما ابن عباس فروى الأعمش عن مسلم عن ابن عباس في قوله \" حتى إذا استيأس الرسل وظنوا أنهم قد كذبوا \" قال لما أيست الرسل أن يستجيب لهم قومهم وظن قومهم أن الرسل قد كذبوهم جاءهم النصر على ذلك \" فنجي من نشاء \" وكذا روى عن سعيد بن جبير وعمران بن الحارث السلمي وعبد الرحمن بن معاوية وعلي بن أبي طلحة والعوفي عن ابن عباس بمثله وقال ابن جرير حدثني المثنى حدثنا عارم أبو النعمان حدثنا حماد بن زيد حدثنا شعيب حدثنا إبراهيم بن أبي حمزة الجزري قال: سأل فتى من قريش سعيد بن جبير قال أخبرنا أبا عبد الله كف هذا الحرف فإني إذا أتيت عليه تمنيت أن لا أقرأ هذه السورة \" حتى إذا استيأس الرسل وظنوا أنهم قد كذبوا \" قال نعم حتى إذا استيأس الرسل من قومهم أن يصدقوهم وظن المرسل إليهم أن الرسل قد كذبوا فقال الضحاك بن مزاحم ما رأيت كاليوم قط رجل يدعى إلى علم فيتلكأ لو رحلت إلى اليمن في هذه كان قليلا ثم روى ابن جرير أيضا من وجه آخر أن مسلم بن يسار سأل سعيد بن جبير عن ذلك فأجابه بهذا الجواب فقام إلى سعيد فاعتنقه وقال فرج الله عنك كما فرجت عني وهكذا روى من غير وجه عن سعيد بن جبير أنه فسرها كذلك وكذا فسرها مجاهد بن جرير وغير واحد من السلف حتى أن مجاهدا قرأها \" وظنوا أنهم قد كذبوا \" بفتح الذال رواه ابن جرير إلا أن بعض من فسرها كذلك يعيد الضمير فى قوله \" وظنوا أنهم قد كذبوا \" إلى أتباع الرسل من المؤمنين ومنهم من يعيده إلى الكافرين منهم أي وظن الكفار أن الرسل قد كذبوا مخففة فيما وعدوا به من النصر وأما ابن مسعود فقال ابن جرير حدثنا القاسم حدثنا الحسين حدثنا محمد بن فضيل عن محمش بن زياد الضبي عن تميم بن حزم قال سمعت عبد الله بن مسعود يقول فى هذه الآية \" حتى إذا استيأس الرسل \" من إيمان قومهم أن يؤمنوا بهم وظن قومهم حين أبطأ الأمر أنهم قد كذبوا بالتخفيف فهاتان الروايتان عن كل من ابن مسعود وابن عباس وقد أنكرت ذلك عائشة على من فسرها بذلك وانتصر لها ابن جرير ووجه المشهور عن الجمهور وزيف القول الآخر بالكلية ورده وأباه ولم يقبله ولا ارتضاه والله أعلم."
    },
    {
      "ayah": 111,
      "surah": 12,
      "text": "يقول تعالى لقد كان في خبر المرسلين مع قومهم وكيف نجينا المؤمنين وأهلكنا الكافرين \" عبرة لأولي الألباب \" وهي العقول \" ما كان حديثا يفترى \" أي وما كان لهذا القرآن أن يفترى من دون الله أي يكذب ويخلق \" ولكن تصديق الذي بين يديه \" أى من الكتب المنزلة من السماء هو يصدق ما فيهـا من الصحيح وينفي ما وقع فيها من تحريف وتبديل وتغير ويحكم عليها بالنسخ أو التقرير \" وتفصيل كل شيء \" من تحليل وتحريم ومحبوب ومكروه وغير ذلك من الأمر بالطاعات والواجبات والمتسحبات والنهي عن المحرمات وما شاكلها من المكروهات والأخبار عن الأمور الجلية وعن الغيوب المستقيلة المجملة والتفصيلية والإخبار عن الرب تبارك وتعالى بالأسماء والصفات وتنزهه عن مماثلة المخلوقات فلهذا كانت \" هدى ورحمة لقوم يؤمنون \" تهتدي به فلزمهم من الغي إلى الرشاد ومن الضلال إلى السداد ويبتغون بها الرحمة من رب العباد في هذه الحياة الدنيا ويوم المعاد فنسأل الله العظيم أن يجعلنا منهم في الدنيا والآخرة يوم يفوز بالربح المبيضة وجوههم الناضرة ويرجع المسودة وجوههم بالصفقة الخاسرة آخر تفسير سورة يوسف عليه السلام ولله الحمد والمنة وبه المستعان."
    },
    {
      "ayah": 12,
      "surah": 12,
      "text": "أي ابعثه معنا \" غدا نرتع ونلعب \" وقرأ بعضهم بالياء \"يرتع ويلعب\" قال ابن عباس: يسعى وينشط. وكذا قال قتادة والضحاك والسدي وغيرهم \"وإنا له لحافظون \" يقولون ونحن نحفظه ونحوطه من أجلك."
    },
    {
      "ayah": 13,
      "surah": 12,
      "text": "يقول تعالى مخبرا عن نبيه يعقوب أنه قال لبنيه في جواب ما سألوا من إرسال يوسف معهم إلى الرعي في الصحراء \" إنى ليحزنني أن تذهبوا به \" أي يشق علّي مفارقته مدة ذهابكم به إلى أن يرجع وذلك لفرط محبته له لما يتسوم فيه من الخير العظيم وشمائل النبوة والكمال في الخلق والخلق صلوات الله وسلامه عليه. وقوله \" وإخاف أن يأكله الذئب وأنتم عنه غافلون \" يقول وأخشى أن تشتغلوا عنه برميكم ورعيكـم فيأتيه ذئب فيأكله وأنتم لا تشعرون فأخذوا من فمه هذه الكلمة وجعلوها عذرهم فيما فعلوه وقالوا مجيبين له عنها في الساعة الراهنة."
    },
    {
      "ayah": 14,
      "surah": 12,
      "text": "\" لئن أكله الذئب ونحن عصبة إنا إذا لخاسرون \" يقولون لئن عدا عليه الذئب فأكله بيننا. ونحن جماعة وأنا إذا لهالكون عاجزون."
    },
    {
      "ayah": 15,
      "surah": 12,
      "text": "يقول تعالى فلما ذهب به إخوته من عند أبيه بعد مراجعتهم له في ذلك \" وأجمعوا أن يجعلوه في غيابة الجب \" هذا فيه تعظيم لما فعلوه أنهم اتفقوا كلهم على إلقائه في أسفل ذلك الجب وقد أخذوه من عند أبيه فيه يظهرونه له إكراما له وبسطا وشرحا لصدره وإدخالا للسرور عليه فيقال إن يعقوب عليه السلام لما بعثه معهم ضمه إليه وقبله ودعا له. وذكر السدي وغيره أنه لم لكن بين إكرامهم له وبين إظهار الأدي له إلا إن غابوا عن عين أبيه وتواروا عنه ثم شرعوا يؤذونه بالقول من شتم ونحوه والفعل من ضرب ونحوه ثم جاءوا به إلى ذلك الجب الذي اتفقوا على رميه فيه فربطوه بحبل ودلوه فيه فكان إذا لجأ إلى واحد منهم لطمه وشتمه واذا تشبث بحافات البئر ضربوا على يديه ثم قطعوا به الحبل من نصف المسافة فسقط في الماء فغمره فصعد إلى صخرة تكون في وسطه يقال لها الراغوفة فقام فوقها وقوله \" وأوحينا إليه لتنبئنهم بأمرهم هذا وهم لا يشعرون \" يقول تعالى ذاكرا لطفه ورحمته وعائدته لم انزاله اليسر في حال العسر أنه أوحى إلى يوسف في ذلك الحال الضيق تطيبا لقلبه وتثبيتا له إنك لا تحزن مما أنت فيه فإن لك من ذلك فرجا ومخرجا حسنا وسينصرك الله عليهم ويعليك ويرفع درجتك وستخبرهم بما فعلوا معك من هذا الصنيع. وقوله \" وهم لا يشعرون \" قال مجاهد وقتادة \"وهم لا يشعرون \" بإيحاء الله إليه ; وقال ابن عباس ستنبئهم بصنيعهم هذا في حقك وهم لا يعرفونك ولا يستشعرون بك كما قال ابن جرير: حدثني الحارث ثنا عبد العزيز ثنا صدقة بن عبادة الأسدي عن أبيه سمعت ابن عباس يقول: لما دخل إخوة يوسف عليه فعرفهم وهم له منكرون قال جيء بالصواع فوضعه على يده ثم نقره فطن فقال: إنه ليخبرني هذا الجام أنه كان لكم أخ من أبيكم يقال له يوسف يدنيه دونكم وأنكم انطلقتم به وألقيتموه في غيابة الجب قال ثم نقره فطن قال فأتيتم أباكم فقلتم إن الذئب أكله وجئتم على قميصه بدم كذب قال فقال بعضهم لبعض إن هذا الجام لبخبره بخبركم فال ابن عباس فلا نرى هذه الأية نزلت إلا فيهم \" لتنبئنهم بأمرهم هذا وهم لا يشعرون \"."
    },
    {
      "ayah": 16,
      "surah": 12,
      "text": "يقول تعالى مخبرا عن الذي اعتمده إخوة يوسف بعد ما ألقوه في غيابة الجب ثم رجعوا إلى أبيهم في ظلمة الليل يبكون ومظهرون الأسف والجزع على يوسف ويتغممون لأبيهم وقالوا معتذرين عما وقع فيما زعموا."
    },
    {
      "ayah": 17,
      "surah": 12,
      "text": "\" إنا ذهبنا نستبق \" أي نترامى \" وتركنا يوسف عند متاعنا \" أي ثيابنا وأمتعنا \" فأكله الذئب \" وهو الذي كان قد جزع منه وحذر عليه وقوله \" وما أنت بمؤمن لنا ولو كنا صادقين \" تلطف عظيم في تقرير ما يحاولونه يقولون ونحن نعلم أنك لا تصدقنا والحالة هذه لو كنا عندك صادقين فكيف وأنت تتهمنا في ذلك لأنك خشيت أن يأكله الذئب فأكله الذئب فأنت معذور في تكذيبك لنا لغرابة ما وقع وعجيب ما اتفق لنا في أمرنا هذا."
    },
    {
      "ayah": 18,
      "surah": 12,
      "text": "أي مكذوب مفتري وهذا من الأفعال التي يؤكدون بها ما تمالئوا عليه من المكيدة وهو أنهم عمدوا إلى سخلة فيما ذكره مجاهد والسدي وغير واحد فذبحوها ولطخوا ثوب يوسف بدمها موهمين أن هذا قميصه الذي أكله فيه الذئب وقد أصابه من دمه ولكنه نسوا أن يخرقوة فلهذا لم يرجع هذا الصنيع على نبي الله يعقوب. بل قال لهم معرضا عن كلامهم إلى ما وقع في نفسه من لبسهم عليه \" بل سوّلت لكم أنفسكم أمرا فصبر جميل \" أي فسأصبر صبرا جميلا على هذا الأمر الذي اتفقتم عليه حتى يفرجه الله بعونه ولطفه \" والله المستعان على ما تصفون \" أي على ما تذكرون من الكذب والمحال. وقال الثوري عن سماك عن سعيد بن جبير عن ابن عباس \" وجاءوا على قميصه بدم كذب \" قال لو أكله السبع لخرق القميص وكذا قال الشعبي والحسن وقتادة وغير واحد وقال مجاهد: الصبر الجميل الذي لا جزع فيه. وروى هشيم عن عبد الرحمن بن يحيي عن حبان بن أبي حبلة قال: سئل رسول اله صلي الله عليه وسلم عن قوله \" فصبر جميل\" فقال \" صبر لا شكوى فيه \" وهذا مرسل. وقال عبد الرزاق قال الثوري عن بعض أصحابه أنه قال: ثلاث من الصبر: أن لا تحدث بوجعك ولا بمصيبتك ولا تزكي نفسك. وذكر البخاري ههنا حديث عائشة في الإفك حتى ذكر قولها والله لا أجد لي ولكم مثلا إلا كما قال أبو يوسف \" فصبر جميل والله المستعان على ما تصفون \"."
    },
    {
      "ayah": 19,
      "surah": 12,
      "text": "يقول تعالى مخبرا عما جرى ليوسف حين ألقاه إخوته وتركوه في ذلك الجب وحيدا فريدا فمكث عليه السلام في البئر ثلاثة أيام فيما قاله أبو بكر بن عياش وقال محمد بن إسحاق لما ألقاه إخوته جلسوا حول البئر يومهم ذلك ينظرون ماذا يصنع وما يصنع به فساق الله له سيارة فنزلوا قريبا من تلك البئر وأرسلوا واردهم هو الذي يتطلب لهم الماء فلما جاء ذلك البئر وأدلى بدلوه فيها تشبث يوسف عليه السلام فيها فأخرجه واستبشر به وقال \"يا بشرى هذا غلام\" وقرأ بعض القراء يا بشراي فزعم السدي أنه اسم رجل ناداه ذلك الرجل الذي أدلى بدلوه معلما له أنه أصاب غلاما وهذا القول من السدي غريب لأنه لم يسبق إلى تفسير هذه القراءة بهذا إلا في رواية عن ابن عباس والله أعلم. وإنما معنى القراءة على هذا النحو يرجع إلى القراءة الأخرى ويكون قد أضـاف البشرى إلى نفسه وحذف ياء الإضافة وهو يريدها كما تقول العرب يا نفس اصبري يا غلام أقبل بحذف حرف الإضافة ويجوز الكسر حينئذ والرفع وهذا منه وتفسرها القراءة الأخرى يا بشراي والله أعلم. وقوله \" وأسروه بضاعة \" أي وأسره الواردون من بقية السيارة وقالوا اشتريناه وتبضعناه من أصحاب الماء مخافة أن يشاركوهم فيه إذا علموا خبره. قاله مجاهد والسدي وابن جرير هذا قول وقال العوفي عن بن عباس قوله \" وأسروه بضاعة \" يعني إخوة يوسف أسروا شأنه وكتموا أن يكون أخاهم وكتم يوسف شأنه مخافة أن يقتله إخوته واختار البيع فذكره إخوته لوارد القوم فنادى أصحابه \" يا بشرى هذا غلام \" يباع فباعه إخوته وقوله \" والله عليم بما يعملون \" أي عليم بما يفعله إخوة يوسف ومشتروه وهو قادر على تغيير ذلك ودفعه ولكن له حكمة وقدر سابق فترك ذلك ليمضي ما قدره وقضاه \" ألا له الخلق والأمر تبارك الله رب العالمين \" وفي هذا تعريض لرسوله محمد صلي الله عليه وسلم لإعلام له بأني عالم بأذي قومك لك وأنا قادر على الإنكار عليهم ولكني سأملي لهم ثم أجعل لك العاقبة والحكم عليهم كما جعلت ليوسف الحكم والعاقبة على إخوته."
    },
    {
      "ayah": 2,
      "surah": 12,
      "text": "وذلك لأن لغة العرب أفصح اللغات وأبينها وأوسعها وأكثرها تأدية للمعاني التي تقوم بالنفوس فلهذا أنزل أشرف الكتب بأشرف اللغات علي أشرف الرسل بسفارة أشرف الملائكة وكان ذلك في أشرف بقاع الأرض ; وابتدئ إنزاله في أشرف شهور السنة وهو رمضان فكمل من كل الوجوه."
    },
    {
      "ayah": 20,
      "surah": 12,
      "text": "يقول تعالى: وباعه إخوته بثمن قليل. قال مجاهد وعكرمة: والبخس هو النقص كما قال تعالى \" فلا يخاف بخسا ولا رهقا\" أي اعتاض عنه إخوته بثمن دون قليل ومع ذلك كانوا فيه من الزاهدين أي ليس لهم رغبة فيه بل لو سئلوه بلا شئ لأجابوا. قال ابن عباس ومجاهد والضحاك إن الضمير في قوله \" وشروه \" عائد على إخوة يوسف ; وقال قتادة: بل هو عائد على السيارة والأول أقوى لأن قوله \" وكانوا فيه من الزاهدين \" إنما أراد إخوته لا أولئك السيارة لأن السيارة استبشروا به وأسروه بضاعة ولو كانوا فيه زاهدين لما اشتروه فترجح من هذا أن الضمير في \" شروه \" إنما هو لإخوته.وقيل المراد بقوله \" بخس \" الحرام وقيل الظلم وهذا وإن كان كذلك لكن ليس هو المراد هنا لأن هذا معلوم يعرفه كل أحد أن ثمنه حرام على كل حال وعلى كل أحد لأنه نبي ابن نبي ابن نبي ابن خليل الرحمن فهو الكريم ابن الكريم ابن الكريم ابن الكريم لإنما المراد هنا بالبخس الناقص أو الزيوف أو كلاهما أي إنهم إخوته وقد باعوه ومع هذا بأنقص الأثمان ولهذا قال \" دراهم معدودة \" فعن ابن مسعود رضي الله عنه باعوه بعشرين درهما وكذا قال ابن عباس ونوف البكالي والسدي وقتادة وعطية العوفي وزاد اقتسموها درهمين درهمين وقال مجاهد: اثنان وعشرون درهما وقال محمد بن إسحاق وعكرمة أربعون درهما وقال الضحاك في قوله \" وكانوا فيه من الزاهدين \" وذلك أنهم لم يعلموا نبوته منزلته عند الله عز وجل وقال مجاهد لما باعوه جعلوا يتبعونهم ويقولون لهم استوثقوا منه لا يأبق حتى وقفوه بمصر فقال: من يبتاعني وليبشر ؟ فاشتراه الملك وكان مسلما."
    },
    {
      "ayah": 21,
      "surah": 12,
      "text": "يقول تعالى \" وكذلك مكنا ليوسف في الأرض ولنعلمه من تأويل الأحاديث والله غالب علي أمره ولكن أكثر الناس لا يعلمون\" يخبر تعالى بألطافه بيوسف عليه السلام أنه قيض له الذي اشتراه من مصر حتى اعنى به وأكرمه وأوصى أهله به وتوسم فيه الخير والصلاح فقال لامرأته \" أكرمي مثواه عسى أن ينفعنا أو نتخذه ولدا \" وكان الذي اشتراه من مصر عزيزها وهو الوزير ; حدثنا العوفي عن ابن عباس وكان اسمه قطفير وقال محمد بن إسحاق: اسمه أطفير بن روحيب وهو العزيز وكان على خزائن مصر وكان الملك يومئذ الريان بن الوليد رجل من العماليق قال: واسم امرأته راعيل بنت رعابيل وقال غيره اسمها زليخا وقال محمد بن إسحاق أيضا عن محمد بن السائب عن أبي صالح عن ابن عباس: كان الذي باعه بمصر مالك بن دعر بن قريب بن عنقا بن مديان بن إبراهيم فالله أعلم وقال أبو إسحاق عن أبي عبيدة عن عبد الله بن مسعود أنه قال: أفرس الناس ثلاثه: عزيز مصر حين قال لامرأته \" أكرمي مثواه \" والمرأة التي قالت لأبيها \" يا أبت استأجره \" الآية وأبو بكر الصديق حين استخلف عمر بن الخطاب رضي الله عنهما. يقول تعالى: كما أنقذنا يوسف من إخوته \" كذلك مكنا ليوسف في الأرض \" يعني بلاد مصر \"ولنعلمه من تأويل الأحاديث\" قال مجاهد والسدي: هو تعبير الرؤيا \" والله غالب على أمره \" إي إذا أراد شيئا فلا رد ولا يمانع ولا يخالف بل هو الغالب لما سواء. قال سعيد بن جبير في قوله \" والله غالب علي أمره \" أي فعال لما يشاء وقوله \" ولكن أكثر الناس لا يعلمون \" يقول لا يدرون حكمته في خلقه وتلطفه وفعله لما يريد."
    },
    {
      "ayah": 22,
      "surah": 12,
      "text": "وقوله \" ولما بلغ \" أي يوسف عليه السلام \" أشده \" أي استكمل عقله وتم خلقه \" آتيناه حكما وعلما \" يعني النبوة أنه حباه بها بين أولئك الأقوام \" وكذلك نجزي المحسنين \" أي إنه كان محسنا في عمله عاملا بطاعة الله تعالى وقد اختلف في مقدار المدة التي بلغ فيها أشده فقال ابن عباس ومجاهد وقتادة: ثلاث وثلاثون سنة وعن ابن عباس بضع وثلاثون وقال الضحاك عشرون وقال الحسن أربعون سنة وقال عكرما خمس وعشرون سنة وقال السدي ثلاثون سنة وقال سعيد بن جبير ثمانية عشر سنة وقال الإمام مالك وربيعة بن زيد بن أسلم والشعبي الأشد الحلم وقيل غير دلك والله أعلم."
    },
    {
      "ayah": 23,
      "surah": 12,
      "text": "يخبر تعالى عن امرأة العزيز التي كان يوسف في بيتها بمصر وقد أوصاها زوجها به وبإكرامه فراودته عن نفسه أي حاولته على نفسه ودعته إليها وذلك أنها أحبته حبا شديدا لجماله وحسنه وبهائه فحملها ذلك على أن تجملت له وغلقت عليه الأبواب ودعته إلى نفسها \" وقالت هيت لك \" فامتنع من ذلك أشد الامتناع و \" قال معاذ الله إنه ربي أحسن مثواي \" وكانوا يطلقون الرب على السيد الكبير أي إن بعلك ربي أحسن مثواي أي منزلي وأحسن إلي فلا أقابله بالفاحشة في أهله \" إنه لا يفلح الظالمون \" قال ذلك مجاهد والسدي ومحمد بن إسحاق وغيرهم وقد اختلف القراء في قوله \" هيت لك \" فقرأه كثيرون بفتح الهاء وإسكان الياء وفتح التاء قال ابن عباس ومجاهد وغير واحد: معناه أنها تدعوه إلى نفسها وقال علي بن أبي طلحة والعوفي عن ابن عباس: هيت لك تقول هلم لك. وكذا قال زرين حبيش وعكرمة والحصن وقتادة قال عمرو بن عبيد عن الحسن وهى كلمة بالسريانية أي عليك وقال السدي: هيت لك أي هلم لك وهي بالقبطية قال مجاهد: في لغة عربية تدعوه بها وقال البخاري وقال عكرمة: هيت لك أي هلم لك بالحورانية وهكذا ذكره معلقا وقد أسنده الإمام أبو جعفر بن جرير حدثني أحمد بن سهل الواسطي حدثنا قرة بن عيسى حدثنا النضر بن علي الجزري عن عكرمة مولى ابن عباس في قوله \" هيت لك \" قال هلم لك قال: هي بالحورانية وقال أبو عبيد القاسم بن سلام وكان الكسائي يحب هذه القراءة يعني هيت لك ويقول لغة لأهل حوران وقعت إلى أهل الحجاز ومعناها تعال وقال أبو عبيدة: سألت شيخا عالما من أهل حوران فذكر أنها لغتهم عرفها واستشهد الإمام ابن جرير على هذه القراءة بقول الشاعر لعلي بن أبى طالب رضي الله عنه: أبلغ أمير المؤمنين أذى العراق إذا أمينا إن العراق وأهله عنق إليك فهيت هيتا يقول فتعال واقترب وقرأ ذلك آخرون هئت لك بكسر الهاء والهز وضم التاء بمعنى تهيأت لك من قول القائل هئت بالأمر اهيئ هئة وممن روي عنه هذه القراءة ابن عباس وأبو عبد الرحمن السلمى وأبو وائل وعكرمة وقتادة وكلهم يفسرها بمعنى تهيأت لك قال ابن جرير: وكان أبو عمرو والكسائي ينكران هذه القراءة وقرأ عبد الله بن إسحاق هيت بفتح الهاء وكسر التاء وهي غريبة وقرأ آخرون منهم عامة أهل المدينة هيت بفتح الهاء وضم التاء وأنشد قول الشاعر: ليس قومي بالأبعدين إذا ما قال داع من العشيرة هيت قال عبد الرزاق: أنبأنا الثوري عن الأعمش عن أبي وائل قال: قال ابن مسعود وقد سمع القراء متقاربين فاقرءوا كما علمتم وإياكم والتنطع والاختلاف وإنما هو كقول أحدكم هلم وتعال ثم قرأ عبد الله هيت لك فقال يا أبا عبد الرحمن ناسا يقرءونها هيت قال عبد الله: أن أقرأها كـما علمت أحب إلي وقال ابن جرير: حدثني ابن وكيع حدثنا ابن عينة عن منصور عن أبي وائل قال: قال عبد الله هيت لك فقال له مسروق إن ناسا يقرؤنها هيت لك فقال دعوني فإنى أقرأ كما علمت أحب إلي وقال أيضا: حدثني المثنى حدثنا آدم بن إياس حدثنا شعبة عن شقيق عن ابن مسعود قال: هيت لك بنصب الهاء والتاء ولا تهمز وقال آخرون هيت لك بكسر الهاء واسكان الياء وضم التاء قال أبو عبيد معمر بن المثنى هيت لا تثنى ولا تجمع ولا تؤنث بل يخاطب الجميع بلفظ واحد فيقال هيت لك وهيت لكم وهيت لكما وهيت لكن وهيت لهن."
    },
    {
      "ayah": 24,
      "surah": 12,
      "text": "اختلفت أقوال الناس وعباراتهم في هذا المقام وقد روي عن ابن عباس ومجاهد وسعيد بن جبير وطائفة من السلف في ذلك ما رواه ابن جرير وغيره والله أعلم وقيل المراد بهمه بها خطرات حديث النفس حكاه البغوي عن بعض أهل التحقيق ثم أورد البغوي ههنا حديث عبد الرزاق عن معمر عن همام عن أبي هريرة رضي الله عنه قال: قال رسول الله صلي الله عليه وسلم يقول الله تعالى: إذا هم عبدي بحسنة فاكتبوها له حسنة فإن عملها فاكتبوها له بعشر أمثالها وإن هم بسيئة فلم يعملها فاكتبوها حسنة فإنما تركها من جرائي فإن عملها فاكتبوها بمثلها وهذا الحديث مخرج في الصحيحين وله ألفاظ كثيرة هذا منها وقيل هم بضربها وقيل تمناها زوجة وقيل هم بها لولا أن رأى برهان ربه أي فلم يهم بها وفي هذا القول نظر من حيث العربية حكاه ابن جرير وغيره وأما البرهان الذي رآه ففيه أقوال أيضا فعن ابن عباس وسعيد ومجاهد وسعيد بن جبير ومحمد بن سيرين والحسن وقتادة وأبي صالح والضحاك ومحمد بن إسحاق وغيرهم رأى صورة أبيه يعقوب عاضا على أصبعه بفمه وقيل عنه في رواية فضرب في صدر يوسف وقال العوفي عن ابن عباس: رأى خيال الملك يعني سيده وكذا قال محمد بن إسحاق فيما حكاه عن بعضهم إنما هو خيال قطفير سده حين دنا من الباب وقال ابن جرير: حدثنا أبو كريب حدثنا وكيع عن أبي مودود سمعت من محمد بن كعب القرظي قال رفع يوسف رأسه إلى سقف البيت فإذا كتاب في حائط البيت \" لا تقربوا الزنا إنه كان فاحشة ومقتا وساء سبيلا \" وكذا رواه أبو معشر المدني عن محمد بن كعب وقال عبد الله بن وهب: أخبرني نافع بن يزيد عن أبي صخر قال: سمعت القرظي يقول في البرهان الذي رآه يوسف ثلاث آيات من كتاب الله \" إن عليكم لحافظين \" الآية وقوله \" وما تكون في شأن \" الآية وقوله \" أفمن هو قائم على كل نفس بما كسبت \" قال نافع: سمعت أبا هلال يقول مثل قول القرظي وزاد آية رابعة \" ولا تقربوا الزنا \" وقال الأوزاعي: رأى أية من كتاب الله في الجدار تنهاه عن ذلك قال ابن جرير: والصواب أن يقال إنه رأى آية من آيات الله تزجره عما كان هم به وجائز أن يكون صورة يعقوب وجائز أن يكون صورة الملك وجائز أن يكون ما رآه مكتوبا من الزجر عن ذلك ولا حجه قاطعة على تعيين شيء من ذلك فالصواب أن يطلق كما قال الله تعالى وقوله \" كذلك لنصرف عنه السوء والفحشاء \" أي كما أريناه برهانا صرفه عما كان فيه كذلك نقيه السوء والفحشاء في جميع أموره \" إنه من عبادنا المخلصين \" أي من المجتبين المطهرين المختارين المصطفين الأخيار صلوات الله وسلامه عليه."
    },
    {
      "ayah": 25,
      "surah": 12,
      "text": "يخبر تعالى عن حالهما حين خرجا يستبقا إلى الباب يوسف هارب والمرأة تطلبه ليرجع إلى البيت فلحقته في أثناء ذلك فأمسكت بقميصه من ورائه فقدته قدا فظيعا يقال إنه سقط عنه واستمر يوسف هاربا ذاهبا وهي في إثره فألفيا سيدها وهو زوجها عند الباب فعند ذلك خرجت مما هي فيه بمكرها وكيدها وقالت لزوجها متنصلة وقاذفة يوسف بدائها \" ما جزاء من أراد بأهلك سوءا \" أي فاحشة \" إلا أن يسجن \" أي يحبس \" أو عذاب أليم \" أي يضرب ضربا شديدا موجعا فعند ذلك انتصر يوسف عليه السلام بالحق وتبرأ مما رمته به من الخيانة."
    },
    {
      "ayah": 26,
      "surah": 12,
      "text": "وقال بارا صادقا \" هي راودتني عن نفسي \" وذكر أنها اتبعته تجذبه إليها حتى قدت قميصه \" وشهد شاهد من أهلها إن كان قميصه قد من قبل \" أي من قدامه فصدقت هي أي في قولها إنه راودها عن نفسها لأنه يكون لما دعاها وأبت عليه دفعته في صدره فقدت قميصه فيصح ما قالت."
    },
    {
      "ayah": 27,
      "surah": 12,
      "text": "وذلك يكون كما وقع لما هرب منها وتطلبته أمسكت بقميصه من ورائه لترده إليها فقدت قميصه من ورائه; وقد اختلفوا في هذا الشاهد هل هو صغير أو كبير؟ على قولين لعلماء السلف فقال عبد الرزاق أخبرنا إسرائيل عن سماك عن عكرمة عن ابن عباس \" وشهد شاهد من أهلها \" قال ذو لحية وقال الثوري عن جابر عن ابن أبي مليكة عن ابن عباس: كان من خاصة الملك وكذا قال مجاهد وعكرمة والحسن وقتادة والسدي ومحمد بن إسحاق وغيرهم: إنه كان رجلا وقال زيد بن أسلم والسدي: كان ابن عمها وقال ابن عباس كان من خاصة الملك وقد ذكر ابن إسحاق أن زليخا كانت بنت أخت الملك الريان بن الوليد وقال العوفي عن ابن عباس في قوله \" وشهد شاهد من أهلها \" قال كان صبيا في المهد وكذا روي عن أبي هريرة وهلال بن يساف والحسن وسعيد بن جبير والضحاك بن مزاحم أنه كان صبيا في الدار واختاره ابن جرير وقد ورد فيه حديث مرفوع فقال ابن جرير: حدثنا الحسن بن محمد حدثنا عفان حدثنا حماد هو ابن سلمة أخبرني عطاء بن السائب عن سعيد بن جبير عن ابن عباس عن النبي صلي الله عليه وسلم قال تكلم أربعة وهم صغار فذكر فيهم شاهد يوسف ورواه غيره عن حماد بن سلمة عن عطاء عن سعيد بن جبير عن ابن عباس أنه قال: تكلم أربعة وهم صغار ابن ماشطة بنت فرعون وشاهد يوسف وصاحب جريج وعيسى ابن مريم وقال الليث بن أبي سليم عن مجاهد أن من أمر الله تعالى ولم يكن إنسيا وهذا قول غريب."
    },
    {
      "ayah": 28,
      "surah": 12,
      "text": "وقوله \"فلما رأى قميصه قد من دبر أى لما تحقق زوجها صدق يوسف وكذبها فيما قذفته ورمته به \" قال إنه من كيدكن \" أي إن هذا البهت واللطخ الذي لطخت عرض هذا الشاب به من جملة كيدكن \"إن كيدكن عظيم\" ثم قال آمرا ليوسف عليه السلام بكتمان ما وقع."
    },
    {
      "ayah": 29,
      "surah": 12,
      "text": "\"يوسف أعرض عن هذا \" أي اضرب عن هذا صفحا أي فلا تذكره لأحد \" واستغفري لذنبك \" يقول لامرأته وقد كان لين العريكة سهلا أو أنه عذرها لأنها رأت مالا صبر لها عنه فقال لها: استغفري لذنبك أي الذي وقع منك من إرادة السوء بهذا الشاب ثم قذفه بما هو بريء منه \" إنك كنت من الخاطئين \"."
    },
    {
      "ayah": 3,
      "surah": 12,
      "text": "ولهذا قال \"نحن نقص عليك أحسن القصص بما أوحينا إليك هذا القرآن \" بسبب إيحائنا إليك هذا القرآن وقد ورد في سبب نزول هذه الآية ما رواه ابن جرير حدثني نصر بن عبد الرحمن الأودي: حدثنا حكام الرازي عن أيوب عن عمرو هو ابن قيس الملائي عن ابن عباس قال: قالوا يا رسول الله لو قصصت علينا؟ فنزلت \"نحن نقص عليك أحسن القصص\" ورواه من وجه آخر عن عمرو بن قيس مرسلا. وقال أيضا حدثنا محمد بن سعيد القطان حدثنا عمرو بن محمد أنبأنا خالد الصفار عن عمرو بن قيس عن عمرو بن مرة عن مصعب بن سعد عن أبيه قال: أنزل علي النبي صلي الله عليه وسلم القرآن قال فتلاه عليهم زمانا فقالوا يا رسول الله لو قصصت علينا؟ فأنزل الله عز وجل \"الر تلك آيات الكتاب المبين\" إلي قوله \"لعلكم تعقلون\" ثم تلاه عليهم زمانا فقالوا يا رسول الله لو حدثتنا فأنزل الله عز وجل \"الله نزل أحسن الحديث\" الآيه وذكر الحديث ورواه الحاكم من حديث إسحاق بن راهويه عن عمرو بن محمد القرشي المنقري به وروي ابن جرير بسنده عن المسعودي عن عون بن عبدالله قال: مل أصحاب رسول الله صلي الله عليه وسلم ملة فقالوا: يا رسول الله حدثنا فأنزل الله \"الله نزل أحسن الحديث\" ثم ملوا ملة أخري فقالوا يا رسول الله حدثنا فوق الحديث ودون القرآن - يعنون القصص - فأنزل الله عز وجل \"الر تلك آيات الكتاب المبين إنا أنزلنا قرآنا عربيا لعلكم تعقلون نحن نقص عليك أحسن القصص\" الآية فأرادوا الحديث فدلهم علي أحسن الحديث وأرادوا القصص فدلهم علي أحسن القصص. ومما يناسب ذكره عند هذه الآية الكريمة المشتملة علي مدح القرآن وأنه كاف عن كل ما سواه من الكتب ما رواه الإمام أحمد: حدثنا شريح بن النعمان انبأنا هشيم أنبأنا مجالد عن الشعبي عن جابر بن عبدالله أن عمر بن الخطاب أتي النبي صلي الله عليه وسلم بكتاب أصابه من بعض أهل الكتاب فقرأه علي النبي صلي الله عليه وسلم قال فغضب وقال \"أمتهوكون فيها يا ابن الخطاب؟ والذي نفسي بيده لقد جئتكم بها بيضاء نقية لا تسألوهم عن شيء فيخبروكم بحق فتكذبونه أو بباطل فتصدقونه والذي نفسي بيده لو أن موسي كان حيا ما وسعه إلا أن يتبعني\" وقال الإمام أحمد: حدثنا عبد الرزاق أنا سفيان عن جابر عن الشعبي عن عبدالله بن ثابت قال: جاء عمر إلي رسول الله صلي الله عليه وسلم فقال: يا رسول الله إني مررت بأخ لي من قريظة فكتب لي جوامع من التوراة ألا أعرضها عليك؟ قال فتغير وجه رسول الله صلي الله عليه وسلم قال عبدالله بن ثابت فقلت له ألا تري ما بوجه رسول الله صلي الله عليه وسلم؟ فقال عمر: رضينا بالله ربا وبالإسلام دينا وبمحمد رسولا قال فسري عن النبي صلي الله عليه وسلم وقال \"والذي نفس محمد بيده لو أصبح فيكم موسي ثم اتبعتموه وتركتموني لضللتم إنكم حظي من الأمم وأنا حظكم من النبيين\" وقال الحافظ أبو يعلي الموصلي: حدثنا عبد الغفار بن عبدالله بن الزبير حدثنا علي بن مسهر عن عبدالرحمن بن إسحاق عن خليفة بن قيس عن خالد بن عرفطة قال: كنت جالسا عند عمر إذ أتي برجل من عبد القيس مسكنه بالسوس فقال له عمر: أنت فلان بن فلان العبدي؟ قال نعم قال وأنت النازل بالسوس؟ قال نعم فضربه بقناة معه قال: فقال الرجل: ما لي يا أمير المؤمنين؟ فقال له عمر اجلس فجلس فقرأ عليه \"بسم الله الرحمن الرحيم الر تلك آيات الكتاب المبين إنا أنزلنا قرآنا عربيا لعلكم تعقلون نحن نقص عليك أحسن القصص - إلي - لمن الغافلين\" فقرأها عليه ثلاثا وضربه ثلاثا فقال له الرجل ما لي يا أمير المؤمنين؟ فقال: أنت الذي نسخت كتاب دانيال قال مرني بأمرك أتبعه قال: انطلق فامحه بالحميم والصوف الأبيض ثم لا تقرأه ولا تقرئه أحدا من الناس فلئن بلغني عنك أنك قرأته أو أقرأته أحدا من الناس لأنهكنك عقوبة ثم قال: اجلس فجلس بين يديه فقال انطلقت أنا فانتسخت كتابا من أهل الكتاب ثم جئت به في أديم فقال لي رسول الله صلي الله عليه وسلم \"ما هذا فى يدك يا عمر؟ \"قال قلت يا رسول الله كتاب نسخته لنزداد به علما إلي علمنا فغضب رسول الله صلي الله عليه وسلم حتي احمرت وجنتاه ثم نودي بالصلاة جامعة فقالت الأنصار أغضب نبيكم صلي الله عليه وسلم؟ السلاح السلاح فجاءوا حتي أحدقوا بمنبر رسول الله صلي الله عليه وسلم فقال \"يا أيها الناس إني قد أوتيت جوامع الكلم وخواتيمه واختصر لي اختصار ولقد أتيتكم بها بيضاء نقية فلا تهوكوا ولا بغرنكم المتهوكون\" قال عمر: فقمت فقلت رضيت بالله ربا وبالإسلام دينا وبك رسولا ثم نزل رسول الله صلي الله عليه وسلم. وقد رواه ابن أبي حاتم في تفسيره مختصرا من حديث عبدالرحمن بن إسحاق به وهذا حديث غريب من هذا الوجه وعبدالرحمن بن إسحاق هو أبو شيبة الواسطي وقد ضعفوه وشيخه قال البخاري: لا يصح حديثه قلت وقد روي له شاهد من وجه آخر فقال الحافظ أبو بكر أحمد بن إبراهيم الإسماعيلي: أخبرني الحسن بن سفيان حدثنا يعقوب بن سفيان حدثنا إسحاق بن إبراهيم بن العلاء الزبيدي حدثني عمرو بن الحارث حدثنا عبد الله بن سالم الأشعري عن الزبيدي حدثنا سليم بن عامر أن جبير بن نفير حدثهم أن رجلين كانا بحمص في خلافة عمر رضي الله عنه فأرسل إليهما فيمن أرسل من أهل حمص وكانا قد اكتتبا من اليهود صلاصفة فأخذاها معهما يستفتيان فيها أمير المؤمنين يقولون: إن رضيها لنا أمير المؤمنين ازدنا فيها رغبة وإن نهانا عنها رفضناها فلما قدما عليه قالا إنا بأرض أهل الكتاب وإنا نسمع منهم كلاما تقشعر منه جلودك أفنأخذ منه أو نترك ؟ فقال لعلكما كتبتما منه شيئا ؟ فقالا: لا قال سأحدثكما: انطلقت في حياة النبي صلى الله عليه وآله وسلم حتى أتبت خيبر فوجدت يهوديا يقول قولا أعجبني فقلت: هل أنت مكتبي مما تقول ؟ قال نعم فأتيت بأديم فأخذ يملي عليّ حتى كتبت في الأكراع فلما رجعت قلت يا نبي الله وأخبرته قال \" ائتي به \"فانطلقت أرغب عن الشيء رجاء أن أكون جئت رسول الله ببعض ما يحب فلما أتيت به قال \" اجلس اقرأ علي \"فقرأت ساعة ثم نظرت إلى وجه رسول الله صلي الله عليه وسلم فإذا هو يتلون فتحيرت من الفرق فما استطعت أن أجيز منه حرفا فلما رأى الذي بي رفعه ثم جعل يتبعه رسما رسما فيمحوه بريقه وهو يقول \" لا تتبعوا هؤلاء فإنهم قد هوكوا وتهوكوا \"حتي محا آخره حرفا حرفا قال عمر رضي الله عنه: فلو علمت أنكما كتبتما منه شيئا جعلتكما نكالا لهذه الأمة قالا: والله ما نكتب منه شيئا أبدا فخرجا بصلاصفتهما فحفرا لها فلم يألوا أن يعمقا ودفناها فكان آخر العهد منها. وهكذا روى الثوري عن جابر بن يزيد الجعفي عن الشعبي عن عبد الله بن ثابت الأنصاري عن عمر بن الخطاب بنحوه وروي أبو داود في المراسيل من حديث أبي قلابة عن عمر نحوه والله أعلم."
    },
    {
      "ayah": 30,
      "surah": 12,
      "text": "يخبر تعالى أن خبر يوسف وامرأة العزيز شاع في المدينة وهي مصر حتى تحدث به الناس \" وقال نسوة في المدينة \" مثل نساء الكراء والأمراء ينكرن على امرأة العزيز وهو الوزير ويعبن ذلك عليها \" امرأة العزير تراود فتاها عن نفسه \" أي تحاول غلامها عن نفسه وتدعوه إلى نفسها \" قد شغفها حبا \" أي قد وصل حبه إلى شغاف قلبها وهو غلافه قال الضحاك عن ابن عباس: الشغف الحب القاتل والشغف دون ذلك والشغاف حجاب القلب \"إنا لنراها فى ضلال مبين \" أي في صنيعها هذا من حبها فتاها ومراودتها إياه عن نفسه."
    },
    {
      "ayah": 31,
      "surah": 12,
      "text": "فلما سمعت بمكرهن \" قال بعضهم بقولهن ذهب الحب بها وقال محمد بن إسحاق بل بلغهن حسن يوسف فأحببن أن يريه فقلن ليتوصلن إلى رؤية ومشاهدته فعند ذلك \" أرسلت إليهن \" أي دعتهن إلى منزلهـا لتضيفهن \" وأعتدت لهن \"متكأ \" قال ابن عباس وسعيد بن جبير ومجاهد والحسن والسدي وغيرهم: هو المجلس المعد فيه مفارش ومخاد وطعام فيه ما يقطع بالسكاكين من أترج ونحوه ولهذا قال تعالى \" وآتت كل واحدة منهن سكينا \" وكان هذا مكيدة منها ومقابلة لهن في احتيالهن على رؤيته \" وقالت اخرج عليهن \" وذلك أنها كانت قد خبأته في مكان آخر فلما \" خرج \" و \"رأينه أكبرنه \" أي أعظمنه أي أعظمن شأنه وأجللن قدره وجعلن يقطعن أيديهن دهشة برؤيته وهن يظنن أنهن يقطعن الأترج بالسكاكين والمراد أنهن حززن أيديهن بها قاله غير واحد وعن مجاهد وقتادة: قطعن أيديهن حتى ألقينها فالله أعلم وقد ذكر غير واحد أنها قالت لهن بعد ما أكلن وطابت أنفسهن مم وضعت بين أيديهن أترجا وآتت كل واحدة منهن سكينا هل لكن في النظر إلى يوسف؟ قلن نعم فبعثت إليه تأمره أن اخرج إليهن فلما رأينه جعلن يقطعن أيديهن ثم أمرته آن يرجع ليرينه مقبلا ومدبرا فرجع وهن يحززن في أيديهن فلما أحسسن بالألم جعلن يولولن فقالت أنتن من نظرة واحدة فعلتن هذا فكيف ألام أنا؟ \" فقلن حاش لله ما هذا بشرا إن هذا إلا ملك كريم \" ثم قلن لها: وما نرى عليك من لوم بعد هذا الذي رأينا لأنهن لم يرين في البشر شبيهه ولا قريبا منه فإنه عليه السلام كان قد أعطي شطر الحسن كما ثبت ذلك في الحديث الصحيح في حديث الإسراء أن رسول الله صلي الله عليه وسلم مر بيوسف عليه السلام في السماء الثالثة قال فإذا هو قد أعطى شطر الحسن وقال حماد بن سلمة عن ثابت عن أنس قال: قال رسول الله صلي الله عليه وسلم أعطي يوسف وأمه شطر الحسن وقال سفيان الثوري عن أبي إسحاق عن أبي الأحوص عن عبد الله بن مسعود قال: أعطي يوسف وأمه ثلث الحسن وقال أبو إسحاق أيضا عن أبي الأحوص عن عبد الله قال: كان وجه يوسف مثل البرق وقالت المرأة إذا أتته لحاجة غطى وجهه مخافة أن تفتن به ورواه الحسن البصري مرسلا عن النبي صلي الله عليه وسلم أنه قال أعطي يوسف وأمه ثلث حسن أهل الدنيا وأعطي الناس الثلثين أو قال أعطى يوسف وأمه الثلثين والناس الثلث وقال سفيان عن منصور عن مجاهد عن ربيعه الجرشي قال: قسم الحسن نصفين فأعطي يوسف وأمه سارة نصف الحسن والنصف الآخر بين سائر الخلق وقال الإمام أبو القاسم السهيلي: معناه أن يوسف عليه السلام كان على النصف من حسن آدم عليه السلام فإن الله خلق آدم بيده على أكمل صورة وأحسنها ولم يكن في ذريته من يوازيه في جماله وكان يوسف قد أعطى شطر حسنه فلهذا قال هؤلاء النسوة عند رؤيته \" حاش لله\" قال مجاهد وغير واحد معاذ الله \" ما هذا بشرا \" وقرأ بعضهم ما هذا بشرى أي بمشترى بشراء."
    },
    {
      "ayah": 32,
      "surah": 12,
      "text": "\" إن هذا إلا ملك كريم قالت فذلكن الذي لمتنني فيه \" تقول هذا معتذرة إليهن بأن هذا حقيق أن يحب لجماله وكماله \" ولقد راودته عن نفسه فاستعصم \" أي فامتنع قال بعضهم لما رأين جماله الظاهر أخبرتهن بصفاته الحسنة التي تخفى عنهن وهي العفة مع هذا الجمال ثم قالت تتوعده \" ولئن لم يفعل ما آمره ليسجنن وليكونا من الصاغرين \" فعند ذلك استعاذ يوسف عليه السلام من شرهن وكيدهن."
    },
    {
      "ayah": 33,
      "surah": 12,
      "text": "\" وقال رب السجن أحب إلي مما يدعونني إليه \" أي من الفاحشة وإلا تصرف عني كيدهن أصب إليهن \" أي إن وكلتي إلى نفسي فليس لي منها قدرة ولا أملك لها ضرا ولا نفعا إلا بحولك وقوتك أنت المستعان وعليك التكلان فلا تكلني إلى نفسي \" أصب إليهن وأكن من الجاهلين فاستجاب له ربه \" الآية وذلك أن يوسف عليه السلام عصمه الله عصمة عظيمة وحماه فامتنع منها أشد الامتناع واختار السجن على ذلك وهذا في غاية مقامات الكمال أنه مع شبابه وجماله وكماله تدعوه سيدته وهى امرأة عزيز مصر وهي مع هذا في غاية الجمال والمال والرياسة ويمتنع من ذلك ويختار السجن على ذلك خوفا من الله ورجاء ثوابه ولهذا ثبت في الصحيحين أن رسول الله صلي الله عليه وسلم قال سبعة يظلهم الله في ظله يوم لا ظل إلا ظله: إمام عادل وشاب نشأ في عبادة الله ورجل قلبه معلق بالمسجد إذا خرج منه حتى يعود إليه ورجلان تحابا في الله اجتمعا عليه وتفرقا عليه ورجل تصدق بصدقة فأخفاها حتى لا تعلم شماله ما أنفقت يمينه ورجل دعته امرأة ذات منصب وجمال فقال إنى أخاف الله ورجل ذكر الله خاليا ففاضت عيناه."
    },
    {
      "ayah": 34,
      "surah": 12,
      "text": "\" وقال رب السجن أحب إلي مما يدعونني إليه \" أي من الفاحشة وإلا تصرف عني كيدهن أصب إليهن \" أي إن وكلتي إلى نفسي فليس لي منها قدرة ولا أملك لها ضرا ولا نفعا إلا بحولك وقوتك أنت المستعان وعليك التكلان فلا تكلني إلى نفسي \" أصب إليهن وأكن من الجاهلين فاستجاب له ربه \" الآية وذلك أن يوسف عليه السلام عصمه الله عصمة عظيمة وحماه فامتنع منها أشد الامتناع واختار السجن على ذلك وهذا في غاية مقامات الكمال أنه مع شبابه وجماله وكماله تدعوه سيدته وهى امرأة عزيز مصر وهي مع هذا في غاية الجمال والمال والرياسة ويمتنع من ذلك ويختار السجن على ذلك خوفا من الله ورجاء ثوابه ولهذا ثبت في الصحيحين أن رسول الله صلي الله عليه وسلم قال سبعة يظلهم الله في ظله يوم لا ظل إلا ظله: إمام عادل وشاب نشأ في عبادة الله ورجل قلبه معلق بالمسجد إذا خرج منه حتى يعود إليه ورجلان تحابا في الله اجتمعا عليه وتفرقا عليه ورجل تصدق بصدقة فأخفاها حتى لا تعلم شماله ما أنفقت يمينه ورجل دعته امرأة ذات منصب وجمال فقال إنى أخاف الله ورجل ذكر الله خاليا ففاضت عيناه."
    },
    {
      "ayah": 35,
      "surah": 12,
      "text": "يقول تعالى: ثم ظهر لهم من المصلحة فيما رأوه أنهم يسجنونه إلى \" حين \" أي إلى مدة وذلك بعد ما عرفوا براءته وظهرت الآيات وهي الأدلة على صدقه في عفته ونزاهته وكأنهم والله أعلم إنما سجنوه لما شاع الحديث إيهاما أنه راودها عن نفسها وأنهم سجنوه على ذلك ولهذا لما طلبه الملك الكبير في آخـرا المدة امتنع من الخروج حتى تتبين براءته مما نسب إليه من الخيانة فلما تقرر ذلك خرج وهو نقي العرض صلوات الله عليه وسلامه وذكر السدي أنهم إنما سجنوه لئلا يشيع ما كان منها في حقه ويبرأ عرضه فيفضحها."
    },
    {
      "ayah": 36,
      "surah": 12,
      "text": "قال قتادة: كان أحدهما ساقي الملك والآخر خبازه قال محمد بن إسحاق: كان اسم الذي على الشراب نبوا والآخر مجلث قال السدي: كان سبب حبس الملك إياهما أنه توهم أنهما تمالا على سمه في طعامه وشرابه وكان يوسف عليه السلام قد اشتهر في السجن بالجود والأمانة وصدق الحديث وحسن السمت وكثرة العبادة صلوات الله عليه وسلامه ومعرفة التعبير والإحسان إلى أهل السجن وعيادة مرضاهم والقيام بحقوقهم ولما دخل هذان الفتيان إلى السجن تألفا به وأحباه حبا شديدا وقالا له: والله لقد أحببناك حبا زائدا قال بارك الله فيكما إنه ما أحبني أحد إلا دخل علي من محبته ضرر أحبتني عمتي فدخل علي الضرر بسببها وأحبني أبي فأوذيت بسببه وأحبتني امرأة العزيز فكذلك فقالا والله ما نستطيع إلا ذلك ثم إنهما رأيا مناما فرأى الساقي أنه يعصر خمرا يعني عنبا وكذلك هي في قراءة عبد الله بن مسعود إني أراني أعصر عنبا ورواه ابن أبي حاتم عن أحمد بن سنان عن يزيد بن هارون عن شريك عن الأعمش عن زيد بن وهب عن ابن مسعود أنه قرأها أعصر عنبا وقال الضحاك في قوله \" إنى أرانى أعصر خمرا \" يعني عنبا قال وأهل عمان يسمون العنب خمرا وقال عكرمة: قال له إنى رأيت فيما يرى النائم أني غرست حبلة من عنب فنبتت فخرج فيها عناقيد فعصرتهن ثم سقيتهن الملك فقال: تمكث فى السجن ثلاثة أيام ثم تخرج فتسقيه خمرا وقال الآخر وهو الخباز: \" إني أراني أحمل فوق رأسي خبزا تأكل الطير منه نبئنا بتأويله \" الآية والمشهور عند الأكثرين ما ذكرناه أنهما رأيا مناما وطلبا تعبيره وقال ابن جرير: حدثنا وكيع وابن حميد قالا: حدثنا جرير عن عمارة بن القعقاع عن إبراهيم عن عبدالله بن مسعود قال: ما رأى صاحبا يوسف شيئا إنما كانا تحالما ليجربا عليه."
    },
    {
      "ayah": 37,
      "surah": 12,
      "text": "يخبرهما يوسف عليه أنهما مهما رأيا في منامهما من حلم فإنه عارف بتفسيره ويخبرهما بتأويله قبل وقوعه ولهذا قال \" لا يأتيكما طعام ترزقانه إلا فبأتكما بتأويله \" قال مجاهد يقول \" لا يأتيكما طعام ترزقانه \" في يومكما \" إلا نبأتكما بتأويله قبل أن يأتيكما \" وكذا قال السدي وقال ابن أبي حاتم رحمه الله حدثنا علي بن الحسين حدثنا محمد بن العلاء حدثنا محمد بن يزيد شيخ له ثنا رشدين عن الحسن بن ثوبان عن عكرمة عن ابن عباس قال: ما أدري لعل يوسف عليه السلام كان يعتاف وهو كذلك لأني أجد في كتاب الله حين قال للرجلين \" لا يأتيكما طعام ترزقانه إلا نبأتكما بتأويله \" قال إذا جاءكم الطعام حلوا أو مرا اعتاف عند ذلك ثم قال ابن عباس: إنما علم فعلم وهذا أمر غريب ثم قال وهذا إنما هو من تعليم الله إياي لأني اجتنبت ملة الكافرين بالله واليوم الآخر فلا يرجون ثوابا ولا عقابا في المعاد."
    },
    {
      "ayah": 38,
      "surah": 12,
      "text": "\" واتبعت ملة آبائي إبراهيم وإسحاق ويعقوب \" الآية يقول هجرت طريق الكفر والشرك وسلكت طريق هؤلاء المرسلين صلوات الله وسلامه عليهم أجمعين وهكذا يكون حال من سلك طريق الهدى واتبع طريق المرسلين وأعرض عن طريق الضالين فإن الله يهدي قلبه ويعلمه ما لم يكن يعلم ويجعله إماما يقتدى به في الخير وداعب إلى سبيل الرشاد \" ما كان لنا أن نشرك بالله من شيء ذلك من فضل الله علينا وعلى الناس \" هذا التوحيد وهو الإقرار بأنه لا إله إلا الله وحده لا شريك له \"ذلك من فضل الله علينا \" أي أوحاه إلينا وأمرنا به \" وعلى الناس \" إذ جعلنا دعاة لهم إلى ذلك \" ولكن أكثر الناس لا يشكرون \" أى لا يعرفون نعمة الله عليهم بإرسال الرسل إليهم بل \" بدلوا نعمة الله كفرا وأحلوا قومهم دار البوار \" وقال ابن أبي حاتم: حدثنا أحمد بن سنان حدثنا أبو معاوية حدثنا حجاج عن عطاء عن ابن عباس أنه كان يجعل الجد أبا ويقول والله لمن شاء لاعنته عند الحجر ما ذكر الله جدا ولا جدة قال الله تعالى يعني إخبارا عن يوسف \" واتبعت ملة آبائي إبراهيم وإسحاق ويعقوب \"."
    },
    {
      "ayah": 39,
      "surah": 12,
      "text": "ثم إن يوسف عليه السلام أقبل على الفتيين بالمخاطبة والدعاء لهما إلى عبادة الله وحده لا شريك له وخلع ما سواه من الأوثان التي يعبدها قومهما فقال \" أأرباب متفرقون خير أم الله الواحد القهار \" أي الذي دل كل شيء لعز جلاله وعظمة سلطانه."
    },
    {
      "ayah": 4,
      "surah": 12,
      "text": "يقول تعالى اذكر لقومك يا محمد في قصصك عليهم من قصة يوسف إذ قال لأبيه أبوه هو يعقوب بن إسحاق بن إبراهيم عليهم الصلاة والسلام كما قال الإمام أحمد: ثنا عبد الصمد ثنا عبد الرحمن بن عبد الله بن دينار عن أبيه عن ابن عمر أن رسول الله صلي الله عليه وسلم قال \" الكريم ابن الكريم ابن الكريم ابن الكريم يوسف بن يعقوب بن إسحاق بن إبراهيم \"انفرد بإخراجه البخاري فرواه عن عبد الله بن محمد عن عبد الصمد به وقال البخاري أيضا: ثنا محمد أنا عبدة عن عبيد الله عن سعيد بن أبي سعيد عن أبي هريرة قال: سئل رسول الله صلي الله عليه وسلم أي الناس أكرم ؟ قال \" أكرمهم عند الله أتقاهم \"قالوا ليس عن هذا نسألك قال \" فأكرم الناس يوسف نبي الله ابن نبي الله ابن نبي الله ابن خليل الله \"قالوا: ليس عن هذا نسألك قال \" فعن معادن العرب تسألوني ؟ \" قالوا نعم قال \" فخياركم في الجاهلية خياركم في الإسلام إذا فقهوا \"ثم قال تابعه أبو أسامة عن عبيد الله. وقال ابن عباس رؤيا الأنبياء وحي ; وقد تكلم المفسرون على تعبير هذا المنام أن الأحد عشر كوكبا عبارة عن إخوته وكانوا أحد عشر رجلا سواه والشمس والقمر عبارة عن أمه وأبيه. روي هذا عن ابن عباس والضحاك وقتادة وسفيان الثوري وعبد الرحمن ابن زيد ابن أسلم وقد وقع تفسيرها بعد أربعين سنة وقيل ثمانين سنة وذلك حين رفع أبوية على العرش وهو سريره وإخوته بين يديه \" وخروا له سجدا وقال يا أبت هذا تأويل رؤياي من قبل قد جعلها ربي حقا \" وقد جاء في حديث تسمية هذه الأحد عشر كوكبا فقال الإمام أبو جعفر بن جرير: حدثني علي بن سعيد الكندي ثنا الحكم بن ظهير عن السدي عن عبد الرحمن بن سابط عن جابر قال: أتى النبي صلي الله عليه وسلم رجل من يهود يقال له يستانة اليهودي فقال له يا محمد أخبرني عن الكواكب التي رآها يوسف أنها ساجدة له ما أسماؤها ؟ قال فسكت النبي صلي الله عليه وسلم ساعة فلم يجبه بشيء ونزل عليه جبريل عليه السلام فاخبره بأسمائها قال نبعث رسول الله صلي صلي الله عليه وسلم إليه فقال \" هل أنت مؤمن إذا أخبرتك بأسمائها ؟ \"قال نعم قال \"جريان والطارق والديال وذو الكنفات وقابس ووثاب وعموذان والفيلق والمصبح والضروح ذو الفرع والضياء والنور\" فقال اليهودي: إي والله إنها لأسماؤها. ورواه البيهقي في الدلائل من حديث سعيد بن منصور عن الحكم بن ظهير وقد روى هذا الحديث الحافظان أبو يعلى الموصلي وأبو بكر البزار في مسنديهما وابن أبي حاتم في تفسيره أمّا أبو يعلى فرواه عن أربعة من شيوخه عن الحكم بن ظهير به وزاد: قال رسول الله صلي الله عليه وسلم \" لما رآها يوسف قصها على أبيه يعقوب فقال له أبوه هذا أمر متشتت يجمعه الله من بعد - قال - والشمس أبوه والقمر أمه \" تفرد به الحكم بن ظهير الفزاري وقد ضعفه الأئمة وتركه الأكثرون وقال الجوزجاني ساقط وهو صاحب حديث حسن ثم ذكر الحديث المروي عن جابر أن يهوديا سأل النبي صلي الله عليه وسلم عن الكواكب التي رآها يوسف ما أسماؤها وأنه أجابه ثم قال تفرد به الحكم بن ظهير وقد ضعفه الأربعة."
    },
    {
      "ayah": 40,
      "surah": 12,
      "text": "إن الحكم إلا لله أمر ألا تعبدوا إلا إياه ذلك الدين القيم ولكن أكثر الناس لا يعلمون ثم بين لهما أن التي يعبدونها ويسمونها آلهة إنما هى جعل منهم وتسمية من تلقاء أنفسهم تلقاها خلفهم عن سلفهم وليس له ذلك مسند من عند الله ولهذا قال \" ما أنزل الله بها من سلطان \" أي حجة ولا برهان ثم أخرهم أن الحكم والتصرف والمشيئة والملك كله لله وقد أمر عباده قاطبة أن لا يعبدوا إلا إياه ثم قال تعالى \" ذلك الدين القيم \" أي هذا الذي أدعوكم إليه من توحيد الله وإخلاص العمل له هو الدين المستقيم الذي أمر الله به وأنزل به الحجة والبرهان الذي يحبه ويرضاه \" ولكن أكثر الناس لا يعلمون \" أي فلهذا كان أكثرهم مشركين \" وما أكثر الناس ولو حرصت بمؤمنين \" وقد قال ابن جريج: إنما عدل بهم يوسف عن تعبير الرؤيا إلى هذا لأنه عرف أنها ضارة لأحدهما فأحب أن يشغلهما بغير ذلك لئلا يعاودوه فيها فعاودوه فأعاد عليهم الموعظة وفي هذا الذي قاله نظر لأنه قد وعدهما أو بتعبيرها ولكن جعل سؤالهما له على وجه التعظيم والاحترام وصلة وسببا إلى دمائهما إلى التوحيد والإسلام لما رأى في سجيتهما من قبول الخير والإقبال عليه والإنصات إليه ولهذا لما فرغ من دعوتهما شرع في تعبير رؤياهما من غير تكرار سؤال."
    },
    {
      "ayah": 41,
      "surah": 12,
      "text": "\" يقول لهما \" يا صاحبي السجن أما أحدكما فيسقي ربه خمرا \" وهو الذي رأى أنه يعصر خمرا ولكنه لم يعينه لئلا يحزن ذاك ولهذا أبهمه في قوله \" وأما الآخر فيصلب فتأكل الطير من رأسه \" وهو في نفس الأمر الذي رأى أنه يحمل فوق رأسه خبزا ثم أعلمهما أن هذا قد فرغ منه وهو واقع لا محالة لأن الرؤيا على رجل طائر ما لم تعبر فإذا عبرت وقعت وقال الثوري عن عمارة بن القعقاع عن إبراهيم بن عبد الله قال: لما قالا ما قالا وأخبرهما قالا ما رأينا شيئا فقال \" قضي الأمر الذي فيه تستفتيان \" ورواه محمد بن فضيل عن عبارة عن إبراهيم عن علقمة عن ابن مسعود به وكذا فسره مجاهد وعبد الرحمن بن زيد بن أسلم وغيرهم وحاصله أن من تحلم بباطل وفسره فإنه يلزم بتأويله والله تعالى أعلم وقد ورد في الحديث الشريف الذي رواه الإمام أحمد عن معاوية بن حيدة عن النبي صلي الله عليه وسلم قال الرؤيا على رجل طائر ما لم تعبر فإذا عبرت وقعت وفي مسند أبي يعلى من طريق يزيد الرقاشي عن أنس مرفوعا الرؤيا لأول عابر."
    },
    {
      "ayah": 42,
      "surah": 12,
      "text": "ولما ظن يوسف عليه السلام أن الساقي ناج قال له يوسف خفية عن الآخر والله أعلم لئلا يشعره أنه المصلوب قال له \" اذكرني عند ربك \" يقول اذكر قصتي عند ربك وهو الملك فنسي ذلك الموصى أن يذكر مولاه الملك بذلك وكان من جملة مكايد الشيطان لئلا يطلع في الله من السجن هذا هو الصواب أن الضمير في قوله \" فأنساه الشيطان ذكر ربه \" عائد على الناجي كما قاله مجاهد ومحمد بن إسحاق وغير واحد ويقال إن الضمير عائد على يوسف عليه السلام رواه ابن جرير عن ابن عباس ومجاهد أيضا وعكرمة وغيرهم وأسند ابن جرير ههنا حديث فقال: حدثنا ابن وكيع حدثنا عمرو بن محمد عن إبراهيم بن يزيد عن عمرو بن دينار عن عكرمة عن ابن عباس مرفوعا قال: قال النبي صلي الله عليه وسلم لو لم يقل يعني يوسف الكلمة التي قال ما لبث في السجن طول ما لبث حيث يبتغي الفرج من عند غير الله وهذا الحديث ضعيف جدا لأن سفيان بن وكيع ضعيف وإبراهيم بن يزيد هو الجوزي أضعف منه أيضا وقد روي عن الحسن وقتادة مرسلا عن كل منهما وهذه المرسلات ههنا لا تقبل لو قبل المرسل من حيث هو في غير هذا الموطن والله أعلم وأما البضع فقال مجاهد وقتادة هو ما بين الثلاث إلى التسع وقال وهب بن منبه مكث أيوب في البلاء سبعا ويوسف في السجن سبعا وعذب بختنصر سبعا وقال الضحاك عن ابن عباس رضي الله عنهما \" فلبث في السجن بضع سنين \" قال ثنتا عشرة سنة وقال الضحاك أربعة عشرة سنة."
    },
    {
      "ayah": 43,
      "surah": 12,
      "text": "هذه الرؤيا من ملك مصر مما قدر الله تعالى أنها كانت سببا لخروج يوسف عليه السلام من السجن معززا مكرما وذلك أن الملك رأى هذه الرؤيا فهالته وتعجب من أمرها وما يكون تفسيرها فجمع الكهنة والحادة وكبار دولته وأمراءه فقص عليهم ما رأى وسألهم عن تأويلها فلم يعرفوا ذلك واعتذروا إليه بأنها \" أضغاث أحلام \" أي أخلاط أحلام اقتضته رؤياك هذه \" وما نحن بتأويل الأحلام بعالمين \" أي لو كانت رؤيا صحيحة من أخلاط لما كان لنا معرفة بتأويلها وهو تعبيرها فعند ذلك تذكر الذي نجا من ذينك الفتيين اللذين كانا في السجن مع يوسف وكان الشيطان قد أنساه ما وصاه به يوسف عليه السلام ذكر أمره للملك فعند ذلك تذكر بعد أمة أي مدة وقرأ بعضهم بعد أمة أي بعد نسيان فقال لهم أي للملك والذين جمعهم."
    },
    {
      "ayah": 44,
      "surah": 12,
      "text": "هذه الرؤيا من ملك مصر مما قدر الله تعالى أنها كانت سببا لخروج يوسف عليه السلام من السجن معززا مكرما وذلك أن الملك رأى هذه الرؤيا فهالته وتعجب من أمرها وما يكون تفسيرها فجمع الكهنة والحادة وكبار دولته وأمراءه فقص عليهم ما رأى وسألهم عن تأويلها فلم يعرفوا ذلك واعتذروا إليه بأنها \" أضغاث أحلام \" أي أخلاط أحلام اقتضته رؤياك هذه \" وما نحن بتأويل الأحلام بعالمين \" أي لو كانت رؤيا صحيحة من أخلاط لما كان لنا معرفة بتأويلها وهو تعبيرها فعند ذلك تذكر الذي نجا من ذينك الفتيين اللذين كانا في السجن مع يوسف وكان الشيطان قد أنساه ما وصاه به يوسف عليه السلام ذكر أمره للملك فعند ذلك تذكر بعد أمة أي مدة وقرأ بعضهم بعد أمة أي بعد نسيان فقال لهم أي للملك والذين جمعهم."
    },
    {
      "ayah": 45,
      "surah": 12,
      "text": "لذلك \" أنا أنبئكم بتأويله \" أي بتأويل هذا المنام \" فارسلون أي فابعثون إلى يوسف الصديق إلى السجن ومعنى الكلام فبعثوه فجاء."
    },
    {
      "ayah": 46,
      "surah": 12,
      "text": "فقال \" يوسف أيها الصديق أفتنا \" وذكر المنام الذي رآه الملك فعند ذلك ذكر له يوسف عليه السلام تعبيرها من غير تعنيف للفتى في نسيانه ما وصاه به ومن غير اشتراط للخروج قبل ذلك."
    },
    {
      "ayah": 47,
      "surah": 12,
      "text": "بل قال \" تزرعون سبع سنين دأبا \" أي يأتيكم الخصب والمطر سبع سنين متواليات ففسر البقر بالسنين لأنها تثير الأرض التي تشتغل منها الثمرات والزروع وهن السنبلات الخضر ثم أرشدهم إلى ما يعتدونه في تلك السنين فقال \" فما حصدتم فذروه في سنبلة إلا قليلا مما تأكلون \" أى مهما استغللتم في هذه السبع السنين الخصب فادخروه في سنبله ليكون أبقى له وأبعد عن إسراع الفساد إليه إلا المقدار الذي تأكلونه وليكن قليلا قليلا لا تسرفوا فيه لتنتفعوا في السبع الشداد وهن السبع السنين المحل التي تعقب هذه السبع المتواليات وهن البقرات العجاف اللاتي تأكل السمان لأن سني الجدب يؤكل فيها ما جمعوه في سني الخصب وهن السنبلات اليابسات وأخبرهم أنهن لا ينبتن شيئا وما بذروه فلا يرجعون منه إلى شيء."
    },
    {
      "ayah": 48,
      "surah": 12,
      "text": "ولهذا قال \" يأكلن ما قدمتم لهن إلا قليلا مما تحصنون \" ثم بشرهم بعد الجدب العام المتوالي بأنه يعقبهم بعد ذلك عام فيه يغاث الناس أي يأتيهم الغيث وهو المطر وتغل البلاد ويعصر الناس ما كانوا يعصرون على عادتهم من زيت ونحوه وسكر ونحوه حتى قال بعضهم: يدخل فيه حلب اللبن أيضا قال علي بن أبي طلحه عن ابن عباس \" وفيه يعصرون \" يحلبون."
    },
    {
      "ayah": 49,
      "surah": 12,
      "text": "ولهذا قال \" يأكلن ما قدمتم لهن إلا قليلا مما تحصنون \" ثم بشرهم بعد الجدب العام المتوالي بأنه يعقبهم بعد ذلك عام فيه يغاث الناس أي يأتيهم الغيث وهو المطر وتغل البلاد ويعصر الناس ما كانوا يعصرون على عادتهم من زيت ونحوه وسكر ونحوه حتى قال بعضهم: يدخل فيه حلب اللبن أيضا قال علي بن أبي طلحه عن ابن عباس \" وفيه يعصرون \" يحلبون."
    },
    {
      "ayah": 5,
      "surah": 12,
      "text": "يقول تعالى مخبرا عن قول يعقوب لابنه يوسف حين قص عليه ما رأى من هذه الرؤيا التي تعبيرها خضوع إخوته له وتعظيمهم إياه تعظيما زائدا بحيث يخوزن له ساجدين إجلالا واحتراما لا كراما فخشي يعقوب عليه السلام أن يحدث بهذا المنام أحدا من إخوته فيحسدونه على ذلك فيبغون له الغوائل حسدا منهم له ولهذا قال له \" لا تقصص رؤياك على إخوتك فيكيدوا لك كيدا \" أي يحتالوا لك حيلة يردونك فيهـا ولهذا ثبتت السنة عن رسول الله صلي الله عليه وسلم قال \" إذا رأى أحدكم ما يحب فليحدت به وإذا رأى ما يكره فليتحول إلى جنبه الأخر وليتفل عن يساره ثلاثا وليستعذ بالله من شرها ولا يحدث بها أحدأ فإنها لن تضره \" ْ وفي الحديث الآخر الذي رواه الإمام أحمد وبعض أهل السنن من رواية معاوية بن حيدة القشيري أنه قال: قال رسول الله صلي الله عليه وسلم \" الرؤيا على رجل طائر ما لم تعبر فإذا عبرت وقعت \"ومن هذا يؤخذ الأمر بكتمان النعمة حتى توجد وتظهر كما ورد في حديث \" استعينوا على قضاء الحوائج بكتمانها فإن كل ذي نعمة محسود \"."
    },
    {
      "ayah": 50,
      "surah": 12,
      "text": "يقول تعالى إخبارا عن الملك لما رجعوا إليه بتعبير رؤياه التي كان رآها بما أعجبه وأيقنه فعرف فضل يوسف عليه السلام وعلمه وحسن اطلاعه على رؤياه وحسن أخلافه على من ببلده من رعاياه فقال \" ائتوني به \" أي أخرجوه من السجن وأحضروه فلما جاءه الرسول بذلك امتنع من الخروج حتى يتحقق الملك ورعيته براءة ساحته ونزاهة عرضه مما نسب إليه من جهة امرأة العزيز وأن هذا السجن لم يكن على أمر يقتضيه بل كان ظلما وعدوانا فقال ارجع إلى ربك \" الآية وقد وردت السنة بمدحه على ذلك والتنبيه على فضله وشرفه وعلو قدره وصبره صلوات الله وسلامه عليه ففي المسند والصحيحين من حديث الزهري عن سعيد وأبي سلمة عن أبي هريرة رضي الله عنه قال: قال رسول الله صلي الله عليه وسلم نحن أحق بالشك من إبراهيم إذ قال \" رب أرنى كيف تحي الموتى \" الأية ويرحم الله لوطا لقد كان يأوي إلى ركن شديد ولو لبثت في السجن ما لبث يوسف لأجبت الداعي وفي لفظ لأحمد: حدثنا عفان حدثنا حماد بن سلمة حدثنا محمد بن عمرو عن أبي سلمة عن أبي هريرة عن النبي صلي الله عليه وسلم في قوله \" فاسأله ما بال النسوة اللائي قطعن أيديهن إن ربي بكيدهن عليم \" فقال رسول الله صلي الله عليه وسلم لو كنت لأسرعت الإجابة وما ابتغيت العذر وقال عبد الرزاق: أخبرنا ابن عيينة عن عمرو بن دينار عن عكرمة قال: قال رسول الله صلي الله عليه وسلم لقد عجبت من يوسف وصبره وكرمه والله يغفر له حين سئل عن البقرات العجاف والسمان ولو كنت مكانه ما أجبتهم حتى أشترط أن يخرجوني ولقد عجبت من يوسف وصبره وكرمه والله يغفر له حين أتاه الرسول ولو كنت مكانه لبادرتهم الباب ولكنه أراد أن يكون له العذر هذا حديث مرسل."
    },
    {
      "ayah": 51,
      "surah": 12,
      "text": "وقوله تعالى \"قال ما خطبكن إذ راودتن يوسف عن نفسه\" إخبار عن الملك حين جمع النسوة اللاتي قطعن أيديهن عند امرأة العزيز فقال مخاطبا لهن كلهن وهو يريد امرأة وزيره وهو العزيز قال الملك للنسوة اللاتي قطعن أيدهن \" ما خطبكن \" أي شأنكن وخبرنكن \" إذ راودتن يوسف عن نفسه \" يعني يوم الضيافة \" قلن حاش لله ما علمنا عليه من سوء \" أي قالت النسوة جوابا للملك حاش لله أن يكون يوسف متهما والله ما علمنا علية من سوء فعند ذلك \" قالت امرأة العزيز الآن حصحص الحق \" قال ابن عباس ومجاهد وغير واحد: تقول الآن تبين الحق وظهر وظهر وبرز \" أنا راودته عن نفسه وإنه لمن الصادقين \" أي في قوله \" هي راودتني عن نفسي \"."
    },
    {
      "ayah": 52,
      "surah": 12,
      "text": "\" ذلك ليعلم أني لم أخنه بالغيب \" تقول إنما اعترفت بهذا على نفسي ليعلم زوجي أني لم أخنه بالغيب في نفس الأمر ولا وقع المحذور الأكبر وإنما راودت هذا الشاب مراودة فامتنع فلهذا اعترفت ليعلم أني بريئة \" وأن الله لا يهدي كيد الخائنين وما أبرئ نفسي \" تقول المرأة ولست أبرئ نفسي فإن النفس تتحدث وتتمنى ولهذا راودته لأن \" النفس لأمارة بالسوء إلا ما رحم ربي \" أي إلا من عصمه الله تعالى \" إن ربي غفور رحيم \" وهذا القول هو الأشهر والأليق والأنسب بسياق القصة ومعاني الكلام وقد حكاه الماوردي في تفسيره وانتدب لنصره الإمام أبو العباس رحمه الله فأفرده بتصنيف على حدة وقد قيل إن ذلك من كلام يوسف عليه السلام يقول \" قال ليعلم أني لم أخنه في زوجته \" بالغيب \" الآيتين أي إنما رددت الرسول ليعلم الملك براءتي وليعلم العزيز \" أني لم أخنه \" في زوجته \" بالغيب وأن الله لا يهدي كيد الخائنين \" الآية وهذا القول هو الذي لم يحك ابن جرير حاتم سواه قال ابن جرير: حدثنا أبو كريب حدثنا وكيع عن إسرائيل عن سماك عن عكرمة عن ابن ابن عباس قال لما جمع الملك النسوة فسألهن هل راودتن يوسف عن نفسه؟ \" قلن حاش لله ما علمنا عليه من امرأة العزيز الآن حصحص الحق \" الآية قال يوسف \" ذلك ليعلم أنى لم أخنه بالغيب \" فقال له جبريل عليه السلام: ولا يوم هممت بما هممت به ؟ فقال \" وما أبرئ نفسي \" الآية وهكذا قال مجاهد وسعيد بن جبير وعكرمة وابن أبى الهذيل والضحاك والحسن وقتادة والسدي والقول الأول أقوى وأظهر لأن سياق الكلام كله من كلام امرأة العزيز بحضرة الملك ولم يكن يوسف عليه السلام عندهم بل بعد ذلك أحضره الملك."
    },
    {
      "ayah": 53,
      "surah": 12,
      "text": "\" ذلك ليعلم أني لم أخنه بالغيب \" تقول إنما اعترفت بهذا على نفسي ليعلم زوجي أني لم أخنه بالغيب في نفس الأمر ولا وقع المحذور الأكبر وإنما راودت هذا الشاب مراودة فامتنع فلهذا اعترفت ليعلم أني بريئة \" وأن الله لا يهدي كيد الخائنين وما أبرئ نفسي \" تقول المرأة ولست أبرئ نفسي فإن النفس تتحدث وتتمنى ولهذا راودته لأن \" النفس لأمارة بالسوء إلا ما رحم ربي \" أي إلا من عصمه الله تعالى \" إن ربي غفور رحيم \" وهذا القول هو الأشهر والأليق والأنسب بسياق القصة ومعاني الكلام وقد حكاه الماوردي في تفسيره وانتدب لنصره الإمام أبو العباس رحمه الله فأفرده بتصنيف على حدة وقد قيل إن ذلك من كلام يوسف عليه السلام يقول \" قال ليعلم أني لم أخنه في زوجته \" بالغيب \" الآيتين أي إنما رددت الرسول ليعلم الملك براءتي وليعلم العزيز \" أني لم أخنه \" في زوجته \" بالغيب وأن الله لا يهدي كيد الخائنين \" الآية وهذا القول هو الذي لم يحك ابن جرير حاتم سواه قال ابن جرير: حدثنا أبو كريب حدثنا وكيع عن إسرائيل عن سماك عن عكرمة عن ابن ابن عباس قال لما جمع الملك النسوة فسألهن هل راودتن يوسف عن نفسه؟ \" قلن حاش لله ما علمنا عليه من امرأة العزيز الآن حصحص الحق \" الآية قال يوسف \" ذلك ليعلم أنى لم أخنه بالغيب \" فقال له جبريل عليه السلام: ولا يوم هممت بما هممت به ؟ فقال \" وما أبرئ نفسي \" الآية وهكذا قال مجاهد وسعيد بن جبير وعكرمة وابن أبى الهذيل والضحاك والحسن وقتادة والسدي والقول الأول أقوى وأظهر لأن سياق الكلام كله من كلام امرأة العزيز بحضرة الملك ولم يكن يوسف عليه السلام عندهم بل بعد ذلك أحضره الملك."
    },
    {
      "ayah": 54,
      "surah": 12,
      "text": "يقول تعالى إخبارا عن الملك حين تحقق براءة يوسف عليه السلام ونزاهة عرضه مما نسب إليه قال \" ائتوني به أستخلصه لنفسي \" أي أجعله من خاصتي وأهل مشورتي \" فلما كلمه \" أي خاطبه الملك وعرفه رأى فضله وبراعته وعلم ما هو عليه من خلق وخلق وكمال قال له الملك \" إن اليوم ليدينا مكين أمين \" أي إنك عندنا قد بقيت ذا مكانه وأمانه."
    },
    {
      "ayah": 55,
      "surah": 12,
      "text": "فقال يوسف عليه السلام \" اجعلني على خزائن الأرض إني حفيظ عليم \" مدح نفسه ويجوز للرجل ذلك إذا جهل أمر للحاجة وذكر أنه \" حفيظ \" أي خازن أمين \" عليم \" ذو علم وبصيرة بما يتولاه وقال شيبة بن نعامة: حفيظ لما استودعتني عليم بسني الجدب رواه ابن أبي حاتم وسأل العمل لعلمه بقدرته عليه ولما فيه من المصالح للناس وإنما سأله أن يجعله على خزائن الأرض وهي الأهرام التي يجمع فيها الغلات لما يستقبلونه من السنين التي أخبرهم بشأنها فيصرف لهم على الوجه الأحوط والأصلح والأرشد فأجيب إلى ذلك رغبة فيه وتكرمة له."
    },
    {
      "ayah": 56,
      "surah": 12,
      "text": "أي أرض مصر \" يتبوأ منها حيث يشاء \" قال السدي وعبد الرحمن بن زيد بن أسلم: يتصرف فيها كيف يشاء وقال ابن جرير: يتخذ منها منزلا حيث يشاء بعد الضيق والحبس والإسار \" نصيب برحمتنا من نشاء ولا نضيع أجر المحسنين \" أي وما أضعنا صبر يوسف على أذى إخوته وصبره على الحبس بسبب امرأة العزيز فلهذا أعقبه الله عز وجل السلام النصر والتأييد \" ولا نضيع أجر المحسنين ولأجر الآخرة خير للذين أمنوا وكانوا يتقون \" يخبر تعالى أن ما ادخره الله تعالى لنبيه يوسف عليه السلام في الدار الآخرة أعظم وأكثر وأجل مما خوله من التصرف والنفوذ في الدنيا كقوله في حق سليمان عليه السلام \" هذا عطائنا فامنن أو أمسك بغير حساب وإن له عندنا لزلفى وحسن مآب \" والغرض أن يوسف عليه السلام ولاه ملك مصر الريان بن الوليد الوزارة في بلاد مصر مكان الذي اشتراه من مصر زوج التي راودته وأسلم الملك على يدي يوسف عليه السلام قال مجاهد وقال محمد بن إسحاق: لما قال يوسف للملك \" اجعلني على خزائن الأرض إني حفيظ عليم \" قال الملك قد فعلت فولاه فيما ذكروا عمل اطفير وعزل اطفير عما كان عليه يقول الله عز وجل \" وكذلك مكنا ليوسف في الأرض يتبوأ منها حيث يشاء نصيب برحمتنا من نشاء ولا نضيع أجر المحسنين \" قال فذكر لي والله أعلم أن اطفير هلك في تلك الليالي وأن الملك الريان بن الوليد زوج يوسف امرأه اطفير راعيل وأنها حين دخلت عليه قال لها: أليس هذا خيرا مما كنت تردين؟ قال فيزعمون أنها قالت أيها الصديق لا تلمني فإني كنت امرأة كما نرى حسناء جميلة ناعمة في ملك وديا وكان صاحبي لا يأتي النساء وكنت كما جعلك الله في حسنك وهيئتك على ما رأيت فيزعمون أنه وجدها عذراء فأصابها فولدت له رجلين أفرايثيم بن يوسف وميشا بن يوسف وولد لأفرايثيم نون والد يوشع بن نون ورحمة امرأه أيوب عليه السلام وقال الفضيل بن عياض وقفت امرأة العزيز على ظهر الطريق حتى مر يوسف فقالت: الحمد لله الذي جعل العبيد ملوكا بطاعته والملوك عبيدا بمعصيته."
    },
    {
      "ayah": 57,
      "surah": 12,
      "text": "لآخرة خير للذين أمنوا وكانوا يتقون \" يخبر تعالى أن ما ادخره الله تعالى لنبيه يوسف عليه السلام في الدار الآخرة أعظم وأكثر وأجل مما خوله من التصرف والنفوذ في الدنيا كقوله في حق سليمان عليه السلام \" هذا عطائنا فامنن أو أمسك بغير حساب وإن له عندنا لزلفى وحسن مآب \" والغرض أن يوسف عليه السلام ولاه ملك مصر الريان بن الوليد الوزارة في بلاد مصر مكان الذي اشتراه من مصر زوج التي راودته وأسلم الملك على يدي يوسف عليه السلام قال مجاهد وقال محمد بن إسحاق: لما قال يوسف للملك \" اجعلني على خزائن الأرض إني حفيظ عليم \" قال الملك قد فعلت فولاه فيما ذكروا عمل اطفير وعزل اطفير عما كان عليه يقول الله عز وجل \" وكذلك مكنا ليوسف في الأرض يتبوأ منها حيث يشاء نصيب برحمتنا من نشاء ولا نضيع أجر المحسنين \" قال فذكر لي والله أعلم أن اطفير هلك في تلك الليالي وأن الملك الريان بن الوليد زوج يوسف امرأه اطفير راعيل وأنها حين دخلت عليه قال لها: أليس هذا خيرا مما كنت تردين؟ قال فيزعمون أنها قالت أيها الصديق لا تلمني فإني كنت امرأة كما نرى حسناء جميلة ناعمة في ملك وديا وكان صاحبي لا يأتي النساء وكنت كما جعلك الله في حسنك وهيئتك على ما رأيت فيزعمون أنه وجدها عذراء فأصابها فولدت له رجلين أفرايثيم بن يوسف وميشا بن يوسف وولد لأفرايثيم نون والد يوشع بن نون ورحمة امرأه أيوب عليه السلام وقال الفضيل بن عياض وقفت امرأة العزيز على ظهر الطريق حتى مر يوسف فقالت: الحمد لله الذي جعل العبيد ملوكا بطاعته والملوك عبيدا بمعصيته."
    },
    {
      "ayah": 58,
      "surah": 12,
      "text": "ذكر السدى ومحمد بن إسحاق وغيرهما من المفسرين أن السبب الذي أقدم إخوة يوسف بلاد مصر أن يوسف عليه السلام لما باشر الوزارة بمصر ومضت السبع سنين المخصبة ثم تلتها السبع السنين المجدبة وعم القحط بلاد مصر بكمالها ووصل إلى بلاد كنعان وهي التي فيها يعقوب عليه السلام وأولاده وحينئذ احتاط يوسف عليه السلام للناس في غلامهم وجمعها أحسن جمع فحصل من ذلك مبلغ عظيم وهدايا متعددة هائلة وورد عليه الناس من سائر الأقاليم والمعاملات يمتارون لأنفسهم وعيالهم فكان لا يعطي الرجل أكثر من حمل بعير في السنة وكان عليه السلام لا يشبع نفسه ولا يأكل هو والملك وجنودهما إلا أكلة واحدة في وسط النهار حتى يتكفأ الناس بما في أيديهم مدة السبع سنين وكان رحمة من الله على أهل مصر وما ذكره بعض المفسرين من أنه باعهم في السنة الأولى بالأموال وفي الثانية بالمتاع وفي الثالثة بكذا وفي الرابعة بكذا حتى باعهم بأنفسهم وأولادهم بعد ما تملك عليهم جميع ما يملكون ثم أعتقهم ورد عليهم أموالهم كلها الله أعلم بصحة ذلك وهو من الإسرائيليات التي لا تصدق ولا تكذب والغرض أنه كان في جملة من ورد للميرة إخوة يوسف عن أمر أبيهم لهم في ذلك فإنه بلغهم أن عزيز مصر يعطي الناس الطعام بثمنه فأخذوا معهم بضاعة يعتاضون بها طعاما وركبوا عشرة نفر واحتبس يعقوب عليه السلام عنده ابنه بنيامين شقيق يوسف عليه السلام وكان أحب ولده إليه بعد يوسف فلما دخلوا على يوسف وهو جالس في أبهته ورياسته وسيادته عرفهم حين نظر إليهم وهم له منكرون أي لا يعرفونه لأنهم فارقوه وهو صغير حدث وباعوه للسيارة ولم يدروا أين يذهبون به ولا كانوا يستشعرون في أنفسهم أن يصير إلى ما صار إليه فلهذا لم يعرفوه وأما هو فعرفهم فذكر السدي وغيره أنه شرع يخاطبهم فقال لهم كالمنكر عليهم ما أقدمكم بلادي؟ فقالوا أيها العزيز إنا قدمنا للميرة قال فلعلكم عيون؟ قالوا معاذ الله قال فمن أين أنتم؟ قالوا كنعان وأبونا يعقوب نبي الله قال وله أولاد غيركم؟ قالوا نعم كنا اثني عشر فذهب أصغرنا هلك في البئر أحبنا إلى أبيه وبقي شقيقه فاحتبسه أبوه ليتسلى به عنه فأمر بإنزالهم وإكرامهم."
    },
    {
      "ayah": 59,
      "surah": 12,
      "text": "\" ولما جهزهم بجهازهم \" أى أوفى لهم كيلهم وحمل لهم أحمالهم قال ائتوني بأخيكم هذا الذي ذكرتم لأعلم صدقكم فيما ذكرتم \" ألا ترون أني أوفي الكيل وأنا خير المنزلين \" يرغبهم في الرجوع إليه ثم رهبهم."
    },
    {
      "ayah": 6,
      "surah": 12,
      "text": "ويقول تعالى مخبرا عن قول يعقوب لولده يوسف إنه كما اختارك ربك وأراك هذه الكواكب مع الشمس والقمر ساجدة لك \" كذلك يجتبيك ربك \" أي يختارك ومصطفيك لنبوته \" ويعلمك من تأويل الأحاديث \" قال مجاهد وغير واحد يعني تعبير الرؤيا \"ويتم نعمته عليك \" أي بإرسالك والإيحاء إليك. ولهـذا قال \" كما أتمها على أبويك من قبل إبراهيم \" وهو الخليل \" وإسحاق \" ولده وهو الذبيح في قول وليس بالرجيح \" إن ربك عليم حكيم\" أي هو أعلم حيث يجعل رسالته كما قال في الآية الأخرى."
    },
    {
      "ayah": 60,
      "surah": 12,
      "text": "فقال \" فإن لم تأتوني به فلا كيل لكم عندي \" الآية أي إن لم تقدموا به معكم في المرة الثانية فليس لكم عندي ميرة \" ولا تقربون قالوا سنراود عنه أباه وإنا لفاعلون \" أي سنحرص على مجيئه إليك بكيل ممكن ولا نبقي مجهودا لتعلم صدقنا فيما قلناه السدي أنه أخذ منهم رهائن حتى يقدموا به معهم وفي هذا نظر لأنه أحسن إليهم ورغبهم كثيرا وهذا على رجوعهم."
    },
    {
      "ayah": 61,
      "surah": 12,
      "text": "فقال \" فإن لم تأتوني به فلا كيل لكم عندي \" الآية أي إن لم تقدموا به معكم في المرة الثانية فليس لكم عندي ميرة \" ولا تقربون قالوا سنراود عنه أباه وإنا لفاعلون \" أي سنحرص على مجيئه إليك بكيل ممكن ولا نبقي مجهودا لتعلم صدقنا فيما قلناه السدي أنه أخذ منهم رهائن حتى يقدموا به معهم وفي هذا نظر لأنه أحسن إليهم ورغبهم كثيرا وهذا على رجوعهم."
    },
    {
      "ayah": 62,
      "surah": 12,
      "text": "وقال لفتيانه \" أي غلمانه \" اجعلوا بضاعتهم \" أي التي قدموا بها ليمتاروا عوضا عنها \" في رحالهم \" أي في أمتعتهم من حيث لا يشعرون \" لعلهم يرجعون \" بها قيل خشي يوسف عليه السلام أن لا يكون عندهم بضاعة أخرى يرجعون للميرة بها وقيل تذمم أن يأخذ من أبيه وإخوته عوضا عن الطعام وقيل أراد أن يردهم إذا وجدوها في متاعهم تحرجا وتورعا لأنه يعلم ذلك منهم والله أعلم."
    },
    {
      "ayah": 63,
      "surah": 12,
      "text": "يقول تعالى عنهم إنهم رجعوا إلى أبيهم \" قالوا يا أبانا منع منا الكيل \" يعنون بعد هذه المرة إن لم ترسل معنا أخانا بنيامين فأرسله معنا نكتل وإنا له لحافظون قرأ بعضهم بالياء أي يكتل هو \" وإنا له لحافظون \" أي لا تخف عليه فإنه سيرجع إليك وهذا كما قالوا له في يوسف \" أرسله معنا غدا يرتع ويلعب وإنا له لحافظون\"."
    },
    {
      "ayah": 64,
      "surah": 12,
      "text": "ولهذا قال لهم \" هل آمنكم عليه إلا كما أمنتكم على أخيه من قبل \" أي هل أنتم صانعون به إلا كما صنعتم بأخيه من قبل تغيبونه عني وتحولون بيني وبينه؟ \" فالله خير حافظا \" وقرأ بعضهم حفظا \" وهو أرحم الراحمين \" أي هو أرحم الراحمين بى وسيرحم كبري وضعفي ووجدي بولدي وأرجو من الله أن يرده علي ويجمع شملي به إنه أرحم الراحمين."
    },
    {
      "ayah": 65,
      "surah": 12,
      "text": "يقول تعالى ولما فتح إخوة يوسف متاعهم وجدوا بضاعتهم ردت إليهم وهي التي كان أمر يوسف فتيانه بوضعها فى رحالهم فلما وجدوها فى متاعهم \" قالوا يا أبانا ما نبغي \" أي ماذا نريد \" هذه بضاعتنا ردت إلينا \" كما قال قتادة: ما نبغي وراء هذا إن بضاعتنا ردت إلينا وقد أوفى لنا الكيل \" ونمير أهلنا \" أي إذا أرسلت أخانا معنا نأتي بالميرة إلى أهلنا \" ونحفظ أخانا ونزداد كيل بعير \" وذلك أن يوسف عليه السلام كان يعطى كل رجل حمل بعير وقال مجاهد حمل حمار وقد يسمى في بعض اللغات بعيرا: كذا قال \" ذلك كيل يسير \" هذا من تمام الكلام وتحسينه أي أن هذا يسير في مقابلة أخذ أخيهم ما يعدل هذا."
    },
    {
      "ayah": 66,
      "surah": 12,
      "text": "أي تحلفون بالعهود والمواثيق \" لتأتنني به إلا أن يحاط بكم \" إلا أن تغلبوا كلكم ولا تقدرون على تخليصه \" فلما آتوه موثقهم \" أكده عليهم فقال \" الله على ما نقول وكيل \" قال ابن إسحاق وإنما فعل ذلك لأنه لم يجد بدا من لأجل الميرة التي لاغنى لهم عنها فبعثه معهم."
    },
    {
      "ayah": 67,
      "surah": 12,
      "text": "يقول تعالى إخبارا عن يعقوب عليه السلام إنه أمر بنيه لما جهزهم مع أخيهم بنيامين إلى مصر أن لا يدخلوا كلهم من باب واحد وليدخلوا من أبواب متفرقة فإنه كما قال ابن عباس ومحمد بن كعب ومجاهد والضحاك وقتادة والسدي وغير واحد إنه خشي عليهم العين وذلك أنهم كانوا ذوي جمال وهيئة حسنة ومنظر وبهاء فخشى عليهم أن يصيبهم الناس بعيونهم فإن العين حق تستنزل الفارس عن فرسه وروى ابن أبي حاتم عن إبراهيم النخعي في الآية في قوله \" وادخلوا من أبواب متفرقة \" قال علم أنه سيلقى إخوته في بعض تلك الأبواب."
    },
    {
      "ayah": 68,
      "surah": 12,
      "text": "يعقوب قضاها وإنه لذو علم لما علمنه ولكن أكثر الناس لا يعلمون وقوله \" وما أغني عنكم من الله من شيء \" أي أن هذا الاحتراز لا يرد قدر الله وقضاءه فإن الله إذا أراد شيئا لا يخالف ولا يمانع \" إن الحكم إلا لله عليه توكلت وعليه فليتوكل المتوكلون ولما دخلوا من حيث أمرهم أبوهم ما كان يغني عنهم من الله من شيء إلا حاجة في نفس يعقوب قضاها \" قالوا هي دفع إصابة العين لهم \" وإنا لذو علم لما علمناه \" قال قتادة والثوري لذو علم بعلمه وقال ابن جرير لذو علم لتعليمنا إياه \" ولكن أكثر الناس لا يعلمون \"."
    },
    {
      "ayah": 69,
      "surah": 12,
      "text": "يخبر تعالى عن إخوة يوسف لما قدموا على يوسف ومعهم أخوه شقيقه بنيامين وأدخلهم دار كرامته ومنزل ضيافته وأقاض عليهم الصلة والألطاف والإحسان واختلى بأخيه فأطلعه على شأنه وما جرى له وعرفه أنه أخوه وقال له لا تبتئس أي لا تأسف على ما صنعوا بي وأمرهم بكتمان ذلك عنهم وأن لا يطلعهم على ما أطلعه عليه من أنه أخوه وتواطأ معه أنه سيحتال على أن يبقيه عنده معززا مكرما معظما."
    },
    {
      "ayah": 7,
      "surah": 12,
      "text": "يقول تعالى لقد كان في قصة يوسف وخبره مع إخوته آيات أي عبرة ومواعظ للسائلين عن ذلك المستخبرين عنه فإنه خبر عجيب يستحق أن يخر عنه \" إذ قالوا ليوسف وأخوه أحب إلى أبينا منا\" أي حلفوا فيما يظنون والله ليوسف وأخوه يعنون بنيامين وكان شقيقه لأمه \"أحب إلى أبينا منا ونحن عصبة \" أي جماعة فكيف أحب ذينك الاثنين أكثر من الجماعة \" إن أبانا لفي ضلال مبين \" يعنون في تقديمها علينا ومحبته إياهما أكثر منا. واعلم أنه لم يقم دليل على نبوة أخوه يوسف وظاهر هذا السياق يدل على خلاف ذلك ومن الناس من يزعم أنه أوحي إليهم بعد ذلك وفي هذا نظر ويحتاج مدعي ذلك إلى دليل ولم يذكروا سوى قوله تعالى \" قولوا آمنا بالله وما أنزل إلينا وما أنزل إلى إبراهيم وإسماعيل وإسحاق ويعقوب والأسباط \" وهذا فيه احتمال لأن بطون بني إسرائيل يقال لهم الأسباط كما يقال للعرب قبائل وللعجم شعوب يذكر تعالى أنه أوحى إلى الأنبياء من أسباط بني إسرائيل فذكرهم إجمالا لأنهم كثيرون ولكن كل سبط من نسل رجل من اخوة يوسف ولم يقم دليل علي أعيان هؤلاء أنهم أوحى إليهم والله أعلم."
    },
    {
      "ayah": 70,
      "surah": 12,
      "text": "لما جهزهم وحمل لهم أبعرتهم طعاما أمر بعض فتيانه أن يضع السقاية وهي إناء من فضة في قول الأكثرين وقيل من ذهب قال ابن زيد كان يشرب فيه ويكيل للناس به من عزة الطعام إذ ذاك قاله ابن عباس ومجاهد وقتادة والضحاك وعبد الرحمن بن زيد وقال شعبة عن أبي بشر عن سعيد بن جبير عن ابن عباس صواع الملك قال: كان من فضة يشربون فيه وكان مثل المكوك وكان للعباس مثله في الجاهلية فوضعها في متاع بنيامين من حيث لا يشعر أحد ثم نادى مناد بينهم \" أيتها العير إنكم لسارقون \" فالتفتوا إلى المنادي."
    },
    {
      "ayah": 71,
      "surah": 12,
      "text": "وقالوا \" ماذا تفقدون قالوا نفقد صواع الملك \" أي صاعه الذي يكيل به \" ولمن جاء به حمل بعير \" وهذا من باب الجعالة \" وأنا به زعيم \" وهذا من باب الضمان والكفالة."
    },
    {
      "ayah": 72,
      "surah": 12,
      "text": "وقالوا \" ماذا تفقدون قالوا نفقد صواع الملك \" أي صاعه الذي يكيل به \" ولمن جاء به حمل بعير \" وهذا من باب الجعالة \" وأنا به زعيم \" وهذا من باب الضمان والكفالة."
    },
    {
      "ayah": 73,
      "surah": 12,
      "text": "لما اتهمهم أولئك الفتيان بالسرقة قال لهم إخوة يوسف \" تالله لقد علمتم ما جئنا لنفسد فى الأرض وما كنا سارقين \" أي لقد تحققتم وعلمتم منذ عرفتمونا لأنهم شاهدوا منهم سيرة حسنة أنا \" ما جئنا لنفسد فى الأرض وما كنا سارقين \" أي ليست سجايانا تقتضي هذه الصفة فقال لهم الفتيان."
    },
    {
      "ayah": 74,
      "surah": 12,
      "text": "فما جزاؤه \"أي السارق إن كان فيكم\" إن كنتم كاذبين أي أي شيء يكون عقوبته إن وجدنا فيكم من أخذه؟."
    },
    { "ayah": 75, "surah": 12, "text": "وهكذا كانت شريعة إبراهيم عليه السلام أن السارق يدفع إلى المسروق منه.1" },
    {
      "ayah": 76,
      "surah": 12,
      "text": "وهذا هو الذي أراد يوسف عليه السلام ولهذا بدأ بأوعيتهم قبل وعاء أخيه أي فتشها قبله تورية \" ثم استخرجها من وعاء أخيه \" فأخذه منهم بحكم اعترافهم والتزامهم الزاما لهم بما يعتقدونه ولهذا قال تعالى \" كذلك كدنا ليوسف \" وهذا من الكيد المحبوب المراد الذي يحبه الله ويرضاه لما فيه من الحكمة والمصلحة المطلوبة وقوله \" ما كان ليأخذ أخاه في دين الملك \" أي لم يكن له أخذه في حكم ملك مصر قاله الضحاك وغيره وإنما قيض الله له أن التزم له إخوته بما التزموه وهو كان يعلم ذلك من شريعتهم ولهذا مدحهم الله تعالى فقال \" نرفع درجات من نشاء \" كما قال تعالى \" يرفع الله الذين امنوا منكم \" الآية \" وفوق كل ذي علم عليم \" قال الحسن البصري ليس عالم إلا فوقه عالم حتى ينتهي إلى الله عز وجل وكذا روى عبد الرزاق عن سفيان الثوري عن عبد الأعلى الثعلبي عن سعيد بن جبير قال كنا عند ابن عباس فحدث بحديث عجيب فتعجب رجل فقال: الحمد لله فوق كل ذي علم عليم فقال ابن عباس بئس ما قلت الله العلم فوق كل عالم وكذا روى سماك عن عكرمة عن ابن عباس \" وفوق كل ذي علم عليم \" قال يكون هذا أعلم من هذا وهذا أعلم من هذا والله فوق كل عالم وهكذا قال عكرمة وقال قتادة: وفوق كل ذي علم عليم حتى ينتهي العلم إلى الله منه بدئ وتعلمت العلماء وإليه يعود وفي قراءة عبد الله وفوق كل عالم عليم."
    },
    {
      "ayah": 77,
      "surah": 12,
      "text": "وقال إخوة يوسف لما رأوا الصواع قد أخرج من متاع بنيامين \" إن يسرق فقد سرق أخ له من قبل \" يتنصلون إلى العزيز من التشبه به ويذكرون أن هذا فعل كما فعل أخ له من قبل يعنون به يوسف عليه السلام قال سعيد بن جبير عن قتادة كان يوسف عليه السلام قد سرق صنما لجده أبي أمه فكسره وقال محمد بن إسحاق عن عبه الله بن أبي نجيح عن مجاهد قال كان أول ما دخل على يوسف من البلاء فيما بلغني أن عمته ابنة إسحاق وكانت أكبر ولد إسحاق وكانت عندها منطقة إسحاق وكانوا يتوارثونها بالكبر وكان من اختبأها ممن وليها كان له سلما لا ينازع فيه يصنع فيه ما يشاء وكان يعقوب حين ولد له يوسف قد حضنته عمته وكان لها به ولد فلم تحب أحدا حبها إياه حتى إذا ترعرع وبلغ سنوات تاقت إليه نفس يعقوب عليه السلام فأتاها فقال يا أخية سلمي إلي يوسف فوالله ما أقدر على أن يغيب عني ساعة قالت فوالله ما أنا بتاركته ثم قالت: فدعه عندي أياما أنظر إليه وأسكن عنه لعل ذلك يسليني عنه أو كما قالت فلما خرج من عندها يعقوب عمدت إلى منطقة إسحاق فحزمتها على يوسف من تحت ثيابه ثم قالت فقدت منطقة إسحاق عليه السلام فانظروا من أخذها ومن أصابها؟ فالتمست ثم قالت اكشفوا أهل البيت فكشفوهم فوجدوها مع يوسف فقالت والله إنه لي لسلم أصنع فيه ما شئت فأتاها يعقوب فأخبرته الخبر فقال لها أنت وذاك إن كان فعل ذلك فهو سلم لك ما أستطيع غير ذلك فأمسكته فما قدر عليه يعقوب حتى ماتت قال فهو الذي يقول إخوة يوسف حين صنع بأخيه ما صنع حين أخذه \" إن يسرق فقد سرق أخ له من قبل \" وقوله فأسرها يوسف في نفسه \" يعني الكلمة التي بعدها وهي قوله \" أنتم شر مكانا والله أعلم بما تصفون \" أي تذكرون قال هذا في نفسه ولم يبده لهم وهذا من باب الإضمار قبل الذكر وهو كثير كقول الشاعر: جزى بنوه أبا الغيلان عن كبر وحسن فعل كما يجزي سنمار وله شواهد كثيرة في القرآن والحديث واللغة في منثورها وأخبارها وأسعارها قال العوفي عن ابن عباس \" فأسرها يوسف في نفسه \" قال أسر في نفسه \" أنتم شر مكانا والله أعلم بما تصفون \"."
    },
    {
      "ayah": 78,
      "surah": 12,
      "text": "لما تعين أخذ بنيامين وتقرر تركه عند يوسف بمقتضى اعترافهم شرعوا يترققون له ويعطفونه عليهم \" فقالوا يا أيها العزيز إن له أبا شيخا كبيرا \" يعنون وهو يحبه حبا شديدا ويتسلى به عن ولده الذي فقده \" فخذ أحدنا مكانه \" أي بدله يكون عندك عوضا عنه \" إنا نراك من المحسنين \" أي العادلين المنصفين القابلين للخير."
    },
    {
      "ayah": 79,
      "surah": 12,
      "text": "\"قال معاذ الله أن نأخذ إلا من وجدنا متاعنا عنده\" أي كما قلتم واعترفتم \" أنا إذا لظالمون \" أي إن أخذنا بريئا بسقيم."
    },
    {
      "ayah": 8,
      "surah": 12,
      "text": "يقول تعالى لقد كان في قصة يوسف وخبره مع إخوته آيات أي عبرة ومواعظ للسائلين عن ذلك المستخبرين عنه فإنه خبر عجيب يستحق أن يخر عنه \" إذ قالوا ليوسف وأخوه أحب إلى أبينا منا\" أي حلفوا فيما يظنون والله ليوسف وأخوه يعنون بنيامين وكان شقيقه لأمه \"أحب إلى أبينا منا ونحن عصبة \" أي جماعة فكيف أحب ذينك الاثنين أكثر من الجماعة \" إن أبانا لفي ضلال مبين \" يعنون في تقديمها علينا ومحبته إياهما أكثر منا. واعلم أنه لم يقم دليل على نبوة أخوه يوسف وظاهر هذا السياق يدل على خلاف ذلك ومن الناس من يزعم أنه أوحي إليهم بعد ذلك وفي هذا نظر ويحتاج مدعي ذلك إلى دليل ولم يذكروا سوى قوله تعالى \" قولوا آمنا بالله وما أنزل إلينا وما أنزل إلى إبراهيم وإسماعيل وإسحاق ويعقوب والأسباط \" وهذا فيه احتمال لأن بطون بني إسرائيل يقال لهم الأسباط كما يقال للعرب قبائل وللعجم شعوب يذكر تعالى أنه أوحى إلى الأنبياء من أسباط بني إسرائيل فذكرهم إجمالا لأنهم كثيرون ولكن كل سبط من نسل رجل من اخوة يوسف ولم يقم دليل علي أعيان هؤلاء أنهم أوحى إليهم والله أعلم."
    },
    {
      "ayah": 80,
      "surah": 12,
      "text": "يخبر تعالى عن إخوة يوسف أنهم لما يئسوا من تخليص أخيهم بنيامين الذي قد التزموا لأبيهم برده إليه وعاهدوه على ذلك فامتنع عليهم ذلك \" خلصوا \" أي انفردوا عن الناس \" نجيا \" يتناجون فيما بينهم \" قال كبيرهم \" وهو روبيل وقيل يهوذا وهو الذي أشار عليهم بإلقائه في البئر عندما هموا بقتله قال لهم \" ألم تعلموا أن أباكم قد أخذ عليكم موثقا من الله \" لتردنه إليه فقد رأيتم كيف تعذر عليكم ذلك مع ما تقدم لكم من إضاعة يوسف عنه \" فلن أبرح الأرض \" أي لن أفارق هذه البلدة \" حتى يأذن لي أبي \" في الرجوع إليه راضيا عني \" أو يحكم الله لي \" قيل بالسيف وقيل بأن يمكنني من أخذ أخي \" وهو خير الحاكمين \"."
    },
    {
      "ayah": 81,
      "surah": 12,
      "text": "ثم أمرهم أن يخبروا أباهم بصورة ما وقع حتى يكون عذرا لهم عنده ويتنصلوا إليه ويبرؤا مما وقع بقولهم ما علمنا أن ابنك يسرق وقال عبد الرحمن بن زيد بن اسلم: ما علمنا في الغيب أنه سرق له شيئا إنما سألنا ما جزاء السارق."
    },
    {
      "ayah": 82,
      "surah": 12,
      "text": "\" واسأل القرية التي كنا فيها \" قيل المراد مصر قاله قتادة وقيل غيرها \" والعير التي أقبلنا فيها \" أي التي رافقناها عن صدقنا وأما فتنا وحفظنا وحراستنا \" وإنا لصادقون \" فيما أخبرناك به من أنه سرق وأخذوه بسرقته."
    },
    {
      "ayah": 83,
      "surah": 12,
      "text": "قال لهم كما قال لهم حين جاءوا على قميصي يوسف بدم كذب \" بل سولت لكم أنفسكم أمرا فصبر جميل \" قال محمد بن إسحاق لما جاءوا يعقوب وأخبروه بما يجرى اتهمهم فظن أنها كفعلتهم بيوسف قال \" بل سولت لكم أنفسكم أمرا فصبر جميل \" وقال بعض الناس لما كان صنيعهم هذا مرتبا على فعلهم الأول سحب حكم الأول عليه وصح قوله \" بل سولت لكم أنفسكم أمرا فصبر جميل \" ثم ترجى من الله أن يرد عليه أولاده الثلاثة يوسف وأخاه بنيامين وروبيل الذي أقام بديار مصر ينتظر أمر الله فيه إما أن يرضى عنه أبو فيأمره بالرجوع إليه وإما أن يأخذ أخاه خفية ولهذا قال \" عسى الله أن يأتيني بهم جميعا انه هو العليم \" أي العليم بحالي \" الحكيم \" في أفعاله وقضائه وقدره."
    },
    {
      "ayah": 84,
      "surah": 12,
      "text": "\" وتولى عنهم وقال يا أسفا على يوسف \" أي أعرضي عن بنيه وقال متذكرا حزن يوسف الأول \" يا أسفا على يوسف \" جدد له حزن الابنين الحزن الدفين; قال عبد الرزاق أنا الثوري عن سفيان العصفري عن سعيد بن جبير أنه قال لم يعط أحد غير هذه الأمة الاسترجاع ألا تسمعون إلى قول يعقوب عليه السلام \" يا أسفا على يوسف وابيضت عيناه من الحزن فهو كظيم \" أي ساكت يشكو أمره إلى مخلوق قاله قتادة وغيره وقال الضحاك فهو كظيم كئيب حزين وقال ابن أبي حاتم حدثنا أبي حدثنا حماد عن سلمة عن علي بن يزيد عن الحسن عن الأحنف بن قيس أن النبي صلي الله عليه وسلم قال إن داود عليه السلام قال: يا رب إن بني إسرائيل يسألونك بإبراهيم وإسحاق ويعقوب فاجعلني لهم رابعا فأوحى الله تعالى إليه أن يا داود إن إبراهيم ألقي في النار بسببي فصبر وتلك بلية لم تنلك وإن إسحاق بذل مهجة دمه بسببي فصبر وتلك بلية لم تنلك وإن يعقوب أخذت منه حبه فابيضت عيناه من الحزن فصبر وتلك بلية لم تنلك وهذا مرسل وفيه نكارة فإن الصحيح أن إسماعيل هو الذبيح ولكن علي بن زيد بن جدعان له مناكير وغرائب كثيرة والله أعلم وأقرب ما في هذا أن الأحنف بن قيس رحمه الله حكاه عن بعض بني إسرائيل ككعب ووهب ونحوهما والله أعلم فإن بني إسرائيل ينقلون أن يعقوب كتب إلى يوسف لما احتبس أخاه بسبب السرقة يتلطف له في رد ابنه ويذكر له أنهم أهل بيت مصابون بالبلاء فإبراهيم ابتلي بالنار وإسحاق بالذبح ويعقوب بفراق يوسف في حديث طويل لا يصح والله أعلم فعند ذلك رق له بنوه وقالوا له على سبيل الرفق به والشفقة عليه."
    },
    {
      "ayah": 85,
      "surah": 12,
      "text": "\" تالله تفتؤا تذكر يوسف \" أي لا تفارق تذكر يوسف \" حتى تكون حرضا \" أى ضعيف القوة \" أو تكون من الهالكين \" يقولون إن استمر بك هذا الحال خشينا عليك الهلاك والتلف."
    },
    {
      "ayah": 86,
      "surah": 12,
      "text": "\" قال إنما أشكو بثي وحزني إلى الله \" أي أجابهم عما قالوا بقوله \" إنما أشكو بثي وحزني \" أي همي وما أنا فيه \" إلى الله \" وحده \" وأعلم من الله ما لا تعلمون \" أي أرجو منه كل خير وعن ابن عباس \" وأعلم من الله ما لا تعلمون \" يعني رؤيا يوسف أنها صدق وأن الله لا بد أن يظهرها وقال العوفي عنه في الآية: أعلم أن رؤيا يوسف صادقة وأني سوف أسجد له وقال ابن أبي حاتم حدثنا الحسن بن عرفه حدثنا يحيى بن عبد الملك بن أبي بحينة عن حفص بن عمر بن أبي الزبير عن أنس بن مالك رضي الله عنه قال: قال رسول الله صلي الله عليه وسلم كان ليعقوب النبي عليه السلام أخ مؤاخ له فقال له ذات يوم ما الذي أذهب بصرك وقوس ظهرك؟ قال أما الذي أذهب بصري فالبكاء على يوسف وأما الذي قوس- ظهري فالحزن على بنيامن فأتاه جبريل عليه السلام فقال يا يعقوب إن الله يقرئك السلام ويقول لك أما تستحي أن تشكوني إلى غيري؟ فقال يعقوب إنما أشكو بثي وحزني إلى الله فقال جبريل عليه السلام الله أعلم \" بما تشكو \" وهذا حديث غريب في نكارة."
    },
    {
      "ayah": 87,
      "surah": 12,
      "text": "يقول تعالى مخبرا عن يعقوب عليه السلام إنه ندب بنيه على الذهاب في الأرض يستعلمون أخبار يوسف وأخيه بنيامن والتحسس يكون في الخير والتجسس يكون في الشر ونهضهم وبشرهم وأمرهم أن لا ييأسوا من روح الله أي لا يقطعوا رجاءهم وأملهم من الله فيما يرومونه ويقصدونه فإنه لا يقطع الرجاء ولا ييأس من روح الله إلا القوم الكافرون."
    },
    {
      "ayah": 88,
      "surah": 12,
      "text": "وقوله \" فلما دخلوا عليه \" تقدير الكلام: فذهبوا ودخلوا مصر ودخلوا على يوسف \" قالوا يا أيها العزيز مسنا وأهلنا الضر يعنون من الجدب والقحط وقلة الطعام \" وجئنا ببضاعة مزجاة \" أي ومعنا ثمن الطعام الذي نمتاره وهو ثمن قليل قاله مجاهد والحسن وغير واحد وقال ابن عباس الرديء لا ينفق مثل خلق الغرارة والحبل والشيء وفى رواية عنه الدراهم الرديئة التي لا تجوز إلا بنقصان وكذا قال قتادة والسدي وقال سعيد بن جبير: هي الدراهم الفسول وقال أبن صالح هو الصنوبر وحبة الخضراء وقال الضحاك فاسده لا تنفق وقال أبو صالح جاءوا بحب البطم الأخضر والصنوبر وأصل الإزجاء الدفع لضعف الشيء كما قال حاتم طيء ليبك على ملحان ضيف مدافع وأرمله تزجى مع الليل أرملا وقال أعشى بني ثعلبة الواهب المائة الهجان وعبـدها عوذا تزجي خلفها أطفالها وقوله إخبارا عنهم \" فأوف لنا الكيل \" أي أعطنا بهذا الثمن القليل ما كنت تعطينا قبل ذلك وقرأ ابن مسعود: فأوقر ركابنا وتصدق علينا وقال ابن جريج وتصدق علينا برد أخينا إلينا وقال سعيد والسدي \" وتصدق علينا \" يقولون تصدق علينا بقبض هذه البضاعة المزجاة وتجوز فيها وسئل سفيان بن عيينة: هل حرمت الصدقة على أحد من الأنبياء قبل النبي صلي الله عليه وسلم ؟ فقال ألم تسمع قوله \" فأوف لنا الكيل وتصدق علينا إن الله يجزي المتصدقين \" ؟ رواه ابن جرير عن الحارث عن القاسم عنه وقال ابن جرير حدثنا الحارث حدثنا القاسم حدثنا مروان بن معاوية عن عثمان بن الأسود سمعت مجاهدا وسئل هل يكره أن يقول الرجل في دعائه: اللهم تصدق علي؟ قال نعم إنما الصدقة لمن يبتغي الثواب."
    },
    {
      "ayah": 89,
      "surah": 12,
      "text": "يقول تعالى مخبرا عن يوسف عليه السلام أنه لما ذكر له إخوته ما أصابهم من الجهد والضيق وقلة الطعام وعموم الجدب وتذكر أباه وما هو فيه من الحزن لفقد ولديه مع ما هو فيه من الملك والتصرف والسعة فعند ذلك أخذته رقة ورأفة ورحمة وشفقة على أبيه لإخوته وبدره البكاء فتعرف إليهم فيقال إنه رفع التاج عن جبهته وكان فيها شامة وقال \" هل علمتم ما فعلتم بيوسف وأخيه إذ أنتم جاهلون \" أعني كيف فرقوا بينه وبين أخيه \" إذ أنتم جاهلون \" أي إنما حملكم على هذا الجهل بمقدار هذا الذي ارتكبتموه كما قال بعض السلف كل من عصى الله فهو جاهل وقرأ \" ثم إن ربك للذين عملوا السوء بجهاله \" الآية والظاهر والله أعلم أن يوسف عليه السلام إنما تعرف إليهم بنفسه بإذن الله تعالى له في ذلك كما أنه إنما أخفى منهم نفسه في المرتين الأوليين بأمر الله تعالى له في ذلك والله أعلم ولكن لما ضاق الحال واشتد الأمر فرج الله تعالى من ذلك الضيق كما قال تعالى \" فإن مع العسر يسر إن مع العسر يسرا \"."
    },
    {
      "ayah": 9,
      "surah": 12,
      "text": "يقولون هذا الذي يزحمكم في محبة أبيكم لكم اعدموه من وجه أبيكم ليخلولكم وحدكم إما بأن تقتلوه أو تلقوه في أرضى من الأراضي تستريحوا منه وتخلوا أنتم بأبيكم \" وتكونوا من بعده قوما صالحين \" فأضمروا التربة قبل الذنب."
    },
    {
      "ayah": 90,
      "surah": 12,
      "text": "فعند ذلك قالوا \" أئنك لأنت يوسف \" وقرأ أبي بن كعب \" إنك لأنت يوسف \" وقرأ ابن محيصن \" أنت يوسف \" والقراءة المشهورة هي الأولى لأن الاستفهام يدل على الاستعظام أي أنهم تعجبوا من ذلك أنهم يترددون إليه من سنتين وأكثر وهم لا يعرفونه وهو مع هذا يعرفهم ويكتم نفسه فلهذا قالوا على سبيل الإستفهام \" أئنك لأنت يوسف قال أنا يوسف وهذا أخي \" وقوله \" قد من الله علينا \" أي يجمعه بيننا بعد التفرقة المدة \" إنه من يتق ويصبر فإن الله لا يضيع أجر المحسنين قالوا تالله لقد آثرك الله علينا \" الآية يقولون معترفين له بالفضل والأثرة عليهم في الخلق والخلق والسعة والملك والتصرف والنبوة أيضا على قول من لم يجعلهم أنبياء وأقروا بأنهم أساءوا إليه واخطأوا في حقه."
    },
    {
      "ayah": 91,
      "surah": 12,
      "text": "فعند ذلك قالوا \" أئنك لأنت يوسف \" وقرأ أبي بن كعب \" إنك لأنت يوسف \" وقرأ ابن محيصن \" أنت يوسف \" والقراءة المشهورة هي الأولى لأن الاستفهام يدل على الاستعظام أي أنهم تعجبوا من ذلك أنهم يترددون إليه من سنتين وأكثر وهم لا يعرفونه وهو مع هذا يعرفهم ويكتم نفسه فلهذا قالوا على سبيل الإستفهام \" أئنك لأنت يوسف قال أنا يوسف وهذا أخي \" وقوله \" قد من الله علينا \" أي يجمعه بيننا بعد التفرقة المدة \" إنه من يتق ويصبر فإن الله لا يضيع أجر المحسنين قالوا تالله لقد آثرك الله علينا \" الآية يقولون معترفين له بالفضل والأثرة عليهم في الخلق والخلق والسعة والملك والتصرف والنبوة أيضا على قول من لم يجعلهم أنبياء وأقروا بأنهم أساءوا إليه واخطأوا في حقه."
    },
    {
      "ayah": 92,
      "surah": 12,
      "text": "\" قال لا تثريب عليكم اليوم \" يقول أي لا تأنيب عليكم ولا عتب عليكم اليوم ولا أعيد عليكم ذنبكم في حقي بعد اليوم ثم زادهم الدماء لهم بالمغفرة فقال \" يغفر الله لكم وهو أرحم الراحمين \" قال السدي اعتذروا إلى يوسف فقال \" لا تثريب عليكم اليوم \" يقول لا أذكر لكم ذنبكم وقال ابن إسحاق والثوري \" لا تثريب عليكم \" أي لا تأنيب عليكم اليوم عندي فيما صنعتم \" يغفر الله لكم \" أي عليكم فيما فعلتم \" وهو أرحم الراحمين \"."
    },
    {
      "ayah": 93,
      "surah": 12,
      "text": "يقول اذهبوا بهذا القميص \" فألقوه على وجه أبي يأت بصيرا \" وكان قد عمي من كثرة البكاء \" وأتوني بأهلكم أجمعين \" أي بجميع بني يعقوب."
    },
    {
      "ayah": 94,
      "surah": 12,
      "text": "أي خرجت من مصر \" قال أبوهم \" يعني يعقوب عليه السلام لمن بقي عنده من بنيه \" إنى لأجد ريح يوسف لولا أن تفندون \" تنسبوني إلى الفند والكبر قال عبد الرزاق أنبأنا إسرائيل عن أبي سنان عن عبد الله بن أبي الهذيل قال سمعت ابن عباس يقول: ولما فصلت العير قال لما خرجت العير هاجت ريح فجاءت يعقوب بريح قميص يوسف فقال \" إنى لأجد ريح يوسف لولا أن تفندون \" قال فوجد ريحه من مسيرة ثمانية أيام وكذا رواه سفيان الثوري وشعبة وغيرهما عن ابن سنان به وقال الحسن وابن جريج كان بينهما ثمانون فرسخا وكان بينه وبينه منذ افترقا ثمانون سنة وقوله \" لولا أن تفندون \" قال ابن عباس ومجاهد وعطاء وقتادة وسعيد بن جبير تسفهون وقال مجاهد أيضا والحسن تهرمون."
    },
    {
      "ayah": 95,
      "surah": 12,
      "text": "قال ابن عباس لفي خطئك القديم وقال قتادة أي من حب يوسف لا تنساه ولا تسلاه قالوا لوالدهم كلمة غليظة لم يكن ينبغي لهم أن يقولوها لوالدهم وكنا لنبي الله صلي الله عليه وسلم وكذا قال السدي وغيره."
    },
    {
      "ayah": 96,
      "surah": 12,
      "text": "قال ابن عباس والضحاك \" البشير \" البريد وقال مجاهد والسدي كان يهوذا بن يعقوب قال السدي إنما جاء به لأنه هو الذي جاء بالقميص وهو ملطخ بدم كذب فأحب أن يغسل ذلك بهذا فجاء بالقميص فألقاه على وجه أبيه فرجع بصيرا وقال لبنيه عند ذلك \" ألم أقل لكم إنى أعلم من الله ما لا تعلمون \" أي أعلم أن الله سيرده إلي وقلت لكم \" إنى لأجد ريح يوسف لولا أن تفندون."
    },
    {
      "ayah": 97,
      "surah": 12,
      "text": "فعند ذلك قالوا لأبيهم مترفقين له \" يا أبانا استغفر لنا ذنوبنا إنا كنا خاطئين قال سوف أستغفر لكم ربي إنه هو الغفور الرحيم \" أي من ناب إليه تاب عليه قال ابن مسعود وإبراهيم التيمي وعمرو بن قيس وابن جريج وغيرهم أرجأهم إلى وقت السحر وقال ابن جرير حدثني أبو السائب حدثنا ابن إدريس سمعت عبد الرحمن بن إسحاق يذكر عن محارب بن دسار قال كان عمر رضي الله عنه يأتي المسجد فيسمع إنسانا يقول: اللهم دعوتني فأجبت وأمرتني فأطعت وهذا السحر فاغفر لى قال فاستمع الصوت فإذا هو من دار عبد الله بن مسعود فسأل عبد الله عن ذلك فقال إن يعقوب أخر بنيه إلى السحر بقوله \" سوف أستغفر لكم ربي \" وقد ورد في الحديث إن ذلك كان ليلة الجمعة كما قال ابن جرير أيضا حدثني المثنى حدثنا سليمان بن عبد الرحمن أبو أيوب الدمشقي حدثنا أبو الوليد انبأنا ابن جريج عن عطاء وعكرمة عن ابن عباس عن رسول الله صلي الله عليه وسلم \" سوف أستغفر لكم ربي \" يقول حتى تأتي ليلة الجمعة وهو قول أخي يعقوب لبنيه وهذا غريب من هذا الوجه وفي رفعه نظر والله أعلم."
    },
    {
      "ayah": 98,
      "surah": 12,
      "text": "فعند ذلك قالوا لأبيهم مترفقين له \" يا أبانا استغفر لنا ذنوبنا إنا كنا خاطئين قال سوف أستغفر لكم ربي إنه هو الغفور الرحيم \" أي من ناب إليه تاب عليه قال ابن مسعود وإبراهيم التيمي وعمرو بن قيس وابن جريج وغيرهم أرجأهم إلى وقت السحر وقال ابن جرير حدثني أبو السائب حدثنا ابن إدريس سمعت عبد الرحمن بن إسحاق يذكر عن محارب بن دسار قال كان عمر رضي الله عنه يأتي المسجد فيسمع إنسانا يقول: اللهم دعوتني فأجبت وأمرتني فأطعت وهذا السحر فاغفر لى قال فاستمع الصوت فإذا هو من دار عبد الله بن مسعود فسأل عبد الله عن ذلك فقال إن يعقوب أخر بنيه إلى السحر بقوله \" سوف أستغفر لكم ربي \" وقد ورد في الحديث إن ذلك كان ليلة الجمعة كما قال ابن جرير أيضا حدثني المثنى حدثنا سليمان بن عبد الرحمن أبو أيوب الدمشقي حدثنا أبو الوليد انبأنا ابن جريج عن عطاء وعكرمة عن ابن عباس عن رسول الله صلي الله عليه وسلم \" سوف أستغفر لكم ربي \" يقول حتى تأتي ليلة الجمعة وهو قول أخي يعقوب لبنيه وهذا غريب من هذا الوجه وفي رفعه نظر والله أعلم."
    },
    {
      "ayah": 99,
      "surah": 12,
      "text": "يخبر تعالى عن ورود يعقوب عليه السلام على يوسف عليه السلام وقدومه بلاد مصر لما كان يوسف قد تقدم لأخوته أن يأتوه بأهلهم أجمعين فتحملوا عن آخرهم وترحلوا من بلاد كنعان قاصدين بلاد مصر فلما أخبر يوسف عليه السلام باقترابهم خرج لتلقيهم وأمر الملك أمراءه وأكابر الناس بالخروج مع يوسف لتلقي نبي الله يعقوب عليه السلام ويقال إن الملك خرج أيضا لتلقيه وهو الأشبه وقد أشكل قوله \" آوى إليه أبويه وقال ادخلوا مصر \" على كثير من المفسرين فقال بعضهم هذا من المقدم والمؤخر ومعنى الكلام \" وقال ادخلوا مصر إن شاء الله أمنين \" وأوى إليه أبويه ورفعهما على العرش ورد ابن جرير هذا وأجاد في ذلك ثم اختار ما حكاه عن السدي أن يوسف آوى إليه أبويه لما تلقاهما ثم لما وصلوا باب البلد قال \" ادخلوا مصر إن شاء الله آمنين \" وفى هذا نظر أيضا لأن الإيواء إنما يكون في المنزل كقوله \" آوى إليه أخاه \" وفي الحديث من أوى محدثا وما المانع أن يكون قال لهم بعد ما دخلوا عليه وآواهم إليهادخلوا مصر وضمنه اسكنوا مصر إن شاء الله آمنين أي مما كنتم فيه من الجهد والقحط ؟ ويقال والله أعلم إن الله تعالى رفع عن أهل مصر بقية السنين المجدبة ببركة قدوم يعقوب عليهم كما رفع بقية السنين التي دعا بها رسول الله صلي الله عليه وسلم على أهل مكة حين قال اللهم أعني عليهم بسبع كسبع يوسف ثم لما تضرعوا إليه واستشفعوا لديه وأرسلوا أبا سفيان في ذلك فدعا لهم فرفع عنهم بقية ذلك ببركة دعائه عليه السلام وقوله \" أوى إليه أبويه \" قال السدي وعبد الرحمن بن زيد بن أسلم إنما كان أبوه وخالته وكانت أمه قد ماتت قديما وقال محمد بن إسحاق وابن جرير كان أبوه وأمه يعيشان قال ابن جرير ولم يقم دليل على موت أمه وظاهر القرآن يدل على حياتها وهذا الذي نصره هو المنصور الذي يدل عليه السياق."
    }
  ]
}
