{
  "ayahs": [
    {
      "ayah": 1,
      "surah": 13,
      "text": "أما الكلام على الحروف المقطعة في أوائل السورة قد اختلف المفسرون في الحروف المقطعة التي في أوائل السور فمنهم من قال هي مما استأثر الله بعلمه فردوا علمها إلى الله ولم يفسرها حكاه القرطبي في تفسـره عن أبي بكر وعمر وعثمان وعلي وابن مسعود رضي الله عنهم أجمعين وقاله عامر الشعبي وسفيان الثوري والربيع بن خيثم واختاره أبو حاتم بن حبان. ومنهم من فسرها واختلف هؤلاء في معناها فقال عبدالرحمن بن زيد بن أسلم إنما هي أسماء السور. قال العلامة أبو القاسم محمود بن عمر الزمخشري في تفسيره وعليه إطباق الأكثر ونقل عن سيبويه أنه نص عليه ويعتضد لهذا بما ورد في الصحيحين عن أبي هريرة أن رسول الله صلى الله عليه وسلم كان يقرأ في صلاة الصبح يوم الجمعة \"الم\" السجدة و \"هل أتى على الإنسان\" وقال سفيان الثوري عن ابن أبي نجيح عن مجاهد أنه قال: الم وحم والمص وص. فواتح افتتح الله بها القرآن وكذا قال غيره عن مجاهد وقال مجاهد في رواية أبي حذيفة موسى بن مسعود عن شبل عن ابن أبي نجيح عنه أنه قال الم اسم من أسماء القرآن وهكذا وقال قتادة وزيد بن أسلم ولعل هذا يرجع إلى معنى قول عبدالرحمن بن زيد بن أسلم أنه اسم من أسماء السور فإن كل سورة يطلق عليها اسم القرآن فإنه يبعد أن يكون المص اسما للقرآن كله لأن المتبادر إلى فهم سامع من يقول قرأت المص إنما ذلك عبارة عن سورة الأعراف لا لمجموع القرآن والله أعلم. وقيل هي اسم من أسماء الله تعالى فقال عنها في فواتح السور من أسماء الله تعالى وكذلك قال سالم بن عبدالله وإسماعيل بن عبدالرحمن السدي الكبير وقال شعبة عن السدي بلغني أن ابن عباس قال ألم اسم من أسماء الله الأعظم. هكذا رواه ابن أبي حاتم من حديث شعبة ورواه ابن جرير عن بندار عن ابن مهدي عن شعبة قال سألت السدي عن حم وطس والم فقال قال ابن عباس هي اسم الله الأعظم وقال ابن جرير وحدثنا محمد بن المثنى حدثنا أبو النعمان حدثنا شعبة عن إسماعيل السدي عن مرة الهمذاني قال: قال عبدالله فذكر نحوه. وحكى مثله عن علي وابن عباس وقال علي بن أبي طلحة عن ابن عباس هو قسم أقسم الله به وهو من أسماء الله تعالى وروى ابن أبي حاتم وابن جرير من حديث ابن علية عن خالد الحذاء عن عكرمة أنه قال الم قسم. وروينا أيضا من حديث شريك بن عبدالله بن عطاء بن السائب عن أبى الضحى عن ابن عباس: الم قال أنا الله أعلم وكذا قال سعيد بن جبير وقال السدي عن أبي مالك وعن أبي صالح عن ابن عباس وعن مرة الهمذاني عن ابن مسعود وعن ناس من أصحاب النبي صلى الله عليه وسلم الم قال أما الم فهي حروف استفتحت من حروف هجاء أسماء الله تعالى. قال وأبو جعفر الرازي عن الربيع بن أنس عن أبي العالية في قوله تعالى ألم قال هذه الأحرف الثلاثة من التسعة والعشرين حرفا دارت فيها الألسن كلها ليس منها حرف إلا وهو مفتاح اسم من أسمائه وليس منها حرف إلا وهو من آلائه وبلألائه وليس منها حرف إلا وهو في مدة أقوام وآجالهم. قال عيسى ابن مريم عليه السلام وعجب: فقال أعجب أنهم يظنون بأسمائه ويعيشون في رزقه فكيف يكفرون به فالألف مفتاح الله واللام مفتاح اسمه لطيف والميم مفتاح اسمه مجيد فالألف آلاء الله واللام لطف الله والميم مجد الله والألف سنة واللام ثلاثون سنة والميم أربعون سنة. هذا لفظ ابن أبي حاتم ونحوه رواه ابن جرير ثم شرع يوجه كل واحد من هذه الأقوال ويوفق بينها وأنه لا منافاة بين كل واحد منها وبين الآخر وأن الجمع ممكن فهي أسماء للسور ومن أسماء الله تعالى يفتتح بها السور فكل حرف منها دل على اسم من أسمائه وصفة من صفاته كما افتتح سورا كثيرة بتحميده وتسبيحه وتعظيمه قال ولا مانع من دلالة الحرف منها على اسم من أسماء الله وعلى صفة من صفاته وعلى مدة وغير ذلك كما ذكره الربيع بن أنس عن أبي العالية لأن الكلمة الواحدة تطلق على معاني كثيرة كلفظة الأمة فإنها تطلق ويراد به الدين كقوله تعالى \"إنا وجدنا آباءنا على أمة\" وتطلق ويراد بها الرجل المطيع لله كقوله تعالى \"إن إبراهيم كان أمة قانتا لله حنيفا ولم يك من المشركين\" وتطلق ويراد بها الجماعة كقوله تعالى \"وجد عليه أمة من الناس يسقون\" وقوله تعالى \"ولقد بعثنا في كل أمة رسولا\" وتطلق ويراد بها الحين من الدهر كقوله تعالى \"وقال الذي نجا منهما وادكر بعد أمة\" أي بعد حين على أصح القولين قال فكذلك هذا. هذا حاصل كلامه موجها ولكن هذا ليس كما ذكره أبو العالية فإن أبا العالية زعم أن الحرف دل على هذا وعلى هذا وعلى هذا معا ولفظة الأمة وما أشبهها من الألفاظ المشتركة في الاصطلاح إنما دل في القرآن في كل موطن على معنى واحد دل عليه سياق الكلام فأما حمله على مجموع محامله إذا أمكن فمسئلة مختلف فيها بين علماء الأصول ليس هذا موضع البحث فيها والله أعلم. ثم إن لفظة الأمة تدل على كل من معانيها في سياق الكلام بدلالة الوضع فأما دلالة الحرف الواحد على اسم يمكن أن يدل على اسم آخر من غير أن يكون أحدهما أولى من الآخر في التقدير أو الإضمار بوضع ولا بغيره فهذا مما لا يفهم إلا بتوقيف والمسئلة مختلف فيها وليس فيها إجماع حتى يحكم به وما أنشدوه من الشواهد على صحة إطلاق الحرف الواحد على بقية الكلمة فإن في السياق ما يدل على ما حذف بخلاف هذا كما قال الشاعر: قلنا قفي لنا فقالت قاف لا تحسبي أنا نسينا الإيجاف تعني وقفت. وقال الآخر: ما للظليم عال كيف لايـ ينقد عنه جلده إذا يـ فقال ابن جرير كأنه أراد أن يقول إذا يفعل كذا وكذا فاكتفى بالياء من يفعل وقال الآخر: بالخير خيرات وإن شرا فا ولا أريد الشر إلا أن تـ يقول وإن شرا فشرا ولا أريد الشر إلا أن تشاء فاكتفى بالفاء والتاء من الكلمتين عن بقيتهما ولكن هذا ظاهر من سياق الكلام والله أعلم. قال القرطبي وفي الحديث \"من أعان على قتل مسلم بشطر كلمة\" الحديث قال سفيان هو أن يقول في اقتل\"ا قـ\" وقال خصيف عن مجاهد أنه قال فواتح السور كلها\"ق وص وحم وطسم والر\" وغير ذلك هجاء موضوع وقال بعض أهل العربية هي حروف من حروف المعجم استغنى بذكر ما ذكر منها في أوائل السور عن ذكر بواقيها التي هي تتمة الثمانية والعشرين حرفا كما يقول القائل ابني يكتب في - ا ب ت ث - أي في حروف المعجم الثمانية والعشرين فيستغني بذكر بعضها عن مجموعها حكاه ابن جرير. قلت مجموع الحروف المذكورة في أوائل السور بحذف المكرر منها أربعة عشر حرفا وهي - ال م ص ر ك ه ي ع ط س ح ق ن- يجمعها قولك: نص حكيم قاطع له سر. وهي نصف الحروف عددا والمذكور منها أشرف من المتروك وبيان ذلك من صناعة التصريف. قال الزمخشري وهذه الحروف الأربعة عشر مشتملة على أصناف أجناس الحروف يعني من المهموسة والمجهورة ومن الرخوة والشديدة ومن المطبقة والمفتوحة ومن المستعلية والمنخفضة ومن حروف القلقلة. وقد سردها مفصلة ثم قال: فسبحان الذي دقت في كل شئ حكمته. وهذه الأجناس المعدودة مكثورة بالمذكورة منها وقد علمت أن معظم الشيء وجله ينزل منزلة كله وههنا ههنا لخص بعضهم في هذا المقام كلاما فقال: لا شك أن هذه الحروف لم ينزلها سبحانه وتعالى عبثا ولا سدى ومن قال من الجهلة إن في القرآن ما هو تعبد لا معنى له بالكلمة فقد أخطأ خطأ كبيرا فتعين أن لها معنى في نفس الأمر فإن صح لنا فيها عن المعصوم شيء قلنا به وإلا وقفنا حيث وقفنا وقلنا \"آمنا به كل من عند ربنا\" ولم يجمع العلماء فيها على شيء معين وإنما اختلفوا فمن ظهر له بعض الأقوال بدليل فعليه اتباعه وإلا فالوقف حتى يتبين هذا المقام. المقام الآخر في الحكمة التي اقتضت إيراد هذه الحروف في أوائل السور ما هي مع قطع النظر عن معانيها في أنفسها فقال بعضهم إنما ذكرت ليعرف بها أوائل السور حكاه ابن جرير وهذا ضعيف لأن الفصل حاصل بدونها فيما لم تذكر فيه وفيما ذكرت فيه البسملة تلاوة وكتابة وقال آخرون بل ابتدئ بها لتفتح لاستماعها إسماع المشركين إذ تواصوا بالإعراض عن القرآن حتى إذا استمعوا له تلا عليهم المؤلف منه حكاه ابن جرير أيضا وهو ضعيف أيضا لأنه لو كان كذلك لكان ذلك في جميع السور لا يكون في بعضها بل غالبها ليس كذلك ولو كـان كذلك أيضا لانبغى الابتداء بها في أوائل الكلام معهم سواء كان افتتاح سورة أو غير ذلك ثم إن هذه السورة والتي تليها أعني البقرة وآل عمران مدنيتان ليستا خطابا للمشركين فانتقض ما ذكروه بهذه الوجوه. وقال آخرون بل إنما ذكرت هذه الحروف في أوائل السور التي ذكرت فيها بيانا لإعجاز القرآن وأن الخلق عاجزون عن معارضته بمثله هذا مع أنه مركب من هذه الحروف المقطعة التي يتخاطبون بها وقد حكى هذا المذهب الرازي في تفسيره عن المبرد وجمع من المحققين وحكى القرطبي عن الفراء وقطرب نحو هذا وقرره الزمخشري فى كشافه ونصره أتم نصر وإليه ذهب الشيخ الإمام العلامة أبو العباس ابن تيمية وشيخنا الحافظ المجتهد أبو الحجاج المزي وحكاه لي عن ابن تيمية. قال الزمخشري ولم ترد كلها مجموعة في أول القرآن وإنما كررت ليكون أبلغ في التحدي والتبكيت كما كررت قصص كثيرة وكرر التحدي بالصريح في أماكن قال وجاء منها على حرف واحد كقوله - ص ن ق- وحرفين مثل \"حم\" وثلاثة مثل \"الم\" وأربعة مثل \"المر\" و \"المص\" وخمسة مثل \"كهيعص- و- حمعسق\" لأن أساليب كلامهم على هذا من الكلمات ما هو على حرف وعلى حرفين وعلى ثلاثة وعلى أربعة وعلى خمسة لا أكثر من ذلك \"قلت\" ولهذا كل سورة افتتحت بالحروف فلا بد أن يذكر فيها الانتصار للقرآن وبيان إعجازه وعظمته وهذا معلوم بالاستقراء وهو الواقع في تسع وعشرين سورة ولهذا يقول تعالى \"الم ذلك الكتاب لا ريب فيه\" \"الم الله لا إله إلا هو الحي القيوم نزل عليك الكتاب بالحق مصدقا لما بين يديه\" \"المص كتاب أنزل إليك فلا يكن في صدرك حرج منه\" \"الر كتاب أنزلناه إليك لتخرج الناس من الظلمات إلى النور بإذن ربهم\" \"الم تنزيل الكتاب لا ريب فيه من رب العالمين\" \"حم تنزيل من الرحمن الرحيم\" \"حم عسق كذلك يوحي إليك وإلى الذين من قبلك الله العزيز الحكيم\" وغير ذلك من الآيات الدالة على صحة ما ذهب إليه هؤلاء لمن أمعن النظر والله أعلم. وأما من زعم أنها دالة على معرفة المدد وأنه يستخرج من ذلك أوقات الحوادث والفتن والملاحم فقد ادعى ما ليس له وطار في غير مطاره وقد ورد في ذلك حديث ضعيف وهو مع ذلك أدل على بطلان هذا المسلك من التمسك به على صحته وهو ما رواه محمد بن اسحق بن يسار صاحب المغازي حدثني الكلبي عن أبي صالح عن ابن عباس عن جابر بن عبدالله بن رباب قال مر أبو ياسر بن أخطب في رجال من يهود برسول الله صلى الله عليه وسلم وهو يتلو فاتحة سورة البقرة \"الم ذلك الكتاب لا ريب فيه\" فأتى أخاه بن أخطب في رجال من اليهود فقال تعلمون والله لقد سمعت محمدا يتلو فيما أنزل الله تعالى عليه \"الم ذلك الكتاب لا ريب فيه\" فقال أنت سمعته قال نعم قال فمشى حي بن أخطب في أولئك النفر من اليهود إلى رسول الله صلى الله عليه وسلم فقالوا يا محمد ألم يذكر أنك تتلوا فيما أنزل الله عليك \"الم ذلك الكتاب\"؟ فقال رسول الله صلى الله عليه وسلم \"بلى\" فقالوا جاءك بهذا جبريل من عند الله؟ فقال \"نعم\" قالوا لقد بعث الله قبلك أنبياء ما نعلمه بين لنبي منهم ما مدة ملكه وما أجل أمته غيرك. فقام حي بن أخطب وأقبل على من كان معه فقال لهم الألف واحدة واللام ثلاثون والميم أربعون فهذه إحدى وسبعون سنة أفتدخلون في دين نبي إنما مدة ملكه وأجل أمته إحدى وسبعون سنة؟ ثم أقبل على رسول الله صلى الله عليه وسلم فقال يا محمد هل مع هذا غيره فقال \"نعم\" قال ما ذاك؟ قال \"المص\" قال هذا أثقل وأطول الألف واحد واللام ثلاثون والميم أربعون والصاد تسعون فهذه إحدى وثلاثون ومائة سنة. هل مع هذا يا محمد غيره؟ قال \"نعم\" قال ما ذاك؟ قال \"الر\" قال هذا أثقل وأطول الألف واحدة واللام ثلاثون والراء مائتان فهذه إحدى وثلاثون ومائتا سنة. فهل مع هذا يا محمد غيره؟ قال \"نعم\" قال ماذا قال \"المر\" قال هذه أثقل وأطول الألف واحدة واللام ثلاثون والميم أربعون والراء مائتان فهذه إحدى وسبعون ومائتان ثم قال: لقد لبس علينا أمرك يا محمد حتى ما ندري أقليلا أعطيت أم كثيرا. ثم قال قوموا عنه ثم قال أبو ياسر لأخيه حي بن أخطب ولمن معه من الأحبار ما يدريكم لعله قد جمع هذا لمحمد كله إحدى وسبعون وإحدى وثلاثون ومائة وإحدى وثلاثون ومائتان وإحدى وسبعون ومائتان فذلك سبعمائة وأربع سنين؟ فقالوا لقد تشابه علينا أمره فيزعمون أن هؤلاء الآيات نزلت فيهم \"هو الذي أنزل عليك الكتاب منه آيات محكمات هن أم الكتاب وأخر متشابهات\" فهذا الحديث مداره على محمد بن السائب الكلبي وهو ممن لا يحتج بما انفرد به ثم كان مقتضى هذا المسلك إن كان صحيحا أن يحسب ما لكل حرف من الحروف الأربعة عشر التي ذكرناها وذلك يبلغ منه جملة كثيرة وإن حسبت مع التكرر فأطم وأعظم والله أعلم. \"تلك آيات الكتاب \" أي هذه آيات الكتاب وهو القرآن وقيل التوراة والإنجيل قاله مجاهد وقتادة وفيه نظر بل هو بعيد ثم عطف على ذلك عطف صفات فقال \" والذي أنزل إليك \" أي يا محمد \" من ربك الحق \" خبر تقدم مبتدؤه وهو قوله \" والذي أنزل إليك من ربك \" هذا هو الصحيح المطابق لتفسير مجاهد وقتادة واختار ابن جرير أن تكون الواو زائدة أوعاطفة صفة على صفة كما قدمنا واستشهد بقول الشاعر: إلى الملك القرم وابن الهمام وليث الكتيبة في المزدحم وقوله \" ولكن أكثر الناس لا يؤمنون \" كقوله \" وما أكثر الناس ولو حرصت بمؤمنين \" أي مع هذا البيان والجلاء والوضوح لا يؤمن أكثرهم لما فيهم من الشقاق والعناد والنفاق."
    },
    {
      "ayah": 10,
      "surah": 13,
      "text": "يخبر تعالى عن إحاطة علمه بجميع خلقه وإنه سواء منهم من أسر قوله أو جهر به فإنه يسمعه لا يخفى عليه شيء كقوله \" وإن تجهر بالقول فإنه يعلم السر وأخفى \" وقال \" ويعلم ما تخفون وما تعلنون \" وقالت عائشة رضي الله عنها: سبحان الذي وسع سمعه الأصوات والله لقد جاءت المجادلة تشتكى زوجها إلى رسول الله صلى الله عليه وسلم وأنا في جنب البيت وإنه ليخفى علي بعض كلامها فأنزل الله \" قد سمع الله قول التي تجادلك في زوجها وتشتكي إلى الله والله يسمع تحاوركما إن الله سميع بصير \" وقوله \" ومن هو مستخف بالليل \" أي مختف في قعر بيته في ظلام الليل \" وسارب بالنهار \" أي ظاهر ماش في بياض النهار وضيائه فإن كلاهما في علم الله على السواء كقوله تعالى \" ألا حين يستغشون ثيابهم \" الآية وقوله تعالى \" وما تكون في شأن وما تتلو منه من قرآن ولا تعملون من عمل إلا كنا عليكم شهودا إتفيضون فيه وما يعزب عن ربك من مثقال ذرة في الأرض ولا في السماء ولا أصغر من ذلك ولا أكبر إلا فى كتاب مبين \"."
    },
    {
      "ayah": 11,
      "surah": 13,
      "text": "أي للعبد ملائكة يتعاقبون عليه حرس بالليل وحرس بالنهار يحفظونة من الأسواء والحادثات كما يتعاقب ملائكة آخرون لحفظ الأعمال من خير أو شر ملائكة بالليل وملائكة بالنهار فاثنان عن اليمين والشمال يكتبان الأعمال صاحب اليمين يكتب الحسنات وصاحب الشمال يكتب السيئات وملكان آخران يحفظانه ويحرسانه واحد من ورائه وآخر من قدامه فهو بين أربعة أملاك بالنهار وأربعة آخرين بالليل بدلا حافظان وكاتبان كما جاء في الصحيح \" يتعاقبون فيكم ملائكة بالليل وملائكة بالنهار ويجتمعون في صلاة الصبح وصلاة العصر فيصعد إليه الذين باتوا فيكم فيسألهم وهو أعلم بكم كيف تركتم عبادي ؟ فيقولون أتيناهم وهم يصلون وتركناهم وهم يصلون \" وفي الحديث الآخر \" إن معكم من لا يفارقكم إلا عند الخلاء وعند الجماع فاستحيوهم وأكرموهم \"وقال علي بن أبي طلحة عن ابن عباس في قوله \" له معقبات من بين يديه ومن خلفه يحفظونه من أمر الله \" والمعقبات من الله هي الملائكة وقال عكرمة عن ابن عباس \" يحفظونه من أمر الله \" قال ملائكة يحفظونه من بين يديه ومن خلفه فإذا جاء قدر الله خلوا عنه وقال مجاهد ما من عبد إلا له ملك موكل يحفظه في نومه ويقظته من الجن والإنس والهوام فما منها شيء يأتيه يريده إلا قال له الملك: وراءك إلا شيء أذن الله فيه فيصيبه وقال الثوري عن حبيب بن أبي ثابت عن سعيد بن جبير عن ابن عباس في قوله \" له معقبات من بين يديه ومن خلفه \" قال ذلك ملك من ملوك الدنيا له حرس من دونه حرس وقال العوفي عن ابن عباس \" له معقبات من بين يديه ومن خلفه \" يعني ولي السلطان يكون عليه الحرس وقال عكرمة في تفسيرها هؤلاء الأمراء المواكب من بين يديه ومن خلفه ; وقال الضحاك في الآية هو السلطان المحروس من أمر الله وهم أهل الشرك والظاهر والله أعلم أن مراد ابن عباس وعكرمة والضحاك بهذا أن حرس الملائكة للعبد يشبه حرس هؤلاء لملوكهم وأمرائهم وقد روى الإمام أبو جعفر ابن جرير ههنا حديث غريبا جدا فقال حدثني المثنى حدثنا إبراهيم بن عبد السلام بن صالح القشيري حدثنا علي بن جرير عن حماد بن سلمة عن عبد الحميد بن جعفر عن كنانة العدوي فال: دخل عثمان بن عفان على رسول الله صلى الله عليه وسلم فقال يا رسول الله أخبرني عن العبد كم معه من ملك ؟ فقال \" ملك عن يمينك على حسناتك وهو أمير على الذي على الشمال فإذا عملت حسنة كتبت عشرا وإذا عملت سيئة قال الذي علىالشمال للذي على اليمين أكتبها ؟ قال لا لعله يستغفر ويتوب فيستأذنه ثلاث مرات فإذا قال ثلاثا قال اكتبها أراحنا الله منه فبئس القرين ما أقل مراقبته للة وأقل استحياءه منا يقول الله \" ما يلفظ من قول إلا لديه رقيب عتيد \" وملكان من بين يديك ومن خلفك يقول الله تعالى \" له معقبات من بين يديه ومن خلفه \" الآية ; وملك قابض على ناصيتك فإذا تواضعت لله رفعك وإذا تجبرت على الله قصمك ; وملكان على شفتيك ليس يحفظان عليك إلا الصلاة على محمد صلى الله عليه وسلم وملك قائم على فيك لا يدع أن تدخل الحية في فيك وملكان على عينيك فهؤلاء عشرة أملاك على كل آدمي ينزلون ملائكة الليل على ملائكة النهار لأن ملائكة الليل سوى ملائكة النهار فهؤلاء عشرون ملكا على كل آدمي وإبليس بالنهار وولده بالليل \" وقال الإمام أحمد رحمه الله حدثنا أسود بن عامر حدثنا سفيان حدثنى منصور عن سالم بن أبي الجعد عن أبيه عن عبد الله قال: قال رسول الله صلى الله عليه وسلم \" ما منكم من أحد إلا وقد وكل به قرينه من الجن وقرينه من الملائكة \" قالوا وإياك يا رسول الله ؟ قال \" وإياي ولكن الله أعانني علم فلا يأمري إلا بخير \" انفرد بإخراجه مسلم وقوله \" يحفظونه من أمر الله \" قيل المراد حفظهم له من أمر الله رواه على بن أبي طلحة وغيره عن ابن عباس وإليه ذهب مجاهد وسعيد بن جبير وإبراهيم النخعي وغيرهم وقال قتادة \" يحفظونه من أمر الله \" قال وفي بعض القراءات يحفظونه بأمر الله وقال كعب الأحبار: لو تجلى لابن آدم كل سهل وكل حزن لرأى كل شي من ذلك شيئا يقينا لولا أن الله وكل بكم ملائكة يذبون عنكم في مطعمكم ومشربكم وعوراتكم إذا لتخطفتم وقال أبو أمامة ما من آدمي إلا ومعه ملك يذود عنه حتى يسلمه للذي قدر له وقال أبو مجلز جاء رجل من مراد إلى علي رضي الله عنه وهو يصلي فقال احترس فإن ناسا من مراد يريدون قتلك 0 فقال إن مع كل رجل ملكين يحفظانه مما لم يقدر فإذا جاء القدر خليا بينه وبينه إن الأجل جنة حصينة وقال بعضهم \" يحفظونه من أمر الله \" بأمر الله كما جاء في الحديث أنهم قالوا يا رسول الله أرأيت رقيا نسترقي بها هل ترد من قدر الله شيئا ؟ فقال \" هي من قدر الله \" وقال ابن أبي حاتم حدثنا أبو سعيد الأشج حدثنا حفص بن غياث عن أشعث عن جهم عن إبراهيم قال أوحى الله إلى نبي من أنبياء بني إسرائيل أن قل لقومك إنه ليس من أهل قرية ولا أهل بيت يكونون على طاعة الله فيتحولون منها إلى معصية الله إلا حول الله عنهم ما يحبون إلى ما يكرهون ثم قال إن تصديق ذلك في كتاب الله \" إن الله لا يغير ما بقوم حتى يغيروا ما بأنفسهم \" وقد ورد هذا في حديث مرفوع فقال الحافظ محمد بن عثمان بن أبي شيبة في كتابه صفة العرش حدثنا الحسن بن علي حدثنا الهيثم بن الأشعث السلمي حدثنا أبو حنيفة اليماني الأنصاري عن عمير بن عبد الملك قال: خطبنا علي بن أبي طالب على منبر الكوفة قال: كنت إذا أمسكت عن رسول الله صلى الله عليه وسلم ابتدأني وإذا سألته عن الخبر أنبأني وإنه حدثني عن ربه عز وجل قال \" قال الرب وعزتي وجلالي وارتفاعي فوق عرشي ما من قرية ولا أهل بيت كانوا على ما كرهت من معصيتي ثم تحولوا عنها إلى ما أحببت من طاعتي إلا تحولت لهم عما يكرهون من عذابي إلى ما يحبون من رحمتي \" وهذا غريب وفي إسناده من لا أعرفه."
    },
    {
      "ayah": 12,
      "surah": 13,
      "text": "يخبر تعالى أنه هو الذي يسخر البرق وهو ما يرى من النور اللامع ساطعا من خلل السحاب ; وروى ابن جرير أن ابن عباس كتب إلى أبي الجلد يسأله عن الرق فقال البرق الماء.وقوله \" خوفا وطمعا \" قال قتادة خوفا للمسافر يخاف أذاه ومشقته وطمعا للمقيم يرجو بركته ومنفعته ويطيع في رزق الله \" وينشيء السحاب الثقال \" أي يخلقها منشأة جديدة وهي لكثرة مائها ثقيلة قريبة إلى الأرض قال مجاهد: السحاب الثقال الذي فيه الماء."
    },
    {
      "ayah": 13,
      "surah": 13,
      "text": "قال \" ويسبح الرعد بحمده\" كقوله \" وإن من شيء إلا يسبح بحمده \" وقال الإمام أحمد حداثنا يزيد حدثنا إبراهيم بن سعد أخبرني أبي قال كنت جالسا إلى جنب حميد بن عبد الرحمن في المسجد فمر شيء من بني غفار فأرسل إليه حميد فلما أقبل قال يا ابن أخي وسع الله فيما بيني وبينك فإنه قد صحب رسول الله صلى الله عليه وسلم فجاء حتى جلس فيما بيني وبينه فقال له حميد ما الحديث الذي حدثتني عن رسول الله صلى الله عليه وسلم فقال له الشيخ سمعت عن شيخ من بني غفار أنه سمع النبي صلى الله عليه وسلم يقول \" إن الله ينشئ السحاب فينطق أحسن النطق ويضحك أحسن الضحك \" والمراد والله أعلم أن نطقها الرعد وضحكها البرق ; وقال موسى بن عبيدة عن سعد بن إبراهيم قال يبعث الله الغيث فلا أحسن منه مضحكا ولا آنس منه منطقا فضحكه البرق ومنطقه الرعد ; وقال ابن أبي حاتم حدثنا أبي حدثنا هشام بن عبيد الله الرازي عن محمد بن مسلم قال بلغنا أن البرق ملك له أربعة وجوه: وجه إنسان ووجه ثور ووجه نسر ووجه أسد فإذا مصع بذنبه فذاك البرق وقال الإمام أحمد حدثنا عفان حدثنا عبد الواحد بن زياد حدثنا الحجاج حدثنا أبو مطر عن سالم عن أبيه قال كان رسول الله صلى الله عليه وسلم إذا سمع الرعد والصواعق قال \" اللهم لا تقتلنا بغضبك ولا تهلكنا بعذابك وعافنا قبل ذلك \".ورواه الترمذي والبخاري في كتاب الأدب والنسائي في اليوم والليلة والحاكم في مستدركه من حديث الحجاج بن أرطاة عن أبي مطر ولم يسم به وقال الإمام أبو جعفر بن جرير حدثنا أحمد بن إسحاق حدثنا أبو أحمد حدثنا إسرائيل عن أبيه عن رجل عن أبي هريرة رفعه أنه كان إذا سمع الرعد قال \" سبحان من يسبح الرعد بحمده \".وروى عن علي رضي الله عنه أنه كان إذا سمع صوت الرعد يقول: سبحان من سبحت له.وكذا روى عن ابن عباس وطاوس والأسود بن يزيد أنهم كانوا يقولون كذلك وقال الأوزاعي كان ابن أبي زكريا يقول: من قال حين يسمع الرعد سبحان الله وبحمده لم تصبه صاعقة وعن عبد الله بن الزبير أنه كان إذا سمع الرعد ترك الحديث وقال: سبحان الذي يسبح الرعد بحمده والملائكة من خيفته ويقول إن هذا لوعيد شديد لأهل الأرض رواه مالك في موطئه والبخاري في كتاب الأدب وقال الإمام أحمد حدثنا سليمان بن داود الطيالسي حدثنا صدقة بن موسى حدثنا محمد بن واسع عن معمر بن نهار عن أبي هريرة أن رسول الله صلى الله عليه وسلم قال \" قال ربكم عز وجل لو أن عبيدي أطاعوني لأسقيتهم المطر بالليل وأطلعت عليهم الشمس بالنهار ولما أسمعتهم صوت الرعد \" وقال الطبراني حدثنا زكريا بن يحيى الساجي حدثنا أبو كامل الجحدري حدثنا يحيى بن كثير أبو النضر حدثنا عبد الكريم حدثنا عطاء عن ابن عباس قال: قال رسول الله صلى الله عليه وسلم \" إذا سمعتم الرعد فاذكروا الله فإنه لا يصيب ذاكرا\" وقوله تعالى \" ويرسل الصواعق فيصيب بها من يشاء \" أي يرسلها نقمة ينقم بها ممن يشاء ولهذا تكثر في آخر الزمان كما قال الإمام أحمد حدثنا محمد بن مصعب حدثنا عمارة عن أبي نضرة عن أبي سعيد الخدري رضي الله عنه أن النبي صلى الله عليه وسلم قال \" تكثر الصواعق عند اقتراب الساعة حتى يأتي الرجل القوم فيقول من صعق قبلكم الغداة فيقولون صعق فلان وفلان وفلان \" وقد روى في سبب نزولها ما رواه الحافظ أبو يعلى الموصلي حدثنا إسحق حدثنا علي بن أبي سارة الشيباني حدثنا ثابت عن أنس أن رسول الله صلى الله عليه وسلم بعث رجلا مرة إلى رجل من فراعنة العرب فقال \" اذهب فادعه لي \" قال فذهب إليه فقال يدعوك رسول الله صلى الله عليه وسلم فقال له من رسول الله ؟ وما الله ؟ أمن ذهب هو أم من فضة هو أم من نحاس هو ؟ قال فرجع إلى رسول الله صلى الله عليه وسلم فأخبره فقال يا رسول الله قد خبرتك أنه أعتى من ذلك قال لي كذا وكذا فقال لي \" ارجع إليه الثانية \" فذهب فقال له مثلها فرجع إلى رسول الله صلى الله عليه وسلم فقال يا رسول الله قد أخبرتك أنه أعتى من ذلك فقال \" ارجع إليه فادعه \" فرجع إليه الثالثة قال فأعاد عليه ذلك الكلام فبينما هو يكلمه إذ بعث الله عز وجل سحابة حيال رأت فرعدت فوقعت منها صاعقة فذهبت بقحف رأسه فأنزل الله عز وجل \" ويرسل الصواعق \" الآية ورواه ابن جرير من حديث علي بن أبي سارة به ورواه الحافظ أبو بكر البزار عن عبدة بن عبد الله عن يزيد بن هارون عن ديلم بن غزوان عن ثابت عن أنس فذكر فحوه وقال: حدثنا الحسن بن محمد حدثنا عفان حدثنا أبان بن يزيد حدثنا أبو عمران الجوني عن عبد الرحمن بن صحار العبدي أنه بلغه أن النبي صلى الله عليه وسلم بعثه إلى جبار يدعوه فقال أرأيتكم ربكم أذهب هو ؟ أم فضة هو ؟ أم لؤلو هو ؟ قال فبينما هو يجادلهم إذ بعث الله سحابة فرعدت فأرسل عليه صاعقة فذهبت بقحف رأسه ونزلت هذه الآية.وقال أبو بكر بن عياش عن ليث بن أبي سليم عن مجاهد قال جاء يهودي فقال يا محمد أخبرني عن ربك من أي شيء هو ؟ من نحاس هو أم من لؤلؤ أو ياقوت ؟ قال فجاءت صاعقة فأخذته وأنزل الله \" ويرسل الصواعق \" الآية وقال قتادة ذكر لنا أن رجل أنكر القرآن وكذب النبى صلى الله عليه وسلم فأرسل الله صاعقة فأهلكته وأنزل الله \" ويرسل الصواعق \" الآية وذكروا فى سبب نزولها قصة عامر بن الطفيل وأربد بن ربيعة لما قدما على رسول الله صلى الله عليه وسلم المدينة فسألاه أن يجعل لهما نصف الأمر فأبى عليهما رسول الله صلى الله عليه وسلم فقال له عامر بن الطفيل لعنه الله أما والله لأملأنها عليك خيلا جردا ورجالا مردا فقال له رسول الله صلى الله عليه وسلم \" يأبى الله عليك ذلك وأبناء قيلة \" يعني الأنصار ثم إنهما هما بالفتك برسول الله صلى الله عليه وسلم فجعل أحدهما يخاطبه والآخر يستل سيفه ليقتله من ورائه فحماه الله تعالى منهما وعصمه فخرجا من المدينة فانطلقا في أحياء العرب يجمعان الناس لحربه عليه الصلاة والسلام فأرسل الله على أربد سحابة فيها صاعقة فأحرقته وأما عامر بن الطفيل فأرسل الله عليه الطاعون فخرجت فيه غدة عظيمة فجعل يقول يا آل عامر غدة كغدة البكر وموت في بيت سلولية حتى ماتا لعنهما الله وأنزل الله في مثل ذلك \" ويرسل الصواعق فيصيب بها من يشاء وهم يجادلون في الله \" وفى ذلك يقول لبيد بن ربيعة أخو أربد يرثيه أخشى على أربد الحتوف ولا أرهب نوء السماك والأسد فجعني الرعد والصواعق بالـ ـفارس يوم الكريهة النجد وقال الحافظ أبو القاسم الطبراني: حدثنا مسعدة بن سعيد العطار حدثنا إبراهيم بن المنذر الخزامي حدثني عبد العزيز بن عمران حدثني عبد الرحمن وعبد الله ابن زيد بن أسلم عن أبيهما عن عطاء بن يسار عن ابن عباس أن أربد بن قيس بن حزم بن جليد بن جعفر بن كلاب وعامر بن الطفيل بن مالك قدما المدينة على رسول الله صلى الله عليه وسلم فانتهيا إليه وهو جالس فجلسا بين يديه فقال عامر بن الطفيل: يا محمد ما تجعل لي إن أسلمت ؟ فقال رسول الله صلى الله عليه وسلم \" لك ما للمسلمين وعليك ما عليهم \" قال عامر بن الطفيل أتجعل لي الأمر إن أسلمت من بعدك ؟ قال رسول الله صلى الله عليه وسلم \" ليس ذلك لك ولا لقومك ولكن لك أعنة الخيل \" قال أنا الآن فى أعنة خيل نجد اجعل لي الوبر ولك المدر قال رسول الله صلى الله عليه وسلم \" لا \" فلما قفلا من عنده قال عامر: أما والله لأملأنها عليك خيلا ورجالا فقال له رسول الله صلى الله عليه وسلم \" يمنعك الله \" فلما خرج أربد وعامر قال عامر: يا أربد أنا أشغل عنك محمدا بالحديث فاضربه بالسيف فإن الناس إذا قتلت محمدا لم يزيدوا على أن يرضوا بالدية ويكرهوا الحرب فنعطيهم الدية قال أربد: أفعل فأقبلا راجعين إليه فقال عامر: يا محمد قم معي أكلمك فقام معه رسول الله صلى الله عليه وسلم فجلسا إلى الجدار ووقف معه رسول الله صلى الله عليه وسلم يكلمه وسل أربد السيف فلما وضع يده على السيف يبست يده على قائم السيف فلم يستطع سل السيف فأبطأ أربد على عامر بالضرب فالتفت رسول الله صلى الله عليه وسلم فرأى أربد وما يصنع فانصرف عنهما فلما خرج عامر وأربد من عند رسول الله صلى الله عليه وسلم حتى إذا كان بالحرة - حرة راقم - نزلا فخرج إليهما سعد بن معاذ وأسيد بن حضر فقالا اشخصا يا عدوي الله لعنكما الله فقال عامر من هذا يا سعد ؟ قال هذا أسيد بن حضير العاتب فخرجا حتى إذا كانا بالرقم أرسل الله على أربد صاعقة فقتلته وخرج عامر حتى إذا كان بالخريم أرسل الله فرحة فأخذته فأدركه الليل في بيت امرأة من بني سلول فجعل يمس قرحته في حلقه ويقول غدة كغدة الجمل في بيت سلولية يرغب أن يموت في بيتها ثم ركب فرت فأحضره حتى مات عليه راجعا فأنزل الله فيهما \" الله يعلم ما تحمل كل أنثى -إلى قوله - وما لهم من دونه من وال \" قال المعقبات من أمر الله يحفظون محمدا صلى الله عليه وسلم ثم ذكر أربد وما قتله به فقال \" ويرسل الصواعق \" الآية وقوله \" وهم يجادلون في الله \" أي يشكون في عظمته وأنه لا إله إلا هو \" وهو شديد المحال \" قال ابن جرير: شديدة مماحلته في عقوبتة من طغى عليه وعتا وتمادى في كفره وهذه الأمة شبيهة بقوله \" ومكروا مكرا ومكربا مكرا وهم لا يشعرون فانظر كيف كان عاقبة مكرهم أنا دمرناهم وقومهم أجمعين \" وعن علي رضي الله عنه \" وهو شديد المحال \" أي شديد الأخذ وقال مجاهد شديد القوة."
    },
    {
      "ayah": 14,
      "surah": 13,
      "text": "قال علي بن أبى طالب رضي الله عنه \" له دعوة الحق \" قال التوحيد رواه ابن جرير وقال ابن عباس وقتادة ومالك عن محمد بن المنكدر \" له دعوة الحق \" لا إله إلا الله \" والذين يدعون من دونه \" الآية أي ومثل الذين يعبدون آلهة غير الله \" كباسط كفيه إلى الماء ليبلغ فاه \" قال علي بن أبي طالب كمثل الذي يتناول الماء من طرف البئر بيده وهو لا يناله أبدا بيده فكيف يبلغ فاه ؟ وقال مجاهد \" كباسط كفيه \" يدعو الماء بلسانه ويشير إليه فلا يأتيه أبدا وقيل المراد كقابض يده على الماء فإنه لا يحكم منه على شيء كما قال الشاعر: فإني وإياكم وشوقا إليكم كقابض ماء لم تسقه أنامله وقال الآخر: فأصبحت مما كان بيني وبينها من الود مثل القابض الماء باليد ومعنى هذا الكلام أن الذي يبسط يده إلى الماء إما قابضا وإما متناولا له من بعد كما أنه لا ينتفع بالماء الذي لم يصل إلى فيه الذي جعله محلا للشرب فكذلك هؤلاء المشركون الذين يعبدون مع الله إلها غيره لا ينتفعون بهم أبدا في الدنيا ولا في الآخرة ولهذا قال \" وما دعاء الكافرين إلا في ضلال \"."
    },
    {
      "ayah": 15,
      "surah": 13,
      "text": "يخبر تعالى عن عظمته وسلطانه الذي قهر كل شيء ودان له كل شيء ولهذا يسجد له كل شيء طوعا من المؤمنين وكرها على الكافرين \" وظلالهم بالغدو \" أي البكر \" والآصال \" وهو جمع أصيل وهو آخر النهار كقوله تعالى \" أولم يروا إلى ما خلق الله من شيء يتفيؤ ظلاله \"."
    },
    {
      "ayah": 16,
      "surah": 13,
      "text": "يقرر تعالى أنه لا إله إلا هو لأنهم معترفون بأنه هو الذي خلق السموات والأرض وهو ربها ومدبرها وهم مع هذا قد اتخذوا من دونه أولياء يعبدونهم وأولئك الآلهة لا تملك لا نفسها ولا لعابديها بطريق الأولى نفعا ولا ضرا أي لا تحصل لهم منفعة ولا تدفع عنهم مضرة فهل يستوي من عبد هذه الآلهة مع الله ومن عبد الله وحده لا شريك له فهو على نور من ربه ؟ ولهذا قال \" قل هل يستوي الأعمى والبصير أم هل تستوي الظلمات والنور أم جعلوا لله شركاء خلقوا كخلقه فتشابه الخلق عليهم \" أي أجعل هؤلاء المشركون مع الله آلهة تناظر الرب وتماثله في الخلق فخلقوا كخلقه فتشابه الخلق عليهم فلا يدرون أنها مخلوقة من مخلوق غيره أي ليس الأمر كذلك فإنه لا يتشابهه شيء ولا يماثله ولا ند له ولا عدل له ولا وزير له ولا ولد ولا صاحبة \" تعالى الله عن ذلك علوا كبيرا \" وإنما عبد هؤلاء المشركون معه آلهة هم معترفون أنها مخلوقة له عبيد له كما كانوا يقولون في تلبيتهم: لبيك لا شريك لك إلا شريكا هو لك تملكه وما ملك وكما أخبر تعالى عنهم في قوله \" ما نعبدهم إلا ليقربونا إلى الله زلفى \" فأنكر تعالى عليهم ذلك حيث اعتقدوا ذلك وهو تعالى لا يشفع أحد عنده إلا بإذنه \" ولا تنفع الشفاعة عنده إلا لمن أذن له \" \" وكم من ملك في السموات \" الآية وقال \" إن كل من في السموات والأرض إلا آتي الرحمن عبدا لقد أحصاهم وعدهم عدا وكلهم آتيه يوم القيامة فردا \" فإذا كان الجميع عبيدا فلم يعبد بعضهم بعضا بلا دليل ولا برهان بل مجرد الرأي والاختراع والابتداع ثم قد أرسل رسله من أولهم إلى آخرهم تزجرهم عن ذلك وتنهاهم عن عبادة من سوى الله فكذبوهم وخالفوهم فحقت عليهم كلمة العذاب لا محالة \" ولا يظلم ربك أحدا \"."
    },
    {
      "ayah": 17,
      "surah": 13,
      "text": "اشتملت هذه الآية الكريمة على مثلين مضروبين للحق في ثباته وبقائه والباطل في اضمحلاله وفنائه فقال تعالى \" أنزل من السماء ماء \" أي مطرا \" فسالت أودية بقدرها \" أي أخذ كل واحد بحسبه فهذا كبير وسع كثيرا من الماء وهذا صغير فوسع بقدره وهو إشارة إلى القلوب وتفاوتها فمنها ما يسع علما كثيرا ومنها ما لا يتسع لكثير من العلوم بل يضيق عنها \" فاحتمل السيل زبدا رابيا \" أي فجاء على وجه الماء الذي سال في هذه الأودية زبد عال عليه هذا مثل وقوله \" ومما يوقدون عليه في النار ابتغاء حلية أو متاع \" الآية هذا هو المثل الثاني هو ما يسبك في النار من ذهب أو فضة ابتغاء حلية أي ليجعل حلية أو نحاسا أو حديدا فيجعل متاعا فإنه يعلوه زبد منه كما يعلو ذلك زبد منه \" كذلك يضرب الله الحق والباطل \" أي إذا اجتمعا لا ثبات للباطل ولا دوام له كما أن الزبد لا يثبت مع الماء ولا مع الذهب والفضة ونحوهما مما يسبك فى النار بل يذهب ويضمحل ولهذا قال \" فأما الزبد فيذهب جفاء \" أى لا ينتفع به بل يتفرق ويتمزق ويذهب في جانبي الوادي ويعلق بالشجر وتنسفه الرياح وكذلك خبث الذهب والفضة والحديد والنحاس يذهب ولا يرجع منه شيء ولا يبقى إلا الماء وذلك الذهب ونحو ينتفع به ولهذا قال \" وأما ما ينفع الناس فيمكث في الأرض كذلك يضرب الله الأمثال \" كقوله تعالى \" وتلك الأمثال نضربها للناس وما يعقلها إلا العالمون \" وقال بعض السلف كنت إذا قرأت مثلا من القرآن فلم أفهمه بكيت على نفسي لأن الله تعالى يقول \" وما يعقلها إلا العالمون \" قال علي بن أبي طلحة عن ابن عباس في قوله تعالى \" أنزل من السماء ماء فسالت أودية بقدرها \" الآية هذا مثل ضربه الله احتملت منه القلوب على قدر يقينها وشكها فأما الشك فلا ينفع معه العمل وأما اليقين فينفع الله به أهله وهو قوله \" فأما الزبد \" وهو الشك \" فيذهب جفاء وأما ما ينفع الناس فيمكث في الأرض \" وهو اليقين وكما يجعل الحلى في النار فيؤخذ خالصه ويترك خبثه في النار فكذلك يقبل الله اليقين ويترك الشك وقال العوفي عن ابن عباس قوله \" أنزل من السماء ماء فسالت أودية بقدرها فاحتمل السيل زبدا رابيا \" يقول احتمل السيل ما في الوادي من عود ودمنة \" ومما يوقدون عليه في النار \" فهو الذهب والفضة والحلية والمتاع والنحاس والحديد فللنحاس والحديد خبث فجعل الله مثل خبثه كزبد الماء فأما ما ينفع الناس فالذهب والفضة وأما ما ينفع الأرض فما شربت من الماء فأنبتت فجعل ذاك مثل العمل الصالح يبقى لأهله والعمل السيء يضمحل عن أهله كما يذهب هذا الزبد وكذلك الهدى والحق جاءا من عند الله فمن عمل بالحق كان له وبقي كما بقي ما ينفع الناس في الأرض وكذلك الحديد لا يستطاع أن يعمل منه سكين ولا سيف حي يدخل في النار فتأكل خبثه ويخرج جيده فينتفع به فكذلك يضمحل الباطل فإذا كان يوم القيامة وأقيم الناس وعرضت الأعمال فيزيغ الباطل ويهلك وينتفع أهل الحق بالحق وهكذا روي في تفسيرها عن مجاهد والحسن البصري وعطاء وقتادة وغير واحد من السلف والخلف وقد ضرب سبحانه وتعالى في أول سورة البقرة للمنافقين مثلين ناريا ومائيا وهما قوله \" مثلهم كمثل الذي استوقد نارا فلما أضاءت ما حوله \" الآية ثم قال \" أو كصيب من السماء فيه ظلمات ورعد وبرق \" الآية وهكذا ضرب للكافرين في سورة النور مثلين \" أحدهما \"قوله \" والذين كفروا أعمالهما كسراب \" الآية والسراب إنما يكون في شدة الحر ولهذا جاء في الصحيحين فيقال لليهود يوم القيامة فما تريدون ؟ فيقولون أي ربنا عطشنا فاسقا فيقال ألا تردون ؟ فيردون النار فإذا هي كسراب يحطم بعضها بعضا ثم قال تعالى في المثل الآخر \" أو كظلمات في بحر لجي \" الآية وفي الصحيحين عن أبي موسى الأشعري رضي الله عنه أن رسول الله صلى الله عليه وسلم قال \" إن مثل ما بعثني الله به من الهدى والعلم كمثل غيث أصاب أرضا فكان منها طائفة قبلت الماء فأنبتت الكلأ والعشب الكثير وكانت منها أجادب أمسكت الماء فنفع الله بها الناس فشربوا ورعوا وسقوا وزرعوا وأصابت طائفة منها أخرى إنما هي قيعان لا تمسك ماء ولا تنبت كلأ فذلك مثل من فقه في دين الله ونفعه الله بما بعثني ونفع به فعلم وعلم ومثل من لم يرفع بذلك رأسا ولم يقبل هدى الله الذي أرسلت به \" فهذا مثل مائي.وقال في الحديث الآخر الذي رواه الإمام أحمد: حدثنا عبد الرزاق حدثنا معمر عن همام بن منبه قال: هذا ما حدثنا أبو هريرة عن رسول الله صلى الله عليه وسلم أنه قال \" مثلي ومثلكم كمثل رجل استوقد نارا فلما أضاءت ما حولها جعل الفراش وهذه الدواب التي يقعن في النار يقعن فيها وجعل يحجزهن ويغلبنه فيقتحمن فيها - قال - فذلكم مثلي ومثلكم أنا آخذ بحجزكم عن النار هلم عن النار فتغلبوني فتقتحمون فيها \" وأخرجاه في الصحيحين أيضا فهذا مثل ناري."
    },
    {
      "ayah": 18,
      "surah": 13,
      "text": "يخبر تعالى عن مآل السعداء والأشقياء فقال \" للذين استجابوا لربهم \" أي أطاعوا الله ورسوله وانقادوا لأوامرهم وصدقوا أخباره الماضية والآتية فلهم \" الحسنى \" وهو الجزاء الحسن كقوله تعالى مخبرا عن ذي القرنين أنه قال \" أما من ظلم فسوف نعذبه ثم يرد إلى ربه فيعذبه عذابا نكرا وأما من آمن وعمل صالحا فله جزاء الحسنى وسنقول له من أمرنا يسرا \" وقال تعالى \" للذين أحسنوا الحسنى وزيادة \" وقوله \" والذين لم يستجيبوا له \" أي لم يطيعوا الله \" لو أن لهم ما في الأرض جميعا \" أي في الدار الآخرة لو أن يمكنهم أن يفتدوا من عذاب الله بملء الأرض ذهبا ومثله معه لافتدوا به ولكن لا يقبل منهم لأنه تعالى لا يقبل منهم يوم القيامة صرفا ولا عدلا \" أولئك لهم سوء الحساب \" أي في الدار الآخرة أي يناقشون على النقير والقطمير والجليل والحقير ومن نوقش الحساب عذب ولهذم قال \" ومأواهم جهنم وبئس المهاد \"."
    },
    {
      "ayah": 19,
      "surah": 13,
      "text": "يقول تعالى: لا يستوي من يعلم من الناس أن الذي \" أنزل إليك \" يا محمد \" من ربك \" هو الحق الذي لا شك فيه ولا مرية ولا لبس فيه ولا اختلاف فيه بل هو كله حق يصدق بعضه بعضا لا يضاد شيء منه شيئا آخر فأخباره كلها حق وأوامره ونواهيه عدل كما قال تعالى \" وتمت كلمة ربك صدقا وعدلا \" أي صدقا في الإخبار وعدلا في الطلب فلا يستوي من تحقق صدق ما جئت به يا محمد ومن هو أعمى لا يهتدي إلى خير ولا يفهمه ولو فهمه ما انقاد له ولا صدقه ولا اتبعه كقوله تعالى \" لا يستوي أصحاب النار وأصحاب الجنة أصحاب الجنة هم الفائزون \" وقال في هذه الآية الكريمة \" أفمن يعلم أنما أنزل إليك من ربك الحق كمن هو أعمى \" أي أفهذا كهذا ؟ لا استواء وقوله \" إنما يتذكر أولو الألباب \" أي إنما يتعظ ويعتبر ويعقل أولو العقول السليمة الصحيحة جعلنا الله مثهم."
    },
    {
      "ayah": 2,
      "surah": 13,
      "text": "يخبر الله تعالى عن كمال قدرته وعظيم سلطانه أنه الذي بإذنه وأمره رفع السموات بغير عمد بل بإذنه وأمره وتسخيره رفعها عن الأرض بعدا لا تنال ولا يدرك مداها فالسماء الدنيا محيطة بجميع الأرض وما حولها من الماء والهواء من جميع نواحيها وجهاتها وأرجائها مرتفعة عليها من كل جانب على السواء وبعد ما بينها وبين الأرض من كل ناحية مسيرة خمسمائة عام وسمكها في نفسها مسيرة خمسمائة عام ثم السماء الثانية محيطة بالسماء الدنيا وما حوت وبينهما من بعد المسير خمسمائة عام وسمكها خمسمائة عام.وهكذا الثالثة والرابعة والخامسة والسادسة والسابعة كما قال تعالى \" الله الذي خلق سبع سموات ومن الأرض مثلهن \" الآية وفي الحديث \" ما السموات السبع وما فيهن وما بينهن في الكرسي إلا كحلقة ملقاة بأرض فلاة والكرسي في العرش المجيد كتلك الحلقة في تلك الفلاة \" وفي رواية \" والعرش لا يقدر قدره إلا الله عز وجل \" وجاء عن بعض السلف أن بعد ما بين العرش إلى الأرض مسيرة خمسين ألف سنة وبعد ما بين قطريه مسيرة خمسين ألف سنة وهو من ياقوتة حمراء وقوله \" بغير عمد ترونها \" روى عن ابن عباس ومجاهد والحسن وقتادة وغير واحد أنهم قالوا لها عمد ولكن لا ترى وقال إياس بن معاوية السماء على الأرض مثل القبة يعني بلا عمد وكذا روى عن قتادة وهذا هو اللائق بالسياق والظاهر من قوله تعالى \" ويمسك السماء أن تقع على الأرض إلا بإذنه\" فعلى هذا يكون قوله \" ترونها \" تأكيدا لنفي ذلك أي هي مرفوعة بغير عمد كما ترونها وهذا هو الأكمل في القدرة وفي شعر أمية بن أبي الصلت آمن شعره وكفر قلبه كما ورد فى الحديث ويروى لزيد بن عمرو بن نفيل رضي الله عنه وأنت الذي من فضل من ورحمة بعثت إلى موسى رسولا مناديا فقلت له فاذهب وهارون فادعوا إلى الله فرعون الذي كان طاغيا وقولا له هل أنت سويت هذه بلا وتد حتى استقلت كما هيا وقولا له أنت رفعت هذه بلا عمد أو فوق ذلك بانيا وقولا له هل أنت سويت وسطها منيرا إذا ما جنك الليل هاديا وقولا له من يرسل الشمس غدوة فيصبح ما مست من الأرض ضاحيا قولا له من أنبت الحب في الثرى فيصبح منه العشب يهتز رابيا ويخرج منه حبه في رءوسه في ذاك آيات لهن كان واعيا وقوله تعالى \" ثم استوى على العرش \" تقدم تفسيره في سورة الأعراف وأنه يمر كما جاء من غير تكييف ولا تشبيه ولا تعطيل ولا تمثيل تعالى الله علوا كبيرا وقوله \" وسخر الشمس والقمر كل يجري لأجل مسمى \" قيل المراد أنهما يجريان إلى انقطاعهما بقيام الساعة كقوله تعالى \" والشمس تجري لمستقر لها\" وقيل المراد إلى مستقرهما وهو تحت العرش مما يلي بظن الأرض من الجانب الآخر فإنهما وسائر الكواكب إذا وصلوا هنالك يكونون أبعد ما يكون عن العرش لأنه على الصحيح الذي تقوم عليه الأدلة قبة مما يلي العالم من هذا الوجه وليس بمحيط كسائر الأفلاك لأن له قوائم وحملة يحملونه ولا يتصور هذا في الفلك المستدير وهذا واضح لمن تدبر ما وردت به الآيات والأحاديث الصحيحة ولله الحمد والمنة وذكر الشمس والقمر لأنهما أظهر الكواكب السيارة السبعة التي هي أشرف وأعظم من الثوابت فإذا كان قد سخر هذه فلأن يدخل في التسخير سائر الكواكب بطريق الأولى والأحرى كما نبه بقوله تعالى \" لا تسجدوا للشمس ولا للقمر واسجدوا لله الذي خلقهن إن كنتم إياه تعبدون \" مع أنه قد صرح بذلك بقوله \" والشمس والقمر والنجوم مسخرات بأمره ألا له الخلق والأمر تبارك الله رب العالمين \" وقوله \" يفصل الآيات لعلكم بلقاء ربكم توقنون \" أي يوضح الآيات والدلالات الدالة على أنه لا إله إلا هو وأنه يعيد الخلق إذا شاء كما بدأه."
    },
    {
      "ayah": 20,
      "surah": 13,
      "text": "يقول تعالى مخبرا عمن اتصف بهذه الصفات الحميدة بأن لهم عقبى الدار وهي العاقبة والنصرة في الدنيا والآخرة \" الذين يوفون بعهد الله ولا ينقضون الميثاق \" وليسوا كالمنافقين الذين إذا عاهد أحدهم غدر وإذا خاصم فجز وإذا حدث كذب وإذا ائتمن خان."
    },
    {
      "ayah": 21,
      "surah": 13,
      "text": "من صلة الأرحام والإحسان إليهم وإلى الفقراء والمحاويج وبذل المعروف \" ويخشون ربهم \" أي فيما يأتون وما يذرون من الأعمال يراقبون الله في ذلك ويخافون سوء الحساب في الدار الآخرة فلهذا أمرهم على السداد والاستقامة في جميع حركاتهم وسكناتهم وجميع أحوالهم القاصرة والمتعدية."
    },
    {
      "ayah": 22,
      "surah": 13,
      "text": "والذين صبروا ابتغاء وجه ربهم \" أي عن المحارم والمآثم ففطموا أنفسهم عنها لله عز وجل ابتغاء مرضاته وجزيل ثوابه \" وأقاموا الصلاة \" بحدودها ومواقيتها وركوعها وسجودها وخشوعها على الوجه الشرعي المرضي \" وأنفقوا مما رزقناهم \" أي على الذين يجب عليهم الإنفاق لهم من زوجات وقرابات وأجانب من فقراء ومحاويج ومساكين \" سرا وعلانية \" أي في السر والجهر لم يمنعهم من ذلك حال من الأحوال آناء الليل وأطراف النهار \" ويدرءون بالحسنة السيئة \" أي يدفعون القبيح بالحسن فإذا آذاهم أحد قابلوه بالجميل صبرا واحتمالا وصفحا وعفوا كقوله تعالى \" ادفع بالتي هي أحسن فإذا الذي بينك وبينه عداوة كأنه ولي حميم وما يلقاها إلا الذين صبروا وما يلقاها إلا ذو حظ عظيم \" ولهذا قال مخبرا عن هؤلاء السعداء المتصفين بهؤلاء الصفات الحسنة بأن لهم عقبى الدار."
    },
    {
      "ayah": 23,
      "surah": 13,
      "text": "جنات عدن \" والعدن الإقامة أي جنات إقامة يخلدون فيها وعن عبد الله بن عمرو أنه قال: إن في الجنة قصرا يقال له عدن حوله البروج والمروج فيه خمسة آلاف باب على كل باب خمسة آلاف حبرة لا يدخله إلا نبي أو صديق أو شهيد وقال الضحاك في قوله \" جنات عدن \" مدينة الجنة فيها الرسل والأنبياء والشهداء وأئمة الهدى والناس حولهم بعد والجنات حولها رواهما ابن جرير.وقوله \" ومن صلح من آبائهم وأزواجهم وذرياتهم \" أي يجمع بينهم وبين أحبابهم فيها من الآباء والأهلين والأبناء ممن هو صالح له د خول الجنة من المؤمنين لتقر أعينهم بهم حتى أنه ترفع درجة الأدنى إلى درجة الأعلى امتنانا من الله وإحسانا من غير تنقيص للأعلى عن درجته كما قال تعالى \" والذين آمنوا واتبعتهم ذريتهم بإيمان ألحقنا بهم ذريتهم \" الآية وقوله \" والملائكة يدخلون عليهم من كل باب سلام عليكم بما صبرتم فنعم عقبى الدار \" أي وتدخل عليهم الملائكة من ههنا ومن ههنا للتهنئة بدخول الجنة فعند دخولهم إياها تفد عليهم الملائكة مسلمين مهنئين لهم بما حصل لهم من الله من التقريب والإنعام والإقامة في دار السلام في جوار الصديقين والأنبياء والرسل الكرام ; وقال الإمام أحمد رحمه الله: حدثنا أبو عبد الرحمن حدثني سعيد بن أبي أيوب حدثنا معروف بن سويد الحراني عن أبي عشانة المعافري عن عبد الله بن عمرو بن العاص رضي الله عنهما عن رسول الله صلى الله عليه وسلم أنه قال \" هل تدرون أول من يدخل الجنة من خلق الله ؟ \" قالوا الله ورسوله أعلم قال \" أول من يدخل الجنة من خلق الله الفقراء المهاجرون الذين تسد بهم الثغور وتتقى بهم المكاره ويموت أحدهم وحاجته في صدره لا يستطيع لها قضاء فيقول الله تعالى لمن يشاء من ملائكته: ائتوهم فحيوهم فتقول الملائكة نحن سكان سمائك وخيرتك من خلقك أفتأمرنا أن نأتي هؤلاء ونسلم عليهم ؟ فيقول إنهم كانوا عبادا يعبدونني لا يشركون بي شيئا وتسد بهم الثغور وتتقى بهم المكاره ويموت أحدهم وحاجته في صدره لا يستطيع لها قضاء - قال - فتأتيهم الملائكة عند ذلك فيدخلون عليهم من كل باب \" سلام عليكم بما صبرتم فنعم عقبى الدار \" ورواه أبو القاسم الطبراني عن أحمد بن رشدين عن أحمد بن صالح عن عبد الله بن وهب عن عمر بن الحارث عن أبي عشانة سمع عبد الله بن عمرو عن النبي صلى الله عليه وسلم قال \" أول ثلة يدخلون الجنة فقراء المهاجرين الذين تتقى بهم المكاره وإذا أمروا سمعوا وأطاعوا وإن كانت لرجل منهم حاجة إلى سلطان لم تقض حتى يموت وهي في صدره وإن الله يدعو يوم القيامة الجنة فتأتى بزخرفها وزينتها فيقول أين عبادي الذين قاتلوا في سبيلي وأوذوا في سبيلي وجاهدوا في سبيلي ؟ ادخلوا الجنة بغير عذاب ولا حساب وتأتي الملائكة فيسجدون ويقولون ربنا نحن نسبح بحمدك الليل والنهار ونقدس لك هؤلاء الذين آثرتهم علينا ؟ فيقول الرب عز وجل هؤلاء عبادي الذين جاهدوا في سبيلي وأوذوا في سبيلي فتدخل عليهم الملائكة من كل باب:\" سلام عليكم بما صبرتم فنعم عقبى الدار \" وقال عبد الله بن المبارك عن بقية بن الوليد حدثنا أرطاة بن المنذر سمعت رجلا من مشيخة الجند يقال له أبو الحجاج يقول: جلست إلى أبى أمامة فقال: إن المؤمن ليكون متكئا على أريكته إذا دخل الجنة وعنده سماطان من خدم وعند طرف السماطين باب مبوب فيقبل الملك فيستأذن فيقول للذي يليه ملك يستأذن ويقول الذي يليه للذي يليه ملك يستأذن حتى يبلغ المؤمن فيقول ائذنوا فيقول أقربهم للمؤمن ائذنوا له ويقول الذي يليه للذي يليه ائذنوا له حتى يبلغ أقصاهم الذي عند الباب فيفتح له فيدخل فيسلم ثم ينصرف رواه ابن جرير ورواه ابن أبي حاتم من حديث إسماعيل بن عياش عن أرطاة بن المنذر عن أبي الحجاج يوسف الألهاني قال: سمعت أبا أمامة فذكر نحوه وقد جاء في الحديث أن رسول الله صلى الله عليه وسلم كان يزور قبور الشهداء في رأس كل حول فيقول لهم: \" سلام عليكم بما صبرتم فنعم عقبى الدار \" وكذلك أبو بكر وعمر وعثمان."
    },
    {
      "ayah": 24,
      "surah": 13,
      "text": "سلام عليكم بما صبرتم فنعم عقبى الدارجنات عدن \" والعدن الإقامة أي جنات إقامة يخلدون فيها وعن عبد الله بن عمرو أنه قال : إن في الجنة قصرا يقال له عدن حوله البروج والمروج فيه خمسة آلاف باب على كل باب خمسة آلاف حبرة لا يدخله إلا نبي أو صديق أو شهيد وقال الضحاك في قوله \" جنات عدن \" مدينة الجنة فيها الرسل والأنبياء والشهداء وأئمة الهدى والناس حولهم بعد والجنات حولها رواهما ابن جرير . وقوله \" ومن صلح من آبائهم وأزواجهم وذرياتهم \" أي يجمع بينهم وبين أحبابهم فيها من الآباء والأهلين والأبناء ممن هو صالح له دخول الجنة من المؤمنين لتقر أعينهم بهم حتى أنه ترفع درجة الأدنى إلى درجة الأعلى امتنانا من الله وإحسانا من غير تنقيص للأعلى عن درجته كما قال تعالى \" والذين آمنوا واتبعتهم ذريتهم بإيمان ألحقنا بهم ذريتهم \" الآية وقوله \" والملائكة يدخلون عليهم من كل باب سلام عليكم بما صبرتم فنعم عقبى الدار \" أي وتدخل عليهم الملائكة من هاهنا ومن هاهنا للتهنئة بدخول الجنة فعند دخولهم إياها تفد عليهم الملائكة مسلمين مهنئين لهم بما حصل لهم من الله من التقريب والإنعام والإقامة في دار السلام في جوار الصديقين والأنبياء والرسل الكرام ; وقال الإمام أحمد رحمه الله : حدثنا أبو عبد الرحمن حدثني سعيد بن أبي أيوب حدثنا معروف بن سويد الحراني عن أبي عشانة المعافري عن عبد الله بن عمرو بن الجنيد رضي الله عنهما عن رسول الله صلى الله عليه وسلم أنه قال \" هل تدرون أول من يدخل الجنة من خلق الله ؟ \" قالوا الله ورسوله أعلم قال\" أول من يدخل الجنة من خلق الله الفقراء المهاجرون الذين تسد بهم الثغور وتتقى بهم المكاره ويموت أحدهم وحاجته في صدره لا يستطيع لها قضاء فيقول الله تعالى لمن يشاء من ملائكته : ائتوهم فحيوهم فتقول الملائكة نحن سكان سمائك وخيرتك من خلقك أفتأمرنا أن نأتي هؤلاء ونسلم عليهم ؟ فيقول إنهم كانوا عبادا يعبدونني لا يشركون بي شيئا وتسد بهم الثغور وتتقى بهم المكاره ويموت أحدهم وحاجته في صدره لا يستطيع لها قضاء - قال - فتأتيهم الملائكة عند ذلك فيدخلون عليهم من كل باب\" سلام عليكم بما صبرتم فنعم عقبى الدار \" ورواه أبو القاسم الطبراني عن أحمد بن رشدين عن أحمد بن صالح عن عبد الله بن وهب عن عمر بن الحارث عن أبي عشانة سمع عبد الله بن عمرو عن النبي صلى الله عليه وسلم قال \" أول ثلة يدخلون الجنة فقراء المهاجرين الذين تتقى بهم المكاره وإذا أمروا سمعوا وأطاعوا وإن كانت لرجل منهم حاجة إلى سلطان لم تقض حتى يموت وهي في صدره وإن الله يدعو يوم القيامة الجنة فتأتي بزخرفها وزينتها فيقول أين عبادي الذين قاتلوا في سبيلي وأوذوا في سبيلي وجاهدوا في سبيلي ؟ ادخلوا الجنة بغير عذاب ولا حساب وتأتي الملائكة فيسجدون ويقولون ربنا نحن نسبح بحمدك الليل والنهار ونقدس لك هؤلاء الذين آثرتهم علينا ؟ فيقول الرب عز وجل هؤلاء عبادي الذين جاهدوا في سبيلي وأوذوا في سبيلي فتدخل عليهم الملائكة من كل باب : \" سلام عليكم بما صبرتم فنعم عقبى الدار\" وقال عبد الله بن المبارك عن بقية بن الوليد حدثنا أرطاة بن المنذر سمعت رجلا من مشيخة الجند يقال له أبو الحجاج يقول : جلست إلى أبى أمامة فقال : إن المؤمن ليكون متكئا على أريكته إذا دخل الجنة وعنده سماطان من خدم وعند طرف السماطين باب مبوب فيقبل الملك فيستأذن فيقول للذي يليه ملك يستأذن ويقول الذي يليه للذي يليه ملك يستأذن حتى يبلغ المؤمن فيقول ائذنوا فيقول أقربهم للمؤمن ائذنوا له ويقول الذي يليه للذي يليه ائذنوا له حتى يبلغ أقصاهم الذي عند الباب فيفتح له فيدخل فيسلم ثم ينصرف رواه ابن جرير ورواه ابن أبي حاتم من حديث إسماعيل بن عياش عن أرطاة بن المنذر عن أبي الحجاج يوسف الألهاني قال : سمعت أبا أمامة فذكر نحوه وقد جاء في الحديث أن رسول الله صلى الله عليه وسلم كان يزور قبور الشهداء في رأس كل حول فيقول لهم : \" سلام عليكم بما صبرتم فنعم عقبى الدار \" وكذلك أبو بكر وعمر وعثمان ."
    },
    {
      "ayah": 25,
      "surah": 13,
      "text": "هذا حال الأشقياء وصفاتهم وذكر ما لهم في الآخرة ومصيرهم إلى خلاف ما صار إليه المؤمنون كما أنهم اتصفوا بخلاف صفاتهم في الدنيا فأولئك كانوا يوفون بعهد الله ويصلون ما أمر الله به أن يوصل وهؤلاء \" ينقضون عهد الله من بعد ميثاقه ويقطعون ما أمر الله به أن يوصل ويفسدون فى الأرض \" كما ثبت في الحديث \" آية المنافق ثلاث: إذا حدث كذب وإذا وعد أخلف وإذا اؤتمن خان \" وفي رواية \" وإذا ما هد غدر وإذا خاصم فجر \" ولهذا قال \" أولئك لهم اللعنة \" وهي الإبعاد عن الرحمة \" ولهم سوء الدار \" وهي سوء العاقبة والمآل \" ومأواهم جهنم وبئس المهاد \" وقال أبو العالية في قوله تعالى \" والذين ينقضون عهد الله \" الآية قال هى ست خصال في المنافقين إذا كان فيهم الظهرة على الناس أظهروا هذه الخصال إذا حدثوا كذبوا وإذا وعدوا أخلفوا وإذا ائتمنوا خانوا ونقضوا عهد الله من بعد ميثاقه وقطعوا ما أمر الله به أن يوصل وأفسدوا في الأرض وإذا كانت الظهرة عليهم أظهروا الثلاث الخصال: إذا حدثوا كذبوا وإذا وعدوا أخلفوا وإذا ائتمنوا خانوا."
    },
    {
      "ayah": 26,
      "surah": 13,
      "text": "يذكر تعالى أنه هو الذي يوسع الرزق على من يشاء ويقتر على من يشاء لما له في ذلك من الحكمة والعدل وفرح هؤلاء الكفار بما أوتوا من الحياة الدنيا استدراجا لهم وإمهالا كما قال \" أيحسبون أنما نمدهم به من مال وبنين نسارع لهم في الخيرات بل لا يشعرون \" ثم حقر الحياة الدنيا بالنسبة إلى ما ادخره تعالى لعباده المؤمنين في الدار الآخرة فقال \" وما الحياة الدنيا في الآخرة إلا متاع \" كما قال \" قل متاع الدنيا قليل والآخرة خير لمن اتقى ولا تظلمون فتيلا \" وقال \" بل تؤثرون الحياة الدنيا والآخرة خير وأبقى \" وقال الإمام أحمد: حدثنا وكيع عن يحيى بن سعيد قالا: حدثنا إسماعيل بن أبي خالد عن قيس عن المستورد أخي بني فهره قال: قال رسول الله صلى الله عليه وسلم \" ما الدنيا في الآخرة إلا كما يجعل أحدكم أصبعه هذه فى اليم فلينظر بم ترجع \" وأشار بالسبابة رواه مسلم في صحيحه وفي الحديث الآخر أن رسول الله صلى الله عليه وسلم مر بجدي أسك ميت والأسك الصغير الأذنين فقال \" والله للدنيا أهون على الله من هذا على أهله حين ألقوه \"."
    },
    {
      "ayah": 27,
      "surah": 13,
      "text": "يخبر تعالى عن قيل المشركين \" لولا\" أي هلا \" أنزل عليه آية من ريه \" كقولهم \" فليأتنا بآية كما أرسل الأولون \" وقد تقدم الكلام على هذا غير مرة وإن الله قادر على إجابة ما سألوا وفي الحديث إن الله أوحى إلى رسوله لما سألوه أن يحول لهم الصفا ذهبا وأن يجري لهم ينبوعا وأن يزيح الجبال من حول مكة فيصير مكانها مروج وبساتين: إن شئت يا محمد أعطيتهم ذلك فإن كفروا أعذبهم عذابا لا أعذبه أحدا من العالمين وإن شئت فتحت عليهم باب التوبة والرحمة فقال \" بل تفتح لهم باب التوبة والرحمة \" ولهذا قال لرسوله \" قل إن الله يضل من يشاء ويهدي إليه من أناب \" أي هو المضل والهادي سواء بعث الرسل بآية على وفق ما اقترحوا أو لم يجبهم إلى سؤالهم فان الهداية والإضلال ليس منوطا بذلك ولا عدمه كما قال \" وما تغني الآيات والنذر عن قوم لا يؤمنون \" وقال \" إن الذين حقت عليهم كلمة ربك لا يؤمنون ولو جاءتهم كل أية حتى يروا العذاب الأليم \" وقال \" ولو أننا نزلنا إليهم الملائكة وكلمهم الموتى وحشرنا عليهم كل شيء قبلا ما كانوا ليؤمنوا إلا أن يشاء الله ولكن أكثرهم يجهلون \" ولهذا قال \" قل إن الله يضل من يشاء ويهدي إليه من أناب \" أي ويهدي إليه من أناب إلى الله."
    },
    {
      "ayah": 28,
      "surah": 13,
      "text": "أي تطيب وتركن إلى جانب الله وتسكن عند ذكره وترضى به مولى ونصيرا ولهذا قال \" ألا بذكر الله تطمئن القلوب \"."
    },
    {
      "ayah": 29,
      "surah": 13,
      "text": "قال ابن أبي طلحة عن ابن عباس فرح وقرة عين. وقال عكرمة نعم مالهم وقال الضحاك غبطة لهم وقال إبراهيم النخعي خير لهم ; وقال قتادة هي كلمة عربية يقول الرجل طوبى لك أي أصبت خيرا وقال في رواية: طوبى لهم حسنى لهم \" وحسن مآب \" أي مرجع وهذه الأقوال شيء واحد لا مناقاة بينها وقال سعيد بن جبير عن ابن عباس \" طوبى لهم \" قال هي أرض الجنة بالحبشية وقال سعيد بن مسجوع طوبى اسم الجنة بالهندية وكذا روى السدي عن عكرمة طوبى لهم أي الجنة وبه قال مجاهد وقال العوفي عن ابن عباس لما خلق الله الجنة وفرغ منها قال \" الذين آمنوا وعملوا الصالحات طوبى لهم وحسن مآب \" وذلك حين أعجبته. وقال ابن جرير: حدثنا ابن حميد حدثنا يعقوب عن جعفر عن شهر بن حوشب قال: طوبى شجرة في الجنة كل شجر الجنة منها أغصانها من وراء سور الجنة وهكذا روي عن أبي هريرة وأبن عباس ومغيث بن سليمان وأبي إسحق السبيعي وغير واحد من السلف أن طوبى شجرة في الجنة في كل دار منها غصن منها وذكر بعضهم أن الرحمن تبارك وتعالى غرسها بيده من حبة لؤلؤة وأمرها أن تمتد فامتدت إلى حديث يشاء الله تبارك وتعالى وخرجت من أصلها ينابيع أنهار الجنة من عسل وخمر وماء ولبن وقد قال عبد الله بن وهب: حدثنا عمرو بن الحارث أن دراجا أبا السمح حدثه عن أبي الهيثم عن أبي سعيد الخدري مرفوعا \" طوبى شجرة في الجنة مسيرة مائة سنة ثياب أهل الجنة تخرج من أكمامها \".وقال الإمام أحمد: حدثنا حسن بن موسى سمعت عبد الله بن لهيعة حدما دراج أبو السمح أن أبا الهيثم حدثه عن أبي سعيد الخدري عن رسول الله صلى الله عليه وسلم أن رجلا قال: يا رسول الله طوبى ليمن رآك وآمن بك قال \" طوبى لمن رآني وآمن بي وطوبى ثم طوبى ثم طوبى لمن آمن بي ولم يرني \" قال له رجل: وما طوبى ؟ قال \" شجرة في الجنة مسيرتها مائة عام ثياب أهل الجنة تخرج من أكمامها \" وروى البخاري ومسلم جميعا عن إسحاق بن راهويه عن مغيرة المخزومي عن وهيب عن أبي حازم عن سهل بن سعد رضي الله عنه أن رسول الله صلى الله عليه وعلى آله وسلم قال \" وإن في الجنة شجرة يسير الراكب في ظلها مائة عام لا يقطعها \" قال فحدثت به النعمان بن أبي عياش الزرقي فقال: حدثني أبو سعيد الخدري عن النبي صلى الله عليه وعلى آله وسلم قال \" إن في الجنة شجرة يسير الراكب الجواد المضمر السريع مائة عام لا يقطعها \" وفي صحيح البخاري من حديث يزيد بن زريع عن سعيد عن قتادة عن أنس رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم فى قول الله تعالى \" وظل ممدود \" قال \" في الجنة شجرة يسير الراكب في ظلها مائة عام لا يقطعها \" وقال الإمام أحمد: حدثنا شريح حدثنا فلح عن هلال بن علي عن عبد الرحمن بن أبي عمرة عن أبي هريرة قال: قال رسول الله صلى الله عليه وسلم \" في الجنة شجرة يسير الراكب في ظلها مائة سنة اقرءوا إن شئتم \" وظل ممدود \" أخرجاه في الصحيحين وفى لفظ لأحمد أيضا حدثنا محمد بن جعفر وحجاج قالا: حدثنا شعبة سمعت أبا الضحاك يحدث عن أبي هريرة عن النبي صلى الله عليه وسلم أنه قال \" إن في الجنة شجرة يسير الراكب في ظلها سبعين - أو مائة سنة - هي شجرة الخلد \" وقال محمد بن إسحاق عن يحيى بن عباد بن عبد الله بن الزبير عن أبيه عن أسماء بنت أبي بكر رضي الله عنه قالت: سمعت رسول الله صلى الله عليه وسلم ذكر سدرة المنتهى فقال \" يسير في ظل الغصن منها الراكب مائة سنة - أو قال - يستظل في الفنن منها مائة راكب فيها فراش الذهب كأن ثمرها القلال \" رواه الترمذي.وقال إسماعيل بن عياش عن سعيد بن يوسف عن يحيى بن أبي كثير عن أبي سلام الأسود قال: سمعت أبا أمامة الباهلي قال: قال رسول الله صلى الله عليه وسلم \" ما منكم من أحد يدخل الجنة إلا انطلق به إلى طوبى فتفتح له أكمامها فيأخذ من أي ذلك شاء إن شاء أبيض وإن شاء أحمر وإن شاء أصفر وإن شاء أسود مثل شقائق النعمان وأرق وأحسن \" وقال الإمام أبو جعفر بن جرير: حدثنا محمد بن عبد الأعلى حدثنا محمد بن ثور عن معمر عن أشعث بن عبد الله عن شهر بن حوشب عن أبي هريرة رضي الله عنه قال: طوبى شجرة فى الجنة يقول الله لها تفتقي لعبدي عما شاء فتفتق له عن الخيل بسروجها ولجمها وعن الإبل بأزمتها وعما شاء من الكسوة وقد روى ابن جرير عن وهب بن منبه ههنا أثرا غريبا عجيبا قال وهب رحمه الله: إن في الجنة شجرة يقال لها طوبى يسير الراكب في ظلها مائة عام لا يقطعها زهرها رياط وورقها برود وقضبانها عنبر وبطحاؤها ياقوت وترابها كافور ووحلها مسك يخرج من أصلها أنهار الخمر واللبن والعسل وهي مجلس لأهل الجنة فبينما هم في مجلسهم إذ أتتهم ملائكة من ربهم يقودون نجبا مزمومة بسلاسل من ذهب وجوهها كالمصابيح حسنا ووبرها كخز المرعزي من لينه عليها رحال ألواحها من ياقوت ودفوفها من ذهب وثيابها من سندس وإستبرق فيفتحونها يقولون إن ربنا أرسلنا إليكم لتزوروه وتسلموا عليه قال فيركبونها فهي أسرع من الطائر وأوطأ من الفراش نجبا من غير مهنة يسير الرجل إلى جنب أخيه وهو يكلمه ويناجيه لا تصيب أذن راحلة منها أذن الأخرى ولا برك راحلة برك الأخرى حتى إن الشجرة لتتنحى عن طريقهم لئلا تفرق بين الرجل وأخيه قال فيأتون إلى الرحمن الرحيم فيسفر لهم عن وجهه الكريم حتى ينظروا إليه فإذا رأوه قالوا: اللهم أنت السلام ومنك السلام وحق لك الجلال والإكرام قال فيقول تعالى عند ذلك: أنا السلام ومني السلام وعليكم حقت رحمتي ومحبتي مرحبا بعبادي الذين خشوني بغيب وأطاعوا أمري قال فيقولون ربنا لم نعبدك حق عبادتك ولم نقدرك حق قدرك فائذن لنا فى السجود قدامك قال فيقول الله إنها ليست بدار نصب ولا عبادة ولكنها دار ملك ونعيم وإني قد رفعت عنكم نصب العبادة فسلوني ما شئتم فإن لكل رجل منكم أمنيته فيسألونه حتى أن أقصرهم أمنية ليقول ربي تنافس أهل الدنيا في دنياهم فتضايقوا فيها رب فأتني مثل كل شيء كانوا فيه من يوم خلقتها إلى أن انتهت الدنيا فيقول الله تعالى لقد قصرت بك أمنيتك ولقد سألت دون منزلتك هذا لك مني لأنه ليس في عطائي نكد ولا قصر يد قال ثم يقول أعرضوا على عبادي ما لم يبلغ أمانيهم ولم يخطر لهم على بال قال فيعرضون عليهم حتى تقصر بهم أمانيهم التي في أنفسهم فيكون فيما يعرضون عليهم براذين مقرنة على كل أربعة منها سرير من ياقوته واحدة على كل سرير منها قبة من ذهب مفرغة في كل قبة منها فرش من فرش الجنة متظاهرة في كل قبة منها جاريتان من الحور العين على كل جارية منهن ثوبان من ثياب الجنة وليس في الجنة لون إلا وهو فيهما ولا ريح ولا طيب إلا قد عبق بهما ينفذ ضوء وجوههما غلظ القبة حتى يظن من يراهما أنهما دون القبة يرى مخهما من فوق سوقهما كالسلك الأبيض في ياقوتة حمراء يريان له من الفضل على صاحبه كفضل الشمس على الحجارة أو أفضل ويرى هو لهما مثل ذلك ويدخل إليهما فيحييانه ويقبلانه ويتعلقان به ويقولان له والله ما ظننا أن الله يخلق مثلك ثم يأمر الله تعالى الملائكة فيسيرون بهم صفا في الجنة حتى ينتهي كل رجل منهم إلى منزلته التي أعدت له وقد روى هذا الأثر ابن أبي حاتم بسنده عن وهب بن منبه وزاد فانظروا إلى موهوب ربكم الذي وهب لكم فإذا هو بقباب في الرفيق الأعلى وغرف مبنية من الدر والمرجان أبو أبهل من ذهب وسررها من ياقوت وفرشها من سندس وإستبرق ومنابرها من نور يفور من أبوابها وعراصها نور مثل شعاع الشمس عنده مثل الكوكب الدري في النهار المضيء وإذا بقصور شامخة في أعلى عليين من الياقوت يزهو نورها فلولا أنه مسخر إذا لالتمع الأبصار فما كان من تلك القصور من الياقوت الأبيض فهو مفروش بالحرير الأبيض وما كان فيها من الياقوت الأحمر فهو مفروش بالعبقري الأحمر وما كان فيها من الياقوت الأخضر فهو مفروش بالسندس الأخضر وما كان فيها من الياقوت الأصفر فهو مفروش بالأرجوان الأصفر مبوبة بالزمرد الأخضر والذهب الأحمر والفضة البيضاء قوائمها وأركانها من الجوهر وشرفها قباب من لؤلؤ وبروجها غرف من المرجان فلما انصرفوا إلى ما أعطاهم ربهم قربت لهم براذين من ياقوت أبيض منفوخ فيها الروح تجنبها الولدان المخلدون بيد كل وليد منهم حكمة برذون من تلك الراذين ولجمها وأعنتها من فضة بيضاء منظومة بالدر والياقوت سروجها سرر موضونة مفروشة بالسندس والإستبرق فانطلق بهم تلك الراذين تزف بهم ببطن رياض الجنة فلما انتهوا إلى منازلهم وجدوا الملائكة قعودا على منابر من نور ينتظرونهم ليزوروهم ويصافحوهم ويهنئوهم كرامة ربهم فلما دخلوا قصورهم وجدوا فيها جميع ما تطاول به عليهم وما سألوا وتمنوا وإذا على باب كل قصر من تلك القصور أربعة جنان: جنتان ذواتا أفنان وجنتان مدهامتان وفيهما عينان نضاختان وفيهما من كل فاكهة زوجان وحور مقصورات في الخيام فلما تبوءوا منازلهم واستقروا قرارهم قال لهم ربهم هل وجدتم ما وعد ربكم حقا قالوا نعم وربنا قال هل رضيتم ثواب ربكم ؟ قالوا ربنا رضينا فارض عنا قال برضاي عنكم حللتم داري ونظرتم إلى وجهي وصافحتكم ملائكتي فهنيئا هنيئا لكم \" عطاء غير مجذوذ \" ليس فيه تنغيص ولا قصر يد فعند ذلك قالوا الحمد لله الذي أذهب عنا الحزن وأدخلنا دار المقامة من فضله لا يمسنا فيها نصب ولا يمسنا فيها لغوب.إن ربنا لغفور شكور.وهذا سياق غريب وأثر عجيب ولبعضه شواهد ففي الصحيحين أن الله تعالى يقول لذلك الرجل الذي يرون آخر أهل الجنة دخولا الجنة: تمن فيتمنى حتى إذا انتهت به الأماني يقول الله تعالى: تمن من كذا وتمن من كذا يذكره ثم يقول ذلك لك وعشرة أمثاله. وفي صحيح مسلم عن أبي ذر عن رسول الله صلى الله عليه وسلم عن الله عز وجل \"يا عبادي لو أن أولكم وآخركم وإنسكم وجنكم قاموا في صعيد واحد فسألوني فأعطيت كل إنسان مسألته ما نقص ذلك من ملكي شيئا إلا كما ينقص المحيط إذا أدخل في البحر \" الحديث بطوله وقال خالد بن معدان إن في الجنة شجرة يقال لها طوبى لها ضروع كلها ترضع صبيان أهل الجنة وإن سقط المرأة يكون في نهر من أنهار الجنة يتقلب فيه حتى تقوم القيامة فيبعث ابن أربعين سنة رواه ابن أبي حاتم."
    },
    {
      "ayah": 3,
      "surah": 13,
      "text": "لما ذكر تعالى العالم العلوي شرع في ذكر قدرته وحكمته وأحكامه للعالم السفلي فقال \" وهو الذي مد الأرض \" أي جعلها متسعة ممتدة في الطول والعرض وأرساها بجبال راسيات شامخات وأجرى فيها الأنهار والجداول والعيون ليسقي ما جعل فيها من الثمرات المختلفة الألوان والأشكال والطعوم والروائح \" من كل زوجين اثنين \" أي من كل شكل صنفان \" يغشي الليل النهار \" أي جعل كلا منهما يطلب الآخر طلبا حثيثا فإذا ذهب هذا غشيه هذا وإذا انقضى هذا جاء الآخر فيتصرف أيضا في الزمان كما يتصرف في المكان والسكان \" إن في ذلك لآيات لقوم يتفكرون \" أي في آلاء الله وحكمه ودلائله."
    },
    {
      "ayah": 30,
      "surah": 13,
      "text": "يقول تعالى وكما أرسلناك يا محمد في هذه الأمة \" لتتلو عليهم الذي أوحينا إليك \" أي تبلغهم رسالة الله إليهم كذلك أرسلنا في الأمم الماضية الكافرة بالله وقد كذب الرسل من قبلك فلك بهو أسوة وكما أوقعنا بأسنا ونقمتنا بأولئك فليحذر هؤلاء من حلول النقم بهم فإن تكذيبهم لك أشد من تكذيب غيرك من المرسلين قال الله تعالى \" تالله لقد أرسلنا إلى أمم من قبلك \" الآية وقال تعالى \" ولقد كذبت رسل من قبلك فصبروا على ما كذبوا وأوذوا حتى أتاهم نصرك ولا مبدل لكلمات الله ولقد جاءك من نبأ المرسلين \" أي كيف نصرناهم وجعلنا العاقبة لهم ولأتباعهم في الدنيا والآخرة وقوله \" وهم يكفرون بالرحمن \" أي هذه الأمة التي بعثناك فيهم يكفرون بالرحمن لا يقرون به لأنهم كانوا يأنفون من وصف الله بالرحمن الرحيم ولهذا أنفوا يوم الحديبية أن يكتبوا بسم الله الرحمن الرحيم وقالوا ما ندري ما الرحمن الرحيم قاله قتادة والحديث في صحيح البخاري وقد قال الله تعالى \" قل ادعوا الله أو ادعوا الرحمن أيا ما تدعوا فله الأسماء الحسنى \" وفي صحيح مسلم عن عبد الله بن عمر قال: قال رسول الله صلى الله عليه وسلم \" إن أحب الأسماء إلى الله تعالى عبد الله وعبد الرحمن \" \" قل هو ربي لا إله إلا هو \" أي هذا الذي تكفرون به أنا مؤمن به معترف مقر له بالربوبية والإلهية هو ربي لا إله إلا هو \" عليه توكلت \" أي فى جميع أموري \" وإليه متاب \" أي إليه أرجع وأنيب فإنه لا يستحق ذلك أحد سواه."
    },
    {
      "ayah": 31,
      "surah": 13,
      "text": "يقول تعالى مادحا للقرآن الذي أنزله على محمد صلى الله عليه وسلم ومفضلا له على سائر الكتب المنزلة قبله \" ولو أن قرآنا سيرت به الجبال \" أي لو كان في الكتب الماضية كتاب تسير به الجبال عن أماكنها أو تقطع به الأرض وتنشق أو تكلم به الموتى في قبورهم لكان هذا القرآن هو المتصف بذلك دون غيره أو بطريق الأولى أن يكون كذلك لما فيه من الإعجاز الذي لا يستطيع الإنسان والجن عن آخرهم إذا اجتمعوا أن يأتوا بمثله ولا بسورة من مثله ومع هذا فهؤلاء المشركون كافرون به جاحدون له \" بل لله الأمر جميعا \" أي مرجع الأمور كلها إلى الله عز وجل ما شاء الله كان وما لم يشأ لم يكن ومن يضلل الله فلا هادي له ومن يهد الدنيا له من مضل وقد يطلق اسم القرآن على كل من الكتب المتقدمة لأنه مشتق من الجمع قال الإمام أحمد: حدثنا عبد الرزاق ثنا معمر عن همام بن منبه قال: هذا ما حدثنا أبو هريرة قال : قال رسول الله صلى الله عليه وسلم \" خفف على داود القرآن فكان يأمر بدابته أن تسرج فكان يقرأ القرآن من قبل أن تسرج دابته وكان لا يأكل إلا من عمل يديه \" انفرد بإخراجه البخاري والمراد بالقرآن هو الزبور وقوله \" أفلم ييأس الذين آمنوا \" أي من إيمان جميع الخلق ويعلموا أو يتبينوا \" أن لو يشاء لهدى الناس جميعا \" فإنه ليس ثم حجة ولا معجزة أبلغ ولا أنجع في العقول والنفوس من هذا القرآن الذي لو أنزله الله على جبل لرأيته خاشعا متصدعا من خشية الله وثبت في الصحيح أن رسول الله صلى الله عليه وسلم قال \" ما من نبي إلا وقد أوتي ما آمن على مثله البشر وإنما كان الذي أوتيته وحيا أوحاه الله إلي فأرجو أن أكون أكثرهم تابعا يوم القيامة \" معناه أن معجزة كل نبي انقرضت بموته وهذا القرآن حجة باقية على الآباد لا تنقضي عجائبه ولا يخلق عن كثرة الرد ولا يشبع منه العلماء هو الفصل ليس بالهزل من تركه من جبار قصمه الله ومن ابتغى الهدى من غيره أضله الله وقال ابن أبي حاتم: حدثنا أبو زرعة حدثنا منجاب بن الحارث أنبأنا بشر بن عمارة حدثنا عمر بن حسان عن عطية العوفي قال: قلت له \" ولو أن قرآنا سيرت به الجبال \" الآية قالوا لمحمد صلى الله عليه وسلم لو سيرت لنا جبال مكة حتى تتسع فنحرث فيها أو قطعت بنا الأرض كما كان سليمان يقطع لقومه بالريح أو أحييت لنا الموتى كما كان عيسى يحيى الموتى لقومه فأنزل الله هذه الآية قال: قلت هل تروون هذا الحديث عن أحد من أصحاب النبي صلى الله عليه وسلم ؟ قال نعم عن أبي سعيد عن النبي صلى الله عليه وسلم وكذا روي عن ابن عباس والشعبي وقتادة والثوري وغير واحد في سبب نزول هذه الآية والله أعلم وقال قتادة: لو فعل هذا بقرآن غير قرآنكم لفعل بقرآنكم وقوله \" بل لله الأمر جميعا \" قال ابن عباس: أي لا يصنع من ذلك إلا ما شاء ولم يكن ليفعل رواه ابن إسحاق بسنده عنه وقاله ابن جرير أيضا وقال غير واحد من السلف في قوله \" أفلم ييأس الذين آمنوا \" أفلم يعلم الذين آمنوا وقرأ آخرون أفلم يتبين الذين آمنوا أن لو يشاء الله لهدى الناس جميعا وقال أبو العالية: قد يئس الذين آمنوا أن يهدوا ولو يشاء الله لهدى الناس جميعا وقوله \" ولا يزال الذين كفروا تصيبهم بما صنعوا قارعة أو تحل قريبا من دارهم \" أي بسبب تكذيبهم لا تزال القوارع تصيبهم في الدنيا أو تصيب من حولهم ليتعظوا ويعتبروا كما قال تعالى \" ولقد أهلكنا ما حولكم من القرى وصرفنا الآيات لعلهم يرجعون \" وقال \" أفلا يرون أنا نأتي الأرض ننقصها من أطرافها أفهم الغالبون \" قال قتادة عن الحسن \" أو تحل قريبا من دارهم \" أي القارعة وهذا هو الظاهر من السياق وقال أبو داود الطيالسي: حدثنا المسعودي عن قتادة عن سعيد بن جبير عن ابن عباس في قوله \" ولا يزال الذين كفروا تصيبهم بما صنعوا قارعة \" قال سرية \" أو تحل قريبا من دارهم \" قال محمد صلى الله عليه وسلم \" حتى يأتي وعد الله \" قال \" فتح مكة \" وهكذا قال عكرمة وسعيد بن جبير ومجاهد في رواية وقال العوفي عن ابن عباس \" تصيبهم بما صنعوا قارعة \" قال عذاب من السماء منزل عليهم \" أو تحل قريبا من دارهم \" يعني نزول رسول الله صلى الله عليه وسلم بهم وقتاله إياهم وكذا قال مجاهد وقتادة وقال عكرمة في رواية عن ابن عباس \" قارعة \" أي نكبة وكلهم قال \" حتى يأتي وعد الله \" يعني فتح مكة وقال الحسن البصري يوم القيامة وقوله \" إن الله لا يخلف الميعاد \" أي لا ينقض وعده لرسله بالنصرة لهم ولأتباعهم في الدنيا والآخرة \" فلا تحبسن الله مخلف وعده رسله إن الله عزيز ذو انتقام \"."
    },
    {
      "ayah": 32,
      "surah": 13,
      "text": "يقول تعالى مسليا لرسوله في تكذيب من كذبه من قومه \" ولقد استهزئ برسل من قبلك \" أي فلك فيهم أسوة \" فأمليت للذين كفروا \" أي أنظرتهم وأجلتهم \" ثم أخذتهم \" أخذة رابية فكيف بلغك ما صنعت بهم وعاقبتهم وأمليت لهم كما قال تعالى \" وكأين من قرية أمليت لها وهي ظالمة ثم أخذتها وإلي المصير \" وفي الصحيحين \" إن الله ليملي للظالم حتى إذا أخذه لم يفلته \" ثم قرأ رسول الله صلى الله عليه وسلم \" وكذلك أخذ ربك إذا أخذ القرى وهي ظالمة إن أخذه أليم شديد \"."
    },
    {
      "ayah": 33,
      "surah": 13,
      "text": "أي حفيظ عليم رقيب على كل نفس منفوسة يعلم ما يعمل العاملون من خير وشر ولا يخفى عليه خافية \" وما تكون في شأن وما تتلو منه من قرآن ولا تعملون من عمل إلا كنا عليكم شهودا إذ تفيضون فيه \" وقال تعالى \" وما تسقط من ورقة إلا يعلمها \" وقال \" وما من دابة في الأرض إلا على الله رزقها ويعلم مستقرها ومستودعها كل في كتاب مبين \" وقال \" سواء منكم من أسر القول ومن جهر به ومن هو مستخف بالليل وسارب بالنهار \" وقال \" يعلم السر وأخفى \" وقال \" وهو معكم أين ما كنتم والله بما تعملون بصير \" أفمن هو كذلك كالأصنام التي يعيدونها لا تسمع ولا تبصر ولا تعقل ولا تملك نفعا لأنفسها ولا لعابديها ولا كشف ضر عنها ولا عن عابديها ؟ وحذف هذا الجواب اكتفاء بدلالة السياق عليه وهو قوله \" وجعلوا لله شركاء \" أي عبدوها معه من أصنام وأنداد وأوثان \" قل سموهم \" أي أعلمونا بهم واكشفوا عنهم حتى يعرفوا فإنهم لا حقيقة لهم ولهذا قال \" أم تنبئونه بما لا يعلم في الأرض \" أي لا وجود له لأنه لو كان لها وجود في الأرض لعلمها لأنه لا تخفى عليه خافية \" أم بظاهر من القول \" قال مجاهد: بظن من القول وقال الضحاك وقتادة بباطل من القول أي إنما عبدتم هذه الأصنام بظن منكم أنها تنفع وتضر وسميتموها آلهة \" إن هي إلا أسماء سميتموها أنتم وآباؤكم ما أنزل الله بها من سلطان إن يتبعون إلا الظن وما تهوى الأنفس ولقد جاءهم من ربهم الهدى \" \" بل زين للذين كفروا مكرهم \" قال مجاهد قولهم أي ما هم عليه من الضلال والدعوة إليه آناء الليل وأطراف النهار كقوله تعالى \" وقيضنا لهم قرناء فزينوا لهم \" الآية \" وصدوا عن السبيل \" من قرأها بفتح الصاد معناه أنه لما زين لهم ما هم فيه وأنه حق دعوا إليه وصدوا الناس عن اتباع طريق الرسل ومن قرأها بالضم أي بما زين لهم من صحة ما هم عليه صدوا به عن سبيل الله ولهذا قال \" ومن يضلل الله فما له من هاد \" كما قال \" ومن يرد الله فتنته فلن تملك له من الله شيئا \" وقال \" إن تحرص على هداهم فإن الله لا يهدي من يضل وما لهم من ناصرين \"."
    },
    {
      "ayah": 34,
      "surah": 13,
      "text": "ذكر تعالى عقاب الكفار وثواب الأبرار فقال بعد إخباره عن حال المشركين وما هم عليه من الكفر والشرك \" لهم عذاب في الحياة الدنيا \" أي بأيدي المؤمنين قتلا وأسرا \" ولعذاب الآخرة \" أي المدخر مع هذا الخزي في الدنيا \" أشق \" أي من هذا بكثير كما قال رسول الله صلى الله عليه وسلم للمتلاعنين \"إن عذاب الدنيا أهون من عذاب الآخرة \" وهو كما قال صلوات الله وسلامه عليه فإن عذاب الدنيا له انقضاء وذاك دائم أبدا في نار هي بالنسبة إلى هذه سبعون ضعفا ووثاق لا يتصور كثافته وشدته كما قال تعالى \" فيومئذ لا يعذب عذابه أحد ولا يوثق وثاقه أحد \" وقال تعالى \" وأعتدنا لمن كذب بالساعة سعيرا إذا رأتهم من مكان بعيد سمعوا له تغيظا وزفيرا وإذا ألقوا منها مكانا ضيقا مقرنين دعوا هنالك ثبورا لا تدعو اليوم ثبورا واحدا وادعوا ثبورا كثيرا قل أذلك خير أم جنة الخلد التي وعد المتقون كانت لهما جزاء ومصيرا \"."
    },
    {
      "ayah": 35,
      "surah": 13,
      "text": "أي صفتها ونعتها \" تجري من تحتها الأنهار \" أي سارحة في أرجائها وجوانبها وحيث شاء أهلها يفجرونها تفجيرا أي يصرفونها كيف شاءوا وأين شاءوا كقوله \" مثل الجنة التي وعد المتقون فيها أنهار من ماء غير آسن وأنهار من لبن لم يتغير طعمه وأنهار من خمر لذة للشاربين وأنهار من عسل مصفى ولهم فيها من كل الثمرات ومغفرة \" الآية وقوله \" أكلها دائم وظلها \" أي فيها الفواكه والمطاعم والمشارب لا انقطاع ولا فناء وفي الصحيحين من حديث ابن عباس في صلاة الكسوف وفيه قالوا: يا رسول الله رأيناك تناولت شيئا فى مقامك هذا ثم رأيناك تكعكعت فقال \"إني رأيت الجنة - أو أريت الجنة - فتناولت منها عنقودا ولو أخذته لأكلتم منه ما بقيت الدنيا\" وقال الحافظ أبو يعلى: حدثنا أبو خيمة حدثنا عبد الله بن جعفر حدثنا عبيد الله حدثنا أبو عقيل عن جابر قال: بينما نحن في صلاة الظهر إذ تقدم رسول الله صلى الله عليه وسلم فتقدمنا ثم تناول شيئا ليأخذه ثم تأخر فلما قضى الصلاة قال له أبي بن كعب يا رسول الله صنعت اليوم فى الصلاة شيئا ما رأيناك كنت تصنعه فقال \" إني عرضت علي الجنة وما فيها من الزهرة والنضرة فتناولت منها قطفا من عنب لآتيكم به فحيل بيني وبينه ولو أتيتكم به لأكل منه من بين السماء والأرض لا ينقصونه \" وروى مسلم من حديث أبي الزبير عن جابر شاهدا لبعضه وعن عتبة بن عبد السلمى أن أعرابيا سأل النبي صلى الله عليه وسلم عن الجنة فقال فيها عنب ؟ قال \" نعم \" قال فما عظم العنقود ؟ قال \" مسيرة شهر للغراب الأبقع ولا يفتر \" رواه الإمام أحمد وقال الطبراني: حدثنا معاذ بن المثنى حدثنا علي بن المديني حدثنا ريحان بن سعيد عن عبادة بن منصور عن أيوب عن أبي قلابة عن أبي أسماء عن ثوبان قال: قال رسول الله صلى الله عليه وسلم \" إن الرجل إذا نزع ثمرة من الجنة عادت مكانها أخرى \" وعن جابر بن عبد الله قال: قال رسول الله صلى الله عليه وسلم \" يأكل أهل الجنة ويشربون ولا يمتخطون ولا يتغوطون ولا يبولون طعامهم ذلك جشاء كريح المسك ويلهمون التسبيح والتقديس كما يلهمون النفس \" رواه مسلم وروى الإمام أحمد والنسائي من حديث الأعمش عن تمام بن عقبة سمعت زيد بن أرقم قال: جاء رجل من أهل الكتاب فقال: يا أبا القاسم تزعم أن أهل الجنة يأكلون ويشربون ؟ قال \" نعم والذي نفس محمد بيده إن الرجل منهم ليعطى قوة مائة رجل فى الأكل والشرب والجماع والشهوة \" قال إن الذي يأكل ويشرب تكون له الحاجة وليس في الجنة أذى قال \" تكون حاجة أحدهم رشحا يفيض من جلودهم كريح المسك فيضمر بطنه \" رواه الإمام أحمد والنسائي وقال الحسن بن عرفة: حدثنا خلف بن خليفة عن حميد بن الأعرج عن عبد الله بن الحارث عن عبد الله بن مسعود رضي الله عنه قال: قال لي رسول الله صلى الله عليه وسلم \" إنك لتنظر إلى الطير في الجنة فبخر بين يديك مشويا \" وجاء فى بعض الأحاديث أنه إذا فرغ منه عاد طائرا كما كان بإذن الله تعالى وقد قال الله تعالى \" وفاكهة كثيرة لا مقطوعة ولا ممنوعة \" وقال \" ودانية عليهم ظلالها وذللت قطوفها تذليلا \" وكذلك ظلها لا يزول ولا يقلص كما قال تعالى \" والذين آمنوا وعملوا الصالحات سندخلهم جنات تجرى من تحتها الأنهار خالدين فيها أبدا لهم فيها أزواج مطهرة وندخلهم ظلا ظليلا\" وقد تقدم في الصحيحين من غير وجه أن رسول الله صلى الله عليه وسلم قال \" إن في الجنة شجرة يسير الراكب المجد الجواد المضمر السريع في ظلها مائة عام لا يقطعها \" ثم قرأ \" وظل ممدود \" وكثيرا ما يقرن الله تعالى بين صفة الجنة وصفة النار ليرغب في الجنة ويحذر من النار ولهذا لما ذكر صفة الجنة بما ذكر قال بعده \" ملك عقبى الذين اتقوا وعقبى الكافرين النار \" كما قال تعالى \" لا يستوي أصحاب النار وأصحاب الجنة أصحاب الجنة هم الفائزون \" وقال بلال بن سعد خطيب دمشق في بعض خطبه: عباد الله هل جاءكم مخبر يخبركم أن شيئا من عبادتكم تقبلت منكم أو أن شيئا من خطاكم غفرت لكم ؟ \" أفحسبتم أنما خلقناكم عبثا وأنكم إلينا لا ترجعون \" والله لو عجل لكم الثواب في الدنيا لاستقللتم كلكم ما افترض عليكم أو ترغبون في طاعة الله لتعجيل دنياكم ولا تنافسون في جنة \" أكلها دائم \" رواه ابن أبي حاتم."
    },
    {
      "ayah": 36,
      "surah": 13,
      "text": "يقول تعالى \" والذين آتيناهم الكتاب \" وهم قائمون بمقتضاه \" يفرحون بما أنزل إليك \" أي من القرآن لما في كتبهم من الشواهد على صدقه والبشارة به كما قال تعالى \" الذين آتيناهم الكتاب يتلونه حق تلاوته \" الآية وقال تعالى \" قل آمنوا به أولا تؤمنوا -إلى قوله- إن كان وعد ربنا لمفعولا \" أي إن كان ما وعدنا الله به في كتبنا من إرسال محمد صلى الله عليه وسلم لحقا وصدقا مفعولا لا محالة وكائنا فسبحانه ما أصدق وعده فله الحمد وحده \" ويخرون للأذقان يبكون ويزيدهم خشوعا \" وقوله \" ومن الأحزاب من ينكر بعضه \" أي ومن الطوائف من يكذب ببعض ما أنزل إليك وقال مجاهد \" ومن الأحزاب \" أي اليهود والنصارى \" من ينكر بعضه \" أي بعض ما جاءك من الحق وكذا قال قتادة وعبد الرحمن بن زيد بن أسلم وهذا كما قال تعالى \" وإن من أهل الكتاب لمن يؤمن بالله \" الآية \" قل إنما أمرت أن أعبد الله ولا أشرك به \" أى إنما بعثت بعبادة الله وحده لا شريك له كما أرسل الأنبياء من قبلي \" إليه أدعو \" أى إلى سبيله أدعو الناس \" وإليه مآب \" أي مرجعي ومصيري."
    },
    {
      "ayah": 37,
      "surah": 13,
      "text": "وقوله \" وكذلك أنزلناه حكما عربيا \" أي وكما أرسلنا قبلك المرسلين وأنزلنا عليهم الكتب من السماء كذلك أنزلنا عليك القرآن محكما معربا شرفناك به وفضلناك على من سواك بهذا الكتاب المبين الواضح الجلي الذي \" لا يأتيه الباطل من بين يديه ولا من خلفه تنزيل من حكيم حميد \" وقوله \" ولئن اتبعت أهواءهم \" أي آراءهم \" بعد ما جاءك من العلم \" أي من الله سبحانه وتعالى \" مالك من الله من ولي ولا واق \" وهذا وعيد لأهل العلم أن يتبعوا سبل أهل الضلالة بعد ما صاروا إليه من سلوك السنة النبوية والمحجة المحمدية على من جاء بها أفضل الصلاة والسلام."
    },
    {
      "ayah": 38,
      "surah": 13,
      "text": "يقول تعالى وكما أرسلناك يا محمد رسولا بشريا كذلك قد بعثنا المرسلين قبلك بشرا يأكلون الطعام ويمشون في الأسواق ويأتون الزوجات ويولد لهم وجعلنا لهم أزواجا وذرية وقد قال تعالى لأشرف الرسل وخاتمهم \" قل إنما أنا بشر مثلكم يوحى إلي \" وفي الصحيحين أن رسول الله صلى الله عليه وآله وسلم قال \" أما أنا فأصوم وأفطر وأقوم وأنام وآكل اللحم وأتزوج النساء فمن رغب فمن سنتي فليس مني \" قال الإمام أحمد: حدثنا يزيد أنبأنا الحجاج بن أرطاة عن مكحول قال: قال أبو أيوب قال رسول الله صلى الله عليه وآله وسلم \" أربع من سنن المرسلين: التعطر والنكاح والسواك والحناء \" وقد رواه أبو عيسى الترمذي عن سفيان بن وكيع عن حفص بن غيلان عن الحجاج عن مكحول عن أبى السماك عن أبي أيوب فذكره ثم قال وهذا أصح من الحديث الذي لم يذكر فيه أبو السماك. وقوله \" وما كان لرسول أن يأتي بأية إلا بإذن الله \" أي لم يكن يأتي قومه بخارق إلا إذا أذن له فيه ليس ذلك إليه بل إلى الله عز وجل يفعل ما يشاء ويحكم ما يريد \" لكل أجل كتاب \" أي لكل مدة مضروبة كتاب مكتوب بها وكل شيء عنده بمقدار \" ألم تعلم أن الله يعلم ما في السماء والأرض إن ذلك في كتاب إن ذلك على الله يسير \" وكان الضحاك بن مزاحم يقول في قوله \" لكل أجل كتاب \" أي لكل كتاب أجل يعني لكل كتاب أنزله من السماء مدة مضروبة عند الله ومقدار معين."
    },
    {
      "ayah": 39,
      "surah": 13,
      "text": "يمحو الله ما يشاء \" منها \" ويثبت \" يعني حتى نسخت كلها بالقرآن الذي أنزله الله على رسوله صلوات الله وسلامه عليه وقوله \" يمحو الله ما يشاء ويثبت \" اختلف المفسرون في ذلك فقال الثوري ووكيع وهشيم عن ابن أبي ليلى عن المنهال بن عمرو عن سعيد بن جبير عن ابن عباس: يدبر أمر السنة فيمحو الله ما يشاء إلا الشقاء والسعادة والحياة والموت وفي رواية \" يمحو الله ما يشاء ويثبت \" قال كل شيء إلا الموت والحياة والشقاء والسعادة فإنهما قد فرغ منهما وقال مجاهد \" يمحو الله ما يشاء ويثبت \" إلا الحياة والموت والشقاء والسعادة فإنهما لا يتغيران وقال منصور سألت مجاهدا فقلت أرأيت دعاء أحدنا يقول: اللهم إن كان اسمي فى السعداء فأثبته فيهم وإن كان في الأشقياء فامحه عنهم واجعله في السعداء فقال حسن: ثم لقيته بعد ذلك بحول أو أكثر فسألته عن ذلك فقال \" إنا أنزلناه في ليلة مباركة \" الآيتين قال يقضي في ليلة القدر ما يكون في السنة من رزق أو مصيبة ثم يقدم ما يشاء ويؤخر ما يشاء فأما كتاب السعادة والشقاء فهو ثابت لا يغير وقال الأعمش عن أبي وائل شقيق بن سلمة إنه كان كثيرا ما يدعو بهذا الدعاء: اللهم إن كنت كتبتنا أشقياء فامحه واكتبنا سعداء وإن كنت كتبتنا سعداء فأثبتنا فإنك تمحو ما تشاء وتثبت وعندك أم الكتاب رواه ابن جرير أيضا حدثنا عمرو بن علي حدثنا معاذ بن هشام حدثنا أبي عن أبي حكيمة عصمة عن أبي عثمان النهدي أن عمر بن الخطاب رضي الله عنه قال وهو يطوف بالبيت وهو يبكي: اللهم إن كنت كتبت علي شقوة أو ذنبا فامحه فإنك تمحو ما تشاء وتثبت وعندك أم الكتاب فاجعله سعادة ومغفرة وقال حماد عن خالد الحذاء عن أبي قلابة عن ابن مسعود رضي الله عنه أنه كان يدعو بهذا الدعماء أيضا ورواه شريك عن هلال بن حميد عن عبد الله بن علم عن ابن مسعود بمثله وقال ابن جرير: حدثني المثنى حدثنا حجاج حدثنا خصاف عن أبي حمزة عن إبراهيم أن كعبا قال لعمر بن الخطاب: يا أمير المؤمنين لولا آية في كتاب الله لأنبأتك بما هو كائن إلى يوم القيامة قال وما هي ؟ قال قول الله تعالى \" يمحو الله ما يشاء \" الآية ومعنى هذه الأقوال أن الأقدار ينسخ الله ما يشاء منها ويثبت منها ما يشاء وقد يستأنس لهذا القول بما رواه الإمام أحمد حدثنا وكيع حدثنا سفيان هو الثوري عن عبد الله بن عيسى عن عبد الله بن أبي الجعد عن ثوبان قال: قال رسول الله \"إن الرجل ليحرم الرزق بالذنب يصيبه ولا يرد القدر إلا الدماء ولا يزيد في العمر إلا البر \" ورواه النسائي وابن ماجه من حديث سفيان الثوري به وثبت في الصحيح أن صلة الرحم تزيد في العمر وفي حديث آخر \" إن الدعاء والقضاء ليعتلجان بين السماء والأرض \" وقال ابن جرير: حدثني محمد بن سهل بن عسكر حدثنا عبد الرزاق أنا ابن جرير عن عطاء عن ابن عباس قال: إن لله لوحا محفوظا مسيرة خمسمائة عام من درة بيضاء لها دفتان من ياقوت - والدفتان لوحان - لله عز وجل كل يوم ثلاثمائة وستون لحظة يمحو ما يشاء ويثبت وعنده أم الكتاب وقال الليث بن سعد عن زياد بن محمد عن محمد بن كعب القرظي عن فضالة بن عبيد عن أبي الدرداء قال: قال رسول الله صلى الله عليه وسلم \" يفتح الذكر في ثلات ساعات يبقين من الليل في الساعة الأولى منها ينظر في الذكر الذي لا ينظر فيه أحد غيره فيمحو ما يشاء ويثبت \" وذكر تمام الحديث رواه ابن جرير وقال الكلبي \" يمحو الله ما يشاء ويثبت \" قال يمحو من الرزق يزيد فيه ويمحو من الأجل ويزيد فيه فقيل له من حدثك بهذا ؟ فقال أبو صالح عن جابر بن عبد الله بن رئاب عن النبي صلى الله عليه وسلم ثم سئل بعد ذلك عن هذه الآية فقال يكتب القول كله حتى إذا كان يوم الخميس طرح منه كل شيء ليس فيه ثواب ولا عقاب مثل قولك أكلت وشربت دخلت وخرجت ونحو ذلك من الكلام وهو صادق ويثبت ما كان فيه الثواب وعليه العقاب وقال عكرمة عن ابن عباس: الكتاب كتابان فكتاب يمحو الله منه ما يشاء ويثبت وعنده أم الكتاب وقال العوفي عن ابن عباس في قوله \" يمحو الله ما يشاء ويثبت وعنده أم الكتاب \" يقول هو الرجل يعمل الزمان بطاعة الله ثم يعود لمعصية الله فيموت على ضلالة فهو الذي يمحو والذي يثبت الرجل يعمل بمعصية الله وقد كان سبق له خير حتى يموت وهو في طاعة الله وهو الذي يثبت وروي عن سعيد بن جبير أنها بمعنى \" يغفر لمن يشاء ويعذب من يشاء والله على كل شيء قدير\" وقال علي بن أبي طلحة عن ابن عباس \" يمحو الله ما يشاء ويثبت \" يقول يبدل ما يشاء فينسخه ويثبت ما يشاء فلا يبدله \" وعنده أم الكتاب \" وجملة ذلك عنده في أم الكتاب الناسخ وما يبدل وما يثبت كل ذلك في كتاب وقال قتادة في قوله \" يمحو الله ما يشاء ويثبت \" كقوله \" ما ننسخ من آية أو ننسها \" الآية وقال ابن أبي نجيح عن مجاهد في قوله \" يمحو الله ما يشاء ويثبت \" قال: قالت كفار قريش لما نزلت \" وما كان لرسول أن يأتي بأية إلا بإذن الله \" ما نرى محمدا يملك شيئا وقد فرغ من الأمر فأنزلت هذه الآية تخويفا ووعيدا لهم إنا إن شئنا أحدثنا له من أمرك ما شئنا ونحدث في كل رمضان فيمحو ما يشاء ويثبت ما يشاء من أرزاق الناس ومصائبهم وما يعطيهم وما يقسم لهم وقال الحسن البصري \" يمحو الله ما يشاء ويثبت \" قال من جاء أجله يذهب ويثبت الذي هو حي يجري إلى أجله وقد اختار هذا القول أبو جعفر بن جرير رحمه الله وقوله \" وعنده أم الكتاب \" قال الحلال والحرام وقال قتادة أى جملة الكتاب وأصله وقال الضحاك \" وعنده أم الكتاب \" قال كتاب عند رب العالمين وقال سنيد بن داود حدثني معتمر عن أبيه عن يسار عن ابن عباس أنه سأل كعبا عن أم الكتاب فقال: علم الله ما هو خالق وما خلقه عاملون وثم قال لعلمه: كن كتابا فكان كتابا وقال ابن جريج عن ابن عباس \" وعنده أم الكتاب \" قال الذكر."
    },
    {
      "ayah": 4,
      "surah": 13,
      "text": "وقوله \" وفي الأرض قطع متجاورات \" أي أراض يجاور بعضها بعضا مع أن هذه طيبة تنبت ما ينفع الناس وهذه سبخة مالحة لا تنبت شيئا هكذا روى عن ابن عباس ومجاهد وسعيد بن جبير والضحاك وغير واحد ومدخل في هذه الآية اختلاف ألوان بقاع الأرض فهذه تربة حمراء وهذه بيضاء وهذه صفراء وهذه سوداء وهذه محجرة وهذه سهلة وهذه مرملة وهذه سميكة وهذه رقيقة والكل متجاورات فهذه بصفتها وهذه بصفتها الأخرى فهذا كله مما يدل على الفاعل المختار لا إله إلا هو ولا رب سواه وقوله \" وجنات من أعناب وزرع ونخيل \" يحتمل أن تكون عاطفة على جنات فيكون \" وزرع ونخيل \" مرفوعين ويحتمل أن يكون معطوفا على أعناب فيكون مجرورا ولهذا قرأ بكل منهما طائفة من الأئمة وقوله \" صنوان وغير صنوان \" الصنوان هو الأصول المجتمعة في منبت واحد كالرمان والتين وبعض النخيل ونحو ذلك وغير الصنوان ما كان على أصل واحد كسائر الأشجار ومنه سمي عم الرجل صنو أبيه كما جاء في الصحيح أن رسول الله صلى الله عليه وسلم قال لعمر \" أما شعرت أن عم الرجل صنو أبيه \"وقال سفيان الثوري وشعبة عن أبى إسحاق عن البراء رضي الله عنه: الصنوان هى النخلات في أصل واحد وغير الصنوان المتفرقات وقاله ابن عباس ومجاهد والضحاك وقتادة وعبد الرحمن بن زيد بن أسلم وغير واحد وقوله \" تسقى بماء واحد ونفضل بعضها على بعض في الأكل \" قال الأعمش عن أبي صالح عن أبي هريرة عن النبي صلى الله عليه وسلم \" ونفصل بعضها على بعض في الأكل \" قال \" الدقل والفارسي والحلو والحامض \"رواه الترمذي وقال حسن غريب أي هذا الاختلاف في أجناس الثمرات والزروع في أشكالها وألوانها وطعومها وروائحها وأوراقها وأزهارها فهذا في غاية الحلاوة وهذا في غاية الحموضة وذا في غاية المرارة وذا عفص وهذا عذب وهذا جمع وهذا وهذا ثم يستحيل إلى طعم آخر بإذن الله تعالى وهذا أصفر وهذا أحمر وهذا أبيض وهذا أسود وهذا أزرق وكذلك الزهورات مع أنها كلها تستمد من طبيعة واحدة وهو الماء مع هذا الاختلاف الكير الذي لا ينحصر ولا ينضبط ففي ذلك آيات لمن كان واعيا وهذا من أعظم الدلالات على الفاعل المختار الذي بقدرته فاوت بين الأشياء وخلقها على ما يريد ولهذا قال تعالى \" إن في ذلك لآيات لقوم يعقلون \"."
    },
    {
      "ayah": 40,
      "surah": 13,
      "text": "يقول تعالى لرسوله \" وإما نرينك \" يا محمد بعض الذي نعد أعداءك من الخزي والنكال في الدنيا \" أو نتوفينك \" أي قبل ذلك \" فإنما عليك البلاغ \" أي إنما أرسلناك لتبلغهم رسالة الله وقد فعلت ما أمرت به \" وعلينا الحساب \" أي حسابهم وجزاؤهم كقوله تعالى \" فذكر إنما أنت مذكر لست عليهم بمصيطر إلا من تولى وكفر فيعذبه الله العذاب الأكبر إن إلينا إيابهم ثم إن علينا حسابهم \"."
    },
    {
      "ayah": 41,
      "surah": 13,
      "text": "\" وقوله \" أو لم يروا أنا نأتي الأرض ننقصها من أطرافها \" قال ابن عباس: أو لم يروا أنا نفتح لمحمد صلى الله عليه وسلم الأرض بعد الأرض وقال في رواية: أو لم يروا إلى القرية تخرب حتى يكون العمران في ناحية وقال مجاهد وعكرمة ننقصها من أطرافها قال خرابها وقال الحسن والضحاك: هو ظهور المسلمين على المشركين وقال العوفي عن ابن عباس نقصان أهلها وبركتها وقال مجاهد: نقصان الأنفس والثمرات وخراب الأرض وقال الشعبي: لو كانت الأرض تنقص لضاق عليك حشك ولكن تنقص الأنفس والثمرات وكذا قال عكرمة: لو كانت الأرض تنقص لم تجد مكانا تقعد فيه ولكن هو الموت وقال ابن عباس في رواية خرابها بموت علمائها وفقهائها وأهل الخير منها وكذا قال مجاهد أيضا هو موت العلماء ; وفي هذا المعنى روى الحافظ ابن عساكر في ترجمة أحمد بن عبد العزيز أبي القاسم المصري الواعظ سكن أصبهان حدثنا أبو محمد طلحة بن أسد المري بدمشق أنشدنا أبو بكر الآجري بمكة قال أنشدك أحمد بن نمزال لنفسه: الأرض تحيا إذا ما عاش عالمها متى يمت عالم منها يمت طرف كالأرض تحيا إذا ما الغيث حل بها وإن أبى عاد في أكنافها التلف والقول الأول أولى وهو ظهور الإسلام على الشرك قرية بعد قرية كقوله \" ولقد أهلكنا ما حولكم من القرى \" الآية وهذا اختيار ابن جرير."
    },
    {
      "ayah": 42,
      "surah": 13,
      "text": "يقول تعالى \" وقد مكر الذين من قبلهم \" برسلهم وأرادوا إخراجهم من بلادهم فمكر الله بهم وجعل العاقبة للمتقين كقوله \" وقد يمكر بك الذين كفروا ليثبتوك أو يقتلوك أو يخرجوك ويمكرون ويمكر الله والله خير الماكرين \" وقوله تعالى \" ومكروا مكرا ومكرنا مكرا وهم لا يشعرون فانظر كيف كان عاقبة مكرهم أنا دمرناهم وقومهم أجمعين فتلك بيوتهم خاوية بما ظلموا \" الآيتين وقوله \" يعلم ما تكسب كل نفس \" أي أنه تعالى عالم بجميع السرائر والضمائر وسيجزي كل عامل بعمله \" وسيعلم الكافر \" والقراءة الأخرى الكفار \" لمن عقبى الدار \" لمن تكون الدائرة والعاقبة لهم أو لأتباع الرسل ؟ كلا: بل هي لأتباع الرسل في الدنيا والآخرة ولله الحمد والمنة."
    },
    {
      "ayah": 43,
      "surah": 13,
      "text": "يقول تعالى يكذبك هؤلاء الكفار ويقولون \" لست مرسلا \" أي ما أرسلك الله \" قل كفى بالله شهيدا بيني وبينكم \" أي حسبي الله هو الشاهد علي وعليكم شاهد علي فيما بلغت عنه من الرسالة وشاهد عليكم أيها المكذبون فيما تفترونه من البهتان وقوله \" ومن عنده علم الكتاب \" قيل نزلت في عبد الله بن سلام قاله مجاهد وهذا القول غريب لأن هذه الآية مكية وعبد الله بن سلام إنما أسلم في أول مقدم النبي صلى الله عليه وسلم المدينة والأظهر في هذا ما قاله العوفي عن ابن عباس قال: هم من اليهود والنصارى.وقال قتادة: منهم ابن سلام وسلمان وتميم الداري وقال مجاهد في رواية عنه هو الله تعالى وكان سعيد بن جبير ينكر أن يكون المراد بها عبد الله بن سلام ويقول هي مكية وكان يقرؤها \" ومن عنده علم الكتاب \" ويقول من عند الله وكذا قرأها مجاهد والحسن البصري.وقد روى ابن جرير من حديث هارون الأعور عن الزهري عن سالم عن ابن عمر أن رسول الله صلى الله عليه وسلم قرأها \" ومن عنده علم الكتاب \" ثم قال لا أصل له من حديث الزهري عند الثقات قلت: وقد رواه الحافظ أبو يعلى في مسنده من طريق هارون بن موسى هذا عن سليمان بن أرقم وهو ضعيف عن الزهري عن سالم عن أبيه مرفوعا كذلك ولا يثبت والله أعلم.والصحيح فى هذا أن \" ومن عنده \" اسم جنس يشمل علماء أهل الكتاب الذين يجدون صفة محمد صلى الله عليه وسلم ونعته في كشبهم المتقدمة من بشارات الأنبياء به كما قال تعالى \" ورحمتي وسعت كل شيء فسأكتبها للذين يتقون ويؤتون الزكاة والذين هم بأياتنا يؤمنون الذين يتبعون الرسول النبي الأمي الذي يجدونه مكتربا عندهم في التوراة والإنجيل \" الآية وقال تعالى \" أو لم يكن لهم آية أن يعلمه علماء بني إسرائيل \" الآية وأمثال ذلك مما فيه من الإخبار عن علماء بني إسرائيل أنهم يعلمون ذلك من كتبهم المنزلة.وقد ورد في حديث الأحبار عن عبد الله بن سلام بأنه أسلم بمكة قبل الهجرة.قال الحافظ أبو نعيم الأصبهاني في كتاب دلائل النبوة وهو كتاب جليل حدثنا سليمان بن أحمد الطبراني حدثنا عبدان بن أحمد حدثنا محمد بن مصفى حدثنا الوليد بن مسلم عن محمد بن حمزة بن يوسف بن عبد الله بن سلام عن أبيه عن جده عبد الله بن سلام أنه قال لأحبار اليهود إني أردت أن أحدث بمسجد أبينا إبراهيم وإسماعيل عيدا فانطلق إلى رسول الله صلى الله عليه وسلم وهو بمكة فوافاهم وقد انصرفوا من الحج فوجد رسول الله صلى الله عليه وسلم بمنى والناس حوله فقام مع الناس فلما نظر إليه رسول الله صلى الله عليه وسلم قال \" أنت عبد الله بن سلام ؟ \" قال قلت نعم قال \" أدن \" قال فدنوت منه قال \" أنشدك بالله يا عبد الله بن سلام أما تجدني في التوراة رسول الله ؟ \" فقلت له أنعت ربنا قال فجاء جبريل حتى وقف بين يدي رسول الله صلى الله عليه وسلم فقال له \" قل هو الله أحد الله الصمد \" إلى آخرها فقرأها علينا رسول الله صلى الله عليه وسلم فقال ابن سلام: أشهد أن لا إله إلا الله وأنك رسول الله ثم انصرف ابن سلام إلى المدينة فكتم إسلامه فلما هاجر رسول الله صلى الله عليه وسلم إلى المدينة وأنا فوق نخلة لي أجذها فألقيت نفسي فقالت أمي لله أنت لو كان موسى بن عمران ما كان لك أن تلقي نفسك من رأس النخلة فقلت والله لأنا أسر بقدوم رسول الله صلى الله عليه وسلم من موسى بن عمران إذ بعث وهذا حديث غريب جدا. آخر تفسير سورة الرعد ولله الحمد والمنة."
    },
    {
      "ayah": 5,
      "surah": 13,
      "text": "يقول تعالى لرسوله محمد صلى الله عليه وسلم \" وإن تعجب \" من تكذيب هؤلاء المشركين بالمعاد مع ما يشاهدونه من آيات الله سبحانه ودلائله في خلقه على أنه القادر على ما يشاء ومع ما يعترفون به من أنه ابتدأ خلق الأشياء فكونها بعد أن لم تكن شيئا مذكورا ثم هم بعد هذا يكذبون خبره في أنه سيعيد العالم خلقا جديدا وقد اعترفوا وشاهدوا ما هو أعجب مما كذبوا به فالعجب من قولهم \" أئذا كنا ترابا أئنا لفي خلق جديد \" وقد علم كل عالم وعاقل أن خلق السموات والأرض أكبر من خلق الناس وأن من بدأ الخلق فالإعادة عليه أسهل كما قال تعالى \" أو لم يروا أن الله الذي خلق السموات والأرض ولم يعي بخلقهن بقادر على أن يحيي الموتى بلى إنه على كل شيء قدير \" ثم نعت المكذبين بهذا فقال \" أولئك الذين كفروا بربهم وأولئك الأغلال في أعناقهم \" أي يسحبون بها في النار \"وأولئك أصحاب النار هم فيها خالدون \" أي ماكثون فيها أبدا لا يحولون عنها ولا يزولون."
    },
    {
      "ayah": 6,
      "surah": 13,
      "text": "يقول تعالى \" ويستعجلونك \" أي هؤلاء المكذبون \" بالسيئة قبل الحسنة\" أي بالعقوبة كما أخبر عنهم في قوله \" وقالوا يا أيها الذي نزل عليه الذكر إنك لمجنون لو ما تأتينا بالملائكة إن كنت من الصادقين ما ننزل الملائكة إلا بالحق وما كانوا إذا منظرين \" وقال تعالي \" ويستعجلونك بالعذاب \" الآيتين وقال تعالى \" سأل سائل بعذاب واقع \" وقال \" يستعجل بها الذين لا يؤمنون بها والذين آمنوا مشفقون منها ويعلمون أنها الحق \" \" وقالوا ربنا عجل لنا قطنا \" الآية أي عقابنا وحسابنا كما قال مخبرا عنهم \" وإذ قالوا اللهم إن كان هذا هو الحق من عندك \" الآية فكانوا من شدة تكذيبهم وعنادهم وكفرهم يطلبون أن يأتيهم بعذاب الله قال الله تعالى \" وقد خلت من قبلهم المثلات \" أي قد أوقعنا نقمنا بالأمم الخالية وجعلناهم عبرة وعظة لمن اتعظ بهم ثم أخبر تعالى أنه لولا حلمه وعفوه لعالجهم بالعقوبة كما قال \" ولو يؤاخذ الله الناس بما كسبوا ما ترك على ظهرها من دابة\" وقال تعالى فى هذه الآية الكريمة \" وإن ربك لذو مغفرة للناس على ظلمهم \" أي أنه تعالى ذو عفو وصفح وستر للناس مع أنهم يظلمون ويخطئون بالليل والنهار ثم قرن هذا الحكم بأنه شديد العقاب ليعتدل الرجاء والخوف كما قال تعالى \" فان كذبوك فقل ربكم ذو رحمة واسعة ولا يرد بأسه عن القوم المجرمين \" وقال \" إن ربك لسريع العقاب وإنه لغفور رحيم \" وقال \" نبئ عبادي أني أنا الغفور الرحيم وأن عذابي هو العذاب الأليم \" إلى أمثال ذلك من الآيات التي تجمع الرجاء والخوف وقال ابن أبي حاتم حدثنا أبي حدثنا موسى بن إسماعيل حدثنا حماد عن علي بن زيد عن سعيد بن المسيب قال: لما نزلت هذه الآية \" وإن ربك لذو مغفرة للناس على ظلمهم \" الآية قال رسول الله صلى الله عليه وسلم وعلى آله وسلم \" لولا عفو الله وتجاوزه ما هنأ أحدا العيش ولولا وعيده وعقابه لاتكل كل واحد \".وروى الحافظ ابن عساكر في ترجمة الحسن بن عثمان أبي حسان الرمادي أنه رأى رب العزة في النوم ورسول الله واقف بين يديه يشفع في رجل من أمته فقال له ألم يكفك أني أنزلت عليك في سورة الرعد \" وإن ربك لذو مغفرة للناس على ظلمهم \" قال ثم انتبهت."
    },
    {
      "ayah": 7,
      "surah": 13,
      "text": "يقول تعالى إخبارا عن المشركين أنهم يقولون كفرا وعنادا لولا يأتينا بآية من ربه كما أرسل الأولون كما تعنتوا عليه أن يجعل لهم الصفا ذهبا وأن يزيح عنهم الجبال ويجعل مكانها مروجا وأنهارا قال تعالى \" وما منعنا أن نرسل بالآيات إلا أن كذب بها الأولون \" الآية قال الله تعالى \" إنما أنت منذر \" أي إنما عليك أن تبلغ رسالة الله التي أمرك بها و\" ليس عليك هداهم ولكن الله يهدي من يشاء وقوله \" ولكل قوم هاد \" قال علي بن أبي طلحة عن ابن عباس: أي ولكل قوم داع وقال العوفي عن ابن عباس في الآية يقول الله تعالى أنت يا محمد منذر وأنا هادي كل قوم وكذا قال مجاهد وسعيد بن جبير والضحاك وغير واحد وعن مجاهد \" ولكل قوم هاد \" أي نبي كقوله\" وإن من أمة إلا خلا فيها نذير \" وبه قال قتادة وعبد الرحمن بن زيد وقال أبو صالح ويحيى بن رافع \" ولكل قوم هاد \" أى قائد وقال أبو العالية الهادي القائد والقائد الإمام والإمام العمل وعن عكرمة وأبي الضحى \" ولكل قوم هاد \" قالا هو محمد صلى الله عليه وسلم وقال مالك \" ولكل قوم هاد \" يدعوهم إلى الله عز وجل وقال أبو جعفر بن جرير حدثني أحمد بن يحيى الصوفي حدثنا الحسن بن الحسين الأنصاري حدثنا معاذ بن مسلم حدثنا الهروي عن عطاء بن السائب عن سعيد بن جبير عن ابن عباس رضي الله عنهما قال لما نزلت \" إنما أنت منذر ولكل قوم هاد \" قال وضع رسول الله صلى الله عليه وآله وسلم يده على صدره وقال \" أنا المنذر ولكل قوم هاد \" وأومأ بيده إلى منكب علي فقال \" أنت الهادي يا علي بك يهتدي المهتدون من بعدي \".وهذا الحديث فيه نكارة شديدة ; وقال ابن أبي حاتم حدثنا علي بن الحسين حدثنا عثمان بن أبي شيبة حدثنا المطلب بن زياد عن السدي عن عبد خير عن علي \" ولكل قوم هاد \" قال الهادي رجل من بني هاشم قال الجنيد هو علي بن أبي طالب رضي الله عنه قال ابن أبي حاتم وروى عن ابن عباس في إحدى الروايات وعن أبي جعفر محمد بن علي نحو ذلك."
    },
    {
      "ayah": 8,
      "surah": 13,
      "text": "يخبر تعالى عن تمام علمه الذي لا يخفى عليه شيء وأنه محيط بما تحمله الحوامل من كل إناث الحيوانات كما قال تعالى \" ويعلم ما في الأرحام\" أي ما حملت من ذكر أو أنثى أو حسن أو قبيح أو شقي أو سعيد أو طويل العمر أو قصيره كقوله تعالى \" هو أعلم بكم إذ أنشأكم من الأرض وإذ أنتم أجنة \" الآية وقال تعالى \" يخلقكم في بطون أمهاتكم خلقا من بعد خلق في ظلمات ثلاث \" أي خلقكم طورا من بعد طور كما قال تعالى \" ولقد خلقنا الإنسان من سلالة من طين ثم جعلناه نطفة في قرار مكين ثم خلقنا النطفة علقة فخلقنا العلقة مضغة فخلقنا المضغة عظاما فكسونا العظام لحما أم أنشأناه خلقا آخر فتبارك الله أحسن الخالقين \" وفى الصحيحين عن ابن مسعود قال: قال رسول الله صلى الله عليه وسلم الله عليه وعلى آله وسلم \" إن خلق أحدكم يجمع في بطن أمه أربعين يوما ثم يكون علقة مثل ذلك ثم يكون مضغة مثل ذلك ثم يبعث الله إليه ملكا فيؤمر بأربع كلمات: بكتب رزقه وعمره وعمله وشقي أو سعيد \".وفي الحديث الآخر \" فيقول الملك أي رب أذكر أم أنثى ؟ أي رب أشقي أم سعيد ؟ فما الرزق ؟ فما الأجل ؟ فيقول الله ويكتب الملك \" وقوله \" وما تغيض الأرحام وما تزداد \" قال البخاري حدثنا إبراهيم بن المنذر حدثنا معن حدثنا مالك عن عبد الله بن دينار عن ابن عمر أن رسول الله صلى الله عليه وسلم قال \" مفاتيح الغيب خمس لا يعلمهن إلا الله لا يعلم ما في غد إلا الله ولا يعلم ما تغيض الأرحام إلا الله ولا يعلم متى يأتي المطر أحد إلا الله ولا تدري نفس بأي أرض تموت ولا يعلم متى تقوم الساعة إلا الله \" وقال العوفي عن ابن عباس \" وما تغيض الأرحام \" يعني السقط \" وما تزداد \" يقول ما زادت الرحم في الحمل على ما غاضت حتى ولدته تماما وذلك أن من النساء من تحمل عشرة أشهر ومن تحمل تسعة أشهر ومنهن من تزيد في الحمل ومنهن من تنقص فذلك الغيض والزيادة التي ذكر الله تعالى وكل ذلك بعلمه تعالى وقال الضحاك عن ابن عباس في قوله \" وما تغيض الأرحام وما تزداد \" قال ما نقصت عن تسعة وما زاد عليها وقال الضحاك وضعتني أمي وقد حملتني في بطنها سنتين وولدتني وقد نبتت ثنيتي وقال ابن جريج عن جميلة بنت سعد عن عائشة قالت: لا يكون الحمل أكثر من سنتين قدر ما يتحرك ظل مغزل وقال مجاهد \" وما تغيض الأرحام وما تزداد \" قال ما ترى من الدم في حملها وما تزداد على تسعة أشهر وبه قال عطية العوفي والحسن البصري وقتادة والضحاك وقال مجاهد أيضا إذا رأت المرأة الدم دون التسعة زاد علي التسعة مثل أيام الحيض وقال عكرمة وسعيد بن جبير وابن زيد وقال مجاهد أيضا \" وما تغيض الأرحام \" إراقة الدم حتى يخس الولد \" وما تزداد \" إن لم تهرق الدم تم الولد وعظم وقال مكحول: الجنين في بطن أمه لا يطلب ولا يحزن ولا يغتم وإنما يأتيه رزفه في بطن أمه من دم حيضتها فمن ثم لا تحيض الحامل فإذا وقع إلى الأرض استهل واستهلاله استنكاره لمكانه ; فإذا قطعت سرته حول الله رزقه إلى ثديي أمه حتى لا يحزن ولا يطلب ولا يغتم ثم يصير طفلا يتناول الشيء بكفه فيأكله فإذا هو بلغ قال هو الموت أو القتل أنى لي بالرزق ؟ فيقول مكحول يا ويحك غذاك وأنت في بطن أمك وأنت طفل صغير حتى إذا اشتددت وعقلت قلت هو الموت أو القتل أنى لي بالرزق ؟ ثم قرأ مكحول \" الله يعلم ما تحمل كل أنثى \" الآية وقال قتادة \" وكل شيء عنده بمقدار \" أي بأجل حفظ أرزاق خلقه وآجالهم وجعل لذلك أجلا معلوما.وفي الحديث الصحيح أن إحدى بنات النبي صلى الله عليه وسلم بعثت إليه أن ابنا لها في الموت وأنها تحب أن يحضره فبعث إليها يقول \" إن لله ما أخذ وله ما أعطى وكل شيء عنده بأجل مسمى فمروها فلتصبر ولتحتسب \" الحديث بتمامه."
    },
    {
      "ayah": 9,
      "surah": 13,
      "text": "وقوله \" عالم الغيب والشهادة \" أي يعلم كل شيء مما يشاهده العباد ومما يغيب عنهم ولا يخفى عليه منه شيء \" الكبير \" الذي هو أكبر من كل شيء \" المتعال \" أي على كل شيء \" قد أحاط بكل شيء علما\" وقهر كل شيء فخضعت له الرقاب ودان له العباد طوعا وكرها."
    }
  ]
}
