{
  "ayahs": [
    {
      "ayah": 1,
      "surah": 14,
      "text": "قد اختلف المفسرون في الحروف المقطعة التي في أوائل السور فمنهم من قال هي مما استأثر الله بعلمه فردوا علمها إلى الله ولم يفسرها حكاه القرطبي في تفسـره عن أبي بكر وعمر وعثمان وعلي وابن مسعود رضي الله عنهم أجمعين وقاله عامر الشعبي وسفيان الثوري والربيع بن خيثم واختاره أبو حاتم بن حبان. ومنهم من فسرها واختلف هؤلاء في معناها فقال عبدالرحمن بن زيد بن أسلم إنما هي أسماء السور. قال العلامة أبو القاسم محمود بن عمر الزمخشري في تفسيره وعليه إطباق الأكثر ونقل عن سيبويه أنه نص عليه ويعتضد لهذا بما ورد في الصحيحين عن أبي هريرة أن رسول الله صلى الله عليه وسلم كان يقرأ في صلاة الصبح يوم الجمعة \"الم\" السجدة و \"هل أتى على الإنسان\" وقال سفيان الثوري عن ابن أبي نجيح عن مجاهد أنه قال: الم وحم والمص وص. فواتح افتتح الله بها القرآن وكذا قال غيره عن مجاهد وقال مجاهد في رواية أبي حذيفة موسى بن مسعود عن شبل عن ابن أبي نجيح عنه أنه قال الم اسم من أسماء القرآن وهكذا وقال قتادة وزيد بن أسلم ولعل هذا يرجع إلى معنى قول عبدالرحمن بن زيد بن أسلم أنه اسم من أسماء السور فإن كل سورة يطلق عليها اسم القرآن فإنه يبعد أن يكون المص اسما للقرآن كله لأن المتبادر إلى فهم سامع من يقول قرأت المص إنما ذلك عبارة عن سورة الأعراف لا لمجموع القرآن والله أعلم. وقيل هي اسم من أسماء الله تعالى فقال عنها في فواتح السور من أسماء الله تعالى وكذلك قال سالم بن عبدالله وإسماعيل بن عبدالرحمن السدي الكبير وقال شعبة عن السدي بلغني أن ابن عباس قال الم اسم من أسماء الله الأعظم. هكذا رواه ابن أبي حاتم من حديث شعبة ورواه ابن جرير عن بندار عن ابن مهدي عن شعبة قال سألت السدي عن حم وطس والم فقال قال ابن عباس هي اسم الله الأعظم وقال ابن جرير وحدثنا محمد بن المثنى حدثنا أبو النعمان حدثنا شعبة عن إسماعيل السدي عن مرة الهمذاني قال: قال عبدالله فذكر نحوه. وحُكي مثله عن علي وابن عباس وقال علي بن أبي طلحة عن ابن عباس هو قسم أقسم الله به وهو من أسماء الله تعالى وروى ابن أبي حاتم وابن جرير من حديث ابن علية عن خالد الحذاء عن عكرمة أنه قال الم قسم. وروينا أيضا من حديث شريك بن عبدالله بن عطاء بن السائب عن أبى الضحى عن ابن عباس: الم قال أنا الله أعلم وكذا قال سعيد بن جبير وقال السدي عن أبي مالك وعن أبي صالح عن ابن عباس وعن مرة الهمذاني عن ابن مسعود وعن ناس من أصحاب النبي صلى الله عليه وسلم الم قال أما الم فهي حروف استفتحت من حروف هجاء أسماء الله تعالى. قال وأبو جعفر الرازي عن الربيع بن أنس عن أبي العالية في قوله تعالى الم قال هذه الأحرف الثلاثة من التسعة والعشرين حرفا دارت فيها الألسن كلها ليس منها حرف إلا وهو مفتاح اسم من أسمائه وليس منها حرف إلا وهو من آلائه وبلألائه ليس منها حرف إلا وهو في مدة أقوام وآجالهم. قال عيسى ابن مريم عليه السلام وعجب: فقال أعجب أنهم يظنون بأسمائه ويعيشون في رزقه فكيف يكفرون به فالألف مفتاح الله واللام مفتاح اسمه لطيف والميم مفتاح اسمه مجيد فالألف آلاء الله واللام لطف الله والميم مجد الله والألف سنة واللام ثلاثون سنة والميم أربعون سنة. هذا لفظ ابن أبي حاتم ونحوه رواه ابن جرير ثم شرع يوجه كل واحد من هذه الأقوال ويوفق بينها وأنه لا منافاة بين كل واحد منها وبين الآخر وأن الجمع ممكن فهي أسماء للسور ومن أسماء الله تعالى يفتتح بها السور فكل حرف منها دل على اسم من أسمائه وصفة من صفاته كما افتتح سورا كثيرة بتحميده وتسبيحه وتعظيمه قال ولا مانع من دلالة الحرف منها على اسم من أسماء الله وعلى صفة من صفاته وعلى مدة وغير ذلك كما ذكره الربيع بن أنس عن أبي العالية لأن الكلمة الواحدة تطلق على معاني كثيرة كلفظة الأمة فإنها تطلق ويراد به الدين كقوله تعالى \"إنا وجدنا آباءنا على أمة\" وتطلق ويراد بها الرجل المطيع لله كقوله تعالى \"إن إبراهيم كان أمة قانتا لله حنيفا ولم يك من المشركين\" وتطلق ويراد بها الجماعة كقوله تعالى \"وجد عليه أمة من الناس يسقون\" وقوله تعالى \"ولقد بعثنا في كل أمة رسولا\" وتطلق ويراد بها الحين من الدهر كقوله تعالى \"وقال الذي نجا منهما وادكر بعد أمة\" أي بعد حين على أصح القولين قال فكذلك هذا. هذا حاصل كلامه موجها ولكن هذا ليس كما ذكره أبو العالية فإن أبا العالية زعم أن الحرف دل على هذا وعلى هذا وعلى هذا معا ولفظة الأمة وما أشبهها من الألفاظ المشتركة في الاصطلاح إنما دل في القرآن في كل موطن على معنى واحد دل عليه سياق الكلام فأما حمله على مجموع محامله إذا أمكن فمسألة مختلف فيها بين علماء الأصول ليس هذا موضع البحث فيها والله أعلم. ثم إن لفظة الأمة تدل على كل من معانيها في سياق الكلام بدلالة الوضع فأما دلالة الحرف الواحد على اسم يمكن أن يدل على اسم آخر من غير أن يكون أحدهما أولى من الآخر في التقدير أو الإضمار بوضع ولا بغيره فهذا مما لا يفهم إلا بتوقيف والمسألة مختلف فيها وليس فيها إجماع حتى يحكم به وما أنشدوه من الشواهد على صحة إطلاق الحرف الواحد على بقية الكلمة فإن في السياق ما يدل على ما حذف بخلاف هذا كما قال الشاعر: قلنا قفي لنا فقالت قاف لا تحسبي أنا نسينا الإيجاف تعني وقفت. وقال الآخر: ما للظليم عال كيف لايـ ينقد عنه جلده إذا يـ فقال ابن جرير كأنه أراد أن يقول إذا يفعل كذا وكذا فاكتفى بالياء من يفعل وقال الآخر: بالخير خيرات وان شرا فا ولا أريد الشر إلا أن تـ يقول وإن شرا فشرا ولا أريد الشر إلا أن تشاء فاكتفى بالفاء والتاء من الكلمتين عن بقيتهما ولكن هذا ظاهر من سياق الكلام والله أعلم. قال القرطبي وفي الحديث \"من أعان على قتل مسلم بشطر كلمة\" الحديث قال سفيان هو أن يقول في اقتل\"ا قـ\" وقال خصيف عن مجاهد أنه قال فواتح السور كلها\"ق وص وحم وطسم والر\" وغير ذلك هجاء موضوع وقال بعض أهل العربية هي حروف من حروف المعجم استغنى بذكر ما ذكر منها في أوائل السور عن ذكر بواقيها التي هي تتمة الثمانية والعشرين حرفا كما يقول القائل ابني يكتب في - ا ب ت ث - أي في حروف المعجم الثمانية والعشرين فيستغني بذكر بعضها عن مجموعها حكاه ابن جرير. قلت مجموع الحروف المذكورة في أوائل السور بحذف المكرر منها أربعة عشر حرفا وهي - ال م ص ر ك ه ي ع ط س ح ق ن- يجمعها قولك: نص حكيم قاطع له سر. وهي نصف الحروف عددا والمذكور منها أشرف من المتروك وبيان ذلك من صناعة التصريف. قال الزمخشري وهذه الحروف الأربعة عشر مشتملة على أصناف أجناس الحروف يعني من المهموسة والمجهورة ومن الرخوة والشديدة ومن المطبقة والمفتوحة ومن المستعلية والمنخفضة ومن حروف القلقلة. وقد سردها مفصلة ثم قال: فسبحان الذي دقت في كل شئ حكمته. وهذه الأجناس المعدودة مكثورة بالمذكورة منها وقد علمت أن معظم الشيء وجله ينزل منزلة كله وههنا ههنا لخص بعضهم في هذا المقام كلاما فقال: لا شك أن هذه الحروف لم ينزلها سبحانه وتعالى عبثا ولا سدى ومن قال من الجهلة إن في القرآن ما هو تعبد لا معنى له بالكلمة فقد أخطأ خطأ كبيرا فتعين أن لها معنى في نفس الأمر فإن صح لنا فيها عن المعصوم شيء قلنا به وإلا وقفنا حيث وقفنا وقلنا \"آمنا به كل من عند ربنا\" ولم يجمع العلماء فيها على شيء معين وإنما اختلفوا فمن ظهر له بعض الأقوال بدليل فعليه اتباعه وإلا فالوقف حتى يتبين هذا المقام. المقام الآخر في الحكمة التي اقتضت إيراد هذه الحروف في أوائل السور ما هي مع قطع النظر عن معانيها في أنفسها فقال بعضهم إنما ذكرت ليعرف بها أوائل السور حكاه ابن جرير وهذا ضعيف لأن الفصل حاصل بدونها فيما لم تذكر فيه وفيما ذكرت فيه البسملة تلاوة وكتابة وقال آخرون بل ابتدئ بها لتفتح لاستماعها أسماع المشركين إذ تواصوا بالإعراض عن القرآن حتى إذا استمعوا له تلا عليهم المؤلف منه حكاه ابن جرير أيضا وهو ضعيف أيضا لأنه لو كان كذلك لكان ذلك في جميع السور لا يكون في بعضها بل غالبها ليس كذلك ولو كـان كذلك أيضا لانبغى الابتداء بها في أوائل الكلام معهم سواء كان افتتاح سورة أو غير ذلك ثم إن هذه السورة والتي تليها أعني البقرة وآل عمران مدنيتان ليستا خطابا للمشركين فانتقض ما ذكروه بهذه الوجوه. وقال آخرون بل إنما ذكرت هذه الحروف في أوائل السور التي ذكرت فيها بيانا لإعجاز القرآن وأن الخلق عاجزون عن معارضته بمثله هذا مع أنه مركب من هذه الحروف المقطعة التي يتخاطبون بها وقد حكى هذا المذهب الرازي في تفسيره عن المبرد وجمع من المحققين وحكى القرطبي عن الفراء وقطرب نحو هذا وقرره الزمخشري فى كشافه ونصره أتم نصر وإليه ذهب الشيخ الإمام العلامة أبو العباس ابن تيمية وشيخنا الحافظ المجتهد أبو الحجاج المزي وحكاه لي عن ابن تيمية. قال الزمخشري ولم ترد كلها مجموعة في أول القرآن وإنما كررت ليكون أبلغ في التحدي والتبكيت كما كررت قصص كثيرة وكرر التحدي بالصريح في أماكن قال وجاء منها على حرف واحد كقوله - ص ن ق- وحرفين مثل \"حم\" وثلاثة مثل \"الم\" وأربعة مثل \"المر\" و \"المص\" وخمسة مثل \"كهيعص- و- حمعسق\" لأن أساليب كلامهم على هذا من الكلمات ما هو على حرف وعلى حرفين وعلى ثلاثة وعلى أربعة وعلى خمسة لا أكثر من ذلك \"قلت\" ولهذا كل سورة افتتحت بالحروف فلا بد أن يذكر فيها الانتصار للقرآن وبيان إعجازه وعظمته وهذا معلوم بالاستقراء وهو الواقع في تسع وعشرين سورة ولهذا يقول تعالى \"الم ذلك الكتاب لا ريب فيه\" \"الم الله لا إله إلا هو الحي القيوم نزل عليك الكتاب بالحق مصدقا لما بين يديه\" \"المص كتاب أنزل إليك فلا يكن في صدرك حرج منه\" \"الر كتاب أنزلناه إليك لتخرج الناس من الظلمات إلى النور بإذن ربهم\" \"الم تنزيل الكتاب لا ريب فيه من رب العالمين\" \"حم تنزيل من الرحمن الرحيم\" \"حم عسق كذلك يوحي إليك وإلى الذين من قبلك الله العزيز الحكيم\" وغير ذلك من الآيات الدالة على صحة ما ذهب إليه هؤلاء لمن أمعن النظر والله أعلم. وأما من زعم أنها دالة على معرفة المدد وأنه يستخرج من ذلك أوقات الحوادث والفتن والملاحم فقد ادعى ما ليس له وطار في غير مطاره وقد ورد في ذلك حديث ضعيف وهو مع ذلك أدل على بطلان هذا المسلك من التمسك به على صحته وهو ما رواه محمد بن إسحق بن يسار صاحب المغازي حدثني الكلبي عن أبي صالح عن ابن عباس عن جابر بن عبدالله بن رباب قال مر أبو ياسر بن أخطب في رجال من يهود برسول الله صلى الله عليه وسلم وهو يتلو فاتحة سورة البقرة \"الم ذلك الكتاب لا ريب فيه\" فأتى أخاه بن أخطب في رجال من اليهود فقال تعلمون والله لقد سمعت محمدا يتلو فيما أنزل الله تعالى عليه \"الم ذلك الكتاب لا ريب فيه\" فقال أنت سمعته قال نعم قال فمشى حي بن أخطب في أولئك النفر من اليهود إلى رسول الله صلى الله عليه وسلم فقالوا يا محمد ألم يذكر أنك تتلوا فيما أنزل الله عليك \"الم ذلك الكتاب\"؟ فقال رسول الله صلى الله عليه وسلم \"بلى\" فقالوا جاءك بهذا جبريل من عند الله؟ فقال \"نعم\" قالوا لقد بعث الله قبلك أنبياء ما نعلمه بين لنبي منهم ما مدة ملكه وما أجل أمته غيرك. فقام حي بن أخطب وأقبل على من كان معه فقال لهم الألف واحدة واللام ثلاثون والميم أربعون فهذه إحدى وسبعون سنة أفتدخلون في دين نبي إنما مدة ملكه وأجل أمته إحدى وسبعون سنة؟ ثم أقبل على رسول الله صلى الله عليه وسلم فقال يا محمد هل مع هذا غيره فقال \"نعم\" قال ما ذاك؟ قال \"المص\" قال هذا أثقل وأطول الألف واحد واللام ثلاثون والميم أربعون والصاد تسعون فهذه إحدى وثلاثون ومائة سنة. هل مع هذا يا محمد غيره؟ قال \"نعم\" قال ما ذاك؟ قال \"الر\" قال هذا أثقل وأطول الألف واحدة واللام ثلاثون والراء مائتان فهذه إحدى وثلاثون ومائتا سنة. فهل مع هذا يا محمد غيره؟ قال \"نعم\" قال ماذا قال \"المر\" قال هذه أثقل وأطول الألف واحدة واللام ثلاثون والميم أربعون والراء مائتان فهذه إحدى وسبعون ومائتان ثم قال: لقد لبس علينا أمرك يا محمد حتى ما ندري أقليلا أعطيت أم كثيرا. ثم قال قوموا عنه ثم قال أبو ياسر لأخيه حي بن أخطب ولمن معه من الأحبار ما يدريكم لعله قد جمع هذا لمحمد كله إحدى وسبعون وإحدى وثلاثون ومائة وإحدى وثلاثون ومائتان وإحدى وسبعون ومائتان فذلك سبعمائة وأربع سنين؟ فقالوا لقد تشابه علينا أمره فيزعمون أن هؤلاء الآيات نزلت فيهم \"هو الذي أنزل عليك الكتاب منه آيات محكمات هن أم الكتاب وأخر متشابهات\" فهذا الحديث مداره على محمد بن السائب الكلبي وهو ممن لا يحتج بما انفرد به ثم كان مقتضى هذا المسلك إن كان صحيحا أن يحسب ما لكل حرف من الحروف الأربعة عشر التي ذكرناها وذلك يبلغ منه جملة كثيرة وإن حسبت مع التكرر فأطم وأعظم والله أعلم. \" كتاب أنزلناه إليك \" أي هذا كتاب أنزلناه إليك يا محمد وهو القرآن العظيم الذي هو أشرف كتاب أنزله الله من السماء على أشرف رسول بعثه الله في الأرض إلى جميع أهلها عربهم وعجمهم \" لتخرج الناس من الظلمات إلى النور \" أي إنما بعثناك يا محمد بهذا الكتاب لتخرج الناس مما هم فيه من الضلال والغي إلى الهدى والرشد كما قال تعالى \" الله ولي الذين آمنوا يخرجهم من الظلمات إلى النور والذين كفروا أولياؤهم الطاغوت يخرجونهم من النور إلى الظلمات \" الآية وقال تعالى \" هو الذي ينزل على عبده آيات بينات ليخرجكم من الظلمات إلى النور \" الآية وقوله \" بإذن ربهم \" أي هو الهادي لمن قدر له الهداية على يدي رسوله المبعوث عن أمره يهديهم \" إلى صراط العزيز \" أي العزيز الذي لا يمانع ولا يغالب بل هو القاهر لكل ما سواه \" الحميد \" أي المحمود في جميع أفعاله وأقواله وشرعه وأمره ونهيه الصادق في خبره."
    },
    {
      "ayah": 10,
      "surah": 14,
      "text": "يخبر تعالى عما دار بين الكفار وبين رسلهم من المجادلة وذلك أن أممهم لما واجهوهم بالشك فيما جاءوهم به من عبادة الله وحده لا شريك له قالت الرسل \" أفي الله شك \" وهذا يحتمل شيئين \" أحدهما \"أفي وجوده شك فإن الفطر شاهدة بوجوده ومجبولة على الإقرار به فإن الاعتراف به ضروري في الفطر السليمة ولكن قد يعرض لبعضها شك واضطراب فتحتاج إلى النظر في الدليل الموصل إلى وجوده ولهذا قالت لهم الرسل ترشدهم إلى طريق معرفته بأنه \" فاطر السموات والأرض \" الذي خلقهما وابتدعهما على غير مثال سبق فإن شواهد الحدوث والخلق والتسخير ظاهر عليهما فلا بد لهما من صانع وهو الله لا إله إلا هو خالق كل شيء وإلهه ومليكه ; والمعنى الثاني في قولهم \" أفي الله شك \" أي أفي إلهيته وتفرده بوجوب العبادة له شك وهو الخالق لجميع الموجودات ولا يستحق العبادة إلا هو وحده لا شريك له فإن غالب الأمم كانت مقرة بالصانع ولكن تعبد معه غيره من الوسائط التي يظنونها تنفعهم أو تقربهم من الله زلفى ; وقالت لهم رسلهم \" يدعوكم ليغفر لكم من ذنوبكم \" أي في الدار الآخرة \" ويؤخركم إلى أجل مسمى \" أي في الدنيا كما قال تعالى \" وأن استغفروا ربكم ثم توبوا إليه يمتعكم متاعا حسنا إلى أجل مسمى ويؤت كل ذي فضل فضله \" الآية فقالت لهم الأمم محاجين في مقام الرسالة بعد تقدير تسليمهم المقام الأول وحاصل ما قالوه \" إن أنتم إلا بشر مثلنا \" أي كيف نتبعكم بمجرد قولكم ولما نرى منكم معجزة \" فأتونا بسلطان مبين \" أي خارق نقترحه عليكم."
    },
    {
      "ayah": 11,
      "surah": 14,
      "text": "قالت لهم رسلهم إن نحن إلا بشر مثلكم \" أي صحيح إنا بشر مثلكم فى البشرية \" ولكن الله يمن على من يشاء من عباده \" أي بالرسالة والنبوة \" وما كان لنا أن نأتيكم بسلطان \" على وفق ما سألتم \" إلا بإذن الله \" أي بعد سؤالنا إياه وإذنه لنا في ذلك \" وعلى الله فليتوكل المؤمنون \" أي في جميع أمورهم."
    },
    {
      "ayah": 12,
      "surah": 14,
      "text": "ثم قالت الرسل \" وما لنا أن لا نتوكل على الله \" أي وما يمنعنا من التوكل عليه وقد هدانا لأقوم الطرق وأوضحها وأبينها \" ولنصبرن على ما آذيتمونا \" أي من الكلام السيء والأفعال السخيفة \" وعلى الله فليتوكل المتوكلون \"."
    },
    {
      "ayah": 13,
      "surah": 14,
      "text": "يخبر تعالى عما توعدت به الأمم الكافرة رسلهم من الإخراج من أرضهم والنفي من بين أظهرهم كما قال قوم شعيب له ولمن آمن به \" لنخرجنك يا شعيب والذين آمنوا معك من قريتنا \" الآية وكما قال قوم لوط \" أخرجوا آل لوط من قريتكم \" الآية ; وقال تعالى إخبارا عن مشركي قريش \" وإن كادوا ليستفزونك من الأرض ليخرجوك منها وإذا لا يلبثون خلافك إلا قليلا \" وقال تعالى \" وإذ يمكر بك الذين كفروا ليثبتوك أو يقتلوك أو يخرجوك ويمكرون ويمكر الله والله خير الماكرين \" وكان من صنعه تعالى أنه أظهر رسوله ونصره وجعل له بسبب خروجه من مكة أنصارا وأعوانا وجندا يقاتلون في سبيل الله تعالى ولم يزل يرقيه تعالى من شيء إلى شيء حتى فتح له مكة التي أخرجته ومكن له فيها وأرغم أنوف أعدائه منهم ومن سائر أهل الأرض حتى دخل الناس في دين الله أفواجا وظهرت كلمة الله ودينه على سائر الأديان في مشارق الأرض ومغاربها في أيسر زمان ولهذا قال تعالى \" فأوحى إليهم ربهم لنهلكن الظالمين ولنسكننكم الأرض من بعدهم \" وكما قال \" ولقد سبقت كلمتنا لعبادنا المرسلين إنهم لهم المنصورون وإن جندنا لهم الغالبون \" وقال تعالى \" كتب الله لأغلبن أنا ورسلي إن الله قوي عزيز \" وقال تعالى \" ولقد كتبنا في الزبور من بعد الذكر \" الآية \" وقال موسى لقومه استعينوا بالله واصبروا إن الأرض لله يورثها من يشاء من عباده والعاقبة للمتقين \" وقال تعالى \" وأورثنا القوم الذين كانوا يستضعفون مشارق الأرض ومغاربها التي باركنا فيها وتمت كلمة ربك الحسنى على بني إسرائيل بما صبروا ودمرنا ما كان يصنع فرعون وقومه وما كانوا يعرشون."
    },
    {
      "ayah": 14,
      "surah": 14,
      "text": "\" وقوله \" ذلك لمن خاف مقامي وخاف وعيد \" أي وعيدي هذا لمن خاف مقامي بين يدي يوم القيامة وخشي من وعيدي وهو تخويفي وعذابي كما قال تعالى \" فأما من طغى وآثر الحياة الدنيا فإن الجحيم هي المأوى \" وقال \" ولمن خاف مقام ربه جنتان."
    },
    {
      "ayah": 15,
      "surah": 14,
      "text": "\" وقوله \" واستفتحوا \" أي استنصرت الرسل ربها على قومها قاله ابن عباس ومجاهد وقتادة وقال عبد الرحمن بن زيد بن أسلم استفتحت الأمم على أنفسها كما قالوا \" اللهم إن كان هذا هو الحق من عندك فأمطر علينا حجارة من السماء أو ائتنا بعذاب أليم \" ويحتمل أن يكون هذا مرادا وهذا مرادا كما أنهم استفتحوا على أنفسهم يوم بدر واستفتح رسول الله صلى الله عليه وسلم واستنصر وقال الله تعالى للمشركين \" إن تستفتحوا فقد جاءكم الفتح وإن تنتهوا فهو خير لكم \" الآية والله أعلم \" وخاب كل جبار عنيد \" أي متجبر فى نفسه عنيد معاند للحق كقوله تعالى \" ألقيا في جهنم كل كفار عنيد مناع للخير معتد مريب الذي جعل مع الله إلها آخر فألقياه في العذاب الشديد \" وفي الحديث \" إنه يؤتى بجهنم يوم القيامة فتنادي الخلائق فتقول إني وكلت بكل جبار عنيد \" الحديث خاب وخسر حين اجتهد الأنبياء في الابتهال إلى ربها العزيز المقتدر."
    },
    {
      "ayah": 16,
      "surah": 14,
      "text": "وقوله \" من ورائه جهنم \" وراء هنا بمعنى أمام كقوله تعالى \" وكان وراءهم ملك يأخذ كل سفينة غصبا \" وكان ابن عباس يقرؤها وكان أمامهم ملك أي من وراء الجبار العنيد جهنم أي هي له بالمرصاد يسكنها مخلدا يوم المعاد ويعرض عليها غدوا وعشيا إلى يوم التناد \" ويسقى من ماء صديد \" أي في النار ليس له شراب إلا من حميم وغساق فهذا حار في غاية الحرارة وهذا بارد فى غاية البرد والنتن كما قال \" هذا فليذوقوه حميم وغساق وآخر من شكله أزواج \" وقال مجاهد وعكرمة: الصديد من القيح والدم وقال قتادة هو ما يسيل من لحمه وجلده وفي رواية عنه: الصديد ما يخرج من جوف الكافر قد خالط القيح والدم ومن حديث شهر بن حوشب عن أسماء بنت يزيد بن السكن قالت: قلت يا رسول الله ما طينة الخبال ؟ قال \" صديد أهل النار\" وفي رواية \" عصارة أهل النار \" وقال الإمام أحمد حدثنا علي بن إسحاق أنبأنا عبد الله أنا صفوان بن عمرو عن عبيد الله بن بشر عن أبي أمامة رضي الله عنه عن النبي صلى الله عليه وسلم في قوله \" ويسقى من ماء صديد يتجرعه \" قال \" يقرب إليه فيتكرهه فإذا أدني منه شوى وجهه ووقعت فروة رأسه فإذا شربه قطع أمعاءه حتى يخرج من دبره \" يقول الله تعالى \" وسقوا ماء حميما فقطع أمعاءهم \" ويقول \" وإن يستغيثوا يغاثوا بماء كالمهل يشوي الوجوه \" الآية وهكذا رواه ابن جرير من حديث عبد الله بن المبارك به ورواه هو وابن أبي حاتم من حديث بقية بن الوليد عن صفوان بن عمرو به."
    },
    {
      "ayah": 17,
      "surah": 14,
      "text": "وقوله \" يتجرعه \" أي يتغصصه ويتكرهه أي يشربه قهرا وقسرا لا يضعه في فمه حتى يضربه الملك بمطراق من حديد كما قال تعالى \" ولهم مقامع من حديد \" \" ولا يكاد يسيغه \" أي يزدريه لسوء طعمه ولونه وريحه وحرارته أو برده الذي لا يستطاع \" ويأتيه الموت من كل مكان \" أي يألم له جميع بدنه وجوارحه وأعضائه قال عمرو بن ميمون بن مهران من كل عظم وعصب وعرق وقال عكرمة حتى من أطراف شعره وقال إبراهيم التيمي من موضع كل شعرة أي من جسده حتى من أطراف شعره وقال ابن جرير \" ويأتيه الموت من كل مكان \" أي من أمامه وخلفه وفي رواية وعن يمينه وشماله ومن فوقه ومن تحت أرجله ومن سائر أعضاء جسده وقال الضحاك عن ابن عباس \" ويأتيه الموت من كل مكان \" قال أنواع العذاب الذي يعذبه الله بها يوم القيامة في نار جهنم ليس منها نوع إلا يأتيه الموت منه لو كان يموت ولكن لا يموت لأن الله تعالى قال \" لا يقضى عليهم فيموتوا ولا يخفف عنهم من عذابا \" ومعنى كلام ابن عباس رضي الله عنه: أنه ما من نوع من هذه الأنواع من العذاب إلا إذا ورد عليه اقتضى أن يموت منه لو كان يموت ولكنه لا يموت ليخلد في دوام العذاب والنكال ولهذا قال تعالى \" ويأتيه الموت من كل مكان وما هو بميت \" وقوله \" ومن ورائه عذاب غليظ \" أى وله من بعد هذه الحال عذاب آخر غليظ أي مؤلم صعب شديد أغلظ من الذي قبله وأدهى وأمر وهذا كما قال تعالى عن شجرة الزقوم \" إنها شجرة تخرج في أصل الجحيم طلعها كأنه رءوس الشياطين فإنهم لآكلون منها فمالئون منها البطون ثم إن لهم عليها لشوبا من حميم ثم إن مرجعهم لإلى الجحيم \" فأخبر أنهم تارة يكونون في أكل زقوم وتاره في شرب حميم وتارة يردون إلى جحيم عياذا بالله من ذلك وهكذا قال تعالى \" هذه جهنم التي يكذب بها المجرمون يطوفون بينها وبين حميم آن \" وقال تعالى \" إن شجرة الزقوم طعام الأثيم كالمهل يغلي في البطون كغلي الحميم خذوه فاعتلوه إلى سواء الجحيم ثم صبوا فوق رأسه من عذاب الحميم ذق إنك أنت العزيز الكريم إن هذا ما كنتم به تمترون \" وقال \" وأصحاب الشمال ما أصحاب الشمال في سموم وحميم وظل من يحموم لا بارد ولا كريم \" وقال تعالى \" هذا وإن للطاغين لشر مآب جهنم يصلونها فبئس المهاد \" \" هذا فليذوقوه حميم وغساق وآخر من شكله أزواج \" إلى غير ذلك من الآيات الدالة على تنوع العذاب عليهم وتكراره وأنواعه وأشكاله مما لا يحصيه إلا الله عز وجل جزاء وفاقا \" وما ربك بظلام للعبيد \"."
    },
    {
      "ayah": 18,
      "surah": 14,
      "text": "هذا مثل ضربه الله تعالى لأعمال الكفار الذين عبدوا معه غيره وكذبوا رسله وبنوا أعمالهم على غير أساس صحيح فانهارت وعدموها أحوج ما كانوا إليها فقال تعالى \" مثل الذين كفروا بربهم أعمالهم \" أي مثل أعمالهم يوم القيامة إذا طلبوا ثوابها من الله تعالى لأنهم كانوا يحسبون أنهم كانوا على شيء فلم يجدوا شيئا ولا ألفوا حاصلا إلا كما يتحصل من الرماد إذا اشتدت به الريح العاصفة \" في يوم عاصف \" أي ذي ريح شديدة عاصفة قوية فلم يقدروا على شيء من أعمالهم التي كسبوا فى الدنيا إلا كما يقدرون على جمع هذا الرماد في هذا اليوم كقوله تعالى \" وقدمنا إلى ما عملوا من عمل فجعلناه هباء منثورا \" وقوله تعالى \" مثل ما ينفقون في هذا الحياة الدنيا كمثل ريح فيها صر أصابت حرث قوم ظلموا أنفسهم فأهلكته وما ظلمهم الله ولكن أنفسهم يظلمون \" وقوله تعالى \" يا أيها الذين آمنوا لا تبطلوا صدقاتكم بالمن والأذى كالذي ينفق ماله رئاء الناس ولا يؤمن بالله واليوم الآخر فمثله كمثل صفوان عليه تراب فأصابه وابل فتركه صلدا لا يقدرون على شيء مما كسبوا والله لا يهدي القوم الكافرين \" وقوله في هذه الآية \" ذلك هو الضلال البعيد \" أي سعيهم وعملهم على غير أساس ولا استقامة حتى فقدوا ثوابهم أحوج ما كانوا إليه \" ذلك هو الضلال البعيد \"."
    },
    {
      "ayah": 19,
      "surah": 14,
      "text": "يقول تعالى مخبرا عن قدرته على معاد الأبدان يوم القيامة بأنه خلق السموات والأرض التي هي أكبر من خلق الناس أفليس الذي قدر على خلق هذه السموات فى ارتفاعها واتساعها وعظمتها وما فيها من الكواكب الثوابت والسيارات والحركات المختلفات والآيات الباهرات وهذه الأرض بما فيها من مهاد ووهاد وأوتاد وبراري وصحارى وقفار وبحار وأشجار ونبات وحيوان على اختلاف أصنافها ومنافعها وأشكالها وألوانها \" أولم يروا أن الله الذي خلق السموات والأرض ولم يعي بخلقهن بقادر على أن يحيى الموتى بلى إنه على كل شيء قدير \" وقال تعالى \" أولم ير الإنسان أنا خلقناه من نطفة فإذا هو خصيم مبين وضرب لنا مثلا ونسي خلقه قال من يحيي العظام وهي رميم قل يحيها الذي أنشأها أول مرة وهو بكل خلق عليم الذي جعل لكم من الشجر الأخضر نارا فإذا أنتم منه توقدون أوليس الذي خلق السموات والأرض بقادر على أن يخلق مثلهم بلى وهو الخلاق العليم إنها أمره إذا أراد شيئا أن يقول له كن فيكون فسبحان الذي بيده ملكوت كل شيء وإليه ترجعون \"."
    },
    {
      "ayah": 2,
      "surah": 14,
      "text": "وقوله \" الله الذي له ما في السموات وما في الأرض \" قرأ بعضهم مستأنفا مرفوعا وقرأ آخرون على الاتباع صفة للجلالة كقوله تعالى \" قل يا أيها الناس إني رسول الله إليكم جميعا الذي له ملك السموات والأرض \" الآية وقوله \" وويل للكافرين من عذاب شديد \" أي ويل لهم يوم القيامة إذ خالفوك يا محمد وكذبوك."
    },
    {
      "ayah": 20,
      "surah": 14,
      "text": "وقوله \" إن يشأ يذهبكم ويأت بخلق جديد وما ذلك على الله بعزيز \" أي بعظيم ولا ممتنع بل هو سهل عليه إذا خالفتم أمره أن يذهبكم ويأت بآخرين على غير صفتكم كما قال \" يا أيها الناس أنتم الفقراء إلى الله والله هو الغني الحميد إن يشأ يذهبكم ويأت بخلق جديد وما ذلك على الله بعزيز \" وقال \" وإن تتولوا يستبدل قوما غيركم ثم لا يكونوا أمثالكم \" وقال \" يا أيها الذين آمنوا من يرتد منكم عن دينه فسوف يأتي الله بقوم يحبهم ويحبونه \" وقال \" إن يشأ يذهبكم ويأت بآخرين وكان الله على ذلك قديرا \"."
    },
    {
      "ayah": 21,
      "surah": 14,
      "text": "يقول تعالى \" وبرزوا \" أي برزت الخلائق كلها برها فاجرها لله الواحد القهار اي اجتمعوا له في براز من الأرض وهو المكان الذي ليس فيه شيء يستر أحدا \" فقال الضعفاء \" وهم الأتباع لقادتهم وسادتهم وكبرائهم \" للذين استكبروا \" عن عبادة الله وحده لا شريك له وعن موافقة الرسل قالوا لهم \" إنا كنا لكم تبعا \" أي مهما أمرتمونا ائتمرنا وفعلنا \" فهل أنتم مغنون عنا من عذاب الله من شئ \" أي فهل تدفعون عنا شيئا من عذاب الله كما كنتم تعدوننا وتمنوننا فقالت القادة لهم \" لو هدانا الله لهديناكم \" ولكن حق علينا قول ربنا وسبق فينا وفيكم قدر الله وحقت كلمة العذاب على الكافرين \" سواء علينا أجزعنا أم صبرنا ما لنا من محيص \" أي ليس لنا خلاص مما نحن فيه إن صبرنا عليه أو جزعنا منه.قال عبد الرحمن بن زيد بن أسلم: إن أهل النار قال بعضهم لبعض تعالوا فإنما أدرك أهل الجنة الجنة ببكائهم وتضرعهم إلى الله عز وجل تعالوا نبك ونتضرع إلى الله فبكوا وتضرعوا فلما رأوا أنه لا ينفعهم قالوا إنما أدرك أهل الجنة الجنة بالصبر تعالوا حتى نصبر فصبروا صبرا لم ير مثله فلم ينفعهم ذلك فعند ذلك قالوا \" سواء علينا أجزعنا أم صبرنا \" الآية قلت والظاهر أن هذه المراجعة في النار بعد دخولهم إليها كما قال تعالى \" وإذ يتحاجون في النار فيقول الضعفاء للذين استكبروا إنا كنا لكم تبعا فهل أنتم مغنون عنا نصيبا من النار قال الذين استكبروا إنا كل فيها إن الله قد حكم بين العباد \" وقال تعالى \" قال ادخلوا في أمم قد خلت من قبلكم من الجن والإنس في النار كلما دخلت أمة لعنت أختها حتى إذا اداركوا فيها جميعا قالت أخراهم لأولاهم ربنا هؤلاء أضلونا فآتهم عذابا ضعفا من النار قال لكل ضعف ولكن لا تعلمون وقالت أولاهم لأخراهم فما كان لكم علينا من فضل فذوقوا العذاب بما كنتم تكسبون \" وقال تعالى \" ربنا إنا أطعنا سادتنا وكبراءنا فأضلونا السبيلا ربنا آتهم ضعفين من العذاب والعنهم لعنا كبيرا \" وأما تخاصمهم في المحشر فقال تعالى \" ولو ترى إذ الظالمون موقوفون عند ربهم يرجع بعضهم إلى بعض القول يقول الذين استضعفوا للذين استكبروا لولا أنتم لكنا مؤمنين قال الذين استكبروا للذين استضعفوا أنحن صددناكم عن الهدى بعد إذ جاءكم بل كنتم مجرمين وقال الذين استضعفوا للذين استكبروا بل مكر الليل والنهار إذ تأمروننا أن نكفر بالله ونجعل له أندادا وأسروا الندامة لما رأوا العذاب وجعلنا الأغلال في أعناق الذين كفروا هل يجزون إلا ما كانوا يعملون \"."
    },
    {
      "ayah": 22,
      "surah": 14,
      "text": "يخبر تعالى عما خاطب به إبليس أتباعه بعدما قضى الله بين عباده فأدخل المؤمنين الجنات وأسكن الكافرين الدركات فقام فيهم إبليس لعنه الله يومئذ خطيبا ليزيدهم حزنا إلى حزنهم وغبنا إلى غبنهم وحسرة إلى حسرتهم فقال \" إن الله وعدكم وعد الحق \" أي على ألسنة رسله ووعدكم في اتباعهم النجاة والسلامة وكان وعدا حقا وخبرا صدقا وأما أنا فوعدتكم فأخلفتكم كما قال تعالى \" يعدهم ويمنيهم وما يعدهم الشيطان إلا غرورا \" ثم قال \" وما كان لي عليكم من سلطان \" أي ما كان لي دليل فيما دعوتكم إليه ولا حجة فيما وعدتكم به \" إلا أن دعوتكم فاستجبتم لي \" بمجرد ذلك هذا وقد أقامت عليكم الرسل الحجج والأدلة الصحيحة على صدق ما جاءوكم به فخالفتموهم فصرتم إلى ما أنتم فيه \" فلا تلوموني \" اليوم \" ولوموا أنفسكم \" فإن الذنب لكم لكونكم خالفتم الحجج واتبعتموني بمجرد ما دعوتكم إلى الباطل \" ما أنا بمصرخكم \" أي بنافعكم ومنقذكم ومخلصكم مما أنتم فيه \" وما أنتم بمصرخي \" أي بنافعي بإنقاذي مما أنا فيه من العذاب والنكال \" إني كفرت بما أشركتمون من قبل \" قال قتادة أي بسبب ما أشركتمون من قبل وقال ابن جرير: يقول إني جحدت أن أكون شريكا لله عز وجل وهذا الذي قال هو الراجح كما قال تعالى \" ومن أضل ممن يدعو من دون الله من لا يستجيب له إلى يوم القيامة وهم عن دعائهم غافلون وإذا حشر الناس كانوا لهم أعداء وكانوا بعبادتهم كافرين \" وقال \" كلا سيكفرون بعبادتهم ويكونون عليهم ضدا \" وقوله \" إن الظالمين \" أي في إعراضهم عن الحق واتباعهم الباطل لهم عذاب أليم والظاهر من سياق الآية أن هذه الخطبة تكون من إبليس بعد دخولهم النار كما قدمنا ولكن قد ورد في حديث رواه ابن أبي حازم وهذا لفظه وابن جرير من رواية عبد الرحمن بن زياد: حدثني دخين الحجري عن عقبة بن عامر عن رسول الله صلى الله عليه وسلم أنه قال \" إذا جمع الله الأولين والآخرين فقضى بينهم ففرغ من القضاء قال المؤمنون قد قضى بيننا ربنا فمن يشفع لنا ؟ فيقولون انطلقوا بنا إلى آدم وذكر نوحا وإبراهيم وموسى وعيسى فيقول عيسى أدلكم على النبي الأمي فيأتوني فيأذن الله لي أن أقوم إليه فيثور من مجلسي من أطيب ريح شمها أحد قط حتى آتي ربي فيشفعني ويجعل لي نورا من شعر رأسي إلى ظفر قدمي ثم يقول الكافرون هذا قد وجد المؤمنون من يشفع لهم فمن يشفع لنا ؟ ما هو إلا إبليس هو الذي أضلنا فيأتون إبليس فيقولون قد وجد المؤمنون من يشفع لهم فقم أنت فاشفع لنا فإنك أنت أضللتنا فيقوم فيثور من مجلسه من أنتن ريح شمها أحد قط ثم يعظم نحيبهم \" وقال الشيطان لما قضي الأمر إن الله وعدكم وعد الحق ووعدتكم فأخلفتكم وما كان لي عليكم من سلطان إلا أن دعوتكم فاستجبتم لي فلا تلوموني ولوموا أنفسكم \" وهذا سياق ابن أبي حاتم ورواه المبارك عن رشدين بن سعد عن عبد الرحمن بن زياد بن نعيم عن دخين عن عقبة به مرفوعا وقال محمد بن كعب القرظي رحمه الله لما قال أهل النار \" سواء علينا أجزعنا أم صبرنا ما لنا من محيص \" قال لهم إبليس \" إن الله وعدكم وعد الحق \" الآية فلما سمعوا مقالته مقتوا أنفسهم فنودوا \" لمقت الله أكبر من مقتكم أنفسكم إذ تدعون إلى الإيمان فتكفرون \" وقال عامر الشعبي: يقوم خطيبان يوم القيامة على رءوس الناس يقول الله: تعالى لعيسى ابن مريم \" أأنت قلت للناس اتخذوني وأمي إلهين من دون الله\" -إلى قوله - \" قال الله هذا يوم ينفع الصادقين صدقهم \" قال ويقوم إبليس لعنه الله فيقول \" ما كان لي عليكم من سلطان إلا أن دعوتكم فاستجبتم لي \" الآية."
    },
    {
      "ayah": 23,
      "surah": 14,
      "text": "ثم لما ذكر تعالى مآل الأشقياء وما صاروا إليه من الخزي والنكال وأن خطيبهم إبليس عطف بمآل السعداء فقال \" وأدخل الذين آمنوا وعملوا الصالحات جنات تجري من تحتها الأنهار \" سارحة فيها حيث ساروا وأين ساروا \" خالدين فيها \" ماكثين أبدا لا يحولون ولا يزولون \" بإذن ربهم تحيتهم فيها سلام \" كما قال تعالى \" حتى إذا جاءوها وفتحت أبوابها وقال لهم خزنتها سلام عليكم \" وقال تعالى \" والملائكة يدخلون عليهم من كل باب سلام عليكم \" وقال تعالى \" ويلقون فيها تحية وسلاما \" وقال تعالى \" دعواهم فيها سبحانك اللهم وتحيتهم فيها سلام وآخر دعواهم أن الحمد لله رب العالمين \"."
    },
    {
      "ayah": 24,
      "surah": 14,
      "text": "قال علي بن أبي طلحة عن ابن عباس في قوله \" مثلا كلمة طيبة \" شهادة أن لا إله إلا الله \" كشجرة طيبة \" وهو المؤمن \" أصلها ثابت \" يقول لا إله إلا الله في قلب المؤمن \" وفرعها في السماء \" يقول يرفع بها عمل المؤمن إلى السماء وهكذا قال الضحاك وسعيد بن جبير وعكرمة ومجاهد وغير واحد إن ذلك عبارة عن عمل المؤمن وقوله الطيب وعمله الصالح وإن المؤمن كشجرة من النخل لا يزال يرفع له عمل صالح في كل حين ووقت وصباح ومساء وهكذا رواه السدي عن مرة عن ابن مسعود قال هي النخلة وشعبة عن معاوية بن قرة عن أنس هي النخلة.وحماد بن سلمة عن شعيب بن الحبحاب عن أنس أن رسول الله صلى الله عليه وسلم أتي بقناع بسر فقرأ \" مثلا كلمة طيبة كشجرة طيبة \" قال هي النخلة وروي من هذا الوجه ومن غيره عن أنس موقوفا وكذا نص عليه مسروق ومجاهد وعكرمة وسعيد بن جبير والضحاك وقتادة وغيرهم وقال البخاري: حدثنا عبيد بن إسماعيل عن أبي أسامة عن عبيد الله عن نافع عن ابن عمر قال: كنا عند رسول الله صلى الله عليه وسلم فقال \"أخبروني عن شجرة تشبه -أو- كالرجل المسلم لا يتحات ورقها صيفا ولا شتاء وتؤتي أكلها كل حين بإذن ربها \" قال ابن عمر: فوقع في نفسي أنها النخلة ورأيت أبا بكر وعمر لا يتكلمان فكرهت أن أتكلم فلما لم يقولوا شيئا قال رسول الله صلى الله عليه وسلم \" هي النخلة \" فلما قمنا قلت لعمر: يا أبتاه والله لقد كان وقع في نفسي أنها النخلة قال ما منعك أن تتكلم ؟ قلت لم أركم تتكلمون فكرهت أن أتكلم أو أقول شيئا قال عمر: لأن تكون قلتها أحب إلي من كذا وكذا وقال أحمد: حدثنا سفيان عن ابن أبي نجيح عن مجاهد صحبت ابن عمر إلى المدينة فلم أسمعه يحدث عن رسول الله صلى الله عليه وسلم إلا حديثا واحدا قال: كنا عند رسول الله صلى الله عليه وسلم فأتى بجمار فقال \" من الشجر شجرة مثلها مثل الرجل المسلم \" فأردت أن أقول هي النخلة فنظرت فإذا أنا أصغر القوم فقال رسول الله صلى الله عليه وسلم \" هي النخلة \" أخرجاه وقال مالك وعبد العزيز عن عبد الله بن دينار عن ابن عمر قال: قال رسول الله صلى الله عليه وسلم يوما لأصحابه \" إن من الشجر شجرة لا يطرح ورقها مثل المؤمن \" قال فوقع الناس في شجر الوادي ووقع في قلبي أنها النخلة فاستحييت حتى قال رسول الله صلى الله عليه وسلم \" وهي النخلة \" أخرجاه أيضا وقال ابن أبي حاتم حدثنا أبي حدثنا موسى بن إسماعيل حدثنا أبان يعني ابن زيد العطار حدثنا قتادة أن رجلا قال يا رسول الله ذهب أهل الدثور بالأجور فقال \" أرأيت لو عمد إلى متاع الدنيا فركب بعضه على بعض أكان يبلغ السماء ؟ أفلا أخبرك بعمل أصله في الأرض وفرعه في السماء ؟ قال ما هو يا رسول الله ؟ قال \" تقول لا إله إلا الله والله أكبر وسبحان الله والحمد لله عشر مرات في دبر كل صلاة فذاك أصله في الأرض وفرعه في السماء \" وعن ابن عباس كشجرة طيبة قال هي شجرة في الجنة."
    },
    {
      "ayah": 25,
      "surah": 14,
      "text": "وقوله \" تؤتي أكلها كل حين \" قيل غدوة وعشيا وقيل كل شهر وقيل كل شهرين وقيل كل ستة أشهر وقيل كل سبعة أشهر وقيل كل سنة والظاهر من السياق أن المؤمن مثله كمثل شجرة لا يزال يوجد منها ثمر في كل وقت من صيف أو شتاء أو ليل أو نهار كذلك المؤمن لا يزال يرفع له عمل صالح آناء الليل وأطراف النهار في كل وقت وحين \" بإذن ربها \" أي كاملا كثيرا طيبا مباركا \" ويضرب الله الأمثال للناس لعلهم يتذكرون."
    },
    {
      "ayah": 26,
      "surah": 14,
      "text": "وقوله تعالى \" ومثل كلمة خبيثة كشجرة خبيثة \" هذا مثل كفر الكافر لا أصل له ولا ثبات مشبه بشجرة الحنظل ويقال لها الشريان رواه شعبة عن معاوية بن أبي قرة عن أنس بن مالك أنها شجرة الحنظل وقال أبو بكر البزار الحافظ حدثنا يحيى بن محمد السكن حدثنا أبو زيد سعيد بن الربيع حدثنا شعبة عن معاوية بن قرة عن أنس أحسبه رفعه قال \" مثل كلمة طيبة كشجرة طيبة \" قال هي النخلة \" ومثل كلمة خبيثة كشجرة خبيثة \" قال هي الشريان ثم رواه عن محمد بن المثنى عن غندر عن شعبة عن معاوية عن أنس موقوفا وقال ابن أبي حاتم: حدثنا أبي حدثنا موسى بن إسماعيل حدثنا حماد هو ابن سلمة عن شعيب بن الحبحاب عن أنس بن مالك أن النبي صلى الله عليه وسلم قال \" \" ومثل كلمة خبيثة كشجرة خبيثة \" هي الحنظلة \" فأخبرت بذلك أبا العالية فقال: هكذا كنا نسمع ورواه ابن جرير من حديث حماد بن سلمة به ورواه أبو يعلى في مسنده بأبسط من هذا فقال: حدثنا غسان عن حماد عن شعيب عن أنس أن رسول الله صلى الله عليه وسلم أتى بقناع عليه بسر فقال \" مثلا كلمة طيبة كشجرة طيبة أصلها ثابت وفرعها في السماء تؤتي أكلها كل حين بإذن ربها \" فقال \" هي النخلة \" \" ومثل كلمة خبيثة كشجرة خبيثة اجتثت من فوق الأرض ما لها من قرار \" قال هي الحنظل \" قال شعيب فأخبرت مالك أبا العالية فقال: كذلك كنا نسمع وقوله \" اجتثت \" أي استؤصلت \" من فوق الأرض ما لها من قرار \" أي لا أصل لها ولا ثبات كذلك الكفر لا أصل له ولا فرع ولا يصعد للكافر عمل ولا يتقبل منه شيء."
    },
    {
      "ayah": 27,
      "surah": 14,
      "text": "ويضل الله الظالمين ويفعل الله ما يشاء \" قال البخاري حدثنا ابن الوليد حدثنا شعبة أخبرني علقمة بن مرثد قال سمعت سعد بن عبيدة عن البراء بن عازب رضي الله عنه أن رسول الله صلى الله عليه وسلم قال \" المسلم إذا سئل في القبر شهد أن لا إله إلا الله وأن محمدا رسول الله فذلك قوله \" يثبت الله الذين آمنوا بالقول الثابت في الحياة الدنيا وفي الآخرة \" ورواه مسلم أيضا وبقية الجماعة كلهم من حديث شعبة به وقال الإمام أحمد حدثنا أبو معاوية حدثنا الأعمش عن المنهال بن عمرو عن زاذان عن البراء بن عازب قال خرجنا مع رسول الله صلى الله عليه وسلم في جنازة رجل من الأنصار فانتهينا إلى القبر ولما يلحد فجلس رسول الله صلى الله عليه وسلم وجلسنا حوله كأن على رءوسنا الطير وفي يده عود ينكت به في الأرض فرفع رأسه فقال \" استعيذوا بالله من عذاب القبر \" مرتين أو ثلاثا ثم قال \" إن العبد المؤمن إذا كان في انقطاع من الدنيا وإقبال من الآخرة نزل إليه ملائكة من السماء بيض الوجوه كأن وجوههم الشمس معهم كفن من أكفان الجنة وحنوط من حنوط الجنة حتى يجلسوا منه مد البصر ثم يجيء ملك الموت حتى يجلس عند رأسه فيقول أيتها النفس الطيبة اخرجي إلى مغفرة من الله ورضوان - قال - فتخرج تسيل كما تسيل القطرة من في السقاء فيأخذها فإذا أخذها لم يدعوها في يده طرفة عين حتى يأخذوها فيجعلوها في ذلك الكفن وفي ذلك الحنوط ويخرج منها كأطيب نفحة مسك وجدت على وجه الأرض فيصعدون بها فلا يمرون بها يعني على ملإ من الملائكة إلا قالوا ما هذه الروح الطيبة ؟ فيقولون فلان ابن فلان بأحسن أسمائه التي كانوا يسمونه بها في الدنيا حتى ينتهوا به إلى السماء الدنيا فيستفتحون له فيفتح له فيشيعه من كل سماء مقربوها إلى السماء التي تليها حتى ينتهي بها إلى السماء السابعة فيقول الله اكتبوا كتاب عبدي في عليين وأعيدوه إلى الأرض فإني منها خلقتهم وفيها أعيدهم ومنها أخرجهم تارة أخرى قال فتعاد روحه في جسده فيأتيه ملكان فيجلسانه فيقولان له من ربك ؟ فيقول ربي الله فيقولان له ما دينك ؟ فيقول ديني الإسلام فيقولان له ما هذا الرجل الذي بعث فيكم ؟ فيقول هو رسول الله فيقولان له وما علمك ؟ فيقول قرأت كتاب الله فآمنت به وصدقت فينادي مناد من السماء أن صدق عبدي فأفرشوه من الجنة وألبسوه من الجنة وافتحوا له بابا إلى الجنة - قال - فيأتيه من روحها وطيبها ويفسح له في قبره مد بصره ويأتيه رجل حسن الوجه حسن الثياب طيب الريح فيقول أبشر بالذي كنت يسرك هذا يومك الذي كنت توعد فيقول له من أنت ؟ فوجهك الوجه الذي يأتي بالخير فيقول أنا عملك الصالح فيقول رب أقم الساعة رب أقم الساعة حتى أرجع إلى أهلي ومالي - قال - وإن العبد الكافر إذا كان في انقطاع من الدنيا وإقبال من الأخرة نزل إليه ملائكة من السماء سود الوجوه معهم المسوح فجلسوا منه مد البصر ثم يجيء ملك الموت فيجلس عند رأسه فيقول أيتها النفس الخبيثة اخرجي إلى سخط من الله وغضب.قال - فتفرق في جسده فينتزعها كما ينتزع السفود من الصوف المبلول فيأخذها فإذا أخذها لم يدعوها في يده طرفة عين حتى يجعلوها في تلك المسوح فيخرج منها كأنتن ريح جيفة وجدت على وجه الأرض فيصعدون بها فلا يمرون بها على ملإ من الملائكة إلا قالوا ما هذه الروح الخبيثة ؟ فيقولون فلان ابن فلان بأقبح أسمائه التي كان يسمى بها في الدنيا حتى ينتهي بها إلى السماء الدنيا فيستفتح له فلا يفتح له- ثم قرأ رسول الله صلى الله عليه وسلم \" لا تفتح لهم أبواب السماء ولا يدخلون الجنة حتى يلج الجمل في سم الخياط \" فيقول الله اكتبوا كتابه في سجين في الأرض السفلى فتطرح روحه طرحا- ثم قرأ \" ومن يشرك بالله فكأنما خر من السماء فتخطفه الطير أو تهوى به الريح في مكان سحيق \" فتعاد روحه في جسده ويأتيه ملكان فيجلسانه ويقولان له من ربك ؟ فيقول هاه هاه لا أدري فيقولان له ما دينك ؟ فيقول هاه هاه لا أدري فيقولان له ما هذا الرجل الذي بعث فيكم ؟ فيقول هاه هاه لا أدري فينادي مناد من السماء أن كذب عبدي فأفرشوه من النار وافتحوا له بابا إلى النار فيأتيه من حرها وسمومها ويضيق عليه قبره حتى تختلف فيه أضلاعه ويأتيه رجل قبيح الوجه قبيح الثياب منتن الريح فيقول أبشر بالذي يسوءك هذا يومك الذي كنت توعد فيقول ومن أنت فوجهك الوجه الذي يجئ بالشر فيقول أنا عملك الخبيث فيقول رب لا تقم الساعة \" ورواه أبو داود من حديث الأعمش والنسائي وابن ماجه من حديث المنهال بن عمرو به وقال الإمام أحمد حدثنا عبد الرزاق حدثنا معمر عن يونس بن حبيب عن المنهال بن عمرو عن زاذان عن البراء بن عازب رضي الله عنه قال: خرجنا مع رسول الله صلى الله عليه وسلم إلى جنازة فذكر نحوه وفيه \" فإذا خرجت روحه صلى عليه كل ملك بين السماء والأرض وكل ملك في السماء وفتحت أبواب السماء ليس من أهل باب إلا وهم يدعون الله عز وجل أن يعرج بروحه من قبلهم \" وفي آخره \" ثم يقيض له أعمى أصم أبكم وفي يده مرزبة لو ضرب بها جبل لكان ترابا فيضربه ضربة فيصير ترابا ثم يعيده الله عز وجل كما كان فيضربه ضربة أخرى فيصيح صيحة يسمعها كل شيء إلا الثقلين \" قال البراء ثم يفتح له باب إلى النار ويمهد له من فرش النار وقال سفيان الثوري عن أبيه عن خيثمة عن البراء في قوله تعالى \" يثبت الله الذين آمنوا بالقول الثابت في الحياة الدنيا وفي الآخرة \" قال عذاب القبر وقال المسعودي عن عبد الله بن مخارق عن أبيه عن عبد الله قال: إن المؤمن إذا مات أجلس في قبره فيقال له ما ربك ؟ ما دينك ؟ من نبيك ؟ فيثبته الله فيقول ربي الله وديني الإسلام ونبيي محمد صلى الله عليه وسلم وقرأ عبد الله \" يثبت الله الذين آمنوا بالقول الثابت في الحياة الدنيا وفي الآخرة \" وقال الإمام عبد بن حميد رحمه الله في مسنده حدثنا يونس بن محمد حدثنا شيبان بن عبد الرحمن عن قتادة حدثنا أنس بن مالك قال قال رسول الله صلى الله عليه وسلم \" إن العبد إذا وضع في قبره وتولى عنه أصحابه وإنه ليسمع قرع نعالهم فيأتيه ملكان فيقعدانه فيقولان له ما كنت تقول في هذا الرجل ؟ قال فأما المؤمن فيقول أشهد أنه عبد الله ورسوله قال: فيقال له انظر إلى مقعدك من النار قد أبدلك الله به مقعدا من الجنة \" قال النبي صلى الله عليه وسلم \" فيراهما جميعا \" قال قتادة وذكر لنا أنه يفسح له في قبره سبعون ذراعا ويملأ عليه خضرا إلى يوم القيامة.رواه مسلم عن عبد بن حميد به وأخرجه النسائي من حديث يونس بن محمد المؤدب به وقال الإمام أحمد حدثنا يحيى بن سعيد عن ابن جريج أخبرني أبو الزبير أنه سأل جابر بن عبد الله عن فتاني القبر فقال سمعت رسول الله صلى الله عليه وسلم يقول \" إن هذه الأمة تبتلى في قبورها فإذا أدخل المؤمن قبره وتولى عنه أصحابه جاءه ملك شديد الانتهار فيقول له ما كنت تقول في هذا الرجل ؟ فأما المؤمن فيقول إنه رسول الله صلى الله عليه وسلم وعبده فيقول له الملك انظر إلى مقعدك الذي كان لك في النار قد أنجاك الله منه وأبدلك بمقعدك الذي ترى من النار مقعدك الذي ترى من الجنة فيراهما كليهما فيقول المؤمن دعوني أبشر أهلي فيقال له اسكن ; وأما المنافق فيقعد إذا تولى عنه فيقال له ما كنت تقول في هذا الرجل ؟ فيقول لا أدري أقول كما يقول الناس فيقال له لا دريت هذا مقعدك الذي كان لك في الجنة أبدلت مكانه مقعدك من النار \" قال جابر فسمعت النبي صلى الله عليه وسلم يقول \" يبعث كل عبد فى القبر على ما مات المؤمن على إيمانه والمنافق على نفاقه \" إسناده صحيح على شرط مسلم ولم يخرجاه. وقال الإمام أحمد حدثنا أبو عامر حدثنا عباد بن راشد عن داود بن أبى هند عن أبي نضرة عن أبي سعيد الخدري قال: شهدت مع رسول الله صلى الله عليه وسلم جنازة فقال رسول الله صلى الله عليه وسلم \" يا أيها الناس إن هذه الأمة تبتلى في قبورها فإذا الإنسان دفن وتفرق عنه أصحابه جاءه ملك في يده مطراق من حديد فأقعده فقال ما تقول في هذا الرجل ؟ فإن كان مؤمنا قال أشهد أن لا إله إلا الله وأشهد أن محمدا عبده ورسوله فيقول له صدقت ثم يفتح له بابا إلى النار فيقول كان هذا منزلك لو كفرت بربك فأما إذ آمنت فهذا منزلك فيفتح له بابا إلى الجنة فيريد أن ينهض إليه فيقول له اسكن ويفسح له في قبره وإن كان كافرا أو منافقا فيقول له ما تقول في هذا الرجل ؟ فيقول لا أدري سمعت الناس يقولون شيئا فيقول لا دريت ولا تليت ولا اهتديت ثم يفتح له بابا إلى الجنة فيقول هذا منزلك لو آمنت بربك فأما إذ كفرت به فإن الله عز وجل أبدلك به هذا فيفتح له بابا إلى النار ثم يقمعه قمعة بالمطراق فيصيح صيحة يسمعها خلق الله عز وجل كلهم غير الثقلين فقال بعض القوم يا رسول الله ما أحد يقوم عليه ملك في يده مطراق إلا هيل عند ذلك فقال رسول الله صلى الله عليه وسلم \" يثبت الله الذين آمنوا بالقول الثابت \" وهذا أيضا إسناد لا بأس به فإن عباد بن راشد التميمي روى له البخاري مقرونا ولكن ضعفه بعضهم وقال الإمام أحمد حدثنا حسين بن محمد عن ابن أبي ذئب عن محمد بن عمرو بن عطاء عن سعيد بن يسار عن أبي هريرة عن النبي صلى الله عليه وسلم قال \" إن الميت تحضره الملائكة فإذا كان الرجل الصالح قالوا اخرجي أيتها النفس الطيبة كانت في الجسد الطيب اخرجي حميدة وأبشري بروح وريحان ورب غير غضبان قال فلا يزال يقال لها ذلك حتى تخرج ثم يعرج بها إلى السماء فيستفتح لها فيقال من هذا ؟ فيقال فلان فيقولون مرحبا بالروح الطيبة كانت في الجسد الطيب ادخلي حميدة وأبشري بروح وريحان ورب غير غضبان - قال - فلا يزال يقال لها حتى ينتهي بها إلى السماء التي فيها الله عز وجل وإذا كان الرجل السوء قالوا اخرجي أيتها النفس الخبيثة كانت في الجسد الخبيث اخرجي ذميمة وأبشري بحميم وغساق وآخر من شكله أزواج فلا يزال يقال لها ذلك حتى تخرج ثم يعرج بها إلى السماء فيستفتح لها فيقال من هذا ؟ فيقال فلان فيقال لا مرحبا بالنفس الخبيثة كانت في الجسد الخبيث ارجعي ذميمة فإنه لا تفتح لك أبواب السماء فيرسل من السماء ثم يصير إلى القبر فيجلس الرجل الصالح فيقال له - مثل ما قيل في الحديث الأول - ويجلس الرجل السوء فيقال له - مثل ما قيل له في الحديث الأول -\" ورواه النسائي وابن ماجه من طريق ابن أبي ذئب بنحوه وفي صحيح مسلم عن أبي هريرة رضي الله عنه قال: إذا خرجت روح العبد المؤمن تلقاها ملكان يصعدان بها قال حماد فذكر من طيب ريحها وذكر المسك - قال - ويقول أهل السماء روح طيبة جاءت من قبل الأرض صلى الله عليك وعلى جسد كنت تعمرينه فينطلق به إلى ربه عز وجل فيقال انطلقوا به إلى آخر الأجل وإن الكافر إذا خرجت روحه - قال حماد- وذكر من نتنها وذكر مقتا ويقول أهل السماء روح خبيثة جاءت من قبل الأرض فيقال انطلقوا به إلى آخر الأجل - قال أبو هريرة - فرد رسول الله صلى الله عليه وسلم ريطة كانت عليه على أنفه هكذا وقال ابن حبان فى صحيحه حدثنا عمر بن محمد الهمداني حدثنا زيد بن أحزم حدثنا معاذ بن هشام حدثني أبي عن قتادة عن قسام بن زهير عن أبي هريرة عن رسول الله صلى الله عليه وسلم قال \" إن المؤمن إذا قبض أتته ملائكة الرحمة بحريرة بيضاء فيقولون اخرجي إلى روح الله فتخرج كأطيب ريح مسك حتى إنه ليناوله بعضهم بعضا يشمونه حتى يأتوا به باب السماء فيقولون ما هذه الريح الطيبة التي جاءت من قبل الأرض ولا يأتون سماء إلا قالوا مثل ذلك حتى يأتوا به أرواح المؤمنين فلهم أشد فرحا به من أهل الغائب بغائبهم فيقولون ما فعل فلان فيقولون دعوه حتى يستريح فإنه كان في غم فيقول قد مات أما أتاكم فيقولون ذهب به إلى أمه الهاوية وأما الكافر فيأتيه ملائكة العذاب بمسح فيقولون اخرجي إلى غضب الله فتخرج كأنتن ريح جيفة فيذهب به إلى باب الأرض \". وقد روي أيضا من طريق همام بن يحيى عن أبي الجوزاء عن أبي هريرة عن النبي صلى الله عليه وسلم بنحوه قال \" فيسأل ما فعل فلان ما فعل فلان ما فعلت فلانة قال أما الكافر فإذا قبضت نفسه وذهب بها إلى باب الأرض تقول خزنة الأرض ما وجدنا ريحا أنتن من هذه فيبلغ بها الأرض السفلى \" قال قتادة وحدثني رجل عن سعيد بن المسيب عن عبد الله بن عمرو قال: أرواح المؤمنين تجتمع بالجابيين وأرواح الكفار تجتمع ببرهوت سبخة بحضرموت ثم يضيق عليه قبره.وقال الحافظ أبو عيسى الترمذي رحمه الله حدثنا يحيى بن خلف حدثنا بشر بن المفضل عن عبد الرحمن عن سعيد بن أبي سعيد المقبري عن أبي هريرة قال: قال رسول الله صلى الله عليه وسلم \" إذا قبر الميت أو قال أحدكم - أتاه ملكان أسودان أزرقان يقال لأحدهما منكر والآخر نكير فيقولان ما كنت تقول في هذا الرجل ؟ فيقول ما كان يقول هو عبد الله ورسوله أشهد أن لا إله إلا الله وأشهد أن محمدا عبده ورسوله فيقولان قد كنا نعلم أنك تقول هذا ثم يفسح له في قبره سبعون ذراعا في سبعين وينور له فيه ثم يقال له نم فيقول أرجع إلى أهلي فأخبرهم فيقولان نم نومة العروس الذي لا يوقظه إلا أحب أهله إليه حتى يبعثه الله من مضجعه ذلك وإن كان منافقا قال سمعت الناس يقولون فقلت مثلهم لا أدري فيقولان قد كنا نعلم أنك تقول هذا فيقال للأرض التئمي عليه فتلتئم عليه حتى تختلف أضلاعه فلا يزال فيها معذبا حتى يبعثه الله من مضجعه ذلك \" ثم قال الترمذي هذا حديث حسن غريب.وقال حماد بن سلمة عن محمد بن عمرو عن أبي سلمة عن أبي هريرة قال: قال رسول الله صلى الله عليه وسلم \" يثبت الله الذين آمنوا بالقول الثابت فى الحياة الدنيا وفي الآخرة\" قال \" ذلك إذا قيل له في القبر من ربك وما دينك ومن نبيك ؟ فيقول ربي الله وديني الإسلام ونبيي محمد جاءنا بالبينات من عند الله فآمنت به وصدقت فيقال له صدقت على هذا عشت وعليه مت وعليه تبعث \" وقال ابن جرير حدثنا مجاهد بن موسى والحسن بن محمد قالا حدثنا يزيد أنا محمد بن عمرو عن أبي سلمة عن أبي هريرة رضي الله عنه عن النبي صلى الله عليه وسلم قال \" والذي نفسي بيده إن الميت ليسمع خفق نعالكم حين تولون عنه مدبرين فإن كان مؤمنا كانت الصلاة عند رأسه والزكاة عن يمينه والصوم عن يساره وكان فعل الخيرات من الصدقة والصلة والمعروف والإحسان إلى الناس عند رجليه فيؤتى من قبل رأسه فتقول الصلاة ما قبلي مدخل فيؤتى عن يمينه فتقول الزكاة ما قبلي مدخل فيؤتى عن يساره فيقول الصيام ما قبلي مدخل فيؤتى عند رجليه فيقول فعل الخيرات ما قبلي مدخل فيقال اجلس فيجلس قد مثلت له الشمس قد دنت للغروب فيقال له أخبرنا عما نسألك فيقول دعني دعني حتى أصلي فيقال له إنك ستفعل فأخبرنا عما نسألك فيقول عم تسألوني ؟ فيقال أرأيت هذا الرجل الذي كان فيكم ماذا تقول فيه وماذا تشهد به عليه ؟ فيقول أمحمد ؟ فيقال له نعم فيقول أشهد أنه رسول الله وأنه جاءنا بالبينات من عند الله فصدقناه فيقال له على ذلك حييت وعلى ذلك مت وعليه تبعث إن شاء الله ثم يفسح له في قبره سبعون ذراعا وينور له فيه ويفتح له باب إلى الجنة فيقال له انظر إلى ما أعد الله لك فيها فيزداد غبطة وسرورا ثم تجعل نسمته في النسم الطيب وهي طير أخضر يعلق بشجر الجنة ويعاد الجسد إلى ما بدئ من التراب \" وذلك قول الله عز وجل \" يثبت الله الذين آمنوا بالقول الثابت في الحياة الدنيا وفي الآخرة \" رواه ابن حبان من طريق المعتمر بن سليمان عن محمد بن عمر وذكر جواب الكافر وعذابه وقال البزار حدثنا سعيد بن بحر القراطيسي حدثنا الوليد بن القاسم حدثنا يزيد بن كيسان عن أبي حازم عن أبي هريرة أحسبه رفعه قال \" إن المؤمن ينزل به الموت ويعاين ما يعاين فيود لو خرجت يعني نفسه والله يحب لقاءه وإن المؤمن يصعد بروحه إلى السماء فتأتيه أرواح المؤمنين فتستخبره عن معارفهم من أهل الأرض فإذا قال تركت فلانا في الأرض أعجبهم ذلك وإذا قال إن فلانا قد مات قالوا ما جيء به إلينا وإن المؤمن يجلس في قبره فيسأل من ربك فيقول ربي الله ويسأل من نبيك فيقول محمد نبيي فيقال ماذا دينك ؟ قال ديني الإسلام فيفتح له باب في قبره فيقول - أو يقال - انظر إلى مجلسك ثم يرى القبر فكأنما كانت رقدة وإذا كان عدو الله نزل به الموت وعاين ما عاين فإنه لا يحب أن تخرج روح أبدا والله يبغض لقاءه فإذا جلس في قبره أو أجلس فيقال له من ربك ؟ فيقول لا أدري فيقال لا دريت فيفتح له باب إلى جهنم ثم يضرب ضربة تسمعها كل دابة إلا الثقلين ثم يقال له نم كما ينام المنهوش \" قلت لأبي هريرة ما المنهوش ؟ قال الذي تنهشه الدواب والحيات ثم ضيق عليه قبره ثم قال لا نعلم رواه إلا الوليد بن مسلم وقال الإمام أحمد رحمه الله حدثنا حجين بن المثنى حدثنا عبد العزيز بن أبي سلمة الماجشون عن محمد بن المنكدر قال: كانت أسماء يعني بنت الصديق رضي الله عنها تحدت عن النبي صلى الله عليه وسلم قالت: قال \" إذا دخل الإنسان قبره فإن كان مؤمنا أحف به عمله الصلاة والصيام قال فيأتيه الملك من نحو الصلاة فترده ومن نحو الصيام فيرده قال فيناديه اجلس فيجلس فيقول له ماذا تقول في هذا الرجل يعني النبي صلى الله عليه وسلم قال من ؟ قال محمد قال أشهد أنه رسول الله قال وما يدريك أدركته قال أشهد أنه رسول الله قال: يقول على ذلك عشت وعليه مت وعليه تبعث وإن كان فاجرا أو كافرا جاءه الملك ليس بينه وبينه شيء يرده فأجلسه فيقول له ماذا تقول في هذا الرجل ؟ قال أي رجل ؟ قال محمد قال: يقول والله ما أدري سمعت الناس يقولون شيئا فقلته قال له الملك على ذلك عشت وعليه مت وعليه تبعث قال ويسلط عليه دابة في قبره معها سوط ثمرته جمرة مثل عرف البعير تضربه ما شاء الله صماء لا تسمع صوته فترحمه \" وقال العوفي عن ابن عباس رضي الله عنهما في هذه الآية قال: إن المؤمن إذا حضره الموت شهدته الملائكة فسلموا عليه وبشروه بالجنة فإن مات مشوا مع جنازته ثم صلوا عليه مع الناس فإذا دفن أجلس في قبره فيقال له من ربك ؟ فيقول ربي الله ; فيقال له من رسولك ؟ فيقول محمد صلى الله عليه وسلم فيقال له ما شهادتك ؟ فيقول أشهد أن لا إله إلا الله وأشهد أن محمدا رسول الله فيوسع له في قبره مد بصره ; وأما الكافر فتنزل عليه الملائكة فيبسطون أيديهم والبسط هو الضرب \" يضربون وجوههم وأدبارهم عند الموت فإذا أدخل قبره أقعد فقيل له من ربك ؟ فلم يرجع إليهم شيئا وأنساه الله ذكر ذلك وإذا قيل من الرسول الذي بعث إليك ؟ لم يهتد له ولم يرجع إليهم شيئا \" كذلك يضل الله الظالمين \" وقال ابن أبي حاتم حدثنا أحمد بن عثمان بن حكيم الأزدي حدثنا شريح بن مسلمة حدثنا إبراهيم بن يوسف عن أبيه عن أبي إسحاق عن عامر بن سعد البجلي عن أبي قتادة الأنصاري في قوله تعالى \" يثبت الله الذين آمنوا بالقول الثابت في الحياة الدنيا وفي الآخرة \" الآية قال إن المؤمن إذا مات أجلس في قبره فيقال له من ربك ؟ فيقول الله ; فيقال له من نبيك ؟ فيقول محمد بن عبد الله ; فيقال له ذلك مرات ثم يفتح له باب إلى النار فيقال له انظر إلى منزلك من النار لو زغت ; ثم يفتح له باب إلى الجنة فيقال له انظر إلى منزلك من الجنة إذ ثبت وإذا مات الكافر أجلس في قبره فيقال له من ربك ؟ من نبيك ؟ فيقول لا أدري كنت أسمع الناس يقولون فقال له لا دريت ثم يفتح له باب إلى الجنة فقال له انظر إلى منزلك لو ثبت ; ثم يفتح له باب إلى النار فيقال له انظر إلى منزلك إذ زغت فذلك قوله تعالى \" يثبت الله الذين آمنوا بالقول الثابت في الحياة الدنيا وفي الآخرة \" وقال عبد الرزاق عن معمر عن ابن طاوس عن أبيه \" يثبت الله الذين آمنوا بالقول الثابت في الحياة الدنيا \" قال لا إله إلا الله \" وفي الآخرة \" المسئلة في القبر وقال قتادة أما الحياة الدنيا فيثبتهم بالخير والعمل الصالح \" وفي الآخرة\" في القبر وكذا روى عن غير واحد من السلف وقال أبو عبد الله الحكيم الترمذي في كتابه نوادر الأصول حدثنا أبي حدثنا عبد الله بن نافع عن ابن أبي فديك عن عبد الرحمن بن عبد الله عن سعيد بن المسيب عن عبد الرحمن بن سمرة قال: خرج علينا رسول الله صلى الله عليه وسلم ذات يوم ونحن في مسجد المدينة فقال \" إني رأيت البارحة عجبا ; رأيت رجلا من أمتي جاء ملك الموت ليقبض روحه فجاءه بره بوالديه فرد عنه ورأيت رجلا من أمتي قد بسط عليه عذاب القبر فجاءه وضوئه فاستنقذه من ذلك ورأيت رجلا من أمتي قد احتوشته الشياطين فجاءه ذكر الله فخلصه من بينهم ورأيت رجلا من أمتي قد احتوشته ملائكة العذاب فجاءته صلاته فاستنقذته من أيديهم ورأيت رجلا من أمتي يلهث عطشا كلما ورد حوضا منع منه فجاءه صيامه فسقاه وأرواه ورأيت رجلا من أمتي والنبيون قعود حلقا حلقا كلما دنا لحلقة طردوه فجاءه اغتساله من الجنابة فأخذ بيده فأقعده إلى جنبي ورأيت رجلا من أمتي بين يديه ظلمة ومن خلفه ظلمة وعن يمينه ظلمة وعن شماله ظلمة ومن فوقه ظلمة ومن تحته ظلمة وهو متحير فيها فجاءته حجته وعمرته فاستخرجاه من الظلمة وأدخلاه النور ورأيت رجلا من أمتي يكلم المؤمنين فلا يكلمونه فجاءه صلة الرحم فقالت يا معشر المؤمنين كلموه فكلموه ورأيت رجلا من أمتي يتقي وهج النار وشررها بيده عن وجهه فجاءته صدقته فصارت له سترا على وجهه وظلا على رأسه ورأيت رجلا من أمتي قد أخذته الزبانية من كل مكان فجاءه أمره بالمعروف ونهيه عن المنكر فاستنقذاه من أيديهم وأدخلاه مع ملائكة الرحمة ورأيت رجلا من أمتي جاثيا على ركبتيه بينه وبين الله حجاب فجاءه حسن خلقه فأخذ بيده فأدخله على الله عز وجل ورأيت رجلا من أمتي قد هوت صحيفته من قبل شماله فجاءه خوفه من الله فأخذ صحيفته فجعلها في يمينه ورأيت رجلا من أمتي قد خف ميزانه فجاءته أفراطه فثقلوا ميزانه ورأيت رجلا من أمتي قائما على شفير جهنم فجاءه وجله من الله فاستنقذه من ذلك ومضى ورأيت رجلا من أمتي هوى في النار فجاءته دموعه التي بكى من خشية الله فى الدنيا فاستخرجته من النار ورأيت رجلا من أمتى قائما على الصراط يرعد كما ترعد السعفة فجاء حسن ظنه بالله فسكن رعدته ومضى ورأيت رجلا من أمتي على الصراط يزحف أحيانا ويحبو أحيانا فجاءته صلاته علي فأخذت بيده فأقامته ومضى على الصراط ورأيت رجلا من أمتي انتهى إلى باب الجنة فغلقت الأبواب دونه فجاءته شهادة أن لا إله إلا الله ففتحت له الأبواب وأدخلته الجنة \".قال القرطبي بعد إيراده هذا الحديث من هذا الوجه هذا حديث عظيم ذكر فيه أعمالا خاصة تنجي من أهوال خاصة أورده هكذا في كتابه التذكرة وقد روى الحافظ أبو يعلى الموصلي في هذا حديثا غريبا مطولا فقال: حدثنا أبو عبد الرحمن أحمد بن إبراهيم البكري حدثنا محمد بن بكر البرساني أبو عثمان حدثنا أبو عاصم الحبطي وكان من أخيار أهل البصرة وكان من أصحاب حذم وسلام بن أبي مطيع حدثنا بكر بن حبيش عن ضرار بن عمرو عن يزيد الرقاشي عن أنس بن مالك عن تميم الدارمي عن النبي صلى الله عليه وسلم قال \" يقول الله عز وجل لملك الموت انطلق - إلى وليي فأتني به فإني قد ضربته بالسراء والضراء فوجدته حيث أحب ائتني به فلأريحنه فينطلق إليه ملك الموت ومعه خمسمائة من الملائكة معهم أكفان وحنوط من الجنة ومعهم ضبائر الريحان أصل الريحانة واحد وفى رأسها عشرون لونا لكل لون منها ريح سوى ريح صاحبه ومعهم الحرير الأبيض فيه المسك الأذفر فيجلس ملك الموت عند رأسه وتحف به الملائكة ويضع كل ملك منهم يده على عضو من أعضائه ويبسط ذلك الحرير الأبيض والمسك الأذفر تحت ذقنه ويفتح له باب إلى الجنة فإن نفسه لتعلل عند ذلك بطرف الجنة تارة بأزواجها وتارة بكسوتها ومرة بثمارها كما يعلل الصبي أهله إذا بكى قال وإن أزواجه ليبتهشن عند ذلك ابتهاشا قال وتبرز الروح - قال البرساني يريد أن تخرج من العجل إلى ما تحب - قال: ويقول ملك الموت اخرجي يا أيتها الروح الطيبة إلى سدر مخضود وطلح منضود وظل ممدود وماء مسكوب قال ولملك الموت أشد به لطفا من الوالدة بولدها يعرف أن ذلك الروح حبيب لربه فهو يلتمس بلطفه تحببا لديه رضاء للرب عنه فتسل روحه كما تسل الشعرة من العجين ; قال: وقال الله عز وجل \" الذين تتوفاهم الملائكة طيبين \" وقال \" فأما إن كان من المقربين فروح وريحان وجنة نعيم \" قال روح من جهة الموت وريحان يتلقى به وجنة نعيم تقابله قال فإذا قبض ملك الموت روحه قالت الروج للجسد جزاك الله عني خيرا فقد كنت سريعا بي إلى طاعة الله بطيئا بي عن معصية الله فقد نجيت وأنجيت قال: ويقول الجسد للروح مثل ذلك قال وتبكي عليه بقاع الأرض التي كان يطيع الله فيها وكل باب من السماء يصعد منه عمله وينزل منه رزقه أربعين ليلة قال فإذا قبض ملك الموت روحه أقامت الخمسمائة من الملائكة عند جسده فلا يقلبه بنو آدم لشق إلا قلبته الملائكة قبلهم وغسلته وكفنته بأكفان قبل أكفان بني آدم وحنوط قبل حنوط بني آدم ويقوم من باب بيته إلى قبره صفان من الملائكة يستقبلونه بالاستغفار فيصيح عند ذلك إبليس صيحة تتصدع منها عظام جسده قال ويقول لجنوده الويل لكم كيف خلص هذا العبد منكم؟ فيقولون إن هذا كان عبدا معصوما ; قال فإذا صعد ملك الموت بروحه يستقبله جبريل في سبعين ألفا من الملائكة كل يأتيه ببشارة من ربه. سوى بشارة صاحبه قال فإذا انتهى ملك الموت بروحه إلى العرش خر الروح ساجدا قال: يقول الله عز وجل لملك الموت: انطلق بروح عبدي فضعه في سدر مخضود وطلح منضود وظل ممدود وماء مسكوب قال فإذا وضع في قبره جاءته الصلاة فكانت عن يمينه وجاءه الصيام فكان عن يساره وجاءه القرآن فكان عند رأسه وجاءه مشيه إلى الصلاة فكان عند رجليه وجاءه الصبر فكان ناحية القبر قال فيبعث الله عز وجل عنقا من العذاب قال فيأتيه عن يمينه قال: فتقول الصلاة وراءك والله ما زال دائبا عمره كله وإنما استراح الآن حين وضع في قبره قال فيأتيه عن يساره فيقول الصيام مثل ذلك قال ثم يأتيه من عند رأسه فيقول القرآن والذكر مثل ذلك قال ثم يأتيه من عند رجليه فيقول مشيه إلى الصلاة مثل ذلك فلا يأتيه العذاب من ناحية يلتمس هل يجد إليه مساغا إلا وجد ولي الله قد أخذ جنته قال فينقمع العذاب عند ذلك فيخرج قال: ويقول الصبر لسائر الأعمال أما إنه لم يمنعني أن أباشر أنا بنفسي إلا أني نظرت ما عندكم فإن عجزتم كنت أنا صاحبه فأما إذا أجزتم عنه فأنا له ذخر عند الصراط والميزان قال ويبعث الله ملكين أبصارهما كالبرق الخاطف وأصواتهما كالرعد القاصف وأنيابهما كالصياصي وأنفاسهما كاللهب يطآن في أشعارهما بين منكب كل واحد مسيرة كذا وكذا وقد نزعت منهما الرأفة والرحمة يقال لهما منكر ونكير في يد كل واحد منهما مطرقة لو اجتمع عليها ربيعة ومضر لم يقلوها قال فيقولان له اجلس قال فجلس فيستوى جالسا قال وتقع أكفانه في حقويه قال: فيقولان له من ربك وما دينك ومن نبيك ؟ قال: قالوا يا رسول الله ومن يطيق الكلام عند ذلك وأنت تصف من الملكين ما تصف ؟ قال: فقال رسول الله صلى الله عليه وسلم \" يثبت الله الذين آمنوا بالقول الثابت في الحياة الدنيا وفي الآخرة ويضل الله الظالمين ويفعل الله ما يشاء \" قال: فيقول ربي الله وحده لا شريك له وديني الإسلام الذي دانت به الملائكة ونبيي محمد خاتم النبيين قال: فيقولان له صدقت قال فيدفعان القبر فيوسعان من بين يديه أربعين ذراعا وعن يمينه أربعين ذراعا وعن شماله أربعين ذراعا ومن خلفه أربعين ذراعا ومن عند رأسه أربعين ذراعا ومن عند رجليه أربعين ذراعا قال فيوسعان له مائتي ذراع قال البرساني فأحسبه وأربعين ذراعا تحاط به - قال ثم يقولان له انظر فوقك فإذا باب مفتوح إلى الجنة قال فيقولان له: ولي الله هذا منزلك إذ أطعت الله فقال رسول الله صلى الله عليه وسلم: والذي نفس محمد بيده إنه يصل إلى قلبه عند ذلك فرحة لا ترتد أبدا ثم يقال له انظر تحتك قال فينظر تحته فإدا باب مفتوح إلى النار قال فيقولان: ولي الله نجوت آخر ما عليك قال فقال رسول الله صلى الله عليه وسلم: إنه ليصل إلى قلبه عند ذلك فرحة لا ترتد أبدا \" قال فقالت عائشة يفتح له سبعة وسبعون بابا إلى الجنة يأتيه ريحها وبردها حتى يبعثه الله عز وجل وبالإسناد المتقدم إلى النبي صلى الله عليه وسلم قال \" ويقول الله تعالى لملك الموت انطلق إلى عدوي فائتني به فإني قد بسطت له رزقي ويسرت له نعمتي فأبى إلا معصيتي فأتني به لأنتقم منه قال فينطلق إليه ملك الموت في أكره صورة رآها أحد من الناس قط له اثنتا عشرة عينا ومعه سفود من النار كثير الشوك ومعه خمسمائة من الملائكة معهم نحاس وجمر من جمر جهنم ومعم سياط من نار لينها لين السياط وهي نار تأجج قال فيضربه ملك الموت بذلك السفود ضربة يغيب كل أصل شوكة من ذلك السفود في أصل كل شعرة وعرق وظفر قال ثم يلويه ليا شديدا قال فينزع روحه من أظفار قدميه قال فيلقيها في عقبيه.قال فيسكر عدو الله عند ذلك سكرة فيرفه ملك الموت عنه قال وتضرب الملائكة وجهه ودبره بتلك السياط قال فيشده ملك الموت شدة فينزع روحه من عقبيه فيلقيها في ركبتيه ثم يسكر عدو الله عند ذلك سكرة فيرفه ملك الموت عنه قال فتضرب الملائكة وجهه ودبره بتلك السياط قال فينتره ملك الموت نترة فينزع روحه من ركبتيه فيلقيها فى حقويه فيسكر عدو الله عند ذلك سكرة فيرفه ملك الموت عنه قال فتضرب الملائكة وجهه ودبره بتلك السياط قال كذلك إلى صدره ثم كذلك إلى حلقه قال ثم تبسط الملائكة ذلك النحاس وجمر جهنم تحت ذقنه قال: ويقول ملك الموت اخرجي أيتها الروح اللعينة إلى سموم وحميم وظل من يحموم لا بارد ولا كريم - قال- فإذا قبض ملك الموت روحه قال الروح للجسد: جزاك الله عني شرا فقد كنت سريعا بي إلى معصية الله بطيئا بي عن طاعة الله فقد هلكت وأهلكت- قال- ويقول الجسد للروح مثل ذلك وتلعنه بقاع الأرض التي كان يعصي الله عليها وتنطلق جنود إبليس إليه فيبشرونه بأنهم قد أوردوا عبدا من ولد آدم النار قال فإذا وضع في قبره ضيق عليه قبره حتى تختلف أضلاعه حتى تدخل اليمنى في اليسرى واليسرى في اليمنى قال ويبعث الله إليه أفاعي دهما كأعناق الأبل يأخذن بأذنيه وإبهامي قدميه فيقرضنه حتى يلتقين في وسطه قال ويبعث الله ملكين أبصارهما كالبرق الخاطف وأصواتهما كالرعد القاصف وأنيابهما كالصياصي وأنفاسهما كاللهب يطآن في أشعارهما بين منكبي كل واحد منهما مسيرة كذا وكذا قد نزعت منهما الرأفة والرحمة يقال لهما منكر ونكير في يد كل واحد منهما مطرقة لو اجتمع عليها ربيعة ومضر لم يقلوها ; قال فيقولان له اجلس فيستوي جالسا وتقع أكفانه في حقويه قال فيقولان له من ربك وما دينك.ومن نبيك ؟ فيقول لا أدري فيقولان له لا دريت ولا تليت فيضربانه ضربة يتطاير شررها في قبره ثم يعودان قال: فيقولان انظر فوقك فينظر فإذا باب مفتوح من الجنة فيقولان: عدو الله هذا منزلك لو أطعت الله قال رسول الله صلى الله عليه وسلم: والذي نفسي بيده إنه ليصل إلى قلبه عند ذلك حسرة لا ترتد أبدا قال ويقولان له: انظر تحتك فينظر تحت فإذا باب مفتوح إلى النار فيقولان عدو الله هذا منزلك إذ عصيت الله قال رسول الله صلى الله عليه وسلم: والذي نفسي بيده إنه ليصل إلى قلبه عند ذلك حسرة لا ترتد أبدا \" قال: وقالت عائشة ويفتح له سبعة وسبعون بابا إلى النار يأتيه حرها وسمومها حتى يبعثه الله إليها.هذا حديث غريب جدا وسياق عجيب ويزيد الرقاشي راويه عن أنس له غرائب ومنكرات وهو ضعيف الرواية عند الأئمة والله أعلم ; ولهذا قال أبو داود يحدثنا إبراهيم بن موسى الرازي حدثنا هشام هو ابن يوسف عن عبد الله بن بجير عن هانئ مولى عثمان عن عثمان رضي الله عنه قال: كان النبي صلى الله عليه وسلم إذا فرغ من دفن الرجل وقف عليه وقال \" استغفروا لأخيكم واسألوا له التثبت فإنه الآن يسأل\" تفرد به أبو داود وقد أورد الحافظ أبو بكر بن مردويه عند قوله تعالى \" ولو ترى إذ الظالمون في غمرات الموت والملائكة باسطو أيديهم \" الآية حديثا مطولا جدا من طرق غريبة عن الضحاك عن ابن عباس مرفوعا وفيه غرائب أيضا."
    },
    {
      "ayah": 28,
      "surah": 14,
      "text": "قال البخاري قوله \" ألم تر إلى الذين بدلوا نعمة الله كفرا \" ألم تعلم كقوله \" ألم تر كيف \" \" ألم تر إلى الذين خرجوا \" البوار الهلاك بار يبور بورا \"وقوما بورا \" هالكين حدثنا علي بن عبد الله حدثنا سفيان عن عمرو عن عطاء سمع ابن عباس \" ألم تر إلى الذين بدلوا نعمة الله كفرا \" قال هم كفار أهل مكة وقال العوفي عن ابن عباس في هذه الآية هو جبلة بن الأيهم والذين اتبعوه من العرب فلحقوا بالروم والمشهور الصحيح عن ابن عباس هو القول الأول وإن كان المعنى يعم جميع الكفار فإن الله تعالى بعث محمدا صلى الله عليه وسلم رحمة للعالمين ونعمة للناس فمن قبلها وقام بشكرها دخل الجنة ومن ردها وكفرها دخل النار وقد روي عن علي نحو قول ابن عباس الأول وقال ابن أبي حاتم حدثنا أبي حدثنا مسلم بن إبراهيم حدثنا شعبة عن القاسم بن أبي بزة عن أبي الطفيل أن ابن الكواء سأل عليا عن \" الذين بدلوا نعمة الله كفرا وأحلوا قومهم دار البوار \" قال هم كفار قريش يوم بدر حدثنا المنذر بن شاذان حدثنا يعلى بن عبيد حدثنا بسام هو الصيرفي عن أبي الطفيل قال: جاء رجل إلى علي فقال يا أمير المؤمنين من الذين بدلوا نعمة الله كفرا وأحلوا قومهم دار البوار ؟ قال منافقو قريش وقال ابن أبي حاتم حدثنا أبي حدثنا ابن نفيل قال قرأت على معقل عن ابن أبي حسين قال قام علي بن أبي طالب رضي الله عنه فقال: ألا أحد يسألني عن القرآن فوالله لو أعلم اليوم أحدا أعلم به مني وإن كان من وراء البحار لأتيته ; فقام عبد الله بن الكواء فقال من الذين بدلوا نعمة الله كفرا وأحلوا قومهم دار البوار ؟ قال مشركو قريش أتتهم نعمة الله الإيمان فبدلوا نعمة الله كفرا وأحلوا قومهم دار البوار وقال السدي في قوله \" ألم تر إلى الذين بدلوا نعمة الله كفرا \" الآية ذكر مسلم المستوفي عن علي أنه قال هم الأفجران من قريش بنو أمية وبنو المغيرة فأما بنو المغيرة فأحلوا قومهم دار البوار يوم بدر وأما بنو أمية فأحلوا قومهم دار البوار يوم أحد وكان أبو جهل يوم بدر وأبو سفيان يوم أحد وأما دار البوار فهي جهنم وقال ابن أبي حاتم رحمه الله حدثنا محمد بن يحيى حدثنا الحارث أبو منصور عن إسرائيل عن أبي إسحاق عن عمرو بن مرة قال سمعت عليا قرأ هذه الآية \" وأحلوا قومهم دار البوار \" قال هم الأفجران من قريش بنو أمية وبنو المغيرة ; فأما بنو المغيرة فأهلكوا يوم بدر وأما بنو أمية فمتعوا إلى حين ورواه أبو إسحاق عن عمرو بن مرة عن علي نحوه وروي من غير وجه عنه وقال سفيان الثوري عن علي بن زيد عن يوسف بن سعد عن عمر بن الخطاب في قوله \" ألم تر إلى الذين بدلوا نعمة الله كفرا \" قال هم الأفجران من قريش بنو المغيرة وبنو أمية ; فأما بنو المغيرة فكفيتموهم يوم بدر ; وأما بنو أمية فمتعوا إلى حين وكذا رواه حمزة الزيات عن عمرو بن مرة قال: قال ابن عباس لعمر بن الخطاب يا أمير المؤمنين هذه الآية \" ألم تر إلى الذين بدلوا نعمة الله كفرا وأحلوا قومهم دار البوار \" قال هم الأفجران من قريش أخوالي وأعمامك فأما أخوالي فاستأصلهم الله يوم بدر وأما أعمامك فأملى الله لهم إلى حين وقال مجاهد وسعيد بن جبير والضحاك وقتادة وابن زيد هم كفار قريش الذين قتلوا يوم بدر وكذا رواه مالك في تفسيره عن نافع عن ابن عمر."
    },
    { "ayah": 29, "surah": 14, "text": "لا يوجد تفسير لهذه الأية" },
    {
      "ayah": 3,
      "surah": 14,
      "text": "ثم وصفهم بأنهم يستحبون الحياة الدنيا على الآخرة أي يقدمونها ويؤثرونها عليها ويعملون للدنيا ونسوا الآخرة وتركوها وراء ظهورهم \" ويصدون عن سبيل الله \" وهي اتباع الرسل \" ويبغونها عوجا \" أي ويحبون أن تكون سبيل الله عوجا مائلة عائلة وهي مستقيمة في نفسها لا يضرها من خالفها ولا من خذلها فهم في ابتغائهم ذلك في جهل وضلال بعيد من الحق لا يرجى لهم والحالة هذه صلاح."
    },
    {
      "ayah": 30,
      "surah": 14,
      "text": "وقوله \" وجعلوا لله أندادا ليضلوا عن سبيله\" أي جعلوا له شركاء عبدوهم معه ودعوا الناس إلى ذلك ثم قال تعالى مهددا لهم ومتوعدا لهم على لسان نبيه صلى الله عليه وسلم \" قل تمتعوا فإن مصيركم إلى النار \" أي مهما قدرتم عليه في الدنيا فافعلوا فمهما يكن من شيء \" فإن مصيركم إلى النار \" أي مرجعكم وموئلكم إليها كما قال تعالى: \" نمتعهم قليلا ثم نضطرهم إلى عذاب غليظ \" وقال تعالى \" متاع في الدنيا ثم إلينا مرجعهم ثم نذيقهم العذاب الشديد بما كانوا يكفرون \"."
    },
    {
      "ayah": 31,
      "surah": 14,
      "text": "يقول تعالى آمرا عباده بطاعته والقيام بحقه والإحسان إلى خلقه بأن يقيموا الصلاة وهي عبادة الله وحده لا شريك له وأن ينفقوا مما رزقهم الله بأداء الزكوات والنفقة على القرابات والإحسان إلى الأجانب والمراد بإقامتها هو المحافظة على وقتها وحدودها وركوعها وخشوعها وسجودها وأمر تعالى بالإنفاق مما رزق في السر أي فى الخفية والعلانية وهي الجهر وليبادروا إلى ذلك لخلاص أنفسهم \" من قبل أن يأتي يوم \" وهو يوم القيامة \" لا بيع فيه ولا خلال \" أي ولا يقبل من أحد فدية أن تباع نفسه كما قال تعالى \" فاليوم لا يؤخذ منكم فدية ولا من الذين كفروا \" وقوله \" ولا خلال \" قال ابن جرير يقول ليس هناك مخالة خليل فيصفح عمن استوجب العقوبة عن العقاب لمخالفته بل هناك العدل والقسط والخلال مصدر من قول القائل خاللت فلانا فأنا أخاله مخالة وخلالا ومنه قول امرئ القيس: صرفت الهوى عنهن من خشية الردى ولست بمقل للخلال ولا قالي وقال قتادة إن الله قد علم أن في الدنيا بيوعا وخلالا يتخالون بها فى الدنيا فينظر الرجل من يخالل وعلام يصاحب فإن كان لله فليداوم وإن كان لغير الله فسيقطع عنه قلت والمراد من هذا أنه يخبر تعالى أنه لا ينفع أحدا بيع ولا فدية ; ولو افتدى بماء الأرض ذهبا لو وجده ولا تنفعه صداقة أحد ولا شفاعة أحد إذا لقي الله كافرا قال الله تعالى \" واتقوا يوما لا تجزي نفس عن نفس شيئا ولا يقبل منها عدل ولا تنفعها شفاعة ولا هم ينصرون \" وقال تعالى \" يا أيها الذين آمنوا أنفقوا مما رزقناكم من قبل أن يأتي يوم لا بيع فيه ولا خلة ولا شفاعة والكافرون هم الظالمون \"."
    },
    {
      "ayah": 32,
      "surah": 14,
      "text": "يعدد تعالى نعمه على خلقه بأن خلق لهم السموات سقفا محفوظا والأرض فراشا \" وأنزل من السماء ماء فأخرج به أزواجا من نبات شتى \" ما بين ثمار وزروع مختلفة الألوان والأشكال والطعوم والروائح والمنافع وسخر الفلك بأن جعلها طافية على تيار ماء البحر تجري عليه بأمر الله تعالى وسخر البحر لحملها ليقطع المسافرون بها من إقليم إلى إقليم آخر لجلب ما هنا إلى هناك وما هناك إلى هنا وسخر الأنهار تشق الأرض من قطر إلى قطر رزقا للعباد من شرب وسقي وغير ذلك من أنواع المنافع."
    },
    {
      "ayah": 33,
      "surah": 14,
      "text": "\" وسخر لكم الشمس والقمر دائبين \" أي يسيران لا يفتران ليلا ولا نهارا \" لا الشمس ينبغي لها أن تدرك القمر ولا الليل سابق النهار وكل فى فلك يسبحون \" \" يغشي الليل النهار يطلبه حثيثا والشمس والقمر والنجوم مسخرات بأمره ألا له الخلق والأمر تبارك الله رب العالمين \" فالشمس والقمر يتعاقبان والليل والنهار يتعارضان فتارة يأخذ هذا من هذا فيطول ثم يأخذ الآخر من هذا فيقصر \" يولج الليل في النهار ويولج النهار في الليل وسخر الشمس والقمر كل يجري لأجل مسمى ألا هو العزيز الغفار \"."
    },
    {
      "ayah": 34,
      "surah": 14,
      "text": "وقوله\" وآتاكم من كل ما سألتموه \" يقول هيأ لكم كل ما تحتاجون إليه في جميع أحوالكم مما تسألونه بحالكم وقال بعض السلف من كل ما سألتموه وما لم تسألوه وقرأ بعضهم \" وآتاكم من كل ما سألتموه وما لم تسألوه\" وقوله \" وإن تعدوا نعمة الله لا تحصوها \" يخبر تعالى عن عجز العباد عن تعداد النعم فضلا عن القيام بشكرها كما قال طلق بن حبيب رحمه الله: إن حق الله أثقل من أن يقوم به العباد وإن نعم الله أكثر من أن يحصيها العباد ولكن أصبحوا تائبين وأمسوا تائبين وفي صحيح البخاري أن رسول الله صلى الله عليه وسلم كان يقول \" اللهم لك الحمد غير مكفى ولا مودع ولا مستغنى عنه ربنا \" وقال الحافظ أبو بكر البزار في مسنده حدثنا إسماعيل بن أبي الحارث حدثنا داود بن المجبر حدثنا صالح المري عن جعفر بن زيد العبدي عن أنس عن النبي صلى الله عليه وسلم أنه قال \" يخرج لابن آدم يوم القيامة ثلاثة دواوين: ديوان فيه العمل الصالح وديوان فيه ذنوبه وديوان فيه النعم من الله تعالى عليه فيقول الله تعالى لأصغر نعمه - أحسبه قال - في ديوان النعم خذي ثمنك من عمله الصالح فتستوعب عمله الصالح كله ثم تنحى وتقول: وعزتك ما استوفيت وتبقى الذنوب والنعم فإذا أراد الله أن يرحمه قال يا عبدي قد ضاعفت لك حسناتك وتجاوزت لك عن سيئاتك -أحسبه قال - ووهبت لك نعمي \" غريب وسنده ضعيف وقد روي في الأثر أن داود عليه السلام قال يا رب كيف أشكرك وشكري لك نعمة منك علي ؟ فقال الله تعالى الآن شكرتني يا داود أي حين اعترفت بالتقصير عن أداء شكر المنعم ; وقال الإمام الشافعي رحمه الله: الحمد لله الذي لا تؤدى شكر نعمة من نعمه إلا بنعمة حادثة توجب على مؤديها شكره بها وقال القائل في ذلك: لو كل جارحة مني لها لغــــة تثني عليك بما أوليت من حسن لكان ما زاد شكري إذ شكرت به إليك أبلغ في الإحسان والمنن"
    },
    {
      "ayah": 35,
      "surah": 14,
      "text": "يذكر تعالى في هذا المقام محتجا على مشركي العرب بأن البلد الحرام مكة إنما وضعت أول ما وضعت على عبادة الله وحده لا شريك له وأن إبراهيم الذي كانت عامرة بسببه آهلة تبرأ ممن عبد غير الله وأنه دعا لمكة بالأمن فقال \" رب اجعل هذا البلد آمنا \" وقد استجاب الله له فقال تعالى \" أولم يروا أنا جعلنا حرما آمنا \" الآية وقال تعالى \" إن أول بيت وضع للناس للذي ببكة مباركا وهدى للعالمين فيه آيات بينات مقام إبراهيم ومن دخله كان آمنا \" وقال في هذه القصة \" رب اجعل هذا البلد آمنا \" فعرفه لأنه دعا به بعد بنائها ولهذا قال \" الحمد لله الذي وهب لي على الكبر إسماعيل وإسحاق \" ومعلوم أن إسماعيل أكبر من إسحاق بثلات عشرة سنة فأما حين ذهب بإسماعيل وأمه وهو رضيع إلى مكان مكة فإنه دعا أيضا فقال \" رب اجعل هذا بلدا آمنا \" كما ذكرناه هنالك في سورة البقرة مستقصى مطولا.وقوله \" واجنبني وبني أن نعبد الأصنام \" ينبغي لكل داع أن يدعو لنفسه ولوالديه ولذريته ; ثم ذكر أنه افتتن بالأصنام خلائق من الناس وأنه تبرأ ممن عبدها ورد أمرهم إلى الله إن شاء عذبهم وإن شاء غفر لهم كقول عيسى عليه السلام \" إن تعذبهم فإنهم عبادك وإن تغفر لهم فإنك أنت العزيز الحكيم \" وليس فيه أكثر من الرد إلى مشيئة الله تعالى لا تجويز وقوع ذلك."
    },
    {
      "ayah": 36,
      "surah": 14,
      "text": "قال عبد الله بن وهب حدثنا عمرو بن الحارث أن بكر بن سوادة حدثه عن عبد الرحمن بن جرير عن عبد الله بن عمرو أن رسول الله صلى الله عليه وسلم تلا قول إبراهيم عليه السلام\" رب إنهن أضللن كثيرا من الناس \" الآية وقول عيسى عليه السلام \" إن تعذبهم فإنهم عبادك \" الآية ثم رفع يديه ثم قال \" اللهم أمتي اللهم أمتي اللهم أمتي \" وبكى فقال الله اذهب يا جبريل إلى محمد وربك أعلم وسله ما يبكيك ؟ فأتاه جبريل عليه السلام فسأله فأخبره رسول الله صلى الله عليه وسلم ما قال: فقال الله اذهب إلى محمد فقل له إنا سنرضيك فى أمتك ولا نسوءك."
    },
    {
      "ayah": 37,
      "surah": 14,
      "text": "وهذا يدل على أن هذا دعاء ثان بعد الدعاء الأول الذي دعا به عندما ولى عن هاجر وولدها وذلك قبل بناء البيت وهذا كان بعد بنائه تأكيدا ورغبة إلى الله عز وجل ولهذا قال \" عند بيتك المحرم \" وقوله \" ربنا ليقيموا الصلاة\" قال ابن جرير هو متعلق بقوله \" المحرم \" أي إنما جعلته محرما ليتمكن أهله من إقامة الصلاة عنده \" فاجعل أفئدة من الناس تهوي إليهم \" قال ابن عباس ومجاهد وسعيد بن جبير وغيره لو قال أفئدة الناس لازدحم عليه فارس والروم واليهود والنصارى والناس كلهم ولكن قال \" من الناس \" فاختص به المسلمون وقوله \" وارزقهم من الثمرات \" أي ليكون ذلك عونا لهم على طاعتك وكما أنه واد غير ذي زرع فاجعل لهم ثمارا يأكلونها وقد استجاب الله ذلك كما قال \" أولم نمكن لهم حرما آمنا يجبى إليه ثمرات كل شيء رزقا من لدنا \" وهذا من لطفه تعالى وكرمه ورحمته وبركته أنه ليس في البلد الحرام مكة شجرة مثمرة وهي تجبى إليها ثمرات ما حولها استجابة لدعاء الخليل عليه السلام."
    },
    {
      "ayah": 38,
      "surah": 14,
      "text": "قال ابن جرير: يقول تعالى مخبرا عن إبراهيم خليله أنه قال \" ربنا إنك تعلم ما نخفي وما نعلن \" أي أنت تعلم قصدي في دعائي وما أردت بدعائي لأهل هذا البلد وإنما هو القصد إلى رضاك والإخلاص لك فإنك تعلم الأشياء كلها ظاهرها وباطنها لا يخفى عليك منها شيء في الأرض ولا في السماء."
    },
    {
      "ayah": 39,
      "surah": 14,
      "text": "ثم حمد ربه عز وجل على ما رزقه من الولد بعد الكبر فقال \" الحمد لله الذي وهب لي على الكبر إسماعيل وإسحاق إن ربي لسميع الدعاء \" أي أنه يستجيب لمن دعاه وقد استجاب لي فيما سألته من الولد."
    },
    {
      "ayah": 4,
      "surah": 14,
      "text": "هذا من لطفه تعالى بخلقه أنه يرسل إليهم رسلا منهم بلغاتهم ليفهموا عنهم ما يريدون وما أرسلوا به إليهم كما روى الإمام أحمد حدثنا وكيع عن عمر بن ذر قال: قال مجاهد عن أبي ذر قال: قال رسول الله صلى الله عليه وسلم \" لم يبعث الله عز وجل نبيا إلا بلغة قومه \" وقوله \" فيضل الله ما يشاء من ويهدي من يشاء \" أي بعد البيان وإقامة الحجة عليهم يضل الله من يشاء عن وجه الهدى ويهدي من يشاء إلى الحق \" وهو العزيز \" الذي ما شاء كان وما لم يشأ لم يكن \" الحكيم \" في أفعاله فيضل من يستحق الإضلال ويهدي من هو أهل لذلك وقد كانت هذه سنته في خلقه أنه ما بعث نبيا في أمة إلا أن يكون بلغتهم فاختص كل نبي بإبلاغ رسالته إلى أمته دون غيرهم واختص محمد بن عبد الله رسول الله صلى الله عليه وسلم بعموم الرسالة إلى سائر الناس كما ثبت في الصحيحين عن جابر قال: قال رسول الله صلى الله عليه وآله وسلم \" أعطيت خمسا لم يعطهن أحد من الأنبياء قبلي: نصرت بالرعب مسيرة شهر وجعلت لي الأرض مسجدا وطهورا وأحلت لي الغنائم ولم تحل لأحد قبلي وأعطيت الشفاعة وكان النبي يبعث إلى قومه خاصة وبعثت إلى الناس عامة \" وله شواهد من وجوه كثيرة وقال تعالى \" قل يا أيها الناس إني رسول الله إليكم جميعا \"."
    },
    {
      "ayah": 40,
      "surah": 14,
      "text": "ثم قال \" رب اجعلني مقيم الصلاة \" أي محافظا عليها مقيما لحدودها \" ومن ذريتي \" أي واجعلهم كذلك مقيمين لها \" ربنا وتقبل دعاء \" أي فيما سألتك فيه كله."
    },
    {
      "ayah": 41,
      "surah": 14,
      "text": "\" ربنا اغفر لي ولوالدي \" قرأ بعضهم ولوالدي بالإفراد وكان هذا قبل أن يتبرأ من أبيه لما تبين له عداوته لله عز وجل \" وللمؤمنين \" أي كلهم \" يوم يقوم الحساب \" أي يوم تحاسب عبادك فتجازيهم بأعمالهم إن خيرا فخير وإن شرا فشر."
    },
    {
      "ayah": 42,
      "surah": 14,
      "text": "يقول تعالى ولا تحسبن الله يا محمد غافلا عما يعمل الظالمون أي لا تحسبنه إذا أنظرهم وأجلهم أنه غافل عنهم مهمل لهم لا يعاقبهم على صنعهم بل هو يحصي ذلك عليهم ويعده عليهم عدا \" إنما يؤخرهم ليوم تشخص فيه الأبصار \" أي من شدة الأهوال يوم القيامة."
    },
    {
      "ayah": 43,
      "surah": 14,
      "text": "ثم ذكر تعالى كيفية قيامهم من قبورهم وعجلتهم إلى قيام المحشر فقال \" مهطعين \" أى مسرعين كما قال تعالى \" مهطعين إلى الداع \" الآية وقال تعالى \" يومئذ يتبعون الداعي لا عوج له\" - إلى قوله - \"وعنت الوجوه للحي القيوم \" وقال تعالى \" يوم يخرجون من الأجداث سراعا \" الآية وقوله \" مقنعي رءوسهم \" قال ابن عباس ومجاهد وغير واحد رافعي رءوسهم \" لا يرتد إليهم طرفهم \" أي أبصارهم ظاهرة شاخصة مديمون النظر لا يطرفون لحظة لكثرة ما هم فيه من الهول والفكرة المخافة لما يحل بهم عياذا بالله العظيم من ذلك ولهذا قال \" وأفئدتهم هواء \" أي وقلوبهم خاوية خالية ليس فيها شيء لكثرة الوجل والخوف ولهذا قال قتادة وجماعة إن أمكنة أفئدتهم خالية لأن القلوب لدى الحناجر قد خرجت من أماكنها من شدة الخوف وقال بعضهم هي خراب لا تعي شيئا لشدة ما أخبر به تعالى عنهم ثم قال تعالى لرسوله صلى الله تعالى عليه وعلى آله وسلم."
    },
    {
      "ayah": 44,
      "surah": 14,
      "text": "يقول تعالى مخبرا عن قيل الذين ظلموا أنفسهم عند معاينة العذاب \" ربنا أخرنا إلى أجل قريب نجب دعوتك ونتبع الرسل \" كقوله \" حتى إذا جاء أحدهم الموت قال رب ارجعون \" الآية وقال تعالى \" يا أيها الذين آمنوا لا تلهكم أموالكم \" الآيتين وقال تعالى مخبرا عنهم في حال محشرهم \" ولو ترى إذ المجرمون ناكسو رءوسهم \" الآية.وقال \" ولو ترى إذ وقفوا على النار فقالوا يا ليتنا نرد ولا نكذب بآيات ربنا \" الآية وقال تعالى \" وهم يصطرخون فيها \" الآية قال تعالى ردا عليهم في قولهم هذا \" أولم تكونوا أقسمتم من قبل ما لكم من زوال \" أي أولم تكونوا تحلفون من قبل هذه الحالة أنه لا زوال لكم عما أنتم فيه وأنه لا معاد ولا جزاء فذوقوا هذا بذلك قال مجاهد وغيره \" ما لكم من زوال \" أي ما لكم من انتقال من الدنيا إلى الآخرة كقوله \" وأقسموا بالله جهد أيمانهم لا يبعث الله من يموت \" الآية."
    },
    {
      "ayah": 45,
      "surah": 14,
      "text": "وسكنتم في مساكن الذين ظلموا أنفسهم وتبين لكم كيف فعلنا بهم وضربنا لكم الأمثال \" أي قد رأيتم وبلغكم ما أحللنا بالأمم المكذبة قبلكم ومع هذا لم يكن لكم فيهم معتبر ولم يكن فيما أوقعنا بهم لكم مزدجر \" حكمة بالغة فما تغني النذر\"."
    },
    {
      "ayah": 46,
      "surah": 14,
      "text": "وقد روى شعبة عن أبي إسحاق عن عبد الرحمن بن رباب أن عليا رضي الله عنه قال فى هذه الآية \" وإن كان مكرهم لتزول منه الجبال \" قال أخذ ذاك الذي حاج إبراهيم في ربه نسرين صغيرين فرباهما حتى استغلظا واستفحلا وشبا قال فأوثق رِجل كل واحد منهما بوتِد إلى تابوت وجوعهما وقعد هو ورجل آخر فى التابوت قال ورفع في التابوت عصا على رأسه اللحم فطارا وجعل يقول لصاحبه انظر ما ترى قال أرى كذا وكذا حتى قال أرى الدنيا كلها كأنها ذباب.قال فصوِّب العصا فصوبها فهبطا جميعا قال فهو قوله عز وجل \" وإن كاد مكرهم لتزول منه الجبال \" قال أبو إسحاق وكذلك هي في قراءة عبد الله \" وإن كاد مكرهم \" قلت وكذا روي عن أبي بن كعب وعمر بن الخطاب رضي الله عنهما أنهما قرآ \" وإن كاد \" كما قرأ علي وكذا رواه سفيان الثوري لإسرائيل عن أبي إسحاق عن عبد الرحمن بن رباب عن علي فذكر نحوه وكذا روي عن عكرمة أن سياق هذه القصة لنمروذ ملك كنعان أنه رام أسباب السماء بهذه الحيلة والمكر كما رام ذلك بعده فرعون ملك القبط فى بناء الصرح فعجزا وضعفا وهما أقل وأحقر وأصغر وأدحر ; وذكر مجاهد هذه القصة عن بختنصر وأنه لما انقطع بصره عن الأرض وأهلها نودي أيها الطاغية أين تريد ؟ ففرق ثم سمع الصوت فوقه فصوب الرماح فصوبت النسور ففزعت الجبال من هدتها وكادت الجبال أن تزول من حس ذلك فذلك قوله \" وإن كان مكرهم لتزول منه الجبال \" ونقل ابن جريج عن مجاهد أنه قرأها \" لتزول منه الجبال \" بفتح اللام الأولى وضم الثانية وروى العوفي عن ابن عباس في قوله \" وإن كان مكرهم لتزول منه الجبال \" يقول ما كان مكرهم لتزول منه الجبال وكذا قال الحسن البصري ووجهه ابن جرير بأن هذا الذي فعلوه بأنفسهم من شركهم بالله وكفرهم به ما ضر ذلك شيئا من الجبال ولا غيرها وإنما عاد وبال ذلك عليهم قلت ويشبه هذا قول الله تعالى \" ولا تمش في الأرض مرحا إنك لن تخرق الأرض ولن تبلغ الجبال طولا \" والقول الثاني في تفسيرها ما رواه علي بن أبي طلحة عن ابن عباس \" وإن كان مكرهم لتزول منه الجبال \" يقول شركهم كقوله \" تكاد السموات يتقطرن منه \" الآية.وهكذا قال الضحاك وقتادة."
    },
    {
      "ayah": 47,
      "surah": 14,
      "text": "يقول تعالى مقررا لوعده ومؤكدا \" فلا تحسبن الله مخلف وعده رسله \" أي من نصرتهم في الحياة الدنيا ويوم يقوم الأشهاد ثم أخبر تعالى أنه ذو عزة لا يمتنع عليه شيء أراده ولا يغالب وذو انتقام ممن كفر به وجحده \"فويل يومئذ للمكذبين\"."
    },
    {
      "ayah": 48,
      "surah": 14,
      "text": "ولهذا قال \" يوم تبدل الأرض غير الأرض والسموات \" أي وعده هذا حاصل يوم تبدل الأرض وهي هذه على غير الصفة المألوفة المعروفة كما جاء في الصحيحين من حديث أبي حازم عن سهل بن سعد قال: قال رسول الله صلى الله عليه وسلم \" يحشر الناس يوم القيامة على أرض بيضاء عفراء كقرصة النقي ليس فيها معلم لأحد \" وقال الإمام أحمد حدثنا محمد بن أبي عدي عن داود عن الشعبي عن مسروق عن عائشة أنها قالت أنا أول الناس سأل رسول الله صلى الله عليه وسلم عن هذه الآية \" يوم تبدل الأرض غير الأرض والسموات \" قالت: قلت أين الناس يومئذ يا رسول الله ؟ قال \" على الصراط \".رواه مسلم منفردا به دون البخاري والترمذيُّ وابن ماجه من حديث داود بن أبي هند به وقال الترمذي حسن صحيح ورواه أحمد أيضا عن عفان عن وهيب عن داود عن الشعبي عنها ولم يذكر مسروقا وقال قتادة عن حسان بن بلال المزني عن عائشة رضي الله عنها أنها سألت رسول الله صلى الله عليه وسلم عن قول الله \" يوم تبدل الأرض غير الأرض والسموات \" قال: قالت يا رسول الله فأين الناس يومئذ ؟ قال \" لقد سألتني عن شيء ما سألني عنه أحد من أمتي ذاك أن الناس على جسرهم \".وروى الإمام أحمد من حديث حبيب بن أبي عمرة عن مجاهد عن ابن عباس حدثتني عائشة أنها سألت رسول الله صلى الله عليه وسلم عن قوله تعالى \" والأرض جميعا قبضته يوم القيامة والسموات مطويات بيمينه \" فأين الناس يومئذ يا رسول الله ؟ قال \" هم على متن جهنم \" وقال ابن جرير حدثنا الحسن حدثنا علي بن الجعد أخبرنا القاسم سمعت الحسن قال: قالت عائشة يا رسول الله \" يوم تبدل الأرض غير الأرض \" فأين الناس يومئذ ؟ قال \" إن هذا شيء ما سألني عنه أحد \" قال \" على الصراط يا عائشة \" ورواه أحمد عن عفان عن القاسم بن الفضل عن الحسن به وقال الإمام مسلم بن الحجاج في صحيحه حدثني الحسن بن علي الحلواني حدثني أبو توبة الربيع بن نافع حدثنا معاوية بن سلام عن زيد يعني أخاه أنه سمع أبا سلام حدثني أبو أسماء الرحبي أن ثوبان مولى رسول الله صلى الله عليه وسلم حدثه قال: كنت قائما عند رسول الله صلى الله عليه وسلم فجاءه حبر من أحبار اليهود فقال السلام عليك يا محمد فدفعته دفعة كاد يصرع منها فقال لم تدفعني ؟ فقلت ألا تقول يا رسول الله فقال اليهودي إنما ندعوه باسمه الذي سماه به أهله فقال رسول الله صلى الله عليه وسلم \" إن اسمي محمد الذي سماني به أهلي \" فقال اليهودي جئت أسألك فقال رسول الله صلى الله عليه وسلم \" أينفعك شيئا إن حدثتك \" قال أسمع بأذني فنكت رسول الله صلى الله عليه وسلم بعود معه فقال \" سل \" فقال اليهودي أين يكون الناس يوم تبدل الأرض غير الأرض والسموات فقال رسول الله صلى الله عليه وسلم \" هم في الظلمة دون الجسر \" قال فمن أول الناس إجازة ؟ فقال \" فقراء المهاجرين \" فقال اليهودي فما تحفتهم حين يدخلون الجنة ؟ قال: \" زيادة كبد النون\" قال فما غذاؤهم في أثرها ؟ قال \" ينحر لهم ثور الجنة الذي كان يأكل من أطرافها \" قال فما شرابهم عليه ؟ قال: من عين فيما تسمى سلسبيلا \" قال صدقت \" قال وجئت أسألك عن شئ لا يعلمه أحد من أهل الأرض إلا نبي أو رجل أو رجلان قال أينفعك إن حدثتك ؟ قال \" أسمع بأذني \" قال جئت أسألك عن الولد قال \" ماء الرجل أبيض وماء المرأة أصفر فإذا اجتمعا فَعَلا مَنِيُّ الرجل منيَّ المرأة أَذْكرا بإذن الله تعالى وإذا علا مني المرأة مني الرجل آنثا بإذن الله \" قال اليهودي لقد صدقت وإنك لنبي ثم انصرف فقال رسول الله صلى الله عليه وسلم \" لقد سألني هذا عن الذي سألني عنه وما لي علم بشيء منه حتى أتاني الله به \" قال أبو جعفر بن جرير الطبري حدثنا ابن عوف حدثنا أبو المغيرة حدثنا ابن أبي مريم حدثنا سعيد بن ثوبان الكلاعي عن أبي أيوب الأنصاري أن حبرا من اليهود سأل النبي صلى الله عليه وسلم فقال أرأيت إذ يقول الله تعالى في كتابه \" يوم تبدل الأرض غير الأرض والسموات \" فأين الخلق عند ذلك ؟ فقال \" أضياف الله فلن يعجزهم ما لديه \" ورواه ابن أبي حاتم من حديث أبي بكر بن عبد الله بن أبي مريم به وقال جعبة أخبرنا أبو إسحاق سمعت عمرو بن ميمون وربما قال: قال عبد الله وربما لم يقل فقلت له عن عبد الله فقال سمعت عمرو بن ميمون يقول \" يوم تبدل الأرض غير الأرض \" قال أرض كالفضة البيضاء نقية لم يسفك فيها دم ولم يعمل عليها خطيئة ينفذهم البصر ويسمعهم الداعي حفاة عراة كما خلقوا قال أراه قال قياما حتى يلجمهم العرق وروي من وجه آخر عن شعبة عن إسرائيل عن أبي إسحاق عن عمرو بن ميمون عن ابن مسعود بنحوه وكذا رواه عاصم عن زر عن ابن مسعود به وقال سفيان عن أبي إسحق عن عمرو بن ميمون لم يخبر به أورد ذلك كله ابن جرير وقد قال الحافظ أبو بكر البزار حدثنا محمد بن عبد الله بن عبيد بن عقيل حدثنا سهل بن حماد أبو غياث حدثنا جرير بن أيوب عن أبي إسحاق عن عمرو بن ميمون عن عبد الله عن النبي صلى الله عليه وسلم في قول الله عز وجل \" يوم تبدل الأرض غير الأرض \" قال \" أرض بيضاء لم يسفك عليها دم ولم يعمل عليها خطيئة \".ثم قال لا نعلم رفعه إلا جرير بن أيوب ليس بالقوي ثم قال ابن جرير حدثنا أبو كريب ثنا معاوية بن هشام عن سنان عن جابر الجعفي عن أبي جبيرة عن زيد قال أرسل رسول الله صلى الله عليه وسلم إلى اليهود فقال \" هل تدرون لم أرسلت إليهم ؟ \" قالوا الله ورسوله أعلم قال \" فإني أرسلت إليهم أسألهم عن قول الله \" يوم تبدل الأرض غير الأرض \" إنها تكون يومئذ بيضاء مثل الفضة \" فلما جاءوا سألهم فقالوا تكون بيضاء مثل النقي وهكذا روي عن علي وابن عباس وأنس بن مالك ومجاهد بن جبر أنها تبدل يوم القيامة بأرض من فضة وعن علي رضي الله عنه أنه قال تصير الأرض فضة والسموات ذهبا وقال الربيع عن أبي العالية عن أبي بن كعب قال: تصير السموات جنانا وقال أبو معشر عن محمد بن كعب القرظي عن محمد بن قيس في قوله \" يوم تبدل الأرض غير الأرض \" قال خبزة يأكل منها المؤمنون من تحت أقدامهم وكذا روى وكيع عن عمر بن بشر الهمداني عن سعيد بن جبير في قوله \" يوم تبدل الأرض غير الأرض \" قال تبدل الأرض خبزة بيضاء يأكل المؤمن من تحت قدميه وقال الأعمش عن خثيم قال: قال عبد الله بن مسعود: الأرض يوم القيامة كلها نار والجنة من ورائها ترى كواعبها وأكوابها ويلجم الناس العرق ويبلغ منهم العرق ولم يبلغوا الحساب وقال الأعمش أيضا عن المنهال بن عمرو عن قيس بن السكن قال: قال عبد الله الأرض كلها نار يوم القيامة والجنة من ورائها نرى أكوابها وكواعبها والذي نفس عبد الله بيده إن الرجل ليفيض عرقا حتى ترشح في الأرض قدمه ثم يرتفع حتى يبلغ أنفه وما مسه الحساب قالوا مم ذلك يا أبا عبد الرحمن ؟ قال مما يرى الناس ويلقون وقال أبو جعفر الرازي عن الربيع بن أنس عن كعب في قوله \" يوم تبدل الأرض غير الأرض والسموات \" قال تصير السموات جنانا فيصير مكان البحر نارا وتبدل الأرض غيرها وفي الحديث الذي رواه أبو داود \" لا يركب البحر إلا غاز أو حاج أو معتمر فإن تحت البحر نارا- أو- تحت النار بحرا \" وفي حديث الصور المشهور المروي عن أبي هريرة عن النبي صلى الله عليه وسلم أنه قال \" يبدل الله الأرض غير الأرض والسموات فيبسطها ويمدها مد الأديم العكاظي لا ترى فيها عوجا ولا أمتا ثم يزجر الله الخلق زجرة فإذا هم في هذه المبدلة \" وقوله \" وبرزوا لله \" أي خرجت الخلائق جميعها من قبورهم لله \" الواحد القهار \" أي الذي قهر كل شيء وغلبه ودانت له الرقاب وخضعت له الألباب."
    },
    {
      "ayah": 49,
      "surah": 14,
      "text": "يقول تعالى \" يوم تبدل الأرض غير الأرض والسموات \" وتبرز الخلائق لديانها ترى يا محمد يومئذ المجرمين وهم الذين أجرموا بكفرهم وفسادهم \" مقرنين \" أي بعضهم إلى بعض قد جمع بين النظراء أو الأشكال منهم كل صنف إلى صنف كما قال تعالى \" احشروا الذين ظلموا وأزواجهم \" وقال \" وإذا النفوس زوجت \" وقال \" وإذا ألقوا منها مكانا ضيقا مقرنين دعوا هنالك ثبورا \" وقال \" والشياطين كل بناء وغواص وآخرين مقرنين في الأصفاد \" والأصفاد هي القيود قاله ابن عباس وسعيد بن جبير والأعمش وعبد الرحمن بن زيد وهو مشهور في اللغة قال عمرو بن كلثوم فآبوا بالثياب وبالسبايا وأبنا بالملوك مصفدينا"
    },
    {
      "ayah": 5,
      "surah": 14,
      "text": "فيقول تعالى وكما أرسلناك يا محمد وأنزلنا عليك الكتاب لتخرج الناس كلهم تدعوهم إلى الخروج من الظلمات إلى النور كذلك أرسلنا موسى إلى بني إسرائيل بآياتنا قال مجاهد وهي التسع الآيات \" أن أخرج قومك \" أي أمرناه قائلين له \" أخرج قومك من الظلمات إلى النور \" أي ادعهم إلى الخير ليخرجوا من ظلمات ما كانوا فيه من الجهل والضلال إلى نور الهدى وبصيرة الإيمان \" وذكرهم بأيام الله \" أي بأياديه ونعمه عليهم في إخراجه إياهم من أسر فرعون وقهره وظلمه وغشمه وإنجائه إياهم من عدوهم وفلقه لهم البحر وتظليله إياهم بالغمام وإنزاله عليهم المن والسلوى إلى غير ذلك من النعم قال ذلك مجاهد وقتادة وغير واحد وقد ورد فيه الحديث المرفوع الذي رواه عبد الله بن الإمام أحمد بن حنبل في مسند أبيه حيث قال: حدثني يحيى بن عبد الله مولى بني هاشم حدثنا محمد بن أبان الجعفي عن أبي إسحاق عن سعيد بن جبير عن ابن عباس عن أبي بن كعب عن النبي صلى الله عليه وسلم في قوله تعالى \" وذكرهم بأيام الله \" قال \" بنعم الله \" ورواه ابن جرير وابن أبي حاتم من حديث محمد بن أبان به ورواه عبد الله ابنه أيضا موقوفا وهو شبه ; وقوله \" إن في ذلك لآيات لكل صبار شكور \" أي أن في ما صنعنا بأوليائنا بني إسرائيل حين أنقذناهم من يد فرعون وأنجيناهم مما كانوا فيه من العذاب المهين لعبرة لكل صبار أي في الضراء شكور أي في السراء كما قال قتادة: نعم العبد عبد إذا ابتلي صبر وإذا أعطي شكر وكذا جاء في الصحيح عن رسول الله صلى الله عليه وسلم أنه قال \" إن أمر المؤمن كله عجب لا يقضي الله له قضاء إلا كان خيرا له إن أصابته ضراء صبر فكان خيرا له وإن أصابته سراء شكر فكان خيرا له \"."
    },
    {
      "ayah": 50,
      "surah": 14,
      "text": "وقوله \" سرابيلهم من قطران \" أي ثيابهم التي يلبسونها من قطران وهو الذي تهنأ به الإبل أي تطلى قال قتادة وهو ألصق شيء بالنار ; ويقال فيه قطران بفتح القاف وكسر الطاء وتسكينها وبكسر القاف وتسكين الطاء ومنه قول أبي النجم كأن قطرانا إذا تلاها ترمي به الريح إلى مجراها وكان ابن عباس يقول القطران هو النحاس المذاب وربما قرأها \" سرابيلهم من قطران \" أي من نحاس حار قد انتهى حره وكذا روي عن مجاهد وعكرمة وسعيد بن جبير والحسن وقتادة وقوله \" وتغشى وجوههم النار \" كقوله \" تلفح وجوههم النار وهم فيها كالحون \" وقال الإمام أحمد رحمه الله حدثنا يحيى بن إسحاق أنبأنا أبان بن يزيد عن يحيى بن أبي كثير عن زيد عن أبي سلام عن أبي مالك الأشعري قال: قال رسول الله صلى الله عليه وسلم \" أربع في أمتي من أمر الجاهلية لا يتركوهن: الفخر بالأحساب والطعن في الأنساب والاستسقاء بالنجوم والنياحة على الميت ; والنائحة إذا لم تتب قبل موتها تقام يوم القيامة وعليها سربال من قطران ودرع من جرب \" انفرد بإخراجه مسلم وفي حديث القاسم عن أبي أمامة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم رفعه \" النائحة إذا لم تتب توقف فى طريق بين الجنة والنار وسرابيلها من قطران وتغشى وجهها النار \"."
    },
    {
      "ayah": 51,
      "surah": 14,
      "text": "وقوله \" ليجزي الله كل نفس ما كسبت \" أي يوم القيامة \" ليجزي الذين أساءوا بما عملوا \" الآية \" إن الله سريع الحساب \" يحتمل أن يكون كقوله تعالى \" اقترب للناس حسابهم وهم في غفلة معرضون \" ويحتمل أنه في حال محاسبته لعبده سريع النجاز لأنه يعلم كل شيء ولا يخفى عليه خافية وإن جميع الخلق بالنسبة إلى قدرته كالواحد منهم كقوله تعالى \" ما خلقكم ولا بعثكم إلا كنفس واحده \" وهذا معنى قول مجاهد \" سريع الحساب \" إحصاء ويحتمل أن يكون المعنيان مرادين والله أعلم."
    },
    {
      "ayah": 52,
      "surah": 14,
      "text": "يقول تعالى هذا القرآن بلاغ للناس كقوله \" لأنذركم به ومن بلغ \" أي هو بلاغ لجميع الخلق من إنس وجن كما قال في أول السورة \" الر كتاب أنزلناه إليك لتخرج الناس من الظلمات إلى النور \" الآية \" ولينذروا به \" أي ليتعظوا به \" وليعلموا أنما هو إله واحد \" أي يستدلوا بما فيه من الحجج والدلالات على أنه لا إله إلا هو \" وليذكر أولوا الألباب \" أى ذوي العقول آخر تفسير سورة إبراهيم عليه السلام ولله الحمد والمنة."
    },
    {
      "ayah": 6,
      "surah": 14,
      "text": "يقول تعالى مخبرا عن موسى حين ذكر قومه بأيام الله عندهم ونعمه عليهم إذ أنجاهم من آل فرعون وما كانوا يسومونهم به من العذاب والإذلال حيث كانوا يذبحون من وجد من أبنائهم ويتركون إناثهم فأنقذهم الله من ذلك وهذه نعمة عظيمة ولهذا قال \" وفي ذلكم بلاء من ربكم عظيم \" أى نعمة عظيمة منه عليكم في ذلك أنتم عاجزون عن القيام بشكرها.وقيل: وفيما كان يصنعه بكم قوم فرعون من تلك الأفاعيل \" بلاء \" أي اختبار عظيم ويحتمل أن يكون المراد هذا وهذا والله أعلم كقوله تعالى \" وبلوناهم بالحسنات والسيئات لعلهم يرجعون \"."
    },
    {
      "ayah": 7,
      "surah": 14,
      "text": "\" وقوله \" وإذ تأذن ربكم \" أي آذنكم وأعلمكم بوعده لكم ويحتمل أن يكون المعنى: وإذ أقسم بكم وآلى بعزته وجلاله وكبريائه كقوله تعالى \" وإذ تأذن ربك ليبعثن عليهم إلى يوم القيامة \" وقوله \" لئن شكرتم لأزيدنكم \" أي لئن شكرتم نعمتي عليكم لأزيدنكم منها \" ولئن كفرتم \" أي كفرتم النعم وسترتموها وجحدتموها \" إن عذابي لشديد \" وذلك بسلبها عنهم وعقابه إياهم على كفرها وقد جاء في الحديث \" إن العبد ليحرم الرزق بالذنب يصيبه \" وفي المسند أن رسول الله صلى الله عليه وسلم مر به سائل فأعطاه تمرة فسخطها ولم يقبلها ثم مر به آخر فأعطاه إياها فقبلها وقال تمرة من رسول الله صلى الله عليه وعلى آله وسلم فأمر له بأربعين رهما أو كما قال قال الإمام أحمد: حدثنا أسود حدثنا عمارة الصيدلاني عن ثابت عن أنس قال أتى النبي صلى الله عليه وسلم سائل فأمر له بتمرة فلم يأخذها أو وحش بها - قال - وأتاه آخر فأمر له بتمرة فقال سبحان الله تمرة من رسول الله صلى الله عليه وسلم فقال للجارية \" اذهبي إلى أم سلمة فأعطيه الأربعين درهما التي عندها \" تفرد به الإمام أحمد وعمارة بن زاذان وثقه ابن حبان وأحمد ويعقوب بن سفيان وقال ابن معين: صالح وقال أبو زرعة لا بأس به وقال أبو حاتم يكتب حديثه ولا يحتج به ليس بالمتين وقال البخاري ربما يضطرب في حديثه وعن أحمد أيضا أنه قال: روي عنه أحاديث منكرة.وقال أبو داود ليس بذلك وضعفه الدارقطني وقال ابن عدي لا بأس به ممن يكتب حديثه."
    },
    {
      "ayah": 8,
      "surah": 14,
      "text": "وقوله تعالى \" وقال موسى إن تكفروا أنتم ومن في الأرض جميعا فإن الله لغني حميد \" أي هو غني عن شكر عباده وهو الحميد المحمود وإن كفره من كفر كقوله \" إن تكفروا فإن الله غني عنكم \" الآية وقوله \" فكفروا وتولوا واستغنى الله والله غني حميد \" وفي صحيح مسلم عن أبي ذر عن رسول الله صلى الله عليه وسلم فيما يرويه عن ربه عز وجل أنه قال \" يا عبادي لو أن أولكم وآخركم وإنسكم وجنكم كانوا على أتقى قلب رجل واحد منكم ما زاد ذلك في ملكي شيئا يا عبادي لو أن أولكم وآخركم وإنسكم وجنكم كانوا على أفجر قلب رجل واحد منكم ما نقص ذلك فى ملكي شيئا يا عبادي لو أن أولكم وآخركم وإنسكم وجنكم قاموا في صعيد واحد فسألوني فأعطيت كل إنسان مسألته ما نقص ذلك من ملكي شيئا إلا كما ينقص المخيط إذ دخل البحر \" فسبحانه وتعالى الغني الحميد."
    },
    {
      "ayah": 9,
      "surah": 14,
      "text": "قال ابن جرير: هذا من تمام قول موسى لقومه يعني وتذكيره إياهم بأيام الله بانتقامه من الأمم المكذبة بالرسل وفيما قال ابن جرير نظر والظاهر أنه خبر مستأنف من الله تعالى لهذه الأمة فإنه قد قيل إن قصة عاد وثمود ليست من التوراة فلو كان هذا من كلام موسى لقومه وقصصه عليهم لا شك أن تكون هاتان القصتان في التوراة والله أعلم وبالجملة فالله تعالى قد قص علينا خبر قوم نوح وعاد وثمود وغيرهم من الأمم المكذبة للرسل مما لا يحصي عددهم إلا الله عز وجل \" جاءتهم رسلهم بالبينات \" أى بالحجج والدلائل الواضحات الباهرات القاطعات وقال ابن إسحاق عن عمرو بن ميمون عن عبد الله أنه قال في قوله \" لا يعلمهم إلا الله \" كذب النسابون.وقال عروة بن الزبير وما وجدنا أحدا يعرف ما بعد معد بن عدنان وقوله \" فردوا أيديهم في أفواههم \" اختلف المفسرون في معناه قيل معناه أنهم أشاروا إلى أفواه الرسل يأمرونهم بالسكوت عنهم لما دعوهم إلى الله عز وجل وقيل بل وضعوا أيديهم على أفواههم تكذيبا لهم وقيل بل هو عبارة عن سكوتهم عن جواب الرسل.وقال مجاهد ومحمد بن كعب وقتادة معناه أنهم كذبوهم وردوا عليهم قولهم بأفواههم قال ابن جرير: وتوجيهه أن في هنا بمعنى الباء قال وقد سمع من العرب أدخلك الله بالجنة يعنون في الجنة وقال الشاعر: وأرغب فيها عن لقيط ورهطه ولكنني عن سنبس لست أرغب يريد أرغب بها قلت ويؤيد قول مجاهد تفسير ذلك بتمام الكلام \" وقالوا إنا كفرنا بما أرسلتم به وإنا لفي شك مما تدعوننا إليه مريب \" فكان هذا والله أعلم تفسير لمعنى \" فردوا أيديهم في أفواههم \" وقال سفيان الثوري وإسرائيل عن أبي إسحاق عن أبي الأحوص عن عبد الله في قوله \" فردوا أيديهم في أفواههم \" قال عضوا عليها غيظا وقال شعبة عن أبي إسحاق أبي هبيرة ابن مريم عن عبد الله أنه قال ذلك أيضا.وقد اختاره عبد الرحمن بن زيد بن أسلم ووجهه ابن جرير مختارا له بقوله تعالى عن المنافقين \" وإذا خلوا عضوا عليكم الأنامل من الغيظ \" وقال العوفي عن ابن عباس لما سمعوا كلام الله عجبوا ورجعوا بأيديهم إلى أفواههم وقالوا إنا كفرنا بما أرسلتم به الآية يقولون لا نصدقكم فيما جئتم به فإن عندنا فيه شكا قويا."
    }
  ]
}
