{
  "ayahs": [
    {
      "ayah": 1,
      "surah": 15,
      "text": "قد اختلف المفسرون في الحروف المقطعة التي في أوائل السور فمنهم من قال هي مما استأثر الله بعلمه فردوا علمها إلى الله ولم يفسرها حكاه القرطبي في تفسـره عن أبي بكر وعمر وعثمان وعلي وابن مسعود رضي الله عنهم أجمعين وقاله عامر الشعبي وسفيان الثوري والربيع بن خيثم واختاره أبو حاتم بن حبان. ومنهم من فسرها واختلف هؤلاء في معناها فقال عبدالرحمن بن زيد بن أسلم إنما هي أسماء السور. قال العلامة أبو القاسم محمود بن عمر الزمخشري في تفسيره وعليه إطباق الأكثر ونقل عن سيبويه أنه نص عليه ويعتضد لهذا بما ورد في الصحيحين عن أبي هريرة أن رسول الله صلى الله عليه وسلم كان يقرأ في صلاة الصبح يوم الجمعة \"الم\" السجدة و \"هل أتى على الإنسان\" وقال سفيان الثوري عن ابن أبي نجيح عن مجاهد أنه قال: الم وحم والمص وص. فواتح افتتح الله بها القرآن وكذا قال غيره عن مجاهد وقال مجاهد في رواية أبي حذيفة موسى بن مسعود عن شبل عن ابن أبي نجيح عنه أنه قال الم اسم من أسماء القرآن وهكذا وقال قتادة وزيد بن أسلم ولعل هذا يرجع إلى معنى قول عبدالرحمن بن زيد بن أسلم أنه اسم من أسماء السور فإن كل سورة يطلق عليها اسم القرآن فإنه يبعد أن يكون المص اسما للقرآن كله لأن المتبادر إلى فهم سامع من يقول قرأت المص إنما ذلك عبارة عن سورة الأعراف لا لمجموع القرآن والله أعلم. وقيل هي اسم من أسماء الله تعالى فقال عنها في فواتح السور من أسماء الله تعالى وكذلك قال سالم بن عبدالله وإسماعيل بن عبدالرحمن السدي الكبير وقال شعبة عن السدي بلغني أن ابن عباس قال الم اسم من أسماء الله الأعظم. هكذا رواه ابن أبي حاتم من حديث شعبة ورواه ابن جرير عن بندار عن ابن مهدي عن شعبة قال سألت السدي عن حم وطس والم فقال قال ابن عباس هي اسم الله الأعظم وقال ابن جرير وحدثنا محمد بن المثنى حدثنا أبو النعمان حدثنا شعبة عن إسماعيل السدي عن مرة الهمذاني قال: قال عبدالله فذكر نحوه. وحُكي مثله عن علي وابن عباس وقال علي بن أبي طلحة عن ابن عباس هو قسم أقسم الله به وهو من أسماء الله تعالى وروى ابن أبي حاتم وابن جرير من حديث ابن علية عن خالد الحذاء عن عكرمة أنه قال الم قسم. وروينا أيضا من حديث شريك بن عبدالله بن عطاء بن السائب عن أبى الضحى عن ابن عباس: الم قال أنا الله أعلم وكذا قال سعيد بن جبير وقال السدي عن أبي مالك وعن أبي صالح عن ابن عباس وعن مرة الهمذاني عن ابن مسعود وعن ناس من أصحاب النبي صلى الله عليه وسلم الم قال أما الم فهي حروف استفتحت من حروف هجاء أسماء الله تعالى. قال وأبو جعفر الرازي عن الربيع بن أنس عن أبي العالية في قوله تعالى الم قال هذه الأحرف الثلاثة من التسعة والعشرين حرفا دارت فيها الألسن كلها ليس منها حرف إلا وهو مفتاح اسم من أسمائه وليس منها حرف إلا وهو من آلائه وبلألائه ليس منها حرف إلا وهو في مدة أقوام وآجالهم. قال عيسى ابن مريم عليه السلام وعجب: فقال أعجب أنهم يظنون بأسمائه ويعيشون في رزقه فكيف يكفرون به فالألف مفتاح الله واللام مفتاح اسمه لطيف والميم مفتاح اسمه مجيد فالألف آلاء الله واللام لطف الله والميم مجد الله والألف سنة واللام ثلاثون سنة والميم أربعون سنة. هذا لفظ ابن أبي حاتم ونحوه رواه ابن جرير ثم شرع يوجه كل واحد من هذه الأقوال ويوفق بينها وأنه لا منافاة بين كل واحد منها وبين الآخر وأن الجمع ممكن فهي أسماء للسور ومن أسماء الله تعالى يفتتح بها السور فكل حرف منها دل على اسم من أسمائه وصفة من صفاته كما افتتح سورا كثيرة بتحميده وتسبيحه وتعظيمه قال ولا مانع من دلالة الحرف منها على اسم من أسماء الله وعلى صفة من صفاته وعلى مدة وغير ذلك كما ذكره الربيع بن أنس عن أبي العالية لأن الكلمة الواحدة تطلق على معاني كثيرة كلفظة الأمة فإنها تطلق ويراد به الدين كقوله تعالى \"إنا وجدنا آباءنا على أمة\" وتطلق ويراد بها الرجل المطيع لله كقوله تعالى \"إن إبراهيم كان أمة قانتا لله حنيفا ولم يك من المشركين\" وتطلق ويراد بها الجماعة كقوله تعالى \"وجد عليه أمة من الناس يسقون\" وقوله تعالى \"ولقد بعثنا في كل أمة رسولا\" وتطلق ويراد بها الحين من الدهر كقوله تعالى \"وقال الذي نجا منهما وادكر بعد أمة\" أي بعد حين على أصح القولين قال فكذلك هذا. هذا حاصل كلامه موجها ولكن هذا ليس كما ذكره أبو العالية فإن أبا العالية زعم أن الحرف دل على هذا وعلى هذا وعلى هذا معا ولفظة الأمة وما أشبهها من الألفاظ المشتركة في الاصطلاح إنما دل في القرآن في كل موطن على معنى واحد دل عليه سياق الكلام فأما حمله على مجموع محامله إذا أمكن فمسألة مختلف فيها بين علماء الأصول ليس هذا موضع البحث فيها والله أعلم. ثم إن لفظة الأمة تدل على كل من معانيها في سياق الكلام بدلالة الوضع فأما دلالة الحرف الواحد على اسم يمكن أن يدل على اسم آخر من غير أن يكون أحدهما أولى من الآخر في التقدير أو الإضمار بوضع ولا بغيره فهذا مما لا يفهم إلا بتوقيف والمسألة مختلف فيها وليس فيها إجماع حتى يحكم به وما أنشدوه من الشواهد على صحة إطلاق الحرف الواحد على بقية الكلمة فإن في السياق ما يدل على ما حذف بخلاف هذا كما قال الشاعر: قلنا قفي لنا فقالت قاف لا تحسبي أنا نسينا الإيجاف تعني وقفت. وقال الآخر: ما للظليم عال كيف لايـ ينقد عنه جلده إذا يـ فقال ابن جرير كأنه أراد أن يقول إذا يفعل كذا وكذا فاكتفى بالياء من يفعل وقال الآخر: بالخير خيرات وان شرا فا ولا أريد الشر إلا أن تـ يقول وإن شرا فشرا ولا أريد الشر إلا أن تشاء فاكتفى بالفاء والتاء من الكلمتين عن بقيتهما ولكن هذا ظاهر من سياق الكلام والله أعلم. قال القرطبي وفي الحديث \"من أعان على قتل مسلم بشطر كلمة\" الحديث قال سفيان هو أن يقول في اقتل\"ا قـ\" وقال خصيف عن مجاهد أنه قال فواتح السور كلها\"ق وص وحم وطسم والر\" وغير ذلك هجاء موضوع وقال بعض أهل العربية هي حروف من حروف المعجم استغنى بذكر ما ذكر منها في أوائل السور عن ذكر بواقيها التي هي تتمة الثمانية والعشرين حرفا كما يقول القائل ابني يكتب في - ا ب ت ث - أي في حروف المعجم الثمانية والعشرين فيستغني بذكر بعضها عن مجموعها حكاه ابن جرير. قلت مجموع الحروف المذكورة في أوائل السور بحذف المكرر منها أربعة عشر حرفا وهي - ال م ص ر ك ه ي ع ط س ح ق ن- يجمعها قولك: نص حكيم قاطع له سر. وهي نصف الحروف عددا والمذكور منها أشرف من المتروك وبيان ذلك من صناعة التصريف. قال الزمخشري وهذه الحروف الأربعة عشر مشتملة على أصناف أجناس الحروف يعني من المهموسة والمجهورة ومن الرخوة والشديدة ومن المطبقة والمفتوحة ومن المستعلية والمنخفضة ومن حروف القلقلة. وقد سردها مفصلة ثم قال: فسبحان الذي دقت في كل شئ حكمته. وهذه الأجناس المعدودة مكثورة بالمذكورة منها وقد علمت أن معظم الشيء وجله ينزل منزلة كله وههنا لخص بعضهم في هذا المقام كلاما فقال: لا شك أن هذه الحروف لم ينزلها سبحانه وتعالى عبثا ولا سدى ومن قال من الجهلة إن في القرآن ما هو تعبد لا معنى له بالكلمة فقد أخطأ خطأ كبيرا فتعين أن لها معنى في نفس الأمر فإن صح لنا فيها عن المعصوم شيء قلنا به وإلا وقفنا حيث وقفنا وقلنا \"آمنا به كل من عند ربنا\" ولم يجمع العلماء فيها على شيء معين وإنما اختلفوا فمن ظهر له بعض الأقوال بدليل فعليه اتباعه وإلا فالوقف حتى يتبين هذا المقام. المقام الآخر في الحكمة التي اقتضت إيراد هذه الحروف في أوائل السور ما هي مع قطع النظر عن معانيها في أنفسها فقال بعضهم إنما ذكرت ليعرف بها أوائل السور حكاه ابن جرير وهذا ضعيف لأن الفصل حاصل بدونها فيما لم تذكر فيه وفيما ذكرت فيه البسملة تلاوة وكتابة وقال آخرون بل ابتدئ بها لتفتح لاستماعها أسماع المشركين إذ تواصوا بالإعراض عن القرآن حتى إذا استمعوا له تلا عليهم المؤلف منه حكاه ابن جرير أيضا وهو ضعيف أيضا لأنه لو كان كذلك لكان ذلك في جميع السور لا يكون في بعضها بل غالبها ليس كذلك ولو كـان كذلك أيضا لانبغى الابتداء بها في أوائل الكلام معهم سواء كان افتتاح سورة أو غير ذلك ثم إن هذه السورة والتي تليها أعني البقرة وآل عمران مدنيتان ليستا خطابا للمشركين فانتقض ما ذكروه بهذه الوجوه. وقال آخرون بل إنما ذكرت هذه الحروف في أوائل السور التي ذكرت فيها بيانا لإعجاز القرآن وأن الخلق عاجزون عن معارضته بمثله هذا مع أنه مركب من هذه الحروف المقطعة التي يتخاطبون بها وقد حكى هذا المذهب الرازي في تفسيره عن المبرد وجمع من المحققين وحكى القرطبي عن الفراء وقطرب نحو هذا وقرره الزمخشري فى كشافه ونصره أتم نصر وإليه ذهب الشيخ الإمام العلامة أبو العباس ابن تيمية وشيخنا الحافظ المجتهد أبو الحجاج المزي وحكاه لي عن ابن تيمية. قال الزمخشري ولم ترد كلها مجموعة في أول القرآن وإنما كررت ليكون أبلغ في التحدي والتبكيت كما كررت قصص كثيرة وكرر التحدي بالصريح في أماكن قال وجاء منها على حرف واحد كقوله - ص ن ق- وحرفين مثل \"حم\" وثلاثة مثل \"الم\" وأربعة مثل \"المر\" و \"المص\" وخمسة مثل \"كهيعص- و- حمعسق\" لأن أساليب كلامهم على هذا من الكلمات ما هو على حرف وعلى حرفين وعلى ثلاثة وعلى أربعة وعلى خمسة لا أكثر من ذلك \"قلت\" ولهذا كل سورة افتتحت بالحروف فلا بد أن يذكر فيها الانتصار للقرآن وبيان إعجازه وعظمته وهذا معلوم بالاستقراء وهو الواقع في تسع وعشرين سورة ولهذا يقول تعالى \"الم ذلك الكتاب لا ريب فيه\" \"الم الله لا إله إلا هو الحي القيوم نزل عليك الكتاب بالحق مصدقا لما بين يديه\" \"المص كتاب أنزل إليك فلا يكن في صدرك حرج منه\" \"الر كتاب أنزلناه إليك لتخرج الناس من الظلمات إلى النور بإذن ربهم\" \"الم تنزيل الكتاب لا ريب فيه من رب العالمين\" \"حم تنزيل من الرحمن الرحيم\" \"حم عسق كذلك يوحي إليك وإلى الذين من قبلك الله العزيز الحكيم\" وغير ذلك من الآيات الدالة على صحة ما ذهب إليه هؤلاء لمن أمعن النظر والله أعلم. وأما من زعم أنها دالة على معرفة المدد وأنه يستخرج من ذلك أوقات الحوادث والفتن والملاحم فقد ادعى ما ليس له وطار في غير مطاره وقد ورد في ذلك حديث ضعيف وهو مع ذلك أدل على بطلان هذا المسلك من التمسك به على صحته وهو ما رواه محمد بن إسحق بن يسار صاحب المغازي حدثني الكلبي عن أبي صالح عن ابن عباس عن جابر بن عبدالله بن رباب قال مر أبو ياسر بن أخطب في رجال من يهود برسول الله صلى الله عليه وسلم وهو يتلو فاتحة سورة البقرة \"الم ذلك الكتاب لا ريب فيه\" فأتى أخاه بن أخطب في رجال من اليهود فقال تعلمون والله لقد سمعت محمدا يتلو فيما أنزل الله تعالى عليه \"الم ذلك الكتاب لا ريب فيه\" فقال أنت سمعته قال نعم قال فمشى حي بن أخطب في أولئك النفر من اليهود إلى رسول الله صلى الله عليه وسلم فقالوا يا محمد ألم يذكر أنك تتلوا فيما أنزل الله عليك \"الم ذلك الكتاب\"؟ فقال رسول الله صلى الله عليه وسلم \"بلى\" فقالوا جاءك بهذا جبريل من عند الله؟ فقال \"نعم\" قالوا لقد بعث الله قبلك أنبياء ما نعلمه بين لنبي منهم ما مدة ملكه وما أجل أمته غيرك. فقام حي بن أخطب وأقبل على من كان معه فقال لهم الألف واحدة واللام ثلاثون والميم أربعون فهذه إحدى وسبعون سنة أفتدخلون في دين نبي إنما مدة ملكه وأجل أمته إحدى وسبعون سنة؟ ثم أقبل على رسول الله صلى الله عليه وسلم فقال يا محمد هل مع هذا غيره فقال \"نعم\" قال ما ذاك؟ قال \"المص\" قال هذا أثقل وأطول الألف واحد واللام ثلاثون والميم أربعون والصاد تسعون فهذه إحدى وثلاثون ومائة سنة. هل مع هذا يا محمد غيره؟ قال \"نعم\" قال ما ذاك؟ قال \"الر\" قال هذا أثقل وأطول الألف واحدة واللام ثلاثون والراء مائتان فهذه إحدى وثلاثون ومائتا سنة. فهل مع هذا يا محمد غيره؟ قال \"نعم\" قال ماذا قال \"المر\" قال هذه أثقل وأطول الألف واحدة واللام ثلاثون والميم أربعون والراء مائتان فهذه إحدى وسبعون ومائتان ثم قال: لقد لبس علينا أمرك يا محمد حتى ما ندري أقليلا أعطيت أم كثيرا. ثم قال قوموا عنه ثم قال أبو ياسر لأخيه حي بن أخطب ولمن معه من الأحبار ما يدريكم لعله قد جمع هذا لمحمد كله إحدى وسبعون وإحدى وثلاثون ومائة وإحدى وثلاثون ومائتان وإحدى وسبعون ومائتان فذلك سبعمائة وأربع سنين؟ فقالوا لقد تشابه علينا أمره فيزعمون أن هؤلاء الآيات نزلت فيهم \"هو الذي أنزل عليك الكتاب منه آيات محكمات هن أم الكتاب وأخر متشابهات\" فهذا الحديث مداره على محمد بن السائب الكلبي وهو ممن لا يحتج بما انفرد به ثم كان مقتضى هذا المسلك إن كان صحيحا أن يحسب ما لكل حرف من الحروف الأربعة عشر التي ذكرناها وذلك يبلغ منه جملة كثيرة وإن حسبت مع التكرر فأطم وأعظم والله أعلم."
    },
    {
      "ayah": 10,
      "surah": 15,
      "text": "يقول تعالى مسليا لرسوله صلى الله عليه وسلم فى تكذيب من كذبه من كفل من كفار قريش إنه أرسل قبله من الأمم الماضية وإنه ما أتى أمة من رسول إلا كذبوه واستهزءوا به."
    },
    {
      "ayah": 11,
      "surah": 15,
      "text": "يقول تعالى مسليا لرسوله صلى الله عليه وسلم فى تكذيب من كذبه من كفل من كفار قريش إنه أرسل قبله من الأمم الماضية وإنه ما أتى أمة من رسول إلا كذبوه واستهزءوا به."
    },
    {
      "ayah": 12,
      "surah": 15,
      "text": "ثم أخبر أنه سلك التكذيب في قلوب المجرمين الذين عاندوا واستكبروا عن اتباع الهدى قال أنس والحسن البصري \" كذلك نسلكه فى قلوب المجرمين \" يعني الشرك."
    },
    {
      "ayah": 13,
      "surah": 15,
      "text": "وقوله \" قد خلت سنة الأولين \" أي قد علم ما فعل تعالى بمن كذب رسله من الهلاك والدمار وكيف أنجى الله الأنبياء وأتباعهم في الدنيا والآخرة."
    },
    {
      "ayah": 14,
      "surah": 15,
      "text": "يخبر تعالى عن قوة كفرهم وعنادهم ومكابرتهم للحق أنه لو فتح لهم بابا من السماء فجعلوا يصعدون فيه لما صدقوا بذلك."
    },
    {
      "ayah": 15,
      "surah": 15,
      "text": "بل قالوا \" إنما سكرت أبصارنا \" قال مجاهد وابن كثير والضحاك سدت أبصارنا وقال قتادة عن ابن عباس أخذت أبصارنا وقال العوفي عن ابن عباس شبه علينا وإنما سحرنا وقال الكلبي عميت أبصارنا وقال ابن زيد \" سكرت أبصارنا \" السكران الذي لا يعقل."
    },
    {
      "ayah": 16,
      "surah": 15,
      "text": "يذكر تعالى خلقه السماء في ارتفاعها وما زينها به من الكواكب الثوابت والسيارات لمن تأمل وكرر النظر فيما يرى من العجائب والآيات الباهرات ما يحار نظره فيه وبهذا قال مجاهد وقتادة البروج ههنا هي الكواكب. \" قلت \"وهذا كقوله تبارك وتعالى \" تبارك الذي جعل في السماء بروجا \" الآية. ومنهم من قال البروج هي منازل الشمس والقمر وقال عطية العوفي البروج ههنا هي قصور فيها الحرس وجعل الشهب حرسا لها من مردة الشياطين لئلا يسمعوا إلى الملإ الأعلى فمن تمرد وتقدم منهم لاستراق السمع جاءه شهاب مبين فأتلفه فربما يكون قد ألقى الكلمة التي سمعها أن يدركه الشهاب إلى الذي هو دونه فيأخذها الآخر ويأتي بها إلى وليه كما جاء مصرحا به في الصحيح كما قال البخاري.في تفسير هذه الآية: حدثنا علي بن عبد الله حدثنا سفيان عن عمرو عن عكرمة عن أبي هريرة يبلغ به النبي صلى الله عليه وسلم قال \" إذا قضى الله الأمر في السماء ضربت الملائكة بأجنحتها خضعانا لقوله كأنه سلسلة على صفوان \" قال علي وقال غيره صفوان ينفذهم ذلك فإذا فزع عن قلوبهم قالوا ماذا قال ربكم؟ قالوا للذي قال الحق وهو العلي الكبير فيسمعها مسترقو السمع ومسترقو السمع هكذا واحد فوق آخر ووصف سفيان بيده وفرج بين أصابع يده اليمنى نصبها بعضها فوق بعض فربما أدرك الشهاب المستمع قبل أن يرمي بها إلى صاحبه فيحرقه وربما لم يدركه حتى يرمي بها إلى الذي يليه إلى الذي هو أسفل منه حتى يلقوها إلى الأرض وربما قال سفيان حتى تنتهي إلى الأرض فتلقى على فم الساحر أو الكاهن فيكذب معها مائة كذبة فيصدق فيقولون ألم يخبرنا يوم كذا وكذا يكون كذا وكذا فوجدناه حقا للكلمة التي سمعت من السماء."
    },
    {
      "ayah": 17,
      "surah": 15,
      "text": "وقال عطية العوفي البروج ههنا هي قصور فيها الحرس وجعل الشهب حرسا لها من مردة الشياطين لئلا يسمعوا إلى الملإ الأعلى فمن تمرد وتقدم منهم لاستراق السمع جاءه شهاب مبين فأتلفه فربما يكون قد ألقى الكلمة التي سمعها قبل أن يدركه الشهاب إلى الذي هو دونه فيأخذها الآخر ويأتي بها إلى وليه كما جاء مصرحا به في الصحيح كما قال البخاري.في تفسير هذه الآية: حدثنا علي بن عبد الله حدثنا سفيان عن عمرو عن عكرمة عن أبي هريرة يبلغ به النبي صلى الله عليه وسلم قال \" إذا قضى الله الأمر في السماء ضربت الملائكة بأجنحتها خضعانا لقوله كأنه سلسلة على صفوان \" قال علي وقال غيره صفوان ينفذهم ذلك فإذا فزع عن قلوبهم قالوا ماذا قال ربكم؟ قالوا للذي قال الحق وهو العلي الكبير فيسمعها مسترقو السمع ومسترقو السمع هكذا واحد فوق آخر ووصف سفيان بيده وفرج بين أصابع يده اليمنى نصبها بعضها فوق بعض فربما أدرك الشهاب المستمع قبل أن يرمي بها إلى صاحبه فيحرقه وربما لم يدركه حتى يرمي بها إلى الذي يليه إلى الذي هو أسفل منه حتى يلقوها إلى الأرض وربما قال سفيان حتى تنتهي إلى الأرض فتلقى على فم الساحر أو الكاهن فيكذب معها مائة كذبة فيصدق فيقولون ألم يخبرنا يوم كذا وكذا يكون كذا وكذا فوجدناه حقا للكلمة التي سمعت من السماء."
    },
    {
      "ayah": 18,
      "surah": 15,
      "text": "\" قلت \"وهذا كقوله تبارك وتعالى \" تبارك الذي جعل في السماء بروجا \" الآية. ومنهم من قال البروج هي منازل الشمس والقمر وقال عطية العوفي البروج ههنا هي قصور فيها الحرس وجعل الشهب حرسا لها من مردة الشياطين لئلا يسمعوا إلى الملإ الأعلى فمن تمرد وتقدم منهم لاستراق السمع جاءه شهاب مبين فأتلفه فربما يكون قد ألقى الكلمة التي سمعها أن يدركه الشهاب إلى الذي هو دونه فيأخذها الآخر ويأتي بها إلى وليه كما جاء مصرحا به في الصحيح كما قال البخاري.في تفسير هذه الآية: حدثنا علي بن عبد الله حدثنا سفيان عن عمرو عن عكرمة عن أبي هريرة يبلغ به النبي صلى الله عليه وسلم قال \" إذا قضى الله الأمر في السماء ضربت الملائكة بأجنحتها خضعانا لقوله كأنه سلسلة على صفوان \" قال علي وقال غيره صفوان ينفذهم ذلك فإذا فزع عن قلوبهم قالوا ماذا قال ربكم؟ قالوا للذي قال الحق وهو العلي الكبير فيسمعها مسترقو السمع ومسترقو السمع هكذا واحد فوق آخر ووصف سفيان بيده وفرج بين أصابع يده اليمنى نصبها بعضها فوق بعض فربما أدرك الشهاب المستمع قبل أن يرمي بها إلى صاحبه فيحرقه وربما لم يدركه حتى يرمي بها إلى الذي يليه إلى الذي هو أسفل منه حتى يلقوها إلى الأرض وربما قال سفيان حتى تنتهي إلى الأرض فتلقى على فم الساحر أو الكاهن فيكذب معها مائة كذبة فيصدق فيقولون ألم يخبرنا يوم كذا وكذا يكون كذا وكذا فوجدناه حقا للكلمة التي سمعت من السماء."
    },
    {
      "ayah": 19,
      "surah": 15,
      "text": "ثم ذكر تعالى خلقه الأرض ومده إياها وتوسيعها وبسطها وما جعل فيها من الجبال الرواسي والأودية والأراضي والرمال وما أنبت فيها من الزروع والثمار المتناسبة وقال ابن عباس \" من كل شيء موزون \" أي معلوم وكذا قال سعيد بن جبير وعكرمة وأبو مالك ومجاهد والحكم بن عيينة والحسن بن محمد وأبو صالح وقتادة ومنهم من قول مقدر بقدر وقال ابن زيد من كل شيء يوزن ويقدر بقدر وقال ابن زيد ما يزنه أهل الأسواق."
    },
    {
      "ayah": 2,
      "surah": 15,
      "text": "وقوله تعالى \" ربما يود الذين كفروا \" الآية إخبار عنهم أنهم سيندمون على ما كانوا فيه من الكفر ويتمنون لو كانوا في الدنيا مع المسلمين ونقل السدي في تفسيره بسنده المشهور عن ابن عباس وابن مسعود وغيرهما من الصحابة أن كفار قريش لما عرضوا على النار تمنوا أن لو كانوا مسلمين وقيل إن المراد أن كل كافر يود عند احتضاره أن لو كان مؤمنا وقيل هذا إخبار عن يوم القيامة كقوله تعالى \" ولو ترى إذ وقفوا على النار فقالوا يا ليتنا نرد ولا نكذب بآيات ربنا ونكون من المؤمنين \" وقال سفيان الثوري عن سلمة بن كهيل عن أبي الزاهرية عن عبد الله في قوله \" ربما يود الذين كفروا لو كانوا مسلمين \" قال هذا في الجهنميين إذا رأوهم يخرجون من النار وقال ابن جرير حدثني المثنى حدثنا مسلم حدثنا القاسم حدثنا ابن أبي فروة العبدي أن ابن عباس وأنس بن مالك كانا يتأولان هذه الآية \" ربما يود الذين كفروا لو كانوا مسلمين \" يتأولانها يوم يحبس الله أهل الخطايا من المسلمين مع المشركين في النار قال فيقول لهم المشركون ما أغنى عنكم ما كنتم تعبدون في الدنيا ؟ قال فيغضب الله لهم بفضل رحمته فيخرجهم فذلك حين يقول \" ربما يود الذين كفروا لو كانوا مسلمين \" وقال عبد الرزاق أخبرنا الثوري عن حماد عن إبراهيم وعن خصيف عن مجاهد قالا: يقول أهل النار للموحدين ما أغنى عنكم إيمانكم ؟ فإذا قالوا ذلك قال الله أخرجوا من كان في قلبه مثقال ذرة من إيمان قال فعند ذلك قوله \" ربما يود الذين كفروا لو كانوا مسلمين \" وهكذا روي عن الضحاك وقتادة وأبي العالية وغيرهم وقد ورد في ذلك أحاديث مرفوعة فقال الحافظ أبو القاسم الطبراني حدثنا محمد بن العباس هو الأخرم حدثنا محمد بن منصور الطوسي حدثنا صالح بن إسحق الجهبذي وابن علية يحيى بن موسى حدثنا معروف بن واصل عن يعقوب بن نباتة عن عبد الرحمن الأغر عن أنس بن مالك رضي الله عنه قال: قال رسول الله صلى الله عليه وآله وسلم \" إن ناسا من أهل لا إله إلا الله يدخلون النار بذنوبهم فيقول لهم أهل اللات والعزى ما أغنى عنكم قولكم لا إله إلا الله وأنتم معنا في النار ؟ فيغضب الله لهم فيخرجهم فيلقيهم في نهر الحياة فيبرءون من حرقهم كما يبرأ القمر من خسوفه ويدخلون الجنة ويسمون فيهل الجهنميون \" فقال رجل يا أنس أنت سمعت هذا من رسول الله صلى الله عليه وآله وسلم ؟ فقال إني سمعت رسول الله صلى الله عليه وآله وسلم يقول \" من كذب علي متعمدا فليتبوأ مقعده من النار\" نعم أنا سمعت رسول الله صلى الله عليه وعلى آله وسلم يقول هذا ثم قال الطبراني تفرد به الجهبذ \" الحديث الثاني \"قال الطبراني أيضا حدثنا عبد الله بن أحمد بن حنبل حدثنا أبو الشعثاء علي بن حسن الواسطي حدثنا خالد بن نافع الأشعري عن سعيد بن أبي بردة عن أبيه عن أبي موسى رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم \" إذا اجتمع أهل النار في النار ومعهم من شاء الله من أهل القبلة قال الكفار للمسلمين ألم تكونوا مسلمين ؟ قالوا بلى قالوا فما أغنى عنكم الإسلام وقد صرتم معنا في النار ؟ قالوا كانت لنا ذنوب فأخذنا بها فسمع الله ما قالوا فأمر بمن كان في النار من أهل القبلة فأخرجوا فلما رأى ذلك من بقي من الكفار قالوا يا ليتنا كنا مسلمين فنخرج كما خرجوا قال ثم قرأ رسول الله صلى الله عليه وسلم أعوذ بالله من الشيطان الرجيم \" الر تلك آيات الكتاب وقرآن مبين ربما يود الذين كفروا لو كانوا مسلمين \" ورواه ابن أبي حاتم من حديث خالد بن نافع به وزاد فيه بسم الله الرحمن الرحيم عوض الاستعاذة \" الحديث الثالث \"قال الطبراني أيضا حدثنا موسى بن هارون حدثنا إسحاق بن راهويه قال: قلت لأبي أسامة أحدثكم أبو روق واسمه عطية بن الحارث حدثني صالح بن أبي شريف قال سألت أبا سعيد الخدري فقلت له نعم سمعت رسول الله صلى الله عليه وسلم يقول في هذه الآية \" ربما يود الذين كفروا لو كانوا مسلمين \" ؟ قال نعم سمعته يقول \" يخرج الله ناسا من المؤمنين من النار بعد ما يأخذ نقمته منهم \" وقال \" لما أدخلهم الله النار مع المشركين قال لهم المشركون تزعمون أنكم أولياء الله في الدنيا فما بالكم معنا فى النار ؟ فإذا سمع الله ذلك منهم أذن في الشفاعة لهم فتشفع لهم الملائكة والنبيون ويشفع المؤمنون حتى يخرجوا بإذن الله فإذا رأى المشركون ذلك قالوا يا ليتنا كنا مثلهم فتدركنا الشفاعة فنخرج معهم ; قال فذلك قول الله \" ربما يود الذين كفروا لو كانوا مسلمين \" فيسمون في الجنة الجهنميين من أجل سواد في وجوههم فيقولون يا رب أذهب عنا هذا الاسم فيأمرهم فيغتسلون في نهر الجنة فيذهب ذلك الاسم عنهم \" فأقر به أبو أسامة وقال نعم \" الحديث الرابع \"قال ابن أبي حاتم حدثنا علي بن الحسين حدثنا العباس بن الوليد البرسي حدثنا مسكين أبو فاطمة حدثني اليمان بن يزيد عن محمد بن جبير عن محمد بن علي عن أبيه عن جده قال: قال رسول الله صلى الله عليه وسلم \" منهم من تأخذه النار إلى ركبتيه ومنهم من تأخذه إلى حجزته ومنهم من تأخذه النار إلى عنقه على قدر ذنوبهم وأعمالهم ومنهم من يمكث فيها شهرا ثم يخرج منها ومنهم من يمكث فيها سنة ثم يخرج منها وأطولهم فيها مكثا بقدر الدنيا منذ يوم خلقت إلى أن تفنى فإذا أراد الله أن يخرجهم منها قالت اليهود والنصارى ومن في النار من أهل الأديان والأوثان لمن في النار من أهل التوحيد آمنتم بالله وكتبه ورسله فنحن وأنتم اليوم في النار سواء فيغضب الله لهم غضبا لم يغضبه لشيء فيما مضى فيخرجهم إلى عين في الجنة وهو قوله\" ربما يود الذين كفروا لو كانوا مسلمين \"."
    },
    {
      "ayah": 20,
      "surah": 15,
      "text": "وقوله \" وجعلنا لكم فيها معايش \" يذكر تعالى أنه صرفهم في الأرض فى صنوف الأسباب والمعايش وهي جمع معيشة وقوله \" ومن لستم له برازقين \" قال مجاهد هي الدواب والأنعام وقال ابن جرير هم العبيد والإماء والدواب والأنعام والقصد أنه تعالى يمتن عليهم بما يسر لهم من أسباب المكاسب ووجوه الأسباب وصنوف المعايش وبما سخر لهم من الدواب التي يركبونها والأنعام التي يأكلونها والعبيد والإماء التي يستخدمونها ورزقهم على خالقهم لا عليهم فلهم هم المنفعة والرزق على الله تعالى."
    },
    {
      "ayah": 21,
      "surah": 15,
      "text": "يخبر تعالى أنه مالك كل شيء وأن كل شيء سهل عليه يسير لديه وأن عنده خزائن الأشياء من جميع الصنوف \" وما ننزله إلا بقدر معلوم \" كما يشاء كما يريد ولما له فى ذلك من الحكمة البالغة والرحمة بعباده لا على جهة الوجوب بل هو كتب على نفسه الرحمة. قال يزيد بن أبي زياد عن أبي جحيفة عن عبد الله ما من عام بأمطر من عام ولكن الله يقسمه بينهم حيث شاء عاما ههنا وعاما ههنا ثم قرأ \" وإن من شيء إلا عندنا خزائنه \" الآية. رواه ابن جرير وقال أيضا حدثنا القاسم حدثنا هشيم أخبرنا إسماعيل بن سالم عن الحكم بن عيينة في قوله \" وما ننزله إلا بقدر معلوم \" قال ما عام بأكثر مطرا من عام ولا أقل ولكنه يمطر قوم ويحرم آخرون بما كان في البحر قال وبلغنا أنه ينزل مع المطر من الملائكة أكثر من عدد ولد إبليس وولد آدم يحصون كل قطرة حيث تقع وما تنبت وقال البزار حدثنا داود هو ابن بكير حدثنا حيان بن أغلب بن تميم حدثني أبي عن هشام عن محمد بن سيرين عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم \" خزائن الله الكلام فإذا أراد شيئا قال له كن فكان \" ثم قال لا يرويه إلا أغلب وليس بالقوى وقد حدث عنه غير واحد من المقدمين ولم يروه عنه إلا ابنه."
    },
    {
      "ayah": 22,
      "surah": 15,
      "text": "وقوله تعالى \" وأرسلنا الرياح لواقح \" أي تلقح السحاب فتدر ماء وتلقح الشجر فتفتح عن أوراقها وأكمامها وذكرها بصيغة الجمع ليكون منها الإنتاج بخلاف الريح العقيم فإنه أفردها ووصفها بالعقيم وهو عدم الإنتاج لأنه لا يكون إلا بين شيئين فصاعدا وقال الأعمش عن المنهال بن عمرو عن قيس بن السكن عن عبد الله بن مسعود في قوله \" وأرسلنا الرياح لواقح \" قال ترسل الريح فتحمل الماء من السماء ثم تمر مر السحاب حتى تدر كما تدر اللقحة. وكذا قال ابن عباس وإبراهيم النخعي وقتادة وقال الضحاك يبعثها الله على السحاب فتلقحه فيمتلئ ماء وقال عبيد بن عمير الليثي يبعث الله المبشرة فتقم الأرض قما ثم بعث الله المثيرة فتثير السحاب ثم يبعث الله المؤلفة فتؤلف السحاب ثم يبعث الله اللواقح فتلقح الشجر ثم تلا \" وأرسلنا الرياح لواقح \".وقد روى ابن جرير من حديث عبيس بن ميمون عن أبي المهزم عن أبي هريرة عن النبي صلى الله عليه وسلم قال \" الريح الجنوب من الجنة وهي التي ذكر الله في كتابه وفيها منافع للناس \" وهذا إسناد ضعيف وقال الإمام أبو بكر عبد الله بن الزبير الحميدي في مسنده حدثنا سفيان حدثنا عمرو بن دينار أخبرني يزيد بن جعدية الليثي أنه سمع عبد الرحمن بن مخراق يحدث عن أبي ذر قال: قال رسول الله صلى الله عليه وسلم \" إن الله خلق في الجنة ريحا بعد الريح سبع سنين وإن من دونها بابا مغلقا وإنما يأتيكم الريح من ذلك الباب ولو فتح لأذرت ما بين السماء والأرض من شيء وهي عند الله إلا ذيب وهي فيكم الجنوب \" وقوله \" فأسقيناكموه \" أي أنزلناه لكم عذبا يمكنكم أن تشربوا منه لو نشاء جعلناه أجاجا كما نبه على ذلك في الآية الأخرى في سورة الواقعة وهو قوله تعالى \" أفرأيتم الماء الذي تشربون أأنتم أنزلتموه من المزن أم نحن المنزلون لو نشاء جعلناه أجاجا فلولا تشكرون \" وفي قوله \" هو الذي أنزل من السماء ماء لكم منه شراب ومنه شجر فيه تسيمون \" وقوله \" وما أنتم له بخازنين \" فال سفيان الثوري بمانعين ويحتمل أن المراد وما أنتم له بحافظين بل نحن ننزله ونحفظه عليكم ونجعله معينا وينابيع في الأرض ولو شاء تعالى لأغاره وذهب به ولكن من رحمته أنزله وجعله عذبا وحفظه في العيون والآبار والأنهار وغير ذلك ليبقى لهم في طول السنة يشربون ويسقون أنعامهم وزروعهم وثمارهم."
    },
    {
      "ayah": 23,
      "surah": 15,
      "text": "وقوله \" وإنا لنحن نحيي ونميت \" إخبار عن قدرته تعالى على بدء الخلق وإعادته وأنه هو الذي أحيا الخلق من العدم ثم يميتهم ثم يبعثهم كلهم ليوم الجمع وأخبر أنه تعالى يرث الأرض ومن عليها وإليه يرجعون."
    },
    {
      "ayah": 24,
      "surah": 15,
      "text": "ثم أخبر تعالى عن تمام علمه بهم أولهم وآخرهم فقال \" ولقد علمنا المستقدمين منكم \" الآية. قال ابن عباس رضي الله عنهما المستقدمون كل من هلك من لدن آدم عليه السلام والمستأخرون من هو حي ومن سيأتي إلى يوم القيامة وروي نحوه عن عكرمة ومجاهد والضحاك وقتادة ومحمد بن كعب والشعبي وغيرهم وهو اختيار ابن جرير رحمه الله وقال ابن جرير حدثنا محمد بن عبد الأعلى حدثنا المعتمر بن سليمان عن أبيه عن رجل عن مروان بن الحكم أنه قال كان أناس يستأخرون في الصفوف من أجل النساء فأنزل الله \" ولقد علمنا المستقدمين منكم ولقد علمنا المستأخرين \" وقد ورد فيه حديث غريب جدا فقال ابن جرير حدثني محمد بن موسى الجرشي حدثنا نوح بن قيس حدثنا عمرو بن قيس حدثنا عمر بن مالك عن أبي الجوزاء عن ابن عباس رضي الله عنهما قال كانت تصلي خلف النبي صلى الله عليه وسلم امرأة حسناء قال ابن عباس لا والله ما رأيت مثلها قط وكان بعض المسلمين إذا صلوا استقدموا يعني لئلا يروها وبعض يستأخرون; فإذا سجدوا نظروا إليها من تحت أيديهم فأنزل الله \" ولقد علمنا المستقدمين منكم ولقد علمنا المستأخرين \" وكذا رواه أحمد وابن أبي حاتم في تفسيره ورواه الترمذي والنسائي في كتاب التفسير من سننيهما وابن ماجه من طرق عن نوح بن قيس الحداني وقد وثقه أحمد وأبو داود وغيرهما وحكي عن ابن معين تضعيفه وأخرجه مسلم وأهل السنن وهذا الحديث فيه نكارة شديدة وقد رواه عبد الرزاق عن جعفر بن سليمان عن عمرو بن مالك وهو البكري أنه سمع أبا الجوزاء يقول في قوله \" ولقد علمنا المستقدمين منكم \" في الصفوف في الصلاة \" والمستأخرين \" فالظاهر أنه من كلام أبي الجوزاء فقط ليس فيه لابن عباس ذكر وقد قال الترمذي هذا أشبه من رواية نوح بن قيس والله أعلم وهكذا روى ابن جرير عن محمد بن أبي معشر عن أبيه أنه سمع عون بن عبد الله يذكر محمد بن كعب في قوله \" ولقد علمنا المستقدمين منكم ولقد علمنا المستأخرين \" أنها في صفوف الصلاة فقال محمد بن عبد الله يذكر محمد بن كعب في قوله \" ولقد علمنا المستقدمين منكم ولقد علمنا المستأخرين \" أنها في صفوف الصلاة فقال محمد بن كعب ليس هكذا \" ولقد علمنا المستقدمين منكم \" الميت والمقتول \" والمستأخرين \" من يخلق بعد \" وإن ربك هو يحشرهم إنه حكيم عليم \" فقال عون بن عبد الله وفقك الله وجزاك خيرا."
    },
    {
      "ayah": 25,
      "surah": 15,
      "text": "\" وإن ربك هو يحشرهم إنه حكيم عليم \" فقال عون بن عبد الله وفقك الله وجزاك خيرا."
    },
    {
      "ayah": 26,
      "surah": 15,
      "text": "قال ابن عباس ومجاهد وقتادة: المراد بالصلصال ههنا التراب اليابس والظاهر أنه كقوله تعالى \" خلق الإنسان من صلصال كالفخار وخلق الجان من مارج من نار \" وعن مجاهد أيضا \" الصلصال \" المنتن وتفسير الآية بالآية أولى وقوله \" من حمإ مسنون \" أي الصلصال من حمإ وهو الطين والمسنون الأملس كما قال الشاعر: ثم خاصرتها إلى القبة الخض راء تمشي في مرمر مسنون أي أملس صقيل ولهذا روي عن ابن عباس أنه قال هو التراب الرطب وعن ابن عباس ومجاهد أيضا والضحاك إن الحمأ المسنون هو المنتن وقيل المراد بالمسنون ههنا المصبوب."
    },
    {
      "ayah": 27,
      "surah": 15,
      "text": "وقوله \" والجان خلقناه من قبل \" أي من قبل الإنسان \" من نار السموم \" قال ابن عباس هي السموم التي تقتل وقال بعضهم السموم بالليل والنهار ومنهم من يقول السموم بالليل والحرور بالنهار; وقال أبو داود الطيالسي حدثنا شعبة عن أبي إسحق قال دخلت على عمر الأعصم أعوده فقال ألا أحدثك حديثا سمعته من عبد الله بن مسعود يقول هذه السموم جزء من سبعين جزءا من السموم التي خلق منها الجان ثم قرأ \" والجان خلقناه من قبل من نار السموم \" وعن ابن عباس إن الجان خلق من لهب النار وفي رواية من أحسن النار وعن عمرو بن دينار من نار الشمس وقد ورد في الصحيح \" خلقت الملائكة من نور وخلقت الجان من مارج من نار وخلق آدم مما وصف لكم \" والمقصود من الآية التنبيه على شرف آدم \" وطيب عنصره وطهارة محتده."
    },
    {
      "ayah": 28,
      "surah": 15,
      "text": "يذكر تعالى تنويهه بذكر آدم في ملائكته قبل خلقه له وتشريفه إياه بأمر الملائكة بالسجود له ويذكر تخلف إبليس عدوه عن السجود له من بين سائر الملائكة حسدا وكفرا وعنادا واستكبارا وافتخارا بالباطل ولهذا قال \" لم أكن لأسجد لبشر خلقته من صلصال من حمإ مسنون \" كقوله \" أنا خير منه خلقتني من نار وخلقته من طين \" وقوله \" أرأيتك هذا الذي كرمت علي \" الآية."
    },
    {
      "ayah": 29,
      "surah": 15,
      "text": "وقد روى ابن جرير ههنا أثرا غريبا عجيبا من حديث شبيب بن بشر عن عكرمة عن ابن عباس قال لما خلق الله الملائكة قال \" إنى خالق بشرا من طين فإذا سويته ونفخت فيه من روحي فقعوا له ساجدين \" قالوا لا نفعل فأرسل عليهم نارا فأحرقتهم; ثم خلق ملائكة أخرى فقال لهم مثل ذلك فقالوا سمعنا وأطعنا إلا إبليس كان من الكافرين الأولين وفي ثبوت هذا عنه بعد والظاهر أنه إسرائيلي والله أعلم."
    },
    {
      "ayah": 3,
      "surah": 15,
      "text": "وقوله \" ذرهم يأكلوا ويتمتعوا \" تهديد شديد لهم ووعيد أكيد كقوله تعالى \" قل تمتعوا فإن مصيركم إلى النار \" وقوله \" كلوا وتمتعوا قليلا إنكم مجرمون \" ولهذا قال \" ويلههم الأمل \" أي عن التوبة والإنابة \" فسوف يعلمون \" أي عاقبة أمرهم."
    },
    {
      "ayah": 30,
      "surah": 15,
      "text": "وقد روى ابن جرير ههنا أثرا غريبا عجيبا من حديث شبيب بن بشر عن عكرمة عن ابن عباس قال لما خلق الله الملائكة قال \" إنى خالق بشرا من طين فإذا سويته ونفخت فيه من روحي فقعوا له ساجدين \" قالوا لا نفعل فأرسل عليهم نارا فأحرقتهم; ثم خلق ملائكة أخرى فقال لهم مثل ذلك فقالوا سمعنا وأطعنا إلا إبليس كان من الكافرين الأولين وفي ثبوت هذا عنه بعد والظاهر أنه إسرائيلي والله أعلم."
    },
    {
      "ayah": 31,
      "surah": 15,
      "text": "وقد روى ابن جرير ههنا أثرا غريبا عجيبا من حديث شبيب بن بشر عن عكرمة عن ابن عباس قال لما خلق الله الملائكة قال \" إنى خالق بشرا من طين فإذا سويته ونفخت فيه من روحي فقعوا له ساجدين \" قالوا لا نفعل فأرسل عليهم نارا فأحرقتهم; ثم خلق ملائكة أخرى فقال لهم مثل ذلك فقالوا سمعنا وأطعنا إلا إبليس كان من الكافرين الأولين وفي ثبوت هذا عنه بعد والظاهر أنه إسرائيلي والله أعلم."
    },
    {
      "ayah": 32,
      "surah": 15,
      "text": "وقد روى ابن جرير ههنا أثرا غريبا عجيبا من حديث شبيب بن بشر عن عكرمة عن ابن عباس قال لما خلق الله الملائكة قال \" إنى خالق بشرا من طين فإذا سويته ونفخت فيه من روحي فقعوا له ساجدين \" قالوا لا نفعل فأرسل عليهم نارا فأحرقتهم; ثم خلق ملائكة أخرى فقال لهم مثل ذلك فقالوا سمعنا وأطعنا إلا إبليس كان من الكافرين الأولين وفي ثبوت هذا عنه بعد والظاهر أنه إسرائيلي والله أعلم."
    },
    {
      "ayah": 33,
      "surah": 15,
      "text": "وقد روى ابن جرير ههنا أثرا غريبا عجيبا من حديث شبيب بن بشر عن عكرمة عن ابن عباس قال لما خلق الله الملائكة قال \" إنى خالق بشرا من طين فإذا سويته ونفخت فيه من روحي فقعوا له ساجدين \" قالوا لا نفعل فأرسل عليهم نارا فأحرقتهم; ثم خلق ملائكة أخرى فقال لهم مثل ذلك فقالوا سمعنا وأطعنا إلا إبليس كان من الكافرين الأولين وفي ثبوت هذا عنه بعد والظاهر أنه إسرائيلي والله أعلم."
    },
    {
      "ayah": 34,
      "surah": 15,
      "text": "يذكر تعالى أنه أمر إبليس أمرا كونيا لا يخالف ولا يمانع بالخروج من المنزلة التي كان فيها من الملإ الأعلى وأنه رجيم أي مرجوم وأنه قد اتبعته لعنة لا تزال متصلة به لاحقة له متواترة عليه إلى يوم القيامة."
    },
    {
      "ayah": 35,
      "surah": 15,
      "text": "يذكر تعالى أنه أمر إبليس أمرا كونيا لا يخالف ولا يمانع بالخروج من المنزلة التي كان فيها من الملأ الأعلى وأنه رجيم أي مرجوم وأنه قد اتبعته لعنة لا تزال متصلة به لاحقة له متواترة عليه إلى يوم القيامة."
    },
    {
      "ayah": 36,
      "surah": 15,
      "text": "وعن سعيد بن جبير أنه قال: لما لعن الله إبليس تغيرت صورته عن صورة الملائكة ورن رنة فكل رنة في الدنيا إلى يوم القيامة منها. رواه ابن أبي حاتم وأنه لما تحقق الغضب الذي لا مرد له سأل من تمام حسده لآدم وذريته النظِرة إلى يوم القيامة وهو يوم البعث."
    },
    { "ayah": 37, "surah": 15, "text": "وأنه أجيب إلى ذلك استدراجا له وإمهالا." },
    { "ayah": 38, "surah": 15, "text": "فلما تحقق النظرة قبحه الله." },
    {
      "ayah": 39,
      "surah": 15,
      "text": "يقول تعالى مخبرا عن إبليس وتمرده وعتوه أنه قال للرب \" بما أغويتني \" قال بعضهم أقسم بإغواء الله له \" قلت \" ويحتمل أنه بسبب ما أغويتني وأضللتني \" لأزينن لهم \" أي لذرية آدم عليه السلام \" فى الأرض \" أي أحبب إليهم المعاصي وأرغبهم فيها وأزهم إليها وأزعجهم إزعاجا \" ولأغوينهم أجمعين \" أي كما أغويتني وقدرت على ذلك."
    },
    { "ayah": 4, "surah": 15, "text": "يخبر تعالى أنه ما أهلك قرية إلا بعد قيام الحجة عليها وانتهاء أجلها." },
    {
      "ayah": 40,
      "surah": 15,
      "text": "إلا عبادك منهم المخلصين \" كقوله \" أرأيتك هذا الذي كرمت علي لئن أخرتن إلى يوم القيامة لأحتنكن ذريته إلا قليلا \" \" قال \"الله تعالى له متهددا ومتوعدا."
    },
    {
      "ayah": 41,
      "surah": 15,
      "text": "هذا صراط علي مستقيم \" أي مرجعكم كلكم إلي فأجازيكم بأعمالكم إن خيرا فخير وإن شرا فشر كقوله تعالى \" إن ربك لبالمرصاد \" وقيل طريق الحق مرجعها إلى الله تعالى وإليه تنتهي قاله مجاهد والحسن وقتادة كقوله \" وعلى الله قصد السبيل \" وقرأ قيس بن عبادة ومحمد بن سيرين وقتادة \" هذا صراط علي مستقيم \" كقوله \" وإنه في أم الكتاب لدينا لعلي حكيم \" أي رفيع والمشهور القراءة الأولى."
    },
    {
      "ayah": 42,
      "surah": 15,
      "text": "وقوله \" إن عبادي ليس لك عليهم سلطان \" أي الذين قدرت لهم الهداية فلا سبيل لك عليهم ولا وصول لك إليهم \" إلا من اتبعك من الغاوين \" استثناء منقطع. وقد أورد ابن جرير ههنا من حديث عبد الله بن المبارك عن عبد الله بن موهب حدثنا يزيد بن قسيط قال: كانت الأنبياء يكون لهم مساجد خارجة من قراهم فإذا أراد النبي أن يستنبئ ربه عن شيء خرج إلى مسجده فصلى ما كتب الله ثم سأله ما بدا له فبينا نبي في مسجده إذ جاء عدو الله - يعني إبليس - حتى جلس بينه وبين القبلة فقال النبي أعوذ بالله من الشيطان الرجيم قال فرده ذلك ثلاث مرات فقال عدو الله أخبرني بأي شيء تنجو مني فقال النبي بل أخبرني بأي شيء تغلب ابن آدم مرتين فأخذ كل واحد منهما على صاحبه فقال النبي أعوذ بالله من الشيطان الرجيم فقال عدو الله أرأيت الذي تعوذ منه فهو هو فقال النبي أعوذ بالله من الشيطان الرجيم قال فرده ذلك ثلاث مرات فقال عدو الله أخبرني بأي شيء تنجو مني فقال النبي بل أخبرني بأي شيء تغلب ابن آدم مرتين فأخذ كل واحد منهما على صاحبه فقال النبي إن الله تعالى يقول \" إن عبادي ليس لك عليهم سلطان إلا من اتبعك من الغاوين \" قال عدو الله قد سمعت هذا قبل أن تولد قال النبي ويقول الله \" وإما ينزغنك من الشيطان نزغ فاستعذ بالله إنه سميع عليم \" وإني والله ما أحسست بك قط إلا استعذت بالله منك قال عدو الله صدق بهذا تنجو مني فقال النبي أخبرني بأي شيء تغلب ابن آدم؟ قال آخذه عند الغضب والهوى."
    },
    {
      "ayah": 43,
      "surah": 15,
      "text": "وقوله \" وإن جهنم لموعدهم أجمعين أي جهنم موعد جميع من اتبع إبليس كما قال عن القرآن \" ومن يكفر به من الأحزاب فالنار موعده."
    },
    {
      "ayah": 44,
      "surah": 15,
      "text": "ثم أخبر أن لجهنم سبعة أبواب \" لكل باب منهم جزء مقسوم \" أي قد كتب لكل باب منها جزء من أتباع إبليس يدخلونه لا محيد لهم عنه أجارنا الله منه وكل يدخل من باب بحسب عمله ويستقر في درك بقدر عمله قال إسماعيل ابن علية وشعبة كلاهما عن أبي هارون الغنوي عن حطان بن عبد الله أنه قال سمعت علي بن أبي طالب وهو يخطب قال: إن أبواب جهنم هكذا - قال أبو هارون - أطباقا بعضها فوق بعض وقال إسرائيل عن أبي إسحاق عن هبيرة بن أبي مريم عن علي رضي الله عنه قال أبواب جهنم سبعة بعضها فوق بعض فيمتلئ الأول ثم الثاني ثم الثالث حتى تمتلئ كلها وقال عكرمة سبعة أبواب سبعة أطباق وقال ابن جريج سبعة أبواب أولها جهنم ثم لظى ثم الحطمة ثم السعير ثم سقر ثم الجحيم ثم الهاوية. وروي الضحاك عن ابن عباس نحوه وكذا روي عن الأعمش بنحوه أيضا وفال قتادة \" لها سبعة أبواب لكل باب منهم جزء مقسوم \" هي والله منازل بأعمالهم رواهن ابن جرير وقال جويبر عن الضحاك \" لها سبعة أبواب لكل باب منهم جزء مقسوم \" قال باب لليهود وباب للنصارى وباب للصابئين وباب للمجوس وباب للذين أشركوا وهم كفار العرب وباب للمنافقين وباب لأهل التوحيد فأهل التوحيد يرجى لهم ولا يرجى لأولئك أبدا. وقال الترمذي حدثنا عبد بن حميد حدثنا عثمان بن عمر عن مالك بن مغول عن حميد عن ابن عمر عن النبي صلى الله عليه وسلم قال \" لجهنم سبعة أبواب باب منها لمن سل السيف على أمتي - أو قال - على أمة محمد \" ثم قال لا نعرفه إلا من حديث مالك بن مغول. وقال ابن أبي حاتم حدثنا أبي حدثنا عباس بن الوليد الخلال حدثنا زيد - يعني ابن يحيى - حدثنا سعيد بن بشير عن قتادة عن أبي نضرة عن سمرة بن جندب عن النبي صلى الله عليه وسلم في قوله \" لكل باب منهم جزء مقسوم \" قال \" إن من أهل النار من تأخذه النار إلى كعبه وإن منهم من تأخذه النار إلى حجزته ومنهم من تأخذه النار إلى تراقيه منازلهم بأعمالهم فذلك قوله لكل باب منهم جزء مقسوم \"."
    },
    { "ayah": 45, "surah": 15, "text": "لما ذكر تعالى حال أهل النار عطف على ذكر أصل الجنة وأنهم في جنات وعيون." },
    {
      "ayah": 46,
      "surah": 15,
      "text": "وقوله \" ادخلوها بسلام \" أي سالمين من الآفات مسلم عليكم \" آمنين \" أي من كل خوف وفزع ولا تخشوا من إخراج ولا انقطاع ولا فناء."
    },
    {
      "ayah": 47,
      "surah": 15,
      "text": "وقوله\" ونزعنا ما في صدورهم من غل إخوانا على سرر متقابلين \" روى القاسم عن أبي أمامة قال: يدخل أهل الجنة الجنة على ما في صدورهم في الدنيا من الشحناء والضغائن حتى إذا توافوا وتقابلوا نزع الله ما في صدورهم في الدنيا من غل ثم قرأ \" ونزعنا ما في صدورهم من غل \" هكذا في هذه الرواية والقاسم بن عبد الرحمن في روايته عن أبي أمامة ضعيف وقد روى سعيد في تفسيره حدثنا ابن فضالة عن لقمان عن أبي أمامة قال: لا يدخل الجنة مؤمن حتى ينزع الله ما في صدره من غل حتى ينزع منه مثل السبع الضاري. وهذا موافق لما في الصحيح من رواية قتادة حدثنا أبو المتوكل الناجي أن أبا سعيد الخدري حدثهم أن رسول الله صلى الله عليه وسلم قال \" يخلص المؤمنون من النار فيحبسون على قنطرة بين الجنة والنار يقتص لبعضهم من بعض مظالم كانت بينهم في الدنيا حتى إذا هذبوا ونقوا أذن لهم في دخول الجنة \" وقال ابن جرير حدثنا الحسن حدثنا يزيد بن هارون أخبرنا هشام عن محمد هو ابن سيرين قال استأذن الأشتر على علي رضي الله عنه وعنده ابن لطلحة فحبسه ثم أذن له فلما دخل قال إني لأراك إنما حبستني لهذا؟ قال أجل قال إني لأراه لو كان عندك ابن لعثمان لحبستني قال أجل إني لأرجو أن أكون أنا عثمان ممن قال الله تعالى \" ونزعنا ما في صدورهم من غل إخوانا على سرر متقابلين \" وقال ابن جرير أيضا حدثنا الحسن بن محمد حدثنا أبو معاوية الضرير حدثنا أبو مالك الأشجعي حدثنا أبو حبيبة مولى لطلحة قال: دخل عمران بن طلحة على علي رضي الله عنه بعد ما فرغ من أصحاب الجمل فرحب به وقال: إني لأرجو أن يجعلني الله وأباك من الذين قال الله \" ونزعنا ما في صدورهم من غل إخوانا على سرر متقابلين \" وحدثنا الحسن حدثنا أبو معاوية الضرير حدثنا أبو مالك الأشجعي عن أبي حبيبة مولى لطلحة قال: دخل عمران بن طلحة على علي رضي الله عنه بعد ما فرغ من أصحاب الجمل فرحب به وقال: إني لأرجو أن يجعلني الله وأباك من الذين قال الله \" ونزعنا ما في صدورهم من غل إخوانا على سرر متقابلين \" قال ورجلان جالسان إلى ناحية البساط فقالا الله أعدل من ذلك تقتلهم بالأمس وتكونون إخوانا فقال علي رضي الله عنه أبعد أرض وأسحقها فمن هم إذا إن لم أكن أنا وطلحة؟ وذكر أبو معاوية الحديث بطوله. وروى وكيع عن أبان بن عبد الله البجلي عن نعيم بن أبي هند عن ربعي بن خراش عن علي نحوه وقال فيه فقام رجل من همدان فقال الله أعدل من ذلك يا أمير المؤمنين قال فصاح به علي صيحة فظننت أن القصر قد تدهده لها ثم قال إذا لم نكن نحن فمن هم؟ وقال سعيد بن مسروق عن أبي طلحة وذكره وفيه فقال الحارث الأعور ذلك فقام إليه علي رضي الله عنه فضربه بشيء كان في يده في رأسه وقال فمن هم يا أعور إذا لم نكن نحن؟ وقال سفيان الثوري عن منصور عن إبراهيم قال: جاء ابن جرموز قاتل الزبير يستأذن على علي رضي الله عنه فحجبه طويلا ثم أذن له فقال له أما أهل البلاء فتجفوهم فقال علي بفيك التراب إني لأرجو أن أكون أنا وطلحة والزبير ممن قال الله \" ونزعنا ما في صدورهم من غل إخوانا على سرر متقابلين \" وكذا روى الثوري عن جعفر بن محمد عن أبيه عن علي بنحوه وقال سفيان بن عيينة عن إسرائيل عن أبي موسى سمع الحسن البصري يقول: قال علي فينا والله أهل بدر نزلت هذه الآية \" ونزعنا ما في صدورهم من غل إخوانا على سرر متقابلين \" وقال كثير النوى: دخلت على أبي جعفر محمد بن علي فقلت وليي وليكم وسلمي سلمكم وعدوي عدوكم وحربي حربكم أنا أسألك بالله أتبرأ من أبي بكر وعمر فقال \" قد ضللت إذا وما أنا من المهتدين \" تولهما يا كثير فما أدركك فهو فى رقبتي هذه ثم تلا هذه الآية \" إخوانا على سرر متقابلين \" قال أبو بكر وعمر وعلي رضى الله عنهم أجمعين وقال الثوري عن رجل عن أبي صالح في قوله \" إخوانا على سرر متقابلين \" قال هم عشرة أبو بكر وعمر وعثمان وعلي وطلحة والزبير وعبد الرحمن بن عوف وسعد بن أبي وقاص وسعيد بن زيد وعبد الله بن مسعود رضى الله عنهم أجمعين وقوله \" متقابلين \" قال مجاهد لا ينظر بعضهم فى قفا بعض وفيه حديث مرفوع. قال ابن أبي حاتم حدثنا يحيى بن عبد الله ثنا حسان بن حسان ثنا إبراهيم بن بشر ثنا يحيى بن معين عن إبراهيم القومسي عن سعيد بن شرحبيل عن زيد بن أبي أوفى قال: خرج علينا رسول الله صلى الله عليه وسلم فتلا هذه الآية \" إخوانا على سرر متقابلين \" في الله ينظر بعضهم إلى بعض."
    },
    {
      "ayah": 48,
      "surah": 15,
      "text": "وقوله لا يمسهم فيها نصب \" يعني المشقة والأذى كما جاء في الصحيحين \" إن الله أمرني أن أبشر خديجة ببيت في الجنة من قصب لا صخب فيه ولا نصب \". وقوله \" وما هم منها بمخرجين \" كما جاء في الحديث \" يقال يا أهل الجنة إن لكم أن تصحوا فلا تمرضوا أبدا وإن لكم أن تعيشوا فلا تموتوا أبدا وإن لكم أن تشبوا فلا تهرموا أبدا وإن لكم أن تقيموا فلا تظعنوا أبدا \". وقال الله تعالى \" خالدين فيها لا يبغون عنها حولا \"."
    },
    {
      "ayah": 49,
      "surah": 15,
      "text": "وقوله \"نبئ عبادي أني أنا الغفور الرحيم وأن عذابي هو العذاب الأليم\" أي أخبر يا محمد عبادي أنى ذو رحمة وذو عذاب أليم وقد تقدم ذكر نظير هذه الآية الكريمة وهي دالة على مقامي الرجاء والخوف وذكر في سبب نزولها ما رواه موسى بن عبيدة عن مصعب بن ثابت قال مر رسول الله صلى الله عليه وسلم على ناس من أصحابه يضحكون فقال \"اذكروا الجنة واذكروا النار\" فنزلت \"نبئ عبادي أني أنا الغفور الرحيم وأن عذابي هو العذاب الأليم\". رواه ابن أبي حاتم وهو مرسل وقال ابن جرير حدثني المثنى حدثنا إسحاق أخبرنا ابن المكي أخبرنا ابن المبارك أخبرنا مصعب بن ثابت حدثنا عاصم بن عبيد الله عن ابن أبي رباح عن رجل من أصحاب النبي صلى الله عليه وسلم قال: طلع علينا رسول الله صلى الله عليه وسلم من الباب الذي يدخل منه بنو شيبة فقال \" ألا أراكم تضحكون \" ثم أدبر حتى إذا كان عند الحجر رجع إلينا القهقري فقال \" إني لما خرجت جاء جبريل عليه السلام فقال يا محمد إن الله يقول لك لم تقنط عبادي \" نبئ عبادي أني أنا الغفور الرحيم وأن عذابي هو العذاب الأليم \" \" وقال شعبة عن قتادة في قوله \"نبئ عبادي أني أنا الغفور الرحيم\" قال بلغنا أن رسول الله صلى الله عليه وسلم قال \"لو يعلم العبد قدر عفو الله لما تورع من حرام ولو يعلم العبد قدر عذاب الله لبخع نفسه\"."
    },
    {
      "ayah": 5,
      "surah": 15,
      "text": "وأنه لا يؤخر أمة حان هلاكهم عن ميقاتهم ولا يتقدمون عن مدتهم وهذا تنبيه لأهل مكة وإرشاد لهم إلى الإقلاع عما هم عليه من الشرك والعناد والإلحاد الذي يستحقون به الهلاك."
    },
    {
      "ayah": 50,
      "surah": 15,
      "text": "أي أخبر يا محمد عبادي أنى ذو رحمة وذو عذاب أليم وقد تقدم ذكر نظير هذه الآية الكريمة وهي دالة على مقامي الرجاء والخوف."
    },
    {
      "ayah": 51,
      "surah": 15,
      "text": "يقول تعالى وأخبرهم يا محمد عن قصة ضيف إبراهيم والضيف يطلق على الواحد والجمع كالزور والسفر."
    },
    {
      "ayah": 52,
      "surah": 15,
      "text": "وكيف دخلوا عليه فقالوا سلاما \" قال إنا منكم وجلون \" أي خائفون وقد ذكر سبب خوفه منهم لما رأى أيديهم لا تصل إلى ما قربه إليهم من الضيافة وهو العجل السمين الحنيذ."
    },
    {
      "ayah": 53,
      "surah": 15,
      "text": "\" قالوا لا توجل \" أي لا تخف وبشروه \" بغلام عليم \" أى إسحاق \" كما تقدم في سورة هود."
    },
    {
      "ayah": 54,
      "surah": 15,
      "text": "ثم \" قال \"متعجبا من كبره وكبر زوجته ومتحققا للوعد \" أبشرتموني على أن مسني الكبر فبم تبشرون \" فأجابوه مؤكدين لما بشروه به تحقيقا وبشارة بعد بشارة."
    },
    { "ayah": 55, "surah": 15, "text": "\" قالوا بشرناك بالحق فلا تكن من القانطين \" وقرأ بعضهم القنطين." },
    {
      "ayah": 56,
      "surah": 15,
      "text": "فأجابهم بأنه ليس يقنط ولكن يرجو من الله الولد وإن كان قد كبر وأسنت امرأته فإنه يعلم من قدرة الله ورحمته ما هو أبلغ من ذلك."
    },
    {
      "ayah": 57,
      "surah": 15,
      "text": "يقول تعالى إخبارا عن إبراهيم عليه السلام لما ذهب عنه الروع وجاءته البشرى أنه شرع يسألهم عما جاءوا له."
    },
    { "ayah": 58, "surah": 15, "text": "فقالوا إنا أرسلنا إلى قوم مجرمين \" يعنون قوم لوط." },
    { "ayah": 59, "surah": 15, "text": "وأخبروه أنهم سينجون آل لوط من بينهم." },
    {
      "ayah": 6,
      "surah": 15,
      "text": "يخبر تعالى عن كفرهم وعنادهم في قولهم \" يا أيها الذي نزل عليه الذكر \" أي الذي تدعي ذلك \" إنك لمجنون \" أي في دعائك إيانا إلى اتباعك وترك ما وجدنا عليه آباءنا."
    },
    {
      "ayah": 60,
      "surah": 15,
      "text": "إلا امرأته فإنها من الهالكين ولهذا قالوا \" إلا امرأته قدرنا إنها لمن الغابرين \" أي الباقين المهلكين."
    },
    {
      "ayah": 61,
      "surah": 15,
      "text": "يخبر تعالى عن لوط لما جاءته الملائكة في صورة شباب حسان الوجوه فدخلوا عليه داره."
    },
    { "ayah": 62, "surah": 15, "text": "قال إنكم قوم منكرون." },
    {
      "ayah": 63,
      "surah": 15,
      "text": "\"قالوا بل جئناك بما كانوا فيه يمترون\" يعنون بعذابهم وهلاكهم ودمارهم الذي كانوا يشكون في وقوعه بهم وحلوله بساحتهم."
    },
    {
      "ayah": 64,
      "surah": 15,
      "text": "\"وأتيناك بالحق\" كقوله تعالى \"ما ننزل الملائكة إلا بالحق\" وقوله \"وإنا لصادقون\" تأكيد لخبرهم إياه بما أخبروه به من نجاته وإهلاك قومه."
    },
    {
      "ayah": 65,
      "surah": 15,
      "text": "يذكر تعالى عن الملائكة أنهم أمروه أن يسري بأهله بعد مضي جانب من الليل وأن يكون لوط عليه السلام يمشي وراءهم ليكون أحفظ لهم وهكذا كان رسول الله صلى الله عليه وسلم يمشى في الغزو إنما يكون ساقة يزجي الضعيف ويحمل المنقطع وقوله \" ولا يلتفت منكم أحد \" أي إذا سمعتم الصيحة بالقوم فلا تلتفتوا إليهم وذروهم فيما حل بهم من العذاب والنكال \" وامضوا حيث تؤمرون \" كأنه كان معهم من يهديهم السبيل."
    },
    {
      "ayah": 66,
      "surah": 15,
      "text": "\" وقضينا إليه ذلك الأمر \" أي تقدمنا إليه في هذا \" أن دابر هؤلاء مقطوع مصبحين \" أي وقت الصباح كقوله في الآية الأخرى \" إن موعدهم الصبح أليس الصبح بقريب \"."
    },
    {
      "ayah": 67,
      "surah": 15,
      "text": "يخبر تعالى عن مجيء قوم لوط لما علموا بأضيافه وصباحة وجوههم وأنهم جاءوا مستبشرين بهم فرحين."
    },
    {
      "ayah": 68,
      "surah": 15,
      "text": "قال إن هؤلاء ضيفي فلا تفضحون واتقوا الله ولا تخزون \" وهذا إنما قاله لهم قبل أن يعلم بأنهم رسل الله كما قال في سورة هود وأما ههنا فتقدم ذكر أنهم رسل الله وعطف ذكر مجيء قومه ومحاجته لهم ولكن الواو لا تقتضي الترتيب ولا سيما إذا دل دليل على خلافه."
    },
    { "ayah": 69, "surah": 15, "text": "وهذا إنما قاله لهم قبل أن يعلم بأنهم رسل الله." },
    {
      "ayah": 7,
      "surah": 15,
      "text": "\" لوما \" أي هلا \" تأتينا بالملائكة \" أي يشهدون لك بصحة ما جئت به كما قال فرعون \" فلولا ألقي عليه أسورة من ذهب أو جاء معه الملائكة مقترنين \" \" وقال الذين لا يرجون لقاءنا لولا أنزل علينا الملائكة أو نرى ربنا لقد استكبروا في أنفسهم وعتوا عتوا كبيرا يوم يرون الملائكة لا بشرى يومئذ للمجرمين ويقولون حجرا محجورا."
    },
    { "ayah": 70, "surah": 15, "text": "فقالوا له مجيبين \" أولم ننهك عن العالمين \" أي أوما نهيناك أن تضيف أحدا؟." },
    {
      "ayah": 71,
      "surah": 15,
      "text": "فأرشدهم إلى نسائهم وما خلق لهم ربهم منهم من الفروج المباحة وقد تقدم إيضاح القول فى ذلك بما أغنى عن إعادته هذا كله وهم غافلون عما يراد بهم وما قد أحاط بهم من البلاء وما يصبحون من العذاب المنتظر ولهذا قال تعالى لمحمد صلى الله عليه وسلم \" لعمرك إنهم لفي سكرتهم يعمهون \" أقسم تعالى بحياة نبيه صلوات الله وسلامه عليه وفي هذا تشريف عظيم ومقام رفيع وجاه عريض قال عمرو بن مالك البكري عن أبي الجوزاء عن ابن عباس أنه قال: ما خلق الله وما ذرأ وما برأ نفسا أكرم عليه من محمد صلى الله عليه وسلم وما سمعت الله أقسم بحياة أحد غيره."
    },
    {
      "ayah": 72,
      "surah": 15,
      "text": "قال الله تعالى \" لعمرك إنهم لفي سكرتهم يعمهون \" يقول وحياتك وعمرك وبقائك في الدنيا \" إنهم لفى سكرتهم يعمهون \".رواه ابن جرير وقال قتادة في سكرتهم أي في ضلالتهم \" يعمهون \" أي يلعبون وقال علي بن أبي طلحة عن ابن عباس \" لعمرك \" لعيشك \" إنهم لفي سكرتهم يعمهون \" قال يترددون."
    },
    {
      "ayah": 73,
      "surah": 15,
      "text": "يقول تعالى \" فأخذتهم الصيحة \" وهي ما جاءهم به من الصوت القاصف عند شروق الشمس وهو طلوعها وذلك مع رفع بلادهم إلى عنان السماء."
    },
    {
      "ayah": 74,
      "surah": 15,
      "text": "ثم قلبها وجعل عاليها سافلها وأرسل حجارة السجيل عليهم وقد تقدم الكلام على السجيل في هود بما فيه كفاية."
    },
    {
      "ayah": 75,
      "surah": 15,
      "text": "وقوله \" إن في ذلك لآيات للمتوسمين \" أي أن آثار هذه النقم الظاهرة على تلك البلاد لمن تأمل ذلك وتوسمه بعين بصره وبصيرته كما قال مجاهد في قوله \" للمتوسمين \" قال المتفرسين وعن ابن عباس والضحاك للناظرين وقال قتادة للمعتبرين وقال مالك عن بعض أهل المدينة \" للمتوسمين \" للمتأملين. وقال ابن أبي حاتم حدثنا الحسن بن عرفة حدثنا محمد بن كثير العبدي عن عمرو بن قيس عن عطية عن أبي سعيد مرفوعا قال: قال رسول الله صلى الله عليه وسلم \" اتقوا فراسة المؤمن فإنه ينظر بنور الله \" ثم قرأ النبي صلى الله عليه وسلم \" إن في ذلك لآيات للمتوسمين \".رواه الترمذي وابن جرير من حديث عمرو بن قيس الملائي عن عطية عن أبي سعيد وقال الترمذي لا نعرفه إلا من هذا الوجه; وقال ابن جرير أيضا حدثني أحمد بن محمد الطوسي حدثنا الحس بن محمد حدثنا الفرات بن السائب حدثنا ميمون بن مهران عن ابن عمر قال: قال رسول الله صلى الله عليه وسلم \" اتقوا فراسة المؤمن فإن المؤمن ينظر بنور الله \". وقال ابن جرير حدثني أبو شرحبيل الحمصي حدثنا سليمان بن سلمة حدثنا المؤمل بن سعيد بن يوسف الرحبي حدثنا أبو المعلى أسد بن وداعة الطائي حدثنا وهب بن منبه عن طاوس بن كيسان عن ثوبان قال: قال رسول الله صلى الله عليه وسلم \" احذروا فراسة المؤمن فإنه ينظر بنور الله وبتوفيق الله \". وقال أيضا حدثنا عبد الأعلى بن واصل حدثنا سعيد بن محمد الجرمي حدثنا عبد الواحد بن واصل حدثنا أبو بشر المزلق عن ثابت عن أنس بن مالك قال: قال النبي صلى الله عليه وسلم \" إن لله عبادا يعرفون الناس بالتوسم \". ورواه الحافظ أبو بكر البزار حدثنا سهل بن بحر حدثنا سعيد بن محمد الجرمي حدثنا أبو بشر يقال له ابن المزلق قال وكان ثقة عن ثابت عن أنس قال: قال رسول \" إن لله عبادا يعرفون الناس بالتوسم \"."
    },
    {
      "ayah": 76,
      "surah": 15,
      "text": "وقوله \" وإنها لبسبيل مقيم \" أي وإن قرية سدوم التي أصابها ما أصابها من القلب الصوري والمعنوي والقذف بالحجارة حتى صارت بحيرة منتنة خبيثة بطريق مهيع مسالكه مستمرة إلى اليوم كقوله \" وإنكم لتمرون عليهم مصبحين وبالليل أفلا تعقلون وإن يونس لمن المرسلين \" وقال مجاهد والضحاك \" وإنها لبسبيل مقيم \" قال معلم وقال قتادة بطريق واضح وقال قتادة أيضا بصقع من الأرض واحد وقال السدي بكتاب مبين يعني كقوله \" وكل شيء أحصيناه في إمام مبين \" ولكن ليس المعنى على ما قال ههنا والله أعلم."
    },
    {
      "ayah": 77,
      "surah": 15,
      "text": "وقوله \" إن في ذلك لآية للمؤمنين \" أي إن الذي صنعنا بقوم لوط من الهلاك والدمار وإنجائنا لوطا وأهله لدلالة واضحة جلية للمؤمنين بالله ورسله."
    },
    {
      "ayah": 78,
      "surah": 15,
      "text": "أصحاب الأيكة هم قوم شعيب قال الضحاك وقتادة وغيرهما الأيكة الشجر الملتف وكان ظلمهم بشركهم بالله وقطعهم الطريق ونقصهم المكيال والميزان."
    },
    {
      "ayah": 79,
      "surah": 15,
      "text": "فانتقم الله منهم بالصيحة والرجفة وعذاب يوم الظلة وقد كانوا قريبا من قوم لوط بعدهم في الزمان ومسامتين لهم في المكان ولهذا قال تعالى \" وإنهما لبإمام مبين \" أي طريق مبين قال ابن عباس ومجاهد والضحاك وغيره طريق ظاهر ولهذا لما أنذر شعيب قومه قال في نذارته إياهم \" وما قوم لوط منكم ببعيد\"."
    },
    {
      "ayah": 8,
      "surah": 15,
      "text": "وكذا قال في هذه الآية \" ما ننزل الملائكة إلا بالحق وما كانوا إذا منظرين \" وهو القرآن وهو الحافظ له من التغيير والتبديل ومنهم من أعاد الضمير في قوله تعالى \" له لحافظون \" على النبي صلى الله عليه وسلم كقوله \" والله يعصمك من الناس \" والمعنى الأول أولى وهو ظاهر السياق."
    },
    {
      "ayah": 80,
      "surah": 15,
      "text": "أصحاب الحجر هم ثمود الذين كذبوا صالحا نبيهم عليه السلام ومن كذب برسول فقد كذب بجميع المرسلين ولهذا أطلق عليم تكذيب المرسلين."
    },
    {
      "ayah": 81,
      "surah": 15,
      "text": "وذكر تعالى أنه آتاهم من الآيات ما يدلهم على صدق ما جاءهم به صالح كالناقة التي أخرجها الله لهم بدعاء صالح من صخرة صماء وكانت تسرج في بلادهم لها شرب ولهم شرب يوم معلوم فلما عتوا وعقروها قال لهم \" تمتعوا في داركم ثلاثة أيام ذلك وعد غير مكذوب \" وقال تعالى \" وأما ثمود فهديناهم فاستحبوا العمى على الهدى \"."
    },
    {
      "ayah": 82,
      "surah": 15,
      "text": "وذكر تعالى أنهم \" كانوا ينحتون من الجبال بيوتا آمنين \" أي من غير خوف ولا احتياج إليها بل أشرا وبطرا وعبثا كما هو المشاهد من صنيعهم في بيوتهم بوادي الحجر الذي مر به رسول الله صلى الله عليه وسلم وهو ذاهب إلى تبوك فقنع رأسه وأسرع دابته وقال لأصحابه \" لا تدخلوا بيوت القوم المعذبين إلا أن تكونوا باكين فإن لم تبكوا فتباكوا خشية أن يصيبكم ما أصابهم\"."
    },
    { "ayah": 83, "surah": 15, "text": "وقوله \"فأخذتهم الصيحة مصبحين\" أي وقت الصباح من اليوم الرابع." },
    {
      "ayah": 84,
      "surah": 15,
      "text": "فما أغنى عنهم ما كانوا يكسبون \" أي ما كانوا يستغلونه من زروعهم وثمارهم التي ضنوا بمائها عن الناقة حتى عقروها لئلا تضيق عليهم في المياه فما دفعت عنهم تلك الأموال ولا نفعتهم لما جاء أمر ربك."
    },
    {
      "ayah": 85,
      "surah": 15,
      "text": "يقول تعالى \" وما خلقنا السموات والأرض وما بينهما إلا بالحق وإن الساعة لآتية \" أي بالعدل \" ليجزي الذين أساءوا بما عملوا \" الآية وقال تعالى \" وما خلقنا السماء والأرض وما بينهما باطلا ذلك ظن الذين كفروا فويل للذين كفروا من النار وقال تعالى أفحسبتم أنما خلقناكم عبثا وأنكم إلينا لا ترجعون فتعالى الله الملك الحق لا إله إلا هو رب العرش الكريم \" ثم أخبر نبيه بقيام الساعة وأنها كائنة لا محالة ثم أمره بالصفح الجميل عن المشركين في أذاهم له وتكذيبهم ما جاءهم به كقوله \" فاصفح عنهم وقل سلام فسوف يعلمون \" وقال مجاهد وقتادة وغيرهما كان هذا قبل القتال وهو كما قالا فإن هذه مكية والقتال إنما شرع بعد الهجرة."
    },
    {
      "ayah": 86,
      "surah": 15,
      "text": "وقوله \" إن ربك هو الخلاق العليم \" تقرير للمعاد وأنه تعالى قادر على إقامة الساعة إنه الخلاق الذي لا يعجزه خلق شيء العليم بما تمزق من الأجساد وتفرق في سائر أقطار الأرض كقوله \" أوليس الذي خلق السموات والأرض بقادر على أن يخلق مثلهم بلى وهو الخلاق العليم إنما أمره إذا أراد شيئا أن يقول له كن فيكون فسبحان الذي بيده ملكوت كل شيء وإليه ترجعون \"."
    },
    {
      "ayah": 87,
      "surah": 15,
      "text": "يقول تعالى لنبيه صلى الله عليه وسلم كما آتيناك القرآن العظيم فلا تنظرن إلى الدنيا وزينتها وما متعنا به أهلها من الزهرة الفانية لنفتنهم فيه فلا تغبطهم بما هم فيه ولا تذهب نفسك عليم حسرات حزنا عليهم في تكذيبهم لك ومخالفتهم دينك وقد اختلف في السبع المثاني ما هي فقال ابن مسعود وابن عمر وابن عباس ومجاهد وسعيد بن جبير والضحاك وغيرهم: هي السبع الطوال يعنون البقرة وآل عمران والنساء والمائدة والأنعام والأعراف ويونس نص عليه ابن عباس وسعيد بن جبير وقال سعيد بين فيهن الفرائض والحدود والقصص والأحكام وقال ابن عباس بين الأمثال والخبر والعبر وقال ابن أبي حاتم: حدثنا أبي حدثنا ابن أبي عمر قال: قال سفيان: المثاني البقرة وآل عمران والنساء والمائدة والأنعام والأعراف والأنفال وبراءة سورة واحدة قال ابن عباس: ولم يعطهن أحد إلا النبي صلى الله عليه وسلم وأعطي موسى منهن ثنتين رواه هشيم عن الحجاج عن الوليد بن العيذار عن سعيد بن جبير عنه. وقال الأعمش عن مسلم البطين عن سعيد بن جبير عن ابن عباس قال: أوتي النبي صلى الله عليه وسلم سبعا من المثاني الطول وأوتي موسى عليه السلام ستا فلما ألقى الألواح ارتفع اثنتان وبقيت أربع. وقال مجاهد: هي السبع الطوال ويقال هي القرآن العظيم. وقال خصيف عن زياد بن أبي مريم في قوله تعالى \" سبعا من المثاني \" قال أعطيتك سبعة أجزاء مر وانه وبشر وأنذر واضرب الأمثال واعدد النعم وأنبئك بنبإ القرآن. رواه ابن جرير وابن أبي حاتم \" والقول الثاني \" أنها الفاتحة وهي سبع آيات. وروي ذلك عن علي وعمر وابن مسعود وابن عباس قال ابن عباس: والبسملة هي الآية السابعة وقد خصكم الله بها. وبه قال إبراهيم النخعي وعبد الله بن عبيد بن عمير وابن أبي ملكية وشهر بن حوشب والحسن البصري ومجاهد. وقال قتادة: ذكر لنا أنهن فاتحة الكتاب وأنهن يثنين في كل ركعة مكتوبة أو تطوع واختاره ابن جرير واحتج بالأحاديث الواردة في ذلك وقد قدمناها في فضائل سورة الفاتحة في أول التفسير ولله الحمد. وقد أورد البخاري رحمه الله تعالى ههنا حديثين أحدهما قال: حدثنا محمد بن بشار حدثنا غندر حدثنا شعبة عن حبيب بن عبد الرحمن عن حفص بن عاصم عن أبي سعيد بن المعلى قال: مر بي النبي صلى الله عليه وسلم وأنا أصلي فدعاني فلم آته حتى صليت فأتيته فقال \" ما منعك أن تأتيني؟ \" فقلت كنت أصلي فقال \" ألم يقل الله \" يا أيها الذين آمنوا استجيبوا لله وللرسول إذا دعاكم \" ألا أعلمك أعظم سورة في القرآن قبل أن أخرج من المسجد \" فذهب النبي صلى الله عليه وسلم ليخرج فذكرت فقال \" الحمد لله رب العالمين \" هي السبع المثاني والقرآن العظيم الذي أوتيته \" \" الثاني \"قال: حدثنا آدم حدثنا ابن أبي ذئب حدثنا المقبري عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم \" أم القرآن هي السبع المثاني والقرآن العظيم \" فهذا نص فى أن الفاتحة السبع المثاني والقرآن العظيم ولكن لا ينافي وصف غيرها من السبع الطول بذلك لما فيها من هذه الصفة كما لا ينافي وصف القرآن بكماله بذلك أيضا كما قال تعالى \" الله نزل أحسن الحديث كتابا متشابها مثاني \" فهو مثاني من وجه ومتشابه من وجه وهو القرآن العظيم أيضا كما أنه عليه الصلاة والسلام لما سئل عن المسجد الذي أسس على التقوى فأشار إلى مسجده والآية نزلت في مسجد قباء فلا تنافي فإن ذكر الشيء لا ينفي ذكر ما عداه إذا اشتركا فى تلك الصفة والله أعلم."
    },
    {
      "ayah": 88,
      "surah": 15,
      "text": "وقوله \" لا تمدن عينيك إلى ما متعنا به أزواجا منهم \" أي استغن بما آتاك الله من القرآن العظيم عما هم فيه من المتاع والزهرة الفانية ومن ههنا ذهب ابن عيينة إلى تفسير الحديث الصحيح \" ليس منا من لم يتغن بالقرآن \" إلى أنه يستغني به عما عداه وهو تفسير صحيح ولكن ليس هو المقصود من الحديث كما تقدم في أول التفسير. وقال ابن أبي حاتم: ذكر عن وكيع بن الجراح حدثنا موسى بن عبيدة عن يزيد بن عبد الله بن قسيط عن أبي رافع صاحب النبي صلى الله عليه وسلم قال ضاف النبي صلى الله عليه وسلم ضيف ولم يكن عند النبي صلى الله عليه وسلم شيء يصلحه فأرسل إلى رجل من اليهود \" يقول لك محمد رسول الله أسلفني دقيقا إلى هلال رجب \" قال لا إلا برهن فأتيت النبي صلى الله تعالى عليه وعلى آله وسلم فأخبرته فقال \" أما والله إنى لأمين من في السماء وأمين من في الأرض ولئن أسلفني أو باعني لأؤدين إليه \" فلما خرجت من عنده نزلت هذه الآية \" لا تمدن عينيك إلى ما متعنا به أزواجا منهم زهرة الحياة الدنيا \" إلى آخر الآية كأنه يعزيه عن الدنيا. قال العوفي عن ابن عباس \" لا تمدن عينيك \" قال نهى الرجل أن يتمنى ما لصاحبه. وقال مجاهد \" إلى ما متعنا به أزواجا منهم \" هم الأغنياء. واخفض جناحك لمن اتبعك من المؤمنين أي ألن لهم جانبك كقول \" لقد جاءكم رسول من أنفسكم عزيز عليه ما عنتم حريص عليكم بالمؤمنين رءوف رحيم \"."
    },
    {
      "ayah": 89,
      "surah": 15,
      "text": "يأمر تعالى نبيه أن يقول للناس \" إني أنا النذير المبين \" البين النذارة نذير للناس من عذاب أليم أن يحل بهم على تكذيبه كما حل بمن تقدمهم من الأمم المكذبة لرسلها وما أنزل الله عليهم من العذاب والانتقام."
    },
    {
      "ayah": 9,
      "surah": 15,
      "text": "وهو القرآن وهو الحافظ له من التغيير والتبديل ومنهم من أعاد الضمير في قوله تعالى \" له لحافظون \" على النبي صلى الله عليه وسلم كقوله \" والله يعصمك من الناس \" والمعنى الأول أولى وهو ظاهر السياق."
    },
    {
      "ayah": 90,
      "surah": 15,
      "text": "وقوله\" المقتسمين \" أي المتحالفين أي تحالفوا على مخالفة الأنبياء وتكذيبهم وأذاهم كقوله تعالى إخبارا عن قوم صالح أنهم \" قالوا تقاسموا بالله لنبيتنه وأهله \" الآية أي نقتلهم ليلا. قال مجاهد: تقاسموا وتحالفوا \" وأقسموا بالله جهد أيمانهم لا يبعث الله من يموت \" \" أولم تكونوا أقسمتم من قبل \" الآية \" أهؤلاء الذين أقسمتم لا ينالهم الله برحمة \" فكأنهم كانوا لا يكذبون بشيء من الدنيا إلا أقسموا عليه فسموا مقتسمين. قال عبد الرحمن بن زيد بن أسلم: المقتسمون أصحاب صالح الذين تقاسموا بالله لنبيتنه وأهله. وفي الصحيحين عن أبي موسى عن النبي صلى الله عليه وسلم قال \" إنما مثلي ومثل ما بعثني الله به كمثل رجل أتى قومه فقال يا قوم إني رأيت الجيش بعيني وإني أنا النذير العريان فالنجاء النجاء فأطاعه طائفة من قومه فأدلجوا وانطلقوا على مهلهم فنجوا وكذبه طائفة منهم فأصبحوا مكانهم فصبحهم الجيش فأهلكهم واجتاحهم فذلك مثل من أطاعني واتبع ما جئت به ومثل من عصاني وكذب ما جئت به من الحق \"."
    },
    {
      "ayah": 91,
      "surah": 15,
      "text": "وقوله \" الذين جعلوا القرآن عضين \" أي جزءوا كتبهم المنزلة عليهم فآمنوا ببعض وكفروا ببعض قال البخاري: حدثنا يعقوب بن إبراهيم حدثنا هشيم أنبانا أبو بشر سعيد بن جبير عن ابن عباس \" جعلوا القرآن عضين \" قال هم أهل الكتاب جزءوه أجزاء فآمنوا ببعضه وكفروا ببعضه. حدثنا عبيد الله بن موسى عن الأعمش عن أبي ظبيان عن ابن عباس \" جعلوا القرآن عضين \" قال هم أهل الكتاب جزءوه أجزاء فآمنوا ببعضه وكفروا ببعضه. حدثنا عبيد الله بن موسى عن الأعمش عن أبي ظبيان عن ابن عباس قال \" كما أنزلنا على المقتسمين \" قال: آمنوا ببعض وكفروا ببعض اليهود والنصارى. قال ابن أبي حاتم وروي عن مجاهد والحسن والضحاك وعكرمة وسعيد بن جبير وغيرهم نحو ذلك. وقال الحكم بن أبان عن عكرمة عن ابن عباس \" جعلوا القرآن عضين \" قال السحر. وقال عكرمة: العضه السحر بلسان قريش يقول للساحرة إنها العاضهة. وقال مجاهد: عضوه أعضاء قالوا سحر وقالوا كهانة وقالوا أساطير الأولين وقال عطاء قال بعضهم ساحر وقالوا مجنون وقالوا كاهن فذلك العضين. وكذا روي عن الضحاك وغيره وقال محمد بن إسحاق عن محمد بن أبي محمد عن عكرمة أو سعيد بن جبير عن ابن عباس أن الوليد بن المغيرة اجتمع إليه نفر من قريش وكان ذا شرف فيهم وقد حضر الموسم فقال لهم يا معشر قريش إنه قد حضر هذا الموسم وإن وفود العرب ستقدم عليكم فيه وقد سمعوا بأمر صاحبكم هذا فأجمعوا فيه رأيا واحدا ولا تختلفوا فيكذب بعضكم بعضا ويرد قولكم بعضه بعضا فقالوا وأنت يا أبا عبد شمس فقل وأقم لنا رأيا نقول به قال: بل أنتم قولوا لأسمع قالوا: نقول كاهن قال ما هو بكاهن قالوا فنقول مجنون قال ما هو بمجنون قالوا فنقول شاعر قال ما هو بشاعر قالوا فنقول ساحر قال ما هو بساحر قالوا فماذا نقول؟ قال والله إن لقوله لحلاوة فما أنتم بقائلين من هذا شيئا إلا عرف أنه باطل وإن أقرب القول أن تقولوا هو ساحر; فتفرقوا عنه بذلك وأنزل الله فيهم \" الذين جعلوا القرآن عضين \" أصنافا."
    },
    {
      "ayah": 92,
      "surah": 15,
      "text": "\" فوربك لنسألنهم أجمعين عما كانوا يعملون \" أولئك النفر الذين قالوا لرسول الله. وقال عبد الله هو ابن مسعود والذي لا إله غيره ما منكم من أحد إلا سيخلو الله به يوم القيامة كما يخلو أحدكم بالقمر ليلة البدر فيقول: ابن آدم ماذا غرك منى بي؟ ابن آدم ماذا عملت فيما علمت؟ ابن آدم ماذا أجبت المرسلين؟."
    },
    {
      "ayah": 93,
      "surah": 15,
      "text": "وقال عطية العوفي عن ابن عمر في قوله \" لنسألنهم أجمعين عما كانوا يعملون \".قال عن لا إله إلا الله وقال عبد الرزاق أنبأنا الثوري عن ليث هو ابن أبي سليم عن مجاهد فى قوله تعالى \" لنسألنهم أجمعين عما كانوا يعملون \" قال: عن لا إله إلا الله. وقد روى الترمذي وأبو يعلى الموصلي ابن جرير وابن أبي حاتم من حديث شريك القاضي عن ليث بن أبي سليم عن بشير بن أبي نهيك عن أنس عن النبي صلى الله عليه وسلم \" فوربك لنسألنهم أجمعين \" قال: عن لا إله إلا الله ورواه ابن إدريس عن ليث عن بشير عن أنس موقوفا وقال ابن جرير: حدثنا أحمد حدثنا أبو أحمد حدثنا شريك عن هلال عن عبد الله بن حكيم قال: ورواه الترمذي وغيره من حديث أنس مرفوع. وقال عبد الله هو ابن مسعود والذي لا إله غيره ما منكم من أحد إلا سيخلو الله به يوم القيامة كما يخلو أحدكم بالقمر ليلة البدر فيقول: ابن آدم ماذا غرك منى بي؟ ابن آدم ماذا عملت فيما علمت؟ ابن آدم ماذا أجبت المرسلين؟ وقال أبو جعفر عن الربيع عن أبي العالية في قوله \" فوربك لنسألنهم أجمعين عما كانوا يعملون \" قال يسأل العباد كلهم عن خلتين يوم القيامة عما كانوا يعبدون وعن ماذا أجابوا المرسلين وقال ابن عيينة عن عملك وعن مالك وقال ابن أبي حاتم: حدثنا أبي حدثنا أحمد بن أبي الحوارى حدثنا يونس الحذاء عن أبي حمزة الشيباني عن معاذ بن جبل قال: قال رسول الله صلى الله عليه وسلم \" يا معاذ إن المرء يسأل يوم القيامة عن جميع سعيه حتى كحل عينيه وعن فتات الطينة بإصبعه فلا ألفينك يوم القيامة وأحد غيرك أسعد بما أتاك الله منك \" وقال علي بن أبي طلحة عن ابن عباس في قوله \" فوربك لنسألنهم أجمعين عما كانوا يعملون \" ثم قال \" فيومئذ لا يسئل عن ذنبه إنس ولا جان \" قال لا يسألهم هل عملتم كذا؟ لأنه أعلم ذلك منهم ولكن يقول لم عملتم كذا وكذا؟."
    },
    {
      "ayah": 94,
      "surah": 15,
      "text": "يقول تعالى آمرا رسوله صلى الله عليه وسلم بإبلاغ ما بعثه به وبإنفاذه والصدع به وهو مواجهة المشركين به كما قال ابن عباس في قوله \" فاصدع بما تؤمر \" أي أمضه وفي رواية \" افعل ما تؤمر \" وقال مجاهد هو الجهر بالقرآن في الصلاة. وقال أبو عبيدة عن عبد الله بن مسعود: ما زال النبي صلى الله عليه وسلم مستخفيا حتى نزلت \" فاصدع بما تؤمر \" فخرج هو وأصحابه وقوله \" وأعرض عن المشركين إنا كفيناك المستهزئين \" أي بلغ ما أنزل إليك من ربك ولا تلتفت إلى المشركين الذين يريدون أن يصدوك عن آيات الله \" ودوا لو تدهن فيدهنون \" ولا تخفهم فإن الله كافيك إياهم وحافظك منهم كقوله تعالى \" يا أيها الرسول بلغ ما أنزله إليك من ربك وإن لم تفعل فما بلغت رسالته والله يعصمك من الناس \" قال الحافظ أبو بكر البزار: حدثنا يحيى بن محمد بن السكن حدثنا إسحاق بن إدريس حدثنا عون بن كهمس عن يزيد بن درهم عن أنس قال: سمعت أنسا يقول في هذه الآية \" إنا كفيناك المستهزئين الذين يجعلون مع الله إلها آخر \" قال مر رسول الله صلى الله عليه وسلم فغمزه بعضهم فجاء جبريل قال أحسبه قال فغمزهم فوقع في أجسادهم كهيئة الطعنة فماتوا. وقال محمد بن إسحاق: كان عظماء المستهزئين كما حدثني يزيد بن رومان عن عروة بن الزبير خمسة نفر وكانوا ذوي أسنان وشرف في قومهم من بني أسد بن عبد العزى بن قصي الأسود بن المطلب أبي زمعة كان رسول الله صلى الله عليه وسلم فيما بلغني قد دعا عليه لما كان يبلغه من أذاه واستهزائه فقال \" اللهم أعم بصره وأثكله ولده \" ومن بني زهرة الأسود بن عبد يغوث بن وهب بن عبد مناف بن زهرة ومن بني مخزوم الوليد بن المغيرة بن عبد الله بن عمرو بن مخزوم ومن بني سهم ابن عمر بن هصيص بن كعب بن لؤي العاص بن وائل بن هشام بن سعيد بن سعد ومن خزاعة الحارث بن الطلاطلة بن عمرو بن الحارث بن عبد بن عمر بن ملكان. فلما تمادوا في الشر وأكثروا برسول الله صلى الله عليه وسلم الاستهزاء أنزل الله تعالى \" فاصدع بما تؤمر وأعرض عن المشركين إنا كفيناك المستهزئين \" إلى قوله - \" فسوف يعلمون \" قال ابن إسحاق فحدث يزيد بن رومان عن عروة بن الزبير أو غيره من العلماء أن جبريل أتى رسول الله صلى الله عليه وسلم وهو يطوف بالبيت فقام وقام رسول الله صلى الله عليه وسلم إلى جنبه فمر به الأسود بن عبد يغوث فأشار إلى بطنه فاستسقى بطنه فمات منه ومر به الوليد بن المغيرة فأشار إلى أثر جرح بأسفل كعب رجله وكان أصابه قبل ذلك بسنين وهو يجر إزاره وذلك أنه مر برجل من خزاعة يريش نبلا له فتعلق سهم من نبله بإزاره فخدش رجله ذلك الخدش وليس بشيء فانتفض به فقتله ومر به العاص بن وائل فأشار إلى أخمص قدمه فخرج على حمار له يريد الطائف فربض على شبرقة فدخلت في أخمص قدمه فقتلته ومر به الحارث بن الطلاطلة فأشار إلى رأسه فامتخط قيحا فقتله قال محمد بن إسحاق: حدثني محمد بن أبي محمد عن رجل عن ابن عباس قال: كان رأسهم الوليد بن المغيرة وهو الذي جمعهم وهكذا روي عن سعيد بن جبير وعكرمة نحو سياق محمد بن إسحاق به عن يزيد عن عروة بطوله إلا أن سعيدا يقول الحارث ابن غيطلة وعكرمة يقول الحارث بن قيس قال الزهري وصدقا هو الحارث بن قيس وأمه غيطلة وكذا روي عن مجاهد ومقسم وقتادة وغير واحد أنهم كانوا خمسة وقال الشعبي: كانوا سبعة والمشهور الأول."
    },
    {
      "ayah": 95,
      "surah": 15,
      "text": "وقوله \" وأعرض عن المشركين إنا كفيناك المستهزئين \" أي بلغ ما أنزل إليك من ربك ولا تلتفت إلى المشركين الذين يريدون أن يصدوك عن آيات الله \" ودوا لو تدهن فيدهنون \" ولا تخفهم فإن الله كافيك إياهم وحافظك منهم كقوله تعالى \" يا أيها الرسول بلغ ما أنزله إليك من ربك وإن لم تفعل فما بلغت رسالته والله يعصمك من الناس \" قال الحافظ أبو بكر البزار: حدثنا يحيى بن محمد بن السكن حدثنا إسحاق بن إدريس حدثنا عون بن كهمس عن يزيد بن درهم عن أنس قال: سمعت أنسا يقول في هذه الآية \" إنا كفيناك المستهزئين الذين يجعلون مع الله إلها آخر \" قال مر رسول الله صلى الله عليه وسلم فغمزه بعضهم فجاء جبريل قال أحسبه قال فغمزهم فوقع في أجسادهم كهيئة الطعنة فماتوا. وقال محمد بن إسحاق: كان عظماء المستهزئين كما حدثني يزيد بن رومان عن عروة بن الزبير خمسة نفر وكانوا ذوي أسنان وشرف في قومهم من بني أسد بن عبد العزى بن قصي الأسود بن المطلب أبي زمعة كان رسول الله صلى الله عليه وسلم فيما بلغني قد دعا عليه لما كان يبلغه من أذاه واستهزائه فقال \" اللهم أعم بصره وأثكله ولده \" ومن بني زهرة الأسود بن عبد يغوث بن وهب بن عبد مناف بن زهرة ومن بني مخزوم الوليد بن المغيرة بن عبد الله بن عمرو بن مخزوم ومن بني سهم ابن عمر بن هصيص بن كعب بن لؤي العاص بن وائل بن هشام بن سعيد بن سعد ومن خزاعة الحارث ابن الطلاطلة بن عمرو بن الحارث بن عبد بن عمر بن ملكان. فلما تمادوا في الشر وأكثروا برسول الله صلى الله عليه وسلم الاستهزاء أنزل الله تعالى \" فاصدع بما تؤمر وأعرض عن المشركين إنا كفيناك المستهزئين \" إلى قوله - \" فسوف يعلمون \" قال ابن إسحاق فحدث يزيد بن رومان عن عروة بن الزبير أو غيره من العلماء أن جبريل أتى رسول الله صلى الله عليه وسلم وهو يطوف بالبيت فقام وقام رسول الله صلى الله عليه وسلم إلى جنبه فمر به الأسود بن عبد يغوث فأشار إلى بطنه فاستسقى بطنه فمات منه ومر به الوليد بن المغيرة فأشار إلى أثر جرح بأسفل كعب رجله وكان أصابه قبل ذلك بسنين وهو يجر إزاره وذلك أنه مر برجل من خزاعة يريش نبلا له فتعلق سهم من نبله بإزاره فخدش رجله ذلك الخدش وليس بشيء فانتفض به فقتله ومر به العاص بن وائل فأشار إلى أخمص قدمه فخرج على حمار له يريد الطائف فربض على شبرقة فدخلت في أخمص قدمه فقتلته ومر به الحارث ابن الطلاطلة فأشار إلى رأسه فامتخط قيحا فقتله قال محمد بن إسحاق: حدثني محمد بن أبي محمد عن رجل عن ابن عباس قال: كان رأسهم الوليد بن المغيرة وهو الذي جمعهم وهكذا روي عن سعيد بن جبير وعكرمة نحو سياق محمد بن إسحاق به عن يزيد عن عروة بطوله إلا أن سعيدا يقول الحارث ابن غيطلة وعكرمة يقول الحارث بن قيس قال الزهري وصدقا هو الحارث بن قيس وأمه غيطلة وكذا روي عن مجاهد ومقسم وقتادة وغير واحد أنهم كانوا خمسة وقال الشعبي: كانوا سبعة والمشهور الأول."
    },
    {
      "ayah": 96,
      "surah": 15,
      "text": "وقوله \" الذين يجعلون مع الله إلها آخر فسوف يعلمون \" تهديد شديد ووعيد أكيد لمن جعل مع الله معبودا آخر."
    },
    {
      "ayah": 97,
      "surah": 15,
      "text": "وقوله \" ولقد نعلم أنك يضيق صدرك بما يقولون فسبح بحمد ربك وكن من الساجدين \" أي وإنا لنعلم يا محمد أنك يحصل لك من أذاهم لك ضيق صدر وانقباض فلا يهيدنك ذلك ولا يثنينك عن إبلاغك رسالة الله وتوكل عليه فإنه كافيك وناصرك عليهم فاشتغل بذكر الله وتحميده وتسبيحه وعبادته التي هي الصلاة ولهذا قال \" فسبح بحمد ربك وكن من الساجدين \" كما جاء في الحديث الذي رواه الإمام أحمد: حدثنا عبد الرحمن بن مهدي حدثنا معاوية بن صالح عن أبي الزاهرية عن كثير بن مرة عن نعيم بن عمار أنه سمع رسول الله صلى الله عليه وسلم يقول \" قال الله تعالى يا ابن آدم لا تعجز عن أربع ركعات من أول النهار أكفك آخره \" ورواه أبو داود والنسائي من حديث مكحول عن كثير بن مرة بنحوه ولهذا كان رسول الله صلى الله عليه وسلم إذا حزبه أمر صلى."
    },
    {
      "ayah": 98,
      "surah": 15,
      "text": "وقوله \" ولقد نعلم أنك يضيق صدرك بما يقولون فسبح بحمد ربك وكن من الساجدين \" أي وإنا لنعلم يا محمد أنك يحصل لك من أذاهم لك ضيق صدر وانقباض فلا يهيدنك ذلك ولا يثنينك عن إبلاغك رسالة الله وتوكل عليه فإنه كافيك وناصرك عليهم فاشتغل بذكر الله وتحميده وتسبيحه وعبادته التي هي الصلاة ولهذا قال \" فسبح بحمد ربك وكن من الساجدين \" كما جاء في الحديث الذي رواه الإمام أحمد: حدثنا عبد الرحمن بن مهدي حدثنا معاوية بن صالح عن أبي الزاهرية عن كثير بن مرة عن نعيم بن عمار أنه سمع رسول الله صلى الله عليه وسلم يقول \" قال الله تعالى يا ابن آدم لا تعجز عن أربع ركعات من أول النهار أكفك آخره \" ورواه أبو داود والنسائي من حديث مكحول عن كثير بن مرة بنحوه ولهذا كان رسول الله صلى الله عليه وسلم إذا حزبه أمر صلى."
    },
    {
      "ayah": 99,
      "surah": 15,
      "text": "وقوله \" واعبد ربك حتى يأتيك اليقين \" قال البخاري قال سالم الموت وسالم هذا هو سالم بن عبد الله بن عمر كما قال ابن جرير: حدثنا محمد بن بشار حدثنا يحيى بن سعيد عن سفيان حدثنا طارق بن عبد الرحمن عن سالم بن عبد الله \" واعبد ربك حتى يأتيك اليقين \" قال الموت وهكذا قال مجاهد والحسن وقتادة وعبد الرحمن بن زيد بن أسلم وغيره والدليل على ذلك قوله تعالى إخبارا عن أهل النار أنهم قالوا \" لم نك من المصلين ولم نك نطعم المسكين وكنا نخوض مع الخائضين وكنا نكذب بيوم الدين حتى أتانا اليقين \" وفي الصحيح من حديث الزهري عن خارجة بن زيد بن ثابت عن أم العلاء امرأة من الأنصار أن رسول الله صلى الله عليه وسلم لما دخل على عثمان بن مظعون وقد مات قالت أم العلاء رحمة الله عليك أبا السائب فشهادتي عليك لقد أكرمك الله فقال رسول الله صلى الله عليه وسلم \" وما يدريك أن الله أكرمه؟ \" فقلت بأبي وأمي يا رسول الله فمن؟ فقال \" أما هو فقد جاءه اليقين وإنى لأرجو له الخير \" ويستدل بهذه الآية الكريمة وهى قوله \" واعبد ربك حتى يأتيك اليقين \" على أن العبادة كالصلاة ونحوها واجبة على الإنسان ما دام عقله ثابتا فيصلي بحسب حاله كما ثبت في صحيح البخاري عن عمران بن حصين رضي الله عنهما أن رسول الله صلى الله عليه وسلم قال صل قائما فإن لم تستطع فقاعدا فإن لم تستطع فعلى جنب \" ويستدل بها على تخطئة من ذهب من الملاحدة إلى أن المراد باليقين المعرفة فمتى وصل أحدهم إلى المعرفة سقط عنه التكليف عندهم وهذا كفر وضلال وجهل فإن الأنبياء \" كانوا هم وأصحابهم أعلم الناس بالله وأعرفهم بحقوقه وصفاته وما يستحق من التعظيم وكانوا مع هذا أعبد وأكثر الناس عبادة ومواظبة على فعل الخيرات إلى حين الوفاة وإنما المراد باليقين ههنا الموت كما قدمناه ولله الحمد والمنة والحمد لله على الهداية وعليه الاستعانة والتوكل وهو المسئول أن يتوفانا على أكمل الأحوال وأحسنها فإنه جواد كريم. آخر تفسير سورة الحجر والحمد لله رب العالمين."
    }
  ]
}
