{
  "ayahs": [
    {
      "ayah": 1,
      "surah": 16,
      "text": "يخبر تعالى عن اقتراب الساعة ودنوها معبرا بصيغة الماضي الدال على التحقيق والوقوع لا محالة كقوله \"اقترب للناس حسابهم وهم في غفلة معرضون\" وقال \"اقتربت الساعة وانشق القمر\" وقوله \"فلا تستعجلوه\" أي قرب ما تباعد \"فلا تستعجلوه\" يحتمل أن يعود الضمير على الله ويحتمل أن يعود على العذاب وكلاهما متلازم كما قال تعالى \"ويستعجلونك بالعذاب ولولا أجل مسمى لجاءهم العذاب وليأتينهم بغتة وهم لا يشعرون يستعجلونك بالعذاب وإن جهنم لمحيطة بالكافرين \"وقد ذهب الضحاك في تفسير هذه الآية إلى قول عجيب فقال في قوله \"أتى أمر الله\" أي فرائضه وحدوده وقد رده ابن جرير فقال: لا نعلم أحدا استعجل بالفرائض وبالشرائع قبل وجودها بخلاف العذاب فإنهم استعجلوه قبل كونه استبعادا وتكذيبا قلت كما قال تعالى \"يستعجل بها الذين لا يؤمنون بها والذين آمنوا مشفقون منها ويعلمون أنها الحق ألا إن الذين يمارون في الساعة لفي ضلال بعيد\". وقال ابن أبي حاتم: ذكر عن يحيى بن آدم عن أبي بكر بن عياش عن محمد بن عبدالله مولى المغيرة بن شعبة عن كعب بن علقمة عن عبدالرحمن بن حجيرة عن عقبة بن عامر قال: قال رسول الله صلى الله عليه وآله وسلم \"تطلع عليكم عند الساعة سحابة سوداء من المغرب مثل الترس فما تزال ترتفع في السماء ثم ينادي مناد فيها: أيها الناس فيقبل الناس بعضهم على بعض هل سمعتم؟ فمنهم من يقول نعم ومنهم من يشك ثم ينادي الثانية يا أيها الناس فيقول الناس بعضهم لبعض: هل سمعتم؟ فيقولون نعم ثم ينادي الثالثة أيها الناس أتى أمر الله فلا تستعجلوه\" قال رسول الله صلى الله عليه وسلم فوالذي نفسي بيده إن الرجلين لينشران الثوب فما يطويانه أبدا وإن الرجل ليمدن حوضه فما يسقي فيه شيئا أبدا وإن الرجل ليحلب ناقته فما يشربه أبدا - قال- ويشتغل الناس\" ثم إنه تعالى نزه نفسه عن شركهم به غيره وعبادتهم معه ما سواه من الأوثان والأنداد تعالى وتقدس علوا كبيرا وهؤلاء هم المكذبون بالساعة فقال \"سبحانه وتعالى عما يشركون\"."
    },
    {
      "ayah": 10,
      "surah": 16,
      "text": "لما ذكر تعالى ما أنعم به عليهم من الأنعام والدواب شرع في ذكر نعمته عليهم في إنزال المطر من السماء وهو العلو مما لهم فيه بلغة ومتاع لهم ولأنعامهم فقال \"لكم منه شراب\" أي جعله عذبا زلالا يسوغ لكم شرابه ولم يجعله ملحا أجاجا \"ومنه شجر فيه تسيمون\" أي وأخرج لكم منه شجرا ترعون فيه أنعامكم. وقال ابن عباس وعكرمة والضحاك وقتادة وابن زيد في قوله فيه تسيمون أي ترعون ومنه الإبل السائمة والسوم: الرعي وروى ابن ماجه أن رسول الله صلى الله عليه وسلم نهى عن السوم قبل طلوع الشمس."
    },
    {
      "ayah": 100,
      "surah": 16,
      "text": "\"إنما سلطانه على الذين يتولونه\" قال مجاهد يطيعونه وقال آخرون اتخذوه وليا من دون الله \"وهم به مشركون\" أي أشركوا في عبادة الله ويحتمل أن تكون الباء سببية أي صاروا بسبب طاعتهم للشيطان مشركين بالله تعالى وقال آخرون معناه أنه شركهم في الأموال والأولاد."
    },
    {
      "ayah": 101,
      "surah": 16,
      "text": "يخبر تعالى عن ضعف عقول المشركين وقلة ثباتهم وإيقانهم وإنه لا يتصور منهم الإيمان وقد كتب عليهم الشقاوة وذلك أنهم إذا رأوا تغيير الأحكام ناسخها بمنسوخها قالوا لرسول الله صلى الله عليه وسلم \"إنما أنت مفتر\" أي كذاب وإنما هو الرب تعالى يفعل ما يشاء ويحكم ما يريد وقال مجاهد \"بدلنا آية مكان آية\" أي رفعناها وأثبتنا غيرها وقال قتادة هو كقوله تعالى \"ما ننسخ من آية أو ننسها\" الآية."
    },
    {
      "ayah": 102,
      "surah": 16,
      "text": "فقال تعالى مجيبا لهم \"قل نزله روح القدس\" أي جبريل \"من ربك بالحق\" أي بالصدق والعدل \"ليثبت الذين آمنوا\" فيصدقوا بما أنزل أولا وثانيا وتخبت له قلوبهم \"وهدى وبشرى للمسلمين\" أي وجعله هاديا وبشارة للمسلمين الذين آمنوا بالله ورسله."
    },
    {
      "ayah": 103,
      "surah": 16,
      "text": "يقول تعالى مخبرا عن المشركين ما كانوا يقولونه من الكذب والافتراء والبهت أن محمدا إنما يعلمه هذا الذي يتلوه علينا من القرآن بشر ويشيرون إلى رجل أعجمي كان بين أظهرهم غلام لبعض بطون قريش وكان بياعا يبيع عند الصفا وربما كان رسول الله صلى الله عليه وسلم يجلس إليه ويكلمه بعض الشيء وذاك كان أعجمي اللسان لا يعرف العربية أو أنه كان يعرف الشيء اليسير بقدر ما يرد جواب الخطاب فيما لا بد منه فلهذا قال الله تعالى رادا عليهم في افترائهم ذلك \" لسان الذي يلحدون إليه أعجمي وهذا لسان عربي مبين \" أي القرآن أي فكيف يتعلم من جاء بهذا القرآن في فصاحته وبلاغته ومعانيه التامة الشاملة التي هي أكمل من معاني كل كتاب نزل على بني إسرائيل كيف يتعلم من رجل أعجمي؟ لا يقول هذا من له أدنى مسكة من العقل. قال محمد بن إسحاق بن يسار في السيرة: كان رسول الله صلى الله عليه وسلم فيما بلغني كثيرا ما يجلس عند المروة إلى سبيعة غلام نصراني يقال له جبر عبد لبعض بني الحضرمي فأنزل الله \"ولقد نعلم أنهم يقولون إنما يعلمه بشر لسان الذي يلحدون إليه أعجمي وهذا لسان عربي مبين\" وكذا قال عبدالله بن كثير وعن عكرمة وقتادة كان اسمه يعيش. وقال ابن جرير حدثني أحمد بن محمد الطوسي حدثنا أبو عامر حدثنا إبراهيم بن طهمان عن مسلم بن عبدالله الملائي عن مجاهد عن ابن عباس قال: كان رسول الله صلى الله عليه وسلم يعلم قينا بمكة وكان اسمه بلعام وكان أعجمي اللسان وكان المشركون يرون رسول الله صلى الله عليه وسلم يدخل عليه ويخرج من عنده فقالوا إنما يعلمه بلعام فأنزل الله هذه الآية \"ولقد نعلم أنهم يقولون إنما يعلمه بشر لسان الذي يلحدون إليه أعجمي وهذا لسان عربي مبين\" وقال الضحاك بن مزاحم هو سلمان الفارسي وهذا القول ضعيف لأن هذه الآية مكية وسلمان إنما أسلم بالمدينة وقال عبيد الله بن مسلم كان لنا غلامان روميان يقرآن كتابا لهما بلسانهما فكان النبي صلى الله عليه وسلم يمر بهما فيقوم فيسمع منهما فقال المشركون يتعلم منهما فأنزل الله هذه الآية وقال الزهري عن سعيد بن المسيب: الذي قال ذلك من المشركين رجل كان يكتب الوحي لرسول الله صلى الله عليه وسلم فارتد بعد ذلك عن الإسلام وافترى هذه المقالة قبحه الله."
    },
    {
      "ayah": 104,
      "surah": 16,
      "text": "يخبر تعالى أنه لا يهدي من أعرض عن ذكره وتغافل عما أنزله على رسوله صلى الله عليه وسلم ولم يكن له قصد إلى الإيمان بما جاء من عند الله فهذا الجنس من الناس لا يهديهم الله إلى الإيمان بآياته وما أرسل به رسله في الدنيا ولهم عذاب أليم موجع في الآخرة."
    },
    {
      "ayah": 105,
      "surah": 16,
      "text": "ثم أخبر تعالى أن رسوله صلى الله عليه وسلم ليس بمفتر ولا كذاب لأنه إنما يفتري الكذب على الله وعلى رسوله صلى الله عليه وسلم شرار الخلق \"الذين لا يؤمنون بآيات الله\" من الكفرة والملحدين المعروفين بالكذب عند الناس والرسول محمد صلى الله عليه وسلم كان أصدق الناس وأبرهم وأكملهم علما وعملا وإيمانا وإيقانا معروفا بالصدق في قومه لا يشك في ذلك أحد منهم بحيث لا يدعى بينهم إلا بالأمين محمد ولهذا لما سأل هرقل ملك الروم أبا سفيان عن تلك المسائل التي سألها من صفة رسول الله صلى الله عليه وسلم كان فيما قال له: هل كنتم تتهمونه بالكذب قبل أن يقول ما قال؟ قال لا فقال هرقل: فهل كان ليدع الكذب على الناس ويذهب فيكذب على الله عز وجل."
    },
    {
      "ayah": 106,
      "surah": 16,
      "text": "أخبر تعالى عمن كفر به بعد الإيمان والتبصر وشرح صدره بالكفر واطمأن به أنه قد غضب عليه لعلمهم بالإيمان ثم عدولهم عنه وأن لهم عذابا عظيما في الدار الآخرة وأما قوله \"إلا من أكره وقلبه مطمئن بالإيمان\" فهو استثناء ممن كفر بلسانه ووافق المشركين بلفظه مكرها لما ناله من ضرب وأذى وقلبه يأبى ما يقول وهو مطمئن بالإيمان بالله ورسوله. وقد روى العوفي عن ابن عباس أن هذه الآية نزلت في عمار بن ياسر حين عذبه المشركون حتى يكفر بمحمد صلى الله عليه وسلم فوافقهم على ذلك مكرها وجاء معتذرا إلى النبي صلى الله عليه وسلم فأنزل الله هذه الآية وهكذا قال الشعبي وقتادة وأبو مالك وقال ابن جرير حدثنا ابن عبدالأعلى حدثنا محمد بن ثور عن معمر عن عبدالكريم الجزري عن أبي عبيدة محمد بن عمار بن ياسر قال أخذ المشركون عمار بن ياسر فعذبوه حتى قاربهم في بعض ما أرادوا فشكا ذلك إلى النبي صلى الله عليه وسلم فقال النبي صلى الله عليه وسلم \" كيف تجد قلبك؟ \" قال مطمئنا بالإيمان قال النبي صلى الله عليه وسلم \" إن عادوا فعد\". ورواه البيهقي بأبسط من ذلك وفيه أنه سب النبي صلى الله عليه وسلم وذكر آلهتهم بخير فشكا ذلك إلى النبي صلى الله عليه وسلم فقال يا رسول الله ما تركت حتى سببتك وذكرت آلهتهم بخير قال \"كيف تجد قلبك؟\" قال مطمئنا بالإيمان فقال \"إن عادوا فعد\" وفي ذلك أنزل الله \"إلا من أكره وقلبه مطمئن بالإيمان\" ولهذا اتفق العلماء على أن المكره على الكفر يجوز له أن يوالي إبقاء لمهجته ويجوز له أن يأبى كما كان بلال رضي الله عنه يأبى عليهم ذلك وهم يفعلون به الأفاعيل حتى أنهم ليضعوا الصخرة العظمة على صدره في شدة الحر ويأمرونه بالشرك بالله فيأبى عليهم وهو يقول: أحد أحد ويقول: والله لو أعلم كلمة هي أغيظ لكم منها لقلتها. رضي الله عنه وأرضاه. وكذلك حبيب بن زيد الأنصاري لما قال له مسيلمة الكذاب أتشهد أن محمدا رسول الله؟ فيقول نعم فيقول: أتشهد أني رسول الله؟ فيقول لا أسمع فلم يزل يقطعه إربا إربا وهو ثابت على ذلك. وقال الإمام أحمد حدثنا إسماعيل حدثنا أيوب عن عكرمة أن عليا رضي الله عنه حرق ناسا ارتدوا عن الإسلام فبلغ ذلك ابن عباس فقال لم أكن لأحرقهم بالنار إن رسول الله صلى الله عليه وسلم قال \"لا تعذبوا بعذاب الله\" وكنت أقاتلهم بقول رسول الله صلى الله عليه وسلم \"من بدل دينه فاقتلوه\" فبلغ ذلك عليا فقال ويح أم ابن عباس. رواه البخاري. وقال الإمام أحمد أيضا حدثنا عبدالرزاق أنبأنا معمر عن أيوب عن حميد بن هلال العدوي عن أبي بردة قال: قدم على أبي موسى معاذ بن جبل باليمن فإذا رجل عنده قال ما هذا؟ قال رجل كان يهوديا فأسلم ثم تهود ونحن نريده على الإسلام منذ قال أحسبه شهرين فقال والله لا أقعد حتى تضربوا عنقه فضربت عنقه فقال قضى الله ورسوله أن من رجع عن دينه فاقتلوه أو قال \"من بدل دينه فاقتلوه\". وهذه القصة في الصحيحين بلفظ آخر. والأفضل والأولى أن يثبت المسلم على دينه ولو أفضى إلى قتله كما ذكر الحافظ ابن عساكر في ترجمة عبدالله بن حذافة السهمي أحد الصحابة أنه أسرته الروم فجاءوا به إلى ملكهم فقال له تنصر وأنا أشركك في ملكي وأزوجك ابنتي فقال له لو أعطيتني جميع ما تملك وجميع ما تملكه العرب على أن أرجع عن دين محمد صلى الله عليه وسلم طرفة عين ما فعلت فقال إذا أقتلك فقال أنت وذاك قال فأمر به فصلب وأمر الرماة فرموه قريبا من يديه ورجليه وهو يعرض عليه دين النصرانية فيأبى ثم أمر به فأنزل ثم أمر بقدر وفي رواية ببقرة من نحاس فأحميت وجاء بأسير من المسلمين فألقاه وهو ينظر فإذا هو عظام تلوح وعرض عليه فأبى فأمر به أن يلقى فيها فرفع في البكرة ليلقى فيها فبكى فطمع فيه ودعاه فقال إني إنما بكيت لأن نفسي إنما هي نفس واحدة تلقى في هذه القدر الساعة في الله فأحببت أن يكون لي بعدد كل شعرة في جسدي نفس تعذب هذا العذاب في الله. وفي بعض الروايات أنه سجنه ومنع منه الطعام والشراب أياما ثم أرسل إليه بخمر ولحم خنزير فلم يقربه ثم استدعاه فقال ما منعك أن تأكل؟ فقال أما إنه قد حل لي ولكن لم أكن لأشمتك بي فقال له الملك فقبل رأسي وأنا أطلقك فقال وتطلق معي جميع أسارى المسلمين؟ قال نعم فقبل رأسه فأطلقه وأطلق معه جميع أسارى المسلمين عنده فلما رجع قال عمر بن الخطاب رضي الله عنه حق على كل مسلم أن يقبل رأس عبدالله بن حذافة وأنا أبدأ فقام فقبل رأسه رضي الله عنهما."
    },
    {
      "ayah": 107,
      "surah": 16,
      "text": "لأنهم استحبوا الحياة الدنيا على الآخرة فأقدموا على ما أقدموا عليه من الردة لأجل الدنيا ولم يهد الله قلوبهم ويثبتهم على الدين الحق."
    },
    {
      "ayah": 108,
      "surah": 16,
      "text": "فطبع على قلوبهم فهم لا يعقلون بها شيئا ينفعهم وختم على سمعهم وأبصارهم فلا ينتفعون بها ولا أغنت عنهم شيئا فهم غافلون عما يراد بهم."
    },
    {
      "ayah": 109,
      "surah": 16,
      "text": "لا جرم أي لا بد ولا عجب أن من هذه صفته \"أنهم في الآخرة هم الخاسرون\" أي الذين خسروا أنفسهم وأهليهم يوم القيامة."
    },
    {
      "ayah": 11,
      "surah": 16,
      "text": "وقوله \"ينبت لكم به الزرع والزيتون والنخيل والأعناب ومن كل الثمرات\" أي يخرجها من الأرض بهذا الماء الواحد على اختلاف صنوفها وطعومها وألوانها وروائحها وأشكالها ولهذا قال \"إن في ذلك لآية لقوم يتفكرون\" أي دلالة وحجة على أنه لا إله إلا الله كما قال تعالى \"أمن خلق السموات والأرض وأنزل لكم من السماء ماء فأنبتنا به حدائق ذات بهجة ما كان لكم أن تنبتوا شجرها أإله مع الله بل هم قوم يعدلون\"."
    },
    {
      "ayah": 110,
      "surah": 16,
      "text": "هؤلاء صنف آخر كانوا مستضعفين بمكة مهانين في قومهم فوافقوهم على الفتنة ثم إنهم أمكنهم الخلاص بالهجرة فتركوا بلادهم وأهليهم وأموالهم ابتغاء رضوان الله وغفرانه وانتظموا في سلك المؤمنين وجاهدوا معهم الكافرين وصبروا فأخبر تعالى أنه من بعدها أي تلك الفعلة وهي الإجابة إلى الفتنة لغفور لهم رحيم بهم يوم معادهم."
    },
    {
      "ayah": 111,
      "surah": 16,
      "text": "\"يوم تأتي كل نفس تجادل \" أي تحاج \"عن نفسها\" ليس أحد يحاج عنها لا أب ولا ابن ولا أخ ولا زوجة \"وتوفي كل نفس ما عملت\" أي من خير وشر \"وهم لا يظلمون\" أي لا ينقص من ثواب الخير ولا يزاد على ثواب الشر ولا يظلمون نقيرا."
    },
    {
      "ayah": 112,
      "surah": 16,
      "text": "هذا مثل أريد به أهل مكة فإنها كانت أمنة مطمئنة مستقره يتخطف الناس من حولها ومن دخلها كان آمنا لا يخاف كما قال تعالى \"وقالوا إن نتبع الهدى معك نتخطف من أرضنا أولم نمكن لهم حرما آمنا يجبى إليه ثمرات كل شيء رزقا من لدنا\" وهكذا قال ههنا \"يأتيها رزقها رغدا\" أي هنيئا سهلا \"من كل مكان فكفرت بأنعم الله\" أي جحدت آلاء الله عليها وأعظمها بعثة محمد صلى الله عليه وسلم إليهم كما قال تعالى \"ألم تر إلى الذين بدلوا نعمة الله كفرا وأحلوا قومهم دار البوار جهنم يصلونها وبئس القرار\" ولهذا بدلهم الله بحاليهم الأولين خلافهما فقال \"فأذاقها الله لباس الجوع والخوف\" أي ألبسها وأذاقها الجوع بعد أن كان يجبى إليهم ثمرات كل شيء ويأتيها رزقها رغدا من كل مكان وذلك أنهم استعصوا على رسول الله صلى الله عليه وسلم وأبوا إلا خلافه فدعا عليهم بسبع كسبع يوسف فأصابتهم سنة أذهبت كل شيء لهم فأكلوا العلهز وهو وبر البعير يخلط بدمه إذا نحروه وقوله والخوف وذلك أنهم بدلوا بأمنهم خوفا من رسول الله صلى الله عليه وسلم وأصحابه حين هاجروا إلى المدينة من سطوته وسراياه وجيوشه."
    },
    {
      "ayah": 113,
      "surah": 16,
      "text": "وجعل كل ما لهم في دمار وسفال حتى فتحها الله على رسوله صلى الله عليه وسلم وذلك بسبب صنيعهم وبغيهم وتكذيبهم الرسول صلى الله عليه وسلم الذي بعثه الله فيهم منهم وامتن به عليهم في قوله \"لقد من الله على المؤمنين إذ بعث فيهم رسولا من أنفسهم\" الآية. وقوله تعالى \"فاتقوا الله يا أولى الألباب الذين آمنوا قد أنزل الله إليكم ذكرا رسولا\" الآية وقوله \"كما أرسلنا فيكم رسولا منكم يتلو عليكم آياتنا ويزكيكم ويعلمكم الكتاب والحكمة - إلى قوله - ولا تكفرون\" وكما أنه انعكس على الكافرين حالهم فخافوا بعد الأمن وجاعوا بعد الرغد فبدل الله المؤمنين من بعد خوفهم أمنا ورزقهم بعد العيلة وجعلهم أمراء الناس وحكامهم وسادتهم وقادتهم وأئمتهم. وهذا الذي قلناه من أن هذا المثل ضرب لأهل مكة قاله العوفي عن ابن عباس وإليه ذهب مجاهد وقتادة وعبدالرحمن بن زيد بن أسلم وحكاه مالك عن الزهري رحمهم الله وقال ابن جرير حدثني ابن عبدالرحيم البرقي حدثنا ابن أبي مريم حدثنا نافع بن يزيد حدثنا عبدالرحمن بن شريح أن عبدالكريم بن الحارث الحضرمي حدثه أنه سمع مشرح بن هاعان يقول سمعت سليم بن نمير يقول صدرنا من الحج مع حفصة زوج النبي صلى الله عليه وسلم وعثمان رضي الله عنه محصور بالمدينة فكانت تسأل عنه ما فعل؟ حتى رأت راكبين فأرسلت إليهما تسألهما فقالا قتل. فقالت حفصة والذي نفسي بيده إنها القرية - تعني المدينة - التي قال الله تعالى \"وضرب الله مثلا قرية كانت آمنة مطمئنة يأتيها رزقها رغدا من كل مكان فكفرت بأنعم الله\" قال ابن شريح وأخبرني عبيد الله بن المغيرة عمن حدثه أنه كان يقول إنها المدينة."
    },
    {
      "ayah": 114,
      "surah": 16,
      "text": "يقول تعالى آمرا عباده المؤمنين بأكل رزقه الحلال الطيب وبشكره على ذلك فإنه المنعم المتفضل به ابتداء الذي يستحق العبادة وحده لا شريك له."
    },
    {
      "ayah": 115,
      "surah": 16,
      "text": "ثم ذكر تعالى ما حرمه عليهم مما فيه مضرة لهم في دينهم ودنياهم من الميتة والدم ولحم الخنزير \"وما أهل لغير الله به\" أي ذبح على غير اسم الله ومع هذا \"فمن اضطر\" إليه أي احتاج من غير بغي ولا عدوان \"فإن الله غفور رحيم\" وقد تقدم الكلام على مثل هذه الآية في سورة البقرة بما فيه كفاية عن إعادته ولله الحمد."
    },
    {
      "ayah": 116,
      "surah": 16,
      "text": "ثم نهى تعالى عن سلوك سبيل المشركين الذين حللوا وحرموا بمجرد ما وصفوه واصطلحوا عليه من الأسماء بأراءهم من البحيرة والسائبة والوصيلة والحام وغير ذلك مما كان شرعا لهم ابتدعوه في جاهليتهم فقال \"ولا تقولوا لما تصف ألسنتكم الكذب هذا حلال وهذا حرام لتفتروا على الله الكذب\" ويدخل في هذا كل من ابتدع بدعة ليس له فيها مستند شرعي أو حلل شيئا مما حرم الله أو حرم شيئا مما أباح الله بمجرد رأيه وتشهيه وما في قوله \"لما تصف\" مصدرية أى ولا تقولوا الكذب لوصف ألسنتكم ثم توعد على ذلك فقال \"إن الذين يفترون على الله الكذب لا يفلحون\" أي في الدنيا ولا في الآخرة."
    },
    {
      "ayah": 117,
      "surah": 16,
      "text": "أما في الدنيا فمتاع قليل وأما في الآخرة فلهم عذاب أليم كما قال \"نمتعهم قليلا ثم نضطرهم إلى عذاب غليظ\" وقال \"إن الذين يفترون على الله الكذب لا يفلحون متاع في الدنيا ثم إلينا مرجعهم ثم نذيقهم العذاب الشديد بما كانوا يكفرون\"."
    },
    {
      "ayah": 118,
      "surah": 16,
      "text": "لما ذكر تعالى أنه حرم علينا الميتة والدم ولحم الخنزير وما أهل لغير الله به وإنما أرخص فيه عند الضرورة - وفي ذلك توسعة لهذه الأمة التي يريد الله بها اليسرى ولا يريد بها العسرى - ذكر سبحانه وتعالى ما كان حرمه على اليهود في شريعتهم قبل أن ينسخها وما كانوا فيه من الآصار والتضييق والأغلال والحرج فقال \"وعلى الذين هادوا حرمنا ما قصصنا عليك من قبل\" أي في سورة الأنعام في قوله \"وعلى الذين هادوا حرمنا كل ذي ظفر ومن البقر والغنم حرمنا عليهم شحومهما إلا ما حملت ظهورهما\" - إلى قوله- \"لصادقون\" ولهذا قال ههنا \"وما ظلمناهم\" أي فيما ضيقنا عليهم \"ولكن كانوا أنفسهم يظلمون\" أي فاستحقوا ذلك كقوله \"فبظلم من الذين هادوا حرمنا عليهم طيبات أحلت لهم وبصدهم عن سبيل الله كثيرا\"."
    },
    {
      "ayah": 119,
      "surah": 16,
      "text": "ثم أخبر تعالى تكرما وامتنانا في حق العصاة المؤمنين أن من تاب منهم إليه تاب عليه فقال \"ثم إن ربك للذين عملوا السوء بجهالة\" قال بعض السلف كل من عصى الله فهو جاهل \"ثم تابوا من بعد ذلك وأصلحوا\" أي أقلعوا عما كانوا فيه من المعاصي وأقبلوا على فعل الطاعات \"إن ربك من بعدها\" أي تلك الفعلة والزلة \"لغفور رحيم\"."
    },
    {
      "ayah": 12,
      "surah": 16,
      "text": "ينبه تعالى عباده على آياته العظام ومننه الجسام في تسخيره الليل والنهار يتعاقبان والشمس والقمر يدوران والنجوم الثوابت والسيارات في أرجاء السموات نورا وضياء ليهتدى بها في الظلمات وكل منها يسير في فلكه الذي جعله الله تعالى فيه يسير بحركة مقدرة لا يزيد عليها ولا ينقص عنها والجميع تحت قهره وسلطانه وتسخيره وتقديره وتسهيله كقوله \"إن ربكم الله الذي خلق السموات والأرض في ستة أيام ثم استوى على العرش يغشي الليل النهار يطلبه حثيثا والشمس والقمر والنجوم مسخرات بأمره ألا له الخلق والأمر تبارك الله رب العالمين\" ولهذا قال \"إن في ذلك لآيات لقوم يعقلون\" أي لدلالات على قدرته تعالى الباهرة وسلطانه العظيم لقوم يعقلون عن الله ويفهمون حججه."
    },
    {
      "ayah": 120,
      "surah": 16,
      "text": "يمدح تعالى عبده ورسوله وخليله إبراهيم إمام الحنفاء ووالد الأنبياء ويبرئه من المشركين ومن اليهودية والنصرانية فقال \"إن إبراهيم كان أمة قانتا لله حنيفا\" فأما الأمة فهو الإمام الذي يقتدى به والقانت هو الخاشع المطيع والحنيف المنحرف قصدا عن الشرك إلى التوحيد ولهذا قال \"ولم يك من المشركين\" قال سفيان الثوري عن سلمة بن كهيل عن مسلم البطين عن أبي العبيدين أنه سأل عبدالله بن مسعود عن الأمة القانت فقال الأمة معلم الخير والقانت المطيع لله ورسوله وعن مالك قال: قال ابن عمر: الأمة الذي يعلم الناس دينهم وقال الأعمش عن يحيى بن الجزار عن أبي العبيدين أنه جاء إلى عبدالله فقال من نسأل إذا لم نسألك؟ فكأن ابن مسعود رق له فقال أخبرني عن الأمة فقال الذي يعلم الناس الخير وقال الشعبي حدثني فروة بن نوفل الأشجعي قال: قال ابن مسعود إن معاذا كان أمة قانتا لله حنيفا فقلت في نفسي غلط أبو عبدالرحمن وقال إنما قال الله \"إن إبراهيم كان أمة\" فقال تدري ما الأمة وما القانت؟ قلت الله أعلم. فقال الأمة الذي يعلم الخير والقانت المطيع لله ورسوله وكذلك كان معاذ. وقد روي من غير وجه عن ابن مسعود أخرجه ابن جرير وقال مجاهد أمة أي أمة وحده والقانت المطيع وقال مجاهد أيضا كان إبراهيم أمة أي مؤمنا وحده والناس كلهم إذ ذاك كفار وقال قتادة كان إمام هدى والقانت المطيع لله."
    },
    {
      "ayah": 121,
      "surah": 16,
      "text": "وقوله \"شاكرا لأنعمه\" أي قائما بشكر نعم الله عليه كقوله تعالى \"وإبراهيم الذي وفي\" أي قام بجميع ما أمره الله تعالى به وقوله \"اجتباه\" أي اختاره واصطفاه كقوله \"ولقد آتينا إبراهيم رشده من قبل وكنا به عالمين\" ثم قال \"وهداه إلى صراط مستقيم\" وهو عبادة الله وحده لا شريك له على شرع مرضي."
    },
    {
      "ayah": 122,
      "surah": 16,
      "text": "وقوله \"وآتيناه في الدنيا حسنة\" أي جمعنا له خير الدنيا من جميع ما يحتاج المؤمن إليه في إكمال حياته الطيبة \"وإنه في الآخرة لمن الصالحين\".وقال مجاهد في قوله \"وآتيناه في الدنيا حسنة\" أي لسان صدق."
    },
    {
      "ayah": 123,
      "surah": 16,
      "text": "وقوله \"ثم أوحينا إليك أن اتبع ملة إبراهيم حنيفا\" أي ومن كماله وعظمته وصحة توحيده وطريقه أنا أوحينا إليك يا خاتم الرسل وسيد الأنبياء\" أن اتبع ملة إبراهيم حنيفا وما كان من المشركين \" كقوله في الأنعام \"قل إنني هداني ربي إلى صراط مستقيم دينا قيما ملة إبراهيم حنيفا وما كان من المشركين\"."
    },
    {
      "ayah": 124,
      "surah": 16,
      "text": "لا شك أن الله تعالى شرع في كل ملة يوما من الأسبوع يجتمع الناس فيه للعبادة فشرع تعالى لهذه الأمة يوم الجمعة لأنه اليوم السادس الذي أكمل الله فيه الخليقة واجتمعت فيه وتمت النعمة على عباده ويقال إن الله تعالى شرع ذلك لبني إسرائيل على لسان موسى فعدلوا عنه واختاروا السبت لأنه اليوم الذي لم يخلق فيه الرب شيئا من المخلوقات الذي كمل خلقها يوم الجمعة فألزمهم تعالى به في شريعة التوراة ووصاهم أن يتمسكوا به وأن يحافظوا عليه مع أمره إياهم بمتابعة محمد صلى الله عليه وسلم إذا بعثه وأخذ مواثيقهم وعهودهم على ذلك ولهذا قال تعالى \"إنما جعل السبت على الذين اختلفوا فيه\" قال مجاهد اتبعوه وتركوا الجمعة ثم إنهم لم يزالوا متمسكين به حتى بعث الله عيسى ابن مريم فيقال إنه حولهم إلى يوم الأحد ويقال إنه لم يترك شريعة التوراة إلا ما نسخ من بعض أحكامها وإنه لم يزل محافظا على السبت حتى رفع وإن النصارى بعده في زمن قسطنطين هم الذين تحولوا إلى يوم الأحد مخالفة لليهود وتحولوا إلى الصلاة شرقا عن الصخرة والله أعلم. وقد ثبت في الصحيحين من حديث عبدالرزاق عن معمر عن همام عن أبي هريرة رضي الله عنه أن رسول الله صلى الله عليه وسلم قال: \"نحن الآخرون السابقون يوم القيامة بيد أنهم أوتوا الكتاب من قبلنا ثم هذا يومهم الذي فرض عليهم فاختلفوا فيه فهدانا الله له فالناس لنا فيه تبع اليهود غدا والنصارى بعد غد\" لفظ البخاري. وعن أبي هريرة وحذيفة رضي الله عنهما قالا: قال رسول الله صلى الله عليه وسلم \"أضل الله عن الجمعة من كان قبلنا فكان لليهود يوم السبت وكان للنصارى يوم الأحد فجاء الله بنا فهدانا الله ليوم الجمعة فجعل الجمعة والسبت والأحد وكذلك هم تبع لنا يوم القيامة نحن الآخرون من أهل الدنيا والأولون يوم القيامة والمقضي بينهم قبل الخلائق\" رواه مسلم."
    },
    {
      "ayah": 125,
      "surah": 16,
      "text": "يقول تعالى آمرا رسوله محمدا صلى الله عليه وسلم أن يدعو الخلق إلى الله بالحكمة. قال ابن جرير وهو ما أنزله عليه من الكتاب والسنة والموعظة الحسنة أي بما فيه من الزواجر والوقائع بالناس ذكرهم بها ليحذروا بأس الله تعالى وقوله \"وجادلهم بالتي هي أحسن\" أي من احتاج منهم إلى مناظرة وجدال فليكن بالوجه الحسن برفق ولين وحسن خطاب كقوله تعالى \"ولا تجادلوا أهل الكتاب إلا بالتي هي أحسن إلا الذين ظلموا منهم\" الآية فأمره تعالى بلين الجانب كما أمر به موسى وهارون عليهما السلام حين بعثهما إلى فرعون في قوله \"فقولا له قولا لينا لعله يتذكر أو يخشى\" وقوله \"إن ربك هو أعلم بمن ضل عن سبيله\" الآية. أي قدم علم الشقي منهم والسعيد وكتب ذلك عنده وفرغ منه فادعهم إلى الله ولا تذهب نفسك على من ضل منهم حسرات فإنه ليس عليك هداهم إنما أنت نذير عليك البلاغ وعلينا الحساب \"إنك لا تهدي من أحببت\" \"ليس عليك هداهم ولكن الله يهدي من يشاء\"."
    },
    {
      "ayah": 126,
      "surah": 16,
      "text": "يأمر تعالى بالعدل في القصاص والمماثلة في استيفاء الحق كما قال عبد الرزاق عن الثوري عن خالد عن ابن سيرين أنه قال في قوله تعالى \"فعاقبوا بمثل ما عوقبتم به\" إن أخذ منكم رجل شيئا فخذوا مثله وكذا قال مجاهد وإبراهيم والحسن البصري وغيرهم واختاره ابن جرير. وقال ابن زيد كانوا قد أمروا بالصفح عن المشركين فأسلم رجال ذوو منعة فقالوا يا رسول الله لو أذن الله لنا لانتصرنا من هؤلاء الكلاب فنزلت هذه الآية ثم نسخ ذلك بالجهاد. وقال محمد بن إسحاق عن بعض أصحابه عن عطاء بن يسار قال نزلت سورة النحل كلها بمكة وهي مكية إلا ثلاث آيات من آخرها نزلت بالمدينة بعد أحد حين قتل حمزة رضي الله عنه ومثل به فقال رسول الله صلى الله عليه وسلم \"لئن أظهرني الله عليهم لأمثلن بثلاثين رجلا منهم\" فلما سمع المسلمون ذلك قالوا والله لئن ظهرنا عليهم لنمثلن بهم مثلة لم يمثلها أحد من العرب بأحد قط فأنزل الله \"إن عاقبتم فعاقبوا بمثل ما عوقبتم به\" إلى آخر السورة وهذا مرسل وفيه رجل مبهم لم يسم وقد روي هذا من وجه آخر متصل فقال الحافظ أبو بكر البزار حدثنا الحسن بن يحيى حدثنا عمرو بن عاصم حدثنا صالح المري عن سليمان التيمي عن أبي عثمان عن أبي هريرة رضي الله عنه أن رسول الله صلى الله عليه وسلم وقف على حمزة بن عبدالمطلب رضي الله عنه حين استشهد فنظر إلى منظر لم ينظر إلى منظر أوجع للقلب منه أو قال لقلبه فنظر إليه وقد مثل به فقال \"رحمة الله عليك إن كنت ما علمتك إلا وصولا للرحم فعولا للخيرات والله لولا حزن من بعدك عليك لسرني أن أتركك حتى يحشرك الله من بطون السباع - أو كلمة نحوها- أما والله على ذلك لأمثلن بسبعين كمثلتك\" فنزل جبريل عليه السلام على محمد صلى الله عليه وسلم بهذه السورة وقرأ \"وإن عاقبتم فعاقبوا بمثل ما عوقبتم به\" إلى آخر الآية فكفَّر رسول الله صلى الله عليه وسلم يعني عن يمينه وأمسك عن ذلك وهذا إسناد فيه ضعف لأن صالحا هو ابن بشير المري ضعيف عند الأئمة وقال البخاري هو منكر الحديث وقال الشعبي وابن جريج نزلت في قول المسلمين يوم أحد فيمن مثل بهم لنمثلن بهم فأنزل الله فيهم ذلك وقال عبدالله بن الإمام أحمد في مسند أبيه حدثنا هدبة بن عبدالوهاب المروزي حدثنا الفضل بن موسى حدثنا عيسى بن عبيد عن الربيع بن أنس عن أبي العالية عن أبي بن كعب قال: لما كان يوم أحد قتل من الأنصار ستون رجلا ومن المهاجرين ستة فقال أصحاب رسول الله صلى الله عليه وسلم لئن كان لنا يوم مثل هذا من المشركين لنمثلن بهم. فلما كان يوم الفتح قال رجل لا تعرف قريش بعد اليوم فنادى مناد: أن رسول الله صلى الله عليه وسلم قد أمن الأسود والأبيض إلا فلانا وفلانا- ناسا سماهم - فأنزل الله تبارك وتعالى \"وإن عاقبتم فعاقبوا بمثل ما عوقبتم به\" إلى آخر السورة فقال رسول الله صلى الله عليه وسلم \"نصبر ولا نعاقب\" وهذه الآية الكريمة لها أمثال في القران فإنها مشتملة على مشروعية العدل والندب إلى الفضل كما في قوله \"وجزاء سيئة سيئة مثلها\" ثم قال \"فمن عفا وأصلح فأجره على الله\" الآية. وقال \"والجروح قصاص\" ثم قال \"فمن تصدق به فهو كفارة له\" وقال في هذه الآية \"وإن عاقبتم فعاقبوا بمثل ما عوقبتم به\" ثم قال \"ولئن صبرتم لهو خير للصابرين\"."
    },
    {
      "ayah": 127,
      "surah": 16,
      "text": "وقوله تعالى \"واصبر وما صبرك إلا بالله\" تأكيد للأمر بالصبر وإخبار بأن ذلك لا ينال إلا بمشيئة الله وإعانته وحوله وقوته; ثم قال تعالى \"ولا تحزن عليهم\" أي على من خالفك فإن الله قدر ذلك \"ولا تك في ضيق\" أي غم \"مما يمكرون\" أي مما يجهدون أنفسهم في عداوتك وإيصال الشر إليك فإن الله كافيك وناصرك ومؤيدك ومظهرك ومظفرك بهم."
    },
    {
      "ayah": 128,
      "surah": 16,
      "text": "وقوله \"إن الله مع الذين اتقوا والذين هم محسنون\" أي معهم بتأييده ونصره ومعونته وهديه وسعيه وهذه معية خاصة كقوله \"إذ يوحي ربك إلى الملائكة أني معكم فثبتوا الذين آمنوا\" وقوله لموسى وهارون \"لا تخافا إنني معكما أسمع وأرى\" وقول النبي صلى الله عليه وسلم للصديق وهما في الغار \"لا تحزن إن الله معنا\" وأما المعية العامة فبالسمع والبصر والعلم كقوله تعالى \"وهو معكم أينما كنتم والله بما تعملون بصير\" وكقوله تعالى \"ألم تر أن الله يعلم ما في السموات وما في الأرض ما يكون من نجوى ثلاثة إلا هو رابعهم ولا خمسة إلا هو سادسهم ولا أدنى من ذلك ولا أكثر إلا هو معهم أينما كانوا\" وكما قال تعالى \"وما تكون في شأن وما تتلو منه من قرآن ولا تعملون من عمل إلا كنا عليكم شهودا\" الآية; ومعنى \"الذين اتقوا\" أي تركوا المحرمات \"الذين هم محسنون\" أي فعلوا الطاعات فهؤلاء الله يحفظهم ويكلؤهم وينصرهم ويؤيدهم ويظفرهم على أعدائهم ومخالفيهم وقال ابن أبي حاتم ثنا أبي ثنا محمد بن بشار ثنا أبو أحمد الزبير ثنا مسعر عن ابن عون عن محمد بن حاطب قال كان عثمان رضي الله عنه من الذين آمنوا والذين اتقوا والذين هم محسنون. آخر تفسير سورة النحل ولله الحمد والمنة وصلى الله على محمد وعلى آله وصحبه وسلم تسليما."
    },
    {
      "ayah": 13,
      "surah": 16,
      "text": "وقوله \"وما ذرأ لكم في الأرض مختلفا ألوانه\" لما نبه تعالى على معالم السموات نبه على ما خلق في الأرض من الأمور العجيبة والأشياء المختلفة من الحيوانات والمعادن والنباتات والجمادات على اختلاف ألوانها وأشكالها وما فيها من المنافع والخواص \"إن في ذلك لآية لقوم يذكرون\" أي آلاء الله ونعمه فيشكرونها."
    },
    {
      "ayah": 14,
      "surah": 16,
      "text": "يخبر تعالى عن تسخيره البحر المتلاطم الأمواج ويمتن على عباده بتذليله لهم وتيسيرهم للركوب فيه وجعله السمك والحيتان فيه وإحلاله لعباده لحمها حيها وميتها في الحل والإحرام وما يخلقه فيه من اللآلئ والجواهر النفيسة وتسهيله للعباد استخراجهم من قراره حلية يلبسونها وتسخيره البحر لحمل السفن التي تمخره أي تشقه وقيل تمخر الرياح وكلاهما صحيح وقيل تمخره بجؤجئها وهو صدرها المسنم الذي أرشد العباد إلى صنعتها وهداهم إلى ذلك إرثا عن أبيهم نوح عليه السلام فإنه أول من ركب السفن وله كان تعليم صنعتها ثم أخذها الناس عنه قرنا بعد قرن وجيلا بعد جيل يسيرون من قطر إلى قطر ومن بلد إلى بلد ومن إقليم إلى إقليم لجلب ما هناك إلى هنا وما هنا إلى هناك ولهذا قال تعالى \"ولتبتغوا من فضله ولعلكم تشكرون\" أى نعمه وإحسانه. وقد قال الحافظ أبو بكر البزار في مسنده وجدت في كتابي عن محمد بن معاوية البغدادي حدثنا عبدالرحمن بن عبدالله بن عمرو عن سهل بن أبى صالح عن أبيه عن أبي هريرة قال: كلم الله البحر الغربي وكلم البحر الشرقي فقال للبحر الغربي إني حامل فيك عبادا من عبادي فكيف أنت صانع فيهم؟ قال أغرقهم فقال بأسك في نواحيك واحملهم على يدي وحرمت الحلية والصيد وكلم البحر الشرقي فقال: إنى حامل فيك عبادا من عبادي فما أنت صانع بهم؟ فقال: أحملهم على يدي وأكون لهم كالوالدة لولدها فأثابه الحلية والصيد ثم قال البزار لا نعلم من رواه عن سهل غير عبدالرحمن بن عبدالله بن عمرو وهو منكر الحديث وقد رواه سهل عن النعمان بن أبي عياش عن عبدالله بن عمرو موقوفا."
    },
    {
      "ayah": 15,
      "surah": 16,
      "text": "ثم ذكر تعالى الأرض وما ألقى فيها من الرواسي الشامخات والجبال الراسيات لتقر الأرض ولا تميد أي تضطرب بما عليها من الحيوانات فلا يهنأ لهم عيش بسبب ذلك ولهذا قال \"والجبال أرساها\" وقال عبدالرزاق: أنبأنا معمر عن قتادة سمعت الحسن يقول: لما خلقت الأرض كانت تميد فقالوا ما هذه بمقرة على ظهرها أحدا فأصبحوا وقد خلقت الجبال فلم تدر الملائكة مم خلقت الجبال\" وقال سعيد عن قتادة عن الحسن عن قيس بن عبادة أن الله لما خلق الأرض جعلت تمور فقالت الملائكة: ما هذه بمقرة على ظهرها أحدا فأصبحت صبحا وفيها رواسيها. وقال ابن جرير: حدثني المثنى حدثني حجاج بن منهال حدثنا حماد عن عطاء بن السائب عن عبدالله بن حبيب عن علي بن أبي طالب رضي الله عنه قال لما خلق الله الأرض فمضت وقالت أي رب تجعل علي بني آدم يعملون الخطايا ويجعلون علي الخبث؟ قال فأرسى الله فيها من الجبال ما ترون وما لا ترون فكان إقرارها كاللحم يترجرج. وقوله \"وأنهارا وسبلا\" أي جعل فيها أنهارا تجري من مكان إلى مكان آخر رزقا للعباد ينبع في موضع وهو رزق لأهل موضع آخر فيقطع البقاع والبراري والقفار ويخترق الجبال والآكام فيصل إلى البلد الذي سخر لأهله وهي سائرة في الأرض يمنة ويسرة وجنوبا وشمالا وشرقا وغربا ما بين صغار وكبار وأودية تجري حينا وتنقطع في وقت وما بين نبع وجميع وقوي السير وبطئه بحسب ما أراد وقدر وسخر ويسر فلا إله إلا هو ولا رب سواه. وكذلك جعل فيها سبلا أي طرقا يسلك فيها من بلاد إلى بلاد حتى أنه تعالى ليقطع الجبل حتى يكون ما بينهما ممرا ومسلكا كما قال تعالى \"وجعلنا فيها فجاجا سبلا\" الآية."
    },
    {
      "ayah": 16,
      "surah": 16,
      "text": "وقوله \"وعلامات\" أي دلائل من جبال كبار وآكام صغار ونحو ذلك يستدل بها المسافرون برا وبحرا إذا ضلوا الطرق. وقوله \"وبالنجم هم يهتدون\" أي في ظلام الليل قاله ابن عباس. وعن مالك في قوله \"وعلامات وبالنجم هم يهتدون\" يقول النجوم وهي الجبال."
    },
    {
      "ayah": 17,
      "surah": 16,
      "text": "ثم نبه تعالى على عظمته وأنه لا تنبغي العبادة إلا له دون ما سواه من الأوثان التي لا تخلق شيئا بل هم يخلقون ولهذا قال \"أفمن يخلق كمن لا يخلق أفلا تذكرون\"."
    },
    {
      "ayah": 18,
      "surah": 16,
      "text": "ثم نبههم على كثرة نعمه عليهم وإحسانه إليهم فقال \"وإن تعدوا نعمة الله لا تحصوها إن الله لغفور رحيم\" أي يتجاوز عنكم ولو طالبكم بشكر نعمه لعجزتم عن القيام بذلك ولو أمركم به لضعفتم وتركتم ولو عذبكم لعذبكم وهو غير ظالم لكم ولكنه غفور رحيم يغفر الكثير ويجازي على اليسير; وقال ابن جرير: يقول إن الله لغفور لما كان منكم من تقصير في شكر بعض ذلك إذا تبتم وأنبتم إلى طاعته واتباع مرضاته رحيم بكم لا يعذبكم بعد الإنابة والتوبة."
    },
    {
      "ayah": 19,
      "surah": 16,
      "text": "يخبر تعالى أنه يعلم الضمائر والسرائر كما يعلم الظواهر وسيجزي كل عامل بعمله يوم القيامة إن خيرا فخير وإن شرا فشر."
    },
    {
      "ayah": 2,
      "surah": 16,
      "text": "يقول تعالى \"ينزل الملائكة بالروح\" أي الوحي كقوله \"وكذلك أوحينا إليك روحا من أمرنا ما كنت تدري ما الكتاب ولا الإيمان ولكن جعلناه نورا نهدي به من نشاء من عبادنا\" وقوله \"على من يشاء من عباده\" وهم الأنبياء كما قال تعالى \"الله أعلم حيث يجعل رسالته\" وقال \"الله يصطفي من الملائكة رسلا ومن الناس\" وقال \"يلقي الروح من أمره على من يشاء من عباده لينذر يوم التلاق يوم هم بارزون لا يخفى على الله منهم شيء لمن الملك اليوم لله الواحد القهار\" وقوله \"أن أنذروا\" أي لينذروا \"أنه لا إله إلا أنا فاتقون\" أي فاتقوا عقوبتي لمن خالف أمري وعبد غيري."
    },
    {
      "ayah": 20,
      "surah": 16,
      "text": "ثم أخبر أن الأصنام التي يدعونها من دون الله لا يخلقون شيئا وهم يخلقون كما قال الخليل \"أتعبدون ما تنحتون والله خلقكم وما تعملون\"."
    },
    {
      "ayah": 21,
      "surah": 16,
      "text": "وقوله \"أموات غير أحياء\" أي هي جمادات لا أرواح فيها فلا تسمع ولا تبصر ولا تعقل \"وما يشعرون أيان يبعثون\" أي لا يدرون متى تكون الساعة فكيف يرتجى عند هذه نفع أو ثواب أو جزاء؟ إنما يرجى ذلك من الذي يعلم كل شيء وهو خالق كل شيء."
    },
    {
      "ayah": 22,
      "surah": 16,
      "text": "يخبر تعالى أنه لا إله إلا هو الواحد الأحد الفرد الصمد وأخبر أن الكافرين تنكر قلوبهم ذلك كما أخبر عنهم متعجبين من ذلك \"أجعل الآلهة إلها واحدا إن هذا لشيء عجاب\" وقال تعالى \"وإذا ذكر الله وحده اشمأزت قلوب الذين لا يؤمنون بالآخرة وإذا ذكر الذين من دونه إذا هم يستبشرون\" وقوله \"وهم مستكبرون\" أي عن عبادة الله مع إنكار قلوبهم لتوحيده كما قال \"إن الذين يستكبرون عن عبادتي سيدخلون جهنم داخرين\"."
    },
    {
      "ayah": 23,
      "surah": 16,
      "text": "ولهذا قال ههنا \"لا جرم\" أي حقا \"أن الله يعلم ما يسرون وما يعلنون\" أي وسيجزيهم على ذلك أتم الجزاء \"إنه لا يحب المستكبرين\"."
    },
    {
      "ayah": 24,
      "surah": 16,
      "text": "يقول تعالى وإذا قيل لهؤلاء المكذبين \"ماذا أنزل ربكم قالوا\" معرضين عن الجواب \"أساطير الأولين\" أي لم ينزل شيئا إنما هذا الذي يتلى علينا أساطير الأولين أي مأخوذ من كتب المتقدمين كما قال تعالى \"وقالوا أساطير الأولين اكتتبها فهي تملى عليه بكرة وأصيلا\" أي يفترون على الرسول ويقولون أقوالا متضادة مختلفة كلها باطلة كما قال تعالى \"انظر كيف ضربوا لك الأمثال فضلوا فلا يستطيعون سبيلا\" وذلك أن كل من خرج عن الحق فمهما قال أخطأ وكانوا يقولون ساحر وشاعر وكاهن ومجنون ثم استقر أمرهم إلى ما اختلقه لهم شيخهم الوحيد المسمى بالوليد بن المغيرة المخزومي لما \"فكر وقدر فقتل كيف قدر ثم قتل كيف قدر ثم نظر ثم عبس وبسر ثم أدبر واستكبر فقال إن هذا إلا سحر يؤثر\" أي ينقل ويحكى فتفرقوا عن قوله ورأيه قبحهم الله."
    },
    {
      "ayah": 25,
      "surah": 16,
      "text": "قال الله تعالى \"ليحملوا أوزارهم كاملة يوم القيامة ومن أوزار الذين يضلونهم بغير علم\" أي إنما قدرنا عليهم أن يقولوا ذلك ليتحملوا أوزارهم ومن أوزار الذين يتبعونهم ويوافقونهم أي يصير عليهم خطيئة ضلالهم في أنفسهم وخطيئة إغوائهم لغيرهم واقتداء أولئك بهم كما جاء في الحديث \"من دعا إلى هدى كان له من الأجر مثل أجور من اتبعه لا ينقص ذلك من أجورهم شيئا ومن دعا إلى ضلالة كان عليه من الإثم مثل آثام من اتبعه لا ينقص ذلك من آثامهم شيئا\" وقال تعالى \"وليحملن أثقالهم وأثقالا مع أثقالهم وليسئلن يوم القيامة عما كانوا يفترون\" وهكذا روى العوفي عن ابن عباس في الآية \"ليحملوا أوزارهم كاملة يوم القيامة ومن أوزار الذين يضلونهم بغير علم\" أنها كقوله \"وليحملن أثقالهم وأثقالا مع أثقالهم\" وقال مجاهد: يحملون أثقالهم ذنوبهم وذنوب من أطاعهم ولا يخفف عمن أطاعهم من العذاب شيئا."
    },
    {
      "ayah": 26,
      "surah": 16,
      "text": "قال العوفي عن ابن عباس في قوله \"قد مكر الذين من قبلهم\" قال هو النمروذ الذي بني الصرح قال ابن أبي حاتم وروي عن مجاهد نحوه وقال عبدالرزاق عن معمر عن زيد بن أسلم أول جبار كان في الأرض النمروذ فبعث الله عليه بعوضة فدخلت في منخره فمكث أربعمائة سنة يضرب رأسه بالمطارق وأرحم الناس به من جمع يديه فضرب بهما رأسه وكان جبارا أربعمائة سنة فعذبه الله أربعمائة سنة كملكه ثم أماته وهو الذي بنى الصرح إلى السماء الذي قال الله تعالى \"فأتى الله بنيانهم من القواعد\" وقال آخرون بل هو بختنصر وذكروا من المكر الذي حكاه الله ههنا كما قال في سورة إبراهيم \"وإن كان مكرهم لتزول منه الجبال\" وقال آخرون هذا من باب المثل لإبطال ما صنعه هؤلاء الذين كفروا بالله وأشركوا في عبادته غيره كما قال نوح عليه السلام \"ومكروا مكرا كبارا\" أي احتالوا في إضلال الناس بكل حيلة وأمالوهم إلى شركهم بكل وسيلة كما يقول لهم أتباعهم يوم القيامة \"بل مكر الليل والنهار إذ تأمروننا أن نكفر بالله ونجعل له أندادا\" الآية وقوله \"فأتى الله بنيانهم من القواعد\" أي اجتثه من أصله وأبطل عملهم كقوله تعالى \"كلما أوقدوا نارا للحرب أطفأها الله\" وقوله \"فأتاهم الله من حيث لم يحتسبوا وقذف في قلوبهم الرعب يخربون بيوتهم بأيديهم وأيدي المؤمنين فاعتبروا يا أولي الأبصار\" وقال الله ههنا \"فأتي الله بنيانهم من القواعد فخر عليهم السقف من فوقهم وأتاهم العذاب من حيث لا يشعرون ثم يوم القيامة يخزيهم\"."
    },
    {
      "ayah": 27,
      "surah": 16,
      "text": "يظهر فضائحهم وما كانت تجنه ضمائرهم فجعله علانية كقوله تعالى \"يوم تبلى السرائر\" أي تظهر وتشتهر كما في الصحيحين عن ابن عمر قال: قال رسول الله صلى الله عليه وسلم \"ينصب لكل غادر لواء يوم القيامة عند استه بقدر غدرته فيقال هذه غدرة فلان بن فلان\" وهكذا هؤلاء يظهر للناس ما كانوا يسرونه من المكر ويخزيهم الله على رءوس الخلائق ويقول لهم الرب تبارك وتعالى مقرعا لهم وموبخا \"أين شركائي الذين كنتم تشاقون فيهم\" تحاربون وتعادون في سبيلهم أين هم عن نصركم وخلاصكم ههنا؟ \"هل ينصرونكم أو ينتصرون\" \"فما له من قوة ولا ناصر\" فإذا توجهت عليهم الحجة وقامت عليهم الدلالة وحقت عليهم الكلمة وسكتوا عن الاعتذار حين لا فرار \"قال الذين أوتوا العلم\" وهم السادة في الدنيا والآخرة والمخبرون عن الحق في الدنيا والآخرة فيقولون حينئذ \"إن الخزي اليوم والسوء على الكافرين\" أي الفضيحة والعذاب محيط اليوم بمن كفر بالله وأشرك به ما لا يضره وما لا ينفعه."
    },
    {
      "ayah": 28,
      "surah": 16,
      "text": "يخبر تعالى عن حال المشركين الظالمي أنفسهم عند احتضارهم ومجيء الملائكة إليهم لقبض أرواحهم الخبيثة \"فألقوا السلم\" أي أظهروا السمع والطاعة والانقياد قائلين \"ما كنا نعمل من سوء\" كما يقولون يوم المعاد \"والله ربنا ما كنا مشركين\"\" يوم يبعثهم الله جميعا فيحلفون له كما يحلفون لكم \"قال الله مكذبا لهم في قيلهم ذلك \"بلى إن الله عليم بما كنتم تعملون فادخلوا أبواب جهنم خالدين فيها فلبئس مثوى المتكبرين\"."
    },
    {
      "ayah": 29,
      "surah": 16,
      "text": "أي بئس المقيل والمقام والمكان من دار هوان لمن كان متكبرا عن آيات الله واتباع رسله وهم يدخلون جهنم من يوم مماتهم بأرواحهم وينال أجسادهم في قبورها من حرها وسمومها فإذا كان يوم القيامة سلكت أرواحهم في أجسادهم وخلدت في نار جهنم \"لا يقضى عليهم فيموتوا ولا يخفف عنهم من عذابها\" كما قال الله تعالى \"النار يعرضون عليها غدوا وعشيا ويوم تقوم الساعة أدخلوا آل فرعون أشد العذاب\"."
    },
    {
      "ayah": 3,
      "surah": 16,
      "text": "يخبر تعالى عن خلقه العالم العلوي وهو السموات والعالم السفلي وهو الأرض بما حوت وأن ذلك مخلوق بالحق لا للعبث بل \"ليجزي الذين أساءوا بما عملوا ويجزي الذين أحسنوا بالحسنى\" ثم نزه نفسه عن شرك من عبد معه غيره وهو المستقل بالخلق وحده لا شريك له فلهذا يستحق أن يعبد وحده لا شريك له."
    },
    {
      "ayah": 30,
      "surah": 16,
      "text": "هذا خبر عن السعداء بخلاف ما أخبر به عن الأشقياء فإن أولئك قيل لهم \"ماذا أنزل ربكم\" قالوا معرضين عن الجواب لم ينزل شيئا إنما هذا أساطير الأولين وهؤلاء قالوا خيرا أي أنزل خيرا أي رحمة وبركة لمن اتبعه وآمن به ثم أخبر عما وعد الله عباده فيما أنزله على رسله فقال\" للذين أحسنوا في هذه الدنيا حسنة \"الآية كقوله تعالى \"من عمل صالحا من ذكر أو أنثى وهو مؤمن فلنحيينه حياة طيبة ولنجزينهم أجرهم بأحسن ما كانوا يعملون\" أي من أحسن عمله في الدنيا أحسن الله إليه عمله في الدنيا والآخرة ثم أخبر بأن دار الآخرة خير أي من الحياة الدنيا والجزاء فيها أتم من الجزاء في الدنيا كقوله \"وقال الذين أوتوا العلم ويلكم ثواب الله خير\" الآية وقال تعالى \"وما عند الله خير للأبرار\" وقال تعالى \"والآخرة خير وأبقى\" وقال لرسوله صلى الله عليه وسلم \"وللآخرة خير لك من الأولى\" ثم وصف الدار الآخرة فقال \"ولنعم دار المتقين\"."
    },
    {
      "ayah": 31,
      "surah": 16,
      "text": "وقوله \"جنات عدن\" بدل من دار المتقين أي لهم في الآخرة جنات عدن أي مقام يدخلونها \"تجري من تحتها الأنهار\" أي بين أشجارها وقصورها \"لهم فيها ما يشاءون\" كقوله تعالى \"وفيها ما تشتهيه الأنفس وتلذ الأعين وأنتم فيها خالدون\" وفي الحديث \"إن السحابة لتمر بالملإ من أهل الجنة وهم جلوس على شرابهم فلا يشتهي أحد منهم شيئا إلا أمطرته عليه حتى إن منهم لمن يقول أمطرينا كواعب أترابا فيكون ذلك\" \"كذلك يجزي الله المتقين\" أي كذلك يجزي الله كل من آمن به واتقاه وأحسن عمله."
    },
    {
      "ayah": 32,
      "surah": 16,
      "text": "ثم أخبر تعالى عن حالهم عند الاحتضار أنهم طيبون أي مخلصون من الشرك والدنس وكل سوء وأن الملائكة تسلم عليهم وتبشرهم بالجنة كقوله تعالى \"إن الذين قالوا ربنا الله ثم استقاموا تتنزل عليهم الملائكة أن لا تخافوا ولا تحزنوا وأبشروا بالجنة التي كنتم توعدون نحن أولياؤكم في الحياة الدنيا وفي الآخرة ولكم فيها ما تشتهي أنفسكم ولكم فيها ما تدعون نزلا من غفور رحيم\" وقد قدمنا الأحاديث الواردة في قبض روح المؤمن وروح الكافر عند قوله تعالى \"يثبت الله الذين آمنوا بالقول الثابت في الحياة الدنيا وفي الآخرة ويضل الله الظالمين ويفعل الله ما يشاء\"."
    },
    {
      "ayah": 33,
      "surah": 16,
      "text": "يقول تعالى مهددا للمشركين على تماديهم في الباطل واغترارهم بالدنيا هل ينتظر هؤلاء إلا الملائكة أن تأتيهم لقبض أرواحهم قاله قتادة \"أو يأتي أمر ربك\" أي يوم القيامة وما يعاينونه من الأهوال وقوله \"كذلك فعل الذين من قبلهم\" أي هكذا تمادى في شركهم أسلافهم ونظراؤهم وأشباههم من المشركين حتى ذاقوا بأس الله وحلوا فيما هم فيه من العذاب والنكال \"وما ظلمهم الله\" لأنه تعالى أعذر إليهم وأقام حججه عليهم بإرسال رسله وإنزال كتبه \"ولكن كانوا أنفسهم يظلمون\" أي بمخالفة الرسل والتكذيب بما جاءوا به."
    },
    {
      "ayah": 34,
      "surah": 16,
      "text": "فلهذا أصابتهم عقوبة الله على ذلك \"وحاق بهم\" أي أحاط بهم من العذاب الأليم \"ما كانوا به يستهزئون\" أي يسخرون من الرسل إذا توعدوهم بعقاب الله فلهذا يقال لهم يوم القيامة \"هذه النار التي كنتم بها تكذبون\"."
    },
    {
      "ayah": 35,
      "surah": 16,
      "text": "يخبر تعالى عن اغترار المشركين بما هم فيه من الإشراك واعتذارهم محتجين بالقدر بقولهم \"لو شاء الله ما عبدنا من دونه من شيء نحن ولا آباؤنا ولا حرمنا من دونه من شيء\" أي من البحائر والسوائب والوصائل وغير ذلك مما كانوا ابتدعوه واخترعوه من تلقاء أنفسهم ما لم ينزل به سلطانا ومضمون كلامهم أنا لو كان تعالى كارها لما فعلنا لأنكره علينا بالعقوبة ولما مكننا منه قال الله تعالى رادا عليهم شبهتهم \"فهل على الرسل إلا البلاغ المبين\" أي ليس الأمر كما تزعمون أنه لم ينكره عليكم بل قد أنكره عليكم أشد الإنكار ونهاكم عنه آكد النهي."
    },
    {
      "ayah": 36,
      "surah": 16,
      "text": "وبعث في كل أمة أي في كل قرن وطائفة من الناس رسولا وكلهم يدعون إلى عبادة الله وينهون عن عبادة ما سواه \"أن اعبدوا الله واجتنبوا الطاغوت\" فلم يزل تعالى يرسل إلى الناس الرسل بذلك منذ حدث الشرك في بني آدم في قوم نوح الذين أرسل إليهم نوح وكان أول رسول بعثه الله إلى أهل الأرض إلى أن ختمهم بمحمد صلى الله عليه وسلم الذي طبقت دعوته الإنس والجن في المشارق والمغارب وكلهم كما قال الله تعالى \"وما أرسلنا من قبلك من رسول إلا نوحي إليه أنه لا إله إلا أنا فاعبدون\" وقوله تعالى \"واسأل من أرسلنا من قبلك من رسلنا أجعلنا من دون الرحمن آلهة يُعبدون\" وقال تعالى في هذه الآية الكريمة \"ولقد بعثنا في كل أمة رسولا أن اعبدوا الله واجتنبوا الطاغوت\" فكيف يسوغ لأحد من المشركين بعد هذا أن يقول \"لو شاء الله ما عبدنا من دونه من شيء\" فمشيئته تعالى الشرعية عنهم منتفية لأنه نهاهم عن ذلك على ألسنة رسله وأما مشيئته الكونية وهي تمكينهم من ذلك قدرا فلا حجة لهم فيها لأنه تعالى خلق النار وأهلها من الشياطين والكفرة وهو لا يرضى لعباده الكفر وله في ذلك حجة بالغة وحكمة قاطعة ثم إنه تعالى قد أخبر أنه أنكر عليهم بالعقوبة في الدنيا بعد إنذار الرسل فلهذا قال \"فمنهم من هدى الله ومنهم من حقت عليه الضلالة فسيروا في الأرض فانظروا كيف كان عاقبة المكذبين\" أي اسألوا عما كان من أمر من خالف الرسل وكذب الحق كيف \"دمر الله عليهم وللكافرين أمثالها\" فقال \"ولقد كذب الذين من قبلهم فكيف كان نكير\"."
    },
    {
      "ayah": 37,
      "surah": 16,
      "text": "ثم أخبر الله تعالى رسوله صلى الله عليه وسلم أن حرصه على هدايتهم لا ينفعهم إذا كان الله قد أراد إضلالهم كقوله تعالى \"ومن يرد الله فتنته فلن تملك له من الله شيئا\" وقال نوح لقومه \"ولا ينفعكم نصحي إن أردت أن أنصح لكم إن كان الله يريد أن يغويكم\" وقال في هذه الآية الكريمة \"إن تحرص على هداهم فإن الله لا يهدي من يضل\" كما قال الله \"ومن يضلل الله فلا هادي له ويذرهم في طغيانهم يعمهون\" وقال تعالى \"إن الذين حقت عليهم كلمة ربك لا يؤمنون ولو جاءتهم كل آية حتى يروا العذاب الأليم\" وقوله \"فإن الله\" أى شأنه وأمره أنه ما شاء كان وما لم يشأ لم يكن فلهذا قال \"لا يهدي من يضل\" أي من أضله فمن ذا الذي يهديه من بعد الله؟ أي لا أحد \"وما لهم من ناصرين\" أي ينقذونهم من عذابه ووثاقه \"ألا له الخلق والأمر تبارك الله رب العالمين\"."
    },
    {
      "ayah": 38,
      "surah": 16,
      "text": "يقول تعالى مخبرا عن المشركين أنهم حلفوا فأقسموا بالله جهد أيمانهم أي اجتهدوا في الحلف وغلظوا الأيمان على أنه لا يبعث الله من يموت أي استبعدوا ذلك وكذبوا الرسل في إخبارهم لهم بذلك وحلفوا على نقيضه فقال تعالى مكذبا لهم وردا عليهم \"بلى\" أي بلى سيكون ذلك \"وعدا عليه حقا\" أي لا بد منه \"ولكن أكثر الناس لا يعلمون\" أي فلجهلهم يخالفون الرسل ويقعون في الكفر."
    },
    {
      "ayah": 39,
      "surah": 16,
      "text": "ثم ذكر تعالى حكمته في المعاد وقيام الأجسام يوم التناد فقال \"ليبين لهم\" أي للناس \"الذي يختلفون فيه\" أي من كل شيء \"ليجزي الذين أساءوا بما عملوا ويجزي الذين أحسنوا بالحسنى\" \"وليعلم الذين كفروا أنهم كانوا كاذبين\" أي في أيمانهم وأقسامهم لا يبعث الله من يموت ولهذا يدعُّون يوم القيامة إلى نار جهنم دعًّا وتقول لهم الزبانية \"هذه النار التي كنتم بها تكذبون أفسحر هذا أم أنتم لا تبصرون اصلوها فاصبروا أو لا تصبروا سواء عليكم إنما تجزون ما كنتم تعملون\"."
    },
    {
      "ayah": 4,
      "surah": 16,
      "text": "ثم نبه على خلق جنس الإنسان من نطفة أي مهينة ضعيفة فلما استقل ودرج إذا هو يخاصم ربه تعالى ويكذبه ويحارب رسله وهو إنما خلق ليكون عبدا لا ضدا كقوله تعالى \"وهو الذي خلق من الماء بشرا فجعله نسبا وصهرا وكان ربك قديرا ويعبدون من دون الله ما لا ينفعهم ولا يضرهم وكان الكافر على ربه ظهيرا\" وقوله \"أولم ير الإنسان أنا خلقناه من نطفة فإذا هو خصيم مبين وضرب لنا مثلا ونسي خلقه قال من يحيي العظام وهي رميم قل يحييها الذي أنشأها أول مرة وهو بكل خلق عليم\" وفي الحديث الذي رواه الإمام أحمد وابن ماجه عن بشر بن جحاش قال: بصق رسول الله في كفه ثم قال \"يقول الله تعالى: ابن آدم أنى تعجزني وقد خلقتك من مثل هذه حتى إذا سويتك فعدلتك مشيت بين برديك وللأرض منك وئيد فجمعت ومنعت حتى إذا بلغت الحلقوم قلت أتصدق؟ وأنى أوان الصدقة؟ \"."
    },
    {
      "ayah": 40,
      "surah": 16,
      "text": "ثم أخبر تعالى عن قدرته على ما يشاء وأنه لا يعجزه شيء في الأرض ولا في السماء وإنما أمره إذا أراد شيئا أن يقول له كن فيكون والمعاد من ذلك إذا أراد كونه فإنما يأمر به مرة واحدة فيكون كما يشاء كقوله \"وما أمرنا إلا واحدة كلمح بالبصر\" وقال \"ما خلْقكم ولا بعْثكم إلا كنفس واحدة\" وقال في هذه الآية الكريمة \"إنما قولنا لشيء إذا أردناه أن نقول له كن فيكون\" أي أن نأمر به مرة واحدة فإذا هو كائن كما قال الشاعر: إذا ما أراد الله أمرا فإنما يقول له كن فيكون أي أنه تعالى لا يحتاج إلى تأكيد فيما يأمر به فإنه تعالى لا يمانع ولا يخالف لأنه الواحد القهار العظيم الذي قهر سلطانه وجبروته وعزته كل شيء فلا إله إلا هو ولا رب سواه وقال ابن أبي حاتم: ذكر الحسن بن محمد بن الصباح حدثنا حجاج عن ابن جريج أخبرني عطاء أنه سمع أبا هريرة يقول: \"قال الله تعالى شتمني ابن آدم ولم يكن ينبغي له ذلك وكذبني ابن آدم ولم يكن ينبغي له ذلك فأما تكذيبه إياي فقال \"وأقسموا بالله جهد أيمانهم لا يبعث الله من يموت\" قال وقلت \"بلى وعدا عليه حقا ولكن أكثر الناس لا يعلمون\" وأما شتمه إياي فقال \"إن الله ثالث ثلاثة\" وقلت \"قل هو الله أحد الله الصمد لم يلد ولم يولد ولم يكن له كفوا أحد\" هكذا ذكره موقوفا وهو في الصحيحين مرفوع بلفظ آخر."
    },
    {
      "ayah": 41,
      "surah": 16,
      "text": "يخبر تعالى عن جزائه للمهاجرين في سبيله ابتغاء مرضاته الذين فارقوا الدار والإخوان والخلان رجاء ثواب الله وجزائه. ويحتمل أن يكون سبب نزولها في مهاجرة الحبشة الذي اشتد أذي قومهم لهم بمكة حتى خرجوا من بين أظهرهم إلى بلاد الحبشة ليتمكنوا من عبادة ربهم ومن أشرافهم عثمان بن عفان ومعه زوجته رقية بنت رسول الله صلى الله عليه وسلم وجعفر بن أبي طالب ابن عم الرسول وأبو سلمة بن عبدالأسود في جماعة قريب من ثمانين ما بين رجل وامرأة صديق وصديقة رضي الله عنهم وأرضاهم وقد فعل فوعدهم تعالى بالمجازاة الحسنة في الدنيا والآخرة فقال \"لنبوئنهم في الدنيا حسنة\" قال ابن عباس والشعبي وقتادة: المدينة; وقيل الرزق الطيب قاله مجاهد. ولا منافاة بين القولين فإنهم تركوا مساكنهم وأموالهم فعوضهم الله خيرا منها في الدنيا فإن من ترك شيئا لله عوضه الله بما هو خير له منه وكذلك وقع فإنهم مكن الله لهم في البلاد وحكمهم على رقاب العباد وصاروا أمراء حكاما وكل منهم للمتقين إماما وأخبر أن ثوابه للمهاجرين في الدار الآخرة أعظم مما أعطاهم في الدنيا فقال \"ولأجر الآخرة أكبر\" أي مما أعطيناهم في الدنيا \"لو كانوا يعلمون\" أى لو كان المتخلفون عن الهجرة معهم يعلمون ما ادخر الله لمن أطاعه واتبع رسوله ولهذا قال هشيم عن العوام عمن حدثه أن عمر بن الخطاب رضي الله عنه كان إذا أعطى الرجل من المهاجرين عطاءه يقول خذ بارك الله لك فيه هذا ما وعدك الله في الدنيا وما ادخر لك في الآخرة أفضل ثم قرأ هذه الآية \"لنبوئنهم في الدنيا حسنة ولآجر الآخرة أكبر لو كانوا يعلمون\"."
    },
    {
      "ayah": 42,
      "surah": 16,
      "text": "ثم وصفهم تعالى فقال \"الذين صبروا وعلى ربهم يتوكلون\" أي صبروا على الأذى من قومهم متوكلين على الله الذي أحسن لهم العاقبة في الدنيا والآخرة."
    },
    {
      "ayah": 43,
      "surah": 16,
      "text": "قال الضحاك عن ابن عباس لما بعث الله محمدا صلى الله عليه وسلم رسولا أنكرت العرب ذلك أو من أنكر منهم وقالوا الله أعظم من أن يكون رسوله بشرا فأنزل الله \"أكان للناس عجبا أن أوحينا إلى رجل منهم أن أنذر الناس\" الآية وقال \"وما أرسلنا من قبلك إلا رجالا نوحي إليهم فاسألوا أهل الذكر إن كنتم لا تعلمون\" يعني أهل الكتب الماضية أبشرا كانت الرسل إليهم أم ملائكة؟ فإن كانوا ملائكة أنكرتم وإن كانوا بشرا فلا تنكروا أن يكون محمد صلى الله عليه وسلم رسولا. قال تعالى \"وما أرسلنا من قبلك إلا رجالا نوحي إليهم من أهل القرى\" ليسوا من أهل السماء كما قلتم وكذا روي عن مجاهد عن ابن عباس أن المراد بأهل الذكر أهل الكتاب وقاله مجاهد والأعمش وقول عبدالرحمن بن زيد الذكر القرآن واستشهد بقوله \"إنا نحن نزلنا الذكر وإنا له لحافظون\" صحيح لكن ليس هو المراد ههنا لأن المخالف لا يرجع في إثباته بعد إنكاره إليه وكذا قول أبي جعفر الباقر نحن أهل الذكر ومراده أن هذه الأمة أهل الذكر صحيح فإن هذه الأمة أعلم من جميع الأمم السالفة. وعلماء أهل بيت رسول الله عليهم السلام والرحمة من خير العلماء إذا كانوا على السنة المستقيمة كعلي وابن عباس وابني علي الحسن والحسين ومحمد ابن الحنفية وعلي بن الحسين زين العابدين وعلي بن عبدالله بن عباس وأبي جعفر الباقر وهو محمد بن علي بن الحسين وجعفر ابنه وأمثالهم وأضرابهم وأشكالهم ممن هو متمسك بحبل الله المتين وصراطه المستقيم وعرف لكل ذي حق حقه ونزل كل المنزل الذي أعطاه الله ورسوله واجتمعت عليه قلوب عباده المؤمنين والغرض أن هذه الآية الكريمة أخبرت بأن الرسل الماضين قبل محمد صلى الله عليه وعلى آله وسلم كانوا بشرا كما هو بشر كما قال تعالى \"قل سبحان ربي هل كنت إلا بشرا رسولا وما منع الناس أن يؤمنوا إذ جاءهم الهدى إلا أن قالوا أبعث الله بشرا رسولا\" وقال تعالى \"وما أرسلنا قبلك من المرسلين إلا إنهم ليأكلون الطعام ويمشون في الأسواق\" وقال تعالى \"وما جعلناهم جسدا لا يأكلون الطعام وما كانوا خالدين\" وقال \"قل ما كنت بدعا من الرسل\" وقال تعالى \"قل إنما أنا بشر مثلكم يوحى إلي\" ثم أرشد الله تعالى من شك في كون الرسل كانوا بشرا إلى سؤال أصحاب الكتب المتقدمة عن الأنبياء الذين سلفوا هل كان أنبياؤهم بشرا أو ملائكة."
    },
    {
      "ayah": 44,
      "surah": 16,
      "text": "ثم ذكر تعالى أنه أرسلهم \"بالبينات\" أي بالحجج والدلائل \"والزبر\" وهي الكتب قاله ابن عباس ومجاهد والضحاك وغيرهم والزبر جمع زبور تقول العرب زبرت الكتاب إذا كتبته. وقال تعالى \"وكل شيء فعلوه في الزبر\" وقال \"ولقد كتبنا في الزبور من بعد الذكر أن الأرض يرثها عبادي الصالحون\" ثم قال تعالى \"وأنزلنا إليك الذكر\" يعني القرآن \"لتبين للناس ما نزل إليهم\" أي من ربهم لعلمك بمعنى ما أنزل الله عليك وحرصك عليه واتباعك له ولعلمنا بأنك أفضل الخلائق وسيد ولد آدم فتفصل لهم ما أجمل وتبين لهم ما أشكل \"ولعلهم يتفكرون\" أي ينظرون لأنفسهم فيهتدون فيفوزون بالنجاة في الدارين."
    },
    {
      "ayah": 45,
      "surah": 16,
      "text": "يخبر تعالى عن حلمه وإنظاره العصاة الذين يعملون السيئات ويدعون إليها ويمكرون بالناس في دعائهم إياهم وحملهم عليها مع قدرته على أن يخسف بهم الأرض أو يأتيهم العذاب\" من حيث لا يشعرون\" أي من حيث لا يعلمون مجيئه إليهم كقوله تعالى \"أأمنتم من في السماء أن يخسف بكم الأرض فإذا هي تمور أم أمنتم من في السماء أن يرسل عليكم حاصبا فستعلمون كيف نذير\"."
    },
    {
      "ayah": 46,
      "surah": 16,
      "text": "وقوله \"أو يأخذهم في تقلبهم\" أي في تقلبهم في المعايش واشتغالهم بها في أسفار ونحوها من الأشغال الملهية; قال قتادة والسدي تقلبهم أي أسفارهم وقال مجاهد والضحاك وقتادة \"في تقلبهم\" في الليل والنهار كقوله \"أفأمن أهل القرى أن يأتيهم بأسنا بياتا وهم نائمون أو أمن أهل القرى أن يأتيهم بأسنا ضحى وهم يلعبون\" وقوله \"فما هم بمعجزين\" أي لا يعجزون الله على أي حال كانوا عليه."
    },
    {
      "ayah": 47,
      "surah": 16,
      "text": "وقوله \"أو يأخذهم على تخوف\" أي أو يأخذهم الله في حال خوفهم من أخذه لهم فإنه يكون أبلغ وأشد فإن حصول ما يتوقع مع الخوف شديد ولهذا قال العوفي عن ابن عباس \"أو يأخذهم على تخوف\" يقول إن شئت أخذته على أثر موت صاحبه وتخوفه بذلك وكذا روي عن مجاهد والضحاك وقتادة وغيرهم ثم قال تعالى \"فإن ربكم لرءوف رحيم\" أي حيث لم يعاجلكم بالعقوبة كما ثبت في الصحيحين \"لا أحد أصبر على أذى سمعه من الله إنهم يجعلون له ولدا وهو يرزقهم ويعافيهم\" وفيهما \"إن الله ليملي للظالم حتى إذا أخذه لم يفلته\" ثم قرأ رسول الله صلى الله عليه وسلم \"وكذلك أخْذ ربك إذا أخَذ القرى وهي ظالمة إن أخذه أليم شديد\" وقال تعالى \"وكأين من قرية أمليت لها وهي ظالمة ثم أخذتها وإلي المصير\"."
    },
    {
      "ayah": 48,
      "surah": 16,
      "text": "يخبر تعالى عن عظمته وجلاله وكبريائه الذي خضع له كل شيء ودانت له الأشياء والمخلوقات بأسرها جماداتها وحيواناتها ومكلفوها من الإنس والجن والملائكة فأخبر أن كل ما له ظل يتفيأ ذات اليمين وذات الشمال أي بكرة وعشيا فإنه ساجد بظله لله تعالى. قال مجاهد إذا زالت الشمس سجد كل شيء لله عز وجل وكذا قال قتادة والضحاك وغيرهم وقوله \"وهم داخرون\" أي صاغرون وقال مجاهد أيضا سجود كل شيء فيؤه وذكر الجبال قال سجودها فيؤها وقال أبو غالب الشيباني أمواج البحر صلاته ونزلهم منزلة من يعقل إذ أسند السجود إليهم."
    },
    {
      "ayah": 49,
      "surah": 16,
      "text": "فقال \"ولله يسجد ما في السموات وما في الأرض من دابة\" كما قال \"ولله يسجد من في السموات والأرض طوعا وكرها وظلالهم بالغدو والآصال\" وقوله \"والملائكة وهم لا يستكبرون\" أي تسجد لله أي غير مستكبرين عن عبادته\"."
    },
    {
      "ayah": 5,
      "surah": 16,
      "text": "يمتن تعالى على عباده بما خلق لهم من الأنعام وهي الإبل والبقر والغنم كما فصلها في سورة الأنعام إلى ثمانية أزواج وبما جعل لهم فيها من المصالح والمنافع من أصوافها وأوبارها وأشعارها يلبسون ويفترشون ومن ألبانها يشربون ويأكلون من أولادها."
    },
    {
      "ayah": 50,
      "surah": 16,
      "text": "\"يخافون ربهم من فوقهم\" أي يسجدون خائفين وجلين من الرب جل جلاله \"ويفعلون ما يؤمرون\" أي مثابرين على طاعته تعالى وامتثال أوامره وترك زواجره."
    },
    {
      "ayah": 51,
      "surah": 16,
      "text": "يخبر تعالى أنه لا إله إلا هو وأنه لا تنبغي العبادة إلا له وحده لا شريك له فإنه مالك كل شئ وخالقه وربه."
    },
    {
      "ayah": 52,
      "surah": 16,
      "text": "\"وله الدين واصبا\" قال ابن عباس ومجاهد وعكرمة وميمون بن مهران والسدي وقتادة وغير واحد أي دائم وعن ابن عباس أيضا أي واجبا وقال مجاهد أي خالصا أي له العبادة وحده ممن في السموات والأرض كقوله \"أفغير دين الله يبغون وله أسلم من في السموات والأرض طوعا وكرها وإليه يرجعون\" هذا على قول ابن عباس وعكرمة فيكون من باب الخبر وأما على قول مجاهد فإنه يكون من باب الطلب أي ارهبوا أن تشركوا بي شيئا وأخلصوا لي الطاعة كقوله تعالى \"ألا لله الدين الخالص\"."
    },
    {
      "ayah": 53,
      "surah": 16,
      "text": "ثم أخبر أنه مالك النفع والضر وأن ما بالعبد من رزق ونعمة وعافية ونصر فمن فضله عليهم وإحسانه إليهم\" ثم إذا مسكم الضر فإليه تجأرون\" أي لعلمكم أنه لا يقدر على إزالته إلا هو فإنكم عند الضرورات تلجئون إليه وتسألونه وتلحون في الرغبة إليه مستغيثين به كقوله تعالى \"وإذا مسكم الضر في البحر ضل من تدعون إلا إياه فلما نجاكم إلى البر أعرضتم وكان الإنسان كفورا\"."
    },
    {
      "ayah": 54,
      "surah": 16,
      "text": "وقال ههنا \"ثم إذا كشف الضر عنكم إذا فريق منكم بربهم يشركون ليكفروا بما آتيناهم\" قيل اللام ههنا لام العاقبة وقيل لام التعليل بمعنى قيضنا لهم ذلك ليكفروا أي يستروا ويجحدوا نعم الله عليهم وأنه المسدي إليهم النعم الكاشف عنهم النقم ثم توعدهم قائلا \"فتمتعوا\" أي اعملوا ما شئتم وتمتعوا بما أنتم فيه قليلا \"فسوف تعلمون\" أي عاقبة ذلك."
    },
    {
      "ayah": 55,
      "surah": 16,
      "text": "وقال ههنا \"ثم إذا كشف الضر عنكم إذا فريق منكم بربهم يشركون ليكفروا بما آتيناهم\" قيل اللام ههنا لام العاقبة وقيل لام التعليل بمعنى قيضنا لهم ذلك ليكفروا أي يستروا ويجحدوا نعم الله عليهم وأنه المسدي إليهم النعم الكاشف عنهم النقم ثم توعدهم قائلا \"فتمتعوا\" أي اعملوا ما شئتم وتمتعوا بما أنتم فيه قليلا \"فسوف تعلمون\" أي عاقبة ذلك."
    },
    {
      "ayah": 56,
      "surah": 16,
      "text": "يخبر تعالى عن قبائح المشركين الذين عبدوا مع الله غيره من الأصنام والأوثان والأنداد بغير علم وجعلوا للأوثان نصيبا مما رزقهم الله فقالوا \"هذا لله بزعمهم وهذا لشركائنا فما كان لشركائهم فلا يصل إلى الله وما كان لله فهو يصل إلى شركائهم ساء ما يحكمون\" أي جعلوا لآلهتهم نصيبا مع الله وفضلوها على جانبه فأقسم الله تعالى بنفسه الكريمة ليسألنهم عن ذلك الذي افتروه وائتفكوه وليقابلنهم عليه وليجازينهم أوفر الجزاء في نار جهنم فقال \"تالله لتسئلن عما كنتم تفترون\"."
    },
    {
      "ayah": 57,
      "surah": 16,
      "text": "ثم أخبر تعالى عنهم أنهم جعلوا الملائكة الذين هم عباد الرحمن إناثا وجعلوها بنات الله فعبدوها معه فأخطاءوا خطأ كبيرا في كل مقام من هذه المقامات الثلاث فنسبوا إليه تعالى أن له ولدا ولا ولد له ثم أعطوه أخس القسمين من الأولاد وهو البنات وهم لا يرضونها لأنفسهم كما قال \"ألكم الذكر وله الأنثى تلك إذا قسمة ضيزى\" وقوله ههنا \"ويجعلون لله البنات سبحانه\" أي عن قولهم وإفكهم \"ألا إنهم من إفكهم ليقولون ولد الله وإنهم لكاذبون أصطفى البنات على البنين ما لكم كيف تحكمون\" وقوله \"ولهم ما يشتهون\" أي يختارون لأنفسهم الذكور ويأنفون لأنفسهم من البنات التي نسبوها إلى الله تعالى الله عن قولهم علوا كبيرا."
    },
    {
      "ayah": 58,
      "surah": 16,
      "text": "فإنه \"إذا بشر أحدهم بالأنثى ظل وجهه مسودا\" أى كئيبا من الهم \"وهو كظيم\" ساكت من شدة ما هو فيه من الحزن."
    },
    {
      "ayah": 59,
      "surah": 16,
      "text": "\"يتوارى من القوم\" أي يكره أن يراه الناس \"من سوء ما بشر به أيمسكه على هون أم يدسه في التراب\" أي إن أبقاها أبقاها مهانة لا يورثها ولا يعتني بها ويفضل أولاده الذكور عليها \"أم يدسه في التراب\" أي يئدها وهو أن يدفنها فيه حية كما كانوا يصنعون في الجاهلية أفمن يكرهونه هذه الكراهة ويأنفون لأنفسهم عنه يجعلونه لله؟ \"ألا ساء ما يحكمون\" أي بئس ما قالوا وبئس ما قسموا وبئس ما نسبوه إليه كقوله تعالى \"وإذا بشر أحدهم بما ضرب للرحمن مثلا ضل وجهه مسودا وهو كظيم\"."
    },
    {
      "ayah": 6,
      "surah": 16,
      "text": "وما لهم فيها من الجمال وهو الزينة ولهذا قال \"ولكم فيها جمال حين تريحون\" وهو وقت رجوعها عشيا من المرعى فإنها تكون أمده خواصر وأعظمه ضروعا وأعلاه أسنمة \"وحين تسرحون\" أي غدوة حين تبعثونها إلى المرعى."
    },
    {
      "ayah": 60,
      "surah": 16,
      "text": "وقوله ههنا \"للذين لا يؤمنون بالآخرة مثل السوء\" أي النقص إنما ينسب إليهم \"ولله المثل الأعلى\" أي الكمال المطلق من كل وجه وهو منسوب إليه \"وهو العزيز الحكيم\"."
    },
    {
      "ayah": 61,
      "surah": 16,
      "text": "يخبر تعالى عن حِلمه بخلقه مع ظلمهم وأنه لو يؤاخذهم بما كسبوا ما ترك على ظهر الأرض من دابة أي لأهلك جميع دواب الأرض تبعا لإهلاك بني آدم ولكن الرب جل جلاله يحلم ويستر وينظر إلى أجل مسمى أي لا يعاجلهم بالعقوبة; إذ لو فعل ذلك بهم لما أبقى أحدا قال سفيان الثوري عن أبي إسحاق عن أبي الأحوص أنه قال: كاد الجعل أن يعذب بذنب بني آدم وقرأ الآية \"ولو يؤاخذ الله الناس بظلمهم ما ترك عليها من دابة\" وكذا روى الأعمش عن أبي إسحاق عن أبي عبيدة قال: قال عبدالله كاد الجعل أن يهلك في جحره بخطيئة بني آدم وقال ابن جرير: حدثني محمد بن المثنى حدثنا إسماعيل بن حكيم الخزاعي حدثنا محمد بن جابر الحنفي عن يحيى بن أبي كثير عن أبي سلمة قال: سمع أبو هريرة رجلا وهو يقول: إن الظالم لا يضر إلا نفسه قال فالتفت إليه فقال: بلى والله حتى إن الحبارى لتموت في وكرها بظلم الظالم. وقال ابن أبي حاتم: حدثنا علي بن الحسين أنبأنا الوليد بن عبدالملك حدثنا عبيد الله بن شرحبيل حدثنا سليمان بن عطاء عن سلمة بن عبدالله عن عمه أبي مشجعة بن ربعي عن أبي الدرداء رضي الله عنه قال: ذكرنا عند رسول الله صلى الله عليه وآله وسلم فقال \"إن الله لا يؤخر شيئا إذا جاء أجله وإنما زيادة العمر بالذرية الصالحة يرزقها الله العبد فيدعون له من بعده فيلحقه دعاؤهم في قبره فذلك زيادة العمر\"."
    },
    {
      "ayah": 62,
      "surah": 16,
      "text": "وقوله \"ويجعلون لله ما يكرهون\" أي من البنات ومن الشركاء الذين هم عبيده وهم يأنفون أن يكون عند أحدهم شريك له في ماله وقوله \"وتصف ألسنتهم الكذب أن لهم الحسنى\" إنكار عليهم في دعواهم مع ذلك أن لهم الحسنى في الدنيا وإن كان ثَم معاد ففيه أيضا لهم الحسنى وإخبار عن قيل من قال منهم كقوله \"ولئن أذقنا الإنسان منا رحمة ثم نزعناها منه إنه ليئوس كفور ولئن أذقناه نعماء بعد ضراء مسته ليقولن ذهب السيئات عني إنه لفرح فخور\" وقوله \"ولئن أذقناه رحمة منا من بعد ضراء مسته ليقولن هذا لي وما أظن الساعة قائمة ولئن رُجعت إلى ربي إن لي عنده للحسنى فلننبئن الذين كفروا بما عملوا ولنذيقنهم من عذاب غليظ\" وقوله \"أفرأيت الذي كفر بآياتنا وقال لأوتين مالا وولدا\" وقال إخبارا عن أحد الرجلين إنه \"دخل جنته وهو ظالم لنفسه فقال ما أظن أن تبيد هذه أبدا وما أظن الساعة قائمة ولئن رددت إلى ربي لأجدن خيرا منها منقلبا\" فجمع هؤلاء بين عمل السوء وتمني الباطل بأن يجازوا على ذلك حسنا وهذا مستحيل كما ذكر ابن إسحاق أنه وجد حجر في أساس الكعبة حين نقضوها ليجددوها مكتوب عليه حكم ومواعظ; فمن ذلك: تعملون السيئات وتجزون الحسنات؟ أجل كما يجتنى من الشوك العنب. وقال مجاهد وقتادة \"وتصف ألسنتهم الكذب أن لهم الحسنى\" أي الغلمان وقال ابن جرير \"أن لهم الحسنى\" أي يوم القيامة كما قدمنا بيانه وهو الصواب ولله الحمد ولهذا قال تعالى رادا عليهم في تمنيهم ذلك \"لا جرم\" أي حقا لابد منه \"أن لهم النار\" أي يوم القيامة \"وأنهم مفرطون\" قال مجاهد وسعيد بن جبير وقتادة وغيرهم منسيون فيها مضيعون وهذا كقوله تعالى \"فاليوم ننساهم كما نسوا لقاء يومهم هذا\" وعن قتادة أيضا \"مفرطون\" أي معجلون إلى النار من الفرَط وهو السابق إلى الورد ولا منافاة لأنهم يعجل بهم يوم القيامة إلى النار وينسون فيها أي يخلدون."
    },
    {
      "ayah": 63,
      "surah": 16,
      "text": "يذكر تعالى أنه أرسل إلى الأمم الخالية رسلا فكذبت الرسل فلك يا محمد في إخوانك من المرسلين أسوة فلا يهيدنك تكذيب قومك لك وأما المشركون الذين كذبوا الرسل فإنما حملهم على ذلك تزيين الشيطان لهم ما فعلوه \"فهو وليهم اليوم\" أي هم تحت العقوبة والنكال والشيطان وليهم ولا يملك لهم خلاصا ولا صريخ لهم ولهم عذاب أليم."
    },
    {
      "ayah": 64,
      "surah": 16,
      "text": "ثم قال تعالى لرسوله أنه إنما أنزل عليك الكتاب ليبين للناس الذي يختلفون فيه فالقرآن فاصل بين الناس في كل ما يتنازعون فيه \"هدى\" أي للقلوب \"ورحمة\" أي لمن تمسك به \"لقوم يؤمنون\"."
    },
    {
      "ayah": 65,
      "surah": 16,
      "text": "وكما جعل سبحانه القرآن حياة للقلوب الميتة بكفرها كذلك يحيى الأرض بعد موتها بما أنزله عليها من السماء من ماء \"إن في ذلك لآية لقوم يسمعون\" أي يفهمون الكلام ومعناه."
    },
    {
      "ayah": 66,
      "surah": 16,
      "text": "يقول تعالى \"وإن لكم\" أيها الناس \"في الأنعام\" وهى الإبل والبقر والغنم \"لعبرة\" أي لآية ودلالة حكمة خالقها وقدرته ورحمته ولطفه \"نسقيكم مما في بطونه\" أفرده ههنا عودا على معنى النعم أو الضمير عائد على الحيوان فإن الأنعام حيوانات أي نسقيكم مما في بطن هذا الحيوان وفي الآية الأخرى مما في بطونها ويجوز هذا وهذا كما في قوله تعالى \"كلا إنها تذكرة فمن شاء ذكره\" وفي قوله تعالى \"وإني مرسلة إليهم بهدية فناظرة بم يرجع المرسلون فلما جاء سليمان\" أي المال وقوله \"من بين فرث ودم لبنا خالصا\" أي يتخلص الدم بياضه وطعمه وحلاوته من بين فرث ودم في باطن الحيوان فيسري كل إلى موطنه إذا نضج الغذاء في معدته فيصرف منه دم إلى العروق ولبن إلى الضَّرع وبول إلى المثانة وروث إلى المخرج وكل منها لا يشوب الآخر ولا يمازجه بعد انفصاله عنه ولا يتغير به وقوله \"لبنا خالصا سائغا للشاربين\" أي لا يغص به أحد."
    },
    {
      "ayah": 67,
      "surah": 16,
      "text": "ولما ذكر اللبن وأنه تعالى جعله شرابا للناس سائغا ثنى بذكر ما يتخذه الناس من الأشربة من ثمرات النخيل والأعناب وما كانوا يصنعون من النبيذ المسكر قبل تحريمه ولهذا امتن به عليهم فقال \"ومن ثمرات النخيل والأعناب تتخذون منه سكرا\" دل على إباحته شرعا قبل تحريمه ودل على التسوية بين المسكر المتخذ من النخل والمتخذ من العنب كما هو مذهب مالك والشافعي وأحمد وجمهور العلماء وكذا حكم سائر الأشربة المتخذة من الحنطة والشعير والذرة والعسل كما جاءت السنة بتفصيل ذلك وليس هذا موضع بسط ذلك كما قال ابن عباس في قوله \"سكرا ورزقا حسنا\" قال السكر ما حرم من ثمرتيهما والرزق الحسن ما أحل من ثمرتيهما وفي رواية السكر حرامه والرزق الحسن حلاله يعني ما يبس منهما من تمر وزبيب وما عمل منهما من طلاء وهو الدبس وخل ونبيذ حلال يشرب قبل أن يشتد كما وردت السنة بذلك \"إن في ذلك لآية لقوم يعقلون \" ناسب ذكر العقل ههنا فإنه أشرف ما في الإنسان ولهذا حرم الله على هذه الأمة الأشربة المسكرة صيانة لعقولها قال الله تعالى \"وجعلنا فيها جنات من نخيل وأعناب وفجرنا فيها العيون ليأكلوا من ثمره وما عملته أيديهم أفلا يشكرون سبحان الذي خلق الأزواج كلها مما تنبت الأرض ومن أنفسهم ومما لا يعلمون\"."
    },
    {
      "ayah": 68,
      "surah": 16,
      "text": "المراد بالوحى هنا الإلهام والهداية والإرشاد للنحل أن تتخذ من الجبال بيوتا تأوي إليها ومن الشجر ومما يعرشون ثم محكمة في غاية الإتقان في تسديسها ورصها بحيث لا يكون في بيتها خلل."
    },
    {
      "ayah": 69,
      "surah": 16,
      "text": "ثم أذن لها تعالى إذنا قدريا تسخيريا أن تأكل من كل الثمرات وأن تسلك الطرق التي جعلها الله تعالى مذللة لها أي مسهلة عليها حيث شاءت من هذا الجو العظيم والبراري الشاسعة والأودية والجبال الشاهقة ثم تعود كل واحدة منها إلى بيتها لا تحيد عنه يمنة ولا يسرة بل إلى بيتها وما لها فيه من فراخ وعسل فتبني الشمع من أجنحتها وتقيء العسل من فيها وتبيض الفراخ من دبرها ثم تصبح إلى مراعيها وقال قتادة وعبدالرحمن بن زيد بن أسلم \"فاسلكي سبل ربك ذللا\" أي مطيعة فجعلاه حالا من السالكة قال ابن زيد وهو كقول الله تعالى \"وذللناها لهم فمنها ركوبهم ومنها يأكلون\" قال: ألا ترى أنهم ينقلون النحل ببيوته من بلد إلى بلد وهو يصحبهم؟ والقول الأول هو الأظهر وهو أنه حال من الطريق أي فاسلكيها مذللة لك نص عليه مجاهد وقال ابن جرير كلا القولين صحيح وقد قال أبو يعلى الموصلي حدثنا شيبان بن فروخ حدثنا مكين بن عبدالعزيز عن أبيه عن أنس قال: قال رسول الله صلى الله عليه وسلم \"عمر الذباب أربعون يوما والذباب كله في النار إلا النحل\" وقوله تعالى \"يخرج من بطونها شراب مختلف ألوانه فيه شفاء للناس \"ما بين أبيض وأصفر وأحمر وغير ذلك من الألوان الحسنة على اختلاف مراعيها ومأكلها منها. وقوله \" فيه شفاء للناس \"أي في العسل شفاء للناس أي من أدواء تعرض لهم قال بعض من تكلم على الطب النبوي لو قال فيه الشفاء للناس لكان دواء لكل داء ولكن قال فيه شفاء للناس أي يصلح لكل أحد من أدواء باردة فإنه حار والشيء يداوى بضده وقال مجاهد وابن جرير في قوله \"فيه شفاء للناس\" يعني القرآن وهذا قول صحيح في نفسه ولكن ليس هو الظاهر ههنا من سياق الآية فإن الآية إنما ذكر فيها العسل ولم يتابع مجاهد على قوله ههنا وإنما الذي قاله ذكروه في قوله تعالى \"وننزل من القرآن ما هو شفاء ورحمة للمؤمنين\" وقوله تعالى \"يا أيها الناس قد جاءتكم موعظة من ربكم وشفاء لما في الصدور وهدى ورحمة للمؤمنين\" والدليل على أن المراد بقوله تعالى \"فيه شفاء للناس\" هو العسل الحديث الذي رواه البخاري ومسلم في صحيحيهما من رواية قتادة عن أبي المتوكل علي بن داود الناجي عن أبي سعيد الخدري رضي الله عنه أن رجلا جاء إلى رسول الله صلى الله عليه وسلم فقال إن أخي استطلق بطنه فقال \"اسقه عسلا\" فدهب فسقاه عسلا ثم جاء فقال يا رسول الله سقيته عسلا فما زاده إلا استطلاقا قال \"اذهب فاسقه عسلا\" فذهب فسقاه عسلا ثم جاء فقال يا رسول الله ما زاده إلا استطلاقا فقال رسول الله صلى الله عليه وسلم \"صدق الله وكذب بطن أخيك اذهب فاسقه عسلا\" فذهب فسقاه عسلا فبرئ. قال بعض العلماء بالطب كان هذا الرجل عنده فضلات فلما سقاه عسلا وهو حار تحللت فأسرعت في الاندفاع فزاده إسهالا فاعتقد الأعرابي أن هذا يضره وهو مصلحة لأخيه ثم سقاه فازداد التحليل والدفع ثم سقاه فكذلك فلما اندفعت الفضلات الفاسدة المضرة بالبدن استمسك بطنه وصلح مزاجه واندفعت الأسقام والآلام ببركة إشارته عليه من ربه أفضل الصلاة والسلام; وفي الصحيحين من حديث هشام بن عروة عن أبيه عن عائشة رضي الله عنها أن رسول الله صلى الله عليه وسلم كان يعجبه الحلواء والعسل هذا لفظ البخاري. وفي صحيح البخاري من حديث سالم الأفطس عن سعيد بن جبير عن ابن عباس قال: قال رسول الله صلى الله عليه وسلم \"الشفاء في ثلاثة: في شرطة محجم أو شربة عسل أو كية بنار وأنهى أمتى عن الكي\". وقال البخاري حدثنا أبو نعيم حدثنا عبدالرحمن بن الغسيل عن عاصم بن عمر بن قتادة سمعت جابر بن عبدالله قال سمعت رسول الله صلى الله عليه وسلم يقول \"إن كان في شيء من أدويتكم أو يكون في شيء من أدويتكم خير: ففي شرطة محجم أو شربة عسل أو لذعة بنار توافق الداء وما أحب أن أكتوي \". ورواه مسلم من حديث عاصم بن عمر بن قتادة عن جابر به. وقال الإمام أحمد حدثنا علي بن إسحاق أنبأنا عبدالله أنبأنا سعيد بن أبي أيوب حدثنا عبدالله بن الوليد عن أبي الخير عن عقبة بن عامر الجهني قال: قال رسول الله صلى الله عليه وسلم \"ثلاث إن كان في شيء شفاء: فشرطة محجم أو شربة عسل أو كية تصيب ألما وأنا أكره الكي ولا أحبه\". ورواه الطبراني عن هارون بن سلول المصري عن أبي عبدالرحمن المقري عن عبدالله بن الوليد به. ولفظه \"إن كان في شئ شفاء: فشرطة محجم\".وذكره وهذا إسناد صحيح ولم يخرجوه وقال الإمام أبو عبدالله محمد بن يزيد بن ماجه القزويني في سننه حدثنا علي بن سلمة هو التغلبي حدثنا زيد بن حباب; حدثنا سفيان عن أبي إسحاق; عن أبي الأحوص بن عبدالله هو ابن مسعود قال: قال رسول الله صلى الله عليه وسلم \"عليكم بالشفاءين العسل والقرآن\" وهذا إسناد جيد تفرد بإخراجه ابن ماجه مرفوعا. وقد رواه ابن جرير عن سفيان بن وكيع عن أبيه عن سفيان هو الثوري موقوفا وله شبه. وروينا عن أمير المؤمنين علي بن أبي طالب رضي الله عنه أنه قال: إذا أراد أحدكم الشفاء فليكتب آية من كتاب الله في صحيفة وليغسلها بماء السماء وليأخذ من امرأته درهما عن طيب نفس منها فليشتر به عسلا فليشربه كذلك فإنه شفاء: أي من وجوه قال الله تعالى \" وننزل من القرآن ما هو شفاء ورحمة للمؤمنين\" وقال \"وأنزلنا من السماء ماء مباركا\" وقال \"فإن طبن لكم عن شيء منه نفسا فكلوه هنيئا مريئا\" وقال في العسل \"فيه شفاء للناس\" وقال ابن ماجه أيضا: حدثنا محمود بن خداش حدثنا سعيد بن زكريا القرشي حدثنا الزبير بن سعيد الهاشمي عن عبدالحميد بن سالم عن أبي هريرة قال: قال رسول الله صلى الله عليه وسلم \"من لعق العسل ثلاث غدوات في كل شهر لم يصبه عظيم من البلاء\" الزبير بن سعيد متروك وقال ابن ماجه أيضا حدثنا إبراهيم بن محمد بن يوسف بن سرح الفريابي حدثنا عمرو بن بكير السكسكي حدثنا إبراهيم بن أبي عبلة سمعت أبا أبي ابن أم حرام وكان قد صلى القبلتين يقول سمعت رسول الله صلى الله عليه وسلم يقول \"عليكم بالسنا والسنوت فإن فيهما شفاء من كل داء إلا السام\".قيل يا رسول الله وما السام؟ قال \"الموت\" قال عمرو قال ابن أبي عبلة السنوت الشبت وقال آخرون بل هو العسل الذي في زقاق السمن وهو قول الشاعر: هم السمن بالسنوت لا لبس فيهم وهم يمنعون الجار أن يقردا كذا رواه ابن ماجه; وقوله لا لبس فيهم أي لا خلط وقوله يمنعون الجار أن يقردا أي يضطهد ويظلم وقوله \"إن في ذلك لآية لقوم يتفكرون \"أي إن في إلهام الله لهذه الدواب الضعيفة الخلقة إلى السلوك في هذه المهامه والاجتناء من سائر الثمار ثم جمعها للشمع والعسل وهو من أطيب الأشياء لآية لقوم يتفكرون في عظمة خالقها ومقدرها ومسخرها وميسرها فيستدلون بذلك على أنه الفاعل القادر الحكيم العليم الكريم الرحيم."
    },
    {
      "ayah": 7,
      "surah": 16,
      "text": "\"وتحمل أثقالكم\" وهي الأحمال الثقيلة التي تعجزون عن نقلها وحملها \"إلى بلد لم تكونوا بالغيه إلا بشق الأنفس\" وذلك في الحج والعمرة والغزو والتجارة وما جرى مجرى ذلك تستعملونها في أنواع الاستعمال من ركوب وتحميل كقوله \"وإن لكم في الأنعام لعبرة نسقيكم مما في بطونها ولكم فيها منافع كثيرة ومنها تأكلون وعليها وعلى الفلك تحملون\" وقال تعالى \"الله الذي جعل لكم الأنعام لتركبوا منها ومنها تأكلون ولكم فيها منافع ولتبلغوا عليها حاجة في صدوركم وعليها وعلى الفلك تحملون ويريكم آياته فأي آيات الله تنكرون \"ولهذا قال هنا بعد تعداد هذه النعم \"إن ربكم لرءوف رحيم\" أي ربكم الذي قيض لكم هذه الأنعام وسخرها لكم كقوله \"أولم يروا أنا خلقنا لهم مما عملت أيدينا أنعاما فهم لها مالكون وذللناها لهم فمنها ركوبهم ومنها يأكلون\" وقال \"وجعل لكم من الفلك والأنعام ما تركبون لتستووا على ظهوره ثم تذكروا نعمة ربكم إذا استويتم عليه وتقولوا سبحان الذي سخر لنا هذا وما كنا له مقرنين وإنا إلى ربنا لمنقلبون\" قال ابن عباس: \"لكم فيها دفء\" أي ثياب و\"ومنافع\" ما ينتفعون به من الأطعمة والأشربة وقال عبدالرزاق: أخبرنا إسرائيل عن سماك عن عكرمة عن ابن عباس: دفء ومنافع نسل كل دابة وقال مجاهد لكم فيها دفء أي لباس ينسج ومنافع مركب ولحم ولبن قال قتادة: دفء ومنافع يقول لكم فيها لباس ومنفعة وبلغة. وكذا قال غير واحد من المفسرين بألفاظ متقاربة."
    },
    {
      "ayah": 70,
      "surah": 16,
      "text": "يخبر تعالى عن تصرفه في عباده وأنه هو الذي أنشأهم من العدم ثم بعد ذلك يتوفاهم ومنهم من يتركه حتى يدركه الهرم وهو الضعف في الخلقة كما قال تعالى \"الله الذي خلقكم من ضعف ثم جعل من بعد ضعف قوة\" الآية. وقد روي عن علي رضي الله عنه أرذل العمر خمس وسبعون سنة وفي هذا السن يحصل له ضعف القوى والخرف وسوء الحفظ وقلة العلم ولهذا قال \"لكيلا يعلم بعد علم شيئا\" أي بعد ما كان عالما أصبح لا يدري شيئا من الفند والخرف ولهذا روى البخاري عند تفسير هذه الآية: حدثنا موسى بن إسماعيل حدثنا هارون بن موسى أبو عبدالله الأعور عن شعيب عن أنس بن مالك أن رسول الله صلى الله عليه وسلم كان يدعو \"أعوذ بك من البخل والكسل والهرم وأرذل العمر وعذاب القبر وفتنة الدجال وفتنة المحيا والممات\" وقال زهير بن أبي سلمة في معلقته المشهورة. سئمت تكاليف الحياة ومن يعش ثمانين عاما لا أبالك يسأم رأيت المنايا خبط عشواء من تصب تمته ومن تخطئ يعمر فيهرم."
    },
    {
      "ayah": 71,
      "surah": 16,
      "text": "يبين تعالى للمشركين جهلهم وكفرهم فيما زعموه لله من الشركاء وهم يعترفون أنها عبيد له كما كانوا يقولون في تلبيتهم في حجهم: لبيك لا شريك لك إلا شريكا هو لك تملكه وما ملك. فقال تعالى منكرا عليهم أنتم لا ترضون أن تساووا عبيدكم فيما رزقناكم فكيف يرضى هو تعالى بمساواة عبيد له في الإلهية والتعظيم كما قال في الآية الأخرى \"ضرب لكم مثلا من أنفسكم هل لكم مما ملكت أيمانكم من شركاء فيما رزقناكم فأنتم فيه سواء تخافونهم كخيفتكم أنفسكم\" الأية قال العوفي عن ابن عباس في هده الآية يقول لم يكونوا ليشركوا عبيدهم في أموالهم ونسائهم فكيف يشركون عبيدي معي في سلطاني فذلك قوله \"أفبنعمة الله يجحدون\" وقال في الرواية الأخرى عنه فكيف ترضون لى ما لا ترضون لأنفسكم وقال مجاهد في هذه الآية هذا مثل الآلهة الباطلة وقال قتادة هذا مثل ضربه الله فهل منكم من أحد يشاركه مملوكه في زوجته وفي فراشه فتعدلون بالله خلقه وعباده؟ فإن لم ترض لنفسك هذا فالله أحق أن ينزه منك; وقوله \"أفبنعمة الله يجحدون \" أي أنهم جعلوا لله مما ذرأ من الحرث والأنعام نصيبا فجحدوا نعمته وأشركوا معه غيره وعن الحسن البصري قال كتب عمر بن الخطاب رضي الله عنه هذه الرسالة إلى أبي موسى الأشعري: واقنع برزقك من الدنيا فإن الرحمن فضل بعض عباده على بعض في الرزق بلاء يبتلي به كلا فيبتلي من بسط له كيف شكره لله وأداؤه الحق الذي افترض عليه فيما رزقه وخوله. رواه ابن أبي حاتم."
    },
    {
      "ayah": 72,
      "surah": 16,
      "text": "يذكر تعالى نعمه على عبيده بأن جعل لهم من أنفسهم أزواجا من جنسهم وشكلهم ولو جعل الأزواج من نوع آخر ما حصل الائتلاف والمودة والرحمة ولكن من رحمته خلق من بني آدم ذكورا وإناثا وجعل الإناث أزواجا للذكور ثم ذكر تعالى أنه جعل من الأزواج البنين والحفدة وهم أولاد البنين قاله ابن عباس وعكرمة والحسن والضحاك وابن زيد قال شعبة عن أبى بشر عن سعيد بن جبير عن ابن عباس بنين وحفدة: وهم الولد وولد الولد. وقال سنيد حدثنا حجاج عن ابن بكر عن عكرمة عن ابن عباس قال: بنوك حيث يحفدونك ويرفدونك ويعينونك ويخدمونك. قال جميل: حفد الولائد حولهن وأسلمت بأكفهن أزمة الأجمال وقال مجاهد: بنين وحفدة ابنه وخادمه. وقال في رواية: الحفدة الأنصار والأعوان والخدام وقال طاوس وغير واحد: الحفدة الخدم. وكذا قال قتادة وأبو مالك والحسن البصري. وقال عبد الرزاق أنبأنا معمر عن الحكم بن أبان عن عكرمة أنه قال: الحفدة من خدمك من ولدك وولد ولدك قال الضحاك: إنما كانت العرب تخدمها بنوها. وقال العوفي عن ابن عباس قوله \"وجعل لكم من أزواجكم بنين وحفدة\" يقول بنو امرأة الرجل ليسوا منه. ويقال الحفدة الرجل يعمل بين يدي الرجل. يقال فلان يحفد لنا أي يعمل لنا قال وزعم رجال أن الحفدة أَختان الرجل وهذا الأخير الذي ذكره ابن عباس قاله ابن مسعود ومسروق وأبو الضحى وإبراهيم النخعي وسعيد بن جبير ومجاهد والقرظي ورواه عكرمة عن ابن عباس. وقال علي بن أبي طلحة عن ابن عباس هم الأصهار. قال ابن جرير: وهذه الأقوال كلها داخلة في معنى الحفدة وهو الخدمة الذي منه قوله في القنوت: وإليك نسعى ونحفد ولما كانت الخدمة قد تكون من الأولاد والخدم والأصهار فالنعمة حاصلة بهذا كله ولهذا قال \"وجعل لكم من أزواجكم بنين وحفدة قلت فمن جعل \"وحفدة\" متعلقا بأزواجكم فلا بد أن يكون المراد الأولاد وأولاد الأولاد أو الأصهار لأنهم أزواج البنات أو أولاد الزوجة: وكذا قال الشعبي والضحاك فإنهم يكونون غالبا تحت كنف الرجل وفي حجره وفي خدمته وقد يكون هذا هو المراد من قوله عليه الصلاة والسلام في حديث نضرة بن أكثم \"والولد عبد لك\" رواه أبو داود. وأما من جعل الحفدة الخدم فعنده أنه معطوف على قوله \"والله جعل لكم من أنفسكم أزواجا \" أي جعل لكم الأزواج والأولاد خدما. وقوله \"ورزقكم من الطيبات\" أي من المطاعم والمشارب. ثم قال تعالى منكرا على من أشرك في عبادة المنعم غيره \"أفبالباطل يؤمنون\" وهم الأنداد والأصنام \"وبنعمة الله هم يكفرون\" يسترون نعم الله عليهم ويضيفونها إلى غيره; وفي الحديث الصحيح \"إن الله يقول للعبد يوم القيامة ممتنا عليه ألم أزوجك؟ ألم أكرمك؟ ألم أسخر لك الخيل والإبل وأذرك ترأس وتربع\"."
    },
    {
      "ayah": 73,
      "surah": 16,
      "text": "يقول تعالى إخبارا عن المشركين الذين عبدوا معه غيره مع أنه هو المنعم المتفضل الخالق الرازق وحده لا شريك له ومع هذا يعبدون من دونه من الأصنام والأنداد والأوثان ما لا يملك لهم رزقا من السموات والأرض شيئا أي لا يقدر على إنزال مطر ولا إنبات زرع ولا شجر ولا يملكون ذلك لأنفسهم أي ليس لهم ذلك ولا يقدرون عليه لو أرادوه."
    },
    {
      "ayah": 74,
      "surah": 16,
      "text": "ولهذا قال تعالى \"فلا تضربوا لله الأمثال\" أي لا تجعلوا له أندادا وأشباها وأمثالا \"إن الله يعلم وأنتم لا تعلمون\" أي أنه يعلم ويشهد أنه لا إله إلا هو وأنتم بجهلكم تشركون به غيره."
    },
    {
      "ayah": 75,
      "surah": 16,
      "text": "قال العوفي عن ابن عباس: هذا مثل ضربه الله للكافر والمؤمن وكذا قال قتادة واختاره ابن جرير فالعبد المملوك الذي لا يقدر على شيء مثل الكافر والمرزوق الرزق الحسن فهو ينفق منه سرا وجهرا هو المؤمن. وقال ابن أبي نجيح عن مجاهد: هو مثل مضروب للوثن وللحق تعالى فهل يستوي هذا وهذا؟ ولما كان الفرق بينهما ظاهرا واضحا بينا لا يجهله إلا كل غبي قال الله تعالى \"الحمد لله بل أكثرهم لا يعلمون\"."
    },
    {
      "ayah": 76,
      "surah": 16,
      "text": "قال مجاهد وهذا أيضا المراد به الوثن والحق تعالى يعني أن الوثن أبكم لا يتكلم ولا ينطق بخير ولا بشيء ولا يقدر على شيء بالكلية فلا مقال ولا فعال وهو مع هذا \"كل\" أي عيال وكلفة على مولاه \"أينما يوجهه\" أي يبعثه \"لا يأت بخير\" ولا ينجح مسعاه \"هل يستوي\" من هذه صفاته \"ومن يأمر بالعدل\" أي بالقسط فمقاله حق وفعاله مستقيمة \"وهو على صراط مستقيم\" وقيل الأبكم مولى لعثمان وبهذا قال السدي وقتادة وعطاء الخراساني واختار هذا القول ابن جرير. وقال العوفي عن ابن عباس هو مثل للكافر والمؤمن أيضا كما تقدم وقال ابن جرير حدثنا الحسن بن الصباح البزار حدثنا يحيى بن إسحاق السالحيني حدثنا حماد حدثنا عبدالله بن عثمان بن خيثم عن إبراهيم عن عكرمة عن يعلى بن أمية عن ابن عباس في قوله \"ضرب الله مثلا عبدا مملوكا لا يقدر على شيء\" قال نزلت في رجل من قريش وعبده يعني قوله \"عبدا مملوكا\" الآية. وفي قوله \"وضرب الله مثلا رجلين أحدهما أبكم\" - إلى قوله- \"وهو على صراط مستقيم\" قال هو عثمان بن عفان قال والأبكم الذي أينما يوجهه لا يأت بخير قال هو مولى لعثمان بن عفان كان عثمان ينفق عليه ويكلفه ويكفيه المئونة وكان الآخر يكره الإسلام ويأباه وينهاه عن الصدقة والمعروف فنزلت فيهما."
    },
    {
      "ayah": 77,
      "surah": 16,
      "text": "يخبر تعالى عن كمال علمه وقدرته على الأشياء في علمه غيب السموات والأرض واختصاصه بعلم الغيب فلا اطلاع لأحد على ذلك إلا أن يطلعه تعالى على ما يشاء وفي قدرته التامة التي لا تخالف ولا تمانع وأنه إذا أراد شيئا فإنما يقول له كن فيكون كما قال \"وما أمرنا إلا واحدة كلمح بالبصر \" أي فيكون ما يريد كطرف العين وهكذا قال ههنا \"وما أمر الساعة إلا كلمح البصر أو هو أقرب إن الله على كل شيء قدير\" كما قال \"ما خلقكم ولا بعثكم إلا كنفس واحدة\"."
    },
    {
      "ayah": 78,
      "surah": 16,
      "text": "ثم ذكر تعالى منته على عباده في إخراجه إياهم من بطون أمهاتهم لا يعلمون شيئا ثم بعد هذا يرزقهم السمع الذي يدركون الأصوات والأبصار التي بها يحسون المرئيات والأفئدة وهي العقول التي مركزها القلب على الصحيح وقيل الدماغ والعقل به يميز بين الأشياء ضارها ونافعها وهذه القوى والحواس تحصل للإنسان على التدريج قليلا قليلا كلما كبر زيد في سمعه وبصره وعقله حتى يبلغ أشده. وإنما جعل تعالى هذه في الإنسان ليتمكن بها من عبادة ربه تعالى فيستعين بكل جارحة وعضو وقوة على طاعة مولاه كما جاء في صحيح لبخاري عن أبي هريرة عن رسول الله صلى الله عليه وسلم أنه قال \"يقول تعالى: من عادى لي وليا فقد بارزني بالحرب; وما تقرب إلى عبدي بشيء أفضل من أداء ما افترضت عليه ولا يزال عبدي يتقرب إلي بالنوافل حتى أحبه فإذا أحببته كنت سمعه الذي يسمع به وبصره الذي يبصر به ويده التي يبطش بها ورجله التي يمشي بها ولئن سألني لأعطينه ولئن دعاني لأجيبنه ولئن استعاذ بي لأعيذنه وما ترددت في شيء أنا فاعله ترددي في قبض نفس عبدي المؤمن يكره الموت وأكره مساءته ولا بد له منه\". فمعنى الحديث أن العبد إذا أخلص الطاعة صارت أفعاله كلها لله عز وجل فلا يسمع إلا لله ولا يبصر إلا لله أي ما شرعه الله له ولا يبطش ولا يمشي إلا في طاعة الله عز وجل مستعينا بالله في ذلك كله ولهذا جاء في بعض رواية الحديث في غير الصحيح بعد قوله ورجله التي يمشي بها \"فبي يسمع وبي يبصر وبي يبطش وبي يمشي\". ولهذا قال تعالى \"وجعل لكم السمع والأبصار والأفئدة لعلكم تشكرون\" كقوله تعالى في الآية الأخرى \"قل هو الذي أنشأكم وجعل لكم السمع والأبصار والأفئدة قليلا ما تشكرون قل هو الذي ذرأكم في الأرض وإليه تحشرون\"."
    },
    {
      "ayah": 79,
      "surah": 16,
      "text": "ثم نبه تعالى عباده إلى النظر إلى الطير المسخر بين السماء والأرض كيف جعله يطير بجناحين بين السماء والأرض في جو السماء ما يمسكه هناك إلا الله بقدرته تعالى التي جعل فيها قوى تفعل ذلك وسخر الهواء يحملها وبسير الطير ذلك كما قال تعالى في سورة الملك \"أو لم يروا إلى الطير فوقهم صافات ويقبضن ما يمسكهن إلا الرحمن إنه بكل شيء بصير\" وقال ههنا \"إن في ذلك لآيات لقوم يؤمنون\"."
    },
    {
      "ayah": 8,
      "surah": 16,
      "text": "هذا صنف آخر مما خلق تبارك وتعالى لعباده يمتن به عليهم وهو الخيل والبغال والحمير التي جعلها للركوب والزينة بها وذلك أكبر المقاصد منها ولما فصلها من الأنعام وأفردها بالذكر استدل من استدل من العلماء ممن ذهب إلى تحريم لحوم الخيل بذلك على ما ذهب إليه فيها كالإمام أبي حنيفة رحمه الله ومن وافقه من الفقهاء بأنه تعالى قرنها بالبغال والحمير وهى حرام كما ثبتت به السنة النبوية وذهب إليه أكثر العلماء وقد روى الإمام أبو جعفر بن جرير: حدثني يعقوب حدثنا ابن علية أنبأنا هشام الدستوائي حدثنا يحيى بن أبي كثير عن مولى نافع بن علقمة عن ابن عباس أنه كان يكره لحوم الخيل والبغال والحمير وكان يقول: قال الله تعالى \"والأنعام خلقها لكم فيها دفء ومنافع ومنها تأكلون\" فهذه للأكل \"والخيل والبغال والحمير لتركبوها\" فهذه للركوب وكذا روى من طريق سعيد بن جبير وغيره عن ابن عباس بمثله. وقال مثل ذلك الحكم بن عيينة أيضا رضي الله عنه واستأنسوا بحديث رواه الإمام أحمد في مسنده: حدثنا يزيد بن عبدربه حدثنا بقية بن الوليد حدثنا ثور بن يزيد عن صالح بن يحيى بن المقدام بن معديكرب عن أبيه عن جده عن خالد بن الوليد رضي الله عنه قال: نهى رسول الله صلى الله عليه وسلم عن أكل لحوم الخيل والبغال والحمير وأخرجه أبو داود والنسائي وابن ماجه من حديث صالح بن يحيى بن المقدام وفيه كلام ورواه أحمد أيضا من وجه آخر بأبسط من هذا وأدل منه فقال: حدثنا أحمد بن عبدالملك حدثنا محمد بن حرب حدثنا سليمان بن سليم عن صالح بن يحيى بن المقدام عن جده المقدام بن معديكرب قال: غزونا مع خالد بن الوليد الصائفة فقدم أصحابنا إلى اللحم فسألوني رمكة فدفعتها إليهم فحبلوها وقلت مكانكم حتى آتي خالدا فأسأله فأتيته فسألته فقال: غزونا مع رسول الله صلى الله عليه وسلم غزوة خيبر فأسرع الناس في حظائر يهود فأمرني أن أنادي الصلاة جامعة ولا يدخل الجنة إلا مسلم ثم قال \"أيها الناس: إنكم قد أسرعتم في حظائر يهود ألا لا يحل أموال المعاهدين إلا بحقها وحرام عليكم لحوم الحمر الأهلية وخيلها وبغالها وكل ذي ناب من السباع وكل ذي مخلب من الطير\" والرمكة هي الحجرة وقوله حبلوها أي أوثقوها في الحبل ليذبحوها والحظائر البساتين القريبة من العمران وكأن هذا الصنيع وقع بعد إعطائهم العهد ومعاملتهم على الشطر والله أعلم. فلو صح هذا الحديث لكان نصا في تحريم لحوم الخيل ولكن لا يقاوم ما ثبت في الصحيحين عن جابر بن عبدالله قال: نهى رسول الله صلى الله عليه وسلم عن لحوم الحمر الأهلية وأذن في لحوم الخيل. ورواه الإمام أحمد وأبو داود بإسنادين كل منهما على شرط مسلم عن جابر قال: ذبحنا يوم خيبر الخيل والبغال والحمير فنهانا رسول الله صلى الله عليه وسلم عن البغال والحمير ولم ينهنا عن الخيل. وفي صحيح مسلم عن أسماء بنت أبي بكر رضي الله عنهما قالت: نحرنا على عهد رسول الله صلى الله عليه وسلم فرسا فأكلناه ونحن بالمدينة فهذه أدل وأقوى وأثبت وإلى ذلك صار جمهور العلماء مالك والشافعي وأحمد وأصحابهم وأكثر السلف والخلف والله أعلم وقال عبدالرزاق أنبأنا ابن جريج عن ابن أبي مليكة عن ابن عباس قال: كانت الخيل وحشية فذللها الله لإسماعيل بن إبراهيم عليهما السلام وذكر وهب بن منبه في إسرائيلياته أن الله خلق الخيل من ريح الجنوب والله أعلم فقد دل النص على جواز ركوب هذه الدواب ومنها البغال. وقد أهديت إلى رسول الله صلى الله عليه وسلم بغلة فكان يركبها مع أنه قد نهى عن إنزاء الحمر على الخيل لئلا ينقطع النسل. قال الإمام أحمد: حدثني محمد بن عبيد حدثنا عمر من آل حذيفة عنه عن الشعبي عن دحية الكلبي قال: قلت يا رسول الله ألا أحمل لك حمارا على فرس فتنتج لك بغلا فتركبها؟ قال \"إنما يفعل ذلك الذين لا يعلمون\"."
    },
    {
      "ayah": 80,
      "surah": 16,
      "text": "يذكر تبارك وتعالى تمام نعمه على عبيده بما جعل لهم من البيوت التي هي سكن لم يأوون إليها ويستترون بها وينتفعون بها بسائر وجوه الانتفاع وجعل لهم أيضا من جلود الأنعام بيوتا أي من الأدم يستخفون حملها في أسفارهم ليضربوها لهم في إقامتهم في السفر والحضر ولهذا قال \"تستخفونها يوم ظعنكم ويوم إقامتكم ومن أصوافها\" أي الغنم \"وأوبارها\" أي الإبل \"وأشعارها\" أي المعز والضمير عائد على الأنعام \"أثاثا\" أي تتخذون منه أثاثا وهو المال وقيل المتاع وقيل الثياب والصحيح أعم من هذا كله فإنه يتخذ من الأثاث البسط والثياب وغير ذلك ويتخذ مالا وتجارة وقال ابن عباس الأثاث المتاع وكذا قال مجاهد وعكرمة وسعيد بن جبير والحسن وعطية العوفي وعطاء الخراساني والضحاك وقتادة وقوله \"إلى حين\" أي إلى أجل مسمى ووقت معلوم."
    },
    {
      "ayah": 81,
      "surah": 16,
      "text": "وقوله \"والله جعل لكم مما خلق ظلالا\" قال قتادة يعني الشجر \"وجعل لكم من الجبال أكنانا\" أي حصونا ومعاقل كما \"جعل لكم سرابيل تقيكم الحر\" وهي الثياب من القطن والكتان والصوف \"وسرابيل تقيكم بأسكم\" كالدروع من الحديد المصفح والزرد وغير ذلك \"كذلك يتم نعمته عليكم\" أي هكذا يجعل لكم ما تستعينون به على أمركم وما تحتاجون إليه ليكون عونا لكم على طاعته وعبادته \"لعلكم تسلمون\" هكذا فسره الجمهور وقرءوه بكسر اللام من \"تسلمون\" من الإسلام وقال قتادة في قوله \"كذلك يتم نعمته عليكم\" هذه السورة تسمى سورة النعم وقال عبدالله بن المبارك وعباد بن العوام بن حنظلة السدوسي عن شهر بن حوشب عن ابن عباس أنه كان يقرؤها \"تسلمون\" بفتح اللام يعني من الجراح. رواه أبو عبيد القاسم بن سلام عن عباد وأخرجه ابن جرير من الوجهين ورد هذه القراءة وقال عطاء الخراساني إنما نزل القرآن على قدر معرفة العرب ألا ترى إلى قوله تعالى \"والله جعل لكم مما خلق ظلالا وجعل لكم من الجبال أكنانا\" وما جعل من السهل أعظم وأكثر ولكنهم كانوا أصحاب جبال؟ ألا ترى إلى قوله \"ومن أصوافها وأوبارها وأشعارها أثاثا ومتاعا إلى حين\" وما جعل لهم من غير ذلك أعظم وأكثر ولكنهم كانوا أصحاب وبر وشعر؟ ألا ترى قوله \"وينزل من السماء من جبال فيها من برد\" لعجبهم من ذلك وما أنزل من الثلج أعظم وأكثر ولكنهم كانوا لا يعرفونه؟ ألا ترى إلى قوله تعالى \"سرابيل تقيكم الحر\" وما تقي من البرد أعظم وأكثر ولكنهم كانوا أصحاب حر."
    },
    {
      "ayah": 82,
      "surah": 16,
      "text": "وقوله \"فإن تولوا\" أي بعد هذا البيان وهذا الامتنان فلا عليك منهم \"فإنما عليك البلاغ المبين\" وقد أديته إليهم."
    },
    {
      "ayah": 83,
      "surah": 16,
      "text": "\"يعرفون نعمة الله ثم ينكرونها\" أي يعرفون أن الله تعالى هو المسدي إليهم ذلك وهو المتفضل به عليهم ومع هذا ينكرون ذلك ويعبدون معه غيره ويسندون النصر والرزق إلى غيره \"وأكثرهم الكافرون\" كما قال ابن أبي حاتم حدثنا أبو زرعة حدثنا صفوان حدثنا الوليد حدثنا عبدالرحمن بن يزيد بن جابر عن مجاهد أن أعرابيا أتى النبي صلى الله عليه وسلم فسأله فقرأ عليه رسول الله صلى الله عليه وسلم \"والله جعل لكم من بيوتكم سكنا\" فقال الأعرابي نعم قال \"وجعل لكم من جلود الأنعام بيوتا\" الآية. قال الأعرابي نعم ثم قرأ عليه كل ذلك يقول الأعرابي نعم حتى بلغ \"كذلك يتم نعمته عليكم لعلكم تسلمون\" فولى الأعرابي فأنزل الله \"يعرفون نعمة الله ثم ينكرونها\" الآية."
    },
    {
      "ayah": 84,
      "surah": 16,
      "text": "يخبر تعالى عن شأن المشركين يوم معادهم في الدار الآخرة وأنه يبعث من كل أمة شهيدا وهو نبيها يشهد عليها بما أجابته فيما بلغها عن الله تعالى \"ثم لا يؤذن للذين كفروا\" أي في الاعتذار لأنهم يعلمون بطلانه وكذبه كقوله \" هذا يوم لا ينطقون ولا يؤذن لهم فيعتذرون\" فلهذا قال \"ولا هم يستعتبون."
    },
    {
      "ayah": 85,
      "surah": 16,
      "text": "\"وإذا رأى الذين ظلموا\" أي الذين أشركوا \"العذاب فلا يخفف عنهم\" أي لا يفتر عنهم ساعة واحدة \"ولا هم ينظرون\" أى لا يؤخر عنهم بل يأخذهم سريعا من الموقف بلا حساب فإنه إذا جيء بجهنم تقاد بسبعين ألف زمام مع كل زمام سبعون ألف ملك فيشرق عنق منها على الخلائق وتزفر زفرة لا يبقى أحد إلا جثا لركبتيه فتقول إني وكلت بكل جبار عنيد الذي جعل مع الله إلها آخر وبكذا وبكذا وتذكر أصنافا من الناس كما جاء في الحديث ثم تنطوي عليهم وتلتقطهم من الموقف كما يلتقط الطائر الحب قال الله تعالى \"إذا رأتهم من مكان بعيد سمعوا لها تغيظا وزفيرا وإذا ألقوا منها مكانا ضيقا مقرنين دعوا هنالك ثبورا لا تدعوا اليوم ثبورا واحدا وادعوا ثبورا كثيرا\" وقال تعالى \"ورأى المجرمون النار فظنوا أنهم مواقعوها ولم يجدوا عنها مصرفا\" وقال تعالى \" لو يعلم الذين كفروا حين لا يكفون عن وجوههم النار ولا عن ظهورهم ولا هم ينصرون بل تأتيهم بغتة فتبهتهم فلا يستطيعون ردها ولا هم ينظرون\"."
    },
    {
      "ayah": 86,
      "surah": 16,
      "text": "ثم أخبر تعالى عن تبري آلهتهم منهم أحوج ما يكونون إليها فقال \"وإذا رأى الذين أشركوا شركاءهم\" أي الذين كانوا يعبدونهم في الدنيا\" قالوا ربنا هؤلاء شركاؤنا الذين كنا ندعوا من دونك فألقوا إليهم القول إنكم لكاذبون\" أي قالت لهم الآلهة كذبتم ما نحن أمرناكم بعبادتنا كما قال تعالى \"ومن أضل ممن يدعو من دون الله من لا يستجيب له إلى يوم القيامة وهم عن دعائهم غافلون وإذا حشر الناس كانوا لهم أعداء وكانوا بعبادتهم كافرين\" وقال تعالى \" واتخذوا من دون الله آلهة ليكونوا لهم عزا كلا سيكفرون بعبادتهم ويكونون عليهم ضدا\" وقال الخليل عليه الصلاة والسلام \"ثم يوم القيامة يكفر بعضكم ببعض\" الآية. وقال تعالى \"وقيل ادعوا شركاءكم\" الآية والآيات في هذا كثيرة."
    },
    {
      "ayah": 87,
      "surah": 16,
      "text": "وقوله \"وألقوا إلى الله يومئذ السلم\" قال قتادة وعكرمة ذلوا واستسلموا يومئذ أي استسلموا لله جميعهم فلا أحد إلا سامع مطيع وكقوله تعالى \"أسمع بهم وأبصر يوم يأتوننا\" أي ما أسمعهم وما أبصرهم يومئذ وقال\" ولو ترى إذ المجرمون ناكسوا رءوسهم عند ربهم ربنا أبصرنا وسمعنا\" الآية. وقال \"وعنت الوجوه للحي القيوم\" أي خضعت وذلت واستكانت وأنابت واستسلمت وقوله \"وألقوا إلى الله يومئذ السلم وضل عنهم ما كانوا يفترون\" أي ذهب واضمحل ما كانوا يعبدونه افتراء على الله فلا ناصر لهم ولا معين ولا مجيز."
    },
    {
      "ayah": 88,
      "surah": 16,
      "text": "ثم قال تعالى الذين كفروا وصدوا عن سبيل الله زدناهم عذابا\" الآية أي عذابا على كفرهم وعذابا على صدهم الناس عن اتباع الحق كقوله تعالى \"وهم ينهون عنه وينأون عنه\" أي ينهون الناس عن اتباعه ويبتعدون هم منه أيضا \"وإن يهلكون إلا أنفسهم وما يشعرون\" وهذا دليل على تفاوت الكفار في عذابهم كما يتفاوت المؤمنون في منازلهم في الجنة ودرجاتهم كما قال تعالى \"قال لكل ضعف ولكن لا تعلمون\" وقد قال الحافظ أبو يعلى حدثنا شريح بن يونس حدثنا أبو معاوية حدثنا الأعمش عن عبدالله بن مرة عن مسروق عن عبدالله في قول الله \"زدناهم عذابا فوق العذاب\" قال زيدوا عقارب أنيابها كالنخل الطوال. وحدثنا شريح بن يونس حدثنا إبراهيم بن سليمان حدثنا الأعمش عن الحسن عن ابن عباس في الآية أنه قال \"زدناهم عذابا فوق العذاب\" قال هي خمسة أنهار تحت العرش يعذبون ببعضها في الليل وببعضها في النهار."
    },
    {
      "ayah": 89,
      "surah": 16,
      "text": "يقول تعالى مخاطبا عبده ورسوله محمدا صلى الله عليه وسلم \"ويوم نبعث في كل أمة شهيدا عليهم من أنفسهم وجئنا بك شهيدا على هؤلاء\" يعني أمتك. أي اذكر ذلك اليوم وهو له وما منحك الله فيه من الشرف العظيم والمقام الرفيع وهذه الآية شبيهة بالآية التي انتهى إليها عبدالله بن مسعود حين قرأ على رسول الله صلى الله عليه وسلم صدر سورة النساء فلما وصل إلى قوله \"فكيف إذا جئنا من كل أمة بشهيد وجئنا بك على هؤلاء شهيدا\" فقال له رسول الله صلى الله عليه وسلم \"حسبك\" فقال ابن مسعود رضي الله عنه فالتفتُّ فإذا عيناه تذرقان وقوله \"ونزلنا عليك الكتاب تبيانا لكل شيء\" قال ابن مسعود قد بين لنا في هذا القرآن كل علم وكل شيء و قال مجاهد كل حلال وكل حرام وقول ابن مسعود أعم وأشمل فإن القرآن اشتمل على كل علم نافع من خبر ما سبق وعلم ما سيأتي وكل حلال وحرام وما الناس إليه محتاجون في أمر دنياهم ودينهم ومعاشهم ومعادهم \"وهدى\" أي للقلوب \"ورحمة وبشرى للمسلمين\" وقال الأوزاعي \"ونزلنا عليك الكتاب تبيانا لكل شيء\" أي بالسنة ووجه اقتران قوله \"ونزلنا عليك الكتاب\" مع قوله \"وجئنا بك شهيدا على هؤلاء\" أن المراد والله أعلم. إن الذي فرض عليك تبليغ الكتاب الذي أنزله عليك سائلك عن ذلك يوم القيامة \"فلنسألن الذين أرسل إليهم ولنسألن المرسلين\" \"فوربك لنسألنهم أجمعين عما كانوا يعملون\" \"يوم يجمع الله الرسل فيقول ماذا أجبتم قالوا لا علم لنا إنك أنت علام الغيوب\". وقال تعالى \"إن الذي فرض عليك القرآن لرادك إلى معاد\" أي إن الذي أوجب عليك تبليغ القرآن لرادك إليه ومعيدك يوم القيامة وسائلك عن أداء ما فرض عليك. هذا أحد الأقوال وهو متجه حسن."
    },
    {
      "ayah": 9,
      "surah": 16,
      "text": "لما ذكر تعالى من الحيوانات ما يسار عليه في السبل الحسية نبه على الطرق المعنوية الدينية وكثيرا ما يقع في القرآن العبور من الأمور الحسية إلى الأمور المعنوية النافعة الدينية كقوله تعالى \"وتزودوا فإن خير الزاد التقوى\" وقال تعالى \"يا بني آدم قد أنزلنا عليكم لباسا يواري سوآتكم وريشا ولباس التقوى ذلك خير\" ولما ذكر تعالى في هذه السورة الحيوانات من الأنعام وغيرها التي يركبونها ويبلغون عليها حاجة في صدورهم وتحمل أثقالهم إلى البلاد والأماكن البعيدة والأسفار الشاقة شرع في ذكر الطرق التي يسلكها الناس إليه فبين أن الحق منها ما هي موصلة إليه فقال \"وعلى الله قصد السبيل\" كقوله \"وأن هذا صراطي مستقيما فاتبعوه ولا تتبعوا السبل فتفرق بكم عن سبيله\" وقال \"قال هذا صراط علي مستقيم\" فال مجاهد في قوله \"وعلى الله قصد السبيل\" قال طريق الحق على الله وقال السدي \"وعلى الله قصد السبيل\" الإسلام وقال العوفي عن ابن عباس في قوله \"وعلى الله قصد السبيل\" يقول وعلى الله البيان أي يبين الهدى والضلالة وكذا روى علي بن أبي طلحة عنه وكذا قال قتادة والضحاك وقول مجاهد ههنا أقوى من حيث السياق لأنه تعالى أخبر أن ثَمَّ طرقا تسلك إليه فليس يصل إليه منها إلا طريق الحق وهي الطريق التي شرعها ورضيها وما عداها مسدودة والأعمال فيها مردودة ولهذا قال تعالى \"ومنها جائر\" أي حائد مائل زائغ عن الحق قال ابن عباس وغيره: هي الطرق المختلفة والآراء والأهواء المتفرقة كاليهودية والنصرانية والمجوسية وقرأ ابن مسعود \"ومنكم جائر\" ثم أخبر تعالى أن ذلك كله كائن عن قدرته ومشيئته فقال \"ولو شاء لهداكم أجمعين\" كما قال تعالى \"ولو شاء ربك لآمن من في الأرض كلهم جميعا\" وقال \"ولو شاء ربك لجعل الناس أمة واحدة ولا يزالون مختلفين إلا من رحم ربك ولذلك خلقهم وتمت كلمة ربك لأملأن جهنم من الجنة والناس أجمعين\"."
    },
    {
      "ayah": 90,
      "surah": 16,
      "text": "يخبر تعالى أنه يأمر عباده بالعدل وهو القسط والموازنة ويندب إلى الإحسان كقوله تعالى \"وإن عاقبتم فعاقبوا بمثل ما عوقبتم به ولئن صبرتم لهو خير للصابرين\" وقوله \"وجزاء سيئة سيئة مثلها فمن عفا وأصلح فأجره على الله\" وقال \"والجروح قصاص فمن تصدق به فهو كفارة له\" إلى غير ذلك من الآيات الدالة على شرعية العدل والندب إلى الفضل. وقال علي بن أبي طلحة عن ابن عباس: \"إن الله يأمر بالعدل \" قال شهادة أن لا إله إلا الله وقال سفيان بن عيينة العدل في هذا الموضع هو استواء السريرة والعلانية من كل عامل لله عملا والإحسان أن تكون سريرته أحسن من علانيته والفحشاء والمنكر أن تكون علانيته أحسن من سريرته; وقوله \"وإيتاء ذي القربى\" أي يأمر بصلة الأرحام كما قال \"وآت ذا القربى حقه والمسكين وابن السبيل ولا تبذر تبذيرا\" وقوله \"وينهى عن الفحشاء والمنكر\" فالفواحش المحرمات والمنكرات ما ظهر منها من فاعلها ولهذا قيل في الموضع الآخر \"قل إنما حرم ربي الفواحش ما ظهر منها وما بطن\" وأما البغي فهو العدوان على الناس وقد جاء في الحديث \" ما من ذنب أجدر أن يعجل الله عقوبته في الدنيا مع ما يدخر لصاحبه في الآخرة من البغي وقطيعة الرحم\" وقوله \"يعظكم\" أي يأمركم بما يأمركم به من الخير وينهاكم عما ينهاكم عنه من الشر \"لعلكم تذكرون\" وقال الشعبي عن بشير بن نهيك سمعت ابن مسعود يقول: إن أجمع آية في القرآن في سورة النحل \"إن الله يأمركم بالعدل والإحسان\" الآية رواه ابن جرير وقال سعيد عن قتادة قوله \"إن الله يأمر بالعدل والإحسان\" الآية ليس من خلق حسن كان أهل الجاهلية يعملون به ويستحسنونه إلا أمر الله به وليس من خلق سيء كانوا يتعايرونه بينهم إلا نهى الله عنه وقدم فيه وإنما نهى عن سفاسف الأخلاق ومذامها [قلت] ولهذا جاء في الحديث \"إن الله يحب معالي الأخلاق ويكره سفسافها\". وقال الحافظ أبو يعلى في كتاب معرفة الصحابة حدثنا أبو بكر محمد بن الفتح الحنبلي حدثنا يحيى بن محمد مولى بني هاشم حدثنا الحسن بن داود المنكدري حدثنا عمر بن علي المقدمي عن علي بن عبدالملك بن عمير عن أبيه قال: بلغ أكثم بن صيفي مخرج النبي صلى الله عليه وسلم فأراد أن يأتيه فأبى قومه أن يدعوه وقالوا: أنت كبيرنا لم تكن لتخف إليه قال فليأته من يبلغه عني ويبلغني عنه فانتدب رجلان فأتيا النبي صلى الله عليه وسلم فقالا نحن رسل أكثم بن صيفي وهو يسألك من أنت وما أنت؟ فقال النبي صلى الله عليه وسلم \"أما من أنا فأنا محمد بن عبدالله وأما ما أنا فأنا عبدالله ورسوله\". قال ثم تلا عليهم هذه الآية \"إن الله يأمر بالعدل والإحسان\" الآية. قالوا ردد علينا هذا القول فردده عليهم حتى حفظوه فأتيا أكثم فقالا أبى أن يرفع نسبه فسألنا عن نسبه فوجدناه زاكي النسب وسطا في مضر - أي شريفا - وقد رمى إلينا بكلمات قد سمعناها فلما سمعهن أكثم قال: إني أراه يأمر بمكارم الأخلاق وينهى عن ملائمها فكونوا في هذا الأمر رءوسا ولا تكونوا فيه أذنابا وقد ورد في نزولها حديث حسن رواه الإمام أحمد: حدثنا أبو النضر حدثنا عبدالحميد حدثنا شهر حدثني عبدالله بن عباس قال بينما رسول الله صلى الله عليه وسلم بفناء بيته جالس إذ مر به عثمان بن مظعون فكشر إلى رسول الله صلى الله عليه وسلم فقال له رسول الله صلى الله عليه وسلم \"ألا تجلس؟\" فقال بلى قال فجلس رسول الله صلى الله عليه وسلم مستقبله فبينما هو يحدثه إذ شخص رسول الله صلى الله عليه وسلم ببصره إلى السماء فنظر ساعة إلى السماء فأخذ يضع بصره حتى وضعه على يمينه في الأرض فتحرف رسول الله صلى الله عليه وسلم عن جليسه عثمان إلى حيث وضع بصره فأخذ ينغض رأسه كأنه يستفقه ما يقال له وابن مظعون ينظر فلما قضى حاجته واستفقه ما يقال له شخص بصر رسول الله صلى الله عليه وسلم إلى السماء كما شخص أول مرة فأتبعه بصره حتى توارى إلى السماء فأقبل إلى عثمان بجلسته الأولى فقال: يا محمد فيما كنت أجالسك ما رأيتك تفعل كفعلك الغداة فقال \" وما رأيتني فعلت؟\" قال رأيت شخص بصرك إلى السماء ثم وضعته حيث وضعته على يمينك فتحرفت إليه وتركتني فأخذت تنغض رأسك كأنك تستفقه شيئا يقال لك. قال \"وفطنت لذلك؟ \" فقال عثمان نعم قال رسول الله صلى الله عليه وسلم: \"أتاني رسول الله آنفا وأنت جالس\" قال رسول الله؟ قال \"نعم\" قال فما قال لك؟ قال \"إن الله يأمر بالعدل والإحسان\" الآية. قال عثمان فذلك حين استقر الإيمان في قلبي وأحببت محمدا صلى الله عليه وسلم إسناد جيد متصل حسن قد بين في السماع المتصل ورواه ابن أبي حاتم من حديث عبد الحميد بن بهرام مختصرا حديث آخر عن عثمان بن أبي العاص الثقفي في ذلك قال الإمام أحمد حدثنا أسود بن عامر حدثنا هريم عن ليث عن شهر بن حوشب عن عثمان بن أبي العاص قال: كنت عند رسول الله صلى الله عليه وسلم جالسا إذ شخص بصره فقال \"أتاني جبريل فأمرني أن أضع هذه الآية بهذا الموضع من هذة السورة \"إن الله يأمر بالعدل والإحسان\" الآية.وهذا إسناد لا بأس به ولعله عند شهر بن حوشب من الوجهين والله أعلم."
    },
    {
      "ayah": 91,
      "surah": 16,
      "text": "هذا مما يأمر الله تعالى به وهو الوفاء بالعهود والمواثيق والمحافظة على الأيمان المؤكدة ولهذا قال \"ولا تنقضوا الأيمان بعد توكيدها\" ولا تعارض بين هذا وبين قوله ولا تجعلوا الله عرضة لأيمانكم\" الآية. وبين قوله تعالى \"ذلك كفارة أيمانكم إذا حلفتم واحفظوا أيمانكم\" أي لا تتركوها بلا كفارة وبين قوله عليه السلام فيما ثبت عنه في الصحيحين أنه عليه الصلاة والسلام قال \"إني والله إن شاء الله لا أحلف على يمين فأرى غيرها خيرا منها إلا أتيت الذي هو خير وتحللتها - وفي رواية - وكفرت عن يميني\" لا تعارض بين هذا كله ولا بين الآية المذكورة ههنا وهي قوله \"ولا تنقضوا الأيمان بعد توكيدها\" لأن هذه الأيمان المراد بها الداخلة في العهود والمواثيق لا الأيمان التي هي واردة على حث أو منع ولهذا قال مجاهد في قوله \"ولا تنقضوا الأيمان بعد توكيدها\" يعني الحلف أي حلف الجاهلية ويؤيده ما رواه الإمام أحمد حدثنا عبدالله بن محمد - هو ابن أبي شيبة - حدثنا ابن نمير وأبو أسامة عن زكريا - هو ابن أبي زائدة - عن سعد بن إبراهيم عن أبيه عن جبير بن مطعم قال: قال رسول الله صلى الله عليه وسلم \"لا حلف في الإسلام وأيما حلف كان في الجاهلية فإنه لا يزيده الإسلام إلا شدة\". وكذا رواه مسلم عن ابن أبي شيبة به. ومعناه أن الإسلام لا يحتاج معه إلى الحلف الذي كان أهل الجاهلية يفعلونه فإن في التمسك بالإسلام كفاية عما كانوا فيه. وأما ما ورد في الصحيحين عن عاصم الأحول عن أنس رضي الله عنه أنه قال: حالف رسول الله صلى الله عليه وسلم بين المهاجرين والأنصار في دورنا. فمعناه أنه آخى بينهم فكانوا يتوارثون به حتى نسخ الله ذلك والله أعلم. وقال ابن جرير حدثني محمد بن عمارة الأسدي حدثنا عبدالله بن موسى أخبرنا أبو ليلى عن بريدة في قوله \"وأوفوا بعهد الله إذا عاهدتم\" قال نزلت في بيعة النبي صلى الله عليه وسلم كان من أسلم بايع النبي صلى الله عليه وسلم على الإسلام فقال \" وأوفوا بعهد الله إذا عاهدتم \"هذه البيعة التي بايعتم على الإسلام\" ولا تنقضوا الأيمان بعد توكيدها\" لا يحملنكم قلة محمد وكثرة المشركين أن تنقضوا البيعة التي بايعتم على الإسلام. وقال الإمام أحمد حدثنا إسماعيل حدثنا صخر بن جويرية عن نافع قال لما خلع الناس يزيد بن معاوية جمع ابن عمر بنيه وأهله ثم تشهد ثم قال: أما بعد فإنا قد بايعنا هذا الرجل على بيعة الله ورسوله وإني سمعت رسول الله صلى الله عليه وسلم يقول \"إن الغادر ينصب له لواء يوم القيامة فيقال هذه غدرة فلان وإن من أعظم الغدر - إلا أن يكون الإشراك بالله - أن يبايع رجل رجلا على بيعة الله ورسوله ثم ينكث بيعته فلا يخلعن أحد منكم يدا ولا يسرفن أحد منكم في هذا الأمر فيكون فصل بيني وبينه\" المرفوع منه في الصحيحين; وقال الإمام أحمد حدثنا يزيد حدثنا حجاج عن عبدالرحمن بن عابس عن أبيه عن حذيفة قال سمعت رسول الله صلى الله عليه وسلم يقول \"من شرط لأخيه شرطا لا يريد أن يفي له به فهو كالمدلي جاره إلى غير منفعة\" قوله \"إن الله يعلم ما تفعلون\" تهديد ووعيد لمن نقض الأيمان بعد توكيدها."
    },
    {
      "ayah": 92,
      "surah": 16,
      "text": "وقوله \"ولا تكونوا كالتي نقضت غزلها من بعد قوة أنكاثا\" قال عبدالله بن كثير السدي: هذه امرأة خرقاء كانت بمكة كلما غزلت شيئا نقضته بعد انبرامه وقال مجاهد وقتادة وابن زيد هذا مثل لمن نقض عهده بعد توكيده وهذا القول أرجح وأظهر وسواء كان بمكة امرأة تنقض غزلها أم لا. وقوله \"أنكاثا\" يحتمل أن يكون اسم مصدر \"نقضت غزلها من بعد قوة أنكاثا\" أي أنقاضا ويحتمل أن يكون بدلا عن خبر كان أي لا تكونوا أنكاثا جمع نكث من ناكث ولهذا قال بعده \"تتخذون أيمانكم دخلا بينكم\" أي خديعة ومكرا \"أن تكون أمة هي أربي من أمة\" أي تحلفون للناس إذا كانوا أكثر منكم ليطمئنوا إليكم فإذا أمكنكم الغدر بهم غدرتم فنهى الله عن ذلك لينبه بالأدنى على الأعلى إذا كان قد نهى عن الغدر والحالة هذه فلأن ينهى عنه مع التمكن والقدرة بطريق الأولى. وقد قدمنا ولله الحمد في سورة الأنفال قصة معاوية لما كان بينه وبين ملك الروم أمد فسار معاوية إليهم في آخر الأجل حتى إذا انقضى وهو قريب من بلادهم أغار عليهم وهم غارون لا يشعرون فقال له عمرو بن عتبة الله أكبر يا معاوية وفاء لا غدر سمعت رسول الله صلى الله عليه وسلم يقول \"من كان بينه وبين قوم أجل فلا يحلن عقده حتى ينقضي أمدها\" فرجع معاوية رضي الله عنه بالجيش قال ابن عباس \"أن تكون أمة هي أربى من أمة\" أي أكثر وقال مجاهد كانوا يحالفون الحلفاء فيجدون أكثر منهم وأعز فينقضون حلف هؤلاء ويحالفون أولئك الذين هم أكثر وأعز فنهوا عن ذلك وقال الضحاك وقتادة وابن زيد نحوه وقوله \"إنما يبلوكم الله به\" قال سعيد بن جبير يعني بالكثرة رواه ابن أبي حاتم وقال ابن جرير أي بأمره إياكم بالوفاء بالعهد \"وليبينن لكم يوم القيامة ما كنتم فيه تختلفون\" فيجازي كل عامل بعمله من خير وشر."
    },
    {
      "ayah": 93,
      "surah": 16,
      "text": "يقول الله تعالى \"ولو شاء الله لجعلكم\" أيها الناس \"أمة واحدة\" كقوله تعالى \"ولو شاء ربك لآمن من في الأرض كلهم جميعا\" أي لوفق بينكم ولما جعل اختلافا ولا تباغض ولا شحناء \"ولو شاء ربك لجعل الناس أمة واحدة ولا يزالون مختلفين إلا من رحم ربك ولذلك خلقهم\" وهكذا قال ههنا \"ولكن يضل من يشاء ويهدي من يشاء\" ثم يسألكم يوم القيامة عن جميع أعمالكم فيجازيكم عليها على الفتيل والنقير والقطمير."
    },
    {
      "ayah": 94,
      "surah": 16,
      "text": "ثم حذر تعالى عباده عن اتخاذ الأيمان دخلا أي خديعة ومكرا لئلا تزل قدم بعد ثبوتها مثل لمن كان على الاستقامة فحاد عنها وزل عن طريق الهدى بسبب الأيمان الحانثة المشتملة على الصد عن سبيل الله لأن الكافر إذا رأى أن المؤمن قد عاهده ثم غدر به لم يبق له وثوق بالدين فانصد بسببه عن الدخول في الإسلام ولهذا قال \"وتذوقوا السوء بما صددتم عن سبيل الله ولكم عذاب عظيم\"."
    },
    {
      "ayah": 95,
      "surah": 16,
      "text": "ثم قال \"ولا تشتروا بعهد الله ثمنا قليلا\" أي لا تعتاضوا عن الإيمان بالله عرض الحياة الدنيا وزينتها فإنها قليلة لو حيزت لابن آدم الدنيا بحذافيرها لكان ما عند الله هو خير له; أي جزاء الله وثوابه خير لمن رجاه وآمن به وطلبه وحفظ عهده رجاء موعوده ولهذا قال \"إن كنتم تعلمون\"."
    },
    {
      "ayah": 96,
      "surah": 16,
      "text": "\"ما عندكم ينفد\" أي يفرغ وينقضي فإنه إلى أجل معدود محصور مقدر متناه\"وما عند الله باق\" أي وثوابه لكم في الجنة باق لا انقطاع ولا نفاد له فإنه دائم لا يحول ولا يزول \"ولنجزين الذين صبروا أجرهم بأحسن ما كانوا يعملون\" قسم من الرب تعالى مؤكد باللام أنه يجازي الصابرين بأحسن أعمالهم أي ويتجاوز عن سيئها."
    },
    {
      "ayah": 97,
      "surah": 16,
      "text": "هذا وعد من الله تعالى لمن عمل صالحا وهو العمل المتابع لكتاب الله تعالى وسنة نبيه صلى الله عليه وسلم من ذكر أو أنثى من بني آدم وقلبه مؤمن بالله ورسوله وإن هذا العمل المأمور به مشروع من عند الله بأن يحييه الله حياة طيبة في الدنيا وأن يجزيه بأحسن ما عمله في الدار الآخرة والحياة الطيبة تشتمل وجوه الراحة من أي جهة كانت وقد روى عن ابن عباس وجماعة أنهم فسروها بالرزق الحلال الطيب وعن علي بن أبي طالب رضي الله عنه أنه فسرها بالقناعة وكذا قال ابن عباس وعكرمة ووهب بن منبه وقال علي بن أبي طلحة عن ابن عباس أنها هى السعادة وقال الحسن ومجاهد وقتادة لا يطيب لأحد حياة إلا في الجنة وقال الضحاك هي الرزق الحلال والعبادة في الدنيا وقال الضحاك أيضا هى العمل بالطاعة والانشراح بها والصحيح أن الحياة الطيبة تشمل هذا كله كما جاء في الحديث الذي رواه الإمام أحمد حدثنا عبدالله بن يزيد حدثنا سعيد بن أبي أيوب حدثني شرحبيل بن أبي شريك عن عبدالرحمن الحبلي عن عبدالله بن عمر أن رسول الله صلى الله عليه وسلم قال \"قد أفلح من أسلم ورزق كفافا وقنعه الله بما آتاه\" ورواه مسلم من حديث عبدالله بن يزيد المقري به وروى الترمذي والنسائي من حديث أبي هانئ عن ابن علي الجهني عن فضالة بن عبيد أنه سمع رسول الله صلى الله عليه وسلم يقول \"قد أفلح من هدي للإسلام وكان عيشه كفافا وقنع به\" وقال الترمذي هذا حديث صحيح وقال الإمام أحمد حدثنا يزيد حدثنا همام عن يحيى عن قتادة عن أنس بن مالك قال: قال رسول الله صلى الله عليه وسلم \"إن الله لا يظلم المؤمن حسنة يعطى بها في الدنيا ويثاب عليها في الآخرة وأما الكافر فيطعم بحسناته في الدنيا إذا أفضى إلى الآخرة لم تكن له حسنة يعطى بها خيرا\" انفرد بإخراجه مسلم."
    },
    {
      "ayah": 98,
      "surah": 16,
      "text": "هذا أمر من الله تعالى لعباده على لسان نبيه صلى الله عليه وسلم إذا أرادوا قراءة القرآن أن يستعيذوا بالله من الشيطان الرجيم وهذا أمر ندب ليس بواجب حكى الإجماع على ذلك أبو جعفر بن جرير وغيره من الأئمة وقد قدمنا الأحاديث الواردة في الاستعاذة مبسوطة في أول التفسير ولله الحمد والمنة والمعنى في الاستعاذة عند ابتداء القراءة لئلا يلبس على القارئ قراءته ويخلط عليه ويمنعه من التدبر والتفكر. ولهذا ذهب الجمهور إلى أن الاستعاذة إنما تكون قبل التلاوة وحكى عن حمزة وأبي حاتم السجستاني أنها تكون بعد التلاوة واحتجا بهذه الآية ونقل النووي في شرح المهذب مثل ذلك عن أبي هريرة أيضا ومحمد بن سيرين وإبراهيم النخعي والصحيح الأول لما تقدم من الأحاديث الدالة على تقدمها على التلاوة والله أعلم."
    },
    {
      "ayah": 99,
      "surah": 16,
      "text": "وقوله \"إنه ليس له سلطان على الذين آمنوا وعلى ربهم يتوكلون\" قال الثوري ليس له عليهم سلطان أن يوقعهم في ذنب لا يتوبون منه وقال آخرون معناه لا حجة له عليهم وقال آخرون كقوله \"إلا عبادك منهم المخلصين\"."
    }
  ]
}
