{
  "ayahs": [
    {
      "ayah": 1,
      "surah": 17,
      "text": "سورة الإسراء: قال الإمام الحافظ المتقن أبو عبدالله محمد بن إسماعيل البخاري: حدثنا آدم بن أبي إياس حدثنا شعبة عن أبي إسحاق قال سمعت عبدالرحمن بن يزيد سمعت ابن مسعود رضي الله عنه قال في بني إسرائيل والكهف ومريم: إنهن من العتاق الأول وهن من تلادى. وقال الإمام أحمد حدثنا عبدالرحمن حدثنا حماد بن زيد عن مروان عن أبي لبابة سمعت عائشة تقول: كان رسول الله صلى الله عليه وسلم يصوم حتى نقول ما يريد أن يفطر ويفطر حتى نقول ما يريد أن يصوم وكان يقرأ كل ليلة بني إسرائيل والزمر. يمجد تعالى نفسه ويعظم شأنه لقدرته على ما لا يقدر عليه أحد سواه فلا إله غيره ولا رب سواه \"الذي أسرى بعبده\" يعني محمدا صلى الله عليه وسلم \"ليلا\" أي في جنح الليل \"من المسجد الحرام\" وهو مسجد مكة \"إلى المسجد الأقصى\" وهو بيت المقدس الذي بإيلياء معدن الأنبياء من لدن إبراهيم الخليل عليه السلام ولهذا جمعوا له هناك كلهم فأمهم في محلتهم ودارهم فدل على أنه هو الإمام الأعظم والرئيس المقدم صلوات الله وسلامه عليه وعليهم أجمعين. وقوله تعالى \"الذي باركنا حوله\" أي في الزروع والثمار \"لنريه\" أي محمدا \"من آياتنا\" أي العظام كما قال تعالى \"لقد رأى من آيات ربه الكبرى\" وسنذكر من ذلك ما وردت به السنة من الأحاديث عنه صلى الله عليه وسلم وقوله تعالى \"إنه هو السميع البصير\" أي السميع لأقوال عباده مؤمنهم وكافرهم مصدقهم ومكذبهم البصير بهم فيعطي كلا منهم ما يستحقه في الدنيا والآخرة. \"ذكر الأحاديث الواردة في الإسراء: رواية أنس بن مالك رضي الله عنه\" قال الإمام أبو عبدالله البخاري: حدثني عبدالعزيز بن عبدالله حدثنا سليمان - هو ابن بلال عن شريك بن عبدالله قال: سمعت أنس بن مالك يقول ليلة أسري برسول الله صلى الله عليه وسلم من مسجد الكعبة أنه جاءه ثلاثة نفر قبل أن يوحى إليه وهو نائم في المسجد الحرام فقال أولهم أيهم هو؟ فقال أوسطهم هو خيرهم فقال آخرهم خذوا خيرهم فكانت تلك الليلة فلم يرهم حتى أتوه ليلة أخرى فيما يرى قلبه وتنام عينه ولا ينام قلبه - وكذلك الأنبياء تنام أعينهم ولا تنام قلوبهم - فلم يكلموه حتى احتملوه فوضعوه عند بئر زمزم فتولاه منهم جبريل فشق جبريل ما بين نحره إلى لبته حتى فرغ من صدره وجوفه فغسله من ماء زمزم بيده حتى أنقى جوفه ثم أتى بطست من ذهب فيه نور من ذهب محشو إيمانا وحكمة فحشا به صدره ولغاديده - يعني عروق حلقه - ثم أطبقه ثم عرج به إلى السماء الدنيا فضرب بابا من أبوابها فناداه أهل السماء من هذا؟ فقال جبريل قالوا ومن معك؟ قال معي محمد قالوا وقد بعث إليه؟ قال نعم قالوا فمرحبا به وأهلا يستبشر به أهل السماء لا يعلم أهل السماء بما يريد الله به في الأرض حتى يعلمهم فوجد في السماء الدنيا آدم فقال له جبريل هذا أبوك آدم فسلم عليه فسلم عليه ورد عليه آدم فقال مرحبا وأهلا بابني نعم الابن أنت فإذا هو في السماء الدنيا بنهرين يطردان فقال \"ما هذان النهران يا جبريل؟\" قال هذان النيل والفرات عنصرهما ثم مضى به في السماء فإذا هو بنهر آخر عليه قصر من لؤلؤ وزبرجد فضرب بيده فإذا هو مسك أذفر فقال \"ما هذا يا جبريل\" قال هذا الكوثر الذي خبأ لك ربك ثم عرج به إلى السماء الثانية فقالت الملائكة له مثل ما قالت له الملائكة الأولى من هذا؟ قال جبريل قالوا ومن معك؟ قال محمد صلى الله عليه وسلم قالوا وقد بعث إليه؟ قال نعم قالوا مرحبا به وأهلا ثم عرج به إلى السماء الثالثة فقالوا له مثل ما قالت الأولى والثانية ثم عرج به إلى السماء الرابعة فقالوا له مثل ذلك ثم عرج به إلى السماء الخامسة فقالوا له مثل ذلك ثم عرج به إلى السماء السادسة فقالوا له مثل ذلك ثم عرج به إلى السماء السابعة فقالوا له مثل ذلك كل سماء فيها أنبياء قد سماهم فوعيت منهم إدريس في الثانية وهارون في الرابعة وآخر في الخامسة لم أحفظ اسمه وإبراهيم في السادسة وموسى في السابعة بتفضيل كلام الله تعالى فقال موسى رب لم أظن أن ترفع على أحدا ثم علا به فوق ذلك بما لا يعلمه إلا الله عز وجل حتى جاء سدرة المنتهى ودنا الجبار رب العزة فتدلى حتى كان منه قاب قوسين أو أدنى فأوحى الله إليه فيما يوحي خمسين صلاة على أمتك كل يوم وليلة ثم هبط به حتى بلغ موسى فاحتبسه موسى فقال يا محمد ماذا عهد إليك ربك؟ قال \"عهد إلي خمسين صلاة كل يوم وليلة\" قال إن أمتك لا تستطيع ذلك فارجع فليخفف عنك ربك وعنهم فالتفت النبي صلى الله عليه وسلم إلى جبريل كأنه يستشيره في ذلك فأشار إليه جبريل أن نعم إن شئت فعلا به إلى الجبار تعالى وتقدس فقال وهو في مكانه \"يا رب خفف عنا فإن أمتي لا تستطيع هذا\" فوضع عنه عشر صلوات ثم رجع إلى موسى فاحتبسه فلم يزل يردده موسى إلى ربه حتى صارت إلى خمس صلوات ثم احتبسه موسى عند الخمس فقال يا محمد والله لقد راودت بني إسرائيل قومي على أدنى من هذا فضعفوا فتركوه فأمتك أضعف أجسادا وقلوبا وأبدانا وأبصارا وأسماعا فأرجع فليخفف عنك ربك كل ذلك يلتفت النبي صلى الله عليه وسلم إلى جبريل ليشير عليه ولا يكره ذلك جبريل فرفعه عند الخامسة فقال \"يا رب إن أمتي ضعفاء أجسادهم وقلوبهم وأسماعهم وأبصارهم وأبدانهم فخفف عنا\" فقال الجبار تبارك وتعالى: \"يا محمد قال لبيك وسعديك\" قال إنه لا يبدل القول لدي كما فرضت عليك في أم الكتاب فكل حسنة بعشر أمثالها فهي خمسون في أم الكتاب وهي خمس عليك فرجع إلى موسى فقال كيف فعلت؟ فقال \"خفف عنا أعطانا بكل حسنة عشر أمثالها\" قال موسى قد والله راودت بني إسرائيل على أدنى من ذلك فتركوه فارجع إلى ربك فليخفف عنك أيضا قال رسول الله صلى الله عليه وسلم \"يا موسى قد والله استحييت من ربي عز وجل مما أختلف إليه \"قال فاهبط باسم الله قال واستيقظ وهو في المسجد الحرام هكذا ساقه البخاري في كتاب التوحيد ورواه في صفة النبي صلى الله عليه وسلم وعلى آله وسلم عن إسماعيل بن أبي أويس عن أخيه أبي بكر عبدالحميد عن سليمان بن بلال ورواه مسلم عن هارون بن سعيد عن ابن وهب عن سليمان قال فزاد ونقص وقدم وأخر وهو كما قال مسلم فإن شريك بن عبدالله بن أبي نمر اضطرب في هذا الحديث وساء حفظه ولم يضبطه كما سيأتي بيانه إن شاء الله في الأحاديث الأخر ومنهم من يجعل هذا مناما توطئة لما وقع بعد ذلك والله أعلم. وقد قال الحافظ أبو بكر البيهقي في حديث شريك زيادة تفرد بها على مذهب من زعم أنه صلى الله عليه وسلم رأى عز وجل يعني قوله \"ثم دنا\" الجبار رب العزة \"فتدلى فكان قاب قوسين أو أدنى\" قال وقول عائشة وابن مسعود وأبي هريرة في حملهم هذه الآيات على رؤيته جبريل أصح وهذا الذي قاله البيهقي رحمه الله في هذه المسألة هو الحق فإن أبا ذر قال يا رسول الله هل رأيت ربك؟ قال \"نور أنى أراه\" وفي رواية \"رأيت نورا\" أخرجه مسلم وقوله \"ثم دنا فتدلى\" إنما هو جبريل عليه السلام كما ثبت ذلك في الصحيحين عن عائشة أم المؤمنين وعن ابن مسعود وكذلك هو في صحيح مسلم عن أبي هريرة ولا يعرف لهم مخالف من الصحابة في تفسير هذه الآية بهذا وقال الإمام أحمد حدثنا حسن بن موسى حدثنا حماد بن سلمة أخبرنا ثابت البناني عن أنس بن مالك أن رسول الله صلى الله عليه وسلم قال \"أتيت بالبراق وهو دابة أبيض فوق الحمار ودون البغل يضع حافره عند منتهى طرفه فركبته فسار بي حتى أتيت بيت المقدس فربطت الدابة بالحلقة التي يربط فيها الأنبياء ثم دخلت فصليت فيه ركعتين ثم خرجت فأتاني جبريل بإناء من خمر وإناء من لبن فاخترت اللبن فقال جبريل: أصبت الفطرة قال ثم عرج بي إلى السماء الدنيا فاستفتح جبريل فقيل له من أنت؟ قال جبريل قيل ومن معك؟ قال محمد قيل وقد أرسل إليه؟ قال قد أرسل إليه ففتح لنا فإذا أنا بآدم فرحب بي ودعا لي بخير ثم عرج بنا إلى السماء الثانية فاستفتح جبريل فقيل له من أنت؟ قال جبريل قيل ومن معك؟ قال محمد قيل وقد أرسل إليه؟ قال قد أرسل إليه ففتح لنا فإذا أنا بابني الخالة يحيى وعيسى فرحبا بي ودعوا لي بخير ثم عرج بنا إلى السماء الثالثة فاستفتح جبريل فقيل له من أنت؟ قال جبريل قيل ومن معك؟ قال محمد قيل وقد أرسل إليه؟ قال قد أرسل إليه ففتح لنا فإذا أنا بيوسف عليه السلام وإذا هو قد أعطي شطر الحسن فرحب بي ودعا لي بخير ثم عرج بنا إلى السماء الرابعة فاستفتح جبريل فقيل من أنت؟ قال جبريل فقيل ومن معك؟ قال محمد فقيل وقد أرسل إليه؟ قال قد بعث إليه ففتح لنا فإذا أنا بإدريس فرحب بي ودعا لي بخير ثم يقول الله تعالى \"ورفعناه مكانا عليا\" ثم عرج بنا إلى السماء الخامسة قال جبريل فقيل من أنت؟ قال جبريل فقيل ومن معك؟ قال محمد فقيل قد أرسل إليه؟ قال قد بعث إليه ففتح لنا فإذا أنا بهارون فرحب بي ودعا لي بخير ثم عرج بنا إلى السماء السادسة فاستفتح جبريل فقيل من أنت؟ قال جبريل قيل ومن معك؟ قال محمد فقيل وقد بعث إليه؟ قال قد بعث إليه ففتح لنا فإذا أنا بموسى عليه السلام فرحب بى ودعا لي بخير ثم عرج بنا إلى السماء السابعة فاستفتح جبريل فقيل من أنت؟ قال جبريل قيل ومن معك؟ قال محمد فقيل وقد بعث إليه قال قد بعث إليه ففتح لنا فإذا أنا بإبراهيم عليه السلام وإذا هو مستند إلى البيت المعمور وإذا هو يدخله كل يوم سبعون ألف ملك ثم لا يعودون إليه ثم ذهب بي إلى سدرة المنتهى فإذا ورقها كآذان الفيلة وإذا ثمرها كالقلال فلما غشيها من أمر الله ما غشيها تغيرت فما أحد من خلق الله تعالى يستطيع أن يصفها من حسنها قال فأوحى الله إلي ما أوحى وقد فرض علي في كل يوم وليلة خمسين صلاة فنزلت حتى انتهيت إلى موسى قال ما فرض ربك على أمتك؟ قلت خمسين صلاة في كل يوم وليلة قال ارجع إلى ربك فاسأله التخفيف لأمتك فإن أمتك لا تطيق ذلك وإني قد بلوت بني إسرائيل وخبرتهم قال فرجعت إلى ربي فقلت أي رب خفف عن أمتي فحط عني خمسا فنزلت حتى انتهيت إلى موسى فقال ما فعلت فقلت قد حط عني خمسا فقال إن أمتك لا تطيق ذلك فارجع إلى ربك فاسأله التخفيف لأمتك قال فلم أزل أرجع بين ربي وبين موسى ويحط عني خمسا خمسا حتى قال: يا محمد هن خمس صلوات في كل يوم وليلة بكل صلاة عشر فتلك خمسون صلاة ومن هم بحسنة فلم يعملها كتبت له حسنة فإن عملها كتبت عشرا ومن هم بسيئة فلم يعملها لم تكتب فإن عملها كتبت سيئة واحدة. فنزلت حتى انتهيت إلى موسى فأخبرته فقال ارجع إلى ربك فاسأله التخفيف لأمتك فإن أمتك لا تطيق ذلك فقال رسول الله صلى الله عليه وسلم \"لقد رجعت إلى ربي حتى استحييت\" ورواه مسلم عن شيبان بن فروخ عن حماد بن سلمة بهذا السياق وهو أصح من سياق شريك. قال البيهقي وفي هذا السياق دليل على أن المعراج كان ليلة أسري به عليه الصلاة والسلام من مكة إلى بيت المقدس وهذا الذي قاله هو الحق الذي لا شك فيه ولا مرية وقال الإمام أحمد حدثنا عبدالرزاق حدثنا معمر عن قتادة عن أنس أن النبي صلى الله عليه وسلم أتي بالبراق ليلة أسري به مسرجا ملجما ليركبه فاستصعب عليه فقال له جبريل ما يحملك على هذا فوالله ما ركبك قط أكرم على الله منه قال فارفض عرقا ورواه الترمذي عن إسحاق بن منصور عن عبد الرزاق وقال غريب لا نعرفه إلا من حديثه. وقال أحمد أيضا حدثنا أبو المغيرة حدثنا صفوان حدثني راشد بن سعيد وعبدالرحمن بن جبير عن أنس قال: قال رسول الله صلى الله عليه وسلم \"لما عرج بي إلى ربي عز وجل مررت بقوم لهم أظفار من نحاس يخمشون بها وجوههم وصدورهم فقلت من هؤلاء يا جبريل؟ قال هؤلاء الذين يأكلون لحوم الناس ويقعون في أعراضهم\" وأخرجه أبو داود من حديث صفوان بن عمرو به ومن وجه آخر ليس فيه أنس فالله أعلم. وقال أيضا حدثنا وكيع حدثنا سفيان عن سليمان التيمي عن أنس قال: قال رسول الله صلى الله عليه وسلم \"مررت ليلة أسري بي على موسى عليه السلام قائما يصلي في قبره\" ورواه مسلم من حديث حماد بن سلمة عن سليمان بن طرخان التيمي وثابت البناني كلاهما عن أنس قال النسائي هذا أصح من رواية من قال سليمان عن ثابت عن أنس. وقال الحافظ أبو يعلى الموصلي في مسنده حدثنا وهب بن بقية حدثنا خالد عن التيمي عن أنس قال أخبرني بعض أصحاب النبي صلى الله عليه وسلم أن النبي صلى الله عليه وسلم ليلة أسري به مر على موسى وهو يصلي في قبره وقال أبو يعلى حدثنا إبراهيم بن محمد بن عرعرة حدثنا معتمر عن أبيه قال سمعت أنسا أن النبي صلى الله عليه وسلم ليلة أسري به مر بموسى وهو يصلي في قبره قال أنس ذكر أنه حمل على البراق فأوثق الدابة أو قال الفرس قال أبو بكر صفها لي فقال رسول الله صلى الله عليه وسلم \"هي كذه وذه\" فقال أشهد أنك رسول الله وكان أبو بكر رضي الله عنه قد رآها وقال الحافظ أبو بكر أحمد بن عمرو البزار في مسنده حدثنا سلمة بن شبيب حدثنا سعيد بن منصور حدثنا الحارث بن عبيد عن أبي عمران الجوني عن أنس بن مالك رضي الله عنه قال قال رسول الله صلى الله عليه وسلم \"بينا أنا نائم إذ جاء جبريل عليه السلام فوكز بين كتفي فقمت إلى شجرة فيها كوكري الطير فقعد في أحدهما وقعدت في الآخر فسمت وارتفعت حتى سدت الخافقين وأنا أقلب طرفي ولو شئت أن أمس السماء لمست فالتفت إلى جبريل كأنه حلس لاط فعرفت فضل علمه بالله علي وفتح لي باب من أبواب السماء فرأيت النور الأعظم وإذا دون الحجاب رفرف الدر والياقوت وأوحى إلي ما شاء الله أن يوحى\" ثم قال ولا نعلم روى هذا الحديث إلا أنس ولا نعلم رواه عن أبي عمران الجوني إلا الحارث بن عبيد وكان رجلا مشهورا من أهل البصرة. ورواه الحافظ البيهقي في الدلائل عن أبي بكر القاضي عن أبي جعفر محمد بن علي بن دحيم عن محمد بن الحسين بن أبي الحسين عن سعيد بن منصور فذكره بسنده مثله ثم قال وقال غيره في هذا الحديث في آخره ولط دوني أو قال دون الحجاب رفرف الدر والياقوت ثم قال هكذا رواه الحارث بن عبيد ورواه حماد بن سلمة عن أبي عمران الجوني عن محمد بن عمير بن عطارد أن النبي صلى الله عليه وسلم كان في ملإ من أصحابه فجاءه جبريل فنكت في ظهره فذهب به إلى الشجرة وفيها مثل وكري الطير فقعد في أحدهما وقعد جبريل في الآخر \"فنشأت بنا حتى بلغت الأفق فلو بسطت يدى إلى السماء لنلتها فدلي بسبب وهبط إلي النور فوقع جبريل مغشيا عليه كأنه حلس فعرفت فضل خشيته على خشيتي فأوحي إلي: نبيا ملكا أو نبيا عبدا وإلى الجنة ما أنت فأومأ إلي جبريل وهو مضطجع أن تواضع قال قلت لا بل نبيا عبدا\" قلت وهذا إن صح يقتضي أنها واقعة غير ليلة الإسراء فإنه لم يذكر فيها بيت المقدس ولا الصعود إلى السماء فهي كائنة غير ما نحن فيه والله أعلم. وقال البزار أيضا حدثنا عمرو بن عيسى حدثنا أبو بحر حدثنا شعبة عن قتادة عن أنس أن محمدا صلى الله عليه وسلم رأى ربه عز وجل وهذا غريب. وقال أبو جعفر بن جرير حدثنا يونس حدثنا عبدالله بن وهب حدثنا يعقوب بن عبد الرحمن الزهري عن أبيه عن عبدالرحمن بن هاشم بن عتبة بن أبي وقاص عن أنس بن مالك قال: لما جاء جبريل إلى رسول الله صلى الله عليه وسلم بالبراق فكأنها حركت ذنبها فقال لها جبريل مه يا براق فوالله ما ركبك مثله وسار رسول الله صلى الله عليه وسلم فإذا هو بعجوز على جانب الطريق فقال \"ما هذه يا جبريل؟ قال سر يا محمد قال فسار ما شاء الله أن يسير فإذا شيء يدعوه متنحيا عن الطريق فقال هلم يا محمد فقال له جبريل سر يا محمد فسار ما شاء الله أن يسير قال فلقيه خلق من خلق الله فقالوا السلام عليك يا أول السلام عليك يا آخر السلام عليك يا حاشر فقال له جبريل اردد السلام يا محمد فرد السلام ثم لقيه الثانية فقال له مثل مقالته الأولى ثم الثالثة كذلك حتى انتهى إلى بيت المقدس فعرض عليه الخمر والماء واللبن فتناول رسول الله صلى الله عليه وسلم اللبن فقال له جبريل أصبت الفطرة ولو شربت الماء لغرقت وغرقت أمتك ولو شربت الخمر لغويت ولغوت أمتك ثم بعث له آدم فمن دونه من الأنبياء عليهم السلام فأمهم رسول الله صلى الله عليه وسلم تلك الليلة ثم قال له جبريل: أما العجوز التي رأيت على جانب الطريق فلم يبق من الدنيا إلا كما بقي من عمر تلك العجوز وأما الذي أراد أن تميل إليه فذاك عدو الله إبليس أراد أن تميل إليه وأما الذين سلموا عليك فإبراهيم وموسى وعيسى عليهم السلام وهكذا رواه الحافظ البيهقي في دلائل النبوة من حديث ابن وهب وفي بعض ألفاظه نكارة وغرابة \"طريق أخرى\" عن أنس بن مالك وفيها غرابة ونكارة جدا وهي في سنن النسائي المجتبى ولم أرها في الكبير قال: حدثنا عمرو بن هشام حدثنا مخلد هو ابن الحسين عن سعيد بن عبدالعزيز حدثنا يزيد بن أبي مالك حدثنا أنس بن مالك أن رسول الله صلى الله عليه وسلم قال \"أتيت بدابة فوق الحمار ودون البغل خطوها عند منتهى طرفها فركبت ومعي جبريل عليه السلام فسرت فقال انزل فصل فصليت فقال أتدري أين صليت؟ صليت بطيبة وإليها المهاجرة ثم قال انزل فصل فصليت فقال أتدري أين صليت؟ صليت بطور سيناء حيث كلم الله موسى ثم قال انزل فصل فصليت فقال أتدري أين صليت صليت ببيت لحم حيث ولد عيسى عليه السلام ثم دخلت بيت المقدس فجمع لي الأنبياء عليهم السلام فقدمني جبريل عليه السلام حتى أممتهم ثم صعد بي إلى السماء الدنيا فإذا فيها آدم عليه السلام ثم صعد بي إلى السماء الثانية فإذا فيها ابنا الخالة عيسى ويحيى عليهما السلام ثم صعد بي إلى السماء الثالثة فإذا فيها يوسف عليه السلام ثم صعد بي إلى السماء الرابعة فإذا فيها هارون عليه السلام ثم صعد بي إلى السماء الخامسة فإذا فيها إدريس عليه السلام ثم صعد بي إلى السماء السادسة فإذا فيها موسى عليه السلام ثم صعد بي إلى السماء السابعة فإذا فيها إبراهيم عليه السلام ثم صعد بي فوق سبع سموات وأتيت سدرة المنتهى فغشتني ضبابة فخررت ساجدا فقيل لي إني يوم خلقت السموات والأرض فرضت عليك وعلى أمتك خمسين صلاة فقم بها أنت وأمتك فرجعت بذلك حتى أمر بموسى عليه السلام فقال ما فرض ربك على أمتك؟ قلت خمسين صلاة قال فإنك لاتستطيع أن تقوم بها لا أنت ولا أمتك فارجع إلى ربك فاسأله التخفيف فرجعت إلى ربي فخفف عني عشرا ثم أتيت موسى فأمرني بالرجوع فرجعت فخفف عني عشرا ثم ردت إلى خمس صلوات قال فارجع إلى ربك فاسأله التخفيف فإنه فرض على بني إسرائيل صلاتين فما قاموا بهما فرجعت إلى ربي عز وجل فسألته التخفيف فقال إني يوم خلقت السموات والأرض فرضت عليك وعلى أمتك خمس صلوات فخمس بخمسين فقم بها أنت وأمتك قال فعرفت أنها من الله عز وجل صري فرجعت إلى موسى عليه السلام فقال ارجع فعرفت أنها من الله عز وجل صري - يقول أي حتم - فلم أرجع\" \"طريق أخرى\" وقال ابن أبي حاتم حدثنا أبي حدثنا هشام ابن عمار حدثنا خالد بن يزيد بن أبي مالك عن أبيه عن أنس بن مالك رضي الله عنه قال: لما كان ليلة أسري برسول الله صلى الله عليه وسلم إلى بيت المقدس أتاه جبريل بدابة فوق الحمار ودون البغل حمله جبريل عليها ينتهي خفها ح"
    },
    {
      "ayah": 10,
      "surah": 17,
      "text": "\"وأن الذين لا يؤمنون بالآخرة\" أي ويبشر الذين لا يؤمنون بالآخرة أن لهم عذابا أليما أي يوم القيامة كما قال تعالى \"فبشرهم بعذاب أليم\"."
    },
    {
      "ayah": 100,
      "surah": 17,
      "text": "يقول تعالى لرسوله صلوات الله وسلامه عليه قل لهم يا محمد لو أنكم أيها الناس تملكون التصرف في خزائن الله لأمسكتم خشية الإنفاق قال ابن عباس وقتادة: أي الفقر أي خشية أن تذهبوها مع أنها لا تفرغ ولا تنفد أبدا لأن هذا من طباعكم وسجاياكم ولهذا قال \"وكان الإنسان قتورا\" قال ابن عباس وقتادة أي بخيلا منوعا وقال الله تعالى \"أم لهم نصيب من الملك فإذا لا يؤتون الناس نقيرا\" أي لو أن لهم نصيبا في ملك الله لما أعطوا أحدا شيئا ولا مقدار نقير والله تعالى يصف الإنسان من حيث هو إلا من وفقه الله وهداه فإن البخل والجزع والهلع صفة له كما قال تعالى \"إن الإنسان خلق هلوعا إذا مسه الشر جزوعا وإذا مسه الخير منوعا إلا المصلين\" ولهذا نظائر كثيرة في القرآن العزيز ويدل هذا على كرمه وجوده وإحسانه وقد جاء في الصحيحين \"يد الله ملأى لا يغيضها نفقة سحاء الليل والنهار أرأيتم ما أنفق منذ خلق السموات والأرض فإنه لم يغض ما في يمينه\"."
    },
    {
      "ayah": 101,
      "surah": 17,
      "text": "يخبر تعالى أنه بعث موسى بتسع آيات بينات وهي الدلائل القاطعة على صحة نبوته وصدقه فيما أخبر به عمن أرسله إلى فرعون وهي العصا واليد والسنين والبحر والطوفان والجراد والقمل والضفادع والدم آيات مفصلات قاله ابن عباس وقال محمد بن كعب: هي اليد والعصا والخمس في الأعراف والطمس والحجر وقال ابن عباس أيضا ومجاهد وعكرمة والشعبي وقتادة هي يده وعصاه والسنين ونقص الثمرات والطوفان والجراد والقمل والضفادع والدم وهذا القول ظاهر جلي حسن قوي وجعل الحسن البصري السنين ونقص الثمرات واحدة وعنده أن التاسعة هي تلقف العصا ما يأفكون \"فاستكبروا وكانوا قوما مجرمين\" أي ومع هذه الآيات ومشاهدتهم لها كفروا بها وجحدوا بها واستيقنتها أنفسهم ظلما وعلوا وما نجعت فيهم فكذلك لو أجبنا هؤلاء الذين سألوا منك ما سألوا وقالوا لن نؤمن لك حتى تفجر لنا من الأرض ينبوعا إلى آخرها لما استجابوا ولا آمنوا إلا أن يشاء الله كما قال فرعون لموسى وقد شاهد منه ما شاهد من هذه الآيات \"إني لأظنك يا موسى مسحورا\" قيل بمعنى ساحر والله تعالى أعلم فهذه الآيات التسع التي ذكرها هؤلاء الأئمة هي المرادة ههنا وهي المعنية في قوله تعالى \"وألق عصاك فلما رآها تهتز كأنها جان ولى مدبرا ولم يعقب يا موسى لا تخف - إلى قوله في تسع آيات - إلى فرعون وقومه إنهم كانوا قوما فاسقين\" فذكر هاتين الآيتين العصا واليد وبين الآيات الباقيات في سورة الأعراف وتفصلها وقد أوتي موسى عليه السلام آيات أخر كثيرة منها ضربه الحجر بالعصا وخروج الماء منه ومنها تظليلهم بالغمام وإنزال المن والسلوى وغير ذلك مما أوتوه بنو إسرائيل بعد مفارقتهم بلاد مصر ولكن ذكر ههنا التسع آيات التي شاهدها فرعون وقومه من أهل مصر فكانت حجة عليهم فخالفوها وعاندوها كفرا وجحودا فأما الحديث الذي رواه الإمام أحمد حدثنا يزيد حدثنا شعبة عن عمرو بن مرة قال: سمعت عبدالله بن سلمة يحدث عن صفوان بن عسال المرادي رضي الله عنه قال: قال يهودي لصاحبه: اذهب بنا إلى هذا النبي حتى نسأله عن هذه الآيات \"ولقد آتينا موسى تسع آيات بينات\" فقال لا تقل له نبي فإنه لو سمعك لصارت له أربع أعين فسألاه فقال النبي صلى الله عليه وسلم \"لا تشركوا بالله شيئا ولا تسرقوا ولا تزنوا ولاتقتلوا النفس التي حرم الله إلا بالحق ولا تسحروا ولا تأكلوا الربا ولا تمشوا ببريء إلى ذي سلطان ليقتله ولا تقذفوا محصنة - أو قال لا تفروا من الزحف شعبة الشاك - وأنتم يا يهود عليكم خاصة أن لا تعدوا في السبت\" فقبلا يديه ورجليه وقالا نشهد أنك نبي قال \"فما يمنعكما أن تتبعاني؟\" قالا لأن داود عليه السلام دعا أن لا يزال من ذريته في نبي وإنا نخشى إن أسلمنا أن تقتلنا يهود. فهذا حديث رواه هكذا الترمذي والنسائي وابن ماجه وابن جرير في تفسيره من طرق عن شعبة بن الحجاج به وقال الترمذي حسن صحيح. وهو حديث مشكل وعبدالله بن سلمة في حفظه شيء وقد تكلموا فيه ولعله اشتبه عليه التسع الآيات بالعشر الكلمات فإنها وصايا في التوراة لا تعلق لها بقيام الحجة على فرعون والله أعلم. ولهذا قال موسى لفرعون."
    },
    {
      "ayah": 102,
      "surah": 17,
      "text": "\"لقد علمت ما أنزل هؤلاء إلا رب السموات والأرض بصائر\"أي حججا وأدلة على صدق ما جئتك به \"وإني لأظنك يا فرعون مثبورا\" أي هالكا قاله مجاهد وقتادة وقال ابن عباس ملعونا \"وقال أيضا هو والضحاك \"مثبورا\" أي مغلوبا والهالك كما قال مجاهد يشمل هذا كله قال الشاعر: إذ أباري الشيطان في سنن الغـ ـي ومن مال ميله مثبور وقرأ بعضهم برفع التاء من قوله علمت وروي ذلك عن علي بن أبي طالب ولكن قراءة الجمهور بفتح التاء على الخطاب لفرعون كما قال تعالى \"فلما جاءتهم آياتنا مبصرة قالوا هذا سحر مبين وجحدوا بها واستيقنتها أنفسهم ظلما وعلوا\" الآية فهذا كله مما يدل على أن المراد بالتسع الآيات إنما هي ما تقدم ذكره من العصا واليد والسنين ونقص من الثمرات والطوفان والجراد والقمل والضفادع والدم التي فيها حجج وبراهين على فرعون وقومه وخوارق ودلائل على صدق موسى ووجود الفاعل المختار الذي أرسله وليس المراد منها كما ورد في هذا الحديث فإن هذه الوصايا ليس فيها حجج على فرعون وقومه وأي مناسبة بين هذا وبين إقامة البراهين على فرعون؟ وما جاءهم هذا الوهم إلا من قبل عبدالله بن سلمة فإن له بعض ما ينكر والله أعلم ولعل ذينك اليهوديين إنما سألا عن العشر الكلمات فاشتبه على الراوي بالتسع الآيات فحصل وهم في ذلك والله أعلم."
    },
    {
      "ayah": 103,
      "surah": 17,
      "text": "وقوله \"فأراد أن يستفزهم من الأرض\" أي يخليهم منها ويزيلهم عنها \"فأغرقناه ومن معه جميعا وقلنا من بعده لبني إسرائيل اسكنوا الأرض\" وفي هذا بشارة لمحمد صلى الله عليه وسلم بفتح مكة مع أن السورة مكية نزلت قبل الهجرة وكذلك وقع فإن أهل مكة هموا بإخراج الرسول منها كما قال تعالى \"وإن كادوا ليستفزونك من الأرض ليخرجوك منها\" الآيتين ولهذا أورث الله رسوله مكة فدخلها عنوة على أشهر القولين وقهر أهلها ثم أطلقهم حلما وكرما كما أورث الله القوم الذين كانوا يستضعفون من بني إسرائيل مشارق الأرض ومغاربها وأورثهم بلاد فرعون وأموالهم وزروعهم وثمارهم وكنوزهم كما قال كذلك وأورثناها بني إسرائيل."
    },
    {
      "ayah": 104,
      "surah": 17,
      "text": "وفي هذا بشارة لمحمد صلى الله عليه وسلم بفتح مكة مع أن السورة مكية نزلت قبل الهجرة وكذلك وقع فإن أهل مكة هموا بإخراج الرسول منها كما قال تعالى \"وإن كادوا ليستفزونك من الأرض ليخرجوك منها\" الآيتين ولهذا أورث الله رسوله مكة فدخلها عنوة على أشهر القولين وقهر أهلها ثم أطلقهم حلما وكرما كما أورث الله القوم الذين كانوا يستضعفون من بني إسرائيل مشارق الأرض ومغاربها وأورثهم بلاد فرعون وأموالهم وزروعهم وثمارهم وكنوزهم كما قال كذلك وأورثناها بني إسرائيل. وقال ههنا \"وقلنا من بعده لبني إسرائيل اسكنوا الأرض فإذا جاء وعد الآخرة جئنا بكم لفيفا\" أي جميعكم أنتم وعدوكم قال ابن عباس ومجاهد وقتادة والضحاك: لفيفا أي جميعا."
    },
    {
      "ayah": 105,
      "surah": 17,
      "text": "يقول تعالى مخبرا عن كتابه العزيز وهو القرآن المجيد أنه بالحق نزل أي متضمنا للحق كما قال تعالى \"لكن الله يشهد بما أنزل إليك أنزله بعلمه والملائكة يشهدون\" أي متضمنا علم الله الذي أراد أن يطلعكم عليه من أحكامه وأمره ونهيه وقوله \"وبالحق نزل\" أي ونزل إليك يا محمد محفوظا محروسا لم يشب بغيره ولا زيد فيه ولا نقص منه بل وصل إليك بالحق فإنه نزل به شديد القوى الأمين المكين المطاع في الملأ الأعلى وقوله \"وما أرسلناك\" أي يا محمد \"إلا مبشرا ونذيرا\" مبشرا لمن أطاعك من المؤمنين ونذيرا لمن عصاك من الكافرين."
    },
    {
      "ayah": 106,
      "surah": 17,
      "text": "وقوله \"وقرآنا فرقناه\" أما قراءة من قرأ بالتخفيف فمعناه فصلناه من اللوح المحفوظ إلى بيت العزة من السماء الدنيا ثم نزل مفرقا منجما على الوقائع إلى رسول الله صلى الله عليه وسلم في ثلاث وعشرين سنة قاله عكرمة عن ابن عباس. وعن ابن عباس أيضا أنه قرأ فرقناه بالتشديد أي أنزلناه آية آية مبينا مفسرا ولهذا قال: \"لتقرأه على الناس\" أي لتبلغه الناس وتتلوه عليهم أي \"على مكث\" أي مهل \"ونزلناه تنزيلا\" أي شيئا بعد شيء."
    },
    {
      "ayah": 107,
      "surah": 17,
      "text": "يقول تعالى لنبيه محمد صلى الله عليه وسلم قل يا محمد لهؤلاء الكافرين بما جئتهم به من هذا القرآن العظيم \"آمنوا به أو لا تؤمنوا\" أي سواء آمنتم به أم لا فهو حق في نفسه أنزله الله ونوه بذكره في سالف الأزمان في كتبه المنزلة على رسله ولهذا قال \"إن الذين أوتوا العلم من قبله\" أي من صالحي أهل الكتاب الذين تمسكوا بكتابهم ويقيمونه ولم يبدلوه ولا حرفوه \"إذا يتلى عليهم\" هذا القرآن \"يخرون للأذقان\" جمع ذقن وهو أسفل الوجه \"سجدا\" أي لله عز وجل شكرا على ما أنعم به عليهم من جعله إياهم أهلا إن أدركوا هذا الرسول الذى أنزل عليه هذا الكتاب."
    },
    {
      "ayah": 108,
      "surah": 17,
      "text": "ولهذا يقولون \"سبحان ربنا\" أي تعظيما وتوقيرا على قدرته التامة وأنه لا يخلف الميعاد الذي وعدهم على ألسنة الأنبياء المتقدمين عن بعثة محمد صلى الله عليه وسلم ولهذا قالوا \"سبحان ربنا إن كان وعد ربنا لمفعولا\"."
    },
    {
      "ayah": 109,
      "surah": 17,
      "text": "وقوله \"ويخرون للأذقان يبكون\" أي خضوعا لله عز وجل وإيمانا وتصديقا بكتابه ورسوله \"ويزيدهم خشوعا\" أي إيمانا وتسليما كما قال \"والذين اهتدوا زادهم هدى وآتاهم تقواهم\" وقوله \"ويخرون\" عطف صفة على صفة لا عطف السجود على السجود كما قال الشاعر: إلى الملك القرم وابن الهمام وليث الكتيبة في المزدحم."
    },
    {
      "ayah": 11,
      "surah": 17,
      "text": "يخبر تعالى عن عجلة الإنسان ودعائه في بعض الأحيان على نفسه أو ولده أو ماله بالشر أي بالموت أو الهلاك والدمار واللعنة ونحو ذلك فلو استجاب له ربه لهلك بدعائه كما قال تعالى \"ولو يعجل الله للناس الشر\" الآية وكذا فسره ابن عباس ومجاهد وقتادة وقد تقدم في الحديث \"لا تدعوا على أنفسكم ولا على أموالكم أن توافقوا من الله ساعة إجابة يستجيب فيها\" وإنما يحمل ابن أدم على ذلك قلقه وعجلته ولهذا قال تعالى \"وكان الإنسان عجولا\" وقد ذكر سلمان الفارسي وابن عباس ههنا قصة آدم عليه السلام حين هم بالنهوض قائما قبل أن تصل الروح إلى رجليه وذلك أنه جاءته النفخة من قبل رأسه فلما وصلت إلى دماغه عطس فقال الحمد لله فقال الله \"يرحمك ربك يا آدم\" فلما وصلت إلى عينيه فتحهما فلما سرت إلى أعضائه وجسده جعل ينظر إليه ويعجبه فهم بالنهوض قبل أن تصل إلى رجليه فلم يستطيع قال يا رب عجل قبل الليل."
    },
    {
      "ayah": 110,
      "surah": 17,
      "text": "يقول تعالى قل يا محمد لهؤلاء المشركين المنكرين صفة الرحمة لله عز وجل المانعين من تسميته بالرحمن \"ادعوا الله أو ادعوا الرحمن أياما تدعوا فله الأسماء الحسنى\" أي لا فرق بين دعائكم له باسم الله أو باسم الرحمن فإنه ذو الأسماء الحسنى كما قال تعالى \"هو الله الذي لا إله الا هو عالم الغيب والشهادة هو الرحمن الرحيم - إلى أن قال - له الأسماء الحسنى يسبح له ما في السموات والأرض\" الآية وقد روى مكحول أن رجلا من المشركين سمع النبي صلى الله عليه وسلم وهو يقول في سجوده \"يا رحمن يا رحيم\" فقال إنه يزعم أنه يدعو واحدا وهو يدعو اثنين فأنزل الله هذه الآية وكذا روي عن ابن عباس رواهما ابن جرير وقوله \"ولا تجهر بصلاتك\" الآية. قال الإمام أحمد حدثنا هشيم حدثنا أبو بشر عن سعيد بن جبير عن ابن عباس قال نزلت هذه الآية ورسول الله صلى الله عليه وسلم متوار بمكة \"ولا تجهر بصلاتك ولا تخافت بها\" قال كان إذا صلى بأصحابه رفع صوته بالقرآن فلما سمع ذلك المشركون سبوا القرآن وسبوا من أنزله ومن جاء به قال: فقال الله تعالى لنبيه صلى الله عليه وسلم \"ولا تجهر بصلاتك\" أي بقراءتك فيسمع المشركون فيسبون القرآن \"ولا تخافت بها\" عن أصحابك فلا تسمعهم القرآن حتى يأخذوه عنك \"وابتغ بين ذلك سبيلا\" أخرجاه في الصحيحين من حديث أبي بشر جعفر بن إياس به وكذا رواه الضحاك عن ابن عباس وزاد فلما هاجر إلى المدينة سقط ذلك يفعل أي ذلك شاء وقال محمد بن إسحاق: حدثني داود بن الحصين عن عكرمة عن ابن عباس قال: كان رسول الله صلى الله عليه وسلم إذا جهر بالقرآن وهو يصلي تفرقوا عنه وأبوا أن يسمعوا منه فكان الرجل إذا أراد أن يسمع من رسول الله صلى الله عليه وسلم بعض ما يتلو وهو يصلى استرق السمع دونهم فرقا منهم فإذا رأى أنهم قد عرفوا أنه يستمع ذهب خشية أذاهم فلم يسمع فإن خفض صوته صلى الله عليه وسلم لم يسمع الذين يستمعون من قراءته شيئا فأنزل الله \"ولا تجهر بصلاتك\" فيتفرقوا عنك \"ولا تخافت بها\" فلا يسمع من أراد أن يسمع ممن يسترق ذلك منهم فلعله يرعوي إلى بعض ما يسمع فينتفع به \"وابتغ بين ذلك سبيلا\" وهكذا قال عكرمة والحسن البصري وقتادة نزلت هذه الآية في القراءة في الصلاة وقال شعبة عن أشعث بن سليم عن الأسود بن هلال عن ابن مسعود \"ولا تخافت بها\" من أسمع أذنيه قال ابن جرير: حدثنا يعقوب حدثنا ابن علية عن سلمة بن علقمة عن محمد بن سيرين قال: نبئت أن أبا بكر كان إذا صلى فقرأ خفض صوته وأن عمر كان يرفع صوته فقيل لأبي بكر لم تصنع هذا؟ قال أناجي ربي عز وجل وقد علم حاجتي فقيل أحسنت. وقيل لعمر لم تصنع هذا؟ قال أطرد الشيطان وأوقظ الوسنان قيل أحسنت فلما نزلت \"ولا تجهر بصلاتك ولا تخافت بها وابتغ بين ذلك سبيلا\" قيل لأبي بكر ارفع شيئا وقيل لعمر اخفض شيئا وقال أشعث بن سوار عن عكرمة عن ابن عباس: نزلت في الدعاء وهكذا روى الثوري ومالك عن هشام بن عروة عن أبيه عن عائشة رضي الله عنها أنها نزلت في الدعاء وكذا قال مجاهد وسعيد بن جبير وأبو عياض ومكحول وعروة بن الزبير وقال الثوري عن ابن عياش العامري عن عبدالله بن شداد قال كان أعرابي من بني تميم إذا سلم النبي صلى الله عليه وسلم قال: اللهم ارزقني إبلا وولدا: قال فنزلت هذه الآية \"ولا تجهربصلاتك ولا تخافت بها\". \"قول آخر\" قال ابن جرير حدثنا أبو السائب حدثنا حفص بن غياث عن هشام بن عروة عن أبيه عن عائشة رضي الله عنها نزلت هذه الآية في التشهد \"ولا تجهر بصلاتك ولا تخافت بها\" وبه قال حفص عن أشعث بن سوار عن محمد بن سيرين مثله \"قول آخر\" قال علي بن أبي طلحة عن ابن عباس في قوله \"ولا تجهر بصلاتك ولا تخافت بها\" قال لا تصل مراآة للناس ولا تدعها مخافة الناس وقال الثوري عن منصور عن الحسن البصري \"ولا تجهر بصلاتك ولا تخافت بها\" قال لا تحسن علانيتها وتسيء سريرتها وكذا رواه عبدالرزاق عن معمر عن الحسن به وهشام عن عوف عنه به وسعيد عن قتادة عنه كذلك. \"قول آخر\" قال عبدالرحمن بن زيد بن أسلم في قوله \"وابتغ بين ذلك سبيلا\" قال أهل الكتاب يخافتون ثم يجهر أحدهم بالحرف فيصيح به ويصيحون هم به وراءه فنهاه أن يصيح كما يصيح هؤلاء وأن يخافت كما يخافت القوم ثم كان السبيل الذي بين ذلك الذي سن له جبريل من الصلاة."
    },
    {
      "ayah": 111,
      "surah": 17,
      "text": "وقوله \"وقل الحمد لله الذي لم يتخذ ولدا ولم يكن له شريك في الملك ولم يكن له ولي من الذل\" أي ليس بدليل فيحتاج إلى أن يكون له ولي أو وزير أو مشير بل هو تعالى خالق الأشياء وحده لا شريك له ومدبرها ومقدرها بمشيئته وحده لا شريك له قال مجاهد في قوله \"ولم يكن له ولي من الذل\" لم يحالف أحدا ولم يبتغ نصر أحد \"وكبره تكبيرا\" أي عظمه وأجله عما يقول الظالمون المعتدون علوا كيبرا قال ابن جرير: حدنثي يونس أنبأنا ابن وهب أخبرني أبو صخر عن القرظي أنه كان يقول في هذه الآية \"وقل الحمد لله الذي لم يتخذ ولدا\" الآية قال إن اليهود والنصارى قالوا: اتخذ الله ولدا وقالت العرب: لبيك لا شريك لك إلا شريكًا هو لك تملكه وما ملك. وقال الصابئون والمجوس: لولا أولياء الله لذل فأنزل الله هذه الآية \"وقل الحمد لله الذي لم يتخذ ولدا ولم يكن له شريك في الملك ولم يكن له ولي من الذل وكبره تكبيرا\" وقال أيضا: حدثنا بشر حدثنا يزيد حدثنا سعيد عن قتادة ذكر لنا أن النبي صلى الله عليه وسلم كان يعلم أهله هذه الآية \"الحمد لله الذي لم يتخذ ولدا\" الآية الصغير من أهله والكبير. قلت: وقد جاء في حديث أن رسول الله صلى الله عليه وسلم سمى هذه الآية آية العز وفي بعض الآثار أنها ما قرئت في بيت في ليلة فيصيبه سرق أو آفة والله أعلم وقال الحافظ أبو يعلى حدثنا بشر بن سيحان البصري حدثنا حرب بن ميمون حدثنا موسى بن عبيدة الزبيدي عن محمد بن كعب القرظي عن أبي هريرة قال: خرجت أنا ورسول الله صلى الله عليه وسلم ويده في يدي أو يدي في يده فأتى على رجل رث الهيئة فقال \"أي فلان ما بلغ بك ما أرى؟\" قال السقم والضر يا رسول الله قال \"ألا أعلمك كلمات تذهب عنك السقم والضر؟\" قال بلى ما يسرني إن شهدت بها معك بدرا أو أحدا قال فضحك رسول الله صلى الله عليه وسلم وقال \"وهل يدرك أهل بدر وأهل أحد ما يدرك الفقير القانع؟\" قال فقال أبو هريرة يا رسول الله إياي فعلمني قال \"فقل يا أبا هريرة توكلت على الحي الذي لا يموت الحمد لله الذي لم يتخذ ولدا ولم يكن له شريك في الملك ولم يكن ولي من الذل وكبره تكبيرا\" قال فأتى علي رسول صلى الله عليه وسلم وقد حسنت حالي قال: فقال لي \"مهيم\" قال: قلت يا رسول الله لم أزل أقول الكلمات التي علمتني إسناده ضعيف وفي متنه نكارة والله أعلم. آخر تفسير سورة سبحان ولله الحمد والمنة."
    },
    {
      "ayah": 12,
      "surah": 17,
      "text": "يمتن تعالى على خلقه بآياته العظام، فمنها مخالفته بين الليل والنهار ليسكنوا في الليل وينتشروا في النهار للمعايش والصنائع والأعمال والأسفار، وليعلموا عدد الأيام والجمع والشهور والأعوام، ويعرفوا مضي الآجال المضروبة للديون والعبادات والمعاملات والإجازات وغير ذلك، ولهذا قال: {لتبتغوا فضلا من ربكم}: أي في معايشكم وأسفاركم ونحو ذلك، {ولتعلموا عدد السنين والحساب}، فإنه لو كان الزمان كله نسقاً واحداً وأسلوباً متساوياً لما عرف شيء من ذلك، كما قال تعالى: {قل أرأيتم إن جعل اللّه عليكم الليل سرمدا إلى يوم القيامة مَن إله غير اللّه يأتيكم بضياء؟ أفلا تسمعون}، وقال تعالى: {وهو الذي جعل الليل والنهار خلفة لمن أراد أن يذكر أو أراد شكورا}، وقال تعالى: {وله اختلاف الليل والنهار}، وقال: {يكور الليل على النهار ويكور النهار على الليل} الآية، وقال تعالى: {فالق الإصباح وجعل الليل سكنا والشمس والقمر حسبانا ذلك تقدير العزيز العليم}، ثم إنه تعالى جعل لليل آية، أي علامة يعرف بها، وهي الظلام وظهور القمر فيه، وللنهار علامة، وهي النور وطلوع الشمس النيرة فيه، وفاوت بين نور القمر وضياء الشمس ليعرف هذا من هذا، كما قال تعالى: {هو الذي جعل الشمس ضياء والقمر نورا وقدره منازل لتعلموا عدد السنين والحساب ما خلق الله ذلك إلا بالحق}، وقال تعالى: {يسألونك عن الأهلة قل هي مواقيت للناس والحج} الآية. قال ابن جريج عن عبد اللّه بن كثير في قوله: {فمحونا آية الليل وجعلنا آية النهار مبصرة} قال( ظلمة الليل وسدف النهار، وعن مجاهد: الشمس آية النهار، والقمر آية الليل. وقال ابن عباس: كان القمر يضيء كما تضيء الشمس، والقمر آية الليل، والشمس آية النهار، فمحونا آية الليل السواد الذي في القمر. وقال قتادة: كنا نحدث أن محو آية الليل سواد القمر الذي فيه، وجعلنا آية النهار مبصرة أي منيرة، وخلق الشمس أنور من القمر وأعظم، وقال ابن عباس: {وجعلنا الليل والنهار آيتين} قال: ليلاً ونهاراً، كذلك خلقهما اللّه عزَّ وجلَّ."
    },
    {
      "ayah": 13,
      "surah": 17,
      "text": "يقول تعالى بعد ذكر الزمان وذكر ما يقع فيه من أعمال بني آدم \"وكل إنسان ألزمناه طائره في عنقه\" وطائره هو ما طار عنه من عمله كما قال ابن عباس ومجاهد وغيرهما من خير وشر ويلزم به ويجازى عليه \"فمن يعمل مثقال ذرة خيرا يره ومن يعمل مثقال ذرة شرا يره\" وقال تعالى \"عن اليمين وعن الشمال قعيد ما يلفظ من قول إلا لديه رقيب عتيد\" وقال \"وإن عليكم لحافظين كراما كاتبين يعلمون ما تفعلون\" وقال \"إنما تجزون ما كنتم تعملون\" وقال \"من يعمل سوءا يجز به\" والمقصود أن عمل ابن آدم محفوظ عليه قليله وكثيره ويكتب عليه ليلا ونهارا صباحا ومساء. وقال الإمام أحمد حدثنا قتيبة حدثنا ابن لهيعة عن أبى الزبير عن جابر سمعت رسول الله صلى الله عليه وسلم يقول \" لطائر كل إنسان في عنقه\" قال ابن لهيعة يعني الطيرة وهذا القول من ابن لهيعة في تفسير هذا الحديث غريب جدا والله أعلم. وقوله \"ونخرج له يوم القيامة كتابا يلقاه منشورا\" أي نجمع له عمله كله في كتاب يعطاه يوم القيامة إما بيمينه إن كان سعيدا أو بشماله إن كان شقيا منشورا أي مفتوحا يقرؤه هو وغيره فيه جميع عمله من أول عمره إلى آخره \"ينبأ الإنسان يومئذ بما قدم وأخر بل الإنسان على نفسه بصيرة ولو ألقى معاذيره\"."
    },
    {
      "ayah": 14,
      "surah": 17,
      "text": "ولهذا قال تعالى \"اقرأ كتابك كفى بنفسك اليوم عليك حسيبا\" أي إنك تعلم أنك لم تظلم ولم يكتب عليك إلا ما عملت لأنك ذكرت جميع ما كان منك ولا ينسى أحد شيئا مما كان منه وكل أحد يقرأ كتابه من كاتب وأمي وقوله \"ألزمناه طائره في عنقه\" إنما ذكر العنق لأنه عضو من الأعضاء لا نظير له في الجسد ومن ألزم بشيء فيه فلا محيد له عنه كما قال الشاعر: اذهب بها اذهب بها طوقتها طوق الحمام قال قتادة عن جابر بن عبدالله عن النبي صلى الله عليه وسلم أنه قال \"لا عدوى ولا طيرة وكل إنسان ألزمناه طائره في عنقه\" كذا رواه ابن جرير وقد رواه الإمام عبد بن حميد في مسنده متصلا فقال: حدثنا الحسن بن موسى حدثنا ابن لهيعة عن أبي الزبير عن جابر قال: سمعت رسول الله صلى الله عليه وسلم يقول \"طير كل عبد في عنقه\". وقال الإمام أحمد حدثنا علي بن إسحاق حدثنا عبدالله حدثنا ابن لهيعة حدثني يزيد أن أبا الخير حدثه أنه سمع عقبة بن عامر رضي الله عنه يحدث عن النبي صلى الله عليه وسلم قال \"ليس من عمل يوم إلا وهو يختم عليه فإذا مرض المؤمن قالت الملائكة يا ربنا عبدك فلان قد حبسته فيقول الرب جل جلاله اختموا له على مثل عمله حتى يبرأ أو يموت\" إسناده جيد قوي ولم يخرجوه وقال معمر عن قتادة \"ألزمناه طائره في عنقه\" قال عمله \"ونخرج له يوم القيامة\" قال نخرج ذلك العمل \"كتابا يلقاه منشورا\" قال معمر وتلا الحسن البصري \"عن اليمين وعن الشمال قعيد\" يا ابن آدم بسطت لك صحيفتك وكل بك ملكان كريمان أحدهما عن يمينك والآخر عن شمالك فأما الذي عن يمينك فيحفظ حسناتك وأما الذي عن شمالك فيحفظ سيئاتك فاعمل ما شئت أقلل أو أكثر حتى إذا مت طويت صحيفتك فجعلت في عنقك معك في قبرك حتى نخرج يوم القيامة كتابا تلقاه منشورا اقرأ كتابك الآية فقد عدل والله من جعلك حسيب نفسك هذا من أحسن كلام الحسن رحمه الله."
    },
    {
      "ayah": 15,
      "surah": 17,
      "text": "يخبر تعالى أن \"من اهتدى\" واتبع الحق واقتفى أثر النبوة فإنما يحمل عاقبة ذلك الحميدة لنفسه \"ومن ضل\" أي عن الحق وزاغ عن سبيل الرشاد فإنما يجني على نفسه وإنما يعود وبال ذلك عليه ثم قال \"ولا تزر وازرة وزر أخرى\" أي لا يحمل أحد ذنب أحد ولا يجني جان إلا على نفسه كما قال تعالى \"وإن تدع مثقلة إلى حملها لا يحمل منه شيء\" ولا منافاة بين هذا وبين قوله \"وليحملن أثقالهم وأثقالا مع أثقالهم\" وقوله \"ومن أوزار الذين يضلونهم بغير علم\" فإن الدعاة عليهم إثم ضلالتهم في أنفسهم وإثم آخر بسبب ما أضلوا من أضلوا من غير أن ينقص من أوزار أولئك ولا يحمل عنهم شيئا. وهذا من عدل الله ورحمته بعباده وكذا قوله تعالى وما كنا معذبين حتى نبعث رسولا\" إخبار عن عدله تعالى وأنه لا يعذب أحدا إلا بعد قيام الحجة عليه بإرسال الرسول إليه كقوله تعالى \"كلما ألقي فيها فوج سألهم خزنتها ألم يأتكم نذير قالوا بلى قد جاءنا نذير فكذبنا وقلنا ما نزل الله من شيء إن أنتم إلا في ضلال كبير\" وكذا قوله \"وسيق الذين كفروا إلى جهنم زمرا حتى إذا جاءوها فتحت أبوابها وقال لهم خزنتها ألم يأتكم رسل منكم يتلون عليكم آيات ربكم وينذرونكم لقاء يومكم هذا قالوا بلى ولكن حقت كلمة العذاب على الكافرين\" وقال تعالى \"وهم يصطرخون فيها ربنا أخرجنا نعمل صالحا غير الذي كنا نعمل أو لم نعمركم ما يتذكر فيه من تذكر وجاءكم النذير فذوقوا فما للظالمين من نصير\" إلى غير ذلك من الآيات الدالة على أن الله تعالى لا يدخل أحدا النار إلا بعد إرسال الرسول إليه ومن ثم طعن جماعة من العلماء في اللفظة التي جاءت معجمة في صحيح البخاري عند قوله تعالى \"إن رحمة الله قريب من المحسنين\". حدثنا عبدالله بن سعيد حدثنا يعقوب حدثنا أبي عن صالح بن كيسان عن الأعرج بإسناده إلى أبي هريرة أن رسول الله صلى الله عليه وسلم قال \"اختصمت الجنة والنار\" فذكر الحديث إلى أن قال \"وأما الجنة فلا يظلم الله من خلقه أحدا وإنه ينشئ للنار خلقا فيلقون فيها فتقول هل من مزيد؟ ثلاثا\" وذكر تمام الحديث فهذا إنما جاء في الجنة لأنها دار فضل وأما النار فإنها دار عدل لا يدخلها أحد إلا بعد الإعذار إليه وقيام الحجة عليه وقد تكلم جماعة من الحفاظ في هذه اللفظة وقالوا لعله انقلب على الراوي بدليل ما أخرجاه في الصحيحين واللفظ للبخاري من حديث عبدالرزاق عن معمر عن همام عن أبي هريرة قال: قال النبي صلى الله عليه وسلم \"تحاجت الجنة والنار\" فذكر الحديث إلى أن قال \"فأما النار فلا تمتلئ حتى يضع فيها قدمه فتقول قط قط فهنالك تمتلئ وينزوي بعضها إلى بعض ولا يظلم الله من خلقه أحدا وأما الجنة فإن الله ينشئ لها خلقا\". بقي ههنا مسألة قد اختلف الأئمة رحمهم الله تعالى فيها قديما وحديثا وهي الولدان الذين ماتوا وهم صغار وآباؤهم كفار ماذا حكمهم وكذا المجنون والأصم الشيخ الخرف ومن مات في الفترة ولم تبلغه دعوته وقد ورد في شأنهم أحاديث أنا أذكرها لك بعون الله وتوفيقه ثم نذكر فصلا ملخصا من كلام الأئمة والله المستعان \"فالحديث الأول\" عن الأسود بن سريع قال الإمام أحمد حدثنا علي بن عبدالله حدثنا معاذ بن هشام حدثنا أبي عن قتادة عن الأحنف بن قيس عن الأسود بن سريع أن رسول الله صلى الله عليه وسلم قال \"أربعة يحتجون يوم القيامة: رجل أصم لا يسمع شيئا ورجل أحمق ورجل هرم ورجل مات في فترة فأما الأصم فيقول رب قد جاء الإسلام وما أسمع شيئا وأما الأحمق فيقول رب قد جاء الإسلام والصبيان يحذفوني بالبعر وأما الهرم فيقول رب لقد جاء الإسلام وما أعقل شيئا وأما الذى مات في الفترة فيقول رب ما أتاني لك رسول. فيأخذ مواثيقهم ليطيعنه فيرسل إليهم أن ادخلوا النار فوالذي نفس محمد بيده لو دخلوها لكانت عليهم بردا وسلاما\" وبالإسناد عن قتادة عن الحسن عن أبي رافع عن أبى هريرة مثله غير أنه قال في آخره فمن دخلها كانت عليه بردا وسلاما ومن لم يدخلها يسحب إليها\" وكذا رواه إسحاق بن راهويه عن معاذ بن هشام ورواه البيهقي في كتاب الاعتقاد من حديث أحمد بن إسحاق عن علي بن عبدالله المديني به وقال هذا إسناد صحيح وكذا رواه حماد بن سلمة عن علي بن زيد عن أبي رافع عن أبي هريرة قال: قال رسول الله صلى الله عليه وسلم أربعة كلهم يدلي على الله بحجة فذكر نحوه ورواه ابن جرير من حديث معمر عن همام عن أبي هريرة فذكره مرفوعا ثم قال أبو هريرة فاقرأوا إن شئتم \"وما كنا معذبين حتى نبعث رسولا\" وكذا رواه معمر عن عبدالله بن طاوس عن أبيه عن أبي هريرة موقوقا. \"الحديث الثاني\" عن أنس بن مالك قال أبو داود الطيالسي حدثنا الربيع عن يزيد هو ابن أبان قال: قلنا لأنس يا أبا حمزة ما تقول في أطفال المشركين؟ فقال: قال رسول الله لم يكن لهم سيئات فيعذبوا بها فيكونوا من أهل النار ولم يكن لهم حسنات فيجازوا بها فيكونوا من أهل الجنة\". \"الحديث الثاني\" عن أنس أيضا. قال الحافظ أبو يعلى حدثنا أبو خيثمة حدثنا جرير عن ليث عن عبد الوارث عن أنس قال: قال رسول الله صلى الله عليه وسلم \"يؤتى بأربعة يوم القيامة: بالمولود والمعتوه ومن مات في الفترة والشيخ الفاني الهم كلهم يتكلم بحجته فيقول الرب تبارك وتعالى لعنق من النار أبرز ويقول لهم إني كنت أبعث إلى عبادي رسلا من أنفسهم وإني رسول نفسي إليكم ادخلوا هذه قال: فيقول من كتب عليه الشقاء يا رب أنى ندخلها ومنها كنا نفر؟ قال: ومن كتب عليه السعادة يمضي فيقتحم فيها مسرعا قال: فيقول الله تعالى أنتم لرسلي أشد تكذيبا ومعصية فيدخل هؤلاء الجنة وهؤلاء النار\" وهكذا رواه الحافظ أبو بكر البزار عن يوسف بن موسى عن جرير بن عبد الحميد بإسناده مثله \"الحديث الرابع\" عن البراء بن عازب رضي الله عنه قال الحافظ أبو يعلى الموصلي في مسنده أيضا حدثنا قاسم بن أبي شيبة حدثنا عبدالله يعني ابن داود عن عمر بن ذر عن يزيد بن أمية عن البراء قال: سئل رسول الله صلى الله عليه وسلم عن أطفال المسلمين قال \"هم مع آبائهم\" وسئل عن أولاد المشركين فقال \"هم مع آبائهم\" فقيل يا رسول الله ما يعملون؟ قال \"الله أعلم بهم\" ورواه عمر بن ذر عن يزيد بن أمية عن رجل عن البراء عن عائشة فذكره \"الحديث الخامس\" عن ثوبان قال الحافظ أبو بكر أحمد بن عمرو بن عبد الخالق البزار في مسنده حدثنا إبراهيم بن سعيد الجوهري حدثنا ريحان بن سعيد حدثنا عباد بن منصور عن أيوب عن أبي قلابة عن أبي أسماء عن ثوبان أن النبي صلى الله عليه وسلم عظم شأن المسألة قال \"إذا كان يوم القيامة جاء أهل الجاهلية يحملون أوزارهم على ظهورهم فسألهم ربهم فيقولون ربنا لم ترسل إلينا رسولا ولم يأتنا لك أمر ولو أرسلت إلينا رسولا لكنا أطوع عبادك فيقول لهم ربهم: أرأيتم إن أمرتكم بأمر تطيعوني؟ فيقولون نعم فيأمرهم أن يعمدوا إلى جهنم فيدخلوها فينطلقون حتى إذا دنوا منها وجدوا لها تغيظا وزفيرا فرجعوا إلى ربهم فيقولون ربنا أخرجنا أو أجرنا منها فيقول لهم ألم تزعموا أني إن أمرتكم بأمر تطيعوني؟ فيأخذ على ذلك مواثيقهم فيقول اعمدوا إليها فادخلوها فينطلقون حتى إذا رأوها فرقوا منها ورجعوا فقالوا ربنا فرقنا منها ولا نستطيع أن ندخلها فيقول ادخلوها داخرين\" فقال نبي الله صلى الله عليه وسلم \"لو دخلوها أول مرة كانت عليهم بردا وسلاما\" ثم قال البزار ومتن هذا الحديث غير معروف إلا من هذا الوجه لم يروه عن أيوب إلا عباد ولا عن عباد إلا ريحان بن سعيد قلت وقد ذكره ابن حبان في ثقاته وقال يحيى بن معين والنسائي لا بأس به ولم يرضه أبو داود وقال أبو حاتم شيخ لا بأس به يكتب حديثه ولا يحتج به \"الحديث السادس\" عن أبي سعيد سعد بن مالك بن سنان الخدري: قال الإمام محمد بن يحيى الذهلي حدثنا سعيد بن سليمان عن فضيل بن مرزوق عن عطية عن أبي سعيد قال: قال رسول الله صلى الله عليه وسلم \"الهالك في الفترة والمعتوه والمولود: يقول الهالك في الفترة لم يأتني كتاب ويقول المعتوه رب لم تجعل لي عقلا أعقل به خيرا ولا شرا ويقول المولود رب لم أدرك العقل فترفع لهم نار فيقال لهم ردوها قال فيردها من كان في علم الله سعيدا لو أدرك العمل ويمسك عنها من كان في علم الله شقيا لو أدرك العمل فيقول إياي عصيتم فكيف لو أن رسلي أتتكم؟\" وكذا رواه البزار عن محمد بن عمر بن هياج الكوفي عن عبيد الله بن موسى عن فضيل بن مرزوق به ثم قال لا يعرف من حديث أبي سعيد إلا من طريقه عن عطية عنه وقال في آخره \"فيقول الله إياي عصيتم فكيف برسلي بالغيب\" \"الحديث السابع\" عن معاذ بن جبل رضي الله عنه قال هشام بن عمار ومحمد بن المبارك الصوري حدثنا عمرو بن واقد عن يونس بن جليس عن أبي إدريس الخولاني عن معاذ بن جبل عن نبي الله صلى الله عليه وسلم قال \"يؤتى يوم القيامة بالممسوخ عقلا وبالهالك في الفترة وبالهالك صغيرا فيقول الممسوخ يا رب لو آتيتني عقلا ما كان من آتيته عقلا بأسعد مني\" وذكر في الهالك في الفترة والصغير نحو ذلك \"فيقول الرب عز وجل إني آمركم فتطيعوني؟ فيقولون نعم فيقول اذهبوا فادخلوا النار قال: ولو دخلوها ماضرتهم فتخرج عليهم قوابص فيظنون أنها قد أهلكت ما خلق الله من شيء فيرجعون سراعا ثم يأمرهم الثانية فيرجعون كذلك يقول الرب عز وجل قبل أن أخلقكم علمت ما أنتم عاملون وعلى علمي خلقتكم وإلى علمي تصيرون ضُمِّيهِمْ فتأخذهم النار\" \"الحديث الثامن\" عن أبي هريرة رضي الله عنه وأرضاه. قد تقدم روايته مندرجة مع رواية الأسود بن سريع رضي الله عنه وفي الصحيحين عن أبي هريرة رضي الله عنه أن رسول الله صلى الله عليه وسلم قال \"كل مولود يولد على الفطرة فأبواه يهودانه أو ينصرانه أو يمجسانه كما تنتج البهيمة بهيمة جمعاء هل تحسون فيها من جدعاء؟\" وفي رواية قالوا: يا رسول الله أفرأيت من يموت صغيرا؟ قال \"الله أعلم بما كانوا عاملين\". وقال الإمام أحمد حدثنا موسى بن داود حدثنا عبدالرحمن بن ثابت عن عطاء بن ضمرة عن عبدالله بن ضمرة عن أبي هريرة رضي الله عنه عن النبي صلى الله عليه وسلم فيما أعلم شك موسى قال \"ذراري المسلمين في الجنة يكفلهم إبراهيم عليه السلام\" وفي صحيح مسلم عن عياض بن حماد عن رسول الله صلى الله عليه وسلم عن الله عز وجل أنه قال \"إني خلقت عبادي حنفاء\" وفي رواية لغيره \"مسلمين\" \"الحديث التاسع\" عن سمرة رضي الله عنه رواه الحافظ أبو بكر البرقاني في كتابه المستخرج على البخاري من حديث عوف الأعرابي. عن أبي رجاء العطاردي عن سمرة رضي الله عنه عن النبي صلى الله عليه وسلم قال \"كل مولود يولد على الفطرة\" فناداه الناس يا رسول الله وأولاد المشركين؟ قال \"وأولاد المشركين\" وقال الطبراني: حدثنا عبدالله بن أحمد حدثنا عقبة بن مكرم الضبي عن عيسى بن شعيب عن عباد بن منصور عن أبي رجاء عن سمرة قال سألنا رسول الله صلى الله عليه وسلم عن أطفال المشركين قال \"هم خدم أهل الجنة\". \"الحديث العاشر\" عن عم خنساء. قال أحمد حدثنا روح حدثنا عوف عن خنساء بنت معاوية من بني صريم قالت حدثني عمي قال: قلت يا رسول الله من في الجنة؟ قال \"النبي في الجنة والشهيد في الجنة والمولود في الجنة والوئيد في الجنة\" فمن العلماء من ذهب إلى الوقوف فيهم لهذا الحديث ومنهم من جزم لهم بالجنة لحديث سمرة بن جندب في صحيح البخاري أنه عليه السلام قال في جملة ذلك المنام حين مر على ذلك الشيخ تحت الشجرة وحوله ولدان فقال له جبريل: هذا إبراهيم عليه السلام وهؤلاء أولاد المسلمين وأولاد المشركين قالوا: يا رسول الله وأولاد المشركين؟ قال \"نعم وأولاد المشركين\" ومنهم من جزم لهم بالنار لقوله عليه السلام \"هم مع آبائهم\". ومنهم من ذهب إلى أنهم يمتحنون يوم القيامة في العرصات فمن أطاع دخل الجنة وانكشف علم الله فيهم بسابق السعادة ومن عصى دخل النار داخرا وانكشف علم الله فيه بسابق الشقاوة. وهذا القول يجمع بين الأدلة كلها وقد صرحت به الأحاديث المتقدمة المتعاضدة الشاهد بعضها لبعض وهذا القول هو الذي حكاه الشيخ أبو الحسن علي بن إسماعيل الأشعري عن أهل السنة والجماعة وهو الذي نصره الحافظ أبو بكر البيهقي في كتاب الاعتقاد وكذلك غيره من محققي العلماء والحفاظ والنقاد. وقد ذكر الشيخ أبو عمر بن عبد البر النمري بعد ما تقدم من أحاديث الامتحان ثم قال: وأحاديث هذا الباب ليست قوية ولا تقوم بها حجة وأهل العلم ينكرونها لأن الآخرة دار جزاء وليست بدار عمل ولا ابتلاء فكيف يكلفون دخول النار وليس ذلك في وسع المخنوقين والله لا يكلف نفسا إلا وسعها \"والجواب\" عما قال إن أحاديث هذا الباب منها ما هو صحيح كما قد نص على ذلك كثير من أئمة العلماء ومنها ما هو حسن ومنها ما هو ضعيف يقوى بالصحيح والحسن وإذا كانت أحاديث الباب الواحد متصلة متعاضدة على هذا النمط أفادت الحجة عند الناظر فيها وأما قوله إن الدار الآخرة دار جزاء فلا شك أنها دار جزاء ولا ينافي التكليف في عرصاتها قبل دخول الجنة أو النار كما حكاه الشيخ أبو الحسن الأشعري عن مذهب أهل السنة والجماعة من امتحان الأطفال وقد قال تعالى \"يوم يكشف عن ساق ويدعون إلى السجود\" الآية وقد ثبت في الصحاح وغيرها أن المؤمنين يسجدون لله يوم القيامة وأن المنافق لا يستطيع ذلك ويعود ظهره كالصفيحة الواحدة طبقا واحدا كلما أراد السجود خر لقفاه. وفي الصحيحين في الرجل الذي يكون آخر أهل النار خروجا منها أن الله يأخذ عهوده ومواثيقه أن لا يسأل غير ما هو فيه ويتكرر ذلك مرارا ويقول الله تعالى: \"يا ابن آدم ما أغدرك\" ثم يأذن له في دخول الجنة وأما قوله فكيف يكلفهم الله دخول النار وليس ذلك في وسعهم فليس هذا بمانع من صحة الحديث فإن الله يأمر العباد يوم القيامة بالجواز على الصراط وهو جسر على جهنم أحد من السيف وأدق من الشعرة ويمر المؤمنون عليه بحسب أعمالهم كالبرق وكالريح وكأجاويد الخيل والركاب ومنهم الساعي ومنهم الماشي ومنهم من يحبو حبوا ومنهم المكدوش على وجهه في النار وليس ما ورد في أولئك بأعظم من هذا بل هذا أطم وأعظم وأيضا فقد ثبتت السنة بأن الدجال يكون معه جنة ونار وقد أمر الشارع المؤمنين الذين يدركونه أن يشرب أحدهم من الذي يرى أنه نار فإنه يكون عليه بردا وسلاما فهذا نظير ذاك وأيضا فإن الله تعالى أمر بني إسرائيل أن يقتلوا أنفسهم فقتل بعضهم بعضا حتى قتلوا فيما قيل في غداة واحدة سبعين ألفا يقتل الرجل أباه وأخاه وهم في عماية غمامة أرسلها الله عليهم وذلك عقوبة لهم على عبادتهم العجل وهذا أيضا شاق على النفوس جدا لا يتقاصر عما ورد في الحديث المذكور والله أعلم. \"فصل\" إذا تقرر هذا فقد اختلف الناس في ولدان المشركين على أقوال \"أحداها\" أنهم في الجنة واحتجوا بحديث سمرة أنه عليه السلام رأى مع إبراهيم عليه السلام أولاد المسلمين وأولاد المشركين وبما تقدم في رواية أحمد عن خنساء عن عمها أن رسول الله صلى الله عليه وسلم قال \"والمولود في الجنة\" وهذا استدلال صحيح ولكن أحاديث الامتحان أخص منه. فمن علم الله منه أنه يطيع جعل روحه في البرزخ مع إبراهيم وأولاد المسلمين الذين ماتوا على الفطرة ومن علم منه أنه لا يجيب فأمره إلى الله تعالى ويوم القيامة يكون في النار كما دلت عليه أحاديث الامتحان ونقله الأشعري عن أهل السنة ثم إن هؤلاء القائلين بأنهم في الجنة منهم من يجعلهم مستقلين فيها ومنهم من يجعلهم خدما لهم كما جاء في حديث علي بن زيد عن أنس عند أبي داود الطيالسي وهو ضعيف والله أعلم. \"والقول الثاني\" أنهم مع آبائهم في النار واستدل عليه بما رواه الإمام أحمد بن حنبل عن أبي المغيرة حدثنا عتبة بن ضمرة بن حبيب حدثني عبدالله بن أبى قيس مولى غطيف أنه أتى عائشة فسألها عن ذراري الكفار فقالت قال رسول الله صلى الله عليه وسلم \"هم تبع لآبائهم\" فقلت يا رسول الله بلا أعمال؟ فقال \"الله أعلم بما كانوا عاملين\" وأخرجه أبو داود من حديث محمد بن حرب عن محمد بن زياد الألهاني سمعت عبدالله بن أبي قيس سمعت عائشة تقول سألت رسول الله صلى الله عليه وسلم عن ذراري المؤمنين قال \"هم مع آبائهم\" قلت فذراري المشركين؟ قال \"هم مع آبائهم\" فقلت بلا عمل؟ قال \"الله أعلم بما كانوا عاملين\" ورواه أحمد أيضا عن وكيع عن أبي عقيل يحيى بن المتوكل وهو متروك عن مولاته بهية عن عائشة أنها ذكرت أطفال المشركين لرسول الله صلى الله عليه وسلم فقال \"إن شئت أسمعتك تضاغيهم في النار\" وروى عبدالله بن الإمام أحمد حدثنا عثمان بن أبي شيبة عن محمد بن فضيل بن غزوان عن محمد بن عثمان عن زاذان عن علي رضي الله عنه قال: سألت خديجة رسول الله صلى الله عليه وسلم عن ولدين لها ماتا في الجاهلية فقال \"هما في النار\" قال فلما رأى الكراهية في وجهها فقال \"لها لو رأيت مكانهما لأبغضتهما\" قالت فولدي منك؟ قال \"إن المؤمنين وأولادهم في الجنة وإن المشركين وأولادهم في النار- ثم قرأ \"والذين آمنوا واتبعتهم ذريتهم بإيمان ألحقنا بهم ذريتهم\" وهذا حديث غريب فإن في إسناده محمد بن عثمان مجهول الحال وشيخه زاذان لم يدرك عليا والله أعلم. وروى أبو داود من حديث ابن أبي زائدة عن أبيه عن الشعبي قال: قال رسول الله صلى الله عليه وسلم \"الوائدة والموءودة في النار\" ثم قال الشعبي حدثني به علقمة عن أبي وائل عن ابن مسعود وقد رواه جماعة عن داود بن أبي هند عن الشعبي عن علقمة عن سلمة بن قيس الأشجعي قال: أتيت أنا وأخي النبي صلى الله عليه وسلم فقلنا إن أمنا ماتت في الجاهلية وكانت تقري الضيف وتصل الرحم وأنها وأدت أختا لنا في الجاهلية لم تبلغ الحنث فقال \"الوائدة والموءودة في النار إلا أن تدرك الوائدة الإسلام فتسلم\" وهذا إسناد حسن. \"والقول الثالث\" التوقف فيهم واعتمدوا على قوله صلى الله عليه وسلم \"الله أعلم بما كانوا عاملين\" وهو في الصحيحين من حديث جعفر بن أبي أياس عن سعيد بن جبير عن ابن عباس سئل رسول الله صلى الله عليه وسلم عن أولاد المشركين قال \"الله أعلم بما كانوا عاملين\" وكذلك هو في الصحيحين من حديث الزهري عن عطاء بن يزيد وعن أبي سلمة عن أبي هريرة عن النبي صلى الله عليه وسلم أنه سئل عن أطفال المشركين فقال \"الله أعلم بما كانوا عاملين\" ومنهم من جعلهم من أهل الأعراف وهذا القول يرجع إلى قول من ذهب إلى أنهم من أهل الجنة لأن الأعراف ليس دار قرار ومآل أهلها إلى الجنة كما تقدم تقرير ذلك في سورة الأعراف والله أعلم. \"فصل\" وليعلم أن هذا الخلاف مخصوص بأطفال المشركين فأما ولدان المؤمنين فلا خلاف بين العلماء كما حكاه القاضي أبو يعلى بن الفراء الحنبلي عن الإمام أحمد أنه قال: لا يختلف فيهم أنهم من أهل الجنة وهذا هو المشهور بين الناس وهو الذي نقطع به إن شاء الله عز وجل. فأما ما ذكره الشيخ أبو عمر بن عبد البر من بعض العلماء أنهم توقفوا في ذلك وأن الولدان كلهم تحت المشيئة قال أبو عمر ذهب إلى هذا القول جماعة من أهل الفقه والحديث منهم حماد بن زيد وحماد بن سلمة وابن المبارك وإسحاق بن راهويه وغيرهم قال وهو يشبه ما رسم مالك في موطئه في أبواب القدر وما أورده من الأحاديث في ذلك وعلى ذلك أكثر أصحابه وليس عن مالك فيه شيء منصوص إلا أن المتأخرين من أصحابه ذهبوا إلى أن أطفال المسلمين في الجنة وأطفال المشركين خاصة في المشيئة انتهى كلامه وهو غريب جدا. وقد ذكر أبو عبدالله القرطبي في كتاب التذكرة نحو ذلك أيضا والله أعلم. وقد ذكروا في ذلك أيضا حديث عائشة بنت طلحة عن عائشة أم المؤمنين قالت: دعي النبي صلى الله عليه وسلم إلى جنازة صبي من الأنصار فقلت يا رسول الله طوبى له عصفور من عصافير الجنة لم يعمل السوء ولم يدركه فقال \"أو غير ذلك يا عائشة إن الله خلق الجنة وخلق لها أهلا وهم في أصلاب آبائهم وخلق النار وخلق لها أهلا وهم في أصلاب آبائهم\" رواه مسلم وأحمد وأبو داود والنسائي وابن ماجه. ولما كان الكلام في هذه المسألة يحتاج إلى دلائل صحيحة جيدة وقد يتكلم فيها من لا علم عنده عن الشارع كره جماعة من العلماء الكلام فيها روي ذلك عن ابن عباس والقاسم بن محمد بن أبي بكر الصديق ومحمد بن الحنفية وغيرهم. وأخرج ابن حبان في صحيحه عن جرير بن حازم سمعت أبا رجاء العطاردي سمعت ابن عباس رضي الله عنهما وهو على المنبر يقول: قال رسول الله صلى الله عليه وسلم \"لا يزال أمر هذه الأمة مواتيا أو مقاربا ما لم يتكلموا في الولدان والقدر\" قال ابن حبان يعني أطفال المشركين وهكذا رواه أبو بكر البزار من طريق جرير ابن حازم به ثم قال وقد رواه جماعة عن أبي رجاء عن ابن عباس موقوفا."
    },
    {
      "ayah": 16,
      "surah": 17,
      "text": "اختلف القراء في قراءة قوله \"أمرنا\" فالمشهور قراءة التخفيف واختلف المفسرون في معناها فقيل معناه أمرنا مترفيها ففسقوا فيها أمرا قدريا كقوله تعالى \"أتاها أمرنا ليلا أو نهارا\" إن الله لا يأمر بالفحشاء قالوا معناه أنه سخرهم إلى فعل الفواحش فاستحقوا العذاب وقيل معناه أمرناهم بالطاعات ففعلوا الفواحش فاستحقوا العقوبة. رواه ابن جريج عن ابن عباس وقاله سعيد بن جبير أيضا وقال ابن جرير يحتمل أن يكون معناه جعلناهم أمراء قلت إنما يجيء هذا على قراءة من قرأ \"أمرنا مترفيها\" قال علي بن طلحة عن ابن عباس قوله \"أمرنا مترفيها ففسقوا فيها\" يقول سلطنا أشرارها فعصوا فيها فإذا فعلوا ذلك أهلكهم الله بالعذاب وهو قوله \"وكذلك جعلنا في كل قرية أكابر مجرميها\" الآية وكذا قال أبو العالية ومجاهد والربيع بن أنس وقال العوفي عن ابن عباس \"وإذا أردنا أن نهلك قرية أمرنا مترفيها ففسقوا فيها\" يقول أكثرنا عددهم وكذا قال عكرمة والحسن والضحاك وقتادة وعن مالك عن الزهري \"أمرنا مترفيها\" أكثرنا وقد استشهد بعضهم بالحديث الذي رواه الإمام أحمد حيث قال: حدثنا روح بن عبادة حدثنا أبو نعيم العدوي عن مسلم بن بديل عن إياس بن زهير عن سويد بن هبيرة عن النبي صلى الله عليه وسلم قال \"خير مال امرئ له مهرة مأمورة أو سكة مأبورة\" قال الإمام أبو عبيد القاسم بن سلام رحمه الله في كتابه الغريب المأمورة كثيرة النسل والسكة الطريقة المصطفة من النخل والمأبورة من التأبير وقال بعضهم إنما جاء هذا متناسبا كقوله \"مأزورات غير مأجورات\"."
    },
    {
      "ayah": 17,
      "surah": 17,
      "text": "يقول تعالى منذرا كفار قريش في تكذيبهم رسوله محمدا صلى الله عليه وسلم بأنه قد أهلك أمما من المكذبين للرسل من بعد نوح ودل هذا على أن القرون التي كانت بين آدم ونوح على الإسلام كما قاله ابن عباس كان بين آدم ونوح عشرة قرون كلهم على الإسلام. ومعناه أنكم أيها المكذبون لستم أكرم على الله منهم وقد كذبتم أشرف الرسل وأكرم الخلائق فعقوبتكم أولى وأحرى. وقوله \"وكفى بربك بذنوب عباده خبيرا بصيرا\" أي هو عالم بجميع أعمالهم خيرها وشرها لا يخفى عليه منها خافية سبحانه وتعالى."
    },
    {
      "ayah": 18,
      "surah": 17,
      "text": "يخبر تعالى أنه ما كل من طلب الدنيا وما فيها من النعيم يحصل له بل إنما يحصل لمن أراد الله وما يشاء وهذه مقيدة لإطلاق ما سواها من الآيات فإنه قال \"عجلنا له فيها ما نشاء لمن نريد ثم جعلنا له جهنم\" أي في الدار الآخرة \"يصلاها\" أي يدخلها حتى تغمره من جميع جوانبه \"مذموما\" أي في حال كونه مذموما على سوء تصرفه وصنيعه إذ أختار الفاني على الباقي \"مدحورا\" مبعدا مقصيا حقيرا ذليلا مهانا. روى الإمام أحمد حدثنا حسين حدثنا رويد عن أبي إسحاق عن زرعة عن عائشة رضي الله عنها قالت: قال رسول الله صلى الله عليه وسلم الدنيا دار من لا دار له ومال من لا مال له ولها يجمع من لا عقل له."
    },
    {
      "ayah": 19,
      "surah": 17,
      "text": "وقوله \"ومن أراد الآخرة\" أي أراد الدار الآخرة وما فيها من النعم والسرور \"وسعى لها سعيها\" أي طلب ذلك من طريقه وهو متابعة الرسول صلى الله عليه وسلم \"وهو مؤمن\" أي قلبه مؤمن أي مصدق موقن بالثواب والجزاء \"فأولئك كان سعيهم مشكورا\"."
    },
    {
      "ayah": 2,
      "surah": 17,
      "text": "لما ذكر تعالى أنه أسرى بعبده محمد صلى الله عليه وسلم عطف بذكر موسى عبده ورسوله وكليمه أيضا فإنه تعالى كثيرا ما يقرن بين ذكر موسى ومحمد عليهما من الله الصلاة والسلام وبين ذكر التوراة والقرآن ولهذا قال بعد ذكر الإسراء \"وآتينا موسى الكتاب\" يعني التوراة \"وجعلناه\" أي الكتاب \"هدى\" أي هاديا \"لبني إسرائيل أن لا تتخذوا\" أي لئلا تتخذوا \"من دوني وكيلا\" أي وليا ولا نصيرا ولا معبودا دوني لأن الله تعالى أنزل على كل نبي أرسله أن يعبده وحده لا شريك له."
    },
    {
      "ayah": 20,
      "surah": 17,
      "text": "يقول تعالى \"كلا\" أي كل واحد من الفريقين الذين أرادوا الدنيا والذين أرادوا الآخرة نمدهم فيما فيه \"من عطاء ربك\" أي هو المتصرف الحاكم الذي لا يجور فيعطي كلا ما يستحقه من السعادة والشقاوة فلا راد لحكمه ولا مانع لما أعطى ولا مغير لما أراد ولهذا قال \"وما كان عطاء ربك محظورا\" أي لا يمنعه أحد ولا يرده راد قال قتادة \"وما كان عطاء ربك محظورا\" أي منقوصا وقال الحسن وغيره أي ممنوعا."
    },
    {
      "ayah": 21,
      "surah": 17,
      "text": "ثم قال تعالى \"انظر كيف فضلنا بعضهم على بعض\" أي في الدنيا فمنهم الغني والفقير وبين ذلك والحسن والقبيح وبين ذلك ومن يموت صغيرا ومن يعمر حتى يبقى شيخا كبيرا وبين ذلك \"وللآخرة أكبر درجات وأكبر تفضيلا\" أي ولتفاوتهم في الدار الآخرة أكبر من الدنيا فإن منهم من يكون في الدركات في جهنم وسلاسلها وأغلالها ومنهم من يكون في الدرجات العلى ونعيمها وسرورها ثم أهل الدركات يتفاوتون فيما هم فيه كما أن أهل الدرجات يتفاوتون فإن الجنة مائة درجة ما بين كل درجتين كما بين السماء والأرض. وفي الصحيحين \"إن أهل الدرجات العلى ليرون أن عليين كما ترون الكوكب الغابر في أفق السماء\" ولهذا قال تعالى \"وللآخرة أكبر درجات وأكبر تفضيلا\" وفي الطبراني من رواية زاذان عن سلمان مرفوعا \"ما من عبد يريد أن يرتفع في الدنيا درجة فارتفع إلا وضعه الله في الآخرة أكبر منها\" ثم قرأ \"وللآخرة أكبر درجات وأكبر تفضيلا\"."
    },
    {
      "ayah": 22,
      "surah": 17,
      "text": "يقول تعالى والمراد المكلفون من الأمة لا تجعل أيها المكلف في عبادتك ربك له شريكا \"فتقعد مذموما\" أي على إشراكك \"مخذولا\" لأن الرب تعالى لا ينصرك بل يكلك إلى الذي عبدت معه وهو لا يملك لك ضرا ولا نفعا لأن مالك الضر والنفع هو الله وحده لا شريك له. وقد قال الإمام أحمد حدثنا أبو أحمد الزبيري حدثنا بشير ابن سليمان عن سيار أبي الحكم عن طارق بن شهاب عن عبدالله بن مسعود قال: قال رسول الله صلى الله عليه وسلم \"من أصابته فاقة فأنزلها بالناس لم تسد فاقته ومن أنزلها بالله أرسل الله له بالغني إما آجلا وإما عاجلا\" ورواه أبو داود والترمذي من حديث بشير بن سليمان به وقال الترمذي حسن صحيح غريب."
    },
    {
      "ayah": 23,
      "surah": 17,
      "text": "يقول تعالى آمرا بعبادته وحده لا شريك له فإن القضاء ههنا بمعنى الأمر قال مجاهد \"وقضى\" يعني وصى وكذا قرأ أبي بن كعب وابن مسعود والضحاك بن مزاحم \"ووصى ربك أن لا تعبدوا إلا إياه\" ولهذا قرن بعبادته بر الوالدين فقال \"وبالوالدين إحسانا\" أي وأمر بالوالدين إحسانا كقوله في الآية الأخرى \"أن اشكر لي ولوالديك إلي المصير\" وقوله \"إما يبلغن عندك الكبر أحدهما أو كلاهما فلا تقل لهما أف\" أي لا تسمعهما قولا سيئا حتى ولا التأفيف الذي هو أدنى مراتب القول السيء \"ولا تنهرهما\" أي ولا يصدر منك إليهما فعل قبيح كما قال عطاء بن أبي رباح في قوله \"ولا تنهرهما\" أي لا تنفض يدك عليهما ولما نهاه عن القول القبيح والفعل القبيح أمره بالقول الحسن والفعل الحسن فقال \"وقل لهما قولا كريما\" أي لينا طيبا حسنا بتأدب وتوقير وتعظيم."
    },
    {
      "ayah": 24,
      "surah": 17,
      "text": "\"واخفض لهما جناح الذل من الرحمة\" أي تواضع لهما بفعلك \"وقل رب ارحمهما كما ربياني صغيرا\" أي في كبرهما وعند وفاتهما قال ابن عباس ثم أنزل الله \"ما كان للنبي والذين آمنوا أن يستغفروا للمشركين\" الآية وقد جاء في بر الوالدين أحاديث كثيرة منها الحديث المروي من طرق عن أنس وغيره أن النبي صلى الله عليه وسلم لما صعد المنبر ثم قال \"آمين آمين آمين\" قيل يا رسول الله علام ما أمنت؟ قال \"أتاني جبريل فقال يا محمد رغم أنف رجل ذكرت عنده فلم يصل عليك قل آمين فقلت آمين ثم قال رغم أنف رجل دخل عليه شهر رمضان ثم خرج فلم يغفر له قل آمين فقلت آمين ثم قال رغم أنف رجل أدرك والديه أو أحدهما فلم يدخلاه الجنة قل آمين فقلت آمين\" \"حديث آخر\" قال الإمام أحمد: حدثنا هشيم حدثنا علي بن زيد عن زرارة بن أوفى عن مالك بن الحارث عن رجل منهم أنه سمع النبي صلى الله عليه وسلم يقول \"من ضم يتيما من أبوين مسلمين إلى طعامه وشرابه حتى يستغني عنه وجبت له الجنة البتة ومن أعتق امرأ مسلما كان فكاكه من النار يجزى بكل عضو منه عضوا منه\" ثم قال: حدثنا محمد بن جعفر حدثنا شعبة سمعت علي بن زيد فذكر معناه إلا أنه قال عن رجل عن قومه يقال له مالك أو ابن مالك وزاد \"ومن أدرك والديه أو أحدهما فدخل النار فأبعده الله\" \"حديث آخر\" وقال الإمام أحمد: حدثنا عفان عن حماد ابن سلمة حدثنا علي بن زيد عن زرارة بن أوفى عن مالك بن عمرو القشيري سمعت رسول الله صلى الله عليه وسلم يقول \"من أعتق رقبة مسلمة فهي فداؤه من النار فإن كل عظم من عظامه محررة بعظم من عظامه ومن أدرك أحد والديه ثم لم يغفر له فأبعده الله عز وجل ومن ضم يتيما من أبوين مسلمين إلى طعامه وشرابه حتى يغنيه الله وجبت له الجنة \"حديث آخر\" قال الإمام أحمد حدثنا حجاج ومحمد بن جعفر قالا حدثنا شعبة عن قتادة سمعت زرارة بن أوفى يحدث عن أبي مالك القشيري قال: قال النبي صلى الله عليه وسلم \"من أدرك والديه أو أحدهما ثم دخل النار من بعد ذلك فأبعده الله وأسحقه\" ورواه أبو داود الطيالسي عن شعبة به وفيه زيادات أخر \"حديث آخر\" قال الإمام أحمد: حدثنا عفان حدثنا أبو عوانة حدثنا سهيل بن أبي صالح عن أبيه عن أبي هريرة عن النبي صلى الله عليه وسلم قال \"رغم أنف ثم رغم أنف ثم رغم أنف رجل أدرك أحد أبويه أو كلاهما عنده الكبر ولم يدخل الجنة\" صحيح من هذا الوجه ولم يخرجوه سوى مسلم من حديث أبي عوانة وجرير وسليمان بن بلال عن سهيل به. \"حديث آخر\" قال الإمام أحمد: حدثنا ربعي بن إبراهيم قال أحمد وهو أخو إسماعيل بن علية وكان يفضل على أخيه عن عبدالرحمن ابن أبي إسحاق عن سعيد بن أبي سعيد عن أبي هريرة قال: قال رسول الله صلى الله عليه وسلم \"رغم أنف رجل ذكرت عنده فلم يصل علي ورغم أنف رجل دخل عليه شهر رمضان فانسلخ فلم يغفر له ورغم أنف رجل أدرك عنده أبواه الكبر فلم يدخلاه الجنة قال ربعي ولا أعلمه إلا قال \"أو أحدهما\" ورواه الترمذي عن أحمد بن إبراهيم الدورقي عن ربعي بن إبراهيم ثم قال غريب من هذا الوجه. \"حديث آخر\" قال الإمام أحمد: حدثنا يونس حدثنا محمد حدثنا عبدالرحمن بن الغسيل حدثنا أسيد بن علي عن أبيه عن أبي عبيد عن أبي أسيل وهو مالك بن ربيعة الساعدي قال: بينما أنا جالس عند رسول الله صلى الله عليه وسلم إذا جاءه رجل من الأنصار فقال يا رسول الله هل بقي علي من بر أبوي شيء بعد موتهما أبرهما به؟ قال نعم خصال أربع: الصلاة عليهما والاستغفار لهما وإنفاذ عهدهما وإكرام صديقهما وصلة الرحم التي لا رحم لك إلا من قبلهما فهو الذي بقي عليك من برهما بعد موتهما\" ورواه أبو داود وابن ماجه من حديث عبدالرحمن بن سليمان وهو ابن الغسيل به \"حديث آخر\" قال الإمام أحمد: حدثنا روح حدثنا ابن جريج أخبرني محمد بن طلحة بن عبيد الله بن عبدالرحمن عن معاوية بن جاهمة السلمي أن جاهمة جاء إلى النبي صلى الله عليه وسلم فقال يا رسول الله أردت الغزو وجئتك أستشيرك فقال \"فهل لك من أم؟\" قال نعم قال \"فالزمها فإن الجنة عند رجليها\" ثم الثانية ثم الثالثة في مقاعد شتى كمثل هذا القول ورواه النسائي وابن ماجه من حديث ابن جريج به. \"حديث آخر\" قال الإمام أحمد حدثنا خلف بن الوليد حدثنا ابن عياش عن يحيى بن سعد عن خالد بن معدان عن المقدام بن معديكرب عن النبي صلى الله عليه وسلم قال \"إن الله يوصيكم بآبائكم إن الله يوصيكم بأمهاتكم إن الله يوصيكم بأمهاتكم إن الله يوصيكم بأمهاتكم إن الله يوصيكم بالأقرب فالأقرب\" وأخرجه ابن ماجه من حديث عبدالله بن عياش به. \"حديث آخر\" قال أحمد حدثنا يونس حدثنا أبو عوانه عن أشعث بن سليم عن أبيه عن رجل من بني يربوع قال أتيت النبي صلى الله عليه وسلم فسمعته وهو يكلم الناس يقول \"يد المعطي العليا أمك وأباك وأختك وأخاك ثم أدناك أدناك\" \"حديث آخر\" قال الحافظ أبو بكر أحمد بن عمرو بن عبدالخالق البزار في مسنده: حدثنا إبراهيم بن المستمر العروقي حدثنا عمرو بن سفيان حدثنا الحسن بن أبي جعفر عن ليث بن أبي سليم عن علقمة بن مرثد عن سليمان بن بريدة عن أبيه أن رجلا كان في الطواف حاملا أمه يطوف بها فسأل النبي صلى الله عليه وسلم هل أديت حقها؟ قال \"لا ولا بزفرة واحدة\" أو كما قال ثم قال البزار لا نعلمه يروى إلا من هذا الوجه. قلت والحسن بن أبي جعفر ضعيف والله أعلم."
    },
    {
      "ayah": 25,
      "surah": 17,
      "text": "قال سعيد بن جبير هو الرجل تكون منه البادرة إلى أبويه وفي نيته وقلبه أنه لا يؤخذ به وفي رواية لا يريد إلا الخير بذلك فقال \"ربكم أعلم بما في نفوسكم إن تكونوا صالحين\" وقوله \"فإنه كان للأوابين غفورا\" قال قتادة للمطيعين أهل الصلاة وعن ابن عباس المسبحين وفي رواية عنه المطيعين المحسنين وقال بعضهم هم الذين يصلون بين العشاءين وقال بعضهم هم الذين يصلون الضحى وقال شعبة عن يحيى بن سعيد عن سعيد بن المسيب في قوله \"فإنه كان للأوابين غفورا\" قال الذين يصيبون الذنب ثم يتوبون ويصيبون الذنب ثم يتوبون وكذا رواه عبدالرزاق عن الثوري ومعمر عن يحيى بن سعيد عن ابن المسيب بنحوه وكذا رواه الليث وابن جرير عن ابن المسيب به وقال عطاء بن يسار وسعيد بن جبير ومجاهد هم الراجعون إلى الخير وقال مجاهد عن عبيد بن عمير في الآية هو الذي إذا ذكر ذنوبه في الخلاء فيستغفر الله منها ووافقه مجاهد في ذلك وقال عبد الرزاق حدثنا محمد بن مسلمة عن عمرو بن دينار عن عبيد بن عمير في قوله \"فإنه كان للأوابين غفورا\" قال كنا نعد الأواب الحفيظ أن يقول اللهم اغفر لي ما أصبت في مجلسي هذا. قال ابن جرير والأولى في ذلك قول من قال هو التائب من الذنب الرجاع من المعصية إلى الطاعة مما يكره الله إلى ما يحبه ويرضاه وهذا الذي قاله هو الصواب لأن الأواب مشتق من الأوب وهو الرجوع يقال آب فلان إذا رجع قال تعالى \"إن إلينا إيابهم\" وفي الحديث الصحيح أن رسول الله صلى الله عليه وسلم كان إذا رجع من سفر قال \"آيبون تائبون عابدون لربنا حامدون\"."
    },
    {
      "ayah": 26,
      "surah": 17,
      "text": "لما ذكر تعالى بر الوالدين عطف بذكر الإحسان إلى القرابة وصلة الأرحام وفي الحديث \"أمك وأباك ثم أدناك أدناك\" وفي رواية \"ثم الأقرب فالأقرب\" وفي الحديث \"من أحب أن يبسط له في رزقه وينسأ له في أجله فليصل رحمه\" وقال الحافظ أبو بكر البزار حدثنا عباد عن يعقوب حدثنا أبو يحيى التيمي حدثنا فضيل بن مرزوق عن عطية عن أبي سعيد قال لما نزلت \"وآت ذا القربى حقه\" دعا رسول الله صلى الله عليه وسلم فاطمة فأعطاها فدك ثم قال لا نعلم حدث به عن فضيل بن مرزوق إلا أبو يحيى التيمي وحميد بن حماد بن الخوار وهذا الحديث مشكل لو صح إسناده لأن الآية مكية وفدك إنما فتحت مع خيبر سنة سبع من الهجرة فكيف يلتئم هذا مع هذا؟ فهو إذا حديث منكر الأشبه أنه من وضع الرافضة والله أعلم. وقد تقدم الكلام على المساكين وأبناء السبيل في سورة براءة بما أغنى عن إعادته ههنا قوله \"ولا تبذر تبذيرا\" لما أمر بالإنفاق نهى عن الإسراف فيه بل يكون وسطا كما قال في الآية الأخرى \"والذين إذا أنفقوا لم يسرفوا ولم يقتروا\" الآية ثم قال منفرا عن التبذير والسرف."
    },
    {
      "ayah": 27,
      "surah": 17,
      "text": "\"إن المبذرين كانوا إخوان الشياطين\" أي أشباههم في ذلك. قال ابن مسعود التبذير الإنفاق في غير حق وكذا قال ابن عباس وقال مجاهد لو أنفق إنسان ماله كله في الحق لم يكن مبذرا ولو أنفق مدا في غير حق كان مبذرا. وقال قتادة: التبذير النفقة في معصية الله تعالى وفي غير الحق والفساد. وقال الإمام أحمد: حدثنا هاشم بن القاسم حدثنا الليث عن خالد بن يزيد عن سعيد بن أبى هلال عن أنس بن مالك رضي الله عنه أنه قال: أتى رجل من بني تميم إلى رسول الله صلى الله عليه وسلم فقال يا رسول الله إني ذو مال كثير وذو أهل وولد وحاضرة فأخبرني كيف أنفق وكيف أصنع؟ فقال رسول الله صلى الله عليه وسلم \"تخرج الزكاة من مالك إن كان فإنها طهرة تطهرك وتصل أقرباءك وتعرف حق السائل والجار والمسكين\" فقال يا رسول الله أقلل لي؟ قال \"فآت ذا القربى حقه والمسكين وابن السبيل ولا تبذر تبذيرا\" فقال حسبي يا رسول الله إذا أديت الزكاة إلى رسولك فقد برئت منها إلى الله وإلى رسوله فقال رسول الله صلى الله عليه وسلم \"نعم إذا أديتها إلى رسولي فقد برئت منها ولك أجرها وإثمها على من بدلها\" وقوله: \"إن المبذرين كانوا إخوان الشياطين\" أي في التبذير والسفه وترك طاعة الله وارتكاب معصيته ولهذا قال \"وكان الشيطان لربه كفورا\" أي جحودا لأنه أنكر نعمة الله عليه ولم يعمل بطاعته بل أقبل على معصيته ومخالفته."
    },
    {
      "ayah": 28,
      "surah": 17,
      "text": "وقوله: \"وإما تعرضن عنهم ابتغاء رحمة من ربك\" الآية أي إذا سألك أقاربك ومن أمرناك بإعطائهم وليس عندك شيء وأعرضت عنهم لفقد النفقة \"فقل لهم قولا ميسورا\" أي عدهم وعدا بسهولة ولين إذا جاء رزق الله فسنصلكم إن شاء الله هكذا فسر قوله \"فقل لهم قولا ميسورا\" بالوعد: مجاهد وعكرمة وسعيد بن جبير والحسن وقتادة وغير واحد."
    },
    {
      "ayah": 29,
      "surah": 17,
      "text": "يقول تعالى آمرا بالاقتصاد في العيش ذاما للبخل ناهيا عن السرف \"ولا تجعل يدك مغلولة إلى عنقك\" أي لا تكن بخيلا منوعا لا تعطي أحدا شيئا كما قالت اليهود عليهم لعائن الله يد الله مغلولة أي نسبوه إلى البخل تعالى وتقدس الكريم الوهاب وقوله: \"ولا تبسطها كل البسط\" أي ولا تسرف في الإنفاق فتعطي فوق طاقتك وتخرج أكثر من دخلك فتقعد ملوما محسورا وهذا من باب اللف والنشر أي فتقعد إن بخلت ملوما يلومك الناس ويذمونك ويستغنون عنك كما قال زهير بن أبي سلمى في المعلقة. ومن كان ذا مال فيبخل بماله على قومه يستغن عنه ويذمم ومتى بسطت يدك فوق طاقتك قعدت بلا شيء تنفقه فتكون كالحسير وهو الدابة التي قد عجزت عن السير فوقفت ضعفا وعجزا فإنها تسمى الحسير وهو مأخوذ من الكلال كما قال \"فارجع البصر هل ترى من فطور ثم ارجع البصر كرتين ينقلب إليك البصر خاسئا وهو حسير\" أي كليل عن أن يرى عيبا هكذا فسر هذه الآية بأن المراد هنا البخل والسرف: ابن عباس والحسن وقتادة وابن جريج وابن زيد وغيرهم وقد جاء في الصحيحين من حديث أبي الزناد عن الأعرج عن أبي هريرة أنه سمع رسول الله صلى الله عليه وسلم يقول: \"مثل البخيل والمنفق كمثل رجلين عليهما جبتان من حديد من ثدييهما إلى تراقيهما فأما المنفق فلا ينفق إلا سبغت أو وفرت على جلده حتى تخفي بنانه وتعفو أثره وأما البخيل فلا يريد أن ينفق شيئا إلا لزقت كل حلقة مكانها فهو يوسعها فلا تتسع\" هذا لفظ البخاري في الزكاة وفي الصحيحين من طريق هشام بن عروة عن زوجته فاطمة بنت المنذر عن جدتها أسماء بنت أبي بكر قالت: قال رسول الله صلى الله عليه وسلم \"أنفقي هكذا وهكذا وهكذا ولا توعي فيوعي الله عليك ولا توكي فيوكي الله عليك\" وفي لفظ \"ولا تحصي فيحصي الله عليك\" وفي صحيح مسلم من طريق عبدالرزاق عن معمر عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم \"إن الله قال أنفق أنفق عليك\" وفي الصحيحين من طريق معاوية بن أبي مزرد عن سعيد بن يسار عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم \"ما من يوم يصبح العباد فيه إلا وملكان ينزلان من السماء يقول أحدهما: اللهم أعط منفقا خلفا ويقول الآخر اللهم أعط ممسكا تلفا\" وروى مسلم عن قتيبة عن إسماعيل بن جعفر عن العلاء عن أبيه عن أبي هريرة مرفوعا \"ما نقص مال من صدقة وما زاد الله عبدا أنفق إلا عزا ومن تواضع لله رفعه الله\" وفي حديث أبي كثير عن عبدالله بن عمر مرفوعا \"إياكم والشح فإنه أهلك من كان قبلكم أمرهم بالبخل فبخلوا وأمرهم بالقطيعة فقطعوا وأمرهم بالفجور ففجروا\" وروى البيهقي من طريق سعدان بن نصر عن أبي معاوية عن الأعمش عن أبيه قال: قال رسول الله صلى الله عليه وسلم \"ما يخرج رجل صدقة حتى يفك لحي سبعين شيطانا\". وقال الإمام أحمد: حدثنا أبو عبيدة الحداد حدثنا سكين بن عبدالعزيز حدثنا إبراهيم الهجري عن أبي الأحوص عن عبدالله بن مسعود قال: قال رسول الله صلى الله عليه وسلم \"ما عال من اقتصد\"."
    },
    {
      "ayah": 3,
      "surah": 17,
      "text": "ثم قال \"ذرية من حملنا مع نوح\" تقديره يا ذرية من حملنا مع نوح فيه تهييج وتنبيه على المنة أي يا سلالة من نجينا فحلمنا مع نوح في السفينة تشبهوا بأبيكم \"إنه كان عبدا شكورا\" فاذكروا أنتم نعمتي عليكم بإرسالي إليكم محمدا صلى الله عليه وسلم وقد ورد في الحديث وفي الأثر عن السلف أن نوحا عليه السلام كان يحمد الله على طعامه وشرابه ولباسه وشأنه كله. فلهذا سمي عبدا شكورا. قال الطبراني حدثني على بن عبدالعزيز حدثنا أبو نعيم حدثنا سفيان عن أبي حصين عن عبدالله بن سنان عن سعد بن مسعود الثقفي قال: إنما سمي نوح عبدا شكورا لأنه كان إذا أكل أو شرب حمد الله. وقال الإمام أحمد حدثنا أبو أسامة حدثنا زكريا بن أبي زائدة عن سعيد بن أبي بردة عن أنس بن مالك رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم \"إن الله ليرضى عن العبد أن يأكل الأكلة أو يشرب الشربة فيحمد الله عليها\" وهكذا رواه مسلم والترمذي والنسائي من طريق أبي أسامة به وقال مالك عن زيد بن أسلم كان يحمد الله على كل حال وقد ذكر البخاري هنا حديث أبي زرعة عن أبي هريرة عن النبي صلى الله عليه وسلم قال \"أنا سيد ولد آدم يوم القيامة - بطوله وفيه - فيأتون نوحا فيقولون: يا نوح إنك أنت أول الرسل إلى أهل الأرض وقد سماك الله عبدا شكورا فاشفع لنا إلى ربك\" وذكر الحديث بكامله."
    },
    {
      "ayah": 30,
      "surah": 17,
      "text": "وقوله: \"إن ربك يبسط الرزق لمن يشاء ويقدر\" إخبار أنه تعالى هو الرزاق القابض الباسط المتصرف في خلقه بما يشاء فيغني من يشاء ويفقر من يشاء لما له في ذلك من الحكمة ولهذا قال \"إنه كان بعباده خبيرا بصيرا\" أي خبيرا بصيرا بمن يستحق الغنى ومن يستحق الفقر كما جاء في الحديث \"إن من عبادي لمن لا يصلحه إلا الفقر ولو أغنيته لأفسدت عليه دينه وإن من عبادي لمن لا يصلحه إلا الغنى ولو أفقرته لأفسدت عليه دينه\" وقد يكون الغنى في حق بعض الناس استدراجا والفقر عقوبة عياذا بالله من هذا وهذا."
    },
    {
      "ayah": 31,
      "surah": 17,
      "text": "هذه الآية الكريمة دالة على أن الله تعالى أرحم بعباده من الوالد بولده لأنه نهى عن قتل الأولاد كما أوصى الآباء بالأولاد في الميراث وكان أهل الجاهلية لا يورثون البنات بل كان أحدهم ربما قتل ابنته لئلا تكثر عيلته فنهى الله تعالى عن ذلك وقال \"ولا تقتلوا أولادكم خشية إملاق\" أي خوف أن تفتقروا في ثاني الحال ولهذا قدم الاهتمام برزقهم فقال \"نحن نرزقهم وإياكم\" وفي الأنعام \"ولا تقتلوا أولادكم من إملاق\" أي من فقر \"نحن نرزقكم وإياهم\" وقوله \"إن قتلهم كان خطئا كبيرا\" أي ذنبا عظيما وقرأ بعضهم\" كان خطأ كبيرا\" وهو بمعناه. وفي الصحيحين عن عبدالله بن مسعود قلت يا رسول الله أي الذنب أعظم؟ قال \"أن تجعل لله ندا وهو خلقك - قلت ثم أي؟ قال أن تقتل ولدك خشية أن يطعم معك - قلت ثم أي؟ قال أن تزاني بحليلة جارك\"."
    },
    {
      "ayah": 32,
      "surah": 17,
      "text": "يقول تعالى ناهيا عباده عن الزنا وعن مقاربته ومخالطة أسبابه ودواعيه \"ولا تقربوا الزنا إنه كان فاحشة\" أي ذنبا عظيما \"وساء سبيلا\" أي وبئس طريقا ومسلكا. وقد قال الإمام أحمد حدثنا يزيد بن هارون حدثنا جرير حدثنا سليم بن عامر عن أبي أمامة أن فتى شابا أتى النبي صلى الله عليه وسلم فقال: يا رسول الله ائذن لي بالزنا فأقبل القوم عليه فزجروه وقالوا: مه مه فقال \"ادنه\" فدنا منه قريبا فقال \"اجلس\" فجلس فقال \"أتحبه لأمك\"؟ قال لا والله جعلني الله فداك قال ولا الناس يحبونه لأمهاتهم قال \"أفتحبه لابنتك\"؟ قال لا والله يا رسول الله جعلني الله فداك قال ولا الناس يحبونه لبناتهم قال \"أفتحبه لأختك\"؟ قال لا والله جعلني الله فداك قال ولا الناس يحبونه لأخواتهم قال \"أفتحبه لعمتك\"؟ قال لا والله جعلني الله فداك قال ولا الناس يحبونه لعماتهم قال \"أفتحبه لخالتك\"؟ قال لا والله جعلني الله فداك قال ولا الناس يحبونه لخالاتهم قال فوضع يده عليه وقال \"اللهم اغفر ذنبه وطهر قلبه وأحصن فرجه\" قال فلم يكن بعد ذلك الفتى يلتفت إلى شيء وقال ابن أبي الدنيا حدثنا عمار بن نضر حدثنا بقية عن أبي بكر بن أبي مريم عن الهيثم بن مالك الطائي عن النبي صلى الله عليه وسلم قال: \"ما من ذنب بعد الشرك أعظم عند الله من نطفة وضعها رجل في رحم لا يحل له\"."
    },
    {
      "ayah": 33,
      "surah": 17,
      "text": "يقول تعالى ناهيا عن قتل النفس بغير حق شرعي كما ثبت في الصحيحين أن رسول الله صلى الله عليه وسلم قال \"لا يحل دم امرئ مسلم يشهد أن لا إله إلا الله وأن محمدا رسول الله إلا بإحدى ثلاث: النفس بالنفس والزاني المحصن والتارك لدينه المفارق للجماعة\" وفي السنن \"لزوال الدنيا عند الله أهون من قتل مسلم\" وقوله: \"ومن قتل مظلوما فقد جعلنا لوليه سلطانا\" أي سلطة على القاتل فإنه بالخيار فيه إن شاء قتله قودا وإن شاء عفا عنه على الدية وإن شاء عفا عنه مجانا كما ثبتت السنة بذلك. وقد أخذ الإمام الحبر ابن عباس من عموم هذه الآية الكريمة ولاية معاوية السلطنة أنه سيملك لأنه كان ولي عثمان وقد قتل عثمان مظلوما رضي الله عنه وكان معاوية يطالب عليا رضي الله عنه أن يسلمه قتلته حتى يقتص منهم لأنه أموي وكان علي رضي الله عنه يستمهله في الأمر حتى يتمكن ويفعل ذلك ويطلب علي من معاوية أن يسلمه الشام فيأبى معاوية ذلك حتى يسلمه القتلة وأبى أن يبايع عليا هو وأهل الشام ثم مع المطاولة تمكن معاوية وصار الأمر إليه كما قاله ابن عباس واستنبطه من هذه الآية الكريمة وهذا من الأمر العجب وقد روى ذلك الطبراني في معجمه حيث قال حدثنا يحيى بن عبدالباقي حدثنا أبو عمير بن النحاس حدثنا ضمرة بن ربيعة عن ابن شودب عن مطر الوراق عن زهدم الجرمي قال: كنا في سمر ابن عباس فقال إني محدثكم بحديث ليس بسر ولا علانية إنه لما كان من أمر هذا الرجل ما كان يعني عثمان قلت لعلي اعتزل فلو كنت في حجر طلبت حتى تستخرج فعصاني وايم الله ليتأمرن عليكم معاوية وذلك أن الله يقول \"ومن قتل مظلوما فقد جعلنا لوليه سلطانا فلا يسرف في القتل\" الآية وليحملنكم قريش على سنة فارس والروم وليقيمن عليكم النصارى واليهود والمجوس فمن أخذ منكم يومئذ بما يعرف نجا ومن ترك وأنتم تاركون كنتم كقرن من القرون هلك فيمن هلك وقوله \"فلا يسرف في القتل\" قالوا معناه فلا يسرف الولي في قتل القاتل بأن يمثل به أو يقتص من غير القاتل وقوله: \"إنه كان منصورا\" أي أن الولي منصور على القاتل شرعا وغالبا وقدرا."
    },
    {
      "ayah": 34,
      "surah": 17,
      "text": "يقول تعالى \"ولا تقربوا مال اليتيم إلا بالتي هي أحسن حتى يبلغ أشده\" أي لا تتصرفوا في مال اليتيم إلا بالغبطة \"ولا تأكلوها إسرافا وبدارا أن يكبروا ومن كان غنيا فليستعفف ومن كان فقيرا فليأكل بالمعروف\" وقد جاء في صحيح مسلم أن رسول الله صلى الله عليه وسلم قال لأبي ذر \"يا أبا ذر إني أراك ضعيفا وإني أحب لك ما أحب لنفسي لا تأمرن على اثنين ولا تولين مال يتيم\" وقوله \"وأوفوا بالعهد\" أي الذي تعاهدون عليه الناس والعقود التي تعاملونهم بها فإن العهد والعقد كل منهما يسأل صاحبه عنه \"إن العهد كان مسئولا\" أي عنه."
    },
    {
      "ayah": 35,
      "surah": 17,
      "text": "وقوله \"وأوفوا الكيل إذا كلتم\" أي من غير تطفيف لا تبخسوا الناس أشياءهم \"وزنوا بالقسطاس\" قرئ بضم القاف وكسرها كالقرطاس وهو الميزان قال مجاهد هو العدل بالرومية وقوله \"المستقيم\" أي الذي لا اعوجاج فيه ولا انحراف ولا اضطراب \"ذلك خير\" أي لكم في معاشكم ومعادكم ولهذا قال \"وأحسن تأويلا\" أي مآلا ومنقلبا في آخرتكم. قال سعيد عن قتادة \"ذلك خير وأحسن تأويلا\" أي خير ثوابا وأحسن عاقبة. وابن عباس كان يقول يا معشر الموالي إنكم وليتم أمرين بهما هلك الناس قبلكم هذا المكيال وهذا الميزان قال وذكر لنا أن نبي الله عليه الصلاة والسلام كان يقول \"لا يقدر رجل على حرام ثم يدعه ليس به إلا مخافة الله إلا أبدله الله به في عاجل الدنيا قبل الآخرة ما هو خير له من ذلك\"."
    },
    {
      "ayah": 36,
      "surah": 17,
      "text": "قال علي بن أبي طلحة عن ابن عباس يقول لا تقل وقال العوفي عنه لا ترم أحدا بما ليس لك به علم وقال محمد بن الحنفية يعني شهادة الزور وقال قتادة لا تقل رأيت ولم تر وسمعت ولم تسمع وعلمت ولم تعلم فإن الله تعالى سائلك عن ذلك كله ومضمون ما ذكروه أن الله تعالى نهى عن القول بلا علم بل بالظن الذي هو التوهم والخيال كما قال تعالى: \"اجتنبوا كثيرا من الظن إن بعض الظن إثم\" وفي الحديث \"إياكم والظن فإن الظن أكذب الحديث\" وفي سنن أبي داود \"بئس مطية الرجل زعموا\" وفي الحديث الآخر \"إن أفرى الفرى أن يرى الرجل عينيه ما لم تريا\" وفي الصحيح \"من تحلم حلما كلف يوم القيامة أن يعقد بين شعيرتين وليس بفاعل\" وقوله \"كل أولئك\" أي هذه الصفات من السمع والبصر والفؤاد \"كان عنه مسئولا\" أي سيسأل العبد عنها يوم القيامة وتسأل عنه وعما عمل فيها ويصح استعمال أولئك مكان تلك كما قال الشاعر: ذم المنازل بعد منزلة اللوى والعيش بعد أولئك الأيام.."
    },
    {
      "ayah": 37,
      "surah": 17,
      "text": "يقول تعالى ناهيا عباده عن التجبر والتبختر في المشية \"ولا تمش في الأرض مرحا\" أي متبخترا متمايلا مشي الجبارين \"إنك لن تخرق الأرض\" أي لن تقطع الأرض بمشيك قاله ابن جرير واستشهد عليه بقول رؤبة بن العجاج: وقاتم الأعماق خاوي المخترقن وقوله: \"ولن تبلغ الجبال طولا\" أي بتمايلك وفخرك وإعجابك بنفسك بل قد يجازى فاعل ذلك بنقيض قصده كما ثبت في الصحيح \"بينما رجل يمشي فيمن كان قبلكم وعليه بردان يتبختر فيهما إذ خسف به الأرض فهو يتجلجل فيها إلى يوم القيامة\" وكذلك أخبر الله تعالى عن قارون أنه خرج على قومه في زينته وأن الله تعالى خسف به وبداره الأرض. وفي الحديث \"من تواضع لله رفعه الله فهو في نفسه حقير وعند الناس كبير ومن استكبر وضعه الله في نفسه كبير وعند الناس حقير حتى لهو أبغض إليهم من الكلب والخنزير\" وقال أبو بكر بن أبي الدنيا في كتاب الخمول والتواضع: حدثنا أحمد بن إبراهيم بن كثير حدثنا حجاج بن محمد بن أبي بكر الهذلي قال: بينما نحن مع الحسن إذ مر عليه ابن الأهيم يريد المنصور وعليه جباب خز قد نضد بعضها فوق بعض على ساقه وانفرج عنها قباؤه وهو يمشي ويتبختر إذ نظر إليه الحسن نظرة فقال: أف أف شامخ بأنفه ثاني عطفه مصعر خده ينظر في عطفيه أي حميق ينظر في عطفه في نعم غير مشكورة ولا مذكورة غير المأخوذ بأمر الله فيها ولا المؤدى حق الله منها والله أن يمشي أحدهم طبيعته يتلجلج تلجلج المجنون في كل عضو منه نعمة وللشيطان به لعنة فسمعه ابن الأهتم فرجع يعتذر إليه فقال لا تعتذر إلي وتب إلى ربك أما سمعت قول الله تعالى: \"ولا تمش في الأرض مرحا إنك لن تخرق الأرض ولن تبلغ الجبال طولا\" ورأى البختري العابد رجلا من آل علي يمشي وهو يخطر في مشيته فقال له يا هذا: إن الذي أكرمك به لم تكن هذه مشيته قال فتركها الرجل بعد. ورأى ابن عمر رجلا يخطر في مشيته فقال إن للشياطين إخوانا وقال خالد بن معدان: إياكم والخطر فإن الرجل يده من سائر جسده رواهما ابن أبي الدنيا وقال ابن أبي الدنيا حدثنا خلف بن هشام البزار حدثنا حماد بن يزيد عن يحيى عن سعيد عن محسن قال: قال رسول الله صلى الله عليه وسلم \"إذا مشت أمتي المطيطاء وخدمتهم فارس والروم سلط بعضهم على بعض\". يقول تعالى ناهيا عباده عن التجبر والتبختر في المشية \"ولا تمش في الأرض مرحا\" أي متبخترا متمايلا مشي الجبارين \"إنك لن تخرق الأرض\" أي لن تقطع الأرض بمشيك قاله ابن جرير واستشهد عليه بقول رؤبة بن العجاج: وقاتم الأعماق خاوي المخترقن وقوله: \"ولن تبلغ الجبال طولا\" أي بتمايلك وفخرك وإعجابك بنفسك بل قد يجازى فاعل ذلك بنقيض قصده كما ثبت في الصحيح \"بينما رجل يمشي فيمن كان قبلكم وعليه بردان يتبختر فيهما إذ خسف به الأرض فهو يتجلجل فيها إلى يوم القيامة\" وكذلك أخبر الله تعالى عن قارون أنه خرج على قومه في زينته وأن الله تعالى خسف به وبداره الأرض. وفي الحديث \"من تواضع لله رفعه الله فهو في نفسه حقير وعند الناس كبير ومن استكبر وضعه الله في نفسه كبير وعند الناس حقير حتى لهو أبغض إليهم من الكلب والخنزير\" وقال أبو بكر بن أبي الدنيا في كتاب الخمول والتواضع: حدثنا أحمد بن إبراهيم بن كثير حدثنا حجاج بن محمد بن أبي بكر الهذلي قال: بينما نحن مع الحسن إذ مر عليه ابن الأهيم يريد المنصور وعليه جباب خز قد نضد بعضها فوق بعض على ساقه وانفرج عنها قباؤه وهو يمشي ويتبختر إذ نظر إليه الحسن نظرة فقال: أف أف شامخ بأنفه ثاني عطفه مصعر خده ينظر في عطفيه أي حميق ينظر في عطفه في نعم غير مشكورة ولا مذكورة غير المأخوذ بأمر الله فيها ولا المؤدى حق الله منها والله أن يمشي أحدهم طبيعته يتلجلج تلجلج المجنون في كل عضو منه نعمة وللشيطان به لعنة فسمعه ابن الأهتم فرجع يعتذر إليه فقال لا تعتذر إلي وتب إلى ربك أما سمعت قول الله تعالى: \"ولا تمش في الأرض مرحا إنك لن تخرق الأرض ولن تبلغ الجبال طولا\" ورأى البختري العابد رجلا من آل علي يمشي وهو يخطر في مشيته فقال له يا هذا: إن الذي أكرمك به لم تكن هذه مشيته قال فتركها الرجل بعد. ورأى ابن عمر رجلا يخطر في مشيته فقال إن للشياطين إخوانا وقال خالد بن معدان: إياكم والخطر فإن الرجل يده من سائر جسده رواهما ابن أبي الدنيا وقال ابن أبي الدنيا حدثنا خلف بن هشام البزار حدثنا حماد بن يزيد عن يحيى عن سعيد عن محسن قال: قال رسول الله صلى الله عليه وسلم \"إذا مشت أمتي المطيطاء وخدمتهم فارس والروم سلط بعضهم على بعض\". يقول تعالى ناهيا عباده عن التجبر والتبختر في المشية \"ولا تمش في الأرض مرحا\" أي متبخترا متمايلا مشي الجبارين \"إنك لن تخرق الأرض\" أي لن تقطع الأرض بمشيك قاله ابن جرير واستشهد عليه بقول رؤبة بن العجاج: وقاتم الأعماق خاوي المخترقن وقوله: \"ولن تبلغ الجبال طولا\" أي بتمايلك وفخرك وإعجابك بنفسك بل قد يجازى فاعل ذلك بنقيض قصده كما ثبت في الصحيح \"بينما رجل يمشي فيمن كان قبلكم وعليه بردان يتبختر فيهما إذ خسف به الأرض فهو يتجلجل فيها إلى يوم القيامة\" وكذلك أخبر الله تعالى عن قارون أنه خرج على قومه في زينته وأن الله تعالى خسف به وبداره الأرض. وفي الحديث \"من تواضع لله رفعه الله فهو في نفسه حقير وعند الناس كبير ومن استكبر وضعه الله في نفسه كبير وعند الناس حقير حتى لهو أبغض إليهم من الكلب والخنزير\" وقال أبو بكر بن أبي الدنيا في كتاب الخمول والتواضع: حدثنا أحمد بن إبراهيم بن كثير حدثنا حجاج بن محمد بن أبي بكر الهذلي قال: بينما نحن مع الحسن إذ مر عليه ابن الأهيم يريد المنصور وعليه جباب خز قد نضد بعضها فوق بعض على ساقه وانفرج عنها قباؤه وهو يمشي ويتبختر إذ نظر إليه الحسن نظرة فقال: أف أف شامخ بأنفه ثاني عطفه مصعر خده ينظر في عطفيه أي حميق ينظر في عطفه في نعم غير مشكورة ولا مذكورة غير المأخوذ بأمر الله فيها ولا المؤدى حق الله منها والله أن يمشي أحدهم طبيعته يتلجلج تلجلج المجنون في كل عضو منه نعمة وللشيطان به لعنة فسمعه ابن الأهتم فرجع يعتذر إليه فقال لا تعتذر إلي وتب إلى ربك أما سمعت قول الله تعالى: \"ولا تمش في الأرض مرحا إنك لن تخرق الأرض ولن تبلغ الجبال طولا\" ورأى البختري العابد رجلا من آل علي يمشي وهو يخطر في مشيته فقال له يا هذا: إن الذي أكرمك به لم تكن هذه مشيته قال فتركها الرجل بعد. ورأى ابن عمر رجلا يخطر في مشيته فقال إن للشياطين إخوانا وقال خالد بن معدان: إياكم والخطر فإن الرجل يده من سائر جسده رواهما ابن أبي الدنيا وقال ابن أبي الدنيا حدثنا خلف بن هشام البزار حدثنا حماد بن يزيد عن يحيى عن سعيد عن محسن قال: قال رسول الله صلى الله عليه وسلم \"إذا مشت أمتي المطيطاء وخدمتهم فارس والروم سلط بعضهم على بعض\"."
    },
    {
      "ayah": 38,
      "surah": 17,
      "text": "وقوله \"كل ذلك كان سيئه عند ربك مكروها\" أما من قرأ\" سيئة\" أي فاحشة فمعناه عنده كل هذا الذي نهينا عنه من قوله: \"ولا تقتلوا أولادكم خشية إملاق\" إلى هنا فهو سيئة مؤاخذ عليها مكروها عند الله لا يحبه ولا يرضاه وأما من قرأ\" سيئه\" على الإضافة فمعناه عنده كل هذا الذي ذكرناه من قوله: \"وقضى ربك أن لا تعبدوا إلا إياه\" إلى هنا فسيئه أي فقبيحه مكروه وعند الله هكذا وجه ذلك ابن جرير رحمه الله."
    },
    {
      "ayah": 39,
      "surah": 17,
      "text": "يقول تعالى هذا الذي أمرناك به من الأخلاق الجميلة ونهيناك عنه من الصفات الرذيلة مما أوحينا إليك يا محمد لتأمر به الناس \"ولا تجعل مع الله إلها آخر فتلقى في جهنم ملوما\" أي تلومك نفسك ويلومك الله والخلق \"مدحورا\" أي مبعدا من كل خير قال ابن عباس وقتادة مطرودا والمراد من هذا الخطاب الأمة بواسطة الرسول صلى الله عليه وسلم فإنه صلوات الله وسلامه عليه معصوم."
    },
    {
      "ayah": 4,
      "surah": 17,
      "text": "يخبر تعالى أنه قضى إلى بني إسرائيل في الكتاب أي تقدم إليهم وأخبرهم في الكتاب الذي أنزله عليهم أنهم سيفسدون في الأرض مرتين ويعلون علوا كبيرا أي يتجبرون ويطغون ويفجرون على الناس كقوله تعالى \"وقضينا إليه ذلك الأمر أن دابر هؤلاء مقطوع مصبحين\" أي تقدمنا إليه وأخبرناه بذلك وأعلمناه به."
    },
    {
      "ayah": 40,
      "surah": 17,
      "text": "يقول تعالى رادا على المشركين الكاذبين الزاعمين عليهم لعائن الله أن الملائكة بنات الله فجعلوا الملائكة الذين هم عباد الرحمن إناثا ثم ادعوا أنهم بنات الله ثم عبدوهم فأخطأوا في كل من المقامات الثلاث خطأ عظيما فقال تعالى منكرا عليهم \"أفأصفاكم ربكم بالبنين\" أي خصصكم بالذكور \"واتخذ من الملائكة إناثا\" أي واختار لنفسه على زعمكم البنات ثم شدد الإنكار عليهم فقال \"إنكم لتقولون قولا عظيما\" أي في زعمكم أن لله ولدا ثم جعلكم ولده الإناث التي تأنفون أن يكن لكم وربما قتلتموهن بالوأد فتلك إذا قسمة ضيزى وقال تعالى: \"وقالوا اتخذ الرحمن ولدا لقد جئتم شيئا إدا تكاد السموات يتفطرن منه وتنشق الأرض وتخر الجبال هدا أن دعوا للرحمن ولدا وما ينبغي للرحمن أن يتخذ ولدا\" إن كل من في السموات والأرض إلا آتي الرحمن عبدا لقد أحصاهم وعدهم عدا وكلهم آتيه يوم القيامة فردا\"."
    },
    {
      "ayah": 41,
      "surah": 17,
      "text": "يقول تعالى: \"ولقد صرفنا للناس في هذا القرآن من كل مثل\" أي صرفنا فيه من الوعيد لعلهم يذكرون ما فيه من الحجج والبينات والمواعظ فينزجروا عما هم فيه من الشرك والظلم والإفك \"وما يزيدهم\" أي الظالمين منهم إلا \"نفورا\" أي عن الحق وبعدا منه."
    },
    {
      "ayah": 42,
      "surah": 17,
      "text": "يقول تعالى قل يا محمد لهؤلاء المشركين الزاعمين أن لله شريكا من خلقه العابدين معه غيره ليقربهم إليه زلفى لو كان الأمر كما تقولون وأن معه آلهة تعبد لتقرب إليه وتشفع لديه لكان أولئك المعبودون يعبدونه ويتقربون إليه ويبتغون إليه الوسيلة والقربة فاعبدوه أنتم وحده كما يعبده من تدعونه من دونه ولا حاجة لكم إلى معبود يكون واسطة بينكم وبينه فإنه لا يحب ذلك ولا يرضاه بل يكرهه ويأباه وقد نهى عن ذلك على ألسنة جميع رسله وأنبيائه ثم نزه نفسه الكريمة وقدسها."
    },
    {
      "ayah": 43,
      "surah": 17,
      "text": "فقال \"سبحانه وتعالى عما يقولون\" أي هؤلاء المشركون المعتدون الظالمون في زعمهم أن معه آلهة أخرى \"علوا كبيرا\" أي تعاليا كبيرا بل هو الله الأحد الصمد الذي لم يلد ولم يولد ولم يكن له كفوا أحد."
    },
    {
      "ayah": 44,
      "surah": 17,
      "text": "يقول تعالى تقدسه السموات السبع والأرض ومن فيهن أي من المخلوقات وتنزهه وتعظمه وتبجله وتكبره عما يقول هؤلاء المشركون وتشهد له بالوحدانية في ربوبيته وإلهيته. ففي كل شيء له آية تدل على أنه واحد. كما قال تعالى: \"تكاد السموات يتفطرن منه وتنشق الأرض وتخر الجبال هدا أن دعوا للرحمن ولدا\" وقال أبو القاسم الطبراني حدثنا علي بن عبدالعزيز حدثنا سعيد بن منصور حدثنا سليمان بن ميمون مؤذن مسجد الرملة حدثنا عروة بن رويم عن عبدالرحمن بن قرط أن رسول الله صلى الله عليه وسلم ليلة أسري به إلى المسجد الأقصى كان بين المقام وزمزم وجبريل عن يمينه وميكائيل عن يساره فطارا به حتى بلغ السموات السبع فلما رجع قال \"سمعت تسبيحا في السموات العلى مع تسبيح كثير سبحت السموات العلى من ذي المهابة مشفقات لذي العلو بما علا سبحان العلي الأعلى سبحانه وتعالى\" وقوله: \"وإن من شيء إلا يسبح بحمده\" أي وما من شيء من المخلوقات إلا يسبح بحمد الله \"ولكن لا تفقهون تسبيحهم\" أي لا تفقهون تسبيحهم أيها الناس لأنها بخلاف لغاتكم وهذا عام في الحيوانات والجمادات والنباتات وهذا أشهر القولين كما ثبت في صحيح البخاري عن ابن مسعود أنه قال كنا نسمع تسبيح الطعام وهو يؤكل. وفي حديث أبي ذر أن النبي صلى الله عليه وسلم أخذ في يده حصيات فسمع لهن تسبيح كحنين النحل وكذا في يد أبي بكر وعمر وعثمان رضي الله عنهم وهو حديث مشهور في المسانيد وقال الإمام أحمد: حدثنا حسن حدثنا ابن لهيعة حدثنا زبان عن سهل بن معاذ عن ابن أنس عن أبيه رضي الله عنه عن رسول الله صلى الله عليه وسلم أنه دخل على قوم وهم وقوف على دواب لهم ورواحل فقال لهم \"اركبوها سالمة ودعوها سالمة ولا تتخذوها كراسي لأحاديثكم في الطرق والأسواق فرب مركوبة خير من راكبها وأكثر ذكرا لله منه\" وفي سنن النسائي عن عبدالله بن عمرو قال: نهى رسول الله صلى الله عليه وسلم عن قتل الضفدع وقال \"نقيقها تسبيح\" وقال قتادة عن عبدالله بن أبي عن عبدالله بن عمرو أن الرجل إذا قال لا إله إلا الله فهي كلمة الإخلاص التي لا يقبل الله من أحد عملا حتى يقولها وإذا قال الحمد لله فهي كلمة الشكر التي لم يشكر الله عبد قط حتى يقولها وإذا قال الله أكبر فهي تملأ ما بين السماء والأرض وإذا قال سبحان الله فهي صلاة الخلائق التي لم يدع الله أحدا من خلقه إلا قرره بالصلاة والتسبيح. وإذا قال لا حول ولا قوة إلا بالله قال أسلم عبدي واستسلم. وقال الإمام أحمد: حدثنا ابن وهب حدثنا جرير حدثنا أبي سمعت مصعب بن زهير يحدث عن زيد بن أسلم عن عطاء بن يسار عن عبدالله بن عمرو قال أتى النبي صلى الله عليه وسلم أعرابي عليه جبة من طيالسة مكفوفة بديباج: أو مزورة بديباج فقال: إن صاحبكم هذا يريد أن يرفع كل راع بن راع ويضع كل رأس بن رأس فقام إليه النبي صلى الله عليه وسلم مغضبا فأخذ بمجامع جبته فاجتذبه فقال \"لا أرى عليك ثياب من لا يعقل\" رجع رسول الله صلى الله عليه وسلم فجلس فقال \"إن نوحا عليه السلام لما حصرته الوفاة دعا ابنيه فقال إني قاص عليكما الوصية آمركما باثنتين وأنهاكما عن اثنتين أنهاكما عن الشرك بالله والكبر وآمركما بلا إله إلا الله فإن السموات والأرض وما فيهما لو وضعت في كفة الميزان ووضعت لا إله إلا الله في الكفة الأخرى كانت أرجح ولو أن السموات والأرض كانتا حلقة فوضعت لا إله إلا الله عليهما لقصمتهما أو لفصمتهما وآمركما بسبحان الله وبحمده فإنها صلاة كل شيء وبها يرزق كل شيء\" ورواه الإمام أحمد أيضا عن سليمان بن حرب عن حماد بن زيد عن مصعب بن زهير به أطول من هذا وتفرد به وقال ابن جرير حدثني نصر بن عبدالرحمن الأودي حدثنا محمد بن يعلى عن موسى بن عبيدة عن زيد بن أسلم عن جابر بن عبدالله رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم \"ألا أخبركم بشيء أمر به نوح ابنه؟ إن نوحا عليه السلام قال لابنه يا بني آمرك أن تقول سبحان الله فإنها صلاة الخلق وتسبيح الخلق وبها يرزق الخلق\" قال الله تعالى \"وإن من شيء إلا يسبح بحمده\" إسناده فيه ضعف فإن الأودي ضعيف عند الأكثرين وقال عكرمة في قوله تعالى \"وإن من شيء إلا يسبح بحمده\" قال الأسطوانة تسبح والشجرة تسبح - الأسطوانة السارية - وقال بعض السلف صرير الباب تسبيحه وخرير الماء تسبيحه قال الله تعالى: \"وإن من شيء إلا يسبح بحمده\" وقال سفيان الثوري عن منصور عن إبراهيم قال الطعام يسبح ويشهد لهذا القول آية السجدة في الحج وقال آخرون إنما يسبح من كان فيه روح يعنون من حيوان ونبات قال قتادة في قوله: \"وإن من شيء إلا يسبح بحمده\" قال كل شيء فيه روح يسبح من شجر أو شيء فيه وقال الحسن والضحاك في قوله: \"وإن من شيء إلا يسبح بحمده\" قالا كل شيء فيه الروح. وقال ابن جرير: حدثنا محمد بن حميد حدثنا يحيى بن واضح وزيد بن حباب قالا حدثنا جرير أبو الخطاب قال كنا مع يزيد الرقاشي ومعه الحسن في طعام فقدموا الخوان فقال يزيد الرقاشي يا أبا سعد يسبح هذا الخوان؟ فقال كان يسبح مرة - قلت الخوان هو المائدة من الخشب - فكأن الحسن رحمه الله ذهب إلى أنه لما كان حيا فيه خضرة كان يسبح فلما قطع وصار خشبة يابسة انقطع تسبيحه وقد يستأنس لهذا القول بحديث ابن عباس أن رسول الله صلى الله عليه وسلم مر بقبرين فقال: \"إنهما ليعذبان وما يعذبان في كبير أما أحدهما فكان لا يستنزه من البول وأما الآخر فكان يمشي بالنميمة\" ثم أخذ جريدة رطبة فشقها نصفين ثم غرز في كل قبر واحدة ثم قال \"لعله يخفف عنهما ما لم ييبسا\" أخرجاه في الصحيحين قال بعض من تكلم على هذا الحديث من العلماء إنما قال ما لم ييبسا لأنهما يسبحان ما دام فيهما خضرة فإذا يبسا انقطع تسبيحهما والله أعلم وقوله: \"إنه كان حليما غفورا\" أي إنه لا يعاجل من عصاه بالعقوبة بل يؤجله وينظره فإن استمر على كفره وعناده أخذه أخذ عزيز مقتدر كما جاء في الصحيحين \"إن الله ليملي للظالم حتى إذا أخذه لم يفلته\" ثم قرأ رسول الله صلى الله عليه وسلم \"وكذلك أخذ ربك إذا أخذ القرى وهي ظالمة\" الآية وقال تعالى: \"وكأين من قرية أمليت لها وهي ظالمة\" الآية وقال \"وكأين من قرية أهلكناها وهي ظالمة\" الآيتين ومن أقلع عما هو فيه من كفر أو عصيان ورجع إلى الله وتاب إليه تاب عليه كما قال تعالى: \"ومن يعمل سوءا أو يظلم نفسه ثم يستغفر الله\" الآية وقال ههنا \"إنه كان حليما غفورا\" كما قال في آخر فاطر \"إن الله يمسك السموات والأرض أن تزولا ولئن زالتا إن أمسكهما من أحد من بعده إنه كان حليما غفورا\" إلى أن قال \"ولو يؤاخذ الله الناس\" إلى آخر السورة."
    },
    {
      "ayah": 45,
      "surah": 17,
      "text": "يقول تعالى لرسوله محمد صلى الله عليه وسلم \"وإذا قرأت يا محمد على هؤلاء المشركين القرآن جعلنا بينك وبينهم حجابا مستورا\". قال قتادة وابن زيد هو الأكنة على قلوبهم كما قال تعالى \"وقالوا قلوبنا في أكنة مما تدعونا إليه وفي آذاننا وقر ومن بيننا وبينك حجاب\" أي مانع حائل أن يصل إلينا مما تقول شيء وقوله \"حجابا مستورا\" بمعنى ساتر كميمون ومشئوم بمعنى يامن وشائم لأنه من يمنهم وشؤمهم وقيل مستورا عن الأبصار فلا تراه وهو مع ذلك حجاب بينهم وبين الهدى ومال إلى ترجيحه ابن جرير رحمه الله وقال الحافظ أبو يعلى الموصلي حدثنا أبو موسى الهروي إسحاق بن إبراهيم حدثنا سفيان عن الوليد بن كثير عن يزيد بن تدرس عن أسماء بنت أبي بكر رضي الله تعالى عنها قالت لما نزلت \"تبت يدا أبي لهب\" جاءت العوراء أم جميل ولها ولولة وفي يدها فهر وهي تقول: مذمما أتينا - أو أبينا - قال أبو موسى الشك مني ودينه قلينا وأمره عصينا. ورسول الله صلى الله عليه وسلم جالس وأبو بكر إلى جنبه فقال أبو بكر رضي الله عنه لقد أقبلت هذه وأنا أخاف أن تراك فقال \"إنها لن تراني\" وقرأ قرآنا اعتصم به منها \"وإذا قرأت القرآن جعلنا بينك وبين الذين لا يؤمنون بالآخرة حجابا مستورا\" قال فجاءت حتى قامت على أبي بكر فلم تر النبي صلى الله عليه وسلم فقالت يا أبا بكر بلغني أن صاحبك هجاني فقال أبو بكر لا ورب هذا البيت ما هجاك قال فانصرفت وهى تقول لقد علمت قريش أني بنت سيدها."
    },
    {
      "ayah": 46,
      "surah": 17,
      "text": "وقوله \"وجعلنا على قلوبهم أكنة\" وهي جمع كنان الذي يغشى القلب \"أن يفقهوه\" أي لئلا يفهموا القرآن \"وفي آذانهم وقرا\" وهو الثقل الذي يمنعهم من سماع القرآن سماعا ينفعهم ويهتدون به. وقوله تعالى \"وإذا ذكرت ربك في القرآن وحده\" أي إذا وحدت الله في تلاوتك وقلت لا إله إلا الله \"ولوا\" أي أدبروا راجعين \"على أدبارهم نفورا\" ونفور جمع نافر كقعود جمع قاعد ويجوز أن يكون مصدرا من غير الفعل والله أعلم كما قال تعالى \"وإذا ذكر الله وحده اشمأزت قلوب الذين لا يؤمنون بالآخرة\" الآية قال قتادة في قوله \"وإذا ذكرت ربك في القرآن\" الآية أن المسلمين لما قالوا لا إله إلا الله أنكر ذلك المشركون وكبرت عليهم فضافها إبليس وجنوده فأبى الله إلا أن يمضيها ويعليها وينصرها ويظهرها على من ناوأها إنها كلمة من خاصم بها فلح ومن قاتل بها نصر إنما يعرفها أهل هذه الجزيرة من المسلمين التي يقطعها الراكب في ليال قلائل ويسير الدهر في فئام من الناس لا يعرفونها ولا يقرون بها. \"قول آخر في الآية\" روى ابن جرير حدثني الحسين بن محمد الذارع حدثنا روح بن المسيب أو رجاء الكلبي حدثنا عمرو بن مالك عن أبي الجوزاء عن ابن عباس في قوله \"وإذا ذكرت ربك في القرآن وحده ولوا على أدبارهم نفورا\" هم الشياطين وهذا غريب جدا في تفسيرها وإلا فالشياطين إذا قرئ القرآن أو نودي بالأذان أو ذكر الله انصرفوا."
    },
    {
      "ayah": 47,
      "surah": 17,
      "text": "يخبر تعالى نبيه محمدا بما يتناجى به رؤساء كفار قريش حين جاءوا يستمعون قراءته صلى الله عليه وسلم سرا من قومهم بما قالوا من أنه رجل مسحور من السحر على المشهور أو من السحر وهو الرئة أي إن تتبعون إن اتبعتم محمدا إلا بشرا يأكل كما قال الشاعر: فإن تسألينا فيم نحن فإننا عصافير من هذا الأنام المسحر وقال الراجز: يسحر بالطعام وبالشراب. أي يغذى وقد صوب هذا القول ابن جرير وفيه نظر لأنهم أرادوا ههنا أنه مسحور له رئي يأتيه بما استمعوه من الكلام الذي يتلوه ومنهم من قال شاعر ومنهم من قال كاهن ومنهم من قال مجنون ومنهم من قال ساحر."
    },
    {
      "ayah": 48,
      "surah": 17,
      "text": "ولهذا قال تعالى \"انظر كيف ضربوا لك الأمثال فضلوا فلا يستطيعون سبيلا\" أي فلا يهتدون إلى الحق ولا يجدون إليه مخلصا قال محمد بن إسحاق في السيرة حدثني محمد بن مسلم بن شهاب الزهري أنه حدث أن أبا سفيان بن حرب وأبا جهل بن هشام والأخنس بن شريق بن عمرو بن وهب الثقفي حليف ابن زهرة خرجوا ليلة ليستمعوا من رسول الله صلى الله عليه وسلم وهو يصلى بالليل في بيته فأخذ كل واحد منهم مجلسا يستمع فيه وكل لا يعلم بمكان صاحبه فباتوا يستمعون له حتى إذا طلع الفجر تفرقوا حتى إذا جمعتهم الطريق تلاوموا وقال بعضهم لبعض لا تعودوا فلو رآكم بعض سفهائكم لأوقعتم في نفسه شيئا ثم انصرفوا حتى إذا كانت الليلة الثانية كل رجل منهم إلى مجلسه فباتوا يستمعون له حتى إذا طلع الفجر تفرقوا وجمعتهم الطريق فقال بعضهم لبعض ما قال أول مرة ثم انصرفوا حتى إذا كانت الليلة الثالثة أخذ كل رجل مجلسه فباتوا يستمعون له حتى إذا طلع الفجر تفرقوا فجمعتهم الطريق فقال بعضهم لبعض لا نبرح حتى نتعاهد لا نعود فتعاهدوا على ذلك ثم تفرقوا فلما أصبح الأخنس بن شريق أخذ عصاه ثم خرج حتى أتى أبا سفيان بن حرب في بيته فقال أخبرني يا أبا حنظلة عن رأيك فيما سمعت من محمد؟ قال يا أبا ثعلبة والله لقد سمعت أشياء أعرفها وأعرف ما يراد بها وسمعت أشياء ما عرفت معناها ولا ما يراد بها. قال الأخنس وأنا والذي حلفت به. قال ثم خرج من عنده حتى أتى أبا جهل فدخل عليه بيته فقال يا أبا الحكم ما رأيك فيما سمعت من محمد؟ قال ماذا سمعت؟ قال تنازعنا نحن وبنو عبد مناف الشرف: أطعموا فأطعمنا وحملوا فحملنا وأعطوا فأعطينا حتى إذا تجاثينا على الركب وكنا كفرسي رهان قالوا منا نبي يأتيه الوحي من السماء فمتى ندرك هذه والله لا نؤمن به أبدا ولا نصدقه. قال فقام عنه الأخنس وتركه."
    },
    {
      "ayah": 49,
      "surah": 17,
      "text": "يقول تعالى مخبرا عن الكفار المستبعدين وقوع المعاد القائلين استفهام إنكار منهم لذلك \"أئذا كنا عظاما ورفاتا\" أي ترابا قاله مجاهد وقال علي بن أبي طلحة عن ابن عباس رضي الله عنهما غبارا \"أئنا لمبعوثون خلقا جديدا\" أي يوم القيامة بعد ما بلينا وصرنا عدما لا نذكر كما أخبر عنهم في الموضع الآخر \"يقولون أئنا لمردودون في الحافرة أئذا كنا عظاما نخرة قالوا تلك إذا كرة خاسرة\" وقوله تعالى \"وضرب لنا مثلا ونسي خلقه\" الآيتين فأمر الله سبحانه رسول الله صلى الله عليه وسلم أن يجيبهم."
    },
    {
      "ayah": 5,
      "surah": 17,
      "text": "وقوله \"فإذا جاء وعد أولاهما\" أي أولى الإفسادتين \"بعثنا عليكم عبادا لنا أولي بأس شديد\" أي سلطنا عليكم جندا من خلقنا أولي بأس شديد أي قوة وعدة وعدد وسلطنة شديدة \"فجاسوا خلال الديار\" أي تملكوا بلادكم وسلكوا خلال بيوتكم أي بينها ووسطها وانصرفوا ذاهبين وجائين لا يخافون أحدا وكان وعدا مفعولا وقد اختلف المفسرون من السلف والخلف في هؤلاء المسلطين عليهم من هم؟ فعن ابن عباس وقتادة أنه جالوت الجزري وجنوده سلط عليهم أولا ثم أديلوا عليه بعد ذلك. وقتل داود جالوت ولهذا قال \"ثم رددنا لك الكرة عليهم\"."
    },
    { "ayah": 50, "surah": 17, "text": "فقال \"قل كونوا حجارة أو حديدا\" إذ هما أشد امتناعا من العظام والرفات." },
    {
      "ayah": 51,
      "surah": 17,
      "text": "\"أو خلقا مما يكبر في صدوركم\" قال ابن إسحاق عن ابن أبي نجيح عن مجاهد سألت ابن عباس عن ذلك فقال: هو الموت وروى عطية عن ابن عمر أنه قال في تفسير هذه الآية لو كنتم موتى لأحييتكم. وكذا قال سعيد بن جبير وأبو صالح والحسن وقتادة والضحاك وغيرهم ومعنى ذلك أنكم لو فرضتم أنكم لو صرتم إلى الموت الذي هو ضد الحياة لأحياكم الله إذا شاء فإنه لا يمتنع عليه شيء إذا أراده. وقد ذكر ابن جرير ههنا حديثا \"يجاء بالموت يوم القيامة كأنه كبش أملح فيوقف بين الجنة والنار ثم يقال يا أهل الجنة أتعرفون هذا؟ فيقولون نعم: ثم يقال يا أهل النار أتعرفون هذا؟ فيقولون نعم فيذبح بين الجنة والنار ثم يقال يا أهل الجنة خلود بلا موت ويا أهل النار خلود بلا موت\" وقال مجاهد \"أو خلقا مما يكبر في صدوركم\" يعني السماء والأرض والجبال وفي رواية: ما شئتم فكونوا فسيعيدكم الله بعد موتكم وقد وقع في التفسير المروي عن الإمام مالك عن الزهري في قوله \"أو خلقا مما يكبر في صدوركم\" قال النبي صلى الله عليه وسلم قال مالك ويقولون هو الموت. وقوله تعالى \"فسيقولون من يعيدنا\" أي من يعيدنا إذا كنا حجارة أو حديدا أو خلقا آخر شديدا \"قل الذي فطركم أول مرة\" أي الذي خلقكم ولم تكونوا شيئا مذكورا ثم صرتم بشرا تنتشرون فإنه قادر على إعادتكم ولو صرتم إلى أي حال \"وهو الذي يبدأ الخلق ثم يعيده وهو أهون عليه\" الآية وقوله تعالى \"فسينغضون إليك رءوسهم\" قال ابن عباس وقتادة يحركونها استهزاء وهذا الذي قالاه هو الذي تعرفه العرب من لغاتها لأن الإنغاض هو التحرك من أسفل إلى أعلى أو من أعلى إلى أسفل ومنه قيل للظليم وهو ولد النعامة نغضا لأنه إذا مشى عجل بمشيته وحرك رأسه ويقال نغضت سنه إذا تحركت وارتفعت من منبتها. وقال الراجز: ونغضت من هرم أسنانها. وقوله \"ويقولون متى هو\" إخبار عنهم بالاستبعاد منهم لوقوع ذلك كما قال تعالى \"ويقولون متى هذا الوعد إن كنتم صادقين\" وقال تعالى \"يستعجل بها الذين لا يؤمنون بها\" وقوله \"قل عسى أن يكون قريبا\" أي احذروا ذلك فإنه قريب إليكم سيأتيكم لا محالة فكل ما هو آت آت. وقوله تعالى \"يوم يدعوكم\" أي الرب تبارك وتعالى \"إذا دعاكم دعوة من الأرض إذا أنتم تخرجون\" أي إذا أمركم بالخروج منها فإنه لا يخالف ولا يمانع بل كما قال تعالى \"وما أمرنا إلا واحدة كلمح بالبصر\" \"إنما قولنا لشيء إذا أردناه أن نقول له كن فيكون\" وقوله \"فإنما هي زجرة واحدة فإذا هم بالساهرة\" أي إنما هو أمر واحد بانتهار فإذا الناس قد خرجوا من باطن الأرض. إلى ظاهرها."
    },
    {
      "ayah": 52,
      "surah": 17,
      "text": "كما قال تعالى \"يوم يدعوكم فتستجيبون بحمده\" أي تقولون كلكم إجابة لأمره وطاعة لإرادته. قال علي بن أبي طلحة عن ابن عباس فتستجيبون بحمده أي بأمره وكذا قال ابن جريج وقال قتادة بمعرفته وطاعته وقال بعضهم \"يوم يدعوكم فتستجيبون بحمده\" أي وله الحمد في كل حال. وقد جاء في الحديث \"ليس على أهل لا إله إلا الله وحشة في قبورهم كأني بأهل لا إله إلا الله يقومون من قبورهم ينفضون التراب عن رءوسهم يقولون لا إله إلا الله وفي رواية يقولون \"الحمد لله الذي أذهب عنا الحزن\" وسيأتي في سورة فاطر. وقوله تعالى \"وتظنون\" أي يوم تقومون من قبوركم \"إن لبثتم\" أي في الدار الدنيا \"إلا قليلا\" وكقوله تعالى \"كأنهم يوم يرونها لم يلبثوا إلا عشية أو ضحاها\" وقال تعالى \"يوم ينفخ في الصور ونحشر المجرمين يومئذ زرقا يتخافتون بينهم إن لبثتم إلا عشرا نحن أعلم بما يقولون إذ يقول أمثلهم طريقة إن لبثتم إلا يوما\" وقال تعالى \"ويوم تقوم الساعة يقسم المجرمون ما لبثوا غير ساعة كذلك كانوا يؤفكون\" وقال تعالى \"قال كم لبثتم في الأرض عدد سنين قالوا لبثنا يوما أو بعض يوم فاسأل العادين قال إن لبثتم إلا قليلا لو أنكم كنت تعلمون\"."
    },
    {
      "ayah": 53,
      "surah": 17,
      "text": "يأمر تبارك وتعالى عبده ورسوله صلى الله عليه وسلم أن يأمر عباد الله المؤمنين أن يقولوا في مخاطباتهم ومحاوراتهم الكلام الأحسن والكلمة الطيبة فإنهم إن لم يفعلوا ذلك نزغ الشيطان بينهم وأخرج الكلام إلى الفعال ووقع الشر والمخاصمة والمقاتلة فإنه عدو لآدم وذريته من حين امتنع من السجود لآدم وعداوته ظاهرة بينة ولهذا نهى أن يشير الرجل إلى أخيه المسلم بحديدة فإن الشيطان ينزغ في يده أي فربما أصابه بها. وقال الإمام أحمد حدثنا عبدالرزاق حدثنا معمر عن همام عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم \"لا يشيرن أحدكم إلى أخيه بالسلاح فإنه لا يدري أحدكم لعل الشيطان أن ينزغ في يده فيقع في حفرة من النار\" أخرجاه من حديث عبدالرزاق. وقال الإمام أحمد: حدثنا عفان حدثنا حماد أنبأنا علي بن زيد عن الحسن قال حدثني رجل من بني سليط قال أتيت النبي صلى الله عليه وسلم وهو في رفلة من الناس فسمعته يقول \"المسلم أخو المسلم لا يظلمه ولا يخذله التقوى ههنا\" قال حماد وقال بيده إلى صدره \"وما تواد رجلان في الله ففرق بينهما إلا حدث يحدثه أحدهما والمحدث شر والمحدث شر والمحدث شر\"."
    },
    {
      "ayah": 54,
      "surah": 17,
      "text": "يقول تعالى \"ربكم أعلم بكم\" أيها الناس أي أعلم بمن يستحق منكم الهداية ومن لا يستحق \"إن يشأ يرحمكم\" بأن يوفقكم لطاعته والإنابة إليه \"أو إن يشأ يعذبكم وما أرسلناك\" يا محمد \"عليهم وكيلا\" أي إنما أرسلناك نذيرا فمن أطاعك دخل الجنة ومن عصاك دخل النار."
    },
    {
      "ayah": 55,
      "surah": 17,
      "text": "وقوله \"وربك أعلم بمن في السموات والأرض\" أي بمراتبهم في الطاعة والمعصية \"ولقد فضلنا بعض النبيين على بعض\" وكما قال تعالى \"تلك الرسل فضلنا بعضهم على بعض منهم من كلم الله ورفع بعضهم درجات\" وهذا لا ينافي ما ثبت في الصحيحين أن رسول الله صلى الله عليه وسلم قال \"لا تفضلوا بين الأنبياء\" فإن المراد من ذلك هو التفضيل بمجرد التشهي والعصبية لا بمقتضى الدليل فإذا دل الدليل على شيء وجب اتباعه ولا خلاف أن الرسل أفضل من بقية الأنبياء وأن أولي العزم منهم أفضلهم وهم الخمسة المذكورون نصا في آيتين من القرآن في سورة الأحزاب \"وإذ أخذنا من النبيين ميثاقهم ومنك ومن نوح وإبراهيم وموسى وعيسى ابن مريم\" وفي الشورى في قوله \"شرع لكم من الدين ما وصى به نوحا والذي أوحينا إليك وما وصينا به إبراهيم وموسى وعيسى أن أقيموا الدين ولا تتفرقوا فيه\" ولا خلاف أن محمدا صلى الله عليه وسلم أفضلهم ثم بعده إبراهيم ثم موسى ثم عيسى عليهم السلام على المشهور وقد بسطناه بدلائله في غير هذا الموضع والله الموفق وقوله تعالى \"وآتينا داود زبورا\" تنبيه على فضله وشرفه. قال البخاري حدثنا إسحاق بن نصر أخبرنا عبدالرزاق أخبرنا معمر عن همام عن أبي هريرة رضي الله عنه عن النبي صلى الله عليه وسلم قال \"خفف على داود القرآن فكان يأمر بدوابه فتسرج فكان يقرؤه قبل أن يفرغ\" يعني القرآن."
    },
    {
      "ayah": 56,
      "surah": 17,
      "text": "يقول تعالى \"قل\" يا محمد لهؤلاء المشركين الذين عبدوا غير الله \"ادعوا الذين زعمتم من دونه\" من الأصنام والأنداد فارغبوا إليهم \"فـ\" إنهم \"لا يملكون كشف الضر عنكم\" أي بالكلية \"ولا تحويلا\" أي بأن يحولوه إلى غيركم والمعنى أن الذي يقدر على ذلك هو الله وحده لا شريك له الذي له الخلق والأمر. قال العوفي عن ابن عباس في قوله \"قل ادعوا الذين زعمتم\" الآية قال كان أهل الشرك يقولون نعبد الملائكة والمسيح وعزيرا وهم الذين يدعون يعني في الملائكة والمسيح وعزيرا."
    },
    {
      "ayah": 57,
      "surah": 17,
      "text": "وقوله تعالى \"أولئك الذين يدعون\" الآية روى البخاري من حديث سليمان بن مهران الأعمش عن إبراهيم عن أبي معمر عن عبدالله في قوله \"أولئك الذين يدعون يبتغون إلى ربهم الوسيلة\" قال ناس من الجن كانوا يعبدون فأسلموا وفي رواية قال كان ناس من الإنس يعبدون ناسا من الجن فأسلم الجن وتمسك هؤلاء بدينهم وقال قتادة عن معبد بن عبدالله الرماني عن عبدالله بن عتبة بن مسعود عن ابن مسعود في قوله \"أولئك الذين يدعون\" الآية قال نزلت في نفر من العرب كانوا يعبدون نفرا من الجن فأسلم الجنيون والإنس الذين كانوا يعبدونهم لا يشعرون بإسلامهم فنزلت هذه الآية وفي رواية عن ابن مسعود كانوا يعبدون صنفا من الملائكة يقال لهم الجن فذكره وقال السدي عن أبي صالح عن ابن عباس في قوله \"أولئك الذين يدعون يبتغون إلى ربهم الوسيلة أيهم أقرب\" قال عيسى وأمه وعزير وقال مغيرة عن إبراهيم كان ابن عباس يقول: في هذه الآية هم عيسى وعزير والشمس والقمر وقال مجاهد عيسى والعزير والملائكة واختار ابن جرير قول ابن مسعود لقوله \"يبتغون إلى ربهم الوسيلة\" وهذا لا يعبر به عن الماضي فلا يدخل فيه عيسى والعزير والملائكة وقال والوسيلة هي القربة كما قال قتادة ولهذا قال \"أيهم أقرب\" وقوله تعالى \"ويرجون رحمته ويخافون عذابه\" لا تتم العبادة إلا بالخوف والرجاء فبالخوف ينكف عن المناهي وبالرجاء يكثر من الطاعات وقوله تعالى \"إن عذاب ربك كان محذورا\" أي ينبغي أن يحذر منه ويخاف من وقوعه وحصوله عياذا بالله منه."
    },
    {
      "ayah": 58,
      "surah": 17,
      "text": "هذا إخبار من الله عز وجل بأنه قد حتم وقضى بما قد كتب عنده في اللوح المحفوظ أنه ما من قرية إلا سيهلكها بأن يبيد أهلها جميعهم أو يعذبهم \"عذابا شديدا\" إما بقتل أو ابتلاء بما يشاء وإنما يكون ذلك بسبب ذنوبهم وخطاياهم كما قال تعالى عن الأمم الماضين \"وما ظلمناهم ولكن ظلموا أنفسهم\" وقال تعالى \"فذاقت وبال أمرها وكان عاقبة أمرها خسرا\" وقال \"وكأين من قرية عتت عن أمر ربها ورسله\" الآيات."
    },
    {
      "ayah": 59,
      "surah": 17,
      "text": "قال سنيد عن حماد بن زيد عن أيوب عن سعيد بن جبير قال: قال المشركون يا محمد إنك تزعم أنه كان قبلك أنبياء فمنهم من سخرت له الريح ومنهم من كان يحيي الموتى فإن سرك أن نؤمن بك ونصدقك فادع ربك أن يكون لنا الصفا ذهبا فأوحى الله إليه \"إني قد سمعت الذي قالوا فإن شئت أن نفعل الذي قالوا فإن لم يؤمنوا نزل العذاب فإنه ليس بعد نزول الآية مناظرة وإن شئت أن نستأتي بقومك استأنيت بهم قال \"يا رب أستأن بهم\" وكذا قال قتادة وابن جريج وغيرهما وروى الإمام أحمد حدثنا عثمان بن محمد حدثنا جرير عن الأعمش عن جعفر بن إياس عن سعيد بن جبير عن ابن عباس قال سأل أهل مكة النبي صلى الله عليه وسلم أن يجعل لهم الصفا ذهبا وأن ينحي الجبال عنهم فيرعووا فقيل له إن شئت أن نستأني بهم وإن شئت أن يأتيهم الذي سألوا فإن كفروا هلكوا كما أهلكت من كان قبلهم من الأمم قال \"لا بل استأن بهم\" وأنزل الله تعالى \"وما منعنا أن نرسل بالآيات إلا أن كذب بها الأولون\" الآية ورواه النسائي من حديث جرير به وقال الإمام أحمد حدثنا عبدالرحمن حدثنا سفيان عن سلمة بن كهيل عن عمران بن حكيم عن ابن عباس قال: قالت قريش للنبي صلى الله عليه وسلم ادع لنا ربك أن يجعل لنا الصفا ذهبا ونؤمن بك قال \"وتفعلون؟\" قالوا نعم قال فدعا فأتاه جبريل فقال إن ربك يقرأ عليك السلام ويقول لك إن شئت أصبح لهم الصفا ذهبا فمن كفر منهم بعد ذلك عذبته عذابا لا أعذبه أحدا من العالمين وإن شئت فتحت لهم أبواب التوبة والرحمة فقال \"بل باب التوبة والرحمة\" وقال الحافظ أبو يعلى في مسنده حدثنا محمد بن إسماعيل بن علي الأنصاري حدثنا خلف بن تميم المصيصي عن عبدالجبار بن عمر الأبلي عن عبدالله بن عطاء بن إبراهيم عن جدته أم عطاء مولاة الزبير بن العوام قالت: سمعت الزبير يقول لما نزلت \"وأنذر عشيرتك الأقربين\" صاح رسول الله صلى الله عليه وسلم على أبي قبيس \"يا آل عبد مناف إني نذير\" فجاءته قريش فحذرهم وأنذرهم فقالوا تزعم أنك نبي يوحى إليك وأن سليمان سخر له الريح والجبال وأن موسى سخر له البحر وأن عيسى كان يحيي الموتى فادع الله أن يسير عنا هذه الجبال ويفجر لنا الأرض أنهارا فتتخذ محارث فنزرع ونأكل وإلا فادع الله أن يحيي لنا موتانا لنكلمهم ويكلمونا وإلا فادع الله أن يصير لنا هذه الصخرة التي تحتك ذهبا فننحت منها وتغنينا عن رحلة الشتاء والصيف فإنك تزعم أنك كهيئتهم. قال: فبينا نحن حوله إذ نزل عليه الوحي فلما سري عنه قال \"والذي نفسي بيده لقد أعطاني ما سألتم ولو شئت لكان ولكنه خيرني بين أن تدخلوا باب الرحمة\" فيؤمن مؤمنكم وبين أن يكلكم إلى ما اخترتم لأنفسكم فتضلوا عن باب الرحمة فلا يؤمن منكم أحد فاخترت باب الرحمة فيؤمن مؤمنكم وأخبرني أنه إن أعطاكم ذلك ثم كفرتم أنه يعذبكم عذابا لا يعذبه أحدا من العالمين\" ونزلت \"وما منعنا أن نرسل بالآيات إلا أن كذب بها الأولون\" وقرأ ثلاث آيات ونزلت \"ولو أن قرآنا سيرت به الجبال أو قطعت به الأرض أو كلم به الموتى\" الآية ولهذا قال تعالى \"وما منعنا أن نرسل بالآيات\" أي نبعث الآيات ونأتي بها على ما سأل قومك منك فإنه سهل علينا يسير لدينا إلا أنه قد كذب بها الأولون بعد ما سألوها وجرت سنتنا فيهم وفي أمثالهم أنهم لا يؤخرون إن كذبوا بها بعد نزولها كما قال الله تعالى في المائدة \"قال الله إني منزلها عليكم فمن يكفر بعد منكم فإني أعذبه عذابا لا أعذبه أحدا من العالمين\" وقال تعالى عن ثمود حين سألوا آية ناقة تخرج من صخرة عينوها فدعا صالح عليه السلام ربه فأخرج لهم منها ناقة على ما سألوا فلما ظلموا بها أي كفروا بمن خلقها وكذبوا رسوله وعقروها فقال \"تمتعوا في داركم ثلاثة أيام ذلك وعد غير مكذوب\" ولهذا قال تعالى \"وآتينا ثمود الناقة مبصرة فظلموا بها\" أي دالة على وحدانية من خلقها وصدق رسوله الذي أجيب دعاؤه فيها \"فظلموا بها\" أي كفروا بها ومنعوها شربها وقتلوها فأبادهم الله عن آخرهم وانتقم منهم وأخذهم أخذ عزيز مقتدر وقوله تعالى \"وما نرسل بالآيات إلا تخويفا\" قال قتادة إن الله تعالى يخوف الناس بما شاء من الآيات لعلهم يعتبرون ويذكرون ويرجعون ذكر لنا أن الكوفة رجفت على عهد ابن مسعود رضي الله عنه فقال يا أيها الناس إن ربكم يستعتبكم فأعتبوه وهكذا روي أن المدينة زلزلت على عهد عمر بن الخطاب رضي الله عنه مرات فقال عمر أحدثتم والله لئن عادت لأفعلن ولأفعلن. وكذا قال رسول الله صلى الله عليه وسلم في الحديث المتفق عليه \"إن الشمس والقمر آيتان من آيات الله وإنهما لا ينكسفان لموت أحد ولا لحياته ولكن الله عز وجل يخوف بهما عباده فإذا رأيتم ذلك فافزعوا إلى ذكره ودعائه واستغفاره - ثم قال - يا أمة محمد والله ما أحد أغير من الله أن يزني عبده أو تزني أمته يا أمة محمد والله لو تعلمون ما أعلم لضحكتم قليلا ولبكيتم كثيرا."
    },
    {
      "ayah": 6,
      "surah": 17,
      "text": "وعن سعيد بن جبير أنه ملك الموصل سنجاريب وجنوده وعنه أيضا وعن غيره أنه بختنصر ملك بابل وقد ذكر ابن أبي حاتم له قصة عجيبة في كيفية ترقيه من حال إلى حال إلى أن ملك البلاد وأنه كان فقيرا مقعدا ضعيفا يستعطي الناس ويستطعمهم ثم آل به الحال إلى ما آل وأنه سار إلى بلاد بيت المقدس فقتل بها خلقا كثيرا من بني إسرائيل وقد روى ابن جرير في هذا المكان حديثا أسنده عن حذيفة مرفوعا مطولا وهو حديث موضوع لا محالة لا يستريب في ذلك من عنده أدنى معرفة بالحديث والعجب كل العجب كيف راج عليه مع جلالة قدره وإمامته وقد صرح شيخنا الحافظ العلامة أبو الحجاج المزي رحمه الله بأنه موضوع مكذوب. وكتب ذلك على حاشية الكتاب. وقد وردت في هذا آثار كثيرة إسرائيلية لم أر تطويل الكتاب بذكرها لأن منها ما هو موضوع من وضع بعض زنادقتهم ومنها ما قد يحتمل أن يكون صحيحا ونحن في غنية عنها ولله الحمد. وفيما قص الله علينا في كتابه غنية عما سواه من بقية الكتب قبله ولم يحوجنا الله ولا رسوله إليهم وقد أخبر الله عنهم أنهم لما طغوا وبغوا سلط الله عليهم عدوهم فاستباح بيضتهم وسلك خلال بيوتهم وأذلهم وقهرهم جزاء وفاقا وما ربك بظلام للعبيد فإنهم كانوا قد تمردوا وقتلوا خلقا من الأنبياء والعلماء. وقد روى ابن جرير حدثني يونس بن عبد الأعلى حدثنا ابن وهب أخبرني سليمان بن بلال عن يحيى بن سعيد قال: سمعت سعيد بن المسيب يقول: ظهر بختنصر على الشام فخرب بيت المقدس وقتلهم ثم أتى دمشق فوجد بها دما يغلي على كبا فسألهم ما هذا الدم: فقالوا أدركنا آباءنا على هذا وكلما ظهر عليه الكبا ظهر قال فقتل على ذلك الدم سبعين ألفا من المسلمين وغيرهم فسكن وهذا صحيح إلى سعيد بن المسيب وهذا هو المشهور وأنه قتل أشرافهم وعلماءهم حتى إنه لم يبق من يحفظ التوراة وأخذ معه منهم خلقا كثيرا أسرى من أبناء الأنبياء وغيرهم وجرت أمور وكوائن يطول ذكرها ولو وجدنا ما هو صحيح أو ما يقاربه لجاز كتابته وروايته والله أعلم ثم قال تعالى\"إن أحسنتم أحسنتم لأنفسكم وإن أسأتم فلها."
    },
    {
      "ayah": 60,
      "surah": 17,
      "text": "وإذ قلنا لك إن ربك أحاط بالناس وما جعلنا الرؤيا التي أريناك إلا فتنة للناس والشجرة الملعونة في القرآن ونخوفهم فما يزيدهم إلا طغيانا كبيرايقول تعالى لرسوله صلى الله عليه وسلم محرضا له على إبلاغ رسالته ومخبرا له بأنه قد عصمه من الناس فإنه القادر عليهم وهم في قبضته وتحت قهره وغلبته. قال مجاهد وعروة بن الزبير والحسن وقتادة وغيرهم في قوله \" وإذ قلنا لك إن ربك أحاط بالناس \" أي عصمك منهم وقوله \" وما جعلنا الرؤيا التي أريناك إلا فتنة للناس \" الآية قال البخاري حدثنا علي بن عبد الله حدثنا سفيان عن عمرو عن عكرمة عن ابن عباس \" وما جعلنا الرؤيا التي أريناك إلا فتنة للناس \" قال هي رؤيا عين أريها رسول الله صلى الله عليه وسلم ليلة أسري به \" والشجرة الملعونة في القرآن \" شجرة الزقوم وكذا رواه أحمد وعبد الرزاق وغيرهما عن سفيان بن عيينة به وكذا رواه العوفي عن ابن عباس , وهكذا فسر ذلك بليلة الإسراء مجاهد وسعيد بن جبير والحسن ومسروق وإبراهيم وقتادة وعبد الرحمن بن زيد وغير واحد . وقد تقدمت أحاديث الإسراء في أول السورة مستقصاة ولله الحمد والمنة . وتقدم أن ناسا رجعوا عن دينهم بعدما كانوا على الحق لأنه لم تحمل قلوبهم وعقولهم ذلك فكذبوا بما لم يحيطوا بعلمه وجعل الله ذلك ثباتا ويقينا لآخرين ولهذا قال \" إلا فتنة \" أي اختبارا وامتحانا وأما الشجرة الملعونة فهي شجرة الزقوم لما أخبرهم رسول الله صلى الله عليه وسلم أنه رأى الجنة والنار ورأى شجرة الزقوم فكذبوا بذلك حتى قال أبو جهل عليه لعائن الله هاتوا لنا تمرا وزبدا وجعل يأكل من هذا بهذا ويقول تزقموا فلا نعلم الزقوم غير هذا حكى ذلك ابن عباس ومسروق وأبو مالك والحسن البصري وغير واحد وكل من قال إنها ليلة الإسراء فسره كذلك بشجرة الزقوم وقيل المراد بالشجرة الملعونة بنو أمية وهو غريب ضعيف وقال ابن جرير حدثت عن محمد بن الحسن بن زبالة حدثنا عبد المهيمن بن عباس بن سهل بن سعيد حدثني أبي عن جدي قال : رأى رسول الله صلى الله عليه وسلم بني فلان ينزون على منبره نزو القرود فساءه ذلك فما استجمع ضاحكا حتى مات قال وأنزل الله في ذلك \" وما جعلنا الرؤيا التي أريناك إلا فتنة للناس \" الآية وهذا السند ضعيف جدا فإن محمد بن الحسن بن زبالة متروك وشيخه أيضا ضعيف بالكلية ولهذا اختار ابن جرير أن المراد بذلك ليلة الإسراء وأن الشجرة الملعونة هي شجرة الزقوم قال لإجماع الحجة من أهل التأويل على ذلك أي في الرؤيا والشجرة وقوله \" ونخوفهم \" أي الكفار بالوعيد والعذاب والنكال \" فما يزيدهم إلا طغيانا كبيرا \" أي تماديا فيما هم فيه من الكفر والضلال وذلك من خذلان الله لهم ."
    },
    {
      "ayah": 61,
      "surah": 17,
      "text": "يذكر تبارك وتعالى عداوة إبليس لعنه الله لآدم وذريته وأنها عداوة قديمة منذ خلق آدم فإنه تعالى أمر الملائكة بالسجود لآدم فسجدوا كلهم إلا إبليس استكبر وأبى أن يسجد له افتخارا عليه واحتقارا له \"قال أأسجد لمن خلقت طينا\" كما قال في الآية الأخرى \"أنا خير منه خلقتني من نار وخلقته من طين\" وقال أيضا أرأيتك يقول للرب جراءة وكفرا والرب يحلم وينظر."
    },
    {
      "ayah": 62,
      "surah": 17,
      "text": "\"قال أرأيتك هذا الذي كرمت علي\" الآية قال علي بن أبي طلحة عن ابن عباس يقول لأستولين على ذريته إلا قليلا وقال مجاهد لأحتوين وقال ابن زيد لأضلنهم وكلها متقاربة والمعنى أرأيتك هذا الذي شرفته وعظمته علي لئن أنظرتني لأضلن ذريته إلا قليلا منهم."
    },
    {
      "ayah": 63,
      "surah": 17,
      "text": "لما سأل إبليس النظرة قال الله له \"اذهب\" فقد أنظرتك كما قال في الآية الأخرى قال \"فإنك من المنظرين إلى يوم الوقت المعلوم\" ثم أوعده ومن اتبعه من ذرية آدم جهنم \"قال اذهب فمن تبعك منهم فإن جهنم جزاؤكم\" أي على أعمالكم \"جزاء موفورا\" قال مجاهد وافرا وقال قتادة موفورا عليكم لا ينقص لكم منه."
    },
    {
      "ayah": 64,
      "surah": 17,
      "text": "وقوله تعالى \"واستفزز من استطعت منهم بصوتك\" قيل هو الغناء قال مجاهد باللهو والغناء أي استخفهم بذلك وقال ابن عباس في قوله \"واستفزز من استطعت منهم بصوتك\" قال كل داع دعا إلى معصية الله عز وجل وقال قتادة واختاره ابن جرير وقوله تعالى \"وأجلب عليهم بخيلك ورجلك\" يقول واحمل عليهم بجنودك خيالتهم ورجلتهم فإن الرجل جمع راجل كما أن الركب جمع راكب وصحب جمع صاحب ومعناه تسلط عليهم بكل ما تقدر عليه وهذا أمر قدري كقوله تعالى \"ألم تر أنا أرسلنا الشياطين على الكافرين تؤزهم أزا\" أي تزعجهم إلى المعاصي إزعاجا وتسوقهم إليها سوقا وقال ابن عباس ومجاهد في قوله \"وأجلب عليهم بخيلك ورجلك\" قال كل راكب وماش في معصية الله وقال قتادة: إن له خيلا ورجالا من الجن والإنس وهم الذين يطيعونه تقول العرب أجلب فلان على فلان إذا صاح عليه ومنه نهى في المسابقة عن الجلب والجنب ومنه اشتقاق الجلبة وهي ارتفاع الأصوات وقوله تعالى \"وشاركهم في الأموال والأولاد\" قال ابن عباس ومجاهد: هو ما أمرهم به من إنفاق الأموال في معاصي الله تعالى وقال عطاء: هو الربا وقال الحسن: هو جمعها من خبيث وإنفاقها في حرام وكذا قال قتادة وقال العوفي عن ابن عباس رضي الله عنهما أما مشاركته إياهم في أموالهم فهو ما حرموه من أنعامهم يعني من البحائر والسوائب ونحوها وكذا قال الضحاك وقتادة وقال ابن جرير والأولى أن يقال إن الآية تعم ذلك كله وقوله \"والأولاد\" قال العوفي عن ابن عباس ومجاهد والضحاك يعني أولاد الزنا وقال علي ابن أبي طلحة عن ابن عباس هو ما كانوا قتلوه من أولادهم سفها بغير علم وقال قتادة عن الحسن البصري: قد والله شاركهم في الأموال والأولاد مجسوا وهودوا ونصروا وصبغوا غير صبغة الإسلام وجزءوا من أمواله جزءا للشيطان وكذا قال قتادة سواء وقال أبو صالح عن ابن عباس هو تسميتهم أولادهم عبدالحارث وعبد شمس وعبد فلان. قال ابن جرير وأولى الأقوال بالصواب أن يقال كل مولود ولدته أنثى عصى الله فيه بتسميته بما يكرهه الله أو بإدخاله في غير الدين الذي ارتضاه الله أو بالزنا بأمه أو بقتله أو وأده أو غير ذلك من الأمور التي يعصي الله بفعله به أو فيه فقد دخل في مشاركة إبليس فيه من ولد ذلك الولد له أو منه لأن الله لم يخصص بقوله \"وشاركهم في الأموال والأولاد\" معنى الشركة فيه بمعنى دون معنى فكل ما عصي الله فيه أو به أو أطيع الشيطان فيه أو به فهو مشاركة وهذا الذي قاله متجه وكل من السلف رحمهم الله فسر بعض المشاركة فقد ثبت في صحيح مسلم عن عياض بن حماد أن رسول الله صلى الله عليه وسلم قال \"يقول الله عز وجل إني خلقت عبادي حنفاء فجاءتهم الشياطين فاجتالتهم عن دينهم وحرمت عليهم ما أحللت لهم\" وفي الصحيحين أن رسول الله صلى الله عليه وسلم قال \"لو أن أحدهم إذا أراد أن يأتي أهله قال بسم الله اللهم جنبنا الشيطان وجنب الشيطان ما رزقتنا فإنه إن يقدر بينهما ولد في ذلك لم يضره الشيطان أبدا\" وقوله تعالى \"وعدهم وما يعدهم الشيطان إلا غرورا\" كما أخبر تعالى عن إبليس أنه يقول إذا حصحص الحق يوم يقضى بالحق \"إن الله وعدكم وعد الحق ووعدتكم فأخلفتكم\" الآية."
    },
    {
      "ayah": 65,
      "surah": 17,
      "text": "وقوله تعالى \"إن عبادي ليس لك عليهم سلطان\" إخبار بتأييده تعالى عباده المؤمنين وحفظه إياهم وحراسته لهم من الشيطان الرجيم ولهذا قال تعالى \"وكفى بربك وكيلا\" أي حافظا ومؤيدا ونصيرا وقال الإمام أحمد حدثنا قتيبة حدثنا ابن لهيعة عن موسى بن وردان عن أبي هريرة رضي الله عنه أن رسول الله صلى الله عليه وسلم قال \"إن المؤمن لينض شياطينه كما ينض أحدكم بعيره في السفر\" ينض أي يأخذ بناصيته ويقهره."
    },
    {
      "ayah": 66,
      "surah": 17,
      "text": "ويخبر تعالى عن لطفه بخلقه في تسخيره لعباده الفلك في البحر وتسهيله لمصالح عباده لابتغائهم من فضله في التجارة من إقليم إلى إقليم ولهذا قال \"إنه كان بكم رحيما\" أي إنما فعل هذا بكم من فضله عليكم ورحمته بكم."
    },
    {
      "ayah": 67,
      "surah": 17,
      "text": "يخبر تبارك وتعالى أن الناس إذا مسهم ضر دعوه منيبين إليه مخلصين له الدين ولهذا قال تعالى \"وإذا مسكم الضر في البحر ضل من تدعون إلا إياه\" أي ذهب عن قلوبكم كل ما تعبدون غير الله تعالى كما اتفق لعكرمة ابن أبي جهل لما ذهب فارا من رسول الله صلى الله عليه وسلم حين فتح مكة فذهب هاربا فركب في البحر ليدخل الحبشة فجاءتهم ريح عاصف فقال القوم بعضهم لبعض إنه لا يغني عنكم إلا أن تدعو الله وحده فقال عكرمة في نفسه والله إن كان لا ينفع في البحر غيره فإنه لا ينفع في البر غيره اللهم لك علي عهد لئن أخرجتني منه لأذهبن فلأضعن يدي في يد محمد فلأجدنه رءوفا رحيما فخرجوا من البحر فرجع إلى رسول الله صلى الله عليه وسلم فأسلم وحسن إسلامه رضي الله عنه وأرضاه. وقوله تعالى \"فلما نجاكم إلى البر أعرضتم\" أي نسيتم ما عرفتم من توحيده في البحر وأعرضتم عن دعائه وحده لا شريك له \"وكان الإنسان كفورا\" أي سجيته هذا ينسى النعم ويجحدها إلا من عصم الله."
    },
    {
      "ayah": 68,
      "surah": 17,
      "text": "يقول تعالى أفحسبتم بخروجكم إلى البر أمنتم من انتقامه وعذابه أن يخسف بكم جانب البر أو يرسل عليكم حاصبا وهو المطر الذي فيه حجارة قاله مجاهد وغير واحد كما قال تعالى \"إنا أرسلنا عليهم حاصبا إلا آل لوط نجيناهم بسحر نعمة من عندنا\" وقد قال في الآية الأخرى \"وأمطرنا عليهم حجارة من طين\" وقال \"أأمنتم من في السماء أن يخسف بكم الأرض فإذا هي تمور أم أمنتم من في السماء أن يرسل عليكم حاصبا فستعلمون كيف نذير\" وقوله \"ثم لا تجدوا لكم وكيلا\" أي ناصرا يرد ذلك عنكم وينقذكم منه."
    },
    {
      "ayah": 69,
      "surah": 17,
      "text": "يقول تبارك وتعالى \"أم أمنتم\" أيها المعرضون عنا بعدما اعترفوا بتوحيدنا في البحر وخرجوا إلى البر \"أن يعيدكم\" في البحر مرة ثانية \"فيرسل عليكم قاصفا من الريح\" أي يقصف الصواري ويغرق المراكب قال ابن عباس وغيره: القاصف ريح البحار التي تكسر المراكب وتغرقها وقوله \"فيغرقكم بما كفرتم\" أي بسبب كفركم وإعراضكم عن الله تعالى وقوله \"ثم لا تجدوا لكم علينا به تبيعا\" قال ابن عباس نصيرا وقال مجاهد نصيرا ثائرا أي يأخذ بثأركم بعدكم. وقال قتادة ولا نخاف أحدا يتبعنا بشيء من ذلك."
    },
    {
      "ayah": 7,
      "surah": 17,
      "text": "قوله تعالى\"إن أحسنتم أحسنتم لأنفسكم وإن أسأتم فلها\"أي فعليها كما قال تعالى\"من عمل صالحا فلنفسه ومن أساء فعليها\" وقوله \"فإذا جاء وعد الآخرة\" أي الكرة الآخرة أي إذا أفسدتم الكرة الثانية وجاء أعداؤكم ليسوءوا وجوهكم\" أي يهينوكم ويقهروكم \"وليدخلوا المسجد\" أي بيت المقدس \"كما دخلوه أول مرة\" أي في التي جاسوا فيها خلال الديار \"وليتبروا\" أي يدمروا ويخربوا \"ما علوا تتبيرا\" أي ما ظهروا عليه."
    },
    {
      "ayah": 70,
      "surah": 17,
      "text": "ويخبر تعالى عن تشريفه لبني آدم وتكريمه إياهم في خلقه لهم على أحسن الهيئات وأكملها كقوله تعالى \"لقد خلقنا الإنسان في أحسن تقويم\" أن يمشي قائما منتصبا على رجليه ويأكل بيديه وغيره من الحيوانات يمشي على أربع ويأكل بفمه وجعل له سمعا وبصرا وفؤادا يفقه بذلك كله وينتفع به ويفرق بين الأشياء ويعرف منافعها وخواصها ومضارها في الأمور الدينية والدنيوية \"وحملناهم في البر\" أي على الدواب من الأنعام والخيل والبغال وفي البحر أيضا على السفن الكبار والصغار \"ورزقناهم من الطيبات\" أي من زروع وثمار ولحوم وألبان من سائر أنواع الطعوم والألوان المشتهاة اللذيذة والمناظر الحسنة والملابس الرفيعة من سائر الأنواع على اختلاف أصنافها وألوانها وأشكالها مما يصنعونه لأنفسهم ويجلبه إليهم غيرهم من أقطار الأقاليم والنواحي \"وفضلناهم على كثير ممن خلقنا تفضيلا\" أي من سائر الحيوانات وأصناف المخلوقات وقد استدل بهذه الآية الكريمة على أفضلية جنس البشر على جنس الملائكة. قال عبدالرزاق: أخبرنا معمر عن زيد بن أسلم قال: قالت الملائكة يا ربنا إنك أعطيت بني آدم الدنيا يأكلون منها ويتنعمون ولم تعطنا ذلك فأعطنا الآخرة فقال الله تعالى \"وعزتي وجلالي لا أجعل صالح ذرية من خلقت بيدي كمن قلت فكان\" وهذا الحديث مرسل من هذا الوجه وقد روي من وجه آخر متصلا. وقال الحافظ أبو القاسم الطبراني: حدثنا أحمد بن محمد بن صدقة البغدادي حدثنا إبراهيم بن عبدالله بن خارجة المصيصي حدثنا حجاج بن محمد حدثنا محمد أبو غسان محمد بن مطرف عن صفوان بن سليم عن عطاء بن يسار عن عبدالله بن عمرو عن النبي صلى الله عليه وسلم قال \"إن الملائكة قالت يا ربنا أعطيت بني آدم الدنيا يأكلون فيها ويشربون ويلبسون ونحن نسبح بحمدك ولا نأكل ولا نشرب ولا نلهو فكما جعلت لهم الدنيا فاجعل لنا الآخرة قال لا أجعل صالح ذرية من خلقت بيدي كمن قلت له كن فكان\" وقد روى ابن عساكر من طريق محمد بن أيوب الرازي حدثنا الحسن بن علي بن خلف الصيدلاني حدثنا سليمان بن عبدالرحمن حدثني عثمان بن حصن بن عبيدة بن علاق سمعت عروة بن رويم اللخمي حدثني أنس بن مالك عن رسول الله صلى الله عليه وسلم قال \"إن الملائكة قالوا ربنا خلقتنا وخلقت بني آدم وجعلتهم يأكلون الطعام ويشربون الشراب ويلبسون الثياب ويتزوجون النساء ويركبون الدواب ينامون ويستريحون ولم تجعل لنا من ذلك شيئا فاجعل لهم الدنيا ولنا الآخرة فقال الله عز وجل \"لا أجعل من خلقته بيدي ونفخت فيه من روحي كمن قلت له كن فكان\" وقال الطبراني حدثنا عبدان بن أحمد حدثنا عمر بن سهل حدثنا عبدالله بن تمام عن خالد الحذاء عن بشر بن شغاف عن أبيه عن عبدالله ابن عمرو قال: قال رسول الله صلى الله عليه وسلم \"ما شيء أكرم على الله يوم القيامة من ابن آدم\" قيل يا رسول الله ولا الملائكة قال \"ولا الملائكة الملائكة مجبورون بمنزلة الشمس والقمر\" وهذا حديث غريب جدا."
    },
    {
      "ayah": 71,
      "surah": 17,
      "text": "يخبر تبارك وتعالى عن يوم القيامة أنه يحاسب كل أمة بإمامهم وقد اختلفوا في ذلك فقال مجاهد وقتادة أي بنبيهم وهذا كقوله تعالى \"ولكل أمة رسول فإذا جاء رسولهم قضى بينهم بالقسط\" الآية وقال بعض السلف هذا أكبر شرف لأصحاب الحديث لأن إمامهم النبي صلى الله عليه وسلم وقال ابن زيد بكتابهم الذي أنزل على نبيهم من التشريع واختاره ابن جرير وروي عن ابن أبي نجيح عن مجاهد أنه قال: بكتبهم فيحتمل أن يكون أراد هذا وأن يكون أراد ما رواه العوفي عن ابن عباس في قوله \"يوم ندعوا كل أناس بإمامهم\" أي بكتاب أعمالهم وكذا قال أبو العالية والحسن والضحاك وهذا القول هو الأرجح لقوله تعالى \"وكل شيء أحصيناه في إمام مبين\" وقال تعالى \"ووضع الكتاب فترى المجرمين مشفقين مما فيه\" الآية ويحتمل أن المراد بإمامهم أي كل قوم بمن يأتمون به فأهل الإيمان ائتموا بالأنبياء عليهم السلام وأهل الكفر ائتموا بأئمتهم كما قال \"وجعلناهم أئمة يدعون إلى النار\" وفي الصحيحين \"لتتبع كل أمة ما كانت تعبد فيتبع من كان يعبد الطواغيت الطواغيت\" الحديث وقال تعالى \"وترى كل أمة جاثية كل أمة تدعى إلى كتابها اليوم تجزون ما كنتم تعملون هذا كتابنا ينطق عليكم بالحق إنا كنا نستنسخ ما كنتم تعملون\" وهذا لا ينافي أن يجاء بالنبي إذا حكم الله بين أمته فإنه لابد أن يكون شاهدا على أمته بأعمالها كقوله تعالى \"وأشرقت الأرض بنور ربها ووضع الكتاب وجيء بالنبيين والشهداء\" وقوله تعالى \"فكيف إذا جئنا من كل أمة بشهيد وجئنا بك على هؤلاء شهيدا\" ولكن المراد ههنا بالإمام هو كتاب الأعمال ولهذا قال تعالى \"يوم ندعوا كل أناس بإمامهم فمن أوتي كتابه بيمينه فأولئك يقرءون كتابهم\" أي من فرحته وسروره بما فيه من العمل الصالح يقرؤه ويحب قراءته كقوله \"فأما من أوتي كتابه بيمينه فيقول هاؤم اقرأوا كتابيه - إلى قوله- وأما من أوتي كتابه بشماله\" الآيات وقوله تعالى \"ولا يظلمون فتيلا\" قد تقدم أن الفتيل هو الخيط المستطيل في شق النواة. وقد روى الحافظ أبو بكر البزار حديثا في هذا فقال: حدثنا محمد بن يعمر ومحمد بن عمان بن كرامة قالا: حدثنا عبيد الله بن موسى عن إسرائيل عن السدي عن أبيه عن أبي هريرة رضي الله عنه عن النبي صلى الله عليه وسلم في قول الله تعالى \"يوم ندعوا كل أناس بإمامهم\" قال \"يدعى أحدهم فيعطى كتابه بيمينه ويمد له في جسمه ويبيض وجهه ويجعل على رأسه تاج من لؤلؤة يتلألأ فينطلق إلى أصحابه فيرونه من بعيد فيقولون اللهم آتنا بهذا وبارك لنا في هذا فيأتيهم فيقول لهم أبشروا فإن لكل رجل منكم مثل هذا وأما الكافر فيسود وجهه ويمد له في جسمه ويراه أصحابه فيقولون نعوذ بالله من هذا أو من شر هذا اللهم لا تأتنا به فيأتيهم فيقولون اللهم اخزه فيقول أبعدكم الله فإن لكل رجل منكم مثل هذا\" ثم قال البزار لا يروى إلا من هذا الوجه."
    },
    {
      "ayah": 72,
      "surah": 17,
      "text": "وقوله تعالى \"ومن كان في هذه أعمى\" الآية قال ابن عباس ومجاهد وقتادة وابن زيد \"ومن كان في هذه\" أي في الحياة الدنيا \"أعمى\" أي عن حجة الله وآياته وبيناته \"فهو في الآخرة أعمى\" أي كذلك يكون \"وأضل سبيلا\" أي وأضل منه كما كان في الدنيا عياذا بالله من ذلك."
    },
    {
      "ayah": 73,
      "surah": 17,
      "text": "يخبر تعالى عن تأييده رسوله صلوات الله عليه وسلامه وتثبيته وعصمته وسلامته من شر الأشرار وكيد الفجار وأنه تعالى هو المتولي أمره ونصره وأنه لا يكله إلى أحد من خلقه بل هو وليه وحافظه وناصره ومؤيده ومظفره ومظهر دينه على من عاداه وخالفه وناوأه في مشارق الأرض ومغاربها صلى الله عليه وسلم تسليما كثيرا إلى يوم الدين."
    },
    {
      "ayah": 74,
      "surah": 17,
      "text": "يخبر تعالى عن تأييده رسوله صلوات الله عليه وسلامه وتثبيته وعصمته وسلامته من شر الأشرار وكيد الفجار وأنه تعالى هو المتولي أمره ونصره وأنه لا يكله إلى أحد من خلقه بل هو وليه وحافظه وناصره ومؤيده ومظفره ومظهر دينه على من عاداه وخالفه وناوأه في مشارق الأرض ومغاربها صلى الله عليه وسلم تسليما كثيرا إلى يوم الدين."
    },
    {
      "ayah": 75,
      "surah": 17,
      "text": "إذا لأذقناك ضعف الحياة وضعف الممات ثم لا تجد لك علينا نصيرايخبر تعالى عن تأييده رسوله صلوات الله عليه وسلامه وتثبيته وعصمته وسلامته من شر الأشرار وكيد الفجار وأنه تعالى هو المتولي أمره ونصره وأنه لا يكله إلى أحد من خلقه بل هو وليه وحافظه وناصره ومؤيده ومظفره ومظهر دينه على من عاداه وخالفه وناوأه في مشارق الأرض ومغاربها صلى الله عليه وسلم تسليما كثيرا إلى يوم الدين ."
    },
    {
      "ayah": 76,
      "surah": 17,
      "text": "قيل نزلت في اليهود إذ أشاروا على رسول الله صلى الله عليه وسلم بسكنى الشام بلاد الأنبياء وترك سكنى المدينة. وهذا القول ضعيف لأن هذه الآية مكية وسكنى المدينة بعد ذلك وقيل إنها نزلت بتبوك وفي صحته نظر. روى البيهقي عن الحاكم عن الأصم عن أحمد بن عبدالجبار العطاردي عن يونس بن بكير عن عبدالحميد بن بهرام عن شهر ابن حوشب عن عبدالرحمن بن غنم أن اليهود أتوا رسول الله صلى الله عليه وسلم يوما فقالوا يا أبا القاسم إن كنت صادقا أنك نبي فالحق بالشام فإن الشام أرض المحشر وأرض الأنبياء فصدق ما قالوا فغزا غزوة تبوك لا يريد إلا الشام فلما بلغ تبوك أنزل الله عليه آيات من سورة بني إسرائيل بعدما ختمت السورة \"وإن كادوا ليستفزونك من الأرض ليخرجوك منها إلى قوله\" تحويلا\" فأمره الله بالرجوع إلى المدينة وقال: فيها محياك ومماتك ومنها تبعث. وفي هذا الإسناد نظر والأظهر أن هذا ليس بصحيح فإن النبي صلى الله عليه وسلم لم يغز تبوك عن قول اليهود وإنما غزاها امتثالا لقوله تعالى \"يا أيها الذين آمنوا قاتلوا الذين يلونكم من الكفار\" ولقوله تعالى \"قاتلوا الذين لا يؤمنون بالله ولا باليوم الآخر ولا يحرمون ما حرم الله ورسوله ولا يدينون دين الحق من الذين أوتوا الكتاب حتى يعطوا الجزية عن يد وهم صاغرون\" وغزاها ليقتص وينتقم ممن قتل أهل مؤتة من أصحابه والله أعلم ولو صح هذا لحمل عليه الحديث الذي رواه الوليد بن مسلم عن عقير بن معدان عن سليم بن عامر عن أبي أمامة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم \"أنزل القرآن في ثلاثة أمكنة مكة والمدينة والشام\" قال الوليد يعني بيت المقدس وتفسير الشام بتبوك أحسن مما قال الوليد إنه بيت المقدس والله أعلم. وقيل نزلت في كفار قريش هموا بإخراج رسول الله صلى الله عليه وسلم من بين أظهرهم فتوعدهم الله بهذه الآية وأنهم لو أخرجوه لما لبثوا بعده بمكة إلا يسيرا وكذلك وقع فإنه لم يكن بعد هجرته من بين أظهرهم بعدما اشتد أذاهم له إلا سنة ونصف حتى جمعهم الله وإياه ببدر على غير ميعاد فأمكنه منهم وسلطه عليهم وأظفره بهم فقتل أشرافهم وسبى ذراريهم ولهذا قال تعالى."
    },
    {
      "ayah": 77,
      "surah": 17,
      "text": "\"سنة من قد أرسلنا\"أي هكذا عادتنا في الذين كفروا برسلنا وآذوهم بخروج الرسول من بين أظهرهم يأتيهم العذاب ولولا أنه صلى الله تعالى عليه وعلى آله وسلم رسول الرحمة لجاءهم من النقم في الدنيا ما لا قبل لأحد به ولهذا قال تعالى \"وما كان الله ليعذبهم وأنت فيهم\" الآية."
    },
    {
      "ayah": 78,
      "surah": 17,
      "text": "يقول تبارك وتعالى لرسوله صلى الله عليه وسلم آمرا له بإقامة الصلوات المكتوبات في أوقاتها \"أقم الصلاة لدلوك الشمس\" قيل لغروبها قاله ابن مسعود ومجاهد وابن زيد وقال هشيم عن مغيرة عن الشعبي عن ابن عباس: دلوكها زوالها ورواه نافع عن ابن عمر ورواه مالك في تفسيره عن الزهري عن ابن عمر وقاله أبو برزة الأسلمي وهو رواية أيضا عن ابن مسعود ومجاهد وبه قال الحسن والضحاك وأبو جعفر الباقر وقتادة واختاره ابن جرير ومما استشهد عليه ما رواه عن ابن حميد عن الحكم بن بشير حدثنا عمرو بن قيس عن ابن أبي ليلى عن رجل عن جابر بن عبدالله قال: دعوت رسول الله صلى الله عليه وسلم ومن شاء من أصحابه فطعموا عندي ثم خرجوا حين زالت الشمس فخرج النبي صلى الله عليه وسلم فقال \"اخرج يا أبا بكر فهذا حين دلكت الشمس\" ثم رواه عن سهل بن بكار عن أبي عوانة عن الأسود بن قيس عن نبيح العنزي عن جابر عن رسول الله صلى الله عليه وسلم نحوه فعلى هذا تكون هذه الآية دخل فيها أوقات الصلوات الخمس فمن قوله \"لدلوك الشمس إلى غسق الليل\" وهو ظلامه وقيل غروب الشمس أخذ منه الظهر والعصر والمغرب والعشاء وقوله \"وقرآن الفجر\" يعني صلاة الفجر وقد ثبتت السنة عن رسول الله صلى الله عليه وسلم تواترا من أفعاله وأقواله بتفاصيل هذه الأوقات على ما عليه أهل الإسلام اليوم مما تلقوه خلفا عن سلف وقرنا بعد قرن كما هو مقرر في مواضعه ولله الحمد \"إن قرآن الفجر كان مشهودا\" قال الأعمش عن إبراهيم عن ابن مسعود وعن أبي صالح عن أبي هريرة رضي الله عنهما عن النبي صلى الله عليه وسلم في هذه الآية \"وقرآن الفجر إن قرآن الفجر كان مشهودا\" قال تشهده ملائكة الليل وملائكة النهار. وقال البخاري: حدثنا عبدالله بن محمد حدثنا عبدالرزاق أنا معمر عن الزهري عن أبي سلمة وسعيد بن المسيب عن أبي هريرة رضي الله عنه أن النبي صلى الله عليه وسلم قال \"فضل صلاة الجميع على صلاة الواحد خمس وعشرون درجة وتجتمع ملائكة الليل وملائكة النهار في صلاة الفجر\" يقول أبو هريرة اقرأوا إن شئتم \"وقرآن الفجر إن قرآن الفجر كان مشهودا\". وقال الإمام أحمد: حدثنا أسباط حدثنا الأعمش عن إبراهيم عن ابن مسعود عن النبي صلى الله عليه وسلم وحدثنا الأعمش عن أبي صالح عن أبي هريرة عن النبي صلى الله عليه وسلم في قوله: \"وقرآن الفجر إن قرآن الفجر كان مشهودا\" قال \"تشهده ملائكة الليل وملائكة النهار\" ورواه الترمذي والنسائي وابن ماجه ثلاثتهم عن عبيد بن أسباط بن محمد عن أبيه به وقال الترمذي حسن صحيح. وفي لفظ في الصحيحين من طريق مالك عن أبي الزناد عن الأعرج عن أبي هريرة عن النبي صلى الله عليه وسلم قال \"يتعاقبون فيكم ملائكة بالليل وملائكة بالنهار ويجتمعون في صلاة الصبح وفي صلاة العصر فيعرج الذين باتوا فيكم فيسألهم ربهم وهو أعلم بكم كيف تركتم عبادي؟ فيقولون أتيناهم وهم يصلون وتركناهم وهم يصلون\" وقال عبدالله بن مسعود: يجتمع الحرسان في صلاة الفجر فيصعد هؤلاء ويقيم هؤلاء. وكذا قال إبراهيم النخعي ومجاهد وقتادة وغير واحد في تفسير هذه الآية. وأما الحديث الذي رواه ابن جرير ههنا من حديث الليث بن سعد عن زيادة عن محمد بن كعب القرظي عن فضالة بن عبيد عن أبي الدرداء عن رسول الله صلى الله عليه وسلم فذكر حديث النزول وأنه تعالى يقول: من يستغفرني أغفر له من يسألني أعطيه من يدعني فأستجيب له حتى يطلع الفجر فلذلك يقول \"وقرآن الفجر إن قرآن الفجر كان مشهودا\" فيشهده الله وملائكة الليل وملائكة النهار فإنه تفرد به زيادة وله بهذا حديث في سنن أبي داود."
    },
    {
      "ayah": 79,
      "surah": 17,
      "text": "وقوله تعالى: \"ومن الليل فتهجد به نافلة لك\" أمر له بقيام الليل بعد المكتوبة كما ورد في صحيح مسلم عن أبي هريرة عن رسول الله صلى الله عليه وسلم أنه سئل أي الصلاة أفضل بعد المكتوبة؟ قال \"صلاة الليل\" ولهذا أمر تعالى رسوله بعد المكتوبات بقيام الليل فإن التهجد ما كان بعد نوم. قاله علقمة والأسود وإبراهيم النخعي وغير واحد وهو المعروف في لغة العرب وكذلك ثبتت الأحاديث عن رسول الله صلى الله عليه وسلم أنه كان يتهجد بعد نومه عن ابن عباس وعائشة وغير واحد من الصحابة رضي الله عنهم كما هو مبسوط في موضعه ولله الحمد والمنة وقال الحسن البصرى هو ما كان بعد العشاء ويحمل على ما كان بعد النوم واختلف في معنى قوله تعالى: \"نافلة لك\" فقيل معناه أنك مخصوص بوجوب ذلك وحدك فجعلوا قيام الليل واجبا في حقه دون الأمة. رواه العوفي عن ابن عباس وهو أحد قولي العلماء وأحد قولي الشافعي رحمه الله اختاره ابن جرير وقيل إنما جعل قيام الليل في حقه نافلة على الخصوص لأنه قد غفر له ما تقدم من ذنبه وما تأخر وغيره من أمته إنما يكفر عنه صلواته النوافل الذنوب التي عليه. قال مجاهد: وهو في المسند عن أبي أمامة الباهلي رضي الله عنه. وقوله \"عسى أن يبعثك ربك مقاما محمودا\" أي افعل هذا الذي أمرتك به لنقيمك يوم القيامة مقاما محمودا يحمدك فيه الخلائق كلهم وخالقهم تبارك وتعالى. قال ابن جرير: قال أكثر أهل التأويل ذلك هو المقام الذي يقومه محمد صلى الله عليه وسلم يوم القيامة للشفاعة للناس ليريحهم ربهم من عظم ما هم فيه من شدة ذلك اليوم ذكر من قال ذلك\" حدثنا ابن بشار حدثنا عبدالرحمن حدثنا سفيان عن أبي إسحاق عن صلة بن زفر عن حذيفة قال: يجمع الناس في صعيد واحد يسمعهم الداعي وينفذهم البصر حفاة عراة كما خلقوا قياما لا تكلم نفس إلا بإذنه ينادى يا محمد فيقول \"لبيك وسعديك والخير في يديك والشر ليس إليك والمهدي من هديت وعبدك بين يديك ومنك وإليك لا منجى ولا ملجأ منك إلا إليك تباركت وتعاليت سبحانك رب البيت\" فهذا المقام المحمود الذي ذكره الله عز وجل ثم رواه عن بندار عن غندر عن شعبة عن أبي إسحاق به وكذا رواه عبدالرزاق عن معمر والثوري عن أبي إسحاق به وقال ابن عباس هذا المقام المحمود مقام الشفاعة وكذا قال ابن أبي نجيح عن مجاهد وقاله الحسن البصري وقال قتادة هو أول من تنشق عنه الأرض يوم القيامة وأول شافع وكان أهل العلم يرون أنه المقام المحمود الذي قال الله تعالى \"عسى أن يبعثك ربك مقاما محمودا\" قلت لرسول الله صلى الله عليه وسلم تشريفات يوم القيامة لا يشركه فيها أحد وتشريفات لا يساويه فيها أحد فهو أول من تنشق عنه الأرض ويبعث راكبا إلى المحشر وله اللواء الذي آدم فمن دونه لوائه وله الحوض الذي ليس في الموقف أكثر واردا منه وله الشفاعة العظمى عند الله ليأتي لفصل القضاء بين الخلائق وذلك بعد ما تسأل الناس آدم ثم نوحا ثم إبراهيم ثم موسى ثم عيسى فكل يقول لست لها حتى يأتوا إلى محمد صلى الله عليه وسلم فيقول \"أنا لها أنا لها\" كما سنذكر ذلك مفصلا في هذا الموضع إن شاء الله تعالى ومن ذلك أنه يشفع في أقوام قد أمر بهم إلى النار فيردون عنها وهو أول الأنبياء يقضي بين أمته وأولهم إجازة على الصراط بأمته وهو أول شفيع في الجنة كما ثبت في صحيح مسلم. وفي حديث الصور أن المؤمنين كلهم لا يدخلون الجنة إلا بشفاعته وهو أول داخل إليها وأمته قبل الأمم كلهم ويشفع في رفع درجات أقوام لا تبلغها أعمالهم وهو صاحب الوسيلة التي هي أعلى منزلة في الجنة لا تليق إلا له وإذا أذن الله تعالى في الشفاعة للعصاة شفع الملائكة والنبيون والمؤمنون فيشفع هو في خلائق لا يعلم عدتهم إلا الله تعالى ولا يشفع أحد مثله ولا يساويه في ذلك وقد بسطت ذلك مستقصى في آخر كتاب السيرة في باب الخصائص ولله الحمد والمنة ولنذكر الآن الأحاديث الواردة في المقام المحمود وبالله المستعان. قال البخاري حدثنا إسماعيل بن أبان حدثنا أبو الأحوص عن آدم بن علي سمعت ابن عمر يقول: إن الناس يصيرون يوم القيامة جثاء كل أمة تتبع نبيها يقولون يا فلان اشفع يا فلان اشفع حتى تنتهي الشفاعة إلى محمد صلى الله عليه وسلم فذلك يوم يبعثه الله مقاما محمودا. ورواه حمزة بن عبدالله عن أبيه عن النبي صلى الله عليه وسلم. قال ابن جرير حدثني محمد بن عبدالله بن عبدالحكم حدثنا شعيب بن الليث ثنا الليث عن عبيد الله بن أبي جعفر أنه قال: سمعت حمزة بن عبدالله بن عمر يقول سمعت عبدالله بن عمر يقول: قال رسول الله صلى الله عليه وسلم \"إن الشمس لتدنو حتى يبلغ العرق نصف الأذن فبينما هم كذلك استغاثوا بآدم فيقول لست بصاحب ذلك ثم بموسى فيقول كذلك ثم بمحمد صلى الله عليه وسلم فيشفع بين الخلق فيمشي حتى يأخذ بحلقة باب الجنة فيومئذ يبعثه الله مقاما محمودا\" وهكذا رواه البخاري في الزكاة عن يحيى بن بكير وعلقمة عن عبدالله بن صالح كلاهما عن الليث بن سعد به. وزاد فيومئذ يبعثه الله مقاما محمودا يحمده أهل الجمع كلهم. قال البخاري: وحدثنا علي بن عياش حدثنا شعيب بن أبي حمزة عن محمد بن المنكدر عن جابر بن عبدالله أن رسول الله صلى الله عليه وسلم قال: \"من قال حين يسمع النداء: اللهم رب هذه الدعوة التامة والصلاة القائمة آت محمدا الوسيلة والفضيلة وابعثه مقاما محمودا الذي وعدته. حلت له شفاعتي يوم القيامة\" انفرد به دون مسلم. \"حديث أبي بن كعب\" قال الإمام أحمد حدثنا أبو عامر الأزدي حدثنا زهير بن محمد عن عبدالله بن محمد بن عقيل عن الطفيل بن أبي بن كعب عن أبيه عن النبي صلى الله عليه وسلم قال: \"إذا كان يوم القيامة كنت إمام الأنبياء وخطيبهم وصاحب شفاعتهم غير فخر\" وأخرجه الترمذي من حديث أبي عامر عبد الملك بن عمرو العقدي وقال حسن صحيح. وابن ماجه من حديث عبدالله بن محمد بن عقيل به وقد قدمنا في حديث أبي بن كعب في قراءة القرآن على سبعة أحرف قال صلى الله عليه وسلم في آخره \" فقلت اللهم اغفر لأمتي اللهم اغفر لأمتي وأخرت الثالثة ليوم يرغب إلي فيه الخلق حتى إبراهيم عليه السلام\". \"حديث أنس بن مالك\" قال الإمام أحمد: حدثنا يحيى بن سعيد حدثنا سعيد بن أبي عروبة حدثنا قتادة عن أنس عن النبي صلى الله عليه وسلم قال \"يجتمع المؤمنون يوم القيامة فيلهمون ذلك فيقولون لو استشفعنا إلى ربنا فأراحنا من مكاننا هذا فيأتون آدم فيقولون يا آدم أنت أبو البشر خلقك الله بيده وأسجد لك ملائكته وعلمك أسماء كل شيء فاشفع لنا إلى ربك حتى يريحنا من مكاننا هذا. فيقول لهم آدم لست هناكم ويذكر ذنبه الذي أصاب فيستحيي ربه عز وجل من ذلك ويقول ولكن ائتوا نوحا فإنه أول رسول بعثه الله إلى أهل الأرض فيأتون نوحا فيقول لست هناكم ويذكر خطيئة سؤاله ربه ما ليس له به علم فيستحيي ربه من ذلك ويقول ولكن ائتوا إبراهيم خليل الرحمن فيأتونه فيقول لست هناكم ولكن ائتوا موسى عبدا كلمه الله وأعطاه التوراة فيأتون موسى فيقول لست هناكم ويذكر لهم النفس التي قتل بغير نفس فيستحيي ربه من ذلك ويقول ولكن ائتوا عيسى عبدالله ورسوله وكلمته وروحه. فيأتون عيسى فيقول لست هناكم ولكن ائتوا محمدا غفر الله له ما تقدم من ذنبه وما تأخر فيأتوني ـ قال الحسن هذا الحرف ـ فأقوم فأمشي بين سماطين من المؤمنين - قال أنس - حتى استأذن على ربي فإذا رأيت ربي وقعت له - أو خررت - ساجدا لربي فيدعني ما شاء الله أن يدعني - قال -ثم يقال ارفع محمد قل يسمع واشفع تشفع وسل تعطه فأرفع رأسي فأحمده بتحميد يعلمنيه ثم أشفع فيحد لي حدا فأدخلهم الجنة قال ثم أعود إليه الثانية فإذا رأيت ربي وقعت له - أو خررت - ساجدا لربي فيدعني ما شاء الله أن يدعني ثم يقال ارفع محمد قل يسمع وسل تعطه واشفع تشفع فأرفع رأسي فأحمده بتحميد يعلمنيه ثم أشفع فيحد لي حدا فأدخلهم الجنة قال ثم أعود الثالثة فإذا رأيت ربي وقعت - أو خررت - ساجدا لربي فيدعني ما شاء الله أن يدعني ثم يقال ارفع محمد قل يسمع وسل تعطه واشفع تشفع فأرفع رأسي فأحمده بتحميد يعلمنيه ثم أشفع فيحد لي حدا فأدخلهم الجنة ثم أعود الرابعة فأقول يا رب ما بقي إلا من حبسه القرآن\" فحدثنا أنس بن مالك أن النبي صلى الله عليه وسلم قال \"فيخرج من النار من قال لا إله إلا الله وكان في قلبه من الخير ما يزن شعيرة ثم يخرج من النار من قال لا إله إلا الله وكان في قلبه من الخير ما يزن برة ثم يخرج من النار من قال لا إله إلا الله وكان في قلبه من الخير ما يزن ذرة\" أخرجاه من حديث سعيد به وهكذا رواه الإمام أحمد عن عفان بن حماد بن سلمة عن ثابت عن أنس بطوله. وقال الإمام أحمد: حدثنا يونس بن محمد حدثنا حرب بن ميمون أبو الخطاب الأنصاري عن النضر بن أنس عن أنس قال حدثنى نبي الله صلى الله عليه وسلم قال: \"إني لقائم أنتظر أمتي تعبر الصراط إذ جاءني عيسى عليه السلام فقال هذه الأنبياء قد جاءتك يا محمد يسألون - أو قال يجتمعون إليك - ويدعون الله أن يفرق بين جميع الأمم إلى حيث يشاء الله لغم ما هم فيه فالخلق ملجمون بالعرق فأما المؤمن فهو عليه كالزكمة وأما الكافر فيغشاه الموت فقال: انتظر حتى أرجع إليك فذهب نبي الله صلى الله عليه وسلم فقام تحت العرش فلقي ما لم يلق ملك مصطفى ولا نبي مرسل فأوحى الله عز وجل إلى جبريل أن اذهب إلى محمد وقل له ارفع رأسك سل تعط واشفع تشفع فشفعت في أمتي أن أخرج من كل تسعة وتسعين إنسانا واحدا فما زلت أتردد إلى ربي عز وجل فلا أقوم منه مقاما إلا شفعت حتى أعطاني الله عز وجل من ذلك أن قال يا محمد أدخل من أمتك من خلق الله عز وجل من شهد أن لا إله إلا الله يوما واحدا مخلصا ومات على ذلك \" \"حديث بريدة رضي الله عنه\" قال الإمام أحمد بن حنبل: حدثنا الأسود بن عامر أخبرنا أبو إسرائيل عن الحارث بن حضيرة عن ابن بريدة عن أبيه أنه دخل على معاوية فإذا رجل يتكلم فقال بريدة: يا معاوية تأذن لي في الكلام؟ فقال نعم وهو يرى أنه سيتكلم بمثل ما قال الآخر فقال بريدة سمعت رسول الله صلى الله عليه وسلم يقول \"إني لأرجو أن أشفع يوم القيامة عدد ما على الأرض من شجرة ومدرة\" قال فترجوها أنت يا معاوية ولا يرجوها علي رضي الله عنه. \"حديث ابن مسعود\" قال الإمام أحمد: حدثنا عارم بن الفضل حدثنا سعيد بن الفضل حدثنا سعيد بن زيد حدثنا علي بن الحكم البناني عن عثمان عن إبراهيم عن علقمة والأسود عن ابن مسعود قال: جاء ابنا مليكة إلى النبي صلى الله عليه وسلم فقالا: إن أمنا تكرم الزوج وتعطف على الولد قال وذكر الضيف غير أنها كانت وأدت في الجاهلية فقال \"أمكما في النار\" قال فأدبرا والسوء يرى في وجهيهما فأمر بهما فردا فرجعا والسرور يرى في وجهيهما رجاء أن يكون قد حدث شيء فقال \"أمي مع أمكما\" فقال رجل من المنافقين وما يغني هذا عن أمه شيئا ونحن نطأ عقبيه. فقال رجل من الأنصار ولم أر رجلا قط أكثر سؤالا منه يا رسول الله هل وعدك ربك فيها أو فيهما. قال فظن أنه من شيء قد سمعه فقال \"ما شاء الله ربي وما أطعمني فيه وإني لأقوم المقام المحمود يوم القيامة\" فقال الأنصاري يا رسول الله وما ذاك المقام المحمود؟ قال: \"ذاك إذا جيء بكم حفاة عراة غرلا فيكون أول من يكسى إبراهيم عليه السلام فيقول اكسوا خليلي فيؤتى بريطتين بيضاوين فيلبسهما ثم يقعده مستقبل العرش ثم أوتي بكسوتي فألبسها فأقوم عن يمينه مقاما لا يقومه أحد فيغبطني فيه الأولون والآخرون\" قال: ويفتح لهم من الكوثر إلى الحوض فقال المنافق إنه ما جرى ماء قط إلا على حال أو رضراض فقال رسول الله صلى الله عليه وسلم \"حاله المسك ورضراضه اللؤلؤ\" فقال المنافق لم أسمع كاليوم فإنه قلما جرى ماء على حال أو رضراض إلا كان له نبت؟ فقال الأنصاري: يا رسول الله هل له نبت؟ فقال: \"نعم قضبان الذهب\" قال المنافق لم أسمع كاليوم فإنه قلما ينبت قضيب إلا أورق وإلا كان له ثمر قال الأنصاري يا رسول الله هل له ثمرة؟ قال: \"نعم ألوان الجوهر وماؤه أشد بياضا من اللبن وأحلى من العسل من شرب منه شربة لا يظمأ بعده ومن حرمه لم يرو بعده\" وقال أبو داود الطيالسي: حدثنا يحيى بن سلمة بن كهيل عن أبيه عن أبي الزعراء عن عبدالله قال: ثم يأذن الله عز وجل في الشفاعة فيقوم روح القدس جبريل ثم يقوم إبراهيم خليل الله ثم يقوم عيسى أو موسى قال أبو الزعراء لا أدري أيهما قال. ثم يقوم نبيكم صلى الله عليه وسلم رابعا فيشفع لا يشفع أحد بعده أكثر مما شفع وهو المقام المحمود الذي قال الله عز وجل \"عسى أن يبعثك ربك مقاما محمودا\". \"حديث كعب بن مالك رضي الله عنه\" قال الإمام أحمد: حدثنا يزيد بن عبدربه حدثنا محمد بن حرب حدثنا الزبيدي عن الزهري عن عبدالرحمن بن عبدالله بن كعب بن مالك عن كعب بن مالك أن رسول الله صلى الله عليه وسلم قال: \"يبعث الناس يوم القيامة فأكون أنا وأمتي على تل ويكسوني ربي عز وجل حلة خضراء ثم يؤذن لي فأقول ما شاء الله أن أقول فذلك المقام المحمود\" \"حديث أبي الدرداء رضي الله عنه\" قال الإمام أحمد: حدثنا حسن حدثنا ابن لهيعة حدثنا يزيد بن أبي حبيب عن عبدالرحمن بن جبير عن أبي الدرداء قال: قال رسول الله صلى الله عليه وسلم: \"أنا أول من يؤذن له بالسجود يوم القيامة وأنا أول من يؤذن له أن يرفع رأسه فأنظر إلى ما بين يدي فأعرف أمتي من بين الأمم ومن خلفي مثل ذلك وعن يميني مثل ذلك وعن شمالي مثل ذلك\" فقال رجل يا رسول الله كيف تعرف أمتك من بين الأمم فيما بين نوح إلى أمتك؟ قال \"هم غر محجلون من أثر الوضوء ليس أحد كذلك غيرهم وأعرفهم أنهم يؤتون كتبهم بأيمانهم وأعرفهم تسعى من بين أيديهم ذريتهم\". \"حديث أبي هريرة رضي الله عنه\" قال الإمام أحمد رحمه الله: حدثنا يحيى بن سعيد حدثنا أبو حيان حدثنا أبو زرعة بن عمرو بن جرير عن أبي هريرة رضي الله عنه قال: أتى رسول الله صلى الله عليه وسلم بلحم فرفع إليه الذراع وكانت تعجبه فنهش منها نهشة ثم قال \"أنا سيد الناس يوم القيامة وهل تدرون مم ذاك؟ يجمع الله الأولين والآخرين في صعيد واحد يسمعهم الداعي وينفذهم البصر وتدنو الشمس فيبلغ الناس من الغم والكرب ما لا يطيقون ولا يحتملون فيقول بعض الناس لبعض ألا ترون ما أنتم فيه مما قد بلغكم ألا تنظرون من يشفع لكم إلي ربكم؟ فيقول بعض الناس لبعض عليكم بآدم فيأتون آدم عليه السلام فيقولون: يا آدم أنت أبو البشر خلقك الله بيده ونفخ فيك من روحه وأمر الملائكة فسجدوا لك فاشفع لنا إلى ربك ألا ترى ما نحن فيه ألا ترى ما قد بلغنا؟ فيقول آدم: إن ربي قد غضب اليوم غضبا لم يغضب قبله مثله ولن يغضب بعده مثله وإنه قد نهاني عن الشجرة فعصيت نفسي نفسي نفسي اذهبوا إلى غيري اذهبوا إلى نوح فيأتون نوحا فيقولون: يا نوح أنت أول الرسل إلى أهل الأرض وقد سماك الله عبدا شكورا اشفع لنا إلى ربك ألا ترى ما نحن فيه ألا ترى ما قد بلغنا؟ فيقول نوح: إن ربي قد غضب اليوم غضبا لم يغضب قبله مثله ولن يغضب بعده مثله قط وإنه قد كانت لي دعوة دعوتها على قومي نفسي نفسي نفسي اذهبوا إلى غيري اذهبوا إلى إبراهيم. فيأتون إبراهيم فيقولون: يا إبراهيم أنت نبي الله وخليله من أهل الأرض اشفع لنا إلى ربك ألا ترى ما نحن فيه ألا ترى ما قد بلغنا؟ فيقول: إن ربي قد غضب اليوم غضبا لم يغضب قبله مثله ولن يغضب بعده مثله فذكر كذباته نفسي نفسي نفسي اذهبوا إلى غيري اذهبوا إلى موسى فيأتون موسى عليه السلام فيقولون: يا موسى أنت رسول الله اصطفاك الله برسالاته وبكلامه على الناس اشفع لنا إلى ربك ألا ترى ما نحن فيه ألا ترى ما قد بلغنا؟ فيقول لهم موسى: إن ربي قد غضب اليوم غضبا لم يغضب قبله مثله ولن يغضب بعده مثله وإني قد قتلت نفسا لم أومر بقتلها نفسي نفسي نفسي اذهبوا إلى غيري اذهبوا إلى عيسى فيأتون عيسى فيقولون: يا عيسى أنت رسول الله وكلمته ألقاها إلى مريم وروح منه وكلمت الناس في المهد صبيا فاشفع لنا إلى ربك ألا ترى ما نحن فيه ألا ترى ما قد بلغنا؟ فيقول لهم عيسى إن ربي قد غضب اليوم غضبا لم يغضب قبله مثله ولن يغضب بعده مثله ولم يذكر ذنبا نفسي نفسي نفسي اذهبوا إلى غيري اذهبوا إلى محمد صلى الله عليه وسلم فيأتون محمدا صلى الله عليه وسلم فيقولون: يا محمد أنت رسول الله وخاتم الأنبياء وقد غفر الله لك ما تقدم من ذنبك وما تأخر فاشفع لنا إلى ربك ألا ترى ما نحن فيه ألا ترى ما قد بلغنا؟ فأقوم فآتي تحت العرش فأقع ساجدا لربي عز وجل ثم يفتح الله علي ويلهمني من محامده وحسن الثناء عليه ما لم يفتح على أحد قبلي فيقال: يا محمد ارفع رأسك وسل تعطه واشفع تشفع. فأرفع رأسي فأقول أمتي يا رب أمتي يا رب أمتي يا رب؟ فيقال: يا محمد أدخل من أمتك من لا حساب عليه من الباب الأيمن من أبواب الجنة وهم شركاء الناس فيما سوى ذلك من الأبواب ثم قال والذي نفس محمد بيده إن ما بين المصراعين من مصاريع الجنة كما بين مكة وهجر أو كما بين مكة وبصرى\" أخرجاه في الصحيحين وقال مسلم رحمه الله: حدثنا الحكم بن موسى حدثنا هقل بن زياد عن الأوزاعي حدثني أبو عمار حدثني عبدالله بن فروخ حدثني أبو هريرة قال: قال رسول الله صلى الله عليه وسلم \"أنا سيد ولد آدم يوم القيامة وأول من ينشق عنه القبر يوم القيامة وأول شافع وأول مشفع\" وقال ابن جرير: حدثنا أبو كريب حدثنا وكيع عن داود بن يزيد الزعافري عن أبيه عن أبي هريرة قال: قال رسول الله صلى الله عليه وسلم: \"عسى أن يبعثك ربك مقاما محمودا\" سئل عنها فقال: هي الشفاعة\" رواه الإمام أحمد عن وكيع عن محمد بن عبيد عن داود عن أبيه عن أبي هريرة عن النبي صلى الله عليه وسلم في قوله تعالى: \"عسى أن يبعثك ربك مقاما محمودا\" قال: \"هو المقام الذي أشفع لأمتي فيه\" وقال عبدالرزاق: أخبرنا معمر عن الزهري عن علي بن الحسين قال: قال رسول الله صلى الله عليه وسلم: \"إذا كان يوم القيامة مد الله الأرض مد الأديم حتى لا يكون لبشر من الناس إلا موضع قدميه قال النبي صلى الله عليه وسلم - فأكون أول من يدعى وجبريل عن يمين الرحمن تبارك وتعالى والله ما رآه قبلها فأقول أي رب إن هذا أخبرني أنك أرسلته إلي فيقول الله عز وجل: صدق ثم أشفع فأقول يا رب عبادك عبدوك في أطراف الأرض قال فهو المقام المحمود\" وهذا حديث مرسل."
    },
    {
      "ayah": 8,
      "surah": 17,
      "text": "\"عسى ربكم أن يرحمكم\" أي فيصرفهم عنكم \"وإن عدتم عدنا\" أى متى عدتم إلى الإفساد \"عدنا\" إلى الإدالة عليكم في الدنيا مع ما ندخره لكم في الآخرة من العذاب والنكال ولهذا قال \"وجعلنا جهنم للكافرين حصيرا\" أي مستقرا ومحصرا وسجنا لا محيد لهم عنه وقال ابن عباس: حصيرا أي سجنا وقال مجاهد: يحصرون فيها وكذا قال غيره وقال الحسن فراشا ومهادا وقال قتادة قد عاد بنو إسرائيل فسلط الله عليهم هذا الحي محمدا صلى الله عليه وسلم وأصحابه يأخذون منهم الجزية عن يد وهم صاغرون."
    },
    {
      "ayah": 80,
      "surah": 17,
      "text": "قال الإمام أحمد: حدثنا جرير عن قابوس بن أبي ظبيان عن أبيه عن ابن عباس قال كان النبي صلى الله عليه وسلم بمكة ثم أمر بالهجرة فأنزل الله \"وقل رب أدخلني مدخل صدق وأخرجني مخرج صدق واجعل لي من لدنك سلطانا نصيرا\" وقال الترمذي: حسن صحيح وقال الحسن البصري في تفسير هذه الآية: إن كفار أهل مكة لما ائتمروا برسول الله صلى الله عليه وسلم ليقتلوه أو يطردوه أو يوثقوه فأراد الله قتال أهل مكة أمره أن يخرج إلى المدينة فهو الذي قال الله عز وجل \"وقل رب أدخلني مدخل صدق وأخرجني مخرج صدق\" الآية وقال قتادة \"وقل رب أدخلني مدخل صدق\" يعني المدينة \"وأخرجني مخرج صدق\" يعني مكة وكذا قال عبدالرحمن بن زيد بن أسلم وهذا القول هو أشهر الأقوال وقال العوفي عن ابن عباس: \"أدخلني مدخل صدق\" يعني الموت \"وأخرجني مخرج صدق\" يعني الحياة بعد الموت وقيل غير ذلك من الأقوال والأول أصح وهو اختيار ابن جرير. وقوله: \"واجعل لي من لدنك سلطانا نصيرا\" قال الحـسن البصري في تفسيرها: وعده ربه لينزعن ملك فارس وعز فارس وليجعلنه له وملك الروم وعز الروم وليجعلنه له وقال قتادة فيها: إن نبي الله صلى الله عليه وسلم علم أن لا طاقة له بهذا الأمر إلا بسلطان فسأل سلطانا نصيرا لكتاب الله ولحدود الله ولفرائض الله ولإقامة دين الله فإن السلطان رحمة من الله جعله بين أظهر عباده ولولا ذلك لأغار بعضهم على بعض فأكل شديدهم ضعيفهم قال مجاهد: \"سلطانا نصيرا\" حجة بينة واختار ابن جرير قول الحسن وقتادة وهو الأرجح لأنه لابد مع الحق من قهر لمن عاداه وناوأه ولهذا يقول تعالى: \"لقد أرسلنا رسلنا بالبينات - إلى قوله - وأنزلنا الحديد\" الآية. وفي الحديث \"إن الله ليزع بالسلطان ما لا يزع بالقرآن\" أي ليمنع بالسلطان عن ارتكاب الفواحش والآثام ما لا يمتنع كثير من الناس بالقرآن وما فيه من الوعيد الأكيد والتهديد الشديد وهذا هو الواقع."
    },
    {
      "ayah": 81,
      "surah": 17,
      "text": "وقوله: \"وقل جاء الحق وزهق الباطل\" الآية: تهديد ووعيد لكفار قريش فإنه قد جاءهم من الله الحق الذي لا مرية فيه ولا قبل لهم به وهو ما بعثه الله به من القرآن والإيمان والعلم النافع وزهق باطلهم أي اضمحل وهلك فإن الباطل لا ثبات له مع الحق ولا بقاء \"بل نقذف بالحق على الباطل فيدمغه فإذا هو زاهق\" وقال البخاري: حدثنا الحميدي حدثنا سفيان عن ابن أبي نجيح عن مجاهد عن أبي معمر عن عبدالله بن مسعود قال: دخل النبي صلى الله عليه وسلم مكة وحول البيت ستون وثلثمائة نصف فجعل يطعنها بعود في يده ويقول \"جاء الحق وزهق الباطل إن الباطل كان زهوقا. جاء الحق وما يبدئ الباطل وما يعيد\" وكذا رواه البخاري أيضا في غير هذا الموضع ومسلم والترمذي والنسائي كلهم من طرق عن سفيان بن عيينة به وكذا رواه عبدالرزاق عن ابن أبي نجيح به. وقال الحافظ أبو يعلى: حدثنا زهير حدثنا شبابة حدثنا المغيرة حدثنا أبو الزبير عن جابر رضي الله عنه قال: دخلنا مع رسول الله صلى الله عليه وسلم مكة وحول البيت ثلثمائة وستون صنما تعبد من دون الله. فأمر بها رسول الله صلى الله عليه وسلم فأكبت على وجوهها وقال \"جاء الحق وزهق الباطل إن الباطل كان زهوقا\"."
    },
    {
      "ayah": 82,
      "surah": 17,
      "text": "يقول تعالى مخبرا عن كتابه الذي أنزله على رسوله محمد صلى الله عليه وسلم وهو القرآن الذي لا يأتيه الباطل من بين يديه ولا من خلفه تنزيل من حكيم حميد إنه \"شفاء ورحمة للمؤمنين\" أي يذهب ما في القلوب من أمراض من شك ونفاق وشرك وزيغ وميل فالقرآن يشفي من ذلك كله وهو أيضا رحمة يحصل فيها الإيمان والحكمة وطلب الخير والرغبة فيه وليس هذا إلا لمن آمن به وصدقه واتبعه فإنه يكون شفاء في حقه ورحمة وأما الكافر الظالم نفسه بذلك فلا يزيده سماعه القرآن إلا بعدا وكفرا والآفة من الكافر لا من القرآن كقوله تعالى \"قل هو للذين آمنوا هدى وشفاء والذين لا يؤمنون في آذانهم وقر وهو عليهم عمى أولئك ينادون من مكان بعيد\" وقال تعالى \"وإذا ما أنزلت سورة فمنهم من يقول أيكم زادته هذه إيمانا فأما الذين آمنوا فزادتهم إيمانا وهم يستبشرون وأما الذين في قلوبهم مرض فزادتهم رجسا إلى رجسهم وماتوا وهم كافرون\" والآيات في ذلك كثيرة قال قتادة في قوله \"وننزل من القرآن ما هو شفاء ورحمة للمؤمنين\" إذا سمعه المؤمن انتفع به وحفظه ووعاه \"ولا يزيد الظالمين إلا خسارا\" أي لا ينتفع به ولا يحفظه ولا يعيه فإن الله جعل هذا القرآن شفاء ورحمة للمؤمنين."
    },
    {
      "ayah": 83,
      "surah": 17,
      "text": "يخبر تعالى عن نقص الإنسان من حيث هو إلا من عصمه الله تعالى في حالتي السراء والضراء فإنه إذا أنعم الله عليه بمال وعافية وفتح ورزق ونصر ونال ما يزيد أعرض عن طاعة الله وعبادته ونأى بجانبه قال مجاهد: بعد عنا قلت وهذا كقوله تعالى \"فلما كشفنا عنه ضره مر كأن لم يدعنا إلى ضر مسه\" وقوله \"فلما نجاكم إلى البر أعرضتم\" وبأنه إذا مسه الشر وهو المصائب والحوادث والنوائب \"كان يئوسا\" أي قنط أن يعود يحصل له بعد ذلك خير كقوله تعالى \"ولئن أذقنا الإنسان منا رحمة ثم نزعناها منه إنه ليئوس كفور ولئن أذقناه نعماء بعد ضراء مسته ليقولن ذهب السيئات عني إنه لفرح فخور إلا الذين صبروا وعملوا الصالحات أولئك لهم مغفرة وأجر كبير\" وقوله تعالى \"قل كل يعمل على شاكلته\" قال ابن عباس: على ناحيته. وقال مجاهد: على حدته وطبيعته. وقال قتادة: على نيته. وقال ابن زيد: دينه وكل هذه الأقوال متقاربة في المعنى. وهذه الآية والله أعلم تهديد للمشركين ووعيد لهم كقوله تعالى \"وقل للذين لا يؤمنون اعملوا على مكانتكم\" الآية."
    },
    {
      "ayah": 84,
      "surah": 17,
      "text": "ولهذا قال \"قل كل يعمل على شاكلته فربكم أعلم بمن هو أهدى سبيلا\" أي منا ومنكم وسيجزى كل عامل بعمله فإنه لا تخفي عليه خافية."
    },
    {
      "ayah": 85,
      "surah": 17,
      "text": "قال الإمام أحمد: حدثنا وكيع حدثنا الأعمش عن إبراهيم عن علقمة عن عبدالله هو ابن مسعود رضي الله عنه قال: كنت أمشي مع رسول الله صلى الله عليه وسلم في حرث في المدينة وهو متوكئ على عسيب فمر من اليهود فقال بعضهم لبعض سلوه عن الروح: وقال بعضهم لا تسألوه. قال فسألوه عن الروح فقالوا يا محمد ما الروح؟ فما زال متوكئا على العسيب قال فظننت أنه يوحى إليه فقال \"ويسئلونك عن الروح قل الروح من أمر ربي وما أوتيتم من العلم إلا قليلا\" قال: فقال بعضهم لبعض قد قلنا لكم لا تسألوه. وهكذا رواه البخاري ومسلم من حديث الأعمش به ولفظ البخاري عند تفسيره هذه الآية عن عبدالله بن مسعود رضي الله عنه قال: بينا أنا أمشي مع النبي صلى الله عليه وسلم في حرث وهو متوكئ على عسيب إذ مر اليهود فقال بعضهم لبعض سلوه عى الروح فقال ما رابكم إليه وقال بعضهم لا يستقبلنكم بشيء تكرهونه. فقالوا سلوه فسألوه عن الروح فأمسك النبي صلى الله عليه وسلم فلم يرد عليهم شيئا فعلمت أنه يوحى إليه فقمت مقامي فلما نزل الوحي قال \"ويسألونك عن الروح قل الروح من أمر ربي\" الآية وهذا السياق يقتضي فيما يظهر بادي الرأي أن هذه الآية مدنية وأنها نزلت حين سأله اليهود عن ذلك بالمدينة مع أن السورة كلها مكية. وقد يجاب عن هذا بأنه قد تكون نزلت عليه بالمدينة مرة ثانية كما نزلت عليه بمكة قبل ذلك أو أنه نزل عليه الوحي بأنه يجيبهم عما سألوه بالآية المتقدم إنزالها عليه وهي هذه الآية\" ويسئلونك عن الروح\" ومما يدل على نزول هذه الآية بمكة ما قال الإمام أحمد: حدثنا قتيبة حدثنا يحيى بن زكريا عن داود عن عكرمة عن ابن عباس قال: قالت قريش ليهود أعطونا شيئا نسأل عنه هذا الرجل فقالوا سلوه عن الروح فسألوه فنزلت \"ويسئلونك عن الروح قل الروح من أمر ربي وما أوتيتم من العلم إلا قليلا\" قالوا أوتينا علما كثيرا أوتينا التوراة ومن أوتي التوراة فقد أوتي خيرا كثيرا قال وأنزل الله \"قل لو كان البحر مدادا لكلمات ربي لنفد البحر\" الآية. وقد روى ابن جرير عن محمد بن المثنى عن عبدالأعلى عن داود عن عكرمة قال سأل أهل الكتاب رسول الله صلى الله عليه وسلم عن الروح فأنزل الله \"ويسألونك عن الروح\" الآية فقالوا تزعم أنا لم نؤت من العلم إلا قليلا وقد أوتينا التوراة وهي الحكمة \"ومن يؤت الحكمة فقد أوتي خيرا كثيرا\" قال فنزلت \"ولو أن ما في الأرض من شجرة أقلام والبحر يمده من بعده سبعة أبحر\" الآية قال ما أوتيتم من علم فنجاكم الله به من النار فهو كثير طيب وهو في علم الله قليل. وقال محمد بن إسحاق عن بعض أصحابه عن عطاء بن يسار قال: نزلت بمكة \"وما أوتيتم من العلم إلا قليلا\" فلما هاجر رسول الله صلى الله عليه وسلم إلى المدينة أتاه أحبار يهود وقالوا يا محمد ألم يبلغنا عنك أنك تقول \"وما أوتيتم من العلم إلا قليلا\" أفعنيتنا أم عنيت قومك فقال \"كلا قد عنيت\" فقالوا إنك تتلو أنا أوتينا التوراة وفيها تبيان كل شيء فقال رسول الله صلى الله عليه وسلم \"هي في علم الله قليل وقد آتاكم الله ما إن عملتم به انتفعتم\" وأنزل الله \"ولو أن ما في الأرض من شجرة أقلام والبحر يمده من بعده سبعة أبحر ما نفدت كلمات الله إن الله عزيز حكيم\". وقد اختلف المفسرون في المراد بالروح ههنا على أقوال أحدها أن المراد أرواح بني آدم. وقال العوفي عن ابن عباس في قوله \"ويسألونك عن الروح\" الآية وذلك أن اليهود قالوا للنبي صلى الله عليه وسلم أخبرنا عن الروح وكيف تعذب الروح التي في الجسد وإنما الروح من الله ولم يكن نزل عليه فيه شيء فلم يجر إليهم شيئا فأتاه جبريل فقال له \"قل الروح من أمر ربي وما أوتيتم من العلم إلا قليلا\" فأخبره النبي صلى الله عليه وسلم بذلك فقالوا من جاءك وبهذا قال جاءني به جبريل من عند الله فقالوا له والله ما قاله لك إلا عدونا فأنزل الله \"قل من كان عدوا لجبريل فإنه نزله على قلبك بإذن الله مصدقا لما بين يديه\" وقيل المراد بالروح ههنا جبريل قاله قتادة قال وكان ابن عباس يكتمه وقيل المراد به ههنا ملك عظيم بقدر المخلوقات كلها قال علي بن أبي طلحة عن ابن عباس قوله \"ويسألونك عن الروح\" يقول الروح ملك. وقال الطبراني: حدثنا محمد بن عبدالله بن عرس المصري حدثنا وهب بن روق بن هبيرة حدثنا بشر بن بكر حدثنا الأوزاعي حدثنا عطاء عن عبدالله بن عباس قال سمعت رسول الله صلى الله عليه وسلم يقول \"إن لله ملكا لو قيل له التقم السموات السبع والأرضين بلقمة واحدة لفعل تسبيحه سبحانك حيث كنت \" وهذا حديث غريب بل منكر. وقال أبو جعفر بن جرير رحمه الله: حدثني علي حدثني عبدالله حدثني أبو مروان يزيد بن سمرة صاحب قيسارية عمن حدثه عن علي بن أبي طالب رضي الله عنه أنه قال في قوله \"ويسألونك عن الروح\" قال: هو ملك من الملائكة له سبعون ألف وجه لكل وجه منها سبعون ألف لسان لكل لسان منها سبعون ألف لغة يسبح الله تعالى بتلك اللغات كلها يخلق الله من كل تسبيحة ملكا يطير مع الملائكة إلى يوم القيامة. وهذا أثر غريب عجيب والله أعلم. وقال السهيلي روي عن علي أنه قال: هو ملك له مائة ألف رأس لكل رأس مائة ألف وجه في كل وجه مائة ألف فم في كل فم مائة ألف لسان يسبح الله تعالى بلغات مختلفة. قال السهيلي: وقيل المراد بذلك طائفة من الملائكة على صور بني آدم وقيل طائفة يرون الملائكة ولا تراهم فهم للملائكة كالملائكة لبني آدم وقوله \"قل الروح من أمر ربي\" أي من شأنه ومما استأثر بعلمه دونكم ولهذا قال \"وما أوتيتم من العلم إلا قليلا\" أي وما أطلعكم من علمه إلا على القليل فإنه لا يحيط أحد بشيء من علمه إلا بما شاء تبارك وتعالى والمعنى أن علمكم في علم الله قليل وهذا الذي تسألون عنه من أمر الروح مما استأثر به تعالى ولم يطلعكم عليه كما أنه لم يطلعكم إلا على القليل من علمه تعالى وسيأتي إن شاء الله في قصة موسى والخضر أن الخضر نظر إلى عصفور وقع على حافة السفينة فنقر في البحر نقرة أي شرب منه بمنقاره فقال: يا موسى ما علمي وعلمك وعلم الخلائق في علم الله إلا كما أخذ هذا العصفور من هذا البحر أو كما قال صلوات الله وسلامه عليه ولهذا قال تعالى \"وما أوتيتم من العلم إلا قليلا\" وقال السهيلي قال بعض الناس لم يجبهم عما سألوا لأنهم سألوا على وجه التعنت وقيل أجابهم وعول السهيلي على أن المراد بقوله \"قل الروح من أمر ربي\" أي من شرعه أي فادخلوا فيه وقد علمتم ذلك لأنه لا سبيل إلى معرفة هذا من طبع ولا فلسفة وإنما ينال من جهة الشرع وفي هذا المسلك الذي طرقه وسلكه نظر والله أعلم. ثم ذكر السهيلي الخلاف بين العلماء في أن الروح هي النفس أو غيرها وقرر أنها ذات لطيفة كالهواء سارية في الجسد كسريان الماء في عروق الشجر وقرر أن الروح التي ينفخها الملك في الجنين هي النفس بشرط اتصالها بالبدن واكتسابها بسببه صفات مدح أو ذم فهي إما نفس مطمئنة أو أمارة بالسوء قال كما أن الماء هو حياة الشجر ثم يكسب بسبب اختلاطه معها اسما خاصا فإذا اتصل بالعنبة وعصر منها صار ماء مصطارا أو خمرا ولا يقال له ماء حينئذ إلا على سبيل المجاز وكذا لا يقال للنفس روح إلا على هذا النحو وكذا لا يقال للروح نفس إلا باعتبار ما تؤول إليه فحاصل ما نقول إن الروح هي أصل النفس ومادتها والنفس مركبة منها ومن اتصالها بالبدن فهي هي من وجه لا من كل وجه وهذا معنى حسن والله أعلم. قلت: وقد تكلم الناس في ماهية الروح وأحكامها وصنفوا في ذلك كتبا ومن أحسن من تكلم على ذلك الحافظ ابن منده في كتاب سمعناه في الروح."
    },
    {
      "ayah": 86,
      "surah": 17,
      "text": "يذكر تعالى نعمته وفضله العظيم على عبده ورسوله الكريم صلى الله عليه وسلم فيما أوحاه إليه من القرآن المجيد الذي لا يأتيه الباطل من بين يديه ولا من خلفه تنزيل من حكيم حميد. قال ابن مسعود رضي الله عنه يطرق الناس ريح حمراء يعني في آخر الزمان من قبل الشام فلا يبقى في مصحف رجل ولا في قلبه آية ثم قرأ ابن مسعود \"ولئن شئنا لنذهبن بالذي أوحينا إليك\" الآية."
    },
    {
      "ayah": 87,
      "surah": 17,
      "text": "يذكر تعالى نعمته وفضله العظيم على عبده ورسوله الكريم صلى الله عليه وسلم فيما أوحاه إليه من القرآن المجيد الذي لا يأتيه الباطل من بين يديه ولا من خلفه تنزيل من حكيم حميد."
    },
    {
      "ayah": 88,
      "surah": 17,
      "text": "ثم نبه تعالى على شرف هذا القرآن العظيم فأخبر أنه لو اجتمعت الإنس والجن كلهم واتفقوا على أن يأتوا بمثل ما أنزله على رسوله لما أطاقوا ذلك ولما استطاعوه ولو تعاونوا وتساعدوا وتظافروا فإن هذا أمر لا يستطاع وكيف يشبه كلام المخلوقين كلام الخالق الذي لا نظير له ولا مثال له ولا عديل له وقد روى محمد بن إسحاق عن محمد بن أبي محمد عن سعيد بن جبير أو عكرمة عن ابن عباس أن هذه الآية نزلت في نفر من اليهود جاءوا رسول الله صلى الله عليه وسلم فقالوا له إنا نأتيك بمثل ما جئتنا به فأنزل الله هذه الآية. وفي هذا نظر لأن هذه السورة مكية وسياقها كله مع قريش واليهود إنما اجتمعوا به في المدينة فالله أعلم."
    },
    {
      "ayah": 89,
      "surah": 17,
      "text": "وقوله \"ولقد صرفنا للناس\" الآية أي بينا لهم الحجج والبراهين القاطعة ووضحنا لهم الحق وشرحناه وبسطناه ومع هذا \"فأبى أكثر الناس إلا كفورا\" أي جحودا للحق وردا للصواب."
    },
    {
      "ayah": 9,
      "surah": 17,
      "text": "يمدح تعالى كتابه العزيز الذي أنزله على رسوله محمد صلى الله عليه وسلم وهو القرآن بأنه يهدي لأقوم الطرق وأوضح السبل ويبشر المؤمنين به الذين يعملون الصالحات على مقتضاه. \"أن لهم أجرا كبيرا\" أي يوم القيامة."
    },
    {
      "ayah": 90,
      "surah": 17,
      "text": "قال ابن جرير: حدثنا أبو كريب حدثنا يونس بن بكير حدثنا محمد بن إسحاق حدثني شيخ من أهل مصر قدم منذ بضع وأربعين سنة عن عكرمة عن ابن عباس أن عتبة وشيبة ابني ربيعة وأبا سفيان بن حرب ورجلا من بني عبد الدار وأبا البختري أخا بني أسد والأسود بن المطلب بن أسد وزمعة بن الأسود والوليد بن المغيرة وأبا جهل بن هشام وعبدالله بن علي وأمية بن خلف والعاص بن وائل ونبيها ومنبها ابني الحجاج السهميين اجتمعوا أو من اجتمع منهم بعد غروب الشمس عند ظهر الكعبة فقال بعضهم لبعض: ابعثوا إلى محمد فكلموه وخاصموه حتى تعذروا فيه فبعثوا إليه أن أشراف قومك قد اجتمعوا لك ليكلموك فجاءهم رسول الله صلى الله عليه وسلم سريعا وهو يظن أنه قد بدا لهم في أمره بداء وكان عليهم حريصا يحب رشدهم ويعز عليه عنتهم حتى جلس إليهم فقالوا يا محمد: إنا قد بعثنا إليك لنعذر فيك وإنا والله ما نعلم رجلا من العرب أدخل على قومه ما أدخلت على قومك لقد شتمت الآباء وعبت الدين وسفهت الأحلام وشتمت الآلهة وفرقت الجماعة فما بقي من قبيح إلا وقد جئته فيما بيننا وبينك فإن كنت إنما جئت بهذا الحديث تطلب به مالا جمعنا لك من أموالنا حتى تكون أكثرنا مالا وإن كنت إنما تطلب الشرف فينا سودناك علينا وإن كنت تريد ملكا ملكناك علينا وإن كان هذا الذي يأتيك بما يأتيك رئيا تراه قد غلب عليك - وكانوا يسمون التابع من الجن الرئي ـ فربما كان ذلك بذلنا أموالنا في طلب الطب حتى نبرئك منه أو نعذر فيك. فقال رسول الله صلى الله عليه وسلم \"ما بي ما تقولون ما جئتكم بما جئتكم به أطلب أموالكم ولا الشرف فيكم ولا الملك عليكم ولكن الله بعثني إليكم رسولا وأنزل علي كتابا وأمرني أن أكون لكم بشيرا ونذيرا فبلغتكم رسالات ربي ونصحت لكم فإن تقبلوا مني ما جئتكم به فهو حظكم في الدنيا والآخرة وإن تردوه علي أصبر لأمر الله حتي يحكم الله بيني وبينكم\" أو كما قال رسول الله صلى الله عليه وسلم تسليما فقالوا يا محمد فإن كنت غير قابل منا ما عرضنا عليك فقد علمت أنه ليس أحد من الناس أضيق منا بلادا ولا أقل مالا ولا أشد عيشا منا فاسأل لنا ربك الذي بعثك بما بعثك به فليسير عنا هذه الجبال التي قد ضيقت علينا وليبسط لنا بلادنا وليفجر فيها أنهارا كأنهار الشام والعراق وليبعث لنا من مضى من آبائنا وليكن فيمن يبعث لنا منهم قصي بن كلاب فإنه كان شيخا صدوقا فنسألهم عما تقول فقال حق هو أم باطل؟ فإن صنعت ما سألناك وصدقوك صدقناك وعرفنا به منزلتك عند الله وأنه بعثك رسولا كما تقول. فقال لهم رسول الله صلى الله عليه وسلم \"ما بهذا بعثت إنما جئتكم من عند الله بما بعثني فقد بلغتكم ما أرسلت به إليكم فإن تقبلوه فهو حظكم في الدنيا والآخرة وإن تردوه علي أصبر لأمر الله حتي يحكم الله بيني وبينكم\" قالوا فإن لم تفعل لنا هذا فخذ لنفسك فسل ربك أن يبعث ملكا يصدقك بما تقول ويراجعنا عنك وتسأله فيجعل لك جنات وكنوزا وقصورا من ذهب وفضة ويغنيك بها عما نراك تبتغي فإنك تقوم بالأسواق وتلتمس المعاش كما نلتمسه حتى نعرف فضل منزلتك من ربك إن كنت رسولا كما تزعم. فقال لهم رسول الله صلى الله عليه وسلم \"ما أنا بفاعل ما أنا بالذي يسأل ربه هذا وما بعثت إليكم بهذا ولكن الله بعثني بشيرا ونذيرا فإن تقبلوا ما جئتكم به فهو حظكم في الدنيا والآخرة وإن تردوه علي أصبر لأمر الله حتي يحكم الله بيني وبينكم\" قالوا فأسقط السماء كما زعمت أن ربك إن شاء فعل ذلك فإنا لن نؤمن لك إلا أن تفعل. فقال لهم رسول الله صلى الله عليه وسلم: \"ذلك إلى الله إن شاء فعل بكم ذلك\" فقالوا يا محمد أما علم ربك أنا سنجلس معك ونسألك عما سألناك عنه ونطلب منك ما نطلب فيقدم إليك ويعلمك ما تراجعنا به ويخبرك ما هو صانع في ذلك بنا إذا لم نقبل منك ما جئتنا به فقد بلغنا أنه إنما يعلمك هذا رجل باليمامة يقال له الرحمن وإنا والله لا نؤمن بالرحمن أبدا فقد أعذرنا إليك يا محمد أما والله لانتركك وما فعلت بنا حتى نهلكك أو تهلكنا وقال قائلهم نحن نعبد الملائكة وهي بنات الله وقال قائلهم لن نؤمن لك حتى تأتي بالله والملائكة قبيلا. فلما قالوا ذلك قام رسول الله صلى الله عليه وسلم عنهم وقام معه عبدالله بن أبي أمية بن المغيرة بن عبدالله بن عمر ابن مخزوم وهو ابن عمته عاتكة ابنة عبدالمطلب فقال: يا محمد عرض عليك قومك ما عرضوا فلم تقبله منهم ثم سألوك لأنفسهم أمورا ليعرفوا بها منزلتك من الله فلم تفعل ذلك ثم سألوك أن تعجل ما تخوفهم به من العذاب فوالله لا أومن بك أبدا حتى تتخذ إلى السماء سلما ثم ترقى وأنا أنظر حتى تأتيها وتأتي معك بصحيفة منشورة ومعك أربعة من الملائكة يشهدون لك أنك كما تقول وايم الله لو فعلت ذلك لظننت أني لا أصدقك ثم انصرف عن رسول الله صلى الله عليه وسلم وانصرف رسول الله صلى الله عليه وسلم إلى أهله حزينا أسفا لما فاته مما كان طمع فيه من قومه حين دعوه ولما رأى من مباعدتهم إياه وهكذا رواه زياد بن عبدالله البكائي عن ابن إسحاق حدثني بعض أهل العلم عن سعيد بن جبير وعكرمة عن ابن عباس فذكر مثله سواء. وهذا المجلس الذي اجتمع هؤلاء له لو علم الله منهم أنهم يسألون ذلك استرشادا لأجيبوا إليه ولكن علم أنهم إنما يطلبون ذلك كفرا وعنادا فقيل لرسول الله صلى الله عليه وسلم: إن شئت أعطيناهم ما سألوا فإن كفروا عذبتهم عذابا لا أعذبه أحدا من العالمين وإن شئت فتحت عليهم باب التوبة والرحمة. فقال \"بل تفتح عليهم باب التوبة والرحمة\" كما تقدم ذلك في حديثي ابن عباس والزبير بن العوام أيضا عند قوله تعالى \"وما منعنا أن نرسل بالآيات إلا أن كذب بها الأولون وآتينا ثمود الناقة مبصرة فظلموا بها وما نرسل بالآيات إلا تخويفا\". وقال تعالى \"وقالوا ما لهذا الرسول يأكل الطعام ويمشي في الأسواق لولا أنزل إليه ملك فيكون معه نذيرا أو يلقى إليه كنز أو تكون له جنة يأكل منها وقال الظالمون إن تتبعون إلا رجلا مسحورا انظر كيف ضربوا لك الأمثال فضلوا فلا يستطيعون سبيلا تبارك الذي إن شاء جعل لك خيرا من ذلك جنات تجري من تحتها الأنهار ويجعل لك قصورا بل كذبوا بالساعة وأعتدنا لمن كذب بالساعة سعيرا\" وقوله تعالي \"حتى تفجر لنا من الأرض ينبوعا\" الينبوع: العين الجارية سألوه أن يجري لهم عينا معينا في أرض الحجاز ههنا وههنا وذلك سهل على الله تعالى يسير لو شاء لفعله ولأجابهم إلى جميع ما سألوا وطلبوا ولكن علم أنهم لا يهتدون كما قال تعالى \"إن الذين حقت عليهم كلمة ربك لا يؤمنون ولو جاءتهم كل آية حتى يروا العذاب الأليم\" وقال تعالى \"ولو أننا نزلنا إليهم الملائكة وكلمهم الموتى وحشرنا عليهم كل شيء قبلا وما كانوا ليؤمنوا\" الآية."
    },
    {
      "ayah": 91,
      "surah": 17,
      "text": "قال ابن جرير: حدثنا أبو كريب حدثنا يونس بن بكير حدثنا محمد بن إسحاق حدثني شيخ من أهل مصر قدم منذ بضع وأربعين سنة عن عكرمة عن ابن عباس أن عتبة وشيبة ابني ربيعة وأبا سفيان بن حرب ورجلا من بني عبد الدار وأبا البختري أخا بني أسد والأسود بن المطلب بن أسد وزمعة بن الأسود والوليد بن المغيرة وأبا جهل بن هشام وعبدالله بن علي وأمية بن خلف والعاص بن وائل ونبيها ومنبها ابني الحجاج السهميين اجتمعوا أو من اجتمع منهم بعد غروب الشمس عند ظهر الكعبة فقال بعضهم لبعض: ابعثوا إلى محمد فكلموه وخاصموه حتى تعذروا فيه فبعثوا إليه أن أشراف قومك قد اجتمعوا لك ليكلموك فجاءهم رسول الله صلى الله عليه وسلم سريعا وهو يظن أنه قد بدا لهم في أمره بداء وكان عليهم حريصا يحب رشدهم ويعز عليه عنتهم حتى جلس إليهم فقالوا يا محمد: إنا قد بعثنا إليك لنعذر فيك وإنا والله ما نعلم رجلا من العرب أدخل على قومه ما أدخلت على قومك لقد شتمت الآباء وعبت الدين وسفهت الأحلام وشتمت الآلهة وفرقت الجماعة فما بقي من قبيح إلا وقد جئته فيما بيننا وبينك فإن كنت إنما جئت بهذا الحديث تطلب به مالا جمعنا لك من أموالنا حتى تكون أكثرنا مالا وإن كنت إنما تطلب الشرف فينا سودناك علينا وإن كنت تريد ملكا ملكناك علينا وإن كان هذا الذي يأتيك بما يأتيك رئيا تراه قد غلب عليك - وكانوا يسمون التابع من الجن الرئي ـ فربما كان ذلك بذلنا أموالنا في طلب الطب حتى نبرئك منه أو نعذر فيك. فقال رسول الله صلى الله عليه وسلم \"ما بي ما تقولون ما جئتكم بما جئتكم به أطلب أموالكم ولا الشرف فيكم ولا الملك عليكم ولكن الله بعثني إليكم رسولا وأنزل علي كتابا وأمرني أن أكون لكم بشيرا ونذيرا فبلغتكم رسالات ربي ونصحت لكم فإن تقبلوا مني ما جئتكم به فهو حظكم في الدنيا والآخرة وإن تردوه علي أصبر لأمر الله حتي يحكم الله بيني وبينكم\" أو كما قال رسول الله صلى الله عليه وسلم تسليما فقالوا يا محمد فإن كنت غير قابل منا ما عرضنا عليك فقد علمت أنه ليس أحد من الناس أضيق منا بلادا ولا أقل مالا ولا أشد عيشا منا فاسأل لنا ربك الذي بعثك بما بعثك به فليسير عنا هذه الجبال التي قد ضيقت علينا وليبسط لنا بلادنا وليفجر فيها أنهارا كأنهار الشام والعراق وليبعث لنا من مضى من آبائنا وليكن فيمن يبعث لنا منهم قصي بن كلاب فإنه كان شيخا صدوقا فنسألهم عما تقول فقال حق هو أم باطل؟ فإن صنعت ما سألناك وصدقوك صدقناك وعرفنا به منزلتك عند الله وأنه بعثك رسولا كما تقول. فقال لهم رسول الله صلى الله عليه وسلم \"ما بهذا بعثت إنما جئتكم من عند الله بما بعثني فقد بلغتكم ما أرسلت به إليكم فإن تقبلوه فهو حظكم في الدنيا والآخرة وإن تردوه علي أصبر لأمر الله حتي يحكم الله بيني وبينكم\" قالوا فإن لم تفعل لنا هذا فخذ لنفسك فسل ربك أن يبعث ملكا يصدقك بما تقول ويراجعنا عنك وتسأله فيجعل لك جنات وكنوزا وقصورا من ذهب وفضة ويغنيك بها عما نراك تبتغي فإنك تقوم بالأسواق وتلتمس المعاش كما نلتمسه حتى نعرف فضل منزلتك من ربك إن كنت رسولا كما تزعم. فقال لهم رسول الله صلى الله عليه وسلم \"ما أنا بفاعل ما أنا بالذي يسأل ربه هذا وما بعثت إليكم بهذا ولكن الله بعثني بشيرا ونذيرا فإن تقبلوا ما جئتكم به فهو حظكم في الدنيا والآخرة وإن تردوه علي أصبر لأمر الله حتي يحكم الله بيني وبينكم\" قالوا فأسقط السماء كما زعمت أن ربك إن شاء فعل ذلك فإنا لن نؤمن لك إلا أن تفعل. فقال لهم رسول الله صلى الله عليه وسلم: \"ذلك إلى الله إن شاء فعل بكم ذلك\" فقالوا يا محمد أما علم ربك أنا سنجلس معك ونسألك عما سألناك عنه ونطلب منك ما نطلب فيقدم إليك ويعلمك ما تراجعنا به ويخبرك ما هو صانع في ذلك بنا إذا لم نقبل منك ما جئتنا به فقد بلغنا أنه إنما يعلمك هذا رجل باليمامة يقال له الرحمن وإنا والله لا نؤمن بالرحمن أبدا فقد أعذرنا إليك يا محمد أما والله لانتركك وما فعلت بنا حتى نهلكك أو تهلكنا وقال قائلهم نحن نعبد الملائكة وهي بنات الله وقال قائلهم لن نؤمن لك حتى تأتي بالله والملائكة قبيلا. فلما قالوا ذلك قام رسول الله صلى الله عليه وسلم عنهم وقام معه عبدالله بن أبي أمية بن المغيرة بن عبدالله بن عمر ابن مخزوم وهو ابن عمته عاتكة ابنة عبدالمطلب فقال: يا محمد عرض عليك قومك ما عرضوا فلم تقبله منهم ثم سألوك لأنفسهم أمورا ليعرفوا بها منزلتك من الله فلم تفعل ذلك ثم سألوك أن تعجل ما تخوفهم به من العذاب فوالله لا أومن بك أبدا حتى تتخذ إلى السماء سلما ثم ترقى وأنا أنظر حتى تأتيها وتأتي معك بصحيفة منشورة ومعك أربعة من الملائكة يشهدون لك أنك كما تقول وايم الله لو فعلت ذلك لظننت أني لا أصدقك ثم انصرف عن رسول الله صلى الله عليه وسلم وانصرف رسول الله صلى الله عليه وسلم إلى أهله حزينا أسفا لما فاته مما كان طمع فيه من قومه حين دعوه ولما رأى من مباعدتهم إياه وهكذا رواه زياد بن عبدالله البكائي عن ابن إسحاق حدثني بعض أهل العلم عن سعيد بن جبير وعكرمة عن ابن عباس فذكر مثله سواء. وهذا المجلس الذي اجتمع هؤلاء له لو علم الله منهم أنهم يسألون ذلك استرشادا لأجيبوا إليه ولكن علم أنهم إنما يطلبون ذلك كفرا وعنادا فقيل لرسول الله صلى الله عليه وسلم: إن شئت أعطيناهم ما سألوا فإن كفروا عذبتهم عذابا لا أعذبه أحدا من العالمين وإن شئت فتحت عليهم باب التوبة والرحمة. فقال \"بل تفتح عليهم باب التوبة والرحمة\" كما تقدم ذلك في حديثي ابن عباس والزبير بن العوام أيضا عند قوله تعالي \"وما منعنا أن نرسل بالآيات إلا أن كذب بها الأولون وآتينا ثمود الناقة مبصرة فظلموا بها وما نرسل بالآيات إلا تخويفا\". وقال تعالى \"وقالوا ما لهذا الرسول يأكل الطعام ويمشي في الأسواق لولا أنزل إليه ملك فيكون معه نذيرا أو يلقى إليه كنز أو تكون له جنة يأكل منها وقال الظالمون إن تتبعون إلا رجلا مسحورا انظر كيف ضربوا لك الأمثال فضلوا فلا يستطيعون سبيلا تبارك الذي إن شاء جعل لك خيرا من ذلك جنات تجري من تحتها الأنهار ويجعل لك قصورا بل كذبوا بالساعة وأعتدنا لمن كذب بالساعة سعيرا\" وقوله تعالي \"حتى تفجر لنا من الأرض ينبوعا\" الينبوع: العين الجارية سألوه أن يجري لهم عينا معينا في أرض الحجاز ههنا وههنا وذلك سهل على الله تعالى يسير لو شاء لفعله ولأجابهم إلى جميع ما سألوا وطلبوا ولكن علم أنهم لا يهتدون كما قال تعالى \"إن الذين حقت عليهم كلمة ربك لا يؤمنون ولو جاءتهم كل آية حتى يروا العذاب الأليم\" وقال تعالى \"ولو أننا نزلنا إليهم الملائكة وكلمهم الموتى وحشرنا عليهم كل شيء قبلا وما كانوا ليؤمنوا\" الآية."
    },
    {
      "ayah": 92,
      "surah": 17,
      "text": "أي أنك وعدتنا أن يوم القيامة تنشق فيه السماء وتهي وتدلي أطرافها فجعل ذلك في الدنيا وأسقطها كسفا أي قطعا كقولهم\"اللهم إن كان هذا هو الحق من عندك فأمطر علينا حجارة من السماء\" الآية وكذلك سأل قوم شعيب منه فقالوا \"أسقط علينا كسفا من السماء إن كنت من الصادقين\" فعاقبهم الله بعذاب يوم الظلة إنه كان عذاب يوم عظيم وأما نبي الرحمة ونبي التوبة المبعوث رحمة للعالمين فسأل إنظارهم وتأجيلهم لعل الله أن يخرج من أصلابهم من يعبده لا يشرك به شيئا وكذلك وقع فإن من هؤلاء الذين ذكروا من أسلم بعد ذلك وحسن إسلامه حتى عبدالله بن أبي أمية الذي تبع النبي صلى الله عليه وسلم وقال له ما قال أسلم إسلاما تاما وأناب إلى عز وجل."
    },
    {
      "ayah": 93,
      "surah": 17,
      "text": "وقوله تعالى \"أو يكون لك بيت من زخرف\" قال ابن عباس ومجاهد وقتادة هو الذهب وكذلك هو في قراءة ابن مسعود أو يكون لك بيت من ذهب \"أو ترقى في السماء\" أي تصعد في سلم ونحن ننظر إليك \"ولن نؤمن لرقيك حتى تنزل علينا كتابا نقرؤه\" قال مجاهد أي مكتوب فيه إلى كل واحد واحد صحيفة هذا كتاب من الله لفلان بن فلان تصبح موضوعة عند رأسه وقوله تعالى \"قل سبحان ربي هل كنت إلا بشرا رسولا\" أي سبحانه وتعالي وتقدس أن يتقدم أحد بين يديه في أمر من أمور سلطانه وملكوته بل هو الفعال لما يشاء إن شاء أجابكم إلى ما سألتم وإن شاء لم يجبكم وما أنا إلا رسول إليكم أبلغكم رسالات ربي وأنصح لكم وقد فعلت ذاك وأمركم فيما سألتم إلى الله عز وجل. قال الإمام أحمد بن حنبل: حدثنا علي بن إسحاق حدثنا ابن المبارك حدثنا يحيى بن أيوب عن عبيد الله بن زجر عن علي بن يزيد عن القاسم عن أبي أمامة عن النبي صلى الله عليه وسلم قال \"عرض علي ربي عز وجل ليجعل إلي بطحاء مكة ذهبا فقلت لا يا رب ولكن أشبع يوما وأجوع يوما ـ أو نحو ذلك ـ فإذا جعت تضرعت إليك وذكرتك وإذا شبعت حمدتك وشكرتك\" ورواه الترمذي في الزهد عن سويد بن نصر عن ابن المبارك به وقال هذا حديث حسن وعلي بن يزيد يضعف في الحديث."
    },
    {
      "ayah": 94,
      "surah": 17,
      "text": "يقول تعالى \"وما منع الناس\" أي أكثرهم \"أن يؤمنوا\" ويتابعوا الرسل إلا استعجابهم من بعثه البشر رسلا كما قال تعالى \"أكان للناس عجبا أن أوحينا إلى رجل منهم أن أنذر الناس وبشر الذين آمنوا أن لهم قدم صدق عند ربهم\" وقال تعالى \"ذلك بأنه كانت تأتيهم رسلهم بالبينات فقالوا أبشر يهدوننا\" الآية وقال فرعون وملأه \"أنؤمن لبشرين مثلنا وقومهما لنا عابدون\" وكذلك قالت الأمم لرسلهم \"إن أنتم إلا بشر مثلنا تريدون أن تصدونا عما كان يعبد آباؤنا فائتونا بسلطان مبين\" والآيات في هذا كثيرة ثم قال تعالى منبها على لطفه ورحمته بعباده أنه يبعث إليهم الرسول من جنسهم ليفقهوا عنه ويفهموا منه لتمكنهم من مخاطبته ومكالمته ولو بعث إلى البشر رسولا من الملائكة لما استطاعوا مواجهته ولا الأخذ عنه كما قال تعالى \"لقد من الله على المؤمنين إذ بعث فيهم رسولا من أنفسهم\" وقال تعالى \"لقد جاءكم رسول من أنفسكم\" وقال تعالى \"كما أرسلنا فيكم رسولا منكم يتلو عليكم آياتنا ويزكيكم ويعلمكم الكتاب والحكمة ويعلمكم ما لم تكونوا تعلمون فاذكروني أذكركم وأشكروا لي ولا تكفرون\"."
    },
    {
      "ayah": 95,
      "surah": 17,
      "text": "ولهذا قال ههنا \"قل لو كان في الأرض ملائكة يمشون مطمئنين\" أي كما أنتم فيها \"لنزلنا عليهم من السماء ملكا رسولا\" أي من جنسهم ولما كنتم أنتم بشرا بعثنا فيكم رسلنا منكم لطفا ورحمة."
    },
    {
      "ayah": 96,
      "surah": 17,
      "text": "يقول تعالى مرشدا نبيه صلى الله عليه وسلم إلى الحجة على قومه في صدق ما جاءهم به إنه شاهد علي وعليكم عالم بما جئتكم به فلو كنت كاذبا عليه لانتقم مني أشد الانتقام كما قال تعالى \"ولو تقول علينا بعض الأقاويل لأخذنا منه باليمين ثم لقطعنا منه الوتين\" وقوله \"إنه كان بعباده خبيرا بصيرا\" أي عليما بهم بمن يستحق الإنعام والإحسان والهداية ممن يستحق الشقاء والإضلال والإزاغة ولهذا قال:."
    },
    {
      "ayah": 97,
      "surah": 17,
      "text": "يقول تعالى مخبرا عن تصرفه في خلقه ونفوذ حكمه وأنه لا معقب له بأنه من يهده فلا مضل له ومن يضلل فلن تجد لهم أولياء من دونه أي يهدونهم كما قال \"من يهد الله فهو المهتد ومن يضلل فلن تجد له وليا مرشدا\" وقوله: \"ونحشرهم يوم القيامة على وجوههم\" قال الإمام أحمد: حدثنا ابن نمير حدثنا إسماعيل عن نفيع قال سمعت أنس بن مالك يقول: قيل يا رسول الله كيف يحشر الناس على وجوههم؟ قال \"الذي أمشاهم على أرجلهم قادر على أن يمشيهم على وجوههم\" وأخرجاه في الصحيحين وقال الإمام أحمد أيضا: حدثنا الوليد ابن جميع القرشي عن أبيه عن أبي الطفيل عامر بن واثلة عن حذيفة بن أسيد قال: قام أبو ذر فقال يا بني غفار قولوا ولا تحلفوا فإن الصادق المصدوق حدثني أن الناس يحشرون على ثلاثة أفواج فوج راكبين طاعمين كاسين وفوج يمشون ويسعون وفوج تسحبهم الملائكة على وجوههم وتحشرهم إلى النار فقال قائل منهم هذان قد عرفناهما فما بال الذين يمشون ويسعون؟ قال \"يلقي الله عز وجل الآفة على الظهر حتى لا يبقى ظهر حتى إن الرجل لتكون له الحديقة المعجبة فيعطيها بالشارف ذات القتب فلا يقدر عليها\" وقوله \"عميا\" أي لا يبصرون \"وبكما\" يعني لا ينطقون \"وصما\" لا يسمعون وهذا يكون في حال دون حال جزاء لهم كما كانوا في الدنيا بكما وعميا وصما عن الحق فجوزوا في محشرهم بذلك أحوج ما يحتاجون إليه \"مأواهم\" أي منقلبهم ومصيرهم \"جهنم كلما خبت\" قال ابن عباس سكنت وقال مجاهد طفئت \"زدناهم سعيرا\" أي لهبا ووهجا وجمرا كما قال \"فذوقوا فلن نزيدكم إلا عذابا\"."
    },
    {
      "ayah": 98,
      "surah": 17,
      "text": "يقول تعالى هذا الذي جازيناهم به من البعث على العمى والبكم والصمم جزاؤهم الذي يستحقونه لأنهم كذبوا \"بآياتنا\" أي بأدلتنا وحجتنا واستبعدوا وقوع البعث \"وقالوا أئذا كنا عظاما ورفاتا\" أي بالية نخرة \"أئنا لبمعوثون خلقا جديدا\" أي بعدما صرنا إلى ما صرنا إليه من البلى والهلاك والتفرق والذهاب في الأرض نعاد مرة ثانية؟ فاحتج تعالى عليهم ونبههم على قدرته على ذلك بأنه خلق السموات والأرض فقدرته على إعادتهم أسهل من ذلك كما قال \"لخلق السموات والأرض أكبر من خلق الناس\" وقال \"أو لم يروا أن الله الذي خلق السموات والأرض ولم يعي بخلقهن بقادر على أن يحيي الموتى\"الآيةوقال\"أو ليس الذي خلق السموات والأرض بقادر على أن يخلق مثلهم بلى وهو الخلاق العليم إنما أمره إذا أراد شيئا أن يقول له كن فيكون\"إلى آخر السورة لما أثبت تعالى لنفسه الكريمة الأسماء الحسنى نزه نفسه عن النقائص فقال \"وقل الحمد لله الذي لم يتخذ ولدا ولم يكن له شريك في الملك\" بل هو الله الأحد الصمد الذي لم يلد ولم يولد ولم يكن له كفوا أحد."
    },
    {
      "ayah": 99,
      "surah": 17,
      "text": "وقال ههنا \"أو لم يروا أن الله الذي خلق السموات والأرض قادر على أن يخلق مثلهم\" أي يوم القيامة يعيد أبدانهم وينشئهم نشأة أخرى كما بدأهم وقوله \"وجعل لهم أجلا لا ريب فيه\" أي جعل لإعادتهم وإقامتهم من قبورهم أجلا مضروبا ومدة مقدرة لابد من انقضائها كما قال تعالى \"وما نؤخره إلا لأجل معدود\" وقوله \"فأبى الظالمون\" أي بعد قيام الحجة عليهم \"إلا كفورا\" إلا تماديا في باطلهم وضلالهم."
    }
  ]
}
