{
  "ayahs": [
    {
      "ayah": 1,
      "surah": 18,
      "text": "سورة الكهف ذكر ما ورد في فضلها والعشر الآيات من أولها وآخرها وأنها عصمة من الدجال \"قال الإمام أحمد: حدثنا محمد بن جعفر حدثنا شعبة عن أبي إسحاق قال سمعت البراء يقول: قرأ رجل الكهف وفي الدار دابة فجعلت تنفر فنظر فإذا ضبابة أو سحابة قد غشيته فذكر ذلك للنبي صلى الله عليه وسلم فقال \" اقرأ فلان فإنها السكينة تنزل عند القرآن أو تنزلت للقرآن \" أخرجاه في الصحيحين من حديث شعبة به وهذا الرجل الذي كان يتلوها هو أسيد بن الحضير كما تقدم في تفسير سورة البقرة.وقال الإمام أحمد: حدثنا يزيد أخبرنا همام بن يحيى عن قتادة عن سالم بن أبي الجعد عن معدان بن أبي طلحة عن أبي الدرداء عن النبي صلى الله عليه وسلم قال \" من حفظ عشر آيات من أول سورة الكهف. عصم من الدجال \" رواه مسلم وأبو داود والنسائي والترمذي من حديث قتادة به ولفظ الترمذي \" من حفظ ثلاث آيات من أول الكهف \" وقال حسن صحيح \"طريق أخرى \"قال الإمام أحمد: حدثنا حجـاج حدثنا شعبة عن قتادة سمعت سالم بن أبي الجعد يحدث عن معدان عن أبي الدرداء عن النبي صلى الله عليه وسلم قال \" من قرأ العشر الأواخر من سورة الكهف عصم من فتنة الدجال \" ورواه مسلم أيضًا والنسائي من حديث قتادة به وفي لفظ النسائي \" من قرأ عشر آيات من الكهف \" فذكره \" حديث آخر\" وقد رواه النسائي في اليوم والليلة عن محمد بن عبد الأعلى عن خالد عن شعبة عن قتادة عن سالم بن أبي الجعد عن ثوبان عن رسول الله صلى الله عليه وسلم أنه قال \" من قرأ العشر الأواخر من سورة الكهف فإنه عصمة له من الدجال \" فيحتمل أن سالمًا سمعه من ثوبان ومن أبي الدرداء وقال أحمد: حـدثنا حسين حدثنا ابن لهيعة حدثنا زبان بن فايد عن سهل بن معاذ بن أنس الجهني عن أبيه عن رسول الله صلى الله عليه وسلم أنه قال \" من قرأ أول سورة الكهف وآخرها كانت له نورا من قدمه إلى رأسه ومن قرأها كلها كانت له نورًا ما بين السماء والأرض \" انفرد به أحمد ولم يخرجوه وروى الحافظ أبو بكر بن مردويه في تفسيره بإسناد له غريب عن خالد بن سعيد بن أبي مريم عن نافع عن ابن عمر قال: قال رسول الله صلى الله عليه وسلم \" من قرأ سورة الكهف في يوم الجمعة سطع له نور من تحت قدمه إلى عنان السماء يضئ له يوم القيامة وغفر له ما بين الجمعتين \" وهذا الحديث في رفعه نظر وأحسن أحواله الوقف. وهكذا روى الإمام سعيد بن منصور في سننه عن هشيم بن بشير عن أبي هاشم عن أبي مجلز عن قيس بن عباد عن أبي سعيد الخدري رضي الله عنه أنه قال: من قرأ سورة الكهف يوم الجمعة أضاء له من النور ما بينه وبين البيت العتيق هكذا وقع موقوفًا وكذا رواه الثوري عن أبي هاشم به من حديث أبي سعيد الخدري وقد أخرجه الحاكم في مستدركه عن أبي بكر محمد بن المؤمل حدثنا الفضيل بن محمد الشعراني حدثنا نعيم بن حماد حدثنا هشيم حدثنا أبو هاشم عن أبي مجلز عن قيس بن عباد عن أبي سعيد عن النبي صلى الله عليه وسلم أنه قال \" من قرأ سورة الكهف في يوم الجمعة أضاء له من النور ما بينه وبين الجمعتين\" ثم قال هذا حديث صحيح الإسناد ولم يخرجاه وهكذا رواه الحافظ أبو بكر البيهقي في سننه عن الحاكم ثم قال البيهقي ورواه يحيى بن كثير عن شعبة عن أبي هاشم بإسناده أن النبي صلى الله عليه وسلم قال \" من قرأ سورة الكهف كما نزلت كانت له نورًا يوم القيامة \" وفي المختارة للحافظ الضياء المقدسي عن عبدالله بن مصعب عن منظور بن زيد بن خالد الجهني عن علي بن الحسين عن أبيه عن علي مرفوعًا: \"من قرأ سورة الكهف يوم الجمعة فهو معصوم إلى ثمانية أيام من كل فتنة وإن خرج الدجال عصم منه\". قد تقدم في أول التفسير أنه تعالى يحمد نفسه المقدسة عند فواتح الأمور وخواتمها فإنه المحمود على كل حال وله الحمد في الأولى والآخرة ولهذا حمد نفسه على إنزاله كتابه العزيز على رسوله الكريم محمد صلوات الله وسلامه عليه فإنه أعظم نعمة أنعمها الله على أهل الأرض إذ أخرجهم به من الظلمات الى النور حيث جعله كتابًا مستقيمًا لا اعوجاج فيه ولا زيغ بل يهدي إلى صراط مستقيم واضحًا بينًا جليًا نذيرًا للكافرين بشيرا للمؤمنين ولهذا قال \" ولم يجعل له عوجا \" أي لم يجعل فيه اعوجاجًا ولا زيغًا ولا ميلا بل جعله معتدًلا مستقيمًا."
    },
    {
      "ayah": 10,
      "surah": 18,
      "text": "وقوله \" إذ أوى الفتية إلى الكهف فقالوا ربنا آتنا من لدنك رحمة وهيء لنا من أمرنا رشدا \" يخبر تعالى عن أولئك الفتية الذين فروا بدينهم من قومهم لئلا يفتنوهم عنه فهربوا منه فلجئوا إلى غار في جبل ليختفوا عن قومهم فقالوا حين دخلوا سائلين من الله تعالى رحمته ولطفه بهم \" ربنا آتنا من لدنك رحمة \" أي هب لنا من عندك رحمة ترحمنا بها وتسترنا عن قومنا \" وهيء لنا من أمرنا رشدا \" أي وقدر لنا من أمرنا رشدا هذا أي اجعل عاقبتنا رشدا كما جاء في الحديث وما قضيت لنا من قضاء فاجعل عاقبته رشدا وفي المسند من حديث بسر بن أرطاة عن رسول الله صلى الله عليه وسلم أنه كان يدعو \" اللهم أحسن عاقبتنا في الأمور كلها وأجرنا من خزي الدنيا وعذاب الآخرة \"."
    },
    {
      "ayah": 100,
      "surah": 18,
      "text": "يقول تعالى مخبرًا عما يفعله بالكفار يوم القيامة أنه يعرض عليهم جهنم أي يبرزها لهم و يظهرها ليروا ما فيها من العذاب والنكال قبل دخولها ليكون ذلك أبلغ في تعجيل الهم والحزن لهم.وفي صحيح مسلم عن ابن مسعود قال قال رسول الله صلى الله عليه وسلم \" يؤتى بجهنم تقاد يوم القيامة بسبعين ألف زمام مع كل زمام سبعون ألف ملك \"ثم قال مخبرًا عنهم."
    },
    {
      "ayah": 101,
      "surah": 18,
      "text": "\" الذين كانت أعينهم في غطاء عن ذكري \" أي تغافلوا وتعاموا وتصامموا عن قبول الهدى واتباع الحق كما قال: \" ومن يعش عن ذكر الرحمن نقيض له شيطانًا فهو له قرين \" وقال هنا \" وكانوا لا يستطيعون سمعًا \" أي لا يعقلون عن الله أمره ونهيه."
    },
    {
      "ayah": 102,
      "surah": 18,
      "text": "ثم قال: \" أفحسب الذين كفروا أن يتخذوا عبادي من دوني أولياء \" أي اعتقدوا أنهم يصلح لهم ذلك وينتفعون به \" كلا سيكفرون بعبادتهم ويكونون عليهم ضدا \" ولهذا أخبر الله تعالى أنه قد أعد لهم جهنم يوم القيامة منزلا."
    },
    {
      "ayah": 103,
      "surah": 18,
      "text": "قال البخاري: حدثنا محمد بن بشار حدثنا محمد بن جعفر حدثنا شعبة عن عمرو عن مصعب قال: سألت أبي يعني سعد بن أبي وقاص عن قول الله \" قل هل ننبئكم بالأخسرين أعمالا \" أهم الحرورية قال: لا هم اليهود والنصارى.أما اليهود فكذبوا محمدا صلى الله عليه وسلم وأما النصارى فكفروا بالجنة وقالوا لاطعام فيها ولا شراب والحرورية الذين ينقضون عهد الله من بعد ميثاقه فكان سعد رضي الله عنه يسميهم الفاسقين وقال علي بن أبي طالب والضحاك وغير واحد: هم الحرورية ومعنى هذا عن علي رضي الله عنه أن هذه الآية الكريمة تشمل الحرورية كما تشمل اليهود والنصارى وغيرهم لا أنها نزلت في هؤلاء على الخصوص ولا هؤلاء بل هي أعم من هذا فإن هذه الآية مكية قبل خطاب اليهود والنصارى وقبل وجود الخوارج بالكلية وإنما هي عامة في كل من عبد الله على غير طريقة مرضية بحسب أنه مصيب فيها وأن عمله مقبول وهو مخطئ وعمله مردود كما قال تعالى \" وجوه يومئذ خاشعة عاملة ناصبة تصلى نارًا حامية \" وقال تعالى \" وقدمنا إلى ماعملوا من عمل فجعلناه هباء منثورًا \" وقال تعالى \" والذين كفروا بربهم أعمالهم كسراب بقيعة يحسبه الظمآن ماء حتى إذا جاءه لم يجده شيئًا \" وقال في هذه الآية الكريمة \" قل هل ننبئكم \" أي نخبركم \" بالأخسرين أعمالا \" ثم فسرهم."
    },
    {
      "ayah": 104,
      "surah": 18,
      "text": "فقال \" الذين ضل سعيهم\" في الحياة الدنيا \" أي عملوا أعمالا باطلة على غير شريعة مشروعة مرضية مقبولة وهم يحسبون أنهم يحسنون صنعًا \" أي يعتقدون أنهم على شيء وأنهم مقبولون محبوبون."
    },
    {
      "ayah": 105,
      "surah": 18,
      "text": "وقوله: \" أولئك الذين كفروا بآيات ربهم ولقائه \" أي جحدوا آيات الله في الدنيا وبراهينه التي أقام على وحدانيته وصدق رسله وكذبوا بالدار الآخرة \" فلا نقيم لهم يوم القيامة وزنًا \" أي لا نثقل موازينهم لأنها خالية عن الخير قال البخاري: حدثنا محمد بن عبد الله حدثنا سعيد بن أبي مريم أخبرنا المغيرة حدثني أبو الزناد عن الأعرج عن أبي هريرة عن رسول الله صلى الله عليه وسلم أنه قال \" ليأتي الرجل العظيم السمين يوم القيامة لا يزن عند الله جناح بعوضة - وقال- اقرءوا إن شئتم فلا نقيم لهم يوم القيامة وزنًا \"وعن يحيى بن بكير عن مغيرة بن عبد الرحمن عن أبي الزناد مثله هكذا ذكره عن يحيى بن بكير معلقا وقد رواه مسلم عن أبي بكر محمد بن إسحاق عن يحيى بن بكير به وقال ابن أبي حاتم: حدثنا أبي حدثنا أبو الوليد حدثنا عبد الرحمن بن أبي الزناد عن صالح مولى التوأمة عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم \" يؤتى بالرجل الأكول الشروب العظيم فيوزن بحبة فلا يزنها \"قال وقرأ \" فلا نقيم لهم يوم القيامة وزنًا \" وكذا رواه ابن جرير عن أبي كريب عن أبي الصلت عن أبي الزناد عن صالح مولى التوأمة عن أبي هريرة مرفوعًا فذكره بلفظ البخاري سواء.وقال أحمد بن عمرو بن عبد الخالق البزار حدثنا العباس بن محمد حدثنا عون بن عمارة حدثنا هاشم بن حسان عن واصل عن عبد الله بن بريدة عن أبيه قال: كنا عند رسول الله صلى الله عليه وسلم فأقبل رجل من قريش يخطر في حلة له فلما قام على النبي صلى الله عليه وسلم قال: \" يا بريدة هذا ممن لا يقيم الله له يوم القيامة وزنا \"ثم قال تفرد به واصل مولى أبي عنبسة وعون بن عمار وليس بالحافظ ولم يتابع عليه.وقد قال ابن جرير: حدثنا محمد بن بشار حدثنا عبد الرحمن حدثنا سفيان عن الأعمش عن سمرة عن أبي يحيى عن كعب قال يؤتى يوم القيامة برجل عظيم طويل فلا يزن عند الله جناح بعوضة اقرءوا \" فلا نقيم لهم يوم القيامة وزنًا \"."
    },
    {
      "ayah": 106,
      "surah": 18,
      "text": "وقوله: \" ذلك جزاؤهم جهنم بما كفروا \" أي إنما جازيناهم بهذا الجزاء بسبب كفرهم واتخاذهم آيات الله ورسله هزوًا استهزءوا بهم وكذبوهم أشد التكذيب."
    },
    {
      "ayah": 107,
      "surah": 18,
      "text": "يخبر تعالى عن عباده السعداء وهم الذين آمنوا بالله ورسوله وصدقوا المرسلين فيما جاءوا به أن لهم جنات الفردوس قال مجاهد: الفردوس هو البستان بالرومية وقال كعب والسدي والضحاك هو البستان الذي فيه شجر الأعناب وقال أبو أمامة: الفردوس سرة الجنة وقال قتادة: الفردوس ربوة الجنة وأوسطهـا وأفضلها وقد روي هذا مرفوعًا من حديث سعيد بن جبير عن قتادة عن الحسن عن سمرة عن النبي صلى الله عليه وسلم \" الفردوس ربوة الجنة أوسطها وأحسنها \"وهكذا رواه إسماعيل بن مسلم عن الحسن عن سمرة مرفوعًا وروي عن قتادة عن أنس بن مالك مرفوعًا بنحوه روى ذلك كله ابن جرير رحمه الله وفي الصحيحين \" إذا سألتم الله الجنة فاسألوه الفردوس فإنه أعلى الجنة وأوسط الجنة ومنه تفجر أنهار الجنة \"وقوله تعالى \" نزلا\" أي ضيافة فإن النزل الضيافة."
    },
    {
      "ayah": 108,
      "surah": 18,
      "text": "وقوله \" خالدين فيها \" أي مقيمين ساكنين فيها لا يظعنون عنها أبدًا \" لا يبغون عنها حولا\" أي لا يختارون عنها غيرها ولا يحبون سواها كما قال الشاعر: فحلت سويدا القلب لا أنا باغيًا سواها ولا عن حبها أتحول وفي قوله \" لا يبغون عنها حولا \" تنبيه على رغبتهم فيها وحبهم لها مع أنه قد يتوهم فيمن هو مقيم في المكان دائمًا أنه فد يسأمه أو يمله فأخبر أنهم مع هذا الدوام والخلود السرمدي لا يختارون عن مقامهم ذلك متحولا ولا انتقالاً ولا ظعنًا ولاً رحلة ولا بدلاً."
    },
    {
      "ayah": 109,
      "surah": 18,
      "text": "يقول تعالى: قل يا محمد لو كان ماء البحر مدادا للقلم الذي يكتب به كلمات الله وحكمه وآياته الدالة لنفد البحر قبل أن يفرغ كتابة ذلك \" ولو جئنا بمثله \" أي بمثل البحر آخر ثم آخر وهلم جرًا بحور تمده ويكتب بها لما نفدت كلمات الله كما قال تعالى \" ولو أن ما في الأرض من شجرة أقلام والبحر يمده من بعده سبعة أبحر ما نفدت كلمات الله إن الله عزيز حكيم \" وقال الربيع بن أنس إن مثل علم العباد كلهم في علم الله كقطرة من ماء البحور كلها وقد أنزل الله ذلك \" قل لو كان البحر مدادا لكلمات ربي لنفد البحر قبل أن تنفد كلمات ربي \" يقول لو كانت تلك البحور مدادًا لكلمات الله والشجر كله أقلام لانكسرت الأقلام وفني ماء البحر وبقيت كلمات الله قائمة لا يفنيها شيء لأن أحدًا لا يستطيع أن يقدر قدره ولا يثني عليه كما ينبغي حتى يكون هو الذي يثني على نفسه إن ربنا كما يقول وفوق ما نقول إن مثل نعيم الدنيا أولها وآخرها في نعيم الآخرة كحبة من خردل في خلال الأرض كلها."
    },
    {
      "ayah": 11,
      "surah": 18,
      "text": "وقوله \" فضربنا على آذانهم في الكهف سنين عددا \" أي ألقينا عليهم النوم حين دخلوا إلى الكهف فناموا سنين كثيرة."
    },
    {
      "ayah": 110,
      "surah": 18,
      "text": "روى الطبراني من طريق هشام بن عمار عن إسماعيل بن عياش عن عمرو بن قيس الكوفي أنه سمع معاوية بن أبي سفيان أنه قال هذه آخر آية أنزلت يقول تعالى لرسوله محمد صلوات الله وسلامه عليه \" قل \" لهؤلاء المشركين المكذبين برسالتك إليهم \" إنما أنا بشر مثلكم \" فمن زعم أني كاذب فليأت بمثل ما جئت به فإني لا أعلم الغيب فيما أخبرتكم به من الماضي عما سألتم من قصة أصحاب الكهف وخبر ذي القرنين مما هو مطابق في نفس الأمر لولا ما أطلعني الله عليه وإنما أخبركم \" أنما إلهكم \" الذي أدعوكم إلى عبادته \" إله واحد \" لا شريك له \" فمن كان يرجو لقاء ربه \" أي ثوابه وجزاءه الصالح \" فليعمل عملا صالحًا \" ما كان موافقًا لشرع الله \" ولا يشرك بعبادة ربه أحدا \" وهو الذي يراد به وجه الله وحده لا شريك له وهذان ركنا العمل المتقبل لا بد أن يكون خالصًا لله صوابًا على شريعة رسول الله صلى الله عليه وسلم وقد روى ابن أبي حاتم من حديث معمر عن عبد الكريم الجزري عن طاوس قال: قال رجل يا رسول الله إني أقف المواقف أريد وجه الله وأحب أن يرى موطني فلم يرد عليه رسول الله صلى الله عليه وسلم شيئًا حتى نزلت هذه الآية \" فمن كان يرجو لقاء ربه فليعمل عملا صالحًا ولا يشرك بعبادة ربه أحدًا \" وهكذا أرسل هذا مجاهد وغير واحد وقال الأعمش: حدثنا حمزة أبو عمارةمولى بني هاشم عن شهر بن حوشب قال جاء رجل إلى عبادة بن الصامت فقال أنبئني عما أسألك عنه: أرأيت رجلا يصلي يبتغي وجه الله وحب أن يحمد ويصوم يبتغي وجه الله ويحب أن يحمد ويتصدق يبتغي وجه الله ويحب أن يحمد ويحج ويبتغي وجه الله ويحب أن يحمد فقال عبادة ليس له شيء إن الله تعالى يقول: أنا خير شريك فمن كان له معي شريك فهو له كله لا حاجة لي فيه وقال الإمام أحمد: حدثنا محمد بن عبد الله بن الزبير حدثنا كثير بن زيد عن ربيح بن عبد الرحمن بن أبي سعيد الخدري عن أبيه عن جده قال كنا نتناوب رسول الله صلى الله عليه وسلم فنبيت عنده تكون له الحاجة أو يطرقه أمر من الليل فيبعثنا فكثر المحبوسون وأهل النوب فكنا نتحدث فخرج علينا رسول الله صلى الله عليه وسلم فقال \" ما هذه النجوى ؟ \"قال فقلنا تبنا إلى الله أي نبي الله إنما كنا في ذكر المسيح وفرقنا منه فقال \" ألا أخبركم بما هو أخوف عليكم من المسيح عندي \"؟ قال قلنا بلى فال \" الشرك الخفي أن يقوم الرجل يصلي لمكان الرجل \".وقال الإمام أحمد: حدثنا أبو النضر حدثنا عبد الحميد يعني ابن بهرام قال: قال شهر بن حوشب قال ابن غنم لما دخلنا مسجد الجابية أنا وأبو الدرداء لقينا عبادة بن الصامت فأخذ يميني بشماله وشمال أبي الدرداء بيمينه فخرج يمشي بيننا ونحن نتناجى والله أعلم بما نتناجى به فقال عبادة بن الصامت: إن طال بكما عمر أحدكما أو كليكما لتوشكان أن تريا الرجل من ثبج المسلمين يعني من وسط قراء القرآن على لسان محمد صلى الله عليه وسلم فأعاده وأبدأه وأحل حلاله وحرم حرامه ونزله عند منازله لا يجوز فيكم إلا كما يجوز رأس الحمار الميت.قال فبينما نحن كذلك إذ طلع شداد بن أوس رضي الله عنه وعوف بن مالك فجلسا إلينا فقال شداد إن أخوف ما أخاف عليكم أيها الناس لما سمعت رسول الله صلى الله عليه وسلم يقول: \" من الشهوة الخفية والشرك \"فقال عبادة بن الصامت وأبو الدرداء: اللهم غفرا ألم يكن رسول الله صلى الله عليه وسلم قد حدثنا أن الشيطان قد يئس أن يعبد في جزيرة العرب أما الشهوة الخفية فقد عرفناها هي شهوات الدنيا من نسائها وشهواتها فما هذا الشرك الذي تخوفنا به يا شداد ؟ فقال شداد: أرأيتكم لو رأيتم رجلا يصلي لرجل أو يصوم لرجل أو يتصدق أترون أنه قد أشرك ؟ قالوا نعم والله إن من صلى أو صام أو تصدق له لقد أشرك فقال شداد فإني سمعت رسول الله صلى الله عليه وسلم \" من صلى يرائي فقد أشرك ومن صام يرائي فقد أشرك ومن تصدق يرائي فقد أشرك \"قال عوف بن مالك عند ذلك أفلا يعمد الله إلى ما ابتغي به وجهه من ذلك العمل كله فيقبل ما خلص له ويدع ما أشرك به فقال شداد عند ذلك فإني سمعت رسول الله صلى الله عليه وسلم يقول: \" إن الله يقول أنا خير قسيم لمن أشرك بي من أشرك بي شيئًا فإن عمله قليله وكثيره لشريكه الذي أشرك به أنا عنه غني \" \"طريق أخرى لبعضه\" قال الإمام أحمد: حدثنا زيد بن الحباب حدثني عبد الواحد بن زياد أخبرنا عبادة بن نسي عن شداد بن أوس رضي الله عنه أنه بكى فقيل ما يبكيك ؟ قال شيء سمعته عن رسول الله صلى الله عليه وسلم فأبكاني سمعت رسول الله يقول \" أتخوف على أمتي الشرك والشهوة الخفية \"قلت يا رسول الله أتشرك أمتك من بعدك ؟ قال \" نعم أما إنهم لا يعبدون شمسًا ولا قمرًا ولا حجرا ولا وثنًا ولكن يراءون بأعمالهم ; والشهوة الخفية أن يصبح أحدهم صائما فتعرض له شهوة من شهواته فيترك صومه \"ورواه ابن ماجه من حديث الحسن بن ذكوان عن عبادة بن نسي به وعبادة فيه ضعف وفي سماعه من شداد نظر \"حديث آخر\" قال الحافظ أبو بكر البزار: حدثنا الحسن بن علي بن جعفر الأحمر حدثنا علي بن ثابت حدثنا قيس بن أبي حصين عن أبي صالح عن أبي هريرة قال: قال رسول الله صلى الله عليه وسلم \" يقول الله يوم القيامة أنا خير شريك من أشرك بي أحدًا فهو له كله \"وقال الإمام أحمد: حدثنا محمد بن جعفر حدثنا شعبة سمعت العلاء يحدث عن أبيه عن أبي هريرة عن النبي صلى الله عليه وسلم يرويه عن الله عز وجل أنه قال \" أنا خير الشركاء فمن عمل عملا أشرك فيه غيري فأنا بريء منه وهو للذي أشرك \"تفرد به من هذا الوجه \"حديث آخر\" قال الإمام أحمد: حدثنا يونس حدثنا الليث عن يزيد يعني ابن الهاد عن عمرو عن محمود بن لبيد أن رسول الله صلى الله عليه وسلم قال \" إن أخوف ما أخاف عيلكم الشرك الأصغر \"قالوا وما الشرك الأصغر يا رسول الله ؟ قال \" الرياء يقول الله يوم القيامه إذا جزى الناس - بأعمالهم اذهبوا إلى الذين كنتم تراءون في الدنيا فانظروا هل تجدون عندهم جزاء \"\"حديث آخر\" قال الإمام أحمد: حدثنا محمد بن بكير أخبرنا عبد الحميد يعني ابن جعفر أخبرني أبي عن زياد بن ميناء عن أبي سعيد بن أبي فضالة الأنصاري وكان من الصحابة أنه قال سمعت رسول الله صلى الله عليه وسلم يقول \" إذا جمع الله الأولين والآخرين ليوم لا ريب فيه نادى مناد: من كان أشرك في عمل عمله لله أحدًا فليطلب ثوابه من عند غير الله فإن الله أغنى الشركاء عن الشرك \"وأخرجه الترمذي وابن ماجه من حديث محمد وهو البرساني به \"حديت آخر\" قال الإمام أحمد: حدثنا أحمد بن عبد الملك حدثنا بكار حدثني أبي - يعني عبد العزيز بن أبي بكرة - عن أبي بكرة صلى الله عليه وسلم قال: قال رسول الله صلى الله عليه وسلم \" من سمع سمع الله به ومن راءى راءى الله به \"وقال الإمام أحمد حدثنا معاوية حدثنا شيبان عن فراس عن عطية عن أبي سعيد الخدري عن رسول الله صلى الله عليه وسلم قال \" من يرائي يرائي الله به ومن يسمع يسمع الله به \"\"حديث آخر\" قال الإمام أحمد: حدثنا يحيى بن سعيد عن شعبة حدثني عمرو بن مرة قال سمعت رجلا في بيت أبي عبيدة أنه سمع عبد الله بن عمرو يحدث ابن عمر أنه سمع رسول الله صلى الله عليه وسلم يقول \" من سمَّع الناس بعمله سمع الله به مسامع خلقه وصغره وحقره \" فذرفت عينا عبد الله وقال الحافظ أبو بكر البزار: حدثنا عمرو بن يحيي الأيلي حدثنا الحارث بن غسان حدثنا أبو عمران الجوني عن أنس رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم \" تعرض أعمال بني آدم بين يدي الله عز وجل يوم القيامة في صحف مختمة فيقول الله ألقوا هذا واقبلوا هذا فتقول الملائكة يا رب والله ما رأينا منه إلا خيرًا فيقول إن عمله كان لغير وجهي ولا أقبل اليوم من العمل إلا ما أريد به وجهي \"ثم قال: الحارث بن غسان روي عنه وهو ثقة بصري ليس به بأس وقال وهب: حدثني يزيد بن عياض عن عبد الرحمن الأعرج عن عبد الله بن قيس الخزاعي أن رسول الله صلى الله عليه وسلم قال \" من قام رياء وسمعة لم يزل في مقت الله حتى يجلس \"وقال أبو يعلى: حدثنا محمد بن أبي بكر حدثنا محمد بن دينار عن إبراهيم الهجري عن أبي الأحوص عن عوف بن مالك عن ابن مسعود رضي الله عنه قال قال رسول الله صلى الله عليه وسلم \" من أحسن الصلاة حيث يراه الناس وأساءها حيث يخلو فتلك استهانة استهان بها ربه عز وجل \"وقال ابن جرير: حدثنا أبو عامر إسماعيل بن عمرو السكوني حدثنا هشام بن عمار حدثنا ابن عياش حدثنا عمرو بن قيس الكندي أنه سمع معاوية بن أبي سفيان تلا هذه الآية \" فمن كان يرجو لقاء ربه \" الآية وقال إنها آخر آية نزلت من القرآن وهذا أثر مشكل فإن هذه الآية آخر سورة الكهف والكهف كلها مكية ولعل معاوية أراد أنه لم ينزل بعدها آية تنسخها ولا تغير حكمها بل هي مثبتة محكمة فاشتبه ذلك على بعض الرواة فروى بالمعنى على ما فهمه والله أعلم...وقال الحافظ أبو بكر البزار: حدثنا محمد بن علي بن الحسن بن شقيق حدثنا النضر بن شميل حدثنا أبو قرة عن سعيد بن المسبب عن عمر بن الخطاب قال قال رسول الله صلى الله عليه وسلم \" من قرأ في ليلة \" فمن كان يرجو لقاء ربه \" كان له من النور من عدن أبين إلى مكة حشو ذلك النور الملائكة \" غريب جدًا.آخر تفسير سورة الكهف."
    },
    {
      "ayah": 12,
      "surah": 18,
      "text": "\" ثم بعثناهم \" أي من رقدتهم تلك وخرج أحدهم بدراهم معه ليشتري لهم بها طعامًا يأكلونه كما سيأتي بيانه وتفصيله ولهذا قال \" ثم بعثناهم لنعلم أي الحزبين \" أي المختلفين فيهم \" أحصى لما لبثوا أمدا \" قيل عددا وقيل غاية فإن الأمد الغاية كقوله: سبق الجواد إذا استولى على الأمد."
    },
    {
      "ayah": 13,
      "surah": 18,
      "text": "من ههنا شرع في بسط القصة وشرحها فذكر تعالى أنهم فتية وهم الشباب وهم أقبل للحق وأهدى للسبيل من الشيوخ الذين قد عتوا وانغمسوا في دين الباطل ولهذا كان أكثر المستجيبين لله تعالى ولرسوله صلى الله عليه وسلم شبابا وأمًا المشايخ من قريش فعامتهم بقوا على دينهم ولم يسلم منهم إلا القليل هكذا أخبر تعالى عن أصحاب الكهف أنهم كانوا فتية شبابًا وقال مجاهد: بلغني أنه كان في آذان بعضهم القرطة يعني الحلق فألهمهم الله رشدهم وآتاهم تقواهم فآمنوا بربهم أي اعترفوا له بالوحدانية وشهدوا أنه لا إله إلا هو وزدناهم هدى استدل بهذه الآية وأمثالها غير واحد من الأئمة كالبخاري وغيره ممن ذهب إلى زيادة الإيمان وتفاضله وأنه يزيد وينقص ولهذا قال تعالى \" وزدناهم هدى \" كما قال \" والذين اهتدوا زادهم هدى وآتاهم تقواهم \" وقال \" فأما الذين آمنوا فزادتهم إيمانا وهم يستبشرون \" وقال \" ليزدادوا إيمانا مع إيمانهم \" إلى غير ذلك من الآيات الدالة على ذلك.وقد ذكر أنهم كانوا على دين المسيح عيسى ابن مريم فالله أعلم والظاهر أنهم كانوا قبل ملة النصرانية بالكلية فإنهم لو كانوا على دين النصرانية لما اعتنى أحبار اليهود بحفظ خيرهم وأمرهم لمباينتهم لهم وقد تقدم عن ابن عباس أن قريشًا بعثوا إلى أحبار اليهود بالمدينة يطلبون منهم أشياء يمتحنون بها رسول الله صلى الله عليه وسلم فبعثوا إليهم أن يسألوه عن خبر هؤلاء وعن خبر ذي القرنين وعن الروح فدل هذا على أن هذا أمر محفوظ في كتب أهل الكتاب وأنه متقدم على دين النصرانية والله أعلم."
    },
    {
      "ayah": 14,
      "surah": 18,
      "text": "وقوله \" وربطنا على قلوبهم إذ قاموا فقالوا ربنا رب السموات والأرض \" يقول تعالى وصبرناهم على مخالفة قومهم ومدينتهم ومفارقة ما كانوا فيه من العيش الرغيد والسعادة والنعمة فإنه قد ذكر غير واحد من المفسرين من السلف والخلف أنهم كانوا من أبناء ملوك الروم وسادتهم و أنهم خرجوا يوما في بعض أعياد قومهم وكان لهم مجتمع في السنة يجتمعون فيه في ظاهر البلد وكانوا يعبدون الأصنام والطواغيت ويذبحون لها وكان لهم ملك جبار عنيد يقال له دقيانوس وكان يأمر الناس بذلك ويحثهم عليه ويدعوهم إليه فلما خرج الناس لمجتمعهم ذلك وخرج هؤلاء الفتية مع آبائهم وقومهم ونظروا إلى ما يصنع قومهم بعين بصيرتهم عرفوا أن هذا الذي يصنعه قومهم من السجود لأصنامهم والذبح لها لا ينبغي إلا لله الذي خلق السموات والأرض فجعل كل واحد منهم يتخلص من قومه وينحاز منهم ويتبرز عنهم ناحية فكان أول من جلس منهم وحده أحدهم جلس تحت ظل شجرة فجاء الآخر فجلس إليها عنده وجاء الآخر فجلس إليهما وجاء الآخر فجلس إليهم وجاء الآخر وجاء الأخر ولا يعرف واحد منهم الآخر وإنما جمعهم هناك الذي جمع قلوبهم على الإيمان كما جاء في الحديث الذي رواه البخاري تعليقًا من حديث يحيى بن سعيد عن عمرة عن عائشة رضي الله عنها قالت قال رسول الله صلى الله عليه وسلم \" الأرواح جنود مجندة فما تعارف منها ائتلف وما تناكر منها اختلف \"وأخرجه مسلم في صحيحه من حديث سهيل عن أبي هريرة عن رسول الله صلى الله عليه وسلم والناس يقولون الجنسية علة الضم: والغرض أنه جعل كل أحد منهم يكتم ماهو عليه عن أصحابه خوفًا منهم ولا يدري أنهم مثله حتى قال أحدهم: تعلمون والله ياقوم إنه ما أخرجكم من قومكم وأفردكم عنهم إلا شيء فليظهر كل واحد منكم بأمره فقال آخر: أما أنا فإني والله رأيت ما قومي عليه فعرفت أنه باطل وإنما الذي يستحق أن يعبد وحده ولايشرك به شيئًا هو الله الذي خلق السموات والأرض وما بينهما وقال الآخر: وأنا والله وقع لي كذلك وقال الآخر كذلك حتى توافقوا كلهم على كلمة واحدة فصاروا يدًا واحدة وإخوان صدق فاتخذوا لهم معبدًا يعبدون الله فيه فعرف بهم قومهم فوشوا بأمرهم إلى ملكهم فاستحضرهم بين يديه فسألهم عن أمرهم وما هم عليه فأجابوه بالحق ودعوه إلى الله عز وجل ولهذا أخبر تعالى عنهم:بقوله \" وربطنا على قلوبهم إذ قاموا فقالوا ربنا رب السموات والارض لن ندعو من دونه إلها \" ولن لنفي التأبيد أي لا يقع منا هذا أبدًا لأنا لو فعلنا ذلك لكان باطلاولهذا قال عنهم \" لقد قلنا إذا شططا\" أي باطلاً وكذبًا وبهتانًا."
    },
    {
      "ayah": 15,
      "surah": 18,
      "text": "\" هؤلاء قومنا اتخذوا من دونه آلهة \" لولا يأتون عليهم بسلطان بين أي هلا أقاموا على صحة ما ذهبوا إليه دليلا واضحًا صحيحًا \" فمن أظلم ممن افترى على الله كذبا\" يقولون: بل هم ظالمون كاذبون في قولهم ذلك فيقال إن ملكهم لما دعوه إلى الإيمان بالله أبى عليهم وتهددهم وتوعدهم وأمر بنزع لباسهم عنهم الذي كان عليهم من زينة قومهم وأجلهم لينظروا في أمرهم لعلهم يرجعون عن دينهم الذي كانوا عليه وكان هذا من لطف الله بهم فإنهم في تلك النظرة توصلوا إلى الهرب منه والفرار بدينهم من الفتنة وهذا هو المشروع عند وقوع الفتن في الناس أن يفر العبد منهم خوفًا على دينه كما جاء في الحديث \" يوشك أن يكون خير مال أحدكم غنمًا يتبع بها شعف الجبال ومواقع القطر يفر بدينه من الفتن \"ففي هذه الحال تشرع العزلة عن الناس ولاتشرع فيما عداها لما يفوت بها من ترك الجماعات والجمع فلما وقع عزمهم على الذهاب والهرب من قومهم واختار الله تعالى لهم ذلك وأخبر عنهم بذلك."
    },
    {
      "ayah": 16,
      "surah": 18,
      "text": "في قوله\" وإذ اعتزلتموهم وما يعبدون إلاالله\" أي وإذا فارقتموهم وخالفتموهم بأديانكم في عبادتهم غير الله ففارقوهم أيضًا بأبدانكم فأووا إلى الكهف ينشر لكم ربكم من رحمته أي يبسط عليكم رحمة يستركم بها من قومكم ويهيء لكم من أمركم الذي أنتم فيه مرفقا أي أمرًا ترتفقون به فعند ذلك خرجوا هرابا إلى الكهف فأووا إليه ففقدهم قومهم من بين أظهرهم وتطلبهم الملك فيقال إنه لم يظفر بهم وعمى الله عليه خبرهم كما فعل بنبيه محمد صلى الله عليه وسلم وصاحبه الصديق حين لجآ إلى غار ثور وجاء المشركون من قريش في الطلب فلم يهتدوا إليه مع أنهم يمرون عليه وعندها قال النبي صلى الله عليه وسلم حين رأى جزع الصديق في قوله: يارسول الله لو أن أحدهم نظر إلى موضع قدميه لأبصرنا فقال \"يا أبا بكر ما ظنك باثنين الله ثالثهما؟\"وقد قال تعالى إلا تنصروه فقد نصره الله إذ أخرجه الذين كفروا ثاني اثنين إذا هما في الغار إذ يقول لصاحبه لاتحزن إن الله معنا فأنزل الله سكينته عليه وأيده بجنود لم تروها وجعل كلمة الذين كفروا السفلى وكلمة الله هي العليا والله عزيز حكيم فقصة هذا الغار أشرف وأجل و أعظم وأعجب من قصة أصحاب الكهف وقد قيل إن قومهم ظفروا ووقفوا على باب الغار الذي دخلوه فقالوا ما كنا نريد منهم من العقوبة أكثر مما فعلوا بأنفسهم فأمر الملك بردم بابه عليهم ليهلكوا مكانهم ففعلوا ذلك وفي هذا نظر والله أعلم فإن الله تعالى قد أخبر أن الشمس تدخل عليهم في الكهف بكرة وعشيا كما قال تعالى."
    },
    {
      "ayah": 17,
      "surah": 18,
      "text": "فهذا فيه دليل على أن باب هذا الكهف كان من نحو الشمال لإنه تعالى أخبر أن الشمس إذا دخلته عند طلوعها تزاور عنه \" ذات اليمين\" أي يتقلص الفيء يمنة كما قال ابن عباس وسعيد بن جبير وقتادة \" تزاور \" أي تميل وذلك أنها كلما ارتفعت في الأفق تقلص شعاعها بارتفاعها حتى لا يبقى منه شيء عند الزوال في مثل ذلك المكان ولهذا قال \" وإذا غربت تقرضهم ذات الشمال \" أي تدخل إلى غارهم من شمال بابه وهو من ناحية المشرق فدل على صحة ما قلناه وهذا بين لمن تأمله وكان له علم بمعرفة الهيئة وسير الشمس والقمر والكواكب وبيانه أنه لو كان باب الغار من ناحية الشرق لما دخل إليه منها شيء عند الغروب ولو كان من ناحية القبلة لما دخل منها شيء عند الطلوع ولا عند الغروب ولا تزاور الفيء يمينًا ولا شمالا ولو كان من جهة الغرب لما دخلته وقت الطلوع بل بعد الزوال ولم تزل فيه إلى الغروب فتعين ما ذكرناه ولله الحمد وقال ابن عباس ومجاهد وقتادة: \" تقرضهم\" تتركهم وقد أخبر الله تعالى بذلك وأراد منا فهمه وتدبره ولم يخبرنا بمكان هذا الكهف في أي البلاد من الأرض إذ لا فائدة لنا فيه ولا قصد شرعي وقد تكلف بعض المفسرين فذكروا فيه أقوالا فتقدم عن ابن عباس أنه قال هو قريب من أيلة وقال ابن إسحاق: هو عند نينوى وقيل ببلاد الروم وقيل ببلاد البلقاء والله أعلم بأي بلاد الله هو ; ولو كان لنا فيه مصلحة دينية لأرشدنا الله تعالى ورسوله إليه فقد قال صلى الله عليه وسلم \" ما تركت شيئًا يقربكم إلى الجنة ويباعدكم من النار إلا وقد أعلمتكم به \"فأعلمنا تعالى بصفته ولم يعلمنا بمكانه فقال \" وترى الشمس إذا طلعت تزاور عن كهفهم \" قال مالك عن زيد بن أسلم: تميل\" ذات اليمين وإذا غربت تقرضهم ذات الشمال وهم في فجوة منه \" أي في متسع منه داخلا بحيث لا تصيبهم إذ لو أصابتهم لأحرقت أبدانهم وثيابهم قاله ابن عباس \" ذلك من آيات الله \" حيث أرشدهم إلى هذا الغار الذي جعلهم فيه أحياء والشمس والريح تدخل عليهم فيه لتبقي أبدانهم ولهذا قال تعالى \" ذلك من آيات الله\" ثم قال \" من يهد الله فهو المهتد \" الآية أي هو الذي أرشد هؤلاء الفتية إلى الهداية من بين قومهم فإنه من هداه الله اهتدى ومن أضله فلا هادي له."
    },
    {
      "ayah": 18,
      "surah": 18,
      "text": "ذكر بعض أهل العلم أنهم لما ضرب الله على آذانهم بالنوم لم تنطبق أعينهم لئلا يسرع إليها البلى فإذا بقيت ظاهرة للهواء كان أبقى لها ولهذا قال تعالى \" وتحسبهم أيقاظا وهم رقود \" وقد ذكر عن الذئب أنه ينام فيطبق عينًا ويفتح عينًا ثم يفتح هذه ويطبق هذه وهو راقد كما قال الشاعر: ينام بإحدى مقلتيه ويتقي بأخرى الرزايا فهو يقظان نائم وقوله تعالى \" ونقلبهم ذات اليمين وذات الشمال \" قال بعض السلف: يقلبون في العام مرتين قال ابن عباس: لو لم يقلبوا لأكلتهم الأرض وقوله \" وكلبهم باسط ذراعيه بالوصيد \" قال ابن عباس ومجاهد وسعيد بن جبير وقتادة الوصيد الفناء وقال ابن عباس بالباب وقيل بالصعيد وهو التراب والصحيح أنه بالفناء وهو الباب ومنه قوله تعالى \" إنها عليهم مؤصدة\" أي مطبقة مغلقة ويقال وصيد وأصيد ربض كلبهم على الباب كما جرت به عادة الكلاب قال ابن جريج: يحرس عليهم الباب وهذا من سجيته وطبيعته حيث يربض ببابهم كأنه يحرسهم وكان جلوسه خارج الباب لأن الملائكة لا تدخل بيتًا فيه كلب كما ورد في الصحيح ولا صورة ولا جنب ولا كافر كما ورد به الحديث الحسن. وشملت كلبهم فأصابه ما أصابهم من النوم على تلك الحال وهذا فائدة صحبة الأخيار فإنه صار لهذا الكلب ذكر وخبر وشأن وقد قيل إنه كان كلب صيد لأحدهم وهو الأشبه وقيل كلب طباخ الملك وقد كان وافقهم على الدين وصحبه كلبه فالله أعلم وقد روى الحافظ ابن عساكر في ترجمة همام ابن الوليد الدمشقي: حدثنا صدقة بن عمر الغساني حدثنا عباد المنقري سمعت الحسن البصري يقول: كان اسم كبش إبراهيم عليه الصلاة والسلام جرير واسم هدهد سليمان عليه السلام عنفز واسم كلب أصحاب الكهف قطمير واسم عجل بني إسرائيل الذي عبدوه بهموت.وهبط آدم عليه السلام بالهند وحواء بجدة وإبليس بدست بيسان والحية بأصفهان وقد تقدم عن شعيب الجبائي أنه سماه حمران واختلفوا في لونه على أقوال لا حاصل لها ولا طائل تحتها ولا دليل عليها ولا حاجة إليها بل هي مما ينهى عنه فإن مستندها رجم بالغيب وقوله تعالى \" لو اطلعت عليهم لوليت منهم فرارا ولملئت منهم رعبا \" أي أنه تعالى ألقى عليهم المهابة بحيث لا يقع نظر أحد عليهم إلا هابهم لما ألبسوا من المهابة والذعر لئلا يدنو منهم أحد ولا تمسهم يد لامس حتى يبلغ الكتاب أجله وتنقضي رقدتهم التي شاء تبارك وتعالى فهم لما له في ذلك من الحكمة والحجة البالغة والرحمة الواسعة."
    },
    {
      "ayah": 19,
      "surah": 18,
      "text": "يقول تعالى كما أرقدناهم بعثناهم صحيحة أبدانهم وأشعارهم وأبشارهم لم يفقدوا من أحوالهم وهيئاتهم شيئًا وذلك بعد ثلثمائة سنة وتسع سنين و لهذا تساءلوا بينهم \" كم لبثتم \" أي كم رقدتم \" قالوا لبثنا يومًا أو بعض يوم \" لأنه كان دخولهم إلى الكهف في أول نهار واستيقاظهم كان في آخر نهار ولهذا استدركوا فقالوا \" أو بعض يوم قالوا ربكم أعلم بما لبثتم \" أي الله أعلم بأمركم وكأنه حصل لهم نوع تردد في كثرة نومهم فالله أعلم ثم عدلوا إلى الأهم في أمرهم إذ ذاك وهو احتياجهم إلى الطعام والشراب فقالوا \" فابعثوا أحدكم بورقكم \" أي فضتكم هذه وذلك أنهم كانوا قد استصحبوا معهم دراهم من منازلهم لحاجتهم إليها فتصدقوا منها وبقي منها فلهذا قالوا \" فابعثوا أحدكم بورقكم هذه إلى المدينة\" أي مدينتكم التي خرجتم منها والألف واللام للعهد \" فلينظر أيها أزكى طعاما \" أي أطيب طعاما كقوله \" ولولا فضل الله عليكم ورحمته ما زكى منكم من أحد أبدا \" وقوله \" قد أفلح من تزكى \" ومنه الزكاة التي تطيب المال وتطهره وقيل أكثر طعامًا ومنه زكاة الزرع إذا كثر قال الشاعر: قبائلنا سبع وأنتم ثلاثة وللسبع أزكى من ثلاث وأطيبك والصحيح الأول لأن مقصودهم إنما هو الطيب الحلال سواء كان كثيرًا أو قليلا وقوله \" وليتلطف \" أي في خروجه وذهابه وشرائه وإيابه يقولون وليختف كل ما يقدر عليه \" ولا يشعرن \" أي ولا يعلمن \" بكم أحدًا."
    },
    {
      "ayah": 2,
      "surah": 18,
      "text": "ولهذا قال قيما أي مستقيما لينذر بأسا شديدا من لدنه أي لمن خالفه وكذبه ولم يؤمن به ينذره بأسًا شديدًا عقوبة عاجلة في الدنيا وآجلة في الآخرة من لدنه أي من عند الله الذي لا يعذب عذابه أحد ولا يوثق وثاقه أحد \" ويبشر المؤمنين \" أي بهذا القرآن الذين صدقوا إيمانهم بالعمل الصالح أن لهم أجرًا حسنا أي مثوبة عند الله جميلة."
    },
    {
      "ayah": 20,
      "surah": 18,
      "text": "\" إنهم إن يظهروا عليكم يرجموكم \" أي إن علموا بمكانكم \" يرجموكم أو يعيدوكم في ملتهم \" يعنون أصحاب دقيانوس يخافون منهم أن يطلعوا على مكانهم فلا يزالون يعذبونهم بأنواع العذاب إلى أن يعيدوهم في ملتهم التي هم عليها أو يموتوا وإن وافقتموهم على العود في الدين فلا فلاح لكم في الدنيا ولا في الآخرة ولهذا قال \" ولن تفلحوا إذا أبدًا\"."
    },
    {
      "ayah": 21,
      "surah": 18,
      "text": "يقول تعالى \" وكذلك أعثرنا عليهم\" أي اطلعنا عليهم الناس \" ليعلموا أن وعد الله حق وأن الساعة لا ريب فيها\" ذكر غير واحد من السلف أنه كان قد حصل لأهل ذلك الزمان شك في البعث وفي أمر القيامة وقال عكرمة: كان منهم طائفة قد قالوا تبعث الأرواح ولا تبعث الأجساد فبعث الله أهل الكهف حجة ودلالة وآية على ذلك وذكروا أنه لما أراد أحدهم الخروج ليذهب إلى المدينة في شراء شيء لهم ليأكلوه تنكر وخرج يمشي في غير الجادة حتى انتهى إلى المدينة وذكروا أن اسمها دقسوس وهو يظن أنه قريب العهد بها وكان الناس قد تبدلوا قرنًا بعد قرن وجيلا بعد جيل وأمة بعد أمة وتغيرت البلاد ومن عليها كما قال الشاعر: أما الديار فإنها كديارهم وأرى رجال الحي غير رجاله فجعل لا يرى شيئًا من معالم البلد التي يعرفها ولا يعرف أحدا من أهلها لا خواصها ولا عوامها فجعل يتحير في نفسه ويقول: لعل بي جنونًا أو مسًا أو أنا حالم ويقول: والله ما بي شيء من ذلك وإن عهدي بهذه البلدة عشية أمس على غير هذه الصفة ثم قال: إن تعجيل الخروج من ههنا لأولى لي ثم عمد إلى رجل ممن يبيع الطعام فدفع إليه ما معه من النفقة وسأله أن يبيعه بها طعامًا فلما رآها ذلك الرجل أنكرها وأنكر ضربها فدفعها إلى جاره وجعلوا يتداولونها بينهم ويقولون لعل هذا وجد كنزًا فسألوه عن أمره ومن أين له هذه النفقة لعله وجدها من كنز وممن أنت ؟ فجعل يقول أنا من أهل هذه البلدة وعهدي بها عشية أمس وفيها دقيانوس فنسبوه إلى الجنون فحملوه إلى ولي أمرهم فسأله عن شأنه وخبره حتى أخبرهم بأمره وهو متحير في حاله وما هو فيه فلما أعلمهم بذلك قاموا معه إلى الكهف - ملك البلد وأهلها - حتى انتهى بهم إلى الكهف فقال لهم: دعوني حتى أتقدمكم في الدخول لأعلم أصحابي فدخل فيقال إنهم لا يدرون كيف ذهب فيه وأخفى الله عليهم خبرهم ويقال بل دخلوا عليهم ورأوهم وسلم عليهم الملك واعتنقهم وكان مسلمًا فيما قيل واسمه يندوسيس ففرحوا به وآنسوه بـالكلام ثم ودعوه وسلموا عليه وعادوا إلى مضاجعهم وتوفاهم الله عز وجل فالله أعلم.قال قتادة: غزا ابن عباس مع حبيب بن مسلمة فمروا بكهف في بلاد الروم فرأوا فيه عظامًا فقال قائل: هذه عظام أهل الكهف فقال ابن عباس: لقد بليت عظامهم من أكثر من ثلثمائة سنة رواه ابن جرير وقوله \" وكذلك أعثرنا عليهم \" أي كما أرقدناهم وأيقظناهم بهيئاتهم أطلعنا عليهم أهل ذلك الزمان \" ليعلموا أن وعد الله حق وأن الساعة لا ريب فيها إذ يتنازعون بينهم أمرهم \" أي في أمر القيامة فمن مثبت لها ومن منكر فجعل الله ظهورهم على أصحاب الكهف حجة لهم وعليهم \" فقالوا ابنوا عليهم بنيانا ربهم أعلم بهم\" أي سدوا عليهم باب كهفهم وذروهم على حالهم \" قال الذين غلبوا على أمرهم لنتخذن عليهم مسجدا \" حكى ابن جرير في القائلين ذلك قولين \"أحدهما\" إنهم المسلمون منهم \"والثاني\" أهل الشرك منهم فالله أعلم والظاهر أن الذين قالوا ذلك هم أصحاب الكلمة والنفوذ ولكن هل هم محمودون أم لا ؟ فيه نظر لأن النبي صلى الله عليه وسلم قال \" لعن الله اليهود والنصارى اتخذوا قبور أنبيائهم وصالحيهم مساجد \"يحذر ما فعلوا وقد روينا عن أمير المؤمنين عمر بن الخطاب رضي الله عنه أنه لما وجد قبر دانيال في زمانه بالعراق أمر أن يُخفى عن الناس وأن تدفن تلك الرقعة التي وجدوها عنده فيها شيء من الملاحم وغيرها."
    },
    {
      "ayah": 22,
      "surah": 18,
      "text": "يقول تعالى مخبرًا عن اختلاف الناس في عدة أصحاب الكهف فحكى ثلاثة أقوال فدل على أنه لا قائل برابع ولما ضعف القولين الأولين بقوله \" رجما بالغيب \" أي قولا بلا علم كمن يرمي إلى مكان لا يعرفه فإنه لا يكاد يصيب وإن أصاب فبلا قصد ثم حكى الثالث وسكت عليه أو قرره بقوله \" وثامنهم كلبهم \" فدل على صحته وأنه هو الواقع في نفس الأمر.وقوله \" قل ربي أعلم بعدتهم \" إرشاد إلى أن الأحسن في مثل هذا المقام رد العلم إلى الله تعالى إذ لا احتياج إلى الخوض في مثل ذلك بلا علم لكن إذا أطلعنا على أمر قلنا به وإلا وقفنا وقوله \" ما يعلمهم إلا قليل \" أي من الناس.قال قتادة قال ابن عباس أنا من القليل الذي استثنى الله عز وجل كانوا سبعة وكذا روى ابن جرير عن عطاء الخراساني عنه أنه كان يقول أنا ممن استثنى الله عز وجل ويقول عدتهم سبعة.وقال ابن جرير: حدثنا ابن بشار حدثنا عبد الرحمن حدثنا إسرائيل عن سماك عن عكرمة عن ابن عباس \" ما يعلمهم إلا قليل \" قال أنا من القليل كانوا سبعة فهذه أسانيد صحيحة إلى ابن عباس أنهم كانوا سبعة وهو موافق لما قدمناه. وقال محمد بن إسحاق بن يسار عن عبد الله بن أبي نجيح عن مجاهد قال: لقد حدثت أنه كان على بعضهم من حداثة سنه وضح الورق.قال ابن عباس: فكانوا كذلك ليلهم ونهارهم في عبادة الله يبكون ويستغيثون بالله وكانوا ثمانية نفر: مكسلمينا وكان أكبرهم وهو الذي كلم الملك عنهم ويمليخا ومرطونس وكسطونس وبيرونس ودنيموس ويطبونس وقالوش هكذا وقع في هذه الرواية ويحتمل أن هذا من كلام ابن إسحاق ومن بينه وبينه فإن الصحيح عن ابن عباس أنهم كانوا سبعة وهو ظاهر الآية وقد تقدم عن شعيب الجبائي أن اسم كلبهم حمران وفي تسميتهم بهذه الأسماء واسم كلبهم نظر في صحته والله أعلم فإن غالب ذلك متلقى من أهل الكتاب وقد قال تعالى \" فلا تمار فيهم إلا مراء ظاهرًا \" أي سهلا هينًا فإن الأمر في معرفة ذلك لا يترتب عليه كبير فائدة \" ولا تستفت فيهم منهم أحدا \" أي فإنهم لا علم لهم بذلك الا ما يقولونه من تلقاء أنفسهم رجمًا بالغيب أي من غير استناد إلى كلام معصوم وقد جاءك الله يامحمد بالحق الذي لاشك فيه ولا مرية فيه فهو المقدم الحاكم على كل ما تقدمه من الكتب والأقوال."
    },
    {
      "ayah": 23,
      "surah": 18,
      "text": "هذا إرشاد من الله تعالى لرسول الله صلى الله عليه وسلم إلى الأدب فيما إذا عزم على شيء ليفعله في المستقبل أن يرد ذلك إلى مشيئة الله عز وجل علام الغيوب الذي يعلم ما كان وما يكون وما لم يكن لو كان كيف يكون كما ثبت في الصحيحين عن أبي هريرة عن رسول الله صلى الله عليه وسلم أنه قال \" قال سليمان بن داود لأطوفن الليلة علي سبعين امرأة - وفي رواية تسعين امرأة وفي رواية مائة امرأة - تلد كل امرأة منهن غلاما يقاتل في سبيل الله فقيل له - وفي رواية قال له الملك - قل إن شاء الله فلم يقل فطاف بهن فلم يلد منهن إلا امرأة واحدة نصف إنسان فقال رسول الله صلى الله عليه وسلم: والذي نفسي بيده لو قال إن شاء الله لم يحنث وكان دركا لحاجته \"وفي رواية \" ولقاتلوا في سبيل الله فرسانا أجمعين \"وقد تقدم في أول السورة ذكر سبب نزول هذه الآية في قول النبي صلى الله عليه وسلم لما سئل عن قصة أصحاب الكهف \" غدا أجيبكم \"فتأخر الوحي خمسة عشر يوما وقد ذكرناه بطوله في أول السورة فأغنى عن إعادته."
    },
    {
      "ayah": 24,
      "surah": 18,
      "text": "وقوله \" واذكر ربك إذا نسيت \" قيل معناه إذا نسيت الاستثناء فاستثن عند ذكرك له قاله أبو العالية والحسن البصري وقال هشيم عن الأعمش عن مجاهد عن ابن عباس في الرجل يحلف قال له أن يستثني ولو إلى سنة وكان يقول \" واذكر ربك إذا نسيت \": ذلك قيل للأعمش سمعته عن مجاهد فقال حدثني به ليث بن أبي سليم يرى ذهب كسائي هذا ورواه الطبراني من حديث أبي معاوية عن الأعمش به. ومعنى قول ابن عباس أنه يستثني ولو بعد سنة أي إذا نسي أن يقول في حلفه وفي كلامه إن شاء الله وذكر ولو بعد سنة فالسنة له أن يقول ذلك ليكون آتيًا بسنة الاستثناء حتى ولو كان بعد الحنث قال ابن جرير رحمه الله: ونص على ذلك لا أن يكون رافعا لحنث اليمين ومسقطًا للكفارة وهذا الذي قاله ابن جرير رحمه الله هو الصحيح وهو الأليق بحمل كلام ابن عباس عليه والله أعلم وقال عكرمة \" واذكر ربك إذا نسيت \" إذا غضبت وقال الطبراني: حدثنا محمد بن الحارث الجبلي حدثنا صفوان بن صالح حدثنا الوليد بن مسلم عن عبد العزيز بن حصين عن ابن أبي نجيح عن مجاهد عن ابن عباس في قوله \"و لا تقولن لشيء إني فاعل ذلك غدًا إلا أن يشاء الله واذكر ربك إذا نسيت \" أن تقول إن شاء الله وروى الطبراني أيضا عن ابن عباس في قوله \" واذكر ربك إذا نسيت \" الاستثناء فاستثن إذا ذكرت وقال هي خاصة برسول الله صلى الله عليه وسلم وليس لأحد منا أن يستثني إلا في صلة من يمينه ثم قال انفرد به الوليد عن عبد العزيز بن الحصين ويحتمل في الآية وجه آخر وهو أن يكون الله تعالى قد أرشد من نسي الشيء في كلامه إلى ذكر الله تعالى لأن النسيان منشؤه من الشيطان كما قال فتى موسى وما \" أنسانيه إلا الشيطان أن أذكره \" وذكر الله تعالى يطرد الشيطان فإذا ذهب الشيطان ذهب النسيان فذكر الله سبب للذكر ولهذا قال \" واذكر ربك إذا نسيت \" وقوله \" وقل عسى أن يهدين ربي لأقرب من هذا رشدًا \" أي إذا سئلت عن شيء لا تعلمه فاسأل الله تعالى فيه وتوجه إليه في أن يوفقك للصواب والرشد في ذلك وقيل في تفسيره غير ذلك والله أعلم."
    },
    {
      "ayah": 25,
      "surah": 18,
      "text": "هذا خبر من الله تعالى لرسوله صلى الله عليه وسلم بمقدار ما لبث أصحاب الكهف في كهفهم منذ أرقدهم إلى بعثهم الله وأعثر عليهم أهل الزمان وأنه كان مقداره ثلثمائة سنة تزيد تسع سنين بالهلالية وهي ثلاثمائة سنة بالشمسية فإن تفاوت ما بين كل ثلثمائة سنة بالقمرية إلى الشمسية ثلاث سنين فلهذا قال بعد الثلثمائة وازدادوا تسعًا."
    },
    {
      "ayah": 26,
      "surah": 18,
      "text": "وقوله \" قل الله أعلم بما لبثوا \" أي إذا سئلت عن لبثهم وليس عندك علم في ذلك وتوقيف من الله تعالى فلا تتقدم فيه بشيء بل قل في مثل هذا \" الله أعلم بما لبثوا له غيب السموات والأرض \" أي لا يعلم ذلك إلا هو ومن أطلعه عليه من خلقه وهذا الذي قلناه عليه غير واحد من علماء التفسير كمجاهد وغير واحد من السلف والخلف وقال قتادة في قوله \" ولبثوا في كهفهم ثلاثمائة سنين \" الآية هذا قول أهل الكتاب وقد رده الله تعالى بقوله \" قل الله أعلم بما لبثوا \" قال وفي قراءة عبد الله وقالوا ولبثوا يعني أنه قاله الناس وهكذا قال قتادة ومطرف بن عبد الله وفي هذا الذي زعمه قتادة نظر فإن الذي بأيدي أهل الكتاب أنهم لبثوا ثلثمائة سنة من غير تسع يعنون بالشمسية ولو كان الله قد حكى قولهم لما قال \" وازدادوا تسعا \" والظاهر من الآية إنما هو إخبار من الله لا حكاية عنهم وهذا اختيار ابن جرير رحمه الله ورواية قتادة قراءة ابن مسعود منقطعة ثم هي شاذة بالنسبة إلى قراءة الجمهور فلا يحتج بها والله أعلم وقوله \" أبصر به وأسمع \" أي أنه لبصير بهم سميع لهم.قال ابن جرير: وذلك في معنى المبالغة في المدح كأنه قيل ما أبصره وأسمعه وتأويل الكلام ما أبصر الله لكل موجود وأسمعه لكل مسموع لا يخفى عليه من ذلك شيء.ثم روى عن قتادة في قوله \" أبصر به وأسمع \" فلا أحد أبصر من الله ولا أسمع وقال ابن زيد \" أبصر به وأسمع \" يرى أعمالهم ويسمع ذلك منهم سميعًا بصيرًا.وقوله \" ما لهم من دونه من ولي ولا يشرك في حكمه أحدًا \" أي أنه تعالى هو الذي له الخلق والأمر الذي لا معقب لحكمه وليس له وزير ولا نصير ولا شريك ولا مشير تعالى وتقدس."
    },
    {
      "ayah": 27,
      "surah": 18,
      "text": "يقول تعالى آمرا رسوله صلى الله عليه وسلم بتلاوة كتابه العزيز وإبلاغه إلى الناس \" لا مبدل لكلماته\" أي لا مغير لها ولا محرف ولا مزيل.وقوله \" ولن تجد من دونه ملتحدًا \" عن مجاهد ملتحدًا قال ملجأ وعن قتادة وليًا ولا مولى قال ابن جرير: مقول إن أنت يا محمد لم تتل ما أوحي إليك من كتاب ربك فإنه لا ملجأ لك من الله كما قال تعالى \" يا أيها الرسول بلغ ما أنزل إليك من ربك وإن لم تفعل فما بلغت رسالته والله يعصمك من الناس \" وقال \" إن الذي فرض عليك القرآن لرادك إلى معاد \" أي سائلك عما فرض عليك من إبلاغ الرسالة."
    },
    {
      "ayah": 28,
      "surah": 18,
      "text": "وقوله \" واصبر نفسك مع الذين يدعون ربهم بالغداة والعشي يريدون وجهه \" أي اجلس مع الذين يذكرون الله ويهللونه ويحمدونه ويسبحونه ويكبرونه ويسألونه بكرة وعشيًا من عباد الله سواء كانوا فقراء أو أغنياء أو أقوياء أو ضعفاء يقال إنها نزلت في أشراف قريش حين طلبوا من النبي صلى الله عليه وسلم أن يجلس معهم وحده ولا يجالسهم بضعفاء أصحابه كبلال وعمار وصهيب وخباب وابن مسعود وليفرد أولئك بمجلس على حدة فنهاه الله عن ذلك فقال \" ولا تطرد الذين يدعون ربهم بالغداة والعشي \" الآية وأمره أن يصبر نفسه في الجلوس مع هؤلاء فقال \" واصبر نفسك مع الذين يدعون ربهم بالغداة والعشي \" الآية وقال مسلم في صحيحه: حدثنا أبو بكر بن أبي شيبة حدثنا محمد بن عبد الله الأسدي عن إسرائيل عن المقدام بن شريح عن أبيه عن سعد هو ابن أبي وقاص قال: كنا مع النبي صلى الله عليه وسلم ستة نفر فقال المشركون للنبي صلى الله عليه وسلم: اطرد هؤلاء لا يجترئون علينا قال: وكنت أنا وابن مسعود ورجل من هذيل وبلال ورجلان نسيت اسميهما فوقع في نفس رسول الله صلى الله عليه وسلم ما شاء الله أن يقع فحدث نفسه فأنزل الله عز وجل \"ولا تطرد الذين يدعون ربهم بالغداة والعشي يريدون وجهه\" انفرد بإخراجه مسلم دون البخاري وقال الإمام أحمد: حدثنا محمد بن جعفر حدثنا شعبة عن أبي التياح قال سمعت أبا الجعد يحدث عن أبي أمامة قال: خرج رسول الله صلى الله عليه وسلم على قاص يقص فأمسك فقال رسول الله صلى الله عليه وسلم قص فلإن أقعد غدوة إلى أن تشرق الشمس أحب إلي من أن أعتق أربع رقاب \"وقال أحمد أيضًا: حدثنا هاشم ثنا شعبة عن عبد الملك بن ميسرة قال سمعت كردوس بن قيس وكان قاص العامة بالكوفة يقول: أخبرني رجل من أصحاب بدر أنه سمع النبي صلى الله عليه وسلم يقول \" لإن أقعد في مثل هذا المجلس أحب إلي من أن أعتق أربع رقاب \"قال شعبة فقلت أي مجلس قال كان قاصًا وقال أبو داود الطيالسي في مسنده: حدثنا محمد حدثنا يزيد بن أبان عن أنس قال: قال رسول الله صلى الله عليه وسلم \" لإن أجالس قومًا يذكرون الله من صلاة الغداة إلى طلوع الشمس أحب إلي مما طلعت عليه الشمس ولأن أذكر الله من صلاة العصر إلى غروب الشمس أحب إلي من أن أعتق ثمانيةمن ولد إسماعيل دية كل واحد منهم اثنا عشر ألفًا \"فحسبنا دياتهم ونحن في مجلس أنس فبلغت ستة وتسعين ألفًا وههنا من يقول أربعة من ولد إسماعيل والله ما قال إلاثمانية دية كل واحد منهم اثنا عشر ألفًا وقال الحافظ أبو بكر البزار: حدثنا محمد بن إسحاق الأهوازي حدثنا أبو أحمد الزبيري حدثنا عمرو بن ثابت عن علي بن الأقمر عن الأغر أبي مسلم وهو الكوفي أن رسول الله صلى الله عليه وسلم مر برجل يقرأ سورة الكهف فلما رأى النبي صلى الله عليه وسلم سكت فقال النبي صلى الله عليه وسلم \" هذا المجلس الذي أمرت أن أصبر نفسي معهم \"هكذا رواه أبو أحمد عن عمرو بن ثابت عن علي بن الأقمر عن الأغر مرسلا وحدثنا يحيى بن المعلى عن منصور حدثنا محمد بن الصلت حدثنا عمرو بن ثابت عن علي بن الأقمر عن الأغر أبي مسلم عن أبي هريرة وأبي سعيد قالا: جاء رسول الله صلى الله عليه وسلم ورجل يقرأ سورة الحج أو سورة الكهف فسكت فقال رسول الله صلى الله عليه وسلم هذا المجلس الذي أمرت أن أصبر نفسي معهم وقال الإمام أحمد ثنا محمد بن بكير ثنا ميمون المرئي ثنا ميمون بن سياه عن أنس ابن مالك رضي الله عنه عن رسول الله صلى الله عليه وسلم قال \" مامن قوم اجتمعوا يذكرون الله لا يريدون بذلك إلا وجهه إلا ناداهم مناد من السماء أن قوموا مغفورًا لكم قد بدلت سيئاتكم حسنات \"تفرد به أحمد رحمه الله وقال الطبراني ثنا إسماعيل بن الحسن ثنا أحمد بن صالح ثنا ابن وهب عن أسامة بن زيد عن أبي حازم عن عبد الرحمن بن سهل ابن حنيف قال: نزلت على رسول الله صلى الله عليه وسلم وهو في بعض أبياته \" واصبر نفسك مع الذين يدعون ربهم بالغداة والعشي \" الآية فخرج يلتمسهم فوجد قومًا يذكرون الله تعالى منهم ثائر الرأس وجاف الجلد وذو الثوب الواحد فلما رآهم جلس معهم وقال \" الحمد لله الذي جعل في أمتي من أمرني أن أصبر نفسي معهم \"عبد الرحمن هذا ذكره أبو بكر بن أبي داود في الصحابة وأما أبوه فمن سادات الصحابة رضي الله عنهم وقوله \" ولا تعد عيناك عنهم تريد زينة الحياة الدنيا \" قال ابن عباس: ولا تجاوزهم إلى غيرهم يعني تطلب بدلهم أصحاب الشرف والثروة \" ولا تطع من أغفلنا قلبه عن ذكرنا \" أي شغل عن الدين وعبادة ربه بالدنيا \" وكان أمره فرطًا \" أي أعماله وأفعاله سفه وتفريط وضياع ولا تكن مطيعًا له ولا محبًا لطريقته ولا تغبطه بما هو فيه كما قال \" ولا تمدّنّ عينيك إلى ما متعنا به أزواجا منهم زهرة الحياة الدنيا لنفتنهم فيه ورزق ربك خير وأبقى \"."
    },
    {
      "ayah": 29,
      "surah": 18,
      "text": "يقول تعالى لرسوله محمد صلى الله عليه وسلم: وقل يا محمد للناس هذا الذى جئتكم به من ربكم هو الحق الذي لا مرية فيه ولا شك \" فمن شاء فليؤمن ومن شاء فليكفر \" هذا من باب التهديد والوعيد الشديد ولهذا قال \" إنا أعتدنا \" أي أرصدنا \" للظالمين \" وهم الكافرون بالله ورسوله وكتابه \" نارًا أحاط بهم سرادقها \" أي سورها قال الإمام أحمد حدثنا حسن بن موسى حدثنا ابن لهيعة حدثنا دراج عن أبي الهيثم عن أبي سعيد الخدري عن رسول الله صلى الله عليه وسلم أنه قال \" لسرادق النار أربعة جدر كثافة كل جدار مسافة أربعين سنة \"وأخرجه الترمذي في صفة النار وابن جرير في تفسيره من حديث دراج أبي السمح به. وقال ابن جريج قال ابن عباس \" أحاط بهم سرادقها \" قال حائط من نار وقال ابن جرير: حدثني الحسين بن نصر والعباس بن محمد قالا: حدثنا أبو عاصم عن عبدالله بن أمية حدثني محمد بن حيي بن يعلى عن صفوان بن يعلى عن يعلى بن أمية قال: قال رسول الله صلى الله عليه وسلم \" البحر هو جهنم \"قال فقيل له كيف ذلك ؟ فتلا هذه الآية أو قرأ هذه الآية \" نارا أحاط بهم سرادقها \" ثم قال \" والله لا أدخلها أبدًا أو ما دمت حيًا لا تصيبني منها قطرة \"وقوله \" وإن يستغيثوا يغاثوا بماء كالمهل يشوي الوجوه \" الآية قال ابن عباس.المهل الماء الغليظ مثل دردي الزيت وقال مجاهد: هو كالدم والقيح وقال عكرمة: هو الشيء الذي انتهى حره وقال آخرون: هو كل شيء أذيب. وقال قتادة: أذاب ابن مسعود شيئا من الذهب في أخدود فلما انماع وأزبد قال: هذا أشبه شيء بالمهل وقال الضحاك: ماء جهنم أسود وهي سوداء وأهلها سود وهذه الأقوال ليس شيء منها ينفي الأخر فإن المهل يجمع هذه الأوصاف الرذيلة كلها فهو أسود منتن غليظ حار ولهذا قال \" يشوي الوجوه\" أي من حره إذا أراد الكافر أن يشربه وقربه من وجهه شواه حتى تسقط جلدة وجهه فيه كما جاء في الحديث الذي رواه الإمام أحمد بإسناده المتقدم في سرادق النار عن أبي سعيد الخدري عن رسول الله صلى الله عليه وسلم أنه قال \" ماء كالمهل \"قال كعكر الزيت فإذا قربه إليه سقطت فروة وجهه فيه وهكذا رواه الترمذي في صفة النار من جامعه من حديث رشدين بن سعد عن عمرو بن الحارث عن دراج به ثم قال: لا نعرفه إلا من حديث رشدين وقد تكلم فيه من قبل حفظه هكذا قال: وقد رواه الإمام أحمد كما تقدم عن حسن الأشيب عن ابن لهيعة عن دراج والله أعلم.وقال عبدالله بن المبارك وبقية بن الوليد عن صفوان بن عمرو عن عبدالله بن بشر عن أبي أمامة عن النبي صلى الله عليه وسلم في قوله \" ويسقى من ماء صديد يتجرعه \" قال \" يقرب إليه فيتكرهه فإذا قرب منه شوى وجهه ووقعت فروة رأسه فإذا شربه قطع أمعاءه يقول الله تعالى \"وإن يستغيثوا يغاثوا بماء كالمهل يشوي الوجوه بئس الشراب \" وقال سعيد بن جبير: إذا جاع أهل النار استغاثوا فأغيثوا بشجرة الزقوم فيأكلون منها فاختلبت جلود وجوههم فلو أن مارا مر بهم يعرفهم لعرف جلود وجوههم فيها ثم يصب عليم العطش فيستغيثون فيغاثون بماء كالمهل وهو الذي قد انتهى حره فإذا أدنوه من أفواههم اشتوى من حره لحوم وجوههم التي قد سقطت عنها الجلود ولهذا قال تعالى بعد وصفه هذا الشراب بهذه الصفات الذميمة القبيحة \" بئس الشراب \" أي بئس هذا الشراب كما قال في الآية الأخرى \" وسقوا ماء حميما فقطع أمعاءهم \" وقال تعالى \" تسقى من عين آنية \" أي حارة كما قال تعالى \" وبين حميم آن \" \" وساءت مرتفقا\" أي وساءت النار منزلاً ومقيلاً ومجتمعًا وموضعًا للارتفاق كما قال في الآية الأخرى \" إنها ساءت مستقرا ومقاما \"."
    },
    {
      "ayah": 3,
      "surah": 18,
      "text": "\"ماكثين فيه \" في ثوابهم عند الله وهو الجنة خالدين فيه أبدا دائما لا زوال له ولا انقضاء."
    },
    {
      "ayah": 30,
      "surah": 18,
      "text": "لما ذكر تعالى حال الأشقياء ثنى بذكر السعداء الذين آمنوا بالله وصدقوا المرسلين فيما جاءوا به وعملوا بما أمروهم به من الأعمال الصالحة فلهم جنات عدن والعدن الإقامة."
    },
    {
      "ayah": 31,
      "surah": 18,
      "text": "\" تجري من تحتهم الأنهار\" أي من تحت غرفهم ومنازلهم.قال فرعون وهذه الأنهار تجري من تحتي الآية \" يحلون \" أي من الحلية \" فيها من أساور من ذهب \" وقال في المكان الآخر \" ولؤلؤا ولباسهم فيها حرير \" وفصله ههنا فقال \" ويلبسون ثيابا خضرا من سندس وإستبرق \" فالسندس ثياب رفاع رقاق كالقمصان وما جرى مجراها.وأما الإستبرق فغليظ الديباج وفيه بريق وقوله \" متكئين فيها على الأرائك \" الاتكاء قيل الاضطجاع وقيل التربع في الجلوس وهو أشبه بالمراد ههنا ومنه الحديث الصحيح \" أما أنا فلا آكل متكئًا \"فيه القولان.والأرائك جمع أريكة وهي السرير تحت الحجلة والحجلة كما يعرفه الناس في زماننا هذا بالبشخانة والله أعلم.قال عبد الرزاق أخبرنا معمر عن قتادة \" على الأرائك \" قال هي الحجال قال معمر وقال غيره السرر في الحجال.وقوله \" نعم الثواب وحسنت مرتفقا \" أي نعمت الجنة ثوابًا على أعمالهم وحسنت مرتفقًا أي حسنت منزلا ومقيلاً ومقامًا كما قال في النار \" بئس الشراب وساءت مرتفقا \" وهكذا قابل بينهما في سورة الفرقان في قوله \" إنها ساءت مستقرا ومقامًا \" ثم ذكر صفات المؤمنين فقال \" أولئك يجزون الغرفة بما صبروا ويلقون فيها تحية وسلاما خالدين فيها حسنت مستقرا ومقاما \"."
    },
    {
      "ayah": 32,
      "surah": 18,
      "text": "يقول تعالى بعد ذكره المشركين المستكبرين عن مجالسة الضعفاء والمساكين من المسلمين وافتخروا عليهم بأموالهم وأحسابهم فضرب لهم ولهم مثلا برجلين جعل الله لأحدهما جنتين أي بستانين من أعناب محفوفتين بالنخيل المحدقة في جنباتهما وفي خلالهما الزروع وكل من الأشجار والزروع مثمر مقبل في غاية الجودة."
    },
    {
      "ayah": 33,
      "surah": 18,
      "text": "ولهذا قال: \" كلتا الجنتين آتت أكلها \" أي أخرجت ثمرها \" ولم تظلم منه شيئًا \" أي ولم تنقص منه شيئًا \" وفجرنا خلالهما نهرًا \" أي والأنهار متفرقة فيهما ههنا وهنها."
    },
    {
      "ayah": 34,
      "surah": 18,
      "text": "\"وكان له ثمر \" قيل المراد به المال روي عن ابن عباس ومجاهد وقتادة وقيل الثمار وهو أظهر ههنا ويؤيده القراءة الأخرى وكان له ثمر بضم الثاء وتسكين الميم فيكون جمع ثمرة كخشبة وخشب.وقرأ آخرون ثمر بفتح الثاء والميم فقال أي صاحب هاتين الجنتين لصاحبه وهو يحاوره أي يجادله ويخاصمه يفتخر عليه ويترأس \" أنا أكثر منك مالا وأعز نفرًا \" أي أكثر خدمًا وحشمًا وولدًا قال قتادة تلك والله أمنية الفاجر كثرة المال وعزة النفر."
    },
    {
      "ayah": 35,
      "surah": 18,
      "text": "وقوله \" ودخل جنته وهو ظالم لنفسه \" أي بكفره وتمرده أي بكفره وتمرده وتكبره وتجبره وإنكاره المعاد قال \" ما أظن أن تبيد هذه أبدًا \" وذلك اغترار منه لما رأى فيها من الزروع والثمار والأشجار والأنهار المطردة في جوانبها وأرجائها ظن أنها لا تفنى ولا تفرغ ولا تهلك ولاتتلف وذلك لقلة عقله وضعف يقينه بالله وإعجابه بالحياة الدنيا وزينتها وكفره بالآخرة."
    },
    {
      "ayah": 36,
      "surah": 18,
      "text": "ولهذا قال \" وما أظن الساعة قائمة\" أي كائنة \" ولئن رددت إلى ربي لأجدن خيرًا منها منقلبًا \" أي ولئن كان معاد ورجعة ومرد إلى الله ليكونن لي هناك أحسن من هذا الحظ عند ربي ولولا كرامتي عليه ما أعطاني هذا كما قال في الآية الأخرى \" ولئن رجعت إلى ربي إن لي عنده للحسنى \" وقال \" أفرأيت الذي كفر بآياتنا وقال لأوتين مالاً وولدًا \" أي في الدار الآخرة تألى على الله عز وجل.وكان سبب نزولها في العاص بن وائل كما سيأتي بيانه في موضعه إن شاء الله وبه الثقة وعليه التكلان."
    },
    {
      "ayah": 37,
      "surah": 18,
      "text": "يقول تعالى مخبرًا عما أجابه به صاحبه المؤمن واعظًا له وزاجرًا عما هو فيه من الكفر بالله والاغترار \" أكفرت بالذي خلقك من تراب \" الآية وهذا إنكار وتعظيم لما وقع فيه من جحود ربه الذي خلقه وابتدأ خلق الإنسان من طين وهو آدم ثم جعل نسله من سلالة من ماء مهين كما قال تعالى: \" كيف تكفرون بالله وكنتم أمواتًا فأحياكم \" الآية أي كيف تجحدون ربكم ودلالته عليكم ظاهرة جلية كل أحد يعلمها من نفسه فإنه ما من أحد من المخلوقات إلا ويعلم أنه كان معدومًا ثم وجد وليس وجوده من نفسه ولا مستندًا إلى شيء من المخلوقات لأنه بمثابته فعلم إسناد إيجاده إلى خالقه وهو الله لا إله إلا هو خالق كل شيء ولهذا قال المؤمن."
    },
    {
      "ayah": 38,
      "surah": 18,
      "text": "\"لكنا هو الله ربي \" أي لكن أنا لا أقول بمقالتك بل أعترف لله بالوحدانية والربوبية \" ولا أشرك بربي أحدًا \" أي بل هو الله المعبود وحده لا شريك له."
    },
    {
      "ayah": 39,
      "surah": 18,
      "text": "ثم قال \" ولولا إذ دخلت جنتك قلت ما شاء الله لا قوة إلا بالله إن ترن أنا أقل منك مالاً وولدًا \" هذا تحضيض وحث على ذلك أي هلا إذا أعجبتك حين دخلتها ونظرت إليها حمدت الله على ما أنعم به عليك وأعطاك من المال أو لولد ما لم يعطه غيرك وقلت ما شاء الله لا قوة إلا بالله ولهذا قال بعض السلف: من أعجبه شيء من حاله أو ماله أو ولده فليقل ما شاء الله لا قوة إلا بالله وهذا مأخوذ من هذه الآية الكريمة وقد روي فيه حديث مرفوع أخرجه الحافظ أبو يعلى الموصلي في مسنده حدثنا جراح بن مخلد حدثنا عمربن يونس حدثنا عيسى بن عون حدثنا عبد الملك بن زرارة عن أنس رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم \" ما أنعم الله على عبد نعمة من أهل أو مال أو ولد فيقول ما شاء الله لا قوة إلا بالله فيرى فيه آفة دون الموت \" وكان يتأول هذه الآية \" ولولا إذ دخلت جنتك قلت ما شاء الله لا قوة إلا بالله \" قال الحافظ أبو الفتح الأزدي عيسى بن عون عن عبد الملك بن زرارة عن أنس لا يصح حديثه.وقال الإمام أحمد: حدثنا محمد بن جعفر حدثنا شعبة وحجاج حدثني شعبة عن عاصم بن عبيد الله عن عبيد مولى أبي رهم عن أبي هريرة عن النبي صلى الله عليه وسلم أنه قال \" ألا أدلك على كنز من كنوز الجنة ؟ لاحول ولاقوة إلا بالله \"تفرد به أحمد وقد ثبت في الصحيح عن أبي موسى أن رسول الله صلى الله عليه وسلم قال له \" ألا أدلك على كنز من كنوز الجنة ؟ لا حول ولا قوة إلا بالله \"وقال الإمام أحمد: حدثنا بكير بن عيسى حدثنا أبو عوانة عن أبي بلخ عن عمرو بن ميمون قال: قال أبو هريرة قال لي رسول الله صلى الله عليه وسلم \" يا أبا هريرة ألا أدلك على كنز من كنوز الجنة تحت العرش \"؟ قال قلت فداك أبي وأمي قال \" أن تقول لاقوة إلا بالله \" قال أبو بلخ وأحسب أنه قال \" فإن الله يقول أسلم عبدي واستسلم \"قال فقلت لعمرو قال أبو بلخ قال عمرو قلت لأبي هريرة لا حول ولا قوة إلا بالله فقال لا إنها في سورة الكهف \" ولولا إذ دخلت جنتك قلت ما شاء الله لا قوة إلا بالله \"."
    },
    {
      "ayah": 4,
      "surah": 18,
      "text": "وقوله \" وينذر الذين قالوا اتخذ الله ولدًا \" قال ابن إسحاق وهم مشركو العرب في قولهم نحن نعبد الملائكة وهم بنات الله."
    },
    {
      "ayah": 40,
      "surah": 18,
      "text": "وقوله: \" فعسى ربي أن يؤتين خيرًا من جنتك \" أي في الدار الآخرة \" ويرسل عليها \" أي على جنتك في الدنيا التي ظننت أنها لا تبيد ولا تفنى \" حسبانًا من السماء \" قال ابن عباس والضحاك وقتادة ومالك عن الزهري أي عذابًا من السماء والظاهر أنه مطر عظيم مزعج يقلع زرعها وأشجارها ولهذا قال \" فتصبح صعيداً زلقًا \" أي بلقعًا ترابًا أملس لا يثبت فيه قدم وقال ابن عباس: كالجرز الذي لا ينبت شيئًا."
    },
    {
      "ayah": 41,
      "surah": 18,
      "text": "وقوله: \"أو يصبح ماؤها غورًا \" أي غائرا في الأرض وهو ضد النابع الذي يطلب وجه الأرض فالغائر يطلب أسفلها كما قال تعالى: \" قل أرأيتم إن أصبح ماؤكم غورًا فمن يأتيكم بماء معين \" أي جارٍ وسائجٍ وقال ههنا \" أو يصبح ماؤها غورًا فلن تستطيع له طلبًا \" والغور مصدر بمعنى غائر وهو أبلغ منه كما قال الشاعر: تظل جياده نوحًا عليه تقلده أعنتها صفوفًا بمعنى نائحات عليه."
    },
    {
      "ayah": 42,
      "surah": 18,
      "text": "يقول تعالى \" وأحيط بثمره\" بأمواله أو بثماره على القول الآخر والمقصود أنه وقع بهذا الكافر ما كان يحذر مما خوفه به المؤمن من إرسال الحسبان على جنته التي اغتر بها وألهته عن الله عز وجل \" فأصبح يقلب كفيه على ما أنفق فيها \" وقال قتادة يصفق كفيه متأسفًا متلهفًا على الأموال التي أذهبها عليها \" ويقول يا ليتني لم أشرك بربي أحدًا."
    },
    {
      "ayah": 43,
      "surah": 18,
      "text": "ولم تكن له فئة \" أي عشيرة أو ولد كما افتخر بهم واستعز \" ينصرونه من دون الله وما كان منتصرًا هنالك الولاية لله الحق \" اختلف القراء ههنا فمنهم من يقف على قوله \" وما كان منتصرًا هنالك \" أي في ذلك الموطن الذي حل به عذاب الله فلا منقذ له منه."
    },
    {
      "ayah": 44,
      "surah": 18,
      "text": "ويبتدئ بقوله: \" الولاية لله الحق \" ومنهم من يقف على وما كان منتصرًا ويبتدئ بقوله هنالك الولاية لله الحق ثم اختلفوا في قراءة الولاية فمنهم من فتح الواو من الولاية فيكون المعنى هنالك الموالاة لله أي هنالك كل أحد مؤمن أو كافر يرجع إلى الله وإلى موالاته والخضوع له إذا وقع العذاب كقوله \" فلما رأوا بأسنا قالوا آمنا بالله وحده وكفرنا بما كنا به مشركين \" وكقوله إخبارًا عن فرعون \" حتى إذا أدركه الغرق قال آمنت أنه لا إله إلا الذي آمنت به بنو إسرائيل وأنا من المسلمين الآن وقد عصيت قبل وكنت من المفسدين \" ومنهم من كسر الواو من الولاية أي هنالك الحكم لله الحق ثم منهم من رفع الحق على أنه نعت للولاية كقوله تعالى \" الملك يومئذ الحق للرحمن وكان يومًا على الكافرين عسيرًا \" ومنهم من خفض القاف على أنه نعت لله عز وجل كقوله: \" ثم ردوا إلى الله مولاهم الحق \" الآية ولهذا قال تعالى \" هو خير ثوابًا \" أي جزاء \" وخير عقبًا \" أي الأعمال التي تكون لله عزو جل ثوابها خير وعاقبتها حميدة رشيدة كلها خير."
    },
    {
      "ayah": 45,
      "surah": 18,
      "text": "يقول تعالى \" واضرب \" يا محمد للناس مثل الحياة الدنيا في زوالها وفنائها وانقضائها \" كماء أنزلناه من السماء فاختلط به نبات الأرض \" أي ما فيها من الحب فشب وحسن وعلاه الزهر والنور والنضرة ثم بعد هذا كله \"أصبح هشيمًا \" يابسًا \" تذروه الرياح \" أي تفرقه وتطرحه ذات اليمين وذات الشمال \" وكان الله على كل شيء مقتدرًا \" أي هو قادر على هذه الحال وهذه الحال وكثيرًا ما يضرب الله مثل الحياة الدنيا بهذا المثل كما قال تعالى في سورة يونس \" إنما مثل الحياة الدنيا كماء أنزلناه من السماء فاختلط به نبات الأرض مما يأكل الناس والأنعام \" الآية وقال في الزمر \" ألم تر أن الله أنزل من السماء ماء فسلكه ينابيع في الأرض ثم يخرج به زرعًا مختلفًا ألوانه \" الآية وقال في سورة الحديد \" اعلموا أنما الحياة الدنيا لعب ولهو وزينة وتفاخر بينكم وتكاثر في الأموال والأولاد كمثل غيث أعجب الكفار نباته \" الآية وفي الحديث الصحيح \" الدنيا خضرة حلوة \"."
    },
    {
      "ayah": 46,
      "surah": 18,
      "text": "وقوله: \" المال والبنون زينة الحياة الدنيا \" كقوله: زين للناس حب الشهوات من النساء والبنين والقناطير المقنطرة من الذهب الآية وقال تعالى: \" إنما أموالكم وأولادكم فتنة والله عنده أجر عظيم \" أي الإقبال عليه والتفرغ لعبادته خير لكم من اشتغالكم بهم والجمع لهم والشفقة المفرطة عليهم ولهذا قال \" والباقيات الصالحات خير عند ربك ثوابًا وخير أملاً \" قال ابن عباس وسعيد بن جبير وغير واحد من السلف: الباقيات الصالحات الصلوات الخمس وقال عطاء بن أبي رباح وسعيد بن جبير عن ابن عباس: الباقيات الصالحات سبحان الله والحمد لله ولا إله إلا الله والله أكبر وهكذا سئل أمير المؤمنين عثمان بن عفان عن الباقيات الصالحات ما هي ؟ فقال: هي لا إله إلا الله وسبحان الله والحمد لله والله أكبر ولا حول ولا قوة إلا بالله العلي العظيم رواه الإمام أحمد حدثنا أبو عبد الله المقري حدثنا حيوة حدثنا أبو عقيل أنه سمع الحارت مولى عثمان رضي الله عنه يقول: جلس عثمان يومًا وجلسنا معه فجاءه المؤذن فدعا بماء في إناء أظنه سيكون فيه مدّ فتوضـأ ثم قال: رأيت رسول الله صلى الله عليه وسلم يتوضأ وضوئي هذا ثم قال \" من توضأ وضوئي هذا ثم قام فصلى صلاة الظهر غفر له ما كان بينها وبين الصبح ثم صلى العصر غفر له ما بينها وبين الظهر ثم صلى المغرب غفر له ما بينها وبين العصر ثم صلى العشاء غفر له ما بينها وبين المغرب ثم لعله يبيت يتمرغ ليلته ثم إن قام فتوضأ وصلى صلاة الصبح غفر له ما بينها وبين صلاة العشاء وهن الحسنات يذهبن السيئات \"قالوا هذه الحسنات فما الباقيات الصالحات يا عثمان ؟ قال: هي لا إله إلا الله وسبحان الله والحمد لله والله أكبر ولا حول ولا قوة إلا بالله العلي العظيم تفرد به وروى مالك عن عمارة بن عبد الله بن صياد عن سعيد بن المسيب قال: الباقيات الصالحات سبحان الله والحمد لله ولا إله إلا الله والله أكبر ولا حول ولا قوة إلا بالله.وقال محمد بن عجلان عن عمارة قال: سألني سعيد بن المسيب عن الباقيات الصالحات فقلت: الصلاة والصيام فقال: لم تصب فقلت الزكاة والحج فقال لم تصب ولكنهن الكلمات الخمس لا إله إلا الله والله أكبر وسبحان الله والحمد لله ولا حول ولا قوة إلا بالله.وقال ابن جُريج أخبرني عبد الله بن عثمان بن خيثم عن نافع عن سرجس أنه أخبره أنه سأل ابن عمر عن الباقيات الصالحات قال: لا إله إلا الله والله أكبر وسبحان الله ولا حول ولا قوة إلا بالله قال ابن جريج وقال عطاء بن أبي رباح مثل ذلك وقال مجاهد: الباقيات الصالحات سبحان الله والحمد لله ولا إله إلا الله والله أكبر.وقال عبد الرزاق: أخبرنا معمر عن الحسن وقتادة في قوله: \" والباقيات الصالحات \" قال: لا إله إلا الله والله أكبر والحمد لله وسبحان الله هن الباقيات الصالحات قال ابن جرير: وجدت في كتابي عن الحسن بن الصباح البزار عن أبي نصر التمار عن عبد العزيز بن مسلم عن محمد بن عجلان عن سعيد المقبري عن أبيه عن أبي هريرة قال: قال رسول الله صلى الله عليه وسلم \" سبحان الله والحمد لله ولا إله إلا الله والله أكبر \"هن الباقيات الصالحات قال: وحدثني يونس أخبرنا ابن وهب أخبرنا عمرو بن الحارث أن دراجًا أبا السمح حدثه عن ابن الهيثم عن أبي سعيد أن رسول الله صلى الله عليه وسلم قال: \" استكثروا من الباقيات الصالحات \"قيل وما هن يا رسول الله ؟ \" قال الملة \"قيل وما هي يا رسول الله ؟ قال \" التكبير والتهليل والتسبيح والحمد لله ولا حول ولا قوة إلا بالله \"وهكذا رواه أحمد من حديث دراج به. قال وهب أخبرني أبو صخر أن عبد الله بن عبد الرحمن مولى سالم بن عبد الله حدثه قال: أرسلني سالم إلى محمد بن كعب القرظي في حاجة فقال: قل له القني عند زاوية القبر فإن لي إليك حاجة قال: فالتقيا فسلم أحدهما على الآخر ثم قال سالم ما تعد الباقيات الصالحات ؟ فقال لا إله إلا الله والله أكبر وسبحان الله ولا حول ولا قوة إلابالله فقال له سالم: متى جعلت فيها لا حول ولا قوة إلا بالله ؟ قال: ما زلت أجعلها قال فراجعه مرتين أو ثلاثا فلم ينزع قال فأبيت ؟ قال سالم أجل فأبيت فإن أبا أيوب الأنصاري حدثني أنه سمع رسول الله صلى الله عليه وسلم هو يقول: \" عُرج بي إلى السماء فرأيت إبراهيم عليه السلام فقال يا جبريل من هذا الذي معك ؟ فقال محمد فرحب بي وسهل ثم قال مرأمتك فلتكثر من غراس الجنة فإن تربتها طيبة وأرضها واسعة فقلت وما غراس الجنة قال لا حول ولا قوة إلا بالله \". وقال الإمام أحمد حدثنا محمد بن يزيد عن العوام حدثني رجل من الأنصار من آل النعمان بن بشير قال خرج علينا رسول الله صلى الله عليه وسلم ونحن في المسجد بعد صلاة العشاء فرفع بصره إلى السماء ثم خفض حتى ظننا أنه قد حدث في السماء شيء ثم قال: \" أما أنه سيكون بعدي أمراء يكذبون ويظلمون فمن صدقهم بكذبهم ومالأهم على ظلمهم فليس مني ولست منه ومن لم يصدقهم بكذبهم ولم يمالئهم على ظلمهم فهو مني وأنا منه.ألا وإن سبحان الله والحمد لله ولا إله إلا الله والله أكبر هن الباقيات الصالحات \". وقال الإمام أحمد: حدثنا عفان حدثنا أبان حدثنا يحيى بن أبي كثير عن زيد عن أبي سلام عن مولى لرسول الله صلى الله عليه وسلم أن رسول الله صلى الله عليه وسلم قال: \" بخ بخ لخمس ما أثقلهن في الميزان: لا إله إلا الله والله أكبر وسبحان الله والحمد لله والولد الصالح يتوفى فيحتسبه والده - وقال - بخ بخ لخمس من لقي الله مستيقنًا بهن دخل الجنة: يؤمن بالله واليوم الآخر وبالجنة وبالنار وبالبعث بعد الموت وبالحساب \".وقال الإمام أحمد: حدثنا روح حدثنا الأوزاعي عن حسان بن عطية قال: كان شداد بن أوس رضي الله عنه في سفر فنزل منزلا فقال لغلامه: ائتنا بالشفرة نعبث بها فأنكر عليه فقال ما تكلمت بكلمة منذ أسلمت إلا وأنا أخطمها وأزمها غير كلمتي هذه فلا تحفظوها علي واحفظوا ما أقول لكم: سمعت رسول الله صلى الله عليه وسلم يقول: \" إذا كنز الناس الذهب والفضة فاكنزوا أنتم هؤلاء الكلمات: اللهم إني أسألك الثبات في الأمر والعزيمة على الرشد وأسألك شكر نعمتك وأسألك حسن عبادتك وأسألك قلبًا سليمًا وأسألك لسانًا صادقًا وأسألك من خير ما تعلم وأعوذ بك من شر ما تعلم وأستغفرك لما تعلم إنك أنت علام الغيوب \"ثم رواه أيضًا النسائي من وجه آخر عن شداد بنحوه وقال الطبراني: حدثنا عبد الله بن ناجية حدثنا محمد بن سعد العوفي حدثني أبي حدثنا عمر بن الحسين عن يونس بن نفيع الجدلي عن سعد بن جنادة رضي الله عنه قال: كنت في أول من أتى النبي صلى الله عليه وسلم من أهل الطائف فخرجت من أعلى الطائف من السراة غدوة فأتيت منى عند العصر فتصاعدت في الجبل ثم هبطت فأتيت النبي صلى الله عليه وسلم فأسلمت وعلمني \" قل هو الله أحد\" و \" إذا زلزلت \" وعلمني هؤلاء الكلمات: سبحان الله والحمد لله ولا إله إلا الله والله أكبر وقال \" هن الباقيات الصالحات \"وبهذا الإسناد \" من قام من الليل فتوضأ ومضمض فاه ثم قال سبحان الله مائة مرة والحمد لله مائة مرة والله أكبر مائة مرة ولا إله إلا الله مائةمرة غفرت ذنوبه إلا الدماء فإنها لا تبطل \"وقال علي بن أبي طلحة عن ابن عباس قوله: \" والباقيات الصالحات \" قال: هي ذكر الله قول لا إله إلا الله والله أكبر وسبحان الله والحمد لله وتبارك الله ولا حول ولا قوة إلا بالله واستغفر الله وصلى على رسول الله والصيام والصلاة والحج والصدقة والعتق والجهاد والصلة وجميع أعمال الحسنات وهن الباقيات الصالحات التي تبقى لأهلها في الجنة ما دامت السموات والأرض.وقال العوفي عن ابن عباس: هي الكلام الطيب وقال عبد الرحمن بن زيد بن أسلم: هي الأعمال الصالحة كلها واختاره ابن جرير رحمه الله."
    },
    {
      "ayah": 47,
      "surah": 18,
      "text": "يخبر تعالى عن أهوال يوم القيامة وما يكون فيه من الأمور العظام كما قال تعالى: \" يوم تمور السماء مورًا وتسير الجبال سيرًا \" أي تذهب من أماكنها وتزول كما قال تعالى \" وترى الجبال تحسبها جامدة وهي تمر مر السحاب \" وقال تعالى \" وتكون الجبال كالعهن المنفوش \" وقال \" ويسألونك عن الجبال فقل ينسفها ربي نسفًا فيذرها قاعًا صفصفا لا ترى فيها عوجًا ولا أمتا \" يذكر تعالى بأنه تذهب الجبال وتتساوى المهاد وتبقى الأرض قاعًا صفصفًا أي سطحًا مستويًا لا عوج فيه ولا أمتا أي لا وادي ولا جبل ولهذا قال تعالى \" وترى الأرض بارزة \" أي بادية ظاهرة ليس فيها معلم لأحد ولا مكان يواري أحدًا بل الخلق كلهم ضاحون لربهم لا تخفى عليه منهم خافية.قال مجاهد وقتادة \" وترى الأرض بارزة \" لا حجر فيها ولا غيابة قال قتادة: لا بناء ولا شجر وقوله \" وحشرناهم فلم نغادر منهم أحدًا \" أي وجمعناهم الأولين منهم والآخرين فلم نترك منهم أحدًا لا صغيرًا ولا كبيرًا كما قال \" قل إن الأولين والآخرين لمجموعون إلى ميقات يوم معلوم \" وقال \" ذلك يوم مجموع له الناس وذلك يوم مشهود\"."
    },
    {
      "ayah": 48,
      "surah": 18,
      "text": "وقوله \" وعرضوا على ربك صفًا \" يحتمل أن يكون المراد أن جميع الخلائق يقومون بين يدي الله صفًا واحدًا كما قال تعالى \" يوم يقوم الروح والملائكة صفًا لا يتكلمون إلا من أذن له الرحمن وقال صوابًا \" ويحتمل أنهم يقومون صفوفًا صفوفًا كما قال \" وجاء ربك والملك صفًا صفًا \" وقوله \" لقد جئتمونا كما خلقناكم أول مرة \" هذا تقريع للمنكرين للمعاد وتوبيخ لهم على رءوس الأشهاد ولهذا قال تعالى مخاطبًا لهم \" بل زعمتم أن لن نجعل لكم موعدا \" أي ما كان ظنكم أن هذا واقع بكم ولا أن هذا كائن."
    },
    {
      "ayah": 49,
      "surah": 18,
      "text": "وقوله ووضع الكتاب أي كتاب الأعمال الذي فيه الجليل والحقير والفتيل والقطمير والصغير والكبير \" فترى المجرمين مشفقين مما فيه \" أي من أعمالهم السيئة وأفعالهم القبيحة ويقولون يا ويلتنا أي يا حسرتنا و ويلنا على ما فرط في أعمارنا \" ما لهذا الكتاب لا يغادر صغيرة ولا كبيرة إلا أحصاها \" أي لا يترك ذنبًا صغيرًا ولا كبيرًا ولا عملاوإن صغر إلا أحصاها أي ضبطها وحفظها.وروى الطبراني بإسناده المتقدم في الآية قبلها إلى سعد ابن جنادة قال: لما فرغ رسول الله صلى الله عليه وسلم من غزوة حنين نزلنا قفرًا من الأرض ليس فيه شيء فقال النبي صلى الله عليه وسلم \" اجمعوا من وجد عودًا فليأت به ومن وجد حطبًا أو شيئًا فليأت به \"قال فما كان إلا ساعة حتى جعلناه ركامًا فقال النبي صلى الله عليه وسلم \" أترون هذا ؟ فكذلك تجمع الذنوب على الرجل منكم كما جمعتم هذا فليتق الله رجل ولا يذنب صغيرة ولا كبيرة فإنها محصاة عليه \".وقوله \" ووجدوا ما عملوا حاضرًا \" أي من خير وشر كما قال تعالى \" يوم تجد كل نفس ما عملت من خير محضرا \" الآية وقال تعالى \" ينبأ الإنسان يومئذ بما قدم وأخر \" وقال تعالى \" يوم تبلى السرائر \" أي تظهر المخبآت والضمائر قال الإمام أحمد: حدثنا أبو الوليد حدثنا شعبة عن ثابت عن أنس عن النبي صلى الله عليه وسلم قال \" لكل غادر لواء يوم القيامة يعرف به \"أخرجاه في الصحيحين وفي لفظ \" يرفع لكل غادر لواء يوم القيامة عند استه بقدر غدرته يقال هذه غدرة فلان بن فلان \" وقوله ولا يظلم ربك أحدا أي فيحكم بين عباده في أعمالهم جميعًا ولا يظلم أحدًا من خلقه بل يعفو ويصفح ويغفر ويرحم ويعذب من يشاء بقدرته وحكمته وعدله ويملأ النار من الكفار وأصحاب المعاصي ثم ينجي أصحاب المعاصي ويخلد فيها الكافرين وهو الحاكم الذي لا يجور ولا يظلم قال تعالى \" إن الله لا يظلم مثقال ذرة وإن تك حسنة يضاعفها \" الآية وقال \" ونضع الموازين القسط ليوم القيامة فلا تظلم نفس شيئًا- إلى قوله - حاسبين \" والآيات في هذا كثيرة وقال الإمام أحمد: حدثنا يزيد أخبرنا همام بن يحيى عن القاسم بن عبد الواحد المكي عن عبدالله بن محمد بن عقيل أنه سمع جابر بن عبدالله يقول: بلغني حديث عن رجل سمعه من النبي صلى الله عليه وسلم فاشتريت بعيرًا ثم شددت عليه رحلا فسرت عليه شهرًا حتى قدمت عليه الشام فإذا عبدالله بن أنيس فقلت للبواب قل له جابر على الباب فقال ابن عبدالله: قلت نعم فخرج يطأ ثوبه قاعتنقني واعتنقته فقلت حديث بلغني عنك أنك سمعته من رسول الله صلى الله عليه وسلم في القصاص فخشيت أن تموت أو أموت قبل أن أسمعه فقال سمعت رسول الله صلى الله عليه وسلم يقول \" يحشر الله عز وجل الناس يوم القيامة - أو قال العباد- عراة غرلا بهما \"قلت وما بهما ؟ قال \" ليس معهم شيء ثم يناديهم بصوت يسمعه من بُعْدٍ كما يسمعه من قرب: أنا الملك أنا الديان لا ينبغي لأحد من أهل النار أن يدخل النار وله عند أحد من أهل الجنة حق حتى أقضيه منه ولا ينبغي لأحد من أهل الجنة أن يدخل الجنة وله عند رجل من أهل النار حق حتى أقضيه منه حتى اللطمة قال: قلنا كيف وإنما نأتي الله عز وجل حفاة عراة غرلا بهما ؟ قال \" بالحسنات والسيئات \"وعن شعبة عن العوام بن مزاحم عن أبي عثمان عن عثمان بن عفان رضي الله عنه أن رسول الله صلى الله عليه وسلم قال \" إن الجماء لتقتص من القرناء يوم القيامة \"رواه عبدالله بن الإمام أحمد وله شواهد من وجوه أخر وقد ذكرناها عند قوله تعالى \" ونضع الموازين القسط ليوم القيامة فلا تظلم نفس شيئًا \" وعند قوله تعالى \" إلا أمم أمثالكم ما فرّطنا في الكتاب من شيء ثم إلى ربهم يحشرون \"."
    },
    {
      "ayah": 5,
      "surah": 18,
      "text": "\" ما لهم به من علم \" أي بهذا القول الذي افتروه وائتفكوه ولا لآبائهم أي لأسلافهم \" كبرت كلمة\" نصب على التمييز تقديره كبرت كلمتهم هذه وقيل على التعجب تقديره أعظم بكلمتهم كلمة كما تقول أكرم بزيد رجلا قاله بعض البصريين وقرأ ذلك بعض قراء مكة كبرت كلمة كما يقال عظم قولك وكبر شأنك والمعنى على قراءة الجمهور أظهر فإن هذا تبشيع لمقالتهم واستعظام لإفكهم ولهذا قال \" كبرت كلمة تخرج من أفواههم \" أي ليس لها مستند سوى قولهم ولا دليل لهم عليها إلا كذبهم وافتراؤهم ولهذا قال \" إن يقولون إلا كذبا\" وقد ذكر محمد بن إسحاق سبب نزول هذه السورة الكريمة فقال: حدثني شيخ من أهل مصر قدم علينا منذ بضع وأربعين سنة عن عكرمة عن ابن عباس قال: بعثت قريش النضر بن الحارث وعقبة بن أبي معيط إلى أحبار يهود بالمدينة فقالوا لهم سلوهم عن محمد وصفوا لهما صفته وأخبروهم بقوله فإنهم أهل الكتاب الأول وعندهم ما ليس عندنا من علم الأنبياء فخرجا حتى أتيا المدينة فسألوا أحبار يهود عن رسول الله صلى الله عليه وسلم ووصفوا لهم أمره وبعض قوله وقالا: إنكم أهل التوراة وقد جئناكم لتخبرونا عن صاحبنا هذا قال: فقالوا لهم سلوه عن ثلاث نأمركم بهن فإن أخبركم بهن فهو نبي مرسل وإلا فرجل متقول فتروا فيه رأيكم: سلوه عن فتية ذهبوا في الدهر الأول ما كان من أمرهم فإنهم قد كان لهم حديث عجب وسلوه عن رجل طواف بلغ مشارق الأرض ومغاربها ما كان نبؤه وسلوه عن الروح ما هو؟ فإن أخبركم بذلك فهو نبي فاتبعوه وإن لم يخبركم فإنه رجل متقول فاصنعوا في أمره ما بدا لكم فأقبل النضر وعقبة حتى قدما على قريش فقالا: يا معشر قريش قد جئناكم بفصل ما بينكم وبين محمد قد أمرنا أحبار يهود أن نسأله عن أمور فأخبروهم بها فجاءوا رسول الله صلى الله عليه وسلم فقالوا: يا محمد أخبرنا فسألوه عما أمروهم به فقال لهم رسول الله صلى الله عليه وسلم \" أخبركم غدا عما سألتم عنه \" ولم يستثن فانصرفوا عنه ومكث رسول الله صلى الله عليه وسلم خمس عشرة ليلة لا يحدث الله له في ذلك وحيًا ولا يأتيه جبرائيل عليه السلام حتى أرجف أهل مكة وقالوا: وعدنا محمد غدًا واليوم خمس عشرة قد أصبحنا فيها لا يخبرنا بشيء عما سألناه عنه وحتى أحزن رسول الله صلى الله عليه وسلم مكث الوحي عنه وشق عليه ما يتكلم به أهل مكة ثم جاءه جبرائيل عليه السلام من الله عز وجل بسورة أصحاب الكهف فيها معاتبته إياه على حزنه عليهم وخبر ما سألوه عنه من أمر الفتية والرجل الطواف وقول الله عز وجل \" ويسألونك عن الروح قل الروح\" الآية."
    },
    {
      "ayah": 50,
      "surah": 18,
      "text": "يقول تعالى منبها بني آدم على عداوة إبليس لهم ولأبيهم من قبلهم ومقرعًا لمن اتبعه منهم وخالف خالقه ومولاه وهو الذى أنشأه وابتدأه وبألطافه رزقه وغذاه ثم بعد هذا كله والى إبليس وعادى الله فقال تعالى \" وإذ قلنا للملائكة \" أي لجميع الملائكة كما تقدم تقريره في أول سورة البقرة \" اسجدوا لآدم \" أي سجود تشريف وتكريم وتعظيم كما قال تعالى \" وإذ قال ربك للملائكة إني خالق بشرًا من صلصال من حمإ مسنون فإذا سويته ونفخت فيه من روحي فقعوا له ساجدين \" وقوله \" فسجدوا إلا إبليس كان من الجن \" أي خانه أصله فإنه خلق من مارج من نار وأصل خلق الملائكة من نور كما ثبت في صحيح مسلم عن عائشة رضي الله عنها عن رسول الله صلى الله عليه وسلم أنه قال \" خلقت الملائكة من نور وخلق إبليس من مارج من نار وخلق آدم مما وصف لكم فعند الحاجة نضح كل وعاء بما فيه وخانه الطبع عند الحاجة وذلك أنه كان قد توسم بأفعال الملائكة وتشبه بهم وتعبد وتنسك فلهذا دخل في خطابهم وعصى بالمخالفة \"ونبه تعالى ههنا على أنه من الجن أي على أنه خلق من نار كما قال \" أنا خير منه خلقتني من نار وخلقته من طين \" قال الحسن البصري: ما كان إبليس من الملائكة طرفة عين قط وإنه لأصل الجن كما أن آدم عليه السلام أصل البشر رواه ابن جرير بإسناد صحيح عنه وقال الضحاك عن ابن عباس: كان إبليس من حي من أحياء الملائكة يقال لهم الجن خلقوا من نار السموم من بين الملائكة وكان اسمه الحارث وكان خازنًا من خزان الجنة وخلقت الملائكة من نور غير هذا الحي قال: وخلقت الجن الذين ذكروا في القرآن من مارج من نار وهو لسان النار الذي يكون في طرفها إذا التهبت وقال الضحاك أيضًا عن ابن عباس: كان إبليس من أشرف الملائكة وأكرمهم قبيلة وكان خازنًا على الجنان وكان له سلطان السماء الدنيا وسلطان الأرض وكان مما سولت له نفسه من قضاء الله أنه رأى أن له بذلك شرفًا على أهل السماء فوقع من ذلك في قلبه كبر لا يعلمه إلا الله واستخرج الله ذلك الكبر منه حين أمره بالسجود لآدم \" فاستكبر وكان من الكافرين \" قال ابن عباس قوله \" كان من الجن \" أي من خزان الجنان كما يقال للرجل مكي ومدني وبصري وكوفي وقال ابن جريج عن ابن عباس نحو ذلك وقال سعيد بن جبير عن ابن عباس قال: هو من خزان الجنة وكان يدبر أمر السماء الدنيا رواه ابن جرير من حديث الأعمش عن حبيب بن أبي ثابت عن سعيد به وقال سعيد بن المسيب كان رئيس ملائكة سماء الدنيا وقال ابن إسحاق عن خلاد بن عطاء عن طاوس عن ابن عباس قال: كان إبليس قبل أن يركب المعصية من الملائكة اسمه عزازيل وكان من سكان الأرض وكان من أشد الملائكة اجتهادًا وأكثرهم علمًا فذلك دعاه إلى الكبر وكان من حي يسمون جنا.وقال ابن جريج عن صالح مولى التوأمة وشريك بن أبي نمر أحدهما أو كلاهما عن ابن عباس قال: إن من الملائكة قبيلة من الجن وكان إبليس منها وكان يسوس ما بين السماء والأرض فعصى فسخط الله عليه فمسخه شيطانًا رجيمًا لعنه الله ممسوخًا قال: وإذا كانت خطيئة الرجل في كبر فلا ترجه وإذا كانت في معصية فارجه وعن سعيد بن جبير أنه قال: كان من الجنانين الذين يعملون في الجنة وقد رُوي في هذا آثار كثيرة عن السلف وغالبها من الإسرائيليات التي تنقل لينظر فيها والله أعلم بحال كثير منها ومنها ما قد يقطع بكذبه لمخالفته الحق الذي بأيدينا وفي القرآن غنية عن كل ما عداه من الأخبار المتقدمة لأنها لا تكاد تخلو من تبديل وزيادة ونقصان وقد وضع فيها أشياء كثيرة وليس لهم من الحفاظ المتقنين الذين ينفون عنها تحريف الغالين وانتحال المبطلين كما لهذه الأمة من الأئمة والعلماء والسادة والأتقياء والبررة والنجباء من الجهابذة النقاد والحفاظ الجياد الذين دوَّنوا الحديث وحرروه وبينوا صحيحه من حسنه من ضعيفه من منكره وموضوعه ومتروكه ومكذوبه وعرفوا الوضاعين والكذابين والمجهولين وغير ذلك من أصناف الرجال كل ذلك صيانة للجناب النبوي والمقام المحمدي خاتم الرسل وسيد البشر صلى الله عليه وسلم أن ينسب إليه كذب أو يُحَدَّثُ عنه بما ليس منه فرضي الله عنهم وأرضاهم وجعل جنات الفردوس مأواهم وقد فعل وقوله \" ففسق عن أمر ربه \" أي فخرج عن طاعة الله فإن الفسق هو الخروج يقال فسقت الرطبة إذا خرجت من أكمامها وفسقت الفأرة من جحرها إذا خرجت منه للعيث والفساد ثم قال تعالى مقرعًا وموبخًا لمن اتبعه وأطاعه \" أفتتخذونه وذريته أولياء من دوني \" الآية أي بدلا عني ولهذا قال \" بئس للظالمين \" بدلا وهذا المقام كقوله بعد ذكر القيامة وأهوالها ومصير كل من الفريقين السعداء والأشقياء في سورة يس \" وامتازوا اليوم أيها المجرمون - إلى قوله - أفلم تكونوا تعقلون \"."
    },
    {
      "ayah": 51,
      "surah": 18,
      "text": "يقول تعالى: هؤلاء الذين اتخذتموهم أولياء من دوني عبيد أمثالكم لا يملكون شيئًا لا أشهدتهم خلق السموات والأرض ولا كانوا إذ ذاك موجودين ; يقول تعالى: أنا المستقل بخلق الأشياء كلها ومدبرها ومقدرها وحدي ليس معي في ذلك شريك ولا وزير ولا مشير ولا نظير كما قال \" قل ادعوا الذين زعمتم من دون الله لا يملكون مثقال ذرة في السموات ولافي الأرض وما لهم فيهما من شرك وما له منهم من ظهير ولا تنفع الشفاعة عنده إلا لمن أذن له \" الأية ولهذا قال وما كنت متخذ المضلين عضدا قال مالك: أعوانًا."
    },
    {
      "ayah": 52,
      "surah": 18,
      "text": "يقول تعالى مُخبرا عما يخاطب به المشركين يوم القيامة على رءوس الأشهاد تقريعًا لهم وتوبيخًا \" نادوا شركائي الذين زعمتم \" أي في دار الدنيا ادعوهم اليوم ينقذونكم مما أنتم فيه كما قال تعالى \" ولقد جئتمونا فرادى كما خلقناكم أول مرة وتركتم ما خولناكم وراء ظهوركم وما نرى معكم شفعاءكم الذين زعمتم أنهم فيكم شركاء لقد تقطع بينكم وضل عنكم ما كنتم تزعمون \" وقوله \" فدعوهم فلم يستجيبوا لهم \" كما قال \" وقيل ادعوا شركاءكم فدعوهم فلم يستجيبوا لهم \" الآية وقال \" ومن أضل ممن يدعو من دون الله من لا يستجيب له \" الآيتين وقال تعالى \" واتخذوا من دون الله آلهة ليكونوا لهم عزا كلا سيكفرون بعبادتهم ويكونون عليهم ضدا \" وقوله وجعلنا بينهم موبقا قال ابن عباس وقتادة وغير واحد مهلكًا وقال قتادة: ذكر لنا أن عمرًا البكالي حدث عن عبدالله بن عمرو قال: هو واد عميق فرق به يوم القيامة بين أهل الهدى وأهل الضلالة وقال قتادة: موبقا واديا في جهنم. وقال ابن جرير: حدثني محمد بن سنان القزاز حدثنا عبد الصمد حدثنا يزيد بن زريع سمعت أنس بن مالك يقول في قول الله تعالى \" وجعلنا بينهم موبقًا \" قال واد في جهنم من قيح ودم وقال الحسن البصري: موبقا عداوة والظاهر من السياق ههنا أنه المهلك ويجوز أن يكون واديًا في جهنم أو غيره والمعنى أن الله تعالى بيَّن أنه لا سبيل لهؤلاء المشركين ولا وصول لهم إلى آلهتهم التي كانوا يزعمون في الدنيا وأنه يفرق بينهم وبينها في الآخرة فلا خلاص لأحد من الفريقين إلى الآخر بل بينهما مهلك وهول عظيم وأمر كبير.وأما إن جعل الضمير في قوله \" بينهم \" عائدًا إلى المؤمنين والكافرين كما قال عبد الله بن عمرو إنه يفرق بين أهل الهدى والضلالة به فهو كقوله تعالى \" ويوم تقوم الساعة يومئذ يتفرقون \" وقال \" يومئذ يصدعون \" وقال تعالى \" وامتازوا اليوم أيها المجرمون \" وقال تعالى \" ويوم نحشرهم جميعًا ثم نقول للذين أشركوا مكانكم أنتم وشركاؤكم فزيلنا بينهم ـ إلى قوله- وضل عنهم ما كانوا يفترون \"."
    },
    {
      "ayah": 53,
      "surah": 18,
      "text": "وقوله \" ورأى المجرمون النار فظنوا أنهم مواقعوها ولم يجدوا عنها مصرفا \" أي أنهم لما عاينوا جهنم حين جيء بها تقاد بسبعين ألف زمام مع كل زمام سبعون ألف ملك \" فإذا رأى المجرمون النار \" تحققوا لا محالة أنهم مواقعوها ليكون ذلك من باب تعجيل الهم والحزن لهم فإن توقع العذاب والخوف منه قبل وقوعه عذاب ناجز وقوله \" ولم يجدوا عنهـا مصرفا \" أي ليس لهم طريق يعدل بهم عنها ولا بد لهم منها. قال ابن جرير: حدثني يونس أخبرنا ابن وهب أخبرني عمرو بن الحارث عن دراج عن أبي الهيثم عن أبي سعيد عن رسول الله صلى الله عليه وسلم أنه قال \" إن الكافر ليرى جهنم فيظن أنها مواقعته من مسيرة أربعمائة سنة \"وقال الإمام أحمد: حدثنا حسن حدثنا دراج عن أبي الهيثم عن أبي سعيد الخدري قال: قال رسول الله صلى الله عليه وسلم \" ينصب الكافر مقدار خمسين ألف سنة كما لم يعمل في الدنيا وإن الكافر ليرى جهنم ومظن أنها مواقعته من مسيرة أربعين سنة \"."
    },
    {
      "ayah": 54,
      "surah": 18,
      "text": "يقول تعالى ولقد بينا للناس في هذا القرآن ووضحنا لهم الأمور وفصلناها كيلا يضلوا عن الحق ويخرجوا عن طريق الهدى ومع هذا البيان وهذا الفرقان الإنسان كثير المجادلة والمخاصمة والمعارضة للحق بالباطل إلا من هدى الله وبصره لطريق النجاة. قال الإمام أحمد حدثنا أبو اليمان أخبرنا شعيب عن الزهري أخبرني علي بن الحسين أن حسين بن علي أخبره أن علي بن أبي طالب أخبره أن رسول الله صلى الله عليه وسلم طرقه وفاطمة بنت رسول الله صلى الله عليه وسلم ليلة فقال \" ألا تصليان \"فقلت يا رسول الله إنما أنفسنا بيد الله فإذا شاء أن يبعثنا بعثنا فانصرف حين قلت ذلك ولم يرجع إلي شيئًا ثم سمعته وهو مولٍّ يضرب فخذه ويقول \" وكان الإنسان أكثر شيء جدلا \" أخرجاه في الصحيحين."
    },
    {
      "ayah": 55,
      "surah": 18,
      "text": "يخبر تعالى عن تمرد الكفرة في قديم الزمان وحديثه وتكذيبهم بالحق البين الظاهر مع ما يشاهدون من الآيات والدلالات الواضحات وأنه ما منعهم من اتباع ذلك إلا طلبهم أن يشاهدوا العذاب الذي وعدوا به عيانًا كما قال أولئك لنبيهم \" فأسقط علينا كسفًا من السماء إن كنت من الصادقين \" وآخرون قالوا \" ائتنا بعذاب الله إن كنت من الصادقين \" وقالت قريش \" اللهم إن كان هذا هو الحق من عندك فأمطر علينا حجارة من السماء أو ائتنا بعذاب أليم \" وقالوا \" يا أيها الذي نزل عليك الذكر إنك لمجنون لوما تأتينا بالملائكة إن كنت من الصادقين \" إلى غير ذلك من الآيات الدالة على ذلك ثم قال \" إلا أن تأتيهم سنة الأولين \" من غشيانهم بالعذاب وأخذهم عن آخرهم \" أويأتيهم العذاب قبلا \" أي يرونه عيانًا مواجهة ومقابلة."
    },
    {
      "ayah": 56,
      "surah": 18,
      "text": "ثم قال تعالى \" وما نرسـل المرسلين إلا مبشربن ومنذرين \" أي قبل العذاب مبشرين من صدقهم وآمن بهم ومنذرين لمن كذبهم وخالفهم ثم أخبر عن الكفار بأنهم \" يجادلون بالباطل ليدحضوا به \" أي ليضعفوا به الحق الذي جاءتهم به الرسل وليس ذلك بحاصل لهم \" واتخذوا آياتي وما أنذروا هزوا \" أي اتخذوا الحجج والبراهين وخوارق العادات التي بعث بها الرسل وما أنذروهم وخوفوهم به من العذاب \" هزوا \" أي سخروا منهم في ذلك وهو أشد التكذيب."
    },
    {
      "ayah": 57,
      "surah": 18,
      "text": "يقول تعالى وأي عباد الله أظلم ممن ذكر بآيات الله فأعرض عنها أي تناساها وأعرض عنها ولم يصغ لها ولا ألقى إليها بالا \" ونسي ما قدمت يداه \" أي من الأعمال السيئة والأفعال القبيحة \" إنا جعلنا على قلوبهم \" أي قلوب هؤلاء \" أكنة \" أي أغطية وغشاوة \" أن يفقهوه \" أي لئلا يفهموا هذا القرآن والبيان \" وفي آذانهم وقرًا \" أي صممًا معنويًا عن الرشاد \" وإن تدعهم إلى الهدى فلن يهتدوا إذًا أبدا \"."
    },
    {
      "ayah": 58,
      "surah": 18,
      "text": "وقوله \" وربك الغفور ذو الرحمة \" أي ربك يا محمد غفور ذو رحمة واسعة \" لو يؤاخذهم بما كسبوا لعجل لهم العذاب \" كما قال \" ولو يؤاخذ الله الناس بما كسبوا ما ترك على ظهرها من دابة \" وقال \" وإن ربك لذو مغفرة للناس على ظلمهم وإن ربك لشديد العقاب \" والآيات في هذا كثيرة شتى ثم أخبر أنه يحلم ويستر ويغفر وربما هدى بعضهم من الغي إلى الرشاد ومن استمر منهم فله يوم يشيب فيه الوليد وتضع كل ذات حمل حملها ولهذا قال \" بل لهم موعد لن يجدوا من دونه موئلا \" أي ليس لهم عنه محيص ولا محيد ولا معدل."
    },
    {
      "ayah": 59,
      "surah": 18,
      "text": "وقوله \" وتلك القرى أهلكناهم لما ظلموا \" أي الأمم السالفة والقرون الخالية أهلكناهم بسبب كفرهم وعنادهم \" وجعلنا لمهلكهم موعدا \" أي جعلناه إلى مدة معلومة ووقت معين لا يزيد ولا ينقص أي وكذلك أنتم أيها المشركون احذروا أن يصيبكم ما أصابهم فقد كذبتم أشرف رسول وأعظم نبي ولستم بأعز علينا منهم فخافوا عذابي ونذر."
    },
    {
      "ayah": 6,
      "surah": 18,
      "text": "يقول تعالى مسليًا لرسوله صلوات الله وسلامه عليه في حزنه على المشركين لتركهم الإيمان وبعدهم عنه كما قال تعالى \" فلا تذهب نفسك عليهم حسرات \" وقال ولا تحزن عليهم وقال \" لعلك باخع نفسك أن لا يكونوا مؤمنين \" باخع أي مهلك نفسك بحزنك عليهم ولهذا قال \" فلعلك باخع نفسك على آثارهم إن لم يؤمنوا بهذا الحديث \" يعني القرآن أسفا يقول لا تهلك نفسك أسفًا قال قتادة: قاتل نفسك غضبًا وحزنًا عليهم وقال مجاهد جزعًا والمعنى متقارب أي لا تأسف عليهم بل أبلغكم رسالة الله فمن اهتدى فلنفسه ومن ضل فإنما يضل عليها ولا تذهب نفسك عليهم حسرات ثم أخبر تعالى أنه جعل الدنيا دارا فانية مزينة بزينة زائلة وإنما جعلها دار اختبار لا دار قرار."
    },
    {
      "ayah": 60,
      "surah": 18,
      "text": "سبب قول موسى لفتاه وهو يشوع بن نون هذا الكلام أنه ذكر له أن عبدًا من عباد الله بمجمع البحرين عنده من العلم ما لم يحط به موسى فأحب الرحيل إليه وقال لفتاه ذلك \" لا أبرح \" أي لا أزال سائرًا \" حتى أبلغ مجمع البحرين \" أي هذا المكان الذي فيه مجمع البحرين قال الفرزدق: فما برحوا حتى تهادت نساؤهم ببطحاء ذي قار عياب اللطائم قال قتادة وغير واحد: هما بحر فارس مما يلي المشرق وبحر الروم مما يلي المغرب.وقال محمد بن كعب القرظي مجمع البحرين عند طنجة يعنى في أقصى بلاد المغرب فالله أعلم وقوله \" أو أمضي حقبا \" أي ولو أني أسير حقبًا من الزمان.قال ابن جرير رحمه الله: ذكر بعض أهل العلم بكلام العرب أن الحقب في لغة قيس سنة ثم قد رُوي عن عبد الله بن عمرو أنه قال الحقب ثمانون سنة وقال مجاهد سبعون خريفًا وقال علي ابن أبي طلحة عن ابن عباس قوله \" أو أمضي حقبا \" قال دهرًا وقال قتادة وابن زيد مثل ذلك."
    },
    {
      "ayah": 61,
      "surah": 18,
      "text": "وقوله \" فلما بلغا مجمع بينهما نسيا حوتهما \" وذلك أنه كان قد أمر بحمل حوت مملوح معه وقيل له: متى فقدت الحوت فهو ثمة فسارا حتى بلغا مجمع البحرين وهناك عين يقال لها عين الحياة فناما هنالك وأصاب الحوت من رشاش ذلك الماء فاضطرب وكان في مكتل مع يوشع عليه السلام وطفر من المكتل إلى البحر فاستيقظ يوشع عليه السلام وسقط الحوت في البحر فجعل يسير في الماء والماء له مثل الطاق لا يلتئم بعده ولهذا قال تعالى \" واتخذ سبيله في البحر سربا \" أي مثل السرب في الأرض قال ابن جرير قال ابن عباس صار أثره كأنه حجر.وقال العوفي عن ابن عباس جعل الحوت لا يمس شيئًا من البحر إلا يبس حتى يكون صخرة وقال محمد بن إسحاق عن الزهري عن عبيد الله بن عبدالله عن ابن عباس عن أبي بن كعب قال: قال رسول الله صلى الله عليه وسلم حين ذكر حديث ذلك ما انجاب ماء منذ كان الناس غير مسير مكان الحوت الذي فيه فانجاب كالكوة حتى رجع إليه موسى فرأى مسلكه فقال \" ذلك ما كنا نبغِ \" وقال قتادة سرب من البحر حتى أفضى إلى البحر ثم سلك فيه فجعل لا يسلك فيه طريقًا إلا صار ماء جامًدا."
    },
    {
      "ayah": 62,
      "surah": 18,
      "text": "وقوله \" فلما جاوزا \" أي المكان الذي نسيا الحوت فيه ونسب النسيان إليهـما وإن كان يوشع هو الذي نسيه كقوله تعالى \" يخرج منهما اللؤلؤ والمرجان \" وإنما يخرج من المالح على أحد القولين فلما ذهبا عن المكان الذي نسياه فيه بمرحلة \" قال \" موسى \" لفتاه آتنا غداءنا لقد لقينا من سفرنا هذا \" أي الذي جاوزا فيه المكان نصبا يعني تعبًا."
    },
    {
      "ayah": 63,
      "surah": 18,
      "text": "قال \" أرأيت إذ أوينا إلى الصخرة فإني نسيت الحوت وما أنسانيه إلا الشيطان أن أذكره \" قال قتادة وقرأ ابن مسعود أن أذكركه ولهذا قال \" فاتخذ سبيله \" أي طريقه."
    },
    {
      "ayah": 64,
      "surah": 18,
      "text": "\" قال ذلك ما كنا نبغ\"أي هذا هو الذي نطلب \" فارتدا \" أي رجعا \" على آثارهما \" أي طريقهما \" قصصا \" أي يقصان آثار مشيهما ويقفوان أثرهما."
    },
    {
      "ayah": 65,
      "surah": 18,
      "text": "\" فوجدا عبدا من عبادنا آتيناه رحمة من عندنا وعلمناه من لدنا علما \" وهذا هو الخضر عليه السلام كما دلت عليه الأحاديث الصحيحة عن رسول الله صلى الله عليه وسلم قال البخاري: حدثنا الحميدي حدثنا سفيان حدثنا عمرو بن دينار أخبرني سعيد بن جبير قال قلت لابن عباس إن نوفا البكالي يزعم أن موسى صاحب الخضر عليه السلام ليس هو موسى صاحب بني إسرائيل قال ابن عباس كذب عدو الله حدثنا أبي بن كعب رضي الله عنه أنه سمع رسول الله صلى الله عليه وسلم يقول \" إن موسى قام خطيبًا في بني إسرائيل فسئل أي الناس أعلم ؟ قـال أنا.فعتب الله عليه إذ لم يرد العلم إليه فأوحى الله إليه أن لي عبدًا بمجمع البحرين هو أعلم منك.قال موسى يارب وكيف لي به؟ قال تأخذ معك حوتًا فتجعله بمكتل فحيثما فقدت الحوت فهو ثم \" فأخذ حوتًا فجعله بمكتل ثم انطلق وانطلق معه فتاه يوشع بن نون عليه السلام حتى إذا أتيا الصخرة وضعا رءوسهما فناما واضطرب الحوت في المكتل فخرج منه فسقط في البحر فاتخذ سبيله في البحر سربًا وأمسك الله عن الحوت جرية الماء فصار عليه مثل الطاق فلما استيقظ نسي صاحبه أن يخبره بالحوت فانطلقا بقية يومهما وليلتهما حتى إذا كان من الغد قال موسى لفتاه \" آتنا غداءنا لقد لقينا من سفرنا هذا نصبا \" ولم يجد موسى النصب حتى جاوز المكان الذي أمره الله به قال له فتاه \" أرأيت إذ أوينا إلى الصخرة فإني نسيت الحوت وما أنسانيه إلا الشيطان أن أذكره واتخذ سبيله في البحر عجبا \" قال فكان للحوت سربًا ولموسى وفتاه عجبًا فقال \" ذلك ما كنا نبغ فارتدا على آثارهما قصصا \" قال فرجعا يقصان أثرهما حتى انتهيا إلى الصخرة فإذا رجل مسجى بثوب فسلم عليه موسى فقال الخضر وأنى بأرضك السلام.فقال أنا موسى.فقال موسى بني إسرائيل ؟ قال نعم قال أتيتك لتعلمني مما علمت رشدا \" قال إنك لن تستطيع معي صبرا \" يا موسى إني على علم من علم الله علمنيه لا تعلمه أنت وأنت على علم من علم الله علمكه الله لا أعلمه.فقال موسى \" ستجدني إن شاء الله صابرًا ولا أعصي لك أمرا \" قال له الخضر \" فإن اتبعتني فلا تسألني عن شيء حتى أحدث لك منه ذكرا \" فانطلقا يمشيان على ساحل البحر فمرت سفينة فكلموهم أن يحملوهم فعرفوا الخضر فحملوهم بغير نول فلما ركبا في السفينة لم يفجأ إلا والخضر قد قلع لوحًا من ألواح السفينة بالقدوم فقال له موسى قد حملونا بغير نول فعمدت إلى سفينتهم فخرقتها لتغرق أهلها؟ لقد جئت شيئًا إمراً \" قال ألم أقل إنك لن تستطيع معي صبرا: قال لا تؤاخذني بما نسيت ولا ترهقني من أمري عسرا \" قال: وقال رسول الله صلى الله عليه وسلم \" فكانت الأولى من موسى نسيانًا \"قال: وجاء عصفور فوقع على حرف السفينة فنقر في البحر نقرة أو نقرتين فقال له الخضر: ما علمي وعلمك في علم الله إلا مثل ما نقص هذا العصفور من هذا البحر.ثم خرجا من السفينة فبينما هما يمشيان على الساحل إذ أبصر الخضر غلامًا يلعب مع الغلمان فأخذ الخضر رأسه فاقتلعه بيده فقتله فقال له موسى \" أقتلت نفسًا زكية بغير نفس لقد جئت شيئًا نكرا \" قال \" ألم أقل لك إنك لن تستطيع معي صبرا \" قال وهذه أشد من الأولى \" قال إن سألتك عن شيء بعدها فلا تصاحبني قد بلغت من لدني عذرا فانطلقا حتى إذا أتيا أهل قرية استطعما أهلها فأبوا أن يضيفوهما فوجدا فيها جدارًا يريد أن ينقض \" أي مائلا فقال الخضر بيده \" فأقامه\" فقال موسى: قوم أتيناهم فلم يطعمونا ولم يضيفونا \" لو شئت لاتخذت عليه أجرا ; قال هذا فراق بيني وبينك سأنبئك بتأويل ما لم تستطع عليه صبرا \" فقال رسول الله \" وددنا أن موسى كان صبر حتى يقص الله علينا من خبرهما \"قال سعيد بن جبير: كان ابن عباس يقرأ \" وكان أمامهم ملك يأخذ كل سفينة صالحة غصبا \" وكان يقرأ \" وأما الغلام فكان كافرًا وكان أبواه مؤمنين \" ثم رواه البخاري عن فتيبة عن سفيان بن عيينة فذكر نحوه وفيه فخرج موسى ومعه فتاه يوشع بن نون ومعهما الحوت حتى انتهيا إلى الصخرة فنزلا عندها قال فوضع موسى رأسه فنام قال سفيان: وفي حديث عن عمر فال وفي أصل الصخرة عين يقال لها الحياة لا يصيب من مائها شيء إلاحيي فأصاب الحوت من ماء تلك العين فتحرك وانسل من المكتل فدخل البحر فلما استيقظ قال موسى لفتاه \" آتنا غداءنا \" قال وساق الحديث ووقع عصفور على حرف السفينة فغمس منقاره في البحر فقال الخضر لموسى ما علمي وعلمك وعلم الخلائق في علم الله إلا مقدار ما غمس هذا العصفور منقاره وذكر تمامه بنحوه وقال البخاري أيضًا: حدثنا إبراهيم بن موسى حدثنا هشام بن يوسف أن ابن جريج أخبرهم قال أخبرني يعلى بن مسلم وعمرو بن دينار عن سعيد بن جبير يزيد أحدهما على صاحبه وغيرهما قد سمعته يحدث عن سعيد بن جبير: قال إنا لعند ابن عباس في بيته إذ قال سلوني فقلت أي أبا عباس جعلني الله فداك بالكوفة رجل قاص يقال له نوف يزعم أنه ليس بموسى بني إسرائيل أما عمرو فقال لي قال كذب عدو الله وأما يعلى فقال لي: قال ابن عباس حدثني أبي بن كعب قال قال رسول الله صلى الله عليه وسلم \" موسى رسول الله ذكر الناس يوما حتى إذا فاضت العيون ورقت القلوب ولى فأدركه رجل فقال أي رسول الله هل في الأرض أحد أعلم منك ؟ قال لا: فعتب الله عليه إذ لم يرد العلم إلى الله قيل بلى ; قال أي رب وأين؟ قال بمجمع البحرين قال أي رب اجعل لي علمًا أعلم ذلك به قال لي عمر قال: حيث يفارقك الحوت وقال لي يعلى خذ حوتًا ميتًا حيث ينفخ فيه الروح فأخذ حوتًا فجعله في مكتل فقال لفتاه لا أكلفك إلاأن تخبرني بحيث يفارقك الحوت قال ما كلفت كبيرًا فذلك قوله \" وإذ قال موسى لفتاه \" يوشع بن نون ليست عند سعيد بن جبير قال فبينا هو في ظل صخرة في مكان ثريان إذ يضرب الحوت وموسى نائم فقال فتاه لا أوقظه حتى إذا استيقظ نسي أن يخبره ويضرب الحوت حتى دخل في البحر فأمسك الله عنه جرية الماء حتى كأن أثره في حجر قال: فقال لي عمرو هكذا كأن أثره في حجر وحلق بين إبهاميه واللتين تليهما قال \" لقد لقينا من سفرنا هذا نصبا \" قال وقد قطع الله عنك النصب ليست هذه عند سعيد بن جبير أخبره فرجعا فوجدا خضرًا قال: قال عثمان ابن أبي سليمان على طنفسة خضراء على كبد البحر قال سعد بن جبير مسجى بثوب قد جعل طرفه تحت رجليه وطرفه تحت رأسه فسلم عليه موسى فكشف عن وجهه وقال: هل بأرضي من سلام ؟ من أنت ؟ قال أنا موسى قال موسى بني إسرائيل ؟ قال نعم قال فما شأنك ؟ قال: جئتك لتعلمني مما علمت رشدًا قال أما يكفيك أن التوراة بيديك وأن الوحي يأتيك ؟ يا موسي إن لي علمًا لا ينبغي لك أن تعلمه وإن لك علمًا لا ينبغي لي أن أعلمه فأخذ طائر بمنقاره من البحر فقال والله ما علمي وعلمك في جنب علم الله إلا كما أخذ هذا الطائر بمنقاره من البحر حتى إذا ركبا في السفينة وجدا معابر صغارًا تحمل أهل هذا الساحل إلى هذا الساحل الآخر عرفوه فقالوا عبدالله الصالح قال فقلنا لسعيد بن جبير خضر قال: نعم لا نحمله بأجر فخرقها ووتد فيها وتدًا قال موسى \" أخرقتها لتغرق أهلها لقد جئت شيئًا إمرًا \" قال مجاهد منكرا قال ألم أقل إنك لن تستطيع معي صبرًا ؟ كانت الأولى نسيانًا والثانية شرطا والثالثة عمدًا قال لا تؤاخذني بما نسيت ولا ترهقني من أمري عسرا فانطلقا حتى لقيا غلاما فقتله قال يعلى قال سعيد وجد غلمانًا يلعبون فأخذ غلاما كافرًا ظريفًا فاضجعه ثم ذبحه بالسكين فقال أقتلت نفسا زكية لم تعمل الحنث ؟ وابن عباس قرأها زكية زاكية مسلمة كقولك غلاما زكيا فانطلقا فوجدا جدارًا يريدأن ينقض فأقامه قال بيده: هكذا ودفع بيده فاستقام قال: لوشئت لاتخذت عليه أجرًا قال يعلى: حسبت أن سعيدًا قال فمسحه بيده فاستقام قال لوشئت لاتخذت عليه أجرًا قال سعيد أجرًا نأكله وكان وراءهم ملك وكان أمامهم قرأها ابن عباس أمامهم ملك يزعمون عن غير سعيد أنه هدد بن بدد والغلام المقتول اسمه يزعمون حيسور ملك يأخذ كل سفينة غصبا فأردت إذا هي مرت به أن يدعها بعيبها فإذا جاوزوا أصلحوها فانتفعوا بها منهم من يقول سدوها بقارورة ومنهم من يقول بالقار كان أبواه مؤمنين وكان هو كافرًا فخشينا أن يرهقهما طغيانًا وكفرا أن يحملهما حبه على أن يتابعاه على دينه فأردنا أن يبدلهما ربهما خيرًا منه زكاة كقوله \" أقتلت نفسا زكية \" وقوله \" وأقرب رحما \" هما به أرحم منهما بالأول الذي قتل خضر وزعم غير سعيد بن جبير أنهما أبدلا جارية وأما داود بن أبي عاصم فقال عن غير واحد إنها جارية. وقال عبد الرزاق: أخبرنا معمر عن أبي إسحاق عن سعيد بن جبير عن ابن عباس قال خطب موسى عليه السلام بني إسرائيل فقال: ما أحد أعلم بالله وبأمره مني فأمر أن يلقى هذا الرجل فذكر نحو ما تقدم بزيادة ونقصان والله أعلم.وقال محمد بن إسحاق عن الحسن بن عمارة عن الحكم بن عتيبة عن سعيد بن جبير قال: جلست عند ابن عباس وعنده نفر من أهل الكتاب فقال بعضهم يا أبا العباس إن نوفًا بن أمراة كعب يزعم عن كعب أن موسى النبي الذي طلب العلم إنما هو موسى بن ميشا قال سعيد فقال ابن عباس أنوف يقول هذا يا سعيد ؟ قلت له نعم أنا سمعت نوفًا يقول ذلك قال أنت سمعته يا سعيد قال قلت نعم قال كذب نوف ثم قال ابن عباس حدثني أبي بن كعب عن رسول الله صلى الله عليه وسلم أن موسى بني إسرائيل سأل ربه فقال أي رب إن كان في عبادك أحد هو أعلم مني فدلني عليه؟ فقال له نعم في عبادي من هو أعلم منك ثم نعت له مكانه وأذن له في لقيه خرج موسى ومعه فتاه ومعه حوت مليح قد قيل له إذا حيي هذا الحوت في مكان فصاحبك هنالك وقد أدركت حاجتك فخرج موسى ومعه فتاه ومعه ذلك الحوت يحملانه فسار حتى جهده السير وانتهى إلى الصخرة وإلى ذلك الماء وذلك الماء ماء الحياة من شرب منه خلد ولا يقاربه شيء ميت إلاحيي فلما نزلا ومس الحوت الماء حيي فاتخذ سبيله في البحر سربًا فانطلقا فلما جاوزا النقلة قال موسى لفتاه: آتنا غداءنا لقد لقينا من سفرنا هذا نصبا قال الفتى وذكر \" أرأيت إذ أوينا إلى الصخرة فإني نسيت الحوت وما أنسانيه إلا الشيطان أن أذكره واتخذ سبيله في البحر عجبا \" قال ابن عباس: فظهر موسى على الصخرة حتى إذا انتهيا إليها فإذا رجـل متلفف في كساء له فسلم موسى عليه فرد عليه السلام ثم قال له: ما جاء بك إن كان لك في قومك لشغل قال له موسى جئتك لتعلمني مما علمت رشدًا قال إنك لن تستطيع معي صبرًا وكان رجلا يعلم علم الغيب قد علم ذلك فقال موسى بلى قال \" وكيف تصبر على مالم تحط به خبرًا \" أي إنما تعرف ظاهر ما ترى من العدل ولم تحط من علم الغيب بما أعلم \" قال ستجدني إن شاء الله صابرًا ولا أعصي لك أمرًا \" وإن رأيت ما يخالفني قال \" فإن اتبعتنى فلا تسألني عن شيء \" وإن أنكرته \" حتى أحدث لك منه ذكرا \" فانطلقا يمشيان على ساحل البحر يتعرضان الناس يلتمسان من يحملهما حتى مرت بهما سفينة جديدة وثيقة لم يمر بهما من السفن شيء أحسن ولا أجمل ولا أوثق منها فسأل أهلها أن يحملوهما فحملوهما فلما اطمأنا فيها ولجت بهما مع أهلها أخرج منقارًا له ومطرقة ثم عمد إلى ناحية منها فضرب فيها بالمنقار حتى خرقها ثم أخذ لوحًا فطبقه عليها ثم جلس عليها يرقعها فقال له موسى ورأى أمرًا أفظع به \" أخرقتها لتغرق أهلها لقد جئت شيئًا إمرًا قال ألم أقل إنك لن تستطيع معي صبرًا قال لا تواخذني بما نسيت \" أي بما تركت من عهدك \" ولا ترهقني من أمري عسرًا \" ثم خرجا من السفينة فانطلقا حتى إذا أتيا أهل قرية فإذا غلمان يلعبون خلفها فيهم غلام ليس في الغلمان غلام أظرف منه ولا أثرى ولا أوضأ منه فأخذه بيده وأخذ حجرًا فضرب به رأسه حتى دمغه فقتله قال فرأى موسى أمرًا فظيعًا لا صبر عليه صبي صغير قتله لا ذنب له قال \" أقتلت نفسًا زكية \" أي صغيرة \" بغير نفس لقد جئت شيئًا نكرًا قال ألم أقل لك إنك لن تستطيع معي صبرًا قال إن سألتك عن شيء بعدها فلا تصاحبني قد بلغت من لدني عذرًا \" أي قد أعذرت في شأني \" فانطلقا حتي إذا أتيا أهل قرية استطعما أهلها فأبوا أن يضيفوهما فوجدا فيها جدارًا يريد أن ينقض \" فهدمه ثم قعد يبنيه فضجر موسى مما يراه يصنع من التكليف وما ليس عليه صبر فأقامه قال \" لو شئت لاتخذت عليه أجرًا \" أي قد استطعمناهم فلم يطعمونا وضفناهم فلم يضيفونا ثم قعدت تعمل من غير صنيعة ولو شئت لأعطيت عليه أجرًا في عمله قال \" هذا فراق بيني وبينك سأنبئك بتأويل ما لم تستطع عليه صبرًا أما السفينة فكانت لمساكين يعملون في البحر فأردت أن أعيبها وكان وراءهم ملك يأخذ كل سفينة غصبًا \" وفي قراءة أبي بن كعب \" كل سفينة صالحة \" وإنما عبتها لأرده عنها فسلمت منه حين رأى العيب الذي صنعت بها \" وأما الغلام فكان أبواه مؤمنين فخشينا ان يرهقهما طغيانًا وكفرا فأردنا أن يبدلهما ربهما خيرا منه زكاة وأقرب رحمًا وأما الجدار فكان لغلامين يتيمين في المدينة وكان تحته كنز لهما وكان أبوهما صالحًا فأراد ربك أن يبلغا أشدهما ويستخرجا كنزهما رحمة من ربك وما فعلته عن أمري \" أي ما فعلته عن نفسي \" ذلك تأويل ما لم تسطع عليه صبرًا \" فكان ابن عباس يقول ما كان الكنز إلا علما وقال العوفي عن ابن عباس قال: لما ظهر موسى وقومه على مصر أنزل قومه مصر فلما استقرت بهم الدار أنزل الله أن ذكرهم بأيام الله فخطب قومه فذكر ما آتاهم الله من الخير والنعمة وذكرهم إذ نجاهم الله من آل فرعون وذكرهم هلاك عدوهم وما استخلفهم الله في الأرض وقال كلم الله نبيكم تكليما واصطفاني لنفسه وأنزل عليّ محبة منه وآتاكم الله من كل ما سألتموه فنبيكم أفضل أهل الأرض وأنتم تقرءون التوراة فلم يترك نعمة أنعم الله عليهم إلا وعرفهم إياها.فقال له رجل من بني إسرائيل هم كذلك يا نبي الله قد عرفنا الذي تقول فهل على الأرض أحد أعلم منك يا نبي الله ؟ قال لا فبعث الله جبرائيل إلى موسى عليه السلام فقال إن الله يقول وما يدريك أين أضع علمي بلى إن لي على شط البحر رجلا هو أعلم منك.قال ابن عباس: هو الخضر فسأل موسى ربه أن يريه إياه فأوحى إليه أن ائت البحر فإنك تجد على شط البحر حوتًا فخذه فادفعه إلى فتاك ثم الزم شاطئ البحر فإذا نسيت الحوت وهلك منك فثم تجد العبد الصالح الذي تطلب فلما طال سفر موسى نبي الله ونصب فيه سأل فتاه عن الحوت فقال له فتاه وهو غلامه \" أرأيت إذ أوينا إلى الصخرة فإني نسيت الحوت وما أنسانيه إلا الشيطان أن أذكره \" لك قال الفتى لقد رأيت الحوت حين اتخذ سبيله في البحر سربًا فأعجب ذلك فرجع موسى حتى أتى الصخرة فوجد الحوت فجعل الحوت يضرب في البحر ويتبعه موسى وجعل موسى يقدم عصاه يفرج بها عنه الماء يتبع الحوت وجعل الحوت لا يمس شيئًا من البحر الا يبس عنه الماء حتى يكون صخرة فجعل نبي الله يعجب من ذلك حتى انتهى به الحوت جزيرة من جزائر البحر فلقي الخضر بها فسلم عليه فقال الخضر وعليك السلام وأني يكون السلام بهذه الأرض ومن أنت ؟ قال أنا موسى.قال الخضر: صاحب بني إسرائيل ؟ قال نعم فرحب به وقال ما جاء بك ؟ قال جئتك \" على أن تعلمن مما علمت رشدًا قال إنك لن تستطيع معي صبرًا \" يقول لا تطيق ذلك قال \" ستجدني إن شاء الله صابرا ولا أعصي لك أمرا \" قال فانطلق به وقال له: لا تسألني عن شيء أصنعه حتى أبين لك شأنه فذلك قوله \" حتى أحدث لك منه ذكرًا \" وقال الزهري عن عبيدالله بن عبدالله بن عتبة بن مسعود عن ابن عباس أنه تمارى هو والحر بن قيس بن حصن الفزاري في صاحب موسى فقال ابن عباس هو خضر فمر بهما أبي بن كعب فدعاه ابن عباس فقال إني تماريت أنا وصاحبي هذا في صاحب موسى الذي سئل السبيل إلى لقيه فهل سمعت رسول الله صلى الله عليه وسلم يذكر شأنه قال إني سمعت رسول الله صلى الله عليه وسلم يقول \" بينا موسى في ملأ من بني إسرائيل إذ جاءه رجل فقال تعلم مكان رجل أعلم منك ؟ قال لا ; فأوحى الله إلى موسى بلى عبدنا خضر فسأل موسى السبيل إلى لقيه فجعل الله له الحوت آية وقيل له إذا فقدت الحوت فارجع فإنك ستلقاه فكان موسى يتبع أثر الحوت في البحر فقال فتى موسى لموسى: أرأيت إذ أوينا إلى الصخرة فإني نسيت الحوت قال موسى \" ذلك ماكنا نبغي فارتدا على آثارهما قصصا \" فوجدا عبدنا خضرًا فكان من شأنهما ما قص في كتابه."
    },
    {
      "ayah": 66,
      "surah": 18,
      "text": "يخبر تعالى عن قيل موسى عليه السلام لذلك الرجل العالم وهو الخضر الذي خصه الله بعلم لم يطلع عليه موسى كما أنه أعطى موسى من العلم ما لم يعطه الخضر \" قال له موسى هل أتبعك \" سؤال تلطف لا على وجه الإلزام والإجبار وهكذا ينبغي أن يكون سؤال المتعلم من العالم وقوله \" أتبعك \" أي أصحبك وأرافقك \" على أن تعلمن مما علمت رشدا \" أي مما علمك الله شيئًا أسترشد به في أمري من علم نافع وعمل صالح."
    },
    {
      "ayah": 67,
      "surah": 18,
      "text": "فعندها \"قال \" الخضر لموسى \"إنك لن تستطيع معي صبرا \" أي أنك لا تقدر على مصاحبتي لما ترى مني من الأفعال التي تخالف شريعتك لأني على علم من علم الله ما علمكه الله وأنت على علم من علم الله ما علمنيه الله فكل منا مكلف بأمور من الله دون صاحبه وأنت لا تقدر على صحبتي."
    },
    {
      "ayah": 68,
      "surah": 18,
      "text": "\"وكيف تصبر على ما لم تحط به خبرًا \" فأنا أعرف أنك ستنكر علي ما أنت معذور فيه ولكن ما اطلعت على حكمته ومصلحته الباطنة التي اطلعت أنا عليها دونك."
    },
    {
      "ayah": 69,
      "surah": 18,
      "text": "\" قال \" أي موسى \" ستجدني إن شاء الله صابرا \" أي على ما أرى من أمورك \" ولا أعصي لك أمرا \" أي ولا أخالفك في شيء فعند دلك شارطه الخضر عليه السلام."
    },
    {
      "ayah": 7,
      "surah": 18,
      "text": "فقال \" إنا جعلنا ما على الأرض زينة لها لنبلوهم أيهم أحسن عملا\" قال فتادة عن أبي نضرة عن أبي سعيد عن رسول الله صلى الله عليه وسلم أنه قال \" إن الدنيا حلوة خضرة وإن الله مستخلفكم فيها فناظر ماذا تعملون فاتقوا الدنيا واتقوا النساء فإن أول فتنة بني إسرائيل كانت في النساء \" ثم أخبر تعالى بزوالها وفنائها وفراغها وانقضائها وذهابها وخرابها."
    },
    {
      "ayah": 70,
      "surah": 18,
      "text": "\" قال فإن اتبعتني فلا تسألني عن شيء \" أي ابتداء \" حتى أحدث لك منه ذكرا \" أي حتى أبدأك أنا به قبل أن تسألني. قال ابن جرير: حدثنا حميد بن جبر حدثنا يعقوب عن هارون عن عبيدة عن أبيه عن ابن عباس قال سأل موسى عليه السلام ربه عز وجل فقال أي رب أي عبادك أحب إليك ؟ قال الذي يذكرني ولا ينساني قال فأي عبادك أقضى ؟ قال الذي يقض بالحق ولا يتبع الهوى قال أي رب أي عبادك أعلم ؟ قال الذي يبتغي علم الناس إلى علمه عسى أن يصيب كلمة تهديه إلى هدى أو ترده عن ردى قال أي رب هل في أرضك أحدا أعلم مني ؟ قال نعم قال فمن هو؟ قال الخضر قال وأين أطلبه ؟ قال على الساحل عند الصخرة التي ينفلت عندها الحوت قال فخرج موسى يطلبه حتى كان ما ذكر الله وانتهى موسى إليه عند الصخرة فسلم كل واحد منهما على صاحبه فقال له موسى إني أحب أن أصحبك قال إنك لن تطيق صحبتي قال بلى فال فإن صحبتني \" فلا تسألني عن شيء حتى أحدث لك منه ذكرًا \" قال فسار به في البحر حتى انتهى إلى مجمع البحرين وليس في الأرض مكان أكثر ماء منه قال وبعث الله الخطاف فجعل يستقي منه بمنقاره فقال لموسى كم ترى هذا الخطاف رزأ من هذا الماء قال: ما أقل ما رزأ قال يا موسى فإن علمي وعلمك في علم الله كقدر ما استقى هذا الخطاف من هذا الماء وكان موسى قد حدث نفسه أنه ليس أحد أعلم منه أو تكلم به فمن ثم أمر أن يأتي الخضر وذكر تمام الحديث في خرق السفينة وقتل الغلام وإصلاح الجدار وتفسيره له ذلك."
    },
    {
      "ayah": 71,
      "surah": 18,
      "text": "يقول تعالى مخبرا عن موسى وصاحبه وهو الخضر أنهما انطلقا لما توافقا واصطحبا واشترط عليه أن لا يسأله عن شيء أنكره حتى يكون هو الذي يبتدئه من تلقاء نفسه بشرحه وبيانه فركبا في السفينة وقد تقدم في الحديث كيف ركبا في السفينة وأنهم عرفوا الخضر فحملوهما بغير نول يعني بغير أجرة تكرمة للخضر فلما استقلت بهم السفينة في البحر ولججت أي دخلت اللجة قام الخضر فخرقها واستخرج لوحًا من ألواحها ثم رقعها فلم يملك موسى عليه السلام نفسه أن قال منكرا عليه \" أخرقتها لتغرق أهلها \" وهذه اللام لام العاقبة لا لام التعليل كما قال الشاعر: لدوا للموت وابنوا للخراب \" لقد جئت شيئًا إمرا \" قال مجاهد منكرًا وقال قتادة عجبًا فعندها قال له الخضر مذكرا بما تقدم من الشرط."
    },
    {
      "ayah": 72,
      "surah": 18,
      "text": "\" ألم أقل إنك لن تستطيع معي صبرا \" يعني وهذا الصنيع فعلته قصدا وهو من الأمور التي اشترطت معك أن لا تنكر علي فيها لأنك لم تحط بها خبرا ولها دخل هو مصلحة ولم تعلمه أنت."
    },
    {
      "ayah": 73,
      "surah": 18,
      "text": "\" قال \" أي موسى \" لا تؤاخذني بما نسيت ولا ترهقني من أمري عسرا \" أي لا تضيق علي ولا تشدد علي ولهذا تقدم في الحديث عن رسول الله صلى الله عليه وسلم أنه قال \" كانت الأولى من موسى نسيانا \"."
    },
    {
      "ayah": 74,
      "surah": 18,
      "text": "يقول تعالى \" فانطلقا \" أي بعد ذلك \" حتى إذا لقيا غلاما فقتله \" وقد تقدم أنه كان يلعب مع الغلمان في قرية من القرى وأنه عمد إليه من بينهم وكان أحسنهم وأجملهم وأضوأهم فقتله وروي أنه احتز رأسه وقيل رضخه بحجر وفي رواية اقتلعه بيده والله أعلم فلما شاهد موسى عليه السلام هذا أنكره أشد من الأول وبادر فقال \" أقتلت نفسًا زكية \" أي صغيرة لم تعمل الحنث ولا عملت إثما بعد فقتلته \" بغير نفس \" أي بغير مستند لقتله \" لقد جئت شيئًا نكرا \" أي ظاهر النكارة."
    },
    {
      "ayah": 75,
      "surah": 18,
      "text": "\" قال ألم أقل لك إنك لن تستطيع معي صبرا \" فأكد أيضًا وفي التذكار بالشرط الأول."
    },
    {
      "ayah": 76,
      "surah": 18,
      "text": "فلهذا قال له موسى \" إن سألتك عن شيء \" بعدها أي إن اعترضت عليك بشيء بعد هذه المرة \" فلا تصاحبني قد بلغت من لدني عذرا \" أي قد أعذرت إلي مرة بعد مرة فال ابن جرير: حدثنا عبد الله بن زياد حدثنا حجاج بن محمد عن حمزة الزيات عن أبي إسحاق عن سعيد بن جبير عن ابن عباس عن أبي بن كعب قال: كان النبي صلى الله عليه وسلم إذا ذكر أحدًا فدعا له بدأ بنفسه فقال ذات يوم \" رحمة الله علينا وعلى موسى لو لبث مع صاحبه لأبصر العجب ولكنه قال إن سألتك عن شيء بعدها فلا تصاحبني قد بلغت من لدني عذرا \"مثقلة."
    },
    {
      "ayah": 77,
      "surah": 18,
      "text": "يقول تعالى مخبرًا عنهما أنهما انطلقا بعد المرتين الأولتين حتى إذا أتيا أهل قرية روى ابن جريج عن ابن سيرين أنها الأيلة وفي الحديث \" حتي إذا أتيا أهل قرية لئاما \"أي بخلاء \" فأبوا أن يضيفوهما فوجدا فيها جدارًا يريد أن ينقض \" إسناد الإرادة ههنا إلى الجدار على سبيل الاستعارة فإن الإرادة في المحدثات بمعنى الميل والانقضاض هو السقوط وقوله \" فأقامه \" أي فرده إلى حالة الاستقامة وقد تقدم في الحديث أنه رده بيده ودعمه حتى ردّ ميله وهذا خارق فعند ذلك قال موسى \" له لو شئت لاتخذت عليه أجرًا \" أي لأجل أنهم لم يضيفونا كان ينبغي أن لا تعمل لهم مجانًا."
    },
    {
      "ayah": 78,
      "surah": 18,
      "text": "\" قال هذا فراق بيني وبينك \" أي لأنك شرطت عند قتل الغلام أنك إن سألتني عن شيء بعدها فلا تصاحبني فهو فراق بيني وبينك \" سأنبئك بتأويل \" أي بتفسير ما لم تستطع عليه صبرا."
    },
    {
      "ayah": 79,
      "surah": 18,
      "text": "هذا تفسير ما أشكل أمره على موسى عليه السلام ما كان أنكر ظاهره وقد أظهر الله الخضر عليه السلام على حكمة باطنة فقال: إن السفينة إنما خرقتها لأعيبها لأنهم كانوا يمرون بها على ملك من الظلمة \" يأخذ كل سفينة \" صالحة أي جيدة \" غصبا \" فأردت أن أعيبها لأرده عنها لعيبها فينتفع بهـا أصحابها المساكين الذين لم يكن لهم شيء ينتفعون به غيرها وقد قيل إنهم أيتام وروى ابن جريج عن وهب بن سليمان عن شعيب الجبائي أن اسم ذلك الملك هدد بن بدد وقد تقدما أيضًا في رواية البخاري وهو مذكور في التوراة في ذرية العيص بن إسحاق وهو من الملوك المنصوص عليهم في التوراة والله أعلم."
    },
    {
      "ayah": 8,
      "surah": 18,
      "text": "فقال تعالى وإنا لجاعلون ما عليها صعيدا جرزا أي وإنا لمصيروهابعد الزينة إلى الخراب والدمار فنجعل كل شيء عليها هالكًا صعيدًا جرزًا لا ينبت ولا ينتفع به كما قال العوفي عن ابن عباس في قوله تعالى وإنا لجاعلون ما عليها صعيدًا جرزا يقول يهلك كل شيء عليها ويبيد وقال مجاهد: صعيداً جرزًا بلقعًا وقال قتادة: الصعيد الأرض التي ليس فيها شجر ولا نبات وقال ابن زيد: الصعيد الأرض التي ليس فيها شيء ألا ترى إلى قوله تعالى \" أولم يروا أنا نسوق الماء إلى الأرض الجرز فنخرج به زرعا تأكل منه أنعامهم وأنفسهم أفلا يبصرون \" وقال محمد بن إسحاق وإنا لجاعلون ما عليها صعيًدا جرزًا يعني الأرض وأن ما عليها لفان وبائد وأن المرجع لإلى الله فلا تأس ولا يحزنك ما تسمع وترى."
    },
    {
      "ayah": 80,
      "surah": 18,
      "text": "وقد تقدم أن هذا الغلام كان اسمه حيثور وفي هذا الحديث عن ابن عباس عن أبي بن كعب عن النبي صلى الله عليه وسلم قال\" الغلام الذي قتله الخضر طبع يوم طبع كافرًا \"رواه ابن جرير من حديث ابن إسحاق عن سعيد عن ابن عباس به ولهذا قال \" فكان أبواه مؤمنين فخشينا أن يرهقهما طغيانا وكفرا \" أي يحملهما حبه على متابعته على الكفر قال قتادة: قد فرح به أبواه حين ولد وحزنا عليه حين قتل ولو بقي لكان فيه هلاكهما فليرضى امرؤ بقضاء الله فإن قضاء الله للمؤمن فما يكره خير له من قضائه فيما يحب وصح في الحديث \" لا يقضي الله لمؤمن قضاء إلا كان خيرًا له \"وقال تعالى \" وعسى أن تكرهوا شيئا وهو خير لكم \"."
    },
    {
      "ayah": 81,
      "surah": 18,
      "text": "وقوله \" فأردنا أن يبدلهما ربهما خيرًا منه زكاة وأقرب رحما \" أي ولدًا أزكى من هذا وهما أرحم به منه قاله ابن جريج وقال قتادة: أبر بوالديه وقد تقدم أنهما بدلا جارية وقيل لما قتله الخضر كانت أمه حاملا بغلام مسلم قاله ابن جريح."
    },
    {
      "ayah": 82,
      "surah": 18,
      "text": "في هذه الآية دليل على إطلاق القرية على المدينة لأنه قال أولا \" حتى إذا أتيا أهل قرية \" وقال ههنا \" فكان لغلامين يتيمين في المدينة \" كما قال تعالى \" فكأين من قرية هي أشد قوة من قريتك التي أخرجتك \" \" وقالوا لولا نزل هدا القرآن على رجل من القريتين عظيم \" يعني مكة والطائف ومعنى الآية أن هذا الجدار إنما أصلحته لأنه كان لغلامين يتيمين في المدينة وكان تحته كنز لهما قال عكرمة وقتادة وغير واحد كان تحته مال مدفون لهما وهو ظاهر السياق من الآية وهو اختيار ابن جرير رحمه الله وقال العوفي عن ابن عباس: كان تحته كنز علم وكذا قال سعيد بن جبير وقال مجاهد صحف فيها علم وقد ورد في حديث مرفوع ما يقوي ذلك.قال الحافظ أبو بكر أحمد بن عمرو بن عبد الخالق البزار في مسنده المشهور حدثنا إبراهيم بن سعيد الجوهري حدثنا بشر بن المنذر حدثنا الحارث بن عبد الله اليحصبي عن عياش بن عباس الغساني عن أبي حجيرة عن أبي ذر رفعه قال: إن الكنز الذي ذكره الله في كتابه لوح من ذهب مصمت مكتوب فيه: عجبت لمن أيقن بالقدر لم نصب وعجبت لمن ذكر النار لم ضحك وعجبت لمن ذكر الموت لم غفل لا إله إلا الله محمد رسول الله.وبشر بن المنذر هذا يقال له قاضي المصيصة قال الحافظ أبو جعفر العقيلي: في حديثه وهم وقد رُوي في هذا آثار عن السلف فقال ابن جرير في تفسيره: حدثني يعقوب حدثنا الحسن بن حبيب بن ندبة حدثنا سلمة عن نعيم العنبري وكان من جلساء الحسن قال: سمعت الحسن يعني البصري يقول في قوله \" وكان تحته كنز لهما \" قال لوح من ذهب مكتوب فيه: بسم الله الرحمن الرحيم عجبت لمن يؤمن بالقدر كيف يحزن وعجبت لمن يؤمن بالموت كيف يفرح وعجبت لمن يعرف الدنيا ومقلبها بأهلها كيف يطمئن إليها لا إله إلا الله محمد رسول الله.وحدثني يونس أخبرنا ابن وهب أخبرني عبد الله بن عباس عن عمر مولي غفرة قال: إن الكنز الذي قال الله في السورة التي يذكر فيها الكهف \" وكان تحته كنز \" لهما قال كان لوحًا من ذهب مصمت مكتوب فيه: بسم الله الرحمن الرحيم عجب لمن عرف النار ثم ضحك عجب لمن أيقن بالقدر ثم نصب عجب لمن أيقن بالموت ثم أمن أشهد أن لا إله إلا الله وأشهد أن محمدًا عبده ورسوله وحدثني أحمد بن حازم الغفاري حدثنا هنادة بنت مالك الشيبانية قالت سمعت صاحبي حماد بن الوليد الثقفي يقول: سمعت جعفر بن محمد يقول في قول الله تعالى \" وكان تحته كنز لهما \" قال سطران ونصف لم يتم الثالث: عجبت للمؤمن بالرزق كيف يتعب وعجبت للمؤمن بالحساب كيف يغفل وعجبت للمؤمن بالموت كيف يفرح.وقد قال الله \" وإن كان مثقال حبة من خردل أتينا بها وكفى بنا حاسبين \" قالت وذكر أنهما حفظا بصلاح أبيهما ولم يذكر منهما صلاح وكان بينهما وبين الأب الذي حفظا به سبعة آباء وكان نساجًا وهذا الذي ذكره هؤلاء الأئمة وورد به الحديث المتقدم وإن صح لا ينافي قول عكرمة أنه كان مالا لأنهم ذكروا أنه كان لوحًا من ذهب وفيه مال جزيل أكثر ما زادوا أنه كان مودعًا فيه علم وهو حكم ومواعظ والله أعلم وقوله \" وكان أبوهما صالحا \" فيه دليل على أن الرجل الصالح يحفظ في ذريته وتشمل بركة عبادته لهم في الدنيا والآخرة بشفاعته فيهم ورفع درجتهم إلى أعلى درجة في الجنة لتقر عينه بهم كما جاء في القرآن ووردت به السنة.قال سعيد بن جبير: عن ابن عباس حفظا بصلاح أبيهما ولم يذكر لهما صلاحًا وتقدم أنه كان الأب السابع فالله أعلم.وقوله \" فأراد ربك أن يبلغا أشدّهما ويستخرجا كنزهما \" ههنا أسند الإرادة إلى الله تعالى لأن بلوغهما الحلم لا يقدر عليه إلا الله وقال في الغلام فأردنا أن يبدلهما ربهما خيرًا منه زكاة وقال في السفينة فأردت أن أعيبها فالله أعلم.وقوله تعالى رحمة من ربك وما فعلته عن أمري أي هذا الذي فعلته في هذه الأحوال الثلاثة إنما هو من رحمة الله بمن ذكرنا من أصحاب السفينة ووالدي الغلام وولدي الرجل الصالح وما فعلته عن أمري أي لكني أمرت به ووقفت عليه وفيه دلالة لمن قال بنبوة الخضر عليه السلام مع ما تقدم من قوله \" فوجدا عبدًا من عبادنا آتيناه رحمة من عندنا وعلمناه من لدنا علمًا \" وقال آخرون كان رسولا وقيل بل كان ملكًا نقله الماوردي في تقسيره وذهب كثيرون إلى أنه لم يكن نبيًا بل كان وليًا فالله أعلم.وذكر ابن قتيبة في المعارف أن اسم الخضر بليا بن ملكان بن فالغ بن عامر بن شالخ بن أرفخشد بن سام بن نوح عليه السلام قالوا وكان يُكنى أبا العباس ويلقب بالخضر وكان من أبناء الملوك ذكره النووي في تهذيب الأسماء وحكى هو وغيره في كونه باقيًا إلى الآن ثم إلى يوم القيامة قولين ومال هو وابن الصلاح إلى بقائه وذكروا في ذك حكايات وآثارا عن السلف وغيرهم وجاء ذكره في بعض الأحاديث ولا يصح شيء من ذلك وأشهرها حديث التعزية وإسناده ضعيف ورجح آخرون من المحدثين وغيرهم خلاف ذلك واحتجوا بقوله تعالى \" وما جعلنا لبشر من قبلك الخلد \" وبقول النبي صلى الله عليه وسلم يوم بدر \" اللهم إن تهلك هذه العصابة لا تعبد في الأرض \"وبأنه لم ينقل أنه جاء إلى رسول الله صلى الله عليه وسلم ولا حضر عنده ولا قاتل معه ولو كان حيا لكان من أتباع النبي صلى الله عليه وسلم وأصحابه لأنه عليه السلام كان مبعوثًا إلى جميع الثقلين الجن والإنس وقد قال \" لو كان موسى وعيسى حيين لما وسعهما إلا اتباعي \"وأخبر قبل موته بقليل أنه لا يبقى ممن هو على وجه الأرض إلى مائة سنة من ليلته تلك عين تطرف إلى غير ذلك من الدلائل. قال الإمام أحمد: حدثنا يحيى بن آدم حدثنا ابن المبارك عن معمر عن همام بن منبه عن أبي هريرة رضي الله عنه عن النبي صلى الله عليه وسلم في الخضر قال \" إنما سُمي خضرا لأنه جلس على فروة بيضاء فإذا هي تهتز من تحته خضراء \"ورواه أيضًا عن عبد الرزاق وقد ثبت أيضًا في صحيح البخاري عن همام عن أبي هريرة أن رسول الله صلى الله عليه وسلم قال \" إنما سمي الخضر لأنه جلس على فروة فإذا هي تهتز من تحته خضراء \"والمراد بالفروة ههنا الحشيش اليابس وهو الهشيم من النبات قاله عبد الرزاق.وقيل المراد بذلك وجه الأرض وقوله \" ذلك تأويل مالم تسطع عليه صبرا \" أي هذا تفسير ما ضقت به ذرعًا ولم تصبر حتى أخبرك به ابتداء ولما أن فسره له وبينه ووضحه وأزال المشكل قال \" تسطع \" وقبل ذلك كان الإشكال قويًا ثقيلا فقال \" سأنبئك بتأويل ما لم تستطع عليه صبرا \" فقابل الأثقل بالأثقل والأخف كما قال \" فما اسطاعوا أن يظهروه \" وهو الصعود إلى أعلاه \" وما استطاعوا له نقبا \" وهو أشق من ذلك فقابل كلا بما يناسبه لفظًا ومعنى والله أعلم.فإن قيل: فما بال فتى موسى ذكر في أول القصة ثم لم يذكر بعد ذلك ؟ فالجواب أن المقصود بالسياق إنما هو قصة موسى مع الخضر وذكر ما كان بينهما وفتى موسى معه تبع وقد صرح في الأحاديث المتقدمة في الصحاح وغيرها أنه يوشع بن نون وهو الذي كان يلي بني إسرائيل بعد موسى عليه السلام ؟ وهذا يدل على ضعف ما أورده ابن جرير في تفسيره حيث قال: حدثنا ابن حميد حدثنا سلمة حدثني ابن إسحاق عن الحسن بن عمارة عن أبيه عن عكرمة قال قيل لابن عباس: لم نسمع لفتى موسى بذكر حديث وقد كان معه قال ابن عباس فيما يذكر من حديث الفتى قال شرب الفتى من الماء فخلد فأخذه العالم فطابق به سفينة ثم أرسله في البحر فإنها لتموج به إلى يوم القيامة وذلك أنه لم يكن له أن يشرب منه فشرب إسناده ضعيف والحسن متروك وأبوه غير معروف."
    },
    {
      "ayah": 83,
      "surah": 18,
      "text": "يقول تعالى لنبيه صلى الله عليه وسلم \" ويسئلونك \" يا محمد \" عن ذي القرنين \" أي عن خبره.وقد قدمنا أنه بعث كفار مكة إلى أهل الكتاب يسألون منهم ما يمتحنون به النبي صلى الله عليه وسلم فقالوا سلوه عن رجل طواف في الأرض وعن فتية ما يدرى ما صنعوا وعن الروح فنزلت سورة الكهف وقد أورد ابن جرير ههنا والأموي في مغازيه حديثًا أسنده وهو ضعيف عن عقبة بن عامر أن نفرا من اليهود جاءوا يسألون النبي صلى الله عليه وسلم عن ذي القرنين فأخبرهم بما جاءوا له ابتداء فكان فيما أخبرهم به أنه كان شابا من الروم وأنه بنى الإسكندرية وأنه علا به ملك إلى السماء وذهب به إلى السد ورأى أقواما وجوههم مثل وجوه الكلاب وفيه طول ونكارة ورَفْعُهُ لا يصح وأكثر ما فيه أنه من أخبار بني إسرائيل والعجب أن أبا زرعة الرازي مع جلالة قدره ساقه بتمامه في كتابه دلائل النبوة وذلك غريب منه وفيه من النكارة أنه من الروم وإنما الذي كان من الروم الإسكندر الثاني وهو ابن فيليس المقدوني الذي تؤرخ به الروم فأما الأول فقد ذكر الأزرقي وغيره أنه طاف بالبيت مع إبراهيم الخليل عليه السلام أول ما بناه وآمن به واتبعه وكان وزيره الخضر عليه السلام وأما الثاني فهو إسكندر بن فيليس المقدوني اليوناني وكان وزيره ارسطاطاليس الفيلسوف المشهور والله أعلم وهو الذي تؤرخ من مملكته ملة الروم وقد كان قبل المسيح عليه السلام بنحو من ثلثمائة سنة فأما الأول المذكور في القرآن فكان في زمن الخليل كما ذكره الأزرفي وغيره وأنه طاف مع الخليل عليه السلام بالبيت العتيق لما بناه إبراهيم عليه السلام وقرب إلى الله قربانا وقد ذكرنا طرفًا صالحًا من أخباره في كتاب البداية والنهاية بما فيه كفاية ولله الحمد.وقال وهب بن منبه: كان ملكًا وإنما سمي ذا القرنين لأن صفحتي رأسه كانتا من نحاس قال: وقال بعض أهل الكتاب لأنه ملك الروم وفارس وقال بعضهم كان في رأسه شبه القرنين وقال سفيان الثوري عن حبيب بن أبي ثابت عن أبي الطفيل قال: سئل علي رضي الله عنه عن ذي القرنين فقال كان عبدًا ناصحًا لله فناصحه دعا قومه إلى الله فضربوه على قرنه فمات فأحياه الله فدعا قومه إلى الله فضربوه على قرنه فمات فسمي ذا القرنين وكذا رواه شعبة عن القاسم بن أبي بزة عن أبي الطفيل سمع عليا يقول ذلك ويقال إنه إنما سمي ذا القرنين لأنه بلغ المشارق والمغارب من حيث يطلع قرن الشمس ويغرب."
    },
    {
      "ayah": 84,
      "surah": 18,
      "text": "وقوله \" إنا مكنا له في الأرض \" أي أعطيناه ملكًا عظيمًا ممكنا فيه من جميع ما يؤتى الملوك من التمكين والجنود وآلات الحرب والحصارات ولهذا ملك المشارق والمغارب من الأرض ودانت له البلاد وخضعت له ملوك العباد وخدمته الأمم من العرب والعجم ولهذا ذكر بعضهم أنه إنما سُمي ذا القرنين لأنه بلغ قرني الشمس مشرقها ومغربها وقوله \" وآتيناه من كل شيء سببا \" قال ابن عباس ومجاهد وسعيد بن جبير وعكرمة والسدي وقتادة والضحاك وغيرهم يعني علمًا وقال قتادة أيضًا في قوله \" وآتيناه من كل شيء سببا \" قال: منازل الأرض وأعلامها ْ وقال عبد الرحمن بن زيد بن أسلم في قوله \" وآتيناه من كل شيء سببا \" قال تعليم الألسنة قال كان لا يغزو قومًا إلا كلمهم بلسانهم وقال ابن لهيعة: حدثني سالم بن غيلان عن سعيد بن أبي هلال أن معاوية بن أبي سفيان قال لكعب الأحبار: أنت تقول إن ذا القرنين كان يربط خيله بالثريا؟ فقال له كعب إن كنت قلت ذلك فإن الله قال \" وآتيناه من كل شيء سببا \" وهذا الذي أنكره معاوية رضي الله عنه على كعب الأحبار هو الصواب والحق مع معاوية في ذلك الإنكار فإن معاوية كان يقول عن كعب: إن كنا لنبلو عليه الكذب يعني فيما ينقله لا أنه كان يتعمد نقل ما ليس في صحفه ولكن الشأن في صحفه أنها من الإسرائيليات التي غالبها مبدل مصحف محرف مختلق ولا حاجة لنا مع خبر الله تعالى ورسول الله صلى الله عليه وسلم إلى شيء منها بالكلية فإنه دخل منها على الناس شر كثير وفساد عريض.وتأويل كعب قول الله \" وآتيناه من كل شيء سببا \" واستشهاده في ذلك على ما يجده في صحفه من أنه كان يربط خيله بالثريا غير صحيح ولا مطابق فإنه لا سبيل للبشر إلى شيء من ذلك ولا إلى الترقي في أسباب السموات وقد قال الله في حق بلقيس \" وأوتيت من كل شيء \" أي مما يؤتى مثلها من الملوك وهكذا ذو القرنين يسر الله له الأسباب أي الطرق والوسائل إلى فتح الأقاليم والرساتيق والبلاد والأراضي وكسر الأعداء وكبت ملوك الأرض وإذلال أهل الشرك قد أوتي من كل شيء مما يحتاج إليه مثله سببًا والله أعلم. وفي المختارة للحافظ الضياء المقدسي من طريق قتيبة عن أبي عوانة عن سماك بن حرب عن حبيب بن حماد قال: كنت عند علي رضي الله عنه وسأله رجل عن ذي القرنين كيف بلغ المشرق والمغرب ؟ فقال سبحان الله سخر له السحاب وقدر له الأسباب وبسط له اليد."
    },
    {
      "ayah": 85,
      "surah": 18,
      "text": "قال ابن عباس \" فأتبع سببًا \" يعني بالسبب المنزل وقال مجاهد فأتبع سببًا منزلا وطريقًا ما بين المشرق والمغرب وفي رواية عن مجاهد \" سببًا \" قال طرفي الأرض وقال قتادة أي أتبع منازل الأرض ومعالمها وقال الضحاك \" فأتبع سببًا \" أي المنازل وقال سعيد بن جبير في قوله: \" فأتبع سببًا \" قال علمًا وهكذا قال عكرمة وعبيد بن يعلى والسدي وقال مطر: معالم وآثار كانت قبل ذلك."
    },
    {
      "ayah": 86,
      "surah": 18,
      "text": "وقوله: \" حتى إذا بلغ مغرب الشمس \" أي فسلك طريقًا حتى وصل إلى أقصى ما يسلك فيه من الأرض من ناحية المغرب وهو مغرب الأرض وأما الوصول إلى مغرب الشمس من السماء فمتعذر وما يذكره أصحاب القصص والأخبار من أنه سار في الأرضى مدة والشمس تغرب من ورائه فشيء لا حقيقة له وأكثر ذلك من خرافات أهل الكتاب واختلاف زنادقتهم وكذبهم وقوله: \" وجدها تغرب في عين حمئة \" أي رأى الشمس في منظره تغرب في البحر المحيط وهذا شأن كل من انتهى إلى ساحله يراها كأنها تغرب فيه وهي لا تفارق الفلك الرابع الذي هي مثبتة فيه لا تفارقه والحمئة مشتقة على إحدى القراءتين من الحمأة وهو الطين كما قال تعالى: \" إني خالق بشرًا من صلصال من حمإ مسنون \" أي طين أملس وقد تقدم بيانه وقال ابن جرير: حدثني يونس أخبرنا ابن وهب أنبأنا نافع بن أبي نعيم سمعت عبد الرحمن الأعرج يقول كان ابن عباس يقول في عين حمئة ثم فسرها ذات حمأة قال نافع: وسئل عنها كعب الأحبار فقال أنتم أعلم بالقرآن مني ولكن أجدها في الكتاب تغيب في طينة سوداء وكذا روى غير واحد عن ابن عباس وبه قال مجاهد وغير واحد: وقال أبو داود الطيالسي: حدثنا محمد بن دينار عن سعد بن أوس عن مصدع عن ابن عباس عن أبي بن كعب أن النبي صلى الله عليه وسلم أقرأه حمئة وقال علي بن أبي طلحة عن ابن عباس وجدها تغرب في عين حامية يعني حارة وكذا قال الحسن البصري وقال ابن جرير: والصواب أنهما قراءتان مشهورتان وأيهما قرأ القارئ فهو مصيب قلت ولا منافاة بين معنييهما إذ قد تكون حارة لمجاورتهـا وهج الشمس عند غروبها وملاقاتها الشعاع بلا حامل وحمئة في ماء وطين أسود كما قال كعب الأحبار وغيره وقال ابن جرير حدثنا محمد بن المثنى حدثنا يزيد بن هارون أخبرنا العوام حدثني مولى لعبد الله بن عمرو عن عبد الله قال نظر رسول الله صلى الله عليه وسلم إلى الشمس حين غابت فقال: \" في نار الله الحامية لولا ما يزعها من أمر الله لأحرقت ما على الأرض \"قلت ورواه الإمام أحمد عن يزيد بن هارون وفي صحة رفع هذا الحديث نظر ولعله من كلام عبد الله بن عمرو من زاملتيه اللتين وجدهما يوم اليرموك والله أعلم وقال ابن أبي حاتم حدثنا حجاج بن حمزة حدثنا محمد يعني ابن بشر حدثنا عمرو بن ميمون أنبأنا ابن حاضر أن ابن عباس ذكر له أن معاوية بن أبي سفيان قرأ الآية التي في سورة الكهف \" تغرب في عين حامية \" قال ابن عباس لمعاوية ما نقرؤها إلا حمئة فسأل معاوية عبد الله بن عمرو كيف تقرؤها فقال عبد الله كما قرأتها قال ابن عباس فقلت لمعاوية في بيتي نزل القرآن فأرسل إلى كعب فقال له أين تجد الشمس تغرب في التوراة ؟ فقال له كعب سل أهل العربية فإنهم أعلم بها وأما أنا فإني أجد الشمس تغرب في التوراة في ماء وطين وأشار بيده إلى المغرب قال ابن حاضر لو أني عندك أفدتك بكلام تزداد فيه بصيرة في حمئة قال ابن عباس وإذا ما هو قلت فيما يؤثر من قول تبع فيما ذكر به ذا القرنين في تخلقه بالعلم واتباعه إياه بلغ المشارق والمغارب يبتغي أسباب أمر من حكيم مرشد فرأى مغيب الشمس عند غروبها في عين ذى خلب وثاط حرمد فقال ابن عباس ما الخلب قلت الطين بكلامهم قال فما الثاط قلت الحمأة قال فما الحرمد قلت الأسود قال فدعا ابن عباس رجلا أو غلامًا فقال اكتب ما يقول هذا الرجل وقال سعيد بن جبير بينا ابن عباس يقرأ سورة الكهف فقرأ \" وجدها تغرب في عين حمئة \" فقال كعب والذي نفس كعب بيده ما سمعت أحدًا يقرؤها كما أنزلت في التوراة غير ابن عباس فإنا نجدها في التوراة تغرب في مدرة سوداء وقال أبو يعلى الموصلي حدثنا إسحاق بن أبي إسرائيل حدثنا هشام بن يوسف قال في تفسير ابن جريج \" ووجد عندها قومًا \" قال مدينة لها اثنا عشـر ألف باب لولا أصوات أهلها لسمع الناس وجوب الشمس حين تجب وقوله: \" ووجد عندها قومًا \" أي أُمَّة من الأمم ذكروا أنها كانت أما عظيمة من بني آدم وقوله \" قلنا يا ذا القرنين إما أن تعذب وإما أن تتخذ فيهم حسنًا \" معنى هذا أن الله تعالى مكنه منهم وحكمه فيهم وأظفره بهم وخيره إن شاء قتل وسبى وإن شاء من أو فدى فعرف عدله وإيمانه فيما أبداه عدله وبيانه."
    },
    {
      "ayah": 87,
      "surah": 18,
      "text": "في قوله \" أما من ظلم \" أي استمر على كفره وشركه بربه فسوف نعذبه قال قتادة بالقتل وقال السدي كان يحمي لهم بقر النحاس ويضعهم فيها حتى يذوبوا وقال وهب بن منبه كان يسلط الظلمة فتدخل أجوافهم وبيوتهم وتغشاهم من جميع جهاتهم والله أعلم وقوله \" ثم يرد إلى ربه فيعذبه عذابًا نكرًا \" أي شديدًا بليغًا وجيعًا أليمًا وفي هذا إثبات المعاد والجزاء."
    },
    {
      "ayah": 88,
      "surah": 18,
      "text": "وقوله: \" وأما من آمن \" أي تابعنا على ما ندعوه إليه من عبادة الله وحده لا شريك له \" فله جزاء الحسنى \" أي في الدار الآخرة عند الله عز وجل \" وسنقول له من أمرنا يسرًا \" قال مجاهد معروفًا."
    },
    {
      "ayah": 89,
      "surah": 18,
      "text": "يقول تعالى ثم سلك طريقًا فسار من مغرب الشمس إلى مطلعها وكان كلما مر بأمة قهرهم وغلبهم ودعاهم إلى الله عز وجل فإن أطاعوه وإلا أذلهم وأرغم آنافهم واستباح أموالهم وأمتعتهم واستخدم من كل أمة ما تستعين به جيوشه على قتال الإقليم المتاخم لهم."
    },
    {
      "ayah": 9,
      "surah": 18,
      "text": "هذا إخبار من الله تعالى عن قصة أصحاب الكهف على سبيل الإجمال والاختصار ثم بسطها بعد ذلك فقال \" أم حسبت \" يعني يا محمد \" أن أصحاب الكهف والرقيم كانوا من آياتنا عجبا\" أي ليس أمرهم عجيبًا في قدرتنا وسلطاننا فإن خلق السموات والأرض واختلاف الليل والنهار وتسخير الشمس والقمر والكواكب وغير ذلك من الآيات العظيمة الدالة على قدرة الله تعالي وأنه على ما يشاء قادر ولا يعجزه شيء أعجب من أخبار أصحاب الكهف كما قال ابن جريج عن مجاهد \" أم حسبت أن أصحاب الكهف والرقيم كانوا من آياتنا عجبًا \" يقول قد كان من آياتنا ما هو أعجب من ذلك وقال العوفي عن ابن عباس \" أم حسبت أن أصحاب الكهف والرقيم كانوا من آياتنا عجبا \" يقول الذي آتيك من العلم والسنة والكتاب أفضل من شأن أصحاب الكهف والرقيم وقال محمد بن إسحاق: ما أظهرت من حججي على العباد أعجب من شأن أصحاب الكهف والرقيم وأما الكهف فهو الغار في الجبل وهو الذي لجأ إليه هؤلاء الفتية المذكورون وأما الرقيم فقال العوفي عن ابن عباس: هو وادٍ قريب من أيلة وكذا قال عطية العوفي وقتادة.وقال الضحاك أما الكهف فهو غار الوادي والرقيم اسم الوادي وقال مجاهد الرقيم كتاب بنياتهم ويقول بعضهم هو الوادي الذي فيه كهفهم وقال عبد الرزاق: أخبرنا الثوري عن سماك عن عكرمة عن ابن عباس في قوله الر قيم كان يزعم كعب أنها القرية وقال ابن جريج عن ابن عباس: الرقيم الجبل الذي فيه الكهف وقال ابن إسحاق عن عبدالله بن أبي نجيح عن مجاهد عن ابن عباس قال: اسم ذلك الجبل بنجلوس وقال ابن جريج: أخبرني وهب بن سليمان عن شعيب الجبائي أن اسم جبل الكهف بنجلوس واسم الكهف حيزم والكلب حمران وقال عبد الرزاق: أنبأنا إسرائيل عن سماك عن عكرمة عن ابن عباس قال: القرآن أعلمه الاحنانا والأواه والرقيم وقال ابن جريج: أخبرني عمرو بن دينار أنه سمع عكرمة يقول قال ابن عباس ما أدري ما الرقيم ؟ كتاب أم بنيان ؟ وقال علي بن أبي طلحة عن ابن عباس: الرقيم الكتاب وقال سعيد بن جبير: الرقيم لوح من حجارة كتبوا فيه.أصحاب الكهف ثم وضعوه على باب الكهف. وقال عبد الرحمن بن زيد بن أسلم: الرقيم الكتاب ثم قرأ كتاب مرقوم وهذا هو الظاهر من الآية وهو اختيار ابن جرير قال الرقيم فعيل بمعنى مرقوم كما يقول للمقتول قتيل وللمجروح جريح والله أعلم."
    },
    {
      "ayah": 90,
      "surah": 18,
      "text": "وذكر في أخبار بني إسرائيل أنه عاش ألفًا وستمائة سنة يجوب الأرض طولها والعرض حتى بلغ المشارق والمغارب ولما انتهى إلى مطلع الشمس من الأرض كما قال تعالى \" وجدها تطلع على قوم \" أي أمة \" لم نجعل لهم من دونها سترًا \" أي ليس لهم بناء يكنهم ولا أشجار تظلهم وتسترهم من حر الشمس قال سعيد بن جبير كانوا حمرًا قصارًا مساكنهم الغيران أكثر معيشتهم من السمك. وقال أبو داود الطيالسي: حدثنا سهل بن أبي الصلت سمعت الحسن وسئل عن قول الله تعالى \" لن نجعل لهم من دونها سترًا \" قال إن أرضهم لا تحمل البناء فإذا طلعت الشمس تغوروا في المياه فإذا غربت خرجوا يتراعون كما ترعى البهائم قال الحسن هذا حديث سمرة وقال قتادة ذكر لنا أنهم بأرض لا تنبت لهم شيئًا فهم إذا طلعت الشمس دخلوا في أسراب حتى إذا زالت الشمس خرجوا إلى حروثهم ومعايشهم وعن سلمة بن كهيل أنه قال: ليست لهم أكنان إذا طلعت الشمس طلعت عليهم فلأحدهم أذنان يفرش إحداهما ويلبس الأخرى.قال عبد الرزاق: أخبرنا معمر عن قتادة في قوله: \" وجدها تطلع على قوم لم نجعل لهم من دونها سترًا \" قال هم الزنج وقال ابن جرير في قوله \" وجدها تطلع على قوم لم نجعل لهم من دونها سترًا \" قال لم يبنوا فيها بناء قط ولم يبن عليهم فيها بناء قط كانوا إذا طلعت الشمس دخلوا أسرابًا لهم حتى تزول الشمس أو دخلوا البحر وذلك أن أرضهم ليس فيها جبل.جاءهم جيش مرة فقال لهم أهلها: لا تطلعن عليكم الشمس وأنتم بها قالوا لا نبرح حتى تطلع الشمس ما هذه العظام ؟ قالوا هذه جيف جيش طلعت عليهم الشمس ههنا فماتوا قال فذهبوا هاربين في الأرض."
    },
    {
      "ayah": 91,
      "surah": 18,
      "text": "وقوله \" كذلك وقد أحطنا بما لديه خبرا \" قال مجاهد والسدي: علمًا أي نحن مطلعون على جميع أحواله وأحوال جيشه لا يخفى علينا منها شيء وإن تفرقت أممهم وتقطعت بهم الأرض فإنه تعالى \" لا يخفى عليه شيء في الأرض ولا في السماء \"."
    },
    {
      "ayah": 92,
      "surah": 18,
      "text": "يقول تعالى مخبرا عن ذي القرنين \" ثم أتبع سببًا \" أي ثم سلك طريقًا من مشارق الأرض."
    },
    {
      "ayah": 93,
      "surah": 18,
      "text": "حتى إذا بلغ بين السدين وهما جبلان متناوحان بينهما ثغرة يخرج منها يأجوج ومأجوج على بلاد الترك فيعيثون فيها فسادًا ويهلكون الحرث والنسل ويأجوج ومأجوج من سلالة آدم عليه السلام كما ثبت في الصحيحين \" إن الله تعالى يقول: يا آدم فيقول لبيك وسعديك فيقول ابعث بعث النار فيقول وما بعث النار ؟ فيقول من كل ألف تسعمائة وتسعة وتسعون إلى النار وواحد إلى الجنة فحينئذ يشيب الصغير وتضع كل ذات حمل حملها فقال إن فيكم أُمَّتين ما كانتا في شيء إلا كثرتاه يأجوج ومأجوج \"وقد حكى النووي رحمه الله في شرح مسلم عن بعض الناس أن يأجوج ومأجوج خلقوا من مني خرج من آدم فاختلط بالتراب فخلقوا من ذلك فعلى هذا يكونون مخلوقين من آدم وليسوا من حواء وهذا قول غريب جدا لا دليل عليه لا من عقل ولا من نقل ولا يجوز الاعتماد ههنا على ما يحكيه بعض أهل الكتاب لما عندهم من الأحاديث المفتعلة والله أعلم وفي مسند الإمام أحمد عن سمرة أن رسول الله صلى الله عليه وسلم قال: \" ولد نوح ثلاثة: سام أبو العرب وحام أبو السودان و يافث أبو الترك \"قال بعض العلماء هؤلاء من نسل يافث أبي الترك وقال إنما سمي هؤلاء تركًا لأنهم تركوا من وراء السد من هذه الجهة وإلا فهم أقرباء أولئك لكن كان في أولئك بغي وفساد وجراءة وقد ذكر ابن جرير ههنا عن وهب بن منبه أثرًا طويلاً عجيبًا في سير ذي القرنين وبنائه السد وكيفية ما جرى له وفيه طول وغرابة ونكارة في أشكالهم وصفاتهم وطولهم وقصر بعضهم وآذانهم وروى ابن أبي حاتم عن أبيه في ذلك أحاديث غريبة لا تصح أسانيدها والله أعلم.وقوله \" وجد من دونهم قومًا لا يكادون يفقهون قولا \" أي لاستعجام كلامهم وبعدهم عن الناس."
    },
    {
      "ayah": 94,
      "surah": 18,
      "text": "\" قالوا يا ذا القرنين إن يأجوج ومأجوج مفسدون في الأرض فهل نجعل لك خرجًا \" قال ابن جريج عن عطاء عن ابن عباس أجرًا عظيمًا يعني أنهم أرادوا أن يجمعوا له من بينهم ما لا يعطونه إياه حتى يجعل بينه وبينهم سدًا فقال ذو القرنين بعفة وديانة وصلاح وقصد للخير."
    },
    {
      "ayah": 95,
      "surah": 18,
      "text": "\" ما مكني فيه ربي خير \" أي إن الذي أعطاني الله من الملك والتمكين خير لي من الذي تجمعونه كما قال سليمان عليه السلام\" أتمدونن بمال فما آتاني الله خير مما آتاكم\" الآية وهكذا قال ذو القرنين الذي أنا فيه خير من الذي تبذلونه ولكن ساعدوني بقوة أي بعملكم وآلات البناء."
    },
    {
      "ayah": 96,
      "surah": 18,
      "text": "\" أجعل بينكم وبينهم ردمًا آتوني زبر الحديد \" والزبر جمع زبرة وهي القطعة منه قاله ابن عباس ومجاهد وقتادة وهي كاللبنة يقال كل لبنة زنة قنطار بالدمشقي أو تزيد عليه \" حتى إذا ساوى بين الصدفين \" أي وضع بعضه على بعض من الأساس حتى إذا حاذى به رءوس الجبلين طولا وعرضًا واختلفوا في مساحة عرضه وطوله على أقوال \" قال انفخوا \" أي أجج عليه النار حتى صار كله نارًا \" قال آتوتي أفرغ عليه قطرا \" قال ابن عباس ومجاهد وعكرمة والضحاك وقتادة والسدي هو النحاس زاد بعضهم المذاب ويستشهد بقوله تعالى وأسلنا له عين القطر ولهذا يشبه بالبرد المحبر قال ابن جرير: حدثنا بشر بن يزيد حدثنا سعيد عن قتادة قال: ذكر لنا أن رجلا قال يا رسول الله قد رأيت سد يأجوج ومأجوج قال \" انعته لي \"قال كالبرد المحبر طريقة سوداء وطريقة حمراء قال \" قد رأيته \"هذا حديث مرسل.وقد بعث الخليفة الواثق في دولته بعض أمرائه وجهز معه جيشًا سرية لينظروا إلى السد ويعاينوه وينعتوه له إذا رجعوا فتوصلوا من بلاد إلى بلاد ومن ملك إلى ملك حتى وصلوا إليه ورأوا بناءه من الحديد ومن النحاس وذكروا أنهم رأوا فيه بابًا عظيمًا وعليه أقفال عظيمة ورأوا بقية اللبن والعمل في برج هناك وأن عنده حرسًا من الملوك المتاخمة له وأنه عال منيف شاهق لا يستطاع ولا ما حوله من الجبال ثم رجعوا إلى بلادهم وكانت غيبتهم أكثر من سنتين وشاهدوا أهوالا وعجائب ثم قال الله تعالى."
    },
    {
      "ayah": 97,
      "surah": 18,
      "text": "يقول تعالى مخبرًا عن يأجوج ومأجوج أنهم ما قدروا على أن يصعدوا من فوق هذا السد ولا قدروا على نقبه من أسفله ولما كان الظهور عليه أسهل من نقبه قابل كلا بما يناسبه فقال \" فما اسطاعوا أن يظهروه وما استطاعوا له نقبًا \" وهذا دليل على أنهم لم يقدروا على نقبه ولا على شيء منه.فأما الحديث الذي رواه الإمام أحمد حدثنا روح حدثنا سعيد بن أبي عروبة عن قتادة حدثنا أبو رافع عن أبي هريرة عن رسول الله صلى الله عليه وسلم قال: \" إن يأجوج ومأجوج ليحفرون السد كل يوم حتى إذا كادوا يرون شعاع الشمس قال الذي عليهم ارجعوا فستحفرونه غدًا فيعودون إليه كأشد ما كان حتى إذا بلغت مدتهم وأراد الله أن يبعثهم على الناس حفروا حتى إذا كادوا يرون شعاع الشمس قال الذي عليهم ارجعوا فستحفرونه غدا إن شاء الله فيستثني فيعودون إليه وهو كهيئته حين تركوه فيحفرونه ويخرجون على الناس فينشفون المياه ويتحصن الناس منهم في حصونهم فيرمون بسهامهم إلى السماء فترجع وعليها كهيئة الدم فيقولون قهرنا أهل الأرض وعلونا أهل السماء فيبعث الله عليهم نغفًا في رقابهم فيقتلهم بها قال رسول الله صلى الله عليه وسلم \" والذي نفس محمد بيده إن دواب الأرض لتسمن وتشكر شكرًا من لحومهم ودمائهم \"ورواه أحمد أيضًا عن حسن هو ابن موسى الأشهب عن سفيان عن قتادة به وكذا رواه ابن ماجه عن أزهر بن مروان عن عبد الأعلى عن سعيد بن أبي عروبة عن قتادة قال حدث أبو رافع وأخرجه الترمذي من حديث أبي عوانة عن قتادة ثم قال غريب لا يعرف إلا من هذا الوجه وإسناده جيد قوي ولكن متنه في رفعه نكارة لأن ظاهر الآية يقتضي أنهم لم يتمكنوا من ارتقائه ولا من نقبه لإحكام بنائه وصلابته وشدته ولكن هذا قد روي عن كعب الأحبار أنهم قبل خروجهم يأتونه فيلحسونه حتى لا يبقى منه إلا القليل فيقولون غدًا نفتحه فيأتون من الغد وقد عاد كما كان فيلحسونه حتى لا يبقى منه إلا القليل فيقولون كذلك فيصبحون وهو كما كان فيلحسونه ويقولون غدًا نفتحه ويلهمون أن يقولوا إن شاء الله فيصبحون وهو كما قارقوه فيفتحونه وهذا متجه ولعل أبا هريرة تلقاه من كعب فإنه كان كثيرًا ما كان يجالسه ويحدثه فحدث به أبو هريرة فتوهم بعض الرواة عنه أنه مرفوع فرفعه والله أعلم. ويؤيد ما قلناه من أنهم لم يتمكنوا من نقبه ولا نقب شيء منه ومن نكارة هذا المرفوع قول الإمام أحمد حدثنا سفيان عن الزهري عن عروة عن زينب بنت أبي سلمة عن حبيبة بنت أم حبيبة بنت أبي سفيان عن أمها أم حبيبة عن زينب بنت جحش زوج النبي صلى الله عليه وسلم قال سفيان أربع نسوة- قالت: استيقظ النبي صلى الله عليه وسلم من نومه وهو محمر وجهه وهو يقول \" لا إله إلا الله ويل للعرب من شر قد اقترب فتح اليوم من ردم يأجوج ومأجوج مثل هذا \"وحلق قلت يا رسول الله أنهلك وفينا الصالحون ؟ قال: \" نعم إذا كثر الخبيث \"هذا حديث صحيح اتفق البخاري ومسلم على إخراجه من حديث الزهري ولكن سقط في رواية البخاري ذكر حبيبة وأثبتها مسلم وفيه أشياء عزيزة نادرة قليلة الوقوع في صناعة الإسناد منها رواية الزهري عن عروة وهما تابعيان ومنها اجتماع أربع نسوة في سنده كلهن يروي بعضهن عن بعض ثم كل منهن صحابية ثم ثنتان ربيبتان وثنتان زوجتان وقد رُوي نحو هذا عن أبي هريرة أيضًا فقال البزار حدثنا محمد بن مرزوق حدثنا مؤمل بن إسماعيل حدثنا وهب عن ابن طاوس عن أبيه عن أبي هريرة عن النبي صلى الله عليه وسلم أنه قال: \" فتح اليو من ردم يأجوج ومأجوج مثل هذا \"وعقد التسعين وأخرجه البخاري ومسلم من حديث وهب به."
    },
    {
      "ayah": 98,
      "surah": 18,
      "text": "وقوله: \" قال هذا رحمة من ربي \" أي لما بناه ذو القرنين \" قال هذا رحمة من ربي\" أي بالناس حيث جعل بينهم وبين يأجوج ومأجوج حائلا يمنعهم من العبث في الأرض والفساد \" فإذا جاء وعد ربي \" أي إذا اقترب الوعد الحق \" جعله دكاء \" أي ساواه بالأرض تقول العرب ناقة دكاء إذا كان ظهرها مستويًا لاسِنَامَ لها وقال تعالى: \" فلما تجلى ربه للجبل جعله دكا \" أي مساويًا للأرض وقال عكرمة في قوله: \" فإذا جاء وعد ربي جعله دكاء \" قال طريقًا كما كان \" وكان وعد ربي حقًا \" أي كائنًا لا محالة."
    },
    {
      "ayah": 99,
      "surah": 18,
      "text": "وقوله: \" وتركنا بعضهم \" أي الناس يومئذ أي يوم يدك هذا السد ويخرج هؤلاء فيموجون في الناس ويفسدون على الناس أموالهم ويتلفون أشياءهم وهكذا قال السدي في قوله \" وتركنا بعضهم يومئذ يموج في بعض \" قال ذاك حين يخرجون على الناس وهذا كله قبل يوم القيامة وبعد الدجال كما سيأتي بيانه عند قوله \" حتى إذا فتحت يأجوج ومأجوج وهم من كل حدب ينسلون واقترب الوعد الحق \" الآية وهكذا قال ههنا \" وتركنا بعضهم يومئذ يموج في بعض \" قال هذا أول يوم القيامة \" ثم نفخ في الصور \" على أثر ذلك \" فجمعناهم جمعا \" وقال آخرون بل المراد بقوله \" وتركنا بعضهم يومئذ يموج في بعض \" قال إذا ماج الجن والإنس يوم القيامة يختلط الإنس والجن وروى ابن جرير عن محمد بن حميد عن يعقوب القمي عن هارون بن عنترة عن شيخ من بني فزارة في قوله \" وتركنا بعضهم يومئذ يموج في بعض \" قال إذا ماج الإنس والجن قال إبليس: أنا أعلم لكم علم هذا الأمر فيظعن إلى المشرق فيجد الملائكة قد قطعوا الأرض ثم يظعن إلى المغرب فيجد الملائكة قد بطنوا الأرض فيقول ما من محيص ثم يظعن يمينًا وشمالا إلى أقصى الأرض فيجد الملائكة قد بطنوا الأرض فيقول ما من محيص فبينما هو كذلك إذ عرض له طريق كالشراك فأخذ عليه هو وذريته فبينما هم عليه إذ هجموا على النار فأخرج الله خازنًا من خزان النار فقال: يا إبليس ألم تكن لك المنزلة عند ربك ألم تكن في الجنان ؟ فيقول ليس هذا يوم عتاب لو أن الله فرض عليَّ فريضة لعبدته فيها عبادة لم يعبده مثلها أحد من خلقه فيقول: فإن الله قد فرض عليك فريضة فيقول ما هي فيقول يأمرك أن تدخل النار فيتلكأ عليه فيقول به وبذريته بجناحيه فيقذفهم في النار فتزفر النار زفرة لا يبقى ملك مقرب ولا نبي مرسل إلا جَثَا لركبتيه وهكذا رواه ابن أبي حاتم من حديث يعقوب القمي به ثم رواه من وجه آخر عن يعقوب عن هارون عن عنترة عن أبيه عن ابن عباس وتركنا بعضهم يومئذ يموج في بعض قال الإنس والجن يموج بعضهم في بعض. وقال الطبراني: حدثنا عبد الله بن محمد بن العباس الأصبهاني حدثنا أبو مسعود أحمد بن الفرات حدثنا أبو داود الطيالسي حدثنا المغيرة بن مسلم عن أبي إسحاق عن وهب بن جابر عن عبد الله بن عمرو عن النبي صلى الله عليه وسلم قال: \" إن يأجوج ومأجوج من ولد آدم ولو أرسلوا لأفسدوا على الناس معايشهم ولن يموت منهم رجل إلا ترك من ذريته ألفًا فصاعدا وإن من ورائهم ثلاث أمم تاويل وتايس ومنسك \"هذا حديث غريب بل منكر ضعيف وروى النسائي من حديث شعبة عن النعمان بن سالم عن عمرو بن أوس عن أبيه عن جده أوس بن أبي أوس مرفوعًا \" إن يأجوج ومأجوج لهم نساء يجامعون ما شاءوا وشجر يلقحون ما شاءوا ولا يموت منهم رجل إلا ترك من ذريته ألفًا فصاعدًا \"وقوله \" ونفخ في الصور \" والصور كما جاء في الحديث قرن ينفخ فيه والذي ينفخ فيه إسرافيل عليه السلام كما قد تقدم في الحديث بطوله والأحاديث فيه كثيرة.وفي الحديث عن عطية عن ابن عباس وأبي سعيد مرفوعًا \" كيف أنعم وصاحب القرن قد التقم القرن وحنى جبهته واستمع متى يؤمر\" قالوا كيف نقول قال \" قولوا حسبنا الله ونعم الوكيل على الله توكلنا \"وقوله \" فجمعناهم جمعًا \" أي أحضرنا الجميع للحساب \" قل إن الأولين والآخرين لمجموعون إلى ميقات يوم معلوم \" \" وحشرناهم فلم نغادر منهم أحدًا \"."
    }
  ]
}
