{
  "ayahs": [
    {
      "ayah": 1,
      "surah": 19,
      "text": "سورة مريم: وقد روى محمد بن إسحاق في السيرة من حديث أم سلمة وأحمد بن حنبل عن ابن مسعود في قصة الهجرة إلى أرض الحبشة من مكة أن جعفر بن أبي طالب رضي الله عنه قرأ صدر هذه السورة على النجاشي وأصحابه. قد اختلف المفسرون في الحروف المقطعة التي في أوائل السور فمنهم من قال هي مما استأثر الله بعلمه فردوا علمها إلى الله ولم يفسرها حكاه القرطبي في تفسـره عن أبي بكر وعمر وعثمان وعلي وابن مسعود رضي الله عنهم أجمعين وقاله عامر الشعبي وسفيان الثوري والربيع بن خيثم واختاره أبو حاتم بن حبان. ومنهم من فسرها واختلف هؤلاء في معناها فقال عبدالرحمن بن زيد بن أسلم إنما هي أسماء السور. قال العلامة أبو القاسم محمود بن عمر الزمخشري في تفسيره وعليه إطباق الأكثر ونقل عن سيبويه أنه نص عليه ويعتضد لهذا بما ورد في الصحيحين عن أبي هريرة أن رسول الله صلى الله عليه وسلم كان يقرأ في صلاة الصبح يوم الجمعة \"الم\" السجدة و \"هل أتى على الإنسان\" وقال سفيان الثوري عن ابن أبي نجيح عن مجاهد أنه قال: الم وحم والمص وص. فواتح افتتح الله بها القرآن وكذا قال غيره عن مجاهد وقال مجاهد في رواية أبي حذيفة موسى بن مسعود عن شبل عن ابن أبي نجيح عنه أنه قال الم اسم من أسماء القرآن وهكذا وقال قتادة وزيد بن أسلم ولعل هذا يرجع إلى معنى قول عبدالرحمن بن زيد بن أسلم أنه اسم من أسماء السور فإن كل سورة يطلق عليها اسم القرآن فإنه يبعد أن يكون المص اسما للقرآن كله لأن المتبادر إلى فهم سامع من يقول قرأت المص إنما ذلك عبارة عن سورة الأعراف لا لمجموع القرآن والله أعلم. وقيل هي اسم من أسماء الله تعالى فقال عنها في فواتح السور من أسماء الله تعالى وكذلك قال سالم بن عبدالله وإسماعيل بن عبدالرحمن السدي الكبير وقال شعبة عن السدي بلغني أن ابن عباس قال الم اسم من أسماء الله الأعظم. هكذا رواه ابن أبي حاتم من حديث شعبة ورواه ابن جرير عن بندار عن ابن مهدي عن شعبة قال سألت السدي عن حم وطس والم فقال قال ابن عباس هي اسم الله الأعظم وقال ابن جرير وحدثنا محمد بن المثنى حدثنا أبو النعمان حدثنا شعبة عن إسماعيل السدي عن مرة الهمذانى قال: قال عبدالله فذكر نحوه. وحُكي مثله عن علي وابن عباس وقال علي بن أبي طلحة عن ابن عباس هو قسم أقسم الله به وهو من أسماء الله تعالى وروى ابن أبي حاتم وابن جرير من حديث ابن علية عن خالد الحذاء عن عكرمة أنه قال الم قسم. وروينا أيضا من حديث شريك بن عبدالله بن عطاء بن السائب عن أبى الضحى عن ابن عباس: الم قال أنا الله أعلم وكذا قال سعيد بن جبير وقال السدي عن أبي مالك وعن أبي صالح عن ابن عباس وعن مرة الهمذاني عن ابن مسعود وعن ناس من أصحاب النبي صلى الله عليه وسلم الم قال أما الم فهي حروف استفتحت من حروف هجاء أسماء الله تعالى. قال وأبو جعفر الرازي عن الربيع بن أنس عن أبي العالية في قوله تعالى الم قال هذه الأحرف الثلاثة من التسعة والعشرين حرفا دارت فيها الألسن كلها ليس منها حرف إلا وهو مفتاح اسم من أسمائه وليس منها حرف إلا وهو من آلائه وبلألائه ليس منها حرف إلا وهو في مدة أقوام وآجالهم. قال عيسى ابن مريم عليه السلام وعجب: فقال أعجب أنهم يظنون بأسمائه ويعيشون في رزقه فكيف يكفرون به فالألف مفتاح الله واللام مفتاح اسمه لطيف والميم مفتاح اسمه مجيد فالألف آلاء الله واللام لطف الله والميم مجد الله والألف سنة واللام ثلاثون سنة والميم أربعون سنة. هذا لفظ ابن أبي حاتم ونحوه رواه ابن جرير ثم شرع يوجه كل واحد من هذه الأقوال ويوفق بينها وأنه لا منافاة بين كل واحد منها وبين الآخر وأن الجمع ممكن فهي أسماء للسور ومن أسماء الله تعالى يفتتح بها السور فكل حرف منها دل على اسم من أسمائه وصفة من صفاته كما افتتح سورا كثيرة بتحميده وتسبيحه وتعظيمه قال ولا مانع من دلالة الحرف منها على اسم من أسماء الله وعلى صفة من صفاته وعلى مدة وغير ذلك كما ذكره الربيع بن أنس عن أبي العالية لأن الكلمة الواحدة تطلق على معاني كثيرة كلفظة الأمة فإنها تطلق ويراد به الدين كقوله تعالى \"إنا وجدنا آباءنا على أمة\" وتطلق ويراد بها الرجل المطيع لله كقوله تعالى \"إن إبراهيم كان أمة قانتا لله حنيفا ولم يك من المشركين\" وتطلق ويراد بها الجماعة كقوله تعالى \"وجد عليه أمة من الناس يسقون\" وقوله تعالى \"ولقد بعثنا في كل أمة رسولا\" وتطلق ويراد بها الحين من الدهر كقوله تعالى \"وقال الذي نجا منهما وادكر بعد أمة\" أي بعد حين على أصح القولين قال فكذلك هذا. هذا حاصل كلامه موجها ولكن هذا ليس كما ذكره أبو العالية فإن أبا العالية زعم أن الحرف دل على هذا وعلى هذا وعلى هذا معا ولفظة الأمة وما أشبهها من الألفاظ المشتركة في الاصطلاح إنما دل في القرآن في كل موطن على معنى واحد دل عليه سياق الكلام فأما حمله على مجموع محامله إذا أمكن فمسألة مختلف فيها بين علماء الأصول ليس هذا موضع البحث فيها والله أعلم. ثم إن لفظة الأمة تدل على كل من معانيها في سياق الكلام بدلالة الوضع فأما دلالة الحرف الواحد على اسم يمكن أن يدل على اسم آخر من غير أن يكون أحدهما أولى من الآخر في التقدير أو الإضمار بوضع ولا بغيره فهذا مما لا يفهم إلا بتوقيف والمسألة مختلف فيها وليس فيها إجماع حتى يحكم به وما أنشدوه من الشواهد على صحة إطلاق الحرف الواحد على بقية الكلمة فإن في السياق ما يدل على ما حذف بخلاف هذا كما قال الشاعر: قلنا قفي لنا فقالت قاف لا تحسبي أنا نسينا الإيجاف تعني وقفت. وقال الآخر: ما للظليم عال كيف لايـ نقد عنه جلده إذا يـ فقال ابن جرير كأنه أراد أن يقول إذا يفعل كذا وكذا فاكتفى بالياء من يفعل وقال الآخر: بالخير خيرات وان شرا فا ولا أريد الشر إلا أن تـ يقول وإن شرا فشرا ولا أريد الشر إلا أن تشاء فاكتفى بالفاء والتاء من الكلمتين عن بقيتهما ولكن هذا ظاهر من سياق الكلام والله أعلم. قال القرطبي وفي الحديث \"من أعان على قتل مسلم بشطر كلمة\" الحديث قال سفيان هو أن يقول في اقتل\"ا قـ\" وقال خصيف عن مجاهد أنه قال فواتح السور كلها\"ق وص وحم وطسم والر\" وغير ذلك هجاء موضوع وقال بعض أهل العربية هي حروف من حروف المعجم استغنى بذكر ما ذكر منها في أوائل السور عن ذكر بواقيها التي هي تتمة الثمانية والعشرين حرفا كما يقول القائل ابني يكتب في - ا ب ت ث - أي في حروف المعجم الثمانية والعشرين فيستغني بذكر بعضها عن مجموعها حكاه ابن جرير. قلت مجموع الحروف المذكورة في أوائل السور بحذف المكرر منها أربعة عشر حرفا وهي - ال م ص ر ك ه ي ع ط س ح ق ن- يجمعها قولك: نص حكيم قاطع له سر. وهي نصف الحروف عددا والمذكور منها أشرف من المتروك وبيان ذلك من صناعة التصريف. قال الزمخشري وهذه الحروف الأربعة عشر مشتملة على أصناف أجناس الحروف يعني من المهموسة والمجهورة ومن الرخوة والشديدة ومن المطبقة والمفتوحة ومن المستعلية والمنخفضة ومن حروف القلقلة. وقد سردها مفصلة ثم قال: فسبحان الذي دقت في كل شىء حكمته. وهذه الأجناس المعدودة مكثورة بالمذكورة منها وقد علمت أن معظم الشيء وجله ينزل منزلة كله وههنا ههنا لخص بعضهم في هذا المقام كلاما فقال: لا شك أن هذه الحروف لم ينزلها سبحانه وتعالى عبثا ولا سدى ومن قال من الجهلة إن في القرآن ما هو تعبد لا معنى له بالكلمة فقد أخطأ خطأ كبيرا فتعين أن لها معنى في نفس الأمر فإن صح لنا فيها عن المعصوم شيء قلنا به وإلا وقفنا حيث وقفنا وقلنا \"آمنا به كل من عند ربنا\" ولم يجمع العلماء فيها على شيء معين وإنما اختلفوا فمن ظهر له بعض الأقوال بدليل فعليه اتباعه وإلا فالوقف حتى يتبين هذا المقام. المقام الآخر في الحكمة التي اقتضت إيراد هذه الحروف في أوائل السور ما هي مع قطع النظر عن معانيها في أنفسها فقال بعضهم إنما ذكرت ليعرف بها أوائل السور حكاه ابن جرير وهذا ضعيف لأن الفصل حاصل بدونها فيما لم تذكر فيه وفيما ذكرت فيه البسملة تلاوة وكتابة وقال آخرون بل ابتدىء بها لتفتح لاستماعها أسماع المشركين إذ تواصوا بالإعراض عن القرآن حتى إذا استمعوا له تلا عليهم المؤلف منه حكاه ابن جرير أيضا وهو ضعيف أيضا لأنه لو كان كذلك لكان ذلك في جميع السور لا يكون في بعضها بل غالبها ليس كذلك ولو كـان كذلك أيضا لانبغى الابتداء بها في أوائل الكلام معهم سواء كان افتتاح سورة أو غير ذلك ثم إن هذه السورة والتي تليها أعني البقرة وآل عمران مدنيتان ليستا خطابا للمشركين فانتقض ما ذكروه بهذه الوجوه. وقال آخرون بل إنما ذكرت هذه الحروف في أوائل السور التي ذكرت فيها بيانا لإعجاز القرآن وأن الخلق عاجزون عن معارضته بمثله هذا مع أنه مركب من هذه الحروف المقطعة التي يتخاطبون بها وقد حكى هذا المذهب الرازي في تفسيره عن المبرد وجمع من المحققين وحكى القرطبي عن الفراء وقطرب نحو هذا وقرره الزمخشري فى كشافه ونصره أتم نصر وإليه ذهب الشيخ الإمام العلامة أبو العباس ابن تيمية وشيخنا الحافظ المجتهد أبو الحجاج المزي وحكاه لي عن ابن تيمية. قال الزمخشري ولم ترد كلها مجموعة في أول القرآن وإنما كررت ليكون أبلغ في التحدي والتبكيت كما كررت قصص كثيرة وكرر التحدي بالصريح في أماكن قال وجاء منها على حرف واحد كقوله - ص ن ق- وحرفين مثل \"حم\" وثلاثة مثل \"الم\" وأربعة مثل \"المر\" و \"المص\" وخمسة مثل \"كهيعص- و- حمعسق\" لأن أساليب كلامهم على هذا من الكلمات ما هو على حرف وعلى حرفين وعلى ثلاثة وعلى أربعة وعلى خمسة لا أكثر من ذلك \"قلت\" ولهذا كل سورة افتتحت بالحروف فلا بد أن يذكر فيها الانتصار للقرآن وبيان إعجازه وعظمته وهذا معلوم بالاستقراء وهو الواقع في تسع وعشرين سورة ولهذا يقول تعالى \"الم ذلك الكتاب لا ريب فيه\" \"الم الله لا إله إلا هو الحي القيوم نزل عليك الكتاب بالحق مصدقا لما بين يديه\" \"المص كتاب أنزل إليك فلا يكن في صدرك حرج منه\" \"الر كتاب أنزلناه إليك لتخرج الناس من الظلمات إلى النور بإذن ربهم\" \"الم تنزيل الكتاب لا ريب فيه من رب العالمين\" \"حم تنزيل من الرحمن الرحيم\" \"حم عسق كذلك يوحي إليك وإلى الذين من قبلك الله العزيز الحكيم\" وغير ذلك من الآيات الدالة على صحة ما ذهب إليه هؤلاء لمن أمعن النظر والله أعلم. وأما من زعم أنها دالة على معرفة المدد وأنه يستخرج من ذلك أوقات الحوادث والفتن والملاحم فقد ادعى ما ليس له وطار في غير مطاره وقد ورد في ذلك حديث ضعيف وهو مع ذلك أدل على بطلان هذا المسلك من التمسك به على صحته وهو ما رواه محمد بن إسحق بن يسار صاحب المغازي حدثني الكلبي عن أبي صالح عن ابن عباس عن جابر بن عبدالله بن رباب قال مر أبو ياسر بن أخطب في رجال من يهود برسول الله صلى الله عليه وسلم وهو يتلو فاتحة سورة البقرة \"الم ذلك الكتاب لا ريب فيه\" فأتى أخاه بن أخطب في رجال من اليهود فقال تعلمون والله لقد سمعت محمدا يتلو فيما أنزل الله تعالى عليه \"الم ذلك الكتاب لا ريب فيه\" فقال أنت سمعته قال نعم قال فمشى حي بن أخطب في أولئك النفر من اليهود إلى رسول الله صلى الله عليه وسلم فقالوا يا محمد ألم يذكر أنك تتلوا فيما أنزل الله عليك \"الم ذلك الكتاب\"؟ فقال رسول الله صلى الله عليه وسلم \"بلى\" فقالوا جاءك بهذا جبريل من عند الله؟ فقال \"نعم\" قالوا لقد بعث الله قبلك أنبياء ما نعلمه بين لنبي منهم ما مدة ملكه وما أجل أمته غيرك. فقام حي بن أخطب وأقبل على من كان معه فقال لهم الألف واحدة واللام ثلاثون والميم أربعون فهذه إحدى وسبعون سنة أفتدخلون في دين نبي إنما مدة ملكه وأجل أمته إحدى وسبعون سنة؟ ثم أقبل على رسول الله صلى الله عليه وسلم فقال يا محمد هل مع هذا غيره فقال \"نعم\" قال ما ذاك؟ قال \"المص\" قال هذا أثقل وأطول الألف واحد واللام ثلاثون والميم أربعون والصاد تسعون فهذه إحدى وثلاثون ومائة سنة. هل مع هذا يا محمد غيره؟ قال \"نعم\" قال ما ذاك؟ قال \"الر\" قال هذا أثقل وأطول الألف واحدة واللام ثلاثون والراء مائتان فهذه إحدى وثلاثون ومائتا سنة. فهل مع هذا يا محمد غيره؟ قال \"نعم\" قال ماذا قال \"المر\" قال هذه أثقل وأطول الألف واحدة واللام ثلاثون والميم أربعون والراء مائتان فهذه إحدى وسبعون ومائتان ثم قال: لقد لبس علينا أمرك يا محمد حتى ما ندري أقليلا أعطيت أم كثيرا. ثم قال قوموا عنه ثم قال أبو ياسر لأخيه حي بن أخطب ولمن معه من الأحبار ما يدريكم لعله قد جمع هذا لمحمد كله إحدى وسبعون وإحدى وثلاثون ومائة وإحدى وثلاثون ومائتان وإحدى وسبعون ومائتان فذلك سبعمائة وأربع سنين؟ فقالوا لقد تشابه علينا أمره فيزعمون أن هؤلاء الآيات نزلت فيهم \"هو الذي أنزل عليك الكتاب منه آيات محكمات هن أم الكتاب وأخر متشابهات\" فهذا الحديث مداره على محمد بن السائب الكلبي وهو ممن لا يحتج بما انفرد به ثم كان مقتضى هذا المسلك إن كان صحيحا أن يحسب ما لكل حرف من الحروف الأربعة عشر التي ذكرناها وذلك يبلغ منه جملة كثيرة وإن حسبت مع التكرر فأطم وأعظم والله أعلم."
    },
    {
      "ayah": 10,
      "surah": 19,
      "text": "يقول تعالى مخبرا عن زكريا عليه السلام أنه \"قال رب اجعل لي آية\" أي علامة ودليلا على وجود ما وعدتني لتستقر نفسي ويطمئن قلبي بما وعدتنى كما قال إبراهيم عليه السلام \"رب أرني كيف تحيي الموتى قال أول لم تؤمن قال بلى ولكن ليطمئن قلبي\" \"قال آيتك\" أي علامتك \"أن لا تكلم الناس ثلاث ليال سويا\" أي أن تحبس لسانك عن الكلام ثلاث ليال وأنت صحيح سوي من غير مرض ولا علة. قال ابن عباس ومجاهد وعكرمة ووهب والسدي وقتادة وغير واحد اعتقل لسانه من غير مرض ولا علة قال ابن زيد بن أسلم كان يقرأ ويسبح ولا يستطيع أن يكلم قومه إلا إشارة وقال العوفي عن ابن عباس \"ثلاث ليال سويا\" أي متتابعات والقول الأول عنه وعن الجمهور أصح كما قال تعالى في آل عمران \"قال رب اجعل لي آية قال آيتك أن لا تكلم الناس ثلاثة أيام إلا رمزا واذكر ربك كثيرا وسبح بالعشي والإبكار\" وقال مالك عن زيد بن أسلم \"ثلاث ليال سويا\" من غير خرس وهذا دليل على أنه لم يكن يكلم الناس في هذه الليالي الثلاث وأيامها \"إلا رمزا\" أي إشارة."
    },
    {
      "ayah": 11,
      "surah": 19,
      "text": "ولهذا قال في هذه الآية الكريمة \"فخرج على قومه من المحراب\" أي الذي بشر فيه بالولد \"فأوحى إليهم\" أي أشار إشارة خفية سريعة \"أن سبحوا بكرة وعشيا\" أي موافقة له فيما أمر به في هذه الأيام الثلاثة زيادة على أعماله شكرا لله على ما أولاه. قال مجاهد \"فأوحى إليهم\" أي أشار وبه قال وهب وقتادة وقال مجاهد في رواية عنه \"فأوحى إليهم\" أي كتب لهم في الأرض وكذا قال السدي."
    },
    {
      "ayah": 12,
      "surah": 19,
      "text": "وهذا أيضا تضمن محذوفا تقديره أنه وجد هذا الغلام المبشر به وهو يحيى عليه السلام وأن الله علمه الكتاب وهو التوراة التي كانوا يتدارسونها بينهم ويحكم بها النبيون الذين أسلموا للذين هادوا والربانيون والأحبار وقد كان سنه إذ ذاك صغيرا فلهذا نوه بذكره وبما أنعم به عليه وعلى والديه فقال \"يا يحيى خذ الكتاب بقوة\" أي تعلم الكتاب بقوة أي بجد وحرص واجتهاد \"وآتيناه الحكم صبيا\" أي الفهم والعلم والجد والعزم والإقبال على الخير والإكباب عليه والاجتهاد فيه وهو صغير حدث قال عبدالله بن المبارك قال معمر قال الصبيان ليحيى بن زكريا اذهب بنا نلعب فقال ما للعب خلقنا قال فلهذا أنزل الله \"وآتيناه الحكم صبيا\"."
    },
    {
      "ayah": 13,
      "surah": 19,
      "text": "وقوله \"وحنانا من لدنا\" قال علي بن أبي طلحة عن ابن عباس \"وحنانا من لدنا\" يقول ورحمة من عندنا وكذا قال عكرمة وقتادة والضحاك وزاد لا يقدر عليها غيرنا وزاد قتادة رحم الله بها زكريا وقال مجاهد \"وحنانا من لدنا\" وتعطفا من ربه عليه وقال عكرمة \"وحنانا من لدنا\" قال محبة عليه وقال ابن زيد أما الحنان فالمحبة وقال عطاء بن أبي رباح \"وحنانا من لدنا\" قال تعظيما من لدنا وقال ابن جريج: أخبرني عمرو بن دينار أنه سمع عكرمة عن ابن عباس أنه قال: لا والله ما أدري ما حنانا وقال ابن جرير حدثنا ابن حميد حدثنا جرير: عن منصور سألت سعيد بن جبير عن قوله \"وحنانا من لدنا\" فقال سألت عنها ابن عباس فلم يجد فيها شيئا والظاهر من السياق أن قوله وحنانا معطوف على قوله \"وآتيناه الحكم صبيا\" أي وآتيناه الحكم وحنانا وزكاة أي وجعلناه ذا حنان وزكاة فالحنان هو المحبة في شفقة وميل كما تقول العرب حنت الناقة على ولدها وحنت المرأة على زوجها ومنه سميت المرأة حنة من الحنية وحن الرجل إلى وطنه ومنه التعطف والرحمة كما قال الشاعر: تعطف علي هداك المليك فإن لكل مقام مقالا وفي المسند للإمام أحمد عن أنس رضي الله عنه أن رسول الله صلى الله عليه قال \"يبقى رجل في النار ينادي ألف سنة يا حنان يا منان\" وقد يثني ومنهم من يجعل ما ورد من ذلك لغة بذاتها كما قال طرفة: أبا منذر أفنيت فاستبق بعضنا حنانيك بعض الشر أهون من بعض وقوله وزكاة معطوف على وحنانا فالزكاة الطهارة من الدنس والآثام والذنوب وقال قتادة الزكاة العمل الصالح وقال الضحاك وابن جريج العمل الصالح الزكي وقال العوفي عن ابن عباس \"وزكاة\" قال بركة \"وكان تقيا\" طهر فلم يعمل بذنب."
    },
    {
      "ayah": 14,
      "surah": 19,
      "text": "وقوله \"وبرا بوالديه ولم يكن جبارا عصيا\" لما ذكر تعالى طاعته لربه وأنه خلقه ذا رحمة وزكاة وتقى عطف بذكر طاعته لوالديه وبره بهما ومجانبته عقوقهما قولا وفعلا أمرا ونهيا ولهذا قال \"ولم يكن جبارا عصيا\"."
    },
    {
      "ayah": 15,
      "surah": 19,
      "text": "ثم قال بعد هذه الأوصاف الجميلة جزاء له على ذلك \"وسلام عليه يوم ولد ويوم يموت ويوم يبعث حيا\" أي له الأمان في هذه الثلاثة الأحوال وقال سفيان بن عيينة أوحش ما يكون المرء في ثلاثة مواطن يوم يولد فيرى نفسه خارجا مما كان فيه ويوم يموت فيرى قوما لم يكن عاينهم ويوم يبعث فيرى نفسه في محشر عظيم قال فأكرم الله فيها يحيى بن زكريا فخصه بالسلام عليه \"وسلام عليه يوم ولد ويوم يموت ويوم يبعث حيا\" رواه ابن جرير عن أحمد بن منصور المروزي عن صدقة بن الفضل عنه وقال عبدالرزاق أخبرنا معمر عن قتادة في قوله \"جبارا عصيا\" قال كان ابن المسيب يذكر قال: قال رسول الله صلى الله عليه وسلم \"ما من أحد يلقى الله يوم القيامة إلا ذا ذنب إلا يحيى بن زكريا\" قال قتادة: ما أذنب ولا هم بامرأة مرسل وقال محمد بن إسحاق عن يحيى بن سعيد عن سعيد بن المسيب حدثني ابن العاص أنه سمع النبي صلى الله عليه وسلم قال \" كل بني آدم يأتي يوم القيامة وله ذنب إلا ما كان من يحيى بن زكريا\" ابن إسحاق مدلس وقد عنعن هذا الحديث فالله أعلم وقال الإمام أحمد: حدثنا عفان حدثنا حماد أخبرنا علي بن زيد عن يوسف بن مهران عن ابن عباس أن رسول الله صلى الله عليه وسلم قال \"ما من أحد من ولد آدم إلا وقد أخطأ أو هَمَّ بخطيئة ليس يحيى بن زكريا وما ينبغي لأحد أن يقول أنا خير من يونس بن متى\" وهذا أيضا ضعيف لأن علي بن زيد بن جدعان له منكرات كثيرة والله أعلم وقال سعيد بن أبي عروبة عن قتادة أن الحسن قال: إن يحيى وعيسى عليهما السلام التقيا فقال له عيسى استغفر لي أنت خير مني فقال له الآخر أنت خير مني فقال له عيسى أنت خير مني سلمت على نفسي وسلم الله عليك فعرف والله فضلهما."
    },
    {
      "ayah": 16,
      "surah": 19,
      "text": "لما ذكر تعالى قصة زكريا عليه السلام وأنه أوجد منه في حال كبره وعقم زوجته ولدا زكيا طاهرا مباركا عطف بذكر قصة مريم في إيجاده ولدها عيسى عليه السلام منها من غير أب فإن بين القصتين مناسبة ومشابهة ولهذا ذكرهما في آل عمران وههنا وفي سورة الأنبياء يقرن بين القصتين لتقارب ما بينهما في المعنى ليدل عباده على قدرته وعظمة سلطانه وأنه على ما يشاء قادر فقال \"واذكر في الكتاب مريم\" وهي مريم بنت عمران من سلالة داود عليه السلام وكانت من بيت طاهر طيب في بني إسرائيل وقد ذكر الله تعالى قصة ولادة أمها لها في سورة آل عمران وأنها نذرتها محررة أي تخدم مسجد بيت المقدس وكانوا يتقربون بذلك \"فتقبلها ربها بقبول حسن وأنبتها نباتا حسنا\" ونشأت في بني إسرائيل نشأة عظيمة فكانت إحدى العابدات الناسكات المشهورات بالعبادة العظيمة والتبتل والدءوب وكانت في كفالة زوج أختها زكريا نبي بني إسرائيل إذ ذاك وعظيمهم الذي يرجعون إليه في دينهم ورأى لها زكريا من الكرامات الهائلة ما بهره \"كلما دخل عليها زكريا المحراب وجد عندها رزقا قال يا مريم أنى لك هذا قالت هو من عند الله إن الله يرزق من يشاء بغير حساب\" فذكر أنه كان يجد عندها ثمر الشتاء في الصيف وثمر الصيف في الشتاء كما تقدم بيانه في سورة آل عمران فلما أراد الله تعالى وله الحكمة والحجة البالغة أن يوجد منها عبده ورسوله عيسى عليه السلام أحد الرسل أولي العزم الخمسة العظام \"انتبذت من أهلها مكانا شرقيا\" أي اعتزلتهم وتنحت عنهم وذهبت إلى شرقي المسجد المقدس قال السدي لحيض أصابها وقيل لغير ذلك قال أبو كدينة عن قابوس بن أبي ظبيان عن أبيه عن ابن عباس قال: إن أهل الكتاب كتب عليهم الصلاة إلى البيت والحج إليه وما صرفهم عنه إلا قول ربك \"فانتبذت من أهلها مكانا شرقيا\" قال خرجت مريم مكانا شرقيا فصلوا قبل مطلع الشمس رواه ابن أبي حاتم وابن جرير. وقال ابن جرير أيضا: حدثنا إسحاق بن شاهين حدثنا خالد بن عبدالله عن داود عن عامر عن ابن عباس قال: إني لأعلم خلق الله لأي شيء اتخذت النصارى المشرق قبلة لقول الله تعالى \"فانتبذت من أهلها مكانا شرقيا\" واتخذوا ميلاد عيسى قبلة وقال قتادة \"مكانا شرقيا\" شاسعا متنحيا وقال محمد بن إسحاق ذهبت بقلتها لتستقي الماء وقال نوف البكالي اتخذت لها منزلا تتعبد فيه فالله أعلم."
    },
    {
      "ayah": 17,
      "surah": 19,
      "text": "وقوله \"فاتخذت من دونهم حجابا\" أي استترت منهم وتوارت فأرسل الله تعالى إليها جبريل عليه السلام \"فتمثل لها بشرا سويا\" أي على صورة إنسان تام كامل قال مجاهد والضحاك وقتادة وابن جريج ووهب بن منبه والسدي في قوله \"فأرسلنا إليها روحنا\" يعني جبرائيل عليه السلام وهذا الذي قالوه هو ظاهر القرآن فإنه تعالى قد قال في الآية الأخرى \"نزل به الروح الأمين على قلبك لتكون من المنذرين\" وقال أبو جعفر الرازي عن الربيع بن أنس عن أبي العالية عن أبي بن كعب قال: إن روح عيسى عليه السلام من جملة الأرواح التي أخذ عليها العهد في زمان آدم عليه السلام وهو الذي تمثل لها بشرا سويا أي روح عيسى فحملت الذي خاطبها وحل في فيها وهذا في غاية الغرابة والنكارة وكأنه إسرائيلي."
    },
    {
      "ayah": 18,
      "surah": 19,
      "text": "\"قالت إني أعوذ بالرحمن منك إن كنت تقيا\" أي لما تبدى لها الملك في صورة بشر وهي في مكان منفرد وبينها وبين قومها حجاب خافته وظنت أنه يريدها على نفسها فقالت \"إني أعوذ بالرحمن منك إن كنت تقيا\" أي إن كنت تخاف الله تذكيرا له بالله وهذا هو المشروع في الدفع أن يكون بالأسهل فالأسهل فخوفته أولا بالله عز وجل قال ابن جرير: حدثني أبو كريب حدثنا أبو بكر عن عاصم قال قال أبو وائل وذكر قصة مريم فقال قد علمت أن التقي ذو نهية حين قالت \"إني أعوذ بالرحمن منك إن كنت تقيا قال إنما أنا رسول ربك\" أي فقال لها الملك مجيبا لها ومزيلا لما حصل عندها من الخوف على نفسها لست مما تظنين ولكني رسول ربك أي بعثني الله إليك ويقال إنها لما ذكرت الرحمن انتفض جبريل فرقا وعاد إلى هيئته."
    },
    {
      "ayah": 19,
      "surah": 19,
      "text": "وقال \"إنما أنا رسول ربك لِيَهَبَ لك غلاما زكيا\" هكذا قرأ أبو عمرو بن العلاء أحد مشهوري القراء و قرأ الآخرون \"لأهب لك غلاما زكيا\" وكلا القراءتين له وجه حسن ومعنى صحيح وكل تستلزم الأخرى."
    },
    {
      "ayah": 2,
      "surah": 19,
      "text": "قوله \"ذكر رحمت ربك\" أي هذا ذكر رحمة الله بعبده زكريا وقرأ يحيى بن يعمر \"ذكر رحمت ربك عبده زكريا\" وزكريا يمد ويقصر قراءتان مشهورتان. وكان نبيا عظيما من أنبياء بني إسرائيل وفي صحيح البخاري أنه كان نجارا يأكل من عمل يده في النجارة."
    },
    {
      "ayah": 20,
      "surah": 19,
      "text": "\"قالت أنى يكون لي غلام\" أي فتعجبت مريم من هذا وقالت كيف يكون لي غلام أي على أي صفة يوجد هذا الغلام مني ولست بذات زوج ولا يتصور منى الفجور ولهذا قالت \"ولم يمسسني بشر ولم أك بغيا\" والبغي هي الزانية ولهذا جاء في الحديث النهي عن مهر البغي."
    },
    {
      "ayah": 21,
      "surah": 19,
      "text": "\"قال كذلك قال ربك هو على هين\" أي فقال لها الملك مجيبا لها عما سألت إن الله قد قال إنه سيوجد منك غلاما وإن لم يكن لك بعل ولا يوجد منك فاحشة فإنه على ما يشاء قادر ولهذا قال \"ولنجعله آية للناس\" أي دلالة وعلامة للناس على قدرة بارئهم وخالقهم الذي نوع في خلقهم فخلق آباهم آدم من غير ذكر ولا أنثى وخلق حواء من ذكر بلا أنثى وخلق بقية الذرية من ذكر وأنثى إلا عيسى فإنه أوجده من أنثى بلا ذكر فتمت القسمة الرباعية الدالة على كمال قدرته وعظيم سلطانه فلا إله غيره ولا رب سواه وقوله \"ورحمة منا\" أي ونجعل هذا الغلام رحمة من الله نبيا من الأنبياء يدعو إلى عبادة الله تعالى وتوحيده كما قال تعالى في الآية الأخرى \"إذ قالت الملائكة يا مريم إن الله يبشرك بكلمة منه اسمه المسيح عيسى ابن مريم وجيها في الدنيا والآخرة ومن المقربين ويكلم الناس في المهد وكهلا ومن الصالحين\" أي يدعو إلى عبادة ربه في مهده وكهولته قال ابن أبي حاتم: حدثنا أبي حدثنا عبدالرحيم بن إبراهيم حدثنا مروان حدثنا العلاء بن الحارث الكوفي عن مجاهد قال: قالت مريم عليها السلام كنت إذا خلوت حدثني عيسى وكلمني وهو في بطني وإذا كنت مع الناس سبح في بطني وكبر وقوله \"وكان أمرا مقضيا\" يحتمل أن هذا من كلام جبريل لمريم يخبرها أن هذا أمر مقدر في علم الله تعالى وقدره ومشيئته ويحتمل أن يكون من خبر الله تعالى لرسوله محمد صلى الله عليه وسلم وأنه كنى بهذا عن النفخ في فرجها كما قال تعالى \"ومريم ابنة عمران التي أحصنت فرجها فنفخنا فيه من روحنا\" وقال \"والتي أحصنت فرجها فنفخنا فيها من روحنا\" قال محمد بن إسحاق \"وكان أمرا مقضيا\" أي إن الله قد عزم على هذا فليس منه بد واختار هذا أيضا ابن جرير في تفسيره ولم يحك غيره والله أعلم."
    },
    {
      "ayah": 22,
      "surah": 19,
      "text": "يقول تعالى مخبرا عن مريم أنها لما قال لها جبريل عن الله تعالى ما قال إنها استسلمت لقضاء الله تعالى فذكر غير واحد من علماء السلف أن الملك وهو جبرائيل عليه السلام عند ذلك نفخ في جيب درعها فنزلت النفخة حتى ولجت في الفرج فحملت بالولد بإذن الله تعالى فلما حملت به ضاقت ذرعا ولم تدر ماذا تقول للناس فإنها تعلم أن الناس لا يصدقونها فيما تخبرهم به غير أنها أفشت سرها وذكرت أمرها لأختها امرأة زكريا وذلك أن زكريا عليه السلام كان قد سأل الله الولد فأجيب إلى ذلك فحملت امرأته فدخلت عليها مريم فقامت إليها فاعتنقتها وقالت أشعرت يا مريم أني حبلى؟ فقالت لها مريم وهل علمت أيضا أني حبلى وذكرت لها شأنها وما كان من خبرها وكانوا بيت إيمان وتصديق ثم كانت امرأة زكريا بعد ذلك إذا واجهت مريم تجد الذي في بطنها يسجد للذي في بطن مريم أي يعظمه ويخضع له فإن السجود كان في ملتهم عند السلام مشروعا كما سجد ليوسف أبواه وإخوته وكما أمر الله الملائكة أن يسجدوا لآدم عليه السلام ولكن حرم في ملتنا هذه تكميلا لتعظيم جلال الرب تعالى قال ابن أبي حاتم حدثنا علي بن الحسين قال قرئ على الحارث بن مسكين وأنا أسمع أخبرنا عبدالرحمن بن القاسم قال: قال مالك رحمه الله بلغني أن عيسى ابن مريم ويحيى بن زكريا عليهما السلام ابنا خالة وكان حملهما جميعا معا فبلغني أن أم يحيى قالت لمريم إني أرى أن ما في بطني يسجد لما في بطنك قال مالك أرى ذلك لتفضيل عيسى عليه السلام لأن الله جعله يحي الموتى ويبرئ الأكمه والأبرص ثم اختلف المفسرون في مدة حمل عيسى عليه السلام فالمشهور عن الجمهور أنها حملت به تسعة أشهر وقال عكرمة ثمانية أشهر قال ولهذا لا يعيش ولد الثمانية أشهر وقال ابن جريج أخبرني المغيرة بن عتبة بن عبدالله الثقفي سمع ابن عباس وسئل عن حمل مريم قال لم يكن إلا أن حملت فوضعت وهذا غريب وكأنه مأخوذ من ظاهر قوله تعالى \"فحملته فانتبذت به مكانا قصيا فأجاءها المخاض إلى جذع النخلة\" فالفاء وإن كانت للتعقيب لكن تعقيب كل شيء بحسبه كقوله تعالى \"ولقد خلقنا الإنسان من سلالة من طين ثم جعلناه نطفة في قرار مكين ثم خلقنا النطفة علقة فخلقنا العلقة مضغة فخلقنا المضغة عظاما\" فهذه الفاء للتعقيب بحسبها وقد ثبت في الصحيحين أن بين كل صفتين أربعين يوما وقال تعالى \"ألم تر أن الله أنزل من السماء ماء فتصبح الأرض مخضرة\" فالمشهور الظاهر والله على كل شيء قدير أنها حملت به كما تحمل النساء بأولادهن ولهذا لما ظهرت مخايل الحمل بها وكان معها في المسجد رجل صالح من قراباتها يخدم معها البيت المقدس يقال له يوسف النجار فلما رأى ثقل بطنها وكبره أنكر ذلك من أمرها ثم صرفه ما يعلم من براءتها ونزاهتها ودينها وعبادتها ثم تأمل ما هي فيه فجعل أمرها يجوس في فكره لا يستطيع صرفه عن نفسه فحمل نفسه على أن عرض لها في القول فقال يا مريم إني سائلك عن أمر فلا تعجلي علي. قالت وما هو؟ قال هل يكون قط شجر من غير حب وهل يكون زرع من غير بذر وهل يكون ولد من غير أب؟ فقالت نعم وفهمت ما أشار إليه أما قولك هل يكون شجر من غير حب وزرع من غير بذر فإن الله قد خلق الشجر والزرع أول ما خلقهما من غير حب ولا بذر وهل يكون ولد من غير أب فإن الله تعالى قد خلق آدم من غير أب ولا أم فصدقها وسلم لها حالها ولما استشعرت مريم من قومها اتهامها بالريبة انتبذت منهم مكانا قصيا أي قاصيا منهم بعيدا عنهم لئلا تراهم ولا يروها قال محمد بن إسحاق: فلما حملت به وملأت قلتها ورجعت استمسك عنها الدم وأصابها ما يصيب الحامل على الولد من الوصب والتوحم وتغير اللون حتى فطر لسانها فما دخل على أهل بيت ما دخل على آل زكريا وشاع الحديث في بني إسرائيل فقالوا إنما صاحبها يوسف ولم يكن معها في الكنيسة غيره وتوارت من الناس واتخذت من دونهم حجابا فلا يراها أحد ولا تراه."
    },
    {
      "ayah": 23,
      "surah": 19,
      "text": "وقوله \"فأجاءها المخاض إلى جذع النخلة\" أي فاضطرها وألجأها الطلق إلى جذع نخلة في المكان الذي تنحت إليه وقد اختلفوا فيه فقال السدي كان شرقي محرابها الذي تصلي فيه من بيت المقدس وقال وهب بن منبه ذهبت هاربة فلما كانت بين الشام وبلاد مصر ضربها الطلق وفي رواية عن وهب كان ذلك على ثمانية أميال من بيت المقدس في قرية هناك يقال لها بيت لحم قلت وقد تقدم في أحاديث الإسراء من رواية النسائي عن أنس رضي عنه والبيهقي عن شداد بن أوس رضي الله عنه أن ذلك ببيت لحم فالله أعلم; وهذا هو المشهور الذي تلقاه الناس بعضهم عن بعض ولا يشك فيه النصارى أنه ببيت لحم وقد تلقاه الناس وقد ورد به الحديث إن صح وقوله تعالى إخبارا عنها \"قالت يا ليتني مت قبل هذا وكنت نسيا منسيا\" فيه دليل على جواز تمني الموت عند الفتنة فإنها عرفت أنها ستبتلى وتمتحن بهذا المولود الذي لا يحمل الناس أمرها فيه على السداد ولا يصدقونها في خبرها وبعد ما كانت عندهم عابدة ناسكة تصبح عندهم فيما يظنون عاهرة زانية فقالت \"يا ليتني مت قبل هذا\" أي قبل هذا الحال \"وكنت نسيا منسيا\" أي لم أخلق ولم أك شيئا قاله ابن عباس وقال السدي قالت وهي تطلق من الحبل استحياء من الناس يا ليتني مت قبل هذا الكرب الذي أنا فيه والحزن بولادتي المولود من غير بعل \"وكنت نسيا منسيا\" نسي فترك طلبه كخرق الحيض إذا ألقيت وطرحت لم تطلب ولم تذكر وكذلك كل شيء نسي وترك فهو نسي وقال قتادة \"وكنت نسيا منسيا\" أي شيئا لا يعرف ولا يذكر ولا يدري من أنا وقال الربيع بن أنس \"وكنت نسيا منسيا\" هو السقط وقال ابن زيد لم أكن شيئا قط وقد قدمنا الأحاديث الدالة على النهي عن تمني الموت إلا عند الفتنة عند قوله \"توفني مسلما وألحقني بالصالحين\"."
    },
    {
      "ayah": 24,
      "surah": 19,
      "text": "قرأ بعضهم من تحتها بمعنى الذي تحتها وقرأ الآخرون من تحتها على أنه حرف جر واختلف المفسرون في المراد بذلك من هو؟ فقال العوفي وغيره عن ابن عباس \"فناداها من تحتها\" جبريل ولم يتكلم عيسى حتى أتت به قومها وكذا قال سعيد بن جبير والضحاك وعمرو بن ميمون والسدي وقتادة إنه الملك جبرائيل عليه الصلاة والسلام أي ناداها من أسفل الوادي وقال مجاهد \"فناداها من تحتها\" قال عيسى ابن مريم وكذا قال عبد الرزاق عن معمر عن قتادة قال: قال الحسن هو ابنها وهو إحدى الروايتين عن سعيد بن جبير أنه ابنها قال أو لم تسمع الله يقول \"فأشارت إليه\" واختاره ابن زيد وابن جرير في تفسيره وقوله: \"أن لا تحزني\" أي ناداها قائلا لا تحزني \"قد جعل ربك تحتك سريا\" قال سفيان الثوري وشعبة عن أبي إسحاق عن البراء بن عازب \"قد جعل ربك تحتك سريا\" قال الجدول وكذا قال علي بن أبي طلحة عن ابن عباس: السري النهر وبه قال عمرو بن ميمون نهر تشرب منه وقال مجاهد هو النهر بالسريانية وقال سعيد بن جبير السري النهر الصغير بالنبطية وقال الضحاك هو النهر الصغير بالسريانية وقال إبراهيم النخعي هو النهر الصغير وقال قتادة هو الجدول بلغة أهل الحجاز وقال وهب بن منبه: السري هو ربيع الماء وقال السدي هو النهر واختار هذا القول ابن جرير وقد ورد في ذلك حديث مرفوع فقال الطبراني حدثنا أبو شعيب الحراني حدثنا يحيى بن عبدالله البابلي حدثنا أيوب بن نهيك سمعت عكرمة مولى ابن عباس سمعت ابن عمر يقول سمعت رسول الله صلى الله عليه وسلم يقول \"إن السري الذي قال الله لمريم \"قد جعل ربك تحتك سريا\" نهر أخرجه الله لتشرب منه وهذا حديث غريب جدا من هذا الوجه وأيوب بن نهيك هذا هو الحبلي قال فيه أبو حاتم الرازي ضعيف وقال أبو زرعة منكر الحديث وقال أبو الفتح الأزدي متروك الحديث وقال آخرون المراد بالسري عيسى عليه السلام وبه قال الحسن والربيع بن أنس ومحمد بن عباد بن جعفر وهو إحدى الروايتين عن قتادة وقول عبدالرحمن بن زيد بن أسلم والقول الأول أظهر."
    },
    {
      "ayah": 25,
      "surah": 19,
      "text": "ولهذا قال بعده \"وهزي إليك بجذع النخلة\" أي وخذي إليك بجذع النخلة قيل كانت يابسة قاله ابن عباس وقيل مثمرة قال مجاهد كانت عجوة وقال الثوري عن أبي داود نفيع الأعمى كانت صرفانة والظاهر أنها كانت شجرة ولكن لم تكن في إبان ثمرها قاله وهب بن منبه ولهذا امتن عليها بذلك بأن جعل عندها طعاما وشرابا فقال \"تساقط عليك رطبا جنيا فكلي واشربي وقري عينا\" أي طيبي نفسا ولهذا قال عمرو بن ميمون: ما من شيء خير للنفساء من التمر والرطب ثم تلا هذه الآية الكريمة وقال ابن أبي حاتم حدثنا علي بن الحسين حدثنا شيبان حدثنا مسرور بن سعيد التميمي حدثنا عبدالرحمن بن عمرو الأوزاعي عن عروة بن رويم عن علي بن أبي طالب قال: قال رسول الله صلى الله عليه وسلم \"أكرموا عمتكم النخلة فإنها خلقت من الطين الذي خلق منه آدم عليه السلام وليس من الشجر شيء يلقح غيرها\" وقال رسول الله صلى الله عليه وسلم \"أطعموا نساءكم الولد الرطب فإن لم يكن رطب فتمر وليس من الشجر شجرة أكرم على الله من شجرة نزلت تحتها مريم بنت عمران\" هذا حديث منكر جدا ورواه أبو يعلى عن شيبان به وقرأ بعضهم \"تساقط\" بتشديد السين وآخرون بتخفيفها وقرأ أبو نهيك \"تسقط عليك رطبا جنيا\" وروى أبو إسحاق عن البراء أنه قرأها \"يساقط\" أي الجذع والكل متقارب."
    },
    {
      "ayah": 26,
      "surah": 19,
      "text": "وقوله: \"فإما ترين من البشر أحدا\" أي مهما رأيت من أحد \"فقولي إني نذرت للرحمن صوما فلن أكلم اليوم إنسيا\" المراد بهذا القول الإشارة إليه بذلك لا أن المراد به القول اللفظي لئلا ينافي \"فلن أكلم اليوم إنسيا\" قال أنس بن مالك في قوله \"إني نذرت للرحمن صوما\" قال صمتا وكذا قال ابن عباس والضحاك وفي رواية عن أنس: صوما وصمتا وكذا قال قتادة وغيرهما والمراد أنهم كانوا إذا صاموا في شريعتهم يحرم عليهم الطعام والكلام نص على ذلك السدي وقتادة وعبدالرحمن بن زيد قال ابن إسحاق عن حارثة قال: كنت عند ابن مسعود فجاء رجلان فسلم أحدهما ولم يسلم الآخر فقال ما شأنك؟ قال أصحابه حلف أن لا يكلم الناس اليوم فقال عبدالله بن مسعود كلم الناس وسلم عليهم فإن تلك امرأة علمت أن أحدا لا يصدقها أنها حملت من غير زوج يعني بذلك مريم عليها السلام ليكون عذرا لها إذا سئلت ورواه ابن أبي حاتم وابن جرير رحمهما الله وقال عبدالرحمن بن زيد لما قال عيسى لمريم \"لا تحزني\" قالت وكيف لا أحزن وأنت معي لا ذات زوج ولا مملوكة أي شيء عذري عند الناس؟ يا ليتني مت قبل هذا وكنت نسيا منسيا قال لها عيسى أنا أكفيك الكلام \"فإما ترين من البشر أحدا فقولي إنى نذرت للرحمن صوما فلن أكلم اليوم إنسيا\" قال هذا كله من كلام عيسى لأمه وكذا قال وهب."
    },
    {
      "ayah": 27,
      "surah": 19,
      "text": "يقول تعالى مخبرا عن مريم حين أمرت أن تصوم يومها ذلك وأن لا تكلم أحدا من البشر فإنها ستكفى أمرها ويقام بحجتها فسلمت لأمر الله عز وجل واستسلمت لقضائه فأخذت ولدها فأتت به قومها تحمله فلما رأوها كذلك أعظموا أمرها واستنكروه جدا و \"قالوا يا مريم لقد جئت شيئا فريا\" أي أمرا عظيما قاله مجاهد وقتادة والسدي وغير واحد وقال ابن أبي حاتم حدثنا أبي حدثنا عبدالله بن أبي زياد حدثنا شيبان حدثنا جعفر بن سليمان حدثنا أبو عمران الجوني عن نوف البكالي قال: وخرج قومها في طلبها قال وكانت من أهل بيت نبوة وشرف فلم يحسوا منها شيئا فلقوا راعي بقر فقالوا رأيت فتاة كذا وكذا نعتها قال لا ولكني رأيت الليلة من بقري ما لم أره منها قط قالوا وما رأيت قال رأيتها الليلة تسجد نحو هذا الوادي قال عبدالله بن أبي زياد وأحفظ عن شيبان أنه قال رأيت نورا ساطعا فتوجهوا حيث قال لهم فاستقبلتهم مريم فلما رأتهم قعدت وحملت ابنها في حجرها فجاءوا حتى قاموا عليها \"وقالوا يا مريم لقد جئت شيئا فريا\"."
    },
    {
      "ayah": 28,
      "surah": 19,
      "text": "أمرا عظيما \"يا أخت هارون\" أي شبيهة هارون في العبادة \"ما كان أبوك امرأ سوء وما كانت أمك بغيا\" أي أنت من بيت طيب طاهر معروف بالصلاح والعبادة والزهادة فكيف صدر هذا منك قال علي بن أبي طلحة والسدي قيل لها \"يا أخت هارون\" أي أخي موسى وكانت من نسله كما يقال للتميمي يا أخا تميم وللمصري يا أخا مضر وقيل نسبت إلى رجل صالح كان فيهم اسمه هارون فكانت تقاس به في الزهادة والعبادة وحكى ابن جرير عن بعضهم أنهم شبهوها برجل فاجر كان فيهم يقال له هارون ورواه ابن أبي حاتم عن سعيد بن جبير وأغرب من هذا كله ما رواه ابن أبي حاتم حدثنا علي بن الحسين الهجستاني حدثنا ابن أبي مريم حدثنا المفضل يعني ابن أبي فضالة حدثنا أبو صخر عن القرظي في قول الله عز وجل \"يا أخت هارون\" قال هي أخت هارون لأبيه وأمه وهي أخت موسى أخي هارون التي قصت أثر موسى \"فبصرت به عن جنب وهم لا يشعرون\" وهذا القول خطأ محض فإن الله تعالى قد ذكر في كتابه أنه قفى بعيسى بعد الرسل فدل على أنه آخر الأنبياء بعثا وليس بعده إلا محمد صلوات الله وسلامه عليهما ولهذا ثبت في صحيح البخاري عن أبي هريرة رضي الله عنه عن رسول الله صلى الله عليه وسلم أنه قال: \"أنا أولى الناس بابن مريم لأنه ليس بيني وبينه نبي\" ولو كان الأمر كما زعم محمد بن كعب القرظي لم يكن متأخرا عن الرسل سوى محمد ولكان قبل سليمان وداود فإن الله قد ذكرأن داود بعد موسى عليهما السلام وفي قوله تعالى: \"ألم تر إلى الملأ من بني إسرائيل من بعد موسى إذ قالوا لنبي لهم ابعث لنا ملكا نقاتل في سبيل الله\" وذكر القصة إلى أن قال \"وقتل داود جالوت\" الآية والذي جرأ القرظي على هذه المقالة ما في التوراة بعد خروج موسى وبني إسرائيل من البحر وإغراق فرعون وقومه قال وقامت مريم بنت عمران أخت موسى وهارون النبيين تضرب بالدف هي والنساء معها يسبحن الله ويشكرنه على ما أنعم به على بني إسرائيل فاعتقد القرظي أن هذه هي أم عيسى وهذه هفوة وغلطة شديدة بل هي باسم هذه وقد كانوا يسمون بأسماء أنبيائهم وصالحيهم كما قال الإمام أحمد حدثنا عبدالله بن إدريس سمعت أبي يذكره عن سماك عن علقمة بن وائل عن المغيرة بن شعبة قال: بعثني رسول الله صلى الله عليه وسلم إلى نجران فقالوا أرأيت ما تقرءون \"يا أخت هارون\" وموسى قبل عيسى بكذا وكذا؟ قال فرجعت فذكرت ذلك لرسول الله صلى الله عليه وسلم فقال: \"ألا أخبرتهم أنهم كانوا يسمون بالأنبياء والصالحين قبلهم\" انفرد بإخراجه مسلم والترمذي والنسائي من حديث عبدالله بن إدريس عن أبيه عن سماك به وقال الترمذي حسن صحيح غريب لا نعرفه إلا من حديث ابن إدريس وقال ابن جرير حدثني يعقوب حدثنا ابن علية عن سعيد بن أبي صدقة عن محمد بن سيرين قال أنبئت أن كعبا قال إن قوله: \"يا أخت هارون\" ليس بهارون أخي موسى قال فقالت له عائشة كذبت قال يا أم المؤمنين إن كان النبي صلى الله عليه وسلم قاله فهو أعلم وأخبر وإلا فإني أجد بينهما ستمائة سنة قال فسكتت وفي هذا التاريخ نظر. وقال ابن جرير أيضا: حدثنا بشر حدثنا يزيد حدثنا سعيد عن قتادة قوله: \"يا أخت هارون\" الآية قال كانت من أهل بيت يعرفون بالصلاح ولا يعرفون بالفساد ومن الناس من يعرفون بالصلاح ويتوالدون به وآخرون يعرفون بالفساد ويتوالدون به وكان هارون مصلحا محببا في عشيرته وليس بهارون أ خي موسى ولكنه هارون آخر قال وذكر لنا أنه شيع جنازته يوم مات أربعون ألفا كلهم يسمى هارون من بني إسرائيل."
    },
    {
      "ayah": 29,
      "surah": 19,
      "text": "وقوله \"فأشارت إليه قالوا كيف نكلم من كان في المهد صبيا\"أي أنهم لما استرابوا في أمرها واستنكروا قضيتها وقالوا لها ما قالوا معرضين بقذفها ورميها بالفرية وقد كانت يومها ذلك صائمة صامتة فأحالت الكلام عليه وأشارت لهم إلى خطابه وكلامه فقالوا متهكمين بها ظانين أنهـا تزدري بهم وتلعب بهم \"كيف نكلم من كان في المهد صبيا\" قال ميمون بن مهران \"فأشارت إليه\" قالت كلموه فقالوا على ما جاءت به من الداهية تأمرنا أن نكلم من كان في المهد صبيا وقال السدي لما \"أشارت إليه\" غضبوا وقالوا لسخريتها بنا حتى تأمرنا أن نكلم هذا الصبي أشد علينا من زناها \"قالوا كيف نكلم من كان في المهد صبيا\" أي من هو موجود في مهده في حال صباه وصغره كيف يتكلم؟."
    },
    {
      "ayah": 3,
      "surah": 19,
      "text": "وقوله \"إذ نادى ربه نداء خفيا\" قال بعض المفسرين إنما أخفى دعاءه لئلا ينسب في طلب الولد إلى الرعونة لكبره. حكاه الماوردي وقال آخرون إنما أخفاه لأنه أحب إلى الله كما قال قتادة في هذه الآية \"إذ نادى ربه نداء خفيا\" إن الله يعلم القلب التقي ويسمع الصوت الخفي وقال بعض السلف قام من الليل عليه السلام وقد نام أصحابه فجعل يهتف بربه يقول خفية يا رب يا رب يا رب فقال الله له: لبيك لبيك لبيك."
    },
    {
      "ayah": 30,
      "surah": 19,
      "text": "\"قال إني عبد الله\" أول شيء تكلم به أن نزه جناب ربه تعالى وبرأه عن الولد وأثبت لنفسه العبودية لربه وقوله: \"آتاني الكتاب وجعلني نبيا\" تبرئة لأمه مما نسبت إليه من الفاحشة قال نوف البكالى لما قالوا لأمه ما قالوا كان يرتضع ثديها فنزع الثدي من فمه واتكأ على جنبه الأيسر وقال \"إني عبدالله آتاني الكتاب وجعلني نبيا - إلى قوله - ما دمت حيا\" وقال حماد بن سلمة عن ثابت البناني رفع أصبعه السبابة فوق منكبه وهو يقول: \"إني عبدالله آتاني الكتاب وجعلني نبيا\" الآية وقال عكرمة \"آتاني الكتاب\" أي قضى أنه يؤتيني الكتاب فيما قضى وقال ابن أبي حاتم حدثنا أبي حدثنا محمد المصفى حدثنا يحيى بن سعيد هو العطار عن عبدالعزيز بن زياد عن أنس بن مالك رضي الله عنه قال: كان عيسى ابن مريم قد درس التوراة وأحكمها وهو في بطن أمه فذلك قوله: \"إني عبدالله آتاني الكتاب وجعلني نبيا\" يحيى بن سعيد العطار الحمصي متروك."
    },
    {
      "ayah": 31,
      "surah": 19,
      "text": "وقوله \"وجعلني مباركا أينما كنت\" قال مجاهد وعمرو بن قيس والثوري وجعلني معلما للخير وفي رواية عن مجاهد نفاعا وقال ابن جرير: حدثني سليمان بن عبدالجبار حدثنا محمد بن يزيد بن خنيس المخزومي سمعت وهيب بن الورد مولى بني مخزوم قال لقي عالم عالما هو فوقه في العلم فقال له: يرحمك الله ما الذي أعلن من عملي؟ قال الأمر بالمعروف والنهي عن المنكر فإنه دين الله الذي بعث به أنبياءه إلى عباده وقد أجمع الفقهاء على قول الله \"وجعلني مباركا أينما كنت\" وقيل ما بركته؟ قال الأمر بالمعروف والنهي عن المنكر أينما كان وقوله \"وأوصاني بالصلاة والزكاة ما دمت حيا\" كقوله تعالى لمحمد صلى الله عليه وسلم \"واعبد ربك حتى يأتيك اليقين\" وقال عبدالرحمن بن القاسم عن مالك بن أنس في قوله \"وأوصاني بالصلاة والزكاة ما دمت حيا\" قال أخبره بما هو كائن من أمره إلى أن يموت ما اثبتها لأهل القدر."
    },
    {
      "ayah": 32,
      "surah": 19,
      "text": "وقوله \"وبرا بوالدتي\" أي وأمرني ببر والدتي ذكره بعد طاعة ربه لأن الله تعالى كثيرا ما يقرن بين الأمر بعبادته وطاعة الوالدين كما قال تعالى \"وقضى ربك ألا تعبدوا إلا إياه وبالوالدين إحسانا\" وقال \"أن اشكر لي ولوالديك إلي المصير\" وقوله: \"ولم يجعلني جبارا شقيا\" أي ولم يجعلني جبارا مستكبرا عن عبادته وطاعته وبر والدتي فأشقى بذلك: قال سفيان الثوري: الجبار الشقي الذي يقتل على الغضب وقال بعض السلف لا تجد أحدا عاقا لوالديه إلا وجدته جبارا شقيا ثم قرأ \"وبرا بوالدتي ولم يجعلني جبارا شقيا\" قال ولا تجد سيء الملكة إلا وجدته مختالا فخورا ثم قرأ \"وما ملكت أيمانكم إن الله لا يحب من كان مختالا فخورا\" وقال قتادة ذكر لنا أن امرأة رأت ابن مريم يحيي الموتى ويبرئ الأكمه والأبرص في آيات سلطه الله عليهن وأذن له فيهن فقالت طوبى للبطن الذي حملك وطوبى للثدي الذي أرضعت به فقال نبي الله عيسى عليه السلام يجيبها طوبى لمن تلا كتاب الله فاتبع ما فيه ولم يكن جبارا شقيا."
    },
    {
      "ayah": 33,
      "surah": 19,
      "text": "وقوله \"والسلام علي يوم ولدت ويوم أموت ويوم أبعث حيا\" إثبات منه لعبوديته لله عز وجل وأنه مخلوق من خلق الله يحيى ويمات ويبعث كسائر الخلائق ولكن له السلامة في هذه الأحوال التي هي أشق ما يكون على العباد صلوات الله وسلامه عليه."
    },
    {
      "ayah": 34,
      "surah": 19,
      "text": "يقول تعالى لرسوله محمد صلوات الله وسلامه عليه ذلك الذي قصصناه عليك من خبر عيسى عليه السلام \"قول الحق الذي فيه يمترون\" أي يختلف المبطلون والمحقون ممن آمن به وكفر به ولهذا قرأ الأكثرون قول الحق برفع قول وقرأ عاصم وعبدالله بن عامر قول الحق وعن ابن مسعود أنه قرأ ذلك عيسى ابن مريم قال الحق والرفع أظهر إعرابا ويشهد له قوله تعالى: \"الحق من ربك فلا تكن من الممترين\" ولما ذكر تعالى أنه خلقه عبدا نبيا نزه نفسه المقدسة فقال:."
    },
    {
      "ayah": 35,
      "surah": 19,
      "text": "\"ما كان لله أن يتخذ من ولد سبحانه\" أي عما يقول هؤلاء الجاهلون الظالمون المعتدون علوا كبيرا \"إذا قضى أمرا فإنما يقول له كن فيكون\" أي إذا أراد شيئا فإنما يأمر به فيصير كما يشاء كما قال إن مثل عيسى عند الله كمثل آدم خلقه من تراب ثم قال له كن فيكون الحق من ربك فلا تكن من الممترين\"."
    },
    {
      "ayah": 36,
      "surah": 19,
      "text": "وقوله \"وإن الله ربي وربكم فاعبدوه هذا صراط مستقيم\" أي ومما أمر به عيسى قومه وهو في مهده أن أخبرهم إذ ذاك أن الله ربه وربهم وأمرهم بعبادته فقال \"فاعبدوه هذا صراط مستقيم\" أي هذا الذي جئتكم به عن الله \"صراط مستقيم\" أي قويم من اتبعه رشد وهدي ومن خالفه ضل وغوى."
    },
    {
      "ayah": 37,
      "surah": 19,
      "text": "وقوله: \"فاختلف الأحزاب من بينهم\" أي اختلف قول أهل الكتاب في عيسى بعد بيان أمره ووضوح حاله وأنه عبده ورسوله وكلمته ألقاها إلى مريم وروح منه فصممت طائفة منهم وهم جمهور اليهود عليهم لعائن الله على أنه ولد زنية وقالوا كلامه هذا سحر وقالت طائفة أخرى إنما تكلم الله وقال آخرون بل هو ابن الله وقال آخرون ثالث ثلاثة وقال آخرون بل هو عبدالله ورسوله وهذا هو قول الحق الذي أرشد الله إليه المؤمنين وقد روي نحو هذا عن عمرو بن ميمون وابن جريج وقتادة وغير واحد من السلف والخلف. قال عبدالرزاق أخبرنا معمر عن قتادة في قوله \"ذلك عيسى ابن مريم قول الحق الذي فيه يمترون\" قال اجتمع بنو إسرائيل فأخرجوا منهم أربعة نفر أخرج كل قوم عالمهم فامتروا في عيسى حين رفع فقال بعضهم هو الله هبط إلى الأرض فأحيا من أحيا وأمات من أمات ثم صعد إلى السماء وهم اليعقوبية فقال الثلاثة كذبت ثم قال اثنان منهم للثالث قل أنت فيه قال هو ابن الله وهم النسطورية فقال الاثنان كذبت ثم قال أحد الاثنين للآخر قل فيه فقال هو ثالث ثلاثة الله إله وهو إله وأمه إله وهم الإسرائيلية ملوك النصارى عليهم لعائن الله قال الرابع كذبت بل هو عبدالله ورسوله وروحه وكلمته وهم المسلمون. فكان لكل رجل منهم أتباع على ما قالوا فاقتتلوا وظهر على المسلمين وذلك قول الله تعالى \"ويقتلون الذين يأمرون بالقسط من الناس\" قال قتادة وهم الذين قال الله \"فاختلف الأحزاب من بينهم\" قال اختلفوا فيه فصاروا أحزابا وقد روى ابن أبي حاتم عن ابن عباس وعن عروة بن الزبير عن بعض أهل العلم قريبا من ذلك وقد ذكر غير واحد من علماء التاريخ من أهل الكتاب وغيرهم أن قسطنطين جمعهم في محفل كبير من مجامعهم الثلاثة المشهورة عندهم فكان جماعة الأساقفة منهم ألفين ومائة وسبعين أسقفا فاختلفوا في عيسى ابن مريم عليه السلام اختلافا متباينا جدا فقالت كل شرذمة فيه قولا فمائة تقول فيه شيئا وسبعون تقول فيه قولا آخر وخمسون تقول شيئا آخر ومائة وستون تقول شيئا ولم يجتمع على مقالة واحدة أكثر من ثلثمائة وثمانية منهم اتفقوا على قول وصمموا عليه فمال إليهم الملك وكان فيلسوفا فقدمهم ونصرهم وطرد من عداهم فوضعوا له الأمانة الكبيرة بل هي الخيانة العظيمة ووضعوا له كتب القوانين وشرعوا له أشياء وابتدعوا بدعا كثيرة وحرفوا دين المسيح وغيروه فابتنى لهم حينئذ الكنائس الكبار في مملكته كلها بلاد الشام والجزيرة والروم فكان مبلغ الكنائس في أيامه ما يقارب اثني عشر ألف كنيسة وبنت أمه هيلانة قمامة على المكان الذي صلب فيه المصلوب الذي يزعم اليهود أنه المسيح وقد كذبوا بل رفعه الله إلى السماء وقوله \"فويل للذين كفروا من مشهد يوم عظيم\" تهديد ووعيد شديد لمن كذب على الله وافترى وزعم أن له ولدا ولكن أنظرهم تعالى إلى يوم القيامة وأجلهم حلما وثقة بقدرته عليهم فإنه الذي لا يعجل على من عصاه كما جاء في الصحيحين \" إن الله ليملي للظالم حتى إذا أخذه لم يفلته \" ثم قرأ رسول الله صلى الله عليه وسلم \"وكذلك أخذ ربك إذا أخذ القرى وهي ظالمة إن أخذه أليم شديد\" وفي الصحيحين أيضا عن رسول الله صلى الله عليه وسلم أنه قال \" لا أحد أصبر على أذى سمعه من الله إنهم يجعلون له ولدا وهو يرزقهم ويعافيهم \" وقد قال الله تعالى \"وكأين من قرية أمليت لها وهي ظالمة ثم أخذتها وإلي المصير\" وقال تعالى \"ولا تحسبن الله غافلا عما يعمل الظالمون إنما يؤخرهم ليوم تشخص فيه الأبصار\" ولهذا قال ههنا \"فويل للذين كفروا من مشهد يوم عظيم\" أي يوم القيامة. وقد جاء في الحديث الصحيح المتفق- على صحته عن عبادة بن الصامت رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم \" من شهد أن لا إله إلا الله وحده لا شريك له وأن محمدا عبده ورسوله وأن عيسى عبدالله ورسوله وكلمته ألقاها إلى مريم وروح منه وأن الجنة حق والنار حق أدخله الله الجنة على ما كان من العمل \"."
    },
    {
      "ayah": 38,
      "surah": 19,
      "text": "يقول تعالى مخبرا عن الكفار يوم القيامة أنهم يكونون أسمع شيء وأبصره كما قال تعالى \"ولو ترى إذ المجرمون ناكسوا رءوسهم عند ربهم ربنا أبصرنا وسمعنا\" الآية أي يقولون ذلك حين لا ينفعهم ولا يجدي عنهم شيئا ولو كان هذا قبل معاينة العذاب لكان نافعا لهم ومنقذا من عذاب الله ولهذا قال \"أسمع بهم وأبصر\" أي ما أسمعهم وأبصرهم \"يوم يأتوننا\" يعني يوم القيامة \"لكن الظالمون اليوم\" أي في الدنيا \"في ضلال مبين\" أي لا يسمعون ولا يبصرون ولا يعقلون فحيث يطلب منهم الهدى لا يهتدون ويكونون مطيعين حيث لا ينفعهم ذلك."
    },
    {
      "ayah": 39,
      "surah": 19,
      "text": "ثم قال تعالى \"وأنذرهم يوم الحسرة\" أي أنذر الخلائق يوم الحسرة \"إذ قضي الأمر\" أي فصل بين أهل الجنة وأهل النار وصار كل إلى ما صار إليه مخلدا فيه \"وهم\" أي اليوم \"في غفلة\" عما أنذروا به يوم الحسرة والندامة \"وهم لا يؤمنون\" أي لا يصدقون به قال الإمام أحمد: حدثنا محمد بن عبيد حدثنا الأعمش عن أبي صالح عن أبي سعيد قال: قال رسول الله صلى الله عليه وسلم \" إذا دخل أهل الجنة الجنة وأهل النار النار يجاء بالموت كأنه كبش أملح فيوقف بين الجنة والنار فيقال يا أهل الجنة هل تعرفون هذا؟ قال فيشرئبون وينظرون ويقولون نعم هذا الموت - قال - فيقال يا أهل النار هل تعرفون هذا؟ قال فيشرئبون وينظرون ويقولون نعم هذا الموت - قال - فيؤمر به فيذبح قال ويقال يا أهل الجنة خلود ولا موت ويا أهل النار خلود ولا موت \" ثم قرأ رسول الله صلى الله عليه وسلم \"وأنذرهم يوم الحسرة إذ قضي الأمر وهم في غفلة وهم لا يؤمنون\" وأشار بيده ثم قال \" أهل الدنيا في غفلة الدنيا \" هكذا رواه الإمام أحمد وقد خرجه البخاري ومسلم في صحيحيهما من حديث الأعمش به ولفظهما قريب من ذلك وقد روى هذا الحديث الحسن بن عرفة حدثنى أسباط بن محمد عن الأعمش عن أبي صالح عن أبي هريرة مرفوعا مثله وفي سنن ابن ماجه وغيره من حديث محمد بن عمرو عن أبي سلمة عن أبي هريرة نحوه وهو في الصحيحين عن ابن عمر ورواه ابن جريج قال: قال ابن عباس فذكر من قبله نحوه ورواه أيضا عن أبيه أنه سمع عبيد بن عمير يقول في قصصه يؤتى بالموت كأنه دابة فيذبح والناس ينظرون وقال سفيان الثوري عن سلمة بن كهيل حدثنا أبو الزعراء عن عبدالله هو ابن مسعود في قصة ذكرها قال فليس نفس إلا وهي تنظر إلى بيت في الجنة وبيت في النار وهو يوم الحسرة فيرى أهل النار البيت الذي في الجنة ويقال لهم لو علمتهم فتأخذهم الحسرة قال: ويرى أهل الجنة البيت الذي في النار فيقال لهم لولا أن الله من عليكم وقال السدي عن زياد عن زر بن حبيش عن ابن مسعود في قوله \"وأنذرهم يوم الحسرة إذ قضي الأمر\" قال: إذا دخل أهل الجنة الجنة وأهل النار النار أتي بالموت في صورة كبش أملح حتى يوقف بين الجنة والنار ثم ينادي مناد يا أهل الجنة هذا الموت الذي كان يميت الناس في الدنيا فلا يبقى أحد في أهل عليين ولا في أسفل درجة في الجنة إلا نظر إليه ثم ينادي مناد يا أهل النار هذا الموت الذى كان يميت الناس في الدنيا فلا يبقى أحد في ضحضاح من نار ولا في أسفل درك من جهنم إلا نظر إليه ثم يذبح بين الجنة والنار ثم ينادى يا أهل الجنة هو الخلود أبد الآبدين ويا أهل النار هو الخلود أبد الآبدين فيفرح أهل الجنة فرحة لو كان أحد ميتا من فرح ماتوا ويشهق أهل النار شهقة لو كان أحد ميتا من شهقة ماتوا فذلك قوله تعالى \"وأنذرهم يوم الحسرة إذ قضي الأمر\" يقول إذا ذبح الموت رواه ابن أبي حاتم في تفسيره وقال علي بن أبي طلحة عن ابن عباس في قوله \"وأنذرهم يوم الحسرة\" من أسماء يوم القيامة عظمه الله وحذره عباده وقال عبدالرحمن بن زيد بن أسلم في قوله \"وأنذرهم يوم الحسرة\" قال يوم القيامة وقرأ \"أن تقول نفس يا حسرتا على ما فرطت في جنب الله\"."
    },
    {
      "ayah": 4,
      "surah": 19,
      "text": "قال رب إني وهن العظم مني أي ضعفت وخارت القوى \"واشتعل الرأس شيبا\" أي اضطرم المشيب في السواد كما قال ابن دريد في مقصورته: أما ترى رأسي حاكى لونه طرة صبح تحت أذيال الدجــــــا واشتعل المبيض في مسوده مثل اشتعال النار في جمر الغضا والمراد من هذا الإخبار عن الضعف والكبر ودلائله الظاهرة والباطنة وقوله \"ولم أكن بدعائك رب شقيا\" أي ولم أعهد منك إلا الإجابة في الدعاء ولم تردني قط فيما سألتك وقوله \"وإني خفت الموالي من ورائي\" قرأ الأكثرون بنصب الياء من الموالي على أنه مفعول وعن الكسائي أنه سكن الياء كما قال الشاعر: كأن أيديهن في القاع القرق أيدي جوار يتعاطين الورق وقال الآخر: فتى لو يباري الشمس ألقت قناعها أو القمر الساري لألقى المقالدا ومنه قول أبي تمام حبيب بن أوس الطائي: تغاير الشعر منه إذ سهرت له حتى ظننت قوافيه ستقتتل وقال مجاهد وقتادة والسدي: أراد بالموالي العصبية وقال أبو صالح الكلالة وروي عن أمير المؤمنين عثمان بن عفان رضي الله عنه أنه كان يقرؤها."
    },
    {
      "ayah": 40,
      "surah": 19,
      "text": "وقوله: \"إنا نحن نرث الأرض ومن عليها وإلينا يرجعون\"يخبر تعالى أنه الخالق المالك المتصرف وأن الخلق كلهم يهلكون ويبقى هو تعالى وتقدس ولا أحد يدعي ملكا ولا تصرفا بل هو الوارث لجميع خلقه الباقي بعدهم الحاكم فيهم فلا تظلم نفس شيئا ولا جناح بعوضة ولا مثقال ذرة قال ابن أبي حاتم ذكر هدبة بن خالد القيسي حدثنا حزم بن أبي حزم القطعي قال: كتب عمر بن عبدالعزيز إلى عبدالحميد بن عبدالرحمن صاحب الكوفة: أما بعد فإن الله كتب على خلقه حين خلقهم الموت فجعل مصيرهم إليه وقال فيما أنزل في كتابه الصادق الذى حفظه بعلمه وأشهد ملائكته على حفظه أنه يرث الأرض ومن عليها وإليه يرجعون."
    },
    {
      "ayah": 41,
      "surah": 19,
      "text": "يقول تعالى لنبيه محمد صلى الله عليه وسلم \"واذكر في الكتاب إبراهيم\" واتل على قومك هؤلاء الذين يعبدون الأصنام واذكر لهم ما كان من خبر إبراهيم خليل الرحمن الذين هم من ذريته ويدعون أنهم على ملته وقد كان صديقا نبيا مع أبيه."
    },
    {
      "ayah": 42,
      "surah": 19,
      "text": "كيف نهاه عن عبادة الأصنام فقال \"يا أبت لم تعبد ما لا يسمع ولا يبصر ولا يغني عنك شيئا\" أي لا ينفعك ولا يدفع عنك ضررا."
    },
    {
      "ayah": 43,
      "surah": 19,
      "text": "\"يا أبت إني قد جاءني من العلم ما لم يأتك\" يقول وإن كنت من صلبك وتراني أصغر منك لأني ولدك فاعلم أني قد اطلعت من العلم من الله على ما لم تعلمه أنت ولا اطلعت عليه ولا جاءك بعد \"فاتبعني أهدك صراطا سويا\" أي طريقا مستقيما موصلا إلى نيل المطلوب والنجاة من المرهوب."
    },
    {
      "ayah": 44,
      "surah": 19,
      "text": "\"يا أبت لا تعبد الشيطان\" أي لا تطعه في عبادتك هذه الأصنام فإنه هو الداعي إلى ذلك والراضي به كما قال تعالى \"ألم أعهد إليكم يا بني آدم أن لا تعبدوا الشيطان إنه لكم عدو مبين\" وقال \"إن يدعون من دونه إلا إناثا وإن يدعون إلا شيطانا مريدا\" وقوله \"إن الشيطان كان للرحمن عصيا\" أي مخالفا مستكبرا عن طاعة ربه فطرده وأبعده فلا تتبعه تصر مثله."
    },
    {
      "ayah": 45,
      "surah": 19,
      "text": "\"يا أبت إني أخاف أن يمسك عذاب من الرحمن\" أي على شركك وعصيانك لما آمرك به \"فتكون للشيطان وليا\" يعني فلا يكون لك مولى ولا ناصرا ولا مغيثا إلا إبليس وليس إليه ولا إلى غيره من الأمر شيء بل اتباعك له موجب لإحاطة العذاب بك كما قال تعالى \"تالله لقد أرسلنا إلى أمم من قبلك فزين لهم الشيطان أعمالهم فهو وليهم اليوم ولهم عذاب أليم\"."
    },
    {
      "ayah": 46,
      "surah": 19,
      "text": "يقول تعالى مخبرا عن جواب أبي إبراهيم لولده إبراهيم فيما دعاه إليه أنه قال \"أراغب أنت عن آلهتي يا إبراهيم\" إن كنت لا تريد عبادتها ولا ترضاها فانته عن سبها وشتمها وعيبها فإنك إن لم تنته عن ذلك اقتصصت منك وشتمتك وسببتك وهو قوله \"لأرجمنك\" قاله ابن عباس والسدي وابن جريج والضحاك وغيرهم وقوله \"واهجرني مليا\" قال مجاهد وعكرمة وسعيد بن جبير ومحمد بن إسحاق يعني دهرا وقال الحسن البصري زمانا طويلا وقال السدي \"واهجرني مليا\" قال أبدا وقال علي بن أبي طلحة والعوفي عن ابن عباس \"واهجرني مليا\" قال سويا سالما قبل أن تصيبك مني عقوبة وكذا قال الضحاك وقتادة وعطية الجدلي ومالك وغيرهم و اختاره ابن جرير."
    },
    {
      "ayah": 47,
      "surah": 19,
      "text": "فعندها قال إبراهيم لأبيه \"سلام عليك\" كما قال تعالى في صفة المؤمنين \"وإذا خاطبهم الجاهلون قالوا سلاما\" وقال تعالى \"وإذا سمعوا اللغو أعرضوا عنه وقالوا لنا أعمالنا ولكم أعمالكم سلام عليكم لا نبتغي الجاهلين\" ومعنى قول إبراهيم لأبيه \"سلام عليك\" يعني أما أنا فلا ينالك مني مكروه ولا أذى وذلك لحرمة الأبوة \"سأستغفر لك ربي\" ولكن سأسال الله فيك أن يهديك ويغفر ذنبك \"إنه كان بي حفيا\" قال ابن عباس وغيره لطيفا أي في أن هداني لعبادته والإخلاص له وقال قتادة ومجاهد وغيرهما إنه كان بي حفيا قال عوده الإجابة. وقال السدي الحفي الذي يهتم بأمره وقد استغفر إبراهيم صلى الله عليه وسلم لأبيه مدة طويلة وبعد أن هاجر إلى الشام وبنى المسجد الحرام وبعد أن ولد له إسماعيل وإسحاق عليهما السلام في قوله \"ربنا اغفر لي ولوالدي وللمؤمنين يوم يقوم الحساب\" وقد استغفر المسلمون لقراباتهم وأهليهم من المشركين في ابتداء الإسلام وذلك اقتداء بإبراهيم الخليل في ذلك حتى أنزل الله تعالى \"قد كانت لكم أسوة حسنة في إبراهيم والذين معه إذ قالوا لقومهم إنا برآء منكم ومما تعبدون من دون الله - إلى قوله - إلا قول إبراهيم لأبيه لأستغفرن لك وما أملك لك من الله من شيء\" الآية يعني إلا في هذا القول فلا تتأسوا به ثم بين تعالى أن إبراهيم أقلع عن ذلك ورجع عنه فقال تعالى \"ما كان للنبي والذين آمنوا أن يستغفروا للمشركين - إلى قوله - وما كان استغفار إبراهيم لأبيه إلا عن موعدة وعدها إياه فلما تبين له أنه عدو لله تبرأ منه إن إبراهيم لأواه حليم\"."
    },
    {
      "ayah": 48,
      "surah": 19,
      "text": "وقوله \"وأعتزلكم وما تدعون من دون الله وأدعوا ربي\" أي أجتنبكم وأتبرأ منكم ومن آلهتكم التي تعبدونها من دون الله \"وأدعوا ربي\" أي وأعبد ربي وحده لا شريك له \"عسى أن لا أكون بدعاء ربي شقيا\" وعسى هذه موجبة لا محالة فإنه عليه السلام سيد الأنبياء بعد محمد صلى الله عليه سلم."
    },
    {
      "ayah": 49,
      "surah": 19,
      "text": "يقول تعالى فلما اعتزل الخليل أباه وقومه في الله أبدله الله من هو خير منهم ووهب له إسحاق ويعقوب يعني ابنه وابن إسحاق كما قال في الآية الأخرى \"ويعقوب نافلة\" وقال \"ومن وراء إسحاق يعقوب\" ولا خلاف أن إسحاق والد يعقوب وهو نص القرآن في سورة البقرة \"أم كنتم شهداء إذ حضر يعقوب الموت إذ قال لبنيه ما تعبدون من بعدي قالوا نعبدإلهك وإله آبائك إبراهيم وإسماعيل وإسحاق\" ولهذا إنما ذكر ههنا إسحاق ويعقوب أي جعلنا له نسلا وعقبا أنبياء أقر الله بهم عينه في حياته ولهذا قال \"وكلا جعلنا نبيا\" فلو لم يكن يعقوب عليه السلام قد نبئ في حياة إبراهيم لما اقتصر عليه ولذكر ولده يوسف فإنه نبي أيضا كما قال رسول الله صلى الله عليه وسلم في الحديث المتفق على صحته حين سئل عن خير الناس فقال \"يوسف نبي الله ابن يعقوب نبي الله ابن إسحاق نبي الله ابن إبراهيم خليل الله \" وفي اللفظ الآخر \" إن الكريم ابن الكريم ابن الكريم ابن الكريم يوسف بن يعقوب بن إسحاق بن إبراهيم \"."
    },
    {
      "ayah": 5,
      "surah": 19,
      "text": "\"وإني خفت الموالي من ورائي\" بتشديد الفاء بمعنى قلت عصباتي من بعدي وعلى القراءة الأولى وجه خوفه أنه خشي أن يتصرفوا من بعده في الناس تصرفا سيئا فسأل الله ولدا يكون نبيا من بعده ليسوسهم بنبوته ما يوحى إليه فأجيب في ذلك لا أنه خشي من وراثتهم له ماله فإن النبي أعظم منزلة وأجل قدرا من أن يشفق على ماله إلى ما هذا وحده وأن يأنف من وراثة عصباته له ويسأل أن يكون له ولد ليحوز ميراثه دونهم هذا وجه \"الثانى\" أنه لم يذكر أنه كان ذا مال بل كان نجارا يأكل من كسب يديه ومثل هذا لا يجمع مالا ولا سيما الأنبياء فإنهم كانوا أزهد شيء في الدنيا \"الثالث\" أنه قد ثبت في الصحيحين من غير وجه أن رسول الله صلى الله عليه وسلم قال \"لا نورث ما تركنا صدقة\" وفي رواية عند الترمذي بإسناد صحيح \"نحن معشر الأنبياء لا نورث\" وعلى هذا فتعين حمل قوله \"فهب لي من لدنك وليا يرثني\" على ميراث النبوة ولهذا قال \"ويرث من آل يعقوب\" كقوله \"وورث سليمان داود\" أي في النبوة إذ لو كان في المال لما خصه من بين إخوته بذلك ولما كان في الإخبار بذلك كبير فائدة إذ من المعلوم المستقر في جميع الشرائع والملل أن الولد يرث أباه فلولا أنها وراثة خاصة لما أخبر بها وكل هذا يقرره ويثبته ما صح في الحديث \"نحن معاشر الأنبياء لا نورث ما تركنا فهو صدقة\"."
    },
    {
      "ayah": 50,
      "surah": 19,
      "text": "وقوله \"ووهبنا لهم من رحمتنا وجعلنا لهم لسان صدق عليا\" قال علي بن أبي طلحة عن ابن عباس يعني الثناء الحسن وكذا قال السدي ومالك بن أنس وقال ابن جرير إنما قال عليا لأن جميع الملل والأديان يثنون عليهم ويمدحونهم صلوات الله وسلامه عليهم أجمعين."
    },
    {
      "ayah": 51,
      "surah": 19,
      "text": "لما ذكر تعالى إبراهيم الخليل وأثنى عليه عطف بذكر الكليم فقال \"واذكر في الكتاب موسى إنه كان مخلصا\" قرأ بعضهم بكسر اللازم من الإخلاص في العبادة قال الثوري عن عبدالعزيز بن رفيع عن أبي لبابة قال: قال الحواريون يا روح الله أخبرنا عن المخلص لله قال الذي يعمل لله لا يحب أن يحمده الناس وقرأ الآخرون بفتحها بمعنى أنه كان مصطفى كما قال تعالى \"إني اصطفيتك على الناس\" \"وكان رسولا نبيا\" جمع الله له بين الوصفين فإنه كان من المرسلين الكبار أولي العزم الخمسة وهم نوح وإبراهيم وموسى وعيسى ومحمد صلوات الله وسلامه عليهم وعلى سائر الأنبياء أجمعين."
    },
    {
      "ayah": 52,
      "surah": 19,
      "text": "وقوله \"وناديناه من جانب الطور\" أي الجانب \"الأيمن\" من موسى حين ذهب يبتغي من تلك النار جذوة فرآها تلوح فقصدها فوجدها في جانب الطور الأيمن منه غربية عند شاطئ الوادي فكلمه الله تعالى وناداه وقربه فناجاه روى ابن جرير حدثنا ابن بشار حدثنا يحيى هو القطان حدثنا سفيان عن عطاء بن يسار عن سعيد بن جبير عن ابن عباس \" وقربناه نجيا\" قال أدنى حتى سمع صريف القلم وهكذا قال مجاهد وأبو العالية وغيرهم يعنون صريف القلم بكتابة التوراة وقال السدى \"وقربناه نجيا\" قال أدخل في السماء فكلم وعن مجاهد نحوه وقال عبدالرزاق عن معمر عن قتادة \"وقربناه نجيا\" قال نجا بصدقه وروى ابن أبي حاتم حدثنا عبدالجبار بن عاصم حدثنا محمد بن سلمة الحراني عن أبي واصل عن شهر بن حوشب عن عمرو ابن معد يكرب قال لما قرب الله موسى نجيا بطور سيناء قال: يا موسى إذا خلقت لك قلبا شاكرا ولسانا ذاكرا وزوجة تعين على الخير فلم أخزن عنك من الخير شيئا ومن أخزن عنه هذا فلم أفتح له من الخير شيئا."
    },
    {
      "ayah": 53,
      "surah": 19,
      "text": "وقوله \"ووهبنا له من رحمتنا أخاه هارون نبيا\" أي وأجبنا سؤاله وشفاعته في أخيه فجعلناه نبيا كما قال في الآية الأخرى \"وأخي هارون هو أفصح مني لسانا فأرسله معي ردءا يصدقني إني أخاف أن يكذبون\" وقال \"ولقد أوتيت سؤلك يا موسى\" وقال \"فأرسل إلى هارون ولهم علي ذنب فأخاف أن يقتلون\" ولهذا قال بعض السلف ما شفع أحد في أحد شفاعة في الدنيا أعظم من شفاعة موسى في هارون أن يكون نبيا قال الله تعالى \"ووهبنا له من رحمتنا أخاه هارون نبيا\" قال ابن جرير: حدثنا يعقوب حدثنا ابن علية عن داود عن عكرمة قال: قال ابن عباس قوله \"ووهبنا له من رحمتنا أخاه هارون نبيا\" قال كان هارون أكبر من موسى ولكن أراد وهب له نبوته وقد ذكره ابن أبي حاتم معلقا عن يعقوب وهو ابن إبراهيم الدورقي به."
    },
    {
      "ayah": 54,
      "surah": 19,
      "text": "هذا ثناء من الله تعالى على إسماعيل بن إبراهيم الخليل عليهما السلام وهو والد عرب الحجاز كلهم بأنه كان صادق الوعد. قال ابن جريج لم يعد ربه عدة إلا أنجزها يعني ما التزم عبادة قط بنذر إلا قام بها ووفاها حقها وقال ابن جرير: حدثني يونس أنبأنا ابن وهب أخبرني عمرو بن الحارث أن سهل بن عقيل حدثه أن إسماعيل النبي عليه السلام وعد رجلا مكانا أن يأتيه فيه فجاء ونسي الرجل فظل به إسماعيل وبات حتى جاء الرجل من الغد فقال ما برحت من ههنا؟ قال لا قال إني نسيت قال لم أكن لأبرح حتى تأتيني فلذلك \"كان صادق الوعد\" وقال سفيان الثوري بلغني أنه أقام في ذلك المكان ينتظره حولا حتى جاءه وقال ابن شوذب: بلغني أنه اتخذ ذلك الموضع مسكنا وقد رواه أبو داود في سننه وأبو بكر محمد بن جعفر الخرائطي في كتابه مكارم الأخلاق من طريق إبراهيم بن طهمان عن عبدالله بن ميسرة عن عبدالكريم يعني ابن عبدالله بن شقيق عن أبيه عن عبدالله بن أبي الحمساء قال بايعت رسول الله صلى الله عليه وسلم قبل أن يبعث فبقيت له علي بقية فوعدته أن آتيه بها في مكانه ذلك قال فنسيت يومي والغد فأتيته في اليوم الثالث وهو في مكانه ذلك فقال لي \" يا فتى لقد شققت علي أنا ههنا منذ ثلاث أنتظرك \" لفظ الخرائطي وساق آثارا حسنة في ذلك ورواه ابن منده أبو عبدالله في كتاب معرفة الصحابة بإسناده عن إبراهيم بن طهمان عن بديل بن ميسرة عن عبدالكريم به وقال بعضهم إنما قيل له \"صادق الوعد\" لأنه قال لأبيه \"ستجدني إن شاء الله من الصابرين\" فصدق في ذلك فصدق الوعد من الصفات الحميدة كما أن خلفه من الصفات الذميمة قال الله تعالى \"يا أيها الذين آمنوا لم تقولون ما لا تفعلون كبر مقتا عند الله أن تقولوا ما لا تفعلون\" وقال رسول الله صلى الله عليه وسلم \" آية المنافق ثلاث إذا حدث كذب وإذا وعد أخلف وإذا ائتمن خان \" ولما كانت هذه صفات المنافقين كان التلبس بضدها من صفات المؤمنين ولهذا أثنى الله على عبده ورسوله إسماعيل بصدق الوعد وكذلك كان رسول الله صلى الله عليه وسلم صادق الوعد أيضا لا يعد أحدا شيئا إلا وفى له به وقد أثنى على أبي العاص بن الربيع زوج ابنته زينب فقال \" حدثني فصدقني ووعدني فوفى لي \" ولما توفي النبي صلى الله عليه وسلم قال الخليفة أبو بكر الصديق: من كان له عند رسول الله صلى الله عليه وسلم عدة أو دين فليأتني أنجز له فجاءه جابر بن عبدالله فقال إن رسول الله صلى الله عليه وسلم قد قال \"لو قد جاء مال البحرين أعطيتك هكذا وهكذا وهكذا \" يعني ملء كفيه فلما جاء مال البحرين أمر الصديق جابرا فغرف بيده من المال ثم أمره بعده فإذا هو خمسمائة درهم فأعطاه مثليها معها وقوله \"وكان رسولا نبيا\" في هذا دلالة على شرف إسماعيل على أخيه إسحاق لأنه إنما وصف بالنبوة فقط وإسماعيل وصف بالنبوة والرسالة وقد ثبت في صحيح مسلم أن رسول الله صلى الله عليه وسلم قال \" إن الله اصطفى من ولد إبراهيم إسماعيل \" وذكر تمام الحديث فدل على صحة ما قلناه."
    },
    {
      "ayah": 55,
      "surah": 19,
      "text": "وقوله \"وكان يأمر أهله بالصلاة والزكاة وكان عند ربه مرضيا\" هذا أيضا من الثناء الجميل والصفة الحميدة والخلة السديدة حيث كان صابرا على طاعة ربه عز وجل آمرا بها لأهله كما قال تعالى لرسوله \"وامر أهلك بالصلاة واصطبر عليها\" الآية وقال \"يا أيها الذين آمنوا قوا أنفسكم وأهليكم نارا وقودها الناس والحجارة عليها ملائكة غلاظ شداد لا يعصون الله ما أمرهم ويفعلون ما يؤمرون\" أي مروهم بالمعروف وانهوهم عن المنكر ولا تدعوهم هملا فتأكلهم النار يوم القيامة وقد جاء في الحديث عن أبي هريرة قال: قال رسول الله صلى الله عليه وسلم \"رحم الله رجلا قام من الليل فصلى وأيقظ امرأته فإن أبت نضح في وجهها الماء ورحم الله امرأة قامت من الليل فصلت وأيقظت زوجها فإن أبى نضحت في وجهه الماء\" أخرجه أبو داود وابن ماجه. وعن أبي سعيد وأبي هريرة رضي الله عنهما عن النبي صلى الله عليه وسلم قال \"إذا استيقظ الرجل من الليل وأيقظ امرأته فصليا ركعتين كتبا من الذاكرين الله كثيرا والذاكرات \" رواه أبو داود والنسائي وابن ماجه واللفظ له."
    },
    {
      "ayah": 56,
      "surah": 19,
      "text": "ذكر إدريس عليه السلام بالثناء عليه بأنه كان صديقا نبيا وأن الله رفعه مكانا عليا وقد تقدم في الصحيح أن رسول الله صلى الله عليه وسلم مر به في ليلة الإسراء وهو في السماء الرابعة. وقد روى ابن جرير ههنا أثرا غريبا عجيبا فقال: حدثني يونس بن عبدالأعلى أنبأنا ابن وهب أخبرني جرير بن حازم عن سليمان الأعمش عن شمر بن عطية عن هلال ابن يساف قال سأل ابن عباس كعبا وأنا حاضر فقال له ما قول الله عز وجل لإدريس \"ورفعناه مكانا عليا\" فقال كعب أما إدريس فإن الله أوحى إليه أنى أرفع لك كل يوم مثل عمل جميع بني آدم فأحب أن يزداد عملا فأتاه خليل له من الملائكة فقال له إن الله أوحى إلي كذا وكذا فكلم لي ملك الموت فليؤخرني حتى أزداد عملا فحمله بين جناحيه حتى صعد به إلى السماء فلما كان في السماء الرابعة تلقاهم ملك الموت منحدرا فكلم ملك الموت في الذي كلمه فيه إدريس فقال وأين إدريس؟ فقال هو ذا على ظهري قال ملك الموت العجب بعثت وقيل لي اقبض روح إدريس في السماء الرابعة فجعلت أقول كيف أقبض روحه في السماء الرابعة وهو في الأرض فقبض روحه هناك."
    },
    {
      "ayah": 57,
      "surah": 19,
      "text": "فذلك قول الله تعالى \"ورفعناه مكانا عليا\" هذا من أخبار كعب الأحبار الإسرائيليات وفي بعضه نكارة والله أعلم. وقد رواه ابن أبي حاتم من وجه آخر عن ابن عباس أنه سأل كعبا فذكر نحو ما تقدم غير أنه قال لذلك الملك هل لك أن تسأله يعني ملك الموت كم بقي من أجلي لكى أزداد من العمل وذكر باقيه وفيه أنه لما سأله عما بقي من أجله قال لا أدري حتى أنظر فنظر ثم قال إنك تسألني عن رجل ما بقي من عمره إلا طرفة عين فنظر الملك تحت جناحه فإذا هو قد قبض عليه السلام وهو لا يشعر به ثم رواه من وجه آخر عن ابن عباس أن إدريس كان خياطا فكان لا يغرز إبرة إلا قال سبحان الله فكان يمسي حين يمسي وليس في الأرض أحد أفضل عملا منه وذكر بقيته كالذي قبله أو نحوه وقال ابن أبي نجيح عن مجاهد في قوله \"ورفعناه مكانا عليا\" قال إدريس رفع ولم يمت كما رفع عيسى وقال سفيان عن منصور عن مجاهد \"ورفعناه مكانا عليا\" قال السماء الرابعة وقال العوفي عن ابن عباس \"ورفعناه مكانا عليا\" قال رفع إلى السماء السادسة فمات بها وهكذا قال الضحاك بن مزاحم وقال الحسن وغيره في قوله \"ورفعناه مكانا عليا\" قال الجنة."
    },
    {
      "ayah": 58,
      "surah": 19,
      "text": "يقول تعالى هؤلاء النبيون وليس المراد المذكورين في هذه السورة فقط بل جنس الأنبياء عليهم السلام استطرد من ذكر الأشخاص إلى الجنس \"الذين أنعم الله عليهم من النبيين من ذرية آدم\" الآية قال السدي وابن جرير رحمه الله فالذي عنى به من ذرية آدم إدريس والذي عنى به من ذرية من حملنا مع نوح إبراهيم والذي عنى به من ذرية إبراهيم إسحاق ويعقوب وإسماعيل والذى عنى به من ذرية إسرائيل موسى وهارون وزكريا ويحيى وعيسى ابن مريم قال ابن جرير ولذلك فرق أنسابهم وإن كان يجمع جميعهم آدم لأن فيهم من ليس من ولد من كان مع نوح في السفينة وهو إدريس فإنه جد نوح \" قلت \" هذا هو الأظهر أن إدريس في عمود نسب نوح عليهما السلام. وقد قيل إنه من أنبياء بني إسرائيل أخذا من حديث الإسراء حيث قال في سلامه على النبي صلى الله عليه وسلم: مرحبا بالنبي الصالح والأخ الصالح ولم يقل والولد الصالح كما قال آدم وإبراهيم عليهما السلام وروى ابن أبي حاتم حدثنا يونس أنبأنا ابن وهب أخبرني ابن لهيعة عن يزيد ابن أبي حبيب عن عبدالله بن عمر أن إدريس أقدم من نوح فبعثه الله إلى قومه فأمرهم أن يقولوا لا إله إلا الله ويعملوا ما شاءوا فأبوا فأهلكهم الله عز وجل ومما يؤيد أن المراد بهذه الآية جنس الأنبياء أنها كقوله تعالى في سورة الأنعام \"وتلك حجتنا آتيناها إبراهيم على قومه نرفع درجات من نشاء إن ربك حكيم عليم ووهبنا له إسحاق ويعقوب كلا هدينا ونوحا هدينا من قبل ومن ذريته داود وسليمان وأيوب ويوسف وموسى وهارون وكذلك نجزي المحسنين وزكريا ويحيى وعيسى وإلياس كل من الصالحين وإسماعيل واليسع ويونس ولوطا وكلا فضلنا على العالمين ومن آبائهم وذرياتهم وإخوانهم واجتبيناهم وهديناهم إلى صراط مستقيم - إلى قوله - أولئك الذين هدى الله فبهداهم اقتده\" وقال سبحانه وتعالى \"منهم من قصصنا عليك ومنهم من لم نقصص عليك\" وفي صحيح البخاري عن مجاهد أنه سأل ابن عباس أفي ص سجدة؟ فقال نعم ثم تلا هذه الآية \"أولئك الذين هدى الله فبهداهم اقتده\" فنبيكم ممن أمر أن يقتدى بهم قال وهو منهم يعني داود. وقال الله تعالى في هذه الآية الكريمة \"إذا تتلى عليهم آيات الرحمن خروا سجدا وبكيا\" أي إذا سمعوا كلام الله المتضمن حججه ودلائله وبراهينه سجدوا لربهم خضوعا واستكانة حمدا وشكرا على ما هم فيه من النعم العظيمة والبكي جمع باك فلهذا أجمع العلماء على شرعية السجود ههنا اقتداء بهم واتباعا لمنوالهم. قال سفيان الثوري عن الأعمش عن إبراهيم عن أبي معمر قال قرأ عمر بن الخطاب رضي الله عنه سورة مريم فسجد وقال هذا السجود فأين البكى يريد البكاء رواه ابن أبي حاتم وابن جرير وسقط من روايته ذكر أبي معمر فيما رأيت فالله أعلم."
    },
    {
      "ayah": 59,
      "surah": 19,
      "text": "لما ذكر تعالى حزب السعداء وهم الأنبياء عليهم السلام ومن اتبعهم من القائمين بحدود الله وأوامره المؤدين فرائض الله التاركين لزواجره ; ذكر أنه \"خلف من بعدهم خلف\" أي قرون أخر \"أضاعوا الصلاة\" وإذا أضاعوها فهم لما سواها من الواجبات أضيع لأنها عماد الدين وقوامه وخير أعمال العباد وأقبلوا على شهوات الدنيا وملاذها ورضوا بالحياة الدنيا واطمأنوا بها فهؤلاء سيلقون غيا أي خسارا يوم القيامة وقد اختلفوا في المراد بإضاعة الصلاة ههنا فقال قائلون: المراد بإضاعتها تركها بالكلية قاله محمد بن كعب القرظي وابن زيد بن أسلم والسدي واختاره ابن جرير ولهذا ذهب من ذهب من السلف والخلف والأئمة كما هو المشهور عن الإمام أحمد وقول عن الشافعي إلى تكفير تارك الصلاة للحديث \" بين العبدوبين الشرك ترك الصلاة \" والحديث الآخر \" العهد الذي بيننا وبينهم الصلاة فمن تركها فقد كفر\" وليس هذا محل بسط هذه المسألة وقال الأوزاعي عن موسى بن سليمان عن القاسم بن مخيمرة في قوله \"فخلف من بعدهم خلف أضاعوا الصلاة\" قال إنما أضاعوا المواقيت ولو كان تركا كان كفرا وقال وكيع عن المسعودي عن القاسم بن عبدالرحمن والحسن بن سعيد عن ابن مسعود أنه قيل له إن الله يكثر ذكر الصلاة في القرآن \"الذين هم عن صلاتهم ساهون\" و \"على صلاتهم دائمون\" و \"على صلاتهم يحافظون\" فقال ابن مسعود على مواقيتها قالوا ما كنا نرى ذلك إلا على الترك قال ذلك الكفر وقال مسروق: لا يحافظ أحد على الصلوات الخمس فيكتب من الغافلين وفي إفراطهن الهلكة وإفراطهن إضاعتهن عن وقتهن وقال الأوزاعي عن إبراهيم بن يزيد أن عمر بن عبدالعزيز قرأ \"فخلف من بعدهم خلف أضاعوا الصلاة واتبعوا الشهوات فسوف يلقون غيا\" ثم قال لم تكن إضاعتهم تركها ولكن أضاعوا الوقت وقال ابن أبي نجيح عن مجاهد \"فخلف من بعدهم خلف أضاعوا الصلاة واتبعوا الشهوات\" قال عند قيام الساعة وذهاب صالحي أمة محمد صلى الله عليه وسلام ينزو بعضهم على بعض في الأزقة وكذا روى ابن جريج عن مجاهد مثله وروى جابر الجعفي عن مجاهد وعكرمة وعطاء بن أبي رباح أنهم من هذه الأمة يعنون في آخر الزمان وقال ابن جرير حدثني الحارث حدثنا الحسن الأشيب حدثنا شريك عن إبراهيم بن مهاجر عن مجاهد \"فخلف من بعدهم خلف أضاعوا الصلاة واتبعوا الشهوات\" قال هم في هذه الأمة يتراكبون تراكب الأنعام والحمر في الطرق لا يخافون الله في السماء ولا يستحيون من الناس في الأرض وقال ابن أبى حاتم حدثنا أحمد بن سنان الواسطي حدثنا أبو عبدالرحمن المقري حدثنا حيوة حدثنا بشير بن أبي عمرو الخولاني أن الوليد بن قيس حدثه أنه سمع أبا سعيد الخدري يقول: سمعت رسول الله صلى الله عليه وسلم يقول \" يكون خلف بعد ستين سنة أضاعوا الصلاة واتبعوا الشهوات فسوف يلقون غيا ثم يكون خلف يقرأون القرآن لا يعدو تراقيهم ويقرأ القرآن ثلاثة مؤمن ومنافق وفاجر \" وقال بشير قلت للوليد ما هؤلاء الثلاثة؟ قال المؤمن مؤمن به والمنافق كافر به والفاجر يأكل به وهكذا رواه أحمد عن أبي عبدالرحمن المقري وقال ابن أبي حاتم أيضا حدثني أبي حدثنا إبراهيم ابن موسى أنبأنا عيسى بن يونس حدثنا عبيدالله بن عبدالرحمن بن وهب عن مالك عن أبي الرجال أن عائشة كانت ترسل بالشيء صدقة لأهل الصفة وتقول لا تعطوا منه بربريا ولا بربرية فإني سمعت رسول الله صلى الله عليه وسلم يقول \" هم الخلف الذين قال الله تعالى فيهم فخلف من بعدهم خلف أضاعوا الصلاة \" هذا حديث غريب وقال أيضا حدثني أبي حدثنا عبدالرحمن بن الضحاك حدثنا الوليد بن جرير عن شيخ من أهل المدينة أنه سمع محمد بن كعب القرظي يقول في قول الله \"فخلف من بعدهم خلف\" الآية قال هم أهل الغرب يملكون وهم شر من ملك وقال كعب الأحبار والله إنى لأجد صفة المنافقين في كتاب الله عز وجل شرابين للقهوات تراكين للصلوات لعابين بالكعبات رقادين عن العتمات مفرطين في الغدوات تراكين للجمعات قال ثم تلا هذه الآية \"فخلف من بعدهم خلف أضاعوا الصلاة واتبعوا الشهوات فسوف يلقون غيا\" وقال الحسن البصري: عطلوا المساجد ولزموا الضيعات وقال أبو الأشهب العطاردي: أوحى الله إلى داود عليه السلام يا داود حذر وأنذر أصحابك أكل الشهوات فإن القلوب المعلقة بشهوات الدنيا عقولها عني محجوبة وإن أهون ما أصنع بالعبد من عبيدي إذا آثر شهوة من شهواته أن أحرمه طاعتي وقال الإمام أحمد: حدثنا زيد بن الحباب حدثنا أبو زيد التميمي عن أبي قبيل أنه سمع عقبة بن عامر قال: قال رسول الله صلى الله عليه وسلم \" إني أخاف على أمتي اثنتين: القرآن واللبن \" أما اللبن فيتبعون الزيف ويتبعون الشهوات ويتركون الصلاة وأما القرآن فيتعلمه المنافقون فيجادلون به المؤمنين ورواه عن حسن بن موسى عن ابن لهيعة حدثنا أبو قبيل عن عقبة به مرفوعا بنحوه تفرد به وقوله \"فسوف يلقون غيا\" قال علي بن أبي طلحة عن ابن عباس \"فسوف يلقون غيا\" أي خسرانا وقال قتادة شرا وقال سفيان الثوري وشعبة ومحمد بن إسحاق عن أبي إسحاق السبيعي عن أبي عبيدة عن عبدالله بن مسعود \"فسوف يلقون غيا\" قال واد في جهنم بعيد القعر خبيث الطعم وقال الأعمش عن زياد عن أبي عياض في قوله \"فسوف يلقون غيا\" قال واد في جهنم من قيح ودم وقال الإمام أبو جعفر بن جرير حدثني عباس بن أبي طالب حدثنا محمد بن زياد حدثنا شرقي بن قطامي عن لقمان بن عامر الخزاعي قال: جئت أبا أمامة صدي بن عجلان الباهلي فقلت حدثنا حديثا سمعته من رسول الله صلى الله عليه وسلم فدعا بطعام ثم قال: قال رسول الله صلى الله عليه \" لو أن صخرة زنة عشر أواق قذف بها من شفير جهنم ما بلغت قعرها خمسين خريفا ثم تنتهي إلى غي وآثام \" قال قلت ما غي وآثام قال: قال \" بئران في أسفل جهنم يسيل فيهما صديد أهل النار \" وهما اللذان ذكرهما الله في كتابه \"أضاعوا الصلاة واتبعوا الشهوات فسوف يلقون غيا\" وقوله في الفرقان \"ولا يزنون ومن يفعل ذلك يلق أثاما\" هذا حديث غريب ورفعه منكر."
    },
    {
      "ayah": 6,
      "surah": 19,
      "text": "قال مجاهد في قوله \"يرثني ويرث من آل يعقوب\" كان وراثته علما وكان زكريا من ذرية يعقوب وقال هشيم أخبرنا إسماعيل بن أبي خالد عن أبي صالح في قوله \"يرثني ويرث من آل يعقوب\" قال يكون نبيا كما كانت آباؤه أنبياء وقال عبدالرزاق عن معمر عن قتادة عن الحسن يرث نبوته وعلمه وقال السدي يرث نبوتي ونبوة آل يعقوب وعن مالك عن زيد بن أسلم \"ويرث من آل يعقوب\" قال نبوتهم وقال جابر بن نوح ويزيد بن هارون كلاهما عن إسماعيل بن أبي خالد عن أبي صالح في قوله \"يرثني ويرث من آل يعقوب\" قال: يرث ما بي من يرث من آل يعقوب النبوة وهذا اختيار ابن جرير في تفسيره وقال عبدالرزاق أخبرنا معمر عن قتادة أن النبي صلى الله عليه وسلم قال \"يرحم الله زكريا وما كان عليه من وراثة ماله ويرحم الله لوطا إن كان ليأوي إلى ركن شديد\". وقال ابن جرير: حدثنا أبو كريب حدثنا جابر بن نوح عن مبارك هو ابن فضالة عن الحسن قال: قال رسول الله صلى الله عليه وسلم \"رحم الله أخي زكريا ما كان عليه من وراثة ماله حين قال \"هب لي من لدنك وليا يرثني ويرث من آل يعقوب\" وهذه مرسلات لا تعارض الصحاح والله أعلم وقوله \"واجعله رب رضيا\" أي مرضيا عندك وعند خلقك تحبه وتحببه إلى خلقك في دينه وخلقه."
    },
    {
      "ayah": 60,
      "surah": 19,
      "text": "وقوله \"إلا من تاب وآمن وعمل صالحا\" أي إلا من رجع عن ترك الصلوات واتباع الشهوات فإن الله يقبل توبته ويحسن عاقبته ويجعله من ورثة جنة النعيم ولهذا قال \"فأولئك يدخلون الجنة ولا يظلمون شيئا\" وذلك لأن التوبة تجب ما قبلها وفي الحديث الآخر \" التائب من الذنب كمن لا ذنب له \" ولهذا لا ينقص هؤلاء التائبون من أعمالهم التي عملوها شيئا ولا قوبلوا بما عملوه قبلها فينقص لهم مما عملوه بعدها لأن ذلك ذهب هدرا وترك نسيا وذهب مجانا من كرم الكريم وحلم الحليم وهذا الاستثناء ههنا كقوله في سورة الفرقان \"والذين لا يدعون مع الله إلها آخر ولا يقتلون النفس التي حرم الله إلا بالحق - إلى قوله - وكان الله غفورا رحيما\"."
    },
    {
      "ayah": 61,
      "surah": 19,
      "text": "يقول تعالى الجنات التي يدخلها التائبون من ذنوبهم هي جنات عدن أي إقامة التي وعد الرحمن عباده بظهر الغيب أي هي من الغيب الذي يؤمنون به وما رأوه وذلك لشدة إيقانهم وقوة إيمانهم وقوله \"إنه كان وعده مأتيا\" تأكيد لحصول ذلك وثبوته واستقراره فإن الله لا يخلف الميعاد ولا يبدله كقوله \"كان وعده مفعولا\" أي كائنا لا محالة وقوله ههنا \"مأتيا\" أي العباد صائرون إليه وسيأتونه ومنهم من قال \"مأتيا\" بمعنى آتيا لأن كل ما أتاك فقد أتيته كما تقول العرب: أتت علي خمسون سنة وأتيت على خمسين سنة كلاهما بمعنى واحد."
    },
    {
      "ayah": 62,
      "surah": 19,
      "text": "وقوله \"لا يسمعون فيها لغوا\" أي هذه الجنات ليس فيها كلام ساقط تافه لا معنى له كما قد يوجد في الدنيا وقوله \"إلا سلاما\" استثناء منقطع كقوله \"لا يسمعون فيها لغوا ولا تأثيما إلا قيلا سلاما سلاما\" وقوله \"ولهم رزقهم فيها بكرة وعشيا\" أي في مثل وقت البكرات ووقت العشيات لا أن هناك ليلا ونهارا ولكنهم في أوقات تتعاقب يعرفون مضيها بأضواء وأنوار كما قال الإمام أحمد: حدثنا عبدالرزاق حدثنا معمر عن همام عن أبي هريرة قال: قال رسول الله صلى الله عليه وسلم \" أول زمرة تلج الجنة صورهم على صورة القمر ليلة البدر لا يبصقون فيها ولا يتمخطون فيها ولا يتغوطون آنيتهم وأمشاطهم الذهب والفضة ومجامرهم الألوة ورشحهم المسك ولكل واحد منهم زوجتان يرى مخ ساقها من وراء اللحم من الحسن لا اختلاف بينهم ولا تباغض قلوبهم على قلب رجل واحد يسبحون الله بكرة وعشيا \" أخرجاه في الصحيحين من حديث معمر به وقال الإمام أحمد حدثنا يعقوب حدثنا أبي عن ابن إسحاق حدثنا الحارث بن فضيل الأنصاري عن محمود بن لبيد الأنصاري عن ابن عباس قال: قال رسول الله صلى الله عليه وسلم \" الشهداء على بارق نهر بباب الجنة في قبة خضراء يخرج عليهم رزقهم من الجنة بكرة وعشيا \" تفرد به أحمد من هذا الوجه وقال الضحاك عن ابن عباس \"ولهم رزقهم فيها بكرة وعشيا\" قال مقادير الليل والنهار وقال ابن جرير حدثنا علي بن سهل حدثنا الوليد بن مسلم قال سألت زهير بن محمد عن قول الله تعالى \"ولهم رزقهم فيها بكرة وعشيا\" قال: ليس في الجنة ليل هم في نور أبدا ولهم مقدار الليل والنهار يعرفون مقدار الليل بإرخاء الحجب وإغلاق الأبواب ويعرفون مقدار النهار برفع الحجب وبفتح الأبواب وبهذا الإسناد عن الوليد بن مسلم عن خليد عن الحسن البصري وذكر أبواب الجنة فقال أبواب يرى ظاهرها من باطنها فتكلم وتكلم فنفهم انفتحي انغلقي فتفعل وقال قتادة في قوله \"ولهم رزقهم فيها بكرة وعشيا\" فيها ساعتان بكرة وعشي ليس ثم ليل ولا نهار وإنما هو ضوء ونور. وقال مجاهد ليس بكرة ولا عشي ولكن يؤتون به على ما كانوا يشتهون في الدنيا وقال الحسن وقتادة وغيرهما كانت العرب الأنعم فيهم من يتغدى ويتعشى فنزل القرآن على ما في أنفسهم من النعيم فقال تعالى \"ولهم رزقهم فيها بكرة وعشيا\" وقال ابن مهدي عن حماد بن زيد عن هشام عن الحسن \"ولهم رزقهم فيها بكرة وعشيا\" قال: البكور يرد على العشي والعشي يرد على البكور ليس فيها ليل وقال ابن أبي حاتم حدثنا علي بن الحسين حدثنا سليمان بن منصور بن عمار حدثنى أبي حدثني محمد بن زياد قاضي أهل شماط عن عبدالله بن حدير عن أبي سلمة بن عبدالرحمن عن أبي هريرة عن النبي صلى الله عليه وسلم قال \" ما من غداة من غدوات الجنة وكل الجنة غدوات إلا أنه يزف إلى ولي الله فيها زوجة من الحور العين أدناهن التي خلقت من الزعفران \" قال أبو محمد هذا حديث غريب منكر."
    },
    {
      "ayah": 63,
      "surah": 19,
      "text": "وقوله \"تلك الجنة التي نورث من عبادنا من كان تقيا\" أي هذه الجنة التي وصفنا بهذه الصفات العظيمة هي التي نورثها عبادنا المتقين وهم المطيعون لله عز وجل في السراء والضراء والكاظمون الغيظ والعافون عن الناس وكما قال تعالى في أول سورة المؤمنون \"قد أفلح المؤمنون الذين هم في صلاتهم خاشعون\" إلى أن قال \"الوارثون الذين يرثون الفردوس هم فيها خالدون\"."
    },
    {
      "ayah": 64,
      "surah": 19,
      "text": "قال الإمام أحمد: حدثنا يعلى ووكيع قالا حدثنا عمر بن ذر عن أبيه عن سعيد بن جبير عن ابن عباس قال: قال رسول الله صلى الله عليه وسلم لجبرائيل \" ما يمنعك أن تزورنا أكثر مما تزورنا؟ \" قال فنزلت \"وما نتنزل إلا بأمر ربك\" إلى آخر الآية. انفرد بإخراجه البخاري فرواه عند تفسير هذه الآية عن أبي نعيم عن عمر بن ذر به ورواه ابن أبي حاتم وابن جرير من حديث عمر بن ذر به وعندهما زيادة في آخر الحديث فكان ذلك الجواب لمحمد صلى الله عليه وسلم وقال العوفي عن ابن عباس احتبس جبرائيل جبرائيل عن رسول الله صلى الله عليه وسلم فوجد رسول الله صلى الله عليه وسلم من ذلك وحزن فأتاه جبرائيل وقال يا محمد \"وما نتنزل إلا بأمر ربك\" الآية. وقال مجاهد لبث جبرائيل عن محمد صلى الله عليه وسلم اثنتي عشرة ليلة ويقولون أقل فلما جاءه قال يا جبرائيل لقد رثت علي حتى ظن المشركون كل ظن \" فنزلت \"وما نتنزل إلا بأمر ربك\" الآية قال وهذه الآية كالتي في الضحى وكذلك قال الضحاك بن مزاحم وقتادة والسدي وغير واحد أنها نزلت في احتباس جبرائيل وقال الحكم بن أبان عن عكرمة قال أبطأ جبرائيل النزول على النبي صلى الله عليه وسلم أربعين يوما ثم نزل فقال له النبي صلى الله عليه وسلم \" ما نزلت حتى اشتقت إليك \" فقال له جبريل بل أنا كنت إليك أشوق ولكني مأمور فأوحى الله إلى جبرائيل أن قل له \"وما نتنزل إلا بأمر ربك\" الآية رواه ابن أبي حاتم رحمه الله وهو غريب وقال ابن أبي حاتم حدثنا أحمد بن سنان حدثنا أبو معاوية حدثنا الأعمش عن مجاهد قال أبطأت الرسل على النبي صلى الله عليه وسلم ثم أتاه جبريل فقال له \" ما حبسك يا جبريل؟ \" فقال له جبريل وكيف نأتيكم وأنتم لا تقصون أظفاركم ولا تنقون براجمكم ولا تأخذون شواربكم ولا تستاكون؟ ثم قرأ \"وما نتنزل إلا بأمر ربك\" إلى آخر الآية. وقد قال الطبراني حدثنا أبو عامر النحوي حدثنا محمد بن إبراهيم الصوري حدثنا سليمان بن عبدالرحمن الدمشقي حدثنا إسماعيل بن عياش أخبرني ثعلبة بن مسلم عن أبي كعب مولى ابن عباس عن ابن عباس عن النبي صلى الله عليه وسلم: أن جبرائيل أبطأ عليه فذكر له ذلك فقال وكيف وأنتم لا تستنون ولا تقلمون أظفاركم ولا تقصون شواربكم ولا تنقون براجمكم؟ وهكذا رواه الإمام أحمد عن أبي اليمان عن إسماعيل بن عياش عن ابن عباس بنحوه وقال الإمام أحمد حدثنا سيار حدثنا جعفر بن سليمان حدثنا المغيرة بن حبيب عن مالك بن دينار حدثني شيخ من أهل المدينة عن أم سلمة قالت قال لي رسول الله صلى الله عليه وسلم \" أصلحي لنا المجلس فإنه ينزل ملك إلى الأرض لم ينزل إليها قط \" وقوله \"له ما بين أيدينا وما خلفنا\" قيل المراد ما بين أيدينا أمر الدنيا وما خلفنا أمر الآخرة \"وما بين ذلك\" ما بين النفختين هذا قول أبي العالية وعكرمة ومجاهد وسعيد بن جبير وقتادة في رواية عنهما والسدي والربيع بن أنس وقيل \"ما بين أيدينا\" ما يستقبل من أمر الآخرة \"وما خلفنا\" أي ما مضى من الدنيا \"وما بين ذلك\" أي ما بين الدنيا والآخرة ويروى نحوه عن ابن عباس وسعيد بن جبير والضحاك وقتادة وابن جريج والثوري واختاره ابن جرير أيضا والله أعلم. وقوله \"وما كان ربك نسيا\" قال مجاهد والسدي: معناه ما نسيك ربك وقد تقدم عنه أن هذه الآية كقوله \"والضحى والليل إذا سجى ما ودعك ربك وما قلى\" وقال ابن أبي حاتم حدثنا يزيد بن محمد بن عبدالصمد الدمشقي حدثنا محمد بن عثمان يعني أبا الجماهر حدثنا إسماعيل بن عياش حدثنا عاصم بن رجاء بن حيرة عن أبيه عن أبي الدرداء يرفعه قال \" ما أحل الله في كتابه فهو حلال وما حرمه فهو حرام وما سكت عنه فهو عافية فاقبلوا من الله عافيته فإن الله لم يكن لينسى شيئا \" ثم تلا هذه الآية \"وما كان ربك نسيا\"."
    },
    {
      "ayah": 65,
      "surah": 19,
      "text": "وقوله \"رب السموات والأرض وما بينهما\" أي خالق ذلك ومدبره والحاكم فيه والمتصرف الذي لا معقب لحكمه \"فاعبده واصطبر لعبادته هل تعلم له سميا\" قال علي بن أبي طلحة عن ابن عباس هل تعلم للرب مثلا أو شبيها وكذلك قال مجاهد وسعيد بن جبير وقتادة وابن جريج وغيرهم وقال عكرمة عن ابن عباس ليس أحد يسمى الرحمن غيره تبارك وتعالى وتقدس اسمه."
    },
    {
      "ayah": 66,
      "surah": 19,
      "text": "يخبر تعالى عن الإنسان أنه يتعجب ويستبعد إعادته بعد موته كما قال تعالى\"وإن تعجب فعجب قولهم أئذا كنا ترابا أئنا لفي خلق جديد\"وقال\"أو لم ير الإنسان أنا خلقناه من نطفةفإذا هو خصيم مبين وضرب لنا مثلا ونسي خلقه قال من يحيي العظام وهي رميم قل يحييها الذي أنشأها أول مرة وهو بكل خلق عليم\"وقال هاهنا\"ويقول الإنسان أئذا ما مت لسوف أخرج حيا\"."
    },
    {
      "ayah": 67,
      "surah": 19,
      "text": "يستدل تعالى بالبداءة على الإعادة يعني أنه تعالى قد خلق الإنسان ولم يك شيئا أفلا يعيده وقد صار شيئا كما قال تعالى \"وهو الذي يبدأ الخلق ثم يعيده وهو أهون عليه\" وفي الصحيح \"يقول الله تعالى كذبني ابن آدم ولم يكن له أن يكذبني وآذاني ابن آدم ولم يكن له أن يؤذيني أما تكذيبه إياي فقوله لن يعيدني كما بدأني وليس أول الخلق بأهون علي من آخره وأما أذاه إياي فقوله إن لي ولدا وأنا الأحد الصمد الذي لم يلد ولم يولد ولم يكن له كفوا أحد \"."
    },
    {
      "ayah": 68,
      "surah": 19,
      "text": "وقوله \"فوربك لنحشرنهم والشياطين\" أقسم الرب تبارك وتعالى بنفسه الكريمة أنه لا بد أن يحشرهم جميعا وشياطينهم الذين كانوا يعبدون من دون الله \"ثم لنحضرنهم حول جهنم جثيا\" قال العوفي عن ابن عباس يعني قعودا كقوله \"وترى كل أمة جاثية\" وقال السدي في قوله جثيا يعني قياما وروي عن مرة عن ابن مسعود مثله."
    },
    {
      "ayah": 69,
      "surah": 19,
      "text": "وقوله \"ثم لننزعن من كل شيعة\" يعني من كل أمة قاله مجاهد \"أيهما أشد على الرحمن عتيا\" قال الثوري عن علي بن الأقمر عن ابن الأحوص عن ابن مسعود قال: يحبس الأول على الآخر حتى إذا تكاملت العدة أتاهم جميعا ثم بدأ بالأكابر فالأكابر جرما وهو قوله \"ثم لننزعن من كل شيعة أيهم أشد على الرحمن عتيا\" وقال قتادة \"ثم لننزعن من كل شيعة أيهم أشد على الرحمن عتيا\" قال ثم لننزعن من أهل كل دين قادتهم ورؤساءهم في الشر وكذا قال ابن جريج وغير واحد من السلف وهذا كقوله تعالى \"حتى إذا اداركوا فيها جميعا قالت أخراهم لأولاهم ربنا هؤلاء أضلونا فآتهم عذابا ضعفا من النار-إلى قوله - بما كنتم تكسبون\"."
    },
    {
      "ayah": 7,
      "surah": 19,
      "text": "هذا الكلام يتضمن محذوفا وهو أنه أجيب إلى ما سأل في دعائه فقيل له \"يا زكريا إنا نبشرك بغلام اسمه يحيى\" كما قال تعالى \"هنالك دعا زكريا ربه قال رب هب لي من لدنك ذرية طيبة إنك سميع الدعاء فنادته الملائكة وهو قائم يصلي في المحراب أن الله يبشرك بيحيى مصدقا بكلمة من الله وسيدا وحصورا ونبيا من الصالحين\" وقوله \"لم نجعل له من قبل سميا\". قال قتادة وابن جريج وابن زيد: أي لم يسم أحد قبله بهذا الاسم واختاره ابن جرير رحمه الله وقال مجاهد \"لم نجعل له من قبل سميا\" أي شبيها أخذه من معنى قوله \"فاعبده واصطبر لعبادته هل تعلم له سميا\" أي شبيها وقال علي بن أبي طلحة عن ابن عباس أي لم تلد العواقر قبله مثله وهذا دليل على أن زكريا عليه السلام كان لا يولد له وكذلك امرأته كانت عاقرا من أول عمرها بخلاف إبراهيم وسارة عليهما السلام فإنهما إنما تعجبا من البشارة بإسحاق لكبرهما لا لعقرهما ولهذا قال \"أبشرتموني على أن مسني الكبر فبم تبشرون\" مع أنه كان قد ولد له قبله إسماعيل بثلاث عشرة سنة وقالت امرأته \"يا ويلتى أألد وأنا عجوز وهذا بعلي شيخا إن هذا لشيء عجيب قالوا أتعجبين من أمر الله رحمة الله وبركاته عليكم أهل البيت إنه حميد مجيد\"."
    },
    {
      "ayah": 70,
      "surah": 19,
      "text": "وقوله \"ثم لنحن أعلم بالذين هم أولى بها صليا\" ثم ههنا لعطف الخبر على الخبر والمراد أنه تعالى أعلم بمن يستحق من العباد أن يصلى بنار جهنم ويخلد فيها وبمن يستحق تضعيف العذاب كما قال في الآية المتقدمة \"قال لكل ضعف ولكن لا تعلمون\"."
    },
    {
      "ayah": 71,
      "surah": 19,
      "text": "قال الإمام أحمد حدثنا سليمان بن حرب حدثنا خالد بن سليمان عن كثير بن زياد البرساني عن أبي سمية قال اختلفنا في الورود فقال بعضنا لا يدخلها مؤمن وقال بعضهم يدخلونها جميعا ثم ينجي الله الذين اتقوا فلقيت جابر بن عبدالله فقلت له إنا اختلفنا في الورود فقال يردونها جميعا وقال سليمان بن مرة يدخلونها جميعا وأهوى بأصبعيه إلى أذنيه وقال صمتا إن لم أكن سمعت رسول الله صلى الله عليه وسلم يقول: \" لا يبقى بر ولا فاجر إلا دخلها فتكون على المؤمن بردا وسلاما كما كانت على إبراهيم حتى إن للنار ضجيجا من بردهم ثم ينجي الله الذين اتقوا ويذر الظالمين فيها جثيا \" غريب ولم يخرجوه وقال الحسن بن عرفة حدثنا مروان بن معاوية عن بكار بن أبي مروان عن خالد بن معدان قال: قال أهل الجنة بعد ما دخلوا الجنة ألم يعدنا ربنا الورود على النار؟ قال قد مررتم عليها وهي خامدة وقال عبدالرزاق عن ابن عيينة عن إسماعيل بن أبي خالد عن قيس بن أبي حازم قال كان عبدالله بن رواحة واضعا رأسه في حجر امرأته فبكى فبكت امرأته قال ما يبكيك؟ قالت رأيتك تبكي فبكيت قال إني ذكرت قول الله عز وجل \"وإن منكم إلا واردها\" فلا أدري أنجو منها أم لا - وفي رواية - وكان مريضا وقال ابن جرير حدثنا أبو كريب حدثنا ابن يمان عن مالك بن مغول عن أبي إسحاق كان أبو ميسرة إذا أوى إلى فراشه قال يا ليت أمي لم تلدنى ثم يبكي فقيل له ما يبكيك يا أبا ميسرة؟ فقال أخبرنا أنا واردوها ولم نخبر أنا صادرون عنها وقال عبدالله بن المبارك عن الحسن البصري قال: قال رجل لأخيه هل أتاك أنك وارد النار قال نعم قال فهل أتاك أنك صادر عنها؟ قال لا قال ففيم الضحك؟ قال فما رئي ضاحكا حتى لحق بالله وقال عبدالرزاق أيضا أخبرنا ابن عيينة عن عمرو أخبرني من سمع ابن عباس يخاصم نافع بن الأزرق فقال ابن عباس الورود الدخول فقال نافع لا فقرأ ابن عباس \"إنكم وما تعبدون من دون الله حصب جهنم أنتم لها واردون\" وردوا أم لا وقال \"يقدم قومه يوم القيامة فأوردهم النار\" أوردها أم لا أما أنا وأنت فسندخلها فانظر هل نخرج منها أو لا وما أرى الله مخرجك منها بتكذيبك فضحك نافع. وروى ابن جريج عن عطاء قال قال أبو راشد الحروري وهو نافع بن الأزرق \"لا يسمعون حسيسها\" فقال ابن عباس ويلك أمجنون أنت أين قوله: \"يقدم قومه يوم القيامة فأوردهم النار\" \"ونسوق المجرمين إلى جهنم وردا\" \"وإن منكم إلا واردها\" والله إن كان دعاء من مضى: اللهم أخرجني من النار سالما وأدخلني الجنة غانما وقال ابن جرير حدثني محمد بن عبيد المحاربي حدثنا أسباط عن عبدالملك عن عبيدالله عن مجاهد قال كنت عند ابن عباس فأتاه رجل يقال له أبو راشد وهو نافع بن الأزرق فقال له يا ابن عباس أرأيت قول الله \"وإن منكم إلا واردها كان على ربك حتما مقضيا\" قال أما أنا وأنت يا أبا راشد فسنردها فانظر هل نصدر عنها أم لا وقال أبو داود الطيالسي قال شعبة أخبرني عبدالله بن السائب عمن سمع ابن عباس يقرؤها \"وإن منهم إلا واردها\" يعني الكفار وهكذا روى عمرو بن الوليد البستي أنه سمع عكرمة يقرؤها كذلك \"وإن منهم إلا واردها\" قال وهم الظلمة كذلك كنا نقرؤها رواه ابن أبي حاتم وابن جرير وقال العوفي عن ابن عباس قوله \"وإن منكم إلا واردها\" يعني البر والفاجر ألا تسمع إلى قول الله لفرعون \"يقدم قومه يوم القيامة فأوردهم النار\" الآية \"ونسوق المجرمين إلى جهنم وردا\" فسمى الورود على النار دخولا وليس بصادر. وقال الإمام أحمد حدثنا عبدالرحمن عن إسرائيل عن السدي عن مرة عن عبدالله هو ابن مسعود \"وإن منكم إلا واردها\" قال رسول الله صلى الله عليه وسلم \" يرد الناس كلهم ثم يصدرون عنها بأعمالهم \" ورواه الترمذي عن عبد بن حميد عن عبيدالله عن إسرائيل عن السدي به ورواه من طريق شعبة عن السدي عن مرة عن ابن مسعود مرفوعا هكذا وقع هذا الحديث ههنا مرفوعا وقد رواه أسباط عن السدي عن مرة عن عبدالله بن مسعود قال: يرد الناس جميعا الصراط وورودهم قيامهم حول النار ثم يصدرون عن الصراط بأعمالهم فمنهم من يمر مثل البرق ومنهم من يمر مثل الريح ومنهم من يمر مثل الطير ومنهم من يمر كأجود الخيل ومنهم من يمر كأجود الإبل ومنهم من يمر كعدو الرجل حتى إن آخرهم مَرًا رجل نوره على موضع إبهامي قدميه يمر فيتكفأ به الصراط والصراط دحض مزلة عليه حسك كحسك القتاد حافتاه ملائكة معهم كلاليب من النار يختطفون بها الناس وذكر تمام الحديث رواه ابن أبي حاتم وقال ابن جرير حدثنا خلاد بن أسلم حدثنا النضر حدثنا إسرائيل أخبرنا أبو إسحاق عن أبي الأحوص عن عبدالله قوله \"وإن منكم إلا واردها\" قال الصراط على جهنم مثل حد السيف فتمر الطبقة الأولى كالبرق والثانية كالريح والثالثة كأجود الخيل والرابعة كأجود البهائم ثم يمرون والملائكة يقولون اللهم سلم سلم ولهذا شواهد في الصحيحين وغيرهما من رواية أنس وأبي سعيد وأبي هريرة وجابر وغيرهم من الصحابة رضي الله عنهم. وقال ابن جرير حدثني يعقوب حدثنا ابن علية عن الجريري عن أبي السليك عن غنيم بن قيس قال ذكروا ورود النار فقال كعب: تمسك النار الناس كأنها متن إهالة حتى يستوي عليها أقدام الخلائق برهم وفاجرهم ثم يناديها مناد أن أمسكي أصحابك ودعي أصحابي قال فتخسف بكل ولي لها هي أعلم بهم من الرجل بولده ويخرج المؤمنون ندية ثيابهم قال كعب ما بين منكبي الخازن من خزنتها مسيرة سنة مع كل واحد منهم عمود ذو شعبتين يدفع به الدفع فيصرع به في النار سبعمائة ألف وقال الإمام أحمد حدثنا أبو معاوية حدثنا الأعمش عن أبي سفيان عن جابر عن أم مبشر عن حفصة قالت قال رسول الله صلى الله عليه وسلم \" إني لأرجو أن لا يدخل النار إن شاء الله أحد شهد بدرا والحديبية \" قالت فقلت أليس الله يقول \"وإن منكم إلا واردها\" قالت: فسمعته يقول \"ثم ننجي الذين اتقوا ونذر الظالمين فيها جثيا\" وقال أحمد أيضا حدثنا ابن إدريس حدثنا الأعمش عن أبي سفيان عن جابر عن أم مبشر امرأة زيد بن حارثة قالت كان رسول الله صلى الله عليه وسلم في بيت حفصة فقال: \" لا يدخل النار أحد شهد بدرا والحديبية \" قالت حفصة أليس الله يقول \"وإن منكم إلا واردها\" فقال رسول الله صلى الله عليه وسلم \"ثم ننجي الذين اتقوا\" الآية وفي الصحيحين من حديث الزهري عن سعيد عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم \" لا يموت لأحد من المسلمين ثلاثة من الولد تمسه النار إلا تحلة القسم\". وقال عبدالرزاق قال معمر أخبرني الزهرى عن ابن المسيب عن أبي هريرة أن النبي صلى الله عليه وسلم قال: \" من مات له ثلاثة لم تمسه النار إلا تحلة القسم \" يعني الورود وقال أبو داود الطيالسي حدثنا زمعة عن الزهري عن سعيد بن المسيب عن أبي هريرة قال سمعت رسول الله صلى الله عليه وسلم يقول: \" لا يموت لمسلم ثلاثة من الولد فتمسه النار إلا تحلة القسم \" قال الزهري كأنه يريد هذه الآية \"وإن منكم إلا واردها كان على ربك حتما مقضيا\" وقال ابن جرير حدثني عمران بن بكار الكلاعي حدثنا أبو المغيرة حدثنا عبدالرحمن بن يزيد بن تميم حدثنا إسماعيل بن عبيدالله عن أبي صالح عن أبي هريرة قال خرج رسول الله صلى الله عليه وسلم يعود رجلا من أصحابه وعك وأنا معه ثم قال \" إن الله تعالى قول هي ناري أسلطها على عبدي المؤمن لتكون حظه من النار في الآخرة \" غريب ولم يخرجوه من هذا الوجه وحدثنا أبو كريب حدثنا أبو اليمان عن عثمان بن الأسود عن مجاهد قال الحمى حظ كل مؤمن من النار ثم قرأ \"وإن منكم إلا واردها\" وقال الإمام أحمد حدثنا حسن حدثنا ابن لهيعة حدثنا زبان بن فائد عن سهل بن معاذ ابن أنس الجهني عن أبيه عن رسول الله صلى الله عليه وسلم قال: \" من قرأ قل هو الله أحد حتى يختمها عشر مرات بنى الله له قصرا في الجنة \" فقال عمر إذا نستكثر يا رسول الله فقال رسول الله صلى الله عليه وسلم \" الله أكثر وأطيب \" وقال رسول الله صلى الله عليه وسلم \" من قرأ ألف آية في سبيل الله كتب يوم القيامة مع النبيين والصديقين والشهداء والصالحين وحسن أولئك رفيقا إن شاء الله ومن حرس من وراء المسلمين في سبيل الله متطوعا لا بأجر سلطان لم ير النار بعينيه إلا تحلة القسم \" قال الله تعالى: \"وإن منكم إلا واردها\" وإن الذكر في سبيل الله يضاعف فوق النفقة بسبعمائة ضعف وفي رواية بسبعمائة ألف ضعف وروى أبو داود عن أبي الطاهر عن ابن وهب وعن يحيى بن أيوب كلاهما عن زبان عن سهل عن أبيه عن رسول الله صلى الله عليه وسلم \"إن الصلاة علي والصيام والذكر يضاعف على النفقة في سبيل الله بسبعمائة ضعف \" وقال عبدالرزاق عن معمر عن قتادة قوله \"وإن منكم إلا واردها\" قال هو الممر عليها: وقال عبدالرحمن بن زيد بن أسلم في قوله \"وإن منكم إلا واردها\" قال ورود المسلمين المرور على الجسر بين ظهرانيها وورود المشركين أن يدخلوها وقال النبي صلى الله عليه وسلم \" الزالون والزالات يومئذ كثير وقد أحاط بالجسر يومئذ سماطان من الملائكة دعاؤهم يا الله سلم سلم \" وقال السدي عن مرة عن ابن مسعود في قوله \"كان على ربك حتما مقضيا\" قال قسما واجبا: وقال مجاهد حتما قال قضاء."
    },
    {
      "ayah": 72,
      "surah": 19,
      "text": "وكذا قال ابن جريج وقوله: \"ثم ننجي الذين اتقوا\" أي إذا مر الخلائق كلهم على النار وسقط فيها من سقط من الكفار والعصاة ذوي المعاصي بحسبهم نجى الله تعالى المؤمنين المتقين منها بحسب أعمالهم فجوازهم على الصراط وسرعتهم بقدر أعمالهم التي كانت في الدنيا ثم يشفعون في أصحاب الكبائر من المؤمنين فيشفع الملائكة والنبيون والمؤمنون فيخرجون خلقا كثيرا قد أكلتهم النار إلا دارات وجوههم وهي مواضع السجود وإخراجهم إياهم من النار بحسب ما في قلوبهم من الإيمان فيخرجون أولا من كان في قلبه مثقال دينار من إيمان ثم الذي يليه ثم الذي يليه ثم الذي يليه حتى يخرجون من كان في قلبه أدنى مثقال ذرة من إيمان ثم يخرج الله من النار من قال يوما من الدهر لا إله إلا الله وإن لم يعمل خيرا قط ولا يبقى في النار إلا من وجب عليه الخلود كما وردت بذلك الأحاديث الصحيحة عن رسول الله صلى الله عليه وسلم ولهذا قال تعالى \"ثم ننجي الذين اتقوا ونذر الظالمين فيها جثيا\"."
    },
    {
      "ayah": 73,
      "surah": 19,
      "text": "يخبر تعالى عن الكفار حين تتلى عليهم آيات الله ظاهرة الدلالة بينة الحجة واضحة البرهان أنهم يصدون ويعرضون عن ذلك ويقولون عن الذين آمنوا مفتخرين عليهم ومحتجين على صحة ما هم عليه من الدين الباطل بأنهما \"خير مقاما وأحسن نديا\" أي أحسن منازل وأرفع دورا وأحسن نديا وهو مجتمع الرجال للحديث أي ناديهم أعمر وأكثر واردا وطارقا يعنون فكيف نكون ونحن بهذه المثابة على باطل وأولئك الذين هم مختفون مستترون في دار الأرقم بن أبي الأرقم ونحوها من الدور على الحق كما قال تعالى مخبرا عنهم \"وقال الذين كفروا للذين آمنوا لو كان خيرا ما سبقونا إليه\" وقال قوم نوح \"أنؤمن لك واتبعك الأرذلون\" وقال تعالى \"وكذلك فتنا بعضهم ببعض ليقولوا أهؤلاء من الله عليهم من بيننا أليس الله بأعلم بالشاكرين\"."
    },
    {
      "ayah": 74,
      "surah": 19,
      "text": "ولهذا قال تعالى رادا عليهم شبهتهم \"وكم أهلكنا قبلهم من قرن\" أي وكم من أمة وقرن من المكذبين قد أهلكناهم بكفرهم \"هم أحسن أثاثا ورئيا\" أي كانوا أحسن من هؤلاء أموالا وأمتعة ومناظر وأشكالا قال الأعمش عن أبي ظبيان عن ابن عباس \"خير مقاما وأحسن نديا\" قال المقام المنزل والندي المجلس والأثاث المتاع والرئي المنظر وقال العوفي عن ابن عباس المقام المسكن والندي المجلس والنعمة والبهجة التي كانوا فيها وهو كما قال الله لقوم فرعون حين أهلكهم وقص شأنهم في القرآن \"كم تركوا من جنات وعيون وزروع ومقام كريم\" فالمقام المسكن والنعيم والندي المجلس والمجمع الذي كانوا يجتمعون فيه وقال تعالى فيما قص على رسوله من أمر قوم لوط \"وتأتون في ناديكم المنكر\" والعرب تسمي المجلس النادي وقال قتادة لما رأوا أصحاب محمد صلى الله عليه وسلم في عيشهم خشونة وفيهم قشافة فعرض أهل الشرك ما تسمعون \"أي الفريقين خير مقاما وأحسن نديا\" وكذا قال مجاهد والضحاك ومنهم من قال في الأثاث هو المال ومنهم من قال الثياب ومنهم من قال المتاع والرئي المنظر كما قاله ابن عباس ومجاهد وغير واحد وقال الحسن البصري يعني الصور وكذا قال مالك \"أثاثا ورئيا\" أكثر أموالا وأحسن صورا والكل متقارب صحيح."
    },
    {
      "ayah": 75,
      "surah": 19,
      "text": "يقول تعالى \"قل\" يا محمد لهؤلاء المشركين بربهم المدعين أنهم على الحق وأنكم على الباطل \"من كان في الضلالة\" أي منا ومنكم \"فليمدد له الرحمن مدا\" أي فأمهله الرحمن فيما هو فيه حتى يلقى ربه وينقضي أجله \"إما العذاب\" يصيبه \"وإما الساعة\" بغتة تأتيه \"فسيعلمون\" حينئذ \"من هو شر مكانا وأضعف جندا\" في مقابلة ما احتجوا به من خيرية المقام وحسن الندي قال مجاهد في قوله \"فليمدد له الرحمن مدا\" فليدعه الله في طغيانه هكذا قرر ذلك أبو جعفر بن جرير رحمه الله وهذه مباهلة للمشركين الذين يزعمون أنهم على هدى فيما هم فيه كما ذكر تعالى مباهلة اليهود في قوله \"يا أيها الذين هادوا إن زعمتم أنكم أولياء لله من دون الناس فتمنوا الموت إن كنتم صادقين\" أي ادعوا بالموت على المبطل منا أو منكم إن كنتم تدعون أنكم على الحق فإنه لا يضركم الدعاء فنكلوا عن ذلك وقد تقدم تقدير ذلك في سورة البقرة مبسوطا ولله الحمد وكما ذكر تعالى المباهلة مع النصارى في سورة آل عمران حين صمموا على الكفر واستمروا على الطغيان والغلو في دعواهم أن عيسى ولد الله وقد ذكر الله حججه وبراهينه على عبودية عيسى وأنه مخلوق كآدم قال تعالى بعد ذلك \"فمن حاجك فيه من بعد ما جاءك من العلم فقل تعالوا ندع أبناءنا وأبناءكم ونساءنا ونساءكم وأنفسنا وأنفسكم ثم نبتهل فنجعل لعنت الله على الكاذبين\" فنكلوا أيضا عن ذلك."
    },
    {
      "ayah": 76,
      "surah": 19,
      "text": "لما ذكر تعالى إمداد من هو في الضلالة فيما هو فيه وزيادته على ما هو عليه أخبر بزيادة المهتدين هدى كما قال تعالى \"وإذا ما أنزلت سورة فمنهم من يقول أيكم زادته هذه إيمانا\" الآيتين. وقوله: \"والباقيات الصالحات\" قد تقدم تفسيرها والكلام عليها وإيراد الأحاديث المتعلقة بها في سورة الكهف \"خير عند ربك ثوابا\" أي جزاء \"وخير مردا\" أي عاقبة ومردا على صاحبها وقال عبدالرزاق أخبرنا معمر بن راشد عن يحيى بن أبي كثير عن أبي سلمة بن عبدالرحمن قال جلس رسول الله صلى الله عليه وسلم ذات يوم فأخذ عودا يابسا فحط ورقه ثم قال: \" إن قول لا إله إلا الله والله أكبر وسبحان الله والحمد لله تحط الخطايا كما تحط ورق هذه الشجرة الريح خذهن يا أبا الدرداء قبل أن يحال بينك وبينهن هن الباقيات الصالحات وهن من كنوز الجنة \" قال أبو سلمة فكان أبو الدرداء إذا ذكر هذا الحديث قال لأهللن الله ولأكبرن الله ولأسبحن الله حتى إذا رآني الجاهل حسب أني مجنون وهذا ظاهره أنه مرسل ولكن قد يكون من رواية أبي سلمة عن أبي الدرداء والله أعلم وهكذا وقع في سنن ابن ماجه من حديث أبي معاوية عن عمر بن راشد عن يحيى عن أبي سلمة عن أبي الدرداء فذكر نحوه."
    },
    {
      "ayah": 77,
      "surah": 19,
      "text": "وقال الإمام أحمد حدثنا أبو معاوية حدثنا الأعمش عن مسلم عن مسروق عن خباب بن الأرت قال كنت رجلا قينا وكان لي على العاص بن وائل دين فأتيته أتقاضاه منه فقال لا والله لا أقضيك حتى تكفر بمحمد فقلت لا والله لا أكفر بمحمد صلى الله عليه وسلم حتى تموت ثم تبعث قال فإنى إذا مت ثم بعثت جئتني ولي ثَمَّ مال وولد فأعطيتك فأنزل الله \"أفرأيت الذي كفر بآياتنا وقال لأوتين مالا وولدا - إلى قوله - ويأتينا فردا\" أخرجه صاحبا الصحيح وغيرهما من غير وجه عن الأعمش به وفي لفظ البخاري كنت قينا بمكة فعملت للعاص بن وائل سيفا فجئت أتقاضاه فذكر الحديث وقال \"أم اتخذ عند الرحمن عهدا\" قال موثقا. وقال عبدالرزاق أخبرنا الثوري عن الأعمش عن أبي الضحى عن مسروق قال: قال خباب بن الأرت كنت قينا بمكة فكنت أعمل للعاص بن وائل فاجتمعت لي عليه دراهم فجئت لأتقاضاه فقال لي لا أقضيك حتى تكفر بمحمد فقلت لا أكفر بمحمد حتى تموت ثم تبعث قال فإدا بعثت كان لي مال وولد قال فذكرت ذلك لرسول الله صلى الله عليه وسلم فأنزل الله \"أفرأيت الذي كفر بآياتنا\" الآيات وقال العوفي عن ابن عباس إن رجالا من أصحاب رسول الله صلى الله عليه وسلم كانوا يطلبون العاص بن وائل السهمي بدين فأتوه يتقاضونه فقال ألستم تزعمون أن في الجنة ذهبا وفضة وحريرا ومن كل الثمرات؟ قالوا بلى قال فإن موعدكم الآخرة فوالله لأوتين مالا وولدا ولأوتين مثل كتابكم الذي جئتم به فضرب الله مثله في القرآن فقال \"أفرأيت الذى كفر بآياتنا - إلى قوله - ويأتينا فردا\" وهكذا قال مجاهد وقتادة وغيرهم إنها نزلت في العاص بن وائل وقوله \"لأوتين مالا وولدا\" قرأ بعضهم بفتح الواو من ولدا وقرأ آخرون بضمها وهو بمعناه قال رؤبة: الحمد لله العزيز فردا لم يتخذ من ولد شيء ولدا وقال الحارث بن حلزة: ولقد رأيت معاشرا قد ثمروا مالا وولدا وقال الشاعر: فليت فلانا كان في بطن أمه وليت فلانا كان ولد حمار وقيل إن الولد بالضم جمع والولد بالفتح مفرد وهي لغة قيس والله أعلم."
    },
    {
      "ayah": 78,
      "surah": 19,
      "text": "وقوله \"أطلع الغيب\" إنكار على هذا القائل \"لأوتين مالا وولدا يعني يوم القيامة أي أعلم ما له في الآخرة حتى تألى وحلف على ذلك \"أم اتخذ عند الرحمن عهدا\" أم له عند الله عهد سيؤتيه ذلك؟ وقد تقدم عند البخاري أنه الموثق وقال الضحاك عن ابن عباس \"أطلع الغيب أم اتخذ عند الرحمن عهدا\" قال لا إله إلا الله فيرجو بها وقال محمد بن كعب القرظي \"إلا من اتخذ عند الرحمن عهدا\" قال شهادة أن لا إله إلا الله ثم قرأ \"إلا من اتخذ عند الرحمن عهدا\"."
    },
    {
      "ayah": 79,
      "surah": 19,
      "text": "وقوله \"كلا\" هي حرف ردع لما قبلها وتأكيد لما بعدها \"سنكتب ما يقول\" أي من طلبه ذلك وحكمه لنفسه بما يتمناه وكفره بالله العظيم \"ونمد له من العذاب مدا\" أي في الدار الآخرة على قوله ذلك وكفره بالله في الدنيا."
    },
    {
      "ayah": 8,
      "surah": 19,
      "text": "هذا تعجب من زكريا عليه السلام حين أجيب إلى ما سأل وبشر بالولد ففرح فرحا شديدا وسأل عن كيفية ما يولد له والوجه الذي يأتيه منه الولد مع أن امرأته كانت عاقرا لم تلد من أول عمرها مع كبرها ومع أنه قد كبر وعتا أي عسا عظمه ونحل ولم يبق فيه لقاح ولا جماع والعرب تقول للعود إذا يبس عتيا يعتو عتيا وعتوا وعسا يعسو عسوا وعسيا وقال مجاهد: عتيا يعني قحول العظم وقال ابن عباس وغيره: عتيا يعني الكبر والظاهر أنه أخص من الكبر وقال ابن جرير: حدثنا يعقوب حدثنا هشيم أخبرنا حصين عن عكرمة عن ابن عباس قال لقد علمت السنة كلها غير أني لا أدري أكان رسول الله صلى الله عليه وسلم يقرأ في الظهر والعصر أم لا؟ ولا أدري كيف كان يقرأ هذا الحرف \"وقد بلغت من الكبر عتيا\" أو عسيا."
    },
    {
      "ayah": 80,
      "surah": 19,
      "text": "\"ونرثه ما يقول\" أي من مال وولد نسلبه منه عكس ما قال إنه يؤتى في الدار الآخرة مالا وولدا زيادة على الذي له في الدنيا بل في الآخرة يسلب من الذي كان له في الدنيا ولهذا قال تعالى \"ويأتينا فردا\" أي من المال والولد قال علي بن أبي طلحة عن ابن عباس \"ونرثه ما يقول\" قال نرثه وقال مجاهد \"ونرثه ما يقول\" ماله وولده وذلك الذي قال العاص بن وائل. وقال عبدالرازق عن معمر عن قتادة \"ونرثه ما يقول\" قال ما عنده وهو قوله \"لأوتين مالا وولدا\" وفي حرف ابن مسعود ونرثه ما عنده وقال قتادة \"ويأتينا فردا\" لا مال له ولا ولد وقال عبدالرحمن بن زيد بن أسلم \"ونرثه ما يقول\" قال ما جمع من الدنيا وما عمل فيها قال \"ويأتينا فردا\" قال فردا من ذلك لا يتبعه قليل ولا كثير."
    },
    {
      "ayah": 81,
      "surah": 19,
      "text": "يخبر تعالى عن الكفار المشركين بربهم أنهم اتخذوا من دونه آلهة لتكون تلك الآلهة \"عزا\" يعتزون بها ويستنصرونها ثم أخبر أنه ليس الأمر كما زعموا ولا يكون ما طمعوا."
    },
    {
      "ayah": 82,
      "surah": 19,
      "text": "قال \"كلا سيكفرون بعبادتهم\" أي يوم القيامة \"ويكونون عليهم ضدا\" أي بخلاف ما ظنوا فيهم كما قال تعالى \"ومن أضل ممن يدعوا من دون الله من لا يستجيب له إلى يوم القيامة وهم عن دعائهم غافلون وإذا حشر الناس كانوا لهم أعداء وكانوا بعبادتهم كافرين\" وقرأ أبو نهيك \"كل سيكفرون بعبادتهم\" وقال السدي \"كلا سيكفرون بعبادتهم\" أي بعبادة الأوثان وقوله \"ويكونون عليهم ضدا\" أي بخلاف ما رجوا منهم وقال علي بن أبي طلحة عن ابن عباس \"ويكونون عليهم ضدا\" قال أعوانا قال مجاهد عونا عليهم تخاصمهم وتكذبهم وقال العوفي عن ابن عباس \"ويكونون عليهم ضدا\" قال قرناء وقال قتادة قرناء في النار يلعن بعضهم بعضا ويكفر بعضهم ببعض وقال السدي \"ويكونون عليهم ضدا\" قال الخصماء الأشداء في الخصومة وقال الضحاك \"ويكونون عليهم ضدا\" قال أعداء وقال ابن زيد: الضد البلاء وقال عكرمة: الضد الحسرة."
    },
    {
      "ayah": 83,
      "surah": 19,
      "text": "وقوله: \"ألم تر أنا أرسلنا الشياطين على الكافرين تؤزهم أزا\" قال علي بن أبي طلحة عن ابن عباس تغويهم إغواء وقال العوفي عنه تحرضهم على محمد وأصحابه وقال مجاهد تشليهم إشلاء وقال قتادة تزعجهم إزعاجا إلى معاصي الله وقال سفيان الثوري تغريهم إغراء وتستعجلهم استعجالا وقال السدي تطغيهم طغيانا وقال عبدالرحمن بن زيد هذا كقوله تعالى \"ومن يعش عن ذكر الرحمن نقيض له شيطانا فهو له قرين\"."
    },
    {
      "ayah": 84,
      "surah": 19,
      "text": "وقوله \"فلا تعجل عليهم إنما نعد لهم عدا\" أي لا تعجل يا محمد على هؤلاء في وقوع العذاب بهم \"إنما نعد لهم عدا\" أي إنما نؤخرهم لأجل معدود مضبوط وهم صائرون لا محالة إلى عذاب الله ونكاله وقال \"ولا تحسبن الله غافلا عما يعمل الظالمون\" الآية \"فمهل الكافرين أمهلهم رويدا\" \"إنما نملي لهم ليزدادوا إثما\" \"نمتعهم قليلا ثم نضطرهم إلى عذاب غليظ\" \"قل تمتعوا فإن مصيركم إلى النار\" وقال السدي إنما نعد لهم عدا: السنين والشهور والأيام والساعات وقال علي بن أبي طلحة عن ابن عباس \"إنما نعد لهم عدا\" قال نعد أنفاسهم في الدنيا."
    },
    {
      "ayah": 85,
      "surah": 19,
      "text": "يخبر تعالى عن أوليائه المتقين الذين خافوه في الدار الدنيا واتبعوا رسله وصدقوهم فيما أخبروهم وأطاعوهم فيما أمروهم به وانتهوا عما عنه زجروهم أنه يحشرهم يوم القيامة وفدا إليه والوفد هم القادمون ركبانا ومنه الوفود وركوبهم على نجائب من نور من مراكب الدار الآخرة وهم قادمون على خير موفود إليه إلى دار كرامته ورضوانه وأما المجرمون المكذبون للرسل المخالفون لهم فإنهم يساقون عنفا إلى النار \"وردا\" عطاشا قاله عطاء وابن عباس ومجاهد والحسن وقتادة وغير واحد وههنا يقال \"أي الفريقين خير مقاما وأحسن نديا\" وقال ابن أبي حاتم حدثنا أبو سعيد الأشج حدثنا ابن خالد عن عمرو بن قيس الملائي عن ابن مرزوق \"يوم نحشر المتقين إلى الرحمن وفدا\" قال يستقبل المؤمن عند خروجه من قبره أحسن صورة رآها وأطيبها ريحا فيقول من أنت فيقول أما تعرفني؟ فيقول لا إلا أن الله قد طيب ريحك وحسن وجهك. فيقول أنا عملك الصالح وهكذا كنت في الدنيا حسن العمل طيبه فطالما ركبتك في الدنيا فهلم اركبني فيركبه فذلك قوله \"يوم نحشر المتقين إلى الرحمن وفدا\" وقال علي بن أبي طلحة عن ابن عباس \"يوم نحشر المتقين إلى الرحمن وفدا\" قال ركبانا وقال ابن جرير حدثني ابن المثنى حدثنا ابن مهدي عن سعيد عن إسماعيل عن رجل عن أبي هريرة \"يوم نحشر المتقين إلى الرحمن وفدا\" قال على الإبل وقال ابن جريج على النجائب وقال الثوري على الإبل النوق وقال قتادة \"يوم نحشر المتقين إلى الرحمن وفدا\" قال إلى الجنة وقال عبدالله بن الإمام أحمد في مسند أبيه حدثنا سويد بن سعيد أخبرنا علي بن مسهر عن عبدالرحمن بن إسحاق حدثنا النعمان بن سعيد قال كنا جلوسا عند علي رضي الله عنه فقرأ هذه الآية \"يوم نحشر المتقين إلى الرحمن وفدا\" قال لا والله ما على أرجلهم يحشرون ولا يحشر الوفد على أرجلهم ولكن بنوق لم ير الخلائق مثلها عليها رحائل من ذهب فيركبون عليها حتى يضربوا أبواب الجنة وهكذا رواه ابن أبي حاتم وابن جرير من حديث عبدالرحمن بن إسحاق المدني به وزاد عليها رحائل الذهب وأزمتها الزبرجد والباقي مثله وروى ابن أبي حاتم ههنا حديثا غريبا جدا مرفوعا عن علي فقال حدثنا أبي حدثنا أبو غسان مالك بن إسماعيل النهدي حدثنا مسلمة بن جعفر البجلي سمعت أبا معاذ البصري قال إن عليا كان ذات يوم عند رسول الله صلى الله عليه وسلم فقرأ هذه الآية \"يوم نحشر المتقين إلى الرحمن وفدا\" فقال ما أظن الوفد إلا الركب يا رسول الله؟ فقال النبي صلى الله عليه وسلم \" والذي نفسي بيده إنهم إذا خرجوا من قبورهم يستقبلون أو يؤتون بنوق بيض لها أجنحة وعليها رحال الذهب شرك نعالهم نور يتلألأ كل خطوة منها مد البصر فينتهون إلى شجرة ينبع من أصلها عينان فيشربون من إحداهما فتغسل ما في بطونهم من دنس ويغتسلون من الأخرى فلا تشعث أبشارهم ولا أشعارهم بعدها أبدا وتجري عليهم نضرة النعيم فينتهون أو فيأتون باب الجنة فإذا حلقة من ياقوتة حمراء على صفائح الذهب فيضربون بالحلقة على الصفحة فيسمع لها طنين - يا علي - فيبلغ كل حوراء أن زوجها قد أقبل فتبعث قيمها فيفتح له فإذا رآه خر له - قال مسلمة أراه قال ساجدا - فيقول ارفع رأسك فإنما أنا قيمك وكلت بأمرك فيتبعه ويقفو أثره فتستخف الحوراء العجلة فتخرج من خيام الدر والياقوت حتى تعتنقه ثم تقول أنت حبي وأنا حبك وأنا الخالدة التي لا أموت وأنا الناعمة التي لا أبأس وأنا الراضية التي لا أسخط وأنا المقيمة التي لا أظعن فيدخل بيتا من أسه إلى سقفه مائة ألف ذراع بناؤه على جندل اللؤلؤ طرائق أحمر وأصفر وأخضر ليس منها طريقة تشاكل صاحبتها وفي البيت سبعون سريرا على كل سرير سبعون حشية على كل حشية سبعون زوجة على كل زوجة سبعون حلة يرى مخ ساقها من وراء الحلل يقضي جماعها في مقدار ليلة من لياليكم هذه الأنهار من تحتهم تطرد أنهار من ماء غير آسن قال صاف لا كدر فيه وأنهار من لبن لم يتغير طعمه ولم يخرج من ضروع الماشية وأنهار من خمر لذة للشاربين لم يعتصرها الرجال بأقدامهم وأنهار من عسل مصفى لم يخرج من بطون النحل فيستجلي الثمار فإن شاء أكل قائما وإن شاء قاعدا وإن شاء متكئا ثم تلا \"ودانية عليهم ظلالها وذللت قطوفها تذليلا\" فيشتهي الطعام فيأتيه طير أبيض وربما قال أخضر فترفع أجنحتها فأكل من جنوبها أي الألوان شاء ثم تطير فتذهب فيدخل الملك فيقول سلام عليكم \"تلك الجنة التي أورثتموها بما كنتم تعملون\" ولو أن شعرة من شعر الحوراء وقعت لأهل الأرض لأضاءت الشمس معها سواد في نور \" هكذا وقع في هذه الرواية مرفوعا وقد رويناه في المقدمات من كلام علي رضي الله عنه بنحوه وهو أشبه بالصحة والله أعلم."
    },
    { "ayah": 86, "surah": 19, "text": "وقوله \"ونسوق المجرمين إلى جهنم وردا\" أي عطاشا." },
    {
      "ayah": 87,
      "surah": 19,
      "text": "\"لا يملكون الشفاعة\" أي ليس لهم من يشفع لهم كما يشفع المؤمنون بعضهم لبعض كما قال تعالى مخبرا عنهم \"فمالنا من شافعين ولا صديق حميم\" وقوله \"إلا من اتخذ عند الرحمن عهدا\" هذا استثناء منقطع بمعنى لكن من اتخذ عند الرحمن عهدا وهو شهادة أن لا إله إلا الله والقيام بحقها قال علي بن أبى طلحة عن ابن عباس \"إلا من اتخذ عند الرحمن عهدا\" قال العهد شهادة أن لا إله إلا الله ويبرأ إلى الله من الحول والقوة ولا يرجو إلا الله عز وجل وقال ابن أبي حاتم حدثنا عثمان بن خالد الواسطي حدثنا محمد بن الحسن الواسطي عن المسعودي عن عون بن عبدالله عن أبي فاختة عن الأسود بن يزيد قال قرأ عبدالله يعني ابن مسعود هذه الآية \"إلا من اتخذ عند الرحمن عهدا\" ثم قال اتخذوا عند الله عهدا فإن الله يقول يوم القيامة من كان له عند الله عهد فليقم قالوا يا أبا عبدالرحمن فعلمنا قال قولوا: اللهم فاطر السموات والأرض عالم الغيب والشهادة فإني أعهد إليك في هذه الحياة الدنيا أن لا تكلني إلى عمل يقربني من الشر ويباعدني من الخير وإني لا أثق إلا برحمتك فاجعل لي عندك عهدا تؤديه إلي يوم القيامة إنك لا تخلف الميعاد قال المسعودي فحدثني زكريا عن القاسم بن عبدالرحمن أخبرنا ابن مسعود وكان يلحق بهن خائفا مستجيرا مستغفرا راهبا راغبا إليك ثم رواه من وجه آخر عن المسعودي بنحوه."
    },
    {
      "ayah": 88,
      "surah": 19,
      "text": "لما قرر تعالى في هذه السورة الشريفة عبودية عيسى عليه السلام وذكر خلقه من مريم بلا أب شرع في مقام الإنكار على من زعم أن له ولدا تعالى وتقدس وتنزه عن ذلك علوا كبيرا فقال \"وقالوا اتخذ الرحمن ولدا."
    },
    {
      "ayah": 89,
      "surah": 19,
      "text": "لقد جئتم\" أي في قولكم هذا \"شيئا إدا\" قال ابن عباس ومجاهد وقتادة ومالك أي عظيما ويقال إدا بكسر الهمزة وفتحها ومع مدها أيضا ثلاث لغات أشهرها الأولى."
    },
    {
      "ayah": 9,
      "surah": 19,
      "text": "ورواه الإمام أحمد عن شريح بن النعمان وأبو داود عن زياد بن أيوب كلاهما عن هشيم به \"قال\" أي الملك مجيبا لزكريا عما استعجب منه \"كذلك قال ربك هو علي هين\" أي إيجاد الولد منك ومن زوجتك هذه لا من غيرها \"هين\" أي يسير سهل على الله ثم ذكر له ما هو أعجب مما سأل عنه فقال \"وقد خلقتك من قبل ولم تك شيئا\" كما قال تعالى \"هل أتى على الإنسان حين من الدهر لم يكن شيئا مذكورا\"."
    },
    {
      "ayah": 90,
      "surah": 19,
      "text": "وقوله \"تكاد السموات يتفطرن منه وتنشق الأرض وتخر الجبال هدا\" أي يكاد يكون ذلك عند سماعهن هذه المقالة من فجرة بني آدم إعظاما للرب وإجلالا لأنهن مخلوقات ومؤسسات على توحيده وأنه لا إله إلا هو وأنه لا شريك له ولا نظير له ولا ولد له ولا صاحبة له ولا كفء له بل هو الأحد الصمد. وفي كل شيء له آية تدل على أنه الواحد. قال ابن جرير: حدثني علي حدثنا عبدالله حدثني معاوية عن علي عن ابن عباس في قوله \"تكاد السموات يتفطرن منه وتنشق الأرض وتخر الجبال هدا أن دعوا للرحمن ولدا\" قال إن الشرك فزعت منه السموات والأرض والجبال وجميع الخلائق إلا الثقلين وكادت أن تزول منه لعظمة الله وكما لا ينفع مع الشرك إحسان المشرك كذلك نرجو أن يغفر الله ذنوب الموحدين وقال رسول الله صلى الله عليه وسلم \"لقنوا موتاكم شهادة أن لا إله إلا الله فمن قالها عند موته وجبت له الجنة\" فقالوا يا رسول الله فمن قالها في صحته؟ قال \"تلك أوجب وأوجب\" ثم قال: \"والذي نفسي بيده لو جيء بالسموات والأرضين وما فيهن وما بينهن وما تحتهن فوضعن في كفة الميزان ووضعت شهادة أن لا إله إلا الله في الكفة الأخرى لرجحت بهن\" هكذا رواه ابن جرير ويشهد له حديث البطاقة والله أعلم وقال الضحاك \"تكاد السموات يتفطرن منه\" أي يتشققن فرقا من عظمة الله وقال عبدالرحمن بن زيد بن أسلم وتنشق الأرض أي غضبا له عز وجل وتخر الجبال هدا قال ابن عباس هدما وقال سعيد بن جبير هدا ينكسر بعضها على بعض متتابعات وقال ابن أبي حاتم حدثنا محمد بن عبدالله بن سويد المقبري حدثنا سفيان بن عيينة حدثنا مسعر عن عون بن عبدالله قال: إن الجبل لينادي الجبل باسمه يا فلان هل مر بك اليوم ذكر الله عز وجل؟ فيقول نعم ويستبشر قال عون لهي للخير أسمع أفيسمعن الزور والباطل إذا قيل ولا يسمعن غيره ثم قرأ \"تكاد السموات يتفطرن منه وتنشق الأرض وتخر الجبال هدا."
    },
    {
      "ayah": 91,
      "surah": 19,
      "text": "أن دعوا للرحمن ولدا\" وقال ابن أبي حاتم أيضا حدثنا المنذر بن شاذان حدثنا هوذة حدثنا عوف عن غالب بن عجرد حدثني رجل من أصل الشام في مسجد منى قال بلغني أن الله لما خلق الأرض وخلق ما فيها من الشجر لم يكن في الأرض شجرة يأتيهـا بنو آدم إلا أصابوا منها منفعة - أو قال - كان لهم فيها منفعة ولم تزل الأرض والشجر بذلك حتى تكلم فجرة بني آدم بتلك الكلمة العظيمة قولهم اتخذ الرحمن ولدا فلما تكلموا بها اقشعرت الأرض وشاك الشجر. وقال كعب الأحبار غضبت الملائكة واستعرت جهنم حين قالوا ما قالوا وقال الإمام أحمد حدثنا أبو معاوية عن الأعمش عن سعيد بن جبير عن أبي عبدالرحمن السلمي عن أبي موسى رضي الله عنه قال قال رسول الله صلى الله عليه وسلم \" لا أحد أصبر على أذى سمعه من الله أن يشرك به ويجعل له ولد وهو يعافيهم ويدفع عنهم ويرزقهم \" أخرجاه في الصحيحين وفي لفظ \" أنهم يجعلون له ولدا وهو يرزقهم ويعافيهم \"."
    },
    {
      "ayah": 92,
      "surah": 19,
      "text": "وقوله \"وما ينبغي للرحمن أن يتخذ ولدا\" أي لا يصلح له ولا يليق به لجلاله وعظمته لأنه لا كفء له من خلقه لأن جميع الخلائق عبيد له."
    },
    { "ayah": 93, "surah": 19, "text": "لا يوجد تفسير لهذه الأية" },
    {
      "ayah": 94,
      "surah": 19,
      "text": "\" لقد أحصاهم وعدهم عدا\" أي قد علم عددهم منذ خلقهم إلى يوم القيامة ذكرهم وأنثاهم وصغيرهم وكبيرهم."
    },
    {
      "ayah": 95,
      "surah": 19,
      "text": "\"وكلهم آتيه يوم القيامة فردا\" أي لا ناصر له ولا مجير إلا الله وحده لا شريك له فيحكم في خلقه بما يشاء وهو العادل الذي لا يظلم مثقال ذرة ولا يظلم أحدا."
    },
    {
      "ayah": 96,
      "surah": 19,
      "text": "يخبر تعالى أنه يغرس لعباده المؤمنين الذين يعملون الصالحات وهي الأعمال التي ترضي الله عز وجل لمتابعتها الشريعة المحمدية - يغرس لهم في قلوب عباده الصالحين محبة ومودة وهذا أمر لا بد منه ولا محيد عنه وقد وردت بذلك الأحاديث الصحيحة عن رسول الله صلى الله عليه وسلم من غير وجه قال الإمام أحمد: حدثنا عفان حدثنا أبو عوانة حدثنا سهيل عن أبيه عن أبي هريرة عن النبي صلى الله عليه وسلم قال: \" إن الله إذا أحب عبدا دعا جبريل فقال يا جبريل إني أحب فلانا فأحبه قال فيحبه جبريل قال ثم ينادي في أهل السماء إن الله يحب فلانا فأحبوه قال فيحبه أهل السماء ثم يوضع له القبول في الأرض وإن الله إذا أبغض عبدا دعا جبريل فقال يا جبريل إني أبغض فلانا فأبغضه قال فيبغضه جبريل ثم ينادي في أهل السماء إن الله يبغض فلانا فأبغضوه قال فيبغضه أهل السماء ثم يوضع له البغضاء في الأرض \" ورواه مسلم من حديث سهيل ورواه أحمد والبخاري من حديث ابن جريج عن موسى بن عتبة عن نافع مولى ابن عمر عن أبي هريرة رضي الله عنه عن النبي صلى الله عليه وسلم نحوه وقال الإمام أحمد: حدثنا محمد بن بكر حدثنا ميمون أبو محمد المرائي حدثنا محمد بن عباد المخزومي عن ثوبان رضي الله عنه عن النبي صلى الله عليه وسلم قال: \" إن العبد ليلتمس مرضات الله عز وجل فلا يزال كذلك فيقول الله عز وجل لجبريل إن فلانا عبدي يلتمس أن يرضيني ألا وإن رحمتي عليه فيقول جبريل: رحمة الله على فلان ويقولها حملة العرش ويقولها من حولهم حتى يقولها أهل السموات السبع ثم يهبط إلى الأرض \" غريب ولم يخرجوه من هذا الوجه وقال الإمام أحمد حدثنا أسود بن عامر حدثنا شريك عن محمد بن سعد الواسطي عن أبي ظبية عن أبي أمامة قال: قال رسول الله صلى الله عليه وسلم \" إن المقة من الله - قال شريك هي المحبة - والصيت من السماء فإذا أحب الله عبدا قال لجبريل عليه السلام إني أحب فلانا فينادي جبريل إن ربكم يمق - يعني يحب - فلانا فأحبوه - أرى شريكا قد قال فتنزل له المحبة في الأرض - وإذا أبغض عبدا قال لجبريل إني أبغض فلانا فأبغضه قال فينادي جبريل إن ربكم يبغض فلانا فأبغضوه - أرى شريكا قال - فيجري له البغض في الأرض \" غريب ولم يخرجوه. وقال ابن أبي حاتم حدثنا أبي حدثنا أبو داود الحفري حدثنا عبدالعزيز- يعني ابن محمد - وهو الدراوردي عن سهيل بن أبي صالح عن أبيه عن أبي هريرة رضي الله عنه أن النبي صلى الله عليه وسلم قال: \" إذا أحب الله عبدا نادى جبريل إني قد أحببت فلانا فأحبه فينادي في السماء ثم ينزل له المحبة في أهل الأرض فذلك قول الله عز وجل \"إن الذين آمنوا وعملوا الصالحات سيجعل لهم الرحمن ودا\" \"ورواه مسلم والترمذى كلاهما عن عبدالله عن قتيبة عن الدراوردي به وقال الترمذي حسن صحيح وقال علي بن أبي طلحة عن ابن عباس في قوله \"سيجعل لهم الرحمن ودا\" قال حبا وقال مجاهد عنه\" سيجعل لهم الرحمن ودا\" قال محبة في الناس في الدنيا وقال سعيد بن جبير عنه يحبهم ويحببهم يعني إلى خلقه المؤمنين كما قال مجاهد أيضا والضحاك وغيرهم وقال العوفي عن ابن عباس أيضا: الود من المسلمين في الدنيا والرزق الحسن واللسان الصادق وقال قتادة \"إن الذين آمنوا وعملوا الصالحات سيجعل لهم الرحمن ودا\" أي والله في قلوب أهل الإيمان وذكر لنا أن هرم بن حيان كان يقول ما أقبل عبد بقلبه إلى الله إلا أقبل الله بقلوب المؤمنين إليه حتى يرزقه مودتهم ورحمتهم وقال قتادة وكان عثمان بن عفان رضي الله عنه يقول ما من عبد يعمل خيرا أو شرا إلا كساه الله عز وجل رداء عمله وقال ابن أبي حاتم رحمه الله حدثنا أحمد بن سنان حدثنا عبدالرحمن بن مهدي عن الربيع بن صبيح عن الحسن البصري رحمه الله قال: قال رجل والله لأعبدن الله عبادة أذكر بها فكان لا يرى في حين صلاة إلا قائما يصلي وكان أول داخل إلى المسجد وآخر خارج فكان لا يعظم فمكث بذلك سبعة أشهر وكان لا يمر على قوم إلا قالوا انظروا إلى هذا المرائي فأقبل على نفسه فقال لا أراني أذكر إلا بشر لأجعلن عملي كله لله عز وجل فلم يزد على أن قلب نيته ولم يزد على العمل الذي كان يعمله فكان يمر بعد بالقوم فيقولون رحم الله فلانا الآن وتلا الحسن \"إن الذين آمنوا وعملوا الصالحات سيجعل لهم الرحمن ودا\" وقد روى ابن جرير أثرا أن هذه الآية نزلت في هجرة عبد الرحمن بن عوف وهو خطأ فإن هذه السورة بكمالها مكية لم ينزل منها شيء بعد الهجرة ولم يصح سند ذلك والله أعلم."
    },
    {
      "ayah": 97,
      "surah": 19,
      "text": "وقوله \"فإنما يسرناه\" يعني القرآن \"بلسانك\" أي يا محمد وهو اللسان العربي المبين الفصيح الكامل \"لتبشر به المتقين\" أي المستجيبين لله المصدقين لرسوله \"وتنذر به قوما لدا\" أي عوجا عن الحق مائلين إلى الباطل وقال ابن أبي نجيح عن مجاهد قوما لدا لا يستقيمون وقال الثوري عن إسماعيل وهو السدي عن أبي صالح \"وتنذر به قوما لدا\" عوجا عن الحق وقال الضحاك الألد الخصم وقال القرظي الألد الكذاب وقال الحسن البصري \"قوما لدا\" صما وقال غيره صم آذان القلوب وقال قتادة قوما لدا يعني قريشا وقال العوفي عن ابن عباس \"قوما لدا\" فجارا وكذا روى ليث بن أبي سليم عن مجاهد: وقال ابن زيد الألد الظلوم وقرأ قوله تعالى \"وهو ألد الخصام\"."
    },
    {
      "ayah": 98,
      "surah": 19,
      "text": "وقوله \"وكم أهلكنا قبلهم من قرن\" أي من أمة كفروا بآيات الله وكذبوا رسله \"هل تحس منهم من أحد أو تسمع لهم ركزا\" أي هل ترى منهم أحدا أو تسمع لهم ركزا قال ابن عباس وأبو العالية وعكرمة والحسن البصري وسعيد بن جبير والضحاك وابن زيد يعني صوتا وقال الحسن وقتادة هل ترى عينا أو تسمع صوتا والركز في أصل اللغة هوالصوت الخفي قال الشاعر: فتوحشت ركز الأنيس فراعها عـن ظهر غيب والأنيس سقامها آخر تفسير سورة مريم ولله الحمد والمنة ويتلوه إن شاء الله تفسير سورة طه ولله الحمد."
    }
  ]
}
