{
  "ayahs": [
    {
      "ayah": 1,
      "surah": 20,
      "text": "سورة طه: روى إمام الأئمة محمد بن إسحاق بن خزيمة في كتاب التوحيد عن زياد بن أيوب عن إبراهيم بن المنذر الحزامي حدثنا إبراهيم بن مهاجر بن مسمار عن عمر بن حفص بن ذكوان عن مولى الحرقة - يعني عبد الرحمن بن يعقوب - عن أبي هريرة قال: قال رسول الله صلى الله عليه وسلم \" إن الله قرأ طه ويس قبل أن يخلق آدم بألف عام فلما سمعت الملائكة قالوا طوبى لأمة ينزل عليهم هذا وطوبى لأجواف تحمل هذا وطوبي لألسن تتكلم بهذا \" هذا حديث غريب وفيه نكارة وإبراهيم بن مهاجر وشيخه تكلم فيهما. قد تقدم الكلام على الحروف المقطعة في أول سورة البقرة بما أغنى عن إعادته وقال ابن أبي حاتم حدثنا الحسين بن محمد بن شيبة الواسطي حدثنا أبو أحمد - يعني الزبيري -أنبأنا إسرائيل عن سالم الأفطس عن سعيد ابن جبير عن ابن عباس قال: طه يا رجل وهكذا روى عن مجاهد وعكرمة وسعيد بن جبير وعطاء محمد بن كعب وأبي مالك وعطية العوفي والحسن وقتادة والضحاك والسدي وابن أبزى أنهم قالوا: طه بمعنى يا رجل وفي رواية عن ابن عباس وسعيد بن جبير والثوري أنها كلمة بالنبطية معناها يا رجل وقال أبو صالح هي معربة وأسند القاضي عياض في كتابه الشفاء من طريق عبد بن حميد في تفسيره حدثنا هاشم بن القاسم عن ابن جعفر عن الربيع بن أنس قال: كان النبي صلى الله عليه وسلم إذا صلى قام على رجل ورفع الأخرى فأنزل الله تعالى \"طه\" يعني طأ الأرض يا محمد \"ما أنزلنا عليك القرآن لتشقى\" ثم قال ولا يخفى ما في هذا من الإكرام وحسن المعاملة."
    },
    {
      "ayah": 10,
      "surah": 20,
      "text": "من ههنا شرع تبارك وتعالى في ذكر قصة موسى وكيف كان ابتداء الوحي إليه وتكليمه إياه وذلك بعد ما قضى موسى الأجل الذي كان بينه وبين صهره في رعاية الغنم وسار بأهله قيل قاصدا بلاد مصر بعدما طالت الغيبة عنها أكثر من عشر سنين ومعه زوجته فأضل الطريق وكانت ليلة شاتية ونزل منزلا بين شعاب وجبال في برد وشتاء وسحاب وظلام وضباب وجعل يقدح بزند معه ليوري نارا كما جرت له العادة به فجعل لا يقدح شيئا ولا يخرج منه شرر ولا شيء فبينما هو كذلك إذ آنس من جانب الطور نارا أي ظهرت له نار من جانب الجبل الذي هناك عن يمينه فقال لأهله يبشرهم إنى آنست نارا لعلي آتيكم منها بقبس أي شهاب من نار وفي الآية الأخرى أو جذوة من النار وهي الجمر الذي معه لهب لعلكم تصطلون دل على وجود البرد وقوله بقبس دل على وجود الظلام وقوله أو أجد على النار هدى أي من يهديني الطريق دل على أنه قد تاه عن الطريق كما قال الثوري عن أبي سعد الأعور عن عكرمة عن ابن عباس في قوله أو أجد على النار هدى قال من يهديني إلى الطريق وكانوا شاتين وضلوا الطريق فلما رأى النار قال إن لم أجد أحدا يهديني إلى الطريق أتيتكم بنار توقدون بها."
    },
    {
      "ayah": 100,
      "surah": 20,
      "text": "قال تعالى \"من أعرض عنه\" أي كذب به وأعرض عن اتباعه أمرا وطلبا وابتغى الهدى من غيره فإن الله يضله ويهديه إلى سواء الجحيم ولهذا قال من أعرض عنه فإنه يحمل يوم القيامة وزرا أي إثما كما قال تعالى\" ومن يكفر به من الأحزاب فالنار موعده\" وهذا عام في كل من بلغه القرآن من العرب والعجم أهل الكتاب وغيرهم كما قال لأنذركم به ومن بلغ فكل من بلغه القرآن فهو نذير له وداع فمن اتبعه هدي ومن خالفه وأعرض عنه ضل وشقي في الدنيا والنار موعده يوم القيامة."
    },
    {
      "ayah": 101,
      "surah": 20,
      "text": "قال \"من أعرض عنه فإنه يحمل يوم القيامة وزرا خالدين فيه\" أي لا محيد لهم عنه ولا انفكاك وساء لهم يوم القيامة حملا أي بئس الحمل حملهم."
    },
    {
      "ayah": 102,
      "surah": 20,
      "text": "ثبت في الحديث أن رسول الله صلى الله عليه وسلم سئل عن الصور فقال \" قرن ينفخ فيه \" وقد جاء في حديث الصور من رواية أبي هريرة أنه قرن عظيم الدائرة منه بقدر السموات والأرض ينفخ فيه إسرافيل وجاء في الحديث \" كيف أنعم وصاحب القرن قد التقم القرن وحنى جبهته وانتظر أن يؤذن له \" فقالوا يا رسول الله كيف نقول؟ قال \" قولوا حسبنا الله ونعم الوكيل على الله توكلنا \" وقوله\" ونحشر المجرمين يومئذ زرقا\" قيل معناه زرق العيون من شدة ما هم فيه من الأهوال."
    },
    {
      "ayah": 103,
      "surah": 20,
      "text": "\"يتخافتون بينهم\" قال ابن عباس يتساورون بينهم أي يقول بعضهم لبعض \"إن لبثتم إلا عشرا\" أي في الدار الدنيا لقد كان لبثكم فيها قليلا عشرة أيام أو نحوها."
    },
    {
      "ayah": 104,
      "surah": 20,
      "text": "قال الله تعالى \"نحن أعلم بما يقولون\" أي في حال تناجيهم بينهم \"إذ يقول أمثلهم طريقة\" أي العاقل الكامل فيهم إن لبثتم إلا يوما أي لقصر مدة الدنيا في أنفسهم يوم المعاد لأن الدنيا كلها وإن تكررت أوقاتها وتعاقبت لياليها وأيامها وساعاتها كأنها يوم واحد ولهذا يستقصر الكافرون مدة الحياة الدنيا يوم القيامة وكان غرضهم في ذلك درء قيام الحجة عليهم لقصر المدة ولهذا قال تعالى\" يوم تقوم الساعة يقسم المجرمون ما لبثوا غير ساعة\" - إلى قوله - ولكنكم كنتم لا تعلمون\" وقال تعالى أو لم نعمركم ما يتذكر فيه من تذكر وجاءكم النذير\" الآية وقال تعالى\" كم لبثتم في الأرض عدد سنين قالوا لبثنا يوم أو بعض يوم فاسأل العادين قال إن لبثتم إلا قليلا لو أنكم كنتم تعلمون \" أي إنما كان لبثكم فيها قليلا لو كنتم تعلمون لآثرتم الباقي على الفاني ولكن تصرفتم فأسأتم التصرف قدمتم الحاضر الفاني على الدائم الباقي."
    },
    {
      "ayah": 105,
      "surah": 20,
      "text": "يقول تعالى \" ويسألونك عن الجبال\" أي هل تبقى يوم القيامة أو تزول؟ فقل ينسفها ربي نسفا أي يذهبها عن أماكنها ويمحقها ويسيرها تسييرا."
    },
    {
      "ayah": 106,
      "surah": 20,
      "text": "\"فيذرها\" أي الأرض \"قاعا صفصفا\" أي بساطا واحدا والقاع هو المستوي من الأرض والصفصف تأكيد لمعنى ذلك وقيل الذي لا نبات فيه والأول أولى وإن كان الآخر مرادا أيضا باللازم."
    },
    {
      "ayah": 107,
      "surah": 20,
      "text": "قال \"لا ترى فيها عوجا ولا أمتا\" لا ترى في الأرض يومئذ واديا ولا رابية ولا مكانا منخفضا ولا مرتفعا كذا قال ابن عباس وعكرمة ومجاهد والحسن البصري والضحاك وقتادة وغير واحد من السلف."
    },
    {
      "ayah": 108,
      "surah": 20,
      "text": "\"يومئذ يتبعون الداعي لا عوج له\" أي يوم يرون هذه الأحوال والأهوال يستجيبون مسارعين إلى الداعي حيثما أمروا بادروا إليه ولو كان هذا في الدنيا لكان أنفع لهم ولكن حيث لا ينفعهم كما قال تعالى أسمع بهم وأبصر يوم يأتوننا\" وقال\" مهطعين إلى الداع\" وقال محمد بن كعب القرظي يحشر الله الناس يوم القيامة في ظلمة ويطوي السماء وتتناثر النجوم وتذهب الشمس والقمر وينادي مناد فيتبع الناس الصوت يؤمونه فذلك قوله \" يومئذ يتبعون الداعي لا عوج له\" وقال قتادة لا عوج له لا يميلون عنه وقال أبو صالح لا عوج له لا عوج عنه وقوله وخشعت الأصوات للرحمن قال ابن عباس سكنت وكذا قال السدي فلا تسمع إلا همسا قال سعيد بن جبير عن ابن عباس يعني وطء الأقدام وكذا قال عكرمة ومجاهد والضحاك والربيع بن أنس وقتادة وابن زيد وغيرهم وقال علي بن أبي طلحة عن ابن عباس فلا تسمع إلا همسا الصوت الخفي وهو رواية عن عكرمة والضحاك وقال سعيد بن جبير فلا تسمع إلا همسا الحديث وسره ووطء الأقدام فقد جمع سعيد كلا القولين وهو محتمل أما وطء الأقدام فالمراد سعي الناس إلى المحشر وهو مشيهم في سكون وخضوع وأما الكلام الخفي فقد يكون في حال دون حال فقد قال تعالى\" يوم يأت لا تكلم نفس إلا بإذنه فمنهم شقي وسعيد."
    },
    {
      "ayah": 109,
      "surah": 20,
      "text": "يقول تعالى يومئذ أي يوم القيامة لا تنفع الشفاعة أي عنده إلا من أذن له الرحمن ورضي له قولا كقوله\" من ذا الذي يشفع عنده إلا بإذنه وقوله وكم من ملك في السموات لا تغني شفاعتهم شيئا إلا من بعد أن يأذن الله لمن يشاء ويرضى وقال\" ولا يشفعون إلا لمن ارتضى وهم من خشيته مشفقون وقال ولا تنفع الشفاعة عنده إلا لمن أذن له\" وقال\" يوم يقوم الروح والملائكة صفا لا يتكلمون إلا من أذن له الرحمن وقال صوابا\" وفي الصحيحين من غير وجه عن رسول الله صلى الله عليه وسلم وهو سيد ولد آدم وأكرم الخلائق على الله عز وجل أنه قال \" آتي تحت العرش وأخر لله ساجدا ويفتح علي بمحامد لا أحصيها الآن فيدعني ما شاء الله أن يدعني ثم يقول يا محمد ارفع رأسك وقل يسمع واشفع تشفع - قال - فيحد لى حدا فأدخلهم الجنة ثم أعود \" فذكر أربع مرات صلوات الله وسلامه عليه وعلى سائر الأنبياء. وفي الحديث أيضا \" يقول تعالى أخرجوا من النار من كان في قلبه مثقال حبة من إيمان فيخرجوا خلقا كثيرا ثم يقول أخرجوا من النار من كان في قلبه نصف مثقال من إيمان أخرجوا من النار من كان في قلبه ما يزن ذرة من كان في قلبه أدنى أدنى مثقال ذرة من إيمان \" الحديث."
    },
    {
      "ayah": 11,
      "surah": 20,
      "text": "يقول تعالى فلما أتاها أي النار واقترب منها نودي يا موسى وفي الآية الأخرى نودي من شاطىء الوادي الأيمن في البقعة المباركة من الشجرةأن يا موسى إنى أنا الله وقال ههنا إني أنا ربك أي الذي يكلمك ويخاطبك."
    },
    {
      "ayah": 110,
      "surah": 20,
      "text": "\"يعلم ما بين أيديهم وما خلفهم\" أي يحيط علما بالخلائق كلهم ولا يحيطون به علما كقوله ولا يحيطون بشيء من علمه إلا بما شاء."
    },
    {
      "ayah": 111,
      "surah": 20,
      "text": "وقوله \"وعنت الوجوه للحي القيوم\" قال ابن عباس وغير واحد خضعت وذلت واستسلمت الخلائق لجبارها الحي الذي لا يموت القيوم الذي لا ينام وهو قيم على كل شيء يدبره ويحفظه فهو الكامل في نفسه الذي كل شيء فقير إليه لا قوام له إلا به وقوله وقد خاب من حمل ظلما أي يوم القيامة فإن الله سيؤدي كل إلى صاحبه حتى يقتص للشاة الجماء من الشاة القرناء وفي الحديث \" يقول الله عز وجل وعزتي وجلالي لا يجاوزني اليوم ظلم ظالم \" وفي الصحيح \" إياكم والظلم فإن الظلم ظلمات يوم القيامة والخيبة كل الخيبة من لقي الله وهو به مشرك فإن الله تعالى يقول\" إن الشرك لظلم عظيم \"."
    },
    {
      "ayah": 112,
      "surah": 20,
      "text": "وقوله \"ومن يعمل من الصالحات وهو مؤمن فلا يخاف ظلما ولا هضما\" لما ذكر الظالمين ووعيدهم ثنى بالمتقين وحكمهم وهو أنهم لا يظلمون ولا يهضمون أي لا يزاد في سيئاتهم ولا ينقص من حسناتهم قاله ابن عباس ومجاهد والضحاك والحسن وقتادة وغير واحد فالظلم الزيادة بأن يحمل عليه ذنب غيره والهضم النقص."
    },
    {
      "ayah": 113,
      "surah": 20,
      "text": "يقول تعالى ولما كان يوم المعاد والجزاء بالخير والشر واقع لا محالة أنزلنا القرآن بشيرا ونذيرا بلسان عربي مبين فصيح لا لبس فيه ولا عي\" وصرفنا فيه من الوعيد لعلهم يتقون أي يتركون المآثم والمحارم والفواحش أو يحدث لهم ذكرا وهو إيجاد الطاعة وفعل القربات فتعالى الله الملك الحق أي تنزه وتقدس الملك الحق الذي هو حق ووعده حق ووعيده حق ورسله حق والجنة حق والنار حق وكل شيء منه حق وعدله تعالى أن لا يعذب أحدا قبل الإنذار وبعثة الرسل والإعذار إلى خلقه لئلا يبقى لأحد حجة ولا شبهة وقوله\" ولا تعجل بالقرآن من قبل أن يقضى إليك وحيه\" كقوله تعالى في سورة لا أقسم بيوم القيامة\" لا تحرك به لسانك لتعجل به إن علينا جمعه وقرآنه فإذا قرأناه فاتبع قرآنه ثم إن علينا بيانه\" وثبت في الصحيح عن ابن عباس أن رسول الله صلى الله عليه وسلم كان يعالج من الوحي شدة فكان مما يحرك به لسانه فأنزل الله هذه الآية يعني أنه كان إذا جاءه جبريل بالوحي كلما قال جبريل آية قالها معه من شـدة حرصه على حفظ القرآن فأرشده الله تعالى إلى ما هو الأسهل والأخف في حقه لئلا يشق عليه فقال لا تحرك به لسانك لتعجل به إن علينا جمعه وقرآنه أي أن نجمعه في صدرك ثم تقرأه على الناس من غير أن تنسى منه شيئا\" فإذا قرأناه فاتبع قرآنه ثم إن علينا بيانه \"."
    },
    {
      "ayah": 114,
      "surah": 20,
      "text": "وقال في هذه الآية \"ولا تعجل بالقرآن من قبل أن يقضى إليك وحيه\" أي بل أنصت فإذا فرغ الملك من قراءته عليك فاقرأه بعده \"وقل رب زدني علما\" أى زدني منك علما قال ابن عيينة رحمه الله ولم يزل صلى الله عليه وسلم في زيادة حتى توفاه الله عز وجل ولهذا جاء في الحديث \" إن الله تابع الوحي على رسوله حتى كان الوحي أكثر ما كان يوم توفي رسول الله صلى الله عليه وسلم \" وقال ابن ماجه حدثنا أبو بكر بن أبى شيبة حدثنا عبد الله بن نمير عن موسى بن عبيدة عن محمد بن ثابت عن أبي هريرة رضي الله عنه قال: كان رسول الله صلى الله عليه وسلم يقول: \" اللهم انفعني بما علمتني وعلمني ما ينفعني وزدني علما والحمد لله على كل حال \" وأخرجه الترمذي عن أبي كريب عن عبد الله بن نمير به وقال غريب من هذا الوجه ورواه البزار عن عمرو بن علي الفلاس عن أبي عاصم عن موسى بن عبيدة به وزاد في آخره وأعوذ بالله من حال أهل النار\"."
    },
    {
      "ayah": 115,
      "surah": 20,
      "text": "قال ابن أبي حاتم حدثنا أحمد بن سنان حدثنا أسباط بن محمد حدثنا الأعمش عن سعيد بن جبير عن ابن عباس قال: إنما سمي الإنسان لأنه عهد إليه فنسي وكذا رواه علي بن أبي طلحة عنه وقال مجاهد والحسن ترك."
    },
    {
      "ayah": 116,
      "surah": 20,
      "text": "وقوله \"وإذ قلنا للملائكة اسجدوا لآدم\" يذكر تعالى تشريف آدم وتكريمه وما فضله به على كثير ممن خلق تفضيلا وقد تقدم الكلام على هذه القصة في سورة البقرة وفي الأعراف في الحجر والكهف وسيأتي في آخر سورة ص يذكر تعالى فيها خلق آدم وأمره الملائكة بالسجود له تشريفا وتكريما ويبين عداوة إبليس لبني آدم ولأبيهم قديما ولهذا قال تعالى \"فسجدوا إلا إبليس أبى\" أي امتنع واستكبر."
    },
    {
      "ayah": 117,
      "surah": 20,
      "text": "\"فقلنا يا آدم إن هذا عدو لك ولزوجك\" يعني حواء عليهما السلام \"فلا يخرجنكما من الجنة فتشقى\" أي إياك أن تسعى في إخراجك منها فتتعب وتعنى وتشقى في طلب رزقك فإنك ههنا في عيش رغيد هنيء بلا كلفة ولا مشقة."
    },
    {
      "ayah": 118,
      "surah": 20,
      "text": "\"إن لك أن لا تجوع فيها ولا تعرى \"إنما قرن بين الجوع والعري لأن الجوع ذل الباطن والعري ذل الظاهر."
    },
    {
      "ayah": 119,
      "surah": 20,
      "text": "\"وأنك لا تظمؤا فيها ولا تضحى\" وهذان أيضا متقابلان فالظمأ حر الباطن وهو العطش والضحى حر الظاهر."
    },
    {
      "ayah": 12,
      "surah": 20,
      "text": "قال علي بن أبي طالب وأبو ذر وأبو أيوب وغير واحد من السلف كانتا من جلد حمار غير ذكي وقيل إنما أمره بخلع نعليه تعظيما للبيعة وقال سعيد بن جبير كما يؤمر الرجل أن يخلع نعليه إذا أراد أن يدخل الكعبة وقيل ليطأ الأرض المقدسة بقدميه حافيا غير منتعل وقيل غير ذلك والله أعلم وقوله\" طوى\" قال علي بن أبي طلحة عن ابن عباس هو اسم للوادي وكذا قال غير واحد فعلى هذا يكون عطف بيان وقيل عبارة عن الأمر بالوطء بقدميه وقيل لأنه قدس مرتين وطوى له البركة وكررت والأول أصبح كقوله إذ ناداه ربه بالواد المقدس طوى."
    },
    {
      "ayah": 120,
      "surah": 20,
      "text": "وقوله \"فوسوس إليه الشيطان قال يا آدم هل أدلك على شجرة الخلد وملك لا يبلى\" قد تقدم أنه دلاهما بغرور وقاسمهما إني لكما لمن الناصحين وقد تقدم أن الله تعالى عهد إلى آدم وزوجه أن يأكلا من كل الثمار ولا يقربا هذه الشجرة المعينة في الجنة فلم يزل بهما إبليس حتى أكلا منها وكانت شجرة الخلد يعني التي من أكل منها خلد ودام مكثه وقد جاء في الحديث ذكر شجرة الخلد فقال أبو داود الطيالسي حدثنا شعبة عن أبي الضحى سمعت أبا هريرة يحدث عن النبي صلى الله عليه وسلم قال \" إن في الجنة شجرة يسير الراكب في ظلها مائة عام ما يقطعها وهي شجرة الخلد \" ورواه الإمام أحمد."
    },
    {
      "ayah": 121,
      "surah": 20,
      "text": "\"فأكلا منها فبدت لهما سوآتهما\" قال ابن أبي حاتم حدثنا علي بن الحسين بن أشكاب حدثنا علي بن عاصم عن سعيد بن أبي عروبة عن قتادة عن الحسن عن أبي بن كعب قال: قال رسول الله صلى الله عليه وسلم \" إن الله خلق آدم رجلا طوالا كثير شعر الرأس كأنه نخلة سحوق فلما ذاق الشجرة سقط عنه لباسه فأول ما بدا منه عورته فلما نظر إلى عورته جعل يشتد في الجنة فأخذت شعره شجرة فنازعها فناداه الرحمن يا آدم مني تفر فلما سمع كلام الرحمن قال يا رب لا ولكن استحياء أرأيت إن تبت ورجعت أعائدي إلى الجنة؟ قال نعم \" فذلك قوله فتلقى آدم من ربه كلمات فتاب عليه وهذا منقطع بين الحسن وأبي بن كعب فلم يسمعه منه وفي رفعه نظر أيضا وقوله\" وطفقا يخصفان عليهما من ورق الجنة\" قال مجاهد يرقعان كهيئة الثوب وكذا قال قتادة والسدي وقال ابن أبي حاتم حدثنا جعفر بن عون حدثنا سفيان عن ابن أبي ليلى عن المنهال عن سعد بن جبير عن ابن عباس وطفقا يخصفان عليهما من ورق الجنة\" قال ينزعان ورق التين فيجعلانه على سوآتهما."
    },
    {
      "ayah": 122,
      "surah": 20,
      "text": "وقوله \"وعصى آدم ربه فغوى ثم اجتباه ربه فتاب عليه وهدى\" قال البخاري حدثنا قتيبة حدثنا أيوب بن النجار عن يحيى بن أبي كثير عن أبي سلمة عن أبي هريرة عن النبي صلى الله عليه وسلم قال: \" حاج موسى آدم فقال له أنت الذي أخرجت الناس من الجنة بذنبك وأشقيتهم؟ قال آدم يا موسى أنت الذي اصطفاك الله برسالاته وبكلامه أتلومني على أمر كتبه الله علي قبل أن يخلقني أو قدره الله علي قبل أن يخلقني - قال رسول الله صلى الله عليه وسلم - فحج آدم موسى \" وهذا الحديث له طرق في الصحيحين وغيرهما من المسانيد. وقال ابن أبي حاتم حدثنا يونس بن عبد الأعلى أخبرنا ابن وهب أخبرني أنس بن عياض عن الحارث بن أبي ذئاب عن يزيد بن هرمز قال سمعت أبا هريرة يقول: قال رسول الله صلى الله عليه وسلم \" احتج آدم وموسى عند ربهما فحج آدم موسى قال موسى أنت الذي خلقك الله بيده ونفخ فيك من روحه وأسجد لك ملائكته وأسكنك في جنته ثم أهبطت الناس إلى الأرض بخطيئتك؟ قال آدم أنت موسى الذى اصطفاك الله برسالته وكلامه وأعطاك الألواح فيها تبيان كل شيء وقربك نجيا فبكم وجدت الله كتب التوراة قبل أن أخلق قال موسى بأربعين عام قال آدم فهل وجدت فيها وعصى آدم ربه فغوى؟ قال نعم قال أفتلومني على أن عملت عملا كتب الله علي أن أعمله قبل أن يخلقني بأربعين سنة - قال رسول الله صلى الله عليه وسلم - فحج آدم موسى \" قال الحارث وحدثني عبد الرحمن بن هرمز بذلك عن أبى هريرة عن النبي صلى الله عليه وسلم."
    },
    {
      "ayah": 123,
      "surah": 20,
      "text": "يقول تعالى لآدم وحواء و إبليس اهبطوا منها جميعا أي من الجنة كلكم وقد بسطنا ذلك في سورة البقرة بعضكم لبعض عدو قال آدم وذريته وإبليس وذريته وقوله: فإما يأتينكم مني هدى قال أبو العالية: الأنبياء والرسل والبيان فمن اتبع هداي فلا يضل ولا يشقى قال ابن عباس لا يضل في الدنيا ولا يشقى في الآخرة."
    },
    {
      "ayah": 124,
      "surah": 20,
      "text": "\"ومن أعرض عن ذكري\" أي خالف أمري وما أنزلته على رسولي أعرض عنه وتناساه وأخذ من غيره هداه فإن له معيشة ضنكا أي ضنك في الدنيا فلا طمأنينة له ولا انشراح لصدره بل صدره ضيق حرج لضلاله وإن تنعم ظاهره ولبس ما شاء وأكل ما شاء وسكن حيث شاء فإن قلبه ما لم يخلص إلى اليقين والهدى فهو في قلق وحيرة وشك فلا يزال في ريبة يتردد فهذا من ضنك المعيشة قال علي بن أبي طلحة عن ابن عباس فإن له معيشة ضنكا قال الشقاء وقال العوفي عن ابن عباس فإن له معيشة ضنكا قال كلما أعطيته عبدا من عبادي قل أو كثر لا يتقيني فيه فلا خير فيه وهو الضنك في المعيشة وقال أيضا إن قوما ضلالا أعرضوا عن الحق وكانوا في سعة من الدنيا متكبرين فكانت معيشتهم ضنكا وذلك أنهم كانوا يرون أن الله ليس مخلفا لهم معايشهم من سوء ظنهم بالله والتكذيب فإذا كان العبد يكذب بالله ويسيء الظن به والثقة به اشتدت عليه معيشته فذلك الضنك وقال الضحاك هو العمل السيء والرزق الخبيث وكذا قال عكرمة ومالك بن دينار وقال سفيان بن عيينة عن أبي حازم عن أبي سلمة عن أبي سعيد في قوله معيشة ضنكا قال يضيق عليه قبره حتى تختلف أضلاعه فيه قال أبو حاتم الرازي: النعمان بن أبي عياض يكنى أبا سلمة وقال ابن أبي حاتم حدثنا أبو زرعة حدثنا صفوان أنبأنا الوليد أنبأنا عبد الله بن لهيعة عن دراج عن أبي الهيثم عن أبي سعيد قال: قال رسول الله صلى الله عليه وسلم في قول الله عز وجل \" فإن له معيشة ضنكا\" قال \" ضمة القبر له \" والموقوف أصح. وقال ابن أبي حاتم أيضا حدثنا الربيع بن سليمان حدثنا أسد بن موسى حدثنا ابن لهيعة حدثنا دراج أبو السمح عن ابن حجيرة واسمه عبد الرحمن عن أبي هريرة عن رسول الله صلى الله عليه وسلم قال \" المؤمن في قبره في روضة خضراء ويفسح له في قبره سبعون ذراعا وينور له قبره كالقمر ليلة البدر أتدرون فيما أنزلت هذه الآية فإن له معيشة ضنكا أتدرون ما المعيشة الضنك؟ \" قالوا الله ورسوله أعلم قال \" عذاب الكافر في قبره والذي نفسي بيده إنه ليسلط عليه تسعة وتسعون تنينا أتدرون ما التنين؟ تسعة وتسعون حية لكل حية سبعة رءوس ينفخون في جسمه ويلسعونه ويخدشونه إلى يوم يبعثون \" رفعه منكر جدا وقال البزار حدثنا محمد بن يحيى الأزدي حدثنا بن عمرو حدثنا هشام بن سعد عن سعيد بن أبي هلال عن ابن حجيرة عن أبي هريرة عن النبي صلى الله عليه وسلم في قول الله عز وجل\" فإن له معيشة ضنكا قال \" المعيشة الضنك الذي قال الله إنه يسلط عليه تسعة وتسعون حية ينهشون لحمه حتى تقوم الساعة \". وقال أيضا حدثنا أبو زرعة حدثنا أبو الوليد حدثنا حماد بن سلمة عن محمد بن عمرو عن أبي سلمة عن أبي هريرة عن النبي صلى الله عليه وسلم فإن له معيشة ضنكا قال \" عذاب القبر \" إسناد جيد وقوله ونحشره يوم القيامة أعمى قال مجاهد وأبو صالح والسدي لا حجة له وقال عكرمة عمي عليه كل شيء إلا جهنم ويحتمل أن يكون المراد أنه يبعث أو يحشر إلى النار أعمى البصر والبصيرة أيضا كما قال تعالى\" ونحشرهم يوم القيامة على وجوههم عميا وبكم وصما مأواهم جهنم\" الآية."
    },
    { "ayah": 125, "surah": 20, "text": "ولهذا يقول \"رب لم حشرتني أعمى وقد كنت بصيرا\" أي في الدنيا." },
    {
      "ayah": 126,
      "surah": 20,
      "text": "\"قال كذلك أتتك آياتنا فنسيتها وكذلك اليوم تنسى\" أي لما أعرضت عن آيات الله وعاملتها معاملة من لم يذكرها بعد بلاغها إليك تناسيتها وأعرضت عنها وأغفلتها كذلك اليوم نعاملك معاملة من ينساك \"فاليوم ننساهم كما نسوا لقاء يومهم هذا\" فإن الجزاء من جنس العمل. فأما نسيان لفظ القرآن مع فهم معناه والقيام بمقتضاه فليس داخلا في هذا الوعيد الخاص وإن كان متوعدا عليه من جهة أخرى قاله قد وردت السنة بالنهي الأكيد والوعيد الشديد في ذلك قال الإمام أحمد حدثنا خلف بن الوليد حدثنا خالد عن يزيد بن أبي زياد عن عيسى بن فائد عن رجل عن سعيد بن عبادة عن النبي صلى الله عليه وسلم قال: \" ما من رجل قرأ القران فنسيه إلا لقي الله يوم يلقاه وهو أجذم \" ثم رواه الإمام أحمد من حديث يزيد بن أبي زياد عن عيسى بن فائد عن عبادة بن الصامت عن النبي صلى الله عليه وسلم فذكر مثله سواء."
    },
    {
      "ayah": 127,
      "surah": 20,
      "text": "يقول تعالى وهكذا نجازي المسرفين المكذبين بآيات الله في الدنيا والآخرة لهم عذاب في الحياة الدنيا ولعذاب الآخرة أشق وما لهم من الله من واق\" ولهذا قال\" ولعذاب الآخرة أشد وأبقى\" أي أشد ألما من عذاب الدنيا وأدوم عليهم فهم مخلدون فيه ولهذا قال رسول الله صلى الله عليه وسلم للمتلاعنين \" إن عذاب الدنيا أهون من عذاب الآخرة \"."
    },
    {
      "ayah": 128,
      "surah": 20,
      "text": "يقول تعالى أفلم يهد لهؤلاء المكذبين بما جئتهم به يا محمد كم أهلكنا من الأمم المكذبين بالرسل قبلهم فبادوا فليس لهم باقية ولا عين ولا أثر كما يشاهدون ذلك من ديارهم الخالية التي خلفوهم فيها يمشون فيها إن في ذلك لآيات لأولي النهى أى العقول الصحيحة والألباب المستقيمة كما قال تعالى\" أفلم يسيروا في الأرض فتكون لهم قلوب يعقلون بها أو آذان يسمعون بها فإنها لا تعمى الأبصار ولكن تعمى القلوب التي في الصدور وقال في سورة الم السجدة \"أو لم يهد لهم كم أهلكنا من قبلهم من القرون يمشون في مساكنهم\" الآية."
    },
    {
      "ayah": 129,
      "surah": 20,
      "text": "قال تعالى \"ولولا كلمة سبقت من ربك لكان لزاما وأجل مسمى\" أي لولا الكلمة السابقة من الله وهو أنه لا يعذب أحدا إلا بعد قيام الحجة عليه والأجل المسمى الذي ضربه الله تعالى لهؤلاء المكذبين إلى مدة معينة لجاءهم العذاب بغتة."
    },
    {
      "ayah": 13,
      "surah": 20,
      "text": "وقوله\"وأنا اخترتك \" كقوله إني اصطفيتك على الناس برسالاتي وبكلامي\" أي على جميع الناس من الموجودين في زمانه وقد قيل إن الله تعالى قال يا موسى أتدري لم خصصتك بالتكليم من بين الناس ؟ قال لا قال لأني لم يتواضع إلي أحد تواضعك وقوله فاستمع لما يوحى أي استمع الآن ما أقول لك وأوحيه إليك."
    },
    {
      "ayah": 130,
      "surah": 20,
      "text": "ولهذا قال لنبيه مسليا له\"فاصبر على ما يقولون\" أي من تكذيبهم لك وسبح بحمد ربك قبل طلوع الشمس يعني صلاة الفجر وقبل غروبها يعني صلاة العصر كما جاء في الصحيحين عن جرير بن عبد الله البجلي رضي الله عنه قال كنا جلوسا عند رسول الله صلى الله عليه وسلم فنظر إلى القمر ليلة البدر فقال \" إنكم سترون ربكم كما ترون هذا القمر لا تضامون في رؤيته فإن استطعتم أن لا تغلبوا على صلاة قبل طلوع الشمس وقبل غروبها فافعلوا \" ثم قرأ هذه الآية وقال الإمام أحمد حدثنا سفيان بن عيينة عن عبد الملك بن عمير عن عمارة بن رؤيبة قال سمعت رسول الله صلى الله عليه وسلم يقول \" لن يلج النار أحد صلى قبل طلوع الشمس وقبل غروبها \" رواه مسلم من حديث عبد الملك بن عمير به وفي المسند والسنن عن ابن عمر قال قال رسول الله صلى الله عليه وسلم \" إن أدنى أهل الجنة منزلة من ينظر في ملكه مسيرة ألف سنة ينظر إلى أقصاه كما ينظر إلى أدناه وإن أعلاهم منزلة لمن ينظر إلى الله تعالى في اليوم مرتبن \" وقوله \"ومن آناء الليل فسبح\" أي من ساعاته فتهجد به وحمله بعضهم على المغرب والعشاء \"وأطراف النهار\" في مقابلة آناء الليل \"لعلك ترضى\" كما قال تعالى \"ولسوف يعطيك ربك فترضى\" وفي الصحيح \" يقول الله تعالى يا أهل الجنة فيقولون لبيك ربنا وسعديك فيقول هل رضيتم فيقولون ربنا وما لنا لا نرضى وقد أعطيتنا ما لم تعط أحدا من خلقك فيقول إنى أعطيكم أفضل من ذلك فيقولون وأي شيء أفضل من ذلك؟ فيقول أحل عليكم رضواني فلا أسخط عليكم بعده أبدا \" وفي الحديث الآخر \" يا أهل الجنة إن لكم عند الله موعدا يريد أن ينجزكموه فيقولون وما هو؟ ألم يبيض وجوهنا ويثقل موازيننا ويزحزحنا عن النار ويدخلنا الجنة فيكشف الحجاب فينظرون إليه فوالله ما أعطاهم خيرا من النظر إليه وهي الزيادة \"."
    },
    {
      "ayah": 131,
      "surah": 20,
      "text": "يقول تعالى لنبيه محمد صلى الله عليه وسلم لا تنظر إلى ما هؤلاء المترفون وأشباههم ونظراؤهم فيه من النعيم فإنما هو زهرة زائلة ونعمة حائلة لنختبرهم بذلك وقليل من عبادي الشكور وقال مجاهد أزواجا منهم يعني الأغنياء فقد آتاك خيرا مما آتاهم كما قال في الآية الأخرى ولقد آتيناك سبعا من المثاني والقرآن العظيم لا تمدن عينيك وكذا ما ادخره الله تعالى لرسوله في الآخرة أمر عظيم لا يحد ولا يوصف كما قال تعالى ولسوف يعطيك ربك فترضى\" ولهذا قال\" ورزق ربك خير وأبقى\" وفي الصحيح أن عمر بن الخطاب لما دخل على رسول الله صلى الله عليه وسلم في تلك المشربة التي كان قد اعتزل فيها نساءه حين آلى منهم فرآه متوسدا مضطجعا على رمال حصير وليس في البيت إلا صبرة من قرظ واهية معلقة فابتدرت عينا عمر بالبكاء فقال له رسول الله صلى الله عليه وسلم \" ما يبكيك يا عمر؟ \" فقال يا رسول الله إن كسرى وقيصر فيما هما فيه وأنت صفوة الله من خلقه فقال \" أو في شك أنت يا ابن الخطاب؟ أولئك قوم عجلت لهم طيباتهم في حياتهم الدنيا \" فكان صلى الله عليه وسلم أزهد الناس في الدنيا مع القدرة عليها إذا حصلت له ينفقها هكذا وهكذا في عباد الله ولم يدخر لنفسه شيئا لغد قال ابن أبي حاتم أنبأنا يونش أخبرني ابن وهب أخبرني مالك عن زيد بن أسلم عن عطاء بن يسار عن أبي سعيد أن رسول الله صلى الله عليه وسلم قال \" أن أخوف ما أخاف عليكم ما يفتح الله لكم من زهرة الدنيا \" قالوا وما زهرة الدنيا يا رسول الله قال \" بركات الأرض \" وقال قتادة والسدي: زهرة الحياة الدنيا يعني زينة الحياة الدنيا وقال قتادة لنفتنهم فيه لنبتليهم."
    },
    {
      "ayah": 132,
      "surah": 20,
      "text": "وقوله \"وأمر أهلك بالصلاة واصطبر عليها\" أي استنقذهم من عذاب الله بإقام الصلاة واصبر أنت على فعلها كما قال تعالى يا أيها الذين آمنوا قوا أنفسكم وأهليكم نارا وقال ابن أبي حاتم حدثنا أبي حدثنا أحمد بن صالح حدثنا ابن وهب أخبرني هشام بن سعد عن زيد بن أسلم عن أبيه أن عمر بن الخطاب كان يبيت عنده أنا ويرفأ وكان له ساعة من الليل يصلي فيها فربما لم يقم فنقول لا يقوم الليلة كما كان يقوم وكان إذا استيقظ أقام يعني أهله وقال وأمر أهلك بالصلاة واصطبر عليها وقوله لا نسألك رزقا نحن نرزقك يعني إذا أقمت الصلاة أتاك الرزق من حيث لا تحتسب كما قال تعالى\" ومن يتق الله يجعل له مخرجا ويرزقه من حيث لا يحتسب وقال تعالى وما خلقت- الجن والإنس إلا ليعبدون\" إلى قوله\" إن الله هو الرزاق ذو القوة المتين ولهذا قال لا نسألك رزقا نحن نرزقك وقال الثوري لا نسألك رزقا أي لا نكلفك الطلب وقال ابن أبي حاتم حدثنا أبو سعيد الأشج حدثنا حفص بن غياث عن هشام عن أبيه أنه كان إذا دخل على أهل الدنيا فرأى من دنياهم طرفا فإذا رجع إلى أهله فدخل الدار قرأ ولا تمدن عينيك - إلى قوله - نحن نرزقك ثم يقول الصلاة الصلاة رحمكم الله وقال ابن أبي حاتم حدثنا أبي حدثنا عبد الله بن أبي زياد القطراني حدثنا سيار حدثنا جعفر عن ثابت قال كان النبي صلى الله عليه وسلم إذا أصابه خصاصة نادى أهله \" يا أهلاه صلوا صلوا \" قال ثبت وكانت الأنبياء إذا نزل بهم أمر فزعوا إلى الصلاة وقد روى الترمذي وابن ماجه من حديث عمران بن زائدة عن أبيه عن أبي خالد الوالبي عن أبي هريرة قال: قال رسول الله صلى الله عليه وسلم \" يقول الله تعالى يا ابن آدم تفرغ لعبادتي أملأ صدرك غنى وأسد فقرك وإن لم تفعل ملأت صدرك شغلا ولم أسد فقرك \" وروى ابن ماجه من حديث الضحاك عن الأسود عن ابن مسعود سمعت نبيكم صلى الله عليه وسلم يقول \" من جعل الهموم هم واحدا هم المعاد كفاه الله هم دنياه ومن تشعبت به الهموم في أحوال الدنيا لم يبال الله في أي أوديته هلك \" وروى أيضا من حديث شعبة عن عمر بن سليمان عن عبد الرحمن بن أبان عن أبيه عن زيد بن ثابت سمعت رسول الله صلى الله عليه وسلم يقول \" من كانت الدنيا همه فرق الله عليه أمره وجعل فقره بين عينيه ولم يأته من الدنيا إلا ما كتب له ومن كانت الآخرة نيته جمع له أمره وجعل غناه في قلبه وأتته الدنيا وهي راغمة \" وقوله والعاقبة للتقوى أي وحسن العاقبة في الدنيا والآخرة وهي الجنة لمن اتقى الله وفي الصحيح أن رسول الله صلى الله عليه وسلم قال \" رأيت الليلة كأنا في دار عقبة بن رافع وأنا أتينا برطب من رطب ابن طاب فأولت ذلك أن العاقبة لنا في الدنيا والرفعة وأن ديننا قد طاب \"."
    },
    {
      "ayah": 133,
      "surah": 20,
      "text": "يقول تعالى مخبرا عن الكفار في قولهم لولا أي هلا يأتينا محمد بآية من ربه أي بعلامة دالة على صدقه في أنه رسول الله صلى الله عليه وسلم ؟ قال الله تعالى أو لم تأتهم بينة ما في الصحف الأولى يعني القرآن الذي أنزله عليه الله وهو أمي لا يحسن الكتابة ولم يدارس أهل الكتاب وقد جاء فيه أخبار الأولين بما كان منهم في سالف الدهور بما يوافقه عليه الكتب المتقدمة الصحيحة منها فإن القرآن مهيمن عليها يصدق الصحيح ويبين خطأ المكذوب فيها وعليها وهذه الآية كقوله تعالى في سورة العنكبوت وقالوا لولا أنزل عليه آيات من ربه قل إنما الآيات عند الله وإنما أنا نذير مبين أو لم يكفهم أنا أنزلنا عليك الكتاب يتلى عليهم إن في ذلك لرحمة وذكرى لقوم يؤمنون وفي الصحيحين عن رسول الله صلى الله عليه وسلم إنه قال \" ما من نبي إلا وقد أوتي من الآيات ما آمن على مثله البشر وإنما كان الذي أوتيته وحيا أوحاه الله إلي فأرجو أن أكون أكثرهم تابعا يوم القيامة \" وإنما ذكر ههنا أعظم الآيات التي أعطيها السلام وهو القرآن وإلا فله من المعجزات ما لا يحد ولا يحصر كما هو مودع في كتبه ومقرر في مواضعه."
    },
    {
      "ayah": 134,
      "surah": 20,
      "text": "قال تعالى \"ولو أنا أهلكناهم بعذاب من قبله لقالوا ربنا لولا أرسلت إلينا رسولا\" أي لو أنا أهلكنا هؤلاء المكذبين قبل أن نرسل إليهم هذا الرسول الكريم وننزل عليهم هذا الكتاب العظيم لكانوا قالوا ربنا لولا أرسلت إلينا رسولا قبل أن تهلكنا حتى نؤمن به ونتبعه كما قال فنتبع آياتك من قبل أن نذل ونخزى يبين تعالى أن هؤلاء المكذبين متعنتون معاندون لا يؤمنون ولو جاءتهم كل آية حتى يروا العذاب الأليم كما قال تعالى وهذا كتاب أنزلناه مبارك فاتبعوه واتقوا لعلكم ترحمون - إلى قوله - بما كانوا يصدفون وقال وأقسموا بالله جهد أيمانهم لئن جاءهم نذير ليكونن أهدى من إحدى الأمم الآية وقال وأقسموا بالله جهد أيمانهم لئن جاءتهم آية ليؤمنن بها الآيتين."
    },
    {
      "ayah": 135,
      "surah": 20,
      "text": "قال تعالى \"قل\" أي يا محمد لمن كذبك وخالفك واستمر على كفره وعناده \"كل متربص\" أي منا ومنكم \"فتربصوا\" أي فانتظروا \"فستعلمون من أصحاب الصراط السوي\" أي الطريق المستقيم \"ومن اهتدى\" إلى الحق وسبيل الرشد وهذا كقوله تعالى \"وسوف يعلمون حين يرون العذاب من أضل سبيلا\" وقال \"سيعلمون غدا من الكذاب الأشر\". آخر تفسير سورة طه ولله الحمد والمنة ويتلوه إن شاء الله تفسير سورة الأنبياء ولله الحمد."
    },
    {
      "ayah": 14,
      "surah": 20,
      "text": "هذا أول واجب على المكلفين أن يعلموا أنه لا إله إلا الله وحده لا شريك له. \" وقوله\" فاعبدني أي وحدني وقم بعبادتي من غير شرك وأقم الصلاة لذكري قيل معناه صل لتذكرني وقيل معناه وأقم الصلاة عند ذكرك لي ويشهد لهذا الثاني ما قال الإمام أحمد حدثنا عبد الرحمن ابن مهدي حدثنا المثنى بن سعيد عن قتادة عن أنس عن رسول الله صلى الله عليه وسلم قال \" إذا رقد أحدكم عن الصلاة أو غفل عنها فليصلها إذا ذكرها فإن الله تعالى قال وأقم الصلاة لذكري \" وفي الصحيحين عن أنس قال قال رسول الله صلى الله عليه وسلم \" من نام عن صلاة أو نسيها فكفارتها أن يصليها إذا ذكرها لا كفارة لها إلا ذلك \"."
    },
    {
      "ayah": 15,
      "surah": 20,
      "text": "وقوله\"إن الساعة آتية\" أي قائمة لا محالة وكائنة لا بد منها وقوله\" أكاد أخفيها\" قال الضحاك عن ابن عباس إنه كان يقرؤها أكاد أخفيها من نفسي يقول لأنها لا تخفى من نفس الله أبدا وقال سعيد بن جبير عن ابن عباس من نفسه وكذا قال مجاهد وأبو صالح ويحيى بن رافع وقال علي بن أبي طلحة عن ابن عباس أكاد أخفيها يقول لا أطلع عليها أحدا غيري وقال السدي ليس أحد من أهل السموات والأرض إلا قد أخفى الله تعالى عنه علم الساعة وهي فى قراءة ابن مسعود إني أكاد أخفيها من نفسي يقول كتمتها عن الخلائق حتى لو استطعت أن أكتمها من نفسي لفعلت.وقال قتادة أكاد أخفيها وهي فى بعض القراءات أخفيها من نفسي ولعمري لقد أخفاها الله من الملائكة المقربين ومن الأنبياء والمرسلين قلت وهذا كقوله تعالى قل لا يعلم من فى السموات والأرض الغيب إلا الله وقال\" ثقلت في السموات والأرض لا تأتيكم إلا بغتة\" أي ثقل علمها على أهل السموات والأرض وقال ابن أبي حاتم حدثنا أبو زرعة حدثنا منجاب حدثنا أبو نميلة حدثني محمد بن سهل الأسدي عن ورقاء قال أقرأنيها سعيد بن جبير أكاد أخفيها يعني بنصب الألف وخفض الفاء يقول أظهرها ثم قال أما سمعت قول الشاعر: داب شهرين ثم شهرا دميكا بأربكين يخفيان غميرا نال السدي الغمير نبت رطب ينبت في خلال يبس والأربكين موضع والدميك الشهر التام وهذا الشعر لكعب ابن زهير.وقوله سبحانه وتعالى لتجزى كل نفس بما تسعى أي أقيمها لا محالة لأجزي كل عامل بعمله {فمن يعمل مثقال ذرة خيرا يره ومن يعمل مثقال ذرة شرا يره\" وإنما تجزون ما كنتم تعملون."
    },
    {
      "ayah": 16,
      "surah": 20,
      "text": "وقوله\"فلا يصدنك عنها من لا يؤمن بها\"الآية المراد بهذا الخطاب آحاد المكلفين أي لا تتبعوا سبيل من كذب بالساعة وأقبل على ملاذه في دنياه وعصى مولاه واتبع هواه فمن وافقهم على ذلك فقد خاب وخسر فتردى أي تهلك وتعطب قال الله تعالى وما يغني عنه ماله إذا تردى."
    },
    {
      "ayah": 17,
      "surah": 20,
      "text": "هذا برهان من الله تعالى لموسى عليه السلام ومعجزة عظيمة وخرق للعادة باهر دل على أنه لا يقدر على مثل هذا إلا الله عز وجل وأنه لا يأتي به إلا نبي مرسل وقوله وما تلك بيمينك يا موسى قال بعض المفسرين إنما قال له ذلك على سبيل الإيناس له وقيل إنما قال له ذلك على وجه التقرير أي أما هذه التي في يمينك عصاك التي تعرفها فسترى ما نصنع بها الآن \"وما تلك بيمنك يا موسى\" استفهام تقرير."
    },
    {
      "ayah": 18,
      "surah": 20,
      "text": "\"قال هي عصاي أتوكؤا عليها\" أي أعتمد عليها في حال المشي وأهش بها على غنمي أي أهز بها الشجرة ليتساقط ورقها لترعاه غنمي قال عبد الرحمن بن القاسم عن الإمام مالك: الهش أن يضع الرجل المحجن في الغصن ثم يحركه حتى يسقط ورقه وثمره ولا يكسر العود فهذا الهش ولا يخبط وكذا قال ميمون بن مهران أيضا وقوله ولي فيها مآرب أخرى أي مصالح ومنافع وحاجات أخر غير ذلك وقد تكلف بعضهم لذكر شيء من تلك المآرب التي أبهمت فقيل كانت تضيء له بالليل وتحرس له الغنم إذا نام ويغرسها فتصير شجرة تظله وغير ذلك من الأمور الخارقة للعادة والظاهر أنها لم تكن كذلك ولو كانت كذلك لما استنكر موسى عليه الصلاة والسلام صيرورتها ثعبانا فما كان يفر منها هاربا ولكن كل ذلك من الأخبار الإسرائيلية وكذا قول بعضهم إنها كانت لآدم عليه الصلاة والسلام وقول الآخر إنها هي الدابة التي تخرج قبل يوم القيامة وروي عن ابن عباس أنه قال كان اسمها ما شاء والله أعلم بالصواب."
    },
    { "ayah": 19, "surah": 20, "text": "وقوله تعالى \"قال ألقها يا موسى\" أي هذه العصا التي في يدك يا موسى ألقها." },
    {
      "ayah": 2,
      "surah": 20,
      "text": "قوله\"ما أنزلنا عليك القرآن لتشقى\" قال جويبر عن الضحاك لما أنزل الله القرآن على رسوله صلى الله عليه وسلم قام به هو وأصحابه فقال المشركون من قريش ما أنزل هذا القرآن على محمد إلا ليشقى فأنزل الله تعالى طه ما أنزلنا عليك القرآن لتشقى إلا تذكرة لمن يخشى فليس الأمر كما زعمه المبطلون بل من آتاه الله العلم فقد أراد به خيرا كثيرا كما ثبت في الصحيحين عن معاوية قال: قال رسول الله صلى الله عليه وسلم \" من يرد الله به خيرا يفقهه في الدين \" وما أحسن الحديث الذي رواه الحافظ أبو القاسم الطبراني في ذلك حيث قال حدثنا أحمد بن زهير حدثنا العلاء بن سالم حدثنا إبراهيم الطالقانى حدثنا ابن المبارك عن سفيان عن سماك بن حرب عن ثعلبة بن الحكم قال: قال رسول الله صلى الله عليه وسلم \" يقول الله تعالى للعلماء يوم القيامة إذا قعد على كرسيه لقضاء عباده إني لم أجعل علمي وحكمتي فيكم إلا وأنا أريد أن أغفر لكم على ما كان منكم ولا أبالي \" إسناده جيد وثعلبة بن الحكم هذا هو الليثي ذكره أبو عمر في استيعابه وقال نزل البصرة ثم تحول إلى الكوفة وروى عنه سماك بن حرب وقال مجاهد في قوله {ما أنزلنا عليك القرآن لتشقى هي كقوله فاقرءوا ما تيسر منه وكانوا يعلقون الحبال بصدورهم في الصلاة وقال قتادة \"ما أنزلنا عليك القرآن لتشقى\" لا والله ما جعله شقاء ولكن جعله رحمة ونورا ودليلا إلى الجنة."
    },
    {
      "ayah": 20,
      "surah": 20,
      "text": "\"فألقاها فإذا هي حية تسعي\" أي صارت في الحال حية عظيمة ثعبانا طويلا يتحرك حركة سريعة فإذا هي تهتز كأنها جان وهو أسرع الحيات حركة ولكنه صغير فهذه في غاية الكبر وفي غاية سرعة الحركة تسعى أي تمشي وتضطرب قال ابن أبي حاتم حدثنا أبي حدثنا أحمد بن عبدة حدثنا حفص بن جميع حدثنا سماك عن عكرمة عن ابن عباس فألقاها فإذا هي حية تسعى ولم تكن قبل ذلك حية فمرت بشجرة فأكلتها ومرت بصخرة فابتلعتها فجعل موسى يسمع وقع الصخرة في جوفها فولى مدبرا ونودي أن يا موسى خذها فلم يأخذها ثم نودي الثانية أن خذها ولا تخف فقيل له في الثالثة إنك من الآمنين فأخذها.وقال وهب بن منبه في قوله فألقاها فإذا هي حية تسعى قال فألقاها على وجه الأرض ثم حانت منه نظرة فإذا بأعظم ثعبان نظر إليه الناظرون يدب يلتمس كأنه يبتغي شيئا يريد أخذه يمر بالصخرة مثل الخلفة من الإبل فيلتقمها ويطعن بالناب من أنيابه في أصل الشجرة العظيمة فيجتثها عيناه تتقدان نارا وقد عاد المحجن منها عرفا قيل شعر مثل النيازك وعاد الشعبتان فما مثل القليب الواسع فيه أضراس وأنياب لها صريف فلما عاين ذلك موسى ولى مدبرا ولم يعقب فذهب حتى أمعن ورأى أنه قد أعجز الحية ثم ذكر ربه فوقف استحياء منه مم نودي يا موسى أن ارجع حيث كنت فرجع موسى وهو شديد الخوف فقال خذها بيمينك."
    },
    {
      "ayah": 21,
      "surah": 20,
      "text": "بأخذها لف طرف المدرعة على يده فقال له ملك: أرأيت يا موسى لو أذن الله بما تحاذر أكانت المدرعة تغني عنك شيئا قال لا ولكني ضعيف ومن ضعف خلقت فكشف عن يده ثم وضعها على فم الحية حتى سمع حس الأضراس والأنياب ثم قبض فإذا هي عصاه التي عهدها وإذا يده في موضعها الذي كان يضعها إذا توكأ بين الشعبتين ولهذا قال تعالى سنعيدها سيرتها الأولى أي إلى حالها التى تعرف قبل ذلك."
    },
    {
      "ayah": 22,
      "surah": 20,
      "text": "وهذا برهان ثان لموسى عليه السلام وهو أن الله أمره أن يدخل يده في جيبه كما صرح به في الآية الأخرى وههنا عبر عن ذلك بقوله واضمم يدك إلى جناحك وقال في مكان آخر واضمم إليك جناحك من الرهب فذانك برهانان من ربك إلى فرعون وملئه وقال مجاهد واضمم يدك إلى جناحك كفك تحت عضدك وذلك أن موسى عليه السلام كان إذا أدخل يده في جيبه ثم أخرجها تخرج تتلألأ كأنها فلقة قمر وقوله تخرج بيضاء من غير سوء\" أي من غير برص ولاأذى ومن غير شين قاله ابن عباس ومجاهد وعكرمة وقتادة والضحاك والسدي وغيرهم وقال الحسن البصري أخرجها والله كأنها مصباح فعلم موسى أنه قد لقي ربه عز وجل."
    },
    {
      "ayah": 23,
      "surah": 20,
      "text": "ولهذا قال تعالى \"لنريك من آياتنا الكبرى\" وقال وهب قال له ربه: أدنه فلم يزل يدنيه حتى أسند ظهره بجذع الشجرة فاستقر وذهبت عنه الرعدة وجمع يده في العصا وخضع برأسه وعنقه."
    },
    {
      "ayah": 24,
      "surah": 20,
      "text": "وقوله\"اذهب إلى فرعون إنه طغى\" أي اذهب إلى فرعون ملك مصر الذى خرجت فارا منه وهاربا فادعه إلى عبادة الله وحده لا شريك له ومره فليحسن إلى بني إسرائيل ولا يعذبهم قإنه قد طغى وبغى وآثر الحياة الدنيا ونسي الرب الأعلى.قال وهب بن منبه \" قال الله لموسى انطلق برسالتي فإنك بسمعي وعيني وإن معك يدي وبصري وإني قد ألبستك جنة من سلطاني لتستكمل بها القوة في أمري فأنت جند عظيم من جندي بعثتك إلى خلق ضعيف من خلق بطر نعمتي وأمن مكري وغرته الدنيا عني حتى جحد حقي وأنكر ربوبيتي وزعم أنه لا يعرفني فإني أقسم بعزتي لولا القدر الذي وضعت بيني وبين خلقي لبطشت به بطشة جبار يغضب لغضبه السموات والأرض والجبال والبحار فإن أمرت السماء حصبته وإن أمرت الأرض ابتلعته وإن أمرت الجبال دمرته وإن أمرت البحار غرقته ولكنه هان علي وسقط من عيني ووسعه حلمي واستغنيت بما عندي وحقي أني أنا الغني لا غني غيري فبلغه رسالتي وادعه إلى عبادتي وتوحيدي وإخلاصي وذكره أيامي وحذره نقمتى وبأسي وأخبره أنه لا يقوم شيء لغضبي وقل له فيما بين ذلك قولا لينا لعله يتذكر أو يخشى وأخبره أني إلى العفو والمغفرة أسرع مني إلى الغضب والعقوبة ولا يروعنك ما ألبسته من لباس الدنيا فإن ناصيته بيدي ليس ينطق ولا يطرف ولا يتنفس إلا بإذني وقل له أجب ربك فإنه واسع المغفرة وقد أمهلك أربعمائة سنة في كلها أنت مبارزه بالمحاربة تسبه وتتمثل به وتصد عباده عن سبيله وهو يمطر عليك السماء وينبت لك الأرض لم تسقم ولم تهرم ولم تفتقر ولم تغلب ولو شاء الله أن يعجل لك العقوبة لفعل ولكنه ذو أناة وحلم عظيم وجاهده بنفسك وأخيك وأنتما تحتسبان بجهاده فإني لو شئت أن آتيه بجنود لا قبل له بها لفعلت ولكن ليعلم هذا العبد الضعيف الذي قد أعجبته نفسه وجموعه أن الفئة القليلة ولا قليل مني تغلب الفئة الكثيرة بإذني ولا تعجبنكما زينته ولا ما متع به ولا تمدا إلى ذلك أعينكما فإنها زهرة الحياة الدنيا وزينة المترفين ولو شئت أن أزينكما من الدنيا بزينة ليعلم فرعون حين ينظر إليها أن مقدرته تعجز عن مثل ما أوتيتما فعلت ولكني أرغب بكما عن ذلك وأزويه عنكما وكذلك أفعل بأوليائي وقديما ما جرت عادتي في ذلك فإني لأذودهم عن نعيمها وزخارفها كما يذود الراعي الشفيق إبله عن مبارك الغرة وما ذاك لهوانهم علي ولكن ليستكملوا نصيبهم في دار كرامتي سالما موفرا لم تكلمه الدنيا واعلم أنه لا يتزين لي العباد بزينة هي أبلغ فيما عندي من الزهد في الدنيا فإنها زينة المتقين عليهم منها لباس يعرفون به من السكينة والخشوع وسيماهم في وجوههم من أثر السجود أولئك أوليائي حقا حقا فإذا لقيتهم فاخفض لهم جناحك وذلل قلبك ولسانك واعلم أنه من أهان لي وليا أو أخافه فقد بارزني بالمحاربة وبادأني وعرض لي نفسه ودعاني إليها وأنا أسرع شيء إلى نصرة أوليائي أفيظن الذي يحاربني أن يقوم لي أم يظن الذي يعاديني أن يعجزني أم يظن الذي يبارزني أن يسبقني أو يفوتني وكيف وأنا الثائر لهم في الدنيا والآخرة لا أكل نصرتهم إلى غيري \" رواه ابن أبي حاتم."
    },
    {
      "ayah": 25,
      "surah": 20,
      "text": "\"قال رب اشرح لي صدري ويسر لي أمري\" هذا سؤال من موسى عليه السلام لربه عز وجل أن يشرح له صدره فيما بعثه به فإنه قد أمره بأمر عظيم وخطب جسيم: بعثه إلى أعظم ملك على وجه الأرض إذ ذاك وأجبرهم وأشدهم كفرا وأكثرهم جنودا وأعمرهم ملكا وأطغاهم وأبلغهم تمردا بلغ من أمره أن ادعى أنه لا يعرف الله ولا يعلم لرعاياه إلها غيره وهذا وقد مكث موسى في داره مدة وليدا عندهم في حجر فرعون على فراشه ثم قتل منهم نفسا فخافهم أن يقتلوه فهرب منهم هذه المدة بكمالها ثم بعد هذا بعثه ربه عز وجل إليهم نذيرا يدعوهم إلى الله عز وجل أن يعبدوه وحده لا شريك له."
    },
    {
      "ayah": 26,
      "surah": 20,
      "text": "قال \"رب اشرح لي صدري ويسر لي أمر\" أي إن لم تكن أنت عوني ونصيري وعضدي وظهيري وإلا فلا طاقة لي بذلك."
    },
    {
      "ayah": 27,
      "surah": 20,
      "text": "\"واحلل عقدة من لساني يفقهوا قولي\" وذلك لما كان أصابه من اللثغ حين عرض عليه التمرة والجمرة فأخذ الجمرة فوضعها على لسانه كما سيأتي بيانه وما سأل أن يزول ذلك بالكلية بل بحيث يزول العي ويحصل لهم فهم ما يريد منه وهو قدر الحاجة ولو سأل الجميع لزال ولكن الأنبياء لا يسألون إلا بحسب الحاجة ولهذا بقيت بقية قال الله تعالى إخبارا عن فرعون أنه قال أم أنا خير من هذا الذي هو مهين ولا يكاد يبين أي يفصح بالكلام وقال الحسن البصري واحلل عقدة من لساني قال حل عقدة واحدة ولو سأل أكثر من ذلك أعطي وقال ابن عباس شكا موسى إلى ربه ما يتخوف من آل فرعون في القتيل وعقدة لسانه فإنه كان في لسانه عقدة تمنعه من كثير من الكلام وسأل ربه أن يعينه بأخيه هارون يكون له ردءا ويتكلم عنه بكثير مما لا يفصح به لسانه فآتاه سؤله فحل عقدة من لسانه وقال ابن أبي حاتم ذكر عن عمر بن عثمان حدثنا بقية عن أرطاة بن المنذر حدثني بعض أصحاب محمد ابن كعب عنه قال أتاه ذو قرابة له فقال له ما بك بأس لولا أنك تلحن في كلامك ولست تعرب في قراءتك فقال القرظي يا ابن أخي ألست أفهمك إذا حدثتك.قال نعم قال فإن موسى عليه السلام إنما سأل ربه أن يحلل عقدة من لسانه كي يفقه بنو إسرائيل كلامه ولم يزد عليها هذا لفظه."
    },
    {
      "ayah": 28,
      "surah": 20,
      "text": "\" يفقهوا قولي\" وذلك لما كان أصابه من اللثغ حين عرض عليه التمرة والجمرة فأخذ الجمرة فوضعها على لسانه كما سيأتي بيانه وما سأل أن يزول ذلك بالكلية بل بحيث يزول العي ويحصل لهم فهم ما يريد منه وهو قدر الحاجة ولو سأل الجميع لزال ولكن الأنبياء لا يسألون إلا بحسب الحاجة ولهذا بقيت بقية قال الله تعالى إخبارا عن فرعون أنه قال أم أنا خير من هذا الذي هو مهين ولا يكاد يبين أي يفصح بالكلام وقال الحسن البصري واحلل عقدة من لساني قال حل عقدة واحدة ولو سأل أكثر من ذلك أعطي وقال ابن عباس شكا موسى إلى ربه ما يتخوف من آل فرعون في القتيل وعقدة لسانه فإنه كان في لسانه عقدة تمنعه من كثير من الكلام وسأل ربه أن يعينه بأخيه هارون يكون له ردءا ويتكلم عنه بكثير مما لا يفصح به لسانه فآتاه سؤله فحل عقدة من لسانه وقال ابن أبي حاتم ذكر عن عمر بن عثمان حدثنا بقية عن أرطاة بن المنذر حدثني بعض أصحاب محمد ابن كعب عنه قال أتاه ذو قرابة له فقال له ما بك بأس لولا أنك تلحن في كلامك ولست تعرب في قراءتك فقال القرظي يا ابن أخي ألست أفهمك إذا حدثتك.قال نعم قال فإن موسى عليه السلام إنما سأل ربه أن يحلل عقدة من لسانه كي يفقه بنو إسرائيل كلامه ولم يزد عليها هذا لفظه."
    },
    {
      "ayah": 29,
      "surah": 20,
      "text": "وقوله\"واجعل لي وزيرا من أهلي هارون أخي\" وهذا أيضا سؤال من موسى عليه السلام في أمر خارجي عنه وهو مساعدة أخيه هارون له.قال الثوري عن أبي سعيد عن عكرمة عن ابن عباس أنه قال: نبئ هارون ساعتئذ حين نبئ موسى عليهما السلام وقال ابن أبي حاتم ذكر عن ابن نمير حدثنا أبو أسامة عن هشام بن عروة عن أبيه عن عائشة أنها خرجت فيما كانت تعتمر فنزلت ببعض الأعراب فسمعت رجلا يقول أي أخ كان في الدنيا أنفع لأخيه ؟ قالوا لا ندري قال أنا والله أدري ؟ قالت فقلت في نفسي في حلفه لا يستثني إنه ليعلم أي أخ كان في الدنيا أنفع لأخيه قال موسى حين سأل لأخيه النبوة فقلت صدق والله قلت ومن هذا قال الله تعالى في الثناء على موسى عليه السلام \"وكان عند الله وجيها\"."
    },
    { "ayah": 3, "surah": 20, "text": "وهو ذكر أنزل الله فيه حلاله وحرامه." },
    {
      "ayah": 30,
      "surah": 20,
      "text": "وقوله\"واجعل لي وزيرا من أهلي هارون أخي\" وهذا أيضا سؤال من موسى عليه السلام فى أمر خارجى عنه وهو مساعدة أخيه هارون له.قال الثوري عن أبي سعيد عن عكرمة عن ابن عباس أنه قال: نبئ هارون ساعتئذ حين نبئ موسى عليهما السلام وقال ابن أبي حاتم ذكر عن ابن نمير حدثنا أبو أسامة عن هشام بن عروة عن أبيه عن عائشة أنها خرجت فيما كانت تعتمر فنزلت ببعض الأعراب فسمعت رجلا يقول أي أخ كان في الدنيا أنفع لأخيه ؟ قالوا لا ندري قال أنا والله أدري ؟ قالت فقلت في نفسي في حلفه لا يستثني إنه ليعلم أي أخ كان في الدنيا أنفع لأخيه قال موسى حين سأل لأخيه النبوة فقلت صدق والله قلت ومن هذا قال الله تعالى في الثناء على موسى عليه السلام \"وكان عند الله وجيها\"."
    },
    { "ayah": 31, "surah": 20, "text": "وقوله \"اشدد به أزري\" قال مجاهد ظهري." },
    { "ayah": 32, "surah": 20, "text": "\"وأشركه في أمري\" أي في مشاورتي." },
    {
      "ayah": 33,
      "surah": 20,
      "text": "\"كي نسبحك كثيرا ونذكرك كثيرا\" قال مجاهد لا يكون العبد من الذاكرين الله كثيرا حتى يذكر الله قائما وقاعدا ومضطجعا."
    },
    {
      "ayah": 34,
      "surah": 20,
      "text": "\" ونذكرك كثيرا\" قال مجاهد لا يكون العبد من الذاكرين الله كثيرا حتى يذكر الله قائما وقاعدا ومضطجعا."
    },
    {
      "ayah": 35,
      "surah": 20,
      "text": "وقوله\"إنك كنت بنا بصيرا\" أي في اصطفائك لنا وإعطائك إيانا النبوة وبعثتك لنا إلى عدوك فرعون فلك الحمد على ذلك."
    },
    {
      "ayah": 36,
      "surah": 20,
      "text": "هذا إجابة من الله لرسوله موسى عليه السلام فيما سأل من ربه عز وجل وتذكير له بنعمه السالفة عليه فيما كان من أمر أمه حين كانت ترضعه وتحذر عليه من فرعون وملئه أن يقتلوه لأنه كان قد ولد في السنة التي يقتلون فيهاالغلمان فاتخذت له تابوتا فكانت ترضعه ثم تضعه فيه وترسله في البحر وهوالنيل وتمسكه إلى منزلها بحبل فذهبت مرة لتربط الحبل فانفلت منها وذهب به البحر فحصل لها من الغم والهم ما ذكره الله عنها في قوله وأصبح فؤاد أم موسى فارغا إن كانت لتبدي به لولا أن ربطنا على قلبها فذهب به البحر إلى دار فرعون فالتقطه آل فرعون ليكون لهم عدوا وحزنا أي قدرا مقدورا من الله حيث كانوا هم يقتلون الغلمان من بني إسرائيل حذرا من وجود موسى فحكم الله وله السلطان العظيم والقدرة التامة أن لا يربى إلا على فراش فرعون ويغذى بطعامه وشرابه مع محبته وزوجته له."
    },
    {
      "ayah": 37,
      "surah": 20,
      "text": "هذا إجابة من الله لرسوله موسى عليه السلام فيما سأل من ربه عز وجل وتذكير له بنعمه السالفة عليه فيما كان من أمر أمه حين كانت ترضعه وتحذر عليه من فرعون وملئه أن يقتلوه لأنه كان قد ولد في السنة التي يقتلون فيهاالغلمان فاتخذت له تابوتا فكانت ترضعه ثم تضعه فيه وترسله في البحر وهوالنيل وتمسكه إلى منزلها بحبل فذهبت مرة لتربط الحبل فانفلت منها وذهب به البحر فحصل لها من الغم والهم ما ذكره الله عنها في قوله وأصبح فؤاد أم موسى فارغا إن كانت لتبدى به لولا أن ربطنا على قلبها\" فذهب به البحر إلى دار فرعون فالتقطه آل فرعون ليكون لهم عدوا وحزنا\" أي قدرا مقدورا من الله حيث كانوا هم يقتلون الغلمان من بني إسرائيل حذرا من وجود موسى فحكم الله وله السلطان العظيم والقدرة التامة أن لا يربى إلا على فراش فرعون ويغذى بطعامه وشرابه مع محبته وزوجته له."
    },
    {
      "ayah": 38,
      "surah": 20,
      "text": "هذا إجابة من الله لرسوله موسى عليه السلام فيما سأل من ربه عز وجل وتذكير له بنعمه السالفة عليه فيما كان من أمر أمه حين كانت ترضعه وتحذر عليه من فرعون وملئه أن يقتلوه لأنه كان قد ولد في السنة التي يقتلون فيهاالغلمان فاتخذت له تابوتا فكانت ترضعه ثم تضعه فيه وترسله في البحر وهوالنيل وتمسكه إلى منزلها بحبل فذهبت مرة لتربط الحبل فانفلت منها وذهب به البحر فحصل لها من الغم والهم ما ذكره الله عنها في قوله وأصبح فؤاد أم موسى فارغا إن كانت لتبدى به لولا أن ربطنا على قلبها\" فذهب به البحر إلى دار فرعون فالتقطه آل فرعون ليكون لهم عدوا وحزنا\" أي قدرا مقدورا من الله حيث كانوا هم يقتلون الغلمان من بني إسرائيل حذرا من وجود موسى فحكم الله وله السلطان العظيم والقدرة التامة أن لا يربى إلا على فراش فرعون ويغذى بطعامه وشرابه مع محبته وزوجته له."
    },
    {
      "ayah": 39,
      "surah": 20,
      "text": "هذا إجابة من الله لرسوله موسى عليه السلام فيما سأل من ربه عز وجل وتذكير له بنعمه السالفة عليه فيما كان من أمر أمه حين كانت ترضعه وتحذر عليه من فرعون وملئه أن يقتلوه لأنه كان قد ولد في السنة التي يقتلون فيهاالغلمان فاتخذت له تابوتا فكانت ترضعه ثم تضعه فيه وترسله في البحر وهوالنيل وتمسكه إلى منزلها بحبل فذهبت مرة لتربط الحبل فانفلت منها وذهب به البحر فحصل لها من الغم والهم ما ذكره الله عنها في قوله وأصبح فؤاد أم موسى فارغا إن كانت لتبدى به لولا أن ربطنا على قلبها\" فذهب به البحر إلى دار فرعون فالتقطه آل فرعون ليكون لهم عدوا وحزنا\" أي قدرا مقدورا من الله حيث كانوا هم يقتلون الغلمان من بني إسرائيل حذرا من وجود موسى فحكم الله وله السلطان العظيم والقدرة التامة أن لا يربى إلا على فراش فرعون ويغذى بطعامه وشرابه مع محبته وزوجته لهولهذا قال الله تعالى\"يأخذه عدو لي وعدو له وألقيت عليك محبة مني\" أي عند عدوك جعلته يحبك قال سلمة بن كهيل وألقيت عليك محبة مني قال حببتك إلى عبادي ولتصنع على عيني قال أبو عمران الجونى تربى بعين الله وقال قتادة تغذى على عيني وقال معمر بن المثنى ولتصنع على عيني بحيث أرى وقال عبد الرحمن بن زيد بن أسلم يعني أجعله في بيت الملك ينعم ويترف وغذاؤه عندهم غذاء الملك فتلك الصنعة."
    },
    {
      "ayah": 4,
      "surah": 20,
      "text": "وقوله \"تنزيلا ممن خلق الأرض والسموات العلى\" أي هذا القرآن الذي جاءك يا محمد هو تنزيل من ربك رب كل شيء ومليكه القادر على ما يشاء الذي خلق الأرض بانخفاضها وكثافتها وخلق السموات العلى في ارتفاعها ولطافتها وقد جاء في الحديث الذي صححه الترمذي وغيره أن سمك كل سماء مسيرة خمسمائة عام وبعد ما بينها والتي تليها مسيرة خمسمائة عام وقد أورد ابن أبي حاتم ههنا حديث الأوعال من رواية العباس عم رسول الله صلى الله عليه وسلم و رضي الله عنه."
    },
    {
      "ayah": 40,
      "surah": 20,
      "text": "وقوله \"إذ تمشي أختك فتقول هل أدلكم على من يكفله فرجعناك إلى أمك كي تقر عينها\" وذلك أنه لما استقر عند آل فرعون عرضوا عليه المراضع فأباها قال الله تعالى\" وحرمنا عليه المراضع من قبل\" فجاءت أخته وقالت هل أدلكم على أهل بيت يكفلونه لكم وهم له ناصحون تعني هل أدلكم على من يرضعه لكم بالأجرة فذهبت به وهم معها إلى أمه فعرضت عليه ثديها فقبله ففرحوا بذلك فرحا شديدا واستأجروها على إرضاعه فنالها بسببه سعادة ورفعة وراحة في الدنيا وفي الآخرة أعظم وأجزل ولهذا جاء في الحديث \" مثل الصانع الذي يحتسب في صنعته الخير كمثل أم موسى ترضع ولدها وتأخذ أجرها \"وقال تعالى ههنا فرجعناك إلى أمك كي تقر عينها ولا تحزن أي عليك وقتلت نفسا يعني القبطي فنجيناك من الغم وهو ما حصل له بسبب عزم آل فرعون على قتله ففر منهم هاربا حتى ورد ماء مدين وقال له ذلك الرجل الصالح لا تخف نجوت من القوم الظالمين وقوله وفتناك فتونا قال الإمام أبو عبد الرحمن أحمد بن شعيب النسائي رحمه الله في كتاب التفسير من سننه قوله وفتناك فتونا \" حديث الفتون \"حدثنا عبدالله بن محمد حدثنا يزيد بن هارون أنبأنا أصبغ ابن زيد حدثنا القاسم بن أبي أيوب أخبرني سعيد بن جبير قال: سألت عبدالله بن عباس عن قول الله عز وجل لموسى عليه السلام وفتناك فتونا فسألته عن الفتون ما هو فقال استأنف النهار يا ابن جبير فإن لها حديثا طويلا فلما أصبحت غدوت إلى ابن عباس لأنتجز منه ما وعدني من حديث الفتون فقال تذاكر فرعون وجلساؤه ما كان الله وعد إبراهيم عليه السلام أن يجعل في ذمته أبناء وملوكا فقال بعضهم إن بني إسرائيل ينتظرون ذلك لا يشكون فيه وكانوا يظنون أنه يوسف بن يعقوب فلما هلك قالوا ليس هكذا كان وعد إبراهيم فقال فرعون كيف ترون فائتمروا وأجمعوا أمرهم على أن يبعث رجالا معهم الشفار يطوفون في بني إسرائيل فلا يجدون مولودا ذكرا إلا ذبحوه ففعلوا ذلك فلما رأوا أن الكبار من بني إسرائيل يموتون بآجالهم والصغار يذبحون قالوا ليوشكن أن تفنوا بني إسرائيل فتصيروا إلى أن تباشروا من الأعمال والخدمة التي يكفونكم فاقتلوا عاما كل مولود ذكرا واتركوا بناتهم ودعوا عاما فلا تقتلوا منهم أحدا فيشب الصغار مكان من يموت من الكبار فإنهم لن يكثروا بمن تستحيون منهم فتخافوا مكاثرتهم وإياكم ولم يفنوا بمن تقتلون وتحتاجون إليهم فأجمعوا أمرهم على ذلك فحملت أم موسى بهارون في العام الذي لا يذبح فيه الغلمان فولدته علانية آمنة فلما كان من قابل حملت بموسى عليه السلام فوقع في قلبها الهم والحزن وذلك من الفتون يا ابن جبير ما دخل عليه وهو في بطن أمه مما يراد به فأوحى الله إليها أن لا تخافي ولا تحزني إنا رادوه إليك وجاعلوه من المرسلين فأمرها إذا ولدت أن تجعله في تابوت ثم تلقيه في اليم فلما ولدت فعلت ذلك فلما توارى عنها ابنها أتاها الشيطان فقالت في نفسها ما فعلت بابني لو ذبح عندي فواريته وكفنته كان أحب إلي من أن ألقيه إلى دواب البحر وحيتانه فانتهى الماء به حتى أوفى به عند فرضة مستقي جواري امرأة فرعون فلما رأينه أخذنه فأردن أن يفتحن التابوت فقال بعضهن إن في هذا مالا وإنا إن فتحناه لم تصدقنا امرأة الملك بما وجدنا فيه فحملنه كهيئته لم يخرجن منه شيئا حتى دفعنه إليها فلما فتحته رأت فيه غلاما فألقى الله عليه منها محبة لم يلق منها على أحد قط وأصبح فؤاد أم موسى فارغا من ذكر كل شئ إلا من ذكر موسى فلما سمع الذباحون بأمره أقبلوا بشفارهم إلى امرأة فرعون ليذبحوه وذلك من الفتون يا ابن جبير فقالت لهم أقروه فإن هذا الواحد لا يزيد في بني إسرائيل حتى آتي فرعون فأستوهبه منه فإن وهبه لي كنتم قد أحسنتم وأجملتم وإن أمر بذبحه لم ألمكم فأتت فرعون فقالت قرة عين لي ولك فقال فرعون يكون لك فأما لي فلا حاجة لي فيه فقال رسول الله صلى الله عليه وسلم \" والذي يحلف به لو أقر فرعون أن يكون قرة عين له كما أقرت امرأته لهداه الله كما هداها ولكن حرمه ذلك \" فأرسلت إلى من حولها إلى كل امرأة لها لأن تختار له ظئرا فجعل كلما أخذته امرأة منهن لترضعه لم يقبل على ثديها حتى أشفقت امرأة فرعون أن يمتنع من اللبن فيموت فأحزنها ذلك فأمرت به فأخرج إلى السوق ومجمع الناس ترجو أن تجد له ظئرا تأخذه منها فلم يقبل وأصبحت أم موسى والها فقالت لأخته قصي أثره واطلبيه هل تسمعين له ذكرا أحي ابني أم قد أكلته الدواب ونسيت ما كان الله وعدها فيه فبصرت به أخته عن جنب وهم لا يشعرون والجنب أن يسمو بصر الإنسان إلى شيء بعيد وهو إلى جنبه وهو لا يشعر به فقالت من الفرح حين أعياهم الظؤرات أنا أدلكم على أهل بيت يكفلونه لكم وهم له ناصحون فأخذوها فقالوا ما يدريك ما نصحهم له هل تعرفينه ؟ حتى شكوا في ذلك وذلك من الفتون يا ابن جبير فقالت نصحهم له وشفقتهم عليه رغبتهم في صهر الملك ورجاء منفعة الملك فتركوها فانطلقت إلى أمها فأخبرتها الخبر فجاءت أمه فلما وضعته في حجرها نزا إلى ثديها فمصه حتى امتلأ جنباه ريا وانطلق البشير إلى امرأة فرعون يبشرونها أن قد وجدنا لابنك ظئرا فأرسلت إليها فأتت بها وبه فلما رأت ما يصنع بها قالت امكثي ترضعي ابني هذا فإني لم أحب شيئا حبه قط قالت أم موسى لا أستطيع أن أدع بيتي وولدي فيضيع فإن طابت نفسك أن تعطينيه فأذهب به إلى بيتي فيكون معي لا آلوه خيرا فإني غير تاركة بيتي وولدي وذكرت أم موسى ما كان الله وعدها فيه فتعاسرت على امرأة فرعون وأيقنت أن الله منجز وعده فرجعت به إلى بيتها من يومها وأنبته الله نباتا حسنا وحفظه لما قد قضى فيه فلم يزل بنو إسرائيل وهم في ناحية القرية ممتنعين من السخرة والظلم ما كان فيهم فلما ترعرع قالت امرأة فرعون لأم موسى أزيريني ابني فدعتها يوما تزيرها إياه فيه وقالت امرأة فرعون لخزانها وظؤرها وقهارمتها لا يبقين أحد منكم إلا استقبل ابني اليوم بهدية وكرامة لأرى ذلك وأنا باعثة أمينا يحصي ما يصنع كل إنسان منكم فلم تزل الهدايا والكرامة والنحل تستقبله من حين خرج من بيت أمه إلى أن دخل على امرأة فرعون فلما دخل عليها بجلته وأكرمته وفرحت به ونحلت أمه لحسن أثرها عليه ثم قالت لآتين به فرعون فلينحلنه وليكرمنه فلما دخلت به عليه جعله في حجره فتناول موسى لحية فرعون فمدها إلى الأرض فقال الغواة من أعداء الله لفرعون ألا ترى ما وعد الله إبراهيم نبيه أنه زعم أن يرثك ويعلوك ويصرعك فأرسل إلى الذباحين ليذبحوه وذلك من الفتون يا ابن جبير بعد كل بلاء ابتلي به وأريد به فتونا فجاءت امرأة فرعون فقالت ما بدا لك في هذا الغلام الذي وهبته لي ؟ فقال ألا ترينه يزعم أنه يصرعني ويعلوني فقالت اجعل بيني وبينك أمرا يعرف الحق به ائت بجمرتين ولؤلؤتين فقدمهن إليه فإن بطش باللؤلؤتين واجتنب الجمرتين عرفت أنه يعقل وإن تناول الجمرتين ولم يرد اللؤلؤتين علمت أن أحدا لا يؤثر الجمرتين على اللؤلؤتين وهو يعقل فقرب إليه الجمرتين واللؤلؤتين فتناول الجمرتين فانتزعهما منه مخافة أن يحرقا يده فقالت المرأة: ألا ترى فصرفه الله عنه بعدما كان قد هم به وكان الله بالغا فيه أمره فلما بلغ أشده وكان من الرجال لم يكن أحد من آل فرعون يخلص إلى أحد من بني إسرائيل معه بظلم ولا سخرة حتى امتنعوا كل الامتناع فبينما موسى عليه السلام يمشي في ناحية المدينة إذا هو برجلين يقتتلان أحدهما فرعوني والآخر إسرائيلي فاستغاثه الإسرائيلي على الفرعوني فغضب موسى غضبا شديدا لأنه تناوله وهو يعلم منزلته من بني إسرائيل وحفظه لهم لا يعلم الناس إلا إنما ذلك من الرضاع إلا أم موسى إلا أن يكون الله أطلع موسى من ذلك على ما لم يطلع عليه غيره فوكز موسى الفرعوني فقتله وليس يراهما أحد إلا الله عز وجل والإسرائيلي فقال موسى حين قتل الرجل هذا من عمل الشيطان إنه عدو مضل مبين ثم قال رب إني ظلمت نفسي فاغفر لي فغفر له إنه هو الغفور الرحيم فأصبح في المدينة خائفا يترقب الأخبار فأتي فرعون فقيل له إن بني إسرائيل قتلوا رجلا من آل فرعون فخذ لنا بحقنا ولا ترخص لهم فقال ابغونى قاتله ومن يشهد عليه فإن الملك وإن كان صفوة مع قومه لا يستقيم له أن يقيد بغير بينة ولا ثبت فاطلبوا لي علم ذلك آخذ لكم بحقكم فبينما هم يطوفون لا يجدون ثبتا إذا بموسى من الغد قد رأى ذلك الإسرائيلى يقاتل رجلا من آل فرعون آخر فاستغاثه الإسرائيلي على الفرعوني فصادف موسى فندم على ما كان منه وكره الذي رأى فغضب الإسرائيلي وهو يريد أن يبطش بالفرعوني فقال للإسرائيلي لما فعل بالأمس واليوم إنك لغوي مبين فنظر الإسرائيلي إلى موسى بعدما قال له ما قال فإذا هو غضبان كغضبه بالأمس الذي قتل فيه الفرعوني فخاف أن يكون بعدما قال له إنك لغوي مبين أن يكون إياه أراد ولم يكن أراده إنما أراد الفرعوني فخاف الإسرائيلي وقال يا موسى أتريد أن تقتلني كما قتلت نفسا بالأمس وإنما قاله مخافة أن يكون إياه أراد موسى ليقتله فتتاركا وانطلق الفرعوني فأخبرهم بما سمع من الإسرائيلي من الخبر حين يقول يا موسى أتريد أن تقتلني كما قتلت نفسا بالأمس فأرسل فرعون الذباحين ليقتلوا موسى فأخذ رسل فرعون في الطريق الأعظم يمشون على هينتهم يطلبون موسى وهم لا يخافون أن يفوتهم فجاء رجل من شيعة موسى من أقصى المدينة فاختصر طريقا حتى سبقهم إلى موسى فأخبره وذلك من الفتون يا ابن جبير فخرج موسى متوجها نحو مدين ولم يلق بلاء قبل ذلك وليس له بالطريق علم إلا حسن ظنه بربه عز وجل فإنه قال عسى ربي أن يهديني سواء السبيل ولما ورد ماء مدين وجد عليه أمة من الناس يسقون ووجد من دونهم امرأتين تذودان يعني بذلك حابستين غنمهما فقال لهما ما خطبكما معتزلتين لا تسقيان مع الناس ؟ قالتا ليس لنا قوة نزاحم القوم وإنما نسقي من فضول حياضهم فسقى لهما فجعل يغترف في الدلو ماء كثيرا حتى كان أول الرعاء فانصرفتا بغنمهما إلى أبيهما وانصرف موسى فاستظل بشجرة وقال ربي إني لما أنزلت إلي من خير فقير واستنكر أبوهما سرعة صدورهما بغنمهما حفلا بطانا فقال إن لكما اليوم لشأنا فأخبرتاه بما صنع موسى فأمر إحداهما أن تدعوه فأتت موسى فدعته فلما كلمه قال لا تخف نجوت من القوم الظالمين ليس لفرعون ولا لقومه علينا سلطان ولسنا في مملكته فقالت إحداهما يا أبت استأجره إن خير من استأجرت القوي الأمين فاحتملته الغيرة على أن قال لها ما يدريك ما قوته وما أمانته فقالت أما قوته فما رأيت منه في الدلو حين سقى لنا لم أر رجلا قط أقوى في ذلك السقي منه وأما الأمانة فإنه نظر إلي حين أقبلت إليه وشخصت له فلما علم أني امرأة صوب رأسه فلم يرفعه حتى بلغته رسالتك ثم قال لي امشي خلفي وانعتي لي الطريق فلم يفعل هذا إلا وهو أمين فسري عن أبيها وصدقها وظن به الذي قالت فقال له هل لك أن أنكحك إحدى ابنتي هاتين على أن تأجرني ثماني حجج فإن أتممت عشرا فمن عندك وما أريد أن أشق عليك ستجدني إن شاء الله من الصالحين ففعل فكانت على نبي الله موسى ثمان سنين واجبة وكانت سنتان عدة منه فقضى الله عنه عدته فأتمها عشرا قال سعيد وهو ابن جبير: فلقيني رجل من أهل النصرانية من علمائهم قال هل تدري أي الأجلين قضى موسى ؟ قلت لا وأنا يومئذ لا أدري فلقيت ابن عباس فذكرت له ذلك فقال أما علمت أن ثمانيا كانت على نبي الله واجبة لم يكن نبي الله لينقص منها شيئا ويعلم أن الله كان قاضيا عن موسى عدته التي كان وعده فإنه قضى عشر سنين فلقيت النصراني فأخبرته ذلك فقال الذي سألته فأخبرك أعلم منك بذلك قلت أجل وأولى فلما سار موسى بأهله كان من أمر النار والعصا ويده ما قص الله عليك في القرآن فشكا إلى الله تعالى ما يحذر من آل فرعون في القتيل وعقدة لسانه فإنه كان في لسانه عقدة تمنعه من كثير من الكلام وسأل ربه أن يعينه بأخيه هارون يكون له ردءا ويتكلم عنه بكثير مما لا يفصح به لسانه فآتاه الله سؤله وحل عقدة من لسانه وأوحى الله إلى هارون وأمره أن يلقاه فاندفع موسى بعصاه حتى لقي هارون فانطلقا جميعا إلى فرعون فأقاما على بابه حينا لا يؤذن لهما ثم أذن لهما بعد حجاب شديد فقالا إنا رسولا ربك قال فمن ربكما ؟ فأخبراه بالذي قص الله عليك في القرآن قال فما تريدان ؟ وذكره القتيل فاعتذر بما قد سمعت قال أريد أن تؤمن بالله وترسل معنا بنى إسرائيل فأبى عليه وقال ائت بآية إن كنت من الصادقين فألقى عصاه فإذا هي حية تسعى عظيمة فاغرة فاها مسرعة إلى فرعون فلما رآها فرعون قاعدة إليه خافها فاقتحم عن سريره واستغاث بموسى أن يكفها عنه ففعل ثم أخرج يده من جيبه فرآها بيضاء من غير سوء يعني من غير برص ثم ردها فعادت إلى لونها الأول فاستشار الملأ حوله فيما رأى فقالوا له هذان ساحران يريدان أن يخرجاكما من أرضكم بسحرهما ويذهبا بطريقتكم المثلى يعني ملكهم الذي هم فيه والعيش وأبوا على موسى أن يعطوه شيئا مما طلب وقالوا له اجمع لهما السحرة فإنهم بأرضك كثير حتى تغلب بسحرك سحرهما فأرسل إلى المدائن فحشر له كل ساحر متعالم فلما أتوا فرعون قالوا بما يعمل هذا الساحر ؟ قالوا يعمل بالحيات قالوا فلا والله ما أحد في الأرض يعمل بالسحر بالحيات والحبال والعصي الذي نعمل فما أجرنا إن نحن غلبنا ؟ قال لهم أنتم أقاربي وخاصتي وأنا صانع إليكم كل شيء أحببتم فتواعدوا يوم الزينة وأن يحشر الناس ضحى قال سعيد بن جبير فحدثني ابن عباس أن يوم الزينة اليوم الذي أظهر الله فيه موسى على فرعون والسحرة هو يوم عاشوراء فلما اجتمعوا في صعيد واحد قال الناس بعضهم لبعض انطلقوا فلنحضر هذا الأمر لعلنا نتبع السحرة إن كانوا هم الغالبين يعنون موسى وهارون استهزاء بهما فقالوا يا موسى إما أن تلقي وإما أن نكون نحن الملقين قال بل ألقوا فألقوا حبالهم وعصيهم وقالوا بعزة فرعون إنا لنحن الغالبون فرأى موسى من سحرهم ما أوجس في نفسه خيفة فأوحى الله إليه أن ألق عصاك فلما ألقاها صارت ثعبانا عظيمة فاغرة فاها فجعلت العصي تلتبس بالحبال حتى صارت جرزا إلى الثعبان تدخل فيه حتى ما أبقت عصا ولا حبلا إلا ابتلعته فلما عرف السحرة ذلك قالوا لو كان هذا سحرا لم يبلغ من سحرنا كل هذا ولكن هذا أمر من الله عز وجل آمنا بالله وبما جاء به موسى من عند الله ونتوب إلى الله مما كنا عليه ; فكسر الله ظهر فرعون في ذلك الموطن وأشياعه وظهر الحق وبطل ما كانوا يعملون فغلبوا هنالك وانقلبوا صاغرين وامرأة فرعون بارزة متبذلة تدعو الله بالنصر لموسى على فرعون وأشياعه فمن رآها من آل فرعون ظن أنها إنما ابتذلت للشفقة على فرعون وأشياعه وإنما كان حزنها وهمها لموسى فلما طال مكث موسى بمواعيد فرعون الكاذبة كلما جاء بآية وعده عندها أن يرسل معه بني إسرائيل فإذا مضت أخلف موعده وقال هل يستطيع ربك أن يصنع غير هذا ؟ فأرسل الله على قومه الطوفان والجراد والقمل والضفادع والدم آيات مفصلات كل ذلك يشكو إلى موسى ويطلب إليه أن يكفها عنه ويواثقه على أن يرسل معه بني إسرائيل فإذا كف ذلك أخلف موعده ونكث عهده حتى أمر الله موسى بالخروج بقومه فخرح بهم ليلا فلما أصبح فرعون ورأى أنهم قد مضوا أرسل في المدائن حاشرين فتبعه بجنود عظيمة كثيرة وأوحى الله إلى البحر إذا ضربك عبدي موسى بعصاه فانفلق اثني عشرة فرقة حتى يجوز موسى ومن معه ثم التق على من بقي بعد من فرعون وأشياعه فنسي موسى أن يضرب البحر بالعصا وانتهى إلى البحر وله قصيف مخافة أن يضربه موسى بعصاه وهو غافل فيصير عاصيا لله.فلما تراءى الجمعان وتقاربا قال أصحاب موسى إنا لمدركون افعل ما أمرك به ربك فإنه لم يكذب ولم تكذب.قال وعدني ربي إذا أتيت البحر انفرق اثنتي عشرة فرقة حتى أجاوزه ثم ذكر بعد ذلك العصى فضرب البحر بعصاه حين دنا أوائل جند فرعون من أواخر جند موسى فانفرق البحر كما أمره ربه وكما وعد موسى فلما أن جاز موسى وأصحابه كلهم البحر ودخل فرعون وأصحابه التقى عليهم البحر كما أمر فلما جاوز موسى البحر قال أصحابه إنا نخاف أن لا يكون فرعون غرق ولا نؤمن بهلاكه فدعا ربه فأخرجه له ببدنه حتى استيقنوا بهلاكه ثم مروا بعد ذلك على قوم يعكفون على أصنام لهم قالوا يا موسى اجعل لنا إلها كما لهم آلهة قال إنكم قوم تجهلون إن هؤلاء متبر ماهم فيه\" الآية.قد رأيتم من العبر وسمعتم ما يكفيكم ومضى فأنزلهم موسى منزلا وقال أطيعوا هارون فإني قد استخلفته عليكم فإنى ذاهب إلى ربي وأجلهم ثلاثين يوما أن يرجع إليهم فيها فلما أتى ربه وأراد أن يكلمه ثلاثين يوما وقد صامهن ليلهن ونهارهن وكره أن يكلم ربه وريح فيه ريح فم الصائم فتناول موسى من نبات الأرض شيئا فمضغه فقال له ربه حين أتاه لم أفطرت وهو أعلم بالذي كان قال يا رب إني كرهت أن أكلمك إلا وفمي طيب الريح قال أو ما علمت يا موسى أن ريح فم الصائم أطيب عندي من ريح المسك ارجع فصم عشرا ثم ائتني ففعل موسى عليه السلام ما أمر به فلما رأى قوم موسى أنه لم يرجع إليهم في الأجل ساءهم ذلك وكان هارون قد خطبهم وقال إنكم قد خرجتم من مصر ولقوم فرعون عندكم عواري وودائع ولكم فيهم مثل ذلك فإني أرى أنكم تحتسبون مالكم عندهم ولا أحل لكم وديعة استودعتموها ولا عارية ولسنا برادين إليهم شيئا من ذلك ولا ممسكيه لأنفسنا فحفر حفيرا وأمر كل قوم عندهم من ذلك من متاع أو حلية أن يقذفوه في ذلك الحفير ثم أوقد عليه النار فأحرقته فقال لا يكون لنا ولا لهم وكان السامري من قوم يعبدون البقر جيران لبني إسرائيل ولم يكن من بني إسرائيل فاحتمل مع موسى وبني إسرائيل حين احتملوا فقضى له أن رأى أثرا فقبض منه قبضة فمر بهارون فقال له هارون يا سامري ألا تلقي ما في يدك وهو قابض عليه لا يراه أحد طول ذلك فقال هذه قبضة من أثر الرسول الذي جاوز بكم البحر ولا ألقيها لشيء إلا أن تدعو الله إذا ألقيتها أن يجعلها ما أريد فألقاها ودعا له هارون فقال أريد أن يكون عجلا فاجتمع ما كان في الحفيرة من متاع أو حلية أو نحاس أو حديد فصار عجلا أجوف ليس فيه روح وله خوار قال ابن عباس لا والله ما كان له صوت قط إنما كانت الريح تدخل في دبره وتخرج من فيه وكان ذلك الصوت من ذلك فتفرق بنو إسرائيل فرقا فقالت فرقة يا سامري ما هذا وأنت أعلم به ؟ قال هذا ربكم ولكن موسى أضل الطريق فقالت فرقة لا نكذب بهذا حتى يرجع إلينا موسى فإن كان ربنا لم نكن ضيعناه وعجزنا فيه حين رأينا وإن لم يكن ربنا فإنا نتبع قول موسى وقالت فرقة هذا من عمل الشيطان وليس بربنا ولا نؤمن به ولا نصدق وأشرب فرقة في قلوبهم الصدق بما قال السامري في العجل وأعلنوا التكذيب به فقال لهم هارون يا قوم إنما فتنتم به وإن ربكم الرحمن فأتبعوني وأطيعوا أمري قالوا فما بال موسى وعدنا ثلاثين يوما ثم أخلفنا هذه أربعون يوما قد مضت وقال سفهاؤهم أخطأ ربه فهو يطلبه يتبعه فلما كلم الله موسى وقال له ما قال أخبره بما لقي قومه من بعده فرجع موسى إلى قومه غضبان أسفا فقال لهم ما سمعتم في القرآن وأخذ برأس أخيه يجره إليه وألقى الألواح من الغضب ثم إنه عذر أخاه بعذره واستغفر له وانصرف إلى السامري فقال له ما حملك على ما صنعت ؟ قال قبضت قبضة من أثر الرسول وفطنت لها وعميت عليكم فنبذتها وكذلك سولت لي نفسي قال فاذهب فإن لك في الحياة أن تقول لا مساس وإن لك موعدا لن تخلفه وانظر إلى إلهك الذي ظلت عليه عاكفا لنحرقنه ثم لننسفنه في اليم نسفا ولو كان إلها لم يخلص إلى ذلك منه فاستيقن بنو إسرائيل بالفتنة واغتبط الذين كان رأيهم فيه مثل رأي هارون فقالوا لجماعتهم يا موسى سل لنا ربك أن يفتح لنا باب توبة نصنعها فيكفر عنا ما عملنا فاختار موسى قومه سبعين رجلا لذلك لا يألو الخير خيار بني إسرائيل ومن لم يشرك في العجل فانطلق بهم يسأل لهم التوبة فرجفت بهم الأرض فاستحيا نبي الله من قومه ومن وفده حين فعل بهم ما فعل فقال رب لو شئت أهلكتهم من قبل وإياي أتهلكنا بما فعل السفهاء منا وفيهم من كان الله اطلع منه على ما أشرب قلبه من حب العجل وإيمانه به فلذلك رجفت بهم الأرض فقال ورحمتي وسعت كل شيء فسأكتبها للذين يتقون ويؤتون الزكاة والذين هم بآياتنا يؤمنون الذين يتبعون الرسول النبي الأمي الذي يجدونه مكتوبا عندهم في التوراة والإنجيل فقال يا رب سألتك التوبة لقومي فقلت إن رحمتي كتبتها لقوم غير قومي هلا أخرتني حتى تخرجني في أمة ذلك الرجل المرحومة فقال له إن توبتهم أن يقتل كل رجل منهم من لقي من والد وولد فيقلته بالسيف ولا يبالي من قتل في ذلك الموطن وتاب أولئك الذين كان خفى على موسى وهارون واطلع الله من ذنوبهم فاعترفوا بها وفعلوا ما أمروا وغفر الله للقاتل والمقتول ثم سار بهم موسى عليه السلام متوجها نحو الأرض المقدسة وأخذ الألواح بعدما سكت عنه الغضب فأمرهم بالذي أمرهم به أن يبلغهم من الوظائف فقل ذلك عليهم وأبوا أن يقروا بها فنتق الله عليهم الجبل كأنه ظلة ودنا منهم حتى خافوا أن يقع عليهم فأخذوا الكتاب بأيمانهم وهم مصغون ينظرون إلى الجبل والكتاب بأيديهم وهم من وراء الجبل مخافة أن يقع عليهم ثم مضوا حتى أتوا الأرض المقدسة فوجدوا مدينة فيها قوم جبارون خلقهم خلق منكر وذكروا من ثمارهم أمرا عجيبا من عظمها فقالوا يا موسى إن فيها قوما جبارين لا طاقة لنا بهم ولا ندخلها ما داموا فيها فإن يخرجوا منها فإنا داخلون قال رجلان من الذين يخافون قيل ليزيد هكذا قرأت قال نعم من الجبارين آمنا بموسى وخرجا إليه قالوا نحن أعلم بقومنا إن كنتم إنما تخافون ما رأيتم من أجسامهم وعددهم فإنهم لا قلوب لهم ولا منعة عندهم فادخلوا عليهم الباب فإذا دخلتموه فإنكم غالبون ويقول أناس إنهم من قوم موسى فقال الذين يخافون بنو إسرائيل\" قالوا يا موسى إنا لن ندخلها أبدا ما داموا فيها فاذهب أنت وربك فقاتلا إنا ههنا قاعدون\" فأغضبوا موسى فدعا عليهم وسماهم فاسقين ولم يدع عليهم قبل ذلك لما رأى من المعصية وإساءتهم حتى كان يومئذ فاستجاب الله له وسماهم كما سماهم موسى فاسقين وحرمها عليهم أربعين سنة يتيهون في الأرض يصبحون كل يوم فيسيرون ليس لهم قرار وظلل عليهم الغمام في التيه وأنزل عليهم المن والسلوى وجعل لهم ثيابا لا تبلى ولا تتسخ وجعل بين ظهرانيهم حجرا مربعا وأمر موسى فضربه بعصاه فانفجرت منه اثنتا عشرة عينا في كل ناحية ثلاثة أعين وأعلم كل سبط عينهم التي يشربون منها فلا يرتحلون من مكان إلا وجدوا ذلك الحجر بينهم بالمكان الذي كان فيه بالأمس رفع ابن عباس هذا الحديث إلى النبي صلى الله عليه وسلم وصدق ذلك عندي أن معاوية سمع ابن عباس يحدث هذا الحديث فأنكر عليه أن يكون الفرعوني الذي أفشى على موسى أمر القتيل الذي قتل فقال كيف يفشي عليه ولم يكن علم به ولا ظهر عليه إلا الإسرائيلي الذي حضر ذلك فغضب ابن عباس فأخذ بيد معاوية وانطلق به إلى سعد بن مالك الزهري فقال له يا أبا إسحاق هل تذكر يوم حدثنا رسول الله صلى الله عليه وسلم عن قتيل موسى الذي قتل من آل فرعون ؟ الإسرائيلي الذي أفشى عليه أم الفرعوني ؟ قال إنما أفشى عليه الفرعوني بما سمع من الإسرائيلي الذي شهد على ذلك وحضره وهكذا رواه النسائي في السنن الكبرى وأخرجه أبو جعفر بن جرير وابن أبي حاتم في تفسيريهما كلهم من حديث يزيد بن هارون به وهو موقوف من كلام ابن عباس وليس فيه مرفوع إلا قليل منه وكأنه تلقاه ابن عباس مما أبيح نقله من الإسرائيليات عن كعب الأحبار أو غيره والله أعلم وسمعت شيخنا الحافظ أبا الحجاج المزي يقول ذلك أيضا."
    },
    {
      "ayah": 41,
      "surah": 20,
      "text": "يقول تعالى مخاطبا لموسى عليه السلام إنه لبث مقيما في أهل مدين فارا من فرعون وملئه يرعى على صهره حتى انتهت المدة وانقضى الأجل ثم جاء موافقا لقدر الله وإرادته من غير ميعاد والأمر كله لله تبارك وتعالى وهو المسير عباده وخلقه فيما يشاء ولهذا قال ثم جئت على قدر يا موسى قال مجاهد أي على موعد وقال عبد الرزاق عن معمر عن قتادة في قوله ثم جئت على قدر يا موسى قال على قدر الرسالة والنبوة وقوله واصطنعتك لنفسي أي اصطفيتك واجتبيتك رسولا لنفسي أي كما أريد وأشاء وقال البخاري عند تفسيرها حدثنا الصلت ابن محمد حدثنا مهدي بن ميمون حدثنا محمد بن سيرين عن أبي هريرة عن رسول الله صلى الله عليه وسلم قال \" التقى آدم وموسى فقال موسى أنت الذي أشقيت الناس وأخرجتهم من الجنة ؟ فقال آدم وأنت الذي اصطفاك الله برسالته واصطفاك لنفسه وأنزل عليك التوراة ؟ قال نعم قال فوجدته مكتوبا علي قبل أن يخلقني قال نعم فحج آدم موسى \" أخرجاه."
    },
    {
      "ayah": 42,
      "surah": 20,
      "text": "وقوله \"اذهب انت وأخوك بآياتي\" أي بحججي وبراهيني ومعجزاتي \"ولاتنيا في ذكرى\" قال علي بن أبي طلحة عن ابن عباس لا تبطئا وقال مجاهد عن ابن عباس لا تضعفا والمراد أنهما لا يفتران في ذكر الله بل يذكران الله في حال مواجهة فرعون ليكون ذكر الله عونا لهما عليه وقوة لهما وسلطانا كاسرا له كما جاء في الحديث \" إن عبدي كل عبدي الذي يذكرنى وهو مناجز قرنه \"."
    },
    { "ayah": 43, "surah": 20, "text": "وقوله \"اذهبا إلى فرعون إنه طغى\" أي تمرد وعتا وتجبر على الله وعصاه." },
    {
      "ayah": 44,
      "surah": 20,
      "text": "\"فقولا له قولا لينا لعله يتذكر أو يخشى\" هذه الآية فيها عبرة عظيمة وهو أن فرعون في غاية العتو والاستكبار وموسى صفوة الله من خلقه إذ ذاك ومع هذا أمر أن لا يخاطب فرعون إلا بالملاطفة واللين كما قال يزيد الرقاشي عند قوله فقولا له قوله لينا. يا من يتحبب إلى من يعاديه فكيف بمن يتولاه ويناديه؟ وقال وهب بن منبه قولا له إني إلى العفو والمغفرة أقرب مني إلى الغضب والعقوبة وعن عكرمة في قوله فقولا له قولا لينا قال لا إله إلا الله وقال عمرو بن عبيد عن الحسن البصري فقولا له قولا لينا أعذرا إليه قولا له إن لك ربا ولك معادا لأن بين يديك جنة ونارا ; وقال بقية عن علي بن هارون عن رجل عن الضحاك بن مزاحم عن النزال بن سبرة عن علي فى قوله فقولا له قولا لينا قال كنه وكذا روى عن سفيان الثوري كنه بأبي مرة والحاصل من أقوالهم أن دعوتهما له تكون بكلام رقيق لين سهل رفيق ليكون أوقع في النفوس وأبلغ وأنجع كما قال تعالى\" ادع إلى سبيل ربك بالحكمة والموعظة الحسنة وجادلهم بالتي هي أحسن\" وقوله\" لعله يتذكر أو يخشى\" أي لعله يرجع عما هو فيه من الضلال والهلكة أو يخشى أي يوجد طاعة من خشية ربه كما قال تعالى \"لمن أراد أن يذكر\" أو يخشى فالتذكر الرجوع عن المحذور والخشية تحصيل الطاعة وقال الحسن البصري \"لعله يتذكر أو يخشى\" يقول: لا تقل أنت يا موسى وأخوك هارون أهلكه قبل أن أعذر إليه ; وههنا نذكر شعر زيد بن عمرو بن نفيل ويروى لأمية بن أبي الصلت فيما ذكره ابن إسحاق. وأنت الذي من فضل من ورحمة بعثت إلى موسى رسولا مناديا فقلت له فاذهب وهارون فادعوا إلى الله فرعون الذى كان باغيا فقولا له هل أنت سويت هذه بلا وتد حتى استقلت كما هيا وقولا له آأنت رفعت هذه بلا عمد أرفق إذن بك بانيا وقولا له آأنت سويت وسطها منيرا إذا ما جنه الليل هاديا قـولا له من يخرج الشمس بكرة فيصبح مامست من الأرض ضاحيا وقولا له من ينبت الحب في الثرى فيصبح منه البقل يهتز رابيا ويخرج منه حبه في رءوسه ففي ذاك آيات لمن كان واعيا"
    },
    {
      "ayah": 45,
      "surah": 20,
      "text": "يقول تعالى إخبارا عن موسى وهارون عليهما السلام أنهما قالا مستجيرين بالله تعالى شاكيين إليه إننا نخاف أن يفرط علينا أو أن يطغى يعنيان أن يبدر إليهما بعقوبة أو يعتدي عليهما فيعاقبهما وهما لا يستحقان منه ذلك.قال عبد الرحمن بن زيد بن أسلم أن يفرط يعجل وقال مجاهد يبسط علينا وقال الضحاك عن ابن عباس أو أن يطغى: يعتدي."
    },
    {
      "ayah": 46,
      "surah": 20,
      "text": "\"قال لا تخافا إنني معكما أسمع وأرى\" أي لا تخافا منه فإنني معكما أسمع كلامكما وكلامه وأرى مكانكما ومكانه لا يخفى علي من أمركم شيء واعلما أن ناصيته بيدي فلا يتكلم ولا يتنفس ولا يبطش إلا بإذني وبعد أمري وأنا معكما بحفظي ونصري وتأييدي وقال ابن أبي حاتم حدثنا أبي حدثنا علي بن محمد الطنافسي حدثنا أبو معاوية عن الأعمش عن عمرو بن مرة عن أبي عبيدة عن عبد الله قال لما بعث الله عز وجل موسى إلى فرعون فقال رب أي شيء أقول قال قل هيا شراهيا قال الأعمش فسر ذلك أنا الحي قبل كل شيء والحي بعد كل شيء إسناده جيد وشيء غريب."
    },
    {
      "ayah": 47,
      "surah": 20,
      "text": "\"فأتياه فقولا إنا رسولا ربك\" قد تقدم في حديث الفتون عن ابن عباس أنه قال مكثا على بابه حينا لا يؤذن لهما حتى أذن لهما بعد حجاب شديد وذكر محمد بن إسحاق بن يسار أن موسى وأخاه هارون خرجا فوقفا بباب فرعون يلتمسان الإذن عليه وهما يقولان إنا رسولا رب العالمين فآذنوا بنا هذا الرجل فمكثا فيما بلغني سنتين يغدوان ويروحان لا يعلم بهما ولا يجترئ أحد على أن يخبره بشأنهما حتى دخل عليه بطال له يلاعبه ويضحكه فقال له أيها الملك إن على بابك رجلا يقول قولا عجيبا يزعم أن له إلها غيرك أرسله إليك قال ببابي ؟ قال نعم قال أدخلوه فدخل ومعه أخوه هارون وفي يده عصا فلما وقف على فرعون قال إني رسول رب العالمين فعرفه فرعون وذكر السدي أنه لما قدم بلاد مصر ضاف أمه وأخاه وهما لا يعرفانه وكان طعامهما ليلتئذ الطفيل وهو اللفت ثم عرفاه وسلما عليه فقال له موسى يا هارون إن ربي قد أمرني أن آتي هذا الرجل فرعون فأدعوه إلى الله وأمرك أن تعاونني قال افعل ما أمرك ربك فذهبا وكان ذلك ليلا فضرب موسى باب القصر بعصاه فسمع فرعون فغضب وقال من يجترئ على هذا الصنيع الشديد فأخبره السدنة والبوابون بأن ههنا رجلا مجنونا يقول إنه رسول الله فقال علي به فلما وقفا بين يديه قالا وقال لهما ما ذكر الله في كتابه وقوله \"قد جئناك بآية من ربك\" أي بدلالة ومعجزة من ربك والسلام على من اتبع الهدى أي والسلام عليك إن اتبعت الهدى ولهذا لما كتب رسول الله صلى الله عليه وسلم إلى هرقل عظيم الروم كتابا كان أوله \" بسم الله الرحمن الرحيم من محمد رسول الله إلى هرقل عظيم الروم سلام على من اتبع الهدى أما بعد فإني أدعوك بدعاية الإسلام فأسلم تسلم يؤتك الله أجرك مرتين \" وكذلك لما كتب مسيلمة إلى رسول الله صلى الله عليه وسلم كتابا صورته من مسيلمة رسول الله إلى محمد رسول الله سلام عليك أما بعد فإني قد أشركتك في الأمر فلك المدر ولي الوبر ولكن قريش قوم يعتدون.فكتب اليه رسول الله صلى الله عليه وسلم \" من محمد رسول الله إلى مسيلمة الكذاب سلام على من اتبع الهدى أما بعد فإن الأرض لله يورثها من يشاء من عباده والعاقبة للمتقين \" ولهذا قال موسى وهارون عليهما السلام لفرعون."
    },
    {
      "ayah": 48,
      "surah": 20,
      "text": "\" إنا قد أوحي إلينا أن العذاب على من كذب وتولى\" أي قد أخبرنا الله فيما أوحاه إلينا من الوحي المعصوم أن العذاب متحمض لمن كذب بآيات الله وتولى عن طاعته كما قال تعالى فأما من طغى وآثر الحياة الدنيا فإن الجحيم هي المأوى وقال تعالى فأنذرتكم نارا تلظى لا يصلاها إلا الأشقى الذي كذب وتولى وقال تعالى فلا صدق ولا صلى ولكن كذب وتولى أي كذب بقلبه وتولى بفعله."
    },
    {
      "ayah": 49,
      "surah": 20,
      "text": "يقول تعالى مخبرا عن فرعون أنه قال لموسى منكرا وجود الصانع الخالق إله كل شيء وربه ومليكه قال فمن ربكما يا موسى أي الذي بعثك وأرسلك من هو فإني لا أعرفه وما علمت لكم من إله غيري."
    },
    {
      "ayah": 5,
      "surah": 20,
      "text": "وقوله \"الرحمن على العرش استوى\" تقدم الكلام على ذلك في سورة الأعراف بما أغنى عن إعادته أيضا وأن المسلك الأسلم في ذلك طريقة السلف إمرار ما جاء في ذلك من الكتاب والسنة من غير تكييف ولا تحريف ولا تشبيه ولا تعطيل ولا تمثيل."
    },
    {
      "ayah": 50,
      "surah": 20,
      "text": "قوله\"أعطى كل شيء خلقه ثم هدى\" قال أعطى كل ذي خلق ما يصلحه من خلقه ولم يجعل للإنسان من خلق الدابة ولا للدابة من خلق الكلب ولا للكلب من خلق الشاة وأعطى كل شيء ما ينبغي له من النكاح وهيأ كل شيء على ذلك ليس شيء منها يشبه شيئا من أفعاله في الخلق والرزق والنكاح وقال بعض المفسرين أعطى كل شيء خلقه ثم هدى كقوله تعالى الذي قدر فهدى أي قدر قدرا وهدى الخلائق إليه أي كتب الأعمال والآجال والأرزاق ثم الخلائق ماشون على ذلك لا يحيدون عنه ولا يقدر أحد على الخروج يقول ربنا الذي خلق الخلق وقدر القدر وجبل الخليقة على ما أراد."
    },
    {
      "ayah": 51,
      "surah": 20,
      "text": "\"قال فما بال القرون الأولى\" أصح الأقوال في معنى ذلك أن فرعون لما أخبره موسى بأن ربه الذي أرسله هو الذي خلق ورزق وقدر فهدى شرع يحتج بالقرون الأولى أي الذين لم يعبدوا الله أي فما بالهم إذا كان الأمر كذلك لم يعبدوا ربك بل عبدوا غيره."
    },
    {
      "ayah": 52,
      "surah": 20,
      "text": "فقال له موسى في جواب ذلك هم وإن لم يعبدوه فإن عملهم عند الله مضبوط عليهم وسيجزيهم بعملهم في كتاب الله وهو اللوح المحفوظ وكتاب الأعمار لا يضل ربي ولا ينسى أي لا يشذ عنه شيء ولا يفوته صغير ولا كبير ولا ينسى شيئا يصف علمه تعالى بأنه بكل شيء محيط وأنه لا ينسى شيئا تبارك وتعالى وتقدس وتنزه فإن علم المخلوق يعتريه نقصانين أحدهما عدم الإحاطة بالشيء والآخر نسيانه بعد علمه فنزه نفسه عن ذلك."
    },
    {
      "ayah": 53,
      "surah": 20,
      "text": "هذا من تمام كلام موسى فيما وصف به ربه عز وجل حين سأله فرعون عنه فقال الذي أعطى كل شيء خلقه ثم هدى ثم اعترض الكلام بين ذلك ثم قال الذي جعل لكم الأرض مهدا وفي قراءة بعضهم مهدا أي قرارا تستقرون عليها وتقومون وتنامون عليها وتسافرون على ظهرها وسلك لكم فيها سبلا أي جعل لكم طرقا تمشون في مناكبها كما قال تعالى \"وجعلنا فيها فجاجا سبلا لعلهم يهتدون وأنزل من السماء ماء فأخرجنا به أزواجا من نبات شتى\" أي من أنواع النباتات من زروع وثمار ومن حامض وحلو ومر وسائر الأنواع."
    },
    {
      "ayah": 54,
      "surah": 20,
      "text": "\"كلوا وارعوا انعامكم\" أي شيء لطعامكم وفاكهتكم وشيء لأنعامكم لأقواتها خضرا ويبسا إن في ذلك لآيات أي لدلالات وحجج وبراهين \"لأولي النهي\" أي لذوي العقول السليمة المستقيمة على أنه لا إله إلا الله ولا رب سواه."
    },
    {
      "ayah": 55,
      "surah": 20,
      "text": "\"منها خلقناكم وفيها نعيدكم ومنها نخرجكم تارة أخرى\" أي من الأرض مبدؤكم فإن أباكم آدم مخلوق من تراب من أديم الأرض وفيها نعيدكم أي وإليها تصيرون إذا متم وبليتم ومنها نخرجكم تارة أخرى يوم يدعوكم فتستجيبون بحمده وتظنون إن لبثتم إلا قليلا وهذه الآية كقوله تعالى\" قال فيها تحيون وفيها تموتون ومنها تخرجون\" وفي الحديث الذي في السنن أن رسول الله صلى الله عليه وسلم حضر جنازة فلما دفن الميت أخذ قبضة من التراب فألقاها في القبر وقال منها خلقناكم ثم أخذ أخرى وقال وفيها نعيدكم ثم أخرى وقال ومنها نخرجكم تارة أخرى."
    },
    {
      "ayah": 56,
      "surah": 20,
      "text": "وقوله\"ولقد أريناه آياتنا كلها فكذب وأبى\" يعني فرعون أنه قامت عليه الحجج والآيات والدلالات وعاين ذلك وأبصره فكذب بها وأباها كفرا وعنادا وبغيا كما قال تعالى\" وجحدوا بها واستيقنتها أنفسهم ظلما وعلوا\" الآية."
    },
    {
      "ayah": 57,
      "surah": 20,
      "text": "يقول تعالى مخبرا عن فرعون أنه قال لموسى حين أراه الآية الكبرى وهى إلقاء عصاه فصارت ثعبانا عظيما ونزع يده من تحت جناحه فخرجت بيضاء من غير سوء فقال هذا سحر جئت به لتسحرنا وتستولي به على الناس فيتبعونك وتكاثرنا بهم ولا يتم هذا معك."
    },
    {
      "ayah": 58,
      "surah": 20,
      "text": "فإن عندنا سحرا مثل سحرك فلا يغرنك ما أنت فيه \"فاجعل بيننا وبينك موعدا\"أي يوما نجتمع نحن وأنت فيه فنعارض ما جئت به بما عندك من السحر في مكان معين ووقت معين."
    },
    {
      "ayah": 59,
      "surah": 20,
      "text": "فعند ذلك \"قال\" لهم موسى \"موعدكم يوم الزينة\" وهو يوم عيدهم وتفرغهم من أعمالهم واجتماع جميعهم ليشاهد الناس قدرة الله على ما يشاء ومعجزات الأنبياء وبطلان معارضة السحر لخوارق العادات النبوية ولهذا قال \"وأن يحشر الناس\" أي جميعهم \"ضحى\" أي ضحوة من النهار ليكون أظهر وأجلى وأبين وأوضح وهكذا شأن الأنبياء كل أمرهم بين واضح ليس فيه خفاء ولا ترويج ولهذا لم يقل ليلا ولكن نهارا ضحى قال ابن عباس وكان يوم الزينة يوم عاشوراء وقال السدي وقتادة وابن زيد كان يوم عيدهم وقال سعيد بن جبير كان يوم سوقهم ولا منافاة قلت وفي مثله أهلك الله فرعون وجنوده كما ثبت في الصحيح وقال وهب بن منبه قال فرعون يا موسى اجعل بيننا وبينك أجلا ننظر فيه قال موسى لم أؤمر بهذا إنما أمرت بمناجزتك إن أنت لم تخرج دخلت إليك فأوحى الله إلى موسى أن اجعل بينك وبينه أجلا وقل له أن يجعل هو قال فرعون اجعله إلى أربعين يوما ففعل وقال مجاهد وقتادة مكانا سوى منصفا وقال السدي عدلا وقال عبد الرحمن بن زيد بن أسلم مكانا سوى مُسْتَوٍ بين الناس وما فيه لا يكون صوت ولا شيء يتغيب بعض ذلك عن بعض مُسْتَوٍ حين يُرى."
    },
    {
      "ayah": 6,
      "surah": 20,
      "text": "وقوله \"له ما في السموات وما في الأرض وما بينهما وما تحت الثرى\" أي الجميع ملكه وفي قبضته وتحت تصرفه ومشيئته وإرادته وحكمه وهو خالق ذلك ومالكه وإلهه لا إله سواه ولا رب غيره وقوله وما تحت الثرى قال محمد بن كعب أي ما تحت الأرض السابعة وقال الأوزاعي إن يحيى بن أبي كثير حدثه أن كعبا سئل فقيل له: ما تحت هذه الأرض ؟ فقال الماء قيل: وما تحت الماء ؟ قال الأرض قيل: وما تحت الأرض ؟ قال الماء قيل: وما تحت الماء ؟ قال الأرض قيل: وما تحت الأرض ؟ قال الماء قيل: وما تحت الماء ؟ قال الأرض قيل: وما تحت الأرض ؟ قال الماء قيل: وما تحت الماء ؟ قال الأرض قيل: وما تحت الأرض ؟ قال صخرة قيل: وما تحت الصخرة ؟ قال: ملك قيل: و ما تحت الملك ؟ قال حوت معلق طرفاه بالعرش قيل: وما تحت الحوت ؟ قال الهواء والظلمة وانقطع العلم وقال ابن أبي حاتم حدثنا أبو عبيد الله بن أخي بن وهب حدثنا عمي حدثنا عبد الله بن عياش حدثنا عبد الله بن سلمان عن دراج عن عيسى بن هلال الصدفي عن عبد الله بن عمرو قال: قال رسول الله صلى الله عليه وسلم \" إن الأرضين بين كل أرض والتي تليها مسيرة خمسمائة عام والعليا منها على ظهر حوت قد التقى طرفاه في السماء والحوت على صخرة والصخرة بيد الملك والثانية سجن الريح والثالثة فيها حجارة جهنم والرابعة فيها كبريت جهنم والخامسة فيها حيات جهنم والسادسة فيها عقارب جهنم والسابعة فيها سقر وفيها إبليس مصفد بالحديد أمامه ويد خلفه فإذا أراد الله أن يطلقه لما يشاء أطلقه \" وهذا حديث غريب جدا ورفعه فيه نظر وقال الحافظ أبو يعلى في مسنده حدثنا أبو موسى الهروي عن العباس بن الفضل قال: قلت ابن الفضل الأنصاري ؟ قال نعم عن القاسم بن عبد الرحمن عن محمد بن علي عن جابر بن عبد الله قال كنت مع رسول الله صلى الله عليه وسلم في غزوة تبوك فأقبلنا راجعين في حر شديد فنحن متفرقون بين واحد واثنين منتشرين قال وكنت في أول العسكر إذ عارضنا رجل فسلم ثم قال أيكم محمد ومضى أصحابي ووقفت معه فإذا رسول الله صلى الله عليه وسلم قد أقبل في وسط العسكر على جمل أحمر مقنع بثوبه على رأسه من الشمس فقلت أيها السائل هذا رسول الله قد أتاك فقال أيهم هو ؟ فقلت صاحب البكر الأحمر فدنا منه فأخذ بخطام راحلته فكف عليه رسول الله صلى الله عليه وسلم فقال أنت محمد ؟ قال \" نعم \" قال إني أريد أن أسألك عن خصال لا يعلمهن أحد من أهل الأرض إلا رجل أو رجلان فقال رسول الله صلى الله عليه وسلم \" سل عما شئت \" قال يا محمد أينام النبي ؟ فقال رسول الله صلى الله عليه وسلم \" تنام عيناه ولا ينام قلبه \" قال صدقت ثم قال يا محمد من أين يشبه الولد أباه وأمه فقال رسول الله صلى الله عليه وسلم \" ماء الرجل أبيض غليظ وماء المرأة أصفر رقيق فأي الماءين غلب على الآخر نزع الولد \" فقال صدقت فقال ما للرجل من الولد وما للمرأة منه فقال \" للرجل العظام والعروق والعصب وللمرأة اللحم والدم والشعر \" قال صدقت ثم قال يا محمد ما تحت هذه يعني الأرض فقال رسول الله صلى الله عليه وسلم \" خلق \" فقال فما تحتهم ؟ قال \" أرض \" قال فما تحت الأرض ؟ قال \" الماء \" قال فما تحت الماء ؟ قال \" ظلمة \" قال فما تحت الظلمة قال \" الهواء \" قال فما تحت الهواء ؟ قال \" الثرى \" قال فما تحت الثرى ؟ ففاضت عينا رسول الله صلى الله عليه وسلم بالبكاء وقال \" انقطع علم الخلق عند علم الخالق أيها السائل ما المسئول عنها بأعلم من السائل \" قال فقال صدقت أشهد أنك رسول الله فقال رسول الله صلى الله عليه وسلم \" أيها الناس هل تدرون من هذا ؟ \" قالوا الله ورسوله أعلم قال \" هذا جبريل \" هذا حديث غريب جدا وسياق عجيب تفرد به القاسم بن عبد الرحمن هذا وقد قال فيه يحيى بن معين ليس يساوي شيئا وضعفه أبو حاتم الرازي وقال ابن عدي لا يعرف قلت وقد خلط في هذا الحديث ودخل عليه شيء في شيء وحديث في حديث وقد يحتمل أنه تعمد ذلك أو أدخل عليه فيه والله أعلم."
    },
    {
      "ayah": 60,
      "surah": 20,
      "text": "يقول تعالى مخبرا عن فرعون أنه لما تواعد هو وموسى إلى وقت ومكان معلومين تولى أي شرع في جمع السحرة من مدائن مملكته كل من ينسب إلى السحر في ذلك الزمان وقد كان السحر فيهم كثيرا نافقا جدا كما قال تعالى\" وقال فرعون ائتوني بكل ساحر عليم\" ثم أتي أي اجتمع الناس لميقات يوم معلوم وهو يوم الزينة وجلس فرعون على سرير مملكته واصطف له أكابر دولته ووقفت الرعايا يمنة ويسرة وأقبل موسى متوكئا على عصاه ومعه أخوه هارون ووقف السحرة بين يدي فرعون صفوفا وهو يحرضهم ويحثهم ويرغبهم في إجادة عملهم في ذلك اليوم ويتمنون عليه وهو يعدهم ويمنيهم يقولون\" أئن لنا لأجرا إن كنا نحن الغالبين قال نعم وإنكم إذا لمن المقربين\"."
    },
    {
      "ayah": 61,
      "surah": 20,
      "text": "\"قال موسى ويلكم لا تفتروا على الله كذبا\" أي لا تخيلوا للناس بأعمالكم إيجاد أشياء لا حقائق لها وإنها مخلوقة وليست مخلوقة فتكونون قد كذبتم على الله فيسحتكم بعذاب أي يهلككم بعقوبة هلاكا لا بقية له \"فيسحتكم بعذاب وقد خاب من افترى\"أي يهلككم بعقوبة هلاكا لا بقية له."
    },
    {
      "ayah": 62,
      "surah": 20,
      "text": "قيل معناه أنهم تشاجروا فيما بينهم فقائل يقول ليس هذا بكلام ساحر إنما هذا كلام نبي وقائل يقول بل هو ساحر وقيل غير هذا والله أعلموقوله\"وأسروا النجوى\"أي تناجوا فيما بينهم."
    },
    {
      "ayah": 63,
      "surah": 20,
      "text": "\"قالوا إن هذان لساحران\" وهذه لغة لبعض العرب جاءت هذه القراءة على إعرابها ومنهم من قرأ إن هذين لساحران وهذه اللغة المشهورة وقد توسع النحاة في الجواب عن القراءة الأولى بما ليس هذا موضعه والغرض أن السحرة قالوا فيما بينهم: تعلمون أن هذا الرجل وأخاه - يعنون موسى وهارون - ساحران عالمان خبيران بصناعة السحر يريدان في هذا اليوم أن يغلباكم وقومكم ويستوليا على الناس وتتبعهما العامة ويقاتلا فرعون وجنوده فينصرا عليه ويخرجاكم من أرضكم وقوله\" ويذهبا بطريقتكم المثلى\" أي ويستبدا بهذه الطريقة وهي السحر فإنهم كانوا معظمين بسببها لهم أموال وأرزاق عليها يقولون إذا غلب هذان أهلكاكم وأخرجاكم من الأرض وتفردا بذلك وتمحضت لهما الرياسة بها دونكم وقد تقدم في حديث الفتون أن ابن عباس قال في قوله ويذهبا بطريقتكم المثلى يعني ملكهم الذي هم فيه والعيش وقال ابن أبي حاتم حدثنا أبي حدثنا نعيم بن حماد حدثنا هشيم عن عبد الرحمن بن إسحاق سمع الشعبي يحدث عن علي في قوله ويذهبا بطريقتكم المثلى قال يصرفان وجوه الناس إليهما وقال مجاهد ويذهبا بطريقتكم المثلى قال أولو الشرف والعقل والأسنان.وقال أبو صالح بطريقتكم المثلى أشرافكم وسرواتكم وقال عكرمة بخيركم وقال قتادة وطريقتهم المثلى يومئذ بنو إسرائيل وكانوا أكثر القوم عددا وأموالا فقال عدو الله يريدان أن يذهبا بها لأنفسهما وقال عبد الرحمن بن زيد بطريقتكم المثلى بالذي أنتم عليه."
    },
    {
      "ayah": 64,
      "surah": 20,
      "text": "وقوله \"فأجمعوا كيدكم ثم ائتوا صفا\" أي اجتمعوا كلكم صفا واحدا وألقوا ما في أيديكم مرة واحدة لتبهروا الأبصار وتغلبوا هذا وأخاه وقد أفلح اليوم من استعلى أي منا ومنه أما نحن فقد وعدنا هذا الملك العطاء الجزيل وأما هو فينال الرياسة العظيمة."
    },
    {
      "ayah": 65,
      "surah": 20,
      "text": "يقول تعالى مخبراً عن السحرة حين توافقوا هم وموسى عليه السلام أنهم قالوا لموسى \"إما أن تلقي\" أي أنت أولا."
    },
    {
      "ayah": 66,
      "surah": 20,
      "text": "\" قال بل ألقوا\" أي أنتم أولا لنرى ماذا تصنعون من السحر وليظهر للناس جلية أمرهم\" فإذا حبالهم وعصيهم يخيل إليه من سحرهم أنها تسعى\" وفي الآية الأخرى أنهم لما ألقوا\" قالوا بعزة فرعون إنا لنحن الغالبون\" وقال تعالى\" سحروا أعين الناس واسترهبوهم وجاءوا بسحر عظيم\" وقال ههنا\" فإذا حبالهم وعصيهم يخيل إليه من سحرهم أنها تسعى\" وذلك أنهم أودعوها من الزئبق ما كانت تتتحرك بسببه وتضطرب وتميد بحيث يخيل للناظر أنها تسعى باختيارها وإنما كانت حيلة وكانوا جما غفيرا وجمعا كثيرا فألقى كل منهم عصا وحبلا حتى صار الوادى ملآن حيات يركب بعضها بعضا."
    },
    {
      "ayah": 67,
      "surah": 20,
      "text": "وقوله \"فأوجس في نفسه خيفة موسى\" أي خاف على الناس أن يفتنوا بسحرهم ويغتروا بهم قبل أن يلقى ما في يمينه فأوحى الله تعالى إليه في الساعة الراهنة أن ألق ما في يمينك يعني عصاك فإذا هي تلقف ما صنعوا وذلك أنها صارت تنينا عظيما هائلا ذا قوائم وعنق ورأس وأضراس فجعلت تتبع تلك الحبال والعصي حتى لم تبق منها شيئا إلا تلقفته والسحرة والناس ينظرون إلى ذلك عيانا جهرة نهارا ضحوة فقامت المعجزة واتضح البرهان ووقع الحق وبطل السحر."
    },
    { "ayah": 68, "surah": 20, "text": "لا يوجد تفسير لهذه الأية" },
    {
      "ayah": 69,
      "surah": 20,
      "text": "\"إنما صنعوا كيد ساحر ولا يفلح الساحر حيث أتى\" وقال ابن أبي حاتم حدثنا أبي حدثنا محمد بن موسى الشيباني حدثنا حماد بن خالد حدثنا ابن معاذ- أحسبه الصائغ - عن الحسن عن جندب بن عبد الله البجلي قال قال رسول الله صلى الله عليه وسلم \" إذا أخذتم - يعني الساحر- فاقتلوه ثم قرأ ولا يفلح الساحر حيث أتى قال لا يؤمن حيث وجد \" وقد روى أصله الترمذي موقوفا ومرفوعا فلما عاين السحرة ذلك وشاهدوه ولهم خبرة بفنون السحر وطرقه ووجوهه علموا علم اليقين أن هذا الذي فعله موسى ليس من قبيل السحر والحيل وأنه حق لا مرية فيه ولا يقدر على هذا إلا الذي يقول للشيء كن فيكون فعند ذلك وقعوا سجدا لله وقالوا آمنا برب العالمين رب موسى وهارون ولهذا قال ابن عباس وعبيد بن عمير: كانوا أول النهار سحرة وفي آخر النهار شهداء بررة وقال محمد بن كعب كانوا ثمانين ألفا وقال القاسم بن أبي بزة كانوا سبعين ألفا وقال السدي بضعة وثلاثين ألفا وقال الثوري عن عبد العزيز بن رفيع عن أبي تمامة كان سحرة فرعون تسعة عشر ألفا وقال محمد بن إسحاق كانوا خمسة عشر ألفا وقال كعب الأحبار كانوا اثني عشر ألفا وقال ابن أبي حاتم حدثنا علي بن الحسين حدثنا محمد بن علي ابن حمزة حدثنا علي بن الحسين بن واقد عن أبيه عن يزيد النحوي عن عكرمة عن ابن عباس كانت السحرة سبعين رجلا أصبحوا سحرة وأمسوا شهداء قال ابن أبي حاتم حدثنا أبي حدثنا المسيب بن واضح بمكة حدثنا ابن المبارك قال: قال الأوزاعي لما خر السحرة سجدا رفعت لهم الجنة حتى نظروا إليها."
    },
    {
      "ayah": 7,
      "surah": 20,
      "text": "قوله \"وإن تجهر بالقول فإنه يعلم السر وأخفى\" أي أنزل هذا القرآن الذى خلق الأرض والسموات العلى الذى يعلم السر وأخفى كما قال تعالى قل أنزله الذي يعلم السر في السموات والأرض إنه كان غفورا رحيما قال علي بن أبي طلحة عن ابن عباس يعلم السر وأخفى قال السر ما أسره ابن آدم في نفسه \"وأخفى\" ما أخفي على ابن آدم مما هو فاعله قبل أن يعلمه فالله يعلم ذلك كله فعلمه فيما مضى من ذلك وما بقي علم واحد وجميع الخلائق في ذلك عنده كنفس واحدة وهو قوله ما خلقكم ولا بعثكم إلا كنفس واحدة وقال الضحاك يعلم السر وأخفى قال السر ما تحدث به نفسك وأخفى ما لم تحدث به نفسك بعد وقال سعيد بن جبير أنت تعلم ما تسر اليوم ولا تعلم ما تسر غدا والله يعلم ما تسر اليوم وما تسر غدا وقال مجاهد وأخفى يعني الوسوسة وقال أيضا هو وسعيد بن جبير وأخفى أي ما هو عامله مما لم يحدث به نفسه."
    },
    {
      "ayah": 70,
      "surah": 20,
      "text": "قال وذكر عن سعيدابن سلام حدثنا إسماعيل بن عبد الله بن سلمان عن سالم الأفطس عن سعيد بن جبير قوله\"ألقي السحرة سجدا\" قال رأوا منازلهم تبين لهم وهم في سجودهم وكذا قال عكرمة والقاسم بن أبي بزة."
    },
    {
      "ayah": 71,
      "surah": 20,
      "text": "يقول تعالى مخبرا عن كفر فرعون وعناده وبغيه ومكابرته الحق بالباطل حين رأى ما رأى من المعجزة الباهرة والآية العظيمة ورأى الذين قد استنصر بهم قد آمنوا بحضرة الناس كلهم وغلب كل الغلب شرع في المكابرة والبهت وعدل إلى استعمال جاهه وسلطانه في السحرة فتهددهم وتوعدهم وقال آمنتم له أي صدقتموه قبل أن آذن لكم أي وما أمرتكم بذلك وافيتم علي في ذلك وقال قولا يعلم هو والسحرة والخلق كلهم أنه بهت وكذب \"إنه لكبيركم الذي علمكم السحر\" أي أنتم إنما أخذتم السحر عن موسى واتفقتم أنتم وإياه علي وعلى رعيتي لتظهروه كما قال تعالى في الآية الأخرى إن هذا لمكر مكرتموه في المدينة لتخرجوا منها أهلها فسوف تعلمون ثم أخذ يهددهم فقال لأقطعن أيديكم وأرجلكم من خلاف ولأصلبنكم في جذوع النخل أي لأجعلنكم مثلة ولأقتلنكم ولأشهرنكم قال ابن عباس فكان أول من فعل ذلك رواه ابن أبي حاتم وقوله ولتعلمن أينا أشد عذابا وأبقى أي أنتم تقولون إني وقومي على ضلالة وأنتم مع موسى وقومه على الهدى فسوف تعلمون من يكون له العذاب ويبقى فيه فلما صال عليهم بذلك وتوعدهم هانت عليهم أنفسهم في الله عز وجل."
    },
    {
      "ayah": 72,
      "surah": 20,
      "text": "و\"قالوا لن نؤثرك على ما جاءنا من البينات\" أي لن نختارك على ما حصل لنا من الهدى واليقين والذي فطرنا يحتمل أن يكون قسما ويحتمل أن يكون معطوفا على البينات يعنون لا نختارك على فاطرنا وخالقنا الذي أنشأنا من العدم المبتدي خلقنا من الطين فهو المستحق للعبادة والخضوع لا أنت فاقض ما أنت قاض أي فافعل ما شئت وما وصلت إليه يدك إنما تقضي هذه الحياة الدنيا أي إنما لك تسلط في هذه الدار وهي دار الزوال ونحن قد رغبنا في دار القرار."
    },
    {
      "ayah": 73,
      "surah": 20,
      "text": "\"إنا آمنا بربنا ليغفر لنا خطايانا\" أي ما كان منا من الآثام خصوصا ما أكرهتنا عليه من السحر لتعارض به آية الله تعالى ومعجزة نبيه.وقال ابن أبي حاتم حدثنا أبي حدثنا نعيم بن حماد حدثنا سفيان بن عيينة عن أبي سعيد عن عكرمة عن ابن عباس في قوله تعالى وما أكرهتنا عليه من السحر قال أخذ فرعون أربعين غلاما من بني إسرائيل فأمر أن يعلموا السحر بالفرماء وقال علموهم تعليما لا يعلمه أحد في الأرض قال ابن عباس فهم من الذين آمنوا بموسى وهم من الذين قالوا آمنا بربنا ليغفر لنا خطايانا وما أكرهتنا عليه من السحر وكذا قال عبد الرحمن بن زيد بن أسلم وقوله\" والله خير وأبقى\" أي خير لنا منك وأبقى أي أدوم ثوابا مما كنت وعدتنا ومنيتنا وهو رواية عن ابن إسحاق رحمه الله وقال محمد بن كعب القرظي والله خير أي لنا منك إن أطيع وأبقى أي منك عذابا إن عصي وروي نحوه عن ابن إسحاق أيضا والظاهر أن فرعون لعنه الله صمم على ذلك وفعله بهم رحمة لهم من الله ولهذا قال ابن عباس وغيره من السلف أصبحوا سحرة وأمسوا شهداء."
    },
    {
      "ayah": 74,
      "surah": 20,
      "text": "الظاهر من السياق أن هذا من تمام ما وعظ به السحرة لفرعون يحذرونه من نقمة الله وعذابه الدائم السرمدي ويرغبونه في ثوابه الأبدي المخلد فقالوا إنه من يأت ربه مجرما أي يلقى الله يوم القيامة وهو مجرم فإن له جهنم لا يموت فيها ولا يحيى كقوله\" لا يقضى عليهم فيموتوا ولا يخفف عنهم من عذابها كذلك نجزي كل كفور\" وقال\" ويتجنبها الأشقى الذي يصلى النار الكبرى ثم لا يموت فيها ولا يحيى وقال تعالى\" ونادوا يا مالك ليقض علينا ربك قال إنكم ماكثون وقال الإمام أحمد بن حنبل حدثنا إسماعيل أخبرنا سعيد بن يزيد عن أبي نضرة عن أبي سعيد الخدري قال قال رسول الله صلى الله عليه وسلم \" أما أهل النار الذين هم أهلها فإنهم لا يموتون فيها ولا يحيون ولكن أناس تصيبهم النار بذنوبهم فتميتهم إماتة حتى إذا صاروا فحما أذن في الشفاعة جيء بهم ضبائر ضبائر فبثوا على أنهار الجنة فيقال يا أهل الجنة أفيضوا عليهم فينبتون نبات الحبة تكون في حميل السيل \" فقال رجل من القوم كأن رسول الله صلى الله عليه وسلم كان بالبادية وهكذا أخرجه مسلم في كتابه الصحيح من رواية شعبة وبشر ابن المفضل كلاهما عن أبي سلمة سعيد بن يزيد به وقال ابن أبي حاتم ذكر عن عبد الوارث بن عبد الصمد بن عبد الوارث قال حدثنا أبي حدثنا حبان سمعت سليمان التيمي عن أبي نضرة عن أبي سعيد أن رسول الله صلى الله عليه وسلم خطب فأتى على هذه الآية إنه من يأت ربه مجرما فإن له جهنم لا يموت فيها ولا يحيى قال النبي صلى الله عليه وسلم \" أما أهلها الذين هم أهلها فلا يموتون فيها ولا يحيون وأما الذين ليسوا من أهلها فإن النار تمسهم ثم يقوم الشفعاء فيشفعون فتجعل الضبائر فيؤتى بهم نهرا يقال له الحياة أو الحيوان فينبتون كما ينبت العشب في حميل السيل \"."
    },
    {
      "ayah": 75,
      "surah": 20,
      "text": "وقوله تعالى \"ومن يأته مؤمنا قد عمل الصالحات\" أي ومن لقي ربه يوم المعاد مؤمن القلب قد صدق ضميره بقوله وعمله\" فأولئك لهم الدرجات العلى\" أي الجنة ذات الدرجات العاليات والغرف الآمنات والمساكن الطيبات.قال الإمام أحمد حدثنا عفان أنبأنا همام حدثنا زيد بن أسلم عن عطاء بن يسار عن عبادة بن الصامت عن النبي صلى الله عليه وسلم قال \" الجنة مائة درجة ما بين كل درجتين كما بين السماء والأرض والفردوس أعلاها درجة ومنها تخرج الأنهار الأربعة والعرش فوقها فإذا سألتم الله فاسألوه الفردوس \" ورواه الترمذي من حديث يزيد بن هارون عن همام به وقال ابن أبي حاتم حدثنا أبي حدثنا سليمان بن عبد الرحمن الدمشقي أخبرنا خالد بن يزيد بن أبي مالك عن أبيه قال كان يقال الجنة مائة درجة في كل درجة مائة درجة بين كل درجتين كما بين السماء والأرض فيهن الياقوت والحلي في كل درجة أمير يرون له الفضل والسودد وفي الصحيحين \" إن أهل عليين ليرون من فوقهم كما ترون الكوكب الغابر في أفق السماء لتفاضل ما بينهم- قالوا يا رسول الله تلك منازل الأنبياء قال - بلى والذي نفسي بيده رجال آمنوا بالله وصدقوا المرسلين \" وفي السنن إن أبا بكر وعمر لمنهم وأنعما."
    },
    {
      "ayah": 76,
      "surah": 20,
      "text": "وقوله \"جنات عدن\" أي إقامة وهي بدل من الدرجات العلى \"تجرى من تحتها الأنهار خالدين فيها\" أي ماكثين أبدا \"وذلك جزاء من تزكى\" أي طهر نفسه من الدنس والخبث والشرك وعبد الله وحده لا شريك له واتبع المرسلين فيما جاءوا به من خير وطلب."
    },
    {
      "ayah": 77,
      "surah": 20,
      "text": "يقول تعالى مخبرا أنه أمر موسى حين أبى فرعون أن يرسل معه بني إسرائيل أن يسري بهم في الليل ويذهب بهم من قبضة فرعون وقد بسط الله هذا المقام في غير هذه السورة الكريمة وذلك أن موسى لما خرج ببني إسرائيل أصبحوا وليس منهم بمصر لا داع ولا مجيب فغضب فرعون غضبا شديدا وأرسل في المدائن حاشرين أي من يجمعون له الجند من بلدانه ورساتيقه يقول إن هؤلاء لشرذمة قليلون وإنهم لنا لغائظون ثم لما جمع جنده واستوثق له جيشه ساق في طلبهم فأتبعوهم مشرقين أي عند طلوع الشمس فلما تراءى الجمعان أي نظر كل من الفريقين إلى الآخر قال أصحاب موسى إنا لمدركون قال كلا إن معي ربي سيهدين ووقف موسى ببني إسرائيل البحر أمامهم وفرعون وراءهم فعند ذلك أوحى الله إليه أن اضرب لهم طريقا في البحر يبسا فضرب البحر بعصاه وقال انفلق علي بإذن الله فانفلق فكان كل فرق كالطود العظيم أي الجبل العظيم فأرسل الله الريح على أرض البحر فلفحته حتى صار يابسا كوجه الأرض فلهذا قال فاضرب لهم طريقا يبسا لا تخاف دركا أي من فرعون \"ولا تخشى\" يعني من البحر أن يغرق قومك."
    },
    {
      "ayah": 78,
      "surah": 20,
      "text": "قال تعالى \"فأتبعهم فرعون بجنوده فغشيهم من اليم\" أي البحر ما غشيهم أي الذي هو معروف ومشهور وهذا يقال عند الأمر المعروف المشهور كما قال تعالى {والمؤتفكة أهوى فغشاها ما غشى} وقال الشاعر: أنا أبو النجم وشعري شعرى. أي الذي يعرف وهو مشهور وكما تقدمهم فرعون فسلك بهم في اليم فأضلهم وما هداهم إلى سبيل الرشاد كذلك يقدم قومه يوم القيامة فأوردهم النار وبئس الورد المورود."
    },
    { "ayah": 79, "surah": 20, "text": "لا يوجد تفسير لهذه الأية" },
    {
      "ayah": 8,
      "surah": 20,
      "text": "أي الذي أنزل عليك القرآن هو الله الذي لا إله إلا هو ذو الأسماء الحسنى والصفات العلى وقد تقدم بيان الأحاديث الواردة في الأسماء الحسنى في أواخر سورة الأعراف ولله الحمد والمنة."
    },
    {
      "ayah": 80,
      "surah": 20,
      "text": "يذكر تعالى نعمه على بني إسرائيل العظام ومننه الجسام حيث أنجاهم من عدوهم فرعون وأقر أعينهم منه وهم ينظرون إليه وإلى جنده قد غرقوا في صبيحة واحدة لم ينج منهم أحد كما قال وأغرقنا آل فرعون وأنتم تنظرون وقال البخاري حدثنا يعقوب بن إبراهيم حدثنا روح بن عبادة حدثنا شعبة حدثنا أبو بشر عن سعيد بن جبير عن ابن عباس قال لما قدم رسول الله صلى الله عليه وسلم المدينة وجد اليهود تصوم عاشوراء فسألهم فقالوا هذا اليوم الذي أظفر الله فيه موسى على فرعون فقال \" نحن أولى بموسى فصوموه \" رواه مسلم أيضا في صحيحه ثم إنه تعالى واعد موسى وبني إسرائيل بعد هلاك فرعون إلى جانب الطور الأيمن وهو الذي كلمه الله تعالى عليه وسأل فيه الرؤية وأعطاه التوراة هنالك وفي غضون ذلك عبد بنو إسرائيل العجل كما يقصه الله تعالى قريبا وأما المن والسلوى فقد تقدم الكلام على ذلك في سورة البقرة وغيرها فالمن حلوى كانت تنزل عليه من السماء والسلوى طائر يسقط عليهم فيأخذون من كل قدر الحاجة إلى الغد لطفا من الله ورحمة بهم وإحسانا إليهم."
    },
    {
      "ayah": 81,
      "surah": 20,
      "text": "قال تعالى \"كلوا من طيبات ما رزقناكم ولا تطغوا فيه فيحل عليكم غضبي\" أي كلوا من هذا الرزق الذي رزقتكم ولا تطغوا في رزقي فتأخذوه من غير حاجة وتخالفوا ما أمرتكم به فيحل عليكم غضبي أي أغضب عليكم ومن يحلل عليه غضبي فقد هوى قال علي بن أبي طلحة عن ابن عباس أي فقد شقي وقال شفي بن مانع إن في جهنم قصرا يرمى الكافر من أعلاه فيهوي في جهنم أربعين خريفا قبل أن يبلغ الصلصال وذلك قوله ومن يحلل عليه غضبي فقد هوى\" رواه ابن أبي حاتم."
    },
    {
      "ayah": 82,
      "surah": 20,
      "text": "وقوله \"وإنى لغفار لمن تاب وآمن وعمل صالحا\" أي كل من تاب إلي تبت عليه من أي ذنب كان حتى إنه تاب تعالى على من عبد العجل من بني إسرائيل وقوله تعالى \"تاب\" أى رجع عما كان فيه من كفر أو شرك أو معصية أو نفاق وقوله \"وآمن\" أي بقلبه \"وعمل صالحا\" أي بجوارحه وقوله \"ثم اهتدى\" قال على بن أبي طلحة عن ابن عباس أي ثم لم يشكك وقال سعيد بن جبير \"ثم اهتدى\" أي استقام على السنة والجماعة وروي نحوه عن مجاهد والضحاك وغير واحد من السلف وقال قتادة \"ثم اهتدى\" أي لزم الإسلام حتى يموت وقال سقيان الثوري \"ثم اهتدى\" أي علم أن لهذا ثوابا وثم ههنا لترتيب الخبر على الخبر كقوله \"ثم كان من الذين آمنوا وعملوا الصالحات\"."
    },
    {
      "ayah": 83,
      "surah": 20,
      "text": "لما سار موسى عليه السلام ببني إسرائيل بعد هلاك فرعون وأتوا على قوم يعكفون على أصنام لهم فقالوا يا موسى اجعل لنا إلها كما لهم آلهة قال إنكم قوم تجهلون إن هؤلاء متبر ما هم فيه وباطل ما كانوا يعملون وواعده ربه ثلاثين ليلة ثم أتبعها عشرا فتمت أربعين ليلة أي يصومها ليلا ونهارا وقد تقدم في حديث الفتون بيان ذلك فسارع موسى عليه السلام مبادرا إلى الطور واستخلف على بني إسرائيل أخاه هارون."
    },
    {
      "ayah": 84,
      "surah": 20,
      "text": "لما سار موسى ببني إسرائيل بعد هلاك فرعون وأتوا على قوم يعكفون على أصنام لهم فقالوا يا موسى اجعل لنا إلها كما لهم آلهة قال إنكم قوم تجهلون إن هؤلاء متبر ما هم فيه وباطل ما كانوا يعملون وواعده ربه ثلاثين ليلة ثم أتبعها عشرا فتمت أربعين ليلة أي يصومها ليلا ونهارا وقد تقدم في حديث الفتون بيان ذلك فسارع موسى عليه السلام مبادرا إلى الطور واستخلف على بني إسرائيل أخاه هارون ولهذا قال تعالى وما أعجلك عن قومك يا موسى قال هم أولاء على أثري\" أي قادمون ينزلون قريبا من الطور."
    },
    {
      "ayah": 85,
      "surah": 20,
      "text": "\"قال فإنا قد فتنا قومك من بعدك وأضلهم السامري \"أخبر تعالى نبيه موسى بما كان بعده من الحدث في بني إسرائيل وعبادتهم العجل الذي عمله لهم ذلك السامري. وفي الكتب الإسرائيلية أنه كان اسمه هارون أيضا وكتب الله تعالى له في هذه المدة الألواح المتضمنة للتوراة كما قال تعالى وكتبنا له في الألواح من كل شيء موعظة وتفصيلا لكل شيء فخذها بقوة وأمر قومك يأخذوا بأحسنها سأريكم دار الفاسقين\" أي عاقبة الخارجين عن طاعتي المخالفين لأمري."
    },
    {
      "ayah": 86,
      "surah": 20,
      "text": "وقوله \"فرجع موسى إلى قومه غضبان أسفا\" أي بعد ما أخبره تعالى بذلك في غاية الغضب والحنق عليهم هو فيما هو فيه من الاعتناء بأمرهم وتسلم التوراة التي فيها شريعتهم وفيها شرف لهم وهم قوم قد عبدوا غير الله ما يعلم كل عاقل له لب وحزم بطلان ما هم فيه وسخافة عقولهم وأذهانهم ولهذا قال رجع إليهم غضبان أسفا والأسف شدة الغضب وقال مجاهد غضبان أسفا أي جزعا وقال قتادة والسدي أسفا حزينا على ما صنع قومه من بعده قال يا قوم ألم يعدكم ربكم وعدا حسنا أي أما وعدكم على لساني كل خير في الدنيا والآخرة وحسن العاقبة كما شاهدتم من نصرته إياكم على عدوكم وإظهاركم عليه وغير ذلك من أيادي الله أفطال عليكم العهد أي في انتظار ما وعدكم الله ونسيان ما سلف من نعمه وما بالعهد من قدم أم أردتم أن يحل عليكم غضب من ربكم أم ههنا بمعنى بل وهي للإضراب عن الكلام الأول وعدول إلى الثاني كأنه يقول بل أردتم بصنيعكم هذا أن يحل عليكم غضب من ربكم فأخلفتم موعدي قالوا أي بنو إسرائيل في جواب ما أنبهم موسى وقرعهم."
    },
    {
      "ayah": 87,
      "surah": 20,
      "text": "\"ما أخلفنا موعدك بملكنا\" أي عن قدرتنا واختيارنا ثم شرعوا يعتذرون بالعذر البارد يخبرونه عن تورعهم عما كان بأيديهم من حلي القبط الذي كانوا قد استعاروه منهم حين خرجوا من مصر فقذفناها أي ألقيناها عنا وقد تقدم فى حديث الفتون أن هارون هو الذي كان أمرهم بإلقاء الحلي في حفرة فيها نار وهي في رواية السدي عن أبي مالك عن ابن عباس إنما أراد هارون أن يجتمع الحلي كله في تلك الحفيرة ويجعل حجرا واحدا حتى إذا رجع موسى رأى فيه ما يشاء ثم جاء ذلك السامري فألقى عليها تلك القبضة التي أخذها من أثر الرسول وسأل من هارون أن يدعو الله أن يستجيب له في دعوة فدعا له هارون وهو لا يعلم ما يريد فأجيب له فقال السامري عند ذلك أسأل الله أن يكون عجلا فكان عجلا له خوار أي صوت استدراجا وإمهالا ومحنة واختبارا."
    },
    {
      "ayah": 88,
      "surah": 20,
      "text": "قال \"فكذلك ألقى السامري فأخرج لهم عجلا جسدا له خوار\" وقال ابن أبي حاتم حدثنا محمد بن عبادة بن البختري. حدثنا يزيد بن هارون أخبرنا حماد عن سماك عن سعيد بن جبير عن ابن عباس أن هارون مر بالسامري وهو ينحت العجل فقال له ما تصنع فقال أصنع ما يضر ولا ينفع فقال هارون اللهم أعطه ما سأل على ما في نفسه ومضى هارون وقال السامري اللهم إني أسألك أن يخور فخار فكان إذا خار سجدوا له وإذا خار رفعوا رءوسهم. ثم رواه من وجه آخر عن حماد وقال أعمل ما ينفع ولا يضر وقال السدي كان يخور ويمشي فقالوا أي الضلال منهم الذين افتتنوا بالعجل وعبـدوه هذا إلهكم وإله موسى فنسي\" أن نسيه ههنا وذهب يتطلبه كذا تقدم في حديث الفتون عن ابن عباس وبه قال مجاهد وقال سماك عن عكرمة عن ابن عباس فنسي أي نسي أن يذكركم أن هذا إلهكم وقال محمد بن إسحاق عن حكيم بن جبير عن سعيد بن جبير عن ابن عباس فقال هذا إلهكم وإله موسى قال فعكفوا عليه وأحبوه حبا لم يحبوا شيئا قط يعني مثله يقول الله فنسي أي ترك ما كان عليه من الإسلام يعني السامري قال الله تعالى ردا عليهم وتقريعا لهم وبيانا لفضيحتهم وسخافة عقولهم فيما ذهبوا إليه."
    },
    {
      "ayah": 89,
      "surah": 20,
      "text": "\"أفلا يرون أن لا يرجع إليهم قولا ولا يملك لهم ضرا ولا نفعا\"أي العجل أفلا يرون أنه لا يجيبهم إذا سألوه ولا إذا خاطبوه ولا يملك لهم ضرا ولا نفعا أي في دنياهم ولا في أخراهم قال ابن عباس رضي الله عنهما لا والله ما كان خواره إلا أن يدخل الريح في دبره فيخرج من فمه فيسمع له صوت وقد تقدم في حديث الفتون عن الحسن البصري أن هذا العجل اسمه بهموت وحاصل ما اعتذر به هؤلاء الجهلة أنهم تورعوا عن زينة القبط فألقوها عنهم وعبدوا العجل فتورعوا عن الحقير وفعلوا الأمر الكبير كما جاء في الحديث الصحيح عن عبد الله بن عمر أنه سأله رجل من أهل العراق عن دم البعوض إذا أصاب الثوب يعني هل يصلي فيه أم لا فقال ابن عمر رضي الله عنهما انظروا إلى أهل العراق قتلوا ابن بنت رسول الله صلى الله عليه وسلم يعني الحسين وهم يسألون عن دم البعوضة."
    },
    {
      "ayah": 9,
      "surah": 20,
      "text": "من ههنا شرع تبارك وتعالى في ذكر قصة موسى وكيف كان ابتداء الوحي إليه وتكليمه إياه وذلك بعد ما قضى موسى الأجل الذي كان بينه وبين صهره في رعاية الغنم."
    },
    {
      "ayah": 90,
      "surah": 20,
      "text": "يخبر تعالى عما كان من نهي هارون لهم عن عبادتهم العجل وإخباره إياهم إنما هذا فتنة لكم وإن ربكم الرحمن الذي خلق كل شيء فقدره تقديرا ذو العرش المجيد الفعال لما يريد \"فاتبعونى وأطيعوا أمري \" أي فيما آمركم به واتركوا ما أنهاكم عنه."
    },
    {
      "ayah": 91,
      "surah": 20,
      "text": "\"قالوا لن نبرج عليه عاكفين حتى يرجع إلينا موسى\" أي لا نترك عبادته حتى نسمع كلام موسى فيه وخالفوا هارون في ذلك وحاربوه وكادوا أن يقتلوه."
    },
    {
      "ayah": 92,
      "surah": 20,
      "text": "يخبر تعالى عن موسى عليه السلام حين رجع إلى قومه فرأى ما قد حدث فيهم من الأمر العظيم فامتلأ عند ذلك غضبا وألقى ما كان في يده من الألواح الإلهية وأخذ برأس أخيه يجره إليه وقد قدمنا في سورة الأعراف بسط ذلك وذكرنا هناك حديث \" ليس الخبر كالمعاينة \" وشرع يلوم أخاه هارون فقال ما منعك إذ رأيتهم ضلوا ألا تتبعن أي فتخبرني بهذا الأمر أول ما وقع أفعصيت أمري أي فما كنت قدمت إليك وهو قوله اخلفني في قومى وأصلح ولا تتبع سبيل المفسدين قال يا ابن أم ترفق له بذكر الأم مع أنه شقيقه لأبويه لأن ذكر الأم ههنا أرق وأبلغ في الحنو والعطف ولهذا قال يا ابن أم لا تأخذ بلحيتي ولا برأسي الآية. هذا اعتذار من هارون عند موسى في سبب تأخره عنه حيث لم يلحقه فيخبره بما كان من هذا الخطب الجسيم قال إني خشيت أن أتبعك فأخبرك بهذا فتقول لي لم تركتهم وحدهم وفرقت بينهم ولم ترقب قولي أي وما راعيت ما أمرتك به حيث استخلفتك فيهم قال ابن عباس وكان هارون هائبا مطيعا له."
    },
    {
      "ayah": 93,
      "surah": 20,
      "text": "يخبر تعالى عن موسى عليه السلام حين رجع إلى قومه فرأى ما قد حدث فيهم من الأمر العظيم فامتلأ عند ذلك غضبا وألقى ما كان في يده من الألواح الإلهية وأخذ برأس أخيه يجره إليه وقد قدمنا في سورة الأعراف بسط ذلك وذكرنا هناك حديث \" ليس الخبر كالمعاينة \" وشرع يلوم أخاه هارون فقال ما منعك إذ رأيتهم ضلوا ألا تتبعن أي فتخبرنى بهذا الأمر أول ما وقع أفعصيت أمري أي فما كنت قدمت إليك وهو قوله اخلفني في قومى وأصلح ولا تتبع سبيل المفسدين قال يا ابن أم ترفق له بذكر الأم مع أنه شقيقه لأبويه لأن ذكر الأم ههنا أرق وأبلغ في الحنو والعطف ولهذا قال يا ابن أم لا تأخذ بلحيتي ولا برأسي الآية. هذا اعتذار من هارون عند موسى في سبب تأخره عنه حيث لم يلحقه فيخبره بما كان من هذا الخطب الجسيم قال إنى خشيت أن أتبعك فأخبرك بهذا فتقول لي لم تركتهم وحدهم وفرقت بينهم ولم ترقب قولي أي وما راعيت ما أمرتك به حيث استخلفتك فيهم قال ابن عباس وكان هارون هائبا مطيعا له."
    },
    {
      "ayah": 94,
      "surah": 20,
      "text": "يخبر تعالى عن موسى عليه السلام حين رجع إلى قومه فرأى ما قد حدث فيهم من الأمر العظيم فامتلأ عند ذلك غضبا وألقى ما كان في يده من الألواح الإلهية وأخذ برأس أخيه يجره إليه وقد قدمنا في سورة الأعراف بسط ذلك وذكرنا هناك حديث \" ليس الخبر كالمعاينة \" وشرع يلوم أخاه هارون فقال ما منعك إذ رأيتهم ضلوا ألا تتبعن أي فتخبرنى بهذا الأمر أول ما وقع أفعصيت أمري أي فما كنت قدمت إليك وهو قوله اخلفني في قومى وأصلح ولا تتبع سبيل المفسدبن قال يا ابن أم ترفق له بذكر الأم مع أنه شقيقه لأبويه لأن ذكر الأم ههنا أرق وأبلغ في الحنو والعطف ولهذا قال يا ابن أم لا تأخذ بلحيتي ولا برأسي الآية. هذا اعتذار من هارون عند موسى في سبب تأخره عنه حيث لم يلحقه فيخبره بما كان من هذا الخطب الجسيم قال إنى خشيت أن أتبعك فأخبرك بهذا فتقول لي لم تركتهم وحدهم وفرقت بينهم ولم ترقب قولي أي وما راعيت ما أمرتك به حيث استخلفتك فيهم قال ابن عباس وكان هارون هائبا مطيعا له."
    },
    {
      "ayah": 95,
      "surah": 20,
      "text": "يقول موسى عليه السلام للسامري ما حملك على ما صنعت وما الذي عرض لك حتى فعلت ما فعلت قال محمد بن إسحاق عن حكيم بن جبير عن سعيد بن جبير عن ابن عباس قال: كان السامري رجلا من أهل باجرما وكان من قوم يعبدون البقر وكان حب عبادة البقر في نفسه وكان قد أظهر الإسلام مع بني إسرائيل وكان اسمه موسى بن ظفر وفى رواية عن ابن عباس أنه كان من كرمان وقال قتادة كان من قرية سامرا."
    },
    {
      "ayah": 96,
      "surah": 20,
      "text": "\"قال بصرت بما لم يبصروا به\" أي رأيت جبريل حين جاء لهلاك فرعون فقبضت قبضة من أثر الرسول أي من أثر فرسه هذا هو المشهور عند كثير من المفسرين أو أكثرهم وقال ابن أبي حاتم حدثنا محمد بن عمار بن الحارث أخبرنا عبيد الله بن موسى أخبرنا إسرائيل عن السدي عن أبي بن عمارة عن علي رضي الله عنه قال إن جبريل لما نزل فصعد بموسى إلى السماء بصر به السامري من بين الناس فقبض قبضة من أثر الفرس قال: وحمل جبريل موسى خلفه حتى إذا دنا من باب السماء صعد وكتب الله الألواح وهو يسمع صرير الأقلام في الألواح فلما أخبره أن قومه قد فتنوا من بعده قال نزل موسى فأخذ العجل فأحرقه غريب وقال مجاهد فقبضت قبضة من أثر الرسول قال من تحت حافر فرس جبريل قال والقبضة ملء الكف والقبضة بأطراف الأصابع قال مجاهد نبذ السامري أي ألقى ما كان فى يده على حلية بني إسرائيل فانسبك عجلا جسدا له خوار حفيف الريح فيه فهو خواره وقال ابن أبي حاتم حدثنا محمد بن يحيى أخبرنا علي بن المديني حدثنا يزيد بن زريع حدثنا عمارة حدثنا عكرمة أن السامري رأى الرسول فألقى في روعه إنك إن أخذت من أثر هذا الفرس قبضة فألقيتها في شيء فقلت له كن فكان فقبض قبضة من أمر الرسول فيبست أصابعه على القبضة فلما ذهب موسى للميقات وكان بنو إسرائيل قد استعاروا حلي آل فرعون فقال لهم السامري إنما أصابكم من أجل هذا الحلي فاجمعوا فجمعوه فأوقدوا عليه فذاب فرآه السامري فألقى في روعه أنك لو قذفت هذه القبضة في هذه فقلت كن فكان فقذف القبضة وقال كن فكان عجلا جسدا له خوار فقال هذا إلهكم وإله موسى ولهذا قال فنبذتها أي ألقيتها مع من ألقى وكذلك سولت لي نفسي أى حسنته وأعجبها إذ ذاك."
    },
    {
      "ayah": 97,
      "surah": 20,
      "text": "قال فاذهب فإن لك في الحياة أن تقول لا مساس أي كما أخذت ومسست ما لم يكن لك أخذه ومسه من أثر الرسول فعقوبتك في الدنيا أن تقول لا مساس أي لا تماس الناس ولا يمسونك وإن لك موعدا أي يوم القيامة لن تخلفه أي لا محيد لك عنه وقال قتادة أن تقول لا مساس قال عقوبة لهم وبقاياهم اليوم يقولون لا مساس. وقوله \"وإن لك موعدا لن تخلفه\" قال الحسن وقتادة وأبو نهيك لن تغيب عنه وقوله وانظر إلى إلهك أي معبودك \"الذي ظلت عليه عاكفا\" أي أقمت على عبادته يعني العجل لنحرقنه قال الضحاك عن ابن عباس والسدي سحله بالمبارد وألقاه على النار وقال قتادة استحال العجل من الذهب لحما ودما فحرقه بالنار ثم ألقى رماده في البحر ولهذا قال ثم لننسفنه في اليم نسفا وقال ابن أبي حاتم حدثنا أبي حدثنا عبد الله بن رجاء أنبأنا إسرائيل عن أبي إسحاق عن عمارة بن عبد الله وأبي عبد الرحمن عن علي رضي الله عنه قال: إن موسى لما تعجل إلى ربه عمد السامري فجمع ما قدر عليه من حلي نساء بني إسرائيل ثم صوره عجلا قال فعمد موسى إلى العجل فوضع عليه المبارد فبرده بها وهو على شط نهر فلم يشرب أحد من ذلك الماء ممن كان يعبد العجل إلا اصفر وجهه مثل الذهب فقالوا لموسى ما توبتنا؟ قال يقتل بعضكم بعضا وهكذا قال السدي وقد تقدم في تفسير سورة البقرة ثم في حديث الفتون بسط ذلك."
    },
    {
      "ayah": 98,
      "surah": 20,
      "text": "وقوله تعالى \"إنما إلهكم الله الذي لا إله إلا هو وسع كل شيء علما\" يقول لهم موسى عليه السلام ليس هذا إلهكم إنما إلهكم الله الذي لا إله إلا هو أي لا يستحق ذلك على العباد إلا هو ولا تنبغي العبادة إلا له فإن كل شيء فقير إليه عبد له وقوله وسع كل شيء علما نصب على التميز أي هو عالم بكل شيء أحاط بكل شيء علما وأحصى كل شيء عددا فلا يعزب عنه مثقال ذرة وما تسقط من ورقة إلا يعلمها ولا حبة في ظلمات الأرض ولا رطب ولا يابس إلا في كتاب مبين وما من دابة في الأرض إلا على الله رزقها ويعلم مستقرها ومستودعها كل في كتاب مبين والآيات في هذا كثيرة جدا."
    },
    {
      "ayah": 99,
      "surah": 20,
      "text": "يقول تعالى لنبيه محمد كما قصصنا عليك خبر موسى وما جرى له مع فرعون وجنوده على الجلية والأمر الواقع كذلك نقص عليك الأخبار الماضية كما وقعت من غير زيادة ولا نقص هذا وقد آتيناك من لدنا أي من عندنا ذكرا وهو القرآن العظيم الذي لا يأتيه الباطل من بين يديه ولا من خلفه تنزيل من حكيم حميد الذي لم يعط نبي من الأنبياء منذ بعثوا إلى أن ختموا بمحمد كتابا مثله ولا أكمل منه ولا أجمع لخبر ما سبق وخبر ما هو كائن وحكم الفصل بين الناس منه."
    }
  ]
}
