{
  "ayahs": [
    {
      "ayah": 1,
      "surah": 21,
      "text": "سورة الأنبياء: قال البخاري حدثنا محمد بن بشار ثنا غندر ثنا شعبة عن أبي إسحاق سمعت عبد الرحمن بن زيد عن عبد الله قال \" بنو إسرائيل والكهف ومريم وطه والأنبياء هن من العتاق الأول وهن من تلادي. هذا تنبيه من الله عز وجل على اقتراب الساعة ودنوها وأن الناس في غفلة عنها أي لا يعملون لها ولا يستعدون من أجلها وقال النسائي حدثنا أحمد بن نصر حدثنا هشام بن عبد الملك أبو الوليد الطيالسي حدثنا أبو معاوية حدثنا الأعمش عن أبي صالح عن أبي سعيد عن النبي صلى الله عليه وسلم \" في غفلة معرضون \" قال \" في الدنيا \" وقال تعالى \" أتى أمر الله فلا تستعجلوه\" وقال \" اقتربت الساعة وانشق القمر وإن يروا آية يعرضوا \" الآية وقد روى الحافظ ابن عساكر في ترجمة الحسن بن هانئ أبي نواس الشاعر أنه قال: أشعر الناس الشيخ الطاهر أبو العتاهية حيث يقول: الناس في غفلاتهم ورحا المنية تطحن فقيل له من أين أخذ هذا؟ قال من قول الله تعالى \" اقترب للناس حسابهم وهم في غفلة معرضون \" وروى في ترجمة عامر بن ربيعة من طريق موسى بن عبيد الآمدي عن عبد الرحمن بن زيد بن أسلم عن أبيه عن عامر ابن ربيعة أنه نزل به رجل من العرب فأكرم عامرٌ مثواه وكلم فيه رسول الله صلى الله عليه وسلم فجاءه الرجل فقال إني استقطعت من رسول الله صلى الله عليه وسلم واديا في العرب وقد أردت أن أقطع لك منه قطعة تكون لك ولعقبك من بعدك فقال عامر لا حاجة لي في قطيعتك نزلت اليوم سورة أذهلتنا عن الدنيا \" اقترب للناس حسابهم وهم في غفلة معرضون \" ثم أخبر تعالى أنهم لا يصغون إلى الوحي الذي أنزل الله على رسوله والخطاب مع قريش ومن شابههم من الكفار فقال."
    },
    {
      "ayah": 10,
      "surah": 21,
      "text": "يقول تعالى منبها على شرف القرآن ومحرضا لهم على معرفة قدره \" لقد أنزلنا إليكم كتابا فيه ذكركم \" قال ابن عباس شرفكم وقال مجاهد حديثكم وقال الحسن دينكم \" أفلا تعقلون \" أي هذه النعمة وتتلقونها بالقبول كما قال تعالى \" وإنه لذكر لك ولقومك وسوف تسألون \"."
    },
    {
      "ayah": 100,
      "surah": 21,
      "text": "لهم فيما زفير \" كما قال تعالى \" لهم فيها زفير وشهيق \" والزفير خروج أنفاسهم والشهيق ولوج أنفاسهم \" وهم فيها لا يسمعون \" قال ابن أبي حاتم حدثنا أبي حدثنا علي بن محمد الطنافسي حدثنا ابن فضيل حدثنا عبد الرحمن يعني المسعودي عن أبيه قال: قال ابن مسعود إذا بقي من يخلد في النار جعلوا في توابيت من نار فيها مسامير من نار فلا يرى أحد منهم أنه يعذب في النار غيره ثم تلا عبدالله \" لهم فيها زفير وهم فيها لا يسمعون \" ورواه ابن جرير من حديث حجاج بن محمد عن المسعودي عن يونس بن حبان عن ابن مسعود فذكره."
    },
    {
      "ayah": 101,
      "surah": 21,
      "text": "وقوله \" إن الذين سبقت لهم منا الحسنى \" قال عكـرمة الرحمة وقال غيره السعادة \" أولئك عنها مبعدون \" لما ذكر تعالى أهل النار وعذابهم بسبب شركهم بالله عطف بذكر السعداء من المؤمنين بالله ورسوله وهم الذين سبقت لهم من الله السعادة وأسلفوا الأعمال الصالحة في الدنيا كما قال تعالى \" للذين أحسنوا الحسنى وزيادة \" وقال \" هل جزاء الإحسان إلا الإحسان \" فكما أحسنوا العمل في الدنيا أحسن الله مآبهم وثوابهم ونجاهم من العذاب وحصل لهم جزيل الثواب."
    },
    {
      "ayah": 102,
      "surah": 21,
      "text": "\" لا يسمعون حسيسها \" أي حريقها في الأجساد وقال ابن أبي حاتم حدثنا أبي حدثنا محمد بن عمار حدثنا عفان حدثنا حماد بن سلمة عن أبيه عن أبي عثمان الحريرى أبي عثمان \" لا يسمعون حسيسها \" قال حيات على الصراط تلسعهم فإذا لسعتهم قال حس حس وقوله \" وهم فيما اشتهت أنفسهم خالدون \" فسلمهم من المحذور والمرهوب وحصل لهم المطلوب والمحبوب قال ابن أبي حاتم حدثنا أبي حدثنا أحمد بن أبي شريح حدثنا محمد بن الحسن بن أبي زيد الهمداني عن ليث بن أبي سليم عن ابن عم النعمان بن بشير عن النعمان بن بشير قال وسمر مع علي ذات ليلة فقرأ \" إن الذين سبقت لهم منا الحسنى أولئك عنها مبعدون \" قال أنا منهم وعمر منهم وعثمان منهم والزبير منهم وطلحة منهم وعبدالرحمن منهم أو قال سعد منهم قال وأقيمت الصلاة فقام وأظنه يجر ثوبه وهو يقول \" لا يسمعون حسيسها \" وقال شعبة عن أبي بشر عن يوسف المكي عن محمد بن حاطب قال سمعت عليا يقول في قوله \" إن الذين سبقت لهم منا الحسنى \" قال عثمان وأصحابه ورواه ابن أبي حاتم أيضا ورواه ابن جرير من حديث يوسف بن سعد وليس بابن ماهك عن محمد بن حاطب عن علي فذكره ولفظه عثمان منهم وقال علي بن أبي طلحة عن ابن عباس في قوله \" إن الذين سبقت لهم منا الحسنى أولئك عنها مبعدون \" فأولئك أولياء الله يمرون على الصراط مرا هو أسرع من البرق ويبقى الكفار فيها جثيا فهذا مطابق لما ذكرناه وقال آخرون بل نزلت اسشناء من المعبودين وخرج منهم عزير والمسيح كما قال حجاج بن محمد الأعور عن ابن جريج وعثمان عن عطاء عن ابن عباس \" إنكم وما تعبدون من دون الله حصب جهنم أنتم لها واردون \" ثم استثنى فقال \" إن الذين سبقت لهم منا الحسنى \" فيقال هم الملائكة وعيسى ونحو ذلك مما يعبد من دون الله عز وجل وكذا قال عكرمة والحسن وابن جريج وقال الضحاك عن ابن عباس في قوله \" إن الذين سبقت لهم منا الحسنى \" قال نزلت في عيسى ابن مريم وعزير عليه الصلاة والسلام وقال ابن أبي حاتم حدثنا أبي حدثنا الحسين بن عيسى بن ميسرة حدثنا أبو زهير حدثنا سعد بن طريف عن الأصبغ عن علي في قوله \" إن الذين سبقت لهم منا الحسنى \" قال كل شيء يعبد من دون الله في النار إلا الشمس والقمر وعيسى ابن مريم إسناده ضعيف. وقال ابن أبي نجيح عن مجاهد \" أولئك عنها مبعدون \" قال عيسى وعزير والملائكة وقال الضحاك عيسى ومريم والملائكة والشمس والقمر وكذا روي عن سعيد بن جبير وأبي صالح وغير واحد وقد روى ابن أبي حاتم في ذلك حديثا غريبا جدا فقال حدثنا الفضل بن يعقوب المرخاني حدثنا سعد بن مسلمة بن عبدالملك حدثنا الليث بن أبي سليم عن مغيث عن أبي هريرة عن النبي صلى الله عليه وسلم في قوله \" إن الذين سبقت لهم منا الحسنى أولئك عنها مبعدون \" قال عيسى وعزير والملائكة وذكر بعضهم قصة بن الزبعرى ومناظرة المشركين قال أبو بكر بن مردوية حدثنا محمد بن على بن سهل حدثنا محمد بن حسن الأنماطي حدثنا إبراهيم بن محمد بن عرعرة حدثنا بن أبي حكيم حدثنا الحكم يعني ابن عكرمة عن ابن عباس قال: جاء عبد الله الزبعرى إلى النبي صلى الله عليه وسلم فقال: تزعم أن الله أنزل عليك هذه الآية \" إنكم وما تعبدون من دون الله حصب جهنم أنتم لها واردون \" فقال ابن الزبعرى قد عبدت الشمس والقمر والملائكة وعزير وعيسى ابن مريم كل هؤلاء في النار مع آلهتنا ؟ فنزلت \" ولما ضرب ابن مريم مثلا إذا قومك منه يصدون \" وقالوا أآلهتنا خير أم هو ما ضربوه لك إلا جدلا بل هم قوم خصمون \" ثم نزلت \" إن الذين سبقت لهم منا الحسنى أولئك عنها مبعدون \" رواه الحافظ أبو عبد الله في كتابه الأحاديث المختارة وقال ابن أبي حاتم حدثنا أبي حدثنا قبيصة بن عقبة حدثنا سفيان يعني الثوري عن الأعمش عن أصحابه عن ابن عباس قال لما نزلت \" إنكم وما تعبدون من دون الله حصب جهنم أنتم لها واردون \" قال المشركون فالملائكة وعزير وعيسى يعبدون من دون الله فنزلت \" لو كان هؤلاء آلهة ما وردوها \" الآلهة التي يعبدون \" وكل فيها خالدون \" وروي عن أبي كدينة عن عطاء بن السائب عن سعيد بن جبير عن ابن عباس مثل ذلك وقال فنزلت \" إن الذين سبقت لهم منا الحسنى أولئك عنها مبعدون \" وقال محمد بن إسحاق بن يسار رحمه الله في كتاب السيرة وجلس رسول الله صلى الله عليه وسلم فيما بلغني يوما مع الوليد بن المغيرة في المسجد فجاء النضر بن الحارث حتى جلس معهم وفي المسجد غير واحد من رجال قريش فتكلم رسول الله صلى الله عليه وسلم فعرض له النضر بن الحارث فكلمه رسول الله صلى الله عليه وسلم حتى أفحمه وتلا عليه وعليهم \" إنكم وما تعبدون من دون الله حصب جهنم أنتم لها واردون - إلى قوله - وهم فيها لا يسمعون \" ثم قام رسول الله صلى الله عليه وسلم وأقبل عبد الله بن الزبعرى السهمي حتى جلس معهم فقال الوليد بن المغيرة لعبد الله بن الزبعرى: والله ما قام النضر بن الحارث لابن عبد المطلب أنفا ولا قعد وقد زعم محمد أنا وما نعبد من آلهتنا هذه حصب جهنم فقال عبد الله بن الزبعرى أما والله لو وجدته لخصمته فسلوا محمدا كل ما يعبد من دون الله في جهنم مع من عبده فنحن نعبد الملائكة واليهود تعبد عزيرا والنصارى تعبد المسيح عيسى ابن مريم فعجب الوليد ومن كان معه في المجلس من قول عبد الله بن الزبعرى ورأوا أنه قد احتج وخاصم فذكر ذلك لرسول الله صلى الله عليه وسلم فقال: \" كل من أحب أن يعبد من دون الله فهو مع من عبده إنهم إنما يعبدون الشيطان ومن أمرهم بعبادته \" وأنزل الله \" إن الذين سبقت لهم منا الحسنى أولئك عنها مبعدون \" لا يسمعون حسيسها وهم فيها اشتهت أنفسهم خالدون \" أي عيسى وعزير ومن عبدوا من الأحبار والرهبان الذين مضوا على طاعة الله فاتخذهم من يعبدهم من أهل الضلالة أربابا من دون الله ونزل فيما يذكرون أنهم يعبدون الملائكة وأنهم بنات الله \" وقالوا اتخذ الرحمن ولدا سبحانه بل عباد مكرمون - إلى قوله - ومن يقل منهم إني إله من دونه فذلك نجزيه جهنم كذلك نجزي الظالمين \" ونزل فيما ذكر من أمر عيسى وأنه يعبد من دون الله وعجب الوليد ومن حضره من حجته وخصومته \" ولما ضرب ابن مريم مثلا إذا قومك منه يصدون \" وقالوا آلهتنا خير أم هو ما ضربوه لك إلا جدلا بل هم قوم خصمون \" إن هو إلا عبد أنعمنا عليه وجعلناه مثلا لبني إسرائيل\" ولو نشاء لجعلنا منكم ملائكة في الأرض يخلفون وإنه لعلم للساعة فلا تمترن بها \" أي ما وضعت على يديه من الآيات من إحياء الموتى لأبراء الأسقام فكفى به دليلا على علم الساعة يقول \" فلا تمترن بها واتبعون هذا صراط مستقيم \" وهذا الذي قاله ابن الزبعرى خطأ كبير لأن الآية إنما نزلت خطابا لأهل مكة في عبادتهم الأصنام التي هي جماد لا تعقل ليكون ذلك تقريعا وتوبيخا لعابديها ولهذا قال \" إنكم وما تعبدون من دون الله حصب جهنم \" فكيف يورد على هذا المسيح والعزير ونحوهما ممن له عمل صالح ولم يرض بعبادة من عبده وعول ابن جرير في تفسيره في الجواب على أن ما لما لا يعقل عند العرب وقد أسلم عبد الله بن الزبعرى بعد ذلك وكان من الشعراء المشهورين وقد كان يهاجي المسلمين أولا ثم قال معتذرا يا رسـول الملــيك إن لسانــي راتق ما فتقت إذ أنا بور إذ أجاري الشيطان في سنن الغي ومـن مـال مـيله مـثـبور."
    },
    {
      "ayah": 103,
      "surah": 21,
      "text": "وقوله \" لا يحزنهم الفزع الأكبر \" قيل المراد بذلك الموت رواه عبد الرزاق عن يحيى بن ربيعه عن عطاء وقيل المراد بالفزع الأكبر النفخة في الصور قاله العوفي عن ابن عباس وأبو سنان سعيد بن سنان الشيبانى واختاره ابن جرير في تفسيره وقيل حين يؤمر بالعبد إلى النار قاله الحسن البصري وقيل حين تطبق النار على أهلها قاله سعيد سنان واختاره ابن جرير في تفسيره وقيل حين يذبح الموت بين الجنة والنار قاله أبو بكر الهذلي فيما رواه ابن أبي حاتم عنه. وقوله \" وتتلقاهم الملائكة هذا يومكم الذي كنتم توعدون \" يعني تقول لهم الملائكة تبشرهم يوم معادهم إذا خرجوا من قبورهم \" هذا يومكم الذي كنتم توعدون \" أي فأملوا ما يسركم."
    },
    {
      "ayah": 104,
      "surah": 21,
      "text": "يقول تعالى هذا كائن يوم القيامة \" يوم نطوي السماء كطي السجل للكتب كما قال تعالى \" وما قدروا الله حق قدره والأرض جميعا قبضته يوم القيامة والسموات مطويات بيمينه سبحانه وتعالى عما يشركون \" وقد قال البخاري حدثنا مقدم بن محمد حدثني عمي القاسم بن يحيى عن عبيدالله عن نافع عن ابن عمر عن رسول الله صلى الله عليه وسلم قال: \" إن الله يقبض يوم القيامةالأرضين وتكون السموات بيمينه \" انفرد به من هذا الوجه البخاري رحمه الله وقال ابن أبي حاتم حدثنا أبي حدثنا محمد بن أحمد بن الحجاج الرقي حدثنا محمد بن سلمة عن أبي الواصل عن أبي المليح الأزدي عن أبي الجوزاء الأزدي عن ابن عباس قال: يطوي الله السموات السبع بما فيها من الخليقه والأرضين السبع بما فيها من الخليقة يطوي ذلك كله بيمينه يكون ذلك كله في يده بمنزله خردلة وقوله \" كطي السجل للكتب \" قيل المراد بالسجل الكتاب وقيل المراد بالسجل ههنا ملك من الملائكة قال ابن أبي حاتم حدثنا على بن الحسين حدثنا محمد بن العلاء حدثنا يحيى بن يمان حدثنا أبو الوفاء الأشجعي عن أبيه عن ابن عمر في قوله تعالى \" يوم نطوي السماء كطي السجل للكتب \" قال السجل ملك فإذا صعد بالاستغفار قال اكتبها نورا وهكذا رواه ابن جرير عن أبي كريب عن ابن يمان به قال ابن أبي حاتم: وروي عن أبي جعفر محمد بن علي بن الحسين أن السجل ملك وقال السدي في هذه الآية السجل ملك موكل بالصحف فإذا مات الإنسان رفع كتابه إلى السجل فطواه ورفعه إلى يوم القيامة وقيل المراد به اسم رجل صحابي كان يكتب للنبي صلى الله عليه وسلم الوحي قال ابن أبي حاتم حدثنا أبو زرعة حدثنا نصر بن علي الجهضمي حدثنا نوح بن قيس عن عمرو ابن مالك عن أبي الجوزاء عن ابن عباس \" يوم نطوي السماء كطي السجل للكتب \" قال السجل هو الرجل قال نوح و أخبرنى يزيد بن كعب هو العوذي عن عمرو بن مالك عن أبي الجوزاء عن ابن عباس قال: السجـل كاتب للنبي صلى الله عليه وسلم وهكذا رواه أبو داود والنسائي كلاهما عن قتيبة بن سعيد عن نوح بن قيس عن يزيد بن كعب عن عمرو ابن مالك عن أبي الجوزاء عن ابن عباس \" قال:. السجل كاتب للنبي صلى الله عليه وسلم ورواه ابن جرير عن نصر ابن علي الجهضمي كما تقدم ورواه ابن عدي من رواية يحيى بن عمرو بن مالك النكري عن أبيه عن أبي الجوزاء عن ابن عباس قال كان لرسول الله صلى الله عليه وسلم كاتب يسمى السجل وهو قوله \" يوم نطوي السماء كطي السجل للكتب \" قال كما يطوي السجل الكتاب كذلك تطوى السماء ثم قال وهو غير محفوظ وقال الخطيب البغدادي في تاريخه أنبأنا أبو بكر البرقاني أنبأنا محمد بن محمد بن يعقوب الحجاجي أنبأنا أحمد بن الحسين الكرخي أن حمدان ابن سعد حدثهم عن عبدالله بن نمير عن عبيد الله بن عمر عن نافع عن ابن عمر قال: السجل كاتب للنبي صلى الله عليه وسلم وهذا منكر جدا من حديث نافع عن ابن عمر لا يصح أصلا وكذلك ما تقدم عن ابن عباس من رواية أبي داود وغيره لا يصح أيضا وقد صرح جماعة من الحفاظ بوضعه وإن كان في سنن أبي داود منهم شيخنا الحافظ الكبير أبو الحجاج المزي فسح الله في عمره ونسأ في أجله وختم له بصالح عمله وقد أفردت لهذا الحديث جزءا على حدته ولله الحمد. وقد تصدى الإمام أبو جعفر بن جرير للإنكار على هذا الحديث ورده أتم رد وقال: لا يعرف في الصحابة أحد اسمه السجل وكتاب النبي صلى الله عليه وسلم معروفون وليس فيهم أحد اسمه السجل وصدق رحمه الله في ذلك وهو من أقوى الأدلة على نكارة هذا الحديث وأما من ذكره في أسماء الصحابة فإنما اعتمد على هذا الحديث لا على غيره والله أعلم ; والصحيح عن ابن عباس أن السجل هي الصحيفة قاله علي بن أبي طلحة والعوفي عنه ونص على ذلك مجاهد وقتادة وغير واحد واختاره ابن جرير لأنه المعروف في اللغة فعلى هذا يكون معنى الكلام يوم نطوي السماء كطي السجل للكتاب أي على الكتاب بمعنى المكتوب كقوله \" فلما أسلما وتله للجبين \" أي على الجبين وله نظائر في اللغة والله أعلم وقوله \" كما بدأنا أول خلق نعيده وعدا علينا إنا كنا فاعلين \" يعني هذا كائن لا محالة يوم يعيد الله الخلائق خلقا جديدا كما بدأهم هو القادر على إعادتهم وذلك واجب الوقوع لأنه من جملة وعد الله الذي لا يخلف ولا يبدل وهو القادر على ذلك ولهذا قال \" إنا كنا فاعلين \" وقال الإمام أحمد حدثنا وكيع أبو جعفر وعبيدة العمى قالوا حدثنا شعبة عن المغيرة بن النعمان عن سعيد ابن جبير عن ابن عباس قال: قام فينا رسول الله صلى الله عليه وسلم بموعظة فقال \" إنكم محشورون إلى الله عز وجل حفاة عراة غرلا كما بدأنا أول خلق نعيده وعدا علينا إنا كنا فاعلين \" وذكر تمام الحديث أخرجاه في الصحيحين من حديث شعبة ذكره البخاري عند هذه الآية في كتابه وقد روى ليث بن أبي سليم عن مجاهد عن عائشة عن رسول الله صلى الله عليه وسلم نحو ذلك وقال العوفي عن ابن عباس في قوله \" كما بدأنا أول خلق نعيده \" قال: يهلك كل شيء كما كان أول مرة."
    },
    {
      "ayah": 105,
      "surah": 21,
      "text": "يقول تعالى مخبرا عما حتمه وقضاه لعباده الصالحين من السعادة في الدنيا والآخره ووراثة الأرض في الدنيا والآخرة كقوله تعالى \" إن الأرض لله يورثها من يشاء من عباده والعاقبة للمتقين \" وقال \" إنا لننصر رسلنا والذين آمنوا في الحياة الدنيا ويوم يقوم الأشهاد \" وقال \" وعد الله الذين آمنوا منكم وعملوا الصالحات ليستخلفهم في الأرض كما استخلف الذين من قبلهم وليمكنن لهم دينهم الذي ارتضى لهم \" وأخبر تعالى أن هذا مسطور في الكتب الشرعية والقدرية وهو كائن لا محاله ولهذا قال تعالى \" ولقد كتبنا في الزبور من بعد الذكر \" قال الأعمش: سألت سعيد بن جبير عن قوله تعالى \" ولقد كتبنا في الزبور من بعد الذكر \" فقال الزبور: التوراة والإنجيل والقرآن وقال مجاهد الزبور الكتاب وقال ابن عباس والشعبي والحسن وقتادة وغير واحد: الزبور الذي أنزل على داود والذكر التوراة وعن ابن عباس الذكر القرآن وقال سعيد بن جبير الذكر الذي في السماء وقال مجاهد الزبور الكتب بعد الذكر والذكر أم الكتاب عند الله واختار ذلك ابن جرير رحمه الله وكذا قال زيد بن أسلم هو الكتاب الأول وقال الثوري هو اللوح المحفوظ وقال عبد الرحمن بن زيد بن أسلم: الزبور الكتب التي أنزلت على الأنبياء والذكر أم الكتاب الذي يكتب فيه الأشياء قبل ذلك وقال علي بن أبي طلحة عن ابن عباس: أخبر الله سبحانه وتعالى في التوراة والزبور وسابق علمه قبل أن تكون السموات والأرض أن يورث أمة محمد صلى الله عليه وسلم الأرض ويدخلهم الجنة وهم الصالحون وقال مجاهد عن ابن عباس \" إن الأرض يرثها عبادي الصالحون \" قال أرض الجنة وكذا قال أبو العالية ومجاهد وسعيد بن جبير والشعبي وقتادة والسدي وأبو صالح والربيع بن أنس والثوري وقال أبو الدرداء نحن الصالحون وقال السدي هم المؤمنون."
    },
    {
      "ayah": 106,
      "surah": 21,
      "text": "وقوله \" إن في هذا لبلاغا لقوم عابدين \" أي إن في هذا القرآن الذي أنزلناه على عبدنا محمد صلى الله عليه وسلم لبلاغا لمنفعة وكفاية لقوم عابدين وهم الذين عبدوا الله بما شرعه وأحبه ورضيه وآثروا طاعة الله على طاعة الشيطان وشهوات أنفسهم."
    },
    {
      "ayah": 107,
      "surah": 21,
      "text": "وقوله \" وما أرسلناك إلا رحمة للعالمين \" يخبر تعالى أن الله جعل محمدا صلى الله عليه وسلم رحمة للعالمين أي أرسله رحمة لهم كلهم فمن قبل الرحمة وشكر هذه النعمة سعد في الدنيا والآخرة ومن ردها وجحدها خسر الدنيا والآخرة كما قال تعالى \" ألم تر إلى الذين بدلوا نعمة الله كفرا وأحلوا قومهم دار البوار جهنم يصلونها وبئس القرار \" وقال تعالى في صفة القرآن \" قل هو للذين آمنوا هدى وشفاء والذين لا يؤمنون في آذانهم وقر وهو عليهم عمى أولئك ينادون من مكان بعيد \" وقال مسلم في صحيحه حدثنا ابن أبي عمر حدثنا مروان الفزاري عن يزيد بن كيسان عن ابن أبي حازم عن أبي هريرة قال: قيل يا رسول الله أدع على المشركين قال \" إني لم أبعث لعانا وإنما بعثت رحمة \" انفرد بإخراجه مسلم وفي الحديث الآخر \" إنما أنا رحمة مهداة \" رواه عبدالله بن أبي عوانة وغيره عن وكيع عن الأعمش عن أبي صالح عن أبي هريرة مرفوعا قال إبراهيم الحربي وقد رواه غيره عن وكيع فلم يذكر أبا هريرة. وكذا قال البخاري وقد سئل عن هذا الحديث فقال كان عند حفص بن غياث مرسلا. قال الحافظ ابن عساكر وقد رواه مالك بن سعيد بن الخمس عن الأعمش عن أبي صالح عن أبي هريرة مرفوعا ثم ساقه من طريق أبي بكر بن المقري وأبي أحمد الحاكم كلاهما عن بكر ابن محمد بن إبراهيم الصوفي حدثنا إبراهيم بن سعيد الجوهري عن أبي أسامة عن إسماعيل بن أبي خالد عن قيس بن أبي حازم عن أبي هريرة قال: قال رسول الله \" إنما أنا رحمة مهداة \" ثم أورده من طريق الصلت ابن مسعود عن سفيان بن عيينةعن مسعر عن سعيد بن خالد عن رجل عن ابن عمر قال: قال رسول الله صلى الله عليه وسلم \" إن الله بعثني رحمة مهداة بعثت برفع قوم وخفض آخرين \". قال أبو القاسم الطبراني حدثنا أحمد بن محمد بن نافع الطحان حدثنا أحمد بن صالح قال وجدت كلبا بالمدينة عن عبدالعزيز الدراوردي وإبراهيم بن محمد بن عمر ابن عبد الرحمن بن عبد العزيز بن عمرو بن عوف عن محمد بن صالح التمار عن ابن شهاب عن محمد بن جبير ابن مطعم عن أبيه قال: قال أبو جهل حين قدم مكة منصرفه عن خمره يا معشر قريش إن محمدا نزل يثرب وأرسل طلائعه وإنما يريد أن يصيب منكم شيئا فاحذروا أن تمروا طريقه أو مقاربوه فإنه كالأسد الضاري إنه حنق عليكم لأنكم نفيتموه نفي القردان عن المناسم والله إن له لسحرة ما رأيته قط ولا أحدا من أصحابه إلا رأيت معهم الشياطين وإنكم قد عرفتم عداوة ابني قيلة يعني الأوس والخزرج فهو عدو استعان بعدو فقال له مطعم بن عدي: يا أبا الحكم والله ما رأيت أحدا أصدق لسانا ولا أصدق موعدا من أخيكم الذي طردتم وإذ فعلتم الذي فعلتم فكونوا أكف الناس عنه قال أبو سفيان بن الحارث كونوا أشد ما كنتم عليه إن ابني قيلة إن ظفروا بكم لم يرقبوا فيكم إلًا ولا ذمة وإن أطعتموني ألجأتموهم حير كنانة أو تخرجوا محمدا من بين ظهرانيهم فيكون وحيدا مطرودا وأما ابنا قيلة فوالله ما هما وأهل دهلك في المذلة إلا سواء وسأكفيكم حدهم وقال: سأمنح جانبا مني غليظا على ما كان من قرب وبعد رجال الخزرجيــة أهل ذل إذا ما كان هزل بعد جـد فبلغ ذلك رسول الله صلى الله عليه وسلم فقال \" والذي نفسي بيده لأقتلنهم ولأصلبنهم ولأهدينهم وهم كارهون إني رحمة بعثني الله ولا يتوفاني حتى يظهر الله دينه لي خمسة أسماء أنا محمد وأحمد وأنا الماحي الذي يمحو الله بي الكفر وأنا الحاشر الذي يحشر الناس على قدمي وأنا العاقب \" وقال أحمد بن صالح أرجو أن يكون الحديث صحيحا. وقال الإمام أحمد حدثنا معاوية بن عمرو حدثنا زائدة حدثني عمرو بن قيس عن عمرو بن أبي قرة الكندي قال كان حذيفة بالمدائن فكان يذكر أشياء قالها رسول الله صلى الله عليه وسلم فجاء حذيفة إلى سلمان فقال سلمان يا حذيفة إن رسول الله صلى الله عليه وسلم خطب فقال \" أيما رجل سببته في غضبي أو لعنته لعنة فإنما أنا رجل من ولد آدم أغضب كما تغضبون وإنما بعثني الله رحمة للعالمين فأجعلها صلاة عليه يوم القيامة\" ورواه أبو داود عن أحمد بن يونس عن زائدة فإن قيل فأي رحمة حصلت لمن كفر به ؟ فالجواب ما رواه أبو جعفر بن جرير حدثنا إسحاق بن شاهين حدثنا إسحاق الأزرق عن المسعودي عن رجل يقال له سعيد عن سعيد بن جبير عن ابن عباس في قوله \" وما أرسلناك إلا رحمة للعالمين \" قال من آمن بالله واليوم الآخر كتب له الرحمة في الدنيا والآخره ومن لم يؤمن بالله ورسوله عوفي مما أصاب الأمم من الخسف والقذف وهكذا رواه ابن أبي حاتم من حديث المسعودي عن أبي سعد وهو سعيد بن المرزبان البقال عن سعيد بن جبير عن ابن عباس فذكره بنحوه والله أعلم وقد رواه أبو القاسم الطبراني عن عبدان بن أحمد عن عيسى بن يونس الرملي عن أيوب بن سويد عن المسعودي عن حبيب بن أبي ثابت عن سعيد ابن جبير عن ابن عباس \" وما أرسلناك إلا رحمة للعالمين \" قال من تبعه كان له رحمة في الدنيا والآخرة ومن لم يتبعه عوفي مما كان يبتلى به سائر الأمم من الخسف والمسخ والقذف."
    },
    {
      "ayah": 108,
      "surah": 21,
      "text": "يقول تعالى آمرا رسوله صلوات الله وسلامه عليه أن يقول للمشركين \" إنما يوحى إلي أنما إلهكم إله واحد فهل أنتم مسلمون \" أي متبعون على ذلك مستسلمون منقادون له \"."
    },
    {
      "ayah": 109,
      "surah": 21,
      "text": "فإن تولوا \" أي تركوا ما دعوتهم إليه \" فقل آذنتكم على سواء \" أي أعلمتكم أني حرب لكم كما أنكم حرب لي برئ منكم كما أنتم برآء مني كقوله \" فإن كذبوك فقل لي عملي ولكم أعمالكم أنتم بريئون مما أعمل وأنا بريء مما تعملون \" وقال \" وإما تخافن من قوم خيانة فانبذ إليهم على سواء \" أي لكن علمك وعلمهم بنبذ العهود على السواء وهكذا ههنا \" فإن تولوا فقل آذنتكم على سواء \" أي أعلمكم ببراءتي منكم وبراءتكم مني لعلمي بذلك. وقوله \" وإن أدري أقريب أم بعيد ما توعدون \" أي هو واقع لا محالة ولكن لا علم لي بقربة ولا ببعده."
    },
    {
      "ayah": 11,
      "surah": 21,
      "text": "وقوله \" وكم قصمنا من قرية كانت ظالمة \" هذه صيغة تكثير كما قال \" وكم أهلكنا من القرون من بعد نوح \" وقال تعالى \" وكأين من قرية أهلكناها وهي ظالمة فهي خاوية على عروشها \" الآية. وقوله \" وأنشأنا بعدها قوما آخرين \" أي أمة أخرى بعدهم."
    },
    {
      "ayah": 110,
      "surah": 21,
      "text": "\" إنه يعلم الجهر من القول ويعلم ما تكتمون \" أي إن الله يعلم الغيب جميعه ويعلم ما يظهره العباد وما يسرون يعلم الظواهر والضمائر ويعلم السر وأخفى ويعلم ما العباد عاملون في إجهارهم وإسرارهم وسيجزيهم على ذلك القليل والجليل."
    },
    {
      "ayah": 111,
      "surah": 21,
      "text": "وقوله \" وإن أدري لعله فتنة لكم ومتاع إلى حين \" أي وما أدري لعل هذا فتنة لكم ومتاع إلى حين قال ابن جرير لعل تأخير ذلك عنكم فتنة لكم ومتاع إلى أجل مسمى وحكاه عون عن ابن عباس فالله أعلم."
    },
    {
      "ayah": 112,
      "surah": 21,
      "text": "\" قال رب احكم بالحق \" أي افصل بيننا وبين قومنا المكذبين بالحق قال قتادة كانت الأنبياء عليهم السلام يقولون ربنا افتح بيننا وبين قومنا بالحق وأنت خير الفاتحين \" وأمر رسول الله صلى الله عليه وسلم أن يقول ذلك وعن مالك عن زيد بن أسلم كان رسول الله صلى الله عليه وسلم إذا شهد غزاة قال \" رب احكم بالحق \" وقوله \" وربنا الرحمن المستعان على ما تصفون \" أي على ما يقولون ويفترون من الكذب ويتنوعون في مقامات التكذيب والإفك والله المستعان عليكم في ذلك.آخر تفسير سورة الأنبياء ولله الحمد والمنة."
    },
    {
      "ayah": 12,
      "surah": 21,
      "text": "\" فلما أحسوا بأسنا \" أي تيقنوا أن العذاب واقع بهم لا محالة كما وعدهم نبيهم \" إذا هم منها يركضون \" أي يفرون هاربين."
    },
    {
      "ayah": 13,
      "surah": 21,
      "text": "\" لا تركضوا وارجعوا إلى ما أترفتم فيه ومساكنكم \" هذا تهكم بهم نزرا أي قيل لهم نزرا لا تركضوا هاربين من نزول العذاب وارجعوا إلى ما كنتم فيه من النعمة والسرور والمعيشة والمساكن الطيبة قال قتادة استهزاء بهم \" لعلكم تسئلون \" أي عما كنتم فيه من أداء شكر النعم."
    },
    { "ayah": 14, "surah": 21, "text": "\" قالوا يا ويلنا إنا كنا ظالمين \" اعترفوا بذنوبهم حين لا ينفعهم ذلك." },
    {
      "ayah": 15,
      "surah": 21,
      "text": "\" فما زالت تلك دعواهم حتى جعلناهم حصيدا خامدين \" أي ما زالت تلك المقالة وهي الاعتراف بالظلم هجيراهم حتى حصدناهم حصدا وخمدت حركاتهم وأصواتهم خمودا."
    },
    {
      "ayah": 16,
      "surah": 21,
      "text": "يخبر تعالى أنه خلق السموات والأرض بالحق أي بالعدل والقسط ليجزي الذين أساءوا بما عملوا ويجزي الذين أحسنوا بالحسنى والله لم يخلق ذلك عبثا ولا لعبا كما قال \" وما خلقنا السماء والأرض وما بينهما باطلا ذلك ظن الذين كفروا فويل للذين كفروا من النار \"."
    },
    {
      "ayah": 17,
      "surah": 21,
      "text": "قوله تعالى \" لو أردنا أن نتخذ لهوا لاتخذناه من لدنا إن كنا فاعلين \" قال ابن أبي نجيح عن مجاهد \" لو أردنا أن نتخذ لهوا لاتخذناه من لدنا \" يعني من عندنا يقول وما خلقنا جنة ولا نارا ولا موتا ولا بعثا ولا حسابا وقال الحسن وقتادة وغيرهما \" لو أردنا أن نتخذ لهوا \" اللهو المرأة بلسان أهل اليمن وقال إبراهيم النخعي \" لاتخذناه \" من الحور العين وقال عكرمة والسدي: المراد باللهو ههنا الولد وهذا والذي قبله متلازمان وهو كقوله تعالى \" لو أراد الله أن يتخذ ولدا لاصطفى مما يخلق ما يشاء سبحانه هو الله الواحد القهار \" فنزه نفسه عن اتخاذ الولد مطلقا ولا سيما عما يقولون من الإفك والباطل من اتخاذ عيسى أو العزير أو الملائكة \" سبحان الله عما يقولون علوا كبيرا \" وقوله \" إن كنا فاعلين \" قال قتادة والسدي وإبراهيم النخعي ومغيرة بن مقسم أي ما كنا فاعلين وقال مجاهد: كل شيء في القرآن إن فهو إنكار."
    },
    {
      "ayah": 18,
      "surah": 21,
      "text": "وقوله \" بل تقذف بالحق على الباطل \" أي نبين الحق فيدحض الباطل ولهذا قال \" فيدمغه فإذ هو زاهق \" أي ذاهب مضمحل \" ولكم الويل \" أي أيها القاتلون لله ولد \" مما تصفون \" أي تقولون وتفترون ثم أخبر تعالى عن عبودية الملائكة له ودأبهم في طاعته ليلا ونهارا."
    },
    {
      "ayah": 19,
      "surah": 21,
      "text": "فقال \" وله من في السموات والأرض ومن عنده \" يعني الملائكة \" لا يستكبرون عن عبادته \" أي لا يستنكفون عنها كما قال \" لن يستنكف المسيح أن يكون عبدا لله ولا الملائكة المقربون ومن يستنكف عن عبادته ويستكبر فسيحشرهم إليه جميعا \" وقوله \" ولا يستحسرون \" أي لا يعتبرن ولا يملون."
    },
    {
      "ayah": 2,
      "surah": 21,
      "text": "\" ما يأتيهم من ذكر من ربهم محدث \" أي جديد إنزاله \" إلا استمعوه وهم يلعبون \" كما قال ابن عباس: ما لكم تسألون أهل الكتب عما بأيديهم وقد حرفوه وبدلوه وزادوا فيه ونقصوا منه وكتابكم أحدث الكتب بالله تقرءونه محضا لم يشب رواه البخاري بنحوه."
    },
    {
      "ayah": 20,
      "surah": 21,
      "text": "\" يسبحون الليل والنهار لا يفترون \" فهم دائبون في العمل ليلا ونهارا مطيعون قصدا وعملا قادرون عليه كما قال تعالى \" لا يعصون الله ما أمرهم ويفعلون ما يؤمرون \" وقال ابن أبي حاتم حدثنا علي بن أبي دلامة البغدادي أنبأنا عبد الوهاب بن عطاء حدثنا سعيد عن قتادة عن صفوان بن محرز عن حكيم بن حزام قال: بينا رسول الله صلى الله عليه وسلم بين أصحابه إذ قال لهم \" هل تسمعون ما أسمع \" قالوا ما نسمع من شيء. فقال رسول الله صلى الله عليه وسلم \". إني لأسمع أطيط السماء وما تلام أن تئط وما فيها موضع شبر إلا وعليه ملك ساجد أو قائم \" غريب ولم يخرجوه ثم رواه أعني ابن أبي حاتم من طريق يزيد بن أبي زريع عن سعيد عن قتادة مرسلا وقال محمد بن إسحاق عن حسان بن مخارق عن عبد الله بن الحارث بن نوفل قال: جلست إلى كعب الأحبار وأنا غلام فقلت له أرأيت قول الله تعالى للملائكة \" يسبحون الليل والنهار لا يفترون \" أما يشغلهم عن التسبيح الكلام والرسالة والعمل. فقال من هذا الغلام؟ فقالوا من بني عبد المطلب قال فقبل رأسي ثم قال: يا بني إنه جعل لهم التسبيح كما جعل لكم النفس أليس تتكلم وأنت تتنفس وتمشي وأنت تتنفس؟."
    },
    {
      "ayah": 21,
      "surah": 21,
      "text": "ينكر تعالى على من اتخذ من دونه آلهة فقال: \" أم اتخذوا آلهة من الأرض هم ينشرون \" أي أهم يحيون الموتى وينشرونهم من الأرض أي لا يقدرون على شيء من ذلك فكيف جعلوها لله ندا وعبدوها معه ثم أخبر تعالى أنه لو كان في الوجود آلهة غيره لفسدت السموات والأرض."
    },
    {
      "ayah": 22,
      "surah": 21,
      "text": "فقال \" لو كان فيهما آلهة \" أي في السموات والأرض \" لفسدتا \" كقوله تعالى \" ما اتخذ الله من ولد وما كان معه من إله إذا لذهب كل إله بما خلق ولعلا بعضهم على بعض سبحان الله عما يصفون \" وقال ههنا \" فسبحان الله رب العرش عما يصفون \" أي عما يقولون إن له ولدا أو شريك سبحانه وتعالى وتقدس وتنزه عن الذي يفترون ويأفكون علوا كبيرا."
    },
    {
      "ayah": 23,
      "surah": 21,
      "text": "وقوله \" لا يسئل عما يفعل وهم يسئلون \" أي هو الحاكم الذي لا معقب لحكمه ولا يعترض عليه أحد لعظمته وجلاله وكبريائه وعلمه وحكمته وعدله ولطفه \" وهم يسئلون \" أي وهو سائل خلقه عما يعملون كقوله \" فوربك لنسألنهم أجمعين عما كانوا يعملون \" وهذا كقوله تعالى \" وهو يجير ولا يجار عليه \"."
    },
    {
      "ayah": 24,
      "surah": 21,
      "text": "أكثرهم لا يلعمون الحق فهم معرضون يقول تعالى \" أم اتخذوا من دونه آلهة قل \" يا محمد \" هاتوا برهانكم \" أي دليلكم على ما تقولون \" هذا ذكر من معي \" يعني القرآن \" وذكر من قبلي \" يعني الكتب المتقدمة على خلاف ما تقولونه وتزعمون فكل كتاب أنزل على كل نبي أرسل ناطق بأنه لا إله إلا الله ولكن أنتم أيها المشركون لا تعلمون الحق فأنتم معرضون عنه ولهذا."
    },
    {
      "ayah": 25,
      "surah": 21,
      "text": "قال \" وما أرسلنا من قبلك من رسول إلا نوحي إليه أنه لا إله إلا أنا فاعبدون \" كما قال \" واسأل من أرسلنا من قبلك من رسلنا أجعلنا من دون الرحمن آلهة يعبدون \" وقال \" ولقد بعثنا في كل أمة رسولا أن اعبدوا الله واجتنبوا الطاغوت \" فكل نبي بعثه الله يدعو إلى عبادة الله وحده لا شريك له والفطرة شاهدة بذلك أيضا والمشركون لا برهان لهم وحجتهم داحضة عند ربهم وعليم غضب ولهم عذاب شديد."
    },
    {
      "ayah": 26,
      "surah": 21,
      "text": "يقول تعالى رادا على من زعم أن له- تعالى وتقدس - ولدا من الملائكة كمن قال ذلك من العرب إن الملائكة بنات الله فقال \" سبحانه بل عباد مكرمون \" أي الملائكة عباد الله مكرمون عنده في منازل عالية ومقامات سامية وهم له في غاية الطاعة قولا وفعلا."
    },
    {
      "ayah": 27,
      "surah": 21,
      "text": "\" لا يسبقونه بالقول وهم بأمره يعملون \" أي لا يتقدمون بين يديه بأمر ولا يخالفونه فيما أمرهم به بل يبادرون إلى فعله وهو تعالى علمه محيط بهم فلا يخفى عليهم منه خافية \"."
    },
    {
      "ayah": 28,
      "surah": 21,
      "text": "مشفقون يعلم ما بين أيديهم وما خلفهم \" وقوله \" ولا يشفعون إلا لمن ارتضى \" كقوله \" من ذا الذي يشفع عنده إلا بإذنه \" وقوله \" ولا تنفع الشفاعة عنده إلا لمن أذن له \" في آيات كثيرة في معنى ذلك \" وهم من خشيته \" أي من خوفه ورهبته."
    },
    {
      "ayah": 29,
      "surah": 21,
      "text": "ومن يقل منهم إني إله من دونه \" أي من ادعى منهم أنه إله من دون الله أي مع الله \" فذلك نجزيه جهنم كذلك نجزي الظالمين \" أي كل من قال ذلك وهذا شرط والشرط لا يلزم وقوعه كقوله \" قل إن كان للرحمن ولد فأنا أول العابدين \" وقوله \" لئن أشركت ليحبطن عملك ولتكونن من الخاسرين \"."
    },
    {
      "ayah": 3,
      "surah": 21,
      "text": "وقوله \" وأسروا النجوى الذين ظلموا \" أي قائلين فيما بينهم خفية \" هل هذا إلا بشر مثلكم \" يعنون رسول الله صلى الله عليه وسلم يستبعدون كونه نبيا لأنه بشر مثلهم فكيف اختص بالوحي دونهم ولهذا قال \" أفتأتون السحر وأنتم تبصرون \" أي أفتتبعونه فتكونون كمن يأتي السحر وهو يعلم أنه سحر فقال تعالى مجيبا لهم عما افتروه واختلقوه من الكذب."
    },
    {
      "ayah": 30,
      "surah": 21,
      "text": "يقول تعالى منبها على قدرته التامة وسلطانه العظيم في خلقه الأشياء وقهره لجميع المخلوقات فقال \" أو لم ير الذين كفروا \" أي الجاحدون لإلهيته العابدون معه غيره ألم يعلموا أن الله هو المستقل بالخلق المستبد بالتدبير فكيف يليق أن يعبد معه غيره أو يشرك به ما سواه ألم يروا أن السموات والأرض كانتا رتقا أي كان الجميع متصلا بعضه ببعض متلاصق متراكم بعضه فوق بعض في ابتداء الأمر ففتق هذه من هذه فجعل السموات سبعا والأرض سبعا وفصل بين السماء الدنيا والأرض بالهواء فأمطرت السماء وأنبتت الأرض ولهذا قال \" وجعلنا من الماء كل شيء حي أفلا يؤمنون \" أي وهم يشاهدون المخلوقات تحدث شيئا فشيئا عيانا وذلك كله دليل على وجود الصانع الفاعل المختار القادر على ما يشاء. ففي كل شيء له آية تدل عل أنه واحد قال سفيان الثوري عن أبيه عن عكرمة قال سئل ابن عباس: الليل كان قبل أو النهار؟ فقال أرأيتم السموات والأرض حين كانتا رتقا هل كان بينهما إلا ظلمة؟ ذلك لتعلموا أن الليل قبل النهار. وقال ابن أبي حاتم حدثنا أبي حدثنا إبراهيم بن أبي حمزة حدثنا حاتم عن حمزة بن أبي محمد عن عبد الله بن دينار عن ابن عمر أن رجلا أتاه يساله عن السموات والأرض كانتا رتقا ففتقناهما. قال اذهب إلى ذلك الشيخ فاسأله. ثم تعال فأخبرني بما قال لك قال فذهب إلى ابن عباس فسأله فقال ابن عباس نعم كانت السموات رتقا لا تمطر وكانت الأرض رتقا لا تنبت فلما خلق للأرض أهلا فتق هذه بالمطر وفتق هذه بالنبات فرجع الرجل إلى ابن عمر فأخبره فقال ابن عمر الآن قد علمت أن ابن عباس قد أوتي في القرآن علما صدق هكذا كانت قال ابن عمر قد كنت أقول ما يعجبني جراءة ابن عباس على تفسير القرآن فالآن علمت أنه قد أوتي في القرآن علما وقال عطية العوفي كانت هذه رتقا لا تمطر فأمطرت وكانت هذه رتقا لا تنبت فأنبتت وقال إسماعيل بن أبي خالد سألت أبا صالح الحنفي عن قوله \" أن السموات والأرض كانتا رتقا ففتقناهما \" قال كانت السماء واحدة ففتق منها سبع سموات وكانت الأرض واحدة ففتق منها سبع أرضين وهكذا قال مجاهد وزاد ولم تكن السماء والأرض متماستين وقال سعيد بن جبير بل كانت السماء والأرض ملتزقتين فلما رفع السماء وأبرز منها الأرض كان ذلك فتقهما الذي ذكر الله في كتابه وقال الحسن وقتادة كانتا جميعا ففصل بينهما بهذا الهواء وقوله \" وجعلنا من الماء كل شيء حي \" أي أصل كل الأحياء. قال ابن أبي حاتم حدثنا أبي حدثنا أبو الجماهر حدثنا سعيد بن بشير حدثنا قتادة عن أبي ميمونة عن أبي هريرة أنه قال يا نبي الله إذا رأيتك قرت عيني وطابت نفسي فأخبرنا عن كل شيء قال \" كل شيء خلق من ماء \". وقال الإمام أحمد حدثنا يزيد حدثنا همام عن قتادة عن أبي ميمونة عن أبي هريرة قال قلت يا رسول الله إني إذا رأيتك طابت نفسي وقرت عيني فأنبئني عن كل شيء قال \" كل شيء خلق من ماء \" قال قلت أنبئني عن أمر إذا عملت به دخلت الجنة قال \" أفش السلام وأطعم الطعام وصل الأرحام وقم بالليل والناس نيام ثم ادخل الجنة بسلام \" ورواه أيضا عبد الصمد وعفان وبهز عن همام تفرد به أحمد وهذا إسناد على شرط الصحيحين إلا أن أبا ميمونة من رجال السنن واسمه سليم والترمذي يصح له وقد رواه سعيد بن أبي عروبة عن قتادة مرسلا والله أعلم."
    },
    {
      "ayah": 31,
      "surah": 21,
      "text": "وقوله \" وجعلنا في الأرض رواسي \" أي جبالا أرسى الأرض بها وقررها وثقلها لئلا تميد بالناس أي تضطرب وتتحرك فلا يحصل لهم قرار عليها لأنها غامرة في الماء إلا مقدار الربع فإنه باد للهواء والشمس ليشاهد أهلها السماء وما فيها من الآيات الباهرات والحكم والدلالات. ولهذا قال \" أن تميد بهم \" أي لئلا تميد بهم وقوله وجعلنا فيها فجاجا سبلا \" أي ثغرا في الجبال يسلكون فيها طرقا من قطر إلى قطر وإقليم إلى إقليم كما هو المشاهد في الأرض يكون الجبل حائلا بين هذه البلاد وهذه البلاد فيجعل الله فيه فجوة ثغرة ليسلك الناس فيها من ههنا إلى ههنا ولهذا قال \" لعلهم يهتدون \"."
    },
    {
      "ayah": 32,
      "surah": 21,
      "text": "وقوله \" وجعلنا السماء سقفا محفوظا \" أي على الأرض وهي كالقبة عليها كما قال \" والسماء بنيناها بأيد وإنا لموسعون \" وقال \" والسماء وما بناها \" \" أفلم ينظروا إلى السماء فوقهم كيف بنيناها وزيناها ومالها من فروج \" والبناء هو نصب القبة كما قال رسول الله\" صلى الله عليه وسلم\" \" بني الإسلام على خمس \" أي خمسة دعائم وهذا لا يكون إلا في الخيام كما تعهده العرب \" محفوظا \" أي عاليا محروسا أن ينال وقال مجاهد مرفوع. وقال ابن أبي حاتم حدثنا علي بن الحسين حدثنا أحمد بن عبد الرحمن الدشتكي حدثني أبي عن أبيه عن أشعث يعني ابن إسحاق القمي عن جعفر بن أبي المغيرة عن سعيد بن جبير عن ابن عباس قال رجل يا رسول الله ما هذه السماء قال \" موج مكفوف عنكم \" إسناده غريب وقوله \" وهم عن آياتها معرضون \" كقوله \" وكأين من آية في السموات والأرض يمرون عليها وهم عنها معرضون \" أي لا يتفكرون فيما خلق الله فيها من الاتساع العظيم والارتفاع الباهر وما زينت به من الكواكب الثوابت والسيارات في ليلها ونهارها من هذه الشمس التي تقطع الفلك بكماله في يوم وليلة فتسير غاية لا يعلم قدرها إلا الله الذي قدرها وسخرها وسيرها. وقد ذكر ابن أبي الدنيا- رحمه الله- في كتابه التفكر والاعتبار:\" أن بعض عُبَّاد بني إسرائيل تعبد ثلاثين سنة وكان الرجل منهم إذا تعبد ثلاثين سنة أظلته غمامة فلم ير ذلك الرجل شيئا مما كان محصل لغيره فشكى ذلك إلى أمه فقالت له يا بني فلعلك أذنبت في مدة عبادتك هذه فقال لا والله ما أعلمه قالت فلعلك هَمَمْتَ قال لا ولا هُمَمْتُ قالت فلعلك رفعت بصرك إلى السماء ثم رددته بغير فكر فقال نعم كثيرا قالت فمن ههنا أُتِيتَ ثم قال منبها على بعض آياته."
    },
    {
      "ayah": 33,
      "surah": 21,
      "text": "\" وهو الذي خلق الليل والنهار \" أي هذا في ظلامه وسكونه وهذا بضيائه وأنسه يطول هذا تارة ثم يقصر أخرى وعكسه الآخر \" والشمس والقمر \" هذه لها نور يخصها وفلك بذاته وزمان على حدة وحركة وسير خاص وهذا بنور آخر وفلك آخر وسير آخر وتقدير آخر \" وكل في فلك يسبحون \" أي يدورون قال ابن عباس يدورون كما يدور المغزل الفلكة قال مجاهد فلا يدور المغزل إلا بالفلكة ولا الفلكة إلا بالمغزل كذلك النجوم والشمس والقمر لا يدورون إلا به ولا يدور إلا كما قال تعالى \" فالق الإصباح وجعل الليل سكنا والشمس والقمر حسبانا ذلك تقدير العزيز العليم \"."
    },
    {
      "ayah": 34,
      "surah": 21,
      "text": "يقول تعالى \" وما جعلنا لبشر من قبلك \" أي يا محمد \" الخلد \" أي في الدنيا بل \" كل من عليها فان ويبقى وجه ربك ذو الجلال والإكرام \" وقد استدل بهذه الآية الكريمة من ذهب من العلماء إلى أن الخضر عليه السلام مات وليس بحي إلى الآن لأنه بشر سواء كان وليا أو نبيا أو رسولا وقد قال تعالى \" وما جعلنا لبشر من قبلك الخلد \" وقوله \" أفإن مت \" أي يا محمد \" فهم الخالدون \" أي يؤملون أن يعيشوا بعدك لا يكون هذا بل كل إلى الفناء."
    },
    {
      "ayah": 35,
      "surah": 21,
      "text": "ولهذا قال تعالى \" كل نفس ذائقة الموت \" وقد روي عن الشافعي - رحمه الله- أنه أنشد واستشهد بهذين البيتين: تمنى رجــــــال أن أمـوت وإن أمت فتلك سبيل لست فيها بأوحد فقل للذي يبغي خلاف الذي مضـى تهيأ لأخــرى مثلها فكأن قـد وقوله \" ونبلوكم بالشر والخير فتنة \" أي نختبركم بالمصائب تارة وبالنعم أخرى فننظر من يشكر ومن يكفر ومن يصبر ومن يقنط كما قال علي بن أبي طلحة عن ابن عباس \" ونبلوكم \" يقول نبتليكم \" بالشر والخير فتنة \" بالشدة والرخاء والصحة والسقم والغنى والفقر والحلال والحرام والطاعة والمعصية والهدى والضلال وقوله \" وإلينا ترجعون \" أي فنجازيكم بأعمالكم."
    },
    {
      "ayah": 36,
      "surah": 21,
      "text": "يقول تعالى لنبيه صلوات الله وسلامه عليه \" إذا رآك الذين كفروا \" يعني كفار قريش كأبي جهل وأشباهه \" إن يتخذونك إلا هزوا \" أي يستهزئون بك وينتقصونك يقولون \" أهذا الذي يذكر آلهتكم \" يعنون أهذا الذي يسب آلهتكم ويسفه أحلامكم قال تعالى \" وهم بذكر الرحمن هم كافرون \" أي وهم كافرون بالله ومع هذا يستهزءون برسول الله- صلى الله عليه وسلم- كما قال في الآية الأخرى \" وإذا رأوك إن يتخذونك إلا هزوا أهذا الذي بعث الله رسولا إن كاد ليضلنا عن آلهتنا لولا أن صبرنا عليها وسوف يعلمون حين يرون العذاب من أضل سبيلا \"."
    },
    {
      "ayah": 37,
      "surah": 21,
      "text": "وقوله \" خلق الإنسان من عجل \" كما قال في الآية الأخرى \" وكان الإنسان عجولا \" أي في الأمور قال مجاهد خلق الله آدم بعد كل شيء من آخر النهار من يوم خلق الخلائق فلما أحيا الروح عينيه ولسانه ورأسه ولم يبلغ أسفله قال يا رب استعجل بخلقي. قبل غروب الشمس وقال ابن أبي حاتم حدثنا أحمد بن سنان حدثنا يزيد بن هارون أنبأنا محمد بن علقمة بن وقاص الليثي عن أبي سلمة عن أبي هريرة قال قال رسول الله صلى الله عليه وسلم \" خير يوم طلعت فيه الشمس يوم الجمعة فيه خلق آدم وفيه أدخل الجنة وفيه أهبط منها وفيه تقوم الساعة وفيه ساعة لا يوافقها عبد مؤمن يصلي - وقبض أصابعه يقللها - فسأل الله خيرا إلا أعطاه إياه \" قال أبو سلمة فقال عبد الله بن سلام قد عرفت تلك الساعة هي آخر ساعات النهار من يوم الجمعة وهي التي خلق الله فيها آدم قال الله تعالى \" خلق الإنسان من عجل سأريكم آياتي فلا تستعجلون \" والحكمة في ذكر عجلة الإنسان ههنا أنه لما ذكر المستهزئين بالرسول صلوات الله وسلامه عليه وقع في النفوس سرعة الانتقام منهم واستعجلت ذلك فقال الله تعالى خلق الإنسان من عجل لأنه تعالى يملي للظالم حتى إذا أخذه لم يفلته يؤجل ثم يعجل وينظر ثم لا يؤخر ولهذا قال \" سأريك آياتي \" أي نقمي وحكمي واقتداري علي من عصاني \" فلا تستعجلون \"."
    },
    {
      "ayah": 38,
      "surah": 21,
      "text": "يخبر تعالى عن المشركين أنهم يستعجلون أيضا بوقوع العذاب بهم تكذيبا وجحودا وكفرا وعنادا واستبعادا فقال \" ويقولون متى هذا الوعد إن كنتم صادقين \"."
    },
    {
      "ayah": 39,
      "surah": 21,
      "text": "قال الله تعالى \" لو يعلم الذين كفروا حين لا يكفون عن وجوههم النار ولا عن ظهورهم \" أي لو تيقنوا أنها واقعة بهم لا محالة لما استعجلوا به ولو يعلمون حين يغشاهم العذاب من فوقهم ومن تحت أرجلهم \" لهم من فوقهم ظل من النار ومن تحتهم ظلل \" \" لهم من جهنم مهاد ومن فوقهم غواش \" وقال في هذه الآية \" حين لا يكفون عن وجوههم النار ولا عن ظهورهم\" وقال: \" سرابيلهم من قطران وتغشى وجوههم النار \" فالعذاب محيط بهم من جميع جهاتهم \" ولا هم ينصرون أي لا ناصر لهم كما قال \" ومالهم من الله من واق \"."
    },
    {
      "ayah": 4,
      "surah": 21,
      "text": "\" قال ربي يعلم القول في السماء والأرض \" أي الذي يعلم ذلك لا يخفى عليه خافية وهو الذي أنزل هذا القرآن المشتمل على خبر الأولين والآخرين الذي لا يستطيع أحد أن يأتي بمثله إلا الذي يعلم السر في السموات والأرضى وقوله \" وهو السميع العليم \" أي السميع لأقوالكم العليم بأحوالكم وفي هذا تهديد لهم ووعيد."
    },
    {
      "ayah": 40,
      "surah": 21,
      "text": "وقوله \" بل تأتيهم بغتة \" أي \" تأتيهم النار بغتة \" أي فجأة فتبهتهم \" أي تذعرهم فيستسلمون لها حائرين لا يدرون ما يصنعون \" فلا يستطيعون ردها\" أي ليس له حيلة في ذلك ولا هم ينظرون \" أي ولا يؤخر عنهم ذلك ساعة واحدة."
    },
    {
      "ayah": 41,
      "surah": 21,
      "text": "يقول تعالى مسليا لرسوله عما آذاه به المشركون من الاستهزاء والتكذيب \" ولقد استهزئ برسل من قبلك فحاق بالذين سخروا منهم ما كانوا به يستهزءون \" يعني من العذاب الذي كانوا يستبعدون وقوعه كما قال تعالى \" ولقد كذبت رسل من قبلك فصبروا على ما كذبوا وأوذوا حتى أتاهم نصرنا ولا مبدل لكلمات الله ولقد جاءك من نبأ المرسلين\"."
    },
    {
      "ayah": 42,
      "surah": 21,
      "text": "ثم ذكر تعالى نعمته على عبيده في حفظه لهم بالليل والنهار وكلاءته وحراسته لهم بعينه التي لا تنام فقال \" قل من يكلؤكم بالليل والنهار من الرحمن \" أي بدل الرحمن يعني غيره كما قال الشاعر: جارية لم تلبس المرققا ولم تذق من البقول الفستقا أي لم تذق بدل البقول الفستق وقوله تعالى \" بل هم عن ذكر ربهم معرضون \" أي لا يعترفون بنعمة الله عليهم وإحسانه إليهم بل يعرضون عن آياته وآلائه."
    },
    {
      "ayah": 43,
      "surah": 21,
      "text": "ثم قال \" أم لهم آلهة تمنعهم من دوننا \" استفهام إنكار وتقرير. وتوبيخ أي ألهم آلهة تمنعهم وتكلؤهم غيرنا؟ ليس الأمر كما توهموا لا ولا كما زعموا ولها قال \" لا يستطيعون نصر أنفسهم \" أي هذه الآلهة التي استندوا إليها غير الله لا يستطيعون نصر أنفسهم وقوله \" ولا هم منا يصحبون \" قال العوفي عن ابن عباس \" لا هم منا يصحبون \" أي يجارون وقال قتادة لا يصحبون من الله بخير وقال غيره ولا هم منا يصحبون يمنعون."
    },
    {
      "ayah": 44,
      "surah": 21,
      "text": ". يقول تعالى مخبرا عن المشركين إنما غرهم وحملهم على ما هم فيه من الضلال أنهم متعوا في الحياة الدنيا ونعموا وطال عليهم العمر فيما هم فيه قاعتقدوا أنهم على شيء ثم قال واعظا لهم \" أفلا يرون أنا نأتي الأرض ننقصها من أطرافها \" اختلف المفسرون في معناه وقد أسلفناه في سورة الرعد وأحسن ما فسر بقوله تعالى \" ولقد أهلكنا ما حولكم من القرى وصرفنا الآيات لعلهم يرجعون \" وقال الحسن البصري يعني بذلك ظهور الإسلام على الكفر والمعنى أفلا يعتبرون بنصر الله لأوليائه على أعدائه وإهلاكه الأمم المكذبة والقرى الظالمة وإنجائه لعباده المؤمنين ولهذا قال \" أفهم الغالبون \" يعني بل هم المغلوبون الأسفلون الأخسرون الأرذلون وقوله \" قل إنما أنذركم بالوحي \" أي إنما أنا مبلغ عن الله ما أنذرتكم به من العذاب والنكال ليس ذلك إلا عما أوحاه الله إلي ولكن لا يجدي هذا عمن أعمى الله بصيرته وختم على سمعه وقلبه ولهذا قال \" ولا يسمع الصم الدعاء إذا ما ينذرون \"."
    },
    {
      "ayah": 45,
      "surah": 21,
      "text": "قل إنما أنذركم بالوحي ولا يسمع الصم الدعاء إذا ما ينذرونوقوله \" قل إنما أنذركم بالوحي \" أي إنما أنا مبلغ عن الله ما أنذرتكم به من العذاب والنكال ليس ذلك إلا عما أوحاه الله إلي ولكن لا يجدي هذا عمن أعمى الله بصيرته وختم على سمعه وقلبه ولهذا قال \" ولا يسمع الصم الدعاء إذا ما ينذرون \" ."
    },
    {
      "ayah": 46,
      "surah": 21,
      "text": "وقوله \" ولئن مستهم نفحة من عذاب ربك ليقولن يا ولينا إنا كنا ظالمين \" أي ولئن مس هؤلاء المكذبين أدنى شيء من عذاب الله ليعترفون بذنوبهم وأنهم كانوا ظالمي أنفسهم في الدنيا."
    },
    {
      "ayah": 47,
      "surah": 21,
      "text": "وقوله \" ونضع الموازبن القسط ليوم القيامة فلا تظلم نفس شيئا \" أي ونضع الموازين العدل ليوم القيامة الأكثر على أنه إنما هو ميزان واحد وإنما جمع باعتبار تعدد الأعمال الموزونة فيه وقوله \" فلا تظلم نفس شيئا وإن كان مثقال حبة من خردل أتينا بها وكفى بنا حاسبين كما قال تعالى \" ولا يظلم ربك أحدا \" وقال \" إن الله لا يظلم مثقال ذرة وإن تك حسنة يضاعفها ويؤت من لدنه أجرا عظيما \" وقال لقمان \" يا بني إنها إن تك مثقال حبة من خردل فتكن في صخرة أو في السموات أو في الأرض يأت بها الله إن الله لطيف خبير \" وفي الصحيحين عن أبي هريرة قال: قال رسول الله- صلى الله عليه وسلم \" كلمتان خفيفتان على اللسان ثقيلتان في الميزان حبيبتان إلى الرحمن سبحان الله وبحمده سبحان الله العظيم \" وقال الإمام أحمد حدثنا إبراهيم بن إسحاق الطالقاني حدثنا ابن المبارك عن ليث بن سعد عن عامر بن يحيى عن أبي عبد الرحمن الحبلي قال سمعت عبد الله بن عمرو بن العاص يقول قال رسول الله صلى الله عليه وسلم \" إن الله عز وجل يستخلص رجلا من أمتي على رءوس الخلائق يوم القيامة فينشر عليه تسعة وتسعين سجلا كل سجل مد البصر لم يقول أتنكرن هذا شيئا؟ أظلمتك كتبتي الحافظون؟ قال لا يا رب قال أفلك عذر أو حسنة؟ قال فبهت الرجل فيقول لا يا رب فيقول بلى إن لك عندنا حسنة واحدة لا ظلم عليك اليوم فتخرج له بطاقة فيها أشهد أن لا إله إلا الله وأشهد أن محمدا رسول الله فيقول أحضروه فيقول يا رب ما هذه البطاقة مع هذه السجلات؟ فيقول إنك لا تظلم قال فتوضع السجلات في كفة والبطاقة في كفة قال فطاشت السجلات ونقلت البطاقة قال ولا يثقل شيء مع بسم الله الرحمن الرحيم\" ورواه الترمذي وابن ماجه من حديث الليث بن سعد وقال الترمذي حسن غريب وقال الإمام أحمد حدثنا قتيبة حدثنا ابن لهيعة عن عمرو بن يحيى عن أبي عبد الرحمن الحبلي عن عبد الله بن عمرو بن العاص قال قال رسول الله \"صلى الله عليه وسلم\": \" توضع الموازين يوم القيامة فيؤتى بالرجل فيوضع في كفة ويوضع ما أُحصِيَ عليه فيمايل به الميزان قال فيبعث به إلى النار قال فإذا أُدبر به إذا صائح من عند الرحمن عز وجل يقول لا تَعَجَّلُوا فإنه قد بقي له فيؤتى ببطاقة فيها:\" لا إله إلا الله\" فتوضع مع الرجل في كفة حتى يميل به الميزان \" وقال الإمام أحمد أيضا: حدثنا أبو نوح مرارا أنبأنا ليث بن سعد عن مالك بن أنس عن الزهري عن عروة عن عائشة أن رجلا من أصحاب رسول الله\" صلى الله عليه وسلم\" جلس بين يديه فقال يا رسول الله إن لي مملوكين يكذبونني ويخونونني ويعصونني وأضربهم وأشتمهم فكيف أنا منهم فقال له رسول الله\" صلى الله عليه وسلم \": \" يحسب ما خانوك وعصوك وكذبوك وعقابك إياهم فإن كان عقابك إياهم بقدر ذنوبهم كان كفافا لا لك ولا عليك وإن كان عقابك إياهم دون ذنوبهم كان فضلا لك وإن كان عقابك إياهم فوق ذنوبهم اقتص لهم منك الفضل الذي بقي قبلك \" فجعل الرجل يبكي بين يدي رسول الله \"صلى الله عليه وسلم\" ويهتف فقال رسول الله\" صلى الله عليه وسلم\" \" ما له لا يقرأ كتاب الله \" ونضع الموازين القسط ليوم القيامة فلا تظلم نفس شيئا وإن كان مثقال حبة من خردل أتينا بها وكفى بنا حاسبين \" \" فقال الرجل يا رسول الله ما أجد شيئا خيرا من فراق هؤلاء - يعني عبيده - إني أشهدك أنهم أحرار كلهم."
    },
    {
      "ayah": 48,
      "surah": 21,
      "text": "قد تقدم التنبيه على أن الله تعالى كثيرا ما يقرن بين ذكر موسى ومحمد صلوات الله وسلامه عليهما وبين كتابيهما ولهذا قال \" ولقد آتينا موسى وهارون الفرقان \" قال مجاهد يعني الكتاب وقال أبو صالح التوراة وقال قتادة التوراة حلالها وحرامها وما فرق الله بين الحق والباطل وقال ابن زيد يعني النصر وجامع القول في ذلك أن الكتب السماوية مشتملة على التفرقة بين الحق والباطل والهدى والضلال والغي والرشاد والحلال والحرام وعلى ما يحصل نورا في القلوب وهداية وخوف وإنابة وخشية ولهذا قال \" الفرقان وضياء وذكرا للمتقين \" أي تذكيرا لهم وعظة."
    },
    {
      "ayah": 49,
      "surah": 21,
      "text": "ثم وصفهم فقال \" الذين يخشون ربهم بالغيب \" كقوله \" من خشي الرحمن بالغيب وجاء بقلب منيب \" وقوله \" إن الذين يخشون ربهم بالغيب لهم مغفرة وأجر كبير \" \" وهم من الساعة مشفقون \" أي خائفون وجلون."
    },
    {
      "ayah": 5,
      "surah": 21,
      "text": "وقوله \" بل قالوا أضغاث أحلام بل افتراه \" هذا إخبار عن تعنت الكفار وإلحادهم واختلافهم فيما يصفون به القرآن وحيرتهم فيه وضلالهم عنه فتارة يجعلونه سحرا وتارة يجعلونه شعرا وتارة يجعلونه أضغاث أحلام وتارة يجعلونه مفترى كما قال \" انظر كيف ضربوا لك الأمثال فضلوا فلا يستطيعون سبيلا \" وقوله \" فليأتنا بآية كما أرسل الأولون \" يعنون كناقة صالح وآيات موسى وعيسى وقد قال الله \" وما منعنا أن نرسل بالآيات إلا أن كذب بها الأولون \" الآية."
    },
    {
      "ayah": 50,
      "surah": 21,
      "text": "ثم قال تعالى \" وهذا ذكر مبارك أنزلناه \" يعني القرآن العظيم الذي لا يأتيه الباطل من بين يديه ولا من خلفه تنزيل من حكيم حميد \" أفأنتم له منكرون \" أي أفتنكرونه وهو في غاية الجلاء والظهور؟."
    },
    {
      "ayah": 51,
      "surah": 21,
      "text": "يخبر تعالى عن خليله إبراهيم عليه السلام أنه آتاه رشده من قبل أي من صغره ألهمه الحق والحجة على قومه كما قال تعالى \" وتلك حجتنا آتيناها إبراهيم على قومه \" وما يذكر من الأخبار عنه في إدخال أبيه له في السرب وهو رضيع وأنه خرج بعد أيام فنظر إلى الكوكب والمخلوقات فتبصر فيها وما قصه كثير من المفسرين وغيرهم فعامتها أحاديث بني إسرائيل فما وافق منها الحق مما بأيدينا عن المعصوم قبلناه لموافقته الصحيح وما خالف شيئا من ذلك رددناه وما ليس فيه موافقة ولا مخالفة لا نصدقه ولا نكذبه بل نجعله وفقا وما كان من هذا الضرب منها فقد رخص كثير من السلف في روايته وكثير من ذلك ما لا فائدة فيه ولا حاصل له مما ينتفع به في الدين ولو كانت فائدته تعود على المكلفين في دينهم لبينته هذه الشريعة الكاملة الشاملة والذي نسلكه في هذا التفسير الإعراض عن كثير من الأحاديث الإسرائيلية لما فيها من تضييع الزمان ولما اشتمل عليه كثير منها من الكذب المروج عليهم فإنهم لا تفرقة عندهم بين صحيحها وسقيمها كما حرره الأئمة الحفاظ المتقنون من هذه الأمة. والمقصود ههنا أن الله تعالى أخبر أنه قد آتى إبراهيم رشده من قبل أي من قبل ذلك وقوله \" وكنا به عالمين \" أي وكان أهلا لذلك."
    },
    {
      "ayah": 52,
      "surah": 21,
      "text": "ثم قال \" إذ قال لأبيه وقومه ما هذه التماثيل التي أنتم لها عاكفون \" هذا هو الرشد الذي أوتيه من صغره الإنكار على قومه في عبادة الأصنام من دون الله عز وجل فقال \" ما هذه التماثيل التي أنتم لها عاكفون \" أي معتكفون على عبادتها قال ابن أبي حاتم حدثنا الحسن بن محمد الصباح حدثنا أبو معاوية الضرير حدثنا سعيد بن طريف عن الأصبغ بن نباته قال: مر عليٌّ- رضي الله عنه- على قوم يلعبون بالشطرنج فقال ما هذه التماثيل التي أنتم لها عاكفون؟ لأن يمس أحدكم جمرا حتى يطفأ خير له من أن يمسها."
    },
    { "ayah": 53, "surah": 21, "text": "\" قالوا وجدنا آباءنا لها عابدين \" لم يكن لهم حجة سوى صنيع آبائهم الضلال." },
    {
      "ayah": 54,
      "surah": 21,
      "text": "ولهذا قال \" لقد كنتم أنتم وآباؤكم في ضلال مبين \" أي الكلام مع آبائكم الذين احتججتم بصنيعهم كالكلام معكم فأنتم وهم في ضلال على غير الطريق المستقيم فلما سفه أحلامهم وضلل آباءهم واحتقر آلهتهم."
    },
    {
      "ayah": 55,
      "surah": 21,
      "text": "\" قالوا أجئتنا بالحق أم أنت من اللاعبين \" يقولون هذا الكلام الصادر عنك تقوله لاعبا أو محقا فيه فإنا لم نسمع به قبلك."
    },
    {
      "ayah": 56,
      "surah": 21,
      "text": "\" قال بل ربكم رب السموات والأرض الذي فطرهن \" أي ربكم الذي لا إله غيره وهو الذي خلق السموات والأرض وما حوت من المخلوقات الذي ابتدأ خلقهن وهو الخالق لجميع الأشياء \" وأنا على ذلكم من الشاهدبن \" أي وأنا أشهد أنه لا إله غيره ولا رب سواه."
    },
    {
      "ayah": 57,
      "surah": 21,
      "text": "ثم أقسم الخليل قسما أسمعه بعض قومه ليكيدن أصنامهم أي ليحرضن على أذاهم وتكسيرهم بعد أن يولوا مدبرين أي إلى عيدهم وكان لهم عيد يخرجون إليه قال السدي: لما اقترب وقت ذلك العيد قال أبوه يا بني لو خرجت معنا إلى عيدك لأعجبك ديننا فخرج معهم فلما كان ببعض الطريق ألقى نفسه إلى الأرض وقال إني سقيم فجعلوا يمرون عليه وهو صريع فيقولون: مه فيقول إني سقيم فلما جاز عامتهم وبقي ضعفاؤهم قال \" تالله لأكيدن أصنامكم \" فسمعه أولئك وقال ابن إسحاق عن أبي الأحوص عن عبد الله قال: لما خرج قوم إبراهيم إلى عيدهم مروا عليه فقالوا يا إبراهيم ألا تخرج معنا؟ قال إني سقيم وقد كان بالأمس قال \" تالله لأكيدن أصنامكم بعد أن تولوا مدبرين \" فسمعه ناس منهم."
    },
    {
      "ayah": 58,
      "surah": 21,
      "text": "وقوله \" فجعلهم جذاذا \" أي حطاما كسرها كلها إلا كبيرا لهم يعني إلا الصنم الكبير عندهم كما قال \" فراغ عليهم ضربا باليمين \" وقوله \" لعلهم إليه يرجعون \" ذكروا أنه وضع القدوم في يد كبيرهم لعلهم يعتقدون أنه هو الذي غار لنفسه وأنف أن تعبد معه هذه الأصنام الصغار فكسرها."
    },
    {
      "ayah": 59,
      "surah": 21,
      "text": "\" قالوا من فعل هذا بآلهتنا إنه لمن الظالمين \" أي حين رجعوا وشاهدوا ما فعله الخليل بأصنامهم من الإهانة والإذلال الدال على عدم إلهيتها لا وعلى سخافة عقول عابديها \" قالوا من فعل هذا بآلهتنا إنه لمن الظالمين \" أي في صنيعه هذا."
    },
    {
      "ayah": 6,
      "surah": 21,
      "text": "ولهذا قال تعالى \" ما آمنت قبلهم من قرية أهلكناها أفهم يؤمنون \" أي ما آتينا قرية من القرى الذي بعث فيهم الرسل آية على يدي نبيها فآمنوا بها بل كذبوا فأهلكناهم بذلك أفهؤلاء يؤمنون بالآيات لو رأوها دون أولئك؟ كلا بل \" إن الذين حقت عليهم كلمة ربك لا يؤمنون ولو جاءتهم كل آية حتى يروا العذاب الأليم \" هذا كله وقد شاهدوا من الآيات الباهرات والحجج القاطعات والدلائل البينات على يدي رسول الله صلى الله عليه وسلم ما هو أظهر وأجلى وأبهر وأقطع وأقهر مما شوهد مع غيره من الأنبياء صلوات الله وسلامه عليهم أجمعين. قال ابن أبي حاتم رحمه الله ذكر عن زيد بن الحباب حدثنا ابن لهيعة حدثنا الحارث بن زيد الحضرمي عن علي ابن رباح اللخمي حدثني من شهد عبادة بن الصامت يقول: كنا في المسجد ومعنا أبو بكر الصديق رضي الله عنه يقرأ بعض القرآن فجاء عبد الله بن أبي ابن سلول ومعه نمرقة وزربية فوضع واتكأ وكان صبيحا فصيحا جدلا فقال يا أبا بكر قل لمحمد يأتينا بآية كما جاء الأولون؟ جاء موسى بالألواح وجاء داود بالزبور وجاء صالح بالناقة وجاء عيسى بالإنجيل وبالمائدة. فبكى أبو بكر - رضي الله عنه- فخرج رسول- الله صلى الله عليه وسلم- فقال أبو بكر قوموا إلى رسول الله صلى الله عليه وسلم نستغيث به من هذا المنافق فقال رسول الله - صلى الله عليه وسلم: \" إنه لا يقام لي إنما يقام لله عز وجل \" فقلنا يا رسول الله:\" إنا لقينا من هذا المنافق فقال: \" إن جبريل قال لي اخرج فأخبر بنعم الله التي أنعم بها عليك وفضيلته التي فضلت بها فبشرني أني بُعثت إلى الأحمر والأسود وأمرني أن أنذر الجن وآتاني كتابه وأنا أُمِّيٌّ وغفر دنبي ما تقدم وما تأخر وذكر اسمي في الأذان وأمدني بالملائكة وآتاني النصر وجعل الرعب أمامي وآتاتي الكوثر وجعل حوضي من أكثر الحياض يوم القيامة ووعدني المقام المحمود والناس مهطعون مقنعو رءوسهم وجعلني في أول زمرة تخرج من الناس وأدخل في شفاعتي سبعين ألفا من أمتي الجنة بغير حساب وآتاني السلطان والملك وجعلني في أعلى غرفة في الجنة في جنات النعيم فليس فوقي أحد إلا الملائكة الذين يحملون العرش وأجل لي ولأمتي الغنائم ولم تحل لأحد كان قبلنا \" وهذا الحديث غريب جدا."
    },
    {
      "ayah": 60,
      "surah": 21,
      "text": "\" قالوا سمعنا فتى يذكرهم يقال له إبراهيم \" أي قال من سمعه يحلف إنه ليكيدنهم سمعنا فتى أي شابا يذكرهم يقال له إبراهيم قال ابن أبي حاتم حدثنا محمد بن عوف حدثنا سعيد بن منصور حدثنا جرير بن عبد الحميد عن قابوس عن أبيه عن ابن عباس قال: ما بعث الله نبيا إلا شابا ولا أوتي العلم عالم إلا وهو شاب وتلا هذه الآية \" قالوا سمعنا فتى يذكرهم يقال له إبراهيم \"."
    },
    {
      "ayah": 61,
      "surah": 21,
      "text": "وقوله \" قالوا فأتوا به على أعين الناس \" أي على رءوس الأشهاد في الملإ الأكبر بحضرة الناس كلهم وكان هذا هو المقصود الأكبر لإبراهيم عليه السلام أن يبين في هذا المحفل العظيم كثرة جهلهم وقلة عقلهم في عبادة هذه الأصنام التي لا تدفع عن نفسها ضرا ولا تملك لها نصرا فكيف يطلب منها شيء من ذلك؟ \"."
    },
    {
      "ayah": 62,
      "surah": 21,
      "text": "قالوا أأنت فعلت هذا بآلهتنا يا إبراهيم قال بل فعله كبيرهم هذا \" يعني الذي تركه لم يكسره."
    },
    {
      "ayah": 63,
      "surah": 21,
      "text": "\" فاسألوهم إن كانوا ينطقون \" وإنما أراد بهذا أن يبادروا من تلقاء أنفسهم فيعترفوا أنهم لا ينطقون وأن هذا لا يصدر عن هذا الصنم لأنه جماد. وفي الصحيحين من حديث هشام بن حسان عن محمد بن سيرين عن أبي هريرة أن رسول الله\" صلى الله عليه وسلم\" قال \" إن إبراهيم عليه السلام لم يكذب غير ثلاث: ثنتين في ذات الله قوله \" بل فعله كبيرهم هذا \" وقوله \" إني سقيم \" قال وبينا هو يسير في أرض جبار من الجبابرة ومعه سارة إذ نزل منزلا فأتى الجبار رجل فقال إنه قد نزل ههنا رجل بأرضك معه امرأة أحسن الناس فأرسل إليه فجاء فقال ما هذه المرأة منك؟ قال أختي. قال فاذهب فأرسل بها إلي فانطلق إلى سارة فقال إن هذا الجبار قد سألني عنك فأخبرته أنك أختي فلا تكذبيني عنده فإنك أختى في كتاب الله وإنه ليس في الأرض مسلم غيري وغيرك فانطلق بها إبراهيم ثم قام يصلي فلما أن دخلت عليه فرآها أهوى إليها فتناولها فأخذ أخذا شديدا فقال ادعي الله لي ولا أضرك فدعت له فأرسل فأهوى إليها فتناولها فأخذ بمثلها أو أشد ففعل ذلك الثالثة فأخذ فذكر مثل المرتين الأوليين فقال ادعي الله فلا أضرك فدعت له فأرسل ثم دعا أدنى حجابه فقال إنك لم تأتني بإنسان ولكنك أتيتني بشيطان أخرجها وأعطها هاجر فأخرجت وأعطيت هاجر فأقبلت فلما أحس إبراهيم بمجئيها انفتل من صلاته وقال مهيم؟ قالت كفى الله كيد الكافر الفاجر وأخد مني هاجر \" قال محمد بن سيربن فكان أبو هريرة إذا حدث بهذا الحديث قال تلك أمكم يا بني ماء السماء."
    },
    {
      "ayah": 64,
      "surah": 21,
      "text": "يقول تعالى مخبرا عن قوم إبراهيم حين قال لهم ما قال \" فرجعوا إلى أنفسهم \" أي بالملامة في عدم احترازهم وحراستهم لآلهتهم فقالوا \" إنكم أنتم الظالمون \" أي في ترككم لها مهملة لا حافظ عندها \"."
    },
    {
      "ayah": 65,
      "surah": 21,
      "text": "ثم نكسوا على رءوسهم \" أي ثم أطرقوا في الأرض فقالوا \" لقد علمت ما هؤلاء ينطقون \" قال قتادة أدركت القومَ حيرةُ سوءٍ فقالوا \" لقد علمت ما هؤلاء ينطقون \" وقال السدي \" ثم نكسوا على رءوسهم \" أي في الفتنة وقال ابن زيد أي في الرأي وقول قتادة أظهر في المعنى لأنهم إنما فعلوا ذلك حيرة وعجزا ولهذا قالوا له \" لقد علمت ما هؤلاء ينطقون \" فكيف تقول لنا سلوهم إن كانوا ينطقون وأنت تعلم أنها لا تنطق فعندها قال لهم إبراهيم لما اعترفوا بذلك \"."
    },
    {
      "ayah": 66,
      "surah": 21,
      "text": "أفتعبدون من دون الله ما لا ينفعكم شيئا ولا يضركم \" أي إذا كانت لا تنطق وهي لا تنفع ولا تضر فلم تعبدونها من دون الله \"."
    },
    {
      "ayah": 67,
      "surah": 21,
      "text": "أي أفلا تتدبرون ما أنتم فيه من الضلال والكفر الغليظ الذي لا يروح إلا على جاهل ظالم فاجر فأقام عليهم الحجة وألزمهم بها ولهدا قال تعالى \" وتلك حجتنا آتينا إبراهيم على قومه \" الآية."
    },
    {
      "ayah": 68,
      "surah": 21,
      "text": "لما دحضت حجتهم وبان عجزهم وظهر الحق اندفع الباطل عدلوا إلى استعمال جاه ملكهم فقالوا \" حرقوه وانصروا آلهتكم إن كنتم فاعلين \" فجمعوا حطبا كثيرا جدا قال السدي حتى إن كانت المرأة تمرض فتنذر إن عوفيت أن تحمل حطبا لحريق إبراهيم ثم جعلوه في جوبة من الأرض وأضرموها نارا فكان لها شرر عظيم ولهب مرتفع لم توقد نار قط مثلها وجعلوا إبراهيم عليه السلام في كفة المنجنيق بإشارة رجل من أعراب فارس من الأكراد قال شعيب الجبائي اسمه هيزن فخسف الله به الأرض فهو يتجلجل فيها إلى يوم القيامة فلما ألقوه قال: حسبي الله ونعم الوكيل كما رواه البخاري عن ابن عباس أنه قال حسبي الله ونعم الوكيل قالها إبراهيم حين ألقي في النار وقالها محمد عليه الصلاة والسلام حين قالوا إن الناس فد جمعوا لكم فاخشوهم فزادهم إيمانا وقالوا حسبنا الله ونعم الوكيل وروى الحافظ أبو يعلى حدثنا ابن هشام حدثنا إسحاق بن سليمان عن أبي جعفر عن عاصم عن أبي صالح عن أبي هريرة قال: قال رسول الله\" صلى الله عليه وسلم\": \" لما ألقى إبراهيم عليه السلام في النار قال الله إنك في السماء واحد وأنا في الأرض واحد أعبدك \" ويروى أنه لما جعلوا يوثقونه قال: لا إله إلا أنت سبحانك لك الحمد ولك الملك لا شريك لك وقال شعيب الجبائي كان عمره إذ ذاك ست عشرة سنة فالله أعلم وذكر بعض السلف أنه عرض له جبريل وهو في الهواء فقال ألك حاجة فقال أما إليك فلا وأما من الله فبلى وقال سعيد بن جبير ويروى عن ابن عباس أيضا قال لما ألقي إبراهيم جعل خازن المطر يقول متى أومر بالمطر فأرسله قال فكان أمر الله أسرع من أمره."
    },
    {
      "ayah": 69,
      "surah": 21,
      "text": "قال الله \" يا نار كونى بردا وسلاما على إبراهيم \" قال لم يبق نار في الأرض إلا طفئت وقال كعب الأحبار لم ينتفع أحد يومئذ بنار ولم تحرق النار من إبراهيم سوى وثاقه وقال الثوري عن الأعمش عن شيخ عن علي بن أبي طالب \" قلنا يا نار كوني بردا وسلاما على إبراهيم \" قال لا تضر به وقال ابن عباس وأبو العالية لولا أن الله عز وجل قال \" وسلاما \" لآذى إبراهيم بردها وقال جويبر عن الضحاك \" كوني بردا وسلاما على إبراهيم \" قالوا صنعوا له حظيرة من حطب جزل وأشعلوا فيه النار من كل جانب فأصبح ولم يصبه منها شيء حتى أخمدها الله قال ويذكرون أن جبريل كان معه يمسح وجهه من العرق فلم يصبه منها شيء غير ذلك وقال السدي كان معه فيها ملك الظل. وقال علي بن أبي حاتم حدثنا علي بن الحسين حدثنا يوسف بن موسى حدثنا مهران حدثنا إسماعيل بن أبي خالد عن المنهال بن عمرو قال أخبرت أن إبراهيم ألقي في النار قال فكان فيها إما خمسين وإما أربعين قال ما كنت أياما وليالي قط أطيب عيشا إذ كنت فيها وددت أن عيشي وحياتي كلها مثل عيشي إذ كنت فيها وقال أبو زرعة ابن عمرو بن جرير عن أبي هريرة قال إن أحسن شيء قال أبو إبراهيم لما رفع عنه الطبق وهو في النار وجده يرش جبينه قال عند ذلك نعم الرب ربك يا إبراهيم وقال قتادة لم يأت يومئذ دابة إلا أطفأت عنه النار إلا الوزغ وقال الزهري أمر النبي \"صلى الله عليه وسلم\" بقتله وسماه فويسقا. وقال ابن أبي حاتم حدثنا عبيد الله بن أخي ابن وهب حدثني عمي حدثنا جرير بن حازم أن نافعا حدثه قال حدثتني مولاة الفاكه بن المغيرة المخزومي قالت دخلت على عائشة فرأيت في بيتها رمحا فقلت: يا أم المؤمنين ما تصنعين بهذا الرمح؟ فقالت نقتل به هذه الأوزاغ إن رسول الله\" صلى الله عليه وسلم\" قال \"إن إبراهيم حين ألقي في النار لم يكن في الأرض دابة إلا تطفئ النار غير الوزغ فإنه كان ينفخ على إبراهيم\" فأمرنا رسول الله\" صلى الله عليه وسلم\" بقتله."
    },
    {
      "ayah": 7,
      "surah": 21,
      "text": "يقول تعالى رادًا على من أنكر بعثة الرسل من البشر \" وما أرسلنا قبلك إلا رجالا نوحي إليهم \" أي جميع الرسل الذين تقدموا كانوا رجالا من البشر لم يكن فيهم أحد من الملائكة كما قال في الآية الأخرى \" وما أرسلنا قبلك إلا رجالا نوحي إليهم من أهل القرى \" وقال تعالى \" قل ما كنت بدعا من الرسل \" وقال تعالى حكاية عمن تقدم من الأمم لأنهم أنكروا ذلك فقالوا \" أبشر يهدوننا \" ولهذا قال تعالى \" فاسألوا أهل الذكر إن كنتم لا تعلمون \" أي اسألوا أهل العلم من الأمم كاليهود والنصارى وسائر الطوائف هل كان الرسل الذين آتوهم بشرا أو ملائكة وإنما كانوا بشرا وذلك من تمام نعمة الله على خلقه إذ بعث فيهم رسلا منهم يتمكنون من تناول البلاغ منهم والأخذ عنهم."
    },
    {
      "ayah": 70,
      "surah": 21,
      "text": "وقوله \" وأرادوا به كيدا فجعلناهم الأخسرين \" أي المغلوبين الأسفلين لأنهم أرادوا بنبي الله كيدا فكادهم الله ونجاه من النار فغلبوا هنالك وقال عطية العوفي لما ألقي إبراهيم في النار جاء ملكهم لينظر إليه فطارت شرارة فوقعت على إبهامه فأحرقته مثل الصوفة."
    },
    {
      "ayah": 71,
      "surah": 21,
      "text": "يقول تعالى مخبرا عن إبراهيم إنه سلمه الله من نار قومه وأخرجه من بين أظهرهم مهاجرا إلى بلاد الشام إلى الأرض المقدسة منها. قال الربيع بن أنس عن أبي العالية عن أبي بن كعب في قوله \" إلى الأرض التي باركنا فيها للعالمين \" قال الشام وما من ماء عذب إلا يخرج من تحت الصخرة وكذا قال أبو العالية أيضا وقال قتادة كان بأرض العراق فأنجاه الله إلى الشام وكان يقال للشام أعقار دار الهجرة وما نقص من الأرض زيد في الشام وما نقص من الشام زيد في فلسطين وكان يقال هي أرض المحشر والمنشر وبها ينزل عيسى ابن مريم عليه السلام وبها يهلك المسيح الدجال وقال كعب الأحبار في قوله \" إلى الأرض التي باركنا فيها للعالمين \" إلى حران وقال السدي انطلق إبراهيم ولوط قبل الشام فلقي إبراهيم سارة وهي ابنة ملك حران وقد طعنت على قومها في دينهم فتزوجها على أن يفر بها رواه ابن جرير وهو غريب والمشهور أنها ابنة عمه وأنه خرج بها مهاجرا من بلاده وقال العوفي عن ابن عباس إلى مكة ألا تسمع إلى قوله \" إن أول بيت وضع للناس للذي ببكة مباركا وهدى للعالمين فيه آيات بينات مقام إبراهيم ومن دخله كان آمنا \"."
    },
    {
      "ayah": 72,
      "surah": 21,
      "text": "وقوله \" ووهبنا له إسحاق ويعقوب نافلة \" قال عطاء ومجاهد عطية وقال ابن عباس وقتادة والحكم بن عيينة النافلة ولد الولد يعني أن يعقوب ولد إسحاق كما قال \" فبشرناها بإسحاق ومن وراء إسحق يعقوب \" وقال عبد الرحمن بن زيد بن أسلم سأل واحدا فقال \" رب هب لي من الصالحين \" فأعطاه الله إسحاق وزاده يعقوب نافلة \" وكلا جعلنا صالحين \" أي الجميع أهل خير وصلاح."
    },
    {
      "ayah": 73,
      "surah": 21,
      "text": "\" وجعلناهم أئمة \" أي يقتدى بهم \" يهدون بأمرنا \" أي يدعون إلى الله بإذنه ولهذا قال \" وأوحينا إليهم فعل الخيرات وإقام الصلاة وإيتاء الزكاة \" من باب عطف الخاص على العام \" وكانوا لنا عابدين \" أي فاعلين لما يأمرون الناس به ثم عطف بذكر لوط وهو بن هاران بن آزر كان قد آمن بإبراهيم عليه السلام واتبعه وهاجر معه."
    },
    {
      "ayah": 74,
      "surah": 21,
      "text": "كانوا قوم سوء فاسقين كما قال تعالى \" فآمن له لوط وقال إني مهاجر إلى ربي \" فآتاه الله حكما وعلما وأوحى إليه وجعله نبيا وبعثه إلى سدوم وأعمالها فخالفوه وكذبوه فأهلكهم الله ودمر عليهم كما قص خبرهم في غير موضع من كتابه العزيز ولهذا قال \" ونجيناه من القرية التي كانت تعمل الخبائث إنهم كانوا قوم سوء فاسقين وأدخلناه في رحمتنا إنه من الصالحين \"."
    },
    {
      "ayah": 75,
      "surah": 21,
      "text": "كما قال تعالى \" فآمن له لوط وقال إني مهاجر إلى ربي \" فآتاه الله حكما وعلما وأوحى إليه وجعله نبيا وبعثه إلى سدوم وأعمالها فخالفوه وكذبوه فأهلكهم الله ودمر عليهم كما قص خبرهم في غير موضع من كتابه العزيز ولهذا قال \" ونجيناه من القرية التي كانت تعمل الخبائث إنهم كانوا قوم سوء فاسقين وأدخلناه في رحمتنا إنه من الصالحين \"."
    },
    {
      "ayah": 76,
      "surah": 21,
      "text": "يخبر تعالى عن استجابته لعبده ورسوله نوح عليه السلام حين دعا على قومه لما كذبوه \" فدعا ربه أني مغلوب فانتصر \" وقال نوح \" رب لا تذر على الأرض من الكافرين ديارا إنك إن نذرهم يضلوا عبادك ولا يلدوا إلا فاجرا كفارا \" ولهذا قال ههنا \" إذ نادى من قبل فاستجبنا له فنجيناه وأهله \" أي الذين آمنوا به كما قال \" وأهلك إلا من سبق عليه القول ومن آمن وما آمن معه إلا قليل \" وقوله \" من الكرب العظيم \" أي من الشدة والتكذيب والأذى فإنه لبث فيهم ألف سنة إلا خمسين عاما يدعوهم إلى الله عز وجل فلم يؤمن به منهم إلا القليل وكانوا يتصدون لأذاه ويتواصون قرنا بعد قرن وجيلا بعد جيل على خلافه."
    },
    {
      "ayah": 77,
      "surah": 21,
      "text": "وقوله \" ونصرناه من القوم \" أي ونجيناه وخلصناه منتصرا من القوم \" الذين كذبوا بآياتنا إنهم كانوا قوم سوء فأغرقناهم أجمعين \" أي أهلكهم الله بعامة ولم يبق على وجه الأرض منهم أحد كما دعا عليهم نبيهم."
    },
    {
      "ayah": 78,
      "surah": 21,
      "text": "قال ابن إسحاق عن مرة عن ابن مسعود كان ذلك الحرث كَرْمًا قد تدلت عناقيده وكذا قال شريح وقال ابن عباس النفش الرعي وقال شريح والزهري وقتادة: النفش لا يكون إلا بالليل زاد قتادة والهمل بالنهار وقال ابن جرير حدثنا أبو كريب وهارون بن إدريس الأصم قالا حدثنا المحاربي عن أشعث عن أبي إسحق عن مرة عن ابن مسعود في قوله \" وداود وسليمان إذ يحكمان في الحرث إذ نفشت فيه غنم القوم \" قال كرم قد أنبتت عناقيده فأفسدته قال فقضى داود بالغنم لصاحب الكرم فقال سليمان غير هذا يا نبي الله قال وما ذاك؟ قال تدفع الكرم إلى صاحب الغنم فيقوم عليه حتى يعود كما كان وتدفع الغنم إلى صاحب الكرم فيصيب منها حتى إذا كان الكرم كما كان دفعت الكرم إلى صاحبه ودفعت الغنم إلى صاحبها فذلك قوله \" ففهمناها سليمان \" وكذا روى العوفي عن ابن عباس.وقال حماد بن سلمة عن علي بن زيد حدثني خليفة عن ابن عباس قال قضى داود بالغنم لأصحاب الحرث فخرج الرعاء معهم الكلاب فقال لهم سليمان كيف قضى بينكم فأخبروه فقال لو وليت أمركم لقضيت بغير هذا فأخبر بذلك داود فدعاه فقال كيف تقضي بينهم؟ قال أدفع الغنم إلى صاحب الحرث فيكون له أولادها وألبانها وسلاؤها ومنافعها ويبذر أصحاب الغنم لأهل الحرث مثل حرثهم فإذا بلغ الحرث الذي كان عليه أخذه أصحاب الحرث وردوا الغنم إلى أصحابها وقال ابن أبي حاتم حدثنا أبي حدثنا سعيد بن سليمان حدثنا خديج عن أبي إسحاق عن مرة عن مسروق قال الحرث الذي نفشت فيه الغنم إنما كان كرما فلم تدع فيه ورقة ولا عنقودا من عنب إلا أكلته فأتوا داود فأعطاهم رقابها فقال سليمان لا بل تؤخذ الغنم فيعطاها أهل الكرم فيكون لهم لبنها ونفعها ويعطى أهل الغنم الكرم فيعمروه ويصلحوه حتى يعود كالذي كان ليلة نفشت فيه الغنم ثم يعطى أهل الغنم غنمهم وأهل الكرم كرمهم. وهكذا قال شريح ومرة ومجاهد وقتادة وابن زيد وغير واحد وقال ابن جرير حدثنا ابن أبي زياد حدثنا يزيد بن هارون أنبأنا إسماعيل عن عامر قال جاء رجلان إلى شريح فقال أحدهما إن شياه هذا قطعت غزلا لي فقال شريح نهارا أم ليلا؟ فإن كان نهارا فقد برئ صاحب الشياه وإن كان ليلا ضمن ثم قرأ \" وداود وسليمان إذ يحكمان في الحرث \" الآية وهذا الذي قاله شريح شبيه بما رواه الإمام أحمد وأبو داود وابن ماجه من حديث الليث بن سعد عن الزهري عن حرام بن سعد بن محيصة أن ناقة البراء بن عازب دخلت حائطا فأفسدت فيه فقضى رسول الله\" صلى الله عليه وسلم\" على أهل الحوائط حفظها بالنهار وما أفسدت المواشي بالليل ضامن على أهلها وقد علل هذا الحديث وقد بسطنا الكلام عليه في كتاب الأحكام وبالله التوفيق."
    },
    {
      "ayah": 79,
      "surah": 21,
      "text": "وقوله \" ففهمناها سليمان وكلا آتينا حكما وعلما \" قال ابن أبي حاتم حدثنا أبي حدثنا موسى بن إسماعيل حدثنا حماد عن حميد أن إياس ابن معاوية لما استقضى أتاه الحسن فبكى فقال ما يبكيك؟ قال يا أبا سعيد بلغني أن القضاة رجل اجتهد فأخطأ فهو في النار ورجل مال به الهوى فهو في النار ورجل اجتهد فأصاب فهو في الجنة فقال الحسن البصري: إن فيما قص الله من نبأ داود وسليمان عليه الصلاة والسلام والأنبياء حكما يرد قول هؤلاء الناس عن قولهم قال الله تعالى \" وداود وسليمان إذ يحكمان في الحرث إذ نفشت فيه غنم القوم وكنا لحكمهم شاهدين \" فأثنى الله على سليمان ولم يذم داود ثم قال يعني الحسن إن الله اتخذ على الحكام ثلاثا لا يشتروا به ثمنا قليلا ولا يتبعوا فيه الهوى ولا يخشوا فيه أحدا ثم تلا \" يا داود إنا جعلناك خليفة في الأرض فاحكم بين الناس بالحق ولا تتبع الهوى فيضلك عن سبيل الله \" وقال \" فلا تخشوا الناس واخشون \" وقال \" ولا تشتروا بآياتي ثمنا قليلا \" قلت أما الأنبياء عليهم السلام فكلهم معصومون مؤيدون من الله عز وجل وهذا مما لا خلاف فيه بين العلماء المحققين من السلف والخلف وأما من سواهم فقد ثبت في صحيح البخاري عن عمرو بن العاص أنه قال قال رسول الله \"صلى الله عليه وسلم\": \" إذا اجتهد الحاكم فأصاب فله أجران وإذا اجتهد فأخطأ فله أجر \" فهذا الحديث يرد نصا ما توهمه إياس من أن القاضي إذا اجتهد فأخطأ فهو في النار والله أعلم وفي السنن: القضاة ثلاثة قاض في الجنة وقاضيان في النار رجل علم الحق وقضى به فهو في الجنة ورجل حكم بين الناس على جهل فهو في النار ورجل علم الحق وقضى خلافه فهو في النار وقريب من هذه القصة المذكورة في القرآن ما رواه الإمام أحمد في مسنده حيث قال حدثنا علي بن حفص أخبرنا ورقاء عن أبي الزناد عن الأعرج عن أبي هريرة قال قال رسول الله \"صلى الله عليه وسلم\" \" بينما امرأتان معهما ابنان لهما إذ جاء الذئب فأخذ أحد الابنين فتحاكمتا إلى داود فقضى به للكبرى فخرجتا فدعاهما سليمان فقال هاتوا السكين أشقه بينكما فقالت الصغرى يرحمك الله هو ابنها لا تشقه فقضى به للصغرى \" وأخرجه البخاري ومسلم في صحيحيهما وبوب عليه النسائي في كتاب القضاة \" باب الحاكم يوهم خلاف الحكم ليستعلم الحق \" وهكذا القصة التي أوردها الحافظ أبو القاسم بن عساكر في ترجمة سليمان عليه السلام من تاريخه عن طريق الحسن بن سفيان عن صفوان بن صالح عن الوليد بن مسلم عن سعيد بن بشر عن قتادة عن مجاهد عن ابن عباس فذكر قصة مطولة ملخصها أن امرأة حسناء في زمان بني إسرائيل راودها عن نفسها أربعة من رؤسائهم فامتنعت على كل منهم فاتفقوا فيما بينهم عليها فشهدوا عند داود عليه السلام أنها مكنت من نفسها كلبا لها قد عودته ذلك منها فأمر برجمها فلما كان عشية ذلك اليوم جلس سليمان واجتمع معه ولدان مثله فانتصب حاكما وتزيّا أربعة منهم بزي أولئك وآخر بزي المرأة وشهدوا عليها بأنها مكنت من نفسها كلبا فقال سليمان فرقوا بينهم فسأل أولهم ما كان لون الكلب فقال أسود فعزله واستدعى الآخر فسأله عن لونه فقال أحمر وقال الآخر أغبش وقال الآخر أبيض فأمر عند ذلك بقتلهم فحكي ذلك لداود عليه السلام فاستدعى من فوره بأولئك الأربعة فسألهم متفرقين عن لون ذلك الكلب فاختلفوا عليه فأمر بقتلهم وقوله \" وسخرنا مع داود الجبال يسبحن والطير \" الآية وذلك لطيب صوته بتلاوة كتابه الزبور وكان إذا ترنم به تقف الطير في الهواء فتجاوبه وترد عليه الجبال تأويبا ولهذا لما مر النبي صلى الله عليه وسلم على أبي موسى الأشعري وهو يتلو القرآن من الليل وكان له صوت طيب جدا فوقف واستمع لقراءته وقال: لقد أوتي هذا مزمارا من مزامير آل داود \" قال يا رسول الله لو علمت أنك تستمع لحبرته لك تحبيرا وقال أبو عثمان النهدي ما سمعت صوت صنج ولا بربط ولا مزمار مثل صوت أبي موسى رضي الله عنه ومع هذا قال عليه الصلاة والسلام \" لقد أوتي مزمارا من مزامير آل داود \"."
    },
    {
      "ayah": 8,
      "surah": 21,
      "text": "وقوله \" وما جعلناهم جسدا لا يأكلون الطعام \" أي بل قد كانوا أجسادا يأكلون الطعام كما قال تعالى \" وما أرسلنا قبلك من المرسلين إلا إنهم ليأكلون الطعام ويمشون في الأسواق \" أي قد كانوا بشرا من البشر يأكلون ويشربون مثل الناس ويدخلون الأسواق للتكسب والتجارة وليس ذلك بضار لهم ولا ناقص منهم شيئا كما توهمه المشركون في قولهم \" ما لهذا الرسول يأكل الطعام ويمشي في الأسواق لولا أنزل إليه ملك فيكون معه نذيرا أو يلقى إليه كنز أو تكون له جنة يأكل منها \" الآية وقوله \" وما كانوا خالدين \" أي في الدنيا بل كانوا يعيشون ثم يموتون \" وما جعلنا لبشر من قبلك الخلد \" وخاصتهم أنهم يوحى إليهم من الله عز وجل تنزل عليهم الملائكة عن الله بما يحكمه في خلقه مما يأمر به وينهى عنه."
    },
    {
      "ayah": 80,
      "surah": 21,
      "text": "وقوله \" وعلمناه صنعة لبوس لكم لتحصنكم من بأسكم \" يعني صنعة الدروع قال قتادة إنما كانت الدروع قبله صفائح وهو أول من سردها حلقا كما قال تعالى \" وألنا له الحديد أن اعمل سابغات وقدر في السرد \" أي لا توسع الحلقة فتقلق المسمار ولا تغلظ المسمار فتقد الحلقة ولهذا قال \" لتحصنكم من بأسكم \" يعني في القتال \" فهل أنتم شاكرون \" أي نعم الله عليكم لما ألهم به عبده داود فعلمه ذلك من أجلكم."
    },
    {
      "ayah": 81,
      "surah": 21,
      "text": "وقوله \" ولسليمان الريح عاصفة \" أي وسخرنا لسليمان الريح العاصفة \" تجري بأمره إلى الأرض التي باركنا فيها \" يعني أرض الشام \" وكنا بكل شيء عالمين \" وذلك أنه كان له بساط من خشب يوضع عليه كل ما يحتاج إليه من أمور المملكة والخيل والجمال والخيام والجند ثم يأمر الريح أن تحمله فتدخل تحته ثم تحمله وترفعه وتسير به وتظله الطير تقيه الحر إلى حيث يشاء من الأرض فينزل وتوضع آلاته وحشمه قال الله تعالى \" فسخرنا له الريح تجري بأمره رخاء حيث أصاب \" وقال تعالى \" غدوها شهر ورواحها شهر \" قال ابن أبي حاتم ذكر عن سفيان بن عيينة عن أبي سنان عن سعيد بن جبير قال كان يوضع لسليمان ستمائة الف كرسي فيجلس مما يليه مؤمنو الإنس ثم يجلس من ورائهم مؤمنو الجن ثم يأمر الطير فتظلهم ثم يأمر الريح فتحملهم\" صلى الله عليه وسلم\" وقال عبد الله ابن عبيد بن عمير كان سليمان يأمر الريح فتجتمع كالطود العظيم كالجبل ثم يأمر بفراشه فيوضع على أعلى مكان منها ثم يدعو بفرس من ذوات الأجنحة فترتفع حتى يصعد على فراشه ثم يأمر الريح فترتفع به كل شرف دون السماء وهو مطأطئ رأسه ما يلتفت يمينا ولا شمالا تعظيما لله عز وجل وشكرا لما يعلم من صغر ما هو فيه في ملك الله عز وجل حتى تضعه الريح حيث شاء أن تضعه."
    },
    {
      "ayah": 82,
      "surah": 21,
      "text": "وقوله \" ومن الشياطين من يغوصون له \" أي في الماء يستخرجون اللآلئ والجواهر وغير ذلك \" ويعملون عملا دون ذلك \" أي غير ذلك كما قال تعالى \" والشياطين كل بناء وغواص وآخرين مقرنين في الأصفاد \" وقوله \" وكنا لهم حافظين \" أي يحرسه الله أن يناله أحد من الشياطين بسوء بل كل في قبضته وتحت قهره لا يتجاسر أحد منهم على الدنو إليه والقرب منه بل هو يحكم فيهم إن شاء أطلق وإن شاء حبس منهم من يشاء ولهذا قال \" وآخرين مقرنين في الأصفاد \"."
    },
    {
      "ayah": 83,
      "surah": 21,
      "text": "يذكر تعالى عن أيوب \" ما كان أصابه من البلاء في ماله وولده وجسده وذلك أنه كان له من الدواب والأنعام والحرث شيء كثير وأولاد كثيرة ومنازل مرضية فابتلي في ذلك كله وذهب عن آخره ثم ابتلي في جسده يقال بالجذام في سائر بدنه ولم يبق منه سليم سوى قلبه ولسانه يذكر بهما الله عز وجل حتى عافه الجليس وأفرد في ناحية من البلد ولم يبق أحد من الناس يحنو عليه سوى زوجته كانت تقوم بأمره ويقال إنها احتاجت فصارت تخدم الناس من أجله وقد قال النبي صلى الله عليه وسلم \" أشد الناس بلاء الأنبياء ثم الصالحون ثم الأمثل فالأمثل \" وفي الحديث الآخر \" يبتلى الرجل على قدر دينه فإن كان في دينه صلابة زيد في بلائه \" وقد كان نبي الله أيوب عليه السلام غاية في الصبر وبه يضرب المثل في ذلك. وقال يزيد بن ميسرة لما ابتلى الله أيوب عليه السلام بذهاب الأهل والمال والولد ولم يبق شيء له أحسن الذكر ثم قال: أحمدك رب الأرباب الذي أحسنت إلي أعطيتني المال والولد فلم يبق من قلبي شعبة آلا قد دخله ذلك فأخذت ذلك كله مني وفرغت قلبي فليس يحول بيني وبينك شيء لو يعلم عدوي إبليس بالذي صنعت حسدني. قال فلقي إبليس من ذلك منكرا قال وقال أيوب عليه السلام يا رب إنك أعطيتني المال والولد فلم يقم على بابي أحد يشكوني لظلم ظلمته وأنت تعلم ذلك وإنه كان يوطأ لي الفراش فأتركها وأقول لنفسي: يا نفس إنك لم تخلقي لوطء الفراش ما تركت ذلك إلا ابتغاء وجهك. رواه ابن أبي حاتم وقد روي عن وهب بن منبه في خبره قصة طويلة ساقها ابن جرير وابن أبي حاتم بالسند عنه وذكرها غير واحد من متأخري المفسرين وفيها غرابة تركناها لحال لطول وقد روى أنه مكث في البلاء مدة طويلة ثم اختلفوا في السبب المهيج له على هذا الدعاء فقال الحسن وقتادة ابتلي أيوب عليه السلام سبع سنين وأشهرا ملقى على كناسة بني إسرائيل تختلف الدواب في جسده ففرج الله عنه وأعظم له الأجر وأحسن عليه الثناء. وقال وهب بن منبه مكث في البلاء ثلاث سنين لا يزيد ولا ينقص وقال السدي:\" تساقط لحم أيوب حتى لم يبق إلا العصب والعظام فكانت امرأته تقوم عليه وتأتيه بالرماد يكون فيه فقالت له امرأته لما طال وجعه يا أيوب لو دعوت ربك يفرج عنك فقال قد عشت سبعين سنة صحيحا فهو قليل لله أن أصبر له سبعين سنة فجزعت من ذلك فخرجت فكانت تعمل للناس بالأجر وتأتيه بما تصيب فتطعمه وإن إبليس انطلق إلى رجلين من أهل فلسطين كانا صديقين له وأخوين فأتاهما فقال أخوكما أيوب أصابه من البلاء كذا وكذا فاتياه وزوراه واحملا معكما من خمر أرضكما فإنه إن شرب منه برئ فأتياه فلما نظرا إليه بكيا فقال من أنتما فقالا نحن فلان وفلان فرحب بهما وقال مرحبا بمن لا يجفوني عند البلاء فقالا يا أيوب لعلك كنت تسر شيئا وتظهر غيره فلذلك ابتلاك الله فرفع رأسه إلى السماء فقال: هو يعلم ما أسررت شيئا أظهرت غيره ولكن ربي ابتلاني لينظر أأصبر أم أجزع فقالا له يا أيوب اشرب من خمرنا فإنك إن شربت منه برأت قال فغضب وقال جاءكما الخبيث فأمركما بهذا؟ كلامكما وطعامكما وشرابكما علي حرام فقاما من عنده وخرجت امرأته تعمل للناس فخبزت لأهل بيت لهم صبي فجعلت لهم قرصا وكان ابنهم نائما فكرهوا أن يوقظوه فوهبوه لها فأتت به إلى أيوب فأنكره وقال ما كنت تأتيني بهذا فما بالك اليوم فأخبرته الخبر قال فلعل الصبي قد استيقظ فطلب القرص فلم يجده فهو يبكي على أهله فانطلقي به إليه فأقبلت حتى بلغت درجة القوم فنطحتها شاة لهم فقالت تعس أيوب الخطاء فلما صعدت وجدت الصبي فد استيقظ وهو يطلب القرص ويبكي على أهله لا يقبل منهم شيئا غيره فقالت: رحمه الله يعني أيوب فدفعت إليه القرص ورجعت ثم إن إبليس أتاها في صورة طبيب فقال لها إن زوجك قد طال سقمه فإن أراد أن يبرأ فليأخذ ذبابا فليذبحه باسم صنم بني فلان فإنه يبرأ ويتوب بعد ذلك فقالت ذلك لأيوب فقال قد أتاك الخبيث. لله علي إن برأت أن أجلدك مائة جلدة فخرجت تسعى عليه فحظر عنها الرزق فجعلت لا تأتى أهل بيت فيريدونها فلما اشتد عليها ذلك وخافت على أيوب الجوع حلقت من شعرها قرنا فباعته من صبية من بنات الأشراف فأعطوها طعاما طيبا كثيرا فأتت به أيوب فلما رآه أنكره وقال من أين لك هذا قالت عملت لأناس فأطعموني فأكل منه فلما كان الغد خرجت فطلبت أن تعمل فلم تجد فحلقت أيضا قرنا فباعته من تلك الجارية فأعطوها أيضا من ذلك الطعام فأتت به أيوب فقال والله لا أطعمه حتى أعلم من أين هو فوضعت خمارها فلما رأى رأسها محلوقا جزع جزعا شديدا فعند ذلك دعا الله عز وجل فقال \" رب إني مسني الضر وأنت أرحم الراحمين \" قال ابن أبي حاتم حدثنا أبي حدثنا موسى بن إسماعيل حدثنا حماد حدثنا أبو عمران الجوني عن نوف البكالي أن الشيطان الذي عرج في أيوب كان يقال له مبسوط قال وكانت امرأة أيوب تقول ادع الله فيشفيك فجعل لا يدعو حتى مر به نفر من بني إسرائيل فقال بعضهم لبعض ما أصابه ما أصابه إلا بذنب عظيم أصابه فعند ذلك قال \" رب إني مسني الضر وأنت أرحم الراحمين \" وحدثنا أبي حدثنا أبو سلمة حدثنا جرير بن حازم عن عبد الله بن عبيد بن عمير قال كان لأيوب عليه السلام أخوان فجاءوا يوما فلم يستطيعا أن يدنوا منه من ريحه فقاما من بعيد فقال أحدهما للآخر لو كان الله علم من أيوب خيرا ما ابتلاه بهذا فجزع أيوب من قولهما جزعا لم يجزع من شيء قط فقال: اللهم إن كنت تعلم أني لم أبت ليلة قط شبعان وأنا أعلم مكان جائع فصدقني فصدق من السماء وهما يسمعان ثم قال: اللهم إن كنت تعلم أني لم يكن لي قميصان قط وأنا أعلم مكان جائع فصدقني فصدق من السماء وهما يسمعان ثم قال: اللهم بعزتك ثم خر ساجدا فقال اللهم بعزتك لا أرفع رأسي أبدا حتى تكشف عني فما رفع رأسه حتى كشف عنه وقد رواه ابن أبي حاتم من وجه آخر مرفوعا ينحو هذا فقال أخبرنا يونس بن عيد الأعلى أخبرنا ابن وهب اخبر نافع بن يزيد عن عقيل عن الزهري عن أنس ابن مالك أن رسول الله صلى الله عليه وسلم قال: \" إن نبي الله أيوب لبث به بلاؤه ثماني عشرة سنة فرفضه القريب والبعيد إلا رجلين من إخوانه كانا من أخص إخوانه له كانا يغدوان إليه فقال ويروحان فقال أحدهما لصاحبه تعلم والله لقد أذنب أيوب ذنبا ما أذنبه أحد من العالمين فقال له صاحبه وما ذاك؟ قال منذ ثماني عشرة سنة لم يرحمه الله فيكشف ما به فلما راحا إليه لم يصبر الرجل حتى ذكر ذلك له فقال أيوب عليه السلام ما أدري ما تقول غير أن الله عز وجل يعلم أني كنت أمر على الرجلين يتنازعان فيذكران الله فأرجع إلى بيتي فأكفر عنهما كراهية أن يذكرا الله إلا في حق قال وكان يخرج في حاجته فإذا قضاها أمسكت امرأته بيده حتى يبل فلما كان ذات يوم أبطأت عليه فأوحى الله إلى أيوب في مكانه أن اركض برجلك هذا مغتسل بارد وشراب \" رفع هذا الحديث غريب جدا. وروى ابن أبي حاتم حدثنا أبي حدثنا موسى بن إسماعيل حدثنا حماد أخبرنا علي بن زيد عن يوسف بن مهران عن ابن عباس قال: وألبسه الله حلة من الجنة فتنحى أيوب فجلس في ناحية وجاءت امرأته فلم تعرفه فقالت يا عبد الله أين ذهب هذا المبتلى الذي كان ههنا لعل الكلاب ذهبت به أو الذئاب فجعلت تكلمه ساعة. فقال ويحك أنا أيوب قالت أتسخر مني يا عبد الله؟ فقال ويحك أنا أيوب قد رد الله علي جسدي وبه قال ابن عباس ورد عليه ماله وولده عيانا ومثلهم معهم وقال وهب بن منبه أوحى الله إلى أيوب قد رددت عليك أهلك ومالك ومثلهم معه فاغتسل بهذا الماء فإن فيه شفاءك وقرب عن صحابتك قربانا واستغفر لهم فإنهم قد عصوني فيك رواه ابن أبي حاتم. وقال أيضا حدثنا أبو زرعة حدثنا عمرو بن مرزوق حدثنا همام عن قتادة عن النضر بن أنس عن بشير بن نهيك عن أبي هريرة عن النبي صلى الله عليه وسلم قال \" لما عافى الله أيوب أمطر عليه جرادا من ذهب فجعل يأخذ منه بيده ويجعله في ثوبه قال فقيل له يا أيوب أما تشبع؟ قال يا رب ومن يشبع من رحمتك؟ \" أصله في الصحيحين وسيأتي في موضع آخر."
    },
    {
      "ayah": 84,
      "surah": 21,
      "text": "وقوله \" وآتيناه أهله ومثلهم معهم \" قد تقدم عن ابن عباس أنه قال ردوا عليه بأعيانهم وكذا رواه العوفي عن ابن عباس أيضا وروى عن ابن مسعود ومجاهد وبه قال الحسن وقتادة وقد زعم بعضهم أن اسم زوجته رحمة فإن كان أخذ ذلك من سياق الآية فقد أبعد النجعة وإن كان أخذه من نقل أهل الكتاب وصح دلك عنهم فهو مما لا يصدق ولا يكذب وقد سماها ابن عساكر في تاريخه رحمه الله تعالى قال ويقال اسمها ليا بنت ميشا بن يوسف ابن يعقوب بن إسحاق بن إبراهيم قال ويقال ليا بنت يعقوب عليه السلام زوجة أيوب كانت معه بأرض الثنية وقال مجاهد قيل له يا أيوب إن أهلك لك في الجنة فإن شئت أتيناك بهم وإن شئت تركناهم لك في الجنة وعوضناك مثلهم قال لا بل أتركهم في الجنة فتركوا له في الجنة وعوض مثلهم في الدنيا وقال حماد بن زيد عن أبي عمران الجوني عن نوف البكالي قال أوتي أجرهم في الآخرة وأعطي مثلهم في الدنيا قال فحدثت به مطرفا فقال ما عرفت وجهها قبل اليوم وكذا روي عن قتادة والسدي وغير واحد من السلف والله أعلم وقوله \" رحمة من عندنا \" أي فعلنا به ذلك رحمة من الله به \" وذكرى للعابدين \" أي وجعلناه في ذلك قدوة لئلا يظن أهل البلاء إنما فعلنا بهم ذلك لهوانهم علينا وليتأسوا به في الصبر على مقدورات الله وابتلائه لعباده بما يشاء وله الحكمة البالغة في ذلك."
    },
    {
      "ayah": 85,
      "surah": 21,
      "text": "وأما إسماعيل فالمراد به ابن إبراهيم الخليل \" وقد تقدم ذكره في سورة مريم وكذا إدريس عليه السلام وأما ذو الكفل فالظاهر من السياق أنه ما قرن مع الأنبياء إلا وهو نبي وقال آخرون إنما كان رجلا صالحا وكان ملكا عادلا وحكما مقسط وتوقف ابن جرير في ذلك والله أعلم قال ابن جريج عن مجاهد في قوله \" وذا الكفل \" قال رجل صالح غير نبي تكفل لنبي قومه أن يكفيه أمر قومه ويقيمهم له ويقضي بينهم بالعدل ففعل ذلك فسمى ذا الكفل وكذا روى ابن أبي نجيح عن مجاهد أيضا وروى ابن جرير حدثنا محمد بن المثنى حدثنا عفان حدثنا وهيب حدثنا داود عن مجاهد قال لما كبر اليسع قال لو أني استخلفت رجلا على الناس يعمل عليهم في حياتي حتى أنظر كيف يفعل فجمع الناس فقال من يتقبل مني بثلاث استخلفه فيصوم النهار ويقوم الليل ولا يغضب قال فقام رجل تزدريه الأعين فقال أنا فقال أن تصوم النهار وتقوم الليل ولا تغضب؟ قال نعم قال فرده ذلك اليوم وقال مثلها في اليوم الآخر فسكت الناس. وقام ذلك الرجل فقال أنا فاستخلفه قال فجعل إبليس يقول للشياطين عليكم بفلان فأعياهم ذلك فقال دعوني وإياه فأتاه في صورة شيخ كبير فقير فأتاه حين أخذ مضجعه للقائلة - وكان لا ينام الليل والنهار إلا تلك النومة - فدق الباب فقال من هذا؟ قال شيخ كبير مظلوم قال فقام ففتح الباب فجعل يقص عليه فقال إن بيني وبين قومي خصومة وإنهم ظلموني وفعلوا بي وفعلوا وجعل يطول عليه حتى حضر الرواح وذهبت القائلة فقال إذا رحت فأتني آخذ لك حقك فانطلق وراح فكان في مجلسه فجعل ينظر هل يرى الشيخ فلم يره فقام يتبعه فلما كان الغد جعل يقضي بين الناس وينتظره فلا يراه فلما رجع إلى القائلة فأخذ مضجعه أتاه فدق الباب فقال من هذا ؟ قال الشيخ الكبير المظلوم ففتح له فقال ألم أقل لك إذا قعدت فأتني قال إنهم أخبث قوم إذا عرفوا أنك قاعد قالوا نحن نعطيك حقك وإذا قمت جحدوني قال قانطلق فإذا رحت فائتني قال ففاتته القائلة فراح فجعل ينتظره ولا يراه وشق عليه النعاس فقال لبعض أهله لا تدع أحدا يقرب هذا الباب حتى أنام فإني قد شق علي النوم فلما كان تلك الساعة جاء فقال له الرجل: وراءك وراءك قال إني قد أتيته أمس وذكرت له أمري فقال لا والله لقد أمرنا أن لا ندع أحدا يقربه فلما أعياه نظر فرأى كوة في البيت فتسور منها فإذا هو في البيت وإذا هو يدق الباب من داخل قال واستيقظ الرجل فقال يا فلان ألم آمرك قال أما من قبلي والله فلم تؤت فانظر من أين أتيت قال فقام إلى الباب فإذا هو مغلق كما أغلقه وإذا الرجل معه في البيت فعرفه فقال أعدو الله؟ قال نعم. أعيتني في كل شيء ففعلت ما ترى لأغضبك فسماه الله ذا الكفل لأنه تكفل بأمر فوفَّى به. وهكذا رواه ابن أبي حاتم من حديث زهير بن إسحاق عن داود عن مجاهد بمثله وقال ابن أبي حاتم حدثنا أبي حدثنا أحمد بن يونس حدثنا أبو بكر بن عياش عن الأعمش عن مسلم قال: قال ابن عباس كان قاض في بني إسرائيل فحضره الموت فقال من يقوم مقامي على أن لا يغضب قال: فقال رجل: أنا فسُمي ذا الكفل قال فكان ليله جميعا يصلي ثم يصبح صائما فيقضي بين الناس قال وله ساعة يقيلها قال فكان كذلك فأتاه الشيطان عند نومته فقال له أصحابه ما لك؟ قال إنسان مسكين له على رجل حق وقد غلبني عليه قالوا كما أنت حتى يستيقظ قال وهو فوق نائم قال فجعل يصيح عمدا حتى يوقظه قال فسمع فقال ما لك ؟ قال إنسان مسكين له على رجل حق قال فاذهب فقل له يعطيك قال قد أبي قال اذهب أنت إليه فذهب ثم جاء من الغد فقال ما لك ؟ قال ذهبت إليه فلم يرفع بكلامك رأسا قال اذهب إليه فقل له يعطيك حقك فذهب ثم جاء من الغد حين قال: قال فقال له أصحابه أخرج فعل الله بك تجئ كل يوم حين ينام لا تدعه ينام قال فجعل يصيح من أجل أني مسكين لو كنت غنيا قال فسمع أيضا فقال ما لك ؟ قال ذهبت إليه فضربني قال امش حتى أجيء معك قال فهو ممسك بيده فلما رآه ذهب معه نشر يده منه ففر. وهكذا روي عن عبدالله بن الحارث ومحمد بن قيس وأبي حجيرة الأكبر وغيرهم من السلف نحو هذه القصة والله أعلم وقال ابن أبي حاتم حدثنا أبي حدثنا أبو الجماهر أخبرنا سعيد بن بشير حدثنا قتادة عن كنانة ابن الأخنس قال سمعت الأشعري وهو يقول على هذا المنبر: ما كان ذو الكفل بنبي ولكن كان - يعني في بني إسرائيل- رجل صالح يصلي كل يوم مائة صلاة فتكفل له ذو الكفل من بعده فكان يصلي كل يوم مائة صلاة فسمي ذا الكفل وقد رواه ابن جرير من حديث عبد الرزاق عن معمر عن قتادة قال: قال أبو موسى الأشعري فذكره منقطعا والله أعلم وقد روى الإمام أحمد حديثا غريبا فقال حدثنا أسباط بن محمد حدثنا الأعمش عن عبد الله ابن عبد الله عن سعد مولى طلحة عن ابن عمر قال: سمعت من رسول الله صلى الله عليه وسلم حديثا لو لم أسمعه إلا مرة أو مرتين حتى عد سبع مرات ولكن قد سمعته أكثر من ذلك قال \" كان الكفل من بني إسرائيل لا يتورع من ذنب عمله فأتته امرأة فأعطاها ستين دينارا على أن يطأها فلما قعد منها مقعد الرجل من امرأته أرعدت وبكت فقال ما يبكيك أكرهتك ؟ قالت لا ولكن هذا عمل لم أعمله قط وإنما حملني عليه الحاجة قال فتفعلين هذا ولم تفعليه قط ثم نزل فقال اذهبي بالدنانير لك ثم قال:\" والله لا يعصي الله الكفل أبدا فمات من ليلته فأصبح مكتوبا على بابه قد غفر الله للكفل \" هكذا وقع في هذه الرواية الكفل من غير إضافة والله أعلم وهذا الحديث لم يخرجه أحد من أصحاب الكتب الستة وإسناده غريب وعلى كل تقدير فلفظ الحديث إن كان الكفل ولم يقل ذو الكفل فلعله رجل آخر والله أعلم."
    },
    {
      "ayah": 86,
      "surah": 21,
      "text": "وأما إسماعيل فالمراد به ابن إبراهيم الخليل \" وقد تقدم ذكره في سورة مريم وكذا إدريس عليه السلام وأما ذو الكفل فالظاهر من السياق أنه ما قرن مع الأنبياء إلا وهو نبي وقال آخرون إنما كان رجلا صالحا وكان ملكا عادلا وحكما مقسط وتوقف ابن جرير في ذلك والله أعلم قال ابن جريج عن مجاهد في قوله \" وذا الكفل \" قال رجل صالح غير نبي تكفل لنبي قومه أن يكفيه أمر قومه ويقيمهم له ويقضي بينهم بالعدل ففعل ذلك فسمى ذا الكفل وكذا روى ابن أبي نجيح عن مجاهد أيضا وروى ابن جرير حدثنا محمد بن المثنى حدثنا عفان حدثنا وهيب حدثنا داود عن مجاهد قال لما كبر اليسع قال لو أني استخلفت رجلا على الناس يعمل عليهم في حياتي حتى أنظر كيف يفعل فجمع الناس فقال من يتقبل مني بثلاث استخلفه فيصوم النهار ويقوم الليل ولا يغضب قال فقام رجل تزدريه الأعين فقال أنا فقال أن تصوم النهار وتقوم الليل ولا تغضب؟ قال نعم قال فرده ذلك اليوم وقال مثلها في اليوم الآخر فسكت الناس. وقام ذلك الرجل فقال أنا فاستخلفه قال فجعل إبليس يقول للشياطين عليكم بفلان فأعياهم ذلك فقال دعوني وإياه فأتاه في صورة شيخ كبير فقير فأتاه حين أخذ مضجعه للقائلة - وكان لا ينام الليل والنهار إلا تلك النومة - فدق الباب فقال من هذا؟ قال شيخ كبير مظلوم قال فقام ففتح الباب فجعل يقص عليه فقال إن بيني وبين قومي خصومة وإنهم ظلموني وفعلوا بي وفعلوا وجعل يطول عليه حتى حضر الرواح وذهبت القائلة فقال إذا رحت فأتني آخذ لك حقك فانطلق وراح فكان في مجلسه فجعل ينظر هل يرى الشيخ فلم يره فقام يتبعه فلما كان الغد جعل يقضي بين الناس وينتظره فلا يراه فلما رجع إلى القائلة فأخذ مضجعه أتاه فدق الباب فقال من هذا ؟ قال الشيخ الكبير المظلوم ففتح له فقال ألم أقل لك إذا قعدت فأتني قال إنهم أخبث قوم إذا عرفوا أنك قاعد قالوا نحن نعطيك حقك وإذا قمت جحدوني قال قانطلق فإذا رحت فائتني قال ففاتته القائلة فراح فجعل ينتظره ولا يراه وشق عليه النعاس فقال لبعض أهله لا تدع أحدا يقرب هذا الباب حتى أنام فإني قد شق علي النوم فلما كان تلك الساعة جاء فقال له الرجل: وراءك وراءك قال إني قد أتيته أمس وذكرت له أمري فقال لا والله لقد أمرنا أن لا ندع أحدا يقربه فلما أعياه نظر فرأى كوة في البيت فتسور منها فإذا هو في البيت وإذا هو يدق الباب من داخل قال واستيقظ الرجل فقال يا فلان ألم آمرك قال أما من قبلي والله فلم تؤت فانظر من أين أتيت قال فقام إلى الباب فإذا هو مغلق كما أغلقه وإذا الرجل معه في البيت فعرفه فقال أعدو الله؟ قال نعم. أعيتني في كل شيء ففعلت ما ترى لأغضبك فسماه الله ذا الكفل لأنه تكفل بأمر فوفَّى به. وهكذا رواه ابن أبي حاتم من حديث زهير بن إسحاق عن داود عن مجاهد بمثله وقال ابن أبي حاتم حدثنا أبي حدثنا أحمد بن يونس حدثنا أبو بكر بن عياش عن الأعمش عن مسلم قال: قال ابن عباس كان قاض في بني إسرائيل فحضره الموت فقال من يقوم مقامي على أن لا يغضب قال: فقال رجل: أنا فسُمي ذا الكفل قال فكان ليله جميعا يصلي ثم يصبح صائما فيقضي بين الناس قال وله ساعة يقيلها قال فكان كذلك فأتاه الشيطان عند نومته فقال له أصحابه ما لك؟ قال إنسان مسكين له على رجل حق وقد غلبني عليه قالوا كما أنت حتى يستيقظ قال وهو فوق نائم قال فجعل يصيح عمدا حتى يوقظه قال فسمع فقال ما لك ؟ قال إنسان مسكين له على رجل حق قال فاذهب فقل له يعطيك قال قد أبي قال اذهب أنت إليه فذهب ثم جاء من الغد فقال ما لك ؟ قال ذهبت إليه فلم يرفع بكلامك رأسا قال اذهب إليه فقل له يعطيك حقك فذهب ثم جاء من الغد حين قال: قال فقال له أصحابه أخرج فعل الله بك تجئ كل يوم حين ينام لا تدعه ينام قال فجعل يصيح من أجل أني مسكين لو كنت غنيا قال فسمع أيضا فقال ما لك ؟ قال ذهبت إليه فضربني قال امش حتى أجيء معك قال فهو ممسك بيده فلما رآه ذهب معه نشر يده منه ففر. وهكذا روي عن عبدالله بن الحارث ومحمد بن قيس وأبي حجيرة الأكبر وغيرهم من السلف نحو هذه القصة والله أعلم وقال ابن أبي حاتم حدثنا أبي حدثنا أبو الجماهر أخبرنا سعيد بن بشير حدثنا قتادة عن كنانة ابن الأخنس قال سمعت الأشعري وهو يقول على هذا المنبر: ما كان ذو الكفل بنبي ولكن كان - يعني في بني إسرائيل- رجل صالح يصلي كل يوم مائة صلاة فتكفل له ذو الكفل من بعده فكان يصلي كل يوم مائة صلاة فسمي ذا الكفل وقد رواه ابن جرير من حديث عبد الرزاق عن معمر عن قتادة قال: قال أبو موسى الأشعري فذكره منقطعا والله أعلم وقد روى الإمام أحمد حديثا غريبا فقال حدثنا أسباط بن محمد حدثنا الأعمش عن عبد الله ابن عبد الله عن سعد مولى طلحة عن ابن عمر قال: سمعت من رسول الله صلى الله عليه وسلم حديثا لو لم أسمعه إلا مرة أو مرتين حتى عد سبع مرات ولكن قد سمعته أكثر من ذلك قال \" كان الكفل من بني إسرائيل لا يتورع من ذنب عمله فأتته امرأة فأعطاها ستين دينارا على أن يطأها فلما قعد منها مقعد الرجل من امرأته أرعدت وبكت فقال ما يبكيك أكرهتك ؟ قالت لا ولكن هذا عمل لم أعمله قط وإنما حملني عليه الحاجة قال فتفعلين هذا ولم تفعليه قط ثم نزل فقال اذهبي بالدنانير لك ثم قال:\" والله لا يعصي الله الكفل أبدا فمات من ليلته فأصبح مكتوبا على بابه قد غفر الله للكفل \" هكذا وقع في هذه الرواية الكفل من غير إضافة والله أعلم وهذا الحديث لم يخرجه أحد من أصحاب الكتب الستة وإسناده غريب وعلى كل تقدير فلفظ الحديث إن كان الكفل ولم يقل ذو الكفل فلعله رجل آخر والله أعلم."
    },
    {
      "ayah": 87,
      "surah": 21,
      "text": "هذه القصة مذكورة ههنا وفي سورة الصافات وفي سورة ن وذلك أن يونس بن متى عليه السلام بعثه الله إلى أهل قرية نينوى وهي قرية من أرض الموصل فدعاهم إلى الله تعالى فأبوا عليه وتمادوا على كفرهم فخرج من بين أظهرهم مغاضبا لهم ووعدهم بالعذاب بعد ثلاث فلما تحققوا منه ذلك وعلموا أن النبي لا يكذب خرجوا إلى الصحراء بأطفالهم وأنعامهم ومواشيهم وفرقوا بين الأمهات وأولادها ثم تضرعوا إلى الله عز وجل وجأروا إليه ورغت الإبل وفصلانها وخارت البقر وأولادها وثغت الغنم وسخالها فرفع الله عنهم العذاب قال الله تعالى \" فلولا كانت قرية آمنت فنفعها إيمانها إلا قوم يونس لما آمنوا كشفنا عنهم عذاب الخزي في الحياة الدنيا ومتعناهم إلى حين \". وأما يونس \" فإنه ذهب فركب قوم في سفينة فلججت بهم وخافوا أن يغرقوا فاقترعوا على رجل يلقونه من بينهم يتخففون منه فوقعت القرعة على يونس فأبوا أن يلقوه ثم أعادوها فوقعت عليه أيضا فأبوا ثم أعادوها فوقعت عليه أيضا قال الله تعالى \" فساهم فكان من المدحضين \" أي وقعت عليه القرعة فقام يونس عليه السلام وتجرد من ثيابه ثم ألقى نفسه في البحر وقد أرسل الله سبحانه من البحر الأخضر- فيما قاله ابن مسعود- حوتا يشق البحار حتى جاء فالتقم يونس حين ألقى نفسه من السفينة فأوحى الله إلى ذلك الحوت أن لا تأكل له لحما ولا تهشم له عظما فإن يونس ليس لك رزقا وإنما بطنك تكون له سجنا وقوله \" وذا النون \" يعني الحوت صحت الإضافة إليه بهذه النسبة. وقوله \" إذ ذهب مغاضبا \" قال الضحاك لقومه \" فظن أن لن نقدر عليه \" أي نضيق عليه في بطن الحوت. يروى نحو هذا عن ابن عباس ومجاهد والضحاك وغيرهم واختاره ابن جرير واستشهد عليه بقوله تعالى \" ومن قدر عليه رزقه فلينفق مما آتاه الله لا يكلف الله نفسا إلا ما آتاها سيجعل الله بعد عسر يسرا \" وقال عطية العوفي أي فظن أن لن نقدر عليه أي نقضي عليه كأنه جعل ذلك بمعنى التقدير فإن العرب تقول قدر وقدر بمعنى واحد وقال الشاعر: فلا عائد ذاك الزمان الذي مضى تباركت ما تقدر يكن ذلك الأمر ومنه قوله تعالى \" فالتقى الماء على أمر قد قدر \" أي قدر وقوله \" فنادى في الظلمات أن لا إله إلا أنت سبحانك إني كنت من الظالمين \" قال ابن مسعود:ظلمة بطن الحوت وظلمة البحر و ظلمة الليل وكذا روي عن ابن عباس وعمرو بن ميمون وسعيد بن جبير ومحمد بن كعب والضحاك والحسن وقتادة وقال سالم بن أبي الجعد: ظلمة حوت في بطن حوت آخر في ظلمة البحر قال ابن مسعود وابن عباس وغيرهما وذلك أنه ذهب به الحوت في البحار يشقها حتى انتهى به إلى قرار البحر فسمع يونس تسبيح الحصى في قراره فعند ذلك وهنالك قال \" لا إله إلا أنت سبحانك إني كنت من الظالمين \" وقال عوف الأعرابي لما صار يونس في بطن الحوت ظن أنه قد مات ثم حرك رجليه فلما تحركت سجد مكانه ثم نادى يا رب اتخذت لك مسجدا في موضع لم يبلغه أحد من الناس وقال سعيد بن أبي الحسن البصري مكث في بطن الحوت أربعين يوما رواهما ابن جرير وقال محمد بن إسحاق بن يسار عمن حدثه عن عبد الله بن رافع مولى أم سلمة سمعت أبا هريرة يقول: قال رسول الله صلى الله عليه وسلم \" لما أراد الله حبس يونس في بطن الحوت أوحى الله إلى الحوت أن خذه ولا تخدش له لحما ولا تكسر له عظما فلما انتهى به إلى أسفل البحر سمع يونس حسا فقال في نفسه ما هذا؟ فأوحى الله إليه وهو في بطن الحوت إن هذا تسبيح دواب البحر قال وسبح وهو في بطن الحوت فسمعت الملائكة تسبيحه فقالوا يا ربنا إنا نسمع صوتا ضعيفا بأرض غريبة قال ذلك عبدي يونس عصاني فحبسته في بطن الحوت في البحر قالوا العبد الصالح الذي كان يصعد إليك منه في كل يوم وليلة عمل صالح؟ قال نعم قال فشفعوا له عند ذلك فأمر الحوت فقذفه في الساحل كما قال الله تعالى \" وهو سقيم \" \" رواه ابن جرير ورواه البزار في مسنده من طريق محمد بن إسحاق عن عبد الله بن رافع عن أبي هريرة فذكره بنحوه ثم قال لا نعلمه يروى عن النبي إلا من هذا الوجه بهذا الإسناد. وروى ابن أبي حاتم حدثنا أبو عبد الله أحمد بن عبد الرحمن بن أخي ابن وهب حدثنا عمي حدثني أبو صخر أن يزيد الرقاشي حدثه قال سمعت أنس ابن مالك ولا أعلم إلا أن أنسا يرفع الحديث إلى رسول الله صلى الله عليه وسلم أن يونس النبي عليه السلام حين بدا له أن يدعو بهذه الكلمات وهو في بطن الحوت قال: اللهم لا إله إلا أنت سبحانك إني كنت من الظالمين فأقبلت هذه الدعوة تحت العرش فقالت الملائكة يا رب صوت ضعيف معروف من بلاد غريبة فقال أما تعرفون ذاك؟ قالوا لا يا رب ومن هو؟ قال عبدي يونس قالوا عبدك يونس الذي لم يزل يرفع له عمل متقبل ودعوة مجابة قالوا يا رب أولا ترحم ما كان يصنع في الرخاء فتنجيه من البلاء قال بلى فأمر الحوت فطرحه في العراء."
    },
    {
      "ayah": 88,
      "surah": 21,
      "text": "وقوله \" فاستجبنا له ونجيناه من الغم \" أي أخرجناه من بطن الحوت وتلك الظلمات \" وكذلك ننجي المؤمنين \" أي إذا كانوا في الشدائد ودعونا منيبين إلينا ولا سيما إذا دعوا يهذا الدعاء في حال البلاء فقد جاء الترغيب في الدعاء به عن سيد الأنبياء قال الإمام أحمد حدثنا إسماعيل بن عمير حدثنا يونس بن أبي إسحاق الهمداني حدثنا إبراهيم بن محمد ابن سعد حدثني والدي محمد عن أبيه سعد هو ابن أبي وقاص رضي الله عنه قال مررت بعثمان بن عفان رضي الله عنه في المسجد فسلمت عليه فملأ عينيه مني ثم لم يرد علي السلام فأتيت عمر بن الخطاب فقلت يا أمير المؤمنين هل حدث في الإسلام شيء مرتين قال لا وما ذاك قلت لا إلا أني مررت بعثمان آنفا في المسجد فسلمت عليه فملأ عينيه مني ثم لم يرد علي السلام قال فأرسل عمر إلى عثمان فدعاه فقال ما منعك أن لا تكون رددت على أخيك السلام قال ما فعلت قال سعد قلت بلى حتى حلف وحلفت قال ثم إن عثمان ذكر فقال بلى وأستغفر الله وأتوب إليه إنك مررت بي آنفا وأنا أحدث نفسي بكلمة سمعت من رسول الله صلى الله عليه وسلم لا والله ما ذكرتها قط إلا تغشى بصري وقلبي غشاوة قال سعد فأنا أنبئك بها إن رسول الله صلى الله عليه وسلم ذكر لنا أول دعوة ثم جاء أعرابي فشغله حتى قام رسول الله صلى الله عليه وسلم فاتبعته فلما أشفقت أن يسبقني إلى منزله ضربت بقدمي الأرض فالتفت إلي رسول الله فقال\" من هذا أبو إسحاق\" قال قلت نعم يا رسول الله صلى الله عليه وسلم قال \" فمه \" قلت لا والله إلا أن ذكرت لنا أول دعوة ثم جاء هذا الأعرابي فشغلك قال \" نعم دعوة ذي النون إذ هو في بطن الحوت \" لا إله إلا أنت سبحانك إني كنت من الظالمين \" فإنه لم يدع بها مسلم ربه في شيء قط إلا استجاب له \" ورواه الترمذي والنسائي في اليوم والليلة من حديث إبراهيم بن محمد بن سعد عن أبيه سعد به وقال ابن أبي حاتم حدثنا أبو سعيد الأشج حدثنا أبو خالد الأحمر عن كثير بن زيد عن المطلب بن حنطب قال أبو خالد أحسبه عن مصعب يعني ابن سعد عن سعد قال: قال رسول الله صلى الله عليه وسلم \" من دعا بدعاء يونس استجيب له \" قال أبو سعيد يريد به \" وكذلك ننجي المؤمنين \" وقال ابن جرير حدثني عمران بن بكار الكلاعي حدثنا يحيى بن صالح حدثنا أبو يحيى بن عبد الرحمن حدثني بشر ابن منصور عن علي بن زيد عن سعيد بن المسيب قال سمعت سعد بن أبي وقاص يقول سمعت رسول الله صلى الله عليه وسلم يقول \" اسم الله الذي إذا دعي به أجاب وإذا سئل به أعطى دعوة يونس بن متى \" قال قلت يا رسول الله صلى الله عليه وسلم هي ليونس خاصة أم لجماعة المسلمين قال \" ليونس بن متى خاصة ولجماعة المؤمنين عامة إذا دعوا بها ألم تسمع قول الله عز وجل \" فنادى في الظلمات أن لا إله إلا أنت سبحانك إني كنت من الظالمين \" فاستجبنا له ونجيناه من الغم وكذلك ننجي المؤمنين \" فهو شرط من الله لمن دعاه به \" وقال ابن أبي حاتم حدثنا أبي حدثنا أحمد بن أبي شريح حدثنا داود بن المحبر بن محذم المقدسي عن كثير بن معبد قال سألت الحسن فقلت يا أبا سعيد اسم الله الأعظم الذي إذا دعي به أجاب وإذا سئل به أعطى؟ قال ابن أخي أما تقرأ القرآن قول الله تعالى \" وذا النون إذ ذهب مغاضبا \" - إلى قوله - \" وكذلك ننجي المؤمنين \" ابن أخي هذا اسم الله الأعظم الذي إذا دعي به أجاب وإذا سئل به أعطى."
    },
    {
      "ayah": 89,
      "surah": 21,
      "text": "يخبر تعالى عن عبده زكريا حين طلب أن يهبه الله ولدا يكون من بعده نبيا وقد تقدمت القصة مبسوطة في أول سورة مريم وفي سورة آل عمران أيضا وههنا أخصر منها \" إذا نادى ربه \" أي خفية عن قومه \" رب لا تذرني فردا \" أي لا وله لى ولا وارث يقوم بعدي في الناس \" وأنت خير الوارثين \" دعاء وثناء مناسب للمسألة."
    },
    {
      "ayah": 9,
      "surah": 21,
      "text": "وقوله \" ثم صدقناهم الوعد \" أي الذي وعدهم ربهم ليهلكن الظالمين صدقهم الله وعده وفعل ذلك ولهذا قال \" فأنجيناهم ومن نشاء \" أي أتباعهم من المؤمنين \" وأهلكنا المسرفين \" أي المكذبين بما جاءت به الرسل."
    },
    {
      "ayah": 90,
      "surah": 21,
      "text": "ويدعوننا رغبا ورهبا وكانوا لنا خاشعين قال الله تعالى \" فاستجبنا له ووهبنا له يحيى وأصلحنا له زوجه \" أي امرأته قال ابن عباس ومجاهد وسعيد بن جبير كانت عاقرا لا تلد فولدت وقال عبد الرحمن بن مهدي عن طلحة بن عمرو عن عطاء كان لسانها طول فأصلحها الله وفي رواية كان في خلقها شيء فأصلحها الله وهكذا قال محمد بن كعب والسدي والأظهر من السياق الأول و قوله \" إنهم كانوا يسارعون في الخيرات \" أي في عمل القربات والطاعات \" ويدعوننا رغباً ورهباً \" قال الثوري رغبا فيما عندنا ورهبا مما عندنا \" وكانوا لنا خاشعين \" قال علي بن أبي طلحة عن ابن عباس أي مصدقين بما أنزل الله وقال مجاهد مؤمنين حقا وقال أبو العالية خائفين وقال أبو سنان الخشوع هو الخوف اللازم للقلب لا يفارقه أبدا وعن مجاهد أيضا خاشعين أي متواضعين وقال الحسن وقتادة والضحاك خاشعين أي متذللين لله عز وجل وكل هذه الأقوال متقاربة وقال ابن أبي حاتم حدثنا علي بن محمد الطنافسي حدثنا محمد بن فضيل حدثنا عبد الرحمن بن إسحاق عن عبد الله القرشي عن عبد الله بن حكيم قال خطبنا أبو بكر رضي الله عنه ثم قال أما بعد فإني أوصيكم بتقوى الله وتثنوا عليه بما هو له أهل وتخلطوا الرغبة بالرهبة وتجمعوا الإلحاف بالمسألة فإن الله عز وجل أثنى على زكريا وأهل بيته فقال \" إنهم كانوا يسارعون في الخيرات ويدعوننا رغبا ورهبا وكانوا لنا خاشعين \"."
    },
    {
      "ayah": 91,
      "surah": 21,
      "text": "هكذا يذكر تعالى قصة مريم وابنها عيسى \" مقرونة بقصة زكريا وابنه يحيى \" فيذكر أولا قصة زكريا ثم يتبعها بقصة مريم لأن تلك مربوطة بهذه فإنها إيجاد ولد من شيخ كبير قد طعن في السن ومن امرأة عجوز عاقر لم تكن تلد في حال شبابها ثم يذكر قصة مريم وهي أعجب فإنها إيجاد ولد من أنثى بلا ذكر هكذا وقع في سورة آل عمران وفي سورة مريم وههنا ذكر قصة زكريا ثم أتبعها بقصة مريم بقوله \" والتي أحصنت فرجها \" يعني مريم عليها السلام كما قال في سورة التحريم \" ومريم ابنت عمران التي أحصنت فرجها فنفخنا فيه من روحنا \" وقوله \" وجعلناها وابنها آية للعالمين \" أي دلالة على أن الله على كل شيء قدير وأنه يخلق ما يشاء وإنما أمره إذا أراد شيئا أن يقول له كن فيكون وهذا كقوله \" ولنجعله آية للناس \" قال ابن أبي حاتم حدثنا أبي حدثنا عمر بن علي حدثنا أبو عاصم الضحاك بن مجلد عن شعيب يعني ابن بشير عن عكرمة عن ابن عباس في قوله \" للعالمين \" قال العالمين الجن والإنس."
    },
    {
      "ayah": 92,
      "surah": 21,
      "text": "قال ابن عباس ومجاهد وسعيد بن جبير وقتادة وعبد الرحمن بن زيد بن أسلم في قوله \" إن هذه أمتكم أمة واحدة \" يقول دينكم دين واحد وقال الحسن البصري في هذه الآية يبين لهم ما يتقون وما يأتون ثم قال \" إن هذه أمتكم أمة واحدة \" أي سنتكم سنة واحدة فقوله \" إن هذه \" إن واسمها و \" أمتكم \" خبر إن أي هذه شريعتكم التي بينت لكم ووضحت لكم وقوله أمة واحدة نصب على الحال ولهذا قال \" وأنا ربكم فاعبدون \" وكما قال \" يا أيها الرسل كلوا من الطيبات واعملوا صالحا ـ إلى قوله ـ وأنا ربكم فاتقون \" وقال رسول الله صلى الله عليه وسلم \"نحن معاشر الأنبياء أولاد علات ديننا واحد\" يعني أن المقصود هو عبادة الله وحده لا شريك له بشرائع متنوعة لرسله كما قال تعالى \" لكل جعلنا منكم شرعة ومنهاجا \"."
    },
    {
      "ayah": 93,
      "surah": 21,
      "text": "وقوله \" وتقطعوا أمرهم بينهم \" أي اختلف الأمم على رسلها فمن بين مصدق لهم ومكذب ولهذا قال \"وكل إلينا راجعون \" أي يوم القيامة فيجازى كل بحسب عمله إن خيرا فخير وإن شرا فشر."
    },
    {
      "ayah": 94,
      "surah": 21,
      "text": "وهذا قال \" فمن يعمل من الصالحات وهو مؤمن \" أي قلبه مصدق وعمل عملا صالحا \" فلا كفران لسعيه \" كقوله: \" إنا لا نضيع أجر من أحسن عملا \" أي لا يكفر سعيه وهو عمله بل يشكر فلا يظلم مثقال ذرة ولهذا قال \" وإنا له كاتبون \" أي يكتب جميع عمله فلا يضيع عليه منه شيء."
    },
    {
      "ayah": 95,
      "surah": 21,
      "text": "يقول تعالى \" وحرام على قرية \" قال ابن عباس وجب يعني قد قدر أن أهل كل قرية أهلكوا أنهم لا يرجعون إلى الدنيا قبل يوم القيامة هكذا صرح به ابن عباس وأبو جعفر الباقر وقتادة وغير واحد وفي رواية عن ابن عباس أنهم لا يرجعون أي لا يتوبون والقول الأول أظهر والله أعلم."
    },
    {
      "ayah": 96,
      "surah": 21,
      "text": "وقوله \" حتى إذا فتحت يأجوج ومأجوج \" قد قدمنا أنهم من سلالة آدم عليه السلام بل هم من نسل نوح أيضا من أولاد يافث أي أبي الترك والترك شرذمة منهم تركوا من وراء السد الذي بناه ذو القرنين وقال: \" هذا رحمة من ربي فإذا جاء وعد ربي جعله دكاء وكان وعد ربي حقًا وتركنا بعضهم يومئذ يموج في بعض \" الآية. وقال في هذه الآية الكريمة \" حتى إذا فتحت يأجوج ومأجوج وهم من كل حدب ينسلون \" أي يسرعون في المشي إلى الفساد والحدب هو المرتفع من الأرض قاله ابن عباس وعكرمة وأبو صالح والثوري وغيرهم وهذه صفتهم في حال خروجهم كأن السامع مشاهد لذلك \" ولا ينبئك مثل خبير \" هذأ إخبار عالم ما كان وما يكون الذي يعلم غيب السموات والأرض لا إله إلا هو. وقال ابن جرير حدثنا محمد بن مثنى حدثنا محمد بن جعفر حدثنا شعبة عن عبد الله بن يزيد قال: رأى ابن عباس صبيانا ينزو بعضهم على بعض يلعبون فقال ابن عباس: هكذا يخرج يأجوج ومأجوج وقد ورد ذكر خروجهم في أحاديث متعددة من السنة النبوية. فالحديث الأول قال الإمام أحمد حدثنا يعقوب حدثنا أبي عن ابن إسحاق عن عاصم بن عمرو بن قتادة عن محمود بن لبيد عن أبي سعيد الخدري قال سمعت رسول الله صلى الله عليه وسلم يقول \"تفتح يأجوج ومأجوج فيخرجون على الناس كما قال الله عز وجل \" وهم من كل حدب ينسلون \" فيغشون الناس وينحاز المسلمون عنهم إلى مدائنهم وحصونهم ويضمون إليهم مواشيهم ويشربون مياه الأرضي حتى أن بعضهم ليمر بالنهر فيشربون ما فيه حتى يتركوه يابسا حتى إن من بعدهم ليمر بذلك النهر فيقول قد كان ههنا ماء مرة حتى إذا لم يبق من الناس أحد إلا أحد في حصن أو مدينة قال قائلهم هؤلاء أهل الأرض قد فرغنا منهم بقي أهل السماء قال ثم يهز أحدهم حربته ثم يرمي بها إلى السماء فترجع إليه مخضبة دما للبلاء والفتنة فبينما هم على ذلك بعث الله عز وجل دودا في أعناقهم كنغف الجراد الذي يخرج في أعناقه فيصبحون موتى لا يسمع لهم حس فيقول المسلمون ألا رجل يشري لنا نفسه فينظر ما فعل هذا العدو قال فينحدر رجل منهم محتسبا نفسه قد أوطنها على أنه مقتول فينزل فيجدهم موتى بعضهم على بعض فينادي يا معشر المسلمين: ألا أبشروا إن الله عز وجل قد كفاكم عدوكم فيخرجون من مدائنهم وحصونهم و يسرحرن مواشيهم فما يكون لهم رعي إلا لحومهم فتشكر عنهم كأحسن ما شكرت عن شيء من النبات أصابته قط\" ورواه ابن ماجة من حديث يونس بن بكير عن ابن إسحاق به الحديث الثاني: قال الإمام أحمد أيضا حدثنا الوليد بن مسلم أبو العباس الدمشقي حدثنا عبد الرحمن بن يزيد بن جابر حدثني يحيى بن جابر الطائي قاضي حمص حدثني عبد الرحمن بن جبير بن نفير الحضرمي عن أبيه أنه سمع النواس بن سمعان الكلابي قال ذكر رسول الله صلى الله عليه وسلم الدجال ذات غداة فخفض فيه ورفع حتى ظنناه في ناحية النخل فقال \" غير الدجال أخوفني عليكم فإن يخرج وأنا فيكم فأنا حجيجه دونكم وإن يخرج ولست فيكم فكل امرئ حجيج نفسه والله خليفتي على كل مسلم وإنه شاب جعد قطط عينه طافية وإنه يخرج من خلة بين الشام والعراق فَعَاثَ يمينا وشمالا يا عباد الله اثْبُتوا - قلنا يا رسول الله ما لُبْثه في الأرض ؟ - قال أربعون يوما يومٌ كسنة ويوم كشهر ويوم كجمعة وسائر أيامه كأيامكم \" قلنا يا رسول الله فذاك اليوم الذي هو كسنة أيكفينا فيه صلاة يوم وليلة قال \" لا اقدروا له قدره \" قلنا يا رسول الله فما إسراعه في الأرض قال \" كالغيث استدبرته الريح قال فيمر بالحي فيدعوهم فيستجيبون له فيأمر السماء فتمطر والأرض فتنبت وتروح عليهم سارحتهم وهي أطول ما كانت ذرى وأمده خواصر وأسبغه ضروعا ويمر بالحي فيدعوهم فيردون عليه قوله فتتبعه أموالهم فصيحون ممحلين ليس لهم من أموالهم شيء ويمر بالخربة فيقول لها أخرجي كنوزك فشبعه كنوزها كيعاسيب النحل - قال - ويأمر برجل فيقتل فيضربه بالسيف فيقطعه جِزلتين رمية الغرض ثم يدعوه فيقبل إليه فينما هم على ذلك إذ بعث الله عز وجل المسيح ابن مريم فينزل عند المنارة البيضاء شرقي دمشق بين مهرودتين واضعا يديه على أجنحة ملكين فيتبعه فيدركه فيقتله عند باب لُدٍّ الشرقي - قال- فبينما هم كذلك إذ أوحى الله عز وجل إلى عيسى ابن مريم عليه السلام أني قد أخرجت عبادا من عبادي لا يدان لك بقتالهم فحرر عبادي إلى الطور فيبعث الله- عز وجل- يأجوج ومأجوج كما قال تعالى: \" وهم من كل حدب ينسلون \" فيرغب عيسى وأصحابه إلى الله عز وجل فيرسل عليهم نغفا في رقابهم فيصبحون فرسى كموت نفس واحدة فيهبط عيسى وأصحابه فلا يجدون في الأرض بيتا إلا قد ملأه زهمهم ونتنهم فيرغب عيسى وأصحابه إلى الله عز وجل فيرسل الله عليهم طيرا كأعناق البخت فتحملهم فتطرحهم حيث شاء الله \" قال ابن جابر فحدثني عطاء بن يزيد السكسكي عن كعب أو غيره قال فتطرحهم بالمهيل: قال ابن جابر فقلت يا أبا يزيد وأبن المهل قال مطلع الشمس قال \" ويرسل الله مطرا لا يكن منه بيت مدر ولا وبر أربعين يوما فيغسل الأرض حتى يتركها كالزلقة ويقال للأرض أنبتي ثمرك ودري بركتك قال فيومئذ يأكل النفر من الرمانة فيستظلون بقحفها ويبارك في الرسل حتى إن اللقحة من الإبل لتكفي الفئام من الناس واللقحة من البقر تكفي الفخذ والشاة من الغنم تكفي أهل البيت قال فبيناهم على ذلك إذ بعث الله عز وجل ريحا طيبا فتأخذهم تحت آباطهم فتقبض روح كل مسلم - أو قال مؤمن - ويبقى سرار الناس يتهارجون تهارج الحمر وعليهم تقوم الساعة \" انفرد بإخراجه مسلم دون البخاري ورواه مع بقية أهل السنن من طرق عن عبدالرحمن بن يزيد بن جابر به وقال الترمذي حسن صحيح. الحديث الثالث: قال الإمام أحمد حدثنا محمد بن بشر حدثنا محمد بن عمرو عن ابن حرملة عن خالته قالت: خطب رسول الله صلى الله عليه وسلم وهو عاصب أصبعه من لدغة عقرب فقال: \" إنكم تقولون لا عدو لكم لأنكم لا تزالون تقاتلون عدوا حتى يأتي يأجوج ومأجوج عراض الوجوه صغار العيون صهب الشعاف من كل حدب ينسلون كأن وجوههم المجان المطرقة \" وكذا رواه ابن أبي حاتم من حديث محمد بن عمرو عن خالد بن عبدالله بن حرملة المدلجي عن خالة له عن النبي \"صلى الله عليه وسلم\" فذكره مثله سواء. الحديث الرابع: قد تقدم في آخر تفسير سورة الأعراف من رواية الإمام أحمد عن هشيم عن العوام عن جبلة بن سحيم عن مرثد بن عمارة عن ابن مسعود رضي الله عنه عن رسول الله صلى الله عليه وسلم قال: \" لقيت ليلة أسري بي إبراهيم وموسى وعيسى \" - قال - فتذاكروا أمر الساعة فردوا أمرهم إلى إبراهيم فقال لا علم لى بها فردوا أمرهم إلى موسى فقال لا علم لي بها فردوا أمرهم إلى عيسى فقال أما وجبتها فلا يعلم بها أحد إلا الله وفيما عهد إلي ربي أن الدجال خارج ومعي قضيبان فإذا رآنى ذاب كما يذوب الرصاص قال فيهلكه الله إذا رآني حتى أن الحجر والشجر يقول يا مسلم إن تحتي كافرا فتعال فاقتله قال فيهلكهم الله ثم يرجع الناس إلى بلادهم وأوطانهم - قال- فعند ذلك يخرج يأجوج ومأجوج وهم من كل حدب ينسلون فيطؤن بلادهم ولا يأتون على شيء إلا أهلكوه ولا يمرون على ماء إلا شربوه - قال - ثم يرجع الناس إلى أوطانهم يشكونهم فأدعو الله عليهم فيهلكهم ويميتهم حتى تجوى الأرض من نتن ريحهم وينزل الله المطر فيجترف أجسادهم حتى يقذفهم في البحر ففيما عهد إلي ربي أن ذلك إذا كان كذلك أن الساعة كالحامل المتم لا يدري أهلها متى تفجؤهم بولادها ليلا أو نهارا \" ورواه ابن ماجة عن محمد بن بشار عن يزيد بن هارون عن العوام بن حوشب به نحوه وزاد قال العوام ووجد تصديق ذلك في كتاب الله عز وجل \" حتى إذا فتحت يأجوج ومأجوج وهم من كل حدب ينسلون \" ورواه ابن جرير ههنا من حديث جبلة به والأحاديث في هذا كثيرة جدا والآثار عن السلف كذلك. وقد روى ابن جرير وابن أبي حاتم من حديث معمر عن غير واحد عن حميد بن هلال عن أبي الصيف قال: قال كعب إذا كان عند خروج يأجوج ومأجوج حفروا حتى يسمع الذين يلونهم قرع فئوسهم فإذا كان الليل ألقى الله على لسان رجل منهم يقول نجيء غدا فنخرج فيعيده الله كما كان فيجيئون من الغد فيجدونه قد أعاده الله كما كان فيحفرونه حتى يسمع الذين يلونهم قرع فئوسهم فإذا كان الليل ألقى الله على لسان رجل منهم يقول: نجيء غدا فنخرج إن شاء الله فيجيئون من الغد فيجدونه كما ترموه فيحفرون حتى يخرجوا فتمر الزمرة الأولى بالبحيرة فيشربون ماءها ثم تمر الزمرة الثانية فيلحسون طينها ثم تمر الزمرة الثالثة فيقولون قد كان ههنا مرة ماء فيفر الناس منهم فلا يقوم له شيء ثم يرمون بسهامهم إلى السماء فترجع إليهم مخضبة بالدماء فيقولون غلبنا أهل الأرض وأهل السماء فيدعو عليهم عيسى ابن مريم عليه السلام فيقول اللهم لا طاقة ولايدى لنا بهم فاكفناهم بما شئت فيسلط الله عليهم دودا يقال له النغف فيفرس رقابهم ويبعث الله عليهم طيرا تأخذهم بمناقيرها فتلقيهم في البحر ويبعث الله عينا يقال لها الحياة يطهر الله الأرض وينبتها حتى أن الرمانة ليشبع منها السكن قيل وما السكن يا كعب ؟ قال أهل البيت قال فبينما الناس كذلك إذ أتاهم الصريخ أن ذا السويقتين يريده قال فيبعث عيسى ابن مريم طليعة سبعمائة أو بين السبعمائة والثمانمائة حتى إذا كانوا ببعض الطريق بعث الله ريحا يمانية طيبة فيقبض فيها روح كل مؤمن ثم يبقى عجاج الناس فيتسافدون كما تتساف البهائم فمثل الساعة كمثل رجل يطيف حول فرسه متى تضع قال كعب فمن قال بعد قولي هذا شيئا أو بعد علمي هذا شيئا فهو المتكلف وهذا من أحسن سياقات كعب الأحبار لما شهد له من صحيح الأخبار وقد ثبت في الحديث أن عيسى ابن مريم يحج البيت العتيق. وقال الإمام أحمد حدثنا سليمان بن داود حدثنا عمران عن قتادة عن عبدالله بن أبي عتبة عن أبي سعيد قال: قال رسول الله صلى الله عليه وسلم \" ليحجن هذا البيت وليعتمرن بعد خروج يأجوج ومأجوج \" انفرد بإخراجه البخاري."
    },
    {
      "ayah": 97,
      "surah": 21,
      "text": "وقوله \" واقترب الوعد الحق \" يعني يوم القيامة إذا حصلت هذه الأهوال والزلازل والبلابل أزفت الساعة واقتربت فإذا كانت ووقعت قال الكافرون هذا يوم عسر ولهذا قال تعالى \" فإذا هي شاخصة أبصار الله الذين كفروا \" أي من شدة ما يشاهدونه من الأمور العظام يا ويلنا أي يقولون يا ويلنا قد كنا في غفلة من هذا \" أي في الدنيا \" بل كنا ظالمين يعترفون بظلمهم لأنفسهم حيث لا ينفعهم ذلك."
    },
    {
      "ayah": 98,
      "surah": 21,
      "text": "يقول تعالى مخاطبا لأهل مكة من مشركي قريش ومن دان بدينهم من عبدة الأوثان \" إنكم وما تعبدون من دون الله حصب جهنم \" قال ابن عباس أي وقودها يعني كقوله \" وقودها الناس والحجارة \" وقال ابن عباس أيضا حصب جهنم يعني شجر جهنم وفي رواية قال \" حصب جهنم \" يعني حطب جهنم بالزنجية وقال مجاهد وعكرمة وقتادة حطبها وهي كذلك في قراءة علي وعائشة \" وقال الضحاك جهنم. وكذا قال غيره والجميع قريب وقوله \" أنتم لها واردون \" أي داخلون."
    },
    {
      "ayah": 99,
      "surah": 21,
      "text": "\" لو كان هؤلاء آلهة ما وردوها \" يعني لو كانت هذه الأصنام والأنداد التي اتخذتموها من دون الله آلهة صحيحة لما وردوا النار وما دخلوها \" وكل فيها خالدون \" أي العابدون ومعبوداتهم كلهم فيها خالدون \"."
    }
  ]
}
