{
  "ayahs": [
    {
      "ayah": 1,
      "surah": 22,
      "text": "سورة الحج يقول تعالى آمرا عباده بتقواه ومخبرا لهم بما يستقبلون من أهوال يوم القيامة وزلازلها وأحوالها وقد اختلف المفسرون في زلزلة الساعة هل هى بعد قيام الناس من قبورهم يوم نشورهم إلى عرصات القيامة أو ذلك عبارة عن زلزلة الأرض قبل قيام الناس من أجداثهم كما قال تعالى \" إذا زلزلت الأرض زلزالها وأخرجت الأرض أثقالها \" وقال تعالى \" وحملت الأرض والجبال فدكتا دكة واحدة فيومئذ وقعت الواقعة \" الآية وقال تعالى \" إذا رجت الأرض رجا وبست الجبال بسا \" الآية فقال قائلون هذه الزلزلة كائنة في آخر عمر الدنيا وأول أحوال الساعة وقال ابن جرير حدثنا ابن بشار حدثنا يحيى حدثنا سفيان عن الأعمش عن إبراهيم عن علقمة في قوله \" إن زلزلة الساعة شيء عظيم \" قال قبل الساعة ورواه ابن أبي حاتم من حديث الثوري عن منصور والأعمش عن إبراهيم عن علقمة فذكره قال وروي عن الشعبي وإبراهيم وعبيد بن عمير نحو ذلك وقال أبو كدينة عن عطاء عن عامر الشعبي \" يا آيها الناس اتقوا ربكم إن زلزلة الساعة شيء عظيم \" قال هذا في الدنيا قبل يوم القيامة وقد أورد الإمام أبو جعفر بن جرير مستند من قال ذلك في حديث الصور من رواية إسماعيل بن رافع قاضي أهل المدينة عن يزيد بن أبي زياد عن رجل من الأنصار عن محمد بن كعب القرظي عن رجل عن أبي هريرة قال: قال رسول الله صلى الله عليه وسلم \" إن الله لما فرغ من خلق السموات والأرض خلق الصور فأعطاه إسرافيل فهو واضعه على فيه شاخص ببصره إلى العرش ينتظر متى يؤمر \" قال أبو هريرة يا رسول الله وما الصور ؟ قال قرن قال فكيف هو ؟ قال \" قرن عظيم ينفخ فيه ثلاث نفخات الأولى نفخة الفزع والثانية نفخة الصعق والثالثة نفخة القيام لرب العالمين يأمر الله إسرافيل بالنفخة الأولى فيقول انفخ نفخة الفزع فيفزع أهل السموات وأهل الأرض إلا من شاء الله ويأمره فيمدها ويطولها ولا يفتر وهي التي يقول الله تعالى \" وما ينظر هؤلاء إلا صيحة واحدة ما لها من فواق \" فتسير الجبال فتكون ترابا وترج الأرض بأهلها رجا وهي التي يقول الله تعالى \" يوم ترجف الراجفة تتبعها الرادفة قلوب يومئذ واجفة \" فتكون الأرض كالسفينة الموبقة في البحر تضربها الأمواج تكفؤها بأهلها وكالقنديل المعلق بالعرش ترجحه الأرواح فيمتد الناس على ظهرها فتذهل المراضع وتضع الحوامل ويشيب الولدان وتطير الشياطين هاربة حتى تأتي الأقطار فتلقاها الملائكة فتضرب وجوهها فترجع ويولي الناس مدبرين ينادي بعضهم بعضا وهي التي يقول الله تعالى \" يوم التناد يوم تولون مدبرين ما لكم من الله من عاصم ومن يضلل الله فما له من هاد \" فبينما هم على ذلك إذا تصدعت الأرض من قطر إلى قطر ورأوا أمرا عظيما فأخذهم لذلك من الكرب ما الله أعلم به ثم نظروا إلى السماء فإذا هي كالمهل ثم خسف شمسها وقمرها وانتثرت نجومها ثم كشطت عنهم قال رسول الله صلى الله عليه وسلم \" والأموات لا يعلمون بشيء من ذلك \" قال أبو هريرة فمن استثنى الله حين يقول \" فزع من في السموات ومن في الأرض إلا من شاء الله \" قال \" أولئك الشهداء وإنما يصل الفزع إلى الأحياء أولئك أحياء عند ربهم يرزقون ووقاهم الله شر ذلك اليوم وآمنهم وهو عذاب الله يبعثه على شرار خلقه وهو الذي يقول الله \" يا أيها الناس اتقوا ربكم إن زلزلة الساعة شيء عظيم يوم ترونها تذهل كل مرضعة عما أرضعت وتضع كل ذات حمل حملها وترى الناس سكارى وما هم بسكارى ولكن عذاب الله شديد \" وهذا الحديث قد رواه الطبراني وابن جرير وابن أبي حاتم وغير واحد مطولا جدا والغرض منه أنه دل على أن هذه الزلزلة كائنة قبل يوم الساعة أضيفت إلى الساعة لقربها منها كما يقال أشراط الساعة ونحو ذلك والله أعلم وقال آخرون بل ذلك هول وفزع وزلزال وبلبال كائن يوم القيامة في العرصات بعد القيامة من القبور واختار ذلك ابن جرير واحتجوا بأحاديث: \"الأول\" قال الإمام أحمد حدثنا يحيى عن هشام حدثنا قتادة عن الحسن عن عمران بن حصين أن رسول الله صلى الله عليه وسلم قال وهو في بعض أسفاره وقد تقارب من أصحاب السير رفع بهاتين الآيتين صوته: \" يا أيها الناس اتقوا ربكم إن زلزلة الساعة شيء عظيم يوم ترونها تذهل كل مرضعة عما أرضعت وتضع كل ذات حمل حملها وترى الناس سكارى وما هم بسكارى ولكن عذاب الله شديد \" فلما سمع أصحابه بذلك حثوا المطي وعرفوا أنه عند قول يقوله فلما دنوا حوله قال \" أتدرون أي يوم ذلك ذاك يوم ينادى آدم عليه السلام فيناديه ربه عز وجل فيقول يا آدم ابعث بعثك إلى النار فيقول يا رب وما بعث النار؟ فيقول: من كل ألف تسعُمائة وتسعةٌ وتسعون في النار وواحد في الجنة \" قال فأبلس أصحابه حتى ما أوضحوا أيضا حكمه فلما رأى ذلك قال \" أبشروا واعملوا فوالذي نفس محمد بيده إنكم لمع خلقتين ما كانتا مع شيء قط إلا كثرتاه يأجوج ومأجوج ومن هلك من بني آدم وبني إبليس \" قال فسري عنهم ثم قال \" اعملوا وأبشروا فوالذي نفس محمد بيده ما أنتم في الناس إلا كالشامة في جنب البعير أو الرقمة في ذراع الدابة \" وهكذا رواه الترمذي والنسائي في- كتاب التفسير - من سننيهما عن محمد بن بشار عن يحيى وهو القطان عن هشام وهو الدستوائي عن قتادة به بنحوه وقال الترمذي حسن صحيح. \" طريق آخر \"لهذا الحديث: قال الترمذي حدثنا ابن أبي عمر حدثنا سفيان بن عيينة حدثنا ابن جدعان عن الحسن عن عمران بن حصين أن النبي صلى الله عليه وسلم قال لما نزلت \" يا أيها الناس اتقوا ربكم - إلى قوله - ولكن عذاب الله شديد \" قال نزلت عليه هذه الآية وهو في سفر فقال \" أتدرون أي يوم ذلك ؟ قالوا الله ورسوله أعلم قال - ذلك يوم يقول الله لآدم ابعث بعث النار قال يا رب وما بعث النار ؟ قال تسعمائة وتسعة وتسعون إلى النار وواحد إلى الجنة \" فأنشأ المسلمون يبكون فقال رسول الله صلى الله عليه وسلم \" قاربوا وسددوا فإنها لم تكن نبوة قط إلا كان بين يديها جاهلية قال فيؤخذ العدد من الجاهلية فإن تمت وإلا كملت من المنافقين وما مثلكم ومثل الأمم إلا كمثل الرقمة في ذراع الدابة أو كالشامة في جنب البعير- ثم قال - إني لأرجو أن تكونوا ربع أهل الجنة - فكبروا ثم قال- إني لأرجو أن تكونوا ثلث أهل الجنة - فكبروا ثم قال - إني لأرجو أن تكونوا نصف أهل الجنة \" فكبروا ثم قال ولا أدري أقال الثلثين أم لا وكذا رواه الإمام أحمد عن سفيان بن عيينة به ثم قال الترمذي أيضا هذا حديث صحيح وقد روى عن عروة عن الحسن عن عمران بن الحصين وقد رواه ابن أبي حاتم من حديث سعيد بن أبي عروبة عن قتادة عن الحسن والعلاء بن زياد العدوي عن عمران بن الحصين فذكره وهكذا روى ابن جرير عن بندار عن غندر عن عوف عن الحسن قال بلغني أن رسول الله صلى الله عليه وسلم لما قفل من غزوة العسرة ومعه أصحابه بعد ما شارف المدينة قرأ \" يا أيها الناس اتقوا ربكم إن زلزلة الساعة شيء عظيم \" وذكر الحديث فذكر نحو سياق ابن جدعان والله أعلم الحديث الثاني\" قال ابن أبي حاتم حدثنا أبي حدثنا ابن الطباع حدثنا أبو سفيان يعني المعمري عن معمر عن قتادة عن أنس قال نزلت \" إن زلزلة الساعة شيء عظيم \" وذكر يعني نحو سياق الحسن عن عمران غير أنه قال ومن هلك من كثرة الجن والإنس ورواه ابن جرير بطوله من حديث معمر. الحديث الثالث قال ابن أبي حاتم حدثنا أبي حدثنا سعيد بن سليمان حدثنا عباد يعني ابن العوام حدثنا هلال بن حباب عن عكرمة عن ابن عباس قال: تلا رسول الله صلى الله عليه وسلم هذه الآية فذكر نحوه وقال فيه \" إني لأرجو أن تكونوا ربع أهل الجنة - ثم قال - إني لأرجو أن تكونوا ثلث أهل الجنة - ثم قال- إني لأرجو أن تكونوا شطر أهل الجنة \" ففرحوا وزاد أيضا \" وإنما أنتم جزء من ألف جزء \" \"الحديث الرابع\" قال البخاري عند تفسير هذه الآية: حدثنا عمر بن حفص حدثنا أبي حدثنا الأعمش حدثنا أبو صالح عن أبي سعيد قال: قال النبي صلى الله عليه وسلم \" يقول الله تعالى يوم القيامة يا آدم فيقول لبيك ربنا وسعديك فينادى بصوت إن الله يأمرك أن تخرج من ذريتك بعثا إلى النار قال يا رب وما بعث النار قال من كل ألف -أراه قال - تسعمائة وتسعة وتسعون له فحينئذ تضع الحامل حملها ويشيب الوليد \" وترى الناس سكارى وما هم بسكارى ولكن عذاب الله شديد \" \" فشق ذلك على الناس حتى تغيرت وجوههم قال النبي صلى الله عليه وسلم \" من يأجوج ومأجوج تسعمائة وتسعة وتسعون ومنكم واحد أنتم في الناس كالشعرة السوداء في جنب الثور الأبيض أو كالشعرة البيضاء في جنب الثور الأسود إني لأرجو أن تكونوا ربع أهل الجنة - فكبرنا ثم قال - ثلث أهل الجنة - فكبرنا ثم قال - شطر أهل الجنة \" فكبرنا وقد رواه البخاري أيضا في غير هذا الموضع ومسلم والنسائي في تفسيره من طرق عن الأعمش به \"الحديث الخامس\" قال الإمام أحمد حدثنا عمارة بن محمد ابن أخت سفيان الثوري وعبيدة العمي كلاهما عن إبراهيم بن مسلم عن أبي الأحوص عن عبدالله قال: قال رسول الله صلى الله عليه وعلى آله وسلم \" إن الله يبعث يوم القيامة مناديا يا آدم إن الله يأمرك أن تبعث بعثا من ذريتك إلى النار فيقول آدم يا رب من هم فيقال له من كل مائة تسعة وتسعون \" فقال رجل من القوم من هذا الناجي منا بعد هذا يا رسول الله قال \" هل تدرون ما أنتم في الناس إلا كالشامة في صدر البعير \" انفرد بهذا السند وهذا السياق الإمام أحمد \" الحديث السادس\" قال الإمام أحمد حدثنا يحيى عن حاتم بن أبي صفيرة حدثنا ابن أبي مليكة أن القاسم بن محمد أخبره عن عائشة عن النبي صلى الله عليه وسلم قال \" إنكم تحشرون إلى الله يوم القيامة حفاة عراة غرلا \" قالت عائشة يا رسول الله الرجال والنساء ينظر بعضهم إلى بعض قال يا عائشة إن الأمر أشد من أن يهمهم ذاك \" أخرجاه في الصحيحين\" الحديث السابع\" قال الإمام أحمد حدثنا يحيى بن إسحاق حدثنا ابن لهيعة عن خالد بن أبي عمران عن القاسم بن محمد عن عائشة قالت: قلت يا رسول الله هل يذكر الحبيب حبيبه يوم القيامة؟ قال \" يا عائشة أما عند ثلاث فلا أما عند الميزان حتى يثقل أو يخف فلا وأما عند تطاير الكتب إما يُعطى بيمينه وإما يُعطى بشماله فلا وحين يخرج عنق من النار فيطوي عليهم ويتغيظ عليهم ويقول ذلك العنق: وكلت بثلاثة وكلت بثلاثة وكلت بثلاثة وكلت بمن ادعى مع الله إلها آخر ووكلت بمن لا يؤمن بيوم الحساب ووكلت بكل جبار عنيد - قال- فينطوي عليهم ويرميهم في غمرات جهنم ولجهنم جسر أرق من الشعر وأحد من السيف عليه كلاليب وحسك يأخذان من شاء الله والناس عليه كالبرق وكالطرف وكالريح وكأجاويد الخيل والركاب والملائكة يقولون: يا رب سلم سلم فناج مسلم ومخدوش مسلم ومكور في النار على وجهه \" والأحاديث في أهوال يوم القيامة والآثار كثيرة جدا لها موضع آخر ولهذا قال تعالى \" إن زلزلة الساعة شيء عظيم \" أي أمر عظيم وخطب جليل وطارق مفظع وحادث هائل وكائن عجيب والزلزال هو ما يحصل للنفوس من الرعب والفزع كما قال تعالى \" هنالك ابتلي المؤمنون وزلزلوا زلزالا شديدا \"."
    },
    {
      "ayah": 10,
      "surah": 22,
      "text": "\" ذلك بما قدمت يداك \" أي يقال له هذا تقريعا وتوبيخا \" وأن الله ليس بظلام للعبيد \" كقوله تعالى \" خذوه فاعتلوه إلى سواء الجحيم ثم صبوا فوق رأسه من عذاب الحميم ذق إنك أنت العزيز الكريم إن هذا ما كنتم به تمترون \" وقال ابن أبي حاتم حدثنا أبي حدثنا أحمد بن الصباح حدثنا يزيد بن هارون أنبأنا هشام عن الحسن قال بلغني أن أحدهم يحرق في اليوم سبعين ألف مرة."
    },
    {
      "ayah": 11,
      "surah": 22,
      "text": "قال مجاهد وقتادة وغيرهما على حرف على شك وقال غيرهم على طرف ومنه حرف الحبل أي طرفه أي دخل في الدين على طرف فإن وجد ما يحبه استقر وإلا انشمر وقال البخاري حدثنا إبراهيم بن الحارث حدثنا يحيى بن أبي بكير حدثنا إسرائيل عن أبي الحصين عن سعد بن جبير عن ابن عباس \" ومن الناس من يعبد الله على حرف \" قال كان الرجل يقدم المدينة فإن ولدت امرأته غلام ونتجت خيله قال هذا صالح وإن لم تلد امرأته ولم تنتج خيله قال هذا دين سوء وقال ابن أبي حاتم حدثنا علي بن الحسين حدثنا أحمد بن عبدالرحمن حدثني أبي عن أبيه عن أشعث بن إسحاق القمي عن جعفر بن أبي المغيرة عن سعيد بن جبير عن ابن عباس قال: كان ناس من الأعراب يأتون النبي صلى الله عليه وآله وسلم فيسلمون فإذا رجعوا إلى بلادهم فإن وجدوا عام غيث وعام خصب وعام ولاد حسن قالوا إن ديننا هذا لصالح تمسكوا به وإن وجدوا عام جدوبة وعام ولاد سوء وعام قحط قالوا ما في ديننا هذا خير فأنزل الله على نبيه \" ومن الناس من يعبد الله على حرف فإن أصابه خير اطمأن به \" الآية وقال العوفي عن ابن عباس: كان أحدهم إذا قدم المدينة وهم أرض دونه فإن صح بها جسمه ونتجت فرسه مهرا حسنا وولدت امرأته غلاما رضي به واطمأن إليه وقال ما أصبت منذ كنت على ديني هذا إلا خيرا \" وإن أصابته فتنة \" والفتنة البلاء أي وإن أصابه وجع المدينة وولدت امرأته جارية وتأخرت عنه الصدقة أتاه الشيطان فقال والله ما أصبت منذ كنت على دينك هذا إلا شرا وذلك الفتنة وهكذا ذر قتادة والضحاك وابن جريج وغير واحد من السلف في تفسير هذه الآية وقال عبدالرحمن بن زيد بن أسلم هو المنافق إن صلحت له دنياه أقام على العبادة وإن فسدت عليه دنياه وتغيرت انقلب فلا يقيم على العبادة إلا لما صلح من دنياه فإن أصابته فتنة أو شدة أو اختيار أو ضيق ترك دينه ورجع إلى الكفر وقال مجاهد في قوله \" انقلب على وجهه \" أي ارتد كافرا وقوله \" خسر الدنيا والآخرة \" أي فلا هو حصل من الدنيا على شيء وأما الآخر فقد كفر بالله العظيم فهو فيها في غاية الشقاء والإهانة ولهذا قال تعالى \" ذلك هو الخسران المبين \" أي هذه هي الخسارة العظيمة والصفقة الخاسرة."
    },
    {
      "ayah": 12,
      "surah": 22,
      "text": "وقوله \" يدعو من دون الله ما لا يضره وما لا ينفعه \" أي من الأصنام والأنداد يستغيث بها ويستنصرها ويسترزقها وهي لا تنفعه ولا تضره \" ذلك هو الضلال البعيد \"."
    },
    {
      "ayah": 13,
      "surah": 22,
      "text": "وقوله \" يدعو لمن ضره أقرب من نفعه \" أي ضرره في الدنيا قبل الآخرة أقرب من نفعه فيها وأما في الآخرة فضرره محقق متيقن وقوله \" لبئس المولى ولبئس العشير \" قال مجاهد يعني الوثن يعني بئس هذا الذي دعاه من دون الله مولى يعني وليا وناصرا \" وبئس العشير \" وهو المخالط والمعاشر واختار ابن جرير أن المراد لبئس ابن العم والصاحب \" من يعبد الله على حرف فإن أصابه خير اطمأن به وإن أصابته فتنة انقلب على وجهه \" وقول مجاهد أن المراد به الوثن أولى وقرب إلى سياق الكلام والله أعلم."
    },
    {
      "ayah": 14,
      "surah": 22,
      "text": "لما ذكر أهل الضلالة الأشقياء عطف بذكر الأبرار السعداء من الذين آمنوا بقلوبهم وصدقوا إيمانهم بأفعالهم فعملوا الصالحات من جميع أنواع القربات وتركوا المنكرات فأورثهم ذلك سكنى الدرجات العاليات في روضات الجنات ولما ذكر تعالى أنه أضل أولئك وهدى هؤلاء قال \" إن الله يفعل ما يريد \"."
    },
    {
      "ayah": 15,
      "surah": 22,
      "text": "قال ابن عباس من كان يظن أن لن ينصرَ اللهُ محمدًا \"صلى الله عليه وعلى آله وسلم\" في الدنيا والآخرة فليمدد بسبب أي بحبل \" إلى السماء \" أي سماء بيته \" ثم ليقطع \" يقول ثم ليختنق به وكذا قال مجاهد وعكرمة وعطاء وأبو الجوزاء وقتادة وغيرهم وقال عبدالرحمن بن زيد بن أسلم \" فليمدد بسبب إلى السماء \" أي ليتوصل إلى بلوغ السماء فإن النصر إنما يأتي محمدا من السماء \" ثم ليقطع \" ذلك عنه إن قدر على ذلك وقول ابن عباس وأصحابه أولى وأظهر في المعنى وأبلغ في التهكم فإن المعنى من كان يظن أن الله ليس بناصرٍ محمدا وكتابه ودينه فليذهب فليقتل نفسه إن كان ذلك غائظه فإن الله ناصره لا محاله قال الله تعالى:\" إنا لننصر رسلنا والذين آمنوا في الحياة الدنيا ويوم يقوم الأشهاد \" الآية ولهذا قال: \" فلينظر هل يذهبن كيده ما يغيظ \" قال السدي يعني من شأن محمد وقال عطاء الخراساني فلينظر هل يشفي ذلك ما يجد في صدره من الغيظ."
    },
    {
      "ayah": 16,
      "surah": 22,
      "text": "وقوله \" وكذلك أنزلناه \" أي القرآن \" آيات بينات \" أي واضحات في لفظها ومعناها حجة من الله على الناس \" وأن الله يهدي من يريد \" أي يضل من يشاء ويهدى من يشاء وله الحكمة التامة والحجة القاطعة في ذلك \" لا يسئل عما يفعل وهم يسئلون أما هو فلحكمته ورحمته وعدله وعلمه وقهره وعظمته لا معقب لحكمه وهو سريع الحساب."
    },
    {
      "ayah": 17,
      "surah": 22,
      "text": "يخبر تعالى عن أهل هذه الأديان المختلفة من المؤمنين ومن سواهم من اليهود والصابئين وقد قدمنا في سورة البقرة التعريف بهم واختلاف الناس فيهم والنصارى والمجوس والذين أشركوا فعبدوا مع الله غيره فإنه تعالى \" يفصل بينهم يوم القيامة \" ويحكم بينهم بالعدل فيدخل من آمن به الجنة ومن كفر به النار فإنه تعالى شهيد على أفعالهم حفيظ لأقوالهم عليم بسرائرهم وما تكن ضمائرهم."
    },
    {
      "ayah": 18,
      "surah": 22,
      "text": "يخبر تعالى أنه المستحق للعبادة وحده لا شريك له فإنه يسجد لعظمته كل شيء طوعا وكرها وسجود كل شيء مما يختص به كما قال تعالى \" أو لم يروا إلى ما خلق الله من شيء يتفيأ ظلاله عن اليمين والشمائل سجدا لله وهم داخرون \" وقال ههنا \" ألم تر أن الله يسجد له من في السموات ومن في الأرض \" أي من الملائكة في أقطار السموات والحيوانات في جميع الجهات من الإنس والجن والدواب والطير \" وإن من شيء إلا يسبح بحمده \" وقوله \" والشمس والقمر والنجوم \" إنما ذكر هذه على التنصيص لأنها قد عبدت من دون الله فبين أنها تسجد لخالقها وأنها مربوبة مسخرة \" لا تسجدوا للشمس ولا للقمر واسجدوا لله الذي خلقهن \" الآية وفي الصحيحين عن أبي ذر رضي الله عنه قال قال لي رسول الله صلى الله عليه وسلم \" أتدري أين تذهب هذه الشمس؟ \" قلت الله ورسوله أعلم قال \" فإنها تذهب فتسجد تحت العرش ثم تستأمر فيوشك أن يقال لها ارجعي من حيث جئت \" وفي المسند وسنن أبي داود والنسائي وابن ماجه في حديث الكسوف \" إن الشمس والقمر خلقان من خلق الله وإنهما لا ينكسفان لموت أحد ولا لحياته ولكن الله عز وجل إذا تجلى لشيء من خلقه خشع له \" وقال أبو العالية ما في السماء نجم ولا شمس ولا قمر إلا يقع لله ساجدا حين يغيب ثم لا ينصرف حتى يؤذن له فيأخذ ذات اليمين حتى يرجع إلى مطلعه وأما الجبال والشجر فسجودهما يفيء ظلالهما عن اليمين والشمائل وعن ابن عباس قال جاء رجل فقال يا رسول الله إني رأيتني الليلة وأنا نائم كأني أصلي خلف شجرة فسجدتُ فسجدَتْ الشجرة لسجودي فسمعتها وهي تقول: اللهم أكتب لي بها عندك أجرا وضع عني بها وزرا واجعلها لي عندك ذخرا وتقبلها مني كما تقبلتها من عبدك داود قال ابن عباس فقرأ رسول الله صلى الله عليه وسلم سجدة ثم سجد فسمعته وهو يقول مثل ما أخبره الرجل عن قول الشجرة. رواه الترمذي وابن ماجه وابن حبان في صحيحه ; وقوله \" والدواب \" أي: الحيوانات كلها وقد جاء في الحديث عن الإمام أحمد أن رسول الله صلى الله عليه وسلم نهى عن اتخاذ ظهور الدواب منابر فرب مركوبة خيرا أو أكثر ذكرا لله تعالى من راكبها وقوله: \" وكثير من الناس \" أي يسجد لله طوعا مختارا متعبدا بذلك \" وكثير حق عليه العذاب \" أي ممن امتنع وأبى واستكبر \" ومن يهن الله فماله من مكرم إن الله يفعل ما يشاء \" وقال ابن أبي حاتم حدثنا أحمد ابن شيبان الرملي حدثنا القداح عن جعفر بن محمد عن أبيه عن علي قال قيل لعلى إن ههنا رجلا يتكلم في المشيئة فقال له علي يا عبدالله خلقك الله كما يشاء أو كما شاء قال بل كما شاء قال فيمرضك إذا شاء أو إذا شئت قال إذا شاء قال فيشفيك إذا شاء أو إذا شئت قال إذا شاء قال فيدخلك حيث شئت أو حيث شاء قال بل حيث يشاء قال والله لو قلت غير ذلك لضربت الذي فيه عيناك بالسيف ; وعن أبي هريرة قال: قال رسول الله صلى الله عليه وسلم \" إذا قرأ ابن آدم السجدة اعتزل الشيطان يبكي يقول يا ويله أمر ابن آدم بالسجود فسجد فله الجنة وأمرت بالسجود فأبيت فلي النار \" رواه مسلم وقال الإمام أحمد حدثنا أبو سعيد مولى بني هاشم وأبو عبد الرحمن المقري قالا: حدثنا ابن لهيعة قال حدثنا مشرح بن هاعان أبو مصعب المعافري قال سمعت عقبة بن عامر قال قلت يا رسول الله أفضلت سورة الحج على سائر القرآن بسجدتين قال \" نعم فمن لم يسجد بهما فلا يقرأهما ورواه أبو داود والترمذي من حديث عبدالله بن لهيعة به وقال الترمذي ليس بقوي وفي هذا نظر فإن ابن لهيعة قد صرح فيه بالسماع وأكثر ما نقموا عليه تدليسه وقد قال أبو داود في المراسيل حدثنا أحمد بن عمرو بن السرح أنبأنا ابن وهب أخبرني معاوية بن صالح عن عامر بن جشب عن خالد بن معدان رحمه الله أن رسول الله صلى الله عليه وسلم قال \" فضلت سورة الحج على سائر القرآن بسجدتين \" ثم قال أبو داود وقد أسند هذا يعني من غير هذا الوجه ولا يصح وقال الحافظ أبو بكر الإسماعيلي حدثني ابن أبي داود حدثنا يزيد بن عبدالله حدثنا الوليد حدثنا أبو عمرو حدثنا حفص ابن غياث حدثني نافع قال: حدثني أبو الجهم أن عمر سجد سجدتين في الحج وهو بالجابية وقال إن هذه فضلت بسجدتين وروى أبو داود وابن ماجه من حديث الحارث بن سعيد العُتَقي عن عبدالله بن منين عن عمرو ابن العاص أن رسول الله صلى الله عليه وسلم أقرأه خمس عشرة سجده في القرآن منها ثلاث في المفصل وفي سورة الحج سجدتان فهذه شواهد يشد بعضها بعضا."
    },
    {
      "ayah": 19,
      "surah": 22,
      "text": "ثبت في الصحيح من حديث أبي مجلز عن قيس بن عباد عن أبي ذر أنه كان يقسم قسما أن هذه الآية \" هذان خصمان اختصموا في ربهم \" نزلت في حمزة وصاحبيه وعتبة وصاحبيه يوم برزوا في بدر لفظ البخاري عند تفسيرها ثم قال البخاري حدثنا حجاج بن المنهال حدثنا المعتمر بن سليمان سمعت أبي حدثنا أبو مجلز عن قيس بن عباد عن علي بن أبي طالب أنه قال: أنا أول من يجثو بين يدي الرحمن للخصومة يوم القيامة قال قيس: وفيهم نزلت \" هذان خصمان اختصموا في ربهم \" قال هم الذين بارزوا يوم بدر علي وحمزة وعبيدة وشيبة ابن ربيعة وعتبة بن ربيعة والوليد بن عتبة.انفرد به البخاري. وقال سعيد بن أبي عروبة عن قتادة في قوله \" هذان خصمان اختصموا في ربهم \" قال اختصم المسلمون أهل الكتاب فقال أهل الكتاب نبينا قبل نبيكم وكتابنا قبل كتابكم فنحن أولى بالله منكم وقال المسلمون كتابنا يقضي على الكتب كلها ونبينا خاتم الأنبياء فنحن أولى بالله منكم فأفلج الله الإسلام على من ناوأه وأنزل \" هذان خصمان اختصموا في ربهم \" وكذا روى العوفي عن ابن عباس وقال شعبة عن قتادة في قوله \" هذان خصمان اختصموا في ربهم \" قال مصدق ومكذب وقال ابن أبي نجيح عن مجاهد في هذه الآية مثل الكافر والمؤمن اختصما في البعث وقال في رواية هو وعطاء في هذه الآية هم المؤمنون والكافرون وقال عكرمة \" هذان خصمان اختصموا في ربهم \" قال هي الجنة والنار قالت النار اجعلني للعقوبة وقالت الجنة اجعلني للرحمة وقول مجاهد وعطاء أن المراد بهذه الكافرون والمؤمنون يشمل الأقوال كلها وينتظم فيه قصة يوم بدر وغيرها فإن المؤمنين \" يريدون نصرة دين الله عز وجل والكافرون يريدون إطفاء نور الإيمان وخذلان الحق وظهور الباطل وهذا اختيار ابن جرير وهو حسن ولهذا قال \" فالذين كفروا قطعت لهم ثياب من نار \" أي فصلت لهم مقطعات من النار قال سعيد بن جبير من نحاس وهو أشد الأشياء حرارة إذا حمي \" يصب من فوق رءوسهم الحميم \"."
    },
    {
      "ayah": 2,
      "surah": 22,
      "text": "ثم قال تعالى \" يوم ترونها \" هذا من باب ضمير الشأن ولهذا قال مفسرا له \" تذهل كل مرضعة عما أرضعت \" أي فتشتغل لهول ما ترى عن أحب الناس إليها والتي هي أشفق الناس عليه تدهش عنه في حال إرضاعها له ولهذا قال \" كل مرضعة \" ولم يقل مرضع وقال \" عما أرضعت \" أي عن رضيعها فطامه وقوله \" وتضع كل ذات حمل حملها \" أي قبل تمامه لشدة الهول \" وترى الناس سكارى \" وقرئ \"سكرى\" أي من شدة الأمر الذي قد صاروا فيه قد دهشت عقولهم وغابت أذهانهم فمن رآهم حسب أنهم سكارى \" وما هم بسكارى ولكن عذاب الله شديد \"."
    },
    {
      "ayah": 20,
      "surah": 22,
      "text": "\" يصهر به ما في بطونهم والجلود \" أي إذا صب على رءوسهم الحميم وهو الماء الحار في غاية الحرارة وقال سعيد ابن جبير هو النحاس المذاب أذاب ما في بطونهم من الشحم والأمعاء قاله ابن عباس ومجاهد وسعيد بن جبير وغيرهم وكذلك تذوب جلودهم وقال ابن عباس وسعيد تساقط. وقال ابن جرير حدثني محمد بن المثنى حدثني إبراهيم أبو إسحاق الطالقاني حدثنا ابن المبارك عن سعيد بن يزيد عن أبي السمح عن ابن حجيرة عن أبي هريرة عن النبي صلى الله عليه وسلم قال \" إن الحميم ليصب على رءوسهم فينفد الجمجمة حتى يخلص إلى جوفه فيسلت ما في جوفه حتى يبلغ قدميه وهو الصهر ثم يعاد كما كان \" ورواه الترمذي من حديث ابن المبارك وقال حسن صحيح وهكذا رواه ابن أبي حاتم عن أبيه عن أبي نعيم عن ابن المبارك به ثم قال ابن أبي حاتم حدثنا علي بن الحسين حدثنا أحمد بن أبي الحواري قال سمعت عبدالله ابن السري قال: يأتيه الملك يحمل الإناء بكلبتين من حرارته فإذا أدناه من وجهه تكرهه قال فيرفع مقمعة معه فيضرب بها رأسه فيفرغ دماغه ثم يفرغ الإناء من دماغه فيصل إلى جوفه من دماغه فذلك قوله \" يصهر به ما في بطونهم والجلود \"."
    },
    {
      "ayah": 21,
      "surah": 22,
      "text": "وقوله \" ولهم مقامع من حديد \" قال الإمام أحمد حدثنا حسن بن موسى حدثنا ابن لهيعة حدثنا دراج عن أبي الهيثم عن أبي سعيد عن رسول الله قال \" لو أن مقمعا من حديد وضع في الأرض فاجتمع له الثقلان ما أقلوه من الأرض \" وقال الإمام أحمد حدثنا موسى بن داود حدثنا ابن لهيعة حدثنا دراج عن أبي الهيثم عن أبي سعيد الخدري قال: قال رسول الله صلى الله عليه وسلم \" لو ضرب الجبل بمقمع من حديد لتفتت ثم عاد كما كان ولو أن دلوا من غساق يهراق في الدنيا لأنتن أهل الدنيا \" وقال ابن عباس في قوله \" ولهم مقامع من حديد \" قال يضربون بها فيقع كل عضو على حياله فيدعون بالثبور."
    },
    {
      "ayah": 22,
      "surah": 22,
      "text": "وقوله \" كلما أرادوا أن يخرجوا منها من غم أعيدوا فيها \" قال الأعمش عن أبي ظبيان عن سلمان قال: النار سوداء مظلمة لا يضيء لهبها ولا جمرها ثم قرأ \" كلما أرادوا أن يخرجوا منها من غم أعيدوا فيها \" وقال زيد بن أسلم في هذه الآية \" كلما أرادوا أن يخرجوا منها من غم أعيدوا فيها \" قال بلغني أن أهل النار في النار يتنفسون وقال الفضيل بن عياض: والله ما طمعوا في الخروج إن الأرجل لمقيدة وإن الأيدي لموثقة ولكن يرفعهم لهبها وتردهم مقامعها وقوله \" وذوقوا عذاب الحريق \" كقوله \" وقيل لهم ذوقوا عذاب النار الذي كنتم به تكذبون \" ومعنى الكلام أنهم يهانون بالعذاب قولا وفعلا."
    },
    {
      "ayah": 23,
      "surah": 22,
      "text": "لما أخبر تعالى عن حال أهل النار عياذا بالله من حالهم وما هم فيه من العذاب والنكال والحريق والأغلال وما أعد لهم من الثياب من النار ذكر حال أهل الجنة نسأل الله من فضله وكرمه فقال \" إن الله يدخل الذين آمنوا وعملوا الصالحات جنات تجري من تحتها الأنهار \" أي تتخرق في أكنافها وأرجائها وجوانبها وتحت أشجارها وقصورها يصرفونها حيث شاءوا وأين أرادوا \" يحلون فيها \" من الحلية \" من أساور من ذهب ولؤلؤا \" أي في أيديهم كما قال النبي صلى الله عليه وسلم في الحديث المتفق عليه \" تبلغ الحلية من المؤمن حيث يبلغ الوضوء \" وقال كعب الأحبار: إن في الجنة ملكا لو شئت أن أسميه لسميته يصوغ لأهل الجنة الحلي منذ خلقه الله إلى يوم القيامة لو أبرز قلب منها أي سوار منها - لرد شعاع الشمس كما ترد الشمس نور القمر وقوله \" ولباسهم فيها حرير \" في مقابلة ثياب أهل النار التي فصلت لهم لباس هؤلاء من الحرير إستبرقه وسندسه كما قال \" عاليهم ثياب سندس خضر وإستبرق وحلوا أساور من فضة وسقاهم ربهم شرابا طهورا إن هذا كان لكم جزاء وكان سعيكم مشكورا \" وفي الصحيح \" لا تلبسوا الحرير ولا الديباج في الدنيا فإنه من لبسه في الدنيا لم يلبسه في الآخرة \" قال عبد الله بن الزبير من لم يلبس الحرير في الآخرة لم يدخل الجنة قال الله تعالى \" ولباسهم فيها حرير \"."
    },
    {
      "ayah": 24,
      "surah": 22,
      "text": "وقوله \" وهدوا إلى الطيب من القول \" كقوله تعالى \" وأدخل الذين آمنوا وعملوا الصالحات جنات تجري من تحتها الأنهار خالدين فيها بإذن ربهم تحيتهم فيها سلام \" وقوله \" والملائكة يدخلون عليهم من كل باب سلام عليكم بما صبرتم فنعم عقبى الدار \" وقوله \" لا يسمعون فيها لغوا ولا تأثيما إلا قيلا سلاما سلاما \" فهدوا إلى المكان الذي يسمعون فيه الكلام الطيب وقوله \" ويلقون فيها تحية وسلاما \" لا كما يهان أهل النار بالكلام الذي يوبخون به ويقرعون به يقال لهم \" ذوقوا عذاب الحريق \" وقوله \" وهدوا إلى صراط الحميد \" أي إلى المكان الذي يحمدون فيه ربهم على ما أحسن إليهم وأنعم به وأسداه إليهم كما جاء في الحديث الصحيح \" إنهم يلهمون التسبيح والتحميد كما يلهمون النفس \" وقد قال بعض المفسرين في قوله \" وهدوا إلى الطيب من القول \" أي القرآن وقيل لا إله إلا الله وقيل الأذكار المشروعة \" وهدوا إلى صراط الحميد \" أي الطريق المستقيم في الدنيا وكل هذا لا ينافي ما ذكرناه والله أعلم."
    },
    {
      "ayah": 25,
      "surah": 22,
      "text": "يقول تعالى منكرا على الكفار في صدهم المؤمنين عن إتيان المسجد الحرام وقضاء مناسكهم فيه ودعواهم أنهم أولياؤه \" وما كانوا أولياءه إن أولياؤه إلا المتقون \" الآية وفي هذه الآية دليل على أنها مدنية كما قال في سورة البقرة \" يسألونك عن الشهر الحرام قتال فيه قل قتال فيه كبير وصد عن سبيل الله وكفر به والمسجد الحرام وإخراج أهله منه أكبر عند الله \" وقال ههنا\" إن الذين كفروا ويصدون عن سبيل الله والمسجد الحرام \" أي ومن وصفتهم أنهم مع كفرهم يصدون عن سبيل الله والمسجد الحرام أي ويصدون عن المسجد الحرام من أراده من المؤمنين الذين هم أحق الناس به في نفس الأمر وهذا الترتيب في هذه الآية كقوله تعالى \" الذين آمنوا وتطمئن قلوبهم بذكر الله ألا بذكر الله تطمئن القلوب \" أي ومن صفتهم أنهم تطمئن قلوبهم بذكر الله\" وقوله \" الذي جعلناه للناس سواء العاكف فيه والباد \" أي يمنعون الناس عن الوصول إلى المسجد الحرام وقد جعله الله شرعا سواء لا فرق فيه بين المقيم فيه والنائي عنه البعيد الدار منه \" سواء العاكف فيه والباد \" ومن ذلك استواء الناس في رباع مكة وسكناها كما قال علي بن أبي طلحة عن ابن عباس في قوله \" سواء العاكف فيه والباد \" قال ينزل أهل مكة وهم في المسجد الحرام وقال مجاهد سواء العاكف فيه والباد \" أهل مكة وغيرهم فيه سواء في المنازل وكذا قال أبو صالح وعبد الرحمن بن سابط وعبد الرحمن بن زيد بن أسلم وقال عبد الرزاق عن معمر عن قتادة سواء فيه أهله وغير أهله وهذه المسألة هي التي اختلف فيها الشافعي وإسحق بن راهوية بمسجد الخيف وأحمد ابن حنبل حاضر أيضا فذهب الشافعي رحمه الله إلى أن رباع مكة تملك وتورث وتؤجر واحتج بحديث الزهري عن علي بن الحسن عن عمرو بن عثمان عن أسامة بن زيد قال قلت يا رسول الله أننزل غدا في دارك بمكة ؟ فقال \" وهل ترك لنا عقيل من رباع \" ثم قال \" لا يرث الكافر المسلم ولا المسلم الكافر \" وهذا الحديث مخرج في الصحيحين وبما ثبت أن عمر بن الخطاب اشترى من صفوان بن أمية دارا بمكة فجعلها سجنا بأربعة آلاف درهم وبه قال طاوس وعمرو بن دينار وذهب إسحاق بن راهوية إلى أنها لا تورث ولا تؤجر وهو مذهب طائفة من السلف ونص عليه مجاهد وعطاء واحتج اسحاق بن راهوية بما رواه ابن ماجه عن أبي بكر بن أبي شيبة عن عيسى ابن يونس عن عمر بن سعيد بن أبي حيوة عن عثمان بن أبي سليمان عن علقمة بن نضلة قال: توفي رسول الله صلى الله عليه وسلم وأبو بكر وعمر وما تدعى رباع مكة إلا السوائب من احتاج سكن ومن استغنى أسكن وقال عبد الرزاق بن مجاهد عن أبيه عن عبدالله بن عمرو أنه قال لا يحل بيع دور مكة ولا كراؤها وقال أيضا عن ابن جريج كان عطاء ينهى عن الكراء في الحرم وأخبرني أن عمر بن الخطاب كان ينهى عن تبويب دور مكة لأن ينزل الحاج في عرصاتها فكان أول من بوب داره سهيل بن عمرو فأرسل إليه عمر بن الخطاب في ذلك فقال أنظرني يا أمير المؤمنين إني كنت امرأ تاجرا فأردت أن أتخذ بابين يحبسان لي ظهري قال فلك ذلك إذا وقال عبد الرزاق عن معمر عن منصور عن مجاهد أن عمر بن الخطاب قال يا أهل مكة لا تتخذوا لدوركم أبوابا لينزل البادي حيث يشاء قال وأخبرنا معمر عمن سمع عطاء يقول \" سواء العاكف فيه والباد \" قال ينزلون حيث شاءوا وروى الدارقطني من حديث ابن أبي نجيح عن عبدالله بن عمرو موقوفا \" من أكل كراء بيوت مكة أكل نارا \" وتوسط الإمام أحمد فقال تملك وتورث ولا تؤجر جمعا بين الأدلة والله أعلم وقوله \" ومن يرد فيه بإلحاد بظلم نذقه من عذاب أليم \" قال بعض المفسرين من أهل العربية الباء ههنا زائدة كقوله \" تنبت بالدهن \" أي تنبت الدهن وكذا قوله \" ومن يرد فيه بإلحاد \" تقديره إلحادا وكما قال الأعشى: ضمنت برزق عيالنا أرماحنا بين المراجل والصريح الأجرد وقال الآخر: بواد يمان ينبت العشب صدره وأسفله بالمرخ والشبهان والأجود أنه ضمن الفعل ههنا معنى يهم ولهذا عداه بالباء فقال \" ومن يرد فيه بالحاد \" أي يهم فيه بأمر فظيع من المعاصي الكبار وقوله \" بظلم \" أي عامدا قاصدا أنه ظلم ليس بمتأول كما قال ابن جريج عن ابن عباس هو التعمد. وقال علي بن أبي طلحة عن ابن عباس بظلم بشرك وقال مجاهد أن يعبد فيه غير الله وكذا قال قتادة وغير واحد وقال العوفي عن ابن عباس بظلم هو أن تستحل من الحرم ما حرم الله عليك من إساءة أو قتل فتظلم من لا يظلمك وتقتل من لا يقتلك فإذا فعل ذلك فقد وجب له العذاب الأليم وقال مجاهد بظلم يعمل فيه عملا سيئا وهذا من خصوصية الحرم أنه يعاقب البادي فيه الشر إذا كان عازما عليه وإن لم يوقعه كما قال ابن أبي حاتم في تفسيره حدثنا أحمد بن سنان حدثنا يزيد بن هارون أنبأنا شعبة عن السدي أنه سمع مرة يحدث عن عبدالله يعني ابن مسعود في قوله \" ومن يرد فيه بإلحاد بظلم \" قال لو أن رجلا أراد فيه بإلحاد بظلم وهو بعدن أبين لأذاقه الله من العذاب الأليم قال شعبة هو رفعه لنا وأنا لا أرفعه لكم قال يزيد هو قد رفعه ورواه أحمد عن يزيد بن هارون به قلت هذا الإسناد صحيح على شرط البخاري ووقفه أشبه من رفعه ولهذا صمم شعبة على وقفه من كلام ابن مسعود وكذلك رواه أسباط وسفيان الثوري عن السدي عن مرة عن ابن مسعود موقوفاً والله أعلم وقال الثوري عن السدي عن مرة عن عبدالله قال ما من رجل يهم بسيئة فتكتب عليه ولو أن رجلا بعدن أبين هم أن يقتل رجلا بهذا البيت لأذاقه الله من العذاب الأليم وكذا قال الضحاك بن مزاحم وقال سفيان الثوري عن منصور عن مجاهد إلحاد فيه لا والله وبلى والله وروي عن مجاهد عن عبدالله بن عمرو مثله وقال سعيد بن جبير شتم الخادم ظُلْمٌ فما فوقه وقال سفيان الثوري عن عبدالله بن عطاء عن ميمون بن مهران عن ابن عباس في قوله \" ومن يرد فيه بإلحاد بظلم \" قال تجارة الأمير فيه وعن ابن عمر بيع الطعام بمكة إلحاد وقال حبيب بن أبي ثابت \" ومن يرد فيه بإلحاد بظلم \" قال المحتكر بمكة وكذا قال غير واحد. وقال ابن أبي حاتم حدثنا أبي حدثنا عبدالله بن إسحاق الجوهري أنبأنا أبو عاصم عن جعفر بن يحيى عن عمه عمارة بن ثوبان حدثني موسى بن باذان عن علي بن أمية أن رسول الله صلى الله عليه وسلم قال \" احتكار الطعام بمكة إلحاد \" وقال ابن أبي حاتم حدثنا أبو زرعة حدثنا يحيى بن عبدالله بن بكير حدثنا ابن لهيعة حدثنا عطاء بن دينار حدثني سعيد بن جبير قال قال ابن عباس في قول الله \" ومن يرد فيه بإلحاد بظلم \" قال نزلت في عبدالله بن أنيس أن رسول الله صلى الله عليه وسلم بعثه مع رجلين أحدهما مهاجر والآخر من الأنصار فافتخروا في الأنساب فغضب عبدالله بن أنيس فقتل الأنصاري ثم ارتد عن الإسلام ثم هرب إلى مكة فنزلت فيه \" ومن يرد فيه بإلحاد بظلم \" يعني من لجأ إلى الحرم بإلحاد يعني بميل عن الإسلام وهذه الآثار وإن دلت على أن هذه الأشياء من الإلحاد ولكن هو أعم من ذلك بل فيها تنبيه على ما هو أغلظ منها ولهذا لما هم أصحاب الفيل على تخريب البيت أرسل الله عليهم طيرا أبابيل ترميهم بحجارة من سجيل فجعلهم كعصف مأكول \" أي دمرهم وجعلهم عبرة ونكالا لكل من أراده بسوء ولذلك ثبت في الحديث أن رسول الله صلى الله عليه وسلم قال: \" يغزو هذا البيت جيش حتى إذا كانوا ببيداء من الأرض خسف بأولهم وآخرهم \" الحديث وقال الإمام أحمد حدثنا محمد بن كناسة حدثنا إسحاق بن سعيد عن أبيه قال أتي عبدالله بن عمر عبدالله بن الزبير فقال يا ابن الزبير إياك والإلحاد في حرم الله فإني سمعت رسول الله صلى الله عليه وسلم يقول \" إنه سيلحد فيه رجل من قريش لو توزن ذنوبه بذنوب الثقلين لرجحت \" فانظر لا تكن هو وقال أيضا في مسند عبدالله بن عمرو بن العاص حدثنا هاشم حدثنا إسحق بن سعيد حدثنا سعيد بن عمرو قال أتى عبدالله بن عمر عبدالله بن الزبير وهو جالس في الحجر فقال يا ابن الزبير إياك الإلحاد في الحرم فإني أشهد لسمعت رسول الله صلى الله عليه وسلم يقول \" يحلها ويحل به رجل من قريش لو وزنت ذنوبه بذنوب الثقلين لوزنتها \" قال فانظر لا تكن هو لم يخرجه أحد من أصحاب الكتب من هذين الوجهين."
    },
    {
      "ayah": 26,
      "surah": 22,
      "text": "هذا فيه تقريع وتوبيخ لمن عبد غير الله وأشرك به من قريش في البقعة التي أسست من أول يوم على توحيد الله وعبادته وحده لا شريك له فذكر تعالى أنه بوأ إبراهيم مكان البيت أي أرشده إليه وسلمه له وأذن له في بنائه واستدل به كثير ممن قال إن إبراهيم عليه السلام هو أول من بنى البيت العتيق وأنه لم يبن قبله كما ثبت في الصحيح عن أبي ذر قلت يا رسول الله أي مسجد وضع أول ؟ قال \" المسجد الحرام \" قلت ثم أي ؟ قال \" بيت المقدس \" قلت كم بينهما ؟ قال \" أربعون سنة \" وقد قال الله تعالى \" إن أول بيت وضع للناس للذي ببكة مباركا \" الآيتين وقال تعالى \" وعهدنا إلى إبراهيم وإسماعيل أن طهرا بيتي للطائفين والعاكفين والركع السجود \" وقد قدمنا ذكر ما ورد بناء البيت من الصحاح والآثار بما أغنى عن إعادته ههنا وقال تعالى ههنا \" أن لا تشرك بي شيئا أي ابنه على اسمي وحدي \" وطهر بيتي \" قال قتادة ومجاهد من الشرك \" للطائفين والقائمين والركع السجود \" أي اجعله خالصا لهؤلاء الذين يعبدون الله وحده لا شريك له فالطائف به معروف وهو أخص العبادات عند البيت فإنه لا يفعل ببقعة من الأرض سواها \" والقائمين \" أي في الصلاة ولهذا قال \" والركع السجود \" فقرن الطواف بالصلاة لأنهما لا يشرعان إلا مختصين بالبيت فالطواف عنده والصلاة إليه في غالب الأحوال إلا ما استثني من الصلاة عند اشتباه القبلة وفي الحرب وفي النافلة في السفر والله أعلم."
    },
    {
      "ayah": 27,
      "surah": 22,
      "text": "وقوله \" وأذن في الناس بالحج \" أي ناد في الناس بالحج داعيا لهم إلى الحج إلى هذا البيت الذي أمرناك ببنائه فذكر أنه قال يا رب كيف أبلغ الناس وصوتي لا ينفذهم فقال ناد وعلينا البلاغ فقام على مقامه وقيل على الحجر وقيل على الصفا وقيل على أبي قبيس وقال: يا أيها الناس إن ربكم قد اتخذ بيتا فحجوه فيقال إن الجبال تواضعت حتى بلغ الصوت أرجاء الأرض وأسمع من في الأرحام والأصلاب وأجابه كل شيء سمعه من حجر ومدر وشجر ومن كتب الله أنه يحج إلى يوم القيامة لبيك اللهم لبيك هذا مضمون ما ورد عن ابن عباس ومجاهد وعكرمة وسعيد بن جبير وغير واحد من السلف والله أعلم وأوردها ابن جرير وابن أبي حاتم مطولة وقوله \" يأتوك رجالا وعلى كل ضامر \" الآية قد يستدل بهذه الآية من ذهب من العلماء إلى أن الحج ماشيا لمن قدر عليه أفضل من الحج راكبا لأنه قدمهم في الذكر فدل على الاهتمام بهم وقوة هممهم وشدة عزمهم وقال وكيع عن أبي العميس عن أبي حلحلة عن محمد بن كعب عن ابن عباس قال شيء إلا أني وددت أني كنت حججت ماشياً لأن الله يقول \" يأتوك رجالا \" والذي عليه الأكثرون أن الحج راكبا أفضل اقتداء برسول الله صلى الله عليه وسلم فإنه حج راكبا مع كمال قوته عليه السلام وقوله \" يأتين من كل فج \" يعني طريق كما قال \" وجعلنا فيها فجاجا سبلا \" وقوله \" عميق \" أي بعيد قاله مجاهد وعطاء والسدي وقتادة ومقاتل ابن حيان والثوري وغير واحد وهذه الآية كقوله تعالى إخبارا عن إبراهيم حيث قال في دعائه \" فاجعل أفئدة من الناس تهوي إليهم \" فليس أحد من أهل الإسلام إلا وهو يحن إلى رؤية الكعبة والطواف والناس يقصدونها من سائر الجهات والأقطار."
    },
    {
      "ayah": 28,
      "surah": 22,
      "text": "عباس \" ليشهدوا منافع لهم \" قال منافع الدنيا والآخرة: أما منافع الآخرة فرضوان الله تعالى وأما منافع الدنيا فما يصيبون من منافع البدن والذبائح والتجارات وكذا قال مجاهد وغير واحد إنها منافع الدنيا والآخرة ليس عليكم جناح أن تبتغوا فضلا من ربكم \" وقوله \" ويذكروا اسم الله في أيام معلومات على ما رزقهم من بهيمة الأنعام \" قال شعبة وهشيم عن أبي بشر عن سعيد عن ابن عباس رضي الله عنهما: الأيام المعلومات أيام العشر وعلقه البخاري عنه بصيغة الجزم به وروي مثله عن أبي موسى الأشعري ومجاهد وقتادة وعطاء بن جبير والحسن والضحاك وعطاء الخراساني وإبراهيم النخعي وهو مذهب الشافعي والمشهور عن أحمد ابن حنبل وقال البخاري حدثنا محمد بن عرعرة حدثنا شعبة عن سليمان عن مسلم البطين عن سعيد بن جبير عن ابن عباس عن النبي صلى الله عليه وسلم قال \" ما العمل في أيام أفضل منها في هذه \" قالوا ولا الجهاد في سبيل الله ؟ قال ولا الجهاد في سبيل الله إلا رجل يخرج يخاطر بنفسه وماله فلم يرجع بشيء \" رواه الإمام أحمد وأبو داود والترمذي وابن ماجه بنحوه وقال الترمذي حديث حسن غريب صحيح. وفي الباب عن ابن عمر وأبي هريرة وعبد الله بن عمرو وجابر قلت وقد تقصيت هذه الطرق وأفردت لها جزأ على حدة فمن ذلك ما قال الإمام أحمد حدثنا عثمان أنبأنا أبو عوانة عن يزيد بن أبي زياد مجاهد عن ابن عمر قال: قال رسول الله صلى الله عليه وسلم \" ما من أيام أعظم عند الله ولا أحب إليه العمل فيهن من هذه الأيام العشر فأكثروا فيهن من التهليل والتكبير والتحميد \" وروي من وجه آخر مجاهد عن ابن عمر بنحوه وقال البخاري وكان ابن عمر وأبو هريرة يخرجان إلى السوق في أيام العشر فيكبران ويكبر الناس بتكبيرهما وقد روى أحمد عن جابر مرفوعا أن هذا هو العشر الذي أقسم الله به في قوله \" والفجر وليال عشر \" وقال بعض السلف إنه المراد بقوله \" وأتممناها بعشر \" وفي سنن أبي داود أن رسول الله كان يصوم هذا العشر وهذا العشر مشتمل على يوم عرفة الذي ثبت في صحيح مسلم عن أبي قتادة قال سئل رسول الله صلى الله عليه وسلم عن صيام يوم عرفة فقال أحتسب على الله أن يكفر به السنة الماضية والآتية ويشتمل على يوم النحر الذي هو يوم الحج الأكبر وقد ورد في حديث أنه أفضل الأيام عند الله وبالجملة فهذا العشر قد قيل إنه أفضل أيام السنة كما نطق به الحديث وفضله كثير على عشر رمضان الأخير لأن هذا يشرع فيه ما يشرع في ذلك من صلاة وصيام وصدقة وغيره ويمتاز هذا باختصاصه بأداء فرض الحج فيه وقيل ذاك أفضل لاشتماله على ليلة القدر التي هي خير من ألف شهر وتوسط آخرون فقالوا أيام هذا أفضل وليالي ذاك أفضل وبهذا يجتمع شمل الأدلة والله أعلم \"قول ثان\" في الأيام المعلومات قال الحكم عن مقسم عن ابن عباس الأيام المعلومات يوم النحر وثلاثة أيام بعده ويروى هذا عن ابن عمر وإبراهيم النخعي وإليه ذهب أحمد بن حنبل في رواية عنه \" قول ثالث \" قال ابن أبي حاتم حدثنا أبي حدثنا علي بن المديني حدثنا يحيى بن سعيد حدثنا ابن عجلان حدثني نافع أن ابن عمر كان يقول: الأيام المعلومات المعدودات هن جميعهن أربعة أيام فالأيام المعلومات يوم النحر ويومان بعده والأيام المعدودات ثلاثة أيام بعد يوم النحر هذا إسناد صحيح إليه وقاله السدي وهو مذهب الإمام مالك بن أنس ويعضد هذا القول والذي قبله قوله تعالى \" على ما رزقهم من بهيمة الأنعام \" يعني به ذكر الله عند ذبحها \" قول رابع إنها يوم عرفة ويوم النحر ويوم آخر بعده وهو مذهب أبي حنيفة وقال ابن وهب حدثني ابن زيد بن أسلم عن أبيه أنه قال المعلومات يوم عرفة ويوم النحر وأيام التشريق وقوله \" على ما رزقهم من بهيمة الأنعام \" يعني الإبل والبقر والغنم كما فصلها تعالى في سورة الأنعام \" ثمانية أزواج \" الآية فكلوا منها وأطعموا البائس الفقير \" استدل بهذه الآية من ذهب إلى وجوب الأكل من الأضاحي وهو قول غريب والذي عليه الأكثرون أنه من باب الرخصة أو الاستحباب كما ثبت أن رسول الله صلى الله عليه وسلم لما نحر هديه أمر من كل بدنة ببضعة فتطبخ فأكل من لحمها وحسا من مرقها قال عبد الله بن وهب قال لي مالك أحب أن يأكل من أضحيته لأن الله يقول \" فكلوا منها \" قال ابن وهب وسألت الليث فقال لي مثل ذلك وقال سفيان الثوري عن منصور عن إبراهيم \" فكلوا منها \" قال كان المشركون لا يأكلون من ذبائحهم فرخص للمسلمين فمن شاء أكل ومن لم يشأ لم يأكل وروي عن مجاهد وعطاء نحو ذلك قال هشيم عن حصين عن مجاهد في قوله \" فكلوا منها \" قال هي كقوله \" فإذا حللتم فاصطادوا \" \" فإذا قضيت الصلاة فانتشروا في الأرض \" وهذا اختيار ابن جرير في تفسيره واستدل من نصر القول بأن الآضاحي يتصدق منها بالنصف بقوله في هذه الآية \" فكلوا منها وأطعموا البائس الفقير\" فجزأها نصفين نصف للمضحي ونصف للفقراء والقول الآخر أنها تجزأ ثلاثة أجزاء ثلث له وثلث يهديه وثلث يتصدق به لقوله تعالى في الآية الأخرى \" فكلوا منها وأطعموا القانع والمعتر \" وسيأتي الكلام عليها عندها إن شاء الله وبه الثقة وقوله \" البائس الفقير \" قال عكرمة هو المضطر الذي عليه البؤس وهو الفقير المتعفف وقال مجاهد هو الذي لا يبسط يده وقال قتادة هو الزمن وقال مقاتل بن حيان هو الضرير."
    },
    {
      "ayah": 29,
      "surah": 22,
      "text": "وقوله \" ثم ليقضوا تفثهم \" قال علي بن أبي طلحة عن ابن عباس هو وضع الإحرام من حلق الرأس ولبس الثياب وقص الأظافر ونحو ذلك وهكذا روى عطاء ومجاهد عنه وكذا قال عكرمة ومحمد بن كعب القرظي وقال عكرمة عن ابن عباس \" ثم ليقضوا تفثهم \" قال التفث المناسك وقوله \" وليوفوا نذورهم \" قال علي بن أبي طلحة عن ابن عباس يعني نحر ما نذر من أمر البدن وقال ابن أبي نجيح عن مجاهد \" وليوفوا نذورهم \" نذر الحج والهدي وما نذر الإنسان من شيء يكون في الحج وقال إبراهيم بن ميسرة عن مجاهد \" وليوفوا نذورهم \" قال الذبائح وقال ليث بن أبي سليم عن مجاهد \" وليوفوا نذورهم \" كل نذر إلى أجل وقال عكرمة \" وليوفوا نذورهم \" قال حجهم وكذا روى الإمام أحمد وابن أبي حاتم حدثنا أبي حدثنا ابن أبي عمر حدثنا سفيان في قوله \" وليوفوا نذورهم \" قال نذور الحج فكل من دخل الحج فعليه من العمل فيه الطواف بالبيت وبين الصفا والمروة وعرفة ومزدلفة ورمي الجمار على ما أمروا به وروي عن مالك نحو هذا وقوله \" وليطوفوا بالبيت العتيق \" قال مجاهد يعني الطواف الواجب يوم النحر وقال ابن أبي حاتم حدثنا أبي حدثنا موسى بن إسماعيل حدثنا حماد عن أبي حمزة قال: قال لي ابن عباس أتقرأ سورة الحج يقول الله تعالى \" وليطوفوا بالبيت العتيق \" فإن آخر المناسك الطواف بالبيت العتيق: قلت وهكذا صنع رسول الله صلى الله عليه وسلم فإنه لما رجع إلى منى يوم النحر بدأ برمي الجمرة فرماها بسبع حصيات ثم نحر هديه وحلق رأسه ثم أفاض فطاف بالبيت وفي الصحيحين عن ابن عباس أنه قال أمر الناس أن يكون آخر عهدهم بالبيت الطواف إلا أنه خفف عن المرأة الحائض وقوله \" بالبيت العتيق \" فيه مستدل لمن ذهب إلى أنه يجب الطواف من وراء الحجر لأنه من أصل البيت الذي بناه إبراهيم وإن كانت قريش قد أخرجوه من البيت حين قصرت بهم النفقة ولهذا طاف رسول الله صلى الله عليه وسلم من وراء الحجر وأخبر أن الحجر من البيت ولم يستلم الركنين الشاميين لأنهما لم يتمما على قواعد إبراهيم العتيقة ولهذا قال ابن أبي حاتم حدثنا أبي حدثنا ابن أبي عمر العدني حدثنا سفيان عن هشام بن حجر عن رجل عن ابن عباس قال لما نزلت هذه الآية \" وليطوفوا بالبيت العتيق طاف رسول الله صلى الله عليه وسلم من ورائه وقال قتادة عن الحسن البصري في قوله \" وليطوفوا بالبيت العتيق \" قال لأنه أول بيت وضع للناس وكذا قال عبدالرحمن بن زيد بن أسلم وعن عكرمة أنه قال إنما سمي البيت العتيق لأنه أعتق يوم الغرق زمان نوح وقال خصيف إنما سمي البيت العتيق لأنه لم يظهر عليه جبار قط وقال ابن أبي نجيح وليث عن مجاهد أعتق من الجبابرة أن يسلطوا عليه وكذا قال قتادة وقال حماد بن سلمة عن حميد عن الحسن بن مسلم عن مجاهد لأنه لم يرده أحد بسوء إلا هلك وقال عبد الرزاق عن معمر عن الزهري عن ابن الزبير قال إنما سمي البيت العتيق لأن الله أعتقه من الجبابرة وقال الترمذي حدثنا محمد بن إسماعيل وغير واحد حدثنا عبد الله بن صالح أخبرني الليث عن عبدالرحمن بن خالد عن ابن شهاب عن محمد بن عروة عن عبدالله بن الزبير قال: قال رسول الله صلى الله عليه وسلم:\"إنما سمي البيت العتيق لأنه لم يظهر عليه جبار \" وكذا رواه ابن جرير عن محمد بن سهل المحاربي عن عبد الله بن صالح به وقال إن كان صحيحا وقال الترمذي هذا حديث حسن غريب ثم رواه من وجه آخر عن الزهري مرسلا."
    },
    {
      "ayah": 3,
      "surah": 22,
      "text": "يقول تعالى ذامًا لمن كذب بالبعث وأنكر قدرة الله على إحياء الموتى معرضا عما أنزل الله على أنبيائه متبعا في قوله وإنكاره وكفره كل شيطان مريد من الإنس والجن وهذا حال أهل البدع والضلال المعرضين عن الحق المتبعين للباطل يتركون ما أنزل الله على رسوله من الحق المبين ويتبعون أقوال رءوس الضلالة الدعاة إلى البدع بالأهواء والآراء ولهذا قال في شأنهم وأشباههم \" ومن الناس من يجادل في الله بغير علم \" أي علم صحيح \" ويتبع كل شيطان مريد\"."
    },
    {
      "ayah": 30,
      "surah": 22,
      "text": "يقول تعالى هذا الذي أمرنا به من الطاعات في أداء المناسك وما يلقى عليها من الثواب الجزيل \" ومن يعظم حرمات الله \" أي ومن يجتنب معاصيه ومحارمه ويكون ارتكابها عظيما في نفسه \" فهو خير له عند ربه \" أي فله على ذلك خير كثير وثواب جزيل فكما على فعل الطاعات ثواب كثير وأجر جزيل كذلك على ترك المحرمات واجتناب المحظورات. قال ابن جريج قال مجاهد في قوله \" ذلك ومن يعظم حرمات الله \" قال الحرمة مكة والحج والعمرة وما نهى الله عنه من معاصيه كلها وكذا قال ابن زيد. قوله \" وأحلت لكم الأنعام إلا ما يتلى عليكم \" أي أحللنا لكم جميع الأنعام وما جعل الله من بحيرة ولا سائبة لا وصيلة ولا حام وقوله: \" إلا ما يتلى عليكم \" أي من تحريم الميتة والدم ولحم الخنزير وما أهل لغير الله به والمنخنقة الآية. قال ذلك ابن جرير وحكاه عن قتادة وقوله \" فاجتنبوا الرجس من الأوثان واجتنبوا قول الزور \" من ههنا لبيان الجنس أي اجتنبوا الرجس الذي هو الأوثان وقرن الشرك بالله بقول الزور كقوله \" قل إنما حرم ربي الفواحش ما ظهر منها وما بطن والإثم والبغي بغير الحق وأن تشركوا بالله ما لم ينزل به سلطانا وأن تقولوا على الله ما لا تعلمون \" ومنه شهادة الزور وفي الصحيحين عن أبي بكرة أن رسول الله صلى الله عليه وسلم قال: \" ألا أنبئكم بأكبر الكبائر؟ \" قلنا: بلى يا رسول الله قال \" الإشراك بالله وعقوق الوالدين - وكان متكئا فجلس فقال - ألا وقول الزور ألا وشهادة الزور \" فما زال يكررها حتى قلنا ليته سكت وقال الإمام أحمد حدثنا مروان بن معاوية الفزاري أنبأنا سفيان بن زياد عن فاتك بن فضالة عن أيمن بن خريم قال قام رسول الله صلى الله عليه وسلم خطيبا فقال: \" أيها الناس عدلت شهادة الزور إشراكا بالله ثلاثا ثم قرأ \" فاجتنبوا الرجس من الأوثان واجتنبوا قول الزور \" \" وهكذا رواه الترمذي عن أحمد بن منيع عن مروان بن معاوية به ثم قال غريب إنما نعرفه من حديث سفيان بن زياد وقد اختلف عنه رواية هذا الحديث ولا نعرف لأيمن خريم سماعا من النبي صلى الله عليه وسلم وقال الإمام أحمد أيضا حدثنا محمد بن عبيد حدثنا سفيان العصفري عن أبيه عن حبيب بن النعمان الأسدي عن خريم بن فاتك الأسدي قال: صلى رسول الله صلى الله عليه وسلم الصبح فلما انصرف قام قائما فقال: \" عدلت شهادة الزور الإشراك بالله عز وجل \" ثم تلا هذه الآية:\" فاجتنبوا الرجس من الأوثان واجتنبوا قول الزور\"."
    },
    {
      "ayah": 31,
      "surah": 22,
      "text": "\" حنفاء لله غير مشركين به \" وقال سفيان الثوري عن عاصم بن أبي النجود عن وائل بن ربيعة عن ابن مسعود أنه قال: تعدل شهادة الزور الإشراك بالله ثم قرأ هذه الآية وقوله \" حنفاء لله \" أي مخلصين له الدين منحرفين عن الباطل قصدا إلى الحق ولهذا قال \" غير مشركين به \" ثم ضرب للمشرك مثلا في ضلاله وهلاكه وبعده عن الهدى فقال \" ومن يشرك بالله فكأنما خر من السماء \" أي سقط منها \" فتخطفه الطير \" أي تقطعه الطيور في الهواء \" أو تهوى به الريح في مكان سحيق \" أي بعيد مهلك لمن هوى فيه ولهذا جاء في حديث البراء أن الكافر إذا توفته ملائكة الموت وصعدوا بروحه إلى السماء فلا تفتح له أبواب السماء بل تطرح روحه طرحا من هناك ثم قرأ هذه الآية وقد تقدم الحديث في سورة إبراهيم بحروفه وألفاظه وطرقه وقد ضرب تعالى للمشركين مثلا آخر في سورة الأنعام وهو قوله \" قل أندعوا من دون الله ما لا ينفعنا ولا يضرنا ونرد على أعقابنا بعد إذ هدانا الله كالذي استهوته الشياطين في الأرض حيران له أصحاب يدعونه إلى الهدى ائتنا قل إن هدى الله هو الهدى \" الآية."
    },
    {
      "ayah": 32,
      "surah": 22,
      "text": "يقول تعالى هذا \" ومن يعظم شعائر الله \" أي أوامره \" فإنها من تقوى القلوب \" ومن ذلك تعظيم الهدايا والبدن كما قال الحكم عن مقسم عن ابن عباس تعظيمها استسمانها واستحسانها وقال ابن أبي حاتم حدثنا أبو سعيد الأشج حدثنا حفص بن غياث عن ابن أبي ليلى عن ابن أبي نجيح عن مجاهد عن ابن عباس \" ذلك ومن يعظم شعائر الله \" قال: الاستسمان والاستحسان والاستعظام وقال أبو أمامة عن سهل: كنا نسمن الأضحية بالمدينة وكان المسلمون يسمنون. رواه البخاري. عن أبي هريرة أن رسول الله\" صلى الله عليه وسلم\" قال: \" دم عفراء أحب إلى الله من دم سوداوين \" رواه أحمد وابن ماجه قالوا والعفراء هي البيضاء بياضا ليس بناصع فالبيضاء أفضل من غيرها وغيرها يجزئ أيضا لما ثبت في صحيح البخاري عن أنس أن رسول الله\" صلى الله عليه وسلم\" ضحى بكبشين أملحين أقرنين وعن أبي سعيد أن رسول الله صلى الله عليه وسلم ضحى بكبش أقرن كحيل يأكل في سواد وينظر في سواد ويمشي في سواد رواه أهل السنن وصححه الترمذي - أي فيه نكتة سوداء في هذه الأماكن وفي سنن ابن ماجه عن أبي رافع أن رسول الله صلى الله عليه وسلم ضحى بكبشين عظيمين سمينين أقرنين أملحين موجوءين وكذا روى أبو داود وابن ماجه عن جابر ضحى رسول الله صلى الله عليه وسلم بكبشين أقرنين أملحين موجوءين: قيل هما الخصيان وقيل اللذان رض خصياهما ولم يقطعهما والله أعلم وعن علي رضي الله عنه قال أمرنا رسول الله صلى الله عليه وسلم أن نستشرف العين والأذن وأن لا نضحي بمقابلة ولا مدابرة ولا شرقاء ولا خرقاء. ورواه أحمد وأهل السنن وصححه الترمذي ولهم عنه قال نهى رسول الله صلى الله عليه وسلم أن نضحي بأعضب القرن والأذن قال سعيد بن المسيب: العضب النصف فأكثر وقال بعض أهل اللغة: إن كسر قرنها الأعلى فهي قصماء فأما العضب فهو كسر الأسفل وعضب الأذن قطع بعضها وعند الشافعي أن الأضحية بذلك مجزئه لكن تكره وقال أحمد لا تجزئ الأضحية بأعضب القرن والأذن لهذا الحديث وقال مالك: إن كان الدم يسيل من القرن لم يجزئ وإلا أجزأ والله أعلم وأما المقابلة فهي التي قطع مقدم أذنها والمدابرة من مؤخر أذنها والشرقاء هي التي قطعت أذنها طولا قاله الشافعي والأصمعي وأما الخرقاء فهي التي خرقت السمة أذنها خرقا مدورا والله أعلم. وعن البراء قال قال رسول الله صلى الله عليه وسلم \" أربع لا تجوز في الأضاحي العوراء البين عورها والمريضة البين مرضها والعرجاء البين ضلعها والكسيرة التي لا تنقى \" رواه أحمد وأهل السنن وصححه الترمذي وهذه العيوب تنقص اللحم لضعفها وعجزها عن استكمال الرعي لأن الشاء يسبقونها إلى المرعى فلهذا لا تجزئ التضحية بها عند الشافعي وغيره من الأئمة كما هو ظاهر الحديث واختلف قول الشـافعى في المريضة مرضا يسيرا على قولين وروى أبو داود عن عتبة بن عبد السلمي أن رسول الله صلى الله عليه وسلم نهى عن المصفرة والمستأصلة والبخقاء والمشيعة والكسيرة فالمصفرة قبل الهزيلة وقيل المستأصلة الأذن والمستأصلة مكسورة القرن والبخقاء هي العوراء والمشيعة هي التي لا تزال تشيع خلف الغنم ولا تتبع لضعفها والكسيرة العرجاء فهذه العيوب كلها مانعة من الإجزاء فإن طرأ العيب بعد تعيين الأضحية فإنه لا يضر عند الشافعي خلافا لأبي حنيفة وقد روى الإمام أحمد عن أبي سعيد قال: اشتريت كبشا أضحي به فعدا الذئب فأخذ الآية فسألت النبي صلى الله عليه وسلم فقال: \" ضح به \" ولهذا جاء في الحديث أمرنا رسول الله صلى الله عليه وسلم أن نستشرف العين والأذن أي أن تكون الهدية والأضحية سمينة حسنة كما رواه الإمام أحمد وأبو داود عن عبدالله بن عمر قال أهدى عمر نجيبا فأعطي بها ثلثمائة دينار فأتى النبي صلى الله عليه وسلم فقال يا رسول الله إني أهديت نجييا فأعطيت بها ثلثمائة دينار أفأبيعها وأشتري بثمنها بدنا قال لا \" انحرها إياها \" وقال الضحاك عن ابن عباس البدن من شعائر الله وقال محمد بن أبي موسى الوقوف ومزدلفة والجمار والرمي والحلق والبدن من شعائر الله وقال ابن عمر أعظم الشعائر البيت."
    },
    {
      "ayah": 33,
      "surah": 22,
      "text": "\" لكم فيها منافع \" أي لكم في البدن منافع من لبنها وصوفها وأوبارها وأشعارها وركوبها إلى أجل مسمى قال مقسم عن ابن عباس في قوله \" لكم فيها منافع إلى أجل مسمى \" قال ما لم تسم بدنا وقال مجاهد في قوله \" لكم فيها منافع إلى أجل مسمى \" قال الركوب واللبن والولد فإذا سميت بدنة أو هديا ذهب ذلك كله وكذا قال عطاء والضحاك وقتادة وعطاء الخراساني وغيرهم وقال آخرون بل له أن ينتفع بها وإن كانت هدي إذا احتاج إلى ذلك كما ثبت في الصحيحين عن أنس أن رسول الله صلى الله عليه وسلم رأى رجلا يسوق بدنة قال \" اركبها \" قال إنها بدنة قال \" اركبها ويحك \" في الثانية أو الثالثة وفي رواية لمسلم عن جابر عن رسول الله صلى الله عليه وسلم أنه قال \" اركبها بالمعروف إذا ألجئت إليها \" وقال شعبة عن زهير عن أبي ثابت الأعمى عن المغيرة بن أبي الحر عن علي أنه رأى رجلا يسوق بدنة ومعها ولدها فقال لا تشرب من لبنها إلا ما فضل عن ولدها فإذا كان يوم النحر فاذبحها وولدها وقوله \" ثم محلها إلى البيت العتيق \" أي محل الهدي وانتهاه إلى البيت العتيق وهو الكعبة كما قال تعالى \" هديا بالغ الكعبة \" وقال \" والهدي معكوفا أن يبلغ محله \" وقد تقدم الكلام على معنى البيت العتيق قريبا ولله الحمد وقال ابن جريج عن عطاء قال: كان ابن عباس يقول كل من طاف بالبيت فقد حل قال الله تعالى \" ثم محلها إلى البيت العتيق \"."
    },
    {
      "ayah": 34,
      "surah": 22,
      "text": "يخبر تعالى أنه لم يزل ذبح المناسك وإراقة الدماء على اسم الله مشروعا في جميع الملل وقال علي بن أبي طلحة عن ابن عباس \" ولكل أمة جعلنا منسكا \" قال عيدا وقال عكرمة ذبحا وقال زيد بن أسلم في قوله \" ولكل أمة جعلنا منسكا \" إنها مكة لم يجعل الله لأمة قط منسكا غيرها وقوله \" ليذكروا اسم الله على ما رزقهم من بهيمة الأنعام \" كما ثبت في الصحيحين عن أنس قال أتى رسول الله صلى الله عليه وسلم بكبشين أملحين أقرنين فسمى وكبر ووضع رجله على صفاحهما قال الإمام أحمد بن حنبل حدثنا يزيد بن هارون أنبأنا سلام بن مسكين عن عائذ الله المجاشعي عن أبي داود - وهو نفيع بن الحارث - عن زيد بن أرقم قال قلت أو قالوا يا رسول الله ما هذه الأضاحي؟ قال \" سنة أبيكم إبراهيم \" قالوا ما لنا منها؟ قال: \" بكل شعرة حسنة \" قال فالصوف ؟ قال \" بكل شعرة من الصوف حسنة \" وأخرجه الإمام أبو عبد الله محمد بن يزيد ابن ماجه في سننه من حديث سلام بن مسكين به وقوله \" فإلهكم إله واحد فله أسلموا \" أي معبودكم واحد وإن تنوعت شرائع الأنبياء ونسخ بعضها بعض فالجميع يدعون إلى عبادة الله وحده لا شريك له \" وما أرسلنا من قبلك من رسول إلا نوحي إليه أنه لا إله إلا أنا فاعبدون \" ولهذا قال \" فله أسلموا \" أي أخلصوا واستسلموا لحكمه وطاعته \" وبشر المخبتين \" قال مجاهد المطمئنين وقال الضحاك وقتادة المتواضعين وقال السدي الوجلين وقال عمرو بن أوس: المخبتين الذين لا يظلمون وإذا ظلموا لم ينتصروا وقال الثوري \" وبشر المخبتين \" قال المطمئنين الراضين بقضاء الله المستسلمين له وأحسن بما يفسر بما بعده."
    },
    {
      "ayah": 35,
      "surah": 22,
      "text": "هو قوله \" الذين إذا ذكر الله وجلت قلوبهم \" أي خافت منه قلوبهم \" والصابرين على ما أصابهم \" أي من المصائب قال الحسن البصري والله لنصبرن أو لنهلكن \" والمقيمي الصلاة \" قرأ الجمهور بالإضافة السبعة وبقية العشرة أيضا وقرأ ابن السميفع \" والمقيمين الصلاة \" بالنصب وعن الحسن البصري \" والمقيمي الصلاة \" وإنما حذف النون ههنا تخفيفا ولو حذفت للإضافة لوجب خفض الصلاة ولكن على سبيل التخفيف فنصبت أي المؤدين حق الله فما أوجب عليهم من أداء فرائضه \" ومما رزقناهم ينفقون \" أي وينفقون ما آتاهم الله من طيب الرزق على أهليهم وأقاربهم وفقرائهم ومحاويجهم ويحسنون إلى الخلق مع محافظتهم على حدود الله وهذه بخلاف صفات المنافقين فإنهم بالعكس من هذا كله كما تقدم تفسيره في سورة براءة."
    },
    {
      "ayah": 36,
      "surah": 22,
      "text": "يقول تعالى ممتنا على عبيده فيما خلق لهم من البدن وجعلها من شعائره وهو أنه جعلها تهدي إلى بيته الحرام بل هي أفضل ما يهدى إليه كما قال تعالى \" لا تحلوا شعائر الله ولا الشهر الحرام ولا الهدي ولا القلائد ولا آمين البيت الحرام \" الآية قال ابن جريج قال عطاء في قوله \" والبدن جعلناها لكم من شعائر الله \" قال البقرة والبعير وكذا روي عن ابن عمر وسعيد بن المسيب والحسن البصري وقال مجاهد إنما البدن من الإبل. قلت أث إطلاق البدنة على البعير فمتفق عليه واختلفوا في صحة إطلاق البدنة على البقرة على قولين أصحهما أنه يطلق عليها ذلك شرعا كما صح الحديث ثم جمهور العلماء على أنه تجزئ البدنة عن سبعة والبقرة عن سبعة كما ثبت به الحديث عند مسلم من رواية جابر بن عبد الله قال أمرنا رسول الله صلى الله عليه وسلم أن نشترك في الأضاحي البدنة عن سبعة والبقرة عن سبعة وقال إسحاق بن راهوية وغيره بل تجزئ البقرة والبعير عن عشرة وقد ورد به حديث في مسند الإمام أحمد وسنن النسائي وغيرهما فالله أعلم. وقوله \" لكم فيها خير \" أي ثواب في الدار الآخرة وعن سليمان بن يزيد الكعبي عن هشام بن عروة عن أبيه عن عائشة أن رسول الله صلى الله عليه وسلم قال: \" ما عمل ابن آدم يوم النحر عمل أحب إلى الله من إهراق دم وإنها لتأتي يوم القيامة بقرونها وأظلافها وأشعارها وإن الدم ليقع من الله بمكان قبل أن يقع من الأرض فطيبوا بها نفسا \" رواه ابن ماجه والترمذي وحسنه وقال سفيان الثوري كان أبو حازم يستدين ويسوق البدن فقيل له تستدين وتسوق البدن ؟ فقال إني سمعت الله يقول \" لكم فيها خير \" وعن ابن عباس قال قال رسول الله صلى الله عليه وسلم:\" ما أنفقت الورق في شيء أفضل من نحيرةٍ في يوم عيد \" رواه الدارقطني في سننه وقال مجاهد \" لكم فيها خير \" قال أجر ومنافع وقال إبراهيم النخعي يركبها ويحلبها إذا احتاج إليها. وقوله \" فاذكروا اسم الله عليها صواف \" وعن المطلب بن عبدالله بن حنطب عن جابر بن عبدالله قال صليت مع رسول الله صلى الله عليه وسلم عيد الأضحى فلما انصرف أتي بكبش فذبحه فقال: \" بسم الله والله أكبر اللهم هذا عني وعمن لم يضح من أمتي \" رواه أحمد وأبو داود والترمذي وقال محمد بن إسحاق عن يزيد بن أبي حبيب عن ابن عباس عن جابر قال ضحى رسول الله صلى الله عليه وسلم بكبشين في يوم عيد فقال حين وجههما \" وجهت وجهي للذي فطر السموات والأرض حنيفا وما أنا من المشركين إن صلاتي ونسكي ومحياي ومماتي لله رب العالمين لا شريك له وبذلك أمرت وأنا أول المسلمين اللهم منك ولك عن محمد وأمته \" ثم سمى الله وكبر وذبح \" وعن علي بن الحسين عن أبي رافع أن رسول الله صلى الله عليه وسلم كان إذا ضحى اشترى كبشين سمينين أقرنين أملحين فإذا صلى وخطب الناس أتي بأحدهما وهو قائم في مصلاه فذبحه بنفسه بالمدية ثم يقول: \" اللهم هذا عن أمتي جميعها من شهد لك بالتوحيد وشهد لي بالبلاغ \" ثم يؤتي بالآخر فيذبحه بنفسه ثم يقول \" هذا عن محمد وآل محمد \" فيطعمها جميعا للمسلمين ويأكل هو وأهله منهما رواه أحمد وابن ماجه. وقال الأعمش عن أبي ظبيان عن ابن عباس في قوله \" فاذكروا اسم الله عليها صواف \" قال قيام على ثلاث قوائم معقولة يدها اليسرى يقول بسم الله والله أكبر لا إله إلا الله اللهم منك ولك: وكذلك روي عن مجاهد وعلي بن أبي طلحة والعوفي عن ابن عباس نحو هذا. وقال ليث عن مجاهد إذا عقلت رجلها اليسرى قامت على ثلاث وروى ابن أبي نجيح عنه نحوه وقال الضحاك يعقل رجلا فتكون على ثلاث. وفي الصحيحين عن ابن عمر أنه أتى على رجل قد أناخ بدنة وهو ينحرها فقال ابعثها قياما مقيدة سنة أبي القاسم وعن جابر أن رسول الله صلى الله عليه وسلم وأصحابه كانوا ينحرون البدن معقولة اليسرى قائمة على ما بقي من قوائمها رواه أبو داود وقال ابن لهيعة حدثني عطاء بن دينار أن سالم بن عبد الله قال لسليمان بن عبد الملك قف من شقها الأيمن وانحر من شقها الأيسر وفي صحيح مسلم عن جابر في صفة حجة الوداع قال فيه فنحر رسول الله صلى الله عليه وسلم بيده ثلاثا وستين بدنة جعل يطعنها بحربة في يده وقال عبد الرزاق أخبرنا معمر عن قتادة قال في حرف ابن مسعود \" صوافن\" أي معقلة قياما وقال سفيان الثوري عن منصور عن مجاهد من قرأها صوافن قال معقولة ومن قرأها صواف قال تصف بين يديها وقال طاوس والحسن وغيرهما \" فاذكروا اسم الله عليها صوافي \"يعني خالصة لله عز وجل وكذا رواه مالك عن الزهري وقال عبدالرحمن بن زيد صوافي ليس فيها شرك كشرك الجاهلية لأصنامهم وقوله \" فإذا وجبت جنوبها \" قال ابن أبي نجيح عن مجاهد يعني سقطت إلى الأرض وهو رواية عن ابن عباس وكذا قال مقاتل بن حيان وقال العوفي عن ابن عباس فإذا وجبت جنوبها يعني نحرت وقال عبد الرحمن بن زيد بن أسلم فإذا وجبت جنوبها يعني ماتت وهذا القول هو مراد ابن عباس ومجاهد فإنه لا يجوز الأكل من البدنة إذا نحرت حتى تموت وتبرد حركتها وقد جاء في حديث مرفوع \" لا تعجلوا النفوس أن تزهق \" وقد رواه الثوري في جامعه عن أيوب عن يحيى بن أبي كثير قرافصة الحنفي عن عمر بن الخطاب أنه قال ذلك ويؤيده حديث شداد بن أوس في صحيح مسلم \" إن الله كتب الإحسان على كل شيء فإذا قتلتم فأحسنوا القتلة وإذا ذبحتم فأحسنوا الذبحة وليحد أحدكم شفرته وليرح ذبيحته \" وعن أبي واقد الليثي قال: قال رسول الله صلى الله عليه وسلم \" ما قطع من البهيمة وهي حية فهو ميتة \" رواه أحمد وأبو داود والترمذي وصححه وقوله \" فكلوا منها وأطعموا القانع والمعتر \" قال بعض السلف قوله: \" فكلوا منها \" أمر إباحة وقال مالك يستحب ذلك وقال غيره يجب وهو وجه لبعض الشافعية واختلفوا في المراد بالقانع والمعتر فقال العوفي عن ابن عباس القانع المستغني بما أعطيته وهو في بيته والمعتر الذي يتعرض لك ويلم بك أن تعطيه من اللحم ولا يسأل وكذا قال مجاهد ومحمد بن كعب القرظي وقال علي بن أبي طلحة عن ابن عباس القانع المتعفف والمعتر السائل وهذا قول قتادة وإبراهيم النخعي ومجاهد في رواية عنه وقال ابن عباس وعكرمة وزيد بن أسلم والكلبي والحسن البصري ومقاتل بن حيان ومالك بن أنس القانع هو الذي يقنع إليك ويسألك والمعتر الذي يعتريك يتضرع ولا يسألك وهذا لفظ الحسن وقال سعيد بن جبير القانع هو السائل قال أما سمعت قول الشماخ: لمال المرء يصلحه فيغني مفاقره أعف من القنوع قال يغني من السؤال وبه قال ابن زيد وقال يد بن أسلم القانع المسكين الذي يطوف والمعتر الصديق والضعيف الذي يزور وهو رواية عن ابنه عبدالرحمن بن زيد أيضا وعن مجاهد أيضا القانع جارك الغني الذي يبصر ما يدخل بيتك والمعتر الذي يعتزل من الناس وعنه أن القانع هو الطامع والمعتر هو الذي يعتر بالبدن من غني أو فقير وعكرمة نحوه وعنه القانع أهل مكة واختار ابن جرير أن القانع هو السائل لأنه من أقنع بيده إذا رفعها للسؤال والمعتر من الاعتراء وهو الذي يتعرض لأكل اللحم وقد احتج بهذه الآية الكريمة من ذهب من العلماء إلى أن الأضحية تجزأ ثلاثة أجزاء فثلث لصاحبها يأكله وثلث يهديه لأصحابه وثلث يتصدق به على الفقراء لأنه تعالى قال \" فكلوا منها وأطعموا القانع والمعتر \" وفي الحديث الصحيح أن رسول الله صلى الله عليه وسلم قال للناس \" إني كنت نهيتكم عن ادخار لحوم الأضاحي فوق ثلاث فكلوا وادخروا ما بدا لكم \" وفي رواية \" فكلوا وادخروا وتصدقوا \" وفي رواية \" فكلوا وأطعموا وتصدقوا \" والقول الثاني: أن المضحي يأكل النصف ويتصدق بالنصف لقوله في الآية المتقدمة \" فكلوا منها وأطعموا البائس الفقير \" ولقوله في الحديث \" فكلوا وادخروا وتصدقوا \" فإن أكل الكل فقيل لا يضمن شيئا وبه قال ابن سريج من الشافعية وقال بعضهم يضمنها كلها بمثلها أو قيمتها وقيل يضمن نصفها وقيل ثلثها وقيل أدنى جزء منها وهو المشهور من مذهب الشافعي وأما الجلود ففي مسند أحمد عن قتادة ابن النعمان في حديث الأضاحي \" فكلوا وتصدقوا واستمتعوا بجلودها ولا تبيعوها \" ومن العلماء من رخص في بيعها ومنهم من قال يقاسم الفقراء فيها والله أعلم \" مسألة\" عن البراء بن عازب قال قال رسول الله صلى الله عليه وسلم \" إن أول ما نبدأ به في يومنا هذا أن نصلي ثم نرجع فننحر فمن فعل فقد أصاب سنتنا ومن ذبح قبل الصلاة فإنما هو لحم قدمه لأهله ليس من النسك في شيء \" أخرجاه فلهذا قال الشافعي وجماعة من العلماء إن أول وقت ذبح الأضاحي إذا طلعت الشمس يوم النحر ومضى قدر صلاة العيد والخطبتين زاد أحمد وأن يذبح الإمام بعد ذلك لما جاء في صحيح مسلم وأن لا تذبحوا حتى يذبح الإمام ; وقال أبو حنيفة أما أهل السواد من القرى ونحوها فلهم أن يذبحوا بعد طلوع الفجر إذ لا صلاة عيد تشرع عنده لهم وأما أهل الأمصار فلا يذبحوا حتى يصلي الإمام والله أعلم. ثم قيل لا يشرع الذبح إلا يوم النحر وحده وفي يوم النحر لأهل الأمصار لتيسر الأضاحي عندهم وأما أهل القرى فيوم النحر وأيام التشريق بعده وبه قال سعيد بن جبير وقيل يوم النحر ويوم بعده للجميع وقيل ويومان بعده وبه قال الإمام أحمد وقيل يوم النحر وثلاثة أيام التشريق بعده وبه قال الشافعي لحديث جبير بن مطعم أن رسول الله صلى الله عليه وسلم قال \" أيام التشريق كلها ذبح \" رواه أحمد وابن حبان وقيل إن وقت الذبح يمتد إلى آخر ذي الحجة وبه قال إبراهيم النخعي وأبو سلمة بن عبد الرحمن وهو قول غريب وقوله \" كذلك سخرناها لكم لعلكم تشكرون \" يقول تعالى من أجل هذا \" سخرناها لكم \" أي ذللناها لكم وجعلناها منقادة لكم خاضعة إن شئتم ركبتم وإن شئتم حلبتم وإن شئتم ذبحتم كما قال تعالى \" أو لم يروا أنا خلقنا لهم مما عملت أيدينا أنعاما فهم لها مالكون\"- إلى قوله-\"فلا يشكرون \" وقال في هذه الآية الكريمة \" كذلك سخرناها لكم لعلكم تشكرون \"."
    },
    {
      "ayah": 37,
      "surah": 22,
      "text": "يقول تعالى إنما شرع لكم نحر هذه الهدايا الضحايا لتذكروه عند ذبحها فإنه الخالق الرازق لا يناله شيء من لحومها ولا دمائها فإنه تعالى هو الغني عما سواه وقد كانوا في جاهليتهم إذا ذبحوها لآلهتهم وضعوا عليها من لحوم قرابينهم ونضحوا عليها من دمائها فقال تعالى \" لن ينال الله لحومها ولا دماؤها \" وقال ابن أبي حاتم حدثنا علي ابن الحسين حدثنا محمد بن أبي حماد حدثنا إبراهيم بن المختار عن ابن جريج قال كان أهل الجاهلية ينضحون البيت بلحوم الإبل ودمائها فقال أصحاب رسول الله صلى الله عليه وسلم فنحن أحق أن ننضح فأنزل الله \" لن ينال الله لحومها ولا دماؤها ولكن يناله التقوى منكم \" أي يتقبل ذلك ويجزي عليه كما جاء في الصحيح \" إن الله لا ينظر إلى صوركم ولا إلى أموالكم ولكن ينظر إلى قلوبكم وأعمالكم \" وجاء في الحديث \" إن الصدقة تقع في يد الرحمن قبل أن تقع في يد السائل إن الدم ليقع من الله بمكان قبل أن يقع إلى الأرض \" كما تقدم في الحديث رواه ابن ماجه والترمذي وحسنه عن عائشة مرفوعا فمعناه أنه سيق لتحقيق القبول من الله لمن أخلص في عمله وليس له معنى يتبادر عند العلماء المحققين سوى هذا والله أعلم وقال وكيع عن يحيى بن مسلم بن الضحاك سألت عامرا الشعبي عن جلود الأضاحي فقال \" لن ينال الله لحومها ولا دماؤها \" إن شئت فبع وإن شئت فأمسك وإن شئت فتصدق وقوله \" كذلك سخرها لكم \" أي من أجل ذلك سخر لكم البدن \" لتكبروا الله على ما هداكم \" أي لتعظموه كما هداكم لدينه وشرعه وما يحبه ويرضاه ونهاكم عن فعل ما يكرهه ويأباه وقوله \" وبشر المحسنين \" أي وبشر يا محمد المحسنين أي في عملهم القائمين بحدود الله المتبعين ما شرع له المصدقين الرسول فيما أبلغهم وجاءهم به من عند ربه عز وجل \" مسألة\" وقد ذهب أبو حنيفة ومالك والثوري إلى القول بوجوب الأضحية على من ملك نصابا وزاد أبو حنيفة اشتراط الإقامة أيضا واحتج لهم بما رواه أحمد وابن ماجه بإسناد رجاله كله ثقات عن أبي هريرة مرفوعا \" من وجد سعة فلم يضح فلا يقربن مصلانا \" على أن فيه غرابة واستنكره أحمد بن حنبل وقال ابن عمر: أقام رسول الله صلى الله عليه وسلم عشر سنين يضحي رواه الترمذي وقال الشافعي وأحمد لا تجب الأضحية بل هى مستحبة لما جاء في الحديث \" ليس في المال حق سوى الزكاة \" وقد تقدم أنه عليه الصلاة والسلام ضحى عن أمته فأسقط ذلك وجوبها عنهم وقال أبو سريحة كنت جارا لأبي بكر وعمر فكانا لا يضحيان خشية أن يقتدي الناس بهما وقال بعض الناس الأضحية سنة كفاية إذا قام بها واحد من أهل دار أو محلة أو بيت سقطت عن الباقين لأن المقصود إظهار الشعار: وقد روى الإمام أحمد وأهل السنن وحسنه الترمذي عن محنف بن سليم أنه سمع رسول الله صلى الله عليه وسلم يقول بعرفات \" على كل أهل بيت في كل عام أضحاية وعتيرة هل تدرون ما العتيرة ؟ هي التي تدعونها الرجبية \" وقد تكلم في إسناده وقال أبو أيوب كان الرجل في عهد رسول الله صلى الله عليه وسلم يضحي بالشاة الواحدة عنه وعن أهل بيته فيأكلون ويطعمون حتى تباهى الناس فصار كما ترى رواه الترمذي وصححه وابن ماجه وكان عبدالله بن هشام يضحي بالشاة الواحدة عن جميع أهله رواه البخاري وأما مقدار سن الأضحية فقد روى مسلم عن جابر أن رسول الله صلى الله عليه وسلم قال \" لا تذبحوا إلا مسنة إلا أن تعسر عليكم فتذبحوا جذعة من الضأن \" ومن ههنا ذهب الزهري إلى أن الجذع لا يجزئ وقابله الأوزاعي فذهب إلى أن الجذع يجزئ من كل جنس وهما غريبان والذي عليه الجمهور إنما يجزئ الثني من الإبل والبقر والمعز أو الجذع من الضأن فأما الثني من الإبل فهو الذي له خمس سنين ودخل في السادسة ومن البقر ما له سنتان ودخل في الثالثة وقيل ما له ثلاث ودخل في الرابعة ومن المعز ما له سنتان وأما الجذع من الضأن فقيل ما له سنة وقيل عشرة أشهر وقيل ثمانية وقيل ستة أشهر وهو أقل ما قيل في سنه وما دونه فهو حمل والفرق بينهما أن الحمل شعر ظهره قائم والجذع شعر ظهره نائم قد انفرق صدغين والله أعلم."
    },
    {
      "ayah": 38,
      "surah": 22,
      "text": "يخبر تعالى أنه يدفع عن عباده الذين توكلوا عليه وأنابوا إليه شر الأشرار وكيد الفجار ويحفظهم ويكلؤهم وينصرهم كما قال تعالى \" أليس الله بكاف عبده \" وقال \" ومن يتوكل على الله فهو حسبه إن الله بالغ أمره قد جعل الله لكل شيء قدرا \" وقوله \" إن الله لا يحب كل خوان كفور \" أي لا يحب من عباده من اتصف بهذا وهو الخيانة في العهود والمواثيق لا يفي بما قال والكفر الجحد للنعم فلا يعترف بها."
    },
    {
      "ayah": 39,
      "surah": 22,
      "text": "قال العوفي عن ابن عباس نزلت في محمد وأصحابه حين أخرجوا من مكة وقال مجاهد والضحاك وغير واحد من السلف كابن عباس وعروة بن الزبير وزيد بن أسلم ومقاتل بن حيان وقتادة وغيرهم هذه أول آية نزلت في الجهاد واستدل بهذه الآية بعضهم على أن السورة مدنية وقال ابن جرير حدثني يحيى بن داود الواسطي حدثنا إسحاق بن يوسف عن سفيان عن الأعمش عن مسلم هو البطين عن سعيد بن جبير عن ابن عباس قال: لما أخرج النبي صلى الله عليه وسلم من مكة قال أبو بكر: أخرجوا نبيهم إنا لله وإنا إليه راجعون ليهلكن قال ابن عباس فأنزل الله عز وجل \" أذن للذين يقاتلون بأنهم ظلموا وإن الله على نصرهم لقدير \" قال أبو بكر رضي الله تعالى عنه فعرفت أنه سيكون قتال. ورواه الإمام أحمد عن إسحاق بن يوسف الأزرق به وزاد قال ابن عباس وهي أول آية نزلت في القتال رواه الترمذي والنسائي في التفسير من سننيها وابن أبي حاتم من حديث إسحاق بن يوسف زاد الترمذي ووكيع كلاهما عن سفيان الثوري به وقال الترمذي حديث حسن وقد رواه غير واحد عن الثوري وليس فيه ابن عباس وقوله \" وإن الله على نصرهم لقدير \" أي هو قادر على نصر عباده المؤمنين من غير قتال ولكن هو يريد من عباده أن يبذلوا جهدهم في طاعته كما قال \" فإذا لقيتم الذين كفروا فضرب الرقاب حتى إذا أثخنتموهم فشدوا الوثاق فإما منا بعد وإما فداء حتى تضع الحرب أوزارها ذلك ولو يشاء الله لانتصر منهم ولكن ليبلو بعضكم ببعض والذين قتلوا في سبيل الله فلن يضل أعمالهم سيهديهم ويصلح بالهم ويدخلهم الجنة عرفها لهم \" وقال تعالى \" قاتلوهم يعذبهم الله بأيديكم ويخزهم وينصركم عليهم ويشف صدور قوم مؤمنين ويذهب غيظ قلوبهم ويتوب الله على من يشاء والله عليم حكيم \" وقال \" أم حسبتم أن تتركوا ولما يعلم الله الذين جاهدوا منكم ولم يتخذوا من دون الله ولا رسوله ولا المؤمنين وليجة والله خبير بما تعملون \" وقال \" أم حسبتم أن تدخلوا الجنة ولما يعلم الله الذين جاهدوا منكم ويعلم الصابرين \" وقال \" ولنبلونكم حتى نعلم المجاهدين منكم والصابرين ونبلو أخباركم \" والآيات في هذا كثيرة ولهذا قال ابن عباس في قوله \" وإن الله على نصرهم لقدير \" وقد فعل وإنما شرع تعالى الجهاد في الوقت الأليق به لأنهم لما كانوا بمكة كان المشركون أكثر عددا فلو أمر المسلمون وهم أقل من العشر بقتال الباقين لشق عليهم ولهذا لما بايع أهل يثرب ليلة العقبة رسول الله صلى الله عليه وسلم وكانوا نيفا وثمانين قالوا: يا رسول الله ألا نميل على أهل الوادي يعنون أهل ليالي مني فنقتلهم؟ فقال رسول الله صلى الله عليه وسلم \" إني لم أؤمر بهذا \" فلما بغى المشركون وأخرجوا النبي صلى الله عليه وسلم بين أظهرهم وهموا بقتله وشردوا أصحابه شذر مذر فذهب منهم طائفة إلى الحبشة وآخرون إلى المدينة فلما استقروا بالمدينة وافاهم رسول الله صلى الله عليه وسلم واجتمعوا عليه وقاموا بنصره وصارت لهم دار إسلام ومعقلا يلجئون إليه شرع الله جهاد الأعداء فكانت هذه الآية أول ما نزل في ذلك فقال تعالى \" أذن للذين يقاتلون بأنهم ظلموا وإن الله على نصرهم لقدير \"."
    },
    {
      "ayah": 4,
      "surah": 22,
      "text": "\" كتب عليه \" قال مجاهد يعني الشيطان كتب عليه كتابة قدرية \" أنه من تولاه \" أي اتبعه وقلده \" فأنه يضله ويهديه إلى عذاب السعير \" أي يضله في الدنيا ويقوده في الآخرة إلى عذاب السعير وهو الحار المؤلم المقلق المزعج وقد قال السدي عن أبي مالك نزلت هذه الآية في النضر بن الحارث وكذلك قال ابن جريج. وقال ابن أبي حاتم حدثنا عمرو بن مسلم البصري حدثنا عمرو بن البختري أبو قتادة حدثنا المعتمر حدثنا أبو كعب المكي قال: قال خبيث من خبثاء قريش أخبرنا عن ربكم من ذهب هو أو من فضة هو أو من نحاس هو؟ فتقعقعت السماء قعقعة - والقعقعة في كلام العرب: الرعد - فإذا قحف رأسه ساقط بين يديه وقال لي ابن أبي سليم عن مجاهد: جاء يهودي فقال يا محمد أخبرنا عن ربك من أي شيء هو من در أم من ياقوت ؟ قال فجاءت صاعقة فأخذته."
    },
    {
      "ayah": 40,
      "surah": 22,
      "text": "\"الذين أخرجوا من ديارهم بغير حق \" قال العوفي عن ابن عباس أخرجوا من مكة إلى المدينة بغير حق يعني محمدا وأصحابه \" إلا أن يقولون ربنا الله \" أي ما كان لهم إلى قومهم إساءة ولا كان لهم ذنب إلا أنهم وحدوا الله وعبدوه لا شريك له وهذا استثناء منقطع بالنسبة إلى ما في نفس الأمر وأما عند المشركين فإنه أكبر الذنوب كما قال تعالى \" يخرجون الرسول وإياكم أن تؤمنوا بالله ربكم \" وقال تعالى في قصة أصحاب الأخدود \" وما نقموا منهم إلا أن يؤمنوا بالله العزيز الحميد \" ولهذا لما كان المسلمون يرتجزون في بناء الخندق ويقولون: لاهم لولا أنت ما اهتدينا ولا تصـدقنا ولا صليـنا فأنزلـن سـكيـنـة عليــنـــا وثبت الأقدام إن لاقينا إن الألى قد بـــغـوا عـلينا إذا أرادوا فتــنة أبينا فيوافقهم رسول الله صلى الله عليه وسلم ويقوم معهم آخر كل قافية فإذا قالوا إذا أرادوا فتنة أبينا يقول \" أبينا \" يمد بها صوته ثم قال تعالى \" ولولا دفع الله الناس بعضهم ببعض\" أي لولا أنه يدفع بقوم عن قوم ويكف شرور أناس عن غيرهم بما يخلقه ويقدره من الأسباب لفسدت الأرض ولأهلك القوي الضعيف \" لهدمت صوامع \" وهي المعابد الصغار للرهبان قاله ابن عباس ومجاهد وأبو العالية وعكرمة والضحاك وغيرهم وقال قتادة هي معابد الصابئين وفي رواية عنه صوامع المجوس وقال مقاتل بن حيان هي البيوت التي على الطرق \" وبيع \" وهي أوسع منها وأكثر عابدين فيها وهي للنصارى أيضا قاله أبو العالية وقتادة والضحاك وابن صخر ومقاتل بن حيان وخصيف وغيرهم وحكى ابن جبير عن مجاهد وغيره أنها كنائس اليهود وحكى السدي عمن حدثه عن ابن عباس أنها كنائس اليهود ومجاهد إنما قال هي الكنائس والله أعلم وقوله \" وصلوات \" قال العوفي عن ابن عباس الصلوات الكنائس وكذا قال عكرمة والضحاك وقتادة: إنها كنائس اليهود وهم يسمونها صلوات وحكى السدي عمن حدثه عن ابن عباس أنها كنائس النصارى وقال أبو العالية وغيره الصلوات معابد الصابئين وقال ابن أبي نجيح عن مجاهد الصلوات مساجد لأهل الكتاب ولأهل الإسلام بالطرق وأما المساجد فهي للمسلمين وقوله \" يذكر فيها اسم الله كثيرا \" فقد قيل الضمير في قوله يذكر فيها عائد إلى المساجد لأنها أقرب المذكورات وقال الضحاك الجميع يذكر فيها اسم الله كثيرا وقال ابن جرير الصواب لهدمت صوامع الرهبان وبيع النصارى وصلوات اليهود وهي كنائسهم ومساجد المسلمين التي يذكر فيها اسم الله كثيرا لأن هذا هو المستعمل المعروف في كلام العرب وقال بعض العلماء هذا ترقٍ من الأقل إلى الأكثر إلى أن انتهى إلى المساجد وهي أكثر عمارا وأكثر عبادا وهم ذوو القصد الصحيح وقوله \" ولينصرن الله من ينصره \" كقوله تعالى \" يا أيها الذين آمنوا إن تنصروا الله ينصركم ويثبت أقدامكم والذين كفروا فتعسا لهم وأضل أعمالهم \" وقوله \" إن الله لقوي عزيز \" وصف نفسه بالقوة والعزة فبقوته خلق كل شيء فقدره تقديرا وبعزته لا يقهره قاهر ولا يغلبه غالب بل كل شيء ذليل لديه فقير إليه ومن كان القوي العزيز ناصره فهو المنصور وعدوه هو المقهور قال الله تعالى \" ولقد سبقت كلمتنا لعبادنا المرسلين إنهم لهم المنصورون وإن جندنا لهم الغالبون \" وقال تعالى \" كتب الله لأغلبن أنا ورسلي إن الله لقوي عزيز \"."
    },
    {
      "ayah": 41,
      "surah": 22,
      "text": "قال ابن أبي حاتم حدثنا أبي حدثنا أبو الربيع الزهراني حدثنا حماد بن زيد عن أيوب وهشام عن محمد قال: قال عثمان بن عفان فينا نزلت \" الذين إن مكناهم في الأرض أقاموا الصلاة وآتوا الزكاة وأمروا بالمعروف ونهوا عن المنكر \" فأخرجنا من ديارنا بغير حق إلا أن قلنا ربنا الله ثم مكنا في الأرض فأقمنا الصلاة وآتينا الزكاة وأمرنا بالمعروف ونهينا عن المنكر ولله عاقبة الأمور فهي لي ولأصحابي وقال أبو العالية هم أصحاب محمد صلى الله عليه وسلم قال الصباح بن سواده الكندي سمعت عمر بن عبد العزيز يخطب وهو يقول \" الذين إن مكناهم في الأرض \" الآية ثم قال ألا إنها ليست على الوالي وحده ولكنها على الوالي والمولى عليه ألا أنبئكم بما لكم على الوالي من ذلكم وبما للوالي عليكم منه إن لكم على الوالي من ذلكم أن يأخذكم بحقوق الله عليكم وأن يأخذ لبعضكم من بعض وأن يهديكم للتي هي أقوم ما استطاع وإن عليكم من ذلك الطاعة غير المبزوزة ولا المستكره بها ولا المخالف سرها علانيتها وقال عطية العوفي هذه الآية كقوله \" وعد الله الذين آمنوا منكم وعملوا الصالحات ليستخلفهم في الأرض \" وقوله \" ولله عاقبة الأمور \" كقوله تعالى والعاقبة للمتقين وقال زيد بن أسلم ولله عاقبة الأمور وعند الله ثواب ما صنعوا."
    },
    {
      "ayah": 42,
      "surah": 22,
      "text": "يقول تعالى مسليا لنبيه محمد في تكذيب من خالفه من قومه \" وإن يكذبوك فقد كذبت قبلهم قوم نوح- إلى أن قال - وكذب موسى \" أي مع ما جاء به من الآيات البينات والدلائل الواضحات."
    },
    {
      "ayah": 43,
      "surah": 22,
      "text": "يقول تعالى مسليا لنبيه محمد في تكذيب من خالفه من قومه \" وإن يكذبوك فقد كذبت قبلهم قوم نوح- إلى أن قال - وكذب موسى \" أي مع ما جاء به من الآيات البينات والدلائل الواضحات."
    },
    {
      "ayah": 44,
      "surah": 22,
      "text": "\" فأمليت للكافرين \" أي أنطرتهم وأخرتهم \" ثم أخذتهم فكيف كان نكير \" أي فكيف كان إنكاري عليهم ومعاقبتي لهم ؟! وذكر بعض السلف أنه كان بين قول فرعون لقومه أنا ربكم الأعلى وبين إهلاك الله له أربعون سنة وفي الصحيحين عن أبي موسى رضي الله عنه عن النبي صلى الله عليه وسلم أنه قال \" إن الله ليملي لظالم حتى إذا أخذه لم يفلته \" ثم قرأ \" وكذلك أخذ ربك إذا أخذ القرى وهي ظالمة إن أخذه أليم شديد \"."
    },
    {
      "ayah": 45,
      "surah": 22,
      "text": "ثم قال تعالى \" فكأين من قرية أهلكناها \" أي كم من قرية أهلكتها وهي ظالمة \" أي مكذبة لرسله \" فهي خاوية على عروشها \" قال الضحاك سقوفها أي قد خربت منازلها وتعطلت حواضرها \" وبئر معطلة \" أي لا يستقي منها ويردها أحد بعد كثرة وارديها والازدحام عليها \" وقصر مشيد \" قال عكرمة يعني المبيض بالجص وروي عن علي بن أبي طالب ومجاهد وعطاء وسعيد بن جبير وأبي المليح والضحاك نحو ذلك وقال آخرون هو المنيف المرتفع وقال آخرون المشيد المنيع الحصين وكل هذه الأقوال متقاربة. ولا منافاة بينها فإنه لم يحم أهله شدة بنائه ولا ارتفاعه ولا إحكامه ولا حصانته عن حلول بأس الله بهم كما قال تعالى \" أينما تكونوا يدرككم الموت ولو كنتم في بروج مشيدة \"."
    },
    {
      "ayah": 46,
      "surah": 22,
      "text": "وقوله \" أفلم يسيروا في الأرض \" أي بأبدانهم وبفكرهم أيضا وذلك كاف كما قال ابن أبي الدنيا في كتاب التفكر والاعتبار حدثنا هارون بن عبدالله حدثنا سيار حدثنا جعفر حدثنا مالك بن دينار: قال أوحى الله تعالى إلى موسى بن عمران عليه السلام أن: يا موسى اتخذ نعلين من حديد وعصا ثم سح في الأرض ثم اطلب الآثار والعبر حتى يتخرق النعلان وتنكسر العصا وقال ابن أبي الدنيا قال بعض الحكماء أحي قلبك بالمواعظ ونوره بالتفكر وموته بالزهد وقوه باليقين وذلله بالموت وقدره بالفناء وبصره فجائع الدنيا وحذره صولة الدهر وفحش تقلب الأيام واعرضي عليه أخبار الماضين وذكره ما أصاب من كان قبله وسيره في ديارهم وآثارهم وانظر ما فعلوا وأين حلوا وعم انقلبوا أي فانظروا ما حل بالأمم المكذبة من النقم والنكال \" فتكون لهم قلوب يعقلون بها أو آذان يسمعون بها \" أي فيعتبرون بها فإنها لا تعمى الأبصار ولكن تعمى القلوب التي في الصدور \" أي ليس العمى عمى البصر وإنما العمى عمى البصيرة وإن كانت القوة الباصرة سليمة فإنها لا تنفذ إلى العبر ولا تدري ما الخبر وما أحسن ما قاله بعض الشعراء في هذا المعنى وهو أبو محمد عبدالله بن محمد بن حيان الأندلسي الشنتريني وقد كانت وفاته سنة سبع عشرة وخمسمائة يا من يصيخ إلى داعي الشـقاء وقـد نادى به الناعيان الشيــب والكبر إن كنت لا تسمع الذكرى ففـيم تـرى في رأسك الواعيان الســمع والبصر ليس الأصـم ولا الأعـمى سـوى رجـل لم يهده الهاديان العيـن والأثـر لا الدهر يبقى ولا الدنيا ولا الفلك الأعلى ولا النيران الشمس والقمر ليرحـــلن عـن الدنيا وإن كـــرها فراقها الثاويـــان البدن والحضر"
    },
    {
      "ayah": 47,
      "surah": 22,
      "text": "يقول تعالى لنبيه صلوات الله وسلامه عليه \" ويستعجلونك بالعذاب \" أي هؤلاء الكفار الملحدون المكذبون بالله وكتابه ورسوله واليوم الآخر كما قال تعالى \" وإذا قالوا اللهم إن كان هذا هو الحق من عندك فأمطر علينا حجارة من السماء أو ائتنا بعذاب أليم \" \" وقالوا ربنا عجل لنا قطنا قبل يوم الحساب \" وقوله \" ولن يخلف الله وعده \" أي الذي وعد من إقامة الساعة والانتقام من أعدائه والإكرام لأوليائه قال الأصمعي كنت عند أبي عمرو بن العلاء فجاءه عمرو بن عبيد فقال يا أبا عمرو هل يخلف الله الميعاد؟ فقال لا فذكر آية وعيد فقال له أمن العجم أنت ؟ إن العرب تعد الرجوع عن الوعد لؤما وعن الإيعاد كرما أما سمعت قول الشاعر: ليرهب ابن العم والجار سطوتي ولا أنثني عن سطوة المتهدد فإني وإن أوعـدته أو وعدتـه لمخـلف إيعـادي ومنجز موعدي وقوله \" وإن يوما عند ربك كألف سنة مما تعدون \" أي هو تعالى لا يعجل فإن مقدار ألف سنة عند خلقه كيوم واحد عنده بالنسبة إلى حكمه لعلمه بأنه على الانتقام قادر وأنه لا يفوته شيء وإن أجل وأنظر وأملى ولهذا قال بعد هذا."
    },
    {
      "ayah": 48,
      "surah": 22,
      "text": "\" وكأين من قرية أمليت لها وهي ظالمة ثم أخذتها وإلي المصير \" قال ابن أبي حاتم حدثنا الحسن بن عرفة حدثني عبدة بن سليمان عن محمد بن عمرو عن أبي سلمة عن أبي هريرة أن رسول الله صلى الله عليه وسلم قال \" يدخل فقراء المسلمين الجنة قبل الأغنياء بنصف يوم خمسمائة عام \" ورواه الترمذي والنسائي من حديث الثوري عن محمد ابن عمرو به وقال الترمذي حسن صحيح وقد رواه ابن جرير عن أبي هريرة موقوفا فقال: حدثني يعقوب حدثنا ابن علية حدثنا سعيد الجريري عن أبي نضرة عن سمير بن نهار قال: قال أبو هريرة: يدخل فقراء المسلمين الجنة قبل الأغنياء بمقدار نصف يوم قلت وما مقدار نصف يوم ؟ قال أوما تقرأ القرآن قلت بلى ؟ قال \" وإن يوما عند ربك كألف سنة مما تعدون \" وقال أبو داود في آخر كتاب الملاحم من سننه حدثنا عمرو بن عثمان حدثنا أبو المغيرة حدثنا صفوان عن شريح بن عبيد عن سعد بن أبي وقاص عن النبي صلى الله عليه وسلم أنه قال \" إني لأرجو أن لا تعجز أمتي عند ربها أن يؤخرهم نصف يوم \" قيل لسعد وما نصف يوم ؟ قال خمسمائة سنة. وقال ابن أبي حاتم حدثنا أحمد بن سنان حدثنا عبد الرحمن بن مهدي عن إسرائيل عن سماك عن عكرمة عن ابن عباس \" وإن يوما عند ربك كألف سنة مما تعدون \" قال من الأيام التي خلق الله فيها السموات والأرض ورواه ابن جرير عن ابن بشار عن ابن المهدي وبه قال مجاهد وعكرمة ونص عليه أحمد بن حنبل في كتاب الرد على الجهمية وقال مجاهد هذه الآية كقوله \" يدبر الأمر من السماء إلى الأرض ثم يعرج إليه في يوم كان مقداره ألف سنة مما تعدون \" وقال ابن أبي حاتم: حدثنا أبي حدثنا عارم بن محمد بن الفضل حدثنا حماد بن زيد عن يحيى بن عتيق عن محمد بن سيرين عن رجل من أهل الكتاب أسلم قال: إن الله تعالى خلق السموات والأرض في ستة أيام \" وإن يوما عند ربك كألف سنة مما تعدون \" وجعل أجل الدنيا ستة أيام وجعل الساعة في اليوم السابع \" وإن يوما عند ربك كألف سنة مما تعدون \" فقد مضت الستة أيام وأنتم في اليوم السابع فمثل ذلك كمثل الحامل إذا دلت شهرها ففي أية لحظة ولدت كان تماما."
    },
    {
      "ayah": 49,
      "surah": 22,
      "text": "يقول تعالى لنبيه صلى الله عليه وسلم حين طلب منه الكفار وقوع العذاب واستعجلوه به \" قل يا أيها الناس إنما أنا لكم نذير مبين \" أي إنما أرسلني الله إليكم نذيرا لكم بين يدي عذاب شديد وليس إلي من حسابكم من شيء أمركم إلى الله إن شاء عجل لكم العذاب وإن شاء أخره عنكم وإن شاء تاب على من يتوب إليه وإن شاء أضل من كتب عليه الشقاوة وهو الفعال لما يشاء ويريد ويختار \" لا معقب لحكمه وهو سريع الحساب \" و \" إنما أنا لكم نذير مبين \"."
    },
    {
      "ayah": 5,
      "surah": 22,
      "text": "لما ذكر تعالى المخالف للبعث المنكر للمعاد ذكر تعالى الدليل على قدرته تعالى على المعاد بما يشاهد من بدئه للخلق فقال \" يا أيها الناس إن كنتم في ريب \" أي في شك \" من البعث \" وهو المعاد وقيام الأرواح والأجساد يوم القيامة \" فإنا خلقناكم من تراب \" أي أصل برئه لكم من تراب وهو الذي خلق منه آدم عليه السلام \" ثم من نطفة \" أي ثم جعل نسله من سلالة من ماء مهين \" ثم من علقة ثم من مضغة \" وذلك أنه إذا استقرت النطفة في رحم المرأة مكثت أربعين يوما كذلك يضاف إليه ما يجتمع إليها ثم تنقلب علقة حمراء بإذن الله فتمكث كذلك أربعين يوما ثم تستحيل فتصير مضغة قطعة من لحم لا شكل فيما ولا تخطيط ثم يشرع في التشكيل والتخطيط فيصور منها رأس ويدان وصدر وبطن وفخذان ورجلان وسائر الأعضاء فتارة تسقطها المرأة قبل التشكيل والتخطيط وتارة تلقيها وقد صارت ذات شكل وتخطيط ولهذا قال تعالى \" ثم من مضغة مخلقة وغير مخلقة \" أي كما تشاهدونها \" لنبين لكم ونقر في الأرحام ما نشاء إلى أجل مسمى \" أي وتارة تستقر في الرحم لا تلقيها المرأة ولا تسقطها كما قال مجاهد في قوله تعالى \" مخلقة وغير مخلقة \" قال هو السقط مخلوق وغير مخلوق فإذا مضى عليها أربعون يوما وثم مضغة أرسل الله تعالى إليها ملكا فنفخ فيها الروح وسواها كما يشاء الله عز وجل من حسن وقبح وذكر وأنثى وكتب رزقها وأجلها وشقي أو سعيد كما ثبت في الصحيحين من حديث الأعمش عن زيد بن وهب عن ابن مسعود قال حدثنا رسول الله صلى الله عليه وسلم وهو الصادق المصدوق \" إن خلق أحدكم يجمع في بطن أمه أربعين ليلة ثم يكون علقة مثل ذلك ثم يكون مضغة مثل ذلك ثم يبعث الله إليه الملك فيؤمر بأربع كلمات فيكتب رزقه وعمله وأجله وشقي أو سعيد ثم ينفخ فيه الروح \" وروى ابن أبي حاتم وابن جرير من حديث داود بن أبي هند عن الشعبي عن علقمة عن عبدالله قال: النطفة إذا استقرت في الرحم جاءها ملك بكفه فقال يا رب مخلقة أو غير مخلقة فإن قيل غير مخلقة لم تكن نسمة وقذفتها الأرحام دما وإن قيل مخلقة قال أي رب ذكرا أو أنثى شقي أو سعيد ما الأجل وما الأثر وبأي أرض يموت. قال فيقال للنطفة من ربك ؟ فتقول الله فيقال من رازقك ؟ فتقول الله فيقال له اذهب إلى الكتاب فإنك ستجد فيه فصة هذه النطفة قال فتخلق فتعيش في أجلها وتأكل رزفها وتطأ أثرها حتى إذا جاء أجلها ماتت فدفنت في ذلك ثم تلا عامر الشعبي \" يا أيها الناس إن كنتم في ريب من البعث فإنا خلقناكم من تراب ثم من نطفة ثم من علقة ثم من مضغة مخلقة وغير مخلقة \" فإذا بلغت مضغة نكست في الخلق الرابع فكانت نسمة وإن كانت غير مخلقة قذفتها الأرحام دما وإن كانت مخلقة نكست نسمة. وقال ابن أبي حاتم حدثنا محمد بن عبدالله بن يزيد المقري حدثنا سفيان عن عمرو بن دينار عن أبي الطفيل عن حذيفة بن أسيد يبلغ به النبي صلى الله عليه وسلم قال \" يدخل الملك على النطفة بعد ما تستقر في الرحم بأربعين يوما أو خمس وأربعين فيقول أي رب أشقي أم سعيد فيقول الله ويكتبان فيقول أذكر أم أنثى فيقول الله ويكتبان ويكتب عمله وأثره ورزقه وأجله ثم تطوى الصحف فلا يزاد على ما فيها ولا ينتقص \" ورواه مسلم من حديث سفيان بن عيينة ومن طريق آخر عن أبي الطفيل بنحو معناه وقوله \" ثم نخرجكم طفلا \" أي ضعيفا في بدنه وسمعه وبصره وحواسه وبطشه وعقله ثم يعطيه الله القوة شيئا فشيئا ويلطف به ويحنن عليه والديه في آناء الليل وأطراف النهار ولهذا قال \" ثم لتبلغوا أشدكم \" أي يتكامل القوي ويتزايد ويصل إلى عنفوان الشباب وحسن المنظر \" ومنكم من يتوفى \" أي في حال شبابه وقواه \" ومنكم من يرد إلى أرذل العمر \" وهو الشيخوخة والهرم وضعف القوة والعقل والفهم وتناقص الأحوال من الخوف وضعف الفكر ولهذا قال \" لكي لا يعلم من بعد علم شيئا \" كما قال تعالى \" الله الذي خلقكم من ضعف ثم جعل من بعد ضعف قوة ثم جعل من بعد قوة ضعفا وشيبة يخلق ما يشاء وهو العليم القدير \" وقد قال الحافظ أبو يعلى أحمد بن علي بن المثنى الموصلي في مسنده حدثنا منصور بن أبي مزاحم حدثنا خالد الزيات حدثني داود أبو سليمان عن عبدالله بن عبدالرحمن بن معمر بن حزم الأنصاري عن أنس بن مالك رفع الحديث قال \" المولود حتى يبلغ الحنث ما عمل من حسنة كتبت لوالده أو لوالديه وما عمل من سيئة لم تكتب عليه ولا على والديه فإذا بلغ الحنث أجرى الله عليه القلم أمر الملكان اللذان كانا معه أن يحفظا وأن يشددا فإذا بلغ أربعين سنة في الإسلام أمنه الله من البلايا الثلاث: الجنون والجذام والبرص فإذا بلغ الخمسين خفف الله عنه حسابه فإذا بلغ ستين رزقه الله الإنابة إليه بما أحب فإذا بلغ السبعين أحبه أهل السماء فإذا بلغ الثمانين كتب الله حسناته وتجاوز عن سيئاته فإذا بلغ التسعين غفر الله له ما تقدم من ذنبه وما تأخر وشفعه في أهل بيته وكتب أمين الله وكان أسير الله في أرضه فإذا بلغ أرذل العمر لكي لا يعلم من بعد علم شيئا كتب الله له مثل ما كان يعمل في صحته من الخير فإذا عمل سيئة لم تكتب عليه \" هذا حديث غريب جدا وفيه نكارة شديدة ومع هذا قد رواه الإمام أحمد بن حنبل في مسنده موقوقا ومرفوعا فقال: حدثنا أبو النضر حدثنا الفرج حدثنا محمد بن عامر عن محمد بن عبدالله العاملي عن عمرو بن جعفر عن أنس قال \" إذا بلغ الرجل المسلم أربعين سنة أمنه الله من أنواع البلايا من الجنون والبرص والجذام فإذا بلغ الخمسين لين الله حسابه وإذا بلغ الستين رزقه الله إنابة يحبه الله عليها وإذا بلغ السبعين أحبه الله وأحبه أهل السماء وإذا بلغ الثمانين تقبل الله حسناته ومحا عنه سيئاته وإذا بلغ التسعين غفر الله له ما تقدم من ذنبه وما تأخر وسمي أسير الله في أرضه وشفع في أهله \" ثم قال حدثنا هشام حدثنا الفرج حدثني محمد بن عبدالله العامري عن محمد بن عبدالله بن عمرو بن عثمان عن عبدالله بن عمر بن الخطاب عن النبي صلى الله عليه وسلم مثله ورواه الإمام أحمد أيضا حدثنا أنس بن عياض حدثني يوسف بن أبي بردة الأنصاري عن جعفر بن عمرو بن أمية الضمري عن أنس بن مالك أن رسول الله صلى الله عليه وسلم قال \" ما من معمر يعمر في الإسلام أربعين سنة إلا صرف الله عنه ثلاثة أنواع من البلاء: الجنون والبرص والجذام \" وذكر تمام الحديث كما تقدم سواء ورواه الحافظ أبو بكر البزار عن عبدالله بن شبيب عن أبي شيبة عن عبدالله بن عبدالملك عن أبي قتادة العدوي عن ابن أخي الزهري عن عمه عن أنس بن مالك قال: قال رسول الله \" ما من عبد يعمر في الإسلام أربعين سنة إلا صرف الله عنه أنواع من البلاء الجنون والجذام والبرص فإذا بلغ خمسين سنة لين الله الحساب فإذا بلغ ستين سنة رزقه الله الإنابة إليه بما يحب فإذا بلغ سبعين سنة غفر الله له ما تقدم من ذنبه وما تأخر وسمي أسير الله وأحبه أهل السماء فإذا بلغ الثمانين تقبل الله منه حسناته وتجاوز عن سيئاته فإذا بلغ التسعين غفر الله له ما تقدم من ذنبه وما تأخر وسمي أسير الله في أرضه وقوله \" وترى الأرض هامدة \" هذا دليل آخر على قدرته تعالى على إحياء الموتى كما يحي الأرض الميتة الهامدة وهي المقحلة التي لا ينبت فيها شيء وقال قتادة غبراء متهشمة. وقال السدي ميتة \" فإذا أنزلنا عليها الماء اهتزت وربت وأنبتت من كل زوج بهيج \" أي فإذا أنزل الله عليها المطر اهتزت أي تحركت بالنبات وحيت بعد موتها وربت أي ارتفعت لما سكن فيها الثرى ثم أنبتت ما فيها من الألوان والفنون من ثمار وزروع وأشتات في اختلاف ألوانها وطعومها وروائحها وأشكالها ومنافعها ولهذا قال تعالى \" وأنبتت من كل زوج بهيج \" أي حسن المنظر طيب الريح."
    },
    {
      "ayah": 50,
      "surah": 22,
      "text": "\" فالذين آمنوا وعملوا الصالحات \" أي آمنت قلوبهم وصدقوا إيمانهم بأعمالهم \" لهم مغفرة ورزق كريم \" أي مغفرة لما سلف من سيئاتهم ومجازاة حسنة على القليل من حسناتهم قال محمد بن كعب القرظي إذا سمعت الله تعالى يقول \" ورزق كريم \" فهو الجنة."
    },
    {
      "ayah": 51,
      "surah": 22,
      "text": "وقوله \" والذين سعوا في آياتنا معاجزين \" قال مجاهد يثبطون الناس عن متابعة النبي صلى الله عليه وسلم وكذا قال عبدالله بن الزبير مثبطي وقال ابن عباس معاجزين مراغمين \" أولئك أصحاب الجحيم \" وهي النار الحارة الموجعة الشديد عذابها ونكالها أجارك الله منها قال الله تعالى \" الذين كفروا وصدوا عن سبيل الله زدناهم عذابا فوق العذاب بما كانوا يفسدون \"."
    },
    {
      "ayah": 52,
      "surah": 22,
      "text": "قد ذكر كثير من المفسرين ههنا قصة الغرانيق وما كان من رجوع كثير من المهاجرة إلى أرض الحبشة ظنا منهم أن مشركي قريش قد أسلموا ولكنها من طرق لها مرسلة ولم أرها مسندة من وجه صحيح والله أعلم قال ابن أبي حاتم حدثنا يونس بن حبيب حدثنا أبو داود حدثنا شعبة عن أبي بشر عن سعيد بن جبير قال: قرأ رسول الله صلى الله عليه وسلم بمكة النجم فلما بلغ هذا الموضع \" أفرأيتم اللات والعزى ومناة الثالثة الأخرى \" قال فألقى الشيطان على لسانه: تلك الغرانيق العلى وإن شفاعتهن ترتجى قالوا ما ذكر آلهتنا بخير قبل اليوم فسجد وسجدوا فأنزل الله عز وجل هذه الآية \" وما أرسلنا من قبلك رسول ولا نبي إلا إذا تمنى ألقى الشيطان في أمنيته فينسخ الله ما يلقي الشيطان ثم يحكم الله آياته والله عليم حكيم \" ورواه ابن جرير عن بندار عن غندر عن شعبة به بنحوه وهو مرسل وقد رواه البزار في مسنده عن يوسف بن حماد عن أمية بن خالد عن شعبة عن أبي بشر عن سعيد بن جبير عن ابن عباس فيما أحسب الشك في الحديث أن النبي صلى الله عليه وسلم قرأ بمكة سورة النجم حتى انتهى إلى \" أفرأيتم اللات والعزى \" وذكر بقيته ثم قال البزار لا نعلمه يروي متصلا إلا بهذا الإسناد مفرد بوصله أمية بن خالد وهو ثقة مسهور وإنما يروي هذا من طريق الكلبى عن أبي صالح عن ابن عباس ثم رواه ابن أبي حاتم عن أبي العالية وعن السدي مرسلا وكذا رواه ابن جرير عن محمد بن كعب القرظي ومحمد بن قيس مرسلا أيضا وقال قتادة كان النبي صلى الله عليه وسلم يصلي عند المقام إذ نعس فألقى الشيطان على لسانه وإن شفاعتها لترتجى وإنها لمع الغرانيق العلى فحفظها المشركون وأجرى الشيطان أن النبي صلى الله عليه وسلم قد قرأها فذلت بها ألسنتهم فأنزل الله \" وما أرسلنا من قبلك من رسول ولا نبي \" الآية فدحر الله الشيطان ثم قال ابن أبي حاتم حدثنا موسى بن أبي موسى الكوفي حدثنا محمد بن إسحاق الشيبي حدثنا محمد بن فليح عن موسى بن عقبة عن ابن شهاب قال: أنزلت سورة النجم وكان المشركون يقولون لو كان هذا الرجل يذكر آلهتنا بخير أقررناه وأصحابه ولكنه لا يذكر من خالف دينه من اليهود والنصارى بمثل الذي يذكر آلهتنا من الشتم والشر وكان رسول الله صلى الله عليه وسلم قد اشتد عليه ما ناله وأصحابه من أذاهم وتكذيبه وأحزنه ضلالهم فكان يتمنى هداهم فلما أنزل الله سورة النجم قال \" أفرأيتم اللات والعزى ومناة الثالثة الأخرى ألكم الذكر وله الأنثى \" ألقى الشيطان عندها كلمات حين ذكر الله الطواغيت فقال وإنهن لهن الغرانيق العلى وإن شفاعتهن لهي التي ترتجى وكان ذلك من سجع الشيطان وفتنته فوقعت هاتان الكلمتان في قلب كل مشرك بمكة وذلت بها ألسنتهم وتباشروا بها وقالوا إن محمدا قد رجع إلى دينه الأول ودين قومه فلما بلغ رسول الله صلى الله عليه وسلم آخر النجم سجد وسجد كل من حضره من مسلم أو مشرك غير أن الوليد بن المغيرة كان رجلا كبيرا فرفع ملء كفه تراب فسجد عليه فعجب الفريقان كلاهما من جماعتهم في السجود لسجود رسول الله صلى الله عليه وسلم فأما المسلمون فعجبوا لسجود المشركين معهم على غير إيمان ولا يقين ولم يكن المسلمون سمعوا الذي ألقى الشيطان في مسامع المشركين فاطمأنت أنفسهم لما ألقى الشيطان في أمنية رسول الله صلى الله عليه وسلم وحدثهم به الشيطان أن رسول الله قد قرأها في السورة فسجدوا لتعظيم آلهتهم ففشت تلك الكلمة في الناس وأظهرها الشيطان حتى بلغت أرض الحبشة ومن بها من المسلمين عثمان بن مظعون وأصحابه وتحدثوا أن أهل مكة قد أسلموا كلهم وصلوا مع رسول الله صلى الله عليه وسلم وبلغهم سجود الوليد بن المغيرة على التراب على كفه وحدثوا أن المسلمين قد أمنوا بمكة فأقبلوا سراعا وقد نسخ الله ما ألقى الشيطان وأحكم الله آياته وحفظه من القرية وقال الله \" وما أرسلنا من قبلك من رسول ولا نبي إلا إذا تمنى ألقى الشيطان في أمنيته فينسخ الله ما يلقي الشيطان ثم يحكم الله آياته والله عليم حكيم."
    },
    {
      "ayah": 53,
      "surah": 22,
      "text": "\" ليجعل ما يلقي الشيطان فتنة للذين في قلوبهم مرض والقاسية قلوبهم وإن الظالمين لفي شقاق بعيد \" فلما بين الله قضاءه وبرأه من سجع الشيطان انقلب المشركون بضلالتهم وعداوتهم المسلمين واشتدوا عليهم وهذا أيضا مرسل وفي تفسير ابن جرير عن الزهري عن أبي بكر بن عبد الرحمن بن الحارث بن هشام نحوه وقد رواه الحافظ أبو بكر البيهقي في كتابه دلائل النبوة فلم يجز به موسى بن عقبة ساقه من مغازيه بنحوه قال وقد رواه عن أبي إسحاق هذه القصة \" قلت \"وقد ذكرها محمد بن إسحاق في السيرة بنحو من هذا وكلها مرسلات ومنقطعات والله أعلم وقد ساقها البغوي في تفسره مجموعة من كلام ابن عباس ومحمد بن كعب القرظي وغيرهما بنحو من ذلك ثم سأل ههنا سؤالا كيف وقع مثل هذا مع العصمة المضمونة من الله تعالى لرسوله صلاة الله وسلامه عليه ثم حكى أجوبة عن الناس من ألطفها أن الشيطان أوقع في مسامع المشركين ذلك فتوهموا أنه صدر عن رسول الله صلى الله عليه وسلم وليس كذلك في نفس الأمر بل.إنما كان من صنيع الشيطان لا عن رسول الرحمن والله أعلم. وهكذا تنوعت أجوبة المتكلمين عن هذا بتقدير صحته وقد تعرض القاضي عياض رحمه الله في كتاب الشفاء لهذا وأجاب بما حاصله أنها كذلك لثبوتها وقوله \" إلا إذا تمنى ألقى الشيطان في أمنيته \" هذا فيه تسلية من الله لرسوله صلوات الله وسلامه عليه أي لا يهيدنك فقد أصاب مثل هذا من قبلك من المرسلين والأنبياء قال البخاري قال ابن عباس \" في أمنيته \" إذا حدث ألقى الشيطان في حديثه فيبطل الله ما يلقي الشيطان \" ثم يحكم الله آياته \" قال علي بن أبي طلحة عن ابن عباس \" إذا تمنى ألقى الشيطان في أمنيته \" يقول إذا حدث ألقى الشيطان في حديثه وقال مجاهد \" إذا تمنى \" يعني إذا قال يقال أمنيته قراءته \" إلا أماني \" يقرءون ولا يكتبون قال البغوي وأكثر المفسرين قالوا معنى قوله \" تمنى \" أي تلا وقرأ كتاب الله \" ألقى الشيطان في أمنيته \" أي في تلاوته قال الشاعر في عثمان حين قتل: تمنى كتاب الله أول ليلة وآخرها لاقى حمام المقادر وقال الضحاك \" إذا تمنى \" إذا تلا قال ابن جرير هذا القول أشبه بتأويل الكلام وقوله \" فينسخ الله ما يلقي الشيطان \" حقيقة النسخ لغة:الإزالة والرفع قال علي بن أبي طلحة عن ابن عباس أي فيبطل الله سبحانه وتعالى ما ألقى الشيطان وقال الضحاك نسخ جبريل بأمر الله ما ألقى الشيطان وأحكم الله آياته وقوله \" والله عليم \" أي بما يكون من الأمور والحوادث لا تخفى عليه خافية \" حكيم \" أي في تقديره وخلقه وأمره له الحكمة التامة والحجة البالغة ولهذا قال \" ليجعل ما يلقي الشيطان فتنة للذين في قلوبهم مرض \" أي شك وشرك وكفر ونفاق كالمشركين حين فرحوا بذلك واعتقدوا أنه صحيح من عند الله وإنما كان من الشيطان قال ابن جريج \" الذين في قلوبهم مرض \" هم المنافقون \" والقاسية قلوبهم \" هم المشركون وقال مقاتل بن حيان هم اليهود \" وإن الظالمين لفي شقاق بعيد \" أي في ضلال ومخالفة وعناد بعيد أي من الحق والصواب."
    },
    {
      "ayah": 54,
      "surah": 22,
      "text": "\" وليعلم الذين أوتوا العلم أنه الحق من ربك فيؤمنوا به \" أي وليعلم الذين أوتوا العلم النافع الذي يفرقون به بن الحق والباطل والمؤمنون بالله ورسوله أن ما أوحيناه إليك هو الحق من ربك الذي أنزله بعلمه وحفظه وحرسه أن يختلط به غيره بل هو كتاب عزيز \" لا يأتيه الباطل من بين يديه ولا من خلفه تنزيل من حكيم حميد \" وقوله \" فيؤمنوا به \" أي يصدقوه وينقادوا له \" فتخبت له قلوبهم \" أي تخضع وتذل له قلوبهم \" وإن الله لهادى الذين آمنوا إلى صراط مستقيم \" أي في الدنيا والآخرة أما في الدنيا فيرشدهم إلى الحق واتباعه ويوفقهم لمخالقة الباطل واجتنابه وفي الآخرة يهديهم الصراط المستقيم الموصل إلى درجات الجنات ويزحزحهم عن العذاب الأليم والدركات."
    },
    {
      "ayah": 55,
      "surah": 22,
      "text": "يقول تعالى مخبرا عن الكفار أنهم لا يزالون في مرية أي في شك من هذا القرآن قاله ابن جريج واختاره ابن جرير وقال سعيد بن جبير وابن زيد \" أي مما ألقى الشيطان \" حتى تأتيهم الساعة بغتة \" قال مجاهد فجأة وقال قتادة \" بغتة \" بغت القوم أمر الله وما أخذ الله قوما قط إلا عند سكرتهم وغرتهم ونعمتهم فلا تغتروا بالله إنه لا يغتر بالله إلا القوم الفاسقون وقوله \" أو يأتيهم عذاب يوم عقيم \" قال مجاهد قال أبي بن كعب هو يوم بدر وكذا قال مجاهد وعكرمة وسعيد بن جبير وقتادة وغير واحد واختاره ابن جرير قال عكرمة ومجاهد في رواية عنهما هو يوم القيامة لا ليل له وكذا قال الضحاك والحسن البصري وهذا القول هو الصحيح وإن كان يوم بدر من جملة ما أوعدوا به لكن هذا هو المراد."
    },
    {
      "ayah": 56,
      "surah": 22,
      "text": "ولهذا قال \" الملك يومئذ لله يحكم بينهم \" كقوله \" مالك يوم الدين \" وقوله \" الملك يومئذ الحق للرحمن وكان يوما على الكافرين عسيرا \" \" فالذين آمنوا وعملوا الصالحات \" أي آمنت قلوبهم وصدقوا بالله ورسوله وعملوا بمقتضى ما علموا وتوافق قلوبهم وأقوالهم وأعمالهم \" في جنات النعيم \" أي لهم النعيم المقيم الذي لا يحول ولا يزول ولا يبيد."
    },
    {
      "ayah": 57,
      "surah": 22,
      "text": "\" والذين كفروا وكذبوا بآياتنا \" أي كفرت قلوبهم بالحق وجحدته وكذبوا به وخالفوا الرسل واستكبروا عن اتباعهم \" فأولئك له عذاب مهين \" أي مقابلة استكبارهم وإبائهم عن الحق كقوله تعالى \" إن الذين يستكبرون عن عبادتي سيدخلون جهنم داخرين \" أي صاغرين."
    },
    {
      "ayah": 58,
      "surah": 22,
      "text": "يخبر تعالى من خرج مهاجرا في سبيل الله ابتغاء مرضاته وطلبا لما عنده وترك الأوطان والأهلين والخلان وفارق بلاده في الله ورسوله ونصرة لدين الله ثم قتلوا أي في الجهاد أو ماتوا أي حتف أنفهم من غير قتال على فرشهم فقد حصلوا على الأجر الجزيل والثناء الجميل كما قال تعالى \" ومن يخرج من بيته مهاجرا إلى الله ورسوله ثم يدركه الموت فقد وقع أجره على الله \" وقوله \" ليرزقنهم رزقا حسنا \" أي ليجرين عليهم من فضله ورزقه من الجنة ما تقر به أعينهم \" وإن الله لهو خير الرازقين \"."
    },
    {
      "ayah": 59,
      "surah": 22,
      "text": "\" ليدخلنهم مدخلا يرضونه \" أي الجنة كما قال تعالى \" فأما إن كان من المقربين فروح وريحان وجنة ونعيم \" فأخبر أنه يحصل له الراحة والرزق وجنة النعيم كما قال ههنا \" ليرزقنهم الله رزقا حسنا \" ثم قال \" ليدخلنهم مدخلا يرضونه وإن الله لعليم \" أي بمن يهاجر ويجاهد في سبيله وبمن يستـحق ذلك \" حليم \" أي يحلم ويصفح ويغفر لهم الذنوب ويكفرها عنهم بهجرتهم إليه وتوكلهـم عليه فأما من قتل في سبيل الله من مهاجر أو غير مهاجر فإنه حي عند ربه يرزق كما قال تعالى \" ولا تحسبن الذين قتلوا في سبيل الله أمواتا بل أحياء عند ربهم يرزقون \" والأحاديث في هذا كثيرة كما تقدم وأما من توفي في سبيل الله من مهاجر أو غير مهاجر فقد تضمنت هذه الآية الكريمة مع الأحاديث الصحيحة إجراء الرزق عليه وعظيم إحسان الله إليه قال ابن أبي حاتم حدثنا أبي حدثنا المسيب بن واضح حدثنا ابن المبارك عن عبد الرحمن بن شريح عن ابن الحارث - يعني عبد الكريم - عن ابن عقبة يعني أبا عبيدة بن عقبة قال: قال شرحبيل بن السمط: طال رباطنا وإقامتنا على حصن بأرض الروم فمر بي سلمان يعني الفارسي رضي الله عنه فقال: إني سمعت رسول الله صلى الله عليه وسلم يقول \" من مات مرابطا أجرى الله عليه مثل ذلك الأجر وأجرى عليه الرزق وأمن من الفتانين واقرءوا إن شئتم \" والذين هاجروا في سبيل الله ثم قتلوا أو ماتوا ليرزقنهم الله رزقا حسنا وإن الله لهو خير الرازقين ليدخلنهم مدخلا يرضونه وإن الله لعليم حليم \" وقال أيضا حدثنا أبو زرعة حدثنا زيد بن بشر أخبرني همام أنه سمع أبا قبيل وربيعة بن سيف المعافري يقولان كنا برودس ومعنا فضالة بن عبيد الأنصاري صاحب رسول الله صلى الله عليه وسلم فمر بجنازتين إحداهما قتيل والأخرى متوفى فمال الناس على القتيل فقال فضالة ما لي أرى الناس مالوا مع هذا وتركوا هذا ؟ فقالوا هذا القتيل في سبيل الله فقال والله ما أبالي من أي حفرتيهما بعثت اسمعوا كتاب الله \" والذين هاجروا في سبيل الله ثم قتلوا أو ماتوا \" حتى بلغ آخر الآية وقال أيضا حدثنا أبي حدثنا عبدة بن سليمان أنبأنا ابن المبارك أنبأنا ابن لهيعة حدثنا سلامان بن عامر الشيباني أن عبد الرحمن بن جحدم الخولاني حدثه أنه حضر فضالة بن عبيد في البحر مع جنازتين أحدهما أصيب بمنجنيق والآخر توفي فجلس فضالة بن عبيد عند قبر المتوفى فقيل له تركت الشهيد فلم تجلس عنده فقال ما أبالي من أي حفرتيهما بعثت إن الله يقول \" والذين هاجروا في سبيل الله ثم قتلوا أو ماتوا ليرزقنهم الله رزقا حسنا \" الآيتين فما تبتغي أيها العبد إذا أدخلت مدخلا ترضاه ورزقت رزقا حسنا والله ما أبالي من أي حفرتيهما بعثت. ورواه ابن جرير عن يونس بن عبد الأعلى عن ابن وهب أخبرني عبد الرحمن بن شريح عن سلامان بن عامر قال كان فضالة برودس أميرا على الأرباع فخرج بجنازتي رجلين أحدهما قتيل والآخر متوفى فذكر نحو ما تقدم.وقوله \" ذلك ومن عاقب بمثل ما عوقب به \" الآية ذكر مقاتل بن حيان وابن جرير أنها نزلت في سرية من الصحابة لقوا جمعًا من المشركين في شهر محرم فناشدهم المسلمون لئلا يقاتلوهم في الشهر الحرام فأبى المشركون إلا قتالهم وبغوا عليهم فقاتلهم المسلمون فنصرهم الله عليهم \" إن الله لعفو غفور\"."
    },
    {
      "ayah": 6,
      "surah": 22,
      "text": "وقوله \" ذلك بأن الله هو الحق \" أي الخالق المدبر الفعال بما يشاء \" وأنه يحيي الموتى \" أي كما أحيا الأرض الميتة وأنبت منها هذه الأنواع \" إن الذي أحياها لمحيي الموتي إنه على كل شيء قدير \" \" إنما أمره إذا أراد شيئا أن يقول له كن فيكون \"."
    },
    {
      "ayah": 60,
      "surah": 22,
      "text": "وقوله \" ذلك ومن عاقب بمثل ما عوقب به \" الآية ذكر مقاتل بن حيان وابن جرير أنها نزلت في سرية من الصحابة لقوا جمعًا من المشركين في شهر محرم فناشدهم المسلمون لئلا يقاتلوهم في الشهر الحرام فأبى المشركون إلا قتالهم وبغوا عليهم فقاتلهم المسلمون فنصرهم الله عليهم \" إن الله لعفو غفور\"."
    },
    {
      "ayah": 61,
      "surah": 22,
      "text": "يقول تعالى منبها على أنه الخالق المتصرف في خلقه بما يشاء كما قال \" قل اللهم مالك الملك تؤتي الملك من تشاء وتنزع الملك ممن تشاء وتعز من تشاء وتذل من تشاء بيدك الخير إنك على كل شيء قدير تولج الليل في النهار وتولج النهار في الليل وتخرج الحي من الميت وتخرج الميت من الحي وترزق من تشاء بغير حساب \" ومعنى إيلاجه الليل في النهار والنهار في الليل إدخاله من هذا في هذا ومن هذا في هذا فتارة يطول الليل ويقصر النهار كما في الشتاء وتارة يطول النهار ويقصر الليل كما في الصيف وقوله وأن الله سميع بصير \" أي سميع بأقوال عباده بصير بهم لا يخفى عليه منهم خافية في أحوالهم وحركاتهم وسكناتهم ولما تبين أنه المتصرف في الوجود الحاكم الذي لا معقب لحكمه."
    },
    {
      "ayah": 62,
      "surah": 22,
      "text": "قال \" ذلك بأن الله هو الحق \" أي الإله الحق الذي لا تنبغي العبادة إلا له لأنه ذو السلطان العظيم الذي ما شاء كان وما لم يشأ لم يكن وكل شيء إليه فقير ذليل لديه \" وأن ما يدعون من دونه هو الباطل \" أي من الأصنام والأنداد والأوثان وكل ما عُبِد من دونه تعالى فهو باطل لأنه لا يملك ضرا ولا نفعا وقوله \" وأن الله هو العلي الكبير \" كما قال هو العلي العظيم وقال وهو الكبير المتعال \" فكل شيء تحت قهره وسلطانه وعظمته لا إله إلا هو ولا رب سواه لأنه العظيم الذي لا أعظم منه العلي الذي لا أعلى منه الكبير الذي لا أكبر منه تعالى وتقدس وتنزه وجل عما يقول الظالمون المعتدون علوا كبيرا."
    },
    {
      "ayah": 63,
      "surah": 22,
      "text": "وهذا أيضا من الدلالة على قدرته وعظيم سلطانه وأنه يرسل الرياح فتثير سحابا فتمطر على الأرض الجرز التي لا نبات فيها وهي جامدة يابسة سوداء ممحلة \" فإذا أنزلنا عليها الماء اهتزت وربت\" وقوله: \" فتصبح الأرض مخضرة \" الفاء ههنـا للتعقيب وتعقيب كل شيء بحسبه كما قال تعالى \" ثم خلقنا النطفة علقة فخلقنا العلقة مضغة \" الآية وقد ثبت في الصحيحين أن بين كل شيئين أربعين يوما ومع هذا هو معقب بالفاء وهكذا ههنا قال \" فتصبح الأرض مخضرة \" أي خضراء بعد يباسها ومحولها وقد ذكر عن بعض أهل الحجاز أنها تصبح عقب المطر خضراء فالله أعلم وقوله \" إن الله لطيف خبير \" أي عليم بما في أرجاء الأرض وأقطارها وأجزائها من الحب وإن صغر لا يخفي عليه خافية فيوصل إلى كل منه قسطه من الماء فينبته به كما قال لقمان \" يا بني إنها إن تك مثقال حبة من خردل فتكن في صخرة أو في السموات أو في الأرض يأتي بها الله إن الله لطيف خبير \" وقال: \"ألا يسجدوا لله الذي يخرج الخبء في السموات والأرض \" وقال تعالى \" وما تسقط من ورقة إلا يعلمها ولا حبة في ظلمات الأرض ولا رطب ولا يابس إلا في كتاب مبين \" وقال \" وما يعزب عن ربك من مثقال ذرة في الأرض ولا في السماء ولا أصغر من ذلك ولا أكبر إلا في كتاب مبين \" ولهذا قال أمية بن أبي الصلت أو زيد بن عمرو بن نفيل في قصيدته: وقولا له من ينبت الحب في الثرى فيصبح منه البقل يهتز رابيا ويخرج منه حبه في رءوسه في رءوسه ففي ذلك آيات لمن كان واعيا"
    },
    {
      "ayah": 64,
      "surah": 22,
      "text": "وقوله \" له ما في السموات وما في الأرض \" أي ملكه جميع الأشياء وهو غني عما سواه وكل شيء فقير إليه عبد لديه."
    },
    {
      "ayah": 65,
      "surah": 22,
      "text": "وقوله \" ألم تر أن الله سخر لكم ما في الأرض \" أي من حيوان وجماد وزروع وثمار كما قال \" وسخر لكم ما في السموات وما في الأرض جميعا منه \" أي من إحسانه وفضله وامتنانه \" والفلك تجري في البحر بأمره \" أي بتسخيره وتسيره أي في البحر العجاج وتلاطم الأمواج تجري الفلك بأهلها بريح طيبة ورفق وتؤدة فيحملون فيها ما شاءوا من تجائر وبضائع ومنافع من بلد إلى بلد وقطر إلى قطر ويأتون بما عند أولئك إلى هؤلاء كما ذهبوا بما عند هؤلاء إلى أولئك مما يحتاجون إليه ويطلبونه ويريدونه \" ويمسك السماء أن تقع على الأرض إلا بإذنه \" أي لو شاء لأذن للسماء فسقطت على الأرض فهلك من فيها ولكن من لطفه ورحمته وقدرته يمسك السماء أن تقع على الأرض إلا بإذنه ولهذا قال \" إن الله بالناس لرءوف رحيم \" أي مع ظلمهم كما قال في الآية الأخرى \" وإن ربك لذو مغفرة للناس على ظلمهم وإن ربك لشديد العقاب \"."
    },
    {
      "ayah": 66,
      "surah": 22,
      "text": "وقوله \" وهو الذي أحياكم ثم يميتكم ثم يحييكم إن الإنسان لكفور \" كقوله \" كيف تكفرون بالله وكنتم أمواتا فأحياكم ثم يميتكم ثم يحييكم ثم إليه ترجعون \" وقوله \" قل الله يحييكم ثم يميتكم ثم يجمعكم إلى يوم القيامة لا ريب فيه \" وقوله \" قالوا ربنا أمتنا اثنتين وأحييتنا اثنتين \" ومعنى الكلام كيف تجعلون لله أندادا وتعبدون معه غيره وهو المستقل بالخلق والرزق والتصرف \" وهو الذي أحياكم \" أي خلقكم بعد أن لم تكونوا شيئا يذكر فأوجدكم \" ثم يميتكم ثم يحييكم \" أي يوم القيامة \" إن الإنسان لكفور \" أي جحود."
    },
    {
      "ayah": 67,
      "surah": 22,
      "text": "يخبر تعالى أنه جعل لكل قوم منسكا قال ابن جرير يعني لكل أمة نبي منسكا قال: وأصل المنسك في كلام العرب هو الموضع الذي يعتاده الإنسان ويتردد إليه إما لخير أو شر قال ولهذا سميت مناسك الحج بذلك لترداد الناس إليها وعكوفهم عليها فإن كان كما قال من أن المراد لكل أمة نبي جعلنا منسكا فيكون المراد بقوله \" فلا ينازعك في الأمر \" أي هؤلاء المشركون وإن كان المراد \" لكل أمة جعلنا منسكا \" جعلا قدريا كما قال \" ولكل وجهة هو موليها \" ولهذا قال ههنا \" هم ناسكوه \" أي فاعلوه فالضمير ههنا عائد على هؤلاء الذين لهم مناسك وطرائق أي هؤلاء إنما يفعلون هذا عن قدر الله وإرادته فلا تتأثر بمنازعتهم لك ولا يصرفك ذلك عما أنت عليه من الحق ولهذا قال \" وادع إلى ربك إنك لعلى هدى مستقيم \" أي طريق واضح مستقيم موصل إلى المقصود وهذه كقوله \" ولا يصدنك عن آيات الله بعد إذ أنزلت إليك وادع إلى ربك \"."
    },
    {
      "ayah": 68,
      "surah": 22,
      "text": "وقوله \"وإن جادلوك فقل الله أعلم بما تعملون\" كقوله \"وإن كذبوك فقل لي عملي ولكم عملكم أنتم بريئون مما أعمل وأنا بريء مما تعملون\" وقوله \"الله أعلم بما تعملون\" تهديد شديد ووعيد أكيد كقوله \"هو أعلم بما تفيضون فيه كفى به شهيدا بيني وبينكم\"."
    },
    {
      "ayah": 69,
      "surah": 22,
      "text": "ولهذا قال \" الله يحكم بينكم يوم القيامة فيما كنتم فيه تختلفون \" وهذه كقوله تعالى \" فلذلك فادع واستقم كما أمرت ولا تتبع أهواءهم وقل آمنت بما أنزل الله من كتاب \" الآية."
    },
    {
      "ayah": 7,
      "surah": 22,
      "text": "\" وأن الساعة آتية لا ريب فيها \" أي كائنة لا شك فيها ولا مرية \" وأن الله يبعث من في القبور \" أي يعيدهم بعد ما صاروا في قبورهم رمما ويوجدهم بعد العدم كما قال تعالى \" وضرب لنا مثلا ونسي خلقه قال من يحيي العظام وهي رميم ؟ قل يحيها الذي أنشأها أول مرة وهو بكل خلق عليم الذي جعل لكم من الشجر الأخضر نارا فإذا أنتم منه توقدون \" والآيات في هذا كثيرة وقال الإمام أحمد حدثنا بهز حدثنا حماد بن سلمة قال أنبأنا يعلى بن عطاء عن وكيع بن عدي عن عمه أبي رزين العقيلي واسمه لقيط بن عامر أنة قال يا رسول الله أكلنا يرى ربه عز وجل يوم القيامة وما آية ذلك في خلقه؟ فقال رسول الله صلى الله عليه وسلم \" أليس كلكم ينظر إلى القمر مخليا به ؟ \" قلنا بلى قال \" فالله أعظم \" قال قلت يا رسول الله كيف يحيي الله الموتى وما آية ذلك في خلقه؟ قال \" أما مررت بوادي أهلك ممحلا؟ \" قال بلى قال \" ثم مررت به يهتز خضرا \" قال بلى قال \" فكذلك يحيي الله الموتى وذلك آيته في خلقه \" ورواه أبو داود وابن ماجه من حديث حماد بن سلمة به ثم رواه الإمام أحمد أيضا حدثنا علي بن إسحاق أنبأنا ابن المبارك أنبأنا عبدالرحمن بن يزيد بن جابر عن سليمان بن موسى عن أبي رزين العقيلي قال: أتيت رسول الله صلى الله عليه وسلم فقلت يا رسول الله كيف يحيي الله الموتى ؟ قال \" أمررت بأرض من أرض قومك مجدبة ثم مررت بها مخصبة ؟ \" قال نعم قال \" كذلك النشور \" والله أعلم وقال ابن أبي حاتم حدثنا أبي حدثنا عيسى بن مرحوم حدثنا بكير بن السميط عن قتادة عن أبي الحجاج عن معاذ بن جبل قال: من علم أن الله هو الحق المبين وأن الساعة آتية لا ريب فيها وأن الله يبعث من في القبور دخل الجنة."
    },
    {
      "ayah": 70,
      "surah": 22,
      "text": "يخبر تعالى عن كمال علمه بخلقه وأنه محيط بما في السموات وما في الأرض فلا يعز عنه مثقال ذرة في الأرض ولا في السماء ولا أصغر من ذلك ولا أكبر وأنه تعالى علم الكائنات كلها قبل وجودها وكتب ذلك في كتابه اللوح المحفوظ كما ثبت في صحيح مسلم عن عبد الله بن عمرو قال: قال رسول الله - صلى الله عليه وسلم-: \" إن الله قدر مقادير الخلائق قبل خلق السموات والأرض بخمسين ألف سنة وكان عرشه على الماء \" وفي السنن من حديث جماعة من الصحابة أن رسول الله - صلى الله عليه وسلم - قال: \" أول ما خلق الله القلم قال له اكتب قال وما أكتب ؟ قال اكتب ما هو كائن فجرى القلم بما هو كائن إلي يوم القيامة \" وقال ابن أبي حاتم حدثنا أبو زرعة حدثنا ابن بكير حدثني عطاء بن دينار حدثني سعيد بن جبير قال: قال ابن عباس: \"خلق الله اللوح المحفوظ كمسيرة مائة عام وقال للقلم قبل أن يخلق الخلق وهو على العرش - تبارك وتعالى - اكتب فقال القلم وما أكتب قال علمي في خلقي إلى يوم الساعة فجرى القلم بما هو كائن في علم الله إلى يوم القيامة\" فذلك قوله للنبي صلى الله عليه وسلم: \" ألم تعلم أن الله يعلم ما في السماء والأرض \" وهذا من تمام علمه تعالى أنه علم الأشياء قبل كونها وقدرها وكتبها أيضا فما العباد عاملون قد علمه تعالى قبل ذلك على الوجه الذي يفعلونه فيعلم قبل الخلق أن هذا يطيع باختياره وهذا يعصي باختياره وكتب ذلك عنده وأحاط بكل شيء علما وهو سهل عليه يسير لديه ولهذا قال تعالى \" إن ذلك في كتاب إن ذلك على الله يسير \"."
    },
    {
      "ayah": 71,
      "surah": 22,
      "text": "يقول تعالى مخبرا عن المشركين فيما جهلوا وكفروا وعبدوا من دون الله ما لم ينزل به سلطانا يعني حجة وبرهانا كقوله \" ومن يدع مع الله إلها آخر لا برهان له به فإنما حسابه عند ربه إنه لا يفلح الكافرون \" ولهذا قال ههنا \" ما لم ينزل به سلطانا وما ليس لهم به علم \" أي ولا علم لهم فيما اختلقوه وائتفكوه وإنما هو أمر تلقوه عن آبائهم وأسلافهم بلا دليل ولا حجة وأصله مما سول لهم الشيطان زينه لهم ولهذا توعدهم تعالى بقوله \" وما للظالمين من نصير \" أي من ناصر ينصرهم من الله فيما يحل بهم من العذاب والنكال."
    },
    {
      "ayah": 72,
      "surah": 22,
      "text": "ثم قال \" وإذا تتلى عليهم آياتنا بينات \" أي وإذا ذكرت لهم آيات القرآن والحجج والدلائل الواضحات على توحيد الله وأنه لا إله إلا هو وأن رسله الكرام حق وصدق \" يكادون يسطون بالذين يتلون عليهم آياتنا \" أي يكادون يبادرون الذين يحتجون عليهم بالدلائل الصحيحة من القرآن ويبسطون إليهم أيديهم وألسنتهم بالسوء \" قل \" أي يا محمد لهؤلاء أفأنبئكم بشر من ذلكم النار وعدها الله الذين كفروا \" أي النار وعذابها ونكالها أشد وأشق وأطم وأعظم مما تخوفون به أولياء الله المؤمنين في الدنيا وعذاب الآخرة على صنيعكم هذا أعظم مما تنالون منهم إن نلتم بزعمكم وإرادتكم وقوله \" وبئس المصير \" أي وبئس النار مقيلا ومنزلا ومرجعا وموئلا ومقاما \" إنها ساءت مستقرا ومقاما \"."
    },
    {
      "ayah": 73,
      "surah": 22,
      "text": "يقول تعالى منبها على حقارة الأصنام وسخافة عقول عابديها \" يا أيها الناس ضرب مثل \" أي لما يعبده الجاهلون بالله المشركون به \" فاستمعوا له أي أنصتوا وتفهموا إن الذين تدعون من دون الله لن يخلقوا ذبابا ولو اجتمعوا له \" أي لو اجتمع جميع ما تعبدون من الأصنام والأنداد على أن يقدروا على خلق ذباب واحد ما قدروا على ذلك كما قال الإمام أحمد حدثنا أسود بن عامر حدثنا شريك عن عمارة بن القعقاع عن أبي زرعة عن أبي هريرة مرفوعا قال \" ومن أظلم ممن ذهب يخلق كخلقي فليخلقوا مثل خلقي ذرة أو ذبابة أو حبة \" وأخرجه صاحبا الصحيح من طريق عمارة عن أبي زرعة عن أبي هريرة عن النبي صلى الله عليه وسلم قال: \" قال الله عز وجل ومن أظلم ممن ذهب يخلق كخلقي فليخلقوا ذرة فليخلقوا شعيرة \" ثم قال تعالى أيضا \" وإن يسلبهم الذباب شيئا لا يستنقذوه منه \" أي هم عاجزون عن خلق ذباب واحد بل أبلغ من ذلك عاجزون عن مقاومته والانتصار منه لو سلبها شيئا من الذي عليها من الطيب ثم أرادت أن تستنقذه منه لما قدرت على ذلك هذا والذباب من أضعف مخلوقات الله وأحقرها ولهذا قال \" ضعف الطالب والمطلوب \" قال ابن عباس: الطالب الصنم والمطلوب الذباب واختاره ابن جرير وهو ظاهر السياق وقال السدي وغيره الطالب \" العابد والمطلوب \" الصنم."
    },
    {
      "ayah": 74,
      "surah": 22,
      "text": "ثم قال ما قدروا الله حق قدره أي ما عرفوا قدر الله وعظمته حين عبدوا معه غيره من هذه التي لا تقاوم الذباب لضعفها وعجزها \" إن الله لقوي عزيز \" أي هو القوي الذي بقدرته وقوته خلق كل شيء وهو الذي يبدأ الخلق ثم يعيده وهو أهون عليه \" إن بطش ربك لشديد إنه هو يبدئ ويعيد\" \" إن الله هو الرزاق ذو القوة المتين\" وقوله \" عزيز \" أي قد عز كل شيء فقهره وغلبه فلا يمانع ولا يغالب لعظمته وسلطانه وهو الواحد القهار."
    },
    {
      "ayah": 75,
      "surah": 22,
      "text": "يخبر تعالى أنه يختار من الملائكة رسلا فيما يشاء من شرعه وقدره ومن الناس لإبلاغ رسالاته \" إن الله سميع بصير \" أي سميع لأقوال عباده بصير بهم عليم بمن يستحيي ذلك منهم كما قال \" الله أعلم حيث يجعل رسالته."
    },
    {
      "ayah": 76,
      "surah": 22,
      "text": "وقوله \" يعلم ما بين أيديهم وما خلفهم وإلى الله ترجع الأمور \" أي يعلم ما يفعل برسله فيما أرسلهم به فلا يخفى عليه شيء من أمورهم كما قال \" عالم الغيب فلا يظهر على غيبه أحدا\" - إلى قوله - وأحصى كل شيء عددا \" فهو سبحانه رقيب عليهم شهيد على ما يقال لهم حافظ لهم ناصر لجنابهم \" يا أيها الرسول بلغ ما أنزل إليك من ربك وإن تفعل فما بلغت رسالته والله يعصمك من الناس \" الآية."
    },
    {
      "ayah": 77,
      "surah": 22,
      "text": "اختلف الأئمة- رحمهم الله - في هذه السجدة الثانية من سورة الحج هل هو مشروع السجود فيها أم لا ؟ على قولين وقد قدمنا عند الأولى حديث عقبه بن عامر عن النبي صلى الله عليه وسلم \" فضلت سورة الحج بسجدتين فمن لم يسجدهما فلا يقرأهما \"."
    },
    {
      "ayah": 78,
      "surah": 22,
      "text": "وقوله \"وجاهدوا في الله حق جهاده\" أي بأموالكم وألسنتكم وأنفسكم كما قال تعالى \"اتقوا الله حق تقاته \" وقوله \" هو اجتباكم \" أي يا هذه الأمة الله اصطفاكم واختاركم على سائر الأمم وفضلكم وشرفكم وخصكم بأكرم رسول وأكمل شرع \"وما جعل عليكم في الدين من حرج\" أي ما كلفكم ما لا تطيقون وما ألزمكم بشيء يشق عليكم إلا جعل الله لكم فرجا ومخرجا فالصلاة التي أكبر أركان الإسلام بعد الشهادتين تجب في الحضر أربع وفي السفر تقصر إلى اثنتين وفي الخوف يصليها بعض الأئمة ركعة كما ورد به الحديث وتصلى رجالا وركبانا مستبلي القبلة وغير مستقبليها وكذا في الناقلة في السفر إلى القبلة وغيرها والقيام فيها يسقط لعذر المرض فيصليها المريض جالسا فإن لم يستطع فعلى جنبه إلى غير ذلك من الرخص والتخفيفات في سائر الفرائض والواجبات ولهذا قال عليه السلام \" بعثت بالحنيفية السمحة \" وقال لمعاذ وأبي موسى حين بعثهما أميرين إلى اليمن \" بشرا ولا تنفرا ويسرا ولا تعسرا \" والأحاديث في هذا كثيرة ولهذا قال ابن عباس في قوله \"وما جعل عليكم في الدين من حرج\" يعني من ضيق وقوله \"ملة أبيكم إبراهيم\" قال ابن جرير نصب على تقدير \"ما جعل عليكم في الدين من حرج\" أي من ضيق بل وسعه عليكم كملة أبيكم إبراهيم قال ويحتمل أنه منصوب على تقدير الزموا ملة أبيكم إبراهيم \"قلت\" وهذا المعنى في هذه الآية كقوله \"قل إنني هداني ربي إلى صراط مستقيم دينا قيما ملة إبراهيم حنيفا\" الآية وقوله \" هو سماكم المسلمين من قبل وفي هذا \" قال الإمام عبدالله ابن المبارك عن ابن جريج عن عطاء عن ابن عباس في قوله \" هو سماكم المسلمين من قبل \":قال الله عز وجل وكذا قال مجاهد وعطاء والضحاك والسدي ومقاتل ابن حيان وقتادة وقال عبد الرحمن بن زيد بن أسلم \" هو سماكم المسلمين من قبل \" يعني إبراهيم وذلك لقوله \" ربنا واجعلنا مسلمين لك ومن ذريتنا أمة مسلمة لك \" قال ابن جرير وهذا لا وجه له لأنه من المعلوم أن إبراهيم لم يسم هذه الأمة في القرآن مسلمين وقد قال الله تعالى هو سماكم المسلمين من قبل وفي هذا \" قال مجاهد: الله سماكم المسلمين من قبل في الكتب المتقدمة وفي الذكر \" وفي هذا \" يعني القرآن وكذا قال غيره \" قلت \"وهذا هو الصواب لأنه تعالى قال \" هو اجتباكم وما جعل عليكم في الدين من حرج \" ثم حثهم وأغراهم إلى ما جاء به الرسول صلوات الله وسلامه عليه بأنه ملة أبيهم الخليل ثم ذكر منته تعالى على هذه الأمة بما نوه به من ذكرها والثناء عليها في سالف الدهر وقديم الزمان في كتب الأنبياء يتلى على الأحبار والرهبان فقال هو سماكم المسلمين من قبل \" أي من قبل هذا القرآن \" وفي هذا \" روى النسائي عند تفسيره هذه الآية أنبأنا هشام بن عمار حدثنا محمد بن شعيب أنبأنا معارية بن سلام أن أخاه زيد بن سلام أخبره عن أبي سلام أنه أخبره قال أخبرني الحارث الأشعري عن رسول الله صلى الله عليه وسلم قال \" من دعا بدعوى الجاهلية فإنه من جثي جهنم \" قال رجل يا رسول الله وإن صام وصلى قال \" نعم وإن صام وصلى \" فادعوا بدعوة الله التي سماكم بهـا المسلمين المؤمنين عباد الله وقد قدمنا هذ الحديث بطوله عند تقسيم قوله \" يا أيها الناس اعبدوا ربكم الذي خلقكم والذين من قبلكم لعلكم تتقون \" من سورة البقرة ولهذا قال \" ليكون الرسول شهيدا عليكم وتكونوا شهداء على الناس \" أي إنما جعلناكم هكذا أمة وسطا عدولا خيارا مشهودا بعدالتكم عند جميع الأمم لتكونوا يوم القيامة شهداء على الناس \" لأن جميع الأمم معترفة يومئذ بسيادتها وفضلها على كل أمة سواها فلهذا تقبل شهادتهم عليهم يوم القيامة في أن الرسل بلغتهم رسالة ربهم والرسول يشهد على هذه الأمة أنه بلغها ذلك وقد تقدم الكلام على هذا عند قوله وكذلك جعلناكم أمة وسطا لتكونوا شهداء على الناس ويكون الرسول عليكم شهيدا\" وذكرنا حديث نوح وأمته بما أغنى عن إعادته وقوله \" فأقيموا الصلاة وآتوا الزكاة \" أي قابلوا هذه النعمة العظيمة بالقيام بشكرها فأدوا حق الله عليكم في أداء ما افترض وطاعة ما أوجب وترك ما حرم ومن أهم ذلك إقام الصلاة وإيتاء الزكاة وهو الإحسان إلى خلق الله بما أوجب للفقير على الغني من إخراج جزء نزر من ماله في السنة للضعفاء والمحاويج كما تقدم بيانه وتفصيله في آية الزكاة من سورة التوبة وقوله واعتصموا بالله\" أي اعتضدوا بالله واستعينوا به وتوكلوا عليه وتأيدوا به\" هو مولاكم \" أي حافظكم وناصركم ومظفركم على أعدائكم\" فنعم المولى ونعم النصير \" يعني نعم الولي ونعم الناصر من الأعداء قال وهيب بن الورد \" يقول الله تعالى: ابن آدم اذكرني إذا غضبت أذكرك إذا غضبت فلا أمحقك فيمن أمحق وإذا ظلمت فاصبر وارض بنصرتي فإن نصرتي لك خير من نصرتك لنفسك\" رواه ابن أبي حاتم والله أعلم آخر تفسير سورة الحج ولله الحمد والمنة."
    },
    {
      "ayah": 8,
      "surah": 22,
      "text": "لما ذكر تعالى حال الضلال الجُهال المقلدين في قوله \" ومن الناس من يجادل في الله بغير علم ولا هدى ويتبع كل شيطان مريد \" ذكر في هذه الدعاة إلى الضلالة من رءوس الكفر والبدع فقال \" ومن الناس من يجادل في الله بغير علم ولا هدى ولا كتاب منير \" أي بلا عقل صحيح ولا نقل صريح بل بمجرد الرأي والهوى."
    },
    {
      "ayah": 9,
      "surah": 22,
      "text": "وقوله \" ثاني عطفه \" قال ابن عباس وغيره مستكبر عن الحق إذا دعى إليه وقال مجاهد وقتادة ومالك عن زيد بن أسلم \" ثاني عطفه \" أي لاوي عطفه وهي رقبته يعني يعرض عما يدعى إليه من الحق ويثني رقبته استكبارا كقوله تعالى \" وفي موسى إذ أرسلناه إلى فرعون بسلطان مبين فتولى بركنه \" الآية وقال تعالى \" وإذا قيل لهم تعالوا إلى ما أنزل الله وإلى الرسول رأيت المنافقين يصدون عنك صدودا \" وقال تعالى \" وإذا قيل لهم تعالوا يستغفر لكم رسول الله لووا رءوسهم ورأيتهم يصدون وهم مستكبرون \" وقال لقمان لابنه \" ولا تصعر خدك للناس \" أي تميله عنهم استكبارا عليهم وقال تعالى \" وإذا تتلى عليه آياتنا ولى مستكبرا \" الآية وقوله \" ليضل عن سبيل الله \" قال بعضهم هذه \"لام العاقبة\" لأنه قد لا يقصد ذلك ويحتمل أن تكون \"لام التعليل\" ثم إما أن يكون المراد بها المعاندون أو يكون المراد بها أن هذا الفاعل لهذا إنما جبلناه على هذا الخلق الدنيء لنجعله ممن يضل عن سبيل الله. ثم قال تعالى \" له في الدنيا خزي \" وهو الإهانة والذل كما أنه لما استكبر عن آيات الله لقاه الله المذلة في الدنيا وعاقبه فيها قبل الآخرة لأنها أكبر همه ومبلغ علمه \" ونذيقه يوم القيامة عذاب الحريق \"."
    }
  ]
}
