{
  "ayahs": [
    {
      "ayah": 1,
      "surah": 23,
      "text": "قال الإمام أحمد حدثنا عبد الرزاق أخبرني يونس بن سليم قال أملى علي يونس بن يزيد الأيلي عن ابن شهاب عن عروة بن الزبير عن عبد الرحمن بن عبد القاري قال سمعت عمر بن الخطاب يقول كان إذا نزل على رسول الله صلى الله عليه وسلم الوحي يسمع عند وجهه كدوي النحل فلبثنا ساعة فاستقبل القبلة ورفع يديه وقال \" اللهم زدنا ولا تنقصنا وأكرمنا ولا تهنا وأعطنا ولا تحرمنا وآثرنا ولا تؤثر علينا وارض عنا وأرضنا - ثم قال - لقد أنزل علي عشر آيات من أقامهن دخل الجنة \" ثم قرأ \" قد أفلح المؤمنون \" حتى ختم العشر ورواه الترمذي في تفسيره والنسائي في الصلاة من حديث عبد الرزاق به وقال الترمذي منكر لا نعرف أحدا رواه غير يونس بن سليم ويونس لا نعرفه وقال النسائي في تفسيره أنبأنا قتيبة بن سعيد حدثنا جعفر عن أبي عمران عن يزيد بن بابنوس قال: قلنا لعائشة أم المؤمنين كيف كان خلق رسول الله صلى الله عليه وسلم ؟ قالت: كان خلق رسول الله صلى الله عليه وسلم القرآن فقرأت \" قد أفلح المؤمنون - حتى انتهت إلى - والذين هم على صلواتهم يحافظون \" قالت هكذا كان خلق رسول الله صلى الله عليه وسلم وقد روي عن كعب الأحبار ومجاهد وأبي العالية وغيرهم لما خلق الله جنة عدن وغرسها بيده نظر إليها وقال لها تكلمي فقالت \" قد أفلح المؤمنون \" قال كعب الأحبار لما أعد لهم من الكرامة فيها وقال أبو العالية فأنزل الله ذلك في كتابه وقد روي ذلك عن أبي سعيد الخدري مرفوعا فقال أبو بكر البزار حدثنا محمد بن المثنى حدثنا المغيرة بن مسلمة حدثنا وهيب عن الجريري عن أبي نضرة عن أبي سعيد قال: خلق الله الجنة لبنة من ذهب ولبنة من فضة وغرسها وقال لها تكلمي فقالت \" قد أفلح المؤمنون \" فدخلتها الملائكة فقالت طوبى لك منزل الملوك ثم قال وحدثنا بشر بن آدم وحدثنا يونس بن عبيدالله العمري حدثنا عدي بن الفضل حدثنا الجريري عن أبي نضرة عن أبي سعيد عن النبي صلى الله عليه وسلم قال \" خلق الله الجنة لبنة من ذهب ولبنة من فضة وملاطها المسك - قال البزار ورأيت في موضع آخر في هذا الحديث - حائط الجنة لبنة ذهب ولبنة فضة وملاطها المسك فقال لها تكلمي فقالت \" قد أفلح المؤمنون \" فقالت الملائكة طوبى لك منزل الملوك \" ثم قال البزار لا نعلم أحدا رفعه إلى عدي بن الفضل وليس هو بالحافظ وهو شيخ متقدم الموت وقال الحافظ أبو القاسم الطبراني حدثنا أحمد بن علي حدثنا هشام بن خالد حدثنا بقية عن ابن جريج عن عطاء عن ابن عباس قال: قال رسول الله صلى الله عليه وسلم \" لما خلق الله جنة عدن خلق فيها ما لا عين رأت ولا أذن سمعت ولا خطر على قلب بشر ثم قال لها تكلمي فقالت \" قد أفلح المؤمنون \" بقية عن الحجازيين ضعيف وقال الطبراني حدثنا محمد بن عثمان بن أبي شيبة حدثنا منجاب بن الحارث حدثنا حماد بن عيسى العبسي عن إسماعيل السدي عن أبي صالح عن ابن عباس يرفعه \" لما خلق الله جنة عدن بيده ودلى فيها ثمارها وشق فيها أنهارها ثم نزل إليها فقال \" قد أفلح المؤمنون \" قال وعزتي وجلالي لا يجاورني فيك بخيل \" وقال أبو بكر بن أبي الدنيا: حدثنا محمد بن المثنى البزار حدثنا محمد بن زياد الكلبي حدثنا يعيش بن حسين عن سعيد ابن أبي عروبة عن قتادة عن أنس رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم \" خلق الله جنة عدن بيده لبنة من درة بيضاء ولبنة من ياقوتة حمراء ولبنة من زبرجدة خضراء ملاطها المسك وحصباؤها اللؤلؤ وحشيشها الزعفران ثم قال لها انطقي قالت \" قد أفلح المؤمنون \" فقال الله وعزتي وجلالي لا يجاورني فيك بخيل \"ثم تلا رسول الله صلى الله عليه وسلم \" ومن يوق شح نفسه فأولئك هم المفلحون \" وقوله تعالى \" قد أفلح المؤمنون \" أي قد فازوا وسعدوا وحصلوا على الفلاح وهم المؤمنون المتصفون بهذه الأوصاف."
    },
    {
      "ayah": 10,
      "surah": 23,
      "text": "ولما وصفهم تعالى بالقيام بهذه الصفات الحميدة والأفعال الرشيدة \" قال أولئك هم الوارثون الذين يرثون الفردوس هم فيها خالدون\" وثبت في الصحيحين أن رسول الله صلى الله عليه وسلم قال: \" إذا سألتم الله الجنة فاسألوه الفردوس فإنه أعلى الجنة وأوسط الجنة ومنه تفجر أنهار الجنة وفوقه عرش الرحمن \"وقال ابن أبي حاتم حدثنا أحمد بن سنان حدثنا أبو معاوية حدثنا الأعمش عن أبي صالح عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم \" ما منكم من أحد إلا وله منزلان منزل في الجنة ومنزل في النار فإن مات ودخل النار ورث أهل الجنة منزله \"فذلك قوله أولئك هم الوارثون وقال ابن جريج عن الليث عن مجاهد \" أولئك الوارثون قال ما من عبد إلا وله منزلان منزل في الجنة ومنزل في النار فأما المؤمن فيبني بيته الذي في الجنة ويهدم بيته الذي في النار وأما الكافر فيهدم بيته الذي في الجنة ويبني بيته الذي في النار وروي عن سعيد بن جبير نحو ذلك فالمؤمنون يرثون منازل الكفار لأنهم خلقوا لعبادة الله تعالى وحده لا شريك له فلما قام هؤلاء المؤمنون بما وجب عليهم من العبادة وترك أولئك ما أمروا به مما خلقوا له أحرز هؤلاء نصيب أولئك لو كانوا أطاعوا ربهم عز وجل بل أبلغ من هذا أيضا وهو ما ثبت في صحيح مسلم عن أبي بردة بن أبي موسى عن أبيه عن النبي صلى الله عليه وسلم قال \" يجيء ناس يوم القيامة من المسلمين بذنوب أمثال الجبال فيغفرها الله لهم ويضعها على اليهود والنصارى \"وفي لفظ قوله قال رسول الله صلى الله عليه وسلم: \" إذا كان يوم القيامة دفع الله لكل مسلم يهوديا أو نصرانيا فيقال هذا فكاكك من النار \"فاستحلف عمر ابن عبد العزيز أبا بردة بالله الذي لا إله إلا هو ثلاث مرات أن أباه حدثه عن رسول الله صلى الله عليه وسلم بذلك قال فحلف له قلت وهذه الآية كقوله تعالى \" تلك الجنة التي نورث من عبادنا من كان تقيا \" وكقوله \" وتلك الجنة التي أورثتموها بما كنتم تعملون وقد قال مجاهد وسعيد بن جبير الجنة بالرومية هي الفردوس وقال بعض السلف لا يسمى البستان الفردوس إلا إذا كان فيه عنب فالله أعلم."
    },
    {
      "ayah": 100,
      "surah": 23,
      "text": "يخبر تعالى عن حال المحتضر عند الموت من الكافرين أو المفرطين في أمر الله تعالى وقيلهم عند ذلك وسؤالهم الرجعة إلى الدنيا ليصلح ما كان أفسده في مدة حياته ولهذا قال \" رب ارجعون لعلي أعمل صالحا فيما تركت كلا \" كما قال تعالى \" وأنفقوا مما رزقناكم من قبل أن يأتي أحدكم الموت - إلى قوله - والله خبير بما تعملون \" وقال تعالى \" وأنذر الناس يوم يأتيهم العذاب - إلى قوله - ما لكم من زوال \" وقال تعالى \" يوم يأتي تأويله يقول الذين نسوه من قبل قد جاءت رسل ربنا بالحق فهل لنا من شفعاء فيشفعوا لنا أو نرد فنعمل غير الذي كنا نعمل \" وقال تعالى \" ولو ترى إذ المجرمون ناكسوا رءوسهم عند ربهم ربنا أبصرنا وسمعنا فارجعنا نعمل صالحا إنا موقنون \" وقال تعالى \" ولو ترى إذ وقفوا على النار فقالوا يا ليتنا نرد ولا نكذب بآيات ربنا - إلى قوله - وإنهم لكاذبون \" وقال تعالى \" وترى الظالمين لم رأوا العذاب يقولون هل إلى مرد من سبيل \" وقال تعالى \" قالوا ربنا أمتنا اثنتين وأحييتنا اثنتين فاعترفنا بذنوبنا فهل إلى خروج من سبيل \" والآية بعدها. وقال تعالى \" وهم يصطرخون فيها ربنا أخرجنا نعمل صالحا غير الذي كنا نعمل أو لم نعمركم ما يتذكر فيه من تذكر وجاءكم النذير فذوقوا فما للظالمين من نصير \" فذكر تعالى أنهم يسألون الرجعة فلا يجابون عند الإحتضار ويوم النشور ووقت العرض على الجبار وحين يعرضون على النار وهم في غمرات عذاب الجحيم. وقوله ههنا \" كلا إنها كلمة هو قائلها \" كلا حرف ردع وزجر أي لا نجيبه إلى ما طلب ولا نقبل منه. وقوله تعالى \" إنها كلمة هو قائلها \" قال عبد الرحمن بن زيد بن أسلم: أي لا بد أن يقولها لا محالة كل محتضر ظالم ويحتمل أن يكون ذلك علة لقوله كلا أي لأنها كلمة أي سؤاله الرجوع ليعمل صالحا هو كلام منه وقول لا عمل معه ولو رد لما عمل صالحا ولكان يكذب في مقالته هذه كما قال تعالى \" ولو ردوا لعادوا ما نهوا عنه وإنهم لكاذبون \" قال قتادة: والله ما تمنى أن يرجع إلى أهل ولا إلى عشيرة ولا بأن يجمع الدنيا ويقضي الشهوات ولكن تمنى أن يرجع فيعمل بطاعة الله عز وجل فرحم الله امرأ عمل فيما يتمناه الكافر إذا رأى العذاب إلى النار وقال محمد بن كعب القرظي \" حتى إذا جاء أحدهم الموت قال رب ارجعون لعلي أعمل صالحا فيما تركت \" قال فيقول الجبار \" كلا إنها كلمة هو قائلها \" وقال عمر بن عبدالله مولى غفرة: إذا قال الكافر \" رب ارجعون لعلي أعمل صالحا \" يقول الله تعالى كلا كذبت وقال قتادة في قوله تعالى \" حتى إذا جاء أحدهم الموت \" قال كان العلاء بن زياد يقول: لينزلن أحدكم نفسه أنه قد حضره الموت فاستقال ربه فأقاله فليعمل بطاعة الله تعالى. وقال قتادة: والله ما تمني إلا أن يرجع فيعمل بطاعة الله فانظروا أمنية الكافر المفرط فاعملوا بها ولا قوة إلا بالله. وعن محمد بن كعب القرظي نحوه. وقال محمد بن أبي حاتم حدثنا أبي حدثنا أحمد بن يوسف حدثنا فضيل - يعني ابن عياض - عن ليث عن طلحة بن مصرف عن أبي حازم عن أبي هريرة قال: إذا وضع - يعني الكافر- في قبره فيرى مقعده من النار قال فيقول رب ارجعون أتوب وأعمل صالحا قال فيقال قد عمرت ما كنت معمرا قال فيضيق عليه قبره ويلتئم فهو كالمنهوش ينام ويفزع تهوى إليه هو أم الأرض وحياتها وعقاربها. وقال أيضا حدثنا أبي حدثنا عمر بن علي حدثني سلمة بن تمام حدثنا علي بن زيد عن سعيد بن المسيب عن عائشه رضي الله عنها أنها قالت: ويل لأهل المعاصي من أهل القبور تدخل عليهم في قبورهم حيات سود أو دهم حية عند رأسه وحيه عند رجليه يقرصانه حتى يلتقيا في وسطه فذلك العذاب في البرزخ الذي قال الله تعالى \" ومن ورائهم برزخ إلى يوم يبعثون \".وقال أبو صالح وغيره في قوله تعالى \" ومن ورائهم \" يعني أمامهم. وقال مجاهد: البرزخ الحاجز ما بين الدنيا والآخرة. وقال محمد بن كعب: البرزخ ما بين الدنيا والآخرة ليسوا مع أهل الدنيا يأكلون ويشربون ولا مع أهل الآخرة يجاوزون بأعمالهم. وقال أبو صخر: البرزخ المقابر لا هم في الدنيا ولا هم في الآخرة فهم مقيمون إلى يوم يبعثون. وفي قوله تعالى \" ومن ورائهم برزخ \" تهديد لهؤلاء المحتضرين من الظلمة بعذاب البرزخ كما قال تعالى \" من ورائهم جهنم \" وقال تعالى \" ومن وراءه عذاب غليظ \" وقوله تعالى \" إلى يوم يبعثون \" أي يستمر به العذاب إلى يوم البعث كما جاء في الحديث \" فلا يزال معذبا فيها \" أي في الأرض."
    },
    {
      "ayah": 101,
      "surah": 23,
      "text": "يخبر تعالى أنه إذا نفخ في الصور نفخة النشور وقام الناس من القبور \" فلا أنساب بينهم يومئذ ولا يتساءلون \" أي لا تنفع الأنساب يومئذ ولا يرثي والد لولده ولا يلوي عليه قال الله تعالى \" ولا يسأل حميم حميما يبصرونهم \" أي لا يسأل القريب عن قريبه وهو يبصره ولو كان عليه من الأوزار ما قد أثقل ظهره وهو كان أعز الناس عليه في الدنيا ما التفت إليه ولا حمل عنه وزن جناح بعوضة قال الله تعالى \" يوم يفر المرء من أخيه وأمه وأبيه وصاحبته وبنيه \" الآية وقال ابن مسعود: إذا كان يوم القيامة جمع الله الأولين والآخرين ثم نادى مناد: ألا من كان له مظلمة فليجئ فليأخذ حقه - قال - فيفرح المرء أن يكون له الحق على والده أو ولده أو زوجته وإن كان صغيرا ; ومصداق ذلك في كتاب الله قال الله تعالى \" فإذا نفخ في الصور فلا أنساب بينهم يومئذ ولا يتساءلون \" رواه ابن أبي حاتم. وقال الإمام أحمد حدثنا أبو سعيد مولى بني هاشم حدثنا عبدالله بن جعفر حدثتنا أم بكر بنت المسور بن مخرمة عن عبدالله بن أبي رافع عن المسور- هو ابن مخرمة - رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم \" فاطمة بضعة مني يغيظني ما يغيظها وينشطني ما ينشطها وإن الانساب تنقطع يوم القيامة إلا نسبي وسببي وصهري \"وهذا الحديث له أصل في الصحيحين عن المسور بن مخرمة أن رسول الله صلى الله عليه وسلم قال \" فاطمة بضعة مني يريبني ما يريبها ويؤذيني ما آذاها \"وقال الإمام أحمد حدثنا أبو عامر حدثنا زهير عن عبدالله بن محمد عن حمزة بن أبي سعيد الخدري عن أبيه قال: سمعت رسول الله صلى الله عليه وسلم يقول على هذا المنبر \" ما بال رجال يقولون إن رحم رسول الله صلى الله عليه وسلم لا تنفع قومه؟ بلى والله إن رحمي موصولة في الدنيا والآخرة وإني أيها الناس فرط لكم إذا جئتم \"قال رجل يا رسول الله أنا فلان بن فلان \" فأقول لهم: أما النسب فقد عرفت ولكنكم أحدثتم بعدي وارتددتم القهقرى \"وقد ذكرنا في مسند أمير المؤمنين عمر بن الخطاب من طرق متعددة عنه رضي الله عنه أنه لما تزوج أم كلثوم بنت علي بن أبي طالب \" قال: أما والله ما بي إلا أني سمعت رسول الله صلى الله عليه وسلم يقول \" كل سبب ونسب فإنه منقطع يوم القيامة إلا سببي ونسبي \"رواه الطبراني والبزار الهيثم بن كليب والبيهقي والحافظ الضياء في المختارة وذكر أنه أصدقها أربعين ألفا إعظاما وإكراما رضي الله عنه فقد روى الحافظ ابن عساكر في ترجمة أبي العاص بن الربيع زوج زينب بنت رسول الله صلى الله عليه وسلم من طريق أبي القاسم البغوي حدثنا سليمان بن عمر بن الأقطع حدثنا إبراهيم بن عبد السلام عن إبراهيم بن يزيد عن محمد بن عباد بن جعفر سمعت ابن عمر يقول: قال رسول الله صلى الله عليه وسلم \" كل نسب وصهر ينقطع يوم القيامة إلا نسبي وصهري \"وروي فيها من طريق عمار بن سيف عن هشام بن عروة عن أبيه عن عبدالله بن عمرو مرفوعا \" سألت ربي عز وجل أن لا أتزوج إلى أحد من أمتي ولا يتزوج إلى أحد منهم إلا كان معي في الجنة فأعطاني ذلك \"ومن حديث عمار بن سيف عن إسماعيل عن عبدالله بن عمرو."
    },
    {
      "ayah": 102,
      "surah": 23,
      "text": "وقوله تعالى \" فمن ثقلت موازينه فأولئك هم المفلحون \" أي من رجحت حسناته على سيئاته ولو بواحدة قاله ابن عباس \" فأولئك هم المفلحون \" أي الذين فازوا فنجوا من النار وأدخلوا الجنة وقال ابن عباس: أولئك الذين فازوا بما طلبوا ونجو من شر ما منه هربوا."
    },
    {
      "ayah": 103,
      "surah": 23,
      "text": "\" ومن خفت موازينه \" أي ثقلت سيئاته على حسناته \" فأولئك الذين خسروا أنفسهم \" أي خابوا وهلكوا وفازوا بالصفقة الخاسرة وقال الحافظ أبو بكر البزار حدثنا إسماعيل بن أبي الحارث حدثنا داود بن المحبر حدثنا صالح المري عن ثابت البناني وجعفر بن زيد ومنصور بن زاذان عن أنس بن مالك يرفعه قال: إن لله ملكا موكلا بالميزان فيؤتى بابن آدم فيوقف بين كفتي الميزان فإن ثقل ميزانه نادى ملك بصوت يسمعه الخلائق سعد فلان سعادة لا يشقى بعدها أبدا وإن خف ميزانه نادى ملك بصوت يسمع الخلائق شقي فلان شقاوة لا يسعد بعدها أبدا إسناده ضعيف فإن داود بن المحبر ضعيف متروك ولهذا قال تعالى \" في جهنم خالدون \" أي ماكثون فيها دائمون مقيمون فلا يظعنون."
    },
    {
      "ayah": 104,
      "surah": 23,
      "text": "\" تلفح وجوههم النار \" كما قال تعالى \" وتغشى وجوههم النار \" وقال تعالى \" لو يعلم الذين كفروا حين لا يكفون عن وجوههم النار ولا عن ظهورهم \" الآية وقال ابن أبي حاتم حدثنا أبي حدثنا فروة بن أبي المغراء حدثنا محمد بن سليمان الأصبهاني عن أبي سنان ضرار بن مرة عن عبدالله بن أبي الهذيل عن أبي هريرة عن النبي صلى الله عليه وسلم قال: إن جهنم لما سيق لها أهلها تلقاهم لهبها ثم تلفحهم لفحة فلم يبق لهم لحم إلا سقط على العرقوب وقال ابن مردوية حدثنا أحمد بن محمد بن يحيى القزاز حدثنا الخضر بن علي بن يونس القطان حدثنا عمرو بن أبي الحارث بن الخضر القطان حدثنا سعيد بن سعيد المقبري عن أخيه عن أبيه عن أبي الدرداء رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم في قول الله تعالى \" تلفح وجوههم النار \" قال تلفحهم لفحة تسيل لحومهم على أعقابهم وقوله تعالى \" وهم فيها كالحون \" قال علي بن أبي طلحة عن ابن عباس يعني عابسون وقال الثوري عن أبي إسحاق عن أبي الأحوص عن عبدالله بن مسعود \" وهم فيها كالحون \" قال ألم تر إلى الرأس المشيط الذي قد بدا أسنانه وقلصت شفتاه. وقال الإمام أحمد أخبرنا علي بن إسحاق أخبرنا عبدالله هو ابن المبارك رحمه الله أخبرنا سعيد بن يزيد عن أبي السمح عن أبي الهيثم عن أبي سعيد الخدري عن النبي صلى الله عليه وسلم قال: \" وهم فيها كالحون \" قال- تشويه النار فتقلص شفته العليا حتى تبلغ وسط رأسه. وتسترخي شفته السفلى حتى تبلغ سرته\" ورواه الترمذي عن سويد بن نصر عن عبدالله بن المبارك به وقال حسن غريب."
    },
    {
      "ayah": 105,
      "surah": 23,
      "text": "هذا تقريع من الله وتوبيخ لأهل النار على ما ارتكبوه من الكفر والمآثم والمحارم والعظائم التي أوبقتهم في ذلك فقال تعالى \" ألم تكن آياتي تتلى عليكم فكنتم بها تكذبون \" أي قد أرسلت إليكم الرسل وأنزلت عليكم الكتب وأزلت شبهكم ولم يبق لكم حجة كما قال تعالي \" لئلا يكون للناس على الله حجة بعد الرسل \" وقال تعالى \" وما كنا معذبين حتى نبعث رسولا \" وقال تعالى \" كلما ألقي فيها فوج سألهم خزنتها ألم يأتكم نذير- إلى قوله - فسحقا لأصحاب السعير \"."
    },
    {
      "ayah": 106,
      "surah": 23,
      "text": "ولهذا قالوا \" ربنا غلبت علينا شقوتنا وكنا قوما ضالين \" أي قد قامت علينا الحجة ولكن كنا أشقى من أن ننقاد لها ونتبعها فضللنا عنها ولم نرزقها."
    },
    {
      "ayah": 107,
      "surah": 23,
      "text": "ثم قالوا \" ربنا أخرجنا منها فإن عدنا فإنا ظالمون \" أي ارددنا إلى الدنيا فإن عدنا إلى ما سلف منا فنحن ظالمون مستحقون للعقوبة كما قال \" فاعترفنا بذنوبنا فهل إلى خروج من سبيل - إلى قوله - فالحكم لله العلي الكبير \" أي لا سبيل إلى الخروج لأنكم كنتم تشركون بالله إذا وحده المؤمنون."
    },
    {
      "ayah": 108,
      "surah": 23,
      "text": "هذا جواب من الله تعالى للكفار إذا سألوا الخروج من النار والرجعة إلى هذه الدار. يقول \" اخسئوا فيها \" أي امكثوا فيها صاغرين مهانين أذلاء \" ولا تكلمون \" أي لا تعودوا إلى سؤالكم هذا فإنه لا جواب لكم عندي. قال العوفي عن ابن عباس: \" اخسئوا فيها ولا تكلمون \" قال هذا قول الرحمن حين انقطع كلامهم منه. وقال ابن أبي حاتم حدثنا أبي حدثنا عبدة بن سليمان المروزي حدثنا عبدالله بن المبارك عن سعيد بن أبي عروبة عن قتادة عن أبي أيوب عن عبدالله بن عمرو قال: إن أهل جهنم يدعون مالكا فلا يجيبهم أربعين عاما ثم يرد عليهم إنكم ماكثون قال هانت دعوتهم والله على مالك ورب مالك ثم يدعون ربهم فيقولون \" ربنا غلبت علينا شقوتنا وكنا قوما ضالين ربنا أخرجنا منها فإن عدنا فإنا ظالمون \" قال فيسكت عنهم قدر الدنيا مرتين ثم يرد عليهم \" اخسئوا فيها ولا تكلمون \" قال فوالله ما نبس القوم بعدها بكلمة واحدة وما هو إلا الزفير والشهيق في نار جهنم قال فتشبهت أصواتهم بأصوات الحمير أولها زفير وآخرها شهيق وقال ابن أبي حاتم أيضا حدثنا أحمد بن سنان حدثنا عبد الرحمن بن مهدى حدثنا سفيان عن سلمة بن كهيل حدثنا أبو الزعراء قال: قال عبدالله بن مسعود إذا أراد الله تعالى أن لا يخرج منهم أحدا يعني من جهنم غير وجوههم وألوانهم فيجيء الرجل من المؤمنين فيشفع فيقول يا رب فيقول الله من عرف أحدا فليخرجه فيجيء الرجل من المؤمنين فينظر فلا يعرف أحدا فيناديه الرجل يا فلان أنا فلان فيقول ما أعرفك قال فعند ذلك يقولون \" ربنا أخرجنا منها فإن عدنا فإنا ظالمون \" فعند ذلك يقول الله تعالى \" اخسئوا فيها ولا تكلمون \" فإذا قال ذلك أطبقت عليهم النار فلا يخرج منهم أحد ثم قال تعالى مذكرا لهم بذنوبهم في الدنيا وما كانوا يستهزئون بعباده المؤمنين وأوليائه."
    },
    {
      "ayah": 109,
      "surah": 23,
      "text": "فقال تعالى \" إنه كان فريق من عبادي يقولون ربنا آمنا فاغفر لنا وارحمنا وأنت خير الراحمين فاتخذتموهم سخريا \" أي فسخرتم منهم في دعائهم إياي وتضرعهم إلي \" حتى أنسوكم ذكري \" أي حملكم بغضهم علي أن نسيتم معاملتي \" وكنتم منهم تضحكون \" أي من صنيعهم وعبادتهم كما قال تعالى \" إن الذين أجرموا كانوا من الذين آمنوا يضحكون وإذا مروا بهم يتغامزون \" أي يلمزونهم استهزاء ثم أخبر تعالى عما جازى به أولياءه وعباده الصالحين."
    },
    {
      "ayah": 11,
      "surah": 23,
      "text": "ولما وصفهم تعالى بالقيام بهذه الصفات الحميدة والأفعال الرشيدة \" قال أولئك هم الوارثون الذين يرثون الفردوس هم فيها خالدون\" وثبت في الصحيحين أن رسول الله صلى الله عليه وسلم قال: \" إذا سألتم الله الجنة فاسألوه الفردوس فإنه أعلى الجنة وأوسط الجنة ومنه تفجر أنهار الجنة وفوقه عرش الرحمن \"وقال ابن أبي حاتم حدثنا أحمد بن سنان حدثنا أبو معاوية حدثنا الأعمش عن أبي صالح عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم \" ما منكم من أحد إلا وله منزلان منزل في الجنة ومنزل في النار فإن مات ودخل النار ورث أهل الجنة منزله \"فذلك قوله أولئك هم الوارثون وقال ابن جريج عن الليث عن مجاهد \" أولئك الوارثون قال ما من عبد إلا وله منزلان منزل في الجنة ومنزل في النار فأما المؤمن فيبني بيته الذي في الجنة ويهدم بيته الذي في النار وأما الكافر فيهدم بيته الذي في الجنة ويبني بيته الذي في النار وروي عن سعيد بن جبير نحو ذلك فالمؤمنون يرثون منازل الكفار لأنهم خلقوا لعبادة الله تعالى وحده لا شريك له فلما قام هؤلاء المؤمنون بما وجب عليهم من العبادة وترك أولئك ما أمروا به مما خلقوا له أحرز هؤلاء نصيب أولئك لو كانوا أطاعوا ربهم عز وجل بل أبلغ من هذا أيضا وهو ما ثبت في صحيح مسلم عن أبي بردة بن أبي موسى عن أبيه عن النبي صلى الله عليه وسلم قال \" يجيء ناس يوم القيامة من المسلمين بذنوب أمثال الجبال فيغفرها الله لهم ويضعها على اليهود والنصارى \"وفي لفظ قوله قال رسول الله صلى الله عليه وسلم: \" إذا كان يوم القيامة دفع الله لكل مسلم يهوديا أو نصرانيا فيقال هذا فكاكك من النار \"فاستحلف عمر ابن عبد العزيز أبا بردة بالله الذي لا إله إلا هو ثلاث مرات أن أباه حدثه عن رسول الله صلى الله عليه وسلم بذلك قال فحلف له قلت وهذه الآية كقوله تعالى \" تلك الجنة التي نورث من عبادنا من كان تقيا \" وكقوله \" وتلك الجنة التي أورثتموها بما كنتم تعملون وقد قال مجاهد وسعيد بن جبير الجنة بالرومية هي الفردوس وقال بعض السلف لا يسمى البستان الفردوس إلا إذا كان فيه عنب فالله أعلم."
    },
    {
      "ayah": 110,
      "surah": 23,
      "text": "فاتخذتموهم سخريا \" أي فسخرتم منهم في دعائهم إياي وتضرعهم إلي \" حتى أنسوكم ذكري \" أي حملكم بغضهم علي أن نسيتم معاملتي \" وكنتم منهم تضحكون \" أي من صنيعهم وعبادتهم كما قال تعالى \" إن الذين أجرموا كانوا من الذين آمنوا يضحكون وإذا مروا بهم يتغامزون \" أي يلمزونهم استهزاء ثم أخبر تعالى عما جازى به أولياءه وعباده الصالحين."
    },
    {
      "ayah": 111,
      "surah": 23,
      "text": "فقال تعالى \" إني جزيتهم اليوم بما صبروا \" أي على أذاكم لهم واستهزائكم بهم \" أنهم هم الفائزون \" بالسعادة والسلامة والجنة والنجاة من النار."
    },
    {
      "ayah": 112,
      "surah": 23,
      "text": "يقول تعالى منبها لهم على ما أضاعوه في عمرهم القصير في الدنيا من طاعة الله تعالى وعبادته وحده ولو صبروا في مدة الدنيا القصيرة لفازوا كما فاز أولياؤه المتقون \" قال كم لبثتم في الأرض عدد سنين \" أي كم كانت إقامتكم في الدنيا."
    },
    { "ayah": 113, "surah": 23, "text": "\" قالوا لبثنا يوما أو بعض يوم فاسأل العادين \" أي الحاسبين." },
    {
      "ayah": 114,
      "surah": 23,
      "text": "\" قال إن لبثتم إلا قليلا \" أي مدة يسيرة على كل تقدير \" لو أنكم كنتم تعلمون \" أي لما آثرتم الفاني على الباقي ولما تصرفتم لأنفسكم هذا التصرف السيء ولا استحققتم من الله سخطه في تلك المدة اليسيرة فلو أنكم صبرتم على طاعة الله وعبادته كما فعل المؤمنون لفزتم كما فازوا قال ابن أبي حاتم حدثنا أبي حدثنا محمد بن يونس حدثنا الوليد حدثنا صفوان عن أيفع بن عبد الكلاعي أنه سمعه يخطب الناس فقال: قال رسول الله صلى الله عليه وسلم \" إن الله إذا أدخل أهل الجنة الجنة وأهل النار النار قال يا أهل الجنة كم لبثتم في الأرض عدد سنين؟ قالوا لبثنا يوما أو بعض يوم قال لنعم ما اتجرتم في يوم أو بعض يوم رحمتي ورضواني وجنتي امكثوا فيها خالدين مخلدين ثم قال يا أهل النار كم لبثتم في الأرض عدد سنين؟ قالوا لبثنا يوما أو بعض يوم فيقول بئس ما اتجرتم في يوم أو بعض يوم ناري وسخطي امكثوا فيها خالدين مخلدين \"."
    },
    {
      "ayah": 115,
      "surah": 23,
      "text": "وقوله تعالى \" أفحسبتم أنما خلقناكم عبثا \" أي أفظننتم أنكم مخلوقون عبثا بلا قصد ولا إرادة منكم ولا حكمة لنا وقيل للعبث أي لتلعبوا وتعبثوا كما خلقت البهائم لا ثواب لها ولا عقاب وإنما خلقناكم للعبادة وإقامة أوامر الله عز وجل \" وأنكم إلينا لا ترجعون \" أي لا تعودون في الدار الآخرة كما قال تعالى \" أيحسب الإنسان أن يترك سدى \" يعني هملا."
    },
    {
      "ayah": 116,
      "surah": 23,
      "text": "وقوله \" فتعالى الله الملك الحق \" أي تقدس أن يخلق شيئا عبثا فإنه الملك الحق المنزه عن ذلك \" لا إله إلا هو رب العرش الكريم \" فذكر العرش لأنه سقف جميع المخلوقات ووصفه بأنه كريم أي حسن المنظر بهي الشكل كما قال تعالى \" وأنبتنا فيها من كل زوج كريم \". قال ابن أبي حاتم حدثنا علي بن الحسين حدثنا علي بن محمد الطنافسي حدثنا إسحاق بن سليمان شيخ من أهل العراق أنبأنا شعيب بن صفوان عن رجل من آل سعيد بن العاص قال: كان آخر خطبة خطبها عمر بن عبد العزيز أن حمد الله وأثنى عليه ثم قال: أما بعد أيها الناس إنكم لم تخلقوا عبثا ولن تتركوا سدى وإن لكم معادا ينزل الله فيه للحكم بينكم والفصل بينكم فخاب وخسر وشقي عبد أخرجه الله من رحمته وحرم جنة عرضها السموات والأرض ألم تعلموا أنه لا يأمن غدا إلا من حذر هذا اليوم وخافه وباع نافدا بباق وقليلا بكثير وخوفا بأمان ألا ترون أنكم من أصلاب الهالكين سيكون من بعدكم الباقين حتى تردون إلى خير الوارثين؟ ثم إنكم في كل يوم تشيعون غاديا ورائحا إلى الله عز وجل قد قضى نحبه وانقضى أجله حتى تغيبوه في صدع من الأرض في بطن صدع غير ممهد ولا موسد قد فارق الأحباب وباشر التراب ووجه الحساب مرتهن بعمله غني عما ترك فقير إلى ما قدم فاتقوا الله قبل انقضاء مواثيقه ونزول الموت بكم ثم جعل طرف ردائه على وجهه فبكى وأبكى من حوله. وقال ابن أبي حاتم حدثنا يحيى بن نصير الخولاني ثنا ابن وهب أخبرني ابن لهيعة عن أبي هبيرة عن حسن بن عبدالله أن رجلا مصابا مر به على عبدالله بن مسعود فقرأ في أذنه هذه الآية \" أفحسبتم أنما خلقناكم عبثا وأنكم إلينا لا ترجعون فتعالى الله الملك الحق \" حتى ختم السورة فبرأ فذكر لرسول الله صلى الله عليه وسلم فقال رسول الله صلى الله عليه وسلم \" بماذا قرأت في أذنه \"؟ فأخبره فقال رسول الله صلى الله عليه وسلم \" والذي نفسي بيده لو أن رجلا موقنا قرأها على جبل لزال \"وروى أبو نعيم من طريق خالد بن نزار عن سفيان بن عيينة عن محمد بن المنكدر عن محمد بن إبراهيم بن الحارث عن أبيه قال: بعثنا رسول الله صلى الله عليه وسلم في سرية وأمرنا أن نقول إذا نحن أمسينا وأصبحنا \" أفحسبتم أنما خلقناكم عبثا وأنكم إلينا لا ترجعون \" قال فقرأناها فغنمنا وسلمنا. وقال ابن أبي حاتم أيضا حدثنا إسحاق بن وهب العلاف الواسطي حدثنا أبو المسيب سالم بن سلام حدثنا بكر بن حبيش عن نهشل بن سعيد عن الضحاك بن مزاحم عن عبدالله بن عباس قال: قال رسول الله صلى الله عليه وسلم \" أمان أمتي من الغرق إذا ركبوا السفينة. بسم الله الملك الحق \" وما قدروا الله حق قدره والأرض جميعا قبضته يوم القيامة والسموات مطويات بيمينه سبحانه وتعالى عما يشركون\" \" بسم الله مجراها ومرساها إن ربي لغفور رحيم \"."
    },
    {
      "ayah": 117,
      "surah": 23,
      "text": "يقول تعالى متوعدا من أشرك به غيره وعبد معه سواء ومخبرا أن من أشرك بالله لا برهان له أي لا دليل له على قوله فقال تعالى \" ومن يدع مع الله إلها آخر لا برهان له به \" وهذه جملة معترضة وجواب الشرط في قوله \" فإنما حسابه عند ربه \" أي الله يحاسبه على ذلك ثم أخبر \" إنه لا يفلح الكافرون \" أي لديه يوم القيامة لا فلاح لهم ولا نجاة. قال قتادة ذكر لنا أن نبي الله صلى الله عليه وسلم قال لرجل \" ما تعبد؟ \"قال أعبد الله وكذا وكذا حتى عد أصناما فقال رسول الله صلى الله عليه وسلم \" فأيهم إذا أصابك ضر فدعوته كشفه عنك؟ \"قال: الله عز وجل. قال \" فأيهم إذا كانت لك حاجة فدعوته أعطاكها؟ \"قال: الله عز وجل. قال \" فما يحملك على أن تعبد هؤلاء معه أم حسبت أن تغلب عليه \"قال: أردت شكره بعبادة هؤلاء معه. فقال رسول الله صلى الله عليه وسلم \" تعلمون ولا يعلمون \"فقال الرجل بعد ما أسلم لقيت رجلا خصمني.هذا مرسل من هذا الوجه وقد روى أبو عيسى الترمذي في جامعه مسندا عن عمران بن الحصين عن أبيه عن رسول الله صلى الله عليه وسلم نحو ذلك."
    },
    {
      "ayah": 118,
      "surah": 23,
      "text": "وقوله تعالى \" وقل رب اغفر وارحم وأنت خير الراحمين \" هذا إرشاد من الله تعالى إلى هذا الدعاء فالغفر إذا أطلق معناه محو الذنب وستره عن الناس والرحمة معناها أن يسدده ويوفقه في الأقوال والأفعال. آخر تفسير سورة المؤمنون."
    },
    {
      "ayah": 12,
      "surah": 23,
      "text": "يقول تعالى مخبرا عن ابتداء خلق الإنسان من سلالة من طين وهو آدم عليه السلام خلقه الله من صلصال من حمإ مسنون وقال الأعمش عن المنهال بن عمرو عن أبي يحيى عن ابن عباس \" من سلالة من طين \" قال من صفوة الماء وقال مجاهد من سلالة أي من من آدم وقال ابن جرير: إنما سمي آدم طين لأنه مخلوق منه وقال قتادة استل آدم من الطين وهذا أظهر في المعنى وأقرب إلى السياق فإن آدم عليه السلام خلق من طين لازب وهو الصلصال من الحمإ المسنون وذلك مخلوق من التراب كما قال تعالى \" ومن آياته أن خلقكم من تراب ثم إذا أنتم بشر تنتشرون \" وقال الإمام أحمد حدثنا يحيى بن سعيد حدثنا أسامة بن زهير عن أبي موسى عن النبي صلى الله عليه وسلم قال: \" إن الله خلق آدم من قبضة قبضها من جميع الأرض فجاء بنو آدم على ظهر الأرض جاء منهم الأحمر والأسود وبين ذلك والخبيث والطيب وبين ذلك \"وقد رواه أبو داود والترمذي من طرق عن عوف الأعرابي به نحوه وقال الترمذي حسن صحيح."
    },
    {
      "ayah": 13,
      "surah": 23,
      "text": "\"ثم جعلناه نطفة\" هذا الضمير عائد على جنس الإنسان كما قال في الآية الأخرى \" وبدأ خلق الإنسان من طين ثم جعل نسله من سلالة من ماء مهين \" أي ضعيف كما قال \" ألم نخلقكم من ماء مهين فجعلناه في قرار مكين \" يعني الرحم معد لذلك مهيأ له \" إلى قدر معلوم فقدرنا فنعم القادرون \" أي المدة معلومة وأجل معين حتى استحكم ونقل من حال. إلى حال وصفة إلى صفة ولهذا قال ههنا."
    },
    {
      "ayah": 14,
      "surah": 23,
      "text": "\" ثم خلقنا النطفة علقة \" أي ثم صيرنا النطفة وهي الماء الدافق الذي يخرج من صلب الرجل وهو ظهره وترائب المرأة وهي عظام صدري ما بين الترقوة إلى السرة فصارت علقة حمراء على شكل العلقة مستطيلة قال عكرمة وهي دم \" فخلقنا العلقة مضغة\" وهي قطعة كالبضعة من اللحم لا شكل فيها ولا تخطيط فخلقنا المضغة عظاما \" يعني شكلناها ذات رأس ويدين ورجلين عظامها وعصبها وعروقها وقرأ آخرون \" فخلقنا المضغة عظما \" قال ابن عباس وهو عظم الصلب في الصحيح من حديث أبي الزناد عن الأعرج عن أبي هريرة قال: قال رسول الله صلى الله عليه وسلم \" كل جسد ابن آدم يبلى إلا عجب الذنب منه خلق ومنه يركب \"\" فكسونا العظام لحما\" أي جعلنا على ذلك ما يستره ويشده ويقويه ثم \" ثم أنشأناه خلقا آخر \" أي ثم نفخا فيه الروح فتحرك وصار خلقا آخر ذا سمع وبصر وإدراك وحركة واضطراب \" فتبارك الله أحسن الخالقين \" وقال ابن أبي حاتم حدثنا علي بن الحسين حدثنا جعفر بن مسافر حدثنا يحيى بن حسان حدثنا النضر يعني ابن كثير مولى بني هاشم حدثنا زيد بن علي عن أبيه عن علي بن أبي طالب رضي الله عنه قال: إذا أتت على النطفة أربعة أشهر بعث الله إليها ملكا فنفخ فيها الروح في ظلمات ثلاث فذلك قوله \" ثم أنشأناه خلقا آخر \" يعني نفخنا فيه الروح وروى عن أبي سعيد الخدري أنه نفخ الروح قال ابن عباس \" ثم أنشأناه خلقا آخر \" يعني نفخنا فيه الروح وكذا قال مجاهد وعكرمة والشعبي والحسن وأبو العالية والضحاك والربيع بن أنس والسدي وابن زيد واختاره ابن جرير وقال العوفي عن ابن عباس \" خلقا آخر \" يعني فنقله من حال إلى حال إلى أن خرج طفلا ثم نشأ صغيرا ثم احتلم ثم صار شابا ثم كهلا ثم شيخا ثم هرما وعن قتادة والضحاك نحو ذلك ولا منافاة فإنه من ابتداء نفخ الروح فيه شرع في هذه التنقلات والأحوال والله أعلم قال الإمام أحمد في مسنده حدثنا أبو معاوية حدثنا الأعمش عن زيد بن وهب عن عبدالله- هو ابن مسعود رضي الله عنه قال حدثنا رسول الله صلى الله عليه وسلم وهو الصادق المصدوق \" إن أحدكم ليجمع خلقه في بطن أمه أربعين يوما ثم يكون علقة مثل ذلك ثم يكون مضغة مثل ذلك ثم يرسل إليه الملك فينفخ فيه الروح ويؤمر بأربع كلمات: رزقه وأجله وعمله وهل هو شقي أو سعيد فوالذي لا إله غيره إن أحدكم ليعمل بعمل أهل الجنة حتى ما يكون بينه وبينها إلا ذراع فيسبق عليه الكتاب فيختم له بعمل أهل النار فيدخلها وإن أحدكم ليعمل بعمل أهل النار حتى ما يكون بينه وبينها إلا ذراع فيسبق عليه الكتاب فيختم له بعمل أهل الجنة فيدخلها \"أخرجاه من حديث سليمان بن مهران الأعمش وقال ابن أبي حاتم حدثنا أحمد بن سنان حدثنا أبو معاوية عن الأعمش عن أبي خيثمة قال: قال عبدالله- يعني ابن مسعود إن النطفة إذا وقعت في الرحم طارت في كل شعر وظفر فتمكث أربعين يوما ثم تعود في الرحم فتكون علقة وقال الإمام أحمد أيضا حدثنا حسن بن الحسن حدثنا أبو كدينة عن عطاء بن السائب عن القاسم بن عبد الرحمن عن أبيه عن عبدالله قال: مر يهودي برسول الله صلى الله عليه وسلم وهو يحدث أصحابه فقالت قريش يا يهودي إن هذا يزعم أنه نبي فقال لأسألنه عن شيء لا يعلمه إلا نبي قال فجاءه حتى جلس ققال يا محمد مم يخلق الإنسان ؟ فقال \" يا يهودي من كل يخلق من نطفة الرجل ومن نطفة المرأة فأما نطفة الرجل فنطفة غليظة منها العظم والعصب وأما نطفة المرأة فنطفة رقيقة منها اللحم والدم \"فقال هكذا كان يقول \" من قبلك \" وقال الإمام أحمد حدثنا سفيان بن عمرو عن أبي الطفيل عن حذيفة بن أسيد الغفاري قال سمعت رسول الله صلى الله عليه وسلم يقول \" يدخل الملك على النطفة بعدما تستقر في الرحم بأربعين ليلة فيقول يا رب ماذا ؟ شقي أو سعيد أَذَكَرٌ أم أُنْثى ؟ فيقول الله فيكتبان ويكتب عمله وأثره ومصيبته ورزقه ثم تطوى الصحيفة فلا يزاد على ما فيها ولا ينقص \"وقد رواه مسلم في صحيحه من حديث سفيان بن عيينة عن عمرو هو ابن دينار به نحوه. ومن طريق- أخرى عن أبي الطفيل عامر بن واثلة عن حذيفة بن أسيد عن أبن شريحة الغفاري بنحوه والله أعلم وقال الحافظ أبو بكر البزار حدثنا أحمد بن عبدة حدثنا حماد بن زيد حدثنا عبيدالله بن أبي بكر عن أنس أن رسول الله صلى الله عليه وسلم قال \" إن الله وكل بالرحم ملكا فيقول أي رب نطفة أي رب علقة أي رب مضغة فإذا أراد الله خلقها قال أي رب ذكر أو أنثى ؟ شقي أو سعيد ؟ فما الرزق والأجل ؟ قال فذلك يكتب في بطن أمه \"أخرجاه في الصحيحين من حديث حماد بن زيد به وقوله \" فتبارك الله أحسن الخالقين \" يعني حين ذكر قدرته ولطفه في خلق هذه النطفة من حال إلى حال.وشكل إلى شكل حتى تصورت إلى ما صارت إليه من الإنسان السوي الكامل الخلق قال \" فتبارك الله أحسن الخالقين \" قال ابن أبي حاتم حدثنا يونس بن حبيب حدثنا أبو داود حدثنا حماد بن سلمة حدثنا علي بن زيد عن أنس قال قال عمر يعني ابن الخطاب رضي الله عنه: وافقت ربي في أربع نزلت هذه الآية \" ولقد خلقنا الإنسان من سلالة من طين \" الآية قلت أنا فتبارك الله أحسن الخالقين فنزلت \" فتبارك الله أحسن الخالقين \" وقال أيضا حدثنا أبي حدثنا آدم بن أبي إياس حدثنا شيبان عن جابر الجعفي عن عامر الشعبي عن زيد بن ثابت الأنصاري:قال أملى علي رسول الله هذه الآية \" ولقد خلقنا الإنسان من سلالة من طين - إلى قوله - خلقا آخر \" فقال معاذ \" فتبارك الله أحسن الخالقين \" فضحك رسول الله صلى الله عليه وسلم فقال له معاذ مم تضحك يا رسول الله ؟ فقال \" بها ختمت فتبارك الله أحسن الخالقين \"وفي إسناده جابر بن زيد الجعفي ضعيف جدا وفي خبره هذا نكارة شديدة وذلك أن هذه السورة مكية وزيد بن ثابت إنما كتب الوحي بالمدينة وكذلك إسلام معاذ بن جبل إنما كان بالمدينة أيضا فالله أعلم."
    },
    {
      "ayah": 15,
      "surah": 23,
      "text": "وقوله \" ثم إنكم بعد ذلك لميتون \" يعني بعد هذه النشأة الأولى من العدم تصيرون إلى الموت."
    },
    {
      "ayah": 16,
      "surah": 23,
      "text": "\" ثم إنكم يوم القيامة تبعثون \" يعني النشأة الآخرة ثم الله ينشئ النشأة الآخرة يعني يوم المعاد وقيام الأرواح إلى الأجساد فيحاسب الخلائق ويوافي كل عامل عمله إن خيرا فخير وإن شرا فشر."
    },
    {
      "ayah": 17,
      "surah": 23,
      "text": "لما ذكر تعالى خلق الإنسان عطف بذكر خلق السموات السبع وكثيرا ما يذكر تعالى خلق السموات والأرض مع خلق الإنسان كما قال تعالى \" لخلق السموات والأرض أكبر من خلق الناس \" وهكذا في أول \" آلم \" السجدة التي كان رسول الله صلى الله عليه وسلم يقرأ بها صبيحة يوم الجمعة في أولها خلق السموات والأرض ثم بيان خلق الإنسان من سلالة من طين وفيها أمر المعاد والجزاء وغير ذلك من المقاصد. وقوله \" سبع طرائق \" قال مجاهد يعني السموات السبع وهذه كقوله تعالى \" تسبح له السموات السبع والأرض ومن فيهن \" \" ألم تروا كيف خلق الله سبع سموات طباقا \" \" الله الذي خلق سبع سموات ومن الأرض مثلهن يتنزل الأمر بينهن لتعلموا أن الله على كل شيء قدير وأن الله قد أحاط بكل شيء علما \" وهكذا قال ههنا \" ولقد خلقنا فوقكم سبع طرائق وما كنا عن الخلق غافلين \" أي ويعلم ما يلج في الأرض وما يخرج منها وما ينزل من السماء وما يعرج فيها وهو معكم أينما كنتم والله بما تعلمون بصير وهو سبحانه لا يحجب عنه سماء سماء ولا أرض أرضا ولا جبل إلا يعلم ما في وعره ولا بحر إلا يعلم ما في قعره يعلم عدد ما في الجبال والتلال والرمال والبحار والقفار والأشجار \" وما تسقط من ورقة إلا يعلمها ولا حبة في ظلمات الأرض ولا رطب ولا يابس إلا في كتاب مبين \"."
    },
    {
      "ayah": 18,
      "surah": 23,
      "text": "يذكر تعالى نعمه على عبيده التي لا تعد ولا تحصى في إنزاله القطر من السماء بقدر أي بحسب الحاجة لا كثيراً فيفسد الأرض والعمران ولا قليلا فلا يكفي الزروع والثمار بل بقدر الحاجة إليه من السقي والشرب والانتفاع به حتى إن الأراضي التي تحتاج ماء كثيرا لزرعها ولا تحتمل دمنتها إنزال المطر عليها يسوق إليها الماء من بلاد أخرى كما في أرض مصر ويقال لها الأرض الجرز يسوق الله إليها ماء النيل معه طين أحمر يجترفه من بلاد الحبشة في زمان أمطارها فيأتي الماء يحمل طينا أحمر فيسقي أرض مصر ويقر الطين على أرضهم ليزرعوا فيه لأن أرضهم سباخ يغلب عليها الرمال فسبحان اللطيف الخبير الرحيم الغفور وقوله \" فأسكناه في الأرض \" أي جعلنا الماء إذا نزل من السحاب يخلد في الأرض وجعلنا في الأرض قابلية له وتشربه ويتغذى به ما فيها من الحب والنوى. وقوله \" وإنا على ذهاب به لقادرون \" أي لو شئنا أن لا تمطر لفعلنا ولو شئنا أذى لصرفناه عنكم إلى السباخ والبراري والقفار لفعلنا ولو شئنا لجعلناه أجاجا لا ينتفع به لشرب ولا لسقي لفعلنا ولو شئنا لجعلناه لا ينزل في الأرض بل ينجر على وجهها لفعلنا ولو شئنا لجعلناه إذا نزل فيها يغور إلى مدى لا تصلون إليه ولا ينتفعون به لفعلنا ولكن بلطفه ورحمته ينزل عليكم الماء من السحاب عذبا فراتا زلالا فيسكنه في الأرض ويسلكه ينابيع في الأرض فيفتح العيون والأنهار ويسقي به الزروع والثمار تشربون منه ودوابكم وأنعامكم وتغتسلون منه وتتطهرون منه وتتنظفون فله الحمد والمنة."
    },
    {
      "ayah": 19,
      "surah": 23,
      "text": "وقوله \" فأنشأنا لكم به جنات من نخيل وأعناب \" يعني فأخرجنا لكم بما أنزلنا من السماء جنات أي بساتين وحدائق \" ذات بهجة \" أي ذات منظر حسن. وقوله \" من نخيل وأعناب \" أي فيها نخيل وأعناب وهذا ما كان يألف أهل الحجاز ولا فرق بين الشيء وبين نظيره وكذلك في حق كل أهل أقليم عندهم من الثمار من نعمة الله عليهم ما يعجزون عن القيام بشكره. وقوله \" لكم فيها فواكه كثيرة \" أي من جميع الثمار كما قال \" ينبت لكم به الزرع والزيتون والنخيل والأعناب ومن كل الثمرات \" وقوله \" ومنها تأكلون \" أنه معطوف على شيء مقدر تقديره تنظرون إلى حسنه ونضجه ومنه تأكلون."
    },
    {
      "ayah": 2,
      "surah": 23,
      "text": "\" الذين هم في صلاتهم خاشعون \" قال علي بن أبي طلحة عن ابن عباس \" خاشعون \" خائفون ساكنون وكذا روي عن مجاهد والحسن وقتادة والزهري وعن علي بن أبي طالب \" الخشوع خشوع القلب وكذا قال إبراهيم النخعي وقال الحسن البصري كان خشوعهم في قلوبهم فغضوا بذلك أبصارهم وخفضوا الجناح وقال محمد بن سيرين كان أصحاب رسول الله صلى الله عليه وسلم يرفعون أبصارهم إلى السماء في الصلاة فلما نزلت هذه الآية \" قد أفلح المؤمنون الذين هم في صلاتهم خاشعون \" خفضوا أبصارهم إلى موضع سجودهم قال محمد بن سيرين وكانوا يقولون لا يجاوز بصره مصلاة فإن كان قد اعتاد النظر فليغمض رواه ابن جرير وابن حاتم ثم روى ابن جرير عنه وعن عطاء بن أبي رباح أيضا مرسلا أن رسول الله كان يفعل ذلك حتى نزلت هذه الآية والخشوع في الصلاة إنما يحصل لمن فرغ قلبه لها واشتغل بها عما عداها وآثرها على غيرها وحينئذ تكون راحة له وقرة عين كما قال النبي صلى الله عليه وسلم في الحديث الذي رواه الإمام أحمد والنسائي عن أبي عن رسول الله صلى الله عليه وسلم أنه قال \" حبب إلي الطيب والنساء وجعلت قرة عيني في الصلاة \".وقال الإمام أحمد حدثنا وكيع حدثنا مسعر عن عمرو بن مرة عن سالم بن أبي الجعد عن رجل من أسلم أن رسول الله صلى الله عليه وسلم قال: \" يا بلال أرحنا بالصلاة \"وقال الإمام أحمد أيضا ثنا عبد الرحمن بن مهدي ثنا إسرائيل عن عثمان بن المغيرة عن سالم ابن أبي الجعد أن محمد بن الحنفية قال: دخلت مع أبي على صهر لنا من الأنصار فحضرت الصلاة فقال يا جارية ائتني بوضوء لعلي أصلي فأستريح فرآنا أنكرنا عليه ذلك فقال سمعت رسول الله صلى الله عليه وسلم يقول \" قم يا بلال فأرحنا بالصلاة \";."
    },
    {
      "ayah": 20,
      "surah": 23,
      "text": "وقوله \" وشجرة تخرج من طور سيناء \" يعني الزيتونه والطور هو الجبل وقال بعضهم إنما يسمى طورا إذا كان فيه شجر فإن عري عنها سمي جبلا لا طورا والله أعلم وطور سيناء هو طور سينين وهو الجبل الذي كلم الله عليه موسي بن عمران عليه السلام وما حوله من الجبال التي فيها شجر الزيتون وقوله \" تنبت بالدهن \" قال بعضهم الباء زائدة وتقديره تنبت الدهن كما في قول العرب ألقى فلان بيده أي يده وأما على قول من يضمن الفعل فتقديره تخرج بالدهن أو تأتي بالدهن ولهذا قال \" وصبغ \" أي أدم قاله قتادة \" للآكلين \" أي فيها ما ينتفع به من الدهن والاصطباغ كما قال الإمام أحمد حدثنا وكيع عن عبدالله ابن عيسى عن عطاء الشامي عن أبي أسيد واسمه مالك بن ربيعة الساعدي الأنصاري رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم \" كلوا الزيت وادهنوا به فإنه من شجرة مباركة \"وقال عبد بن حميد في مسنده وتفسيره حدثنا عبد الرزاق أخبرنا معمر عن زيد بن أسلم عن أبيه عن عمر أن رسول الله صلى الله عليه وسلم ائتدموا بالزيت وادهنوا به فإنه يخرج من شجرة مباركة\" ورواه الترمذي وابن ماجه من غير وجه عن عبد الرزاق. قال الترمذي ولا يعرف إلا من حديثه وكان يضطرب فيه فربما ذكر فيه عمر وربما لم يذكره. قال أبو القاسم الطبراني حدثنا عبدالله بن أحمد بن حنبل حدثنا أبي حدثنا سفيان بن عيينة حدثني الصعب بن حكيم بن شريك بن نميلة عن أبيه عن جده قال: ضفت عمر بن الخطاب رضي الله عنه ليلة عاشوراء فأطعمني من رأس بعير بارد وأطعمنا زيتا وقال هذا الزيت المبارك الذي قال الله لنبيه صلى الله عليه وسلم."
    },
    {
      "ayah": 21,
      "surah": 23,
      "text": "وقوله \" وإن لكم في الأنعام لعبرة نسقيكم مما في بطونها ولكم فيها منافع كثيرة ومنها تأكلون وعليها وعلى الفلك تحملون \" يذكر تعالى ما جعل لخلقه في الأنعام من المنافع وذلك أنهم يشربون من ألبانها الخارجة من بين فرث ودم ويأكلون من حملانها ويلبسون من أصوافها وأوبارها وأشعارها ويركبون ظهورها ويحملونها الأحمال الثقال إلى البلاد النائية عنهم كما قال تعالى \" وتحمل أثقالكم إلى بلد لم تكونوا بالغيه إلا بشق الأنفس إن ربكم لرءوف رحيم \" وقال تعالى \" أو لم يروا أنا خلقنا لهم مما عملت أيدينا أنعاما فهم لها مالكون وذللناها لهم فمنها ركوبهم ومنها يأكلون ولهم فيها منافع ومشارب أفلا يشكرون \"."
    },
    {
      "ayah": 22,
      "surah": 23,
      "text": "وقوله \" وإن لكم في الأنعام لعبرة نسقيكم مما في بطونها ولكم فيها منافع كثيرة ومنها تأكلون وعليها وعلى الفلك تحملون \" يذكر تعالى ما جعل لخلقه في الأنعام من المنافع وذلك أنهم يشربون من ألبانها الخارجة من بين فرث ودم ويأكلون من حملانها ويلبسون من أصوافها وأوبارها وأشعارها ويركبون ظهورها ويحملونها الأحمال الثقال إلى البلاد النائية عنهم كما قال تعالى \" وتحمل أثقالكم إلى بلد لم تكونوا بالغيه إلا بشق الأنفس إن ربكم لرءوف رحيم \" وقال تعالى \" أو لم يروا أنا خلقنا لهم مما عملت أيدينا أنعاما فهم لها مالكون وذللناها لهم فمنها ركوبهم ومنها يأكلون ولهم فيها منافع ومشارب أفلا يشكرون \"."
    },
    {
      "ayah": 23,
      "surah": 23,
      "text": "يخبر تعالى عن نوح حين بعثه إلى قومه لينذرهم عذاب الله وبأسه الشديد وانتقامه ممن أشرك به وخالف أمره وكذب رسله \" فقال يا قوم اعبدوا الله مالكم من إله غيره أفلا تتقون \" أي ألا تخافون من الله في إشراككم به؟."
    },
    {
      "ayah": 24,
      "surah": 23,
      "text": "فقال الملأ وهم السادة والأكابر منهم \" ما هذا إلا بشر مثلكم يريد أن يتفضل عليكم \" يعنون يترفع عليكم ويتعاظم بدعوى النبوة وهو بشر مثلكم فكيف أوحي إليه دونكم \" ولو شاء الله لأنزل ملائكة \" أي لو أراد أن يبعث نبيا لبعث ملكا من عنده ولم يكن بشرا ما سمعنا بهذا أي ببعثة البشر في آبائنا الأولين يعنون بهذا أسلافهم وأجدادهم في الدهور الماضية."
    },
    {
      "ayah": 25,
      "surah": 23,
      "text": "وقوله \" إن هو إلا رجل به جِنَّة \" أي مجنون فيما يزعمه من أن الله أرسله إليكم واختصه من بينكم بالوحي \" فتربصوا حتى حين \" أي انتظروا به ريب المنون واصبروا عليه مدة حتى تستريحوا منه."
    },
    {
      "ayah": 26,
      "surah": 23,
      "text": "يخبر تعالى عن نوح عليه السلام أنه دعا ربه ليستنصره على قومه كما قال تعالى مخبرا عنه في الآية الأخري \" فدعا ربه أني مغلوب فانتصر \" وقال ههنا \" رب انصرني بما كذبون \"."
    },
    {
      "ayah": 27,
      "surah": 23,
      "text": "فعند ذلك أمره الله تعالى بصنعة السفينة وإحكامها وإتقانها وأن يحمل فيها من كل زوجين اثنين أي ذكرا وأنثى من كل صنف من الحيوانات والنباتات والثمار وغير ذلك وأن يحمل فيها أهله \" إلا من سبق عليه القول منهم \" أي من سبق عليه القول من الله بالهلاك وهم الذين لم يؤمنوا به من أهله كابنه وزوجته والله أعلم.وقوله \" ولا تخاطبني في الذين ظلموا إنهم مغرقون \" أي عند معاينة إنزال المطر العظيم لا تأخذنك رأفة بقومك وشفقة عليهم وطمع في تأخيرهم لعلهم يؤمنون فإني قد قضيت أنهم مغرقون على ما هم عليه من الكفر والطغيان وقد تقدمت القصة مبسوطة في سورة هود بما يغني عن إعادة ذلك ههنا."
    },
    {
      "ayah": 28,
      "surah": 23,
      "text": "وقوله \" فإذا استويت أنت ومن معك على الفلك فقل الحمد لله الذي نجانا من القوم الظالمين \" كما قال \" وجعل لكم من الفلك والأنعام ما تركبون لتستووا عل ظهوره ثم تذكروا نعمة ربكم إذا استويتم عليه وتقولوا سبحان الذي سخر لنا هذا وما كنا له مقرنين وإنا إلى ربنا لمنقلبون \" وقد امتثل نوح عليه السلام هذا كما قال تعالى \" وقال اركبوا فيها بسم الله مجراها ومرساها \" فذكر الله تعالى عند ابتداء سيره وعند انتهائه."
    },
    {
      "ayah": 29,
      "surah": 23,
      "text": "وقال تعالى \" وقل رب أنزلني منزلا مباركا وأنت خير المنزلين \" وقوله \" إن في ذلك لآيات \" أي إن في هذا الصنيع وهو إنجاء المؤمنين وإهلاك الكافرين لآيات أي لحجج ودلالات واضحات علي صدق الأنبياء فيما جاءوا به عن الله تعالى وأنه تعالى فاعل لما يشاء قادر عل كل شيء عليم بكل شيء وقوله \" وإن كنا لمبتلين \" أي لمختبرين للعباد بإرسال المرسلين."
    },
    {
      "ayah": 3,
      "surah": 23,
      "text": "وقوله \" والذين هم عن اللغو معرضون \" أي عن الباطل وهو يشتمل الشرك كما قاله بعضهم والمعاصي قاله آخرون وما لا فائدة فيه من الأقوال والأفعال كما قال تعالى \" وإذا مروا باللغو مروا كراما \" قال قتادة: أتاهم والله من أمر الله ما وقفهم عن ذلك."
    },
    {
      "ayah": 30,
      "surah": 23,
      "text": "وقال تعالى \" وقل رب أنزلني منزلا مباركا وأنت خير المنزلين \" وقوله \" إن في ذلك لآيات \" أي إن في هذا الصنيع وهو إنجاء المؤمنين وإهلاك الكافرين لآيات أي لحجج ودلالات واضحات علي صدق الأنبياء فيما جاءوا به عن الله تعالى وأنه تعالى فاعل لما يشاء قادر عل كل شيء عليم بكل شيء وقوله \" وإن كنا لمبتلين \" أي لمختبرين للعباد بإرسال المرسلين."
    },
    {
      "ayah": 31,
      "surah": 23,
      "text": "يخبر تعالى أنه أنشأ بعد قوم نوح قرنا آخرين قيل المراد بهم عاد فإنهم كانوا مستخلفين بعدهم وقيل المراد بهؤلاء ثمود لقوله \" فأخذتهم الصيحة بالحق \"."
    },
    { "ayah": 32, "surah": 23, "text": "وأنه تعالى أرسل فيهم رسولا منهم فدعاهم إلى عبادة الله وحده لا شريك له." },
    {
      "ayah": 33,
      "surah": 23,
      "text": "فكذبوه وخالفوه وأبوا عن اتباعه لكونه بشرا مثلهم واستنكفوا عن اتباع رسول بشري وكذبوا بلقاء الله في القيامة وأنكروا المعاد الجثماني."
    },
    {
      "ayah": 34,
      "surah": 23,
      "text": "فكذبوه وخالفوه وأبوا عن اتباعه لكونه بشرا مثلهم واستنكفوا عن اتباع رسول بشري وكذبوا بلقاء الله في القيامة وأنكروا المعاد الجثماني."
    },
    {
      "ayah": 35,
      "surah": 23,
      "text": "وقالوا \" أيعدكم أنكم إذا متم وكنتم ترابا وعظاما أنكم مخرجون هيهات هيهات لما توعدون \" أي بَعُدَ بَعُدَ ذلك."
    },
    {
      "ayah": 36,
      "surah": 23,
      "text": "وقالوا \" أيعدك أنكم إذا متم وكنتم ترابا وعظاما أنكم مخرجون هيهات هيهات لما توعدون \" أي بَعُدَ بَعُدَ ذلك."
    },
    {
      "ayah": 37,
      "surah": 23,
      "text": "وقالوا \" أيعدك أنكم إذا متم وكنتم ترابا وعظاما أنكم مخرجون هيهات هيهات لما توعدون \" أي بَعُدَ بَعُدَ ذلك."
    },
    {
      "ayah": 38,
      "surah": 23,
      "text": "\" إن هو إلا رجل افتري على الله كذبا \" أي فيما جاءكم به من الرسالة والنذارة والإخبار بالمعاد \" وما نحن له بمؤمنين \"."
    },
    {
      "ayah": 39,
      "surah": 23,
      "text": "قال رب انصرني بما كذبون \" أي استفتح عليهم الرسول واستنصر ربه عليهم فأجاب دعاءة."
    },
    {
      "ayah": 4,
      "surah": 23,
      "text": "وقوله \" والذين هم للزكاة فاعلون \" الأكثرون على أن المراد بالزكاة ههنا زكاة الأموال مع أن هذه الآية مكية وإنما فرضت الزكاة بالمدينة في سنة اثنتين من الهجرة والظاهر أن التي فرضت بالمدينة إنما هى ذات النصب والمقادير الخاصة وإلا فالظاهر أن أصل الزكاة كان واجبا بمكة قال تعالى في سورة الأنعام وهي مكية \" وآتوا حقه يوم حصاده \"وقد يحتمل أن يكون المراد بالزكاة ههنا زكاة النفس من الشرك والدنس كقوله \" قد أفلح من زكاها وقد خاب من دساها \" وكقوله \" وويل للمشركين الذين لا يؤتون الزكاة \" على أحد القولين في تفسيرهما وقد يحتمل أن يكون كلا الأمرين مرادا وهو زكاة النفوس وزكاة الأموال قاله من جملة زكاة النفس والمؤمن الكامل هو الذي يفعل هذا وهذا والله أعلم وقوله."
    },
    { "ayah": 40, "surah": 23, "text": "\" قال عما قليل ليصبحن نادمين\" أي بمخالفتك وعنادك فيما جئتهم به." },
    {
      "ayah": 41,
      "surah": 23,
      "text": "\" فأخذتهم الصيحة بالحق \" أي وكانوا يستحقون ذلك من الله بكفرهم وطغيانهم والظاهر أنه اجتمع عليهم صيحة مع الريح الصرصر العاصف القوي البارد \" تدمر كل شيء بأمر ربها فأصبحوا لا يُرى إلا مساكنهم \" وقوله \" فجعلناهم غثاء \" أي صرعى هلكى كغثاء السيل وهو الشيء الحقير التافه الهالك الذي لا ينتفع بشيء منه \" فبعدا للقوم الظالمين \" كقوله \" وما ظلمناهم ولكن كانوا هم الظالمين \" أي بكفرهم وعنادهم ومخالفة رسول الله فليحذر السامعون أن يكذبوا رسولهم."
    },
    { "ayah": 42, "surah": 23, "text": "يقول تعالى \" ثم أنشأنا من بعدهم قرونا آخرين \" أي أمما وخلائق." },
    {
      "ayah": 43,
      "surah": 23,
      "text": "\" ما تسبق من أمة أجلها وما يستأخرون \" يعني بل يؤخذون على حسب ما قدر لهم تعالى في كتابه المحفوظ وعلمه قبل كونهم أمة بعد أمة وقرنا بعد قرن وجيلا بعد جيل وخلفا بعد سلف."
    },
    {
      "ayah": 44,
      "surah": 23,
      "text": "\" ثم أرسلنا رسلنا تترى \" قال ابن عباس يعني يتبع بعضهم بعضا وهذا كقوله تعالى \" ولقد بعثنا في كل أمة رسولا أن اعبدوا الله واجتنبوا الطاغوت فمنهم من هدى الله ومنهم من حقت عليه الضلالة \" وقوله \" كلما جاء أمة رسولها كذبوه \" يعني جمهورهم وأكثرهم كقوله تعالى \" يا حسرة على العباد ما يأتيهم من رسول إلا كانوا به يستهزئون \" وقوله \" فأتبعنا بعضهم بعضا \" أي أهلكناهم كقوله \" وكم أهلكنا من القرون من بعد نوح \" وقوله \" وجعلناهم أحاديث \" أي أخبارا وأحاديث للناس كقوله \" فجعلناهم أحاديث ومزقناهم كل ممزق \"."
    },
    {
      "ayah": 45,
      "surah": 23,
      "text": "يخبر تعالى أنه بعث رسوله موسى وأخاه هارون إلى فرعون وملئه بالآيات والحجج الدامغات والبراهين القاطعات."
    },
    { "ayah": 46, "surah": 23, "text": "وأن فرعون وقومه استكبروا عن اتباعهما والانقياد لأمرهما." },
    { "ayah": 47, "surah": 23, "text": "لكونهما بشرين كما أنكرت الأمم الماضية بعثة الرسل من البشر تشابهت قلوبهم." },
    { "ayah": 48, "surah": 23, "text": "فأهلك الله فرعون وملئه وأغرقهم في يوم واحد أجمعين." },
    {
      "ayah": 49,
      "surah": 23,
      "text": "وأنزل على موسى الكتاب وهو التوراة فيها أحكامه وأوامره ونواهيه وذلك بعد أن قصم الله فرعون والقبط وأخذهم أخذ عزيز مقتدر وبعد أن أنزل الله التوراة لم يهلك أما بعامة بل أمر المؤمنين بقتال الكافرين كما قال تعالى \" ولقد آتينا موسى الكتاب من بعد ما أهلكنا القرون الأولى بصائر للناس وهدى ورحمة لعلهم يتذكرون \"."
    },
    {
      "ayah": 5,
      "surah": 23,
      "text": "\"والذين هم لفروجهم حافظون إلا على أزواجهم أو ما ملكت أيمانهم فإنهم غير ملومين فمن ابتغى وراء ذلك فأولئك هم العادون \" أي والذين قد حفظوا فروجهم من الحرام فلا يقعون فيما نهاهم الله عنه من زنا ولواط لا يقربون سوى أزواجهم التي أحلها الله لهم أو ما ملكت أيمانهم من السراري ومن تعاطي ما أحله الله له فلا لوم عليه ولا حرج ولهذا قال \" فإنهم غير ملومين فمن ابتغى وراء ذلك \" أي غير الأزواج والإماء \" فأولئك هم العادون \" أي المعتدون وقال ابن جرير حدثنا محمد بن بشار حدثنا عبد الأعلى حدثنا سعيد بن قتادة: أن امرأة اتخذت مملوكها وقالت تأولت آية من كتاب الله \" أو ما ملكت أيمانهم \" فأتي بها عمر بن الخطاب رضي الله عنه وقال له ناس أصحاب النبي صلى الله عليه وسلم: تأولت آية من كتاب الله عز وجل على غير وجهها قال فضرب العبد وجز رأسه وقال أنت بعده حرام على كل مسلم هذا أثر غريب منقطع ذكره ابن جرير في تفسير أول سورة المائدة وهو ههنا أليق وإنما حرمها على الرجال معاملة لها بنقيض قصدها والله أعلم وقد استدل الإمام الشافعي - رحمه الله - ومن وافقة على تحريم الاستمناء باليد بهذه الآية الكريمة \" والذين هم لفروجهم حافظون إلا على أزواجهم أو ما ملكت أيمانهم \" قال فهذا الصنيع خارج عن هذين القسمين وقد قال الله تعالى \" فمن ابتغى وراء ذلك فأولئك هم العادون \" وقد استأنسوا بحديث رواه الإمام الحسن بن عرفة في جزئه المشهور حيث قال: حدثني علي بن ثابت الجزري عن مسلمة بن جعفر عن حسان بن حميد عن أنس بن مالك عن النبي صلى الله عليه وسلم قال \" سبعة لا ينظر الله إليهم يوم القيامة ولا يزكيهم ولا يجمعهم مع العالمين ويدخلهم النار في أول الداخلين إلا أن يتوبوا ومن تاب تاب الله عليه: الناكح يده والفاعل والمفعول به ومدمن الخمر والضارب والديه حتى يستغيثا والمؤذي جيرانه حتى يلعنوه والناكح حليلة جاره \" هذا حديث غريب وإسناده فيه من لا يعرف لجهالته والله أعلم."
    },
    {
      "ayah": 50,
      "surah": 23,
      "text": "يقول تعالى مخبرا عن عبده ورسوله عيسى ابن مريم عليه الصلاة والسلام أنه جعلهما آية للناس أي حجة قاطعة على قدرته على ما يشاء فإنه خلق آدم من غير أب ولا أم وخلق حواء من ذكر بلا أنثى وخلق عيسى من أنثى بلا ذكر وخلق بقية الناس من ذكر وأنثى وقوله \" وآويناهما إلى ربوة ذات قرار ومعين \" قال الضحاك عن ابن عباس: الربوة المكان المرتفع من الأرض وهو أحسن ما يكون فيه النبات وكذا قال مجاهد وعكرمة وسعيد بن جبير وقتاده قال ابن عباس: وقوله \" ذات قرار \" يقول ذات خصب \" ومعين \" يعني ماء ظاهرا وكذا قال مجاهد وعكرمة وسعيد بن جبير وقتادة وقال مجاهد ربوة مستوية وقال سعيد بن جبير \" ذات قرار ومعين \" استوى الماء فيها وقال مجاهد وقتادة \" ومعين \" الماء الجاري. ثم اختلف المفسرون في مكان هذه الربوة من أي أرض هي؟ فقال عبد الرحمن بن زيد بن أسلم: ليس الربى إلا بمصر والماء حين يسيل يكون الربي عليها القرى ولولا الربي غرقت القرى وروي عن وهب بن منبه نحو هذا وهو بعيد جدا. وروى ابن أبي حاتم عن سعيد بن المسيب في قوله \" وآويناهما إلى ربوة ذات قرار ومعين \" قال هي دمشق قال وروي عن عبدالله بن سلام والحسن وزيد بن أسلم وخاله بن معدان نحو ذلك. وقال ابن أبي حاتم حدثنا أبو سعيد الأشج حدثنا وكيع عن إسرائيل عن سماك عن عكرمة عن ابن عباس \" ذات قرار ومعين \" قال: أنهار دمشق وقال ليث بن أبي سليم عن مجاهد \" وآويناهما إلى ربوة \" قال عيسى ابن مريم وأمه حين أويا إلى غوطة دمشق وما حولها وقال عبد الرزاق عن بشر بن رافع عن أبي عبدالله بن عم أبي هريرة قال سمعت أبا هريرة يقول: في قول الله تعالى \" إلى ربوة ذات قرار ومعين \" قال هي الرملة من فلسطين وقال ابن أبي حاتم حدثنا أبي حدثنا إبراهيم بن محمد بن يوسف الفريابي حدثنا رواد بن الجراح حدثنا عبدالله بن عباد الخواص أبو عتبة حدثنا الشيباني عن ابن وعلة عن كريب السحولي عن مرة البهذي قال سمعت رسول الله صلى الله عليه وسلم يقول لرجل \" إنك تموت بالربوة\" فمات بالرملة وهذا حديث غريب جدا وأقرب الأقوال في ذلك ما رواه العوفي عن ابن عباس في قوله \" وآويناهما إلى ربوة ذات قرار ومعين \" قال المعين الماء الجاري وهو النهر الذي قال الله تعالى \" قد جعل ربك تحتك سريا \" وكذا قال الضحاك وقتادة \" إلى ربوة ذات قرار ومعين \" هو بيت المقدس فهذا والله أعلم هو الأظهر لأنه المذكور في الآية الأخرى والقرآن يفسر بعضه بعضا وهذا أولى ما يفسر به ثم الأحاديث الصحيحة ثم الآثار."
    },
    {
      "ayah": 51,
      "surah": 23,
      "text": "يأمر تعالى عباده المرسلين- عليهم الصلاة والسلام أجمعين - بالأكل من الحلال والقيام بالصالح من الأعمال فدل هذا على أن الحلال عون على العمل الصالح فقام الأنبياء عليهم السلام بهذا أتم القيام وجمعوا بين كل خير قولا وعملا ودلالة ونصحا فجزاهم الله عن العباد خيرا. قال الحسن البصري في قوله \" يا أيها الرسل كلوا من الطيبات \" قال أما والله ما أمركم بأصفركم ولا أحمركم ولا حلوكم ولا حامضكم ولكن قال انتهوا إلى الحلال منه وقال سعيد بن جبير والضحاك \" كلوا من الطيبات \" يعني الحلال وقال أبو إسحاق السبيعي عن أبي ميسرة عمرو بن شرحبيل كان عيسى ابن مريم يأكل من غزل أمه وفي الصحيح \" وما من نبي إلا رعى الغنم - قالوا وأنت يا رسول الله؟ - قال نعم وأنا كنت أرعاها على قراريط لأهل مكة\" وفي الصحيح \" إن داود عليه السلام كان يأكل من كسب يده \"وفي الصحيحين \" إن أحب الصيام إلى الله صيام داود وأحب القيام إلى الله قيام داود كان ينام نصف الليل ويقوم ثلثه وينام سدسه وكان يصوم يوما ويفطر يوما ولا يفر إذا لاقي \"وقال ابن أبي حاتم حدثنا أبي حدثنا أبو اليمان الحكم بن نافع حدثنا أبو بكر بن أبي مريم عن ضمرة بن حبيب أن أم عبدالله بنت شداد بن أوس قالت بعثت إلى النبي صلى الله عليه وسلم بقدح لبن عند فطره وهو صائم وذلك في أول النهار وشدة الحر فرد إليها رسولها أَنَّى كانت لك الشاة؟ فقالت اشتريتها من مالي فشرب منه فلما كان من الغد أتته أم عبدالله بنت شداد فقالت يا رسول الله بعثت إليك بلبن مرثية لك من طول النهار وشدة الحر فرددت إلي الرسول فيه فقال لها \" بذلك أمرت الرسل أن لاتأكل إلا طيبا ولا تعمل إلا صالحا \"وقد ثبت في صحيح مسلم وجامع الترمذي ومسند الإمام أحمد واللفظ له من حديث فضيل بن مرزوق عن عدي بن ثابت عن أبي حازم عن أبي هريرة رضي الله عنه قال قال رسول الله صلى الله عليه وسلم \" يا أيها الناس إن الله طيب لا يقبل إلا طيبا وإن الله أمر المؤمنين بما أمر به المرسلين فقال \" يا أيها الرسل كلوا من الطيبات واعملوا صالحا إني بما تعملون عليم \" وقال \" يا أيها الذين آمنوا كلوا من طيبات ما رزقناكم \" ثم ذكر الرجل يطيل السفر أشعث أغبر ومطعمه حرام ومشربه حرام وملبسه حرام وغذي بالحرام يمد يديه إلى السماء يا رب يا رب فأنَّى يُستجاب لذلك وقال الترمذي حسن غريب لا نعرفه إلا من حديث فضيل بن مرزوق."
    },
    {
      "ayah": 52,
      "surah": 23,
      "text": "وقوله\" وإن هذه أمتكم أمة واحدة \" أي دينكم يا معشر الأنبياء دين واحد وملة واحدة وهو الدعوة إلى عبادة الله وحده لا شريك له ولهذا قال \" وأنا ربكم فاتقون \" وقد تقدم الكلام على ذلك في سورة الأنبياء وإن قوله \" أمة واحدة \" منصوب على الحال."
    },
    {
      "ayah": 53,
      "surah": 23,
      "text": "وقوله \" فتقطعوا أمرهم بينهم زبرا \" أي الأمم الذين بعثت إليهم الأنبياء \" كل حزب بما لديهم فرحون \" أي يفرحون بما هم فيه من الضلال لأنهم يحسبون أنهم مهتدون ولهذا قال متهددا لهم ومتواعدا."
    },
    {
      "ayah": 54,
      "surah": 23,
      "text": "\" فذرهم في غمرتهم \" أي في غيهم وضلالهم \" حتى حين \" أي إلى حين حينهم وهلاكهم كما قال تعالى \" فمهل الكافرين أمهلهم رويدا \" وقال تعالى \" ذرهم يأكلوا ويتمتعوا ويلههم الأمل فسوف يعلمون \"."
    },
    {
      "ayah": 55,
      "surah": 23,
      "text": "وقوله \" أيحسبون أنما نمدهم به من مال وبنين نسارع لهم في الخيرات بل لا يشعرون \" يعني أيظن هؤلاء المغرورون أن ما نعطيهم من الأموال والأولاد لكرامتهم علينا ومعزتهم عندنا كلا ليس الأمر كما يزعمون في قولهم \" نحن أكثر أموالا وأولادا وما نحن بمعذبين \" لقد أخطئوا في ذلك وخاب رجاؤهم بل إنما نفعل بهم ذلك استدراجا وإنظارا وإملاء ولهذا قال \" بل لا يشعرون \" كما قال تعالى \" فلا تعجبك أموالهم ولا أولادهم إنما يريد الله ليعذبهم بها في الحياة الدنيا \" الآية. وقال تعالى \" إنما نملي لهم ليزدادوا إثما \" وقال تعالى \" فذرني ومن يكذب بهذا الحديث سنستدرجهم من حيث لا يعلمون وأملي لهم \" الآية وقال \" ذرني ومن خلقت وحيدا. إلى قوله - عنيدا \" وقال تعالى \" وما أموالكم ولا أولادكم بالتي تقربكم عندنا زلفى إلا من آمن وعمل صالحا \" الآية. والآيات في هذا كثيرة قال قتادة في قوله \" أيحسبون أنما نمدهم به من مال وبنين نسارع لهم في الخيرات بل لا يشعرون \" قال مكر والله بالقوم في أموالهم وأولادهم يا ابن آدم فلا تعتبر الناس بأموالهم وأولادهم ولكن اعتبرهم بالإيمان والعمل الصالح. وقال الإمام أحمد حدثنا محمد بن عبيد حدثنا أبان بن إسحاق عن الصباح بن محمد عن مرة الهمداني حدثنا عبدالله بن مسعود رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم \" إن الله قسم بينكم أخلاقكم كما قسم بينكم أرزاقكم وإن الله يعطي الدنيا من يحب ومن لا يحب ولا يعطي الدين إلا لمن أحب فمن أعطاه الله الدين فقد أحبه والذي نفس محمد بيده لا يسلم عبد حتى يسلم قلبه ولسانه ولا يؤمن حتى يأمن جاره بوائقه قالوا وما بوائقه يا رسول الله؟ قال \" غشمه وظلمه\" ولا يكسب عبد مالا من حرام فينفق منه فيبارك فيه ولا يتصدق به فيقبل منه ولا يتركه خلف ظهره إلا كان زاده إلى النار إن الله لا يمحوا السيء بالسيء ولكن يمحو السيء بالحسن إن الخبيث لا يمحو الخبيث \"."
    },
    {
      "ayah": 56,
      "surah": 23,
      "text": "وقوله \" أيحسبون أنما نمدهم به من مال وبنين نسارع لهم في الخيرات بل لا يشعرون \" يعني أيظن هؤلاء المغرورون أن ما نعطيهم من الأموال والأولاد لكرامتهم علينا ومعزتهم عندنا كلا ليس الأمر كما يزعمون في قولهم \" نحن أكثر أموالا وأولادا وما نحن بمعذبين \" لقد أخطئوا في ذلك وخاب رجاؤهم بل إنما نفعل بهم ذلك استدراجا وإنظارا وإملاء ولهذا قال \" بل لا يشعرون \" كما قال تعالى \" فلا تعجبك أموالهم ولا أولادهم إنما يريد الله ليعذبهم بها في الحياة الدنيا \" الآية. وقال تعالى \" إنما نملي لهم ليزدادوا إثما \" وقال تعالى \" فذرني ومن يكذب بهذا الحديث سنستدرجهم من حيث لا يعلمون وأملي لهم \" الآية وقال \" ذرني ومن خلقت وحيدا. إلى قوله - عنيدا \" وقال تعالى \" وما أموالكم ولا أولادكم بالتي تقربكم عندنا زلفى إلا من آمن وعمل صالحا \" الآية. والآيات في هذا كثيرة قال قتادة في قوله \" أيحسبون أنما نمدهم به من مال وبنين نسارع لهم في الخيرات بل لا يشعرون \" قال مكر والله بالقوم في أموالهم وأولادهم يا ابن آدم فلا تعتبر الناس بأموالهم وأولادهم ولكن اعتبرهم بالإيمان والعمل الصالح. وقال الإمام أحمد حدثنا محمد بن عبيد حدثنا أبان بن إسحاق عن الصباح بن محمد عن مرة الهمداني حدثنا عبدالله بن مسعود رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم \" إن الله قسم بينكم أخلاقكم كما قسم بينكم أرزاقكم وإن الله يعطي الدنيا من يحب ومن لا يحب ولا يعطي الدين إلا لمن أحب فمن أعطاه الله الدين فقد أحبه والذي نفس محمد بيده لا يسلم عبد حتى يسلم قلبه ولسانه ولا يؤمن حتى يأمن جاره بوائقه قالوا وما بوائقه يا رسول الله؟ قال \" غشمه وظلمه\" ولا يكسب عبد مالا من حرام فينفق منه فيبارك فيه ولا يتصدق به فيقبل منه ولا يتركه خلف ظهره إلا كان زاده إلى النار إن الله لا يمحوا السيء بالسيء ولكن يمحو السيء بالحسن إن الخبيث لا يمحو الخبيث \"."
    },
    {
      "ayah": 57,
      "surah": 23,
      "text": "يقول تعالى \" إن الذين هم من خشية ربهم مشفقون \" أي هم مع إحسانهم وإيمانهم وعملهم الصالح مشفقون من الله خائفون منه وجلون من مكره بهم كما قال الحسن البصري: إن المؤمن جمع إحسانا وشفقة وإن الكافر جمع إساءة وأمنا."
    },
    {
      "ayah": 58,
      "surah": 23,
      "text": "\" والذين هم بآيات ربهم يؤمنون \" أي يؤمنون بآياته الكونية والشرعية كقوله تعالى إخبارا عن مريم \" وصدقت بكلمات ربها وكتبه \" أي أيقنت أن ما كان إنما هو عن قدر الله وقضائه وما شرعه الله فهو إن كان أمرا فمما يحبه ويرضاه وإن كان نهيا فهو مما يكرهه ويأباه وإن كان خيرا فهو حق."
    },
    {
      "ayah": 59,
      "surah": 23,
      "text": "كما قال الله \" والذين هم بربهم لا يشركون \" أي لا يعبدون معه غيره بل يوحدونه ويعلمون أنه لا إله إلا الله أحدا صمدا لم يتخذ صاحبة ولا ولدا وأنه لا نظير له ولا كفء له."
    },
    {
      "ayah": 6,
      "surah": 23,
      "text": "\"والذين هم لفروجهم حافظون إلا على أزواجهم أو ما ملكت أيمانهم فإنهم غير ملومين فمن ابتغى وراء ذلك فأولئك هم العادون \" أي والذين قد حفظوا فروجهم من الحرام فلا يقعون فيما نهاهم الله عنه من زنا ولواط لا يقربون سوى أزواجهم التي أحلها الله لهم أو ما ملكت أيمانهم من السراري ومن تعاطي ما أحله الله له فلا لوم عليه ولا حرج ولهذا قال \" فإنهم غير ملومين فمن ابتغى وراء ذلك \" أي غير الأزواج والإماء \" فأولئك هم العادون \" أي المعتدون وقال ابن جرير حدثنا محمد بن بشار حدثنا عبد الأعلى حدثنا سعيد بن قتادة: أن امرأة اتخذت مملوكها وقالت تأولت آية من كتاب الله \" أو ما ملكت أيمانهم \" فأتي بها عمر بن الخطاب رضي الله عنه وقال له ناس أصحاب النبي صلى الله عليه وسلم: تأولت آية من كتاب الله عز وجل على غير وجهها قال فضرب العبد وجز رأسه وقال أنت بعده حرام على كل مسلم هذا أثر غريب منقطع ذكره ابن جرير في تفسير أول سورة المائدة وهو ههنا أليق وإنما حرمها على الرجال معاملة لها بنقيض قصدها والله أعلم وقد استدل الإمام الشافعي - رحمه الله - ومن وافقة على تحريم الاستمناء باليد بهذه الآية الكريمة \" والذين هم لفروجهم حافظون إلا على أزواجهم أو ما ملكت أيمانهم \" قال فهذا الصنيع خارج عن هذين القسمين وقد قال الله تعالى \" فمن ابتغى وراء ذلك فأولئك هم العادون \" وقد استأنسوا بحديث رواه الإمام الحسن بن عرفة في جزئه المشهور حيث قال: حدثني علي بن ثابت الجزري عن مسلمة بن جعفر عن حسان بن حميد عن أنس بن مالك عن النبي صلى الله عليه وسلم قال \" سبعة لا ينظر الله إليهم يوم القيامة ولا يزكيهم ولا يجمعهم مع العالمين ويدخلهم النار في أول الداخلين إلا أن يتوبوا ومن تاب تاب الله عليه: الناكح يده والفاعل والمفعول به ومدمن الخمر والضارب والديه حتى يستغيثا والمؤذي جيرانه حتى يلعنوه والناكح حليلة جاره \" هذا حديث غريب وإسناده فيه من لا يعرف لجهالته والله أعلم."
    },
    {
      "ayah": 60,
      "surah": 23,
      "text": "وقوله \" والذين يؤتون ما آتوا وقلوبهم وجلة أنهم إلى ربهم راجعون \" أي يعطون العطاء وهم خائفون وجلون أن لا يتقبل منهم لخوفهم أن يكونوا قد قصروا في القيام بشروط الإعطاء وهذا من باب الإشفاق والاحتياط كما قال الإمام أحمد حدثنا يحيى بن آدم حدثنا مالك بن مغول حدثنا عبد الرحمن بن سعيد بن وهب عن عائشة أنها قالت يا رسول الله الذين يؤتون ما آتوا وقلوبهم وجلة هو الذي يسرق ويزني ويشرب الخمر وهو يخاف الله عز وجل؟ قال \" لا يا بنت الصديق ولكنه الذي يصلي ويصوم ويتصدق وهو يخاف الله عز وجل \"وهكذا رواه الترمذي وابن أبي حاتم من حديث مالك بن مغول به بنحوه وقال \" لا يا ابنة الصديق ولكنهم الذين يصلون ويصومون ويتصدقون وهم يخافون ألا يتقبل منهم \"."
    },
    {
      "ayah": 61,
      "surah": 23,
      "text": "\" أولئك يسارعون في الخيرات \" وقال الترمذي وروى هذا الحديث من حديث عبد الرحمن بن سعيد عن أبي حازم عن أبي هريرة عن النبي صلى الله عليه وسلم نحو هذا وهكذا قال ابن عباس ومحمد بن كعب القرظي والحسن البصري في تفسير هذه الآية وقد قرأ آخرون هذه الآية \" والذين يؤتون ما آتوا وقلوبهم وجلة \" أي يفعلون ما يفعلون وهم خائفون وروي هذا مرفوعا إلى النبي صلى الله عليه وسلم أنه قرأها كذلك قال الإمام أحمد حدثنا عفان حدثنا صخر بن جويرية حدثنا إسماعيل المكي حدثنا أبو خلف مولى بني جمح أنه دخل مع عبيد بن عمير على عائشة رضي الله عنها فقالت مرحبا بأبي عاصم ما يمنعك أن تزورنا أو تلم بنا؟ فقال أخشى أن أملل فقالت: ما كنت لتفعل؟ قال جئت لأسألك عن آية من كتاب الله عز وجل كيف كان رسول الله صلى الله عليه وسلم يقرؤها؟ قالت أَيَّةُ آيةٍ؟ قال \" الذين يؤتون ما آتوا \" \" والذين يأتون ما أتوا \" فقالت أيتهما أحب إليك ؟ فقلت والذي نفسي بيده لأحدهما أحب إلي من الدنيا جميعا أو الدنيا وما فيها قالت وما هي ؟ فقلت \" الذين يأتون ما أتوا \" فقالت أشهد أن رسول الله صلى الله عليه وسلم كذلك كان يقرؤها وكذلك أنزلت ولكن الهجاء حرف. فيه إسماعيل بن مسلم المكي وهو ضعيف والمعنى على القراءة الأولى وهي قراءة الجمهور السبعة وغيرهم أظهر لأنه قال \" أولئك يسارعون في الخيرات وهم لها سابقون \" فجعلهم من السابقين ولو كان المعنى على القراءة الأخرى لأوشك أن لا يكونوا من السابقين بل من المقتصدين أو المقصرين والله أعلم."
    },
    {
      "ayah": 62,
      "surah": 23,
      "text": "يقول تعالى مخبرا عن عدله في شرعه على عبادة في الدنيا أنه لا يكلف نفسا إلا وسعها أي إلا ما تطيق حمله والقيام به وأنه يوم القيامة يحاسبهم بأعمالهم التي كتبها عليهم في كتاب مسطور لا يضيع منه شيء ولهذا قال \" ولدينا كتاب ينطق بالحق \" يعني كتاب الأعمال \" وهم لا يظلمون \" أي لا يبخسون من الخير شيئا وأما السيئات فيعفو ويصفح عن كثير منها لعباده المؤمنين ثم قال منكرا على الكفار والمشركين من قريش."
    },
    {
      "ayah": 63,
      "surah": 23,
      "text": "\" بل قلوبهم في غمرة \" أي في غفلة وضلالة من هذا أي القرآن الذي أنزل على رسوله صلى الله عليه وسلم وقوله \" ولهم أعمال من دون ذلك هم لها عاملون \"قال الحكم بن أبان عن عكرمة عن ابن عباس \" ولهم أعمال \" أي سيئة من دون ذلك يعني الشرك \" هم لها عاملون \" قال لا بد أن يعملوها كذا روي عن مجاهد والحسن وغير واحد وقال آخرون \" ولهم أعمال من دون ذلك هم لها عاملون \" أي قد كتبت عليهم أعمال سيئة لا بد أن يعملوها قبل موتهم لا محالة لتحق عليهم كلمة العذاب وروي نحو هذا عن مقاتل بن حيان والسدي وعبد الرحمن بن زيد بن أسلم وهو ظاهر قوي حسن وقد قدمنا في حديث ابن مسعود \" فوالذي لا إله غيره إن الرجل ليعمل بعمل أهل الجنة حتى ما يكون بينه وبينها إلا ذراع فيسبق عليه الكتاب فيعمل بعمل أهل النار فيدخلها \"."
    },
    {
      "ayah": 64,
      "surah": 23,
      "text": "وقوله \" حتى إذا أخذنا مترفيهم بالعذاب إذا هم يجأرون \" يعني حتى إذا جاء مترفيهم وهم المنعمون في الدنيا عذاب الله وبأسه ونقمته بهم \" إذا هم يجأرون \" أي يصرخون ويستغيثون كما قال تعالى \" وذرني والمكذبين أولي النعمة ومهلهم قليلا إن لدينا أنكالا وجحيما \" الآية وقال تعالى \" وكم أهلكنا من قبلهم من قرن فنادوا ولات حين مناص \"."
    },
    {
      "ayah": 65,
      "surah": 23,
      "text": "وقوله \" لا تجأروا اليوم إنكم منا لا تنصرون \" أي لا يجيركم أحد مما حل بكم سواء جأرتم أو سكتم لا محيد ولا مناص ولا وزر لزم الأمر ووجب العذاب ثم ذكر أكبر ذنوبهم."
    },
    {
      "ayah": 66,
      "surah": 23,
      "text": "فقال \" قد كانت آياتي تتلى عليكم فكنتم على أعقابكم تنكصون \" أي إذا دعيتم أبيتم إن طلبتم امتنعتم \" ذلكم بأنه إذا دعي الله وحده كفرتم وإن يشرك به تؤمنوا فالحكم لله العلي الكبير\"."
    },
    {
      "ayah": 67,
      "surah": 23,
      "text": "وقوله \" مستكبرين به سامرا تهجرون \" في تفسيره قولان \"أحدهما\" أن مستكبرين حال منهم حين نكوصهم عن الحق وإبائهم إياه استكبارا عليه واحتقارا له ولأهله فعلى هذا الضمير في به فيه ثلاثة أقوال \"أحدها\" أنه الحرم أي مكة ذموا لأنهم كانوا يسمرون فيه بالهجر من الكلام. \"الثاني\": أنه ضمير للقرآن كانوا يسمرون ويذكرون القرآن بالهجر من الكلام: إنه سحر إنه شعر إنه كهانة إلى غير ذلك من الأقوال الباطلة. \"والثالث\": أنه محمد صلى الله عليه وسلم كانوا يذكرونه في سمرهم بالأقوال الفاسدة ويضربون له الأمثال الباطلة من أنه شاعر أو كاهن أو ساحر أو كذاب أو مجنون فكل ذلك باطل بل هو عبدالله ورسوله الذي أظهره الله عليهم وأخرجهم من الحرم صاغرين أذلاء وقيل المراد بقوله \" مستكبرين به \" أي بالبيت يفتخرون به معتقدون أنهم أولياؤه وليسوا به كما قال النسائي في التفسير من سننه أخبرنا أحمد بن سليمان أخبرنا عبدالله عن إسرائيل عن عبد الأعلى أنه سمع سعيد بن جبير يحدث عن ابن عباس أنه قال: إنما كره السمر حين نزلت هذه الآية \" مستكبرين به سامرا تهجرون \" فقال مستكبرين بالبيت يقولون نحن أهله سامرا قال كانوا يتكبرون ويسمرون فيه ولا يعمرونه وقد أطنب ابن أبي حاتم ههنا بما هذا حاصله."
    },
    {
      "ayah": 68,
      "surah": 23,
      "text": "يقول تعالى منكرا على المشركين في عدم تفهمهم للقرآن العظيم وتدبرهم له وإعراضهم عنه مع أنهم قد خصوا بهذا الكتاب الذي لم ينزل الله على رسول أكمل منه ولا أشرف لا سيما آباؤهم الذين ماتوا في الجاهلية حيث لم يبلغهم كتاب ولا أتاهم نذير فكان اللائق بهؤلاء أن يقابلوا النعمة التي أسداها الله عليهم بقبولها والقيام بشكرها وتفهمها والعمل بمقتضاها آناء الليل وأطراف النهار كما فعله النجباء منهم ممن أسلم واتبع الرسـول صلى الله عليه وسلم ورضي عنهم. وقال قتادة \" أفلم يدبروا القول \" إذا والله يجدون في القرآن زاجرا عن معصية الله لو تدبره القوم وعقلوه ولكنهم أخذوا بما تشابه به فهلكوا عند ذلك."
    },
    {
      "ayah": 69,
      "surah": 23,
      "text": "ثم قال منكرا على الكافرين من قريش \" أم لم يعرفوا رسولهم فهم له منكرون \" أي أفهم لا يعرفون محمدا وصدقه وأمانته وصيانته التي نشأ بها فيهم أي أفيقدرون على إنكار ذلك والمباهتة فيه ولهذا قال جعفر بن أبي طالب رضي الله عنه للنجاشي ملك الحبشة: أيها الملك إن الله بعث فينا رسولا نعرف نسبه وصدقه وأمانته وهكذا قال المغيرة بن شعبة لنائب كسرى حين بارزهم وكذلك قال أبو سفيان صخر بن حرب لملك الروم هرقل حين سأله وأصحابه عن صفات النبي صلى الله عليه وسلم ونسبه وصدقه وأمانته وكانوا بَعْدُ كفارا لم يسلموا ومع هذا لم يمكنهم إلا الصدق فاعترفوا بذلك."
    },
    {
      "ayah": 7,
      "surah": 23,
      "text": "\"والذين هم لفروجهم حافظون إلا على أزواجهم أو ما ملكت أيمانهم فإنهم غير ملومين فمن ابتغى وراء ذلك فأولئك هم العادون \" أي والذين قد حفظوا فروجهم من الحرام فلا يقعون فيما نهاهم الله عنه من زنا ولواط لا يقربون سوى أزواجهم التي أحلها الله لهم أو ما ملكت أيمانهم من السراري ومن تعاطي ما أحله الله له فلا لوم عليه ولا حرج ولهذا قال \" فإنهم غير ملومين فمن ابتغى وراء ذلك \" أي غير الأزواج والإماء \" فأولئك هم العادون \" أي المعتدون وقال ابن جرير حدثنا محمد بن بشار حدثنا عبد الأعلى حدثنا سعيد بن قتادة: أن امرأة اتخذت مملوكها وقالت تأولت آية من كتاب الله \" أو ما ملكت أيمانهم \" فأتي بها عمر بن الخطاب رضي الله عنه وقال له ناس أصحاب النبي صلى الله عليه وسلم: تأولت آية من كتاب الله عز وجل على غير وجهها قال فضرب العبد وجز رأسه وقال أنت بعده حرام على كل مسلم هذا أثر غريب منقطع ذكره ابن جرير في تفسير أول سورة المائدة وهو ههنا أليق وإنما حرمها على الرجال معاملة لها بنقيض قصدها والله أعلم وقد استدل الإمام الشافعي - رحمه الله - ومن وافقة على تحريم الاستمناء باليد بهذه الآية الكريمة \" والذين هم لفروجهم حافظون إلا على أزواجهم أو ما ملكت أيمانهم \" قال فهذا الصنيع خارج عن هذين القسمين وقد قال الله تعالى \" فمن ابتغى وراء ذلك فأولئك هم العادون \" وقد استأنسوا بحديث رواه الإمام الحسن بن عرفة في جزئه المشهور حيث قال: حدثني علي بن ثابت الجزري عن مسلمة بن جعفر عن حسان بن حميد عن أنس بن مالك عن النبي صلى الله عليه وسلم قال \" سبعة لا ينظر الله إليهم يوم القيامة ولا يزكيهم ولا يجمعهم مع العالمين ويدخلهم النار في أول الداخلين إلا أن يتوبوا ومن تاب تاب الله عليه: الناكح يده والفاعل والمفعول به ومدمن الخمر والضارب والديه حتى يستغيثا والمؤذي جيرانه حتى يلعنوه والناكح حليلة جاره \" هذا حديث غريب وإسناده فيه من لا يعرف لجهالته والله أعلم."
    },
    {
      "ayah": 70,
      "surah": 23,
      "text": "وقوله \" أم يقولون به جنة \" يحكي قول المشركين عن النبي صلى الله عليه وسلم أنه تقول القرآن أي افتراه من عنده أو أن به جنونا لا يدري ما يقول وأخبر عنهم أن قلوبهم لا تؤمن به وهم يعلمون بطلان ما يقولونه في القران فإنه أتاهم من كلام الله ما لا يطاق ولا يدافع وقد تحداهم وجميع أهل الأرض أن يأتوا بمثله إن استطاعوا ولا يستطيعون أبد الآبدين ولهذا قال \" بل جاءهم بالحق وأكثرهم للحق كارهون \" يحتمل أن تكون هذه جملة حالية أي في حالة كراهة أكثرهم للحق ويحتمل أن تكون خبرية مستأنفة والله أعلم. وقال قتادة ذكر لنا أن نبي الله صلى الله عليه وسلم لقي رجلا \" فقال له أسلم \"فقال الرجل إنك لتدعوني إلى أمر أنا له كاره فقال نبي الله صلى الله عليه وسلم \" وإن كنت كارها \" وذكر لنا أنه لقي رجلا فقال له \" أسلم \"فتصعده ذلك وكبر عليه فقال له نبي الله صلى الله عليه وسلم \" أرأيت لو كنت في طريق وعر وعث فلقيت رجلا تعرف وجهه وتعرف نسبه فدعاك إلى طريق واسع سهل أكنت تتبعه؟ \"قال نعم: قال \" فوالذي نفس محمد بيده إنك لفي أوعر من ذلك الطريق لو قد كنت عليه وإني لأدعوك لأسهل من ذلك لو دعيت إليه \"وذكر لنا أن نبي الله صلى الله عليه وسلم لقي رجلا فقال له \" أسلم \"فتصعده ذلك فقال له نبي الله صلى الله عليه وسلم \" أرأيت لو كان لك فتيان أحدهما إذا حدثك صدقك وإذا ائتمنته أدى إليك أهو أحب إليك أم فتـاك الذي إذا حدثك كذبك وإذا ائتمنته خانك؟ \"قال بل فتاي الذي إذا حدثني صدقني وإذا ائتمنته أدى إلي فقال نبي الله صلى الله عليه وسلم \" كذاكم أنتم عند ربكم \"."
    },
    {
      "ayah": 71,
      "surah": 23,
      "text": "وقوله \" ولو اتبع الحق أهواءهم لفسدت السموات والأرض ومن فيهن \" قال مجاهد وأبو صالح والسدي: الحق هو الله عز وجل والمراد لو أجابهم الله إلى ما في أنفسهم من الهوى وشرع الأمور على وفق ذلك لفسدت السموات والأرض ومن فيهن أي لفساد أهوائهم واختلافها كما أخبر عنهم في قولهم \" لولا نُزِّل هذا القرآن على رجل من القريتين عظيم \"ثم قال \" أهم يقسمون رحمة ربك \"وقال تعالى \" قل لو أنتم تملكون خزائن رحمة ربي إذا لأمسكتم خشية الإنفاق \" الآية وقال \" أم لهم نصيب من الملك فإذا لا يؤتون الناس نقيرا \" ففي هذا كله تبيين عجز العباد واختلاف آرائهم وأهوائهم وأنه تعالى هو الكامل في جميع صفاته وأقواله وأفعاله وشرعه وقدره وتدبيره لخلقه تعالى وتقدس فلا إله غيره ولا رب سواه ولهذا قال \" بل أتيناهم بذكرهم \" أي القرآن \" فهم عن ذكرهم معرضون \"."
    },
    {
      "ayah": 72,
      "surah": 23,
      "text": "وقوله \" أم تسألهم خرجا \" قال الحسن أجرا وقال قتادة جعلا \" فخراج ربك خير \" أي أنت لا تسألهم أجرة ولا جعلا ولا شيئا على دعوتك إياهم إلى الهدى بل أنت في ذلك تحتسب عند الله جزيل ثوابه كما قال \" قل ما سألتكم من أجر فهو لكم إن أجري إلا على الله \" وقال \" قل ما أسألكم عليه من أجر وما أنا من المتكلفين \" وقال \" قل لا أسألكم عليه أجرا إلا المودة في القربى \" وقال \" وجاء من أقصى المدينة رجل يسعى قال يا قوم اتبعوا المرسلين اتبعوا من لا يسألكم أجرا \"."
    },
    {
      "ayah": 73,
      "surah": 23,
      "text": "وقوله \" وإنك لتدعوهم إلى صراط مستقيم \" قال الإمام أحمد حدثنا حسن بن موسى حدثنا حماد بن سلمة عن علي بن زيد بن جدعان عن يوسف بن مهران عن ابن عباس أن رسول الله صلى الله عليه وسلم أتاه فيما يرى النائم ملكان فقعد أحدهما عند رجليه والآخر عند رأسه فقال الذي عند رجليه للذي عند رأسه: اضرب مثل هذا ومثل أمته فقال إن مثل هذا ومثل أمته كمثل قوم سفر انتهوا إلى مفازة فلم يكن معهم من الزاد ما يقطعون به المفازة ولا ما يرجعون به فبينما هم كذلك إذ أتاهم رجل في حلة حبرة فقال أرأيتم إن أوردتكم رياضا معشبة وحياضا رواء تتبعوني؟ فقالوا نعم قال فانطلق بهم وأوردهم رياضا معشبة وحياضا رواء فأكلوا وشربوا وسمنوا فقال لهم ألم ألقكم على تلك الحال فجعلت لي إن وردت بكم رياضا معشبة وحياضا رواء أن تتبعوني؟ قالوا بلى قال فإن بين أيديكم رياضا أعشب من هذه وحياضا هي أروى من هذه فاتبعوني قال فقالت طائفة صدق والله لنتبعه وقالت طائفة قد رضينا بهذا نقيم عليه وقال الحافظ أبو يعلى الموصلي حدثنا زهير حدثنا يونس بن محمد حدثنا يعقوب ابن عبدالله الأشعري حدثنا حفص بن حميد عن عكرمة عن ابن عباس عن عمر بن الخطاب رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم \" إني ممسك بحجزكم هلم عن النار هلم عن النار وتغلبونني تتقاحمون فيها تقاحم الفراش والجنادب فأوشك أن أرسل حجزكم وأنا فرطكم على الحوض فتردون علي معا وأشتاتا أعرفكم بسيماكم وأسمائكم كما يعرف الرجل الغريب من الإبل في إبله فيذهب بكم ذات اليمين وذات الشمال فأناشد فيكم رب العالمين أي رب قومي أَيْ رَبِّ أمتي فيقال يا محمد إنك لا تدري ما أحدثوا بعدك إنهم كانوا يمشون بعدك القهقرى على أعقابهم فلأعرفن أحدكم يأتي يوم القيامة يحمل شاة لها ثغاء ينادي يا محمد يا محمد فأقول لا أملك لك من الله شيئا قد بلغت ولأعرفن أحدكم يأتي يوم القيامه يحمل بعيرا له رغاء ينادي يا محمد يا محمد فأقول لا أملك لك شيئا قد بلغت ولأعرفن أحدكم يأتي يوم القيامة يحمل فرسا لها حمحمة فينادي يا محمد يا محمد فأقول لا أملك لك شيئا قد بلغت ولأعرفن أحدكم يأتي يوم القيامة يحمل سقاء من أدم ينادي يا محمد يا محمد فأقول لا أملك لك شيئا قد بلغت \"وقال علي بن المدينى هذا حديث حسن الإسناد إلا أن حفص بن حميد مجهول لا أعلم روى عنه غير يعقوب بن عبدالله الأشعري القمي. \"قلت\" بل قد روى عنه أيضا أشعث بن إسحاق وقال فيه يحيى بن معين: صالح ووثقه النسائي وابن حبان."
    },
    {
      "ayah": 74,
      "surah": 23,
      "text": "وقوله \" وإن الذين لا يؤمنون بالآخرة عن الصراط لناكبون \" أي لعادلون جائرون منحرفون تقول العرب نكب فلان عن الطريق إذا زاغ عنها."
    },
    {
      "ayah": 75,
      "surah": 23,
      "text": "\" ولو رحمناهم وكشفنا ما بهم من ضر للجوا في طغيانهم يعمهون \" يخبر تعالى عن غلظهم في كفرهم بأنه لو أزاح عنهم الضر وأفهمهم القرآن لما انقادوا له ولاستمروا على كفرهم وعنادهم وطغيانهم كما قال تعالى \" ولو علم الله فيهم خيرا لأسمعهم ولو أسمعهم لتولوا وهم معرضون \" وقال \" ولو ترى إذ وقفوا على النار فقالوا يا ليتنا نرد ولا نكذب بآيات ربنا ونكون من المؤمنين بل بدا لهم ما كانوا يخفون من قبل ولو ردوا لعادوا لما نهوا عنه - إلى قوله - بمبعوثين \" فهذا من باب علمه تعالى بما لا يكون لو كان كيف يكون قال الضحاك عن ابن عباس: كل ما فيه \"لو\" فهو مما لا يكون أبدا."
    },
    {
      "ayah": 76,
      "surah": 23,
      "text": "يقول تعالى \" ولقد أخذناهم بالعذاب \" أي ابتليناهم بالمصائب والشدائد \" فما استكانوا لربهم وما يتضرعون \" أي فما ردهم ذلك عما كانوا فيه من الكفر والمخالفة بل استمروا على غيهم وضلالهم \" فما استكانوا \" أي ما خشعوا \" وما يتضرعون \" أي ما دعوا كما قال تعالى \" فلولا إذا جاءهم بأسنا تضرعوا ولكن قست قلوبهم \" الآية وقال ابن أبي حاتم حدثنا علي بن الحسين حدثنا محمد بن حمزة المروزي حدثنا علي بن الحسين حدثنا أبي عن يزيد - يعني النحوي - عن عكرمة عن ابن عباس أنه قال جاء أبو سفيان إلى رسول الله صلى الله عليه وسلم فقال: يا محمد أنشدك الله والرحم فقد أكلنا العلهز - يعني الوبر والدم - فأنزل الله \" ولقد أخذناهم بالعذاب فما استكانوا \" الآية وكذا رواه النسائي عن محمد بن عقيل عن علي بن الحسين عن أبيه به وأصله في الصحيحين أن رسول الله صلى الله عليه وسلم دعا على قريش حين استعصوا فقال \" اللهم أعني عليهم بسبع كسبع يوسف \".وقال ابن أبي حاتم حدثنا علي بن الحسين حدثنا سلمة بن شبيب حدثنا عبدالله بن إبراهيم عن عمر بن كيسان حدثني وهب بن عمر بن كيسان قال: حبس وهب بن منبه فقال له رجل من الأبناء ألا أنشدك بيتا من شعر يا أبا عبدالله؟ فقال وهب: نحن في طرف من عذاب الله والله يقول \" ولقد أخذناهم بالعذاب فما استكانوا لربهم وما يتضرعون \" قال وصام وهب ثلاثا متواصلة فقيل له ما هذا الصوم يا أبا عبدالله؟ قال أحدث لنا فأحدثنا: يعني أحدث لنا الحبس فأحدثنا زيادة عبادة."
    },
    {
      "ayah": 77,
      "surah": 23,
      "text": "وقوله \" حتى إذا فتحنا عليهم بابا ذا عذاب شديد إذا هم فيه مبلسون \" أي حتى إذا جاءهم أمر الله وجاءتهم الساعة بغتة فأخذهم من عذاب الله ما لم يكونوا يحتسبون فعند ذلك أبلسوا من كل خير وأيسوا من كل راحة وانقطعت آمالهم ورجاؤهم."
    },
    {
      "ayah": 78,
      "surah": 23,
      "text": "ثم ذكر تعالى نعمه على عباده أن جعل لهم السمع والأبصار والأفئدة وهي العقول والفهوم التي يذكرون بها الأشياء ويعتبرون بما في الكون من الآيات الدالة على وحدانية الله وأنه الفاعل المختار لما يشاء. وقوله \" قليلا ما تشكرون \" أي ما أقل شكركم لله على ما أنعم به عليكم كقوله \" وما أكثر الناس ولو حرصت بمؤمنين \"."
    },
    {
      "ayah": 79,
      "surah": 23,
      "text": "ثم أخبر تعالى عن قدرته العظيمة وسلطانه القاهر في برئه الخليقة وذرئه لهم في سائر أقطار الأرض على اختلاف أناسهم ولغاتهم وصفاتهم ثم يوم القيامة يجمع الأولين منهم والآخرين لميقات يوم. معلوم فلا يترك مهم صغيرا ولا كبيرا ولا ذكرا ولا أنثى ولا جليلا ولا حقيرا إلا أعاده كما بدأه."
    },
    {
      "ayah": 8,
      "surah": 23,
      "text": "وقوله\" والذين هم لأماناتهم وعهدهم راعون \" أي إذا اؤتمنوا لم يخونوا بل يؤدونها إلى أهلها وإذا عاهدوا أو عاقدوا أوفوا بذلك لا كصفات المنافقين الذين قال فيهم رسول الله صلى الله عليه وسلم من \" آية المنافق ثلاث: إذا حدث كذب وإذا وعد أخلف وإذا اؤتمن خان \"."
    },
    {
      "ayah": 80,
      "surah": 23,
      "text": "ولهذا قال \" وهو الذي يحيي ويميت \" أي يحيي الرمم ويميت الأمم \" وله اختلاف الليل والنهار \" أي وعن أمره تسخير الليل والنهار كل منهما يطلب الآخر طلبا حثيثا يتعاقبان لا يفتران ولا يفترقان بزمان غيرهما كقوله \" لا الشمس ينبغي لها أن تدرك القمر ولا الليل سابق النهار \" الآية. وقوله \" أفلا تعقلون \" أي أفليس لكم عقول تدلكم على العزيز العليم الذي قد قهر كل شيء وعز كل شيء وخضع له كل شيء ثم قال مخبرا عن منكري البعث الذين أشبهوا من قبلهم من المكذبين."
    },
    {
      "ayah": 81,
      "surah": 23,
      "text": "\" بل قالوا مثل ما قال الأولون قالوا أإذا متنا وكنا ترابا وعظاما أإنا لمبعوثون \" يعني يستبعدون وقوع ذلك بعد صيرورتهم إلى البلى."
    },
    {
      "ayah": 82,
      "surah": 23,
      "text": "\" بل قالوا مثل ما قال الأولون قالوا أإذا متنا وكنا ترابا وعظاما أإنا لمبعوثون \" يعني يستبعدون وقوع ذلك بعد صيرورتهم إلى البلى."
    },
    {
      "ayah": 83,
      "surah": 23,
      "text": "\" لقد وعدنا نحن وآباؤنا هذا من قبل إن هذا إلا أساطير الأولين \" يعنون الإعادة محال إنما يخبر بها من تلقاها عن كتب الأولين واختلافهم وهذا الإنكار التكذيب منهم كقوله إخبارا عنهم \" أإذا كنا عظاما نخرة قالوا تلك إذا كرة خاسرة فإنما هي زجرة واحدة فإذا هم بالساهرة \" وقال تعالى \" أو لم ير الإنسان أنا خلقناه من نطفة فإذا هو خصيم مبين وضرب لنا مثلا ونسي خلقه قال من يحيي العظام وهي رميم قل يحييها الذي أنشأها أول مرة وهو بكل خلق عليم \" الآيات."
    },
    {
      "ayah": 84,
      "surah": 23,
      "text": "يقرر تعالى وحدانيته واستقلاله بالخلق والتصرف والملك ليرشد إلى أنه الله الذي لا إله إلا هو ولا تنبغي العبادة إلا له وحده لا شريك له ولهذا قال لرسوله محمد صلى الله عليه وسلم أن يقول للمشركين العابدين معه غيره المعترفين به بالربوبية وأنه لا شريك له فيها مع هذا فقد أشركوا معه في الإلهية فعبدوا غيره معه مع اعترافهم أن الذين عبدوهم لا يخلقون شيئا ولا يملكون شيئا ولا يستبدون بشيء بل اعتقدوا أنهم يقربونهم إليه زلفى \" ما نعبدهم إلا ليقربونا إلى الله زلفى \" فقال \" قل لمن الأرض ومن فيها \" أي من مالكها الذي خلقها ومن فيها من الحيوانات والنباتات والثمرات وسائر صنوف المخلوقات \" إن كنتم تعلمون\"."
    },
    {
      "ayah": 85,
      "surah": 23,
      "text": "\" سيقولون لله \" أي فيعترفون لك بأن ذلك لله وحده لا شريك له فإذا كان ذلك \" قل أفلا تذكرون \" أنه لا تنبغي العبادة إلا للخالق الرازق لا لغيره."
    },
    {
      "ayah": 86,
      "surah": 23,
      "text": "\" قل من رب السموات السبع ورب العرش العظيم \" أي من هو خالق العالم العلوي بما فيه من الكواكب النيرات والملائكة الخاضعين له في سائر الأقطار منها والجهات ومن هو رب العرش العظيم يعني الذي هو سقف المخلوقات كما جاء في الحديث الذي رواه أبو داود عن رسول الله صلى الله عليه وسلم أنه قال \" شأن الله أعظم من ذلك إن عرشه على سمواته هكذا \"وأشار بيده مثل القبة وفي الحديث الآخر \" ما السموات السبع والأرضون السبع وما بينهن وما فيهن في الكرسي إلا كحلقة ملقاة بأرض فلاة وإن الكرسي بما فيه بالنسبة إلى العرش كتلك الحلقة في تلك الفلاة \".ولهذا قال بعض السلف: إن مسافة ما بين قطري العرش من جانب إلى جانب مسيره خمسين ألف سنة وارتفاعه عن الأرض السابعة مسيرة خمسين ألف سنة وقال الضحاك عن ابن عباس: إنما سمي عرشا لارتفاعه. وقال الأعمش عن كعب الأحبار: إن السموات والأرض في العرش كالقنديل المعلق بين السماء والأرض وقال مجاهد: ما السموات والأرض في العرش إلا كحلقة في أرض فلاة. وقال ابن أبي حاتم حدثنا العلاء بن سالم حدثنا وكيع حدثنا سفيان الثوري عن عمار الذهبي عن مسلم البطين عن سعيد بن جبير عن ابن عباس قال: العرش لا يقدر قدره أحد. وفي رواية: إلا الله عز وجل وقال بعض السلف: العرش من ياقوتة حمراء ولهذا قال ههنا \" ورب العرش العظيم \" أي الكبير وقال في آخر السورة \" رب العرش الكريم \" أي الحسن البهي فقد جمع العرش بين العظمة في الاتساع والعلو والحسن الباهر ولهذا قال من قال إنه من ياقوتة حمراء وقال ابن مسعود: إن ربكم ليس عنده ليل ولا نهار نور العرش من نور وجهه."
    },
    {
      "ayah": 87,
      "surah": 23,
      "text": "وقوله \" سيقولون لله قل أفلا تتقون \" أي إذا كنتم تعترفون بأنه رب السموات ورب العرش العظيم أفلا تخافون عقابه وتحذرون عذابه في عبادتكم معه غيره وإشراككم به. قال أبو بكر عبدالله ابن محمد بن أبي الدنيا القرشي في كتاب \"التفكر والاعتبار\": حدثنا إسحاق بن إبراهيم أخبرنا عبيد الله بن جعفر أخبرني عبدالله بن دينار عن ابن عمر قال: كان رسول الله صلى الله عليه وسلم كثيرا ما يحدث عن امرأة كانت في الجاهلية على رأس جبل معها ابن لها يرعى غنما فقال لها ابنها يا أمه من خلقك ؟ قالت: الله قال فمن خلق أبي ؟ قالت الله قال فمن خلقني؟ قالت: الله قال فمن خلق السموات؟ قالت: الله قال فمن خلق الأرض ؟ قالت: الله قال فمن خلق الجبل؟ قالت: الله قال فمن خلق هذه الغنم ؟ قالت: الله قال فإني أسمع لله شأنا ثم ألقى نفسه من الجبل فتقطع. قال ابن عمر كان رسول الله صلى الله عليه وسلم كثيرا ما يحدثنا هذا الحديث قال عبدالله بن دينار كان ابن عمر كثيرا ما يحدثنا بهذا الحديث قلت في إسناده عبيد الله بن جعفر المديني والد الإمام علي بن المديني وقد تكلموا فيه فالله أعلم."
    },
    {
      "ayah": 88,
      "surah": 23,
      "text": "\" قل من بيده ملكوت كل شيء \" أي بيده الملك \" ما من دابة إلا هو آخذ بناصيتها \" أي متصرف فيها وكان رسول الله صلى الله عليه وسلم يقول \" لا والذي نفسي بيده \"وكان إذا اجتهد في اليمين قال \" لا ومقلب القلوب \"فهو سبحانه الخالق المالك المتصرف \"وهو يجير ولا يجار عليه إن كنتم تعلمون \" كانت العرب إذا كان السيد فيهم فأجار أحدا لا يخفر في جواره وليس لمن دونه أن يجير عليه لئلا يفتات عليه ولهذا قال الله \" وهو يجير ولا يجار عليه \" أي وهو السيد العظيم الذي لا أعظم منه الذي له الخلق والأمر ولا معقب لحكمه الذي لا يمانع ولا يخالف وما شاء كان وما لم يشأ لم يكن. وقال الله \" لا يسأل عما يفعل وهم يسألون \" أي لا يسأل عما يفعل لعظمته وكبريائه وغلبته وقهره وعزته وحكمته وعدله فالخلق كلهم يسألون عن أعمالهم كما قال تعالى \" فوربك لنسألنهم أجمعين عما كانوا يعملون \"."
    },
    {
      "ayah": 89,
      "surah": 23,
      "text": "وقوله \" سيقولون لله \" أي سيعترفون أن السيد العظيم الذي يجير ولا يجار عليه هو الله تعالى وحده لا شريك له \" قل فأنى تسحرون \" أي فكيف تذهب عقولكم في عبادتكم معه غيره مع اعترافكم وعلمكم بذلك."
    },
    {
      "ayah": 9,
      "surah": 23,
      "text": "وقوله \" والذين هم على صلواتهم يحافظون \" أي يواظبون عليها في مواقيتها كما قال ابن مسعود سألت رسول الله صلى الله عليه وسلم فقلت يا رسول الله أي العمل أحب إلى الله ؟ قال \" الصلاة على وقتها \"قلت ثم أي ؟ قال \" بر الوالدين \"قلت ثم أي ؟ قال \" الجهاد في سبيل الله \"أخرجاه في الصحيحين وفي مستدرك الحاكم قال \" الصلاة في أول وقتها \"وقال ابن مسعود ومسروق في قوله \" والذين هم على صلواتهم يحافظون \" يعني مواقيت الصلاة وكذا قال أبو الضحى وعلقمة بن قيس وسعيد بن جبير وعكرمة وقال قتادة: على مواقيتها وركوعها وسجودها وقد افتتح الله ذكر هذه الصفات الحميدة بالصلاة واختتمها بالصلاة فدل على أفضليتها كما قال رسول الله \" استقيموا ولن تحصوا واعلموا أن خير أعمالكم الصلاة ولا يحافظ على الوضوء إلا مؤمن \"."
    },
    {
      "ayah": 90,
      "surah": 23,
      "text": "ثم قال تعالى \" بل أتيناهم بالحق \" وهو الإعلام بأنه لا إله إلا الله وأقمنا الأدلة الصحيحة الواضحة القاطعة علي ذلك \" وإنهم لكاذبون \" أي في عبادتهم مع الله غيره ولا دليل لهم على ذلك كما قال في آخر السورة \" ومن يدع مع الله إلها آخر لا برهان له به فإنما حسابه عند ربه إنه لا يفلح الكافرون \" فالمشركون لا يفعلون ذلك عن دليل قادهم إلى ما هم فيه من الإفك والضلال وإنما يفعلون ذلك اتباعا لآبائهم وأسلافهم الحيارى الجهال كما قال الله عنهم \" إنا وجدنا آباءنا على أمة وإنا على آثارهم مقتدون \"."
    },
    {
      "ayah": 91,
      "surah": 23,
      "text": "ينزه تعالى نفسه عن أن يكون له ولد أو شريك في الملك والتصرف والعبادة فقال تعالى \" ما اتخذ الله من ولد وما كان معه من إله إذا لذهب كل إله بما خلق ولعلا بعضهم على بعض \" أي لو قدر تعدد الآلهة لانفرد كل منهم بما خلق فما كان ينتظم الوجود والمشاهد أن الوجود منتظم متسق كل من العالم العلوي والسفلي مرتبط بعضه ببعض في غاية الكمال \" ما ترى في خلق الرحمن من تفاوت \" ثم لكان كل منهم يطلب قهر الآخر وخلافه فيعلو بعضهم على بعض والمتكلمون ذكروا هذا المعنى وعبروا عنه بدليل التمانع وهو أنه لو فرض صانعان فصاعدا فأراد واحد تحريك جسم والآخر أراد سكونه فإن لم يحصل مراد كل واحد منهما كانا عاجزين والواجب لا يكون عاجزا ويمتنع اجتماع مراديهما للتضاد وما جاء هذا المحال إلا من فرض التعدد فيكون محالا فأما إن حصل مراد أحدهما دون الآخر كان الغالب هو الواجب والآخر المغلوب ممكنا لأنه لا يليق بصفة الواجب أن يكون مقهورا ولهذا قال تعالى \" ولعلا بعضهم على بعض سبحان الله عما يصفون \" أي عما يقول الظالمون المعتدون في دعواهم الولد أو الشريك علوا كبيرا."
    },
    {
      "ayah": 92,
      "surah": 23,
      "text": "\" عالم الغيب والشهادة \" أي يعلم ما يغيب عن المخلوقات وما يشاهدونه \" فتعالى عما يشركون \" أي تقدس وتنزه وتعالى وعز وجل عما يقول الظالمون والجاحدون."
    },
    {
      "ayah": 93,
      "surah": 23,
      "text": "يقول تعالى آمرا نبيه محمدا صلى الله عليه وسلم أن يدعو هذا الدعاء عند حلول النقم \" رب إما تريني ما يوعدون \" أي إن عاقبتهم وأنا أشاهد ذلك فلا تجعلني فيهم كما جاء في الحديث الذي رواه الإمام أحمد والترمذي وصححه \"وإذا أردت بقوم فتنة فتوفني إليك غير مفتون."
    },
    {
      "ayah": 94,
      "surah": 23,
      "text": "يقول تعالى آمرا نبيه محمدا صلى الله عليه وسلم أن يدعو هذا الدعاء عند حلول النقم \" رب إما تريني ما يوعدون \" أي إن عاقبتهم وأنا أشاهد ذلك فلا تجعلني فيهم كما جاء في الحديث الذي رواه الإمام أحمد والترمذي وصححه \"وإذا أردت بقوم فتنة فتوفني إليك غير مفتون."
    },
    {
      "ayah": 95,
      "surah": 23,
      "text": "وقوله تعالى \" وإنا على أن نريك ما نعدهم لقادرون \" أي لو شئنا لأريناك ما نزل بهم من النقم والبلاء والمحن. ثم قال تعالى مرشدا له إلى الترياق النافع في مخالطة الناس وهو الإحسان إلى من يسيء إليه ليستجلب خاطره فتعود عداوته صداقة وبغضه محبة فقال تعالى \" ادفع بالتي هي أحسن السيئة \" وهذا كما قال في الآية الأخرى."
    },
    {
      "ayah": 96,
      "surah": 23,
      "text": "\" ادفع بالتي هي أحسن فإذا الذي بينك وبينه عداوة كأنه ولي حميم وما يلقاها إلا الذين صبروا \" الآية أي وما يلهم هذه الوصية أو هذه الخصلة أو الصفة \" إلا الذين صبروا \" أي على أذى الناس فعاملوهم بالجميل مع إسدائهم إليهم القبيح \" وما يلقاها إلا ذو حظ عظيم \" أي في الدنيا والآخرة."
    },
    {
      "ayah": 97,
      "surah": 23,
      "text": "وقوله تعالى \" وقل رب أعوذ بك من همزات الشياطين \" أمره الله أن يستعيذ من الشياطين لأنهم لا تنفع معهم الحيل ولا ينقادون بالمعروف وقد قدمنا عند الاستعاذة أن رسول الله صلى الله عليه وسلم كان يقول \" أعوذ بالله السميع العليم من الشيطان الرجيم من همزه ونفخه ونفثه \"."
    },
    {
      "ayah": 98,
      "surah": 23,
      "text": "وقوله تعالى \" وأعوذ بك رب أن يحضرون \" أي في شيء من أمري ولهذا أمر بذكر الله في ابتداء الأمور وذلك لطرد الشيطان عند الأكل والجماع والذبح وغير ذلك من الأمور ولهذا روى أبو داود أن رسول الله صلى الله عليه وسلم كان يقول \" اللهم إني أعوذ بك من الهرم وأعوذ بك من الهدم ومن الغرق وأعوذ بك أن يتخبطني الشيطان عند الموت \"وقال الإمام أحمد حدثنا يزيد أخبرنا محمد بن إسحاق عن عمرو بن شعيب عن أبيه عن جده قال: كان رسول الله صلى الله عليه وسلم يعلمنا كلمات يقولهن عند النوم من الفزع \" بسم الله أعوذ بكلمات الله التامة من غضبه وعقابه ومن شر عباده ومن همزات الشياطين وأن يحضرون \"قال فكان عبدالله بن عمرو يعلمها من بلغ من ولده أن يقولها عند نومه ومن كان منهم صغيرا لا يعقل أن يحفظها كتبها له فعلقها في عنقه. ورواه أبو داود والترمذي والنسائي من حديث محمد بن إسحاق وقال الترمذي حسن غريب."
    },
    {
      "ayah": 99,
      "surah": 23,
      "text": "يخبر تعالى عن حال المحتضر عند الموت من الكافرين أو المفرطين في أمر الله تعالى وقيلهم عند ذلك وسؤالهم الرجعة إلى الدنيا ليصلح ما كان أفسده في مدة حياته ولهذا قال \" رب ارجعون لعلي أعمل صالحا فيما تركت كلا \" كما قال تعالى \" وأنفقوا مما رزقناكم من قبل أن يأتي أحدكم الموت - إلى قوله - والله خبير بما تعملون \" وقال تعالى \" وأنذر الناس يوم يأتيهم العذاب - إلى قوله - ما لكم من زوال \" وقال تعالى \" يوم يأتي تأويله يقول الذين نسوه من قبل قد جاءت رسل ربنا بالحق فهل لنا من شفعاء فيشفعوا لنا أو نرد فنعمل غير الذي كنا نعمل \" وقال تعالى \" ولو ترى إذ المجرمون ناكسوا رءوسهم عند ربهم ربنا أبصرنا وسمعنا فارجعنا نعمل صالحا إنا موقنون \" وقال تعالى \" ولو ترى إذ وقفوا على النار فقالوا يا ليتنا نرد ولا نكذب بآيات ربنا - إلى قوله - وإنهم لكاذبون \" وقال تعالى \" وترى الظالمين لما رأوا العذاب يقولون هل إلى مرد من سبيل \" وقال تعالى \" قالوا ربنا أمتنا اثنتين وأحييتنا اثنتين فاعترفنا بذنوبنا فهل إلى خروج من سبيل \" والآية بعدها. وقال تعالى \" وهم يصطرخون فيها ربنا أخرجنا نعمل صالحا غير الذي كنا نعمل أو لم نعمركم ما يتذكر فيه من تذكر وجاءكم النذير فذوقوا فما للظالمين من نصير \" فذكر تعالى أنهم يسألون الرجعة فلا يجابون عند الاحتضار ويوم النشور ووقت العرض على الجبار وحين يعرضون على النار وهم في غمرات عذاب الجحيم. وقوله ههنا \" كلا إنها كلمة هو قائلها \" كلا حرف ردع وزجر أي لا نجيبه إلى ما طلب ولا نقبل منه. وقوله تعالى \" إنها كلمة هو قائلها \" قال عبد الرحمن بن زيد بن أسلم: أي لا بد أن يقولها لا محالة كل محتضر ظالم ويحتمل أن يكون ذلك علة لقوله كلا أي لأنها كلمة أي سؤاله الرجوع ليعمل صالحا هو كلام منه وقول لا عمل معه ولو رد لما عمل صالحا ولكان يكذب في مقالته هذه كما قال تعالى \" ولو ردوا لعادوا لما نهوا عنه وإنهم لكاذبون \" قال قتادة: والله ما تمنى أن يرجع إلى أهل ولا إلى عشيرة ولا بأن يجمع الدنيا ويقضي الشهوات ولكن تمنى أن يرجع فيعمل بطاعة الله عز وجل فرحم الله امرأ عمل فيما يتمناه الكافر إذا رأى العذاب إلى النار وقال محمد بن كعب القرظي \" حتى إذا جاء أحدهم الموت قال رب ارجعون لعلي أعمل صالحا فيما تركت \" قال فيقول الجبار \" كلا إنها كلمة هو قائلها \" وقال عمر بن عبدالله مولى غفرة: إذا قال الكافر \" رب ارجعون لعلي أعمل صالحا \" يقول الله تعالى كلا كذبت وقال قتادة في قوله تعالى \" حتى إذا جاء أحدهم الموت \" قال كان العلاء بن زياد يقول: لينزلن أحدكم نفسه أنه قد حضره الموت فاستقال ربه فأقاله فليعمل بطاعة الله تعالى. وقال قتادة: والله ما تمنى إلا أن يرجع فيعمل بطاعة الله فانظروا أمنية الكافر المفرط فاعملوا بها ولا قوة إلا بالله. وعن محمد بن كعب القرظي نحوه. وقال محمد بن أبي حاتم حدثنا أبي حدثنا أحمد بن يوسف حدثنا فضيل - يعني ابن عياض - عن ليث عن طلحة بن مصرف عن أبي حازم عن أبي هريرة قال: إذا وضع - يعني الكافر- في قبره فيرى مقعده من النار قال فيقول رب ارجعون أتوب وأعمل صالحا قال فيقال قد عمرت ما كنت معمرا قال فيضيق عليه قبره ويلتئم فهو كالمنهوش ينام ويفزع تهوي إليه هوام الأرض وحياتها وعقاربها. وقال أيضا حدثنا أبي حدثنا عمر بن علي حدثني سلمة بن تمام حدثنا علي بن زيد عن سعيد بن المسيب عن عائشه رضي الله عنها أنها قالت: ويل لأهل المعاصي من أهل القبور تدخل عليهم في قبورهم حيات سود أو دهم حية عند رأسه وحيه عند رجليه يقرصانه حتى يلتقيا في وسطه فذلك العذاب في البرزخ الذي قال الله تعالى \" ومن ورائهم برزخ إلى يوم يبعثون \".وقال أبو صالح وغيره في قوله تعالى \" ومن ورائهم \" يعني أمامهم. وقال مجاهد: البرزخ الحاجز ما بين الدنيا والآخرة. وقال محمد بن كعب: البرزخ ما بين الدنيا والآخرة ليسوا مع أهل الدنيا يأكلون ويشربون ولا مع أهل الآخرة يجاوزون بأعمالهم. وقال أبو صخر: البرزخ المقابر لا هم في الدنيا ولا هم في الآخرة فهم مقيمون إلى يوم يبعثون. وفي قوله تعالى \" ومن ورائهم برزخ \" تهديد لهؤلاء المحتضرين من الظلمة بعذاب البرزخ كما قال تعالى \" من ورائهم جهنم \" وقال تعالى \" ومن وراءه عذاب غليظ \" وقوله تعالى \" إنى يوم يبعثون \" أي يستمر به العذاب إلى يوم البعث كما جاء في الحديث \" فلا يزال معذبا فيها \" أي في الأرض."
    }
  ]
}
