{
  "ayahs": [
    {
      "ayah": 1,
      "surah": 24,
      "text": "يقول تعالى: هذه \"سورة أنزلناها\" فيه تنبيه على الاعتناء بها ولا ينفي ما عداها \"وفرضناها\" قال مجاهد وقتادة: أي بينا الحلال والحرام والأمر والنهي والحدود. وقال البخاري: ومن قرأ فرضناها يقول فرضناها عليكم وعلى من بعدكم \"وأنزلنا فيها آيات بينات\" أي مفسرات واضحات \"لعلكم تذكرون\"."
    },
    {
      "ayah": 10,
      "surah": 24,
      "text": "أي لحرجتم ولشق عليكم كثير من أموركم \"وأن الله تواب\" أي على عباده. وإن كان ذلك بعد الحلف والأيمان المغلظة \"حكيم\" فيما يشرعه ويأمر به وفيما ينهي عنه وقد وردت الأحاديث بمقتضي العمل بهذه الآية وذكر سبب نزولها وفيمن نزل فيه من الصحابة. قال الإمام أحمد حدثنا يزيد أخبرنا عباد بن منصور عن عكرمة عن ابن عباس قال: لما نزلت \"والذين يرمون المحصنات ثم لم يأتوا بأربعة شهداء فاجلدوهم ثمانين جلدة ولا تقبلوا لهم شهادة أبدا\" قال سعد بن عبادة وهو سيد الأنصار: \"أهكذا أنزلت يا رسول الله؟ فقال رسول الله صلى الله عليه وسلم: \"يا معشر الأنصار ألا تسمعون ما يقول سيدكم؟\" فقالوا يا رسول الله: لا تلمه فإنه رجل غيور والله ما تزوج امرأ قط إلا بكرا وما طلق امرأة قط فاجترأ رجل منا أن يتزوجها من شدة غيرته فقال سعد: والله يا رسول الله إني لأعلم إنها لحق وإنها من الله ولكني قد تعجبت أني لو وجدت لكاعا قد تفخذها رجل لم يكن لى أن أهيجه ولا أحركه حتى آتي بأربعة شهداء فوالله إني لا آتي بهم حتى يقضي حاجته - قال فما لبثوا إلا يسيرا - حتي جاء هلال بن أمية وهو أحد الثلاثة الذين تيب عليهم فجاء من أرضه عشاء فوجد عند أهله رجلا فرأى بعينيه وسمع بأذنيه فلم يهيجه حتى أصبح فغدا على رسول الله صلى الله عليه وسلم فقال: يا رسول الله إني جئت على أهلي عشاء فوجدت عندها رجلا فرأيت بعيني وسمعت بأذني فكره رسول الله صلى الله عليه وسلم ما جاء به واشتد عليه واجتمعت عليه الأنصار وقالوا: قد ابتلينا بما قال سعد بن عبادة الآن يضرب رسول الله صلى الله عليه وسلم هلال بن أمية ويبطل شهادته في الناس فقال هلال: والله إني لأرجو أن يجعل الله لي منها مخرجا. وقال هلال يا رسول الله فإني قد أرى ما اشتد عليك مما جئت به والله يعلم أني لصادق. فوالله إن رسول الله صلى الله عليه وسلم يريد أن يأمر بضربه إذ أنزل الله على رسوله صلى الله عليه وسلم الوحي وكان إذا أنزل عليه الوحي عرفوا ذلك فى تربد وجهه يعني فأمسكوا عنه حتي فرغ من الوحي فنزلت \"والذين يرمون أزواجهم ولم يكن لهم شهداء إلا أنفسهم فشهادة أحدهم أربع شهادات بالله\" الآية فسري عن رسول الله صلى الله عليه وسلم فقال: \"أبشر يا هلال فقد جعل الله لك فرجا ومخرجا\" فقال هلال: قد كنت أرجو ذلك من ربي عز وجل فقال رسول الله صلى الله عليه وسلم \"أرسلوا إليها\" فجاءت فتلاها رسول الله صلى الله عليه وسلم عليهما فذكرهما وأخبرهما أن عذاب الآخرة أشد من عذاب الدنيا فقال هلال: والله يا رسول الله لقد صدقت عليها فقالت: كذب فقال رسول الله صلى الله عليه وسلم: \"لاعنوا بينهما\" فقيل لهلال: اشهد فشهد أربع شهادات بالله إنه لمن الصادقين فلما كانت الخامسة قيل له: يا هلال اتق الله فإن عذاب الدنيا أهون من الآخرة وإن هذه الموجبة التي توجب عليك العذاب فقال: والله لا يعذبني الله عليها كما لم يجلدني عليها فشهد في الخامسة أن لعنة الله عليه إن كان من الكاذبين ثم قيل للمرأة: اشهدي أربع شهادات بالله إنه لمن الكاذبين وقيل لها عند الخامسة اتقي الله فإن عذاب الدنيا أهون من عذاب الآخرة وإن هذه الموجبة التي توجب عليك العذاب فتلكأت ساعة وهمت بالاعتراف ثم قالت: والله لا أفضح قومي فشهدت في الخامسة أن غضب الله عليها إن كان من الصادقين ففرق رسول الله صلى الله عليه وسلم بينهما وقضى أن لا يدعي ولدها لأب ولا يرمي ولدها ومن رماها أو رمي ولدها فعليه الحد وقضى أن لا بيت لها عليه ولا قوت لها من أجل أنهما يفترقان من غير طلاق ولا متوفى عنها وقال: \"إن جاءت به أصيهب أريشح حمش الساقين فهو لهلال وإن جاءت به أورق جعدا جماليا خدلج الساقين سابغ الأليتين فهو الذي رميت به\" فجاءت به أورق جعدا جماليا خدلج الساقين سابغ الأليتين فقال رسول الله صلى الله عليه وسلم: \"لولا الأيمان لكان لي ولها شأن\" قال عكرمة فكان بعد ذلك أميرا على مصر وكان يدعي لأمه\" ولا يدعي لأب ورواه أبو داود عن الحسن بن علي عن يزيد بن هارون به نحوه مختصرا ولهذا الحديث شواهد كثيرة في الصحاح وغيرها من وجوه كثيرة. فمنها ما قال البخاري: حدثني محمد بن بشار حدثنا ابن أبي عدي عن هشام بن حسان حدثني عكرمة عن ابن عباس أن هلال بن أمية قذف امرأته عند النبي صلى الله عليه وسلم بشريك بن سحماء فقال النبي صلى الله عليه وسلم: \"البينة أو حد في ظهرك\" فقال يا رسول الله إذا رأى أحدنا على امرأته رجلا ينطلق يلتمس البينة فجعل النبي صلى الله عليه وسلم يقول \"البينة وإلا حد في ظهرك\" فقال هلال: والذي بعثك بالحق إني لصادق ولينزلن الله ما يبرئ ظهرى من الحد فنزل جبريل وأنزل عليه: \"والذين يرمون أزواجهم - فقرأ حتى بلغ - إن كان من الصادقين\" فانصرف النبي صلى الله عليه وسلم فأرسل إليهما فجاء هلال فشهد والنبي صلى الله عليه وسلم يقول: \"إن الله يعلم أن أحدكما كاذب فهل منكما تائب\" ثم قامت فشهدت فلما كان في الخامسة وقفوها وقالوا: إنها موجبة قال ابن عباس فتلكأت ونكصت حتى ظننا أنها ترجع ثم قالت: لا أفضح قومي سائر اليوم فمضت فقال النبي صلى الله عليه وسلم \"أبصروها فإن جاءت به أكحل العينين سابغ الأليتين خدلج الساقين فهو لشريك بن سحماء\" فجاءت به كذلك فقال النبي صلى الله عليه وسلم \"لولا ما مضى من كتاب الله لكان لي ولها شأن\" انفرد به البخاري من هذا الوجه وقد رواه من غير وجه عن ابن عباس وغيره. وقال ابن أبي حاتم حدثنا أحمد بن منصور الزيادي حدثنا يونس بن محمد حدثنا صالح وهو ابن عمر حدثنا عاصم يعني ابن كليب عن أبيه حدثني ابن عباس قال جاء رجل إلى رسول الله صلى الله عليه وسلم فرمى امرأته برجل فكره ذلك رسول الله صلى الله عليه وسلم فلم يزل يردده حتى أنزل الله تعالى \"والذين يرمون أزواجهم\" فقرأ حتى فرغ من الآيتين فأرسل إليهما فدعاهما فقال: \"إن الله تعالى قد أنزل فيكما\" فدعا الرجل فقرأ عليه فشهد أربع شهادات بالله إنه لمن الصادقين ثم أمر به فأمسك على فيه فوعظه فقال له: \"كل شيء أهون عليه من لعنة الله\" ثم أرسله فقال: \"لعنة الله عليه إن كان من الكاذبين\" ثم دعاها فقرأ عليها فشهدت أربع شهادات بالله إنه من الكاذبين ثم أمر بها فأمسك على فيها فوعظها وقال: \"ويحك كل شيء أهون من غضب الله\" ثم أرسلها فقالت: غضب الله عليها إن كان من الصادقين. فقال رسول الله صلى الله عليه وسلم: \"أما والله لأقضين بينكما قضاء فصلا قال فولدت فما رأيت مولودا بالمدينة أكثر منه فقال \"إن جاءت به لكذا وكذا فهو كذا وإن جاءت به لكذا وكذا فهو لكذا\" فجاءت به يشبه الذي قذفت به. وقال الإمام أحمد حدثنا يحيي بن سعيد حدثنا عبد الملك بن أبي سليمان قال: سمعت سعيد بن جبير قال سئلت عن المتلاعنين أيفرق بينهما فى إمارة ابن الزبير فما دريت ما أقول فقمت من مكاني إلى منزل ابن عمر فقلت: يا أبا عبدالرحمن المتلاعنان أيفرق بينهما؟ فقال سبحان الله إن أول من سأل عن ذلك فلان ابن فلان فقال يا رسول الله أرأيت الرجل يرى امرأته على فاحشة فإن تكلم تكلم بأمر عظيم وإن سكت سكت على مثل ذلك فسكت فلم يجبه فلما كان بعد ذلك أتاه فقال الذي سألتك عنه قد ابتليت به فأنزل الله تعالى هذه الآيات في سورة النور \"والذين يرمون أزواجهم\" حتى بلغ \"أن غضب الله عليها إن كان من الصادقين\" فبدأ بالرجل فوعظه وذكره وأخبره أن عذاب الدنيا أهون من عذاب الآخرة فقال: والذي بعثك بالحق ما كذبت ثم ثني بالمرأة فوعظها وذكرها وأخبرها أن عذاب الدنيا أهون من عذاب الآخرة فقالت المرأة: والذي بعثك بالحق إنه لكاذب. قال فبدأ بالرجل فشهد أربع شهادات بالله إنه لمن الصادقين والخامسة أن لعنة الله عليه إن كان من الكاذبين ثم ثني بالمرأة فشهدت أربع شهادات بالله إنه لمن الكاذبين والخامسة أن غضب الله عليها إن كان من الصادقين ثم فرق بينهما رواه النسائي في التفسير من حديث عبد الملك بن أبي سليمان به وأخرجاه في الصحيحين من حديث سعيد بن جبير عن ابن عباس وقال الإمام أحمد حدثنا يحيي بن حماد حدثنا أبو عوانة عن الأعمش عن إبراهيم عن علقمة عن عبدالله قال: كنا جلوسا عشية الجمعة في المسجد فقال رجل من الأنصار: أحدنا إذا رأى مع امرأته رجلا إن قتله قتلتموه وإن تكلم جلدتموه وإن سكت سكت على غيظ والله لإن أصبحت صحيحا لأسألن رسول الله صلى الله عليه وسلم قال فسأله فقال: يا رسول الله إن أحدنا إذا رأى مع امرأته رجلا إن قتله قتلتموه وإن تكلم جلدتموه وإن سكت سكت على غيظ اللهم احكم قال: فنزلت آية اللعان فكان ذلك الرجل أول من ابتلي به. انفرد بإخراجه مسلم فرواه من طرق عن سليمان بن مهران الأعمش به وقال الإمام أحمد أيضا حدثنا أبو كامل حدثنا إبراهيم بن سعد حدثنا ابن شهاب عن سهل بن سعد قال جاء عويمر إلى عاصم بن عدى فقال له: سل رسول الله صلى الله عليه وسلم أرأيت رجلا وجد رجلا مع امرأته فقتله أيقتل به أم كيف يصنع؟ فسأل عاصم رسول الله صلى الله عليه وسلم فعاب رسول الله صلى الله عليه وسلم المسائل قال فلقيه عويمر فقال: ما صنعت؟ قال ما صنعت إنك لم تأتني بخير سألت رسول الله صلى الله عليه وسلم فعاب المسائل فقال عويمر: والله لآتين رسول الله صلى الله عليه وسلم فلأسألنه فأتاه فوجده قد أنزل عليه فيها قال: فدعا بهما ولاعن بينهما قال عويمر: إن انطلقت بها يا رسول الله لقد كذبت عليها قال: ففارقها قبل أن يأمره رسول الله صلى الله عليه وسلم فصارت سنة المتلاعنين وقال رسول الله صلى الله عليه وسلم: \"أبصروها فإن جاءت به أسحم أدعج العنين عظيم الأليتين فلا أراه إلا قد صدق وإن جاءت به أحيمر كأنه وحرة فلا أراه إلا كاذبا\" فجاءت به على النعت المكروه. أخرجاه في الصحيحين وبقية الجماعة إلا الترمذي ورواه البخاري أيضا من طرق عن الزهري به فقال حدثنا سليمان بن داود أبو الربيع حدثنا فليح عن الزهري عن سهل بن سعد أن رجلا أتي رسول الله صلى الله عليه وسلم فقال يا رسول الله أرأيت رجلا رأى مع امرأته رجلا أيقتله فتقتلونه أم كيف يفعل؟ فأنزل الله تعالى فيهما ما ذكر في القرآن من التلاعن فقال له رسول الله صلى الله عليه وسلم \"قد قضى فيك وفي امرأتك\" قال فتلاعنا وأنا شاهد عند رسول الله صلى الله عليه وسلم ففارقها فكانت سنة أن يفرق بين المتلاعنين وكان حاملا فأنكر حملها وكان ابنها يدعي إليها ثم جرت السنة في الميراث أن يرثها وترث منه ما فرض الله لها. وقال الحافظ أبو بكر البزار حدثنا إسحاق بن الضيف حدثنا النضر بن شميل حدثنا يونس ابن أبي إسحاق عن أبيه عن زيد بن بتيع عن حذيفة \" قال: قال رسول الله صلى الله عليه وسلم لأبي بكر \"لو رأيت مع أم رومان رجلا ما كنت فاعلا؟\" قال كنت والله فاعلا به شرا. قال \"فأنت يا عمر؟ \" قال كنت والله فاعلا كنت أقول لعن الله الأعجز فإنه خبيث. قال فنزلت \" والذين يرمون أزواجهم ولم يكن لهم شهداء إلا أنفسهم \" ثم قال لا نعلم أحدأ أسنده إلا النضر بن شميل عن يونس بن إسحاق ثم رواه من حديث الثوري عن أبي إسحاق عن زيد ابن بتيع مرسلا فالله أعلم وقال الحافظ أبو يعلى حدثنا مسلم بن أبي مسلم الجرمي حدثنا مخلد بن الحسين عن هشام عن ابن سيرين عن أنس بن مالك \" قال: لأول لعان كان في الإسلام أن شريك بن سحماء قذفه هلال بن أمية بامرأته فرفعته إلى رسول الله صلى الله عليه وسلم فقال رسول الله صلى الله عليه وسلم \"أربعة شهود وإلا فحد في ظهرك\" فقال يا رسول الله إن الله يعلم أني لصادق ولينزلن الله عليك ما يبرئذبه ظهري من الجلد فأنزل الله آية اللعان \" والذين يرمون أزواجهم\" إلى آخر الآية قال فدعاه النبي صلى الله عليه وسلم فقال \"اشهد بالله إنك لمن الصادقين فيما رميتها به من الزنا\" فشهد بذلك أربع شهادات ثم قال له في الخامسة \"ولعنه الله عليك إن كنت من الكاذبين فيما رميتها به من الزنا\" ففعل ثم دعاها رسول الله صلى الله عليه وسلم فقال \"قومي فاشهدي بالله إنه لمن الكاذبين فيما رماك به من الزنا فشهدت بذلك أربع شهادات ثم قال لها في الخامسة \"وغضب الله عليك إن كان من الصادقين فيما رماك به من الزنا\" قال فلما كانت الرابعة أو الخامسة سكتت سكتة حتى ظنوا أنها ستعترف ثم قالت لا أفضح قومي سائر اليوم فمضت على القول ففرق رسول الله صلى الله عليه وسلم بينهما وقال \"انظروا فإن جاءت به جعدا حمش الساقين فهو لشريك بن سحماء وإن جاءت به أبيض سبطا قصير العينين فهو لهلال بن أمية فجاءت به جعدا حمش الساقين فقال رسول الله صلى الله عليه وسلم \"لولا ما نزل فيهما من كتاب الله لكان لي ولها شأن\"."
    },
    {
      "ayah": 11,
      "surah": 24,
      "text": "هذه العشر الآيات كلها نزلت في شأن عائشة أم المؤمنين رضي الله عنها حين رماها أهل الإفك والبهتان من المنافقين بما قالوه من الكذب البحت والفرية التي غار الله عز وجل لها ولنبيه صلوات الله وسلامه عليه فأنزل الله تعالى براءتها صيانه لعرض رسول الله صلى الله عليه وسلم فقال تعالى \"إن الذين جاءوا بالإفك عصبة منكم\" أي جماعة منكم يعني ما هو واحد ولا اثنان بل جماعة فكان المقدم هذه اللعنة عبدالله بن أبي بن سلول رأس المنافقين فإنه كان يجمعه ويستوشيه حتى ذلك في أذهان بعض المسلمين فتكلموا به وجوزه آخرون منهم وبقي الأمر كذلك قريبا من شهر حتي نزل القرآن وبيان ذلك في الأحاديث الصحيحة وقال الإمام أحمد حدثنا عبد الرزاق حدثنا معمر عن الزهري قال أخبرني سعيد بن المسيب وعروة بن الزبير وعلقمة بن وقاص وعبيدالله بن عبدالله بن عتبة ابن مسعود عن حديث عائشة زوج النبي صلى الله عليه وسلم حين قال لها أهل الإفك ما قالوا فرأها الله تعالى وكلهم قد حدثني بطائفة من حديثها وبعضهم كان أوعى لحديثها من بعض وأثبت له اقتصاصا وقد وعيت عن كل رجل منهم الحديث الذي حدثني عن عائشة وبعض حديثهم يصدق بعضا: ذكروا أن عائشة رضي الله عنها زوج النبي صلى الله عليه وسلم قالت: \"كان رسول الله صلى الله عليه وسلم إذا أراد أن يخرج لسفر أقرع بين نسائه فأيتهن خرج سهمها خرج بها رسول الله صلى الله عليه وسلم معه قالت عائشة رضي الله عنها فأقرع بيننا في غزوة غزاها فخرج فيها سهمي وخرجت مع رسول الله صلى الله عليه وسلم وذلك بعدما نزل الحجاب فأنا أحمل في هودجي وأنزل فيه فسرنا حتى إذا فرغ رسول الله صلى الله عليه وسلم من غزوته تلك وقفل ودنونا من المدينة آذن ليلة بالرحيل فقمت حين آذن بالرحيل فمشيت حتى جاوزت الجيش فلما قضيت شأني أقبلت إلى رحلي فلمست صدري فإذا عقد لي من جزع ظفار فد انقطع فرجعت فالتمست عقدي فحبسني ابتغاؤه وأقبل الرهط الذين كانوا يرحلونني فاحتملوا هودجي فرحلوه على بعير الذي كنت أركب وهم يحسبون أني فيه قالت وكان النساء إذا ذاك خفافا لم يثقلن ولم يغشهن اللحم إنما يأكلن العلقة من الطعام فلم يستنكر القوم خفة الهودج حين رفعوه وحملوه وكنت جارية حديثة السن فبعثوا الجمل وساروا ووجدت عقدي بعدما استمر الجيش فجئت منازلهم وليس بها داع ولا مجيب فتيممت منزلي الذي كنت فيه وظننت أن القوم سيفقدونني فيرجعون إلى فبينا أنا جالسة في منزلي غلبتني عيناي فنمت وكان صفوان بن المعطل السلمي ثم الذكواني قد عرس من وراء الجيش فأدلج فأصبح عند منزلي فرأى سواد إنسان نائم فأتاني فعرفني حين رآني وكان قد رآني قبل الحجاب فاستيقظت باسترجاعه حين عرفني فخمرت وجهي بجلبابي والله ما كلمني كلمة ولا سمعت منه كلمة غير استرجاعه حين أناخ راحلته فوطئ على يدها فركبتها فانطلق يقود بي الراحلة حتى أتينا الجيش بعدما نزلوا موغرين في نحر الظهيرة فهلك من هلك من شأني وكان الذي تولى كبره عبدالله بن أبي بن سلول فقدمنا المدينة فاشتكيت حين قدمناها شهرا والناس يفيضون في قول أهل الإفك ولا أشعر بشيء من ذلك وهو يريبني فى وجعي أني لا أرى من رسول الله صلى الله عليه وسلم اللطف الذي أرى منه حين أشتكي إنما يدخل رسول الله صلى الله عليه وسلم فيسلم. ثم يقول \"كيف تيكم ؟\" فذلك الذي يريبني ولا أشعر بالشر حتى خرجت بعدما نقهت وخرجت معي أم مسطح قبل المناصع وهو متبرزنا ولا نخرج إلا ليلا إلى ليل وذلك قبل أن نتخذ الكنف قريبا من بيوتنا وأمرنا أمر العرب الأول في التنزه في البرية وكنا نتأذي بالكنف أن نتخذها في بيوتنا فانطلقت أنا وأم مسطح وهي بنت أبي رهم بن المطلب بن عبد مناف وأمها ابنة صخر بن عامر خالة أبي بكر الصديق وابنها مسطح بن أثاثة بن عباد بن عبد المطلب فأقبلت أنا وابنة أبي رهم أم مسطح قبل بيتي حين فرغنا من شأننا فعثرت أم مسطح في مرطها فقالت: تعس مسطح فقلت لها: بئسما قلت تسبين رجلا شهد بدرا؟ فقالت أى هنتاه ألم تسمعي ما قال؟ قلت: وماذا قال؟ قالت فأخبرتني بقول أهل الإفك فازددت مرضا إلي مرضي فلما رجعت إلى بيتي دخل علي رسول الله صلى الله عليه وسلم فسلم ثم قال: \"كيف تيكم؟\" فقلت له: أتأذن لي أن آتي أبوي قالت وأنا حينئذ أريد أن أتيقن الخبر من قبلهما فأذن لي رسول الله صلى الله عليه وسلم فجئت أبوي فقلت لأمى: يا أمتاه ما يتحدث الناس به؟ فقالت: أي بنية هوني عليك فوالله لقلما كانت امرأة قط وضيئة عند رجل يحبها ولها ضرائر إلا أكثرن عليها. قالت فقلت: سبحان الله أوقد تحدث الناس بها؟ فبكيت تلك الليلة حتى أصبحت لا يرقأ لي دمع ولا أكتحل بنوم ثم أصبحت أبكي قالت فدعا رسول الله صلى الله عليه وسلم على بن أبي طالب وأسامة بن زيد حين استلبث الوحي يسألهما ويستشيرهما في فراق أهله قالت فأما أسامة بن زيد فأشار على رسول الله صلى الله عليه وسلم بالذي يعلم من براءة أهله وبالذي يعلم في نفسه لهم من الود فقال أسامة: يا رسول الله أهلك ولا نعلم إلا خيرا. وأما علي بن أبي طالب فقال: يا رسول الله لم يضيق الله عليك والنساء سواها كثير وإن تسأل الجارية تصدقك الخبر قالت فدعا رسول الله صلى الله عليه وسلم بريرة فقال: \"أي بريرة هل رأيت من شيء يريبك من عائشة\" فقالت له بريرة: والذي بعثك بالحق إن رأيت منها أمرا قط أغمصه عليها أكثر من أنها جارية حديثة السن تنام عن عجين أهلها فتأتي الداجن فتأكله. فقام رسول الله صلى الله عليه وسلم من يومه فاستعذر من عبدالله بن أبي بن سلول قالت فقال رسول الله صلى الله عليه وسلم وهو على المنبر: \"يا معشر المسلمين من يعذرني من رجل قد بلغني أذاه في أهلي فوالله ما علمت على أهلي إلا خيرا ولقد ذكروا رجلا ما علمت عليه إلا خيرا وما كان يدخل على أهلي إلا معي\" فقام سعد بن معاذ الأنصاري رضي الله عنه فقال أنا أعذرك منه يا رسول الله إن كان من الأوس ضربنا عنقه وإن كان من إخواننا من الخزرج أمرتنا ففعلنا بأمرك. قالت فقام سعد بن عبادة وهو سيد الخزرج وكان رجلا صالحا ولكن احتملته الحمية فقال لسعد ابن معاذ: كذبت لعمر الله لا تقتله ولا تقدر على قتله ولو كان من رهطك ما أحببت أن يقتل فقام أسيد بن حضير وهو ابن عم سعد بن معاذ فقال لسعد بن عبادة: كذبت لعمر الله لنقتلنه فإنك منافق تجادل عن المنافق فتثاور الحيان الأوس والخزرج حتي هموا أن يقتتلوا ورسول الله صلى الله عليه وسلم على المنبر فلم يزل رسول الله صلى الله عليه وسلم يخفضهم حتى سكتوا وسكت رسول الله صلى الله عليه وسلم قالت: وبكيت يومي ذلك لا يرقأ لي دمع ولا أكتحل بنوم وأبواي يظنان أن البكاء فالق كبدي قالت فبينما هما جالسان عندي وأنا أبكي إذ استأذنت علي امرأة من الأنصار فأذنت لها فجلست تبكي معي فبينا نحن على ذلك إذ دخل علينا رسول الله صلى الله عليه وسلم فسلم ثم جلس قالت ولم يجلس عندي منذ قيل ما قيل وقد لبث شهرا لا يوحى إليه في شأني شيء قالت فتشهد رسول الله صلى الله عليه وسلم حين جلس ثم قال \"أما بعد يا عائشة فإنه قد بلغني عنك كذا وكذا فإن كنت بريئة فسيبرئك الله وإن كنت ألممت بذنب فاستغفري الله وتوبي إليه فإن العبد إذا اعترف بذنبه وتاب تاب الله عليه\" قالت فلما قضى رسول الله صلى الله عليه وسلم مقالته قلص دمعي حتى ما أحس منه قطرة فقلت لأبي أجب عني رسول الله فقال: والله ما أدري ما أقول لرسول الله صلى الله عليه وسلم فقلت لأمي أجيبي رسول الله صلى الله عليه وسلم فقالت: والله ما أدري ما أقول لرسول الله صلى الله عليه وسلم قالت فقلت وأنا جارية حديثة السن لا أقرأ كثيرا من القرآن: والله لقد علمت لقد سمعتم بهذا الحديث حتى استقر في أنفسكم وصدقتم به فلئن قلت لكم إني بريئة والله يعلم أني بريئة لا تصدقونني ولئن اعترفت بأمر والله يعلم أني منه بريئة لا تصدقونني فوالله ما أجد لي ولكم مثلا إلا كما قال أبو يوسف \"فصبر جميل والله المستعان على ما تصفون\" قالت ثم تحولت فاضطجعت على فراشي قالت وأنا والله أعلم حينئذ أني بريئة وأن الله تعالي مبرئي ببراءتي ولكن والله ما كنت أظن أن ينزل في شأني وحي يتلى ولشأني كان أحقر فى نفسي من أن يتكلم الله في بأمر يتلى ولكن كنت أرجو أن يرى رسول الله صلى الله عليه وسلم في النوم رؤيا يبرئني الله بها قالت: فوالله ما رام رسول الله صلى الله عليه وسلم مجلسه ولا خرج من أهل البيت أحد حتى أنزل الله تعالى على نبيه فأخذه ما كان يأخذه من البرحاء عند الوحي حتي إنه ليتحدر منه مثل الجمان من العرق وهو في يوم شات من ثقل القول الذي أنزل عليه. قالت فسري عن رسول الله صلى الله عليه وسلم وهو يضحك فكان أول كلمة تكلم بها أن قال \"أبشري يا عائشة أما الله عز وجل فقد برأك\" قالت فقالت لي أمي: قومي إليه فقلت: والله لا أقوم إليه ولا أحمد إلا الله عز وجل هو الذي أنزل براءتي وأنزل الله عز وجل \"إن الذين جاءوا بالإفك عصبة منكم\" العشر الآيات كلها فلما أنزل الله هذا في براءتي قال أبو بكر رضي الله عنه وكان ينفق على مسطح بن أثاثة لقرابته منه وفقره: والله لا أنفق عليه شيء أبدا بعد الذي قال لعائشة فأنزل الله تعالي \"ولا يأتل أولو الفضل منكم والسعة أن يؤتوا أولى القربى - إلى قوله - ألا تحبون أن يغفر الله لكم والله غفور رحيم\" فقال أبو بكر: بلى والله إني لأحب أن يغفر الله لي فرجع إلى مسطح النفقة التي كان ينفق عليه. وقال والله لا أنزعها منه أبدأ: قالت عائشة وكان رسول الله صلى الله عليه وسلم يسأل زينب بنت جحش زوج النبي صلى الله عليه وسلم عن أمري فقال: \"يا زينب ماذا علمت أو رأيت؟\" فقالت يا رسول الله: أحمي سمعي وبصري والله ما علمت إلا خيرا قالت عائشة وهي التي كانت تساميني من أزواج النبي صلى الله عليه وسلم فعصمها الله تعالى بالورع وطفقت أختها حمنة بنت جحش تحارب لها فهلكت فيمن هلك. قال ابن شهاب فهذا ما انتهى إلينا من أمر هؤلاء الرهط أخرجه البخاري ومسلم في صحيحهما من حديث الزهري. وهكذا رواه ابن إسحاق عن الزهري كذلك قال: وحدثني يحيي بن عباد بن عبدالله بن الزبير عن أبيه عن عائشة رضي الله عنها وحدثني عبدالله بن أبي بكر بن محمد بن عمرو بن حزم الأنصاري عن عمرة عن عائشة بنحو ما تقدم والله أعلم. ثم قال البخاري وقال أبو أسامة عن هشام بن عروة قال أخبرني أبي عن عائشة رضي الله عنها قالت لما ذكر من شأني الذي ذكر وما علمت به قام رسول الله صلى الله عليه وسلم في خطيبا فتشهد فحمد الله وأثنى عليه بما هو أهله ثم قال: \"أما بعد أشيروا على في أناس أبنوا أهلي وايم الله ما علمت على أهلي إلا خيرا وما علمت على أهلي من سوء وأبنوهم بمن والله ما علمت عليه من سوء قط ولا يدخل بيتي قط إلا وأنا حاضر ولا غبت في سفر إلا غاب معي\" فقام سعد بن معاذ الأنصاري فقال: يا رسول الله ائذن لنا أن نضرب أعناقهم فقام رجل من الخزرج وكانت أم حسان بن ثابت من رهط ذلك الرجل فقال كذبت أما والله لو كانوا من الأوس ما أحببت أن تضرب أعناقهم حتى كاد أن يكون بين الأوس والخزرج شر في المسجد وما علمت فلما كان مساء ذلك اليوم خرجت لبعض حاجتي ومعي أم مسطح فعثرت فقالت: تعس مسطح فقلت لها: أي أم تسبين ابنك؟ فسكتت ثم عثرت الثانية فقالت: تعس مسطح فقلت لها: أى أم تسبين ابنك؟ ثم عثرت الثالثة فقالت تعس مسطح فانتهرتها فقالت: والله ما أسبه إلا فيك فقلت: في أي شأني؟ قالت: فبقرت لى الحديث فقلت: وقد كان هذا؟ قالت: نعم والله فرجعت إلى بيتي كأن الذي خرجت له لا أجد منه قليلا ولا كثيرا ووعكت وقلت لرسول الله صلى الله عليه وسلم: أرسلني إلى بيت أبي فأرسل معي الغلام فدخلت الدار فوجدت أم رومان في السفل وأبا بكر فوق البيت يقرأ فقالت أم رومان: ما جاء بك يا بنية فأخبرتها وذكرت لها الحديث وإذا هو لم يبلغ منها مثل الذي بلغ مني فقالت يا بنية خففي عليك الشأن فإنه والله لقل ما كانت امرأة قط حسناء عند رجل يحبها لها ضرائر إلا حسدنها وقيل فيها فقلت وقد علم به أبي؟ قالت: نعم قلت: ورسول الله صلى الله عليه وسلم؟ قالت نعم ورسول الله صلى الله عليه وسلم فاستعبرت وبكيت فسمع أبو بكر صوتي وهو فوق البيت يقرأ فنزل فقال لأمي ما شأنها قالت بلغها الذي ذكر من شأنها ففاضت عيناه \"فقال أقسمت عليك يا بنية إلا رجعت إلى بيتك فرجعت ولقد جاء رسول الله صلى الله عليه وسلم بيتي فسأل عني خادمتي فقالت: يا رسول الله لا والله ما علمت عليها عيبا إلا أنها كانت ترقد حتي تدخل الشاة فتأكل خميرها أو عجينها وانتهرها بعض أصحابه فقال: اصدقي رسول الله صلى الله عليه وسلم حتى أسقطوا لها به فقالت: سبحان الله والله ما علمت عليها إلا ما يعلم الصائغ على تبر الذهب الأحمر وبلغ الأمر ذلك الرجل الذي قيل له فقال سبحان الله والله ما كشفت كنف أنثى قط. قالت عائشة رضي الله عنها فقتل شهيدا في سبيل الله قالت وأصبح أبواي عندي فلم يزالا حتي دخل علي رسول الله صلى الله عليه وسلم وقد صلى العصر ثم دخل وقد اكتنفني أبواي عن يميني وعن شمالي فحمد الله تعالى وأثنى عليه ثم قال: \"أما بعد يا عائشة إن كنت قارفت سوءا أو ظلمت فتوبي إلى الله فإن الله يقبل التوبة عن عباده\" قالت وقد جاءت امرأة من الأنصار فهي جالسة بالباب فقلت ألا تستحي من هذه المرأة أن تذكر شيئا فوعظ رسول الله صلى الله عليه وسلم فالتفت إلى أبي فقلت له: أجب رسول الله صلى الله عليه وسلم قال: فماذا أقول؟ فالتفت إلى أمي فقلت: أجيبي رسول الله صلى الله عليه وسلم قالت: ماذا أقول؟ فلما لم يجيباه تشهدت فحمدت الله وأثنيت عليه بما هو أهله ثم قلت: أما بعد فوالله إن قلت لكم إني لم أفعل والله عز وجل يشهد أني لصادقة ما ذاك بنافعي عندكم لقد تكلمت به وأشربته قلوبكم وإن قلت لكم إنى قد فعلت والله يعلم أني لم أفعل لتقولن قد باءت به على نفسها وإني والله ما أجد لى ولكم مثلا - والتمست اسم يعقوب فلم أقدر عليه - إلا أبا يوسف حين قال: \"فصبر جميل والله المستعان على ما تصفون\" وأنزل الله على رسوله صلى الله عليه وسلم من ساعته فسكتنا فرفع عنه وإني لأتبين السرور في وجهه وهو يمسح جبينه ويقول: \"أبشرى يا عائشة فقد أنزل الله براءتك\" قالت وكنت أشد ما كنت غضبا فقال لي أبواي قومي إليه فقلت: لا والله لا أقوم إليه ولا أحمده ولا أحمدكما ولكن أحمد الله الذي أنزل براءتي لقد سمعتموه فما أنكرتموه ولا غيرتموه وكانت عائشة تقول: أما زينب بنت جحش فعصمها الله بدينها فلم تقل إلا خيرا وأما أختها حمنة بنت جحش فهلكت فيمن هلك وكان الذين يتكلم فيه مسطح وحسان بن ثابت والمنافق عبدالله ابن أبي بن سلول وهو الذي كان يستوشيه ويجمعه وهو الذي تولى كبره منهم هو وحمنة قالت فحلف أبو بكر أن لا ينفع مسطحا بنافعة أبدا فأنزل الله تعالى: \"ولا يأتل أولوا الفضل منكم\" يعني أبا بكر \"والسعة أن يؤتوا أولى القربي والمساكين\" يعني مسطحا إلى قوله \"ألا تحبون أن يغفر الله لكم والله غفور رحيم\" فقال أبو بكر: بلى والله يا ربنا إنا لنحب أن تغفر لنا وعاد له بما كان يصنع. هكذا رواه البخاري من هذا الوجه معلقا بصيغة الجزم عن أبي أسامة حماد بن أسامة أحد الأئمة الثقات. وقد رواه ابن جرير في تفسيره عن سفيان بن وكيع عن أبي أسامة مطولا به مثله أو نحوه ورواه ابن أبي حاتم عن أبي سعيد الأشج عن أبي أسامة ببعضه. وقال الإمام أحمد حدثنا هشيم أخبرنا عمرو بن أبي سلمة عن أبيه عن عائشة \"رضي الله عنها قالت لما نزل عذري من السماء جاءني النبي صلى الله عليه وسلم فأخبرني بذلك فقلت بحمد الله لا بحمدك. وقال الإمام أحمد حدثنا ابن عدي عن محمد بن إسحاق عن عبدالله بن أبي بكر عن عمرة أيضا عن عائشة قالت: لما نزل عذري قام رسول الله صلى الله عليه وسلم فذكر ذلك وتلا القرآن فلما نزل أمر برجلين وامرأة فضربوا حدهم ورواه أهل السنن الأربعة. وقال الترمذي هذا حديث حسن ووقع عند أبي داود تسميتهم حسان بن ثابت ومسطح بن أثاثة وحمنة بنت جحش. فهذه طرق متعددة عن أم المؤمنين عائشة \"رضي الله عنها فى المسانيد والصحاح والسنن وغيرها وقد روي من حديث أمها أم رومان \"رضي الله عنها فقال الإمام أحمد حدثنا علي بن عاصم أخبرنا حصين عن أبي وائل عن مسروق عن أم رومان قالت بينا أنا عند عائشة إذ دخلت علينا امرأة من الأنصار فقالت: فعل الله بابنها وفعل فقالت عائشة ولم؟ قالت إنه كان فيمن حدث الحديث قالت وأي الحديث؟ قالت كذا وكذا قالت وقد بلغ ذلك رسول الله صلى الله عليه وسلم ؟ قالت نعم قالت وبلغ أبا بكر؟ قالت نعم فخرت عائشة رضي الله عنها مغشيا عليها فما أفاقت إلا وعليها حمي بنافض قالت فقمت فدثرتها قالت فجاء النبي صلى الله عليه وسلم قال: \"فما شأن هذه؟ \" قلت: يا رسول الله أخذتها حمى بنافض قال \"فلعله في حديث تحدث به\" قالت فاستوت عائشة قاعدة فقالت: والله لئن حلفت لكم لا تصدقوني ولئن اعتذرت إليكم لا تعذروني فمثلي ومثلكم كمثل يعقوب وبنيه حين قال: \"فصبر جميل والله المستعان على ما تصفون\" قالت فخرج رسول الله صلى الله عليه وسلم وأنزل الله عذرها فرجع رسول الله صلى الله عليه وسلم ومعه أبو بكر فدخل فقال يا عائشة \"إن الله تعالى قد أنزل عذرك\" فقالت: بحمد الله لا بحمدك فقال لها أبو بكر: تقولين هذا لرسول الله صلى الله عليه وسلم ؟ قالت: نعم قالت: وكان فيمن حدث هذا الحديث رجل كان يعوله أبو بكر فحلف أن لا يصله فأنزل الله: \"ولا يأتل أولوا الفضل منكم والسعة\" إلى آخر الآية فقال أبو بكر بلى فوصله. تفرد به البخاري دون مسلم من طريق حصين وقد رواه البخاري عن موسى بن إسماعيل عن أبي عوانة وعن محمد بن سلام عن محمد بن فضيل كلاهما عن حصين به وفي لفظ أبي عوانة حدثتنى أم رومان وهذا صريح في سماع مسروق منها وقد أنكر ذلك جماعة من الحفاظ منهم الخطيب البغدادي وذلك لما ذكره أهل التاريخ أنها ماتت في زمن النبي صلى الله عليه وسلم قال الخطيب وقد كان مسروق يرسله فيقول سُئلت أم رومان ويسوقه فلعل بعضهم كتب سئلت بألف اعتقد الراوى أنها سألت فظنه متصلا قال الخطيب وقد رواه البخاري كذلك ولم تظهر له علته كذا قال والله أعلم. ورواه بعضهم عن مسروق بن عبدالله بن مسعود عن أم رومان فالله أعلم فقوله تعالى \"إن الذين جاءوا بالإفك\" أي الكذب والبهت والافتراء \"عصبة\" أي جماعة منكم \"لا تحسبوه شرا لكم\" أي يا آل أبي بكر \"بل هو خير لكم\" أى في الدنيا والآخرة لسان صدق فى الدنيا ورفعة منازل في الآخرة وإظهار شرف لهم باعتناء الله تعالى بعائشة أم المؤمنين رضي الله عنها حيث أنزل الله براءتها في القرآن العظيم الذي \"لا يأتيه الباطل من بين يديه ولا من خلفه\" الآية ولهذا لما دخل عليها ابن عباس رضي الله عنه وعنها وهي في سياق الموت قال لها أبشري فإنك زوجة رسول الله صلى الله عليه وسلم وكان يحبك ولم يتزوج بكرا غيرك ونزلت براءتك من السماء. وقال ابن جرير فى تفسيره حدثني محمد بن عثمان الواسطي حدثنا جعفر بن عون عن المعلي بن عرفان عن محمد بن عبدالله ابن جحش قال: تفاخرت عائشة وزينب رضي الله عنهما فقالت زينب أنا التي نزل تزويجي من السماء وقالت عائشه أنا التي نزل عذري في كتاب الله حين حملني صفوان بن المعطل على الراحلة فقالت لها زينب يا عائشة ما قلت حين ركبتيها؟ قالت حسبي الله ونعم الوكيل قالت قلت كلمة المؤمنين. وقوله تعالى \"لكل امرئ منهم ما اكتسب من الإثم\" أي لكل من تكلم فى هذه القضية ورمى أم المؤمنين عائشة رضي الله عنها بشيء من الفاحشة نصيب عظيم من العذاب \"والذي تولى كبره منهم\" قيل ابتدأ به وقيل الذي كان يجمعه ويستوشيه ويذيعه ويشيعه \"له عذاب عظيم\" أي على ذلك ثم الأكثرون على أن المراد بذلك إنما هو عبدالله بن أبي بن سلول قبحه الله ولعنه وهو الذي تقدم النص عليه في الحديث وقال ذلك مجاهد وغير واحد وقيل بل المراد به حسان بن ثابت وهو قول غريب ولولا أنه وقع فى صحيح البخاري ما قد يدل على إيراد ذلك لما كان لإيراده كبير فائدة فإنه من الصحابة الذين لهم فضائل ومناقب ومآثر وأحسن مآثره أنه كان يذب عن رسول الله صلى الله عليه وسلم بشعره وهو الذي قال له رسول الله صلى الله عليه وسلم \"هاجهم وجبريل معك\" وقال الأعمش عن ابن الضحى عن مسروق قال: كنت عند عائشة \"رضي الله عنها فدخل حسان بن ثابت فأمرت فألقي له وسادة فلما خرج قلت لعائشة ما تصنعين بهذا؟ يعني يدخل عليك وفي رواية قيل لها أتأذنين لهذا يدخل عليك وقد قال الله \"والذي تولى كبره منهم له عذاب عظيم \" قالت وأي عذاب أشد من العمي وكان قد ذهب بصره لعل الله أن يجعل ذلك هو العذاب العظيم ثم قالت إنه كان ينافح عن رسول الله صلى الله عليه وسلم وفي رواية أنه أنشدها عندما دخل عليها شعر يمتدحها به فقال: صان رزان ما تزن بريبة وتصبح غرثي من لحوم الغوافل فقالت أما أنت فلست كذلك وفي رواية: لكنك لست كذلك وقال ابن جرير حدثنا الحسن بن قزعة حدثنا سلمة بن علقمة حدثنا داود عن عامر عن عائشة أنها قالت ما سمعت بشعر أحسن من شعر حسان ولا تمثلت به إلا رجوت له الجنة قوله لأبي سفيان بن الحارث بن عبد المطلب. جوت محمدا فأجبت عنه وعند الله في ذاك الجزاء إن أبي ووالده وغرضي لعرض محمد منكم وقاء تشتمه ولست له بكفء؟ فشركما لخيركما الفداء ساني صارم لا عيب فيه وبحري لا تكدره الدلاء فقيل: يا أم المؤمنين أليس هذا لغوا؟ قالت: لا إنما اللغو ما قيل عند النساء قيل أليس الله يقول \"والذي تولى كبره منهم له عذاب عظيم\" قالت: أليس قد ذهب بصره وكنع بالسيف؟ تعني الضربة التي ضربه إياها صفوان ابن المعطل السلمي حين بلغه عنه أنه يتلكم في ذلك فعلاه بالسيف وكاد أن يقتله."
    },
    {
      "ayah": 12,
      "surah": 24,
      "text": "هذا تأديب من الله تعالى للمؤمنين في قصة عائشه رضي الله عنها حين أفاض بعضهم في ذلك الكلام السوء وما ذكر من شأن الإفك فقال تعالي \"لولا\" يعني هلا \"إذ سمعتموه\" أي ذلك الكلام الذي رميت به أم المؤمنين رضي الله عنها \"ظن المؤمنون والمؤمنات بأنفسهم خيرا\" أي قاسوا ذلك الكلام علي أنفسهم فإن كان لا يليق بهم فأم المؤمنين أولى بالبراءة منه بطريق الأولى والأخرى. وقد قيل إنها نزلت في أبي أيوب خالد بن زيد الأنصاري وامرأته رضي الله عنهما كما قال الإمام محمد بن إسحاق بن يسار عن أبيه عن بعض رجال بني النجار أن أبا أيوب خالد بن زيد الأنصاري قالت له امرأته أم أيوب: يا أبا أيوب أما تسمع ما يقول الناس فى عائشة رضي الله عنها قال نعم وذلك الكذب أكنت فاعلة ذلك يا أم أيوب؟ قالت لا والله ما كنت لأفعله قال فعائشة والله خير منك. قال فلما نزل القرآن ذكر الله عز وجل من قال في الفاحشة ما قال من أهل الإفك \"إن الذين جاءوا بالإفك عصبة منكم\" وذلك حسان وأصحابه الذين قالوا ما قالوا ثم قال تعالى \"لولا إذ سمعتموه ظن المؤمنون\" الآية أي كما قال أبو أيوب وصاحبته. وقال محمد بن عمر الواقدي حدثني ابن أبي حبيب عن داود بن الحصين عن أبي سفيان عن أفلح مولى أبي أيوب أن أم أيوب قالت لأبن أيوب: ألا تسمع ما يقول الناس في عائشة؟ قال بلى وذلك الكذب أفكنت يا أم أيوب فاعلة ذلك؟ قالت: لا والله قال فعائشة والله خير منك. فلما نزل القرآن وذكر أهل الإفك قال الله عز وجل \" لولا إذ سمعتموه ظن المؤمنون والمؤمنات بأنفسهم خيرا وقالوا هذا إفك مبين \" يعني أبا أيوب حين قال لأم أيوب ما قال - ويقال إنما قالها أبي بن كعب وقوله تعالى \"ظن المؤمنون\" ألخ أي هلا ظنوا الخير فإن أم المؤمنين أهله وأولى به هذا ما يتعلق بالباطن. وقوله \"وقالوا\" أي بألسنتهم \"هذا إفك مبين\" أي كذب ظاهر على أم المؤمنين رضي الله عنها فإن الذي وقع لم يكن ريبة وذلك أن مجيء أم المؤمنين راكبة جهرة على راحلة صفوان بن المعطل في وقت الظهيرة والجيش بكماله يشاهدون ذلك ورسول الله صلى الله عليه وسلم بين أظهرهم ولو كان هذا الأمر فيه ريبة لم يكن هذا جهرة ولا كانا يقدمان على مثل ذلك على رءوس الأشهاد بل كان هذا يكون لو قدر خفية مستورا فتعين أن ما جاء به أهل الإفك مما رموا به أم المؤمنين هو الكذب البحت والقول الزور والرعونة الفاحشة الفاجرة والصفقة الخاسرة."
    },
    {
      "ayah": 13,
      "surah": 24,
      "text": "قال الله تعالى \"لولا\" أي هلا \"جاءوا عليه\" أي على ما قالوه \"بأربعة شهداء\" يشهدون على صحة ما جاءوا به \" فإذا لم يأتوا بالشهداء فأولئك عند الله هم الكاذبون \" أي في حكم الله كاذبون فاجرون."
    },
    {
      "ayah": 14,
      "surah": 24,
      "text": "يقول تعالى \" لولا فضل الله عليكم ورحمته في الدنيا والآخرة \" أيها الخائضون في شأن عائشة بأن قبل توبتكم وإنابتكم إليه في الدنيا وعفا عنكم لإيمانكم بالنسبة إلى الدار الأخرة \" لمسكم فيما أفضتم فيه\" من قضية الإفك \"عذاب عظيم\" وهذا فيمن عنده إيمان يقبل الله بسببه التوبة كمسطح وحسان وحمنة بنت جحش أخت زينب بنت جحش فأما من خاض فيه من المنافقين كعبدالله بن أبي بن سلول وأضرابه فليس أولئك مرادين فى هذه الآية لأنه ليس عندهم من الإيمان والعمل الصالح ما يعادل هذا ولا ما يعارضه وهكذا شأن ما يرد من الوعيد على فعل معين يكون مطلقا مشروطا بعدم التوبة أو ما يقابله من عمل صالح يوازنه أو يرجح عليه. ثم قال تعالى \" إذ تلقونه بألسنتكم\" قال مجاهد وسعيد بن جبير: أي يرويه بعضكم عن بعض يقول هذا سمعته من فلان وقال فلان كذا وذكر بعضهم كذا."
    },
    {
      "ayah": 15,
      "surah": 24,
      "text": "وقرأ آخرون \"إذ تلقونه بألسنتكم\" وفي صحيح البخاري عن عائشة أنها كانت تقرؤها كذلك وتقول هي من ولق اللسان يعني الكذب الذي يستمر صاحبه عليه تقول العرب ولق فلان في السير إذا استمر فيه والقراءة الأولى أشهر وعليها الجمهور ولكن الثانية مروية عن أم المؤمنين عائشة قال ابن أبي حاتم حدثنا أبو سعيد الأشج حدثنا أبو أسامة عن نافع عن ابن عمر عن عائشة أنها كانت تقرأ \"إذ تلقونه\" وتقول هي ولق القول قال ابن أبي مليكة: هي أعلم به من غيرها. وقوله تعالى \"وتقولون بأفواهكم ما ليس لكم به علم\" أي تقولون ما لا تعلمون. ثم قال تعالى \"وتحسبونه هينا وهو عند الله عظيم\" أي تقولون ما تقولون فى شأن أم المؤمنين وتحسبون ذلك يسيرا سهلا ولو لم تكن زوجة النبي صلى الله عليه وسلم لما كان هينا فكيف وهي زوجة النبي الأمي خاتم الأنبياء وسيد المرسلين فعظيم عند الله أن يقال في زوجة نبيه ورسوله ما قيل فإن الله سبحانه وتعالى يغار لهذا وهو سبحانه وتعالى لا يقدر على زوجة نبي من الأنبياء ذلك حاشا وكلا ولما لم يكن ذلك فكيف يكون هذا في سيدة نساء الأنبياء وزوجه سيد ولد آدم على الإطلاق في الدنيا والآخرة ولهذا قال تعالى \"وتحسبونه هينا وهو عند الله عظيم\" وفي الصحيحين \"إن الرجل ليتكلم بالكلمة من سخط الله لا يدري ما تبلغ يهوي بها في النار أبعد مما بين السماء والأرض\" وفي رواية \"لا يلقي لها بالا\"."
    },
    {
      "ayah": 16,
      "surah": 24,
      "text": "هذا تأديب آخر بعد الأول الآمر بظن الخير أي إذا ذكر ما لا يليق من القول في شأن الخيرة فأولى ينبغي الظن بهم خيرا. وأن لا يشعر نفسه سوى ذلك ثم إن علق بنفسه شيء من ذلك وسوسة أو خيالا فلا ينبغي أن يتكلم به فإن رسول الله صلى الله عليه وسلم قال \"إن الله تعالى تجاوز لأمتي عما حدثت به أنفسها ما لم تقل أو تعمل\" أخرجاه في الصحيحين وقال الله تعالي \"ولولا إذ سمعتموه قلتم ما يكون لنا أن نتكلم بهذا\" أي ما ينبغي لنا أن نتفوه بهذا الكلام ولا نذكره لأحد \"سبحانك هذا بهتان عظيم\" أى سبحان الله أن يقال هذا الكلام على زوجة رسوله وحليلة خليله."
    },
    {
      "ayah": 17,
      "surah": 24,
      "text": "ثم قال تعالى \"يعظكم الله أن تعودوا لمثله أبدأ\" أي ينهاكم الله متوعدا أن يقع منكم ما يشبه هذا أبدا أي فيما يستقبل ولهذا قال \"إن كنتم مؤمنين\" أي إن كنتم تؤمنون بالله وشرعه وتعظمون رسوله صلى الله عليه وسلم فأما من كان متصفا بالكفر فله حكم آخر."
    },
    {
      "ayah": 18,
      "surah": 24,
      "text": "ثم قال تعالى \"ويبين الله لكم الآيات\" أي يوضح لكم الأحكام الشرعية والحكم القدرية \"والله عليم حكيم\" أي عليم بما يصلح عباده حكيم في شرعه وقدره."
    },
    {
      "ayah": 19,
      "surah": 24,
      "text": "هذا تأديب ثالث لمن سمع شيئا من الكلام السيء فقام بذهنه شيء منه وتكلم فلا يكثر منه ولا يشيعه ويذيعه فقد قال تعالى \"إن الذين يحبون أن تشيع الفاحشة في الذين آمنوا لهم عذاب أليم\" أي يختارون ظهور الكلام عنهم بالقبيح \"لهم عذاب أليم في الدنيا\" أي بالحد وفي الآخرة بالعذاب الأليم \"والله يعلم وأنتم لا تعلمون\" أي فردوا الأمور إليه ترشدوا وقال الإمام أحمد حدثنا محمد بن بكير حدثنا ميمون بن موسى المرئي حدثنا محمد ابن عباد المخزومي عن ثوبان عن النبي صلى الله عليه وسلم قال \"لا تؤذوا عباد الله ولا تعيروهم ولا تطلبوا عوراتهم فإنه من طلب عورة أخيه المسلم طلب الله عورته حتي يفضحه في بيته\"."
    },
    {
      "ayah": 2,
      "surah": 24,
      "text": "ثم قال تعالى: \"الزانية والزاني فاجلدوا كل واحد منهما مائة جلدة\" يعنى هذه الآية الكريمة فيها حكم الزاني في الحد وللعلماء فيه تفصيل ونزاع فإن الزاني لا يخلو إما أن يكون بكرا وهو الذي لم يتزوج أو محصنا وهو الذي قد وطئ في نكاح صحيح وهو حر بالغ عاقل فأما إذا كان بكرا لم يتزوج فإن حده مائه جلدة كما في الآية ويزاد على ذلك أن يغرب عاما عن بلده عند جمهور العلماء خلافا لأبي حنيفة - رحمه الله - فإن عنده أن التغريب إلى رأي الإمام إن شاء غرب وإن شاء لم يغرب وحجة الجمهور في ذلك ما ثبت في الصحيحين من رواية الزهري عن عبيد الله بن عبدالله بن عتبة بن مسعود عن أبي هريرة وزيد بن خالد الجهني في الأعرابيين اللذين أتيا رسول الله صلى الله عليه وسلم فقال أحدهما: يا رسول الله إن ابني هذا كان عسيفا - يعني أجيرا - على هذا فزنى بامرأته فافتديت ابني منه بمائة شاة ووليدة فسألت أهل العلم فأخبروني أن على ابني جلد مائة وتغريب عام وأن على امرأه هذا: الرجم فقال رسول الله صلى الله عليه وسلم: \"والذي نفسي بيده لأقضين بينكما بكتاب الله تعالى الوليدة والغنم رد عليك وعلى ابنك مائة جلدة وتغريب عام. واغد يا أنيس - لرجل من أسلم - إلى امرأة هذا فإن اعترفت فارجمها\" فغدا عليها فاعترفت فرجمها. وفى هذا دلالة على تغريب الزاني مع جلد مائة إذا كان بكرا لم يتزوج فأما إذا كان محصنا وهو الذي قد وطئ في نكاح صحيح وهو حر بالغ عاقل فإنه يرجم كما قال الإمام مالك حدثنى ابن شهاب أخبرنا عبيدالله بن عبدالله بن عتبة بن مسعود أن ابن عباس أخبره أن عمر قام فحمد الله وأثنى عليه ثم قال: أما بعد أيها الناس فإن الله تعالى بعث محمدا صلى الله عليه وسلم بالحق وأنزل عليه الكتاب فكان فيما أنزل عليه آية الرجم فقرأناها ووعيناها ورجم رسول الله صلى الله عليه وسلم ورجمنا بعده فأخشي أن يطول بالناس زمان أن يقول قائل لا نجد آية الرجم في كتاب الله فيضلوا بترك فريضة قد أنزلها الله فالرجم في كتاب الله حق على من زني إذا أحصن من الرجال ومن النساء إذا قامت البينة أو الحبل أو الاعتراف. أخرجاه في الصحيحين من حديث مالك مطولا وهذه قطعة منه فيها مقصودنا ههنا. وروى الإمام أحمد عن هشيم عن الزهري عن عبيدالله بن عبدالله عن ابن عباس حدثني عبد الرحمن بن عوف أن عمر بن الخطاب خطب الناس فسمعته يقول: ألا وإن ناسا يقولون ما الرجم في كتاب الله وإنما فيه الجلد وقد رجم رسول الله صلى الله عليه وسلم ورجمنا بعده ولولا أن يقول قائل أو يتكلم متكلم أن عمر زاد في كتاب الله ما ليس منه لأثبتها كما نزلت به. وأخرجه النسائي من حديث عبيدالله بن عبدالله به وقد روى الإمام أحمد أيضا عن هشيم عن علي بن زيد عن يوسف بن مهران عن ابن عباس قال خطب عمر بن الخطاب فذكر الرجم فقال: \"إنا لا نجد من الرجم بدا فإنه حد من حدود الله تعالى ألا وإن رسول الله صلى الله عليه وسلم قد رجم ورجمنا بعده ولولا أن يقول قائلون إن عمر زاد في كتاب الله ما ليس فيه لكتبت في ناحية من المصحف وشهد عمر بن الخطاب وعبد الرحمن بن عوف وفلان وفلان أن رسول الله صلى الله عليه وسلم قد رجم ورجمنا بعده ألا إنه سيكون قوم من بعدكم يكذبون بالرجم وبالشفاعة وبعذاب القبر وبقوم يخرجون من النار بعدما امتحشوا. وروى أحمد أيضا عن يحيي الأنصاري عن سعيد بن المسيب عن عمر بن الخطاب \"إياكم أن تهلكوا عن آية الرجم\" الحديث رواه الترمذي من حديث سعيد عن عمر وقال صحيح وقال الحافظ أبو يعلى الموصلي حدثنا عبيدالله بن عمر القواريري حدثنا يزيد بن زريع حدثنا أبو عون عن محمد هو ابن سيرين قال ابن عمر: نبئت عن كثير بن الصلت قال كنا عند مروان وفينا زيد فقال زيد بن ثابت كنا نقرأ: الشيخ والشيخة إذا زنيا فارجموهما البتة قال مروان ألا كتبتها في المصحف؟ قال ذكرنا ذلك وفينا عمر بن الخطاب فقال أنا أشفيكم من ذلك قال قلنا فكيف؟ قال جاء رجل إلى النبي صلى الله عليه وسلم قال فذكر كذا وكذا وذكر الرجم فقال يا رسول الله اكتب لي آية الرجم قال \"لا أستطيع الآن\" هذا أو نحو ذلك. وقد رواه النسائي من حديث محمد بن المثني عن غندر عن شعبة عن قتادة عن يونس بن جبير عن كثير بن الصلت عن زيد بن ثابت به وهذه طرق كلها متعددة متعاضدة ودالة على أن آية الرجم كانت مكتوبة فنسخ تلاوتها وبقي حكمها معمولا به والله أعلم. وقد أمر رسول الله صلى الله عليه وسلم برجم هذه المرأة وهي زوجة الرجل الذي استأجر الأجير لما زنت مع الأجير ورجم رسول الله صلى الله عليه وسلم ماعزا والغامدية وكل هؤلاء لم ينقل عن رسول الله صلى الله عليه وسلم أنه جلدهم قبل الرجم وإنما وردت الأحاديث الصحيحة المتعاضدة المتعددة الطرق والألفاظ بالاقتصار على رجمهم وليس فيها ذكر الجلد ولهذا كان هذا مذهب جمهور العلماء وإليه ذهب أبو حنيفة ومالك والشافعي رحمهم الله وذهب الإمام أحمد رحمه الله إلى أنه يجب أن يجمع على الزاني المحصن بين الجلد للآية والرجم للسنة كما روي عن أمير المؤمنين علي بن أبي طالب \" أنه لما أتي بسراجة وكانت قد زنت وهي محصنة فجلدها يوم الخميس ورجمها يوم الجمعة فقال: جلدتها بكتاب الله ورجمتها بسنة رسول الله صلى الله عليه وسلم وقد روى الإمام أحمد وأهل السنن الأربعة ومسلم من حديث قتادة عن الحسن عن حطان بن عبدالله الرقاشي عن عبادة بن الصامت قال: قال رسول الله صلى الله عليه وسلم: \"خذوا عني خذوا عني قد جعل الله لهن سبيلا البكر بالبكر جلد مائة وتغريب عام والثيب بالثيب جلد مائة والرجم\". وقوله تعالى \"ولا تأخذكم بهما رأفة في دين الله\" أي في حكم الله أي لا ترأفوا بهما في شرع الله وليس المنهي عنه الرأفة الطبيعية على ترك الحد وإنما هي الرأفة التي تحمل الحاكم على ترك الحد فلا يجوز ذلك قال مجاهد: \"ولا تأخذكم بهما رأفة في دين الله\" قال: إقامة الحدود إذا رفعت إلي السلطان فتقام ولا تعطل وكذا روي عن سعيد بن جبير وعطاء بن أبي رباح وقد جاء في الحديث: \"تعافوا الحدود فيما بينكم فما بلغني من حد فقد وجب\" وفي الحديث الآخر: \"لحد يقام في الأرض خير لأهلها من أن يمطروا أربعين صباحا\" وقيل المراد \" ولا تأخذكم بهما رأفة في دين الله \"فلا تقيموا الحد كما ينبغي من شدة الضرب الزاجر عن المأثم وليس المراد الضرب المبرح. قال عامر الشعبي \"ولا تأخذكم بهما رأفة في دين الله\" قال: رحمة في شدة الضرب وقال عطاء: ضرب ليس بالمبرح وقال سعيد بن أبي عروبة عن حماد بن أبي سليمان: يجلد القاذف وعليه ثيابه والزاني تخلع ثيابه ثم تلا \"ولا تأخذكم بهما رأفة في دين الله\" فقلت: هذا في الحكم قال: هذا في الحكم والجلد يعني في إقامة الحد وفي شدة الضرب وقال ابن أبي حاتم حدثنا عمرو بن عبدالله الأودي حدثنا وكيع عن نافع عن ابن عمرو عن ابن أبي مليكة عن عبيدالله بن عبدالله بن عمر أن جارية لابن عمر زنت فضرب رجليها قال نافع: أراه قال ظهرها قال قلت \"ولا تأخذكم بهما رأفة في دين الله\" قال: يا بني ورأيتني أخذتني بها رأفة إن الله لم يأمرني أن أقتلها ولا أن أجعل جلدها في رأسها وقد أوجعت حين ضربتها. وقوله تعالى \"إن كنتم تؤمنون بالله واليوم الآخر\" أي فافعلوا ذلك وأقيموا الحدود على من زني وشددوا عليه الضرب ولكن ليس مبرحا ليرتدع هو ومن يصنع مثله بذلك وقد جاء في المسند عن بعض الصحابة أنه قال: يا رسول الله إني لأذبح الشاة وأنا أرحمها فقال \"ولك في ذلك أجر\". وقوله تعالى \"وليشهد عذابهما طائفة من المؤمنين\" هذا فيه تنكيل للزانيين إذا جلدا بحضرة الناس فإن ذلك يكون أبلغ في زجرهما وأنجع في ردعهما فإن في ذلك تقريعا وتوبيخا وفضيحة إذا كان الناس حضورا. قال الحسن البصري في قوله \"وليشهد عذابهما طائفة من المؤمنين\" يعني علانية ثم قال علي بن أبي طلحة عن ابن عباس \"وليشهد عذابهما طائفة من المؤمنين\" الطائفة الرجل فما فوقه وقال مجاهد: الطائفة الرجل الواحد إلى الألف وكذا قال عكرمة ولهذا قال أحمد: إن الطائفة تصدق على واحد وقال عطاء بن أبي رباح: اثنان وبه قال إسحاق بن راهوية وكذا قال سعيد بن جبير \"طائفة من المؤمنين\" قال: يعني رجل فصاعدا وقال الزهري: ثلاث نفر فصاعدا وقال عبد الرزاق حدثني ابن وهب عن الإمام مالك في قوله \"وليشهد عذابهما طائفة من المؤمنين\" قال: الطائفة أربعة نفر فصاعدا لأنه لا يكفي شهادة في الزنا إلا أربعة شهداء فصاعدا وبه قال الشافعي وقال ربيعة: خمسة وقال الحسن البصري: عشرة وقال قتادة: أمر الله أن يشهد عذابهما طائفة من المؤمنين أي نفر من المسلمين ليكون ذلك موعظة وعبرة ونكالا وقال ابن أبي حاتم حدثنا أبي حدثنا يحيي بن عثمان حدثنا بقية قال سمعت نصر بن علقمة يقول في قوله تعالى \"وليشهد عذابهما طائفة من المؤمنين\" قال: ليس ذلك للفضيحة إنما ذلك ليدعى الله تعالي لهما بالتوبة والرحمة."
    },
    {
      "ayah": 20,
      "surah": 24,
      "text": "أي لولا هذا لكان أمر آخر ولكنه تعالى رءوف بعباده رحيم بهم فتاب على من تاب إليه من هذه القضية وطهر من طهر منهم بالحد الذي أقيم عليهم."
    },
    {
      "ayah": 21,
      "surah": 24,
      "text": "\"خطوات الشيطان\" يعني طرائقه ومسالكه وما يأمر به \"ومن يتبع خطوات الشيطان فإنه يأمر بالفحشاء والمنكر\" هذا تنفير وتحذير من ذلك بأفصح عبارة وأبلغها وأوجزها وأحسنها قال علي ابن أبى طلحة عن ابن عباس \"خطوات الشيطان\" عمله وقال عكرمة: نزغاته وقال قتادة: كل معصية فهي من خطوات الشيطان وقال أبو مجلز: النذور في المعاصي من خطوات الشيطان وقال مسروق: سأل رجل ابن مسعود فقال: إني حرمت أن آكل طعاما وسماه فقال: هذا من نزعات الشيطان كفر عن يمينك وكل وقال الشعبي في رجل نذر ذبح ولده هذا من نزغات الشيطان وأفتاه أن يذبح كبشا وقال ابن أبي حاتم حدثنا أبي حدثنا حسان بن عبدالله المصري حدثنا السري بن يحيي عن سليمان التيمي عن أبي رافع قال: غضبت على امرأتي فقالت هي يوما يهودية ويوما نصرانية وكل مملوك لها حر إن لم تطلق امرأتك فأتيت عبدالله بن عمر فقال: إنما هذه من نزغات الشيطان وكذلك قالت زينب بنت أم سلمة وهي يومئذ أفقه امرأه بالمدينة وأتيت عاصم بن عمر فقال مثل ذلك. ثم قال تعالى \"ولولا فضل الله عليكم ورحمته ما زكى منكم من أحد أبدا\" أي لولا هو يرزق من يشاء التوبة والرجوع إليه ويزكي النفوس من شركها وفجورها ودنسها وما فيها من أخلاق رديئة كل بحسبه لما حصل أحد لنفسه زكاة ولا خيرا\" ولكن الله يزكي من يشاء\" أى من خلقه ويضل من يشاء ويرديه في مهالك الضلال والغي وقوله \"والله سميع\" أي سميع لأقوال عباده \"عليم\" بمن يستحق منهم الهدى والضلال."
    },
    {
      "ayah": 22,
      "surah": 24,
      "text": "يقول تعالي \"ولا يأتل\" من الألية وهي الحلف أي لا يحلف \"أولو الفضل منكم\" أى الطول والصدقة والإحسان \"والسعة\" أي الجدة \"أن يؤتوا أولي القربي والمساكين والمهاجرين في سبيل الله\" أي لا تحلفوا أن لا تصلوا قراباتكم المساكين والمهاجرين وهذا في غاية الترفق والعطف على صلة الأرحام ولهذا قال تعالى \"وليعفوا وليصفحوا\" أي عما تقدم منهم من الإساءة والأذى. وهذا من حلمه تعالي وكرمه ولطفه بخلقه مع ظلمهم لأنفسهم وهذه الآية نزلت في الصديق رضي الله عنه حين حلف أن لا ينفع مسطح بن أثاثة بنافعة أبدا بعدما قال في عائشة ما قال كما تقدم في الحديث فلما أنزل الله براءة أم المؤمنين عائشة وطابت النفوس المؤمنة واستقرت وتاب الله على من كان تكلم من المؤمنين في ذلك وأقيم الحد على من أقيم عليه- شرع تبارك وتعالى وله الفضل والمنة يعطف الصديق على قريبه ونسيبه وهو مسطح بن أثاثة فإنه كان ابن خاله الصديق وكان مسكينا لا مال له إلا ما ينفق عليه أبو بكر رضي الله عنه وكان من المهاجرين في سبيل الله وقد زلق زلقة تاب الله عليه منها وضرب الحد عليها. وكان الصديق رضي الله عنه معروفا بالمعروف له الفضل والأيادي على الأقارب والأجانب فلما نزلت هذه الآية إلى قوله \"ألا تحبون أن يغفر الله لكم\" الآية فإن الجزاء من جنس العمل فكما تغفر ذنب من أذنب إليك يغفر الله لك وكما تصفح يصفح عنك فعند ذلك قال الصديق: بلى والله إنا نحب أن تغفر لنا يا ربنا ثم رجع إلى مسطح ما كان يصله من النفقة وقال: والله لا أنزعها منه أبدا في مقابلة ما كان قال: والله لا أنفعه بنافعة أبدا. فلهذا كان الصديق هو الصديق رضي الله عنه وعن بنته."
    },
    {
      "ayah": 23,
      "surah": 24,
      "text": "هذا وعيد من الله تعالى للذين يرمون المحصنات الغافلات المؤمنات خرج مخرج الغالب فأمهات المؤمنين أولى بالدخول في هذا من كل محصنة ولا سيما التي كانت سبب النزول وهي عائشة بنت الصديق رضي الله عنهما غوقد أجمع العلماء رحمهم الله قاطبة على أن من سبها بعد هذا ورماها بما رماها به بعد هذا الذي ذكر في هذه الآية فإنه كافر لأنه معاند للقرآن وفي بقية أمهات المؤمنين قولان: أصحهما أنهن كهي والله أعلم وقوله تعالى \"لعنوا في الدنيا والآخرة\". الآية كقوله \"إن الذين يؤذون الله ورسوله\" الآية. وقد ذهب بعضهم إلى أنها خاصة بعائشة رضي الله عنها فقال ابن أبي حاتم حدثنا أبو سعيد الأشج حدثنا عبدالله بن حراش عن العوام عن سعيد بن جبير عن ابن عباس في الآية \"إن الذين يرمون المحصنات الغافلات المؤمنات\" قال نزلت في عائشة خاصة وكذا قال سعيد بن جبير ومقاتل بن حيان. وقد ذكره ابن جرير عن عائشة فقال حدثنا أحمد بن عمدة الضبي حدثنا أبو عوانة عن عمر بن أبي سلمة عن أبيه عن عائشة رضي الله عنها قالت: رميت بما رميت به وأنا غافلة فبلغني بعد ذلك قالت فبينا رسول الله جالس عندي إذ أوحي إليه قالت وكان إذا أوحي إليه أخذه كهيئة السبات وإنه أوحي إليه وهو جالس عندي ثم استوي جالسا يمسح على وجهه وقال \"يا عائشة أبشري\" قالت فقلت بحمد الله لا بحمدك فقرأ \"إن الذين يرمون المحصنات الغافلات المؤمنات - حتى بلغ - أولئك مبرءون مما يقولون لهم مغفرة ورزق كريم\" هكذا أورده وليس فيه أن الحكم خاص بها وإنما فيه أنها سبب النزول دون غيرها وإن كان الحكم يعمها كغيرها ولعله مراد ابن عباس ومن قال كقوله والله أعلم. وقال الضحاك وأبو الجوزاء وسلمة ابن نبيط: المراد بها أزواج النبي خاصة دون غيرهن من النساء وقال العوفي عن ابن عباس في الآية \"إن الذين يرمون المحصنات الغافلات المؤمنات\" الآية يعني أزواج النبي صلى الله عليه وسلم رماهن أهل النفاق فأوجب الله لهم اللعنة والغضب وباءوا بسخط من الله فكان ذلك في أزواج النبي صلى الله عليه وسلم ثم نزل بعد ذلك \" والذين يرمون المحصنات ثم لم يأتوا بأربعة شهداء - إلى قوله - فإن الله غفور رحيم\" فأنزل الله الجلد والتوبة فالتوبة تقبل والشهادة ترد. وقال ابن جرير حدثنا القاسم حدثنا الحسين حدثنا هشيم أخبرنا العوام بن حوشب عن شيخ من بني أسد عن ابن عباس قال فسر سورة النور فلما أتي على هذه الآية \"إن الذين يرمون المحصنات الغافلات المؤمنات\" الآية قال في شأن عائشة وأزواج النبي صلى الله عليه وسلم وهي مبهمة وليست لهم توبة ثم قرأ \"والذين يرمون المحصنات ثم لم يأتوا بأربعة شهداء - إلى قوله- إلا الذين تابوا من بعد ذلك وأصلحوا\" الآية قال فجعل لهؤلاء توبة ولم يجعل لمن قذف أولئك توبة قال فهم بعض القوم أن يقوم إليه فيقبل رأسه من حسن ما فسر به سورة النور فقوله وهي مبهمة أي عامة في تحريم قذف كل محصنة ولعنته في الدنيا والآخرة وهكذا قال عبد الرحمن بن زيد بن أسلم هذا في عائشة ومن صنع مثل هذا أيضا اليوم فى المسلمات فله ما قال الله تعالى ولكن عائشة كانت أما في ذلك. وقد اختار ابن جرير عمومها وهو الصحيح ويعضد العموم ما رواه ابن أبى حاتم حدثنا أحمد بن عبدالرحمن ابن أخي وهب حدثني عمي حدثنا سليمان بن بلال عن ثور بن زيد عن أبي الغيث عن أبي هريرة أن رسول الله صلى الله عليه وسلم قال \"اجتنبوا السبع الموبقات\" قيل وما هن يا رسول الله؟ قال \"الشرك بالله والسحر وقتل النفس التي حرم الله إلا بالحق. وأكل الربا وأكل مال اليتيم والتولي يوم الزحف وقذف المحصنات الغافلات المؤمنات\" أخرجاه في الصحيحين من حديث سليمان بن بلال به وقال الحافظ أبو القاسم الطبراني حدثنا محمد بن عمر أبي خالد الطائي المحرمي حدثني أبي وحدثنا أبو شعيب الحراني حدثنا جدي أحمد بن أبي شعيب حدثني موسي بن أعين عن ليث عن أبي إسحاق عن صلة بن زفر عن حذيفة عن النبي صلى الله عليه وسلم قال \"قذف المحصنة يهدم عمل مائة سنة\"."
    },
    {
      "ayah": 24,
      "surah": 24,
      "text": "قال ابن أبي حاتم حدثنا أبو سعيد الأشج حدثنا أبو يحيي الرازي عن عمرو بن أبي قيس عن مطرف عن المنهال عن سعيد بن جبير عن ابن عباس قال: إنهم يعني المشركين إذا رأوا أنه لا يدخل الجنة إلا أهل الصلاة قالوا تعالوا حتى نجحد فيجحدون فيختم على أفواههم وتشهد أيديهم وأرجلهم ولا يكتمون الله حديثا وروى ابن أبي حاتم وابن جرير أيضا حدثنا يونس بن عبد الأعلى حدثنا ابن وهب أخبرني عمرو بن الحارث عن دراج عن أبي الهيثم عن أبي سعيد عن النبي صلى الله عليه وسلم ع قال \"إذا كان يوم القيامة عرف الكافر بعمله فيجحد ويخاصم فيقال هؤلاء جيرانك يشهدون عليك فيقول كذبوا فيقال أهلك وعشيرتك فيقول كذبوا فيقال احلفوا فيحلفون ثم يصمهم الله فتشهد عليه أيديهم وألسنتهم ثم يدخلهم النار\" وقال ابن أبي حاتم أيضا حدثنا أبو شيبة إبراهيم عن عبدالله بن أبن شيبة الكوف حدثنا منجاب بن الحارث التميمي حدثنا أبو عامر الأسدي حدثنا سفيان بن عبيد المكتب عن فضيل بن عمرو الفقيمي عن الشعبي عن أنس بن مالك قال: كنا عند النبي صلى الله عليه وسلم فضحك حتي بدت نواجذه ثم قال: \"أتدرون مم أضحك؟ \" قلنا الله ورسوله أعلم قال من مجادلة العبد لربه يقول يا رب ألم تجرني من الظلم؟ فيقول بلى فيقول لا أجيز علي إلا شاهدا من نفسي فيقول كفي بنفسك اليوم عليك شهيدا وبالكرام عليك شهودا فيختم على فيه ويقال لأركانه انطقي فتنطق بعمله ثم يخلي بينه وبين الكلام فيقول بعدا لكن وسحقا فعنكن كنت أناضل\" وقد رواه مسلم والنسائي جميعا عن أبي بكر ابن أبي النضر عن أبيه عن عبدالله الأشجعي عن سفيان الثوري به ثم قال النسائي لا أعل أحدأ روى هذا الحديث عن سفيان الثوري غير الأشجعي وهو حديث غريب والله أعلم هكذا قال وقال قتادة بن أدم: والله إن عليك لشهودا غير متهمة من بذلك فراقبهم واتق الله في سرك وعلانيتك فإنه لا يخفي عنه خافية والظلمة عنده ضوء والسر عنده علانية فمن استطاع أن يموت وهو بالله حسن الظن فليفعل ولا قوة إلا بالله."
    },
    {
      "ayah": 25,
      "surah": 24,
      "text": "قال ابن عباس \"دينهم\" أي حسابهم وكل ما في القرآن دينهم أي حسابهم وكذا قال غير واحد ثم إن قراءة الجمهور بنصب الحق على أنه صفة لدينهم وقرأ مجاهد بالرفع على أنه نعت الجلالة وقرأها بعض السلف في مصحف أبي بن كعب: يومئذ يوفيهم الله دينهم الحق. وقوله \"ويعلمون أن الله هو الحق المبين\" أي وعده ووعيده وحسابه هو العدل الذي لا جوز فيه."
    },
    {
      "ayah": 26,
      "surah": 24,
      "text": "قال ابن عباس: الخبيثات من القول للخبيثين من الرجال والخبيثون من الرجال للخبيثات من القول. والطيبات من القول للطيبين من الرجال والطيبون من الرجال للطيبات من القول - قال - ونزلت في عائشة وأهل الإفك وهكذا روي عن مجاهد وعطاء وسعيد بن جبير والشعبي والحسن البصري وحبيب بن أبي ثابت والضحاك واختاره ابن جرير ووجهه بأن الكلام القبيح أولى بأهل القبح من الناس والكلام الطيب أولى بالطيبين من الناس فما نسبه أهل النفاق إلى عائشة من كلام هم أولى به وهي أولى بالبراءة والنزاهة منهم ولهذا قال تعالى \"أولئك مبرءون مما يقولون\" وقال عبدالرحمن بن زيد بن أسلم: الخبيثات من النساء للخبيثين من الرجال والخبيثون من الرجال للخبيثات من النساء والطيبات من النساء للطيبين من الرجال والطيبون من الرجال للطيبات من النساء وهذا أيضا يرجع إلى ما قاله أولئك باللازم أي ما كان الله ليجعل عائشة زوجة لرسول الله صلى الله عليه وسلم إلا وهي طيبة لأنه أطيب من كل طيب من البشر ولو كانت خبيثة لما صلحت له لا شرعا ولا قدرا ولهذا قال تعالى \"أولئك مبرءون مما يقولون\" أي هم بعداء عما يقوله أهل الإفك والعدوان \"لهم مغفرة\" أي بسبب ما قيل فيهم من الكذب \"ورزق كريم\" أى عند الله في جنات النعيم وفيه وعد بأن تكون زوجة رسول الله صلى الله عليه وسلم في الجنة قال ابن أبي حاتم حدثنا محمد بن مسلم حدثنا أبو نعيم حدثنا عبد السلام بن حرب عن يزيد بن عبدالرحمن عن الحكم بإسناده إلى يحيي بن الجزار قال: جاء أسير بن جابر إلى عبدالله فقال لقد سمعت الوليد بن عقبة تكلم اليوم بكلام أعجبني فقال عبدالله: إن الرجل المؤمن يكون في قلبه الكلمة الطيبة تتجلجل في صدره ما يستقر حتى يلفظها فيسمعها الرجل عنده يتلها فيضمها إليه وإن الرجل الفاجر يكون في قلبه الكلمة الخبيثة تتجلجل في صدره ما تستقر حتى يلفظها فيسمعها الرجل الذي عنده يتلها فيضمها إليه ثم قرأ عبدالله \"الخبيثات للخبيثين والخبيثون للخبيثات والطيبات للطيبين والطيبون للطيبات\" الآية ويشبه هذا ما رواه الإمام أحمد في المسند مرفوعا \"مثل الذي يسمع الحكمة ثم لا يحدث إلا بشرّ ما سمع كمثل رجل جاء إلى صاحب غنم فقال اجزر لي شاة فقال اذهب فخذ بأذن أيها شئت فذهب فأخذ بأذن كلب الغنم\" وفي الحديث الآخر \"الحكمة ضالة المؤمن حيث وجدها أخذها\"."
    },
    {
      "ayah": 27,
      "surah": 24,
      "text": "هذه آداب شرعية أدب الله بها عباده المؤمنين وذلك في استئذان أمرهم أن لا يدخلوا بيوتا غير بيوتهم حتى يستأنسوا أي يستأذنوا قبل الدخول ويسلموا بعده وينبغى أن يستأذن ثلاث مرات فإن أذن له وإلا انصرف كما ثبت في الصحيح أن أبا موسي حين استأذن على عمر ثلاثا فلم يؤذن له انصرف ثم قال عمر: ألم أسمع صوت عبدالله ابن قيس يستأذن؟ ائذنوا له فطلبوه فوجودة قد ذهب فلما جاء بعد ذلك قال: ما أرجعك؟ قال: إني استأذنت ثلاثا فلم يؤذن لي وإني سمعت النبي صلى الله عليه وسلم يقول: \"إذا استأذن أحدكم ثلاثا فلم يؤذن له فلينصرف\" فقال عمر: لتأتيني على هذا بينة وإلا أوجعتك صربا فذهب إلى ملإ من الأنصار فذكر لهم ما قال عمر فقالوا: لا يشهد لك إلا أصغرنا فقام معه أبو سعيد الخدري فأخبر عمر بذلك فقال: ألهاني عنه الصفق بالأسواق. وقال الإمام أحمد حدثنا عبد الرزاق أخبرنا عمر عن ثابت عن أنس أو غيره أن النبي صلى الله عليه وسلم استأذن على سعد بن عبادة فقال \"السلام عليك ورحمة الله فقال سعد: وعليك السلام ورحمة الله ولم يسمع النبي صلى الله عليه وسلم حتى سلم ثلاثا ورد عليه سعد ثلاثا ولم يسمعه فرجع النبي صلى الله عليه وسلم فاتبعه سعد فقال: يا رسول الله بأبي أنت وأمي ما سلمت تسليمة إلا وهى بأذني ولقد رددت عليك ولم أسمعك وأردت أن أستكثر من سلامك ومن البركة ثم أدخله البيت فقرب إليه زبيب فأكل نبي الله فلما فرغ قال \"أكل طعامكم الأبرار وصلت عليكم الملائكة وأفطر عندكم الصائمون\" وقد روى أبو داود والنسائي من حديث أبي عمرو الأوزاعي سمعت يحيي بن أبي كثير يقول: حدثني محمد بن عبدالرحمن ابن سعد بن زرارة عن قيس بن سعد هو ابن عبادة قال: زارنا رسول الله صلى الله عليه وسلم في منزلنا فقال \"السلام عليكم ورحمة الله\" فرد سعد ردا خفيا قال قيس: فقلت ألا تأذن لرسول الله صلى الله عليه وسلم؟ فقال دعه يكثر علينا من السلام فقال رسول الله صلى الله عليه وسلم \"السلام عليكم ورحمة الله\" فرد سعد ردأ خفيا ثم قال رسول الله صلى الله عليه وسلم \"السلام عليكم ورحمة الله\" ثم رجع رسول الله صلى الله عليه وسلم واتبعه سعد فقال: يا رسول الله إني كنت أسمع تسليمك وأرد عليك ردأ خفيا لتكثر علينا من السلام قال فانصرف معه رسول الله صلى الله عليه وسلم وأمر له سعد بغسل فاغتسل ثم ناوله خميصة مصبوغة بزعفران أو ورس فاشتمل بها ثم رفع رسول الله صلى الله عليه وسلم يديه وهو يقول: \"اللهم اجعل صلاتك ورحمتك على آل سعد بن عبادة\" قال ثم أصاب رسول الله صلى الله عليه وسلم من الطعام فلما أراد الانصراف قرب إليه سعد حمارا قد وطئ عليه بقطيفة فركب رسول الله صلى الله عليه وسلم فقال سعد: يا قيس اصحب رسول الله صلى الله عليه وسلم قال قيس: فقال رسول الله صلى الله عليه وسلم \"اركب\" فأبيت فقال \"إما أن تركب وإما أن تنصرف\" قال فانصرفت وقد روي هذا من وجوه أخر فهو حديث جيد قوي والله أعلم. ثم ليعلم أنه ينبغي للمستأذن على أهل المنزل أن لا يقف تلقاء الباب بوجهه ولكن ليكن الباب عن يمينه أو يساره لما رواه أبو داود: حدثنا مؤمل بن الفضل الحراني في آخرين قالوا حدثنا بقية حدثنا محمد بن عبدالرحمن عن عبدالله بن بشر قال: كان رسول الله صلى الله عليه وسلم إذا أتي باب قوم لم يستقبل الباب من تلقاء وجهه ولكن من ركنه الأيمن أو الأيسر ويقول \"السلام عليكم السلام عليكم\" وذلك أن الدور لم يكن عليها يومئذ ستور; انفرد به أبو داود. وقال أبو داود أيضا حدثنا عثمان بن أبي شيبة حدثنا جرير حينئذ قال أبو داود حدثنا أبو بكر بن أبي شيبة حدثنا حفص عن الأعمش عن طلحة عن هزيل قال جاء رجل قال عثمان: سعد فوقف على باب النبي صلى الله عليه وسلم يستأذن فقام على الباب قال عثمان مستقبل الباب فقال له النبي صلى الله عليه وسلم \"هكذا عنك - أو هكذا - فإنما الاستئذان من النظر\" وقد رواه أبو داود الطيالسي عن سفيان الثوري عن الأعمش عن طلحة بن مصرف عن رجل عن سعد عن النبي صلى الله عليه وسلم رواه أبو داود من حديثه وفي الصحيحين عن رسول الله صلى الله عليه وسلم أنه قال \"لو أن امرأ اطلع عليك بغير إذن فخذفته بحصاة ففقأت عينه ما كان عليك من جناح\" وأخرج الجماعة من حديث شعبة عن محمد بن المنكدر عن جابر قال أتيت النبي صلى الله عليه وسلم في دين كان على أبي فدققت الباب فقال \"من ذا؟\" فقلت أنا قال \"أنا أنا؟\" كأنه كرهه وإنما كره ذلك لأن هذه اللفظة لا يعرف صاحبها حتى يفصح باسمه أو كنيته التي هو مشهور بها وإلا فكل أحد يعبر عن نفسه بأنا فلا يحصل بها المقصود من الاستئذان الذي هو الاستئناس المأمور به في الآية وقال العوفي عن ابن عباس الاستئناس الاستئذان وكذا قال غير واحد وقال ابن جرير حدثنا ابن بشار حدثنا محمد بن جعفر حدثنا شعبة عن أبي بشر عن سعيد بن جبير عن ابن عباس فى هذه الآية \" لا تدخلوا بيوتا غير بيوتكم حتى تستأنسوا وتسلموا \" قال إنما هى خطأ من الكتاب حتى تستأذنوا وتسلموا وهكذا رواه هشيم عن أبي بشر وهو جعفر بن إياس عن سعيد عن ابن عباس بمثله وزاد وكان ابن عباس يقرأ \"حتى تستأذنوا وتسلموا\" وكان يقرأ على قراءة أبي بن كعب رضي الله عنه. وهذا غريب جدا عن ابن عباس وقال هشيم أخبرنا مغيرة عن إبراهيم قال في مصحف ابن مسعود حتى تسلموا على أهلها وتستأذنوا وهذا أيضا رواية عن ابن عباس وهو اختيار ابن جرير وقد قال الإمام أحمد حدثنا روح حدثنا ابن جريج أخبرني عمرو بن أبي سفيان أن عمرو بن أبي صفوان أخبره أن كلدة بن الحنبل أخبره أن صفوان بن أمية بعثه في الفتح بلبأ وجدابة وضغابيس والنبي صلى الله عليه وسلم بأعلى الوادي قال فدخلت على النبي صلى الله عليه وسلم ولم أسلم ولم أستأذن. فقال صلى الله عليه وسلم \"ارجع فقل السلام عليكم أأدخل\" وذلك بعدما أسلم صفوان ورواه أبو داود والترمذي والنسائي من حديث ابن جريج به وقال الترمذي حسن غريب لا نعرفه إلا من حديثه وروى أبو داود حدثنا أبو بكر بن أبي شيبة حدثنا أبو الأحوص عن منصور عن ربعي قال أتي رجل من بني عامر استأذن على رسول الله صلى الله عليه وسلم وهو في بيته فقال أألج؟ فقال النبي صلى الله عليه وسلم لخادمه \"اخرج إلى هذا فعلمه الاستئذان فقل له: قل السلام عليكم أأدخل؟ فسمعه الرجل فقال: السلام عليكم أأدخل؟ فأذن له النبي صلى الله عليه وسلم فدخل. وقال هشيم أخبرنا منصور عن ابن سيرين وأخبرنا يونس بن عبيد عن عمرو بن سعيد الثقفي أن رجلا استأذن على النبي صلى الله عليه وسلم فقال أألج أو أنلج؟ فقال النبي صلى الله عليه وسلم لأمة له يقال لها روضة \"قومي إلى هذا فعلميه فإنه لا يحسن يستأذن فقولي له يقول السلام عليكم أأدخل؟ فسمعها الرجل فقال: السلام عليكم أأدخل؟ فقال \"ادخل\". وقال الترمذي حدثنا الفضل بن الصباح حدثنا سعيد بن زكريا عن عنبسة بن عبدالرحمن عن محمد بن زاذان عن محمد بن المنكدر عن جابر بن عبدالله قال: قال رسول الله صلى الله عليه وسلم \"السلام قبل الكلام\" ثم قال الترمذي: عنبسة ضعيف الحديث ذاهب ومحمد بن زاذان في إسناده نكارة وضعف وقال هشيم قال مغيرة قال مجاهد جاء ابن عمر من حاجة وقد أذاه الرمضاء فأتي فسطاط امرأة من قريش فقال السلام عليكم أأدخل؟ قالت: ادخل بسلام فأعاد فأعادت وهو يراوح بين قدميه قال قولي ادخل قالت ادخل فدخل. ولابن أبي حاتم حدثنا أبو سعيد الأشج حدثنا أبو نعيم الأحول حدثني خالد بن إياس حدثتني جدتي أم إياس قالت: كنت في أربع نسوة نستأذن على عائشة فقلن ندخل؟ فقالت لا قلن لصاحبتكن تستأذن فقالت السلام عليكم أندخل؟ قالت: ادخلوا ثم قالت: \"يا أيها الذين آمنوا لا تدخلوا بيوتا غير بيوتكم حتي تستأنسوا وتسلموا على أهلها\" الآية. وقال هشيم أخبرنا أشعث بن سوار عن كردوس عن ابن مسعود قال: عليكم أن تستأذنوا على أمهاتكم وأخواتكم وقال أشعث عن عدي بن ثابت إن امرأة من الأنصار قالت: يا رسول الله إني أكون في منزلي على الحال التي لا أحب أن يراني أحد عليها لا والد ولا ولد وإنه لا يزال يدخل علي رجل من أهلي وأنا علي تلك الحال. قال فنزلت \"يا أيها الذين آمنوا لا تدخلوا بيوتا\" الآية وقال ابن جريج سمعت عطاء بن أبي رباح يخبر عن ابن عباس رضي الله عنه قال: ثلاث آيات جحدهن الناس. قال الله تعالي: \"إن أكرمكم عند الله أتقاكم\" قال ويقولون: إن أكرمهم عند الله أعظمهم بيتا قال: والأدب كله قد جحده الناس قال قلت: أيستأذن علي أخواتي أيتام في حجري معي في بيت واحد؟ قال: نعم فرددت عليه ليرخص لي فأبي فقال: تحب أن تراها عريانه؟ قلت لا قال: فاستأذن قال فراجعته أيضا فقال: أتحب أن تطيع الله؟ قال قلت نعم قال فاستأذن. قال ابن جريج وأخبرني ابن. طاوس عن أبيه قال: ما من امرأة أكره إلى أن أرى عورتها من ذات محرم قال: وكان يشدد في ذلك وقال ابن جريج عن الزهري سمعت هزيل بن شرحبيل الأودي الأعمي أنه سمع ابن مسعود يقول عليكم الإذن علي أمهاتكم وقال ابن جريج قلت لعطاء أيستأذن الرجل على امرأته قال لا وهذا محمول علي عدم الوجوب وإلا فالأولى أن يعلمها بدخوله ولا يفاجئها به لاحتمال أن تكون على هيئة لا تحب أن يراها عليها. وقال أبو جعفر بن جرير حدثنا القاسم حدثنا الحسين حدثنا محمد بحازم بن الأعمش عن عمرو بن مرة عن يحيي ابن اجزار عن ابن أخي زينب امرأة عبدالله بن مسعود عن زينب رضي رضي الله عنها قالت: كان عبدالله إذا جاء من حاجة فانتهى إلى الباب تنحنح وبزق كراهة أن يهجم منا علي أمر يكرهه إسناده صحيح. وقال ابن أبي حاتم حدثنا أحمد بن سنان الواسطي حدثنا عبدالله بن نمير حدثنا الأعمش عن عمرو بن مرة عن أبي عبيدة قال كان عبدالله إذا دخل الدار استأنس تكلم ورفع صوته وقال مجاهد: \"حتي تستأنسوا\" قال: تنحنحوا أو تنخموا. وعن الإمام أحمد بن حنبل رحمه الله أنه قال: إذا دخل الرجل بيته استحب له أن يتنحنح أو يحرك نعليه ولهذا جاء في الصحيح عن رسول الله صلى الله عليه وسلم أنه نهي أن يطرق الرجل أهله طروقا وفي رواية ليلا يتخونهم وفي الحديث الآخر أن رسول الله صلى الله عليه وسلم قدم المدينة نهارا فأناخ بظاهرها وقال \"انتظروا حتى ندخل عشاء - يعني آخر النهار- حتى تمتشط الشعثة وتستحد المغيبة\" وقال ابن أبي حاتم حدثنا أبي حدثنا أبو بكر بن أبي شيبة حدثنا عبدالرحمن بن سليمان عن واصل بن السائب حدثني أبو ثورة ابن أخي أبي أيوب عن أبي أيوب قال: قلت يا رسول الله هذا السلام فما الاستئناس ؟ قال: \"يتكلم الرجل بتسبيحة أو تكبيرة أو تحميدة ويتنحنح فيؤذن أهل البيت\" هذا حديث غريب وقال قتادة في قوله: \"حتى تستأنسوا\" هو الاستئذان ثلاثا فمن لم يؤذن له منهم فليرجع أما الأولى فليسمع الحي وأما الثانية فليأخذوا حذرهم وأما الثالثة فإن شاءوا أذنوا وإن شاءوا ردوا ولا تقفن على باب قوم ردوك عن بابهم فإن للناس حاجات ولهم أشغال والله أولى بالعذر. وقال مقاتل بن حيان في قوله \"يا أيها الذين آمنوا لا تدخلوا بيوتا غير بيوتكم حتى تستأنسوا وتسلموا على أهلها\" كان الرجل في الجاهلية إذا لقي صاحبه لا يسلم عليه ويقول حييت صباحا وحييت مساء وكان ذلك تحية القوم بينهم وكان أحدهم ينطلق إلى صاحبه فلا يستأذن حتي يقتحم ويقول قد دخلت ونحو ذلك فيشق ذلك على الرجل ولعله يكون مع أهله فغير الله ذلك كله في ستر وعفة وجعله نقيا نزها من الدنس والقذر والدرن فقال تعالى \"يا أيها الذين آمنوا لا تدخلوا بيوتا غير بيوتكم حتي تستأنسوا وتسلموا على أهلها\" الآية وهذا الذي قاله مقاتل حسن ولهذا قال تعالي \"ذلكم خير لكم\" يعني الاستئذان خير لكم بمعني هو خير من الطرفين للمستأذن ولأهل البيت \"لعلكم تذكرون\"."
    },
    {
      "ayah": 28,
      "surah": 24,
      "text": "وذلك لما فيه من التصرف في ملك الغير بغير إذنه فإن شاء أذن وإن شاء لم يأذن \" وإن قيل لكم ارجعوا فارجعوا هو أزكى لكم \" أي إذا ردوكم من الباب قبل الإذن أو بعده \"فارجعوا هو أزكى لكم\" أي رجوعكم أزكى لكم وأطهر \"والله بما تعلمون عليم\" وقال قتادة: قال بعض المهاجرين لقد طلبت عمري كله هذه الآية فما أدركتها أن أستأذن على بعض إخواني فيقول لي ارجع فأرجع وأنا مغتبط \"وإن قيل لكم ارجعوا فارجعوا هو أزكى لكم والله بما تعملون عليم\" وقال سعيد بن جبير في الآية: أى لا تقفوا على أبواب الناس."
    },
    {
      "ayah": 29,
      "surah": 24,
      "text": "الآية الكريمة أخص من التي قبلها وذلك أنها تقتضي جواز الدخول إلى البيوت التي ليس فيها أحد إذا كان له متاع فيها بغير إذن كالبيت المعد للضيف إذا أذن له فيه أول مرة كفى. قال ابن جريج قال ابن عباس: \"لا تدخلوا بيوتا غير بيوتكم\" ثم نسخ واستثني فقال تعالى \"ليس عليكم جناح أن تدخلوا بيوتا غير مسكونه فيها متاع لكم\" وكذا روي عن عكرمة والحسن البصري وقال آخرون: هي بيوت التجار كالخانات ومنازل الأسفار وبيوت مكة وغير ذلك واختار ذلك ابن جرير وحكاه عن جماعة والأول أظهر والله أعلم وقال مالك عن زيد بن أسلم هي بيوت الشعر."
    },
    {
      "ayah": 3,
      "surah": 24,
      "text": "هذا خبر من الله تعالى بأن الزاني لا يطأ إلا زانية أو مشركة أي لا يطاوعه على مراده من الزنا إلا زانية عاصية أو مشركة لا ترى حرمة ذلك وكذلك \"الزانية لا ينكحها إلا زان\" أي عاص بزناه \"أو مشرك\" لا يعتقد تحريمه قال سفيان الثوري عن حبيب ابن أبي عمره عن سعيد بن جبير عن ابن عباس: \"الزاني لا ينكح إلا زانية أو مشركة\" قال ليس هذا بالنكاح إنما هو الجماع لا يزني بها إلا زان أو مشرك وهذا إسناد صحيح عنه وقد روي عنه من غير وجه أيضا وقد روي عن مجاهد وعكرمة وسعيد بن جبير وعروة بن الزبير والضحاك ومكحول ومقاتل ابن حيان وغير واحد نحو ذلك. وقوله تعالى \"وحرم ذلك على المؤمنين\" أي تعاطيه والتزويج بالبغايا أو تزويج العفائف بالرجال الفجار. وقال أبو داود الطيالسي حدثنا قيس عن أبي حصين عن سعيد بن جبير عن ابن عباس \"وحرم ذلك على المؤمنين\" قال: حرم الله الزنا على المؤمنين وقال قتادة ومقاتل بن حيان: حرم الله على المؤمنين نكاح البغايا وتقدم ذلك فقال \"وحرم ذلك على المؤمنين\" وهذه الآية كقوله تعالى \"محصنات غير مسافحات ولا متخذات أخدان\" وقوله \"محصنين غير مسافحين ولا متخذي أخدان\" الآية ومن ههنا ذهب الإمام أحمد بن حنبل رحمه الله إلى أنه لا يصح العقد من الرجل العفيف على المرأة البغي ما دامت كذلك حتى تستتاب فإن تابت صح العقد عليها وإلا فلا وكذلك لا يصح تزويج المرأة الحرة العفيفة بالرجل الفاجر المسافح حتى يتوب توبة صحيحة لقوله تعالى \"وحرم ذلك على المؤمنين\" وقال الإمام أحمد حدثنا عارم حدثنا معتمر بن سليمان قال: قال أبي حدثنا الحضرمي عن القاسم بن محمد عن عبدالله بن عمرو \"أن رجلا من المؤمنين استأذن رسول الله صلى الله عليه وسلم في امرأة يقال لها أم مهزول كانت تسافح وتشترط له أن تنفق عليه قال فاستأذن رسول الله صلى الله عليه وسلم أو ذكر له أمرها قال فقرأ عليه رسول الله صلى الله عليه وسلم \"الزاني لا ينكح إلا زانية أو مشركة والزانية لا ينكحها إلا زان أو مشرك وحرم ذلك على المؤمنين\" وقال النسائي أخبرنا عمرو بن عدي حدثنا المعتمر بن سليمان عن أبيه عن الحضرمي عن القاسم بن محمد عن عبدالله ابن عمرو قال: كانت امرأة يقال لها أم مهزول وكانت تسافح فأراد رجل من أصحاب رسول الله صلى الله عليه وسلم أن يتزوجها فأنزل الله عز وجل \"الزاني لا ينكح إلا زانية أو مشركة والزانية لا ينكحها إلا زان أو مشرك وحرم ذلك على المؤمنين\". قال الترمذي حدثنا عبد بن حميد حدثنا روح بن عبادة عن عبيدالله بن الأخنس أخبرني عمرو بن شعيب عن أبيه عن جده قال: كان رجل يقال له مرثد بن أبي مرثد وكان رجلا يحمل الأسرى من مكة حتى يأتي بهم المدينة قال وكانت امرأة بغي بمكة يقال لها عناق وكانت صديقة له وأنه واعد رجلا من أسارى مكة يحمله قال فجئت حتي انتهيت إلى ظل حائط من حوئط مكة في ليلة مقمرة قال: فجاءت عناق فأبصرت سواد ظل تحت الحائط فلما انتهيت إلى عرفتني فقالت: مرثد؟ فقلت: مرثد فقالت: مرحبا وأهلا هلم فبت عندنا الليلة. قال فقلت يا عناق حرم الله الزنا فقالت: يا أهل الخيام هذا الرجل يحمل أسراكم قال: فتبعني ثمانية ودخلت الحديقة فانتهيت إلى غار أو كهف فدخلت فيه فجاءوا حتى قاموا على رأسي فبالوا فظل بولهم على رأسي فأعماهم الله عني قال ثم رجعوا فرجعت إلى صاحبي فحملته وكان رجلا ثقيلا حتى انتهيت إلى الإذخر ففككت عنه أحبله فجعلت أحمله ويعينني حتى أتيت به المدينة فأتيت رسول الله صلى الله عليه وسلم فقلت يا رسول الله أنكح عناقا أنكح عناقا مرتين؟ فأمسك رسول الله صلى الله عليه وسلم فلم يرد علي شيئا حتى نزلت \"الزاني لا ينكح إلا زانية أو مشركة والزانية لا ينكحها إلا زان أو مشرك وحرم ذلك على المؤمنين\" فقال رسول الله صلى الله عليه وسلم: \"يا مرثد: الزاني لا ينكح إلا زانية أو مشركة فلا تنكحها\" ثم قال الترمذي هذا حديث حسن غريب لا نعرفه إلا من هذا الوجه وقد رواه أبو داود والنسائي في كتاب النكاح من سننهما من حديث عبيدالله بن الأخنس به وقال ابن أبي حاتم حدثنا أبي حدثنا مسدد أبو الحسن حدثنا عبد الوارث عن حبيب المعلم حدثني عمرو بن شعيب عن سعيد المقبري عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم \"لا ينكح الزاني المجلود إلا مثله\" وهكذا أخرجه أبو داود في سننه عن مسدد وأبى معمر عن عبدالله بن عمرو كلاهما عن عبد الوارث به. وقال الإمام أحمد حدثنا يعقوب حدثنا عاصم بن محمد بن زيد ابن عبدالله بن عمر بن الخطاب عن أخيه عمر بن محمد عن عبدالله بن يسار مولى ابن عمر قال: اشهد لسمعت سالما يقول: قال عبدالله: قال رسول الله صلى الله عليه وسلم \"ثلاثة لا يدخلون الجنة ولا ينظر الله إليهم يوم القيامة: العاق لوالديه والمرأة المترجلة المتشبهة بالرجال والديوث. وثلاثة لا ينظر الله إليهم يوم القيامة: العاق لوالديه ومدمن الخمر والمنان بما أعطى\" ورواه النسائي عن عمرو بن علي الفلاس عن يزيد بن زريع عن عمر بن محمد العمري عن عبدالله بن يسار به. وقال الإمام أحمد أيضا حدثنا يعقوب حدثنا أبي حدثنا الوليد بن كثير عن قطن ابن وهب عن عويمر بن الأجدع عمن حدثه عن سالم بن عبدالله بن عمر قال حدثني عبدالله بن عمر أن رسول الله صلى الله عليه وسلم قال: \"ثلاثة حرم الله عليهم الجنة مدمن الخمر والعاق لوالديه والذي يقر في أهله الخبث\" وقال أبو داود الطيالسي في مسنده حدثني شعبة حدثني رجل من آل سهل بن حنيف عن محمد بن عمار عن عمار بن ياسر قال: قال رسول الله صلى الله عليه وسلم: \"لا يدخل الجنة ديوث\" يستشهد به لما قبله من الأحاديث وقال ابن ماجه حدثنا هشام بن عمار حدثنا سلام بن سوار حدثنا كثير بن سليم عن الضحاك بن مزاحم سمعت أنس بن مالك يقول: سمعت رسول الله صلى الله عليه وسلم يقول: \"من أراد أن يلقى الله وهو طاهر متطهر فليتزوج الحرائر\" في إسناده ضعف. وقال الإمام أبو نصر إسماعيل بن حماد الجوهري في كتابه الصحاح في اللغة: الديوث القنزع وهو الذي لا غيرة له فأما الحديث الذي رواه الإمام أبو عبدالرحمن النسائي في كتاب النكاح من سننه: أخبرنا محمد بن إسماعيل بن علية عن يزيد ابن هارون عن حماد بن سلمة وغيره عن هارون بن رياب عن عبدالله بن عبيد بن عمير وعبد الكريم عن عبدالله ابن عبيد بن عمير عن ابن عباس عبد الكريم رفعه إلى ابن عباس وهارون لم يرفعه قالا جاء رجل إلى رسول الله صلى الله عليه وسلم فقال: إن عندي امرأة من أحب الناس إلي وهي لا تمنع يد لامس قال: \"طلقها\" قال: لا صبر لي عنها قال \"استمتع بها\" ثم قال النسائي هذا الحديث غير ثابت وعبد الكريم ليس بالقوي وهارون أثبت منه وقد أرسل الحديث وهو ثقة وحديثه أولى بالصواب من حديث عبد الكريم قلت وهو ابن أبي المخارق البصري المؤدب تابعى ضعيف الحديث وقد خالفه هارون بن رياب وهو تابعي ثقة من رجال مسلم فحديثه المرسل أولى كما قال النسائي لكن قد رواه النسائي في كتاب الطلاق عن إسحاق بن راهوية عن النضر بن شميل عن حماد بن سلمة عن هارون بن رياب عن عبدالله بن عبيد بن عمير عن ابن عباس مسندا فذكره بهذا الإسناد فرجاله على شرط مسلم إلا أن النسائي بعد روايته له قال: هذا خطأ والصواب مرسل. ورواه غير النضر على الصواب وقد رواه النسائي أيضا وأبو داود عن الحسين بن حريث أخبرنا الفضل بن موسى أخبرنا الحسين بن واقد عن عمارة بن أبي حفصة عن عكرمة عن ابن عباس عن النبي صلى الله عليه وسلم فذكره وهذا الإسناد جيد. وقد اختلف الناس في هذا الحديث ما بين مضعف له كما تقدم عن النسائي ومنكر كما قال الإمام أحمد: هو حديث منكر وقال ابن قتيبة: إنما أراد أنها سخية لا تمنع سائلا وحكاه النسائي في سننه عن بعضهم فقال: وقيل سخية تعطي ورد هذا بأنه لو كان المراد لقال لا ترد يد ملتمس وقيل: المراد إن سجيتها لا ترد يد لامس لا أن المراد أن هذا واقع منها وأنها تفعل الفاحشة فإن رسول الله صلى الله عليه وسلم لا يأذن في مصاحبة من هذه صفتها فإن زوجها والحالة هذه يكون ديوثا وقد تقدم الوعيد على ذلك ولكن لما كانت سجيتها هكذا ليس فيها ممانعة ولا مخالفة لمن أرادها لو خلا بها أحد أمره رسول صلى الله عليه وسلم بفراقها فلما ذكر أنه يحبها أباح له البقاء معها لأن محبته لها محققة ووقوع الفاحشة منها متوهم فلا يصار إلى الضرر العاجل لتوهم الآجل والله سبحانه وتعالى أعلم قالوا فأما إذا حصلت توبة فإنه يحل التزويج كما قال الإمام أبو محمد بن أبي حاتم رحمه الله حدثنا أبو سعيد الأشج حدثنا أبو خالد عن ابن أبي ذئب قال سمعت شعبة مولى ابن عباس \"رضي الله عنه قال سمعت ابن عباس وسأله رجل فقال له إني كنت ألم بامرأة آتي منها ما حرم الله عز وجل علي فرزق الله عز وجل من ذلك توبة فأردت أن أتزوجها فقال أناس: إن الزاني لا ينكح إلا زانية أو مشركة. فقال ابن عباس ليس هذا في هذا انكحها فما كان من إثم فعلي. وقد ادعى طائفة آخرون من العلماء أن هذه الآية منسوخة قال ابن أبي حاتم حدثنا أبو سعيد الأشج حدثنا أبو خالد عن يحيي بن سعيد عن سعيد بن المسيب قال ذكر عنده \"الزاني لا ينكح إلا زانية أو مشركة والزانية لا ينكحها إلا زان أو مشرك\" قال كان يقال نسختها التي بعدها \"وأنكحوا الأيامي\" منكم قال كان يقال الأيامي من المسلمين وهكذا رواه أبو عبيد القاسم بن سلام في كتاب الناسخ والمنسوخ له عن سعيد بن المسيب ونص على ذلك أيضا الإمام أبو عبدالله محمد بن إدريس الشافعي."
    },
    {
      "ayah": 30,
      "surah": 24,
      "text": "هذا أمر من الله تعالى لعباده المؤمنين أن يغضوا من أبصارهم عما حرم عليهم فلا ينظروا إلا إلى ما أباح لهم النظر إليه وأن يغمضوا أبصارهم عن المحارم فإن اتفق أن وقع البصر على محرم من غير قصد فليصرف بصره عنه سريعا كما رواه مسلم في صحيحه من حديث يونس بن عبيد عن عمرو بن سعيد عن أبي زرعة بن عمرو بن جرير عن جده جرير بن عبدالله البجلي رضي الله عنه قال: سألت النبي صلى الله عليه وسلم عن نظرة الفجأة فأمرني أن أصرف بصري. وكذا رواه الامام أحمد عن هشيم عن يونس بن عبيد به ورواه أبو داود والترمذي والنسائي من حديثه أيضا وقال الترمذي حسن صحيح وفي رواية لبعضهم فقال \"أطرق بصرك\" يعنى انظر إلى الأرض والصرف أعم فإنه قد يكون إلى الأرض وإلى جهة أخرى والله أعلم. وقال أبو داود حدثنا إسماعيل بن موسى الفزاري حدثنا شريك عن أبي ربيعة الأيادي عن عبدالله بن بريدة عن أبيه قال: قال رسول الله صلى الله عليه وسلم لعلى \"يا علي لا تتبع النظرة النظرة فإن لك الأولى وليس لك الآخرة\" ورواه الترمذي من حديث شريك وقال: غريب لا نعرفه إلا من حديثه وفي الصحيح عن أبي سعيد قال: قال رسول الله صلى الله عليه وسلم: \"إياكم والجلوس على الطرقات\" قالوا يا رسول الله لا بد لنا من مجالسنا نتحدث فيها فقال رسول الله صلى الله عليه وسلم \"إن أبيتم فأعطوا الطريق حقه\". قالوا وما حق الطريق يا رسول الله؟ - قال: \"غض البصر وكف الأذى ورد السلام والأمر بالمعروف والنهي عن المنكر\" وقال أبو القاسم البغوي حدثنا طالوت بن عباد حدثنا فضيل بن حسين سمعت أبا أمامة يقول سمعت رسول الله صلى الله عليه وسلم يقول: \"اكفلوا لي بست أكفل لكم بالجنة إذا حدث أحدكم فلا يكذب وإذا أؤتمن فلا يخن وإذا وعد فلا يخلف وغضوا أبصاركم وكفوا أيديكم واحفظوا فروجكم\". وفي صحيح البخاري \"من يكفل لي ما بين لحييه وما بين رجليه أكفل له الجنة\" وقال عبد الرزاق أنبأنا معمر عن أيوب عن ابن سيرين عن عبيدة قال: كل ما عصي الله به فهو كبيرة وقد ذكر الطرفين فقال \"قل للمؤمنين يغضوا من أبصارهم\" ولما كان النظر داعية إلى فساد القلب كما قال بعض السلف: النظر سهم سم إلى القلب. ولذلك أمر الله بحفظ الفروج كما أمر بحفظ الأبصار التي هي بواعث إلى ذلك فقال تعالي \" قل للمؤمنين يغضوا من أبصارهم ويحفظوا فروجهم\" وحفظ الفرج تارة يكون بمنعه من الزنا كما قال تعالى \"والذين هم لفروجهم حافظون\" الآية وتارة يكون بحفظه من النظر إليه كما جاء في الحديث في مسند أحمد والسنن \"احفظ عورتك إلا من زوجتك أو ما ملكت يمينك\" \"ذلك أزكى لهم\" أي أطهر لقلوبهم واتقى لدينهم كما قيل من حفظ بصره أورثه الله نورا في بصيرته ويروي فى قلبه. وروى الإمام أحمد حدثنا عتاب حدثنا عبدالله بن المبارك أخبرنا يحيي بن أيوب عن عبيد الله بن زحر عن على بن زيد عن القاسم عن أبي أمامة \" عن النبي صلى الله عليه وسلم قال: \"ما من مسلم ينظر إلى محاسن امرأة ثم يغض بصره إلا أخلف الله له عبادة يجد حلاوتها\" وروي هذا مرفوعا عن ابن عمر وحذيفة وعائشة رضي الله عنهم ولكن في أسانيدها ضعف إلا أنها في الترغيب ومثله يتسامح فيه وفي الطبراني من طريق عبيد الله بن يزيد عن علي بن يزيد عن القاسم عن أبي أمامة مرفوعا \"لتغضن أبصاركم ولتحفظن فروجكم ولتقيمن وجوهكم أو لتكسفن وجوهكم\" وقال الطبراني: حدثنا أحمد بن زهير التستري قال: قرأنا على محمد بن حفص بن عمر الضرير المقري حدثنا يحيي بن أبي بكير حدثنا هريم بن سفيان عن عبدالرحمن بن إسحاق عن القاسم بن عبدالرحمن عن أبيه عن عبدالله بن مسعود \" قال: قال رسول الله صلى الله عليه وسلم \"إن النظر سهم من سهام إبليس مسموم من تركها مخافتي أبدلته إيمانا يجد حلاوتها في قلبه\" وقوله تعالى \"إن الله خبير بما يصنعون\" كما قال تعالى \"يعلم خائنة الأعين وما تخفي الصدور\" وفى الصحيح عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: \"كتب على ابن آدم حظه من الزنا أدرك ذلك لا محالة فزنا العينين النظر وزنا اللسان النطق وزنا الأذنين الاستماع وزنا اليدين البطش وزنا الرجلين الخطى والنفس تمني وتشتهي والفرج يصدق ذلك أو يكذبه\" رواه البخاري تعليقا ومسلم مسندا من وجه آخر بنحو ما ذكر. وقد قال كثير من السلف إنهم كانوا ينهون أن يحد الرجل نظره إلى الأمرد وقد شدد كثير من أئمة الصوفية في ذلك وحرمه طائفة من أهل العلم لما فيه من الافتتان وشدد آخرون في ذلك كثيرا جدا. وقال ابن أبي الدنيا حدثنا أبو سعيد المدني حدثنا عمر بن سهل المازني حدثني عمر بن محمد بن صهبان عن صفوان بن سليم عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: \"كل عين باكية يوم القيامة إلا عينا غضت عن محارم الله وعينا سهرت فى سبيل الله وعينا يخرج منها مثل رأس الذباب من خشية الله عز وجل\"."
    },
    {
      "ayah": 31,
      "surah": 24,
      "text": "هذا أمر من الله تعالى للنساء المؤمنات وغيرة منه لأزواجهن عباده المؤمنين وتمييز لهن عن صفة نساء الجاهلية وفعال المشركات. وكان سبب نزول هذه الآية ما ذكره مقاتل بن حيان قال: بلغنا والله أعلم أن جابر بن عبدالله الأنصاري حدث أن أسماء بنت مرثد كان في محل لها في بنى حارثه فجعل النساء يدخلن عليها غير متزرات فيبدو ما في أرجلهن من الخلاخل وتبدو صدورهن وذوائبهن فقالت أسماء: ما أقبح هذا فأنزل الله تعالى \"وقل للمؤمنات يغضضن من أبصارهن\" الآية فقوله تعالى \"وقل للمؤمنات يغضضن من أبصارهن\" أي عما حرم الله عليهن من النظر إلى غير أزواجهن ولهذا ذهب كثير من العلماء إلى أنه لا يجوز للمرأة النظر إلى الرجال الأجانب بشهوة ولا بغير شهوة أصلا واحتج كثير منهم بما رواه أبو داود والترمذي من حديث الزهري عن نبهان مولى أم سلمة أنه حدثه أن أم سلمة حدثته أنها كانت عند رسول الله صلى الله عليه وسلم وميمونه قالت: فبينما نحن عنده أقبل ابن أم مكتوم فدخل عليه وذلك بعدما أمرنا بالحجاب فقال رسول الله \"احتجبا منه\" فقلت يا رسول الله أليس هو أعمى لا يبصرنا ولا يعرفنا؟ فقال رسول الله صلى الله عليه وسلم: \"أوعمياوان أنتما؟ أو ألستما تبصرانه؟ \" ثم قال الترمذي هذا حديث حسن صحيح وذهب آخرون من العلماء إلي جواز نظرهن إلى الأجانب بغير شهوة كما ثبت في الصحيح أن رسول الله صلى الله عليه وسلم جعل ينظر إلى الحبشة وهم يلعبون بحرابهم يوم العيد في المسجد وعائشة أم المؤمنين تنظر إليهم من ورائه وهو يسترها منهم حتى ملت ورجعت وقوله \"ويحفظن فروجهن\" قال سعيد بن جبير: عن الفواحش وقال قتادة وسفيان: عما لا يحل لهن وقال مقاتل: عن الزنا وقال أبو العالية: كل آية نزلت في القرآن يذكر فيها حفظ الفروج فهو من الزنا إلا هذه الآية \"ويحفظن فروجهن\" أن لا يراها أحد وقوله تعالى \"ولا يبدين زينتهن إلا ما ظهر منها\" أي لا يظهرن شيئا من الزينة للأجانب إلا ما لا يمكن إخفاؤه قال ابن مسعود: كالرداء والثياب يعني على ما كان يتعاطاه نساء العرب من المقنعة التي تجلل ثيابها وما يبدو من أسافل الثياب فلا حرج عليها فيه لأن هذا لا يمكنها إخفاؤه ونظيره في زي النساء ما يظهر من إزارها وما لا يمكن إخفاؤه وقال بقول ابن مسعود الحسن وابن سيرين وأبو الجوزاء وإبراهيم النخعي وغيرهم وقال الأعمش عن سعيد بن جبير عن ابن عباس: \"ولا يبدين زينتهن إلا ما ظهر منها\" قال: وجهها وكفيها والخاتم. وروى عن ابن عمر وعطاء وعكرمة وسعيد بن جبير وأبي الشعثاء والضحاك وإبراهيم النخعي وغيره نحو ذلك وهذا يحتمل أن يكون تفسيرا للزينة التي نهين عن إبدائها كما قال أبو إسحاق السبيعي عن أبي الأحوص عن عبدالله قال في قوله \"ولا يبدين زينتهن\" الزينة القرط والدملوج والخلخال والقلادة وفي رواية عنه بهذا الإسناد قال: الزينة زينتان فزينة لا يراها إلا الزوج: الخاتم والسوار وزينة يراها الأجانب وهي الظاهر من الثياب وقال الزهري: لا يبدين لهؤلاء الذين سمى الله ممن لا يحل له إلا الأسورة والأخمرة والأقرطة من غير حسر وأما عامة الناس فلا يبدو منها إلا الخواتم وقال مالك عن الزهري \"إلا ما ظهر منها\": الخاتم والخلخال ويحتمل أن ابن عباس ومن تابعه أرادوا تفسير ما ظهر منها بالوجه والكفين وهذا هو المشهور عند الجمهور ويستأنس له بالحديث الذي رواه أبو داود في سننه حدثنا يعقوب بن كعب الأنطاكي ومؤمل بن الفضل الحراني قالا: حدثنا الوليد عن سعيد بن بشير عن قتادة عن خالد بن دريك عن عائشة رضي الله عنها أن أسماء بنت أبي بكر دخلت على النبي صلى الله عليه وسلم وعليها ثياب رقاق فأعرض عنها وقال: \"يا أسماء إن المرأة إذا بلغت المحيض لم يصلح أن يرى منها إلا هذا\" وأشار إلى وجهه وكفيه لكن قال أبو داود وأبو حاتم الرازي هو مرسل. خالد بن دريك لم يسمع من عائشة رضي الله عنها والله أعلم. وقوله تعالى \"وليضربن بخمرهن على جيوبهن\" يعني المقانع يعمل لها صفات ضاربات على صدورهن لتواري ما تحتها من صدرها وترائبها ليخالفن شعار نساء أهل الجاهلية فإنهن لم يكن يفعلن ذلك بل كانت المرأة منهن تمر بين الرجال مسفحة بصدرها لا يواريه شيء وربما أظهرت عنقها وذوائب شعرها وأقرطة آذانها فأمر الله المؤمنات أن يستترن في هيئاتهن وأحوالهن كما قال تعالى \"يا أيها النبي قل لأزواجك وبناتك ونساء المؤمنين يدنين عليهن من جلابيبهن ذلك أدنى أن يعرفن فلا يؤذين\" وقال في هذه الآية الكريمة \"وليضربن بخمرهن على جيوبهن\" والخمر جمع خمار وهو ما يخمر به أي يغطي به الرأس وهي التي تسميها الناس المقانع. قال سعيد بن جبير \"وليضربن\" وليشددن \"بخمرهن على جيوبهن\" يعني على النحر والصدر فلا يرى منه شيء وقال البخاري حدثنا أحمد بن شبيب حدثنا أبى عن يونس عن ابن شهاب عن عروة عن عائشة رضي الله عنها قالت: يرحم الله نساء المهاجرات الأول لما أنزل الله \"وليضربن بخمرهن علي جيوبهن\" شققن مروطهن فاختمرن بها. وقال أيضا حدثنا أبو نعيم حدثنا إبراهيم بن نافع عن الحسن بن مسلم عن صفية بنت شيبة أن عائشة رضي الله عنها كانت تقول: لما نزلت هذه الآية \"وليضربن بخمرهن على جيوبهن\" أخذن أزرهن فشققنها من قبل الحواشي فاختمرن بها وقال ابن أبي حاتم حدثنا أبي حدثنا أحمد بن عبدالله بن يونس حدثني الزنجي بن خالد حدثنا عبدالله بن عثمان بن خثيم عن صفية بنت شيبة قالت: بينا نحن عند عائشة قالت فذكرن نساء قريش وفضلهن فقالت عائشة رضي الله عنها إن لنساء قريش لفضلا وإني والله ما رأيت أفضل من نساء الأنصار أشد تصديقا لكتاب الله ولا إيمانا بالتنزيل لقد أنزلت سورة النور \"وليضربن بخمرهن على جيوبهن\" انقلب رجالهن إليهن يتلون عليهن ما أنزل الله إليهم فيها ويتلو الرجل على امرأته وابنته وأخته وعلى كل ذي قرابته فما منهن امرأة إلا قامت إلى مرطها المرحل فاعتجرت به تصديقا وإيمانا بما أنزل الله من كتابه فأصبحن وراء رسول الله صلى الله عليه وسلم معتجرات كأن على رءوسهن الغربان. ورواه أبو داود من غير وجه عن صفية بن شيبة به قال ابن جرير حدثنا يونس أخبرنا ابن وهب أن قرة بن عبدالرحمن أخبره عن ابن شهاب عن عروة عن عائشة قالت: يرحم الله النساء المهاجرات الأول لما أنزل الله \"وليضربن بخمرهن على جيوبهن \"شققن أكتف مروطهن فاختمرن بها. ورواه أبو داود من حديث ابن وهب به وقوله تعالى \"ولا يبدين زينتهن إلا لبعولتهن\" أي أزواجهن \"أو آبائهن أو آباء بعولتهن أو أبنائهن أو أبناء بعولتهن أو إخوانهن أو بني إخوانهن أو بني أخواتهن\" كل هؤلاء محارم للمرأة يجوز لها أن تظهر عليهم بزينتها ولكن من غير تبرج وقد روى ابن المنذر حدثنا موسي يعني ابن هارون حدثنا أبو بكر يعني ابن أبي شيبة حدثنا عفان حدثنا حماد بن سلمة أخبرنا داود عن الشعبي وعكرمة في هذه الآية \"ولا يبدين زينتهن إلا لبعولتهن أو آبائهن أو آباء بعولتهن\" حتى فرغ منها وقال لم يذكر العم ولا الخال لأنهما ينعتان لأبنائهما ولا تضع خمارها عند العم والخال فأما الزوج فإنما ذلك كله من أجله فتتصنع له بما لا يكون بحضرة غيره. وقوله \"أو نسائهن\" يعني تظهر بزينتها أيضا للنساء المسلمات دون نساء أهل الذمة لئلا تصفهن لرجالهن وذلك وإن كان محذورا في جميع النساء إلا أنه في نساء أهل الذمة أشد فإنهن لا يمنعهن من ذلك مانع فأما المسلمة فإنها تعلم أن ذلك حرام فتنزجر عنه وقد قال رسول الله صلى الله عليه وسلم \"لا تباشر المرأة المرأة تنعتها لزوجها كأنه ينظر إليها\" أخرجاه فى الصحيحين عن ابن مسعود وروي سعيد بن منصور في سننه حدثنا إسماعيل بن عياش عن هشام بن الغازي عن عبادة بن نسي عن أبيه عن الحارث بن قيس أن عمر بن الخطاب كتب إلى أبي عبيدة: أما بعد فإنه بلغني أن نساء من نساء المسلمين يدخلن الحمامات مع نساء أهل الشرك فإنه من قبلك فلا يحل لامرأة تؤمن بالله واليوم الآخر أن ينظر إلي عورتها إلا أهل ملتها. وقال مجاهد في قوله \"أو نسائهن\" قال: نساؤهن المسلمات ليس المشركات من نسائهن وليس للمرأة المسلمة أن تنكشف بين يدي مشركة وروى عبدالله في تفسيره عن الكلبي عن أبي صالح عن ابن عباس \"أو نسائهن\" قال: هن المسلمات لا تبديه ليهودية ولا نصرانية وهو النحر والقرط والوشاح وما لا يحل أن يراه إلا محرم وروى سعيد حدثنا جرير عن ليث عن مجاهد قال: لا تضع المسلمة خمارها عند مشركة لأن الله تعالى يقول \"أو نسائهن\" فليست من نسائهن وعن مكحول وعبادة بن نسي أنهما كرها أن تقبل النصرانية واليهودية والمجوسية المسلمة فأما ما رواه ابن أبي حاتم حدثنا علي بن الحسين حدثنا أبو عمير حدثنا ضمرة قال: قال ابن عطاء عن أبيه قال: لما قدم أصحاب رسول الله صلى الله عليه وسلم بيت المقدس كان قوابل نسائهن اليهوديات والنصرانيات فهذا إن صح فمحمول على حال الضرورة أو أن ذلك من باب الامتهان ثم إنه ليس فيه كشف عورة ولا بد والله أعلم. وقوله تعالى: \"أو ما ملكت أيمانهن\" قال ابن جرير: يعني من نساء المشركين فيجوز لها أن تظهر زينتها لها وإن كانت مشركة لأنها أمتها وإليه ذهب سعيد بن المسيب وقال الأكثرون: بل يجوز لها أن تظهر على رقيقها من الرجال والنساء واستدلوا بالحديث الذي رواه أبو داود ثنا محمد بن عيسي حدثنا أبو جميع سالم بن دينار عن ثابت عن أنس أن النبي صلى الله عليه وسلم أتي فاطمة بعبد قد وهبه لها قال وعلى فاطمة ثوب إذا قنعت به رأسها لم يبلغ رجليها وإذا غطت به رجليها لم يبلغ رأسها فلما رأى النبي صلى الله عليه وسلم ما تلقى قال: \"إنه ليس عليك بأس إنما هو أبوك وغلامك\". وقد ذكر الحافظ ابن عساكر في تاريخه في ترجمة خديج الحمصي مولى معاوية أن عبدالله بن مسعدة الفزاري كان أسود شديد الأدمة وأنه قد كان النبي صلى الله عليه وسلم وهبه لابنته فاطمة فربته ثم أعتقته ثم قد كان بعد ذلك كله برز مع معاوية أيام صفين وكان من أشد الناس على علي بن أبي طالب رضي الله عنه وروى الإمام أحمد حدثنا سفيان بن عيينة عن الزهري عن نبهان عن أم سلمة ذكرت أن رسول الله صلى الله عليه وسلم قال: \"إذا كان لإحداكن مكاتب وكان له ما يؤدي فلتحتجب منه\" ورواه أبو داود عن مسدد عن سفيان به وقوله تعالى \"أو التابعين غير أولي الإربة من الرجال\" يعني كالأجراء والأتباع الذين ليسوا بأكفاء وهم مع ذلك فى عقولهم وله وحَوْب ولا همة لهم إلى النساء ولا يشتهونهن. قال ابن عباس: هو المغفل الذي لا شهوة له. وقال مجاهد: هو الأبله وقال عكرمة: هو المخنث الذي لا يقوم ذكره وكذلك قال غير واحد من السلف وفي الصحيح من حديث الزهري عن عروة عن عائشة أن مخنثا كان يدخل على أهل رسول الله صلى الله عليه وسلم وكانوا يعدونه من غير أولي الإربة فدخل النبي صلى الله عليه وسلم وهو ينعت امرأة يقول إنها إذا أقبلت أقبلت بأربع وإذا أدبرت أدبرت بثمان فقال رسول الله صلى الله عليه وسلم \"ألا أرى هذا يعلم ما ههنا لا يدخلن عليكم\" فأخرجه فكان بالبيداء يدخل يوم كل جمعة ليستطعم. وروى الإمام أحمد حدثنا أبو معاوية حدثنا هشام بن عروة عن أبيه عن زينب بنت أبي سلمه عن أم سلمة أنها قالت: دخل عليها رسول الله صلى الله عليه وسلم وعندها مخنث وعندها عبدالله بن أبي أمية يعني أخاها والمخنث يقول: يا عبدالله إن فتح الله عليكم الطائف غدا فعليك بابنة غيلان فإنها تقبل بأربع وتدبر بثمان قال فسمعه رسول الله صلى الله عليه وسلم فقال لأم سلمة: \"لا يدخلن هذا عليك\" أخرجاه في الصحيحين من حديث هشام ابن عروة. وقال الإمام أحمد حدثنا عبد الرزاق حدثنا معمر عن الزهري عن عروة بن الزبير عن عائشة رضي الله عنها قالت: كان رجل يدخل على أزواج النبي صلى الله عليه وسلم مخنث وكانوا يعدونه من غير أولي الإربة فدخل النبي صلى الله عليه وسلم وهو عند بعض نسائه وهو ينعت امرأة فقال إنها إذا أقبلت أقبلت بأربع وإذا أدبرت أدبرت بثمان فقال النبي صلى الله عليه وسلم \"ألا أرى هذا يعلم ما ههنا لا يدخلن عليكم هذا\" فحجبوه ورواه مسلم وأبو داود والنسائي من طريق عبد الرزاق به عن أم سلمة وقوله تعالى \" أو الطفل الذين لم يظهروا على عورات النساء \" يعني لصغرهم لا يفهمون أحوال النساء وعوراتهن من كلامهم الرحيم وتعطفهن في المشية وحركاتهن وسكناتهن فإذا كان الطفل صغيرا لا يفهم ذلك فلا بأس بدخوله على النساء فأما إن كان مراهقا أو قريبا منه بحيث يعرف ذلك ويدريه ويفرق بين الشوهاء والحسناء فلا يمكن من الدخول على النساء وقد ثبت في الصحيحين عن رسول الله صلى الله عليه وسلم أنه قال: \"إياكم والدخول على النساء\" قيل يا رسول الله أفرأيت الحمو؟ قال: \"الحمو الموت\" وقوله تعالى \"ولا يضربن بأرجلهن\" الآية كانت المرأة في الجاهلية إذا كانت تمشي في الطريق وفي رجلها خلخال صامت لا يعلم صوته ضربت برجلها الأرض فيسمع الرجال طنينه فنهى الله المؤمنات عن مثل ذلك وكذلك إذا كان شيء من زينتها مستورا فتحركت بحركة لتظهر ما هو خفي دخل في هذا النهى لقوله تعالى \"ولا يضربن بأرجلهن\" إلى آخره. ومن ذلك أنها تنتهي عن التعطر والتطيب عند خروجها من بيتها فيشم الرجال طيبها فقد قال أبو عيسي الترمذي حدثنا محمد بن بشار حدثنا يحيي بن سعيد القطان عن ثابت بن عمارة الحنفي عن غنيم بن قيس عن أبي موسى رضي الله عنه عن النبي صلى الله عليه وسلم أنه قال: \"كل عين زانية والمرأة إذا استعطرت فمرت بالمجلس فهي كذا وكذا\" يعني زانية وفي الباب عن أبي هريرة وهذا حسن صحيح ورواه أبو داود والنسائي من حديث ثابت بن عمارة به. وقال أبو داود حدثنا محمد بن كثير أخبرنا سفيان عن عاصم بن عبيد الله عن عبيد مولى أبي رهم عن أبي هريرة رضي الله عنه قال: لقيته امرأة شم منها ريح الطيب ولذيلها إعصار فقال يا أمية الجبار جئت من المسجد؟ قالت نعم قال لها: تطيبت؟ قالت نعم قال: إني سمعت حبي أبا القاسم صلى الله عليه وسلم يقول \"لا يقبل الله صلاة امرأة طيبت لهذا المسجد حتى ترجع فتغسل غسلها من الجنابة\" ورواه ابن ماجه عن أبى بكر بن أبي شيبة عن سفيان هو ابن عيينة به. وروى الترمذي أيضا من حديث موسى بن عبيدة عن أيوب بن خالد عن ميمونه بنت سعد أن رسول الله صلى الله عليه وسلم قال: \"الرافلة في الزينة في غير أهلها كمثل ظلمة يوم القيامة لا نور لها\" ومن ذلك أيضا أنهن ينهين عن المشي في وسط الطريق لما فيه من التبرج. قال أبو داود حدثنا التغلبي حدثنا عبد العزيز يعني ابن محمد عن ابن أبي اليمان عن شداد بن أبي عمرو بن حماس عن أبيه عن حمزة بن أبي أسيد الأنصاري عن أبيه أنه سمع النبي صلى الله عليه وسلم وهو خارج من المسجد وقد اختلط الرجل مع النساء في الطريق فقال رسول الله للنساء \"استأخرن فإنه ليس لكن أن تحتضن الطريق عليكن بحافات الطريق\" فكانت المرأة تلصق بالجدار حتى إن ثوبها ليتعلق بالجدار من لصوقها به. وقوله تعالى \"وتوبوا إلى الله جميعا أيها المؤمنون لعلكم تفلحون\" أي افعلوا ما آمركم به من هذه الصفات الجميلة والأخلاق الجليلة واتركوا ما كان عليه أهل الجاهلية من الأخلاق والصفات الرذيلة فإن الفلاح كل الفلاح في فعل ما أمر الله به ورسوله وترك ما نهيا عنه والله تعالى هو المستعان."
    },
    {
      "ayah": 32,
      "surah": 24,
      "text": "اشتملت هذه الآيات الكريمات المبينة على جمل من الأحكام المحكمة والأوامر المبرمة فقوله تعالى \"وأنكحوا الأيامي منكم\" إلى آخره هذا أمر بالتزويج. وقد ذهب طائفة من العلماء إلى وجوبه على كل من قدر عليه واحتجوا بظاهر قوله \"عليه السلام \"يا معشر الشباب من استطاع منكم الباءة فليتزوج فإنه أغض للبصر وأحصن للفرج ومن لم يستطع فعليه بالصوم فإنه له وجاء\" أخرجاه في الصحيحين من حديث ابن مسعود وقد جاء في السنن من غير وجه أن رسول الله صلى الله عليه وسلم قال: \"تزوجوا الولود تناسلوا فإني مباه بكم الأمم يوم القيامة\" وفي رواية \"حتى بالسقط\" الأيامي جمع أيم ويقال ذلك للمرأة التي لا زوج لها وللرجل الذي لا زوجة له وسواء كان قد تزوج ثم فارق أو لم يتزوج واحد منهما حكاه الجوهري عن أهل اللغة يقال رجل أيم وامرأة أيم. وقوله تعالى \"إن يكونوا فقراء يغنهم الله من فضله\" الآية قال علي بن أبي طلحة عن ابن عباس رغبهم الله في التزويج وأمر به الأحرار والعبيد ووعدهم عليه الغنى فقال: \"إن يكونوا فقراء يغنهم الله من فضله\" وقال ابن أبي حاتم حدثنا أبي حدثنا محمود بن خالد الأزرق حدثنا عمر بن عبد الواحد عن سعيد - يعني ابن عبد العزيز- قال بلغني أن أبا بكر الصديق رضي الله عنه قال: أطيعوا الله فيما أمركم به من النكاح ينجز لكم ما وعدكم من الغنى قال تعالى: \"إن يكونوا فقراء يغنهم الله من فضله\" وعن ابن مسعود التمسوا الغنى في النكاح. يقول الله تعالى \"إن يكونوا فقراء يغنهم الله من فضله\" رواه ابن جرير وذكر البغوي عن عمر نحوه. وعن الليث عن محمد بن عجلان عن سعيد المقبري عن أبى هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم \"ثلاثة حق على الله عونهم الناكح يريد العفاف والمكاتب يريد الأداء والغازي في سبيل الله\" رواه الإمام أحمد والترمذي والنسائي وابن ماجه وقد زوج النبي صلى الله عليه وسلم ذلك الرجل الذي لم يجد عليه إلا إزاره ولم يقدر على خاتم من حديد ومع هذا فزوجه بتلك المرأة وجعل صداقها عليه أن يعلمها ما معه من القرآن. والمعهود من كرم الله تعالى ولطفه أن يرزقه ما فيه كفاية لها وله وأما ما يورده كثير من الناس على أنه حديث \"تزوجوا فقراء يغنكم الله\" فلا أصل له ولم أره بإسناد قوي ولا ضعيف إلى الآن وفي القرآن غنية عنه وكذا هذه الأحاديث التي أوردناها ولله الحمد والمنة."
    },
    {
      "ayah": 33,
      "surah": 24,
      "text": "هذا أمر من الله تعالى لمن لا يجد تزويجا بالتعفف عن الحرام كما قال صلى الله عليه وسلم \"يا معشر الشباب من استطاع منكم الباءة فليتزوج فإنه أغض للبصر وأحصن للفرج ومن لم يستطع فعليه بالصوم فإنه له وجاء\" الحديث وهذه الآية مطلقة والتي في سورة النساء أخص منها وهي قوله \"ومن لم يستطع منكم طولا أن ينكح المحصنات - إلى قوله - وأن تصبروا خير لكم\" أي صبركم عن تزوج الإماء خير لكم لأن الولد يجىء رقيقا \"والله غفور رحيم\" قال عكرمة في قوله \"وليستعفف الذين لا يجدون نكاحا\" قال: هو الرجل يرى المرأة فكأنه يشتهي فإن كانت له امرأة فليذهب إليها وليقض حاجته منها وإن لم يكن له امرأة فلينظر في ملكوت السموات والأرض حتى يغنيه الله. وقوله تعالى \"والذين يبتغون الكتاب مما ملكت أيمانكم فكاتبوهم إن علمتم فيهم خيرا\" هذا أمر من الله تعالى للسادة إذا طلب عبيدهم منهم الكتابة أن يكاتبوهم بشرط أن يكون للعبد حيلة وكسب يؤدي إلى سيده المال الذي شارطه على أدائه وقد ذهب كثير من العلماء إلى أن هذا الأمر أمر إرشاد واستحباب لا أمر تحتم وإيجاب بل السيد مخير إذا طلب منه عبده الكتابة إن شاء كاتبه وإن شاء لم يكاتبه قال الثوري عن جابر عن الشعبي إن شاء كاتبه وإن شاء لم يكاتبه وكذا روى ابن وهب عن إسماعيل بن عياش عن رجل عن عطاء بن أبي رباح إن يشأ كاتبه وإن يشأ لم يكاتبه وكذا قال مقاتل ابن حيان والحسن البصري وذهب آخرون إلى أنه يجب على السيد إذا طلب منه عبده ذلك أن يجيبه إلى ما طلب أخذأ بظاهر هذا الأمر. وقال البخاري وقال روح عن ابن جريج قلت لعطاء أواجب علي إذا علمت له مالا أن أكاتبه؟ قال ما أراه إلا واجبا وقال عمرو بن دينار قلت لعطاء أتأثره عن أحد؟ قال لا ثم أخبرني أن موسي ابن أنس أخبره أن سيرين سأل أنسا المكاتبة وكان كثير المال فأبي فانطلق إلى عمر رضي الله عنه فقال: كاتبه فأبي فضربه بالدرة ويتلو عمر رضي الله عنه \"فكاتبوهم إن علمتم فيهم خيرا\" فكاتبه هكذا ذكره البخاري معلقا ورواه عبد الرزاق أخبرنا ابن جريج قال قلت لعطاء: أواجب علي إذا علمت له مالا أن أكاتبه؟ قال ما أراه إلا واجبا. وقال ابن جرير حدثنا محمد بن بشار حدثنا محمد بن بكر حدثنا سعيد عن قتادة عن أنس بن مالك أن سيرين أراد أن يكاتبه فتلكأ عليه فقال له عمر: لتكاتبنه إسناد صحيح وروى سعيد بن منصور حدثنا هشيم بن جويبر عن الضحاك قال: هي عزمة وهذا هو القول القديم من قولي الشافعي وذهب في الجديد إلى أنه لا يجب لقوله عليه السلام \"لا يحل مال امرئ مسلم إلا بطيب نفس\" وقال ابن وهب قال مالك: الأمر عندنا أنه ليس على سيد العبد أن يكاتبه إذا سأله ذلك ولم أسمع أحدا من الأئمة أكره أحدا على أن يكاتب عبده قال مالك وإنما ذلك أمر من الله تعالى وإذن منه للناس وليس بواجب وكذا قال الثوري وأبو حنيفة وعبدالرحمن بن زيد بن أسلم وغيرهم واختار ابن جرير قول الوجوب لظاهر الآية وقوله تعالى \"إن علمتم فيهم خيرا\" قال بعضهم: أمانه وقال بعضهم: صدقا وقال بعضهم: مالا وقال بعضهم: حيلة وكسبا وروى أبو داود في المراسيل عن يحيي بن أبي كثير قال: قال رسول الله صلى الله عليه وسلم \"فكاتبوهم إن علمتم فيهم خيرا\" قال: \"إن علمتم لم حرفة ولا ترسلوهم كلا على الناس\". وقوله تعالى: \"وآتوهم من مال الله الذي آتاكم\" اختلف المفسرون فيه: فقال بعضهم: معناه اطرحوا لهم من الكتابة بعضها ثم قال بعضهم: مقدار الربع وقيل: الثلث وقيل: النصف وقيل: جزء من الكتابة من غير حد وقال آخرون: بل المراد من قوله \"وآتوهم من مال الله الذي آتاكم\" هو النصيب الذي فرض الله لهم من أموال الزكاة وهذا قول الحسن وعبدالرحمن بن زيد بن أسلم وأبيه ومقاتل بن حيان واختاره ابن جرير وقال إبراهيم النخعي في قوله \"وآتوهم من مال الله الذي آتاكم\" قال: حث الناس عليه مولاه وغيره وكذا قال بريدة بن الحصيب الأسلمي قتادة وقال ابن عباس: أمر الله المؤمنين أن يعينوا فى الرقاب وقد تقدم في الحديث عن النبي صلى الله عليه وسلم أنه قال: \"ثلاثة حق علي الله عونهم\" فذكر منهم المكاتب يريد الأداء والقول الأول أشهر وقال ابن أبي حاتم حدثنا محمد بن إسماعيل حدثنا وكيع عن ابن شبيب عن عكرمة عن ابن عباس عن عمر أنه كاتب عبدا له يكنى أبا أمية فجاء بنجمه حين حل فقال: يا أبا أمية اذهب فاستعن به في مكاتبتك فقال يا أمير المؤمنين لو تركته حتى يكون من آخر نجم؟ قال أخاف أن لا أدرك ذلك ثم قرأ \"فكاتبوهم إن علمتم فيهم خيرا وآتوهم من مال الله الذي آتاكم\" قال عكرمة فكان أول نجم أدي في الإسلام. وقال ابن جرير حدثنا ابن حميد حدثنا هارون بن المغيرة عن عنبسة عن سالم الأفطس عن سعيد بن جبير قال: كان ابن عمر إذا كاتب مكاتب لم يضع عنه شيئا من أول نجومه مخافة أن يعجز فترجع إليه صدقته ولكنه إذا كان في آخر مكاتبته وضع عنه ما أحب وقال علي بن أبي طلحة عن ابن عباس في الآية \"وآتوهم من مال الله الذي آتاكم\" قال: ضعوا عنهم من مكاتبتهم وكذا قال مجاهد وعطاء والقاسم بن أبي بزة وعبد الكريم بن مالك الجزري والسدى وقال محمد بن سيرين في الآية كان يعجبهم أن يدع الرجل لمكاتبه طائفة من مكاتبته وقال ابن أبي حاتم أخبرنا الفضل بن شاذان المقري أخبرنا إبراهيم بن موسي أخبرنا هشام بن يوسف عن ابن جريج أخبرني عطاء بن السائب أن عبدالله بن جندب أخبره عن علي \"1 عن النبي صلى الله عليه وسلم قال: \"ربع الكتابة\" وهذا حديث غريب ورفعه منكر والأشبه أنه موقوف على علي رضي الله عنه كما رواه عنه أبو عبد الرحمن السلمي رحمه الله. وقوله تعالى: \"ولا تكرهوا فتياتكم على البغاء\" الآية كان أهل الجاهلية إذا كان لأحدهم أمة أرسلها تزني وجعل عليها ضريبة يأخذها منها كل وقت فلما جاء الإسلام نهى الله المؤمنين عن ذلك وكان سبب نزول هذه الآية الكريمة فيما ذكر غير واحد من المفسرين من السلف والخلف في شأن عبدالله بن أبي بن سلول فانه كان له إماء فكان يكرههن علي البغاء طلبا لخراجهن ورغبة في أولادهن ورياسة منه فيما يزعم. ذكر الآثار الواردة في ذلك: قال الحافظ أبو بكر أحمد بن عمرو بن عبد الخالق البزار رحمه الله فى مسنده حدثنا أحمد بن داود الواسطي حدثنا أبو عمرو اللخمي يعني محمد بن الحجاح حدثنا محمد بن إسحاق عن الزهري قال كانت جارية لعبدالله بن أبي ابن سلول يقال لها معاذة يكرهها على الزنا فلما جاء الإسلام نزلت \"ولا تكرهوا فتياتكم على البغاء\" الآية وقال الأعمش عن أبي سفيان عن جابر فى هذه الآية قال نزلت في أمة لعبدالله بن أبي بن سلول يقال لها مسيكة كان يكرهها على الفجور وكانت لا بأس بها فتأبي فأنزل الله هذه الآية \"ولا تكرهوا فتياتكم على البغاء - إلى قوله - ومن يكرهن فإن الله من بعد إكراههن غفور رحيم\" وروى النسائي من حديث ابن جريج عن أبي الزبير عن جابر نحوه وقال الحافظ أبو بكر البزار حدثنا عمر بن علي حدثنا علي بن سعيد حدثنا الأعمش حدثني أبو سفيان عن جابر قال كان لعبدالله بن أبي بن سلول جارية يقال لها مسيكة وكان يكرهها على البغاء فأنزل الله \"ولا تكرهوا فتياتكم على البغاء - إلى قوله - ومن يكرههن فإن الله من بعد إكراههن غفور رحيم\" صرح الأعمش بالسماع من أبي سفيان بن طلحة بن نافع فدل على بطلان قول من قال لم يسمع منه إنما هو صحيفة حكاه البزار وروى أبو داود الطيالسي عن سليمان بن معاذ عن سماك عن عكرمة عن ابن عباس أن جارية لعبدالله بن أبي كانت تزنى في الجاهلية فولدت أولادا من الزنا فقال لها مالك: لا تزنين قالت: والله لا أزني فضربها فأنزل الله عز وجل: \"ولا تكرهوا فتياتكم على البغاء\". وروى البزار أيضا حدثنا أحمد بن داود الواسطي حدثنا أبو عمرو اللخمي يعني محمد ابن الحجاج حدثنا محمد بن إسحاق عن الزهري عن أنس رضي الله عنه قال: كانت جارية لعبدالله بن أبى يقال لها معاذة يكرهها على الزنا فلما جاء الإسلام نزلت \"ولا تكرهوا فتياتكم على البغاء إن أردن تحصنا - إلى قوله - ومن يكرههن فإن الله من بعد إكراههن غفور رحيم\" وقال عبد الرزاق أخبرنا معمر عن الزهري أن رجلا من قريش أسر يوم بدر وكان عند عبدالله بن أبي أسيرا وكانت لعبدالله بن أبي جارية يقال لها معاذة وكان القرشي الأسير يريدها على نفسها وكانت مسلمة وكانت تمتنع منه لإسلامها وكان عبدالله بن أبي يكرهها على ذلك ويضربها رجاء أن تحمل من القرشي فيطلب فداء ولده فقال تبارك وتعالى: \"ولا تكرهوا فتياتكم على البغاء إن أردن تحصنا\". وقال السدي أنزلت هذه الآية الكريمة في عبدالله بن أبي بن سلول رأس المنافقين وكانت له جارية تدعى معاذة وكان إذا نزل به ضيف أرسلها إليه ليواقعها إرادة الثواب منه والكرامة له فأقبلت الجارية إلى أبي بكر رضي الله عنه فشكت إليه فذكره أبو بكر للنبي صلى الله عليه وسلم فأمره بقبضها فصاح عبدالله بن أبي من يعذرنا من محمد يغلبنا على مملوكتنا فأنزل الله فيه هذا وقال مقاتل بن حيان بلغني والله أعلم أن هذه الآية نزلت في رجلين كانا يكرهان أمتين لهما إحداهما اسمها مسيكة وكانت للأنصار وكانت أميمة أم مسيكة لعبدالله بن أبي وكانت معاذة وأروى بتلك المنزلة فأتت مسيكة وأمها النبي صلى الله عليه وسلم فذكرنا ذلك له فأنزل الله في ذلك \"ولا تكرهوا فتياتكم على البغاء\" يعنى الزنا وقوله تعالى: \"إن أردن تحصنا\" هذا خرج مخرج الغالب فلا مفهوم له وقوله تعالى: \"لتبتغوا عرض الحياة الدنيا\" أي من خراجهن ومهورهن أولادهن وقد نهى رسول الله صلى الله عليه وسلم عن كسب الحجام ومهر البغي وحلوان الكاهن وفي رواية \"مهر البغي خبيث وكسب الحجام خبيث وثمن الكلب خبيث\" وقوله تعالى: \"ومن يكرهن فإن الله من بعد إكراههن غفور رحيم\" أي لهن كما تقدم في الحديث عن جابر وقال ابن أبي طلحة عن ابن عباس فإن فعلتم فإن الله لهن غفور رحيم وإثمهن على من أكرههن وكذا قال مجاهد وعطاء الخراساني والأعمش وقتادة وقال أبو عبيد حدثني إسحاق الأزرق عن عوف عن الحسن في هذه الآية \"فإن الله من بعد إكراههن غفور رحيم\" قال لهن والله لهن والله: وعن الزهري قال غفور لهن ما أكرهن عليه وعن زيد بن أسلم قال غفور رحيم للمكرهات حكاهن ابن المنذر في تفسيره بأسانيده وقال ابن أبي حاتم حدثنا أبو زرعة حدثنا يحيي ابن عبدالله حدثني ابن لهيعة حدثني عطاء عن سعيد بن جبير قال في قراءة عبدالله بن مسعود \"فإن الله من بعد إكراههن غفور رحيم\" لهن وإثمهن على من أكرههن وفي الحديث المرفوع عن رسول الله صلى الله عليه وسلم أنه قال: \"رفع عن أمتي الخطأ والنسيان وما استكرهوا عليه\"."
    },
    {
      "ayah": 34,
      "surah": 24,
      "text": "ولما فصل تبارك وتعالى هذه الأحكام وبينها قال تعالى: \"ولقد أنزلنا إليكم آيات مبينات\" يعني القرآن في آيات واضحات مفسرات \"ومثلا من الذين خلوا من قبلكم\" أي خبرا عن الأمم الماضية وما حل بهم في مخالفتهم أوامر الله تعالى كما قال تعالى: \"فجعلناهم سلفا ومثلا للآخرين\" أي زاجرا عن ارتكاب المآثم والمحارم \"وموعظة للمتقين\" أي لمن اتقى الله وخافه. قال علي بن أبي طالب رضي الله عنه في صفة القرآن: فيه حكم ما بينكم وخبر ما قبلكم ونبأ ما بعدكم وهو الفصل ليس بالهزل من تركه من جبار قصمه الله ومن ابتغى الهدى من غيره أضله الله."
    },
    {
      "ayah": 35,
      "surah": 24,
      "text": "قال علي بن أبي طلحة عن ابن عباس \"الله نور السموات والأرض\" يقول: هادي أهل السموات والأرض. قال ابن جريج قال مجاهد وابن عباس في قوله: \"الله نور السموات والأرض\" يدبر الأمر فيهما نجومهما وشمسهما وقمرهما وقال ابن جرير حدثنا سليمان بن عمر بن خالد الرقي حدثنا وهب بن راشد عن فرقد أن أنس بن مالك قال: إن الله يقول نوري هدى واختار هذا القول ابن جرير وقال أبو جعفر الرازي عن الربيع بن أنس عن أبي العالية عن أبي بن كعب في قوله تعالى: \"الله نور السموات والأرض مثل نوره\" قال: هو المؤمن الذي جعل الله الإيمان والقرآن في صدره فضرب الله مثله فقال \"الله نور السموات والأرض\" فبدأ بنور نفسه ثم ذكر نور المؤمن فقال مثل نور من آمن به قال فكان أبي بن كعب يقرؤها \"مثل نور من آمن به\" فهو المؤمن جعل الإيمان والقرآن في صدره وهكذا رواه سعيد بن جبير وقيس بن سعد عن ابن عباس أنه قرأها كذلك \"مثل نور من آمن بالله\" وقرأ بعضهم \"الله منور السموات والأرض\" وقال الضحاك \"الله نور السموات والأرض\" وقال السدي فى قوله \"الله نور السموات والأرض\" فبنوره أضاءت السموات والأرض وفى الحديث الذي رواه محمد بن إسحاق في السيرة عن رسول الله صلى الله عليه وسلم أنه قال في دعائه يوم آذاه أهل الطائف \"أعوذ بنور وجهك الذي أشرقت به الظلمات وصلح عليه أمر الدنيا والآخرة أن يحل بي غضبك أو ينزل بي سخطك لك العتبى حتى ترضى ولا حول ولا قوة إلا بالله\" وفي الصحيحين عن ابن عباس رضي الله عنه قال: كان رسول الله صلى الله عليه وسلم إذا قام من الليل يقول: \"اللهم لك الحمد أنت نور السموات والأرض ومن فيهن ولك الحمد أنت قيوم السموات والأرض ومن فيهن\" الحديث وعن ابن مسعود قال: إن ربكم ليس عنده ليل ولا نهار نور العرش من نور وجهه وقوله تعالى \"مثل نوره\" في هذا الضمير قولان: \"أحدهما\" أنه عائد إلى الله عز وجل أي مثل هداه فى قلب المؤمن قاله ابن عباس \"كمشكاة\" \"والثاني\" أن الضمير عائد إلى المؤمن الذي دل عليه سياق الكلام تقديره مثل نور المؤمن الذي في قلبه كمشكاة فشبه قلب المؤمن وما هو مفطور عليه من الهدى وما يتلقاه من القرآن المطابق لما هو مفطور عليه كما قال تعالى: \"أفمن كان على بينة من ربه ويتلوه شاهد منه\" فشبه قلب المؤمن في صفائه في نفسه بالقنديل من الزجاج الشفاف الجوهري وما يستمد به من القرآن والشرع بالزيت الجيد الصافي المشرق المعتدل الذي لا كدر فيه ولا انحراف فقوله \"كمشكاة\" قال ابن عباس ومجاهد ومحمد بن كعب وغير واحد: هو موضع الفتيلة من القنديل هذا هو المشهور ولهذا قال بعده \"فيها مصباح\" وهو الزبالة التي تضيء. وقال العوفي عن ابن عباس قوله \"الله نور السموات والأرض مثل نوره كمشكاة فيها مصباح\" وذلك أن اليهود قالوا لمحمد صلى الله عليه وسلم كيف يخلص نور الله من دون السماء؟ فضرب الله مثل ذلك لنوره فقال تعالى: \"الله نور السموات والأرض مثل نوره كمشكاة\" والمشكاة كوة في البيت قال وهو مثل ضربه الله لطاعته فسمى الله طاعته نورا ثم سماها أنواعا شتى وقال ابن أبي نجيح عن مجاهد هى الكوة بلغة الحبشة وزاد بعضهم فقال: المشكاة الكوة التي لا منفذ لها وعن مجاهد: المشكاة الحدائد التي يعلق بها القنديل والقول الأول أولى وهو: أن المشكاة هو موضع الفتيلة من القنديل ولهذا قال \"فيها مصباح\" وهو النور الذي في الزبالة قال أبي بن كعب: \"المصباح\" النور وهو القرآن والإيمان الذي في صدره وقال السدي: هو السراج \"المصباح في زجاجة\" أي هذا الضوء مشرق في زجاجة صافية وقال أبي بن كعب وغير واحد: وهي نظير قلب المؤمن \"الزجاجة كأنها كوكب دري\" قرأ بعضهم بضم الدال من غير همزة من الدر أي كأنها كوكب من در. وقرأ آخرون دريء ودريء بكسر الدال وضمها مع الهمزة من الدرء وهو الدفع وذلك أن النجم إذا رمي به يكون أشد استنارة من سائر الأحوال والعرب تسمي ما لا يعرف من الكواكب دراري وقال أبي بن كعب: كوكب مضيء وقال قتادة: مضيء مبين ضخم \"يوقد من شجرة مباركة\" أي يستمد من زيت زيتون شجرة مباركة \"زيتونه\" بدل أو عطف بيان \"لا شرقية ولا غربية\" أي ليست فى شرقي بقعتها فلا تصل إليها الشمس من أول النهار ولا في غربها فيقلص عنها الفيء قبل الغروب بل هي في مكان وسط تعصرها الشمس من أول النهار إلى آخره فيجيء زيتها صافيا معتدلا مشرقا وروى ابن أبي حاتم حدثنا محمد بن عمار قال حدثنا عبدالرحمن ابن عبدالله بن سعد أخبرنا عمرو بن أبي قيس عن سماك بن حرب عن عكرمة عن ابن عباس فى قوله \"زيتونه لا شرقية ولا غربية\" قال: هي شجرة بالصحراء لا يظلها شجر ولا جبل ولا كهف ولا يواريها شيء وهو أجود لزيتها وقال يحيي بن سعيد القطان عن عمران بن حدير عن عكرمة في قوله تعالى \"لا شرقية ولا غربية\" قال: هي بصحراء ذلك أصفي لزيتها وقال ابن أبي حاتم حدثنا أبي حدثنا أبو نعيم حدثنا عمرو بن فروخ عن حبيب ابن الزبير عن عكرمة وسأله رجل عن قوله تعالى \"زيتونه لا شرقية ولا غربية\" قال: تلك زيتونة بأرض فلاة إذا أشرقت الشمس أشرقت عليها فإذا غربت غربت عليها فذلك أصفى ما يكون من الزيت. وقال مجاهد فى قوله: تعالى \"لا شرقية ولا غربية\" قال: ليست بشرقية لا تصيبها الشمس إذا غربت ولا غربية لا تصيبها الشمس إذا طلعت ولكنها شرقية وغربية تصيبها إذا طلعت وإذا غربت. وعن سعيد بن جبير في قوله \"زيتونه لا شرقية ولا غربية يكاد زيتها يضيء\" قال: هو أجود الزيت قال إذا طلعت الشمس أصابتها من صوب المشرق فإذا أخذت فى الغروب أصابتها الشمس فالشمس تصيبها بالغداة والعشي فتلك لا تعد شرقية ولا غربية. وقال السدي قوله \"زيتونة لا شرقية ولا غربية\" يقول: ليست بشرقية يحوزها المشرق ولا غربية يحوزها المغرب دون المشرق ولكنها على رأس جبل أو في صحراء تصيبها الشمس النهار كله. وقيل المراد بقوله تعالى \"لا شرقية ولا غربية\" أنها في وسط الشجر ليست بادية للمشرق ولا للمغرب وقال أبو جعفر الرازي عن الربيع بن أنس عن أبي العالية عن أبي بن كعب في قول الله تعالى \"زيتونة لا شرقية ولا غربية\" قال: هي خضراء ناعمة لا تصيبها الشمس على أي حال كانت لا إذا طلعت ولا إذا غربت قال فكذلك هذا المؤمن قد أجير من أن يصيبه شيء من الفتن وقد يبتلى بها فيثبته الله فيها فهو بين أربع خلال إن قال صدق وإن حكم عدل وإن ابتلي صبر وإن أعطي شكر فهو في سائر الناس كالرجل الحي يمشي في قبور الأموات قال ابن أبي حاتم حدثنا علي بن الحسين حدثنا مسدد قال حدثنا أبو عوانة عن أبي بشر عن سعيد ابن جبير في قوله \"زيتونه لا شرقية ولا غربية\" قال: هي وسط الشجر لا تصيبها الشمس شرقا ولا غربا وقال عطية العوفي \"لا شرقية ولا غربية\" قال: هي شجرة في موضع من الشجر يرى ظل ثمرها في ورقها وهذه من الشجر لا تطلع عليها الشمس ولا تغرب وقال ابن أبي حاتم حدثنا محمد بن عمار حدثنا عبدالرحمن الدشتكي حدثنا عمرو بن أبي قيس عن عطاء عن سعيد بن جبير عن ابن عباس رضي الله عنهما في قوله تعالى \"لا شرقية ولا غربية\" ليست شرقية ليس فيها غرب ولا غربية ليس فيها شرق ولكنها شرقية غربية وقال محمد بن كعب القرظي \"لا شرقية ولا غربية\" قال: هي القبلية وقال زيد بن أسلم: \"لا شرقية ولا غربية\" قال الشام وقال الحسن البصري لو كانت هذه الشجرة في الأرض لكانت شرقية أو غربية ولكنه مثل ضربه الله تعالي لنوره وقال الضحاك عن ابن عباس \"توقد من شجرة مباركة\" قال: رجل صالح \"زيتونة لا شرقية ولا غربية\" قال لا يهودي ولا نصراني وأولى هذه الأقوال القول الأول وهو أنها في مستوى من الأرض في مكان فسيح باد ظاهر ضاح للشمس تقرعه من أول النهار إلى آخره ليكون ذلك أصفى لزيتها وألطف كما قال غير واحد ممن تقدم ولهذا قال تعالى \"يكاد زيتها يضيء ولو لم تمسسه نار\" قال عبدالرحمن بن زيد بن أسلم يعني كضوء إشراق الزيت وقوله تعالى \"نور على نور\" قال العوفي عن ابن عباس يعني بذلك إيمان العبد وعمله وقال مجاهد والسدي يعني نور النار ونور الزيت وقال أبي بن كعب \"نور على نور\" فهو يتقلب في خمسة من النور فكلامه نور وعمله نور ومدخله نور ومخرجه نور ومصيره إلى نور يوم القيامة إلى الجنة وقال شمر بن عطية جاء ابن عباس إلي كعب الأحبار فقال حدثني عن قول الله تعالى \"يكاد زيتها يضيء ولو لم تمسسه نار\" قال يكاد محمد صلى الله عليه وسلم يبين للناس ولو لم نتكلم أنه نبي كما يكاد ذلك الزيت أنه يضيء. وقال السدي فى قوله \"نور على نور\" قال: نور النار ونور الزيت حين اجتمعا أضاءا ولا يضيء واحد بغير صاحبه كذلك نور القرآن ونور الإيمان حين اجتمعا فلا يكون واحد منهما إلا بصاحبه. وقوله تعالى: \"يهدي الله لنوره من يشاء\" أي يرشد الله إلى هدايته من يختاره كما جاء في الحديث الذي رواه الإمام أحمد حدثنا معاوية بن عمرو حدثنا إبراهيم بن محمد الفزاري حدثنا الأوزاعي حدثني ربيعة بن زيد عن عبدالله الديلمي عن عبدالله بن عمرو سمعت رسول الله صلى الله عليه وسلم يقول \"إن الله تعالى خلق خلقه فى ظلمة ثم ألقى عليهم من نوره يومئذ فمن أصاب من نوره يومئذ اهتدى ومن أخطأه ضل فلذلك أقول جف القلم على علم الله عز وجل \"طريق أخري عنه\" قال البزار حدثنا أيوب عن سويد عن يحيي بن أبي عمرو الشيباني عن أبيه عن عبدالله بن عمرو سمعت رسول الله صلى الله عليه وسلم يقول: \"إن الله خلق خلقه ف ظلمة فألقى عليهم نورأ من نوره فمن أصابه من ذلك النور اهتدى ومن أخطأه ضل\" ورواه البزار عن عبدالله بن عمرو من طريق آخر بلفظه وحروفه. وقوله تعالى \"ويضرب الله الأمثال للناس والله بكل شيء عليم\" لما ذكر تعالى هذا مثلا لنور هداه في قلب المؤمن ختم الآية بقوله \"ويضرب الله الأمثال للناس والله بكل شيء عليم\" أي هو أعلم بمن يستحق الهداية ممن يستحق الإضلال. قال الإمام أحمد حدثنا أبو النضر حدثنا أبو معاوية حدثنا شيبان عن ليث عن عمرو بن مرة عن أبي البحتري عن أبي سعيد الخدري قال: قال رسول الله صلى الله عليه وسلم \"القلوب أربعة: قلب أجرد فيه مثل السراج يزهر وقلب أغلف مربوط على غلافه وقلب منكوس وقلب مصفح فأما القلب الأجرد فقلب المؤمن سراجه فيه نوره وأما القلب الأغلف فقلب الكافر وأما القلب المنكوس فقلب المنافق عرف ثم أنكر وأما القلب المصفح فقلب فيه إيمان ونفاق ومثل الإيمان فيه كمثل البقلة يمدها الماء الطيب ومثل النفاق فيه كمثل القرحة يمدها الدم والقيح. فأي المدتين غلبت على لأخرى غلبت عليه\" إسناده جيد ولم يخرجوه."
    },
    {
      "ayah": 36,
      "surah": 24,
      "text": "لما ضرب الله تعالى مثل قلب المؤمن وما فيه من الهدى والعلم بالمصباح في الزجاجة الصافية المتوقد من زيت طيب وذلك كالقنديل مثلا ذكر محلها وهي المساجد التي هي أحب البقاع إلى الله تعالى من الأرض وهي بيوته التي يعبد فيها ويوحد فقال تعالى \"في بيوت أذن الله أن ترفع\" أي أمر الله تعالى بتعاهدها وتطهيرها من الدنس واللغو والأقوال والأفعال التي لا تليق فيها كما قال علي بن أبي طلحة عن ابن عباس فى هذه الآية الكريمة \"في بيوت أذن الله أن ترفع \"قال نهي الله سبحانه عن اللغو فيها وكذا قال عكرمة وأبو صالح والضحاك ونافع بن جبير وأبو بكر بن سليمان بن أبي خيثمة وسفيان بن حسين وغيرهم من العلماء المفسرين. وقال قتادة هي هذه المساجد أمر الله سبحانه وتعالى ببنائها وعمارتها ورفعها وتطهيرها. وقد ذكر لنا أن كعبا كان يقول: مكتوب في التوراة إن بيوتي في الأرض المساجد وإنه من توضأ فأحسن وضوءه ثم زارني في بيتي أكرمته وحق على المزور كرامة الزائر. رواه عبدالرحمن ابن أبي حاتم في تفسيره. وقد وردت أحاديث كثيرة فى بناء المساجد واحترامها وتوقيرها وتطييبها وتبخيرها وذلك له محل مفرد يذكر فيه وقد كتبت في ذلك جزءا علي حدة ولله الحمد والمنة. ونحن بعون الله تعالي نذكر هنا طرفا من ذلك إن شاء الله تعالى وبه الثقة وعليه التكلان فعن أمير المؤمنين عثمان بن عفان رضي الله عنه قال سمعت رسول الله صلى الله عليه وسلم يقول \"من بني مسجدا يبتغي به وجه الله بني الله له مثله\" في الجنة\"أخرجاه في الصحيحين وروى ابن ماجه عن عمر بن الخطاب رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم \"من بنى مسجدا يذكر فيه اسم الله بني الله له بيتا في الجنه\" وللنسائي عن عمر بن عنبسة مثله والأحاديث في هذا كثيرة جدا وعن عائشة رضي الله عنها قالت: أمرنا رسول الله صلى الله عليه وسلم ببناء المساجد في الدور وأن تنظف وتطيب. رواه أحمد وأهل السنن إلا النسائي ولأحمد وأبي داود عن سمرة بن جندب نحوه وقال البخاري قال عمر: ابن للناس ما يكنهم وإياك أن تحمر أو تصفر فتفتن الناس وروى ابن ماجه قال: قال رسول الله صلى الله عليه وسلم \"ما ساء عمل قوم قط إلا زخرفوا مساجدهم\"وفي إسناده ضعف. وروى أبو داود عن ابن عباس قال: قال رسول الله صلى الله عليه وسلم \"ما أمرت بتشييد المساجد\"قال ابن عباس أزخرفها كما زخرفت اليهود والنصارى. وعن أنس رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم \"لا تقوم الساعة حتى يتباهى الناس في المساجد\" رواه أحمد وأهل السنن إلا الترمذي. وعن بريدة أن رجلا أنشد في المسجد فقال من دعا إلى الجمل الأحمر فقال النبي صلى الله عليه وسلم \"لا وجدت إنما بنيت المساجد لما بنيت له\" رواه مسلم. وعن عمرو بن شعيب عن أبيه عن جده قال: نهى رسول الله صلى الله عليه وسلم عن البيع والابتياع وعن تناشد الأشعار في المساجد. رواه أحمد وأهل السنن وقال الترمذي حسن. وعن أبي هريرة رضي الله عنه أن رسول الله صلى الله عليه وسلم قال \"إذا رأيتم من يبيع أو يبتاع في المسجد فقولوا لا أربح الله تجارتك وإذا رأيتم من ينشد ضالة في المسجد فقولوا لا ردها الله عليك\" رواه الترمذي وقال حسن غريب وقد روى ابن ماجه وغيره من حديث ابن عمر مرفوعا قال: \"خصال لا تنبغي في المسجد: ولا يتخذ طريقا ولا يشهر فيه سلاح ولا ينبض فيه بقوس ولا ينثر فيه نبل ولا يمر فيه بلحم نيء ولا يضرب فيه حد ولا يقتص فيه أحد ولا يتخذ سوقا\" وعن واثلة بن الأسقع عن رسول الله صلى الله عليه وسلم قال \"جنبوا المساجد صبيانكم ومجانينكم وشراءكم وبيعكم وخصوماتكم ورفع أصواتكم وإقامة حدودكم وسل سيوفكم واتخذوا على أبوابها المطاهر وجمروها في الجمع\" ورواه ابن ماجه أيضا وفي إسنادهما ضعف أما أنه لا يتخذ طريقا فقد كره بعض العلماء المرور فيه إلا لحاجة إذا وجد مندوحة عنه وفي الأثر إن الملائكة لتتعجب من الرجل يمر بالمسجد لا يصلي فيه وأما أنه لا يشهر فيه السلاح ولا ينبض فيه بقوس ولا ينثر فيه نبل فلما يخشي من إصابة بعض الناس به لكثرة المصلين فيه ولهذا أمر رسول الله صلى الله عليه وسلم إذا مر رجل بسهام أن يقبض على نصالها لئلا يؤذي أحدا كما ثبت ذلك فى الصحيح. وأما النهي عن المرور باللحم النيء فيه فلما يخشي من تقاطر الدم منه كما نهيت الحائض عن المرور فيه إذا خافت التلويث وأما أنه لا يضرب فيه حد ولا يقتص منه فلما يخشي من إيجاد النجاسة فيه من المضروب أو المقطوع وأما أنه لا يتخذ سوقا فلما تقدم من النهي عن البيع والشراء فيه فإنه إنما بني لذكر الله والصلاة فيه كما قال النبي صلى الله عليه وسلم لذلك الأعرابي الذي بال في طائفة المسجد \"إن المساجد لم تبن لهذا إنما بنيت لذكر الله والصلاة فيها\" ثم أمر بسجل من ماء فأهريق على بوله وفي الحديث الثاني \"جنبوا مساجدكم صبيانكم\" وذلك لأنهم يلعبون فيه ولا يناسبهم. وقد كان عمر بن الخطاب \"إذا رأى صبيانا يلعبون فى المسجد ضربهم بالمخفقة\" وهي الدرة وكان يفتش المسجد بعد العشاء فلا يترك فيه أحدا \"ومجانينكم\" يعني لأجل ضعف عقولهم وسخر الناس بهم فيؤدي إلى اللعب فيها ولما يخشي من تقذيرهم المسجد ونحو ذلك \"وبيعكم وشراءكم\" كما تقدم \"وخصوماتكم\" يعني التحاكم والحكم فيه ولهذا نص كثير من العلماء على أن الحاكم لا ينتصب لفصل الأقضية في المسجد بل يكون فى موضع غيره لما فيه من كثرة الحكومات والتشاجر والألفاظ التي لا تناسبه ولهذا قال بعده \"ورفع أصواتكم\". وقال البخاري: حدثنا علي بن عبدالله حدثنا يحيي بن سعيد حدثنا الجعد بن عبدالرحمن قال: حدثني يزيد بن حفصة عن السائب بن يزيد الكندي قال: كنت قائما في المسجد فحصبني رجل فنظرت فإذا عمر بن الخطاب فقال: اذهب فائتني بهذين فجئته بهما فقال من أنتما؟ أو من أين أنتما؟ قالا من أهل الطائف. قال: لو كنتما من أهل البلد لأوجعتكما ترفعان أصواتكما في مسجد رسول الله صلى الله عليه وسلم وقال النسائي: حدثنا سويد بن نصر عن عبدالله بن المبارك عن شعبة عن سعد بن إبراهيم عن أبيه إبراهيم بن عبدالرحمن بن عوف قال: سمع عمر صوت رجل في المسجد فقال أتدري أين أنت؟ وهذا أيضا صحيح وقوله: \"وإقامة حدودكم وسل سيوفكم\" تقدما وقوله \"واتخذوا على أبوابها المطاهر\" يعنى المراحيض التي يستعان بها على الوضوء وقضاء الحاجة. وقد كانت قريبا من مسجد رسول الله صلى الله عليه وسلم أباريق يستقون منها فيشربون ويتطهرون ويتوضئون وغير ذلك. وقوله \"وجمروها في الجمع\" يعني بخروها في أيام الجمع لكثرة اجتماع الناس يومئذ وقد قال الحافظ أبو يعلي الموصلي حدثنا عبيد الله حدثنا عبد الرحمن بن مهدي عن عبدالله بن عمر عن نافع عن ابن عمر أن عمر كان يجمر مسجد رسول الله صلى الله عليه وسلم كل جمعة إسناده حسن لا بأس به والله أعلم. وقد ثبت في الصحيحين أن رسول الله صلى الله عليه وسلم قال: \"صلاة الرجل في الجماعة تضعف على صلاته في بيته وفي سوقه خمسا وعشرين ضعفا\" وذلك أنه إذا توضأ فأحسن الوضوء ثم خرج إلى المسجد لا يخرجه إلا الصلاة لم يخط خطوة إلا رفع له بها درجة وحط عنه بها خطيئة فإذا صلي لم تزل الملائكة تصلي عليه ما دام في مصلاه: اللهم صل عليه اللهم ارحمه. ولا يزال في صلاة ما انتظر الصلاة. وعند الدارقطني مرفوعا \"لا صلاة لجار المسجد إلا في المسجد\" وفي السنن \"بشر المشائين إلى المساجد في الظلم بالنور التام يوم القيامة\" ويستحب لمن دخل المسجد أن يبدأ برجله اليمني وأن يقول كما ثبت في أبي داود عن عبدالله بن عمرو رضي الله عنهما عن رسول الله صلى الله عليه وسلم أنه كان إذا دخل المسجد يقول \"أعوذ بالله العظيم وبوجهه الكريم وسلطانه القديم من الشيطان الرجيم\" قال فإذا قال ذلك قال الشيطان حفظ مني سائر اليوم. وروى مسلم بسنده عن أبي حميد أو أبي أسيد قال: قال رسول الله صلى الله عليه وسلم \"إذا دخل أحدكم المسجد فليقل: اللهم افتح لي أبواب رحمتك. وإذا خرج فليقل: اللهم افتح لي أبواب فضلك\" ورواه النسائي عنهما عن النبي صلى الله عليه وسلم وعن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم \"إذا دخل أحدكم المسجد فليسلم علي النبي صلى الله عليه وسلم وليقل: اللهم افتح لى أبواب رحمتك وإذا خرج فليسلم على النبي صلى الله عليه وسلم وليقل: اللهم اعصمني من الشيطان الرجيم\" ورواه ابن ماجه وابن خزيمة وابن حبان في صحيحيهما وقال الإمام أحمد حدثنا إسماعيل بن إبراهيم حدثنا ليث بن أبي سليم عن عبدالله بن حسين عن أمه فاطمة بنت حسين عن جدتها فاطمة بنت رسول الله صلى الله عليه وسلم قالت: كان رسول الله صلى الله عليه وسلم إذا دخل المسجد صلي على محمد وسلم ثم قال \"اللهم اغفر لي ذنوبي وافتح لي أبواب رحمتك\" وإذا خرج خرج صلي على محمد وسلم ثم قال \"اللهم اغفر لي ذنوبي وافتح لي أبواب فضلك\" ورواه الترمذي وابن ماجه وقال الترمذي هذا حديث حسن وإسناده ليس بمتصل لأن فاطمة بنت حسين الصغرى لم تدرك فاطمة الكبرى فهذا الذي ذكرناه مع ما تركناه من الأحاديث الواردة في ذلك كله محاذرة الطول داخل في قوله تعالي \"في بيوت أذن الله أن ترفع\" وقوله \"ويذكر فيها اسمه\" أي اسم الله كقوله \"يا بني آدم خذوا زينتكم عند كل مسجد\" وقوله \"وأقيموا وجوهكم عند كل مسجد وادعوه مخلصين له الدين\" وقوله \"وأن المساجد لله\" الآية. وقوله تعالى \"ويذكر فيها اسمه\" قال ابن عباس يعني يتلي كتابه وقوله تعالى \"يسبح له فيها بالغدو والآصال\" أي في البكرات والعشيات. والآصال جمع أصيل وهو آخر النهار. وقال سعيد بن جبير عن ابن عباس: كل تسبيح في القرآن هو الصلاة وقال علي بن أبي طلحة عن ابن عباس: يعني بالغدو صلاة الغداة ويعني بالآصال صلاة العصر وهما أول ما افترض الله من الصلاة فأحب أن يذكرهما وأن يذكر بهما عبادة. وكذا قال الحسن والضحاك \" يسبح له فيها بالغدو والآصال \"يعني الصلاة ومن قرأ من القراء \"يسبح له فيها بالغدو والآصال\" فتح الباء من \"يسبح\" على أنه مبني لما لم يسم فاعله وقف على قوله \"والآصال\" وقفا تاما."
    },
    {
      "ayah": 37,
      "surah": 24,
      "text": "وابتدأ بقوله \"رجال لا تلهيهم تجارة ولا بيع عن ذكر الله\" وكأنه مفسر للفاعل المحذوف كما قال الشاعر: يبك يزيد ضارع لخصومة ومختبط مما تطيح الطوائح كأنه قال: من يبكيه قال هذا يبكيه وكأنه قيل من يسبح له فيها؟ قال رجال. وأما على قراءة من قرأ \"يسبح\" بكسر الباء فجعله فعلا وفاعله \"رجال\" فلا يحسن الوقف إلا على الفاعل لأنه تمام الكلام فقوله تعالى \"رجال\" فيه إشعار بهممهم السامية ونياتهم وعزائمهم العالية التي بها صاروا عمارا للمساجد التي هي بيوت الله في أرضه ومواطن عبادته وشكره وتوحيده وتنزيهه كما قال تعالى: \"من المؤمنين رجال صدقوا ما عاهدوا الله عليه\" الآية وأما النساء فصلاتهن في بيوتهن أفضل لهن لما رواه أبو داود عن عبدالله بن مسعود رضي الله عنه عن النبي صلى الله عليه وسلم قال: \"صلاة المرأة في بيتها أفضل من صلاتها في حجرتها وصلاتها في مخدعها أفضل من صلاتها في بيتها\". وقال الإمام أحمد: حدثنا يحيي بن غيلان حدثنا رشدين حدثني عمرو عن أبي السمح عن السائب مولى أم سلمة عن رسول الله صلى الله عليه وسلم قال: \"خير مساجد النساء قعر بيوتهن\" وقال أحمد أيضا: حدثنا هارون أخبرني عبدالله ابن وهب حدثنا داود بن قيس عن عبدالله بن سويد الأنصاري عن عمته أم حميد امرأة أبي حميد الساعدي أنها جاءت إلى النبي صلى الله عليه وسلم فقالت يا رسول الله إني أحب الصلاة معك. قال: \"قد علمت أنك تحبين الصلاة معي وصلاتك فى بيتك خير من صلاتك في حجرتك وصلاتك في حجرتك خير من صلاتك في دارك وصلاتك في دارك خير من صلاتك في مسجد قومك وصلاتك في مسجد قومك خير من صلاتك في مسجدي\" قال فأمرت فبني لها مسجد في أقصى بيت من بيوتها فكانت والله تصلي فيه حتى لقيت الله تعالى لم يخرجوه. هذا ويجوز لها شهود جماعة الرجال بشرط أن لا تؤذي أحدا من الرجال بظهور زينة ولا ريح طيب كما ثبت في الصحيح عن عبدالله بن عمر أنه قال: قال رسول الله صلى الله عليه وسلم \"لا تمنعوا إماء الله مساجد الله\" رواه البخاري ومسلم ولأحمد وأبي داود \"وبيوتهن خير لهن\" وفي رواية \"وليخرجن وهن تفلات\" أى لا ريح لهن. وقد ثبت فى صحيح مسلم عن زينب امرأة عبدالله بن مسعود قالت: قال لنا رسول الله صلى الله عليه وسلم \"إذا شهدت إحداكن المسجد فلا تمس طيبا\" وفي الصحيحين عن عائشة رضي الله عنها أنها قالت: كان نساء المؤمنين يشهدن الفجر مع رسول الله صلى الله عليه وسلم ثم يرجعن متلفعات بمروطهن ما يعرفن من الغلس وفي الصحيحين عنها أيضا أنها قالت: لو أدرك رسول الله صلى الله عليه وسلم ما أحدث النساء لمنعهن من المساجد كما منعت نساء بني إسرائيل. وقوله تعالى \"رجال لا تلهيهم تجارة ولا بيع عن ذكر الله\" كقوله تعالى \"يا أيها الذين آمنوا لا تلهكم أموالكم ولا أولادكم عن ذكر الله\" الآية وقوله تعالى \"يا أيها الذين آمنوا إذا نودي للصلاة من يوم الجمعة فاسعوا إلى ذكر الله وذروا البيع\" الآية يقول تعالى لا تشغلهم الدنيا وزخرفها وزينتها وملاذ بيعها وربحها عن ذكر ربهم الذي هو خالقهم ورازقهم والذين يعلمون أن الذي عنده هو خير لهم وأنفع مما بأيديهم لأن ما عندهم ينفذ وما عند الله باق ولهذا قال تعالى \"لا تلهيهم تجارة ولا بيع عن ذكر الله وإقام الصلاة وإيتاء الزكاة\" أي: يقدمون طاعته ومراده ومحبته على مرادهم ومحبتهم قال هشيم عن شيبان قال حدثت عن ابن مسعود أنه رأى قوما من أهل السوق حيث نودي للصلاة المكتوبة تركوا بياعتهم ونهضوا إلى الصلاة فقال عبدالله بن مسعود هؤلاء من الذين ذكر الله في كتابه \"رجال لا تلهيهم تجارة ولا بيع عن ذكر الله\" الآية وهكذا روى عمرو بن دينار القهرماني عن سالم عن عبدالله بن عمر رضي الله عنه أنه كان في السوق فأقيمت الصلاة فأغلقوا حوانيتهم ودخلوا المسجد فقال ابن عمر فيهم نزلت \"رجال لا تلهيهم تجارة ولا بيع عن ذكر الله\" رواه ابن أبي حاتم وابن جرير. وقال ابن أبي حاتم حدثنا أبي حدثنا محمد بن عبدالله بن بكير الصنعاني حدثنا أبو سعيد مولى بن هاشم حدثنا عبدالله بن بجير حدثنا أبو عبد ربه قال: قال أبو الدرداء رضي الله عنه إنى قمت على هذا الدرج أبايع عليه أربح كل يوم ثلثمائة دينار أشهد الصلاة في كل يوم في المسجد أما إنى لا أقول إن ذلك ليس بحلال ولكني أحب أن أكون من الذين قال الله فيهم \"رجال لا تلهيهم تجارة ولا بيع عن ذكر الله\". وقال عمرو بن دينار الأعور كنت مع سالم بن عبدالله ونحن نريد المسجد فمررنا بسوق المدينة وقد قاموا إلى الصلاة وخمروا متاعهم فنظر سالم إلى أمتعتهم ليس معها أحد فتلا سالم هذه الآية \"رجال لا تلهيهم تجارة ولا بيع عن ذكر الله\" ثم قال هم هؤلاء وكذا قال سعيد بن أبي الحسن والضحاك لا تلهيهم التجارة والبيع أن يأتوا الصلاة في وقتها. وقال مطر الوراق كانوا يبيعون ويشترون ولكن كان أحدهم إذا سمع النداء وميزانه في يده خفضه وأقبل إلى الصلاة وقال علي بن أبي طلحة عن ابن عباس \"لا تلهيهم تجارة ولا بيع عن ذكر الله\" يقول عن الصلاة المكتوبة وكذا قال مقاتل بن حيان والربيع بن أنس وقال السدي عن الصلاة فى جماعة. وقال مقاتل بن حيان لا يلهيهم ذلك عن حضور الصلاة وأن يقيموها كما أمرهم الله وأن يحافظوا على مواقيتها وما استحفظهم الله فيها. وقوله تعالى \"يخافون يوما تتقلب فيه القلوب والأبصار\" أي يوم القيامة الذي تتقلب فيه القلوب والأبصار أي من شدة الفزع وعظمة الأهوال كقوله \"وأنذرهم يوم الآزفة\" الآية وقوله \"إنما يؤخرهم ليوم تشخص فيه الأبصار\" وقال تعالى \"ويطعمون الطعام على حبه مسكينا ويتيما وأسيرا إنما نطعمكم لوجه الله لا نريد منكم جزاءا ولا شكورا إنا نخاف من ربنا يوم عبوسا قمطريرا فوقاهم الله شر ذلك اليوم ولقاهم نضرة وسرورا وجزاهم بما صبروا جنة وحريرا\"."
    },
    {
      "ayah": 38,
      "surah": 24,
      "text": "أي هؤلاء من الذين يتقبل حسناتهم ويتجاوز عن سيئاتهم وقوله \"ويزيدهم من فضله\" أي يتقبل منهم الحسن ويضاعفه لهم كما قال تعالى \"إن الله لا يظلم مثقال ذرة\" الآية وقال تعالى \"من جاء بالحسنة فله عشر أمثالها\" الآية وقال \"من ذا الذي يقرض الله قرضا حسنا\" الآية وقال \"والله يضاعف لمن يشاء\" وقال ههنا \"والله يرزق من يشاء بغير حساب\" وعن ابن مسعود أنه جيء بلبن فعرضه على جلسائه واحدا واحدا فكلهم لم يشربه لأنه كان صائما فتناوله ابن مسعود فشربه لأنه كان مفطرا ثم تلا قوله \"يخافون يوما تتقلب فيه القلوب والأبصار\" رواه النسائي وابن أبي حاتم من حديث الأعمش عن إبراهيم عن علقمة عنه. وقال أيضا حدثنا أبي حدثنا سويد بن سعيد حدثنا علي بن مسهر عن عبدالرحمن بن إسحاق عن شهر بن حوشب عن أسماء بنت يزيد بن السكن قالت: قال رسول الله صلى الله عليه وسلم: \"إذا جمع الله الأولين والآخرين يوم القيامة جاء مناد فنادى بصوت يسمع الخلائق سيعلم أهل الجمع من أولى بالكرم ليقم الذين لا تلهيهم تجارة ولا بيع عن ذكر الله فيقومون وهم قليل ثم يحاسب سائر الخلائق\" وروى الطبراني من حديث بقية عن اسماعيل بن عبدالله الكندي عن الأعمش عن أبي وائل عن ابن مسعود عن النبي صلى الله عليه وسلم فى قوله \"ليوفيهم أجورهم ويزيدهم من فضله\" قال أجورهم يدخلهم الجنة ويزيدهم من فضله الشفاعة لمن وجبت له الشفاعة لمن صنع لهم المعروف في الدنيا."
    },
    {
      "ayah": 39,
      "surah": 24,
      "text": "هذان مثلان ضربهما الله تعالى لنوعي الكفار كما ضرب للمنافقين في أول البقرة مثلين ناريا ومائيا وكما ضرب لما يقر في القلوب من الهدى والعلم في سورة الرعد مثلين مائيا وناريا وقد تكلمنا على كل منهما في موضعه بما أغنى عن إعادته ولله الحمد والمنة. فأما الأول من هذين المثلين فهو للكفار الدعاة إلى كفرهم الذين يحسبون أنهم علي شيء من الأعمال والاعتقادات وليسوا في نفس الأمر على شيء فمثلهم في ذلك كالسراب الذي يرى في القيعان من الأرض عن بعد كأنه بحر طام والقيعة جمع قاع كجار وجيرة والقاع أيضا واحد القيعان كما يقال جار وجيران وهي الأرض المستوية المتسعة المنبسطة وفيه يكون السراب وإنما يكون ذلك بعد نصف النهار وأما الآل فإنما يكون أول النهار يرى كأنه ماء بن السماء والأرض فإذا رأى السراب من هو محتاج إلى الماء يحسبه ماء قصده ليشرب منه فلما إنتهى إليه \"لم يجده شيئا\" فكذلك الكافر يحسب أنه قد عمل عملا وأنه قد حصل شيئا فإذا وافى الله يوم القيامة وحاسبه عليها ونوقش على أفعاله لم يجد له شيئا بالكلية قد قبل إما لعدم الإخلاص أو لعدم سلوك الشرع كما قال تعالى: \"وقدمنا إلى ما عملوا من عمل فجعلناه هباء منثورا\" وقال ههنا \"ووجد الله عنده فوفاه حسابه والله سريع الحساب\" وهكذا روي عن أبي بن كعب وابن عباس ومجاهد وقتادة وغير واحد. وفي الصحيحين أنه يقال يوم القيامة لليهود ما كنتم تعبدون؟ فيقولون كنا نعبد عزير ابن الله. فيقال كذبتم ما اتخذ الله من ولد ماذا تبغون؟ فيقولون يا رب عطشنا فاسقنا فيقال ألا ترون؟ فتمثل لهم النار كأنها سرب يحطم بعضها بعضا فينطلقون فيتهافتون فيها وهذا المثال مثال لذوي الجهل المركب فأما أصحاب الجهل البسيط وهم الطماطم الأغشام المقلدون لأئمة الكفر الصم البكم الذي لا يعقلون فمثلهم."
    },
    {
      "ayah": 4,
      "surah": 24,
      "text": "هذه الآية الكريمة فيها بيان حكم جلد القاذف للمحصنة وهي الحرة البالغة العفيفة فإذا كان المقذوف رجلا فكذلك يجلد قاذفه أيضا وليس فيه نزاع بين العلماء فإن أقام القاذف بينة على صحة ما قاله درأ عنه الحد ولهذا قال تعالى \"ثم لم يأتوا بأربعة شهداء فاجلدوهم ثمانين جلدة ولا تقبلوا لهم شهادة أبدا وأولئك هم الفاسقون\" فأوجب على القاذف إذا لم يقم البينة على صحة ما قال ثلاثة أحكام \"أحدها\" أن يجلد ثمانين جلدة \"الثاني\" أنه ترد شهادته أبدا \"الثالث\" أن يكون فاسقا ليس بعدل لا عند الله ولا عند الناس."
    },
    {
      "ayah": 40,
      "surah": 24,
      "text": "قال قتادة: \"لجي\" هو العميق \"يغشاه موج من فوقه موج من فوقه سحاب ظلمات بعضها فوق بعض إذا أخرج يده لم يكد يراها\" أي لم يقارب رؤيتها من شدة الظلام فهذا مثل قلب الكافر الجاهل البسيط المقلد الذي لا يعرف حال من يقوده ولا يدري أين يذهب بل كما يقال في المثل للجاهل أين تذهب؟ قال معهم قيل: فإلى أين يذهبون؟ قال: لا أدري؟ وقال العوفي عن ابن عباس رضي الله عنه \"يغشاه موج\" الآية يعني بذلك الغشاوة التي على القلب والسمع والبصر وهي كقوله \"ختم الله على قلوبهم وعلى سمعهم وعلى أبصارهم\" الآية وكقوله \"أفرأيت من اتخذ إلهه هواه وأضله الله على علم وختم على سمعه وقلبه وجعل على بصره غشاوة\" الآية وقال أبي بن كعب في قوله تعالى \"ظلمات بعضها فوق بعض\" فهو يتقلب في خمسة من الظلم فكلامه ظلمة وعمله ظلمة ومدخله ظلمة ومخرجه ظلمة ومصيره يوم القيامة إلى الظلمات إلى النار وقال السدي والربيع بن أنس نحو ذلك أيضا وقوله تعالى \"ومن لم يجعل الله له نورا فما له من نور\" أي من لم يهده الله فهو هالك جاهل حائر بائر كافر كقوله \"من يضلل الله فلا هادي له\" وهذا في مقابلة ما قال في مثل المؤمنين \"يهدي الله لنوره من يشاء\" فنسأل الله العظيم أن يجعل في قلوبنا نورأ وعن أيماننا نورا وعن شمائلنا نورا وأن يعظم لنا نورا."
    },
    {
      "ayah": 41,
      "surah": 24,
      "text": "يخبر تعالى أنه يسبح له من في السموات والأرض أي من الملائكة والأناسي والجان والحيوان حتى الجماد كما قال تعالى \"تسبح له السموات السبع والأرض ومن فيهن\" الآية وقوله تعالي \"والطير صافات\" أي في حال طيرانها تسبح ربها وتعبده بتسبيح ألهمها وأرشدها إليه وهو يعلم ما هي فاعلة ولهذا قال تعالى \"كل قد علم صلاته وتسبيحه\" أي كل قد أرشده إلي طريقته ومسلكه في عبادة الله عز وجل. ثم أخبر أنه عالم بجميع ذلك لا يخفى عليه من ذلك شيء ولهذا قال تعالى \"والله عليم بما يفعلون\" ثم أخبر تعالى أن له ملك السموات والأرض فهو الحاكم المتصرف الإله المعبود الذي لا تنبغي العبادة إلا له ولا معقب لحكمه."
    },
    {
      "ayah": 42,
      "surah": 24,
      "text": "\"وإلى الله المصير\" أي يوم القيامة فيحكم فيه بما يشاء \"ليجزي الذين أساءوا بما عملوا\" الآية فهو الخالق المالك الإله الحكم في الدنيا والأخري وله الحمد في الأولى والآخرة."
    },
    {
      "ayah": 43,
      "surah": 24,
      "text": "يذكر تعالى أنه يسوق السحاب بقدرته أول ما ينشئها وهي ضعيفة وهو الإزجاء \"ثم يؤلف بينه\" أي يجمعه بعد تفرقه \"ثم يجعله ركاما\" أي متراكما أي يركب بعضه بعضا \"فترى الودق\" أي المطر \"يخرج من خلاله\" أي من خلله وكذا قرأها ابن عباس والضحاك قال عبيد بن عمير الليثي يبعث الله المثيرة فتقم الأرض قما ثم يبعث الله الناشئة فتنشئ السحاب ثم يبعث الله المؤلفة فتؤلف بينه ثم يبعث الله اللواقح فتلقح السحاب رواه ابن أبي حاتم وابن جرير رحمهما الله وقوله \"وينزل من السماء من جبال فيما من برد\" قال بعض النحاة \"من\" الأولى لابتداء الغاية والثانية للتبعيض والثالثة لبيان الجنس وهذا إنما يجيء على قول من ذهب من المفسرين إلى أن قوله \"من جبال فيها من برد\" معناه أن في السماء جبال برد ينزل الله منها البرد وأما من جعل الجبال ههنا كناية عن السحاب فإن من الثانية عند هذا لابتداء الغاية أيضا لكنها بدل من الأولى والله أعلم وقوله تعالى \"فيصيب به من يشاء ويصرفه عمن يشاء\" يحتمل أن يكون المراد بقوله \"فيصيب به\" أي بما ينزل من السماء من نوعي المطر والرد فيكون قوله \"فيصيب به من يشاء\" رحمة لهم \"ويصرفه عمن يشاء\" أي يؤخر عنهم الغيث ويحتمل أن يكون المراد بقوله \"فيصيب به\" أي بالبرد نقمة على من يشاء لما فيه من نثر ثمارهم وإتلاف زروعهم وأشجارهم ويصرفه عمن يشاء رحمة بهم وقوله \"يكاد سنا برقه يذهب بالأبصار\" أي يكاد ضوء برقه من شدته يخطف الأبصار إذا أتبعته وتراءته."
    },
    {
      "ayah": 44,
      "surah": 24,
      "text": "أي يتصرف فهما فيأخذ من طول هذا في قصر هذا حتى يعتدلا ثم يأخذ من هذا في هذا فيطول الذي كان قصيرا ويقصر الذي كان طويلا والله هو المتصرف في ذلك بأمره وقهره وعزته وعلمه \"إن فى ذلك لعبرة لأولى الأبصار\" أي لدليلا على عظمته تعالى كما قال تعالى \"إن في خلق السموات والأرض واختلاف الليل والنهار لآيات لأولي الألباب\" وما بعدها من الآيات الكريمات."
    },
    {
      "ayah": 45,
      "surah": 24,
      "text": "يذكر تعالى قدرته التامة وسلطانه العظيم في خلقه أنواع المخلوقات على اختلاف أشكالها وألوانها وحركاتها وسكناتها من ماء واحد \"فمنهم من يمشي على بطنه\" كالحية وما شاكلها \"ومنهم من يمشي على رجلين\" كالإنسان والطير \"ومنهم من يمشي على أربع\" كالأنعام وسائر الحيوانات ولهذا قال \"يخلق الله ما يشاء\" أي بقدرته لأنه ما شاء كان وما لم يشأ لم يكن ولهذا قال \"إن الله على كل شيء قدير\"."
    },
    {
      "ayah": 46,
      "surah": 24,
      "text": "يقرر تعالى أنه أنزل في هذا القرآن من الحكم والحكم والأمثال البينة المحكمة كثيرا جدا وأنه يرشد إلى تفهمها وتعقلها أولي الألباب والبصائر والنهي ولهذا قال \"والله يهدي من يشاء إلى صراط مستقيم\"."
    },
    {
      "ayah": 47,
      "surah": 24,
      "text": "يخبر تعالى عن صفات المنافقين الذين يظهرون خلاف ما يبطنون يقولون قولا بألسنتهم \"آمنا بالله وبالرسول وأطعنا ثم يتولى فريق منهم من بعد ذلك\" أي يخالفون أقوالهم بأعمالهم فيقولون ما لا يفعلون ولهذا قال تعالى: \"وما أولئك بالمؤمنين\"."
    },
    {
      "ayah": 48,
      "surah": 24,
      "text": "أي إذا طلبوا إلى اتباع الهدى فيما أنزل الله على رسوله أعرضوا عنه واستكبروا في أنفسهم عن أتباعه وهذه كقوله تعالى \"ألم تر إلى الذين يزعمون أنهم آمنوا بما أنزل إليك وما أنزل من قبلك - إلى قوله - رأيت المنافقين يصدون عنك صدودا\" وفي الطبراني من حديث روح بن عطاء عن أبي ميمونة عن أبيه عن الحسن عن سمرة مرفوعا \"من دعي إلى سلطان فلم يجب فهو ظالم لا حق له\"."
    },
    {
      "ayah": 49,
      "surah": 24,
      "text": "أي وإذا كانت الحكومة لهم لا عليهم جاءوا سامعين مطيعين وهو معنى قوله \"مذعنين\" وإذا كانت الحكومة عليه أعرض ودعا إلى غير الحق وأحب أن يتحاكم إلى غير النبي صلى الله عليه وسلم ليروج باطله ثم فإذعانه أولا لم يكن عن اعتقاد منه أن ذلك هو الحق بل لأنه موافق لهواه ولهذا لما خالف الحق قصده عدل عنه إلى غيره."
    },
    {
      "ayah": 5,
      "surah": 24,
      "text": "واختلف العلماء في هذا الإستثناء هل يعود إلى الجملة الأخيرة فقط فترفع التوبة الفسق فقط ويبقى مردود الشهادة دائما وإن تاب أو يعود إلى الجملتين الثانية والثالثة؟ وأما الجلد فقد ذهب وانقضي سواء تاب أو أصر وإلا حكم له بعد ذلك بلا خلاف فذهب الإمام مالك وأحمد والشافعي إلى أنه إذا قبلت شهادته وارتفع عنه حكم الفسق ونص عليه سعيد بن المسيب سيد التابعين وجماعة من السلف أيضا وقال الإمام أبو حنيفة إنما يعود الاستثناء إلى الجملة الأخيرة فقط فيرتفع الفسق بالتوبة ويبقى مردود الشهادة أبدأ وممن ذهب إليه من السلف القاضي شريح وإبراهيم النخعي وسعيد بن جبير ومكحول وعبدالرحمن بن زيد بن جابر. وقال الشعبي والضحاك لا تقبل شهادته وإن تاب إلا أن يعترف على نفسه أنه قد قال البهتان فحينئذ تقبل شهادته والله أعلم."
    },
    {
      "ayah": 50,
      "surah": 24,
      "text": "يعني لا يخرج أمرهم عن أن يكون فى القلوب مرض لازم لها أو قد لها شك فى الدين أو يخافون أن يجور الله ورسوله عليهم في الحكم وأياما كان فهو كفر محض والله عليم بكل منهم وما هو منطو عليه من هذه الصفات وقوله تعالى \"بل أولئك هم الظالمون\" أي بل هم الظالمون الفاجرون والله ورسوله مبرآن مما يظنون ومتوهمون من الحيف والجور تعالى الله ورسوله عن ذلك قال ابن أبي حاتم: حدثنا أبي حدثنا موسى بن إسماعيل حدثنا مبارك حدثنا الحسن قال: كان الرجل إذا كان بينه الرجل منازعة فدعي إلى النبي صلى الله عليه وسلم وهو محق أذعن وعلم أن النبي صلى الله عليه وسلم سيقضي له بالحق وإذا أراد أن يظلم فدعي إلى النبي صلى الله عليه وسلم أعرض وقال أنطلق إلى فلان فأنزل الله هذه الآية فقال النبي صلى الله عليه وسلم: \"من كان بينه وبين أخيه شيء فدعي إلى حكم من أحكام المسلمين فأبي أن يجيب فهو ظالم لا حق له\" وهذا حديث غريب وهو مرسل ثم أخبر تعالى عن صفة المؤمنين المستجيبين لله ولرسوله الذين لا يبغون دينا سوى كتاب الله وسنة رسوله."
    },
    {
      "ayah": 51,
      "surah": 24,
      "text": "أي سمعا وطاعة ولهذا وصفهم تعالى بالفلاح وهو نيل المطلوب والسلامة من المرهوب فقال تعالى \"وأولئك هم المفلحون\" وقال قتادة في هذه الآية \"أن يقولوا سمعنا وأطعنا\" ذكر لنا أن عبادة بن الصامت وكان عقبيا بدريا أحد نقباء الأنصار أنه لما حضره الموت قال لابن أخيه جنادة بن أبي أمية: ألا أنبئك بماذا عليك وبماذا لك ؟ قال: بلى قال: فإن عليك السمع والطاعة في عسرك ويسرك ومنشطك ومكرهك وأثرة عليك وعليك أن تقيم لسانك بالعدل وأن لا تنازع الأمر أهله إلا أن يأمروك بمعصية الله بواحا فما أمرت به من شي يخالف كتاب الله فاتبع كتاب الله. وقال قتادة: ذكر لنا أن أبا الدرداء قال: لا إسلام إلا بطاعة الله ولا خير إلا في جماعة والنصيحة لله ولرسوله وللخليفة وللمؤمنين عامة قال وقد ذكر لنا أن عمر بن الخطاب رضي الله عنه كان يقول: عروة الإسلام شهادة أن لا إله إلا الله وإقام الصلاة وإيتاء الزكاة والطاعة لمن ولاه الله أمر المسلمين. رواه ابن أبي حاتم والأحاديث والآثار في وجوب الطاعة لكتاب الله وسنة رسوله وللخلفاء الراشدين والأئمة إذا أمروا بطاعة الله أكثر من أن تحصر في هذا المكان."
    },
    {
      "ayah": 52,
      "surah": 24,
      "text": "قال قتادة: يطع الله ورسوله فيما أمراه به وترك ما نهياه عنه ويخش الله فيما مضى من ذنوبه ويتقه فيما يستقبل وقوله \"فأولئك هم الفائزون\" يعني الذين فازوا بكل خير وأمنوا من كل شر في الدنيا والآخرة."
    },
    {
      "ayah": 53,
      "surah": 24,
      "text": "يقول تعالى مخبرا عن أهل النفاق الذين كانوا يحلفون للرسول صلى الله عليه وسلم لئن أمرتهم بالخروج في الغزو ليخرجن قال الله تعالى: \"قل لا تقسموا\" أي لا تحلفوا وقوله: \"طاعة معروفة\" قيل: معناه طاعتكم طاعة معروفة أي قد علم طاعتكم إنما هي قول لا فعل معه وكلما حلفتم كذبتم كما قال تعالى: \"يحلفون لكم لترضوا عنهم\" الآية وقال تعالى: \"اتخذوا أيمانهم جنة\" الآية فهم من سجيتهم الكذب حتى فيما يختارونه كما قال تعالى \"ألم تر إلى الذين نافقوا يقولون لإخوانهم الذين كفروا من أهل الكتاب لئن أخرجتم لنخرجن معكم ولا نطيع فيكم أحدا أبدا وإن قوتلتم لننصرنكم والله يشهد إنهم لكاذبون لئن أخرجوا لا يخرجون معهم ولئن قوتلوا لا ينصرونهم ولئن نصروهم ليولن الأدبار ثم لا ينصرون\" وقيل المعنى في قوله \"طاعة معروفة\" أي ليكن أمركم طاعة معروفة أي بالمعروف من غير حلف ولا أقسام كما يطيع الله ورسوله المؤمنون بغير حلف ولا أقسام فكونوا أنتم مثلهم \"إن الله خبير بما تعلمون\" أي هو خبير بكم وبمن يطيع ممن يعصي فالحلف وإظهار الطاعة والباطن بخلافه وإن راج على المخلوق فالخالق تعالى يعلم السر وأخفى لا يروج عليه شيء من التدليس بل هو خبير بضمائر عباده وإن أظهروا خلافها."
    },
    {
      "ayah": 54,
      "surah": 24,
      "text": "أي اتبعوا كتاب الله وسنة رسوله وقوله تعالى: \"فإن تولوا\" أي تتولوا عنه وتتركوا ما جاءكم به \"فإنما عليه ما حمل\" أي إبلاغ الرسالة وأداء الأمانة \"وعليكم ما حملتم\" أي بقبول ذلك وتعظيمه والقيام بمقتضاه \"وإن تطيعوه تهتدوا\" وذلك لأنه يدعو إلى صراط مستقيم \"صراط الله الذي له ما في السموات وما في الأرض\" الآية وقوله تعالى: \"وما على الرسول إلا البلاغ المبين\" كقوله تعالى: \"فإنما عليك البلاغ وعلينا الحساب\" وقوله: \"فذكر إنما أنت مذكر لست عليهم بمصيطر\" قال وهب بن منبه أوحى الله إلى نبي من أنبياء بني إسرائيل يقال له شعياء أن قم في بني إسرائيل فإني سأطلق لسانك بوحي فقام فقال: يا سماء اسمعي ويا أرض انصتي فإن الله يريد أن يقضي شأنا ويدبر أمرا هو منفذه إنه يريد أن يحول الريف إلى الفلاة والآجام في الغيطان والأنهار في الصحاري والنعمة في الفقراء والملك في الرعاة ويريد أن يبعث أميا من الأميين ليس بفظ ولا غليظ ولا صخاب في الأسواق لو يمر على السراج لم يطفئه من سكينته ولو يمشي على القصب واليابس لم يسمع من تحت قدميه أبعثه بشيرا ونذيرا لا يقول الخنى أفتح به أعينا عميا وآذانا صما وقلوبا غلفا وأسدده بكل أمر جميل وأهب له كل خلق كريم وأجعل السكينة لباسه والبر شعاره والتقوى ضميره والحكمة منطقه والصدق والوفاء طبيعته والعفو والمعروف خلقه والحق شريعته والعدل سيرته والهدى إمامه والإسلام ملته وأحمد اسمه أهدي به بعد الضلالة وأعلم به من الجهالة وأرفع به بعد الخمالة وأعرف به بعد النكرة وأكثر به بعد القلة وأغني به بعد العيلة وأجمع به بعد الفرقة وأؤلف به بين أمم متفرقة وقلوب مختلفة وأهواء مشتتة وأستنفذ به فئاما من الناس عظيما من الهلكة وأجعل أمته خير أمة أخرجت للناس يأمرون بالمعروف وينهون عن المنكر موحدين مؤمنين مخلصين مصدقين بما جاءت به الرسل رواه ابن أبي حاتم."
    },
    {
      "ayah": 55,
      "surah": 24,
      "text": "هذا وعد من الله تعالى لرسوله صلوات الله وسلامه عليه بأنه سيجعل أمته خلفاء الأرض أي أئمة الناس والولاة عليهم وبهم تصلح البلاد وتخضع لهم العباد وليبدلنهم من بعد خوفهم أمنا وحكما فيهم وقد فعله تبارك وتعالى وله الحمد والمنة: فإنه صلى الله عليه وسلم لم يمت حتى فتح الله عليه مكة وخيبر والبحرين وسائر جزيرة العرب وأرض اليمن بكمالها وأخذ الجزية من مجوس هجر ومن بعض أطراف الشام وهاداه هرقل ملك الروم وصاحب مصر وإسكندرية وهو المقوقس وملوك عمان والنجاشي ملك الحبشة الذي تملك بعد أصحمة رحمه الله وأكرمه ثم لما مات رسول الله صلى الله عليه وسلم وأختار الله له ما عنده من الكرامة قام بالأمر بعده خليفته أبو بكر الصديق فلم شعث ما وهى بعد موته صلى الله عليه وسلم وأخذ جزيرة العرب ومهدها وبعث جيوش الإسلام إلى بلاد فارس صحبة خالد بن الوليد رضي الله عنه ففتحوا طرفا منها وقتلوا خلقا من أهلها وجيشا آخر صحبة أبي عبيدة رضي الله عنه ومن أتبعه من الأمراء إلى أرض الشام وثالثا صحبة عمرو بن العاص رضي الله عنه إلى بلاد مصر ففتح الله للجيش الشامي في أيامه بصري ودمشق ومخاليفهما من بلاد حوران وما والاها وتوفاه الله عز وجل واختار له ما عنده من الكرامة ومن على أهل الإسلام بأن ألهم الصديق أن يستخلف عمر الفاروق فقام بالأمر بعده قياما تاما لم يدر الفلك بعد الأنبياء على مثله في قوة سيرته وكمال عدله وتم في أيامه فتح البلاد الشامية بكمالها وديار مصر إلى آخرها وأكثر إقليم فارس وكسر كسرى وأهانه غاية الهوان وتقهقر إلى أقصى مملكته وقصر قيصر وانتزع يده عن بلاد الشام وأنحدر إلى القسطنطينية وأنفق أموالهما في سبيل الله كما أخبر بذلك ووعد به رسول الله; عليه من ربه أتم سلام وأزكى صلاة; ثم لما كانت الدولة العثمانية أمتدت الممالك الإسلامية إلى أقصى مشارق الأرض ومغاربها; ففتحت بلاد المغرب إلى أقصى ما هنالك الأندلس وقبرص; وبلاد القيروان وبلاد سبتة مما يلي البحر المحيط ومن ناحية المشرق إلى أقصى بلاد الصين; وقتل كسرى وباد ملكه بالكلية; وفتحت مدائن العراق وخراسان والأهواز وقتل المسلمون من الترك مقتلة عظيمة جدا; وخذل الله ملكهم الأعظم خاقان وجبي الخراج من المشارق والمغارب إلى حضرة أمير المؤمنين عثمان بن عفان رضي الله عنه وذلك ببركة تلاوته ودراسته وجمعه الأمة على حفظ القرآن ولهذا ثبت في الصحيح أن رسول الله صلى الله عليه وسلم قال: \"إن الله زوى لى الأرض فرأيت مشارقها ومغاربها وسيبلغ ملك أمتي ما زوى لي منها\" فها نحن نتقلب فيما وعدنا الله ورسوله وصدق الله ورسوله فنسأل الله الإيمان به وبرسوله والقيام بشكره على الوجه الذي يرضيه عنا. قال الإمام مسلم بن الحجاج فى صحيحه: حدثنا ابن أبي عمر حدثنا سفيان عن عبد الملك بن عمير عن جابر ابن سمرة قال: سمعت رسول الله صلى الله عليه وسلم يقول: \"لا يزال أمر الناس ماضيا ما وليهم اثنا عشر رجلا\" ثم تكلم النبي صلى الله عليه وسلم بكلمة خفيت عني فسألت أبي ماذا قال رسول الله صلى الله عليه وسلم ؟ فقال قال: \"كلهم من قريش\" ورواه البخاري من حديث شعبة عن عبد الملك بن عمير به وفي رواية لمسلم أنه قال ذلك عشية رجم ماعز بن مالك وذكر معه أحاديث أخر وفي هذا الحديث دلالة على أنه لابد من وجود اثني عشر خليفة عادل وليسوا هم بأئمة الشيعة الاثني عشر فإن كثيرا من أولئك لم يكن لهم من الأمر شيء فأما هؤلاء فإنهم يكونون من قريش يلون فيعدلون وقد وقعت البشارة بهم في الكتب المتقدمة ثم لا يشترط أن يكون متتابعين بل يكون وجودهم في الأمة متتابعا ومتفرقا وقد وجد منهم أربعة على الولاء وهم أبو بكر ثم عمر ثم عثمان ثم علي رضي الله عنهم ثم كانت بعدهم فترة ثم وجد منهم من شاء الله ثم قد يوجد منهم من بقي في الوقت الذي يعلمه الله تعالى ومنهم المهدي الذي أسمه يطابق أسم رسول الله صلى الله عليه وسلم وكنيته كنيته يملأ الأرض عدلا وقسطا كما ملئت جورا وظلما وقد روى الإمام أحمد وأبو داود والترمذي والنسائي من حديث سعيد بن جهمان عن سفينة مولى رسول الله صلى الله عليه وسلم أن رسول الله صلى الله عليه وسلم قال: \"الخلافة بعدي ثلاثون سنة ثم تكون ملكا عضوضا\" وقال الربيع بن أنس عن أبي العالية في قوله \"وعد الله الذين آمنوا منكم وعملوا الصالحات ليستخلفنهم في الأرض كما استخلف الذين من قبلهم وليمكنن لهم دينهم الذين ارتضى لهم وليبدلنهم من بعد خوفهم أمنا\" الآية قال كان النبي صلى الله عليه وسلم وأصحابه بمكة نحوا من عشر سنين يدعون إلى الله وحده وإلى عبادته وحده لا شريك له سرا وهم خائفون لا يؤمرون بالقتال حتى أمروا بالهجرة إلى المدينة فقدموها فأمرهم الله بالقتال فكانوا بها خائفين يمسون في السلاح ويصبحون في السلاح فصبروا على ذلك ما شاء الله ثم إن رجلا من الصحابة قال يا رسول الله: أبد الدهر نحن خائفون هكذا؟ أما يأتي علينا يوم نأمن فيه ونضع عنا السلاح؟ فقال رسول الله صلى الله عليه وسلم: \"لن تصبروا إلا يسيرا حتى يجلس الرجل منكم في الملإ العظيم محتبيا ليست فيه حديدة\" وأنزل الله هذه الآية فأظهر الله نبيه على جزيرة العرب فآمنوا ووضعوا السلاح ثم إن الله تعالى قبض نبيه صلى الله عليه وسلم فكانوا كذلك آمنين في إمارة أبي بكر وعمر وعثمان حتى وقعوا فيما وقعوا فيه فأدخل عليهم الخوف فاتخذوا الحجزة والشرط وغيروا فغير بهم وقال بعض السلف: خلافة أبي بكر وعمر رضي الله عنه حق في كتاب الله ثم تلا هذه الآية وقال البراء بن عازب نزلت هذه الآية ونحن في خوف شديد وهذه الآية الكريمة كقوله تعالى \"واذكروا إذ أنتم قليل مستضعفون في الأرض - إلى قوله - لعلكم تشكرون\" وقوله تعالى: \"كما استخلف الذين من قبلهم\" كما قال تعالى عن موسى عليه السلام أنه قال لقومه: \"عسى ربكم أن يهلك عدوكم ويستخلفكم في الأرض\" الآية وقال تعالى \"ونريد أن نمن على الذين استضعفوا في الأرض\" الآيتين. وقوله: \"وليمكنن لهم دينهم الذي ارتضى لهم\" الآية كما قال رسول الله صلى الله عليه وسلم لعدي بن حاتم حين وفد عليه \"أتعرف الحيرة؟ قال: لم أعرفها ولكن قد سمعت بها قال: فوالذي نفسي بيده ليتمن الله هذا الأمر حتى تخرج الظعينة من الحيرة حتى تطوف بالبيت في غير جوار أحد ولتفتحن كنوز كسرى بن هرمز قلت: كسرى بن هرمز؟ قال: نعم كسرى بن هرمز وليبذلن المال حتى لا يقبله أحد\". قال عدي بن حاتم: فهذه الظعينة تخرج من الحيرة فتطوف بالبيت في غير جوار أحد ولقد كنت فيمن فتح كنوز كسرى بن هرمز والذي نفسي بيده لتكونن الثالثة لأن رسول الله صلى الله عليه وسلم قد قالها. وقال الإمام أحمد حدثنا عبد الرزاق أخبرنا سفيان عن أبي سلمة عن الربيع بن أنس عن أبي العالية عن أبي بن كعب قال: قال رسول الله صلى الله عليه وسلم: \"بشر هذه الأمة بالسنا والرفعة والدين والنصر والتمكين في الأرض فمن عمل منهم عمل الآخرة للدنيا لم يكن له فى الآخرة نصيب\" وقوله تعالى: \"يعبدونني لا يشركون بي شيئا\" قال الإمام أحمد حدثنا عفان حدثنا همام حدثنا قتادة عن أنس أن معاذ بن جبل حدثه قال: بينا أنا رديف النبي صلى الله عليه وسلم على حمار ليس بيني وبينه إلا آخرة الرحل قال: \"يا معاذ قلت لبيك يا رسول الله وسعديك قال: ثم سار ساعة ثم قال: يا معاذ بن جبل قلت: لبيك يا رسول الله وسعديك ثم سار ساعة ثم قال: يا معاذ بن جبل قلت: لبيك يا رسول الله وسعديك قال: هل تدري ما حق الله على العباد؟ قلت الله ورسوله أعلم قال: حق الله على العباد أن يعبدوه ولا يشركوا به شيئا قال ثم سار ساعة ثم قال: يا معاذ بن جبل قلت: لبيك يا رسول الله وسعديك قال: فهل تدري ما حق العباد على الله إذا فعلوا ذلك؟ قال قلت: الله ورسوله أعلم قال: فإن حق العباد على الله أن لا يعذبهم\". أخرجاه في الصحيحين من حديث قتادة. وقوله تعالى: \"ومن كفر بعد ذلك فأولئك هم الفاسقون\" أي فمن خرج عن طاعتي بعد ذلك فقد خرج عن أمر ربه وكفى بذلك ذنبا عظيما فالصحابة رضي الله عنهم لما كانوا أقوم الناس بعد النبي صلى الله عليه وسلم بأوامر الله عز وجل وأطوعهم لله كان نصرهم بحسبهم أظهروا كلمة الله في المشارق والمغارب وأيدهم تأييدا عظيما وحكموا في سائر العباد والبلاد; ولما قصر الناس بعدهم في بعض الأوامر نقص ظهورهم بحسبهم ولكن قد ثبت فى الصحيحين من غير وجه عن رسول الله صلى الله عليه وسلم أنه قال: \"لا تزال طائفة من أمتي ظاهرين على الحق لا يضرهم من خذلهم ولا من خالفهم إلى يوم القيامة - وفي رواية - حتى يأتي أمر الله وهم على ذلك - وفي رواية - حتى يقاتلون الدجال - وفي رواية - حتى ينزل عيسى ابن مريم وهم ظاهرون\". وكل هذه الروايات صحيحة ولا تعارض بينها."
    },
    {
      "ayah": 56,
      "surah": 24,
      "text": "يقول تعالى آمرا عباده المؤمنين بإقامة الصلاة وهي عبادة الله وحده لا شريك له وإيتاء الزكاة وهي الإحسان إلى المخلوقين ضعفائهم وفقرائهم وأن يكونوا في ذلك مطيعين لرسول الله صلى الله عليه وسلم أي سالكين وراءه فيما به أمرهم وترك ما عنه زجرهم لعل الله يرحمهم بذلك ولا شك أن من فعل هذا أن الله سيرحمه كما قال تعالى في الآية الأخرى \"أولئك سيرحمهم الله\"."
    },
    {
      "ayah": 57,
      "surah": 24,
      "text": "\"لا تحسبن\" أي: لا تظن يا محمد أن \"الذين كفروا\" أي خالفوك وكذبوك \"معجزين في الأرض\" أي لا يعجزون الله بل الله قادر عليها وسيعذبهم على ذلك أشد العذاب ولهذا قال تعالى: \"ومأواهم\" أي في الدار الآخرة \"النار ولبئس المصير\" أي بئس المآل مآل الكافرين وبئس القرار وبئس المهاد."
    },
    {
      "ayah": 58,
      "surah": 24,
      "text": "هذه الآيات الكريمة اشتملت على استئذان الأقارب بعضهم على بعض وما تقدم في أول السورة فهو استئذان0 الأجانب بعضهما على بعض فأمر الله تعالى المؤمنين أن يستأذنهم خدمهم مما ملكت أيمانهم وأطفالهم الذين لم يبلغوا الحلم منهم في ثلاثه أحوال \"الأول\" من قبل صلاة الغداة لأن الناس إذ ذاك يكونون نياما في فرشهم \"وحين تضعون ثيابكم من الظهيرة\" أي في وقت القيلولة لأن الإنسان قد يضع ثيابه في تلك الحال مع أهله \"ومن بعد صلاة العشاء\" لأنه وقت النوم فيؤمر الخدم والأطفال أن لا يهجموا على أهل البيت في هذه الأحوال لما يخشى أن يكون الرجل على أهله أو نحو ذلك من الأعمال ولهذا قال \"ثلاث عورات لكم ليس عليكم ولا عليهم جناح بعدهن\" أي إذا دخلوا في حال غير هذه الأحوال فلا جناح عليكم في تمكينكم إياهم ولا عليهم إن رأوا شيئا من غير تلك الأحوال لأنه قد أذن لهم في الهجوم ولأنهم طوافون عليكم أي في الخدمة وغير ذلك. ويغتفر في الطوافين ما لا يغتفر في غيرهم ولهذا روى الإمام مالك وأحمد بن حنبل وأهل السنن أن النبي صلى الله عليه وسلم قال في الهرة: \"إنها ليست بنجسة إنها من الطوافين عليكم أو والطوافات\" ولما كانت هذه الآية محكمة ولم تنسخ بشيء وكان عمل الناس بها قليلا جدا أنكر عبدالله بن عباس ذلك على الناس كما قال ابن أبي حاتم حدثنا أبو زرعة حدثنا يحيى بن عبدالله بن بكير حدثني عبدالله بن لهيعة حدثني عطاء بن دينار عن سعيد بن جبير قال: قال ابن عباس ترك الناس ثلاث آيات فلم يعملوا بهن \"يا أيها الذين آمنوا ليستأذنكم الذين ملكت أيمانكم\" إلى آخر الآية والآية التي في سورة النساء \"وإذا حضر القسمة أولوا القربي\" الآية والآية التي في الحجرات \"إن أكرمكم عند الله أتقاكم\" وفي لفظ له أيضا من حديث إسماعيل بن مسلم وهو ضعيف عن عمرو بن دينار عن عطاء ابن أبي رباح عن ابن عباس قال: غلب الشيطان الناس على ثلاث آيات فلم يعملوا بهن \"يا أيها الذين آمنوا ليستأذنكم الذين ملكت أيمانكم\" إلى آخر الآية وروى أبو داود حدثنا ابن الصباح وابن سفيان وابن عبدة وهذا حديثه أخبرنا سفيان عن عبيد الله بن أبي يزيد سمع ابن عباس يقول: لم يؤمن بها أكثر الناس: آية الإذن وإني لآمر جاريتي هذه تستأذن علي قال أبو داود وكذلك رواه عطاء عن ابن عباس يأمر به وقال الثوري عن موسى بن أبي عائشة سألت الشعبي \"ليستأذنكم الذين ملكت أيمانكم\" قال: لم تنسخ قلت فإن الناس لا يعملون بها فقال: الله المستعان وقال ابن أبي حاتم حدثنا الربيع بن سليمان حدثنا ابن وهب أخبرنا سليمان بن بلال عن عمرو ابن أبي عمرو عن عكرمة عن ابن عباس أن رجلين سألاه عن الاستئذان في الثلاث عورات التي أمر الله بها في القرآن فقال ابن عباس: \"إن الله ستير يحب الستر كان الناس ليس لهم سطور على أبوابهم ولا حجال في بيوتهم فربما فاجأ الرجل خادمه أو ولده أو يتيمه في حجره وهو على أهله فأمرهم الله أن يستأذنوا في تلك العورات التي سمى الله ثم جاء الله بعد بالستور فبسط الله عليهم الرزق فاتخذوا الستور واتخذوا الحجال فرأى الناس أن ذلك قد كفاهم من الاستئذان الذي أمروا به\" وهذا إسناد صحيح إلى ابن عباس ورواه أبو داود عن القعنبي عن الدراوردي عن عمرو بن أبي عمرو به: وقال السدي كان أناس من الصحابة رضي الله عنهم يحبون أن يواقعوا نساءهم في هذه الساعات ليغتسلوا ثم يخرجوا إلى الصلاة فأمرهم الله أن يأمروا المملوكين والغلمان أن لا يدخلوا عليهم في تلك الساعات إلا بإذن وقال مقاتل بن حيان: بلغنا والله أعلم أن رجلا من الأنصار وامرأته أسماء بنت مرثد صنعا للنبي صلى الله عليه وسلم طعاما فجعل الناس يدخلون بغير إذن: فقالت أسماء يا رسول الله ما أقبح هذا إنه ليدخل على المرأة وزوجها وهما في ثوب واحد غلامهما بغير إذن فأنزل الله في ذلك \"يا أيها الذين آمنوا ليستأذنكم الذين ملكت أيمانكم\" إلى آخرها ومما يدل على أنها محكمة لم تنسخ قوله \"كذلك يبين الله لكم الآيات والله حكيم عليم\"."
    },
    {
      "ayah": 59,
      "surah": 24,
      "text": "يعني إذا بلغ الأطفال منكم الحلم الذين إنما كانوا يستأذنون في العورات الثلاث إذا بلغوا الحلم وجب عليهم أن يستأذنوا على كل حال يعني بالنسبة إلى أجانبهم وإلى الأحوال التي يكون الرجل على امرأته وإن لم يكن في الأحوال الثلاث.قال الأوزاعي عن يحيى بن أبي كثير إذا كان الغلام رباعيا فإنه يستأذن في العورات الثلاث على أبويه فإذا بلغ الحلم فليستأذن على كل حال وهكذا قال سعيد بن جبير وقال في قوله \"كما استأذن الذين من قبلهم\" يعني كما استأذن الكبار من ولد الرجل وأقاربه."
    },
    {
      "ayah": 6,
      "surah": 24,
      "text": "هذه الآية الكريمة فيها فرج للأزواج وزيادة مخرج إذا قذف أحدهم زوجته وتعسر عليه إقامة البينة أن يلاعنها كما أمر الله عز وجل وهو أن يحضرها إلى الإمام فيدعي عليها بما رماها به فيحلفه الحاكم أربع شهادات بالله في مقابلة أربعة شهداء إنه لمن الصادقين أي فيما رماها به من الزنا."
    },
    {
      "ayah": 60,
      "surah": 24,
      "text": "قال سعيد بن جبير ومقاتل بن حيان والضحاك وقتادة: هن اللواتي انقطع عنهن الحيض ويئسن من الولد \"اللاتي لا يرجون نكاحا\" أي لم يبق لهن تشوف إلى التزوج \"فليس عليهن جناح أن يضعن ثيابهن غير متبرجات بزينة\" أي ليس عليهم من الحجر في التستر كما على غيرهن من النساء قال أبو داود حدثنا أحمد بن محمد المروزي حدثني علي بن الحسين بن واقد عن أبيه عن يزيد النحوي عن عكرمة عن ابن عباس \"وقل للمؤمنات يغضضن من أبصارهن\" الآية فنسخ من ذلك واستثنى من ذلك \"القواعد من النساء اللاتي لا يرجون نكاحا\" الآية قال ابن مسعود في قوله \"فليس عليهن جناح أن يضعن ثيابهن\" قال: الجلباب أو الرداء وكذلك روي عن ابن عباس وابن عمر ومجاهد وسعيد بن جبير وأبي الشعثاء وإبراهيم النخعي والحسن وقتادة والزهري والأوزاعي وغيرهم وقال أبو صالح: تضع الجلباب وتقوم بين يدي الرجل في الدرع والخمار وقال سعيد بن جبير وغيره في قراءة عبدالله بن مسعود \"أن يضعن من ثيابهن\" وهو الجلباب من فوق الخمار فلا بأس أن يضعن عند غريب أو غيره بعد أن يكون عليها خمار صفيق وقال سعيد ابن جبير في الآية \"غير متبرجات بزينة\" يقول: لا يتبرجن بوضع الجلباب ليرى ما عليهن من الزينة وقال ابن أبي حاتم حدثنا أبي حدثنا هشام بن عبدالله حدثنا ابن المبارك حدثني سوار بن ميمون حدثنا طلحة بن عاصم عن أم المصاعن أنها قالت دخلت على عائشة رضي الله عنها فقلت يا أم المؤمنين ما تقولين في الخضاب والنفاض والصباغ والقرطين والخلخال وخاتم الذهب وثياب الرقاق فقالت: يا معشر النساء قصتكن كلها واحدة أحل الله لكن الزينة غير متبرجات أي لا يحل لكن أن يروا منكن محرما وقال السدي كان شريك لي يقال له مسلم وكان مولى لامرأة حذيفة بن اليمان فجاء يوما إلى السوق وأثر الحناء في يده فسألته عن ذلك فأخبرني أنه خضب رأس مولاته وهي امرأة حذيفة فأنكرت ذلك فقال إن شئت أدخلتك عليها فعلت نعم فأدخلني عليها فإذا هي امرأة جليلة فقلت لها إن مسلما حدثني أنه خضب رأسك فقالت نعم يا بني إني من القواعد اللاتي لا يرجون نكاحا وقد قال الله تعالى في ذلك ما سمعت وقوله \"وأن يستعففن خير لهن\" أي وترك وضعهن لثيابهن وإن كان جائزا خير وأفضل لهن والله سميع علم."
    },
    {
      "ayah": 61,
      "surah": 24,
      "text": "اختلف المفسرون رحمهم الله في المعنى الذي رفع لأجله الحرج عن الأعمى والأعرج والمريض ههنا فقال عطاء الخراساني وعبد الرحمن بن زيد بن أسلم يقال إنها نزلت في الجهاد وجعلوا هذه الآية ههنا كالتي في سورة الفتح وتلك فى الجهاد لا محالة أي أنهم لا إثم عليهم فى ترك الجهاد لضعفهم وعجزهم وكما قال تعالى في سورة براءة ليس على الضعفاء ولا على المرضى ولا على الذين لا يجدون ما ينفقون حرج إذا نصحوا لله ورسوله ما على المحسنين من سبيل والله غفور رحيم ولا على الذين إذا ما أتوك لتحملهم قلت لا أجد ما أحملكم عليه - إلى قوله - أن لا يجدوا ما ينفقون\" وقيل المراد ههنا أنهم كانوا يتحرجون من الأكل مع الأعمى لأنه لا يرى الطعام وما فيه من الطيبات فربما سبقه غيره إلى ذلك ولا مع الأعرج لأنه لا يتمكن من الجلوس فيقتات عليه جليسه والمريض لا يستوفي من الطعام كغيره فكرهوا أن يؤاكلوهم لئلا يظلموهم فأنزل الله هذه الآية رخصة في ذلك وهذا قول سعيد بن جبير ومقسم وقال الضحاك: كانوا قبل البعثة يتحرجون من الأكل مع هؤلاء تقذرا وتعززا ولئلا يتفضلوا عليهم فأنزل الله هذه الآية وقال عبد الرزاق أخبرنا معمر عن ابن أبي نجيح عن مجاهد في قوله تعالى \"ليس على الأعمى حرج\" الآية قال: كان الرجل يذهب بالأعمى أو بالأعرج أو بالمريض إلى بيت أبيه أو أخيه أو بيت أخته أو بيت عمته أو بيت خالته فكان الزمنى يتحرجون من ذلك يقولون إنما يذهبون بنا إلى بيوت عشيرتهم فنزلت هذه الآية رخصة لهم وقال السدي: كان الرجل يدخل بيت أبيه أو أخيه أو ابنه فتتحفه المرأة بشئ من الطعام فلا يأكل من أجل أن رب البيت ليس ثم فقال الله تعالى \"ليس على الأعمى حرج\" الآية وقوله تعالى \"ولا على أنفسكم أن تأكلوا من بيوتكم\" إنما ذكر هذا وهو معلوم ليعطف عليه غيره في اللفظ وليساوي به ما بعده في الحكم وتضمن هذا بيوت الأبناء لأنه لم ينص عليهم ولهذا استدل بهذا من ذهب إلى أن مال الولد بمنزله مال أبيه وقد جاء في المسند والسنن من غير وجه عن رسول الله صلى الله عليه وسلم أنه قال: \"أنت ومالك لأبيك\" وقوله: \"أو بيوت آبائكم أو بيوت أمهاتكم - إلى قوله - أو ما ملكتم مفاتحه\" هذا ظاهر وقد يستدل به من يوجب نفقة الأقارب بعضهم على بعض كما هو مذهب أبي حنيفة والإمام أحمد بن حنبل في المشهور عنهما وأما قوله \"أو ما ملكتم مفاتحه\" فقال سعيد بن جبير والسدي: هو خادم الرجل من عبد وقهرمان فلا بأس أن يأكل مما استودعه من الطعام بالمعروف وقال الزهري عن عروة عن عائشة رضي الله عنها قالت: كان المسلمون يذهبون في النفير مع رسول الله صلى الله عليه وسلم فيدفعون مفاتحهم إلى ضمنائهم ويقولون قد أحللنا لكم أن تأكلوا مما احتجتم إليه فكانوا يقولون إنه لا يحل لنا أن نأكل إنهم أذنوا لنا عن غير طيب أنفسهم وإنما نحن أمناء فأنزل الله \"أو ما ملكتم مفاتحه\" وقوله \"أو صديقكم\" أي بيوت أصدقائكم وأصحابكم فلا جناح عليكم في الأكل منها إذا علمتم أن ذلك لا يشق عليهم ولا يكرهون ذلك وقال قتادة إذا دخلت بيت صديقك فلا بأس أن تأكل بغير إذنه وقوله \"ليس عليكم جناح أن تأكلوا جميعا أو أشتاتا\" قال علي بن أبي طلحة عن ابن عباس في هذه الآية وذلك لما أنزل الله \"يا أيها الذين آمنوا لا تأكلوا أموالكم بينكم بالباطل\" قال المسلمون إن الله قد نهانا أن نأكل أموالنا بيننا بالباطل والطعام من أفضل الأموال فلا يحل لأحد منا أن يأكل عند أحد فكف الناس عن ذلك فأنزل الله \"ليس على الأعمى حرج - إلى قوله - أو صديقكم\" وكانوا أيضا يأنفون ويتحرجون إن يأكل الرجل الطعام وحده حتى يكون معه غيره فرخص الله لهم في ذلك فقال: \"ليس عليكم جناح أن تأكلوا جميعا أو أشتاتا\" وقال قتادة: كان هذا الحي من بني كنانة يرى أحدهم أن مخزاة عليه أن يأكل وحده في الجاهلية حتى إن كان الرجل ليسوق الذود الحفل وهو جائع حتى يجد من يؤاكله ويشاربه فأنزل الله \"ليس عليكم جناح أن تأكلوا جميعا أو أشتاتا\" فهذه رخصة من الله تعالى في أن يأكل الرجل وحده ومع الجماعة وإن كان الأكل مع الجماعة أبرك وأفضل كما رواه الإمام أحمد حدثنا يزيد بن عبد ربه حدثنا الوليد بن مسلم عن وحشي بن حرب عن أبيه عن جده أن رجلا قال للنبي صلى الله عليه وسلم إنا نأكل ولا نشبع قال: \"لعلكم تأكلون متفرقين اجتمعوا على طعامكم واذكروا اسم الله يبارك لكم فيه\" ورواه أبو داود وابن ماجه من حديث الوليد بن مسلم به وقد روى ابن ماجه أيضا من حديث عمرو بن دينار القهرماني عن سالم عن أبيه عن عمر عن رسول الله صلى الله عليه وسلم أنه قال: \"كلوا جميعا ولا تفرقوا فإن البركة مع الجماعة\" وقوله: \"فإذا دخلتم بيوتا فسلموا على أنفسكم\" قال سعيد بن جبير والحسن البصري وقتادة والزهري: يعني فليسلم بعضكم على بعض وقال ابن جريج أخبرني أبو الزبير سمعت جابر بن عبدالله يقول: إذا دخلت على أهلك فسلم عليهم تحية من عند الله مباركة طيبة قال ما رأيته إلا يوجبه قال ابن جريج وأخبرني زياد عن ابن طاوس أنه كان يقول: إذا دخل أحدكم بيته فليسلم قال ابن جريج قلت لعطاء أواجب إذا خرجت ثم دخلت أن أسلم عليهم ؟ قال لا ولا أوثر وجوبه عن أحد ولكن هو أحب إلي وما أدعه إلا ناسيا وقال مجاهد: إذا دخلت المسجد فقل السلام على رسول الله وإذا دخلت على أهلك فسلم عليهم وإذا دخلت بيتا ليس فيه أحد فقل السلام علينا وعلى عباد الله الصالحين وروى الثوري عن عبد الكريم الجزري عن مجاهد إذا دخلت بيتا ليس فيه أحد فقل بسم الله والحمد لله السلام علينا من ربنا السلام علينا وعلى عباد الله الصالحين; وقال قتادة: إذا دخلت على أهلك فسلم عليهم وإذا دخلت بيتا ليس فيه أحد فقل السلام علينا وعلى عباد الله الصالحين فإنه كان يؤمر بذلك وحدثنا أن الملائكة ترد عليه وقال الحافظ أبو بكر البزار حدثنا محمد بن المثنى حدثنا عويد بن أبي عمران الجوني عن أبيه عن أنس قال: أوصاني النبي صلى الله عليه وسلم بخمس خصال قال: \"يا أنس أسبغ الوضوء يزد في عمرك وسلم على من لقيك من أمتي تكثر حسناتك وإذا دخلت - يعني بيتك - فسلم على أهلك يكثر خير بيتك وصل صلاة الضحى فإنها صلاة الأوابين قبلك يا أنس أرحم الصغير ووقر الكبير تكن من رفقائي يوم القيامة\". وقوله \"تحية من عند الله مباركة طيبة\" قال محمد بن إسحاق حدثني داود بن الحصين عن عكرمة عن ابن عباس أنه كان يقول: ما أخذت التشهد إلا من كتاب الله سمعت الله يقول \"فإذا دخلتم بيوتا فسلموا على أنفسكم تحية من عند الله مباركة طيبة\" فالتشهد في الصلاة: التحيات المباركات الصلوات الطيبات لله أشهد أن لا إله إلا الله وأشهد أن محمدا عبده ورسوله السلام عليك أيها النبي ورحمة الله وبركاته السلام علينا وعلى عباد الله الصالحين ثم يدعو لنفسه ويسلم\" وهكذا رواه ابن أبي حاتم من حديث ابن إسحاق والذي في صحيح مسلم عن ابن عباس عن رسول الله صلى الله عليه وسلم يخالف هذا والله أعلم. وقوله \"كذلك يبين الله لكم الآيات لعلكم تعقلون\" لما ذكر تعالى ما فى السورة الكريمة من الأحكام المحكمة والشرائع المتقنة المبرمة نبه تعالى عباده على أنه يبين لعباده الآيات بيانا شافيا ليتدبروها ويتعقلوها لعلهم يعقلون."
    },
    {
      "ayah": 62,
      "surah": 24,
      "text": "وهذا أيضا أدب أرشد الله عباده المؤمنين إليه فكما أمرهم بالاستئذان عند الدخول كذلك أمرهم بالاستئذان عند الانصراف لا سيما إذا كانوا في أمر جامع مع الرسول صلوات الله وسلامه عليه من صلاة جمعة أو عيد جماعة أو اجتماع في مشورة ونحو ذلك أمرهم الله تعالى أن لا يتفرقوا عنه والحالة هذه إلا بعد استئذانه ومشاورته وإن من يفعل ذلك فإنه من المؤمنين الكاملين ثم أمر رسوله صلوات الله وسلامه عليه إذا استأذنه أحد منهم في ذلك أن يأذن له إن شاء ولهذا قال \"فأذن لمن شئت منهم واستغفر لهم\" الآية وقد قال أبو داود حدثنا أحمد بن حنبل ومسدد قالا حدثنا بشر هو ابن المفضل عن ابن عجلان عن سعيد المقبري عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم \"إذا أنتهى أحدكم إلى المجلس فليسلم فإذا أراد أن يقوم فليسلم فليست الأولى بأحق من الآخرة\" وهكذا رواه الترمذي والنسائي من حديث محمد بن عجلان به وقال الترمذي: حديث حسن."
    },
    {
      "ayah": 63,
      "surah": 24,
      "text": "قال الضحاك عن ابن عباس: كانوا يقولون يا محمد يا أبا القاسم فنهاهم الله عز وجل عن ذلك إعظاما لنبيه صلى الله عليه وسلم قال: فقولوا يا نبي الله يا رسول الله وهكذا قال مجاهد وسعيد بن جبير وقال قتادة: أمر الله أن يهاب نبيه صلى الله عليه وسلم وأن يبجل وأن يعظم وأن يُسود وقال مقاتل في قوله \"لا تجعلوا دعاء الرسول بينكم كدعاء بعضكم بعضا\" يقول لا تسموه إذا دعوتموه يا محمد ولا تقولوا يا ابن عبدالله ولكن شرفوه فقولوا يا نبي الله يا رسول الله وقال مالك عن زيد بن أسلم في قوله \"لا تجعلوا دعاء الرسول بينكم كدعاء بعضكم بعضا\" قال: أمرهم الله أن يشرفوه هذا قول وهو الظاهر من السياق كقوله تعالى \"يا أيها الذين آمنوا لا تقولوا راعنا\" إلى آخر الآية وقوله \"يا أيها الذين آمنوا لا ترفعوا أصواتكم فوق صوت النبي ولا تجهروا له بالقول كجهر بعضكم لبعض أن تحبط أعمالكم وأنتم لا تشعرون - إلى قوله - إن الذين ينادونك من وراء الحجرات أكثرهم لا يعقلون ولو أنهم صبروا حتى تخرج إليهم لكان خيرا لهم\" الآية فهذا كله من باب الأدب في مخاطبة النبي صلى الله عليه وسلم والكلام معه وعنده كما أمروا بتقديم الصدقة قبل مناجاته والقول الثاني في ذلك أن المعنى في \"لا تجعلوا دعاء الرسول بينكم كدعاء بعضكم بعضا\" أي لا تعتقدوا أن دعاءه على غيره كدعاء غيره فإن دعاءه مستجاب فاحذروا أن يدعو عليكم فتهلكوا حكاه ابن أبي حاتم عن ابن عباس والحسن البصري وعطية العوفي والله أعلم وقوله: \"قد يعلم الله الذين يتسللون منكم لواذا\" قال مقاتل ابن حيان هم المنافقون كان يثقل عليهم الحديث في يوم الجمعة ويعني بالحديث الخطبة فيلوذون ببعض أصحاب محمد صلى الله عليه وسلم حتى يخرجوا من المسجد وكان لا يصح للرجل أن يخرج من المسجد إلا بإذن من النبي صلى الله عليه وسلم فى يوم الجمعة بعدما يأخذ في الخطبة وكان إذا أراد أحدهم الخروج أشار بأصبعه إلى النبي صلى الله عليه وسلم فيأذن له من غير أن يتكلم الرجل لأن الرجل منهم كان إذا تكلم والنبي صلى الله عليه وسلم يخطب بطلت جمعته وقال السدي: كانوا إذا كانوا معه في جماعة لاذ بعضهم ببعض حثى يتغيبوا عنه فلا يراهم وقال قتادة في قوله \"قد يعلم الله الذين يتسللون منكم لواذا\" يعني لواذا عن نبي الله وعن كتابه وقال سفيان \"قد يعلم الله الذين يتسللون منكم لواذا\" قال من الصف وقال مجاهد فى الآية \"لواذا\" خلافا وقوله \"فليحذر الذين يخالفون عن أمره\" أي عن أمر رسول الله صلى الله عليه وسلم وهو سبيله ومنهاجه وطريقته وسنته وشريعته فتوزن الأقوال والأعمال بأقواله وأعماله فما وافق ذلك قبل وما خالفه فهو مردود على قائله وفاعله كائنا من كان كما ثبت فى الصحيحين وغيرهما عن رسول الله صلى الله عليه وسلم أنه قال: \"من عمل عملا ليس عليه أمرنا فهو رد\" أي فليحذر وليخش من خالف شريعة الرسول باطنا وظاهرا \"أن تصيبهم فتنة\" أي في قلوبهم من كفر أو نفاق أو بدعة \"أو يصيبهم عذاب أليم\" أي في الدنيا بقتل أو حد أو حبس أو نحو ذلك كما روى الإمام أحمد حدثنا عبد الرزاق حدثنا معمر عن همام بن منبه قال هذا ما حدثنا عن أبي هريرة قال قال رسول الله صلى الله عليه وسلم: \"مثلي ومثلكم كمثل رجل استوفد نارا فلما أضاءت ما حولها جعل الفراش وهذه الدواب اللائي يقعن في النار يقعن فيها وجعل يحجزهن ويغلبنه فيقتحمن فيها - قال - فذلك مثلي ومثلكم أنا آخذ بحجزكم عن النار هلم عن النار فتغلبوني وتقتحمون فيها\". أخرجاه من حديث عبد الرزاق."
    },
    {
      "ayah": 64,
      "surah": 24,
      "text": "يخبر تعالى أنه مالك السموات والأرض وأنه عالم الغيب والشهادة وهو عالم بما العباد عاملون في سرهم وجهرهم فقال \"قد يعلم ما أنتم عليه\" وقد للتحقيق كما قال قبلها \"قد يعلم الله الذين يتسللون منكم لواذا\" وقال تعالى: \"قد يعلم الله المعوقين منكم\" الآية وقال تعالى: \"قد سمع الله قول التي تجادلك\" الآية وقال: \"قد نعلم إنه ليحزنك الذي يقولون فإنهم لا يكذبونك ولكن الظالمين بآيات الله يجحدون\" وقال: \"قد نرى تقلب وجهك في السماء\" الآية فكل هذه الآيات فيها تحقيق الفعل بقد كقول المؤذن تحقيقا وثبوتا: قد قامت الصلاة قد قامت الصلاة فقوله تعالى: \"قد يعلم ما أنتم عليه\" أي هو عالم به مشاهد له لا يعزب عنه مثقال ذرة كما قال تعالى: \"وتوكل على العزيز الرحيم - إلى قوله - إنه هو السميع العليم\" وقوله \"وما تكون في شأن وما تتلو منه من قرآن ولا تعملون من عمل إلا كنا عليكم شهودا إذ تفيضون فيه وما يعزب عن ربك من مثقال ذرة في الأرض ولا في السماء ولا أصغر من ذلك ولا أكبر إلا في كتاب مبين\" وقال تعالى: \"أفمن هو قائم على كل نفس بما كسبت\" أي هو شهيد على عباده بما هم فاعلون من خير وشر وقال تعالى: \"ألا حين يستغشون ثيابهم يعلم ما يسرون وما يعلنون\" وقال تعالى: \"سواء منكم من أسر القول ومن جهر به\" الآية وقال تعالى: \"وما من دابة في الأرض إلا على الله رزقها ويعلم مستقرها ومستودعها كل فى كتاب مبين\" وقال: \"وعنده مفاتح الغيب لا يعلمها إلا هو ويعلم ما في البر والبحر وما تسقط من ورقة إلا يعلمها ولا حبة في ظلمات الأرض ولا رطب ولا يابس إلا في كتاب مبين\" والآيات والأحاديث في هذا كثيرة جدا وقوله \"ويوم يرجعون إليه\" أي ويوم يرجع الخلائق إلى الله وهو يوم القيامة\" فينبئهم بما عملوا\" أي يخبرهم بما فعلوا في الدنيا من جليل وحقير وصغير وكبير كما قال تعالى \" ينبأ الإنسان يومئذ بما قدم وأخر\" وقال: \"ووضع الكتاب فترى المجرمين مشفقين مما فيه ويقولون يا ويلتنا مال هذا الكتاب لا يغادر صغيرة ولا كبيرة إلا أحصاها ووجدوا ما عملوا حاضرا ولا يظلم ربك أحدا\" ولهذا قال ههنا \"ويوم يرجعون إليه فينبئهم بما عملوا والله بكل شيء عليم\". والحمد لله رب العالمين ونسأله التمام آخر تفسير سورة النور ولله الحمد والمنة."
    },
    {
      "ayah": 7,
      "surah": 24,
      "text": "فإذا قال ذلك بانت منه بنفس هذا اللعان عند الشافعي وطائفة كثيرة من العلماء وحرمت عليه أبدا ويعطيها مهرها ويتوجه عليها حد الزنا ولا يدرأ عنها العذاب إلا أن تلاعن فتشهد أربع شهادات بالله إنه لمن الكاذبين أي فيما رماها به."
    },
    { "ayah": 8, "surah": 24, "text": "يعني الحد." },
    {
      "ayah": 9,
      "surah": 24,
      "text": "فخصها بالغضب كما أن الغالب أن الرجل لا يتجشم فضيحة أهله ورميها بالزنا إلا وهو صادق معذور وهي تعلم صدقه فيما رماها به ولهذا كانت الخامسة في حقها أن غضب الله عليها والمغضوب عليه هو الذي يعلم الحق ثم يحيد عنه ثم ذكر تعالى رأفته بخلقه ولطفه بهم فيما شرع لهم من الفرج والمخرج من شدة ما يكون بهم من الضيق."
    }
  ]
}
