{
  "ayahs": [
    {
      "ayah": 1,
      "surah": 25,
      "text": "يقول تعالى حامدا لنفسه الكريمة على ما نزله على رسوله الكريم من القرآن العظيم كما قال تعالى \"الحمد لله الذي أنزل على عبده الكتاب ولم يجعل له عوجا قيما لينذر بأسا شديدا من لدنه ويبشر المؤمنين الذين يعملون الصالحات\" الآية وقال ههنا \"تبارك\" وهو تفاعل من البركة المستقرة الثابتة الدائمة \"الذي نزل الفرقان\" نزل فعل من التكرر والتكثر كقوله \"والكتاب الذي نزل على رسوله والكتاب الذي أنزل من قبل\" لأن الكتب المتقدمة كانت تنزل جملة واحدة والقرآن نزل منجما مفرقا مفصلا آيات بعد آيات وأحكاما بعد أحكام وسورا بعد سور وهذا أشد وأبلغ وأشد اعتناء بمن أنزل عليه كما قال في أثناء هذه السورة \"وقال الذين كفروا لولا نزل عليه القرآن جملة واحدة كذلك لنثبت به فؤادك ورتلناه ترتيلا ولا يأتونك بمثل إلا جئناك بالحق وأحسن تفسيرا\" ولهذا سماه ههنا الفرقان لأنه يفرق بين الحق والباطل والهدى والضلال والغي والرشاد والحلال والحرام وقوله \"على عبده\" هذه صفه مدح وثناء لأنه أضافه إلى عبوديته كما وصفه بها في أشرف أحواله وهي ليلة الإسراء فقال \"سبحان الذي أسرى بعبده ليلا\" وكما وصفه بذلك في مقام الدعوة إليه \"وأنه لما قام عبدالله يدعوه كادوا يكونون عليه لبدا\" وكذلك وصفه عند إنزال الكتاب عليه ونزول الملك إليه \"تبارك الذي نزل الفرقان على عبده ليكون للعالمين نذيرا\" وقوله \"ليكون للعالمين نذيرا\" أي إنما خصه بهذا الكتاب المفصل العظيم المبين المحكم الذي \"لا يأتيه الباطل من بين يديه ولا من خلفه تنزيل من حكيم حميد\" الذي جعله فرقانا عظيما ليخصه بالرسالة إلى من يستظل بالخضراء ويستقل على الغبراء كما قال صلى الله عليه وسلم \"بعثت إلى الأحمر والأسود\" وقال \"إني أعطيت خمسا لم يعطن أحد من الأنبياء قبلي\" فذكر منهن \"أنه كان النبي يبعث إلى قومه خاصة وبعثت إلى الناس عامة\" كما قال تعالى \"قل يا أيها الناس إني رسول الله إليكم جميعا\" الآية أي الذي أرسلني هو مالك السموات والأرض الذي يقول للشيء كن فيكون وهو الذي يحيى ويميت."
    },
    {
      "ayah": 10,
      "surah": 25,
      "text": "ثم قال تعالى مخبرا نبيه أنه إن شاء لأتاه خيرا مما يقولون في الدنيا وأفضل وأحسن فقال \"تبارك الذي إن شاء جعل لك خيرا من ذلك\" الآية. قال مجاهد يعني في الدنيا قال وقريش يسمون كل بيت من حجارة قصرا كبيرا كان أو صغيرا قال سفيان الثوري عن حبيب بن أبي ثابت عن خيثمة قيل للنبي صلى الله عليه وسلم إن شئت أن نعطيك خزائن الأرض ومفاتيحها ما لم نعطه نبيا قبلك ولا نعطي أحدا من بعدك ولا ينقص ذلك مما لك عند الله فقال \"اجمعوها لي في الآخرة\" فأنزل الله عز وجل في ذلك \"تبارك الذي إن شاء جعل لك خيرا من ذلك\" الآية."
    },
    {
      "ayah": 11,
      "surah": 25,
      "text": "وقوله \"بل كذبوا بالساعة\" أي إنما يقول هؤلاء هكذا تكذيبا وعنادا لا أنهم يطلبون ذلك تبصرا واسترشادا بل تكذيبهم بيوم القيامة يحملهم على قول ما يقولونه من هذه الأقوال \"وأعتدنا\" أي أرصدنا \"لمن كذب بالساعة سعيرا\" أي عذابا أليما حارا لا يطاق في نار جهنم قال الثوري عن سلمة بن كهيل عن سعيد بن جبير \"السعير\" واد من قيح جهنم."
    },
    {
      "ayah": 12,
      "surah": 25,
      "text": "وقوله \"إذا رأتهم\" أي جهنم \"من مكان بعيد\" يعني في مقام المحشر قال السدي من مسيرة مائة عام \"سمعوا لها تغيظا وزفيرا\" أي حنقا عليهم كما قال تعالى \"إذا ألقوا فيها سمعوا لها شهيقا وهي تفور تكاد تميز من الغيظ\" أي يكاد ينفصل بعضها من بعض من شدة غيظها على من كفر بالله وروى ابن أبي حاتم حدثنا إدريس ابن حاتم بن الأخنف الواسطي أنه سمع محمد بن الحسن الواسطي عن أصبغ بن زيد عن خالد بن كثير عن خالد ابن دريك بإسناده عن رجل من أصحاب النبي صلى الله عليه وسلم قال: قال رسول الله صلى الله عليه وسلم \"من يقل علي ما لم أقل أو ادعى إلى غير والديه أو انتمى إلى غير مواليه فليتبوأ مقعده من النار- وفي رواية - فليتبوأ بين عيني جهنم مقعدا\" قيل يا رسول الله وهل لها من عينين؟. قال أما سمعتم الله يقول \"إذا رأتهم من مكان بعيد\" الآية ورواه ابن جرير عن محمد ابن خداش عن محمد بن يزيد الواسطي به وقال أيضا حدثنا أبي حدثنا علي بن محمد الطنافسي حدثنا أبو بكر ابن عياش عن عيسى بن سليم عن أبي وائل قال خرجنا مع عبدالله يعني ابن مسعود ومعنا الربيع بن خيثم فمروا على حداد فقام عبدالله ينظر إلى حديدة في النار ونظر الربيع بن خيثم إليها فتمايل الربيع ليسقط فمر عبدالله على أتون على شاطئ الفرات فلما رآه عبدالله والنار تلتهب في جوفه قرأ هذه الآية \"إذا رأتهم من مكان بعيد سمعوا لها تغيظا وزفيرا\" فصعق يعني الربيع وحملوه إلى أهل بيته فرابطه عبدالله إلى الظهر فلم يفق رضي الله عنه وحدثنا أبي حدثنا عبدالله بن رجاء حدثنا إسرائيل عن أبي يحيى عن مجاهد عن ابن عباس قال: إن العبد ليجر إلى النار فتشهق إليه شهقة البغلة إلى الشعير ثم تزفر زفرة لا يبقى أحد إلا خاف هكذا رواه ابن أبي حاتم بإسناده مختصرا وقد رواه الإمام أبو جعفر بن جرير حدثنا أحمد بن إبراهيم الدورقي حدثنا عبيدالله بن موسى أخبرنا إسرائيل عن أبي يحيى عن مجاهد بإسناده إلى ابن عباس قال: إن الرجل ليجر إلى النار فتنزوي وتنقبض بعضها إلى بعض فيقول لها الرحمن ما لك ؟ قالت إنه يستجير مني فيقول أرسلوا عبدي وإن الرجل ليجر إلى النار فيقول يارب ما كان هذا الظن بك فيقول فما كان ظنك ؟ فيقول أن تسعني رحمتك فيقول أرسلوا عبدي وإن الرجل ليجر إلى النار فتشهق إليه النار شهقة البغلة إلى الشعير وتزفر زفرة لا يبقى أحد إلا خاف وهذا إسناد صحيح وقال عبدالرزاق أخبر معمر عن منصور عن مجاهد عن عبيد بن عمير في قوله \"سمعوا لها تغيظا وزفيرا\" قال إن جهنم لتزفر زفرة لا يبقى ملك مقرب ولا نبي مرسل إلا خر لوجهه ترتعد فرائصه حتى إن إبراهيم عليه السلام ليجثو على ركبتيه ويقول: رب لا أسألك اليوم إلا نفسي."
    },
    {
      "ayah": 13,
      "surah": 25,
      "text": "وقوله \"وإذا ألقوا منها مكانا ضيقا مقرنين\" قال قتادة عن أبي أيوب عن عبدالله بن عمرو قال: مثل الزج في الرمح أي من ضيقه. وقال عبدالله بن وهب أخبرني نافع بن يزيد عن يحيى بن أبي أسيد يرفع الحديث إلى رسول الله صلى الله عليه وسلم عن قول الله \"وإذا ألقوا منها مكانا ضيقا مقرنين\" قال \"والذي نفسي بيده إنهم ليستكرهون في النار كما يستكره الوتد في الحائط\" وقوله \"مقرنين\" قال أبو صالح يعني مكتفين \"دعوا هنالك ثبورا\" أي بالويل والحسرة والخيبة."
    },
    {
      "ayah": 14,
      "surah": 25,
      "text": "\"لا تدعوا اليوم ثبورا واحدا\" الآية روى الإمام أحمد حدثنا عفان حدثنا حماد بن سلمة عن علي بن يزيد عن أنس بن مالك أن رسول الله صلى الله عليه وسلم قال \"أول من يكسى حلة من النار إبليس فيضعها على حاجبيه ويسحبها من خلفه وذريته من بعده وهو ينادي يا ثبوراه وينادون يا ثبورهم حتى يقفوا على النار فيقول يا ثبوراه ويقولون يا ثبورهم فيقال لهم \"لا تدعوا اليوم ثبورا واحدا وادعوا ثبورا كثيرا\" لم يخرجه أحد من أصحاب الكتب الستة ورواه ابن أبي حاتم عن أحمد ابن سنان عن عفان به ورواه ابن جرير من حديث حماد بن سلمة به وقال العوفي عن ابن عباس في قوله \"لا تدعوا اليوم ثبورا واحدا\" الآية أي لا تدعوا اليوم ويلا واحدا وادعوا ويلا كثيرا وقال الضحاك الثبور الهلاك والأظهر أن الثبور يجمع الهلاك والويل والخسار والدمار كما قال موسى لفرعون \"وإني لأظنك يا فرعون مثبورا\" أي هالكا قال عبيدالله بن الزبعري: إذ أباري الشيطان في سنن الغـ ـي ومن مال ميله مثبور"
    },
    {
      "ayah": 15,
      "surah": 25,
      "text": "يقول تعالى: يا محمد هذا الذي وصفناه لك من حال الأشقياء الذين يحشرون على وجوههم إلى جهنم فتلقاهم بوجه عبوس وتغيظ وزفير ويلقون في أماكنها الضيق مقرنين لا يستطيعون حراكا ولا استنصارا ولا فكاكا مما هم فيه أهذا خير أم جنة الخلد التي وعدها الله المتقين من عباده التي أعدها لهم وجعلها لهم جزاء ومصيرا على ما أطاعوه في الدنيا وجعل مآلهم إليها."
    },
    {
      "ayah": 16,
      "surah": 25,
      "text": "\"لهم فيها ما يشاءون\" من الملاذ من مآكل ومشارب وملابس ومساكن ومراكب ومناظر وغير ذلك مما لا عين رأت ولا أذن سمعت ولا خطر على قلب أحد وهم في ذلك خالدون أبدا دائما سرمدا بلا انقطاع ولا زوال ولا انقضاء ولا يبغون عنها حولا وهذا من وعد الله الذي تفضل به عليهم وأحسن به إليهم ولهذا قال \"كان على ربك وعدا مسئولا\" أي لا بد أن يقع وأن يكون كما حكاه أبو جعفر بن جرير عن بعض علماء العربية أن معنى قوله \"وعدا مسئولا\" أي وعدا واجبا وقال ابن جريج عن عطاء عن ابن عباس \"كان على ربك وعدا مسئولا\" يقول فسألوا الذي وعدهم وتنجزوه وقال محمد بن كعب القرظي في قوله \"كان على ربك وعدا مسئولا\" إن الملائكة تسأل لهم ذلك \"ربنا وأدخلهم جنات عدن التي وعدتهم\" وقال أبو حازم إذا كان يوم القيامة قال المؤمنون ربنا عملنا لك بالذي أمرتنا فأنجز لنا ما وعدتنا فذلك قوله \"وعدا مسئولا\" وهذا المقام في هذه السورة من ذكر النار ثم التنبيه على حال أهل الجنة كما ذكر تعالى في سورة الصافات حال أهل الجنة وما فيها من النضرة والحبور ثم قال \"أذلك خير نزلا أم شجرة الزقوم إنا جعلناها فتنة للظالمين إنها شجرة تخرج في أصل الجحيم طلعها كأنه رءوس الشياطين فإنهم لآكلون منها فمالئون منها البطون ثم إن لهم عليها لشوبا من حميم ثم إن مرجعهم لإلى الجحيم إنهم ألفوا آباءهم ضالين فهم على آثارهم يهرعون\"."
    },
    {
      "ayah": 17,
      "surah": 25,
      "text": "يقول تعالى مخبرا عما يقع يوم القيامة من تقريع الكفار في عبادتهم من عبدوا من دون الله من الملائكة وغيرهم فقال \"ويوم يحشرهم وما يعبدون من دون الله\" قال مجاهد هو عيسى والعزير والملائكة \"فيقول أأنتم أضللتم عبادي هؤلاء\" الآية أي فيقول تبارك وتعالى للمعبودين أأنتم دعوتم هؤلاء إلى عبادتكم من دوني أم هم عبدوكم من تلقاء أنفسهم من غير دعوة منكم لهم كما قال الله تعالى \"وإذ قال الله يا عيسى ابن مريم أأنت قلت للناس أتخذوني وأمي إلهين من دون الله قال سبحانك ما يكون لي أن أقول ما ليس لي بحق إن كنت قلته فقد علمته تعلم ما في نفسي ولا أعلم ما في نفسك إنك أنت علام الغيوب ما قلت لهم إلا ما أمرتني به\" الآية."
    },
    {
      "ayah": 18,
      "surah": 25,
      "text": "ولهذا قال تعالى مخبرا عما يجيب به المعبودون يوم القيامة \"قالوا سبحانك ما كان ينبغي لنا أن نتخذ من دونك من أولياء\" قرأ الأكثرون بفتح النون من قوله \"نتخذ من دونك من أولياء\" أي ليس للخلائق كلهم أن يعبدوا أحدا سواك لا نحن ولا هم فنحن ما دعوناهم إلى ذلك بل هم فعلوا ذلك من تلقاء أنفسهم من غير أمرنا ولا رضانا ونحن برآء منهم ومن عبادتهم كما قال تعالى \"ويوم يحشرهم جميعا ثم يقول للملائكة أهؤلاء إياكم كانوا يعبدون قالوا سبحانك\" الآية وقرأ آخرون \"ما كان ينبغي لنا أن نتخذ من دونك من أولياء\" أي ما ينبغي لأحد أن يعبدنا فإنا عبيد لك فقراء إليك وهي قريبة المعنى من الأولى \"ولكن متعتهم وآباءهم\" أي طال عليهم العمر حتى نسوا الذكر أي نسوا ما أنزلته إليهم على ألسنة رسلك من الدعوة إلى عبادتك وحدك لا شريك لك \"وكانوا قوما بورا\" قال ابن عباس أي هلكى وقال الحسن البصري ومالك عن الزهري أي لا خير فيهم وقال ابن الزبعري حين أسلم: يا رســول المليك إن لسـاني راتق ما فتقت إذ أنا بور إذ أباري الشيطان في سنن ال غي ومن مال ميـله مثبور"
    },
    {
      "ayah": 19,
      "surah": 25,
      "text": "قال الله تعالى \"فقد كذبوكم بما تقولون\" أي فقد كذبكم الذين عبدتم من دون الله فيما زعمتم أنهم لكم أولياء وأنهم يقربونكم إلى الله زلفى كقوله تعالى \"ومن أضل ممن يدعو من دون الله من لا يستجيب له إلى يوم القيامة وهم عن دعائهم غافلون وإذا حشر الناس كانوا لهم أعداء وكانوا بعبادتهم كافرين\" وقوله \"فما تستطيعون صرفا ولا نصرا\" أي لا يقدرون على صرف العذاب عنهم ولا الانتصار لأنفسهم \"ومن يظلم منكم\" أي يشرك بالله \"نذقه عذابا كبيرا\"."
    },
    {
      "ayah": 2,
      "surah": 25,
      "text": "وهكذا قال ههنا \"الذي له ملك السموات والأرض ولم يتخذ ولدا ولم يكن له شريك في الملك\" ونزه نفسه عن الولد وعن الشريك ثم أخبر أنه \"خلق كل شيء فقدره تقديرا\" أي كل شيء مما سواه مخلوق مربوب وهو خالق كل شيء وربه ومليكه وإلهه وكل شيء تحت قهره وتدبيره وتسخيره وتقديره."
    },
    {
      "ayah": 20,
      "surah": 25,
      "text": "يقول تعالى مخبرا عن جميع من بعثه من الرسل المتقدمين أنهم كانوا يأكلون الطعام ويحتاجون إلى التغذي به ويمشون في الأسواق للتكسب والتجارة وليس ذلك بمناف لحالهم ومنصبهم فإن الله تعالى جعل لهم من السمات الحسنة والصفات الجميلة والأقوال الفاضلة والأعمال الكاملة والخوارق الباهرة والأدلة الظاهرة ما يستدل به كل ذي لب سليم وبصيرة مستقيمة على صدق ما جاءوا به من الله ونظير هذه الآية الكريمة قوله تعالى \"وما أرسلنا من قبلك إلا رجالا نوحي إليهم من أهل القرى\" وقوله: \"وما جعلناهم جسدا لا يأكلون الطعام\" الآية وقوله تعالى: \"وجعلنا بعضكم لبعض فتنة أتصبرون\" أي اختبرنا بعضكم ببعض وبلونا بعضكم ببعض لنعلم من يطيع ممن يعصي ولهذا قال \"أتصبرون وكان ربك بصيرا\" أي بمن يستحق أن يوحى إليه كما قال تعالى: \"الله أعلم حيث يجعل رسالته\" ومن يستحق أن يهديه الله لما أرسلهم به ومن لا يستحق ذلك وقال محمد بن إسحاق في قوله: \"وجعلنا بعضكم لبعض فتنة أتصبرون\" قال: يقول الله لو شئت أن أجعل الدنيا مع رسلي فلا يخالفون لفعلت ولكني قد أردت أن أبتلي العباد بهم وأبتليكم بهم وفي صحيح مسلم عن عياض بن حمار عن رسول الله صلى الله عليه وسلم \"يقول الله تعالى إني مبتليك ومبتلي بك\" وفي المسند عن رسول الله صلى الله عليه وسلم \"لو شئت لأجرى الله معي جبال الذهب والفضة\" وفي الصحيح أنه عليه أفضل الصلاة والسلام خير بين أن يكون نبيا ملكا أو عبدا رسولا فاختار أن يكون عبدا رسولا."
    },
    {
      "ayah": 21,
      "surah": 25,
      "text": "يقول تعالى مخبرا عن تعنت الكفار في كفرهم وعنادهم في قولهم: \"لولا أنزل علينا الملائكة\" أي بالرسالة كما تنزل على الأنبياء كما أخبر الله عنهم في الآية الأخرى \"قالوا لن نؤمن حتى نؤتى مثل ما أوتي رسل الله\" ويحتمل أن يكون مرادهم ههنا \"لولا أنزل علينا الملائكة\" فنراهم عيانا فيخبرونا أن محمدا رسول الله كقولهم \"حتى تأتي بالله والملائكة قبيلا\" وقد تقدم تفسيرها في سورة سبحان ولهذا قالوا: \"أو نرى ربنا\" ولهذا قال الله تعالى \"لقد استكبروا في أنفسهم وعتوا عتوا كبيرا\" وقد قال تعالى: \"ولو أننا نزلنا إليهم الملائكة وكلمهم الموتي\" الآية."
    },
    {
      "ayah": 22,
      "surah": 25,
      "text": "وقوله تعالى: \"يوم يرون الملائكة لا بشرى يومئذ للمجرمين ويقولون حجرا محجورا\" أي هم لا يرون الملائكة في يوم خير لهم بل يوم يرونهم لا بشرى يومئذ لهم وذلك يصدق على وقت الإحتضار حين تبشرهم الملائكة بالنار والغضب من الجبار فتقول الملائكة للكافر عند خروج روحه: أخرجي أيتها النفس الخبيثة في الجسد الخبيث أخرجي إلى سموم وحميم وظل من يحموم فتأبى الخروج وتتفرق في البدن فيضربونه كما قال الله تعالى \"ولو ترى إذ يتوفى الذين كفروا الملائكة يضربون وجوههم وأدبارهم\" الآية وقال تعالى: \"ولو ترى إذ الظالمون في غمرات الموت والملائكة باسطو أيديهم\" أي بالضرب \"أخرجوا أنفسكم اليوم تجزون عذاب الهون بما كنتم تقولون على الله غير الحق وكنتم عن آياته تستكبرون\" ولهذا قال في هذه الآية الكريمة \"يوم يرون الملائكة لا بشرى يومئذ للمجرمين\" وهذا بخلاف حال المؤمنين حال احتضارهم فإنهم يبشرون بالخيرات وحصول المسرات قال الله تعالى: \"إن الذين قالوا ربنا الله ثم استقاموا تتنزل عليهم الملائكة أن لا تخافوا ولا تحزنوا وأبشروا بالجنة التي كنتم توعدون نحن أولياؤكم في الحياة الدنيا وفي الآخرة ولكم فيها ما تشتهي أنفسكم ولكم فيها ما تدعون نزلا من غفور رحيم\" وفي الحديث الصحيح عن البراء بن عازب: أن الملائكة تقول لروح المؤمن اخرجي أيتها النفس الطيبة في الجسد الطيب كنت تعمرينه اخرجي إلى روح وريحان ورب غير غضبان وقد تقدم الحديث في سورة إبراهيم عند قوله تعالى: \"يثبت الله الذين آمنوا بالقول الثابت في الحياة الدنيا وفي الآخرة ويضل الله الظالمين ويفعل الله ما يشاء\" وقال آخرون: بل المراد بقوله: \"يوم يرون الملائكة لا بشرى\" يعني يوم القيامة. قاله مجاهد والضحاك وغيرهما ولا منافاة بين هذا وما تقدم فإن الملائكة في هذين اليومين يوم الممات ويوم المعاد تتجلى للمؤمنين وللكافرين فتبشر المؤمنين بالرحمة والرضوان وتخبر الكافرين بالخيبة والخسران فلا بشرى يومئذ للمجرمين \"ويقولون حجرا محجورا\" أي وتقول الملائكة للكافرين حرام محرم عليكم الفلاح اليوم وأصل الحجر المنع ومنه يقال حجر القاضي على فلان إذا منعه التصرف إما لفلس أو سفه أو صغر أو نحو ذلك ومنه سمي الحجر عند البيت الحرام لأنه يمنع الطواف أن يطوفوا فيه وإنما يطاف من ورائه ومنه يقال للعقل حجر لأنه يمنع صاحبه عن تعاطي ما لا يليق والغرض أن الضمير في قوله: \"ويقولون\" عائد على الملائكة هذا قول مجاهد وعكرمة والحسن والضحاك وقتادة وعطية العوفي وعطاء الخراساني وخصيف وغير واحد واختاره ابن جرير. وقال ابن أبي حاتم حدثنا أبي حدثنا أبو نعيم حدثنا موسى يعني ابن قيس عن عطية العوفي عن أبي سعيد الخدري في الآية \"ويقولون حجرا محجورا\" قال حراما محرما أن يبشر بما يبشر به المتقون وقد حكى ابن جرير عن ابن جريج أنه قال ذلك من كلام المشركين \"يوم يرون الملائكة\" أي يتعوذون من الملائكة وذلك أن العرب كانوا إذا نزل بأحدهم نازلة أو شدة يقول \"حجرا محجورا\" وهذا القول وإن كان له مأخذ ووجه ولكنه بالنسبة إلى السياق بعيد لا سيما وقد نص الجمهور على خلافه ولكن قد روى ابن أبي نجيح عن مجاهد أنه قال في قوله: \"حجرا محجورا\" أي عوذا معاذا فيحتمل أنه أراد ما ذكره ابن جريج ولكن في رواية ابن أبي حاتم عن ابن أبي نجيح عن مجاهد أنه قال \"حجرا محجورا\" عوذا معاذا الملائكة تقول ذلك فالله أعلم."
    },
    {
      "ayah": 23,
      "surah": 25,
      "text": "وقوله تعالى: \"وقدمنا إلى ما عملوا من عمل\" الآية هذا يوم القيامة حين يحاسب الله العباد على ما عملوه من الخير والشر فأخبر أنه لا يحصل لهؤلاء المشركين من الأعمال التي ظنوا أنها منجاة لهم شيء وذلك لأنها فقدت الشرط الشرعي إما الإخلاص فيها وإما المتابعة لشرع الله فكل عمل لا يكون خالصا وعلى الشريعة المرضية فهو باطل فأعمال الكفار لا تخلو من واحد من هذين وقد تجمعهما معا فتكون أبعد من القبول حينئذ ولهذا قال تعالى: \"وقدمنا إلى ما عملوا من عمل فجعلناه هباء منثورا\" قال مجاهد والثوري \"وقدمنا\" أي عمدنا وكذا قال السدي وبعضهم يقول أتينا عليه وقوله تعالى: \"فجعلناه هباء منثورا\" قال سفيان الثوري عن أبي إسحاق عن الحارث عن علي رضي الله عنه في قوله: \"هباء منثورا\" قال شعاع الشمس إذا دخل الكوة وكذا روي من غير هذا الوجه عن علي وروي مثله عن ابن عباس ومجاهد وعكرمة وسعيد بن جبير والسدي والضحاك وغيرهم وكذا قال الحسن البصري هو الشعاع في كوة أحدكم ولو ذهب يقبض عليه لم يستطع. وقال علي بن أبي طلحة عن ابن عباس \"هباء منثورا\" قال هو الماء المهراق وقال أبو الأحوص عن أبي إسحاق عن الحارث عن علي \"هباء منثورا\" قال الهباء وهج الدواب وروي مثله عن ابن عباس أيضا والضحاك وقاله عبد الرحمن بن زيد بن أسلم وقال قتادة في قوله: \"هباء منثورا\" قال أما رأيت يبس الشجر إذا ذرته الريح ؟ فهو ذلك الورق وقال عبدالله بن وهب أخبرني عاصم بن حكيم عن أبي سريع الطائي عن عبيد بن يعلى قال وإن الهباء الرماد إذا ذرته الريح وحاصل هذه الأقوال التنبيه على مضمون الآية وذلك أنهم عملوا أعمالا اعتقدوا أنها على شيء فلما عرضت على الملك الحكم العدل الذي لا يجور ولا يظلم أحدا إذا إنها لا شيء بالكلية وشبهت في ذلك بالشيء التافه الحقير المتفرق الذي لا يقدر صاحبه منه على شيء بالكلية كما قال تعالى: \"مثل الذين كفروا بربهم أعمالهم كرماد اشتدت به الريح\" الآية وقال تعالى: \"يا أيها الذين آمنوا لا تبطلوا صدقاتكم بالمن والأذى - إلى قوله تعالى - لا يقدرون على شيء مما كسبوا\" وقال تعالى: \"والذين كفروا أعمالهم كسراب بقيعة يحسبه الظمآن ماء حتى إذا جاءه لم يجده شيئا\" وتقدم الكلام على تفسير ذلك ولله الحمد والمنة."
    },
    {
      "ayah": 24,
      "surah": 25,
      "text": "وقوله تعالى: \"أصحاب الجنة يومئذ خير مستقرا وأحسن مقيلا\" أي يوم القيامة \"لا يستوي أصحاب النار وأصحاب الجنة أصحاب الجنة هم الفائزون\" وذلك أن أهل الجنة يصيرون إلى الدرجات العاليات والغرقات الآمنات فهم في مقام أمين حسن المنظر طيب المقام \"خالدين فيها حسنت مستقرا ومقاما\" وأهل النار يصيرون إلى الدركات السافلات والحسرات المتتابعات وأنواع العذاب والعقوبات \"إنها ساءت مستقرا ومقاما\" أي بئس المنزل منظرا وبئس المقيل مقاما ولهذا قال تعالى: \"أصحاب الجنة يومئذ خير مستقرا وأحسن مقيلا\" أي بما عملوه من الأعمال المتقبلة نالوا ما نالوا وصاروا إلى ما صاروا إليه بخلاف أهل النار فإنهم ليس لهم عمل واحد يقتضي دخول الجنة لهم والنجاة من النار فنبه تعالى بحال السعداء على حال الأشقياء وأنه لا خير عندهم بالكلية فقال تعالى: \"أصحاب الجنة يومئذ خير مستقرا وأحسن مقيلا\" قال الضحاك عن ابن عباس: إنما هي ساعة فيقيل أولياء الله على الأسرة مع الحور العين ويقيل أعداء الله مع الشياطين مقرنين وقال سعيد بن جبير: يفرغ الله من الحساب نصف النهار فيقيل أهل الجنة في الجنة وأهل النار في النار قال الله تعالى: \"أصحاب الجنة يومئذ خير مستقرا وأحسن مقيلا\" وقال عكرمة: إني لأعرف الساعة التي يدخل فيها أهل الجنة الجنة وأهل النار النار وهي الساعة التي تكون في الدنيا عند ارتفاع الضحى الأكبر إذا أنقلب الناس إلى أهليهم للقيلولة فينصرف أهل النار إلى النار وأما أهل الجنة فينطلق بهم إلى الجنة فكانت قيلولتهم في الجنة وأطعموا كبد حوت فأشبعهم كلهم وذلك قوله: \"أصحاب الجنة يومئذ خير مستقرا وأحسن مقيلا\" وقال سفيان عن ميسرة عن المنهال عن أبي عبيدة عن عبدالله بن مسعود قال: لا ينتصف النهار حتى يقبل هؤلاء وهؤلاء ثم قرأ \"أصحاب الجنة يومئذ خير مستقرا وأحسن مقيلا\" وقرأ \"ثم إن مرجعهم لإلى الجحيم\" وقال العوفي عن ابن عباس في قوله \"أصحاب الجنة يومئذ خير مستقرا وأحسن مقيلا\" قال قالوا في الغرف من الجنة وكان حسابهم إذ عرضوا على ربهم عرضة واحدة وذلك الحساب اليسير وهو مثل قوله تعالى: \"فأما من أوتي كتابه بيمينه فسوف يحاسب حسابا يسيرا وينقلب إلى أهله مسرورا\" وقال قتادة \"خير مستقرا وأحسن مقيلا\" مأوى ومنزلا وقال قتادة وحدث صفوان بن محرز أنه قال: يجاء برجلين يوم القيامة أحدهما كان ملكا في الدنيا إلى الحمرة والبياض فيحاسب فإذا عبد لم يعمل خيرا قط فيؤمر به إلى النار والآخر كان صاحب كساء في الدنيا فيحاسب فيقول يارب ما أعطيتني من شيء فتحاسبني به فيقول اللهُ: صدق عبدي فأرسلوه فيؤمر به إلى الجنة ثم يتركان ما شاء الله ثم يدعى صاحب النار فإذا هو مثل الحممة السوداء فيقال له كيف وجدت ؟ فيقول شر مقيل فيقال له عد ثم يدعى بصاحب الجنة فإذا هو مثل القمر ليلة البدر فيقال له كيف وجدت؟ فيقول رب خير مقيل فيقال له عد. رواها ابن أبي حاتم كلها وقال ابن جرير: حدثني يونس أنبأنا ابن وهب أنبأنا عمرو بن الحارث أن سعيدا الصواف حدثه أنه بلغه أن يوم القيامة يقصر على المؤمن حتى يكون كما بين العصر إلى غروب الشمس وأنهم يتقلبون في رياض الجنة حتى يفرغ من الناس وذلك قوله تعالى: \"أصحاب الجنة يومئذ خير مستقرا وأحسن مقيلا\"."
    },
    {
      "ayah": 25,
      "surah": 25,
      "text": "يخبر تعالى عن هول يوم القيامة وما يكون فيه من الأمور العظيمة فمنها انشقاق السماء وتفطرها وانفراجها بالغمام وهو ظلل النور العظيم الذي يبهر الأبصار ونزول ملائكة السموات يومئذ فيحيطون بالخلائق في مقام المحشر ثم يجيء الرب تبارك وتعالى لفصل القضاء. قال مجاهد وهذا كما قال تعالى: \"هل ينظرون إلا أن يأتيهم الله في ظلل من الغمام والملائكة\" الآية قال ابن أبي حاتم حدثنا محمد بن عمار بن الحارث حدثنا مؤمل حدثنا حماد بن سلمة عن علي بن زيد عن يوسف بن مهران عن ابن عباس أنه قرأ هذه الآية \"ويوم تشقق السماء بالغمام ونزل الملائكة تنزيلا\" قال ابن عباس رضي الله عنهما يجمع الله تعالى الخلق يوم القيامة في صعيد واحد الجن والإنس والبهائم والسباع والطير وجميع الخلق فتنشق السماء الدنيا فينزل أهلها وهم أكثر من الجن والإنس ومن جميع الخلق فيحيطون بالجن والإنس وبجميع الخلق ثم تنشق السماء الثانية فينزل أهلها فيحيطون بالملائكة الذين نزلوا قبلهم وبالجن والإنس وجميع الخلق وهم أكثر من أهل السماء الدنيا ومن جميع الخلق ثم تنشق السماء الثالثة فينزل أهلها وهم أكثر من أهل السماء الثانية والسماء الدنيا ومن جميع الخلق فيحيطون بالملائكة الذين نزلوا قبلهم وبالجن والإنس وجميع الخلق ثم كذلك كل سماء على ذلك التضعيف حتى تنشق السماء السابعة فينزل أهلها وهم أكثر ممن نزل قبلهم من أهل السموات ومن الجن والإنس ومن جميع الخلق فيحيطون بالملائكة الذين نزلوا قبلهم من أهل السموات وبالجن والإنس وجميع الخلق كلهم وينزل ربنا عز وجل في ظلل من الغمام وحوله الكروبيون وهم أكثر من أهل السموات السبع ومن الجن والإنس وجميع الخلق لهم قرون كأكعب القنا وهم تحت العرش لهم زجل بالتسبيح والتهليل والتقديس لله عز وجل ما بين أخمص قدم أحدهم إلى كعبه مسيرة خمسمائة عام وما بين كعبه إلى ركبتيه مسيرة خمسمائة عام ما بين ركبته إلى حجزته مسيرة خمسمائة عام وما بين حجزته إلى ترقوته مسيرة خمسمائة عام وما بين ترقوته إلى موضع القرط مسيرة خمسمائة عام وما فوق ذلك مسيرة خمسمائة عام وجهنم محسه هكذا رواه ابن أبي حاتم بهذا السياق وقال ابن جرير حدثنا القاسم حدثنا الحسين حدثني الحجاج عن مبارك بن فضالة عن علي بن زيد بن جدعان عن يوسف بن مهران أنه سمع ابن عباس يقول: إن هذه السماء إذا انشقت ينزل منها من الملائكة أكثر من الإنس والجن وهو يوم التلاق يوم يلتقي أهل السماء وأهل الأرض فيقول أهل الأرض جاء ربنا؟ فيقولون لم يجئ وهو آت ثم تنشق السماء الثانية ثم سماء سماء على قدر ذلك من التضعيف إلى السماء السابعة فينزل منها من الملائكة أكثر من جميع من نزل من السموات ومن الجن والإنس قال فتنزل الملائكة الكروبيون ثم يأتي ربنا في حملة العرش الثمانية بين كعب كل ملك وركبته مسيرة سبعين سنة وبين فخذه ومنكبه مسيرة سبعين سنة قال وكل ملك منهم لم يتأمل وجه صاحبه وكل ملك منهم واضع رأسه بين ثدييه يقول سبحان الملك القدوس وعلى رءوسهم شيء مبسوط كأنه القنا والعرش فوق ذلك ثم وقف فمداره على علي بن زيد بن جدعان وفيه ضعف في سياقاته غالبا وفيها نكارة شديدة وقد ورد في حديث الصور المشهور قريب من هذا والله أعلم وقد قال الله تعالى: \"فيومئذ وقعت الواقعة وانشقت السماء فهي يومئذ واهية والملك على أرجائها ويحمل عرش ربك فوقهم يومئذ ثمانية\" قال شهر بن حوشب حملة العرش ثمانية أربعة منهم يقولون: سبحانك اللهم وبحمدك لك الحمد على حلمك بعد علمك وأربعة يقولون: سبحانك اللهم وبحمدك لك الحمد على عفوك بعد قدرتك رواه ابن جرير عنه وقال أبو بكر بن عبدالله إذا نظر أهل الأرض إلى العرش يهبط عليهم من فوقهم شخصت إليه أبصارهم ورجفت كلاهم في أجوافهم وطارت قلوبهم من مقرها من صدورهم إلى حناجرهم قال ابن جرير حدثنا القاسم حدثنا الحسين حدثنا المعتمر بن سليمان عن عبدالجليل عن أبي حازم عن عبدالله بن عمرو قال: يهبط الله عز وجل حين يهبط وبينه وبين خلقه سبعون ألف حجاب منها النور والظلمة فيضرب الماء في تلك الظلمة صوتا تنخلع له القلوب وهذا موقوف على عبدالله بن عمرو من كلامه ولعله من الزاملتين والله أعلم."
    },
    {
      "ayah": 26,
      "surah": 25,
      "text": "وقوله تعالى: \"الملك يومئذ الحق للرحمن\" الآية كما قال تعالى: \"لمن الملك اليوم لله الواحد القهار\" وفي الصحيح أن الله تعالى يطوي السموات بيمينه ويأخذ الأرضين بيده الأخرى ثم يقول: أنا الملك أنا الديان أين ملوك الأرض ؟ أين الجبارون ؟ أين المتكبرون ؟ وقوله: \"وكان يوما على الكافرين عسيرا\" أي شديدا صعبا لأنه يوم عدل وقضاء فصل كما قال تعالى: \"فذلك يومئذ يوم عسير على الكافرين غير يسير\" فهذا حال الكافرين في هذا اليوم وأما المؤمنون فكما قال تعالى: \"لا يحزنهم الفزع الأكبر\" الآية. وروى الإمام أحمد حدثنا حسين بن موسى حدثنا ابن لهيعة حدثنا دراج عن أبي الهيثم عن أبي سعيد الخدري قال: قيل يا رسول الله يوم كان مقداره خمسين ألف سنة ما أطول هذا اليوم ! فقال رسول الله صلى الله عليه وسلم \"والذي نفسي بيده إنه ليخفف على المؤمن حتى يكون أخف عليه من صلاة مكتوبة يصليها في الدنيا\"."
    },
    {
      "ayah": 27,
      "surah": 25,
      "text": "وقوله تعالى: \"ويوم يعض الظالم على يديه\" الآية يخبر تعالى عن ندم الظالم الذي فارق طريق الرسول صلى الله عليه وسلم وما جاء به من عند الله من الحق المبين الذي لا مرية فيه وسلك طريقا أخرى غير سبيل الرسول فإذا كان يوم القيامة ندم حيث لا ينفعه الندم وعض على يديه حسرة وأسفا وسواء كان سبب نزولها في عقبة بن أبي معيط أو غيره من الأشقياء فإنها عامة في كل ظالم كما قال تعالى: \"يوم تقلب وجوههم في النار\" الآيتين فكل ظالم يندم يوم القيامة غاية الندم."
    },
    {
      "ayah": 28,
      "surah": 25,
      "text": "ويعض على يديه قائلا: \"يا ليتني اتخذت مع الرسول سبيلا يا ويلتا ليتني لم أتخذ فلانا خليلا\" يعني من صرفه عن الهدى وعدل به إلى طريق الضلال من دعاة الضلالة وسواء في ذلك أمية بن خلف أو أخوه أبي بن خلف أو غيرهما."
    },
    {
      "ayah": 29,
      "surah": 25,
      "text": "\"لقد أضلني عن الذكر\" وهو القرآن \"بعد إذ جاءني\" أي بعد بلوغه إلي قال الله تعالى \"وكان الشيطان للإنسان خذولا\" أي يخذله عن الحق ويصرفه عنه ويستعمله في الباطل ويدعوه إليه."
    },
    {
      "ayah": 3,
      "surah": 25,
      "text": "يخبر تعالى عن جهل المشركين في اتخاذهم آلهة من دون الله الخالق لكل شيء المالك لأزمة الأمور الذي ما شاء كان وما لم يشأ لم يكن ومع هذا عبدوا معه من الأصنام ما لم يقدر على خلق جناح بعوضة بل هم مخلوقون لا يملكون لأنفسهم ضرا ولا نفعا فكيف يملكون لعابديهم؟ \"ولا يملكون موتا ولا حياة ولا نشورا\" أي ليس لهم من ذلك شيء بل ذلك كله مرجعه إلى الله عز وجل الذي يحيي ويميت وهو الذي يعيد الخلائق يوم القيامة أولهم وآخرهم \"ما خلقكم ولا بعثكم إلا كنفس واحدة\" كقوله \"وما أمرنا إلا واحدة كلمح بالبصر\" وقوله \"فإنما هي زجرة واحدة فإذا هم بالساهرة \" \"فإنما هي زجرة واحدة فإذا هم ينظرون - إن كانت إلا صيحة واحدة فإذا هم جميع لدينا محضرون\" فهو الله الذي لا إله غيره ولا رب سواه ولا تنبغي العبادة إلا له لأنه ما شاء كان وما له يشأ لم يكن وهو الذي لا ولد له ولا والد ولا عديل ولا بديل ولا وزير ولا نظير بل هو الأحد الصمد الذي لم يلد ولم يولد ولم يكن له كفوا أحد."
    },
    {
      "ayah": 30,
      "surah": 25,
      "text": "يقول تعالى مخبرا عن رسوله ونبيه محمد صلى الله عليه وسلم أنه قال: \"يارب إن قومي اتخذوا هذا القرآن مهجورا\" وذلك أن المشركين كانوا لا يصغون للقرآن ولا يستمعونه كما قال تعالى: \"وقال الذين كفروا لا تسمعوا لهذا القرآن والغوا فيه\" الآية فكانوا إذا تلي عليهم القرآن أكثروا اللغط والكلام في غيره حتى لا يسمعونه فهذا من هجرانه وترك الإيمان به وترك تصديقه من هجرانه وترك تدبره وتفهمه من هجرانه وترك العمل به وامتثال أوامره واجتناب زواجره من هجرانه والعدول عنه إلى غيره من شعر أو قول أو غناء أو لهو أو كلام أو طريقة مأخوذة من غيره من هجرانه فنسأل الله الكريم المنان القادر على ما يشاء أن يخلصنا مما يسخطه; ويستعملنا فيما يرضيه من حفظ كتابه وفهمه والقيام بمقتضاه آناء الليل وأطراف النهار على الوجه الذي يحبه ويرضاه إنه كريم وهاب وقوله تعالى: \"وكذلك جعلنا لكل نبي عدوا من المجرمين\" أي كما حصل لك يا محمد في قومك من الذين هجروا القرآن كذلك كان في الأمم الماضين لأن الله جعل لكل نبي عدوا من المجرمين يدعون الناس إلى ضلالهم وكفرهم."
    },
    {
      "ayah": 31,
      "surah": 25,
      "text": "كما قال تعالى: \"وكذلك جعلنا لكل نبي عدوا شياطين الإنس والجن\" الآيتين ولهذا قال تعالى ههنا \"وكفى بربك هاديا ونصيرا\" أي لمن اتبع رسوله وآمن بكتابه وصدقه واتبعه فإن الله هاديه وناصره في الدنيا والآخرة وإنما قال \"هاديا ونصيرا\" لأن المشركين كانوا يصدون الناس عن اتباع القرآن لئلا يهتدي أحد به ولتغلب طريقتهم طريقة القرآن فلهذا قال: \"وكذلك جعلنا لكل نبي عدوا من المجرمين\" الآية."
    },
    {
      "ayah": 32,
      "surah": 25,
      "text": "يقول تعالى مخبرا عن كثرة اعتراض الكفار وتعنتهم وكلامهم فيما لا يعنيهم حيث قالوا: \"لولا نزل عليه القرآن جملة واحدة\" أي هلا أنزل عليه هذا الكتاب الذي أوحي إليه جملة واحدة كما نزلت الكتب قبله جملة واحدة كالتوراة والإنجيل والزبور وغيرها من الكتب الإلهية فأجابهم الله تعالى عن ذلك بأنه إنما نزل منجما في ثلاث وعشرين سنة بحسب الوقائع والحوادث وما يحتاج إليه من الأحكام ليثبت قلوب المؤمنين به كقوله: \"وقرآنا فرقناه\" الآية ولهذا قال \"لنثبت به فؤادك ورتلناه ترتيلا\" قال قتادة بيناه تبيينا وقال ابن زيد وفسرناه تفسيرا."
    },
    {
      "ayah": 33,
      "surah": 25,
      "text": "\"ولا يأتونك بمثل\" أي بحجة وشبهة \"إلا جئناك بالحق وأحسن تفسيرا\" أي ولا يقولون قولا يعارضون به الحق إلا أجبناهم بما هو الحق في نفس الأمر وأبين وأوضح وأفصح من مقالتهم قال سعيد بن جبير عن ابن عباس \"ولا يأتونك بمثل\" أي بما يلتمسون به عيب القرآن والرسول \"إلا جئناك بالحق\" الآية أي إلا نزل جبريل من الله تعالى بجوابهم وما هذا إلا اعتناء وكبير وشرف للرسول صلى الله عليه وسلم حيث كان يأتيه الوحي من الله عز وجل بالقرآن صباحا ومساء وليلا ونهارا سفرا وحضرا وكل مرة كان يأتيه الملك بالقرآن لا كإنزال الكتاب مما قبله من الكتب المتقدمة فهذا المقام أعلى وأجل وأعظم مكانة من سائر إخوانه الأنبياء صلوات الله وسلامه عليهم أجمعين فالقرآن أشرف كتاب أنزله الله ومحمد صلى الله عليه وسلم أعظم نبي أرسله الله تعالى وقد جمع الله للقرآن الصفتين معا ففي الملأ الأعلى أنزل جملة واحدة من اللوح المحفوظ إلى بيت العزة في السماء الدنيا ثم أنزل بعد ذلك إلى الأرض منجما بحسب الوقائع والحوادث وروى النسائي بإسناده عن ابن عباس قال: أنزل القرآن جملة واحدة إلى سماء الدنيا في ليلة القدر ثم نزل بعد ذلك في عشرين سنة قال الله تعالى: \"ولا يأتونك بمثل إلا جئناك بالحق وأحسن تفسيرا\" وقال تعالى: \"وقرآنا فرقناه لتقرأه على الناس على مكث ونزلناه تنزيلا\"."
    },
    {
      "ayah": 34,
      "surah": 25,
      "text": "ثم قال تعالى مخبرا عن سوء حال الكفار في معادهم يوم القيامة وحشرهم إلى جهنم في أسوأ الحالات وأقبح الصفات.\"الذين يحشرون على وجوههم إلى جهنم أولئك شر مكانا وأضل سبيلا\" وفي الصحيح عن أنس أن رجلا قال يا رسول الله كيف يحشر الكافر على وجهه يوم القيامة فقال \"إن الذي أمشاه على رجليه قادر أن يمشيه على وجهه يوم القيامة\" وهكذا قال مجاهد والحسن وقتادة وغير واحد من المفسرين."
    },
    {
      "ayah": 35,
      "surah": 25,
      "text": "يقول تعالى متوعدا من كذب رسوله محمدا صلى الله عليه وسلم من مشركي قومه ومن خالفه ومحذرهم من عقابه وأليم عذابه مما أحله بالأمم الماضية المكذبين لرسله فبدأ بذكر موسى وأنه بعثه وجعل معه أخاه هارون وزيرا أي نبيا موازرا ومؤيدا وناصرا فكذبهما فرعون وجنوده."
    },
    {
      "ayah": 36,
      "surah": 25,
      "text": "\"فدمر الله عليهم وللكافرين أمثالها\" وكذلك فعل بقوم نوح حين كذبوا رسوله نوحا عليه السلام ومن كذب برسول فقد كذب بجميع الرسل إذ لا فرق بين رسول ورسول ولو فرض أن الله تعالى بعث إليهم كل رسول فإنهم كانوا يكذبون."
    },
    {
      "ayah": 37,
      "surah": 25,
      "text": "ولهذا قال تعالى: \"وقوم نوح لما كذبوا الرسل\" ولم يبعث إليهم إلا نوح فقط وقد لبث فيهم ألف سنة إلا خمسين عاما يدعوهم إلى الله عز وجل ويحذرهم نقمه \"فما آمن معه إلا قليل\" ولهذا أغرقهم الله جميعا ولم يبق منهم أحدا ولم يترك من بني آدم على وجه الأرض سوى أصحاب السفينة فقط \"وجعلناهم للناس آية\" أي عبرة يعتبرون بها كما قال تعالى: \"إنا لما طغى الماء حملناكم في الجارية لنجعلها لكم تذكرة وتعيها أذن واعية\" أي وأبقينا لكم من السفن ما تركبون في لجج البحار لتذكروا نعمة الله عليكم من إنجائكم من الغرق وجعلكم من ذرية من آمن به وصدق أمره."
    },
    {
      "ayah": 38,
      "surah": 25,
      "text": "وقوله تعالى: \"وعادا وثمودا وأصحاب الرس\" قد تقدم الكلام على قصتيهما في غير ما سورة كسورة الأعراف بما أغنى عن الإعادة وأما أصحاب الرس فقال ابن جريج عن ابن عباس هم أهل قرية من قرى ثمود وقال ابن جريج: قال عكرمة أصحاب الرس بفلج وهم أصحاب يس وقال قتادة فلج من قرى اليمامة وقال ابن أبي حاتم بسنده عن ابن عباس قوله: \"وأصحاب الرس\" قال بئر بأذربيجان: وقال الثوري عن أبي بكر عن عكرمة: الرس بئر رسوا فيها نبيهم أي دفنوه فيها وقال ابن إسحاق عن محمد بن كعب قال: قال رسول الله صلى الله عليه وسلم \"إن أول الناس يدخل الجنة يوم القيامة العبد الأسود وذلك أن الله تعالى بعث نبيا إلى أهل قرية فلم يؤمن به من أهلها إلا ذلك العبد الأسود ثم إن أهل القرية عدوا على النبي فحفروا له بئرا فألقوه فيها ثم أطبقوا عليه بحجر أصم قال فكان ذلك العبد يذهب فيحتطب على ظهره ثم يأتي بحطبه فيبيعه ويشتري به طعاما وشرابا ثم يأتي به إلى تلك البئر فيرفع تلك الصخرة ويعينه الله تعالى عليها فيدلي إليه طعامه وشرابه ثم يردها كما كانت قال فكان ذلك ما شاء الله أن يكون ثم إنه ذهب يوما يحتطب كما كان يصنع فجمع حطبه وحزم حزمته وفرغ منها فلما أراد أن يحتملها وجد سِنَة فاضطجع فنام فضرب الله على أذنه سبع سنين ثم إنه هب فتمطى فتحول لشقه الآخر فاضطجع فضرب الله على أذنه سبع سنين أخرى ثم إنه هب واحتمل حزمته ولا يحسب إلا أنه نام ساعة من نهار فجاء إلى القرية فباع حزمته ثم اشترى طعاما وشرابا كما كان يصنع ثم إنه ذهب إلى الحفيرة موضعها الذي كانت فيه فالتمسه فلم يجده وكان قد بدا لقومه فيه بداء فاستخرجوه وآمنوا به وصدقوه قال فكان نبيهم يسألهم عن ذلك الأسود ما فعل فيقولون له لا ندري حتى قبض الله النبي وهب الأسود من نومته بعد ذلك\" فقال رسول الله صلى الله عليه وسلم \"إن ذلك الأسود لأول من يدخل الجنة\" وهكذا رواه ابن جرير عن ابن حميد عن سلمة عن محمد بن إسحاق عن محمد بن كعب مرسلا وفيه غرابة ونكارة ولعل فيه إدراجا والله أعلم وقال ابن جرير: لا يجوز أن يحمل هؤلاء على أنهم أصحاب الرس الذين ذكروا في القرآن لأن الله أخبر عنهم أنه أهلكهم وهؤلاء آمنوا بنبيهم إلا أن يكون حدث لهم أحداث آمنوا بالنبي بعد هلاك آبائهم والله أعلم واختار ابن جرير أن المراد بأصحاب الرس هم أصحاب الأخدود الذين ذكروا في سورة البروج فالله أعلم وقوله تعالى: \"وقرونا بين ذلك كثيرا\" أي وأمما أضعاف من ذكر أهلكناهم كثيرة."
    },
    {
      "ayah": 39,
      "surah": 25,
      "text": "ولهذا قال \"وكلا ضربنا له الأمثال\" أي بينا لهم الحجج ووضحنا لهم الأدلة كما قال قتادة وأزحنا الأعذار عنهم \"وكلا تبرنا تتبيرا\" أي أهلكنا إهلاكا كقوله تعالى: \"وكم أهلكنا من القرون من بعد نوح\" والقرن هو الأمة من الناس كقوله: \"ثم أنشأنا من بعدهم قرونا آخرين\" وعده بعضهم بمائه وعشرين سنة وقيل بمائه وقيل بثمانين وقيل أربعين وقيل غير ذلك والأظهر أن القرن هو الأمة المتعاصرون في الزمن الواحد وإذا ذهبوا وخلفهم جيل فهو قرن آخر كما ثبت في الصحيحين \"خير القرون قرني ثم الذين يلونهم ثم الذين يلونهم\" الحديث."
    },
    {
      "ayah": 4,
      "surah": 25,
      "text": "يقول تعالى مخبرا عن سخافة عقول الجهلة من الكفار في قولهم عن القرآن \"إن هذا إلا إفك\" أي كذب \"افتراه\" يعنون النبي صلى الله عليه وسلم \"وأعانه عليه قوم آخرون\" أي واستعان على جمعه بقوم آخرين فقال الله تعالى \"فقد جاءوا ظلما وزورا\" أي فقد افتروا هم قولا باطلا وهم يعلمون أنه باطل ويعرفون كذب أنفسهم فيما زعموه."
    },
    {
      "ayah": 40,
      "surah": 25,
      "text": "\"ولقد أتوا على القرية التي أمطرت مطر السوء\" يعني قرية قوم لوط وهي سدوم التي أهلكها الله بالقلب وبالمطر من الحجارة التي من سجيل كما قال تعالى: \"وأمطرنا عليهم مطرا فساء مطر المنذرين\" وقال: \"وإنكم لتمرون عليهم مصبحين وبالليل أفلا تعقلون\" وقال تعالي \"وإنها لبسبيل مقيم\" وقال: \"وإنهما لبإمام مبين\" ولهذا قال \"أفلم يكونوا يرونها\" أي فيعتبروا بما حل بأهلها من العذاب والنكال بسبب تكذيبهم بالرسول وبمخالفتهم أوامر الله \"بل كانوا لا يرجون نشورا\" يعني المارين بها من الكفار لا يعتبرون لأنهم لا يرجون نشورا أي معادا يوم القيامة."
    },
    {
      "ayah": 41,
      "surah": 25,
      "text": "يخبر تعالى عن استهزاء المشركين بالرسول صلى الله عليه وسلم إذ رأوه كما قال تعالى: \"وإذا رآك الذين كفروا إن يتخذونك إلا هزوا\" الآية يعنون بالعيب والنقص وقال ههنا: \"وإذا رأوك إن يتخذونك إلا هزوا أهذا الذي بعث الله رسولا\" أي على سبيل التنقص والازدراء فقبحهم الله كما قال \"ولقد استهزئ برسل من قبلك\" الآية."
    },
    {
      "ayah": 42,
      "surah": 25,
      "text": "وقوله تعالى: \"إن كاد ليضلنا عن آلهتنا\" يعنون أنه كاد يثنيهم عن عبادة الأصنام لولا أن صبروا وتجلدوا واستمروا عليها قال الله تعالى متوعدا لهم ومتهددا \"وسوف يعلمون حين يرون العذاب\" الآية ثم قال تعالى لنبيه منبها أن من كتب الله عليه الشقاوة والضلال فإنه لا يهديه أحد إلا الله عز وجل."
    },
    {
      "ayah": 43,
      "surah": 25,
      "text": "\"أرأيت من اتخذ إلهه هواه\" أي مهما استحسن من شيء ورآه حسنا في هوى نفسه كان دينه ومذهبه كما قال تعالى: \"أفمن زين له سوء عمله فرآه حسنا فإن الله يضل من يشاء\" الآية ولهذا قال ههنا \"أفأنت تكون عليه وكيلا\" قال ابن عباس كان الرجل في الجاهلية يعبد الحجر الأبيض زمانا فإذا رأى غيره أحسن منه عبد الثاني وترك الأول."
    },
    {
      "ayah": 44,
      "surah": 25,
      "text": "ثم قال تعالى: \"أم تحسب أن أكثرهم يسمعون أو يعقلون\" الآية أي هم أسوا حالا من الأنعام السارحة فإن تلك تفعل ما خلقت له وهؤلاء خلقوا لعبادة الله وحده لا شريك له فلم يفعلوا وهم يعبدون غيره ويشركون به مع قيام الحجة عليهم وإرسال الرسل إليهم."
    },
    {
      "ayah": 45,
      "surah": 25,
      "text": "من ههنا شرع سبحانه وتعالى في بيان الأدلة الدالة على وجوده وقدرته التامة على خلق الأشياء المختلفة والمتضادة فقال تعالى: \"ألم تر إلى ربك كيف مد الظل\"؟ قال ابن عباس وابن عمر وأبو العالية وأبو مالك ومسروق ومجاهد وسعيد بن جبير والنخعي والضحاك والحسن وقتادة: هو ما بين طلوع الفجر إلى طلوع الشمس \"ولو شاء لجعله ساكنا\" أي دائما لا يزول كما قال تعالى: \"قل أرأيتم إن جعل الله عليكم الليل سرمدا\" الآيات وقوله تعالى: \"ثم جعلنا الشمس عليه دليلا\" أي لولا أن الشمس تطلع عليه لما عرف فإن الضد لا يعرف إلا بضده. وقال قتادة والسدي دليلا تتلوه وتتبعه حتى تأتي عليه كله."
    },
    {
      "ayah": 46,
      "surah": 25,
      "text": "وقوله تعالى: \"ثم قبضناه إلينا قبضا يسيرا\" أي الظل وقيل الشمس \"يسيرا\" أي سهلا قال ابن عباس سريعا وقال مجاهد خفيا وقال السدي قبضا خفيا حتى لا يبقى في الأرض ظل إلا تحت سقف أو تحت شجرة وقد أظلت الشمس ما فوقه وقال أيوب بن موسى في الآية \"قبضا يسيرا\" قليلا قليلا."
    },
    {
      "ayah": 47,
      "surah": 25,
      "text": "وقوله: \"وهو الذي جعل لكم الليل لباسا\" أي يلبس الوجود ويغشاه كما قال تعالى: \"والليل إذا يغشى\" \"والنوم سباتا\" أي قاطعا للحركة لراحة الأبدان فإن الأعضاء والجوارح تكل من كثرة الحركة في الانتشار بالنهار في المعاش فإذا جاء الليل وسكن سكنت الحركات فاستراحت فحصل النوم الذي فيه راحة البدن والروح معا \"وجعل النهار نشورا\" أي ينتشر الناس فيه لمعايشهم ومكاسبهم وأسبابهم كما قال تعالى: \"ومن رحمته جعل لكم الليل والنهار لتسكنوا فيه ولتبتغوا من فضله\" الآية."
    },
    {
      "ayah": 48,
      "surah": 25,
      "text": "وهذا أيضا من قدرته التامة وسلطانه العظيم وهو أنه تعالى يرسل الرياح مبشرات أي بمجيء السحاب بعدها والرياح أنواع في صفات كثيرة من التسخير فمنها ما يثير السحاب ومنها ما يحمله ومنها ما يسوقه ومنها ما يكون بين يدي السحاب مبشرا ومنها ما يكون قبل ذلك تقم الأرض ومنها ما يلقح السحاب ليمطر ولهذا قال تعالى: \"وأنزلنا من السماء ماء طهورا\" أي آلة يتطهر بها كالسحور والوجور وما جرى مجراهما فهذا أصح ما يقال في ذلك وأما من قال إنه فعول بمعنى فاعل أو أنه مبني للمبالغة والتعدي فعلى كل منهما إشكالات من حيث اللغة والحكم ليس هذا موضع بسطها والله أعلم وقال ابن أبي حاتم حدثنا أبي بإسناده إلى حميد الطويل عن ثابت البناني قال دخلت مع أبي العالية في يوم مطير وطرق البصرة قذرة فصلى فقلت له فقال: \"وأنزلنا من السماء ماء طهورا\" قال طهره ماء السماء وقال أيضا حدثنا أبي حدثنا أبو سلمة حدثنا وهيب عن داود عن سعيد بن المسيب في هذه الآية قال: أنزله الله طهورا لا ينجسه شيء وعن أبي سعيد قال: قيل يا رسول الله أنتوضأ من بئر بضاعة وهي بئر يلقى فيها النتن ولحوم الكلاب ؟ فقال: \"إن الماء طهور لا ينجسه شيء\" رواه الشافعي وأحمد وصححه أبو داود والترمذي وحسنه والنسائي وروى ابن أبي حاتم بإسناده حدثنا أبي حدثنا أبو الأشعث حدثنا معتمر سمعت أبي يحدث عن سيار عن خالد بن يزيد قال: كنا عند عبدالملك بن مروان فذكروا الماء فقال خالد بن يزيد: منه ماء من السماء ومنه ماء يسقيه الغيم من البحر فيذبه الرعد والبرق فأما ما كان من البحر فلا يكون منه نبات فأما النبات فمما كان من السماء وروي عن عكرمة قال: ما أنزل الله من السماء قطرة إلا أنبت بها في الأرض عشبة أو في البحر لؤلؤة وقال غيره: في البرِّ بَرٌّ وفي البحر در."
    },
    {
      "ayah": 49,
      "surah": 25,
      "text": "وقوله تعالى: \"لنحيي به بلدة ميتا\" أي أرضا قد طال انتظارها للغيث فهي هامدة لا نبات فيها ولا شيء فلما جاءها الحياء عاشت واكتست رباها أنواع الأزاهير والألوان كما قال تعالى: \"فإذا أنزلنا عليها الماء اهتزت وربت\" الآية: \"ونسقيه مما خلقنا أنعاما وأناسي كثيرا\" أي وليشرب منه الحيوان من أنعام وأناسي محتاجين إليه غاية الحاجة لشربهم وزروعهم وثمارهم كما قال تعالى: \"وهو الذي ينزل الغيث من بعد ما قنطوا\" الآية وقال تعالى: \"فانظر إلى آثار رحمة الله كيف يحيي الأرض بعد موتها\" الآية."
    },
    {
      "ayah": 5,
      "surah": 25,
      "text": "\"وقالوا أساطير الأولين اكتتبها\" يعنون كتب الأوائل أي استنسخها \"فهي تملى عليه\" أي تقرأ عليه \"بكرة وأصيلا\" أي في أول النهار وآخره وهذا الكلام لسخافته وكذبه وبهته منهم يعلم كل أحد بطلانه فإنه قد علم بالتواتر وبالضرورة أن محمدا رسول الله صلى الله عليه وسلم لم يكن يعاني شيئا من الكتابة لا في أول عمره ولا في آخره وقد نشأ بين أظهرهم من أول مولده إلى أن بعثه الله نحوا من أربعين سنة وهم يعرفون مدخله ومخرجه وصدقه ونزاهته وبره وأمانته وبعده عن الكذب والفجور وسائر الأخلاق الرذيلة حتى إنهم كانوا يسمونه في صغره وإلى أن بعث الأمين; لما يعلمون من صدقه وبره فلما أكرمه الله بما أكرمه به نصبوا له العداوة ورموه بهذه الأقوال التي يعلم كل عاقل براءته منها وحاروا فيما يقذفونه به فتارة من إفكهم يقولون ساحر وتارة يقولون شاعر وتارة يقولون مجنون وتارة يقولون كذاب وقال الله تعالى \"انظر كيف ضربوا لك الأمثال فضلوا فلا يستطيعون سبيلا\"."
    },
    {
      "ayah": 50,
      "surah": 25,
      "text": "وقوله تعالى: \"ولقد صرفناه بينهم ليذكروا\" أي أمطرنا هذه الأرض دون هذه وسقنا السحاب يمر على الأرض ويتعداها ويتجاوزها إلى الأرض الأخرى فيمطرها ويكفيها ويجعلها غدقا والتي وراءها لم ينزل فيها قطرة من ماء وله في ذلك الحجة البالغة والحكمة القاطعة قال ابن عباس وابن مسعود رضي الله عنهم ليس عام بأكثر مطرا من عام ولكن الله يصرفه كيف يشاء ثم قرأ هذه الآية \"ولقد صرفناه بينهم ليذكروا فأبى أكثر الناس إلا كفورا\" أي ليذكروا بإحياء الله الأرض الميتة أنه قادر على إحياء الأموات والعظام الرفات أو ليذكر من منع المطر إنما أصابه ذلك بذنب أصابه فيقلع عما هو فيه وقال عمر مولى عقبة: كان جبريل عليه السلام في موضع الجنائز فقال له النبي صلى الله عليه وسلم \"يا جبريل إني أحب أن أعلم أمر السحاب\" قال فقال له جبريل يا نبي الله هذا ملك السحاب فسله فقال تأتينا صكاك مختمة: اسق بلاد كذا وكذا كذا وكذا قطرة رواه ابن أبي حاتم وهو حديث مرسل وقوله تعالى: \"فأبى أكثر الناس إلا كفورا\" قال عكرمة يعني الذين يقولون مطرنا بنوء كذا وكذا وهذا الذي قاله عكرمة كما صح في الحديث المخرج في صحيح مسلم عن رسول الله صلى الله عليه وسلم أنه قال لأصحابه يوما على أثر سماء أصابتهم من الليل \"أتدرون ماذا قال ربكم ؟\" قالوا الله ورسوله أعلم قال \"قال أصبح من عبادي مؤمن بي وكافر فأما من قال مطرنا بفضل الله ورحمته فذاك مؤمن بي كافر بالكوكب وأما من قال مطرنا بنوء كذا وكذا فذاك كافر بي مؤمن بالكوكب\"."
    },
    {
      "ayah": 51,
      "surah": 25,
      "text": "يقول تعالى: \"ولو شئنا لبعثنا في كل قرية نذيرا\" يدعوهم إلى الله عز وجل ولكنا خصصناك يا محمد بالبعثة إلى جميع أهل الأرض وأمرناك أن تبلغهم هذا القرآن \"لأنذركم به ومن بلغ\" \"ومن يكفر به من الأحزاب فالنار موعده\" \"لتنذر أم القرى ومن حولها\" \"قل يا أيها الناس إني رسول الله إليكم جميعا\" وفي الصحيحين \"بعثت إلى الأحمر والأسود\" وفيهما \"وكان النبي يبعث إلى قومه خاصة وبعثت إلى الناس عامة\"."
    },
    {
      "ayah": 52,
      "surah": 25,
      "text": "ولهذا قال تعالى: \"فلا تطع الكافرين وجاهدهم به\" يعني بالقرآن قاله ابن عباس: \"جهادا كبيرا\". كما قال تعالى: \"يا أيها النبي جاهد الكفار والمنافقين\" الآية."
    },
    {
      "ayah": 53,
      "surah": 25,
      "text": "وقوله تعالى \"وهو الذي مرج البحرين هذا عذب فرات وهذا ملح أجاج\" أي خلق الماءين الحلو والملح فالحلو كالأنهار والعيون والآبار وهذا هو البحر الحلو العذب الفرات الزلال قاله ابن جريج واختاره ابن جرير وهذا المعنى لا شك فيه فإنه ليس في الوجود بحر ساكن وهو عذب فرات; والله سبحانه وتعالى إنما أخبر بالواقع لينبه العباد على نعمه عليهم ليشكروه فالبحر العذب هو هذا السارح بن الناس فرقه الله تعالى بين خلقه لاحتياجهم إليه أنهارا وعيونا في كل أرض بحسب حاجتهم وكفايتهم لأنفسهم وأراضيهم وقوله تعالى: \"وهذا ملح أجاج\" أي مالح مر زعاق لا يستساغ وذلك كالبحار المعروفة في المشارق والمغارب: البحر المحيط وما يتصل به من الزقاق وبحر القلزم وبحر اليمن وبحر البصرة وبحر فارس وبحر الصين والهند وبحر الروم وبحر الخزر وما شاكلها وشابهها من البحار الساكنة التي لا تجري ولكن تموج وتضطرب وتلتطم في زمن الشتاء وشدة الرياح ومنها ما فيه مد وجزر ففي أول كل شهر يحصل منها مد وفيض فإذا شرع الشهر في النقصان جزرت حتى ترجع إلى غايتها الأولى فإذا استهل الهلال من الشهر الآخر شرعت في المد إلى الليلة الرابعة عشرة ثم تشرع في النقص فأجرى الله سبحانه وتعالى - وهو ذو القدرة التامة - العادة بذلك فكل هذه البحار الساكنة خلقها الله سبحانه وتعالى مالحة لئلا يحصل بسببها نتن الهواء فيفسد الوجود بذلك ولئلا تجوي الأرض بما يموت فيها من الحيوان ولما كان ماؤها ملحا كان هواؤها صحيحا وميتتها طيبة ولهذا قال رسول الله صلى الله عليه وسلم وقد سئل عن ماء البحر أنتوضأ به؟ فقال: \"هو الطهور ماؤه الحل ميتته\" رواه الأئمة مالك والشافعي وأحمد وأهل السنن بإسناد جيد وقوله تعالى: \"وجعل بينهما برزخا وحجرا\" أي بين العذب والمالح \"برزخا\" أي حاجزا وهو اليبس من الأرض \"وحجرا محجورا\" أي مانعا من أن يصل أحدهما إلى الآخر كقوله \"مرج البحرين يلتقيان بينهما برزخ لا يبغيان فبأي آلاء ربكما تكذبان\" وقوله تعالى: \"أمن جعل الأرض قرارا وجعل خلالها أنهارا وجعل لها رواسي وجعل بين البحرين حاجزا أإله مع الله بل أكثرهم لا يعلمون\"."
    },
    {
      "ayah": 54,
      "surah": 25,
      "text": "وقوله تعالى: \"وهو الذي خلق من الماء بشرا\" الآية أي خلق الإنسان من نطفة ضعيفة فسواه وعدله وجعله كامل الخلقة ذكرا وأنثى كما يشاء \"فجعله نسبا وصهرا\" فهو في ابتداء أمره ولد نسيب ثم يتزوج فيصير صهرا يصير له أصهار وأختان وقرابات وكل ذلك من ماء مهين ولهذا قال تعالى: \"وكان ربك قديرا\"."
    },
    {
      "ayah": 55,
      "surah": 25,
      "text": "يخبر تعالى عن جهل المشركين في عبادتهم غير الله من الأصنام التي لا تملك له ضرا ولا نفعا بلا دليل قادهم إلى ذلك ولا حجة أدتهم إليه بل بمجرد الآراء والتشهي والأهواء فهم يوالونهم ويقاتلون في سبيلهم ويعادون الله ورسوله والمؤمنين فيهم ولهذا قال تعالى: \"وكان الكافر على ربه ظهيرا\" أي عونا في سبيل الشيطان على حزب الله وحزب الله هم الغالبون كما قال تعالى \"واتخذوا من دون الله آلهة لعلهم ينصرون لا يستطيعون نصرهم وهم لهم جند محضرون\" أي آلهتهم التي اتخذوها من دون الله لا تملك لهم نصرا وهؤلاء الجهلة للأصنام جند محضرون يقاتلون عنهم ويذبون عن حوزتهم ولكن العاقبة والنصرة لله ولرسوله وللمؤمنين في الدنيا والآخرة قال مجاهد \"وكان الكافر على ربه ظهيرا\" قال يظاهر الشيطان على معصية الله ويعينه وقال سعيد بن جبير \"وكان الكافر على ربه ظهيرا\" يقول عونا للشيطان على ربه بالعداوة والشرك وقال زيد بن أسلم \"وكان الكافر على ربه ظهيرا\" قال مواليا."
    },
    {
      "ayah": 56,
      "surah": 25,
      "text": "ثم قال تعالى لرسوله صلوات الله وسلامه عليه \"وما أرسلناك إلا مبشرا ونذيرا\" أي بشيرا للمؤمنين ونذيرا للكافرين مبشرا بالجنة لمن أطاع الله ونذيرا بين يدي عذاب شديد لمن خالف أمر الله."
    },
    {
      "ayah": 57,
      "surah": 25,
      "text": "\"قل ما أسألكم عليه من أجر\" أي عن هذا البلاغ وهذا الإنذار من أجرة أطلبها من أموالكم وإنما أفعل ذلك ابتغاء وجه الله تعالى: \" لمن شاء منكم أن يستقيم\" \"إلا من شاء أن يتخذ إلى ربه سبيلا\" أي طريقا ومسلكا ومنهجا يقتدي فيها بما جئت به."
    },
    {
      "ayah": 58,
      "surah": 25,
      "text": "ثم قال تعالى \"وتوكل على الحي الذي لا يموت\" أي في أمورك كلها كن متوكلا على الله الحي الذي لا يموت أبدا الذي هو \"الأول والآخر والظاهر والباطن وهو بكل شيء عليم\" الدائم الباقي السرمدي الأبدي الحي القيوم رب كل شيء ومليكه اجعله ذخرك وملجأك وهو الذي يتوكل عليه ويفزع إليه فإنه كافيك وناصرك ومؤيدك ومظفرك كما قال تعالى: \"يا أيها الرسول بلغ ما أنزل إليك من ربك وإن لم تفعل فما بلغت رسالته والله يعصمك من الناس\" وروى ابن أبي حاتم حدثنا أبو زرعة حدثنا عبدالله بن محمد بن علي بن نفيل قال قرأت على معقل يعني ابن عبيدالله عن عبدالله بن أبي حسين عن شهر بن حوشب قال: لقي سلمان النبي صلى الله عليه وسلم في بعض فجاج المدينة فسجد له فقال: \"لا تسجد لي يا سلمان واسجد للحي الذي لا يموت\" وهذا مرسل حسن وقوله تعالى: \"وسبح بحمده\" أي أقرن بين حمده وتسبيحه ولهذا كان رسول الله صلى الله عليه وسلم يقول \"سبحانك اللهم ربنا وبحمدك\" أي أخلص له العبادة والتوكل كما قال تعالى: \"رب المشرق والمغرب لا إله إلا هو فاتخذه وكيلا\" وقال تعالى \"فاعبده وتوكل عليه\" وقال تعالى: \"قل هو الرحمن آمنا به وعليه توكلنا\" وقوله تعالى: \"وكفى به بذنوب عباده خبيرا\" أي بعلمه التام الذي لا يخفى عليه خافية ولا يعزب عنه مثقال ذرة."
    },
    {
      "ayah": 59,
      "surah": 25,
      "text": "وقوله تعالى: \"الذي خلق السموات والأرض\" الآية أي هو الحي الذي لا يموت وهو خالق كل شيء وربه ومليكه الذي خلق بقدرته وسلطانه السموات السبع في ارتفاعها واتساعها والأرضين السبع في سفولها وكثافتها \"في ستة أيام ثم استوى على العرش\" أي يدبر الأمر ويقضي الحق وهو خير الفاصلين وقوله: \"ثم استوى على العرش الرحمن فاسأل به خبيرا\" أي استعلم عنه من هو خبير به عالم به فاتبعه واقتد به وقد علم أنه لا أحد أعلم بالله ولا أخبر به من عبده ورسوله محمد صلوات الله وسلامه عليه سيد ولد آدم على الإطلاق في الدنيا والآخرة الذي لا ينطق عن الهوى \"إن هو إلا وحي يوحى\" فما قاله فهو الحق وما أخبره به فهو الصدق وهو الإمام المحكم الذي إذا تنازع الناس في شيء وجب رد نزاعهم إليه فما وافق أقواله وأفعاله فهو الحق وما خالفها فهو مردود على قائله وفاعله كائنا من كان قال الله تعالى \"فإن تنازعتم في شيء\" الآية وقال تعالى \"وما اختلفتم فيه من شيء فحكمه إلى الله\" وقال تعالى: \"وتمت كلمة ربك صدقا وعدلا\" أي صدقا في الإخبار وعدلا في الأوامر والنواهي ولهذا قال تعالى \"فاسأل به خبيرا\" قال مجاهد في قوله: \"فاسأل به خبيرا\" قال ما أخبرتك من شيء فهو كما أخبرتك وكذا قال ابن جريج وقال شمر بن عطية في قوله: \"فاسأل به خبيرا\" هذا القرآن خبير به."
    },
    {
      "ayah": 6,
      "surah": 25,
      "text": "وقال تعالى في جواب ما عاندوا ههنا وافتروا \"قل أنزله الذي يعلم السر في السموات والأرض\" الآية أي أنزل القرآن المشتمل على أخبار الأولين والآخرين إخبارا حقا صدقا مطابقا للواقع في الخارج ماضيا ومستقبلا \"الذي يعلم السر\" أي الله الذي يعلم غيب السموات والأرض ويعلم السرائر كعلمه بالظواهر وقوله تعالى \"إنه كان غفورا رحيما\" دعاء لهم إلى التوبة والإنابة وإخبار لهم بأن رحمته واسعة وأن حلمه عظيم مع أن من تاب إليه تاب عليه فهؤلاء مع كذبهم وافترائهم وفجورهم وبهتانهم وكفرهم وعنادهم وقولهم عن الرسول والقرآن ما قالوا يدعوهم إلى التوبة والإقلاع عما هم فيه إلى الإسلام والهدى كما قال تعالى \"لقد كفر الذين قالوا إن الله ثالث ثلاثة وما من إله إلا إله واحد وإن لم ينتهوا عما يقولون ليمسن الذين كفروا منهم عذاب أليم أفلا يتوبون إلى الله ويستغفرونه والله غفور رحيم\" وقال تعالى \"إن الذين فتنوا المؤمنين والمؤمنات ثم لم يتوبوا فلهم عذاب جهنم ولهم عذاب الحريق\" قال الحسن البصري: انظروا إلى هذا الكرم والجود قتلوا أولياءه وهو يدعوهم إلى التوبة والرحمة."
    },
    {
      "ayah": 60,
      "surah": 25,
      "text": "ثم قال تعالى منكرا على المشركين الذين يسجدون لغير الله من الأصنام والأنداد \"وإذا قيل لهم اسجدوا للرحمن قالوا وما الرحمن\" أي لا نعرف الرحمن وكانوا ينكرون أن يسمى الله باسمه الرحمن كما أنكروا ذلك يوم الحديبية حين قال النبي صلى الله عليه وسلم للكاتب \"اكتب: بسم الله الرحمن الرحيم\" فقالوا لا نعرف الرحمن ولا الرحيم ولكن اكتب كما كنت تكتب: باسمك اللهم ولهذا أنزل الله تعالى \"قل ادعوا الله أو ادعوا الرحمن أياما تدعوا فله الأسماء الحسنى\" أي هو الله وهو الرحمن وقال في هذه الآية \"وإذا قيل لهم اسجدوا للرحمن قالوا وما الرحمن\" أي لا نعرفه ولا نقر به \"أنسجد لما تأمرنا\" أي لمجرد قولك \"وزادهم نفورا\" فأما المؤمنون فإنهم يعبدون الله الذي هو الرحمن الرحيم ويفردونه بالإلهية ويسجدون له وقد اتفق العلماء - رحمهم الله- على أن هذه السجدة التي في الفرقان مشروع السجود عندها لقارئها ومستمعها كما هو مقرر في موضعه والله سبحانه وتعالى أعلم."
    },
    {
      "ayah": 61,
      "surah": 25,
      "text": "يقول تعالى ممجدا نفسه ومعظما على جميل ما خلق في السموات من البروج وهي الكواكب العظام في قول مجاهد وسعيد بن جبير وأبي صالح والحسن وقتادة وقيل هي قصور في السماء للحرس يروى هذا عن علي وابن عباس ومحمد بن كعب وإبراهيم النخعي وسليمان بن مهران الأعمش وهو رواية عن أبي صالح أيضا والقول الأول أظهر اللهم إلا أن يكون الكواكب العظام هي قصور للحرس فيجتمع القولان كما قال تعالى \"ولقد زينا السماء الدنيا بمصابيح\" الآية ولهذا قال تعالى \"تبارك الذي جعل في السماء بروجا وجعل فيها سراجا\" وهي الشمس المنيرة التي هي كالسراج في الوجود كما قال تعالى \"وجعلنا سراجا وهاجا\" \"وقمرا منيرا\" أي مشرقا مضيئا بنور آخر من غير نور الشمس كما قال تعالى \"وهو الذي جعل الشمس ضياء والقمر نورا\" وقال مخبرا عن نوح عليه السلام أنه قال لقومه \"ألم تروا كيف خلق الله سبع سموات طباقا وجعل القمر فيهن نورا وجعل الشمس سراجا\"."
    },
    {
      "ayah": 62,
      "surah": 25,
      "text": "ثم قال تعالى \"وهو الذي جعل الليل والنهار خلفة\" أي يخلف كل واحد منهما صاحبه يتعاقبان لا يفتران إذا ذهب هذا جاء هذا وإذا جاء هذا ذهب ذاك كما قال تعالى \"وسخر لكم الشمس والقمر دائبين\" الآية وقال \"يغشي الليل النهار يطلبه حثيثا\" الآية وقال \"لا الشمس ينبغي لها أن تدرك القمر\" الآية وقوله تعالى \"لمن أراد أن يذكر أو أراد شكورا\" أي جعلهما يتعاقبان توقيتا لعبادة عباده له عز وجل فمن فاته عمل في الليل استدركه في النهار ومن فاته عمل في النهار استدركه في الليل وقد جاء في الحديث الصحيح \"إن الله عز وجل يبسط يده بالليل ليتوب مسيء النهار ويبسط يده بالنهار ليتوب مسيء الليل\" وقال أبو داود الطيالسي حدثنا أبو حمزة عن الحسن أن عمر بن الخطاب أطال صلاة الضحى فقيل له صنعت اليوم شيئا لم تكن تصنعه فقال: إنه بقي علي من وردي شيء فأحببت أن أتمه أو قال أقضيه وتلا هذه الآية \"وهو الذي جعل الليل والنهار خلفة لمن أراد أن يذكر أو أراد شكورا\" وقال علي بن أبي طلحة عن ابن عباس في الآية يقول من فاته شيء من الليل أن يعمله أدركه بالنهار أو من النهار أدركه بالليل وكذا قال عكرمة وسعيد بن جبير والحسن وقال مجاهد وقتادة خلفة أي مختلفين أي هذا بسواده وهذا بضيائه."
    },
    {
      "ayah": 63,
      "surah": 25,
      "text": "هذه صفات عباد الله المؤمنين \"الذين يمشون على الأرض هونا\" أي بسكينة ووقار من غير جبرية ولا استكبار كقوله تعالى \"ولا تمش في الأرض مرحا\" الآية فأما هؤلاء فإنهم يمشون من غير استكبار ولا مرح ولا أشر ولا بطر وليس المراد أنهم يمشون كالمرضى تصنعا ورياء فقد كان سيد ولد آدم صلى الله عليه وسلم إذا مشى كأنما ينحط من صبب وكأنما الأرض تطوى له وقد كره بعض السلف المشي بتضعف وتصنع حتى روي عن عمر أنه رأى شابا يمشي رويدا فقال ما بالك أأنت مريض؟ قال لا يا أمير المؤمنين فعلاه بالدرة وأمره أن يمشي بقوة وإنما المراد بالهون هنا السكينة والوقار كما قال رسول الله صلى الله عليه وسلم \"إذا أتيتم الصلاة فلا تأتوها وأنتم تسعون وائتوها وعليكم السكينة فما أدركتم منها فصلوا وما فاتكم فأتموا\" وقال عبدالله بن المبارك عن معمر عن عمر بن المختار عن الحسن البصري في قوله \"وعباد الرحمن\" الآية قال: إن المؤمنين قوم ذلل ذلت منهم - والله - الأسماع والأبصار والجوارح حتى يحسبهم الجاهل مرضى وما بالقوم من مرض وإنهم - والله - لأصحاء ولكنهم دخلهم من الخوف ما لم يدخل غيرهم ومنعهم من الدنيا علمهم بالآخرة فقالوا: الحمد لله الذي أذهب عنا الحزن أما والله ما أحزنهم ما أحزن الناس ولا تعاظم في نفوسهم شيء طلبوا به الجنة ولكن أبكاهم الخوف من النار إنه من لم يتعز بعزاء الله تقطع نفسه على الدنيا حسرات ومن لم ير لله نعمة إلا في مطعم أو مشرب فقد قل علمه وحضر عذابه وقوله تعالى \"وإذا خاطبهم الجاهلون قالوا سلاما\" أي إذا سفه عليهم الجاهل بالقول السيء لم يقابلوهم عليه بمثله بل يعفون ويصفحون ولا يقولون إلا خيرا كما كان رسول الله صلى الله عليه وسلم لا تزيده شدة الجاهل عليه إلا حلما وكما قال تعالى \"وإذا سمعوا اللغو أعرضوا عنه\" الآية وروى الإمام أحمد حدثنا أسود بن عامر حدثنا أبو بكر عن الأعمش عن أبي خالد الوالبي عن النعمان بن مقرن المزني قال: قال رسول الله صلى الله عليه وسلم وسب رجل رجلا عنده فجعل المسبوب يقول: عليك السلام فقال رسول الله صلى الله عليه وسلم \"أما إن ملكا بينكما يذب عنك كلما شتمك هذا قال له بل أنت وأنت أحق به وإذا قلت له وعليك السلام قال لا بل عليك وأنت أحق به\" إسناده حسن ولم يخرجوه وقال مجاهد \"قالوا سلاما\" يعني قالوا سدادا وقال سعيد بن جبير ردوا معروفا من القول وقال الحسن البصري قالوا سلام عليكم إن جهل عليهم حلموا يصاحبون عباد الله نهارهم بما يسمعون."
    },
    {
      "ayah": 64,
      "surah": 25,
      "text": "ثم ذكر أن ليلهم خير ليل فقال تعالى \"والذين يبيتون لربهم سجدا وقياما\" أي في طاعته وعبادته كما قال تعالى \"كانوا قليلا من الليل ما يهجعون وبالأسحار هم يستغفرون\" وقوله \"تتجافي جنوبهم عن المضاجع\" الآية. وقال تعالى \"أمن هو قانت آناء الليل ساجدا وقائما يحذر الآخرة ويرجو رحمة ربه\" الآية."
    },
    {
      "ayah": 65,
      "surah": 25,
      "text": "ولهذا قال تعالى \"والذين يقولون ربنا اصرف عنا عذاب جهنم إن عذابها كان غراما\" أي ملازما دائما كما قال الشاعر: إن يعذب يكن غراما وإن يعط جزلا فإنه لا يبالي ولهذا قال الحسن في قوله \"إن عذابها كان غراما\" كل شيء يصيب ابن آدم ويزول عنه فليس بغرام وإنما الغرام اللازم ما دامت السموات والأرض وكذا قال سليمان التيمي وقال محمد بن كعب \"إن عذابها كان غراما\" يعني ما نعموا في الدنيا إن الله تعالى سأل الكفار عن النعمة فلم يردوها إليه فأغرمهم فأدخلهم النار \"إنها ساءت مستقرا ومقاما\" أي بئس المنزل منظرا وبئس المقيل مقاما."
    },
    {
      "ayah": 66,
      "surah": 25,
      "text": "وقال ابن أبي حاتم عند قوله \"إنها ساءت مستقرا ومقاما\" حدثنا أبي حدثنا الحسن بن الربيع حدثنا أبو الأحوص عن الأعمش عن مالك بن الحارث قال: قال إذا طرح الرجل في النار هوى فيها إذا انتهى إلى بعض أبوابها قيل له مكانك حتى تتحف قال فيسقى كأسا من سم الأساود والعقارب قال فيتميز الجلد على حدة والشعر على حدة والعصب على حدة والعروق على حدة وقال أيضا حدثنا أبي حدثنا الحسن بن الربيع حدثنا أبو الأحوص عن الأعمش عن مجاهد عن عبيد بن عمير قال إن في النار لجبابا فيها حيات أمثال البخت وعقارب أمثال البغال الدهم فإذا قذف بهم في النار خرجت إليهم من أوطانها فأخذت بشفاههم وأبشارهم وأشعارهم فكشطت لحومهم إلى أقدامهم فإذا وجدت حر النار رجعت. وقال الإمام أحمد حدثنا الحسن بن موسى حدثنا سلام يعني ابن مسكين عن أبي طلال عن أنس بن مالك رضي الله عنه عن النبي صلى الله عليه وسلم قال \"إن عبدا في جهنم لينادي ألف سنة يا حنان يا منان فيقول الله عز وجل لجبريل اذهب فاتني بعبدي هذا فينطلق جبريل فيجد أهل النار مكبين يبكون فيرجع إلى ربه عز وجل فيخبره فيقول الله عز وجل ائتني به فإنه في مكان كذا وكذا فيجيء به فيوقفه على ربه عز وجل فيقول له يا عبدي كيف وجدت مكانك ومقيلك؟ فيقول يارب شر مكان وشر مقيل فيقول الله عز وجل ردوا عبدي فيقول يارب ما كنت أرجو إذ أخرجتني منها أن تردني فيها فيقول الله عز وجل دعوا عبدي\"."
    },
    {
      "ayah": 67,
      "surah": 25,
      "text": "وقوله تعالى \"والذين إذا أنفقوا لم يسرفوا ولم يقتروا\" الآية أي ليسوا بمبذرين في إنفاقهم فيصرفون فوق الحاجة ولا بخلاء على أهليهم فيقصرون في حقهم فلا يكفونهم بل عدلا خيارا وخير الأمور أوسطها لا هذا ولا هذا \"وكان بين ذلك قواما\" كما قال تعالى \"ولا تجعل يدك مغلولة إلى عنقك ولا تبسطها كل البسط\" الآية وقال الإمام أحمد حدثنا عصام بن خالد حدثني أبو بكر بن عبدالله بن أبي تميم الغساني عن ضمرة عن أبي الدرداء عن النبي صلى الله عليه وسلم قال \"من فقه الرجل قصده في معيشته\" ولم يخرجوه وقال الإمام أحمد أيضا حدثنا أبو عبيدة الحداد حدثنا مسكين بن عبدالعزيز العبدي حدثنا إبراهيم الهجري عن أبي الأحوص عن عبدالله بن مسعود قال: قال رسول الله صلى الله عليه وسلم \"ما عال من اقتصد\" لم يخرجوه وقال الحافظ أبو بكر البزار حدثنا أحمد بن يحيى حدثنا إبراهيم بن محمد بن ميمون حدثنا سعد بن حكيم عن مسلم بن حبيب عن بلال يعني العبسي - عن حذيفة قال: قال رسول الله صلى الله عليه وسلم \"ما أحسن القصد في الغنى وما أحسن القصد في الفقر وما أحسن القصد في العبادة\" ثم قال لا نعرفه يروى إلا من حديث حذيفة رضي الله عنه وقال الحسن البصري ليس في النفقة في سبيل الله سرف وقال إياس بن معاوية: ما جاوزت به أمر الله تعالى فهو سرف وقال غيره السرف النفقة في معصية الله عز وجل."
    },
    {
      "ayah": 68,
      "surah": 25,
      "text": "قال الإمام أحمد حدثنا أبو معاوية حدثنا الأعمش عن شقيق عن عبدالله هو ابن مسعود قال: سئل رسول الله صلى الله عليه وسلم أي الذنب أكبر؟ قال \"أن تجعل لله ندا وهو خلقك\" قال ثم أي؟ قال \"أن تقتل ولدك خشية أن يطعم معك\" قال ثم أي؟ قال \"أن تُزاني حليلةَ جارِك\" قال عبدالله وأنزل الله تصديق ذلك \"والذين لا يدعون مع الله إلها آخر\" الآية وهكذا رواه النسائي عن هناد بن السري عن أبي معاوية به وقد أخرجه البخاري ومسلم من حديث الأعمش ومنصور زاد البخاري وواصل ثلاثتهم عن أبي وائل شقيق بن سلمة عن أبي ميسرة عمرو بن شرحبيل عن ابن مسعود به فالله أعلم ولفظهما عن ابن مسعود قال: قلت يا رسول الله أي الذنب أعظم الحديث طريق غريب وقال ابن جرير حدثنا أحمد بن إسحاق الأهوازي حدثنا عامر بن مدرك حدثنا السري يعني إسماعيل حدثنا الشعبي عن مسروق قال: قال عبدالله خرج رسول الله صلى الله عليه وسلم ذات يوم فاتبعته فجلس على نشز من الأرض وقعدت أسفل منه ووجهي حيال ركبتيه واغتنمت خلوته وقلت بأبي أنت وأمي يا رسول الله أي الذنب أكبر؟ قال \"أن تدعو لله ندا وهو خلقك - قلت ثم مه؟ قال \"أن تقتل ولدك كراهية أن يطعم معك\" قلت ثم مه؟ قال \"أن تزانى حليلة جارك\" ثم قرأ \"والذين لا يدعون مع الله\" الآية وقال النسائي حدثنا قتيبة بن سعيد حدثنا جرير عن منصور عن هلال بن يساف عن سلمة بن قيس قال: قال رسول الله صلى الله عليه وسلم في حجة الوداع \"ألا إنما هي أربع\" فما أنا بأشح عليهن منذ سمعتهن من رسول الله صلى الله عليه وسلم; لا تشركوا بالله شيئا ولا تقتلوا النفس التي حرم الله إلا بالحق ولا تزنوا ولا تسرقوا\" وقال الإمام أحمد حدثنا علي بن المديني رحمه الله حدثنا محمد بن فضيل بن غزوان حدثنا محمد بن سعيد الأنصاري سمعت أبا طيبة الكلاعي سمعت المقداد بن الأسود رضي الله عنه يقول: قال رسول الله صلى الله عليه وسلم لأصحابه \"ما تقولون في الزنا؟\" قالوا حرمه الله ورسوله فهو حرام إلى يوم القيامة فقال رسول الله صلى الله عليه وسلم لأصحابه \"لأن يزني الرجل بعشر نسوة أيسر عليه من أن يزني بامرأة جاره\" قال: \"فما تقولون في السرقة؟ \" قالوا حرمها الله ورسوله فهي حرام قال \"لأن يسرق الرجل من عشرة أبيات أيسر عليه من أن يسرق من بيت جاره\" وقال أبو بكر بن أبي الدنيا حدثنا عمار بن نصر حدثنا بقية عن أبي بكر بن أبي مريم عن الهيثم بن مالك الطائي عن النبي صلى الله عليه وسلم قال \"ما من ذنب بعد الشرك أعظم عند الله من نطفة وضعها رجل في رحم لا يحل له\" وقال ابن جريج أخبرني يعلى عن سعيد بن جبير أنه سمع ابن عباس يحدث أن ناسا من أهل الشرك قتلوا فأكثروا وزنوا فأكثروا ثم أتوا محمدا صلى الله عليه وسلم فقالوا إن الذي تقول وتدعو إليه لحسن لو تخبرنا أنَّ لَمَا عَمِلْنَا كفارةٌ فنزلت \"والذين لا يدعون مع الله إلها آخر\" الآية ونزلت \"قل يا عبادي الذين أسرفوا على أنفسهم\" الآية وقال ابن أبي حاتم حدثنا أبي حدثنا ابن أبي عمر حدثنا سفيان عن عمرو عن أبي فاختة قال: قال رسول الله صلى الله عليه وسلم لرجل \"إن الله ينهاك أن تعبد المخلوق وتدع الخالق وينهاك أن تقتل ولدك وتغذو كلبك وينهاك أن تزني بحليلة جارك\" قال سفيان وهو قوله \"والذين لا يدعون مع الله إلها آخر\" الآية وقوله تعالى \"ومن يفعل ذلك يلق أثاما\" روي عن عبدالله بن عمرو أنه قال: أثاما: واد في جهنم وقال عكرمة \"يلق أثاما\" أودية في جهنم يعذب فيها الزناة وكذا روي عن سعيد بن جبير ومجاهد وقال قتادة \"يلق أثاما\" نكالا: كنا نحدث أنه واد في جهنم. وقد ذُكر لنا أن لقمان كان يقول: يا بني ; إياك والزنا فإن أولَه مخافةٌ وآخرَه ندامةٌ. وقد ورد في الحديث الذي رواه ابن جرير وغيره عن ابن أمامة الباهلي موقوفا ومرفوعا أن غيا وأثاما بئران في قعر جهنم. أجارنا الله منهما بمنه وكرمه وقال السدي \"يلق أثاما\" جزاء وهذا أشبه بظاهر الآية وبهذا فسره بما بعده مبدلا منه."
    },
    {
      "ayah": 69,
      "surah": 25,
      "text": "وهو قوله تعالى \"يضاعف له العذاب يوم القيامة\" أي يكرر عليه ويغلظ \"ويخلد فيه مهانا\" أي حقيرا ذليلا."
    },
    {
      "ayah": 7,
      "surah": 25,
      "text": "يخبر تعالى عن تعنت الكفار وعنادهم وتكذيبهم للحق بلا حجة ولا دليل منهم وإنما تعللوا بقولهم \"ما لهذا الرسول يأكل الطعام\" يعنون كما نأكله ويحتاج إليه كما نحتاج \"ويمشي في الأسواق\" أي يتردد فيها وإليها طلبا للتكسب والتجارة \" لولا أنزل إليه ملك فيكون معه نذيرا\" يقولون هلا أنزل إليه ملك من عند الله فيكون شاهدا على صدق ما يدعيه."
    },
    {
      "ayah": 70,
      "surah": 25,
      "text": "وقوله تعالى \"إلا من تاب وآمن وعمل عملا صالحا\" أي جزاؤه على ما فعل من هذه الصفات القبيحة ما ذكر \"إلا من تاب\" أي في الدنيا إلى الله عز وجل من جميع ذلك فإن الله يتوب عليه وفي ذلك دلالة على صحة توبة القاتل ولا تعارض بين هذه وبين آية النساء \"ومن يقتل مؤمنا متعمدا\" الآية فإن هذه وإن كانت مدنية إلا أنها مطلقة فتحمل على من لم يتب لأن هذه مقيدة بالتوبة ثم قد قال تعالى \"إن الله لا يغفر أن يشرك به\" الآية قد ثبتت السنة الصحيحة عن رسول الله صلى الله عليه وسلم بصحة توبة القاتل كما ذكر مقررا من قصة الذي قتل مائة رجل ثم تاب فقبل الله توبته وغير ذلك من الأحاديث وقوله تعالى \"فأولئك يبدل الله سيئاتهم حسنات وكان الله غفورا رحيما\" في معنى قوله \"يبدل الله سيئاتهم حسنات\" قولان أحدهما أنهم بدلوا مكان عمل السيئات بعمل الحسنات قال علي بن أبي طلحة عن ابن عباس في الآية قال هم المؤمنون كانوا من قبل إيمانهم على السيئات فرغب الله بهم عن السيئات فحولهم إلى الحسنات فأبدلهم مكان السيئات الحسنات وروي عن مجاهد عن ابن عباس أنه كان ينشد عند هذه الآية: بدلن بعد حره خريفا وبعد طول النفس الوجيفا يعني تغيرت تلك الأحوال إلى غيرها وقال عطاء بن أبي رباح هذا في الدنيا يكون الرجل على صفة قبيحة ثم يبدله الله بها خيرا وقال سعيد بن جبير أبدلهم الله بعباده الأوثان عبادة الرحمن وأبدلهم بقتال المسلمين قتال المشركين وأبدلهم بنكاح المشركات نكاح المؤمنات وقال الحسن البصري أبدلهم الله بالعمل السيء العمل الصالح وأبدلهم بالشرك إخلاصا وأبدلهم بالفجور إحصانا وبالكفر إسلاما وهذا قول أبي العالية وقتادة وجماعة آخرين \"والقول الثاني\" أن تلك السيئات الماضية تنقلب بنفس التوبة النصوح حسنات وما ذاك إلا لأنه كلما تذكر ما مضى ندم واسترجع واستغفر فينقلب الذنب طاعة بهذا الاعتبار فيوم القيامة وإن وجده مكتوبا عليه فإنه لا يضره وينقلب حسنة في صحيفته كما ثبتت السنة بذلك وصحت به الآثار المروية عن السلف رضي الله عنهم فعن أبي ذر رضي الله عنهم قال: قال رسول الله صلى الله عليه وسلم \"إني لأعرف آخر أهل النار خروجا من النار وآخر أهل الجنة دخولا إلى الجنة; يؤتى برجل فيقول نحوا عنه كبار ذنوبه وسلوه عن صغارها قال فيقال له عملتَ يوم كذا: كذا وكذا وعملتَ يوم كذا: كذا وكذا فيقول نعم لا يستطيعُ أن ينكر من ذلك شيئا فيقال: فإن لك بكل سيئة حسنة فيقول يارب عملتُ أشياء لا أراها ههنا\" قال فضحك رسول الله صلى الله عليه وسلم حتى بدت نواجذه; انفرد بإخراجه مسلم وقال الحافظ أبو القاسم الطبراني حدثنا هاشم بن يزيد حدثنا محمد بن إسماعيل حدثني أبي حدثني ضمضم بن زرعة عن شريح بن عبيد عن أبي مالك الأشعري قال: قال رسول الله صلى الله عليه وسلم \"إذا نام ابن آدم قال الملك للشيطان أعطني صحيفتَك فيعطيه إياها فما وجد في صحيفةٍ من حسنةٍ محا بها عشر سيئات من صحيفة الشيطان وكتبهن حسنات فإذا أراد أحدكم أن ينام فليكبر ثلاثا وثلاثين تكبيرة ويحمد أربعا وثلاثين تحميدة ويسبح ثلاثا وثلاثين تسبيحة فتلك مائة\" وقال ابن أبي حاتم حدثنا أبي حدثنا أبو سلمة وعارم قالا حدثنا ثابت يعني ابن يزيد أبو زيد حدثنا عاصم عن أبي عثمان عن سلمان قال يعطى الرجل يوم القيامة صحيفته فيقرأ أعلاها فإذا سيئاته فإذا كاد يسوء ظنه نظر في أسفلها فإذا حسناته ثم ينظر في أعلاها فإذا هي قد بدلت حسنات وقال أيضا حدثنا أبي حدثنا هشام بن عمار حدثنا سلمان بن موسى الزهري أبو داود حدثنا أبو العنبس عن أبيه عن أبي هريرة قال: ليأتين الله عز وجل بأناس يوم القيامة رأوا أنهم قد استكثروا من السيئات قيل من هم يا أبا هريرة؟ قال الذين يبدل الله سيئاتهم حسنات وقال أيضا حدثنا أبي حدثنا عبدالله ابن أبي زياد حدثنا سيار حدثنا جعفر حدثنا أبو حمزة عن أبي الصيف - قلت وكان من أصحاب معاذ بن جبل - قال: يدخل أهل الجنة الجنة على أربعة أصناف المتقين ثم الشاكرين ثم الخائفين ثم أصحاب اليمين قلت لم سموا أصحاب اليمين ؟ قال لأنهم قد عملوا بالسيئات والحسنات فأعطوا كتبهم بأيمانهم فقرءوا سيئاتهم حرفا حرفا وقالوا يا ربنا هذه سيئاتنا فأين حسناتنا؟ فعند ذلك محا الله السيئات وجعلها حسنات فعند ذلك قالوا \"هاؤم اقرءوا كتابيه\" فهم أكثر أهل الجنة وقال علي بن الحسين زين العابدبن \"يبدل الله سيئاتهم حسنات\" قال في الآخرة وقال مكحول يغفرها لهم فيجعلها حسنات رواهما ابن أبي حاتم وروى ابن جرير عن سعيد بن المسيب مثله قال ابن أبي حاتم حدثنا أبي حدثنا محمد بن الوزير الدمشقي حدثنا الوليد بن مسلم حدثنا أبو جابر أنه سمع مكحولا يحدث قال: جاء شيخ كبير هرم قد سقط حاجباه على عينيه فقال يا رسول الله رجل غدر وفجر ولم يدع حاجة ولا داجة إلا اقتطفها بيمينه لو قسمت خطيئته بين أهل الأرض لأوبقتهم فهل له من توبة؟ فقال النبي صلى الله عليه وسلم \"أأسلمت ؟ \" فقال أما أنا فأشهد أن لا إله إلا الله وحده لا شريك له وأن محمدا عبده ورسوله فقال النبي صلى الله عليه وسلم \"فإن الله غافر لك ما كنت كذلك ومبدل سيئاتك حسنات\" فقال يا رسول الله وغدراتي وفجراتي؟ فقال \"وغدراتك وفجراتك\" فولى الرجل يكبر ويهلل وروى الطبراني من حديث أبي المغيرة عن صفوان بن عمر عن عبدالرحمن بن جبير عن أبي فروة أنه أتى رسول الله صلى الله عليه وسلم فقال: أرأيت رجلا عمل الذنوب كلها ولم يترك حاجة ولا داجة فهل له من توبة؟ فقال \"أسلمت ؟\" فقال نعم. قال \"فافعل الخيرات واترك السيئات فيجعلها الله لك خيرات كلها\" قال وغدراتي وفجراتي؟ قال \"نعم\" فما زال يكبر حتى توارى ورواه الطبراني من طريق أبي فروة الرهاوي عن ياسين الزيات عن أبي سلمة الحمصي عن يحيى بن جابر عن سلمة بن نفيل مرفوعا وقال أيضا حدثنا أبو زرعة حدثنا إبراهيم ابن المنذر حدثنا عيسى بن شعيب بن ثوبان عن فليح بن عبيد بن أبي عبيد الشماس عن أبيه عن أبي هريرة رضي الله عنه قال: جاءتني امرأة فقالت هل لي من توبة؟ إني زنيت وولدت وقتلته فقلت لا ولا نعمت العين ولا كرامة فقامت وهي تدعو بالحسرة ثم صليت مع النبي صلى الله عليه وسلم الصبح فقصصت عليه ما قالت المرأة وما قلت لها فقال رسول الله صلى الله عليه وسلم \"بئسما قلت أما كنت تقرأ هذه الآية ؟\" \"والذين لا يدعون مع الله إلها آخر - إلى قوله - \"إلا من تاب\" الآية فقرأتها عليها فخرت ساجدة وقالت الحمد لله الذي جعل لي مخرجا هذا حديث غريب من هذا الوجه وفي رجاله من لا يعرف والله أعلم.وقد رواه ابن جرير من حديث إبراهيم بن المنذر الحزامي بسنده بنحوه وعنده فخرجت تدعو بالحسرة وتقول يا حسرتا أخلق هذا الحسن للنار؟ وعنده أنه لما رجع من عند رسول الله صلى الله عليه وسلم يطلبها في جميع دور المدينة فلم يجدها فلما كان من الليلة المقبلة جاءته فأخبرها بما قال له رسول الله صلى الله عليه وسلم فخرت ساجدة وقالت الحمد لله الذي جعل لي مخرجا وتوبة مما عملت وأعتقت جارية كانت معها وابنتها وتابت إلى الله عز وجل ثم قال تعالى مخبرا عن عموم رحمته بعباده وأنه من تاب إليه منهم تاب عليه من أي ذنب كان جليلا أو حقيرا كبيرا أو صغيرا."
    },
    {
      "ayah": 71,
      "surah": 25,
      "text": "فقال تعالى \"ومن تاب وعمل صالحا فإنه يتوب إلى الله متابا\" أي فإن الله يقبل توبته كما قال تعالى \"ومن يعمل سوءا أو يظلم نفسه\" الآية وقال تعالى \"ألم يعلموا أن الله هو يقبل التوبة عن عباده\" الآية وقال تعالى \"قل يا عبادي الذين أسرفوا على أنفسهم لا تقطنوا من رحمة الله\" الآية أي لمن تاب إليه."
    },
    {
      "ayah": 72,
      "surah": 25,
      "text": "وهذه أيضا من صفات عباد الرحمن أنهم لا يشهدون الزور قيل هو الشرك وعبادة الأصنام وقيل الكذب والفسق والكفر واللغو والباطل وقال محمد بن الحنفية هو اللغو والغناء وقال أبو العالية وطاوس وابن سيرين والضحاك والربيع بن أنس وغيرهم هو أعياد المشركين وقال عمرو بن قيس هي مجالس السوء والخنا وقال مالك عن الزهري: شرب الخمر لا يحضرونه ولا يرغبون فيه كما جاء في الحديث \"من كان يؤمن بالله واليوم الآخر فلا يجلس على مائدة يدار عليها الخمر\" وقيل المراد بقوله تعالى \"لا يشهدون الزور\" أي شهادة الزور وهي الكذب متعمدا على غيره كما في الصحيحين عن أبي بكرة قال: قال رسول الله صلى الله عليه وسلم \"ألا أنبئكم بأكبر الكبائر؟\" ثلاثا - قلنا بلى يا رسول الله قال \"الشرك بالله وعقوق الوالدين\" وكان متكئا فجلس فقال \"ألا وقول الزور ألا وشهادة الزور\" فما زال يكررها حتى قلنا ليته سكت والأظهر من السياق أن المراد لا يشهدون الزور أي لا يحضرونه ولهذا قال تعالى \"وإذا مروا باللغو مروا كراما\" أي لا يحضرون الزور وإذا اتفق مرورهم به مروا ولم يتدنسوا منه بشيء ولهذا قال \"مروا كراما\" وقال ابن أبي حاتم حدثنا أبو سعيد الأشج حدثنا أبو الحسن العجلي عن محمد ابن مسلم أخبرني إبراهيم بن ميسرة أن ابن مسعود مر بلهو فلم يقف فقال رسول الله صلى الله عليه وسلم \"لقد أصبح ابن مسعود وأمسى كريما\" وحدثنا الحسين بن محمد بن سلمة النحوي ثنا حبان أنا عبدالله أنا محمد بن مسلم أخبرني ميسرة قال بلغني أن ابن مسعود مر بلهو معرضا فلم يقف فقال رسول الله صلى الله عليه وسلم \"لقد أصبح ابن مسعود وأمسى كريما\" ثم تلا إبراهيم بن ميسرة \"وإذا مروا باللغو مروا كراما\"."
    },
    {
      "ayah": 73,
      "surah": 25,
      "text": "وقوله تعالى \"والذين إذا ذكروا بآيات ربهم لم يخروا عليها صما وعميانا \"وهذه أيضا من صفات المؤمنين \"الذين إذا ذكر الله وجلت قلوبهم وإذا تليت عليهم آياته زادتهم إيمانا وعلى ربهم يتوكلون\" بخلاف الكافر فإنه إذا سمع كلام الله لا يؤثر فيه ولا يتغير عما كان عليه بل يبقى مستمرا على كفره وطغيانه وجهله وضلاله كما قال تعالى \"وإذا ما أنزلت سورة فمنهم من يقول أيكم زادته هذه إيمانا فأما الذين آمنوا فزادتهم إيمانا وهم يستبشرون وأما الذين في قلوبهم مرض فزادتهم رجسا إلى رجسهم\" فقوله \"لم يخروا عليها صما وعميانا\" أي بخلاف الكافر الذي إذا سمع آيات الله فلا تؤثر فيه فيستمر على حاله كأن لم يسمعها أصم أعمى قال مجاهد قوله \"لم يخروا عليها صما وعميانا\" قال لم يسمعوا ولم يبصروا ولم يفقهوا شيئا وقال الحسن البصري رضي الله عنه: كم من رجل يقرؤها ويخر عليها أصم أعمى وقال قتادة قوله تعالى \"والذين إذا ذكروا بآيات ربهم لم يخروا عليها صما وعميانا\" يقول لم يصموا عن الحق ولم يعموا فيه فهم والله قوم عقلوا عن الحق وانتفعوا بما سمعوا من كتابه وقال ابن أبي حاتم حدثنا أسيد بن عاصم حدثنا عبدالله بن حمران ثنا ابن عون قال سألت الشعبي قلت الرجل يرى القوم سجودا ولم يسمع ما سجدوا أيسجد معهم؟ قال فتلا هذه الآية: يعني أنه لا يسجد معهم لأنه لم يتدبر أمر السجود ولا ينبغي للمؤمن أن يكون إمعة بل يكون على بصيرة في أمره ويقين واضح بين وقوله تعالى \"والذين يقولون ربنا هب لنا من أزواجنا وذرياتنا قرة أعين\" يعني الذين يسألون الله أن يخرج من أصلابهم من ذرياتهم من يطيعه ويعبده وحده لا شريك له قال ابن عباس يعنون من يعمل بطاعة الله فتقر به أعينهم في الدنيا والآخرة قال عكرمة: لم يريدوا بذلك صباحة ولا جمال ولكن أرادوا أن يكونوا مطيعين وسئل الحسن البصري عن هذه الآية فقال أن يرى الله العبد المسلم من زوجته ومن أخيه ومن حميمه طاعة الله لا والله لا شيء أقر لعين المسلم من أن يرى ولدا أو ولد ولد أو أخا وحميما مطيعا لله عز وجل قال ابن جريج في قوله \"هب لنا من أزواجنا وذرياتنا قرة أعين\" قال يعبدونك فيحسنون عبادتك ولا يجرون علينا الجرائر وقال عبدالرحمن بن زيد بن أسلم: يعني يسألون الله تعالى لأزواجهم وذرياتهم أن يهديهم للإسلام وقال الإمام أحمد حدثنا معمر بن بشر حدثنا عبدالله بن المبارك أخبرنا صفوان بن عمرو حدثني عبد الرحمن بن جبير بن نفير عن أبيه قال: جلسنا إلى المقداد بن الأسود يوما فمر به رجل فقال طوبى لهاتين العينين اللتين رأيا رسول الله صلى الله عليه وسلم لوددنا أنا رأينا ما رأيت وشهدنا ما شهدت فاستغضب المقداد فجعلت أعجب لأنه ما قال إلا خيرا ثم أقبل إليه فقال ما يحمل الرجل على أن يتمنى محضرا غيبه الله عنه لا يدري لو شهده كيف يكون فيه والله لقد حضر رسول الله صلى الله عليه وسلم أقواما أكبهم الله على مناخرهم في جهنم لم يجيبوه ولم يصدقوه أَوَلَا تحمدون الله إذ أخرجكم من بطون أمهاتكم لا تعرفون إلا ربكم مصدقين بما جاء به نبيكم قد كفيتم البلاء بغيركم؟ لقد بعث الله النبي صلى الله عليه وسلم على أشر حال بعث عليها نبيا من الأنبياء في فترة جاهلية ما يرون أن دينا أفضل من عبادة الأوثان فجاء بفرقان فرق به بين الحق والباطل وفرق بين الوالد وولده إن كان الرجل ليرى والده وولده وأخاه كافرا وقد فتح الله قفل قلبه للإيمان يعلم أنه إن هلك دخل النار فلا تقر عينه وهو يعلم أن حبيبه في النار."
    },
    {
      "ayah": 74,
      "surah": 25,
      "text": "وأنها التي قال الله تعالى \"والذين يقولون ربنا هب لنا من أزواجنا وذرياتنا قرة أعين\" وهذا إسناد صحيح ولم يخرجوه وقوله تعالى \"واجعلنا للمتقين إماما\" قال ابن عباس والحسن والسدي وقتادة والربيع بن أنس أئمة يقتدى بنا في الخير. وقال غيرهم هداة مهتدين دعاة إلى الخير فأحبوا أن تكون عبادتهم متصلة بعبادة أولادهم وذرياتهم وأن يكون هداهم متعديا إلى غيرهم بالنفع وذلك أكثر ثوابا وأحسن مآبا ولهذا ثبت في صحيح مسلم عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم \"إذا مات ابن آدم انقطع عمله إلا من ثلاث: ولد صالح يدعو له أو علم ينتفع به من بعده أو صدقة جارية\"."
    },
    {
      "ayah": 75,
      "surah": 25,
      "text": "لما ذكر تعالى من أوصاف عباده المؤمنين ما ذكر من الصفات الجميلة والأقوال والأفعال الجليلة قال بعد ذلك كله \"أولئك\" أي المتصفون بهذه \"يجزون\" يوم القيامة \"الغرفة\" وهي الجنة قال أبو جعفر الباقر وسعيد ابن جبير والضحاك والسدي سميت بذلك لارتفاعها \"بما صبروا\" أي على القيام بذلك \"ويلقون فيها\" أي في الجنة \"تحية وسلاما\" أي يبتدرون فيها بالتحية والإكرام ويلقون التوقير والاحترام فلهم السلام وعليهم السلام فإن الملائكة يدخلون عليهم من كل باب سلام عليكم بما صبرتم فنعم عقبى الدار."
    },
    {
      "ayah": 76,
      "surah": 25,
      "text": "وقوله تعالى \"خالدين فيها\" أي مقيمين لا يظعنون ولا يحولون ولا يموتون ولا يزولون عنها ولا يبغون عنها حولا كما قال تعالى \"وأما الذين سعدوا ففي الجنة خالدين فيها ما دامت السموات والأرض\" الآية وقوله تعالى \"حسنت مستقرا و مقاما\" أي حسنت منظرا وطابت مقيلا ومنزلا."
    },
    {
      "ayah": 77,
      "surah": 25,
      "text": "ثم قال تعالى \"قل ما يعبأ بكم ربي\" أي لا يبالي ولا يكترث بكم إذا لم تعبدوه فإنه إنما خلق الخلق ليعبدوه ويوحدوه ويسبحوه بكرة وأصيلا قال مجاهد وعمرو بن شعيب \"ما يعبأ بكم ربي\" يقول ما يفعل بكم ربي وقال علي بن أبي طلحة عن ابن عباس في قوله \"قال ما يعبأ بكم ربي\" الآية يقول لولا إيمانكم وأخبر تعالى الكفار أنه لا حاجة له بهم إذ لم يخلقهم مؤمنين ولو كان له بهم حاجة لحبب إليهم الإيمان كما حببه إلى المؤمنين وقوله تعالى \"فقد كذبتم\" أيها الكافرون \"فسوف يكون لزاما\" أي فسوف يكون تكذيبكم لزاما لكم يعني مقتضيا لعذابكم وهلاككم ودماركم في الدنيا والآخرة ويدخل في ذلك يوم بدر كما فسره بذلك عبدالله بن مسعود وأبي بن كعب ومحمد بن كعب القرظي ومجاهد والضحاك وقتادة والسدي وغيرهم وقال الحسن البصري \"فسوف يكون لزاما\" أي يوم القيامة ولا منافاة بينهما. آخر تفسير سورة الفرقان ولله الحمد والمنة."
    },
    {
      "ayah": 8,
      "surah": 25,
      "text": "وهذا كما قال فرعون \"فلولا ألقي عليه أسورة من ذهب أو جاء معه الملائكة مقترنين\" وكذلك قال هؤلاء على السواء تشابهت قلوبهم ولهذا قالوا \"أو يلقى إليه كنز\" أي علم كنز ينفق منه \"أو تكون له جنة يأكل منها\" أي تسير معه حيث سار وهذا كله سهل يسير على الله ولكن له الحكمة في ترك ذلك وله الحجة البالغة\" وقال الظالمون إن تتبعون إلا رجلا مسحورا\"."
    },
    {
      "ayah": 9,
      "surah": 25,
      "text": "قال الله تعالى \"انظر كيف ضربوا لك الأمثال فضلوا\" أي جاءوا بما يقذفونك به ويكذبون به عليك من قولهم ساحر مسحور مجنون كذاب شاعر وكلها أقوال باطلة كل أحد ممن له أدنى فهم وعقل يعرف كذبهم وافتراءهم في ذلك ولهذا قال \"فضلوا\" عن طريق الهدى \"فلا يستطيعون سبيلا\" وذلك أن كل من خرج عن الحق وطريق الهدى فإنه ضال حيثما توجه لأن الحق واحد ومنهجه متحد يصدق بعضه بعضا."
    }
  ]
}
