{
  "ayahs": [
    {
      "ayah": 1,
      "surah": 26,
      "text": "سورة الشعراء: \"ووقع في تفسير مالك المروي عنه تسميتها سورة الجامعة\" قد اختلف المفسرون في الحروف المقطعة التي في أوائل السور فمنهم من قال هي مما استأثر الله بعلمه فردوا علمها إلى الله ولم يفسرها حكاه القرطبي في تفسـره عن أبي بكر وعمر وعثمان وعلي وابن مسعود رضي الله عنهم أجمعين وقاله عامر الشعبي وسفيان الثوري والربيع بن خيثم واختاره أبو حاتم بن حبان. ومنهم من فسرها واختلف هؤلاء في معناها فقال عبدالرحمن بن زيد بن أسلم إنما هي أسماء السور. قال العلامة أبو القاسم محمود بن عمر الزمخشري في تفسيره وعليه إطباق الأكثر ونقل عن سيبويه أنه نص عليه ويعتضد لهذا بما ورد في الصحيحين عن أبي هريرة أن رسول الله صلى الله عليه وسلم كان يقرأ في صلاة الصبح يوم الجمعة \"الم\" السجدة و \"هل أتى على الإنسان\" وقال سفيان الثوري عن ابن أبي نجيح عن مجاهد أنه قال: الم وحم والمص وص. فواتح افتتح الله بها القرآن وكذا قال غيره عن مجاهد وقال مجاهد في رواية أبي حذيفة موسى بن مسعود عن شبل عن ابن أبي نجيح عنه أنه قال الم اسم من أسماء القرآن وهكذا وقال قتادة وزيد بن أسلم ولعل هذا يرجع إلى معنى قول عبدالرحمن بن زيد بن أسلم أنه اسم من أسماء السور فإن كل سورة يطلق عليها اسم القرآن فإنه يبعد أن يكون المص اسما للقرآن كله لأن المتبادر إلى فهم سامع من يقول قرأت المص إنما ذلك عبارة عن سورة الأعراف لا لمجموع القرآن والله أعلم. وقيل هي اسم من أسماء الله تعالى فقال عنها في فواتح السور من أسماء الله تعالى وكذلك قال سالم بن عبدالله وإسماعيل بن عبدالرحمن السدي الكبير وقال شعبة عن السدي بلغني أن ابن عباس قال الم اسم من أسماء الله الأعظم. هكذا رواه ابن أبي حاتم من حديث شعبة ورواه ابن جرير عن بندار عن ابن مهدي عن شعبة قال سألت السدي عن حم وطس والم فقال قال ابن عباس هي اسم الله الأعظم وقال ابن جرير وحدثنا محمد بن المثنى حدثنا أبو النعمان حدثنا شعبة عن إسماعيل السدي عن مرة الهمذاني قال: قال عبدالله فذكر نحوه. وحُكي مثله عن علي وابن عباس وقال علي بن أبي طلحة عن ابن عباس هو قسم أقسم الله به وهو من أسماء الله تعالى وروى ابن أبي حاتم وابن جرير من حديث ابن علية عن خالد الحذاء عن عكرمة أنه قال الم قسم. وروينا أيضا من حديث شريك بن عبدالله بن عطاء بن السائب عن أبي الضحى عن ابن عباس: الم قال أنا الله أعلم وكذا قال سعيد بن جبير وقال السدي عن أبي مالك وعن أبي صالح عن ابن عباس وعن مرة الهمذاني عن ابن مسعود وعن ناس من أصحاب النبي صلى الله عليه وسلم الم قال أما الم فهي حروف استفتحت من حروف هجاء أسماء الله تعالى. قال وأبو جعفر الرازي عن الربيع بن أنس عن أبي العالية في قوله تعالى الم قال هذه الأحرف الثلاثة من التسعة والعشرين حرفا دارت فيها الألسن كلها ليس منها حرف إلا وهو مفتاح اسم من أسمائه وليس منها حرف إلا وهو من آلائه وبلألائه ليس منها حرف إلا وهو في مدة أقوام وآجالهم. قال عيسى ابن مريم عليه السلام وعجب: فقال أعجب أنهم يظنون بأسمائه ويعيشون في رزقه فكيف يكفرون به فالألف مفتاح الله واللام مفتاح اسمه لطيف والميم مفتاح اسمه مجيد فالألف آلاء الله واللام لطف الله والميم مجد الله والألف سنة واللام ثلاثون سنة والميم أربعون سنة. هذا لفظ ابن أبي حاتم ونحوه رواه ابن جرير ثم شرع يوجه كل واحد من هذه الأقوال ويوفق بينها وأنه لا منافاة بين كل واحد منها وبين الآخر وأن الجمع ممكن فهي أسماء للسور ومن أسماء الله تعالى يفتتح بها السور فكل حرف منها دل على اسم من أسمائه وصفة من صفاته كما افتتح سورا كثيرة بتحميده وتسبيحه وتعظيمه قال ولا مانع من دلالة الحرف منها على اسم من أسماء الله وعلى صفة من صفاته وعلى مدة وغير ذلك كما ذكره الربيع بن أنس عن أبي العالية لأن الكلمة الواحدة تطلق على معاني كثيرة كلفظة الأمة فإنها تطلق ويراد به الدين كقوله تعالى \"إنا وجدنا آباءنا على أمة\" وتطلق ويراد بها الرجل المطيع لله كقوله تعالى \"إن إبراهيم كان أمة قانتا لله حنيفا ولم يك من المشركين\" وتطلق ويراد بها الجماعة كقوله تعالى \"وجد عليه أمة من الناس يسقون\" وقوله تعالى \"ولقد بعثنا في كل أمة رسولا\" وتطلق ويراد بها الحين من الدهر كقوله تعالى \"وقال الذي نجا منهما وادكر بعد أمة\" أي بعد حين على أصح القولين قال فكذلك هذا. هذا حاصل كلامه موجها ولكن هذا ليس كما ذكره أبو العالية فإن أبا العالية زعم أن الحرف دل على هذا وعلى هذا وعلى هذا معا ولفظة الأمة وما أشبهها من الألفاظ المشتركة في الاصطلاح إنما دل في القرآن في كل موطن على معنى واحد دل عليه سياق الكلام فأما حمله على مجموع محامله إذا أمكن فمسألة مختلف فيها بين علماء الأصول ليس هذا موضع البحث فيها والله أعلم. ثم إن لفظة الأمة تدل على كل من معانيها في سياق الكلام بدلالة الوضع فأما دلالة الحرف الواحد على اسم يمكن أن يدل على اسم آخر من غير أن يكون أحدهما أولى من الآخر في التقدير أو الإضمار بوضع ولا بغيره فهذا مما لا يفهم إلا بتوقيف والمسألة مختلف فيها وليس فيها إجماع حتى يحكم به وما أنشدوه من الشواهد على صحة إطلاق الحرف الواحد على بقية الكلمة فإن في السياق ما يدل على ما حذف بخلاف هذا كما قال الشاعر: قلنا قفي لنا فقالت قاف لا تحسبي أنا نسينا الإيجاف تعني وقفت. وقال الآخر: ما للظليم عال كيف لا يـ ينقد عنه جلده إذا يـ فقال ابن جرير كأنه أراد أن يقول إذا يفعل كذا وكذا فاكتفى بالياء من يفعل وقال الآخر: بالخير خيرات وان شرا فا ولا أريد الشر إلا أن تـ يقول وإن شرا فشرا ولا أريد الشر إلا أن تشاء فاكتفى بالفاء والتاء من الكلمتين عن بقيتهما ولكن هذا ظاهر من سياق الكلام والله أعلم. قال القرطبي وفي الحديث \"من أعان على قتل مسلم بشطر كلمة\" الحديث قال سفيان هو أن يقول في اقتل\"ا قـ\" وقال خصيف عن مجاهد أنه قال فواتح السور كلها\"ق وص وحم وطسم والر\" وغير ذلك هجاء موضوع وقال بعض أهل العربية هي حروف من حروف المعجم استغنى بذكر ما ذكر منها في أوائل السور عن ذكر بواقيها التي هي تتمة الثمانية والعشرين حرفا كما يقول القائل ابني يكتب في - ا ب ت ث - أي في حروف المعجم الثمانية والعشرين فيستغني بذكر بعضها عن مجموعها حكاه ابن جرير. قلت مجموع الحروف المذكورة في أوائل السور بحذف المكرر منها أربعة عشر حرفا وهي - ال م ص ر ك ه ي ع ط س ح ق ن- يجمعها قولك: نص حكيم قاطع له سر. وهي نصف الحروف عددا والمذكور منها أشرف من المتروك وبيان ذلك من صناعة التصريف. قال الزمخشري وهذه الحروف الأربعة عشر مشتملة على أصناف أجناس الحروف يعني من المهموسة والمجهورة ومن الرخوة والشديدة ومن المطبقة والمفتوحة ومن المستعلية والمنخفضة ومن حروف القلقلة. وقد سردها مفصلة ثم قال: فسبحان الذي دقت في كل شيء حكمته. وهذه الأجناس المعدودة مكثورة بالمذكورة منها وقد علمت أن معظم الشيء وجله ينزل منزلة كله وههنا ههنا لخص بعضهم في هذا المقام كلاما فقال: لا شك أن هذه الحروف لم ينزلها سبحانه وتعالى عبثا ولا سدى ومن قال من الجهلة إن في القرآن ما هو تعبد لا معنى له بالكلمة فقد أخطأ خطأ كبيرا فتعين أن لها معنى في نفس الأمر فإن صح لنا فيها عن المعصوم شيء قلنا به وإلا وقفنا حيث وقفنا وقلنا \"آمنا به كل من عند ربنا\" ولم يجمع العلماء فيها على شيء معين وإنما اختلفوا فمن ظهر له بعض الأقوال بدليل فعليه اتباعه وإلا فالوقف حتى يتبين هذا المقام. المقام الآخر في الحكمة التي اقتضت إيراد هذه الحروف في أوائل السور ما هي مع قطع النظر عن معانيها في أنفسها فقال بعضهم إنما ذكرت ليعرف بها أوائل السور حكاه ابن جرير وهذا ضعيف لأن الفصل حاصل بدونها فيما لم تذكر فيه وفيما ذكرت فيه البسملة تلاوة وكتابة وقال آخرون بل ابتدئ بها لتفتح لاستماعها أسماع المشركين إذ تواصوا بالإعراض عن القرآن حتى إذا استمعوا له تلا عليهم المؤلف منه حكاه ابن جرير أيضا وهو ضعيف أيضا لأنه لو كان كذلك لكان ذلك في جميع السور لا يكون في بعضها بل غالبها ليس كذلك ولو كـان كذلك أيضا لانبغى الابتداء بها في أوائل الكلام معهم سواء كان افتتاح سورة أو غير ذلك ثم إن هذه السورة والتي تليها أعني البقرة وآل عمران مدنيتان ليستا خطابا للمشركين فانتقض ما ذكروه بهذه الوجوه. وقال آخرون بل إنما ذكرت هذه الحروف في أوائل السور التي ذكرت فيها بيانا لإعجاز القرآن وأن الخلق عاجزون عن معارضته بمثله هذا مع أنه مركب من هذه الحروف المقطعة التي يتخاطبون بها وقد حكى هذا المذهب الرازي في تفسيره عن المبرد وجمع من المحققين وحكى القرطبي عن الفراء وقطرب نحو هذا وقرره الزمخشري في كشافه ونصره أتم نصر وإليه ذهب الشيخ الإمام العلامة أبو العباس ابن تيمية وشيخنا الحافظ المجتهد أبو الحجاج المزي وحكاه لي عن ابن تيمية. قال الزمخشري ولم ترد كلها مجموعة في أول القرآن وإنما كررت ليكون أبلغ في التحدي والتبكيت كما كررت قصص كثيرة وكرر التحدي بالصريح في أماكن قال وجاء منها على حرف واحد كقوله - ص ن ق- وحرفين مثل \"حم\" وثلاثة مثل \"الم\" وأربعة مثل \"المر\" و \"المص\" وخمسة مثل \"كهيعص- و- حم عسق\" لأن أساليب كلامهم على هذا من الكلمات ما هو على حرف وعلى حرفين وعلى ثلاثة وعلى أربعة وعلى خمسة لا أكثر من ذلك \"قلت\" ولهذا كل سورة افتتحت بالحروف فلا بد أن يذكر فيها الانتصار للقرآن وبيان إعجازه وعظمته وهذا معلوم بالاستقراء وهو الواقع في تسع وعشرين سورة ولهذا يقول تعالى \"الم ذلك الكتاب لا ريب فيه\" \"الم الله لا إله إلا هو الحي القيوم نزل عليك الكتاب بالحق مصدقا لما بين يديه\" \"المص كتاب أنزل إليك فلا يكن في صدرك حرج منه\" \"الر كتاب أنزلناه إليك لتخرج الناس من الظلمات إلى النور بإذن ربهم\" \"الم تنزيل الكتاب لا ريب فيه من رب العالمين\" \"حم تنزيل من الرحمن الرحيم\" \"حم عسق كذلك يوحي إليك وإلى الذين من قبلك الله العزيز الحكيم\" وغير ذلك من الآيات الدالة على صحة ما ذهب إليه هؤلاء لمن أمعن النظر والله أعلم. وأما من زعم أنها دالة على معرفة المدد وأنه يستخرج من ذلك أوقات الحوادث والفتن والملاحم فقد ادعى ما ليس له وطار في غير مطاره وقد ورد في ذلك حديث ضعيف وهو مع ذلك أدل على بطلان هذا المسلك من التمسك به على صحته وهو ما رواه محمد بن إسحق بن يسار صاحب المغازي حدثني الكلبي عن أبي صالح عن ابن عباس عن جابر بن عبدالله بن رباب قال مر أبو ياسر بن أخطب في رجال من يهود برسول الله صلى الله عليه وسلم وهو يتلو فاتحة سورة البقرة \"الم ذلك الكتاب لا ريب فيه\" فأتى أخاه بن أخطب في رجال من اليهود فقال تعلمون والله لقد سمعت محمدا يتلو فيما أنزل الله تعالى عليه \"الم ذلك الكتاب لا ريب فيه\" فقال أنت سمعته قال نعم قال فمشى حي بن أخطب في أولئك النفر من اليهود إلى رسول الله صلى الله عليه وسلم فقالوا يا محمد ألم يذكر أنك تتلوا فيما أنزل الله عليك \"الم ذلك الكتاب\"؟ فقال رسول الله صلى الله عليه وسلم \"بلى\" فقالوا جاءك بهذا جبريل من عند الله؟ فقال \"نعم\" قالوا لقد بعث الله قبلك أنبياء ما نعلمه بين لنبي منهم ما مدة ملكه وما أجل أمته غيرك. فقام حي بن أخطب وأقبل على من كان معه فقال لهم الألف واحدة واللام ثلاثون والميم أربعون فهذه إحدى وسبعون سنة أفتدخلون في دين نبي إنما مدة ملكه وأجل أمته إحدى وسبعون سنة؟ ثم أقبل على رسول الله صلى الله عليه وسلم فقال يا محمد هل مع هذا غيره فقال \"نعم\" قال ما ذاك؟ قال \"المص\" قال هذا أثقل وأطول الألف واحد واللام ثلاثون والميم أربعون والصاد تسعون فهذه إحدى وثلاثون ومائة سنة. هل مع هذا يا محمد غيره؟ قال \"نعم\" قال ما ذاك؟ قال \"الر\" قال هذا أثقل وأطول الألف واحدة واللام ثلاثون والراء مائتان فهذه إحدى وثلاثون ومائتا سنة. فهل مع هذا يا محمد غيره؟ قال \"نعم\" قال ماذا قال \"المر\" قال هذه أثقل وأطول الألف واحدة واللام ثلاثون والميم أربعون والراء مائتان فهذه إحدى وسبعون ومائتان ثم قال: لقد لبس علينا أمرك يا محمد حتى ما ندري أقليلا أعطيت أم كثيرا. ثم قال قوموا عنه ثم قال أبو ياسر لأخيه حي بن أخطب ولمن معه من الأحبار ما يدريكم لعله قد جمع هذا لمحمد كله إحدى وسبعون وإحدى وثلاثون ومائة وإحدى وثلاثون ومائتان وإحدى وسبعون ومائتان فذلك سبعمائة وأربع سنين؟ فقالوا لقد تشابه علينا أمره فيزعمون أن هؤلاء الآيات نزلت فيهم \"هو الذي أنزل عليك الكتاب منه آيات محكمات هن أم الكتاب وأخر متشابهات\" فهذا الحديث مداره على محمد بن السائب الكلبي وهو ممن لا يحتج بما انفرد به ثم كان مقتضى هذا المسلك إن كان صحيحا أن يحسب ما لكل حرف من الحروف الأربعة عشر التي ذكرناها وذلك يبلغ منه جملة كثيرة وإن حسبت مع التكرر فأطم وأعظم والله أعلم."
    },
    {
      "ayah": 10,
      "surah": 26,
      "text": "يخبر تعالى عما أمر به عبده ورسوله وكليمه موسى بن عمران عليه السلام \"حين ناداه من جانب الطور الأيمن وكلمه وناجاه وأرسله واصطفاه وأمره بالذهاب إلى فرعون وملئه ولهذا قال تعالى \"أن ائت القوم الظالمين\"."
    },
    {
      "ayah": 100,
      "surah": 26,
      "text": "\"فما لنا من شافعين\" قال بعضهم يعني من الملائكة كما يقولون \"فهل لنا من شفعاء فيشفعوا لنا أو نرد فنعمل غير الذي كنا نعمل\" وكذا قالوا: \"فمالنا من شافعين\"."
    },
    {
      "ayah": 101,
      "surah": 26,
      "text": "\"ولا صديق حميم\" أي قريب ; قال قتادة يعلمون والله أن الصديق إذا كان صالحا نفع وأن الحميم إذا كان صالحا شفع."
    },
    {
      "ayah": 102,
      "surah": 26,
      "text": "\"فلو أن لنا كرة فنكون من المؤمنين\" وذلك أنهم يتمنون أن يردون إلى دار الدنيا ليعملوا بطاعة ربهم فيما يزعمون والله تعالى يعلم أنهم لو ردوا إلى دار الدنيا لعادوا لما نهوا عنه وإنهم لكاذبون ; وقد أخبر الله تعالى عن تخاصم أهل النار في سورة ص ثم قال تعالى: \"إن ذلك لحق تخاصم أهل النار\"."
    },
    {
      "ayah": 103,
      "surah": 26,
      "text": "ثم قال تعالى \"إن في ذلك لآية وما كان أكثرهم مؤمنين\" أي أن في محاجة إبراهيم لقومه وإقامة الحجج عليهم في التوحيد لآية أي لدلالة واضحة جلية على أن لا إله إلا الله \"وما كان أكثرهم مؤمنين وإن ربك لهو العزيز الرحيم\"."
    },
    { "ayah": 104, "surah": 26, "text": "لا يوجد تفسير لهذه الأية" },
    {
      "ayah": 105,
      "surah": 26,
      "text": "هذا إخبار من الله عز وجل عن عبده ورسوله نوح عليه السلام وهو أول رسول بعثه الله إلى أهل الأرض بعد ما عبدت الأصنام والأنداد فبعثه الله ناهيا عن ذلك ومحذرا من وبيل عقابه فكذبه قومه فاستمروا على ما هم عليه من الفعال الخبيثة في عبادتهم أصنامهم مع الله تعالى ونزل الله تعالى تكذيبهم له منزلة تكذيبهم جميع الرسل فلهذا قال تعالى: \"كذبت قوم نوح المرسلين."
    },
    { "ayah": 106, "surah": 26, "text": "إذ قال لهم أخوهم نوح ألا تتقون\" أي ألا تخافون الله في عبادتكم غيره." },
    {
      "ayah": 107,
      "surah": 26,
      "text": "\"إني لكم رسول أمين\" أي إني رسول من الله إليكم أمين فيما بعثني الله به أبلغكم رسالات ربي ولا أزيد فيها ولا أنقص منها."
    },
    {
      "ayah": 108,
      "surah": 26,
      "text": "\"فاتقوا الله وأطيعون وما أسألكم عليه من أجر\" الآية أي لا أطلب منكم جزاء على نصحي لكم بل أدخر ثواب ذلك عند الله."
    },
    {
      "ayah": 109,
      "surah": 26,
      "text": "\"فاتقوا الله وأطيعون\" فقد وضح لكم وبان صدقي ونصحي وأمانتي فيما بعثني الله به وائتمنني عليه."
    },
    {
      "ayah": 11,
      "surah": 26,
      "text": "قوم فرعون ألا يتقون قال رب إني أخاف أن يكذبون ويضيق صدري ولا ينطلق لساني فأرسل إلى هارون ولهم على ذنب فأخاف أن يقتلون\" هذه أعذار سأل من الله إزاحتها عنه كما قال في سورة طه \"قال رب اشرح لي صدري ويسر لي أمري - إلى قوله - قد أوتيت سؤلك يا موسى\"."
    },
    {
      "ayah": 110,
      "surah": 26,
      "text": "\"فاتقوا الله وأطيعون\" فقد وضح لكم وبان صدقي ونصحي وأمانتي فيما بعثني الله به وائتمنني عليه."
    },
    {
      "ayah": 111,
      "surah": 26,
      "text": "يقولون لا نؤمن لك ولا نتبعك ونتأسى في ذلك بهؤلاء الأرذلين الذين اتبعوك وصدقوك وهم أراذلنا ولهذا \"قالوا أنؤمن لك واتبعك الأرذلون قال وما علمي بما كانوا يعملون\" أي وأي شيء يلزمني من اتباع هؤلاء لي ولو كانوا على أي شيء كانوا عليه لا يلزمني التنقيب عنهم والبحث والفحص إنما علي أن أقبل منهم تصديقهم إياي وأكل سرائرهم إلى الله عز وجل."
    },
    {
      "ayah": 112,
      "surah": 26,
      "text": "يقولون لا نؤمن لك ولا نتبعك ونتأسى في ذلك بهؤلاء الأرذلين الذين اتبعوك وصدقوك وهم أراذلنا ولهذا \"قالوا أنؤمن لك واتبعك الأرذلون قال وما علمي بما كانوا يعملون\" أي وأي شيء يلزمني من اتباع هؤلاء لي ولو كنوا على أي شيء كانوا عليه لا يلزمني التنقيب عنهم والبحث والفحص إنما علي أن أقبل منهم تصديقهم إياي وأكل سرائرهم إلى الله عز وجل."
    },
    {
      "ayah": 113,
      "surah": 26,
      "text": "\"إن حسابهم إلا على ربي لو تشعرون وما أنا بطارد المؤمنين\" كأنهم سألوا منه أن يبعدهم عنه ويتابعوه فأبى عليهم ذلك."
    },
    {
      "ayah": 114,
      "surah": 26,
      "text": "\"إن حسابهم إلا على ربي لو تشعرون وما أنا بطارد المؤمنين\" كأنهم سألوا منه أن يبعدهم عنه ويتابعوه فأبى عليهم ذلك."
    },
    {
      "ayah": 115,
      "surah": 26,
      "text": "وقال: \"وما أنا بطارد المؤمنين إن أنا إلا نذير مبين\" أي إنما بعثت نذيرا فمن أطاعني وأتبعني وصدقني كان مني وأنا منه سواء كان شريفا أو وضيعا جليلا أو حقيرا."
    },
    {
      "ayah": 116,
      "surah": 26,
      "text": "لما طال مقام نبي الله بين أظهرهم يدعوهم إلي الله تعالى ليلا ونهارا وسرا وجهارا وكلما كرر عليهم الدعوة صمموا على الكفر الغليظ والامتناع الشديد وقالوا في الآخر \"لئن لم تنته يا نوح لتكونن من المرجومين\" أي لئن لم تنته عن دعوتك إيانا إلى دينك \"لتكونن من المرجومين\" أي لنرجمنك فعند ذلك دعا عليهم دعوة استجاب الله منه."
    },
    {
      "ayah": 117,
      "surah": 26,
      "text": "فقال \"رب إن قومي كذبون فافتح بيني وبينهم فتحا\" الآية كما قال في الآية الأخرى \"فدعا ربه أني مغلوب فانتصر\" إلى آخر الآية."
    },
    {
      "ayah": 118,
      "surah": 26,
      "text": "فقال \"رب إن قومي كذبون فافتح بيني وبينهم فتحا\" الآية كما قال في الآية الأخرى \"فدعا ربه أني مغلوب فانتصر\" إلى آخر الآية."
    },
    {
      "ayah": 119,
      "surah": 26,
      "text": "وقال ههنا \"فأنجيناه ومن معه في الفلك المشحون\" والمشحون هو المملوء بالأمتعة والأزواج التي حمل فيها من كل زوجين اثنين أي أنجينا نوحا ومن اتبعه كلهم."
    },
    {
      "ayah": 12,
      "surah": 26,
      "text": "قوم فرعون ألا يتقون قال رب إني أخاف أن يكذبون ويضيق صدري ولا ينطلق لساني فأرسل إلى هارون ولهم على ذنب فأخاف أن يقتلون\" هذه أعذار سأل من الله إزاحتها عنه كما قال في سورة طه \"قال رب اشرح لي صدري ويسر لي أمري - إلى قوله - قد أوتيت سؤلك يا موسى\"."
    },
    {
      "ayah": 120,
      "surah": 26,
      "text": "\"ثم أغرقنا بعد الباقين\" وأغرقنا من كفر به وخالف أمره كلهم أجمعين \"إن في ذلك لآية وما كان أكثرهم مؤمنين وإن ربك لهو العزيز الرحيم\"."
    },
    {
      "ayah": 121,
      "surah": 26,
      "text": "\"ثم أغرقنا بعد الباقين\" وأغرقنا من كفر به وخالف أمره كلهم أجمعين \"إن في ذلك لآية وما كان أكثرهم مؤمنين وإن ربك لهو العزيز الرحيم\"."
    },
    {
      "ayah": 122,
      "surah": 26,
      "text": "وأغرقنا من كفر به وخالف أمره كلهم أجمعين \"إن في ذلك لآية وما كان أكثرهم مؤمنين وإن ربك لهو العزيز الرحيم\"."
    },
    {
      "ayah": 123,
      "surah": 26,
      "text": "وهذا إخبار من الله تعالى عن عبده ورسوله هود عليه السلام أنه دعا قومه عادا وكان قومه يسكنون الأحقاف وهي جبال الرمل قريبا من حضر موت متاخمة بلاد اليمن وكان زمانهم بعد قوم نوح كما قال في سورة الأعراف \"واذكروا إذ جعلكم خلفاء من بعد قوم نوح وزادكم في الخلق بسطة\" وذلك أنهم كانوا في غاية من قوة التركيب والقوة والبطش الشديد والطول المديد والأرزاق الدارة والأموال والجنات والأنهار والأبناء والزروع والثمار وكانوا مع ذلك يعبدون غير الله معه."
    },
    {
      "ayah": 124,
      "surah": 26,
      "text": "فبعث الله هودا إليهم رجلا منهم رسولا وبشيرا ونذيرا فدعاهم إلى الله وحده وحذرهم نقمته وعذابه في مخالفته وبطشه فقال لهم كما قال نوح لقومه."
    },
    {
      "ayah": 125,
      "surah": 26,
      "text": "فبعث الله هودا إليهم رجلا منهم رسولا وبشيرا ونذيرا فدعاهم إلى الله وحده وحذرهم نقمته وعذابه في مخالفته وبطشه فقال لهم كما قال نوح لقومه."
    },
    {
      "ayah": 126,
      "surah": 26,
      "text": "فبعث الله هودا إليهم رجلا منهم رسولا وبشيرا ونذيرا فدعاهم إلى الله وحده وحذرهم نقمته وعذابه في مخالفته وبطشه فقال لهم كما قال نوح لقومه."
    },
    {
      "ayah": 127,
      "surah": 26,
      "text": "فبعث الله هودا إليهم رجلا منهم رسولا وبشيرا ونذيرا فدعاهم إلى الله وحده وحذرهم نقمته وعذابه في مخالفته وبطشه فقال لهم كما قال نوح لقومه."
    },
    {
      "ayah": 128,
      "surah": 26,
      "text": "إلى أن قال: \"أتبنون بكل ريع آية تعبثون\" اختلف المفسرون في الريع بما حاصله أنه المكان المرتفع عند جواد الطرق المشهورة يبنون هناك بنيانا محكما هائلا باهرا ولهذا قال: \"أتبنون بكل ريع آية\" أي معلما بناء مشهورا \"تعبثون\" أي وإنما تفعلون ذلك عبثا لا للاحتياج إليه بل لمجرد اللعب واللهو وإظهار القوة ولهذا أنكر عليهم نبيهم عليه السلام ذلك لأنه تضييع للزمان وإتعاب للأبدان في غير فائدة واشتغال بما لا يجدي في الدنيا ولا في الآخرة."
    },
    {
      "ayah": 129,
      "surah": 26,
      "text": "ولهذا قال: \"وتتخذون مصانع لعلكم تخلدون\" قال مجاهد والمصانع البروج المشيدة والبنيان المخلد وفي رواية عنه بروج الحمام وقال قتادة هي مأخذ الماء قال قتادة وقرأ بعض الكوفيين \"وتتخذون مصانع كأنكم خالدون\" وفي القراءة المشهورة \"وتتخذون مصانع لعلكم تخلدون\" أي لكي تقيموا فيها أبدا وذلك ليس بحاصل لكم بل زائل عنكم كما زال عمن كان قبلكم وروى ابن أبي حاتم رحمه الله حدثنا أبي حدثنا الحكم بن موسى حدثنا الوليد حدثنا ابن عجلان حدثني عون بن عبد الله بن عتبة أن أبا الدرداء رضي الله عنه لما رأى ما أحدث المسلمون في الغوطة من البنيان ونصب الشجر قام في مسجدهم فنادى يا أهل دمشق فاجتمعوا إليه فحمد الله وأثنى عليه ثم قال ألا تستحبون ألا تستحيون تجمعون ما لا تأكلون وتبنون ما لا تسكنون وتأملون ما لا تدركون إنه قد كانت قبلكم قرون يجمعون فيوعون ويبنون فيوثقون ويأملون فيطيلون فأصبح أملهم غرورا وأصبح جمعهم بورا وأصبحت مساكنهم قبورا ألا إن عادا ملكت ما بين عدن وعمان خيلا وركابا فمن يشتري مني ميراث عاد بدرهمين؟."
    },
    {
      "ayah": 13,
      "surah": 26,
      "text": "قوم فرعون ألا يتقون قال رب إني أخاف أن يكذبون ويضيق صدري ولا ينطلق لساني فأرسل إلى هارون ولهم على ذنب فأخاف أن يقتلون\" هذه أعذار سأل من الله إزاحتها عنه كما قال في سورة طه \"قال رب اشرح لي صدري ويسر لي أمري - إلى قوله - قد أوتيت سؤلك يا موسى\"."
    },
    { "ayah": 130, "surah": 26, "text": "وقوله: \"وإذا بطشتم بطشتم جبارين\" أي يصفهم بالقوة والغلظة والجبروت." },
    {
      "ayah": 131,
      "surah": 26,
      "text": "\"فاتقوا الله وأطيعون\" أي اعبدوا ربكم وأطيعوا رسولكم ثم شرع يذكرهم نعم الله عليهم."
    },
    {
      "ayah": 132,
      "surah": 26,
      "text": "فقال: \"واتقوا الذي أمدكم بما تعلمون أمدكم بأنعام وبنين وجنات وعيون إني أخاف عليكم عذاب يوم عظيم\" أي إن كذبتم وخالفتم فدعاهم إلى الله بالترغيب والترهيب فما نفع فيهم."
    },
    {
      "ayah": 133,
      "surah": 26,
      "text": "فقال: \"واتقوا الذي أمدكم بما تعلمون أمدكم بأنعام وبنين وجنات وعيون إني أخاف عليكم عذاب يوم عظيم\" أي إن كذبتم وخالفتم فدعاهم إلى الله بالترغيب والترهيب فما نفع فيهم."
    },
    {
      "ayah": 134,
      "surah": 26,
      "text": "فقال: \"واتقوا الذي أمدكم بما تعلمون أمدكم بأنعام وبنين وجنات وعيون إني أخاف عليكم عذاب يوم عظيم\" أي إن كذبتم وخالفتم فدعاهم إلى الله بالترغيب والترهيب فما نفع فيهم."
    },
    {
      "ayah": 135,
      "surah": 26,
      "text": "فقال: \"واتقوا الذي أمدكم بما تعلمون أمدكم بأنعام وبنين وجنات وعيون إني أخاف عليكم عذاب يوم عظيم\" أي إن كذبتم وخالفتم فدعاهم إلى الله بالترغيب والترهيب فما نفع فيهم."
    },
    {
      "ayah": 136,
      "surah": 26,
      "text": "يقول تعالى مخبرا عن جواب قوم هود له بعد ما حذرهم وأنذرهم ورغبهم ورهبهم وبين لهم الحق ووضحه \"قالوا سواء علينا أو عظت أم لم تكن من الواعظين\" أي لا نرجع عما نحن عليه \"وما نحن بتاركي آلهتنا عن قولك وما نحن لك بمؤمنين\" وهكذا الأمر فإن الله تعالى قال: \"إن الذين كفروا سواء عليهم أأنذرتهم أم لم تنذرهم لا يؤمنون\" وقال تعالى: \"إن الذين حقت عليهم كلمة ربك لا يؤمنون\" الآية."
    },
    {
      "ayah": 137,
      "surah": 26,
      "text": "وقولهم \"إن هذا إلا خلق الأولين\" قرأ بعضهم \"إن هذا إلا خَلق الأولين\" بفتح الخاء وتسكين اللام قال ابن مسعود والعوفي عن عبدالله بن عباس وعلقمة ومجاهد يعنون ما هذا الذي جئتنا به إلا أخلاق الأولين كما قال المشركون من قريش \"وقالوا أساطير الأولين أكتتبها فهي تملى عليه بكرة وأصيلا\" وقال: \"وقال الذين كفروا إن هذا إلا إفك افتراه وأعانه عليه قوم آخرون فقد جاءوا ظلما وزورا وقالوا أساطير الأولين\" وقال: \"وإذا قيل لهم ماذا أنزل ربكم قالوا أساطير الأولين\" وقرأ آخرون \"إن هذا إلا خلق الأولين\" بضم الخاء واللام يعنون دينهم وما هم عليه من الأمر هو دين الأولين من الآباء والأجداد ونحن تابعون لهم سالكون وراءهم نعيش كما عاشوا ونموت كما ماتوا ولا بعث ولا معاد."
    },
    {
      "ayah": 138,
      "surah": 26,
      "text": "ولهذا قالوا: \"وما نحن بمعذبين\" قال علي ابن أبي طلحة عن ابن عباس \"إن هذا إلا خلق الأولين\" يقول دين الأولين وقاله عكرمة وعطاء الخراساني وقتادة وعبد الرحمن بن زيد بن أسلم واختاره ابن جرير."
    },
    {
      "ayah": 139,
      "surah": 26,
      "text": "وقوله تعالى: \"فكذبوه فأهلكناهم\" أي استمروا على تكذيب نبي الله هود ومخالفته وعناده فأهلكهم الله وقد بين سبب إهلاكه إياهم في غير موضع من القرآن بأنه أرسل عليهم ريحا صرصرا عاتية أي ريحا شديدة الهبوب ذات برد شديد جدا فكان سبب إهلاكهم من جنسهم فإنهم كانوا أعتى شيء وأجبره فسلط الله عليهم ما هو أعتى منهم وأشد قوة كما قال تعالى: \"ألم تر كيف فعل ربك بعاد إرم ذات العماد\" وهم عاد الأولى كما قال تعالى: \"وأنه أهلك عادا الأولى\" وهم من نسل إرم بن سام بن نوح \"ذات العماد\" الذين كانوا يسكنون العمد ومن زعم أن إرم مدينة فإنما أخذ ذلك من الإسرائيليات من كلام كعب ووهب وليس لذلك أصل أصيل ولهذا قال \"التي لم يخلق مثلها في البلاد\" أي لم يخلق مثل هذه القبيلة في قوتهم وشدتهم وجبروتهم ولو كان المراد بذلك مدينة لقال التي لم يبن مثلها في البلاد وقال تعالى: \"فأما عاد فاستكبروا في الأرض بغير الحق وقالوا من أشد منا قوة ؟ أو لم يروا أن الله الذي خلقهم هو أشد منهم قوة وكانوا بآياتنا يجحدون\" وقد قدمنا أن الله تعالى لم يرسل عليهم من الريح إلا مقدار أنف الثور عتت على الخزنة فأذن الله لها في ذلك فسلكت فحصبت بلادهم فحصبت كل شيء لهم كما قال تعالى: \"تدمر كل شيء بأمر ربها\" الآية وقال تعالى: \"وأما عاد فأهلكوا بريح صرصر عاتية\" - إلى قوله \"حسوما\" - أي كاملة - \"فترى القوم فيها صرعى كأنهم أعجاز نخل خاوية\" أي بقوا أبدانا بلا رءوس وذلك أن الريح كانت تأتي الرجل منهم فتقتلعه وترفعه في الهواء ثم تنكسه على أم رأسه فتشدخ دماغه وتكسر رأسه وتلقيه كأنهم أعجاز نخل منقعر وقد كانوا تحصنوا في الجبال والكهوف والمغارات وحفروا لهم في الأرض إلى أنصافهم فلم يغن عنهم ذلك من أمر الله شيئا \"إن أجل الله إذا جاء لا يؤخر\" ولهذا قال تعالى: \"فكذبوه فأهلكناهم\" الآية."
    },
    {
      "ayah": 14,
      "surah": 26,
      "text": "وقوله تعالى \"ولهم علي ذنب فأخاف أن يقتلون\" أي بسبب قتل القبطي الذي كان سبب خروجه من بلاد مصر."
    },
    { "ayah": 140, "surah": 26, "text": "لا يوجد تفسير لهذه الأية" },
    {
      "ayah": 141,
      "surah": 26,
      "text": "هذا إخبار من الله عز وجل عن عبده ورسوله صالح عليه السلام أنه بعثه إلى قومه ثمود وكانوا عربا يسكنون مدينة الحجر التي بين وادى القرى وبلاد الشام ومساكنهم معروفة مشهورة وقد قدمنا في سورة الأعراف الأحاديث المروية في مرور رسول الله صلى الله عليه وسلم بهم حين أراد غزو الشام فوصل إلى تبوك ثم عاد إلى المدينة ليتأهب لذلك وكانوا بعد عاد وقبل الخليل عليه السلام فدعاهم نبيهم صالح إلى الله عز وجل أن يعبدوه وحده لا شريك له وأن يطيعوه فيما بلغهم من الرسالة فأبوا عليه وكذبوه وخالفوه وأخبرهم أنه لا يبتغي بدعوتهم أجرا منهم وإنما يطلب ثواب ذلك من الله عز وجل ثم ذكرهم آلاء الله عليهم فقال."
    },
    {
      "ayah": 142,
      "surah": 26,
      "text": "فدعاهم نبيهم صالح إلى الله عز وجل أن يعبدوه وحده لا شريك له وأن يطيعوه فيما بلغهم من الرسالة فأبوا عليه وكذبوه وخالفوه وأخبرهم أنه لا يبتغي بدعوتهم أجرا منهم وإنما يطلب ثواب ذلك من الله عز وجل ثم ذكرهم آلاء الله عليهم."
    },
    {
      "ayah": 143,
      "surah": 26,
      "text": "فدعاهم نبيهم صالح إلى الله عز وجل أن يعبدوه وحده لا شريك له وأن يطيعوه فيما بلغهم من الرسالة فأبوا عليه وكذبوه وخالفوه وأخبرهم أنه لا يبتغي بدعوتهم أجرا منهم وإنما يطلب ثواب ذلك من الله عز وجل ثم ذكرهم آلاء الله عليهم."
    },
    {
      "ayah": 144,
      "surah": 26,
      "text": "فدعاهم نبيهم صالح إلى الله عز وجل أن يعبدوه وحده لا شريك له وأن يطيعوه فيما بلغهم من الرسالة فأبوا عليه وكذبوه وخالفوه وأخبرهم أنه لا يبتغي بدعوتهم أجرا منهم وإنما يطلب ثواب ذلك من الله عز وجل ثم ذكرهم آلاء الله عليهم."
    },
    {
      "ayah": 145,
      "surah": 26,
      "text": "فدعاهم نبيهم صالح إلى الله عز وجل أن يعبدوه وحده لا شريك له وأن يطيعوه فيما بلغهم من الرسالة فأبوا عليه وكذبوه وخالفوه وأخبرهم أنه لا يبتغي بدعوتهم أجرا منهم وإنما يطلب ثواب ذلك من الله عز وجل ثم ذكرهم آلاء الله عليهم."
    },
    {
      "ayah": 146,
      "surah": 26,
      "text": "يقول لهم واعظا لهم ومحذرهم نقم الله أن تحل بهم ومذكرا بأنعم الله عليهم فيما رزقهم من الأرزاق الدارة وجعلهم في أمن من المحذورات."
    },
    {
      "ayah": 147,
      "surah": 26,
      "text": "وأنبت لهم من الجنات وفجر لهم من العيون الجاريات وأخرج لهم من الزروع والثمرات."
    },
    {
      "ayah": 148,
      "surah": 26,
      "text": "ولهذا قال \"ونخل طلعها هضيم\" قال العوفي عن ابن عباس أينع وبلغ فهو هضيم وقال علي بن أبي طلحة عن ابن عباس \"ونخل طلعها هضيم\" يقول معشبة وقال إسماعيل بن أبي خالد عن عمرو بن أبي عمرو - وقد أدرك الصحابة - عن ابن عباس في قوله \"ونخل طلعها هضيم\" قال إذا رطب واسترخى رواه ابن أبي حاتم ثم قال: وروي عن أبي صالح نحو هذا وقال أبو إسحاق عن أبي العلاء \"ونخل طلعها هضيم\" قال هو المذنب من الرطب وقال مجاهد: هو الذي إذا يبس تهشم وتفتت وتناثر وقال ابن جريج سمعت عبد الكريم أنبأنا أمية سمعت مجاهدا يقول: \"ونخل طلعها هضيم\" قال: حين يطلع تقبض عليه فتهضمه فهو من الرطب الهضيم ومن اليابس الهشيم تقبض عليه فتهشمه وقال عكرمة وقتادة: الهضيم الرطب اللين وقال الضحاك: إذا كثر حمل الثمرة وركب بعضها بعضا فهو هضيم وقال مرة: هو الطلع حين يتفرق ويخضر وقال الحسن البصري هو الذي لا نوى له وقال أبو صخر: ما رأيت الطلع حين ينشق عنه الكم فترى الطلع قد لصق بعضه ببعض فهو الهضيم."
    },
    {
      "ayah": 149,
      "surah": 26,
      "text": "وقوله \"وتنحتون من الجبال بيوتا فارهين\" قال ابن عباس وغير واحد يعني حاذقين وفي رواية عنه شرهين أشرين وهو اختيار مجاهد وجماعة ولا منافاة بينهما فإنهم كانوا يتخذون تلك البيوت المنحوتة في الجبال أشرا وبطرا وعبثا من غير حاجة إلى سكناها وكانوا حاذقين متقنين لنحتها ونقشها كما هو المشاهد من حالهم لمن رأى منازلهم."
    },
    {
      "ayah": 15,
      "surah": 26,
      "text": "\"قال كلا\" أي قال الله له لا تخف من شيء من ذلك كقوله \"سنشد عضدك بأخيك ونجعل لكما سلطانا - أي برهانا - فلا يصلون إليكما بآياتنا أنتما ومن اتبعكما الغالبون\" \"فاذهبا بآياتنا إنا معكم مستمعون\" كقوله \"إنني معكما أسمع وأرى\" أي إنني معكما بحفظي وكلاءتي ونصري وتأييدي."
    },
    {
      "ayah": 150,
      "surah": 26,
      "text": "ولهذا قال \"فاتقوا الله وأطيعون\" أي أقبلوا على ما يعود نفعه عليكم في الدنيا والآخرة من عبادة ربكم الذي خلقكم ورزقكم لتعبدوه وتوحدوه وتسبحوه بكرة وأصيلا."
    },
    {
      "ayah": 151,
      "surah": 26,
      "text": "\"ولا تطيعوا أمر المسرفين الذين يفسدون في الأرض ولا يصلحون\" يعني رؤساءهم وكبراءهم الدعاة لهم إلى الشرك والكفر ومخالفة الحق."
    },
    {
      "ayah": 152,
      "surah": 26,
      "text": "\"ولا تطيعوا أمر المسرفين الذين يفسدون في الأرض ولا يصلحون\" يعني رؤساءهم وكبراءهم الدعاة لهم إلى الشرك والكفر ومخالفة الحق."
    },
    {
      "ayah": 153,
      "surah": 26,
      "text": "يقول تعالى مخبرا عن ثمود في جوابهم لنبيهم صالح عليه السلام حين دعاهم إلى عباده ربهم عز وجل أنهم \"قالوا إنما أنت من المسحرين\" قال مجاهد وقتادة يعنون من المسحورين وروى أبو صالح عن ابن عباس \"من المسحرين\" يعني من المخلوقين واستشهد بعضهم على هذا بقول الشاعر: فإن تسألينا فيم فحن فإننا عصافير من هذا الأنام المسحر يعني الذين لهم سحر والسحر هو الرئة والأظهر في هذا قول مجاهد وقتادة أنهم يقولون إنما أنت في قولك هذا مسحور لا عقل لك."
    },
    {
      "ayah": 154,
      "surah": 26,
      "text": "ثم قالوا \"ما أنت إلا بشر مثلنا\" يعني فكيف أوحي إليك دوننا كما قالوا في الآية الأخرى \"أأنزل عليه الذكر من بيننا بل هو كذاب أشر سيعلمون غدا من الكذاب الأشر\" ثم إنهم اقترحوا عليه آية يأتيهم بها ليعلموا صدقه بما جاءهم به من ربهم وقد اجتمع ملؤهم وطلبوا منه أن يخرج لهم الآن من هذه الصخرة ناقة عشراء - وأشاروا إلى صخرة عندهم - من صفتها كذا وكذا فعند ذلك أخذ عليهم نبي الله صالح العهود والمواثيق لئن أجابهم إلى ما سألوا ليؤمنن به وليتبعنه فأعطوه ذلك فقام نبي الله صالح عليه السلام فصلى ثم دعا الله عز وجل أن يجيبهم إلى سؤالهم فانفطرت تلك الصخرة التي أشاروا إليها عن ناقة عشراء على الصفة التي وصفوها فآمن بعضهم وكفر أكثرهم."
    },
    {
      "ayah": 155,
      "surah": 26,
      "text": "\"قال هذه ناقة لها شرب ولكم شرب يوم معلوم\" يعني ترد ماءكم يوما ويوما تردونه أنتم."
    },
    {
      "ayah": 156,
      "surah": 26,
      "text": "\"ولا تمسوها بسوء فيأخذكم عذاب يوم عظيم\" فحذرهم نقمة الله إن أصابوها بسوء فمكثت الناقة بين أظهرهم حينا من الدهر ترد الماء وتأكل الورق والمرعى وينتفعون بلبنها يحلبون منها ما يكفيهم شربا وريا فلما طال عليهم الأمد وحضر أشقاهم تمالؤا على قتلها وعقرها."
    },
    {
      "ayah": 157,
      "surah": 26,
      "text": "\"فعقروها فأصبحوا نادمين فأخذهم العذاب\" وهو أن أرضهم زلزلت زلزالا شديدا وجاءتهم صيحة عظيمة اقتلعت القلوب من محالها وأتاهم من الأمر ما لم يكونوا يحتسبون وأصبحوا في ديارهم جاثمين \"إن في ذلك لآية وما كان أكثرهم مؤمنين وإن ربك لهو العزيز الرحيم\"."
    },
    {
      "ayah": 158,
      "surah": 26,
      "text": "\"فعقروها فأصبحوا نادمين فأخذهم العذاب\" وهو أن أرضهم زلزلت زلزالا شديدا وجاءتهم صيحة عظيمة اقتلعت القلوب من محالها وأتاهم من الأمر ما لم يكونوا يحتسبون وأصبحوا في ديارهم جاثمين \"إن في ذلك لآية وما كان أكثرهم مؤمنين وإن ربك لهو العزيز الرحيم\"."
    },
    { "ayah": 159, "surah": 26, "text": "لا يوجد تفسير لهذه الأية" },
    {
      "ayah": 16,
      "surah": 26,
      "text": "\"فأتيا فرعون فقولا إنا رسول رب العالمين\" كقوله في الآية الأخرى \"إنا رسولا ربك\" أي كل منا أرسل إليك."
    },
    {
      "ayah": 160,
      "surah": 26,
      "text": "يقول تعالى مخبرا عن عبده ورسوله لوط عليه السلام وهو لوط بن هاران بن آزار وهو ابن أخي إبراهيم الخليل عليه السلام وكان الله تعالى قد بعثه إلى أمة عظيمة في حياة إبراهيم عليهما السلام وكانوا يسكنون سذوم وأعمالها التي أهلكها الله بها وجعل مكانها بحيرة منتنة خبيثة وهي مشهورة ببلاد الغور بناحية متاخمة لجبال البيت المقدس بينها وبين بلاد الكرك والشوبك فدعاهم إلى الله عز وجل أن يعبدوه وحده لا شريك له وأن يطيعوا رسولهم الذي بعثه الله إليهم ونهاهم عن معصية الله وارتكاب ما كانوا قد ابتدعوه في العالم مما لم يسبقهم أحد من الخلائق إلى فعله من إتيان الذكور دون الإناث."
    },
    {
      "ayah": 161,
      "surah": 26,
      "text": "يقول تعالى مخبرا عن عبده ورسوله لوط عليه السلام وهو لوط بن هاران بن آزار وهو ابن أخي إبراهيم الخليل عليه السلام وكان الله تعالى قد بعثه إلى أمة عظيمة في حياة إبراهيم عليهما السلام وكانوا يسكنون سذوم وأعمالها التي أهلكها الله بها وجعل مكانها بحيرة منتنة خبيثة وهي مشهورة ببلاد الغور بناحية متاخمة لجبال البيت المقدس بينها وبين بلاد الكرك والشوبك فدعاهم إلى الله عز وجل أن يعبدوه وحده لا شريك له وأن يطيعوا رسولهم الذي بعثه الله إليهم ونهاهم عن معصية الله وارتكاب ما كانوا قد ابتدعوه في العالم مما لم يسبقهم أحد من الخلائق إلى فعله من إتيان الذكور دون الإناث."
    },
    {
      "ayah": 162,
      "surah": 26,
      "text": "يقول تعالى مخبرا عن عبده ورسوله لوط عليه السلام وهو لوط بن هاران بن آزار وهو ابن أخي إبراهيم الخليل عليه السلام وكان الله تعالى قد بعثه إلى أمة عظيمة في حياة إبراهيم عليهما السلام وكانوا يسكنون سذوم وأعمالها التي أهلكها الله بها وجعل مكانها بحيرة منتنة خبيثة وهي مشهورة ببلاد الغور بناحية متاخمة لجبال البيت المقدس بينها وبين بلاد الكرك والشوبك فدعاهم إلى الله عز وجل أن يعبدوه وحده لا شريك له وأن يطيعوا رسولهم الذي بعثه الله إليهم ونهاهم عن معصية الله وارتكاب ما كانوا قد ابتدعوه في العالم مما لم يسبقهم أحد من الخلائق إلى فعله من إتيان الذكور دون الإناث."
    },
    {
      "ayah": 163,
      "surah": 26,
      "text": "يقول تعالى مخبرا عن عبده ورسوله لوط عليه السلام وهو لوط بن هاران بن آزار وهو ابن أخي إبراهيم الخليل عليه السلام وكان الله تعالى قد بعثه إلى أمة عظيمة في حياة إبراهيم عليهما السلام وكانوا يسكنون سذوم وأعمالها التي أهلكها الله بها وجعل مكانها بحيرة منتنة خبيثة وهي مشهورة ببلاد الغور بناحية متاخمة لجبال البيت المقدس بينها وبين بلاد الكرك والشوبك فدعاهم إلى الله عز وجل أن يعبدوه وحده لا شريك له وأن يطيعوا رسولهم الذي بعثه الله إليهم ونهاهم عن معصية الله وارتكاب ما كانوا قد ابتدعوه في العالم مما لم يسبقهم أحد من الخلائق إلى فعله من إتيان الذكور دون الإناث."
    },
    { "ayah": 164, "surah": 26, "text": "لا يوجد تفسير لهذه الأية" },
    {
      "ayah": 165,
      "surah": 26,
      "text": "لما نهاهم نبي الله عن ارتكاب الفواحش وغشيانهم الذكور وأرشدهم إلى إتيان نسائهم اللاتي خلقهن الله لهم ما كان جوابهم له."
    },
    {
      "ayah": 166,
      "surah": 26,
      "text": "لما نهاهم نبي الله عن ارتكاب الفواحش وغشيانهم الذكور وأرشدهم إلى إتيان نسائهم اللاتي خلقهن الله لهم ما كان جوابهم له."
    },
    {
      "ayah": 167,
      "surah": 26,
      "text": "إلا أن قالوا \"لئن لم تنته يا لوط\" أي عما جئتنا به \"لتكونن من المخرجين\" أي ننفيك من بين أظهرنا كما قال تعالى \"فما كان جواب قومه إلا أن قالوا أخرجوا آل لوط من قريتكم إنهم أناس يتطهرون\" فلما رأى أنهم لا يرتدعون عما هم فيه وأنهم مستمرون على ضلالتهم تبرأ منهم."
    },
    {
      "ayah": 168,
      "surah": 26,
      "text": "وقال \"إني لعملكم من القالين\" أي المبغضين لا أحبه ولا أرضى به وإني بريء منكم ثم دعا الله عليهم."
    },
    {
      "ayah": 169,
      "surah": 26,
      "text": "فقال \"رب نجني وأهلي مما يعملون\" قال الله تعالى \"فنجيناه وأهله أجمعين\" أي كلهم."
    },
    {
      "ayah": 17,
      "surah": 26,
      "text": "\" أن أرسل معنا بني إسرائيل \"أي أطلقهم من إسارك وقبضتك وقهرك وتعذيبك فإنهم عباد الله المؤمنون وحزبه المخلصون وهم معك في العذاب المهين; فلما قال له موسى ذلك أعرض فرعون هنالك بالكلية ونظر إليه بعين الإزدراء والغمص."
    },
    {
      "ayah": 170,
      "surah": 26,
      "text": "فقال \"رب نجني وأهلي مما يعملون\" قال الله تعالى \"فنجيناه وأهله أجمعين\" أي كلهم."
    },
    {
      "ayah": 171,
      "surah": 26,
      "text": "\"إلا عجوزا في الغابرين\" وهي امرأته وكانت عجوزَ سوء بقيت. فهلكت مع من بقي من قومها وذلك كما أخبر الله تعالى عنهم في سورة الأعراف وهود وكذا في الحجر حين أمره الله أن يسري بأهله إلا امرأته وأنهم لا يلتفتوا إذا سمعوا الصيحة حين تنزل على قومه فصبروا لأمر الله واستمروا."
    },
    {
      "ayah": 172,
      "surah": 26,
      "text": "وأنزل الله على أولئك العذاب الذي عم جميعهم وأمطر عليهم حجارة من سجيل منضود. ولهذا قال تعالى \"ثم دمرنا الآخرين وأمطرنا عليهم مطرا\" - إلى قوله - \"وإن ربك لهو العزيز الرحيم\"."
    },
    {
      "ayah": 173,
      "surah": 26,
      "text": "وأنزل الله على أولئك العذاب الذي عم جميعهم وأمطر عليهم حجارة من سجيل منضود. ولهذا قال تعالى \"ثم دمرنا الآخرين وأمطرنا عليهم مطرا\" - إلى قوله - \"وإن ربك لهو العزيز الرحيم\"."
    },
    { "ayah": 174, "surah": 26, "text": "لا يوجد تفسير لهذه الأية" },
    { "ayah": 175, "surah": 26, "text": "لا يوجد تفسير لهذه الأية" },
    {
      "ayah": 176,
      "surah": 26,
      "text": "هؤلاء- يعني أصحاب الأيكة - هم أهل مدين على الصحيح وكان نبي الله شعيب من أنفسهم وإنما لم يقل ههنا أخوهم شعيب لأنهم نسبوا إلى عبادة الأيكة وهي شجره وقيل شجر ملتف كالغيضة كانوا يعبدونها فلهذا لما قال: كذب أصحاب الأيكة المرسلين لم يقل: إذ قال لهم أخوهم شعيب."
    },
    {
      "ayah": 177,
      "surah": 26,
      "text": "إنما قال \"إذ قال لهم شعيب\" فقطع نسب الأخوة بينهم للمعنى الذي نسبوا إليه وإن كان أخاهم نسبا ومن الناس من لم يفطن لهذه النكتة فظن أن أصحاب الأيكة غير أهل مدين فزعم أن شعيبا عليه السلام بعثه الله إلى أمتين ومنهم من قال ثلاث أمم وقد روى إسحاق بن بشر الكاهلي - وهو ضعيف - حدثني ابن السدي عن أبيه وزكريا بن عمرو عن خصيف عن عكرمة قالا: ما بعث الله نبيا مرتين إلا شعيبا مرة إلى مدين فأخذهم الله بالصيحة ومرة إلى أصحاب الأيكة فأخذهم الله تعالى بعذاب يوم الظلة وروى أبو القاسم البغوي عن هدبة عن همام عن قتادة في قوله تعالى \"وأصحاب الرس\" قوم شعيب وقوله \"وأصحاب الأيكة\" قوم شعيب وقاله إسحاق بن بشر وقال غير جويبر أصحاب الأيكة ومدين هما واحد والله أعلم وقد روى الحافظ ابن عساكر في ترجمة شعيب من طريق محمد بن عثمان بن أبي شيبة عن أبيه عن معاوية بن هشام عن هشام بن سعيد عن سعيد بن أبي هلال عن ربيعة بن يوسف عن عبد الله بن عمرو قال: قال رسول الله صلى الله عليه وسلم \"إن قوم مدين وأصحاب الأيكة أمتان بعث الله إليهما شعيبا النبي عليه السلام\" وهذا غريب وفي رفعه نظر والأشبه أن يكون موقوفا والصحيح أنهم أمة واحدة وصفوا في كل مقام بشيء ولهذا وعظ هؤلاء وأمرهم بوفاء المكيال والميزان كما في قصة مدين سواء بسواء فدل ذلك على أنهما أمة واحدة."
    },
    { "ayah": 178, "surah": 26, "text": "لا يوجد تفسير لهذه الأية" },
    { "ayah": 179, "surah": 26, "text": "لا يوجد تفسير لهذه الأية" },
    {
      "ayah": 18,
      "surah": 26,
      "text": "فقال \"ألم نربك فينا وليدا\" الآية أي أما أنت الذي ربيناه فينا وفي بيتنا وعلى فراشنا وأنعمنا عليه مدة من السنين ثم بعد هذا قابلت ذلك الإحسان بتلك الفعلة أن قتلت منا رجلا وجحدت نعمتنا عليك."
    },
    {
      "ayah": 180,
      "surah": 26,
      "text": "يأمرهم عليه السلام بإيفاء المكيال والميزان وينهاهم عن التطفيف فيهما فقال \"أوفوا الكيل ولا تكونوا من المخسرين\" أي إذا دفعتم للناس فكملوا الكيل لهم ولا تبخسوا الكيل فتعطوه ناقصا وتأخذوه إذا كان لكم تاما وافيا ولكن خذوا كما تعطون وأعطوا كما تأخذون."
    },
    {
      "ayah": 181,
      "surah": 26,
      "text": "يأمرهم عليه السلام بإيفاء المكيال والميزان وينهاهم عن التطفيف فيهما فقال \"أوفوا الكيل ولا تكونوا من المخسرين\" أي إذا دفعتم للناس فكملوا الكيل لهم ولا تبخسوا الكيل فتعطوه ناقصا وتأخذوه إذا كان لكم تاما وافيا ولكن خذوا كما تعطون وأعطوا كما تأخذون."
    },
    {
      "ayah": 182,
      "surah": 26,
      "text": "\"وزنوا بالقسطاس المستقيم\" والقسطاس هو الميزان وقيل هو القبان قال بعضهم هو معرب من الرومية قال مجاهد القسطاس المستقيم هو العدل بالرومية وقال قتادة القسطاس العدل."
    },
    {
      "ayah": 183,
      "surah": 26,
      "text": "وقوله \"ولا تبخسوا الناس أشياءهم\" أي لا تنقصوهم أموالهم \"ولا تعثوا في الأرض مفسدين\" يعني قطع الطريق كما قال في الآية الأخرى \"ولا تقعدوا بكل صراط توعدون\"."
    },
    {
      "ayah": 184,
      "surah": 26,
      "text": "وقوله \"واتقوا الذي خلقكم والجبلة الأولين\" يخوفهم بأس الله الذي خلقهم وخلق آباءهم الأوائل كما قال موسى عليه السلام \"ربكم ورب آباءكم الأولين\" قال ابن عباس ومجاهد والسدي وسفيان بن عيينة وعبد الرحمن بن زيد بن أسلم \"والجبلة الأولين\" يقول خلق الأولين وقرأ ابن زيد \"ولقد أضل منكم جبلا كثيرا\"."
    },
    {
      "ayah": 185,
      "surah": 26,
      "text": "يخبر تعالى عن جواب قومه له بمثل ما أجابت به ثمود لرسولها تشابهت قلوبهم حيث قالوا \"إنما أنت من المسحرين\" يعنون من المسحورين كما تقدم."
    },
    {
      "ayah": 186,
      "surah": 26,
      "text": "\"وما أنت إلا بشر مثلنا له إن نظنك لمن الكاذبين\" أي تتعمد الكذب فيما تقوله لا أن الله أرسلك إلينا."
    },
    {
      "ayah": 187,
      "surah": 26,
      "text": "\"فأسقط علينا كسفا من السماء\" قال الضحاك: جانبا من السماء. وقال قتادة قطعا من السماء وقال السدي عذابا من السماء وهذا شبيه بما قالت قريش فيما أخبر الله عنهم في قوله تعالى \"وقالوا لن نؤمن لك حتى تفجر لنا من الأرض ينبوعا\" - إلى أن قالوا - \"أو تسقط السماء كما زعمت علينا كسفا أو تأتي بالله والملائكة قبيلا\" وقوله \"وإذ قالوا اللهم إن كان هذا هو الحق من عندك فأمطر علينا حجارة من السماء\" الآية وهكذا قال هؤلاء الكفار الجهلة \"فأسقط علينا كسفا من السماء\" الآية."
    },
    {
      "ayah": 188,
      "surah": 26,
      "text": "\"قال ربي أعلم بما تعملون\" يقول الله أعلم بكم فإن كنتم تستحقون ذلك جازاكم به وهو غير ظالم لكم وهكذا وقع بهم جزاء كما سألوا جزاء وفاقا."
    },
    {
      "ayah": 189,
      "surah": 26,
      "text": "ولهذا قال تعالى \"فكذبوه فأخذهم عذاب يوم الظلة إنه كان عذاب يوم عظيم\" وهذا من جنس ما سألوه من إسقاط الكسف عليهم فإن الله سبحانه وتعالى جعل عقوبتهم أن أصابهم حر عظيم مدة سبعة أيام لا يكنهم منه شيء ثم أقبلت إليهم سحابة أظلتهم فجعلوا ينطلقون إليها يستظلون بظلها من الحر فلما اجتمعوا كلهم تحتها أرسل الله تعالى عليهم منها شررا من نار ولهبا ووهجا عظيما ورجفت بهم الأرض وجاءتهم صيحة عظيمة أزهقت أرواحهم ولهذا قال تعالى \"إنه كان عذاب يوم عظيم\" وقد ذكر الله تعالى صفة إهلاكهم في ثلاثة مواطن كل موطن بصفة تناسب ذلك السياق ففي الأعراف ذكر أنهم أخذتهم الرجفة فأصبحوا في دارهم جاثمين وذلك لأنهم قالوا \"لنخرجنك يا شعيب والذين آمنوا معك من قريتنا أو لتعودن في ملتنا\" فأرجفوا نبي الله ومن اتبعه فأخذتهم الرجفة وفي سورة هود قال \"فأخذتهم الصيحة\" وذلك لأنهم استهزءوا بنبي الله في قولهم \"أصلاتك تأمرك أن نترك ما يعبد آباؤنا أو أن نفعل في أموالنا ما نشاء إنك لأنت الحليم الرشيد\" قالوا ذلك على سبيل التهكم والازدراء فناسب أن تأتيهم صيحة تسكتهم فقال \"فأخذتهم الصيحة\" الآية وههنا قالوا \"فأسقط علينا كسفا من السماء\" الآية على وجه التعنت والعناد فناسب أن يحقق عليهم ما استبعدوا وقوعه \"فأخذهم عذاب يوم الظلة إنه كان عذاب يوم عظيم\" قال قتادة: قال عبد الله بن عمر رضي الله عنه: إن الله سلط عليهم الحر سبعة أيام حتى ما يظلهم منه شيء ثم إن الله أنشأ لهم سحابة فانطلق إليها أحدهم فاستظل بها فأصاب تحتها بردا وراحة فأعلم بذلك قومه فأتوها جميعا فاستظلوا تحتها فأججت عليهم نارا وهكذا روي عن عكرمة وسعيد بن جبير والحسن وقتادة وغيرهم وقال عبد الرحمن بن زيد بن أسلم بعث الله إليهم الظلة حتى إذا اجتمعوا كلهم كشف الله عنهم الظلة وأحمى عليهم الشمس فاحترقوا كما يحترق الجراد في المقلى وقال محمد بن كعب القرظي: إن أهل مدين عذبوا بثلاثة أصناف من العذاب: أخذتهم الرجفة في دارهم حتى خرجوا منها فلما خرجوا منها أصابهم فزع شديد ففرقوا أن يدخلوا إلى البيوت فتسقط عليهم فأرسل الله عليهم الظلة فدخل تحتها رجل فقال ما رأيت كاليوم ظلا أطيب ولا أبرد من هذا هلموا أيها الناس فدخلوا جميعا تحت الظلة فصاح بهم صيحة واحدة فماتوا جميعا ثم تلا محمد بن كعب \"فأخذهم عذاب يوم الظلة إنه كان عذاب يوم عظيم\" وقال محمد بن جرير حدثني الحارث حدثني الحسن حدثني سعيد بن زيد أخو حماد بن زيد حدثنا حاتم بن أبي صغيرة حدثني يزيد الباهلي سألت ابن عباس عن هذه الآية \"فأخذهم عذاب يوم الظلة\" الآية قال بعث الله عليهم رعدا وحرا شديدا فأخذ بأنفاسهم فخرجوا من البيوت هربا إلى البرية فبعث الله عليهم سحابة فأظلتهم من الشمس فوجدوا لها بردا ولذة فنادى بعضهم بعضا حتى إذا اجتمعوا تحتها أرسل الله عليهم نارا قال ابن عباس فذلك عذاب يوم الظلة إنه كان عذاب يوم عظيم."
    },
    {
      "ayah": 19,
      "surah": 26,
      "text": "ولهذا قال \"وأنت من الكافرين\" أي الجاحدين قاله ابن عباس وعبد الرحمن بن زيد بن أسلم واختاره ابن جرير."
    },
    {
      "ayah": 190,
      "surah": 26,
      "text": "\"إن في ذلك لآية وما كان أكثرهم مؤمنين وإن ربك لهو العزيز الرحيم\" أي العزيز في انتقامه من الكافرين الرحيم بعباده المؤمنين."
    },
    {
      "ayah": 191,
      "surah": 26,
      "text": "\"إن في ذلك لآية وما كان أكثرهم مؤمنين وإن ربك لهو العزيز الرحيم\" أي العزيز في انتقامه من الكافرين الرحيم بعباده المؤمنين."
    },
    {
      "ayah": 192,
      "surah": 26,
      "text": "يقول تعالى مخبرا عن الكتاب الذي أنزله على عبده ورسوله محمد صلى الله عليه وسلم \"وإنه\" أي القرآن الذي تقدم ذكره في أول السورة في قوله \"وما يأتيهم من ذكر من ربهم محدث\" الآية \"لتنزيل رب العالمين\" أي أنزله الله عليك وأوحاه إليك."
    },
    {
      "ayah": 193,
      "surah": 26,
      "text": "\"نزل به الروح الأمين\" وهو جبريل عليه السلام قاله غير واحد من السلف: ابن عباس ومحمد بن كعب وقتادة وعطية العوفي والسدي والضحاك والزهري وابن جريج وهذا مما لا نزاع فيه قال الزهري وهذه كقوله \"قل من كان عدوا لجبريل فإنه نزله على قلبك بإذن الله مصدقا لما بين يديه\" وقال مجاهد: من كلمه الروح الأمين لا تأكله الأرض."
    },
    {
      "ayah": 194,
      "surah": 26,
      "text": "\"على قلبك لتكون من المنذرين\" أي نزل به ملك كريم أمين ذو مكانة عند الله مطاع في الملأ الأعلى \"على قلبك\" يا محمد سالما من الدنس والزيادة والنقص \"لتكون من المنذرين\" أي لتنذر به بأس الله ونقمته على من خالفه وكذبه وتبشر به المؤمنين المتبعين له."
    },
    {
      "ayah": 195,
      "surah": 26,
      "text": "وقوله تعالى: \"بلسان عربي مبين\" أي هذا القرآن الذي أنزلناه إليك أنزلناه باللسان العربي الفصيح الكامل الشامل ليكون بينا واضحا ظاهرا قاطعا للعذر مقيما للحجة دليلا إلى المحجة قال ابن أبي حاتم حدثنا أبي حدثنا عبد الله بن أبي بكر العتكي حدثنا عباد بن عباد المهلبي عن موسى بن محمد عن إبراهيم التيمي عن أبيه قال: بينما رسول الله صلى الله عليه وسلم مع أصحابه في يوم دجن إذ قال لهم \"كيف ترون بواسقها؟\" قالوا ما أحسنها وأشد تراكمها قال: \"فكيف ترون قواعدها؟\" قالوا ما أحسنها وأشد تمكنها قال \"فكيف ترون جريها\" ؟ قالوا ما أحسنه وأشد سواده قال \"فكيف ترون رحاها استدارت ؟\" قالوا ما أحسنها وأشد استدارتها قال: \"فكيف ترون برقها أو ميض أم خفق أم يشق شقا؟\" قالوا بل يشق شقا ؟ قال: \"الحياء الحياء إن شاء الله\" قال فقال رجل يا رسول الله بأبي وأمي ما أفصحك ما رأيت الذي هو أعرب منك قال فقال: حق لي وإنما أنزل القرآن بلساني والله يقول:\"بلسان عربي مبين\" وقال سفيان الثوري لم ينزل وحي إلا بالعربية ثم ترجم كل نبي لقومه واللسان يوم القيامة بالسريانية فمن دخل الجنة تكلم بالعربية رواه ابن أبي حاتم."
    },
    {
      "ayah": 196,
      "surah": 26,
      "text": "يقول تعالى: وإن ذكر هذا القرآن والتنويه به لموجود في كتب الأولين المأثورة عن أنبيائهم الذين بشروا به في قديم الدهر وحديثه كما أخذ الله عليهم الميثاق بذلك حتى قام آخرهم خطيبا في ملئه بالبشارة بأحمد \"وإذ قال عيسى ابن مريم يا بني إسرائيل إني رسول الله إليكم مصدقا لما بين يدي من التوراة ومبشرا برسول يأتي من بعد اسمه أحمد\" والزبر ههنا هي الكتب جمع زبرة وكذلك الزبور وهو كتاب داود وقال الله تعالى \"وكل شيء فعلوه في الزبر\" أي مكتوب عليهم في صحف الملائكة."
    },
    {
      "ayah": 197,
      "surah": 26,
      "text": "ثم قال تعالى \"أو لم يكن لهم آية أن يعلمه علماء بني إسرائيل\" أي أو ليس يكفيهم من الشاهد الصادق على ذلك أن العلماء من بني إسرائيل يجدون ذكر هذا القرآن في كتبهم التي يدرسونها والمراد العدول منهم الذين يعترفون بما في أيديهم من صفة محمد صلى الله عليه وسلم ومبعثه وأمته كما أخبر بذلك من آمن منهم كعبد الله بن سلام وسلمان الفارسي عمن أدركه منهم ومن شاكلهم قال الله تعالى \"الذين يتبعون الرسول النبي الأمي\" الآية ثم قال تعالى مخبرا عن شدة كفر قريش وعنادهم لهذا القرآن أنه لو نزل على رجل من الأعاجم ممن لا يدري من العربية كلمة وأنزل عليه هذا الكتاب ببيانه وفصاحته لا يؤمنون به."
    },
    {
      "ayah": 198,
      "surah": 26,
      "text": "ولهذا قال \"ولو نزلناه على بعض الأعجمين فقرأه عليهم ما كانوا به مؤمنين\" كما أخبر عنهم في الآية الأخرى \"ولو فتحنا عليهم بابا من السماء فظلوا فيه يعرجون لقالوا إنما سكرت أبصارنا\" الآية وقال تعالى \"ولو أننا نزلنا إليهم الملائكة وكلمهم الموتى\" الآية وقال تعالى: \"إن الذين حقت عليهم كلمة ربك لا يؤمنون\" الآية."
    },
    {
      "ayah": 199,
      "surah": 26,
      "text": "ولهذا قال \"ولو نزلناه على بعض الأعجمين فقرأه عليهم ما كانوا به مؤمنين\" كما أخبر عنهم في الآية الأخرى \"ولو فتحنا عليهم بابا من السماء فظلوا فيه يعرجون لقالوا إنما سكرت أبصارنا\" الآية وقال تعالى \"ولو أننا نزلنا إليهم الملائكة وكلمهم الموتى\" الآية وقال تعالى: \"إن الذين حقت عليهم كلمة ربك لا يؤمنون\" الآية."
    },
    {
      "ayah": 2,
      "surah": 26,
      "text": "وقوله تعالى \"تلك آيات الكتاب المبين\" أي هذه آيات القرآن المبين أي البين الواضح الجلي الذي يفصل بين الحق والباطل والغي والرشاد."
    },
    {
      "ayah": 20,
      "surah": 26,
      "text": "\"قال فعلتها إذا\" أي في تلك الحال \"وأنا من الضالين\" أي قبل أن يوحى إلي وينعم الله علي بالرسالة والنبوة قال ابن عباس رضي الله عنهما ومجاهد وقتادة والضحاك وغيرهم \"وأنا من الضالين\" أي الجاهلين قال ابن جريج وهو كذلك في قراءة عبدالله بن مسعود رضي الله عنه."
    },
    {
      "ayah": 200,
      "surah": 26,
      "text": "يقول تعالى كذلك سلكنا التكذيب والكفر والجحود والعناد أي أدخلناه في قلوب المجرمين."
    },
    {
      "ayah": 201,
      "surah": 26,
      "text": "\"لا يؤمنون به\" أي بالحق \"حتى يروا العذاب الأليم\" أي حيث لا ينفع الظالمين معذرتهم ولهم اللعنة ولهم سوء الدار."
    },
    { "ayah": 202, "surah": 26, "text": "\"فيأتيهم بغتة\" أي عذاب الله بغتة." },
    {
      "ayah": 203,
      "surah": 26,
      "text": "\"وهم لا يشعرون فقولوا هل نحن منظرون\" أي يتمنون حين يشاهدون العذاب أن لو أنظروا قليلا ليعلموا في زعمهم بطاعة الله كما قال الله تعالى \"وأنذر الناس يوم يأتيهم العذاب- إلى قوله - ما لكم من زوال\" فكل ظالم وفاجر وكافر إذا شاهد عقوبته ندم ندما شديدا هذا فرعون لما دعا عليه الكليم بقوله \"ربنا إنك آتيت فرعون وملئه زينة وأموالا في الحياة الدنيا - إلى قوله - قال قد أجيبت دعوتكما\" فأثرت هذه الدعوة في فرعون فما آمن حتى رأى العذاب الأليم \"حتى إذا أدركه الغرق قال آمنت أنه لا إله إلا الذي آمنت به بنو إسرائيل - إلى قوله - وكنت من المفسدين\" وقال تعالى \"فلما رأوا بأسنا قالوا آمنا بالله وحده\" الآيات."
    },
    {
      "ayah": 204,
      "surah": 26,
      "text": "وقوله تعالى \"أفبعذابنا يستعجلون\" إنكار عليهم وتهديد لهم فإنهم كانوا يقولون للرسول تكذيبا واستبعادا: ائتنا بعذاب الله; كما قال تعالى \"ويستعجلونك بالعذاب\" الآية."
    },
    {
      "ayah": 205,
      "surah": 26,
      "text": "ثم قال \"أفرأيت إن متعناهم سنين ثم جاءهم ما كانوا يوعدون ما أغنى عنهم ما كانوا يمتعون\" أي لو أخرناهم وأنظرناهم وأملينا لهم برهة من الدهر وحينا من الزمان وإن طال ثم جاءهم أمر الله أي شيء يجدي عنهم ما كانوا فيه من النعيم \"كأنهم يوم يرونها لم يلبثوا إلا عشية أو ضحاها\" وقال تعالى \"يود أحدهم لو يعمر ألف سنة وما هو بمزحزحه من العذاب أن يعمر\"."
    },
    {
      "ayah": 206,
      "surah": 26,
      "text": "ثم جاءهم أمر الله أي شيء يجدي عنهم ما كانوا فيه من النعيم \"كأنهم يوم يرونها لم يلبثوا إلا عشية أو ضحاها\" وقال تعالى \"يود أحدهم لو يعمر ألف سنة وما هو بمزحزحه من العذاب أن يعمر\"."
    },
    {
      "ayah": 207,
      "surah": 26,
      "text": "ثم جاءهم أمر الله أي شيء يجدي عنهم ما كانوا فيه من النعيم \"كأنهم يوم يرونها لم يلبثوا إلا عشية أو ضحاها\" وقال تعالى \"يود أحدهم لو يعمر ألف سنة وما هو بمزحزحه من العذاب أن يعمر\"."
    },
    {
      "ayah": 208,
      "surah": 26,
      "text": "وقال تعالى: \"وما يغني عنه ماله إذا تردى\" ولهذا قال تعالى \"ما أغنى عنهم ما كانوا يمتعون\" وفي الحديث الصحيح \"يؤتى بالكافر فيغمس في النار غمسة ثم يقال له هل رأيت خيرا قط ؟ هل رأت نعيما قط ؟ فيقول لا والله يارب ويؤتى بأشد الناس بؤسا كان في الدنيا فيصبغ في الجنة صبغة ثم يقال له هل رأيت بؤسا قط ؟ فيقول لا والله يارب\" أي ما كان شيئا كان ولهذا كان عمر بن الخطاب رضي الله عنه يتمثل بهذا البيت: كأنك لم تؤثر من الدهر ليلة إذا أنت أدركت الذي أنت تطلب ثم قال تعالى مخبرا عن عدله في خلقه أنه ما أهلك أمة من الأمم إلا بعد الإعذار إليهم والإنذار لهم وبعثهِ الرسل إليهم وقيام الحجة عليهم ولهذا قال تعالى \"وما أهلكنا من قرية إلا لها منذرون ذكرى وما كنا ظالمين\" كما قال تعالى: \"وما كنا معذبين حتى نبعث رسولا\" وقال تعالى \"وما كان ربك مهلك القرى حتى يبعث في أمها رسولا يتلو عليهم آياتنا\" -إلى قوله - \"وأهلها ظالمون\"."
    },
    {
      "ayah": 209,
      "surah": 26,
      "text": "وقال تعالى: \"وما يغني عنه ماله إذا تردى\" ولهذا قال تعالى \"ما أغنى عنهم ما كانوا يمتعون\" وفي الحديث الصحيح \"يؤتى بالكافر فيغمس في النار غمسة ثم يقال له هل رأيت خيرا قط ؟ هل رأت نعيما قط ؟ فيقول لا والله يارب ويؤتى بأشد الناس بؤسا كان في الدنيا فيصبغ في الجنة صبغة ثم يقال له هل رأيت بؤسا قط ؟ فيقول لا والله يارب\" أي ما كان شيئا كان ولهذا كان عمر بن الخطاب رضي الله عنه يتمثل بهذا البيت: كأنك لم تؤثر من الدهر ليلة إذا أنت أدركت الذي أنت تطلب ثم قال تعالى مخبرا عن عدله في خلقه أنه ما أهلك أمة من الأمم إلا بعد الإعذار إليهم والإنذار لهم وبعثهِ الرسل إليهم وقيام الحجة عليهم ولهذا قال تعالى \"وما أهلكنا من قرية إلا لها منذرون ذكرى وما كنا ظالمين\" كما قال تعالى: \"وما كنا معذبين حتى نبعث رسولا\" وقال تعالى \"وما كان ربك مهلك القرى حتى يبعث في أمها رسولا يتلو عليهم آياتنا\" -إلى قوله - \"وأهلها ظالمون\"."
    },
    {
      "ayah": 21,
      "surah": 26,
      "text": "\"ففررت منكم لما خفتكم\". الآية أي انفصل الحال الأول وجاء أمر آخر فقد أرسلني الله إليك فإن أطعته سلمت وإن خالفته عطبت."
    },
    {
      "ayah": 210,
      "surah": 26,
      "text": "يقول تعالى مخبرا عن كتابه العزيز الذي لا يأتيه الباطل من بين يديه ولا من خلفه تنزيل من حكيم حميد أنه نزل به الروح الأمين المؤيد من الله \"وما تنزلت به الشياطين\" ثم ذكر أنه يمتنع عليهم ذلك من ثلاثة أوجه أحدها: أنه ما ينبغي لهم أي ليس هو من بغيتهم ولا من طلبتهم لأن من سجاياهم الفساد وإضلال العباد وهذا فيه الأمر بالمعروف والنهي عن المنكر ونور وهدى وبرهان عظيم فبينه وبين الشياطين منافاة عظيمة."
    },
    {
      "ayah": 211,
      "surah": 26,
      "text": "ولهذا قال تعالى \"وما ينبغي لهم\" وقوله تعالى \"وما يستطيعون\" أي ولو انبغى لهم لما استطاعوا ذلك قال الله تعالى \"لو أنزلنا هذا القرآن على جبل لرأيته خاشعا متصدعا من خشية الله\" ثم أنه لو انبغى لهم واستطاعوا حمله وتأديته لما وصلوا إلى ذلك لأنهم بمعزل عن استماع القرآن حال نزوله لأن السماء ملئت حرسا شديدا وشهبا في مدة إنزال القرآن على رسول الله فلم يخلص أحد من الشياطين إلى استماع حرف ولم يجد منه لئلا يشتبه الأمر وهذا من رحمة الله بعباده وحفظه لشرعه وتأييده لكتابه ولرسوله."
    },
    {
      "ayah": 212,
      "surah": 26,
      "text": "ولهذا قال تعالى \"إنهم عن السمع لمعزولون\" كما قال تعالى مخبرا عن الجن \"وأنا لمسنا السماء فوجدناها ملئت حرسا شديدا وشهبا وأنا كنا نقعد منها مقاعد للسمع فمن يستمع الآن يجد له شهابا رصدا- إلى قوله - أم أراد بهم ربهم رشدا\"."
    },
    {
      "ayah": 213,
      "surah": 26,
      "text": "يقول تعالى آمرا بعبادته وحده لا شريك له ومخبرا أن من أشرك به عذبه; ثم قال تعالى أمرا لرسوله صلى الله عليه وسلم أن ينذر عشيرته الأقربين أي الأدنين إليه; وأنه لا يخلص أحدا منهم إلا إيمانه بربه عز وجل; وأمره أن يلين جانبه لمن أتبعه من عباد الله المؤمنين ومن عصاه من خلق الله كائنا من كان فليتبرأ منه ولهذا قال تعالى \"فإن عصوك فقل إني بريء مما تعملون\" وهذه النذارة الخاصة لا تنافي العامة بل هي فرد من أجزائها كما قال تعالى \"لتنذر قوما ما أنذر آباؤهم فهم غافلون\" وقال تعالى \" لتنذر أم القرى ومن حولها \" وقال تعالى \"وأنذر به الذين يخافون أن يحشروا إلى ربهم\" وقال تعالى \"لتبشر به المتقين وتنذر به قوما لدا\" وقال تعالى \"لأنذركم به ومن بلغ\" كما قال تعالى \"ومن يكفر به من الأحزاب فالنار موعده\" وفي صحيح مسلم \"والذي نفسي بيده لا يسمع بي أحد من هذه الأمة يهودي ولا نصراني ثم لا يؤمن بي إلا دخل النار\"."
    },
    {
      "ayah": 214,
      "surah": 26,
      "text": "وقد وردت أحاديث كثيرة في نزول هذه الآية الكريمة فلنذكرها \"الحديث الأول\": قال الإمام أحمد رحمه الله حدثنا عبدالله بن نمير عن الأعمش عن عمرو بن مرة عن سعيد بن جبير عن ابن عباس رضي الله عنهما قال: لما أنزل الله عز وجل \"وأنذر عشيرتك الأقربين\" أتى النبي صلى الله عليه وسلم الصفا فصعد عليه ثم نادى \"يا صباحاه\" فاجتمع الناس إليه بين رجل يجيء إليه وبين رجل يبعث رسوله فقال رسول الله صلى الله عليه وسلم \"يا بني عبد المطلب ; يا بني فهر; يا بني لؤي أرأيتم لو أخبرتكم أن خيلا بسفح هذا الجبل تريد أن تغير عليكم صدقتموني؟\" قالوا نعم قال \"فإني نذير لكم بين يدي عذاب شديد\" فقال أبو لهب تبا لك سائر اليوم أما دعوتنا إلا لهذا ؟ وأنزل الله \"تبت يدا أبي لهب وتب\" ورواه البخاري ومسلم والترمذي والنسائي من طرق عن الأعمش به \"الحديث الثاني\": قال الإمام أحمد حدثنا وكيع حدثنا هشام عن أبيه عن عائشة قالت: لما نزلت \"وأنذر عشيرتك الأقربين\" قام رسول الله صلى الله عليه وسلم فقال \"يا فاطمة ابنة محمد يا صفية ابنة عبد المطلب يا بني عبد المطلب لا أملك لكم من الله شيئا سلوني من مالي ما شئتم\" انفرد بإخراجه مسلم \"الحديث الثالث\": قال الإمام أحمد: حدثنا معاوية بن عمرو حدثنا زائدة حدثنا عبد الملك بن عمير عن موسى بن طلحة عن أبي هريرة رضي الله عنه قال: لما نزلت هذه الآية \"وأنذر عشيرتك الأقربين\" دعا رسول الله صلى الله عليه وسلم قريشا فعم وخص فقال \"يا معشر قريش أنقذوا أنفسكم من النار; يا معشر بني كعب أنقذوا أنفسكم من النار; يا معشر بني هاشم أنقذوا أنفسكم من النار; يا معشر بني عبد المطلب أنقذوا أنفسكم من النار; يا فاطمة بنت محمد أنقذي نفسك من النار; فإني والله لا أملك لكم من الله شيئا إلا أن لكم رحما سأبلها ببلالها\" ورواه مسلم والترمذي من حديث عبد الملك بن عمير به وقال الترمذي غريب من هذا الوجه; ورواه النسائي من حديث موسى بن طلحة مرسلا ولم يذكر فيه أبا هريرة; والموصول هو الصحيح ; وأخرجاه في الصحيحين من حديث الزهري عن سعيد بن المسيب وأبي سلمة بن عبد الرحمن عن أبي هريرة; وقال الإمام أحمد حدثنا يزيد حدثنا محمد يعني ابن إسحاق عن أبي الزناد عن الأعرج عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم \"يا بني عبد المطلب اشتروا أنفسكم من الله; يا صفية عمة رسول الله ويا فاطمة بنت رسول الله اشتريا أنفسكما من الله فإني لا أغني عنكما من الله شيئا سلاني من مالي ما شئتما\" تفرد به من هذا الوجه وتفرد به أيضا عن معاوية عن زائدة عن أبي الزناد عن الأعرج عن أبي هريرة عن النبي صلى الله عليه وسلم بنحوه ورواه أيضا عن حسن ثنا ابن لهيعة عن الأعرج عن أبي هريرة مرفوعا وقال أبو يعلى حدثنا سويد بن سعيد حدثنا همام بن إسماعيل عن موسى ابن وردان عن أبي هريرة عن النبي صلى الله عليه وسلم \"يا بني قصي يا بني هاشم يا بني عبد مناف أنا النذير والموت المغير والساعة الموعد\" \"الحديث الرابع\": قال الإمام أحمد حدثنا يحيى بن سعيد ثنا التيمي عن أبي عثمان عن قبيصة بن مخارق وزهير بن عمرو قالا: لما نزلت \"وأنذر عشيرتك الأقربين\" صعد رسول الله صلى الله عليه وسلم رضمة من جبل على أعلاها حجر فجعل ينادي \"يا بني عبد مناف إنما أنا نذير إنما مثلي ومثلكم كرجل رأى العدو فذهب يربأ أهله رجاء أن يسبقوه فجعل ينادي ويهتف يا صباحاه\" ورواه مسلم والنسائي من حديث سليمان بن طرخان التيمي عن أبي عثمان عبد الرحمن ابن سهل النهدي عن قبيصة وزهير بن عمرو الهلالي به \"الحديث الخامس\": قال الإمام أحمد حدثنا أسود بن عامر حدثنا شريك عن الأعمش عن المنهال عن عباد بن عبدالله الأسدي عن علي رضي الله عنه قال: لما نزلت هذه الآية \"وأنذر عشيرتك الأقربين\" جمع النبي صلى الله عليه وسلم من أهل بيته فاجتمع ثلاثون فأكلوا وشربوا قال: وقال لهم \"من يضمن عني ديني ومواعيدي ويكون معي في الجنة ويكون خليفتي في أهلي؟\" فقال رجل لم يسمه شريك يا رسول الله أنت كنت بحري من يقوم بهذا قال ثم قال الآخر- ثلاثا - قال فعرض ذلك على أهل بيته فقال علي أنا \"طريق أخرى بأبسط من هذا السياق\" قال الإمام أحمد حدثنا عفان حدثنا أبو عوانة حدثنا عثمان بن المغيرة عن أبي صادق عن ربيعة بن ماجد عن علي رضي الله عنه قال: جمع رسول الله صلى الله عليه وسلم أو دعا رسول الله صلى الله عليه وسلم - بني عبد المطلب وهم رهط وكلهم يأكل الجذعة ويشرب الفرق فصنع لهم مدا من طعام فأكلوا حتى شبعوا وبقي الطعام كما هو كأنه لم يمس ثم دعا بِعَسٍ فشربوا حتى رووا وبقي الشراب كأنه لم يمس أو لم يشرب وقال \"يا بني عبد المطلب إني بعثت إليكم خاصة وإلى الناس عامة فقد رأيتم من هذه الآية ما رأيتم فأيكم يبايعني على أن يكون أخي وصاحبي\" قال فلم يقم إليه أحد قال فقمت إليه وكنت أصغر القوم قال: فقال \"اجلس\" ثم قال ثلاث مرات كل ذلك أقوم إليه فيقول لي \"اجلس\" حتى كان في الثالثة ضرب بيده على يدي \"طريق أخرى أغرب وأبسط من هذا السياق بزيادات أخر\" قال الحافظ أبو بكر البيهقي في دلائل النبوة أخبرنا محمد بن عبدالله الحافظ أخبرنا أبو العباس محمد بن يعقوب حدثنا أحمد بن عبد الجبار حدثنا يونس بن بكير عن محمد بن إسحاق قال: حدثني من سمع عبدالله بن الحارث بن نوفل واستكتمني اسمه عن ابن عباس عن علي بن أبي طالب رضي الله عنه قال: لما نزلت هذه الآية على رسول الله \"وأنذر عشيرتك الأقربين واخفض جناحك لمن اتبعك من المؤمنين\" قال رسول الله صلى الله عليه وسلم \"عرفت أني إن بادرت بها قومي رأيت منهم ما أكره فَصَمَتُّ فجاءني جبريل عليه السلام فقال يا محمد إنك إن لم تفعل ما أمرت به عذبك ربك\" قال علي رضي الله عنه فدعاني فقال يا علي \"إن الله تعالى قد أمرني أن أنذر عشيرتي الأقربين فعرفت أني إن بادرتهم بذلك رأيت منهم ما أكره فصمت عن ذلك ثم جاءني جبريل فقال يا محمد إن لم تفعل ما أمرت به عذبك ربك: فاصنع لنا يا عليُّ شاةً على صاعٍ من طعامٍ وأعد لنا عس لبن ثم اجمع لي بني عبد المطلب\" ففعلتُ فاجتمعوا إليه وهم يومئذ أربعون رجلا يزيدون رجلا أو ينقصون رجلا فيهم أعمامه أبو طالب وحمزة والعباس وأبو لهب الكافر الخبيث فقدمت إليهم تلك الجفنة فأخذ منها رسول الله صلى الله عليه وسلم جذبة فشقها بأسنانه ثم رمى بها في نواحيها وقال \"كلوا بسم الله\" فأكل القوم حتى نهلوا عنه ما يرى إلا آثار أصابعهم والله إن كان الرجل منهم ليأكل مثلها ثم قال رسول الله صلى الله عليه وسلم \"اسقهم يا علي\" فجئت بذلك القعب فشربوا منه حتى نهلوا جميعا وايم الله إن كان الرجل منهم ليشرب مثله فلما أراد رسول الله صلى الله عليه وسلم أن يكلمهم بدره أبو لهب إلى الكلام فقال: لهدَّ ما سحركم صاحبكم فتفرقوا ولم يكلمهم رسول الله صلى الله عليه وسلم فلما كان الغد قال رسول الله صلى الله عليه وسلم \"يا علي عد لنا بمثل الذي كنتَ صنعت بالأمس من الطعام والشراب فإن هذا الرجل قد بدرني إلى ما سمعت قبل أن أكلم القوم\" ففعلت ثم جمعتهم له فصنع رسول الله صلى الله عليه وسلم كما صنع بالأمس فأكلوا حتى نهلوا عنه وايم الله إن كان الرجل منهم ليأكل مثلها ثم قال رسول الله صلى الله عليه وسلم \"اسقهم يا علي\" فجئت بذلك القعب فشربوا منه حتى نهلوا جميعا وايم الله إن كان الرجل منهم ليشرب مثله فلما أراد رسول الله صلى الله عليه وسلم أن يكلمهم بدره أبو لهب بالكلام فقال; لهد ما سحركم صاحبكم: فتفرقوا ولم يكلمهم رسول الله صلى الله عليه وسلم فلما كان من الغد قال رسول الله صلى الله عليه وسلم \"يا علي عد لنا بمثل الذي كنت صنعت لنا بالأمس من الطعام والشراب فإن هذا الرجل قد بدرني إلى ما سمعت قبل أن أكلم القوم\" ففعلت ثم جمعتهم له فصنع رسول الله صلى الله عليه وسلم كم صنع بالأمس فأكلوا حتى نهلوا ثم سقيتهم من ذلك القعب حتى نهلوا عنه وايم الله إن كان الرجل منهم ليأكل مثلها ويشرب مثلها ثم قال رسول الله صلى الله عليه وسلم \"يا بني عبد المطلب إني والله ما أعلم شابا من العرب جاء قومه بأفضل مما جئتكم به إني قد جئتكم بخير الدنيا والآخرة قال أحمد بن عبد الجبار بلغني أن ابن إسحاق إنما سمعه من عبد الغفار ابن القاسم أبي مريم عن المنهال بن عمرو عن عبدالله بن الحارث. وقد رواه أبو جعفر بن جرير عن ابن حميد عن سلمة عن ابن إسحاق عن عبد الغفار بن القاسم أبي مريم عن المنهال ابن عمرو عن عبدالله بن الحارث عن ابن عباس عن علي بن أبي طالب فذكر مثله وزاد بعد قوله \"إني جئتكم بخير الدنيا والآخرة: وقد أمرني الله أن أدعوكم إليه فأيكم يؤازرني على هذا الأمر على أن يكون أخي وكذا وكذا\" ؟ قال فأحجم القوم عنها جميعا وقلت - وإني لأحدثهم سنا وأمرضهم عينا وأعظمهم بطنا وأخمشهم ساقا - أنا يا نبي الله أكون وزيرك عليه فأخذ برقبتي ثم قال \"إن هذا أخي وكذا وكذا فاسمعوا له وأطيعوا\" ثم قال القوم يضحكون ويقولون لأبي طالب قد أمرك أن تسمع لابنك وتطيع تفرد بهذا السياق عبد الغفار بن القاسم أبي مريم وهو متروك كذاب شيعي اتهمه علي بن المديني وغيره بوضع الحديث وضعفه الأئمة رحمهم الله \"طريق أخرى\" قال ابن أبي حاتم حدثنا أبي أخبرنا الحسين عن عيسى بن ميسرة الحارثي حدثنا عبدالله بن عبد القدوس عن الأعمش عن المنهال بن عمرو عن عبدالله بن الحارث قال: قال علي رضي الله عنه لما نزلت هذه الآية \"وأنذر عشيرتك الأقربين\" قال لي رسول الله صلى الله عليه وسلم \"اصنع لي رجل شاة بصاع من طعام وإناء لبنا\" قال ففعلت ثم قال لي \"ادع بني هاشم\" قال فدعوتهم وإنهم يومئذ أربعون غير رجل أو أربعون ورجل قال وفيهم عشرة كلهم يأكل الجذعة بإدامها قال فلما أتوا بالقصعة أخذ رسول الله صلى الله عليه وسلم من ذروتها ثم قال \"كلوا\" فأكلوا حتى شبعوا وهي على هيئتها لم يزدردوا منها إلا اليسير قال ثم أتيتهم بالإناء فشربوا حتى رووا قال وفضل فضل فلما فرغوا أراد رسول الله صلى الله عليه وسلم أن يتكلم فبدروه الكلام فقالوا ما رأينا كاليوم في السحر فسكت رسول الله صلى الله عليه وسلم ثم قال لي \"اصنع لى رجل شاة بصاع من طعام\" فصنعت قال فدعاهم فلما أكلوا وشربوا قال فبدروه فقالوا مثل مقالتهم الأولى فسكت رسول الله صلى الله عليه وسلم ثم قال لي \"اصنع لي رجل شاة بصاع من طعام\" فصنعت قال فجمعتهم فلما أكلوا وشربوا بدرهم رسول الله صلى الله عليه وسلم الكلام فقال \"أيكم يقضي عني ديني ويكون خليفتي في أهلي؟ \"قال فسكتوا وسكت العباس خشية أن يحيط ذلك بماله قال وسكت أنا لسن العباس ثم قالها مرة أخرى فسكت العباس فلما رأيت ذلك قلت أنا يا رسول الله قال وإني يومئذ لأسوأهم هيئة وإني لأعمش العينين ضخم البطن خمش الساقين فهذه طرق متعددة لهذا الحديث عن علي رضي الله عنه ومعنى سؤاله صلى الله عليه وسلم لأعمامه وأولادهم أن يقضوا عنه دينه ويخلفوه في أهله يعني إن قتل في سبيل الله كأنه خشي إذا قام بأعباء الإنذار أن يقتل فلما أنزل الله تعالى \"يا أيها الرسول بلغ ما أنزل إليك من ربك وإن لم تفعل فما بلغت رسالته والله يعصمك من الناس\" فعند ذلك أمن وكان أو لا يحرس حتى نزلت هذه الآية \"والله يعصمك من الناس\" ولم يكن أحد في بني هاشم إذ ذاك أشد إيمانا وإيقانا وتصديقا لرسول الله صلى الله عليه وسلم من علي رضي الله عنه ولهذا بدرهم إلى التزام ما طلب منهم رسول الله صلى الله عليه وسلم ثم كان بعد هذا والله أعلم دعاؤه الناس جهرة على الصفا وإنذاره لبطون قريش عموما وخصوصا حتى سمى من سمى من أعمامه وعماته وبناته لينبه بالأدنى على الأعلى أي إنما أنا نذير والله يهدي من يشاء إلى صراط مستقيم وقد روى الحافظ ابن عساكر في ترجمة عبد الواحد الدمشقي من طريق عمرو ابن سمرة عن محمد بن سوقة عن عبد الواحد الدمشقي قال: رأيت أبا الدرداء رضي الله عنه يحدث الناس ويفتيهم وولده إلى جنبه وأهل بيته جلوس في جانب المسجد يتحدثون فقيل له ما بال الناس يرغبون فيما عندك من العلم وأهل بيتك جلوس لاهين ؟ فقال لأني سمعت رسول الله صلى الله عليه وسلم يقول \"أزهد الناس في الدنيا الأنبياء وأشدهم عليهم الأقربون\" وذلك فيما أنزل الله عز وجل قال تعالى \"وأنذر عشيرتك الأقربين - إلى قوله - فقل إني بريء مما تعملون\"."
    },
    {
      "ayah": 215,
      "surah": 26,
      "text": "وقد وردت أحاديث كثيرة في نزول هذه الآية الكريمة فلنذكرها \"الحديث الأول\": قال الإمام أحمد رحمه الله حدثنا عبدالله بن نمير عن الأعمش عن عمرو بن مرة عن سعيد بن جبير عن ابن عباس رضي الله عنهما قال: لما أنزل الله عز وجل \"وأنذر عشيرتك الأقربين\" أتى النبي صلى الله عليه وسلم الصفا فصعد عليه ثم نادى \"يا صباحاه\" فاجتمع الناس إليه بين رجل يجيء إليه وبين رجل يبعث رسوله فقال رسول الله صلى الله عليه وسلم \"يا بني عبد المطلب ; يا بني فهر; يا بني لؤي أرأيتم لو أخبرتكم أن خيلا بسفح هذا الجبل تريد أن تغير عليكم صدقتموني؟\" قالوا نعم قال \"فإني نذير لكم بين يدي عذاب شديد\" فقال أبو لهب تبا لك سائر اليوم أما دعوتنا إلا لهذا ؟ وأنزل الله \"تبت يدا أبي لهب وتب\" ورواه البخاري ومسلم والترمذي والنسائي من طرق عن الأعمش به \"الحديث الثاني\": قال الإمام أحمد حدثنا وكيع حدثنا هشام عن أبيه عن عائشة قالت: لما نزلت \"وأنذر عشيرتك الأقربين\" قام رسول الله صلى الله عليه وسلم فقال \"يا فاطمة ابنة محمد يا صفية ابنة عبد المطلب يا بني عبد المطلب لا أملك لكم من الله شيئا سلوني من مالي ما شئتم\" انفرد بإخراجه مسلم \"الحديث الثالث\": قال الإمام أحمد: حدثنا معاوية بن عمرو حدثنا زائدة حدثنا عبد الملك بن عمير عن موسى بن طلحة عن أبي هريرة رضي الله عنه قال: لما نزلت هذه الآية \"وأنذر عشيرتك الأقربين\" دعا رسول الله صلى الله عليه وسلم قريشا فعم وخص فقال \"يا معشر قريش أنقذوا أنفسكم من النار; يا معشر بني كعب أنقذوا أنفسكم من النار; يا معشر بني هاشم أنقذوا أنفسكم من النار; يا معشر بني عبد المطلب أنقذوا أنفسكم من النار; يا فاطمة بنت محمد أنقذي نفسك من النار; فإني والله لا أملك لكم من الله شيئا إلا أن لكم رحما سأبلها ببلالها\" ورواه مسلم والترمذي من حديث عبد الملك بن عمير به وقال الترمذي غريب من هذا الوجه; ورواه النسائي من حديث موسى بن طلحة مرسلا ولم يذكر فيه أبا هريرة; والموصول هو الصحيح ; وأخرجاه في الصحيحين من حديث الزهري عن سعيد بن المسيب وأبي سلمة بن عبد الرحمن عن أبي هريرة; وقال الإمام أحمد حدثنا يزيد حدثنا محمد يعني ابن إسحاق عن أبي الزناد عن الأعرج عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم \"يا بني عبد المطلب اشتروا أنفسكم من الله; يا صفية عمة رسول الله ويا فاطمة بنت رسول الله اشتريا أنفسكما من الله فإني لا أغني عنكما من الله شيئا سلاني من مالي ما شئتما\" تفرد به من هذا الوجه وتفرد به أيضا عن معاوية عن زائدة عن أبي الزناد عن الأعرج عن أبي هريرة عن النبي صلى الله عليه وسلم بنحوه ورواه أيضا عن حسن ثنا ابن لهيعة عن الأعرج عن أبي هريرة مرفوعا وقال أبو يعلى حدثنا سويد بن سعيد حدثنا همام بن إسماعيل عن موسى ابن وردان عن أبي هريرة عن النبي صلى الله عليه وسلم \"يا بني قصي يا بني هاشم يا بني عبد مناف أنا النذير والموت المغير والساعة الموعد\" \"الحديث الرابع\": قال الإمام أحمد حدثنا يحيى بن سعيد ثنا التيمي عن أبي عثمان عن قبيصة بن مخارق وزهير بن عمرو قالا: لما نزلت \"وأنذر عشيرتك الأقربين\" صعد رسول الله صلى الله عليه وسلم رضمة من جبل على أعلاها حجر فجعل ينادي \"يا بني عبد مناف إنما أنا نذير إنما مثلي ومثلكم كرجل رأى العدو فذهب يربأ أهله رجاء أن يسبقوه فجعل ينادي ويهتف يا صباحاه\" ورواه مسلم والنسائي من حديث سليمان بن طرخان التيمي عن أبي عثمان عبد الرحمن ابن سهل النهدي عن قبيصة وزهير بن عمرو الهلالي به \"الحديث الخامس\": قال الإمام أحمد حدثنا أسود بن عامر حدثنا شريك عن الأعمش عن المنهال عن عباد بن عبدالله الأسدي عن علي رضي الله عنه قال: لما نزلت هذه الآية \"وأنذر عشيرتك الأقربين\" جمع النبي صلى الله عليه وسلم من أهل بيته فاجتمع ثلاثون فأكلوا وشربوا قال: وقال لهم \"من يضمن عني ديني ومواعيدي ويكون معي في الجنة ويكون خليفتي في أهلي؟\" فقال رجل لم يسمه شريك يا رسول الله أنت كنت بحري من يقوم بهذا قال ثم قال الآخر- ثلاثا - قال فعرض ذلك على أهل بيته فقال علي أنا \"طريق أخرى بأبسط من هذا السياق\" قال الإمام أحمد حدثنا عفان حدثنا أبو عوانة حدثنا عثمان بن المغيرة عن أبي صادق عن ربيعة بن ماجد عن علي رضي الله عنه قال: جمع رسول الله صلى الله عليه وسلم أو دعا رسول الله صلى الله عليه وسلم - بني عبد المطلب وهم رهط وكلهم يأكل الجذعة ويشرب الفرق فصنع لهم مدا من طعام فأكلوا حتى شبعوا وبقي الطعام كما هو كأنه لم يمس ثم دعا بِعَسٍ فشربوا حتى رووا وبقي الشراب كأنه لم يمس أو لم يشرب وقال \"يا بني عبد المطلب إني بعثت إليكم خاصة وإلى الناس عامة فقد رأيتم من هذه الآية ما رأيتم فأيكم يبايعني على أن يكون أخي وصاحبي\" قال فلم يقم إليه أحد قال فقمت إليه وكنت أصغر القوم قال: فقال \"اجلس\" ثم قال ثلاث مرات كل ذلك أقوم إليه فيقول لي \"اجلس\" حتى كان في الثالثة ضرب بيده على يدي \"طريق أخرى أغرب وأبسط من هذا السياق بزيادات أخر\" قال الحافظ أبو بكر البيهقي في دلائل النبوة أخبرنا محمد بن عبدالله الحافظ أخبرنا أبو العباس محمد بن يعقوب حدثنا أحمد بن عبد الجبار حدثنا يونس بن بكير عن محمد بن إسحاق قال: حدثني من سمع عبدالله بن الحارث بن نوفل واستكتمني اسمه عن ابن عباس عن علي بن أبي طالب رضي الله عنه قال: لما نزلت هذه الآية على رسول الله \"وأنذر عشيرتك الأقربين واخفض جناحك لمن اتبعك من المؤمنين\" قال رسول الله صلى الله عليه وسلم \"عرفت أني إن بادرت بها قومي رأيت منهم ما أكره فَصَمَتُّ فجاءني جبريل عليه السلام فقال يا محمد إنك إن لم تفعل ما أمرت به عذبك ربك\" قال علي رضي الله عنه فدعاني فقال يا علي \"إن الله تعالى قد أمرني أن أنذر عشيرتي الأقربين فعرفت أني إن بادرتهم بذلك رأيت منهم ما أكره فصمت عن ذلك ثم جاءني جبريل فقال يا محمد إن لم تفعل ما أمرت به عذبك ربك: فاصنع لنا يا عليُّ شاةً على صاعٍ من طعامٍ وأعد لنا عس لبن ثم اجمع لي بني عبد المطلب\" ففعلتُ فاجتمعوا إليه وهم يومئذ أربعون رجلا يزيدون رجلا أو ينقصون رجلا فيهم أعمامه أبو طالب وحمزة والعباس وأبو لهب الكافر الخبيث فقدمت إليهم تلك الجفنة فأخذ منها رسول الله صلى الله عليه وسلم جذبة فشقها بأسنانه ثم رمى بها في نواحيها وقال \"كلوا بسم الله\" فأكل القوم حتى نهلوا عنه ما يرى إلا آثار أصابعهم والله إن كان الرجل منهم ليأكل مثلها ثم قال رسول الله صلى الله عليه وسلم \"اسقهم يا علي\" فجئت بذلك القعب فشربوا منه حتى نهلوا جميعا وايم الله إن كان الرجل منهم ليشرب مثله فلما أراد رسول الله صلى الله عليه وسلم أن يكلمهم بدره أبو لهب إلى الكلام فقال: لهدَّ ما سحركم صاحبكم فتفرقوا ولم يكلمهم رسول الله صلى الله عليه وسلم فلما كان الغد قال رسول الله صلى الله عليه وسلم \"يا علي عد لنا بمثل الذي كنتَ صنعت بالأمس من الطعام والشراب فإن هذا الرجل قد بدرني إلى ما سمعت قبل أن أكلم القوم\" ففعلت ثم جمعتهم له فصنع رسول الله صلى الله عليه وسلم كما صنع بالأمس فأكلوا حتى نهلوا عنه وايم الله إن كان الرجل منهم ليأكل مثلها ثم قال رسول الله صلى الله عليه وسلم \"اسقهم يا علي\" فجئت بذلك القعب فشربوا منه حتى نهلوا جميعا وايم الله إن كان الرجل منهم ليشرب مثله فلما أراد رسول الله صلى الله عليه وسلم أن يكلمهم بدره أبو لهب بالكلام فقال; لهد ما سحركم صاحبكم: فتفرقوا ولم يكلمهم رسول الله صلى الله عليه وسلم فلما كان من الغد قال رسول الله صلى الله عليه وسلم \"يا علي عد لنا بمثل الذي كنت صنعت لنا بالأمس من الطعام والشراب فإن هذا الرجل قد بدرني إلى ما سمعت قبل أن أكلم القوم\" ففعلت ثم جمعتهم له فصنع رسول الله صلى الله عليه وسلم كم صنع بالأمس فأكلوا حتى نهلوا ثم سقيتهم من ذلك القعب حتى نهلوا عنه وايم الله إن كان الرجل منهم ليأكل مثلها ويشرب مثلها ثم قال رسول الله صلى الله عليه وسلم \"يا بني عبد المطلب إني والله ما أعلم شابا من العرب جاء قومه بأفضل مما جئتكم به إني قد جئتكم بخير الدنيا والآخرة قال أحمد بن عبد الجبار بلغني أن ابن إسحاق إنما سمعه من عبد الغفار ابن القاسم أبي مريم عن المنهال بن عمرو عن عبدالله بن الحارث. وقد رواه أبو جعفر بن جرير عن ابن حميد عن سلمة عن ابن إسحاق عن عبد الغفار بن القاسم أبي مريم عن المنهال ابن عمرو عن عبدالله بن الحارث عن ابن عباس عن علي بن أبي طالب فذكر مثله وزاد بعد قوله \"إني جئتكم بخير الدنيا والآخرة: وقد أمرني الله أن أدعوكم إليه فأيكم يؤازرني على هذا الأمر على أن يكون أخي وكذا وكذا\" ؟ قال فأحجم القوم عنها جميعا وقلت - وإني لأحدثهم سنا وأمرضهم عينا وأعظمهم بطنا وأخمشهم ساقا - أنا يا نبي الله أكون وزيرك عليه فأخذ برقبتي ثم قال \"إن هذا أخي وكذا وكذا فاسمعوا له وأطيعوا\" ثم قال القوم يضحكون ويقولون لأبي طالب قد أمرك أن تسمع لابنك وتطيع تفرد بهذا السياق عبد الغفار بن القاسم أبي مريم وهو متروك كذاب شيعي اتهمه علي بن المديني وغيره بوضع الحديث وضعفه الأئمة رحمهم الله \"طريق أخرى\" قال ابن أبي حاتم حدثنا أبي أخبرنا الحسين عن عيسى بن ميسرة الحارثي حدثنا عبدالله بن عبد القدوس عن الأعمش عن المنهال بن عمرو عن عبدالله بن الحارث قال: قال علي رضي الله عنه لما نزلت هذه الآية \"وأنذر عشيرتك الأقربين\" قال لي رسول الله صلى الله عليه وسلم \"اصنع لي رجل شاة بصاع من طعام وإناء لبنا\" قال ففعلت ثم قال لي \"ادع بني هاشم\" قال فدعوتهم وإنهم يومئذ أربعون غير رجل أو أربعون ورجل قال وفيهم عشرة كلهم يأكل الجذعة بإدامها قال فلما أتوا بالقصعة أخذ رسول الله صلى الله عليه وسلم من ذروتها ثم قال \"كلوا\" فأكلوا حتى شبعوا وهي على هيئتها لم يزدردوا منها إلا اليسير قال ثم أتيتهم بالإناء فشربوا حتى رووا قال وفضل فضل فلما فرغوا أراد رسول الله صلى الله عليه وسلم أن يتكلم فبدروه الكلام فقالوا ما رأينا كاليوم في السحر فسكت رسول الله صلى الله عليه وسلم ثم قال لي \"اصنع لى رجل شاة بصاع من طعام\" فصنعت قال فدعاهم فلما أكلوا وشربوا قال فبدروه فقالوا مثل مقالتهم الأولى فسكت رسول الله صلى الله عليه وسلم ثم قال لي \"اصنع لي رجل شاة بصاع من طعام\" فصنعت قال فجمعتهم فلما أكلوا وشربوا بدرهم رسول الله صلى الله عليه وسلم الكلام فقال \"أيكم يقضي عني ديني ويكون خليفتي في أهلي؟ \"قال فسكتوا وسكت العباس خشية أن يحيط ذلك بماله قال وسكت أنا لسن العباس ثم قالها مرة أخرى فسكت العباس فلما رأيت ذلك قلت أنا يا رسول الله قال وإني يومئذ لأسوأهم هيئة وإني لأعمش العينين ضخم البطن خمش الساقين فهذه طرق متعددة لهذا الحديث عن علي رضي الله عنه ومعنى سؤاله صلى الله عليه وسلم لأعمامه وأولادهم أن يقضوا عنه دينه ويخلفوه في أهله يعني إن قتل في سبيل الله كأنه خشي إذا قام بأعباء الإنذار أن يقتل فلما أنزل الله تعالى \"يا أيها الرسول بلغ ما أنزل إليك من ربك وإن لم تفعل فما بلغت رسالته والله يعصمك من الناس\" فعند ذلك أمن وكان أو لا يحرس حتى نزلت هذه الآية \"والله يعصمك من الناس\" ولم يكن أحد في بني هاشم إذ ذاك أشد إيمانا وإيقانا وتصديقا لرسول الله صلى الله عليه وسلم من علي رضي الله عنه ولهذا بدرهم إلى التزام ما طلب منهم رسول الله صلى الله عليه وسلم ثم كان بعد هذا والله أعلم دعاؤه الناس جهرة على الصفا وإنذاره لبطون قريش عموما وخصوصا حتى سمى من سمى من أعمامه وعماته وبناته لينبه بالأدنى على الأعلى أي إنما أنا نذير والله يهدي من يشاء إلى صراط مستقيم وقد روى الحافظ ابن عساكر في ترجمة عبد الواحد الدمشقي من طريق عمرو ابن سمرة عن محمد بن سوقة عن عبد الواحد الدمشقي قال: رأيت أبا الدرداء رضي الله عنه يحدث الناس ويفتيهم وولده إلى جنبه وأهل بيته جلوس في جانب المسجد يتحدثون فقيل له ما بال الناس يرغبون فيما عندك من العلم وأهل بيتك جلوس لاهين ؟ فقال لأني سمعت رسول الله صلى الله عليه وسلم يقول \"أزهد الناس في الدنيا الأنبياء وأشدهم عليهم الأقربون\" وذلك فيما أنزل الله عز وجل قال تعالى \"وأنذر عشيرتك الأقربين - إلى قوله - فقل إني بريء مما تعملون\"."
    },
    {
      "ayah": 216,
      "surah": 26,
      "text": "وقد وردت أحاديث كثيرة في نزول هذه الآية الكريمة فلنذكرها \"الحديث الأول\": قال الإمام أحمد رحمه الله حدثنا عبدالله بن نمير عن الأعمش عن عمرو بن مرة عن سعيد بن جبير عن ابن عباس رضي الله عنهما قال: لما أنزل الله عز وجل \"وأنذر عشيرتك الأقربين\" أتى النبي صلى الله عليه وسلم الصفا فصعد عليه ثم نادى \"يا صباحاه\" فاجتمع الناس إليه بين رجل يجيء إليه وبين رجل يبعث رسوله فقال رسول الله صلى الله عليه وسلم \"يا بني عبد المطلب ; يا بني فهر; يا بني لؤي أرأيتم لو أخبرتكم أن خيلا بسفح هذا الجبل تريد أن تغير عليكم صدقتموني؟\" قالوا نعم قال \"فإني نذير لكم بين يدي عذاب شديد\" فقال أبو لهب تبا لك سائر اليوم أما دعوتنا إلا لهذا ؟ وأنزل الله \"تبت يدا أبي لهب وتب\" ورواه البخاري ومسلم والترمذي والنسائي من طرق عن الأعمش به \"الحديث الثاني\": قال الإمام أحمد حدثنا وكيع حدثنا هشام عن أبيه عن عائشة قالت: لما نزلت \"وأنذر عشيرتك الأقربين\" قام رسول الله صلى الله عليه وسلم فقال \"يا فاطمة ابنة محمد يا صفية ابنة عبد المطلب يا بني عبد المطلب لا أملك لكم من الله شيئا سلوني من مالي ما شئتم\" انفرد بإخراجه مسلم \"الحديث الثالث\": قال الإمام أحمد: حدثنا معاوية بن عمرو حدثنا زائدة حدثنا عبد الملك بن عمير عن موسى بن طلحة عن أبي هريرة رضي الله عنه قال: لما نزلت هذه الآية \"وأنذر عشيرتك الأقربين\" دعا رسول الله صلى الله عليه وسلم قريشا فعم وخص فقال \"يا معشر قريش أنقذوا أنفسكم من النار; يا معشر بني كعب أنقذوا أنفسكم من النار; يا معشر بني هاشم أنقذوا أنفسكم من النار; يا معشر بني عبد المطلب أنقذوا أنفسكم من النار; يا فاطمة بنت محمد أنقذي نفسك من النار; فإني والله لا أملك لكم من الله شيئا إلا أن لكم رحما سأبلها ببلالها\" ورواه مسلم والترمذي من حديث عبد الملك بن عمير به وقال الترمذي غريب من هذا الوجه; ورواه النسائي من حديث موسى بن طلحة مرسلا ولم يذكر فيه أبا هريرة; والموصول هو الصحيح ; وأخرجاه في الصحيحين من حديث الزهري عن سعيد بن المسيب وأبي سلمة بن عبد الرحمن عن أبي هريرة; وقال الإمام أحمد حدثنا يزيد حدثنا محمد يعني ابن إسحاق عن أبي الزناد عن الأعرج عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم \"يا بني عبد المطلب اشتروا أنفسكم من الله; يا صفية عمة رسول الله ويا فاطمة بنت رسول الله اشتريا أنفسكما من الله فإني لا أغني عنكما من الله شيئا سلاني من مالي ما شئتما\" تفرد به من هذا الوجه وتفرد به أيضا عن معاوية عن زائدة عن أبي الزناد عن الأعرج عن أبي هريرة عن النبي صلى الله عليه وسلم بنحوه ورواه أيضا عن حسن ثنا ابن لهيعة عن الأعرج عن أبي هريرة مرفوعا وقال أبو يعلى حدثنا سويد بن سعيد حدثنا همام بن إسماعيل عن موسى ابن وردان عن أبي هريرة عن النبي صلى الله عليه وسلم \"يا بني قصي يا بني هاشم يا بني عبد مناف أنا النذير والموت المغير والساعة الموعد\" \"الحديث الرابع\": قال الإمام أحمد حدثنا يحيى بن سعيد ثنا التيمي عن أبي عثمان عن قبيصة بن مخارق وزهير بن عمرو قالا: لما نزلت \"وأنذر عشيرتك الأقربين\" صعد رسول الله صلى الله عليه وسلم رضمة من جبل على أعلاها حجر فجعل ينادي \"يا بني عبد مناف إنما أنا نذير إنما مثلي ومثلكم كرجل رأى العدو فذهب يربأ أهله رجاء أن يسبقوه فجعل ينادي ويهتف يا صباحاه\" ورواه مسلم والنسائي من حديث سليمان بن طرخان التيمي عن أبي عثمان عبد الرحمن ابن سهل النهدي عن قبيصة وزهير بن عمرو الهلالي به \"الحديث الخامس\": قال الإمام أحمد حدثنا أسود بن عامر حدثنا شريك عن الأعمش عن المنهال عن عباد بن عبدالله الأسدي عن علي رضي الله عنه قال: لما نزلت هذه الآية \"وأنذر عشيرتك الأقربين\" جمع النبي صلى الله عليه وسلم من أهل بيته فاجتمع ثلاثون فأكلوا وشربوا قال: وقال لهم \"من يضمن عني ديني ومواعيدي ويكون معي في الجنة ويكون خليفتي في أهلي؟\" فقال رجل لم يسمه شريك يا رسول الله أنت كنت بحري من يقوم بهذا قال ثم قال الآخر- ثلاثا - قال فعرض ذلك على أهل بيته فقال علي أنا \"طريق أخرى بأبسط من هذا السياق\" قال الإمام أحمد حدثنا عفان حدثنا أبو عوانة حدثنا عثمان بن المغيرة عن أبي صادق عن ربيعة بن ماجد عن علي رضي الله عنه قال: جمع رسول الله صلى الله عليه وسلم أو دعا رسول الله صلى الله عليه وسلم - بني عبد المطلب وهم رهط وكلهم يأكل الجذعة ويشرب الفرق فصنع لهم مدا من طعام فأكلوا حتى شبعوا وبقي الطعام كما هو كأنه لم يمس ثم دعا بِعَسٍ فشربوا حتى رووا وبقي الشراب كأنه لم يمس أو لم يشرب وقال \"يا بني عبد المطلب إني بعثت إليكم خاصة وإلى الناس عامة فقد رأيتم من هذه الآية ما رأيتم فأيكم يبايعني على أن يكون أخي وصاحبي\" قال فلم يقم إليه أحد قال فقمت إليه وكنت أصغر القوم قال: فقال \"اجلس\" ثم قال ثلاث مرات كل ذلك أقوم إليه فيقول لي \"اجلس\" حتى كان في الثالثة ضرب بيده على يدي \"طريق أخرى أغرب وأبسط من هذا السياق بزيادات أخر\" قال الحافظ أبو بكر البيهقي في دلائل النبوة أخبرنا محمد بن عبدالله الحافظ أخبرنا أبو العباس محمد بن يعقوب حدثنا أحمد بن عبد الجبار حدثنا يونس بن بكير عن محمد بن إسحاق قال: حدثني من سمع عبدالله بن الحارث بن نوفل واستكتمني اسمه عن ابن عباس عن علي بن أبي طالب رضي الله عنه قال: لما نزلت هذه الآية على رسول الله \"وأنذر عشيرتك الأقربين واخفض جناحك لمن اتبعك من المؤمنين\" قال رسول الله صلى الله عليه وسلم \"عرفت أني إن بادرت بها قومي رأيت منهم ما أكره فَصَمَتُّ فجاءني جبريل عليه السلام فقال يا محمد إنك إن لم تفعل ما أمرت به عذبك ربك\" قال علي رضي الله عنه فدعاني فقال يا علي \"إن الله تعالى قد أمرني أن أنذر عشيرتي الأقربين فعرفت أني إن بادرتهم بذلك رأيت منهم ما أكره فصمت عن ذلك ثم جاءني جبريل فقال يا محمد إن لم تفعل ما أمرت به عذبك ربك: فاصنع لنا يا عليُّ شاةً على صاعٍ من طعامٍ وأعد لنا عس لبن ثم اجمع لي بني عبد المطلب\" ففعلتُ فاجتمعوا إليه وهم يومئذ أربعون رجلا يزيدون رجلا أو ينقصون رجلا فيهم أعمامه أبو طالب وحمزة والعباس وأبو لهب الكافر الخبيث فقدمت إليهم تلك الجفنة فأخذ منها رسول الله صلى الله عليه وسلم جذبة فشقها بأسنانه ثم رمى بها في نواحيها وقال \"كلوا بسم الله\" فأكل القوم حتى نهلوا عنه ما يرى إلا آثار أصابعهم والله إن كان الرجل منهم ليأكل مثلها ثم قال رسول الله صلى الله عليه وسلم \"اسقهم يا علي\" فجئت بذلك القعب فشربوا منه حتى نهلوا جميعا وايم الله إن كان الرجل منهم ليشرب مثله فلما أراد رسول الله صلى الله عليه وسلم أن يكلمهم بدره أبو لهب إلى الكلام فقال: لهدَّ ما سحركم صاحبكم فتفرقوا ولم يكلمهم رسول الله صلى الله عليه وسلم فلما كان الغد قال رسول الله صلى الله عليه وسلم \"يا علي عد لنا بمثل الذي كنتَ صنعت بالأمس من الطعام والشراب فإن هذا الرجل قد بدرني إلى ما سمعت قبل أن أكلم القوم\" ففعلت ثم جمعتهم له فصنع رسول الله صلى الله عليه وسلم كما صنع بالأمس فأكلوا حتى نهلوا عنه وايم الله إن كان الرجل منهم ليأكل مثلها ثم قال رسول الله صلى الله عليه وسلم \"اسقهم يا علي\" فجئت بذلك القعب فشربوا منه حتى نهلوا جميعا وايم الله إن كان الرجل منهم ليشرب مثله فلما أراد رسول الله صلى الله عليه وسلم أن يكلمهم بدره أبو لهب بالكلام فقال; لهد ما سحركم صاحبكم: فتفرقوا ولم يكلمهم رسول الله صلى الله عليه وسلم فلما كان من الغد قال رسول الله صلى الله عليه وسلم \"يا علي عد لنا بمثل الذي كنت صنعت لنا بالأمس من الطعام والشراب فإن هذا الرجل قد بدرني إلى ما سمعت قبل أن أكلم القوم\" ففعلت ثم جمعتهم له فصنع رسول الله صلى الله عليه وسلم كم صنع بالأمس فأكلوا حتى نهلوا ثم سقيتهم من ذلك القعب حتى نهلوا عنه وايم الله إن كان الرجل منهم ليأكل مثلها ويشرب مثلها ثم قال رسول الله صلى الله عليه وسلم \"يا بني عبد المطلب إني والله ما أعلم شابا من العرب جاء قومه بأفضل مما جئتكم به إني قد جئتكم بخير الدنيا والآخرة قال أحمد بن عبد الجبار بلغني أن ابن إسحاق إنما سمعه من عبد الغفار ابن القاسم أبي مريم عن المنهال بن عمرو عن عبدالله بن الحارث. وقد رواه أبو جعفر بن جرير عن ابن حميد عن سلمة عن ابن إسحاق عن عبد الغفار بن القاسم أبي مريم عن المنهال ابن عمرو عن عبدالله بن الحارث عن ابن عباس عن علي بن أبي طالب فذكر مثله وزاد بعد قوله \"إني جئتكم بخير الدنيا والآخرة: وقد أمرني الله أن أدعوكم إليه فأيكم يؤازرني على هذا الأمر على أن يكون أخي وكذا وكذا\" ؟ قال فأحجم القوم عنها جميعا وقلت - وإني لأحدثهم سنا وأمرضهم عينا وأعظمهم بطنا وأخمشهم ساقا - أنا يا نبي الله أكون وزيرك عليه فأخذ برقبتي ثم قال \"إن هذا أخي وكذا وكذا فاسمعوا له وأطيعوا\" ثم قال القوم يضحكون ويقولون لأبي طالب قد أمرك أن تسمع لابنك وتطيع تفرد بهذا السياق عبد الغفار بن القاسم أبي مريم وهو متروك كذاب شيعي اتهمه علي بن المديني وغيره بوضع الحديث وضعفه الأئمة رحمهم الله \"طريق أخرى\" قال ابن أبي حاتم حدثنا أبي أخبرنا الحسين عن عيسى بن ميسرة الحارثي حدثنا عبدالله بن عبد القدوس عن الأعمش عن المنهال بن عمرو عن عبدالله بن الحارث قال: قال علي رضي الله عنه لما نزلت هذه الآية \"وأنذر عشيرتك الأقربين\" قال لي رسول الله صلى الله عليه وسلم \"اصنع لي رجل شاة بصاع من طعام وإناء لبنا\" قال ففعلت ثم قال لي \"ادع بني هاشم\" قال فدعوتهم وإنهم يومئذ أربعون غير رجل أو أربعون ورجل قال وفيهم عشرة كلهم يأكل الجذعة بإدامها قال فلما أتوا بالقصعة أخذ رسول الله صلى الله عليه وسلم من ذروتها ثم قال \"كلوا\" فأكلوا حتى شبعوا وهي على هيئتها لم يزدردوا منها إلا اليسير قال ثم أتيتهم بالإناء فشربوا حتى رووا قال وفضل فضل فلما فرغوا أراد رسول الله صلى الله عليه وسلم أن يتكلم فبدروه الكلام فقالوا ما رأينا كاليوم في السحر فسكت رسول الله صلى الله عليه وسلم ثم قال لي \"اصنع لى رجل شاة بصاع من طعام\" فصنعت قال فدعاهم فلما أكلوا وشربوا قال فبدروه فقالوا مثل مقالتهم الأولى فسكت رسول الله صلى الله عليه وسلم ثم قال لي \"اصنع لي رجل شاة بصاع من طعام\" فصنعت قال فجمعتهم فلما أكلوا وشربوا بدرهم رسول الله صلى الله عليه وسلم الكلام فقال \"أيكم يقضي عني ديني ويكون خليفتي في أهلي؟ \"قال فسكتوا وسكت العباس خشية أن يحيط ذلك بماله قال وسكت أنا لسن العباس ثم قالها مرة أخرى فسكت العباس فلما رأيت ذلك قلت أنا يا رسول الله قال وإني يومئذ لأسوأهم هيئة وإني لأعمش العينين ضخم البطن خمش الساقين فهذه طرق متعددة لهذا الحديث عن علي رضي الله عنه ومعنى سؤاله صلى الله عليه وسلم لأعمامه وأولادهم أن يقضوا عنه دينه ويخلفوه في أهله يعني إن قتل في سبيل الله كأنه خشي إذا قام بأعباء الإنذار أن يقتل فلما أنزل الله تعالى \"يا أيها الرسول بلغ ما أنزل إليك من ربك وإن لم تفعل فما بلغت رسالته والله يعصمك من الناس\" فعند ذلك أمن وكان أو لا يحرس حتى نزلت هذه الآية \"والله يعصمك من الناس\" ولم يكن أحد في بني هاشم إذ ذاك أشد إيمانا وإيقانا وتصديقا لرسول الله صلى الله عليه وسلم من علي رضي الله عنه ولهذا بدرهم إلى التزام ما طلب منهم رسول الله صلى الله عليه وسلم ثم كان بعد هذا والله أعلم دعاؤه الناس جهرة على الصفا وإنذاره لبطون قريش عموما وخصوصا حتى سمى من سمى من أعمامه وعماته وبناته لينبه بالأدنى على الأعلى أي إنما أنا نذير والله يهدي من يشاء إلى صراط مستقيم وقد روى الحافظ ابن عساكر في ترجمة عبد الواحد الدمشقي من طريق عمرو ابن سمرة عن محمد بن سوقة عن عبد الواحد الدمشقي قال: رأيت أبا الدرداء رضي الله عنه يحدث الناس ويفتيهم وولده إلى جنبه وأهل بيته جلوس في جانب المسجد يتحدثون فقيل له ما بال الناس يرغبون فيما عندك من العلم وأهل بيتك جلوس لاهين ؟ فقال لأني سمعت رسول الله صلى الله عليه وسلم يقول \"أزهد الناس في الدنيا الأنبياء وأشدهم عليهم الأقربون\" وذلك فيما أنزل الله عز وجل قال تعالى \"وأنذر عشيرتك الأقربين - إلى قوله - فقل إني بريء مما تعملون\"."
    },
    {
      "ayah": 217,
      "surah": 26,
      "text": "وقوله تعالى \"وتوكل على العزيز الرحيم\" أي في جميع أمورك فإنه مؤيدك وحافظك وناصرك ومظفرك ومعلي كلمتك."
    },
    {
      "ayah": 218,
      "surah": 26,
      "text": "وقوله تعالى \"الذي يراك حين تقوم\" أي هو معتن بك كما قال تعالى \"فاصبر لحكم ربك فإنك بأعيننا\" قال ابن عباس \"الذي يراك حين تقوم\" يعني إلى الصلاة وقال عكرمة يرى قيامه وركوعه وسجوده وقال الحسن \"الذي يراك حين تقوم\" إذا صليت وحدك وقال الضحاك \"الذي يراك حين تقوم\" أي من فراشك أو مجلسك وقال قتادة \"الذي يراك\" قائما وجالسا وعلى حالاتك."
    },
    {
      "ayah": 219,
      "surah": 26,
      "text": "وقوله تعالى \"وتقلبك في الساجدين\" قال قتادة \"الذي يراك حين تقوم وتقلبك في الساجدين\" قال في الصلاة يراك وحدك ويراك في الجمع وهذا قول عكرمة وعطاء الخراساني والحسن البصري وقال مجاهد كان رسول الله صلى الله عليه وسلم يرى من خلفه كما يرى من أمامه ويشهد لهذا ما صح في الحديث \"سووا صفوفكم فإني أراكم من وراء ظهري\" وروى البزار وابن أبي حاتم من طريقين عن ابن عباس أنه قال في هذه الآية يعني تقلبه من صلب نبي إلى صلب نبي حتى أخرجه نبيا."
    },
    {
      "ayah": 22,
      "surah": 26,
      "text": "ثم قال موسى \"وتلك نعمة تمنها علي أن عبدت بني إسرائيل\" أي وما أحسنت إلي وربيتني مقابل ما أسأت إلى بني إسرائيل فجعلتهم عبيدا وخدما تصرفهم في أعمالك ومشاق رعيتك أفيفي إحسانك إلى رجل واحد منهم بما أسأت إلى مجموعهم أي ليس ما ذكرته شيئا بالنسبة إلى ما فعلت بهم."
    },
    {
      "ayah": 220,
      "surah": 26,
      "text": "وقوله تعالى \"إنه هو السميع العليم\" أي السميع لأقوال عباده العليم بحركاتهم وسكناتهم كما قال تعالى \"وما تكون في شأن وما تتلو منه من قرآن ولا تعملون من عمل إلا كنا عليكم شهودا إذ تفيضون فيه\" الآية."
    },
    {
      "ayah": 221,
      "surah": 26,
      "text": "يقول تعالى مخاطبا لمن زعم من المشركين أن ما جاء به الرسول صلى الله عليه وسلم ليس بحق وأنه شيء افتعله من تلقاء نفسه أو أنه أتاه به رئي من الجان فنزه الله سبحانه وتعالى جناب رسوله عن قولهم وافترائهم ونبه أن ما جاء به إنما هو من عند الله وأنه تنزيله ووحيه نزل به ملك كريم أمين عظيم وأنه ليس من قبل الشياطين فإنهم ليس لهم رغبة في مثل هذا القرآن العظيم وإنما ينزلون على من يشاكلهم ويشابههم من الكهان الكذبة ولهذا قال تعالى \"هل أنبئكم\" أي أخبركم."
    },
    {
      "ayah": 222,
      "surah": 26,
      "text": "\"على من تنزل الشياطين تنزل على كل أفاك أثيم\" أي كذوب في قوله وهو الأفاك \"أثيم\" وهو الفاجر في أفعاله فهذا هو الذي تنزل عليه الشياطين من الكهان وما جرى مجراهم من الكذبة الفسقة فإن الشياطين أيضا كذبة فسقة."
    },
    {
      "ayah": 223,
      "surah": 26,
      "text": "\"يلقون السمع\" أي يسترقون السمع من السماء فيسمعون الكلمة من علم الغيب فيزيدون معها مائة كذبة ثم يلقونها إلى أوليائهم من الإنس فيحدثون بها فيصدقهم الناس في كل ما قالوه بسبب صدقهم في تلك الكلمة التي سمعت من السماء كما صح بذلك الحديث كما رواه البخاري من حديث الزهري أخبرني يحيى بن عروة بن الزبير أنه سمع عروة بن الزبير يقول: قالت عائشة رضي الله عنها: سأل ناس النبي صلى الله عليه وسلم عن الكهان فقال \"إنهم ليسوا بشيء\" قالوا يا رسول الله فإنهم يحدثون بالشيء يكون حقا فقال النبي صلى الله عليه وسلم \"تلك الكلمة من الحق يخطفها الجني فيقرقرها في أذن وليه كقرقرة الدجاج فيخلطون معها أكثر من مائه كذبة\" وروى البخاري أيضا حدثنا الحميدي حدثنا سفيان حدثنا عمرو قال سمعت عكرمة سمعت أبا هريرة يقول: إن النبي صلى الله عليه وسلم قال \"إذا قضى الله الأمر في السماء ضربت الملائكة بأجنحتها خضعانا لقوله كأنها سلسلة على صفوان فإذا فزع عن قلوبهم قالوا ماذا قال ربكم ؟ قالوا الحق وهو العلي الكبير فيسمعها مسترقوا السمع ومسترقوا السمع هكذا بعضهم فوق بعض - وصفه سفيان بيده فحرفها وبدد بين أصابعه - فيسمع الكلمة فيلقيها إلى من تحته ثم يلقيها الآخر إلى من تحته حتى يلقيها على لسان الساحر أو الكاهن فربما أدركه الشهاب قبل أن يلقيها وربما ألقاها قبل أن يدركه فيكذب معها مائه كذبة فيقال أليس قد قال لنا يوم كذا وكذا: كذا وكذا ؟ فيصدى بتلك الكلمة التي سمعت من السماء\" تفرد به البخاري وروى مسلم من حديث الزهري عن علي بن الحسين عن ابن عباس عن رجال من الأنصار قريبا من هذا وسيأتي عند قوله تعالى في سبأ \"حتى إذا فزع عن قلوبهم\" الآية وقال البخاري وقال الليث حدثني خالد بن يزيد عن سعيد بن أبي هلال أن أبا الأسود أخبره عن عروة عن عائشة عن النبي صلى الله عليه وسلم أنه قال \"إن الملائكة تحدث في العنان - والعنان الغمام - بالأمر في الأرض فتسمع الشياطين الكلمة فتقرها في أذن الكاهن كما تقر القارورة فيزيدون معها مائة كذبة\" ورواه البخاري في موضع آخر من كتاب بدء الخلق عن سعيد بن أبي زيد عن الليث عن عبدالله بن أبي جعفر عن أبي الأسود محمد بن عبد الرحمن عن عروة عن عائشة بنحوه."
    },
    {
      "ayah": 224,
      "surah": 26,
      "text": "وقوله تعالى \"والشعراء يتبعهم الغاوون\" قال علي بن أبي طلحة عن ابن عباس يعني الكفار يتبعهم ضلال الإنس والجن وكذا قال مجاهد رحمه الله وعبد الرحمن بن زيد بن أسلم وغيرهما وقال عكرمة كان الشاعران يتهاجيان فينتصر لهذا فئام من الناس ولهذا فئام من الناس فأنزل الله تعالى \"والشعراء يتبعهم الغاوون\" وقال الإمام أحمد حدثنا قتيبة حدثنا ليث عن ابن الهاد عن يحنس مولى مصعب بن الزبير عن أبي سعيد قال: بينما نحن نسير مع رسول الله صلى الله عليه وسلم بالعرج إذ عرض شاعر ينشد فقال النبي صلى الله عليه وسلم \"خذوا الشيطان - أو- أمسكوا الشيطان لأن يمتلئ جوف أحدكم قيحا خير له من أن يمتلئ شعرا\"."
    },
    {
      "ayah": 225,
      "surah": 26,
      "text": "وقوله تعالى \"ألم تر أنهم في كل واد يهيمون\" قال علي بن أبي طلحة عن ابن عباس في كل لغو يخوضون وقال الضحاك عن ابن عباس في كل فن من الكلام وكذا قال مجاهد وغيره وقال الحسن البصري قد والله رأينا أوديتهم التي يخوضون فيها مرة في شتيمة فلان ومرة في مديحة فلان وقال قتادة: الشاعر يمدح قوما بباطل ويذم قوما بباطل."
    },
    {
      "ayah": 226,
      "surah": 26,
      "text": "وقوله تعالى \"وأنهم يقولون ما لا يفعلون\" قال العوفي عن ابن عباس كان رجلان على عهد رسول الله أحدهما من الأنصار والآخر من قوم آخرين وأنهما تهاجيا فكان مع كل واحد منهما غواة من قومه وهم السفهاء فقال الله تعالى \"والشعراء يتبعهم الغاوون ألم تر أنهم في كل واد يهيمون وأنهم يقولون ما لا يفعلون\" وقال علي بن أبي طلحة عن ابن عباس أكثر قولهم يكذبون فيه وهذا الذي قاله ابن عباس رضي الله عنه هو الواقع في نفس الأمر فإن الشعراء يتبجحون بأقوال وأفعال لم تصدر منهم ولا عنهم فيتكثرون بما ليس لهم ولهذا اختلف العلماء رحمهم الله فيما إذا اعترف الشاعر في شعره بما يوجب حدا هل يقام عليه بهذا الاعتراف أم لا لأنهم يقولون ما لا يفعلون؟ على قولين وقد ذكر محمد بن إسحاق ومحمد بن سعد في الطبقات والزبير بن بكار في كتاب الفكاهة أن أمير المؤمنين عمر بن الخطاب رضي الله عنه استعمل النعمان بن عدي بن نضلة علي ميسان من أرض البصرة وكان يقول الشعر فقال: ألا هل أتى الحسـناء أن خليلهـا بميسان يسقي في زجاج وحنتم إذا شئت غنتني دهـاقيــن قريـة ورقاصة تحنو علي كل مــبسم فإن كنت ندماني فبالأكبر اسقنـي ولا تسقني بالأصغر المتثلم لعل أمـير المؤمـنــين يـسـوءه تنادمنــا بالجوسق المتهدم فلما بلغ ذلك أمير المؤمنين عمر بن الخطاب رضي الله عنه قال أي والله إنه ليسوءني ذلك ومن لقيه فليخبره أني قد عزلته وكتب إليه عمر \"بسم الله الرحمن الرحيم \"حم تنزيل الكتاب من الله العزيز العليم غافر الذنب وقابل التوب شديد العقاب ذي الطول لا إله إلا هو إليه المصير\" أما بعد فقد بلغني قولك: لعل أمير المؤمنين يسوءه تنادمنا بالجوسق المتهدم وايم الله إنه ليسوءني وقد عزلتك فلما قدم على عمر بكته بهذا الشعر فقال والله يا أمير المؤمنين ما شربتها قط وما ذاك الشعر إلا شيء طفح على لساني فقال عمر أظن ذلك ولكن والله لا تعمل لي عملا أبدا وقد قلت ما قلت فلم يذكر أنه حده على الشراب وقد ضمنه شعره لأنهم يقولون ما لا يفعلون ولكن ذمه عمر رضي الله عنه ولامه على ذلك وعزله به ولهذا جاء في الحديث \"لأن يمتلئ جوف أحدكم قيحا يريه خير له من أن يمتلئ شعرا\" والمراد من هذا أن الرسول صلى الله عليه وسلم الذي أنزل عليه هذه القرآن ليس بكاهن ولا بشاعر لأن حاله مناف لحالهم من وجوه ظاهرة كما قال تعالى \"وما علمناه الشعر وما ينبغي له إن هو إلا ذكر وقرآن مبين\" وقال تعالى \"إنه لقول رسول كريم وما هو بقول شاعر قليلا ما تؤمنون\" ولا بقول كاهن قليلا ما تذكرون تنزيل من رب العالمين\" وهكذا قال ههنا \"وإنه لتنزيل رب العالمين نزل به الروح الأمين على قلبك لتكون من المنذرين بلسان عربي مبين\" - إلى أن قال - \"وما تنزلت به الشياطين وما ينبغي لهم وما يستطيعون إنهم عن السمع لمعزولون\"- إلى أن قال - \"هل أنبئكم على من تنزل الشياطين تنزل على كل أفاك أثيم يلقون السمع وأكثرهم كاذبون والشعراء يتبعهم الغاوون ألم تر أنهم في كل واد يهيمون وأنهم يقولون مالا يفعلون\" وقوله \"إلا الذين آمنوا وعملوا الصالحات\" قال محمد بن إسحاق عن يزيد بن عبدالله بن قسيط عن أبي الحسن سالم البراد بن عبدالله مولى تميم الداري قال: لما نزلت \"والشعراء يتبعهم الغاوون\" جاء حسان بن ثابت وعبد الله بن رواحة وكعب بن مالك إلى رسول الله صلى الله عليه وسلم وهم يبكون قالوا: قد علم الله حين أنزل هذه الآية أنا شعراء فتلا النبي صلى الله عليه وسلم."
    },
    {
      "ayah": 227,
      "surah": 26,
      "text": "\"إلا الذين آمنوا وعملوا الصالحات\" قال \"أنتم\" \"وذكروا الله كثيرا\" قال \"أنتم\" \"وانتصروا من بعد ما ظلموا\" قال \"أنتم\" رواه ابن أبي حاتم وابن جرير من رواية ابن إسحاق وقد روى ابن أبي حاتم أيضا عن أبي سعيد الأشج عن أبي أسامة عن الوليد بن أبي كثير عن زيد بن عبدالله عن أبي الحسن مولى بني نوفل أن حسان بن ثابت وعبدالله بن رواحة أتيا رسول الله صلى الله عليه وسلم حين أنزلت هذه الآية \"والشعراء يتبعهم الغاوون\" يبكيان فقال رسول الله صلى الله عليه وسلم وهو يقرؤها عليهما \"والشعراء يتبعهم الغاوون -حتى بلغ - إلا الذين آمنوا وعملوا الصالحات\" قال \"أنتم\" وقال أيضا حدثنا أبي حدثنا أبو مسلم حدثنا حماد بن سلمة عن هشام بن عروة عن عروة قال: لما نزلت \"والشعراء يتبعهم الغاوون\" إلى قوله \"وأنهم يقولون ما لا يفعلون\" قال عبدالله بن رواحة يا رسول الله قد علم الله أني منهم فأنزل الله تعالى \"إلا الذين آمنوا وعملوا الصالحات\" الآية وهكذا قال ابن عباس وعكرمة ومجاهد وقتادة وزيد بن أسلم وغير واحد أن هذا استثناء مما تقدم. ولا شك أنه استثناء ولكن هذه السورة مكية فكيف يكون سبب نزول هذه الآيات شعراء الأنصار؟ وفي ذلك نظر ولم يتقدم إلا مرسلات لا يعتمد عليها والله أعلم ولكن هذا الاستثناء يدخل فيه شعراء الأنصار وغيرهم حتى يدخل فيه من كان متلبسا من شعراء الجاهلية بذم الإسلام وأهله ثم تاب وأناب ورجع وأقلع وعمل صالحا وذكر الله كثيرا في مقابلة ما تقدم من الكلام السيئ فإن الحسنات يذهبن السيئات وامتدح الإسلام وأهله مقابله ما كان يذمه كما قال عبدالله بن الزبعري حين أسلم: يا رسول المليك إن لســــــاني راتق ما فتقت إذ أنا بور إذ أباري الشيطان في سنن الغــ ـــي ومن مال ميله مثبور وكذلك أبو سفيان بن الحارث بن عبد المطلب كان من أشد الناس عداوة للنبي صلى الله عليه وسلم وهو ابن عمه وأكثرهم له هجوا فلما أسلم لم يكن أحد أحب إليه من رسول الله صلى الله عليه وسلم وكان يمدح رسول الله صلى الله عليه وسلم بعدما كان يهجوه ويتولاه بعد ما كان قد عاداه وهكذا روى مسلم في صحيحه عن ابن عباس أن أبا سفيان صخر بن حرب لما أسلم قال يا رسول الله ثلاث أعطنيهن قال \"نعم\" قال: معاوية تجعله كاتبا بين يديك قال \"نعم\" قال وتؤمرني حتى أقاتل الكفار كما كنت أقاتل المسلمين قال \"نعم\" وذكر الثالثة ولهذا قال تعالى: \"إلا الذين آمنوا وعملوا الصالحات وذكروا الله كثيرا\" قيل معناه ذكروا الله كثيرا في كلامهم وقيل في شعرهم وكلاهما صحيح مكفر لما سبق وقوله تعالى: \"وانتصروا من بعد ما ظلموا\" قال ابن عباس يردون على الكفار الذين كانوا يهجون به المؤمنين وكذا قال مجاهد وقتادة وغير واحد وهذا كما ثبت في الصحيح أن رسول الله صلى الله عليه وسلم قال لحسان \"اهجهم - أو قال - هاجهم وجبريل معك\" وقال الإمام أحمد حدثنا عبد الرزاق حدثنا معمر عن الزهري عن عبد الرحمن بن كعب بن مالك عن أبيه أنه قال للنبي صلى الله عليه وسلم إن الله عز وجل قد أنزل في الشعراء ما أنزل فقال رسول الله صلى الله عليه وسلم \"إن المؤمن يجاهد بسيفه ولسانه والذي نفسي بيده لكأن ما ترمونهم به نضح النبل\" وقوله تعالى: \"وسيعلم الذين ظلموا أي منقلب ينقلبون\" كقوله تعالى: \"يوم لا ينفع الظالمين معذرتهم\" الآية وفي الصحيح أن رسول الله صلى الله عليه وسلم قال: \"إياكم والظلم فإن الظلم ظلمات يوم القيامة\" قال قتادة بن دعامة في قوله تعالى: \"وسيعلم الذين ظلموا أي منقلب ينقلبون\" يعني من الشعراء وغيرهم وقال أبو داود الطيالسي حدثنا إياس بن أبي تميمة قال حضرت الحسن ومر عليه بجنازة نصراني فقال: \"وسيعلم الذين ظلموا أي منقلب ينقلبون\" قال عبدالله بن أبي رباح عن صفوان بن محرز أنه كان إذا قرأ هذه الآية بكى حتى أقول قد اندق قضيب زوره \"وسيعلم الذين ظلموا أي منقلب ينقلبون\" وقال ابن وهب أخبرنا شريح الإسكندراني عن بعض المشيخة أنهم كانوا بأرض الروم فبينما هم ليلة على نار يشتوون عليها أو يصطلون إذا بركبان قد أقبلوا فقاموا إليهم فإذا فضالة بن عبيد فيهم فأنزلوه فجلس معهم- قال- وصاحب لنا قائم يصلي حتى مر بهذه الآية \"وسيعلم الذين ظلموا أي منقلب ينقلبون\" قال فضالة ابن عبيد هؤلاء الذين يخربون البيت. وقيل المراد بهم أهل مكة وقيل الذين ظلموا من المشركين. والصحيح أن هذه الآية عامة في كل ظالم كما قال ابن أبي حاتم: ذكر عن يحيى بن زكريا بن يحيى الواسطي حدثني الهيثم بن محفوط أبو سعد النهدي حدثنا محمد بن عبد الرحمن بن المحبر حدثنا هشام بن عروة عن أبيه عن عائشة رضي الله عنها قالت: كتب أبي في وصيته سطرين: بسم الله الرحمن الرحيم هذا ما أوصى به أبو بكر بن أبي قحافة عند خروجه من الدنيا حين يؤمن الكافر وينتهي الفاجر ويصدق الكاذب إني استخلفت عليكم عمر بن الخطاب فإن يعدل فذاك ظني به ورجائي فيه وإن يجر ويبدل فلا أعلم الغيب \"وسيعلم الذين ظلموا أي منقلب ينقلبون\". آخر تفسير سورة الشعراء والحمد لله رب العالمين."
    },
    {
      "ayah": 23,
      "surah": 26,
      "text": "يقول تعالى مخبرا عن كفر فرعون وتمرده وطغيانه وجحوده في قوله \"وما رب العالمين\" وذلك أنه كان يقول لقومه \"ما علمت لكم من إله غيري\" \"فاستخف قومه فأطاعوه\" وكانوا يجحدون الصانع جل وعلا ويعتقدون أنه لا رب لهم سوى فرعون فلما قال له موسى إني رسول رب العالمين قال له فرعون ومن هذا الذي تزعم أنه رب العالمين غيري؟ هكذا فسره علماء السلف وأئمة الخلف حتى قال السدي هذه الآية كقوله تعالى \"قال فمن ربكما يا موسى قال ربنا الذي أعطى كل شيء خلقه ثم هدى\" ومن زعم من أهل المنطق وغيرهم أن هذا سؤال عن الماهية فقد غلط فإنه لم يكن مقرا بالصانع حتى يسأل عن الماهية بل كان جاحدا له بالكلية فيما يظهر وإن كانت الحجج والبراهين قد قامت عليه فعند ذلك قال موسى لما سأله عن رب العالمين."
    },
    {
      "ayah": 24,
      "surah": 26,
      "text": "\"قال رب السموات والأرض وما بينهما\" أي خالق جميع ذلك ومالكه والمتصرف فيه وإلهه لا شريك له هو الله الذي خلق الأشياء كلها العالم العلوي وما فيه من الكواكب الثوابت والسيارات النيرات والعالم السفلي وما فيه من بحار وقفار وجبال وأشجار وحيوانات ونبات وثمار وما بين ذلك من الهواء والطير وما يحتوي عليه الجو الجميع عبيد له خاضعون ذليلون \"إن كنتم موقنين\" أي إن كانت لكم قلوب موقنة وأبصار نافذة; فعند ذلك التفت فرعون إلى من حوله من ملئه ورؤساء دولته قائلا لهم على سبيل التهكم والاستهزاء والتكذيب لموسى."
    },
    { "ayah": 25, "surah": 26, "text": "فيما قاله \"ألا تستمعون\" أي ألا تعجبون من هذا في زعمه أن لكم إلها غيري؟." },
    {
      "ayah": 26,
      "surah": 26,
      "text": "فقال لهم موسى \"ربكم ورب آبائكم الأولين\" أي خالقكم وخالق آبائكم الأولين الذي كانوا قبل فرعون وزمانه."
    },
    {
      "ayah": 27,
      "surah": 26,
      "text": "\"قال\" أي فرعون لقومه \"إن رسولكم الذي أرسل إليكم لمجنون\" أي ليس له عقل في دعواه أن ثم ربا غيري \"قال\" أي موسى لأولئك الذين أوعز إليهم فرعون ما أوعز من الشبهة."
    },
    {
      "ayah": 28,
      "surah": 26,
      "text": "فأجاب موسى بقوله \"رب المشرق والمغرب وما بينهما إن كنتم تعقلون\" أي هو الذي جعل المشرق مشرقا تطلع منه الكواكب والمغرب مغربا تغرب فيه الكواكب ثوابتها وسياراتها مع هذا النظام الذي سخرها فيه وقدرها فإن كان هذا الذي يزعم أنه ربكم وإلهكم صادقا فليعكس الأمر وليجعل المشرق مغربا والمغرب مشرقا كما قال تعالى عن \"الذي حاج إبراهيم في ربه أن آتاه الله الملك إذ قال إبراهيم ربي الذي يحيي ويميت قال أنا أحيي وأميت قال إبراهيم فإن الله يأتي بالشمس من المشرق فائت بها من المغرب\" الآية ولهذا لما غلب فرعون وانقطعت حجته عدل إلى استعمال جاهه وقوته وسلطانه واعتقد أن ذلك نافع له ونافذ في موسى عليه السلام فقال ما أخبر الله تعالى عنه."
    },
    {
      "ayah": 29,
      "surah": 26,
      "text": "لما قامت الحجة على فرعون بالبيان والعقل عدل إلى أن يقهر موسى بيده وسلطانه فظن أنه ليس وراء هذا المقام مقال فقال \"لئن اتخذت إلها غيري لأجعلنك من المسجونين\"."
    },
    {
      "ayah": 3,
      "surah": 26,
      "text": "وقوله تعالى \"لعلك باخع\" أي مهلك \"نفسك\" أي مما تحرص وتحزن عليهم \"أن لا يكونوا مؤمنين\" وهذه تسلية من الله لرسوله صلى الله عليه وسلم في عدم إيمان من لم يؤمن به من الكفار كما قال تعالى \"فلا تذهب نفسك عليهم حسرات\" كقوله \"فلعلك باخع نفسك على آثارهم\" الآية قال مجاهد وعكرمة وقتادة وعطية والضحاك والحسن وغيرهم \"لعلك باخع نفسك\" أي قاتل نفسك قال الشاعر: ألا أيهذا الباخع الحزن نفسه لشيء نحته عن يديه المقادر"
    },
    { "ayah": 30, "surah": 26, "text": "فعند ذلك قال موسى \"أولو جئتك بشيء مبين\" أي ببرهان قاطع واضح." },
    {
      "ayah": 31,
      "surah": 26,
      "text": "\"قال فائت به إن كنت من الصادقين فألقى عصاه فإذا هي ثعبان مبين\" أي ظاهر واضح في غاية الجلاء والوضوح والعظمة ذات قوائم وفم كبير وشكل هائل مزعج."
    },
    {
      "ayah": 32,
      "surah": 26,
      "text": "\"قال فائت به إن كنت من الصادقين فألقى عصاه فإذا هي ثعبان مبين\" أي ظاهر واضح في غاية الجلاء والوضوح والعظمة ذات قوائم وفم كبير وشكل هائل مزعج."
    },
    {
      "ayah": 33,
      "surah": 26,
      "text": "\"ونزع يده\" أي من جيبه \"فإذا هي بيضاء للناظرين\" أي تتلألأ كقطعة من القمر فبادر فرعون بشقاوته إلى التكذيب والعناد."
    },
    {
      "ayah": 34,
      "surah": 26,
      "text": "فقال للملإ حوله \"إن هذا لساحر عليم\" أي فاضل بارع في السحر فروج عليهم فرعون أن هذا من قبيل السحر لا من قبيل المعجزة ثم هيجهم وحرضهم على مخالفته والكفر به."
    },
    {
      "ayah": 35,
      "surah": 26,
      "text": "فقال \"يريد أن يخرجكم من أرضكم بسحره\" الآية أي أراد أن يذهب بقلوب الناس معه بسبب هذا فيكثر أعوانه وأنصاره وأتباعه ويغلبكم على دولتكم فيأخذ البلاد منكم فأشيروا علي فيه ماذا أصنع به؟."
    },
    {
      "ayah": 36,
      "surah": 26,
      "text": "\"قالوا أرجه وأخاه وابعث في المدائن حاشرين يأتوك بكل سحار عليم\" أي أخره وأخاه حتى تجمع له من مدائن مملكتك وأقاليم دولتك."
    },
    {
      "ayah": 37,
      "surah": 26,
      "text": "كل سحار عليم يقابلونه ويأتون بنظير ما جاء به فتغلبه أنت وتكون لك النصرة والتأييد فأجابهم إلى ذلك وكان هذا من تسخير الله تعالى لهم في ذلك ليجتمع الناس في صعيد واحد وتظهر آيات الله وحججه وبراهينه على الناس في النهار جهرة."
    },
    {
      "ayah": 38,
      "surah": 26,
      "text": "ذكر الله تعالى هذه المناظر الفعلية بين موسى عليه السلام والقبط في سورة الأعراف وفي سورة طه وفي هذه السورة: وذلك أن القبط أرادوا أن يطفئوا نور الله بأفواههم فأبى الله إلا أن يتم نوره ولو كره الكافرون وهذا شأن الكفر والإيمان ما تواجها وتقابلا إلا غلبه الإيمان \"بل نقذف بالحق على الباطل فيدمغه فإذا هو زاهق ولكم الويل مما تصفون\" \"وقل جاء الحق وزهق الباطل\" الآية."
    },
    {
      "ayah": 39,
      "surah": 26,
      "text": "ولهذا لما جاء السحرة وقد جمعوهم من أقاليم بلاد مصر وكانوا إذ ذاك أسحر الناس وأصنعهم وأشدهم تخييلا في ذلك وكان السحرة جمعا كثيرا وجما غفيرا قيل كانوا اثني عشر ألفا وقيل خمسة عشر ألفا وقيل سبعة عشر ألفا وقيل تسعة عشر ألفا وقيل بضعة وثلاثين ألفا وقيل ثمانين ألفا وقيل غير ذلك والله أعلم بعدتهم قال ابن إسحاق: وكان أمرهم راجعا إلى أربعة منهم وهم رؤساؤهم وهم: سابور وعاذور وحطحط ومصفى واجتهد الناس في الاجتماع ذلك اليوم."
    },
    {
      "ayah": 4,
      "surah": 26,
      "text": "ثم قال تعالى \"إن نشأ ننزل عليهم من السماء آية فظلت أعناقهم لها خاضعين\" أي لو نشاء لأنزلنا آية تضطرهم إلى الإيمان قهرا ولكن لا نفعل ذلك لأنا لا نريد من أحد إلا الإيمان الاختياري وقال تعالى \"ولو شاء ربك لآمن من في الأرض كلهم جميعا أفأنت تكره الناس حتى يكونوا مؤمنين\" وقال تعالى \"ولو شاء ربك لجعل الناس أمه واحدة\" الآية فنفذ قدره ومضت حكمته وقامت حجته البالغة على خلقه بإرسال الرسل إليهم وإنزال الكتب عليهم."
    },
    {
      "ayah": 40,
      "surah": 26,
      "text": "وقال قائلهم \"لعلنا نتبع السحرة إن كانوا هم الغالبين\" ولم يقولوا نتبع الحق سواء كان من السحرة أو من موسى بل الرعية على دين ملكهم."
    },
    {
      "ayah": 41,
      "surah": 26,
      "text": "\"فلما جاء السحرة\" أي إلى مجلس فرعون وقد ضربوا له وطاقا وجمع خدمه وحشمه ووزراءه ورؤساء دولته وجنود مملكته فقام السحرة بين يدي فرعون يطلبون منه الإحسان إليهم والتقرب إليه إن غلبوا أي هذا الذي جمعتنا من أجله."
    },
    {
      "ayah": 42,
      "surah": 26,
      "text": "فقالوا \"أإن لنا لأجرا إن كنا نحن الغالبين قال نعم وإنكم إذا لمن المقربين\" أي وأخص مما تطلبون أجعلكم من المقربين عندي وجلسائي."
    },
    {
      "ayah": 43,
      "surah": 26,
      "text": "فعادوا إلى مقام المناظرة \"قالوا يا موسى إما أن تلقي وإما أن نكون أول من ألقى قال بل ألقوا\" وقد اختصر هذا ههنا فقال لهم موسى."
    },
    {
      "ayah": 44,
      "surah": 26,
      "text": "\"ألقوا ما أنتم ملقون فألقوا حبالهم وعصيهم وقالوا بعزة فرعون إنا لنحن الغالبون\" وهذا كما تقول الجهلة من العوام إذا فعلوا شيئا هذا بثواب فلان وقد ذكر الله تعالى في سورة الأعراف أنهم سحروا أعين الناس واسترهبوهم وجاءوا بسحر عظيم وقال في سورة طه \"فإذا حبالهم وعصيهم يخيل إليه من سحرهم أنها تسعى - إلى قوله - ولا يفلح الساحر حيث أتى\"."
    },
    {
      "ayah": 45,
      "surah": 26,
      "text": "وقال ههنا \"فألقى موسى عصاه فإذا هي تلقف ما يأفكون\" أي تخطفه وتجمعه من كل بقعة وتبتلعه فلم تدع منه شيئا."
    },
    {
      "ayah": 46,
      "surah": 26,
      "text": "قال الله تعالى \"فوقع الحق وبطل ما كانوا يعملون\" - إلى قوله - \"رب موسى وهارون\" فكان هذا أمرا عظيما جدا وبرهانا قاطعا للعذر وحجة دامغة وذلك أن الذين استنصر بهم وطلب منهم أن يغلبوا غلبوا وخضعوا وآمنوا بموسى في الساعة الراهنة وسجدوا لله رب العالمين الذي أرسل موسى وهارون بالحق وبالمعجزة الباهرة فغلب فرعون غلبا لم يشاهد العالم مثله وكان وقحا جريئا عليه لعنة الله والملائكة والناس أجمعين فعدل إلى المكابرة والعناد ودعوى الباطل فشرع يتهددهم ويتوعدهم ويقول \"إنه لكبيركم الذي علمكم السحر\" وقال \"إن هذا لمكر مكرتموه في المدينة\" الآية."
    },
    {
      "ayah": 47,
      "surah": 26,
      "text": "قال الله تعالى \"فوقع الحق وبطل ما كانوا يعملون\" - إلى قوله - \"رب موسى وهارون\" فكان هذا أمرا عظيما جدا وبرهانا قاطعا للعذر وحجة دامغة وذلك أن الذين استنصر بهم وطلب منهم أن يغلبوا غلبوا وخضعوا وآمنوا بموسى في الساعة الراهنة وسجدوا لله رب العالمين الذي أرسل موسى وهارون بالحق وبالمعجزة الباهرة فغلب فرعون غلبا لم يشاهد العالم مثله وكان وقحا جريئا عليه لعنة الله والملائكة والناس أجمعين فعدل إلى المكابرة والعناد ودعوى الباطل فشرع يتهددهم ويتوعدهم ويقول \"إنه لكبيركم الذي علمكم السحر\" وقال \"إن هذا لمكر مكرتموه في المدينة\" الآية."
    },
    {
      "ayah": 48,
      "surah": 26,
      "text": "قال الله تعالى \"فوقع الحق وبطل ما كانوا يعملون\" - إلى قوله - \"رب موسى وهارون\" فكان هذا أمرا عظيما جدا وبرهانا قاطعا للعذر وحجة دامغة وذلك أن الذين استنصر بهم وطلب منهم أن يغلبوا غلبوا وخضعوا وآمنوا بموسى في الساعة الراهنة وسجدوا لله رب العالمين الذي أرسل موسى وهارون بالحق وبالمعجزة الباهرة فغلب فرعون غلبا لم يشاهد العالم مثله وكان وقحا جريئا عليه لعنة الله والملائكة والناس أجمعين فعدل إلى المكابرة والعناد ودعوى الباطل فشرع يتهددهم ويتوعدهم ويقول \"إنه لكبيركم الذي علمكم السحر\" وقال \"إن هذا لمكر مكرتموه في المدينة\" الآية."
    },
    {
      "ayah": 49,
      "surah": 26,
      "text": "تهددهم فلم ينفع ذلك فيهم وتوعدهم فما زادهم إلا إيمانا وتسليما وذلك أنه قد كشف عن قلوبهم حجاب الكفر وظهر لهم الحق بعلمهم ما جهل قومهم من أن هذا الذي جاء به موسى لا يصدر عن بشر إلا أن يكون الله قد أيده به وجعله له حجة ودلالة على صدق ما جاء به من ربه ولهذا لما قال لهم فرعون \"آمنتم له قبل أن آذن لكم\" أي كان ينبغي أن تستأذنوني فيما فعلتم ولا تفتاتوا علي في ذلك فإن أذنت لكم فعلتم وإن منعتكم امتنعتم فإني أنا الحاكم المطاع \"إنه لكبيركم الذي علمكم السحر\" وهذه مكابرة يعلم كل أحد بطلانها فإنهم لم يجتمعوا بموسى قبل ذلك اليوم فكيف يكون كبيرهم الذي أفادهم صناعة السحر؟ هذا لا يقوله عاقل ثم توعدهم فرعون بقطع الأيدي والأرجل والصلب."
    },
    {
      "ayah": 5,
      "surah": 26,
      "text": "ثم قال تعالى \"وما يأتيهم من ذكر من الرحمن محدث إلا كانوا عنه معرضين\" أي كلما جاءهم كتاب من السماء أعرض عنه أكثر الناس كما قال تعالى \"وما أكثر الناس ولو حرصت بمؤمنين\" وقال تعالى \"يا حسرة على العباد ما يأتيهم من رسول إلا كانوا به يستهزئون\" وقال تعالى \"ثم أرسلنا رسلنا تترى كلما جاء أمة رسولها كذبوه\" الآية."
    },
    {
      "ayah": 50,
      "surah": 26,
      "text": "فقالوا \"لا ضير\" أي لا حرج ولا يضرنا ذلك ولا نبالي به \"إنا إلى ربنا منقلبون\" أي المرجع إلى الله عز وجل وهو لا يضيع أجر من أحسن عملا ولا يخفى عليه ما فعلت بنا وسيجزينا على ذلك أتم الجزاء."
    },
    {
      "ayah": 51,
      "surah": 26,
      "text": "ولهذا قالوا \"إنا نطمع أن يغفر لنا ربنا خطايانا\" أي ما قارفناه من الذنوب وما أكرهتنا عليه من السحر \"أن كنا أول المؤمنين\" أي بسبب أنا بادرنا قومنا من القبط إلى الإيمان فقتلهم كلهم."
    },
    {
      "ayah": 52,
      "surah": 26,
      "text": "لما طال مقام موسى عليه السلام ببلاد مصر وأقام بها حجج الله وبراهينه على فرعون وملئه وهم مع ذلك يكابرون ويعاندون لم يبق لهم إلا العذاب والنكال فأمر الله تعالى موسى عليه السلام أن يخرج ببني إسرائيل ليلا من مصر وأن يمضي بهم حيث يؤمر ففعل موسى عليه السلام ما أمره ربه عز وجل خرج بهم بعدما استعاروا من قوم فرعون حليا كثيرا وكان خروجه بهم فيما ذكره غير واحد من المفسرين وقت طلوع القمر وذكر مجاهد رحمه الله أنه كسف القمر تلك الليلة فالله أعلم وأن موسى عليه السلام سأل عن قبر يوسف عليه السلام فدلته امرأة عجوز من بني إسرائيل عليه فاحتمل تابوته معهم ويقال إنه هو الذي حمله بنفسه عليهما السلام وكان يوسف عليه السلام قد أوصى بذلك إذا خرج بنو إسرائيل أن يحتملوه معهم وقد ورد في ذلك حديث رواه ابن أبي حاتم رحمه الله فقال: حدثنا علي بن الحسين حدثنا عبدالله بن عمر بن أبان بن صالح حدثنا ابن فضيل عن يونس بن أبي إسحاق عن ابن أبي بردة عن أبيه عن أبي موسى قال: نزل رسول الله صلى الله عليه وسلم بأعرابي فأكرمه فقال له رسول الله \"تعاهدنا\" فأتاه الأعرابي فقال له رسول الله صلى الله عليه وسلم \"ما حاجتك ؟\" قال ناقة برحلها وعنز يحتلبها أهلي فقال \"أعجزت أن تكون مثل عجوز بني إسرائيل ؟\" فقال له أصحابه وما عجوز بني إسرائيل يا رسول الله ؟ قال \"إن موسى عليه السلام لما أراد أن يسير ببني إسرائيل أضل الطريق فقال لبني إسرائيل ما هذا ؟ فقال له علماء بني إسرائيل نحن نحدثك أن يوسف عليه السلام لما حضرته الوفاة أخذ علينا موثقا من الله أن لا نخرج من مصر حتى ننقل تابوته معنا فقال لهم موسى فأيكم يدري أين قبر يوسف ؟ قالوا ما يعلمه إلا عجوز من بني إسرائيل فأرسل إليها فقال لها دليني على قبر يوسف فقالت والله لا أفعل حتى تعطيني حكمي فقال لها وما حكمك؟ قالت حكمي أن أكون معك في الجنة; فكأنه ثقل عليه ذلك فقيل له أعطها حكمها قال فانطلقت معهم إلى بحيرة- مستنقع ماء - فقالت لهم انضبوا هذا الماء فلما أنضبوه قالت احفروا فلما حفروا استخرجوا قبر يوسف فلما احتملوه إذا الطريق مثل ضوء النهار; وهذا حديث غريب جدا والأقرب أنه موقوف والله أعلم:."
    },
    {
      "ayah": 53,
      "surah": 26,
      "text": "فلما أصبحوا وليس في ناديهم داع ولا مجيب غاظ ذلك فرعون واشتد غضبه على بني إسرائيل لما يريد الله به من الدمار فأرسل سريعا في بلاده حاشرين أي من يحشر الجند ويجمعه كالنقباء والحجاب ونادى فيهم."
    },
    { "ayah": 54, "surah": 26, "text": "\"إن هؤلاء\" يعني بني إسرائيل \"لشرذمة قليلون\" أي لطائفة قليلة." },
    { "ayah": 55, "surah": 26, "text": "\"وإنهم لنا لغائظون\" أي كل وقت يصل منهم إلينا ما يغيظنا." },
    {
      "ayah": 56,
      "surah": 26,
      "text": "\"وإنا لجميع حاذرون\" أي نحن كل وقت نحذر من غائلتهم: وقرأ طائفة من السلف \"وإنا لجميع حاذرون\" أي مستعدون بالسلاح وإني أريد أن أستأصل شأفتهم وأبيد خضراءهم فجوزي في نفسه وجنده بما أراد لهم."
    },
    {
      "ayah": 57,
      "surah": 26,
      "text": "قال الله تعالى \"فأخرجناهم من جنات وعيون وكنوز ومقام كريم\" أي فخرجوا من هذا النعيم إلى الجحيم وتركوا تلك المنازل العالية والبساتين والأنهار والأموال والأرزاق والملك والجاه الوافر في الدنيا."
    },
    {
      "ayah": 58,
      "surah": 26,
      "text": "قال الله تعالى \"فأخرجناهم من جنات وعيون وكنوز ومقام كريم\" أي فخرجوا من هذا النعيم إلى الجحيم وتركوا تلك المنازل العالية والبساتين والأنهار والأموال والأرزاق والملك والجاه الوافر في الدنيا."
    },
    {
      "ayah": 59,
      "surah": 26,
      "text": "\"كذلك وأورثناها بني إسرائيل\" كما قال تعالى \"وأورثنا القوم الذين كانوا يستضعفون مشارق الأرض ومغاربها التي باركنا فيها\" الآية وقال تعالى \"ونريد أن نمن على الذين استضعفوا في الأرض ونجعلهم أئمة ونجعلهم الوارثين\" الآيتين."
    },
    {
      "ayah": 6,
      "surah": 26,
      "text": "ولهذا قال تعالى ههنا \"فقد كذبوا فسيأتيهم أنباء ما كانوا به يستهزئون\" أي فقد كذبوا بما جاءهم من الحق فسيعلمون نبأ هذا التكذيب بعد حين."
    },
    {
      "ayah": 60,
      "surah": 26,
      "text": "ذكر غير واحد من المفسرين أن فرعون خرج في محفل عظيم وجمع كبير هو عبارة عن مملكة الديار المصرية في زمانه أولي الحل والعقد والدول من الأمراء والوزراء والكبراء والرؤساء والجنود فأما ما ذكره غير واحد من الإسرائيليات من أنه خرج في ألف ألف وستمائة ألف فارس منها مائة ألف على خيل دهم ففيه نظر: وقال كعب الأحبار فيهم ثمانمائة ألف حصان أدهم وفي ذلك نظر والظاهر أن ذلك من مجازفات بني إسرائيل والله سبحانه وتعالى أعلم والذي أخبر به القرآن هو النافع ولم يعين عدتهم إذ لا فائدة تحته لأنهم خرجوا بأجمعهم \"فأتبعوهم مشرقين\" أي وصلوا إليهم عند شروق الشمس وهو طلوعها."
    },
    {
      "ayah": 61,
      "surah": 26,
      "text": "\"فلما تراءى الجمعان\" أي رأى كل من الفريقين صاحبه فعند ذلك \"قال أصحاب موسى إنا لمدركون\" وذلك أنهم انتهى بهم السير إلى سيف البحر وهو بحر القلزم فصار أمامهم البحر وقد أدركهم فرعون بجنوده."
    },
    {
      "ayah": 62,
      "surah": 26,
      "text": "لهذا قالوا \"إنا لمدركون قال كلا إن معي ربي سيهدين\" أي لا يصل إليكم شيء مما تحذرون فإن الله سبحانه هو الذي أمرني أن أسير ههنا بكم وهو سبحانه وتعالى لا يخلف الميعاد وكان هارون عليه السلام في المقدمة ومعه يوشع بن نون ومؤمن آل فرعون وموسى عليه السلام في الساقة وقد ذكر غير واحد من المفسرين أنهم وقفوا لا يدرون ما يصنعون وجعل يوشع بن نون أو مؤمن آل فرعون يقول لموسى عليه السلام يا نبي الله ههنا أمرك ربك أن تسير؟ فيقول نعم فاقترب فرعون وجنوده ولم يبق إلا القليل فعند ذلك أمر الله نبييه موسى عليه السلام أن يضرب بعصاه البحر فضربه وقال انفلق بإذن الله وروى ابن أبي حاتم حدثنا أبو زرعة حدثنا صفوان بن صالح حدثنا الوليد حدثنا محمد بن حمزة بن يوسف عن عبدالله بن سلام أن موسى عليه السلام لما انتهى إلى البحر قال: يا من كان قبل كل شيء والمكون لكل شيء والكائن بعد كل شيء اجعل لنا مخرجا."
    },
    {
      "ayah": 63,
      "surah": 26,
      "text": "فأوحى الله إليه \"أن اضرب بعصاك البحر\" وقال قتادة أوحى الله تلك الليلة إلى البحر أن إذا ضربك موسى بعصاه فاسمع له وأطع فبات البحر تلك الليلة وله اضطراب ولا يدري من أي جانب يضربه موسى فلما انتهى إليه موسى قال له فتاه يوشع بن نون يا نبي الله أين أمرك ربك عز وجل ؟ قال أمرني أن أضرب البحر قال فاضربه وقال محمد ابن إسحاق أوحى الله - فيما ذكر لي - إلى البحر أن إذا ضربك موسى بعصاه فانفلق له قال فبات البحر يضطرب ويضرب بعضه بعضا فرقا من الله تعالى وانتظارا لما أمره الله وأوحى الله إلى موسى \"أن اضرب بعصاك البحر\" فضربه بها ففيها سلطان الله الذي أعطاه فانفلق وذكر واحد أنه جاءه فكناه فقال: انفق علي أبا خالد بإذن الله قال الله تعالى \"فانفلق فكان كل فرق كالطود العظيم\" أي كالجبل الكبير قاله ابن مسعود وابن عباس ومحمد ابن كعب والضحاك وقتادة وغيرهم وقال عطاء الخراساني هو الفج بين الجبلين وقال ابن عباس صار البحر اثني عشر طريقا لكل سبط طريق وزاد السدي وصار فيه طاقات ينظر بعضهم إلى بعض وقام الماء على حيلة كالحيطان وبعث الله الريح إلى قعر البحر فلفحته فصار يبسا كوجه الأرض قال الله تعالى \"فاضرب لهم طريقا في البحر يبسا لا تخاف دركا ولا تخشى\"."
    },
    {
      "ayah": 64,
      "surah": 26,
      "text": "وقال في هذه القصة \"وأزلفنا ثم الآخرين\" أي هنالك قال ابن عباس وعطاء الخراساني وقتادة والسدي \"وأزلفنا\" أي قربنا من البحر فرعون وجنوده وأدنيناهم إليه."
    },
    {
      "ayah": 65,
      "surah": 26,
      "text": "\"وأنجينا موسى ومن معه أجمعين\" أي أنجينا موسى وبني إسرائيل ومن اتبعهم على دينهم فلم يهلك منهم أحد."
    },
    {
      "ayah": 66,
      "surah": 26,
      "text": "\"ثم أغرقنا الآخرين\" وأغرق فرعون وجنوده فلم يبق منهم رجل إلا هلك; وروى ابن أبي حاتم حدثنا علي بن الحسين حدثنا أبو بكر ابن أبي شيبة حدثنا شبابة حدثنا يونس بن أبي إسحاق عن أبي إسحاق عن عمرو بن ميمون عن عبدالله هو ابن مسعود أن موسى عليه السلام حين أسرى ببني إسرائيل بلغ فرعون ذلك فأمر بشاة فذبحت وقال لا والله لا يفرغ من سلخها حتى يجتمع إلي ستمائة ألف من القبط فانطلق موسى حتى انتهى إلى البحر فقال له انفرق: فقال له البحر قد استكبرت يا موسى وهل انفرقت لأحد من ولد آدم فأنفرق لك ؟ قال ومع موسى رجل على حصان له فقال له ذلك الرجل أين أمرت يا نبي الله؟ قال: ما أمرت إلا بهذا الوجه يعني البحر فأقحم فرسه فسبح به فخرج فقال أين أمرت يا نبي الله قال ما أمرت إلا بهذا الوجه قال والله ما كذب ولا كذبت ثم اقتحم الثانية سبح ثم خرج فقال أين أمرت يا نبي الله؟ قال ما أمرت إلا بهذا الوجه قال والله ما كذب ولا كذبت قال فأوحى الله إلى موسى أن اضرب بعصاك البحر فضربه موسى بعصاه فانفلق فكان فيه اثنا عشر سبطا لكل سبط طريق يتراءون فلما خرج أصحاب موسى وتتام أصحاب فرعون التقى البحر عليهم فأغرقهم وفي رواية إسرائيل عن أبي إسحاق عن عمرو ابن ميمون عن عبدالله قال: فلما خرج آخر أصحاب موسى وتكامل أصحاب فرعون انطم عليهم البحر فما رئي سواد أكثر من يومئذ وغرق فرعون لعنه الله:."
    },
    {
      "ayah": 67,
      "surah": 26,
      "text": "ثم قال تعالى \"إن في ذلك لآية\" أي في هذه القصة وما فيها من العجائب والنصر والتأييد لعباد الله المؤمنين لدلالة وحجة قاطعة وحكمة بالغة \"وما كان أكثرهم مؤمنين وإن ربك لهو العزيز الرحيم\" تقدم تفسيره."
    },
    {
      "ayah": 68,
      "surah": 26,
      "text": "ثم قال تعالى \"إن في ذلك لآية\" أي في هذه القصة وما فيها من العجائب والنصر والتأييد لعباد الله المؤمنين لدلالة وحجة قاطعة وحكمة بالغة \"وما كان أكثرهم مؤمنين وإن ربك لهو العزيز الرحيم\" تقدم تفسيره."
    },
    {
      "ayah": 69,
      "surah": 26,
      "text": "هذا إخبار من الله تعالى عن عبده ورسوله وخليله إبراهيم عليه السلام إمام الحنفاء أمر الله تعالى رسوله محمدا صلى الله عليه وسلم أن يتلوه على أمته ليقتدوا به في الإخلاص والتوكل وعبادة الله وحده لا شريك له والتبري من الشرك وأهله."
    },
    {
      "ayah": 7,
      "surah": 26,
      "text": "\"وسيعلم الذين ظلموا أي منقلب ينقلبون\" ثم نبه تعالى على عظمة سلطانه وجلالة قدره وشأنه الذي اجترءوا على مخالفة رسوله وتكذيب كتابه وهو القاهر العظيم القادر الذي خلق الأرض وأنبت فيها من كل زوج كريم من زروع وثمار وحيوان قال سفيان الثوري عن رجل عن الشعبي: الناس من نبات الأرض فمن دخل الجنة فهو كريم ومن دخل النار فهو لئيم."
    },
    {
      "ayah": 70,
      "surah": 26,
      "text": "فإن الله تعالى آتى إبراهيم رشده من قبل أي من صغره إلى كبره فإنه من وقت نشأ وشب أنكر على قومه عبادة الأصنام مع الله عز وجل فقال لأبيه وقومه ماذا تعبدون أي ما هذه التماثيل التي أنتم لها عاكفون ؟."
    },
    {
      "ayah": 71,
      "surah": 26,
      "text": "فإن الله تعالى آتى إبراهيم رشده من قبل أي من صغره إلى كبره فإنه من وقت نشأ وشب أنكر على قومه عبادة الأصنام مع الله عز وجل فقال لأبيه وقومه ماذا تعبدون أي ما هذه التماثيل التي أنتم لها عاكفون ؟."
    },
    {
      "ayah": 72,
      "surah": 26,
      "text": "\"قال هل يسمعونكم إذ تدعون أو ينفعونكم أو يضرون قالوا بل وجدنا آباءنا كذلك يفعلون\" يعني اعترفوا بأن أصنامهم لا تفعل شيئا من ذلك وإنما رأوا آباءهم كذلك يفعلون فهم على آثارهم يهرعون فعند ذلك قال لهم إبراهيم."
    },
    {
      "ayah": 73,
      "surah": 26,
      "text": "\"قال هل يسمعونكم إذ تدعون أو ينفعونكم أو يضرون قالوا بل وجدنا آباءنا كذلك يفعلون\" يعني اعترفوا بأن أصنامهم لا تفعل شيئا من ذلك وإنما رأوا آباءهم كذلك يفعلون فهم على آثارهم يهرعون فعند ذلك قال لهم إبراهيم."
    },
    {
      "ayah": 74,
      "surah": 26,
      "text": "\"قال هل يسمعونكم إذ تدعون أو ينفعونكم أو يضرون قالوا بل وجدنا آباءنا كذلك يفعلون\" يعني أعترفوا بأن أصنامهم لا تفعل شيئا من ذلك وإنما رأوا آباءهم كذلك يفعلون فهم على آثارهم يهرعون فعند ذلك قال لهم إبراهيم."
    },
    {
      "ayah": 75,
      "surah": 26,
      "text": "\"أفرأيتم ما كنتم تعبدون أنتم وآباؤكم الأقدمون فإنهم عدو لي إلا رب العالمين\" أي إن كانت هذه الأصنام شيئا ولها تأثير وتقدر فلتخلص إلي بالمساءة فإني عدو لها لا أبالي بها ولا أفكر فيها وهذا كما قال تعالى مخبرا عن نوح عليه السلام \"فأجمعوا أمركم وشركاءكم\" الآية وقال هود عليه السلام \"إني أشهد الله واشهدوا أني بريء مما تشركون من دونه فكيدوني جميعا ثم لا تنظرون إني توكلت على الله ربي وربكم ما من دابة إلا هو آخذ بناصيتها إن ربي على صراط مستقيم\" وهكذا تبرأ إبراهيم من آلهتهم فقال \"وكيف أخاف ما أشركتم ولا تخافون أنكم أشركتم بالله\" الآية وقال تعالى: \"قد كانت لكم أسوة حسنة في إبراهيم\" - إلى قوله - \"حتى تؤمنوا بالله وحده\" وقال تعالى: \"وإذ قال إبراهيم لأبيه وقومه إني براء مما تعبدون إلا الذي فطرني فإنه سيهدين وجعلها كلمة\" يعني لا إله إلا الله."
    },
    {
      "ayah": 76,
      "surah": 26,
      "text": "\"أفرأيتم ما كنتم تعبدون أنتم وآباؤكم الأقدمون فإنهم عدو لي إلا رب العالمين\" أي إن كانت هذه الأصنام شيئا ولها تأثير وتقدر فلتخلص إلي بالمساءة فإني عدو لها لا أبالي بها ولا أفكر فيها وهذا كما قال تعالى مخبرا عن نوح عليه السلام \"فأجمعوا أمركم وشركاءكم\" الآية وقال هود عليه السلام \"إني أشهد الله واشهدوا أني بريء مما تشركون من دونه فكيدوني جميعا ثم لا تنظرون إني توكلت على الله ربي وربكم ما من دابة إلا هو آخذ بناصيتها إن ربي على صراط مستقيم\" وهكذا تبرأ إبراهيم من آلهتهم فقال \"وكيف أخاف ما أشركتم ولا تخافون أنكم أشركتم بالله\" الآية وقال تعالى: \"قد كانت لكم أسوة حسنة في إبراهيم\" - إلى قوله - \"حتى تؤمنوا بالله وحده\" وقال تعالى: \"وإذ قال إبراهيم لأبيه وقومه إني براء مما تعبدون إلا الذي فطرني فإنه سيهدين وجعلها كلمة\" يعني لا إله إلا الله."
    },
    {
      "ayah": 77,
      "surah": 26,
      "text": "\"أفرأيتم ما كنتم تعبدون أنتم وآباؤكم الأقدمون فإنهم عدو لي إلا رب العالمين\" أي إن كانت هذه الأصنام شيئا ولها تأثير وتقدر فلتخلص إلي بالمساءة فإني عدو لها لا أبالي بها ولا أفكر فيها وهذا كما قال تعالى مخبرا عن نوح عليه السلام \"فأجمعوا أمركم وشركاءكم\" الآية وقال هود عليه السلام \"إني أشهد الله واشهدوا أني بريء مما تشركون من دونه فكيدوني جميعا ثم لا تنظرون إني توكلت على الله ربي وربكم ما من دابة إلا هو آخذ بناصيتها إن ربي على صراط مستقيم\" وهكذا تبرأ إبراهيم من آلهتهم فقال \"وكيف أخاف ما أشركتم ولا تخافون أنكم أشركتم بالله\" الآية وقال تعالى: \"قد كانت لكم أسوة حسنة في إبراهيم\" - إلى قوله - \"حتى تؤمنوا بالله وحده\" وقال تعالى: \"وإذ قال إبراهيم لأبيه وقومه إني براء مما تعبدون إلا الذي فطرني فإنه سيهدين وجعلها كلمة\" يعني لا إله إلا الله."
    },
    {
      "ayah": 78,
      "surah": 26,
      "text": "يعني لا أعبد إلا الذي يفعل هذه الأشياء \"الذي خلقني فهو يهدين\" أي هو الخالق الذي قدر قدرا وهدى الخلائق إليه فكل يجري على ما قدر له وهو الذي يهدي من يشاء ويضل من يشاء."
    },
    {
      "ayah": 79,
      "surah": 26,
      "text": "\"والذي هو يطعمني ويسقين\" أي هو خالقي ورازقي بما سخر ويسر من الأسباب السماوية والأرضية فساق المزن وأنزل الماء وأحيا به الأرض وأخرج به من كل الثمرات رزقا للعباد وأنزل الماء عذبا زلالا يسقيه مما خلق أنعاما وأناسي كثيرا."
    },
    {
      "ayah": 8,
      "surah": 26,
      "text": "\"إن في ذلك لآية\" أي دلالة على قدرة الخالق للأشياء الذي بسط الأرض ورفع بناء السماء ومع هذا ما آمن أكثر الناس بل كذبوا به وبرسله وكتبه وخالفوا أمره وارتكبوا نهيه."
    },
    {
      "ayah": 80,
      "surah": 26,
      "text": "وقوله: \"وإذا مرضت فهو يشفين\" أسند المرض إلى نفسه وإن كان عن قدر الله وقضائه وخلقه ولكن أضافه إلى نفسه أدبا كما قال تعالى آمرا للمصلي أن يقول \"اهدنا الصراط المستقيم\" إلى آخر السورة فأسند الإنعام والهداية إلى الله تعالى والغضب حذف فاعله أدبا وأسند الضلال إلى العبيد كما قالت الجن \"وأنا لا ندري أشر أريد بمن في الأرض أم أراد بهم ربهم رشدا\" وكذا قال إبراهيم \"وإذا مرضت فهو يشفين\" أي إذا وقعت في مرض فإنه لا يقدر على شفائي أحد غيره بما يقدر من الأسباب الموصلة إليه."
    },
    {
      "ayah": 81,
      "surah": 26,
      "text": "\"والذي يميتني ثم يحيين\" أي هو الذي يحيي ويميت لا يقدر على ذلك أحد سواه فإنه هو الذي يبدئ ويعيد."
    },
    {
      "ayah": 82,
      "surah": 26,
      "text": "\"والذي أطمع أن يغفر لي خطيئتي يوم الدين\" أي لا يقدر على غفران الذنوب في الدنيا والآخرة إلا هو ومن يغفر الذنوب إلا الله وهو الفعال لما يشاء."
    },
    {
      "ayah": 83,
      "surah": 26,
      "text": "وهذا سؤال من إبراهيم عليه السلام أن يؤتيه ربه حكما قال ابن عباس وهو العلم وقال عكرمة هو اللب وقال مجاهد هو القرآن وقال السدي هو النبوة وقوله: \"وألحقني بالصالحين\" أي اجعلني مع الصالحين في الدنيا والآخرة كما قال النبي صلى الله عليه وسلم عند الاحتضار \"اللهم في الرفيق الأعلى\" قالها ثلاثا وفي الحديث في الدعاء \"اللهم أحينا مسلمين وأمتنا مسلمين وألحقنا بالصالحين غير خزايا ولا مبدلين\"."
    },
    {
      "ayah": 84,
      "surah": 26,
      "text": "وقوله: \"واجعل لي لسان صدق في الآخرين\" أي واجعل لي ذكرا جميلا بعدي أذكر به ويقتدى بي في الخير كما قال تعالى: \"وتركنا عليه في الآخرين سلام على إبراهيم كذلك نجزي المحسنين\" قال مجاهد وقتادة \"واجعل لي لسان صدق في الآخرين\" يعني الثناء الحسن قال مجاهد كقوله تعالى: \"وآتيناه في الدنيا حسنة\" الآية كقوله: \"وآتيناه أجره في الدنيا\" الآية قال ليث ابن أبي سليم كل ملة تحبه وتتولاه وكذا قال عكرمة."
    },
    {
      "ayah": 85,
      "surah": 26,
      "text": "وقوله تعالى: \"واجعلني من ورثة جنة النعيم\" أي أنعم علي في الدنيا ببقاء الذكر الجميل بعدي وفي الآخرة بأن تجعلني من ورثة جنة النعيم."
    },
    {
      "ayah": 86,
      "surah": 26,
      "text": "وقوله: \"واغفر لأبي\" الآية كقوله: \"ربنا اغفر لي ولوالدي\" وهذا مما رجع عنه إبراهيم عليه السلام كما قال تعالى: \"وما كان استغفار إبراهيم لأبيه إلا عن موعدة وعدها إياه - إلى قوله - إن إبراهيم لأواه حليم\" وقد قطع تعالى الإلحاق في استغفاره لأبيه فقال تعالى: \"قد كانت لكم أسوة حسنة في إبراهيم والذين معه- إلى قوله - وما أملك لك من الله من شيء\"."
    },
    {
      "ayah": 87,
      "surah": 26,
      "text": "وقوله: \"ولا تخزني يوم يبعثون\" أي أجرني من الخزي يوم القيامة ويوم يبعث الخلائق أولهم وآخرهم وقال البخاري عند هذه الآية قال إبراهيم بن طهمان عن ابن أبي ذئب عن سعيد بن أبي سعيد المقبري عن أبيه عن أبي هريرة رضي الله عنه عن النبي صلى الله عليه وسلم قال \"يلقى إبراهيم يوم القيامة أباه عليه الغبرة والقترة\" وفي رواية أخرى حدثنا إسماعيل حدثنا أخي عن ابن أبي ذئب عن سعيد المقبري عن أبي هريرة عن النبي صلى الله عليه وسلم قال: \"يلقى إبراهيم أباه فيقول يارب إنك وعدتني أن لا تخزني يوم يبعثون فيقول الله تعالى إني حرمت الجنة على الكافرين\" هكذا رواه عند هذه الآية وفي أحاديث الأنبياء بهذا الإسناد بعينه منفردا به ولفظه \"يلقى إبراهيم أباه آزر يوم القيامة وعلى وجه آزر قترة وغبرة فيقول له إبراهيم ألم أقل لك لا تعصيني فيقول أبوه فاليوم لا أعصيك فيقول إبراهيم يارب إنك وعدتني أن لا تخزني يوم يبعثون فأي خزي أخزى من أبي الأبعد ؟ فيقول الله تعالى إني حرمت الجنة على الكافرين ثم يقول يا إبراهيم انظر تحت رجلك فينظر فإذا هو بذيخ متلطخ فيؤخذ بقوائمه فيلقى في النار\" ورواه عبد الرحمن النسائي في التفسير من سننه الكبير وقوله: \"ولا تخزني يوم يبعثون\" أخبرنا أحمد بن حفص بن عبدالله حدثني أبي حدثني إبراهيم بن طهمان عن محمد بن عبد الرحمن عن سعيد بن أبي سعيد المقبري عن أبيه عن أبي هريرة قال: قال رسول الله صلى الله عليه وسلم \"إن إبراهيم رأى أباه يوم القيامة عليه الغبرة والقترة وقال له قد نهيتك عن هذا فعصيتني قال لكني اليوم لا أعصيك واحدة قال يارب وعدتني أن لا تخزني يوم يبعثون فإن أخزيت أباه فقد أخزيت الأبعد قال يا إبراهيم إني حرمتها على الكافرين فأخذ منه قال يا إبراهيم أين أبوك ؟ قال أنت أخذته مني قال انظر أسفل منك فنظر فإذا ذيخ يتمرغ في نتنه فأخذ بقوائمه فألقي في النار\" وهذا إسناد غريب وفية نكارة والذيخ هو الذكر من الضباع كأنه حول آذر إلى صورة ذيخ متلطخ بعذرته فيلقى في النار كذلك وقد رواه البزار باسناده من حديث حماد بن سلمة عن أيوب عن محمد بن سيرين عن أبي هريرة عن النبي صلى الله عليه وسلم وفيه غرابة ورواه أيضا من حديث قتادة عن جعفر بن عبد الغافر عن أبي سعيد عن النبي صلى الله عليه وسلم بنحوه."
    },
    {
      "ayah": 88,
      "surah": 26,
      "text": "وقوله: \"يوم لا ينفع مال ولا بنون\" أي لا يقي المرء من عذاب الله ماله ولو افتدى بملء الأرض ذهبا \"ولا بنون\" أي ولو افتدى بمن على الأرض جميعا ولا ينفع يومئذ إلا الإيمان بالله وإخلاص الدين له والتبري من الشرك وأهله."
    },
    {
      "ayah": 89,
      "surah": 26,
      "text": "ولهذا قال: \"إلا من أتى الله بقلب سليم\" أي سالم من الدنس والشرك قال ابن سيرين القلب السليم أن يعلم أن الله حق وأن الساعة آتية لا ريب فيها وأن الله يبعث من في القبور وقال ابن عباس \"إلا من أتى الله بقلب سليم\" القلب السليم أن يشهد أن لا إله إلا الله وقال مجاهد والحسن وغيرهما \"بقلب سليم\" يعني من الشرك وقال سعيد بن المسيب القلب السليم هوالقلب الصحيح وهو قلب المؤمن لأن قلب الكافر والمنافق مريض قال الله تعالى: \"في قلوبهم مرض\" قال أبو عثمان النيسابوري هو القلب السالم من البدعة المطمئن إلى السنة."
    },
    {
      "ayah": 9,
      "surah": 26,
      "text": "وقوله \"وإن ربك لهو العزيز\" أي الذي عز كل شي وقهره وغلبه \"الرحيم\" أي بخلقه فلا يعجل على من عصاه بل يؤجله وينظره ثم يأخذه أخذ عزيز مقتدر قال أبو العالية وقتادة والربيع بن أنس وابن إسحاق: العزيز في نقمته وانتصاره ممن خالف أمره وعبد غيره وقال سعيد بن جبير: الرحيم بمن تاب إليه وأناب."
    },
    {
      "ayah": 90,
      "surah": 26,
      "text": "\"وأزلفت الجنة\" أي قربت وأدنيت من أهلها مزخرفة مزينة لناظريها وهم المتقون الذين رغبوا فيها على ما في الدنيا وعملوا لها في الدنيا."
    },
    {
      "ayah": 91,
      "surah": 26,
      "text": "\"وبرزت الجحيم للغاوين\" أي أظهرت وكشف عنها وبدت منها عنق فزفرت زفرة بلغت منها القلوب الحناجر وقيل لأهلها تقريعا وتوبيخا."
    },
    {
      "ayah": 92,
      "surah": 26,
      "text": "\"أين ما كنتم تعبدون من دون الله هل ينصرونكم أو ينتصرون\" أي ليست الآلهة التي عبدتموها من دون الله من تلك الأصنام والأنداد تغني عنكم اليوم شيئا ولا تدفع عن أنفسها فإنكم وإياها اليوم حصب جهنم أنتم لها واردون."
    },
    {
      "ayah": 93,
      "surah": 26,
      "text": "\"أين ما كنتم تعبدون من دون الله هل ينصرونكم أو ينتصرون\" أي ليست الآلهة التي عبدتموها من دون الله من تلك الأصنام والأنداد تغني عنكم اليوم شيئا ولا تدفع عن أنفسها فإنكم وإياها اليوم حصب جهنم أنتم لها واردون."
    },
    {
      "ayah": 94,
      "surah": 26,
      "text": "وقوله: \"فكبكبوا فيها هم والغاوون\" قال مجاهد يعني فدهوروا فيها وقال غيره كبوا فيها والكاف مكررة كما يقال صرصر والمراد أنه ألقي بعضهم على بعض من الكفار وقادتهم الذين دعوهم إلى الشرك."
    },
    { "ayah": 95, "surah": 26, "text": "\"وجنود إبليس أجمعون\" أي ألقوا فيها عن آخرهم." },
    {
      "ayah": 96,
      "surah": 26,
      "text": "\"قالوا وهم فيها يختصمون تالله إن كنا لفي ضلال مبين إذ نسويكم برب العالمين\" أي يقول الضعفاء للذين استكبروا إنا كنا لكم تبعا فهل أنتم مغنون عنا نصيبا من النار ويقولون وقد عادوا على أنفسهم بالملامة."
    },
    {
      "ayah": 97,
      "surah": 26,
      "text": "\"تالله إن كنا لفي ضلال مبين إذ نسويكم برب العالمين\" أي نجعل أمركم مطاعا كما يطاع أمر رب العالمين وعبدناكم مع رب العالمين."
    },
    {
      "ayah": 98,
      "surah": 26,
      "text": "\"تالله إن كنا لفي ضلال مبين إذ نسويكم برب العالمين\" أي نجعل أمركم مطاعا كما يطاع أمر رب العالمين وعبدناكم مع رب العالمين."
    },
    { "ayah": 99, "surah": 26, "text": "\"وما أضلنا إلا المجرمون\" أي ما دعانا إلى ذلك إلا المجرمون." }
  ]
}
