{
  "ayahs": [
    {
      "ayah": 1,
      "surah": 27,
      "text": "سورة النمل قد اختلف المفسرون في الحروف المقطعة التي في أوائل السور فمنهم من قال هي مما استأثر الله بعلمه فردوا علمها إلى الله ولم يفسرها حكاه القرطبي في تفسـره عن أبي بكر وعمر وعثمان وعلي وابن مسعود رضي الله عنهم أجمعين وقاله عامر الشعبي وسفيان الثوري والربيع بن خيثم واختاره أبو حاتم بن حبان ومنهم من فسرها واختلف هؤلاء في معناها فقال عبدالرحمن بن زيد بن أسلم إنما هي أسماء السور قال العلامة أبو القاسم محمود بن عمر الزمخشري في تفسيره وعليه إطباق الأكثر ونقل عن سيبويه أنه نص عليه ويعتضد لهذا بما ورد في الصحيحين عن أبي هريرة أن رسول الله صلى الله عليه وسلم كان يقرأ في صلاة الصبح يوم الجمعة \"الم\" السجدة و \"هل أتى على الإنسان\" وقال سفيان الثوري عن ابن أبي نجيح عن مجاهد أنه قال: الم وحم والمص وص فواتح افتتح الله بها القرآن وكذا قال غيره عن مجاهد وقال مجاهد في رواية أبي حذيفة موسى بن مسعود عن شبل عن ابن أبي نجيح عنه أنه قال الم اسم من أسماء القرآن وهكذا وقال قتادة وزيد بن أسلم ولعل هذا يرجع إلى معنى قول عبدالرحمن بن زيد بن أسلم أنه اسم من أسماء السور فإن كل سورة يطلق عليها اسم القرآن فإنه يبعد أن يكون المص اسما للقرآن كله لأن المتبادر إلى فهم سامع من يقول قرأت المص إنما ذلك عبارة عن سورة الأعراف لا لمجموع القرآن والله أعلم وقيل هي اسم من أسماء الله تعالى فقال عنها في فواتح السور من أسماء الله تعالى وكذلك قال سالم بن عبدالله وإسماعيل بن عبدالرحمن السدي الكبير وقال شعبة عن السدي بلغني أن ابن عباس قال ألم اسم من أسماء الله الأعظم هكذا رواه ابن أبي حاتم من حديث شعبة ورواه ابن جرير عن بندار عن ابن مهدي عن شعبة قال سألت السدي عن حم وطس والم فقال قال ابن عباس هي اسم الله الأعظم وقال ابن جرير وحدثنا محمد بن المثنى حدثنا أبو النعمان حدثنا شعبة عن إسماعيل السدي عن مرة الهمذاني قال: قال عبدالله فذكر نحوه وحكى مثله عن علي وابن عباس وقال علي بن أبي طلحة عن ابن عباس هو قسم أقسم الله به وهو من أسماء الله تعالى وروى ابن أبي حاتم وابن جرير من حديث ابن علية عن خالد الحذاء عن عكرمة أنه قال الم قسم وروينا أيضا من حديث وعن أبي صالح عن ابن عباس وعن مرة الهمذاني عن ابن مسعود وعن ناس من أصحاب النبي صلى الله عليه وسلم الم قال أما الم فهي حروف استفتحت من حروف هجاء أسماء الله تعالى وقال أبو جعفر الرازي عن الربيع بن أنس عن أبي العالية في قوله تعالى ألم قال هذه الأحرف الثلاثة من التسعة والعشرين حرفا دارت فيها الألسن كلها ليس منها حرف إلا وهو مفتاح اسم من أسمائه وليس منها حرف إلا وهو من آلائه وبلألائه وليس منها حرف إلا وهو في مدة أقوام وآجالهم قال عيسى ابن مريم عليه السلام وعجب: فقال أعجب أنهم يظنون بأسمائه ويعيشون في رزقه فكيف يكفرون به فالألف مفتاح الله واللام مفتاح اسمه لطيف والميم مفتاح اسمه مجيد فالألف آلاء الله واللام لطف الله والميم مجد الله والألف سنة واللام ثلاثون سنة والميم أربعون سنة هذا لفظ ابن أبي حاتم ونحوه رواه ابن جرير ثم شرع يوجه كل واحد من هذه الأقوال ويوفق بينها وأنه لا منافاة بين كل واحد منها وبين الآخر وأن الجمع ممكن فهي أسماء للسور ومن أسماء الله تعالى يفتتح بها السور فكل حرف منها دل على اسم من أسمائه وصفة من صفاته كما افتتح سورا كثيرة بتحميده وتسبيحه وتعظيمه قال ولا مانع من دلالة الحرف منها على اسم من أسماء الله وعلى صفة من صفاته وعلى مدة وغير ذلك كما ذكره الربيع بن أنس عن أبي العالية لأن الكلمة الواحدة تطلق على معاني كثيرة كلفظة الأمة فإنها تطلق ويراد بها الدين كقوله تعالى \"إنا وجدنا آباءنا على أمة\" وتطلق ويراد بها الرجل المطيع لله كقوله تعالى \"إن إبراهيم كان أمة قانتا لله حنيفا ولم يك من المشركين\" وتطلق ويراد بها الجماعة كقوله تعالى \"وجد عليه أمة من الناس يسقون\" وقوله تعالى \"ولقد بعثنا في كل أمة رسولا\" وتطلق ويراد بها الحين من الدهر كقوله تعالى \"وقال الذي نجا منهما وادكر بعد أمة\" أي بعد حين على أصح القولين قال فكذلك هذا وقوله تعالى: \"تلك آيات\" أي هذه آيات \"القرآن وكتاب مبين\" أي بين واضح."
    },
    {
      "ayah": 10,
      "surah": 27,
      "text": "ثم أمره أن يلقي عصاه من يده ليظهر له دليلا واضحا علي أنه الفاعل المختار القادر على كل شيئ فلما ألقى موسى تلك العصا من يده انقلبت في الحال حية عظيمة هائلة في غاية الكبر وسرعة الحركة مع ذلك ولهذا قال تعالى: \"فلما رآها تهتز كأنها جان\" والجان ضرب من الحيات أسرعه حركة وأكره اضطرابا وفي الحديث نهى عن قتل جنان البيوت فلما عاين موسى ذلك \"ولى مدبرا ولم يعقب\" أي لم يلتفت من شدة فرقه \"يا موسى لا تخف إني لا يخاف لدي المرسلون\" أي لا تخف مما ترى فإني أريد أن أصطفيك رسولا وأجعلك نبيا وجيها."
    },
    {
      "ayah": 11,
      "surah": 27,
      "text": "هذا استثناء منقطع وفيه بشارة عظيمة للبشر وذلك أن من كان على عمل شيء ثم أقلع عنه ورجع وتاب وأناب فإن الله يتوب عليه كما قال تعالى: \"وإني لغفار لمن تاب وآمن وعمل صالحا ثم اهتدى\" وقال تعالى: \"ومن يعمل سوءا أو يظلم نفسه\" الآية والآيات في هذا كثيرة جدا."
    },
    {
      "ayah": 12,
      "surah": 27,
      "text": "هذه آية أخرى ودليل باهر على قدرة الله الفاعل المختار وصدق من جعل له معجزة وذلك أن الله تعالى أمره أن يدخل يده في جيب درعه فإذا أدخلها وأخرجها خرجت بيضاء ساطعة كأنها قطعة قمر لها لمعان تتلألأ كالبرق الخاطف وقوله تعالى: \"في تسع آيات\" أي هاتان ثنتان من تسع آيات أؤيدك بهن وأجعلهن برهانا لك إلى فرعون وقومه \"إنهم كانوا قوما فاسقين\" وهذه هي الآيات التسع التي قال الله تعالى \"ولقد آتينا موسى تسع آيات بينات\" كما تقدم تقرير ذلك هنالك."
    },
    {
      "ayah": 13,
      "surah": 27,
      "text": "أى بينة واضحة ظاهرة \"قالوا هذا سحر مبين\" وأرادوا معارضته بسحرهم فغلبوا وانقلبوا صاغرين."
    },
    {
      "ayah": 14,
      "surah": 27,
      "text": "\"وجحدوا بها\" أي في ظاهر أمرهم \"واستيقنتها أنفسهم\" أي علموا في أنفسهم أنها حق عند الله ولكن جحدوها وعاندوها وكابروها \"ظلما وعلوا\" أي ظلما من أنفسهم سجية ملعونة وعلوا أي استكبارا عن اتباع الحق ولهذا قال تعالى: \"فانظر كيف كان عاقبة المفسدين\" أي انظر يا محمد كيف كان عاقبة أمرهم في إهلاك الله إياهم وإغراقهم عن آخرهم فى صبيحة واحدة وفحوى الخطاب يقول إحذروا أيها المكذبون لمحمد الجاحدون لما جاء به من ربه أن يصيبكم ما أصابهم بطريق الأولى والأخرى فإن محمدا صلى الله عليه وسلم أشرف وأعظم من موسى وبرهانه أدل وأقوى من برهان موسى بما آتاه الله من الدلائل المقترنة بوجوده في نفسه وشمائله وما سبقه من البشارات من الأنبياء به وأخذ المواثيق له عليه من ربه أفضل الصلاة والسلام."
    },
    {
      "ayah": 15,
      "surah": 27,
      "text": "يخبر تعالى عما أنعم به على عبديه ونبييه داود وابنه سليمان عليهما السلام من النعم الجزيلة والمواهب الجليلة والصفات الجميلة وما جمع لهما بين سعادة الدنيا والآخرة والملك والتمكين التام في الدنيا والنبوة والرسالة في الدين ولهذا قال تعالى \"ولقد آتينا داود وسليمان علما وقالا الحمد لله الذي فضلنا على كثير من عباده المؤمنين\" قال ابن أبي حاتم ذكر عن إبراهيم بن يحيى بن هشام أخبرني أبي عن جدي قال: كتب عمر بن عبد العزيز إن الله لم ينعم على عبده نعمة فيحمد الله عليها إلا كان حمده أفضل من نعمه لو كنت لا تعرف ذلك إلا في كتاب الله المنزل قال الله تعالى \" ولقد آتينا داود وسليمان علما وقالا الحمد لله الذي فضلنا على كثير من عباده المؤمنين\" فأي نعمة أفضل مما أوتي داود وسليمان عليهما السلام."
    },
    {
      "ayah": 16,
      "surah": 27,
      "text": "\"وورث سليمان داود\" أي في الملك والنبوة وليس المراد وراثة المال إذ لو كان كذلك لم يخص سليمان وحده من بين سائر أولاد داود فإنه قد كان لداود مائة امرأة ولكن المراد بذلك وراثة الملك والنبوة فإن الانبياء لا تورث أموالهم كما أخبر بذلك رسول الله صلى الله عليه وسلم في قوله \"نحن معاشر الأنبياء لا نورث ما تركناه فهو صدقه\" وقال \"يا أيها الناس علمنا منطق الطير وأوتينا من كل شيء\" أي أخبر سليمان بنعم الله عليه فيما وهبه له من الملك التام والتمكين العظيم حتى إنه سخر له الإنس والجن والطير وكان يعرف لغة الطير والحيوان أيضا وهذا شيء لم يعطه أحد من البشر فيما علمناه مما أخبر الله به ورسوله ومن زعم من الجهلة والرعاع أن الحيوانات كانت تنطق كنطق بني آدم قبل سليمان بن داود كما قد يتفوه به كثير من الناس فهو قول بلا علم ولو كان الأمر كذلك لم يكن لتخصيص سليمان بذلك فائدة إذ كلهم يسمع كلام الطيور والبهائم ويعرف ما تقول وليس الأمر كما زعموا ولا كما قالوا بل لم تزل البهائم والطيور وسائر المخلوقات من وقت خلقت إلى زماننا هذا على هذا الشكل والمنوال ولكن الله سبحانه كان قد أفهم سليمان ما يتخاطب به الطيور في الهواء وما تنطق به الحيوانات على اختلاف أصنافها ولهذا قال تعالى \"علمنا منطق الطير وأوتينا من كل شيء\" أي مما يحتاج إليه الملك \"إن هذا لهو الفضل المبين\" أي الظاهر البين لله علينا قال الإمام أحمد حدثنا قتيبة حدثنا يعقوب بن عبد الرحمن عن عمرو بن أبي عمرو عن المطلب عن أبي هريرة رضي الله عنه أن رسول الله صلى الله عليه وسلم قال: \"كان داود عليه السلام فيه غيرة شديدة فكان إذا خرج أغلقت الأبواب فلم يدخل على أهله أحد حتى يرجع قال فخرج ذات يوم وأغلقت الأبواب فأقبلت امرأة تطلع إلى الدار فإذا رجل قائم وسط الدار فقالت لمن في البيت من أين دخل هذا الرجل والدار مغلقة؟ والله لنفتضحن بداود فجاء داود \"فإذا الرجل قائم وسط الدار فقال له داود من أنت؟ فقال الذي لا يهاب الملوك ولا يمتنع من الحجاب فقال داود أنت إذا والله ملك الموت مرحبا بأمر الله فتزمل داود مكانه حتى قبضت نفسه حتى فرغ من شأنه وطلعت عليه الشمس فقال سليمان عليه السلام للطير أظلي داود فظللت عليه الطير حتى أظلمت عليه الأرض فقال لها سليمان اقبضي جناحا جناحا\" قال أبو هريرة يا رسول الله كيف فعلت الطير؟ فقبض رسول الله صلى الله عليه وسلم يده وغلبت عليه يومئذ المضرحية قال أبو الفرج ابن الجوزي: المضرحية هي النسور الحمراء."
    },
    {
      "ayah": 17,
      "surah": 27,
      "text": "أى وجمع لسليمان جنوده من الجن والإنس والطير يعني ركب فيهم في أبهة وعظمة كبيرة في الإنس وكانوا هم الذين يلونه والجن وهم بعدهم في المنزلة والطير ومنزلتها فوق رأسه فإن كان حرا أظلته منه بأجنحتها قوله: \"فهم يوزعون\" أي يكف أولهم على آخرهم لئلا يتقدم أحد عن منزلته التي هي مرتبة له قال مجاهد جعل على كل صنف وزعة يردون أولاها على أخراها لئلا يتقدموا في المسير كما يفعل الملوك اليوم."
    },
    {
      "ayah": 18,
      "surah": 27,
      "text": "وقوله: \"حتى إذا أتوا على وادي النمل\" أي حتى إذا مر سليمان عليه السلام بمن معه من الجيوش والجنود على وادي النمل \"قالت نملة يا أيها النمل ادخلوا مساكنكم لا يحطمنكم سليمان وجنوده وهم لا يشعرون\" أورد ابن عساكر من طريق إسحاق بن بشر عن سعيد عن قتادة عن الحسن أن اسم هذه النملة حرس وأنها من قبيلة يقال لهم بنو الشيطان وأنها كانت عرجاء وكانت بقدر الذئب أي خافت على النمل أن تحطمها الخيول بحوافرها فأمرتهم بالدخول إلى مساكنهم ففهم ذلك سليمان عليه السلام منها."
    },
    {
      "ayah": 19,
      "surah": 27,
      "text": "أي ألهمني أن أشكر نعمتك التي مننت بها علي من تعليمي منطق الطير والحيوان وعلى والدي بالإسلام لك والإيمان بك \"وأن أعمل صالحا ترضاه\" أي عملا تحبه وترضاه \"وأدخلني برحمتك في عبادك الصالحين\" أي إذا توفيتني فألحقني بالصالحين من عبادك والرفيق الأعلى من أوليائك ومن قال من المفسرين إن هذا الوادي كان بأرض الشام أو بغيره وإن هذه النملة كانت ذات جناحين كالذباب أو غير ذلك من الأقاويل فلا حاصل لها وعن نوف البكالي أنه قال كان نمل سليمان أمثال الذئاب هكذا رأيته مضبوطا بالياء المثناة من تحت وإنما هو بالباء الموحدة وذلك تصحيف والله أعلم والغرض أن سليمان عليه السلام فهم قولها وتبسم ضاحكا من ذلك وهذا أمر عظيم جدا وقد قال ابن أبي حاتم حدثنا أبي حدثنا محمد بن بشار حدثنا يزيد بن هارون أنبأنا مسعر عن زيد العمي عن أبي الصديق الناجي قال خرج سليمان بن داود عليهما السلام يستسقي فإذا هو بنملة مستلقية على ظهرها رافعة قوائمها إلى السماء وهي تقول: اللهم إنا خلق من خلقك ولا غنى بنا عن سقياك وإلا تسقنا تهلكنا فقال سليمان ارجعوا فقد سقيتم بدعوة غيركم وقد ثبت في الصحيح عند مسلم من طريق عبد الرزاق عن معمر عن همام عن أبي هريرة عن النبي صلى الله عليه وسلم قال: \"قرصت نبيا من الأنبياء نملة فأمر بقرية النمل فأحرقت فأوحى الله إليه أفي أن قرصتك نملة أهلكت أمة من الأمم تسبح؟ فهلا نملة واحدة\"."
    },
    { "ayah": 2, "surah": 27, "text": "أى إنما تحصل الهداية والبشارة من القرآن لمن آمن به واتبعه وصدقه وعمل بما فيه." },
    {
      "ayah": 20,
      "surah": 27,
      "text": "قال مجاهد وسعيد بن جبير وغيرهما عن ابن عباس وغيره: كان الهدهد مهندسا يدل سليمان عليه السلام على الماء إذا كان بأرض فلاة طلبه فنظر له الماء في تخوم الأرض كما يرى الإنسان الشيء الظاهر على وجه الأرض ويعرف كم مساحة بعده من وجه الأرض فإذا دلهم عليه أمر سليمان عليه السلام الجان فحفروا ذلك المكان حتى يستنبط الماء من قراره فنزل سليمان عليه السلام يوما بفلاة من الأرض فتفقد الطير ليرى الهدهد فلم يره \"فقال مالي لا أرى الهدهد أم كان من الغائبين\" حدث يوما عبد الله بن عباس بنحو هذا وفي القوم رجل من الخوارج يقال له نافع بن الأزرق وكان كثير الاعتراض على ابن عباس فقال له قف يا ابن عباس غلبت اليوم قال ولم؟ قال إنك تخبر عن الهدهد أنه يرى الماء فى تخوم الأرض وأن الصبي ليضع له الحبة في الفخ ويحثو على الفخ ترابا فيجيء الهدهد ليأخذها فيقع في الفخ فيصيده الصبي فقال ابن عباس لولا أن يذهب هذا فيقول رددت على ابن عباس لما أجبته ثم قال له ويحك إنه إذا نزل القدر عمي البصر وذهب الحذر فقال له نافع: والله لا أجادلك في شيء من القرآن أبدا وقد ذكر الحافظ ابن عساكر في ترجمة أبي عبد الله البرزي من أهل برزة من غوطة دمشق وكان من الصالحين يصوم الاثنين والخميس وكان أعور قد بلغ الثمانين فروى ابن عساكر بسنده إلى أبي سليمان بن زيد أنه سأله عن سبب عوره فامتنع عليه فألح عليه شهورا فأخبره أن رجلين من أهل خراسان نزلا عنده جمعة في قرية برزة وسألاه عن واد بها فأريتهما إياه فأخرجا مجامر وأوقدا فيها بخورا كثيرا حتى عجعج الوادي بالدخان فأخذا يعزمان والحيات تقبل من كل مكان إليهما فلا يلتفتان إلى شيء منها حتى أقبلت حية نحو الذراع وعيناها تتوقدان مثل الدينار فاستبشرا بها عظيما وقالا الحمد لله الذي لم يخيب سفرنا من سنة وكسرا المجامر وأخذا الحية فأدخلا في عينها ميلا فاكتحلا به فسألتهما أن يكحلاني فأبيا فألححت عليهما وقلت لا بد من ذلك وتوعدتهما بالدولة فكحلا عيني الواحدة اليمنى فحين وقع في عيني نظرت إلى الأرض تحتي مثل المرآة أنظر ما تحتها كما ترى المرآة ثم قالا لي: سر معنا قليلا فسرت معهما وهما يحدثان حتى إذا بعدت عن القرية أخذاني فكتفاني وأدخل أحدهما يده في عيني ففقأها ورمى بها ومضيا فلم أزل كذلك ملقى مكتوفا حتى مر بي نفر ففك وثاقي فهذا ما كان من خبر عيني وقال ابن أبي حاتم حدثنا علي بن الحسين حدثنا هشام بن عمار حدثنا صدقة بن عمرو الغساني حدثنا عباد بن ميسرة المنقري عن الحسن فال: اسم هدهد سليمان عليه السلام عنبر وقال محمد بن إسحاق: كان سليمان عليه السلام إذا غدا إلى مجلسه الذي كان يجلس فيه تفقد الطير وكان فيما يزعمون يأتيه نوب من كل صنف من الطير كل يوم طائر فنظر فرأى من أصناف الطير كلها من حضره إلا الهدهد \"فقال مالي لا أرى الهدهد أم كان من الغائبين\" أخطأه بصري من الطير أم غاب فلم يحضر؟."
    },
    {
      "ayah": 21,
      "surah": 27,
      "text": "\"لأعذبنه عذابا شديدا\" قال الأعمش عن المنهال بن عمرو عن سعيد عن ابن عباس يعني نتف ريشه وقال عبد الله بن شداد نتف ريشه وتشميسه وكذا قال غير واحد من السلف إنه نتف ريشه وتركه ملقى يأكله الذر والنمل وقوله \"أو لأذبحنه\" يعني قتله \"أو ليأتيني بسلطان مبين\" بعذر بين واضح وقال سفيان بن عيينة وعبد الله بن شداد: لما قدم الهدهد قالت له الطير ما خلفك فقد نذر سليمان دمك فقال هل استثنى؟ قالوا نعم قال \"لأعذبنه عذابا شديدا أو لأذبحنه أو ليأتيني بسلطان مبين\" قال نجوت إذا قال مجاهد إنما دفع الله عنه ببره بأمه."
    },
    {
      "ayah": 22,
      "surah": 27,
      "text": "\"فمكث\" الهدهد \"غير بعيد\" أي غاب زمانا يسيرا ثم جاء فقال لسليمان \"أحطت بما لم تحط به\" أي اطلعت على ما لم تطلع عليه أنت ولا جنودك \"وجئتك من سبإ بنبإ يقين\" أي بخبر صدق حق يقين وسبأ هم حمير وهم ملوك اليمن."
    },
    {
      "ayah": 23,
      "surah": 27,
      "text": "\"إني وجدت امرأة تملكهم\" قال الحسن البصري وهي بلقيس بنت شراحيل ملكة سبأ وقال قتادة: كانت أمها جنية وكأن مؤخر قدميها مثل حافر الدابة من بيت مملكة وقال زهير بن محمد وهي بلقيس بنت شراحيل بن مالك بن الريان وأمها فارغة الجنية وقال ابن جريج بلقيس بنت ذي شرخ وأمها بلتعة وقال ابن أبى حاتم حدثنا علي بن الحسن حدثنا مسدد حدثنا سفيان بن عيينة عن عطاء بن السائب عن مجاهد عن ابن عباس قال: كان مع صاحبة سليمان مائه الف قيل تحت كل قيل مائة ألف مقاتل وقال الأعمش عن مجاهد: كان تحت يدي ملكة سبأ اثنا عشر ألف قيل تحت كل قيل مائة ألف مقاتل وقال عبد الرزاق أنبأنا معمر عن قتادة في قوله تعالى: \"إني وجدت امرأة تملكهم\" كانت من بيت مملكة وكان أولو مشورتها ثلثمائة واثني عشر رجلا كل رجل منهم على عشرة آلاف رجل وكانت بأرض يقال لها مأرب على ثلاثة أميال من صنعاء وهذا القول هو أقرب على أنه كثير على مملكة اليمن والله أعلم وقوله \" وأوتيت من كل شيء\" أي من متاع الدنيا مما يحتاج إليه الملك المتمكن \"ولها عرش عظيم\" يعني سرير تجلس عليه عظيم هائل مزخرف بالذهب وأنواع الجواهر واللآلئ قال زهير بن محمد كان من ذهب وصفحاته مرمولة بالياقوت والزبرجد طوله ثمانون ذراعا وعرضه أربعون ذراعا وقال محمد بن إسحاق كان من ذهب مفصص بالياقوت والزبرجد واللؤلؤ وكان إنما يخدمها النساء ولها ستمائة امرأة تلي الخدمة قال علماء التاريخ: وكان هذا السرير في قصر عظيم مشيد رفيع البناء محكم وكان فيه ثلثمائة وستون طاقة من مشرقه ومثلها من مغربه قد وضع بناؤه على أن تدخل الشمس كل يوم من طاقة وتغرب من مقابلتها فيسجدون لها صباحا ومساء."
    },
    {
      "ayah": 24,
      "surah": 27,
      "text": "أي لا يعرفون سبيل الحق التي هي إخلاص السجود لله وحده دون ما خلق من الكواكب وغيرها كما قال تعالى: \"ومن آياته الليل والنهار والشمس والقمر لا تسجدوا للشمس ولا للقمر واسجدوا لله الذي خلقهن إن كنتم إياه تعبدون\" وقرأ بعض القراء \"ألا يا اسجدوا لله\" جعلها ألا الإستفتاحية ويا للنداء وحذف المنادى تقديره عنده ألا يا قوم اسجدوا لله وقوله \"الذي يخرج الخبء في السموات والأرض\" قال علي بن أبي طلحة عن ابن عباس يعلم كل خبيئة في السماء والأرض وكذا قال عكرمة ومجاهد وسعيد بن جبير وقتادة وغير واحد وقال سعيد بن المسيب الخبء الماء وكذا قال عبد الرحمن بن زيد بن أسلم خبء السموات والأرض ما جعل فيهما من الأرزاق المطر من السماء والنبات من الأرض وهذا مناسب من كلام الهدهد الذي جعل فيه من الخاصية ما ذكره ابن عباس وغيره من أنه يرى الماء يجري في تخوم الأرض وداخلها وقوله \"ويعلم ما تخفون وما تعلنون\" أي يعلم ما يخفيه العباد وما يعلنونه من الأقوال والأفعال وهذا كقوله تعالى: \"سواء منكم من أسر القول ومن جهر به ومن هو مستخف بالليل وسارب بالنهار\"."
    },
    {
      "ayah": 25,
      "surah": 27,
      "text": "أي لا يعرفون سبيل الحق التي هي إخلاص السجود لله وحده دون ما خلق من الكواكب وغيرها كما قال تعالى: \"ومن آياته الليل والنهار والشمس والقمر لا تسجدوا للشمس ولا للقمر واسجدوا لله الذي خلقهن إن كنتم إياه تعبدون\" وقرأ بعض القراء \"ألا يا اسجدوا لله\" جعلها ألا الإستفتاحية ويا للنداء وحذف المنادى تقديره عنده ألا يا قوم اسجدوا لله وقوله \"الذي يخرج الخبء في السموات والأرض\" قال علي بن أبي طلحة عن ابن عباس يعلم كل خبيئة في السماء والأرض وكذا قال عكرمة ومجاهد وسعيد بن جبير وقتادة وغير واحد وقال سعيد بن المسيب الخبء الماء وكذا قال عبد الرحمن بن زيد بن أسلم خبء السموات والأرض ما جعل فيهما من الأرزاق المطر من السماء والنبات من الأرض وهذا مناسب من كلام الهدهد الذي جعل فيه من الخاصية ما ذكره ابن عباس وغيره من أنه يرى الماء يجري في تخوم الأرض وداخلها وقوله \"ويعلم ما تخفون وما تعلنون\" أي يعلم ما يخفيه العباد وما يعلنونه من الأقوال والأفعال وهذا كقوله تعالى: \"سواء منكم من أسر القول ومن جهر به ومن هو مستخف بالليل وسارب بالنهار\"."
    },
    {
      "ayah": 26,
      "surah": 27,
      "text": "أي هو المدعو وهو الله الذي لا إله إلا هو رب العرش العظيم أي الذي ليس في المخلوقات أعظم منه ولما كان الهدهد داعي إلى الخير وعبادة الله وحده والسجود له نهى عن قتله كما رواه الإمام أحمد وأبو داود وابن ماجه عن أبي هريرة رضي الله عنه قال نهى النبي صلى الله عليه وسلم عن أربع من الدواب: النملة والنحلة والهدهد والصرد وإسناده صحيح."
    },
    {
      "ayah": 27,
      "surah": 27,
      "text": "يقول تعالى مخبرا عن قول سليمان للهدهد حين أخيره عن أهل سبأ وملكتهم \"قال سننظر أصدقت أم كنت من الكاذبين\" أي أصدقت في إخبارك هذا \"أم كنت من الكاذبين\" في مقالتك لتخلص من الوعيد الذي أوعدتك؟."
    },
    {
      "ayah": 28,
      "surah": 27,
      "text": "وذلك أن سليمان عليه السلام كتب كتابا إلى بلقيس وقومها وأعطاه ذلك الهدهد فحمله قيل في جناحه كما هي عادة الطير وقيل بمنقاره وجاء إلى بلادهم فجاء إلى قصر بلقيس إلى الخلوة التي كانت تختلي فيها بنفسها فألقاه إليها من كوة هنالك بين يديها ثم تولى عنها أدبا ورياسة فتحيرت مما رأت وهالها ذلك ثم عمدت إلى الكتاب فأخذته ففتحت ختمه وقرأته فإذا فيه \"إنه من سليمان وإنه بسم الله الرحمن الرحيم ألا تعلو علي وأتوني مسلمين\"."
    },
    {
      "ayah": 29,
      "surah": 27,
      "text": "فجمعت عند ذلك أمراءها ووزراءها وكبراء دولتها ومملكتها ثم قالت لهم \"يا أيها الملأ إني ألقي إلي كتاب كريم\" تعني بكرمه ما رأته من عجيب أمره كون طائر ذهب به فألقاه إليها ثم تولى عنها أدبا وهذا أمر لا يقدر عليه أحد من الملوك ولا سبيل لهم إلى ذلك."
    },
    {
      "ayah": 3,
      "surah": 27,
      "text": "أى إنما تحصل الهداية والبشارة من القرآن لمن آمن به واتبعه وصدقه وعمل بما فيه وأقام الصلاة المكتوبة وآتى الزكاة المفروضة وأيقن بالدار الآخرة والبعث بعد الموت والجزاء على الأعمال خيرها وشرها والجنة والنار كما قال تعالى \"قل هو للذين آمنوا هدى وشفاء والذين لا يؤمنون في آذانهم وقر\" الآية وقال تعالى: \"لتبشر به المتقين وتنذر به قوما لدا\"."
    },
    {
      "ayah": 30,
      "surah": 27,
      "text": "ثم قرأته عليهم \"إنه من سليمان وإنه بسم الله الرحمن الرحيم ألا تعلوا علي وأتوني مسلمين\" فعرفوا أنه من نبي الله سليمان عليه السلام وأنه لا قبل لهم به وهذا الكتاب في غاية البلاغة والوجازة والفصاحة فإنه حصل المعنى بأيسر عبارة وأحسنها قال العلماء لم يكتب أحد بسم الله الرحمن الرحيم قبل سليمان عليه السلام وقد روى ابن أبي حاتم في ذلك حديثا في تفسيره حيث قال: حدثنا أبي حدثنا هارون بن الفضل أبو يعلى الخياط حدثنا أبو يوسف عن سلمة بن صالح عن عبد الكريم أبي أمية عن ابن بريدة عن أبيه قال: كنت أمشي مع رسول الله صلى الله عليه وسلم فقال \"إنى أعلم آية لم تنزل على نبي قبلي بعد سليمان بن داود\" قلت يا نبي الله أي آية؟ قال \"سأعلمكها قبل أن أخرج من المسجد\" قال فانتهى إلى الباب فأخرج إحدى قدميه فقلت نسي ثم التفت إلي وقال \"إنه من سليمان وإنه بسم الله الرحمن الرحيم\" هذا حديث غريب وإسناده ضعيف وقال ميمون بن مهران كان رسول الله صلى الله عليه وسلم يكتب باسمك اللهم حتى نزلت هذه الآية فكتب \"بسم الله الرحمن الرحيم\"."
    },
    {
      "ayah": 31,
      "surah": 27,
      "text": "قال قتادة يقول لا تجبروا علي \"وأتوني مسلمين\" وقال عبد الرحمن بن زيد بن أسلم لا تمتنعوا ولا تتكبروا علي وأتوني مسلمين قال ابن عباس موحدين وقال غيره مخلصين وقال سفيان بن عينة طائعين."
    },
    {
      "ayah": 32,
      "surah": 27,
      "text": "لما قرأت عليهم كتاب سليمان استشارتهم في أمرها وما قد نزل بها ولهذا قالت \"يا أيها الملأ أفتوني في أمري ما كنت قاطعة أمرا حتى تشهدون\" أي حتى تحضرون وتشيرون."
    },
    {
      "ayah": 33,
      "surah": 27,
      "text": "أي منوا إليها بعددهم وعددهم وقوتهم ثم فوضوا إليها بعد ذلك الأمر فقالوا: \"والأمر إليك فانظري ماذا تأمرين\" أي نحن ليس لنا عاقة ولا بنا بأس إن شئت أن تقصديه وتحاربيه فما لنا عاقة عنه وبعد هذا فالأمر إليك مري فينا رأيك نمتثله ونطيعه قال الحسن البصري رحمه الله فوضوا أمرهم إلى علجة تضطرب ثدياها فلما قالوا لها ما قالوا كانت هي أحزم رأيا منهم وأعلم بأمر سليمان وأنه لا قبل لها بجنوده وجيوشه وما سخر له من الجن والإنس والطير وقد شاهدت من قضية الكتاب مع الهدهد أمرا عجيبا بديعا فقالت لهم إني أخشى أن نحاربه ونمتنع عليه فيقصدنا بجنوده ويهلكنا بمن معه ويخلص إلى وإليكم الهلاك والدمار دون غيرنا."
    },
    {
      "ayah": 34,
      "surah": 27,
      "text": "قال ابن عباس أي إذا دخلوا بلدا عنوة أفسدوه أي خربوه \"وجعلوا أعزة أهلها أذلة\" أي وقصدوا من فيها من الولاة والجنود فأهانوهم غاية الهوان إما بالقتل أو بالأسر قال ابن عباس قالت بلقيس \"إن الملوك إذا دخلوا قرية أفسدوها وجعلوا أعزة أهلها أذلة\" قال الرب عز وجل \"وكذلك يفعلون\" ثم عدلت إلى المصالحة والمهادنة والمسالمة والمخادعة والمصانعة."
    },
    {
      "ayah": 35,
      "surah": 27,
      "text": "أي سأبعث إليه بهدية تليق بمثله وأنظر ماذا يكون جوابه بعد ذلك فلعله يقبل ذلك منا ويكف عنا أو يضرب علينا خراجا نحمله إليه في كل عام ونلتزم له بذلك ويترك قتالنا ومحاربتنا قال قتادة رحمه الله: ما كان أعقلها في إسلامها وشركها علمت أن الهدية تقع موقعا من الناس وقال ابن عباس وغير واحد قالت لقومها إن قبل الهدية فهو ملك فقاتلوه وإن لم يقبلها فهو نبي فاتبعوه."
    },
    {
      "ayah": 36,
      "surah": 27,
      "text": "ذكر غير واحد من المفسرين من السلف وغيرهم أنها بعثت إليه بهدية عظيمة من ذهب وجواهر ولآلئ وغير ذلك وقال بعضهم أرسلت بلبنة من ذهب والصحيح أنها أرسلت إليه بآنية من ذهب: قال مجاهد وسعيد بن جبير وغيرهما أرسلت جواري في زي الغلمان وغلمان فى زي الجواري فقالت إن عرف هؤلاء من هؤلاء فهو نبي قالوا فأمرهم سليمان فتوضؤا فجعلت الجارية تفرغ على يدها من الماء وجعل الغلام يغترف فميزهم بذلك وقيل بل جعلت الجارية تغسل باطن يدها قبل ظاهرها والغلام بالعكس وقيل بل جعلت الجواري يغسلن من أكفهن إلى مرافقهن والغلمان من مرافقهم إلى كفوفهم ولا منافاة بين ذلك كله والله أعلم: وذكر بعضهم أنها أرسلت إليه بقدح ليملأه ماء رواء لا من السماء ولا من الأرض: فأجرى الخيل حتى عرفت ثم ملأه من ذلك ويخرزة وسلك ليجعله فيها ففعل ذلك والله أعلم أكان ذلك أم لا وأكثره مأخوذ من الإسرائيليات والظاهر أن سليمان عليه السلام لم ينظر إلى ما جاءوا به بالكلية ولا اعتنى به بل أعرض عنه وقال منكرا عليهم \"أتمدونن بمال\" أي أتصانعونني بمال لأترككم على شرككم وملككم؟ \"فما آتاني الله خير مما آتاكم\" أي الذي أعطاني الله من الملك والمال والجنود خير مما أنتم فيه \"بل أنتم بهديتكم تفرحون\" أي أنتم الذين تنقادون للهدايا والتحف وأما أنا فلا أقبل منكم إلا الإسلام أو السيف قال الأعمش عن المنهال بن عمرو عن سعيد بن جبير عن ابن عباس رضي الله عنه: أمر سليمان الشياطين فموهوا له ألف قصر من ذهب وفضة فلما رأت رسلها ذلك قالوا ما يصنع هذا بهديتنا وفي هذا جواز تهيؤ الملوك وإظهارهم الزينة للرسل والقصاد."
    },
    {
      "ayah": 37,
      "surah": 27,
      "text": "\"ارجع إليهم\" أي بهديتهم \"فلنأتينهم بجنود لا قبل لهم بها\" أي لا طاقة لهم بقتالهم \"ولنخرجنهم منها أذلة\" أي ولنخرجنهم من بلدتهم أذلة \"وهم صاغرون\" أي مهانون مدحورون فلما رجعت إليها رسلها بهديتها وبما قال سليمان سمعت وأطاعت هي وقومها وأقبلت تسير إليه في جنودها خاضعة ذليلة معظمة لسليمان ناوية متابعته فى الإسلام ولما تحقق سليمان عليه السلام قدومهم ووفودهم إليه فرح بذلك وسره."
    },
    {
      "ayah": 38,
      "surah": 27,
      "text": "قال محمد بن إسحاق عن يزيد بن رومان قال: فلما رجعت إليها الرسل بما قال سليمان قالت قد والله عرفت ما هذا بملك وما لنا به من طاقة وما نصنع بمكابرته شيئا وبعثت إليه إني قادمة عليك بملوك قومي لأنظر ما أمرك وما تدعونا إليه من دينك ثم أمرت بسرير ملكها الذي كانت تجلس عليه وكان من ذهب مفصص بالياقوت والزبرجد واللؤلؤ فجعل في سبعة أبيات بعضها في بعض ثم أقفلت عليه الأبواب ثم قالت لمن خلفت على سلطانها احتفظ بما قبلك وسرير ملكي فلا يخلص إليه أحد من عباد الله ولا يرينه أحد حتى آتيك ثم شخصت إلى سليمان في اثني عشر ألف قيل من ملوك اليمن تحت يدي كل قيل ألوف كثيرة فجعل سليمان يبعث الجن يأتونه بمسيرها ومنتهاها كل يوم وليلة حتى إذا دنت جمع من عنده من الجن والإنس ممن تحت يده فقال \"يا أيها الملأ أيكم يأتيني بعرشها قبل أن يأتوني مسلمين\" وقال قتادة لما بلغ سليمان أنها جائية وكان قد ذكر له عرشها فأعجبه وكان من ذهب وقوائمه لؤلؤ وجوهر وكان مسترا بالديباج والحرير فكانت عليه تسعة مغاليق فكره أن يأخذه بعد إسلامهم وقد علم نبي الله أنهم متى أسلموا تحرم أموالهم ودماؤهم فقال \"يا أيها الملأ أيكم يأتيني بعرشها قبل أن يأتوني مسلمين\" وهكذا قال عطاء الخراساني والسدي وزهير بن محمد \"قبل أن يأتوني مسلمين\" فتحرم علي أموالهم بإسلامهم."
    },
    {
      "ayah": 39,
      "surah": 27,
      "text": "\"قال عفريت من الجن\" قال مجاهد أي مارد من الجن قال شعيب الجبائي وكان اسمه كوزن وكذا قال محمد بن إسحاق عن يزيد بن رومان وكذا قال أيضا وهب بن منبه قال أبو صالح وكان كأنه جبل \"أنا آتيك به قبل أن تقوم من مقامك\" قال ابن عباس رضي الله عنه يعني قبل أن تقوم من مجلسك وقال مجاهد مقعدك وقال السدي وغيره كان يجلس للناس للقضاء والحكومات وللطعام من أول النهار إلى أن تزول الشمس \"وإني عليه لقوي أمين\" قال ابن عباس أي قوي على حمله أمين على ما فيه من الجوهر فقال سليمان عليه السلام أريد أعجل من ذلك ومن ههنا يظهر أن سليمان أراد بإحضار هذا السرير إظهار عظمة ما وهب الله له من الملك وما سخر له من الجنود الذي لم يعطه أحد قبله ولا يكون لأحد من بعده وليتخذ ذلك حجة على نبوته عند بلقيس وقومها لأن هذا خارق عظيم أن يأتي بعرشها كما هو من بلادها قبل أن يقدموا عليه هذا وقد حجبته بالأغلاق والأقفال والحفظة."
    },
    {
      "ayah": 4,
      "surah": 27,
      "text": "أي يكذبون بها ويستبعدون وقوعها \" زينا لهم أعمالهم فهم يعمهون\" أي حسنا لهم ما هم فيه ومددنا لهم في غيهم فهم يتيهون في ضلالهم وكان هذا جزاء على ما كذبوا من الدار الآخرة كما قال تعالى: \"ونقلب أفئدتهم وأبصارهم كما لم يؤمنوا به أول مرة\"."
    },
    {
      "ayah": 40,
      "surah": 27,
      "text": "\"قال الذي عنده علم من الكتاب\" قال ابن عباس وهو آصف كاتب سليمان وكذا روى محمد بن إسحاق عن يزيد بن رومان أنه آصف بن برخياء وكان صديقا يعلم الاسم الأعظم وقال قتادة كان مؤمنا من الإنس واسمه آصف وكذا قال أبو صالح والضحاك وقتادة إنه كان من الإنس زاد قتادة من بني إسرائيل وقال مجاهد كان اسمه أسطوم قال قتادة في رواية عنه كان اسمه بليخا وقال زهير بن محمد هو رجل من الإنس يقال له ذو النور وزعم عبدالله بن لهيعة أنه الخضر وهو غريب جدا وقوله \"أنا آتيك به قبل أن يرتد إليك طرفك\" أي ارفع بصرك وانظر مد بصرك مما تقدر عليه فإنك لا يكل بصرك إلا وهو حاضر عندك وقال وهب ابن منبه أمدد بصرك فلا يبلغ مداه حتى آتيك به فذكروا أنه أمره أن ينظر نحو اليمن التي فيها هذا العرش المطلوب ثم قام فتوضأ ودعا الله تعالى قال مجاهد قال يا ذا الجلال والإكرام وقال الزهري قال: يا إلهنا وإله كل شيء إلها واحدا لا إله إلا أنت ائتني بعرشها قال فمثل بين يديه قال مجاهد وسعيد بن جبير ومحمد بن إسحاق وزهير بن محمد وغيرهم لما دعا الله تعالى وسأله أن يأتيه بعرش بلقيس وكان في اليمن وسليمان عليه السلام ببيت المقدس غاب السرير وغاص في الأرض ثم نبع من بين يدي سليمان وقال عبد الرحمن بن زيد بن أسلم لم يشعر سليمان إلا وعرشها يحمل بين يديه قال وكان هذا الذي جاء به من عباد البحر فلما عاين سليمان وملأه ذلك ورآه مستقرا عنده \"قال هذا من فضل ربي\" أي هذا من نعم الله علي \"ليبلوني\" أي ليختبرني \"ءأشكر أم أكفر ومن شكر فإنما يشكر لنفسه\" كقوله \"من عمل صالحا فلنفسه ومن أساء فعليها\" وكقوله \"ومن عمل صالحا فلأنفسهم يمهدون\" وقوله \"ومن كفر فإن ربي غني كريم\" أي هو غني عن العباد وعبادتهم كريم أي كريم في نفسه فإن لم يعبده أحد فإن عظمته ليست مفتقرة إلى أحد وهذا كما قال موسى \"إن تكفروا أنتم ومن في الأرض جميعا فإن الله لغني حميد\" وفي صحيح مسلم \"يقول الله تعالى: يا عبادي لو أن أولكم وآخركم وإنسكم وجنكم كانوا على أتقى قلب رجل منكم ما زاد ذلك في ملكي شيئا يا عبادي لو أن أولكم وآخركم وإنسكم وجنكم كانوا على أفجر قلب رجل منكم ما نقص ذلك من ملكي شيئا يا عبادي إنما هي أعمالكم أحصيها لكم ثم أوفيكم إياها فمن وجد خيرا فليحمد الله ومن وجد غير ذلك فلا يلومن إلا نفسه\"."
    },
    {
      "ayah": 41,
      "surah": 27,
      "text": "لما جيء سليمان عليه السلام بعرش بلقيس قبل قدومها أمر به أن يغير بعض صفاته ليختبر معرفتها وثباتها عند رويته هل تقدم على أنه عرشها أو أنه ليس بعرشها فقال \"نكروا لها عرشها ننظر أتهتدي أم تكون من الذين لا يهتدون\" قال ابن عباس نزع منه فصوصه ومرافقه وقال مجاهد أمر به فغير ما كان فيه أحمر جعل أصفر وما كان أصفر جعل أحمر وما كان أخضر جعل أحمر غير كل شيء عن حاله وقال عكرمة زادوا فيه ونقصوا وقال قتادة جعل أسفله أعلاه ومقدمه مؤخره وزادوا فيه ونقصوا."
    },
    {
      "ayah": 42,
      "surah": 27,
      "text": "\"فلما جاءت قيل أهكذا عرشك\" أي عرض عليها عرشها وقد غير ونكر وزيد فيه ونقص منه فكان فيها ثبات وعقل ولها لب ودهاء وحزم فلم تقدم على أنه هو لبعد مسافته عنها ولا أنه غيره لما رأت من آثاره وصفاته وإن غير وبدل ونكر فقالت \"كأنه هو\" أي يشبهه ويقاربه وهذا غاية في الذكاء والحزم وقوله \"وأوتينا العلم من قبلها وكنا مسلمين\" قال مجاهد يقوله سليمان هذا من تمام كلام سليمان عليه السلام في قول مجاهد وسعيد بن جبير رحمهما الله أي قال سليمان \"أوتينا العلم من قبلها وكنا مسلمين\"."
    },
    {
      "ayah": 43,
      "surah": 27,
      "text": "\"وصدها\" ضمير يعود إلى سليمان أو إلى الله عز وجل تقديره ومنعها \"ما كانت تعبد من دون الله\" أي صدها عن عبادة غير الله \"إنها كانت من قوم كافرين\" قلت ويؤيد قول مجاهد أنها إنما أظهرت الإسلام بعد دخولها إلى الصرح كما سيأتي."
    },
    {
      "ayah": 44,
      "surah": 27,
      "text": "وذلك أن سليمان عليه السلام أمر الشياطين فبنوا لها قصرا عظيما من قوارير أى من زجاج وأجرى تحته الماء فالذي لا يعرف أمره يحسب أنه ماء ولكن الزجاج يحول بين الماشي وبينه واختلفوا في السبب الذي دعا سليمان عليه السلام إلى اتخاذه فقيل إنه عزم على تزوجها واصطفائها لنفسه ذكر له جمالها وحسنها ولكن في ساقيها هلب عظيم ومؤخر أقدامها كمؤخر الدابة فساءه ذلك فاتخذ هذا ليعلم صحته أم لا؟ هكذا قول محمد بن كعب القرظي وغيره فلما دخلت وكشفت عن ساقيها رأى أحسن الناس ساقا وأحسنهم قدما لو كن رأى على رجليها شعرا لأنها ملكة ليس لها زوج فأحب أن يذهب ذلك عنها فقيل له الموسى فقالت لا أستطيع ذلك وكره سليمان ذلك وقال للجن اصنعوا شيئا غير الموسى يذهب به هذا الشعر فصنعوا له النورة وكان أول من اتخذت له النورة قاله ابن عباس ومجاهد وعكرمة ومحمد بن كعب القرظي والسدي وابن جريج وغيرهم وقال محمد بن إسحاق عن يزيد بن رومان ثم قال لها ادخلي الصرح ليريها ملكا هو أعز من ملكها وسلطانا هو أعظم من سلطانها فلما رأته حسبته لجة وكشفت عن ساقيها لا تشك أنه ماء تخوضه فقيل لها إنه صرح ممرد من قوارير فلما وقفت على سليمان دعاها إلى عبادة الله وحده وعاتبها في عبادتها الشمس من دون الله وقال الحسن البصري: لما رأت العلجة الصرح عرفت والله أن قد رأت ملكا أعظم من ملكها وقال محمد بن إسحاق عن بعض أهل العلم عن وهب بن منبه قال: أمر سليمان بالصرح وقد عملته له الشياطين من زجاج كأنه الماء بياضا ثم أرسل الماء تحته ثم وضع له فيه سريره فجلس عليه وعكفت عليه الطير والجن والإنس ثم قال لها ادخلي الصرح ليريها ملكا هو أعز من ملكها وسلطانا هو أعظم س سلطانها \"فلما رأته حسبته لجة وكشفت عن ساقيها\" لا تشك أنه ماء تخوضه قيل لها \"إنه صرح ممرد من قوارير\" فلما وقفت على سليمان دعاها إلى عبادة الله عز وجل وحده وعاتبها في عبادتها الشمس من دون الله فقالت بقول الزنادقة فوقع سليمان ساجدا إعظاما لما قالت وسجد معه الناس فسقط في يديها حين رأت سليمان صنع ما صنع فلما رفع سليمان رأسه قال ويحك ماذا قلت؟ قالت أنسيت ما قلت؟ فقالت \"رب إني ظلمت نفسي وأسلمت مع سليمان لله رب العالمين\" فأسلمت وحسن إسلامها وقد روى الإمام أبو بكر بن أبي شيبة في هذا أثرا غريبا عن ابن عباس فقال حدثنا الحسين بن على عن زائدة حدثني عطاء بن السائب حدثنا مجاهد ونحن في الأزد قال حدثنا ابن عباس قال: كان سليمان عليه السلام يجلس على سريره ثم توضع كراسي حوله فيجلس عليها الإنس ثم يجلس الجن ثم الشياطين ثم تأتي الريح فترفعهم ثم تظلهم الطير ثم يغدون قدر ما يشتهي الراكب أن ينزل شهرا ورواحها شهرا قال فبينما هو ذات يوم في مسير له إذ تفقد الطير ففقد الهدهد قال \"مالي لا أرى الهدهد أم كان من الغائبين لأعذبنه عذابا شديدا أو لأذبحنه أو ليأتيني بسلطان مبين\" قال وكان عذابه إياه أن ينتفه ثم يلقيه في الأرض فلا يمتنع من نملة ولا من شيء من هوام الأرض قال عطاء وذكر سعيد بن جبير عن أبن عباس مثل حديث مجاهد \"فمكث غير بعيد- فقرأ حتى انتهى إلى قوله - سننظر أصدقت أم كنت من الكاذبين اذهب بكتابي هذا\" وكتب بسم الله الرحمن الرحيم إلى بلقيس \"أن لا تعلوا علي وائتوني مسلمين\" فلما ألقى الهدهد الكتاب إليها ألقي في روعها أنه كتاب كريم وأنه كريم وأنه من سليمان وأن لا تعلوا علي وائتوني مسلمين قالوا نحن أولوا قوة قالت إن الملوك إذا دخلوا قرية أفسدوها وإني مرسلة إليهم بهدية فناظره بم يرجع المرسلون فلما جاءت الهدية سليمان قال أتمدونني بمال ارجع إليهم فلما نظر إلى الغبار أخبرنا ابن عباس قال وكان بين سليمان وبين ملكة سبأ ومن معها حين نظر إلى الغبار كما بيننا وبين الحيرة قال عطاء ومجاهد حينئذ في الأزد قال سليمان أيكم يأتيني بعرشها؟ قال وبين عرشها وبين سليمان حين نظر إلى الغبار مسيرة شهرين \"قال عفريت من الجن أنا آتيك به قبل أن تقوم من مقامك\" قال وكان لسليمان مجلس يجلس فيه للناس كما يجلس الأمراء ثم يقوم فقال \"أنا آتيك به قبل أن تقوم مقامك\" قال سليمان أريد أعجل من ذلك فقال الذي عنده علم من الكتاب أنا أنظر في كتاب ربي ثم آتيك به قبل أن يرتد إليك طرفك قال فنظر إليه سليمان فلما قطع كلامه رد سليمان بصره فنبع عرشها من تحت قدم سليمان من تحت كرسي كان سليمان يضع عليه رجله ثم يصعد إلى السرير قال فلما رأى سليمان عرشها قال \"هذا من فضل ربي\" الآية \"قال نكروا لها عرشها\" فلما جاءت قيل أهكذا عرشك قالت كأنه هو قال فسألته حين جاءته عن أمرين قالت لسليمان أريد ماء ليس من أرض ولا سماء وكان سليمان إذا سئل عن شيء سأل الإنس ثم الجن ثم الشياطين قال فقالت الشياطين هذا هين أجر الخيل ثم خذ عرقها ثم املأ منه الآنية قال فأمر بالخيل فجريت ثم أخذ عرقها فملأ منه الآنية قال وسألت عن لون الله عز وجل قال فوثب سليمان عن سريره فخر ساجدا فقال يا رب لقد سألتني عن أمر إنه ليتعاظم في قلبي أن أذكره لك فقال ارجع فقد كفيتكم قال فرجع إلى سريره قال ما سألت عنه؟ قالت ما سألتك إلا عن الماء فقال لجنوده ما سألت عنه؟ فقالوا ما سألتك إلا عن الماء قال ونسوه كلهم قال وقالت الشياطين إن سليمان يريد أن يتخذها لنفسه فإن اتخذها لنفسه ثم ولد بينها ولد لم ننفك من عبوديته فقال فجعلوا صرحا ممردا من قوارير فيه السمك قال فقيل لها أدخلي الصرح فلما رأته حسبته لجة وكشفت عن ساقيها فإذا هي شعراء فقال سليمان هذا قبيح فما يذهبه؟ قالوا يذهبه الموسى فقال أثر الموسى قبيح قال فجعلت الشياطين النورة قال فهو أول من جعلت له النورة ثم قال أبو بكر بن أبي شيبة ما أحسنه من حديث \"قلت\" بل هو منكر غريب جدا ولعله من أوهام عطاء بن السائب على ابن عباس والله أعلم والأقرب في مثل هذه السياقات أنها متلقاة عن أهل الكتاب مما وجد في صحفهم كروايات كعب ووهب سامحهما الله تعالى فيما نقلاه إلى هذه الأمة من أخبار بني إسرائيل من الأوابد والغرائب والعجائب مما كان وما لم يكن ومما حرف وبدل ونسخ وقد أغنانا الله سبحانه عن ذلك بما هو أصح منه وأنفع وأوضح وأبلغ ولله الحمد والمنة أصل الصرح في كلام العرب هو القصر وكل بناء مرتفع قال الله سبحانه وتعالى إخبارا عن فرعون لعنه الله أنه قال لوزيره هامان \"ابن لي صرحا لعلي أبلغ الأسباب\" الآيات والصرح قصر في اليمن عالي البناء والممرد المبنى بناء محكما أملس \"من قوارير\" أي زجاج وتمريد البناء تمليسه ومارد حصن بدومة الجندل والغرض أن سليمان عليه السلام اتخذ قصرا عظيما منيفا من زجاج لهذه الملكة ليريها عظمة سلطانه وتمكنه فما رأت ما آتاه الله وجلالة ما هو فيه وتبصرت في أمره انقادت لأمر الله تعالى وعرفت أنه نبي كريم وملك عظيم وأسلمت لله عز وجل وقالت \"رب إني ظلمت نفسي\" أي بما سلف من كفرها وشركها وعبادتها وقومها للشمس من دون الله \"وأسلمت مع سليمان لله رب العالمين\" أي متابعة لدين سليمان في عبادته لله وحده لا شريك له الذي خلق كل شيء فقدره تقديرا."
    },
    {
      "ayah": 45,
      "surah": 27,
      "text": "يخبر تعالى عن ثمود وما كان من أمرها مع نبيها صالح عليه السلام حين بعثه الله إليهم فدعاهم إلى عبادة الله وحده لا شريك له \"فإذا هم فريقان يختصمون\" قال مجاهد: مؤمن وكافر كقوله تعالى \"قال الملأ الذين استكبروا من قومه للذين استضعفوا لمن آمن منهم أتعلمون أن صالحا مرسل من ربه؟ قالوا إنا بما أرسل به مؤمنون قال الذين استكبروا إنا بالذي آمنتم به كافرون\"."
    },
    { "ayah": 46, "surah": 27, "text": "أي لم تدعون بحضور العذاب ولا تطلبون من الله رحمته." },
    {
      "ayah": 47,
      "surah": 27,
      "text": "أي ما رأينا على وجهك ووجوه من اتبعك خيرا وذلك أنهم لشقائهم كان لا يصيب أحدا منهم سوء إلا قال هذا من قبل صالح وأصحابه قال مجاهد تشاءموا بهم قال مجاهد تشاءموا بهم وهذا كما قال الله تعالى إخبارا عن قوم فرعون \"فإذا جاءتهم الحسنة قالوا لنا هذه وإن تصبهم سيئة يطيروا بموسى ومن معه\" الآية وقال تعالى \"وإن تصبهم حسنة يقولوا هذه من عند الله وإن تصبهم سيئة يقولوا هذه من عندك قل كل من عند الله\" أي بقضائه وقدره وقال تعالى مخبرا عن أهل القرية إذ جاءها المرسلون \"قالوا إنا تطيرنا بكم لئن لم تنتهوا لنرجمنكم وليمسنكم منا عذاب أليم قالوا طائركم معكم\" الآية وقال هؤلاء \"اطيرنا بك وبمن معك قال طائركم عند الله\" أي الله يجازيكم على ذلك \"بل أنتم قوم تفتنون\" قال قتادة تبتلون بالطاعة والمعصية والظاهر أن المراد بقوله \"تفتنون\" أي تستدرجون فيما أنتم فيه من الضلال."
    },
    {
      "ayah": 48,
      "surah": 27,
      "text": "يخبر تعالى عن طغاة ثمود ورءوسهم الذين كانوا دعاة قومهم إلى الضلال والكفر وتكذيب صالح وآل بهم الحال إلى أنهم عقروا الناقة وهموا بقتل صالح أيضا بأن يبيتوه في أهله ليلا فيقتلوه غيلة ثم يقولوا لأوليائه من أقربيه أنهم ما علموا بشيء من أمره وإنهم لصادقون فيما أخبروهم به من أنهم لم يشاهدوا ذلك فقال تعالى \"وكان في المدينة\" أي مدينة ثمود \"تسعة رهط\" أي تسعة نفر \"يفسدون فى الأرض ولا يصلحون\" وإنما غلب هؤلاء على أمر ثمود لأنهم كانوا كبراءهم ورؤساءهم قال العوفي عن ابن عباس: هؤلاء هم الذين عقروا الناقة أي الذي صدر ذلك عن رأيهم ومشورتهم قبحهم الله ولعنهم وقد فعل ذلك وقال السدي عن أبي مالك عن ابن عباس: كان أسماء هؤلاء التسعة دعمى ودعيم وهرما وهريم وداب وصواب ورياب ومسطع وقدار بن سالف عاقر الناقة أي الذي باشر ذلك بيده قال الله تعالى: \"فنادوا صاحبهم فتعاطى فعقر\" وقال تعالى \"إذ انبعث أشقاها\" وقال عبد الرزاق أنبأنا معمر بن ربيعة الصنعاني سمعت عطاء - هو ابن أبي رباح - يقول: \"وكان فى المدينة تسعة رهط يفسدون في الأرض ولا يصلحون\" قال كانوا يقرضون الدراهم يعني أنهم كانوا يأخذون منها وكأنهم كانوا يتعاملون بها عددا كما كان العرب يتعاملون وقال الإمام مالك عن يحيى بن سعيد عن سعيد بن المسيب أنه قال قطع الذهب والورق من الفساد في الأرض وفي الحديث الذي رواه أبو داود وغيره أن رسول الله صلى الله عليه وسلم نهى عن كسر سكة المسلمين الجائزة بينهم إلا من بأس والغرض أن هؤلاء الكفرة الفسقة كان من صفاتهم الإفساد في الأرض بكل طريق يقدرون عليها فمنها ما ذكره هؤلاء الأئمة وغير ذلك."
    },
    {
      "ayah": 49,
      "surah": 27,
      "text": "أي تحالفوا وتبايعوا على قتل نبي الله صالح عليه السلام من لقيه ليلا غيلة فكادهم الله وجعل الدائرة عليهم قال مجاهد تقاسموا وتحالفوا على هلاكه فلم يصلوا إليه حتى هلكوا وقومهم أجمعين."
    },
    {
      "ayah": 5,
      "surah": 27,
      "text": "\"أولئك الذين لهم سوء العذاب\" أي في الدنيا والآخرة \"وهم في الآخرة هم الأخسرون\" أى ليس يخسر أنفسهم وأموالهم سواهم من أهل المحشر."
    },
    {
      "ayah": 50,
      "surah": 27,
      "text": "قال قتادة تواثقوا على أن يأخذوه ليلا فيقتلوه وذكر لنا أنهم بينما هم معانيق إلى صالح ليفتكوا به إذ بعث الله عليهم صخرة فأهمدتهم."
    },
    {
      "ayah": 51,
      "surah": 27,
      "text": "قال العوفي عن ابن عباس: هم الذين عقروا الناقة قالوا حين عقروها لنبيتن صالحا وأهله فنقتله ثم نقول لأولياء صالح ما شهدنا من هذا شيئا وما لنا به من علم فدمرهم الله أجمعين."
    },
    {
      "ayah": 52,
      "surah": 27,
      "text": "قال محمد بن إسحاق قال هؤلاء التسعة بعد ما عقروا الناقة هلم فلنقتل صالح فإن كان صادقا عجلناه قبلنا وإن كان كاذبا كنا قد ألحقناه بناقته فأتوه ليلا ليبيتوه في أهله فدمغتهم الملائكة بالحجارة فلما أبطئوا على أصحابهم أتوا منزل صالح فوجدوهم منشدخين قد رضخوا بالحجارة فقالوا لصالح أنت قتلتهم ثم هموا به فقامت عشيرته دونه ولبسوا السلاح وقالوا لهم والله لا تقتلونه أبدا وقد وعدكم أن العذاب نازل بكم في ثلاث فإن كان صادق فلا تزيدوا ربكم عليكم غضبا وإن كان كاذبا فأنتم من وراء ما تريدون فانصرفوا عنهم ليلتهم تلك وقال عبد الرحمن بن أبي حاتم: لما عقروا الناقة قال لهم صالح \"تمتعوا في داركم ثلاثة أيام ذلك وعد غير مكذوب\" قالوا زعم صالح أنه يفرغ منا إلى ثلاثة أيام فنحن نفرغ منه وأهله قبل ثلاث وكان لصالح مسجد في الحجر عند شعب هناك يصلي فيه فخرجوا إلى كهف أي غار هناك ليلا فقالوا إذا جاء يصلي قتلناه ثم رجعنا إذا فرغنا منه إلى أهله ففرغنا منهم فبعث الله عليهم صخرة من الهضب حيالهم فخشوا أن تشدخهم فتبادروا فانطبقت عليهم الصخرة وهم في ذلك الغار فلا يدري قومهم أين هم ولا يدرون ما فعل بقومهم: فعذب الله هؤلاء ههنا وهؤلاء ههنا."
    },
    {
      "ayah": 53,
      "surah": 27,
      "text": "وأنجى الله صالحا ومن معه ثم قرأ \"ومكروا مكرا ومكرنا مكرا وهم لا يشعرون فانظر كيف كان عاقبة مكرهم أنا دمرناهم وقومهم أجمعين فتلك بيوتهم خاوية\" أي فارغة ليس فيها أحد \"بما ظلموا إن في ذلك لآية لقوم يعلمون وأنجينا الذين آمنوا وكانوا يتقون\"."
    },
    {
      "ayah": 54,
      "surah": 27,
      "text": "يخبر تعالى عن عبده ورسوله لوط عليه السلام أنه أنذر قومه نقمة الله بهم في فعلهم الفاحشة التي لم يسبقهم إليها أحد من بني آدم وهي إتيان الذكور دون الإناث وذلك فاحشة عظيمة استغنى الرجال بالرجال والنساء بالنساء فقال \"أتأتون الفاحشة وأنتم تبصرون\" أي يرى بعضكم بعضا."
    },
    {
      "ayah": 55,
      "surah": 27,
      "text": "أي لا تعرفون شيئا لا طبعا ولا شرعا كما قال فى الآية الأخرى \"أتأتون الذكران من العالمين وتذرون ما خلق لكم ربكم من أزواجكم بل أنتم قوم عادون\"."
    },
    {
      "ayah": 56,
      "surah": 27,
      "text": "أي يتحرجون من فعل ما تفعلونه ومن إقراركم على صنيعكم فأخرجوهم من بين أظهركم فإنهم لا يصلحون لمجاورتكم في بلادكم فعزموا على ذلك فدمر الله عليهم وللكافرين أمثالها."
    },
    {
      "ayah": 57,
      "surah": 27,
      "text": "أي من الهالكين مع قومها لأنها كانت ردءا لهم على دينهم وعلى طريقتهم في رضاها بأفعالهم القبيحة فكانت تدل قومها على ضيفان لوط ليأتوا إليهم لا أنها كانت تفعل الفواحش تكرمة لنبي الله صلى الله عليه وسلم لا كرامة لها."
    },
    {
      "ayah": 58,
      "surah": 27,
      "text": "أي حجارة من سجيل منضود مسومة عند ربك وما هي من الظالمين ببعيد ولهذا قال \"فساء مطر المنذرين\" أي الذين قامت عليهم الحجة ووصل إليهم الإنذار فخالفوا الرسول وكذبوه وهموا بإخراجه من بينهم."
    },
    {
      "ayah": 59,
      "surah": 27,
      "text": "يقول تعالى آمرا رسوله صلى الله عليه وسلم أن يقول \"الحمد لله\" أي على نعمه على عباده من النعم التي لا تعد ولا تحصى وعلى ما اتصف به من الصفات العلى والأسماء الحسنى وأن يسلم على عباد الله الذين اصطفاهم واختارهم وهم رسله وأنبياؤه الكرام عليهم من الله أفضل الصلاة والسلام هكذا قال عبد الرحمن بن زيد بن أسلم وغيره إن المراد بعباده الذين اصطفى هم الأنبياء قال وهو كقوله \"سبحان ربك رب العزة عما يصفون وسلام على المرسلين والحمد لله رب العالمين\" وقال الثوري والسدي هم أصحاب محمد صلى الله عليه وسلم ورضي عنهم أجمعين وروي نحوه عن ابن عباس أيضا ولا منافاة فإنهم إذا كانوا من عباد الله الذين اصطفى فالأنبياء بطريق الأولى والأخرى والقصد أن الله تعالى أمر رسوله ومن اتبعه بعد ذكره لهم ما فعل بأوليائه من النجاة والنصر والتأييد وما أحل بأعدائه من الخزي والنكال والقهر أن يحمدوه على جميع أفعاله وأن يسلموا على عباده المصطفين الأخيار وقد قال أبو بكر البزار حدثنا محمد بن عمارة بن صبيح حدثنا طلق بن غنام حدثنا الحكم بن ظهير عن السدي إن شاء الله عن أبي مالك عن ابن عباس \"وسلام على عباده الذين اصطفى\" قال هم أصحاب محمد صلى الله عليه وسلم اصطفاهم الله لنبيه رضي الله عنهم وقوله تعالى \"آلله خير أم ما يشركون\" استفهام إنكار على المشركين في عبادتهم مع الله آلهة أخرى."
    },
    {
      "ayah": 6,
      "surah": 27,
      "text": "أي \"وإنك\" يا محمد \"لتلقى\" أي لتأخذ \"القرآن من لدن حكيم عليم\" أي من عند حكيم عليم أي حكيم في أمره ونهيه عليم بالأمور جليلها وحقرها فخبره هو الصدق المحض وحكمه هو العدل التام كما قال تعالى: \"وتمت كلمة ربك صدقا وعدلا\"."
    },
    {
      "ayah": 60,
      "surah": 27,
      "text": "\"أمن خلق السموات\" أي خلق تلك السموات في ارتفاعها وصفائها وما جعل فيها من الكواكب النيرة والنجوم الزاهرة والأفلاك الدائرة وخلق الأرض في استفالها وكثافتها وما جعل فيها من الجبال والأطواد والسهول والأوعار والفيافي والقفار والزروع والأشجار والثمار والبحار والحيوان على اختلاف الأصناف والأشكال والألوان وغير ذلك وقوله تعالى: \"وأنزل لكم من السماء ماء\" أي جعله رزقا للعباد \"فأنبتنا به حدائق\" أي بساتين \"ذات بهجة\" أي منظر حسن وشكل حسن وشكل بهي \"ما كان لكم أن تنبتوا شجرها\" أي لم تكونوا تقدرون على إنبات أشجارها وإنما يقدر على ذلك الخالق الرازق المستقل بذلك المتفرد به دون ما سواه من الأصنام والأنداد كما اعترف به هؤلاء المشركون كما قال تعالى في الآية الأخرى \"ولئن سألتهم من خلقهم ليقولن الله\" \"ولئن سألتهم من نزل من السماء ماء فأحيا به الأرض من بعد موتها ليقولن الله\" أي هم معترفون بأنه الفاعل لجميع ذلك وحده لا شريك له ثم هم يعبدون معه غيره مما يعترفون أنه لا يخلق ولا يرزق وإنما يستحق أن يفرد بالعبادة من هو المتفرد بالخلق والرزق ولهذا قال تعالى:\"أإله مع الله\"؟ أي أإله مع الله يعبد وقد تبين لكم ولكل ذي لب مما يعترفون به أيضا أنه الخالق الرازق ومن المفسرين من يقول معنى قوله: \"أإله مع الله\" فعل هذا وهو يرجع إلى معنى الأول لأن تقدير الجواب أنهم يقولون ليس ثم أحد فعل هذا معه بل هو المتفرد به فيقال فكيف تعبدون معه غيره وهو المستقل المتفرد بالخلق والرزق والتدبير؟ كما قال تعالى \"أفمن يخلق كمن لا يخلق\" الآية وقوله تعالى ههنا \"أمن خلق السموات والأرض\" \"أمن\" في هذه الآيات كلها تقديره أمن يفعل هذه الأشياء كمن لا يقدر على شيء منها؟ هذا معنى السياق وإن لم يذكر الآخر لأن في قوة الكلام ما يرشد إلى ذلك وقد قال الله تعالى \"آلله خير أم ما يشركون\" ثم قال في الآية الأخرى \"بل هم قوم يعدلون\" أى يجعلون لله عدلا ونظيرا وهكذا قال تعالى \"أمن هو قانت آناء الليل ساجدا وقائما يحذر الآخرة ويرجو رحمة ربه\" أي أمن هو هكذا كمن ليس كذلك؟ ولهذا قال تعالى: \"قل هل يستوي الذين يعلمون والذين لا يعلمون إنما يتذكر أولوا الألباب\" \"أفمن شرح الله صدره للإسلام فهو على نور من ربه فويل للقاسية قلوبهم من ذكر الله أولئك في ضلال مبين\" وقال تعالى \"أمن هو قائم على كل نقس بما كسبت\" أي أمن هو شهيد على أفعال الخلق حركاتهم وسكناتهم يعلم الغيب جليله وحقيره كمن هو لا يعلم ولا يسمع ولا يبصر من هذه الأصنام التي عبدوها من دون الله؟ ولهذا قال \"وجعلوا لله شركاء قل سموهم\" وهكذا هذه الآيات الكريمات كلها."
    },
    {
      "ayah": 61,
      "surah": 27,
      "text": "\"أمن جعل الأرض قرارا\" أي قارة ساكنة ثابتة لا تميد ولا تتحرك بأهلها ولا ترجف بهم فإنها لو كانت كذلك لما طاب عليها العيش والحياة بل جعلها من فضله ورحمته مهادا بساطا ثابتة لا تتزلزل ولا تتحرك كما قال تعالى في الآية الأخرى \"الله الذي جعل لكم الأرض قرارا والسماء بناء\" \"وجعل خلالها أنهارا\" أى جعل فيها الأنهار العذبة الطيبة شقها في خلالها وصرفها فيها ما بين أنهار كبار وصغار وبين ذلك وسيرها شرقا وغربا وجنوبا وشمالا بحسب مصالح عباده في أقاليمهم وأقطارهم حيث ذرأهم في أرجاء الأرض وسير لهم أرزاقهم بحسب ما يحتاجون إليه \"وجعل لها رواسي\" أى جبالا شامخة ترسي الأرض وتثبتها لئلا تميد بكم \"وجعل بين البحرين حاجزا\" أي جعل بين المياه العذبة والمالحة حاجزا أي مانعا يمنعها من الإختلاط لئلا يفسد هذا بهذا وهذا بهذا فإن الحكمة الإلهية تقتضي بقاء كل منهما على صفته المقصودة منه فإن البحر الحلو هو هذه الأنهار السارحة الجارية بين الناس والمقصود منها أن تكون عذبة زلالا يسقي الحيوان والنبات والثمار منها والبحار المالحة هي المحيطة بالأرجاء والأقطار من كل جانب والمقصود منها أن يكون ماؤها ملحا أجاجا لئلا يفسد الهواء بريحها كما قال تعالى: \"وهو الذي مرج البحرين هذا عذب فرات وهذا ملح أجاج وجعل بينهما برزخا وحجرا محجورا\" ولهذا قال تعالى: \"أإله مع الله\"؟ أي فعل هذا أو يعبد على القول الأول والآخر؟ وكلاهما متلازم صحيح \"بل أكثرهم لا يعلمون\" أي في عبادتهم غيره."
    },
    {
      "ayah": 62,
      "surah": 27,
      "text": "ينبه تعالى أنه هو المدعو عند الشدائد المرجو عند النوازل كما قال تعالى: \"وإذا مسكم الضر في البحر ضل من تدعون إلا إياه\" وقال تعالى: \"ثم إذا مسكم الضر فإليه تجأرون\" وهكذا قال ههنا \"أمن يجيب المضطر إذا دعاه\" أي من هو الذي لا يلجأ المضطر إلا إليه والذي لا يكشف ضر المضرورين سواه قال الإمام أحمد أنبأنا عفان أنبأنا وهيب أنبأنا خالد الحذاء عن أبي تميمة الهجيمي عن رجل من بلهجيم قال قلت يا رسول الله إلام تدعو؟ قال \"أدعو إلى الله وحده الذي إن مسك ضر فدعوته كشف عنك والذي إن أضللت بأرض قفر فدعوته رد عليك والذي إن أصابتك سنة فدعوته أنبت لك\" قال قلت أوصني قال \"لا تسبن أحدا ولا تزهدن في المعروف ولو أن تلقى أخاك وأنت منبسط إليه وجهك ولو أن تفرغ من دلوك في إناء المستقي واتزر إلى نصف الساق فإن أبيت فإلى الكعبين وإياك وإسبال الإزار فإن إسبال الإزار من المخيلة وإن الله لا يحب المخيلة\" وقد رواه الإمام أحمد من وجه آخر فذكر اسم الصحابي فقال: حدثنا عفان حدثنا حماد بن سلمة حدثنا يونس هو ابن عبيد حدثنا عبيدة الهجيمي عن أبيه عن أبي تميمة الهجيمي عن جابر بن سليم الهجيمي قال: أتيت رسول الله صلى الله عليه وسلم وهو محتب بشملة وقد وقع هدبها على قدميه فقلت أيكم محمد رسول الله؟ فأومأ بيده إلى نفسه فقلت يا رسول الله أنا من أهل البادية وفي جفاؤهم فأوصني قال \"لا تحقرن من المعروف شيئا ولو أن تلقى أخاك ووجهك منبسط ولو أن تفرغ من دلوك في إناء المستقي وإن امرؤ شتمك بما يعلم فيك فلا تشتمه بما تعلم فيه فإنه يكون لك أجره وعليه وزره وإياك وإسبال الإزار فإن إسبال الإزار من المخيلة وإن الله لا يحب المخيلة ولا تسبن أحدا\" قال فما سببت بعده أحدا ولا شاة ولا بعيرا وقد روى أبو داود والنسائي لهذا الحديث طرقا وعندهما طرف صالح منه وقال ابن أبي حاتم حدثنا أبي حدثنا علي بن هشام حدثنا عبدة بن نوح عن عمر بن الحجاج عن عبيد الله بن أبي صالح قال: دخل علي طاوس يعودني فقلت له ادع الله لي يا أبا عبد الرحمن فقال ادع لنفسك فإنه يجيب المضطر إذا دعاه وقال وهب بن منبه قرأت في الكتاب الأول إن الله تعالى يقول: بعزتي إنه من اعتصم بي فإن كادته السموات بمن فيهن والأرض بمن فيهن فإني أجعل له من بين ذلك مخرجا ومن لم يعتصم بي فإني أخسف به من تحت قدميه الأرض فأجعله في الهواء فأكله إلى نفسه وذكر الحافظ ابن عساكر في ترجمة رجل حكى عنه أبو بكر محمد بن داود الدينوري المعروف بالدقي الصوفي قال هذا الرجل كنت أكاري على بغل لي من دمشق إلى بلد الزبداني فركب معي ذات مرة رجل فمررنا على بعض الطريق عن طريق غير مسلوكة فقال لي خذ في هذه فإنها أقرب فقلت لا خيرة لي فيها فقال بل هى أقرب فسلكناها فانتهينا إلى مكان وعر وواد عميق وفيه قتلى كثيرة فقال لي امسك رأس البغل حتى أنزل فنزل وتشمر وجمع عليه ثيابه وسل سكينا معه وقصدني ففررت من بين يديه وتبعني فناشدته الله وقلت خذ البغل بما عليه فقال هو لي وإنما أريد قتلك فخوفته الله والعقوبة فلم يقبل فاستسلمت بين يديه وقلت إن رأيت أن تتركني حتى أصلي ركعتين فقال عجل فقمت أصلي فأرتج علي القرآن فلم يحضرني منه حرف واحد فبقيت واقفا متحيرا وهو يقول هيه افرغ فأجرى الله على لساني قوله تعالى: \"أمن يجيب المضطر إذا دعاه ويكشف السوء\" فإذا أنا بفارس قد أقبل من فم الوادي وبيده حربة فرمى بها الرجل فما أخطأت فؤاده فخر صريعا فتعلقت بالفارس وقلت بالله من أنت؟ فقال أنا رسول الذي يجيب المضطر إذا دعاه ويكشف السوء قال فأخذت البغل والحمل ورجعت سالما وذكر في ترجمة فاطمة بنت الحسن أم أحمد العجيلة قالت هزم الكفار يوما المسلمين في غزاة فوقف جواد جيد بصاحبه وكان من ذوي اليسار ومن الصلحاء فقال للجواد مالك ويلك إنما كنت أعدك لمثل هذا اليوم فقال له الجواد ومالي لا أقصر وأنت تكل العلوفة إلى السواس فيظلمونني ولا يطعمونني إلا القليل؟ فقال لك علي عهد الله أني لا أعلفك بعد هذا اليوم إلا في حجري فجرى الجواد عند ذلك ونجى صاحبه وكان لا يعلفه بعد ذلك إلا في حجره واشتهر أمره بين الناس وجعلوا يقصدونه ليسمعوا منه ذلك وبلغ ملك الروم أمره فقال ما تضام بلدة يكون هذا الرجل فيها واحتال ليحصله في بلده فبعث إليه رجلا من المرتدين عنده فلما انتهى إليه أظهر له أنه قد حسنت نيته في الإسلام وقومه حتى استوثق ثم خرجا يوما يمشيان على جنب الساحل وقد واعد شخصا آخر من جهة ملك الروم ليتساعدا على أسره فلما اكتنفاه ليأخذاه رفع طرفه إلى السماء وقال اللهم إنه إنما خدعني بك فاكفنيهما بما شئت قال فخرج سبعان فأخذاهما ورجع الرجل سالما وقوله تعالى: \"ويجعلكم خلفاء الأرض\" أي يخلف قرنا لقرن قبلهم وخلفا لسلف كما قال تعالى: \"إن يشأ يذهبكم ويستخلف من بعدكم ما يشاء كما أنشأكم من ذرية قوم آخرين\" وقال تعالى \"وهو الذي جعلكم خلائف الأرض ورفع بعضكم فوق بعض درجات\" وقال تعالى: \"وإذ قال ربك للملائكة إني جاعل فى الأرض خليفة\" أي قوما يخلف بعضهم بعضا كما قدمنا تقريره وهكذا هذه الآية \"ويجعلكم خلفاء الأرض\" أي أمة بعد أمة وجيلا بعد جيل وقوما بعد قوم ولو شاء لأوجدهم كلهم في وقت واحد ولم يجعل بعضهم من ذرية بعض بل لو شاء لخلقهم كلهم أجمعين كما خلق آدم من تراب ولو شاء أن يجعلهم بعضهم من ذرية بعض ولكن لا يميت أحدا حتى تكون وفاة الجميع في وقت واحد لكانت تضيق عنهم الأرض وتضيق عليهم معايشهم وأكسابهم ويتضرر بعضهم ببعض ولكن اقتضت حكمته وقدرته أن يخلقهم من نفس واحدة ثم يكثرهم غاية الكثرة ويذرأهم في الأرض ويجعلهم قرون بعد قرون وأمما بعد أمم حتى ينقضي الأجل وتفرغ البرية كما قدر ذلك تبارك وتعالى وكما أحصاهم وعدهم عدا ثم يقيم القيامة ويوفي كل عامل عمله إذا بلغ الكتاب أجله ولهذا قال تعالى: \"أمن يجيب المضطر إذا دعاه ويكشف السوء ويجعلكم خلفاء الأرض أإله مع الله\" أي يقدر على ذلك أو أإله مع الله يعبد؟ وقد علم أن الله هو المتفرد بفعل ذلك وحده لا شريك له؟ \" قليلا ما تذكرون\" أي ما أقل تذكرهم فيما يرشدهم إلى الحق ويهديهم إلى الصراط المستقيم."
    },
    {
      "ayah": 63,
      "surah": 27,
      "text": "\"أمن يهديكم في ظلمات البر والبحر\" أي بما خلق من الدلائل السماوية والأرضية كما قال تعالى \"وعلامات وبالنجم هم يهتدون\" وقال تعالى \"وهو الذي جعل لكم النجوم لتهتدوا بها في ظلمات البر والبحر\" الآية \"ومن يرسل الرياح بشرا بين يدي رحمته\" أي بين يدي السحاب الذي فيه مطر يغيث الله به عباده المجدبين الأزلين القنطين \"أإله مع الله تعالى الله عما يشركون\"."
    },
    {
      "ayah": 64,
      "surah": 27,
      "text": "أي هو الذي بقدرته وسلطانه يبدأ الخلق ثم يعيده كما قال تعالى في الآية الأخرى \"إن بطش ربك لشديد إنه هو يبدئ ويعيد\" وقال تعالى: \"وهو الذي يبدأ الخلق ثم يعيده وهو أهون عليه\" \"ومن يرزقكم من السماء والأرض\" أي بما ينزل من مطر السماء وينبت من بركات الأرضي كما قال تعالى \"والسماء ذات الرجع والأرض ذات الصدع\" وقال تعالى \"يعلم ما يلج في الأرض وما يخرج منها وما ينزل من السماء وما يعرج فيها\" فهو تبارك وتعالى ينزل من السماء ماء مبارك فيسلكه ينابيع في الأرض ثم يخرج به منها أنواع الزروع والثمار والأزاهير وغير ذلك من ألوان شتى \"كلوا وارعوا أنعامكم إن في ذلك لآيات لأولي النهى\" ولهذا قال تعالى \"أإله مع الله\" أي فعل هذا وعلى القول الآخر بعد هذا \"قل هاتوا برهانكم\" على صحة ما تدعونه من عبادة آلهة أخرى \"إن كنتم صادقين\" في ذلك وقد علم أنه لاحجة لهم ولا برهان كما قال تعالى \"ومن يدع مع الله إلها آخر لا برهان له به فإنما حسابه عند ربه إنه لا يفلح الكافرون\"."
    },
    {
      "ayah": 65,
      "surah": 27,
      "text": "يقول تعالى آمرا رسوله صلى الله عليه وأن يقول معلما لجميع الخلق أنه لا يعلم أحد من أهل السموات والأرض الغيب إلا الله وقوله تعالى: \"إلا الله\" استثناء منقطع أي لا يعلم أحد ذلك إلا الله عز وجل فإنه المنفرد بذلك وحده لا شريك له كما قال تعالى: \"وعنده مفاتح الغيب لا يعلمها إلا هو\" الآية وقال تعالى: \"إن الله عنده علم الساعة وينزل الغيث\" إلى آخر السورة والآيات في هذا كثيرة وقوله تعالى: \"وما يشعرون أيان يبعثون\" أي وما يشعر الخلائق الساكنون فى السموات والأرض بوقت الساعة كما قال تعالى \"ثقلت في السموات والأرض لا تأتيكم إلا بغتة\" أي ثقل علمها على أهل السموات والأرض وقال ابن أبي حاتم حدثنا أبي حدثنا على بن الجعد حدثنا أبو جعفر الرازي عن داود بن أبي هند عن الشعبي عن مسروق عن عائشة رضي الله عنها قالت من زعم أنه يعلم - يعني النبي صلى الله عليه وسلم- ما يكون في غد فقد أعظم على الله الفرية لأن الله تعالى يقول \"قل لا يعلم من في السموات والأرض الغيب إلا الله\" وقال قتادة إنما جعل الله هذه النجوم لثلاث خصال جعلها زينة للسماء وجعلها يهتدى بها وجعلها رجوما للشياطين فمن تعاطى فيها غير ذلك فقد قال برأيه وأخطأ حظه وأضاع نصيبه وتكلف ما لا علم له به وإن أناسا جهلة بأمر الله قد أحدثوا من هذه النجوم كهانة من أعرس بنجم كذا وكذا كان كذا وكذا ومن سافر بنجم كذا وكذا كان كذا وكذا ومن ولد بنجم كذا وكذا كان كذا وكذا ولعمري ما من نجم إلا يولد به الأحمر والأسود والقصير والطويل والحسن والدميم وما علم هذا النجم وهذه الدابة وهذا الطير بشيء من الغيب وقضى الله تعالى أنه \"لا يعلم من في السموات والأرض الغيب إلا الله وما يشعرون أيان يبعثون\" رواه ابن أبي حاتم عنه بحروفه وهو كلام جليل متين صحيح."
    },
    {
      "ayah": 66,
      "surah": 27,
      "text": "أي انتهى علمهم وعجز عن معرفة وقتها وقرأ آخرون \"بل أدرك علمهم\" أي تساوى علمهم في ذلك كما فى الصحيح لمسلم أن رسول الله صلى الله عليه وسلم قال لجبريل وقد سأله عن وقت الساعة \"ما المسئول عنها بأعلم من السائل\" أي تساوى في العجز عن درك ذلك علم المسئول والسائل قال علي بن أبي طلحة عن ابن عباس \"بل ادارك علمهم في الآخرة\" أي غاب وقال قتادة \"بل ادارك علمهم في الآخرة\" يعني بجهلهم بربهم يقول لم ينفذ لهم علم في الآخرة هذا قول وقال ابن جريج عن عطاء الخراساني عن ابن عباس \"بل ادارك علمهم في الآخرة\" حين لم ينفع العلم وبه قال عطاء الخراساني والسدي أن علمهم إنما يدرك ويكمل يوم القيامة حيث لا ينفعهم ذلك كما قال تعالى \"أسمع بهم وأبصر يوم يأتوننا لكن الظالمون اليوم في ضلال مبين\" وقال سفيان عن عمرو بن عبيد عن الحسن أنه كان يقرأ \"بل أدرك علمهم\" قال اضمحل علمهم في الدنيا حين عاينوا الآخرة وقوله تعالى \"بل هم في شك منها\" عائد على الجنس والمراد الكافرون كما قال تعالى \"وعرضوا على ربك صفا لقد جئتمونا كما خلقناكم أول مرة بل زعمتم أن لن نجعل لكم موعدا\" أى الكافرون منكم وهكذا قال ههنا \"بل هم في شك منها\" أي شاكون فى وجودها ووقوعها \"بل هم منها عمون\" أي في عماية وجهل كبير في أمرها وشأنها."
    },
    {
      "ayah": 67,
      "surah": 27,
      "text": "يقول تعالى مخبرا عن منكري البعث من المشركين أنهم استبعدوا إعادة الأجساد بعد صيرورتها عظاما ورفاتا وترابا."
    },
    {
      "ayah": 68,
      "surah": 27,
      "text": "أى ما زلنا نسمع بهذا نحن وآباؤنا ولا نرى له حقيقة ولا وقوعا وقولهم \"إن هذا إلا أساطير الأولين\" يعنون ما هذا الوعد بإعادة الأبدان \"إلا أساطير الأولين\" أي أخذه قوم عمن قبلهم من كتب يتلقاه بعض عن بعض وليس له حقيقة."
    },
    {
      "ayah": 69,
      "surah": 27,
      "text": "\"قل\" يا محمد لهؤلاء \"سيروا في الأرض انظروا كيف كان عاقبة المجرمين\" أي المكذبين بالرسل وبما جاءوهم به من أمر المعاد وغيره كيف حلت بهم نقمة الله وعذابه ونكاله ونجى الله من بينهم رسله الكرام ومن اتبعهم من المؤمنين فدل ذلك على صدق ما جاءت به الرسل وصحته."
    },
    {
      "ayah": 7,
      "surah": 27,
      "text": "يقول تعالى لرسوله محمد مذكرا له ما كان من أمر موسى عليه السلام كيف اصطفاه الله وكلمه وناجاه وأعطاه من الآيات العظيمة الباهرة والأدلة القاهرة وابتعثه إلى فرعون وملئه فجحدوا بها وكفروا واستكبروا من اتباعه والانقياد له فقال تعالى: \"إذ قال موسى لأهله\" أي اذكر حين سار موسى بأهله فأضل الطريق وذلك في ليل وظلام فآنس من جانب الطور نارا أي رأى نارا تأجج وتضطرم فقال \"لأهله إني آنست نارا سآتيكم منها بخبر\" أى الطريق \"أو آتيكم منها بشهاب قبس لعلكم تصطلون\" أي تستدفئون به وكان كما قال فإنه رجع منها بخبر عظيم واقتبس منها نورا عظيم."
    },
    {
      "ayah": 70,
      "surah": 27,
      "text": "ثم قال تعالى مسليا لنبيه صلى الله عليه وسلم \"ولا تحزن عليهم\" أي المكذبين بما جئت به ولا تأسف عليهم وتذهب نفسك عليهم حسرات \"ولا تكن في ضيق مما يمكرون\" أي في كيدك ورد ما جئت به فإن الله مؤيدك وناصرك ومظهر دينك على من خالفه وعانده في المشارق والمغارب."
    },
    {
      "ayah": 71,
      "surah": 27,
      "text": "يقول تعالى مخبرا عن المشركين في سؤالهم عن يوم القيامة واستبعادهم وقوع ذلك \"ويقولون متى هذا الوعد إن كنتم صادقين\"."
    },
    {
      "ayah": 72,
      "surah": 27,
      "text": "\"قل\" يا محمد \"عسى أن يكون ردف لكم بعض الذي تستعجلون\" قال ابن عباس أن يكون قرب أو أن يقرب لكم بعض الذي تستعجلون وهكذا قال مجاهد والضحاك وعطاء الخراساني وقتادة والسدي وهذا هو المراد بقوله تعالى \"ويقولون متى هو قل عسى أن يكون قريبا\" وقال تعالى \"ويستعجلونك بالعذاب وإن جهنم لمحيطة بالكافرين\" وإنما دخلت اللام في قوله \"ردف لكم\" لأنه ضمن معنى عجل لكم كما قال مجاهد في رواية عنه \"عسى أن يكون ردف لكم\" عجل لكم."
    },
    {
      "ayah": 73,
      "surah": 27,
      "text": "أي في إسباغه نعمه عليهم مع ظلمهم لأنفسهم وهم مع ذلك لا يشكرونه على ذلك إلا القليل منهم."
    },
    {
      "ayah": 74,
      "surah": 27,
      "text": "أي يعلم الضمائر والسرائر كما يعلم الظواهر \"سواء منكم من أسر القول ومن جهر به\" \"يعلم السر وأخفى\" \"ألا حين يستغشون ثيابهم يعلم ما يسرون وما يعلنون\" ثم أخبر تعالى بأنه عالم غيب السموات والأرض وأنه عالم الغيب والشهادة وهو مـا غاب عن العباد وما شاهدوه."
    },
    {
      "ayah": 75,
      "surah": 27,
      "text": "فقال تعالى \"وما من غائبة\" قال ابن عباس يعني وما من شي \"في السماء والأرض إلا في كتاب مبين\" وهذه كقوله \"ألم تعلم أن الله يعلم ما في السماء والأرض إن ذلك في كتاب إن ذلك على الله يسير\"."
    },
    {
      "ayah": 76,
      "surah": 27,
      "text": "يقول تعالى مخبرا عن كتابه العزيز وما اشتمل عليه من الهدى والبيان والفرقان أنه يقص على بني إسرائيل وهم حملة التوراة والإنجيل \"أكثر الذي هم فيه يختلفون\" كاختلافهم في عيسى وتباينهم فيه فاليهود افتروا والنصارى غلوا فجاء القرآن بالقول الوسط الحق العدل أنه عبد من عباد الله وأنبيائه ورسله الكرام عليه أفضل الصلاة والسلام كما قال تعالى \"ذلك عيسى ابن مريم قول الحق الذي فيه يمترون\"."
    },
    { "ayah": 77, "surah": 27, "text": "أي هدى لقلوب المؤمنين به ورحمة لهم في العمليات." },
    {
      "ayah": 78,
      "surah": 27,
      "text": "\"إن ربك يقضي بينهم\" أي يوم القيامة \"بحكمه وهو العزيز\" أي في انتقامه \"العليم\" بأفعال عباده وأقوالهم."
    },
    {
      "ayah": 79,
      "surah": 27,
      "text": "\"فتوكل على الله\" أي فى جميع أمورك وبلغ رسالة ربك \"إنك على الحق المبين\" أي أنت على الحق المبين وإن خالفك من خالفك ممن كتبت عليه الشقاوة \"حقت عليهم كلمة ربك أنهم لا يؤمنون ولو جاءتهم كل آية\"."
    },
    {
      "ayah": 8,
      "surah": 27,
      "text": "فلما أتاها ورأى منظرا هائلا عظيما حيث انتهى إليها والنار تضطرم في شجرة خضراء لا تزداد النار إلا توقدا ولا تزداد الشجرة إلا خضرة ونضرة ثم رفع رأسه فإذا نورها متصل بعنان السماء قال ابن عباس وغيره لم تكن نارا وإنما كانت نورا يتوهج وفي رواية عن ابن عباس نور رب العالمين فوقف موسى متعجبا مما رأى \"فنودي أن بورك من في النار\" قال ابن عباس تقدس \"ومن حولها\" أي من الملائكة قاله ابن عباس وعكرمة وسعيد بن جبير والحسن وقتادة وقال ابن أبي حاتم حدثنا يونس بن حبيب حدثنا أبو داود هو الطيالسي حدثنا شعبة والمسعودي عن عمرو بن مرة سمع أبا عبيدة يحدث عن أبي موسى رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم \"إن الله لا ينام ولا ينبغي له أن ينام يخفض القسط ويرفعه يرفع إليه عمل الليل قبل النهار وعمل النهار قبل الليل\" زاد المسعودي \"وحجابه النور أو النار لو كشفه لأحرقت سبحات وجهه كل شيء أدركه بصره\" ثم قرأ أبو عبيدة \"أن بورك من في النار ومن حولها\" وأصل الحديث مخرج في صحيح مسلم من حديث عمرو بن مرة وقوله تعالى: \"وسبحان الله رب العالمين\" أي الذي يفعل ما يشاء ولا يشبهه شيء من مخلوقاته ولا يحيط به شيء من مصنوعاته وهو العلي العظيم المباين لجميع المخلوقات لا يكتنفه الأرض والسموات بل هو الأحد الصمد المنزه عن مماثلة المحدثات."
    },
    { "ayah": 80, "surah": 27, "text": "أي لا تسمعهم شيئا ينفعهم فكذلك هؤلاء على قلوبهم غشاوة وفي آذانهم وقر الكفر." },
    {
      "ayah": 81,
      "surah": 27,
      "text": "أي إنما يستجيب لك من هو سميع بصير السمع والبصر النافع في القلب والبصيرة الخاضع لله ولما جاء عنه على ألسنة الرسل."
    },
    {
      "ayah": 82,
      "surah": 27,
      "text": "هذه الدابة تخرج في آخر الزمان عند فساد الناس وتركهم أوامر الله وتبديلهم الدين الحق يخرج الله لهم دابة من الأرض قيل من مكة وقيل من غيرها كما سيأتي تفصيله إن شاء الله تعالى فتكلم الناس على ذلك قال ابن عباس والحسن وقتادة ويروى عن علي رضي الله عنه تكلمهم كلاما أي تخاطبهم مخاطبة وقال عطاء الخراساني تكلمهم فتقول لهم إن الناس كانوا بآياتنا لا يوقنون ويروى هذا عن علي واختاره ابن جرير وفي هذا القول نظر لا يخفى والله أعلم وقال ابن عباس في رواية تجرحهم وعنه رواية قال كلا تفعل يعني هذا وهذا وهو قول حسن ولا منافاة والله أعلم وقد ورد في ذكر الدابة أحاديث وآثار كثيرة فلنذكر منها ما تيسر وبالله المستعان قال الإمام أحمد حدثنا سفيان عن فرات عن أبي الطفيل عن حذيفة بن أسيد الغفاري قال أشرف علينا رسول الله صلى الله عليه وسلم من غرفة ونحن نتذاكر أمر الساعة فقال \"لا تقوم الساعة حتى تروا عشر آيات طلوع الشمس من مغربها والدخان والدابة وخروج يأجوج ومأجوج وخروج عيسى ابن مريم عليه السلام والدجال وثلاثة خسوف خسف بالمغرب وخسف بالمشرق وخسف بجزيرة العرب ونار تخرج من قعر عدن تسوق أو تحشر الناس تبيت معهم حيث باتوا وتقيل معهم حيث قالوا\" وهكذا رواه مسلم وأهل السنن من طرق عن فرات القزاز عن أبي الطفيل عامر بن واثلة عن حذيفة مرفوعا وقال الترمذي حسن صحيح ورواه مسلم أيضا من حديث عبد العزيز بن رفيع عن أبي الطفيل عنه موقوفا فالله أعلم \"طريق أخرى\" قال أبو داود الطيالسي عن طلحة بن عمرو وجرير بن حازم فأما طلحة فقال أخبرني عبدالله ابن عبيدالله بن عمير الليثي أن أبا الطفيل حدثه عن حذيفة بن أسيد الغفاري أبي سريحة وأما جرير فقال عن عبدالله بن عبيد عن رجل من آل عبدالله بن مسعود وحديث طلحة أتم وأحسن قال ذكر رسول الله صلى الله عليه وسلم الدابة فقال \"لها ثلاث خرجات من الدهر فتخرج خرجة من أقصى البادية ولا يدخل ذكرها القرية - يعني مكة - ثم تكمن زمنا طويلا ثم تخرج خرجة أخرى دون تلك فيعلو ذكرها في أهل البادية ويدخل ذكرها القريةـ يعني مكة - قال رسول الله صلى الله عليه وسلم ثم بينما الناس في أعظم المساجد على الله حرمة وأكرمها المسجد الحرام لم يرعهم إلا وهي ترغو بين الركن والمقام تنفض عن رأسها التراب فارفض الناس عنها شتى ومعا وبقيت عصابة من المؤمنين وعرفوا أنهم لم يعجزوا الله فبدأت بهم فجلت وجوههم حتى جعلتها كأنها الكوكب الدري وولت في الأرض لا يدركها طالب ولا ينجو منها هارب حتى إن الرجل ليتعوذ منها بالصلاة فتأتيه من خلفه فتقول يا فلان الآن تصلي فيقبل عليها فتسمه في وجهه ثم تنطلق ويشترك الناس في الأموال ويصطحبون في الأمصار يعرف المؤمن من الكافر حتى إن المؤمن ليقول يا كافر اقضني حقي وحتى إن الكافر ليقول يا مؤمن اقضني حقي\" ورواه ابن جرير من طريقين عن حذيفة ابن أسيد موقوفا والله أعلم ورواه من رواية حذيفة بن اليمان مرفوعا وان ذلك في زمان عيسى ابن مريم وهو يطوف بالبيت ولكن إسناده لا يصح \"حديث آخر\" قال مسلم بن الحجاج حدثنا أبو بكر بن أبي شيبة حدثنا محمد بن بشر سمعت النبي صلى الله عليه وسلم يقول \"إن أول الآيات خروجا طلوع الشمس من مغربها وخروج الدابة على الناس ضحى وأيتهما كانت قبل صاحبتها فالأخرى على أثرها قريبا\" \"حديث آخر\" روى مسلم في صحيحه من حديث العلاء بن عبد الرحمن بن يعقوب مولى الحرقة عن أبيه عن أبي هريرة \" أن رسول الله صلى الله عليه وسلم قال \"بادروا بالأعمال سته طلوع الشمس من مغربها والدخان والدجال والدابة وخاصة أحدكم وأمر العامة\" تفرد به وله من حديث قتادة عن الحسن عن زياد بن رباح عن أبي هريرة رضي الله عنه عن النبي صلى الله عليه وسلم قال \"بادروا بالأعمال ستا الدجال والدخان ودابة الأرض وطلوع الشمس من مغربها وأمر العامة وخويصة أحدكم\" \"حديث آخر\" قال ابن ماجه حدثنا حرملة بن يحيى حدثنا ابن وهب أخبرني عمرو بن الحارث وابن لهيعة عن يزيد بن أبي حبيب عن سنان بن سعيد عن أنس بن مالك عن رسول الله صلى الله عليه وسلم قال \"بادروا بالأعمال ستا طلوع الشمس من مغربها والدخان والدابة والدجال وخويصة أحدكم وأمر العامة\" تفرد به \"حديث آخر\" قال أبو داود الطيالسي حدثنا حماد ابن سلمة عن علي بن زيد عن أويس بن خالد عن أبي هريرة رضي الله عنه قال قال رسول الله صلى الله عليه وسلم \"تخرج دابة الأرض ومعها عصا موسى وخاتم سليمان عليهما السلام فتحطم أنف الكافر بالعصا وتجلي وجه المؤمن بالخاتم حتى يجتمع الناس على الخوان يعرف المؤمن من الكافر\" ورواه الإمام أحمد عن بهز وعفان ويزيد بن هارون ثلاثتهم عن حماد بن سلمة به وقال \"فتحطم أنف الكافر بالخاتم وتجلو وجه المؤمن بالعصا حتى إن أهل الخوان الواحد ليجتمعون فيقول هذا يا مؤمن ويقول هذا يا كافر\" ورواه ابن ماجه عن أبي بكر بن أبي شيبة عن يونس ابن محمد المؤدب عن حماد بن سلمة به \"حديث آخر\" قال ابن ماجه حدثنا أبو غسان محمد بن عمرو وحدثنا أبو نميلة حدثنا خالد بن عبيد حدثنا عبدالله بن بريدة عن أبيه قال ذهب بي ورسول الله صلى الله عليه وسلم إلى موضع بالبادية قريب من مكة فإذا أرض يابسة حولها رمل فقال رسول الله صلى الله عليه وسلم \"تخرج الدابة من هذا الموضع فإذا فتر في شبر قال ابن بريدة فحججت بعد ذلك بسنين فأرانا عصا له فإذا هو بعصاي هذه كذا وكذا وقال عبد الرزاق أخبرنا معمر عن قتادة أن ابن عباس قال: هي دابة ذات زغب لها أربع قوائم تخرج من بعض أودية تهامة وقال ابن أبي حاتم حدثنا أبي حدثنا عبدالله بن رجاء حدثنا فضيل بن مرزوق عن عطية قال قال عبدالله تخرج الدابة من صدع من الصفا كجري الفرس ثلاثة أيام لم يخرج ثلثها وقال محمد بن إسحاق عن أبان بن صالح قال سئل عبدالله ابن عمرو عن الدابة فقال الدابة تخرج من تحت صخرة بجياد والله لو كنت معهم أو لو شئت بعصاي الصخرة التي تخرج الدابة من تحتها قيل فتصنع ماذا يا عبدالله بن عمرو فقال تستقبل المشرق فتصرخ صرخة تنفذه ثم تستقبل الشام فتصرخ صرخة تنفذه ثم تستقبل المغرب فتصرخ صرخة تنفذه ثم تستقبل اليمن فتصرخ صرخة تنفذه ثم تروح من مكة فتصبح بعسفان قيل ثم ماذا قال ثم لا أعلم وعن عبدالله بن عمر أنه قال تخرج الدابة ليلة جمع رواه ابن أبي حاتم وفي إسناده ابن البيلمان وعن وهب بن منبه أنه حكى من كلام عزير عليه السلام أنه قال وتخرج من تحت سدوم دابة تكلم الناس كل يسمعها وتضع الحبالى قبل التمام ويعود الماء العذب أجاجا ويتعادى الأخلاء وتحرق الحكمة ويرفع العلم وتكلم الأرض التي تليها وفي ذلك الزمان يرجو الناس مالا يبلغون ويتعبون فما لا ينالون ويعملون فيما لا يأكلون رواه ابن أبي حاتم عنه وقال ابن أبي حاتم حدثنا أبي حدثنا أبو صالح كاتب الليث حدثني معاوية بن صالح عن أبي مريم أنه سمع أبا هريرة رضي الله عنه يقول إن الدابة فيها من كل لون ما بين قرنيها فرسخ للراكب وقال ابن عباس هي مثل الحربة الضخمة وعن أمير المؤمنين على بن أبي طالب \" أنه قال إنها دابة لها ريش وزغب وحافر وما لها ذنب ولها لحية وإنها لتخرج حضر الفرس الجواد ثلاثا وما خرج ثلثها رواه ابن أبي حاتم وقال ابن جريج عن أبي الزبير أنه وصف الدابة فقال رأسها رأس ثور وعينها عين خنزير وأذنها أذن فيل وقرنها قرن أبل وعنقها عنق نعامة وصدرها صدر أسد ولونها لون نمر وخاصرتها خاصرة هر وذنبها ذنب كبش وقوائمها قوائم بعير بين كل مفصلين اثنا عشر ذراعا تخرج معها عصا موسى وخاتم سليمان فلا يبقى مؤمن إلا نكتت في وجهه بعصا موسى نكتة بيضاء فتفشو تلك النكتة حتى يبيض لها وجهه ولا يبقى كافر إلا نكتت في وجهه نكتة سوداء بخاتم سليمان فتفشوا تلك النكتة حتى يسود بها وجهه حتى إن الناس يتبايعون في الأسواق بكم ذا يا مؤمن بكم ذا يا كافر وحتى إن أهل البيت يجلسون على مائدتهم فيعرفون مؤمنهم من كافرهم ثم تقول لهم الدابة يا فلان أبشر أنت من أهل الجنة ويا فلان أنت من أهل النار فذلك قول الله تعالى \"وإذا وقع القول عليهم أخرجنا لهم دابة من الأرض تكلمهم أن الناس كانوا بآياتنا لا يوقنون\"."
    },
    {
      "ayah": 83,
      "surah": 27,
      "text": "يقول تعالى مخبرا عن يوم القيامة وحشر الظالمين من المكذبين بآيات الله ورسله إلى بين يدي الله عز وجل ليسألهم عما فعلوه في الدار الدنيا تقريعا وتوبيخا وتصغيرا وتحقيرا فقال تعالى \"ويوم نحشر من كل أمة فوجا\" أي من كل قوم وقرن فوجا أي جماعة \"ممن يكذب بآياتنا\" كما قال تعالى \"احشروا الذين ظلموا وأزواجهم\" وقال تعالى \"وإذا النفوس زوجت\" وقوله تعالى \"فهم يوزعون\" قال ابن عباس رضي الله عنهم: يدفعون وقال قتادة وزعه ترد أولهم على آخرهم وقال عبد الرحمن بن زيد بن أسلم يساقون."
    },
    {
      "ayah": 84,
      "surah": 27,
      "text": "\"حتى إذا جاءوا\" ووفقوا بين يدي الله عز وجل فى مقام المساءلة \"قال أكذبتم بآياتي ولم تحيطوا بها علما أم ماذا كنتم تعملون\" أي فيسئلون عن إعتقادهم وأعمالهم فلما لم يكونوا من أهل السعادة وكانوا كما قال الله عنهم \"فلا صدق ولا صلى ولكن كذب وتولى\" فحينئذ قامت عليهم الحجة ولم يكن لهم عذر يعتذرون به كما قال الله تعالى \"هذا يوم لا ينطقون ولا يؤذن لهم فيعتذرون\" الآية."
    },
    {
      "ayah": 85,
      "surah": 27,
      "text": "أي بهتوا فلم يكن لهم جواب لأنهم كانوا في الدار الدنيا ظلمة لأنفسهم وقد ردوا إلى عالم الغيب والشهادة الذي لا تخفى عليه خافية."
    },
    {
      "ayah": 86,
      "surah": 27,
      "text": "ثم قال تعالى منبها على قدرته التامة وسلطانه العظيم وشأنه الرفيع الذي تجب طاعته والانقياد لأوامره وتصديق أنبيائه فيما جاءوا به من الحق الذي لا محيد عنه \"ألم يروا أنا جعلنا الليل ليسكنوا فيه\" أي في ظلام الليل لتسكن حركاتهم بسببه وتهدأ أنفاسهم ويستريحون من نصب التعب في نهارهم \"والنهار مبصرا\" أي منيرا مشرقا فبسبب ذلك يتصرفون في المعايش والمكاسب والأسفار والتجارات وغير ذلك من شئونهم التي يحتاجون إليها \"إن في ذلك لآيات لقوم يؤمنون\"."
    },
    {
      "ayah": 87,
      "surah": 27,
      "text": "يخبر تعالى عن هول يوم نفخة الفزع في الصور وهو كما جاء في الحديث قرن ينفخ فيه وفي حديث الصور إن إسرافيل هو الذي ينفخ فيه بأمر الله تعالى فينفخ فيه أولا نفخة الفزع ويطولها وذلك في آخر عمر الدنيا حين تقوم الساعة على شرار الناس من الأحياء فيفزع من في السموات ومن فى الأرض \"إلا من شاء الله\" وهم الشهداء فإنهم أحياء عند ربهم يرزقون قال الإمام مسلم بن الحجاج حدثنا عبدالله بن معاذ العنبري حدثنا أبي حدثنا شعبة عن النعمان بن سالم سمعت يعقوب بن عاصم بن عروة بن مسعود الثقفي سمعت عبدالله بن عمرو رضي الله عنه وجاءه رجل فقال ما هذا الحديث الذي تحدث أن الساعة تقوم إلى كذا وكذا؟ فقال سبحان الله؟ أو لا إله إلا الله أو كلمة نحوهما لقد هممت أن لا أحدث أحدا شيئا أبدا إنما قلت إنكم سترون بعد قليل أمرا عظيما يخرب البيت ويكون ويكون - ثم قال - قال رسول الله صلى الله عليه وسلم \"يخرج الدجال في أمتي فيمكث أربعين - لا أدري أربعين يوما أو أربعين شهرا أو أربعين عاما - فيبعث الله عيسى ابن مريم كأنه عروة بن مسعود فيطلبه فيهلكه ثم يمكث الناس سبع سنين ليس بين اثنين عداوة ثم يرسل الله ريحا باردة من قبل الشام فلا يبقى على وجه الأرض أحد في قلبه مثقال ذرة من خير أو إيمان إلا قبضته حتى لو أن أحدكم دخل في كبد جبل لدخلته عليه حتى تقبضه\" قال سمعتها من رسول الله صلى الله عليه وسلم قال \"فيبقى شرار الناس في خفة الطير وأحلام السباع لا يعرفون معروفا ولا ينكرون منكرا فيتمثل لهم الشيطان فيقول ألا تستجيبون فيقولون فما تأمرنا؟ فيأمرهم بعبادة الأوثان وهم في ذلك دار رزقهم حسن عيشهم ثم ينفخ في الصور فلا يسمعه أحد إلا أصغى ليتا ورفع ليتا - قال- وأول من يسمعه رجل يلوط حوض إبله قال فيصعق ويصعق الناس ثم يرسل الله أو قال ينزل الله مطرا كأنه الطل - أو قال الظل شعبة الشاك - فتنبت منه أجساد الناس ثم ينفخ فيه أخرى فإذا هم قيام ينظرون ثم يقال يا أيها الناس هلموا إلى ربكم وقفوهم إنهم مسئولون ثم يقال أخرجوا بعث النار فيقال من كم فيقال من كل ألف تسعمائه وتسعة وتسعون قال فذلك يوم يجعل الولدان شيبا وذلك يوم يكشف عن ساق\" وقوله ثم ينفخ في الصور فلا يسمعه أحد إلا أصغى ليتا ورفع ليتا الليت هو صفحة العنق أي أمال عنقه ليستمعه من السماء جيدا فهذه نفخة الفزع ثم بعد ذلك نفخة الصعق وهو الموت ثم بعد ذلك نفخة القيام لرب العالمين وهو النشور من القبور لجميع الخلائق ولهذا قال تعالى \"وكل أتوه داخرين\" قرئ بالمد وبغيره على الفعل وكل بمعنى واحد وداخرين أي صاغرين مطيعين لا يتخلف أحد عن أمره كما قال تعالى \"يوم يدعوكم فتستجيبون بحمده\" وقال تعالى \"ثم إذا دعاكم دعوة من الأرض إذا أنتم تخرجون\" وفي حديث الصور أنه في النفخة الثالثة يأمر الله الأرواح فتوضع في ثقب في الصور ثم ينفخ إسرافيل فيه بعدما تنبت الأجساد في قبورها وأماكنها فإذا نفخ في الصور طارت الأرواح تتوهج أرواح المؤمنين نورا وأرواح الكافرين ظلمة فيقول الله عز وجل وعزتي وجلالي لترجعن كل روح إلى جسدها فتجيء الأرواح إلى أجسادها فتدب فيها كما يدب السم في اللديغ ثم يقومون ينفضون التراب من قبورهم قال الله تعالى \"يوم يخرجون من الأجداث سراعا كأنهم إلى نصب يوفضون\"."
    },
    {
      "ayah": 88,
      "surah": 27,
      "text": "\"وترى الجبال تحسبها جامدة وهي تمر مر السحاب\" أي تراها كأنها ثابتة باقية على ما كانت عليه وهي تمر مر السحاب أي تزول عن أماكنها كما قال تعالى \"يوم تمور السماء مورا وتسير الجبال سيرا\" وقال تعالى \"ويسألونك عن الجبال فقل ينسفها ربي نسفا فيذرها قاعا صفصفا لا ترى فيها عوجا ولا أمتا\" وقال تعالى \"ويوم نسير الجبال وترى الأرض بارزة\" وقوله تعالى \"صنع الله الذي أتقن كل شيء\" أي يفعل ذلك بقدرته العظيمة \"الذي أتقن كل شيء\" أي أتقن كل ما خلق وأودع فيه من الحكمة ما أودع \"إنه خبير بما يفعلون\" أي هو عليم بما يفعل عباده من خير وشر وسيجازيهم عليه أتم الجزاء."
    },
    {
      "ayah": 89,
      "surah": 27,
      "text": "قال قتادة بالإخلاص وقال زين العابدين هي لا إله إلا الله وقد بين تعالى في الموضع الآخر أن له عشر أمثالها \"وهم من فزع يومئذ آمنون\" كما قال في الآية الأخرى \"لا يحزنهم الفزع الأكبر\" وقال تعالى \"أفمن يلقى في النار خير أم من يأتي آمنا يوم القيامة\" وقال تعالى \"وهم في الغرفات آمنون\"."
    },
    {
      "ayah": 9,
      "surah": 27,
      "text": "أعلمه أن الذي يخاطبه ويناجيه هو ربه الله العزيز الذي عز كل شيء وقهره وغلبه الحكيم في أقواله وأفعاله."
    },
    {
      "ayah": 90,
      "surah": 27,
      "text": "أي من لقى الله مسيئا لا حسنة له أو قد رجحت سيئاته على حسناته كل بحسبه ولهذا قال تعالى \"هل تجزون إلا ما كنتم تعملون\" وقال ابن مسعود وابن عباس وأبو هريرة رضي الله عنهم وأنس بن مالك وعطاء وسعيد بن جبير وعكرمة ومجاهد وإبراهيم النخعي وأبو وائل وأبو صالح ومحمد ابن كعب وزيد بن أسلم والزهري والسدي والضحاك والحسن وقتادة وابن زيد في قوله \"ومن جاء بالسيئة\" يعني بالشرك."
    },
    {
      "ayah": 91,
      "surah": 27,
      "text": "يقول تعالى مخبرا رسوله وآمرا له أن يقول \"إنما أمرت أن أعبد رب هذه البلدة الذي حرمها وله كل شيء\" كما قال تعالى \"قل يا أيها الناس إن كنتم في شك من ديني فلا أعبد الذين تعبدون من دون الله ولكن أعبد الله الذي يتوفاكم\" وإضافة الربوبية إلى البلدة على سبيل التشريف لها والاعتناء بها كما قال تعالى \"فليعبدوا رب هذا البيت الذي أطعمهم من جوع وآمنهم من خوف\" وقوله تعالى \"الذي حرمها\" أي الذي إنما صارت حراما شرعا وقدرا بتحريمه لها كما ثبت الصحيحين عن ابن عباس قال قال رسول الله صلى الله عليه وسلم يوم فتح مكه \"إن هذا البلد حرمه الله يوم خلق السموات والأرض فهو حرام بحرمة الله إلى يوم القيامة لا يعضد شوكه ولا ينفر صيده ولا يلتقط لقطته إلا من عرفها ولا يختلى خلالها\" بتمامه وقد ثبث فى الصحاح والحسان والمسانيد من طرق جماعة تفيد القطع كما هو مبين في موضعه من كتاب الأحكام ولله الحمد والمنة وقوله تعالى \"وله كل شيء\" من باب عطف العام على الخاص أي هو رب هذه البلدة ورب كل شيء ومليكه لا إله إلا هو \"وأمرت أن أكون من المسلمين\" أي الموحدين المخلصين المنقادين لأمره المطيعين له."
    },
    {
      "ayah": 92,
      "surah": 27,
      "text": "\"وأن أتلوا القرآن\" أي على الناس أبلغهم إياه كقوله تعالى \"ذلك نتلوه عليك من الآيات والذكر الحكيم\" وكقوله تعالى \"نتلوا عليك من نبأ موسى وفرعون بالحق\" الآية أي أنا مبلغ ومنذر \"فمن اهتدى فإنما يهتدي لنفسه ومن ضل فقل إنما أنا من المنذرين\" أي لي أسوة بالرسل الذين أنذروا قومهم وقاموا بما عليهم من أداء الرسالة إليهم وخلصوا من عهدتهم وحساب أممهم على الله تعالى كقوله تعالى \"فإنما عليك البلاغ وعلينا الحساب\" وقال \"إنما أنت نذير والله على كل شيء وكيل\"."
    },
    {
      "ayah": 93,
      "surah": 27,
      "text": "أي لله الحمد الذي لا يعذب أحدا إلا بعد قيام الحجة عليه والإنذار إليه ولهذا قال تعالى \"سيريكم آياته فتعرفونها\" كما قال تعالى \"سنريهم آياتنا في الآفاق وفي أنفسهم حتى يتبين لهم أنه الحق\" وقوله تعالى \"وما ربك بغافل عما تعملون\" أي بل هو شهيد على كل شيء قال ابن أبي حاتم ذكر عن أبي عمر الحوضي حفص بن عمر حدثنا أبو أمية بن يعلى الثقفي حدثنا سعد بن أبي سعيد سمعت أبا هريرة يقول قال رسول الله صلى الله عليه وسلم \"يا أيها الناس لا يغترن أحدكم بالله فإن الله لو كان غافلا شيئا لأغفل البعوضة والخردلة والذرة\" وقال أيضا حدثنا محمد بن يحيى حدثنا نصر بن علي قال أبي أخبرني عن خالد بن قيس عن مطر عن عمر بن عبد العزيز قال: فلو كان الله مغفلا شيئا لأغفل ما تعفي الرياح من أثر قدمي ابن آدم وقد ذكر عن الإمام أحمد رحمه الله تعالى أنه كان ينشد هذين البيتين إما له وإما لغيره: إذا ما خلوت الدهر يوما فلا تقل خلوت ولكن قل علي رقيب ولا تحسبن الله يغفل ساعة ولا أن ما يخفى عليه يغيب آخر تفسير سورة النمل ولله الحمد والمنة."
    }
  ]
}
