{
  "ayahs": [
    {
      "ayah": 1,
      "surah": 28,
      "text": "سورة القصص: قال الإمام أحمد بن حنبل رحمه الله حدثنا يحيى بن آدم حدثنا وكيع عن أبيه عن أبي إسحاق عن معد يكرب قال أتينا عبدالله فسألناه أن يقرأ علينا طسم المائتين فقال ما هي معي ولكن عليكم بمن أخذها من رسول الله صلى الله عليه وسلم خباب بن الأرت قال فأتينا خباب بن الأرت فقرأها علينا رضي الله عنه. قد اختلف المفسرون في الحروف المقطعة التي في أوائل السور فمنهم من قال هي مما استأثر الله بعلمه فردوا علمها إلى الله ولم يفسرها حكاه القرطبي في تفسـره عن أبي بكر وعمر وعثمان وعلي وابن مسعود رضي الله عنهم أجمعين وقاله عامر الشعبي وسفيان الثوري والربيع بن خيثم واختاره أبو حاتم بن حبان. ومنهم من فسرها واختلف هؤلاء في معناها فقال عبدالرحمن بن زيد بن أسلم إنما هي أسماء السور. قال العلامة أبو القاسم محمود بن عمر الزمخشري في تفسيره وعليه إطباق الأكثر ونقل عن سيبويه أنه نص عليه ويعتضد لهذا بما ورد في الصحيحين عن أبي هريرة أن رسول الله صلى الله عليه وسلم كان يقرأ في صلاة الصبح يوم الجمعة \"الم\" السجدة و \"هل أتى على الإنسان\" وقال سفيان الثوري عن ابن أبي نجيح عن مجاهد أنه قال: الم وحم والمص وص. فواتح افتتح الله بها القرآن وكذا قال غيره عن مجاهد وقال مجاهد في رواية أبي حذيفة موسى بن مسعود عن شبل عن ابن أبي نجيح عنه أنه قال الم اسم من أسماء القرآن وهكذا وقال قتادة وزيد بن أسلم ولعل هذا يرجع إلى معنى قول عبدالرحمن بن زيد بن أسلم أنه اسم من أسماء السور فإن كل سورة يطلق عليها اسم القرآن فإنه يبعد أن يكون المص اسما للقرآن كله لأن المتبادر إلى فهم سامع من يقول قرأت المص إنما ذلك عبارة عن سورة الأعراف لا لمجموع القرآن والله أعلم. وقيل هي اسم من أسماء الله تعالى فقال عنها في فواتح السور من أسماء الله تعالى وكذلك قال سالم بن عبدالله وإسماعيل بن عبدالرحمن السدي الكبير وقال شعبة عن السدي بلغني أن ابن عباس قال الم اسم من أسماء الله الأعظم. هكذا رواه ابن أبي حاتم من حديث شعبة ورواه ابن جرير عن بندار عن ابن مهدي عن شعبة قال سألت السدي عن حم وطس والم فقال قال ابن عباس هي اسم الله الأعظم وقال ابن جرير وحدثنا محمد بن المثنى حدثنا أبو النعمان حدثنا شعبة عن إسماعيل السدي عن مرة الهمذاني قال: قال عبدالله فذكر نحوه. وحُكي مثله عن علي وابن عباس وقال علي بن أبي طلحة عن ابن عباس هو قسم أقسم الله به وهو من أسماء الله تعالى وروى ابن أبي حاتم وابن جرير من حديث ابن علية عن خالد الحذاء عن عكرمة أنه قال الم قسم. وروينا أيضا من حديث شريك بن عبدالله بن عطاء بن السائب عن أبى الضحى عن ابن عباس: الم قال أنا الله أعلم وكذا قال سعيد بن جبير وقال السدي عن أبي مالك وعن أبي صالح عن ابن عباس وعن مرة الهمذاني عن ابن مسعود وعن ناس من أصحاب النبي صلى الله عليه وسلم الم قال أما الم فهي حروف استفتحت من حروف هجاء أسماء الله تعالى. قال وأبو جعفر الرازي عن الربيع بن أنس عن أبي العالية في قوله تعالى الم قال هذه الأحرف الثلاثة من التسعة والعشرين حرفا دارت فيها الألسن كلها ليس منها حرف إلا وهو مفتاح اسم من أسمائه وليس منها حرف إلا وهو من آلائه وبلألائه ليس منها حرف إلا وهو في مدة أقوام وآجالهم. قال عيسى ابن مريم عليه السلام وعجب: فقال أعجب أنهم يظنون بأسمائه ويعيشون في رزقه فكيف يكفرون به فالألف مفتاح الله واللام مفتاح اسمه لطيف والميم مفتاح اسمه مجيد فالألف آلاء الله واللام لطف الله والميم مجد الله والألف سنة واللام ثلاثون سنة والميم أربعون سنة. هذا لفظ ابن أبي حاتم ونحوه رواه ابن جرير ثم شرع يوجه كل واحد من هذه الأقوال ويوفق بينها وأنه لا منافاة بين كل واحد منها وبين الآخر وأن الجمع ممكن فهي أسماء للسور ومن أسماء الله تعالى يفتتح بها السور فكل حرف منها دل على اسم من أسمائه وصفة من صفاته كما افتتح سورا كثيرة بتحميده وتسبيحه وتعظيمه قال ولا مانع من دلالة الحرف منها على اسم من أسماء الله وعلى صفة من صفاته وعلى مدة وغير ذلك كما ذكره الربيع بن أنس عن أبي العالية لأن الكلمة الواحدة تطلق على معاني كثيرة كلفظة الأمة فإنها تطلق ويراد به الدين كقوله تعالى \"إنا وجدنا آباءنا على أمة\" وتطلق ويراد بها الرجل المطيع لله كقوله تعالى \"إن إبراهيم كان أمة قانتا لله حنيفا ولم يك من المشركين\" وتطلق ويراد بها الجماعة كقوله تعالى \"وجد عليه أمة من الناس يسقون\" وقوله تعالى \"ولقد بعثنا في كل أمة رسولا\" وتطلق ويراد بها الحين من الدهر كقوله تعالى \"وقال الذي نجا منهما وادكر بعد أمة\" أي بعد حين على أصح القولين قال فكذلك هذا. هذا حاصل كلامه موجها ولكن هذا ليس كما ذكره أبو العالية فإن أبا العالية زعم أن الحرف دل على هذا وعلى هذا وعلى هذا معا ولفظة الأمة وما أشبهها من الألفاظ المشتركة في الاصطلاح إنما دل في القرآن في كل موطن على معنى واحد دل عليه سياق الكلام فأما حمله على مجموع محامله إذا أمكن فمسألة مختلف فيها بين علماء الأصول ليس هذا موضع البحث فيها والله أعلم. ثم إن لفظة الأمة تدل على كل من معانيها في سياق الكلام بدلالة الوضع فأما دلالة الحرف الواحد على اسم يمكن أن يدل على اسم آخر من غير أن يكون أحدهما أولى من الآخر في التقدير أو الإضمار بوضع ولا بغيره فهذا مما لا يفهم إلا بتوقيف والمسألة مختلف فيها وليس فيها إجماع حتى يحكم به وما أنشدوه من الشواهد على صحة إطلاق الحرف الواحد على بقية الكلمة فإن في السياق ما يدل على ما حذف بخلاف هذا كما قال الشاعر: قلنا قفي لنا فقالت قاف لا تحسبي أنا نسينا الإيجاف تعني وقفت. وقال الآخر: ما للظليم عال كيف لايـ ينقد عنه جلده إذا يـ فقال ابن جرير كأنه أراد أن يقول إذا يفعل كذا وكذا فاكتفى بالياء من يفعل وقال الآخر: بالخير خيرات وان شرا فا ولا أريد الشر إلا أن تـ يقول وإن شرا فشرا ولا أريد الشر إلا أن تشاء فاكتفى بالفاء والتاء من الكلمتين عن بقيتهما ولكن هذا ظاهر من سياق الكلام والله أعلم. قال القرطبي وفي الحديث \"من أعان على قتل مسلم بشطر كلمة\" الحديث قال سفيان هو أن يقول في اقتل\"ا قـ\" وقال خصيف عن مجاهد أنه قال فواتح السور كلها\"ق وص وحم وطسم والر\" وغير ذلك هجاء موضوع وقال بعض أهل العربية هي حروف من حروف المعجم استغنى بذكر ما ذكر منها في أوائل السور عن ذكر بواقيها التي هي تتمة الثمانية والعشرين حرفا كما يقول القائل ابني يكتب في - ا ب ت ث - أي في حروف المعجم الثمانية والعشرين فيستغني بذكر بعضها عن مجموعها حكاه ابن جرير. قلت مجموع الحروف المذكورة في أوائل السور بحذف المكرر منها أربعة عشر حرفا وهي - ال م ص ر ك ه ي ع ط س ح ق ن- يجمعها قولك: نص حكيم قاطع له سر. وهي نصف الحروف عددا والمذكور منها أشرف من المتروك وبيان ذلك من صناعة التصريف. قال الزمخشري وهذه الحروف الأربعة عشر مشتملة على أصناف أجناس الحروف يعني من المهموسة والمجهورة ومن الرخوة والشديدة ومن المطبقة والمفتوحة ومن المستعلية والمنخفضة ومن حروف القلقلة. وقد سردها مفصلة ثم قال: فسبحان الذي دقت في كل شيئ حكمته. وهذه الأجناس المعدودة مكثورة بالمذكورة منها وقد علمت أن معظم الشيء وجله ينزل منزلة كله وههنا ههنا لخص بعضهم في هذا المقام كلاما فقال: لا شك أن هذه الحروف لم ينزلها سبحانه وتعالى عبثا ولا سدى ومن قال من الجهلة إن في القرآن ما هو تعبد لا معنى له بالكلمة فقد أخطأ خطأ كبيرا فتعين أن لها معنى في نفس الأمر فإن صح لنا فيها عن المعصوم شيء قلنا به وإلا وقفنا حيث وقفنا وقلنا \"آمنا به كل من عند ربنا\" ولم يجمع العلماء فيها على شيء معين وإنما اختلفوا فمن ظهر له بعض الأقوال بدليل فعليه اتباعه وإلا فالوقف حتى يتبين هذا المقام. المقام الآخر في الحكمة التي اقتضت إيراد هذه الحروف في أوائل السور ما هي مع قطع النظر عن معانيها في أنفسها فقال بعضهم إنما ذكرت ليعرف بها أوائل السور حكاه ابن جرير وهذا ضعيف لأن الفصل حاصل بدونها فيما لم تذكر فيه وفيما ذكرت فيه البسملة تلاوة وكتابة وقال آخرون بل ابتدئ بها لتفتح لاستماعها أسماع المشركين إذ تواصوا بالإعراض عن القرآن حتى إذا استمعوا له تلا عليهم المؤلف منه حكاه ابن جرير أيضا وهو ضعيف أيضا لأنه لو كان كذلك لكان ذلك في جميع السور لا يكون في بعضها بل غالبها ليس كذلك ولو كـان كذلك أيضا لانبغى الابتداء بها في أوائل الكلام معهم سواء كان افتتاح سورة أو غير ذلك ثم إن هذه السورة والتي تليها أعني البقرة وآل عمران مدنيتان ليستا خطابا للمشركين فانتقض ما ذكروه بهذه الوجوه. وقال آخرون بل إنما ذكرت هذه الحروف في أوائل السور التي ذكرت فيها بيانا لإعجاز القرآن وأن الخلق عاجزون عن معارضته بمثله هذا مع أنه مركب من هذه الحروف المقطعة التي يتخاطبون بها وقد حكى هذا المذهب الرازي في تفسيره عن المبرد وجمع من المحققين وحكى القرطبي عن الفراء وقطرب نحو هذا وقرره الزمخشري فى كشافه ونصره أتم نصر وإليه ذهب الشيخ الإمام العلامة أبو العباس ابن تيمية وشيخنا الحافظ المجتهد أبو الحجاج المزي وحكاه لي عن ابن تيمية. قال الزمخشري ولم ترد كلها مجموعة في أول القرآن وإنما كررت ليكون أبلغ في التحدي والتبكيت كما كررت قصص كثيرة وكرر التحدي بالصريح في أماكن قال وجاء منها على حرف واحد كقوله - ص ن ق- وحرفين مثل \"حم\" وثلاثة مثل \"الم\" وأربعة مثل \"المر\" و \"المص\" وخمسة مثل \"كهيعص- و- حم عسق\" لأن أساليب كلامهم على هذا من الكلمات ما هو على حرف وعلى حرفين وعلى ثلاثة وعلى أربعة وعلى خمسة لا أكثر من ذلك \"قلت\" ولهذا كل سورة افتتحت بالحروف فلا بد أن يذكر فيها الانتصار للقرآن وبيان إعجازه وعظمته وهذا معلوم بالاستقراء وهو الواقع في تسع وعشرين سورة ولهذا يقول تعالى \"الم ذلك الكتاب لا ريب فيه\" \"الم الله لا إله إلا هو الحي القيوم نزل عليك الكتاب بالحق مصدقا لما بين يديه\" \"المص كتاب أنزل إليك فلا يكن في صدرك حرج منه\" \"الر كتاب أنزلناه إليك لتخرج الناس من الظلمات إلى النور بإذن ربهم\" \"الم تنزيل الكتاب لا ريب فيه من رب العالمين\" \"حم تنزيل من الرحمن الرحيم\" \"حم عسق كذلك يوحي إليك وإلى الذين من قبلك الله العزيز الحكيم\" وغير ذلك من الآيات الدالة على صحة ما ذهب إليه هؤلاء لمن أمعن النظر والله أعلم. وأما من زعم أنها دالة على معرفة المدد وأنه يستخرج من ذلك أوقات الحوادث والفتن والملاحم فقد ادعى ما ليس له وطار في غير مطاره وقد ورد في ذلك حديث ضعيف وهو مع ذلك أدل على بطلان هذا المسلك من التمسك به على صحته وهو ما رواه محمد بن إسحق بن يسار صاحب المغازي حدثني الكلبي عن أبي صالح عن ابن عباس عن جابر بن عبدالله بن رباب قال مر أبو ياسر بن أخطب في رجال من يهود برسول الله صلى الله عليه وسلم وهو يتلو فاتحة سورة البقرة \"الم ذلك الكتاب لا ريب فيه\" فأتى أخاه بن أخطب في رجال من اليهود فقال تعلمون والله لقد سمعت محمدا يتلو فيما أنزل الله تعالى عليه \"الم ذلك الكتاب لا ريب فيه\" فقال أنت سمعته قال نعم قال فمشى حي بن أخطب في أولئك النفر من اليهود إلى رسول الله صلى الله عليه وسلم فقالوا يا محمد ألم يذكر أنك تتلوا فيما أنزل الله عليك \"الم ذلك الكتاب\"؟ فقال رسول الله صلى الله عليه وسلم \"بلى\" فقالوا جاءك بهذا جبريل من عند الله؟ فقال \"نعم\" قالوا لقد بعث الله قبلك أنبياء ما نعلمه بين لنبي منهم ما مدة ملكه وما أجل أمته غيرك. فقام حي بن أخطب وأقبل على من كان معه فقال لهم الألف واحدة واللام ثلاثون والميم أربعون فهذه إحدى وسبعون سنة أفتدخلون في دين نبي إنما مدة ملكه وأجل أمته إحدى وسبعون سنة؟ ثم أقبل على رسول الله صلى الله عليه وسلم فقال يا محمد هل مع هذا غيره فقال \"نعم\" قال ما ذاك؟ قال \"المص\" قال هذا أثقل وأطول الألف واحد واللام ثلاثون والميم أربعون والصاد تسعون فهذه إحدى وثلاثون ومائة سنة. هل مع هذا يا محمد غيره؟ قال \"نعم\" قال ما ذاك؟ قال \"الر\" قال هذا أثقل وأطول الألف واحدة واللام ثلاثون والراء مائتان فهذه إحدى وثلاثون ومائتا سنة. فهل مع هذا يا محمد غيره؟ قال \"نعم\" قال ماذا قال \"المر\" قال هذه أثقل وأطول الألف واحدة واللام ثلاثون والميم أربعون والراء مائتان فهذه إحدى وسبعون ومائتان ثم قال: لقد لبس علينا أمرك يا محمد حتى ما ندري أقليلا أعطيت أم كثيرا. ثم قال قوموا عنه ثم قال أبو ياسر لأخيه حي بن أخطب ولمن معه من الأحبار ما يدريكم لعله قد جمع هذا لمحمد كله إحدى وسبعون وإحدى وثلاثون ومائة وإحدى وثلاثون ومائتان وإحدى وسبعون ومائتان فذلك سبعمائة وأربع سنين؟ فقالوا لقد تشابه علينا أمره فيزعمون أن هؤلاء الآيات نزلت فيهم \"هو الذي أنزل عليك الكتاب منه آيات محكمات هن أم الكتاب وأخر متشابهات\" فهذا الحديث مداره على محمد بن السائب الكلبي وهو ممن لا يحتج بما انفرد به ثم كان مقتضى هذا المسلك إن كان صحيحا أن يحسب ما لكل حرف من الحروف الأربعة عشر التي ذكرناها وذلك يبلغ منه جملة كثيرة وإن حسبت مع التكرر فأطم وأعظم والله أعلم."
    },
    {
      "ayah": 10,
      "surah": 28,
      "text": "يقول تعالى مخبرا عن فؤاد أم موسى حين ذهب ولدها في البحر أنه أصبح فارغا أي من كل شيء من أمور الدنيا إلا من موسى قاله ابن عباس ومجاهد وعكرمة وسعيد بن جبير وأبو عبيدة والضحاك والحسن البصري وقتادة وغيرهم \"إن كادت لتبدي به\" أي إن كادت من شدة وجدها وحزنها وأسفها لتظهر أنه ذهب لها ولد وتخبر بحالها لولا أن الله ثبتها وصبرها قال الله تعالى: \"لولا أن ربطنا على قلبها لتكون من المؤمنين \"."
    },
    {
      "ayah": 11,
      "surah": 28,
      "text": "أي اتبعي أثره وخذي خبره وتطلبي شأنه من نواحي البلد فخرجت لذلك \"فبصرت به عن جنب\" قال ابن عباس عن جانب. وقال مجاهد بصرت به عن جنب عن بعد. وقال قتادة جعلت تنظر إليه وكأنها لا تريده وذلك أنه لما استقر موسى عليه السلام بدار فرعون وأحبته امرأة الملك واستطلقته منه عرضوا عليه المراضع التي في دارهم فلم يقبل سها ثديا وأبى أن يقبل شيئا من ذلك فخرجوا به إلى السوق لعلهم يجدون امرأة تصلح لرضاعته فلما رأته بأيديهم عرفته ولم تظهر ذلك ولم يشعروا بها."
    },
    {
      "ayah": 12,
      "surah": 28,
      "text": "قال الله تعالى: \"وحرمنا عليه المراضع من قبل\" أي تحريما قدريا وذلك لكرامته عند الله وصيانته له أن يرتضع غير ثدي أمه ولأن الله سبحانه وتعالى جعل ذلك سببا إلى رجوعه إلى أمه لترضعه وهي آمنة بعدما كانت خائفة فلما رأتهم حائرين فيمن يرضعه \"قالت هل أدلكم على أهل بيت يكفلونه لكم وهم له ناصحون\" قال ابن عباس فلما قالت ذلك أخذوها وشكوا في أمرها وقالوا لها وما يدريك بنصحهم له وشفقتهم عليه؟ فقالت لهم نصحهم له وشفقتهم عليه رغبتهم في سرور الملك ورجاء منفعته فأرسلوها فلما قالت لهم ذلك وخلصت من أذاهم ذهبوا معها إلى منزلهم فدخلوا به على أمه فأعطته ثديها فالتقمه ففرحوا بذلك فرحا شديدا وذهب البشير إلى امرأة الملك فاستدعت أم موسى وأحسنت إليها وأعطتها عطاء جزيلا وهي لا تعرف أنها أمه في الحقيقة ولكن لكونه وافق ثديها ثم سألتها آسية أن تقيم عندها فترضعه فأبت عليها وقالت إن لي بعلا وأولادا ولا أقدر على المقام عندك ولكن إن أحببت أن أرضعه في بيتي فعلت فأجابتها امرأة فرعون إلى ذلك وأجرت عليها النفقة والصلاة والكساوى والإحسان الجزيل فرجعت أم موسى بولدها راضية مرضية قد أبدلها الله بعد خوفها أمنا في عز وجاه ورزق دار ولهذا جاء في الحديث \"مثل الذي يعمل ويحتسب في صنعته الخير كمثل أم موسى ترضع ولدها وتأخذ أجرها\" ولم يكن بين الشدة والفرج إلا القليل يوم وليلة أو نحوه والله أعلم فسبحان من بيده الأمر ما شاء كان وما لم يشأ لم يكن الذي يجعل لمن اتقاه بعد كل هم فرجا وبعد كل ضيق مخرجا."
    },
    {
      "ayah": 13,
      "surah": 28,
      "text": "قال تعالى: \"فرددناه إلى أمه كي تقر عينها\" أي به \"ولا تحزن\" أي عليه \"ولتعلم أن وعد الله حق\" أي فيما وعدها من رده إليها وجعله من المرسلين فحينئذ تحققت برده إليها أنه كائن منه رسول من المرسلين فعاملته في تربيته ما ينبغي له طبعا وشرعا. وقوله تعالى: \"ولكن أكثرهم لا يعلمون\" أي حكم الله في أفعاله وعواقبها المحمودة التي هو المحمود عليها في الدنيا والآخرة فربما يقع الأمر كريها إلى النفوس وعاقبته محمودة في نفس الأمر كما قال تعالى: \"وعسى أن تكرهوا شيئا وهو خير لكم وعسى أن تحبوا شيئا وهو شر لكم\" وقال تعالى: \"وعسى أن تكرهوا شيئا ويجعل الله فيه خيرا كثيرا\"."
    },
    {
      "ayah": 14,
      "surah": 28,
      "text": "لما ذكر تعالى مبدأ أمر موسى عليه السلام ذكر أنه لما بلغ أشده واستوى آتاه الله حكما وعلما قال مجاهد يعني النبوة: \"وكذلك نجزي المحسنين\" ثم ذكر تعالى سبب وصوله إلى ما كان تعالى قدره له من النبوة والتكليم في قضية قتله ذلك القبطي الذي كان سبب خروجه من الديار المصرية إلى بلاد مدين."
    },
    {
      "ayah": 15,
      "surah": 28,
      "text": "قال تعالى: \"ودخل المدينة على حين غفلة من أهلها\" قال ابن جريج عن عطاء الخراساني عن ابن عباس وذلك بين المغرب والعشاء. وقال ابن المنكدر عن عطاء بن يسار عن ابن عباس كان ذلك نصف النهار وكذا قال سعيد بن جبير وعكرمة والسدي وقتادة \"فوجد فيها رجلين يقتتلان\" أي يتضاربان ويتنازعان \"هذا من شيعته\" أي إسرائيلي \"وهذا من عدوه\" أي قبطي قاله ابن عباس وقتادة والسدي ومحمد بن إسحاق فاستغاث الإسرائيلي بموسى فوجد موسى فرصة وهي غفلة الناس فعمد إلى القبطي \"فوكزه موسى فقضى عليه\" قال مجاهد فوكزه أي طعنه بجمع كفه وقال قتادة وكزه بعصا كانت معه فقضى عليه أي كان فيها حتفه فمات \"قال\" موسى \"هذا من عمل الشيطان إنه عدو مضل مبين قال رب إني ظلمت نفسي فاغفر لي فغفر له إنه هو الغفور الرحيم قال رب بما أنعمت علي\" أي بما جعلت لي من الجاه والعز والنعمة \"فلن أكون ظهيرا\" أي معينا \"للمجرمين\" أي الكافرين بك المخالفين لأمرك."
    },
    {
      "ayah": 16,
      "surah": 28,
      "text": "قال تعالى: \"ودخل المدينة على حين غفلة من أهلها\" قال ابن جريج عن عطاء الخراساني عن ابن عباس وذلك بين المغرب والعشاء. وقال ابن المنكدر عن عطاء بن يسار عن ابن عباس كان ذلك نصف النهار وكذا قال سعيد بن جبير وعكرمة والسدي وقتادة \"فوجد فيها رجلين يقتتلان\" أي يتضاربان ويتنازعان \"هذا من شيعته\" أي إسرائيلي \"وهذا من عدوه\" أي قبطي قاله ابن عباس وقتادة والسدي ومحمد بن إسحاق فاستغاث الإسرائيلي بموسى فوجد موسى فرصة وهي غفلة الناس فعمد إلى القبطي \"فوكزه موسى فقضى عليه\" قال مجاهد فوكزه أي طعنه بجمع كفه وقال قتادة وكزه بعصا كانت معه فقضى عليه أي كان فيها حتفه فمات \"قال\" موسى \"هذا من عمل الشيطان إنه عدو مضل مبين قال رب إني ظلمت نفسي فاغفر لي فغفر له إنه هو الغفور الرحيم قال رب بما أنعمت علي\" أي بما جعلت لي من الجاه والعز والنعمة \"فلن أكون ظهيرا\" أي معينا \"للمجرمين\" أي الكافرين بك المخالفين لأمرك."
    },
    {
      "ayah": 17,
      "surah": 28,
      "text": "قال تعالى: \"ودخل المدينة على حين غفلة من أهلها\" قال ابن جريج عن عطاء الخراساني عن ابن عباس وذلك بين المغرب والعشاء. وقال ابن المنكدر عن عطاء بن يسار عن ابن عباس كان ذلك نصف النهار وكذا قال سعيد بن جبير وعكرمة والسدي وقتادة \"فوجد فيها رجلين يقتتلان\" أي يتضاربان ويتنازعان \"هذا من شيعته\" أي إسرائيلي \"وهذا من عدوه\" أي قبطي قاله ابن عباس وقتادة والسدي ومحمد بن إسحاق فاستغاث الإسرائيلي بموسى فوجد موسى فرصة وهي غفلة الناس فعمد إلى القبطي \"فوكزه موسى فقضى عليه\" قال مجاهد فوكزه أي طعنه بجمع كفه وقال قتادة وكزه بعصا كانت معه فقضى عليه أي كان فيها حتفه فمات \"قال\" موسى \"هذا من عمل الشيطان إنه عدو مضل مبين قال رب إني ظلمت نفسي فاغفر لي فغفر له إنه هو الغفور الرحيم قال رب بما أنعمت علي\" أي بما جعلت لي من الجاه والعز والنعمة \"فلن أكون ظهيرا\" أي معينا \"للمجرمين\" أي الكافرين بك المخالفين لأمرك."
    },
    {
      "ayah": 18,
      "surah": 28,
      "text": "يقول تعالى مخبرا عن موسى لما قتل ذلك القبطي أنه أصبح \"في المدينة خائفا\" أي من معرة ما فعل \"يترقب\" أي يتلفت ويتوقع ما يكون من هذا الأمر فمر في بعض الطرق فإذا ذلك الذي استنصره بالأمس على ذلك القبطي يقاتل آخر فلما مر عليه موسى استصرخه على الآخر فقال له موسى \"إنك لغوي مبين\" أي ظاهر الغواية كثير الشر ثم عزم على البطش بذلك القبطي فاعتقد الإسرائيلى لخوره وضعفه وذلته أن موسى إنما يريد قصده لما سمعه يقول ذلك فقال يدفع عن نفسه."
    },
    {
      "ayah": 19,
      "surah": 28,
      "text": "\"يا موسى أتريد أن تقتلني كما قتلت نفسا بالأمس\" وذلك لأنه لم يعلم به إلا هو وموسى عليه السلام فلما سمعها ذلك القبطي لقفها من فمه ثم ذهب بها إلى باب فرعون وألقاها عنده فعلم فرعون بذلك فاشتد حنقه وعزم على قتل موسى فطلبوه فبعثوا وراءه ليحضروه لذلك."
    },
    {
      "ayah": 2,
      "surah": 28,
      "text": "وقوله: \"تلك\" أي هذه \"آيات الكتاب المبين\" أي الواضح الجلي الكاشف عن حقائق الأمور وعلم ما قد كان وما هو كائن."
    },
    {
      "ayah": 20,
      "surah": 28,
      "text": "قال تعالى: \"وجاء رجل\" وصفه بالرجولية لأنه خالف الطريق فسلك طريقا أقرب من طريق الذين بعثوا وراءه فسبق إلى موسى فقال له يا موسى \"إن الملأ يأتمرون بك\" أي يتشاورون فيك \"ليقتلوك فاخرج\" أي من البلد \"إني لك من الناصحين\"."
    },
    {
      "ayah": 21,
      "surah": 28,
      "text": "لما أخبره ذلك الرجل بما تمالأ عليه فرعون دولته في أمره خرج من مصر وحده ولم يألف ذلك قبله بل كان في رفاهية ونعمة ورياسة \"فخرج منها خائفا يترقب\" أي يتلفت \"قال رب نجني من القوم الظالمين\" أي من فرعون وملئه فذكروا أن الله سبحانه وتعالى بعث إليه ملكا على فرس فأرشده إلى الطريق فالله أعلم."
    },
    {
      "ayah": 22,
      "surah": 28,
      "text": "\"ولما توجه تلقاء مدين\" أي أخذ طريقا سالكا مهيعا فرح بذلك \"قال عسى ربي أن يهديني سواء السبيل\" أي الطريق الأقوم ففعل الله به ذلك وهداه إلى الصراط المستقيم في الدنيا والآخرة فجعل هاديا مهديا."
    },
    {
      "ayah": 23,
      "surah": 28,
      "text": "\"ولما ورد ماء مدين\" أي لما وصل إلى مدين وورد ماءها وكان لها بئر يرده رعاء الشاء \"وجد عليه أمة من الناس يسقون\" أي جماعة يسقون \"ووجد من دونهم امرأتين تذودان\" أي تكفكفان غنمهما أن ترد مع غنم أولئك الرعاء لئلا يؤذيا فلما رآهما موسى عليه السلام رق لهما ورحمهما \"قال ما خطبكما\" أي ما خبركما لا تردان مع هؤلاء؟ \"قالتا لا نسقي حتى يصدر الرعاء\" أي لا يحصل لنا سقي إلا بعد فراغ هؤلاء \"وأبونا شيخ كبير\" أي فهذا الحال الملجئ لنا إلى ما ترى."
    },
    {
      "ayah": 24,
      "surah": 28,
      "text": "قال الله تعالى: \"فسقى لهما\" قال أبو بكر بن أبي شيبة حدثنا عبيد الله أنبأنا إسرائيل عن أبى إسحاق عن عمرو بن ميمون الأودي عن عمر بن الخطاب رضي الله عنه أن موسى عليه السلام لما ورد ماء مدين وجد عليه أمة من الناس يسقون قال فلما فرغوا أعادوا الصخرة على البئر ولا يطيق رفعها إلا عشرة رجال فإذا هو بامرأتين تذودان قال ما خطبكما؟ فحدثتاه فأتى الحجر فرفعه ثم لم يستق إلا ذنوبا واحدا حتى رويت الغنم. إسناد صحيح. وقوله تعالى: \"ثم تولى إلى الظل فقال رب إني لما أنزلت إلي من خير فقير\" قال ابن عباس: سار موسى من مصر إلى مدين ليس له طعام إلا البقل وورق الشجر وكان حافيا فما وصل إلى مدين حتى سقطت نعل قدميه وجلس في الظل وهو صفوة الله من خلقه وإن بطنه للاصق بظهره من الجوع وإن خضرة البقل لترى من داخل جوفه وإنه لمحتاج إلى شق تمرة. وقوله: \"إلى الظل\" قال ابن عباس وابن مسعود والسدي جلس تحت شجرة وقال ابن جرير: حدثني الحسين بن عمرو العنقزي حدثنا أبي حدثنا إسرائيل عن أبي إسحاق عن عمرو بن ميمون عن عبدالله - هو ابن مسعود- قال: حثثت على جمل ليلتين حتى صبحت مدين فسألت عن الشجرة التي أوى إليها موسى فإذا هي شجرة خضراء ترف فأهوى إليها جملي وكان جائعا فأخذها جملي فعالجها ساعة ثم لفظها فدعوت الله لموسى عليه السلام ثم انصرفت وفي رواية عن ابن مسعود أنه ذهب إلى الشجرة التي كلم الله منها موسى كما سيأتي إن شاء الله فالله أعلم وقال السدي كانت الشجرة من شجر السمر وقال عطاء بن السائب لما قال موسى \"رب إني لما أنزلت إلي من خير فقير\" أسمع المرأة."
    },
    {
      "ayah": 25,
      "surah": 28,
      "text": "لما رجعت المرأتان سريعا بالغنم إلى أبيهما أنكر حالهما بسبب مجيئهما سريعا فسألهما عن خبرهما فقصتا عليه ما فعل موسى عليه السلام فبعث إحداهما إليه لتدعوه إلى أبيها قال الله تعالى: \"فجاءته إحداهما تمشي على استحياء\" أي مشي الحرائر كما روي عن أمير المؤمنين عمر رضي الله عنه أنه قال: جاءت مستترة بكم درعها وقال ابن أبي حاتم حدثنا أبو نعيم حدثنا إسرائيل عن أبي إسحاق عن عمرو بن ميمون قال: قال عمر رضي الله عنه جاءت تمشي على استحياء قائلة بثوبها على وجهها ليست بسلفع من النساء ولاجة خراجة. هذا إسناد صحيح. قال الجوهري: السلفع من الرجل الجسور ومن النساء الجرية السليطة ومن النوق الشديدة. \"قالت إن أبي يدعوك ليجزيك أجر ما سقيت لنا\" وهذا تأدب في العبارة لم تطلبه طلبا مطلقا لئلا يوهم ريبة بل قالت: إن أبي يدعوك ليجزيك أجر ما سقيت لنا يعني ليثيبك ويكافئك على سقيك لغنمنا \"فلما جاءه وقص عليه القصص\" أي ذكر له ما كان من أمره وما جرى له من السبب الذي خرج من أجله من بلده \"قال لا تخف نجوت من القوم الظالمين\" يقول طب نفسا وقر عينا فقد خرجت من مملكتهم فلا حكم لهم في بلادنا ولهذا قال: \"نجوت من القوم الظالمين\" وقد اختلف المفسرون في هذا الرجل من هو؟ على أقوال أحدها أنه شعيب النبي عليه السلام الذي أرسل إلى أهل مدين وهذا هو المشهور عند كثير من العلماء وقد قاله الحسن البصري وغير واحد ورواه ابن أبي حاتم حدثنا أبي حدثنا عبدالعزيز الأزدي حدثنا مالك بن أنس أنه بلغه أن شعيبا هو الذي قص عليه موسى القصص قال: \"لا تخف نجوت من القوم الظالمين\" وقد روى الطبراني عن سلمة بن سعد الغزي أنه وفد على رسول الله صلى الله عليه وسلم فقال له: \"مرحبا بقوم شعيب وأختان موسى هديت\" وقال آخرون بل كان ابن أخي شعيب وقيل رجل مؤمن من قوم شعيب وقال آخرون كان شعيب قبل زمان موسى عليه السلام بمدة طويلة لأنه قال لقومه \"وما قوم لوط منكم ببعيد\" وقد كان هلاك قوم لوط في زمن الخليل عليه السلام بنص القرآن وقد علم أنه كان بين الخليل وموسى عليهما السلام مدة طويلة تزيد على أربعمائة سنة كما ذكره غير واحد. وما قيل إن شعيبا عاش مدة طويلة إنما هو والله أعلم احتراز من هذا الإشكال ثم من المقوي لكونه ليس بشعيب أنه لو كان إياه لأوشك أن ينص على اسمه في القرآن ههنا وما جاء في بعض الأحاديث من التصريح بذكره في قصة موسى لم يصح إسناده كما سنذكره قريبا إن شاء الله ثم من الموجود في كتب بني إسرائيل أن هذا الرجل اسمه ثيرون والله أعلم قال أبو عبيدة بن عبدالله بن مسعود: ثيرون هو ابن أخي شعيب عليه السلام وعن أبي حمزة عن ابن عباس قال الذي استأجر موسى يثرى صاحب مدين رواه ابن جرير به ثم قال الصواب أن هذا لا يدرك إلا بخبر ولا خبر تجب به الحجة في ذلك."
    },
    {
      "ayah": 26,
      "surah": 28,
      "text": "وقوله تعالى: \"قالت إحداهما يا أبت استأجره إن خير من استأجرت القوي الأمين\" أي قالت إحدى ابنتي هذا الرجل قيل هي التي ذهبت وراء موسى عليه السلام قالت لأبيها \"يا أبت استأجره\" أي لرعية هذه الغنم قال عمر وابن عباس وشريح القاضي وأبو مالك وقتادة ومحمد بن إسحاق وغير واحد لما قالت: \"إن خير من استأجرت القوى الأمين\" قال لها أبوها وما علمك بذلك؟ قالت له إنه رفع الصخرة التي لا يطيق حملها إلا عشرة رجال وإني لما جئت معه تقدمت أمامه فقال لي كوني من ورائي فإذا اختلف علي الطريق فاحذفي لي بحصاة أعلم بها كيف الطريق لأهتدي إليه وقال سفيان الثوري عن أبي إسحاق عن أبي عبيدة عن عبدالله هو ابن مسعود قال: أفرس الناس ثلاثة: أبو بكر حين تفرس في عمر وصاحب يوسف حين قال أكرمي مثواه وصاحبة موسى حين قالت: \"يا أبت استأجره إن خير من استأجرت القوى الأمين\"."
    },
    {
      "ayah": 27,
      "surah": 28,
      "text": "قال: \"إني أريد أن أنكحك إحدى ابنتي هاتين\" أي طلب إليه هذا الرجل الشيخ الكبير أن يرعى غنمه ويزوجه إحدى ابنتيه هاتين قال شعيب الجبائي وهما صفوريا وليا وقال محمد بن إسحاق صفوريا وشرفا ويقال ليا وقد استدل أصحاب أبي حنيفة بهذه الآية على صحة البيع فيما إذا قال بعتك أحد هذين العبدين بمائه فقال اشتريت أنه يصح والله أعلم وقوله: \"على أن تأجرني ثماني حجج فإن أتممت عشرا فمن عندك\" أي على أن ترعى غنمي ثماني سنين فإن تبرعت بزيادة سنتين فهو إليك وإلا ففي الثمان كفاية \"وما أريد أن أشق عليك ستجدني إن شاء الله من الصالحين\" أي لا أشاقك ولا أؤذيك ولا أماريك وقد استدلوا بهذه الآية الكريمة لمذهب الأوزاعي فيما إذا قال بعتك هذا بعشرة نقدا أو بعشرين نسيئة أنه يصح ويختار المشتري بأيهما أخذه صح وحمل الحديث المروي في سنن أبى داود \"من باع بيعتين في بيعة فله أوكسهما أو الربا\" على هذا المذهب وفي الاستدلال بهذه الآية وهذا الحديث على هذا المذهب نظر ليس هذا موضع بسطه لطوله والله أعلم. ثم قد استدل أصحاب الإمام أحمد ومن تبعهم في صحة استئجار الأجير بالطعمة والكسوة بهذه الآية واستأنسوا في ذلك بما رواه أبو عبدالله محمد بن يزيد بن ماجه في كتابه السنن حيث قال باب استئجار الأجير على طعام بطنه حدثنا محمد ثنا محمد بن المصقي الحمصي حاثنا بقية بن الوليد عن مسلمة بن علي عن سعيد بن أبي أيوب الحارث بن يزيد عن علي بن رباح قال سمعت عتبة بن المنذر السلمي يقول كنا عند رسول الله صلى الله عليه وسلم فقرأ طسم حتى إذا بلغ قصة موسى قال: \"إن موسى آجر نفسه ثماني سنين أو عشرة سنين على عفة فرجه وطعام بطنه\" وهذا الحديث من هذا الوجه ضعيف لأن مسلمة بن على وهو الخشني الدمشقي البلاطي ضعيف الرواية عند الأئمة ولكن قد روي من وجه آخر وفيه نظر أيضا وقال ابن أبي حاتم حدثنا أبو زرعة حدثنا صفوان حدثنا الوليد حدثنا عبدالله بن لهيعة عن الحارث بن يزيد الحضرمي عن علي بن رباح اللخمي قال سمعت عتبة بن المنذر السلمي صاحب رسول الله صلى الله عليه وسلم يحدث أن رسول الله صلى الله عليه وسلم قال: \"إن موسى عليه السلام آجر نفسه بعفة فرجه وطعمة بطنه\"."
    },
    {
      "ayah": 28,
      "surah": 28,
      "text": "وقوله تعالى إخبارا عن موسى: \"قال ذلك بيني وبينك أيما الأجلين قضيت فلا عدوان علي والله على ما نقول وكيل\" يقول إن موسى قال لصهره الأمر على ما قلت من أنك استأجرتني على ثمان سنين فإن أتممت عشرا فمن عندي فأنا متى فعلت أقلهما فقد برئت من العهد وخرجت من الشرط ولهذا قال: \"أيما الأجلين قضيت فلا عدوان علي\" أي فلا حرج علي مع أن الكامل وإن كان مباحا لكنه فاضل من جهة أخرى بدليل من خارج كما قال تعالى: \"فمن تعجل في يومين فلا إثم عليه ومن تأخر فلا إثم عليه\" وقال رسول الله صلى الله عليه وسلم لحمزة بن عمرو الأسلمي رضي الله عنه وكان كثير الصيام وسأله عن الصوم في السفر فقال: \"إن شئت فصم وإن شئت فأفطر\" مع أن فعل الصيام راجح من دليل آخر هذا وقد دل الدليل على أن موسى عليه السلام إنما فعل أكمل الأجلين وأتمهما وقال البخاري حدثنا محمد بن عبدالرحيم حدثنا سعيد بن سليمان حدثنا مروان بن شجاع عن سالم الأفطس عن سعيد بن جبير قال: قال سألني يهودي من أهل الحيرة أي الأجلين قضى موسى؟ فقلت لا أدري حتى أقدم على حبر العرب فأسأله فقدمت على ابن عباس رضي الله عنه فسألته فقال قضى أكثرهما وأطيبهما إن رسول الله إذا قال فعل. هكذا رواه حكيم بن جبير وغيره عن سعيد بن جبير ووقع في حديث الفتون رواية القاسم بن أبي أيوب عن سعيد بن جبير أن الذي سأله رجل من أهل النصرانية والأول أشبه والله أعلم وقد روي من حديث ابن عباس مرفوعا قال ابن جرير حدثنا أحمد بن محمد الطوسي حدثنا الحميدي حدثنا سفيان حدثني إبراهيم بن يحيى بن أبي يعقوب عن الحكم بن أبان عن عكرمة عن ابن عباس أن رسول الله صلى الله عليه وسلم قال: \"سألت جبريل أي الأجلين قضى موسى قال أتمهما وأكملهما\" ورواه ابن أبي حاتم عن أبيه عن الحميدي عن سفيان وهو ابن عيينة حدثني إبراهيم بن يحيى بن أبي يعقوب وكان من أسناني أو أصغر مني فذكره. وفي إسناده قلب وإبراهيم هذا ليس بمعروف. ورواه البزار عن أحمد بن أبان القرشي عن سفيان بن عيينة عن إبراهيم بن أعين عن الحكم بن أبان عن عكرمة عن ابن عباس عن النبي صلى الله عليه وسلم فذكره ثم قال لا نعرفه مرفوعا عن ابن عباس إلا من هذا الوجه. ثم قال ابن أبي حاتم قرئ على يونس بن عبدالأعلى أنبأنا ابن وهب أنبأنا عمرو بن الحارث عن يحيى بن ميمون الحضرمي عن يوسف بن تيرح أن رسول الله صلى الله عليه وسلم سئل أي الأجلين قضى موسى؟ قال: \"لا علم لي\" فسأل رسول الله صلى الله عليه وسلم جبريل فقال جبريل لا علم لي فسأل جبريل ملكا فوقه فقال لا علم لي فسأل ذلك الملك ربه عز وجل عما سأله عنه جبريل عما سأله عنه محمد صلى الله عليه وسلم فقال الرب عز وجل قضى أبرهما وأبقاهما أو قال أزكاهما. وهذا مرسل وقد جاء مرسلا من وجه آخر وقال سنيد حدثنا حجاج عن ابن جريج قال: قال مجاهد إن النبي صلى الله عليه وسلم سأل جبريل أي الأجلين قضى موسى ؟ فقال سوف أسأل إسرافيل فسأله فقال سوف أسأل الرب عز وجل فسأله فقال أبرهما وأوفاهما \"طريق أخرى مرسلة أيضا\" قال ابن جرير حدثنا ابن وكيع حدثنا أبو معشر عن محمد بن كعب القرظي قال سئل رسول الله صلى الله عليه وسلم أي الأجلين قضى موسى قال: \"أوفاهما وأتمهما\" فهذه طرق متعاضدة ثم قد روي هذا مرفوعا من رواية أبي ذر رضي الله عنه قال الحافظ أبو بكر البزار حدثنا أبو عبيد الله يحيى بن محمد بن السكن حدثنا إسحاق بن إدريس حدثنا عويذ بن أبى عمران الجوني عن أبيه عن عبدالله بن الصامت عن أبي ذر رضي الله عنه أن النبي صلى الله عليه وسلم سئل أي الأجلين قضى موسى؟ قال: \"أوفاهما وأبرهما قال وإن سئلت أي المرأتين تزوج فقل الصغرى منهما\" ثم قال البزار لا نعلم يروي عن أبي ذر إلا بهذا الإسناد. وقد رواه ابن أبي حاتم من حديث عويذ بن أبي عمران وهو ضعيف ثم قد روي أيضا نحوه من حديث عتبة بن المنذر بزيادة غريبة جدا فقال أبو بكر البزار حدثنا عمر بن الخطاب السجستاني حدثنا يحيى بن بكير حدثنا ابن لهيعة حدثنا الحارث بن يزيد عن علي بن رباح اللخمي قال سمعت عتبة بن المنذر يقول إن رسول الله صلى الله عليه وسلم سئل أي الأجلين قضى موسى قال: \"أبرهما وأوفاهما\" ثم قال النبي صلى الله عليه وسلم: \"إن موسى عليه السلام لما أراد فراق شعيب عليه السلام أمر امرأته أن تسأل أباها أن يعطيها من غنمه ما يعيشون به فأعطاها ما ولدت غنمه في ذلك العام من قالب لون قال فما مرت شاة إلا ضرب موسى جنبها بعصاه فولدت قوالب ألوان كلها وولدت ثنتين وثلاثا كل شاة ليس فيها فشوش ولا ضبوب ولا كميشة تفوت الكف ولا ثعول\" وقال رسول الله: \"إذا فتحتم الشام فإنكم ستجدون بقايا منها وهي السامرية\" هكذا أورده البزار وقد رواه ابن أبي حاتم بأبسط من هذا فقال حدثنا أبو زرعة حدثنا يحيى بن عبدالله بن بكير حدثني عبدالله بن لهيعة ح وحدثنا أبو زرعة حدثنا صفوان أنبأنا الوليد أنبأنا عبدالله بن لهيعة عن الحارث بن يزيد الحضرمي عن علي بن رباح اللخمي قال سمعت عتبة بن المنذر السلمي صاحب رسول الله صلى الله عليه وسلم يحدث أن رسول الله صلى الله عليه وسلم قال: \"إن موسى عليه السلام آجر نفسه بعفة فرجه وطعمة بطنه فلما وفى الأجل - قيل يا رسول الله أي الأجلين؟ قال - أبرهما وأوفاهما فلما أراد فراق شعيب أمر امرأته أن تسأل أباها أن يعطيها من غنمه ما يعيشون به فأعطاها ما ولدت غنمه من قالب لون من ولد ذلك العام وكانت غنمه سوداء حسناء فانطلق موسى عليه السلام إلى عصاه فسماها من طرفها ثم وضعها في أدنى الحوض ثم أوردها فسقاها ووقف موسى بإزاء الحوض فلم يصدر منها شاة إلا وضرب جنبها شاة شاة قال فأتأمت وألبنت ووضعت كلها قوالب ألوان إلا شاة أو شاتين ليس فيها فشوش قال يحيى ولا ضبون وقال صفوان ولا صبوب قال أبو زرعة الصواب طنوب ولا عزوز ولا ثعول ولا كميشه تفوت الكف قال النبي صلى الله عليه وسلم: \"لو افتتحتم الشام وجدتم بقايا تلك الغنم وهي السامرية\" وحدثنا أبو زرعة أنبأنا صفوان قال سمعت الوليد قال سألت ابن لهيعة ما الفشوش؟ قال التي تفش بلبنها واسعة الشخب قلت فما الضبوب قال الطويلة الضرع تجره قلت فما العزوز قال ضيقة الشخب قلت فما الثعول؟ قال التي ليس لها ضرع إلا كهيئة حلمتين قلت فما الكميشة؟ قال التي تفوت الكف كميشة الضرع صغير لا يدركه الكف مدار. هذا الحديث على عبدالله بن لهيعة المصري وفي حفظه سوء وأخشى أن يكون رفعه خطأ والله أعلم. وينبغي أن يروى ليس فيها فشوش ولا عزوز ولا ضبوب ولا ثعول ولا كميشة لتذكر منها صفة ناقصة ما يقابلها من الصفات الناقصة وقد روى ابن جرير من كلام أنس بن مالك موقوفا عليه ما يقارب بعضه بإسناد جيد فقال حدثنا محمد بن المثنى حدثنا معاذ بن هشام حدثنا أبي حدثنا قتادة حدثنا أنس بن مالك رضي الله عنه قال لما دعا نبي الله موسى عليه السلام صاحبه إلى الأجل الذي كان بينهما قال له صاحبه كل شاة ولدت على غير لونها فلك ولدها فعمد موسى فرفع حبالًا على الماء فلما رأت الخيال فزعت فجالت جولة فولدن كلهن بلقا إلا شاة واحدة فذهب بأولادهن كلهن ذلك العام."
    },
    {
      "ayah": 29,
      "surah": 28,
      "text": "قد تقدم في تفسير الآية قبلها أن موسى عليه السلام قضى أتم الأجلين وأوفاهما وأبرهما وأكملهما وأنقاهما وقد يستفاد هذا أيضا من الآية الكريمة حيث قال تعالى \"فلما قضى موسى الأجل\" أي الأكمل منهما والله أعلم وقال ابن أبي نجيح عن مجاهد قضى عشر سنين وبعدها عشرا أخر وهذا القول لم أره لغيره وقد حكاه عنه ابن أبي حاتم وابن جرير فالله أعلم وقوله: \"وسار بأهله\" قالوا كان موسى قد اشتاق إلى بلاده وأهله فعزم على زيارتهم في خفية من فرعون وقومه فتحمل بأهله وما كان معه من الغنم التي وهبها له صهره فسلك بهم في ليلة مطيرة مظلمة باردة فنزل منزلا فجعل كلما أورى زنده لا يضيء شيئا فتعجب من ذلك فبينما هو كذلك \"آنس من جانب الطور نارا\" أي رأى نارا تضيء له على بعد \"فقال لأهله امكثوا إني آنست نارا\" أي حتى أذهب إليها \"لعلي آتيكم منها بخبر\" وذلك لأنه قد أضل الطريق \"أو جذوة من النار\" أي قطعة منها \"لعلكم تصطلون\" أي تستدفئون بها من البرد."
    },
    {
      "ayah": 3,
      "surah": 28,
      "text": "وقوله: \"نتلوا عليك من نبإ موسى وفرعون بالحق\" الآية كما قال تعالى: \"نحن نقص عليك أحسن القصص\" أي نذكر لك الأمر على ما كان عليه كأنك تشاهد وكأنك حاضر."
    },
    {
      "ayah": 30,
      "surah": 28,
      "text": "قال الله تعالى: \"فلما أتاها نودي من شاطئ الوادي الأيمن\" أي من جانب الوادي مما يلي الجبل عن يمينه من ناحية الغرب كما قال تعالى: \"وما كنت بجانب الغربي إذ قضينا إلى موسى الأمر\" فهذا مما يرشد إلى أن موسى قصد النار إلى جهة القبلة والجبل الغربي عن يمينه والنار وجدها تضطرم في شجرة خضراء في لحف الجبل مما يلي الوادي فوقف باهتا في أمرها فناداه ربه \"من شاطئ الواد الأيمن في البقعة المباركة من الشجرة\" قال ابن جرير حدثنا ابن وكيع حدثنا أبو معاوية عن الأعمش عن عمرو بن مرة عن أبي عبيدة عن عبدالله قال: رأيت الشجرة التي نودي منها موسى عليه السلام سمرة خضراء ترف إسناده مقارب وقال محمد بن إسحاق عن بعض من لا يتهم عن وهب بن منبه قال: شجرة من العليق وبعض أهل الكتاب يقول إنها من العوسج وقال قتادة هي من العوسج وعصاه من العوسج وقوله تعالى: \"أن يا موسى إني أنا الله رب العالمين\" أي الذي يخاطبك ويكلمك هو رب العالمين الفعال لما يشاء لا إله غيره ولا رب سواه تعالى وتقدس وتنزه عن مماثلة المخلوقات في ذاته وصفاته وأقواله وأفعاله سبحانه."
    },
    {
      "ayah": 31,
      "surah": 28,
      "text": "قوله: \"وأن ألق عصاك\" أي التي في يدك كما قرره على ذلك في قوله تعالى: \"وما تلك بيمينك يا موسى قال هي عصاي أتوكأ عليها وأهش بها علي غنمي ولي فيها مآرب أخرى\" والمعنى أما هذه عصاك التي تعرفها\" ألقها فألقاها فإذا هي حية تسعى\" فعرف وتحقق أن الذي يكلمه ويخاطبه هو الذي يقول للشيء كن فيكون كما تقدم بيان ذلك في سورة طه: وقال ههنا \"فلما رآها تهتز\" أي تضطرب \"كأنها جان ولى مدبرا\" أي في حركتها السريعة مع عظم خلقتها وقوائمها واتساع فمها واصطكاك أنيابها وأضراسها بحيث لا تمر بصخرة إلا ابتلعتها تنحدر في فيها تتقعقع كأنها حادرة في واد فعند ذلك \"ولى مدبرا ولم يعقب\" أي ولم يكن يلتفت لأن طبع البشرية ينفر من ذلك فلما قال الله له \"يا موسى أقبل ولا تخف إنك من الآمنين\" رجع فوقف في مقامه الأول."
    },
    {
      "ayah": 32,
      "surah": 28,
      "text": "قال الله تعالى: \"اسلك يدك في جيبك تخرج بيضاء من غير سوء\" أي إذا أدخلت يدك في جيب درعك ثم أخرجتها فإنها تخرج تتلألأ كأنها قطعة قمر في لمعان البرق ولهذا قال: \"من غير سوء\" أي من غير برص وقوله تعالى: \"واضمم إليك جناحك من الرهب\" قال مجاهد من الفزع وقال قتادة من الرعب وقال عبدالرحمن ابن زيد بن أسلم وابن جرير مما حصل لك من خوفك من الحية والظاهر أن المراد أعم من هذا وهو أنه أمر عليه السلام إذا خاف من شيء أن يضم إليه جناحه من الرهب وهو يده فإذا فعل ذلك ذهب عنه ما يجده من الخوف وربما إذا استعمل أحد ذلك على سبيل الاقتداء فوضع يده على فؤاده فإنه يزول عنه ما يجده أو يخف إن شاء الله تعالى وبه الثقة. قال ابن أبي حاتم حدثنا علي بن الحسين حدثنا الربيع بن تغلب الشيخ صالح أخبرنا أبو إسماعيل المؤدب عن عبدالله بن مسلم عن مجاهد قال: كان موسى عليه السلام قد ملئ قلبه رعبا من فرعون فكان إذا رآه قال: اللهم إني أدرأ بك في نحره وأعوذ بك من شره فنزع الله ما كان في قلب موسى عليه السلام وجعله في قلب فرعون فكان إذا رآه بال كما يبول الحمار. وقوله تعالى: \"فذانك برهانان من ربك\" يعني إلقاء العصا وجعلها حية تسعى وإدخاله يده في جيبه فتخرج بيضاء من غير سوء دليلان قاطعان واضحان على قدرة الفاعل المختار وصحة نبوة من جري هذا الخارق على يديه ولهذا قال تعالى: \"إلى فرعون وملئه\" أي وقومه من الرؤساء والكبراء والأتباع \"إنهم كانوا قوما فاسقين\" أي خارجين عن طاعة الله مخالفين لأمره ودينه."
    },
    {
      "ayah": 33,
      "surah": 28,
      "text": "لما أمره الله تعالى بالذهاب إلى فرعون الذي إنما خرج من ديار مصر فرارا منه وخوفا من سطوته \"قال رب إني قتلت منهم نفسا\" يعني ذلك القبطي \"فأخاف أن يقتلون\" أي إذا رأوني."
    },
    {
      "ayah": 34,
      "surah": 28,
      "text": "\"وأخي هارون هو أفصح مني لسانا\" وذلك أن موسى عليه السلام كان في لسانه لثغة بسبب ما كان تناول تلك الجمرة حين خير بينها وبين التمرة أو الدرة فأخذ الجمرة فوضعها على لسانه فحصل فيه شدة في التعبير ولهذا قال: \"واحلل عقدة من لساني يفقهوا قولي واجعل لي وزيرا من أهلي هارون أخي اشدد به أزري وأشركه في أمري\" أي يؤنسني فيما أمرتني به من هذا المقام العظيم وهو القيام بأعباء النبوة والرسالة إلى هذا الملك المتكبر الجبار العنيد ولهذا قال: \"وأخي هارون هو أفصح مني لسانا فأرسله معي ردءا\" أي وزيرا ومعينا ومقويا لأمري يصدقني فيما أقوله وأخبر به عن الله عز وجل لأن خبر الاثنين أنجع في النفوس من خبر الواحد ولهذا قال: \"إني أخاف أن يكذبون\" وقال محمد بن إسحاق \"ردءا يصدقني\" أي يبين لهم عني ما أكلمهم به فإنه يفهم عني ما لا يفهمون."
    },
    {
      "ayah": 35,
      "surah": 28,
      "text": "لما سأل ذلك موسى قال الله تعالى: \"سنشد عضدك بأخيك\" أي سنقوي أمرك ونعز جانبك بأخيك الذي سألت له أن يكون نبيًا معك كما في الآية الأخرى \"قد أوتيت سؤلك يا موسى\" وقال تعالى: \"ووهبنا له من رحمتنا أخاه هارون نبيا\" ولهذا قال بعض السلف ليس أحد أعظم منة على أخيه من موسى على هارون عليهما السلام فإنه شفع فيه حتى جعله الله نبيا ورسولا معه إلى فرعون وملئه ولهذا قال تعالى في حق موسى \"وكان عند الله وجيها\" وقوله تعالى: \"ونجعل لكما سلطانا\" أي حجة قاهرة \"فلا يصلون إليكما بآياتنا\" أي لا سبيل لهم إلى الوصول إلى أذاكما بسبب إبلاغكما آيات الله كما قال تعالى: \"يا أيها الرسول بلغ ما أنزل إليك من ربك -إلى قوله - والله يعصمك من الناس\" وقال تعالى: \"الذين يبلغون رسالات الله -إلى قوله - وكفى بالله حسيبا\" أي وكفى بالله ناصرا ومعينا ومؤيدا ولهذا أخبرهما أن العاقبة لهما ولمن اتبعهما في الدنيا والآخرة فقال تعالى: \"أنتما ومن اتبعكما الغالبون\" كما قال تعالى: \"كتب الله لأغلبن أنا ورسلي إن الله قوي عزيز\" وقال تعالى: \"إنا لننصر رسلنا والذين آمنوا في الحياة الدنيا\" إلى آخر الآية ووجه ابن جرير على أن المعنى ونجعل لكما سلطانا فلا يصلون إليكما ثم يبتدئ فيقول: \"بآياتنا أنتما ومن اتبعكما الغالبون\" تقديره أنتما ومن اتبعكما الغالبون بآياتنا ولا شك أن هذا المعنى صحيح وهو حاصل من التوجيه الأول فلا حاجة إلى هذا والله أعلم."
    },
    {
      "ayah": 36,
      "surah": 28,
      "text": "يخبر تعالى عن مجيء موسى وأخيه هارون إلى فرعون وملئه وعرضه ما آتاهما الله من المعجزات الباهرة والدلالة القاهرة على صدقهما فيما أخبرا به عن الله عز وجل توحيده واتباع أوامره فلما عاين فرعون وملؤه ذلك وشاهدوه وتحققوه وأيقنوا أنه من عند الله عدلوا بكفرهم وبغيهم إلى العناد والمباهتة وذلك لطغيانهم وتكبرهم عن اتباع الحق فقالوا: \"ما هذا إلا سحر مفترى\" أي مفتعل مصنوع وأرادوا معارضته بالحيلة والجاه فما صعد معهم ذلك وقوله: \"وما سمعنا بهذا في آبائنا الأولين\" يعنون عبادة الله وحده لا شريك له يقولون ما رأينا أحدا من آبائنا على هذا الدين ولم نر الناس إلا يشركون مع الله آلهة أخرى."
    },
    {
      "ayah": 37,
      "surah": 28,
      "text": "قال موسى مجيبا لهم \"ربي أعلم بمن جاء بالهدى من عنده\" يعني مني ومنكم وسيفصل بيني وبينكم ولهذا قال: \"ومن تكون له عاقبة الدار\" أي من النصرة والظفر والتأييد \"إنه لا يفلح الظالمون \"أي المشركون بالله عز وجل."
    },
    {
      "ayah": 38,
      "surah": 28,
      "text": "يخبر تعالى عن كفر فرعون وطغيانه وافترائه في دعواه الإلهية لنفسه القبيحة لعنه الله كما قال الله تعالى: \"فاستخف قومه فأطاعوه\" الآية وذلك لأنه دعاهم إلى الاعتراف له بالإلهية فأجابوه إلى ذلك بقلة عقولهم وسخافة أذهانهم ولهذا قال: \"يا أيها الملأ ما علمت لكم من إله غيري\" وقال تعالى إخبارا عنه \"فحشر فنادى فقال أنا ربكم الأعلى فأخذه الله نكال الآخرة والأولى إن في ذلك لعبرة لمن يخشى\" يعني أنه جمع قومه ونادى فيهم بصوته العالي مصرحا لهم بذلك فأجابوه سامعين مطيعين ولهذا انتقم الله تعالى منه فجعله عبرة لغيره في الدنيا والآخرة وحتى أنه واجه موسى الكليم بذلك فقال: \"لئن اتخذت إلها غيري لأجعلنك من المسجونين\" وقوله: \"فأوقد لي يا هامان على الطين فاجعل صرحا لعلي أطلع إلى إله موسى\" يعني أمر وزيره هامان ومدبر رعيته ومشير دولته أن يوقد له على الطين يعني يتخذ له آجرا لبناء الصرح وهو القصر المنيف الرفيع العالي كما قال في الآية الأخرى \"وقال فرعون يا هامان ابن لي صرحا لعلي أبلغ الأسباب أسباب السماوات فأطلع إلى إله موسى وإني لأظنه كاذبا وكذلك زين لفرعون سوء عمله وصد عن السبيل وما كيد فرعون إلا في تباب\" وذلك لأن فرعون بنى هذا الصرح الذي لم ير في الدنيا بناء أعلى منه إنما أراد بهذا أن يظهر لرعيته تكذيب موسى فيما زعمه من دعوى إله غير فرعون ولهذا قال: \"وإني لأظنه من الكاذبين\" أي في قوله إن ثم ربا غيري لا أنه كذبه في أن الله تعالى أرسله لأنه لم يكن يعترف بوجود الصانع جل وعلا فإنه قال: \"وما رب العالمين\" وقال: \"لئن اتخذت إلها غيري لأجعلنك من المسجونين\" وقال: \"يا أيها الملأ ما علمت لكم من إله غيري\" وهذا قول ابن جرير."
    },
    {
      "ayah": 39,
      "surah": 28,
      "text": "وقوله تعالى: \"واستكبر هو وجنوده في الأرض بغير الحق وظنوا أنهم إلينا لا يرجعون\" أي طغوا وتجبروا وأكثروا في الأرض الفساد واعتقدوا أنه لا قيامة ولا معاد \"فصب عليهم ربك سوط عذاب إن ربك لبالمرصاد\"."
    },
    {
      "ayah": 4,
      "surah": 28,
      "text": "قال تعالى: \"إن فرعون علا في الأرض\" أي تكبر وتجبر وطغى \"وجعل أهلها شيعا\" أي أصنافا قد صرف كل صنف فيما يريد من أمور دولته وقوله تعالى: \"يستضعف طائفة منهم\" يعني بني إسرائيل وكانوا في ذلك الوقت خيار أهل زمانهم هذا وقد سلط عليهم هذا الملك الجبار العتيد يستعملهم في أخس الأعمال ويكدهم ليلا ونهارا في أشغاله وأشغال رعيته ويقتل مع هذا أبناءهم ويستحيي نساءهم إهانة لهم واحتقارا وخوفا من أن يوجد منهم الغلام الذي كان قد تخوف هو وأهل مملكته منه أن يوجد منهم غلام يكون سبب هلاكه وذهاب دولته على يديه. وكانت القبط قد تلقوا هذا من بني إسرائيل فيما كانوا يدرسونه من قول إبراهيم الخليل عليه السلام حين ورد الديار المصرية وجرى له مع جبارها ما جرى حين أخذ سارة ليتخذها جارية فصانها الله منه ومنعه منها بقدرته وسلطانه فبشر إبراهيم عليه السلام ولده أنه سيولد من صلبه وذريته من يكون هلاك مصر على يديه فكانت القبط تحدث بهذا عند فرعون فاحترز فرعون من ذلك وأمر بقتل ذكور بني إسرائيل ولن ينفع حذر من قدر لأن أجل الله إذا جاء لا يؤخر ولكل أجل كتاب."
    },
    {
      "ayah": 40,
      "surah": 28,
      "text": "قال تعالى ههنا \"فأخذناه وجنوده فنبذناهم في اليم\" أي أغرقناهم في البحر في صبيحة واحدة فلم يبق سهم أحد \"فانظر كيف كان عاقبة الظالمين \"."
    },
    {
      "ayah": 41,
      "surah": 28,
      "text": "\" وجعلناهم أئمة يدعون إلى النار\" أي لمن سلك وراءهم وأخذ بطريقتهم في تكذيب الرسل وتعطيل الصانع \"ويوم القيامة لا ينصرون\" أي فاجتمع عليهم خزي الدنيا موصولا بذل الآخرة كما قال تعالى: \"أهلكناهم فلا ناصر لهم\"."
    },
    {
      "ayah": 42,
      "surah": 28,
      "text": "قوله تعالى: \"وأتبعناهم في هذه الدنيا لعنة\" أي وشرع الله لعنتهم ولعنة ملكهم فرعون على ألسنة المؤمنين من عباده المتبعين لرسله كما أنهم في الدنيا ملعونون على ألسنة الأنبياء وأتباعهم كذلك \"ويوم القيامة هم من المقبوحين\" قال قتادة: وهذه الآية كقوله تعالى: \"وأتبعوا في هذه لعنة ويوم القيامة بئس الرفد المرفود\"."
    },
    {
      "ayah": 43,
      "surah": 28,
      "text": "يخبر تعالى عما أنعم به على عبده ورسوله موسى الكليم عليه من ربه أفضل الصلاة والتسليم من إنزال التوراة عليه بعدما أهلك فرعون وملأه. وقوله تعالى: \"من بعد ما أهلكنا القرون الأولى\" يعني أنه بعد إنزال التوراة لم يعذب أمة بعامة بل أمر المؤمنين أن يقاتلوا أعداء الله من المشركين كما قال تعالى: \"وجاء فرعون ومن قبله والمؤتفكات بالخاطئة فعصوا رسول ربهم فأخذهم أخذة رابية\" وقال ابن جرير حدثنا ابن بشار حدثنا محمد بن عبدالوهاب قالا حدثنا عوف عن أبي نضرة عن أبي سعيد الخدري قال ما أهلك الله قوما بعذاب من السماء لا من الأرض بعدما أنزلت التوراة على وجه الأرض غير أهل القرية الذين مسخوا قردة بعد موسى ثم قرأ \"ولقد آتينا موسى الكتاب من بعد ما أهلكنا القرون الأولى\" الآية ورواه ابن أبي حاتم من حديث عوف بن أبي حبيبة الأعرابي بنحوه وهكذا رواه أبو بكر البزار في مسنده عن عمرو بن علي الفلاس عن يحيى القطان عن عوف عن أبي نضرة عن أبي سعيد موقوفا ثم رواه عن نصر بن علي عن عبدالأعلى عن عوف عن أبي نضرة عن أبي سعيد رفعه إلى النبي صلى الله عليه وسلم قال: \"ما أهلك الله قوما بعذاب من السماء ولا من الأرض إلا قبل موسى\" ثم قرأ: \"ولقد آتينا موسى الكتاب من بعد ما أهلكنا القرون الأولى\" الآية. وقوله: \"بصائر للناس وهدى ورحمة\" أي من العمى والغي وهدى إلى الحق ورحمة أي إرشادا إلى العمل الصالح \"لعلهم يتذكرون\" أي لعل الناس يتذكرون به ويهتدون بسببه."
    },
    {
      "ayah": 44,
      "surah": 28,
      "text": "يقول تعالى منبها على برهان نبوة محمد صلى الله عليه وسلم حيث أخبر بالغيوب الماضية خبرا كأن سامعه شاهد وراء لما تقدم وهو رجل أمي لا يقرأ شيئا من الكتب نشأ بين قوم لا يعرفون شيئا من ذلك كما أنه لما أخبره عن مريم وما كان من أمرها قال تعالى: \"وما كنت لديهم إذ يلقون أقلامهم أيهم يكفل مريم وما كنت لديهم إذ يختصمون\" الآية أي وما كنت حاضرا لذلك ولكن الله أوحاه إليك وهكذا لما أخبره عن نوح وقومه وما كان من إنجاء الله له وإغراق قومه ثم قال تعالى: \"تلك من أنباء الغيب نوحيها إليك ما كنت تعلمها أنت ولا قومك من قبل هذا فاصبر إن العاقبة للمتقين\" الآية وقال في آخر السورة \"ذلك من أنباء القرى نقصه عليك\" وقال بعد ذكر قصة يوسف \"ذلك من أنباء الغيب نوحيه إليك وما كنت لديهم إذ أجمعوا أمرهم وهم يمكرون\" الآية وقال في سورة طه \"كذلك نقص عليك من أنباء ما قد سبق\" الآية وقال ههنا بعدما أخبر عن قصة موسى من أولها إلى آخرها وكيف كان ابتداء إيحاء الله إليه وتكليمه له \"وما كنت بجانب الغربي إذ قضينا إلى موسى الأمر\" يعني ما كنت يا محمد بجانب الجبل الغربي الذي كلم الله موسى من الشجرة التي هي شرقية على شاطئ الوادي \"وما كنت من الشاهدين\" لذلك."
    },
    {
      "ayah": 45,
      "surah": 28,
      "text": "ولكن الله سبحانه وتعالى أوحى إليك ذلك ليكون حجة وبرهانا على قرون قد تطاول عهدها ونسوا حجج الله عليهم وما أوحاه إلى الأنبياء المتقدمين وقوله تعالى: \"وما كنت ثاويا في أهل مدين تتلوا عليهم آياتنا\" أي وما كنت مقيما في أهل مدين تتلوا عليهم آياتنا حين أخبرت عن نبيها شعيب وما قال لقومه وما ردوا عليه \"ولكنا كنا مرسلين\" أي ولكن نحن أوحينا إليك ذلك وأرسلناك إلى الناس رسولا."
    },
    {
      "ayah": 46,
      "surah": 28,
      "text": "\"وما كنت بجانب الطور إذ نادينا\" قال أبو عبدالرحمن النسائي في التفسير من سننه أخبرنا علي بن حجر أخبرنا عيسى بن يونس عن حمزة الزيات عن الأعمشي عن علي بن مدرك عن أبي زرعة عن أبي هريرة رضي الله عنه \"وما كنت بجانب الطور إذ نادينا\" قال نودوا أن: يا أمة محمد أعطيتكم قبل أن تسألوني وأجبتكم قبل أن تدعوني وهكذا رواه ابن جرير وابن أبي حاتم من حديث جماعة عن حمزة وهو ابن حبيب الزيات عن الأعمش ورواه ابن جرير من حديث وكيع ويحيى بن عيسى عن الأعمش عن علي بن مدرك عن أبي زرعة وهو ابن عمرو بن جرير أنه قال ذلك من كلامه والله أعلم. وقال مقاتل بن حيان \"وما كنت بجانب الطور إذ نادينا\" أمتك في أصلاب آبائهم أن يؤمنوا بك إذا بعثت وقال قتادة \"وما كنت بجانب الطور إذ نادينا\" موسى وهذا والله أعلم أشبه بقوله تعالى: \"وما كنت بجانب الغربي إذ قضينا إلى موسى الأمر\" ثم أخبر ههنا بصيغة أخرى أخص من ذلك وهو النداء كما قال تعالى: \"وإذ نادى ربك موسى\" وقال تعالى: \"إذ ناداه ربه بالوادي المقدس طوى\" وقال تعالى: \"وناديناه من جانب الطور الأيمن وقربناه نجيا\" وقوله تعالى: \"ولكن رحمة من ربك\" أي ما كنت مشاهدا لشيء من ذلك ولكن الله تعالى أوحاه إليك وأخبرك به رحمة منه بك وبالعباد بإرسالك إليهم \"لتنذر قوما ما أتاهم من نذير من قبلك لعلهم يتذكرون\" أي لعلهم يهتدون بما جئتهم به من الله عز وجل."
    },
    {
      "ayah": 47,
      "surah": 28,
      "text": "\"ولولا أن تصيبهم مصيبة بما قدمت أيديهم فيقولوا ربنا لولا أرسلت إلينا رسولا\" الآية أي وأرسلناك إليهم لتقيم عليهم الحجة ولينقطع عذرهم إذا جاءهم عذاب من الله بكفرهم فيحتجوا بأنهم لم يأتهم رسول ولا نذير كما قال تعالى بعد ذكره إنزال كتابه المبارك وهو القرآن \"أن تقولوا إنما أنزل الكتاب على طائفتين من قبلنا وإن كنا عن دراستهم لغافلين أو تقولوا لو أنا أنزل علينا الكتاب لنا أهدى منهم فقد جاءكم بينة من ربكم وهدى ورحمة\" وقال تعالى: \"رسلا مبشرين ومنذرين لئلا يكون للناس على الله حجة بعد الرسل\" وقال تعالى: \"يا أهل الكتاب قد جاءكم رسولنا يبين لكم على فترة من الرسل أن تقولوا ما جاءنا من بشير ولا نذير فقد جاءكم بشير ونذير\" الآية والآيات في هذا كثيرة."
    },
    {
      "ayah": 48,
      "surah": 28,
      "text": "يقول تعالى مخبرا عن القوم الذين لو عذبهم قبل قيام الحجة عليهم لاحتجوا بأنهم لم يأتهم رسول أنهم لما جاءهم الحق من عنده على لسان محمد صلى الله عليه وسلم قالوا على وجه التعنت والعناد والكفر والجهل والإلحاد \"لولا أوتي مثل ما أوتي موسى\" الآية يعنون والله أعلم من الآيات الكثيرة مثل العصا واليد والطوفان والجراد والقمل والضفادع والدم وتنقيص الزروع والثمار مما يضيق على أعداء الله وكفلق البحر وتظليل الغمام وإنزال المن والسلوى إلى غير ذلك من الآيات الباهرة والحجج القاهرة التي أجراها الله تعالى علي يدي موسى عليه السلام حجة وبرهانا له على فرعون وملئه وبني إسرائيل مع هذا كله لم ينجع في فرعون وملئه بل كفروا بموسى وأخيه هارون كما قالوا لهما \"أجئتنا لتلفتنا عما وجدنا عليه آباءنا وتكون لكما الكبرياء في الأرضي وما نحن لكما بمؤمنين\" وقال تعالى: \"فكذبوهما فكانوا من المهلكين\" ولهذا قال ههنا \"أو لم يكفروا بما أوتي موسى من قبل\" أي أو لم يكفر البشر بما أوتي موسى من تلك الآيات العظيمة \"قالوا سحران تظاهرا\" أي تعاونا \"وقالوا إنا بكل كافرون\" أي بكل منهما كافرون ولشدة التلازم والتصاحب والمقاربة بين موسى وهارون دل ذكر أحدهما على الآخر كما قال الشاعر: فما أدري إذا يممت أرضـا أريد الخير أيهما يليني أي فما أدرى يليني الخير أو الشر. قال مجاهد: أمرت اليهود قريشا أن يقولوا لمحمد صلى الله عليه وسلم ذلك فقال الله \"أو لم يكفروا بما أوتي موسى من قبل قالوا سحران تظاهرا\" قال يعني موسى وهارون صلى الله عليهما وسلم \"تظاهرا\" أي تعاونا وتناصرا وصدق كل منها الآخر وبهذا قال سعيد بن جبير وأبو رزين في قوله \"ساحران\" يعنون موسى وهارون وهذا قول جيد قوي والله أعلم وقال مسلم بن يسار عن ابن عباس \"قالوا ساحران تظاهرا\" قال يعنون موسى ومحمدا صلى الله عليهما وسلم وهذا رواية الحسن البصري. وقال الحسن وقتادة. يعني عيسى ومحمد صلى الله عليهما وسلم وهذا فيه بعد لأن عيسى لم يجر له ذكر ههنا والله أعلم. وأما من قرأ \"سحران تظاهرا\" فقال علي بن أبي طلحة والعوفي عن ابن عباس يعنون التوراة والقرآن وكذا قال عاصم الجندي والسدي وعبدالرحمن بن زيد بن أسلم قال السدي: يعني صدق كل واحد منهما الآخر وقال عكرمة: يعنون التوراة والإنجيل وهو رواية عن أبي زرعة واختاره ابن جرير. وقال الضحاك وقتادة: الإنجيل والقرآن والله سبحانه وتعالى أعلم بالصواب والظاهر على قراءة \"سحران\" أنهم يعنون التوراة والقرآن. لأنه قال بعده \"قل فأتوا بكتاب من عند الله هو أهدى منهما أتبعه\" وكثيرا ما يقرن الله بين التوراة والقرآن كما في قوله تعالى: \"قل من أنزل الكتاب الذي جاء به موسى نورا وهدى للناس - إلى أن قال - وهذا كتاب أنزلناه مبارك\" وقال في آخر السورة \"ثم آتينا موسى الكتاب تماما على الذي أحسن\" الآية وقال: \"وهذا كتاب أنزلناه مبارك فاتبعوه واتقوا لعلكم ترحمون\" وقالت الجن \"إنا سمعنا كتابًا أنزل من بعد موسى مصدقا لما بين يديه\" وقال ورقة بن نوفل: هذا الناموس الذي أنزل على موسى. وقد علم بالضرورة لذوي الألباب أن الله تعالى لم ينزل كتابا من السماء فيما أنزل من الكتب المتعددة على أنبيائه أكمل ولا أشمل ولا أفصح ولا أعظم ولا أشرف من الكتاب الذي أنزل على محمد صلى الله عليه وسلم وهو القرآن وبعده في الشرف والعظمة الكتاب الذي أنزله على موسى بن عمران عليه السلام وهو الكتاب الذي قال الله فيه \"إنا أنزلنا التوراة فيها هدى ونور يحكم بها النبيون الذين أسلموا للذين هادوا والربانيون والأحبار بما استحفظوا من كتاب الله وكانوا عليه شهداء\" والإنجيل إنما أنزل متمما للتوراة ومحلا لبعض ما حرم على بني إسرائيل."
    },
    { "ayah": 49, "surah": 28, "text": "أي فيما تدافعون به الحق وتعارضون به من الباطل." },
    {
      "ayah": 5,
      "surah": 28,
      "text": "قال تعالى: \"ونريد أن نمن على الذين استضعفوا في الأرض - إلى قوله - يحذرون\" وقد فعل تعالى ذلك بهم كما قال تعالى: \"وأورثنا القوم الذين كانوا يستضعفون -إلى قوله - يعرشون\" وقال تعالى: \"كذلك وأورثناها بني إسرائيل\" أراد فرعون بحوله وقوته أن ينجو من موسى فما نفعه من ذلك مع قدرة الملك العظيم الذي لا يخالف أمره القدري ولا يغلب بل نفذ حكمه وجرى قلمه في القدم بأن يكون هلاك فرعون على يديه بل يكون هذا الغلام الذي احترزت من وجوده وقتلت بسببه ألوفا من الولدان إنما منشؤه ومرباه على فراشك وفي دارك وغذاؤه من طعامك وأنت تربيه وتدلله وتتفداه وحتفك وهلاكك وهلاك جنودك على يديه لتعلم أن رب السموات العلا هو القاهر الغالب العظيم القوي العزيز الشديد المحال الذي ما شاء كان وما لم يشأ لم يكن."
    },
    {
      "ayah": 50,
      "surah": 28,
      "text": "قال الله تعالى: \"فإن لم يستجيبوا لك\" أي فإن لم يجيبوك عما قلت لهم ولم يتبعوا الحق \"فاعلم أنما يتبعون أهواءهم\" أي بلا دليل ولا حجة \"ومن أضل ممن اتبع هواه بغير هدى من الله\" أي بغير حجة مأخوذة من كتاب الله \"إن الله لا يهدي القوم الظالمين\"."
    },
    {
      "ayah": 51,
      "surah": 28,
      "text": "وقوله تعالى: \"ولقد وصلنا لهم القول\" قال مجاهد فصلنا لهم القول. وقال السدي بينا لهم القول وقال قتادة: يقول تعالى أخبرهم كيف صنع بمن مضى وكيف هو صانع \"لعلهم يتذكرون\" قال مجاهد وغيره \"وصلنا لهم\" يعني قريشا وهذا هو الظاهر لكن قال حماد بن سلمة عن عمرو بن دينار عن يحيى بن جعدة عن رفاعة - رفاعة هذا هو ابن قرظة القرظي وجعله ابن منده: رفاعة بن شموال خال صفية بن حيي وهو الذي طلق تميمة بنت وهب التي تزوجها بعده عبدالرحمن بن الزبير بن باطا كذا ذكره ابن الأثير- قال نزلت \"ولقد وصلنا لهم القول\" في عشرة أنا أحدهم. رواه ابن جرير وابن أبي حاتم من حديثه."
    },
    {
      "ayah": 52,
      "surah": 28,
      "text": "يخبر تعالى عن العلماء الأولياء من أهل الكتاب أنهم يؤمنون بالقرآن كما قال تعالى: \"الذين آتيناهم الكتاب يتلونه حق تلاوته أولئك يؤمنون به\" وقال تعالى: \"وإن من أهل الكتاب لمن يؤمن بالله وما أنزل إليكم وما أنزل إليهم خاشعين لله\" وقال تعالى: \"إن الذين أوتوا العلم من قبله إذا يتلى عليهم يخرون للأذقان سجدا ويقولون سبحان ربنا إن كان وعد ربنا لمفعولا\" وقال تعالى: \"ولتجدن أقربهم مودة للذين آمنوا الذين قالوا إنا نصارى - إلى قوله - فاكتبنا مع الشاهدين\" قال سعيد بن جبير نزلت في سبع من القسيسين بعثهم النجاشي فلما قدموا على النبي صلى الله عليه وسلم قرأ عليهم \"يس والقرآن الحكيم\" حتى ختمها فجعلوا يبكون وأسلموا ونزلت فيهم هذه الآية الأخرى \"الذين آتيناهم الكتاب من قبله هم به يؤمنون وإذا يتلى عليهم قالوا آمنا به إنه الحق من ربنا إنا كنا من قبله مسلمين\" يعني من قبل هذا القرآن كنا مسلمين أي موحدين مخلصين لله مستجيبين له."
    },
    {
      "ayah": 53,
      "surah": 28,
      "text": "يخبر تعالى عن العلماء الأولياء من أهل الكتاب أنهم يؤمنون بالقرآن كما قال تعالى: \"الذين آتيناهم الكتاب يتلونه حق تلاوته أولئك يؤمنون به\" وقال تعالى: \"وإن من أهل الكتاب لمن يؤمن بالله وما أنزل إليكم وما أنزل إليهم خاشعين لله\" وقال تعالى: \"إن الذين أوتوا العلم من قبله إذا يتلى عليهم يخرون للأذقان سجدا ويقولون سبحان ربنا إن كان وعد ربنا لمفعولا\" وقال تعالى: \"ولتجدن أقربهم مودة للذين آمنوا الذين قالوا إنا نصارى - إلى قوله - فاكتبنا مع الشاهدين\" قال سعيد بن جبير نزلت في سبع من القسيسين بعثهم النجاشي فلما قدموا على النبي صلى الله عليه وسلم قرأ عليهم \"يس والقرآن الحكيم\" حتى ختمها فجعلوا يبكون وأسلموا ونزلت فيهم هذه الآية الأخرى \"الذين آتيناهم الكتاب من قبله هم به يؤمنون وإذا يتلى عليهم قالوا آمنا به إنه الحق من ربنا إنا كنا من قبله مسلمين\" يعني من قبل هذا القرآن كنا مسلمين أي موحدين مخلصين لله مستجيبين له."
    },
    {
      "ayah": 54,
      "surah": 28,
      "text": "قال الله تعالى: \"أولئك يؤتون أجرهم مرتين بما صبروا\" أي هؤلاء المتصفون بهذه الصفة الذين آمنوا بالكتاب الأول ثم بالثاني ولهذا قال: \"بما صبروا\" أي على اتباع الحق فإن تجشم مثل هذا شديد على النفوس. وقد ورد في الصحيح من حديث عامر الشعبي عن أبي بردة عن أبي موسى الأشعري رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: \"ثلاثه يؤتون أجرهم مرتين. رجل من أهل الكتاب آمن بنبيه ثم آمن بي وعبد مملوك أدى حق الله وحق مواليه ورجل كانت له أمة فأدبها فأحسن تأديبها ثم أعتقها فتزوجها\". وقال الإمام أحمد حدثنا يحيى بن إسحاق السيلحيني حدثنا ابن لهيعة عن سليمان بن عبدالرحمن عن القاسم بن أبي أمامة قال: إنى لتحت راحلة رسول الله صلى الله عليه وسلم يوم الفتح فقال قولا حسنا جميلا وقال فيما قال: \"من أسلم من أهل الكتابين فله أجره مرتين وله مالنا وعليه ما علينا\" وقوله تعالى: \"ويدرءون بالحسنة السيئة\" أي لا يقابلون السيء بمثله ولكن يعفون ويصفحون \"ومما رزقناهم ينفقون\" أي ومن الذي رزقهم من الحلال ينفقون على خلق الله في النفقات الواجبة لأهليهم وأقاربهم والزكاة المفروضة والمستحبة من التطوعات وصدقات النفل والقربات."
    },
    {
      "ayah": 55,
      "surah": 28,
      "text": "وقوله تعالى: \"وإذا سمعوا اللغو أعرضوا عنه\" أي لا يخالطون أهله ولا يعاشرونهم بل كما قال تعالى: \"وإذا مروا باللغو مروا كراما\" \"وقالوا لنا أعمالنا ولكم أعمالكم سلام عليكم لا نبتغي الجاهلين\" أي إذا سفه عليهم سفيه وكلمهم بما لا يليق بهم الجواب عنه أعرضوا عنه ولم يقابلوه بمثله من الكلام القبيح ولا يصدر عنهم إلا كلام طيب ولهذا قال عنهم إنهم قالوا: \"لنا أعمالنا ولكم أعمالكم سلام عليكم لا نبتغي الجاهلين\" أي لا نريد طريق الجاهلين ولا نحبها. قال محمد بن إسحاق في السيرة ثم قدم على رسول الله صلى الله عليه وسلم وهو بمكة عشرون رجلا أو قريب من ذلك من النصارى حين بلغهم خبره من الحبشة فوجدوه في المسجد فجلسوا إليه وكلموه وسألوه ورجال من قريش في أنديتهم حول الكعبة فلما فرغوا من مساءلة رسول الله صلى الله عليه وسلم عما أرادوا دعاهم إلى الله تعالى وتلا عليهم القرآن فلما سمعوا القرآن فاضت أعينهم من الدمع ثم استجابوا لله وآمنوا به وصدقوه وعرفوا منه ما كان يوصف لهم في كتابهم من أمره فلما قاموا عنه اعترضهم أبو جهل بن هشام في نفر من قريش فقالوا لهم خيبكم الله من ركب بعثكم من وراءكم من أهل دينكم ترتادون لهم لتأتوهم بخبر الرجل فلم تطمئن مجالسكم عنده حتى فارقتم دينكم وصدقتموه فيما قال ما نعلم ركبًا أحمق منكم أو كما قالوا لهم فقالوا لهم سلام عليكم لا نجاهلكم لنا ما نحن عليه ولكم ما أنتم عليه لم نأل أنفسنا خيرا. قال ويقال إن النفر النصارى من أهل نجران فالله أعلم أي ذلك كان. قال ويقال والله أعلم أن فيهم نزلت هذه الآيات \"الذين أتيناهم الكتاب من قبله هم به يؤمنون - إلى قوله - لا نبتغي الجاهلين\" قال وسألت الزهري عن هذه الآيات فيمن نزلت قال ما زلت أسمع من علمائنا أنهن في النجاشي وأصحابه رضي الله عنهم والآيات اللاتي في سورة المائدة \"ذلك بأن منهم قسيسين ورهبانا ـ إلى قوله - فاكتبنا مع الشاهدين."
    },
    {
      "ayah": 56,
      "surah": 28,
      "text": "يقول تعالى لرسوله صلى الله عليه وسلم إنك يا محمد \"لاتهدي من أحببت\" أي ليس إليك ذلك إنما عليك البلاغ والله يهدي من يشاء وله الحكمة البالغة والحجة الدامغة كما قال تعالى: \"ليس عليك هداهم ولكن الله يهدي من يشاء\". وقال تعالى: \"وما أكثر الناس ولو حرصت بمؤمنين\" وهذه الآية أخص من هذا كله فإنه قال: \"إنك لا تهدى من أحببت ولكن الله يهدي من يشاء وهو أعلم بالمهتدين\" أي هو أعلم بمن يستحق الهداية ممن يستحق الغواية وقد ثبت في الصحيحين أنها نزلت في أبي طالب عم رسول الله صلى الله عليه وسلم وقد كان يحوطه وينصره ويقوم في صفه ويحبه حبا شديدا طبعيا لا شرعيا فلما حضرته الوفاة وحان أجله دعاه رسول الله صلى الله عليه وسلم إلى الإيمان والدخول في الإسلام فسبق القدر فيه واختطف من يده فاستمر على ما كان عليه من الكفر ولله الحكمة التامة. قال الزهري حدثني سعيد بن المسيب عن أبيه وهو المسيب بن حزن المخزومي قال: لما حضرت أبا طالب الوفاة جاءه رسول الله صلى الله عليه وسلم فوجد عنده أبا جهل بن هشام وعبدالله بن أبي أمية بن المغيرة فقال رسول الله صلى الله عليه وسلم: \"يا عم قل لا إله إلا الله كلمة أحاج لك بها عند الله\" فقال أبو جهل وعبدالله بن أبي أمية يا أبا طالب أترغب عن ملة عبدالمطلب؟ فلم يزل رسول الله صلى الله عليه وسلم يعرضها عليه ويعودان له بتلك المقالة حتى كان آخر ما قال هو على ملة عبدالمطلب وأبى أن يقول لا إله إلا الله فقال رسول الله صلى الله عليه وسلم: \"والله لاستغفرن لك ما لم أنه عنك\" فأنزل الله تعالى: \"ما كان للنبي والذين آمنوا أن يستغفروا للمشركين ولو كانوا أولي قربى\" وأنزل في أبي طالب \"إنك لا تهدي من أحببت ولكن الله يهدي من يشاء\" أخرجاه من حديث الزهري وهكذا رواه مسلم في صحيحه والترمذي من حديث يزيد بن كيسان عن أبي حازم عن أبي هريرة قال: لما حضرت وفاة أبي طالب أتاه رسول الله صلى الله عليه وسلم فقال: \"يا عماه قل لا إله إلا الله أشهد لك بها يوم القيامة\" فقال لولا أن تعيرني بها قريش يقولون ما حمله عليه إلا جزع الموت لأقررت بها عينك لا أقولها إلا لأقر بها عينك نزل الله تعالى \"إنك لا تهدي من أحببت ولكن الله يهدي من يشاء وهو أعلم بالمهتدين\" وقال الترمذي حسن غريب لا نعرفه إلا من حديث يزيد بن كيسان ورواه الإمام أحمد عن يحيى بن سعيد القطان عن يزيد بن كيسان حدثني أبو حازم عن أبي هريرة فذكره بنحوه وهكذا قال ابن عباس وابن عمر ومجاهد والشعبي وقتادة إنها نزلت في أبي طالب حين عرض عليه رسول الله صلى الله عليه وسلم أن يقول لا إله إلا الله فأبى عليه ذلك وقال أي ابن أخي ملة الأشياخ وكان آخر ما قاله هو على ملة عبدالمطلب وقال ابن أبي حاتم حدثنا أبي حدثنا أبو سلمة حدثنا حماد بن سلمة حدثنا عبدالله بن عثمان بن خيثم عن سعيد بن أبي راشد قال كان رسول قيصر جاء إلي قال كتب معي قيصر إلى رسول الله صلى الله عليه وسلم كتابا فأتيته فدفعت الكتاب فوضعه في حجره ثم قال: \"ممن الرجل؟ \" قلت من تنوخ قال: \"هل لك في دين أبيك إبراهيم الحنيفية؟\" قلت إني رسول قوم وعلى دينهم حتى أرجع إليهم فضحك رسول الله صلى الله عليه وسلم ونظر إلى أصحابه وقال: \"إنك لا تهدي من أحببت ولكن الله يهدي من يشاء\"."
    },
    {
      "ayah": 57,
      "surah": 28,
      "text": "وقوله تعالى: \"وقالوا إن نتبع الهدى معك نتخطف من أرضنا\" يقول تعالى مخبرا عن اعتذار بعض الكفار في عدم اتباع الهدى حيث قالوا لرسول الله صلى الله عليه وسلم: \"إن نتبع الهدى معك نتخطف من أرضنا\" أي نخشى إن اتبعنا ما جئت به من الهدى وخالفنا من حولنا من أحياء العرب المشركين أن يقصدونا بالأذى والمحاربة ويتخطفونا أينما كنا قال الله تعالى مجيبا لهم \"أو لم نمكن لهم حرما آمنا\" يعني هذا الذي اعتذروا به كذب وباطل لأن الله تعالى جعلهم في بلد أمين وحرم معظم آمن منذ وضع فكيف يكون هذا الحرم آمنا لهم في حال كفرهم وشركهم ولا يكون آمنا لهم وقد أسلموا وتابعوا الحق؟ وقوله تعالى: \"يجبى إليه ثمرات كل شيء\" أي من سائر الثمار مما حوله من الطائف وغيره وكذلك المتاجر والأمتعة \"رزقا من لدنا\" أي من عندنا \"ولكن أكثرهم لا يعلمون\" ولهذا قالوا ما قالوا وقد قال النسائي أنبأنا الحسن بن محمد حدثنا حجاج عن ابن جريج أخبرني ابن أبي مليكة قال: قال عمرو بن شعيب عن ابن عباس ولم يسمعه منه أن الحارث بن عامر بن نوفل الذي قال: \"إن نتبع الهدى معك نتخطف من أرضنا\"."
    },
    {
      "ayah": 58,
      "surah": 28,
      "text": "يقول تعالى معرضا بأهل مكة في قوله تعالى: \"وكم أهلكنا من قرية بطرت معيشتها\" أي طغت وأشرت وكفرت نعمة الله فيما أنعم به عليهم من الأرزاق كما قال في الآية الأخرى \"وضرب الله مثلا قرية كانت آمنة مطمئنة يأتيها رزقها رغدا من كل مكان -إلى قوله - فأخذهم العذاب وهم ظالمون\" ولهذا قال تعالى: \"فتلك مساكنهم لم تسكن من بعدهم إلا قليلا\" أي دثرت ديارهم فلا ترى إلا مساكنهم وقوله تعالى: \"وكنا نحن الوارثين\" أي رجعت خرابا ليس فيها أحد وقد ذكر ابن أبي حاتم ههنا عن ابن مسعود أنه سمع كعبا يقول لعمر: إن سليمان عليه السلام قال للهامة - يعني البومة - مالك لا تأكلين الزرع؟ قالت: لأنه أخرج آدم من الجنة بسببه قال فمالك لا تشربين الماء؟ قالت لأن الله تعالى أغرق قوم نوح به قال فمالك لا تأوين إلا إلى الخراب؟ قالت لأنه ميراث الله تعالى ثم تلا \"وكنا نحن الوارثين\" ثم قال تعالى مخبرا عن عدله وأنه لا يهلك أحدا ظالما له وإنما يهلك من أهلك بعد قيام الحجة عليهم."
    },
    {
      "ayah": 59,
      "surah": 28,
      "text": "قال: \"وما كان ربك مهلك القرى حتى يبعث في أمها\" وهي مكة \"رسولا يتلوا عليهم آياتنا\" فيه دلالة على أن النبي الأمي وهو محمد صلى الله عليه وسلم المبعوث من أم القرى رسول إلى جميع القرى من عرب وأعجام كما قال تعالى: \"لتنذر أم القرى ومن حولها\" وقال تعالى: \"قل يا أيها الناس إني رسول الله إليكم جميعا\" وقال: \"لأنذركم به ومن بلغ\" وقال: \"ومن يكفر به من الأحزاب فالنار موعده\" وتمام الدليل قوله تعالى: \"وإن من قرية إلا نحن مهلكوها قبل يوم القيامة أو معذبوها عذابا شديدا\" فأخبر تعالى أنه سيهلك كل قرية قبل يوم القيامة وقد قال تعالى: \"وما كنا معذبين حتى نبعث رسولا\" فجعل تعالى بعثة النبي الأمي شاملة لجميع القرى لأنه مبعوث إلى أمها وأصلها التي ترجع إليها وثبت في الصحيحين عنه صلوات الله وسلامه عليه أنه قال: \"بعثت إلى الأحمر والأسود\" ولهذا ختم به النبوة والرسالة فلا نبي بعده ولا رسول بل شرعه باق بقاء الليل والنهار إلى يوم القيامة وقيل المراد بقوله: \"حتى يبعث في أمها رسولا\" أي أصلها وعظيمتها كأمهات الرساتيق والأقاليم حكاه الزمخشري وابن الجوزي وغيرهما وليس ببعيد."
    },
    {
      "ayah": 6,
      "surah": 28,
      "text": "قال تعالى: \"ونريد أن نمن على الذين استضعفوا في الأرض - إلى قوله - يحذرون\" وقد فعل تعالى ذلك بهم كما قال تعالى: \"وأورثنا القوم الذين كانوا يستضعفون -إلى قوله - يعرشون\" وقال تعالى: \"كذلك وأورثناها بني إسرائيل\" أراد فرعون بحوله وقوته أن ينجو من موسى فما نفعه من ذلك مع قدرة الملك العظيم الذي لا يخالف أمره القدري ولا يغلب بل نفذ حكمه وجرى قلمه في القدم بأن يكون هلاك فرعون على يديه بل يكون هذا الغلام الذي احترزت من وجوده وقتلت بسببه ألوفا من الولدان إنما منشؤه ومرباه على فراشك وفي دارك وغذاؤه من طعامك وأنت تربيه وتدلله وتتفداه وحتفك وهلاكك وهلاك جنودك على يديه لتعلم أن رب السموات العلا هو القاهر الغالب العظيم القوي العزيز الشديد المحال الذي ما شاء كان وما لم يشأ لم يكن."
    },
    {
      "ayah": 60,
      "surah": 28,
      "text": "يقول تعالى مخبرا عن حقارة الدنيا وما فيها من الزينة الدنيئة والزهرة الفانية بالنسبة إلى ما أعده الله لعباده الصالحين في الدار الآخرة من النعيم العظيم المقيم كما قال تعالى: \"ما عندكم ينفد وما عند الله باق\" وقال: \"وما عند الله خير للأبرار\" وقال: \"وما الحياة الدنيا في الآخرة إلا متاع\" وقال تعالى: \"بل تؤثرون الحياة الدنيا والآخرة خير وأبقى\" وقال رسول الله صلى الله عليه وسلم: \"والله ما الحياة الدنيا في الآخرة إلا كما يغمس أحدكم أصبعه في اليم فلينظر ماذا يرجع إليه\" وقوله تعالى: \"أفلا تعقلون\" أي أفلا يعقل من يقدم الدنيا على الآخرة."
    },
    {
      "ayah": 61,
      "surah": 28,
      "text": "قوله تعالى: \"أفمن وعدناه وعدا حسنا فهو لاقيه كمن متعناه متاع الحياة الدنيا ثم هو يوم القيامة من المحضرين\" يقول تعالى أفمن هو مؤمن مصدق بما وعده الله على صالح الأعمال من الثواب الذي هو صائر إليه لا محالة كمن هو كافر مكذب بلقاء الله ووعده ووعيده فهو ممتع في الحياة الدنيا أياما قلائل \"ثم هو يوم القيامة من المحضرين\" قال مجاهد وقتادة من المعذبين ثم قد قيل إنها نزلت في رسول الله صلى الله عليه وسلم وفي أبي جهل. وقيل في حمزة وعلي وأبي جهل وكلاهما عن مجاهد والظاهر أنها عامة وهذا كقوله تعالى إخبارا عن ذلك المؤمن حين أشرف على صاحبه وهو في الدرجات وذاك في الدركات فقال: \"ولولا نعمة ربي لكنت من المحضرين\" وقال تعالى: \"ولقد علمت الجنة إنهم لمحضرون\"."
    },
    {
      "ayah": 62,
      "surah": 28,
      "text": "يقول تعالى مخبرا عما يوبخ به الكفار المشركين يوم القيامة حيث يناديهم فيقول: \"أين شركائي الذين كنتم تزعمون\" يعني أين الآلهة التي كنتم تعبدونها في الدار الدنيا من الأصنام والأنداد هل ينصرونكم أو ينتصرون وهذا على سبيل التقريع والتهديد كما قال تعالى: \"ولقد جئتمونا فرادى كما خلقناكم أول مرة وتركتم ما خولناكم وراء ظهوركم وما نرى معكم شفعاءكم الذين زعمتم أنهم فيكم شركاء لقد تقطع بينكم وضل عنكم ما كنتم تزعمون\"."
    },
    {
      "ayah": 63,
      "surah": 28,
      "text": "وقوله: \"قال الذين حق عليهم القول\" يعني الشياطين والمردة والدعاة إلى الكفر \"ربنا هؤلاء الذين أغوينا أغويناهم كما غوينا تبرأنا إليك ما كانوا إيانا يعبدون\" فشهدوا عليهم أنهم أغووهم فاتبعوهم ثم تبرؤا من عبادتهم كما قال تعالى: \"واتخذوا من دون الله آلهة ليكونوا لهم عزا كلا سيكفرون بعبادتهم ويكونون عليهم ضدا\"."
    },
    {
      "ayah": 64,
      "surah": 28,
      "text": "وقال تعالى: \"ومن أضل ممن يدعو من دون الله من لا يستجيب له إلى يوم القيامة وهم عن دعائهم غافلون وإذا حشر الناس كانوا لهم أعداء وكانوا بعبادتهم كافرين\" وقال الخليل عليه السلام لقومه \"إنما اتخذتم من دون الله أوثانا مودة بينكم في الحياة الدنيا ثم يوم القيامة يكفر بعضكم ببعض ويلعن بعضكم بعضا\" الآية وقال الله تعالى: \"إذ تبرأ الذين اتبعوا ورأوا العذاب وتقطعت بهم الأسباب - إلى قوله - وما هم بخارجين من النار\" ولهذا قال: \"وقل ادعوا شركاءكم\" أي ليخلصوكم مما أنتم فيه كما كنتم ترجون منهم في الدار الدنيا \"فدعوهم فلم يستجيبوا لهم ورأوا العذاب\" أي وتيقنوا أنهم صائرون إلى النار لا محالة. وقوله: \"لو أنهم كانوا يهتدون\" أي فودوا حين عاينوا العذاب لو أنهم كانوا من المهتدين في الدار الدنيا وهذا كقوله تعالى: \"ويوم يقول نادوا شركائي الذين زعمتم فدعوهم فلم يستجيبوا لهم وجعلنا بينهم موبقا ورأى المجرمون النار فظنوا أنهم مواقعوها ولم يجدوا عنها مصرفا\"."
    },
    {
      "ayah": 65,
      "surah": 28,
      "text": "وقوله: \"ويوم يناديهم فيقول ماذا أجبتم المرسلين\" النداء الأول عن سؤال التوحيد وهذا فيه إثبات النبوات ماذا كان جوابكم للمرسلين إليكم وكيف كان حالكم معهم وهذا كما يسأل العبد في قبره. من ربك ومن نبيك وما دينك؟ فأما المؤمن فيشهد أنه لا إله إلا الله وأن محمدا عبده ورسوله وأما الكافر فيقول هاه هاه لا أدري ولهذا لا جواب له يوم القيامة غير السكون لأن من كان في هذه أعمى فهو في الآخرة أعمى وأضل سبيلا."
    },
    {
      "ayah": 66,
      "surah": 28,
      "text": "قال تعالى: \"فعميت عليهم الأنباء يومئذ فهم لا يتساءلون\" قال مجاهد فعميت عليهم الحجج فهم لا يتساءلون بالأنساب."
    },
    {
      "ayah": 67,
      "surah": 28,
      "text": "وقوله: \"فأما من تاب وآمن وعمل صالحا\" أي في الدنيا \"فعسى أن يكون من المفلحين\" أي يوم القيامة وعسى من الله موجبة فإن هذا واقع بفضل الله ومنته لا محالة."
    },
    {
      "ayah": 68,
      "surah": 28,
      "text": "يخبر تعالى أنه المنفرد بالخلق والاختيار وأنه ليس له في ذلك منازع ولا معقب قال تعالى: \"وربك يخلق ما يشاء ويختار\" أي ما يشاء فما شاء كان وما لم يشأ لم يكن فالأمور كلها خيرها وشرها بيده ومرجعها إليه. وقوله: \"ما كان لهم الخيرة\" نفي على أصح القولين كقوله تعالى: \"وما كان لمؤمن ولا مؤمنة إذا قضى الله ورسوله أمرا أن يكون لهم الخيرة من أمرهم\" وقد اختار ابن جرير أن \"ما\" ههنا بمعنى الذي تقديره: ويختار الذي لهم فيه خيرة وقد احتج بهذا المسلك طائفة المعتزلة على وجوب مراعاة الأصلح والصحيح أنها نافيه كما نقله ابن أبي حاتم عن ابن عباس وغيره أيضا فإن المقام في بيان انفراده تعالى بالخلق والتقدير والاختيار وأنه لا نظير له في ذلك ولهذا قال: \"سبحان الله وتعالى عما يشركون\" أي من الأصنام والأنداد التي لا تخلق ولا تختار شيئا."
    },
    {
      "ayah": 69,
      "surah": 28,
      "text": "ثم قال تعالى: \"وربك يعلم ما تكن صدورهم وما يعلنون\" أي يعلم ما تكن الضمائر وما تنطوي عليه السرائر كما يعلم ما تبديه الظواهر من سائر الخلائق \"سواء منكم من أسر القول ومن جهر به ومن هو مستخف بالليل وسارب بالنهار\"."
    },
    {
      "ayah": 7,
      "surah": 28,
      "text": "ذكروا أن فرعون لما أكثر من قتل ذكور بني إسرائيل خافت القبط أن يفني بني إسرائيل فيلون هم ما كانوا يلونه من الأعمال الشاقة فقالوا لفرعون إنه يوشك إن استمر هذا الحال أن يموت شيوخهم وغلمانهم يقتلون ونساؤهم لا يمكن أن تقمن بما تقوم به رجالهم من الأعمال فيخلص إلينا ذلك فأمر بقتل الولدان عاما وتركهم عاما فولد هارون عليه السلام في السنة التي يتركون فيها الولدان وولد موسى في السنة التي يقتلون فيها الولدان وكان لفرعون ناس موكلون بذلك وقوابل يدورون على النساء فمن رأينها قد حملت أحصوا اسمها فإذا كان وقت ولادتها لا يقبلها إلا نساء القبط فإن ولدت المرأة جارية تركنها وذهبن وإن ولدت غلاما دخل أولئك الذباحون بأيديهم الشفار المرهفة فقتلوه ومضوا قبحهم الله تعالى. فلما حملت أم موسى به عليه السلام لم يظهر عليها مخايل الحمل كغيرها ولم تفطن لها الدايات ولكن لما وضعته ذكرا ضافت به ذرعا وخافت عليه خوفا شديدا وأحبته حبا زائدا وكان موسى عليه السلام لا يراه أحد إلا أحبه فالسعيد من أحبه طبعا وشرعا قال الله تعالى: \"وألقيت عليك محبة مني\" فلما ضاقت به ذرعا ألهمت في سرها وألقي في خلدها وأنفث في روعها كما قال تعالى: \"وأوحينا إلى أم موسى أن أرضعيه فإذا خفت عليه فألقيه في اليم ولا تخافي ولا تحزني إنا رادوه إليك وجاعلوه من المرسلين\" وذلك أنه كانت دارها على حافة النيل فاتخذت تابوتا ومهدت فيه مهدا وجعلت ترضع ولدها فإذا دخل عليها أحد ممن تخافه ذهبت فوضعته في ذلك التابوت وسيرته في البحر وربطته بحبل عندها فلما كان ذات يوم دخل عليها من تخافه فذهبت فوضعته في ذلك التابوت وأرسلته في البحر وذهلت أن تربطه فذهب مع الماء واحتمله حتى مر به على دار فرعون فالتقطه الجواري فاحتملنه فذهبن به إلى امرأة فرعون ولا يدرين ما فيه وخشين أن يفتتن عليها في فتحه دونها فلما كشفت عنه إذا هو غلام من أحسن الخلق وأجمله وأحلاه وأبهاه فأوقع الله محبته في قلبها حين نظرت إليه وذلك لسعادتها وما أراد الله من كرامتها وشقاوة بعلها."
    },
    {
      "ayah": 70,
      "surah": 28,
      "text": "قوله: \"وهو الله لا إله إلا هو\" أي هو المنفرد بالإلهية فلا معبود سواه كما لا رب يخلق ما يشاء ويختار سواه \"له الحمد في الأولى والآخرة\" أي في جميع ما يفعله هو المحمود عليه بعدله وحكمته \"وله الحكم\" أي الذي لا معقب له لقهره وغلبته وحكمته ورحمته \"وإليه ترجعون\" أي جميعكم يوم القيامة فيجزي كل عامل بعمله من خير وشر ولا يخفى عليه منهم خافية في سائر الأعمال."
    },
    {
      "ayah": 71,
      "surah": 28,
      "text": "يقول تعالى ممتنا على عباده بما سخر لهم من الليل والنهار اللذين لا قوام لهم دونهما وبين أنه لو جعل الليل دائما عليهم سرمدا إلى يوم القيامة لأضر ذلك بهم ولسئمته النفوس وانحصرت منه ولهذا قال تعالى: \"من إله غير الله يأتيكم بضياء\" أي تبصرون به وتستأنسون بسببه \"أفلا تسمعون\"."
    },
    {
      "ayah": 72,
      "surah": 28,
      "text": "أخبر تعالى أنه لو جعل النهار سرمدا أي دائما مستمرا إلى يوم القيامة لأضر ذلك بهم ولتعبت الأبدان وكلت من كثرة الحركات والأشغال ولهذا قال تعالى: \"من إله غير الله يأتيكم بليل تسكنون فيه\" أي تستريحون من حركاتكم وأشغالكم \"أفلا تبصرون\"."
    },
    {
      "ayah": 73,
      "surah": 28,
      "text": "\"ومن رحمته\" أي بكم \"جعل لكم الليل والنهار\" أي خلق هذا وهذا \"لتسكنوا فيه\" أي في الليل \"ولتبتغوا من فضله\" أي في النهار بالأسفار والترحال والحركات والأشغال وهذا من باب اللف والنشر. وقوله: \"ولعلكم تشكرون\" أي تشكرون الله بأنواع العبادات في الليل والنهار ومن فاته شيء بالليل استدركه بالنهار أو بالنهار استدركه بالليل كما قال تعالى: \"وهو الذي جعل الليل والنهار خلفة لمن أراد أن يذكر أو أراد شكورا\" والآيات في هذا كثيرة."
    },
    {
      "ayah": 74,
      "surah": 28,
      "text": "وهذا أيضا نداء ثان على سبيل التوبيخ والتقريع لمن عبد مع الله إلها آخر يناديهم الرب تعالى على رءوس الأشهاد فيقول. \"أين شركائي الذين كنتم تزعمون\" أي في دار الدنيا."
    },
    {
      "ayah": 75,
      "surah": 28,
      "text": "\"ونزعنا من كل أمة شهيدا\" قال مجاهد: يعني رسولا \"فقلنا هاتوا برهانكم\" أي على صحة ما ادعيتموه من أن لله شركاء \"فعلموا أن الحق لله\" أي لا إله غيره فلم ينطقوا ولا يحيروا جوابا \"وضل عنهم ما كانوا يفترون\" أي ذهبوا فلم ينفعوهم."
    },
    {
      "ayah": 76,
      "surah": 28,
      "text": "قال الأعمش عن المنهال بن عمرو عن سعد بن جبير عن ابن عباس قال: \"إن قارون كان من قوم موسى\" قال كان ابن عمه وهكذا قال إبراهيم النخعي وعبدالله بن الحارث بن نوفل وسماك بن حرب وقتادة ومالك بن دينار وابن جريج وغيرهم أنه كان ابن عم موسى عليه السلام. قال ابن جريج هو قارون بن يصهب بن قاهث وموسى بن عمران بن قاهث وزعم محمد بن إسحاق بن يسار أن قارون كان عم موسى بن عمران عليه السلام. قال ابن جريج وأكثر أهل العلم على أنه كان ابن عمه والله أعلم وقال قتادة بن دعامة كنا نحدث أنه كان ابن عم موسى وكان يسمى المنور لحسن صوته بالتوراة ولكن عدو الله نافق كما نافق السامري فأهلكه البغي لكثرة ماله: وقال شهر بن حوشب زاد في ثيابه شبرا طولا ترفعا على قومه. وقوله: \"وآتيناه من الكنوز\" أي الأموال \"ما إن مفاتحه لتنوء بالعصبة أولي القوة\" أي ليثقل حملها الفئام من الناس لكثرتها. قال الأعمش عن خيثمة كانت مفاتيح كنوز قارون من جلود كل مفتاح مثل الإصبع كل مفتاح على خزانة على حدته فإذا ركب حملت على ستين بغلا أغر محجلا وقيل غير ذلك والله أعلم. وقوله: \"إذ قال له قومه لا تفرح إن الله لا يحب الفرحين\" أي وعظه فيما هو فيه صالحو قومه فقالوا على سبيل النصح والإرشاد: لا تفرح بما أنت فيه يعنون لا تبطر بما أنت فيه من المال \"إن الله لا يحب الفرحين\" قال ابن عباس يعني المرحين وقال مجاهد يعني الأشرين البطرين الذين لا يشكرون الله على ما أعطاهم."
    },
    {
      "ayah": 77,
      "surah": 28,
      "text": "وقوله: \"وابتغ فيما آتاك الله الدار الآخرة ولا تنس نصيبك من الدنيا\" أي استعمل ما وهبك الله من هذا المال الجزيل والنعمة الطائلة في طاعة ربك والتقرب إليه بأنواع القربات التي يحصل لك بها الثواب في الدنيا والآخرة \"ولا تنس نصيبك من الدنيا\" أي مما أباح الله فيها من المآكل والمشارب والملابس والمساكن والمناكح فإن لربك عليك حقا ولنفسك عليك حقا ولأهلك عليك حقا ولزورك عليك حقا فآت كل ذي حق حقه \"وأحسن كما أحسن الله إليك\" أي أحسن إلى خلقه كما أحسن هو إليك \"ولا تبغ الفساد في الأرض\" أي لا تكن همتك بما أنت فيه أن تفسد به في الأرض وتسيء إلى خلق الله \"إن الله لا يحب المفسدين\"."
    },
    {
      "ayah": 78,
      "surah": 28,
      "text": "يقول تعالى مخبرًا عن جواب قارون لقومه حين نصحوه وأرشدوه إلى الخير \"قال إنما أوتيته على علم عندي\" أي أنا لا أفتقر إلى ما تقولون فإن الله تعالى إنما أعطاني هذا المال لعلمه بأني أستحقه ولمحبته لي فتقديره إنما أعطيته لعلم الله في أني أهل له وهذا كقوله تعالى: \"وإذا مس الإنسان ضر دعانا ثم إذا خولناه نعمة منا قال إنما أوتيته على علم\" أي على علم من الله بي وكقوله تعالى \"ولئن أذقناه رحمة منا من بعد ضراء مسته ليقولن هذا لي\" أي هذا أستحقه: وقد روي عن بعضهم أنه أراد \"إنما أوتيته على علم عندي\" أي أنه كان يعاني علم الكيمياء وهذا القول ضعيف لأن علم الكيمياء في نفسه علم باطل لأن قلب الأعيان لا يقدر أحد عليها إلا الله عز وجل قال الله تعالى: \"يا أيها الناس ضرب مثل فاستمعوا له إن الذين تدعون من دون الله لن يخلقوا ذبابا ولو اجتمعوا له\" وفي الصحيح أن رسول الله صلى الله عليه وسلم قال: \"يقول الله ومن أظلم ممن ذهب يخلق كخلقي فليخلقوا ذرة فليخلقوا شعيرة\" وهذا ورد في المصورين الذين يشبهون بخلق الله في مجرد الصورة الظاهرة أو الشكل فكيف بمن يدعي أنه يحيل ماهية هذه الذات إلى ماهية ذات أخرى هذا زور ومحال وجهل وضلال وإنما يقدرون على الصبغ في الصورة الظاهرة وهي كذب وزغل وتمويه وترويج أنه صحيح في نفس الأمر وليس كذلك قطعا لا محالة ولم يثبت بطريق شرعي أنه صح مع أحد من الناس من هذه الطريقة التي يتعاطاها هؤلاء الجهلة الفسقة الأفاكون فأما ما يجريه الله سبحانه من خرق العوائد على يدي بعض الأولياء من قلب بعض الأعيان ذهبا أو فضة أو نحو ذلك فهذا أمر لا ينكره مسلم ولا يرده مؤمن ولكن هذا ليس من قبيل الصناعات وإنما هذا عن مشيئة رب الأرض والسماوات واختياره وفعله كما روي عن حيوة بن شريح المصري رحمه الله أنه سأله سائل فلم يكن عنده ما يعطيه ورأى ضرورته فأخذ حصاة من الأرض فأجالها في كفه ثم ألقاها إلى ذلك السائل فإذا هي ذهب أحمر. والأحاديث والآثار في هذا كثيرة جدا يطول ذكرها وقال بعضهم إن قارون كان يعرف الاسم الأعظم فدعا الله به فتمول بسببه. والصحيح المعنى الأول ولهذا قال الله تعالى رادا عليه فما ادعاه من اعتناء الله به فيما أعطاه من المال \"أو لم يعلم أن الله قد أهلك من قبله من القرون من هو أشد منه قوة وأكثر جمعا\" أي قد كان من هو أكثر منه مالا وما كان ذلك عن محبة منا له وقد أهلكهم الله مع ذلك بكفرهم وعدم شكرهم ولهذا قال \"ولا يسأل عن ذنوبهم المجرمون\" أي لكثرة ذنوبهم. قال قتادة: \"على علم عندي\" على خير عندي وقال السدي على علم أني أهل لذلك. وقد أجاد في تفسير هذه الآية الإمام عبدالرحمن بن زيد بن أسلم فإنه قال في قوله: \"قال إنما أوتيته على علم عندي \"قال لولا رضا الله عني ومعرفته بفضلي ما أعطاني هذا المال وقرأ \"أولم يعلم أن الله قد أهلك من قبله من القرون من هو أشد منه قوة وأكثر جمعا\" الآية. وهكذا يقول من قل علمه إذا رأى من وسع الله عليه لولا أن يستحق ذلك لما أعطي."
    },
    {
      "ayah": 79,
      "surah": 28,
      "text": "يقول تعالى مخبرا عن قارون أنه خرج ذات يوم على قومه في زينة عظيمة وتجمل باهر من مراكب وملابس عليه وعلى خدمه وحشمه فلما رآه من يريد الحياة الدنيا ويميل إلى زخارفها وزينتها تمنوا أن لو كان لهم مثل الذي أعطي \"قالوا يا ليت لنا مثل ما أوتي قارون إنه لذو حظ عظيم\" أي ذو حظ وافر من الدنيا فلما سمع مقالتهم أهل العلم النافع."
    },
    {
      "ayah": 8,
      "surah": 28,
      "text": "خاطئين. ولهذا قال: \"فالتقطه آل فرعون ليكون لهم عدوا وحزنا\" الآية قال محمد بن إسحاق وغيره اللام هنا لام العاقبة لا لام التعليل لأنهم لم يريدوا بالتقاطه ذلك ولا شك أن ظاهر اللفظ يقتضي ما قالوه ولكن إذا نظر إلى معنى السياق فإنه تبقى اللام للتعليل لأن معناه أن الله تعالى قيضهم لالتقاطه ليجعله عدوا له وحزنا فيكون أبلغ في إبطال حذرهم منه ولهذا قال تعالى: \"إن فرعون وهامان وجنودهما كانوا خاطئين\" وقد روي عن أمير المؤمنين عمر بن عبدالعزيز رضي الله عنه أنه كتب كتابا إلى قوم من القدرية في تكذيبهم بكتاب الله وبأقداره النافذة في علمه السابق وموسى في علم الله السابق لفرعون عدو وحزن قال الله تعالى: \"ونرى فرعون وهامان وجنودهما منهم ما كانوا يحذرون\" وقلتم أنتم لو شاء فرعون أن يكون لموسى وليا وناصرا والله تعالى يقول: \"ليكون لهم عدوا وحزنا\"."
    },
    {
      "ayah": 80,
      "surah": 28,
      "text": "\"ويلكم ثواب الله خير لمن آمن وعمل صالحا\" أي جزاء الله لعباده المؤمنين الصالحين في الدار الآخرة خير مما ترون. كما في الحديث الصحيح \"يقول الله تعالى أعددت لعبادي الصالحين ما لا عين رأت ولا أذن سمعت ولا خطر على قلب بشر واقرءوا إن شئتم \"فلا تعلم نفس ما أخفي لهم من قرة أعين جزاء بما كانوا يعملون\" وقوله \"ولا يلقاها إلا الصابرون\" قال السدي ولا يلقى الجنة إلا الصابرون كأنه جعل ذلك من تمام كلام الذين أوتوا العلم قال ابن جرير ولا يلقى هذه الكلمة إلا الصابرون عن محبة الدنيا الراغبون في الدار الآخرة وكأنه جعل ذلك مقطوعا من كلام أولئك وجعله من كلام الله عز وجل وإخباره بذلك."
    },
    {
      "ayah": 81,
      "surah": 28,
      "text": "لما ذكر تعالى اختيال قارون في زينته وفخره على قومه وبغيه عليهم عقب ذلك بأنه خسف به وبداره الأرض كما ثبت في الصحيح عند البخاري من حديث الزهري عن سالم أن أباه حدثه أن رسول الله صلى الله عليه وسلم قال: \"بينما رجل يجر إزاره إذ خسف به فهو يتجلجل في الأرض إلى يوم القيامة\" ثم رواه من حديث جرير بن زيد عن سالم عن أبي هريرة عن النبي صلى الله عليه وسلم نحوه. وقال الإمام أحمد حدثنا النضر بن إسماعيل أبو المغيرة القاص حدثنا الأعمش عن عطية عن أبي سعيد قال: قال رسول الله صلى الله عليه وسلم: \"بينما رجل ممن كان قبلكم خرج في بردين أخضرين يختال فيهما أمر الله الأرض فأخذته فإنه ليتجلجل فيها إلى يوم القيامة\" تفرد به أحمد وإسناده حسن وقال الحافظ أبو يعلى الموصلي حدثنا أبو خيثمة حدثنا يعلى بن منصور أخبرني محمد بن مسلم سمعت زياد النميري يحدث عن أنس بن مالك رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: \"بينما رجل ممن كان قبلكم خرج في بردين فاختال فيهما فأمر الله الأرض فأخذته فهو يتجلجل فيها إلى يوم القيامة\" وقد ذكر الحافظ محمد بن المنذر في كتاب العجائب الغريبة بسنده عن نوفل بن مساحق قال رأيت شابا في مسجد نجران فجعلت أنظر إليه وأتعجب من طوله وتمامه وجماله فقال مالك تنظر إلي؟ فقلت أعجب من جمالك وكمالك. فقال إن الله ليعجب مني قال فما زال ينقص وينقص حتى صار بطول الشبر فأخذه بعض قرابته في كمه وذهب به. وقد ذكر أن هلاك قارون كان من دعوة موسى نبي الله عليه السلام واختلف في سببه فعن ابن عباس والسدي أن قارون أعطى امرأة بغيا مالا على أن تبهت موسى بحضرة الملإ من بني إسرائيل وهو قائم فيهم يتلو عليهم كتاب الله تعالى فتقول يا موسى إنك فعلت بي كذا وكذا فلما قالت ذلك في الملإ لموسى عليه السلام أرعد من الفرق وأقبل عليها بعدما صلى ركعتين ثم قال أنشدك بالله الذي فرق البحر وأنجاكم من فرعون وفعل كذا وكذا لما أخبرتني بالذي حملك على ما قلت؟ فقالت أما إذا نشدتني فإن قارون أعطاني كذا وكذا على أن أقول ذلك لك وأنا أستغفر الله وأتوب إليه فعند ذلك خر موسى لله عز وجل ساجدا وسأل الله في قارون فأوحى الله إليه أن قد أمرت الأرض أن تطيعك فيه فأمر موسى الأرض أن تبتلعه وداره فكان ذلك. وقيل إن قارون لما خرج على قومه في زينته تلك وهو راكب على البغال الشهب وعليه وعلى خدمه ثياب الأرجوان المصبغة فمر في محفله ذلك على مجلس نبي الله موسى عليه السلام وهو يذكرهم بأيام الله فلما رأى الناس قارون انصرفت وجوههم نحوه ينظرون إلى ما هو فيه فدعاه موسى عليه السلام وقال: ما حملك على ما صنعت؟ فقال يا موسى أما لئن كنت فضلت علي بالنبوة فلقد فضلت عليك بالدنيا ولئن شئت لتخرجن فلتدعون علي وأدعو عليك فخرج موسى وخرج قارون في قومه فقال موسى عليه السلام تدعو وأدعو أنا؟ فقال بل أدعو أنا فدعا قارون فلم يجب له ثم قال موسى أدعو؟ قال نعم فقال موسى اللهم مر الأرض أن تطيعني اليوم فأوحى الله إليه أني قد فعلت فقال موسى يا أرضي خذيهم فأخذتهم إلى أقدامهم. ثم قال خذيهم فأخذتهم إلى ركبهم ثم إلى مناكبهم ثم قال أقبلي بكنوزهم وأموالهم قال فأقبلت بها حتى نظروا إليها ثم أشار موسى بيده ثم قال اذهبوا بني لاوى فاستوت بهم الأرض وعن ابن عباس قال: خسف بهم إلى الأرض السابعة وقال قتادة ذكر لنا أنه يخسف بهم كل يوم قامة فهم يتجلجلون فيها إلى يوم القيامة وقد ذكر ههنا إسرائيليات غريبة أضربنا عنها صفحا; وقوله تعالى: \"فما كان له من فئة ينصرونه من دون الله وما كان من المنتصرين\" أي ما أغنى عنه ماله ولا جمعه ولا خدمه وحشمه ولا دفعوا عنه نقمة الله وعذابه ونكاله ولا كان- هو في نفسه منتصرا لنفسه فلا ناصر له من نفسه ولا من غيره."
    },
    {
      "ayah": 82,
      "surah": 28,
      "text": "من عباده ويقدر لولا أن من الله علينا لخسف بنا ويكأنه لا يفلح الكافرون. وقوله تعالى: \"وأصبح الذين تمنوا مكانه بالأمس\" أي الذين لما رأوه في زينته \"قالوا يا ليت لنا مثل ما أوتي قارون إنه لذو حظ عظيم\" فلما خسف به أصبحوا يقولون ويكأن الله يبسط الرزق لمن يشاء من عباده ويقدر أي ليس المال بدال على رضا الله عن صاحبه فإن الله يعطي ويمنع ويضيق ويوسع ويخفض ويرفع وله الحكمة التامة والحجة البالغة وهذا كما في الحديث المرفوع عن ابن مسعود \"إن الله قسم بينكم أخلاقكم كما قسم بينكم أرزاقكم وإن الله يعطي المال من يحب ومن لا يحب ولا يعطي الإيمان إلا من يحب\" \"لولا أن من الله علينا لخسف بنا\" أي لولا لطف الله بنا وإحسانه إلينا لخسف بنا كما خسف به لأنا وددنا أن نكون مثله\" ويكأنه لا يفلح الكافرون\" يعنون أنه كان كافرا ولا يفلح الكافر عند الله لا في الدنيا ولا في الآخرة وقد اختلف النحاة في معنى قوله ههنا ويكأن فقال بعضهم معناه ويلك اعلم أن ولكن خفف فقيل ويك ودل فتح أن على حذف اعلم وهذا القول ضعفه ابن جرير والظاهر أنه قوي ولا يشكل على ذلك إلا كتابتها في المصاحف متصلة ويكأن. والكتابة أمر وضعي اصطلاحي والمرجع إلى اللفظ العربي والله أعلم وقيل معناها ويكأن أي ألم تر أن قاله قتادة وقيل: معناها وي كأن ففصلها وجعل حرف وي للتعجب أو للتنبيه وكأن بمعنى أظن وأحتسب. قال ابن جرير وأقوى الأقوال في هذا قول قتادة أنها بمعنى ألم تر أن واستشهد بقول الشاعر: سألتاني الطلاق إذ رأتاني قل مالي وقد جئتماني بنكر ويكأن من يكن له نشب يحبب ومن يفتقر يعش عيش ضــــر"
    },
    {
      "ayah": 83,
      "surah": 28,
      "text": "يخبر تعالى أن الدار الآخرة ونعيمها المقيم الذي لا يحول ولا يزول جعلها لعباده المؤمنين المتواضعين الذين لا يريدون علوا في الأرض أي ترفعا على خلق الله وتعاظما عليهم وتجبرا بهم ولافسادا فيهم كما قال عكرمة العلو: التجبر. وقال سعيد بن جبير العلو: البغي وقال سفيان بن سعيد الثوري عن منصور عن مسلم البطين العلو في الأرض:التكبر بغير حق والفساد أخذ المال بغير حق وقال ابن جريج \"لا يريدون علوا في الأرض\" تعظما وتجبرا \"ولا فسادا\" عملا بالمعاصي. وقال ابن جرير حدثنا وكيع حدثنا أبي عن أشعث السمان عن أبى سلام الأعرج عن علي قال: إن الرجل ليعجبه من شراك نعله أن يكون أجود من شراك نعل صاحبه فيدخل في قوله تعالى \"تلك الدار الآخرة نجعلها للذين لا يريدون علوا في الأرض ولا فسادا والعاقبة للمتقين\" وهذا محمول على ما إذا أراد بذلك الفخر والتطاول على غيره فإن ذلك مذموم كما ثبت في الصحيح عن النبي صلى الله عليه وسلم أنه قال: \"إنه أوحي إلي أن تواضعوا حتى لا يفخر أحد على أحد ولا يبغي أحد على أحد\" وأما إذا أحب ذلك لمجرد التأمل فهذا لا بأس به فقد ثبت أن رجلا قال: يا رسول الله صلى الله عليه وسلم إني أحب أن يكون ردائي حسنا ونعلي حسنة أفمن الكبر ذلك ؟ فقال: \"لا إن الله جميل يحب الجمال\"."
    },
    {
      "ayah": 84,
      "surah": 28,
      "text": "قال تعالى: \"من جاء بالحسنة\" أي يوم القيامة \"فله خير منها\" أي ثواب الله خير من حسنة العبد فكيف والله يضاعفه أضعافا كثيرة وهذا مقام الفضل ثم قال \"ومن جاء بالسيئة فلا يجزى الذين عملوا السيئات إلا ما كانوا يعملون\" كما قال في الآية الأخرى \"ومن جاء بالسيئة فكبت وجوههم في النار هل تجزون إلا ما كنتم تعملون \" وهذا مقام الفضل والعدل."
    },
    {
      "ayah": 85,
      "surah": 28,
      "text": "يقول تعالى آمرا رسوله صلوات الله وسلامه عليه ببلاغ الرسالة وتلاوة القرآن على الناس ومخبرا له بأنه سيرده إلى معاد وهو يوم القيامة فيسأله عما استرعاه من أعباء النبوة ولهذا قال تعالى \"إن الذي فرض عليك القرآن لرادك إلى معاد\" أي افترض عليك أداءه إلى الناس \"لرادك إلى معاد\" أي إلى يوم القيامة فيسألك عن ذلك كما قال تعالى \"فلنسألن الذين أرسل إليهم ولنسألن المرسلين\" وقال تعالى \"يوم يجمع الله الرسل فيقول ماذا أجبتم\" وقال \"وجئ بالنبيين والشهداء\" وقال السدي عن أبي صالح عن ابن عباس \"إن الذي فرض عليك القرآن لرادك إلى معاد\" يقول لرادك إلى الجنة ثم سائلك عن القرآن. قاله السدي وقال أبو سعيد مثلها وقال الحكم بن أبان عن عكرمة عن ابن عباس رضي الله عنهما \"لرادك إلى معاد\" قال إلى يوم القيامة ورواه مالك عن الزهري وقال الثوري عن الأعمش عن سعيد بن جبير عن ابن عباس \"لرادك إلى معاد\" إلى الموت ولهذا طرق عن ابن عباس رضي الله عنهما وفي بعضها لرادك إلى معدنك من الجنة وقال مجاهد يحييك يوم القيامة وكذا روي عن عكرمة وعطاء وسعيد بن جبير وأبي قزعة وأبي مالك وأبي صالح وقال الحسن البصري أي والله إن له لمعادا فيبعثه الله يوم القيامة ثم يدخله الجنة. وقد روى عن ابن عباس غير ذلك كما قال البخاري في التفسير من صحيحه حدثنا محمد بن مقاتل أنبأنا يعلى حدثنا سفيان العصفري عن عكرمة عن ابن عباس \"لرادك إلى معاد\" قال إلى مكة وهكذا رواه النسائي في تفسير سننه وابن جرير من حديث يعلى وهو ابن عبيد الطنافسي به وهكذا رواه العوفي عن ابن عباس \"لرادك إلى معاد\" أي لرادك إلى مكة كما أخرجك منها وقال محمد بن إسحاق عن مجاهد في قوله \"لرادك إلى معاد\" إلى مولدك بمكة. وقال ابن أبي حاتم وقد روي ابن عباس ويحيى بن الخراز وسعيد بن جبير وعطية والضحاك نحو ذلك. وحدثنا أبي حدثنا ابن أبي عمر قال: قال سفيان فسمعناه من مقاتل منذ سبعين سنة عن الضحاك قال لما خرج النبي صلى الله عليه وسلم من مكة فبلغ الجحفة اشتاق إلى مكة فأنزل الله عليه \"إن الذي فرض عليك القرآن لرادك إلى معاد\" إلى مكة وهذا من كلام الضحاك يقتضي أن هذه الآية مدنية وإن كان مجموع السورة مكيا والله أعلم. وقد قال عبدالرزاق حدثنا معمر عن قتاده في قوله تعالى \"لرادك إلى معاد\" قال هذه مما كان ابن عباس يكتمها. وقد روى ابن أبي حاتم بسنده عن نعيم القاري أنه قال في قوله \"لرادك إلى معاد\" قال إلى بيت المقدس وهذا والله أعلم يرجع إلى قول من فسر ذلك بيوم القيامة لأن بيت المقدس هو أرض المحشر والمنشر والله الموفق للصواب ووجه الجمع بين هذه الأقوال أن ابن عباس فسر ذلك تارة برجوعه إلى مكة وهو الفتح الذي هو عند ابن عباس أمارة على اقتراب أجل النبي صلى الله عليه وسلم كما فسر ابن عباس سورة \"إذا جاء نصر الله والفتح\" إلى آخر السورة أنه أجل رسول الله صلى الله عليه وسلم نعي إليه وكان ذلك بحضرة عمر بن الخطاب ووافقه عمر على ذلك وقال: لا أعلم منها غير الذي تعلم. ولهذا فسر ابن عباس تارة أخرى قوله: \"لرادك إلى معاد\" بالموت وتارة بيوم القيامة الذي هو بعد الموت وتارة بالجنة التي هي جزاؤه ومصيره على أداء رسالة الله وإبلاغها إلى الثقلين الإنس والجن ولأنه أكمل خلق الله وأفصح خلق الله وأشرف خلق الله على الإطلاق وقوله تعالى: \"قل ربي أعلم من جاء بالهدى ومن هو في ضلال مبين\" أي قل لمن خالفك وكذبك يا محمد من قومك من المشركين ومن تبعهم على كفرهم قل ربي أعلم بالمهتدي منكم ومني وستعلمون لمن تكون له عاقبة الدار ولمن تكون العاقبة والنصرة في الدنيا والآخرة. ثم قال تعالى مذكرا لنبيه نعمته العظيمة عليه وعلى العباد إذ أرسله إليهم."
    },
    {
      "ayah": 86,
      "surah": 28,
      "text": "\"وما كنت ترجو أن يلقى إليك الكتاب\" أي ما كنت تظن قبل إنزال الوحي إليك أن الوحي ينزل عليك \"ولكن رحمة من ربك\" أي إنما أنزل الوحي عليك من الله من رحمته بك وبالعباد بسببك فإذا منحك بهذه النعمة العظيمة \"فلا تكونن ظهيرا\" أي معينا \"للكافرين\" ولكن فارقهم ونابذهم وخالفهم."
    },
    {
      "ayah": 87,
      "surah": 28,
      "text": "\"ولا يصدنك عن آيات الله بعد إذ أنزلت إليك\" أي لا تتأثر لمخالفتهم لك وصدهم الناس عن طريقك لا تلوي على ذلك ولا تباله فإن الله معل كلمتك ومؤيد دينك ومظهر ما أرسلك به على سائر الأديان ولهذا قال \"وادع إلى ربك\" أي إلى عبادة ربك وحده لا شريك له \"ولا تكونن من المشركين\"."
    },
    {
      "ayah": 88,
      "surah": 28,
      "text": "قوله: \"ولا تدع مع الله إلها آخر لا إله إلا هو\" أي لا تليق العبادة إلا له ولا تنبغي الإلهية إلا لعظمته. وقوله \"كل شيء هالك إلا وجهه\" إخبار بأنه الدائم الباقي الحي القيوم الذي تموت الخلائق ولا يموت كما قال تعالى \"كل من عليها فان ويبقى وجه ربك ذو الجلال والإكرام\" فعبر بالوجه عن الذات وهكذا قوله ههنا \"كل شيء هالك إلا وجهه\" أي إلا إياه وقد ثبت في الصحيح من طريق أبي سلمة عن أبي هريرة قال: قال رسول الله صلى الله عليه وسلم: \"أصدق كلمة قالها الشاعر لبيد ألا كل شيء ما خلا الله باطل\" وقال مجاهد والثوري في قوله: \"كل شيء هالك إلا وجهه\" أي إلا ما أريد به وجهه وحكاه البخاري في صحيحه كالمقرر له قال ابن جرير: ويستشهد من قال ذلك بقول الشاعر: أستغفر الله ذنبا لست محصيه رب العباد إليه الوجه والعمل وهذا القول لا ينافي القول الأول فإن هذا إخبار عن كل الأعمال بأنها باطلة إلا ما أريد به وجه الله تعالى من الأعمال الصالحة المطابقة للشريعة والقول الأول مقتضاه أن كل الذوات فانية وزائلة إلا ذاته تعالى وتقدس فإنه الأول الآخر الذي هو قبل كل شي وبعد كل شيء. قال أبو بكر عبدالله بن محمد بن أبي الدنيا في كتاب التفكر والاعتبار حدثنا أحمد بن محمد بن أبي بكر حدثنا مسلم بن إبراهيم حدثنا عمر بن سليم الباهلي حدثنا أبو الوليد قال: كان ابن عمر إذا أراد أن يتعاهد قلبه يأتي الخربة فيقف على بابها فينادي بصوت حزين فيقول: أين أهلك؟ ثم يرجع إلى نفسه فيقول \"كل شيء هالك إلا وجهه\" وقوله: \"له الحكم\" أي الملك والتصرف ولا معقب لحكمه \"وإليه ترجعون\" أي يوم معادكم فيجزيكم بأعمالكم إن كان خيرا فخير وإن شرا فشر. آخر تفسير سورة القصص ولله الحمد والمنة."
    },
    {
      "ayah": 9,
      "surah": 28,
      "text": "قوله تعالى: \"وقالت امرأة فرعون قرة عين لي ولك\" الآية يعني أن فرعون لما رآه هم بقتله خوفا من أن يكون من بني إسرائيل فشرعت امرأته آسية بنت مزاحم تخاصم عنه وتذب دونه وتحببه إلى فرعون فقالت: \"قرة عين لي ولك\" فقال فرعون أما لك فنعم وأما لي فلا فكان كذلك وهداها الله بسببه وأهلكه الله على يديه وقد تقدم في حديث الفتون في سورة طه هذه القصة بطولها في رواية ابن عباس مرفوعا عند النسائي وغيره. وقوله: \"عسى أن ينفعنا\" وقد حصل لها ذلك وهداها الله به وأسكنها الجنه بسببه. وقوله: \"أو نتخذه ولدا\" أي أرادت أن تتخذه ولدا وتتبناه وذلك أنه لم يكن لها ولد منه وقوله تعالى: \"وهم لا يشعرون\" أي لا يدرون ما أراد الله منه بالتقاطهم إياه من الحكمة العظيمة البالغة والحجة القاطعة."
    }
  ]
}
