{
  "ayahs": [
    {
      "ayah": 1,
      "surah": 29,
      "text": "قد اختلف المفسرون في الحروف المقطعة التي في أوائل السور فمنهم من قال هي مما استأثر الله بعلمه فردوا علمها إلى الله ولم يفسرها حكاه القرطبي في تفسـره عن أبي بكر وعمر وعثمان وعلي وابن مسعود رضي الله عنهم أجمعين وقاله عامر الشعبي وسفيان الثوري والربيع بن خيثم واختاره أبو حاتم بن حبان. ومنهم من فسرها واختلف هؤلاء في معناها فقال عبدالرحمن بن زيد بن أسلم إنما هي أسماء السور. قال العلامة أبو القاسم محمود بن عمر الزمخشري في تفسيره وعليه إطباق الأكثر ونقل عن سيبويه أنه نص عليه ويعتضد لهذا بما ورد في الصحيحين عن أبي هريرة أن رسول الله صلى الله عليه وسلم كان يقرأ في صلاة الصبح يوم الجمعة \"الم\" السجدة و \"هل أتى على الإنسان\" وقال سفيان الثوري عن ابن أبي نجيح عن مجاهد أنه قال: الم وحم والمص وص. فواتح افتتح الله بها القرآن وكذا قال غيره عن مجاهد وقال مجاهد في رواية أبي حذيفة موسى بن مسعود عن شبل عن ابن أبي نجيح عنه أنه قال الم اسم من أسماء القرآن وهكذا وقال قتادة وزيد بن أسلم ولعل هذا يرجع إلى معنى قول عبدالرحمن بن زيد بن أسلم أنه اسم من أسماء السور فإن كل سورة يطلق عليها اسم القرآن فإنه يبعد أن يكون المص اسما للقرآن كله لأن المتبادر إلى فهم سامع من يقول قرأت المص إنما ذلك عبارة عن سورة الأعراف لا لمجموع القرآن والله أعلم. وقيل هي اسم من أسماء الله تعالى فقال عنها في فواتح السور من أسماء الله تعالى وكذلك قال سالم بن عبدالله وإسماعيل بن عبدالرحمن السدي الكبير وقال شعبة عن السدي بلغني أن ابن عباس قال الم اسم من أسماء الله الأعظم. هكذا رواه ابن أبي حاتم من حديث شعبة ورواه ابن جرير عن بندار عن ابن مهدي عن شعبة قال سألت السدي عن حم وطس والم فقال قال ابن عباس هي اسم الله الأعظم وقال ابن جرير وحدثنا محمد بن المثنى حدثنا أبو النعمان حدثنا شعبة عن إسماعيل السدي عن مرة الهمذاني قال: قال عبدالله فذكر نحوه. وحُكي مثله عن علي وابن عباس وقال علي بن أبي طلحة عن ابن عباس هو قسم أقسم الله به وهو من أسماء الله تعالى وروى ابن أبي حاتم وابن جرير من حديث ابن علية عن خالد الحذاء عن عكرمة أنه قال الم قسم. وروينا أيضا من حديث شريك بن عبدالله بن عطاء بن السائب عن أبى الضحى عن ابن عباس: الم قال أنا الله أعلم وكذا قال سعيد بن جبير وقال السدي عن أبي مالك وعن أبي صالح عن ابن عباس وعن مرة الهمذاني عن ابن مسعود وعن ناس من أصحاب النبي صلى الله عليه وسلم الم قال أما الم فهي حروف استفتحت من حروف هجاء أسماء الله تعالى. قال وأبو جعفر الرازي عن الربيع بن أنس عن أبي العالية في قوله تعالى الم قال هذه الأحرف الثلاثة من التسعة والعشرين حرفا دارت فيها الألسن كلها ليس منها حرف إلا وهو مفتاح اسم من أسمائه وليس منها حرف إلا وهو من آلائه وبلألائه ليس منها حرف إلا وهو في مدة أقوام وآجالهم. قال عيسى ابن مريم عليه السلام وعجب: فقال أعجب أنهم يظنون بأسمائه ويعيشون في رزقه فكيف يكفرون به فالألف مفتاح الله واللام مفتاح اسمه لطيف والميم مفتاح اسمه مجيد فالألف آلاء الله واللام لطف الله والميم مجد الله والألف سنة واللام ثلاثون سنة والميم أربعون سنة. هذا لفظ ابن أبي حاتم ونحوه رواه ابن جرير ثم شرع يوجه كل واحد من هذه الأقوال ويوفق بينها وأنه لا منافاة بين كل واحد منها وبين الآخر وأن الجمع ممكن فهي أسماء للسور ومن أسماء الله تعالى يفتتح بها السور فكل حرف منها دل على اسم من أسمائه وصفة من صفاته كما افتتح سورا كثيرة بتحميده وتسبيحه وتعظيمه قال ولا مانع من دلالة الحرف منها على اسم من أسماء الله وعلى صفة من صفاته وعلى مدة وغير ذلك كما ذكره الربيع بن أنس عن أبي العالية لأن الكلمة الواحدة تطلق على معاني كثيرة كلفظة الأمة فإنها تطلق ويراد به الدين كقوله تعالى \"إنا وجدنا آباءنا على أمة\" وتطلق ويراد بها الرجل المطيع لله كقوله تعالى \"إن إبراهيم كان أمة قانتا لله حنيفا ولم يك من المشركين\" وتطلق ويراد بها الجماعة كقوله تعالى \"وجد عليه أمة من الناس يسقون\" وقوله تعالى \"ولقد بعثنا في كل أمة رسولا\" وتطلق ويراد بها الحين من الدهر كقوله تعالى \"وقال الذي نجا منهما وادكر بعد أمة\" أي بعد حين على أصح القولين قال فكذلك هذا. هذا حاصل كلامه موجها ولكن هذا ليس كما ذكره أبو العالية فإن أبا العالية زعم أن الحرف دل على هذا وعلى هذا وعلى هذا معا ولفظة الأمة وما أشبهها من الألفاظ المشتركة في الاصطلاح إنما دل في القرآن في كل موطن على معنى واحد دل عليه سياق الكلام فأما حمله على مجموع محامله إذا أمكن فمسألة مختلف فيها بين علماء الأصول ليس هذا موضع البحث فيها والله أعلم. ثم إن لفظة الأمة تدل على كل من معانيها في سياق الكلام بدلالة الوضع فأما دلالة الحرف الواحد على اسم يمكن أن يدل على اسم آخر من غير أن يكون أحدهما أولى من الآخر في التقدير أو الإضمار بوضع ولا بغيره فهذا مما لا يفهم إلا بتوقيف والمسألة مختلف فيها وليس فيها إجماع حتى يحكم به وما أنشدوه من الشواهد على صحة إطلاق الحرف الواحد على بقية الكلمة فإن في السياق ما يدل على ما حذف بخلاف هذا كما قال الشاعر: قلنا قفي لنا فقالت قاف لا تحسبي أنا نسينا الإيجاف تعني وقفت. وقال الآخر: ما للظليم عال كيف لايـ ينقد عنه جلده إذا يـ فقال ابن جرير كأنه أراد أن يقول إذا يفعل كذا وكذا فاكتفى بالياء من يفعل وقال الآخر: بالخير خيرات وان شرا فا ولا أريد الشر إلا أن تـ يقول وإن شرا فشرا ولا أريد الشر إلا أن تشاء فاكتفى بالفاء والتاء من الكلمتين عن بقيتهما ولكن هذا ظاهر من سياق الكلام والله أعلم. قال القرطبي وفي الحديث \"من أعان على قتل مسلم بشطر كلمة\" الحديث قال سفيان هو أن يقول في اقتل\"ا قـ\" وقال خصيف عن مجاهد أنه قال فواتح السور كلها\"ق وص وحم وطسم والر\" وغير ذلك هجاء موضوع وقال بعض أهل العربية هي حروف من حروف المعجم استغنى بذكر ما ذكر منها في أوائل السور عن ذكر بواقيها التي هي تتمة الثمانية والعشرين حرفا كما يقول القائل ابني يكتب في - ا ب ت ث - أي في حروف المعجم الثمانية والعشرين فيستغني بذكر بعضها عن مجموعها حكاه ابن جرير. قلت مجموع الحروف المذكورة في أوائل السور بحذف المكرر منها أربعة عشر حرفا وهي - ال م ص ر ك ه ي ع ط س ح ق ن- يجمعها قولك: نص حكيم قاطع له سر. وهي نصف الحروف عددا والمذكور منها أشرف من المتروك وبيان ذلك من صناعة التصريف. قال الزمخشري وهذه الحروف الأربعة عشر مشتملة على أصناف أجناس الحروف يعني من المهموسة والمجهورة ومن الرخوة والشديدة ومن المطبقة والمفتوحة ومن المستعلية والمنخفضة ومن حروف القلقلة. وقد سردها مفصلة ثم قال: فسبحان الذي دقت في كل شئ حكمته. وهذه الأجناس المعدودة مكثورة بالمذكورة منها وقد علمت أن معظم الشيء وجله ينزل منزلة كله وههنا ههنا لخص بعضهم في هذا المقام كلاما فقال: لا شك أن هذه الحروف لم ينزلها سبحانه وتعالى عبثا ولا سدى ومن قال من الجهلة إن في القرآن ما هو تعبد لا معنى له بالكلمة فقد أخطأ خطأ كبيرا فتعين أن لها معنى في نفس الأمر فإن صح لنا فيها عن المعصوم شيء قلنا به وإلا وقفنا حيث وقفنا وقلنا \"آمنا به كل من عند ربنا\" ولم يجمع العلماء فيها على شيء معين وإنما اختلفوا فمن ظهر له بعض الأقوال بدليل فعليه اتباعه وإلا فالوقف حتى يتبين هذا المقام. المقام الآخر في الحكمة التي اقتضت إيراد هذه الحروف في أوائل السور ما هي مع قطع النظر عن معانيها في أنفسها فقال بعضهم إنما ذكرت ليعرف بها أوائل السور حكاه ابن جرير وهذا ضعيف لأن الفصل حاصل بدونها فيما لم تذكر فيه وفيما ذكرت فيه البسملة تلاوة وكتابة وقال آخرون بل ابتدئ بها لتفتح لاستماعها أسماع المشركين إذ تواصوا بالإعراض عن القرآن حتى إذا استمعوا له تلا عليهم المؤلف منه حكاه ابن جرير أيضا وهو ضعيف أيضا لأنه لو كان كذلك لكان ذلك في جميع السور لا يكون في بعضها بل غالبها ليس كذلك ولو كـان كذلك أيضا لانبغى الإبتداء بها في أوائل الكلام معهم سواء كان افتتاح سورة أو غير ذلك ثم إن هذه السورة والتي تليها أعني البقرة وآل عمران مدنيتان ليستا خطابا للمشركين فانتقض ما ذكروه بهذه الوجوه. وقال آخرون بل إنما ذكرت هذه الحروف في أوائل السور التي ذكرت فيها بيانا لإعجاز القرآن وأن الخلق عاجزون عن معارضته بمثله هذا مع أنه مركب من هذه الحروف المقطعة التي يتخاطبون بها وقد حكى هذا المذهب الرازي في تفسيره عن المبرد وجمع من المحققين وحكى القرطبي عن الفراء وقطرب نحو هذا وقرره الزمخشري فى كشافه ونصره أتم نصر وإليه ذهب الشيخ الإمام العلامة أبو العباس ابن تيمية وشيخنا الحافظ المجتهد أبو الحجاج المزي وحكاه لي عن ابن تيمية. قال الزمخشري ولم ترد كلها مجموعة في أول القرآن وإنما كررت ليكون أبلغ في التحدي والتبكيت كما كررت قصص كثيرة وكرر التحدي بالصريح في أماكن قال وجاء منها على حرف واحد كقوله - ص ن ق- وحرفين مثل \"حم\" وثلاثة مثل \"الم\" وأربعة مثل \"المر\" و \"المص\" وخمسة مثل \"كهيعص- و- حم عسق\" لأن أساليب كلامهم على هذا من الكلمات ما هو على حرف وعلى حرفين وعلى ثلاثة وعلى أربعة وعلى خمسة لا أكثر من ذلك \"قلت\" ولهذا كل سورة افتتحت بالحروف فلا بد أن يذكر فيها الانتصار للقرآن وبيان إعجازه وعظمته وهذا معلوم بالاستقراء وهو الواقع في تسع وعشرين سورة ولهذا يقول تعالى \"الم ذلك الكتاب لا ريب فيه\" \"الم الله لا إله إلا هو الحي القيوم نزل عليك الكتاب بالحق مصدقا لما بين يديه\" \"المص كتاب أنزل إليك فلا يكن في صدرك حرج منه\" \"الر كتاب أنزلناه إليك لتخرج الناس من الظلمات إلى النور بإذن ربهم\" \"الم تنزيل الكتاب لا ريب فيه من رب العالمين\" \"حم تنزيل من الرحمن الرحيم\" \"حم عسق كذلك يوحي إليك وإلى الذين من قبلك الله العزيز الحكيم\" وغير ذلك من الآيات الدالة على صحة ما ذهب إليه هؤلاء لمن أمعن النظر والله أعلم. وأما من زعم أنها دالة على معرفة المدد وأنه يستخرج من ذلك أوقات الحوادث والفتن والملاحم فقد ادعى ما ليس له وطار في غير مطاره وقد ورد في ذلك حديث ضعيف وهو مع ذلك أدل على بطلان هذا المسلك من التمسك به على صحته وهو ما رواه محمد بن إسحق بن يسار صاحب المغازي حدثني الكلبي عن أبي صالح عن ابن عباس عن جابر بن عبدالله بن رباب قال مر أبو ياسر بن أخطب في رجال من يهود برسول الله صلى الله عليه وسلم وهو يتلو فاتحة سورة البقرة \"الم ذلك الكتاب لا ريب فيه\" فأتى أخاه بن أخطب في رجال من اليهود فقال تعلمون والله لقد سمعت محمدا يتلو فيما أنزل الله تعالى عليه \"الم ذلك الكتاب لا ريب فيه\" فقال أنت سمعته قال نعم قال فمشى حي بن أخطب في أولئك النفر من اليهود إلى رسول الله صلى الله عليه وسلم فقالوا يا محمد ألم يذكر أنك تتلوا فيما أنزل الله عليك \"الم ذلك الكتاب\"؟ فقال رسول الله صلى الله عليه وسلم \"بلى\" فقالوا جاءك بهذا جبريل من عند الله؟ فقال \"نعم\" قالوا لقد بعث الله قبلك أنبياء ما نعلمه بين لنبي منهم ما مدة ملكه وما أجل أمته غيرك. فقام حي بن أخطب وأقبل على من كان معه فقال لهم الألف واحدة واللام ثلاثون والميم أربعون فهذه إحدى وسبعون سنة أفتدخلون في دين نبي إنما مدة ملكه وأجل أمته إحدى وسبعون سنة؟ ثم أقبل على رسول الله صلى الله عليه وسلم فقال يا محمد هل مع هذا غيره فقال \"نعم\" قال ما ذاك؟ قال \"المص\" قال هذا أثقل وأطول الألف واحد واللام ثلاثون والميم أربعون والصاد تسعون فهذه إحدى وثلاثون ومائة سنة. هل مع هذا يا محمد غيره؟ قال \"نعم\" قال ما ذاك؟ قال \"الر\" قال هذا أثقل وأطول الألف واحدة واللام ثلاثون والراء مائتان فهذه إحدى وثلاثون ومائتا سنة. فهل مع هذا يا محمد غيره؟ قال \"نعم\" قال ماذا قال \"المر\" قال هذه أثقل وأطول الألف واحدة واللام ثلاثون والميم أربعون والراء مائتان فهذه إحدى وسبعون ومائتان ثم قال: لقد لبس علينا أمرك يا محمد حتى ما ندري أقليلا أعطيت أم كثيرا. ثم قال قوموا عنه ثم قال أبو ياسر لأخيه حي بن أخطب ولمن معه من الأحبار ما يدريكم لعله قد جمع هذا لمحمد كله إحدى وسبعون وإحدى وثلاثون ومائة وإحدى وثلاثون ومائتان وإحدى وسبعون ومائتان فذلك سبعمائة وأربع سنين؟ فقالوا لقد تشابه علينا أمره فيزعمون أن هؤلاء الآيات نزلت فيهم \"هو الذي أنزل عليك الكتاب منه آيات محكمات هن أم الكتاب وأخر متشابهات\" فهذا الحديث مداره على محمد بن السائب الكلبي وهو ممن لا يحتج بما انفرد به ثم كان مقتضى هذا المسلك إن كان صحيحا أن يحسب ما لكل حرف من الحروف الأربعة عشر التي ذكرناها وذلك يبلغ منه جملة كثيرة وإن حسبت مع التكرر فأطم وأعظم والله أعلم."
    },
    {
      "ayah": 10,
      "surah": 29,
      "text": "يقول تعالى مخبرا عن صفات قوم من المكذبين الذين يدعون الإيمان بألسنتهم ولم يثبت الإيمان في قلوبهم بأنهم إذا جاءتهم محنة وفتنة في الدنيا اعتقدوا أن هذا من نقمة الله تعالى بهم فارتدوا عن الإسلام ولهذا قال تعالى: \"ومن الناس من يقول آمنا بالله فإذا أوذي في الله جعل فتنة الناس كعذاب الله\" قال ابن عباس يعني فتنته أن يرتد عن دينه إذا أوذي في الله وكذا قال غيره من علماء السلف وهذه الآية كقوله تعالى: \"ومن الناس من يعبدالله على حرف فإن أصابه خير اطمأن به وإن أصابته فتنة انقلب على وجهه -إلى قوله - ذلك هو الضلال البعيد\" ثم قال عز وجل: \"ولئن جاء نصر من ربك ليقولن إنا كنا معكم\" أي ولئن جاء نصر قريب من ربك يا محمد وفتح ومغانم ليقولن هؤلاء لكم إنا كنا معكم أي إخوانكم في الدين كما قال تعالى: \"الذين يتربصون بكم فإن كان لكم فتح من الله قالوا ألم نكن معكم وإن كان للكافرين نصيب قالوا ألم نستحوذ عليكم ونمنعكم من المؤمنين\" وقال تعالى: \"فعسى الله أن يأتي بالفتح أو أمر من عنده فيصبحوا على ما أسروا في أنفسهم نادمين\" وقال تعالى مخبرا عنهم ههنا \"ولئن جاء نصر من ربك ليقولن إنا كنا معكم\" ثم قال الله تعالى: \"أوليس الله بأعلم بما في صدور العالمين\" أي أو ليس الله بأعلم بما في قلوبهم وما تكنه ضمائرهم وإن أظهروا لكم الموافقة؟."
    },
    {
      "ayah": 11,
      "surah": 29,
      "text": "أي وليختبرن الله الناس بالضراء والسراء ليتميز هؤلاء من هؤلاء من يطيع الله في الضراء والسراء ومن إنما يطيعه في حظ نفسه كما قال تعالى: \"ولنبلونكم حتى نعلم المجاهدين منكم والصابرين ونبلو أخباركم\" وقال تعالى بعد وقعة أحد التي كان فيها ما كان من الاختبار والامتحان \"ما كان الله ليذر المؤمنين على ما أنتم عليه حتى يميز الخبيث من الطيب\" الآية."
    },
    {
      "ayah": 12,
      "surah": 29,
      "text": "يقول تعالى مخبرا عن كفار قريش أنهم قالوا لمن آمن منهم واتبع الهدى: ارجعوا من دينكم إلى ديننا واتبعوا سبيلنا \"ولنحمل خطاياكم\" أي وآثامكم إن كانت لكم آثام في ذلك علينا وفي رقابنا كما يقول القائل افعل هذا وخطيئتك في رقبتي قال الله تعالى تكذيبا لهم \"وما هم بحاملين من خطاياهم من شيء إنهم لكاذبون\" أي فيما قالوه إنهم يحتملون عن أولئك خطاياهم فإنه لا يحمل أحد وزر أحد. قال الله تعالى: \"وإن تدع مثقلة إلى حملها لا يحمل منه شيء ولو كان ذا قربى\" وقال تعالى: \"ولا يسأل حميم حميما يبصرونهم\"."
    },
    {
      "ayah": 13,
      "surah": 29,
      "text": "وقوله تعالى: \"وليحملن أثقالهم وأثقالا مع أثقالهم\" إخبار عن الدعاة إلى الكفر والضلالة أنهم يحملون يوم القيامة أوزار أنفسهم وأوزارا أخرى بسبب ما أضلوا من الناس من غير أن ينقص من أوزار أولئك شيئا كما قال تعالى: \"ليحملوا أوزارهم كاملة يوم القيامة ومن أوزار الذين يضلونهم بغير علم\" الآية وفي الصحيح \"من دعا إلى هدى كان له من الأجر مثل أجور من اتبعه إلى يوم القيامة من غير أن ينقص من أجورهم شيئا ومن دعا إلى ضلالة كان عليه من الإثم مثل آثام من اتبعه إلى يوم القيامة من غير أن ينقص من آثامهم شيئا\" وفي الصحيح \"ما قتلت نفس ظلما إلا كان على ابن آدم الأول كفل من دمها لأنه أول من سن القتل\" وقوله تعالى: \"وليسألن يوم القيامة عما كانوا يفترون\" أي يكذبون ويختلقون من البهتان وقد ذكر ابن أبي حاتم ههنا حديثا فقال: حدثنا أبي حدثنا هشام بن عمار حدثنا صدقة حدثنا عثمان بن حفص بن أبي العالية حدثني سليمان بن حبيب المحاربي عن أبي أمامة رضي الله عنه أن رسول الله صلى الله عليه وسلم بلغ ما أرسل به ثم قال: \"إياكم والظلم فإن الله يعزم يوم القيامة\" فيقول: وعزتي وجلالي لا يجوزني اليوم ظلم ثم ينادي مناد فيقول أين فلان بن فلان؟ فيأتي يتبعه من الحسنات أمثال الجبال فيشخص الناس إليها أبصارهم حتى يقوم بين يدي الرحمن عز وجل ثم يأمر المنادي فينادي من كانت له تباعة أو ظلامة عند فلان بن فلان فهلم فيقبلون حتى يجتمعوا قياما بين يدي الرحمن فيقول الرحمن اقضوا عن عبدي فيقولون كيف نقضي عنه؟ فيقول خذوا لهم من حسناته فلا يزالون يأخذون منها حتى لا يبقى منها حسنة وقد بقي من أصحاب الظلامات. فيقول اقضوا عن عبدى فيقولون لم يبق له حسنة فيقول خذوا من سيئاتهم فاحملوها عليه ثم نزع النبي صلى الله عليه وسلم بهذه الآية الكريمة \"وليحملن أثقالهم وأثقالا مع أثقالهم وليسألن يوم القيامة عما كانوا يفترون\" وهذا الحديث له شاهد في الصحيح من غير هذا الوجه \"إن الرجل ليأتي يوم القيامة بحسنات أمثال الجبال وقد ظلم هذا وأخذ مال هذا وأخذ من عرض هذا فيأخذ هذا من حسناته وهذا من حسناته فإذا لم تبق له حسنة أخذ من سيئاتهم فطرح عليه\". وقال ابن أبي حاتم حدثنا أحمد بن أبي الحواري حدثنا أبو بشر الحذاء عن أبي حمزة الثمالي عن معاذ بن جبل رضي الله عنه قال: قال لي رسول الله صلى الله عليه وسلم: \"يامعاذ إن المؤمن يسأل يوم القيامة عن جميع سعيه حتى عن كحل عينيه وعن فتات الطينة بأصبعيه فلا ألفينك تأتي يوم القيامة وأحد أسعد بما آتاك الله منك\"."
    },
    {
      "ayah": 14,
      "surah": 29,
      "text": "هذه تسلية من الله تعالى لعبده ورسوله محمد صلى الله عليه وسلم يخبره عن نوح عليه السلام أنه مكث في قومه هذه المدة يدعوهم إلى الله تعالى ليلا ونهارا وسرا وجهارا ومع هذا ما زادهم ذلك إلا فرارا عن الحق وإعراضا عنه وتكذيبا له وما آمن معه منهم إلا قليل ولهذا قال تعالى: \"فلبث فيهم ألف سنة إلا خمسين عاما فأخذهم الطوفان وهم ظالمون\" أي بعد هذه المدة الطويلة ما نجع فيهم البلاغ والإنذار فأنت يا محمد لا تأسف على من كفر بك من قومك ولا تحزن عليهم فإن الله يهدي من يشاء ويضل من يشاء وبيده الأمر وإليه ترجع الأمور \"إن الذين حقت عليهم كلمة ربك لا يؤمنون ولو جاءتهم كل آية\" الآية واعلم أن الله سيظهرك وينصرك ويؤيدك ويذل عدوك ويكبتهم ويجعلهم أسفل السافلين. قال حماد بن سلمة عن علي بن زيد عن يوسف بن ماهك عن ابن عباس قال: بعث نوح وهو لأربعين سنة ولبث في قومه ألف سنة إلا خمسين عاما وعاش بعد الطوفان ستين عاما حتى كثر الناس وفشوا وقال قتادة يقال إن عمره كله ألف سنة إلا خمسين عاما لبث فيهم قبل أن يدعوهم ثلاث مائة سنة ودعاهم ثلاث مائة سنة ولبث بعد الطوفان ثلاثمائة سنة وخمسين عاما وهذا قول غريب وظاهر السياق من الآية أنه مكث في قومه يدعوهم إلى الله ألف سنة إلا خمسين عاما. وقال عون بن أبي شداد إن الله تعالى أرسل نوحا إلى قومه وهو ابن خمسين وثلاث مائة سنة فدعاهم ألف سنة إلا خمسين عاما ثم عاش بعد ذلك ثلاث مائة وخمسين سنة وهذا أيضا غريب رواه ابن أبي حاتم وابن جرير وقول ابن عباس أقرب والله أعلم. وقال الثوري عن سلمة بن كهيل عن مجاهد قال: قال لي ابن عمر كم لبث نوح في قومه؟ قال قلت ألف سنة إلا خمسين عاما قال فإن الناس لم يزالوا في نقصان من أعمارهم وأحلامهم وأخلاقهم إلى يومك هذا."
    },
    {
      "ayah": 15,
      "surah": 29,
      "text": "وقوله تعالى: \"فأنجيناه وأصحاب السفينة\" أي الذين آمنوا بنوح عليه السلام وقد تقدم ذكر ذلك مفصلا في سورة هود وتقدم تفسيره بما أغنى عن إعادته: وقوله تعالى: \"وجعلناها آية للعالمين\" أي وجعلنا تلك السفينة باقية إما عينها كما قال قتادة أنها بقيت إلى أول الإسلام على جبل الجودي أو نوعها جعله للناس تذكرة لنعمه على الخلق كيف أنجاهم من الطوفان كما قال تعالى: \"وآية لهم أنا حملنا ذريتهم في الفلك المشحون وخلقنا لهم من مثله ما يركبون - إلى قوله - ومتاعا إلى حين\" وقال تعالى: \"إنا لما طغى الماء حملناكم في الجارية لنجعلها لكم تذكرة وتعيها أذن واعية\" وقال ههنا \"فأنجيناه وأصحاب السفينة وجعلناها آية للعالمين\" وهذا من باب التدريج من الشخص إلى الجنس كقوله تعالى: \"ولقد زينا السماء الدنيا بمصابيح وجعلناها رجوما للشياطين\" أي وجعلنا نوعها رجوما فإن التي يرمى بها ليست هي زينة للسماء وقال تعالى: \"ولقد خلقنا الإنسان من سلالة من طين ثم جعلناه نطفة في قرار مكين\" ولهذا نظائر كثيرة وقال ابن جرير لو قيل إن الضمير في قوله: \"وجعلناها\" عائد إلى العقوبة لكان وجها والله أعلم:."
    },
    {
      "ayah": 16,
      "surah": 29,
      "text": "يخبر تعالى عن عبده ورسوله وخليله إبراهيم إمام الحنفاء إنه دعا قومه إلى عبادة الله وحده لا شريك له والإخلاص له في التقوى وطلب الرزق منه وحده لا شريك له وتوحيده في الشكر فإنه المشكور على النعم لا مسدي لها غيره فقال لقومه \"اعبدوا الله واتقوه\" أي أخلصوا له العبادة والخوف \"ذلكم خير لكم إن كنتم تعلمون\" أي إذا فعلتم ذلك حصل لكم الخير في الدنيا والآخرة واندفع عنكم الشر في الدنيا والآخرة."
    },
    {
      "ayah": 17,
      "surah": 29,
      "text": "ثم أخبر تعالى أن الأصنام التي يعبدونها لا تضر ولا تنفع وإنما اختلقتم أنتم لها أسماء فسميتموها آلهة وإنما هي مخلوقة مثلكم هكذا رواه العوفي عن ابن عباس وقال مجاهد والسدي وروى الوالبي عن ابن عباس وتصنعون إفكا أي تنحتونها أصناما وبه قال مجاهد في رواية وعكرمة والحسن وقتادة وغيرهم واختاره ابن جرير رحمه الله. وهي لا تملك لكم رزقا \"فابتغوا عند الله الرزق\" وهذا أبلغ في الحصر كقوله: \"إياك نعبد وإياك نستعين\" \"رب ابن لي عندك بيتا في الجنة\" ولهذا قال \"فابتغوا\" أي فاطلبوا \"عند الله الرزق\" أي لا عند غيره فإن غيره لا يملك شيئا \"واعبدوه واشكروا له\" أي كلوا من رزقه واعبدوه وحده واشكروا له على ما أنعم به عليكم \"إليه ترجعون\" أي يوم القيامة فيجازي كل عامل بعمله."
    },
    {
      "ayah": 18,
      "surah": 29,
      "text": "وقوله تعالى: \"وإن تكذبوا فقد كذب أمم من قبلكم\" أي فبلغكم ما حل بهم من العذاب والنكال في مخالفة الرسل \"وما على الرسول إلا البلاغ المبين\" يعني إنما على الرسول أن يبلغكم ما أمره الله تعالى به من الرسالة والله يضل من يشاء ويهدي من يشاء فاحرصوا لأنفسكم أن تكونوا من السعداء وقال قتادة في قوله: \"وإن تكذبوا فقد كذب أمم من قبلكم\" قال يعزي نبيه صلى الله عليه وسلم وهذا من قتادة يقتضي أنه قد انقطع الكلام الأول وأعرض بهذا إلى قوله: \"فما كان جواب قومه\" وهكذا نص على ذلك ابن جرير أيضا والظاهر من السياق أن كل هذا من كلام إبراهيم الخليل عليه السلام يحتج عليهم لإثبات المعاد لقوله بعد هذا كله \"فما كان جواب قومه\" والله أعلم."
    },
    {
      "ayah": 19,
      "surah": 29,
      "text": "يقول تعالى مخبرا عن الخليل عليه السلام أنه أرشدهم إلى إثبات المعاد الذي ينكرونه بما يشاهدونه في أنفسهم من خلق الله إياهم بعد أن لم يكونوا شيئا مذكورا ثم وجدوا وصاروا أناسا سامعين مبصرين فالذي بدأ هذا قادر على إعادته فإنه سهل عليه يسير لديه ثم أرشدهم إلى الاعتبار بما في الآفاق من الآيات المشاهدة من خلق الله الأشياء: السموات وما فيها من الكواكب النيرة الثوابت والسيارات والأرضين وما فيها من مهاد وجبال وأودية وبراري وقفار و أشجار وأنهار وثمار وبحار كل ذلك دال على حدوثها في أنفسها وعلى وجود صانعها الفاعل المختار الذي يقول للشيء كن فيكون ولهذا قال: \"أولم يروا كيف يبدىء الله الخلق ثم يعيده إن ذلك على الله يسير\" كقوله تعالى: \"وهو الذي يبدأ الخلق ثم يعيده وهو أهون عليه\"."
    },
    {
      "ayah": 2,
      "surah": 29,
      "text": "استفهام إنكار ومعناه أن الله سبحانه وتعالى لا بد أن يبتلي عباده المؤمنين بحسب ما عندهم من الإيمان كما جاء في الحديث الصحيح \"أشد الناس بلاء الأنبياء ثم الصالحون ثم الأمثل فالأمثل يبتلى الرجل على حسب دينه فإن كان في دينه صلابة زيد له في البلاء\" وهذه الآية كقوله: \"أم حسبتم أن تتركوا ولما يعلم الله الذين جاهدوا منكم ويعلم الصابرين\" ومثلها في سورة براءة وقال في البقرة \"أم حسبتم أن تدخلوا الجنة ولما يأتكم مثل الذين خلوا من قبلكم مستهم البأساء والضراء وزلزلوا حتى يقول الرسول والذين آمنوا معه متى نصر الله ألا إن نصر الله قريب\"."
    },
    {
      "ayah": 20,
      "surah": 29,
      "text": "ثم قال تعالى: \"قل سيروا في الأرض فانظروا كيف بدأ الخلق ثم الله ينشئ النشأة الآخرة\" أي يوم القيامة \"إن الله على كل شيء قدير\" وهذا المقام شبيه بقوله تعالى: \"سنريهم آياتنا في الآفاق وفي أنفسهم حتى يتبين لهم أنه الحق\": وكقوله تعالى: \"أم خلقوا من غير شيء أم هم الخالقون أم خلقوا السموات والأرض بل لا يوقنون\"."
    },
    {
      "ayah": 21,
      "surah": 29,
      "text": "وقوله تعالى \"يعذب من يشاء ويرحم من يشاء\" أي هو الحاكم المتصرف الذي يفعل ما يشاء ويحكم ما يريد لا معقب لحكمه ولا يسأل عما يفعل وهم يسألون فله الخلق والأمر مهما فعل فعدل لأنه المالك الذي لا يظلم مثقال ذرة كما جاء في الحديث الذى رواه أهل السنن \"إن الله لو عذب أهل سماواته وأهل أرضه لعذبهم وهو غير ظالم لهم\" ولهذا قال تعالى: \"يعذب من يشاء ويرحم من يشاء وإليه تقلبون\" أي ترجعون يوم القيامة."
    },
    {
      "ayah": 22,
      "surah": 29,
      "text": "وقوله تعالى: \"وما أنتم بمعجزين في الأرض ولا في السماء\" أي لا يعجزه أحد من أهل سماواته وأرضه بل هو القاهر فوق عباده فكل شيء خائف منه فقير إليه وهو الغني عما سواه \"وما لكم من دون الله من ولي ولا نصير\"."
    },
    {
      "ayah": 23,
      "surah": 29,
      "text": "\"والذين كفروا بآيات الله ولقائه\" أي جحدوها وكفروا بالمعاد \"أولئك يئسوا من رحمتي\" أي لا نصيب لهم فيها \"وأولئك لهم عذاب أليم\" أي موجع شديد في الدنيا والآخرة."
    },
    {
      "ayah": 24,
      "surah": 29,
      "text": "يقول تعالى مخبرا عن قوم إبراهيم في كفرهم وعنادهم ومكابرتهم ودفعهم الحق بالباطل أنهم ما كان لهم جواب بعد مقالة إبراهيم هذه المشتملة على الهدى والبيان \"إلا أن قالوا اقتلوه أو حرقوه\" وذلك لأنهم قام عليهم البرهان و توجهت عليهم الحجة فعدلوا إلى استعمال جاههم وقوة ملكهم \"فقالوا ابنوا له بنيانا فألقوه في الجحيم وأرادوا به كيدا فجعلناهم الأسفلين\" وذلك أنهم حشدوا في جمع أحطاب عظيمة مدة طويلة وحوطوا حولها ثم أضرموا فيها النار فارتفع لها لهب إلى عنان السماء ولم توقد نار قط أعظم منها ثم عمدوا إلى إبراهيم فكتفوه وألقوه في كفة المنجيق ثم قذفوه فيها فجعلها الله عليه بردا وسلاما وخرج منها سالما بعد ما مكث فيها أياما ولهذا وأمثاله جعله الله للناس إماما فإنه بذل نفسه للرحمن وجسده للنيران وسخا بولده للقربان وجعل ماله للضيفان ولهذا اجتمع على محبته جميع أهل الأديان. وقوله تعالى: \"فأنجاه الله من النار\" أي سلمه منها بأن جعلها عليه بردا وسلاما."
    },
    {
      "ayah": 25,
      "surah": 29,
      "text": "\"إن في ذلك لآيات لقوم يؤمنون وقالوا إنما اتخذتم من دون الله أوثانا مودة بينكم في الحياة الدنيا\"يقول لقومه مقرعا لهم وموبخا على سوء صنيعهم في عبادتهم للأوثان إنما اتخذتم هذه لتجتمعوا على عبادتها في الدنيا صداقة وألفة منكم بعضكم لبعض في الحياة الدنيا وهذا على قراءة من نصب مودة بينكم على أنه مفعول له وأما على قراءة الرفع فمعناه إنما اتخاذكم هذا لتحصل لكم المودة في الدنيا فقط ثم يوم القيامة ينعكس هذا الحال فتبقى هذه الصداقة والمودة بغضا وشنآنا \"ثم يكفر بعضكم ببعض\" أي تتجاحدون ما كان بينكم \"ويلعن بعضكم بعضا\" أي يلعن الأتباع المتبوعين والمتبوعون الأتباع \"كلما دخلت أمة لعنت أختها\" وقال تعالى: \"الأخلاء يومئذ بعضهم لبعض عدو إلا المتقين\" وقال ههنا \"ثم يوم القيامة يكفر بعضكم ببعض ويلعن بعضكم بعضا ومأواكم النار\" الآية أي ومصيركم ومرجعكم بعد عرصات القيامة إلى النار ومالكم من ناصر ينصركم ولا منقذ ينقذكم من عذاب الله وهذا حال الكافرين وأما المؤمنون فبخلاف ذلك. قال ابن أبي حاتم حدثنا محمد بن إسماعيل الأحمسي حدثنا أبو عاصم الثقفي ثنا الربيع بن إسماعيل بن عمرو بن سعيد بن جعدة بن هبيرة المخزومي عن أبيه عن جده عن أم هانىء أخت علي بن أبي طالب قالت قال لي النبي صلى الله عليه وسلم: \"أخبرك أن الله تعالى يجمع الأولين والآخرين يوم القيامة في صعيد واحد فمن يدري أين الطرفان؟ قالت الله ورسوله أعلم - ثم ينادي مناد من تحت العرش يا أهل التوحيد فيشرئبون - قال أبو عاصم يرفعون رؤوسهم ثم ينادي يا أهل التوحيد ثم ينادي الثالثة يا أهل التوحيد إن الله قد عفا عنكم - قال- فيقول الناس قد تعلق بعضهم ببعض في ظلمات الدنيا - يعني المظالم - ثم ينادي يا أهل التوحيد ليعف بعضكم عن بعض وعلى الله الثواب\"."
    },
    {
      "ayah": 26,
      "surah": 29,
      "text": "يقول تعالى مخبرا عن إبراهيم أنه آمن له لوط يقال إنه ابن أخي إبراهيم يقولون هو لوط بن هاران بن آزر يعني ولم يؤمن به من قومه سواه وسارة امرأة إبراهيم الخليل. لكن يقال كيف الجمع بين هذه الآية وبين الحديث الوارد في الصحيح أن إبراهيم حين مر على ذلك الجبار فسأل إبراهيم عن سارة ما هي منه فقال أختي ثم جاء إليها فقال لها إني قد قلت له إنك أختي فلا تكذبيني فإنه ليس على وجه الأرض مؤمن غيري وغيرك فأنت أختي في الدين. وكأن المراد من هذا والله أعلم أنه ليس على وجه الأرض زوجان على الإسلام غيري وغيرك فإن لوطا عليه السلام آمن به من قومه وهاجر معه إلى بلاد الشام ثم أرسل في حياة الخليل إلى أهل سدوم وأقام بها وكان من أمرهم ما تقدم وما سيأتي وقوله تعالى: \"وقال إنى مهاجر إلى ربي\" يحتمل عود الضمير في قوله: \"وقال إني مهاجر\" على لوط لأنه هو أقرب المذكورين ويحتمل عوده إلى إبراهيم. قاله ابن عباس والضحاك وهو المكنى عنه بقوله: \"فأمن له لوط\"أي من قومه ثم أخبر عنه بأنه اختار المهاجرة من بين أظهرهم ابتغاء إظهار الدين والتمكن من ذلك ولهذا قال: \"إنه هو العزيز الحكيم\" أي له العزة ولرسوله وللمؤمنين به الحكيم في أقواله وأفعاله وأحكامه القدرية والشرعية. وقال قتادة هاجرا جميعا من كوثى وهي من سواد الكوفة إلى الشام. قال وذكر لنا أن نبي الله صلى الله عليه وسلم قال: \"إنها ستكون هجرة بعد هجرة ينحاز أهل الأرض إلى مهاجر إبراهيم ويبقى في الأرض شرار أهلها حتى تلفظهم أرضهم وتقذرهم روح الله عز وجل وتحشرهم النار مع القردة والخنازير تبيت معهم إذا باتوا وتقيل معهم إذا قالوا وتأكل ما سقط منهم\" وقد أسند الإمام أحمد هذا الحديث فرواه مطولا من حديث عبدالله بن عمرو بن العاص قال حدثنا عبدالرزاق أخبرنا معمر عن قتادة عن شهر بن حوشب قال: لما جاءتنا بيعة يزيد بن معاوية قدمت الشام فأخبرت بمقام يقومه نوف البكالي فجئته إذ جاء رجل فانتبذ الناس وعليه خميصة فإذا هو عبدالله بن عمرو بن العاص فلما رآه نوف أمسك عن الحديث فقال عبدالله: سمعت رسول الله صلى الله عليه وسلم يقول: \"إنها ستكون هجرة بعد هجرة فينحاز الناس إلى مهاجر إبراهيم لا يبقى في الأرض إلا شرار أهلها فتلفظهم أرضهم تقذرهم نفس الرحمن تحشرهم النار مع القردة والخنازير فتبيت معهم إذا باتوا وتقيل معهم إذا قالوا وتأكل من تخلف منهم\" قال وسمعت رسول الله صلى الله عليه وسلم يقول: \"سيخرج أناس من أمتي من قبل المشرق يقرؤون القرآن لا يجاوز تراقيهم كلما خرج منهم قرن قطع كلما خرج منهم قرن قطع - حتى عدها زيادة على عشرين مرة كلما خرج منهم قرن قطع حتى يخرج الدجال في بقيتهم\" ورواه الإمام أحمد عن أبي داود وعبدالصمد كلاهما عن هشام الدستوائي عن قتادة به وقد رواه أبو داود في سننه فقال في كتاب الجهاد \"باب ما جاء في سكنى الشام\". حدثنا عبيدالله بن عمر حدثنا معاذ بن هشام حدثني عن قتادة عن شهر بن حوشب عن عبدالله بن عمر قال: سمعت النبي صلى الله عليه وسلم يقول: \"ستكون هجرة بعد هجرة وينحاز أهل الأرض ألزمهم مهاجر إبراهيم ويبقى في الأرض شرار أهلها تلفظهم أرضهم وتقذرهم نفس الرحمن وتحشرهم النار مع القردة والخنازير\" وقال الإمام أحمد حدثنا يزيد أخبرنا أبو جناب يحيى بن أبي حية عن شهر بن حوشب قال سمعت عبدالله بن عمر يقول: لقد رأيتنا وما صاحب الدينار والدرهم بأحق به من أخيه المسلم ثم لقد رأيتنا بآخرة الآن والدينار والدرهم أحب إلى أحدنا من أخيه المسلم ولقد سمعت رسول الله صلى الله عليه وسلم يقول: \"لئن اتبعتم أذناب البقر وتبايعتم بالعينة وتركتم الجهاد في سبيل الله ليلزمنكم الله مذلة في أعناقكم لا تنزع منكم حتى ترجعوا إلى ما كنتم عليه وتتوبوا إلى الله تعالى\" وسمعت رسول الله صلى الله عليه وسلم يقول: \"لتكونن هجرة بعد هجرة إلى مهاجر أبيكم إبراهيم حتى لا يبيت في الأرض إلا شرار أهلها وتلفظهم أرضوهم وتقذرهم روح الرحمن وتحشرهم النار مع القردة والخنازير تقيل معهم حيث قالوا وتبيت معهم حيث يبيتون وما سقط منهم فلها\" ولقد سمعت رسول الله صلى الله عليه وسلم يقول: \"يخرج قوم من أمتى يسيئون الأعمال يقرؤون القرآن لا يجاوز حناجرهم - قال يزيد لا أعلمه إلا قال - يحقر أحدكم علمه مع علمهم يقتلون أهل الإسلام فإذا خرجوا فاقتلوهم ثم إذا خرجوا فاقتلوهم ثم إذا خرجوا فاقتلوهم فطوبى لمن قتلهم وطوبى لمن قتلوه كلما طلع منهم قرن قتله الله\" فردد ذلك رسول الله صلى الله عليه وسلم عشرين مرة أو أكثر وأنا أسمع وقال الحافظ أبو بكر البيهقي حدثنا أبو الحسن بن الفضل أخبرنا عبدالله بن جعفر حدثنا يعقوب بن سفيان حدثنا أبو النضر إسحاق بن إبراهيم بن يزيد وهشام بن عمار الدمشقيان قالا حدثنا يحيى بن حمزة حدثنا الأوزاعي عن نافع وقال أبو النضر عمن حدثه عن نافع عن عبدالله بن عمر أن رسول الله صلى الله عليه وسلم قال: \"سيهاجر أهل الأرض هجرة بعد هجرة إلى مهاجر إبراهيم حتى لا يبقى إلا شرار أهلها تلفظهم الأرضون وتقذرهم روح الرحمن وتحشرهم النار مع القردة والخنازير تبيت معهم حيث باتوا وتقيل معهم حيث قالوا لها ما سقط منهم\" غريب من حديث نافع والظاهر أن الأوزاعي قد رواه عن شيخ له من الضعفاء والله أعلم. وروايته من حديث عبدالله بن عمرو بن العاص أقرب إلى الحفظ."
    },
    {
      "ayah": 27,
      "surah": 29,
      "text": "وقوله تعالى: \"ووهبنا له إسحاق ويعقوب\" كقوله: \"فلما اعتزلهم وما يعبدون من دون الله وهبنا له إسحاق ويعقوب وكلا جعلنا نبيا\" أي أنه لما فارق قومه أقر الله عينه بوجود ولد صالح نبي وولد له ولد صالح نبي في حياة جده وكذلك قال تعالى: \"ووهبنا له إسحاق ويعقوب نافلة\" أي زيادة كما قال تعالى: \"فبشرناه بإسحاق ومن وراء إسحاق يعقوب\" أي يولد لهذا الولد ولد في حياتكما تقر به أعينكما وكون يعقوب ولد لإسحاق نص عليه القرآن وثبتت به السنة النبوية قال الله تعالى: \"أم كنتم شهداء إذ حضر يعقوب الموت إذ قال لبنيه ما تعبدون من بعدي؟ قالوا نعبد إلهك وإله آبائك إبراهيم وإسماعيل وإسحاق إلها واحدا\" الآية وفي الصحيحين \"إن الكريم ابن الكريم ابن الكريم ابن الكريم يوسف بن يعقوب بن إسحاق بن إبراهيم عليهم الصلاة والسلام\" فأما ما رواه العوفي عن ابن عباس في قوله: \"ووهبنا له إسحاق ويعقوب\" قال هما ولدا إبراهيم فمعناه أن ولد الولد بمنزلة الولد فإن هذا الأمر لا يكاد يخفى على من هو دون ابن عباس. وقوله تعالى: \"وجعلنا في ذريته النبوة والكتاب\" هذه خلعة سنية عظيمة مع اتخاذ الله إياه خليلا وجعله للناس إماما أن جعل في ذريته النبوة والكتاب فلم يوجد نبي بعد إبراهيم عليه السلام إلا وهو من سلالته فجميع أنبياء بني إسرائيل من سلالة يعقوب بن إسحاق بن إبراهيم حتى كان آخرهم عيسى ابن مريم فقام في ملئهم مبشرا بالنبي العربي القرشي الهاشمي خاتم الرسل على الإطلاق وسيد ولد آدم في الدنيا والآخرة الذي اصطفاه الله من صميم العرب العرباء من سلالة إسماعيل بن إبراهيم عليهما السلام ولم يوجد نبي من سلالة إسماعيل سواه عليه أفضل الصلاة والسلام. وقوله: \"وآتيناه أجره في الدنيا وإنه في الآخرة لمن الصالحين\" أي جمع الله له بين سعادة الدنيا الموصولة بسعادة الآخرة فكان له في الدنيا الرزق الواسع الهني والمنزل الرحب والمورد العذب والزوجة الحسنة الصالحة والثناء الجميل والذكر الحسن وكل أحد يحبه ويتولاه كما قال ابن عباس ومجاهد وقتادة وغيرهم مع القيام بطاعة الله من جميع الوجوه كما قال تعالى: \"وإبراهيم الذي وفي\" أي قام بجميع ما أمر وكمل طاعة ربه ولهذا قال تعالى: \"وآتيناه أجره في الدنيا وإنه في الآخرة لمن الصالحين\" وكما قال تعالى: \"إن إبراهيم كان أمة قانتا لله حنيفا ولم يك من المشركين- إلى قوله - وإنه في الآخرة لمن الصالحين\"."
    },
    {
      "ayah": 28,
      "surah": 29,
      "text": "يقول تعالى مخبرا عن نبيه لوط عليه السلام أنه أنكر على قومه سوء صنيعهم وما كانوا يفعلونه من قبيح الأعمال في إتيانهم الذكران من العالمين ولم يسبقهم إلى هذه الفعلة أحد من بني آدم قبلهم."
    },
    {
      "ayah": 29,
      "surah": 29,
      "text": "وكانوا مع هذا يكفرون بالله ويكذبون رسوله ويخالفون ويقطعون السبيل أي يقفون في طريق الناس يقتلونهم ويأخذون أموالهم \"وتأتون في ناديكم المنكر\" أي يفعلون ما لا يليق من الأقوال والأفعال في مجالسهم التي يجتمعون فيها لا ينكر بعضهم على بعض شيئا من ذلك فمن قائل كانوا يأتون بعضهم بعضا في الملأ قاله مجاهد ومن قائل كانوا يتضارطون ويتضاحكون قالته عائشة رضي الله عنها والقاسم ومن قائل كانوا يناطحون بين الكباش ويناقرون بين الديوك وكل ذلك كان يصدر عنهم وكانوا شرا من ذلك وقال الإمام أحمد حدثنا حماد بن أسامة أخبرني حاتم بن أبي صغيرة حدثنا سماك بن حرب عن أبي صالح مولى أم هانىء عن أم هانىء قالت سألت رسول الله صلى الله عليه وسلم عن قوله تعالى: \"وتأتون في ناديكم المنكر\" قال: \"يحذفون أهل الطريق ويسخرون منهم وذلك المنكر الذي كانوا يأتونه\" ورواه الترمذي وابن جرير وابن أبي حاتم من حديث أبي أسامة حماد بن رسامة عن أبي يونس القشيري عن حاتم بن أبي صغيرة به. ثم قال الترمذي هذا حديث حسن لا نعرفه إلا من حديث حاتم ابن أبي صغيرة عن سماك وقال ابن أبي حاتم حدثنا الحسن بن عرفة حدثنا محمد بن كثير عن عمرو بن قيس عن الحكم عن مجاهد \"وتأتون في ناديكم المنكر\" قال الصفير ولعب الحمام والجلاهق والسؤال في المجلس وحل أزرار القباء وقوله تعالى: \"فما كان جواب قومه إلا أن قالوا ائتنا بعذاب الله إن كنت من الصادقين\" وهذا من كفرهم واستهزائهم وعنادهم."
    },
    {
      "ayah": 3,
      "surah": 29,
      "text": "ولهذا قال ههنا \"ولقد فتنا الذين من قبلهم فليعلمن الله الذين صدقوا وليعلمن الكاذبين\" أي الذين صدقوا في دعوى الإيمان ممن هو كاذب في قوله ودعواه والله سبحانه وتعالى يعلم ما كان وما يكون وما لم يكن لو كان كيف يكون. وهذا مجمع عليه عند أئمة السنة والجماعة وبهذا يقول ابن عباس وغيره في مثل قوله \"إلا لنعلم\" إلا لنرى وذلك لأن الرؤية إنما تتعلق بالموجود والعلم أعم من الرؤية فإنه يتعلق بالمعدوم والموجود."
    },
    { "ayah": 30, "surah": 29, "text": "ولهذا استنصر عليهم نبي الله فقال: \"رب انصرني على القوم المفسدين\"." },
    {
      "ayah": 31,
      "surah": 29,
      "text": "لما استنصر لوط عليه السلام بالله عز وجل عليهم بعث الله لنصرته ملائكة فمروا على إبراهيم عليه السلام في هيئة أضياف فجاءهم بما ينبغي للضيف فلما رأى إبراهيم أنه لا همة لهم إلى الطعام نكرهم وأوجس منهم خيفة فشرعوا يؤانسونه ويبشرونه بوجود ولد صالح من امرأته سارة وكانت حاضرة فتعجبت من ذلك كما تقدم بيانه في سورة هود والحجر فلما جاءت إبراهيم البشرى وأخبروه بأنهم أرسلوا لهلاك قوم لوط أخذ يدافع لعلهم ينظرون لعل الله أن يهديهم ولما قالوا إنا مهلكوا أهل هذه القرية."
    },
    { "ayah": 32, "surah": 29, "text": "أي من الهالكين لأنها كانت تمالئهم على كفرهم وبغيهم ودبرهم." },
    {
      "ayah": 33,
      "surah": 29,
      "text": "ثم ساروا من عنده فدخلوا على لوط في صورة شبان حسان فلما رآهم كذلك \"سيء بهم وضاق بهم ذرعا\" أي اغتم بأمرهم إن هو أضافهم خاف عليهم من قومه وإن لم يضفهم خشى عليهم منهم ولم يعلم بأمرهم في الساعة الراهنة \"قالوا لا تخف ولا تحزن إنا منجوك وأهلك إلا امرأتك كانت من الغابرين\"."
    },
    {
      "ayah": 34,
      "surah": 29,
      "text": "وذلك أن جبريل عليه السلام اقتلع قراهم من قرار الأرض ثم رفعها إلى عنان السماء ثم قلبها عليهم وأرسل الله عليهم حجارة من سجيل منضود مسومة عند ربك وما هي من الظالمين ببعيد وجعل الله مكانها بحيرة خبيثة منتنة وجعلهم عبرة. إلى يوم التناد وهم من أشد الناس عذابا يوم المعاد."
    },
    {
      "ayah": 35,
      "surah": 29,
      "text": "ولهذا قال تعالى: \"ولقد تركنا منها آية بينة\" أي واضحة \"لقوم يعقلون\" كما قال تعالى: \"وإنكم لتمرون عليهم مصبحين وبالليل أفلا تعقلون\"."
    },
    {
      "ayah": 36,
      "surah": 29,
      "text": "يخبر تعالى عن عبده ورسوله شعيب عليه السلام أنه أنذر قومه أهل مدين فأمرهم بعبادة الله وحده لا شريك له وأن يخافوا بأس الله ونقمته وسطوته يوم القيامة فقال: \"يا قوم اعبدوا الله وارجوا اليوم الآخر\" قال ابن جرير قال بعضهم معناه واخشوا اليوم الآخر وهذا كقوله تعالى: \"لمن كان يرجو الله واليوم الآخر\" وقوله: \"ولا تعثوا في الأرض مفسدين\" نهاهم عن العيث في الأرض بالفساد وهو السعي فيها والبغي على أهلها وذلك أنهم كانوا ينقصون المكيال والميزان ويقطعون الطريق على الناس."
    },
    {
      "ayah": 37,
      "surah": 29,
      "text": "هذا مع كفرهم بالله ورسوله فأهلكهم الله برجفة عظيمة زلزلت عليهم بلادهم وصيحة أخرجت القلوب من حناجرها. وعذاب يوم الظلة الذي أزهق الأرواح من مستقرها إنه كان عذاب يوم عظيم وقد تقدمت قصتهم مبسوطة في سورة الأعراف وهود والشعراء وقوله: \"فأصبحوا في دارهم جاثمين\" قال قتادة ميتين. وقال غيره قد ألقي بعضهم على بعض."
    },
    {
      "ayah": 38,
      "surah": 29,
      "text": "يخبر تعالى عن هؤلاء الأمم المكذبة للرسل كيف أبادهم وتنوع في عذابهم وأخذهم بالانتقام منهم فعاد قوم هود عليه السلام كانوا يسكنون الأحقاف وهي قريبة من حضرموت بلاد اليمن وثمود قوم صالح كانوا يسكنون الحجر قريبا من وادي القرى. وكانت العرب تعرف مساكنهما جيدا وتمر عليها كثيرا."
    },
    {
      "ayah": 39,
      "surah": 29,
      "text": "وقارون صاحب الأموال الجزيلة ومفاتيح الكنوز الثقيلة وفرعون ملك مصر في زمان موسى ووزيره هامان القبطيان الكافران بالله تعالى وبرسوله صلى الله عليه وسلم."
    },
    {
      "ayah": 4,
      "surah": 29,
      "text": "أي لا يحسبن الذين لم يدخلوا في الإيمان أنهم يتخلصون من هذه الفتنة والامتحان فإن من ورائهم من العقوبة والنكال ما هو أغلظ من هذا وأطم ولهذا قال \"أم حسب الذين يعملون السيئات أن يسبقونا\" أي يفوتونا \"ساء ما يحكمون\" أي بئس ما يظنون."
    },
    {
      "ayah": 40,
      "surah": 29,
      "text": "\"فكلا أخذنا بذنبه\" أي كانت عقوبته بما يناسبه \"فمنهم من أرسلنا عليه حاصبا\" وهم عاد وذلك أنهم قالوا من أشد منا قوة فجاءتهم ريح صرصر باردة شديدة البرد عاتية شديدة الهبوب جدا تحمل عليهم حصباء الأرض فتلقيهـا عليهم وتقتلعهم من الأرض فترفع الرجل منهم من الأرض إلى عنان السماء ثم تنكسه على أم رأسه فتشدخه فيبقى بدنا بلا رأس كأنهم أعجاز نخل منقعر \"ومنهم من أخذته الصيحة\" وهم ثمود قامت عليهم الحجة وظهرت لهم الدلالة من تلك الناقة التي انفلقت عنها الصخرة مثل ما سألوا سواء بسواء ومع هذا ما آمنوا بل استمروا على طغيانهم وكفرهم وتهددوا نبي الله صالحا ومن آمن معه وتوعدوهم بأن يخرجوهم ويرجموهم فجاءتهم صيحة أخمدت الأصوات منهم والحركات \"ومنهم من خسفنا به الأرض\" وهو قارون الذي طغى وبغى وعتا وعصى الرب الأعلى ومشى في الأرض مرحا وفرح ومرح وتاه بنفسه واعتقد أنه أفضل من غيره واختال في مشيته فخسف الله به وبداره الأرض فهو يتجلجل فيها إلى يوم القيامة \"ومنهم من أغرقنا\" وهو فرعون ووزيره هامان وجنودهما عن آخرهم أغرقوا في صبيحة واحدة فلم ينج منهم مخبر \"وما كان الله ليظلمهم\" أي فيما فعل بهم \"ولكن كانوا أنفسهم يظلمون\" أي إنما فعل ذلك بهم جزاء وفاقا بما كسبت أيديهم وهذا الذي ذكرناه ظاهر سياق الآية وهو من باب اللف والنشر وهو أنه ذكر الأمم المكذبة ثم قال \"فكلا أخذنا بذنبه\" أي من هؤلاء المذكورين وإنما نبهت على هذا لأنه قد روى ابن جريج قال: قال ابن عباس في قوله \"فمنهم من أرسلنا عليه حاصبا\" قال قوم لوط \"ومنهم من أغرقنا\" قال قوم نوح وهذا منقطع عن ابن عباس فإن ابن جريج لم يدركه. ثم قد ذكر الله في هذه السورة إهلاك قوم نوح بالطوفان وقوم لوط بإنزال الرجز من السماء وأطال السياق والفصل بين ذلك وبين هذا السياق وقال قتادة \"فمنهم من أرسلنا عليه حاصبا\" قال قوم لوط \"ومنهم من أخذته الصيحة\" قوم شعيب وهذا بعيد أيضا لما تقدم والله أعلم."
    },
    {
      "ayah": 41,
      "surah": 29,
      "text": "هذا مثل ضربه الله تعالى للمشركين في اتخاذهم آلهة من دون الله يرجون نصرهم ورزقهم ويتمسكون بهم في الشدائد فهم في ذلك كبيت العنكبوت في ضعفه ووهنه فليس في أيدي هؤلاء من آلهتهم إلا كمن يتمسك ببيت العنكبوت فإنه لا يجدي عنه شيئا فلو علموا هذا الحال لما اتخذوا من دون الله أولياء وهذا بخلاف المسلم المؤمن قلبه لله وهو مع ذلك يحسن العمل في اتباع الشرع فإنه متمسك بالعروة الوثقى لا انفصام لها لقوتهـا وثباتها."
    },
    {
      "ayah": 42,
      "surah": 29,
      "text": "ثم قال تعالى متوعدا لمن عبد غيره وأشرك به أنه تعالى يعلم ما هم عليه من الأعمال ويعلم ما يشركون به من الأنداد وسيجزيهم وصفهم إنه حكيم عليم."
    },
    {
      "ayah": 43,
      "surah": 29,
      "text": "ثم قال تعالى \"وتلك الأمثال نضربها للناس وما يعقلها إلا العالمون\" أي وما يفهمها ويتدبرها إلا الراسخون في العلم المتضلعون منه قال الإمام أحمد حدثنا إسحاق بن عيسى حدثني ابن لهيعة عن أبي قبيل عن عمرو بن العاص رضي الله عنه قال: عقلت عن رسول الله صلى الله عليه وسلم ألف مثل وهذه منقبة عظيمة لعمرو بن العاص رضي الله عنه حيث يقول الله تعالى \"وتلك الأمثال نضربها للناس وما يعقلها إلا العالمون\" وقال ابن أبي حاتم حدثنا علي بن الحسين ثنا أحمد بن عبدالرحمن حدثنا أبي حدثنا ابن سنان عن عمرو بن مرة قال: ما مررت بآية من كتاب الله لا أعرفها إلا أحزنني لأني سمعت الله تعالى يقول \"وتلك الأمثال نضربها للناس وما يعقلها إلا العالمون\"."
    },
    {
      "ayah": 44,
      "surah": 29,
      "text": "يقول تعالى مخبرا عن قدرته العظيمة أنه خلق السماوات والأرض بالحق يعني لا على وجه العبث واللعب \"لتجزى كل نفس بما تسعى\" \"ليجزي الذين أساءوا بما عملوا ويجزي الذين أحسنوا بالحسنى\" وقوله تعالى \"إن في ذلك لآية للمؤمنين\" أي لدلالة واضحة على أنه تعالى المتفرد بالخلق والتدبير والإلهية."
    },
    {
      "ayah": 45,
      "surah": 29,
      "text": "ثم قال تعالى آمرا رسوله والمؤمنين بتلاوة القرآن وهو قراءته وإبلاغه للناس \"وأقم الصلاة إن الصلاة تنهى عن الفحشاء والمنكر ولذكر الله أكبر\" يعني أن الصلاة تشتمل على شيئين على ترك الفواحش والمنكرات أي مواظبتها تحمل على ترك ذلك وقد جاء في الحديث من رواية عمران وابن عباس مرفوعا \"من لم تنهه صلاته عن الفحشاء والمنكر لم تزده من الله إلا بعدا\". \"ذكر الآثار الواردة في ذلك\" قال ابن أبي حاتم حدثنا محمد بن هارون المخرمي الفلاس حدثنا عبدالرحمن بن نافع أبو زياد حدثنا عمر بن أبي عثمان حدثنا الحسن عن عمران بن حصين قال سئل النبي صلى الله عليه وسلم عن قول الله \"إن الصلاة تنهي عن الفحشاء والمنكر\" قال \"من لم تنهه صلاته عن الفحشاء والمنكر فلا صلاة له\" وحدثنا علي بن الحسين حدثنا يحيى ابن أبي طلحة اليربوعي حدثنا أبو معاوية عن ليث عن طاوس عن ابن عباس قال: قال رسول الله صلى الله عليه وسلم \"من لم تنهه صلاته عن الفحشاء والمنكر لم يزدد بها من الله إلا بعدا\" رواه الطبراني من حديث أبي معاوية. وقال ابن جرير حدثنا القاسم حدثنا الحسين حدثنا خالد بن عبدالله عن العلاء بن المسيب عمن ذكره عن ابن عباس في قوله \"إن الصلاة تنهى عن الفحشاء والمنكر\" قال فمن لم تأمره صلاته بالمعروف وتنهاه عن المنكر لم يزدد بصلاته من الله إلا بعدا. فهذا موقوف. قال ابن جرير وحدثنا القاسم حدثنا الحسين حدثنا علي بن هاشم بن البريد عن جويبر عن الضحاك عن ابن مسعود عن النبي صلى الله عليه وسلم أنه قال \"لا صلاة لمن لم يطع الصلاة\" وطاعة الصلاة أن تنهاه عن الفحشاء والمنكر. قال: قال سفيان \"قالوا يا شعيب أصلاتك تأمرك\" قال فقال سفيان إي والله تأمره وتنهاه. وقال ابن أبي حاتم حدثنا أبو سعيد الأشج حدثنا أبو خالد عن جويبر عن الضحاك عن عبدالله قال: قال رسول الله صلى الله عليه وسلم وقال أبو خالد مرة عن عبدالله \"لا صلاة لمن لم يطع الصلاة وطاعة الصلاة تنهاه عن الفحشاء والمنكر\" والموقوف أصح كما رواه الأعمش عن مالك بن الحارث عن عبدالرحمن بن يزيد قال قيل لعبدالله إن فلانا يطيل الصلاة قال إن الصلاة لا تنفع إلا من أطاعها: وقال ابن جرير حدثنا علي حدثنا إسماعيل بن مسلم عن الحسن قال: قال رسول الله صلى الله عليه وسلم \"من صلى صلاة لم تنهه عن الفحشاء والمنكر لم يزدد بها من الله إلا بعدا\" والأصح في هذا كله الموقوفات عن ابن مسعود وابن عباس والحسن وقتادة والأعمش وغيرهم والله أعلم. وقال الحافظ أبو بكر البزار حدثنا يوسف بن موسى أنبأنا جرير- يعني ابن عبدالحميد - عن الأعمش عن أبي صالح قال أراه عن جابر شك الأعمش قال: قال رجل للنبي صلى الله عليه وسلم إن فلانا يصلي بالليل فإذا أصبح سرق قال \"سينهاه ما تقول\" وحدثنا محمد بن موسى الجرشي أخبرنا زياد بن عبدالله عن الأعمش عن أبي صالح عن جابر عن النبي صلى الله عليه وسلم بنحوه ولم يشك ثم قال: وهذا الحديث قد رواه عن الأعمش غير واحد واختلفوا في إسناده فرواه غير واحد عن الأعمش عن أبي صالح عن أبي هريرة أو غيره وقال قيس عن الأعمش عن أبي سفيان عن جابر قال جرير وزياد عن عبدالله عن الأعمش عن أبي صالح عن جابر وقال الإمام أحمد حدثنا وكيع أخبرنا الأعمش قال أرى أبا صالح عن أبي هريرة قال جاء رجل إلى النبي صلى الله عليه وسلم فقال إن فلانا يصلي بالليل فإذا أصبح سرق فقال إنه سينهاه ما تقول\". وتشتمل الصلاة أيضا على ذكر الله تعالى وهو المطلوب الأكبر ولهذا قال تعالى \"ولذكر الله أكبر\" أي أعظم من الأول \"والله يعلم ما تصنعون\" أي يعلم جميع أعمالكم وأقوالكم. وقال أبو العالية في قوله تعالى \"إن الصلاة تنهى عن الفحشاء والمنكر\" قال إن الصلاة فيها ثلاث خصال فكل صلاة لا يكـون فيها شيء من هذه الخلال فليست بصلاة. الإخلاص والخشية وذكر الله فالإخلاص يأمره بالمعروف والخشية تنهاه عن المنكر وذكر الله القرآن يأمره وينهاه وقال ابن عون الأنصاري إذا كنت في صلاة فأنت في معروف وقد حجزتك عن الفحشاء والمنكر والذي أنت فيه من ذكر الله أكبر وقال حماد بن أبي سليمان \"إن الصلاة تنهي عن الفحشاء والمنكر\" يعني ما دمت فيها وقال علي بن أبي طلحة عن ابن عباس في قوله تعالى \"ولذكر الله أكبر\" يقول ولذكر الله لعباده أكبر إذا ذكروه من ذكرهم إياه وكذا روى غير واحد عن ابن عباس وبه قال مجاهد وغيره: وقال ابن أبي حاتم حدثنا أبو سعيد الأشج حدثنا أبو خالد الأحمر عن داود بن أبي هند عن رجل عن ابن عباس \"ولذكر الله أكبر\" قال ذكر الله عند طعامك وعند منامك قلت فإن صاحبا لي في المنزل يقول غير الذي تقول قال وأي شيء يقول؟ قلت قال يقول الله تعالى \"فاذكروني أذكركم\" فلذكر الله إيانا أكبر من ذكرنا إياه قال: صدق: قال وحدثنا أبي حدثنا النفيلى حدثنا إسماعيل عن خالد عن عكرمة عن ابن عباس في قوله تعالى \"ولذكر الله أكبر\" قال لها وجهان قال ذكر الله عند ما حرمه قال وذكر الله إياكم أعظم من ذكركم إياه وقال ابن جرير حدثني يعقوب بن إبراهيم أخبرنا هشيم أخبرنا عطاء بن السائب عن عبدالله بن ربيعة قال: قال لي ابن عباس هل تدري ما قوله تعالى \"ولذكر الله أكبر\"؟ قال قلت نعم قال فما هو؟ قلت التسبيح والتحميد والتكبير في الصلاة وقراءة القرآن ونحو ذلك قال لقد قلت قولا عجيبا وما هو كذلك ولكنه إنما يقول ذكر الله إياكم عندما أمر به أو نهى عنه إذا ذكرتموه أكبر من ذكركم إياه وقد روي هذا من غير وجه عن ابن عباس وروي أيضا عن ابن مسعود وأبي الدرداء وسليمان الفارسي وغيرهم واختاره ابن جرير."
    },
    {
      "ayah": 46,
      "surah": 29,
      "text": "قال قتادة وغير واحد: هذه الآية منسوخة بآية السيف ولم يبق معهم مجادلة وإنما هو الإسلام أو الجزية أو السيف وقال آخرون بل هي باقية محكمة لمن أراد الاستبصار منهم في الدين فيجادل بالتي هي أحسن ليكون أنجع فيه كما قال تعالى \"ادع إلى سبيل ربك بالحكمة والموعظة الحسنة\" الآية وقال تعالى لموسى وهارون حين بعثهما إلى فرعون \"فقولا له قولا لينا لعله يتذكر أو يخشى\" وهذا القول اختاره ابن جرير وحكاه عن ابن زيد. وقوله تعالى \"إلا الذين ظلموا منهم\" أي حادوا عن وجه الحق وعموا عن واضح المحجة وعاندوا وكابروا فحينئذ ينتقل من الجدال إلى الجلاد ويقاتلون بما يمنعهم ويردعهم قال الله عز وجل \"لقد أرسلنا رسلنا بالبينات وأنزلنا معهم الكتاب والميزان ليقوم الناس بالقسط وأنزلنا الحديد فيه بأس شديد - إلى قوله - إن الله قوي عزيز\" قال جابر: أمرنا من خالف كتاب الله أن نضربه بالسيف قال مجاهد \"إلا الذين ظلموا منهم\" يعني أهل الحرب ومن امتنع منهم من أداء الجزية. وقوله تعالى \"وقولوا آمنا بالذى أنزل إلينا وأنزل إليكم\" يعني إذا أخبروا بما لا نعلم صدقه ولا كذبه فهذا لا نقدم على تكذيبه لأنه قد يكون حقا ولا تصديقه فلعله أن يكون باطلا ولكن نؤمن به إيمانا مجملا معلقا على شرط وهو أن يكون منزلا لا مبدلا ولا مؤولا. قال البخاري رحمه الله حدثنا محمد بن بشار حدثنا عثمان بن عمر أخبرنا علي بن المبارك عن يحيى بن أبي كثير عن أبى سلمة عن أبي هريرة رضي الله عنه قال: كان أهل الكتاب يقرءون التوراة بالعبرانية ويفسرونها بالعربية لأهل الإسلام فقال رسول الله صلى الله عليه وسلم \"لا تصدقوا أهل الكتاب ولا تكذبوهم وقولوا آمنا بالذي أنزل إلينا وما أنزل إليكم وإلهنا وإلهكم واحد ونحن له مسلمون\" وهذا الحديث تفرد به البخاري. وقال الإمام أحمد حدثنا عثمان بن عمرو أخبرنا يونس عن الزهري أخبرني ابن أبي نملة أن أبا نملة الأنصاري أخبره أنه بينا هو جالس عند رسول الله صلى الله عليه وسلم جاءه رجل من اليهود فقال يا محمد هل تتكلم هذه الجنازة فقال رسول الله صلى الله عليه وسلم \"الله أعلم\" قال اليهودي أنا أشهد أنها تتكلم فقال رسول الله صلى الله عليه وسلم \"إذا حدثكم أهل الكتاب فلا تصدقوهم ولا تكذبوهم وقولوا آمنا بالله وكتبه ورسله فإن كان حقا لم تكذبوهم وإن كان باطلا لم تصدقوهم\" \"قلت\" وأبو نملة هذا هو عمارة وقيل عمار وقيل عمرو بن معاذ بن زرارة الأنصاري رضي الله عنه ثم ليعلم أن أكثر ما يتحدثون به غالبه كذب وبهتان لأنه قد دخلت تحريف وتبديل وتغيير وتأويل وما أقل الصدق فيه ثم ما أقل فائدة كثير منه لو كان صحيحا. قال ابن جرير حدثنا ابن بشار حدثنا أبو عاصم أخبرنا سفيان عن سليمان بن عامر عن عمارة بن عمير عن حريث بن ظهير عن عبدالله - هو ابن مسعود- قال لا تسألوا أهل الكتاب عن شيء فإنهم لن يهدوكم وقد ضلوا إما أن تكذبوا بحق أو تصدقوا بباطل فإنه ليس أحد من أهل الكتاب إلا وفي قلبه تالية تدعوه إلى دينه كتالية المال وقال البخاري حدثنا موسى بن إسماعيل حدثنا إبراهيم بن سعد أخبرنا ابن شهاب عن عبدالله بن عبدالله عن ابن عباس قال: كيف تسألوا أهل الكتاب عن شيء وكتابكم الذي أنزل إليكم على رسول الله صلى الله عليه وسلم أحدث تقرءونه محضا لم يشب وقد حدثكم أن أهل الكتاب بدلوا وغيروا وكتبوا بأيديهم الكتاب وقالوا هو من عند الله ليشتروا به ثمنا قليلا؟ ألا ينهاكم ما جاءكم من العلم عن مسألتهم؟ لا والله ما رأينا منهم رجلا يسألكم عن الذي أنزل عليكم وقال البخاري وقال أبو اليمان أخبرنا شعيب عن الزهري أخبرني حميد بن عبدالرحمن أنه سمع معاوية يحدث رهطا من قريش بالمدينة وذكر كعب الأحبار فقال إن كان من أصدق هؤلاء المحدثين الذين يحدثون عن أهل الكتاب وإن كنا مع ذلك لنبلو عليه الكذب \"قلت\" معناه أنه يقع منه الكذب لغة من غير قصد لأنه يحدث عن صحف هو يحسن بها الظن وفيها أشياء موضوعة ومكذوبة لأنهم لم يكن في ملتهم حفاظ متقنون كهذه الأمة العظيمة ومع ذلك وقرب العهد وضعت أحاديث كثيرة في هذه الأمة لا يعلمها إلا الله عز وجل ومن منحه الله تعالى علما بذلك كل بحسبه ولله الحمد والمنة."
    },
    {
      "ayah": 47,
      "surah": 29,
      "text": "قال ابن جرير يقول الله تعالى كما أنزلنا الكتاب على من قبلك يا محمد من الرسل كذلك أنزلنا إليك هذا الكتاب وهذا الذي قاله حسن ومناسبته وارتباطه جيد وقوله تعالى \"الذين آتيناهم الكتاب يؤمنون به\" أي الذين أخذوه فتلوه حق تلاوته من أحبارهم العلماء الأذكياء كعبدالله بن سلام وسلمان الفارسي وأشباههما وقوله تعالى \"ومن هؤلاء من يؤمن به\" يعني العرب من قريش وغيرهم \"وما يجحد بآياتنا إلا الكافرون\" أي ما يكذب بها ويجحد حقها إلا من يستر الحق بالباطل. ويغطي ضوء الشمس بالوصائل وهيهـات."
    },
    {
      "ayah": 48,
      "surah": 29,
      "text": "ثم قال تعالى \"وما كنت تتلوا من قبله من كتاب ولا تخطه بيمينك\" أي قد لبثت في قومك يا محمد من قبل أن تأتي بهذا القرآن عمرا لا تقرأ كتابا ولا تحسن الكتابة بل كل أحد من قومك وغيرهم يعرف أنك رجل أمي لا تقرأ ولا تكتب وهكذا صفته في الكتب المتقدمة كما قال تعالى \"الذين يتبعون الرسول النبي الأمي الذي يجدونه مكتوبا عندهم في التوراة والإنجيل يأمرهم بالمعروف وينهاهم عن المنكر\" الآية وهكذا كان رسول الله صلى الله عليه وسلم دائما إلى يوم الدين لا يحسن الكتابة ولا يخط سطرا ولا حرفا بيده بل كان له كتاب يكتبون بين يده الوحي والرسائل إلى الأقاليم. ومن زعم من متأخري الفقهاء كالقاضي أبي الوليد الباجي ومن تابعه أنه عليه السلام كتب يوم الحديبية: هذا ما قاضى عليه محمد بن عبدالله. فإنما حمله على ذلك رواية في صحيح البخاري: ثم أخذ فكتب. وهذه محمولة على الرواية الأخرى: ثم أمر فكتب. ولهذا اشتد النكير من فقهاء المشرق والمغرب على من قال يقول الباجي وتبرؤا منه وأنشدوا في ذلك أقوالا وخطبوا به في محافلهم. وإنما أراد الرجل - أعني الباجي - فيما يظهر عنه أنه كتب ذلك على وجه المعجزة لا أنه كان يحسن الكتابة كما قال رسول الله صلى الله عليه وسلم إخبارا عن الدجال \"مكتوب بين عينيه كافر\" وفي رواية \"ك ف ر يقرؤها كل مؤمن\" وما أورده بعضهم من الحديث أنه لم يمت صلى الله عليه وسلم حتى تعلم الكتابة فضعيف لا أصل له قال الله تعالى \"وما كنت تتلو\" أي تقرأ \"من قبله من كتاب\" لتأكيد النفي \"ولا تخطه بيمينك\" تأكيد أيضا وخرج مخرج الغالب كقوله تعالى \"ولا طائر يطير بجناحيه\" وقوله تعالى \"إذا لارتات المبطلون\" أي لو كنت تحسنها لارتاب بعض الجهلة من الناس فيقول إنما تعلم هذا من كتب قبله مأثورة عن الأنبياء مع أنهم قالوا ذلك مع علمهم بأنه أمي لا يحسن الكتابة \"وقالوا أساطير الأولين اكتتبها فهي تملى عليه بكرة وأصيلا\"."
    },
    {
      "ayah": 49,
      "surah": 29,
      "text": "قال الله تعالى \"قال أنزله الذي يعلم السر في السماوات والأرض\" الآية وقال ههنا \"بل هو آيات بينات في صدور الذين أوتوا العلم\" أي هذا القرآن آيات بينة واضحة في الدلالة على الحق أمرا ونهيا وخبرا يحفظه العلماء يسره الله عليهم حفظا وتلاوة وتفسيرا كما قال تعالى \"ولقد يسرنا القرآن للذكر فهل من مدكر\" وقال رسول الله صلى الله عليه وسلم \"ما من نبي إلا وقد أعطي ما آمن على مثله البشر وإنما كان الذي أوتيته وحيا أوحاه الله إلي فأرجو أن أكون أكثرهم تابعا\" وفي حديث عياض بن حماد في صحيح مسلم يقول الله تعالى \"إني مبتليك ومبتل بك ومنزل عليك كتابا لا يغسله الماء تقرؤه نائما ويقظانا\" أي لو غسل الماء المحل المكتوب فيه لما احتيج إلى ذلك المحل لأنه قد جاء في الحديث الآخر \"لو كان القرآن في إهاب ما أحرقته النار\" ولأنه محفوظ في الصدور ميسر على الألسنة مهيمن على القلوب معجز لفظا ومعنى ولهذا جاء في الكتب المقدسة صفة هذه الأمة أناجيلهم في صدورهم واختار ابن جرير أن المعنى في قوله تعالى \"بل هو آيات بينات في صدور الذين أوتوا العلم\" بل العلم بأنك ما كنت تتلو من قبل هذا الكتاب كتابا ولا تخطه بيمينك آيات بينات في صدور الذين أوتوا العلم من أهل الكتاب ونقله عن قتادة وابن جريج وحكى الأول عن الحسن البصري فقط قلت وهو الذي رواه العوفي عن ابن عباس وقاله الضحاك وهو الأظهر والله أعلم وقوله تعالى \"وما يجحد بآياتنا إلا الظالمون\" أي ما يكذب بها ويبخس حقها ويردها إلا الظالمون أي المعتدون المكابرون الذين يعلمون الحق ويحيدون عنه كما قال تعالى \"إن الذين حقت عليهم كلمة ربك لا يؤمنون ولو جاءتهم كل آية حتى يروا العذاب الأليم\"."
    },
    {
      "ayah": 5,
      "surah": 29,
      "text": "يقول تعالى \"من كان يرجو لقاء الله\" أي في الدار الآخرة وعمل الصالحات ورجا ما عند الله من الثواب الجزيل فإن الله سيحقق له رجاءه ويوفيه عمله كاملا موفرا فإن ذلك كائن لا محالة لأنه سميع الدعاء بصير بكل الكائنات ولهذا قال تعالى \"من كان يرجو لقاء الله فإن أجل الله لآت وهو السميع العليم\"."
    },
    {
      "ayah": 50,
      "surah": 29,
      "text": "يقول تعالى مخبرا عن المشركين في تعنتهم وطلبهم آيات يعنون ترشدهم إلى أن محمدا رسول الله كما أتى صالح بناقته قال الله تعالى قل يا محمد \"إنما الآيات عند الله\" أي إنما أمر ذلك إلى الله فإنه لو علم أنكم تهتدون لأجابكم إلى سؤالكم لأن هذا سهل عليه يسر لديه ولكنه يعلم منكم أنكم إنما قصدتم التعنت والامتحان فلا يجيبكم إلى ذلك كما قال تعالى \"وما منعنا أن نرسل بالآيات إلا أن كذب بها الأولون وآتينا ثمود الناقة مبصرة فظلموا بها\" وقوله: \"وإنما أنا نذير مبين\" أي إنما بعثت نذيرا لكم بين النذارة فعلي أن أبلغكم رسالة الله تعالى \"ومن يهد الله فهو المهتد ومن يضلل فلن تجد له وليا مرشدا\" وقال تعالى: \"ليس عليك هداهم ولكن الله يهدي من يشاء\"."
    },
    {
      "ayah": 51,
      "surah": 29,
      "text": "ثم قال تعالى مبينا كثرة جهلهم وسخافة عقلهم حيث طلبوا آيات تدلهم على صدق محمد صلى الله عليه وسلم فيما جاءهم وقد جاءهم بالكتاب العزيز الذي لا يأتيه الباطل من بين يديه ولا من خلفه الذى هو أعظم من كل معجزة إذ عجزت الفصحاء والبلغاء عن معارضته بل عن معارضة عشر سور من مثله بل عن معارضة سورة منه فقال تعالى: \"أو لم يكفهم أنا أنزلنا عليك الكتاب يتلى عليهم\" أي أولم يكفهم آية أنا أنزلنا عليك الكتاب العظيم الذي فيه خبر ما قبلهم ونبأ ما بعدهم وحكم ما بينهم وأنت رجل أمي لا تقرأ ولا تكتب ولم تخالط أحدا من أهل الكتاب فجئتهم بأخبار ما في الصحف الأولى ببيان الصواب مما اختلفوا فيه وبالحق الواضح البين الجلي كما قال تعالى \"أو لم يكن لهم آية أن يعلمه علماء بني إسرائيل\" وقال تعالى \"وقالوا لولا أنزل عليه آية من ربه أو لم تأتهم بينة ما في الصحف الأولى\" وقال الإمام أحمد حدثنا حجاح حدثنا ليث حدثني سعيد بن أبي سعيد عن أبيه عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم \"ما من الأنبياء من نبي إلا قد أعطي من الآيات ما مثله آمن عليه البشر وإنما كان الذي أوتيته وحيا أوحاه الله إلي فأرجو أن أكون تابعا يوم القيامة\" أخرجاه من حديث الليث. وقد قال الله تعالى \"إن في ذلك لرحمة وذكرى لقوم يؤمنون\" أي إن في هذا القرآن لرحمة أي بيانا للحق وإزاحة للباطل وذكرى بما فيه حلول النقمات ونزول العقاب بالمكذبين والعاصين لقوم يؤمنون."
    },
    {
      "ayah": 52,
      "surah": 29,
      "text": "ثم قال تعالى: \"قل كفى بالله بيني وبينكم شهيدا\" أي هو أعلم بما تفيضون فيه من التكذيب ويعلم ما أقول لكم من إخباري عنه بأنه أرسلني فلو كنت كاذبا عليه لانتقم مني كما قال تعالى: \"ولو تقول علينا بعض الأقاويل لأخذنا منه باليمين ثم لقطعنا منه الوتين فما منكم من أحد عنه حاجزين\" وإنما أنا صادق عليه فيما أخبرتكم به ولهذا أيدني بالمعجزات الواضحات والدلائل القاطعات \"يعلم ما في السموات والأرض\" أي لا تخفى عليه خافية \"والذين آمنوا بالباطل وكفروا بالله أولئك هم الخاسرون\" أي يوم القيامة سيجزيهم على ما فعلوا ويقابلهم على ما صنعوا في تكذيبهم بالحق واتباعهم الباطل كذبوا برسل الله مع قيام الأدلة على صدقهم وآمنوا بالطواغيت والأوثان بلا دليل فسيجزيهم على ذلك إنه حكيم عليم."
    },
    {
      "ayah": 53,
      "surah": 29,
      "text": "يقول تعالى: مخبرا عن جهل المشركين في استعجالهم عذاب الله أن يقع بهم وبأس الله أن يحل عليهم كما قال تعالى \"وإذ قالوا اللهم إن كان هذا هو الحق من عندك فأمطر علينا حجارة من السماء أو ائتنا بعذاب أليم\" وقال ههنا \"ويستعجلونك بالعذاب ولولا أجل مسمى لجاءهم العذاب\" أي لولا ما حتم الله من تأخير العذاب إلى يوم القيامة لجاءهم العذاب قريبا سريعا كما استعجلوه ثم قال \"وليأتينهم بغتة\" أي فجأة\"وهم لا يشعرون \"."
    },
    {
      "ayah": 54,
      "surah": 29,
      "text": "أي يستعجلون العذاب وهو واقع بهـم لا محالة قال شعبة عن سماك عن عكرمة قال في قوله \"وإن جهنم لمحيطة بالكافرين\" قال البحر وقال ابن أبي حاتم حدثنا علي بن الحسين. حدثنا عمر بن إسماعيل بن مجالد حدثنا أبي عن مجاهد عن الشعبي أنه سمع ابن عباس يقول \"وإن جهنم لمحيطة بالكافرين\" وجهنم هو هذا البحر الأخضر تنتثر الكواكب فيه وتكور فيه الشمس و القمر ثم يوقد فيكون هو جهنم وقال الإمام أحمد حدثنا أبو عاصم أخبرنا عبدالله بن أمية حدثني محمد بن حيي أخبرني صفوان بن يعلى عن أبيه أن النبي صلى الله عليه وسلم قال \"البحر هو جهنم\" قالوا ليعلى فقال: ألا ترون أن الله تعالى يقول \"نارا أحاط بهم سرادقها\" قال لا والذى نفس يعلى بيده لا أدخلها أبدا حتى أعرض على الله ولا يصيبني منها قطرة حتى أعرض على الله تعالى هذا تفسير غريب وحديث غريب جدا والله أعلم."
    },
    {
      "ayah": 55,
      "surah": 29,
      "text": "ثم قال عزوجل \"يوم يغشاهم العذاب من فوقهم ومن تحت أرجلهم\" كقوله تعالى \"لهم من جهنم مهاد ومن فوقهم غواش\" وقال تعالى \"لهم من فوقهم ظلل من النار ومن تحتهم ظلل\" وقال تعالى \"لو يعلم الذين كفروا حين لا يكفون عن وجوههم النار ولا عن ظهورهم\" الآية فالنار تغشاهم من سائر جهاتهم وهذا أبلغ في العذاب الحسي وقوله تعالى \"ونقول ذوقوا ما كنتم تعملون\" تهديد وتقريع وتوبيخ وهذا عذاب معنوي على النفوس كقوله تعالى: \"يوم يسحبون في النار على وجوههم ذوقوا مس سقر إنا كل شيء خلقناه بقدر\" وقال تعالى \"يوم يدعون إلى نار جهنم دعا هذه النار التى كنتم به تكذبون أفسحر هذا أم أنتم لا تبصرون اصلوها فاصبروا أو لا تصبروا سواء عليكم إنما تجزون ما كنتم تعملون\"."
    },
    {
      "ayah": 56,
      "surah": 29,
      "text": "هذا أمر من الله تعالى لعباده المؤمنين بالهجرة من البلد الذي لا يقدرون فيه على إقامة الدين إلى أرض الله الواسعة حيث يمكن إقامة الدين بأن يوحدوا الله ويعبدوه كما أمرهم ولهذا قال تعالى: \"يا عبادى الذين آمنوا إن أرضي واسعة فإياى فاعبدون\" قال الإمام أحمد حدثنا يزيد بن عبدربه حدثنا بقية بن الوليد حدثني جبير بن عمرو القرشي حدثني أبو سعد الأنصاري عن أبي بحر مولى الزبير بن العوام عن الزبير بن العوام قال: قال رسول الله صلى الله عليه وسلم \"البلاد بلاد الله والعباد عباد الله فحيثما أصبت خيرا فأقم\" ولهذا لما ضاق على المستضعفين بمكة مقامهم بها خرجوا مهاجرين إلى أرض الحبشة ليأمنوا على دينهم هناك فوجدوا خير المنزلين هناك أصحمة النجاشي ملك الحبشة رحمه الله تعالى فأواهم وأيدهم بنصره وجعلهم سيوما ببلاده ثم بعد ذلك هاجر رسول الله صلى الله عليه وسلم والصحابة الباقون إلى المدينة النبوية يثرب المطهرة."
    },
    {
      "ayah": 57,
      "surah": 29,
      "text": "ثم قال تعالى: \"كل نفس ذائقة الموت ثم إلينا ترجعون\" أي أينما كنتم يدرككم الموت فكونوا في طاعة الله وحيث أمركم الله فهو خير لكم فإن الموت لابد منه ولا محيد عنه ثم إلى الله المرجع والمآب فمن كان مطيعا له جازاه أفضل الجزاء ووافاه أتم الثواب."
    },
    {
      "ayah": 58,
      "surah": 29,
      "text": "ولهذا قال تعالى: \"والذين امنوا وعملوا الصالحات لنبوأنهم من الجنة غرفا تجري من تحتها الأنهار\" أي لنسكننهم منازل عالية في الجنة تجري من تحتها الأنهار على اختلاف أصنافها من ماء وخمر وعسل ولبن يصرفونها ويجرونها حيث شاءوا \"خالدين فيها\" أي ماكثين فيها أبدا لا يبغون عنها حولا \"نعم أجر العاملين\" نعمت هذه الغرف أجرا على أعمال المؤمنين."
    },
    {
      "ayah": 59,
      "surah": 29,
      "text": "\"والذين صبروا\" أي على دينهم وهاجروا إلى الله ونابذوا الأعداء وفارقوا الأهل والأقرباء ابتغاء وجه الله ورجاء ما عنده وتصديق موعوده قال ابن أبي حاتم رحمه الله حدثنا أبي أخبرنا صفوان المؤذن أخبرنا الوليد بن مسلم أخبرنا معاوية بن سلام عن أخيه زيد بن سلام عن جده أبي سلام الأسود حدثني أبو معاوية الأشعري أن أبا مالك الأشعري حدثه أن رسول الله صلى الله عليه وسلم حدثه أن في الجنة غرفا يرى ظاهرها من باطنها وباطنها من ظاهرها أعدها الله تعالى لمن أطعم الطعام وأطاب الكلام وتابع الصلاة والصيام وقام بالليل والناس نيام \"وعلى ربهم يتوكلون\" في أحوالهم كلها في دينهم ودنياهم."
    },
    {
      "ayah": 6,
      "surah": 29,
      "text": "وقوله تعالى: \"ومن جاهد فإنما يجاهد لنفسه\" كقوله تعالى: \"من عمل صالحا فلنفسه\" أي من عمل صالحا فإنما يعود نفع عمله على نفسه فإن الله تعالى غني عن أفعال العباد ولو كانوا كلهم على أتقى قلب رجل منهم ما زاد ذلك في ملكه شيئا. ولهذا قال تعالى: \"ومن جاهد فإنما يجاهد لنفسه إن الله لغني عن العالمين\" قال الحسن البصري: إن الرجل ليجاهد وما ضرب يوم من الدهر بسيف."
    },
    {
      "ayah": 60,
      "surah": 29,
      "text": "ثم أخبرهم تعالى أن الرزق لا يختص ببقعة بل رزقه تعالى عام لخلقه حيث كانوا وأين كانوا بل كانت أرزاق المهاجرين حيث هاجروا أكثر وأوسع وأطيب فإنهم بعد قليل صاروا حكام البلاد في سائر الأقطار والأمصار ولهذا قال تعالى \"وكأين من دابة لا تحمل رزقها\" أي لا تطيق جمعه وتحصيله ولا تدخر شيئا لغد \"الله يرزقها وإياكم\" أي يقيض لها رزقها على ضعفها وييسره عليها فيبعث إلى كل مخلوق من الرزق ما يصلحه حتى الذر في قرار الأرض والطير في الهواء والحيتان في الماء. قال تعالى \"وما من دابة في الأرض إلا على الله رزقها ويعلم مستقرها ومستودعها كل في كتاب مبين\" وقال ابن أبي حاتم حدثنا محمد بن عبدالرحمن الهروي حدثنا يزيد يعني ابن هارون حدثنا الجراح بن منهال الجزري - هو أبو العطوف - عن الزهري عن رجل عن ابن عمر قال: خرجت مع رسول الله صلى الله عليه وسلم حتى دخل بعض حيطان المدينة فجعل يلتقط من التمر ويأكل فقال لي \"يا ابن عمر مالك لا تأكل؟\" قال قلت لا أشتهيه يا رسول الله قال \"لكني أشتهيه وهذا صبح رابعة منذ لم أذق طعاما ولم أجده ولو شئت لدعوت ربي فأعطاني مثل ملك كسرى وقيصر فكيف بك يا ابن عمر إذا بقيت في قوم يخبئون رزق سنتهم بضعف اليقين؟\" قال فوالله ما برحنا ولا رمنا حتى نزلت \"وكأين من دابة لا تحمل رزقها الله يرزقها وإياكم وهو السميع العليم\" فقال رسول الله صلى الله عليه وسلم \"إن الله عز وجل لم يأمرني بكنز الدنيا ولا باتباع الشهوات فمن كنز دنياه يريد بها حياة باقية فإن الحياة بيد الله ألا وإني لا أكنز دينارا ولا درهما ولا أخبأ رزقا لغد\" هذا حديث غريب وأبو العطوف الجزري ضعيف وقد ذكروا أن الغراب إذا فقس عن فراخه البيض خرجوا وهم بيض فإذا رآهم أبواهم كذلك نفرا عنهم أياما حتى يسود الريش فيظل الفرخ فاتحا فاه يتفقد أبويه فيقيض الله تعالى طيرا صغارا كالبرغش فيغشاه فيتقوت به تلك الأيام حتى يسود ريشه والأبوان يتفقدانه كل وقت فكلما رأوه أبيض الريش نفرا عنه فإذا رأوه اسود ريشه عطفا عليه بالحضانة والرزق ولهذا قال الشاعر. يا رازق النعاب في عشه وجابر العظم الكسير المهيض وقد قال الشافعي في جملة كلام له في الأوامر كقول النبي صلى الله عليه وسلم \"سافروا تصحوا وترزقوا\" قال البيهقي أخبرنا إملاء أبو الحسن علي بن أحمد بن عبدان أخبرنا أحمد بن عبيد أخبرنا محمد بن غالب حدثني محمد بن سنان أخبرنا محمد بن عبدالرحمن بن يزداد شيخ من أهل المدينة حدثنا عبدالله بن دينار عن ابن عمر قال: قال رسول الله صلى الله عليه وسلم \"سافروا تصحوا وتغنموا\" قال ورويناه عن ابن عباس وقال الإمام أحمد حدثنا قبيصة أخبرنا ابن لهيعة عن دراج عن عبد الرحمن بن حجير عن أبي هريرة قال: قال رسول الله صلى الله عليه وسلم \"سافروا تربحوا وصوموا تصحوا واغزوا تغنموا\" وقد ورد مثل حديث ابن عمر عن ابن عباس مرفوعا وعن معاذ بن جبل موقوفا وفي لفظ \"سافروا مع ذوي الجد والميسرة\" قال ورويناه عن ابن عباس وقوله \"وهوالسميع العليم\" أي السميع لأقوال عباده العليم بحركاتهم وسكناتهم."
    },
    {
      "ayah": 61,
      "surah": 29,
      "text": "يقول تعالى مقررا أنه لا إله إلا هو لأن المشركين الذين يعبدون معه غير معترفون بأنه المستقل بخلق السماوات والأرض والشمس والقمر وتسخير الليل والنهار وأنه الخالق الرازق لعباده ومقدر آجالهم واختلافها واختلاف أرزاقهم. فتفاوت بينهم فمنهم الغني والفقير وهوالعليم بما يصلح كلا منهم ومن يستحق الغنى ممن يستحق الفقر فذكر أنه المستقل بخلق الأشياء المنفرد بتدبيرها فإذا كان الأمر كذلك فلم يعبد غيره؟ ولم يتوكل على غيره؟ فكما أنه الواحد في ملكه فليكن الواحد في عبادته وكثيرا ما يقرر تعالى مقام الإلهية بالاعتراف بتوحيد الربوبية وقد كان المشركون يعترفون بذلك كما كانوا يقولون في تلبيتهم لبيك لا شريك لك إلا شريكا هو لك تملكه وما ملك."
    },
    {
      "ayah": 62,
      "surah": 29,
      "text": "يقول تعالى مقررا أنه لا إله إلا هو لأن المشركين الذين يعبدون معه غير معترفون بأنه المستقل بخلق السموات والأرض والشمس والقمر وتسخير الليل والنهار وأنه الخالق الرازق لعباده ومقدر آجالهم واختلافها واختلاف أرزاقهم. فتفاوت بينهم فمنهم الغني والفقير وهوالعليم بما يصلح كلا منهم ومن يستحق الغنى ممن يستحق الفقر فذكر أنه المستقل بخلق الأشياء المنفرد بتدبيرها فإذا كان الأمر كذلك فلم يعبد غيره؟ ولم يتوكل على غيره؟ فكما أنه الواحد في ملكه فليكن الواحد في عبادته وكثيرا ما يقرر تعالى مقام الإلهية بالاعتراف بتوحيد الربوبية وقد كان المشركون يعترفون بذلك كما كانوا يقولون في تلبيتهم لبيك لا شريك لك إلا شريكا هو لك تملكه وما ملك."
    },
    {
      "ayah": 63,
      "surah": 29,
      "text": "يقول تعالى مقررا أنه لا إله إلا هو لأن المشركين الذين يعبدون معه غير معترفون بأنه المستقل بخلق السموات والأرض والشمس والقمر وتسخير الليل والنهار وأنه الخالق الرازق لعباده ومقدر آجالهم واختلافها واختلاف أرزاقهم. فتفاوت بينهم فمنهم الغني والفقير وهوالعليم بما يصلح كلا منهم ومن يستحق الغنى ممن يستحق الفقر فذكر أنه المستقل بخلق الأشياء المنفرد بتدبيرها فإذا كان الأمر كذلك فلم يعبد غيره؟ ولم يتوكل على غيره؟ فكما أنه الواحد في ملكه فليكن الواحد في عبادته وكثيرا ما يقرر تعالى مقام الإلهية بالاعتراف بتوحيد الربوبية وقد كان المشركون يعترفون بذلك كما كانوا يقولون في تلبيتهم لبيك لا شريك لك إلا شريكا هو لك تملكه وما ملك."
    },
    {
      "ayah": 64,
      "surah": 29,
      "text": "يقول تعالى مقررا أنه لا إله إلا هو لأن المشركين الذين يعبدون معه غيره معترفون بأنه المستقل بخلق السموات والأرض الحيوان\" أي الحياة الدائمة الحق الذي لا زوال له ولا انقضاء بل هي مستمرة أبد الآباد وقوله تعالى \"لو كانوا يعلمون\" أي لآثروا ما يبقى على ما يفنى."
    },
    {
      "ayah": 65,
      "surah": 29,
      "text": "ثم أخبر تعالى عن المشركين أنهم عند الاضطرار يدعونه وحده لا شريك له فهلا يكون هذا منهم دائما \"فإذا ركبوا في الفلك دعوا الله مخلصين له الدين\" كقوله تعالى \"وإذا مسكم الضر في البحر ضل من تدعون إلا إياه فلما نجاكم إلى البر أعرضتم\" الآية وقال ههنا \"فلما نجاهم إلى البر إذا هم يشركون\" وقد ذكر محمد بن إسحاق عن عكرمة بن أبي جهل أنه لما فتح رسول الله صلى الله عليه وسلم مكة ذهب فارا منها فلما ركب في البحر ليذهب إلى الحبشة اضطربت بهم السفينة فقال أهلها يا قوم أخلصوا لربكم الدعاء فإنه لا ينجي ههنا إلا هو فقال عكرمة والله لئن كان لاينجي في البحر غيره فإنه لاينجي في البر أيضا غيره اللهم لك علي عهد لئن خرجت لأذهبن فلأضعن يدي في يد محمد فلأجدنه رؤوفا رحيما فكان كذلك."
    },
    {
      "ayah": 66,
      "surah": 29,
      "text": "وقوله تعالى \"ليكفروا بما آتيناهم وليتمتعوا\" هذه اللام يسميها كثير من أهل العربية والتفسير وعلماء الأصول لام العاقبة لأنهم لا يقصدون ذلك ولا شك أنها كذلك بالنسبة إليهم وأما بالنسبة إلى تقدير الله عليهم ذلك وتقييضه إياهم لذلك فهي لام التعليل وقد قدمنا تقرير ذلك في قوله \"ليكون لهم عدوا وحزنا\"."
    },
    {
      "ayah": 67,
      "surah": 29,
      "text": "يقول تعالى ممتنا على قريش فيما أحلهم من حرمه الذي جعله للناس سواء العاكف فيه والباد ومن دخله كان آمنا فهم في أمن عظيم والأعراب حوله ينهب بعضهم بعضا ويقتل بعضهم بعضا كما قال تعالى \"لإيلاف قريش\" إلى آخر السورة. وقوله تعالى \"أفبالباطل يؤمنون وبنعمة الله يكفرون\" أي أفكان شكرهم على هذه النعمة العظيمة أن أشركوا به وعبدوا معه غيره من الأصنام والأنداد و \"بدلوا نعمة الله كفرا وأحلوا قومهم دار البوار\" فكفروا بنبي الله وعبده ورسوله فكان اللائق بهم إخلاص العبادة لله وأن لا يشركوا به وتصديق الرسول وتعظيمه وتوقيره فكذبوه فقاتلوه فأخرجوه من بين ظهرهم ولهذا سلبهم الله تعالى ما كان أنعم به عليهم وقتل من قتل منهم ببدر ثم صارت الدولة لله ولرسوله وللمؤمنين ففتح الله على رسوله مكة وأرغم آنافهم وأذل رقابهم."
    },
    {
      "ayah": 68,
      "surah": 29,
      "text": "ثم قال تعالى \"ومن أظلم ممن افترى على الله كذبا أو كذب بالحق لما جاءه\" أي لا أحد أشد عقوبة ممن كذب على الله فقال إن الله أوحى إليه ولم يوح اليه شيء. ومن قال سأنزل مثل ما أنزل الله وهكذا لا أحد أشد عقوبة ممن كذب بالحق لما جاءه فالأول مفتر والثاني مكذب ولهذا قال تعالى \"أليس في جهنم مثوى للكافرين\"."
    },
    {
      "ayah": 69,
      "surah": 29,
      "text": "ثم قال تعالى \"والذين جاهدوا فينا\" يعني الرسول صلى الله عليه وسلم وأصحابه وأتباعه إلى يوم الدين \"لنهدينهم سبلنا\" أي لنبصرنهم سبلنا أي طرقنا في الدنيا والآخرة. قال ابن أبي حاتم حدثنا أبي حدثنا أحمد بن أبي الحواري أخبرنا عباس الهمداني أبو أحمد من أهل عكا في قول الله تعالى \"والذين جاهدوا فينا لنهدينهم سبلنا وإن الله لمع المحسنين\" قال الذين يعملون بما يعلمون يهديهم الله لما لا يعلمون قال أحمد بن أبي الحواري فحدثت به أبا سليمان يعني الداراني فأعجبه وقال ليس ينبغي لمن ألهم شيئا من الخير أن يعمل به حتى يسمعه في الأثر فإذا سمعه في الأثر عمل به وحمد الله حتى وافق ما في قلبه. وقوله \"وإن الله لمع المحسنين\" قال ابن أبي حاتم حدثنا أبي حدثنا عيسى بن جعفر قاضي الري حدثنا أبو جعفر الرازي عن المغيرة عن الشعبي قال: قال عيسى ابن مريم عليه السلام إنما الإحسان أن تحسن إلى من أساء إليك ليس الإحسان أن تحسن إلى من أحسن إليك والله أعلم. آخر تفسير سورة. العنكبوت ولله الحمد والمنة."
    },
    {
      "ayah": 7,
      "surah": 29,
      "text": "ثم أخبر تعالى أنه مع غناه عن الخلائق جميعهم ومع بره وإحسانه بهم يجازي الذين آمنوا وعملوا الصالحات أحسن الجزاء وهو أنه يكفر عنهم أسوأ الذين عملوا ويجزيهم أجرهم بأحسن الذي كانوا يعملون فيقبل القليل من الحسنات ويثيب عليها الواحدة بعشر أمثالها إلى سبعمائة ضعف ويجزي على السيئة بمثلها أو يعفو ويصفح كما قال تعالى: \"إن الله لا يظلم مثقال ذرة وإن تك حسنة يضاعفها ويؤت من لدنه أجرا عظيما\" وقال ههنا: \"والذين آمنوا وعملوا الصالحات لنكفرن عنه سيئاتهم ولنجزينهم أحسن الذي كانوا يعملون\"."
    },
    {
      "ayah": 8,
      "surah": 29,
      "text": "يقول تعالى آمرا عباده بالإحسان إلى الوالدين بعد الحث على التمسك بتوحيده فإن الوالدين هما سبب وجود الإنسان ولهما عليه غاية الإحسان فالوالد بالإنفاق والوالدة بالإشفاق ولهذا قال تعالى: \"وقضى ربك ألا تعبدوا إلا إياه وبالوالدين إحسانا إما يبلغن عندك الكبر أحدهما أو كلاهما فلا تقل لهما أف ولا تنهرهما وقل لهما قولا كريما واخفض لهما جناج الذل من الرحمة وقل رب ارحمهما كما ربياني صغيرا\" ومع هذه الوصية بالرأفة والرحمة والإحسان إليهما في مقابلة إحسانهما المتقدم قال: \"وإن جاهداك لتشرك بي ما ليس لك به علم فلا تطعهما\" أي وإن حرصا عليك أن تتابعهما على دينهما إذا كانا مشركين فإياك وإياهما فلا تطعهما في ذلك فإن مرجعكم إلي يوم القيامة فأجزيك بإحسانك إليهما وصبرك على دينك وأحشرك مع الصالحين لا في زمرة والديك وإن كنت أقرب الناس إليهما في الدنيا فإن المرء إنما يحشر يوم القيامة مع من أحب أي حبا دينيا."
    },
    {
      "ayah": 9,
      "surah": 29,
      "text": "وقال الترمذي عند تفسير هذه الآية حدثنا محمد بن بشار ثنا محمد بن المثني حدثنا محمد بن جعفر حدثنا شعبة عن سماك بن حرب قال: سمعت مصعب بن سعد يحدث عن أبيه سعد قال نزلت في أربع آيات فذكر قصته وقال: قالت أم سعد أليس الله قد أمرك بالبر؟ والله لا أطعم طعاما ولا أشرب شرابا حتى أموت أو تكفر قال فكانوا إذا أرادوا أن يطعموها شجروا فاها فنزلت \"ووصينا الإنسان بوالديه حسنا وإن جاهداك لتشرك بي ما ليس لك به علم فلا تطعهما\" الآية وهذا الحديث رواه الإمام أحمد ومسلم وأبو داود والنسائي أيضا وقال الترمذي حسن صحيح."
    }
  ]
}
