{
  "ayahs": [
    {
      "ayah": 1,
      "surah": 30,
      "text": "قد اختلف المفسرون في الحروف المقطعة التي في أوائل السور فمنهم من قال هي مما استأثر الله بعلمه فردوا علمها إلى الله ولم يفسرها حكاه القرطبي في تفسـره عن أبي بكر وعمر وعثمان وعلي وابن مسعود رضي الله عنهم أجمعين وقاله عامر الشعبي وسفيان الثوري والربيع بن خيثم واختاره أبو حاتم بن حبان. ومنهم من فسرها واختلف هؤلاء في معناها فقال عبدالرحمن بن زيد بن أسلم إنما هي أسماء السور. قال العلامة أبو القاسم محمود بن عمر الزمخشري في تفسيره وعليه إطباق الأكثر ونقل عن سيبويه أنه نص عليه ويعتضد لهذا بما ورد في الصحيحين عن أبي هريرة أن رسول الله صلى الله عليه وسلم كان يقرأ في صلاة الصبح يوم الجمعة \"الم\" السجدة و \"هل أتى على الإنسان\" وقال سفيان الثوري عن ابن أبي نجيح عن مجاهد أنه قال: الم وحم والمص وص. فواتح افتتح الله بها القرآن وكذا قال غيره عن مجاهد وقال مجاهد في رواية أبي حذيفة موسى بن مسعود عن شبل عن ابن أبي نجيح عنه أنه قال الم اسم من أسماء القرآن وهكذا وقال قتادة وزيد بن أسلم ولعل هذا يرجع إلى معنى قول عبدالرحمن بن زيد بن أسلم أنه اسم من أسماء السور فإن كل سورة يطلق عليها اسم القرآن فإنه يبعد أن يكون المص اسما للقرآن كله لأن المتبادر إلى فهم سامع من يقول قرأت المص إنما ذلك عبارة عن سورة الأعراف لا لمجموع القرآن والله أعلم. وقيل هي اسم من أسماء الله تعالى فقال عنها في فواتح السور من أسماء الله تعالى وكذلك قال سالم بن عبدالله وإسماعيل بن عبدالرحمن السدي الكبير وقال شعبة عن السدي بلغني أن ابن عباس قال الم اسم من أسماء الله الأعظم. هكذا رواه ابن أبي حاتم من حديث شعبة ورواه ابن جرير عن بندار عن ابن مهدي عن شعبة قال سألت السدي عن حم وطس والم فقال قال ابن عباس هي اسم الله الأعظم وقال ابن جرير وحدثنا محمد بن المثنى حدثنا أبو النعمان حدثنا شعبة عن إسماعيل السدي عن مرة الهمذاني قال: قال عبدالله فذكر نحوه. وحُكي مثله عن علي وابن عباس وقال علي بن أبي طلحة عن ابن عباس هو قسم أقسم الله به وهو من أسماء الله تعالى وروى ابن أبي حاتم وابن جرير من حديث ابن علية عن خالد الحذاء عن عكرمة أنه قال الم قسم. وروينا أيضا من حديث شريك بن عبدالله بن عطاء بن السائب عن أبى الضحى عن ابن عباس: الم قال أنا الله أعلم وكذا قال سعيد بن جبير وقال السدي عن أبي مالك وعن أبي صالح عن ابن عباس وعن مرة الهمذاني عن ابن مسعود وعن ناس من أصحاب النبي صلى الله عليه وسلم الم قال أما الم فهي حروف استفتحت من حروف هجاء أسماء الله تعالى. قال وأبو جعفر الرازي عن الربيع بن أنس عن أبي العالية في قوله تعالى الم قال هذه الأحرف الثلاثة من التسعة والعشرين حرفا دارت فيها الألسن كلها ليس منها حرف إلا وهو مفتاح اسم من أسمائه وليس منها حرف إلا وهو من آلائه وبلألائه ليس منها حرف إلا وهو في مدة أقوام وآجالهم. قال عيسى ابن مريم عليه السلام وعجب: فقال أعجب أنهم يظنون بأسمائه ويعيشون في رزقه فكيف يكفرون به فالألف مفتاح الله واللام مفتاح اسمه لطيف والميم مفتاح اسمه مجيد فالألف آلاء الله واللام لطف الله والميم مجد الله والألف سنة واللام ثلاثون سنة والميم أربعون سنة. هذا لفظ ابن أبي حاتم ونحوه رواه ابن جرير ثم شرع يوجه كل واحد من هذه الأقوال ويوفق بينها وأنه لا منافاة بين كل واحد منها وبين الآخر وأن الجمع ممكن فهي أسماء للسور ومن أسماء الله تعالى يفتتح بها السور فكل حرف منها دل على اسم من أسمائه وصفة من صفاته كما افتتح سورا كثيرة بتحميده وتسبيحه وتعظيمه قال ولا مانع من دلالة الحرف منها على اسم من أسماء الله وعلى صفة من صفاته وعلى مدة وغير ذلك كما ذكره الربيع بن أنس عن أبي العالية لأن الكلمة الواحدة تطلق على معاني كثيرة كلفظة الأمة فإنها تطلق ويراد به الدين كقوله تعالى \"إنا وجدنا آباءنا على أمة\" وتطلق ويراد بها الرجل المطيع لله كقوله تعالى \"إن إبراهيم كان أمة قانتا لله حنيفا ولم يك من المشركين\" وتطلق ويراد بها الجماعة كقوله تعالى \"وجد عليه أمة من الناس يسقون\" وقوله تعالى \"ولقد بعثنا في كل أمة رسولا\" وتطلق ويراد بها الحين من الدهر كقوله تعالى \"وقال الذي نجا منهما وادكر بعد أمة\" أي بعد حين على أصح القولين قال فكذلك هذا. هذا حاصل كلامه موجها ولكن هذا ليس كما ذكره أبو العالية فإن أبا العالية زعم أن الحرف دل على هذا وعلى هذا وعلى هذا معا ولفظة الأمة وما أشبهها من الألفاظ المشتركة في الاصطلاح إنما دل في القرآن في كل موطن على معنى واحد دل عليه سياق الكلام فأما حمله على مجموع محامله إذا أمكن فمسألة مختلف فيها بين علماء الأصول ليس هذا موضع البحث فيها والله أعلم. ثم إن لفظة الأمة تدل على كل من معانيها في سياق الكلام بدلالة الوضع فأما دلالة الحرف الواحد على اسم يمكن أن يدل على اسم آخر من غير أن يكون أحدهما أولى من الآخر في التقدير أو الإضمار بوضع ولا بغيره فهذا مما لا يفهم إلا بتوقيف والمسألة مختلف فيها وليس فيها إجماع حتى يحكم به وما أنشدوه من الشواهد على صحة إطلاق الحرف الواحد على بقية الكلمة فإن في السياق ما يدل على ما حذف بخلاف هذا كما قال الشاعر: قلنا قفي لنا فقالت قاف لا تحسبي أنا نسينا الإيجاف تعني وقفت. وقال الآخر: ما للظليم عال كيف لايـ عينقد عنه جلده إذا يـ فقال ابن جرير كأنه أراد أن يقول إذا يفعل كذا وكذا فاكتفى بالياء من يفعل وقال الآخر: بالخير خيرات وإن شرا ف ولا أريد الشر إلا أن تـ يقول وإن شرا فشرا ولا أريد الشر إلا أن تشاء فاكتفى بالفاء والتاء من الكلمتين عن بقيتهما ولكن هذا ظاهر من سياق الكلام والله أعلم. قال القرطبي وفي الحديث \"من أعان على قتل مسلم بشطر كلمة\" الحديث قال سفيان هو أن يقول في اقتل\"ا قـ\" وقال خصيف عن مجاهد أنه قال فواتح السور كلها\"ق وص وحم وطسم والر\" وغير ذلك هجاء موضوع وقال بعض أهل العربية هي حروف من حروف المعجم استغنى بذكر ما ذكر منها في أوائل السور عن ذكر بواقيها التي هي تتمة الثمانية والعشرين حرفا كما يقول القائل ابني يكتب في - ا ب ت ث - أي في حروف المعجم الثمانية والعشرين فيستغني بذكر بعضها عن مجموعها حكاه ابن جرير. قلت مجموع الحروف المذكورة في أوائل السور بحذف المكرر منها أربعة عشر حرفا وهي - ال م ص ر ك ه ي ع ط س ح ق ن- يجمعها قولك: نص حكيم قاطع له سر. وهي نصف الحروف عددا والمذكور منها أشرف من المتروك وبيان ذلك من صناعة التصريف. قال الزمخشري وهذه الحروف الأربعة عشر مشتملة على أصناف أجناس الحروف يعني من المهموسة والمجهورة ومن الرخوة والشديدة ومن المطبقة والمفتوحة ومن المستعلية والمنخفضة ومن حروف القلقلة. وقد سردها مفصلة ثم قال: فسبحان الذي دقت في كل شيء حكمته. وهذه الأجناس المعدودة مكثورة بالمذكورة منها وقد علمت أن معظم الشيء وجله ينزل منزلة كله وههنا ههنا لخص بعضهم في هذا المقام كلاما فقال: لا شك أن هذه الحروف لم ينزلها سبحانه وتعالى عبثا ولا سدى ومن قال من الجهلة إن في القرآن ما هو تعبد لا معنى له بالكلمة فقد أخطأ خطأ كبيرا فتعين أن لها معنى في نفس الأمر فإن صح لنا فيها عن المعصوم شيء قلنا به وإلا وقفنا حيث وقفنا وقلنا \"آمنا به كل من عند ربنا\" ولم يجمع العلماء فيها على شيء معين وإنما اختلفوا فمن ظهر له بعض الأقوال بدليل فعليه اتباعه وإلا فالوقف حتى يتبين هذا المقام. المقام الآخر في الحكمة التي اقتضت إيراد هذه الحروف في أوائل السور ما هي مع قطع النظر عن معانيها في أنفسها فقال بعضهم إنما ذكرت ليعرف بها أوائل السور حكاه ابن جرير وهذا ضعيف لأن الفصل حاصل بدونها فيما لم تذكر فيه وفيما ذكرت فيه البسملة تلاوة وكتابة وقال آخرون بل ابتدئ بها لتفتح لاستماعها أسماع المشركين إذ تواصوا بالإعراض عن القرآن حتى إذا استمعوا له تلا عليهم المؤلف منه حكاه ابن جرير أيضا وهو ضعيف أيضا لأنه لو كان كذلك لكان ذلك في جميع السور لا يكون في بعضها بل غالبها ليس كذلك ولو كـان كذلك أيضا لانبغى الابتداء بها في أوائل الكلام معهم سواء كان افتتاح سورة أو غير ذلك ثم إن هذه السورة والتي تليها أعني البقرة وآل عمران مدنيتان ليستا خطابا للمشركين فانتقض ما ذكروه بهذه الوجوه. وقال آخرون بل إنما ذكرت هذه الحروف في أوائل السور التي ذكرت فيها بيانا لإعجاز القرآن وأن الخلق عاجزون عن معارضته بمثله هذا مع أنه مركب من هذه الحروف المقطعة التي يتخاطبون بها وقد حكى هذا المذهب الرازي في تفسيره عن المبرد وجمع من المحققين وحكى القرطبي عن الفراء وقطرب نحو هذا وقرره الزمخشري فى كشافه ونصره أتم نصر وإليه ذهب الشيخ الإمام العلامة أبو العباس ابن تيمية وشيخنا الحافظ المجتهد أبو الحجاج المزي وحكاه لي عن ابن تيمية. قال الزمخشري ولم ترد كلها مجموعة في أول القرآن وإنما كررت ليكون أبلغ في التحدي والتبكيت كما كررت قصص كثيرة وكرر التحدي بالصريح في أماكن قال وجاء منها على حرف واحد كقوله - ص ن ق- وحرفين مثل \"حم\" وثلاثة مثل \"الم\" وأربعة مثل \"المر\" و \"المص\" وخمسة مثل \"كهيعص- و- حم عسق\" لأن أساليب كلامهم على هذا من الكلمات ما هو على حرف وعلى حرفين وعلى ثلاثة وعلى أربعة وعلى خمسة لا أكثر من ذلك \"قلت\" ولهذا كل سورة افتتحت بالحروف فلا بد أن يذكر فيها الانتصار للقرآن وبيان إعجازه وعظمته وهذا معلوم بالاستقراء وهو الواقع في تسع وعشرين سورة ولهذا يقول تعالى \"الم ذلك الكتاب لا ريب فيه\" \"الم الله لا إله إلا هو الحي القيوم نزل عليك الكتاب بالحق مصدقا لما بين يديه\" \"المص كتاب أنزل إليك فلا يكن في صدرك حرج منه\" \"الر كتاب أنزلناه إليك لتخرج الناس من الظلمات إلى النور بإذن ربهم\" \"الم تنزيل الكتاب لا ريب فيه من رب العالمين\" \"حم تنزيل من الرحمن الرحيم\" \"حم عسق كذلك يوحي إليك وإلى الذين من قبلك الله العزيز الحكيم\" وغير ذلك من الآيات الدالة على صحة ما ذهب إليه هؤلاء لمن أمعن النظر والله أعلم. وأما من زعم أنها دالة على معرفة المدد وأنه يستخرج من ذلك أوقات الحوادث والفتن والملاحم فقد ادعى ما ليس له وطار في غير مطاره وقد ورد في ذلك حديث ضعيف وهو مع ذلك أدل على بطلان هذا المسلك من التمسك به على صحته وهو ما رواه محمد بن إسحق بن يسار صاحب المغازي حدثني الكلبي عن أبي صالح عن ابن عباس عن جابر بن عبدالله بن رباب قال مر أبو ياسر بن أخطب في رجال من يهود برسول الله صلى الله عليه وسلم وهو يتلو فاتحة سورة البقرة \"الم ذلك الكتاب لا ريب فيه\" فأتى أخاه بن أخطب في رجال من اليهود فقال تعلمون والله لقد سمعت محمدا يتلو فيما أنزل الله تعالى عليه \"الم ذلك الكتاب لا ريب فيه\" فقال أنت سمعته قال نعم قال فمشى حي بن أخطب في أولئك النفر من اليهود إلى رسول الله صلى الله عليه وسلم فقالوا يا محمد ألم يذكر أنك تتلوا فيما أنزل الله عليك \"الم ذلك الكتاب\"؟ فقال رسول الله صلى الله عليه وسلم \"بلى\" فقالوا جاءك بهذا جبريل من عند الله؟ فقال \"نعم\" قالوا لقد بعث الله قبلك أنبياء ما نعلمه بين لنبي منهم ما مدة ملكه وما أجل أمته غيرك. فقام حي بن أخطب وأقبل على من كان معه فقال لهم الألف واحدة واللام ثلاثون والميم أربعون فهذه إحدى وسبعون سنة أفتدخلون في دين نبي إنما مدة ملكه وأجل أمته إحدى وسبعون سنة؟ ثم أقبل على رسول الله صلى الله عليه وسلم فقال يا محمد هل مع هذا غيره فقال \"نعم\" قال ما ذاك؟ قال \"المص\" قال هذا أثقل وأطول الألف واحد واللام ثلاثون والميم أربعون والصاد تسعون فهذه إحدى وثلاثون ومائة سنة. هل مع هذا يا محمد غيره؟ قال \"نعم\" قال ما ذاك؟ قال \"الر\" قال هذا أثقل وأطول الألف واحدة واللام ثلاثون والراء مائتان فهذه إحدى وثلاثون ومائتا سنة. فهل مع هذا يا محمد غيره؟ قال \"نعم\" قال ماذا قال \"المر\" قال هذه أثقل وأطول الألف واحدة واللام ثلاثون والميم أربعون والراء مائتان فهذه إحدى وسبعون ومائتان ثم قال: لقد لبس علينا أمرك يا محمد حتى ما ندري أقليلا أعطيت أم كثيرا. ثم قال قوموا عنه ثم قال أبو ياسر لأخيه حي بن أخطب ولمن معه من الأحبار ما يدريكم لعله قد جمع هذا لمحمد كله إحدى وسبعون وإحدى وثلاثون ومائة وإحدى وثلاثون ومائتان وإحدى وسبعون ومائتان فذلك سبعمائة وأربع سنين؟ فقالوا لقد تشابه علينا أمره فيزعمون أن هؤلاء الآيات نزلت فيهم \"هو الذي أنزل عليك الكتاب منه آيات محكمات هن أم الكتاب وأخر متشابهات\" فهذا الحديث مداره على محمد بن السائب الكلبي وهو ممن لا يحتج بما انفرد به ثم كان مقتضى هذا المسلك إن كان صحيحا أن يحسب ما لكل حرف من الحروف الأربعة عشر التي ذكرناها وذلك يبلغ منه جملة كثيرة وإن حسبت مع التكرر فأطم وأعظم والله أعلم."
    },
    {
      "ayah": 10,
      "surah": 30,
      "text": "قال تعالى \"ثم كان عاقبة الذين أساءوا السوأى أن كذبوا بآيات الله وكانوا بها يستهزئون\" كما قال تعالى \"ونقلب أفئدتهم وأبصارهم كما لم يؤمنوا به أول مرة ونذرهم في طغيانهم يعمهون\" وقال تعالى \"فلما زاغوا أزاغ الله قلوبهم\" وقال تعالى \"فإن تولوا فاعلم أنما يريد الله أن يصيبهم ببعض ذنوبهم\" وعلى هذا تكون السوأى منصوبة مفعولا لأساءوا وقيل بل المعنى في ذلك \"ثم كان عاقبة الذين أساءوا السوأى\" أي كانت السوأى عاقبتهم لأنهم كذبوا بآيات الله وكانوا بها يستهزئون. فعلى هذا تكون السوأى منصوبة خبر كان هذا توجيه ابن جرير ونقله عن ابن عباس وقتادة ورواه ابن أبي حاتم عنهما وعن الضحاك بن مزاحم وهو الظاهر والله أعلم لقوله \"وكانوا بها يستهزئون\"."
    },
    {
      "ayah": 11,
      "surah": 30,
      "text": "يقول تعالى \"الله يبدأ الخلق ثم يعيده\" أي كما هو قادر على بداءته فهو قادر على إعادته \"ثم إليه ترجعون\" أي يوم القيامة فيجازي كل عامل بعمله."
    },
    {
      "ayah": 12,
      "surah": 30,
      "text": "قال تعالى \"ويوم تقوم الساعة يبلس المجرمون\" قال ابن عباس: ييأس المجرمون وقال مجاهد يفتضح المجرمون وفي رواية يكتب المجرمون."
    },
    {
      "ayah": 13,
      "surah": 30,
      "text": "\"ولم يكن لهم من شركائهم شفعاء\" أي ما شفعت فيهم الآلهة التي كانوا يعبدونها من دون الله تعالى وكفروا بهم وخانوهم أحوج ما كانوا إليهم."
    },
    {
      "ayah": 14,
      "surah": 30,
      "text": "قال تعالى \"ويوم تقوم الساعة يومئذ يتفرقون\" قال قتادة هي والله الفرقة التي لا اجتماع بعدها يعني أنه إذا رفع هذا إلى عليين وخفض هذا إلى أسفل سافلين فذلك آخر العهد بينهما."
    },
    {
      "ayah": 15,
      "surah": 30,
      "text": "قال تعالى \"فأما الذين آمنوا وعملوا الصالحات فهم في روضة يحبرون\" قال مجاهد وقتادة: ينعمون وقال يحيى بن أبي كثير يعني سماع الغناء. والحبرة أعم من هذا كله قال العجاج: فالحمد لله الذي أعطى الحبر موالى الحق إن المولى شكر"
    },
    {
      "ayah": 16,
      "surah": 30,
      "text": "هذا تسبيح منه تعالى لنفسه المقدسة وإرشاد لعباده إلى تسبيحه وتحميده في هذه الأوقات المتعاقبة الدالة على كمال قدرته وعظيم سلطانه عند المساء وهو إقبال الليل بظلامه وعند الصباح وهو إسفار النهار بضيائه. ثم اعترض بحمده مناسبة للتسبيح وهو التحميد."
    },
    {
      "ayah": 17,
      "surah": 30,
      "text": "قال تعالى \"وله الحمد في السموات والأرض\" أي هو المحمود على ما خلق في السماوات والأرض ثم قال تعالى \"وعشيا وحين تظهرون\" فالعشاء هو شدة الظلام والإظهار قوة الضياء فسبحان خالق هذا وهذا فالق الإصباح وجاعل الليل سكنا كما قال تعالى \"والنهار إذا جلاها والليل إذا يغشاها\" وقال تعالى \"والليل إذا يغشى والنهار إذا تجلى\" وقال تعالى \"والضحى والليل إذا سجى\" والآيات في هذا كثيرة. وقال الإمام أحمد حدثنا حسن حدثنا ابن لهيعة حدثنا زياد بن فايد عن سهل بن معاذ بن أنس الجهني عن أبيه عن رسول الله صلى الله عليه وسلم أنه قال \"ألا أخبركم لم سمى الله إبراهيم خليله الذي وفى؟ لأنه كان يقول كلما أصبح وكلما أمسى سبحان الله حين تمسون وحين تصبحون وله الحمد في السموات والأرض وعشيا وحين تظهرون\". وقال الطبراني حدثنا مطلب بن شعيب الأزدي حدثنا عبدالله بن صالح حدثني الليث بن سعد عن سعيد بن بشير عن محمد بن عبدالرحمن بن البيلماني عن أبيه عن عبدالله بن عباس عن رسول الله صلى الله عليه وسلم قال \"من قال حين يصبح سبحان الله حين تمسون وحين تصبحون وله الحمد في السموات والأرض وعشيا وحين تظهرون الآية بكمالها أدرك ما فاته في يومه ومن قالها حين يمسي أدرك ما فاته في ليلته\" إسناد جيدا ورواه أبو داود في سننه."
    },
    {
      "ayah": 18,
      "surah": 30,
      "text": "قوله تعالى \"يخرج الحي من الميت ويخرج الميت من الحي\" هو ما نحن فيه من قدرته على خلق الأشياء المتقابلة وهذه الآيات المتتابعة الكريمة كلها من هذا النمط فإنه يذكر فيها خلقه الأشياء وأضدادها ليدل خلقه على كمال قدرته فمن ذلك إخراج النبات من الحب والحب من النبات والبيض من الدجاج والدجاج من البيض والإنسان من النطفة والنطفة من الإنسان والمؤمن من الكافر والكافر من المؤمن. وقوله تعالى \"ويحيي الأرض بعد موتها\" كقوله تعالى \"وآية لهم الأرض الميتة أحييناها وأخرجنا منها حبا فمنه يأكلون - إلى قوله - وفجرنا فيها من العيون\" وقال تعالى \"وترى الأرض هامدة فإذا أنزلنا عليها الماء اهتزت وربت وأنبتت من كل زوج بهيج - إلى قوله - وأن الله يبعث من في القبور\" وقال تعالى \"وهو الذي يرسل الرياح بشرا بين يدي رحمته حتى إذا أقلت سحابا ثقالا - إلى قوله - لعلكم تذكرون\" ولهذا قال ههنا \"وكذلك تخرجون\"."
    },
    {
      "ayah": 19,
      "surah": 30,
      "text": "يقول تعالى \"ومن آياته\" الدالة على عظمته وكمال قدرته أنه خلق أباكم آدم من تراب \"ثم إذا أنتم بشر تنتشرون\" فأصلكم من تراب ثم من ماء مهين ثم تصور فكان علقة ثم مضغة ثم صار عظاما شكله على شكل الإنسان ثم كسا الله تلك العظام لحما ثم نفخ فيه الروح فإذا هو سميع بصير ثم خرج من بطن أمه صغيرا ضعيف القوى والحركة ثم كلما طال عمره تكاملت قواه وحركاته حتى آل به الحال إلى أن صار يبني المدائن والحصون ويسافر في أقطار الأقاليم ويركب متن البحور ويدور أقطار الأرض ويكتسب ويجمع الأموال وله فكرة وغور ودهاء ومكر ورأي وعلم واتساع في أمور الدنيا والآخرة كل بحسبه فسبحان من أقدرهم وسيرهم وسخرهم وصرفهم في فنون المعايش والمكاسب وفاوت بينهم في العلوم والفكرة والحسن والقبح والغنى والفقر والسعادة والشقاوة ولهذا قال تعالى \"ومن آياته أن خلقكم من تراب ثم إذا أنتم بشر تنتشرون\". وقال الإمام أحمد حدثنا يحيى بن سعيد وغندر قالا حدثنا عوف عن قسامة بن زهير عن أبي موسى قال: قال رسول الله صلى الله عليه وسلم \"إن الله خلق آدم من قبضة قبضها من جميع الأرض فجاء بنو آدم على قدر الأرض جاء منهم الأبيض والأحمر والأسود وبين ذلك والخبيث والطيب والسهل والحزن وبين ذلك\" ورواه أبو داود والترمذي من طرق عن عوف الأعرابي به وقال الترمذي هذا حديث حسن صحيح."
    },
    {
      "ayah": 2,
      "surah": 30,
      "text": "نزلت هذه الآيات حين غلب سابور ملك الفرس على بلاد الشام وما والاها من بلاد الجزيرة وأقاصي بلاد الروم فاضطر هرقل ملك الروم حتى ألجأه إلى القسطنطينية وحاصره فيها مدة طويلة ثم عادت الدولة لهرقل كما سيأتي. وقال الإمام أحمد حدثنا معاوية بن عمر وحدثنا أبو إسحاق عن سفيان الثوري عن حبيب بن أبي عمرة عن سعيد بن جبير عن ابن عباس رضي الله عنه في قوله تعالى: \"الم غلبت الروم في أدنى الأرض\" قال غلبت وغلبت قال كان المشركون يحبون أن تظهر فارس على الروم لأنهم أصحاب أوثان. وكان المسلمون يحبون أن تظهر الروم على فارس لأنهم أهل الكتاب. فذكر ذلك لأبي بكر فذكره أبو بكر لرسول الله صلى الله عليه وسلم فقال رسول الله صلى الله عليه وسلم: \"أما إنهم سيغلبون\" فذكره أبو بكر لهم فقالوا اجعل بيننا وبينك أجلا فإن ظهرنا كان لنا كذا وكذا وإن ظهرتم كان لكم كذا وكذا فجعل أجل خمس سنين فلم يظهروا فذكر ذلك أبو بكر لرسول الله صلى الله عليه وسلم فقال: \"ألا جعلتها إلى دون أراه قال العشر-\" قال سعيد بن جبير البضع ما دون العشر ثم ظهرت الروم بعد قال فذلك قوله: \"الم غلبت الروم في أدنى الأرض وهم من بعد غلبهم سيغلبون -إلى قوله - وهو العزيز الرحيم\" هكذا رواه الترمذي والنسائي جميعا عن الحسين بن حريث عن معاوية بن عمرو عن أبي إسحاق الفزاري عن سفيان الثوري به وقال الترمذي حديث حسن غريب إنما نعرفه من حديث سفيان عن حبيب ورواه ابن أبي حاتم عن محمد بن إسحاق الصنعاني عن معاوية بن عمرو به. ورواه ابن جرير حدثنا محمد بن المثنى حدثنا محمد بن سعيد أو سعيد الثعلبي الذي يقال له أبو سعد من أهل طرسوس حدثنا أبو إسحاق الفزاري فذكره وعندهم قال سفيان فبلغني أنهم غلبوا يوم بدر \"حديث آخر\" قال سليمان بن مهران الأعمش عن مسلم عن مسروق قال: قال عبدالله خمس قد مضين: الدخان واللزام والبطشة والقمر والروم أخرجاه. وقال ابن جرير حدثنا ابن وكيع حدثنا المحاربي عن داود بن أبي هند عن عامر- هو الشعبي - عن عبدالله بن مسعود رضي الله عنه قال: كانت فارس ظاهرة على الروم وكان المشركون يحبون أن تظهر فارس على الروم. وكان المسلمون يحبون أن تظهر الروم على فارس لأنهم أهل كتاب. وهم أقرب إلى دينهم فلما نزلت \"الم غلبت الروم في أدنى الأرض وهم من بعد غلبهم سيغلبون في بضع سنين\" قالوا يا أبا بكر إن صاحبك يقول إن الروم تظهر على فارس في بضع سنين: قال صدق قالوا هل لك أن تقامرك فبايعوه على أربع قلائص إلى سبع سنين فمضت السبع ولم يكن شيء ففرح المشركون بذلك فشق على المسلمين فذكر ذلك للنبي صلى الله عليه وسلم فقال: \"ما بضع سنين عندكم؟\" قالوا دون العشر قال: \"اذهب فزايدهم وازدد سنتين في الأجل \"قال فما مضت السنتان حتى جاءت الركبان بظهور الروم على فارس ففرح المؤمنون بذلك وأنزل الله تعالى: \"الم غلبت الروم - إلى قوله تعالى - وعد الله لا يخلف الله وعده\". \"حديث آخر\" قال ابن أبي حاتم حدثنا علي بن الحسين حدثنا أحمد بن عمر الوكيعي حدثنا مؤمن عن إسرائيل عن أبي إسحاق عن البراء قال لما نزلت \"الم غلبت الروم في أدنى الأرض وهم من بعد غلبهم سيغلبون\" قال المشركون لأبي بكر ألا ترى إلى ما يقول صاحبك يزعم أن الروم تغلب فارس قال صدق صاحبي قالوا هل لك أن نخاطرك فجعل بينه وبينهم أجلا فحل الأجل قبل أن تغلب الروم فارس فبلغ ذلك النبي صلى الله عليه وسلم وساءه ذلك وكرهه وقال لأبي بكر \"ما دعاك إلى هذا؟\" قال تصديقا لله ولرسوله قال: \"تعرض لهم وأعظم لهم الخطر واجعله إلى بضع سنين\" فأتاهم أبا بكر فقال هل لكم في العود فإن العود أحمد؟ قالوا نعم فلم تمض تلك السنين حتى غلبت الروم فارس وربطوا خيولهم بالمدائن وبنوا الرومية فجاء أبو بكر إلى النبي صلى الله عليه وسلم فقال هذا السحت قال \"تصدق به\" \"حديث آخر\" قال أبو عيسى الترمذي حدثنا محمد بن إسماعيل حدثنا إسماعيل بن أبي أويس أخبرني ابن أبي الزناد عن عروة بن الزبير عن نيار بن مكرم الأسلمي قال: لما نزلت \"الم غلبت الروم في أدنى الأرض وهم من بعد غلبهم سيغلبون في بضع سنين\" فكانت فارس يوم نزلت هذه الآية قاهرين للروم وكان المسلمون يحبون ظهور الروم عليهم لأنهم وإياهم أهل كتاب وفي ذلك قوله تعالى: \"يومئذ يفرح المؤمنون بنصر الله ينصر من يشاء وهو العزيز الرحيم\" وكانت قريش تحب ظهور فارس لأنهم وإياهم ليسوا بأهل كتاب ولا إيمان يبعث فلما أنزل الله هذه الآية خرج أبو بكر يصيح في نواحي مكة \"الم غلبت الروم في أدنى الأرض وهم من بعد غلبهم سيغلبون في بضع سنين\" فقال ناس من قريش لأبي بكر فذاك بيننا وبينكم زعم صاحبكم أن الروم ستغلب فارس في بضع سنين أفلا نراهنك على ذلك؟ قال بلى وذلك قبل تحريم الرهان فارتهن أبو بكر والمشركون وتواضعوا الرهان وقالوا لأبي بكر كم نجعل البضع ثلاث سنين إلى تسع سنين فسم بيننا وبينك وسطا ننتهي إليه قالوا فسموا بينهم ست سنين قال فمضت ست السنين قبل أن يظهروا فأخذ المشركون رهن أبي بكر فلما دخلت السنة السابعة ظهرت الروم على فارس قال فعاب المسلمون على أبي بكر تسميته ست سنين قال لأن الله يقول في بضع سنين قال فأسلم عند ذلك ناس كثير. هكذا ساقه الترمذي ثم قال هذا حديث حسن صحيح لا نعرفه إلا من حديث عبدالرحمن بن أبي الزناد وقد روي نحو هذا مرسلا عن جماعة من التابعين مثل عكرمة والشعبي ومجاهد وقتادة والسدي والزهري وغيرهم ومن أغرب هذه السياقات ما رواه الإمام سنيد بن داود في تفسيره حيث قال حدثني حجاج عن أبي بكر عن عكرمة قال: كان في فارس امرأة لا تلد إلا الملوك والأبطال فدعاها كسرى فقال إني أريد أن أبعث إلى الروم جيشا وأستعمل عليه رجلا من بنيك فأشيري علي أيهم أستعمل؟ فقالت هذا فلان وهو أروغ من ثعلب وأحذر من صقر وهذا فرخان وهو أنفذ من سنان وهذا شهريراز وهو أحلم من كذا تعني أولادها الثلاثة فاستعمل أيهم شئت قال فإني استعملت الحليم فاستعمل شهريراز فسار إلى الروم بأهل فارس فظهر عليهم فقتلهم وخرب مدائنهم وقطع زيتونهم قال أبو بكر بن عبدالله فحدث بهذا الحديث عطاء الخراساني فقال أما رأيت بلاد الشام؟ قلت لا قال أما إنك لو رأيتها لرأيت المدائن التي خربت والزيتون الذي قطع فأتيت الشام بعد ذلك فرأيته قال عطاء الخراساني حدثني يحيى بن يعمر أن قيصر بعث رجلا يدعى قطمة بجيش من الروم وبعث كسرى شهريراز فالتقيا بين أذرعات وبصرى وهي أدنى الشام إليكم فلقيت فارس الروم فغلبتهم فارس ففرحت بذلك كفار قريش وكرهه المسلمون قال عكرمة: ولقي المشركون أصحاب النبي صلى الله عليه وسلم وقالوا إنكم أهل كتاب والنصارى أهل كتاب ونحن أميون وقد ظهر إخواننا من أهل فارس على إخوانكم من أهل الكتاب وإنكم إن قاتلتمونا لنظهرن عليكم فأنزل الله تعالى: \"الم غلبت الروم في أدنى الأرض - إلى قوله - ينصر من يشاء\" فخرج أبو بكر الصديق إلى الكفار فقال: أفرحتم بظهور إخوانكم على إخواننا فلا تفرحوا ولا يقرن الله أعينكم فوالله ليظهرن الله الروم على فارس أخبرنا بذلك نبينا صلى الله عليه وسلم فقام إليه أبي بن خلف فقال كذبت يا أبا فضيل فقال له أبو بكر: أنت أكذب يا عدو الله فقال أناحبك عشر قلائص مني وعشر قلائص منك فإن ظهرت الروم على فارس غرمت وإن ظهرت فارس غرمت إلى ثلاث سنين ثم جاء أبو بكر إلى النبي صلى الله عليه وسلم فأخبره فقال: \"ما هكذا ذكرت إنما البضع ما بين الثلاث إلى التسع فزايده في الخطر وماده في الأجل\" فخرج أبو بكر فلقي أبيا فقال لعلك ندمت؟ فقال لا تعال أزايدك في الخطر وأمادك في الأجل فاجعلها مائة قلوص إلى تسع سنين قال قد فعلت فظهرت الروم على فارس قبل ذلك فغلبهم المسلمون. قال عكرمة لما أن ظهرت فارس على الروم جلس فرخان يشرب وهو أخو شهريراز فقال لأصحابه لقد رأيت كأني جالس على سرير كسرى فبلغت كسرى فكتب كسرى إلى شهريراز إذا أتاك كتابي فابعث إلي برأس فرخان فكتب إليه شهريراز أيها الملك إنك لن تجد مثل فرخان له نكاية وصوت في العدو فلا تفعل فكتب إليه إن في رجال فارس خلفا منه فعجل إلي برأسه. فراجعه فغضب كسرى فلم يجبه وبعث بريدا إلى أهل فارس إني قد نزعت عنكم شهريراز واستعملت عليكم فرخان ثم رفع إلى البريد صحيفة لطيفة صغيرة فقال إذا ولى فرخان الملك وانقاد له أخوه فأعطه هذه فلما قرأ شهريراز الكتاب قال سمعا وطاعة ونزل عن سريره وجلس عليه فرخان ورفع إليه الصحيفة اللطيفة فلما قرأها قال ائتوني بشهريراز وقدمه ليضرب عنقه فقال شهريراز لا تعجل حتى أكتب وصيتي قال نعم فدعا بالسفط فأعطاه الصحائف فقال كل هذا راجعت فيك كسرى وأنت أردت أن تقتلني بكتاب واحد فرد الملك إلى أخيه شهريراز وكتب شهريراز إلى قيصر ملك الروم إن لي إليك حاجة لا تحملها البرد ولا تحملها الصحف فالقني ولا تلقني إلا في خمسين روميا فإني لا ألقاك إلا في خمسين فارسيا. فأقبل قيصر في خمسمائة رومي وجعل يضع العيون بين يديه في الطريق وخاف أن يكون قد مكر به حتى أتاه عيونه بأنه ليس معه إلا خمسون رجلا ثم بسط لهما والتقيا في قبة ديباج ضربت لهما مع كل واحد منهما سكين فدعيا ترجمانا بينهما فقال شهريراز إن الذين خربوا مدائنك أنا وأخي بكيدنا وشجاعتنا وإن كسرى حسدنا وأراد أن أقتل أخي فأبيت ثم أمر أخي أن يقتلني فقد خلعنا جميعا فنحن نقاتله معك. قال قد أصبتما ثم أشار أحدهما إلى صاحبه أن السر بين اثنين فإذا جاوز اثنين فشا قال أجل فقتلا الترجمان جميعا بسكينيهما فأهلك الله كسرى وجاء الخبر إلى رسول الله صلى الله عليه وسلم يوم الحديبية ففرح والمسلمون معه. فهذا سياق غريب وبناء عجيب. ولنتكلم على كلمات هذه الآيات الكريمات فقوله تعالى: \"الم غلبت الروم\" قد تقدم الكلام على الحروف المقطعة في أوائل السور في أول سورة البقرة وأما الروم فهم من سلالة العيص بن إسحاق بن إبراهيم وهم أبناء عم بني إسرائيل ويقال لهم بنو الأصفر وكانوا على دين اليونان واليونان من سلالة يافث بن نوح أبناء عم الترك وكانوا يعبدون الكواكب السيارة السبعة ويقال لها المتحيرة ويصلون إلى القطب الشمالي وهم الذين أسسوا دمشق وبنوا معبدها وفيه محاريب إلى جهة الشمال فكان الروم على دينهم إلى بعد مبعث المسيح بنحو من ثلاث مائة سنة وكان من ملك منهم الشام مع الجزيرة يقال له قيصر فكان أول من دخل في دين النصارى من ملوك الروم قسطنطين بن قسطس وأمه مريم الهيلانية الغندقانية من أرض حران كانت قد تنصرت قبله فدعته إلى دينها وكان قبل ذلك فيلسوفا فتابعها يقال تقية واجتمعت به النصارى وتناظروا في زمانه مع عبدالله بن أريوس واختلفوا اختلافا كثيرا منتشرا متشتتا لا ينضبط إلا أنه اتفق من جماعتهم ثلاث مائة وثمانية عشر أسقفا فوضعوا لقسطنطين العقيدة وهي التي يسمونها الأمانة الكبيرة وإنما هي الخيانة الحقيرة ووضعوا له القوانين يعنون كسب الأحكام من تحريم وتحليل وغير ذلك مما يحتاجون إليه وغيروا دين المسيح عليه السلام وزادوا فيه ونقصوا من فصلوا إلى المشرق واعتاضوا عن السبت بالأحد وعبدوا الصليب وأحلوا الخنزير واتخذوا أعيادا أحدثوها كعيد الصليب والقداس والغطاس وغير ذلك من البواعيث والشعابين وجعلوا له الباب وهو كبيرهم ثم البتاركة ثم المطارنة ثم الأساقفة والقساقسة ثم الشمامسة وابتدعوا الرهبانية وبنى لهم الملك الكنائس والمعابد وأسس المدينة المنسوبة إليه وهي القسطنطينية يقال إنه بنى في أيامه اثنى عشر ألف كنيسة وبنى بيت لحم بثلاث محاريب وبنت أمه القمامة وهؤلاء هم الملكية يعنون الذين هم على دين الملك ثم حدثت بعدهم اليعقوبية أتباع يعقوب الأسكاف ثم النسطورية أصحاب نسطورا وهم فرق وطوائف كثيرة كما قال رسول الله صلى الله عليه وسلم: \"إنهم افترقوا على اثنتين وسبعين فرقة\" والغرض أنهم استمروا على النصرانية كلما هلك قيصر خلفه آخر بعده حتى كان آخرهم هرقل وكان من عقلاء الرجال ومن أحزم الملوك وأدهاهم وأبعدهم غورا وأقصاهم رأيا فتملك عليهم في رياسة عظيمة وأبهة كثيرة فناوأه كسرى ملك الفرس وملك البلاد كالعراق وخراسان والري وجميع بلاد العجم وهو سابور ذو الأكتاف وكانت مملكته أوسع من مملكة قيصر وله رياسة العجم وحماقة الفرس وكانوا مجوسا يعبدون النار فتقدم عن عكرمة أنه قال بعث إليه نوابه وجيشه فقاتلوه والمشهور أن كسرى غزاه بنفسه في بلاده فقهره وكسره وقصره حتى لم يبق معه سوى مدينة قسطنطينية فحاصره بهامدة طويلة حتى ضاقت عليه وكانت النصارى تعظمه تعظيما زائدا ولم يقدر كسرى على فتح البلد ولا أمكنه ذلك لحصانتها لأن نصفها من ناحية البر ونصفها الآخر من ناحية البحر فكانت تأتيهم الميرة والمدد من هنالك فلما طال الأمر دبر قيصر مكيدة ورأى في نفسه خديعة فطلب من كسرى أن يقلع من بلاده على مال يصالحه عليه ويشترط عليه ما شاء فأجابه إلى ذلك وطلب منه أموالا عظيمة لا يقدر عليها أحد من ملوك الدنيا من ذهب وجواهر وأقمشة وجوار وخدام وأصناف كثيره فطاوعه قيصر وأوهمه أن عنده جميع ما طلب واستقل عقله لما طلب منه ما طلب ولو اجتمع هو وإياه لعجزت قدرتهما عن جمع عشره وسأل من كسرى أن يمكنه من الخروج إلى بلاد الشام وأقاليم مملكته ليسعى في تحصيل ذلك من ذخائره وحواصله ودفائنه فأطلق سراحه فلما عزم قيصر على الخروج من مدينة قسطنطينية جمع أهل ملته وقال: إني خارج في أمر قد أبرمته في جند قد عينته من جيشي فإن رجعت إليكم قبل الحول فأنا ملككم وإن لم أرجع إليكم قبلها فأنتم بالخيار إن شئتم استمررتم على بيعتي وإن شئتم وليتم عليكم غيري فأجابوه بأنك ملكنا ما دمت حيا ولو غبت عشرة أعوام فلما خرج من القسطنطينية خرج جريدة في جيش متوسط هذا وكسرى مخيم على القسطنطينية ينتظره ليرجع فركب قيصر من فوره وسار مسرعا حتى انتهى إلى بلاد فارس فعاث في بلادهم قتلا لرجالها ومن بها من المقاتلة أولا فأولا ولم يزل يقتل حتى انتهى إلى المدائن وهي كرسي مملكة كسرى فقتل من بها وأخذ جميع حواصله وأمواله وأسر نساءه وحريمه وحلق رأس ولده وركبه على حمار وبعث معه من الأساورة من قومه في غاية الهوان والذلة وكتب إلى كسرى يقول هذا ما طلبت فخذه فلما بلغ ذلك كسرى أخذه من الغم ما لا يحصيه إلا الله تعالى واشتد حنقه على البلد فجد في حصارها بكل ممكن فلم يقدر على ذلك فلما عجز ركب ليأخذ عليه الطريق من مخاضة جيحون التي لا سبيل لقيصر إلى القسطنطينية إلا منها فلما علم قيصر بذلك احتال بحيلة عظيمة لم يسبق إليها وهو أنه أرصد جنده وحواصله التي معه عند فم المخاضة وركب في بعض الجيش وأمر بأحمال من التبن والبعر والروث فحملت معه وسار إلى قريب من يوم في الماء مصعدا ثم أمر بإلقاء تلك الأحمال في النهر فلما مرت بكسرى وجنده ظن أنهم قد خاضوا من هنالك فركبوا في طلبهم فشغرت المخاضة عن الفرس وقدم قيصر فأمرهم بالنهوض والخوض فخاضوا وأسرعوا السير ففاتوا كسرى وجنوده ودخلوا القسطنطينية فكان ذلك يوما مشهودا عند النصارى وبقي كسرى وجيوشه حائرين لا يدرون ماذا يصنعون لم يحصلوا على بلاد قيصر وبلادهم قد خربتها الروم وأخذوا حواصلهم وسبوا ذراريهم ونساءهم فكان هذا من غلب الروم لفارس وكان ذلك بعد تسع سنين من غلب فارس للروم وكانت الوقعة الكائنة بين فارس والروم حين غلبت الروم بين أذرعات وبصرى على ما ذكره ابن عباس وعكرمة وغيرهما وهي طرف بلاد الشام مما يلي بلاد الحجاز وقال مجاهد كان ذلك في الجزيرة وهي أقرب بلاد الروم من فارس فالله أعلم. ثم كان غلب الروم لفارس بعد بضع سنين وهي تسع فإن البضع في كلام العرب ما بين الثلاث إلى التسع. وكذلك جاء في الحديث الذي رواه الترمذي وابن جرير وغيرهما من حديث عبدالله بن عبدالرحمن الجمحي عن الزهري عن عبيد الله بن عبدالله عن ابن عباس أن رسول الله صلى الله عليه وسلم قال لأبي بكر في مناحبة \"الم غلبت الروم\" الآية \"ألا احتطت يا أبا بكر فإن البضع ما بين ثلاث إلى تسع؟\" ثم قال هذا حديث حسن غريب من هذا الوجه. وروى ابن جرير عن عبدالله بن عمرو أنه قال ذلك والله أعلم."
    },
    {
      "ayah": 20,
      "surah": 30,
      "text": "قوله تعالى \"ومن آياته أن خلق لكم من أنفسكم أزواجا\" أي خلق لكم من جنسكم إناثا تكون لكم أزواجا \"لتسكنوا إليها\" كما قال تعالى \"هو الذي خلقكم من نفس واحدة وجعل منها زوجها ليسكن إليها\" يعني بذلك حواء خلقها الله من آدم من ضلعه الأقصر الأيسر. ولو أنه تعالى جعل بني آدم كلهم ذكورا وجعل إناثهم من جنس آخر من غيرهم إما من جان أو حيوان لما حصل هذا الائتلاف بينهم وبين الأزواج بل كانت تحصل نفره لو كانت الأزواج من غير الجنس ثم من تمام رحمته ببني آدم أن جعل أزواجهم من جنسهم وجعل بينهم وبينهن مودة وهي المحبة ورحمة وهي الرأفة فإن الرجل يمسك المرأة إما لمحبته لها أو لرحمة بها بأن يكون لها منه ولد أو محتاجة إليه في الإنفاق أو للألفة بينهما وغير ذلك \"إن في ذلك لآيات لقوم يتفكرون\"."
    },
    {
      "ayah": 21,
      "surah": 30,
      "text": "يقول تعالى \"ومن آياته\" الدالة على قدرته العظيمة\" خلق السماوات والأرض\" أي خلق السماوات في ارتفاعها واتساعها وسقوف أجرامها وزهارة كواكبها ونجومها الثوابت والسيارات وخلق الأرض في انخفاضها وكثافتها وما فيها من جبال وأودية وبحار وقفار وحيوان وأشجار. وقوله تعالى \"واختلاف ألسنتكم\" يعني اللغات فهؤلاء بلغة العرب وهؤلاء تتر لهم لغة أخرى وهؤلاء كرج وهؤلاء روم وهؤلاء إفرنج وهؤلاء بربر وهؤلاء تكرور وهؤلاء حبشة وهؤلاء هنود وهؤلاء عجم وهؤلاء صقالبة وهؤلاء خرز وهؤلاء أرمن وهؤلاء أكراد إلى غير ذلك مما لا يعلمه إلا الله تعالى من اختلاف لغات بني آدم واختلاف ألوانهم وهي حلاهم فجميع أهل الأرض بل أهل الدنيا منذ خلق الله آدم إلى قيام الساعة كل له عينان وحاجبان وأنف وجبين وفم وخدان وليس يشبه واحد منهم الآخر بل لا بد أن يفارقه بشيء من السمت أو الهيئة أو الكلام ظاهرا كان أو خفيا يظهر عند التأمل كل وجه منهم أسلوب بذاته وهيئة لا تشبه أخرى ولو توافق جماعة في صفة من جمال أو قبح لا بد من فارق بين كل واحد منهم وبين الآخر \"إن في ذلك لآيات للعالمين."
    },
    {
      "ayah": 22,
      "surah": 30,
      "text": "\"ومن آياته منامكم بالليل والنهار وابتغاؤكم من فضله\" أي ومن الآيات ما جعل الله من صفة النوم في الليل والنهار فيه تحصل الراحة وسكون الحركة وذهاب الكلال والتعب وجعل لكم الانتشار والسعي في الأسباب والأسفار في النهار وهذا ضد النوم \"إن في ذلك لآيات لقوم يسمعون\" أي يعون. قال الطبراني حدثنا حجاج بن عمران السدوسي حدثنا عمرو بن الحصين العقيلي حدثنا محمد بن عبدالله بن علاثة حدثنا ثور بن يزيد عن خالد بن معدان سمعت عبدالملك بن مروان يحدث عن أبيه عن زيد بن ثابت رضي الله عنه قال: أصابني أرق من الليل فشكوت ذلك إلى رسول الله صلى الله عليه وسلم فقال \"قل اللهم غارت النجوم وهدأت العيون وأنت حي قيوم يا حي يا قيوم أنم عيني وأهدئ ليلي\" فقلتها فذهب عني."
    },
    {
      "ayah": 23,
      "surah": 30,
      "text": "يقول تعالى \"ومن آياته\" الدالة على عظمته أنه \"يريكم البرق خوفا وطمعا\" أي تارة تخافون مما يحدث بعده من أمطار مزعجة وصواعق متلفة وتارة ترجون وميضه وما يأتي بعده من المطر المحتاج إليه ولهذا قال تعالى \"وينزل من السماء ماء فيحيي به الأرض بعد موتها\" أي بعد ما كانت هامدة لا نبات فيها ولا شيء فلما جاءها الماء \"اهتزت وربت وأنبتت من كل زوج بهيج\" وفي ذلك عبرة ودلالة واضحة على المعاد وقيام الساعة ولهذا قال \"إن في ذلك لآيات لقوم يعقلون\"."
    },
    {
      "ayah": 24,
      "surah": 30,
      "text": "قال تعالى \"ومن آياته أن تقوم السماء والأرض بأمره\" كقوله تعالى \"ويمسك السماء أن تقع على الأرض إلا بإذنه\" وقوله \"إن الله يمسك السماوات والأرض أن تزولا\" وكان عمر بن الخطاب رضي الله عنه إذا اجتهد في اليمين قال: والذي تقوم السماء والأرض بأمره أي هي قائمة ثابتة بأمره لها وتسخيره إياها ثم إذا كان يوم القيامة بدلت الأرض غير الأرض والسماوات وخرجت الأموات من قبورها أحياء بأمره تعالى ودعائه إياهم ولهذا قال تعالى \"ثم إذا دعاكم دعوة من الأرض إذا أنتم تخرجون\" أي من الأرض كما قال تعالى \"يوم يدعوكم فتستجيبون بحمده وتظنون إن لبثتم إلا قليلا\" وقال تعالى \"فإنما هي زجرة واحدة فإذا هم بالساهرة\" وقال تعالى \"إن كانت إلا صيحة واحدة فإذا هم جميع لدينا محضرون\"."
    },
    {
      "ayah": 25,
      "surah": 30,
      "text": "يقول تعالى \"وله من في السموات والأرض\" أي ملكه وعبيده \"كل له قانتون\" أي خاضعون خاشعون طوعا وكرها. وفي حديث دراج عن أبي الهيثم عن أبي سعيد مرفوعا \"كل حرف في القرآن يذكر فيه القنوت فهو الطاعة\"."
    },
    {
      "ayah": 26,
      "surah": 30,
      "text": "يقول تعالى \"وله من في السموات والأرض\" أي ملكه وعبيده \"كل له قانتون\" أي خاضعون خاشعون طوعا وكرها. وفي حديث دراج عن أبي الهيثم عن أبي سعيد مرفوعا \"كل حرف في القرآن يذكر فيه القنوت فهو الطاعة\"."
    },
    {
      "ayah": 27,
      "surah": 30,
      "text": "قوله \"وهو الذي يبدأ الخلق ثم يعيده وهو أهون عليه\" قال ابن أبي طلحة عن ابن عباس يعني أيسر عليه وقال مجاهد الإعادة أهون عليه من البداءة والبداءة عليه هينة وكذا قال عكرمة وغيره وروى البخاري حدثنا أبو اليمان أخبرنا شعيب أخبرنا أبو الزناد عن الأعرج عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم \"يقول الله تعالى كذبني ابن آدم ولم يكن له ذلك وشتمني ولم يكن له ذلك فأما تكذيبه إياي فقوله لن يعيدني كما بدأني وليس أول الخلق بأهون علي من إعادته وأما شتمه إياي فقوله اتخذ الله ولدا وأنا الأحد الصمد الذي لم يلد ولم يولد ولم يكن له كفوا أحد\" انفرد بإخراجه البخاري كما انفرد بروايته أيضا من حديث عبدالرزاق عن معمر عن همام عن أبي هريرة به وقد رواه الإمام أحمد منفردا به عن حسن بن موسى عن ابن لهيعة حدثنا أبو يونس سليم بن جبير عن أبي هريرة عن النبي صلى الله عليه وسلم بنحوه أو مثله. وقال آخرون كلاهما بالنسبة إلى القدرة على السواء وقال العوفي عن ابن عباس كل عليه هين وكذا قاله الربيع بن خيثم ومال إليه ابن جرير وذكر عليه شواهد كثيرة قال ويحتمل أن يعود الضمير في قوله \"وهو أهون عليه\" إلى الخلق أي وهو أهون على الخلق. وقوله \"وله المثل الأعلى في السماوات والأرض\" قال علي بن أبي طلحة عن ابن عباس كقوله تعالى \"ليس كمثله شيء\" وقال قتادة مثله أنه لا إله إلا هو ولا رب غيره وقال مثل هذا ابن جرير. وقد أنشد بعض المفسرين عند ذكر هذه الآية لبعض أهل المعارف. إذا سكن الغدير على صفــاء وجنب أن يحركه النسيــــم يرى فيه السماء بلا امتراء كذاك الشمس تبدو والنجـوم كذاك قلوب أرباب التجـــلي يرى في صفوها الله العظيم وهو العزيز الذي لا يغالب ولا يمانع بل قد غلب كل شيء وقهر كل شيء بقدرته وسلطانه الحكيم في أقواله وأفعاله شرعا وقدرا وعن مالك في تفسيره المروي عنه عن محمد بن المنكدر في قوله تعالى \"وله المثل الأعلى\" قال لا إله إلا الله."
    },
    {
      "ayah": 28,
      "surah": 30,
      "text": "هذا مثل ضربه الله تعالى للمشركين به العابدين معه غيره الجاعلين له شركاء وهم مع ذلك معترفون أن شركاءه من الأصنام والأنداد عبيد له ملك له كما كانوا يقولون: لبيك لا شريك لك إلا شريكا هو لك. تملكه وما ملك. فقال تعالى \" ضرب لكم مثلا من أنفسكم\" أي تشهدونه وتفهمونه من أنفسكم \"هل لكم مما ملكت أيمانكم من شركاء فيما رزقناكم فأنتم فيه سواء\" أي يرضى أحدكم أن يكون عبده شريكا له في ماله فهو وهو فيه على السواء \"تخافونهم كخيفتكم أنفسكم\" أي تخافون أن يقاسموكم الأموال. قال أبو مجلز إن مملوكك لا تخاف إن يقاسمك مالك وليس له ذاك. كذلك الله لا شريك له. والمعنى أن أحدكم يأنف من ذلك فكيف تجعلون لله الأنداد من خلقه وهذا كقوله تعالى \"ويجعلون لله ما يكرهون\" أي من البنات حيث جعلوا الملائكة الذين هم عباد الرحمن إناثا وجعلوها بنات الله وقد كان أحدهم إذا بشر بالأنثى ظل وجهه مسودا وهو كظيم يتوارى من القوم من سوء ما بشر به أيمسكه على هون أم يدسه في التراب فهم يأنفون من البنات وجعلوا الملائكة بنات الله فنسبوا إليه ما لا يرتضونه لأنفسهم فهذا أغلظ الكفر وهكذا في هذا المقام جعلوا له شركاء من عبيده وخلقه وأحدهم يأبى غاية الإباء ويأنف غاية الأنفة من ذلك أن يكون عبده شريكه في ماله يساويه فيه ولو شاء لقاسمه عليه \"تعالى الله عن ذلك علوا كبيرا\". قال الطبراني حدثنا محمود بن الفرج الأصبهاني حدثنا إسماعيل بن عمرو البجلي حدثنا حماد بن شعيب عن حبيب بن أبي ثابت عن سعيد بن جبير عن ابن عباس قال: كان يلبي أهل الشرك لبيك اللهم لبيك لا شريك لك إلا شريكا هو لك تملكه وما ملك. فأنزل الله تعالى \"هل لكم مما ملكت أيمانكم من شركاء فيما رزقناكم فأنتم فيه سواء تخافونهم كخيفتكم أنفسكم\" ولما كان التنبيه بمثل هذا المثل على براءته تعالى ونزاهته عن ذلك بطريق الأولى والأخرى. قال تعالى \"كذلك نفصل الآيات لقوم يعقلون\"."
    },
    {
      "ayah": 29,
      "surah": 30,
      "text": "قال تعالى مبينا أن المشركين إنما عبدوا غيره سفها من أنفسهم وجهلا \"بل اتبع الذين ظلموا\" أي المشركون \"أهواءهم\" أي في عبادتهم الأنداد بغير علم \"فمن يهدي من أضل الله\" أي فلا أحد يهديهم إذا كتب الله ضلالهم \"وما لهم من ناصرين\" أي ليس لهم من قدرة الله منقذ ولا مجير ولا محيد لهم عنه لأنه ما شاء كان وما لم يشأ لم يكن."
    },
    {
      "ayah": 3,
      "surah": 30,
      "text": "نزلت هذه الآيات حين غلب سابور ملك الفرس على بلاد الشام وما والاها من بلاد الجزيرة وأقاصي بلاد الروم فاضطر هرقل ملك الروم حتى ألجأه إلى القسطنطينية وحاصره فيها مدة طويلة ثم عادت الدولة لهرقل كما سيأتي. وقال الإمام أحمد حدثنا معاوية بن عمر وحدثنا أبو إسحاق عن سفيان الثوري عن حبيب بن أبي عمرة عن سعيد بن جبير عن ابن عباس رضي الله عنه في قوله تعالى: \"الم غلبت الروم في أدنى الأرض\" قال غلبت وغلبت قال كان المشركون يحبون أن تظهر فارس على الروم لأنهم أصحاب أوثان. وكان المسلمون يحبون أن تظهر الروم على فارس لأنهم أهل الكتاب. فذكر ذلك لأبي بكر فذكره أبو بكر لرسول الله صلى الله عليه وسلم فقال رسول الله صلى الله عليه وسلم: \"أما إنهم سيغلبون\" فذكره أبو بكر لهم فقالوا اجعل بيننا وبينك أجلا فإن ظهرنا كان لنا كذا وكذا وإن ظهرتم كان لكم كذا وكذا فجعل أجل خمس سنين فلم يظهروا فذكر ذلك أبو بكر لرسول الله صلى الله عليه وسلم فقال: \"ألا جعلتها إلى دون أراه قال العشر-\" قال سعيد بن جبير البضع ما دون العشر ثم ظهرت الروم بعد قال فذلك قوله: \"الم غلبت الروم في أدنى الأرض وهم من بعد غلبهم سيغلبون -إلى قوله - وهو العزيز الرحيم\" هكذا رواه الترمذي والنسائي جميعا عن الحسين بن حريث عن معاوية بن عمرو عن أبي إسحاق الفزاري عن سفيان الثوري به وقال الترمذي حديث حسن غريب إنما نعرفه من حديث سفيان عن حبيب ورواه ابن أبي حاتم عن محمد بن إسحاق الصنعاني عن معاوية بن عمرو به. ورواه ابن جرير حدثنا محمد بن المثنى حدثنا محمد بن سعيد أو سعيد الثعلبي الذي يقال له أبو سعد من أهل طرسوس حدثنا أبو إسحاق الفزاري فذكره وعندهم قال سفيان فبلغني أنهم غلبوا يوم بدر \"حديث آخر\" قال سليمان بن مهران الأعمش عن مسلم عن مسروق قال: قال عبدالله خمس قد مضين: الدخان واللزام والبطشة والقمر والروم أخرجاه. وقال ابن جرير حدثنا ابن وكيع حدثنا المحاربي عن داود بن أبي هند عن عامر- هو الشعبي - عن عبدالله بن مسعود رضي الله عنه قال: كانت فارس ظاهرة على الروم وكان المشركون يحبون أن تظهر فارس على الروم. وكان المسلمون يحبون أن تظهر الروم على فارس لأنهم أهل كتاب. وهم أقرب إلى دينهم فلما نزلت \"الم غلبت الروم في أدنى الأرض وهم من بعد غلبهم سيغلبون في بضع سنين\" قالوا يا أبا بكر إن صاحبك يقول إن الروم تظهر على فارس في بضع سنين: قال صدق قالوا هل لك أن تقامرك فبايعوه على أربع قلائص إلى سبع سنين فمضت السبع ولم يكن شيء ففرح المشركون بذلك فشق على المسلمين فذكر ذلك للنبي صلى الله عليه وسلم فقال: \"ما بضع سنين عندكم؟\" قالوا دون العشر قال: \"اذهب فزايدهم وازدد سنتين في الأجل \"قال فما مضت السنتان حتى جاءت الركبان بظهور الروم على فارس ففرح المؤمنون بذلك وأنزل الله تعالى: \"الم غلبت الروم - إلى قوله تعالى - وعد الله لا يخلف الله وعده\". \"حديث آخر\" قال ابن أبي حاتم حدثنا علي بن الحسين حدثنا أحمد بن عمر الوكيعي حدثنا مؤمن عن إسرائيل عن أبي إسحاق عن البراء قال لما نزلت \"الم غلبت الروم في أدنى الأرض وهم من بعد غلبهم سيغلبون\" قال المشركون لأبي بكر ألا ترى إلى ما يقول صاحبك يزعم أن الروم تغلب فارس قال صدق صاحبي قالوا هل لك أن نخاطرك فجعل بينه وبينهم أجلا فحل الأجل قبل أن تغلب الروم فارس فبلغ ذلك النبي صلى الله عليه وسلم وساءه ذلك وكرهه وقال لأبي بكر \"ما دعاك إلى هذا؟\" قال تصديقا لله ولرسوله قال: \"تعرض لهم وأعظم لهم الخطر واجعله إلى بضع سنين\" فأتاهم أبا بكر فقال هل لكم في العود فإن العود أحمد؟ قالوا نعم فلم تمض تلك السنين حتى غلبت الروم فارس وربطوا خيولهم بالمدائن وبنوا الرومية فجاء أبو بكر إلى النبي صلى الله عليه وسلم فقال هذا السحت قال \"تصدق به\" \"حديث آخر\" قال أبو عيسى الترمذي حدثنا محمد بن إسماعيل حدثنا إسماعيل بن أبي أويس أخبرني ابن أبي الزناد عن عروة بن الزبير عن نيار بن مكرم الأسلمي قال: لما نزلت \"الم غلبت الروم في أدنى الأرض وهم من بعد غلبهم سيغلبون في بضع سنين\" فكانت فارس يوم نزلت هذه الآية قاهرين للروم وكان المسلمون يحبون ظهور الروم عليهم لأنهم وإياهم أهل كتاب وفي ذلك قوله تعالى: \"يومئذ يفرح المؤمنون بنصر الله ينصر من يشاء وهو العزيز الرحيم\" وكانت قريش تحب ظهور فارس لأنهم وإياهم ليسوا بأهل كتاب ولا إيمان يبعث فلما أنزل الله هذه الآية خرج أبو بكر يصيح في نواحي مكة \"الم غلبت الروم في أدنى الأرض وهم من بعد غلبهم سيغلبون في بضع سنين\" فقال ناس من قريش لأبي بكر فذاك بيننا وبينكم زعم صاحبكم أن الروم ستغلب فارس في بضع سنين أفلا نراهنك على ذلك؟ قال بلى وذلك قبل تحريم الرهان فارتهن أبو بكر والمشركون وتواضعوا الرهان وقالوا لأبي بكر كم نجعل البضع ثلاث سنين إلى تسع سنين فسم بيننا وبينك وسطا ننتهي إليه قالوا فسموا بينهم ست سنين قال فمضت ست السنين قبل أن يظهروا فأخذ المشركون رهن أبي بكر فلما دخلت السنة السابعة ظهرت الروم على فارس قال فعاب المسلمون على أبي بكر تسميته ست سنين قال لأن الله يقول في بضع سنين قال فأسلم عند ذلك ناس كثير. هكذا ساقه الترمذي ثم قال هذا حديث حسن صحيح لا نعرفه إلا من حديث عبدالرحمن بن أبي الزناد وقد روي نحو هذا مرسلا عن جماعة من التابعين مثل عكرمة والشعبي ومجاهد وقتادة والسدي والزهري وغيرهم ومن أغرب هذه السياقات ما رواه الإمام سنيد بن داود في تفسيره حيث قال حدثني حجاج عن أبي بكر عن عكرمة قال: كان في فارس امرأة لا تلد إلا الملوك والأبطال فدعاها كسرى فقال إني أريد أن أبعث إلى الروم جيشا وأستعمل عليه رجلا من بنيك فأشيري علي أيهم أستعمل؟ فقالت هذا فلان وهو أروغ من ثعلب واحذر من صقر وهذا فرخان وهو أنفذ من سنان وهذا شهريراز وهو أحلم من كذا تعني أولادها الثلاثة فاستعمل أيهم شئت قال فإني استعملت الحليم فاستعمل شهريراز فسار إلى الروم بأهل فارس فظهر عليهم فقتلهم وخرب مدائنهم وقطع زيتونهم قال أبو بكر بن عبدالله فحدث بهذا الحديث عطاء الخراساني فقال أما رأيت بلاد الشام؟ قلت لا قال أما إنك لو رأيتها لرأيت المدائن التي خربت والزيتون الذي قطع فأتيت الشام بعد ذلك فرأيته قال عطاء الخراساني حدثني يحيى بن يعمر أن قيصر بعث رجلا يدعى قطمة بجيش من الروم وبعث كسرى شهريراز فالتقيا بين أذرعات وبصرى وهي أدنى الشام إليكم فلقيت فارس الروم فغلبتهم فارس ففرحت بذلك كفار قريش وكرهه المسلمون قال عكرمة: ولقي المشركون أصحاب النبي صلى الله عليه وسلم وقالوا إنكم أهل كتاب والنصارى أهل كتاب ونحن أميون وقد ظهر إخواننا من أهل فارس على إخوانكم من أهل الكتاب وإنكم إن قاتلتمونا لنظهرن عليكم فأنزل الله تعالى: \"الم غلبت الروم في أدنى الأرض - إلى قوله - ينصر من يشاء\" فخرج أبو بكر الصديق إلى الكفار فقال: أفرحتم بظهور إخوانكم على إخواننا فلا تفرحوا ولا يقرن الله أعينكم فوالله ليظهرن الله الروم على فارس أخبرنا بذلك نبينا صلى الله عليه وسلم فقام إليه أبي بن خلف فقال كذبت يا أبا فضيل فقال له أبو بكر: أنت أكذب يا عدو الله فقال أناحبك عشر قلائص مني وعشر قلائص منك فإن ظهرت الروم على فارس غرمت وإن ظهرت فارس غرمت إلى ثلاث سنين ثم جاء أبو بكر إلى النبي صلى الله عليه وسلم فأخبره فقال: \"ما هكذا ذكرت إنما البضع ما بين الثلاث إلى التسع فزايده في الخطر وماده في الأجل\" فخرج أبو بكر فلقي أبيا فقال لعلك ندمت؟ فقال لا تعال أزايدك في الخطر وأمادك في الأجل فاجعلها مائة قلوص إلى تسع سنين قال قد فعلت فظهرت الروم على فارس قبل ذلك فغلبهم المسلمون. قال عكرمة لما أن ظهرت فارس على الروم جلس فرخان يشرب وهو أخو شهريراز فقال لأصحابه لقد رأيت كأني جالس على سرير كسرى فبلغت كسرى فكتب كسرى إلى شهريراز إذا أتاك كتابي فابعث إلي برأس فرخان فكتب إليه شهريراز أيها الملك إنك لن تجد مثل فرخان له نكاية وصوت في العدو فلا تفعل فكتب إليه إن في رجال فارس خلفا منه فعجل إلي برأسه. فراجعه فغضب كسرى فلم يجبه وبعث بريدا إلى أهل فارس إني قد نزعت عنكم شهريراز واستعملت عليكم فرخان ثم رفع إلى البريد صحيفة لطيفة صغيرة فقال إذا ولى فرخان الملك وانقاد له أخوه فأعطه هذه فلما قرأ شهريراز الكتاب قال سمعا وطاعة ونزل عن سريره وجلس عليه فرخان ورفع إليه الصحيفة اللطيفة فلما قرأها قال ائتوني بشهريراز وقدمه ليضرب عنقه فقال شهريراز لا تعجل حتى أكتب وصيتي قال نعم فدعا بالسفط فأعطاه الصحائف فقال كل هذا راجعت فيك كسرى وأنت أردت أن تقتلني بكتاب واحد فرد الملك إلى أخيه شهريراز وكتب شهريراز إلى قيصر ملك الروم إن لي إليك حاجة لا تحملها البرد ولا تحملها الصحف فالقني ولا تلقني إلا في خمسين روميا فإني لا ألقاك إلا في خمسين فارسيا. فأقبل قيصر في خمسمائة رومي وجعل يضع العيون بين يديه في الطريق وخاف أن يكون قد مكر به حتى أتاه عيونه بأنه ليس معه إلا خمسون رجلا ثم بسط لهما والتقيا في قبة ديباج ضربت لهما مع كل واحد منهما سكين فدعيا ترجمانا بينهما فقال شهريراز إن الذين خربوا مدائنك أنا وأخي بكيدنا وشجاعتنا وإن كسرى حسدنا وأراد أن أقتل أخي فأبيت ثم أمر أخي أن يقتلني فقد خلعنا جميعا فنحن نقاتله معك. قال قد أصبتما ثم أشار أحدهما إلى صاحبه أن السر بين اثنين فإذا جاوز اثنين فشا قال أجل فقتلا الترجمان جميعا بسكينيهما فأهلك الله كسرى وجاء الخبر إلى رسول الله صلى الله عليه وسلم يوم الحديبية ففرح والمسلمون معه. فهذا سياق غريب وبناء عجيب. ولنتكلم على كلمات هذه الآيات الكريمات فقوله تعالى: \"الم غلبت الروم\" قد تقدم الكلام على الحروف المقطعة في أوائل السور في أول سورة البقرة وأما الروم فهم من سلالة العيص بن إسحاق بن إبراهيم وهم أبناء عم بني إسرائيل ويقال لهم بنو الأصفر وكانوا على دين اليونان واليونان من سلالة يافث بن نوح أبناء عم الترك وكانوا يعبدون الكواكب السيارة السبعة ويقال لها المتحيرة ويصلون إلى القطب الشمالي وهم الذين أسسوا دمشق وبنوا معبدها وفيه محاريب إلى جهة الشمال فكان الروم على دينهم إلى بعد مبعث المسيح بنحو من ثلاث مائة سنة وكان من ملك منهم الشام مع الجزيرة يقال له قيصر فكان أول من دخل في دين النصارى من ملوك الروم قسطنطين بن قسطس وأمه مريم الهيلانية الغندقانية من أرض حران كانت قد تنصرت قبله فدعته إلى دينها وكان قبل ذلك فيلسوفا فتابعها يقال تقية واجتمعت به النصارى وتناظروا في زمانه مع عبدالله بن أريوس واختلفوا اختلافا كثيرا منتشرا متشتتا لا ينضبط إلا أنه اتفق من جماعتهم ثلاث مائة وثمانية عشر أسقفا فوضعوا لقسطنطين العقيدة وهي التي يسمونها الأمانة الكبيرة وإنما هي الخيانة الحقيرة ووضعوا له القوانين يعنون كسب الأحكام من تحريم وتحليل وغير ذلك مما يحتاجون إليه وغيروا دين المسيح عليه السلام وزادوا فيه ونقصوا من فصلوا إلى المشرق واعتاضوا عن السبت بالأحد وعبدوا الصليب وأحلوا الخنزير واتخذوا أعيادا أحدثوها كعيد الصليب والقداس والغطاس وغير ذلك من البواعيث والشعابين وجعلوا له الباب وهو كبيرهم ثم البتاركة ثم المطارنة ثم الأساقفة والقساقسة ثم الشمامسة وابتدعوا الرهبانية وبنى لهم الملك الكنائس والمعابد وأسس المدينة المنسوبة إليه وهي القسطنطينية يقال إنه بنى في أيامه اثنى عشر ألف كنيسة وبنى بيت لحم بثلاث محاريب وبنت أمه القمامة وهؤلاء هم الملكية يعنون الذين هم على دين الملك ثم حدثت بعدهم اليعقوبية أتباع يعقوب الأسكاف ثم النسطورية أصحاب نسطورا وهم فرق وطوائف كثيرة كما قال رسول الله صلى الله عليه وسلم: \"إنهم افترقوا على اثنتين وسبعين فرقة\" والغرض أنهم استمروا على النصرانية كلما هلك قيصر خلفه آخر بعده حتى كان آخرهم هرقل وكان من عقلاء الرجال ومن أحزم الملوك وأدهاهم وأبعدهم غورا وأقصاهم رأيا فتملك عليهم في رياسة عظيمة وأبهة كثيرة فناوأه كسرى ملك الفرس وملك البلاد كالعراق وخراسان والري وجميع بلاد العجم وهو سابور ذو الأكتاف وكانت مملكته أوسع من مملكة قيصر وله رياسة العجم وحماقة الفرس وكانوا مجوسا يعبدون النار فتقدم عن عكرمة أنه قال بعث إليه نوابه وجيشه فقاتلوه والمشهور أن كسرى غزاه بنفسه في بلاده فقهره وكسره وقصره حتى لم يبق معه سوى مدينة قسطنطينية فحاصره بهامدة طويلة حتى ضاقت عليه وكانت النصارى تعظمه تعظيما زائدا ولم يقدر كسرى على فتح البلد ولا أمكنه ذلك لحصانتها لأن نصفها من ناحية البر ونصفها الآخر من ناحية البحر فكانت تأتيهم الميرة والمدد من هنالك فلما طال الأمر دبر قيصر مكيدة ورأى في نفسه خديعة فطلب من كسرى أن يقلع من بلاده على مال يصالحه عليه ويشترط عليه ما شاء فأجابه إلى ذلك وطلب منه أموالا عظيمة لا يقدر عليها أحد من ملوك الدنيا من ذهب وجواهر وأقمشة وجوار وخدام وأصناف كثيره فطاوعه قيصر وأوهمه أن عنده جميع ما طلب واستقل عقله لما طلب منه ما طلب ولو اجتمع هو وإياه لعجزت قدرتهما عن جمع عشره وسأل من كسرى أن يمكنه من الخروج إلى بلاد الشام وأقاليم مملكته ليسعى في تحصيل ذلك من ذخائره وحواصله ودفائنه فأطلق سراحه فلما عزم قيصر على الخروج من مدينة قسطنطينية جمع أهل ملته وقال: إني خارج في أمر قد أبرمته في جند قد عينته من جيشي فإن رجعت إليكم قبل الحول فأنا ملككم وإن لم أرجع إليكم قبلها فأنتم بالخيار إن شئتم استمررتم على بيعتي وإن شئتم وليتم عليكم غيري فأجابوه بأنك ملكنا ما دمت حيا ولو غبت عشرة أعوام فلما خرج من القسطنطينية خرج جريدة في جيش متوسط هذا وكسرى مخيم على القسطنطينية ينتظره ليرجع فركب قيصر من فوره وسار مسرعا حتى انتهى إلى بلاد فارس فعاث في بلادهم قتلا لرجالها ومن بها من المقاتلة أولا فأولا ولم يزل يقتل حتى انتهى إلى المدائن وهي كرسي مملكة كسرى فقتل من بها وأخذ جميع حواصله وأمواله وأسر نساءه وحريمه وحلق رأس ولده وركبه على حمار وبعث معه من الأساورة من قومه في غاية الهوان والذلة وكتب إلى كسرى يقول هذا ما طلبت فخذه فلما بلغ ذلك كسرى أخذه من الغم ما لا يحصيه إلا الله تعالى واشتد حنقه على البلد فجد في حصارها بكل ممكن فلم يقدر على ذلك فلما عجز ركب ليأخذ عليه الطريق من مخاضة جيحون التي لا سبيل لقيصر إلى القسطنطينية إلا منها فلما علم قيصر بذلك احتال بحيلة عظيمة لم يسبق إليها وهو أنه أرصد جنده وحواصله التي معه عند فم المخاضة وركب في بعض الجيش وأمر بأحمال من التبن والبعر والروث فحملت معه وسار إلى قريب من يوم في الماء مصعدا ثم أمر بإلقاء تلك الأحمال في النهر فلما مرت بكسرى وجنده ظن أنهم قد خاضوا من هنالك فركبوا في طلبهم فشغرت المخاضة عن الفرس وقدم قيصر فأمرهم بالنهوض والخوض فخاضوا وأسرعوا السير ففاتوا كسرى وجنوده ودخلوا القسطنطينية فكان ذلك يوما مشهودا عند النصارى وبقي كسرى وجيوشه حائرين لا يدرون ماذا يصنعون لم يحصلوا على بلاد قيصر وبلادهم قد خربتها الروم وأخذوا حواصلهم وسبوا ذراريهم ونساءهم فكان هذا من غلب الروم لفارس وكان ذلك بعد تسع سنين من غلب فارس للروم وكانت الوقعة الكائنة بين فارس والروم حين غلبت الروم بين أذرعات وبصرى على ما ذكره ابن عباس وعكرمة وغيرهما وهي طرف بلاد الشام مما يلي بلاد الحجاز وقال مجاهد كان ذلك في الجزيرة وهي أقرب بلاد الروم من فارس فالله أعلم. ثم كان غلب الروم لفارس بعد بضع سنين وهي تسع فإن البضع في كلام العرب ما بين الثلاث إلى التسع. وكذلك جاء في الحديث الذي رواه الترمذي وابن جرير وغيرهما من حديث عبدالله بن عبدالرحمن الجمحي عن الزهري عن عبيد الله بن عبدالله عن ابن عباس أن رسول الله صلى الله عليه وسلم قال لأبي بكر في مناحبة \"الم غلبت الروم\" الآية \"ألا احتطت يا أبا بكر فإن البضع ما بين ثلاث إلى تسع؟\" ثم قال هذا حديث حسن غريب من هذا الوجه. وروى ابن جرير عن عبدالله بن عمرو أنه قال ذلك والله أعلم."
    },
    {
      "ayah": 30,
      "surah": 30,
      "text": "يقول تعالى: فسدد وجهك واستمر على الدين الذي شرعه الله لك من الحنيفية ملة إبراهيم الذي هداك الله لها وكملها لك غاية الكمال وأنت مع ذلك لازم فطرتك السليمة التي فطر الله الخلق عليها فإنه تعالى فطر خلقه على معرفته وتوحيده وأنه لا إله غيره كما تقدم عند قوله تعالى \"وأشهدهم على أنفسهم ألست بربكم قالوا بلى\" وفي الحديث \"إني خلقت عبادي حنفاء فاجتالتهم الشياطين عن دينهم\" وسنذكر في الأحاديث أن الله تعالى فطر خلقه على الإسلام ثم طرأ على بعضهم الأديان الفاسدة كاليهودية والنصرانية والمجوسية. وقوله تعالى \"لا تبديل لخلق الله\" قال بعضهم معناه لا تبدلوا خلق الله فتغيروا الناس عن فطرتهم التي فطرهم الله عليها فيكون خبرا بمعنى الطلب كقوله تعالى \"ومن دخله كان آمنا\" وهو معنى حسن صحيح وقال آخرون هو خبر على بابه ومعناه أنه تعالى ساوى بين خلقه كلهم في الفطرة على الجبلة المستقيمة لا يولد أحد إلا على ذلك ولا تفاوت بين الناس في ذلك. ولهذا قال ابن عباس وإبراهيم النخعي وسعيد بن جبير ومجاهد وعكرمة وقتادة والضحاك وابن زيد في قوله \"لا تبديل لخلق الله\" أي لدين الله وقال البخاري قوله \"لا تبديل لخلق الله\" لدين الله خلق الأولين دين الأولين الدين والفطرة الإسلام. حدثنا عبدان أخبرنا عبدالله أخبرنا يونس عن الزهري أخبرني أبو سلمة بن عبدالرحمن أن أبا هريرة قال: قال رسول الله صلى الله عليه وسلم \"ما من مولود يولد إلا على الفطرة فأبواه يهودانه أو ينصرانه أو يمجسانه كما تنتج البهيمة بهيمة جمعاء هل تحسون فيها من جدعاء\" ثم يقول \"فطرت الله التي فطر الناس عليها لا تبديل لخلق الله ذلك الدين القيم\" ورواه مسلم من حديث عبدالله بن وهب عن يونس بن يزيد الأيلي عن الزهري به وأخرجاه أيضا من حديث عبدالرزاق عن معمر عن همام عن أبي هريرة رضي الله عنه عن النبي صلى الله عليه وسلم وفي معنى هذا الحديث قد وردت أحاديث عن جماعة من الصحابة. فمنهم الأسود بن سريع التميمي. قال الإمام أحمد حدثنا إسماعيل حدثنا يونس عن الحسن عن الأسود بن سريع قال: أتيت رسول الله صلى الله عليه وسلم وغزوت معه فأصبت ظفرا فقاتل الناس يومئذ حتى قتلوا الولدان فبلغ ذلك رسول الله صلى الله عليه وسلم فقال \"ما بال أقوام جاوزهم القتل اليوم حتى قتلوا الذرية؟\" فقال رجل يا رسول الله أما هم أبناء المشركين فقال \"لا إنما خياركم أبناء المشركين\" ثم قال - \"لا تقتلوا ذرية لا تقتلوا ذرية\" - وقال - \"كل نسمة تولد على الفطرة حتى يعرب عنها لسانها فأبواها يهودانها أو ينصرانها \"ورواه النسائي في كتاب السير عن زياد بن أيوب عن هشيم عن يونس وهو ابن عبيد عن الحسن البصري به. ومنهم جابر بن عبدالله الأنصاري قال الإمام أحمد حدثنا هاشم ثنا أبو جعفر عن الربيع بن أنس عن الحسن عن جابر عن عبدالله قال: قال رسول الله صلى الله عليه وسلم \"كل مولود يولد على الفطرة حتى يعرب عنه لسانه فإذا عبر عنه لسانه إما شاكرا وإما كفورا\" ومنهم عبدالله بن عباس الهاشمي قال الإمام أحمد حدثنا عفان حدثنا أبو عوانة حدثنا أبو بشر عن سعيد بن جبير عن ابن عباس رضي الله عنهما \"أن رسول الله صلى الله عليه وسلم سئل عن أولاد المشركين فقال \"الله أعلم بما كانوا عاملين إذ خلقهم\" أخرجاه في الصحيحين من حديث أبي بشر جعفر بن إياس اليشكري عن سعيد بن جبير عن ابن عباس مرفوعا بذلك وقد قال الإمام أحمد أيضا حدثنا عفان حدثنا حماد يعني ابن سلمة أنبأنا عمار بن أبي عمار عن ابن عباس قال: أتى علي زمان وأنا أقول أولاد المسلمين مع المسلمين وأولاد المشركين مع المشركين حتى حدثني فلان عن فلان أن رسول الله صلى الله عليه وسلم سئل عن أولاد المشركين فقال \"الله أعلم بما كانوا عاملين\" قال فلقيت الرجل فأخبرني فأمسكت عن قولي ومنهم عياض بن حمار المجاشعي قال الإمام أحمد حدثنا يحيى بن سعيد حدثنا هشام عن قتادة عن مطرف عن عياض بن حمار أن رسول الله صلى الله عليه وسلم خطب ذات يوم فقال في خطبته \"إن ربي عز وجل أمرني أن أعلمكم ما جهلتم مما علمني في يومي هذا: كل ما نحلته عبادي حلال. وإني خلقت عبادي حنفاء كلهم وإنهم أتتهم الشياطين فأضلتهم عن دينهم وحرمت عليهم ما أحللت لهم وأمرتهم أن يشركوا بي ما لم أنزل به سلطانا ثم إن الله عز وجل نظر إلى أهل الأرض فمقتهم عربهم وعجمهم إلا بقايا من أهل الكتاب وقال إنما بعثتك لأبتليك وأبتلي بك وأنزلت عليك كتابا لا يغسله الماء تقرؤه نائما ويقظان ثم إن الله أمرني أن أحرق قريشا فقلت رب إذا يثلغ رأسي فيدعه خبزة قال استخرجهم كما استخرجوك واغزهم نغزك وأنفق فسننفق عليك وابعث جيشا نبعث خمسة مثله وقاتل بمن أطاعك من عصاك قال: وأهل الجنة ثلاثة ذو سلطان مقسط متصدق موفق ورجل رحيم رقيق القلب لكل ذي قربى ومسلم ورجل عفيف متعفف ذو عيال - قال - وأهل النار خمسة: الضعيف الذي لا زبر له الذين هم فيكم تبع لا يبتغون أهلا ولا مالا والخائن الذي لا يخفى له طمع وإن دق إلا خانه ورجل لا يصبح ولا يمسي إلا وهو يخادعك عن أهلك ومالك\" وذكر البخيل والكذاب والشنظير الفحاش انفرد بإخراجه مسلم فرواه من طرق عن قتادة به وقوله تعالى \"ذلك الدين القيم\" أي التمسك بالشريعة والفطرة السليمة هو الدين القيم المستقيم \"ولكن أكثر الناس لا يعلمون\" أي فلهذا لا يعرفه أكثر الناس فهم عنه ناكبون كما قال تعالى \"وما أكثر الناس ولو حرصت بمؤمنين\" وقال تعالى \"وإن تطع أكثر من في الأرض يضلوك عن سبيل الله\" الآية."
    },
    {
      "ayah": 31,
      "surah": 30,
      "text": "قوله تعالى \"منيبين إليه\" قال ابن زيد وابن جريج أي راجعين إليه \"واتقوه\" أي خافوه وراقبوه \"وأقيموا الصلاة\" وهي الطاعة العظيمة \"ولا تكونوا من المشركين\" أي بل كونوا من الموحدين المخلصين له العبادة لا يريدون بها سواه. قال ابن جرير حدثني يحيى بن واضح حدثنا يونس عن ابن إسحاق عن يزيد بن أبي مريم قال مر عمر رضي الله عنه بمعاذ بن جبل فقال عمر ما قوام هذه الأمة؟ قال معاذ ثلاث وهن المنجيات: الإخلاص وهي الفطرة فطرة الله التي فطر الناس عليها والصلاة وهي الملة والطاعة وهي العصمة فقال عمر صدقت. حدثني يعقوب أنبأنا ابن علية أنبأنا أيوب عن أبي قلابة أن عمر رضي الله عنه قال لمعاذ ما قوام هذا الأمر؟ فذكر نحوه."
    },
    {
      "ayah": 32,
      "surah": 30,
      "text": "وقوله تعالى \"من الذين فرقوا دينهم وكانوا شيعا كل حزب بما لديهم فرحون\" أي لا تكونوا من المشركين الذين قد فرقوا دينهم أي بدلوه وغيروه وآمنوا ببعض وكفروا ببعض وقرأ بعضهم فارقوا دينهم أي تركوه وراء ظهورهم وهؤلاء كاليهود والنصارى والمجوس وعبدة الأوثان وسائر أهل الأديان الباطلة مما عدا أهل الإسلام كما قال تعالى \"إن الذين فرقوا دينهم وكانوا شيعا لست منهم في شيء إنما أمرهم إلى الله \"الآية فأهل الأديان قبلنا اختلفوا فيما بينهم على آراء ومثل باطلة. وكل فرقة منهم تزعم أنهم على شيء وهذه الأمة أيضا اختلفوا فيما بينهم على نحل كلها ضلاله إلا واحدة وهم أهل السنة والجماعة المتمسكون بكتاب الله وسنة رسوله صلى الله عليه وسلم وبما كان عليه الصدر الأول من الصحابة والتابعين وأئمة المسلمين من قديم الدهر وحديثه كما رواه الحاكم في مستدركه أنه سئل صلى الله عليه وسلم عن الفرقة الناجية منهم فقال \"من كان على ما أنا عليه اليوم وأصحابي\"."
    },
    {
      "ayah": 33,
      "surah": 30,
      "text": "يقول تعالى مخبرا عن الناس أنهم في حال الاضطرار يدعون الله وحده لا شريك له وأنه إذا أسبغ عليهم النعم إذا فريق منهم في حالة الاختيار يشركون بالله ويعبدون معه غيره."
    },
    {
      "ayah": 34,
      "surah": 30,
      "text": "قوله تعالى \"ليكفروا بما آتيناهم\" هي لام العاقبة عند بعضهم ولام التعليل عند آخرين ولكنها تعليل لتقييض الله لهم ذلك ثم توعدهم بقوله \"فسوف تعلمون\" قال بعضهم والله لو توعدني حارس درب لخفت منه فكيف والمتوعد ههنا هو الذي يقول للشيء كن فيكون ثم قال تعالى منكرا على المشركين فيما اختلفوا فيه من عبادة غيره بلا دليل ولا حجة ولا برهان."
    },
    {
      "ayah": 35,
      "surah": 30,
      "text": "\"أم أنزلنا عليهم سلطانا\" أي حجة \"فهو يتكلم\" أي ينطق \"بما كانوا به يشركون\" وهذا استفهام إنكار أي لم يكن لهم شيء من ذلك."
    },
    {
      "ayah": 36,
      "surah": 30,
      "text": "قال تعالى \"وإذا أذقنا الناس رحمة فرحوا بها وإن تصبهم سيئة بما قدمت أيديهم إذا هم يقنطون \"هذا إنكار على الإنسان من حيث هو إلا من عصمه الله ووفقه فإن الإنسان إذا أصابته نعمة بطر. وقال \"ذهب السيئات عني إنه لفرح فخور\" أي يفرح في نفسه ويفخر على غيره وإذا أصابه شدة قنط وأيس أن يحصل له بعد ذلك خير بالكية. قال الله تعالى \"إلا الذين صبروا وعملوا الصالحات\" أي صبروا في الضراء وعملوا الصالحات في الرخاء كما ثبت في الصحيح \"عجبا للمؤمن لا يقضي الله له قضاء إلا كان خيرا له إن أصابته سراء شكر فكان خيرا له وإن أصابته ضراء صبر فكان خيرا له\"."
    },
    {
      "ayah": 37,
      "surah": 30,
      "text": "قوله تعالى \"أو لم يروا أن الله يبسط الرزق لمن يشاء ويقدر\" أي هو المتصرف الفاعل لذلك بحكمته وعدله فيوسع على قوم ويضيق على آخرين \"إن في ذلك لآيات لقوم يؤمنون\"."
    },
    {
      "ayah": 38,
      "surah": 30,
      "text": "يقول تعالى آمرا بإعطاء \"ذي القربى حقه\" أي من البر والصلة \"والمسكين\" وهو الذي لا شيء له ينفق عليه أو له شيء لا يقوم بكفايته \"وابن السبيل\" وهو المسافر المحتاج إلى نفقة وما يحتاج إليه في سفره \"ذلك خير للذين يريدون وجه الله\" أي النظر إليه يوم القيامة وهو الغاية القصوى \"وأولئك هم المفلحون\" أي في الدنيا والآخرة."
    },
    {
      "ayah": 39,
      "surah": 30,
      "text": "قال تعالى \"وما آتيتم من ربا ليربوا في أموال الناس فلا يربوا عند الله\" أي من أعطى عطية يريد أن يرد عليه الناس أكثر مما أهدى لهم فهذا لا ثواب له عند الله بهذا فسره ابن عباس ومجاهد والضحاك وقتادة وعكرمة ومحمد بن كعب والشعبي وهذا الصنيع مباح وإن كان لا ثواب فيه إلا أنه قد نهى عنه رسول الله صلى الله عليه وسلم خاصة قاله الضحاك واستدل بقوله تعالى \"ولا تمنن تستكثر\" أي لا تعط العطاء تريد أكثرت منه وقال ابن عباس: الربا رباءان فربا لا يصح يعني ربا البيع وربا لا بأس به وهو هدية الرجل يريد فضلتها وأضعافها ثم تلا هذه الآية \"وما آتيتم من ربا ليربو في أموال الناس فلا يربو عند الله\" وإنما الثواب عند الله في الزكاة ولهذا قال تعالى \"وما آتيتم من زكاة تريدون وجه الله فأولئك هم المضعفون\" أي الذين يضاعف الله لهم الثواب والجزاء كما جاء في الصحيح \"وما تصدق أحد بعدل تمرة من كسب طيب إلا أخذها الرحمن بيمينه فيربيها لصاحبها كما يربي أحدكم فلوه أو فصيله حتى تصير التمرة أعظم من أحد\"."
    },
    {
      "ayah": 4,
      "surah": 30,
      "text": "قوله تعالى: \"لله الأمر من قبل ومن بعد\" أي من قبل ذلك ومن بعده فبنى على الضم لما قطع المضاف وهو قوله قبل عن الإضافة ونويت \"ويومئذ يفرح المؤمنون بنصر الله\" أي للروم أصحاب قيصر ملك الشام على فارس أصحاب كسرى وهم المجوس وكانت نصرة الروم على فارس يوم وقعة بدر في قول طائفة كثيرة من العلماء كابن عباس والثوري والسدي وغيرهم. وقد ورد في الحديث الذي رواه الترمذي وابن جرير وابن أبي حاتم والبزار من حديث الأعمش عن عطية عن أبي سعيد قال: لما كان يوم بدر ظهرت الروم على فارس فأعجب ذلك المؤمنين ففرحوا به وأنزل الله \"ويومئذ يفرح المؤمنون بنصر الله ينصر من يشاء وهو العزيز الرحيم\" وقال الآخرون بل كان نصر الروم على فارس عام الحديبية. قاله عكرمة والزهري وقتادة وغير واحد ووجه بعضهم هذا القول بأن قيصر كان قد نذر لئن أظفره الله بكسرى ليمشين من حمص إلى إيليا وهو بيت المقدس شكرا لله تعالى ففعل فلما بلغ بيت المقدس لم يخرج منه حتى وافاه كتاب رسول الله صلى الله عليه وسلم الذي بعثه مع دحية بن خليفة فأعطاه دحية لعظيم بصرى فدفعه عظيم بصرى إلى قيصر فلما وصل إليه سأل من بالشام من عرب الحجاز فأحضر له أبو سفيان صخر بن حرب الأموي في جماعة من كبار قريش وكانوا بغزة فجيء بهم إليه فجلسوا بين يديه فقال أيكم أقرب نسبا بهذا الرجل الذي يزعم أنه نبي؟ فقال أبو سفيان أنا فقال لأصحابه وأجلسهم خلفه إني سائل هذا عن هذا الرجل فإن كذب فكذبوه فقال أبو سفيان فوالله لولا أن يأثروا علي الكذب لكذبت فسأله هرقل عن نسبه وصفته فكان فيما سأله أن قال: فهل يغدر؟ قال قلت لا ونحن منه في مدة لا ندري ما هو صانع فيها يعني بذلك الهدنة التي كانت قد وقعت بين رسول الله صلى الله عليه وسلم وكفار قريش عام الحديبية على وضع الحرب بينهم عشر سنين فاستدلوا بهذا على أن نصر الروم على فارس كان عام الحديبية لأن قيصر إنما وفى بنذره بعد الحديبية والله أعلم. ولأصحاب القول الأول أن يجيبوا عن هذا بأن بلاده كانت قد خربت وتشعبت فما تمكن من وفاء نذره حتى أصلح ما ينبغي له إصلاحه وتفقد بلاده ثم بعد أربع سنين من نصرته وفى بنذره والله أعلم. والأمر في هذا سهل قريب إلا أنه لما اقتصرت فارس على الروم ساء ذلك المؤمنين فلما انتصرت الروم على فارس فرح المؤمنون بذلك لأن الروم أهل كتاب في الجملة فهم أقرب إلى المؤمنين من المجوس كما قال تعالى: \"لتجدن أشد الناس عداوة للذين آمنوا اليهود والذين أشركوا ولتجدن أقربهم مودة للذين آمنوا الذين قالوا إنا نصارى - إلى قوله - ربنا آمنا فاكتبنا مع الشاهدين\" وقال تعالى ههنا \"ويومئذ يفرح المؤمنون بنصر الله ينصر من يشاء وهو العزيز الرحيم\". وقال ابن أبي حاتم حدثنا أبو زرعة حدثنا صفوان حدثنا الوليد حدثني أسيد الكلابي قال سمعت العلاء بن الزبير الكلابي يحدث عن أبيه قال رأيت غلبة فارس الروم ثم رأيت غلبة الروم فارس. ثم رأيت غلبة المسلمين فارس والروم كل كذلك في خمسة عشر سنة. وقوله تعالى: \"وهو العزيز\" أي في انتصاره وانتقامه من أعدائه \"الرحيم\" بعباده المؤمنين."
    },
    {
      "ayah": 40,
      "surah": 30,
      "text": "قوله عز وجل \"الله الذي خلقكم ثم رزقكم\" أي هو الخالق الرازق يخرج الإنسان من بطن أمه عريانا لا علم له ولا سمع ولا بصر ولا قوى ثم يرزقه جميع ذلك بعد ذلك والرياش واللباس والمال والأملاك والمكاسب كما قال الإمام أحمد حدثنا أبو معاوية حدثنا الأعمش عن سلام بن شرحبيل عن حبة وسواء ابني خالد قالا دخلنا على النبي صلى الله عليه وسلم وهو يصلح شيئا فأعناه فقال \"لا تيأسا من الرزق ما تهزهزت رؤسكما فإن الإنسان تلده أمه أحمر ليس عليه قشرة ثم يرزقه الله عز وجل\" وقوله تعالى \"ثم يميتكم\" أي بعد هذه الحياة \"ثم يحييكم\" أي يوم القيامة وقوله تعالى \"هل من شركائكم\" أي الذين تعبدونهم من دون الله \"من يفعل من ذلكم من شيء\" أي لا يقدر أحد منهم على فعل شيء من ذلك بل الله سبحانه وتعالى هو المستقل بالخلق والرزق والإحياء والإماتة ثم يبعث الخلائق يوم القيامة ولهذا قال بعد هذا كله \"سبحانه وتعالى عما يشركون\" أي تعالى وتقدس وتنزه وتعاظم وجل وعز عن أن يكون له شريك أو نظير أو مساو أو ولد أو والد بل هو الأحد الفرد الصمد الذي لم يلد ولم يولد ولم يكن له كفوا أحد."
    },
    {
      "ayah": 41,
      "surah": 30,
      "text": "قال ابن عباس وعكرمة والضحاك والسدي وغيرهم المراد بالبر ههنا الفيافي وبالبحر الأمصار والقرى وفي رواية عن ابن عباس وعكرمة: البحر الأمصار والقرى ما كان منهما على جانب نهر وقال آخرون بل المراد بالبر هو البر المعروف وبالبحر هو البحر المعروف. وقال زيد بن رفيع \"ظهر الفساد\" يعني انقطاع المطر عن البر يعقبه القحط وعن البحر يعني دوابه. رواه ابن أبي حاتم وقال حدثنا محمد بن عبدالله بن يزيد بن المقري عن سفيان عن حميد بن قيس الأعرج عن مجاهد \"ظهر الفساد في البر والبحر\" قال فساد البر قتل ابن آدم وفساد البحر أخذ السفينة غصبا وقال عطاء الخراساني المراد بالبر ما فيه من المدائن والقرى وبالبحر جزائره. والقول الأول أظهر وعليه الأكثرون ويؤيده ما قاله محمد بن إسحاق في السيرة أن رسول الله صلى الله عليه وسلم وسلم صالح ملك أيلة وكتب إليه ببحره يعني ببلده ومعنى قوله تعالى \"ظهر الفساد في البر والبحر بما كسبت أيدي الناس\" أي بان النقص في الزروع والثمار بسبب المعاصي. وقال أبو العالية: من عصى الله في الأرض فقد أفسد في الأرض لأن صلاح الأرض والسماء بالطاعة ولهذا جاء في الحديث الذي رواه أبو داود \"لحد يقام في الأرض أحب إلى أهلها من أن يمطروا أربعين صباحا\" والسبب في هذا أن الحدود إذا أقيمت كف الناس أو أكثرهم أو كثير منهم عن تعاطي المحرمات وإذا تركت المعاصي كان سببا في حصول البركات من السماء والأرض. ولهذا إذا نزل عيسى ابن مريم عليه السلام في آخر الزمان يحكم بهذه الشريعة المطهرة في ذلك الوقت من قتل الخنزير وكسر الصليب ووضع الجزية وهو تركها فلا يقبل إلا الإسلام أو السيف فإذا أهلك الله في زمانه الدجال وأتباعه ويأجوج ومأجوج قيل للأرض أخرجي بركتك فيأكل من الرمانة الفئام من الناس ويستظلون بقحفها ويكفي لبن اللقحة الجماعة من الناس وما ذاك إلا ببركة تنفيذ شريعة محمد صلى الله عليه وسلم فكلما أقيم العدل كثرت البركات والخير. ولهذا ثبت في الصحيحين أن الفاجر إذا مات يستريح منه العباد والبلاد والشجر والدواب وقال الإمام أحمد بن حنبل حدثنا محمد والحسين قالا حدثنا عوف عن أبي مخذم قال وجد رجل في زمان زياد أو ابن زياد صرة فيها حب يعني من بر أمثال النوى مكتوب فيها هذا نبت في زمان كان يعمل فيه بالعدل وروى مالك عن زيد بن أسلم أن المراد بالفساد ههنا الشرك وفيه نظر وقوله تعالى \"ليذيقهم بعض الذي عملوا\" الآية أي يبتليهم بنقص الأموال والأنفس والثمرات اختبارا منه لهم ومجازاة على صنيعهم \"لعلهم يرجعون\" أي عن المعاصي كما قال تعالى \"وبلوناهم بالحسنات والسيئات لعلهم يرجعون\"."
    },
    {
      "ayah": 42,
      "surah": 30,
      "text": "قال تعالى \"قل سيروا في الأرض فانظروا كيف كان عاقبة الذين من قبل\" أي من قبلكم \"كان أكثرهم مشركين\" أي فانظروا ما حل بهم من تكذيب الرسل وكفر النعم."
    },
    {
      "ayah": 43,
      "surah": 30,
      "text": "يقول تعالى آمرا عباده بالمبادرة إلى الاستقامة في طاعته والمبادرة إلى الخيرات \"فأقم وجهك للدين القيم من قبل أن يأتي يوم لا مرد له من الله\" أي يوم القيامة إذا أراد كونه فلا راد له \"يومئذ يصدعون\" أي يتفرقون ففريق في الجنة وفريق في السعير."
    },
    {
      "ayah": 44,
      "surah": 30,
      "text": "قال تعالى \"من كفر فعليه كفره ومن عمل صالحا فلأنفسهم يمهدون ليجزي الذين آمنوا وعملوا الصالحات من فضله\" أي يجازيهم مجازاة الفضل الحسنة بعشر أمثالها إلى سبعمائة ضعف إلى ما يشاء الله \"إنه لا يحب الكافرين\" ومع هذا هو العادل فيهم الذي لا يجور."
    },
    {
      "ayah": 45,
      "surah": 30,
      "text": "قال تعالى \"من كفر فعليه كفره ومن عمل صالحا فلأنفسهم يمهدون ليجزي الذين آمنوا وعملوا الصالحات من فضله\" أي يجازيهم مجازاة الفضل الحسنة بعشر أمثالها إلى سبعمائة ضعف إلى ما يشاء الله \"إنه لا يحب الكافرين\" ومع هذا هو العادل فيهم الذي لا يجور."
    },
    {
      "ayah": 46,
      "surah": 30,
      "text": "يذكر تعالى نعمه على خلقه في إرساله الرياح مبشرات بين يدي رحمته بمجيء الغيث عقبها ولهذا قال تعالى \"وليذيقكم من رحمته\" أي المطر الذي ينزله فيحيي به العباد والبلاد \"ولتجري الفلك بأمره\" أي في البحر وإنما سيرها بالريح \"ولتبتغوا من فضله\" أي في التجارات والمعايش والسير من إقليم إلى إقليم وقطر إلى قطر \"ولعلكم تشكرون\" أي تشكرون الله على ما أنعم به عليكم من النعم الظاهرة والباطنة التي لا تعد ولا تحصى."
    },
    {
      "ayah": 47,
      "surah": 30,
      "text": "قال تعالى \"ولقد أرسلنا من قبلك رسلا إلى قومهم فجاءوهم بالبينات فانتقمنا من الذين أجرموا\" هذه تسلية من الله تعالى لعبده ورسوله محمد صلى الله عليه وسلم بأنه وإن كذبه كثير من قومه ومن الناس فقد كذبت الرسل المتقدمون مع ما جاءوا أممهم به من الدلائل الواضحات. ولكن انتقم الله ممن كذبهم وخالفهم وأنجى المؤمنين بهم \"وكان حق علينا نصر المؤمنين\" أي هو حق أوجبه على نفسه الكريمة تكرما وتفضلا كقوله تعالى \"كتب ربكم على نفسه الرحمة\" وروى ابن أبي حاتم حدثنا أبي حدثنا ابن نفيل حدثنا موسى بن أعين عن ليث عن شهر بن حوشب عن أم الدرداء عن أبي الدرداء رضي الله عنه قال سمعت رسول الله صلى الله عليه وسلم يقول \"ما من امرئ مسلم يرد عن حوض أخيه إلا كان حقا على الله أن يرد عنه نار جهنم يوم القيامة\" ثم تلا هذه الآية \"وكان حقا علينا نصر المؤمنين\"."
    },
    {
      "ayah": 48,
      "surah": 30,
      "text": "يبين تعالى كيف يخلق السحاب الذي ينزل من الماء فقال تعالى \"الله الذي يرسل الرياح فتثير سحابا\" إما من البحر كما ذكره غير واحد أو مما يشاء الله عز وجل \"فيبسطه في السماء كيف يشاء\" أي يمده فيكثره وينميه ويجعل من القليل كثيرا ينشئ سحابة ترى في رأى العين مثل الترس ثم يبسطها حتى تملأ أرجاء الأفق وتارة يأتي السحاب من نحو البحر ثقالا مملوءة كما قال تعالى \"وهو الذي يرسل الرياح بشرا بين يدي رحمته حتى إذا أقلت سحابا ثقالا سقناه لبلد ميت - إلى قوله - كذلك نخرج الموتى لعلكم تذكرون\" وكذلك قال ههنا \"الله الذي يرسل الرياح فتثير سحابا فيبسطه في السماء كيف يشاء ويجعله كسفا\" قال مجاهد وأبو عمرو بن العلاء ومطر الوراق وقتادة يعني قطعا. وقال غيره متراكما كما قاله الضحاك وقال غيره: أسود من كثرة الماء تراه مدلهما ثقيلا قريبا من الأرض وقوله تعالى \"فترى الودق يخرج من خلاله\" أي فترى المطر وهو القطر يخرج من بين ذلك السحاب\" فإذا أصاب به من يشاء من عباده إذا هم يستبشرون\" أي لحاجتهم إليه يفرحون بنزوله عليهم ووصوله إليهم."
    },
    {
      "ayah": 49,
      "surah": 30,
      "text": "قوله تعالى \"وإن كانوا من قبل أن ينزل عليهم من قبله لمبلسين\" معنى الكلام أن هؤلاء القوم الذين أصابهم هذا المطر كانوا قانطين أزلين من نزول المطر إليهم قبل لك فلما جاءهم جاءهم على فاقة فوقع منهم موقعا عظيما وقد اختلف النحاة في قوله \"من قبل أن ينزل عليهم من قبله لمبلسين\" فقال ابن جرير هو تأكيد وحكاه عن بعض أهل العربية. وقال آخرون من قبل أن ينزل عليهم المطر من قبله أي الإنزال لمبلسين ويحتمل أن يكون ذلك من دلالة التأسيس ويكون معنى الكلام أنهم كانوا محتاجين إليه قبل نزوله ومن قبله أيضا قد فات عندهم نزوله وقتا بعد وقت فترقبوه في إبانه فتأخر ثم مضت فترقبوه فتأخر ثم جاءهم بغتة بعد الإياس منه والقنوط فبعد ما كانت أرضهم مقشعرة هامدة أصبحت وقد اهتزت وربت وأنبتت من كل زوج بهيج."
    },
    {
      "ayah": 5,
      "surah": 30,
      "text": "قوله تعالى: \"لله الأمر من قبل ومن بعد\" أي من قبل ذلك ومن بعده فبنى على الضم لما قطع المضاف وهو قوله قبل عن الإضافة ونويت \"ويومئذ يفرح المؤمنون بنصر الله\" أي للروم أصحاب قيصر ملك الشام على فارس أصحاب كسرى وهم المجوس وكانت نصرة الروم على فارس يوم وقعة بدر في قول طائفة كثيرة من العلماء كابن عباس والثوري والسدي وغيرهم. وقد ورد في الحديث الذي رواه الترمذي وابن جرير وابن أبي حاتم والبزار من حديث الأعمش عن عطية عن أبي سعيد قال: لما كان يوم بدر ظهرت الروم على فارس فأعجب ذلك المؤمنين ففرحوا به وأنزل الله \"ويومئذ يفرح المؤمنون بنصر الله ينصر من يشاء وهو العزيز الرحيم\" وقال الآخرون بل كان نصر الروم على فارس عام الحديبية. قاله عكرمة والزهري وقتادة وغير واحد ووجه بعضهم هذا القول بأن قيصر كان قد نذر لئن أظفره الله بكسرى ليمشين من حمص إلى إيليا وهو بيت المقدس شكرا لله تعالى ففعل فلما بلغ بيت المقدس لم يخرج منه حتى وافاه كتاب رسول الله صلى الله عليه وسلم الذي بعثه مع دحية بن خليفة فأعطاه دحية لعظيم بصرى فدفعه عظيم بصرى إلى قيصر فلما وصل إليه سأل من بالشام من عرب الحجاز فأحضر له أبو سفيان صخر بن حرب الأموي في جماعة من كبار قريش وكانوا بغزة فجيء بهم إليه فجلسوا بين يديه فقال أيكم أقرب نسبا بهذا الرجل الذي يزعم أنه نبي؟ فقال أبو سفيان أنا فقال لأصحابه وأجلسهم خلفه إني سائل هذا عن هذا الرجل فإن كذب فكذبوه فقال أبو سفيان فوالله لولا أن يأثروا علي الكذب لكذبت فسأله هرقل عن نسبه وصفته فكان فيما سأله أن قال: فهل يغدر؟ قال قلت لا ونحن منه في مدة لا ندري ما هو صانع فيها يعني بذلك الهدنة التي كانت قد وقعت بين رسول الله صلى الله عليه وسلم وكفار قريش عام الحديبية على وضع الحرب بينهم عشر سنين فاستدلوا بهذا على أن نصر الروم على فارس كان عام الحديبية لأن قيصر إنما وفى بنذره بعد الحديبية والله أعلم. ولأصحاب القول الأول أن يجيبوا عن هذا بأن بلاده كانت قد خربت وتشعبت فما تمكن من وفاء نذره حتى أصلح ما ينبغي له إصلاحه وتفقد بلاده ثم بعد أربع سنين من نصرته وفى بنذره والله أعلم. والأمر في هذا سهل قريب إلا أنه لما اقتصرت فارس على الروم ساء ذلك المؤمنين فلما انتصرت الروم على فارس فرح المؤمنون بذلك لأن الروم أهل كتاب في الجملة فهم أقرب إلى المؤمنين من المجوس كما قال تعالى: \"لتجدن أشد الناس عداوة للذين آمنوا اليهود والذين أشركوا ولتجدن أقربهم مودة للذين آمنوا الذين قالوا إنا نصارى - إلى قوله - ربنا آمنا فاكتبنا مع الشاهدين\" وقال تعالى ههنا \"ويومئذ يفرح المؤمنون بنصر الله ينصر من يشاء وهو العزيز الرحيم\". وقال ابن أبي حاتم حدثنا أبو زرعة حدثنا صفوان حدثنا الوليد حدثني أسيد الكلابي قال سمعت العلاء بن الزبير الكلابي يحدث عن أبيه قال رأيت غلبة فارس الروم ثم رأيت غلبة الروم فارس. ثم رأيت غلبة المسلمين فارس والروم كل كذلك في خمسة عشر سنة. وقوله تعالى: \"وهو العزيز\" أي في انتصاره وانتقامه من أعدائه \"الرحيم\" بعباده المؤمنين."
    },
    {
      "ayah": 50,
      "surah": 30,
      "text": "قال تعالى \"فانظر إلى آثار رحمة الله\" يعني المطر \"كيف يحيى الأرض بعد موتها\" ثم نبه بذلك على إحياء الأجساد بعد موتها وتفرقها وتمزقها فقال تعالى \"إن ذلك لمحيى الموتى\" أي إن الذي فعل ذلك لقادر على إحياء الأموات \"إنه على كل شيء قدير\"."
    },
    {
      "ayah": 51,
      "surah": 30,
      "text": "قال تعالى \"ولئن أرسلنا ريحا فرأوه مصفرا لظلوا من بعده يكفرون\" يقول تعالى \"ولئن أرسلنا ريحا\" يابسة على الزرع الذي زرعوه ونبت وشب واستوى على سوقه فرأوه مصفرا أي قد اصفر وشرع في الفساد لظلوا من بعده أي بعد هذا الحال يكفرون أي يجحدون ما تقدم إليهم من النعم كقوله تعالى \"أفرأيتم ما تحرثون\" - إلى قوله - \"بل نحن محرومون\" قال ابن أبي حاتم حدثنا أبي حدثنا محمد بن عيسى بن الطباع حدثنا هشيم عن يعلى بن عطاء عن أبيه عن عبدالله بن عمرو قال: الرياح ثمانية أربعة منها رحمة وأربعة منها عذاب فأما الرحمة فالناشرات والمبشرات والمرسلات والذاريات وأما العذاب فالعقيم والصرصر وهما في البر والعاصف والقاصف وهما في البحر فإذا شاء سبحانه وتعالى حركه بحركة الرحمة فجعله رخاء ورحمة وبشرى - بين يدي رحمته ولاقحا للسحاب تلقحه بحمله الماء كما يلقح الذكر الأنثى بالحمل وإن شاء حركه بحركة العذاب فجعله عقيما وأودعه عذابا أليما وجعله نقمة على من يشاء من عباده فيجعل صرصرا وعاتيا ومفسدا لما يمر عليه والرياح مختلفة في مهابها صبا ودبور وجنوب وشمال وفي منفعتها وتأثيرها أعظم اختلاف فريح لينة رطبة تغذي النبات وأبدان الحيوان وأخرى تجففه وأخرى تهلكه وتعطبه وأخرى تسيره وتصلبه وأخرى توهنه وتضعفه وقال ابن أبي حاتم حدثنا ابن عبيدالله بن أخي ابن وهب حدثنا عمي حدثنا عبدالله بن عباس حدثني عبدالله بن سليمان عن دراج بن عيسى بن هلال الصدفي عن عبدالله بن عمرو قال: قال رسول الله صلى الله عليه وسلم \"الريح مسخرة في الثانية - يعني الأرض الثانية - فلما أراد الله أن يهلك عادا أمر خازن الريح أن يرسل عليهم ريحا تهلك عادا فقال يا رب أرسل عليهم الريح قدر منخر الثور قال له الجبار تبارك تعالى لا إذا تكفأ الأرض ومن عليها ولكن أرسل عليهم بقدر خاتم فهي التي قال الله في كتابه \"ما تذر من شيء أتت عليه إلا جعلته كالرميم\" هذا حديث غريب ورفعه منكر والأظهر أنه من كلام عبدالله بن عمرو رضي الله تعالى عنه."
    },
    {
      "ayah": 52,
      "surah": 30,
      "text": "يقول تعالى كما أنك ليس في قدرتك أن تسمع الأموات في أجداثها ولا تبلغ كلامك الصم الذين لا يسمعون وهم مع ذلك مدبرون عنك كذلك لا تقدر على هداية العميان عن الحق وردهم عن ضلالتهم بل ذلك إلى الله فإنه تعالى بقدرته يسمع الأموات أصوات الأحياء إذا شاء ويهدي من يشاء ويضل من يشاء وليس ذلك لأحد سواه."
    },
    {
      "ayah": 53,
      "surah": 30,
      "text": "قال تعالى \"إن تسمع إلا من يؤمن بآياتنا فهم مسلمون\" أي خاضعون مستجيبون مطيعون فأولئك هم الذين يسمعون الحق ويتبعونه وهذا حال المؤمنين والأول مثل الكافرين كما قال الله تعالى \"إنما يستجيب الذين يسمعون والموتى يبعثهم الله ثم إليه يرجعون\" وقد استدلت أم المؤمنين عائشة رضي الله عنها بهذه الآية \"إنك لا تسمع الموتى\" على توهيم عبدالله ابن عمر في روايته مخاطبة النبي صلى الله عليه وسلم القتلى الذين ألقوا في قليب بدر بعد ثلاثة أيام ومعاتبته إياهم وتقريعه لهم حتى قال له عمر يا رسول الله ما تخاطب من قوم قد جيفوا؟ فقال \"والذي نفسي بيده ما أنتم بأسمع لما أقول منهم ولكن لا يجيبون\" وتأولته عائشة على أنه قال \"إنهم الآن ليعلمون أن ما كنت أقول لهم حق\" وقال قتادة أحياهم الله له حتى سمعوا مقالته تقريعا وتوبيخا ونقمة والصحيح عند العلماء رواية عبدالله بن عمر لما لها من الشواهد على صحتها من وجوه كثيرة من أشهر ذلك ما رواه ابن عبدالبر مصححا له عن ابن عباس مرفوعا \"ما من أحد يمر بقبر أخيه المسلم كان يعرفه في الدنيا فيسلم عليه إلا رد الله عليه روحه حتى يرد عليه السلام\". وثبت عنه صلى الله عليه وسلم لأمته إذا سلموا على أهل القبور أن يسلموا عليهم سلام من يخاطبونه فيقول المسلم السلام عليكم دار قوم مؤمنين وهذا خطاب لمن يسمع ويعقل ولولا هذا الخطاب لكانوا بمنزلة خطاب المعدوم والجماد والسلف مجمعون على هذا. وقد تواترت الآثار عنهم بأن الميت يعرف بزيارة الحي له ويستبشر فروى ابن أبي الدنيا في كتاب القبور عن عائشة رضي الله عنها قالت: قال رسول الله صلى الله عليه وسلم \"ما من رجل يزور قبر أخيه ويجلس عنده إلا استأنس به ورد عليه حتى يقوم\" وروي عن أبي هريرة رضي الله عنه قال: إذا مر الرجل بقبر يعرفه فسلم عليه رد عليه السلام وروى ابن أبي الدنيا بإسناده عن رجل من آل عاصم الجحدري قال رأيت عاصما الجحدري في منامي بعد موته بسنتين فقلت أليس قد مت؟ قال بلى قلت فأين أنت؟ قال أنا والله في روضة من رياض الجنة أنا ونفر من أصحابي نجتمع كل ليلة جمعة وصبيحتها إلى بكر بن عبدالله المزني فنتلقى أخباركم قال قلت أجسامكم أم أرواحكم؟ قال هيهات قد بليت الأجسام وإنما تتلاقى الأرواح قال قلت فهل تعلمون بزيارتنا إياكم؟ قال نعلم بها عشية الجمعة ويوم الجمعة كله ويوم السبت إلى طلوع الشمس قال قلت فكيف ذلك دون الأيام كلها؟ قال لفضل يوم الجمعة وعظمته قال وحدثنا محمد بن الحسين ثنا بكر بن محمد ثنا حسن القصاب قال كنت أغدو مع محمد بن واسع في كل غداة سبت حتى نأتي أهل الجبان فنقف على القبور فنسلم عليهم وندعو لهم ثم ننصرف فقلت ذات يوم لو صيرت هذا اليوم يوم الاثنين؟ قال بلغني أن الموتى يعلمون بزوارهم يوم الجمعة ويوما قبلها ويوما بعدها. قال ثنا محمد ثنا عبدالعزيز بن أبان قال ثنا سفيان الثوري قال بلغني عن الضحاك أنه قال: من زار قبرا يوم السبت قبل طلوع الشمس علم الميت بزيارته فقيل له وكيف ذلك؟ قال لمكان يوم الجمعة. حدثنا خالد بن خداش ثنا جعفر بن سليمان عن أبي التياح يقول كان مطرف يغدو فإذا كان يوم الجمعة أدلج: قال وسمعت أبا التياح يقول بلغنا أنه كان ينزل بغوطة فأقبل ليلة حتى إذا كان عند المقابر يقوم وهو على فرسه فرأى أهل القبور كل صاحب قبر جالسا على قبره فقالوا هذا مطرف يأتي الجمعة ويصلون عندكم يوم الجمعة؟ قالوا نعم ونعلم ما يقول فيه الطير قلت وما يقولون؟ قال يقولون سلام عليكم حدثني محمد بن الحسن ثنا يحيى بن أبي بكر ثنا الفضل بن الموفق ابن خال سفيان بن عيينة قال لما مات أبي جزعت عليه جزعا شديدا فكنت آتي قبره في كل يوم ثم قصرت عن ذلك ما شاء الله ثم إني أتيته يوما فبينا أنا جالس عند القبر غلبتني عيناي فنمت فرأيت كأنك قبر أبي قد انفرج وكأنه قاعد في قبره متوشح أكفانه عليه سحنة الموتى قال فكأني بكيت لما رأيته قال يا بني ما أبطأ بك عني قلت وإنك لتعلم بمجيئي؟ قال ما جئت مرة إلا علمتها وقد كنت تأتيني فأسر بك ويسر من حولي بدعائك قال فكنت آتيه بعد ذلك كثيرا حدثني محمد حدثنا يحيى بن بسطام ثنا عثمان بن سويد الطفاوي قال وكانت أمه من العابدات وكان يقال لها راهبة قال: لما احتضرت رفعت رأسها إلى السماء فقالت يا ذخري وذخيرتي من عليه اعتمادي في حياتي وبعد موتي لا تخذلني عند الموت ولا توحشني. قال فماتت فكنت آتيها في كل جمعة فأدعو لها وأستغفر لها ولأهل القبور فرأيتها ذات يوم في منامي فقلت لها يا أمي كيف أنت؟ قال أي بني إن للموت لكربة شديدة وإني بحمد الله لفي برزخ محمود يفرش فيه الريحان ونتوسد السندس والإستبرق إلى يوم النشور فقلت لها ألك حاجة؟ قالت نعم قلت وما هي؟ قالت لا تدع ما كنت تصنع من زيارتنا والدعاء لنا فإني لأبشر بمجيئك يوم الجمعة إذا أقبلت من أهلك يقال لي يا راهبة هذا ابنك قد أقبل فأسر ويسر بذلك من حولي من الأموات حدثني محمد ثنا محمد بن عبدالعزيز بن سليمان ثنا بشر بن منصور قال لما كان زمن الطاعون كان رجل يختلف إلى الجبان فيشهد الصلاة على الجنائز فإذا أمسى وقف على المقابر فقال آنس الله وحشتكم ورحم غربتكم وتجاوز عن مسيئكم وقبل حسناتكم لا يزيد على هؤلاء الكلمات قال فأمسيت ذات ليلة وانصرفت إلى أهلي ولم آت المقابر فأدعو كما كنت أدعو قال فبينا أنا نائم إذا بخلق قد جاؤني فقلت ما أنتم وما حاجتكم؟ قالوا نحن أهل المقابر قلت ما حاجتكم؟ قالوا إنك قد عودتنا منك هدية عند انصرافك إلى أهلك قلت وما هي؟ قالوا الدعوات التي كنت تدعو بها قال قلت فإني أعود لذلك قال فما تركتها بعد وأبلغ من ذلك أن الميت يعلم بعمل الحي من أقاربه وإخوانه. قال عبدالله بن المبارك حدثني ثور بن يزيد عن إبراهيم عن أيوب قال: تعرض أعمال الأحياء على الموتى فإذا رأوا حسنا فرحوا واستبشروا وإن رأوا سوءا قالوا اللهم راجع به. وذكر ابن أبي الدنيا عن أحمد بن أبي الحواري قال ثنا محمد أخي قال دخل عباد بن عباد على إبراهيم بن صالح وهو على فلسطين فقال عظني قال بم أعظك أصلحك الله؟ بلغني أن أعمال الأحياء تعرض على أقاربهم من الموتى فانظر ما يعرض على رسول الله صلى الله عليه وسلم من عملك فبكى إبراهيم حتى أخضل لحيته. قال ابن أبي الدنيا وحدثني محمد بن الحسين ثني خالد بن عمرو الأموي ثنا صدقة بن سلمان الجعفري قال: كانت لي شرة سمجة فمات أبي فتبت وندمت على ما فرطت ثم زللت أيما زلة فرأيت أبي في المنام فقال أي بني ما كان أشد فرحي بك وأعمالك تعرض علينا فنشبهها بأعمال الصالحين فلما كانت هذه المرة استحييت لذلك حياء شديدا فلا تخزني فيمن حولي من الأموات قال فكنت أسمعه بعد ذلك يقول في دعائه في السحر وكان جارا لي بالكوفة أسألك إيابة لا رجعة فيها ولا حور يا مصلح الصالحين ويا هادي المضلين ويا أرحم الراحمين. وهذا باب فيه آثار كثيرة عن الصحابة وكان بعض الأنصار من أقارب عبدالله بن رواحة يقول: اللهم إني أعوذ بك من عمل أخزى به عند عبدالله بن رواحة كان يقول ذلك بعد أن استشهد عبدالله. وقد شرع السلام على الموتى والسلام على من لم يشعر ولا يعلم بالمسلم محال. وقد علم النبي صلى الله عليه وسلم أمته إذا رأوا القبور أن يقولوا سلام عليكم أهل الديار من المؤمنين وإنا إن شاء الله بكم لاحقون يرحم الله المستقدمين منا ومنكم والمستأخرين نسأل الله لنا ولكم العافية فهذا السلام والخطاب والنداء لموجود يسمع ويخاطب ويعقل ويرد وإن لم يسمع المسلم الرد والله أعلم."
    },
    {
      "ayah": 54,
      "surah": 30,
      "text": "ينبه تعالى على تنقل الإنسان في أطوار الخلق حال بعد حال فأصله من تراب ثم من نطفة ثم من علقة ثم من مضغة ثم يصير عظاما ثم تكسى العظام لحما وينفخ فيه الروح ثم يخرج من بطن أمه ضعيفا نحيفا واهن القوى ثم يشب قليلا قليلا حتى يكون صغيرا ثم حدثا ثم مراهقا ثم شابا وهو القوة بعد الضعف ثم يشرع في النقص فيكتهل ثم يشيخ ثم يهرم وهو الضعف بعد القوة فتضعف الهمة والحركة والبطش وتشيب اللمة وتتغير الصفات الظاهرة والباطنة ولهذا قال تعالى \"ثم جعل من بعد قوة ضعفا وشيبة يخلق ما يشاء\" أي يفعل ما يشاء ويتصرف في عبيده بما يريد \"وهو العليم القدير\" قال الإمام أحمد حدثنا وكيع عن فضيل ويزيد حدثنا فضيل بن مرزوق عن عطية العوفي قال: قرأت على ابن عمر \"الله الذي خلقكم من ضعف ثم جعل من بعد ضعف قوة ثم جعل من بعد قوة ضعفا\" فقال \"الله الذي خلقكم من ضعف ثم جعل من بعد ضعف قوة ثم جعل من بعد قوة ضعفا\" ثم قال قرأت على رسول الله صلى الله عليه وسلم كما قرأت علي فأخذ علي كما أخذت عليك ورواه أبو داود والترمذي وحسنه من حديث فضيل به ورواه أبو داود حديث عبدالله بن جابر عن عطية عن أبي سعيد بنحوه."
    },
    {
      "ayah": 55,
      "surah": 30,
      "text": "يخبر تعالى عن جهل الكفار في الدنيا والآخرة ففي الدنيا فعلوا ما فعلوا من عبادة الأوثان وفي الآخرة يكون منهم جهل عظيم أيضا فمنه إقسامهم بالله أنهم ما لبثوا غير ساعة واحدة في الدنيا ومقصودهم بذلك عدم قيام الحجة عليهم وأنهم لم ينظروا حتى يعذر إليهم."
    },
    {
      "ayah": 56,
      "surah": 30,
      "text": "قال الله تعالى \"كذلك كانوا يؤفكون وقال الذين أوتوا العلم والإيمان لقد لبثتم في كتاب الله إلى يوم البعث\" أي فيرد عليهم المؤمنون العلماء في الآخرة كما أقاموا عليهم حجة الله في الدنيا فيقولون لهم حين يحلفون ما لبثوا غير ساعة \"لقد لبثتم في كتاب الله\" أي في كتاب الأعمال إلى يوم البعث أي من يوم خلقتم إلى أن بعثتم ولكنكم كنتم لا تعلمون."
    },
    {
      "ayah": 57,
      "surah": 30,
      "text": "قال الله تعالى \"فيومئذ\" أي يوم القيامة \"لا ينفع الذين ظلموا معذرتهم\" أي اعتذارهم عما فعلوا \"ولاهم يستعتبون\" أي ولا هم يرجعون إلى الدنيا كما قال تعالى \"وإن يستعتبوا فما هم من المعتبين\"."
    },
    {
      "ayah": 58,
      "surah": 30,
      "text": "يقول تعالى \"ولقد ضربنا للناس في هذا القرآن من كل مثل\" أي قد بينا لهم الحق ووضحناه لهم وضربنا لهم فيه الأمثال ليستبينوا الحق ويتبعوه \"ولئن جئتهم بآية ليقولن الذين كفروا إن أنتم إلا مبطلون\" أي لو رأوا أي آية كانت سواء كانت باقتراحهم أو غيره لا يؤمنون بها ويعتقدون أنها سحر وباطل كما قالوا في انشقاق القمر ونحوه كما قال تعالى \"إن الذين حقت عليهم كلمة ربك لا يؤمنون ولو جاءتهم كل آية حتى يروا العذاب الأليم\"."
    },
    {
      "ayah": 59,
      "surah": 30,
      "text": "قال ههنا \"كذلك يطبع الله على قلوب الذين لا يعلمون فاصبر إن وعد الله حق\" أي اصبر على مخالفتهم وعنادهم فإن الله تعالى منجز لك ما وعدك من نصره إياك عليهم وجعله العاقبة لك لا مرية فيه ولا تعدل عنه وليس فيما سواه هدى يتبع بل الحق كله منحصر فيه قال سعيد عن قتادة نادى رجل من الخوارج عليا رضي الله عنه وهو في صلاة الغداة فقال: \"ولقد أوحي إليك وإلى الذين من قبلك لئن أشركت ليحبطن عملك ولتكونن من الخاسرين\" فأنصت له علي حتى فهم ما قال فأجابه وهو في الصلاة \"فاصبر إن وعد الله حق ولا يستخفنك الذين لا يوقنون\" رواه ابن جرير وابن أبي حاتم وقد رواه ابن جرير من وجه آخر فقال: حدثنا وكيع حدثنا يحيى بن آدم عن شريك عن عثمان عن أبي زرعة عن علي بن ربيعة قال: نادى رجل من الخوارج عليا رضي الله عنه وهو في صلاة الفجر فقال \"ولقد أوحي إليك وإلى الذين من قبلك لئن أشركت ليحبطن عملك ولتكونن من الخاسرين\" فأجابه علي رضي الله عنه وهو في الصلاة \"فاصبر إن وعد الله حق ولا يستخفنك الذين لا يوقنون\". \"طريق أخرى\" قال ابن أبي حاتم حدثنا أبي علي بن الجعد أخبرنا شريك عن عمران بن ظبيان عن ابن يحيى قال صلى علي بن أبي طالب رضي الله عنه صلاة الفجر فناداه رجل من الخوارج \"لئن أشركت ليحبطن عملك ولتكونن من الخاسرين\" فأجابه علي رضي الله عنه وهو في الصلاة \"فاصبر إن وعد الله حق ولا يستخفنك الذين لا يوقنون\"."
    },
    {
      "ayah": 6,
      "surah": 30,
      "text": "قوله تعالى: \"وعد الله لا يخلف الله وعده\" أي هذا الذي أخبرناك به يا محمد من أنا سننصر الروم على فارس وعد من الله حق وخبر صدق لا يخلف ولابد من كونه ووقوعه لأن الله قد جرت سنته أن ينصر أقرب الطائفتين المقتتلين إلى الحق ويجعل لها العاقبة \"ولكن أكثر الناس لا يعلمون\" أي بحكم الله في كونه وأفعاله المحكمة الجارية على وفق العدل."
    },
    {
      "ayah": 60,
      "surah": 30,
      "text": "قال ههنا \"كذلك يطبع الله على قلوب الذين لا يعلمون فاصبر إن وعد الله حق\" أي اصبر على مخالفتهم وعنادهم فإن الله تعالى منجز لك ما وعدك من نصره إياك عليهم وجعله العاقبة لك لا مرية فيه ولا تعدل عنه وليس فيما سواه هدى يتبع بل الحق كله منحصر فيه قال سعيد عن قتادة نادى رجل من الخوارج عليا رضي الله عنه وهو في صلاة الغداة فقال: \"ولقد أوحي إليك وإلى الذين من قبلك لئن أشركت ليحبطن عملك ولتكونن من الخاسرين\" فأنصت له علي حتى فهم ما قال فأجابه وهو في الصلاة \"فاصبر إن وعد الله حق ولا يستخفنك الذين لا يوقنون\" رواه ابن جرير وابن أبي حاتم وقد رواه ابن جرير من وجه آخر فقال: حدثنا وكيع حدثنا يحيى بن آدم عن شريك عن عثمان عن أبي زرعة عن علي بن ربيعة قال: نادى رجل من الخوارج عليا رضي الله عنه وهو في صلاة الفجر فقال \"ولقد أوحي إليك وإلى الذين من قبلك لئن أشركت ليحبطن عملك ولتكونن من الخاسرين\" فأجابه علي رضي الله عنه وهو في الصلاة \"فاصبر إن وعد الله حق ولا يستخفنك الذين لا يوقنون\". \"طريق أخرى\" قال ابن أبي حاتم حدثنا أبي علي بن الجعد أخبرنا شريك عن عمران بن ظبيان عن ابن يحيى قال صلى علي بن أبي طالب رضي الله عنه صلاة الفجر فناداه رجل من الخوارج \"لئن أشركت ليحبطن عملك ولتكونن من الخاسرين\" فأجابه علي رضي الله عنه وهو في الصلاة \"فاصبر إن وعد الله حق ولا يستخفنك الذين لا يوقنون\". \"ما روي في فضل هذه السورة الشريفة واستحباب قراءتها في الفجر\" قال الإمام أحمد حدثنا محمد بن جعفر عن شعبة عن عبدالملك بن عمير سمعت شبيب بن روح يحدث عن رجل من أصحاب النبي صلى الله عليه وسلم أن رسول الله صلى الله عليه وسلم صلى بهم الصبح فقرأ فيها الروم فأوهم فلما انصرف قال \"إنه يلبس علينا القرآن فإن أقواما منكم يصلون معنا لا يحسنون الوضوء فمن شهد منكم الصلاة معنا فليحسن الوضوء\" وهذا إسناد حسن ومتن حسن وفيه سر عجيب. ونبأ غريب وهو أنه صلى الله عليه وسلم تأثر بنقصان وضوء من ائتم به فدل ذلك على أن صلاة المأموم متعلقة بصلاة الإمام. آخر تفسير سورة الروم ولله الحمد والمنة."
    },
    {
      "ayah": 7,
      "surah": 30,
      "text": "قوله تعالى: \"يعلمون ظاهرا من الحياة الدنيا وهم عن الآخرة هم غافلون\" أي أكثر الناس ليس لهم علم إلا بالدنيا وأكسابها وشؤونها وما فيها فهم حذاق أذكياء في تحصيلها ووجوه مكاسبها وهم غافلون في أمور الدين وما ينفعهم في الدار الآخرة كأن أحدهم مغفل لا ذهن له ولا فكرة قال الحسن البصري والله ليبلغ من أحدهم بدنياه أنه يقلب الدرهم على ظفره فيخبرك بوزنه وما يحسن أن يصلي. وقال ابن عباس في قوله تعالى: \"يعلمون ظاهرا من الحياة الدنيا وهم عن الآخرة هم غافلون\" يعني الكفار يعرفون عمران الدنيا وهم في أمر الدين جهال."
    },
    {
      "ayah": 8,
      "surah": 30,
      "text": "يقول تعالى منبها على التفكر في مخلوقاته الدالة على وجوده وانفراده بخلقها وأنه لا إله غيره ولا رب سواه فقال \"أو لم يتفكروا في أنفسهم\" يعني به النظر والتدبر والتأمل لخلق الله الأشياء من العالم العلوي والسفلي وما بينهما من المخلوقات المتنوعة والأجناس المختلفة فيعلموا أنها ما خلقت سدى ولا باطلا بل بالحق وأنها مؤجلة إلى أجل مسمى وهو يوم القيامة ولهذا قال تعالى \"وإن كثيرا من الناس بلقاء ربهم لكافرون\" ثم نبههم على صدق رسله فيما جاءوا به عنه بما أيدهم به من المعجزات والدلائل الواضحات من إهلاك من كفر بهم ونجاة من صدقهم."
    },
    {
      "ayah": 9,
      "surah": 30,
      "text": "قال تعالى \"أولم يسيروا في الأرض\" أي بأفهامهم وعقولهم ونظرهم وسماعهم أخبار الماضين ولهذا قال \"فينظروا كيف كان عاقبة الذين من قبلهم كانوا أشد منهم قوة\" أي كانت الأمم الماضية والقرون السالفة أشد منكم قوة أيها المبعوث إليهم محمد صلى الله عليه وسلم وأكثر أموالا وأولادا وما أوتيتم معشار ما أوتوا ومكنوا في الدنيا تمكينا لم تبلغوا إليه وعمروا فيها أعمارا طوالا فعمروها أكثر منكم واستغلوها أكثر من استغلالكم ومع هذا فلما جاءتهم رسلهم بالبينات وفرحوا بما أوتوا أخذهم الله بذنوبهم وما كان لهم من الله من واق ولا حالت أموالهم وأولادهم بينهم وبين بأس الله ولا دفعوا عنهم مثقال ذرة وما كان الله ليظلمهم فيما أحل بهم من العذاب والنكال \"ولكن كانوا أنفسهم يظلمون\" أي وإنما أوتوا من أنفسهم حيث كذبوا بآيات الله واستهزءوا بها وما ذاك إلا بسبب ذنوبهم السالفة وتكذيبهم المتقدم."
    }
  ]
}
