{
  "ayahs": [
    {
      "ayah": 1,
      "surah": 31,
      "text": "قد اختلف المفسرون في الحروف المقطعة التي في أوائل السور فمنهم من قال هي مما استأثر الله بعلمه فردوا علمها إلى الله ولم يفسرها حكاه القرطبي في تفسـره عن أبي بكر وعمر وعثمان وعلي وابن مسعود رضي الله عنهم أجمعين وقاله عامر الشعبي وسفيان الثوري والربيع بن خيثم واختاره أبو حاتم بن حبان. ومنهم من فسرها واختلف هؤلاء في معناها فقال عبدالرحمن بن زيد بن أسلم إنما هي أسماء السور. قال العلامة أبو القاسم محمود بن عمر الزمخشري في تفسيره وعليه إطباق الأكثر ونقل عن سيبويه أنه نص عليه ويعتضد لهذا بما ورد في الصحيحين عن أبي هريرة أن رسول الله صلى الله عليه وسلم كان يقرأ في صلاة الصبح يوم الجمعة \"الم\" السجدة و \"هل أتى على الإنسان\" وقال سفيان الثوري عن ابن أبي نجيح عن مجاهد أنه قال: الم وحم والمص وص. فواتح افتتح الله بها القرآن وكذا قال غيره عن مجاهد وقال مجاهد في رواية أبي حذيفة موسى بن مسعود عن شبل عن ابن أبي نجيح عنه أنه قال الم اسم من أسماء القرآن وهكذا وقال قتادة وزيد بن أسلم ولعل هذا يرجع إلى معنى قول عبدالرحمن بن زيد بن أسلم أنه اسم من أسماء السور فإن كل سورة يطلق عليها اسم القرآن فإنه يبعد أن يكون المص اسما للقرآن كله لأن المتبادر إلى فهم سامع من يقول قرأت المص إنما ذلك عبارة عن سورة الأعراف لا لمجموع القرآن والله أعلم. وقيل هي اسم من أسماء الله تعالى فقال عنها في فواتح السور من أسماء الله تعالى وكذلك قال سالم بن عبدالله وإسماعيل بن عبدالرحمن السدي الكبير وقال شعبة عن السدي بلغني أن ابن عباس قال الم اسم من أسماء الله الأعظم. هكذا رواه ابن أبي حاتم من حديث شعبة ورواه ابن جرير عن بندار عن ابن مهدي عن شعبة قال سألت السدي عن حم وطس والم فقال قال ابن عباس هي اسم الله الأعظم وقال ابن جرير وحدثنا محمد بن المثنى حدثنا أبو النعمان حدثنا شعبة عن إسماعيل السدي عن مرة الهمذاني قال: قال عبدالله فذكر نحوه. وحُكي مثله عن علي وابن عباس وقال علي بن أبي طلحة عن ابن عباس هو قسم أقسم الله به وهو من أسماء الله تعالى وروى ابن أبي حاتم وابن جرير من حديث ابن علية عن خالد الحذاء عن عكرمة أنه قال الم قسم. وروينا أيضا من حديث شريك بن عبدالله بن عطاء بن السائب عن أبى الضحى عن ابن عباس: الم قال أنا الله أعلم وكذا قال سعيد بن جبير وقال السدي عن أبي مالك وعن أبي صالح عن ابن عباس وعن مرة الهمذاني عن ابن مسعود وعن ناس من أصحاب النبي صلى الله عليه وسلم الم قال أما الم فهي حروف استفتحت من حروف هجاء أسماء الله تعالى. قال وأبو جعفر الرازي عن الربيع بن أنس عن أبي العالية في قوله تعالى الم قال هذه الأحرف الثلاثة من التسعة والعشرين حرفا دارت فيها الألسن كلها ليس منها حرف إلا وهو مفتاح اسم من أسمائه وليس منها حرف إلا وهو من آلائه وبلألائه ليس منها حرف إلا وهو في مدة أقوام وآجالهم. قال عيسى ابن مريم عليه السلام وعجب: فقال أعجب أنهم يظنون بأسمائه ويعيشون في رزقه فكيف يكفرون به فالألف مفتاح الله واللام مفتاح اسمه لطيف والميم مفتاح اسمه مجيد فالألف آلاء الله واللام لطف الله والميم مجد الله والألف سنة واللام ثلاثون سنة والميم أربعون سنة. هذا لفظ ابن أبي حاتم ونحوه رواه ابن جرير ثم شرع يوجه كل واحد من هذه الأقوال ويوفق بينها وأنه لا منافاة بين كل واحد منها وبين الآخر وأن الجمع ممكن فهي أسماء للسور ومن أسماء الله تعالى يفتتح بها السور فكل حرف منها دل على اسم من أسمائه وصفة من صفاته كما افتتح سورا كثيرة بتحميده وتسبيحه وتعظيمه قال ولا مانع من دلالة الحرف منها على اسم من أسماء الله وعلى صفة من صفاته وعلى مدة وغير ذلك كما ذكره الربيع بن أنس عن أبي العالية لأن الكلمة الواحدة تطلق على معاني كثيرة كلفظة الأمة فإنها تطلق ويراد به الدين كقوله تعالى \"إنا وجدنا آباءنا على أمة\" وتطلق ويراد بها الرجل المطيع لله كقوله تعالى \"إن إبراهيم كان أمة قانتا لله حنيفا ولم يك من المشركين\" وتطلق ويراد بها الجماعة كقوله تعالى \"وجد عليه أمة من الناس يسقون\" وقوله تعالى \"ولقد بعثنا في كل أمة رسولا\" وتطلق ويراد بها الحين من الدهر كقوله تعالى \"وقال الذي نجا منهما وادكر بعد أمة\" أي بعد حين على أصح القولين قال فكذلك هذا. هذا حاصل كلامه موجها ولكن هذا ليس كما ذكره أبو العالية فإن أبا العالية زعم أن الحرف دل على هذا وعلى هذا وعلى هذا معا ولفظة الأمة وما أشبهها من الألفاظ المشتركة في الاصطلاح إنما دل في القرآن في كل موطن على معنى واحد دل عليه سياق الكلام فأما حمله على مجموع محامله إذا أمكن فمسألة مختلف فيها بين علماء الأصول ليس هذا موضع البحث فيها والله أعلم. ثم إن لفظة الأمة تدل على كل من معانيها في سياق الكلام بدلالة الوضع فأما دلالة الحرف الواحد على اسم يمكن أن يدل على اسم آخر من غير أن يكون أحدهما أولى من الآخر في التقدير أو الإضمار بوضع ولا بغيره فهذا مما لا يفهم إلا بتوقيف والمسألة مختلف فيها وليس فيها إجماع حتى يحكم به وما أنشدوه من الشواهد على صحة إطلاق الحرف الواحد على بقية الكلمة فإن في السياق ما يدل على ما حذف بخلاف هذا كما قال الشاعر: قلنا قفي لنا فقالت قاف لا تحسبي أنا نسينا الإيجاف تعني وقفت. وقال الآخر: ما للظليم عال كيف لا يـ ينقد عنه جلده إذا يـ فقال ابن جرير كأنه أراد أن يقول إذا يفعل كذا وكذا فاكتفى بالياء من يفعل وقال الآخر: بالخير خيرات وإن شرا ف ولا أريد الشر إلا أن تـ يقول وإن شرا فشرا ولا أريد الشر إلا أن تشاء فاكتفى بالفاء والتاء من الكلمتين عن بقيتهما ولكن هذا ظاهر من سياق الكلام والله أعلم. قال القرطبي وفي الحديث \"من أعان على قتل مسلم بشطر كلمة\" الحديث قال سفيان هو أن يقول في اقتل\"ا قـ\" وقال خصيف عن مجاهد أنه قال فواتح السور كلها\"ق وص وحم وطسم والر\" وغير ذلك هجاء موضوع وقال بعض أهل العربية هي حروف من حروف المعجم استغنى بذكر ما ذكر منها في أوائل السور عن ذكر بواقيها التي هي تتمة الثمانية والعشرين حرفا كما يقول القائل ابني يكتب في - ا ب ت ث - أي في حروف المعجم الثمانية والعشرين فيستغني بذكر بعضها عن مجموعها حكاه ابن جرير. قلت مجموع الحروف المذكورة في أوائل السور بحذف المكرر منها أربعة عشر حرفا وهي - ال م ص ر ك ه ي ع ط س ح ق ن- يجمعها قولك: نص حكيم قاطع له سر. وهي نصف الحروف عددا والمذكور منها أشرف من المتروك وبيان ذلك من صناعة التصريف. قال الزمخشري وهذه الحروف الأربعة عشر مشتملة على أصناف أجناس الحروف يعني من المهموسة والمجهورة ومن الرخوة والشديدة ومن المطبقة والمفتوحة ومن المستعلية والمنخفضة ومن حروف القلقلة. وقد سردها مفصلة ثم قال: فسبحان الذي دقت في كل شيء حكمته. وهذه الأجناس المعدودة مكثورة بالمذكورة منها وقد علمت أن معظم الشيء وجله ينزل منزلة كله وههنا ههنا لخص بعضهم في هذا المقام كلاما فقال: لا شك أن هذه الحروف لم ينزلها سبحانه وتعالى عبثا ولا سدى ومن قال من الجهلة إن في القرآن ما هو تعبد لا معنى له بالكلمة فقد أخطأ خطأ كبيرا فتعين أن لها معنى في نفس الأمر فإن صح لنا فيها عن المعصوم شيء قلنا به وإلا وقفنا حيث وقفنا وقلنا \"آمنا به كل من عند ربنا\" ولم يجمع العلماء فيها على شيء معين وإنما اختلفوا فمن ظهر له بعض الأقوال بدليل فعليه اتباعه وإلا فالوقف حتى يتبين هذا المقام. المقام الآخر في الحكمة التي اقتضت إيراد هذه الحروف في أوائل السور ما هي مع قطع النظر عن معانيها في أنفسها فقال بعضهم إنما ذكرت ليعرف بها أوائل السور حكاه ابن جرير وهذا ضعيف لأن الفصل حاصل بدونها فيما لم تذكر فيه وفيما ذكرت فيه البسملة تلاوة وكتابة وقال آخرون بل ابتدئ بها لتفتح لاستماعها أسماع المشركين إذ تواصوا بالإعراض عن القرآن حتى إذا استمعوا له تلا عليهم المؤلف منه حكاه ابن جرير أيضا وهو ضعيف أيضا لأنه لو كان كذلك لكان ذلك في جميع السور لا يكون في بعضها بل غالبها ليس كذلك ولو كـان كذلك أيضا لانبغى الابتداء بها في أوائل الكلام معهم سواء كان افتتاح سورة أو غير ذلك ثم إن هذه السورة والتي تليها أعني البقرة وآل عمران مدنيتان ليستا خطابا للمشركين فانتقض ما ذكروه بهذه الوجوه. وقال آخرون بل إنما ذكرت هذه الحروف في أوائل السور التي ذكرت فيها بيانا لإعجاز القرآن وأن الخلق عاجزون عن معارضته بمثله هذا مع أنه مركب من هذه الحروف المقطعة التي يتخاطبون بها وقد حكى هذا المذهب الرازي في تفسيره عن المبرد وجمع من المحققين وحكى القرطبي عن الفراء وقطرب نحو هذا وقرره الزمخشري فى كشافه ونصره أتم نصر وإليه ذهب الشيخ الإمام العلامة أبو العباس ابن تيمية وشيخنا الحافظ المجتهد أبو الحجاج المزي وحكاه لي عن ابن تيمية. قال الزمخشري ولم ترد كلها مجموعة في أول القرآن وإنما كررت ليكون أبلغ في التحدي والتبكيت كما كررت قصص كثيرة وكرر التحدي بالصريح في أماكن قال وجاء منها على حرف واحد كقوله - ص ن ق- وحرفين مثل \"حم\" وثلاثة مثل \"الم\" وأربعة مثل \"المر\" و \"المص\" وخمسة مثل \"كهيعص- و- حم عسق\" لأن أساليب كلامهم على هذا من الكلمات ما هو على حرف وعلى حرفين وعلى ثلاثة وعلى أربعة وعلى خمسة لا أكثر من ذلك \"قلت\" ولهذا كل سورة افتتحت بالحروف فلا بد أن يذكر فيها الانتصار للقرآن وبيان إعجازه وعظمته وهذا معلوم بالاستقراء وهو الواقع في تسع وعشرين سورة ولهذا يقول تعالى \"الم ذلك الكتاب لا ريب فيه\" \"الم الله لا إله إلا هو الحي القيوم نزل عليك الكتاب بالحق مصدقا لما بين يديه\" \"المص كتاب أنزل إليك فلا يكن في صدرك حرج منه\" \"الر كتاب أنزلناه إليك لتخرج الناس من الظلمات إلى النور بإذن ربهم\" \"الم تنزيل الكتاب لا ريب فيه من رب العالمين\" \"حم تنزيل من الرحمن الرحيم\" \"حم عسق كذلك يوحي إليك وإلى الذين من قبلك الله العزيز الحكيم\" وغير ذلك من الآيات الدالة على صحة ما ذهب إليه هؤلاء لمن أمعن النظر والله أعلم. وأما من زعم أنها دالة على معرفة المدد وأنه يستخرج من ذلك أوقات الحوادث والفتن والملاحم فقد ادعى ما ليس له وطار في غير مطاره وقد ورد في ذلك حديث ضعيف وهو مع ذلك أدل على بطلان هذا المسلك من التمسك به على صحته وهو ما رواه محمد بن إسحق بن يسار صاحب المغازي حدثني الكلبي عن أبي صالح عن ابن عباس عن جابر بن عبدالله بن رباب قال مر أبو ياسر بن أخطب في رجال من يهود برسول الله صلى الله عليه وسلم وهو يتلو فاتحة سورة البقرة \"الم ذلك الكتاب لا ريب فيه\" فأتى أخاه بن أخطب في رجال من اليهود فقال تعلمون والله لقد سمعت محمدا يتلو فيما أنزل الله تعالى عليه \"الم ذلك الكتاب لا ريب فيه\" فقال أنت سمعته قال نعم قال فمشى حي بن أخطب في أولئك النفر من اليهود إلى رسول الله صلى الله عليه وسلم فقالوا يا محمد ألم يذكر أنك تتلوا فيما أنزل الله عليك \"الم ذلك الكتاب\"؟ فقال رسول الله صلى الله عليه وسلم \"بلى\" فقالوا جاءك بهذا جبريل من عند الله؟ فقال \"نعم\" قالوا لقد بعث الله قبلك أنبياء ما نعلمه بين لنبي منهم ما مدة ملكه وما أجل أمته غيرك. فقام حي بن أخطب وأقبل على من كان معه فقال لهم الألف واحدة واللام ثلاثون والميم أربعون فهذه إحدى وسبعون سنة أفتدخلون في دين نبي إنما مدة ملكه وأجل أمته إحدى وسبعون سنة؟ ثم أقبل على رسول الله صلى الله عليه وسلم فقال يا محمد هل مع هذا غيره فقال \"نعم\" قال ما ذاك؟ قال \"المص\" قال هذا أثقل وأطول الألف واحد واللام ثلاثون والميم أربعون والصاد تسعون فهذه إحدى وثلاثون ومائة سنة. هل مع هذا يا محمد غيره؟ قال \"نعم\" قال ما ذاك؟ قال \"الر\" قال هذا أثقل وأطول الألف واحدة واللام ثلاثون والراء مائتان فهذه إحدى وثلاثون ومائتا سنة. فهل مع هذا يا محمد غيره؟ قال \"نعم\" قال ماذا قال \"المر\" قال هذه أثقل وأطول الألف واحدة واللام ثلاثون والميم أربعون والراء مائتان فهذه إحدى وسبعون ومائتان ثم قال: لقد لبس علينا أمرك يا محمد حتى ما ندري أقليلا أعطيت أم كثيرا. ثم قال قوموا عنه ثم قال أبو ياسر لأخيه حي بن أخطب ولمن معه من الأحبار ما يدريكم لعله قد جمع هذا لمحمد كله إحدى وسبعون وإحدى وثلاثون ومائة وإحدى وثلاثون ومائتان وإحدى وسبعون ومائتان فذلك سبعمائة وأربع سنين؟ فقالوا لقد تشابه علينا أمره فيزعمون أن هؤلاء الآيات نزلت فيهم \"هو الذي أنزل عليك الكتاب منه آيات محكمات هن أم الكتاب وأخر متشابهات\" فهذا الحديث مداره على محمد بن السائب الكلبي وهو ممن لا يحتج بما انفرد به ثم كان مقتضى هذا المسلك إن كان صحيحا أن يحسب ما لكل حرف من الحروف الأربعة عشر التي ذكرناها وذلك يبلغ منه جملة كثيرة وإن حسبت مع التكرر فأطم وأعظم والله أعلم."
    },
    {
      "ayah": 10,
      "surah": 31,
      "text": "يبين سبحانه بهذا قدرته العظيمة على خلق السماوات والأرض وما فيهما وما بينهما فقال تعالى \"خلق السماوات بغير عمد\" قال الحسن وقتادة ليس لها عمد مرئية ولا غير مرئية. وقال ابن عباس وعكرمة ومجاهد لها عمد لا ترونها. وقد تقدم تقرير هذه المسألة في أول سورة الرعد بما أغنى عن إعادته \"وألقى في الأرض رواسي\" يعني الجبال أرست الأرض وثقلتها لئلا تضطرب بأهلها على وجه الماء ولهذا قال \"أن تميد بكم\" أي لئلا تميد بكم. وقوله تعالى \"وبث فيها من كل دابة\" أي وذرأ فيها من أصناف الحيوانات مما لا يعلم عدد أشكالها وألوانها إلا الذي خلقها ولما قرر سبحانه أنه الخالق نبه على أنه الرازق بقوله \"وأنزلنا من السماء ماء فأنبتنا فيها من كل زوج كريم\" أي من كل زوج من النبات كريم أي حسن المنظر وقال الشعبي والناس أيضا من نبات الأرض فمن دخل الجنة فهو كريم ومن دخل النار فهو لئيم."
    },
    {
      "ayah": 11,
      "surah": 31,
      "text": "وقوله تعالى \"هذا خلق الله\" أي هذا الذي ذكره تعالى من خلق السماوات والأرض وما بينهما صادر عن فعل الله وخلقه وتقديره وحده لا شريك له في ذلك ولهذا قال تعالى \"فأروني ماذا خلق الذين من دونه\" أي مما تعبدون وتدعون من الأصنام والأنداد \"بل الظالمون\" يعني المشركين بالله العابدين معه غيره \"في ضلال\" أي في جهل وعمى \"مبين\" أي ظاهر واضح لا خفاء به."
    },
    {
      "ayah": 12,
      "surah": 31,
      "text": "اختلف السلف في لقمان هل كان نبيا أو عبدا صالحا من غير نبوة؟ على قولين الأكثرون على الثاني وقال سفيان الثوري عن الأشعث عن عكرمة عن ابن عباس قال كان لقمان عبدا حبشيا نجارا وقال قتادة عن عبد الله بن الزبير قلت لجابر بن عبد الله ما انتهى إليكم من شأن لقمان؟ قال كان قصيرا أفطس الأنف من النوبة وقال يحيى بن سعيد الأنصاري عن سعيد بن المسيب قال كان لقمان من سودان مصر ذو مشافر أعطاه الله الحكمة ومنعه النبوة وقال الأوزاعي حدثني عبد الرحمن بن حرملة قال جاء رجل أسود إلى سعيد بن المسيب يسأله فقال له سعيد بن المسيب لا تحزن من أجل أنك أسود فإنه كان من أخير الناس ثلاثة من السودان بلال ومهجع مولى عمر بن الخطاب ولقمان الحكيم كان أسود نوبيا ذا مشافر وقال ابن جرير حدثنا وكيع حدثنا أبي عن أبي الأشهب عن خالد الربعي قال كان لقمان عبدا حبشيا نجارا فقال له مولاه اذبح لنا هذه الشاة فذبحها قال أخرج أطيب مضغتين فيها فأخرج اللسان والقلب ثم مكث ما شاء الله ثم قال اذبح لنا هذه الشاة فذبحها قال أخرج أخبث مضغتين فيها فأخرج اللسان والقلب فقال له مولاه أمرتك أن تخرج أطيب مضغتين فيها فأخرجتهما وأمرتك أن تخرج أخبث مضغتين فيها فأخرجتهما فقال لقمان إنه ليس من شيء أطيب منهما إذا طابا ولا أخبث منهما إذا خبثا وقال شعبة عن الحكم عن مجاهد كان لقمان عبدا صالحا ولم يكن نبيا وقال الأعمش قال مجاهد كان لقمان عبدا أسود عظيم الشفتين مشقق القدمين وقال حكام بن سالم عن سعيد الزبيدي عن مجاهد كان لقمان الحكيم عبدا حبشيا غليظ الشفتين مصفح القدمين قاضيا على بني إسرائيل وذكر غيره أنه كان قاضيا على بني إسرائيل في زمان داود عليه السلام وقال ابن جرير حدثنا ابن حميد حدثنا الحكم حدثنا عمرو بن قيس قال كان لقمان عبدا أسود غليظ الشفتين مصفح القدمين فأتاه رجل وهو في مجلس ناس يحدثهم فقال له ألست الذي كنت ترعى معي الغنم في مكان كذا وكذا؟ قال نعم قال فما بلغ بك ما أرى؟ قال صدق الحديث والصمت عما لا يعنيني وقال ابن أبي حاتم حدثنا أبو زرعة حدثنا صفوان حدثنا الوليد حدثنا عبد الرحمن بن يزيد عن جابر قال: إن الله رفع لقمان الحكيم بحكمته فرآه رجل كان يعرفه قبل ذلك فقال له ألست عبد بني فلان الذي كنت ترعى بالأمس؟ قال بلى قال فما بلغ بك ما أرى؟ قال قدر الله وأداء الأمانة وصدق الحديث وتركي مالا يعنيني فهذه الآثار منها ما هو صرح فيه بنفي كونه نبيا ومنها ما هو مشعر بذلك لأن كونه عبدا قد مسه الرق ينافي كونه نبيا لأن الرسل كانت تبعث في أحساب قومها ولهذا كان جمهور السلف على أنه لم يكن نبيا وإنما ينقل كونه نبيا عن عكرمة إن صح السند إليه فإنه رواه ابن جرير وابن أبي حاتم من حديث وكيع عن إسرائيل عن جابر عن عكرمة قال كان لقمان نبيا وجابر هذا هو ابن يزيد الجعفي وهو ضعيف والله أعلم وقال عبد الله بن وهب أخبرني عبد الله بن عياش القتباني عن عمر مولى غفرة قال وقف رجل على لقمان الحكيم فقال أنت لقمان أنت عبد بني الحسحاس؟ قال نعم قال أنت راعي الغنم؟ قال نعم قال أنت الأسود؟ قال أما سوادي فظاهر فما الذي يعجبك من أمري؟ قال وطء الناس بساطك وغشيهم بابك ورضاهم بقولك قال يا ابن أخي إن صغيت إلى ما أقول لك كنت كذلك قال لقمان غضي بصري وكفي لسانى وعفة طعمتي وحفظي فرجي وقولي بصدقي ووفائي بعهدي وتكرمتي ضيفي وحفظي جاري وتركي ما لا يعنيني فذاك الذي صيرني إلى ما ترى وقال ابن أبي حاتم حدثنا أبي حدثنا ابن فضيل حدثنا عمرو بن وافد عن عبدة بن رباح عن ربيعة عن أبي الدرداء أنه قال يوما وذكر لقمان الحكيم فقال ما أوتي عن أهل ولا مال ولا حسب ولا خصال ولكنه كان رجلا صمصامة سكيتا طويل التفكر عميق النظر لم ينم نهارا قط ولم يره أحد قط يبزق ولا يتنخع ولا يبول ولا يتغوط ولا يغتسل ولا يعبث ولا يضحك وكان لا يعيد منطقا نطقه إلا أن يقول حكمة يستعيدها إياه أحد وكان قد تزوج وولد له أولاد فماتوا فلم يبك عليهم وكان يغشى السلطان ويأتي الحكام لينظر ويتفكر ويعتبر فبذلك أوتي ما أوتى. وقد ورد أثر غريب عن قتادة رواه ابن أبي حاتم فقال حدثنا أبي حدثنا العباس بن الوليد حدثنا زيد بن يحيى بن عبيد الخزاعي حدثنا سعيد بن بشير عن قتادة قال: خير الله لقمان الحكيم بين النبوة والحكمة فاختار الحكمة على النبوة قال فأتاه جبريل وهو نائم فذر عليه الحكمة أو رش عليه الحكمة قال فأصبح ينطق بها قال سعيد فسمعت عن قتادة يقول قيل للقمان كيف اخترت الحكمة على النبوة وقد خيرك ربك؟ فقال إنه لو أرسل إلي بالنبوة عزمة لرجوت فيه الفوز منه ولكنت أرجو أن أقوم بها ولكنه خيرني فخفت أن أضعف عن النبوة فكانت الحكمة أحب إلي. فهذا من رواية سعيد بن بشير وفيه ضعف قد تكلموا فيه بسببه فالله أعلم والذي رواه سعيد بن أبي عروبة عن قتادة في قوله تعالى \"ولقد آتينا لقمان الحكمة\" أي الفقه في الإسلام ولم يكن نبيا ولم يوح إليه وقوله \"ولقد آتينا لقمان الحكمة\" أي الفهم والعلم والتعبير \"أن اشكر لله\" أي أمرناه أن يشكر الله عز وجل على ما أتاه الله ومنحه ووهبه من الفضل الذي خصصه به عمن سواه من أبناء جنسه وأهل زمانه ثم قال تعالى \"ومن يشكر فإنما يشكر لنفسه\" أي إنما يعود نفع ذلك وثوابه على الشاكرين لقوله تعالى \"ومن عمل صالحا فلأنفسهم يمهدون\" وقوله \"ومن كفر فإن الله غني حميد\" أى غنى عن العباد لا يتضرر بذلك ولو كفر أهل الأرض كلهم جميعا فإنه الغني عمن سواه فلا إله إلا الله ولا نعبد إلا إياه."
    },
    {
      "ayah": 13,
      "surah": 31,
      "text": "يقول تعالى مخبرا عن وصية لقمان لولده وهو لقمان بن عنقاء بن سدون واسم ابنه ثاران في قول حكاه السهيلي وقد ذكره الله تعالى بأحسن الذكر وأنه آتاه الحكمة وهو يوصي ولده الذي هو أشفق الناس عليه وأحبهم إليه فهو حقيق أن يمنحه أفضل ما يعرف ولهذا أوصاه أولا بأن يعبد الله وحده لا يشرك به شيئا ثم قال محذرا له \"إن الشرك لظلم عظيم\" أي هو أعظم الظلم قال البخاري حدثنا قتيبة حدثنا جرير عن الأعمش عن إبراهيم عن علقمة عن عبد الله قال: لما نزلت \"الذين آمنوا ولم يلبسوا إيمانهم بظلم\" شق ذلك على أصحاب رسول الله صلى الله عليه وسلم وقالوا: أينا لم يلبس إيمانه بظلم؟ فقال رسول الله \"إنه ليس بذلك ألا تسمع لقول لقمان: يا بني لا تشرك بالله إن الشرك لظلم عظيم\" ورواه مسلم من حديث الأعمش به ثم قرن بوصيته إياه بعبادة الله وحده البر بالوالدين كما قال تعالى \"وقضى ربك أن لا تعبدوا إلا أياه وبالوالدين إحسانا\" وكثيرا ما يقرن تعالى بين ذلك في القرآن."
    },
    {
      "ayah": 14,
      "surah": 31,
      "text": "وقال ههنا \"ووصينا الإنسان بوالديه حملته أمه وهنا على وهن\" قال مجاهد مشقة وهن الولد وقال قتادة جهدا على جهد وقال عطاء الخراساني ضعفا على ضعف وقوله \"وفصاله في عامين\" أي تربيته وإرضاعه بعد وضعه في عامين كما قال تعالى \"والوالدات يرضعن أولادهن حولين كاملين لمن أراد أن يتم الرضاعة\" ومن ههنا استنبط ابن عباس وغيره من الأئمة أن أقل مدة الحمل ستة أشهر لأنه قال في الآية الأخرى \"وحمله وفصاله ثلاثون شهرا\" وإنما يذكر تعالى تربية الوالدة وتعبها ومشقتها في سهرها ليلا ونهارا ليذكر الولد بإحسانه المتقدم إليه كما قال تعالى \"وقل رب ارحمها كما ربياني صغيرا\" ولهذا قال \"أن اشكر لي ولوالديك إلي المصير\" أي فإنى سأجزيك على ذلك أوفر جزاء قال ابن أبي حاتم حدثنا زرعة حدثنا عبد الله بن أبي شيبة ومحمود بن غيلان قالا حدثنا عبيد الله أخبرنا إسرائيل عن أبي إسحاق عن سعيد بن وهب قال: قدم علينا معاذ بن جبل وكان بعثه النبي فقام وحمد الله وأثنى عليه ثم قال: إنى رسول رسول الله صلى الله عليه وسلم إليكم أن تعبدوا الله ولا تشركوا به شيئا وأن تطيعوني لا آلوكم خيرا وإن المصير إلى الله إلى الجنة أو إلى النار إقامة فلا ظعن وخلود فلا موت."
    },
    {
      "ayah": 15,
      "surah": 31,
      "text": "وقوله \"وإن جاهداك على أن تشرك بي ما ليس لك به علم فلا تطعهما\" أي إن حرصا عليك كل الحرص على أن تتابعهما على دينهما فلا تقبل منهما ذلك ولا يمنعك ذلك من أن تصاحبهما في الدنيا معروفا أي محسنا إليهما \"واتبع سبيل من أناب إلي\" يعني المؤمنين \"ثم إلي مرجعكم فأنبئكم بما كنتم تعملون\" قال الطبراني في كتاب العشرة حدثنا أبو عبد الرحمن عبد الله بن أحمد بن حنبل حدثنا أحمد بن أيوب بن راشد حدثنا مسلمة بن علقمة عن داود بن أبي هند أن سعد بن مالك قال أنزلت في هذه الآية \"وإن جاهداك على أن تشرك بي ما ليس لك به علم فلا تطعهما\" الآية قال كنت رجلا برا بأمي فلما أسلمت قالت يا سعد ما هذا الذي أراك قد أحدثت لتدعن دينك هذا أو لا آكل ولا أشرب حتى أموت فتعير بي فيقال يا قاتل أمه فقلت لا تفعلي يا أمه فإني لا أدع ديني هذا لشيء فمكثت يوما وليلة لم تأكل فأصبحت قد جهدت فمكثت يوما آخر وليلة لم تأكل فأصبحت قد جهدت فمكثت يوما وليلة أخرى لا تأكل فأصبحت قد اشتد جهدها فلما رأيت ذلك قلت يا أمه: تعلمين والله لو كانت لك مائة نفس فخرجت نفسا نفسا ما تركت ديني هذا لشيء فإن شئت فكلي وإن شئت لا تأكلي فأكلت."
    },
    {
      "ayah": 16,
      "surah": 31,
      "text": "هذه وصايا نافعة قد حكاها الله سبحانه عن لقمان الحكيم ليمتثلها الناس ويقتدوا بها فقال \"يا بني إنها إن تك مثقال حبة من خردل\" أي إن المظلمة أو الخطيئة لو كانت مثقال حبة خردل وجوز بعضهم أن يكون الضمير في قوله إنها ضمير الشأن والقصة وجوز على هذا رفع مثقال والأول أولى وقوله عز وجل \"يأت بها الله\" أي أحضرها الله يوم القيامة حين يضع الموازين القسط وجازى عليها إن خيرا فخير وإن شرا فشر كما قال تعالى \"ونضع الموازين القسط ليوم القيامة فلا تظلم نفس شيئا\" الآية وقال تعالى \"فمن يعمل مثقال ذرة خيرا يره ومن يعمل مثقال ذرة شرا يره\" ولو كانت تلك الذرة محصنة محجبة في داخل صخرة صماء أو غائبة ذاهبة في أرجاء السماوات والأرض فإن الله يأتي بها لأنه لا تخفى عليه خافية ولا يعزب عنه مثقال ذرة في السماوات ولا في الأرض. ولهذا قال تعالى \"إن الله لطيف خبير\" أي لطيف العلم فلا تخفى عليه الأشياء وإن دقت ولطفت وتضاءلت \"خبير\" بدبيب النمل في الليل البهيم وقد زعم بعضهم أن المراد بقوله \"فتكن في صخرة\" أنها صخرة تحت الأرضين السبع وذكره السدي بإسناده ذلك المطروق عن ابن مسعود وابن عباس وجماعة من الصحابة إن صح ذلك ويروى هذا عن عطية العوفي وأبي مالك والثوري والمنهال بن عمرو وغيرهم وهذا والله أعلم كأنه متلقى من الإسرائيليات التي لا تصدق ولا تكذب والظاهر والله أعلم أن المراد أن هذه الحبة في حقارتها لو كانت داخل صخرة فإن الله سيبديها ويظهرها بلطيف علمه. كما قال الإمام أحمد حدثنا حسن بن موسى حدثنا ابن لهيعة حدثنا دراج عن أبي الهيثم عن أبي سعيد الخدري عن رسول الله صلى الله عليه وسلم قال \"لو أن أحدكم يعمل في صخرة صماء ليس لها باب ولا كوة لخرج عمله للناس كائنا ما كان\"."
    },
    {
      "ayah": 17,
      "surah": 31,
      "text": "ثم قال \"يا بني أقم الصلاة\" أي بحدودها وفروضها وأوقاتها \"وأمر بالمعروف وانه عن االمنكر\" أي بحسب طاقتك وجهدك \"واصبر على ما أصابك\" علم أن الآمر بالمعروف والناهي عن المنكر لا بد أن يناله من الناس أذى فأمره بالصبر وقوله \"إن ذلك من عزم الأمور\" إن الصبر على أذى الناس لمن عزم الأمور."
    },
    {
      "ayah": 18,
      "surah": 31,
      "text": "وقوله \"ولا تصعر خدك للناس\" يقول لا تعرض بوجهك عن الناس إذا كلمتهم أو كلموك احتقارا منك لهم واستكبارا عليهم ولكن ألن جانبك وابسط وجهك إليهم كما جاء في الحديث \"ولوأن تلقى أخاك ووجهك إليه منبسط وإياك وإسبال الإزار فإنها من المخيلة والمخيلة لا يحبها الله\" قال علي بن أبي طلحة عن ابن عباس في قوله \"ولا تصعر خدك للناس\" يقول لا تتكبر فتحتقر عباد الله وتعرض عنهم بوجهك إذا كلموك وكذا روى العوفي وعكرمة عنه وقال مالك عن زيد بن أسلم \"ولا تصعر خدك للناس\" لا تتكلم وأنت معرض وكذا روي عن مجاهد وعكرمة ويزيد بن الأصم وأبي الجوزاء وسعيد بن جبير والضحاك وابن زيد وغيرهم وقال إبراهيم النخعي يعني بذلك التشديق في الكلام. والصواب القول الأول قال ابن جرير: وأصل الصعر داء يأخذ الإبل في أعناقها أو رؤوسها حتى تفلت أعناقها عن رؤوسها فشبه به الرجل المتكبر ومنه قول عمرو بن حي التغلبي: وكنا إذا الجبار صعر خده أقمنا له من ميله فتقوما وقال أبو طالب في شعره: وكنا قديما لا نقر ظلامة إذا ما ثنوا صعر الرؤوس نقيمها وقوله \"ولا تمش في الأرض مرحا\". أي خيلاء متكبرا جبارا عنيدا لا تفعل ذلك يبغضك الله ولهذا قال \"إن الله لا يحب كل مختال فخور\" أي مختال معجب في نفسه فخور أي على غيره وقال تعالى \"ولا تمش في الأرض مرحا إنك لن تخرق الأرض ولن تبلغ الجبال طولا\" وقد تقدم الكلام على ذلك في موضعه وقال الحافظ أبو القاسم الطبراني حدثنا محمد بن عبد الله الحضرمي حدثنا محمد بن عمران بن أبي ليلى حدثنا أبي عن ابن أبي ليلى عن عيسى عن عبد الرحمن بن أبي ليلى عن ثابت بن قيس بن شماس قال: ذكر الكبر عند رسول الله صلى الله عليه وسلم فشدد فيه فقال \"إن الله لا يحب كل مختال فخور\" فقال رجل من القوم والله يا رسول الله إنى لأغسل ثيابي فيعجبني بياضها ويعجبني شراك نعلي وعلاقة سوطي فقال \"ليس ذلك الكبر إنما الكبر أن تسفه الحق وتغمط الناس\" ورواه من طريق أخرى بمثله وفيه قصة طويلة ومقتل ثابت ووصيته بعد موته."
    },
    {
      "ayah": 19,
      "surah": 31,
      "text": "وقوله \"واقصد في مشيك\" أي امشي مشيا مقتصدا ليس بالبطيء المتثبط ولا بالسريع المفرط بل عدلا وسطا بين بين. وقوله \"واغضض من صوتك\" أي لا تبالغ في الكلام ولا ترفع صوتك فيما لا فائدة فيه ولهذا قال \"إن أنكر الأصوات لصوت الحمير\" وقال مجاهد وغير واحد إن أقبح الأصوات لصوت الحمير أي غاية من رفع صوته أنه يشبه بالحمير في علوه ورفعه ومع هذا هو بغيض إلى الله وهذا التشبيه في هذا بالحمير يقتضي تحريمه وذمه غاية الذم لأن رسول الله صلى الله عليه وسلم قال \"ليس لنا مثل السوء العائد في هبته كالكلب يقيء ثم يعود في قيئه\" وقال النسائي عند تفسير هذه الآية حدثنا قتيبة بن سعيد حدثنا الليث عن جعفر بن ربيعة عن الأعرج عن أبي هريرة عن النبي صلى الله عليه وسلم قال \"إذا سمعتم صياح الديكة فاسألوا الله من فضله وإذا سمعتم نهيق الحمير فتعوذوا بالله من الشيطان فإنها رأت شيطانا\" وقد أخرجه بقية الجماعة سوى ابن ماجه من طرق عن جعفر بن ربيعة به وفي بعض الألفاظ بالليل فالله أعلم. فهذه وصايا نافعة جدا وهي من قصص القرآن العظيم عن لقمان الحكيم وقد روي عنه من الحكم والمواعظ أشياء كثيرة فلنذكر منها أنموذجا ودستورا إلى ذلك. قال الإمام أحمد حدثنا علي بن إسحاق أخبرنا ابن المبارك أخبرنا سفيان أخبرني نهشل بن مجمع الضبي عن قزعة عن ابن عمر قال: أخبرنا رسول الله صلى الله عليه وسلم قال \"إن لقمان الحكيم كان يقول إن الله إذا استودع شيئا حفظه\" وروى ابن أبي حاتم حدثنا أبو سعيد الأشج حدثنا عيسى بن يونس عن الأوزاعي عن موسى بن سليمان عن القاسم بن مخيمرة أن رسول الله صلى الله عليه وسلم قال \"قال لقمان الحكيم لابنه وهو يعظه يا بني إياك والتقنع فإنه مخوفة بالليل مذمة بالنهار\" وقال حدثنا أبي حدثنا عمرو بن عثمان بن ضمرة حدثنا الثري بن يحيى قال: قال لقمان لابنه يا بني إن الحكمة أجلست المساكين مجالس الملوك وقال أيضا حدثنا أبي حدثنا عبدة بن سليمان أخبرنا ابن المبارك حدثنا عبد الرحمن المسعودي عن عون بن عبد الله قال: قال لقمان لابنه يا بني إذا أتيت نادي قوم فارمهم بسهم الإسلام يعني السلام ثم اجلس في ناحيتهم فلا تنطق حتى تراهم قد نطقوا فإن أفاضوا في ذكر الله فأجل سهمك معهم وإن أفاضوا في غير ذلك فتحول عنهم إلى غيرهم. وقال أيضا حدثنا أبي حدثنا عمرو بن عثمان بن سعيد بن كثير بن دينار حدثنا ضمرة عن حفص بن عمر قال: وضع لقمان جرابا من خردل إلى جانبه وجعل يعظ ابنه وعظة ويخرج خردلة حتى نفذ الخردل فقال يا بني لقد وعظتك موعظة لو وعظها جبل تفطر قال فتفطر ابنه وقال أبو القاسم الطبراني حدثنا يحيى بن عبد الباقي المصيصي حدثنا أحمد بن عبد الرحمن الخزاعي ثنا عثمان بن عبد الرحمن الطرائفي حدثنا أنس بن سفيان المقدسي عن خليفة بن سلام عن عطاء بن أبي رباح عن ابن عباس قال: قال رسول الله \"اتخذوا السودان فإن ثلاثة منهم من سادات أهل الجنة: لقمان الحكيم والنجاشي وبلال المؤذن\" قال الطبراني أراد الحبش. \"فصل في الخمول والتواضع\" وذلك متعلق بوصية لقمان عليه السلام لابنه وقد جمع في ذلك الحافظ أبو بكر بن أبي الدنيا كتابا مفردا ونحن نذكر منه مقاصده قال: حدثنا إبراهيم بن المنذر حدثنا عبد الله بن موسى المدنى عن أسامة بن زيد ابن حفص بن عبد الله بن أنس عن جده أنس بن مالك سمعت رسول الله صلى الله عليه وسلم يقول \"رب أشعث ذي طمرين يصفح عن أبواب الناس إذا أقسم على الله لأبره\" ثم رواه من حديث جعفر بن سليمان عن ثابت وعلي بن زيد عن أنس عن النبي صلى الله عليه وسلم فذكره وزاد \"منهم البراء بن مالك\" وروي أيضا عن أنس رضي الله عنه \"قال: قال رسول الله صلى الله عليه وسلم \"طوبى للأتقياء الأثرياء الذين إذا حضروا لم يعرفوا وإذا غابوا لم يفتقدوا أولئك مصابيح مجردون من كل فتنة غبراء مشتتة\" وقال أبو بكر بن سهل التميمي حدثنا ابن أبي مريم حدثنا نافع بن يزيد عن عياش بن عباس عن عيسى بن عبد الرحمن عن زيد بن أسلم عن أبيه عن عمر رضي الله عنه \"أنه دخل المسجد فإذا هو بمعاذ بن جبل يبكي عند قبر رسول الله صلى الله عليه وسلم فقال له ما يبكيك يا معاذ؟ قال حديث سمعته من رسول الله صلى الله عليه وسلم: سمعته يقول \"إن اليسير من الرياء شرك وإن الله يحب الأتقياء الأخفياء الأثرياء الذين إذا غابوا لم يفتقدوا وإذا حضروا لم يعرفوا قلوبهم مصابيح الهدى ينجون من كل غبراء مظلمة\" حدثنا الوليد بن شجاع حدثنا غنام بن علي عن حميد بن عطاء الأعرج عن عبد الله بن الحارث عن عبد الله بن مسعود رضي الله عنه عن النبي قال \"رب ذي طمرين لا يؤبه له لو أقسم على الله لأبره لو قال اللهم إنى أسألك الجنة لأعطاه الله الجنة ولم يعطه من الدنيا شيئا\" وقال أيضا حدثنا إسحاق بن إبراهيم حدثنا أبو معاوية عن الأعمش عن سالم بن أبي الجعد قال: قال رسول الله صلى الله عليه وسلم \"إن من أمتي من لو أتى باب أحدكم يسأله دينارا أو درهما أو فلسا لم يعطه ولو سأل الله الجنة لأعطاه إياها ولو سأله الدنيا لم يعطه إياها ولم يمنعها إياه لهوانه عليه ذو طمرين لا يؤبه له لو أقسم على الله لأبره\" وهذا مرسل من هذا الوجه وقال أيضا حدثنا إسحاق بن إبراهيم أخبرنا جعفر بن سليمان حدثنا عوف قال: قال أبو هريرة قال: قال رسول الله صلى الله عليه وسلم \"إن من ملوك الجنة من هو أشعث أغبر ذو طمرين لا يؤبه له الذين إذا استأذنوا على الأمراء لم يؤذن لهم وإذا خطبوا النساء لم ينكحوا وإذا قالوا لم ينصف لهم حوائج أحدهم تتجلجل في صدره لو قسم نوره يوم القيامة بين الناس لوسعهم\" قال وأنشدني عمر بن شيبة عن ابن عائشة قال: قال عبد الله بن المبارك: ألا رب ذي طمرين في منزل غدا زرابيه مبثوثة ونمارقه قد اطردت أنواره حول قصره وأشرق والتفت عليه حدائقه وروي أيضا من حديث عبيد الله بن زحر عن علي بن زيد عن القاسم عن أبي أمامة مرفوعا \"قال الله: من أغبط أوليائي عندي مؤمن خفيف الحاذ ذو حظ من صلاة أحسن عبادة ربه وأعطاه في السر وكان غامضا في الناس لا يشار إليه بالأصابع إن صبر على ذلك\" قال ثم أنفذ رسول الله صلى الله عليه وسلم بيده وقال \"عجلت منيته وقل تراثه وقلت بواكيه\" وعن عبد الله بن عمرو قال: أحب عباد الله إلى الله الغرباء قيل ومن الغرباء؟ قال الفرارون بدينهم يجمعون يوم القيامة إلى عيسى ابن مريم. وقال الفضيل بن عياض بلغني أن الله تعالى يقول للعبد يوم القيامة ألم أنعم عليك ألم أعطك ألم أسترك؟ ألم... ألم. ..ألم أجمل ذكرك ثم قال الفضيل إن استطعت أن لا تعرف فافعل وما عليك أن لا يثنى عليك وما عليك أن تكون مذموما عند الناس محبوبا عند الله. وكان ابن محيريز يقول اللهم إنى أسألك ذكرا خاملا وكان الخليل بن أحمد يقول اللهم اجعلني عندك من أرفع خلقك واجعلني في نفسي من أوضع خلقك وعند الناس من أوسط خلقك ثم قال: \"باب ما جاء في الشهرة\" حدثنا أحمد بن عيسى المصري حدثنا ابن وهب عن عمر بن الحارث وابن لهيعة عن يزيد بن أبي حبيب عن سنان بن سعد عن أنس عن رسول الله صلى الله عليه وسلم أنه قال \"حسب امرئ من الشر- إلا من عصم الله - أن يشير الناس إليه بالأصابع في دينه ودنياه وإن الله لا ينظر إلى صوركم ولكن إلى قلوبكم وأعمالكم\" وروي مثله عن إسحاق ابن البهلول عن ابن أبي فديك عن محمد بن عبد الواحد الأخنسي عن عبد الواحد بن أبي كثير عن جابر بن عبد الله مرفوعا مثله وروى عن الحسن مرسلا نحوه فقيل للحسن فإنه يشار إليك بالأصابع فقال إنما المراد من يشار إليه في دينه بالبدعة وفي دنياه بالفسق: وعن علي رضي الله عنه \"قال: لا تبدأ لأن تشتهر ولا ترفع شخصك لتذكر وتعلم واكتم واصمت تسلم تسر الأبرار وتغيظ الفجار وقال إبراهيم بن أدهم رحمه الله: ما صدق الله من أحب الشهرة وقال أيوب ما صدق الله عبد إلا سره أن لا يشعر بمكانه وقال محمد بن العلاء من أحب الله أحب أن لا يعرفه الناس وقال سماك بن سلمة إياك وكثرة الأخلاء وقال أبان بن عثمان إن أحببت أن يسلم إليك دينك فأقل من المعارف كان أبو العالية إذا جلس إليه أكثر من ثلاثة نهض وتركهم وقال حدثنا علي بن الجعد أخبرنا شعبة عن عوف عن أبي رجاء قال: رأى طلحة قوما يمشون معه فقال ذباب طمع وفراش النار وقال ابن إدريس عن هارون بن أبي عيسى عن سليم بن حنظلة قال: بينا نحن حول أبي إذ علاه عمر بن الخطاب بالدرة وقال: إنها مذلة للتابع وفتنة للمتبوع. وقال ابن عون عن الحسن خرج ابن مسعود فاتبعه أناس فقال والله لو تعلمون ما أغلق عليه بابي ما اتبعني منكم رجلان وقال حماد بن زيد كنا إذا مررنا على المجلس ومعنا أيوب فسلم ردوا ردا شديدا فكان ذلك نعمة وقال عبد الرزاق عن معمر كان أيوب يطيل قميصه فقيل له في ذلك فقال إن الشهرة فيما مضى كانت في طول القميص واليوم في تشميره. واصطنع مرة نعلين على حذو نعلي النبي صلى الله عليه وسلم فلبسهما أياما ثم خلعهما وقال لم أر الناس يلبسونهما وقال إبراهيم النخعي لا تلبس من الثياب ما يشهر في ألفتها ولا ما يزدريك السفهاء. وقال الثوري كانوا يكرهون من الثياب الجياد التي يشتهر بها ويرفع الناس إليه فيها أبصارهم والثياب الرديئة التي يحتقر فيها ويستذل دينه. وحدثنا خالد بن خداش حدثنا حماد عن أبي حسنة صاحب الزيادي قال: كنا عند أبي قلابة إذ دخل عليه رجل عليه أكسية فقال إياكم وهذا الحمار النهاق وقال الحسن رحمه الله إن قوما جعلوا الكبر في قلوبهم والتواضع في ثيابهم فصاحب الكساء بكسائه أعجب من صاحب المطرق بمطرقه ما لهم تفاقدوا. وفي بعض الأخبار أن موسى عليه السلام \"قال لبني إسرائيل ما لكم تأتوني عليكم ثياب الرهبان وقلوبكم قلوب الذئاب البسوا ثياب الملوك وألينوا قلوبكم بالخشية: \"فصل في حسن الخلق\" قال أبو التياح رضي الله عنه \"كان رسول الله صلى الله عليه وسلم من أحسن الناس خلقا\" وعن عطاء عن ابن عمر قيل يا رسول أي المؤمنين أفضل؟ قال \"أحسنهم خلقا\" وعن نوح بن عباد عن ثابت عن أنس مرفوعا \"إن العبد ليبلغ بحسن خلقه درجات الآخرة وشرف المنازل وإنه لضعيف العبادة وإنه ليبلغ بسوء خلقه درك جهنم وهو عابد\" وعن سيار بن هارون عن حميد عن أنس مرفوعا \"ذهب حسن الخلق بخير الدنيا والآخرة\" وعن عائشة مرفوعا \"إن العبد ليبلغ بحسن خلقه درجة قائم الليل صائم النهار\" وقال ابن أبي الدنيا حدثني أبو مسلم عبد الرحمن بن يونس حدثنا عبد الله بن إدريس أخبرني أبي وعمي عن جدي عن أبي هريرة رضي الله عنه سئل رسول الله صلى الله عليه وسلم وسلم عن أكثر ما يدخل الناس الجنة فقال \"تقوى الله وحسن الخلق\" وسئل عن أكثر ما يدخل الناس النار فقال \"الأجوفان: الفم والفرج\" وقال أسامة بن شريك كنت عند رسول الله صلى الله عليه وسلم فجاءته الأعراب من كل مكان فقالوا يا رسول الله ما خير ما أعطي الإنسان؟ قال \"حسن الخلق\". وقال يعلى بن سماك عن أم الدرداء عن أبي الدرداء يبلغ به قال: ما من شيء أثقل في الميزان من خلق حسن وكذا رواه عطاء عن أم الدرداء به وعن مسروق عن عبد الله بن عمرو مرفوعا \"إن من خياركم أحسنكم أخلاقا\" حدثنا عبد الله بن أبي الدنيا حدثنا محمد بن عيسى عن محمد بن أبي سارة عن الحسن بن علي قال: قال رسول الله صلى الله عليه وسلم \"إن الله ليعطي العبد من الثواب على حسن الخلق كما يعطي المجاهد في سبيل الله يغدو عليه الأجر ويروح\" وعن مكحول عن أبي ثعلبة مرفوعا \"إن أحبكم إلي وأقربكم مني مجلسا أحاسنكم أخلاقا وإن أبغضكم إلي وأبعدكم مني منزلا في الجنة مساويكم أخلاقا الثرثارون المتشدقون المتفيهقون\" وعن أبي أويس عن محمد بن المنكدر عن جابر مرفوع \"ألا أخبركم بأكملكم إيمانا أحاسنكم أخلاقا الموطؤون أكنافا الذين يؤلفون ويألفون\" وقال الليث عن يزيد بن عبد الله بن أسامة عن بكر بن أبي الفرات قال: قال رسول الله صلى الله عليه وسلم \"ما حسن الله خلق رجل وخلقه فتطعمه النار\" وعن عبد الله بن غالب الحداني عن أبي سعيد مرفوعا \"خصلتان لا يجتمعان في مؤمن البخل وسوء الخلق\" وقال ميمون بن مهران عن رسول الله صلى الله عليه وسلم \"ما من ذنب أعظم عند الله من سوء الخلق\" وذلك أن صاحبه لا يخرج من ذنب إلا وقع في آخر. قال حدثنا علي بن الجعد حدثنا أبو المغيرة الأحمسي حدثنا عبد الرحمن بن إسحاق عن رجل من قريش قال: قال رسول الله صلى الله عليه وسلم \"ما من ذنب أعظم عند الله من سوء الخلق إن الخلق الحسن ليذيب الذنوب كما تذيب الشمس الجليد وإن الخلق السيء ليفسد العمل كما يفسد الخل العسل\" وقال عبد الله بن إدريس عن أبيه عن جده عن أبي هريرة مرفوع \"إنكم لا تسعون الناس بأموالكم ولكن يسعهم منكم بسط وجوه وحسن خلق\" وقال محمد بن سيرين حسن الخلق عون على الدين. \"فصل في ذم الكبر\" قال علقمة عن ابن مسعود رفعه \"لا يدخل الجنة من كان في قلبه مثقال ذرة من كبر ولا يدخل النار من في قلبه مثقال ذرة من إيمان\" وقال إبراهيم بن أبي عبلة عن أبي سلمة عن عبد الله بن عمرو مرفوعا \"من كان في قلبه مثقال ذرة من كبر أكبه الله على وجهه في النار\" حدثنا إسحاق بن إسماعيل حدثنا أبو معاوية عن عمر بن راشد عن إياس بن سلمة عن أبيه مرفوعا \"لا يزال الرجل يذهب بنفسه حتى يكتب عند الله من الجبارين فيصيبه ما أصابهم من العذاب\" وقال مالك بن دينار ركب سليمان بن داود عليهما السلام \"ذات يوم البساط في مائتي ألف من الإنس ومائتي ألف من الجن فرفع حتى سمع تسبيح الملائكة في السماء ثم خفض حتى مست قدمه ماء البحر فسمعوا صوتا لو كان في قلب صاحبكم مثقال ذرة من كبر لخسف به أبعد مما رفع قال حدثنا أبو خيثمة حدثنا يزيد بن هارون عن حماد بن سلمة عن ثابت عن أنس قال كان أبو بكر يخطبنا فيذكر بدء خلق الإنسان حتى إن أحدنا ليقذر نفسه يقول: خرج من مجرى البول مرتين. وقال الشعبي من قتل اثنين فهو جبار ثم تلا \"أتريد أن تقتلني كما قتلت نفسا بالأمس إن تريد إلا أن تكون جبارا في الأرض\" وقال الحسن عجبا لابن آدم يغسل الخرء بيده في اليوم مرتين ثم يتكبر يعارض جبار السماوات. قال حدثنا خالد بن خداش حدثنا حماد بن زيد عن علي بن الحسن عن الضحاك بن سفيان فذكر حديث ضرب مثل الدنيا بما يخرج من ابن آدم. وقال الحسن عن يحيى عن أبي قال إن مطعم بن آدم ضرب مثلا للدنيا وإن قزحه وملحه. وقال محمد بن الحسين بن علي رضي الله عنه \"ما دخل قلب رجل شيء من الكبر إلا نقص من عقله بقدر ذلك. وقال يونس بن عبيد ليس مع السجود كبر ولا مع التوحيد نفاق ونظر طاوس إلى عمر بن عبد العزيز وهو يختال في مشيته وذلك قبل أن يستخلف فطعن طاوس في جنبه بأصبعه وقال ليس هذا شأن من في بطنه خرء فقال له كالمعتذر إليه: يا عم لقد ضرب كل عضو مني على هذه المشية حتى تعلمتها قال أبو بكر بن أبي الدنيا كان بنو أمية يضربون أولادهم حتى يتعلمون هذه المشية. \"فصل في الاختيال\" عن ابن أبي ليلى عن ابن بريدة عن أبيه مرفوعا \"من جر ثوبه خيلاء لم ينظر الله إليه\" ورواه عن إسحاق بن إسماعيل عن سفيان عن زيد بن أسلم عن ابن عمر مرفوعا مثله وحدثنا محمد بن بكار حدثنا عبد الرحمن بن أبي الزناد عن أبيه عن الأعرج عن أبي هريرة مرفوعا \"لا ينظر الله يوم القيامة إلى من جر إزاره وبينما رجل يتبختر في برديه أعجبته نفسه خسف الله به الأرض فهو يتجلجل فيها إلى يوم القيامة\" وروى الزهري عن سالم عن أبيه بينما رجل إلى آخره."
    },
    {
      "ayah": 2,
      "surah": 31,
      "text": "\"تلك آيات الكتاب الحكيم\" أي هذه آيات القرآن المحكم المبين وقال مجاهد \"الر تلك آيات الكتاب الحكيم\" وقال الحسن التوراة والزبور وقال قتادة \"تلك آيات الكتاب\" قال الكتب التي كانت قبل القرآن. وهذا القول لا أعرف وجهه ولا معناه."
    },
    {
      "ayah": 20,
      "surah": 31,
      "text": "يقول تعالى منبها خلقه على نعمه عليهم في الدنيا والآخرة بأنه سخر لهم ما في السماوات من نجوم يستضيئون بها في ليلهم ونهارهم وما يخلق فيها من سحاب وأمطار وثلج وبرد وجعله إياها لهم سقفا محفوظا وما خلق لهم في الأرض من قرار وأنهار وأشجار وزروع وثمار وأسبغ عليهم نعمه الظاهرة والباطنة من إرسال الرسل وإنزال الكتب وإزاحة الشبه والعلل ثم مع هذا كله ما آمن الناس كلهم بل منهم من يجادل في الله أي في توحيده وإرساله الرسل ومجادلته في ذلك بغير علم ولا مستند من حجة صحيحة ولا كتاب مأثور صحيح ولهذا قال تعالى \"ومن الناس من يجادل في الله بغير علم ولا هدى ولا كتاب منير\" أي مبين مضيء."
    },
    {
      "ayah": 21,
      "surah": 31,
      "text": "\"وإذا قيل لهم\" أي لهؤلاء المجادلين في توحيد الله \"اتبعوا ما أنزل الله\" أي على رسوله من الشرائع المطهرة \"قالوا بل نتبع ما وجدنا عليه آباءنا\" أي لم يكن لهم حجة إلا اتباع الآباء الأقدمين قال الله تعالى \"أو لو كان آباؤهم لا يعقلون شيئا ولا يهتدون\" أي فما ظنكم أيها المحتجون بصنيع آبائهم أنهم كانوا على ضلالة وأنتم خلف لهم فيما كانوا فيه ولهذا قال تعالى \"أو لو كان الشيطان يدعوهم إلى عذاب السعير\"."
    },
    {
      "ayah": 22,
      "surah": 31,
      "text": "يقول تعالى مخبرا عمن أسلم وجهه لله أي أخلص له العمل وانقاد لأمره واتبع شرعه ولهذا قال \"وهو محسن\" أي في عمله: باتباع ما به أمر وترك ما عنه زجر \"فقد استمسك بالعروة الوثقى\" أي فقد أخذ موثقا من الله متينا أنه لا يعذبه \"وإلى الله عاقبة الأمور\"."
    },
    {
      "ayah": 23,
      "surah": 31,
      "text": "\"ومن كفر فلا يحزنك كفره\" أي لا تحزن عليهم يا محمد في كفرهم بالله وبما جئت به فإن قدر الله نافذ فيهم وإلى الله مرجعهم فينبئهم بما عملوا أي فيجزيهم عليه \"إن الله عليم بذات الصدور\" فلا تخفى عليه خافية."
    },
    {
      "ayah": 24,
      "surah": 31,
      "text": "ثم قال تعالى \"نمتعهم قليلا\" أي في الدنيا ثم \"نضطرهم \"أي نلجئهم \"إلى عذاب غليظ\" أي فظيع صعب مشق على النفوس كما قال تعالى \"إن الذين يفترون على الله الكذب لا يفلحون متاع في الدنيا ثم إلينا مرجعهم ثم نذيقهم العذاب الشديد بما كانوا يكفرون\"."
    },
    {
      "ayah": 25,
      "surah": 31,
      "text": "يقول تعالى مخبرا عن هؤلاء المشركين به أنهم يعرفون أن الله خالق السماوات والأرض وحده لا شريك له ومع هذا يعبدون معه شركاء يعترفون أنها خلق له وملك له ولهذا قال تعالى \"ولئن سألتهم من خلق السماوات والأرض ليقولن الله قل الحمد لله\" أي إذا قامت عليكم الحجة باعترافكم \"بل أكثرهم لا يعلمون\"."
    },
    {
      "ayah": 26,
      "surah": 31,
      "text": "ثم قال تعالى \"لله ما في السماوات والأرض\" أي هو خلقه وملكه \"إن الله هو الغني الحميد\" أي الغني عما سواه وكل شيء فقير إليه الحميد في جميع ما خلق له الحمد في السماوات والأرض على ما خلق وشرع وهو المحمود في الأمور كلها."
    },
    {
      "ayah": 27,
      "surah": 31,
      "text": "يقول تعالى مخبرا عن عظمته وكبريائه وجلاله وأسمائه الحسنى وصفاته العلا وكلماته التامة التي لا يحيط بها أحد ولا اطلاع لبشر على كتبها وإحصائها كما قال سيد البشر وخاتم الرسل \"لا أحصي ثناء عليك أنت كما أثنيت على نفسك\" فقال تعالى \"ولو أن ما في الأرض من شجرة أقلام والبحر يمده من بعده سبعة أبحر ما نفدت كلمات الله\" أي ولو أن جميع أشجار الأرض جعلت أقلاما وجعل البحر مدادا وأمده سبعة أبحر معه فكتبت بها كلمات الله الدالة على عظمته وصفاته وجلاله لتكسرت الأقلام ونفد ماء البحر ولو جاء أمثالها مددا وإنما ذكرت السبعة على وجه المبالغة ولم يرد الحصر ولا أن ثمّ سبعة أبحر موجودة محيطة بالعالم كما يقوله من تلقاه من الإسرائيليات التي لا تصدق ولا تكذب بل كما قال تعالى في الآية الأخرى \"قل لو كان البحر مدادا لكلمات ربي لنفد البحر قبل أن تنفد كلمات ربي ولو جئنا بمثله مددا \"فليس المراد بقوله \"بمثله\" آخر فقط بل بمثله ثم بمثله ثم بمثله ثم هلم جرا لأنه لا حصر لآيات الله وكلماته قال الحسن البصري لو جعل شجر الأرض أقلاما وجعل البحر مدادا وقال الله إن من أمري كذا ومن أمري كذا لنفد ماء البحر وتكسرت الأقلام. وقال قتادة قال المشركون إنما هذا كلام يوشك أن ينفذ فقال الله تعالى \"ولو أن ما في الأرض من شجرة أقلام\" أي لو كان شجر الأرض أقلاما ومع البحر سبعة أبحر ما كان لتنفد عجائب ربي وحكمته وخلقه وعلمه. وقال الربيع بن أنس إن مثل علم العباد كلهم في علم الله كقطرة من ماء البحور كلها وقد أنزل الله ذلك \"ولو أن ما في الأرض من شجرة أقلام\" الآية يقول لو كان البحر مدادا لكلمات الله والأشجار كلها أقلاما لانكسرت الأقلام وفني ماء البحر وبقيت كلمات الله قائمة لا يفنيها شيء لأن أحدا لا يستطيع أن يقدر قدره ولا يثني عليه كما ينبغي حتى يكون هو الذي يثني على نفسه إن ربنا كما يقول وفوق ما نقول وقد روي أن هذه الآية نزلت جوابا لليهود قال ابن إسحاق حدثني محمد بن أبي محمد عن سعيد بن جبير أو عكرمة عن ابن عباس أن أحبار يهود قالوا لرسول الله صلى الله عليه وسلم بالمدينة يا محمد أرأيت قولك \"وما أوتيتم من العلم إلا قليلا \"إيانا تريد أم قومك؟ فقال رسول الله صلى الله عليه وسلم \"كلاكما\" قالوا ألست تتلو فيما جاءك أنا قد أوتينا التوراة فيها تبيان لكل شيء؟ فقال رسول الله صلى الله عليه وسلم \"إنها في علم الله قليل وعندكم من ذلك ما يكفيكم\" وأنزل الله فيما سألوه عنه من ذلك \"ولو أن ما في الأرض من شجرة أقلام\" الآية. وهكذا روى عكرمة وعطاء بن يسار وهذا يقتضي أن هذه الآية مدنية لا مكية والمشهور أنها مكية والله أعلم وقوله \"إن الله عزيز حكيم\" أي عزيز قد عز كل شيء وقهره وغلبه فلا مانع لما أراد ولا مخالف ولا معقب لحكمه حكيم في خلقه وأمره وأقواله وأفعاله وشرعه وجميع شؤونه."
    },
    {
      "ayah": 28,
      "surah": 31,
      "text": "وقوله تعالى \"ما خلقكم ولا بعثكم إلا كنفس واحدة\" أى ما خلق جميع الناس وبعثهم يوم المعاد بالنسبة إلى قدرته إلا كنسبة خلق نفس واحدة الجميع هين عليه \"إنما أمره إذا أرأد شيئا أن يقول له كن فيكون\" \"وما أمرنا إلا واحدة كلمح البصر\" أى لا يأمر بالشيء إلا مرة واحدة فيكون ذلك الشيء لا يحتاج إلى تكرره وتوكيده \"فإنما هي زجرة واحدة فإذا هم بالساهرة\" وقوله \"إن الله سميع بصير\" أي كما هو سميع لأقوالهم بصير بأفعالهم كسمعه وبصره بالنسبة إلى نفس واحدة كذلك قدرته عليهم كقدرته على نفس واحدة ولهذا قال تعالى \"ما خلقكم ولا بعثكم إلا كنفس واحدة\" الآية."
    },
    {
      "ayah": 29,
      "surah": 31,
      "text": "يخبر تبارك تعالى أنه \"يولج الليل في النهار\" يعني يأخذ منه في النهار فيطول ذاك ويقصر هذا وهذا يكون زمن الصيف يطول النهار إلى الغاية ثم يشرع في النقص فيطول الليل ويقصر النهار وهذا يكون في زمن الشتاء \"وسخر الشمس والقمر كل يجري إلى أجل مسمى\" قيل إلى غاية محدودة وقيل إلى يوم القيامة وكلا المعنين صحيح ويستشهد للقول الأول بحديث أبي ذر رضي الله تعالى عنه الذي في الصحيحين أن رسول الله صلى الله عليه وسلم قال \"يا أبا ذر أتدري أين تذهب هذه الشمس؟\" قلت الله ورسوله أعلم. قال \"فإنها تذهب فتسجد تحت العرش ثم تستأذن ربها فيوشك أن يقال لها ارجعي من حيث جئت وقال ابن أبي حاتم حدثنا أبي حدثنا أبو صالح حدثنا يحيى بن أيوب عن ابن جريج عن عطاء بن أبي رباح عن ابن عباس أنه قال: الشمس بمنزلة الساقية تجري بالنهار في السماء في فلكها فإذا غربت جرت بالليل في فلكها تحت الأرض حتى تطلع من مشرقها قال وكذلك القمر إسناده صحيح وقوله \"وأن الله بما تعملون خبير\" كقوله \"ألم تعلم أن الله يعلم ما في السماء والأرض\" ومعنى هذا أنه تعالى الخالق العالم بجميع الأشياء كقوله تعالى \"الله الذي خلق سبع سموات ومن الأرض مثلهن\" الآية."
    },
    {
      "ayah": 3,
      "surah": 31,
      "text": "تقدم في أول سورة البقرة عامة الكلام على ما يتعلق بصدر هذه السورة وهو أنه سبحانه وتعالى جعل هذا القرآن هدى وشفاء ورحمة للمحسنين."
    },
    {
      "ayah": 30,
      "surah": 31,
      "text": "وقوله تعالى \"ذلك بأن الله هو الحق وأن ما يدعون من دونه الباطل\" أي إنما يظهر لكم آياته لتستدلوا بها على أنه الحق أي الموجود الحق الإله الحق وأن كل ما سواه باطل فإنه الغني عما سواه وكل شيء فقير إليه لأن كل ما في السماوات والأرض الجميع خلقه وعبيده لا يقدر أحد منهم على تحريك ذرة إلا بإذنه ولو اجتمع كل أهل الأرض على أن يخلقوا ذبابا لعجزوا عن ذلك ولهذا قال تعالى \"ذلك بأن الله هو الحق وأن ما يدعون من دونه الباطل وأن الله هو العلي الكبير\" أي العلي الذي لا أعلى منه الكبير الذي هو أكبر من كل شيء فكل شيء خاضع حقير بالنسبة إليه."
    },
    {
      "ayah": 31,
      "surah": 31,
      "text": "يخبر تعالى أنه هو الذي سخر البحر لتجري فيه الفلك بأمره أي بلطفه وتسخيره فإنه لولا ما جعل في الماء من قوة يحمل بها السفن لما جرت ولهذا قال \"ليريكم من آياته\" أي من قدرته \"إن في ذلك لآيات لكل صبار شكور\" أي صبار في الضراء شكور في الرخاء."
    },
    {
      "ayah": 32,
      "surah": 31,
      "text": "ثم قال تعالى \"وإذا غشيهم موج كالظلل\" أي كالجبال والغمام \"دعوا الله مخلصين له الدين\" كما قال تعالى \"وإذا مسكم الضر في البحر ضل من تدعون إلا إياه\" وقال تعالى \"فإذا ركبوا في الفلك\" الآية قال تعالى \"فلما نجاهم إلى البر فمنم مقتصد\" قال مجاهد أي كافر كأنه فسر المقتصد ههنا بالجاحد كما قال تعالى \"فلما نجاهم إلى البر إذا هم يشركون\" وقال ابن زيد هو المتوسط في العمل وهذا الذي قاله ابن زيد هو المراد فى قوله تعالى \"فمنهم ظالم لنفسه ومنهم مقتصد\" الآية فالمقتصد ههنا هو المتوسط في العمل ويحتمل أن يكون مرادا هنا أيضا ويكون من باب الإنكار على من شاهد تلك الأهوال والأمور العظام والآيات الباهرات في البحر ثم بعد ما أنعم عليه بالخلاص كان ينبغي أن يقابل ذلك بالعمل التام والدءوب في العبادة والمبادرة إلى الخيرات فمن اقتصد بعد ذلك كان مقتصرا والحالة هذه والله أعلم. وقوله تعالى \"وما يجحد بآياتنا إلا كل ختار كفور\" فالختار هو الغدار قاله مجاهد والحسن وقتادة ومالك عن زيد بن أسلم وهو الذي كلما عاهد نقض عهده والختر أتم الغدر وأبلغه. قال عمر بن معد يكرب: وإنك لو رأيت أبا عمير ملأت يديك من غدر وختر وقوله \"كفور\" أي جحود للنعم لا يشكرها بل يتناساها ولا يذكرها."
    },
    {
      "ayah": 33,
      "surah": 31,
      "text": "يقول تعالى منذرا للناس يوم المعاد وآمرا لهم بتقواه والخوف منه والخشية من يوم القيامة حيث \"لا يجزي والد عن ولده\" أي لو أراد أن يفديه بنفسه لما قبل منه وكذلك الولد لو أراد فداء والده بنفسه لم يقبل منه ثم عاد بالموعظة عليهم بقوله \"فلا تغرنكم الحياة الدنيا\" أي لا تهلينكم بالطمأنينة فيها عن الدار الآخرة \"ولا يغرنكم بالله الغرور\" يعني الشيطان. قاله ابن عباس ومجاهد والضحاك وقتادة فإنه يغر ابن آدم ويعده ويمنيه وليس من ذلك شيء بل كان كما قال تعالى \"يعدهم ويمنيهم وما يعدهم الشيطان إلا غرورا\" قال وهب بن منبه قال عزير عليه السلام \"لما رأيت بلاء قومي اشتد حزني وكثر همي وأرق نومي فتضرعت إلى ربي وصليت وصمت فأنا في ذلك التضرع أبكي إذ أتاني الملك فقلت له خبرني هل تشفع أرواح الصديقين للظلمة أو الآباء لأبنائهم؟ قال إن القيامة فيها فصل القضاء وملك ظاهر ليس فيه رخصة لا يتكلم فيه أحد إلا بإذن الرحمن ولا يؤخذ فيه والد عن ولده ولا ولد عن والده ولا أخ عن أخيه ولا عبد عن سيده ولا يهتم أحد به غيره ولا يحزن لحزنه ولا أحد يرحمه كل مشفق على نفسه ولا يؤخذ إنسان عن إنسان كل يهمه همه ويبكي عوله ويحمل وزره ولا يحمل وزره معه غيره. رواه ابن أبي حاتم."
    },
    {
      "ayah": 34,
      "surah": 31,
      "text": "هذه مفاتيح الغيب التي استأثر الله تعالى بعلمها فلا يعلمها أحد إلا بعد إعلامه تعالى بها فعلم وقت الساعة لا يعلمه نبي مرسل ولا ملك مقرب \"لا يجليها لوقتها إلا هو\" وكذلك إنزال الغيث لا يعلمه إلا الله ولكن إذا أمر به علمته الملائكة الموكلون بذلك ومن شاء الله من خلقه وكذلك لا يعلم ما في الأرحام مما يريد أن يخلقه تعالى سواه ولكن إذا أمر بكونه ذكرا أو أنثى أو شقيا أو سعيدا علم الملائكة الموكلون بذلك. ومن شاء الله من خلقه وكذلك لا تدري نفس ماذا تكسب غدا \"في دنياها وأخراها\" \"وما تدري نفس بأي أرض تموت\" في بلدها أو غيره من أي بلاد الله كان لا علم لأحد بذلك وهذه شبيهة بقوله تعالى \"وعنده مفاتح الغيب لا يعلمها إلا هو\" الآية. وقد وردت السنة بتسمية هذه الخمس مفاتيح الغيب. قال الإمام أحمد حدثنا زيد بن الحباب حدثني حسين بن وافد حدثني عبد الله بن بريدة سمعت أبا بريدة يقول: سمعت رسول الله صلى الله عليه وسلم يقول \"خمس لا يعلمهن إلا الله عز وجل\" إن الله عنده علم الساعة وينزل الغيث ويعلم ما في الأرحام وما تدري نفس ماذا تكسب غدا وما تدرى نفس بأي أرض تموت إن الله عليم خبير\" هذا حديث صحيح الإسناد ولم يخرجوه. \"حديث ابن عمر\" قال الإمام أحمد حدثنا وكيع حدثنا سفيان عن عبد الله بن دينار عن ابن عمر قال: قال رسول الله صلى الله عليه وسلم \"مفاتيح الغيب خمس لا يعلمهن إلا الله\" \"إن الله عنده علم الساعة وينزل الغيث ويعلم ما في الأرحام وما تدري نفس ماذا تكسب غدا وما تدرى نفس بأي أرض تموت إن الله عليم خبير\" انفرد بإخراجه البخاري فرواه في كتاب الاستسقاء في صحيحه عن محمد بن يوسف الفريابي عن سفيان بن سعيد الثوري به ورواه في التفسير من وجه آخر فقال حدثنا يحيى بن سليمان حدثنا ابن وهب حدثني عمر بن محمد بن زيد بن عبد الله بن عمر أن أباه حدثه أن عبد الله بن عمر قال: قال النبي صلى الله عليه وسلم \"مفاتيح الغيب خمس\" ثم قرأ \"إن الله عنده علم الساعة وينزل الغيث ويعلم ما في الأرحام\" انفرد به أيضا. ورواه الإمام أحمد عن غندر عن شعبة عن عمر بن محمد أنه سمع أباه يحدث عن ابن عمر عن النبي صلى الله عليه وسلم قال \"أوتيت مفاتيح كل شيء إلا الخمس\" \"إن الله عنده علم الساعة وينزل الغيث ويعلم ما في الأرحام وما تدري نفس ماذا تكسب غدا وما تدري نفس بأي أرض تموت إن الله عليم خبير\" \"حديث ابن مسعود\" رضي الله عنه قال الإمام أحمد حدثنا يحيى عن شعبة ثني عمرو بن مرة عن عبد الله بن سلمة قال: قال عبد الله أوتي نبيكم صلى الله عليه وسلم مفاتيح كل شيء غير خمس \"إن الله عنده علم الساعة وينزل الغيث ويعلم ما في الأرحام وما تدري نفس ماذا تكسب غدا وما تدري نفس بأي أرض تموت إن الله عليم خبير\" وكذا رواه عن محمد بن جعفر عن شعبة عن عمرو بن مرة به وزاد في آخره: قال قلت له أنت سمعته من عبد الله؟ قال نعم أكثر من خمسين مرة ورواه أيضا عن وكيع عن مسعر عن عمرو بن مرة به وهذا إسناد حسن على شرط السنن ولم يخرجوه \"حديث أبي هريرة\" قال البخاري عند تفسير هذه الآية حدثنا إسحاق عن جرير عن أبي حيان عن أبي زرعة عن أبي هريرة رضي الله عنه أن رسول الله صلى الله عليه وسلم كان يوما بارزا للناس إذ أتاه رجل يمشي فقال يا رسول الله: ما الإيمان؟ قال \"الإيمان أن تؤمن بالله وملائكته وكتبه ورسله ولقائه وتؤمن بالبعث الآخر\" قال يا رسول الله ما الإسلام؟ قال \"الإسلام أن تعبد الله ولا تشرك به شيئا وتقيم الصلاة وتؤتي الزكاة المفروضة وتصوم رمضان\" قال يا رسول الله ما الإحسان؟ قال \"الإحسان أن تعبد الله كأنك تراه فإن لم تكن تراه فإنه يراك\" قال يا رسول الله متى الساعة؟ قال \"ما المسؤول عنها بأعلم من السائل ولكن سأحدثك عن أشراطها: إذا ولدت الأمة ربتها فذاك من أشراطها وإذا كان الحفاة العراة رؤوس الناس فذاك من أشراطها في خمس لا يعلمهن إلا الله. \"إن الله عنده علم الساعة وينزل الغيث ويعلم ما في الأرحام\" الآية ثم انصرف الرجل فقال \"ردوه علي فأخذوا ليردوه فلم يروا شيئا فقال \"هذا جبريل جاء ليعلم الناس دينهم\" ورواه البخاري أيضا في كتاب الإيمان ومسلم من طرق عن أبي حيان به وقد تكلمنا عليه في أول شرح البخاري وذكرنا ثم حديث أمير المؤمنين عمر بن الخطاب في ذلك بطوله وهو من إفراد مسلم \"حديث ابن عباس\" قال الإمام أحمد حدثنا أبو النضر حدثنا عبد الحميد حدثنا بهز حدثنا عبد الله بن عباس رضي الله عنهما قال: جلس رسول الله صلى الله عليه وسلم مجلسا فأتاه جبريل فجلس بين يدي رسول الله صلى الله عليه وسلم واضعا كفيه على ركبتي النبي صلى الله عليه وسلم فقال يا رسول الله ما الإسلام؟ قال رسول الله صلى الله عليه وسلم \"الإسلام أن تسلم وجهك لله عز وجل وتشهد أن لا إله إلا الله وحده لا شريك له وأن محمدا عبده ورسوله\" قال فإذا فعلت ذلك فقد أسلمت؟ قال \"إذا فعلت ذلك فقد أسلمت\" قال يا رسول الله فحدثني ما الإيمان؟ قال \"الإيمان أن تؤمن بالله واليوم الآخر والملائكة والكتاب والنبيين وتؤمن بالموت وبالحياة بعد الموت وتؤمن بالجنة والنار والحساب والميزان وتؤمن بالقدر كله خيره وشره\" قال فإذا فعلت ذلك فقد آمنت؟ قال \"إذا فعلت ذلك فقد آمنت\" قال يا رسول الله حدثني ما الإحسان؟ قال رسول الله صلى الله عليه وسلم \"الإحسان أن تعمل لله كأنك تراه فإن كنت لا تراه فإنه يراك\" قال يا رسول الله فحدثني متى الساعة؟ قال رسول الله صلى الله عليه وسلم \"هي - سبحان الله - في خمس لا يعلمهن إلا الله \"إن الله عنده علم الساعة وينزل الغيث ويعلم ما في الأرحام وما تدري نفس ماذا تكسب غدا وما تدري نفس بأي أرض تموت إن الله عليم خبير\" ولكن إن شئت حدثتك بمعالم لها دون ذلك - قال أجل يا رسول الله فحدثني. قال رسول الله صلى الله عليه وسلم - إذا رأيت الأمة ولدت ربتها - أو ربها - ورأيت أصحاب البنيان يتطاولون في البنيان ورأيت الحفاة الجياع العالة رؤوس الناس فذلك من معالم الساعة وأشراطها\" قال يا رسول الله صلى الله عليه وسلم ومن أصحاب البنيان الحفاة الجياع العالة؟ قال \"العرب\" حديث غريب ولم يخرجوه \"حديث رجل من عامر\" روى الإمام أحمد حدثنا محمد بن جعفر حدثنا شعبة عن منصور عن ربعي بن حراش عن رجل من بني عامر أنه استأذن على النبي صلى الله عليه وسلم فقال أألج؟ فقال النبي صلى الله عليه وسلم لخادمه \"اخرجي إليه فإنه لا يحسن الاستئذان فقولي له فليقل السلام عليكم أأدخل\" قال فسمعته يقول ذلك فقلت السلام عليكم أأدخل؟ فأذن لي فدخلت فقلت بم أتيتنا؟ قال \"لم آتكم إلا بخير أتيتكم بأن تعبدوا الله وحده لا شريك له وأن تدعوا اللات والعزى وأن تصلوا بالليل والنهار خمس صلوات وأن تصوموا من السنة شهرا وأن تحجوا البيت وأن تأخذوا الزكاة من أغنيائكم فتردوها على فقرائكم\" قال فقال فهل بقي من العلم شيء لا تعلمه؟ قال \"قد علمني الله عز وجل خيرا وإن من العلم ما لا يعلمه إلا الله عز وجل: الخمس \"إن الله عنده علم الساعة وينزل الغيث ويعلم ما في الأرحام\" الآية وهذا إسناد صحيح وقال ابن أبي نجيح عن مجاهد جاء رجل من أهل البادية فقال إن امرأتي حبلى فأخبرني ما تلد وبلادنا مجدبة فأخبرني متى ينزل الغيث وقد علمت متى ولدت فأخبرني متى أموت فأنزل الله عز وجل \"إن الله عنده علم الساعة - إلى قوله - عليم خبير\" قال مجاهد وهي مفاتيح الغيب التي قال الله تعالى \"وعنده مفاتيح الغيب لا يعلمها إلا هو\" رواه ابن أبي حاتم وابن جرير. وقال الشعبي عن مسروق عن عائشة رضي الله عنها أنها قالت: من حدثك أنه يعلم ما في غد فقد كذب ثم قرأت \"وما تدري نفس ماذا تكسب غدا\" وقوله تعالى \"وما تدري نفس بأي أرض تموت\" قال قتادة أشياء استأثر الله بهن فلم يطلع عليهن ملكا مقربا ولا نبيا مرسلا \"إن الله عنده علم الساعة\" فلا يدري أحد من الناس متى تقوم الساعة في أي سنة أو في أي شهر أو ليل أو نهار \"وينزل الغيث\" فلا يعلم أحد متى ينزل الغيث ليلا أو نهارا \"ويعلم ما في الأرحام\" فلا يعلم أحد ما في الأرحام أذكر أم أنثى أحمر أو أسود وما هو \"وما تدرى نفس ماذا تكسب غدا\" أخير أم شر ولا تدري يا ابن آدم متى تموت لعلك الميت غدا لعلك المصاب غدا \"وما تدري نفس بأي أرض تموت\" أي ليس أحد من الناس يدري أين مضجعه من الأرض أفي بحر أم بر أو سهل أو جبل. وقد جاء في الحديث \"إذا أراد الله قبض عبد بأرض جعل له إليها حاجة\" فقال الحافظ أبو القاسم الطبراني في معجمه الكبير في مسند أسامة بن زيد حدثنا إسحاق بن إبراهيم أخبرنا عبد الرزاق أخبرنا معمر عن أيوب عن أبي المليح عن أسامة بن زيد قال: قال رسول الله صلى الله عليه وسلم \"ما جعل الله ميتة عبد بأرض إلا جعل له فيها حاجة\" وقال عبد الله ابن الإمام أحمد حدثنا أبو بكر بن أبي شيبة حدثنا أبو داود الحفري عن سفيان عن أبي إسحاق عن مطر بن عكامس قال: قال رسول الله صلى الله عليه وسلم \"إذا قضى الله ميتة عبد بأرض جعل له إليها حاجة\" وهكذا رواه الترمذي في القدر من حديث سفيان الثوري به ثم قال حسن غريب ولا يعرف لمطر عن النبي صلى الله عليه وسلم غير هذا الحديث وقد رواه أبو داود في المراسيل فالله أعلم. وقال الإمام أحمد حدثنا إسماعيل حدثنا أيوب عن أبي المليح بن أسامة عن أبي عزة قال: قال رسول الله صلى الله عليه وسلم \"إذا أراد الله قبض روح عبد بأرض جعل له فيها - أو قال بها - حاجة \"وأبو عزة هذا هو بشار بن عبيد الله ويقال ابن عبد الهذلي وأخرجه الترمذي من حديث إسماعيل بن إبراهيم وهو ابن علية وقال صحيح. وقال ابن أبي حاتم حدثنا أحمد بن عصام الأصفهاني حدثنا المؤمل بن إسماعيل حدثنا عبيد الله بن أبي حميد عن أبي المليح عن أبي عزة الهذلي قال: قال رسول الله صلى الله عليه وسلم \"إذا أراد الله قبض عبد بأرض جعل له إليها حاجة فلم ينته حتى يقدمها\" ثم قرأ رسول الله صلى الله عليه وسلم \"إن الله عنده علم الساعة - إلى - عليم خبير\" \"حديث آخر\" قال الحافظ أبو بكر البزار حدثنا أحمد بن ثابت الجحدري ومحمد بن يحيى القطعي قالا حدثنا عمر بن علي حدثنا إسماعيل عن قيس عن عبد الله قال: قال رسول الله صلى الله عليه وسلم \"إذا أراد الله قبض عبد بأرض جعل له إليها حاجة\" ثم قال البزار وهذا الحديث لا نعلم أحدا يرفعه إلا عمر بن علي المقدمي. وقال ابن أبي الدنيا حدثني سليمان بن أبي مسيح قال أنشدني محمد بن الحكم لأعشى همدان: فما تزود مما كان يجمعه سوى حنوط غداة البين مع خرق وغير نفحة أعواد تشب له وقل ذلك من زاد لمنطلق لا تأسين على شيء فكل فتى إلى منيته سيار في عنق وكل من ظن أن الموت يخطئه معلل بأعاليل من الحمق بأيما بلدة تقـدر منيته إن لا يسير إليها طائعا يبق أورده الحافظ ابن عساكر رحمه الله في ترجمة عبد الرحمن بن عبد الله بن الحارث وهو أعشى همدان وكان الشعبي زوج أخته وهو مزوج بأخت الشعبي أيضا وقد كان ممن طلب العلم والتفقه ثم عدل إلى صناعة الشعر فعرف به وقد روى ابن ماجه عن أحمد بن ثابت وعمر بن شبة كلاهما عن عمر بن عكرمة مرفوعا \"إذا كان أجل أحدكم بأرض أتت له إليها حاجة فإذا بلغ أقصى أثره قبضه الله عز وجل فتقول الأرض يوم القيامة: يا رب هذا ما أودعتني\" قال الطبراني حدثنا إسحاق بن إبراهيم حدثنا عبد الرزاق حدثنا معمر عن أيوب عن أبي المليح عن أسامة أن رسول الله صلى الله عليه وسلم قال \"ما جعل الله منية عبد بأرض إلا جعل له إليها حاجة\" آخر تفسير سورة لقمان والحمد الله رب العالمين وحسبنا الله ونعم الوكيل."
    },
    {
      "ayah": 4,
      "surah": 31,
      "text": "وهم الذين أحسنوا العمل في اتباع الشريعة فأقاموا الصلاة المفروضة بحدودها وأوقاتها وما يتبعها من نوافل راتبة وغير راتبة وآتوا الزكاة المفروضة عليهم إلى مستحقيها ووصلوا أرحامهم وقراباتهم وأيقنوا بالجزاء في الدار الآخرة فرغبوا إلى الله في ثواب ذلك لم يراءوا به ولا أرادوا جزاء من الناس ولا شكورا فمن فعل ذلك كذلك فهو من الذين ذكرهم في الآية التالية."
    },
    {
      "ayah": 5,
      "surah": 31,
      "text": "قال الله تعالى \"أولئك على هدى من ربهم\" أي على بصيرة وبينة ومنهج واضح جلي \"وأولئك هم المفلحون\" أي في الدنيا والآخرة."
    },
    {
      "ayah": 6,
      "surah": 31,
      "text": "لما ذكر تعالى حال السعداء وهم الذين يهتدون بكتاب الله وينتفعون بسماعه كما قال تعالى \"الله نزل أحسن الحديث كتابا متشابها مثاني تقشعر منه جلود الذين يخشون ربهم ثم تلين جلودهم وقلوبهم إلى ذكر الله\" الآية عطف بذكر حال الأشقياء الذين أعرضوا عن الانتفاع بسماع كلام الله وأقبلوا على استماع المزامير والغناء بالألحان وآلات الطرب كما قال ابن مسعود في قوله تعالى \"ومن الناس من يشتري لهو الحديث ليضل عن سبيل الله\" قال هو والله الغناء. روى ابن جرير حدثني يونس بن عبد الأعلى قال أخبرنا ابن وهب أخبرني يزيد بن يونس عن أبي صخر عن ابن معاوية البجلي عن سعيد بن جبير عن أبي الصهباء البكري أنه سمع عبد الله بن مسعود وهو يسأل عن هذه الآية \"ومن الناس من يشتري لهو الحديث ليضل عن سبيل الله\" فقال عبد الله بن مسعود الغناء والله الذي لا إله إلا هو يرددها ثلاث مرات: حدثنا عمرو بن علي حدثنا صفوان بن عيسى أخبرنا حميد الخراط عن عمار عن سعيد بن جبير عن أبي الصهباء أنه سأل ابن مسعود عن قول الله \"ومن الناس من يشتري لهو الحديث\" قال الغناء وكذا قال ابن عباس وجابر وعكرمة وسعيد بن جبير ومجاهد ومكحول وعمرو بن شعيب وعلي بن نديمة. وقال الحسن البصري نزلت هذه الآية \"ومن الناس من يشتري لهو الحديث ليضل عن سبيل الله بغير علم\" في الغناء والمزامير: وقال قتادة قوله \"ومن الناس من يشتري لهو الحديث ليضل عن سبيل الله علم\" والله لعله لا ينفق فيه مالا ولكن شراؤه استجابة بحسب المرء من الضلالة أن يختار حديث الباطل على حديث الحق وما يضر على ما ينفع وقيل أراد بقوله \"يشتري لهو الحديث\" اشتراء المغنيات من الجواري قال ابن أبي حاتم حدثنا محمد بن إسماعيل الأحمسي حدثنا وكيع عن خلاد الصفار عن عبيد الله بن زحر عن علي بن يزيد عن القاسم بن عبد الرحمن عن أبي أمامة عن النبي صلى الله عليه وسلم قال \"لا يحل بيع المغنيات ولا شراؤهن وأكل أثمانهن حرام وفيهم أنزل الله عز وجل علي\" ومن الناس من يشتري لهو الحديث ليضل عن سبيل الله\" وهكذا رواه الترمذي وابن جرير من حديث عبيد الله بن زحر بنحوه ثم قال الترمذي هذا حديث غريب وضعف علي بن يزيد المذكور \"قلت\" علي وشيخه والراوي عنه كلهم ضعفاء والله أعلم وقال الضحاك في قوله تعالى \"ومن الناس من يشتري لهو الحديث\" قال يعني الشرك وبه قال عبد الرحمن بن زيد بن أسلم واختار ابن جرير أنه كل كلام يصد عن آيات الله واتباع سبيله وقوله \"ليضل عن سبيل الله\" أي إنما يصنع هذا للتخالف للإسلام وأهله. وعلى قراءة فتح الياء تكون اللام لام العاقبة أو تعليلا للأمر القدري أي قيضوا لذلك ليكونوا كذلك وقوله تعالى \"ويتخذها هزوا\" قال مجاهد يتخذ سبيل الله هزوا يستهزئ بها وقال قتادة يعني يتخذ آيات الله هزوا وقول مجاهد أولى وقوله \"أولئك لهم عذاب مهين\" أي استهانوا بآيات الله وسبيله أهينوا يوم القيامة في العذاب الدائم المستمر."
    },
    {
      "ayah": 7,
      "surah": 31,
      "text": "ثم قال تعالى \"وإذا تتلى عليه آياتنا ولى مستكبرا كأن لم يسمعها كأن في أذنيه وقرا\" أي هذا المقبل على اللهو واللعب والطرب إذا تليت عليه الآيات القرآنية ولى عنها وأعرض وأدبر وتصامم وما به من صمم كأنه ما سمعها لأنه يتأذى بسماعها إذ لا انتفاع له بها ولا أرب له فيها \"فبشره بعذاب أليم\" أي يوم القيامة يؤلمه كما تألم بسماع كتاب الله وآياته."
    },
    {
      "ayah": 8,
      "surah": 31,
      "text": "هذا ذكر مآل الأبرار من السعداء في الدار الآخرة الذين آمنوا بالله وصدقوا المرسلين وعملوا الأعمال الصالحة التابعة لشريعة الله \"لهم جنات النعيم\" أي يتنعمون فيها بأنواع الملاذ والمسار من المآكل والمشارب والملابس والمساكن والمراكب والنساء والنضرة والسماع الذي لم يخطر ببال أحد."
    },
    {
      "ayah": 9,
      "surah": 31,
      "text": "وهم في ذلك مقيمون دائما فيها لا يظعنون ولا يبغون عنها حولا وقوله تعالى \"وعد الله حقا\" أي هذا كائن لا محالة لأنه من وعد الله والله لا يخلف الميعاد لأنه الكريم المنان الفعال لما يشاء القادر على كل شيء \"وهو العزيز\" الذي قهر كل شيء ودان له كل شيء \"الحكيم\" في أقواله وأفعاله الذي جعل القرآن هدى للمؤمنين \"قل هو للذين آمنوا هدى وشفاء والذين لا يؤمنون في آذانهم وقر وهو عليهم عمى\" الآية. وقوله \"وننزل من القرآن ما هو شفاء ورحمة للمؤمنين ولا يزيد الظالمين إلا خسارا\"."
    }
  ]
}
