{
  "ayahs": [
    {
      "ayah": 1,
      "surah": 32,
      "text": "سورة السجدة: روى البخاري في كتاب الجمعة حدثنا أبو نعيم حدثنا سفيان عن سعد بن إبراهيم عن عبد الرحمن بن هرمز الأعرج عن أبي هريرة قال: كان النبي صلى الله عليه وسلم يقرأ في الفجر يوم الجمعة الم تنزيل السجدة و \" هل أتى على الإنسان \" ورواه مسلم أيضا من حديث سفيان الثوري به وقال الإمام أحمد حدثنا أسود بن عامر أخبرنا الحسن بن صالح عن ليث عن أبي الزبير عن جابر قال كان النبي صلى الله عليه وسلم لا ينام حتى يقرأ الم تنزيل السجدة و \" تبارك الذي بيده الملك \" تفرد به أحمد. قد اختلف المفسرون في الحروف المقطعة التي في أوائل السور فمنهم من قال هي مما استأثر الله بعلمه فردوا علمها إلى الله ولم يفسرها حكاه القرطبي في تفسـره عن أبي بكر وعمر وعثمان وعلي وابن مسعود رضي الله عنهم أجمعين وقاله عامر الشعبي وسفيان الثوري والربيع بن خيثم واختاره أبو حاتم بن حبان. ومنهم من فسرها واختلف هؤلاء في معناها فقال عبدالرحمن بن زيد بن أسلم إنما هي أسماء السور. قال العلامة أبو القاسم محمود بن عمر الزمخشري في تفسيره وعليه إطباق الأكثر ونقل عن سيبويه أنه نص عليه ويعتضد لهذا بما ورد في الصحيحين عن أبي هريرة أن رسول الله صلى الله عليه وسلم كان يقرأ في صلاة الصبح يوم الجمعة \"الم\" السجدة و \"هل أتى على الإنسان\" وقال سفيان الثوري عن ابن أبي نجيح عن مجاهد أنه قال: الم وحم والمص وص. فواتح افتتح الله بها القرآن وكذا قال غيره عن مجاهد وقال مجاهد في رواية أبي حذيفة موسى بن مسعود عن شبل عن ابن أبي نجيح عنه أنه قال الم اسم من أسماء القرآن وهكذا وقال قتادة وزيد بن أسلم ولعل هذا يرجع إلى معنى قول عبدالرحمن بن زيد بن أسلم أنه اسم من أسماء السور فإن كل سورة يطلق عليها اسم القرآن فإنه يبعد أن يكون المص اسما للقرآن كله لأن المتبادر إلى فهم سامع من يقول قرأت المص إنما ذلك عبارة عن سورة الأعراف لا لمجموع القرآن والله أعلم. وقيل هي اسم من أسماء الله تعالى فقال عنها في فواتح السور من أسماء الله تعالى وكذلك قال سالم بن عبدالله وإسماعيل بن عبدالرحمن السدي الكبير وقال شعبة عن السدي بلغني أن ابن عباس قال الم اسم من أسماء الله الأعظم. هكذا رواه ابن أبي حاتم من حديث شعبة ورواه ابن جرير عن بندار عن ابن مهدي عن شعبة قال سألت السدي عن حم وطس والم فقال قال ابن عباس هي اسم الله الأعظم وقال ابن جرير وحدثنا محمد بن المثنى حدثنا أبو النعمان حدثنا شعبة عن إسماعيل السدي عن مرة الهمذانى قال: قال عبدالله فذكر نحوه. وحُكي مثله عن علي وابن عباس وقال علي بن أبي طلحة عن ابن عباس هو قسم أقسم الله به وهو من أسماء الله تعالى وروى ابن أبي حاتم وابن جرير من حديث ابن علية عن خالد الحذاء عن عكرمة أنه قال الم قسم. وروينا أيضا من حديث شريك بن عبدالله بن عطاء بن السائب عن أبى الضحى عن ابن عباس: الم قال أنا الله أعلم وكذا قال سعيد بن جبير وقال السدي عن أبي مالك وعن أبي صالح عن ابن عباس وعن مرة الهمذاني عن ابن مسعود وعن ناس من أصحاب النبي صلى الله عليه وسلم الم قال أما الم فهي حروف استفتحت من حروف هجاء أسماء الله تعالى. قال وأبو جعفر الرازي عن الربيع بن أنس عن أبي العالية في قوله تعالى الم قال هذه الأحرف الثلاثة من التسعة والعشرين حرفا دارت فيها الألسن كلها ليس منها حرف إلا وهو مفتاح اسم من أسمائه وليس منها حرف إلا وهو من آلائه وبلألائه ليس منها حرف إلا وهو في مدة أقوام وآجالهم. قال عيسى ابن مريم عليه السلام وعجب: فقال أعجب أنهم يظنون بأسمائه ويعيشون في رزقه فكيف يكفرون به فالألف مفتاح الله واللام مفتاح اسمه لطيف والميم مفتاح اسمه مجيد فالألف آلاء الله واللام لطف الله والميم مجد الله والألف سنة واللام ثلاثون سنة والميم أربعون سنة. هذا لفظ ابن أبي حاتم ونحوه رواه ابن جرير ثم شرع يوجه كل واحد من هذه الأقوال ويوفق بينها وأنه لا منافاة بين كل واحد منها وبين الآخر وأن الجمع ممكن فهي أسماء للسور ومن أسماء الله تعالى يفتتح بها السور فكل حرف منها دل على اسم من أسمائه وصفة من صفاته كما افتتح سورا كثيرة بتحميده وتسبيحه وتعظيمه قال ولا مانع من دلالة الحرف منها على اسم من أسماء الله وعلى صفة من صفاته وعلى مدة وغير ذلك كما ذكره الربيع بن أنس عن أبي العالية لأن الكلمة الواحدة تطلق على معاني كثيرة كلفظة الأمة فإنها تطلق ويراد به الدين كقوله تعالى \"إنا وجدنا آباءنا على أمة\" وتطلق ويراد بها الرجل المطيع لله كقوله تعالى \"إن إبراهيم كان أمة قانتا لله حنيفا ولم يك من المشركين\" وتطلق ويراد بها الجماعة كقوله تعالى \"وجد عليه أمة من الناس يسقون\" وقوله تعالى \"ولقد بعثنا في كل أمة رسولا\" وتطلق ويراد بها الحين من الدهر كقوله تعالى \"وقال الذي نجا منهما وادكر بعد أمة\" أي بعد حين على أصح القولين قال فكذلك هذا. هذا حاصل كلامه موجها ولكن هذا ليس كما ذكره أبو العالية فإن أبا العالية زعم أن الحرف دل على هذا وعلى هذا وعلى هذا معا ولفظة الأمة وما أشبهها من الألفاظ المشتركة في الاصطلاح إنما دل في القرآن في كل موطن على معنى واحد دل عليه سياق الكلام فأما حمله على مجموع محامله إذا أمكن فمسألة مختلف فيها بين علماء الأصول ليس هذا موضع البحث فيها والله أعلم. ثم إن لفظة الأمة تدل على كل من معانيها في سياق الكلام بدلالة الوضع فأما دلالة الحرف الواحد على اسم يمكن أن يدل على اسم آخر من غير أن يكون أحدهما أولى من الآخر في التقدير أو الإضمار بوضع ولا بغيره فهذا مما لا يفهم إلا بتوقيف والمسألة مختلف فيها وليس فيها إجماع حتى يحكم به وما أنشدوه من الشواهد على صحة إطلاق الحرف الواحد على بقية الكلمة فإن في السياق ما يدل على ما حذف بخلاف هذا كما قال الشاعر: قلنا قفي لنا فقالت قاف لا تحسبي أنا نسينا الإيجاف تعني وقفت. وقال الآخر: ما للظليم عال كيف لا يـ ينقد عنه جلده إذا يـ فقال ابن جرير كأنه أراد أن يقول إذا يفعل كذا وكذا فاكتفى بالياء من يفعل وقال الآخر: بالخير خيرات وان شرا فا ولا أريد الشر إلا أن تـ يقول وإن شرا فشرا ولا أريد الشر إلا أن تشاء فاكتفى بالفاء والتاء من الكلمتين عن بقيتهما ولكن هذا ظاهر من سياق الكلام والله أعلم. قال القرطبي وفي الحديث \"من أعان على قتل مسلم بشطر كلمة\" الحديث قال سفيان هو أن يقول في اقتل\"ا قـ\" وقال خصيف عن مجاهد أنه قال فواتح السور كلها\"ق وص وحم وطسم والر\" وغير ذلك هجاء موضوع وقال بعض أهل العربية هي حروف من حروف المعجم استغنى بذكر ما ذكر منها في أوائل السور عن ذكر بواقيها التي هي تتمة الثمانية والعشرين حرفا كما يقول القائل ابني يكتب في - ا ب ت ث - أي في حروف المعجم الثمانية والعشرين فيستغني بذكر بعضها عن مجموعها حكاه ابن جرير. قلت مجموع الحروف المذكورة في أوائل السور بحذف المكرر منها أربعة عشر حرفا وهي - ال م ص ر ك ه ي ع ط س ح ق ن- يجمعها قولك: نص حكيم قاطع له سر. وهي نصف الحروف عددا والمذكور منها أشرف من المتروك وبيان ذلك من صناعة التصريف. قال الزمخشري وهذه الحروف الأربعة عشر مشتملة على أصناف أجناس الحروف يعني من المهموسة والمجهورة ومن الرخوة والشديدة ومن المطبقة والمفتوحة ومن المستعلية والمنخفضة ومن حروف القلقلة. وقد سردها مفصلة ثم قال: فسبحان الذي دقت في كل شىء حكمته. وهذه الأجناس المعدودة مكثورة بالمذكورة منها وقد علمت أن معظم الشيء وجله ينزل منزلة كله وههنا ههنا لخص بعضهم في هذا المقام كلاما فقال: لا شك أن هذه الحروف لم ينزلها سبحانه وتعالى عبثا ولا سدى ومن قال من الجهلة إن في القرآن ما هو تعبد لا معنى له بالكلمة فقد أخطأ خطأ كبيرا فتعين أن لها معنى في نفس الأمر فإن صح لنا فيها عن المعصوم شيء قلنا به وإلا وقفنا حيث وقفنا وقلنا \"آمنا به كل من عند ربنا\" ولم يجمع العلماء فيها على شيء معين وإنما اختلفوا فمن ظهر له بعض الأقوال بدليل فعليه اتباعه وإلا فالوقف حتى يتبين هذا المقام. المقام الآخر في الحكمة التي اقتضت إيراد هذه الحروف في أوائل السور ما هي مع قطع النظر عن معانيها في أنفسها فقال بعضهم إنما ذكرت ليعرف بها أوائل السور حكاه ابن جرير وهذا ضعيف لأن الفصل حاصل بدونها فيما لم تذكر فيه وفيما ذكرت فيه البسملة تلاوة وكتابة وقال آخرون بل ابتدىء بها لتفتح لاستماعها أسماع المشركين إذ تواصوا بالإعراض عن القرآن حتى إذا استمعوا له تلا عليهم المؤلف منه حكاه ابن جرير أيضا وهو ضعيف أيضا لأنه لو كان كذلك لكان ذلك في جميع السور لا يكون في بعضها بل غالبها ليس كذلك ولو كـان كذلك أيضا لانبغى الابتداء بها في أوائل الكلام معهم سواء كان افتتاح سورة أو غير ذلك ثم إن هذه السورة والتي تليها أعني البقرة وآل عمران مدنيتان ليستا خطابا للمشركين فانتقض ما ذكروه بهذه الوجوه. وقال آخرون بل إنما ذكرت هذه الحروف في أوائل السور التي ذكرت فيها بيانا لإعجاز القرآن وأن الخلق عاجزون عن معارضته بمثله هذا مع أنه مركب من هذه الحروف المقطعة التي يتخاطبون بها وقد حكى هذا المذهب الرازي في تفسيره عن المبرد وجمع من المحققين وحكى القرطبي عن الفراء وقطرب نحو هذا وقرره الزمخشري فى كشافه ونصره أتم نصر وإليه ذهب الشيخ الإمام العلامة أبو العباس ابن تيمية وشيخنا الحافظ المجتهد أبو الحجاج المزي وحكاه لي عن ابن تيمية. قال الزمخشري ولم ترد كلها مجموعة في أول القرآن وإنما كررت ليكون أبلغ في التحدي والتبكيت كما كررت قصص كثيرة وكرر التحدي بالصريح في أماكن قال وجاء منها على حرف واحد كقوله - ص ن ق- وحرفين مثل \"حم\" وثلاثة مثل \"الم\" وأربعة مثل \"المر\" و \"المص\" وخمسة مثل \"كهيعص- و- حمعسق\" لأن أساليب كلامهم على هذا من الكلمات ما هو على حرف وعلى حرفين وعلى ثلاثة وعلى أربعة وعلى خمسة لا أكثر من ذلك \"قلت\" ولهذا كل سورة افتتحت بالحروف فلا بد أن يذكر فيها الانتصار للقرآن وبيان إعجازه وعظمته وهذا معلوم بالاستقراء وهو الواقع في تسع وعشرين سورة ولهذا يقول تعالى \"الم ذلك الكتاب لا ريب فيه\" \"الم الله لا إله إلا هو الحي القيوم نزل عليك الكتاب بالحق مصدقا لما بين يديه\" \"المص كتاب أنزل إليك فلا يكن في صدرك حرج منه\" \"الر كتاب أنزلناه إليك لتخرج الناس من الظلمات إلى النور بإذن ربهم\" \"الم تنزيل الكتاب لا ريب فيه من رب العالمين\" \"حم تنزيل من الرحمن الرحيم\" \"حم عسق كذلك يوحي إليك وإلى الذين من قبلك الله العزيز الحكيم\" وغير ذلك من الآيات الدالة على صحة ما ذهب إليه هؤلاء لمن أمعن النظر والله أعلم. وأما من زعم أنها دالة على معرفة المدد وأنه يستخرج من ذلك أوقات الحوادث والفتن والملاحم فقد ادعى ما ليس له وطار في غير مطاره وقد ورد في ذلك حديث ضعيف وهو مع ذلك أدل على بطلان هذا المسلك من التمسك به على صحته وهو ما رواه محمد بن إسحق بن يسار صاحب المغازي حدثني الكلبي عن أبي صالح عن ابن عباس عن جابر بن عبدالله بن رباب قال مر أبو ياسر بن أخطب في رجال من يهود برسول الله صلى الله عليه وسلم وهو يتلو فاتحة سورة البقرة \"الم ذلك الكتاب لا ريب فيه\" فأتى أخاه بن أخطب في رجال من اليهود فقال تعلمون والله لقد سمعت محمدا يتلو فيما أنزل الله تعالى عليه \"الم ذلك الكتاب لا ريب فيه\" فقال أنت سمعته قال نعم قال فمشى حي بن أخطب في أولئك النفر من اليهود إلى رسول الله صلى الله عليه وسلم فقالوا يا محمد ألم يذكر أنك تتلوا فيما أنزل الله عليك \"الم ذلك الكتاب\"؟ فقال رسول الله صلى الله عليه وسلم \"بلى\" فقالوا جاءك بهذا جبريل من عند الله؟ فقال \"نعم\" قالوا لقد بعث الله قبلك أنبياء ما نعلمه بين لنبي منهم ما مدة ملكه وما أجل أمته غيرك. فقام حي بن أخطب وأقبل على من كان معه فقال لهم الألف واحدة واللام ثلاثون والميم أربعون فهذه إحدى وسبعون سنة أفتدخلون في دين نبي إنما مدة ملكه وأجل أمته إحدى وسبعون سنة؟ ثم أقبل على رسول الله صلى الله عليه وسلم فقال يا محمد هل مع هذا غيره فقال \"نعم\" قال ما ذاك؟ قال \"المص\" قال هذا أثقل وأطول الألف واحد واللام ثلاثون والميم أربعون والصاد تسعون فهذه إحدى وثلاثون ومائة سنة. هل مع هذا يا محمد غيره؟ قال \"نعم\" قال ما ذاك؟ قال \"الر\" قال هذا أثقل وأطول الألف واحدة واللام ثلاثون والراء مائتان فهذه إحدى وثلاثون ومائتا سنة. فهل مع هذا يا محمد غيره؟ قال \"نعم\" قال ماذا قال \"المر\" قال هذه أثقل وأطول الألف واحدة واللام ثلاثون والميم أربعون والراء مائتان فهذه إحدى وسبعون ومائتان ثم قال: لقد لبس علينا أمرك يا محمد حتى ما ندري أقليلا أعطيت أم كثيرا. ثم قال قوموا عنه ثم قال أبو ياسر لأخيه حي بن أخطب ولمن معه من الأحبار ما يدريكم لعله قد جمع هذا لمحمد كله إحدى وسبعون وإحدى وثلاثون ومائة وإحدى وثلاثون ومائتان وإحدى وسبعون ومائتان فذلك سبعمائة وأربع سنين؟ فقالوا لقد تشابه علينا أمره فيزعمون أن هؤلاء الآيات نزلت فيهم \"هو الذي أنزل عليك الكتاب منه آيات محكمات هن أم الكتاب وأخر متشابهات\" فهذا الحديث مداره على محمد بن السائب الكلبي وهو ممن لا يحتج بما انفرد به ثم كان مقتضى هذا المسلك إن كان صحيحا أن يحسب ما لكل حرف من الحروف الأربعة عشر التي ذكرناها وذلك يبلغ منه جملة كثيرة وإن حسبت مع التكرر فأطم وأعظم والله أعلم."
    },
    {
      "ayah": 10,
      "surah": 32,
      "text": "يقول تعالى مخبرا عن المشركين في استبعادهم المعاد حيث قالوا \"أئذا ضللنا في الأرض\" أي تمزقت أجسامنا وتفرقت في أجزاء الأرض وذهبت \"أئنا لفي خلق جديد\" أي أئنا لنعود بعد تلك الحال؟ يستبعدون ذلك وهذا إنما هو بعيد بالنسبة إلى قدرهم العاجزة لا بالنسبة إلى قدرة الذي بدأهم وخلقهم من العدم الذي إنما أمره إذا أراد شيئا أن يقول له كن فيكون ولهذا قال تعالى \"بل هم بلقاء ربهم كافرون\"."
    },
    {
      "ayah": 11,
      "surah": 32,
      "text": "ثم قال تعالى \"قل يتوفاكم ملك الموت الذي وكل بكم\" الظاهر من هذه الآية أن ملك الموت شخص معين من الملائكة كما هو المتبادر من حديث البراء المتقدم ذكره في سورة إبراهيم وقد سمي في بعض الآثار بعزارئيل وهو المشهور قاله قتادة وغير واحد وله أعوان وهكذا ورد في الحديث أن أعوانه ينتزعون الأرواح من سائر الجسد حتى إذا بلغت الحلقوم تنازلها ملك الموت قال مجاهد حويت له الأرض فجعلت مثل الطست تناول منها متى يشاء. ورواه زهير بن محمد عن النبي صلى الله عليه وسلم بنحوه مرسلا. وقاله ابن عباس رضي الله عنهما\" وروى ابن أبي حاتم حدثنا أبي حدثنا يحيى بن أبي يحيى المقري حدثنا عمر بن سمرة عن جعفر بن محمد قال سمعت أبي يقول: نظر رسول الله صلى الله عليه وسلم إلى ملك الموت عند رأس رجل من الأنصار فقال له النبي صلى الله عليه وسلم \"يا ملك الموت أرفق بصاحبي فإنه مؤمن\" فقال ملك الموت: يا محمد طب نفسا وقر عينا فإني بكل مؤمن رفيق واعلم أن ما في الأرض بيت مدر ولا شعر في بر ولا بحر إلا وأنا أتصفحهم في كل يوم خمس مرات حتى أني أعرف بصغيرهم وكبيرهم منهم بأنفسهم والله يا محمد لو أنى أردت أن أقبض روح بعوضة ما قدرت على ذلك حتى يكون الله هو الآمر بقبضها. قال جعفر بلغني أنه إنما يتصفحهم عند مواقيت الصلاة فإذا حضرهم عند الموت فإن كان ممن يحافظ على الصلاة دنا منه الملك ودفع عنه الشيطان ولقنه الملك لا إله إلا الله محمد رسول الله في تلك الحال العظيمة وقال عبد الرزاق حدثنا محمد بن مسلم عن إبراهيم بن ميسرة قال سمعت مجاهدا يقول: ما على ظهر الأرض من بيت شعر أو مدر إلا وملك الموت يطرف به كل يوم مرتين وقال كعب الأحبار والله ما من بيت فيه أحد من أهل الدنيا إلا وملك الموت يقوم على بابه كل يوم سبع مرات ينظر هل فيه أحد أمرأن يتوقاه. رواه ابن أبي حاتم وقوله تعالى \" ثم إلى ربكم ترجعون \"أي يوم معادكم وقيامكم من قبوركم لجزائكم\"."
    },
    {
      "ayah": 12,
      "surah": 32,
      "text": "يخبر تعالى عن حال المشركين يوم القيامة وقالهم حين عاينوا البعث وقاموا بين يدي الله عز وجل حقيرين ذليلين ناكسي رؤوسهم أي من الحياء والخجل يقولون \"ربنا أبصرنا وسمعنا\" أي نحن الآن نسمع قولك ونطيع أمرك ما قال تعالى \"أسمع بهم أبصر يوم يأتوننا\" وكذلك يعودون على أنفسهم بالملامة إذا دخلوا النار بقولهم \"لو كنا نسمع أو نعقل ما كنا في أصحاب السعير\" وهكذا هؤلاء يقولون \"ربنا أبصرنا وسمعنا فارجعنا\" أي إلى الدنيا \"نعمل صالحا إنا موقنون\" أي قد أيقنا وتحققنا فيها أن وعدك حق ولقاءك حق وقد علم الرب تعالى منهم أنه لو أعادهم إلى دار الدنيا لكانوا كما كانوا فيها كفارا يكذبون بآيات الله ويخالفون رسله كما قال تعالى \"ولو ترى إذ وقفوا على النار فقالوا يا ليتنا نرد ولا نكذب بآيات ربنا\" الآية."
    },
    {
      "ayah": 13,
      "surah": 32,
      "text": "قال ههنا \"ولو شئنا لآتينا كل نفس هداها\" كما قال تعالى \"ولو شاء ربك لآمن من فى الأرض كلهم جميعا\" \"ولكن حق القول مني لأملأن جهنم من الجنة والناس أجمعين\" أي من الصنفين فدارهم النار لا محيد لهم عنها ولا محيص لهم منها نعوذ بالله وكلماته التامة من ذلك."
    },
    {
      "ayah": 14,
      "surah": 32,
      "text": "\"فذوقوا بما نسيتم لقاء يومكم هذا\" أي يقال لأهل النار على سبيل التقريع والتوبيخ ذوقوا هذا هذا العذاب بسبب تكذيبكم به واستبعادكم وقوعه وتناسيكم له إذا عاملتموه معاملة من هو ناس له \"إنا نسيناكم\" أي سنعاملكم معاملة الناسي لأنه تعالى لا ينسى شيئا ولا يضل عنه شيء بل من باب المقابلة كما قال تعالى \"فاليوم ننساكم نسيتم لقاء يومكم هذا\" وقوله تعالى \"وذوقوا عذاب الخلد بما كنتم تعملون\" أي بسبب كفركم وتكذيبكم كما قال في الآية الأخرى \"لا يذوقون فيها بردا ولا شرابا إلا حميما وغساقا\" - إلى قوله - \"فلن نزيدكم إلا عذابا\"."
    },
    {
      "ayah": 15,
      "surah": 32,
      "text": "يقول تعالى \"إنما يؤمن بآياتنا\" أي إنما يصدق بها \"الذين إذا ذكروا بها خروا سجدا\" أي استمعوا لها وأطاعوها قولا وفعلا \"وسبحوا بحمد ربه وهم لا يستكبرون\" أي عن اتباعها والانقياد لها كما يفعله الجهلة من الكفرة الفجرة قال الله تعالى \"إن الذين يستكبرون عن عبادتي سيدخلون جهنم داخرين\"."
    },
    {
      "ayah": 16,
      "surah": 32,
      "text": "ثم قال تعالى \"تتجافى جنوبهم عن المضاجع\" يعني ذلك قيام الليل وترك النوم والاضطجاع على الفرش الوطيئة قال مجاهد والحسن في قوله تعالى \"تتجافى جنوبهم عن المضاجع\" معني بذلك قيام الليل وعن أنس وعكرمة ومحمد بن المنكدر وأبي حازم وقتادة هو الصلاة بين العشاءين وعن أنس أيضا هو انتظار صلاة العتمة رواه ابن جرير بإسناد جيد وقال الضحاك وهو صلاة العشاء في جماعة وصلاة الغداة في جماعة \"يدعون ربهم خوفا وطمعا\" أي خوفا من وبال عقابه وطمعا في جزيل ثوابه \"ومما رزقناهم ينفقون\" فيجمعون بين فعل القربات اللازمة والمتعدية ومقدم هؤلاء وسيدهم لفخرهم الدنيا والآخرة رسول الله صلى الله عليه وسلم كما قال عبد الله بن رواحة رضي الله عنه وفينا رسول الله يتلو كتابه إذا انشق معروف من الصبح ساطع أرانا الهدى بعد العمى فقلوبنا به موقنات أن ما قال واقع يبيت يجافي جنبه عن فراشه إذا استثقلت بالمشركين المضاجع وقال الإمام أحمد حدثنا روح وعفان قالا حدثنا حماد بن سلمة أخبرنا عطاء بن السائب عن مرة الهمداني عن ابن مسعود عن النبي صلى الله عليه وسلم قال \"عجب ربنا من رجلين: رجل ثار من وطائه ولحافه من بين حبه وأهله إلى صلاته رغبة فيما عندي وشفقة مما عندي ورجل غزا في سبيل الله تعالى فانهزموا فعلم ما عليه من الفرار وما له في الرجوع فرجع حتى أهريق دمه رغبة فيما عندي وشفقة مما عندي فيقول الله عز وجل للملائكة انظروا إلى عبدي رجع رغبة فيما عندي ورهبة مما عندي حتى أهريق دمه\" وهكذا رواه أبو داود في الجهاد عن موسى بن إسماعيل عن حماد بن سلمة به بنحوه. وقال الإمام أحمد حدثنا عبد الرزاق أخبرنا معمر عن عاصم بن أبي النجود عن أبي وائل عن معاذ بن جبل قال كنت مع النبي صلى الله عليه وسلم في سفر فأصبحت يوما قريبا منه ونحن نسير فقلت يا نبي الله أخبرني بعمل يدخلني الجنة ويباعدني من النار قال \"لقد سألت عن عظيم وإنه ليسير على من يسره الله عليه تعبد الله ولا تشرك به شيئا وتقيم الصلاة وتؤتي الزكاة وتصوم رمضان وتحج البيت ثم قال ألا أدلك على أبواب الخير؟ الصوم جنة والصدقة تطفئ الخطيئة وصلاة الرجل في جوف الليل- ثم قرأ \"تتجافى جنوبهم عن المضاجع - حتى بلغ - جاء بما كانوا يعملون\" ثم قال - ألا أخبرك برأس الأمر وعموده وذروة سنامه؟ - فقلت بلى يا رسول الله فقال - رأس الأمر الإسلام وعموده الصلاة وذروة سنامه الجهاد في سبيل الله - ثم قال - ألا أخبرك بملاك ذلك كله؟ فقلت بلى يا نبي الله فأخذه بلسانه ثم قال كف عليك هذا فقلت يا رسول الله وإنا لمؤاخذون مما نتكلم به؟ فقال ثكلتك أمك يا معاذ وهل يكب الناس في النار على وجوههم - أو قال على مناخرهم ـ إلا حصائد ألسنتهم؟\" ورواه الترمذي والنسائي وابن ماجه في سننهم من طرق عن معمر به وقال الترمذي حسن صحيح ورواه ابن جرير من حديث شعبة عن الحكم قال: سمعت عروة بن الزبير يحدث عن معاذ بن جبل أن رسول الله صلى الله عليه وسلم قال له \"ألا أدلك على أبواب الخير؟ الصوم جنة والصدقة تكف الخطيئة وقيام العبد في جوف الليل\" وتلا هذه الآية \"تتجافى جنوبهم عن المضاجع يدعون ربهم خوفا وطمعا ومما رزقناهم ينفقون\" ورواه أيضا من حديث الثوري عن منصور بن المعتمر عن الحكم عن ميمون بن أبي شبيب عن معاذ عن النبي صلى الله عليه وسلم بنحوه ومن حديث الأعمش عن حبيب بن أبي ثابت والحكم عن ميمون بن أبي شبيب عن معاذ مرفوعا بنحوه ومن حديث حماد بن سلمة عن عاصم بن أبي النجود عن شهر عن معاذ أيضا عن النبي صلى الله عليه وسلم في قوله تعالى \"تتجافى جنوبهم عن المضاجع قال\" \"قيام العبد من الليل\" وروى ابن أبي حاتم حدثنا أحمد بن سنان الواسطي حدثنا يزيد بن هارون حدثنا قطر بن خليفة عن حبيب بن أبي ثابت والحكم وحكيم بن جرير عن ميمون بن أبي شبيب عن معاذ بن جبل قال: كنت مع النبي صلى الله عليه وسلم في غزوة تبوك فقال \"إن شئت نبأتك بأبواب الخير الصوم جنة والصدقة تطفئ الخطيئة وقيام الرجل في جوف الليل\" ثم تلا رسول الله صلى الله عليه وسلم \"تتجافى جنوبهم عن المضاجع\" الآية ثم قال حدثنا أبي حدثنا سويد بن سعيد حدثنا علي بن مسهر عن عبد الرحمن بن إسحاق عن شهر بن حوشب عن أسماء بنت يزيد قالت قال رسول الله صلى الله عليه وسلم \"إذا جمع الله الأولين والآخرين يوم القيامة جزاء مناد فنادى بصوت يسمع الخلائق سيعلم أهل الجمع اليوم من أولى بالكرم ثم يرجع فينادي ليقم الذين كانت \"تتجافى جنوبهم عن المضاجع\" الآية - فيقومون وهم قليل\" وقال البزار حدثنا عبد الله بن شبيب حدثنا الوليد بن عطاء بن الأغر حدثنا عبد الحميد بن سليمان حدثني مصعب عن زيد بن أسلم عن أبيه قال: قال بلال لما نزلت هذه الآية \"تتجافى جنوبهم عن المضاجع\" الآية كنا نجلس في المجلس وناس من أصحاب رسول الله صلى الله عليه وسلم يصلون بعد المغرب إلى العشاء فنزلت هذه الآية \"تتجافى جنوبهم عن المضاجع\" ثم قال لا نعلم روى أسلم عن بلال سواه وليس له طريق عن بلال غير هذه الطريق."
    },
    {
      "ayah": 17,
      "surah": 32,
      "text": "وقوله تعالى \"فلا تعلم نفس ما أخفي لهم من قرة أعين\" الآية أي فلا يعلم أحد عظمة ما أخفى الله لهم في الجنات من النعيم المقيم واللذات التي لم يطلع على مثلها أحد لما أخفوا أعمالهم كذلك أخفى الله لهم من الثواب جزاء وفاقا فإن الجزاء من جنس العمل قال الحسن البصري: أخفى قوم عملهم أخفى الله لهم ما لم ترعين ولم يخطر على قلب بشر. رواه ابن أبي حاتم قال البخاري قوله تعالى \"فلا تعلم نفس ما أخفي لهم من قرة أعين\" الآية حدثنا علي بن عبد الله حدثنا سفيان عن أبي الزناد عن الأعرج عن أبي هريرة رضي الله عنه عن رسول الله صلى الله عليه وسلم قال قال الله تعالى \"أعددت لعبادي الصالحين ما لا عين رأت ولا أذن سمعت ولا خطر على قلب بشر\" قال أبو هريرة اقرءوا إن شئتم \"فلا تعلم نفس ما أخفي لهم من قرة أعين\" قال وحدثنا سفيان حدثنا أبو الزناد عن الأعرج عن أبي هريرة قال: قال الله مثله قيل لسفيان رواية قال فأي شيء؟ ورواه مسلم والترمذي من حديث سفيان بن عيينة به وقال الترمذي حسن صحيح ثم قال البخاري حدثنا إسحاق بن نصر حدثنا أبو أسامة عن الأعمش حدثنا أبو صالح عن أبي هريرة رضي الله عنه عن النبي صلى الله عليه وسلم \"يقول الله تعالى أعددت لعبادي الصالحين ما لا عين رأت ولا أذن سمعت ولا خطر على قلب بشر ذخرا من بله ما اطلعتم عليه\" ثم قرأ \"فلا تعلم نفس ما أخفي لهم من قرة أعين جزاء بما كانوا يعملون\" قال أبو معاوية عن الأعمش عن أبي صالح قرأ أبو هريرة \"قرات أعين\" انفرد به البخاري من هذا الوجه وقال الإمام أحمد حدثنا عبد الرزاق حدثنا معمر عن همام بن منبه قال: هذا ما حدثنا أبو هريرة عن رسول الله صلى الله عليه وسلم \"إن الله تعالى قال أعددت لعبادي الصالحين ما لا عين رأت ولا أذن سمعت ولا خطر على قلب بشر\" أخرجاه في الصحيحين من رواية عبد الرزاق قال ورواه الترمذي في التفسير وابن جرير من حديث عبد الرحيم بن سليمان عن محمد بن عمرو عن أبي سلمة عن أبي هريرة رضي الله عنه عن رسول الله صلى الله عليه وسلم بمثله ثم قال الترمذي هذا حديث حسن صحيح وقال حماد بن سلمة عن ثابت بن أبي رافع عن أبي هريرة رضي الله عنه قال حماد أحسبه عن النبي صلى الله عليه وسلم قال \"من يدخل الجنة ينعم لا يبأس لا تبلى ثيابه ولا يفنى شبابه في الجنة ما لا عين رأت ولا أذن سمعت ولا خطر على قلب شر\" رواه مسلم من حديث حماد بن سلمة به وروى الإمام أحمد حدثنا هارون حدثنا ابن وهب حدثني أبو صخر أن أبا حازم حدثه قال سمعت سهل بن سعد الساعدي رضي الله عنه \" يقول شهدت من رسول الله صلى الله عليه وسلم مجلسا وصف فيه الجنة حتى انتهى ثم قال في آخر حديثه \"فيها ما لا عين رأت ولا أذن سمعت ولا خطر على قلب بشر\" ثم قرأ هذه الآية \"تتجافى جنوبهم عن المضاجع\" - إلى قوله- \"يعملون\" وأخرجه مسلم في صحيحه عن هارون بن معروف وهارون بن سعيد كلاهما عن ابن وهب به وقال ابن جرير حدثني العباس بن أبي طالب حدثنا على بن أسد حدثنا سلام بن أبي مطيع عن قتادة عن عقبة بن عبد الغافر عن أبي سعيد الخدري عن رسول الله صلى الله عليه وسلم يروي عن ربه عز وجل قال \" أعددت لعبادي الصالحين ما لا عين رأت ولا أذن سمعت ولا خطر على قلب بشر \" لم يخرجوه وقال مسلم أيضا في صحيحه حدثنا ابن أبي عمر وغيره حدثنا سفيان ثنا مطرف بن طريف وعبد الملك بن سعيد سمعا الشعبي يخبر عن المغيرة بن شعبة قال سمعته على المنبر يرفعه إلى النبي صلى الله عليه وسلم قال سأل موسى عليه السلام \"ربه عز وجل ما أدنى أهل الجنة منزله؟ قال هو رجل يجيء بعدما أدخل أهل الجنة الجنة فيقال له ادخل الجنة فيقول أي رب كيف وقد أخذ الناس منازلهم وأخذوا أخذاتهم؟ فيقال له أترضى أن يكون لك مثل ملك من ملوك الدنيا؟ فيقول رضيت رب فيقول لك ذلك ومثله ومثله ومثله ومثله فقال في الخامسة رضيت رضيت ربي فيقول هذا لك وعشرة أمثاله معه ولك ما اشتهت نفسك ولذت عينك فيقول رضيت رب قال رب فأعلاهم منزله قال أولئك الذين أردت غرست كرامتهم بيدي وختمت عليها فلم تر عين ولم تسمع أذن ولم يخطر على قلب بشر\" قال ومصداقه من كتاب الله عز وجل \"فلا تعلم نفس ما أخفي لهم من قرة أعين\" الآية ورواه الترمذي عن ابن أبي عمر وقال حسن صحيح قال ورواه بعضهم عن الشعبي عن المغيرة ولم يرفعه والمرفوع أصح قال ابن أبي حاتم حدثنا جعفر بن المدائني حدثنا أبو بدر بن شجاع بن الوليد حدثنا زياد بن خيثمة عن محمد بن جحادة عن عامر بن عبد الواحد قال: بلغني أن الرجل من أهل الجنة يمكث في مكانه سبعين سنة ثم يلتفت فإذا هو بامرأة أحسن مما كان فيه فتقول له قد آن لك أن يكون لنا منك نصيب فيقول من أنت؟ فتقول أنا من المزيد فيمكث معها سبعين سنة ثم يلتفت فإذا هو بامرأة أحسن مما كان فيه فتقول له قد آن لك أن يكون لنا منك نصيب فيقول من أنت؟ فتقول أنا التي قال الله \"فلا تعلم نفس ما أخفي لهم من قرة أعين\" وقال ابن لهيعة حدثني عطاء بن دينار عن سعيد بن جبير قال: تدخل عليهم الملائكة في مقدار كل يوم من أيام الدنيا ثلاث مرات معهم التحف من الله من جنات عدن ما ليس في جناتهم وذلك قوله تعالى \"فلا تعلم نفس ما أحفي لهم من قرة أعين\" ويخبرون أن الله عنهم راض وروى ابن جرير حدثنا سهل بن موسى الرازي حدثنا الوليد بن مسلم عن صفوان بن عمرو عن أبي اليمان الهوزني أو غيره قال: الجنة مائة درجة أولها درجة فضة وأرضها فضة ومساكنها فضة وآنيتها فضة وترابها المسك\" والثانية ذهب وأرضها ذهب ومساكنها ذهب وآنيتها ذهب وترابها المسك والثالثة لؤلؤ وأرضها اللؤلؤ ومساكنها اللؤلؤ وآنيتها اللؤلؤ وترابها المسك وسبع وتسعون بعد ذلك ما لا عين رأت ولا أذن سمعت ولا خطر على قلب بشر ثم تلا هذه الآية \"فلا تعلم نفس ما أخفي لهم\" وقال ابن جرير حدثني يعقوب بن إبراهيم حدثنا معتمر بن سليمان عن الحكم بن أبان عن الغطريف عن جابر بن زيد عن ابن عباس عن النبي صلى الله عليه وسلم عن الروح الأمين قال \"يؤتى بحسنات العبد وسيئاته ينقص بعضها من بعض فإن بقيت حسنة واحدة وسع الله له في الجنة قال فدخلت على بزداد فحدث بمثل هذا الحديث قال فقلت فأين ذهبت الحسنة قال \"أولئك الذين نتقبل عنهم أحسن ما عملوا ونتجاوز عن سيئاتهم\" الآية قلت قوله تعالى \"فلا تعلم نفس ما أخفي لهم من قرة أعين\" قال العبد يعمل سرا أسره إلى الله لم يعلم به الناس فأسر الله له يوم القيامة قرة أعين."
    },
    {
      "ayah": 18,
      "surah": 32,
      "text": "يخبر تعالى عن عدله وكرمه أنه لا يساوي في حكمه يوم القيامة من كان مؤمنا بآياته متبعا لرسله بمن كان فاسقا أي خارجا عن طاعة ربه مكذبا لرسل الله إليه كما قال تعالى \"أم حسب الذين اجترحوا السيئات أن نجعلهم كالذين آمنوا وعملوا الصالحات سواء محياهم ومماتهم ساء ما يحكمون\" وقال تعالى \"أم نجعل الذين آمنوا وعملوا الصالحات كالمفسدين في الأرض أم نجعل المتقين كالفجار\" وقال تعالى \"لا يستوي أصحاب النار وأصحاب الجنة\" الآية ولهذا قال تعالى ههنا \"أفمن كان مؤمنا كمن كان فاسقا لا يستوون\" أي عند الله يوم القيامة."
    },
    {
      "ayah": 19,
      "surah": 32,
      "text": "وقد ذكر عطاء بن يسار والسدي وغيرهما أنها نزلت في علي بن أبي طالب وعقبة بن أبي معيط ولهذا فصل حكمهم فقال \"أما الذين آمنوا وعملوا الصالحات\" أي صدقت قلوبهم بآيات الله وعملوا بمقتضاها وهي الصالحات \"فلهم جنات المأوى\" أي التي فيها المساكن والدور والغرف العالية \"نزلا\" أي ضيافة وكرامة."
    },
    {
      "ayah": 2,
      "surah": 32,
      "text": "وقوله \"تنزيل الكتاب لا ريب فيه\" أي لا شك فيه ولا مرية أنه منزل \"من رب العالمين\"."
    },
    {
      "ayah": 20,
      "surah": 32,
      "text": "\"وأما الذين فسقوا\" أي خرجوا عن الطاعة فمأواهم النار كلما أرادوا أن يخرجوا منها أعيدوا فيها كقوله \"كلما أرادوا أن يخرجوا منها من غم أعيدوا فيها\" الآية قال الفضيل بن عياض: والله إن الأيدي لموثقة وإن الأرجل لمقيدة وإن اللهب ليرفعهم والملائكة تقمعهم \"وقيل لهم ذوقوا عذاب النار الذي كنتم به تكذبون\" أي يقال لهم ذلك تقريعا وتوبيخا."
    },
    {
      "ayah": 21,
      "surah": 32,
      "text": "وقوله تعالى \"ولنذيقنهم من العذاب الأدنى دون العذاب الأكبر\" قال ابن عباس يعني بالعذاب الأدنى مصائب الدنيا وأسقامها وآفاتها وما يحل بأهلها مما يبتلي الله به عباده ليتوبوا إليه وروي مثله عن أبي بن كعب وأبي العالية والحسن وإبراهيم النخعي والضحاك وعلقمة وعطية ومجاهد وقتادة وعبد الكريم الجزري وخصيف وقال ابن عباس في رواية عنه يعني به إقامة الحدود عليهم. وقال البراء بن عازب ومجاهد وأبو عبيدة يعني به عذاب القبر. وقال النسائي أخبرنا عمرو بن على أخبرنا عبد الرحمن بن مهدي عن إسرائيل عن أبي إسحاق عن أبي الأحوص وأبي عبيدة عن عبد الله \"ولنذيقنهم من العذاب الأدنى دون العذاب الأكبر\" قال سنون أصابتهم وقال عبد الله بن الإمام أحمد حدثني عبد الله بن عمر القواريري حدثنا يحيى بن سعيد عن شعبة عن قتادة عن عروة عن الحسن العوفي عن يحيى بن الجزار عن ابن أبي ليلى عن أبي بن كعب في هذه الآية \"ولنذيقنهم من العذاب الأدنى دون العذاب الأكبر\" قال القمر والدخان قد مضيا والبطشة واللزام ورواه مسلم من حديث شعبة به موقوفا نحوه وعند البخاري عن ابن مسعود نحوه وقال عبد الله بن مسعود أيضا في رواية عنه العذاب الأدنى ما أصابهم من القتل والسبي يوم بدر وكذا قال مالك عن زيد بن أسلم قال السدي وغيره لم يبق بيت بمكة إلا دخله الحزن على قتيل لهم أو أسير فأصيبوا أو غرموا ومنهم من جمع له الأمران."
    },
    {
      "ayah": 22,
      "surah": 32,
      "text": "وقوله تعالى \"ومن أظلم ممن ذكر بآيات ربه ثم أعرض عنها\" أي لا أظلم ممن ذكره الله بآياته وبينها له ووضحها ثم بعد ذلك تركها وجحدها وأعرض عنها وتناساها كأنه لا يعرفها. قال قتادة إياكم والإعراض عن ذكر الله فإن من أعرض عن ذكره فقد اغتر أكبر الغرة وأعوز أشد العوز وعظم من أعظم الذنوب ولهذا قال تعالى متهددا لمن فعل ذلك \"إنا من المجرمين منتقمون\" أي سأنتقم ممن فعل ذلك أشد الانتقام. وروى ابن جرير حدثني عمران بن بكار الكلاعي حدثنا محمد بن المبارك حدثنا إسماعيل بن عياش حدثنا عبد العزيز بن عبيد الله عن عبادة بن نسي عن جنادة بن أمية عن معاذ بن جبل قال: سمعت رسول الله صلى الله عليه وسلم يقول \"ثلاث من فعلهن فقد أجرم: من عقد لواء في غير حق أو عق والديه أو مشى مع ظالم ينصره فقد أجرم يقول الله تعالى \"إنا من المجرمين منتقمون\" ورواه ابن أبي حاتم من حديث إسماعيل بن عياش به وهذا حديث غريب جدا."
    },
    {
      "ayah": 23,
      "surah": 32,
      "text": "يقول تعالى مخبرا عن عبده ورسوله موسى عليه السلام أنه آتاه الكتاب وهو التوراة وقوله تعالى \"فلا تكن في مرية من لقائه\" قال قتادة يعني به ليلة الإسراء ثم روي عن أبي العالية الرياحي قال حدثني ابن عم نبيكم يعني ابن عباس قال: قال رسول الله صلى الله عليه وسلم \" أريت ليلة أسري بي موسى بن عمران رجلا آدم طوالا جعدا كأنه من رجال شنوأة ورأيت عيسى رجلا مربوع الخلق إلى الحمرة والبياض سبط الرأس ورأيت مالكا خازن النار والدجال \" في آيات أراهن الله إياه \"فلا تكن في مرية من لقائه\" أنه قد رأى موسى ولقي موسى ليلة أسري. وقال الطبراني حدثنا محمد بن عثمان بن أبي شيبة حدثنا الحسن بن علي الحلواني حدثنا روح بن عبادة حدثنا سعيد بن أبي عروبة عن قتادة عن أبي العالية عن ابن عباس عن النبي صلى الله عليه وسلم في قوله تعالى \"وجعلناه هدى لبني إسرائيل\" قال جعل موسى هدى لبني إسرائيل وفي قوله \"فلا تكن في مرية من لقائه\" قال من لقاء موسى ربه عز وجل وقوله تعالى \"وجعلناه\" أي الكتاب الذي آتيناه \"هدى لبني إسرائيل\" كما قال تعالى في سورة الإسراء\" وآتينا موسى الكتاب وجعلناه هدى لبني إسرائيل أن لا تتخذوا من دوني وكيلا\"."
    },
    {
      "ayah": 24,
      "surah": 32,
      "text": "قوله تعالى \"وجعلنا منهم أئمة يهدون بأمرنا لما صبروا وكانوا بآياتنا يوقنون\" أي لما كانوا صابرين على أوامر الله وترك زواجره وتصديق رسله واتباعهم فيما جاءوهم به كان منهم أئمة يهدون إلى الحق بأمر الله ويدعون إلى الخير ويأمرون بالمعروف وينهون عن المنكر ثم لما بدلوا وحرفوا وأولوا سلبوا ذلك المقام وصارت قلوبهم قاسية يحرفون الكلم عن مواضعه فلا عملا صالحا ولا اعتقادا صحيحا ولهذا قال تعالى \"ولقد آتينا بني إسرائيل الكتاب\" قال قتادة وسفيان لما صبروا عن الدنيا وكذلك قال الحسن بن صالح قال سفيان: هكذا كان هؤلاء ولا ينبغي للرجل أن يكن إماما يقتدى به حتى يتحامى عن الدنيا قال وكيع قال سفيان لا بد للدين من العلم كما لا بد للجسد من الخبز وقال ابن بنت الشافعي قرأ أبي على عمي أو عمي على أبي سئل سفيان عن قول علي رضي الله عنه الصبر من الإيمان بمنزلة الرأس من الجسد ألم تسمع قوله \"وجعلنا منهم أئمة يهدون بأمرنا لما صبروا\" قال لما أخذوا برأس الأمر صاروا رؤوسا قال بعض العلماء بالصبر واليقين تنال الإمامة في الدين ولهذا قال تعالى \"ولقد آتينا بني إسرائيل الكتاب والحكم والنبوة ورزقناهم من الطيبات وفضلناهم على العالمين وآتيناهم بينات من الأمر\" الأية."
    },
    {
      "ayah": 25,
      "surah": 32,
      "text": "قال هنا \"إن ربك هو يفصل بينهم يوم القيامة فيما كانوا فيه يختلفون\" أي من الاعتقادات والأعمال."
    },
    {
      "ayah": 26,
      "surah": 32,
      "text": "يقول تعالى أو لم يهد لهؤلاء المكذبين بالرسل ما أهلك الله قبلهم من الأمم الماضية بتكذيبهم الرسل ومخالفتهم إياهم فيما جاءوهم به من قويم السبل فلم يبق منهم من باقية ولا عين ولا أثر \"هل تحس منهم من أحد أو تسمع لهم ركزا\" ولهذا قال \"يمشون في مساكنهم\" أي وهؤلاء المكذبون يمشون في مساكن أولئك المكذبين فلا يرون فيها أحدا ممن كان يسكنها ويعمرها ذهبوا منها \"كأن لم يغنوا فيها\" كما قال \"فتلك بيوتهم خاوية بما ظلموا\" وقال \"وكأين من قرية أهلكناها وهي ظالمة فهي خاوية على عروشها وبئر معطلة وقصر مشيد أفلم يسيروا في الأرض - إلى قوله - ولكن تعمى القلوب التي في الصدور\" ولهذا قال ههنا \"إن في ذلك لآيات\" أي إن في ذهاب أولئك القوم ودمارهم وما حل بهم بسبب تكذيبهم الرسل ونجاة من آمن بهم لآيات وعبرا ومواعظ ودلائل متناظرة \"أفلا يسمعون\" أي أخبار من تقدم كيف كان أمرهم."
    },
    {
      "ayah": 27,
      "surah": 32,
      "text": "قوله تعالى \"أو لم يروا أنا نسوق الماء إلى الأرض الجرز\" يبين تعالى لطفه بخلقه وإحسانه إليهم في إرساله الماء إما من السماء أو من السيح وهو ما تحمله الأنهار ويتحدر من الجبال إلى الأراضي المحتاجة إليه في أوقاته ولهذا قال تعالى \"إلى الأرض الجرز\" وهي التي لا نبات فيها كما قال تعالى \"وإنا لجاعلون ما عليها صعيدا جرزا\" أي يبسا لا تنبت شيئا وليس المراد من قوله \"إلى الأرض الجرز\" أرض مصر فقط بل بعض المقصود وإن مثل بها كثير من المفسرين فليست هي المقصودة وحدها ولكنها مرادة قطعا من هذه الآية فإنها في نفسها أرض رخوة غليظة تحتاج من الماء ما لو نزل عليها مطرا لتهدمت أبنيتها فيسوق الله تعالى إليها النيل بما يتحمله من الزيادة الحاصلة من أمطار بلاد الحبشة وفيه طين أحمر فيغشى أرض مصر وهي أرض سبخة مرملة محتاجة إلى ذلك الماء وذلك الطين أيضا لينبت الزرع فيه فيستغلون كل سنة على ماء جديد ممطور في غير بلادهم وطين جيد من غير أرضهم فسبحان الحكيم الكريم المنان المحمود أبدا وقال ابن لهيعة عن قيس بن حجاج عمن حدثه قال: لما فتحت مصر أتى أهلها عمرو بن العاص وكان أميرا بها حين دخل بؤونة من أشهر العجم فقالوا أيها الأمير إن لنيلنا هذا سنة لا يجري إلا بها قال وما ذاك؟ قالوا إذا كانت ثنتا عشرة ليلة خلت من هذا الشهر عمدنا إلى جارية بكر بين أبويها فأرضينا أبويها وجعلنا عليها من الحلي والثياب أفضل ما يكون ثم ألقيناها في النيل فقال لهم عمرو إن هذا لا يكون في الإسلام إن الإسلام يهدم ما كان قبله فأقاموا بؤونة والنيل لا يجري حتى هموا بالجلاء فكتب عمرو إلى عمر بن الخطاب بذلك فكتب إليه عمر إنك قد أصبت بالذي فعلت وقد بعثت إليك ببطاقة داخل كتابي هذا فألقها في النيل فلما قدم كتابه أخذ عمرو البطاقة ففتحها فإذا فيها: من عبد الله عمر أمير المؤمنين إلى نيل أهل مصر. أما بعد فإنك إن كنت إنما تجري من قبلك فلا تجري وإن كان الله الواحد هو الذي يجريك فنسأل الله أن يجريك قال فألقى البطاقة في النيل فأصبحوا يوم السبت وقد أجرى الله النيل ستة عشر ذراعا في ليلة واحدة وقد قطع الله تلك السنة عن أهل مصر إلى اليوم. رواه الحافظ أبو القاسم اللالكائي الطبري في كتاب السنة له ولهذا قال تعالى \" أو لم يروا أنا نسوق الماء إلى الأرض الجرز فنخرج به زرعا تأكل منه أنعامهم وأنفسهم أفلا يبصرون \" كما قال تعالى \" فلينظر الإنسان إلى طعامه أنا صببنا الماء صبا \" الآية ولهذا قال ههنا \" أفلا يبصرون \" وقال ابن أبي نجيح عن رجل عن ابن عباس في قوله \"إلى الأرض الجرز\" قال هي التي لا مطر إلا مطرا لا يغني عنها شيئا إلا ما يأتيها من السيول وعن ابن عباس ومجاهد هي أرض باليمن وقال الحسن رحمه الله هي قرى فيما بين اليمن والشام وقال عكرمة والضحاك وقتادة والسدي وابن زيد الأرض الجرز التي لا نبات فيها وهي مغبرة قلت وهذا كقوله تعالى \"وآية لهم الأرض الميتة أحييناها\" الآيتين."
    },
    {
      "ayah": 28,
      "surah": 32,
      "text": "يقول تعالى مخبرا استعجال الكفار ووقوع بأس الله بهم وحلول غضبه ونقمته عليهم استبعادا وتكذيبا وعنادا \"ويقولون متى هذا الفتح\" أي متى تنصر علينا يا محمد؟ كما تزعم أن لك وقتا تدال علينا وينتقم لك منا فمتى يكون هذا ما نراك أنت وأصحابك إلا مختفين خائفين ذليلين."
    },
    {
      "ayah": 29,
      "surah": 32,
      "text": "قال الله تعالى \"قل يوم الفتح\" أي إذا حل بكم بأس الله وسخطه وغضبه في الدنيا وفي الآخرة \"لا ينفع الذين كفروا إيمانهم ولا هم ينظرون\" كما قال تعالى \"فلما جاءتهم رسلهم بالبينات فرحوا بما عندهم من العلم\" الآيتين ومن زعم أن المراد هذا الفتح فتح مكة فقد أبعد النجعة وأخطأ فأفحش فإن يوم الفتح قد قبل رسول اله صلى الله عليه وسلم إسلام الطلقاء وقد كانوا قريبا من ألفين ولو كان المراد فتح مكة لما قبل إسلامهم لقوله تعالى \"قل يوم الفتح لا ينفع الذين كفروا إيمانهم ولا هم ينظرون\" وإنما المراد الفتح الذي هو القضاء والفصل كقوله \"فافتح بيني وبينهم فتحا\" الآية وكقوله \"قل يجمع بيننا ربنا ثم يفتح بيننا بالحق\" الآية وقال تعالى \"واستفتحوا وخاب كل جبار عنيد\" وقال تعالى \"وكانوا من قبل يستفتحون على الذين كفروا\" وقال تعالى \"إن تستفتحوا فقد جاءكم الفتح\"."
    },
    {
      "ayah": 3,
      "surah": 32,
      "text": "ثم قال تعالى مخبرا عن المشركين \"أم يقولون افتراه\" أي اختلقه من تلقاء نفسه \"بل هو الحق من ربك لتنذر قوما ما أتاهم من نذير من قبلك لعلهم يهتدون\" أي يتبعون الحق."
    },
    {
      "ayah": 30,
      "surah": 32,
      "text": "ثم قال تعالى \"فأعرض عنهم وانتظر إنهم منتظرون\" أي عرض عن هؤلاء المشركين وبلغ ما أنزل إليك من ربك كقوله تعالى \"اتبع ما أوحي إليك من ربك لا إله إلا هو\" الآية وانتظر فإن الله سينجز لك ما وعدك وسينصرك على من خالفك إنه لا يخلف الميعاد وقوله \"إنهم منتظرون\" أي أنت منتظر وهم منتظرون ويتربصون بكم الدوائر \"أم يقولون شاعر نتربص به ريب المنون\" وسترى أنت عاقبة صبرك عليهم وعلى أداء رسالة الله في نصرتك وتأييدك وسيجدون غيب ما ينتظرونه فيك وفي أصحابك من وبيل عقاب الله لهم وحلول عذابه بهم وحسبنا الله ونعم الوكيل. آخر تفسير سورة السجدة ولله الحمد والمنة."
    },
    {
      "ayah": 4,
      "surah": 32,
      "text": "يخبر تعالى أنه الخالق للأشياء فخلق السموات والأرض وما بينهما في ستة أيام ثم استوى على العرش وقد تقدم الكلام على ذلك \"ما لكم من دونه من ولي ولا شفيع\" أي بل هو المالك لأزمة الأمور الخالق لكل شيء المدبر لكل شيء القادر على كل شيء فلا ولي لخلقه سواه ولا شفيع إلا من بعد إذنه \"أفلا تتذكرون\" يعني أيها العابدون غيره المتوكلون على من عداه تعالى وتقدس وتنزه أن يكون له نظير أو شريك أو وزير أو نديد أو عديل لا إله إلا هو ولا رب سواه وقد أورد النسائي ههنا حديثا فقال: حدثنا إبراهيم بن يعقوب حدثني محمد بن الصباح حدثنا أبو عبيدة الحداد حدثنا الأخضر بن عجلان عن أبي جريج المكي عن عطاء عن أبي هريرة أن رسول الله صلى الله عليه وسلم أخذ بيدي فقال \"إن الله خلق السموات والأرض وما بينهما في ستة أيام ثم استوى على العرش في اليوم السابع فخلق التربة يوم السبت والجبال يوم الأحد والشجر يوم الاثنين والمكروه يوم الثلاثاء والنور يوم الأربعاء والدواب يوم الخميس وآدم يوم الجمعة في آخر ساعة من النهار بعد العصر وخلق من أديم الأرض أحمرها وأسودها وطيبها وخبيثها من أجل ذلك جعل الله من بني آدم الطيب والخبيث\" هكذا أورد هذا الحديث إسنادا ومتنا وقد أخرج مسلم والنسائي أيضا من حديث حجاج ابن محمد الأعور عن ابن جريج عن إسماعيل بن أمية عن أيوب بن خالد عن عبد الله بن رافع عن أبي هريرة عن النبي صلى الله عليه وسلم بنحو من هذا السياق. وقد علله البخاري في كتاب التاريخ الكبير فقال وقال بعضهم أبو هريرة عن كعب الأحبار وهو أصح وكذا علله غير واحد من الحفاظ والله أعلم."
    },
    {
      "ayah": 5,
      "surah": 32,
      "text": "وقوله تعالى \"يدبر الأمر من السماء إلى الأرض ثم يعرج إليه\" أي يتنزل أمره من أعلى السماوات إلى أقصى تخوم الأرض السابعة كما قال تعالى \"الله الذي خلق سبع سماوات ومن الأرض مثلهن يتنزل الأمر بينهن\" الآية وترفع الأعمال إلى ديوانها فوق سماء الدنيا ومسافة ما بينها وبين الأرض مسيرة خمسمائة سنة وسمك السماء خمسمائة سنة: وقال مجاهد وقتادة والضحاك النزول من الملك في مسيرة خمسمائة عام وصعوده في مسيرة خمسمائة عام ولكنه يقطعها في طرفة عين. ولهذا قال تعالى \"في يوم كان مقداره ألف سنة مما تعدون\"."
    },
    {
      "ayah": 6,
      "surah": 32,
      "text": "\"ذلك عالم الغيب والشهادة\" أي المدبر لهذه الأمور الذي هو شهيد على أعمال عباده يرفع إليه جليلها وحقيرها وصغيرها وكبيرها هو العزيز الذي قد عز كل شيء فقهره وغلبه ودانت له العباد والرقاب الرحيم بعباده المؤمنين فهو عزيز في رحمته رحيم في عزته وهذا هو الكمال العزة مع الرحمة والرحمة مع العزة فهو رحيم بلا ذل."
    },
    {
      "ayah": 7,
      "surah": 32,
      "text": "يقول تعالى مخبرا أنه الذي أحسن خلق الأشياء وأتقنها وأحكمها وقال مالك عن زيد بن أسلم \"الذي أحسن كل شيء خلقه\" قال أحسن خلق كل شيء كأنه جعله من المقدم والمؤخر ثم لما ذكر تعالى خلق السماوات والأرض شرع في ذكر خلق الإنسان فقال تعالى \"وبدأ خلق الإنسان من طين\" يعني خلق أبا البشر آدم من طين."
    },
    { "ayah": 8, "surah": 32, "text": "أي يتناسلون كذلك من نطفة تخرج من بين صلب الرجل وترائب المرأة." },
    {
      "ayah": 9,
      "surah": 32,
      "text": "\"ثم سواه\" يعني آدم لما خلقه من تراب خلقه سويا مستقيما \"ونفخ فيه من روحه وجعل لكم السمع والأبصار والأفئدة\" يعني العقول \"قليلا ما تشكرون\" أي بهذه القوى التي رزقكموها الله عز وجل فالسعيد من استعملها في طاعة ربه عز وجل."
    }
  ]
}
