{
  "ayahs": [
    {
      "ayah": 1,
      "surah": 33,
      "text": "سورة الأحزاب: قال الإمام أحمد حدثنا خلف بن هشام حدثنا حماد بن زيد عن عاصم بن بهدلة عن زر قال: قال لي أبي بن كعب كأين تقرأ سورة الأحزاب أو كأين تعدها؟ قال قلت ثلاثًا وسبعين آية فقال قط لقد رأيتها وإنها لتعادل سورة البقرة ولقد قرأنا فيها الشيخ والشيخة إذا زنا فارجموه البتة نكالا من الله والله عزيز حكيم ورواه النسائي من وجه آخر عن عاصم وهو ابن أبي النجود وهو أبو بهدلة به وهذا إسناد حسن وهو يقتضي أنه قد كان فيها قرآن ثم نسخ لفظه وحكمه أيضا والله أعلم. هذا تنبيه بالأعلى على الأدنى فإنه تعالى إذا كان يأمر عبده ورسوله بهذا فلأن يأتمر من دونه بذلك بطريق الأولى والأحرى وقد قال طلق بن حبيب: التقوى أن تعمل بطاعة الله على نور من الله ترجو ثواب الله وأن تترك معصية الله على نور من الله مخافة عذاب الله. قوله تعالى \"ولا تطع الكافرين والمنافقين\" أي لا تسمع منهم ولا تستشرهم \"إن الله كان عليما حكيما\" أي فهو أحق أن تتبع أوامره وتطيعه فإنه عليم بعواقب الأمور حكيم في أقواله وأفعاله."
    },
    {
      "ayah": 10,
      "surah": 33,
      "text": "كما قال الله تعالى \"إذ جاءوكم من فوقكم ومن أسفل منكم\" وخرج رسول الله صلى الله عليه وسلم ومن معه من المسلمين وهم نحو من ثلاثة آلاف وقيل سبعمائة فأسندوا ظهورهم إلى سلع ووجوههم إلى نحو العدو والخندق حفير ليس فيه ماء بينهم وبينهم يحجب الخيالة والرجالة أن تصل إليهم وجعل النساء والذراري في آطام المدينة وكانت بنو قريظة وهم طائفة من اليهود لهم حصن شرق المدينة ولهم عهد من النبي وذمة وهم قريب من ثمانمائة مقاتل فذهب إليهم حيي بن أخطب النضري فلم يزل بهم حتى نقضوا العهد ومالأوا الأحزاب على رسول الله صلى الله عليه وسلم فعظم الخطب واشتد الأمر وضاق الحال كما قال الله تبارك وتعالى \"هنالك ابتلي المؤمنون وزلزلوا زلزالا شديدا\" ومكثوا محاصرين للنبي صلى الله عليه وسلم وأصحابه قريبا من شهر إلا أنهم لا يصلون إليهم ولم يقع بينهم قتال إلا أن عمرو بن عبد ود العامري وكان من الفرسان الشجعان المشهورين في الجاهلية ركب ومعه فوارس فاقتحموا الخندق وخلصوا إلى ناحية المسلمين فندب رسول الله صلى الله عليه وسلم خيل المسلمين إليه فقال إنه لم يبرز إليه أحد فأمر عليا رضي الله عنه فخرج إليه فتجاولا ساعة ثم قتله علي رضي الله عنه فكان علامة على النصر. ثم أرسل الله عز وجل على الأحزاب ريحا شديدة الهبوب قوية حتى لم يبق لهم خيمة ولا شيء ولا توقد لهم نار ولا يقر لهم قرار حتى ارتحلوا خائبين خاسرين كما قال الله عز وجل \"يا أيها الذين آمنوا اذكروا نعمة الله عليكم إذ جاءتكم جنود فأرسلنا عليهم ريحا وجنودا\" قال مجاهد وهي الصبا ويؤيده الحديث الآخر \"نصرت بالصبا وأهلكت عاد بالدبور\" وقال ابن جرير حدثني محمد بن المثنى حدثنا عبد الأعلى حدثنا داود عن عكرمة قال: قالت الجنوب للشمال ليلة الأحزاب انطلقي ننصر رسول الله صلى الله عليه وسلم فقالت الشمال إن الحرة لا تسري بالليل قال فكانت الريح التي أرسلت عليهم الصبا ورواه ابن أبي حاتم عن أبي سعيد الأشج عن حفص بن غياث عن داود عن عكرمة عن ابن عباس رضي الله عنهما فذكره وقال ابن جرير أيضا حدثنا يونس حدثنا ابن وهب حدثني عبيد الله بن عمر عن نافع عن عبد الله بن عمر رضي الله عنهما قال: أرسلني خالي عثمان بن مظعون رضي الله عنه ليلة الخندق في برد شديد وريح إلى المدينة فقال ائتنا بطعام ولحاف قال فاستأذنت رسول الله صلى الله عليه وسلم فأذن لي وقال \"من أتيت من أصحابي فمرهم يرجعوا\" قال فذهبت والريح تسفي كل شيء فجعلت لا ألقى أحدا إلا أمرته بالرجوع إلى النبي صلى الله عليه وسلم قال فما يلوي أحد منهم عنقه قال وكان معي ترس لي فكانت الريح تضربه علي وكان فيه حديد قال فضربته الريح حتى وقع بعض ذلك الحديد على كفي فأبعدها إلى الأرض. وقوله \"وجنودا لم تروها\" هم الملائكة زلزلتهم وألقت في قلوبهم الرعب والخوف فكان رئيس كل قبيلة يقول يا بني فلان إلي فيجتمعون إليه فيقول النجاء النجاء لما ألقى الله عز وجل في قلوبهم من الرعب وقال محمد بن إسحاق عن يزيد بن زياد عن محمد بن كعب القرظي قال: قال فتى من أهل الكوفة لحذيفة بن اليمان رضي الله عنه يا أبا عبد الله رأيتم رسول الله صلى الله عليه وسلم وصحبتموه؟ قال نعم يا ابن أخي قال وكيف كنتم تصنعون؟ قال والله لقد كنا نجهد قال الفتى والله لو أدركناه ما تركناه يمشي على الأرض ولحملناه على أعناقنا. قال: قال حذيفة رضي الله عنه يا ابن أخي والله لو رأيتنا مع رسول الله صلى الله عليه وسلم بالخندق وصلى رسول الله صلى الله عليه وسلم هويا من الليل ثم التفت فقال: \"من رجل يقوم فينظر لنا ما فعل القوم؟ - يشترط له النبي صلى الله عليه وسلم أن يرجع - أدخله الله الجنة\" قال فما قام رجل ثم صلى رسول الله صلى الله عليه وسلم هويا من الليل ثم التفت إلينا فقال مثله فما قام منا رجل ثم صلى رسول الله صلى الله عليه وسلم هويا من الليل ثم التفت إلينا فقال \"من رجل يقوم فينظر لنا ما فعل القوم ثم يرجع؟ - يشترط له رسول الله صلى الله عليه وسلم الرجعة - أسأل الله تعالى أن يكون رفيقي في الجنة\" فما قام رجل من القوم من شدة الخوف وشدة الجوع وشدة البرد فلما لم يقم أحد دعاني رسول الله صلى الله عليه وسلم فلم يكن لي بد من القيام حين دعاني فقال \"يا حذيفة اذهب فادخل في القوم فانظر ما يفعلون ولا تحدث شيئا حتى تأتينا\" قال فذهبت فدخلت في القوم والريح وجنود الله عز وجل تفعل بهم ما تفعل لا تقر لهم قرارا ولا نارا ولا بناء فقام أبو سفيان فقال يا معشر قريش لينظر كل امرئ من جليسه. قال حذيفة رضي الله عنه فأخذت بيد الرجل الذي إلى جنبي فقلت من أنت؟ فقال أنا فلان بن فلان ثم قال أبو سفيان يا معشر قريش إنكم والله ما أصبحتم بدار مقام لقد هلك الكراع والخف وأخلفتنا بنو قريظة وبلغنا عنهم الذي نكره ولقينا من هذه الريح ما ترون والله ما تطمئن لنا قدر ولا تقوم لنا نار ولا يستمسك لنا بناء فارتحلوا فإني مرتحل ثم قام إلى جمله وهو معقول فجلس عليه ثم ضربه فوثب به على ثلاث فما أطلق عقاله إلا وهو قائم ولولا عهد رسول الله صلى الله عليه وسلم إلي أن لا تحدث شيئا حتى تأتيني لو شئت لقتلته بسهم قال حذيفة رضي الله عنه فرجعت إلى رسول الله صلى الله عليه وسلم وهو قائم يصلي في مرط لبعض نسائه مرحل فلما رآني أدخلني بين رجليه وطرح علي طرف المرط ثم ركع وسجد وإني لفيه فلما سلم أخبرته الخبر وسمعت غطفان بما فعلت قريش فانشمروا راجعين إلى بلادهم وقد رواه مسلم في صحيحه من حديث الأعمش عن إبراهيم التيمي عن أبيه قال: كنا عند حذيفة بن اليمان رضي الله عنه فقال له رجل لو أدركت رسول الله صلى الله عليه وسلم قاتلت معه وأبليت: فقال له حذيفة أنت كنت تفعل ذلك؟ لقد رأيتنا مع رسول الله ليلة الأحزاب في ليلة ذات ريح شديدة وقر فقال رسول الله صلى الله عليه وسلم \"ألا رجل يأتي بخبر القوم يكون معي يوم القيامة\" فلم يجبه منا أحد ثم الثانية ثم الثالثة مثله ثم قال صلى الله عليه وسلم \"يا حذيفة قم فأتنا بخبر من القوم\" فلم أجد بدا إذ دعاني باسمي أن أقوم فقال: \"ائتني بخبر القوم ولا تذعرهم علي\" قال فمضيت كأنما أمشي في حمام حتى أتيتهم فإذا أبو سفيان يصلي ظهره بالنار فوضعت سهما في كبد قوسي وأردت أن أرميه ثم ذكرت قول رسول الله صلى الله عليه وسلم لا تذعرهم علي ولو رميته لأصبته قال فرجعت كأنما أمشي في حمام فأتيت رسول الله صلى الله عليه وسلم ثم أصابني البرد حين فرغت وقررت فأخبرت رسول الله صلى الله عليه وسلم وألبسني من فضل عباءة كانت عليه يصلي فيها فلم أزل نائما حتى الصبح فلما أن أصبحت قال رسول الله صلى الله عليه وسلم \"قم يا نومان\" ورواه يونس بن بكير عن هشام بن سعد عن زيد بن أسلم قال إن رجلا قال لحذيفة رضي الله عنه نشكو إلى الله صحبتكم لرسول الله صلى الله عليه وسلم إنكم أدركتموه ولم ندركه ورأيتموه ولم نره فقال حذيفة رضي الله عنه ونحن نشكو إلى الله إيمانكم به ولم تروه والله لا تدري يا ابن أخي لو أدركته كيف كنت تكون لقد رأيتنا مع رسول الله صلى الله عليه وسلم ليلة الخندق في ليلة باردة مطيرة ثم ذكر نحو ما تقدم مطولا. وروى بلال بن يحيى العبسي عن حذيفة رضي الله عنه نحو ذلك أيضا وقد أخرجه الحاكم والبيهقي في الدلائل من حديث عكرمة بن عمار عن محمد بن عبد الله الدؤلي عن عبد العزيز ابن أخى حذيفة قال ذكر حذيفة رضي الله عنه مشاهدهم مع رسول الله صلى الله عليه وسلم فقال جلساؤه أما والله لو شهدنا ذلك لكنا فعلنا وفعلنا. فقال حذيفة لا تمنوا ذلك لقد رأيتنا ليلة الأحزاب ونحن صافون قعودا وأبو سفيان ومن معه من الأحزاب فوقنا وقريظة لليهود أسفل منا نخافهم على ذرارينا وما أتت علينا قط أشد ظلمة ولا أشد ريحا في أصوات ريحها أمثال الصواعق وهي ظلمة ما يرى أحدنا أصبعه فجعل المنافقون يستأذنون النبي صلى الله عليه وسلم ويقولون: إن بيوتنا عورة وما هى بعورة فما يستأذنه أحد منهم إلا أذن له ويأذن لهم فيتسللون ونحن ثلثمائة أو نحو ذلك إذا استقبلنا رسول الله صلى الله عليه وسلم رجلا رجلا حتى أتى علي وما علي جنة من العدو ولا من البرد إلا مرط لامرأتي ما يجاوز ركبتي قال فأتاني صلى الله عليه وسلم وأنا جاث على ركبتي فقال: \"من هذا؟\" فقلت حذيفة قال \"حذيفة\" فتقاصرت الأرض فقلت: بلى يا رسول الله كراهية أن أقوم فقمت فقال: \"إنه كائن في القوم خير فائتني بخبر القوم\" قال وأنا من أشد الناس فزعا وأشدهم قرا قال فخرجت فقال رسول الله صلى الله عليه وسلم \"اللهم احفظه من بين يديه ومن خلفه وعن يمينه وعن شماله ومن فوقه ومن تحته\" قال فوالله ما خلق الله تعالى فزعا ولا قرا في جوفي إلا خرج من جوفي فما أجد فيه شيئا قال فلما وليت قال صلى الله عليه وسلم \"يا حذيفة لا تحدثن في القوم شيئا حتى تأتيني\" قال فخرجت حتى إذا دنوت من عسكر القوم نظرت في ضوء نار لهم توقد فإذا رجل أدهم ضخم يقول بيده على النار ويمسح خاصرته ويقول الرحيل الرحيل ولم أكن أعرف أبا سفيان قبل ذلك فانتزعت سهما من كنانتي أبيض الريش فأضعه في كبد قوسي لأرميه به في ضوء النار فذكرت قول رسول الله صلى الله عليه وسلم \"لا تحدثن فيهم شيئا حتى تأتيني\" قال فأمسكت ورددت سهمي إلى كنانتي ثم إني شجعت نفسي حتى دخلت العسكر فإذا أدنى الناس مني بنو عامر يقولون يا آل عامر الرحيل الرحيل لا مقام لكم. وإذا الريح في عسكرهم ما تجاوز عسكرهم شبرا فوالله إني لأسمع صوت الحجارة في رحالهم وفرشهم الريح تضربهم بها ثم خرجت نحو النبي صلى الله عليه وسلم فلما انتصفت في الطريق أو نحوا من ذلك إذا أنا بنحو من عشرين فارسا أو نحو ذلك معتمين فقال أخبر صاحبك أن الله تعالى كفاه القوم فرجعت إلى رسول الله صلى الله عليه وسلم وهو مشتمل في شملة يصلي فوالله ما عدا أن رجعت راجعني القر وجعلت أقرقف فأومأ إلي سول الله صلى الله عليه وسلم بيده وهو يصلي فدنوت منه فأسبل علي شملة وكان رسول الله إذا حزبه أمر صلى فأخبرته خبر القوم وأخبرته أني تركتهم يرتحلون وأنزل الله تعالى \"يا أيها الذين آمنوا اذكروا نعمة الله عليكم إذ جاءتكم جنود فأرسلنا عليهم ريحا وجنودا لم تروها وكان الله بما تعملون بصيرا\" وأخرج أبو داود في سننه منه كان رسول الله صلى الله عليه وسلم إذا حزبه أمر صلى من حديث عكرمة بن عمار به وقوله تعالى: \"إذ جاءوكم من فوقكم\" أي الأحزاب \"ومن أسفل منكم\" تقدم عن حذيفة رضي الله عنه أنهم بنو قريظة \"وإذ زاغت الأبصار وبلغت القلوب الحناجر\" أي من شدة الخوف والفزع \"وتظنون بالله الظنونا\" قال ابن جرير ظن بعض من كان مع رسول الله صلى الله عليه وسلم أن الدائرة على المؤمنين وأن الله سيفعل ذلك وقال محمد بن إسحاق في قوله تعالى: \"وإذ زاغت الأبصار وبلغت القلوب الحناجر وتظنون بالله الظنونا\" ظن المؤمنون كل ظن ونجم النفاق حتى قال معتب بن قشير أخو بني عمرو بن عوف كان محمد يعدنا أن نأكل كنوز كسرى وقيصر وأحدنا لا يقدر على أن يذهب إلى الغائط وقال الحسن في قوله عز وجل \"وتظنون بالله الظنونا\" ظنون مختلفة ظن المنافقون أن محمدا صلى الله عليه وسلم وأصحابه يستأصلون وأيقن المؤمنون أن ما وعد الله ورسوله حق وأنه سيظهره على الدين كله ولو كره المشركون وقال ابن أبي حاتم حدثنا أحمد بن عاصم الأنصاري حدثنا أبو عامر ح وحدثنا أبي حدثنا أبو عامر العقدي حدثنا الزبير يعني ابن عبد الله مولى عثمان رضي الله عنه عن ربيع بن عبد الرحمن بن أبي سعيد عن أبيه عن أبي سعيد رضي الله عنه قال: قلنا يوم الخندق يا رسول الله هل من شيء نقول فقد بلغت القلوب الحناجر؟ قال صلى الله عليه وسلم \"نعم قولوا اللهم استر عوراتنا وآمن روعاتنا قال فضرب وجوه أعدائه بالريح فهزمهم الريح وكذا رواه الإمام أحمد بن حنبل عن أبي عامر العقدي."
    },
    {
      "ayah": 11,
      "surah": 33,
      "text": "يقول تعالى مخبرا عن ذلك الحال حين نزل الأحزاب حول المدينة والمسلمون محصورون في غاية الجهد والضيق ورسول الله صلى الله عليه وسلم بين أظهرهم إنهم ابتلوا واختبروا وزلزلوا زلزالا شديدا فحينئذ ظهر النفاق وتكلم الذين في قلوبهم مرض بما في أنفسهم."
    },
    {
      "ayah": 12,
      "surah": 33,
      "text": "\"وإذ يقول المنافقون والذين في قلوبهم مرض ما وعدنا الله ورسوله إلا غرورا\" أما المنافق فنجم نفاقه والذي في قلبه شبهة أو حسكة لضعف حاله فتنفس بما يجده من الوسواس في نفسه لضعف إيمانه وشدة ما هو فيه من ضيق الحال."
    },
    {
      "ayah": 13,
      "surah": 33,
      "text": "وقوم آخرون قالوا كما قال الله تعالى \"وإذ قالت طائفة منهم يا أهل يثرب\" يعني المدينة كما جاء في الصحيح \"أريت في المنام دار هجرتكم أرض بين حرتين فذهب وهلي أنها هجر فإذا هي يثرب\" وفي لفظ المدينة فأما الحديث الذي رواه الإمام أحمد حدثنا إبراهيم بن مهدي حدثنا صالح بن عمر عن يزيد بن أبي زياد عن عبد الرحمن بن أبي ليلى عن البراء رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم \"من سمى المدينة يثرب فليستغفر الله تعالى إنما هي طابة هي طابة\" تفرد به الإمام أحمد وفي إسناده ضعف والله أعلم ويقال إنما كان أصل تسميتها يثرب برجل نزلها من العماليق يقال له يثرب بن عبيد بن مهلاييل بن عوص بن عملاق بن لاوذ بن إرم بن سام بن نوح. قاله السهيلي قال وروي عن بعضهم أنه قال: إن لها في التوراة أحد عشر اسما: المدينة وطابة وطيبة والمسكينة والجابرة والمحبة والمحبوبة والقاصمة والمجبورة والعذراء والمرحرمة. وعن كعب الأحبار قال: إنا نجد في التوراة يقول الله تعالى للمدينة يا طيبة ويا طابة ويا مسكينة لا تقلي الكنوز أرفع أحاجرك على أحاجر القرى وقوله \"لا مقام لكم\" أي ههنا يعنون عند النبي صلى الله عليه وسلم فى مقام المرابطة \"فارجعوا\" أي إلى بيوتكم ومنازلكم \"ويستأذن فريق منهم النبي\" قال العوفي عن ابن عباس رضي الله عنهما هم بنو حارثة قالوا بيوتنا نخاف عليها السراق وكذا قال غير واحد وذكر ابن إسحاق أن القائل لذلك هو أوس بن قيظي يعني اعتذروا في الرجوع إلى منازلهم بأنها عورة أي ليس دونها ما يحجبها من العدو فهم يخشون عليها منهم قال الله تعالى \"وما هي بعورة\" أي ليست كما يزعمون \"إن يريدون إلا فرارا\" أي هربا من الزحف."
    },
    {
      "ayah": 14,
      "surah": 33,
      "text": "يخبر تعالى عن هؤلاء الذين \"يقولون إن بيوتنا عورة وما هي بعورة إن يريدون إلا فرارا\" أنهم لو دخل عليهم الأعداء من كل جانب من جوانب المدينة وقطر من أقطارها ثم سئلوا الفتنة وهي الدخول في الكفر لكفروا سريعا وهم لا يحافظون على الإيمان ولا يستمسكون به مع أدنى خوف وفزع هكذا فسره قتادة وعبد الرحمن بن زيد وابن جرير وهذا ذم لهم في غاية الذم."
    },
    {
      "ayah": 15,
      "surah": 33,
      "text": "ثم قال تعالى يذكرهم بما كانوا عاهدوا الله من قبل هذا الخوف أن لا يولوا الأدبار ولا يفرون من الزحف \" وكان عهد الله مسئولا \"أي وأن الله تعالى سيسألهم عن ذلك العهد لا بد من ذلك."
    },
    {
      "ayah": 16,
      "surah": 33,
      "text": "ثم أخبرهم أن فرارهم ذلك لا يؤخر آجالهم ولا يطول أعمارهم بل ربما كان ذلك سببا في تعجيل أخذهم غرة ولهذا قال تعالى \"وإذا لا تمتعون إلا قليلا\" أي بعد هربكم وفراركم \"قل متاع الدنيا قليل والآخرة خير لمن اتقى\"."
    },
    {
      "ayah": 17,
      "surah": 33,
      "text": "ثم قال تعالى \"قل من ذا الذي يعصمكم من الله\" أي يمنعكم \"إن أراد بكم سوءا أو أراد بكم رحمة ولا يجدون لهم من دون الله وليا ولا نصيرا\" أي ليس لهم ولا لغيرهم من الله مجير ولا مغيث."
    },
    {
      "ayah": 18,
      "surah": 33,
      "text": "يخبر تعالى عن إحاطة علمه بالمعوقين لغيرهم عن شهود الحرب والقائلين لإخوانهم أي أصحابهم وعشرائهم وخلطائهم \"هلم إلينا\" أي إلى ما نحن فيه من الإقامة في الظلال والثمار وهم مع ذلك \"لا يأتون البأس إلا قليلا أشحة عليكم\" أي بخلاء بالمودة والشفقة عليكم."
    },
    {
      "ayah": 19,
      "surah": 33,
      "text": "وقال السدي \"أشحة عليكم\" أي في الغنائم \"فإذا جاء الخوف رأيتهم ينظرون إليك تدور أعينهم كالذي يغشى عليه من الموت\" أي من شدة خوفه وجزعه وهكذا خوف هؤلاء الجبناء من القتال \"فإذا ذهب الخوف سلقوكم بألسنة حداد\" أي فإذا كان الأمن تكلموا كلاما بليغا فصيحا عاليا وادعوا لأنفسهم المقامات العالية في الشجاعة والنجدة وهم يكذبون في ذل وقال ابن عباس رضي الله عنهما \"سلقوكم\" أي استقبلوكم وقال قتادة أما عند الغنيمة فأشح قوم وأسوأه مقاسمة أعطونا أعطونا قد شهدنا معكم وأما عند البأس فأجبن قوم وأخذله للحق وهم مع ذلك أشحة على الخير أي ليس فيهم خير قد جمعوا الجبن والكذب وقلة الخير فهم كما قال في أمثالهم الشاعر: (أفي السلم أعيار جفاء وغلظة وفي الحرب أمثال النساء العوارك) أي في حال المسالمة كأنهم الحمر والأعيار جمع عير وهو الحمار وفي الحرب كأنهم النساء الحيض ولهذا قال تعالى \"أولئك لم يؤمنوا فأحبط الله أعمالهم وكان ذلك على الله يسيرا\" أي سهلا هينا عنده."
    },
    {
      "ayah": 2,
      "surah": 33,
      "text": "ولهذا قال تعالى \"واتبع ما يوحى إليك من ربك\" أي من قرآن وسنة \"إن الله كان بما تعملون خبيرا\" أي فلا تخفى عليه خافية."
    },
    {
      "ayah": 20,
      "surah": 33,
      "text": "وهذا أيضا من صفاتهم القبيحة في الجبن والخور والخوف \"يحسبون الأحزاب لم يذهبوا\" بل هم قريب منهم وإن لهم عودة إليهم \"وإن يأت الأحزاب يودوا لو أنهم بادون في الأعراب يسألون عن أنبائكم\" أي ويودون إذا جاءت الأحزاب أنهم لا يكونون حاضرين معكم في المدينة بل في البادية يسألون عن أخباركم وما كان من أمركم مع عدوكم \"ولو كانوا فيكم ما قاتلوا إلا قليلا\" أي ولو كانوا بين أظهركم لما قاتلوا معكم إلا قليلا لكثرة جبنهم وذلتهم وضعف يقينهم والله سبحانه وتعالى العالم بهم."
    },
    {
      "ayah": 21,
      "surah": 33,
      "text": "هذه الآية الكريمة أصل كبير في التأسي برسول الله في أقواله وأفعاله وأحواله ولهذا أمر تبارك وتعالى الناس بالتأسي بالنبي صلى الله عليه وسلم يوم الأحزاب في صبره ومصابرته ومرابطته ومجاهدته وانتظاره الفرج من ربه عز وجل صلوات الله وسلامه عليه دائما إلى يوم الدين ولهذا قال تعالى للذين تقلقوا وتضجروا وتزلزلوا واضطربوا في أمرهم يوم الأحزاب \"لقد كان لكم في رسول الله أسوة حسنة\" أي هلا اقتديتم به وتأسيتم بشمائله صلى الله عليه وسلم ولهذا قال تعالى \"لمن كان يرجوا الله واليوم الآخر وذكر الله كثيرا\" ثم قال تعالى مخبرا عن عباده المؤمنين المصدقين بوعود الله لهم وجعله العاقبة حاصلة لهم في الدنيا والآخرة."
    },
    {
      "ayah": 22,
      "surah": 33,
      "text": "فقال تعالى \"ولما رأى المؤمنون الأحزاب قالوا هذا ما وعدنا الله ورسوله وصدق الله ورسوله\" قال ابن عباس رضي الله عنهما وقتادة يعنون قوله تعالى في سورة البقرة \"أم حسبتم أن تدخلوا الجنة ولما يأتكم مثل الذين خلوا من قبلكم مستهم البأساء والضراء وزلزلوا حتى يقول الرسول والذين آمنوا معه متى نصر الله ألا إن نصر الله قريب\"أي هذا ما وعدنا الله ورسوله من الابتلاء والاختبار والامتحان الذي يعقبه النصر القريب ولهذا قال تعالى \"وصدق الله ورسوله \"وقوله تعالى \"وما زادهم إلا إيمانا وتسليما \"دليل على زيادة الإيمان وقوته بالنسبة إلى الناس وأحوالهم كما قال جمهور الأئمة إنه يزيد وينقص وقد قررنا ذلك في أول شرح البخاري ولله الحمد والمنة ومعنى قوله جلت عظمته \"وما زادهم \"أي ذلك الحال والضيق والشدة \"إلا إيمانا \"بالله \"وتسليما \"أي انقيادا لأوامره وطاعة لرسوله صلى الله عليه وسلم."
    },
    {
      "ayah": 23,
      "surah": 33,
      "text": "لما ذكر عز وجل عن المنافقين أنهم نقضوا العهد الذي كانوا عاهدوا الله عليه لا يولون الأدبار وصف المؤمنين أنهم استمروا على العهد والميثاق و \"صدقوا ما عاهدوا الله عليه فمنهم من قضى نحبه \"قال بعضهم أجله وقال البخاري عهده وهو يرجع إلى الأول \"ومنهم من ينتظر وما بدلوا تبديلا \"أي وما غيروا عهد الله ولا نقضوه ولا بدلوه قال البخاري حدثنا أبو اليمان أخبرنا شعيب عن الزهري قال أخبرني خارجة بن زيد بن ثابت عن أبيه قال: لما نسخنا المصحف فقدت آية من سورة الأحزاب كنت أسمع رسول الله صلى الله عليه وسلم يقرؤها لم أجدها إلا مع خزيمة بن ثابت الأنصاري رضي الله عنه الذي جعل رسول الله صلى الله عليه وسلم شهادته بشهادة رجلين \"من المؤمنين رجال صدقوا ما عاهدوا الله عليه \"تفرد به البخاري دون مسلم وأخرجه أحمد في مسنده والترمذي والنسائي في التفسير من سننهما من حديث الزهري به وقال الترمذي حسن صحيح وقال البخاري أيضا حدثنا محمد بن بشار حدثنا محمد بن عبد الله الأنصاري حدثني أبي عن ثمامة عن أنس بن مالك رضي الله عنه قال نرى هذه الآية نزلت في أنس بن النضر رضي الله عنه \"من المؤمنين رجال صدقوا ما عاهدوا الله عليه \"الآية انفرد به البخاري من هذا الوجه ولكن له شواهد من طرق أخر قال الإمام أحمد حدثنا هاشم بن القاسم حدثنا سليمان بن المغيرة عن ثابت قال أنس: عمي أنس بن النضر رضي الله عنه سميت به لم يشهد مع رسول الله صلى الله عليه وسلم يوم بدر فشق عليه وقال أول مشهد شهده رسول الله صلى الله عليه وسلم غبت عنه لئن أراني الله تعالى مشهدا فيما بعد مع رسول الله صلى الله عليه وسلم ليرين الله عز وجل ما أصنع قال فهاب أن يقول غيرها فشهد مع رسول الله صلى الله عليه وسلم يوم أحد فاستقبل سعد بن معاذ رضي الله عنه فقال له أنس رضي الله عنه يا أبا عمرو أين واها لريح الجنة إني أجده دون أحد قال فقاتلهم حتى قتل رضي الله عنه قال فوجد في جسده بضع وثمانون بين ضربة وطعنة ورمية فقالت أخته عمتي الربيع ابنة النضر فما عرفت أخي إلا ببنانه قال فنزلت هذه الآية \"من المؤمنين رجال صدقوا ما عاهدوا الله عليه فمنهم من قضى نحبه ومنهم من ينتظر وما بدلوا تبديلا \"قال فكانوا يرون أنها نزلت فيه وفي أصحابه رضي الله عنهم ورواه مسلم والترمذي والنسائي من حديث سليمان بن المغيرة به ورواه النسائي أيضا وابن جرير من حديث حماد بن سلمة عن ثابت عن أنس رضي الله عنه به نحوه وقال ابن أبي حاتم حدثنا أحمد بن سنان حدثنا يزيد بن هارون حدثنا حميد عن أنس رضي الله عنه قال إن عمه يعني أنس بن النضر رضي الله عنه غاب عن قتال بدر فقال غبت عن أول قتال قاتله رسول الله صلى الله عليه وسلم المشركين لئن أشهدني الله عز وجل قتالا للمشركين ليرين الله تعالى ما أصنع قال فلما كان يوم أحد انكشف المسلمون فقال: اللهم إني أعتذر إليك مما صنع هؤلاء - يعني أصحابه - وأبرأ إليك مما جاء به هؤلاء - يعني المشركين- ثم تقدم فلقيه سعد يعني ابن معاذ رضي الله عنه دون أحد فقال أنا معك قال سعد رضي الله عنه فلم أستطع أن أصنع ما صنع فلما قتل قال فوجد فيه بضع وثمانون ضربة سيف وطعنة رمح ورمية سهم وكانوا يقولون فيه وفى أصحابه نزلت \"فمنهم من قضى نحبه ومنهم من ينتظر \"وأخرجه الترمذي في التفسير عن عبد بن حميد والنسائي فيه أيضا عن إسحاق بن إبراهيم كلاهما عن يزيد بن هارون به وقال الترمذي حسن. وقد رواه البخاري في المغازي عن حسان بن حسان عن محمد بن طلحة عن مصرف عن حميد عن أنس رضي الله عنه به ولم يذكر نزول الآية ورواه ابن جرير من حديث المعتمر بن سليمان عن حميد عن أنس رضي الله عنه به: وقال ابن أبي حاتم حدثنا أحمد بن الفضل العسقلاني حدثنا سليمان بن أيوب بن سليمان حدثنا عيسى بن موسى ابن طلحة بن عبيد الله حدثني أبي عن جدي عن موسى بن طلحة عن أبيه طلحة رضي الله عنه قال: لما أن رجع رسول الله صلى الله عليه وسلم من أحد صعد المنبر فحمد الله تعالى وأثنى عليه وعزى المسلمين بما أصابهم وأخبرهم بما لهم فيه من الأجر والذخر ثم قرأ هذه الآية \"من المؤمنين رجال صدقوا ما عاهدوا الله عليه فمنهم من قضى نحبه \"الآية كلها فقام إليه رجل من المسلمين فقال يا رسول الله من هؤلاء؟ فأقبلت وعلي ثوبان أخضران حضرميان فقال \"أيها السائل هذا منهم \"وكذا رواه ابن جرير من حديث سليمان بن أيوب الطلحي به وأخرجه الترمذي في التفسير والمناقب أيضا وابن جرير من حديث يونس بن بكير عن طلحة بن يحيى عن موسى وعيسى ابني طلحة عن أبيهما رضي الله عنهما وقال حديث غريب لا نعرفه إلا من حديث يونس وقال أيضا حدثنا أحمد بن عصام الأنصاري حدثنا أبو عامر- يعني العقدي - حدثني إسحاق - يعني ابن طلحة بن عبيد الله - عن موسى بن طلحة قال: دخلت على معاوية رضي الله عنه فلما خرجت دعاني فقال ألا أضع عندك يا ابن أخي حديثا سمعته من رسول الله صلى الله عليه وسلم؟ أشهد لسمعت رسول الله صلى الله عليه وسلم يقول \"طلحة ممن قضى نحبه \"ورواه ابن جرير حدثنا أبو كريب حدثنا عبد الحميد الحماني عن إسحاق بن يحيى بن طلحة الطلحي عن موسى بن طلحة قال: قام معاوية بن أبي سفيان رضي الله عنه فقال إني سمعت رسول الله صلى الله عليه وسلم يقول \"طلحة ممن قضى نحبه \"ولهذا قال مجاهد في قوله تعالى \"فمنهم من قضى نحبه \"يعني عهده \"ومنهم من ينتظر \"قال يوما فيه القتال فيصدق في اللقاء وقال الحسن \"فمنهم من قضى نحبه \"يعني موته على الصدق والوفاء ومنهم من ينتظر الموت على مثل ذلك ومنهم من لم يبدل تبديلا وكذا قال قتادة وابن زيد وقال بعضهم نحبه نذره: وقوله تعالى \"وما بدلوا تبديلا \"أي وما غيروا عهدهم وبدلوا الوفاء بالغدر بل استمروا على ما عاهدوا الله عليه وما نقضوه كفعل المنافقين الذين قالوا \"إن بيوتنا عورة وما هي بعورة إن يريدون إلا فرارا ولقد كانوا عاهدوا الله من قبل لا يولون الأدبار \"."
    },
    {
      "ayah": 24,
      "surah": 33,
      "text": "وقوله تعالى \"ليجزي الله الصادقين بصدقهم ويعذب المنافقين إن شاء أو يتوب عليهم \"أي إنما يختبر عباده بالخوف والزلزال ليميز الخبيث من الطيب فيظهر أمر هذا بالفعل وأمر هذا بالفعل مع أنه تعالى يعلم الشيء قبل كونه ولكن لا يعذب الخلق بعلمه فيهم حتى يعملوا بما يعلمه منهم كما قال تعالى \"ولنبلونكم حتى نعلم المجاهدين منكم والصابرين ونبلو أخباركم \"فهذا علم بالشيء بعد كونه وإن كان العلم السابق حاصلا به قبل وجوده وكذا قال الله تعالى \"ما كان الله ليذر المؤمنين على ما أنتم عليه حتى يميز الخبيث من الطيب وما كان الله ليطلعكم على الغيب \"ولهذا قال تعالى ههنا \"ليجزي الله الصادقين بصدقهم \"أي بصبرهم على ما عاهدوا الله عليه وقيامهم به ومحافظتهم عليه \"ويعذب المنافقين \"وهم الناقضون لعهد الله المخالفون لأوامره فاستحقوا بذلك عقابه وعذابه ولكن هم تحت مشيئته في الدنيا إن شاء استمر بهم على ما فعلوا حتى يلقوه فيعذبهم عليه. وإن شاء تاب عليهم بأن أرشدهم إلى النزوع عن النفاق إلى الإيمان والعمل الصالح بعد الفسوق والعصيان ولما كانت رحمته ورأفته بخلقه هي الغالبة لغضبه قال \"إن الله كان غفورا رحيما \"."
    },
    {
      "ayah": 25,
      "surah": 33,
      "text": "يقول تعالى مخبرا عن الأحزاب لما أجلاهم عن المدينة بما أرسل عليهم من الريح والجنود الإلهية ولو أن الله جعل رسوله رحمة للعالمين لكانت هذه الريح عليهم أشد من الريح العقيم التي أرسلها على عاد ولكن قال تعالى \"وما كان الله ليعذبهم وأنت فيهم \"سلط عليهم هواء فرق شملهم كما كان سبب اجتماعهم من الهوى وهم أخلاط من قبائل شتى أحزاب وآراء فناسب أن يرسل عليهم الهواء الذي فرق جماعتهم وردهم خائبين خاسرين بغيظهم وحنقهم لم ينالوا خيرا لا في الدنيا مما كان في أنفسهم من الظفر والمغنم ولا في الآخرة بما تحملوه من الآثام في مبارزة الرسول صلى الله عليه وسلم بالعداوة وهمهم بقتله واستئصال جيشه ومن هم بشيء وصدق همه بفعله فهو في الحقيقة كفاعله. وقوله تبارك وتعالى \"وكفى الله المؤمنين القتال \"أي لم يحتاجوا إلى منازلتهم ومبارزتهم حتى يجلوهم عن بلادهم بل كفى الله وحده ونصر عبده وأعز جنده ولهذا كان رسول الله صلى الله عليه وسلم يقول \"لا إله إلا الله وحده صدق وعده ونصر عبده وأعز جنده وهزم الأحزاب وحده فلا شيء بعده \"أخرجاه من حديث أبي هريرة رضي الله عنه وفي الصحيحين من حديث إسماعيل بن أبي خالد عن عبد الله بن أبي أوفى رضي الله عنه قال: دعا رسول الله صلى الله عليه وسلم على الأحزاب فقال \"اللهم منزل الكتاب سريع الحساب اهزم الأحزاب اللهم اهزمهم وزلزلهم \"وفي قوله عز وجل \"وكفى الله المؤمنين القتال \"إشارة إلى وضع الحرب بينهم وبين قريش وهكذا وقع بعدها لم يغزهم المشركون بل غزاهم المسلمون في بلادهم قال محمد بن إسحاق لما انصرف أهل الخندق عن الخندق قال رسول الله صلى الله عليه وسلم فيما بلغنا \"لن تغزوكم قريش بعد عامكم هذا ولكنكم تغزونهم \"فلم تغز قريش بعد ذلك وكان رسول الله صلى الله عليه وسلم هو يغزوهم بعد ذلك حتى فتح الله تعالى مكة. وهذا الحديث الذي ذكره محمد بن إسحاق حديث صحيح كما قال الإمام أحمد حدثنا يحيى عن سفيان حدثني أبو إسحاق قال سمعت سليمان بن صرد رضي الله عنه يقول: قال رسول الله صلى الله عليه وسلم يوم الأحزاب \"الآن نغزوهم ولا يغزونا \"وهكذا رواه البخاري في صحيحه حديث الثوري وإسرائيل عن أبي إسحاق به وقوله تعالى \"وكان الله قويا عزيزا \"أي بحوله وقوته ردهم خائبين لم ينالوا خيرا وأعز الله الإسلام وأهله وصدق وعده ونصر رسوله وعبده فله الحمد والمنة."
    },
    {
      "ayah": 26,
      "surah": 33,
      "text": "قد تقدم أن بني قريظة لما قدمت جنود الأحزاب ونزلوا على المدينة نقضوا ما كان بينهم وبين رسول الله صلى الله عليه وسلم من العهد وكان ذلك بسفارة حيي بن أخطب النضري لعنه الله دخل حصنهم ولم يزل بسيدهم كعب بن أسد حتى نقض العهد وقال له فيما قال ويحك قد جئتك بعز الدهر أتيتك بقريش وأحابيشها وغطفان وأتباعها ولا يزالون ههنا حتى يستأصلوا محمدا وأصحابه فقال له كعب بل والله أتيتني بذل الدهر ويحك يا حيي إنك مشئوم فدعنا منك فلم يزل يفتل في الذروة والغارب حتى أجابه واشترط له حيي إن ذهب الأحزاب ولم يكن من أمرهم شيء أن يدخل معهم في الحصن فيكون له أسوتهم فلما نقضت قريظة وبلغ ذلك رسول الله صلى الله عليه وسلم ساءه وشق عليه وعلى المسلمين جدا فلما أيده الله تعالى ونصره وكبت الأعداء وردهم خائبين بأخسر صفقة ورجع رسول الله صلى الله عليه وسلم إلى المدينة مؤيدا منصورا ووضع الناس السلاح فبينما رسول الله صلى الله عليه وسلم يغتسل من وعثاء تلك المرابطة في بيت أم سلمة رضي الله عنها إذ تبدي له جبريل عليه السلام معتجرا بعمامة من إستبرق على بغلة عليها قطيفة من ديباج فقال: أوضعت السلاح يا رسول الله؟ قال صلى الله عليه وسلم \"نعم \"قال لكن الملائكة لم تضع أسلحتها وهذا الآن رجوعي من طلب القوم ثم قال: إن الله تبارك وتعالى يأمرك أن تنهض إلى بني قريظة وفي رواية فقال له عذيرك من مقاتل أوضعتم السلاح؟ قال \"نعم \"قال لكنا لم نضع أسلحتنا بعد انهض إلى هؤلاء قال صلى الله عليه وسلم \"أين؟ \"قال بني قريظة فإن الله تعالى أمرني أن أزلزل عليهم فنهض رسول الله صلى الله عليه وسلم من فوره وأمر الناس بالمسير إلى بني قريظة وكانت على أميال من المدينة وذلك بعد صلاة الظهر وقال \"لا يصلين أحد منكم العصر إلا في بني قريظة \"فسار الناس فأدركتهم الصلاة في الطريق فصلى بعضهم في الطريق وقالوا لم يرد منا رسول الله صلى الله عليه وسلم صلى الله عليه وسلم إلا تعجيل المسير وقال آخرون لا نصليها إلا في بني قريظة فلم يعنف واحدا من الفريقين وتبعهم رسول الله صلى الله عليه وسلم وقد استخلف على المدينة ابن أم مكتوم رضي الله عنه وأعطى الراية لعلي بن أبي طالب رضي الله عنه. ثم نازلهم رسول الله صلى الله عليه وسلم وحاصرهم خمسا وعشرين ليلة فلما طال عليهم الحال نزلوا على حكم سعد بن معاذ سيد الأوس رضي الله عنه لأنهم كانوا حلفاءهم في الجاهلية. واعتقدوا أنه يحسن إليهم فى ذلك كما فعل عبد الله بن أبي بن سلول فى مواليه بني قينقاع حين استطلقهم من رسول الله صلى الله عليه وسلم فظن هؤلاء أن سعدا سيفعل فيهم كما فعل ابن أبي في أولئك ولم يعلموا أن سعدا رضي الله عنه كان قد أصابه سهم فى أكحله أيام الخندق فكواه رسول الله صلى الله عليه وسلم في أكحله وأنزله في قبة في المسجد ليعوده من قريب وقال سعد رضي الله عنه فيما دعا به: اللهم إن كنت أبقيت من حرب قريش شيئا فأبقني لها وإن كنت وضعت الحرب بيننا وبينهم فافجرها ولا تمتني حتى تقر عيني من بني قريظة فاستجاب الله تعالى دعاءه وقدر عليهم أن نزلوا على حكمه باختيارهم طلبا من تلقاء أنفسهم فعند ذلك استدعاه رسول الله صلى الله عليه وسلم من المدينة ليحكم فيهم فلما أقبل وهو راكب على حمار قد وطئوا له عليه جعل الأوس يلوذون به ويقولون يا سعد إنهم مواليك فأحسن فيهم ويرفقونه عليهم ويعطفونه وهو ساكت لا يرد عليهم فلما أكثروا عليه قال رضي الله عنه لقد آن لسعد أن لا تأخذه في الله لومة لائم. فعرفوا أنه غير مستبقيهم فلما دنا من الخيمة التي فيها رسول الله صلى الله عليه وسلم قال رسول الله صلى الله عليه وسلم \"قوموا إلى سيدكم \"فقام إليه المسلمون فأنزلوه إعظاما وإكراما واحتراما له في محل ولايته ليكون أنفذ لحكمه فيهم فلما جلس قال له رسول الله صلى الله عليه وسلم \"إن هؤلاء - وأشار إليهم - قد نزلوا على حكمك فاحكم فيهم بما شئت \"فقال رضي الله عنه وحكمي نافذ عليهم؟ قال \"نعم \"قال وعلى من في هذه الخيمة؟ قال \"نعم \"قال وعلى من ههنا- وأشار إلى الجانب الذي فيه رسول الله صلى الله عليه وسلم وهو معرض بوجهه عن رسول الله صلى الله عليه وسلم إجلالا وإكراما وإعظاما - فقال له رسول الله صلى الله عليه وسلم \"نعم \"فقال رضي الله عنه إنى أحكم أن تقتل مقاتلتهم وتسبي ذريتهم وأموالهم فقال له رسول الله صلى الله عليه وسلم \"لقد حكمت بحكم الله تعالى من فوق سبعة أرقعة \" وفي رواية لقد حكمت بحكم الله \"ثم أمر رسول الله صلى الله عليه وسلم بالأخاديد فخدت في الأرض وجيء بهم مكتفين فضرب أعناقهم وكانوا ما بين السبعمائة إلى الثمانمائة وسبى من لم ينبت منهم مع النساء وأموالهم وهذا كله مقرر مفصل بأدلته وأحاديثه وبسطه في كتاب السيرة الذي أفردناه موجزا وبسيطا ولله الحمد والمنة ولهذا قال تعالى \"وأنزل الذين ظاهروهم \"أي عاونوا الأحزاب وساعدوهم على حرب رسول الله صلى الله عليه وسلم \"من أهل الكتاب \"يعني بني قريظة من اليهود من بعض أسباط بني إسرائيل كان قد نزل آباؤهم الحجاز قديما طمعا في اتباع النبي الأمي الذي يجدونه مكتوبا عندهم في التوراة والإنجيل \"فلما جاءهم ما عرفوا كفروا به \"فعليهم لعنة الله وقوله تعالى \"من صياصيهم \"يعني حصونهم. كذا قال مجاهد وعكرمة وعطاء وقتادة والسدي وغيرهم من السلف ومنه سمي صياصي البقر وهي قرونها لأنها أعلى شيء فيها \"وقذف في قلوبهم الرعب \"وهو الخوف لأنهم كانو مالئوا المشركين على حرب النبي صلى الله عليه وسلم وليس من يعلم كمن لا يعلم وأخافوا المسلمين وراموا قتلهم ليعزوهم في الدنيا فانعكس عليهم الحال وانقلب إليهم القال انشمر المشركون ففازوا بصفقة المغبون فكما راموا العز ذلوا وأرادوا استئصال المسلمين فاستؤصلوا وأضيف إلى ذلك شقاوة الآخرة فصارت الجملة أن هذه هي الصفقة الخاسرة ولهذا قال تعالى \"فريقا تقتلون وتأسرون فريقا \"فالذين قتلوا هم المقاتلة والأسراء هم الأصغر والنساء وقال الإمام أحمد حدثنا هشيم بن بشير أخبرنا عبد الملك بن عمير عن عطية القرظي قال عرضت على النبي صلى الله عليه وسلم يوم قريظة فشكوا في فأمر بي النبي صلى الله عليه وسلم أن ينظروا هل أنبت بعد؟ فنظروني فلم يجدوني أنبت فخلى عني وألحقني بالسبي وكذا رواه أهل السنن كلهم من طرق عن عبد الملك بن عمير به وقال الترمذي حسن صحيح ورواه النسائي أيضا من حديث ابن جريج عن ابن أبي نجيح عن مجاهد عن عطية بنحوه."
    },
    {
      "ayah": 27,
      "surah": 33,
      "text": "وقوله تعالى \"وأورثكم أرضهم وديارهم وأموالهم \"أي جعلها لكم من قتلكم لهم \"وأرضا لم تطئوها \"قيل خيبر وقيل مكة رواه مالك عن زيد بن أسلم وقيل فارس والروم وقال ابن جرير يجوز أن يكون الجميع مرادا \"وكان الله على كل شيء قديرا \"قال الإمام أحمد حدثنا يزيد أخبرنا محمد بن النسور عمرو عن أبيه عن جده علقمة بن وقاص قال: أخبرتني عائشة رضي الله عنها قالت: خرجت يوم الخندق أقفو الناس فسمعت وئيد الأرض ورائي فإذا أنا بسعد بن معاذ رضي الله عنه ومعه ابن أخيه الحارث بن أوس يحمل مجنه قالت فجلست إلى الأرض فمر سعد رضي الله عنه وعليه درع من حديد قد خرجت منه أطرافه فأنا أتخوف على أطراف سعد قال وكان سعد رضي الله عنه من أعظم الناس وأطولهم فمر وهو يرتجز ويقول: ليث قليلا يشهد الهيجا جمل ما أحسن الموت إذا حان الأجل قالت فقمت فاقتحمت حديقة فإذا فيها نفر من المسلمين وإذا فيها عمر بن الخطاب رضي الله عنه وفيهم رجل عليه تسبغة له تعني المغفر فقال عمر رضي الله عنه ما جاء بك؟ لعمري والله إنك لجريئة وما يؤمنك أن يكون بلاء أو يكون تخور قالت فما زال يلومني حتى تمنيت أن الأرض انشقت بي ساعتئذ فدخلت فيها فرفع الرجل التسبغة عن وجهه فإذا هو طلحة بن عبيد الله رضي الله عنه فقال: يا عمر ويحك إنك قد أكثرت منذ اليوم وأين التخور أو الفرار إلا إلى الله تعالى؟ قالت ورمى سعدا رضي الله عنه رجل من قريش يقال له ابن العرقة بسهم له وقال له خذها وأنا ابن العرقة فأصاب أكحله فقطعه فدعا الله تعالى سعد رضي الله عنه فقال: اللهم لا تمتني حتى تقر عيني من بني قريظة قالت وكانوا حلفاءه ومواليه فى الجاهلية قالت فرقا كلمه وبعث الله تعالى الريح على المشركين \"وكفى الله المؤمنين القتال وكان الله قويا عزيزا \"فلحق أبو سفيان ومن معه بتهامة ولحق عينيه بن بدر ومن معه بنجد ورجعت بنو قريظة فتحصنوا في صياصيهم ورجع رسول الله صلى الله عليه وسلم إلى المدينة وأمر بقبة من أدم فضربت على سعد رضي الله عنه في المسجد قالت فجاءه جبريل عليه السلام وأن على ثناياه لنقع الغبار فقال أو قد وضعت السلاح؟ لا والله ما وضعت الملائكة بعد السلاح! أخرج إلى بني قريظة فقاتلهم قالت فلبس رسول الله صلى الله عليه وسلم لأمته وأذن في الناس بالرحيل أن يخرجوا فمر على بني تميم وهم جيران المسجد فقال \"من مر بكم؟ \"قالوا مر بنا دحية الكلبي وكان دحية الكلبي يشبه لحيته وسنه ووجهه جبريل عليه السلام فأتاهم رسول الله صلى الله عليه وسلم فحاصرهم خمسا وعشرين ليلة فلما اشتد حصارهم واشتد البلاء قيل لهم انزلوا على حكم رسول الله صلى الله عليه وسلم فاستشاروا أبا لبابة بن عبد المنذر فأشار إليهم إنه الذبح قالوا ننزل على حكم سعد بن معاذ رضي الله عنه عنه فقال رسول الله صلى الله عليه وسلم \"انزلوا على حكم سعد بن معاذ \"فنزلوا وبعث رسول الله صلى الله عليه وسلم إلى سعد بن معاذ رضي الله عنه عنه فأتي به على حمار عليه إكاف من ليف قد حمل عليه وحف به قومه فقالوا يا أبا عمرو حلفاؤك ومواليك وأهل الكتاب ومن قد علمت قالت فلا يرجع إليهم شيئا ولا يلتفت إليهم حتى إذا دنا من دورهم التفت إلى قومه فقال: فد آن أن لا أبالي في الله لومة لائم. قالت قال أبو سعيد فلما طلع قال رسول الله صلى الله عليه وسلم \"قوموا إلى سيدكم فأنزلوه \"فقال عمر رضي الله عنه سيدنا الله قال \"أنزلوه \"فأنزلوه قال رسول الله صلى الله عليه وسلم \"احكم فيهم \"قال سعد رضي الله عنه فإنى أحكم فيهم أن تقتل مقاتلتهم وتسبى ذراريهم وتقسم أموالهم فقال رسول الله صلى الله عليه وسلم \"لقد حكمت فيهم بحكم الله تعالى وحكم رسوله \"ثم دعا سعد رضي الله عنه قال اللهم إن كنت أبقيت على نبيك من حرب قريش شيئا فابقني لها وإن كنت قطعت الحرب بينه وبينهم فاقبضني إليك قال فانفجر كلمه وكان قد برئ منه إلا مثل الخرص ورجع إلى قبته التي ضرب عليه رسول الله صلى الله عليه وسلم قالت عائشة رضي الله عنها فحضره رسول الله صلى الله عليه وسلم وأبو بكر وعمر رضي الله عنهما قالت فوالذي نفس محمد بيده إني لأعرف بكاء أبي بكر رضي الله عنه من بكاء عمر رضي الله عنه وأنا في حجرتي وكانوا كما قال الله تعالى \"رحماء بينهم \"قال علقمة فقلت أي أمه فكيف كان رسول الله صلى الله عليه وسلم يصنع؟ قالت كانت عينه لا تدمع على أحد ولكنه كان إذا وجد فإنما هو آخذ بلحيته صلى الله عليه وسلم وقد أخرج البخاري ومسلم من حديث عبدالله بن نمير عن هشام بن عروة عن أبيه عن عائشة رضي الله عنها نحوا من هذا ولكنه أخصر منه وفيه دعا سعد رضي الله عنه."
    },
    {
      "ayah": 28,
      "surah": 33,
      "text": "هذا أمر من الله تبارك وتعالى لرسوله صلى الله عليه وسلم بأن يخير نساءه بين أن يفارقهن فيذهبن إلى غيره ممن يحصل لهن عنده الحياة الدنيا وزينتها وبين الصبر على ما عنده من ضيق الحال ولهن عند الله تعالى في ذلك الثواب الجزيل فاخترن \"وأرضاهن الله ورسوله والدار الآخرة فجمع الله تعالى رضي الله عنهن كلهن بعد ذلك بين خير الدنيا وسعادة الآخرة. قال البخاري حدثنا أبو اليمان أخبرنا شعيب عن الزهري قال أخبرني أبو سلمة بن عبد الرحمن أن عائشة رضي الله عنها زوج النبي صلى الله عليه وسلم أخبرته أن رسول الله صلى الله عليه وسلم جاءها حين أمره الله تعالى أن يخير أزواجه قالت فبدأ بي رسول الله صلى الله عليه وسلم فقال \"إنى ذاكر لك أمرا فلا عليك أن لا تستعجلي حتى تستأمري أبويك\"وقد علم أن أبوي لم يكونا يأمراني بفراقه قالت ثم قال \"إن الله تعالى قال \"يا أيها النبي قل لأزواجك \"\"إلى تمام الآيتين فقلت له ففي أي هذا أستأمر أبوي فإني أريد الله ورسوله والدار الآخرة وكذا رواه معلقا عن الليث حدثني يونس عن الزهري عن أبي سلمة عن عائشة رضي الله عنها فذكره وزاد قالت ثم فعل أزواج النبي صلى الله عليه وسلم مثل ما فعلت وقد حكى البخاري أن معمرا اضطرب فيه فتارة رواه عن الزهري عن أبي سلمة وتارة رواه عن الزهري عن عروة عن عائشة رضي الله عنها وقال ابن جرير حدثنا أحمد بن عبدة الضبي حدثنا أبو عوانة عن عمر بن أبي سلمة عن أبيه قال: قالت عائشة رضي الله عنها لما نزل الخيار قال لي رسول الله صلى الله عليه وسلم \"إنى أريد أن أذكر لك أمرا فلا تقضي فيه شيئا حتى تستأمري أبويك \"قالت قلت وما هو يا رسول الله؟ قالت فرده عليها فقالت وما هو يا رسول الله؟ قالت فرده عليها فقالت وما هو يا رسول الله؟ قالت فقرأ \"يا أيها النبي قل لأزواجك إن كنتن تردن الحياة الدنيا وزينتها \"إلى آخر الآية قالت فقلت بل نختار الله ورسوله والدار الآخرة قال ففرح بذلك النبي صلى الله عليه وسلم وحدثنا ابن وكيع حدثنا محمد بن بشير عن محمد بن عمرو عن أبي سلمة عن عائشة رضي الله عنها قالت: لما نزلت آية التخيير بدأ بي رسول الله صلى الله عليه وسلم فقال \"يا عائشة إني عارض عليك أمرا فلا تفتاتي فيه بشيء حتى تعرضيه على أبويك أبي بكر وأم رومان رضي الله عنهما \"فقلت يا رسول الله وما هو؟ قال صلى الله عليه وسلم \"قال الله عز وجل \"يا أيها النبي قل لأزواجك إن كنتن تردن الحياة الدنيا وزينتها فتعالين أمتعكن وأسرحكن سراحا جميلا وإن كنتن تردن الله ورسوله والدار الآخرة فإن الله أعد للمحسنات منكن أجرا عظيما \"قالت فإني أريد الله ورسوله والدار الآخرة ولا أؤامر في ذلك أبوي أبا بكر وأم رومان رضي الله عنهما فضحك رسول الله صلى الله عليه وسلم ثم استقرأ الحجر فقال \"إن عائشة رضي الله عنها قالت كذا وكذا \"فقلن ونحن نقول مثل ما قالت عائشة رضي الله عنهن كلهن ورواه ابن أبي حاتم عن أبي سعيد الأشج عن أبي أسامة عن محمد بن عمرو به قال ابن جرير وحدثنا سعيد بن يحيى الأموي حدثنا أبي حدثنا محمد بن إسحاق عن عبد الله بن أبي بكر عن عمرة عن عائشة رضي الله عنها قالت إن رسول الله صلى الله عليه وسلم لما نزل إلى نسائه أمر أن يخيرهن فدخل علي فقال \"سأذكر لك أمرا فلا تعجلي حتى تستشيري أباك \"فقلت وما هو يا رسول الله؟ قال \"إنى أمرت أن أخيركن \"وتلا عليها آية التخيير إلى آخر الآيتين قالت: فقلت وما الذي تقول لا تعجلي حتى تستشيري أباك؟ فإني أختار الله ورسوله. فسر صلى الله عليه وسلم بذلك وعرض على نسائه فتتابعن كلهن فاخترن الله ورسوله صلى الله عليه وسلم وقال ابن أبي حاتم حدثنا يزيد بن سنان البصري حدثنا أبو صالح عبد الله بن صالح حدثن الليث حدثني عقيل عن الزهري أخبرني عبد الله بن عبد الله بن أبي ثور عن ابن عباس رضي الله عنهما قال: قالت عائشة رضي الله عنها أنزلت آية التخيير فبدأ بي أول امرأة من نسائه فقال صلى الله عليه وسلم \"إني ذاكر لك أمرا فلا عليك أن لا تعجلي حتى تستأمري أبويك \"قالت وقد علم أن أبوي لم يكونا يأمراني بفراقه قالت ثم قال \"إن الله تبارك وتعالى قال \"يا أيها النبي قل لأزواجك \"الآيتين قالت عائشة رضي الله عنها فقلت أفي هذا أستأمر أبوي؟ فإني أريد الله ورسوله والدار الآخرة. ثم خير نساءه كله فقلن مثل ما قالت عائشة رضي الله عنهن. وأخرجه البخاري ومسلم جميعا عن قتيبة عن الليث عن الزهري عن عروة عن عائشة رضي الله تعالى عنها مثله. وقال الإمام أحمد حدثنا أبو معاوية حدثنا الأعمش عن مسلم بن صبيح عن مسروق عن عائشة رضي الله عنها قالت: خيرنا رسول الله صلى الله عليه وسلم فاخترناه فلم يعدها علينا شيئا أخرجاه من حديث الأعمش. وقال الإمام أحمد حدثنا أبو عامر عبد الملك بن عمير حدثنا زكريا بن إسحاق عن أبي الزبير عن جابر رضي الله عنه قال أقبل أبو بكر رضي الله عنه يستأذن على رسول الله صلى الله عليه وسلم والناس ببابه جلوس والنبي صلى الله عليه وسلم جالس فلم يؤذن له ثم أقبل عمر رضي الله عنه فاستأذن فلم يؤذن له ثم أذن لأبي بكر وعمر رضي الله عنهما فدخلا والنبي صلى الله عليه وسلم جالس وحوله نساؤه وهو صلى الله عليه وسلم ساكت فقال عمر رضي الله عنه لأكلمن النبي صلى الله عليه وسلم لعله يضحك فقال عمر رضي الله عنه يا رسول الله لو رأيت ابنة زيد - امرأة عمر- سألتني النفقة آنفا فوجأت عنقها فضحك النبي صلى الله عليه وسلم حتى بدت نواجذه وقال \"هن حولي يسألنني النفقة \"فقام أبو بكر رضي الله عنه إلى عائشة ليضربها وقام عمر رضي الله عنه إلى حفصة كلاهما يقولان تسألان النبي صلى الله عليه وسلم ما ليس عنده فنهاهما رسول الله صلى الله عليه وسلم فقلن والله لا نسأل رسول الله صلى الله عليه وسلم بعد هذا المجلس ما ليس عنده قال وأنزل الله عز وجل الخيار فبدأ بعائشة رضي الله عنها فقال \"إني أذكر لك أمرا ما أحب أن تعجلي فيه حتى تستأمري أبويك \"قالت وما هو؟ قال فتلا عليها \"يا أيها النبي قل لأزواجك \"الآية قالت عائشة رضي الله عنها أفيك أستأمر أبوي؟ بل أختار الله تعالى ورسوله وأسألك أن لا تذكر لامرأة من نسائك ما اخترت فقال \"إن الله تعالى لم يبعثني معنفا ولكن بعثني معلما ميسرا لا تسألني امرأة منهن عما اخترت إلا أخبرتها \"انفرد بإخراجه مسلم دون البخاري فرواه هو والنسائي من حديث زكريا بن إسحاق المكي به. وقال عبد الله بن الإمام أحمد حدثنا شريح بن يونس حدثنا علي بن هاشم بن البريد عن محمد بن عبيد الله بن علي بن أبي رافع عن عثمان بن علي بن الحسين عن أبيه عن علي رضي الله عنه قال: إن رسول الله صلى الله عليه وسلم خير نساءه الدنيا والآخرة ولم يخيرهن الطلاق وهذا منقطع. وقد روي عن الحسن وقتادة وغيرهما نحو ذلك وهو خلاف الظاهر من الآية فإنه قال \"فتعالين أمتعكن وأسرحكن سراحا جميلا \"أي أعطيكن حقوقكن وأطلق سراحكن وقد اختلف العلماء في جواز تزوج غيره لهن لو طلقهن على قولين أصحهما نعم لو وقع ليحصل المقصود من السراح والله أعلم قال عكرمة وكان تحته يومئذ تسع نسوة خمس من قريش عائشة وحفصة وأم حبيبة وسودة وأم سلمة \"0 وكانت تحته صلى الله عليه وسلم صفية بنت حيي النضيرية وميمونة بنت الحارث الهلالية وزينب بنت جحش الأسدية وجويرية بنت الحارث المصطلقية رضي الله عنهن وأرضاهن أجمعين."
    },
    {
      "ayah": 29,
      "surah": 33,
      "text": "هذا أمر من الله تبارك وتعالى لرسوله صلى الله عليه وسلم بأن يخير نساءه بين أن يفارقهن فيذهبن إلى غيره ممن يحصل لهن عنده الحياة الدنيا وزينتها وبين الصبر على ما عنده من ضيق الحال ولهن عند الله تعالى في ذلك الثواب الجزيل فاخترن \"وأرضاهن الله ورسوله والدار الآخرة فجمع الله تعالى رضي الله عنهن كلهن بعد ذلك بين خير الدنيا وسعادة الآخرة. قال البخاري حدثنا أبو اليمان أخبرنا شعيب عن الزهري قال أخبرني أبو سلمة بن عبد الرحمن أن عائشة رضي الله عنها زوج النبي صلى الله عليه وسلم أخبرته أن رسول الله صلى الله عليه وسلم جاءها حين أمره الله تعالى أن يخير أزواجه قالت فبدأ بي رسول الله صلى الله عليه وسلم فقال \"إني ذاكر لك أمرا فلا عليك أن لا تستعجلي حتى تستأمري أبويك\"وقد علم أن أبوي لم يكونا يأمراني بفراقه قالت ثم قال \"إن الله تعالى قال \"يا أيها النبي قل لأزواجك \"\"إلى تمام الآيتين فقلت له ففي أي هذا أستأمر أبوي فإني أريد الله ورسوله والدار الآخرة وكذا رواه معلقا عن الليث حدثني يونس عن الزهري عن أبي سلمة عن عائشة رضي الله عنها فذكره وزاد قالت ثم فعل أزواج النبي صلى الله عليه وسلم مثل ما فعلت وقد حكى البخاري أن معمرا اضطرب فيه فتارة رواه عن الزهري عن أبي سلمة وتارة رواه عن الزهري عن عروة عن عائشة رضي الله عنها وقال ابن جرير حدثنا أحمد بن عبدة الضبي حدثنا أبو عوانة عن عمر بن أبي سلمة عن أبيه قال: قالت عائشة رضي الله عنها لما نزل الخيار قال لي رسول الله صلى الله عليه وسلم \"إني أريد أن أذكر لك أمرا فلا تقضي فيه شيئا حتى تستأمري أبويك \"قالت قلت وما هو يا رسول الله؟ قالت فرده عليها فقالت وما هو يا رسول الله؟ قالت فرده عليها فقالت وما هو يا رسول الله؟ قالت فقرأ \"يا أيها النبي قل لأزواجك إن كنتن تردن الحياة الدنيا وزينتها \"إلى آخر الآية قالت فقلت بل نختار الله ورسوله والدار الآخرة قال ففرح بذلك النبي صلى الله عليه وسلم وحدثنا ابن وكيع حدثنا محمد بن بشير عن محمد بن عمرو عن أبي سلمة عن عائشة رضي الله عنها قالت: لما نزلت آية التخيير بدأ بي رسول الله صلى الله عليه وسلم فقال \"يا عائشة إني عارض عليك أمرا فلا تفتاتي فيه بشيء حتى تعرضيه على أبويك أبي بكر وأم رومان رضي الله عنهما \"فقلت يا رسول الله وما هو؟ قال صلى الله عليه وسلم \"قال الله عز وجل \"يا أيها النبي قل لأزواجك إن كنتن تردن الحياة الدنيا وزينتها فتعالين أمتعكن وأسرحكن سراحا جميلا وإن كنتن تردن الله ورسوله والدار الآخرة فإن الله أعد للمحسنات منكن أجرا عظيما \"قالت فإني أريد الله ورسوله والدار الآخرة ولا أؤامر في ذلك أبوي أبا بكر وأم رومان رضي الله عنهما فضحك رسول الله صلى الله عليه وسلم ثم استقرأ الحجر فقال \"إن عائشة رضي الله عنها قالت كذا وكذا \"فقلن ونحن نقول مثل ما قالت عائشة رضي الله عنهن كلهن ورواه ابن أبي حاتم عن أبي سعيد الأشج عن أبي أسامة عن محمد بن عمرو به قال ابن جرير وحدثنا سعيد بن يحيى الأموي حدثنا أبي حدثنا محمد بن إسحاق عن عبد الله بن أبي بكر عن عمرة عن عائشة رضي الله عنها قالت إن رسول الله صلى الله عليه وسلم لما نزل إلى نسائه أمر أن يخيرهن فدخل علي فقال \"سأذكر لك أمرا فلا تعجلي حتى تستشيري أباك \"فقلت وما هو يا رسول الله؟ قال \"إنى أمرت أن أخيركن \"وتلا عليها آية التخيير إلى آخر الآيتين قالت: فقلت وما الذي تقول لا تعجلي حتى تستشيري أباك؟ فإني أختار الله ورسوله. فسر صلى الله عليه وسلم بذلك وعرض على نسائه فتتابعن كلهن فاخترن الله ورسوله صلى الله عليه وسلم وقال ابن أبي حاتم حدثنا يزيد بن سنان البصري حدثنا أبو صالح عبد الله بن صالح حدثن الليث حدثني عقيل عن الزهري أخبرني عبد الله بن عبد الله بن أبي ثور عن ابن عباس رضي الله عنهما قال: قالت عائشة رضي الله عنها أنزلت آية التخيير فبدأ بي أول امرأة من نسائه فقال صلى الله عليه وسلم \"إني ذاكر لك أمرا فلا عليك أن لا تعجلي حتى تستأمري أبويك \"قالت وقد علم أن أبوي لم يكونا يأمراني بفراقه قالت ثم قال \"إن الله تبارك وتعالى قال \"يا أيها النبي قل لأزواجك \"الآيتين قالت عائشة رضي الله عنها فقلت أفي هذا أستأمر أبوي؟ فإني أريد الله ورسوله والدار الآخرة. ثم خير نساءه كله فقلن مثل ما قالت عائشة رضي الله عنهن. وأخرجه البخاري ومسلم جميعا عن قتيبة عن الليث عن الزهري عن عروة عن عائشة رضي الله تعالى عنها مثله. وقال الإمام أحمد حدثنا أبو معاوية حدثنا الأعمش عن مسلم بن صبيح عن مسروق عن عائشة رضي الله عنها قالت: خيرنا رسول الله صلى الله عليه وسلم فاخترناه فلم يعدها علينا شيئا أخرجاه من حديث الأعمش. وقال الإمام أحمد حدثنا أبو عامر عبد الملك بن عمير حدثنا زكريا بن إسحاق عن أبي الزبير عن جابر رضي الله عنه قال أقبل أبو بكر رضي الله عنه يستأذن على رسول الله صلى الله عليه وسلم والناس ببابه جلوس والنبي صلى الله عليه وسلم جالس فلم يؤذن له ثم أقبل عمر رضي الله عنه فاستأذن فلم يؤذن له ثم أذن لأبي بكر وعمر رضي الله عنهما فدخلا والنبي صلى الله عليه وسلم جالس وحوله نساؤه وهو صلى الله عليه وسلم ساكت فقال عمر رضي الله عنه لأكلمن النبي صلى الله عليه وسلم لعله يضحك فقال عمر رضي الله عنه يا رسول الله لو رأيت ابنة زيد - امرأة عمر- سألتني النفقة آنفا فوجأت عنقها فضحك النبي صلى الله عليه وسلم حتى بدت نواجذه وقال \"هن حولي يسألنني النفقة \"فقام أبو بكر رضي الله عنه إلى عائشة ليضربها وقام عمر رضي الله عنه إلى حفصة كلاهما يقولان تسألان النبي صلى الله عليه وسلم ما ليس عنده فنهاهما رسول الله صلى الله عليه وسلم فقلن والله لا نسأل رسول الله صلى الله عليه وسلم بعد هذا المجلس ما ليس عنده قال وأنزل الله عز وجل الخيار فبدأ بعائشة رضي الله عنها فقال \"إني أذكر لك أمرا ما أحب أن تعجلي فيه حتى تستأمري أبويك \"قالت وما هو؟ قال فتلا عليها \"يا أيها النبي قل لأزواجك \"الآية قالت عائشة رضي الله عنها أفيك أستأمر أبوي؟ بل أختار الله تعالى ورسوله وأسألك أن لا تذكر لامرأة من نسائك ما اخترت فقال \"إن الله تعالى لم يبعثني معنفا ولكن بعثني معلما ميسرا لا تسألني امرأة منهن عما اخترت إلا أخبرتها \"انفرد بإخراجه مسلم دون البخاري فرواه هو والنسائي من حديث زكريا بن إسحاق المكي به. وقال عبد الله بن الإمام أحمد حدثنا شريح بن يونس حدثنا علي بن هاشم بن البريد عن محمد بن عبيد الله بن علي بن أبي رافع عن عثمان بن علي بن الحسين عن أبيه عن علي رضي الله عنه قال: إن رسول الله صلى الله عليه وسلم خير نساءه الدنيا والآخرة ولم يخيرهن الطلاق وهذا منقطع. وقد روي عن الحسن وقتادة وغيرهما نحو ذلك وهو خلاف الظاهر من الآية فإنه قال \"فتعالين أمتعكن وأسرحكن سراحا جميلا \"أي أعطيكن حقوقكن وأطلق سراحكن وقد اختلف العلماء في جواز تزوج غيره لهن لو طلقهن على قولين أصحهما نعم لو وقع ليحصل المقصود من السراح والله أعلم قال عكرمة وكان تحته يومئذ تسع نسوة خمس من قريش عائشة وحفصة وأم حبيبة وسودة وأم سلمة \"0 وكانت تحته صلى الله عليه وسلم صفية بنت حيي النضيرية وميمونة بنت الحارث الهلالية وزينب بنت جحش الأسدية وجويرية بنت الحارث المصطلقية رضي الله عنهن وأرضاهن أجمعين."
    },
    {
      "ayah": 3,
      "surah": 33,
      "text": "ولهذا قال تعالى \"واتبع ما يوحى إليك من ربك\" أي من قرآن وسنة \"إن الله كان بما تعملون خبيرا\" أي فلا تخفى عليه خافية."
    },
    {
      "ayah": 30,
      "surah": 33,
      "text": "يقول تعالى واعظا نساء النبي صلى الله عليه وسلم اللاتي اخترن الله ورسوله والدار الآخرة واستقر أمرهن تحت رسول الله صلى الله عليه وسلم فناسب أن يخبرهن بحكمهن وتخصيصهن دون سائر النساء بأن من يأت منهن بفاحشة مبينة. قال ابن عباس رضي الله عنهما: وهي النشوز وسوء الخلق وعلى كل تقدير فهو شرط والشرط لا يقتضي الوقوع كقوله تعالى: \"ولقد أوحي إليك وإلى الذين من قبلك لئن أشركت ليحبطن عملك \"وكقوله عز وجل \"ولو أشركوا لحبط عنهم ما كانوا يعملون \"\"قل إن كان للرحمن ولد فأنا أول العابدين\" \"لو أراد الله أن يتخذ ولدا لاصطفى مما يخلق ما يشاء سبحانه هو الله الواحد القهار \"فلما كانت محلتهن رفيعة ناسب أن يجعل الذنب لو وقع منهن مغلظا صيانة لجنابهن وحجابهن الرفيع ولهذا قال تعالى \"من يأت منكن بفاحشة مبينة يضاعف لها العذاب ضعفين \"قال مالك عن زيد بن أسلم \"يضاعف لها العذاب ضعفين \"قال في الدنيا والآخرة: وعن ابن أبي نجيح عن مجاهد مثله وكان ذلك على الله يسيرا \"أي سهلا هينا."
    },
    {
      "ayah": 31,
      "surah": 33,
      "text": "ثم ذكر عدله وفضله في قوله: \"ومن يقنت منكن لله ورسوله \"أي تطع الله ورسوله وتستجب \"نؤتها أجرها مرتين وأعتدنا لها رزقا كريما \"أي في الجنة فإنهن في منازل رسول الله صلى الله عليه وسلم في أعلى عليين فوق منازل جميع الخلائق في الوسيلة التي هي أقرب منازل الجنة إلى العرش."
    },
    {
      "ayah": 32,
      "surah": 33,
      "text": "هذه آداب أمر الله تعالى بها نساء النبي صلى الله عليه وسلم ونساء الأمة تبع لهن في ذلك فقال تعالى مخاطبا لنساء النبي صلى الله عليه وسلم بأنهن إذا اتقين الله عز وجل كما أمرهن فإنه لا يشبههن أحد من النساء ولا يلحقهن في الفضيلة والمنزلة ثم قال تعالى: \"فلا تخضعن بالقول \"قال السدي وغيره يعني بذلك ترقيق الكلام إذا خاطبن الرجال ولهذا قال تعالى: \"فيطمع الذي في قلبه مرض \"أي دغل \"وقلن قولا معروفا \"قال ابن زيد قولا حسنا جميلا معروفا في الخير ومعنى هذا أنها تخاطب الأجانب بكلام ليس فيه ترخيم أي لا تخاطب المرأة الأجانب كما تخاطب زوجها:."
    },
    {
      "ayah": 33,
      "surah": 33,
      "text": "وقوله تعالى: \"وقرن في بيوتكن \"أي الزمن بيوتكن فلا تخرجن لغير حاجة ومن الحوائج الشرعية الصلاة في المسجد بشرطه كما قال رسول الله صلى الله عليه وسلم \"لا تمنعوا إماء الله مساجد الله وليخرجن وهن تفلات\"- وفي رواية - \"وبيوتهن خير لهن\"وقال الحافظ أبو بكر البزار حدثنا حميد بن مسعدة حدثنا أبو رجاء الكلبي روح بن المسيب ثقة حدثنا ثابت البناني عن أنس رضي الله عنه قال: جئن النساء إلى رسول الله صلى الله عليه وسلم فقلن يا رسول الله ذهب الرجال بالفضل والجهاد في سبيل الله تعالى فمالنا عمل ندرك به عمل المجاهدين في سبيل الله تعالى فقال رسول الله صلى الله عليه وسلم \"من قعدت- أو كلمة نحوها- منكن في بيتها فإنها تدرك عمل المجاهدين في سبيل الله تعالى \"ثم قال لا نعلم. رواه عن ثابت إلا روح بن المسيب وهو رجل من أهل البصرة مشهور. وقال البزار أيضا حدثنا محمد بن المثنى حدثنا عمرو بن عاصم حدثنا همام عن قتادة عن مورق عن أبي الأحوص عن عبد الله رضي الله عنه عن النبي صلى الله عليه وسلم قال: \"إن المرأة عورة فإذا خرجت استشرفها الشيطان وأقرب ما تكون بروحة ربها وهي في قعر بيتها \"ورواه الترمذي عن بندار عن عمرو بن عاصم به نحوه. وروى البزار بإسناده المتقدم وأبو داود أيضا عن النبي صلى الله عليه وسلم قال: \"صلاة المرأة في مخدعها أفضل من صلاتها في بيتها وصلاتها في بيتها أفضل من صلاتها في حجرتها \"وهذا إسناد جيد وقوله تعالى: \"ولا تبرجن تبرج الجاهلية الأولى \"قال مجاهد كانت المرأة تخرج تمشي بين يدي الرجال فذلك تبرج الجاهلية. وقال قتادة \"ولا تبرجن تبرج الجاهلية الأولى \"يقول إذا خرجتن بن بيوتكن وكانت لهن مشية وتكسر وتغنج فنهى الله تعالى عن ذلك وقال مقاتل بن حيان \"ولا تبرجن تبرح الجاهلية الأولى \"والتبرج أنها تلقي الخمار على رأسها ولا تشده فيواري قلائدها وقرطها وعنقها ويبدو ذلك كله منها وذلك التبرج ثم عمت نساء المؤمنين في التبرج. وقال ابن جرير حدثني ابن زهير حدثنا موسى بن إسماعيل حدثنا داود يعني ابن أبي الفرات حدثنا علي بن أحمر عن عكرمة عن ابن عباس رضي الله عنهما قال تلا هذه الآية \"ولا تبرجن تبرج الجاهلية الأولى \"قال كانت فيما بين نوح وإدريس وكانت ألف سنة وإن بطنين من ولد آدم كان أحد يسكن السهل والآخر يسكن الجبل وكان رجال الجبل صباحا وفي النساء دمامة وكان نساء السهل صباحا وفي الرجال دمامة وإن إبليس لعنه الله أتى رجلا من أهل السهل في صورة غلام فآجر نفسه منه فكان يخدم فاتخذ إبليس شيئا من مثل الذي يزمر فيه الرعاء فجاء فيه بصوت لم يسمع الناس مثله فبلغ ذلك من حوله فانتابوهم يسمعون إليه واتخذوا عيدا يجتمعون إليه في السنة فيتبرج النساء للرجال قال ويتزبن الرجال لهن وإن رجلا من أهل الجبل هجم عليهم في عيدهم ذلك فرأى النساء وصباحتهن فأتى أصحابه فأخبرهم بذلك فتحولوا إليهن فنزلوا معهن وظهرت الفاحشة فيهن فهو قول الله تعالى \"ولا تبرجن تبرج الجاهلية الأولى \"وقوله تعالى: \"وأقمن الصلاة وآتين الزكاة وأطعن الله ورسوله \"نهاهن أولا عن الشر ثم أمرهن بالخير من إقامة الصلاة وهي عبادة الله وحده لا شريك له وإيتاء الزكاة وهي الإحسان إلى المخلوقين \"وأطعن الله ورسوله \"وهذا من باب عطف العام على الخاص. وقوله تعالى: \"إنما يريد الله ليذهب عنكم الرجس أهل البيت ويطهركم تطهيرا \"وهذا نص في دخول أزواج النبي صلى الله عليه وسلم في أهل البيت ههنا لأنهن سبب نزول هذه الآية وسبب النزول داخل فيه قولا واحدا إما وحده على قول أو مع غيره على الصحيح ورو ابن جرير عن عكرمة أنه كان ينادي في السوق \"إنا يريد الله ليذهب عنكم الرجس أهل البيت ويطهركم تطهيرا \"نزلت في نساء النبي صلى الله عليه وسلم خاصة وهكذا روى ابن أبي حاتم قال حدثنا علي بن حرب الموصلي حدثنا زيد بن الحباب حدثنا حسين بن واقد عن يزيد النحوي عن عكرمة عن ابن عباس رضي الله عنهما في قوله تعالى: \"إنما يريد الله ليذهب عنكم الرجس أهل البيت \"قال نزلت في نساء النبي صلى الله عليه وسلم خاصة وقال عكرمة من شاء باهلته إنها نزلت فى شأن نساء النبي صلى الله عليه وسلم فإن كان المراد أنهن كن سبب النزول دون غيرهن فصحيح وإن أريد أنهن المراد فقط دون غيرهن ففي هذا نظر فإنه قد وردت أحاديث تدل على أن المراد أعم من ذلك \" الحديث الأول \"حدثنا الإمام أحمد حدثنا عفان حدثنا حماد أخبرنا علي بن زيد عن أنس بن مالك رضي الله عنه قال: إن رسول الله صلى الله عليه وسلم كان يمر بباب فاطمة رضي الله عنه ستة أشهر إذا خرج إلى صلاة الفجر يقول \"الصلاة يا أهل البيت \"إنما يريد الله ليذهب عنكم الرجس أهل البيت ويطهركم تطهيرا \"\"ورواه الترمذي عن عبد بن حميد عن عفان به وقال حسن غريب \"حديث آخر\" قال ابن جرير حدثنا ابن وكيع حدثنا أبو نعيم حدثنا يونس عن أبي إسحاق أخبرني أبو داود عن أبي الحمراء قال: رابطت المدينة سبعة أشهر على عهد رسول الله صلى الله عليه وسلم قال رأيت رسول الله صلى الله عليه وسلم إذا طلع الفجر جاء إلى باب علي وفاطمة رضي الله عنهما فقال \"الصلاة الصلاة \"إنما يريد الله ليذهب عنكم الرجس أهل البيت ويطهركم تطهيرا \"\"أبو داود الأعمى هو نفيع بن الحارت كذاب \" حديث آخر \"وقال الإمام أيضا حدثنا محمد بن مصعب حدثنا الأوزاعي حدثنا شداد بن عمار قال دخلت على واثلة بن الأسقع رضي الله عنه وعنده قوم فذكروا عليا رضي الله عنه فشتموه فشتمته معهم فلما قاموا قال لي شتمت هذا الرجل؟ قلت قد شتموه فشتمته معهم ألا أخبرك بما رأيت من رسول الله صلى الله عليه وسلم؟ قلت بلى قال أتيت فاطمة رضي الله عنها أسالها عن علي رضي الله عنه فقال توجه إلى رسول الله صلى الله عليه وسلم فجلست أنتظره حتى جاء رسول الله صلى الله عليه وسلم ومعه علي وحسن وحسين رضي الله عنهم آخذ كل واحد منهما بيده حتى دخل فأدنى عليا وفاطمة رضي الله عنهما وأجلسهما بين يديه وأجلس حسنا وحسينا رضي الله عنه ما كل واحد منهما على فخذه ثم لف عليهم ثوبه أو قال كساءه ثم تلا صلى الله عليه وسلم هذه الآية \"إنما يريد الله ليذهب عنكم الرجس أهل البيت ويطهركم تطهيرا \"وقال \"اللهم هؤلاء أهل بيتي وأهل بيتي أحق \". وقد رواه أبو جعفر بن جرير عن عبد الكريم بن أبي عمير عن الوليد بن مسلم عن أبي عمرو الأوزاعي بسنده نحوه زاد في آخره قال واثلة رضي الله عنه فقلت وأنا يا رسول الله صلى الله عليك من أهلك؟ قال صلى الله عليه وسلم \"وأنت من أهلي \"قال واثلة رضي الله عنه وإنها من أرجى ما أرتجى ثم رواه أيضا عن عبد الأعلى بن واصل عن الفضل بن دكين عن عبد السلام بن حرب عن كلثوم المحاربي عن شداد بن أبي عمار قال إني لجالس عند واثلة بن الأسقع رضي الله عنه إذ ذكروا علي رضي الله عنه فشتموه فلما قاموا قال اجلس حتى أخبرك عن هذا الذي شتموه إني عند رسول الله صلى الله عليه وسلم إذ جاء علي وفاطمة وحسن وحسين رضي الله عنهم فألقى صلى الله عليه وسلم عليهم كساء له ثم قال \"اللهم هؤلاء أهل بيتي اللهم أذهب عنهم الرجس وطهرهم تطهيرا \"قلت يا رسول الله وأنا؟ قال صلى الله عليه وسلم \"وأنت \"قال فوالله إنها لأوثق عمل عندي. \" حديث آخر \"قال الإمام أحمد حدثنا عبد الله بن نمير حدثنا عبد الملك بن أبي سليمان عن عطاء بن أبي رباح حدثني من سمع أم سلمة رضي الله عنها تذكر أن النبي صلى الله عليه وسلم كان في بيتها فأتته فاطمة رضي الله عنها ببرمة فيها خزيرة فدخلت عليه بها فقال لها صلى الله عليه وسلم \"ادعي زوجك وابنيك \"قالت فجاء علي وحسن وحسين رضي الله عنهم فدخلوا عليه فجلسوا يأكلون من تلك الخزيرة وهو على منامة له وكان تحته صلى الله عليه وسلم كساء خيبري قالت وأنا في الحجرة أصلي فأنزل الله عز وجل هذه الآية \"إنما يريد الله ليذهب عنكم الرجس أهل البيت ويطهركم تطهيرا \"قالت رضي الله عنها فأخذ صلى الله عليه وسلم فضل الكساء فغطاهم به ثم أخرج يده فألوى بها إلى السماء ثم قال \"اللهم هؤلاء أهل بيتي وخاصتي فأذهب عنهم الرجس وطهرهم تطهيرا \"قالت فأدخلت رأسي البيت فقلت وأنا معكم يا رسول الله؟ فقال \"إنك إلى خير إنك إلى خير \"في إسناده من لم يسم وهو شيخ عطاء وبقية رجاله ثقات \" طريق أخرى \"قال ابن جرير حدثنا أبو كريب حدثنا مصعب بن المقدام حدثنا سعيد بن زربي عن محمد بن سيرين عن أبي هريرة عن أم سلمة رضي الله عنها قالت جاءت فاطمة رضي الله عنها إلى رسول الله ببرمة لها قد صنعت فيها عصيدة تحملها على طبق فوضعتها بين يديه صلى الله عليه وسلم فقال: \"أين ابن عمك وابناك؟ \"فقالت رضي الله عنها في البيت فقال صلى الله عليه وسلم \"ادعيهم \"فجاءت إلى علي رضي الله عنه فقالت أجب رسول الله صلى الله عليه وسلم أنت وابناك قالت أم سلمة رضي الله عنه تعالى عنها فلما رآهم مقبلين مد صلى الله عليه وسلم يده إلى كساء كان على المنامة فمده وبسطه وأجلسهم عليه ثم أخذ بأطراف الكساء الأربعة بشماله فضمه فوق رؤوسهم وأومأ بيده اليمنى إلى ربه فقال: اللهم هؤلاء أهل بيتي فأذهب عنهم الرجس وطهرهم تطهيرا طريق أخرى قال ابن جرير حدثنا ابن حميد حدثنا عبد الله بن عبد القدوس عن الأعمش عن حكيم بن سعد قال ذكرنا علي بن أبي طالب رضي الله عنه عند أم سلمة رضي الله عنها فقالت في بيتي نزلت \"إنما يريد الله ليذهب عنكم الرجس أهل البيت ويطهركم تطهيرا \"قالت أم سلمة جاء رسول الله صلى الله عليه وسلم إلى بيتي فقال: لا تأذني لأحد فجاءت فاطمة رضي الله عنها فلم أستطع أن أحجبها عن أبيها ثم جاء الحسن رضي الله عنه فلم أستطع أن أمنعه أن يدخل على جده وأمه وجاء الحسين فلم أستطع أن أحجبه عن جده صلى الله عليه وسلم وأمه رضي الله عنها ثم جاء علي رضي الله عنه فلم أستطع أن أحجبه فاجتمعوا فجللهم رسول الله صلى الله عليه وسلم بكساء كان عليه ثم قال هؤلاء أهل بيتي فأذهب عنهم الرجس وطهرهم تطهيرا فنزلت هذه الآية حين اجتمعوا على البساط قالت فقلت يا رسول الله وأنا؟ قالت فوالله ما أنعم وقال إنك إلى خير \"طريق أخرى\" قال الإمام أحمد حدثنا محمد بن جعفر حدثنا عوف عن أبي المعدل عن عطية الطفاوي عن أبيه قال إن أم سلمة رضي الله عنها حدثته قالت: بينما رسول الله صلى الله عليه وسلم في بيتي يوما إذ قالت الخادم إن فاطمة وعلي رضي الله عنهما بالسدة قالت فقال لي رسول الله صلى الله عليه وسلم قومي فتنحي عن أهل بيتي قالت فقمت فتنحيت في البيت قريبا فدخل على وفاطمة ومعهما الحسن والحسين رضي الله عنهم وهما صبيان صغيران فأخذ الصبيين فوضعهـا في حجره فقبلهما واعتنق عليا رضي الله عنه بإحدى يديه وفاطمة رضي الله عنها باليد الأخرى وقبل فاطمة وقبل علي وأغدق عليهم خميصة سوداء وقال اللهم إليك لا إلى النار أنا وأهل بيتي قالت فقلت وأنا يا رسول الله ؟ قال صلى الله عليه وسلم وأنت \"طريق أخرى\" قال ابن جرير حدثنا أبو كريب حدثنا الحسن بن عطية حدثنا فضيل بن مرزوق عن عطية عن أبي سعيد عن أم سلمة رضي الله عنها قالت إن هذه الآية نزلت في بيتي \"إنما يريد الله ليذهب عنكم الرجس أهل البيت ويطهركم تطهيرا \"قالت وأنا جالسة على باب البيت فقلت يا رسول الله ألست من أهل البيت؟ فقال إنك إلى خير أنت من أزوج النبي صلى الله عليه وسلم قالت وفي البيت رسول الله صلى الله عليه وسلم وعلي وفاطمة والحسن والحسين رضي الله عنهم \"طريق أخرى\" رواها ابن جرير أيضا عن أبي كريب عن وكيع عن عبد الحميد بن بهرام عن شهر بن حوشب عن أم سلمة رضي الله عنها بنحوه \"طريق أخرى\" قال ابن جرير حدثنا أبو كريب حدثنا خالد بن مخلد حدثني موسى بن يعقوب حدثني هاشم بن هاشم بن عتبة بن أبي وقاص عن عبد الله بن وهب بن زمعة قال أخبرتني أم سلمة رضي الله عنها قالت إن رسول الله صلى الله عليه وسلم جمع عليا وفاطمة والحسن والحسين رضي الله عنهم ثم أدخلهم تحت ثوبه ثم جأر إلى الله عز وجل ثم قال: هؤلاء أهل بيتي قالت أم سلمة رضي الله عنها فقلت يا رسول الله أدخلني معهم فقال أنت من أهلي \"طريق أخرى\" رواها ابن جرير أيضا على أحمد بن محمد الطوسي عن عبد الرحمن بن صالح عن محمد بن سليمان الأصبهاني عن يحيى بن عبيد المكي عن عطاء عن عمر بن أبي سلمة عن أمه رضي الله عنها بنحو ذلك \"حديث آخر\" قال ابن جرير حدثنا ابن وكيع حدثنا محمد بن بشر عن زكريا عن مصعب بن شيبة عن صفية بنت شيبة قالت: قالت عائشة رضي الله عنها ذات غداة وعليه مرط مرجل من شعر أسود فجاء الحسن رضي الله عنه فأدخله معه ثم جاء الحسين فأدخله معه ثم جاءت فاطمة رضي الله عنها فأدخلها معه ثم جاء علي رضي الله عنه فأدخله معه ثم قال \"إنما يريد الله ليذهب عنكم الرجس أهل البيت ويطهركم تطهيرا \"ورواه مسلم عن أبي بكر بن أبي شيبة عن محمد بن بشر به \" طريق أخرى \"قال ابن أبي حاتم حدثنا أبي حدثنا شريح بن يونس أبو الحارث حدثنا محمد بن يزيد عن العوام يعني ابن حوشب رضي الله عنه عن ابن عم له قال: دخلت مع أبي على عائشة رضي الله عنها فسألتها عن علي رضي الله عنه فقالت رضي الله عنها: تسألني عن رجل كان من أحب الناس إلى رسول الله صلى الله عليه وسلم وكانت تحته ابنته وأحب الناس إليه؟ لقد رأيت رسول الله صلى الله عليه وسلم دعا عليا وفاطمة وحسن وحسينا رضي الله عنهما فألقى عليهم ثوبا فقال: اللهم هؤلاء أهل بيتي فأذهب عنهم الرجس وطهرهم تطهيرا قالت فدنوت منهم فقلت يا رسول الله وأنا من أهل بيتك؟ فقال تنحي فإنك على خير \" حديث آخر\" قال ابن جرير حدثنا ابن المثنى حدثنا بكر بن يحيى بن أبان العنزي حدثنا مندل عن الأعمش عن عطية عن أبي سعيد رضي الله عنه قال قال رسول الله صلى الله عليه وسلم نزلت هذه الآية في خمسة: في وفي علي وحسن وحسين وفاطمة \"إنما يريد الله ليذهب عنكم الرجس أهل البيت ويطهركم تطهيرا \"قد تقدم أن فضيل بن مرزوق رواه عن عطية عن أبي سعيد عن أم سلمة رضي الله عنها كما تقدم وروى ابن أبي حاتم من حديث هارون بن سعد العجلي عن عطية عن أبي سعيد رضي الله عنه موقوفا والله سبحانه وتعالى أعلم \"حديث آخر\" قال ابن جرير حدثنا ابن المثنى حدثنا أبو بكر الحنفي حدثنا بكير بن مسمار قال سمعت عامر بن سعد رضي الله عنه قال: قال سعد رضي الله عنه قال رسول الله صلى الله عليه وسلم حين نزل عليه الوحي فأخذ علي وأبيه وفاطمة رضي الله عنهم فأدخلهم تحت ثوبه ثم قال رب هؤلاء أهلي وأهل بيتي \"حديث آخر\" وقال مسلم في صحيحه حدثني زهير بن حرب وشجاع بن مخلد عن ابن عليه قال زهير حدثنا إسماعيل بن إبراهيم حدثني أبو حيان حدثني يزيد بن حبان قال انطلقت أنا وحصين بن سرة وعمر بن مسلمة إلى زيد بن أرقم رضي الله عنه فلما جلسنا إليه قال له حصين لقد لقيت يا زيد خيرا كثيرا رأيت رسول الله صلى الله عليه وسلم وسمعت حديثه وغزوت معه وصليت خلفه لقد لقيت يا زيد خيرا كثيرا حدثنا يا زيد ما سمعت من رسول الله صلى الله عليه وسلم ؟ قال يا ابن أخي والله لقد كبرت سني وقدم عهدي ونسيت بعض الذي كنت أعي من رسول الله صلى الله عليه وسلم فما حدثتكم فاقبلوا وما لا فلا تكلفوا فيه ثم قال: قام فينا رسول الله صلى الله عليه وسلم يوما خطيبا بماء يدعى خما بين مكة والمدينة فحمد الله تعالى وأثنى عليه ووعظ وذكر ثم قال: أما بعد ألا أيها الناس فإنما أنا بشر يوشك أن يأتيني رسول ربي فأجيب وأنا تارك فيكم ثقلين أولهما كتاب الله تعالى فيه الهدى والنور فخذوا بكتاب الله واستمسكوا به فحث على كتاب الله عز وجل ورغب فيه ثم قال وأهل بيتي أذكركم الله في أهل بيتي أذكركم الله في أهل بيتي ثلاثا فقال له حصين ومن أهل بيته يا زيد؟ اليس نساؤه من أهل بيته؟ قال نساؤه من أهل بيته ولكن أهل بيته من حرم الصدقة بعده قال ومن هم؟ قال هم: آل علي وآل عقيل وآل جعفر وآل عباس رضي الله عنهما قال كل هؤلاء حرم الصدقة بعده؟ قال نعم ثم رواه عن محمد بن الريان عن حسان بن إبراهيم عن سعيد بن مسروق عن يزيد بن حبان عن زيد بن أرقم رضي الله عنه فذكر الحديث بنحو ما تقدم وفيه فقلت له من أهل بيته نساؤه؟ قال لا وايم الله إن المرأة تكون مع الرجل العصر من الدهر ثم يطلقها فترجع إلى أبيها وقومها أهل بيته أصله وعصبته الذين حرموا الصدقة بعده هكذا وقع في هذه الرواية والأولى أولى والأخذ بها أحرى وهذه الثانية تحتمل أنه أراد تفسير الأهل المذكورين في الحديث الذي رواه إنما المراد بهم آله الذين حرموا الصدقة أو أنه ليس المراد بالأهل الأزواج فقط بل هم مع آله وهذا الاحتمال أرجح جمعا بينها وبين الرواية التي قبلها وجمعا أيضا بين القرآن والأحاديث المتقدمة إن صحت فإن في بعض أسانيدها نظرا والله أعلم ثم الذي لا يشك فيه من تدبر القرآن أن نساء النبي صلى الله عليه وسلم داخلات في قوله تعالى: \"إنما يريد الله ليذهب عنكم الرجس أهل البيت ويطهركم تطهيرا \"."
    },
    {
      "ayah": 34,
      "surah": 33,
      "text": "فإن سياق الكلام معهن ولهذا قال تعالى بعد هذا كله \"واذكرنا ما يتلى في بيوتكن من آيات الله والحكمة \"أي واعملن بما ينزل الله تبارك وتعالى على رسوله صلى الله عليه وسلم في بيوتكن من الكتاب والسنة قاله قتادة وغير واحد واذكرن هذه النعمة التي خصصتن بها من بين الناس أن الوحي ينزل في بيوتكن دون سائر الناس وعائشة الصديقة بنت الصديق رضي الله عنها أولاهن بهذه النعمة وأحظاهن بهذه الغنيمة وأخصهن من هذه الرحمة العميمة فإنه لم ينزل على رسول الله صلى الله عليه وسلم الوحي في فرائض امرأة سواها كما نعى على ذلك صلوات الله وسلامه عليه قال بعض العلماء رحمه الله لأنه لم يتزوج بكرا سواها ولم ينم معها رجل في فراشها سواه و رضي الله عنها فناسب أن تخصص بهذه المزية وأن تفرد بهذه المرتبة العلية ولكن إذا كان أزواجه من أهل بيته فقرابته أحق بهذه التسمية كما تقدم في الحديث وأهل بيتي أحق وهذا يشبه ما ثبت في صحيح مسلم أن رسول الله صلى الله عليه وسلم لما سئل عن المسجد الذي أسس على التقوى من أول يوم فقال: هو مسجدي هذا فهذا من هذا القبيل فإن الآية إنما نزلت في مسجد قباء كما ورد في الأحاديث الأخر ولكن إذا كان ذاك أسس على التقوى من أول يوم فمسجـد رسول الله صلى الله عليه وسلم أولى بتسميته بذلك والله أعلم وقد قال ابن أبي حاتم حدثنا أبي حدثنا أبو الوليد حدثنا أبو عوانة عن حصين بن عبد الرحمن عن ابن جميلة قال إن الحسن بن علي رضي الله عنها استخلف حين قتل علي رضي الله عنها قال: فبينما هو يصلي إذ وثب عليه رجل فطعنه بخنجره فزعم حصين أنه بلغه أن الذي طعنه رجل من بني أسد وحسن رضي الله عنه ساجد قال فيزعمون أن الطعنة وقعت في وركه فمرض منها أشهرا ثم برأ فقعد على المنبر فقال: يا أهل العراق اتقوا الله فينا فإنا أمراؤكم وضيفانكم ونحن أهل البيت الذي قال الله تعالى \"إنما يريد الله ليذهب عنكم الرجس أهل البيت ويطهركم تطهيرا \"قال فما زال يقولها حتى ما بقي أحد من أهل المسجد إلا وهو يحن بكاء وقال السدي عن أبي الديلم قال: قال علي بن الحسين رضي الله عنهما لرجل من أهل الشام أما قرأت في الأحزاب \"إنما يريد الله ليذهب عنكم الرجس أهل البيت ويطهركم تطهيرا \"قال نعم ولأنتم هم؟ قال نعم وقوله تعالى: \"إن الله كان لطيفا خبيرا \"أي بلطفه بكن بلغتن هذه المنزلة وبخبرته بكن وأنكن أهل لذلك أعطاكن ذلك وخصكن بذلك قال ابن جرير رحمه الله واذكروا نعمة الله عليكن بأن جعلكن في بيوت تتلى فيها آيات الله والحكمة فاشكرن الله على ذلك واحمدنه \"إن الله كان لطيفا خبيرا \"أي ذا لطف بكن إذ جعلكن في البيوت التي تتلى فيها آيات الله والحكمة وهي السنة خبيرا بكن إذ اختاركن لرسوله أزواجا وقال قتادة \"واذكرن ما يتلى في بيوتكن من آيات الله والحكمة \"قال يمتن عليهن بذلك رواه ابن جرير وقال عطية العوفي في قوله تعالى \"إن الله كان لطيفا خبيرا \"يعني لطيفا باستخراجها خبيرا بموضعها ورواه ابن أبي حاتم ثم قال وكذا روى الربيع بن أنس عن قتادة."
    },
    {
      "ayah": 35,
      "surah": 33,
      "text": "قال الإمام أحمد حدثنا عفان حدثنا عبد الواحد بن زياد حدثنا عمان بن حكيم حدثنا عبد الرحمن بن شيبة قال سمعت أم سلمة رضي الله عنها زوج النبي صلى الله عليه وسلم تقول قلت للنبي صلى الله عليه وسلم ما لنا لا نذكر في القرآن كما يذكر الرجال؟ قالت فلم ير عني منه ذات يوم إلا ونداؤه على المنبر قالت وأنا أسرح شعري فلففت شعري ثم خرجت إلى حجرتي حجرة بيتي فجعلت سمعي عند الجريد فإذا هو يقول عند المنبر يا أيها الناس إن الله تعالى يقول \"إن المسلمين والمسلمات والمؤمنين والمؤمنات \"إلى آخر الآية وهكذا رواه النسائي وابن جرير من حديث عبد الواحد بن زياد به مثله طريق أخرى عنها قال النسائي أيضا حدثنا محمد بن حاتم حدثنا يزيد أخبرنا عبد الله بن شريك عن محمد بن عمرو عن أبي سلمة عن أم سلمة رضي الله عنها أنها قالت للنبي صلى الله عليه وسلم يا نبي الله مالي أسمع الرجال يذكرون في القرآن والنساء لا يذكرون ؟ فأنزل الله تعالى \"إن المسلمين والمسلمات والمؤمنين والمؤمنات \"وقد رواه ابن جرير عن أبي كريب عن أبي معاوية عن محمد بن عمرو عن أبي سلمة أن يحيى بن عبدالرحمن بن حاطب حدثه عن أم سلمة رضي الله عنها قالت: قلت يا رسول الله أيذكر الرجال في كل شيء ولا نذكر؟ فأنزل الله تعالى \"إن المسلمين والمسلمات \"الآية \" طريق أخرى \"قال سفيان الثوري عن ابن أبي نجيح عن مجاهد قال: قالت أم سلمة رضي الله عنها يا رسول الله يذكر الرجال ولا نذكر فأنزل الله تعالى \"إن المسلمين والمسلمات \"الآية حديث آخر قال ابن جرير حدثنا أبو كريب قال حدثنا سنان بن مظاهر العمري حدثنا أبو كدينة يحيى بن المهلب عن قابوس بن أبي ظبيان عن أبيه عن ابن عباس قال: قال النساء للنبي ما له يذكر المؤمنين ولا يذكر المؤمنات فأنزل الله تعالى \"إن المسلمين والمسلمات \"الآية وحدثنا بشر حدثنا زيد حدثنا سعيد عن قتادة قال دخل نساء على نساء النبي فقلن قد ذكركن الله تعالى في القرآن ولم نذكر بشيء أما فينا ما يذكر؟ فأنزل الله تعالى \"إن المسلمين والمسلمات \"الآية فقوله تعالى \"إن المسلمين والمسلمات والمؤمنين والمومنات \"دليل على أن الإيمان غير الإسلام وهو أخص منه لقوله تعالى \"قالت الأعراب آمنا قل لم تؤمنوا ولكن قولوا أسلمنا ولما يدخل الإيمان في قلوبكم \"وفي الصحيحين لا يزني الزاني حين يزني وهو مؤمن فسلبه الإيمان ولا يلزم من ذلك كفره بإجماع المسلمين فدل على أنه أخص منه كما قررناه في أول شرح البخاري وقوله تعالى \"والقانئين والقانتات \"القنوت هو الطاعة في سكون \"أمن هو قانت آناء الليل ساجدا وقائما يحذر الآخرة ويرجو رحمة ربه \"وقال تعالى \"وله من في السموات والأرضي كل له قانئون \"\"يا مريم اقنتي لربك واسجدي واركعي مع الراكعين \"\"وقوموا لله قانتين \"فالإسلام بعده مرتبة يرتقي إليها وهو الإيمان ثم القنوت ناشئ عنهما \"والصادقين والصادقات \"هذا في الأقوال فإن الصدق خصلة محمودة ولهذا كان بعض الصحابة رضي الله عنه تجرب عليه كذبة لا في الجاهلية ولا في الإسلام وهو علامة على الإيمان كما أن الكذب أمارة على النفاق ومن صدق نجا عليكم بالصدق فإن الصدق يهدي إلى البر وإن البر يهدي إلى الجنة وإياكم والكذب فإن الكذب يهدى إلى الفجور وإن الفجور يهدي إلى النار ولا يزال الرجل يصدق ويتحرى الصدق حتى يكتب عند الله صديقا ولا يزال الرجل يكذب ويتحرى الكذب حتى يكتب عند الله كذابا والأحاديث فيه كثيرة جدا \"والصابرين والصابرات \"هذه سجية الأثبات وهي الصبر على المصائب والعلم بأن المقدر كائن لا محاله وتلقي ذلك بالصبر والثبات وإنما الصبر عند الصدمة الأولى أي أصعبه في أول وهلة ثم ما بعده أسهل منه وهو صدق السجية وثباتها \"والخاشعين والخاشعات \" الخشوع السكون والطمأنينة والتؤدة والوقار والتواضع والحامل عليه الخوف من الله تعالى ومراقبته كما في الحديث اعبد الله كأنك تراه فإن لم تكن تراه فإنه يراك \"والمتصدقين والمتصدقات \"الصدقة هي الإحسان إلى الناس المحاويج الضعفاء الذين لا كسب لهم ولا كاسب يعطون من فضول الأموال طاعة وإحسانا إلى خلقه وقد ثبت فى الصحيحين سبعة يظلهم الله في ظله يوم لا ظل إلا ظله فذكر منهم رجل تصدق بصدقه فأخفاها حتى لا تعلم شماله ما تنفق يمينه وفي الحديث الآخر والصدقة تطفئ الخطيئة كما يطفئ الماء النار والأحاديث في الحث عليها كثيرة جدا له موضع بذاته \"والصائمين والصائمات \"وفي الحديث الذي رواه ابن ماجه والصوم زكاة البدن أي يزكيه ويطهره وينقيه من الأخلاط الرديئة طبعا وشرعا كما قال سعيد بن جبير من صام رمضان وثلاثه أيام من كل شهر دخل في قوله تعالى \"والصائمين والصائمات \"ولما كان الصوم من أكبر العون على كسر الشهوة كما قال رسول الله صلى الله عليه وسلم يا معشر الشباب من استطاع منكم الباءة فليتزوج فإنه أغض للبصر وأحصن للفرج ومن لم يستطع فعليه بالصوم فإنه له وجاء ناسب أن يذكر بعده \"والحافظين فروجهم والحافظات \"أي عن المحارم والمأثم إلا عن المباح كما قال عز وجل \"والذين هم لفروجهم حافظون إلا على أزواجهم أو ما ملكت أيمانهم فإنهم غير ملومين فمن ابتغى وراء ذلك فأولئك هم العادون \"وقوله تعالى \"والذاكرين الله كثيرا والذاكرات \"قال ابن أبي حاتم حدثنا أبي حدثنا هشام: بن عبيد الله حدثنا محمد بن جابر عن علي بن الأقمر عن الأغر أبي مسلم عن أبي سعيد الخدري رضي الله عنه قال: إن رسول الله صلى الله عليه وسلم قال إذا أيقظ الرجل امرأته من الليل فصليا ركعتين كانا تلك الليلة من الذاكرين الله كثيرا والذاكرات وقد رواه أبو داود والنسائي وابن ماجه من حديث الأعمش عن الأعرابي مسلم عن أبي سعيد وأبي هريرة رضي الله عنها عن النبي صلى الله عليه وسلم بمثله وقال الإمام أحمد حدثنا حسن حدثنا ابن لهيعة حدثنا دراج عن أبي الهيثم عن أبي سعيد الخدري رضي الله عنه قال: قلت يا رسول الله أي العباد أفضل درجة عند الله تعالى يوم القيامة؟ قال الذاكرون الله كثيرا والذاكرات قال قلت يا رسول الله ومن الغازي فى سبيل الله تعالى؟ قال لو ضرب بسيفه في الكفار والمشركين حتى ينكسر ويختضب دما لكان الذاكرون الله تعالى أفضل منه وقال الإمام أحمد حدثنا عفان حدثنا عبد الرحمن بن إبراهيم عن العلاء عن أبيه عن أبي هريرة رضي الله عنه قال: كان رسول الله صلى الله عليه وسلم يسير في طريق مكة فأتى على جمدان فقال هذا حمدان سيروا فقد سبق المفردون قالوا وما المفردون؟ قال صلى الله عليه وسلم الذاكرون الله كثيرا والذاكرات ثم قال صلى الله عليه وسلم اللهم اغفر للمحلقين قالوا والمقصرين قال اللهم اغفر للمحلقين قالوا والمقصرين قال والمقصرين تفرد به من هذا الوجه ورواه مسلم دون آخره وقال الإمام أحمد حدثنا حجين بن المثني حدثنا عبد العزيز بن أبي سلمة عن زياد بن أبي زياد مولى عبد الله بن عياش بن أبي ربيعة قال: إنه بلغني عن معاذ بن جبل رضي الله عنه أنه قال: قال رسول الله صلى الله عليه وسلم ما عمل آدمي عملا قط أنجى له من عذاب الله تعالى من ذكر الله عز وجل وقال معاذ رضي الله عنه قال رسول الله صلى الله عليه وسلم ألا أخبركم بخير أعمالكم وأزكاها عند مليككم وأرفعها في درجاتكم وخير لكم من تعاطي الذهب والفضة ومن أن تلقوا عدوكم غدا فتضربوا أعناقهم ويضربوا أعناقكم؟ قالوا بلى يا رسول الله قال ذكر الله عز وجل وقال الإمام أحمد حدثنا حسن حدثنا ابن لهيعة حدثنا زبان بن فايد عن سهل بن معاذ بن أنس الجهني عن أبيه رضي الله عنه عن رسول الله صلى الله عليه وسلم قال إن رجلا سأله فقال أي المجاهدين أعظم أجرا يا رسول الله؟ قال أكثرهم لله تعالى ذكرا قال فأي الصائمين أكثر أجرا؟ قال صلى الله عليه وسلم أكثرهم لله عز وجل ذكرا ثم ذكر الصلاة والزكاة والحج والصدقة كل ذلك يقول رسول الله صلى الله عليه وسلم أكثرهم لله ذكرا فقال أبو بكر لعمر رضي الله عنه ذهب الذاكرون بكل خير فقال رسول الله صلى الله عليه وسلم وسنذكر إن شاء الله تعالى بقية الأحاديث الواردة في كثرة الذكر عند قوله تعالى في هذه السورة \"يا أيها الذين آمنوا اذكروا الله ذكرا كثيرا وسبحوه بكرة وأصيلا \"الآية إن شاء الله تعالى وقوله تعالى \"أعد الله لهم مغفرة وأجرا عظيما \"خبر عن هؤلاء المذكورين كلهم أي أن الله تعالى قد أعد لهم أي هيأ لهم مغفرة منه لذنوبهم وأجرا عظيما وهو الجنة."
    },
    {
      "ayah": 36,
      "surah": 33,
      "text": "قال العوفي عن آبن عباس رضي الله عنهما قوله تعالى \"وما كان لمؤمن ولا مؤمنة \"الآية وذلك أن رسول الله صلى الله عليه وسلم انطلق ليخطب على فتاه زيد بن حارثه رضي الله عنه فدخل على زينب بنت جحش الأسدية رضي الله عنها فخطبها فقالت لست بناكحته فقال رسول الله صلى الله عليه وسلم بلى فانكحيه قالت يا رسول الله أؤمر في نفسي؟ فبينما هما يتحدثان أنزل الله هذه الآية على رسول الله صلى الله عليه وسلم \"وما كان لمؤمن ولا مؤمنة إذا قضى الله ورسوله \"الآية قالت قد رضيته لي يا رسول الله منكحا قال رسول الله صلى الله عليه وسلم نعم قالت إذا لا أعصي رسول الله صلى الله عليه وسلم قد أنكحته نفسي وقال ابن لهيعة عن أبي عمرة عن عكرمة عن ابن عباس رضي الله عنهما قال خطب رسول الله صلى الله عليه وسلم زينب بنت جحش لزيد بن حارثه رضي الله عنه فاستنكفت منه وقالت أنا خير منه حسبا وكانت امرأة فيها حدة فأنزل الله تعالى \"وما كان لمؤمن ولا مؤمنة \"الآية كلها وهكذا قال مجاهد وقتادة ومقاتل ابن حيان أنها نزلت في زينب بنت جحش رضي الله عنها حين خطبها رسول الله صلى الله عليه وسلم على مولاه زيد بن حارثة رضي الله عنه امتنعت ثم أجابت وقال عبد الرحمن بن زيد بن أسلم نزلت في أم كلثوم بنت عقبة بن أبي معيط رضي الله عنها وكانت أول من هاجر من النساء يعني بعد صلح الحديبية فوهبت نفسها للنبي صلى الله عليه وسلم فقال قد قبلت فزوجها زيد بن حارثة رضي الله عنه يعني والله أعلم بعد فراقه زينب فسخطت هي وأخوها وقال إنما أردنا رسول الله صلى الله عليه وسلم فزوجنا عبده قال فنزل القرآن \"وما كان لمؤمن ولا مؤمنة إذا قضى الله ورسوله أمرأ \"إلى آخر الآية قال أمر أجمع من هذا \"النبي أولى بالمؤمنين من أنفسهم \"قال فذاك خاص وهذا أجمع وقال الإمام أحمد حدثنا عبد الرزاق أخبرنا معمر عن ثابت البناني عن أنس رضي الله عنه قال خطب النبي صلى الله عليه وسلم على جليبب امرأة من الأنصار إلى أبيها فقال حتى استأمر أمها فقال النبي صلى الله عليه وسلم فنعم إذا قال فانطلق الرجل إلى امرأته فذكر ذلك لها فقالت لاها الله إذن ما وجد رسول الله صلى الله عليه وسلم إلا جليبيبا وقد منعناها من فلان وفلان قال والجارية في سترها تسمع قال فانطلق الرجل يريد أن يخبر رسول الله بذلك فقالت الجارية أتريدون أن تردوا على رسول الله صلى الله عليه وسلم أمره إن كان قد رضيه لكم فأنكحوه قال فكأنها جلت عن أبويها وقالا صدقت فذهب أبوها إلى رسول الله صلى الله عليه وسلم فقال إن كنت رضيته فقد رضيناه قال صلى الله عليه وسلم فإني قد رضيته قال فزوجها ثم فزع أهل المدينة فركب جليب فوجدوه قد قتل وحوله ناس من المشركين قد قتلهم قال أنس رضي الله عنه فلقد رأيتها وإنها لمن أنفق بيت بالمدينة وقال الإمام أحمد حدثنا عفان حدثنا حماد يعني ابن سلمة عن ثابت عن كنانة بن نعيم العدوي عن أبى برزة الأسلمي قال إن جليبيبا كان امرءا يدخل على النساء يمر بهن ويلاعبهن فقلت لامرأتي لا تدخلن عليكن جليبيبا فإنه إن دخل عليكن لأفعلن ولأفعلن قالت وكانت الأنصار إذا كان لأحدهم أيم لم يزوجها حتى يعلم هل للنبي صلى الله عليه وسلم فيها حاج أم لا فقال النبي صلى الله عليه وسلم لرجل من الأنصار زوجني ابنتك قال نعم وكرامة يا رسول الله ونعمة عين فقال إني لست أريدها لنفسي قال فلمن يا رسول الله؟ قال لجليبيب فقال يا رسول الله أشاور أمها فأتى أمها فقال رسول الله صلى الله عليه وسلم يخطب ابنتك فقالت نعم ونعمة عين فقال إنه ليس يخطبها لنفسه إنما يخطبها لجليبيب فقالت أجليبيب ابنه أجليبيب ابنه؟ ألا لعمر الله لا نزوجه فلما أراد أن يقوم ليأخذ رسول الله صلى الله عليه وسلم فيخبره بما قالت أمها قالت الجارية من خطبني إليكم؟ فأخبرها أمها قالت أتردون على رسول الله صلى الله عليه وسلم أمره؟ ادفعوني إليه فإنه لن يضيعني فانطلق أبوها إلى رسول الله صلى الله عليه وسلم فقال شأنك بها فزوجها جليبيبا قال فخرج رسول الله صلى الله عليه وسلم في غزوة له فلما أفاء الله عليه قال لأصحابه رضي الله عنهم هل تفقدون من أحد؟ قالوا نفقد فلانا ونفقد فلانا قال صلى الله عليه وسلم انظروا هل تفقدون من أحد قالوا لا قال لكنني أفقد جليبيبا قال صلى الله عليه وسلم فاطلبوه في القتلى فطلبوه فوجدوه إلى جنب سبعة قد قتلهم ثم قتلوه فقالوا يا رسول الله ها هو ذا إلى جنب سبعه قد قتلهم ثم قتلوه فأتاه رسول الله صلى الله عليه وسلم فقام عليه فقال قتل سبعة وقتلوه هذا منى وأنا منه مرتين أو ثلاثا ثم وضعه رسول الله صلى الله عليه وسلم على ساعده وحفر له ماله سرير إلا ساعد النبي صلى الله عليه وسلم ثم وضعه في قره ولم يذكر أنه غسله رضي الله عنه قال ثابت رضي الله عنه فما كان في الأنصار أيم أنفق منها وحدث إسحاق بن عبد الله بن أبي طلحة ثابت هل تعلم ما دعا لها رسول الله صلى الله عليه وسلم فقال: قال اللهم صب عليها صبا ولا تجعل عيشها كدا وكذا كان فما كان في الأنصار أيم أنفق منها هكذا أورده الإمام أحمد بطوله وأخرج منه مسلم والنسائي في الفضائل قصة قتله وذكر الحافظ أبو عمر بن عبد البر الاستيعاب أن الجارية لما قالت في خدرها أتردون على رسول الله صلى الله عليه وسلم أمره؟ نزلت هذه الآية \"وما كان لمؤمن ولا مؤمنة إذا قضى الله ورسوله أمرا أن يكون لهم الخيرة من أمرهم \"وقال ابن جريج أخبرني عامر بن مصعب عن طاوس قال إنه سأل ابن عباس عن ركعتين بعد العصر فنهاه وقرأ ابن عباس رضي الله عنه \"وما كان لمؤمن ولا مؤمنة إذا قضى الله ورسوله أمرا أن يكون لهم الخيرة من أمرهم \"فهذه الآية عامة في جميع الأمور وذلك أنه إذا حكم الله ورسوله بشيء فليس لأحد مخالفته ولا اختيار لأحد ههنا ولا رأي ولا قول كما قال تبارك وتعالى \"فلا وربك لا يؤمنون حتى يحكموك فيما شجر بينهم ثم لا يجدوا في أنفسهم حرجا مما قضيت ويسلموا تسليما \"وفي الحديث والذي نفسي بيده لا يؤمن أحدكم حتى يكون هواه تبعا لما جئت به ولهذا شدد في خلاف ذلك فقال \"ومن يعص الله ورسوله فقد ضل ضلالا مبينا \"كقوله تعالى \"فليحذر الذين يخالفون عن أمره أن تصيبهم فتنة أو يصيبهم عذاب أليم \"."
    },
    {
      "ayah": 37,
      "surah": 33,
      "text": "يقول تعالى مخبرا عن نبيه قال لمولاه زيد بن حارثة رضي الله عنه وهو الذي أنعم الله عليه أي بالإسلام ومتابعة الرسول \"وأنعمت عليه \"أي بالعتق من الرق وكان سيدا كبير الشأن جليل القدر حبيبا إلى النبي صلى الله عليه وسلم يقال له الحب ويقال لابنه أسامة الحب ابن الحب قالت عائشة رضي الله عنها ما بعثه رسول الله صلى الله عليه وسلم في سرية إلا أمره عليهم ولو عاش بعده لاستخلفه رواه الإمام أحمد عن سعيد بن محمد الوراق ومحمد بن عبيد عن وائل بن داود عن عبد الله البهي عنها وقال البزار حدثنا خالد بن يوسف حدثنا أبو عوانه ح وحدثنا محمد بن معمر حدثنا أبو داود حدثنا أبو عوانه أخبرني عمر بن أبي سلمة عن أبيه قال حدثني أسامه بن زيد رضي الله عنهما قال: كنت في المسجد فأتاني العباس وعلي بن أبي طالب رضي الله عنهما فقالا يا أسامة استأذن لنا على رسول الله صلى الله عليه وسلم قال فأتيت رسول الله فأخبرته فقلت علي والعباس يستأذنان فقال صلى الله عليه وسلم أتدري ما حاجتهما؟ قلت لا يا رسول الله قال صلى الله عليه وسلم لكني أدري قال فأذن لهما قالا يا رسول الله جئناك لتخبرنا أي أهلك أحب إليك؟ قال صلى الله عليه وسلم أحب أهلي إلي فاطمة بنت محمد قالا يا رسول الله ما نسألك عن فاطمة قال صلى الله عليه وسلم فأسامة بن زيد بن حارثه الذي أنعم الله عليه وأنعمت عليه وكان رسول الله صلى الله عليه وسلم قد زوجه بابنة عمته زينب بنت جحش الأسدية رضي الله عنها وأمها أميمة بنت عبد المطلب وأصدقها عشرة دنانير وستين درهما وخمارا وملحفة ودرعا وخمسين مدا من طعام وعشرة أمداد من تمر قاله مقاتل بن حيان فمكثت عنده قريبا من سنة أو فوقها ثم وقع بينهما فجاء زيد يشكوها إلى رسول الله صلى الله عليه وسلم فجعل رسول الله يقول له أمسك عليك زوجك واتق الله قال الله تعالى \"وتخفي في نفسك ما الله مبديه وتخشى الناس والله أحق أن تخشاه \"ذكر ابن أبي حاتم وابن جرير ههنا آثارا عن بعض السلف رضي الله عنهم أحببنا أن نضرب عنها صفحا لعدم صحتها فلا نوردها وقد روى الإمام أحمد ههنا أيضا حديث من رواية حماد بن زيد عن ثابت عن أنس رضي الله عنه فيه غرابة تركنا سياقه أيضا وقد روى البخاري أيضا بعضه مختصرا فقال: حدثنا محمد بن عبد الرحيم حدثنا يعلى بن منصور عن حماد بن زيد حدثنا ثابت عن أنس بن مالك رضي الله عنه قال إن هذه الآية \"وتخفي في نفسك ما الله مبديه \"نزلت في شأن زينب بنت جحش وزيد بن حارثه رضي الله عنهما وقال ابن أبي حاتم حدثنا أبي حدثنا علي بن حاتم بن مرزوق حدثنا ابن عيينة عن علي بن زيد بن جدعان قال سألني علي بن الحسين رضي الله عنهما ما يقول الحسن في قوله تعالى \"وتخفي في نفسك ما الله مبديه \"فذكرت له فقال لا ولكن الله تعالى أعلم نبيه أنها ستكون من أزواجه قبل أن يتزوجها فلما أتاه زيد رضي الله عنه ليشكوها إليه قال اتق الله وأمسك عليك زوجك فقال قد أخبرتك أني مزوجكها وتخفي في نفسك ما الله مبديه وهكذا روي عن السدي أنه قال نحو ذلك وقال ابن جرير حدثني إسحاق بن شاهين حدثني خالد عن داود عن عامر عن عائشة رضي الله عنها أنها قالت: لو كتم محمد شيئا مما أوحي إليه من كتاب الله تعالى لكتم \"وتخفي في نفسك ما الله مبديه وتخشى الناس والله أحق أن تخشاه \"وقوله تعالى \"فلما قضى زيد منها وطرا زوجناكها \"الوطر هو الحاجة والأرب أي لما فرغ منها وفارقها زوجناكها وكان الذي ولي تزويجها منه هو الله عز وجل بمعنى أنه أوحى أن يدخل عليها بلا ولي ولا عقد ولا مهر ولا شهود من البشر قال الإمام أحمد حدثنا هاشم يعني ابن القاسم أخبرنا النضر حدثنا سليمان بن المغيرة عن ثابت عن أنس رضي الله عنه قال لما انقضت عدة زينب رضي الله عنها قال رسول الله صلى الله عليه وسلم لزيد بن حارثة اذهب فاذكرها علي فانطلق حتى أتاها وهي تخمر عجينها قال فلما رأيتها عظمت في صدري حتى ما أستطيع أن أنظر إليها وأقول إن رسول الله صلى الله عليه وسلم ذكرها فوليتها ظهري ونكصت على عقبي وقلت يا زينب أبشري أرسلني رسول الله يذكرك قالت ما أنا بصانعة شيئا حتى أؤامر ربي عز وجل فقامت إلى مسجدها ونزل القرآن وجاء رسول الله فدخل عليها بغير إذن ولقد رأيتنا حين دخلت على رسول الله صلى الله عليه وسلم وأطعمنا عليها الخبز واللحم فخرج الناس وبقي رجال يتحدثون في البيت بعد الطعام فخرج رسول الله واتبعته فجعل يتتبع حجر نسائه يسلم عليهن ويقلن يا رسول الله كيف وجدت أهلك؟ فما أدري أنا أخبرته أن القوم قد خرجوا أو أخبر فانطلق حتى دخل البيت فذهبت أدخل معه فألقي الستر بيني وبينه ونزل الحجاب ووعظ القوم بما وعظوا به \"لا تدخلوا بيوت النبي إلا أن يؤذن لكم \"الآية كلها ورواه مسلم والنسائي من طرق عن سليمان ابن المغيرة به وقد روى البخاري رحمه الله عن أنس بن مالك رضي الله عنه قال إن زينب بنت جحش رضي الله عنها كانت تفخر على أزواج النبي صلى الله عليه وسلم فتقول زوجكن أهاليكن وزوجني الله تعالى من فوق سبع سموات وقد قدمنا في سورة النور عن محمد بن عبد الله بن جحش قال تفاخرت زينب وعائشة رضي الله عنهما فقالت زينب رضي الله عنها أنا التي نزل تزويجي من السماء وقالت عائشة رضي الله تعالى عنها أنا التي نزل عزري من السماء فاعترفت لها زينب رضي الله عنها وقال ابن جرير حدثنا ابن حميد حدثنا جرير عن المغيرة عن الشعبي قال: كانت زينب رضي الله عنها تقول للنبي صلى الله عليه وسلم إني لأدلي عليك بثلاث ما من نسائك امرأة تدلي بهن: إن جدي وجدك واحد وإني أنكحنيك الله عز وجل من السماء وإن السفير جبريل عليه السلام وقوله تعالى \"لكي لا يكون على المؤمنين حرج في أزواج أدعيائهم إذا قضوا منهن وطرا \"أي إنما أبحنا لك تزويجها وفعلنا ذلك لئلا يبقى حرج على المؤمنين في تزويج مطلقات الأدعياء وذلك أن رسول الله صلى الله عليه وسلم كان قبل النبوة قد تبنى زيد بن حارثة رضي الله عنه فكان يقال زيد بن محمد فلما قطع الله تعالى هذه النسبة بقوله تعالى \"وما جعل أدعياءكم أبناءكم \"إلى قوله تعالى \"ادعوهم لآبائهم هو أقسط عند الله \"ثم زاد ذلك بيانا وتأكيدا بوقوع تزويج رسول الله صلى الله عليه وسلم زينب بنت جحش رضي الله عنها لما طلقها زيد بن حارثة رضي الله عنه ولهذا قال تعالى في آية التحريم \"وحلائل أبنائكم الذين من أصلابكم \"ليحترز من الابن الدعي فإن ذلك كان كثيرا فيهم وقوله تعالى \"وكان أمر الله مفعولا \"أي وكان هذا الأمر الذي وقع قد قدره الله تعالى وحتمه وهو كائن لا محالة كانت زينب رضي الله عنها في علم الله ستصير من أزواج النبي صلى الله عليه وسلم."
    },
    {
      "ayah": 38,
      "surah": 33,
      "text": "يقول تعالى \"ما كان على النبي من حرج فيما فرض الله له \"أي فيما أحل له وأمره به من تزويج زينب رضي الله عنها التي طلقها دعيه زيد بن حارثة رضي الله عنه وقوله تعالى \"سنة الله في الذين خلوا من قبل \"أي هذا حكم الله تعالى في الأنبياء قبله لم يكن ليأمرهم بشيء وعليهم في ذلك حرج وهذا رد على من توهم من المنافقين نقصا في تزويجه امرأة زيد مولاه ودعيه الذي كان قد تبناه \"وكان أمر الله قدرا مقدورا \"أي وكان أمره الذي يقدره كائنا لا محالة وواقعا لا محيد عنه ولا معدل فما شاء كان وما لم يشأ لم يكن."
    },
    {
      "ayah": 39,
      "surah": 33,
      "text": "يمدح تبارك وتعالى \"الذين يبلغون رسالات الله \"أي إلى خلقه ويؤدونها بأماناتها \"ويخشونه \"أي يخافونه ولا يخافون أحدا سواه فلا تمنعهم سطوة أحد عن إبلاغ رسالات الله تعالى \"وكفى بالله حسيبا \"أي وكفى بالله ناصرا ومعينا وسيد الناس في هذا المقام: بلى وفي كل مقام محمد رسول الله صلى الله عليه وسلم فإنه قام بأداء الرسالة وإبلاغها إلى أهل المشارق والمغارب إلى جميع أنواع بني آدم وأظهر الله تعالى كلمته ودينه وشرعه على جميع الأديان والشرائع فإنه قد كان النبي قبله إنما يبعث إلى قومه خاصة وأما هو فإنه بعث إلى جميع الخلق عربهم وعجمهم \"قل يا أيها الناس إني رسول الله إليكم جميعا \"ثم ورث مقام البلاغ عنه أمته من بعده فكان أعلى من قام بها بعده أصحابه رضي الله عنهم بلغوا عنه كما أمرهم به في جميع أقواله وأفعاله وأحواله في ليله ونهاره وحضره وسفره وسره وعلانيته فرضي الله عنهم وأرضاهم ثم ورثة كل خلف عن سلفهم إلى زماننا هذا فبنورهم يقتدي المهتدون وعلى منهجهم يسلك الموفقون فنسأل الله الكريم المنان أن يجعلنا من خلفهم قال الإمام أحمد حدثنا ابن نمير أخبرنا الأعمش عن عمرو بن مرة عن أبي البختري عن أبي سعيد الخدري رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم لا يحقرن أحدكم نفسه أن يرى أمر الله فيه مقال ثم لا يقوله فيقول الله ما يمنعك أن تقول منه فيقول رب خشيت الناس فيقول فأنا أحق أن يخشى ورواه أيضا عن عبد الرزاق عن الثوري عن زيد عن عمرو بن مرة ورواه ابن ماجه عن أبي كريب عن عبد الله بن نمير وأبي معاوية كلاهما عن الأعمش به."
    },
    {
      "ayah": 4,
      "surah": 33,
      "text": "يقول تعالى موطئا قبل المقصود المعنوي أمرا معروفا حسيا وهو أنه كما لا يكون للشخص الواحد قلبان في جوفه ولا تصير زوجته التي يظاهر منها بقوله أنت علي كظهر أمي أما له كذلك لا يصير الدعي ولدا للرجل إذا تبناه فدعاه ابنا له فقال \"ما جعل الله لرجل من قلبين في جوفه وما جعل أزواجكم اللائي تظاهرون منهن أمهاتكم\" كقوله عز وجل \"ما هن أمهاتهم إن أمهاتهم إلا اللائي ولدنهم\" الآية. وقوله تعالى: \"وما جعل أدعياءكم أبناءكم\" هذا هو المقصود بالنفي فإنها نزلت في شأن زيد بن حارثة رضي الله عنه \"مولى النبي صلى الله عليه وسلم كان الني صلى الله عليه وسلم قد تبناه قبل النبوة فكان يقال له زيد بن محمد فأراد الله تعالى أن يقطع هذا الإلحاق وهذه النسبة بقوله تعالى: \"وما جعل أدعياءكم أبناءكم\" كما قال تعالى في أثناء السورة \"ما كان محمد أبا أحد من رجالكم ولكن رسول الله وخاتم النبيين وكان الله بكل شيء عليما\" وقال ههنا \"ذلكم قولكم بأفواهكم\" يعني تبنيكم لهم قول لا يقتضي أن يكون ابنا حقيقيا فإنه مخلوق من صلب رجل آخر فما يمكن أن يكون له أبوان كما لا يمكن أن يكون للبشر الواحد قلبان \"والله يقول الحق وهو يهدي السبيل\" قال سعيد بن جبير \"يقول الحق\" أي العدل وقال قتادة \"وهو يهدي السبيل\" أي الصراط المستقيم وقد ذكر غير واحد أن هذه الآية نزلت في رجل من قريش كان يقال له ذو القلبين وأنه كان يزعم أن له قلبين كل منهما بعقل وافر فأنزل الله تعالى هذه الآية ردا عليه. هكذا روى العوفي عن ابن عباس وقاله مجاهد وعكرمة والحسن وقتادة واختاره ابن جرير. وقال الإمام أحمد حدثنا حسن حدثنا زهير عن قابوس يعني ابن أبي ظبيان قال إن أباه حدثه قال قلت لابن عباس: أرأيت قول الله تعالى: \"ما جعل الله لرجل من قلبين في جوفه\" ما عنى بذلك؟ قال قام رسول الله صلى الله عليه وسلم يوما يصلي فخطر خطرة فقال المنافقون الذين يصلون معه ألا ترون له قلبين قلبا معكم وقلبا معهم فأنزل الله تعالى: \"ما جعل الله لرجل من قلبين في جوفه \"وهكذا رواه الترمذي عن عبد الله بن عبد الرحمن الدارمي عن صاعد الحراني عن عبد بن حميد وعن أحمد بن يونس كلاهما عن زهير وهو ابن معاوية به ثم قال وهذا حديث حسن وكذا رواه ابن جرير وابن أبي حاتم من حديث زهير به. وقال عبد الرزاق أخبرنا معمر عن الزهري في قوله \"ما جعل الله لرجل من قلبين في جوفه\" قال بلغنا أن ذلك كان في زيد بن حارثة ضرب له مثل يقول ليس ابن رجل آخر ابنك وكذا قال مجاهد وقتادة وابن زيد أنها نزلت في زيد بن حارثة رضي الله عنه\" وهذا يوافق ما قدمناه من التفسير والله سبحانه وتعالى أعلم."
    },
    {
      "ayah": 40,
      "surah": 33,
      "text": "وقوله تعالى \"ما كان محمدا أبا أحد من رجالكم \"نهى أن يقال بعد هذا زيد بن محمد أي لم يكن أباه وإن كان قد تبناه فإنه صلى الله عليه وسلم لم يعش له له ذكر حتى بلغ الحلم فإنه صلى الله عليه وسلم ولد له القاسم الطيب والطاهر من خديجة رضي الله عنها فماتوا صغارا وولد له صلى الله عليه وسلم إبراهيم من ماريه القبطية فمات أيضا رضيعا وكان له صلى الله عليه وسلم من خديجة أربع بنات: \"ينب ورقية وأم كلثوم وفاطمة رضي الله عنهم أجمعين فمات في حياته ثلاث وتأخرت فاطمة رضي الله عنها حتى أصيبت به صلى الله عليه وسلم ثم ماتت بعده لستة أشهر وقوله تعالى \"ولكن رسول الله وخاتم النبيين وكان الله بكل شيء عليما \"كقوله عز وجل \"الله أعلم حيث يجعل رسالته \"فهذه الآية نص في أنه لا نبي بعده وإذا كان لا نبي بعده فلا رسول بالطريق الأولى والأحرى لأن مقام الرسالة أخص من مقام النبوة فإن كل رسول نبي ولا ينعكس وبذلك وردت الأحاديث المتواترة عن رسول الله صلى الله عليه وسلم من حديث جماعه من الصحابة رضي الله عنهم قال الإمام أحمد حدثنا أبو عامر الأزدي حدثنا زهير بن محمد عن عبد الله بن محمد بن عقيل عن الطفيل بن أبي بن كعب عن أبيه رضي الله عنه عن النبي صلى الله عليه وسلم قال مثلي في النبيين كمثل رجل بنى دارا فأحسنها وأكملها وترك فيها موضع لبنة لم يضعها فجعل الناس يطوفون بالبنيان ويعجبون منه ويقولون لو تم موضع هذه اللبنة؟ فأنا في النبيين موضع تلك اللبنة ورواه الترمذي عن بندار عن أبي عامر العقدي به وقال حسن صحيح \" حديث آخر \"قال الإمام أحمد حدثنا عفان حدثنا عبد الواحد بن زياد حدثنا المختار بن فلفل حدثنا أنس بن مالك رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم إن الرسالة والنبوة قد انقطعت فلا رسول بعدي ولا نبي قال فشق ذلك على الناس فقال ولكن المبشرات قالوا يا رسول الله وما المبشرات؟ قال رؤيا الرجل المسلم وهي جزء من أجزاء النبوة وهكذا رواه الترمذي عن الحسن بن محمد الزعفراني عن عفان بن مسلم به وقال صحيح غريب من حديث المختار بن فلفل \"حديث آخر\" قال أبو داود الطيالسي حدثنا مسلم بن حيان عن سعيد بن مينا عن جابر بن عبد الله رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم مثلي ومثل الأنبياء كمثل رجل بنى دارا فأكملها وأحسنها إلا موضع لبنة فكان من دخلها فنظر إليها قال ما أحسنها إلا موضع هذه اللبنة فأنا موضع اللبنة ختم بي الأنبياء عليهم الصلاة والسلام ورواه البخاري ومسلم والترمذي من طرق عن سليم بن حيان به وقال الترمذي صحيح غريب من هذا الوجه \"حديث آخر\" قال الإمام أحمد حدثنا أبو معاوية حدثنا الأعمش عن أبي صالح عن أبي سعيد الخدري رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم مثلي ومثل النبيين كمثل رجل بنى دارا فأتمها إلا لبنة واحدة فجئت أنا فأتممت تلك اللبنة انفرد به مسلم من رواية الأعمش به حديث آخر قال الإمام أحمد حدثنا يونس بن محمد حدثنا حماد بن زيد حدثنا عفان بن عبيد الراسي قال سمعت أبا الطفيل رضي الله عنه يقول: قال رسول الله صلى الله عليه وسلم لا نبوه بعدي إلا المبشرات قيل وما المبشرات يا رسول الله؟ قال: الرؤيا الحسنة أو قال الرؤيا الصالحة \"حديث آخر\" قال الإمام أحمد حدثنا عبد الرزاق أخبرنا معمر عن همام بن منبه قال هذا ما حدثنا أبو هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم إن مثلي ومثل الأنبياء من قبلي كمثل رجل ابتنى بيوتا فأكملها وأحسنها وأجملها إلا موضع لبنة من زاوية من زواياها فجعل الناس يطوفون ويعجبهم البنيان ويقولون ألا وضعت ههنا لبنة فيتم بنيانك قال رسول الله صلى الله عليه وسلم فكنت أنا اللبنة أخرجاه من حديث عبد الرزاق حديث آخر عن أبي هريرة رضي الله عنه أيضا قال الإمام مسلم حدثنا يحيى بن أيوب وقتيبة وعلي بن حجر قالوا حدثنا إسماعيل بن جعفر عن العلاء عن أبيه عن أبي هريرة رضي الله عنه أن رسول الله صلى الله عليه وسلم قال فضلت على الأنبياء بست أعطيت جوامع الكلم ونصرت بالرعب وأحلت لي الغنائم وجعلت لي الأرض مسجدا وطهورا وأرسلت إلى الخلق كافة وختم بي النبيون ورواه الترمذي وابن ماجه من حديث إسماعيل ابن جعفر وقال الترمذي حسن صحيح حديث آخر قال الإمام أحمد حدثنا أبو معاوية حدثنا الأعمش عن أبي صالح عن أبي سعيد الخدري رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم مثلي ومثل الأنبياء من قبلي كمثل رجل بنى دارا فأتمها إلا موضع لبنة واحدة فجئت أنا فأتممت تلك اللبنة ورواه مسلم عن أبي بكر بن أبي شيبة وأبي كريب كلاهما عن أبي معاوية به حديث آخر قال الإمام أحمد حدثنا عبد الرحمن بن مهدي حدثنا معاوية بن صالح حدثنا سعيد بن سويد الكلبي عن عبد الأعلى بن هلال السلمي عن العرباض بن سارية رضي الله عنه قال: قال لي النبي صلى الله عليه وسلم إني عند الله لخاتم النبيين وإن ادم لمنجدل في طينته \"حديث آخر\" قال الزهري أخبرنا محمد بن جبير بن مطعم عن أبيه رضي الله عنه قال سمعت رسول الله صلى الله عليه وسلم يقول: إن لي أسماء: أنا محمد وأنا أحمد وأنا الماحي الذي يمحو الله تعالى بي الكفر وأنا الحاشر الذي يحشر الناس على قدمي وأنا العاقب الذي ليس بعده نبي أخرجه في الصحيحين وقال الإمام أحمد حدثنا يحيى بن إسحاق حدثنا ابن لهيعة عن عبد الله بن هبيرة عن عبد الرحمن بن جبير قال سمعت عبد الله بن عمرو يقول: خرج علينا رسول الله صلى الله عليه وسلم يوما كالمودع فقال أنا محمد النبي الأمي ثلاثا ولا نبي بعدي أوتيت فواتح الكلم وجوامعه وخواتمه وعلمت كم خزنه النار وحملة العرش وتجوز بي وعوفيت وعوفيت أمتي فاسمعوا وأطيعوا ما دمت فيكم فإذا ذهب بي فعليكم بكتاب الله تعالى أحلوا حلاله وحرموا حرامه تفرد به الإمام أحمد ورواه الإمام أحمد أيضا عن يحيى بن إسحاق عن ابن لهيعة عن عبد الله بن هبيرة عن عبد الله بن شريح الخولاني عن أبي قيس مولى عمرو بن العاص عن عبد الله بن عمرو رضي الله عنهما فذكر مثله سواء والأحاديث في هذا كثيرة فمن رحمة الله تعالى بالعباد إرسال محمد صلى الله عليه وسلم إليهم ثم من تشريفه لهم ختم الأنبياء والمرسلين به وإكمال الدين الحنيف له وقد أخبر الله تبارك وتعالى في كتابه ورسوله صلى الله عليه وسلم في السنة المتواترة عنه أنه لا نبي بعده ليعلموا أن كل من ادعى هذا المقام بعده فهو كذاب أفاك دجال ضال مضل ولو تحرق وشعبذ وأتى بأنواع السحر والطلاسم والنيرنجيات فكلها محال وضلال عند أولي الألباب كما أجرى الله سبحانه وتعالى على يد الأسود العنسي باليمن ومسيلمة الكذاب باليمامة من الأحوال الفاسدة والأقوال الباردة ما علم كل ذي لب وفهم وحجى أنهما كاذبان ضالان لعنهما الله وكذلك كل مدع لذلك إلى يوم القيامة حتى يختموا بالمسيح الدجال فكل واحد من هؤلاء الكذابين يخلق الله تعالى معه من الأمور ما يشهد العلماء والمؤمنون بكذب من جاء بها وهذا من تمام لطف الله تعالى بخلقه فإنهم بضرورة الواقع لا يأمرون بمعروف ولا ينهون عن منكر إلا على سبيل الاتفاق أولما لهم فيه من المقاصد إلى غيره ويكون في غاية الإفك والفجور في أقوالهم وأفعالهم كما قال تعالى: \"هل أنبئكم على من تنزل الشياطين تنزل على كل أفاك أثيم \"الآية وهذا بخلاف حال الأنبياء عليهم الصلاة والسلام فإنهم في غاية البر والصدق والرشد والاستقامة والعدل فيما يقولونه ويأمرون به وينهون عنه مع ما يؤيدون به من الخوارق للعادات والأدلة الواضحات والبراهين الباهرات فصلوات الله وسلامه عليهم دائما مستمرا ما دامت الأرض والسموات."
    },
    {
      "ayah": 41,
      "surah": 33,
      "text": "يقول تعالى آمرا عباده المؤمنين بكثرة ذكرهم لربهم تبارك وتعالى المنعم عليهم بأنواع النعم وصنوف المنن لما لهم في ذلك من جزيل الثواب وجميل المآب قال الإمام أحمد حدثنا يحيى بن سعيد عن عبد الله بن سعيد حدثني مولى بن عباس عن أبي بحرية عن أبى الدرداء رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم ألا أنبئكم بخير أعمالكم وأزكاها عند مليككم وأرفعها في درجاتكم وخير لكم من إعطاء الذهب والورق وخير لكم من أن تلقوا عدوكم فتضربوا أعناقهم ويضربوا أعناقكم قالوا وما هو يا رسول الله؟ قال صلى الله عليه وسلم ذكر الله عز وجل وهكذا رواه الترمذي وابن ماجه من حديث عبد الله بن سعيد بن أبي هند عن زياد مولى ابن عباس عن أبي بحرية واسمه عبد الله بن قيس البراغمي عن أبي الدرداء رضي الله عنه به قال الترمذي ورواه بعضهم عنه فأرسله قلت وقد تقدم هذا الحديث عند قوله تعالى \"والذاكرين الله كثيرا والذاكرات \"في مسند الإمام أحمد من حديث زياد بن أبي زياد مولى عبد الله بن عباس أنه بلغه عن معاذ بن جبل رضي الله عنه عن رسول الله صلى الله عليه وسلم بنحوه فالله أعلم وقال الإمام أحمد حدثنا وكيع حدثنا روح بن فضالة عن أبي سعيد الحمصي قال: سمعت أبا هريرة رضي الله عنه يقول: دعاء سمعته من رسول الله صلى الله عليه وسلم لا أدعه: اللهم اجعلني أعظم شكرك وأتبع نصيحتك وأكثر ذكرك وأحفظ وصيتك ورواه الترمذي عن يحيى بن موسى عن وكيع عن أبي فضالة الفرج عن بن فضالة عن أبي سعيد الحمصي عن أبي هريرة رضي الله عنه فذكر مثله وقال غريب وهكذا رواه الإمام أحمد أيضا عن أبي النضر هاشم بن القاسم عن فرج بن فضالة عن أبي سعيد المري عن أبي هريرة رضي الله عنه فذكره وقال الإمام أحمد حدثنا عبد الرحمن بن مهدي عن معاوية بن صالح عن عمرو بن قيس قال سمعت عبد الله بن بشر يقول جاء أعرابيان إلى رسول الله صلى الله عليه وسلم فقال أحدهما يا رسول الله أي الناس خير؟ قال صلى الله عليه وسلم من طال عمره وحسن عمله وقال الآخر يا رسول الله إن شرائع الإسلام قد كثرت علينا فمرنى بأمر أتشبث به قال صلى الله عليه وسلم لا يزال لسانك رطبا بذكر الله تعالى وروى الترمذي وابن ماجه الفصل الثاني من حديث معاوية بن صالح به وقال الترمذي حديث حسن غريب وقال الإمام أحمد حدثنا شريح حدثنا ابن وهب عن عمرو بن الحارث قال: إن دراجا أبا السمح حدثه عن أبي الهيثم عن أبي سعيد الخدري رضي الله عنه قال: إن رسول الله صلى الله عليه وسلم قال أكثروا ذكر الله تعالى حتى يقولوا مجنون وقال الطبراني حدثنا عبد الله بن أحمد حدثنا عقبة بن مكرم العمى حدثنا سعيد بن سفيان الجحدري حدثنا الحسن بن أبي جعفر عن عقبة بن أبي شبيب الراسبي عن أبي الجوزاء عن ابن عباس رضي الله عنهما قال: قال رسول الله صلى الله عليه وسلم اذكروا الله ذكرا كثيرا حتى يقول المنافقون أنكم تراءون وقال الإمام أحمد حدثنا أبو سعيد مولى بني هاشم حدثنا شداد أبو طلحة الراسبي سمعت أبا الوزاع جابر بن عمرو يحدث عن عبد الله بن عمرو رضي الله عنهما قال: قال رسول الله صلى الله عليه وسلم ما من قوم جلسوا مجلسا لم يذكروا الله تعالى فيه إلا رأوه حسرة يوم القيامة وقال علي بن أبي طلحة عن ابن عباس رضي الله عنهما في قوله تعالى: \"واذكروا الله ذكرا كثيرا \"إن الله تعالى لم يفرض على عباده فريضة إلا جعل لها حدا معلوما ثم عذر أهلها في حال العذر غير الذكر فإن الله تعالى لم يجعل له حدا ينتهي إليه ولم يعذر أحدا فى تركه إلا مغلوبا على تركه فقال: \"اذكروا الله قياما وقعودا وعلى جنوبكم \"بالليل والنهار في البر والبحر وفي السفر والحضر والغنى والفقر والسقم والصحة والسر والعلانية وعلى كل حال."
    },
    {
      "ayah": 42,
      "surah": 33,
      "text": "وقال عز وجل \"وسبحوه بكرة وأصيلا \"فإذا فعلتم ذلك صلى عليكم هو وملائكته والأحاديث والآيات والآثار في الحث على ذكر الله تعالى كثيرة جدا وفي هذه الآية الكريمة الحث على الإكثار من ذلك وقد صنف الناس في الأذكار المتعلقة بآناء الليل والنهار كالنسائي والمعمري وغيرهما ومن أحسن الكتب المؤلفة في ذلك كتاب الأذكار للشيخ محي الدين النووي رحمه الله وقوله تعالى \"وسبحوه بكرة وأصيلا \"أي عند الصباح والمساء كقوله عز وجل \"فسبحان الله حين تمسون وحين تصبحون وله الحمد في السموات والأرض عشيا وحين تظهرون \"."
    },
    {
      "ayah": 43,
      "surah": 33,
      "text": "وقوله تعالى: \"هو الذي يصلي عليكم وملائكته \"هذا تهيج إلى الذكر أي أنه سبحانه يذكركم فاذكروه أنتم كقوله عز وجل \"كما أرسلنا فيكم رسول منكم يتلوا عليكم أياتنا ويزكيكم ويعلمكم الكتاب والحكمة ويعلمكم ما لم تكونوا تعلمون فاذكروني أذكركم واشكروا لي ولا تكفرون \"وقال النبي صلى الله عليه وسلم يقول الله تعالى من ذكرني في نفسه ذكرته في نفسي ومن ذكرني في ملأ ذكرته في ملأ خير منه والصلاة من الله تعالى ثناؤه على العبد عند الملائكة حكاه البخاري عن أبي العالية ورواه أبو جعفر الرازي عن الربيع بن أنس عنه وقال غيره الصلاة من الله عز وجل الرحمة وقد يقال لا منافاة بين القولين والله أعلم وأما الصلاة من الملائكة فبمعنى الدعاء للناس والاستغفار كقوله تبارك وتعالى \"الذين يحملون العرش ومن حوله يسبحون بحمد ربهم ويؤمنون به ويستغفرون للذين آمنوا ربنا وسعت كل شيء رحمة وعلما فاغفر للذين تابوا واتبعوا سبيلك وقهم عذاب الجحيم ربنا وأدخلهم جنات عدن التي وعدتهم ومن صلح من آبائهم وأزواجهم وذرياتهم إنك أنت العزيز الحكيم وقهم السيئات \"الآية وقوله تعالى: \"ليخرجهم من الظلمات إلى النور \"أي بسبب رحمته بكم وثنائه عليكم ودعاء ملائكته لكم يخرجكم من ظلمات الجهل والضلال إلى نور الهدى واليقين \"وكان بالمؤمنين رحيما \"أي في الدنيا والآخرة أما في الدنيا فإنه هداهم إلى الحق الذي جهله غيرهم وبصرهم الطريق الذي ضل عنه وحاد عنه من سواهم الدعاة إلى الكفر أو البدعة وأتباعهم من الطعام وأما رحمته بهم في الآخرة فأمنهم من الفزع الأكبر وأمر ملائكته يتلقونهم بالبشارة بالفوز بالجنة والنجاة من النار وما ذاك إلا لمحبته لهم ورأفته بهم قال الإمام أحمد حدثنا محمد بن أبي عدي عن حميد عن أنس رضي الله عنه قال: مر رسول الله صلى الله عليه وسلم في نفر من أصحابه رضي الله عنهم وصبي في الطريق فلما رأت أمه القوم خشيت على ولدها أن يوطأ فأقبلت تسعى وتقول ابني ابني وسعت فأخذته فقال القوم يا رسول الله ما كانت هذه لتلقي ابنها في النار قال فخفضهم رسول الله صلى الله عليه وسلم وقال لا والله لا يلقي حبيبه في النار إسناده على شرط الصحيحين ولم يخرجه أحد من أصحاب الكتب الستة ولكن في صحيح الإمام البخاري عن أمير المؤمنين عمر بن الخطاب رضي الله عنه أن رسول الله صلى الله عليه وسلم رأى امرأة من السبي قد أخذت صبيا لها لصقته إلى صدرها وأرضعته فقال صلى الله عليه وسلم أترون هذه تلقي ولدها في النار وهي تقدر على ذلك؟ قالوا لا قال صلى الله عليه وسلم فوالله لله أرحم بعباده من هذه بولدها\"."
    },
    {
      "ayah": 44,
      "surah": 33,
      "text": "وقوله تعالى: \"تحيتهم يوم يلقونه سلام \"الظاهر أن المراد والله أعلم تحيتهم أي من الله تعالى \"يوم يلقونه سلام \"أي يوم يسلم عليهم كما قال الله عز وجل \"سلام قول من رب رحيم \"وزعم قتادة أن لمراد أنهم يحيي بعضهم بعضا بالسلام يوم يلقون الله في الدار الآخرة واختاره ابن جرير: قلت وقد يستدل له بقوله تعالى \"دعواهم فيها سبحانك اللهم وتحيتهم فيها سلام وآخر دعواهم أن الحمد لله رب العالمين \"وقوله تعالى: \"وأعد لهم أجرا كريما \"يعني الجنة وما فيها من المآكل والمشارب والملابس والمساكن والمناكح والملاذ والمناظر مما لا عين رأت ولا أذن سمعت ولا خطر على قلب بشر."
    },
    {
      "ayah": 45,
      "surah": 33,
      "text": "قال الإمام أحمد حدثنا موسى بن داود حدثنا فليح بن سليمان حدثنا هلال بن علي عن عطاء بن يسار قال لقيت عبد الله بن عمرو بن العاص رضي الله عنهما فقلت أخبرني عن صفة رسول الله صلى الله عليه وسلم في التوراة قال أجل والله إنه لموصوف في التوراة ببعض صفته في القرآن \"يا أيها النبي إنا أرسلناك شاهدا ومبشرا ونذيرا \"وحرزا للأميين فأنت عبدي ورسولي سميتك المتوكل ليس بفظ ولا غليظ ولا سخاب في الأسواق ولا يدفع السيئة بالسيئة ولكن يعفو ويصفح ويغفر ولن يقبضه الله حتى يقيم به الملة العوجاء بأن يقولوا لا إله إلا الله فيفتح بها أعينا عميا وآذانا صما وقلوبا غلفا وقد رواه البخاري في البيوع عن محمد بن سنان عن فليح بن سليمان عن هلال بن علي به ورواه في التفسير عن عبد الله قيل ابن رجاء وقيل ابن صالح عن عبد العزيز بن أبي سلمة عن هلال عن عطاء بن يسار عن عبد الله بن عمرو به ورواه ابن أبي حاتم عن أبيه عن عبد الله بن رجاء عن عبد العزيز بن أبي سلمة الماجشون به وقال البخاري في البيوع وقال سعيد عن هلال عن عطاء عن عبد الله بن سلام رضي الله عنه وقال وهب بن منبه إن الله تعالى أوحى إلى نبي من أنبياء بني إسرائيل يقال له شعياء: أن قم في قومك بني إسرائيل فإني منطق لسانك بوحي وأبعث أميا من الأمين أبعثه ليس بفظ ولا غليظ ولا سخاب في الأسواق لو يمر إلى جنب سراج لم يطفئه من سكينته ولو يمشي على القصب لم يسمع من تحت قدميه أبعثه مبشرا ونذيرا لا يقول أفتح به أعينا كمها وآذانا صما وقلوبا غلفا أسدده لكل أمر جميل وأهب له كل خلق كريم وأجعل السكينة لباسه والبر شعاره والتقوى ضميره والحكمة منطقة والصدق والوفاء طبيعته والعفو والمعروف خلقه والحق شريعته والعدل سيرته والهدى إمامه والإسلام ملته وأحمد اسمه أهدي به بعد الضلال وأعلم به بعد الجهالة وأرفع به بعد الخمالة وأعرف به بعد النكرة وأكثر به بعد القلة وأغني به بعد العيلة وأجمع به بعد الفرقة وأؤلف به بين أمم متفرقة وقلوب مختلفة وأهواء متشتتة وأستنقذ به فئاما من الناس عظيمة من الهلكة وأجعل أمته خير أمة أخرجت للناس يأمرون بالمعروف وينهون عن المنكر موحدين مؤمنين مخلصين مصدقين لما جاءت به رسلي ألهمهم التسبيح والتحميد والثناء والتكبير والتوحيد في مساجدهم ومجالسهم ومضاجعهم ومنقلبهم ومثواهم يصلون لي قياما وقعودا ويقاتلون في سبيل الله صفوفا وزحوفا ويخرجون من ديارهم ابتغاء مرضاتي ألوفا يظهرون الوجوه والأطراف ويشدون الثياب في الأنصاف قربانهم دماؤهم وأنا جيلهم في صدورهم رهبان بالليل ليوث بالنهار وأجعل في أهل بيته وذريته السابقين والصديقين والشهداء والصالحين أمته من بعده يهدون بالحق وبه يعدلون وأعز من نصرهم وأيد من دعا لهم وأجعل دائرة السوء على من خالفهم أو بغى عليهم أو أراد أن ينتزع شيئا مما في أيديهم أجعلهم ورثة لنبيهم والداعية إلى ربهم يأمرون بالمعروف وينهون عن المنكر ويقيمون الصلاة ويؤتون الزكاة ويوفون بعهدهم أختم بهم الخير الذي بدأته بأولهم ذلك فضلي أؤتيه من أشاء وأنا ذو الفضل العظيم هكذا رواه ابن أبي حاتم عن وهب بن منبه اليماني رحمه الله ثم قال ابن أبي حاتم حدثنا أبي حدثنا عبد الرحمن بن صالح حدثنا عبد الرحمن بن محمد بن عبيد الله القرشي عن شيبان النحوي أخبرني قتادة عن عكرمة عن ابن عباس رضي الله عنهما قال: لما نزلت \"يا أيها النبي إنا أرسلناك شاهدا ومبشرا ونذيرا \"وقد كان أمر عليا ومعاذا رضي الله عنهما أن يسيرا إلى اليمن فقال انطلقا فبشرا ولا تنفرا ويسرا ولا تعسرا إنه قد أنزل علي \"يا أيها النبي إنا أرسلناك شاهدا ومبشرا ونذيرا \"ورواه الطبراني عن محمد بن نصر بن حميد البزار البغدادي عن عبد الرحمن بن صالح الأزدي عن عبد الرحمن بن محمد بن عبيد الله العرزمي بإسناده مثله وقال في آخره فإنه قد أنزل علي يا أيها النبي إنا أرسلناك شاهدا على أمتك ومبشرا بالجنة ونذيرا من النار وداعيا إلى شهادة أن لا إله إلا الله بإذنه وسراجا منيرا بالقرآن فقوله تعالى: \"شاهدا \"أي لله بالوحدانية وأنه لا إله غيره وعلى الناس بأعمالهم يوم القيامة وجئنا بك على هؤلاء شهيدا كقوله: \"لتكونوا شهداء على الناس ويكون الرسول عليكم شهيدا \"وقوله عز وجل \"ومبشرا ونذيرا \"أي بشيرا للمؤمنين بجزيل الثواب ونذيرا للكافرين من وبيل العقاب."
    },
    {
      "ayah": 46,
      "surah": 33,
      "text": "وقوله جلت عظمته \"وداعيا إلى الله بإذنه \"أى داعيا للخلق إلى عبادة ربهم عن أمره لك بذلك \"وسراجا منيرا \"أي وأمرك ظاهر فيما جئت به من الحق كالشمس في إشراقها وإضاءتها لا يجحدها إلا معاند."
    },
    { "ayah": 47, "surah": 33, "text": "لا يوجد تفسير لهذه الأية" },
    {
      "ayah": 48,
      "surah": 33,
      "text": "وقوله جل وعلا \"ولا تطع الكافرين والمنافين ودع أذاهم \"أي لا تطعهم وتسمع منهم في الذي يقولونه \"ودع أذاهم \"أى اصفح وتجاوز عنهم وكل أمرهم إلى الله تعالى فإن فيه كفاية لهم ولهذا قال جل جلاله \"وتوكل على الله وكفى بالله وكيلا \"."
    },
    {
      "ayah": 49,
      "surah": 33,
      "text": "هذه الآية الكريمة فيها أحكام كثيرة منها إطلاق النكاح على العقد وحده وليس في القرآن آية أصرح في ذلك منها وقد اختلفوا فى النكاح هل هو حقيقة في العقد وحده أو في الوطء أو فيهما؟ على ثلاثة أقوال واستعمال القرآن إنما هو في العقد والوطء بعده إلا في هذه الآية فإنه استعمل في العقد وحده لقوله تبارك وتعالى \"إذا نكحتم المؤمنات ثم طلقتموهن من قبل أن تمسوهن \"وفيها دلالة لإباحة طلاق المرأة قبل الدخول بها وقوله تعالى \"المؤمنات \"خرج مخرج الغالب إذ لا فرق في الحكم بين المؤمنة والكتابية في ذلك بالاتفاق وقد استدل ابن عباس رضي الله عنهما وسعيد ابن المسيب والحسن البصري وعلي بن الحسين زبن العابدين وجماعة من السلف بهذه الآية على أن الطلاق لا يقع إلا إذا تقدمه نكاح لأن الله تعالى قال \"إذا نكحتم المؤمنات ثم طلقتموهن \"فعقب النكاح بالطلاق فدل على أنه لا يصح ولا يقع قبله وهذا مذهب الشافعي وأحمد بن حنبل وطائفة كثيرة من السلف والخلف رحمهم الله تعالى وذهب مالك وأبو حنيفة رحمهما الله تعالى إلى صحة الطلاق قبل النكاح فيما إذا قال إن تزوجت فلانة فهي طالق فعندهما متى تزوجها طلقت منه واختلقا فيما إذا قال كل امرأة أتزوجها فهي طالق فقال مالك: لا تطلق حتى يعين المرأة وقال أبو حنيفه رحمه الله كل امرأة يتزوجها بعد هذا الكلام تطلق منه فأما الجمهور فاحتجوا على عدم وقوع الطلاق بهذه الآية قال ابن أبي حاتم حدثنا أحمد بن منصور المروزي حدثنا النضر بن شميل حدثنا يونس يعني ابن أبي إسحاق قال سمعت آدم مولى خالد عن سعيد بن جبير عن ابن عباس رضي الله تعالى عنهما قال إذا قال كل امرأة أتزوجها فهي طالق قال ليس بشي من أجل أن الله تعالى يقول \"يا أيها الذين آمنوا إذا نكحتم المؤمنات ثم طلقتموهن \"الآية وحدثنا محمد بن إسماعيل الأحمسي حدثنا وكيع عن مطر عن الحسن بن مسلم بن يناق عن ابن عباس رضي الله عنهما قال: إنما قال الله عز وجل \"إذا نكحتم المؤمنات ثم طلقتموهن \"ألا ترى أن الطلاق بعد النكاح وهكذا روى محمد بن إسحاق عن داود بن الحصين عن عكرمة عن ابن عباس رضي الله عنهما قال: قال الله تعالى \"إذا نكحتم المؤمنات ثم طلقتموهن \" فلا طلاق قبل النكاح وقد ورد الحديث بذلك عن عمرو بن شعيب عن أبيه عن جده قال: قال رسول الله صلى الله عليه وسلم لا طلاق لابن آدم فيم لا يملك رواه أحمد وأبو داود والترمذي وابن ماجه وقال الترمذي هذا حديث حسن وهو أحسن شيء روي في هذا الباب وهكذا روى ابن ماجه عن علي عن المسور بن مخرمة رضي الله عنهما عن رسول الله صلى الله عليه وسلم أنه قال: لا طلاق قبل النكاح وقوله عز وجل: \"فما لكم عليهن من عدة تعتدونها \"هذا أمر مجمع عليه بين العلماء أن المرأة إذا طلقت قبل الدخول بها لا عدة عليها فتذهب فتتزوج في فورها من شاءت ولا يستثني من هذا إلا المتوفي عنها زوجها فإنها تعتد منه أربعة أشهر وعشرا لأن لم يكن دخل بها بالإجماع أيضا وقوله تعالى: \"فمتعوهن وسرحوهن سراحا جميلا \"المتعة ههنا أعم من أن تكون نصف الصداق المسمى أو المتعة الخاصة إن لم يكن قد سمى لها قال الله تعالى \"وإن طلقتموهن من قبل أن تمسوهن وقد فرضتم لهن فريضة فنصف ما فرضتم \"وقال عز وجل \"لا جناح عليكم إن طلقتم النساء ما لم تمسوهن أو تفرضوا لهن فريضة ومتعوهن على الموسع قدره وعلى المقتر قدره متاعا بالمعروف حقا على المحسنين \"وفي صحيح البخاري عن سهل بن سعد وأبي أسيد رضي الله عنهما قالا: إن رسول الله صلى الله عليه وسلم تزوج أميمة بنت شراحيل فلما أن دخلت عليه بسط يده إليها فكأنها كرهت ذلك فأمر أبا أسيد أن يجهزها ويكسوها ثوبين رازقين. قال علي بن أبي طلحة رضي الله عنهما إن كان سمى لها صداقا فليس لها إلا النصف وإن لم يكن سمى لها صداقا أمتعها على قدر عسره ويسره وهو السراح الجميل."
    },
    {
      "ayah": 5,
      "surah": 33,
      "text": "وقوله عز وجل: \"ادعوهم لآبائهم هو أقسط عند الله\" هذا أمر ناسخ لما كان في ابتداء الإسلام من جواز ادعاء الأبناء الأجانب وهم الأدعياء فأمر تبارك وتعالى برد نسبهم إلى آبائهم في الحقيقة وأن هذا هو العدل والقسط والبر. قال البخاري رحمه الله حدثنا يعلى بن أسد حدثنا عبد العزيز بن المختار عن موسى بن عقبة قال حدثني سالم عن عبد الله بن عمر قال إن زيد بن حارثة رضي الله عنه \"مولى رسول الله صلى الله عليه وسلم ما كنا ندعوه إلا زيد بن محمد حتى نزل القرآن \"ادعوهم لآبائهم هو أقسط عند الله\" وأخرجه مسلم والترمذي والنسائي من طرق عن موسى بن عقبة به وقد كانوا يعاملونهم معاملة الأبناء من كل وجه في الخلوة بالمحارم وغير ذلك ولهذا قالت سهلة بنت سهيل امرأة أبي حذيفة رضي الله عنهما: يا رسول الله صلى الله عليه وسلم إنا كنا ندعو سالما ابنا وإن الله قد أنزل ما أنزل وإنه كان يدخل علي وإني أجد في نفس أبي حذيفة من ذلك شيئا فقال صلى الله عليه وسلم \"أرضعيه تحرمي عليه\" الحديث ولهذا لما نسخ هذا الحكم أباح تبارك وتعالى زوجه الدعي وتزوج رسول الله صلى الله عليه وسلم بزينب بنت جحش مطلقة زيد بن حارثة رضي الله عنه وقال عز وجل \"لكيلا يكون على المؤمنين حرج في أزواح أدعيائهم إذا قضوا منهن وطرا\" وقال تبارك وتعالى في آية التحريم \"وحلائل أبنائكم الذين من أصلابكم\" احترازا عن زوجة الدعي فإنه ليس من الصلب فأما الابن من الرضاعة فمنزل منزلة ابن الصلب شرعا بقوله صلى الله عليه وسلم في الصحيحين \"حرموا من الرضاعة ما يحرم من النسب\" أما دعوة الغير ابنا على سبيل التكريم والتحبيب فليس مما نهى عنه في هذه الآية بدليل ما رواه الإمام أحمد وأهل السنن إلا الترمذي من حديث سفيان الثوري عن سلمة بن كهيل عن الحسن العوفي عن ابن عباس رضي الله عنهما قال: قدمنا على رسول الله صلى الله عليه وسلم أغلمة بني عبد المطلب على حمرات لنا من جمع فجعل يلطخ أفخاذنا ويقول \"أبيني لا ترموا الجمرة حتى تطلع الشمس\" قال أبو عبيدة وغيره أبيني تصغير ابني وهذا ظاهر الدلالة فإن هذا كان في حجة الوداع سنة عشر. وقوله \"ادعوهم لآبائهم\" في شأن زيد بن حارثة رضي الله عنه وقد قتل في يوم مؤتة سنة ثمان وأيضا ففي صحيح مسلم من حديث أبي عوانة الوضاح بن عبد الله اليشكري عن الجعد أبي عثمان البصري عن أنس بن مالك رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم \"يا بني\" ورواه أبو داود والترمذي وقوله عز وجل: \"فإن لم تعلموا آباءهم فإخوانكم في الدين ومواليكم\" أمر تعالى برد أنساب الأدعياء إلى آبائهم إن عرفوا فإن لم يعرفوا فهم إخوانهم في الدين ومواليهم أي عوضا عما فاتهم من النسب ولهذا قال رسول الله صلى الله عليه وسلم يوم خرج من مكة عام عمرة القضاء وتبعتهم ابنة حمزة رضي الله عنها تنادي يا عم يا عم فأخذها علي رضي الله عنه وقال لفاطمة رضي الله عنها دونك ابنة عمك فاحتملتها فاختصم فيها علي وزيد وجعفر رضي الله عنهم في أيهم يكفلها فكل أدلى بحجة فقال علي رضي الله عنه أنا أحق بها وهى ابنة عمي وقال زيد ابنة أخي وقال جعفر بن أبي طالب ابنة عمي وخالتها تحتي يعني أسماء بنت عميس فقضى بها النبي صلى الله عليه وسلم لخالتها وقال: \"الخالة بمنزلة الأم\" وقال لعلي رضي الله عنه أنت مني وأنا منك\" وقال لجعفر رضي الله عنه \"أشبهت خلقي وخلقي\" وقال لزيد رضي الله عنه \"أنت أخونا ومولانا\" ففي هذا الحديث أحكام كثيرة من أحسنها أنه صلى الله عليه وسلم حكم بالحق وأرضى كلا من المتنازعين وقال لزيد رضي الله عنه \"أنت أخونا ومولانا\" كما قال تعالى: \"فإخوانكم في الدين ومواليكم\" وقال ابن جرير حدثنا يعقوب بن إبراهيم حدثنا ابن علية عن عينة بن عبد الرحمن عن أبيه قال: قال أبو بكرة رضي الله عنه قال الله عز وجل: \"ادعوهم لآبائهم هو أقسط عند الله فإن لم تعلموا آباءهم فإخوانكم في الدين ومواليكم\" فأنا ممن لا يعرف أبوه فأنا من إخوانكم في الدين قال أبي: والله إني لأظنه أنه لو علم أن أباه كان حمارا لانتمى إليه وقد جاء في الحديث \"من ادعي إلى غير أبيه وهو يعلم إلا كفر\" وهذا تشديد وتهديد ووعيد أكيد في التبري من النسب المعلوم ولهذا قال تعالى: \"ادعوهم لآبائهم هو أقسط عند الله فإن لم تعلموا آباءهم فإخوانكم في الدين ومواليكم\" ثم قال تعالى: \"وليس عليكم جناح فيما أخطأتم به\" أي إذا نسبتم بعضهم إلى غير أبيه في الحقيقة خطأ بعد الاجتهاد واستفراغ الوسع فإن الله تعالى قد وضع الحرج في الخطأ ورفع إثمه كما أرشد إليه في قوله تبارك وتعالى آمرا عباده أن يقولوا \"ربنا لا تؤاخذنا إن نسينا أو أخطأنا\" وثبت في صحيح مسلم أن رسول الله صلى الله عليه وسلم قال: \"قال الله عز وجل قد فعلت\" وفي صحيح البخاري عن عمرو بن العاص رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم \"إذا اجتهد الحاكم فأصاب فله أجران وإن اجتهد فأخطأ فله أجر\" وفي الحديث الآخر \"إن الله تعالى رفع عن أمتي الخطأ والنسيان والأمر الذي يكرهون عليه\" وقال تبارك وتعالى ههنا \"وليس عليكم جناح فيما أخطأتم به ولكن ما تعمدت قلوبكم وكان الله غفورا رحيما\" أي وإنما الإثم على من تعمد الباطل كما قال عز وجل: \"لا يؤاخذكم الله باللغو في أيمانكم\" الآية وفي الحديث المتقدم\" من ادعى إلى غير أبيه وهو يعلمه إلا كفر\" وفي القرآن المنسوخ فإنه كفر بكم أن ترغبوا عن آبائكم قال الإمام أحمد حدثنا عبد الرزاق أخبرنا معمر عن الزهري عن عبيد الله بن عبد الله بن عتبة بن مسعود عن ابن عباس عن عمر رضي الله عنه أنه قال: إن الله تعالى بعث محمدا بالحق وأنزل معه الكتاب فكان فيما أنزل عليه آية الرجم فرجم رسول الله صلى الله عليه وسلم ورجمنا بعده من قال قد كنا نقرأ ولا ترغبوا عن آبائكم فإنه كفر بكم أن ترغبوا عن آبائكم وأن رسول الله صلى الله عليه وسلم قال \"لا تطروني كما أطري عيسى ابن مريم عليه السلام فإنما أنا عبد الله فقولوا عبده ورسوله\" وربما قال معمر \"كما أطرت النصارى ابن مريم\" رواه في الحديث الآخر \"ثلاث في الناس كفر الطعن في النسب والنياحة على الميت والاستسقاء بالنجوم\"."
    },
    {
      "ayah": 50,
      "surah": 33,
      "text": "يقول تعالى مخاطبا نبيه صلى الله عليه وسلم بأنه قد أحل له من النساء أزواجه اللاتي أعطاهن مهورهن وهى الأجور ههنا كما قاله مجاهد وغير واحد وقد كان مهره لنسائه اثنتي عشرة أوقية ونشأ وهو نصف أوقية فالجميع خمسمائة درهم إلا أم حبيبة بنت أبي سفيان فإنه أمهرها عنه النجاشي رحمه الله تعالى أربعمائة دينار وإلا صفية بنت حيي فإنه اصطفاها من سبي خيبر ثم أعتقها وجعل عتقها صداقها وكذلك جويرية بنت الحارث المصطلقية أدى عنها كتابتها إلى ثابت بن قيس بن شماس وتزوجها \"0 أجمعين وقوله تعالى \"وما ملكت يمينك مما أفاء الله عليك \"أي وأباح لك التسري مما أخذت من المغانم وقد ملك صفية وجويرية فأعتقهما وتزوجهما وملك ريحانه بنت شمعون النضرية ومارية القبطية أم ابنه إبراهيم عليهما السلام وكانتا من السراري رضي الله عنهما وقوله تعالى: \"وبنات عمك وبنات عماتك وبنات خالك وبنات خالاتك \"الآية هذا عدل وسط بين الإفراط والتفريط فإن النصارى لا يتزوجون المرأة إلا إذا كان الرجل بينه وبينها سبعة أجداد فصاعدا واليهود يتزوج أحدهم بنت أخيه وبنت أخته فجاءت هذه الشريعة الكاملة الطاهرة بهدم إفراط النصارى فأباح بنت العم والعمة وبنت الخال والخالة وتحريم ما فرطت فيه اليهود من إباحة بنت الأخ والأخت وهذا شنيع فظيع وإنما قال \"وبنات عمك وبنات عماتك وبنات خالك وبنات خالاتك \"فوحد لفظ الذكر لشرفه وجمع الإناث لنقصهن كقوله: \"عن اليمين والشمائل \" \"يخرجهم من الظلمات إلى النور\" وجعل الظلمات والنور \"وله نظائر كثيرة وقوله تعالي: \"اللاتي هاجرن معك \"قال ابن أبي حاتم رحمه الله حدثنا محمد بن عمار بن الحارث الرازي حدثنا عبيد الله بن موسى حدثنا إسرائيل عن السدي عن أبي صالح عن أم هانئ قالت خطبني رسول الله صلى الله عليه وسلم فاعتذرت إليه فعذرني ثم أنزل الله تعالى: \"إنا أحللنا لك أزواجك اللاتي آتيت أجورهن وما ملكت يمينك مما أفاء الله عليك وبنات عمك وبنات عماتك وبنات خالك وبنات خالاتك اللاتي هاجرن معك \"قالت فلم أكن أحل له لم أكن ممن هاجر معه كنت من الطلقاء ورواه ابن جرير عن أبي كريب عن عبيد الله بن موسى به ثم رواه ابن أبي حاتم من حديث إسماعيل بن أبي خالد عن أبي صالح عنها بنحوه ورواه الترمذي في جامعه وهكذا قال أبو رزين وقتادة أن المراد من هاجر معه إلى المدينة وفي رواية عن قتادة \"اللاتي هاجرن معك \"أي أسلمن وقال الضحاك قرأ ابن مسعود \"واللائي هاجرن من معك \" وقوله تعالى \"وامرأة مؤمنة إن وهبت نفسها للنبي إن أراد النبي أن يستنكحها خالصة لك \"الآية أي ويحل لك أيها النبي المرأة المؤمنة إن وهبت نفس لك أن تتزوجها بغير مهر إن شئت ذلك وهذه الآية توالي فيها شرطان كقوله تعالى إخبارا عن نوح \"إنه قال لقومه ولا ينفعكم نصحي إن أردت أن أنصح لكم إن كان الله يريد أن يغويكم \"وكقول موسى \"يا قوم إن كنتم آمنتم بالله فعليه توكلوا إن كنتم مسلمين \"وقال ههنا \"وامرأة مؤمنه إن وهبت نفسها للنبي \"الآية وقد قال الإمام أحمد حدثنا إسحاق أخبرنا مالك عن أبي حازم عن سهل بن سعد الساعدي أن رسول الله صلى الله عليه وسلم جاءته امرأة فقالت يا رسول الله إنى قد وهبت نفسي لك فقامت قياما طويلا فقام رجل فقال يا رسول الله زوجنيها إن لم يكن لك بها حاجة فقال رسول الله صلى الله عليه وسلم هل عندك من شيء تصدقها إياه؟ فقال ما عندي إلا إزاري هذا فقال رسول الله صلى الله عليه وسلم إن أعطيتها إزارك جلست لا إزار لك فالتمس شيئا فقال لا أجد شيئا فقال التمس ولو خاتما من حديد فالتمس فلم يجد شيئا فقال له النبي صلى الله عليه وسلم هل معك من القرآن شيء؟ قال نعم سورة كذا وسورة كذا السور يسميها فقال له النبي صلى الله عليه وسلم زوجتكما: بما معك من القرآن أخرجاه من حديث مالك وقال الإمام أحمد حدثنا عفان حدثنا مرحوم سمعت ثابتا يقول: كنت مع أنس جالسا وعنده ابنه له فقال أني جاءت أمرأته إلى النبي صلى الله عليه وسلم فقالت يا نبي الله هل لك في حاجة فقالت ابنته ما كان أقل حياءها فقال هي خير منك رغبت في النبي فعرضت عليه نفسها انفرد بإخراجه البخاري من حديث مرحوم بن عبد العزيز عن ثابت البناني عن أنس به: وقال أحمد أيضا حدثنا عبد الله بن بكير حدثنا سنان بن ربيعة عن الحضرمي عن أنس بن مالك أن امرأة أتت النبي صلى الله عليه وسلم فقالت يا رسول الله ابنة لي كذا وكذا فذكرت من حسنها وجمالها فأثرتك بها فقال قد قبلتها فلم تزل تمدحها حتى ذكرت أنها لم تصدع ولم تشك شيئا قط فقال لا حاجة لي فى ابنتك لم يخرجوه وقال ابن أبي حاتم حدثنا أبي حدثنا منصور بن أبي مزاحم حدثنا ابن أبي الوضاح يعني محمد بن مسلم عن هشام بن عروة عن أبيه عن عائشة قالت التي وهبت نفسها للنبي صلى الله عليه وسلم خوله بنت حكيم وقال ابن وهب عن سعيد بن عبد الرحمن وابن أبي الزناد عن هشام بن عروة عن أبيه أن خولة بنت حكيم بن الأوقص من بني سليم كانت من اللاتي وهبن أنفسهن لرسول الله صلى الله عليه وسلم وفي رواية له عن سعيد بن عبد الرحمن عن هشام عن أبيه كنا نتحدث أن خولة بنت حكيم كانت وهبت لرسول الله صلى الله عليه وسلم وكانت امرأة صالحة فيحتمل أن أم سليم هي خولة بنت حكيم أو هي امرأة أخـرى وقال ابن أبي حاتم حدثنا محمد بن إسماعيل الأحمسي حدثنا وكيع حدثنا موسى بن عبيدة عن محمد بن كعب وعمر بن الحكم وعبد الله بن عبيدة قالوا: تزوج رسول الله ثلاث عشرة امرأة ستا من قريش: خديجة وعائشة وحفصة وأم حبيبة وسودة وأم سلمة وثلاثة من بني عامر بن صعصعة وامرأتين من بني هلال بن عامر ميمونه بنت الحارث وهي التي وهبت نفسها للنبي صلى الله عليه وسلم وزينب أم المساكين وامرأة من بني بكر بن كلاب من القرظيات وهي التي اختارت الدنيا وامرأة من بني الجون وهي التي استعاذت منه وزينب بنت جحش الأسدية والسبيتين صفية بنت حيي بن أخطب وجويرية بنت الحارث بن عمرو بن المصطلق الخزاعية وقال سعيد بن أبي عروبة عن قتادة عن ابن عباس \"وامرأة مؤمنة إن وهبت نفسها للنبي \"قال هي ميمونه بنت الحارث فيه انقطاع هو مرسل والمشهور أن زينب التي كانت تدعى أم المسلمين هي زينب بنت خزمة الأنصارية وقد ماتت عند النبي صلى الله عليه وسلم في حياته فالله أعلم والغرض من هذا أن اللاتي وهبن أنفسهن للنبي صلى الله عليه وسلم كثير كما قال البخاري حدثنا زكريا بن يحيى حدثنا أبو أسامة قال حدثنا هشام بن عروة عن أبيه عن عائشة قالت كنت أغار من اللاتي وهبن أنفسهن للنبي صلى الله عليه وسلم وأقول أتهب المرأة نفسها؟ فلما أنزل الله تعالى \"ترجي من تشاء منهن وتؤوي إليك من تشاء ومن ابتغيت ممن عزلت فلا جناح عليك \"قلت ما أرى ربك إلا يسارع في هواك وقد قال ابن أبي حاتم حدثنا علي بن الحسين حدثنا محمد بن منصور الجعفي حدثنا يونس بن بكير عن عنبسة بن الأزهر عن سماك عن عكرمة عن ابن عباس قال لم يكن عند رسول الله صلى الله عليه وسلم امرأه وهبت نفسها له ورواه ابن جرير عن أبي كريب عن يونس بن بكير أي أنه لم يقبل واحدة ممن وهبت نفسها له وإن ذلك مباحا له ومخصوصا به لأنه مردود إلى مشيئته كما قال الله تعالى \"إن أراد النبي أن يستنكحها \"أي إن اختار ذلك وقوله تعالى \"خالصة لك من دون المؤمنين \"قال عكرمة أي لا تحل الموهوبة لغيرك ولو أن امرأة وهبت نفسها لرجل لم تحل له حتى يعطيها شيئا وكذا قال مجاهد والشعبي وغيرهما أي إنها إذا فوضت المرأة نفسها إلى رجل فإنه متى دخل بها وجب عليه بها مهر مثلها كما حكم به رسول الله صلى الله عليه وسلم في تزويج بنت واشق لما فوضت فحكم لها رسول الله صلى الله عليه وسلم بصداق مثلها لما توفي عنها زوجها والموت والدخول سواء في تقرير المهر وثبوت مهر المثل في المفوضة لغير النبي صلى الله عليه وسلم فأما هو عليه السلام فإنه لا يجب عليه للمفوضة شيء ولو دخل بها لأن له أن يتزوج بغير صداق ولا ولي ولا شهود كما في قصة زينب بنت جحش رضي الله عنها ولهذا قال قتادة في قوله \"خالصة لك من دون المؤمنين \"يقول ليس لامرأة تهب نفسها لرجل بغير ولي ولا مهر إلا للنبي صلى الله عليه وسلم وقوله تعالى \"قد علمنا ما فرضنا عليهم في أزواجهم وما ملكت أيمانهم \"قال أبي بن كعب ومجاهد والحسن وقتادة وابن جرير في قوله \"قد علمنا ما فرضنا عليهم في أزواجهم \"أي من حصرهم في أربع نسوة حرائر وما شاءوا س الإماء واشتراط الولي والمهر والشهود عليهم وهم الأمة وقد رخصنا لك فلم نوجب عليك شيئا منه \"لكيلا يكون عليك حرج وكان الله غفورا رحيما \"."
    },
    {
      "ayah": 51,
      "surah": 33,
      "text": "قال الإمام أحمد حدثنا محمد بن بشر حدثنا هشام بن عروة عن أبية عن عائشة رضي الله عنها أنها كانت تغير من النساء اللاتي وهبن أنفسهن لرسول الله صلى الله عليه وسلم قالت ألا تستحي المرأة أن تعرض نفسها بغير صداق؟ فأنزل الله عز وجل \"ترجي من تشاء منهن وتؤوي إليك من تشاء \"الآية قالت إنى أرى ربك يسارع لك في هواك وقد تقدم أن البخاري رواه من حديث أبى أسامة عن هشام بن عروة فدل هذا على أن المراد بقوله ترجي \"أي تؤخر \"من تشاء منهن \"أي من الواهبات \"وتؤوي إليك من تشاء \"أي من شئت قبلتها ومن شئت رددتها ومن رددتها فأنت فيها أيضا بالخيار بعد ذلك إن شئت عدت فيها فأويتها ولهذا قال \"ومن ابتغيت ممن عزلت فلا جناح عليك \"قال عامر الشعبي في قوله تعالى \"ترجي من تشاء منهن \"الآية كن نساءا وهبن أنفسهن للنبي صلى الله عليه وسلم فدخل ببعضهن وأرجأ بعضهن لم ينكحن بعده منهن أم شريك وقال آخرون بل المراد بقوله \"ترجي من تشاء منهن \" الآية أي من أزواجك لا حرج عليك أن تترك القسم لهن فتقدم من شئت وتؤخر من شئت وتجامع من شئت وتترك من شئت هكذا يروى عن ابن عباس ومجاهد والحسن وقتادة وأبي رزين وعبد الرحمن بن زيد أن أسلم وغيرهم ومع هذا كان النبي صلى الله عليه وسلم يقسم لهن ولهذا ذهب طائفة من الفقهاء من الشافعية وغيرهم إلى أنه لم يكن القسم واجبا عليه عليه صلى الله عليه وسلم واحتجوا بهذه الآية الكريمة وقال البخاري حدثنا حبان بن موسى حدثنا عبد الله هو ابن المبارك أخبرنا عاصم الأحول عن معاذ عن عائشة عن رسول الله صلى الله عليه وسلم كان يستأذن في اليوم المرأة منا بعد أن نزل هذه الآية \"ترجى من تشاء منهن وتؤوى إليك من تشاء ومن ابتغيت ممن عزلت فلا جناح عليك \"فقلت لها ما كنت تقولين؟ فقالت كنت أقول إن كان ذلك إلي فإني لا أريد يا رسول الله أن أؤثر عليك أحدا فهذا الحديث عنها يدل على أن المراد من ذلك عدم وجود القسم وحديثها الأول يقتضي أن الآية نزلت في الواهبات ومن ههنا اختار ابن جرير أن الآية عاما في الواهبات وفي النساء اللاتي عنده أنه مخير فيهن إن شاء قسم وإن شاء لم يقسم وهذا الذي اختاره حسن جيد قوي وفيه جمع بين الأحاديث ولهذا قال تعالى \"ذلك أدنى أن تقر أعينهن ولا يحزن ويرضين بما آتيتهن كلهن \"أي إذا علمن أن الله قد وضع عنك الحرج في القسم فإن شئت قسمت وإن شئت لم تقسم لا جناح عليك في أي ذلك فعلت ثم مع هذا إن تقسم لهن اختيارا منك لا أنه على سبيل الوجوب فرحن بذلك واستبشرن به وحملن جميلتك في ذلك واعترفن بمنتك عليهن في قسمتك لهن وتسويتك بينهن وإنصافك لهن وعدلك فيهن وقوله تعالى \"والله يعلم ما في قلوبكم \"أي من الميل إلى بعضهن دون بعض مما لا يمكن دفعه كما قال الإمام أحمد حدثنا يزيد حدثنا حماد بن سلمة عن أيوب عن أبي قلابة عن عبد الله بن يزيد عن عائشة قالت: كان رسول الله صلى الله عليه وسلم يقسم بين نسائه فيعدل ثم يقول اللهم هذا فعلي فيما أملك فلا تلمني فيما تملك ولا أملك ورواه أهل السنن الأربعة من حديث حماد بن سلمة وزاد أبو داود بعد قوله فلا تلمني فيما أملك يعني القلب وإسناده صحيح ورجاله كلهم ثقات ولهذا عقب ذلك بقوله تعالى \"وكان الله عليما \"أي بضمائر السرائر \"حليما \"أي يحلم ويغفر."
    },
    {
      "ayah": 52,
      "surah": 33,
      "text": "ذكر غير واحد من العلماء كابن عباس ومجاهد والضحاك وقتادة وابن زيد وابن جرير وغيرهم أن هذه الآية نزلت مجازاة لأزواج النبي صلى الله عليه وسلم ورضا عنهن على حسن صنيعهن في اختيارهن الله ورسوله والدار الآخرة لما خيرهن رسول الله صلى الله عليه وسلم كما تقدم في الآية فلما اخترن رسول الله صلى الله عليه وسلم كان جزائهن أن الله تعالى قصره عليهن وحرم عليه أن يتزوج بغيرهن أو يستبدل بهن أزواجا غيرهن ولو أعجبه حسنهن إلا الإماء والسراري فلا حرج عليه فيهن ثم إنه تعالى رفع عنه الحرج في ذلك ونسخ حكم هذه الآية وأباح له التزوج ولكن لم يقع منه بعد ذلك تزوج لتكون المنة لرسول الله صلى الله عليه وسلم عليهن قال الإمام أحمد حدثنا سفيان عن عمرو عن عطاء عن عائشة رضي الله عنها قالت ما مات رسول الله صلى الله عليه وسلم حتي أحل الله له النساء ورواه أيضا من حديث ابن جريج عن عطاء عن عبيد بن عمير عن عائشة ورواه الترمذي والنسائي في سننيهما وقال ابن أبي حاتم حدثنا أبو زرعة حدثنا عبد الرحمن بن عبد الملك بن شيبة حدثني عمر بن أبي بكر حدثني المغيرة بن عبد الرحمن الخزاعي عن أبي النضر مولى عمر بن عبد الله بن وهب بن زمعة عن أم سلمة أنها قالت: لم يمت رسول الله صلى الله عليه وسلم حتى أحل الله له أن يتزوج من النساء ما شاء إلا ذات محرم وذلك قول الله تعالى \"ترجي من تشاء منهن \"الآية فجعلت هذه ناسخة للتي بعدها في التلاوة كأيتي عدة الوفاة في البقرة الأولى ناسخة للتي بعدها والله أعلم وقال آخرون بل معنى الآية \"لا يحل لك النساء من بعد \"أي ن بعد ما ذكرنا لك من صفة النساء اللاتي أحللنا لك من نسائك اللاتي آتيت أجورهن وما ملكت يمينك وبنات العم والعمات والخال والخالات والواهبة وما سوى ذلك من أصناف النساء فلا يحل لك وهذا ما روي عن أبى بن كعب ومجاهد في رواية عنه وعكرمة والضحاك في رواية وأبي رزين في رواية عنه وأبي صالح والحسن وقتادة في رواية والسدي وغيرهم قال ابن جرير حدثنا يعقوب حدثنا ابن علية عن داود بن أبي هند حدثني محمد بن أبي موسى عن زياد عن رجل من الأنصار قال قلت لأبي بن كعب أرأيت لو أن أزواج النبي صلى الله عليه وسلم توفين أما كان له أن يتزوج؟ فقال وما يمنعه من ذلك؟ قال قلت قول الله تعالى \"لا يحل لك النساء من بعد \"فقال إنما أحل الله له ضربا من النساء فقال تعالى \"يا أيها النبي إنا أحللنا لك أزواجك \"إلى قوله تعالى \"إن وهبت نفسها للنبي \"ثم قيل له \"لا يحل لك النساء من بعد \"ورواه عبد الله بن أحمد من طرق عن داود به وروى الترمذي عن ابن عباس قال نهي رسول الله صلى الله عليه وسلم عن أصناف النساء إلا ما كان من المؤمنات المهاجرات بقوله تعالى \"لا يحل لك النساء من بعد ولا أن تبدل بهن من أزواج ولو أعجبك حسنهن إلا ما ملكت يمينك \"فأحل الله فتياتكم المؤمنات وامرأة مؤمنة إن وهبت نفسها للنبي وحرم كل ذات دين غير الإسلام ثم قال \"ومن يكفر بالإيمان فقد حبط عمله \"الآية وقال تعالى \"يا أيها النبي إنا أحللنا لك أزواجك اللاتي آتيت أجورهن \"إلى قوله تعالى \"خالصة لك من دون المؤمنين \"وحرم ما سوى ذلك من أصناف النساء وقال مجاهد \"لا يحل لك النساء من بعد \"أي من بعد ما سمى لك من مسلمة ولا يهودية ولا نصرانية ولا كافرة وقال أبو صالح \"لا يحل لك من النساء بعد \"أمر أن لا يتزوج أعرابية ولا عربية ويتزوج بعد من نساء تهامة ونساء من بنات العم والعمة والخال والخالة إن شاء ثلاث مائة وقال عكرمة \"لا يحل لك النساء من بعد \"أي إلي سمى الله واختار ابن جرير رحمه الله أن الآية عامة فيمن ذكر من أصناف النساء وفي النساء اللواتي في عصمته وكن تسعة وهذا الذي قاله جيد ولعله مراد كثير ممن حكينا عنه من السلف فإن كثيرا منهم روى عنه هذا وهذا ولا منافاة والله أعلم ثم أورد ابن جرير على نفسه ما روي أن رسول الله صلى الله عليه وسلم طلق حفصة ثم راجعها وعزم على فراق سودة حتى وهبت يومها لعائشة ثم أجاب بأن هذا كان قبل نزول قوله تعالى \"لا يحل لك النساء من بعد ولا أن تبدل بهن من أزواج \"الآية وهذا الذي قال من أن هذا كان قبل نزول الآية صحيح ولكن لا يحتاج إلى ذلك فإن الآية إنما دلت على أنه لا يتزوج بمن عدا اللواتي في عصمته وأنه لا يستبدل بهن غيرهن ولا يدل ذلك على أنه لا يطلق واحدة منهن من غير استدال فالله أعلم فأما قضية سودة ففي الصحيح عن عائشة رضي الله تبارك وتعالى عنها وهي سبب نزول قوله تعالى \"وإن امرأة خافت من بعلها نشوزا أو إعراضا فلا جناح عليهما أن يصلحا بينهما صلحا \"الآية وأما قضية حفصة فروى أبو داود والنسائي وابن ماجه وابن حبان في صحيحه من طرق عن يحيى بن زكريا بن أبي زائدة عن صالح بن صالح بن حيي عن سلمة أن بن كحيل عن سعيد بن جبير عن ابن عباس عن عمر أن رسول الله صلى الله عليه وسلم طلق حفصة ثم راجعها وهذا إسناد قوي وقال الحافظ أبو يعلى حدثنا أبو كريب حدثنا يونس بن بكير عن الأعمش عن أبي صالح عن ابن عمر قال: دخل عمر على حفصة وهي تبكي فقال ما يبكيك؟ لعل رسول الله صلى الله عليه وسلم طلقك إنه كان طلقك مرة ثم راجعك من أجلي والله لئن كان طلقك مرة أخرى لا أكلمك أبدا ورجاله على شرط الصحيحين وقوله تعالى \"ولا أن تبدل بهن من أزواج ولو أعجبك حسنهن \"فنهاه عن الزيادة عليهن إن طلق واحدة منهن واستبدال غيرها بها إلا ما ملكت يمينه وقد روى الحافظ أبو بكر البزار حديث مناسبا ذكره ههنا فقال حدثنا إبراهيم بن نصر حدثنا مالك بن إسماعيل ثنا عبد السلام بن حرب عن إسحاق بن عبد الله القرشي عن زيد بن أسلم عن عطاء بن يسار عن أبي هريرة قال: كان البدل في الجاهلية أن يقول الرجل للرجل بادلني امرأتك وأبادلك بامرأتي أي تنزل لي عن امرأتك وأنزل لك عن امرأتي فأنزل الله \"ولا أن تبدل بهن من أزواج ولو أعجبك حسنهن \"قال فدخل عيينة بن حصن الفزاري على النبي صلى الله عليه وسلم وعنده عائشة فدخل بغير إذن فقال له رسول الله صلى الله عليه وسلم فأين الاستئذان؟ فقال يا رسول الله ما استأذنت على رجل من مضر منذ أدركت ثم قال من هذه الحميراء إلى جنبك؟ فقال رسول الله صلى الله عليه وسلم هذه عائشة أم المؤمنين قال أفلا أنزل لك عن أحسن الخلق؟ قال يا عيينة إن الله قد حرم ذلك فلما أن خرج قالت عائشة من هذا؟ قال هذا أحمق مطاع لأنه على ما ترين لسيد قومه ثم قال البزار: إسحاق بن عبد الله لين الحديث جدا وإنما ذكرناه لأنا لم نحفظه إلا من هذا الوجه وبينا العلة فيه."
    },
    {
      "ayah": 53,
      "surah": 33,
      "text": "هذه آية الحجاب وفيها أحكام وآداب شرعية وهى مما وافق تنزيلها قول عمر بن الخطاب رضي الله عنه كما ثبت ذلك في الصحيحين عنه أنه قال وافق ربي عز وجل في ثلات قلت يا رسول الله لو اتخذت من مقام إبراهيم مصلى فأنزل الله تعالى \"واتخذوا من مقام إبراهيم مصلي \"وقلت يا رسول الله إن نساءك يدخل عليهن البر والفاجر فلو حجبتهن فأنزل الله آية الحجاب وقلت لأزواج النبي صلى الله عليه وسلم لما تمالأن عليه في الغيرة \"عسى ربه إن طلقكن أن يبدله أزواجا خيرا منكن \"فنزلت كذلك وفي رواية لمسلم ذكر أسارى بدر وهي قضية رابعة وقد قال البخاري حدثنا مسدد عن يحيى عن حميد أن أنس بن مالك قال: قال عمر بن الخطاب يا رسول الله يدخل عليك البر والفاجر فلو أمرت أمهات المؤمنين بالحجاب فأنزل الله آية الحجاب وكان وقت نزولها في صبيحة عرس رسول الله صلى الله عليه وسلم بزينب بنت جحش التي تولى الله تعالى تزويجها بنفسه وكان ذلك في ذي القعدة من السنة الخامسة في قول قتادة والواقدي وغيرهما وزعم أبو عبيدة معمر بن المنى وخليفة بن خياط أن ذلك كان في سنة ثلاث فالله أعلم قال البخاري حدثنا محمد بن عبد الله الرقاشي حدثنا معتمر بن سليمان سمعت أبي حدثنا أبو مجلز عن أنس بن مالك رضي الله عنهما قال: لما تزوج رسول الله صلى الله عليه وسلم زينب بنت جحش دعا القوم فطعموا ثم جلسوا يتحدثون فإذا هو يتهيأ للقيام فلم يقوموا فلما رأى ذلك قام فلما قام قام من قام وقعد ثلاثة نفر فجاء النبي صلى الله عليه وسلم ليدخل فإذا القوم جلوس ثم إنهم قاموا فانطلقوا فجئت فأخبرت النبي صلى الله عليه وسلم أنهم قد انطلقوا فجاء حتى دخل فذهبت أدخل فألقي الحجاب بيني وبينه فأنزل الله تعالى \"يا أيها الذين آمنوا لا تدخلوا بيوت النبي إلا أن يؤذن لكم إلى طعام غير ناظرين إناه ولكن إذا دعيتم فادخلوا فإذا طعمتم فانتشروا \"الآية وقد رواه أيضا في موضع آخر ومسلم والنسائي من طرق عن معتمر بن سليمان به ثم رواه البخاري منفردا به من حديث أيوب عن أبي قلابة عن أنس رضي الله عنه بنحوه ثم قال حدثنا أبو معمر حدثنا عبد الوارث حدثنا عبد العزيز بن صهيب عن أنس بن مالك قال: بنى النبي صلى الله عليه وسلم بزينب بنت جحش بخبز ولحم فأرسلت على الطعام داعيا فيجيء قوم فيأكلون ويخرجون ثم يجيء قوم فيقولون ويخرجون فدعوت حتى ما أجد أحدا أدعوه فقلت يا رسول الله ما أجد أحدا أدعوه قال ارفعوا طعامكم وبقي ثلاثة رهط يتحدثون في البيت فخرج النبي صلى الله عليه وسلم فانطلق إلى حجرة عائشة رضي الله عنها لا فقال السلام عليكم أهل البيت ورحمة الله وبركاته قالت وعليك السلام ورحمة الله كيف وجدت أهلك يا رسول الله بارك الله لك؟ فتقرى حجر نسائه كلهن يقول لهن كما يقول لعائشة ويقلن له كما قالت عائشة ثم رجع النبي صلى الله عليه وسلم فإذا ثلاثة رهط في البيت يتحدثون وكان النبي صلى الله عليه وسلم شديد الحياء فخرج منطلقا نحو حجرة عائشة فما أدري أخبرته أم أخبر أن القوم خرجوا فرجع حتى إذا وضع رجله في أسكفة الباب داخله والأخرى خارجه أرخى الستر بيني وبينه وأنزلت آية الحجاب انفرد به البخاري من بين أصحاب الكتب الستة سوى النسائي في اليوم والليلة من حديث عبد الوارث سم رواه عن إسحاق هو ابن منصور عن عبد الله بن بكير السهمي عن حميد عن أنس بنحو ذلك وقال رجلان انفرد به من هذا الوجه وقد تقدم في إفراد مسلم من حديث سليمان بن المغيرة عن ثابت عن أنس وقال ابن أبي حاتم حدثنا أبي حدثنا أبو المغفر حدثنا جعفر بن سليمان عن الجعد أبي عثمان اليشكري عن أنس بن ما لك قال: أعرس رسول الله صلى الله عليه وسلم ببعض نسائه فصنعت أم سليم حيسا ثم جعلته في تور فقالت اذهب بهذا إلى رسول الله صلى الله عليه وسلم وأقرئه مني السلام وأخبره أن هذا منا له قليل قال أنس والناس يومئذ في جهد فجئت به فقلت يا رسول الله بعثت بهذا أم سليم إليك وهي تقرئك السلام وتقول أخبره أن هذا منا له قليل فنظر إليه قال ضعه فوضعته في ناحية البيت ثم قال اذهب فادع فلانا وفلانا فسمى رجالا كثيرا وقال ومن لقيت من المسلمين فدعوت من قال ومن لقيت من المسلمين فجئت والبيت والصفة والحجرة ملأى من الناس فقلت يا أبا عثمان كم كانوا؟ فقال كانوا زهاء ثلاث مائه قال أنس فقال لي رسول الله صلى الله عليه وسلم جيء به فجئت به إليه فوضع يده عليه ودعا وقال ما شاء الله ثم قال ليتحلق عشرة عشرة وليسموا وليأكل كل إنسان مما يليه فجعلوا يسمون ويأكلون حتى أكلوا كلهم فقال لي رسول الله صلى الله عليه وسلم ارفعه قال فجئت فأخذت التور فنظرت فيه فما أدري أهو حين وضعت أكثر أم حين أخذت قال وتخلف رجال يتحدثون في بيت رسول الله صلى الله عليه وسلم وزوج رسول الله صلى الله عليه وسلم التي دخل بها معهم مولية وجهها إلى الحائط فأطالوا الحديث فشقوا على رسول الله صلى الله عليه وسلم وكان أشد الناس حياء ولو أعلموا كان ذلك عليهم عزيزا فقام رسول الله صلى الله عليه وسلم على حجره وعلى نسائه فلما رأوه قد جاء ظنوا أنهم قد ثقلوا عليه ابتدروا الباب فخرجوا وجاء رسول الله صلى الله عليه وسلم حتى أرخى الستر ودخل البيت وأنا في الحجرة فمكث رسول الله صلى الله عليه وسلم في بيته يسيرا وأنزل الله عليه القرآن فخرج وهو يتلو هذه الآية \"يا أيها الذين آمنوا لا تدخلوا بيوت النبي \"الآيات قال أنس فقرأهن علي قبل الناس فأنا أحدث الناس بهن عهدا وقد رواه مسلم والترمذي والنسائي جميعا عن قتيبة عن جعفر بن سليمان به وقال الترمذي حسن صحيح وعلقه البخاري في كتاب النكاح فقال: وقال إبراهيم بن طهمان عن الجعد أبي عثمان عن أنس فذكر نحوه ورواه مسلم أيضا عن محمد بن رافع عن عبد الرزاق عن عمر عن الجعد به وقد روى هذا الحديث عبد الله بن المبارك عن شريك عن بيان بن بشر عن أنس بنحوه ورواه البخاري والترمذي من طريقين آخرين عن بيان بن بشر الأحمسي الكوفي عن أنى بنحوه ورواه ابن أبي حاتم أيضا من حديث أبي نضرة العبدي عن أنس بن مالك بنحو ذلك ولم يخرجوه ورواه ابن جرير من حديث عمرو بن سعيد ومن حديث الزهري عن أنس بنحو ذلك وقال الإمام أحمد حدثنا بهز وهاشم بن القاسم قالا حدثنا سليمان بن المغيرة عن ثابت عن أنس قال لما انقضت عدة زينب قال رسول الله صلى الله عليه وسلم لزيد اذهب فاذكرها على قال فانطلق زيد حتى أتاها قال تخمر عجينها فلما رأيتها عظمت في صدري وذكر تمام الحديث كما قدمناه عند قوله تعالى \"فلما قضى زيد منها وطرا \"وزاد في آخره بعد قوله: ووعظ القوم بما وعظوا به قال هاشم في حديثه \"لا تدخلوا بيوت النبي إلا أن يؤذن لكم \"الآية وفد أخرجه مسلم والنسائي من حديث جعفر بن سليمان به وقال ابن جرير حدثني أحمد بن عبد الرحمن بن أخي ابن وهب حدثني عمي عبد الله بن وهب حدثني يونس عن الزهري عن عروة عن عائشة قالت: إن أزواج النبي صلى الله عليه وسلم كن يخرجن بالليل إذا تبرزن إلى المناصع وهو صعيد أفيح وكان عمر يقول لرسول الله صلى الله عليه وسلم احجب نساءك فلم يكن رسول الله صلى الله عليه وسلم ليفعل فخرجت سودة بنت زمعة زوج رسول الله صلى الله عليه وسلم وكانت امرأة طويلة فناداها عمر بصوته الأعلى: قد عرفناك يا سودة حرصا على أن ينزل الحجاب قالت فأنزل الله الحجاب هكذا وقع في هذه الرواية والمشهور أن هذا كان بعد نزول الحجاب كما رواه الإمام أحمد والبخاري ومسلم من حديث هشام بن عروة عن أبيه عن عائشة رضي الله عنها قالت: خرجت سودة بعد ما ضرب الحجاب لحاجتها وكانت امرأة جسيمة لا تخفى على من يعرفها فرأها عمر بن الخطاب فقال يا سودة أما والله ما تخفين علينا فانظري كيف تخرجين قالت فانكفأت راجعة ورسول الله صلى الله عليه وسلم في بيتي وإنه ليتعشى وفي يده عرق فدخلت فقلت يا رسول الله إنى خرجت لبعض حاجتي فقال لي عمر كذا وكذا قالت فأوحى الله إليه ثم رفع عنه وإن العرق في يده ما وضعه فقال إنه قد أذن لكن أن تخرجن لحاجتكن لفظ البخاري فقوله تعالى \"لا تدخلوا بيوت النبي \"حظر على المؤمنين أن يدخلوا منازل رسول الله صلى الله عليه وسلم بغير إذن كما كانوا قبل ذلك يصنعون في بيوتهم في الجاهلية وابتداء الإسلام حتى غار الله لهذه الأمة فأمرهم بذلك وذلك من إكرامه تعالى هذه الأمة ولهذا قال رسول الله صلى الله عليه وسلم إياكم والدخول على النساء الحديث ثم استثنى من ذلك فقال تعالى \"إلا أن يؤذن لكم إلى طعام غير ناظرين إناه \"قال مجاهد وقتادة وغيرهما أي غير متحينين نضجه واستواءه أي لا ترقبوا الطعام إذا طبخ حتى إذا قارب الاستواء تعرضتم للدخول فإن هذا مما يكرهه الله ويذمه وهذا دليل على تحريم التطفيل وهو الذي تسميه العرب الضيفان وقد صنف الخطيب البغدادي في ذلك كتابا في ذم الطفيلين وذكر من أخبارهم أشياء يطول إيرادها ثم قال تعالى \"ولكن إذا دعيتم فادخلوا فإذا طعمتم فانتشروا \"وفي صحيح مسلم عن ابن عمر رضي الله عنها قال: قال رسول الله صلى الله عليه وسلم إذا دعا أحدكم أخاه فليجب عرسا كان أو غيره وأصله في الصحيحين وفي الصحيح أيضا عن رسول الله صلى الله عليه وسلم لو دعيت إلى ذراع لأجبت ولو أهدى إلى كراع لقبلت فإذا فرغتم من الذي دعيتم إليه فخففوا عن أهل المنزل وانتشروا في الأرض ولهذا قال تعالى \"ولا مستأنسين لحديث \"أي كما وقع لأولئك النفر الثلاثة الذين استرسل بهم الحديث ونسوا أنفسهم حتى شق ذلك على رسول الله كما قال تعالى \"إن ذلكم كان يؤذي النبي فيستحي منكم \"وقيل المراد إن دخولكم منزله بغير إذنه كان يشق عليه ويتأذى به ولكن كان يكره أن ينهاهم عن ذلك من شدة حيائه عليه السلام حتى أنزل الله علم النهي عن ذلك ولهذا قال تعالى \"والله لا يستحى من الحق \"أي وكما نهيتكم عن ذلك وزجركم عنه ثم قال تعالى \"وإذا سألتموهن متاعا فاسألوهن من وراء حجاب \"أي وكما نهيتكم عن الدخول عليهن كذلك لا تنظروا إليهن بالكلية ولو كان لأحدكم حاجة يريد تناولها منهن فلا ينظر إليهن ولا يسألهن حاجة إلا من وراء حجاب وقال ابن أبي حاتم حدثنا أبي حدثنا ابن أبي عمر حدثنا سفيان عن مسعر عن موسى بن أبي كثير عن مجاهد عن عائشة قالت: كنت آكل مع النبي صلى الله عليه وسلم حيسا في قعب فمر عمر فدعاه فأكل فأصاب أصبعه أصبعي فقال حسن أو أوه لو أطاع فيكن ما رأتكن عين فنزل الحجاب \"ذلكم أطهر لقلوبكم وقلوبهن \"أي هذا الذي أمرتكم به وشرعته لكم من الحجاب أطهر وأطيب وقوله تعالى \"وما كان لكم أن تؤذوا رسول الله ولا أن تنكحوا أزواجه من بعده أبدا إن ذلكم كان عند الله عظيما \"قال ابن أبي حاتم حدثنا علي بن الحسين حدثنا محمد بن أبي حماد حدثنا مهران عن سفيان عن داود بن هند عن عكرمة عن ابن عباس في قوله تعالى \"وما كان لكم أن تؤذوا رسول الله \"قال نزلت في رجل هم أن يتزوج بعض نساء النبي صلى الله عليه وسلم بعده قال رجل لسفيان أهي عائشة؟ قال قد ذكروا ذلك وكذا قال مقاتل بن حيان وعبد الرحمن بن زيد بن أسلم وذكر بسنده عن السدي أن الذي عزم على ذلك طلحة بن عبيد الله رضي الله عنه حتى نزل التنبيه على تحريم ذلك ولهذا أجمع العلماء قاطبة على أن من توفى عنها رسول الله صلى الله عليه وسلم من أزواجه أنه يحرم على غيره تزوجها من بعده لأنهن أزواجه في الدنيا والآخرة وأمهات المؤمنين كما تقدم واختلفوا فيمن دخل بها ثم طلقها في حياته هل يحل لغيره أن يتزوجها؟ على قولين مأخذهما هل دخلت هذه في عموم قوله \"من بعده \"أم لا فأما من تزوجها ثم طلقها قبل أن يدخل بها فما نعلم في حلها لغيره والحالة هذه نزاعا والله أعلم وقال ابن جرير حدثني محمد بن المثنى حدثنا عبد الوهاب حدثنا داود عن عامر أن نبي الله صلى الله عليه وسلم مات وقد ملك قيلة ابنة الأشعث يعني ابن قيس زوجها عكرمة بن أبي جهل بعد ذلك فشق ذلك على أبي بكر مشقة شديدة فقال له عمر يا خليفة رسول الله إنها ليست من نسائه إنها لم يخيرها رسول الله صلى الله عليه وسلم ولم يحجبها وقد برأها الله منه بالردة التي ارتدت مع قومها قال فاطمأن أبو بكر رضي الله عنه عنه وسكن وقد عظم الله تبارك وتعالى ذلك وشدد فيه وتوعد عليه بقوله \"إن ذلكم كان عند الله عظيما \"."
    },
    {
      "ayah": 54,
      "surah": 33,
      "text": "ثم قال \"إن تبدوا شيئا أو تخفوه فإن الله كان بكل شيء عليما \"أي مهما تكنه ضمائركم وتنطوي عليه سرائركم فإن الله يعلمه فإنه لا تخفى عليه خافية \"يعلم خائنة الأعين وما تخفي الصدور \"."
    },
    {
      "ayah": 55,
      "surah": 33,
      "text": "لما أمر تبارك وتعالى النساء بالحجاب من الأجانب بين أن هؤلاء الأقارب لا يجب الاحتجاب منهم كما استثناهم في سورة النور عند قوله تعالى \"ولا يبدين زينتهن إلا لبعولتهن أو آبائهن أو آباء بعولتهن أو أبنائهن أو أبناء بعولتهن أو إخوانهن أو بني أخواتهن أو نسائهن أو ما ملكت أيمانهن أو التابعين غير أولي الإربة من الرجال أو الطفل الذين لم يظهروا على عورات النساء \"وفيها زيادات على هذه وقد تقدم تفسيرها والكلام عليها بما أغنى عن إعادته ههنا وقد سأل بعض السلف فقال: لم لم يذكر العم والخال في هاتين الآيتين؟ فأجاب عكرمة والشعبي بأنهما لم يذكرا لأنهما قد يصفان ذلك لبنيهما قال ابن جرير حدثني محمد بن المثنى حدثنا حجاج بن منهال حدثنا حماد حدثنا داود عن الشعبي وعكرمة في قوله تعالى: \"لا جناح عليهن في آبائهن \"الآية قلت ما شأن العم والخال لم يذكرا؟ قال لأنهما ينعتانها لأبنائهما وكرها أن تضع خمارها عند خالها وعمها وقوله تعالى: \"ولا نسائهن \"يعني بذلك عدم الاحتجاب من النساء المؤمنات وقوله تعالى \"وما ملكت أيمانهن \" يعني به أرقاءهن من الذكور والإناث كما تقدم التنبيه عليه وإيراد الحديث فيه قال سعيد بن المسيب إنما يعني به الإماء فقط رواه ابن أبي حاتم وقوله تعالى: \"واتقين الله إن الله كان على كل شيء شهيدا \"أي واخشينه في الخلوة والعلانية فإنه شهيد على كل شي لا تخفى عليه خافية فراقبن الرقيب."
    },
    {
      "ayah": 56,
      "surah": 33,
      "text": "إن الله وملائكته يصلون على النبي يا أيها الذين آمنوا صلوا عليه وسلمواقال البخاري : قال أبو العالية صلاة الله تعالى ثناؤه عليه عند الملائكة , صلاة الملائكة الدعاء , وقال ابن عباس : يصلون يبركون هكذا علقه البخاري عنهما وقد رواه أبو جعفر الرازي عن الربيع بن أنس عن أبي العالية كذلك وروي مثله عن الربيع أيضا وروى علي بن أبى طلحة عن ابن عباس كما قاله سواء رواهما ابن أبي حاتم وقال أبو عيسى الترمذي وروي عن سفيان الثوري وغير واحد من أهل العلم قالوا : صلاة الرب الرحمة وصلاة الملائكة الاستغفار ثم قال ابن أبي حاتم حدثنا عمرو الأودي حدثنا وكيع عن الأعمش عن عمرو بن مرة قال الأعمش أراه عن عطاء بن أبي رباح \" إن الله وملائكته يصلون على النبي \" قال صلاته تبارك وتعالى سبوح قدوس سبقت رحمتي غضبي والمقصود من هذه الآية أن الله سبحانه وتعالى أخبر عباده بمنزلة عبده ونبيه عنده في الملأ الأعلى بأنه يثني عليه عند الملائكة المقربين وأن الملائكة تصلي عليه ثم أمر تعالى أهل العالم السفلي بالصلاة والتسليم عليه ليجتمع الثناء عليه من أهل العالمين العلوي والسفلي جميعا وقد قال ابن أبي حاتم حدثنا علي بن الحسين حدثنا أحمد بن عبد الرحمن حدثني أبي عن أبيه عن أشعث بن إسحاق عن جعفر يعني ابن المغيرة عن سعيد بن جبير عن ابن عباس أن بني إسرائيل قالوا لموسى عليه السلام هل يصلي ربك ؟ فناداه ربه عز وجل : يا موسى سألوك هل يصلي ربك فقل نعم أنا أصلي وملائكتي على أنبيائي ورسلي فأنزل الله عز وجل على نبيه صلى الله عليه وسلم \" إن الله وملائكته يصلون على النبي يا أيها الذين آمنوا صلوا عليه وسلموا تسليما\" وقد أخبر سبحانه وتعالى بأنه يصلي على عباده المؤمنين في قوله تعالى \" يا أيها الذين آمنوا اذكروا الله ذكرا كثيرا وسبحوه بكرة وأصيلا هو الذي يصلي عليكم وملائكته \" الآية وقال تعالى : \" وبشر الصابرين الذين إذا أصابتهم مصيبة قالوا إنا لله وإنا إليه راجعون أولئك عليهم صلوات من ربهم \" الآية وفي الحديث إن الله وملائكته يصلون على ميامن الصفوف وفي الحديث الآخر اللهم صل على آل أبي أوفى وقال رسول الله صلى الله عليه وسلم لامرأة جابر وقد سألته أن يصلي عليها وعلى زوجها صلى الله عليك وعلى زوجك وقد جاءت الأحاديث المتواترة عن رسول الله صلى الله عليه وسلم بالأمر بالصلاة عليه وكيفية الصلاة عليه ونحن نذكر منها إن شاء الله ما تيسر والله المستعان قال البخاري عند تفسير هذه الآية حدثنا سعيد بن يحيى بن سعيد أخبرنا أبي عن مسعر عن الحكم عن ابن أبي ليلى عن كعب بن عجرة قال : قيل يا رسول الله أما السلام عليك فقد عرفناه فكيف الصلاة ؟ قال قولوا اللهم صل على محمد وعلى آل محمد كما صليت على آل إبراهيم إنك حميد مجيد اللهم بارك على محمد وعلى آل محمد كما باركت على آل إبراهيم إنك حميد مجيد وقال الإمام أحمد حدثنا محمد بن جعفر حدثنا شعبة عن الحكم قال : سمعت ابن أبي ليلى قال لقيني كعب بن عجرة فقال ألا أهدي لك هدية ؟ خرج علينا رسول الله صلى الله عليه وسلم فقلنا يا رسول الله قد علمنا أو عرفنا كيف السلام عليك فكيف الصلاة ؟ فقال قولوا اللهم صل على محمد وعلى آل محمد كما صليت على آل إبراهيم إنك حميد مجيد اللهم بارك على محمد وعلى آل محمد كما باركت على آل إبراهيم إنك حميد مجيد وهذا الحديث قد أخرجه الجماعة في كتبهم من طرق متعددة عن الحكم وهو ابن عتيبة زاد البخاري وعبد الله بن عيسى كلاهما عن عبد الرحمن بن أبي ليلى فذكرهم وقال ابن أبي حاتم حدثنا الحسين بن عرفة حدثنا هشيم بن بشير عن يزيد بن أبي زياد حدثنا عبد الرحمن بن أبي ليلى عن كعب بن عجرة قال لما نزلت \" إن الله وملائكته يصلون على النبي يا أيها الذين آمنوا صلوا عليه وسلموا تسليما \" قال : قلنا يا رسول الله قد علمنا السلام عليك فكيف الصلاة عليك ؟ قال قولوا اللهم صل على محمد وعلى آل محمد كما صليت على إبراهيم وعلى آل إبراهيم إنك حميد مجيد وبارك على محمد كما باركت على إبراهيم وعلى آل إبراهيم إنك حميد مجيد وكان عبد الرحمن بن أبي ليلى يقول وعلينا معهم ورواه الترمذي بهذه الزيادة ومعنى قولهم أما السلام عليك فقد عرفناه هو الذي في التشهد الذي كان يعلمهم إياه كما كان يعلمهم السورة من القرآن وفيه السلام عليك أيها النبي ورحمة الله وبركاته\" حديث آخر \" قال البخاري حدثنا عبد الله بن يوسف حدثنا الليث عن ابن الهاد عن عبد الله بن خباب عن أبي سعيد الخدري رضي الله عنه قال : قلنا يا رسول الله هذا السلام فكيف نصلي عليك : قال قولوا اللهم صل على محمد عبدك ورسولك كما صليت على آل إبراهيم وبارك على محمد وعلى آل محمد كما باركت على آل إبراهيم قال أبو صالح عن الليث : على محمد وعلى آل محمد كما باركت على آل إبراهيم حدثنا إبراهيم بن حمزة حدثنا ابن أبى حازم عن يزيد يعني ابن الهاد وقال كما صليت على إبراهيم وبارك على محمد وآل محمد كما باركت على إبراهيم وآل إبراهيم وأخرجه النسائي من حديث ابن الهاد به \" حديث آخر \" قال الإمام أحمد قرأت على عبد الرحمن مالك عن عبد الله بن أبي بكر عن أبيه عن عمرو بن سليم أنه قال أخبرني أبو حميد الساعدي أنهم قالوا يا رسول الله كيف نصلي عليك قال قولوا اللهم صل على محمد وأزواجه وذريته كما صليت على إبراهيم وبارك على محمد وأزواجه وذريته كما باركت على آل إبراهيم إنك حميد مجيد وقد أخرجه بقية الجماعة سوى الترمذي من حديث مالك به \" حديث آخر \" قال مسلم حدثنا يحيى بن يحيى التميمي قال : قرأت على مالك عن نعيم بن عبد الله المجمر أخبرني محمد بن عبد الله بن زيد الأنصاري قال وعبد الله بن زيد هو الذي كان أري النداء بالصلاة أخبره عن أبي مسعود الأنصاري قال : أتانا رسول الله صلى الله عليه وسلم ونحن في مجلس سعد بن عبادة فقال له بشير بن سعد أمرنا الله أن نصلي عليك يا رسول الله فكيف نصلي عليك ؟ قال فسكت رسول الله صلى الله عليه وسلم حتى تمنينا أنه لم يسأله ثم قال رسول الله صلى الله عليه وسلم قولوا اللهم صل على محمد وعلى آل محمد كما صليت على آل إبراهيم وبارك على محمد وعلى آل محمد كما باركت على آل إبراهيم في العالمين إنك حميد مجيد والسلام كما قد علمتم وقد رواه أبو داود والترمذي والنسائي وابن جرير من حديث مالك به وقال الترمذي حسن صحيح وروى الإمام أحمد وأبو داود والنسائي وابن خزيمة وابن حبان والحاكم في مستدركه من حديث محمد بن إسحاق عن محمد بن إبراهيم التيمي عن محمد بن عبد الله بن زيد بن عبد ربه عن أبى مسعود البدري أنهم قالوا يا رسول الله أما السلام فقد عرفناه فكيف نصلي عليك إذا نحن صلينا في صلاتنا فقال قولوا اللهم صل على محمد وعلى آل محمد وذكره ورواه الشافعي رحمه الله في مسنده عن أبي هريرة بمثله ومن ههنا ذهب الشافعي رحمه الله إلى أنه يجب على المصلي أن يصلي على رسول الله صلى الله عليه وسلم في التشهد الأخير فإن تركه لم تصح صلاته وقد شرع بعض المتأخرين من المالكية وغيرهم يشنع على الإمام الشافعي في اشتراطه ذلك في الصلاة ويزعم أنه قد تفرد بذلك وحكى الإجماع على خلافه أبو جعفر الطبري والطحاوي والخطابي وغيرهم فيما نقله القاضي عياض عنهم وقد تعسف هذا القائل في رده على الشافعي وتكلف في دعواه الإجماع في ذلك وقال ما لم يحط به علما فإنا قد روينا وجوب ذلك والأمر بالصلاة على رسول الله صلى الله عليه وسلم في الصلاة كما هو ظاهر الآية ومفسر بهذا الحديث عن جماعة من الصحابة منهم ابن مسعود وأبو مسعود البدري وجابر بن عبد الله ومن التابعين الشعبي وأبو جعفر الباقر ومقاتل بن حيان وإليه ذهب الشافعي لا خلاف عنه في ذلك ولا بين أصحابه أيضا وإليه ذهب الإمام أحمد أخيرا فيما حكاه عنه ابن زرعة الدمشقي به وبه قال إسحاق بن راهويه والفقيه الإمام محمد بن إبراهيم المعروف بابن المواز المالكي رحمهم الله تعالى حتى إن بعض أئمة الحنابلة أوجب أن يقال في الصلاة عليه صلى الله عليه وسلم كما علمهم أن يقولوا لما سألوه وحتى أن بعض أصحابنا أوجب الصلاة على آله وممن حكاه البندنيجي وسليم الرازي وصاحبه نصر بن إبراهيم المقدسي ونقله إمام الحرمين وصاحبه الغزالي قولا عن الشافعي والصحيح أنه وجه على أن الجمهور على خلافه وحكوا الإجماع على خلافه وللقول بوجوبه ظواهر الحديث والله أعلم والغرض أن الشافعي رحمه الله يقول بوجوب الصلاة على النبي صلى الله عليه وسلم في الصلاة سلفا وخلفا كما تقدم ولله الحمد والمنة فلا إجماع على خلافه في هذه المسألة لا قديما ولا حديثا والله أعلم ومما يؤيد ذلك الحديث الآخر الذي رواه الإمام أحمد وأبو داود والترمذي وصححه والنسائي وابن خزيمة وابن حبان في صحيحيهما من رواية حيوة بن شريح المصري عن أبي هانئ حميد بن هانئ عن عمرو بن مالك أبي علي الحسيني عن فضالة بن عبيد رضي الله عنه قال سمع رسول الله صلى الله عليه وسلم رجلا يدعو في صلاته لم يمجد الله ولم يصل على النبي فقال رسول الله صلى الله عليه وسلم عجل هذا ثم دعاه فقال له أو لغيره إذا صلى أحدكم فليبدأ بتمجيد الله عز وجل والثناء عليه ثم ليصل على النبي ثم ليدع بعد بما شاء وكذا الحديث الذي رواه ابن ماجه من رواية عبد المهيمن بن عباس بن سهل بن سعد الساعدي عن أبيه عن جده عن رسول الله صلى الله عليه وسلم أنه قال لا صلاة لمن لا وضوء له ولا وضوء لمن لم يذكر اسم الله عليه ولا صلاة لمن لم يصل على النبي ولا صلاة لمن لم يحب الأنصار ولكن عبد المهيمن هذا متروك وقد رواه الطبراني من رواية أخيه أبي بن عباس ولكن في ذلك نظر وإنما يعرف من رواية عبد المهيمن والله أعلم \" حديث آخر \" قال الإمام أحمد حدثنا يزيد بن هارون أخبرنا إسماعيل عن أبي داود الأعمى عن بريدة قال : قلنا يا رسول الله قد علمنا كيف نسلم عليك فكيف نصلي عليك ؟ قال قولوا اللهم اجعل صلواتك ورحمتك وبركاتك على محمد وعلى آل محمد كما جعلتها على إبراهيم وآل إبراهيم إنك حميد مجيد أبو داود الأعمى اسمه نفيع بن الحارث متروك \" . حديث آخر \" موقوف رويناه من طريق سعيد بن منصور ويزيد بن هارون وزيد بن الحباب ثلاثتهم عن نوح بن قيس حدثنا سلامة الكندي أن عليا رضي الله عنه كان يعلم الناس هذا الدعاء اللهم داحي المدحوات وبارئ المسموكات وجبار القلوب على فطرتها شقيها وسعيدها اجعل شرائف صلواتك ونوامي بركاتك ورأفة تحننك على محمد عبدك ورسولك الفاتح لما أغلق والخاتم لما سبق والمعلن الحق بالحق والدامغ لجيشات الأباطيل كما حمل فاضطلع بأمرك بطاعتك مستوفزا في مرضاتك غير نكل في قدم ولا وهن في عزم واعيا لوحيك حافظا لعهدك ماضيا على نفاذ أمرك حتى أورى قبسا لقابس , آلاء الله تصل بأهله أسبابه به هديت القلوب بعد خوضات الفتن والإثم وأبهج موضحات الأعلام ونائرات الأحكام ومنيرات الإسلام فهو أمينك المأمون وخازن علمك المخزون وشهيدك يوم الدين وبعيثك نعمة ورسولك بالحق رحمة , اللهم أفسح له في عدنك واجزه مضاعفات الخير من فضلك مهنآت غير مكدرات من فوز ثوابك المحلول وجزيل عطائك الملول اللهم أعل على بناء الناس بناءه وأكرم مثواه لديك ونزله وأتمم له نوره واجزه من ابتعاثك له مقبول الشهادة مرضي المقالة ذا منطق عدل وخطة فصل . وحجة وبرهان عظيم هذا مشهور من كلام علي رضي الله عنه وقد تكلم عليه ابن قتيبة في مشكل الحديث وكذا أبو الحسن أحمد بن فارس اللغوي في جزء جمعه في فضل الصلاة على النبي صلى الله عليه وسلم إلا أن في إسناده نظرا قال شيخنا الحافظ أبو الحجاج المزي : سلامة الكندي هذا ليس بمعروف ولم يدرك عليا كذا قال وقد روى الحافظ أبو القاسم الطبراني هذا الأثر عن محمد بن علي الصائغ عن سعيد بن منصور حدثنا نوح بن قيس عن سلامة الكندي قال كان علي رضي الله عنه يعلمنا الصلاة على النبي صلى الله عليه وسلم فيقول اللهم داحي المدحوات وذكره . \" حديث آخر \" قال ابن ماجه حدثنا زياد عن عبد الله حدثنا المسعودي عن عون بن عبد الله عن أبي فاختة عن الأسود بن يزيد عن عبد الله بن مسعود رضي الله عنه قال إذا صليتم على رسول الله صلى الله عليه وسلم فأحسنوا الصلاة عليه فإنكم لا تدرون لعل ذلك يعرض عليه قال قالوا له علمنا قال قولوا : اللهم اجعل صلواتك ورحمتك وبركتك على سيد المرسلين وإمام المتقين وخاتم النبيين محمد عبدك ورسولك إمام الخير وقائد الخير ورسول الرحمة اللهم ابعثه مقاما محمودا يغبطه به الأولون والآخرون اللهم صل على محمد وعلى آل محمد كما صليت على إبراهيم وعلى آل إبراهيم إنك حميد مجيد اللهم بارك على محمد وعلى آل محمد كما باركت على إبراهيم وعلى آل إبراهيم إنك حميد مجيد وهذا موقوف وقد روى إسماعيل القاضي عن عبد الله بن عمرو أو عمر على الشك من الراوي قريبا من هذا \" حديث آخر \" قال ابن جرير حدثنا أبو كريب حدثنا مالك بن إسماعيل حدثنا أبو إسرائيل عن يونس بن خباب قال خطبنا بفارس فقال : \" إن الله وملائكته يصلون على النبي يا أيها الذين آمنوا صلوا عليه وسلموا تسليما\" فقال أنبأني من سمع ابن عباس يقول هكذا أنزل فقلنا أو قالوا يا رسول الله علمنا السلام عليك فكيف الصلاة عليك قال : اللهم صل على محمد وعلى آل محمد كما صليت على إبراهيم وآل إبراهيم إنك حميد مجيد وارحم محمدا وآل محمد كما رحمت آل إبراهيم إنك حميد مجيد وبارك على محمد وعلى آل محمد كما باركت على إبراهيم إنك حميد مجيد فيستدل بهذا الحديث من ذهب إلى جواز الترحم على النبي صلى الله عليه وسلم كما هو قول الجمهور ويعضده حديث الأعرابي الذي قال : اللهم ارحمني ومحمدا ولا ترحم معنا أحدا فقال رسول الله صلى الله عليه وسلم حجرت واسعا وحكى القاضي عياض عن جمهور المالكية منعه قال وأجازه أبو محمد بن أبي زيد \" حديث آخر \" قال الإمام أحمد حدثنا محمد بن جعفر أخبرنا شعبة عن عاصم بن عبيد الله قال : سمعت عبد الله بن عامر بن ربيعة يحدث عن أبيه قال سمعت النبي صلى الله عليه وسلم يقول من صلى علي صلاة لم تزل الملائكة تصلي عليه ما صلى علي فليقل عبد من ذلك أو ليكثر ورواه ابن ماجه من حديث شعبة به \" حديث آخر \" قال أبو عيسى الترمذي حدثنا بندار حدثنا محمد بن خالد بن عثمة حدثني موسى بن يعقوب الزمعي حدثني عبد الله بن كيسان أن عبد الله بن شداد أخبره عن عبد الله بن مسعود أن رسول الله صلى الله عليه وسلم قال أولى الناس بي يوم القيامة أكثرهم علي صلاة تفرد بروايته الترمذي رحمه الله ثم قال هذا حديث حسن غريب\" حديث آخر \" قال إسماعيل القاضي حدثنا علي بن عبد الله حدثنا سفيان عن يعقوب بن زيد بن طلحة قال : قال رسول الله صلى الله عليه وسلم أتاني آت من ربي فقال لي ما من عبد يصلي عليك صلاة إلا صلى الله عليه بها عشرا فقام إليه رجل فقال يا رسول الله ألا أجعل نصف دعائي لك ؟ قال إن شئت قال ألا أجعل ثلثي دعائي لك ؟ قال إن شئت قال ألا أجعل دعائي لك كله قال إذن يكفيك الله هم الدينا وهم الآخرة فقال شيخ كان بمكة يقال له منيع لسفيان عمن أسنده قال لا أدري\" حديث آخر \" قال إسماعيل القاضي حدثنا سعيد بن سلام العطار حدثنا سفيان الثوري عن عبد الله بن محمد بن عقيل عن الطفيل بن أبي بن كعب عن أبيه قال : كان رسول الله صلى الله عليه وسلم يخرج في جوف الليل فيقول جاءت الراجفة تتبعها الرادفة جاء الموت بما فيه فقال أبي يا رسول الله إني أصلي من الليل أفأجعل لك ثلث صلاتي ؟ قال رسول الله صلى الله عليه وسلم الشطر قال أفأجعل لك شطر صلاتي ؟ قال رسول الله صلى الله عليه وسلم الثلثان قال أفأجعل لك صلاتي كلها قال إذن يغفر الله ذنبك كله وقد رواه الترمذي بنحوه فقال حدثنا هناد حدثنا قبيصة حدثنا سفيان عن عبد الله بن محمد بن عقيل عن الطفيل بن أبي بن كعب عن أبيه قال : كان رسول الله صلى الله عليه وسلم إذا ذهب ثلثا الليل قام فقال يا أيها الناس اذكروا الله اذكروا الله جاءت الراجفة تتبعها الرادفة جاء الموت بما فيه جاء الموت بما فيه قال أبي قلت يا رسول الله إني أكثر الصلاة عليك فكم أجعل لك من صلاتي ؟ قال ما شئت قلت الربع قال ما شئت فإن زدت فهو خير لك قلت فالنصف قال ما شئت فإن زدت فهو خير لك قلت فالثلثين قال ما شئت فإن زدت فهو خير لك قلت أجعل لك صلاتي كلها قال إذن تكفى همك ويغفر لك ذنبك ثم قال هذا حديث حسن وقال الإمام أحمد حدثنا وكيع حدثنا سفيان عن عبد الله بن محمد بن عقيل عن الطفيل بن أبي عن أبيه قال : قال رجل يا رسول الله أرأيت إن جعلت صلاتي كلها عليك ؟ قال إذن يكفيك الله ما أهمك من دنياك وآخرتك \" حديث آخر \" قال الإمام أحمد حدثنا أبو سلمة منصور بن سلمة الخزاعي ويونس هو ابن محمد قالا حدثنا ليث عن يزيد بن الهاد عن عمرو بن أبي عمر عن أبي الحويرث عن محمد بن جبير بن مطعم عن عبد الرحمن بن عوف قال : خرج رسول الله صلى الله عليه وسلم فاتبعته حتى دخل نخلا فسجد فأطال السجود حتى خفت أو خشيت أن يكون قد توفاه الله أو قبضه : قال فجئت أنظر فرفع رأسه فقال مالك يا عبد الرحمن ؟ قال فذكرت ذلك له فقال إن جبريل عليه السلام قال لي ألا أبشرك إن الله عز وجل يقول من صلى عليك صليت عليه ومن سلم عليك سلمت عليه \" طريق أخرى\" قال الإمام أحمد حدثنا أبو سعيد مولى بني هاشم حدثنا سليمان بن بلال حدثنا عمرو بن أبي عمر عن عبد الواحد بن محمد بن عبد الرحمن بن عوف عن عبد الرحمن بن عوف قال : قام رسول الله صلى الله عليه وسلم فتوجه نحو صدفته فدخل فاستقبل القبلة فخر ساجدا فأطال السجود حتى ظننت أن الله قد قبض نفسه فيها فدنوت منه ثم جلست فرفع رأسه فقال من هذا ؟ قلت عبد الرحمن قال ما شأنك ؟ \" قلت يا رسول الله سجدت سجدة خشيت أن يكون الله قبض روحك فيها فقال إن جبريل أتاني فبشرني أن الله عز وجل يقول لك من صلى عليك صليت عليه ومن سلم عليك سلمت عليه فسجدت لله عز وجل شكرا ورواه إسماعيل بن إسحاق القاضي في كتابه عن يحيى بن عبد الحميد عن الدراوردي عن عمرو بن عبد الواحد عن أبيه عن عبد الرحمن بن عوف به ورواه من وجه آخر عن عبد الرحمن \" حديث آخر \" قال أبو القاسم الطبراني حدثنا محمد بن عبد الرحيم بن بجير بن عبد الله بن معاوية بن بجير بن ريان حدثنا يحيى بن أيوب حدثنا عبيد الله بن عمر عن الحكم بن عيينة عن إبراهيم النخعي عن الأسود بن يزيد عن عمر بن الخطاب رضي الله عنه قال خرج رسول الله صلى الله عليه وسلم لحاجة فلم يجد أحدا يتبعه ففزع عمر فأتاه بمطهرة من خلفه فوجد النبي صلى الله عليه وسلم ساجدا في مشربة فتنحى عنه من خلفه حتى رفع النبي صلى الله عليه وسلم رأسه فقال أحسنت يا عمر حين وجدتني ساجدا فتنحيت عني إن جبريل أتاني فقال من صلى عليك من أمتك واحدة صلى الله عليه عشر صلوات ورفعه عشر درجات وقد اختار هذا الحديث الحافظ الضياء المقدسي في كتابه المستخرج على الصحيحين وقد رواه إسماعيل القاضي عن القعنبي عن سلمة بن وردان عن أنس عن عمر بنحوه ورواه أيضا عن يعقوب بن حميد عن أنس بن عياض عن سلمة بن وردان عن مالك بن أوس بن الحدثان عن عمر بن الخطاب بنحوه \" حديث آخر \" قال الإمام أحمد حدثنا أبو كامل حدثنا حماد بن سلمة عن ثابت بن سليمان مولى الحسن بن علي عن عبد الله بن أبي طلحة عن أبيه أن رسول الله صلى الله عليه وسلم جاء ذات يوم والسرور يرى في وجهه فقالوا يا رسول الله إنا لنرى السرور في وجهك فقال إنه أتاني الملك فقال يا محمد أما يرضيك أن ربك عز وجل يقول إنه لا يصلي عليك أحد من أمتك إلا صليت عليه عشرا ولا يسلم عليك أحد من أمتك إلا سلمت عليه عشرا ؟ قلت بلى ورواه النسائي من حديث حماد بن سلمة به وقد رواه إسماعيل القاضي عن إسماعيل بن أبي أويس عن أخيه عن سليمان بن بلال عن عبيد الله بن عمر عن ثابت عن أنس عن أبي طلحة بنحوه \" طريق أخرى \" قال الإمام أحمد حدثنا شريح حدثنا أبو معشر عن إسحاق بن كعب بن عجرة عن أبي طلحة الأنصاري قال أصبح رسول الله صلى الله عليه وسلم يوما طيب النفس يرى في وجهه البشر قالوا يا رسول الله أصبحت اليوم طيب النفس يرى في وجهك البشر قال أجل أتاني آت من ربي عز وجل فقال من صلى عليك من أمتك صلاة كتب الله له بها عشر حسنات ومحا عنه عشر سيئات ورفع له عشر درجات ورد عليه مثلها وهذا أيضا إسناد جيد ولم يخرجوه \" حديث آخر \" روى مسلم وأبو داود والترمذي والنسائي من حديث إسماعيل بن جعفر عن العلاء بن عبد الرحمن عن أبيه عن أبي هريرة رضي الله عنه قال : قال رسول الله صلى الله عليه وسلم من صلى علي واحدة صلى الله عليه بها عشرا قال الترمذي هذا حديث حسن صحيح وفي الباب عن عبد الرحمن بن عوف وعامر بن ربيعة وعمار وأبي طلحة وأنس وأبي بن كعب : وقال الإمام أحمد حدثنا حسين بن محمد حدثنا شريك عن ليث عن كعب عن أبي هريرة عن النبي صلى الله عليه وسلم قال صلوا علي فإنها زكاة لكم وسلوا الله لي الوسيلة فإنها درجة في أعلى الجنة ولا ينالها إلا رجل وأرجو أن أكون أنا هو تفرد به أحمد وقد رواه البزار من طريق مجاهد عن أبى هريرة بنحوه فقال حدثنا محمد بن إسحاق البكالي حدثنا عثمان بن سعيد حدثنا داود بن علية عن ليث عن مجاهد عن أبي هريرة قال : قال رسول الله صلى الله عليه وسلم صلوا علي فإنها زكاة لكم وسلوا الله لي الدرجة الوسيلة من الجنة فسألناه أو أخبرنا فقال هي درجة في أعلى الجنة وهي لرجل وأنا أرجو أن أكون ذلك الرجل في إسناده بعض من تكلم فيه \" حديث آخر \" قال الإمام أحمد حدثنا يحيى بن إسحاق حدثنا ابن لهيعة عن عبد الرحمن بن مريح الخولاني سمعت أبا قيس مولى عمرو بن العاص سمعت عبد الله بن عمرو يقول : من صلى على رسول الله صلى الله عليه وسلم صلاة صلى الله عليه وملائكته لها سبعين صلاة فليقل عبد من ذلك أو ليكثر وسمعت عبد الله بن عمرو يقول خرج علينا رسول الله صلى الله عليه وسلم يوما كالمودع فقال أنا محمد النبي الأمي قاله ثلاث مرات ولا نبي بعدي أوتيت فواتح الكلام وخواتمه وجوامعه وعلمت كم خزنة النار وحملة العرش وتجوز بي عوفيت وعوفيت أمتي فاسمعوا وأطيعوا ما دمت فيكم فإذا ذهب بي فعليكم بكتاب الله أحلوا حلاله وحرموا حرامه\" حديث آخر \" قال أبو داود الطيالسي حدثنا أبو سلمة الخراساني حدثنا أبو إسحاق عن أنس قال : قال رسول الله صلى الله عليه وسلم من ذكرت عنده فليصل علي ومن صلى علي مرة واحدة صلى الله عليه عشرا ورواه النسائي في اليوم والليلة من حديث أبي داود الطيالسي عن أبي سلمة وهو المغيرة بن مسلم الخراساني عن أبي إسحاق عمرو بن عبد الله السبيعي عن أنس به \" حديث آخر \" عن أنس قال الإمام أحمد حدثنا محمد بن فضيل حدثنا يونس بن عمرو عن يونس بن أبي إسحاق عن يزيد بن أبي مريم عن أنس قال : قال رسول الله صلى الله عليه وسلم من صلى علي صلاة واحدة صلى الله عليه عشر صلوات وحط عنه عشر خطيئات \" حديث آخر \" قال الإمام أحمد حدثنا عبد الملك بن عمرو وأبو سعيد حدثنا سليمان بن بلال عن عمارة بن غزية عن عبد الله بن علي بن الحسين عن أبيه علي بن الحسين عن أبيه أن رسول الله صلى الله عليه وسلم قال : البخيل من ذكرت عنده ثم لم يصل علي وقال أبو سعيد فلم يصل علي ورواه الترمذي من حديث سليمان بن بلال ثم قال هذا حديث حسن غريب صحيح ومن الرواة من جعله من سند الحسين بن علي ومنهم من جعله من مسند علي نفسه \" حديث آخر \" قال إسماعيل القاضي حدثنا حجاج بن منهال حدثنا حماد بن سلمة عن معبد بن بلال العنزي حدثنا رجل من أهل دمشق عن عوف بن مالك عن أبي ذر رضي الله عنه أن رسول الله صلى الله عليه وسلم قال إن أبخل الناس من ذكرت عنده فلم يصل علي \" حديث آخر \" مرسل قال إسماعيل وحدثنا سليمان بن حرب حدثنا جرير بن حازم سمعت الحسن يقول قال رسول الله صلى الله عليه وسلم بحسب امرئ من البخل أن أذكر عنده فلا يصلي علي \" حديث آخر \" قال الترمذي حدثنا أحمد بن إبراهيم الدورقي حدثنا ربعي بن إبراهيم عن عبد الرحمن بن إسحاق عن سعيد بن أبي سعيد المقبري عن أبي هريرة قال : قال رسول الله صلى الله عليه وسلم رغم أنف رجل ذكرت عنده فلم يصل علي ورغم أنف رجل دخل عليه شهر رمضان ثم انسلخ قبل أن يغفر له ورغم أنف رجل أدرك عنده أبواه الكبر فلم يدخلاه الجنة ثم قال حسن غريب قلت وقد رواه البخاري في الأدب عن محمد بن عبيد الله حدثنا ابن أبي حازم عن كثير بن زيد عن الوليد بن رباح عن أبي هريرة مرفوعا بنحوه ورواه من حديث محمد بن عمرو عن أبي سلمة عن أبى هريرة قال الترمذي وفي الباب عن جابر وأنس قلت وابن عباس وكعب بن عجرة وقد ذكرت طرق هذا الحديث في أول كتاب الصيام عند قوله : \" إما يبلغن عندك الكبر أحدهما أو كلاهما \" وهذا الحديث والذي قبله دليل على وجوب الصلاة على النبي صلى الله عليه وسلم كما ذكر وهو مذهب طائفة من العلماء منهم الطحاوي والحليمي ويتقوى بالحديث الآخر الذي رواه ابن ماجه حدثنا جنادة بن المغلس حدثنا حماد بن زيد حدثنا عمرو بن دينار عن جابر بن زيد عن ابن عباس قال : قال رسول الله صلى الله عليه وسلم من نسي الصلاة علي أخطأ طريق الجنة. جنادة ضعيف ولكن رواه إسماعيل القاضي من غير وجه عن أبي جعفر محمد بن علي الباقر قال : قال رسول الله صلى الله عليه وسلم من نسي الصلاة علي أخطأ طريق الجنة وهذا مرسل يتقوى بالذي قبله والله أعلم وذهب آخرون إلى أنه تجب الصلاة عليه في المجلس مرة واحدة ثم لا تجب في بقية ذلك المجلس بل تستحب نقله الترمذي عن بعضهم ويتأيد بالحديث الذي رواه الترمذي حدثنا محمد بن بشار حدثنا عبد الرحمن حدثنا سفيان عن صالح مولى التوأمة عن أبي هريرة عن النبي صلى الله عليه وسلم قال : ما جلس قوم مجلسا لم يذكروا الله فيه ولم يصلوا على نبيهم إلا كان عليهم ترة يوم القيامة فإن شاء عذبهم وإن شاء غفر لهم تفرد به الترمذي من هذا الوجه ورواه الإمام أحمد عن حجاج ويزيد بن هارون كلاهما عن ابن أبي ذئب عن صالح مولى التوأمة عن أبي هريرة مرفوعا مثله ثم قال الترمذي هذا حديث حسن وقد روي عن أبي هريرة عن النبي صلى الله عليه وسلم من غير وجه وقد رواه إسماعيل القاضي من حديث شعبة عن سليمان عن ذكوان عن أبي سعيد قال ما من قوم يقعدون ثم يقومون ولا يصلون على النبي صلى الله عليه وسلم إلا كان عليهم يوم القيامة حسرة وإن دخلوا الجنة لما يرون من الثواب وحكي عن بعضهم أنه إنما تجب الصلاة عليه عليه الصلاة والسلام في العمر مرة واحدة امتثالا لأمر الآية ثم هي مستحبة في كل حال وهذا هو الذي نصره القاضي عياض بعدما حكى الإجماع على وجوب الصلاة عليه صلى الله عليه وسلم في الجملة قال وقد حكى الطبري أن محمل الآية على الندب وادعى فيه الإجماع قال ولعله فيما زاد على المرة والواجب فيه مرة كالشهادة له بالنبوة وما زاد على ذلك فمندوب ومرغب فيه من سنن الإسلام وشعار أهله قلت وهذا قول غريب فإنه قد ورد الأمر بالصلاة عليه في أوقات كثيرة فمنها واجب ومنها مستحب على ما نبينه فمنه بعد النداء للصلاة للحديث الذي رواه الإمام أحمد حدثنا أبو عبد الرحمن حدثنا حيوة حدثنا كعب بن علقمة أنه سمع عبد الرحمن بن جبير يقول إنه سمع عبد الله بن عمرو بن العاص يقول إنه سمع رسول الله صلى الله عليه وسلم \" إذا سمعتم مؤذنا فقولوا مثل ما يقول ثم صلوا علي فإنه من صلى علي صلاة صلى الله عليه بها عشرا ثم سلوا الله لي الوسيلة فإنها منزلة في الجنة لا تنبغي إلا لعبد من عباد الله وأرجو أن أكون أنا هو فمن سأل لي الوسيلة حلت عليه الشفاعة \" وأخرجه مسلم وأبو داود والترمذي والنسائي من حديث كعب بن علقمة \" طريق أخرى \" قال إسماعيل القاضي حدثنا محمد بن أبي بكر حدثنا عمرو بن علي عن أبي بكر الجشمي عن صفوان بن سليم عن عبد الله بن عمرو قال : قال رسول الله صلى الله عليه وسلم من سأل الله لي الوسيلة حقت عليه شفاعتي يوم القيامة \" حديث آخر \" قال إسماعيل القاضي حدثنا سليمان بن حرب حدثنا سعيد بن زيد عن ليث عن كعب هو كعب الأحبار عن أبي هريرة رضي الله عنه قال : قال رسول الله صلى الله عليه وسلم صلوا علي فإن صلاتكم علي زكاة لكم وسلوا الله لي الوسيلة قال فإما حدثنا وإما سألناه قال الوسيلة أعلى درجة في الجنة لا ينالها إلا رجل وأرجو أن أكون أنا ذلك الرجل ثم رواه عن محمد بن أبي بكر عن معتمر عن ليث وهو ابن أبي سليم به وكذا الحديث الآخر قال الإمام أحمد حدثنا حسن بن موسى حدثنا ابن لهيعة حدثنا بكر بن سوادة عن زياد بن نعيم عن ورقاء الحضرمي عن رويفع بن ثابت الأنصاري أن رسول الله صلى الله عليه وسلم قال من صلى على محمد وقال اللهم أنزله المقعد المقرب عندك يوم القيامة وجبت له شفاعتي وهذا إسناد لا بأس به ولم يخرجوه \" أثر حسن \" قال إسماعيل القاضي حدثنا علي بن عبد الله حدثنا سفيان حدثني معمر عن ابن طاوس عن أبيه سمعت ابن عباس يقول : اللهم تقبل شفاعة محمد الكبرى وارفع درجته العليا وأعطه سؤله في الآخرة والأولى كما آتيت إبراهيم وموسى عليهم السلام إسناد جيد قوي صحيح ومن ذلك عند دخول المسجد والخروج منه للحديث الذي رواه الإمام أحمد حدثنا إسماعيل بن إبراهيم حدثنا ليث بن أبي سليم عن عبد الله بن الحسن عن أمه فاطمة بنت الحسين عن جدته فاطمة بنت رسول الله صلى الله عليه وسلم قالت : كان رسول الله صلى الله عليه وسلم إذا دخل المسجد صلى على محمد وسلم ثم قال اللهم اغفر لي ذنوبي وافتح لي أبواب رحمتك وإذا خرج صلى على محمد وسلم ثم قال اللهم اغفر لي ذنوبي وافتح لي أبواب فضلك وقال إسماعيل القاضي حدثنا يحيى بن عبد الحميد حدثنا سفيان بن عمرو التميمي عن سليمان الضبي عن علي بن الحسين قال قال علي بن أبي طالب رضي الله عنه : إذا مررتم بالمساجد فصلوا على النبي صلى الله عليه وسلم وأما الصلاة عليه صلى الله عليه وسلم في الصلاة فقد قدمنا الكلام عليها في التشهد الأخير ومن ذهب إلى ذلك من العلماء منهم الشافعي رحمه الله وأكرمه وأحمد وأما التشهد الأول فلا تجب فيه قولا واحدا وهل تستحب ؟ على قولين للشافعي ومن ذلك الصلاة عليه صلى الله عليه وسلم في صلاة الجنازة فإن السنة أن يقرأ في التكبيرة الأولى فاتحة الكتاب وفي الثانية أن يصلي على النبي صلى الله عليه وسلم وفي الثالثة يدعو للميت وفي الرابعة يقول اللهم لا تحرمنا أجره ولا تفتنا بعده قال الشافعي رحمه الله حدثنا مطرف بن مازن عن معمر عن الزهري أخبرني أبو أمامة بن سهل بن حنيف أنه أخبره رجل من أصحاب النبي صلى الله عليه وسلم أن السنة في الصلاة على الجنازة أن يكبر الإمام ثم يقرأ بفاتحة الكتاب بعد التكبيرة الأولى سرا في نفسه ثم يصلي على النبي صلى الله عليه وسلم ويخلص الدعاء للجنازة وفي التكبيرات لا يقرأ في شيء منها ثم يسلم سرا في نفسه ورواه النسائي عن أبي أمامة نفسه أنه قال من السنة فذكره وهذا من الصحابي في حكم المرفوع على الصحيح ورواه إسماعيل القاضي عن محمد بن المثنى عن عبد الأعلى عن معمر عن الزهري عن أبي أمامة بن سهل عن سعيد بن المسيب أنه قال : السنة في الصلاة على الجنازة فذكره وهكذا روي عن أبي هريرة وابن عمر والشعبي ومن ذلك في صلاة العيد قال إسماعيل القاضي حدثنا مسلم بن إبراهيم حدثنا هشام الدستوائي حدثنا حماد بن أبي سليمان عن إبراهيم عن علقمة أن ابن مسعود وأبا موسى وحذيفة خرج عليهم الوليد بن عقبة يوما قبل العيد فقال لهم إن هذا العيد قد دنا فكيف التكبير فيه ؟ قال عبد الله فتكبر تكبيرة تفتتح بها الصلاة وتحمد ربك وتصلي على النبي ثم تدعو وتكبر وتفعل مثل ذلك ثم تكبر وتفعل مثل ذلك ثم تكبر وتفعل مثل ذلك ثم تقرأ ثم تكبر وتركع ثم تقوم فتقرأ وتحمد ربك وتصلي على النبي صلى الله عليه وسلم ثم تدعو وتكبر وتفعل مثل ذلك ثم تركع فقال حذيفة وأبو موسى صدق أبو عبد الرحمن إسناد صحيح ومن ذلك أنه يستحب ختم الدعاء بالصلاة عليه صلى الله عليه وسلم قال الترمذي حدثنا أبو داود حدثنا النضر بن سهيل عن أبي قرة الأسدي عن سعيد بن المسيب عن عمر بن الخطاب قال : الدعاء موقوف بين السماء والأرض لا يصعد منه شيء حتى تصلي على نبيك وكذا رواه أيوب بن موسى عن سعيد بن المسيب عن عمر بن الخطاب ورواه معاذ بن الحارث عن أبي قرة سعيد بن المسيب عن عمر مرفوعا وكذا رواه رزين بن معاوية في كتابه مرفوعا عن النبي صلى الله عليه وسلم قال الدعاء موقوف بين السماء والأرض لا يصعد حتى يصلى علي فلا تجعلوني كغمر الراكب صلوا علي أول الدعاء وآخره وأوسطه وهذه الزيادة إنما تروى من رواية جابر بن عبد الله في مسند الإمام عبد بن حميد الكشي حيث قال : حدثنا جعفر بن عون أخبرنا موسى بن عبيدة عن إبراهيم بن محمد بن إبراهيم عن أبيه قال : قال جابر قال لنا رسول الله صلى الله عليه وسلم لا تجعلوني كقدح الراكب إذا علق تعاليقه أخذ قدحه فملأه من الماء فإن كان له حاجة في الوضوء توضأ وإن كان له حاجة في الشرب شرب وإلا أهرق ما فيه اجعلوني في أول الدعاء وفي وسط الدعاء وفي آخر الدعاء وهذا حديث غريب وموسى بن عبيدة ضعيف الحديث ومن آكد ذلك دعاء القنوت لما رواه أحمد وأهل السنن وابن خزيمة وابن حبان والحاكم من حديث أبي الجوزاء عن الحسن بن علي رضي الله عنهما قال : علمني رسول الله صلى الله عليه وسلم كلمات أقولهن في الوتر اللهم اهدني فيمن هديت وعافني فيمن عافيت وتولني فيمن توليت وبارك لي فيما أعطيت وقني شر ما قضيت فإنك تقضي ولا يقضى عليك وإنه لا يذل من واليت ولا يعز من عاديت تباركت ربنا وتعاليت وزاد النسائي في سننه بعد هذا وصلى الله على محمد ومن ذلك أنه يستحب الإكثار من الصلاة عليه يوم الجمعة وليلة الجمعة قال الإمام أحمد حدثنا حسين بن علي الجعفي عن عبد الرحمن بن يزيد بن جابر عن أبي الأشعث الصنعاني عن أوس بن أوس الثقفي رضي الله عنه قال : قال رسول الله صلى الله عليه وسلم من أفضل أيامكم يوم الجمعة فيه خلق آدم وفيه قبض وفيه النفخة وفيه الصعقة فأكثروا علي من الصلاة فيه فإن صلاتكم معروضة علي قالوا يا رسول الله وكيف تعرض عليك صلاتنا وقد أرمت ؟ يعني وقد بليت قال إن الله حرم على الأرض أن تأكل أجساد الأنبياء ورواه أبو داود والنسائي وابن ماجه من حديث حسين بن علي الجعفي وقد صحح هذا الحديث ابن خزيمة وابن حبان والدارقطني والنووي في الأذكار \" حديث آخر \" قال أبو عبد الله بن ماجه حدثنا عمرو بن سوادة المصري حدثنا عبد الله بن وهب عن عمرو بن الحارث عن سعيد بن أبي هلال عن زيد بن أيمن عن عبادة بن نسي عن أبي الدرداء قال : قال رسول الله صلى الله عليه وسلم أكثروا الصلاة علي يوم الجمعة فإنه مشهود تشهده الملائكة لأن أحدا لا يصلي علي فيه إلا عرضت علي صلاته حتى يفرغ منها قال قلت وبعد الموت ؟ قال إن الله حرم على الأرض أن تأكل أجساد الأنبياء فنبي الله حي يرزق هذا حديث غريب من هذا الوجه وفيه انقطاع بين عبادة بن نسي وأبي الدرداء فإنه لم يدركه والله أعلم وقد روى البيهقي من حديث أبي أمامة وابن مسعود عن النبي صلى الله عليه وسلم في الأمر بالإكثار من الصلاة عليه ليلة الجمعة ومن الجمعة ولكن في إسنادهما ضعف والله أعلم وروي مرسلا عن الحسن البصري فقال إسماعيل القاضي حدثنا سليمان بن حرب حدثنا جرير بن حازم سمعت الحسن البصري يقول : قال رسول الله صلى الله عليه وسلم لا تأكل الأرض جسد من كلمه روح القدس مرسل حسن والنووي في الأذكار وقال القاضي وقال الشافعي أخبرنا إبراهيم بن محمد أخبرنا صفوان بن سليم أن النبي صلى الله عليه وسلم قال إذا كان يوم الجمعة وليلة الجمعة فأكثروا الصلاة علي هذا مرسل وهكذا يجب على الخطيب أن يصلي على النبي صلى الله عليه وسلم يوم الجمعة على المنبر في الخطبتين ولا تصح الخطبتان إلا بذلك لأنها عبادة وذكر الله شرط فيها فوجب ذكر الرسول صلى الله عليه وسلم فيها كالأذان والصلاة هذا مذهب الشافعي وأحمد رحمهما الله ومن ذلك أنه يستحب الصلاة والسلام عليه عند زيارة قبره صلى الله عليه وسلم قال أبو داود حدثنا ابن عوف هو محمد بن المقري حدثنا حيوة عن أبي صخر حميد بن زياد عن يزيد بن عبد الله بن قسيط عن أبي هريرة أن رسول الله صلى الله عليه وسلم قال ما منكم من أحد يسلم علي إلا رد الله علي روحي حتى أرد عليه السلام تفرد به أبو داود وصححه النووي في الأذكار ثم قال أبو داود حدثنا أحمد بن صالح قال : قرأت على عبد الله بن نافع أخبرني ابن أبي ذئب عن سعيد المقبري عن أبي هريرة قال : قال رسول الله صلى الله عليه وسلم لا تجعلوا بيوتكم قبورا ولا تجعلوا قبري عيدا وصلوا علي فإن صلاتكم تبلغني حيثما كنتم تفرد به أبو داود أيضا وقد رواه الإمام أحمد عن شريح عن عبد الله بن نافع وهو الصائغ به وصححه النووي أيضا وقد روي من وجه آخر عن علي رضي الله عنه قال القاضي إسماعيل بن إسحاق في كتابه فضل الصلاة على النبي صلى الله عليه وسلم حدثنا إسماعيل بن أبي أويس حدثنا جعفر بن إبراهيم بن محمد بن علي عن عبد الله بن جعفر بن أبي طالب عمن أخبره من أهل بيته عن علي بن الحسين بن علي أن رجلا كان يأتي كل غداة فيزور قبر النبي صلى الله عليه وسلم ويصلي عليه ويصنع من ذلك ما اشتهر عليه علي بن الحسين فقال له علي بن الحسين ما يحملك على هذا ؟ قال أحب السلام على النبي صلى الله عليه وسلم فقال له علي بن الحسين هل لك أن أحدثك حديثا عن أبي ؟ قال نعم فقال له علي بن الحسين أخبرني أبي عن جدي أنه قال : قال رسول الله صلى الله عليه وسلم لا تجعلوا قبري عيدا ولا تجعلوا بيوتكم قبورا صلوا علي وسلموا حيثما كنتم فتبلغني صلاتكم وسلامكم. في إسناده رجل مبهم لم يسم وقد روي من وجه آخر مرسلا قال عبد الرزاق في مصنفه عن الثوري عن ابن عجلان عن رجل يقال له سهيل عن الحسن بن الحسن بن علي قال رأى قوما عند القبر فنهاهم وقال إن النبي صلى الله عليه وسلم \" . قال لا تتخذوا قبري عيدا ولا تتخذوا بيوتكم قبورا وصلوا علي حيثما كنتم فإن صلاتكم تبلغني فلعله رآهم يسيئون الأدب برفع أصواتهم فوق الحاجة فنهاهم وقد روي أنه رأى رجلا ينتاب القبر فقال : يا هذا ما أنت ورجل بالأندلس منه إلا سواء أي الجميع يبلغه صلوات الله وسلامه عليه دائما إلى يوم الدين وقال الطبراني في معجمه الكبير حدثنا أحمد بن رشدين المصري حدثنا سعيد بن أبي مريم حدثنا محمد بن جعفر أخبرني حميد بن أبي زينب عن حسن بن حسن بن علي بن أبي طالب رضي الله عنهم عن أبيه أن رسول الله صلى الله عليه وسلم قال صلوا علي حيثما كنتم فإن صلاتكم تبلغني ثم قال الطبراني حدثنا العباس بن حمدان الأصبهاني حدثنا شعيب بن عبد الحميد الطحان أخبرنا يزيد بن هارون بن أبي شيبان عن الحكم بن عبد الله بن الخطاب عن أم أنيس بنت الحسن بن علي عن أبيها قال : قال رسول الله صلى الله عليه وسلم أرأيت قول الله عز وجل \" إن الله وملائكته يصلون على النبي \" فقال إن هذا هو المكتوم ولولا أنكم سألتموني عنه ما أخبرتكم إن الله عز وجل وكل بي ملكين لا أذكر عند عبد مسلم فيصلي علي إلا قال ذانك الملكان غفر الله لك وقال الله وملائكته جوابا لذينك الملكين آمين ولا يصلي علي أحد إلا قال ذانك الملكان غفر الله لك ويقول الله وملائكته جوابا لذينك الملكين آمين . غريب جدا وإسناده به ضعف شديد وقد قال الإمام أحمد حدثنا وكيع عن سفيان عن عبد الله بن السائب عن زاذان عن عبد الله بن مسعود أن رسول الله صلى الله عليه وسلم قال إن لله ملائكة سياحين في الأرض يبلغوني عن أمتي السلام وهكذا رواه النسائي من حديث سفيان الثوري وسليمان بن مهران الأعمش كلاهما عن عبد الله بن السائب به فأما الحديث الآخر من صلى علي عند قبري سمعته ومن صلى علي من بعيد بلغته ففي إسناده نظر تفرد به محمد بن مروان السدي الصغير وهو متروك عن الأعمش عن أبي صالح عن أبي هريرة مرفوعا قال أصحابنا ويستحب للمحرم إذا لبى وفرغ من تلبيته أن يصلي على النبي صلى الله عليه وسلم لما رواه الشافعي والدارقطني من رواية صالح بن محمد بن زائدة عن القاسم بن محمد بن أبي بكر الصديق قال كان يؤمر الرجل إذا فرغ من تلبيته أن يصلي على النبي صلى الله عليه وسلم على كل حال وقال إسماعيل القاضي حدثنا عارم بن الفضل حدثنا عبد الله بن المبارك حدثنا زكريا عن الشعبي عن وهب بن الأجدع قال : سمعت عمر بن الخطاب رضي الله عنه يقول : إذا قدمتم فطوفوا بالبيت سبعا وصلوا عند المقام ركعتين ثم ائتوا الصفا فقوموا عليه من حيث ترون البيت فكبروا سبع مرات تكبيرا بين حمد الله وثناء عليه وصلاة على النبي صلى الله عليه وسلم ومسألة لنفسك وعلى المروة مثل ذلك . إسناد جيد حسن قوي قالوا ويستحب الصلاة على النبي صلى الله عليه وسلم مع ذكر الله عند الذبح واستأنسوا بقوله تعالى \" ورفعنا لك ذكرك \" قال بعض المفسرين يقول الله تعالى لا أذكر إلا ذكرت معي وخالفهم في ذلك الجمهور وقالوا هذا موطن يفرد فيه ذكر الله تعالى كما عند الأكل والدخول والوقاع وغير ذلك مما لم ترد فيه السنة بالصلاة على النبي صلى الله عليه وسلم \" حديث آخر \" قال إسماعيل القاضي حدثنا محمد بن أبي بكر المقدمي حدثنا عمرو بن هارون عن موسى بن عبيدة عن محمد بن ثابت عن أبي هريرة أن رسول الله صلى الله عليه وسلم قال صلوا على أنبياء الله ورسله فإن الله بعثهم كما بعثني . في إسناده ضعيفان وهما عمرو بن هارون وشيخه والله أعلم وقد رواه عبد الرزاق عن الثوري عن موسى بن عبيدة الزبيدي به ومن ذلك أنه يستحب الصلاة عليه عند طنين الأذن إن صح الخبر في ذلك على أن الإمام أبا بكر محمد بن إسحاق بن خزيمة قد رواه في صحيحه فقال : حدثنا زياد بن يحيى حدثنا معمر بن محمد بن عبيد الله عن علي بن أبي رافع عن أبيه عن أبي رافع قال : قال رسول الله صلى الله عليه وسلم إذا طنت أذن أحدكم فليذكرني وليصل علي وليقل ذكر الله من ذكرني بخير إسناده غريب وفي ثبوته نظر والله أعلم \" مسألة \" وقد استحب أهل الكتابة أن يكرر الكاتب الصلاة على النبي صلى الله عليه وسلم كلما كتبه وقد ورد في الحديث من طريق كادح بن رحمة عن نهشل عن الضحاك عن ابن عباس قال : قال رسول الله صلى الله عليه وسلم من صلى علي في كتاب لم تزل الصلاة جارية له ما دام اسمي في ذلك الكتاب وليس هذا الحديث بصحيح من وجوه كثيرة وقد روي من حديث أبي هريرة ولا يصح أيضا قال الحافظ أبو عبد الله الذهبي شيخنا أحسبه موضوعا وقد روي نحوه عن أبي بكر وابن عباس ولا يصح من ذلك شيء والله أعلم وقد ذكر الخطيب البغدادي في كتابه الجامع لآداب الراوي والسامع قال : رأيت بخط الإمام أحمد بن حنبل رحمه الله كثيرا ما يكتب اسم النبي صلى الله عليه وسلم من غير ذكر الصلاة عليه كتابة قال : وبلغني أنه كان يصلي عليه لفظا \" فصل \" وأما الصلاة على غير الأنبياء فإن كانت على سبيل التبعية كما تقدم في الحديث اللهم صل على محمد وآله وأزواجه وذريته فهذا جائز بالإجماع وإنما وقع النزاع فيما إذا أفرد غير الأنبياء بالصلاة عليهم فقال قائلون يجوز ذلك واحتجوا بقول الله تعالى \" هو الذي يصلي عليكم وملائكته \" وبقوله \" أولئك عليهم صلوات من ربهم ورحمة \" وبقوله \" خذ من أموالهم صدقة تطهرهم وتزكيهم بها وصل عليهم \" الآية وبحديث عبد الله بن أبي أوفى قال : كان رسول الله صلى الله عليه وسلم إذا أتاه قوم بصدقتهم قال اللهم صل عليهم فأتاه أبي بصدقته فقال اللهم صل على آل أبي أوفى أخرجاه في الصحيحين وبحديث جابر أن امرأته قالت يا رسول الله صل علي وعلى زوجي فقال صلى الله عليك وعلى زوجك قال الجمهور من العلماء لا يجوز إفراد غير الأنبياء بالصلاة لأن هذا قد صار شعارا للأنبياء إذا ذكروا فلا يلحق بهم غيرهم فلا يقال قال أبو بكر صلى الله عليه وسلم وقال علي صلى الله عليه وسلم وإن كان المعنى صحيحا كما لا يقال قال محمد عز وجل وإن كان عزيزا جليلا لأن هذا من شعار ذكر الله عز وجل وحملوا ما ورد في ذلك من الكتاب والسنة على الدعاء لهم ولهذا لم يثبت شعار لآل أبي أوفى ولا لجابر وامرأته وهذا مسلك حسن وقال آخرون لا يجوز ذلك لأن الصلاة على غير الأنبياء قد صارت من شعار أهل الأهواء يصلون على من يعتقدون فيهم فلا يقتدى بهم في ذلك والله أعلم ثم اختلف المانعون من ذلك هل هو من باب التحريم أو الكراهة التنزيهية أو خلاف الأولى ؟ على ثلاثة أقوال حكاه الشيخ أبو زكريا النووي في كتاب الأذكار ثم قال والصحيح الذي عليه الأكثرون أنه مكروه كراهة تنزيه لأنه شعار أهل البدع وقد نهينا عن شعارهم والمكروه هو ما ورد فيه نهي مقصود قال أصحابنا والمعتمد في ذلك أن الصلاة صارت مخصوصة في لسان السلف بالأنبياء كما أن قولنا عز وجل"
    },
    {
      "ayah": 57,
      "surah": 33,
      "text": "يقول تعالى متهددا ومتوعدا من أذاه بمخالفة أوامره وارتكاب زواجره وإصراره على ذلك وإيذاء رسوله بعيب أو بنقص عياذا بالله من ذلك - قال عكرمة في قوله تعالى \"إن الذين يؤذون الله ورسوله \"نزلت في المصورين وفي الصحيحين من حديث سفيان بن عيينة عن الزهري عن سعيد بن المسيب عن أبي هريرة قال: قال رسول الله صلى الله عليه وسلم يقول الله عز وجل: يؤذيني ابن آدم يسب الدهر وأنا الدهر أقلب ليله ونهاره ومعنى هذا أن الجاهلية كانوا يقولون يا خيبة الدهر فعل بنا كذا وكذا فيسندون أفعال الله تعالى إلى الدهر ويسبونه وإنما الفاعل لذلك هو الله عز وجل فنهى عن ذلك هكذا قرره الشافعي وأبو عبيدة وغيرهما من العلماء رحمهم الله وقال العوفي عن ابن عباس في قوله تعالى \"إن الذين يؤذون الله ورسوله \"نزلت في الذين طعنوا على النبي صلى الله عليه وسلم في تزويجه صفية بنت حيي بن أخطب والظاهر أن الآية عامة في كل من آذاه بشيء ومن آذاه فقد أذى الله كما أن من أطاعه فقد أطاع الله كما قال الإمام أحمد حدثنا يونس حدثنا إبراهيم بن سعد عن عبيدة بن أبي رائطة الحذاء المجاشعي عن عبد الرحمن بن زياد عن عبد الرحمن بن المغفل المزني قال: قال رسول الله صلى الله عليه وسلم الله الله في أصحابي لا تتخذوهم غرضا بعدي فمن أحبهم فبحبي أحبهم ومن أبغضهم فببغضي أبغضهم ومن آذهم فقد آذاني ومن آذاني فقد آذى الله ومن آذى الله يوشك أن يأخذه وقد رواه الترمذي من حديث عبيدة بن أبي رائطة عن عبد الرحمن بن زياد عن عبد الله بن المغفل به ثم قال وهذا حديث غريب لا نعرفه إلا من هذا الوجه."
    },
    {
      "ayah": 58,
      "surah": 33,
      "text": "وقوله تعالى \"والذين يؤذون المؤمنين والمؤمنات بغير ما اكتسبوا \"أي ينسبون إليهم ما هم برآء منه لم يعملوه ولم يفعلوه \"فقد احتملوا بهتانا وإثما مبينا \"وهذا هو البهت الكبير أن يحكى أو ينقل عن المؤمنين والمؤمنات ما لم يفعلوه على سبيل العيب والتنقص لهم ومن أكثر من يدخل في هذا الوعيد الكفرة بالله ورسوله ثم الرافضة الذين ينتقصون الصحابة ويعيبونهم بما قد برأهم الله منه ويصفونهم بنقيض ما أخبر الله عنهم فإن الله عز وجل قد أخبر أنه قد رضى عن المهاجرين والأنصار ومدحهم وهؤلاء الجهلة الأغبياء يسبونهم وينتقصونهم ويذكرون عنهم ما لم يكن ولا فعلوه أبدا فهم في الحقيقة منكسو القلوب يذمون الممدوحين ويمدحون المذمومين وقال أبو داود حدثنا القعنبي حدثنا عبد العزيز يعني ابن محمد عن العلاء عن أبيه عن أبي هريرة أنه قيل يا رسول الله ما الغيبة؟ قال ذكرك أخاك بما يكره قيل أفرأيت إن كان في أخي ما أقول؟ قال إن كان فيه ما تقول فقد اغتبته وإن لم يكن فيه ما تقول فقد بهته وهكذا رواه الترمذي عن قتيبة عن الدراوردي به ثم قال حسن صحيح وقد قال ابن أبي حاتم حدثنا أحمد بن سلمة حدثنا أبو كريب حدثنا معاوية بن هشام عن عمار بن أنس عن أبن أبي مليكة عن عائشة قالت: قال رسول الله صلى الله عليه وسلم لأصحابه أي الربا أربى عند الله قالوا الله ورسوله أعلم قال أربى الربا عند الله استحلال عرض امرئ مسلم ثم قرأ \"والذين يؤذون المؤمنين والمؤمنات بغير ما اكتسبوا فقد احتملوا بهتانا وإثما مبينا \"."
    },
    {
      "ayah": 59,
      "surah": 33,
      "text": "يقول تعالى آمرا رسوله صلى الله عليه وسلم تسليما أن يأمر النساء المؤمنات المسلمات - خاصة أزواجه وبناته لشرفهن - بأن يدنين عليهم من جلابيبهن ليتميزن عن سمات نساء الجاهلية وسمات الإماء والجلباب هو الرداء فوق الخمار قاله ابن مسعود وعبيدة وقتادة والحسن البصري وسعيد بن جبير وإبراهيم النخعي وعطاء الخراساني وغير واحد وهو بمنزلة الإزار اليوم قال الجوهري الجلباب الملحفة قالت امرأة من هذيل ترثي قتيلا لها: تمشي النسور إليه وهي لاهية مشي العذارى عليهن الجلابيب قال علي بن أبي طلحة عن ابن عباس أمر الله نساء المومنين إذا خرجن من بيوتهن في حاجة أن يغطين وجوههن من فوق رؤوسهن بالجلابيب ويبدين عينا واحدة وقال محمد بن سيرين سألت عبيدة السلماني عن قول الله عز وجل \"يدنين عليهن من جلابيبهن \"فغطى وجهه ورأسه وأبرز عينه اليسرى وقال عكرمة تغطي ثغرة نحرها بجلبابها تدنيه عليها وقال ابن أبي حاتم حدثنا أبو عبد الله الطبراني فيما كتب إلي حدثنا عبد الرزاق أخبرنا معمر عن ابن خيثم عن صفية بنت شيبه عن أم سلمة قالت لما نزلت هذه الآية \"يدنين عليهن من جلابيبهن \"خرج نساء الأنصار كأن على رؤوسهن الغربان من السكينة وعليهن أكسية سود يلبسنها وقال ابن أبي حاتم حدثنا أبي حدثنا أبو صالح حدثني الليث حدثنا يونس بن يزيد قال وسألناه يعني الزهري هل على الوليدة خمار متزوجة أو غير متزوجة؟ قال عليها الخمار إن كانت متزوجة وتنهى عن الجلباب لأنه يكره لهن أن يتشبهن بالحرائر المحصنات وقد قال الله تعالى \"يا أيها النبي قل لأزواجك وبناتك ونساء المؤمنين يدنين عليهن من جلابيبهن \" وروي عن سفيان الثوري أنه قال: لا بأس بالنظر إلى زينة نساء أهل الذمة وإنما نهي عن ذلك لخوف الفتنة لا لحرمتهن واستدل بقوله تعالى \"ونساء المؤمنين \"وقوله \"ذلك أدنى أن يعرفن فلا يؤذين \"أي إذا فعلن ذلك عرفهن أنهن حرائر لسن بإماء ولا عواهر قال السدي في قوله تعالى \"يا أيها النبي قل لأزواجك وبناتك ونساء المؤمنين يدنين عليهن من جلابيبهن ذلك أدنى أن يعرفن فلا يؤذين \"قال كان ناس من فساق أهل المدينة يخرجون بالليل حين يختلط الظلام إلى طرق المدينة فيعرضون للنساء وكانت مساكن أهل المدينة ضيقة فإذا كان الليل خرج النساء إلى الطرق يقضين حاجتهن فكان أولئك الفساق يبتغون ذلك منهن فإذا رأوا المرأة عليها جلباب قالوا هذه حرة فكفوا عنها فإذا رأوا المرأة ليس عليها جلباب قالوا هذه أمة فوثبوا عليها وقال مجاهد يتجلين فيعلم أنهن حرائر فلا يتعرض لهن فاسق بأذى ولا ريبة وقوله تعالى \"وكان الله غفورا رحيما \"أي لما سلف في أيام الجاهلية حيث لم يكن عندهن علم بذلك."
    },
    {
      "ayah": 6,
      "surah": 33,
      "text": "قد علم الله تعالى شفقة رسوله صلى الله عليه وسلم: على أمته ونصحه لهم فجعله أولى بهم من أنفسهم وحكمه فيهم كان مقدما على اختيارهم لأنفسهم كما قال تعالى: \"فلا وربك لا يؤمنون حتى يحكموك فيما شجر بينهم ثم لا يجدوا في أنفسهم حرجا مما قضيت ويسلموا تسليما\" وفي الصحيح \"والذي نفسي بيده لا يؤمن أحدكم حتى أكون أحب إليه من نفسه وماله وولده والناس أجمعين\" وفي الصحيح أيضا أن عمر رضي الله عنه قال: يا رسول الله والله لأنت أحب إلي من كل شيء إلا من نفسي فقال \"لا يا عمر حتى أكون أحب إليك من نفسك\" فقال يا رسول الله والله لأنت أحب إلي من كل شيء حتى من نفسي فقال \"الآن يا عمر\" ولهذا قال تعالى في هذه الآية \"النبي أولى بالمؤمنين من أنفسهم\" وقال البخاري عند هذه الآية الكريمة حدثنا إبراهيم بن المنذر حدثنا محمد بن فليح حدثنا أبي عن هلال بن علي عن عبد الرحمن بن أبي عمرة عن أبي هريرة رضي الله عنه عن النبي صلى الله عليه وسلم قال \"ما من مؤمن إلا وأنا أولى الناس به في الدنيا والآخرة اقرءوا إن شئتم\" النبي أولى بالمؤمنين من أنفسهم \"فأيما مؤمن ترك مالا فليرثه عصبته من كانوا وإن ترك دينا أو ضياعا فليأتني فأنا مولاه\" تفرد به البخاري ورواه أيضا في الاستقراض وابن جرير وابن أبي حاتم من طرق عن فليح به مثله ورواه أحمد من حديث أبي حصين عن أبي صالح عن أبي هريرة رضي الله عنه عن رسول الله صلى الله عليه وسلم بنحوه وقال الإمام أحمد حدثنا عبد الرزاق عن معمر عن الزهري في قوله: \"النبي أولى بالمؤمنين من أنفسهم\" عن أبى سلمة عن جابر بن عبد الله رضي الله عنه عن النبي صلى الله عليه وسلم كان يقول \"أنا أولى بكل مؤمن من نفسه فأيما رجل مات وترك دينا فإلى ومن ترك مالا فهو لورثته\" رواه أبو داود عن أحمد بن حنبل به نحوه وقوله تعالى: \"وأزواجه أمهاتهم\" أي في الحرمة والاحترام والتوقير والإكرام والإعظام ولكن لا تجوز الخلوة بهن ولا ينتشر التحريم إلى بناتهن وأخواتهن بالإجماع وإن سمى بعض العلماء بناتهن أخوات المؤمنين كما هو منصوص الشافعي رضي الله عنه في المختصر وهو من باب إطلاق العبارة لا إثبات الحكم وهل يقال لمعاوية وأمثاله خال المؤمنين؟ فيه قولان للعلماء رضي الله عنهم ونص الشافعي رضي الله عنه على أنه لا يقال ذلك وهل يقال لهن أمهات المؤمنات فيدخل النساء في جمع المذكر السالم تغليبا؟ فيه قولان صح عن عائشة رضي الله عنها أنها قالت لا يقال ذلك وهذا أصح الوجهين في مذهب الشافعي رضي الله عنه. وقد روي عن أبي بن كعب وابن عباس رضي الله عنهم أنهما قرآ \"النبي أولى بالمؤمنين من أنفسهم وأزواجه أمهاتهم وهو أب لهم\" وروي نحو هذا عن معاوية ومجاهد وعكرمة والحسن وهو أحد الوجهين في مذهب الشافعي رضي الله عنه حكاه البغوي وغيره واستأنسوا عليه بالحديث الذي رواه أبو داود رحمه الله حدثنا عبد الله بن محمد النفيلي حدثنا ابن المبارك عن محمد بن عجلان عن القعقاع بن حكيم عن أبي صالح عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم \"إنما أنا لكم بمنزلة الوالد أعلمكم فإذا أتى أحدكم الغائط فلا يستقبل القبلة ولا يستدبرها ولا يستطب بيمينه\" وكان يأمر بثلاثة أحجار وينهى عن الروث والرمة. وأخرجه النسائي وابن ماجه من حديث ابن عجلان والوجه الثاني أنه لا يقال ذلك واحتجوا بقوله تعالى: \"ما كان محمد أبا أحد من رجالكم\". وقوله تعالى: \"وأولوا الأرحام بعضهم أولى ببعض في كتاب الله\" أي في حكم الله \"من المؤمنين والمهاجرين\" أي القرابات أولى بالتوارث من المهاجرين والأنصار وهذه ناسخة لما كان قبلها من التوارث بالحلف والمؤاخاة التي كانت بينهم كما قال ابن عباس وغيره: كان المهاجري يرث الأنصاري دون قراباته وذوي رحمه للأخوة التي آخى بينهما رسول الله صلى الله عليه وسلم وكذا قال سعيد بن جبير وغير واحد من السلف والخلف. وقد أورد فيه ابن أبي حاتم حديث عن الزبير بن العوام فقال حدثنا أبي حدثنا أحمد بن أبي بكر المصعبي من ساكني بغداد عن عبد الرحمن بن أبي الزناد عن هشام بن عروة عن أبيه عن الزبير بن العوام رضي الله عنه قال أنزل الله عز وجل فينا خاصة معشر قريش والأنصار \"وأولوا الأرحام بعضهم أولى ببعض\" وذلك أنا معشر قريش لما قدمنا المدينة قدمنا ولا أموال لنا فوجدنا الأنصار نعم الإخوان فواخيناهم ووارثناهم فآخى أبو بكر رضي الله عنه خارجة بن زيد وآخى عمر رضي الله عنه فلانا وآخى عثمان رضي الله عنه رجلا من بني زريق بن سعد الزرقي ويقول بعض الناس غيره قال الزبير رضي الله عنه وواخيت أنا كعب بن مالك فجئته فابتعلته فوجدت السلاح قد ثقله فيما يرى فوالله يا بني لو مات يومئذ عن الدنيا ما ورثه غيري حتى أنزل الله تعالى هذه الآية فينا معشر قريش والأنصار خاصة فرجعنا إلى مواريثنا. وقوله تعالى: \"إلا أن تفعلوا إلى أوليائكم معروفا\" أي ذهب الميراث وبقي النصر والبر والصلة والإحسان والوصية وقوله تعالى: \"كان ذلك في الكتاب مسطورا\" أي هذا الحكم وهو أن أولي الأرحام بعضهم أولى ببعض حكم من الله مقدر مكتوب في الكتاب الأول الذي لا يبدل ولا يغير. قاله مجاهد وغير واحد وإن كان تعالى قد شرع خلافه في وقت لما له في ذلك من الحكمة البالغة وهو يعلم أنه سبحانه إلى ما هو جار في قدره الأزلي وقضائه القدري الشرعي والله أعلم."
    },
    {
      "ayah": 60,
      "surah": 33,
      "text": "ثم قال تعالى متوعدا للمنافقين وهم الذين يظهرون الإيمان ويبطنون الكفر \"والذين في قلوبهم مرض \"قال عكرمة وغيره هم الزناة ههنا \"والمرجفون في المدينة \"يعني الذين يقولون جاء الأعداء وجاءت الحروب وهو كذب وافتراء لئن لم ينتهوا عن ذلك ويرجعوا إلى الحق \"لنغرينك بهم \"قال علي بن أبي طلحة عن ابن عباس أي لنسلطنك عليهم وقال قتادة لنحرشنك بهم وقال السدي لنعلمنك بهم \"ثم لا يجاورونك فيها \"أي في المدينة."
    },
    {
      "ayah": 61,
      "surah": 33,
      "text": "\"إلا قليلا ملعونين \"حال منهم في مدة إقامتهم في المدينة مدة قريبة مطرودين مبعدين \"أينما ثقفوا \"أي وجدوا \"أخذوا \"لذلتهم وقلتهم \"وقتلوا تقتيلا \"."
    },
    {
      "ayah": 62,
      "surah": 33,
      "text": "ثم قال تعالى \"سنة الله في الذين خلوا من قبل \"أي هذه سنته في المنافقين إذا تمردوا على نفاقهم وكفرهم ولم يرجعوا عما هم فيه أن أهل الإيمان يسلطون عليهم ويقهرونهم \"ولن تجد لسنة الله تبديلا \"أي وسنة الله في ذلك لا تبدل ولا تغير."
    },
    {
      "ayah": 63,
      "surah": 33,
      "text": "يقول تعالى مخبرا لرسوله صلوات الله وسلامه عليه أنه لا علم له بالساعة وإن سأله الناس عن ذلك وأرشده أن يرد علمها إلى الله عز وجل كما قال الله تعالى في سورة الأعراف وهي مكية وهذه مدنية فاستمر الحال في رد علمها إلى الذي يقيمها لكن أخبره أنها قريبة بقوله \"وما يدريك لعل الساعة تكون قريبا \"كما قال تعالى: \"اقتربت الساعة وانشق القمر \"وقال \"اقترب للناس حسابهم وهم في غفلة معرضون \"وقال \"أتى أمر الله فلا تستعجلوه \"."
    },
    {
      "ayah": 64,
      "surah": 33,
      "text": "ثم قال تعالى: \"إن الله لعن الكافرين \"أي أبعدهم عن رحمته \"وأعد لهم سعيرا \"أي في الدار الآخرة.."
    },
    {
      "ayah": 65,
      "surah": 33,
      "text": "\"خالدين فيها أبدا \"أي ماكثين مستمرين فلا خـروج لهم منها ولا زوال لهم عنهـا \"لا يجدون وليا ولا نصيرا \"أي وليس لهم مغيث ولا معين ينقذهم مما هم فيه."
    },
    {
      "ayah": 66,
      "surah": 33,
      "text": "ثم قال \"يوم تقلب وجوههم في النار يقولون يا ليتنا أطعنا الله وأطعنا الرسولا \"أي يسحبون في النار على وجوههم وتلوى وجوههم على جهنم يقولون وهم كذلك يتمنون أن لو كانوا في الدار الدنيا ممن أطاع الله وأطاع الرسول كما أخبر الله عنهم في حال العرصات بقوله \"ويوم يعض الظالم على يديه يقول يا ليتني اتخذت مع الرسول سبيلا يا وليتا ليتني لم أتخد فلانا خليلا لقد أضلني عن الذكر بعد إذ جاءني وكان الشيطان للإنسان خذولا \"."
    },
    {
      "ayah": 67,
      "surah": 33,
      "text": "وقال تعالى: \"ربما يود الذين كفروا لو كانوا مسلمين \"وهكذا أخبر عنهم في حالتهم هذه أنهم يودون أن لو كانوا أطاعوا الله وأطاعوا الرسول في الدنيا \"وقالوا ربنا إنا أطعنا سادتنا وكبراءنا فأضلونا السبيلا \"وقال طاوس: سادتنا يعني الأشراف وكبراءنا يعني العلماء رواه ابن أبي حاتم أي اتبعنا السادة وهم الأمراء والكبراء من المشيخة وخالفنا الرسل واعتقدنا أن عندهم شيئا وأنهم على شيء فإذا هم ليسوا على شيء."
    },
    {
      "ayah": 68,
      "surah": 33,
      "text": "\"ربنا آتهم ضعفين من العذاب \"أي بكفرهم وإغوائهم إيانا \"والعنهم لعنا كبيرا \"قرأ بعض القراء بالباء الموحدة وقرأ آخرون بالثاء المثلثة وهما قريبا المعنى كما في حديث عبد الله بن عمرو أن أبا بكر قال يا رسول الله علمني دعاء أدعو به في صلاتي قال: \"قل اللهم إنى ظلمت نفسي ظلما كثيرا ولا يغفر الذنوب إلا أنت فاغفر لي مغفرة من عندك وارحمني إنك أنت الغفور الرحيم أخرجاه في الصحيحين يروى كثيرا وكبيرا وكلاهما بمعنى صحيح واستحب بعضهم أن يجمع الداعي بين اللفظين في دعائه وفي ذلك نظر بل الأولى أن يقول هذا تارة وهذا تارة كما أن القارئ مخير بين القراءتين أيتهما قرأ أحسن وليس له الجمع بينهما والله أعلم وقال أبو القاسم الطبراني حدثنا محمد بن عثمان بن أبي شيبة حدثنا ضرار بن صرد حدثنا علي بن هشام عن عبيد الله بن أبي رافع عن أبيه في تسمية من شهد مع علي رضي الله عنه الحجاج بن عمرو بن غزية وهو الذي كان يقول عند اللقاء يا معشر الأنصار أتريدون أن تقولوا لربنا إذا لقيناه \"ربنا إنا أطعنا سادتنا وكبراءنا فأضلونا السبيلا ربنا آتهم ضعفين من العذاب والعنهم لعنا كبيرا \"؟."
    },
    {
      "ayah": 69,
      "surah": 33,
      "text": "قال البخاري عند تفسير هذه الآية حدثنا إسحاق بن إبراهيم حدثنا روح بن عبادة حدثنا عوف عن الحسن ومحمد وخلاس عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم \"إن موسى كان رجلا حييا وذلك قوله تعالى: \"يا أيها الذين آمنوا لا تكونوا كالذين آذوا موسى فبرأه الله مما قالوا وكان عند الله وجيها \"هكذا أورد هذا الحديث ههنا مختصرا جدا وقد رواه في أحاديث الأنبياء بهذا السند بعينه عن أبي هريرة قال: قال رسول الله صلى الله عليه وسلم \"إن موسى عليه السلام كان رجلا حيا ستيرا لا يرى من جلده شيء استحياء منه فآذاه من آذاه من بني إسرائيل فقالوا ما يتستر هذا التستر إلا من عيب في جلده إما برص وإما أدرة وإما آفة وإن الله عز وجل أراد أن يبرئه مما قالوا لموسى عليه السلام فخلا يوما وحده فخلع ثيابه على حجر ثم اغتسل فلما فرغ أقبل على ثيابه ليأخذها وإن الحجر عدا بثوبه فأخذ موسى عصاه وطلب الحجر فجل يقول: ثوبي حجر ثوبي حجر حتى انتهى إلى ملإ من بني إسرائيل فرأوه عريانا أحسن ما خلق الله عز وجل وأبرأه مما يقولون وقام الحجر فأخد ثوبه فلبسه وطفق بالحجر ضربا بعصاه فوالله إن بالحجر لندبا من أثر ضربه ثلاثة أو أربعا أو خمسا قال فذلك قوله تعالى: \"يا أيها الذين آمنوا لا تكونوا كالذين آذوا موسى فبرأه الله مما قالوا وكان عند الله وجيها \"وهذا سياق حسن مطول وهذا الحديث من أفراد البخاري دون مسلم وقال الإمام أحمد حدثنا روح حدثنا عوف عن الحسن عن النبي صلى الله عليه وسلم وخلاس ومحمد عن أبي هريرة عن النبي صلى الله عليه وسلم أنه قال في هذه الآية \"يا أيها الذين آمنوا لا تكونوا كالذين آذوا موسى فبرأه الله مما قالوا وكان عند الله وجيها \"قال: قال رسول الله صلى الله عليه وسلم: \"إن موسى كان رجلا حييا ستيرا لا يكاد يرى من جلده شيء استحياء منه\"ثم ساق الحديث كما رواه البخاري مطولا ورواه عنه في تفسيره عن روح عن عوف به ورواه ابن جرير من حديث الثوري عن جابر الجعفي عن عامر الشعبي عن أبي هريرة عن النبي صلى الله عليه وسلم بنحو هذا وهكذا رواه من حديث سليمان بن مهران الأعمش عن المنهال بن عمرو عن سعيد بن جبير وعبد الله بن الحارث عن ابن عباس في قوله \"لا تكونوا كالذين آذوا موسى \"قال: قال قومه له إنك آدر فخرج ذات يوم ويغتسل فوضع ثيابه على صخرة فخرجت الصخرة تشتد بثيابه وخرج يتبعها عريانا حتى انتهت به مجالس بني إسرائيل قال فرأوه ليس بآدر فذلك قوله: \"فبرأه الله مما قالوا \"وهكذا رواه العوفي عن ابن عباس رضي الله عنهما سواء. وقال الحافظ أبو بكر البزار حدثنا روح بن حاتم وأحمد بن المعلى الآدمي قالا حدثنا يحيى بن حماد حدثنا حماد بن سلمة عن علي بن زيد عن أنس عن النبي صلى الله عليه وسلم قال: \"كان موسى عليه السلام رجلا حييا وأنه أتى أحسبه قال الماء ليغتسل فوضع ثيابه على صخرة وكان لا يكاد تبدو عورته فقال بنو إسرائيل إن موسى آدر أوبه آفة - يعنون أنه لا يضع ثيابه - فاحتملت الصخرة ثيابه حتى صارت بحذاء مجالس بني إسرائيل فنظروا إلى موسى كأحسن الرجال أو كما قال - فذلك قوله: \"فبرأه الله مما قالوا وكان عند الله وجيها\" وقال ابن أبي حاتم حدثنا أبي حدثنا سعيد بن سليمان حدثنا عباد بن العوام عن سفيان بن حسين عن الحكم عن سعيد بن جبير عن ابن عباس عن علي بن أبي طالب رضي الله عنه في قوله: \"فبرأه الله مما قالوا \"قال صعد موسى وهارون الجبل فمات هارون عليه السلام فقال بنو إسرائيل لموسى عليه السلام أنت قتلته كان ألين لنا منك وأشد حياء فأذوه من ذلك فأمر الله الملائكة فحملته فمروا على مجالس بني إسرائيل فتكلمت بموته فما عرف موضع قبره إلا الرخم وإن الله جعله أصم أبكم وهكذا رواه ابن جرير عن علي بن موسى الطوسي عن عباد بن العوام به ثم قال وجائز أن يكون هذا هو المراد بالأذى وجائز أن يكون الأول هو المراد فلا قول أولى من قول الله عز وجل قلت يحتمل أن يكون الكل مرادا وأن يكون معه غيره والله أعلم قال الإمام أحمد حدثنا أبو معاوية حدثنا الأعمش عن شقيق عن عبد الله قال: قسم رسول الله صلى الله عليه وسلم ذات يوم قسما فقال رجل من الأنصار إن هذه القسمة ما أريد بها وجه الله قال فقلت يا عدو الله أما لأخبرن رسول الله صلى الله عليه وسلم بما قلت فذكرت ذلك للنبي صلى الله عليه وسلم فاحمر وجهه ثم قال \"رحمة الله على موسى فقد أوذي بأكثر من هذا فصبر\"أخرجاه في الصحيحين من حديث سليمان بن مهران الأعمش به \"طرق أخرى\" قال الإمام أحمد حدثنا حجاج سمعت إسرائيل بن يونس عن الوليد بن أبي هشام مولى همدان عن زيد بن زائدة عن عبد الله بن مسعود قال: قال رسول الله صلى الله عليه وسلم لأصحابه \"لا يبلغني أحد عن أحد من أصحابي شيئا فإني أحب أن أخرج إليكم وأنا سليم الصدر\"فأتي رسول الله صلى الله عليه وسلم مال فقسمه قال فمررت برجلين وأحدهما يقول لصاحبه والله ما أراد محمد بقسمته وجه الله ولا الدار الآخرة قال فثبت حتى سمعت ما قالا ثم أتيت رسول الله صلى الله عليه وسلم فقلت يا رسول إنك قلت لنا: \"لا يبلغني أحد عن أصحابي شيئا\"وإني مررت بفلان وفلان وهما يقولان كذا وكذا فأحمر وجه رسول الله صلى الله عليه وسلم وشق عليه ثم قال دعنا منك لقد أوذي موسى بأكثر من هذا فصبر\"وقد رواه أبو داود في الأدب عن محمد بن يحيى الذهلي عن محمد بن يوسف الفريابي عن إسرائيل عن الوليد بن أبي هشام به مختصرا \"لا يبلغني أحد عن أحد شيئا إني أحب أن أخرج إليكم وأنا سليم الصدر\"وكذا رواه الترمذي في المناقب عن الذهلي سواء إلا أنه قال زيد بن زائدة ورواه أيضا عن محمد بن إسماعيل عن عبد الله بن محمد عن عبيد الله بن موسى وحسين بن محمد كلاهما عن إسرائيل عن السدي عن الوليد بن أبي هشام به مختصرا أيضا فزاد في إسناده السدي ثم قال غريب من هذا الوجه وقوله تعالى: \"وكان عند الله وجيها \"أي له وجاهة وجاه عند ربه عز وجل قال الحسن البصري كان مستجاب الدعوة عند الله وقال غيره من السلف لم يسأل الله شيئا إلا أعطاه ولكن منع الرؤية لما يشاء الله عز وجل وقال بعضهم من وجاهته العظيمة عند الله أنه شفع في أخيه هارون أن يرسله الله معه فأجاب الله سؤاله فقال \"ووهبنا له من رحمتنا أخاه هارون نبيا \"."
    },
    {
      "ayah": 7,
      "surah": 33,
      "text": "يقول تعالى مخبرا أولي العزم الخمسة وبقية الأنبياء أنه أخذ عليهم العهد والميثاق في إقامة دين الله تعالى وإبلاغ رسالته والتعاون والتناصر والاتفاق كما قال تعالى: \"إذ أخذ الله ميثاق النبيين لما آتيتكم من كتاب وحكمة ثم جاءكم رسول مصدق لما معكم لتؤمنن به ولتنصرنه قال أأقررتم وأخذتم على ذلكم إصري قالوا أقررنا قال فاشهدوا وأنا معكم من الشاهدين\" فهذا العهد والميثاق أخذ عليهم بعد إرسالهم وكذلك هذا ونص من بينهم على هؤلاء الخمسة وهم أولوا العزم وهو من باب عطف الخاص على العام وقد صرح بذكرهم أيضا في هذه الآية وفي قوله تعالى: \"شرع لكم من الدين ما وصى به نوحا والذي أوحينا إليك وما وصينا به إبراهيم وموسى وعيسى أن أقيموا الدين ولا تتفرقوا فيه\" فذكر الطرفين والوسط الفاتح والخاتم ومن بينهما على الترتيب فهذه هي الوصية التي أخذ عليهم الميثاق بها كما قال تعالى: \"وإذ أخذنا من النبيين ميثاقهم ومنك ومن نوح وإبراهيم وموسى وعيسى ابن مريم\" فبدأ في هذه الآية بالخاتم لشرفه صلوات الله عليه ثم رتبهم بحسب وجودهم صلوات الله عليهم قال ابن أبي حاتم حدثنا أبو زرعة الدمشقي حدثنا محمد بن بكار حدثنا سعيد بن بشير حدثني قتادة عن الحسن عن أبي هريرة رضي الله عنه عن النبي صلى الله عليه وسلم في قول الله تعالى \"وإذ أخذنا من النبيين ميثاقهم ومنك ومن نوح\" الآية قال النبي صلى الله عليه وسلم \"كنت أول النبيين في الخلق وآخرهم فى البعث فبدأ بي قبلهم\" سعيد بن بشير فيه ضعف وقد رواه سعيد بن أبي عروبة عن قتادة به مرسلا وهو أشبه ورواه بعضهم عن قتادة موقوفا والله أعلم. وقال أبو بكر البزار حدثنا عمرو بن علي حدثنا أبو أحمد حدثنا حمزة الزيات حدثنا عدي بن ثابت عن أبي حازم عن أبى هريرة رضي الله عنه قال: خيار ولد آدم خمسة: نوح وإبراهيم وموسى وعيسى ومحمد صلوات الله وسلامه عليهم أجمعين وخيرهم محمد صلى الله عليه وسلم. موقوف وحمزة فيه ضعف وقد قيل إن المراد بهذا الميثاق الذي أخذ منهم حين أخرجوا فى صورة الذر من صلب آدم عليه السلام كما قال أبو جعفر الرازي عن الربيع بن أنس عن أبي العالية عن أبي بن كعب قال: ورفع أباهم آدم فنظر إليهم يعني ذريته وإن فيهم الغني والفقير وحسن الصورة ودون ذلك فقال: رب لو سويت بين عبادك فقال إني أحببت أن أشكر. ورأى فيهم الأنبياء مثل السرج عليهم النور وخصوا بميثاق آخر من الرسالة والنبوة وهو الذي يقول الله تعالى \"وإذ أخذنا من النبيين ميثاقهم ومنك ومن نوح وإبراهيم وموسى وعيسى ابن مريم\" وهذا قول مجاهد أيضا وقال ابن عباس الميثاق الغليظ العهد."
    },
    {
      "ayah": 70,
      "surah": 33,
      "text": "يقول تعالى آمرا عباده المؤمنين بتقواه وأن يعبدوه عبادة من كأنه يراه وأن يقولوا \"قولا سديدا \"أي مستقيما لا اعوجاج فيه ولا انحراف."
    },
    {
      "ayah": 71,
      "surah": 33,
      "text": "ووعدهم أنهم إذا فعلوا ذلك أثابهم عليه بأن يصلح لهم أعمالهم أي يوفقهم للأعمال الصالحة وأن يغفر لهم الذنوب الماضية وما قد يقع منهم في المستقبل يلهمهم التوبة منها ثم قال تعالى: \"ومن يطع الله ورسوله فقد فاز فوزا عظيما \"وذلك أنه يجار من نار الجحيم ويصير إلى النعيم المقيم. قال ابن أبي حاتم حدثنا أبي حدثنا عمرو بن عوف حدثنا خالد عن ليث عن أبي بردة عن أبي موسى الأشعري قال: صلى بنا رسول الله صلى الله عليه وسلم صلاة الظهر فلما انصرف أومأ إلينا بيده فجلسنا فقال \"إن الله تعالى أمرني أن آمركم أن تتقوا الله وتقولوا قولا سديدا\"ثم أتى النساء فقال \"إن الله أمرني أن آمركى أن تتقين الله وتقلن قولا سديدا\"وقال ابن أبي الدنيا فى كتاب التقوى حدثنا محمد بن عباد بن موسى حدثنا عبدالعزيز بن عمران الزهري حدثنا عيسى بن سبرة عن هشام بن عروة عن أبيه عن عائشة رضي الله عنها قالت: ما قام رسول الله صلى الله عليه وسلم على المنبر إلا سمعته يقول \"يا أيها الذين آمنوا اتقوا الله وقولوا قولا سديدا \"الآية غريب جدا وروى عبد الرحيم بن زيد العمي عن أبيه عن محمد بن كعب عن ابن عباس موقوفا: من سره أن يكون أكرم الناس فليتق الله قال عكرمة القول السديد لا إله إلا الله وقال غيره السديد الصدق وقال مجاهد هو السداد وقال غيره هو الصواب والكل حق."
    },
    {
      "ayah": 72,
      "surah": 33,
      "text": "قال العوفي عن ابن عباس يعني بالأمانة الطاعة عرضها عليهم قبل أن يعرضها على آدم فلم يطقنها فقال لآدم: إني قد عرضت الأمانة على السموات والأرض والجبال فلم يطقنها فهل أنت آخذ بما فيها؟ قال يا رب وما فيها ؟ قال إن أحسنت جزيت وإن أسأت عوقبت فأخذها آدم فتحملها فذلك قوله تعالى: \"وحملها الإنسان إنه كان ظلوما جهولا \"وقال علي بن أبي طلحة عن ابن عباس: الأمانة الفرائض عرضها الله على السموات والأرض والجبال إن أدوها أثابهم وإن ضيعوها عذبهم فكرهوا ذلك وأشفقوا عليه من غير معصية ولكن تعظيما لدين الله أن لا يقوموا بها ثم عرضها على آدم فقبلها بما فيها وهو قوله تعالى: \"وحملها الإنسان إنه كان ظلوما جهولا \"أي غرا بأمر الله وقال ابن جرير حدثنا ابن بشار حدثنا محمد بن جعفر حدثنا شعبة عن أبي بشر عن سعيد بن جبير عن ابن عباس أنه قال في هذه الآية \"إنا عرضنا الأمانة على السموات والأرض والجبال فأبين أن يحملنها وأشفقن منها \"قال عرضت على آدم فقال خذها بما فيها فإن أطعت غفرت له وإن عصيت عذبتك قال قبلت فما كان إلا مقدار ما بين العصر إلى الليل من ذلك اليوم حتى أصاب الخطيئة وقد روى الضحاك عن ابن عباس قريبا من هذا وفيه نظر وانقطاع بن الضحاك وبينه والله أعلم وهكذا قال مجاهد وسعيد بن جبير والضحاك والحسن البصري وغير واحد: إن الأمانة هي الفرائض وقال آخرون هي الطاعة وقال أعمش عن أبي الضحى عن مسروق قال: قال أبي بن كعب من الأمانة أن المرأة اؤتمنت على فرجها وقال قتادة الأمانة الدين والفرائض والحدود وقال بعضهم الغسل من الجنابة وقال مالك عن زيد بن أسلم قال الأمانة ثلاثة الصلاة والصوم والاغتسال من الجنابة وكل هذه الأقوال لا تنافي بينها بل هي متفقة وراجعة إلى أنها التكليف وقبول الأوامر والنواهي بشرطها وهو أنه إن قام بذلك أثيب لأن تركها عوقب فقبلها الإنسان على ضعفه وجهله وظلمه إلا من وفق الله وبالله المستعان قال ابن أبي حاتم حدثنا أبي حدثنا عبد العزيز بن المغيرة البصري حدثنا حماد بن واقد يعني أبا عمر الصفار سمعت أبا معمر يعني عون بن معمر يحدث عن الحسن يعني البصري أنه تلا هذه الآية \"إنا عرضنا الأمانة على السموات والأرض والجبال \"قال عرضها على السبع الطباق الطرائق التي زينت بالنجوم وحملة العرش العظيم فقيل لها هل تحملين الأمانة وما فيها؟ قالت وما فيها؟ قال قيل لها إن أحسنت جزيت وإن أسأت عوقبت قالت: لا ثم عرضها على الأرضين السبع الشداد التي شدت بالأوتاد وذللت بالمهاد قال فقيل لها هل تحملين الأمانة وما فيها؟ قالت وما فيها؟ قال قيل لها إن أحسنت جزيت وإن أسأت عوقبت قالت: لا ثم عرضها على الجبال الشم الشوامخ الصعاب الصلاب قال قيل لها هل تحملين الأمانة وما فيها ؟ قالت وما فيها ؟ قال لها إن أحسنت جزيت وإن أسأت عوقبت قالت: لا وقال مقاتل بن حيان إن الله تعالى حين خلق خلقه جمع بين الإنس والجن والسموات والأرض والجبال فبدأ بالسموات فعرض عليهن الأمانة وهي الطاعة فقال لهن أتحملن هذه الأمانة ولكن على الفضل والكرامة والثواب في الجنة؟ فقلن يا رب إنا لا نستطيع هذا الأمر وليس بنا قوة ولكنا لك مطيعين ثم عرض الأمانة على الأرضين فقال لهن: أتحملن هذه الأمانة وتقبلنها مني وأعطيكن الفضل والكرامة في الدنيا؟ فقلن لا صبر لنا على هذا يا رب ولا نطيق ولكنا لك سامعين مطيعين لا نعصيك في شيء أمرتنا به ثم قرب آدم فقال له أتحمل هذه الأمانة وترعاها حق رعايتها؟ فقال عند ذلك آدم ما لي عندك ؟ قال يا آدم إن أحسنت وأطعت ورعيت الأمانة فلك عندي الكرامة والفضل وحسن الثواب في الجنة وإن عصيت ولم ترعها حق رعايتها وأسأت فإني معذبك ومعاقبك وأنزلك النار قال رضيت يا رب وأتحملها فقال الله عز وجل عند ذلك قد حملتكها فذلك قوله تعالى: \"وحملها الإنسان \"رواه ابن أبى حاتم وعن مجاهد أنه قال عرضها على السموات فقالت يا رب حملتني الكواكب وسكان السماء وما ذكر وما أريد ثوابا ولا أحمل فريضة قال وعرضها على الأرض فقالت يا رب غرست في الأشجار وأجريت في الأنهار وسكان الأرض وما ذكر وما أريد ثوابا ولا أحمل فريضة وقالت الجبال مثل ذلك قال الله تعالى: \"وحملها الإنسان إنه كان ظلوما جهولا \"في عاقبة. أمره وهكذا قال ابن جريج وعن ابن أشوع أنه قال لما عرض الله عليهن حمل الأمانة ضججن إلى الله ثلاثة أيام ولياليهن وقلن ربنا لا طاقة لنا بالعمل ولا نريد الثواب ثم قال ابن أبي حاتم حدثنا أبي حدثنا هارون بن زيد بن أبي الزرقاء الموصلي حدثنا أبي حدثنا هشام بن سعد عن زيد بن أسلم في هذه الآية \"إنا عرضنا الأمانة على السموات والأرض \"الآية قال الإنسان بين أذني وعاتقي فقال الله عز وجل إنى معينك عليها إني معينك على عينيك بطبقتين فإذا نازعاك إلى ما أكره فأطبق ومعينك على لسانك بطبقتين فإذا نازعك إلى ما أكره فأطبق ومعينك على فرجك بلباس فلا تكشفه إلى ما أكره ثم روي عن أبي حازم نحو هذا وقال ابن جرير حدثنا يونس حدثنا ابن وهب قال قال ابن زيد في قول الله تعالى: \"إنا عرضنا الأمانة على السموات والأرض والجبال \"الآية قال إن الله تعالى عرض عليهن الأمانة أن يفترض عليهن الدين ويجعل لهن ثوابا وعقابا ويستأمنهن على الدين فقلن لا نحن مسخرات لأمرك لا نريد ثوابا ولا عقابا قال وعرضها الله تبارك وتعالى على آدم فقال بين أذني وعاتقي قال ابن زيد فقال الله تعالى له: أما إذا تحملت هذا فسأعينك أجعل لبصرك حجابا فإذا خشيت أن تنظر إلى ما لا يحل لك فأرخ عليه حجابه وأجعل للسانك بابا وغلقا فإذا خشيت فأغلق وأجعل لفرجك لباسا فلا تكشفه إلا على ما أحللت لك وقال ابن جرير حدثني سعيد بن عمرو السكوني حدثنا بقية حدثنا عيسى بن إبراهيم عن موسى بن أبي حبيب عن الحكم بن عمير رضي الله عنه وكان من أصحاب النبي صلى الله عليه وسلم قال: قال رسول الله صلى الله عليه وسلم \"إن الأمانة والوفاء نزلا على ابن آدم مع الأنبياء فأرسلوا به فمنهم رسول الله ومنهم نبي ومنهم نبي رسول ونزل القرآن وهو كلام الله وأنزلت العجمية والعربية فعلموا أمر القرآن وعلموا أمر السنن بألسنتهم ولم يدع الله تعالى شيئا من أمره مما يأتون وما يجتنبون وهي الحجـج عليهم إلا بينة لهم فليس أهل لسان إلا وهم يعرفون الحسن والقبيح ثم الأمانة أول شيء يرفع ويبقى أثرها في جذور قلوب الناس ثم يرفع الوفاء والعهد والذمم وتبقى الكتب فعالم يعمل وجاهل يعرفها وينكرها ولا يحملها حتى وصل إلي وإلى أمتي ولا يهلك على الله إلا هالك ولا يغفل إلا تارك فالحذر أيها الناس وإياكم والوسواس الخناس فإنما يبلوكم أيكم أحسن عملا\" هذا حديث غريب جدا وله شواهد من وجوه أخرى ثم قال ابن جرير حدثنا محمد بن خلف العسقلاني حدثنا عبيد الله بن عبد المجيد الحنفي حدثنا أبو العوام القطان حدثنا قتادة وأبان بن أبي عياش عن خليد العصري عن أبي الدرداء رضي الله عنه قال قال رسول الله صلى الله عليه وسلم \"خمس من جاء بهن يوم القيامة مع إيمان دخل الجنة: من حافظ على الصلوات الخمس على وضوئهن وركوعهن وسجودهن ومواقيتهن وأعطى الزكاة من ماله طيب النفس بها وكان يقول وايم الله لا يفعل ذلك إلا مؤمن وأدى الأمانة\"قالوا يا أبا الدرداء وما أداء الأمانة؟ قال رضي الله عنه الغسل من الجنابة فإن الله تعالى لم يأمن ابن آدم على شيء من دينه غيره وهكذا رواه أبو داود عن محمد بن عبد الرحمن العنبري عن عبيد الله بن عبد المجيد الحنفي عن أبي العوام عمر بن داود القطان به وقال ابن جرير أيضا حدثنا تميم بن المنتصر أخبرنا إسحاق عن شريك عن الأعمش عن عبد الله بن السائب عن زاذان عن عبد الله بن مسعود رضي الله عنه عن النبي صلى الله عليه وسلم أنه قال: \"القتل في سبيل الله يكفر الذنوب كلها أو قال يكفر كل شيء إلا الأمانة يؤتي بصاحب الأمانة فيقال له أد أمانتك فيقول أني يا رب وقد ذهبت الدنيا؟ فيقال له أد أمانتك فيقول أني يا رب وقد ذهبت الدنيا؟ فيقال له أد أمانتك فيقول أني يا رب وقد ذهبت الدنيا ؟ فيقول اذهبوا به إلى أمه الهاوية فيذهب به إلى الهاوية فيهوي فيها حتى ينتهي إلى قعرها فيجدها هنالك كهيئتها فيحملها فيضعها على عاتقه فيصعد بها إلى شفير جهنم حتى إذا رأى أنه قد خرج زلت قدمه فهوى في أثرها أبد الآبدين\" قال والأمانة في الصلاة والأمانة في الصوم والأمانة في الوضوء والأمانة في الحديث وأشد ذلك الودائع فلقيت البراء فقلت ألا تسمع ما يقول أخوك عبد الله؟ فقال صدق وقال شريك وحدثنا عياش العامري عن زاذان عن عبد الله بن مسعود رضي الله عنه عن النبي صلى الله عليه وسلم بنحوه ولم يذكر الأمانة في الصلاة وفي كل شيء إسناده جيد ولم يخرجوه ومما يتعلق بالأمانة الحديث الذي رواه الإمام أحمد حدثنا أبو معاوية حدثنا الأعمش عن زيد بن وهب عن حذيفة رضي الله عنه قال: حدثنا رسول الله صلى الله عليه وسلم حديثين قد رأيت أحدهما وأنا أنتظر الآخر حدثنا أن الأمانة نزلت في جذر قلوب الرجال ثم نزل القرآن فعلموا من القرآن وعلموا من السنة. ثم حدثنا عن رفع الأمانة فقال: ينام الرجل النومة فتقبض الأمانة من قلبه فيظل أثرها مثل أثر المجل كجمر دحرجته على رجلك تراه منتبرا وليس فيه شيء قال: ثم أخذ حصى فدحرجه على رجله قال فيصبح الناس يتبايعون لا يكاد أحد يؤدي الأمانة حتى يقال إن في بني فلان رجلا أمينا حتى يقال للرجل ما أجلده وأظرفه وأعقله وما في قلبه حبة خردل من إيمان ولقد أتى علي زمان وما أبالي أيكم بايعت إن كان مسلما ليردنه على دينه وإن كان نصرانيا أو يهوديا ليردنه على ساعيه فأما اليوم فما كنت أبايع منكم إلا فلانا وفلانا وأخرجاه في الصحيحين من حديث الأعمش به. وقال الإمام أحمد حدثنا حسن حدثنا ابن لهيعة عن الحارث بن يزيد الحضرمي عن عبد الله بن عمرو رضي الله عنهما أن رسول الله صلى الله عليه وسلم قال: \"أربع إذا كن فيك فلا عليك ما فاتك من الدنيا حفظ أمانة وصدق حديث وحسن خليقة وعفة طعمة هكذا رواه الإمام أحمد في مسند عبد الله بن عمرو بن العاص رضي الله عنهما وقد قال الطبراني في مسند عبد الله بن عمر بن الخطاب رضي الله عنهما حدثنا يحيى بن أيوب العلاف المصري حدثنا سعيد بن أبي مريم حدثنا ابن لهيعة عن الحارث بن يزيد عن ابن حجيرة عن عبد الله بن عمر قال: قال رسول الله صلى الله عليه وسلم أربع إذا كن فيك فلا عليك ما فاتك من الدنيا حفظ أمانة وصدق حديث وحسن خليقة وعفة طعمة\"فزاد في الإسناد ابن حجيرة وجعله في مسند ابن عمر رضي الله عنهما وقد ورد النهي عن الحلف بالأمانة قال عبد الله بن المبارك في كتاب الزهد حدثنا شريك عن أبي إسحاق الشيباني عن خناس بن سحيم أو قال جبلة بن سحيم قال أقبلت مع زياد بن حدير من الجابية فقلت في كلامي لا والأمانة فجعل زياد يبكي ويبكي فظننت أني أتيت أمرا عظيما فقلت له أكان يكره هذا؟ قال نعم: كان عمر بن الخطاب ينهى عن الحلف بالأمانة أشد النهي وقد ورد في ذلك حديث مرفوع قال أبو داود حدثنا أحمد بن عبد الله بن يونس حدثنا زهير حدثنا الوليد بن ثعلبة الطائي عن ابن بريدة عن أبيه رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم \"من حلف بالأمانة فليس منا\" تفرد به أبو داود رحمه الله."
    },
    {
      "ayah": 73,
      "surah": 33,
      "text": "وقوله تعالى: \"ليعذب الله المنافقين والمنافقات والمشركين والمشركات\" أي إنما حمل بني آدم الأمانة وهي التكاليف ليعذب الله المنافقين منهم والمنافقات وهم الذين يظهرون الإيمان خوفا من أهله ويبطنون الكفر متابعة لأهله \"والمشركين والمشركات\" وهم الذين ظاهرهم وباطنهم على الشرك بالله ومخالفة رسله \"ويتوب الله على المؤمنين والمؤمنات\" أي وليرحم المؤمنين من الخلق الذين آمنوا بالله وملائكته وكتبه ورسله العاملين بطاعته \"وكان الله غفورا رحيما\" آخر تفسير سورة الأحزاب ولله الحمد والمنة."
    },
    {
      "ayah": 8,
      "surah": 33,
      "text": "وقوله تعالى \"ليسأل الصادقين عن صدقهم\" قال مجاهد المبلغين المؤدين عن الرسل وقوله تعالى \"وأعد للكافرين\" أي من أممهم \"عذابا أليما\" أي موجعا فنحن نشهد أن الرسل قد بلغوا رسالات ربهم ونصحوا الأمم وأفصحوا لهم عن الحق المبين الواضح الجلي الذي لا لبس فيه ولا شك ولا امتراء وإن كذبهم من كذبهم من الجهلة والمعاندين والمارقين والقاسطين فما جاءت به الرسل هو الحق ومن خالفهم فهو على الضلال كما يقول أهل الجنة \"لقد جاءت رسل ربنا بالحق\"."
    },
    {
      "ayah": 9,
      "surah": 33,
      "text": "يقول تعالى مخبرا عن نعمته وفضله وإحسانه إلى عباده المؤمنين في صرفه أعداءهم وهزمه إياهم عام تألبوا عليهم وتحزبوا وذلك عام الخندق وذلك في شوال سنة خمس من الهجرة على الصحيح المشهور وقال موسى بن عقبة وغيره كان في سنة أربع وكان سبب قدوم الأحزاب أن نفرا من أشراف يهود بني النضير الذين كانوا قد أجلاهم رسول الله صلى الله عليه وسلم من المدينة إلى خيبر منهم سلام بن أبي الحقيق وسلام بن مشكم وكنانة بن الربيع خرجوا إلى مكة فاجتمعوا بأشراف قريش وألبوهم على حرب النبي صلى الله عليه وسلم ووعدوهم من أنفسهم النصر والإعانة فأجابوهم إلى ذلك ثم خرجوا إلى غطفان فدعوهم فاستجابوا لهم أيضا وخرجت قريش في أحابيشها ومن تابعها وقائدهم أبو سفيان صخر بن حرب وعلى غطفان عيينة بن حصن بن بدر والجميع قريب من عشرة آلاف فلما سمع رسول الله صلى الله عليه وسلم بمسيرهم أمر المسلمين بحفر الخندق حول المدينة مما يلي الشرق وذلك بإشارة سلمان الفارسي رضي الله عنه فعمل المسلمون فيه واجتهدوا ونقل معهم رسول الله صلى الله عليه وسلم التراب وحفر وكان في حفره ذلك آيات ودلائل واضحات وجاء المشركون فنزلوا شرقي المدينة قريبا من أحد ونزلت طائفة منهم في أعالي أرض المدينة."
    }
  ]
}
