{
  "ayahs": [
    {
      "ayah": 1,
      "surah": 34,
      "text": "يخبر تعالى عن نفسه الكريمة أن له الحمد المطلق في الدنيا والآخرة لأنه المنعم المتفضل على أهل الدنيا والآخرة المالك لجميع ذلك الحاكم في جميع ذلك كما قال تعالى \" وهو الله لا إله إلا هو له الحمد في الأولى والآخرة وله الحكم وإليه ترجعون \" ولهذا قال تعالى ههنا \" الحمد لله الذي له ما في السموات وما في الأرض \" أي الجميع ملكه وعبيده وتحت تصرفه وقهره قال تعالى: \" وإن لنا للآخرة والأولى \" ثم قال عز وجل \" وله الحمد في الآخرة \" فهو المعبود أبدا المحمود على طول المدى وقوله تعالى: \" وهو الحكيم \" أي في أقواله وأفعاله وشرعه وقدره \"الخبير\" الذي لا تخفى عليه خافية ولا يغيب عنه شيء وقال مالك عن الزهري خبير بخلقه حكيم بأمره ولهذا قال عز وجل."
    },
    {
      "ayah": 10,
      "surah": 34,
      "text": "يخبر تعالى عما أنعم به على عبده ورسوله داود عليه الصلاة والسلام مما آتاه من الفضل المبين وجمع له بين النبوة والملك المتمكن والجنود ذوي العدد والعدد وما أعطاه ومنحه من الصوت العظيم الذي كان إذا سبح به تسبح معه الجبال الراسيات الصم الشامخات وتقف له الطيور السارحات والغاديات والرامحات وتجاوبه بأنواع اللغات وفي الصحيح أن رسول الله صلى الله عليه وسلم سمع صوت أبي موسى الأشعري رضي الله عنه يقرأ من الليل فوقف فاستمع لقراءته ثم قال: لقد أوتي هذا مزمارا من مزامير آل داود وقال أبو عثمان النهدي ما سمعت صوت صنج ولا بربط ولا وتر أحسن من صوت أبي موسى الأشعري رضي الله عنه ومعنى قوله تعالى \" أوبي \" أي سبحي قاله ابن عباس ومجاهد وغير واحد وزعم أبو ميسرة أنه بمعنى سبحي بلسان الحبشة وفي هذا نظر فإن التأويب في اللغة هو الترجيع فأمرت الجبال والطير أن ترجع معه بأصواتها وقال أبو القاسم عبد الرحمن بن إسحاق الزجاجي في كتابه - الجمل - فى باب النداء منه \"يا جبال أوبي معه \" أي سيري معه بالنهار كله والتأويب سير النهار كله والإسآد سير الليل كله وهذا لفظه وهو غريب جدا لم أره لغيره وإن كان له مساعدة من حيث اللفظ في اللغة لكنه بعيد في معنى الآية ههنا والصواب أن المعنى في قوله تعالى \" أوبي معه \" أى رجعي معه مسبحة كما تقدم والله أعلم وقوله تعالى: \" وألنا له الحديد \" قال الحسن البصري وقتادة والأعمش وغيرهم كان لا يحتاج أن يدخله نارا ولا يضربه بمطرقة بل كان يفتله بيده مثل الخيوط ولهذا."
    },
    {
      "ayah": 11,
      "surah": 34,
      "text": "قال تعالى: \"أن اعمل سابغات \" وهي الدروع قال قتادة وهو أول من عملها من الخلق وإنما كانت قبل ذلك صفائح وقال ابن أبي حاتم حدثنا علي بن الحسين حدثنا ابن سماعة حدثنا ابن ضمرة عن ابن شوذب قال: كان داود عليه السلام يرفع في كل يوم درعا فيبيعها بستة آلاف درهم ألفين له ولآله وأربعة آلاف درهم يطعم بها بني إسرائيل خبز الحواري \" وقدر في السرد \" هذا إرشاد من الله تعالى لنبيه داود عليه السلام في تعليمه صنعة الدروع قال مجاهد في قوله تعالى \" وقدر في السرد \" لا تدق المسمار فيقلق في الحلقة ولا تغلظه فيقصمها واجعله بقدر وقال الحكم بن عيينة لا تغلظه فيقصم ولا يدفه فيقلق وهكذا روي عن قتادة وغير واحد وقال علي بن أبي طلحة عن ابن عباس السرد: هو حلق الحديد وقال بعضهم يقال درع مسرودة إذا كانت مسمورة الحلق واستشهد بقول الشاعر: وعليهما مسرودتان قضاهما داود أو صنع السوابغ تبع وقد ذكر الحافظ ابن عساكر في ترجمة داود عليه الصلاة والسلام من طريق إسحاق بن بشر وفيه كلام عن أبي إلياس عن وهب بن منبه ما مضمونه أن داود عليه السلام كان يخرج متنكرا فيسأل الركبان عنه وعن سيرته فلا يسأل أحدا إلا أثنى عليه خيرا في عبادته وسيرته وعدله عليه السلام قال وهب حتى بعث الله تعالى ملكا فى صورة رجل فلقيه داود عليه الصلاة والسلام فسأله كما كان يسأل غيره فقال هو خير الناس لنفسه ولأمته إلا أن فيه خصلة لو لم تكن فيه كان كاملا قال ما هي؟ قال يأكل ويطعم عياله من مال المسلمين يعني بيت المال فعند ذلك نصب داود عليه السلام إلى ربه عز وجل فى الدعاء أن يعلمه عملا بيده يستغني به ويغني به عياله فألان الله عز وجل له الحديد وعلمه صنعة الدروع فعمل الدروع وهو أول من عملها فقال الله تعالى: \" أن اعمل سابغات وقدر في السرد \" يعني مسامير الحلق قال وكان عمل الدرع فإذا ارتفع من عمله درع باعها فتصدق بثلثها واشترى بثلثها ما يكفيه وعياله وأمسك الثلث يتصدق به يوما بيوم إلى أن يعمل غيرها وقال إن الله تعالى أعطى داود شيئا لم يعطه غيره من حسن الصوت إنه كان إذا قرأ الزبور تجتمع الوحوش إليه حتى يؤخذ بأعناقها وما تنفر وما صنعت الشياطين المزامير والبرابط والصنوج إلا على أصناف صوته عليه السلام وكان شديد الاجتهاد وكان إذا افتتح الزبور بالقراءة كأنما ينفخ في المزامير وكان قد أعطي سبعين مزمارا في حلقه وقوله تعالى \" واعملوا صالحا \" أي في الذي أعطاكم الله تعالى من النعم \" إني بما تعملون بصير \" أي مراقب لكم بصير بأعمالكم وأقوالكم لا يخفى علي من ذلك شيء."
    },
    {
      "ayah": 12,
      "surah": 34,
      "text": "لما ذكر تعالى ما أنعم به على داود عطف بذكر ما أعطى ابنه سليمان عليهما السلام من تسخير الريح له تحمل بساطه غدوها شهر ورواحها شهر قال الحسن البصري كان يغدو على بساطه من دمشق فينزل بإصطخر يتغدى بها ويذهب رائحا من اصطخر فيبيت بكابل وبين دمشق واصطخر شهر كامل للمسرع وبين اصطخر وكابل شهر كامل للمسرع وقوله تعالى \" وأسلنا له عين القطر \" قال ابن عباس رضي الله عنهما ومجاهد وعكرمة وعطاء الخراساني وقتادة والسدي ومالك عن زيد بن أسلم وعبد الرحمن بن زيد بن أسلم وغير واحد القطر النحاس قال قتادة وكانت باليمن فكل ما يصنع الناس مما أخرج الله تعالى لسليمان عليه السلام قال السدي وإنما أسيلت له ثلاثة أيام وقوله تعالى: \"ومن الجن من يعمل بين يديه بإذن ربه \" أي وسخرنا له الجن يعملون بين يديه بإذن ربه أي بقدره وتسخيره لهم بمشيئته ما يشاء من البنايات وغير ذلك \" ومن يزغ منهم عن أمرك \" أي ومن يعدل ويخرج منهم عن الطاعة \" نذقه من عذاب السعير \" وهو الحريق وقد ذكر ابن أبي حاتم ههنا حديثا غريبا فقال حدثنا أبي حدثنا أبو صالح حدثنا معاوية بن صالح عن أبي الزهراء عن جبير بن نفير عن أبي ثعلبة الخشني رضي الله عنه أن رسول الله صلى الله عليه وسلم قال: الجن على ثلاثة أصناف صنف لهم أجنحة يطيرون في الهواء وصنف حيات وكلاب وصنف يحلون ويظعنون رفعه غريب جدا وقال أيضا حدثنا أبي حدثنا حرملة حدثنا ابن وهب أخبرني بكر بن مضر عن محمد بن بحير عن ابن أنعم أنه قال: الجن ثلاثة أصناف صنف لهم الثواب وعليهم العقاب وصنف طيارون فيما بين السماء والأرض وصنف حيات وكلاب قال بكر بن مضر ولا أعلم إلا أنه قال حدثني أن الإنس ثلاثة أصناف صنف يظلهم الله بظل عرشه يوم القيامة وصنف كالأنعام بل هم أضل سبيلا وصنف في صور الناس على قلوب الشياطين وقال أيضا حدثنا أبي حدثنا علي بن هاشم بن مرزوق حدثنا سلمة يعني ابن الفضل عن إسماعيل عن الحسن قال الجن ولد إبليس والإنس ولد أدم ومن هؤلاء مؤمنون ومن هؤلاء مؤمنون وهم شركاؤهم في الثواب والعقاب ومن كان من هؤلاء وهؤلاء مؤمنا فهو ولي الله تعالى ومن كان من هؤلاء وهؤلاء كافرا فهو شيطان."
    },
    {
      "ayah": 13,
      "surah": 34,
      "text": "وقوله تعالى: \"يعملون له ما يشاء من محاريب وتماثيل\" أما المحاريب فهي البناء الحسن وهو أشرف شيء في المسكن وصدره وقال مجاهد المحاريب بنيان دون القصور وقال الضحاك هي المساجد وقال قتادة هي القصور والمساجد وقال ابن زيد هي المساكن وأما التماثل فقال عطية العوفي والضحاك والسدي التماثيل الصور قال مجاهد وكانت من نحاس وقال قتادة من طين وزجاج وقوله تعالى: \" وجفان كالجواب وقدور راسيات \" الجواب جمع جابية وهي الحوض الذي يجبى فيه الماء كما قال الأعشى ميمون بن قيس: تروح على آل المحلي جفنة كجـابية الشيـخ العراقي تفهق وقال علي بن أبي طلحة عن ابن عباس رضي الله عنهما كالجواب أي كالجوبة من الأرض وقال العوفي عنه كالحياض وكذا قال مجاهد والحسن وقتادة والضحاك وغيرهم والقدور الراسيات أي الثابتات فى أماكنها لا تتحرك ولا تتحول عن أماكنها لعظمها كذا قال مجاهد والضحاك وغيرهما وقال عكرمة أثافيها منها وقوله تعالى: \" اعملوا آل داود شكرا \" أي وقلنا لهم اعملوا شكرا على ما أنعم به عليكم في الدين والدنيا وشكرا مصدر من غير الفعل أو أنه مفعول له وعلى التقديرين فيه دلالة على أن الشكر يكون بالفعل كما يكون بالقول والنية كما قال الشاعر: أفادتكم النعماء مني ثلاثة يدي ولسانى والضمير المحجبا قال أبو عبد الرحمن السلمي الصلاة شكر والصيام شكر وكل خير تعمله لله عز وجل شكر وأفضل الشكر الحمد رواه ابن جرير وروى هو وابن أبي حاتم عن محمد بن كعب القرظي قال الشكر تقوى الله تعالى والعمل الصالح وهذا يقال لمن هو متلبس بالفعل. وقد كان آل داود عليهم السلام كذلك قائمين بشكر الله تعالى قولا وعملا قال ابن أبي حاتم حدثنا أبي حدثنا عبد الله بن أبي بكر حدثنا جعفر يعني ابن سليمان عن ثابت البناني قال كان داود عليه السلام قد جزأ على أهله وولده ونسائه الصلاة فكان لا تأتي عليهم ساعة من الليل والنهار إلا وإنسان من آل داود قائم يصلي فغمرتهم هذه الآية \" اعملوا آل داود شكرا وقليل من عبادي الشكور \" وفي الصحيحين عن رسول الله صلى الله عليه وسلم أنه قال: إن أحب الصلاة إلى الله تعالى صلاة داود كان ينام نصف الليل ويقوم ثلثه وينام سدسه وأحب الصيام إلى الله تعالى صيام داود كان يصوم يوم ويفطر يوم ولا يفر إذا لاقى وقد روى أبو عبد الله بن ماجه من حديث سعيد بن داود حدثنا يوسف بن محمد بن المنكدر عن أبيه عن جابر رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: قالت أم سليمان بن داود عليهم السلام لسليمان يا بني لا تكثر النوم بالليل فإن كثرة النوم بالليل تترك الرجل فقيرا يوم القيامة وروى ابن أبي حاتم عن داود عليه الصلاة والسلام ههنا أثرا غريبا مطولا جدا وقال أيضا حدثنا أبي حدثنا عمران بن موسى حدثنا أبو زيد قبيصة بن إسحاق الرقي قال: قال فضيل في قوله تعالى: \" اعملوا آل داود شكرا \" قال داود يا رب كيف أشكرك والشكر نعمة منك ؟ قال الآن شكرتني حين قلت إن النعمة مني وقوله تعالى: \" وقليل من عبادي الشكور \" إخبار عن الواقع."
    },
    {
      "ayah": 14,
      "surah": 34,
      "text": "يذكر تعالى كيفية موت سليمان عليه السلام وكيف عمى الله موته على الجان المسخرين له في الأعمال الشاهقة فإنه مكث متوكئا على عصاه وهي منسأته كما قال ابن عباس رضي الله عنهما ومجاهد والحسن وقتادة وغير واحد مدة طويلة نحوا من سنة فلما أكلتها دابة الأرض وهي الأرضة ضعفت وسقط إلى الأرض وعلم أنه قد مات قبل ذلك بمدة طويلة تبينت الجن والإنس أيضا أن الجن لا يعلمون الغيب كما كانوا يتوهمون ويوهمون الناس ذلك قد ورد في ذلك حديث مرفوع غريب وفي صحته نظر قال ابن جرير حدثنا أحمد بن منصور حدثنا موسى بن مسعود حدثنا أبو حذيفة حدثنا إبراهيم بن طهمان عن عطاء عن السائب عن سعيد بن جبير عن ابن عباس رضي الله عنهما عن النبي صلى الله عليه وسلم قال: كان نبي الله سليمان عليه السلام إذا صلى رأى شجرة نابتة بين يديه فيقول لها ما اسمك؟ فتقول كذا فيقول لأي شيء أنت فإن كانت تغرس غرست وإن كانت لدواء كتبت فبينما هو يصلى ذات يوم إذ رأى شجرة بين يديه فقال لها ما اسمك ؟ قالت الخروب قال لأي شيء أنت؟ قالت لخراب هذا البيت فقال سليمان عليه السلام اللهم عم على الجن موتي حتى يعلم الإنس أن الجن لا يعلمون الغيب فنحتها عصا فتوكأ عليها حولا ميتا والجن تعمل فأكلتها الأرضة فتبينت الإنس أن الجن لو كانوا يعلمون الغيب ما لبثوا حولا في العذاب المهين قال وكان ابن عباس يقرؤها كذلك قال فشكرت الجن للأرضة فكانت تأتيها بالماء وهكذا رواه ابن أبي حاتم من حديث إبراهيم بن طهمان به وفي رفعه غرابة ونكارة والأقرب أن يكون موقوفا وعطاء بن أبي مسلم الخراساني له غرابات وفي بعض حديثه نكارة وقال السدي في حديث ذكره عن أبي مالك عن أبي صالح عن ابن عباس رضي الله عنهما وعن مرة الهمداني عن ابن مسعود رضي الله عنه وعن ناس من أصحاب رسول الله رضي الله عنهم قال: كان سليمان عليه الصلاة والسلام يتحرر في بيت المقدس السنة والسنتين والشهر والشهرين وأقل من ذلك وأكثر فيدخل فيه ومعه طعامه وشرابه فأدخله فى المرة التي توفي فيها فكان بدء ذلك أنه لم يكن يوم يصبح فيه إلا ينبت الله في بيت المقدس شجرة فيأتيها فيسألها فيقول ما اسمك فتقول الشجرة اسمي كذا وكذا فإن كانت لغرس غرسها وإن كانت تنبت دواء قالت نبت دواء كذا وكذا فيجعلها كذلك حتى نبتت شجرة يقال لها الخروبة فسألها ما اسمك قالت أنا الخروبة قال ولأي شيء نبت؟ قالت نبت لخراب هذا المسجد قال سليمان عليه الصلاة والسلام ما كان الله ليخربه وأنا حي أنت التي على وجهك هلاكي وخراب بيت المقدس فنزعها وغرسها في حائط له ثم دخل المحراب فقام يصلي متكئا على عصاه فمات ولم تعلم به الشياطين وهم في ذلك يعملون له يخافون أن يخرج عليهم فيعاقبهم وكانت الشياطين تجتمع حول المحراب وكان المحراب له كوى بين يديه وخلفه فكان الشيطان الذي يريد أن يخلع يقول ألست جلدا إن دخلت فخرجت إن ذلك الجانب فيدخل حتى يخرج من الجانب الآخر فدخل شيطان من أولئك فمر ولم يكن شيطان ينظر إلى سليمان عليه السلام في المحراب إلا احترق فمر ولم يسمع صوت سليمان ثم رجع فلم يسلم ثم رجع فوقع في البيت ولم يحترق ونظر إلى سليمان عليه السلام فسقط ميتا فخرج فأخبر الناس أن سليمان قد مات ففتحوا عليه فأخرجوه ووجدوا منسأته وهي العصا بلسان الحبشة قد أكلتها الأرضة ولم يعلموا منذ كم مات فوضعوا الأرضة على العصا فأكلت منها يوما وليلة ثم حسبوا على ذلك النحو فوجدوه قد مات منذ سنة وهي في قراءة ابن مسعود رضي الله عنه فمكثوا يدينون له من بعد موته حولا كاملا فأيقن الناس عند ذلك أن الجن كانوا يكذبونهم ولو أنهم يطلعون على الغيب لعلموا بموت سليمان ولم يلبثوا في العذاب سنة يعملون له وذلك قول الله عز وجل \" ما دلهم على موته إلا دابة الأرض تأكل منسأته فلما خر تبينت الجن أن لو كانوا يعلمون الغيب ما لبثوا في العذاب المهين \" يقول تبين أمرهم للناس أنهم كانوا يكذبونهم ثم إن الشياطين قالوا للأرضة لو كنت تأكلين الطعام أتيناك بأطيب الطعام ولو كنت تشربين الشراب سقيناك أطيب الشراب ولكنا سننقل إليك الماء والطين قال فهم ينقلون إليها ذلك حيث كانت قال ألم تر إلى الطين الذي يكون في جوف الخشب؟ فهو ما تأتيها به الشياطين شكرا لها وهذا الأثر والله أعلم إنما هو مما تلقي من علماء أهل الكتاب وهي وقف لا يصدق منه إلا ما وافق الحق ولا يكذب منها إلا ما خالف الحق والباقي لا يصدق ولا يكذب وقال ابن وهب وأصبغ بن الفرج عن عبد الرحمن بن زيد بن أسلم في قوله تبارك وتعالى \" ما دلهم على موته إلا دابة الأرض تأكل منسأته \" قال: قال سليمان عليه السلام لملك الموت إذا أمرت بي فأعلمني فأتاه فقال: يا سليمان قد أمرت بك قد بقيت لك سويعة فدعا الشياطين فبنوا عليه صرحا من قوارير وليس له باب فقام يصلي فاتكأ على عصاه قال فدخل عليه ملك الموت فقبض روحه وهو متكئ على عصاه ولم يصنع ذلك فرارا من ملك الموت قال والجن تعمل بين يديه وينظرون إليه يحسبون أنه حي قال فبعث الله عز وجل دابة الأرض قال والدابة تأكل العيدان يقال لها القادح فدخلت فيها فأكلتها حتى إذا أكلت جوف العصا ضعفت وثقل عليها فخر ميتا فلما رأت ذلك الجن انفضوا وذهبوا قال فذلك قوله تعالى: \" ما دلهم على موته إلا دابة الأرض تأكل منسأته \" قال أصبغ بلغني عن غيره أنها قامت سنة تأكل منها قبل أن يخر وذكر غير واحد من السلف نحوا من هذا والله أعلم."
    },
    {
      "ayah": 15,
      "surah": 34,
      "text": "كانت سبأ ملوك اليمن وأهلها وكانت التبابعة منهم وبلقيس صاحبة سليمان عليه الصلاة والسلام من جملتهم وكانوا في نعمة وغبطة في بلادهم وعيشهم واتساع أرزاقهم وزروعهم وثمارهم وبعث الله تبارك وتعالى إليهم الرسل تأمرهم أن يأكلوا من رزقه ويشكروه بتوحيده وعبادته فكانوا كذلك ما شاء الله تعالى ثم أعرضوا عما أمروا به فعوقبوا بإرسال السيل والتفرق في البلاد أيدي سبأ شذر مذر كما سيأتي إن شاء الله تعالى تفصيله وبيانه قريبا وبه الثقة قال الإمام أحمد رحمه الله حدثنا أبو عبد الرحمن حدثنا ابن لهيعة عن عبد الله بن هبيرة عن عبد الرحمن بن وعلة قال سمعت ابن عباس يقول إن رجلا سأل رسول الله صلى الله عليه وسلم عن سبإ ما هو أرجل أم امرأة أم أرض؟ قال صلى الله عليه وسلم: بل هو رجل ولد له عشرة فسكن اليمن منهم ستة وبالشام منهم أربعة فأما اليمانيون فمذحج وكندة والأزد والأشعريون وأنمار وحمير وأما الشامية فلخم وجذام وعاملة وغسان ورواه عن عبد عن الحسن بن موسى عن ابن لهيعة به وهذا إسناد حسن ولم يخرجوه وقد رواه الحافظ أبو عمر بن عبد البر في كتاب القصد والأمم بمعرفة أصول أنساب العرب والعجم - من حديث ابن لهيعة عن علقمة بن وعلة عن ابن عباس رضي الله عنهما فذكر نحوه وقد روي نحوه من وجه آخر وقال الإمام أحمد أيضا وعبد بن حميد حدثنا يزيد بن هارون حدثنا أبو حباب عن يحيى بن أبي حية الكلبي عن ابن هارون عن عروة عن فروة بن مسيك رضي الله عنه قال أتيت رسول الله صلى الله عليه وسلم فقلت يا رسول الله أقاتل بمقبل قومي مدبرهم قال رسول الله صلى الله عليه وسلم: نعم فقاتل بمقبل قومك مدبرهم فلما وليت دعاني فقال: لا تقاتلهم حتى تدعوهم إلى الإسلام فقلت يا رسول الله أرأيت سبأ واد هو أو جبل أو ما هو؟ قال صلى الله عليه وسلم: لا بل هو رجل من العرب ولد له عشرة فتيامن ستة وتشاءم أربعة تيامن الأزد والأشعريون وحمير وكندة ومذحج وأنمار الذين يقال لهم بجيلة وخثعم وتشاءم لخم وجذام وعاملة وغسان وهذا أيضا إسناد حسن وإن كان فيه أبو جناب الكلبي وقد تكلموا فيه لكن رواه ابن جرير عن أبي كريب عن العنقري عن أسباط بن نصر عن يحيى بن هانئ المرادي عن عمه أو عن أبيه - شك أسباط - قال قدم فروة بن مسيك رضي الله عنه على رسول الله صلى الله عليه وسلم فذكره \" طريق أخرى \"لهذا الحديث: قال ابن أبي حاتم حدثنا يونس بن عبد الأعلى حدثنا ابن وهب حدثني ابن لهيعة عن توبة بن نمير عن عبد العزيز بن يحيى أنه أخبره قال كنا عند عبيدة بن عبد الرحمن بأفريقية فقال يوما ما أظن قوما بأرض إلا وهم من أهلها فقال علي بن أبي رباح كلا قد حدثني فلان أن فروة بن مسيك الغطيفي رضي الله عنه قدم على رسول الله صلى الله عليه وسلم فقال يا رسول الله إن سبأ قوم كان لهم عز في الجاهلية وإني أخشى أن يرتدوا عن الإسلام أفأقاتلهم فقال صلى الله عليه وسلم: ما أمرت فيهم بشيء بعد فأنزلت هذه الآية \" لقد كان لسبإ في مسكنهم آية \" الآيات فقال له رجل يا رسول الله ما سبأ؟ فذكر مثل الحديث الذي قبله أن رسول الله صلى الله عليه وسلم سئل عن سبإ؟ ما هو أبلد أم رجل أم امرأة ؟ قال صلى الله عليه وسلم: بل رجل ولد له عشرة فسكن اليمن منهم ستة والشام أربعة أما اليمانيون فمذحج وكندة والأزد والأشعريون وأنمار وحمير غير ما حلها وأما الشام فلخم وجذام وغسان وعاملة فيه غرابة من حيث ذكر نزول الآية بالمدينة والسورة مكية كلها والله سبحانه وتعالى أعلم. \"طريق أخرى\" قال ابن جرير حدثنا أبو كريب حدثنا أبو أسامة حدثنا الحسن بن الحكم حدثنا أبو سبرة النخعي عن فروة بن مسيك الغطيفي رضي الله عنه قال: قال رجل يا رسول الله أخبرني عن سبإ ما هو أرض أم امرأة ؟ قال صلى الله عليه وسلم ليس بأرض ولا امرأة ولكنه رجل ولد له عشرة من الولد فتيامن ستة وتشاءم أربعة فأما الذين تشاءموا فلخم وجذام وعاملة وغسان وأما الذين تيامنوا فكندة والأشعريون والأزد ومذحج وحمير وأنمار فقال رجل ما أنمار ؟ قال صلى الله عليه وسلم: الذين منهم خثعم وبجيلة ورواه الترمذي في جامعه عن أبي كريب وعبد بن حميد قال حدثنا أبو أسامة فذكره أبسط من هذا ثم قال هذا حديث حسن غريب وقال أبو عمر بن عبد البر حدثنا عبد الوارث بن سفيان حدثنا قاسم بن أصبغ حدثنا أحمد بن زهير حدثنا عبد الوهاب بن نجدة الحوطي حدثنا ابن كثير هو عثمان بن كثير عن الليث بن سعد عن موسى بن على عن يزيد بن حصين عن تميم الداري رضي الله عنه قال إن رجلا أتى رسول الله صلى الله عليه وسلم فسأله عن سبإ فذكر مثله فقوي هذا الحديث وحسن قال علماء النسب- منهم محمد بن إسحاق-اسم سبأ عبد شمس بن يشجب بن يعرب بن قحطان وإنما سمي سبأ لأنه أول من سبأ في العرب وكان يقال له الرائش لأنه أول من غنم في الغزو فأعطى قومه فسمي الرائش والعرب تسمي المال ريشا ورياشا وذكروا أنه بشر برسول الله صلى الله عليه وسلم في زمانه المتقدم وقال في ذلك شعرا: سيملك بعدنا ملك عظيــم نبي لا يرخص في الحرام ويملك بعــده منهم ملوك يدينوه القياد بكل دامي ويملك بعدهم منا ملوك يصير الملك فينا باقتسام ويملك بعد قحطان نبـــي تقي مخبت خيـر الأنام يسمى أحمد يـالـيت أنـي أعمر بعد مبعثه بعـــام فأعضده وأحبوه بنصـري بــكل مدجج وبـــكل رام متى يظهـر فكونوا ناصريه ومن يلقاه يبلغه سلامي ذكر ذلك الهمذاني في كتاب - الإكليل- واختلفوا في قحطان على ثلاثة أقوال \"أحدها\" أنه من سلالة إرم بن سام بن نوح واختلفوا فى كيفية اتصال نسبه به على ثلاث طرائق \"والثاني\" أنه من سلالة عابر وهو هود عليه الصلاة والسلام واختلفوا أيضا في كيفية اتصال نسبه به على ثلاث طرائق أيضا \"والثالث\" أنه من سلالة إسماعيل بن إبراهيم عليهما الصلاة والسلام واختلفوا في كيفية اتصال نسبه به على ثلاث طرائق أيضا وقد ذكر ذلك مستقصى الحافظ أبو عمر بن عبد البر النمري رحمة الله تعالى عليه في كتابه المسمى - الإنباه على ذكر أصول القبائل الرواة ومعنى قوله صلى الله عليه وسلم: كان رجلا من العرب يعني العرب العاربة الذين كانوا قبل الخليل عليه الصلاة والسلام سام بن نوح وعلى القول الثالث كان من سلالة الخليل عليه الصلاة والسلام ليس هذا بالمشهور عندهم والله أعلم ولكن في صحيح البخاري أن رسول الله صلى الله عليه وسلم مر بنفر من أسلم ينتضلون فقال ارموا بني إسماعيل فإن أباكم كان راميا فأسلم قبيلة من الأنصار والأنصار أوسها وخزرجها من غسان من عرب اليمن من سبإ - نزلوا بيثرب لما تفرقت سبأ في البلاد حين بعث الله عز وجل عليهم سيل العرم ونزلت طائفة منهم بالشام وإنما قيل لهم غسان بماء نزلوا عليه قيل باليمن; وقيل إنه قريب من المشلل كما قال حسان بن ثابت رضي الله عنه: ما سألت فإنا معشر نجب الأزد نسبتنا والماء غسان ومعنى قوله صلى الله عليه وسلم: ولد له عشرة من العرب أي كان من نسله هؤلاء العشرة الذين يرجع إليهم أصول القبائل من عرب اليمن لا أنهم ولدوا من صلبه بل منهم من بينه وبينه الأبوان والثلاثة والأقل والأكثر كما هو مقرر مبين في مواضعه من كتب النسب ومعنى قوله صلى الله عليه وسلم: فتيا من منهم ستة وتشاءم منهم أربعة أي بعد ما أرسل الله تعالى عليهم سيل العرم منهم من أقام ببلادهم ومنهم من نزح عنها إلى غيرها. وكان من أمر السد أنه كان الماء يأتيهم من بين جبلين وتجتمع إليه أيضا سيول أمطارهم وأوديتهم فعمد ملوكهم الأقادم فبنوا بينهما سدا عظيما محكما حتى ارتفع الماء وحكم على حافات ذينك الجبلين فغرسوا الأشجار واستغلوا الثمار في غاية ما يكون من الكثرة والحسن كما ذكر غير واحد من السلف منهم قتادة أن المرأة كانت تمشي تحت الأشجار وعلى رأسها مكتل أو زنبيل وهو الذي تخترف فيه الثمار فيتساقط من الأشجار في ذلك ما يملؤه من غير أن يحتاج إلى كلفة ولا قطاف لكثرته ونضجه واستوائه وكان هذا السد بمأرب بلدة بينها وبين صنعاء ثلاث مراحل ويعرف بسد مأرب وذكر آخرون أنه لم يكن ببلدهم شيء من الذباب ولا البعوض ولا البراغيث ولا شيء من الهوام وذلك لاعتدال الهواء وصحة المزاج وعناية الله بهم ليوحدوه ويعبدوه كما قال تبارك وتعالى: \" لقد كان لسبإ في مسكنهم آية \" ثم فسرها بقوله عز وجل: \" جنتان عن يمين وشمال \" أي من ناحيتي الجبلين والبلدة بين ذلك \"كلوا من رزق ربكم واشكروا له بلدة طيبة ورب غفور\" أي غفور لكم إن استمررتم على التوحيد."
    },
    {
      "ayah": 16,
      "surah": 34,
      "text": "وقوله تعالى \"فأعرضوا \" أي عن توحيد الله وعبادته وشكره على ما أنعم به عليهم وعدلوا إلى عبادة الشمس من دون الله كما قال الهدهد لسليمان عليه الصلاة والسلام \" وجئتك من سبإ بنبإ يقين إن وجدت امرأة تملكهم وأوتيت من كل شيء ولها عرش عظيم وجدتها وقومها يسجدون للشمس من دون الله وزين لهم الشيطان أعمالهم فصدهم عن السبيل فهم لا يهتدون\" وقال محمد بن إسحاق عن وهب بن منبه بعث الله تعالى إليهم ثلاثة عشر نبيا وقال السدي أرسل الله عز وجل إليهم اثني عشر ألف نبي والله أعلم وقوله تعالى: \" فأرسلنا عليهم سيل العرم \" المراد بالعرم المياه وقيل الوادي وقيل الجرذ وقيل الماء الغزير فيكون من باب إضافة الاسم إلى صفته مثل مسجد الجامع وسعيد كرز حكى ذلك السهيلي وذكر غير واحد منهم ابن عباس ووهب بن منبه وقتادة والضحاك أن الله عز وجل لما أراد عقوبتهم بإرسال العرم عليهم بعث على السد دابة من الأرض يقال لها الجرذ نقبته قال وهب بن منبه وقد كانوا يجدون في كتبهم أن سبب خراب هذا السد هو الجرذ فكانوا يرصدون عنده السنانير برهة من الزمان فلما جاء القدر غلبت الفأر السنانير وولجت إلى السد فنقبته فانهار عليهم وقال قتادة وغيره الجرذ هو الخلد نقبت أسافله حتى إذا ضعف ووهى وجاءت أيام السيول صدم الماء البناء فسقط فانساب الماء في أسفل الوادي وخرب ما بين يديه من الأبنية والأشجار وغير ذلك ونضب الماء عن الأشجار التي في الجبلين عن يمين وشمال فيبست وتحطمت وتبدلت تلك الأشجار المثمرة الأفيقة النضرة كما قال الله تبارك وتعالى \" وبدلناهم بجنتيهم جنتين ذواتي أكل خمط \" فإن ابن عباس ومجاهد وعكرمة وعطاء الخراساني والحسن وقتادة والسدي وهو الأراك وأكلة البربر \" وأثل \" قال العوفي عن ابن عباس هو الطرفاء وقال غيره هو شجر يشبه الطرفاء وقيل هو السمر والله أعلم وقوله \" وشيء من سدر قليل \" لما كان أجود هذه الأشجار المبدل بها هو السدر قال \" وشيء من سدر قليل \" فهذا الذي صار أمر تينك الجنتين إليه بعد الثمار النضيجة والمناظر الحسنة والظلال العميقة والأنهار الجارية تبدلت إلى شجر الأراك والطرقاء والسدر ذي الشوك الكثير والثمر القليل; وذلك بسبب كفرهم وشركهم بالله وتكذيبهم الحق وعدولهم عنه إلى الباطل ولهذا."
    },
    {
      "ayah": 17,
      "surah": 34,
      "text": "قال تعالى \"ذلك جزيناهم بما كفروا وهل نجازي إلا الكفور\" أي عاقبناهم بكفرهم قال مجاهد ولا يعاقب إلا الكفور وقال الحسن البصري صدق الله العظيم لا يعاقب بمثل فعله إلا الكفور وقال طاوس لا يناقش إلا الكفور وقال ابن أبي حاتم حدثنا علي بن الحسين حدثنا أبو عمر بن النحاس الرملي حدثنا حجاج بن محمد حدثنا أبو البيداء عن هشام بن صالح التغلبي عن ابن خيرة وكان من أصحاب علي رضي الله عنه قال: جزاء المعصية الوهن في العبادة والضيق في المعيشة والتعسر في اللذة قيل وما التعسر في اللذة؟ قال لا يصادف لذة حلالا إلا جاءه من ينغصه إياها."
    },
    {
      "ayah": 18,
      "surah": 34,
      "text": "يذكر تعالى ما كانوا فيه من النعمة والغبطة والعيش الهنيء الرغيد والبلاد المرضية والأماكن الآمنة والقرى المتواصلة المتقاربة بعضها من بعض مع كثرة أشجارها وزروعها وثمارها بحيث أن مسافرهم لا يحتاج إلى حمل زاد ولا ماء بل حيث نزل وجد ماء وثمرا وقيل في قرية ويبيت في أخرى بمقدار ما يحتاجون إليه في سيرهم ولهذا قال تعالى \" وجعلنا بينهم وبين القرى التي باركنا فيها \" قال وهب بن منبه هي قرى بصنعاء وكذا قال أبو مالك وقال مجاهد والحسن وسعيد بن جبير ومالك عن زيد بن أسلم وقتادة والضحاك والسدي وابن زيد وغيرهم يعني قرى الشام يعنون أنهم كانوا يسيرون من اليمن إلى الشام في قرى ظاهرة متواصلة وقال العوفي عن ابن عباس القرى التي باركنا فيها بيت المقدس وقال العوفي عنه أيضا هي قرى عربية بين المدينة والشام \" قرى ظاهرة \" أي بينة واضحة يعرفها المسافرون يقيلون في واحدة ويبيتون في أخرى ولهذا قال تعالى: \" وقدرنا فيها السير \" أي جعلناها بحسب ما يحتاج المسافرون إليه \" سيروا فيها ليالي وأياما آمنين \" أي الأمن حاصل لهم في سيرهم ليلا ونهارا."
    },
    {
      "ayah": 19,
      "surah": 34,
      "text": "\"فقالوا ربنا باعد بين أسفارنا وظلموا أنفسهم \" وقرأ آخرون \"بعد بين أسفارنا\" وذلك أنهم بطروا هذه النعمة كما قاله ابن عباس ومجاهد والحسن وغير واحد وأحبوا مفاوز ومهامه يحتاجون في قطعها إلى الزاد والرواحل والسير في الحرور والمخاوف كما طلب بنو إسرائيل من موسى أن يخرج الله لهم مما تنبت الأرض من بقلها وقثائها وفومها وعدسها وبصلها مع أنهم كانوا في عيش رغيد في من وسلوى وما يشتهون من مآكل ومشارب وملابس مرتفعة ولهذا قال لهم \" أتستبدلون الذي هو أدنى بالذي هو خير اهبطوا مصرا فإن لكم ما سألتم وضربت عليهم الذلة والمسكنة وباءوا بغضب من الله \" وقال عز وجل \" وكم أهلكنا من قرية بطرت معيشتها \" وقال تعالى: \" وضرب الله مثلا قرية كانت آمنة مطمئنة يأتيها رزقها رغدا من كل مكان فكفرت بأنعم الله فأذاقها الله لباس الجوع والخوف بما كانوا يصنعون \" وقال تعالى في حق هؤلاء \" فقالوا ربنا باعد بين أسفارنا وظلموا أنفسهم \" أي بكفرهم \" فجعلناهم أحاديث ومزقناهم كل ممزق \" أي جعلناهم حديثا للناس وسمرا يتحدثون به من خبرهم وكيف مكر الله بهم وفرق شملهم بعد الاجتماع والألفة والعيش الهنيء تفرقوا في البلاد ههنا وههنا ولهذا تقول العرب في القوم إذا تفرقوا تفرقوا أيدي سبأ وأيادي سبأ وتفرفوا شذر مذر وقال ابن أبي حاتم حدثنا أبو سعيد بن يحيى بن سعيد القطان حدثنا إبراهيم بن حبيب بن الشهيد قال سمعت أبي يقول سمعت عكرمة يحدث بحديث أهل سبأ قال \" لقد كان لسبأ في مسكنهم آية جنتان عن يمين وشمال - إلى قوله تعالى - فأرسلنا عليهم سيل العرم \" وكانت فيهم كهنة وكانت الشياطين يسترقون السمع فأخبروا الكهنة بشيء من أخبار السماء فكان فيهم رجل كاهن شريف كثير المال وأنه خبر أن زوال أمرهم قد دنا وأن العذاب قد أظلهم فلم يدر كيف يصنع لأنه كان له مال كثير من عقار فقال لرجل من بنيه وهو أعزهم أخوالا يا بني إذا كان غدا وأمرتك بأمر فلا تفعله فإذا انتهرتك فانتهرني فإذا لطمتك فالطمني قال يا أبت لا تفعل إن هذا أمر عظيم وأمر شديد; قال يا بني قد حدث أمر لا بد منه فلم يزل به حتى وافاه على ذلك فلما أصبحوا واجتمع الناس قال يا بني افعل كذا وكذا فأبى فانتهره أبوه فأجابه فلم يزل ذلك بينهما حتى تناوله أبوه فلطمه فوثب على أبيه فلطمه فقال ابني يلطمني؟ علي بالشفرة قالوا ما تصنع بالشفرة؟ قال أذبحه قالوا تريد أن تذبح ابنك ؟ الطمه أو اصنع ما بدا لك قال فأبى قال فأرسلوا إلى أخواله فأعلموهم ذلك فجاء أخواله فقالوا خذ منا ما بدا لك فأبى إلا أن يذبحه قالوا فلتموتن قبل أن تذبحه قال فإذا كان الحديث هكذا فإني لا أرى أن أقيم ببلد يحال بيني وبين ابني فيه اشتروا مني دوري اشتروا مني أرضي فلم يزل حتى باع دوره وأرضه وعقاره فلما صار الثمن في يده وأحرزه قال: أي قوم إن العذاب قد أظلكم وزوال أمركم قد دنا فمن أراد منكم دارا جديدا وحمى شديدا وسفرا بعيدا فليلحق بعمان ومن أراد منكم الخمر والخمير والعصير وكلمة- قال إبراهيم لم أحفظها- فليلحق ببصري ومن أراد الراسخات في الوحل المطعمات في المحل المغممات في القحل فليلحق بيثرب ذات نخل فأطاعه قومه فخرج أهل عمان إلى عمان وخرجت غسان إلى بصرى وخرجت الأوس والخزرج وبنو عثمان إلى يثرب ذات النخل قال فأتوا على بطن مر فقال بنو عثمان هذا مكان صالح لا نبغي به بدلا فأقاموا به فسموا لذلك خزاعة لأنهم انخزعوا من أصحابهم واستقامت الأوس والخزرج حتى نزلوا المدينة وتوجه أهل عمان إلى عمان وتوجهت غسان إلى بصرى هذا أثر غريب عجيب وهذا الكاهن هو عمرو بن عامر أحد رؤساء اليمن وكبراء سبأ وكهانهم وقد ذكر محمد بن إسحاق بن يسار في أول السيرة ما كان من أمر عمرو بن عامر الذي كان أول من خرج من بلاد اليمن بسبب استشعاره بإرسال العرم عليهم فقال: وكان سبب خروج عمرو بن عامر من اليمن فيما حدثني به أبو زيد الأنصاري أنه رأى جرذا يحفر في سد مأرب الذي كان يحبس عنهم الماء فيصرفونه حيث شاءوا من أرضهم فعلم أنه لا بقاء للسد على ذلك فاعتزم على النقلة عن اليمن وكاد قومه فأمر أصغر ولده إذا أغلظ له لطمه أن يقوم إليه فيلطمه ففعل ابنه ما أمره به فقال عمرو: لا أقيم ببلد لطم وجهي فيها أصغر ولدي وعرض أمواله فقال أشراف من أشراف اليمن اغتنموا غضبة عمرو فاشتروا منه أمواله وانتقل هو في ولده وولد ولده وقالت الأسد لا نتخلف عن عمرو بن عامر فباعوا أموالهم وخرجوا معه فساروا حتى نزلوا بلاد عك مجتازين يرتادون البلدان فحاربتهم عك وكانت حربهم سجالا ففي ذلك يقول عباس بن مرداس السلمي رضي الله عنه: رعك بن عدنان الذين تلعبوا بغسان حـتى طردوا كل مطرد وهذا البيت من قصيدة له قال ثم ارتحلوا عنهم فتفرقوا في البلدان فنزل آل جفنة بن عمرو بن عامر الشام ونزلت الأوس والخزرج يثرب ونزلت خزاعة مرا ونزلت أزد السراة السراة ونزلت أزد عمان عمان ثم أرسل الله تعالى على السد السيل فهدمه وفي ذلك أنزل الله عز وجل هذه الآيات وقد ذكر السدي قصة عمرو بن عامر بنحو مما ذكر محمد بن إسحاق إلا أنه قال فأمر ابن أخيه مكان ابنه - إلى قوله - فباع ماله وارتحل بأهله فتفرقوا رواه ابن أبي حاتم وقال ابن جرير حدثنا ابن حميد أخبرنا سلمة عن ابن إسحاق قال يزعمون أن عمرو بن عامر وهو عم القوم كان كاهنا فرأى في كهانته أن قومه سيمزقون ويباعد بين أسفارهم فقال لهم إنى قد علمت أنكم ستمزقون فمن كان منكم ذا هم بعيد وحمل شديد ومزاد حديد فليلحق بكاس أو كرود قال فكانت وادعة بن عمرو ومن كان منكم ذا هم مدن وأمر دعن فليلحق بأرض شن فكانت عوف بن عمرو هم الذين يقال لهم بارق ومن كان منكم يريد عيشا آنيا وحرما آمنا فليلحق بالأرزين فكانت خزاعة ومن كان منكم يريد الراسيات في الوحل المطمعات في المحل فليلحق بيثرب ذات النخل فكانت الأوس والخزرج وهما هذان الحيان من الأنصار ومن كان منكم يريد خمرا وخميرا وذهبا وحريرا وملكا وتأميرا فليلحق بكوثي وبصرى فكانت غسان بنو جفنة ملوك الشام ومن كان منهم بالعراق قال ابن إسحاق وقد سمعت بعض أهل العلم يقول إنما قالت هذه المقالة طريقة امرأة عمرو بن عامر وكانت كاهنة فرأت في كهانتها ذلك فالله أعلم أي ذلك كان.وقال سعيد عن قتادة عن الشعبي: أما غسان فلحقوا بعمان فمزقهم الله كل ممزق بالشام وأما الأنصار فلحقوا بيثرب وأما خزاعة فلحقوا بتهامة وأما الأزد فلحقوا بعمان فمزقهم الله كل ممزق.رواه ابن أبي حاتم وابن جرير ثم قال محمد بن إسحاق حدثني أبو عبيدة قال: قال الأعشى أعشى بني قيس بن ثعلبة واسمه ميمون بن قيس: وفي ذاك للمؤتسي أسـوة ومأرب قفى عليها العـرم رجام بنته لهم حميـــر إذا جاء ماؤهم لم يــرم فأروى الزروع وأعنابها علـى سعة ماؤهم إذ قسـم فصاروا أيادي ما يقدرو ن منه على شرب طفل فطـم وقوله تعالى \" إن في ذلك لآيات لكل صبار شكور \" أي إن في هذا الذي حل بهؤلاء من النقمة والعذاب وتبديل النعمة وتحويل العافية عقوبة على ما ارتكبوه من الكفر والآثام لعبرة ودلالة لكل عبد صبار على المصائب شكور على النعم.قال الإمام أحمد حدثنا عبد الرحمن وعبد الرزاق المعني قالا أخبرنا سفيان عن أبي إسحاق عن العيزار بن حريث عن عمر بن سعد عن أبيه هو سعد بن أبي وقاص رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم \" عجبت من قضاء الله تعالى للمؤمن إن أصابه خير حمد ربه وشكر وإن أصابته مصيبة حمد ربه وصبر يؤجر المؤمن في كل شيء حتى في اللقمة يرفعها إلى في امرأته \".وقد رواه النسائي في اليوم والليلة من حديث أبي إسحاق السبيعي به وهو حديث عزيز من رواية عمر بن سعد عن أبيه ولكن له شاهد فى الصحيحين من حديث أبي هريرة رضي الله عنه \" عجبا للمؤمن لا يقضي الله تعالى له قضاء إلا كان خيرا له إن أصابته سراء شكر فكان خيرا له ; وإن أصابته ضراء صبر فكان خيرا له وليس ذلك لأحد إلا للمؤمن \".قال عبد حدثنا يونس عن سفيان عن قتادة \" إن فى ذلك لآيات لكل صبار شكور \" قال كان مطرف يقول: نعم العبد الصبار الشكور الذي إذا أعطي شكر وإذا ابتلي صبر."
    },
    {
      "ayah": 2,
      "surah": 34,
      "text": "\"يعلم ما يلج في الأرض وما يخرج منها\" أي يعلم عدد القطر النازل في أجزاء الأرض والحب المبذور والكامن فيها ويعلم ما يخرج من ذلك عدده وكيفيته وصفاته \" وما ينزل من السماء \" أي من قطر ورزق وما يعرج فيها أي من الأعمال الصالحة وغير ذلك \" وهو الرحيم الغفور \" أي الرحيم بعباده فلا يعاجل عصاتهم بالعقوبة الغفور عن ذنوب التائبين إليه المتوكلين عليه."
    },
    {
      "ayah": 20,
      "surah": 34,
      "text": "يؤمن بالآخرة ممن هو منها في شك وربك على كل شيء حفيظ \" لما ذكر تعالى قصة سبأ وما كان من أمرهم في اتباعهم الهوى والشيطان أخبر عنهم وعن أمثالهم ممن اتبع إبليس والهوى وخالف الرشاد والهدى فقال \" ولقد صدق عليهم إبليس ظنه \" قال ابن عباس رضي الله عنهما وغيره هذه الآية كقوله تعالى: إخبارا عن إبليس حين امتنع من السجود لآدم عليه الصلاة والسلام ثم قال \" أرأيتك هذا الذي كرمت علي لئن أخرتن إلى يوم القيامة لأحتنكن ذريته إلا قليلا \" وقال \" ثم لآتينهم من بين أيديهم ومن خلفهم وعن أيمانهم وعن شمائلهم ولا تجد أكثرهم شاكرين \" والآيات في هذا كثيرة وقال الحسن البصري لما أهبط الله آدم عليه الصلاة والسلام من الجنة ومعه حواء هبط إبليس فرحا بما أصاب منهما وقال إذا أصبت من الأبوين ما أصبت فالذرية أضعف وأضعف وكان ذلك ظنا من إبليس فأنزل الله عز وجل: \" ولقد صدق عليهم إبليس ظنه فاتبعوه إلا فريقا من المؤمنين \" فقال عند ذلك إبليس لا أفارق ابن آدم ما دام فيه الروح أعده وأمنيه وأخدعه فقال الله تعالى وعزتي وجلالي لا أحجب عنه التوبة ما لم يغرغر بالموت ولا يدعوني إلا أجبته ولا يسألني إلا أعطيته ولا يستغفرني إلا غفرت له رواه ابن أبى حاتم.وقوله تبارك وتعالى: \" وما كان له عليهم من سلطان \" قال ابن عباس رضي الله عنهما أي من حجة وقال الحسن البصري والله ما ضربهم بعصا ولا أكرههم على شيء وما كان إلا غرورا وأماني دعاهم إليها فأجابوه.وقوله عز وجل \" إلا لنعلم من يؤمن بالآخرة ممن هو منها في شك \" أي إنما سلطناه عليهم ليظهر أمر من هو مؤمن بالآخرة وقيامها والحساب فيها والجزاء فيحسن عبادة ربه عز وجل في الدنيا بمن هو منها في شك. وقوله تعالى \" وربك على كل شيء حفيظ \" أي ومع حفظه ضل من ضل من اتباع إبليس وبحفظه وكلاءته سلم من سلم من المؤمنين أتباع الرسل."
    },
    {
      "ayah": 21,
      "surah": 34,
      "text": "يؤمن بالآخرة ممن هو منها في شك وربك على كل شيء حفيظ \" لما ذكر تعالى قصة سبأ وما كان من أمرهم في اتباعهم الهوى والشيطان أخبر عنهم وعن أمثالهم ممن اتبع إبليس والهوى وخالف الرشاد والهدى فقال \" ولقد صدق عليهم إبليس ظنه \" قال ابن عباس رضي الله عنهما وغيره هذه الآية كقوله تعالى: إخبارا عن إبليس حين امتنع من السجود لآدم عليه الصلاة والسلام ثم قال \" أرأيتك هذا الذي كرمت علي لئن أخرتن إلى يوم القيامة لأحتنكن ذريته إلا قليلا \" وقال \" ثم لآتينهم من بين أيديهم ومن خلفهم وعن أيمانهم وعن شمائلهم ولا تجد أكثرهم شاكرين \" والآيات في هذا كثيرة وقال الحسن البصري لما أهبط الله آدم عليه الصلاة والسلام من الجنة ومعه حواء هبط إبليس فرحا بما أصاب منهما وقال إذا أصبت من الأبوين ما أصبت فالذرية أضعف وأضعف وكان ذلك ظنا من إبليس فأنزل الله عز وجل: \" ولقد صدق عليهم إبليس ظنه فاتبعوه إلا فريقا من المؤمنين \" فقال عند ذلك إبليس لا أفارق ابن آدم ما دام فيه الروح أعده وأمنيه وأخدعه فقال الله تعالى وعزتي وجلالي لا أحجب عنه التوبة ما لم يغرغر بالموت ولا يدعوني إلا أجبته ولا يسألني إلا أعطيته ولا يستغفرني إلا غفرت له رواه ابن أبى حاتم.وقوله تبارك وتعالى: \" وما كان له عليهم من سلطان \" قال ابن عباس رضي الله عنهما أي من حجة وقال الحسن البصري والله ما ضربهم بعصا ولا أكرههم على شيء وما كان إلا غرورا وأماني دعاهم إليها فأجابوه.وقوله عز وجل \" إلا لنعلم من يؤمن بالآخرة ممن هو منها في شك \" أي إنما سلطناه عليهم ليظهر أمر من هو مؤمن بالآخرة وقيامها والحساب فيها والجزاء فيحسن عبادة ربه عز وجل في الدنيا بمن هو منها في شك. وقوله تعالى \" وربك على كل شيء حفيظ \" أي ومع حفظه ضل من ضل من اتباع إبليس وبحفظه وكلاءته سلم من سلم من المؤمنين أتباع الرسل."
    },
    {
      "ayah": 22,
      "surah": 34,
      "text": "بين تبارك وتعالى أنه الإله الواحد الأحد الفرد الصمد الذي لا نظير له ولا شريك له بل هو المستقل بالأمر وحده من غير مشارك ولا منازع ولا معارض فقال \" قل ادعوا الذين زعمتم من دون الله \" أي من الآلهة التي عبدت من دونه \" لا يملكون مثقال ذرة في السموات ولا في الأرض \" كما قال تبارك وتعالى: \" والذين تدعون من دونه ما يملكون من قطمير\".وقوله تعالى \" وما لهم فيهما من شرك \" أي لا يملكون شيئا استقلالا ولا على سبيل الشركة \" وما له منهم من ظهير \" أي وليس لله من هذه الأنداد من ظهير يستظهر به في الأمور بل الخلق كلهم فقراء إليه عبيد لديه قال قتادة في قوله عز وجل \"وما له منهم من ظهير\" من عون يعينه بشيء."
    },
    {
      "ayah": 23,
      "surah": 34,
      "text": "قال تعالى \"ولا تنفع الشفاعة عنده إلا لمن أذن له \" أي لعظمته وجلاله وكبريائه لا يجترئ أحد أن يشفع عنده تعالى في شيء إلا بعد إذنه له في الشفاعة كما قال عز وجل \" من ذا الذي يشفع عنده إلا بإذنه \" وقال جل وعلا \" وكم من ملك فى السموات لا تغني شفاعتهم شيئا إلا من بعد أن يأذن الله لمن يشاء ويرضى \" وقال تعالى: \" ولا يشفعون إلا لمن ارتضى وهم من خشيته مشفقون \" ولهذا ثبت في الصحيحين من غير وجه عن رسول الله صلى الله عليه وسلم وهو سيد ولد آدم وأكبر شفيع عند الله تعالى أنه حين يقوم المقام المحمود ليشفع في الخلق كلهم أن يأتي ربهم لفصل القضاء قال \" فأسجد لله تعالى فيدعني ما شاء الله أن يدعني ويفتح علي بمحامد لا أحصيها الآن ثم يقال يا محمد ارفع رأسك وقل يسمع وسل تعطه واشفع تشفع \" الحديث بتمامه.وقوله تعالى \" حتى إذا فزع عن قلوبهم قالوا ماذا قال ربكم قالوا الحق \" وهذا أيضا مقام رفيع في العظمة وهو أنه تعالى إذا تكلم بالوحي فسمع أهل السموات كلامه أرعدوا من الهيبة حتى يلحقهم مثل الغشي.قاله ابن مسعود رضي الله عنه ومسروق وغيرهما \" حتى إذا فزع عن قلوبهم \" أي زال الفزع عنها قال ابن عباس وابن عمر \" رضي الله عنهم وأبو عبد الرحمن السلمي والشعبي وإبراهيم النخعي والضحاك والحسن وقتادة في قوله عز وجل \" حتى إذا فزع عن قلوبهم قالوا ماذا قال ربكم قالوا الحق \" يقول خلى عن قلوبهم وقرأ بعض السلف وجاء مرفوعا إذا فرغ بالغين المعجمة ويرجع إلى الأول فإذا كان كذلك سأل بعضهم بعضا ماذا قال ربكم ؟ فيخبر بذلك حملة العرش للذين يلونهم ثم الذين يلونهم لمن تحتهم حتى ينتهي الخبر إلى أهل السماء الدنيا ولهذا قال تعالى \" قالوا الحق \" أي أخبروا بما قال من غير زيادة ولا نقصان \" وهو العلي الكبير\".وقال آخرون بل معنى قوله تعالى \" حتى إذا فزع عن قلوبهم \" يعني المشركين عند الاحتضار ويوم القيامة إذا استيقظوا مما كانوا فيه من الغفلة في الدنيا ورجعت إليهم عقولهم يوم القيامة قالوا ماذا قال ربكم ؟ فقيل لهم الحق وأخبروا به مما كانوا عنه لاهين في الدنيا قال ابن أبي نجيح عن مجاهد \" حتى إذا فزع عن قلوبهم \" كشف عنها الغطاء يوم القيامة.وقال الحسن \" حتى إذا فزع عن قلوبهم \" يعني ما فيها من الشك والتكذيب وقال عبد الرحمن بن زيد بن أسلم \" حتى إذا فزع عن قلوبهم \" يعني ما فيها من الشك قال فزع الشيطان عن قلوبهم وفارقهم وأمانيهم وما كان يضلهم \" قالوا ماذا قال ربكم قالوا الحق وهو العلي الكبير \" قال وهذا في بني آدم هذا عند الموت أقروا حين لا ينفعهم الإقرار وقد اختار ابن جرير القول الأول أن الضمير عائد على الملائكة وهذا هو الحق الذي لا مرية فيه لصحة الأحاديث فيه والآثار ولنذكر منها طرفا يدل على غيره.قال البخاري عند تفسير هذه الآية الكريمة في صحيحه حدثنا الحميدي حدثنا سفيان حدثنا عمرو قال: سمعت عكرمة قال سمعت أبا هريرة رضي الله عنه يقول إن نبي الله صلى الله عليه وسلم قال \" إذا قضى الله تعالى الأمر في السماء ضربت الملائكة بأجنحتها خضعانا لقوله كأنه سلسلة على صفوان فإذا فزع عن قلوبهم قالوا ماذا قال ربكم ؟ قالوا للذي قال الحق وهو العلي الكبير فيسمعهـا مسترق السمع ومسترق السمع هكذا بعضه فوق بعض - ووصف سفيان بيده فحرفها ونشر بين أصابعه - فيسمع الكلمة فيلقيها إلى من تحته ثم يلقيها الآخر إلى من تحته حتى يلقيها على لسان الساحر أو الكاهن فربما أدركه الشهاب قبل أن يلقيها وربما ألقاها قبل أن يدركه فيكذب معها مائة كذبة فيقال أليس قد قال لنا يوم كذا وكذا كذا وكذا ؟ فيصدق بتلك الكلمة التي سمعت من السماء \" انفرد بإخراجه البخاري دون مسلم من هذا الوجه وقد رواه ابن داود والترمذي وابن ماجة من حديث سفيان بن عيينة به والله أعلم \" حديث آخر\" قال الإمام أحمد حدثنا محمد بن جعفر وعبد الرزاق قالا حدثنا معمر أخبرنا الزهري عن علي بن الحسين عن ابن عباس رضي الله عنه ما قال: كان رسول الله صلى الله عليه وسلم جالسا في نفر من أصحابه قال عبد الرزاق من الأنصار فرمي بنجم فاستنار فقال صلى الله عليه وسلم \" ما كنتم تقولون إذا كان مثل هذا فى الجاهلية ؟ \" قالوا كنا نقول يولد عظيم أو يموت عظيم.قلت للزهري أكان يرمى بها في الجاهلية ؟ قال نعم ولقد غلظت حين بعث النبي صلى الله عليه وسلم قال: فقال رسول الله صلى الله عليه وسلم \" فإنها لا يرمى بهـا لموت أحد ولا لحياته ولكن ربنا تبارك وتعالى إذا قضى أمرا سبح حملة العرش ثم سبح أهل السماء الذين يلونهم حتى يبلغ التسبيح السماء الدنيا ثم يستخبر أهل السماء الذين يلون حملة العرش فيقول الذين يلون حملة العرش لحملة العرش ماذا قال ربكم ؟ فيخبرونهم ويخبر أهل كل سماء سماء حتى ينتهي الخبر إلى هذه السماء وتخطف الجن السمع فيرمون فما جاءوا به على وجهه فهو حق ولكنهم يفرقون فيه ويزيدون \" هكذا رواه الإمام أحمد وقد أخرجه مسلم في صحيحه من حديث صالح بن كيسان والأوزاعي ويونس ومعقل بن عبيد الله أربعتهم عن الزهري عن علي بن الحسين عن ابن عباس رضي الله عنهما عن رجل من الأنصار به وقال يونس عن رجال من الأنصار \" رضي الله عنهم وكذا رواه النسائي في التفسير من حديث الزبيدي عن الزهري به ورواه الترمذي فيه عن الحسين بن حريث عن الوليد بن مسلم عن الأوزاعي عن الزهري عن عبيد الله بن عبد الله عن ابن عباس رضي الله عنهما عن رجل من الأنصار رضي الله عنه والله أعلم. \"حديث آخر\" قال ابن أبى حاتم حدثنا محمد بن عوف وأحمد بن منصور بن سيار الرمادي والسياق لمحمد بن عوف قالا حدثنا نعيم بن حماد حدثنا الوليد هو ابن مسلم عن عبد الرحمن بن يزيد بن جابر عن عبد الله بن أبي زكريا عن رجاء بن حيوة عن النواس بن سمعان رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم\" إذا أراد الله تبارك وتعالى أن يوحى بأمره تكلم بالوحي فإذا تكلم أخذت السموات منه رجفة - أو قال رعدة - شديدة من خوف الله تعالى فإذا سمع بذلك أهل السموات صعقوا وخروا لله سجدا فيكون أول من يرفع رأسه جبريل عليه الصلاة والسلام فيكلمه الله من وحيه بما أراد فيمضي به جبريل عليه الصلاة والسلام على الملائكة كلما مر بسـماء سماء يسأله ملائكتها ماذا قال ربنا يا جبريل ؟ فيقول عليه السلام قال الحق وهو العلي الكبير فيقولون كلهم مثل ما قال جبريل فينتهي جبريل بالوحي إلى حيث أمره الله تعالى من السماء والأرض \" وكذا رواه ابن جرير وابن خزيمة عن زكريا بن أبان المصري عن نعيم بن حماد به.وقال ابن أبي حاتم سمعت أبي يقول: ليس هذا الحديث بالتام عن الوليد بن مسلم رحمه الله وقد روى ابن أبي حاتم من حديث العوفي عن ابن عباس رضي الله عنهما وعن قتادة أنهما فسرا هذه الآية بابتداء إيحاء الله تعالى إلى محمد صلى الله عليه وسلم بعد الفترة التي كانت بينه وبين عيسى عليه الصلاة والسلام ولا شك أن هذا أولى ما دخل في هذه الآية."
    },
    {
      "ayah": 24,
      "surah": 34,
      "text": "يقول تعالى مقررا تفرده بالخلق والرزق وانفراده بالإلهية أيضا فكما كانوا يعترفون بأنهم لا يرزقهم من السماء والأرض أي بما ينزل من المطر وينبت من الزرع إلا الله فكذلك فليعلموا أنه لا إله غيره وقوله تعالى \" وإنا أو إياكم لعلى هدى أو فى ضلال مبين \" هذا من باب اللف والنشر أي واحد من الفريقين مبطل والآخر محق لا سبيل إلى أن تكونوا أنتم ونحن على الهدى أو على الضلال بل واحد منا مصيب ونحن قد أقمنا البرهان على التوحيد فدل على بطلان ما أنتم عليه من الشرك بالله تعالى ولهذا قال \" وإنا أو إياكم لعلى هدى أو في ضلال مبين \".قال قتادة قد قال ذلك أصحاب محمد صلى الله عليه وسلم للمشركين والله ما نحن وإياكم على أمر واحد إن أحد الفريقين لمهتد وقال عكرمة وزياد بن أبي مريم معناها إنا نحن لعلى هدى وإنكم لفي ضلال مبين."
    },
    {
      "ayah": 25,
      "surah": 34,
      "text": "وقوله تعالى \" قل لا تسئلون عما أجرمنا ولا نسئل عما تعملون \" معناه التبري منهم أي لستم منا ولا نحن منكم بل ندعوكم إلى الله تعالى وإلى توحيده وإفراد العبادة له فإن أجبتم فأنتم منا ونحن منكم وإن كذبتم فنحن برآء منكم وأنتم برآء منا كما قال تعالى \" فإن كذبوك فقل لي عملي ولكم عملكم أنتم بريئون مما أعمل وأنا بريء مما تعملون \". وقال عز وجل \" قل يا أيها الكافرون لا أعبد ما تعبدون ولا أنتم عابدون ما أعبد ولا أنا عابد ما عبدتم ولا أنتم عابدون ما أعبد لكم دينكـم ولي دين \"."
    },
    {
      "ayah": 26,
      "surah": 34,
      "text": "وقوله تعالى: \"قل يجمع بيننا ربنا\" أي يوم القيامة يجمع بين الخلائق في صعيد واحد ثم يفتح بيننا بالحق أي يحكم بيننا بالعدل فيجزي كل عامل بعمله إن خيرا فخير وإن شرا فشر وستعلمون يومئذ لمن العزة والنصرة والسعادة الأبدية كما قال تعالى \" ويوم تقوم الساعة يومئذ يتفرقون فأما الذين آمنوا وعملوا الصالحات فهم في روضة يحبرون وأما الذين كفروا وكذبوا بآياتنا ولقاء الآخرة فأولئك في العذاب محضرون \" ولهذا قال عز وجل \" وهو الفتاح العليم \" أي الحاكم العادل العالم بحقائق الأمور."
    },
    {
      "ayah": 27,
      "surah": 34,
      "text": "وقوله تبارك وتعالى: \" قل أروني الذين ألحقتم به شركاء \" أي أروني هذه الآلهـة التي جعلتموها لله أندادا وصيرتموها له عدلا \" كلا \" أي ليس له نظير ولا نديد ولا شريك ولا عديل ولهذا قال تعالى: \" بل هو الله \". أى الواحد الأحد الذي لا شريك له \" العزيز الحكيم \" أى ذو العزة الذي قد قهر بها كل شيء وغلبت كل شيء الحكيم في أفعاله وأقواله وشرعه وقدره تبارك وتعالى وتقدس عما يقولون علوا كبيرا والله أعلم."
    },
    {
      "ayah": 28,
      "surah": 34,
      "text": "يقول تعالى لعبده ورسوله محمد صلى الله عليه وسلم تسليما \" وما أرسلناك إلا كافة للناس بشيرا ونذيرا \" أي إلا إلى جميع الخلائق من المكلفين كقوله تبارك وتعالى: \" قل يا أيها الناس إنى رسول الله إليكم جميعا \" \" تبارك الذي نزل الفرقان على عبده ليكون للعالمين نذيرا \" \" بشيرا ونذيرا \" أي تبشر من أطاعك بالجنة وتنذر من عصاك بالنار \" ولكن أكثر الناس لا يعلمون \" كقوله عز وجل \" وما أكثر الناس ولو حرصت بمؤمنين \" \" وإن تطع أكثر من في الأرض يضلوك عن سبيل الله \" قال محمد بن كعب فى قوله تعالى \" وما أرسلناك إلا كافة للناس \" يعنى إلى الناس عامة وقال قتادة في هذه الآية أرسل الله تعالى محمدا صلى الله عليه وسلم إلى العرب والعجم فأكرمهم على الله تبارك وتعالى أطوعهم لله عز وجل.وقال ابن أبي حاتم حدثنا أبن عبد الله الظهراني حدثنا حفص بن عمر العدني حدثنا الحكم يعني ابن أبان عن عكرمة قال سمعت ابن عباس رضي الله عنهما يقول: إن الله تعالى فضل محمدا صلى الله عليه وسلم على أهل السماء وعلى الأنبياء.قالوا يا ابن عباس فبم فضله الله على الأنبياء ؟ قال رضي الله عنه إن الله تعالى قال \" وما أرسلنا من رسول إلا بلسان قومه ليبين لهم \" وقال النبي صلى الله عليه وسلم \" وما أرسلناك إلا كافة للناس \" فأرسله الله تعالى إلى الجن والإنس0. وهذا الذي قاله ابن عباس رضي الله عنهما قد ثبت في الصحيحين رفعه عن جابر رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم \" أعطيت خمسا لم يعطهن أحد من الأنبياء قبلي: نصرت بالرعب مسيرة شهر وجعلت لي الأرض مسجدا وطهورا فأيما رجل من أمتي أدركته الصلاة فليصل وأحلت لي الغنائم ولم تحل لأحد قبلي وأعطيت الشفاعة وكان النبي يبعث إلى قومه خاصة وبعثت إلى الناس عامة \" وفي الصحيح أيضا أن رسول الله صلى الله عليه وسلم قال \" بعثت إلى الأسود والأحمر \" قال مجاهد يعني الجن والإنس وقال غيره يعني العرب والعجم والكل صحيح.ثم قال عز وجل مخبرا عن الكفار في استبعادهم قيام الساعة."
    },
    {
      "ayah": 29,
      "surah": 34,
      "text": "\"ويقولون متى هذا الوعد إن كنتم صادقين \" وهذه الآية كقوله عز وجل \" يستعجل بها الذين لا يؤمنون بها والذين آمنوا مشفقون منها ويعلمون أنها الحق \" الآية ثم قال."
    },
    {
      "ayah": 3,
      "surah": 34,
      "text": "هذه إحدى الآيات الثلاث التي لا رابع لهن مما أمر الله تعالى رسوله صلى الله عليه وسلم أن يقسم بربه العظيم على وقوع المعاد لما أنكره من أنكره من أهل الكفر والعناد فإحداهن في سورة يونس عليه السلام وهي قوله تعالى: \" ويستنبئونك أحق هو قل إي وربي إنه لحق وما أنتم بمعجزين \" والثانية هذه \" وقال الذين كفروا لا تأتينا الساعة قل بلى وربي لتأتينكم \" والثالثة في سورة التغابن وهي قوله تعالى: \" زعم الذين كفروا أن لن يبعثوا قل بلى وربي لتبعثن ثم لتنبؤن بما عملتم وذلك على الله يسير \" فقال تعالى: \" قل بلى وربي لتأتينكم \" ثم وصفه بما يؤكد ذلك ويقرره فقال: \" عالم الغيب لا يعزب عنه مثقال ذرة في السموات ولا في الأرض ولا أصغر من ذلك ولا أكبر إلا في كتاب مبين \" قال مجاهد وقتادة لا يعزب عنه لا يغيب عنه أي الجميع مندرج تحت علمه فلا يخفى عليه شيء فالعظام وإن تلاشت وتفرقت وتمزقت فهو عالم أين ذهبت وأين تفرقت ثم يعيدها كما بدأها أول مرة فإنه بكل شيء عليم ثم بين حكمته في إعادة الأبدان وقيام الساعة."
    },
    {
      "ayah": 30,
      "surah": 34,
      "text": "قال تعالى: \" قل لكم ميعاد يوم لا تستأخرون عنه ساعة ولا تستقدمون\" أي لكم ميعاد مؤجل ممدود لا يزاد ولا ينقص فإذا جاء فلا يؤخر ساعة ولا يقدم كما قال تعالى: \" إن أجل الله إذا جاء لا يؤخر\" وقال عز وجل: \"وما نؤخره إلا لأجل معدود يوم يأت لا تكلم نفس إلا بإذنه فمنهم شقي وسعيد \"."
    },
    {
      "ayah": 31,
      "surah": 34,
      "text": "يخبر تعالى عن تمادي الكفار في طغيانهم وعنادهم وإصرارهم على عدم الإيمان بالقرآن وبما أخبر به من أمر المعاد ولهذا قال تعالى \" وقال الذين كفروا لن نؤمن بهذا القرآن ولا بالذي بين يديه \" قال الله عز وجل متهددا لهم ومتوعدا ومخبرا عن مواقفهم الذليلة بين يديه في حال تخاصمهم وتحاجهم \" يرجع بعضهم إلى بعض القول يقول الذين استضعفوا \" وهم الأتباع \" للذين استكبروا \" منهم وهم قادتهم وسادتهم \" لولا أنتم لكنا مؤمنين \" أي لولا أنتم تصدونا لكنا اتبعنا الرسل وآمنا بما جاءونا به فقال لهم القادة والسادة وهم الذين استكبروا \" أنحن صددناكم عن الهدى بعد إذ جاءكم \" ؟ أي نحن ما فعلنا بكم أكثر من أنا دعوناكم فاتبعتمونا من غير دليل ولا برهان وخالفتم الأدلة والبراهين والحجج التي جاءت بهم الرسل لشهوتكم واختياركم لذلك ولهذا قالوا."
    },
    {
      "ayah": 32,
      "surah": 34,
      "text": "يخبر تعالى عن تمادي الكفار في طغيانهم وعنادهم وإصرارهم على عدم الإيمان بالقرآن وبما أخبر به من أمر المعاد ولهذا قال تعالى \" وقال الذين كفروا لن نؤمن بهذا القرآن ولا بالذي بين يديه \" قال الله عز وجل متهددا لهم ومتوعدا ومخبرا عن مواقفهم الذليلة بين يديه في حال تخاصمهم وتحاجهم \" يرجع بعضهم إلى بعض القول يقول الذين استضعفوا \" وهم الأتباع \" للذين استكبروا \" منهم وهم قادتهم وسادتهم \" لولا أنتم لكنا مؤمنين \" أي لولا أنتم تصدونا لكنا اتبعنا الرسل وآمنا بما جاءونا به فقال لهم القادة والسادة وهم الذين استكبروا \" أنحن صددناكم عن الهدى بعد إذ جاءكم \" ؟ أي نحن ما فعلنا بكم أكثر من أنا دعوناكم فاتبعتمونا من غير دليل ولا برهان وخالفتم الأدلة والبراهين والحجج التي جاءت بهم الرسل لشهوتكم واختياركم لذلك ولهذا قالوا."
    },
    {
      "ayah": 33,
      "surah": 34,
      "text": "\"بل كنتم مجرمين وقال الذين استضعفوا للذين استكبروا بل مكر الليل والنهـار \" أى بل كنتم تمكرون بنا ليلا ونهارا وتغرونا وتمنونا وتخبرونا أنا على هدى وأنا على شيء فإذا جميع ذلك باطل وكذب ومين قال قتادة وابن زيد \" بل مكر الليل والنهار \"يقول بل مكركم بالليل والنهـار وكذا قال مالك عن زيد بن أسلم مكركم بالليل والنهار \" إذ تأمروننا أن نكفر بالله ونجعل له أندادا \" أي نظراء وآلهة معه وتقيموا لنا شبها وأشياء من المحال تضلونا بها \"وأسروا الندامة لما رأوا العذاب \" أي الجميع من السادة والأتباع كل ندم على ما سلف منه \" وجعلنا الأغلال في أعناق الذين كفروا \" وهي السلاسل التي تجمع أيديهم مع أعناقهم \" هل يجزون إلا ما كانوا يعملون \" أي إنما نجازيكم بأعمالكم كل بحسبه للقادة عذاب بحسبهم وللأتباع بحسبهم \" قال لكل ضعف ولكن لا تعلمون \".قال ابن أبي حاتم حدثنا أبي حدثنا فروة بن أبي المغراء حدثنا محمد بن سليمان بن الأصبهاني عن أبي سنان ضرار بن صرد عن عبد الله بن أبي الهذيل عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم \" إن جهنم لما سيق إليها أهلها تلقاهم لهبها ثم لفحتهم لفحة فلم يبق لحم إلا سقط على العرقوب \" وحدثنا أبي حدثنا أحمد بن أبي الحواري حدثنا الطيب أو الحسن عن الحسن بن يحيى الخشني قال ما في جهنم دار ولا مغار ولا غل ولا قيد ولا سلسلة إلا اسم صاحبها عليها مكتوب قال فحدثته أبا سليمان يعني الداراني رحمة الله عليه فبكى ثم قال ويحك فكيف به لو جمع هذا كله عليه فجعل القيد في رجليه والغل في يديه والسلسلة فى عنقه ثم أدخل النار وأدخل المغار ؟ اللهم سلم."
    },
    {
      "ayah": 34,
      "surah": 34,
      "text": "يقول تعالى مسليا لنبيه صلى الله عليه وسلم وآمرا له بالتأسي بمن قبله من الرسل ومخبره بأنه ما بعث نبيا فى قرية إلا كذبه مترفوها واتبعه ضعفاؤهم كما قال قوم نوح عليه الصلاة والسلام \" أنؤمن لك واتبعك الأرذلون \" \" وما نراك اتبعك إلا الذين هم أراذلنا بادي الرأي \" وقال الكبراء من قوم صالح \" للذين استضعفوا لمن آمن منهم أتعلمون أن صالحا مرسل من ربه قالوا إنا بما أرسل به مؤمنون قال الذين استكبروا إنا بالذي آمنتم به كافرون \" وقال عز وجل \" وكذلك فتنا بعضهم ببعض ليقولوا أهؤلاء من الله عليهم من بيننا أليس الله بأعلم بالشاكرين \" وقال تعالى: \" وكذلك جعلنا في كل قرية أكابر مجرميها ليمكروا فيها \" وقال جل وعلا \" وإذا أردنا أن نهلك قرية أمرنا مترفيها ففسقوا فيها فحق عليها القول فدمرناها تدميرا \" وقال جل وعلا ههنا \" وما أرسلنا في قرية من نذير \" أي نبي أو رسول \" إلا قال مترفوها \" وهم أولوا النعمة والحشمة والثروة والرياسة قال قتادة هم جبابرتهم وقادتهم ورؤوسهم في الشر \" إنا بما أرسلتم به كافرون \" أي لا نؤمن به ولا نتبعه.قال ابن أبي حاتم حدثنا علي بن الحسين حدثنا هارون بن إسحاق حدثنا محمد بن عبد الوهاب عن سفيان عن عاصم عن أبي رزين قال كان رجلان شريكان خرج أحدهما إلى الساحل وبقي الآخر فلما بعث النبي صلى الله عليه وسلم كتب إلى صاحبه يسأله ما فعل.فكتب إليه أنه لم يتبعه أحد من قريش إنما اتبعه أراذل الناس ومساكينهم قال فترك تجارته ثم أتى صاحبه فقال دلني عليه قال وكان يقرأ الكتب أو بعض الكتب قال فأتى النبي صلى الله عليه وسلم فقال إلام تدعو؟ قال: \" أدعو إلى كذا وكذا \" قال أشهد أنك رسول الله قال صلى الله عليه وسلم \" وما علمك بذلك ؟ \" قال إنه لم يبعث نبي إلا اتبعه أراذل الناس ومساكينهم قال فنزلت هذه الآية \" وما أرسلنا في قرية من نذير إلا قال مترفوها إنا بما أرسلتم به كافرون \" الآية قال فأرسل إليه النبي صلى الله عليه وسلم إن الله عز وجل قد أنزل تصديق ما قلت وهكذا قال هرقل لأبي سفيان حين سأله عن تلك المسائل قال فيها وسألتك أضعفاء الناس اتبعه أم أشرافهم فزعمت بل ضعفاؤهم وهم أتباع الرسل.وقوله تبارك وتعالى إخبارا عن المترفين المكذبين."
    },
    {
      "ayah": 35,
      "surah": 34,
      "text": "\"وقالوا نحن أكثر أموالا وأولادا وما نحن بمعذبين \" أي افتخروا بكثرة الأموال والأولاد واعتقدوا أن ذلك دليل على محبة الله تعالى لهم واعتنائه بهم وأنه ما كان ليعطيهم هذا في الدنيا ثم يعذبهم في الآخرة وهيهات لهم ذلك قال الله تعالى \" أيحسبون أنما نمدهم به من مال وبنين نسارع لهم في الخيرات بل لا يشعرون \" وقال تبارك وتعالى: \" فلا تعجبك أموالهم ولا أولادهم إنما يريد الله ليعذبهم بها في الحياة الدنيا وتزهق أنفسهم وهم كافرون \" وقال عز وجل \" ذرني ومن خلقت وحيدا وجعلت له مالا ممدودا وبنين شهودا ومهدت له تمهيدا ثم يطمع أن أزيد كلا إنه كان لآياتنا عنيدا سأرهقه صعودا \" وقد أخر الله عز وجل عن صاحب تينك الجنتين أنه كان ذا مال وثمر وولد ثم لم يغن عنه شيئا بل سلب ذلك كله في الدنيا قبل الآخرة ولهذا قال عز وجل ها هنا."
    },
    {
      "ayah": 36,
      "surah": 34,
      "text": "\"قل إن ربي يبسط الرزق لمن يشاء ويقدر\" أي يعطي المال لمن يحب ومن لا يحب فيفقر من يشاء ويغني من يشاء وله الحكمة التامة البالغة والحجة القاطعة الدامغة \"ولكن أكثر الناس لا يعلمون \" ثم."
    },
    {
      "ayah": 37,
      "surah": 34,
      "text": "قال تعالى: \" وما أموالكم ولا أولادكم بالتي تقربكم عندنا زلفى \" أي ليست هذه دليلا على محبتنا لكم ولا اعتنائنا بكم.قال الإمام أحمد رحمه الله حدثنا كثير حدثنا جعفر حدثنا يزيد بن الأصم عن أبي هريرة رضي الله عنه أن رسول الله صلى الله عليه وسلم قال: \" إن الله تعالى لا ينظر إلى صوركم وأموالكم ولكن إنما ينظر إلى قلوبكم وأعمالكم \" ورواه مسلم وابن ماجة من حديث كثير بن هشام عن جعفر بن برقان به. ولهذا قال الله تعالى: \" إلا من آمن وعمل صالحا \" أي إنما يقربكم عندنا زلفى الإيمان والعمل الصالح \" فأولئك لهم جزاء الضعف بما عملوا \" أي تضاعف لهم الحسنة بعشرة أمثالها إلى سبعمائة ضعف \" وهم في الغرفات آمنون \" أي في منازل الجنة العالية آمنون من كل بأس وخوف وأذى ومن كل شر يحذر منه.قال ابن أبي حاتم حدثنا أبي حدثنا فروة بن أبي المغراء الكندي حدثنا القاسم وعلي بن مسهر عن عبد الرحمن بن إسحاق عن النعمان بن سعد عن علي رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم \" إن في الجنة لغرفا ترى ظهورها من بطونها وبطونها من ظهورها \" فقال أعرابي لمن هي ؟ قال صلى الله عليه وسلم \" لمن طيب الكلام وأطعم الطعام وأدام الصيام وصلى بالليل والناس نيام\"."
    },
    {
      "ayah": 38,
      "surah": 34,
      "text": "\"والذين يسعون في آياتنا معاجزين \" أي يسعون في الصد عن سبيل الله واتباع رسله والتصديق بآياته \" فأولئك في العذاب محضرون \" أي جميعهم مجزيون بأعمالهم فيها بحسبهم."
    },
    {
      "ayah": 39,
      "surah": 34,
      "text": "وقوله تعالى: \" قل إن ربي يبسط الرزق لمن يشاء من عباده ويقدر له \" أي بحسب ماله في ذلك من الحكمة يبسط على هذا من المال كثيرا ويضيق على هذا ويقتر على هذا رزقه جدا وله في ذلك من الحكمة ما لا يدركها غيره كما قال تعالى: \" انظر كيف فضلنا بعضهم على بعض وللآخرة أكبر درجات وأكبر تفضيلا \" أي كما هم متفاوتون في الدنيا هذا فقير مدقع وهذا غنى موسع عليه فكذلك هم في الآخرة هذا في الغرفات في أعلى الدرجات وهذا في الغمرات في أسفل الدرجات وأطيب الناس في الدنيا كما قال صلى الله عليه وسلم \" قد أفلح من أسلم ورزق كفافا وقنعه الله بما آتاه \" رواه مسلم من حديث ابن عمر رضي الله عنهما.وقوله تعالى: \" وما أنفقتم من شيء فهو يخلفه \" أي مهما أنفقتم من شيء فيما أمركم به وأباحه لكم فهو يخلفه عليكم في الدنيا بالبدل وفي الآخرة بالجزاء والثواب كما ثبت في الحديث \" يقول الله تعالى أنفق أنفق عليك \" وفي الحديث أن ملكين يصبحان كل يوم يقول أحدهما اللهم أعط ممسكا تلفا ويقول الآخر: اللهم أعط منفقا خلفا وقال رسول الله صلى الله عليه وسلم \" أنفق بلالا ولا تخش من ذي العرش إقلالا \" وقال ابن أبي حاتم حدثنا أبي عن يزيد بن عبد العزيز الفلاس حدثنا هشيم عن الكوثر بن حكيم عن مكحول قال بلغني عن حذيفة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم \" ألا إن بعد زمانكم هذا زمان عضوض يعض الموسر على ما فى يده حذار الإنفاق \" ثم تلا هذه الآية \" وما أنفقتم من شيء فهو يخلفه وهو خير الرازقين \" وقال الحافظ أبو يعلى الموصلي حدثنا روح بن حاتم حدثنا هشيم عن الكوثر بن حكيم عن مكحول قال بلغني عن حذيفة رضي الله عنه أنه قال: قال رسول الله صلى الله عليه وسلم \" ألا إن بعد زمانكم هذا زمان عضوض يعض الموسر على ما في يده حذار الإنفاق \" قال الله تعالى: \" وما أنفقتم من شيء فهو يخلفه وهو خير الرازقين \" وفى الحديث \" شرار الناس يبايعون كل مضطر ألا إن بيع المضطرين حرام ألا إن بيع المضطرين حرام المسلم أخو المسلم لا يظلمه ولا يخذله إن كان عندك معروف فعد به على أخيك وإلا فلا تزده هلاكا إلى هلاكه \" هذا حديث غريب من هذا الوجه وفى إسناده ضعف وقال سفيان الثوري عن أبي يونس الحسن بن يزيد قال: قال مجاهد لا يتأولن أحدكم هذه الآية \" وما أنفقتم من شيء فهو يخلفه \" إذا كان عند أحدكم ما يقيمه فليقصد فيه فإن الرزق مقسوم."
    },
    {
      "ayah": 4,
      "surah": 34,
      "text": "بقوله تعالى: \"ليجزي الذين آمنوا وعملوا الصالحات أولئك لهم مغفرة ورزق كريم والذين سعوا في آياتنا معاجزين \" أي سعوا فى الصد عن سبيل الله تعالى وتكذيب رسله \" أولئك لهم عذاب من رجز أليم \" أي لينعم السعداء من المؤمنين ويعذب الأشقياء من الكافرين كما قال عز وجل: \" لا يستوي أصحاب النار وأصحاب الجنة أصحاب الجنة هم الفائزون \" وقال تعالى: \" أم نجعل الذين آمنوا وعملوا الصالحات كالمفسدين في الأرض أم نجعل المتقين كالفجار \"."
    },
    {
      "ayah": 40,
      "surah": 34,
      "text": "يخبر تعالى أنه يقرع المشركين يوم القيامة على رؤوس الخلائق فيسأل الملائكة الذين كان المشركون يزعمون أنهم يعبدون الأنداد التي هي على صورهم ليقربوهم إلى الله زلفى فيقول للملائكة \" أهؤلاء إياكم كانوا يعبدون \" أي أنتم أمرتم هؤلاء بعبادتكم كما قال تعالى في سورة الفرقان \" أأنتم أضللتم عبادي هؤلاء أم هم ضلوا السبيل \" وكما يقول لعيسى عليه الصلاة والسلام \" أأنت قلت للناس اتخذوني وأمي إلهين من دون الله قال سبحانك ما يكون لي أن أقول ما ليس لي بحق \" وهكذا تقول الملائكة."
    },
    {
      "ayah": 41,
      "surah": 34,
      "text": "\"سبحانك \" أي تعاليت وتقدست عن أن يكون معك إله \" أنت ولينا من دونهم \" أي نحن عبيدك ونبرأ إليك من هؤلاء \" بل كانوا يعبدون الجن \" يعنون الشياطين لأنهم هم الذين زينوا لهم عبادة الأوثان وأضلوهم \" أكثرهم بهم مؤمنون \" كما قال تبارك وتعالى \" إن يدعون من دونه إلا إناثا وإن يدعون إلا شيطانا مريدا لعنه الله \" قال الله عز وجل."
    },
    {
      "ayah": 42,
      "surah": 34,
      "text": "\"فاليوم لا يملك بعضكم لبعض نفعا ولا ضرا \" أي لا يقع لكم نفع ممن كنتم ترجون نفعه اليوم من الأنداد والأوثان التي ادخرتم عبادتها لشدائدكم وكربكم اليوم لا يملكون لكم نفعا ولا ضرا \" ونقول للذين ظلموا \" وهم المشركون \" ذوقوا عذاب النار التي كنتم بها تكذبون \" أي يقال لهم ذلك تقريعا وتوبيخا."
    },
    {
      "ayah": 43,
      "surah": 34,
      "text": "يخبر تعالى عن الكفار أنهم يستحقون منه العقوبة والأليم من العذاب لأنهم كانوا إذا تتلى عليهم آياته بينات يسمعونها غضة طرية من لسان رسوله صلى الله عليه وسلم \" قالوا ما هذا إلا رجل يريد أن يصدكم عما كان يعبد آباؤكم \" يعنون أن دين آبائهم هو الحق وأن ما جاءهم به الرسول عندهم باطل عليهم وعلى آبائهم لعائن الله تعالى \" وقالوا ما هذا إلا إفك مفترى \" يعنون القرآن \" وقال الذين كفروا للحق لما جاءهم إن هذا إلا سحر مبين\"."
    },
    {
      "ayah": 44,
      "surah": 34,
      "text": "قال الله تعالى \"وما آتيناهم من كتب يدرسونها وما أرسلنا إليهم قبلك من نذير \" أي ما أنزل الله على العرب من كتاب قبل القرآن وما أرسل إليهم نبيا قبل محمد صلى الله عليه وسلم وقد كانوا يودون ذلك ويقولون لو جاءنا نذير أو أنزل علينا كتاب لكنا أهدى من غيرنا فلما من الله عليهم بذلك كذبوه وجحدوه وعاندوه ثم."
    },
    {
      "ayah": 45,
      "surah": 34,
      "text": "قال تعالى \" وكذب الذين من قبلهم \" أي من الأمم \" وما بلغوا معشار ما آتيناهم \" قال ابن عباس رضي الله عنهما أي من القوة في الدنيا وكذا قال قتادة والسدي وابن زيد كما قال تعالى \" ولقد مكناهم فيما إن مكناكم فيه وجعلنا لهم سمعا وأبصارا وأفئدة فما أغنى عنهم سمعهم ولا أبصارهم ولا أفئدتهم من شيء إذ كانوا يجحدون بآيات الله وحاق بهم ما كانوا به يستهزئون أفلم يسيروا فى الأرض فينظروا كيف كان عاقبة الذين من قبلهم كانوا أكثر منهم وأشد قوة \" أي وما دفع ذلك عنهم عذاب الله ولا رده بل دمر الله عليهم لما كذبوا رسله ولهذا قال \"فكذبوا رسلي فكيف كان نكير\" أي فكيف كان عقابي ونكالي وانتصاري لرسلي."
    },
    {
      "ayah": 46,
      "surah": 34,
      "text": "يقول تبارك وتعالى قل يا محمد لهؤلاء الكافرين الزاعمين أنك مجنون \" إنما أعظكم بواحدة \" أي إنما آمركم بواحدة وهي \" أن تقوموا لله مثنى وفرادى ثم تتفكروا ما بصاحبكم من جنة \" أي تقوموا قياما خالصا لله عز وجل من غير هوى ولا عصبية فيسأل بعضكم بعضا هل بمحمد من جنون فينصح بعضـكم بعضا \" ثم تتفكروا \" أي ينظر الرجل لنفسه في أمر محمد صلى الله عليه وسلم ويسأل غيره من الناس عن شأنه إنه أشكل عليه ويتفكر فى ذلك ولهذا قال تعالى: \" أن تقوموا لله مثنى وفرادى ثم تتفكروا ما بصاحبكم من جنة \" هذا معنى ما ذكره مجاهد ومحمد بن كعب والسدي وقتادة وغيرهم وهذا هو المراد من الآية فأما الحديث الذي رواه ابن أبي حاتم حدثنا أبي هشام بن عمار حدثنا صدقة بن خالد حدثنا عثمان بن أبي العاتكة عن علي بن يزيد عن القاسم غن أبي أمامة رضي الله عنه قال: إن رسول الله صلى الله عليه وسلم كان يقول \" أعطيت ثلاثا لم يعطهن أحد قبلي ولا فخر: أحلت لي الغنائم ولم تحل لمن قبلي كانوا قبلي يجمعون غنائمهم فيحرقونها وبعثت إلى كل أحمر وأسود وكان كل نبي يبعث إلى قومه خاصة وجعلت لي الأرض مسجدا وطهورا أتيمم بالصعيد وأصلي فيها حيث أدركتني الصلاة قال الله تعالى: \" أن تقوموا لله مثنى وفرادى \" وأعنت بالرعب مسيرة شهر بين يدي \" فهو حديث ضعيف الإسناد وتفسير الآية بالقيام في الصلاة في جماعة وفرادى بعيد ولعله مقحم في الحديث من بعض الرواة فإن أصله ثابت في الصحاح وغيرها والله أعلم. وقوله تعالى: \" إن هو إلا نذير لكم بين يدي عذاب شديد \" قال البخاري عندها حدثنا علي بن عبد الله حدثنا محمد ابن حازم حدثنا الأعمش عن عمرو بن مرة عن سعيد بن جبير عن ابن عباس رضي الله عنهما أنه قال: صعد النبي صلى الله عليه وسلم الصفا ذات يوم فقال \" يا صباحاه \" فاجتمعت إليه قريش فقالوا مالك ؟ فقال \" أرأيتم لو أخرتكم أن العدو يصبحكم أو يمسيكـم أما كنتم تصدقوني \" قالوا بلى ! قال صلى الله عليه وسلم \" فإنى نذير لكم بين يدي عذاب شديد \" فقال أبو لهب تبا لك ألهذا جمعتنا \" فأنزل الله عز وجل \" تبت يدا أبي لهب وتب \" وقد تقدم عند قوله تعالى \" وأنذر عشيرتك الأقربين \".وقال الإمام أحمد حدثني أبو نعيم حدثنا بشير بن المفاجر حدثني عبد الله بن بريدة عن أبيه رضي الله عنه قال: خرج إلينا رسول الله صلى الله عليه وسلم يوما فنادى ثلاث مرات فقال: \" أيها الناس أتدرون ما مثلي ومثلكـم ؟ \" قالوا الله ورسوله أعلم قال صلى الله عليه وسلم \" إنما مثلي ومثلكم مثل قوم خافوا عدوا يأتيهم فبعثوا رجلا يتراءى لهم فبينما هو كذلك أبصر العدو فأقبل لينذرهم وخشي أن يدركه العدو قبل أن ينذر قومه فأهوى بثوبه أيها الناس أوتيتم أيها الناس أوتيتم \" ثلاث مرات وبهذا الإسناد قال: قال رسول الله صلى الله عليه وسلم \" بعثت أنا والساعة جميعا إن كادت لتسبقني \" تفرد به الإمام أحمد في مسنده."
    },
    {
      "ayah": 47,
      "surah": 34,
      "text": "يقول تعالى آمرا رسوله صلى الله عليه وسلم أن يقول للمشركين \" ما سألتكم من أجر فهو لكـم \" أي لا أريد منكم جعلا ولا عطاء على أداء رسالة الله عز وجل إليكم ونصحي إياكم وأمركم بعبادة الله \" إن أجري إلا على الله \" أي إنما أطلب ثواب ذلك من عند الله \" وهو على كل شيء شهيد\" أي عالم بجميع الأمور بما أنا عليه من إخباري عنه بإرساله إياي إليكم وما أنتم عليه.وقوله عز وجل:"
    },
    {
      "ayah": 48,
      "surah": 34,
      "text": "\" قل إن ربي يقذف بالحق علام الغيوب \" كقوله تعالى: \" يلقي الروح من أمره على من يشاء من عباده\" أو يرسل الملك إلى من يشاء من عباده من أهل الأرض وهو علام الغيوب فلا تخفى عليه خافية في السموات ولافي الأرض."
    },
    {
      "ayah": 49,
      "surah": 34,
      "text": "وقوله تبارك وتعالى \"قل جاء الحق وما يبدئ الباطل وما يعيد \" أي جاء الحق من الله والشرع العظيم وذهب الباطل زهق واضمحل كقوله تعالى: \" بل نقذف بالحق على الباطل فيدمغه فإذا هو زاهق \" ولهذا لما دخل رسول الله صلى الله عليه وسلم المسجد الحرام يوم الفتح ووجد تلك الأصنام منصوبة حول الكعبة جعل يطعن الصنم منها بسية قوسه ويقرأ \" وقل جاء الحق وزهق الباطل إن الباطل كان زهوقا\" \" قل جاء الحق وما يبدئ الباطل وما يعيد\" رواه البخاري ومسلم والترمذي والنسائي وحده عند هذه الآية كلهم من حديث الثوري عن ابن أبي نجيح عن مجاهد عن أبي معمر عبد الله بن سخبرة عن ابن مسعود رضي الله عنه به أي لم يبق للباطل مقالة ولا رياسة ولا كلمة وزعم قتادة والسدي أن المراد بالباطل ها هنا إبليس أنه لا يخلق أحدا ولا يعيده ولا يقدر على ذلك وهذا وإن كان حقا ولكن ليس هو المراد ههنا والله أعلم."
    },
    {
      "ayah": 5,
      "surah": 34,
      "text": "بقوله تعالى: \"ليجزي الذين آمنوا وعملوا الصالحات أولئك لهم مغفرة ورزق كريم والذين سعوا في آياتنا معاجزين \" أي سعوا فى الصد عن سبيل الله تعالى وتكذيب رسله \" أولئك لهم عذاب من رجز أليم \" أي لينعم السعداء من المؤمنين ويعذب الأشقياء من الكافرين كما قال عز وجل: \" لا يستوي أصحاب النار وأصحاب الجنة أصحاب الجنة هم الفائزون \" وقال تعالى: \" أم نجعل الذين آمنوا وعملوا الصالحات كالمفسدين في الأرض أم نجعل المتقين كالفجار \"."
    },
    {
      "ayah": 50,
      "surah": 34,
      "text": "وقوله تبارك وتعالى \" قل إن ضللت فإنما أضل على نفسي وإن اهتديت فبما يوحي إلي ربي \" أي الخير كله من عند الله وفيما أنزله الله عز وجل من الوحي والحق المبين فيه الهدى والبيان والرشاد ومن ضل فإنما يضل من تلقاء نفسه كما قال عبد الله بن مسعود رضي الله عنه لما سئل عن تلك المسئلة في المفوضة أقول فيها برأيي فإن يكن صوابا فمن الله وإن يكن خطأ فمني ومن الشيطان والله ورسوله بريئان منه.وقوله تعالى: \" إنه سميع قريب \" أي سميع لأقوال عباده قريب مجيب دعوة الداعي إذا دعاه وقد روى النسائي ههنا حديث أبي موسى الذي في الصحيحين \" إنكم لا تدعون أصم ولا غائبا إنما تدعون سميعا قريبا مجيبا \"."
    },
    {
      "ayah": 51,
      "surah": 34,
      "text": "يقول تبارك وتعالى \" ولو ترى \" يا محمد إذ فزع هؤلاء المكذبون يوم القيامة \" فلا فوت \" أي فلا مفر لهم ولا وزر لهم ولا ملجأ \" وأخذوا من مكان قريب \" أى لم يمكنوا أن يمعنوا في الهرب بل أخذوا من أول وهلة.قال الحسن البصري حين خرجوا من قبورهم وقال مجاهد وعطية العوفي وقتادة من تحت أقدامهم وعن ابن عباس رضي الله عنهما والضحاك يعني عذابهم فى الدنيا وقال عبد الرحمن بن زيد يعني قتلهم يوم بدر والصحيح أن المراد بذلك يوم القيامة وهو الطامة العظمى وإن كان ما ذكر متصلا بذلك وحكى ابن جرير عن بعضهم قال إن المراد بذلك جيش يخسف بهم بين مكة والمدينة في أيام بني العباس \" رضي الله عنهم.ثم أورد في ذلك حديثا موضوعا بالكلية ثم لم ينبه على ذلك وهذا أمر عجيب غريب منه."
    },
    {
      "ayah": 52,
      "surah": 34,
      "text": "\"وقالوا آمنا به \" أي يوم القيامة يقولون آمنا بالله وملائكته وكتبه ورسله كما قال تعالى: \" ولو ترى إذ المجرمون ناكسو رؤوسهم عند ربهم ربنا أبصرنا وسمعنا فارجعنا نعمل صالحا إنا موقنون \" ولهذا قال تعالى \" وأنى لهم التناوش من مكان بعيد \" أى كيف لهم تعاطي الإيمان وقد بعدوا عن محل قبوله منهم وصاروا إلى الدار الآخرة وهي دار الجزاء لا دار الابتلاء فلو كانوا آمنوا في الدنيا لكان ذلك نافعهم ولكن بعد مصيرهم إلى الدار الآخرة لا سبيل لهم إلى قبول الإيمان كما لا سبيل إلى حصول الشيء لمن يتناوله من بعيد.قال مجاهد \" وأنى لهم التناوش \" قال التناول لذلك وقال الزهري التناوش تناولهم الإيمان وهم في الآخرة وقد انقطعت عنهم الدنيا وقال الحسن البصري أما إنهم طلبوا الأمر من حيث لا ينال تعاطوا الإيمان من مكان بعيد وقال ابن عباس رضي الله عنهما طلبوا الرجعة إلى الدنيا والتوبة مما هم فيه وليس بحين رجعة ولا توبة.وكذا قال محمد بن كعب القرظي رحمه الله."
    },
    {
      "ayah": 53,
      "surah": 34,
      "text": "وقوله تعالى: \"وقد كفروا به من قبل \" أي كيف يحصل لهم الإيمان في الآخرة وقد كفروا بالحق في الدنيا وكذبوا الرسل \" ويقذفون بالغيب من مكان بعيد \" قال مالك عن زيد بن أسلم \" ويقذفون بالغيب \" قال بالظن قلت كما قال تعالى: \" رجما بالغيب \" فتارة يقولون شاعر وتارة يقولون كاهن وتارة يقولون ساحر وتارة يقولون مجنون إلى غير ذلك من الأقوال الباطلة ويكذبون بالبعث والنشور والمعاد \" ويقولون إن نظن إلا ظنا وما نحن بمستيقنين \" قال قتادة ومجاهد يرجمون بالظن لا بعث ولا جنة ولا نار."
    },
    {
      "ayah": 54,
      "surah": 34,
      "text": "وقوله تعالى: \"وحيل بينهم وبين ما يشتهون \" قال الحسن البصري والضحاك وغيرهما يعني الإيمان وقال السدي \" وحيل بينهم وبين ما يشتهون \" وهي التوبة وهذا اختيار ابن جرير رحمه الله.وقال مجاهد \" وحيل بينهم وبين ما يشتهون \" من هذه الدنيا من مال وزهرة وأهل وروي نحوه عن ابن عمر وابن عباس والربيع بن أنس \" رضي الله عنهم وهو قول البخاري وجماعة والصحيح أنه لا منافاة بين القولين فإنه قد حيل بينهم وبين شهواتهم فى الدنيا وبين ما طلبوه في الآخرة فمنعوا منه.وقد ذكر ابن أبي حاتم ههنا أثرا غريبا عجيبا جدا فلنذكره بطوله فإنه قال: حدثنا محمد بن يحيى حدثنا بشر بن حجر الشامي حدثتا على بن منصور الأنباري عن الرقي بن قطامي عن سعيد بن طريف عن عكرمة عن ابن عباس رضي الله عنهما فى قول الله عز وجل \" وحيل بينهم وبين ما يشتهون \" إلى آخر الآية قال كان رجل من بني إسرائيل فاتحا إن يتح الله تعالى له مالا فمات فورثه ابن له تافه أي فاسد فكان يعمل في مال الله تعالى بمعاصي الله تعالى عز وجل فلما رأى ذلك أخوات أبيه أتوا الفتى فعذلوه ولاموه فضجر الفتى فباع عقاره بصامت ثم رحل فأتى عينا بحاجة فسرح فيها ماله وابتنى قصرا فبينما هو ذات يوم جالس إذ شملت عليه ريح بامرأة من أحسن الناس وجها وأطيبهم أرجا أي ريحا فقالت من أنت يا عبد الله ؟ فقال أنا امرؤ من بني إسرائيل قالت فلك هذا القصر وهذا المال ؟ فقال نعم.قالت فهل لك من زوجة ؟ قال لا.قالت فكيف يهنيك العيش ولا زوجة لك ؟ قال قد كان ذاك قال فهل لك من بعل ؟ قالت لا قال فهل لك إلى أن أتزوجك ؟ قالت إنى امرأة منك على مسيرة ميل فإذا كان غد فتزود زاد يوم وائتني وإن رأيت في طريقك هولا فلا يهولنك فلما كان من الغد تزود زاد يوم وانطلق فانتهى إلى قصر فقرع رتاجة فخرج إليه شاب من أحسن الناس وجها وأطيبهم أرجا أي ريحا فقال من أنت يا عبد الله ؟ فقال أنا الإسرائيلي قال فما حاجتك ؟ قال دعتني صاحبة هذا القصر إلى نفسها قال صدقت قال فهل رأيت فى الطريق هولا ؟ قال نعم ولولا أنها أخبرتني أن لا بأس علي لهالني الذي رأيت قال ما رأيت ؟ قال أقبلت حتى إذا انفرج بي السبيل إذا أنا بكلبة فاتحة فاها ففزعت فوثبت فإذا أنا من ورائها وإذا جراؤها ينبحن فى بطنها فقال له الشاب لست تدرك هذا هذا يكون في آخر الزمان يقاعد الغلام المشيخة في مجلسهم ويسرهم حديثه قال ثم أقبلت حتى إذا انفرج بى السبيل إذا أنا بمائة عنز حفل وإذا فيها جدي يمصها فإذا أتى عليها وظن أنه لم يترك شيئا فتح فاه يلتمس الزيادة فقال لست تدرك هذا هذا يكون في آخر الزمان ملك يجمع صامت الناس كلهم حتى إذا ظن أنه لم يترك شيئا فتح فاه يلتمس الزيادة قال ثم أقبلت حتى إذا انفرج بي السبيل إذا أنا بشجر فأعجبني غصن من شجرة منها ناضرة فأردت قطعة فنادتني شجرة أخرى يا عبد الله مني فخذ حتى ناداني الشجر أجمع: يا عبد الله منى فخذ فقال لست تدرك هذا هذا يكون في آخر الزمان يقل الرجال ويكثر النساء حتى أن الرجل ليخطب المرأة فتدعوه العشر والعشرون إلى أنفسهن قال ثم أقبلت حتى إذا انفرج بي السبيل فإذا أنا برجل قائم على عين يغرف لكل إنسان من الماء فإذا تصدعوا عنه صب في جرته فلم تعلق جرته من الماء بشيء قال لست تدرك هذا هذا يكون فى آخر الزمان القاص يعلم الناس العلم ثم يخالفهم إلى معاصي الله تعالى قال ثم أقبلت حتى إذا انفرج بي السبيل إذا أنا بعنز وإذا بقوم قد أخذوا بقوائمها وإذا رجل قد أخذ بقرنيها وإذا رجل قد أخذ بذنبها وإذا راكب قد ركبها وإذا رجل يحتلبها فقال أما العنز فهي الدنيا والذين أخذوا بقوائمها يتساقطون من عيشها وأما الذي قد أخذ بقرنيها فهو يعالج من عيشها ضيقا وأما الذي أخذ بذنبها فقد أدبرت عنه وأما الذي ركبها فقد تركها وأما الذي يحلبها فبخ بخ ذهب ذلك بها قال ثم أقبلت حتى إذا انفرج بي السبيل إذا أنا برجل يمتح على قليب كلما أخرج دلوه صبه في الحوض فانساب الماء راجعا إلى القليب قال هذا رجل رد الله عليه صالح عمله فلم يقبله قال ثم أقبلت حتى إذا انفرج بي السبيل إذا أنا برجل يبذر بذرا فيستحصد فإذا حنطة طيبة قال هذا رجل قبل الله صالح عمله وأزكاه له.قال ثم أقبلت حتى إذا انفرج بي السبيل إذا أنا برجل مستلق على قفاه قال يا عبد الله ادن منى فخذ بيدي وأقعدني فوالله ما قعدت منذ خلقني الله تعالى فأخذت بيده فقام يسعى حتى ما أراه فقال له الفتى هذا عمر الأبعد نقد وأنا ملك الموت وأنا المرأة التي أتتك أمرنى الله تعالى بقبض روح الأبعد في هذا المكان ثم أصيره إلى نار جهنم قال ففيه نزلت هذه الآية \" وحيل بينهم وبين ما يشتهون \" الآية هذا أثر غريب وفي صحته نظر وتنزيل الآية عليه وفي حقه بمعنى أن الكفار كلهم يتوفون وأرواحهم متعلقة بالحياة الدنيا كما جرى لهذا المغرور المفتون ذهب يطلب مراده فجاءه ملك الموت فجأة بغتة وحيل بينه وبين ما يشتهي.وقوله تعالى: \" كما فعل بأشياعهم من قبل \" أي كما جرى للأمم الماضية المكذبة بالرسل لما جاءهم بأس الله تمنوا أن لو آمنوا فلم يقبل منهم \" فلما رأوا بأسنا قالوا آمنا بالله وحده وكفرنا بما كنا به مشركين فلم يك ينفعهم إيمانهم لما رأوا بأسنا سنة الله التي قد خلت فى عباده وخسر هنالك الكافرون \".وقوله تبارك وتعالى \" إنهم كانوا في شك مريب \" أي كانوا في الدنيا في شك وريبة فلهذا لم يتقبل منهم الإيمان عند معاينة العذاب.قال قتادة إياكم والشك والريبة فإن من مات على شك بعث عليه ومن مات على يقين بعث عليه. آخر تفسير سورة سبأ والله سبحانه وتعالى الموفق للصواب."
    },
    {
      "ayah": 6,
      "surah": 34,
      "text": "وقوله تعالى: \" ويرى الذين أوتوا العلم الذي أنزل إليك من ربك هو الحق \" هذه حكمة أخرى معطوفة على التي قبلها وهي أن المؤمنين بما أنزل على الرسل إذا شاهدوا قيام الساعة ومجازاة الأبرار والفجار بالذي كانوا قد علموه من كتب الله تعالى فى الدنيا رأوه حينئذ عين اليقين ويقولون يومئذ أيضا \" لقد جاءت رسل ربنا بالحق \" يقال أيضا \" هذا ما وعد الرحمن وصدق المرسلون \" \" لقد لبثتم في كتاب الله إلى يوم البعث فهذا يوم البعث \" \" ويرى الذين أوتوا العلم الذي أنزل إليك من ربك هو الحق ويهدي إلى صراط العزيز الحميد \" العزيز هو المنيع الجناب الذي لا يغالب ولا يمانع بل قد قهر كل شيء وغلبه الحميد في جميع أقواله وأفعاله وشرعه وقدره وهو المحمود في ذلك كله جل وعلا."
    },
    {
      "ayah": 7,
      "surah": 34,
      "text": "هذا إخبار من الله عز وجل عن استبعاد الكفرة الملحدين قيام الساعة واستهزائهم بالرسول صلى الله عليه وسلم في إخباره بذلك \" وقال الذين كفروا هل ندلكم على رجل ينبئكم إذا مزقتم كل ممزق \" أي تفرقت أجسادكم في الأرض وذهبت فيها كل مذهب وتمزقت كل ممزق \" إنكم \" أي بعد هذا الحال \" لفي خلق جديد \" أي تعودون أحياء ترزقون بعد ذلك وهو في هذا الإخبار لا يخلو أمره من قسمين إما أن يكون قد تعمد الافتراء على الله تعالى أنه قد أوحى إليه ذلك أو أنه لم يتعمد لكن لبس عليه كما يلبس على المعتوه والمجنون ولهذا."
    },
    {
      "ayah": 8,
      "surah": 34,
      "text": "قالوا: \"أفترى على الله كذبا أم به جنة \" قال الله عز وجل رادا عليهم \" بل الذين لا يومنون بالآخرة فى العذاب والضلال البعيد \" أي ليس الأمر كما زعموا ولا كما ذهبوا إليه بل محمد صلى الله عليه وسلم هو الصالح البار الراشد الذي جاء بالحق وهم الكذبة الجهلة الأغبياء \" فى العذاب \" أي الكفر المفضي بهم إلى عذاب الله تعالى \" والضلال البعيد \" من الحق في الدنيا ثم قال تعالى منبها لهم على قدرته في خلق السموات والأرض فقال تعالى: \" أفلم يروا إلى ما بين أيديهم وما خلقهم من السماء والأرض \" أى حيثما توجهوا وذهبوا فالسماء مظلة عليهم والأرض تحتهم كما قال عز وجل \" والسماء بنيناها بأيد وإنا لموسعون والأرض فرشناها فنعم الماهدون \" قال عبد بن حميد أخبرنا عبد الرزاق عن معمر عن قتادة."
    },
    {
      "ayah": 9,
      "surah": 34,
      "text": "\"أفلم يروا إلى ما بين أيديهم وما خلفهم من السماء والأرض \" قال إنك إن نظرت عن يمينك أو عن شمالك أو من بين يديك أو من خلفك رأيت السموات والأرض. وقوله تعالى: \" إن نشأ نخسف بهم الأرض أو نسقط عليهم كسفا من السماء \" أي لو شئنا لفعلنا بهم ذلك بظلمهم وقدرتنا عليهم ولكن نؤخر ذلك لحلمنا وعفونا ثم قال \" إن في ذلك لآية لكل عبد منيب \" قال معمر عن قتادة \" منيب \" تائب وقال سفيان عن قتادة المنيب المقبل إلى الله تعالى أي إن في النظر إلى خلق السموات والأرض لدلالة لكل عبد فطن لبيب رجاع إلى الله على قدرة الله تعالى على بعث الأجساد ووقوع المعاد لأن من قدر على خلق هذه السموات في ارتفاعها واتساعها وهذه الأرضين في انخفاضها وأطوالها وأعراضها إنه لقادر على إعادة الأجسام ونشر الرميم من العظام كما قال تعالى: \" أوليس الذي خلق السموات والأرض بقادر على أن يخلق مثلهم بلى \" وقال تعالى: \" لخلق السموات والأرض أكبر من خلق الناس ولكن أكثر الناس لا يعلمون \"."
    }
  ]
}
