{
  "ayahs": [
    {
      "ayah": 1,
      "surah": 35,
      "text": "قال سفيان الثوري عن إبراهيم بن مهاجر عن مجاهد عن ابن عباس رضي الله عنهما قال كنت لا أدري ما فاطر السموات والأرض حتى أتاني أعرابيان يختصمان في بئر فقال أحدهما لصاحبه أنا فطرتها أي بدأتها وقال ابن عباس رضي الله عنهما أيضا \"فاطر السموات والأرض\" أي بديع السموات والأرض وقال الضحاك كل شيء في القرآن فاطر السموات والأرض فهو خالق السموات والأرض. وقوله تعالى: \"جاعل الملائكة رسلا\" أي بينه وبين أنبيائه \"أولي أجنحة\" أي يطيرون بها ليبلغوا ما أمروا به سريعا \"مثنى وثلاث ورباع\" أي منهم من له جناحان ومنهم من له ثلاثة ومنهم من له أربعة ومنهم من له أكثر من ذلك كما جاء في الحديث أن رسول الله صلى الله عليه وسلم رأى جبريل عليه السلام ليلة الإسراء وله ستمائة جناح بين كل جناحين كما بين المشرق والمغرب ولهذا قال جل وعلا \"يزيد في الخلق ما يشاء إن الله على كل شيء قدير\" قال السدي يزيد في الأجنحة وخلقهم ما يشاء وقال الزهري وابن جريج في قوله تعالى: \"يزيد في الخلق ما يشاء\" يعنى حسن الصوت رواه عن الزهري البخاري في الأدب وابن أبي حاتم في تفسيره وقرئ في الشاذ \"يزيد في الحلق\" بالحاء المهملة والله أعلم."
    },
    {
      "ayah": 10,
      "surah": 35,
      "text": "وقوله تعالى: \"من كان يريد العزة فلله العزة جميعا\" أي من كان يحب أن يكون عزيزا في الدنيا والآخرة فليلزم طاعة الله تعالى فإنه يحصل له مقصوده لأن الله تعالى مالك الدنيا والآخرة وله العزة جميعا كما قال تعالى: \"الذين يتخذون الكافرين أولياء من دون المؤمنين أيبتغون عندهم العزة فإن العزة لله جميعا\" وقال عز وجل \"ولا يحزنك قولهم إن العزة لله جميعا\" وقال جل جلاله \"ولله العزة ولرسوله وللمؤمنين ولكن المنافقين لا يعلمون\" قال مجاهد \"من كان يريد العزة\" بعبادة الأوثان \"فإن العزة لله جميعا\" وقال قتادة \"من كان يريد العزة فإن العزة لله جميعا\" أي فليتعزز بطاعة الله عز وجل وقيل من كان يريد علم العزة لمن هي \"فإن العزة لله جميعا\" وحكاه ابن جرير. وقوله تبارك وتعالى: \"إليه يصعد الكلم الطيب\" يعني الذكر والتلاوة والدعاء قاله غير واحد من السلف. وقال ابن جرير حدثنا محمد بن إسماعيل الأحمسي أخبرني جعفر بن عون عن عبدالرحمن بن عبدالله المسعودي عن عبدالله بن المخارق عن أبيه المخارق بن سليم قال: قال لنا عبدالله هو ابن مسعود رضي الله عنه إذا حدثناكم بحديث أتيناكم بتصديق ذلك من كتاب الله تعالى إن العبد المسلم إذا قال سبحان الله وبحمده والحمد لله ولا إله إلا الله والله أكبر تبارك الله أخذهن ملك فجعلهن تحت جناحه ثم صعد بهن إلى السماء فلا يمر بهن على جمع من الملائكة إلا استغفروا لقائلهن حتى يجيء بهن وجه الله عز وجل ثم قرأ عبدالله رضي الله عنه \"إليه يصعد الكلم الطيب والعمل الصالح يرفعه\" وحدثني يعقوب بن إبراهيم حدثنا ابن علية أخبرنا سعيد الجريري عن عبدالله بن شقيق قال: قال كعب الأحبار إن لسبحان الله والحمد لله ولا إله إلا الله والله أكبر لدويا حول العرش كدوي النحل يذكرن لصاحبهن والعمل الصالح فى الخزائن ; وهذا إسناد صحيح إلى كعب الأحبار رحمة الله عليه وقد روي مرفوعا. قال الإمام أحمد حدثنا ابن نمير حدثنا موسى يعني ابن أبى مسلم الطحان عن عون بن عبدالله عن أبيه أو عن أخيه عن النعمان بن بشير رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم \"الذين يذكرون الله من جلال الله من تسبيحه وتكبيره وتحميده وتهليله يتعاطفن حول العرش لهن دوي كدوي النحل يذكرن بصاحبهن ألا يحب أحدكم أن لا يزال له عند الله شيء يذكر به\" وهكذا رواه ابن ماجة عن أبى بشر بكر بن خلف عن يحيى بن سعيد القطان عن موسى بن أبي مسلم الطحان عن عون بن عبدالله بن عتبة بن مسعود عن أبيه أو عن أخيه عن النعمان بن بشير رضي الله عنه به. وقوله تعالى: \"والعمل الصالح يرفعه\" قال علي بن أبي طلحة عن ابن عباس رضي الله عنهما الكلم الطيب ذكر الله تعالى يصعد به إلى الله عز وجل والعمل الصالح أداء الفريضة فمن ذكر الله تعالى في أداء فرائضه حمل عمله ذكر الله تعالى يصعد به إلى الله عز وجل ومن ذكر الله تعالى ولم يؤد فرائضه رد كلامه على عمله فكان أولى به وكذا قال مجاهد العمل الصالح يرفعه الكلام الطيب وكذا قال أبو العالية وعكرمة وإبراهيم النخعي والضحاك والسدي والربيع بن أنس وشهر بن حوشب وغير واحد وقال إياس بن معاوية القاضي لولا العمل الصالح لم يرفع الكلام وقال الحسن وقتادة لا يقبل قول إلا بعمل. وقوله تعالى \"والذين يمكرون السيئات\" قال مجاهد وسعيد بن جبير وشهر بن حوشب هم المراءون بأعمالهم يعني يمكرون بالناس يوهمون أنهم في طاعة الله تعالى وهم بغضاء إلى الله عز وجل يراءون بأعمالهم \"ولا يذكرون الله إلا قليلا\" وقال عبدالرحمن بن زيد بن أسلم هم المشركون والصحيح أنها عامة والمشركون داخلون بطريق الأولى ولهذا قال تعالى: \"لهم عذاب شديد ومكر أولئك هو يبور\" أي يفسد ويبطل ويظهر زيفهم عن قريب لأولي البصائر والنهي فإنه ما أسر أحد سريرة إلا أبداها الله تعالى على صفحات وجهه وفلتات لسانه وما أسر أحد سريرة إلا كساه الله تعالى رداءها إن خيرا فخير وإن شرا فشر فالمرائي لا يروج أمره ويستمر إلا على غبي أما المؤمنون المتفرسون فلا يروج ذلك عليهم بل ينكشف لهم عن قريب وعالم الغيب لا تخفى عليه خافية."
    },
    {
      "ayah": 11,
      "surah": 35,
      "text": "وقوله تبارك وتعالى \"والله خلقكم من تراب ثم من نطفة\" أي ابتدأ خلق أبيكم آدم من تراب ثم جعل نسله من سلاله من ماء مهين \"ثم جعلكم أزواجا\" أي ذكرا وأنثى لطفا منه ورحمة أن جعل لكم أزواجا من جنسكم لتسكنوا إليها وقوله عز وجل \"وما تحمل من أنثى ولا تضع إلا بعلمه\" أي هو عالم بذلك لا يخفى عليه من ذلك شيء بل \"ما تسقط من ورقة إلا يعلمها ولا حبة في ظلمات الأرض ولا رطب ولا يابس إلا فى كتاب مبين\" وقد تقدم الكلام على قوله تعالى: \"الله يعلم ما تحمل كل أنثى وما تغيض الأرحام وما تزداد وكل شيء عنده بمقدار عالم الغيب والشهادة الكبير المتعال\" وقوله عز وجل \"وما يعمر من معمر ولا ينقص من عمره إلا في كتاب\" أي ما يعطي بعض النطف من العمر الطويل يعلمه وهو عنده في الكتاب الأول \"وما ينقص من عمره\" الضمير عائد على الجنس لا على العين لأن الطويل العمر في الكتاب وفي علم الله تعالى لا ينقص من عمره وإنما عاد الضمير على الجنس قال ابن جرير وهذا كقولهم عندي ثوب ونصفه أي ونصف ثوب آخر وروي من طريق العوفي عن ابن عباس رضي الله عنهما في قوله تعالى: \"وما يعمر من معمر ولا ينقص من عمره إلا في كتاب إن ذلك على الله يسير\" يقول ليس أحد قضيت له بطول العمر والحياة إلا وهو بالغ ما قدرت له من العمر وقد قضيت ذلك له فإنما ينتهي إلى الكتاب الذي قدرت لا يزاد عليه وليس أحد قدرت له أنه قصير العمر والحياة يبالغ العمر ولكن ينتهي إلى الكتاب الذي كتبت له فذلك قوله تعالى: \"ولا ينقص من عمره إلا في كتاب إن ذلك على الله يسير\" يقول كل ذلك في كتاب عنده وهكذا قال الضحاك بن مزاحم وقال عبدالرحمن بن زيد بن أسلم عن أبيه \"ولا ينقص من عمره إلا في كتاب\" قال ما لفظت الأرحام من الأولاد من غير تمام وقال عبدالرحمن في تفسيرها ألا ترى الناس يعيش الإنسان مائة سنة وآخر يموت حين يولد فهذا هذا وقال قتادة والذي ينقص من عمره فالذي يموت قبل ستين سنة وقال مجاهد \"وما يعمر من معمر ولا ينقص من عمره إلا في كتاب\" أي في بطن أمه يكتب له ذلك لم يخلق الخلق على عمر واحد بل لهذا عمر ولهذا عمر هو أنقص من عمره فكل ذلك مكتوب لصاحبه بالغ ما بلغ وقال بعضهم بل معناه \"وما يعمر من معمر\" أي ما يكتب من الأجل \"ولا ينقص من عمره\" وهو ذهابه قليلا قليلا الجميع معلوم عند الله تعالى سنة بعد سنة وشهرا بعد شهر وجمعة بعد جمعة ويوما بعد يوم وساعة بعد ساعة الجميع مكتوب عند الله تعالى في كتابه. نقله ابن جرير عن أبي مالك وإليه ذهب السدي وعطاء الخراساني واختار ابن جرير الأول وهو كما قال وقال النسائي عند تفسير هذه الآية الكريمة حدثنا أحمد بن يحيى بن أبي زيد بن سليمان قال سمعت ابن وهب يقول حدثني يونس عن ابن شهاب عن أنس بن مالك رضي الله عنه قال سمعت رسول الله صلى الله عليه وسلم يقول \"من سره أن يبسط له في رزقه وينسأ له في أثره فليصل رحمه\" وقد رواه البخاري ومسلم وأبو داود من حديث يونس بن يزيد الإيلي به. وقال ابن أبي حاتم حدثنا علي بن الحسين بن الوليد حدثنا الوليد بن الوليد بن عبدالملك بن عبيدالله أبو سرح حدثنا عثمان بن عطاء عن مسلمة بن عبدالله عن عمه أبي مسجعة بن ربعي عن أبي الدرداء رضي الله عنه قال: ذكرنا عند رسول الله صلى الله عليه وسلم فقال: \"إن الله تعالى لا يؤخر نفسا إذا جاء أجلها وإنما زيادة العمر بالذرية الصالحة يرزقها العبد فيدعون له من بعده فيلحقه دعاؤهم في قبره فذلك زيادة العمر\" وقوله عز وجل \"إن ذلك على الله يسير\" أى سهل عليه يسير لديه علم بذلك وبتفصيله في جميع مخلوقاته فإن علمه شامل للجميع لا يخفى عليه شيء منها."
    },
    {
      "ayah": 12,
      "surah": 35,
      "text": "يقول تعالى منبها على قدرته العظيمة في خلقه الأشياء المختلفة خلق البحرين العذب الزلال وهو هذه الأنهار السارحة بين الناس من كبار وصغار بحسب الحاجة إليها في الأقاليم والأمصار والعمران والبراري والقفار وهي عذبة سائغ شرابها لمن أراد ذلك \"وهذا ملح أجاج\" أي مر وهو البحر الساكن الذي تسير فيه السفن الكبار وإنما تكون مالحة زعافا مرة ولهذا قال \"وهذا ملح أجاج\" أي مر ثم قال تعالى: \"ومن كل تأكلون لحما طريا\" يعني السمك \"وتستخرجون حلية تلبسونها\" كما قال عز وجل \"يخرج منهما اللؤلؤ والمرجان فبأي آلاء ربكما تكذبان\" وقوله جل وعلا \"وترى الفلك فيه مواخر\" أي تمخره وتشقه بحيزومها وهو مقدمها المسنم الذي يشبه جؤجؤ الطير وهو صدره وقال مجاهد تمخر الريح السفن ولا يمخر الريح من السفن إلا العظام وقوله جلا وعلا \"لتبتغوا من فضله\" أي بأسفاركم بالتجارة من قطر إلى قطر. وإقليم إلى إقليم \"ولعلكم تشكرون\" أي تشكرون ربكم على تسخيره لكم هذا الخلق العظيم وهو البحر تتصرفون فيه كيف شئتم وتذهبون أين أردتم ولا يمتنع عليكم شيء منه بل بقدرته قد سخر لكم ما في السموات وما في الأرض الجميع من فضله ورحمته."
    },
    {
      "ayah": 13,
      "surah": 35,
      "text": "وهذا أيضا من قدرته التامة وسلطانه العظيم في تسخيره الليل بظلامه والنهار بضيائه ويأخذ من طول هذا فيزيده في قصر هذا فيعتدلان ثم يأخذ من هذا في هذا فيطول هذا ويقصر هذا ثم يتقارضان صيفا وشتاء \"وسخر الشمس والقمر\" أي والنجوم السيارات والثوابت الثاقبات بأضوائهن أجرام السموات الجميع يسيرون بمقدار معين. وعلى منهاج مقنن محرر تقديرا من عزيز عليم \"كل يجري لأجل مسمى\" أي إلى يوم القيامة \"ذلكم الله ربكم\" أي الذي فعل هذا هو الرب العظيم الذي لا إله غيره \"والذين تدعون من دونه\" أي من الأصنام والأنداد التي هي على صورة من تزعمون من الملائكة المقربين \"ما يملكون من قطمير\" قال ابن عباس رضي الله عنهما ومجاهد وعكرمة وعطاء وعطية العوفي والحسن وقتادة وغيرهم القطمير هو: اللفافة التي تكون على نواة التمرة أي لا يملكون من السموات والأرض شيئا ولا بمقدار هذا القطمير."
    },
    {
      "ayah": 14,
      "surah": 35,
      "text": "ثم قال تعالى: \"إن تدعوهم لا يسمعوا دعاءكم\" يعني الآلهة التي تدعونها من دون الله لا تسمع دعاءكم لأنها جماد لا أرواح فيها \"ولو سمعوا ما استجابوا لكم\" أي لا يقدرون على شيء مما تطلبون منها \"ويوم القيامة يكفرون بشرككم\" أي يتبرءون منكم كما قال تعالى: \"ومن أضل ممن يدعوا من دون الله من لا يستجيب له إلى يوم القيامة وهم عن دعائهم غافلون وإذا حشر الناس كانوا لهم أعداء وكانوا بعبادتهم كافرين\" وقال تعالى: \"واتخذوا من دون الله آلهة ليكونوا لهم عزا كلا سيكفرون بعبادتهم ويكونون عليهم ضدا\" وقوله تعالى \"ولا ينبئك مثل خبير\" أي ولا يخبرك بعواقب الأمور ومآلها وما تصير إليه مثل خبير بها قال قتادة يعني نفسه تبارك وتعالى أخبر بالواقع لا محالة."
    },
    {
      "ayah": 15,
      "surah": 35,
      "text": "يخبر تعالى بغنائه عما سواه وبافتقار المخلوقات كلها إليه وتذللها بين يديه فقال تعالى: \"يا أيها الناس أنتم الفقراء إلى الله\" أي هم محتاجون إليه في جميع الحركات والسكنات وهو تعالى الغني عنهم بالذات ولهذا قال عز وجل \"والله هو الغني الحميد\" أي هو المنفرد بالغنى وحده لا شريك له وهو الحميد في جميع ما يفعله ويقوله ويقدره ويشرعه."
    },
    {
      "ayah": 16,
      "surah": 35,
      "text": "وقوله تعالى: \"إن يشأ يذهبكم ويأت بخلق جديد\" أي لو شاء لأذهبكم أيها الناس وأتى بقوم غيركم."
    },
    { "ayah": 17, "surah": 35, "text": "ولهذا قال تعالى: \"وما ذلك على الله بعزيز\" وما هذا عليه بصعب ولا ممتنع." },
    {
      "ayah": 18,
      "surah": 35,
      "text": "وقوله تعالى: \"ولا تزر وازرة وزر أخرى\" أي يوم القيامة \"وإن تدع مثقلة إلى حملها\" أي وإن تدع نفس مثقلة بأوزارها إلى أن تساعد على حمل ما عليها من الأوزار أو بعضه \"لا يحمل منه شيء ولو كان ذا قربى\" أي وإن كان قريبا إليها حتى ولو كان أباها أو ابنها كل مشغول بنفسه وحاله قال عكرمة في قوله تعالى: \"وإن تدع مثقلة إلى حملها\" الآية قال هو الجار يتعلق بجاره يوم القيامة فيقول يا رب سل هذا لم كان يغلق بابه دوني وإن الكافر ليتعلق بالمؤمن يوم القيامة فيقول له يا مؤمن إن لي عندك يدا قد عرفت كيف كنت لك في الدنيا وقد احتجت إليك اليوم فلا يزال المؤمن يشفع له عند ربه حتى يرده إلى منزل دون منزله وهو في النار وإن الوالد ليتعلق بولده يوم القيامة فيقول يا بني أي والد كنت لك؟ فيثني خيرا فيقول له يا بني إني قد احتجت إلى مثقال ذرة من حسناتك أنجو بها مما ترى فيقول له ولده يا أبت ما أيسر ما طلبت ولكني أتخوف مثل ما تتخوف فلا أستطيع أن أعطيك شيئا ثم يتعلق بزوجته فيقول يا فلانة أو يا هذه أي زوج كنت لك فتثني خيرا فيقول لها إنى أطلب إليك حسنة واحدة تهبيها لي لعلي أنجو بها مما ترين. قال فتقول ما أيسر ما طلبت ولكني لا أطيق أن أعطيك شيئا إنى أتخوف مثل الذي تتخوف يقول الله تعالى: \"وإن تدع مثقلة إلى حملها\" الآية ويقول تبارك وتعالى: \"لا يجزي والد عن ولده ولا مولود هو جاز عن والده شيئا\" ويقول تعالى: \"يوم يفر المرء من أخيه وأمه وأبيه وصاحبته وبنيه لكل امرئ منهم يومئذ شأن يغنيه\" رواه ابن أبي حاتم رحمه الله عن أبي عبدالله الظهراني عن حفص بن عمر عن الحكم بن أبان عن عكرمة به ثم قال تبارك وتعالى: \"إنما تنذر الذين يخشون ربهم بالغيب وأقاموا الصلاة\" أي إنما يتعظ بما جئت به أولو البصائر والنهي الخائفون من ربهم الفاعلون ما أمرهم به \"ومن تزكى فإنما يتزكى لنفسه\" أي ومن عمل صالحا فإنما يعود نفعه على نفسه \"وإلى الله المصير\" أي وإليه المرجع والمآب وهو سريع الحساب وسيجزي كل عامل بعمله إن خيرا فخير وإن شرا فشر."
    },
    {
      "ayah": 19,
      "surah": 35,
      "text": "يقول تعالى كما لا تستوى هذه الأشياء المتباينة المختلفة كالأعمى والبصير لا يستويان بل بينهما فرق وبون كثير وكما لا تستوي الظلمات ولا النور ولا الظل ولا الحرور كذلك لا تستوي الأحياء ولا الأموات وهذا مثل ضربه الله تعالى للمؤمنين وهم الأحياء وللكافرين وهم الأموات كقوله تعالى: \"أو من كان ميتا فأحييناه وجعلنا له نورا يمشي به في الناس كمن مثله في الظلمات ليس بخارج منها\" وقال عز وجل \"مثل الفريقين كالأعمى والأصم والبصير والسميع هل يستويان مثلا\" فالمؤمن بصير سميع في نور يمشي على صراط مستقيم في الدنيا والآخرة حتى يستقر به الحال في الجنات ذات الظلال والعيون والكافر أعمى وأصم في ظلمات يمشي لا خروج منها بل هو يتيه في غية وضلاله في الدنيا والآخرة حتى يفضي به ذلك إلى الحرور والسموم والحميم وظل من يحموم لا بارد ولا كريم. وقوله تعالى: \"إن الله يسمع من يشاء\" أي يهديهم إلى سماع الحجة وقبولها والانقياد لها \"وما أنت بمسمع من في القبور\" أى كما لا ينتفع الأموات بعد موتهم وصيرورتهم إلى قبورهم وهم كفار بالهداية والدعوة إليها كذلك هؤلاء المشركون الذين كتب عليهم الشقاوة لا حيلة لك فيهم ولا تستطيع هدايتهم."
    },
    {
      "ayah": 2,
      "surah": 35,
      "text": "يخبر تعالى أنه ما شاء كان وما لم يشأ لم يكن وأنه لا مانع لما أعطى ولا معطي لما منع قال الإمام أحمد حدثنا علي بن عاصم حدثنا مغيرة أخبرنا عامر عن وراد مولى المغيرة بن شعبة قال إن معاوية كتب إلى المغيرة بن شعبة: اكتب لي بما سمعت من رسول الله صلى الله عليه وسلم فدعاني المغيرة فكتبت إليه إني سمعت رسول الله صلى الله عليه وسلم يقول إذا انصرف من الصلاة \"لا إله إلا الله وحده لا شريك له له الملك وله الحمد وهو على كل شيء قدير اللهم لا مانع لما أعطيت ولا معطي لما منعت ولا ينفع ذا الجد منك الجد\" وسمعته ينهى عن قيل وقال وكثرة السؤال وإضاعة المال. وعن وأد البنات وعقوق الأمهات ومنع وهات. وأخرجاه من طرق عن وراد به وثبت في صحيح مسلم عن أبي سعيد الخدري رضي الله عنه قال إن رسول الله صلى الله عليه وسلم كان إذا رفع رأسه من الركوع يقول \"سمع الله لمن حمده اللهم ربنا لك الحمد ملء السماء والأرض وملء ما شئت من شيء بعد اللهم أهل الثناء والمجد أحق ما قال العبد وكلنا لك عبد اللهم لا مانع لما أعطيت ولا معطي لما منعت ولا ينفع ذا الجد منك الجد\" وهذه الآية كقوله تبارك وتعالى \"وإن يمسسك الله بضر فلا كاشف له إلا هو وإن يردك بخير فلا راد لفضله\" ولها نظائر كثيرة. وقال الإمام مالك رحمة الله عليه كان أبو هريرة رضي الله عنه إذا مطروا يقول مطرنا بنوء الفتح ثم يقرأ هذه الآية \"ما يفتح الله للناس من رحمة فلا ممسك لها وما يمسك فلا مرسل له من بعده وهو العزيز الحكيم\" ورواه ابن أبي حاتم عن يونس عن ابن وهب عنه."
    },
    {
      "ayah": 20,
      "surah": 35,
      "text": "يقول تعالى كما لا تستوى هذه الأشياء المتباينة المختلفة كالأعمى والبصير لا يستويان بل بينهما فرق وبون كثير وكما لا تستوي الظلمات ولا النور ولا الظل ولا الحرور كذلك لا تستوي الأحياء ولا الأموات وهذا مثل ضربه الله تعالى للمؤمنين وهم الأحياء وللكافرين وهم الأموات كقوله تعالى: \"أو من كان ميتا فأحييناه وجعلنا له نورا يمشي به في الناس كمن مثله في الظلمات ليس بخارج منها\" وقال عز وجل \"مثل الفريقين كالأعمى والأصم والبصير والسميع هل يستويان مثلا\" فالمؤمن بصير سميع في نور يمشي على صراط مستقيم في الدنيا والآخرة حتى يستقر به الحال في الجنات ذات الظلال والعيون والكافر أعمى وأصم في ظلمات يمشي لا خروج منها بل هو يتيه في غية وضلاله في الدنيا والآخرة حتى يفضي به ذلك إلى الحرور والسموم والحميم وظل من يحموم لا بارد ولا كريم. وقوله تعالى: \"إن الله يسمع من يشاء\" أي يهديهم إلى سماع الحجة وقبولها والانقياد لها \"وما أنت بمسمع من في القبور\" أى كما لا ينتفع الأموات بعد موتهم وصيرورتهم إلى قبورهم وهم كفار بالهداية والدعوة إليها كذلك هؤلاء المشركون الذين كتب عليهم الشقاوة لا حيلة لك فيهم ولا تستطيع هدايتهم."
    },
    {
      "ayah": 21,
      "surah": 35,
      "text": "يقول تعالى كما لا تستوى هذه الأشياء المتباينة المختلفة كالأعمى والبصير لا يستويان بل بينهما فرق وبون كثير وكما لا تستوي الظلمات ولا النور ولا الظل ولا الحرور كذلك لا تستوي الأحياء ولا الأموات وهذا مثل ضربه الله تعالى للمؤمنين وهم الأحياء وللكافرين وهم الأموات كقوله تعالى: \"أو من كان ميتا فأحييناه وجعلنا له نورا يمشي به في الناس كمن مثله في الظلمات ليس بخارج منها\" وقال عز وجل \"مثل الفريقين كالأعمى والأصم والبصير والسميع هل يستويان مثلا\" فالمؤمن بصير سميع في نور يمشي على صراط مستقيم في الدنيا والآخرة حتى يستقر به الحال في الجنات ذات الظلال والعيون والكافر أعمى وأصم في ظلمات يمشي لا خروج منها بل هو يتيه في غية وضلاله في الدنيا والآخرة حتى يفضي به ذلك إلى الحرور والسموم والحميم وظل من يحموم لا بارد ولا كريم. وقوله تعالى: \"إن الله يسمع من يشاء\" أي يهديهم إلى سماع الحجة وقبولها والانقياد لها \"وما أنت بمسمع من في القبور\" أى كما لا ينتفع الأموات بعد موتهم وصيرورتهم إلى قبورهم وهم كفار بالهداية والدعوة إليها كذلك هؤلاء المشركون الذين كتب عليهم الشقاوة لا حيلة لك فيهم ولا تستطيع هدايتهم."
    },
    {
      "ayah": 22,
      "surah": 35,
      "text": "يقول تعالى كما لا تستوى هذه الأشياء المتباينة المختلفة كالأعمى والبصير لا يستويان بل بينهما فرق وبون كثير وكما لا تستوي الظلمات ولا النور ولا الظل ولا الحرور كذلك لا تستوي الأحياء ولا الأموات وهذا مثل ضربه الله تعالى للمؤمنين وهم الأحياء وللكافرين وهم الأموات كقوله تعالى: \"أو من كان ميتا فأحييناه وجعلنا له نورا يمشي به في الناس كمن مثله في الظلمات ليس بخارج منها\" وقال عز وجل \"مثل الفريقين كالأعمى والأصم والبصير والسميع هل يستويان مثلا\" فالمؤمن بصير سميع في نور يمشي على صراط مستقيم في الدنيا والآخرة حتى يستقر به الحال في الجنات ذات الظلال والعيون والكافر أعمى وأصم في ظلمات يمشي لا خروج منها بل هو يتيه في غية وضلاله في الدنيا والآخرة حتى يفضي به ذلك إلى الحرور والسموم والحميم وظل من يحموم لا بارد ولا كريم. وقوله تعالى: \"إن الله يسمع من يشاء\" أي يهديهم إلى سماع الحجة وقبولها والانقياد لها \"وما أنت بمسمع من في القبور\" أى كما لا ينتفع الأموات بعد موتهم وصيرورتهم إلى قبورهم وهم كفار بالهداية والدعوة إليها كذلك هؤلاء المشركون الذين كتب عليهم الشقاوة لا حيلة لك فيهم ولا تستطيع هدايتهم."
    },
    {
      "ayah": 23,
      "surah": 35,
      "text": "\"إن أنت إلا نذير\" أي إنما عليك البلاغ والإنذار والله يضل من يشاء ويهدي من يشاء."
    },
    {
      "ayah": 24,
      "surah": 35,
      "text": "\"إنا أرسلناك بالحق بشيرا ونذيرا\" أي بشيرا للمؤمنين ونذيرا للكافرين \"وإن من أمة إلا خلا فيها نذير\" أي وما من أمة خلت من بني آدم إلا وقد بعث الله تعالى إليهم النذر وأزاح عنهم العلل كما قال تعالى: \"إنما أنت منذر ولكل قوم هاد\" وكما قال تعالى: \"ولقد بعثنا في كل أمة رسولا أن اعبدوا الله واجتنبوا الطاغوت فمنهم من هدى الله ومنهم من حقت عليه الضلالة\" الآية والآيات في هذا كثيرة."
    },
    {
      "ayah": 25,
      "surah": 35,
      "text": "وقوله تعالى \"وإن يكذبوك فقد كذب الذين من قبلهم جاءتهم رسلهم بالبينات\" وهي المعجزات الباهرات والأدلة القاطعات \"وبالزبر\" وهي الكتب \"وبالكتاب المنير\" أي الواضح البين."
    },
    {
      "ayah": 26,
      "surah": 35,
      "text": "\"ثم أخذت الذين كفروا\" أي ومع هذا كله كذب أولئك رسلهم فيما جاءوهم به فأخذتم أي بالعقاب والنكال \"فكيف كان نكير\" أي فكيف رأيت إنكاري عليهم عظيما شديدا بليغا والله أعلم."
    },
    {
      "ayah": 27,
      "surah": 35,
      "text": "يقول تعالى منبها على كمال قدرته في خلقه الأشياء المتنوعة المختلفة من الشيء الواحد وهو الماء الذي ينزله من السماء يخرج به ثمرات مختلفا ألوانها من أصفر وأحمر وأخضر وأبيض إلى غير ذلك من ألوان الثمار كما هو مشاهد من تنوع ألوانها وطعومها وروائحها كما قال تعالى: في الآية الأخرى \"وفي الأرض قطع متجاورات وجنات من أعناب وزرع ونخيل صنوان وغير صنوان يسقى بماء واحد ونفضل بعضها على بعض فى الأكل إن في ذلك لآيات لقوم يعقلون\" وقوله تبارك وتعالى: \"ومن الجبال جدد بيض وحمر مختلف ألوانها\" أي وخلق الجبال كذلك مختلفة الألوان كما هو المشاهد أيضا من بيض وحمر وفي بعضها طرائق وهي الجدد جمع جدة مختلفة الألوان أيضا. قال ابن عباس رضي الله عنهما الجدد الطرائق وكذا قال أبو مالك والحسن وقتادة والسدي ومنها غرابيب سود قال عكرمة الغرابيب الجبال الطوال السود وكذا قال أبو مالك وعطاء الخراساني وقتادة وقال ابن جرير والعرب إذا وصفوا الأسود بكثرة السواد قالوا أسود غربيب ولهذا قال بعض المفسرين في هذه الآية هذا من المقدم والمؤخر في قوله تعالى: \"وغرابيب سود\" أي سود غرابيب وفيما قاله نظر."
    },
    {
      "ayah": 28,
      "surah": 35,
      "text": "وقوله تعالى: \"ومن الناس والدواب والأنعام مختلف ألوانه كذلك\" أي كذلك الحيوانات من الناس والدواب وهو كل ما دب على القوائم والأنعام من باب عطف الخاص على العام كذلك هي مختلفة أيضا فالناس منهم بربر وحبوش وطماطم في غاية السواد وصقالبة وروم في غاية البياض والعرب بين ذلك والهنود دون ذلك ولهذا قال تعالى: في الآية الأخرى \"واختلاف ألسنتكم وألوانكم إن في ذلك لآيات للعالمين\" وكذلك الدواب والأنعام مختلفة الألوان حتى في الجنس الواحد بل النوع الواحد منهم مختلف الألوان بل الحيوان الواحد يكون أبلق فيه من هذا اللون وهذا اللون فتبارك الله أحسن الخالقين. وقد قال الحافظ أبو بكر البزار في مسنده حدثنا الفضل بن سهل حدثنا عبدالله بن عمر بن أبان بن صالح حدثنا زياد بن عبدالله عن عطاء بن السائب عن سعد بن جبير عن ابن عباس رضي الله عنهما قال: جاء رجل إلى النبي صلى الله عليه وسلم فقال أيصبغ ربك قال صلى الله عليه وسلم \"نعم صبغا لا ينفض أحمر وأصفر وأبيض\" وروي مرسلا وموقوفا والله أعلم. ولهذا قال تعالى: بعد هذا \"إنما يخشى الله من عباده العلماء\" أي إنما يخشاه حق خشيته العلماء العارفون به لأنه كلما كانت المعرفة للعظيم القدير العليم الموصوف بصفات الكمال المنعوت بالأسماء الحسنى كلما كانت المعرفة به أتم والعلم به أكمل كانت الخشية له أعظم وأكثر. قال علي بن أبي طلحة عن ابن عباس في قوله تعالى: \"إنما يخشى الله من عباده العلماء\" قال الذين يعلمون أن الله على كل شيء قدير\". وقال ابن لهيعة عن ابن أبي عمرة عن عكرمة عن ابن عباس قال:العالم بالرحمن من عباده من لم يشرك شيئا وأحل حلاله وحرم حرامه وحفظ وصيته وأيقن أنه ملاقيه ومحاسب بعمله وقال سعيد بن جبير الخشية هي التي تحول بينك وبين معصية الله عز وجل وقال الحسن البصري العالم من خشي الرحمن بالغيب ورغب فيما رغب الله فيه وزهد فيما سخط الله فيه ثم تلا الحسن \"إنما يخشى الله من عباده العلماء إن الله عزيز غفور\" وعن ابن مسعود رضي الله عنه أنه قال: ليس العلم عن كثرة الحديث ولكن العلم عن كثرة الخشية. وقال أحمد بن صالح المصري عن ابن وهب عن مالك قال: إن العلم ليس بكثرة الرواية وإنما العلم نور يجعله الله في القلب. قال أحمد بن صالح المصري معناه أن الخشية لا تدرك بكثرة الرواية وإنما العلم الذي فرض الله عز وجل أن يتبع فإنما هو الكتاب والسنة وما جاء عن الصحابة رضي الله عنهم ومن بعدهم من أئمة المسلمين فهذا لا يدرك إلا بالرواية ويكون تأويل قوله: نور يريد به فهم العلم ومعرفة معانيه. وقال سفيان الثوري عن أبي حيان التيمي عن رجل قال: كان يقال العلماء ثلاثة عالم بالله عالم بأمر الله وعالم بالله ليس بعالم بأمر الله وعالم بأمر الله ليس بعالم بالله; فالعالم بالله وبأمر الله الذي يخشى الله تعالى ويعلم الحدود والفرائض والعالم بالله ليس بعالم بأمر الله الذي يخشى الله ولا يعلم الحدود والفرئض والعالم بأمر الله ليس بعالم بالله الذي يعلم الحدود والفرائض ولا يخشى الله عز وجل."
    },
    {
      "ayah": 29,
      "surah": 35,
      "text": "يخبر تعالى عن عباده المؤمنين الذين يتلون كتابه ويؤمنون به ويعملون بما فيه من إقام الصلاة والإنفاق مما رزقهم الله تعالى في الأوقات المشروعة ليلا ونهارا سرا وعلانية \"يرجون تجارة لن تبور\" أي يرجون ثوابا عند الله لا بد من حصوله كما قدمنا في أول التفسير عند فضائل القرآن أنه يقول لصاحبه إن كل تاجر من وراء تجارته وإنك اليوم من وراء كل تجارة."
    },
    {
      "ayah": 3,
      "surah": 35,
      "text": "ينبه تعالى عباده ويرشدهم إلى الاستدلال على توحيده في إفراد العبادة له كما أنه المستقل بالخلق والرزق فكذلك فليفرد بالعبادة ولا يشرك به غيره من الأصنام والأنداد والأوثان ولهذا قال تعالى: \"لا إله إلا هو فأنى تؤفكون\" أي فكيف تؤفكون بعد هذا البيان ووضوح هذا البرهان وأنتم بعد هذا تعبدون الأنداد والأوثان والله أعلم."
    },
    {
      "ayah": 30,
      "surah": 35,
      "text": "ولهذا قال تعالى: \"ليوفيهم أجورهم ويزيدهم من فضله\" أي ليوفيهم ثواب ما عملوه ويضاعفه لهم بزيادات لم تخطر لهم \"إنه غفور\" أى لذنوبهم \"شكور\" للقليل من أعمالهم. قال قتادة كان مطرف رحمه الله إذا قرأ هذه الآية يقول هذه آية القراء قال الإمام أحمد حدثنا أبو عبدالرحمن حدثنا حيوة حدثنا سالم بن غيلان قال: إنه سمع دراجا أبا السمح يحدث به أبي الهيثم عن أبي سعيد الخدري رضي الله عنه قال: إنه سمع رسول الله صلى الله عليه وسلم يقول \"إن الله تعالى إذا رضي عن العبد أثنى عليه بسبعة أصناف من الخير لم يعمله وإذا سخط على العبد أثنى عليه بسبعة أضعاف من الشر لم يعمله\" غريب جدا."
    },
    {
      "ayah": 31,
      "surah": 35,
      "text": "يقول تعالى \"والذي أوحينا إليك \" يا محمد من الكتاب وهو القرآن \"هو الحق مصدقا لما بين يديه\" أي من الكتب المتقدمة بصدقها كما شهدت هي له بالتنويه وأنه منزل من رب العالمين \"إنه بعباده لخبير بصير\" أي هو خبير بهم بصير بمن يستحق ما يفضله به على من سواه ولهذا فضل الأنبياء والرسل على جميع البشر وفضل النبيين بعضهم على بعض ورفع بعضهم درجات وجعل منزلة محمد صلى الله عليه وسلم فوق جميعهم صلوات الله وسلامه عليهم أجمعين."
    },
    {
      "ayah": 32,
      "surah": 35,
      "text": "يقول تعالى: ثم جعلنا القائمين بالكتاب العظيم المصدق لما بين يديه من الكتب الذين اصطفينا من عبادنا وهم هذه الأمة ثم قسمهم إلى ثلاثة أنواع فقال تعالى: \"فمنهم ظالم لنفسه\" وهو المفرط في فعل بعض الواجبات المرتكب لبعض المحرمات \"ومنهم مقتصد\" هو المؤدي للواجبات التارك للمحرمات وقد يترك بعض المستحبات ويفعل بعض المكروهات \"ومنهم سابق بالخيرات بإذن الله\" وهو الفاعل للواجبات والمستحبات التارك للمحرمات والمكروهات وبعض المباحات. قال علي بن أبي طلحة عن ابن عباس في قوله تعالى: \"ثم أورثنا الكتاب الذين اصطفينا من عبادنا\" قال هم أمة محمد صلى الله عليه وسلم ورثهم الله تعالى كل كتاب أنزله فظالمهم يغفر له ومقتصدهم يحاسب حسابا يسيرا وسابقهم يدخل الجنة بغير حساب وقال ابن القاسم الطبراني حدثنا يحيى بن عثمان بن صالح وعبدالرحمن بن معاوية العتبي قالا حدثنا أبو الطاهر بن السرح حدثنا موسى بن عبدالرحمن الصنعاني حدثنا ابن جريج عن عطاء عن ابن عباس عن رسول الله صلى الله عليه وسلم أنه قال ذات يوم \"شفاعتي لأهل الكبائر من أمتي\" قال ابن عباس رضي الله عنهما السابق بالخيرات يدخل الجنة بغير حساب والمقتصد يدخل الجنة برحمة الله والظالم لنفسه وأصحاب الأعراف يدخلون الجنة بشفاعة محمد صلى الله عليه وسلم وكذا روي عن غير واحد من السلف أن الظالم لنفسه من هذه الأمة من المصطفين على ما فيه من عوج وتقصير. وقال آخرون بل الظالم لنفسه ليس من هذه الأمة ولا من المصطفين الوارثين للكتاب. قال ابن أبي حاتم حدثنا أبي حدثنا علي بن هاشم بن مرزوق حدثنا ابن عيينة عن عمرو عن ابن عباس رضي الله عنهما \"فمنهم ظالم لنفسه\" قال هو الكافر وكذا روى عنه عكرمة وبه قال عكرمة أيضا فيما رواه ابن جرير وقال ابن أبي نجيع عن مجاهد فى قوله تعالى: \"فمنهم ظالم لنفسه\" قال هم أصحاب المشأمة وقال مالك عن زيد بن أسلم والحسن. وقتادة هو المنافق ثم قد قال ابن عباس والحسن وقتادة وهذه الأقسام الثلاثة كالأقسام الثلاثة المذكورة فى أول سورة الواقعة وآخرها والصحيح أن الظالم لنفسه من هذه الأمة وهذا اختيار ابن جرير كما هو ظاهر الآية وكما جاءت به الأحاديث عن رسول الله صلى الله عليه وسلم من طرق يشد بعضها بعضا ونحن إن شاء الله تعالى نورد منها ما تيسر. \"الحديث الأول\" قال الإمام أحمد حدثنا محمد بن جعفر حدثنا شعبة عن الوليد بن العيزار أنه سمع رجلا من ثقيف يحدث عن رجل من كنانة عن أبي سعيد الخدري رضي الله عنه عن النبي صلى الله عليه وسلم أنه قال في هذه الآية \"ثم أورثنا الكتاب الذين اصطفينا من عبادنا فمنهم ظالم لنفسه ومنهم مقتصد ومنهم سابق بالخيرات بإذن الله\" قال: \"هؤلاء كلهم بمنزله واحدة وكلهم في الجنة\" هذا حديث غريب من هذا الوجه وفي إسناده من لم يسم وقد رواه ابن جرير وابن أبي حاتم من حديث شعبة به نحوه ومعنى قوله بمنزلة واحدة أي في أنهم من هذه الأمة وأنهم من أهل الجنة وإن كان بينهم فرق في المنازل في الجنة \"الحديث الثاني\" قال الإمام أحمد حدثنا إسحاق بن عيسى حدثنا أنس بن عياض الليثي أبو حمزة عن موسى بن عقبة عن على بن عبدالله الأزدي عن أبي الدرداء رضي الله عنه قال سمعت رسول الله صلى الله عليه وسلم يقول \"قال الله تعالى \"ثم أورثنا الكتاب الذين اصطفينا من عبادنا فمنهم ظالم لنفسه ومنهم مقتصد ومنهم سابق بالخيرات بإذن الله\" فأما الذين سبقوا فأولئك الذين يدخلون الجنة بغير حساب وأما الذين اقتصدوا فأولئك الذين يحاسبون حسابا يسيرا وأما الذين ظلموا أنفسهم فأولئك الذين يحبسون في طول المحشر ثم هم الذين تلافاهم الله برحمته فهم الذين يقولون \"الحمد لله الذي أذهب عنا الحزن إن ربنا لغفور شكور الذي أحلنا دار المقامة من فضله لا يمسنا فيها نصب ولا يمسنا فيها لغوب\" \"طريق أخرى\" قال ابن أبي حاتم حدثنا أسيد بن عاصم ثنا الحسين بن حفص حدثنا سفيان عن الأعمش عن رجل عن أبي ثابت عن أبي الدرداء رضي الله عنه قال سمعت رسول الله صلى الله عليه وسلم يقول \"ثم أورثنا الكتاب الذي اصطفينا من عبادنا فمنهم ظالم لنفسه\"- قال - فأما الظالم لنفسه فيحبس حتى يصيبه الهم والحزن ثم يدخل الجنة\" ورواه ابن جرير من حديث سفيان الثوري عن الأعمش قال ذكر أبو ثابت أنه دخل المسجد فجلس إلى جنب أبي الدرداء رضي الله عنه فقال اللهم آنس وحشتي وارحم غربتي ويسر لي جليسا صالحا فقال أبو الدرداء رضي الله عنه لئن كنت صادقا لأنا أسعد به منك سأحدثك حديثا سمعته من رسول الله صلى الله عليه وسلم لم أحدث به منذ سمعته منه ذكر هذه الآية \"ثم أورثنا الكتاب الذين اصطفينا من عبادنا فمنهم ظالم لنفسه ومنهم مقتصد ومنهم سابق بالخيرات\" فأما السابق بالخيرات فيدخلها بغير حساب وأما المقتصد فيحاسب حسابا يسيرا وأما الظالم لنفسه فيصيبه فى ذلك المكان من الغم والحزن وذلك قوله تعالى: \"وقالوا الحمد لله الذي أذهب عنا الحزن\". \"الحديث الثالث\" قال الحافظ أبو القاسم الطبراني حدثنا عبدالله بن محمد بن العباس حدثنا ابن مسعود أخبرنا سهل بن عبدربه الرازي حدثنا عمرو بن أبي قيس عن ابن أبي ليلى عن أخيه عن عبدالرحمن بن أبي ليلى عن أسامة بن زيد رضي الله عنهما \"فمنهم ظالم لنفسه ومنهم مقتصد ومنهم سابق بالخيرات بإذن الله\" الآية قال: قال رسول الله صلى الله عليه وسلم \"كلهم من هذه الأمة\" \"الحديث الرابع\" قال ابن أبي حاتم محمد بن عزيز حدثنا سلامة عن عقيل عن ابن شهاب عن عوف بن مالك رضي الله عنه عن رسول الله صلى الله عليه وسلم أنه قال \"أمتي ثلاثة أثلات: فثلث يدخلون الجنة بغير حساب ولا عذاب وثلث يحاسبون حسابا يسيرا ثم يدخلون الجنة وثلث يمحصون ويكشفون ثم تأتي الملائكة فيقولون وجدناهم يقولون لا إله إلا الله وحده يقول الله تعالى صدقوا لا إله إلا أنا أدخلوهم الجنة بقولهم لا إله إلا الله وحده واحملوا خطاياهم على أهل النار وهي التي قال الله تعالى \"وليحملن أثقالهم وأثقالا مع أثقالهم\" وتصديقها في التي فيها ذكر الملائكة قال الله تعالى: \"ثم أورثنا الكتاب الذين اصطفينا من عبادنا\" فجعلهم ثلاثة أفواج وهم أصناف كلهم فمنهم ظالم لنفسه فهذا الذي يمحص ويكشف\" غريب جدا \"أثر عن ابن مسعود\" رضي الله عنه قال ابن جرير حدثني ابن حميد حدثنا الحكم بن بشير عن عمرو بن قيس عن عبدالله بن عيسى رضي الله عنه عن يزيد بن الحارث عن شقيق أبي وائل عن عبدالله بن مسعود رضي الله عنه قال: إن هذه الأمة ثلاث أثلاث يوم القيامة ثلث يدخلون الجنة بغير حساب وثلث يحاسبون حسابا يسيرا وثلث يجيئون بذنوب عظام حتى يقول الله عز وجل ما هؤلاء؟ وهو أعلم تبارك وتعالى فتقول الملائكة هؤلاء جاءوا بذنوب عظام إلا أنهم لم يشركوا بك شيئا فيقول الرب عز وجل أدخلوا هؤلاء في سعة رحمتي. وتلا عبدالله رضي الله عنه هذه الآية \"ثم أورثنا الكتاب الذين اصطفينا من عبادنا\" الآية \"أثر آخر\" قال أبو داود الطيالسي عن الصلت بن دينار بن الأشعث عن عقبة بن صهبان الهنائي قال سألت عائشة رضي الله عنها عن قول الله تعالى \"ثم أورثنا الكتاب الذين اصفينا من عبادنا فمنهم ظالم لنفسه\" الآية فقالت لي يا بني هؤلاء في الجنة أما السابق بالخيرات فمن مضى على عهد رسول الله صلى الله عليه وسلم شهد له رسول الله صلى الله عليه وسلم بالحياة والرزق وأما المقتصد فمن اتبع أثره من أصحابه حتى لحق به وأما الظالم لنفسه فمثلي ومثلكم قال فجعلت نفسها رضي الله عنها معنا وهذا منها رضي الله عنها من باب الهضم والتواضع وإلا فهي من أكبر السابقين بالخيرات لأن فضلها على النساء كفضل الثريد على سائر الطعام وقال عبدالله بن المبارك رحمه الله قال أمير المؤمنين عثمان بن عفان رضي الله عنه في قوله تبارك وتعالى \"فمنهم ظالم لنفسه\" قال: هي لأهل بدونا ومقتصدنا أهل حضرنا وسابقنا أهل الجهاد رواه ابن أبي حاتم. وقال عوف الأعرابي حدثنا عبدالله بن الحارث بن نوفل قال حدثنا كعب الأحبار رحمة الله عليه قال: إن الظالم لنفسه من هذه الأمة والمقتصد والسابق بالخيرات كلهم في الجنة ألم تر أن الله تعالى قال \"ثم أورثنا الكتاب الذين اصطفينا من عبادنا فمنهم ظالم لنفسه ومنهم مقتصد ومنهم سابق بالخيرات بإذن الله ذلك هو الفضل الكبير جنات عدن يدخلونها - إلى قوله عز وجل - والذين كفروا لهم نار جهنم\" قال فهؤلاء أهل النار رواه ابن جرير من طرق عن عوف به. ثم قال حدثني يعقوب بن إبراهيم حدثنا ابن علية أخبرنا حميد عن إسحاق بن عبدالله بن الحارث عن أبيه قال إن ابن عباس رضي الله عنهما سأل كعبا عن قوله تعالى: \"ثم أورثنا الكتاب الذين اصطفينا من عبادنا - إلى قوله - بإذن الله\" قال تماست مناكبهم ورب كعب ثم أعطوا الفضل بأعمالهم ثم قال ابن جرير حدثنا ابن حميد حدثنا الحكم بن بشير حدثنا عمرو بن قيس عن أبي إسحاق السبيعي في هذه الآية \"ثم أورثنا الكتاب الذين اصطفينا من عبادنا\" الآية قال أبو إسحاق أما ما سمعت من ذي ستين سنة فكلهم ناج ثم قال حدثنا ابن حميد حدثنا الحكم حدثنا عمرو عن محمد بن الحنفية رضي الله عنه قال إنها أمة مرحومة الظالم مغفور له والمقتصد في الجنان عند الله والسابق بالخيرات في الدرجات عند الله. ورواه الثوري عن إسماعيل بن سميع عن رجل عن محمد بن الحنفية رضي الله عنه بنحوه. وقال أبو الجارود: سألت محمد بن علي - يعني الباقر- رضي الله عنهما عن قول الله تعالى \"فمنهم ظالم لنفسه\" فقال هو الذي خلط عملا صالحا وآخر سيئا. فهذا ما تيسر من إيراد الأحاديث والآثار المتعلقة بهذا المقام. وإذا تقرر هذا فإن الآية عامة في جميع الأقسام الثلاثة في هذه الأمة فالعلماء أغبط الناس بهذه النعمة وأولى الناس بهذه الرحمة فإنهم كما قال الإمام أحمد رحمه الله حدثنا محمد بن يزيد حدثنا عاصم بن رجاء بن حيوة عن قيس بن كثير قال قدم رجل من أهل المدينة إلى أبي الدرداء رضي الله عنه وهو بدمشق فقال ما أقدمك أي أخي؟ قال حديث بلغني أنك تحدث به عن رسول الله صلى الله عليه وسلم قال أما قدمت لتجارة؟ قال لا قال أما قدمت لحاجة قال لا قال أما قدمت إلا في طلب هذا الحديث؟ قال نعم قال رضي الله عنه فإني سمعت رسول الله صلى الله عليه وسلم يقول \"من سلك طريقا يطلب فيها علما سلك الله تعالى به طريقا إلى الجنة وإن الملائكة لتضع أجنحتها رضا لطالب العلم وإنه ليستغفر للعالم من في السموات والأرض حتى الحيتان في الماء وفضل العالم على العابد كفضل القمر على سائر الكواكب إن العلماء هم ورثة الأنبياء وإن الأنبياء لم يورثوا دينارا ولا درهما وإنما ورثوا العلم فمن أخذ به أخذ بحظ وافر\" وأخرجه أبو داود والترمذي وابن ماجه من حديث كثير بن قيس ومنهم من يقول قيس بن كثير عن أبي الدرداء رضي الله عنه وقد ذكرنا طرقه واختلاف الرواة فيه في شرح كتاب العلم من صحيح البخاري ولله الحمد والمنة وقد تقدم في أول سورة طه حديث ثعلبة بن الحكم رضي الله عنه عن رسول الله صلى الله عليه وسلم قال \"يقول الله تعالى يوم القيامة للعلماء إنى لم أضع علمي وحكمتي فيكم إلا وأنا أريد أن أغفر لكم على ما كان منكم ولا أبالى\"."
    },
    {
      "ayah": 33,
      "surah": 35,
      "text": "يخبر تعالى أن هؤلاء المصطفين من عباده الذين أورثوا الكتاب المنزل من رب العالمين يوم القيامة مأواهم جنات عدن أي جنات الإقامة يدخلونها يوم معادهم وقدومهم على الله عز وجل \"يحلون فيها من أساور من ذهب ولؤلؤا\" كما ثبت في الصحيح عن أبى هريرة رضي الله عنه عن رسول الله صلى الله عليه وسلم أنه قال \"تبلغ الحلية من المؤمن حيث يبلغ الوضوء\" \"ولباسهم فيها حرير\" ولهذا كان محظورا عليهم في الدنيا فأباحه الله تعالى لهم في الآخرة وثبت في الصحيح أن رسول الله صلى الله عليه وسلم قال \"من لبس الحرير في الدنيا لم يلبسه في الآخرة\" وقال \"هي لهم في الدنيا ولكم في الآخرة\". وقال ابن أبي حاتم حدثنا عمرو بن سواد السرحي أخبرنا ابن وهب عن أبي لهيعة عن عقيل بن خالد عن الحسن عن أبي هريرة رضي الله عنه قال إن أبا أمامة رضي الله عنه حدث أن رسول الله صلى الله عليه وسلم حدثهم وذكر حلي أهل الجنة فقال \"مسورون بالذهب والفضة مكللة بالدر وعليهم أكاليل من در وياقوت متواصلة وعليهم تاج كتاج الملوك شباب جرد مرد مكحولون\"."
    },
    {
      "ayah": 34,
      "surah": 35,
      "text": "\"وقالوا الحمد لله الذي أذهب عنا الحزن\" وهو الخوف من المحذور أزاحه عنا وأراحنا مما كنا نتخوفه ونحذره من هموم الدنيا والآخرة وقال عبدالرحمن بن زيد بن أسلم عن أبيه عن ابن عمر رضي الله عنهما قال: قال رسول الله صلى الله عليه وسلم \"ليس على أهل لا إله إلا الله وحشة في قبورهم ولا في نشورهم وكأني بأهل لا إله إلا الله ينفضون التراب عن رءوسهم ويقولون الحمد لله الذي أذهب عنا الحزن\" رواه ابن أبي حاتم من حديثه. وقال الطبراني حدثنا جعفر بن محمد الفريابي حدثنا موسى بن يحيى المروزي حدثنا سليمان بن عبدالله بن وهب الكوفي عن عبدالعزيز بن حكيم عن ابن عمر رضي الله عنهما قال: قال رسول الله صلى الله عليه وسلم \"ليس على أهل لا إله إلا الله وحشة في الموت ولا في القبور ولا في النشور وكأني أنظر إليهم عند الصيحة ينفضون رؤوسهم من التراب يقولون الحمد لله الذي أذهب عنا الحزن إن ربنا لغفور شكور\" قال ابن عباس رضي الله عنهما وغيره: غفر لهم الكثير من السيئات وشكر لهم اليسير من الحسنات."
    },
    {
      "ayah": 35,
      "surah": 35,
      "text": "\"الذي أحلنا دار المقامة من فضله\" يقولون الذي أعطانا هذه المنزلة وهذا المقام من فضله ومنه ورحمته لم تكن أعمالنا تساوي ذلك كما ثبت في الصحيح أن رسول الله صلى الله عليه وسلم قال \"لن يدخل أحدا منكم عمله الجنة\" قالوا ولا أنت يا رسول الله؟ قال \"ولا أنا إلا أن يتغمدني الله تعالى برحمة منه وفضل\" \"لا يمسنا فيها نصب ولا يمسنا فيها لغوب\" أي لا يمسنا فيها عناء ولا إعياء والنصب واللغوب كل منهما يستعمل في التعب وكأن المراد بنفي هذا وهذا عنهم أنهم لا تعب على أبدانهم ولا أرواحهم والله أعلم فمن ذلك أنهم كانوا يدئبون أنفسهم في العبادة في الدنيا فسقط عنهم التكليف بدخولها وصاروا في راحة دائمة مستمرة قال الله تبارك وتعالى: \"كلوا واشربوا هنيئا بما أسلفتم في الأيام الخالية\"."
    },
    {
      "ayah": 36,
      "surah": 35,
      "text": "لما ذكر تبارك وتعالى حال السعداء شرع في بيان مآل الأشقياء فقال \"والذين كفروا لهم نار جهنم لا يقضى عليهم فيموتوا\" كما قال تعالى: \"لا يموت فيها ولا يحيى\" وثبت في صحيح مسلم أن رسول الله صلى الله عليه وسلم قال \"أما أهل النار الذين هم أهلها فلا يموتون فيها ولا يحيون\" وقال عز وجل \"ونادوا يا مالك ليقض علينا ربك قال إنكم ماكثون\" فهم في حالهم ذلك يرون موتهم راحة لهم ولكن لا سبيل إلى ذلك قال الله تعالى: \"لا يقضى عليهم فيموتوا ولا يخفف عنهم من عذابها\" كما قال عز وجل \"إن المجرمين في عذاب جهنم خالدون لا يفتر عنهم وهم فيه مبلسون\" وقال جل وعلا \"كلما خبت زدناهم سعيرا\" \"فذوقوا فلن نزيدكم إلا عذابا\" ثم قال تعالى: \"كذلك نجزي كل كفور\" أي هذا جزاء كل من كفر بربه وكذب الحق."
    },
    {
      "ayah": 37,
      "surah": 35,
      "text": "وقوله جلت عظمته \"وهم يصطرخون فيها\" أي ينادون فيها يجأرون إلى الله عز وجل بأصواتهم \"ربنا أخرجنا نعمل صالحا غير الذي كنا نعمل\" أي يسألون الرجعة إلى الدنيا ليعملوا غير عملهم الأول وقد علم الرب جل جلاله أنه لو ردهم إلى الدار الدنيا لعادوا لما نهوا عنه وإنهم لكاذبون فلهذا لا يجيبهم إلى سؤالهم كما قال تعالى مخبرا عنهم في قولهم \"فهل إلى مرد من سبيل ذلكم بأنه إذا دعي الله وحده كفرتم وإن يشرك به تؤمنوا\" أي لا يجيبكم إلى ذلك لأنكم كنتم كذلك ولو رددتم لعدتم إلى ما نهيتم عنه ولذا قال ههنا \"أو لم نعمركم ما يتذكر فيه من تذكر وجاءكم النذير\" أي أو ما عشتم في الدنيا أعمارا لو كنتم ممن ينتفع بالحق لانتفعتم به في مدة عمركم؟ وقد اختلف المفسرون في مقدار العمر المراد ههنا فروي عن علي بن الحسين زين العابدين رضي الله عنهما أنه قال مقدار سبع عشر سنة. وقال قتادة: اعلموا أن طول العمر حجة فنعوذ بالله أن نعير بطول العمر قد نزلت هذه الآية \"أو لم نعمركم ما يتذكر فيه من تذكر\" وإن فيهم لابن ثماني عشرة سنة وكذا قال أبو غالب الشيباني. وقال عبدالله بن المبارك عن معمر عن رجل عن وهب بن منبه في قوله تعالى: \"أو لم نعمركم ما يتذكر فيه من تذكر\" قال عشرين سنة. وقال هشيم عن منصور عن زاذان عن الحسن في قوله تعالى: \"أو لم نعمركم ما يتذكر فيه من تذكر\" قال أربعين سنة وقال هشيم أيضا عن مجالد عن الشعبي عن مسروق أنه كان يقول: إذا بلغ أحدكم أربعين سنة فليأخذ حذره من الله عز وجل وهذه رواية عن ابن عباس رضي الله عنهما فيما قال ابن جرير حدثنا ابن عبدالأعلى حدثنا بشر بن المفضل حدثنا عبدالله بن عثمان بن خثيم عن مجاهد قال سمعت ابن عباس رضي الله عنهما يقول: العمر الذي أعذر الله تعالى لابن آدم \"أو لم نعمركم ما يتذكر فيه من تذكر\" أربعون سنة. هكذا رواه من هذا الوجه عن ابن عباس رضي الله عنهما به وهذا القول هو اختيار ابن جرير; ثم رواه من طريق الثوري وعبدالله بن إدريس كلاهما عن عبدالله بن عثمان بن خثيم عن مجاهد عن ابن عباس رضي الله عنهما قال العمر الذي أعذر الله فيه لابن آدم في قوله \"أو لم نعمركم ما يتذكر فيه من تذكر\" ستون سنة فهذه الرواية أصح عن ابن عباس رضي الله عنهما وهي الصحيحة في نفس الأمر أيضا لما ثبت في ذلك من الحديث كما سنورده لا كما زعمه ابن جرير من أن الحديث لم يصح في ذلك لأن في إسناده من يجب التثبت في أمره وقد روى أصبغ بن نباتة عن علي رضي الله عنه أنه قال: العمر الذي عيرهم الله به فى قوله \"أو لم نعمركم ما يتذكر فيه من تذكر\" ستون سنة. وقال ابن أبي حاتم حدثنا أبي حدثنا دحيم حدثنا ابن أبي فديك حدثني إبراهيم بن الفضل المخزومي عن ابن أبي حسين المكي أنه حدثه عن عطاء هو ابن أبي رباح عن ابن عباس رضي الله عنهما أن النبي صلى الله عليه وسلم قال \"إذا كان يوم القيامة قيل أين أبناء الستين وهو العمر الذي قال الله تعالى فيه \"أو لم نعمركم ما يتذكر فيه من تذكر وجاءكم النذير\" وكذا رواه ابن جرير عن علي بن شعيب عن إسماعيل بن أبي فديك به وكذا رواه الطبراني من طريق ابن أبي فديك به وهذا الحديث فيه نظر لحال إبراهيم بن الفضل والله أعلم \"حديث آخر\" قال الإمام أحمد حدثنا عبدالرزاق حدثنا معمر عن رجل من بني غفار عن سعيد المقبري عن أبي هريرة رضي الله عنه عن النبي صلى الله عليه وسلم أنه قال \"لقد أعذر الله تعالى إلى عبد أحياه حتى بلغ ستين أو سبعين سنة لقد أعذر الله تعالى إليه لقد أعذر الله تعالى إليه\" وهكذا رواه الإمام البخاري في كتاب الرقاق من صحيحه حدثنا عبدالسلام بن مطهر عن عمر بن علي عن معن بن محمد الغفاري عن سعيد المقبري عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم \"أعذر الله عز وجل إلى امرئ أخر عمره حتى بلغ ستين سنة\" ثم قال البخاري تابعه أبو حازم وابن عجلان عن سعيد المقبري عن أبي هريرة رضي الله عنه عن النبي صلى الله عليه وسلم فأما أبو حازم فقال ابن جرير حدثنا أبو صالح الفزاري حدثنا محمد بن سوار أخبرنا يعقوب بن عبدالرحمن بن عبدالقادر أي الإسكندري حدثنا أبو حازم عن سعيد المقبري عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم \"من عمره الله تعالى ستين سنة فقد أعذر إليه في العمر\" وقد رواه الإمام أحمد والنسائي في الرقاق جميعا عن قتيبة عن يعقوب بن عبدالرحمن به ورواه البزار قال: حدثنا هشام بن يونس حدثنا عبدالعزيز بن أبي حازم عن أبيه عن سعيد المقبري عن أبي هريرة رضي الله عنه عن النبي صلى الله عليه وسلم قال: \"العمر الذي أعذر الله تعالى فيه إلى ابن آدم ستون سنة\" يعني \"أو لم نعمركم ما يتذكر فيه من تذكر\". وأما متابعة ابن عجلان فقال ابن أبي حاتم حدثنا أبو السفر يحيى بن محمد بن عبدالملك بن قرعة بسامرا حدثنا أبو عبدالرحمن المقري حدثنا سعيد بن أبي أيوب حدثنا محمد بن عجلان عن سعيد المقبري عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم \"من أتت عليه ستون سنة فقد أعذر الله عز وجل إليه في العمر\" وكذا رواه الإمام أحمد عن أبي عبدالرحمن هو المقري به ورواه أحمد أيضا عن خلف عن أبي معشر عن أبي سعيد المقبري. \"طريق أخرى\" عن أبي هريرة رضي الله عنه قال ابن جرير حدثني أحمد بن الفرج أبو عتبة الحمصي حدثنا بقية بن الوليد حدثنا المطرف بن مازن الكناني حدثني معمر بن راشد قال: سمعت محمد بن عبدالرحمن الغفاري يقول: سمعت أبا هريرة رضي الله عنه يقول: قال رسول الله صلى الله عليه وسلم \"لقد أعذر الله عز وجل في العمر إلى صاحب الستين سنة والسبعين\" فقد صح هذا الحديث من هذه الطرق فلو لم يكن إلا الطريق التي ارتضاها أبو عبدالله البخاري شيخ هذه الصناعة لكفت. وقول ابن جرير إن في رجاله بعض من يجب التثبت في أمره لا يلتفت إليه مع تصحيح البخاري والله أعلم. وذكر بعضهم أن العمر الطبيعي عند الأطباء مائة وعشرون سنة فالإنسان لا يزال في ازدياد إلى كمال الستين ثم يشرع بعد هذا في النقص والهرم كما قال الشعر: إذا بلغ الفتى ستين عاما فقد ذهب المسرة والفتاء ولما كان هذا هو العمر الذي يعذر الله تعالى إلى عباده به ويزيح به عنهم العلل كان هو الغالب على أعمار هذه الأمة كما ورد بذلك الحديث قال الحسن بن عرفة رحمه الله حدثنا عبدالرحمن بن محمد المحاربي حدثنا محمد بن عمرو عن أبي سلمة عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم \"أعمار أمتي ما بين الستين إلى السبعين وأقلهم من يجوز ذلك\" وهكذا رواه الترمذي وابن ماجة جميعا في كتاب الزهد عن الحسن بن عرفة به ثم قال الترمذي هذا حديث غريب لا نعرفه إلا من هذا الوجه. وهذا عجب من الترمذي فإنه قد رواه أبو بكر بن أبي الدنيا من وجه آخر وطريق أخرى عن أبي هريرة حيث قال حدثنا سليمان بن عمرو عن محمد بن ربيعة عن كامل أبي العلاء عن أبي صالح عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم \"أعمار أمتي ما بين الستين إلى السبعين وأقلهم من يجوز ذلك\" وقد رواه الترمذي في كتاب الزهد أيضا عن إبراهيم بن سعيد الجوهري عن محمد بن ربيعة به ثم قال هذا حديث حسن غريب من حديث أبي صالح عن أبى هريرة رضي الله عنه وقد روى من غير وجه عنه هذا نصه بحروفه في الموضعين والله أعلم. وقال الحافظ أبو يعلى حدثنا أبو موسى الأنصاري حدثنا ابن أبي فديك حدثني إبراهيم بن الفضل مولى بني مخزوم عن المقبري عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم \"معترك المنايا ما بين الستين إلى السبعين\" وبه قال: قال رسول الله صلى الله عليه وسلم \"أقل أمتي أبناء سبعين\" إسناده ضعيف \"حديث آخر\" في معنى ذلك قال الحافظ أبو بكر البزار في مسنده حديثا إبراهيم بن هانئ حدثنا إبراهيم بن مهدي عن عثمان بن مطر عن أبي مالك عن ربعي عن حذيفة رضي الله عنه أنه قال يا رسول الله أنبئنا بأعمار أمتك قال رسول الله صلى الله عليه وسلم \"ما بين الخمسين إلى الستين\" قالوا يا رسول الله فأبناء السبعين قال صلى الله عليه وسلم \"قل من يبلغها من أمتي رحم الله أبناء السبعين ورحم الله أبناء الثمانين\" ثم قال البزار لا يروى بهذا اللفظ إلا بهذا الإسناد وعثمان بن مطر من أهل البصرة ليس بقوي وقد ثبت في الصحيح أن رسول الله صلى الله عليه وسلم عاش ثلاثا وستين سنة وقيل ستين وقيل خمسا وستين والمشهور الأول والله أعلم وقوله تعالى: \"وجاءكم النذير\" روي عن ابن عباس رضي الله عنهما وعكرمة وأبى جعفر الباقر رضي الله عنه وقتادة وسفيان بن عيينة أنهم قالوا يعني الشيب وقال السدي وعبد الرحمن بن زيد بن أسلم يعني به رسول الله صلى الله عليه وسلم وقرأ ابن زيد \"هذا نذير من النذر الأولى\" وهذا هو الصحيح عن قتادة فيما رواه شيبان عنه أنه قال: احتج عليهم بالعمر والرسل وهذا اختيار ابن جرير وهو الأظهر لقوله تعالى: \"ونادوا يا مالك ليقض علينا ربك قال إنكم ماكثون لقد جئناكم بالحق ولكن أكثركم للحق كارهون\" أى لقد بينا لكم الحق على ألسنة الرسل فأبيتم وخالفتم وقال تعالى: \"وما كنا معذبين حتى نبعث رسولا\" وقال تبارك وتعالى \"كلما ألقي فيها فوج سألهم خزنتها ألم يأتكم نذير قالوا بلى قد جاءنا نذير فكذبنا وقلنا ما نزل الله من شيء إن أنتم إلا في ضلال كبير\" وقوله تعالى: \"فذوقوا فما للظالمين من نصير\" أي فذوقوا عذاب النار جزاء على مخالفتكم للأنبياء في مدة أعماركم فما لكم اليوم ناصر ينقذكم مما أنتم فيه من العذاب والنكال والأغلال."
    },
    {
      "ayah": 38,
      "surah": 35,
      "text": "يخبر تعالى بعلمه غيب السموات والأرض وأنه يعلم ما تكنه السرائر وما تنطوي عليه الضمائر وسيجازي كل عامل بعمله."
    },
    {
      "ayah": 39,
      "surah": 35,
      "text": "ثم قال عز وجل \"هو الذي جعلكم خلائف في الأرض\" أي يخلف قوم لآخرين قبلهم وجيل لجيل قبلهم. كما قال تعالى: \"ويجعلكم خلفاء الأرض\" \"فمن كفر فعليه كفره\" أي فإنما يعود وبال ذلك على نفسه دون غيره \"ولا يزيد الكافرين كفرهم عند ربهم إلا مقتا\" أي كلما استمروا على كفرهم أبغضهم الله تعالى وكلما استمروا فيه خسروا أنفسهم وأهليهم يوم القيامة بخلاف المؤمنين فإنهم كلما طال عمر أحدهم وحسن عمله ارتفعت درجته ومنزلته في الجنة وزاد أجره وأحبه خالقه وبارئه رب العالمين."
    },
    {
      "ayah": 4,
      "surah": 35,
      "text": "يقول تبارك وتعالى وإن يكذبوك يا محمد هؤلاء المشركون بالله ويخالفوك فيما جئتهم به من التوحيد فلك فيمن سلف قبلك من الرسل أسوة فإنهم كذلك جاءوا قومهم بالبينات وأمروهم بالتوحيد فكذبوهم وخالفوهم \"وإلى الله ترجع الأمور\" أي وسنجزيهم على ذلك أوفر الجزاء."
    },
    {
      "ayah": 40,
      "surah": 35,
      "text": "يقول تعالى لرسوله صلى الله عليه وسلم أن يقول للمشركين \"أرأيتم شركاءكم الذين تدعون من دون الله\" أي من الأصنام والأنداد \"أروني ماذا خلقوا من الأرض أم لهم شرك في السموات\" أي ليس لهم شيء من ذلك ما يملكون من قطمير وقوله \"أم آتيناهم كتابا فهم على بينة منه\" أي أم أنزلنا عليهم كتابا بما يقولونه من الشرك والكفر؟ ليس الأمر كذلك \"بل إن يعد الظالمون بعضهم بعضا إلا غرورا\" أي بل إنما اتبعوا في ذلك أهواءهم وآراءهم وأمانيهم التي تمنوها لأنفسهم وهي غرور وباطل وزور."
    },
    {
      "ayah": 41,
      "surah": 35,
      "text": "ثم أخبر تعالى عن قدرته العظيمة التي بها تقوم السماء والأرض عن أمره وما جعل فيهما من القوة الماسكة لهما فقال \"إن الله يمسك السموات والأرض أن تزولا\" أي أن تضطربا عن أماكنهما كما قال عز وجل \"ويمسك السماء أن تقع على الأرض إلا بإذنه\" وقال تعالى: \"ومن آياته أن تقوم السماء والأرض بأمره\" \"ولئن زالتا إن أمسكهما من أحد من بعده\" أي لا يقدر على دوامهما وإبقائهما إلا هو وهو مع ذلك حليم غفور أن يرى عباده وهم يكفرون به ويعصونه وهو يحلم فيؤخر وينظر ويؤجل ولا يعجل ويستر آخرين ويغفر ولهذا قال تعالى: \"إنه كان حليما غفورا\". وقد أورد ابن أبى حاتم ههنا حديثا غريبا بل منكرا فقال حدثنا علي بن الحسين بن الجنيد حدثنا إسحاق بن إبراهيم حدثني هشام بن يوسف عن أمية بن سهل عن الحكم بن أبان عن عكرمة عن أبي هريرة رضي الله عنه قال: سمعت رسول الله صلى الله عليه وسلم يحكي عن موسى عليه الصلاة والسلام على المنبر قال: \"وقع في نفس موسى عليه الصلاة والسلام هل ينام الله عز وجل فأرسل الله تعالى إليه ملكا فأرقه ثلاثا وأعطاه قارورتين فى كل يد قارورة وأمره أن يحتفظ بهما قال فجعل ينام وتكاد يداه تلتقيان ثم يستيقظ فيجلس إحداهما عن الأخرى حتى نام نومه فاصطفقت يداه فانكسرت القارورتان قال ضرب الله له مثلا إن الله عز وجل لو كان ينام لم تستمسك السماء والأرض\" والظاهر أن هذا الحديث ليس بمرفوع بل من الإسرائيليات المنكرة فإن موسى عليه الصلاة والسلام أجل من أن يجوز على الله سبحانه وتعالى النوم وقد أخبر الله عز وجل في كتابه العزيز بأنه \"الحي القيوم لا تأخذه سنة ولا نوم له ما في السموات وما في الأرض\" وثبت فى الصحيحين عن أبي موسى الأشعري رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم \"إن الله تعالى لا ينام ولا ينبغي له أن ينام يخفض القسط ويرفعه ويرفع إليه عمل الليل قبل النهار وعمل النهار قبل الليل حجابه النور أو النار لو كشفه لأحرقت سبحات وجهه ما انتهى إليه بصره من خلقه\" وقد قال أبو جعفر بن جرير حدثنا ابن بشار حدثنا عبدالرحمن حدثنا سفيان عن الأعمش عن أبي وائل قال: جاء رجل إلى عبدالله هو ابن مسعود رضي الله عنه فقال من أين جئت؟ قال من الشام قال من لقيت؟ قال لقيت كعبا قال ما حدثك؟ قال حدثني أن السموات تدور على منكب ملك قال أفصدقته أو كذبته؟ قال ما صدقته ولا كذبته قال لوددت أنك افتديت من رحلتك إليه براحلتك ورحلها كذب كعب إن الله تعالى يقول \"إن الله يمسك السموات والأرض أن تزولا ولئن زالتا إن أمسكهما من أحد من بعده\" وهذا إسناد صحيح إلى كعب وإلى ابن مسعود رضي الله عنه ثم رواه ابن جرير عن ابن حميد عن جرير عن مغيرة عن إبراهيم قال ذهب جندب البجلي إلى كعب بالشام فذكر نحوه. وقد رأيت في مصنف للفقيه يحيى بن إبراهيم بن مزين الطليطلي سماه - سير الفقهاء - أورد هذا الأثر عن محمد بن عيسى بن الطباع عن وكيع عن الأعمش به ثم قال وأخبرنا زونان يعني عبد الملك بن الحسين عن ابن وهب عن مالك أنه قال السماء لا تدور واحتج بهذه الآية وبحديث \"إن بالمغرب بابا للتوبة لا يزال مفتوحا حتى تطلع الشمس منه\" قلت وهذا الحديث في الصحيح والله سبحانه وتعالى أعلم."
    },
    {
      "ayah": 42,
      "surah": 35,
      "text": "يخبر تعالى عن قريش والعرب أنهم أقسموا بالله جهد أيمانهم قبل إرسال الرسول إليهم لئن جاءهم نذير ليكونن أهدى من إحدى الأمم أى من جميع الأمم الذين أرسل إليهم الرسل قاله الضحاك وغيره كقوله تعالى: \"أن تقولوا إنما أنزل الكتاب على طائفة من قبلنا وإن كنا عن دراستهم لغافلين أو تقولوا لو أنا أنزل علينا الكتاب لكنا أهدى منهم فقد جاءكم بينة من ربكم وهدى ورحمة فمن أظلم ممن كذب بآيات الله وصدف عنها\" وكقوله تعالى: \"وإن كانوا ليقولون لو أن عندنا ذكرا من الأولين لكنا عباد الله المخلصين فكفروا به فسوف يعلمون\" قال الله تعالى: \"فلما جاءهم نذير\" وهو محمد صلى الله عليه وسلم بما أنزل معه من الكتاب العظيم وهو القرآن المبين \"ما زادهم إلا نفورا\" أي ما ازدادوا إلا كفرا إلى كفرهم."
    },
    {
      "ayah": 43,
      "surah": 35,
      "text": "ثم بين ذلك بقوله \"استكبارا في الأرض\" أي استكبروا عن اتباع آيات الله \"ومكر السيء\" أي ومكروا بالناس في صدهم إياهم عن سبيل الله \"ولا يحيق المكر السيء إلا بأهله\" أي وما يعود وبال ذلك إلا عليهم أنفسهم دون غيرهم. قال ابن أبي حاتم ذكر علي بن الحسين حدثنا ابن أبي عمر حدثنا سفيان عن أبي زكريا الكوفي عن رجل حدثه أن رسول الله صلى الله عليه وسلم قال \"إياك ومكر السيء فإنه لا يحيق المكر السيء إلا بأهله ولهم من الله طالب\" وقال محمد بن كعب القرظي ثلاث من فعلهن لم ينج حتى ينزل به من مكر أو بغي أو نكث وتصديقها في كتاب الله تعالى \"ولا يحيق المكر السيء إلا بأهله\" \"إنما بغيكم على أنفسكم\" \"ومن نكث فإنما ينكث على نفسه\" وقوله عز وجل \"فهل ينظرون إلا سنة الأولين\" يعني عقوبة الله لهم على تكذيبهم رسله ومخالفتهم أمره \"ولن تجد لسنة الله تبديلا\" أي لا تغير ولا تبدل بل هي جارية كذلك في كل مكذب \"ولن تجد لسنة الله تحويلا\" أي \"وإذا أراد الله بقوم سوءا فلا مرد له\" ولا يكشف ذلك عنهم ويحوله عنهم أحد والله أعلم."
    },
    {
      "ayah": 44,
      "surah": 35,
      "text": "يقول تعالى قل يا محمد لهؤلاء المكذبين بما جئتهم به من الرسالة سيروا في الأرض فانظروا كيف كان عاقبة الذين كذبوا الرسل كيف دمر الله عليهم وللكافرين أمثالها فخلت منهم منازلهم وسلبوا ما كانوا فيه من النعيم بعد كمال القوة وكثرة العدد والعدة وكثرة الأموال والأولاد فما أغنى ذلك شيئا ولا دفع عنهم من عذاب الله من شيء لما جاء أمر ربك لأنه تعالى لا يعجزه شيء إذا أراد كونه في السموات والأرض \"إنه كان عليما قديرا\" أي عليم بجميع الكائنات قدير على مجموعها."
    },
    {
      "ayah": 45,
      "surah": 35,
      "text": "ثم قال تعالى: \"ولو يؤاخذ الله الناس بما كسبوا ما ترك على ظهرها من دابة\" أي لو آخذهم بجميع ذنوبهم لأهلك جميع أهل السموات والأرض وما يملكونه من دواب وأرزاق. قال ابن أبي حاتم حدثنا أحمد بن سنان حدثنا عبدالرحمن حدثنا سفيان الثوري عن أبي إسحاق عن أبي الأحوص عن عبدالله قال: كاد الجعل أن يعذب في جحره بذنب ابن آدم ثم قرأ \"ولو يؤاخذ الله الناس بما كسبوا ما ترك على ظهرها من دابة\" وقال سعيد بن جبير والسدي في قوله تعالى: \"ما ترك على ظهرها من دابة\" أى لما سقاهم المطر فماتت جميع الدواب \"ولكن يؤخرهم إلى أجل مسمى\" أي ولكن ينظرهم إلى يوم القيامة فيحاسبهم يومئذ ويوفي كل عامل بعمله فيجازي بالثواب أهل الطاعة وبالعقاب أهل المعصية. ولهذا قال تبارك وتعالى \"فإذا جاء أجلهم فإن الله كان بعباده بصيرا\". آخر تفسير سورة فاطر ولله الحمد والمنة."
    },
    {
      "ayah": 5,
      "surah": 35,
      "text": "ثم قال تعالى: \"يا أيها الناس إن وعد الله حق\" أي المعاد كائن لا محالة \"فلا تغرنكم الحياة الدنيا\" أي العيشة الدنيئة بالنسبة إلى ما أعد الله لأوليائه وأتباع رسله من الخير العظيم فلا تتلهوا عن ذلك الباقي بهذه الزهرة الفانية \"ولا يغرنكم بالله الغرور\" وهو الشيطان قاله ابن عباس رضي الله عنهما أي لا يفتنكم الشيطان ويصرفنكم عن اتباع رسل الله وتصديق كلماته فإنه غرار كذاب أفاك وهذه الآية كالآية التي في آخر لقمان \"فلا تغرنكم الحياة الدنيا ولا يغرنكم بالله الغرور\" وقال مالك عن زيد بن أسلم هو الشيطان كما قال المؤمنون للمنافقين يوم القيامة حين يضرب \"بينهم بسور له باب باطنه فيه الرحمة وظاهره من قبله العذاب ينادونهم ألم نكن معكم قالوا بلى ولكنكم فتنتم أنفسكم وتربصتم وارتبتم وغرتكم الأماني حتى جاء أمر الله وغركم بالله الغرور\"."
    },
    {
      "ayah": 6,
      "surah": 35,
      "text": "ثم بين تعالى عداوة إبليس لابن آدم فقال \"إن الشيطان لكم عدو فاتخذوه عدوا\" أي هو مبارز لكم بالعداوة فعادوه أنتم أشد العداوة وخالفوه وكذبوه فيما يغركم به \"إنما يدعو حزبه ليكونوا من أصحاب السعير\" أي إنما يقصد أن يضلكم حتى تدخلوا معه إلى عذاب السعير فهذا هو العدو المبين نسأل الله القوي العزيز أن يجعلنا أعداء الشيطان وأن يرزقنا اتباع كتابه والاقتفاء بطريق رسوله إنه على ما يشاء قدير وبالإجابة جدير وهذه كقوله تعالى: \"وإذ قلنا للملائكة اسجدوا لآدم فسجدوا إلا إبليس كان من الجن ففسق عن أمر ربه أفتتخذونه وذريته أولياء من دوني وهم لكم عدو بئس للظالمين بدلا\"."
    },
    {
      "ayah": 7,
      "surah": 35,
      "text": "لما ذكر تعالى أن أتباع إبليس مصيرهم إلى السعير ذكر بعد ذلك أن الذين كفروا لهم عذاب شديد لأنهم أطاعوا الشيطان وعصوا الرحمن وأن الذين آمنوا بالله ورسله \"وعملوا الصالحات لهم مغفرة\" أي لما كان منهم من ذنب \"وأجر كبير\" على ما عملوه من خير."
    },
    {
      "ayah": 8,
      "surah": 35,
      "text": "ثم قال تعالى: \"أفمن زين له سوء عمله فرآه حسنا\" يعني كالكفار والفجار يعملون أعمالا سيئة وهم في ذلك يعتقدون ويحسبون أنهم يحسنون صنعا أي أفمن كان هكذا قد أضله الله ألك فيه حيلة؟ لا حيلة لك فيه \"فإن الله يضل من يشاء ويهدي من يشاء\" أي بقدره كان ذلك \"فلا تذهب نفسك عليهم حسرات\" أي لا تأسف على ذلك فإن الله حكيم في قدره إنما يضل من يضل ويهدي من يهدي لماله في ذلك من الحجة البالغة والعلم التام ولهذا قال تعالى: \"إن الله عليم بما يصنعون\". وقال ابن أبي حاتم عند هذه الآية حدثنا أبي حدثنا محمد بن عوف الحمصي حدثنا محمد بن كثير عن الأوزاعي عن يحيى بن أبي عمرو الشيباني أو ربيعة عن عبدالله بن الديلمي قال: أتيت عبدالله بن عمرو رضي الله عنهما وهو في حائط بالطائف يقال له الوهط قال سمعت رسول الله صلى الله عليه وسلم يقول \"إن الله تعالى خلق خلقه في ظلمة ثم ألقى عليهم من نوره فمن أصابه من نوره يومئذ فقد اهتدى ومن أخطأه منه ضل فلذلك أقول جف القلم على ما علم الله عز وجل ثم قال حدثنا محمد بن عبدة القزويني حدثنا حسان بن حسان البصري حدثنا إبراهيم بن بشر حدثنا يحيى بن معين حدثنا إبراهيم القرشي عن سعيد بن شرحبيل عن زيد بن أبي أوفى رضي الله عنه قال خرج علينا رسول الله صلى الله عليه وسلم فقال \"الحمد لله الذي يهدي من الضلالة ويلبس الضلالة على من أحب\" وهذا أيضا حديث غريب جدا."
    },
    {
      "ayah": 9,
      "surah": 35,
      "text": "كثيرا ما يستدل تعالى على المعاد بإحيائه الأرض بعد موتها كما في أول سورة الحج ينبه عباده أن يعتبروا بهذا على ذلك فإن الأرض تكون ميتة هامدة لا نبات فيها فإذا أرسل إليها السحاب تحمل الماء وأنزله عليها \"اهتزت وربت وأنبتت من كل زوج بهيج\" كذلك الأجساد إذا أراد الله تعالى بعثها ونشورها أنزل من تحت العرش مطرا يعم الأرض جميعا ونبتت الأجساد في قبورها كما تنبت الحبة في الأرض ولهذا جاء في الصحيح \"كل ابن آدم يبلى إلا عجب الذنب منه خلق ومنه يركب\" ولهذا قال تعالى: \"كذلك النشور\" وتقدم في الحج حديث أبى رزين قلت يا رسول الله كيف يحيي الله الموتى؟ وما آية ذلك في خلقه؟ قال صلى الله عليه وسلم \"يا أبا رزين أما مررت بوادي قومك ممحلا ثم مررت به يهتز خضرا؟\" قلت بلى قال صلى الله عليه وسلم \"فكذلك يحيي الله الموتى\"."
    }
  ]
}
