{
  "ayahs": [
    {
      "ayah": 1,
      "surah": 36,
      "text": "سورة يس: قال أبو عيسى الترمذي حدثنا قتيبة وسفيان بن وكيع حدثنا حميد بن عبدالرحمن الرواسي عن الحسن بن صالح عن هارون أبي محمد عن مقاتل بن حيان عن قتادة عن أنس رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم:\"إن لكل شيء قلبا وقلب القرآن يس ومن قرأ يس كتب الله له بقراءتها قراءة القرآن عشر مرات\" ثم قال هذا حديث غريب لا نعرفه إلا من حديث حميد بن عبدالرحمن وهارون أبو محمد شيخ مجهول. وفي الباب عن أبي بكر الصديق رضي الله عنه ولا يصح لضعف إسناده وعن أبي هريرة رضي الله عنه منظور فيه. أما حديث الصديق رضي الله عنه فرواه الحكيم الترمذي في كتابه نوادر الأصول. وأما حديث أبي هريرة رضي الله عنه فقال أبو بكر البزار حدثنا عبدالرحمن بن الفضل حدثنا زيد هو ابن الحباب حدثنا حميد هو المكي مولى آل علقمة عن عطاء بن أبي رباح عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: \"إن لكل شيء قلبا وقلب القرآن يس\" ثم قال لا نعلم رواه إلا زيد عن حميد. وقال الحافظ أبو يعلى حدثنا إسحاق بن أبي إسرائيل حدثنا حجاج بن محمد عن هشام بن زياد عن الحسن قال سمعت أبا هريرة رضي الله عنه يقول: قال رسول الله صلى الله عليه وسلم: \"من قرأ يس في ليلة أصبح مغفورا له ومن قرأ حم التي يذكر فيها الدخان أصبح مغفورا له\" إسناده جيد. وقال ابن حبان في صحيحه حدثنا محمد بن إسحاق بن إبراهيم مولى ثقيف حدثنا الوليد بن شجاع بن الوليد السكوني حدثنا أبي حدثنا زياد بن خيثمة حدثنا محمد بن جحادة عن الحسن عن جندب بن عبدالله رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: \"من قرأ يس في ليلة ابتغاء وجه الله عز وجل غفر له\". وقد قال الإمام أحمد حدثنا عارم حدثنا معتمر عن أبيه عن رجل عن أبيه عن معقل بن يسار رضي الله عنه قال: إن رسول الله صلى الله عليه وسلم قال: \"البقرة سنام القرآن وذروته نزل مع كل آية منها ثمانون ملكا واستخرجت \"الله لا إله إلا هو الحي القيوم\" من تحت العرش فوصلت بها - أو فوصلت بسورة البقرة - ويس قلب القرآن لا يقرؤها رجل يريد الله تعالى والدار الآخرة إلا غفر له واقرءوها على موتاكم\" وكذا رواه النسائي في اليوم والليلة عن محمد بن عبدالأعلى عن معتمر بن سليمان به. ثم قال الإمام أحمد حدثنا عارم حدثنا ابن المبارك حدثنا سليمان التيمي عن أبي عثمان وليس بالنهدي عن أبيه عن معقل بن يسار رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم \"اقرءوها على موتاكم\" يعني يس ورواه أبو داود والنسائي في اليوم والليلة وابن ماجة من حديث عبدالله بن المبارك به إلا أن في رواية النسائي عن أبي عثمان عن معقل بن يسار رضي الله عنه ولهذا قال بعض العلماء من خصائص هذه السورة أنها لا تقرأ عند أمر عسير إلا يسره الله تعالى وكأن قراءتها عند الميت لتنزل الرحمة والبركة وليسهل عليه خروج الروح والله تعالى أعلم. قال الإمام أحمد رحمه الله حدثنا أبو المغيرة حدثنا صفوان قال: كان المشيخة يقولون إذا قرئت يعني يس عند الميت خفف الله عنه بها. وقال البزار حدثنا سلمة بن شبيب حدثنا إبراهيم بن الحكم بن أبان عن أبيه عن عكرمة عن ابن عباس قال: قال النبي صلى الله عليه وسلم: \"لوددت أنها في قلب كل إنسان من أمتي\" يعني يس. قد تقدم الكلام على الحروف المقطعة في أول سورة البقرة وروي عن ابن عباس رضي الله عنهما وعكرمة والضحاك والحسن وسفيان بن عيينة أن يس بمعنى يا إنسان وقال سعيد بن جبير هو كذلك في لغة الحبشة وقال مالك عن زيد بن أسلم هو اسم من أسماء الله تعالى."
    },
    {
      "ayah": 10,
      "surah": 36,
      "text": "\"وسواء عليهم أأنذرتهم أم لم تنذرهم لا يومنون\" أي قد ختم الله عليهم بالضلالة فما يفيد فيهم الإنذار ولا يتأثرون به وقد تقدم نظيرها في أول سورة البقرة وكما قال تبارك وتعالى \"إن الذين حقت عليهم كلمة ربك لا يؤمنون ولو جاءتهم كل آية حتى يروا العذاب الأليم\"."
    },
    {
      "ayah": 11,
      "surah": 36,
      "text": "\"إنما تنذر من اتبع الذكر\" أي إنما ينتفع بإنذارك المؤمنون الذين يتبعون الذكر وهو القرآن العظيم \"وخشي الرحمن بالغيب\" أى حيث لا يراه أحد إلا الله تبارك وتعالى يعلم أن الله مطلع عليه وعالم بما يفعل \"فبشره بمغفرة\" أي لذنوبه \"وأجر كريم\" أي كثير واسع حسن جميل كما قال تبارك وتعالى \"إن الذين يخشون ربهم بالغيب لهم مغفرة وأجر كبير\"."
    },
    {
      "ayah": 12,
      "surah": 36,
      "text": "ثم قال عز وجل \"إنا نحن نحيي الموتى\" أي يوم القيامة وفيه إشارة إلى أن الله تعالى يحيي قلب من يشاء من الكفار الذين قد ماتت قلوبهم بالضلالة فيهديهم بعد ذلك إلى الحق كما قال تعالى بعد ذكر قسوة القلوب \"اعلموا أن الله يحيي الأرض بعد موتها قد بينا لكم الآيات لعلكم تعقلون\" وقوله تعالى \"ونكتب ما قدموا\" أي من الأعمال وفي قوله تعالى \"وآثارهم\" قولان \"أحدهما\" نكتب أعمالهم التي باشروها بأنفسهم وآثارهم التي آثروها من بعدهم فنجزيهم على ذلك أيضا إن خيرا فخير وإن شرا فشر كقوله صلى الله عليه وسلم: \"من سن في الإسلام سنة حسنة كان له أجرها وأجر من عمل بها من بعده من غير أن ينقص من أجورهم شيئا ومن سن في الإسلام سنة سيئة كان عليه وزرها ووزر من عمل بها من بعده من غير أن ينقص من أوزارهم شيء\" رواه مسلم من رواية شعبة عن عون بن أبي جحيفة عن المنذر بن جرير عن أبيه جرير بن عبدالله البجلي رضي الله عنه وفيه قصة مجتابي الثمار المضريين ورواه ابن أبي حاتم عن أبيه عن يحيى بن سليمان الجعفي عن أبي المحياة يحيى بن يعلى عن عبدالملك بن عمير عن جرير بن عبدالله رضي الله عنه فذكر الحديث بطوله ثم تلا هذه الآية \"ونكتب ما قدموا وآثارهم\" وقد رواه مسلم من رواية أبي عوانة عن عبدالملك بن عمير بن المنذر بن جرير عن أبيه فذكره وهكذا الحديث الآخر الذي في صحيح مسلم عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: \"إذا مات ابن آدم انقطع عمله إلا من ثلاث: من علم ينتفع به أو ولد صالح يدعو له أو صدقة جارية من بعده\" وقال سفيان الثوري عن أبي سعيد رضي الله عنه قال سمعت مجاهدا يقول في قوله تعالى \"إنا نحن نحيي الموتى ونكتب ما قدموا وآثارهم\" قال ما أورثوا من الضلالة. وقال ابن لهيعة عن عطاء بن دينار عن سعيد بن جبير في قوله تعالى \"ونكتب ما قدموا وآثارهم\" يعني ما آثروا يقول ما سنوا من سنة فعمل بها قوم من بعد موتهم فإن كانت خيرا فلهم مثل أجورهم لا ينقص من أجر من عمل به شيئا وإن كانت شرا فعليهم مثل أوزارهم ولا ينقص من أوزار من عمل بها شيئا ذكرهما ابن أبي حاتم وهذا القول هو اختيار البغوي. \"والقول الثاني\" أن المراد بذلك آثار خطاهم إلى الطاعة أو المعصية قال ابن أبي نجيح وغيره عن مجاهد \"ما قدموا\" أعمالهم \"وآثارهم\" قال خطاهم بأرجلهم وكذا قال الحسن وقتادة \"وآثارهم\" يعني خطاهم. وقال قتادة لو كان الله عز وجل مغفلا شيئا من شأنك يا ابن آدم أغفل ما تعفي الرياح من هذه الآثار ولكن أحصى على ابن آدم أثره وعمله كله حتى أحصى هذا الأثر فيما هو من طاعة الله تعالى أو من معصيته فمن استطاع منكم أن يكتب أثره في طاعة الله تعالى فليفعل. وقد وردت في هذا المعنى أحاديث \"الحديث الأول\". قال الإمام أحمد حدثنا عبدالصمد حدثنا أبي حدثنا الجريري عن أبي نضرة عن جابر بن عبدالله رضي الله عنهما قال خلت البقاع حول المسجد فأراد بنو سلمة أن ينتقلوا قرب المسجد فبلغ ذلك رسول الله صلى الله عليه وسلم فقال لهم: \"إني بلغني أنكم تريدون أن تنتقلوا قرب المسجد\" قالوا نعم يا رسول الله قد أردنا ذلك فقال صلى الله عليه وسلم: \"يا بني سلمة دياركم تكتب آثاركم دياركم تكتب آثاركم\" وهكذا رواه مسلم من حديث سعيد الجريري وكهمس بن الحسن كلاهما عن أبي نضرة واسمه المنذر بن مالك بن قطعة العبدي عن جابر رضي الله عنه به. \"الحديث الثاني\" قال ابن أبي حاتم حدثنا محمد بن الوزير الواسطي حدثنا إسحاق الأزرق عن سفيان الثوري عن أبي سفيان عن أبي نضرة عن أبي سعيد الخدري رضي الله عنه قال كانت بنو سلمة في ناحية من المدينة فأرادوا أن ينتقلوا إلى قريب من المسجد فنزلت \"إنا نحن نحيي الموتى ونكتب ما قدموا وآثارهم\" فقال لهم النبي صلى الله عليه وسلم: \"إن آثاركم تكتب\" فلم ينتقلوا تفرد بإخراجه الترمذي عند تفسير هذه الآية الكريمة عن محمد بن الوزير به ثم قال حسن غريب من حديث الثوري ورواه ابن جرير عن سليمان بن عمر بن خالد الرقي عن ابن المبارك عن سفيان الثوري عن طريف - وهو ابن شهاب أبو سفيان السعدي - عن أبي نضرة به وقد روي من غير طريق الثوري فقال الحافظ أبو بكر البزار حدثنا عباد بن زياد الساجي حدثنا عثمان بن عمر حدثنا شعبة عن سعيد الجريري عن أبي نضرة عن أبي سعيد رضي الله عنه قال: إن بني سلمة شكوا إلى رسول الله صلى الله عليه وسلم بعد منازلهم من المسجد فنزلت \"ونكتب ما قدموا وآثارهم\" فأقاموا في مكانهم وحدثنا محمد بن المثنى حدثنا عبدالأعلى حدثنا الجريري عن أبي نضرة عن أبي سعيد رضي الله عنه عن النبي صلى الله عليه وسلم بنحوه وفيه غرابة من حيث ذكر نزول هذه الآية والسورة بكمالها مكية فالله أعلم. \"الحديث الثالث\" قال ابن جرير حدثنا نصر بن على الجهضمي حدثنا أبو أحمد الزبيري حدثنا إسرائيل عن سماك عن عكرمة عن ابن عباس رضي الله عنهما قال كانت منازل الأنصار متباعدة من المسجد فأرادوا أن ينتقلوا إلى المسجد فنزلت \"ونكتب ما قدموا وآثارهم\" فقالوا نثبت مكاننا هكذا رواه وليس فيه شيء مرفوع ورواه الطبراني عن عبدالله بن محمد بن سعيد بن أبي مريم عن محمد بن يوسف الفريابي عن إسرائيل عن سماك عن سعيد بن جبير عن ابن عباس رضي الله عنهما قال كانت الأنصار بعيدة منازلهم من المسجد فأرادوا أن يتحولوا إلى المسجد فنزلت \"ونكتب ما قدموا وآثارهم\" فثبتوا في منازلهم. \"الحديث الرابع\" قال الإمام أحمد حدثنا حسن حدثنا ابن لهيعة حدثني حيي بن عبدالله عن أبي عبدالرحمن الحبلي عن عبدالله بن عمرو رضي الله عنهما قال توفي رجل بالمدينة فصلى عليه النبي صلى الله عليه وسلم وقال: \"يا ليته مات في غير مولده\" فقال رجل من الناس ولم يا رسول الله؟ فقال رسول الله صلى الله عليه وسلم: \"إن الرجل إذا توفي في غير مولده قيس له من مولده إلى منقطع أثره في الجنة\" ورواه النسائي عن يونس بن عبدالأعلى وابن ماجة عن حرملة كلاهما عن ابن وهب عن حيي بن عبدالله به وقال ابن جرير حدثنا ابن حميد حدثنا أبو تميلة حدثنا الحسين عن ثابت قال مشيت مع أنس رضي الله عنه فأسرعت المشي فأخذ بيدي فمشينا رويدا فلما قضينا الصلاة قال أنس مشيت مع زيد بن ثابت فأسرعت المشي فقال يا أنس أما شعرت أن الآثار تكتب؟ وهذا القول لا تنافي بينه وبين الأول بل في هذا تنبيه ودلالة على ذلك بطريق الأولى والأحرى فإنه إذا كانت هذه الآثار تكتب فلأن تكتب تلك التي فيها قدوة بهم من خير أو شر بطريق الأولى والله أعلم وقوله تعالى: \"وكل شيء أحصيناه في إمام مبين\" أي وجميع الكائنات مكتوب في كتاب مسطور مضبوط في لوح محفوظ والإمام المبين ههنا هو أم الكتاب قاله مجاهد وقتادة وعبدالرحمن بن زيد بن أسلم وكذا في قوله تعالى \"يوم ندعو كل أناس بإمامهم\" أي بكتاب أعمالهم الشاهد عليهم بما عملوه من خير أو شر كما قال عز وجل \"ووضع الكتاب وجيء بالنبيين والشهداء\" وقال تعالى: \"ووضع الكتاب فترى المجرمين مشفقين مما فيه ويقولون يا ويلتنا ما لهذا الكتاب لا يغادر صغيرة ولا كبيرة إلا أحصاها ووجدوا ما عملوا حاضرا ولا يظلم ربك أحدا\"."
    },
    {
      "ayah": 13,
      "surah": 36,
      "text": "يقول تعالى واضرب يا محمد لقومك الذين كذبوك \"مثلا أصحاب القرية إذ جاءها المرسلون\" قال ابن إسحاق فيما بلغه عن ابن عباس رضي الله عنهما وكعب الأحبار ووهب بن منبه أنها مدينة أنطاكية وكان بها ملك يقال له أنطيخس بن أنطيخس بن أنطيخس وكان يعبد الأصنام فبعث الله تعالى إليه ثلاثة من الرسل وهم صادق وصدوق وشلوم فكذبهم وهكذا روي عن بريدة بن الخصيب وعكرمة وقتادة والزهري أنها أنطاكية وقد استشكل بعض الأئمة كونها أنطاكية بما سنذكره بعد تمام القصة إن شاء الله تعالى."
    },
    {
      "ayah": 14,
      "surah": 36,
      "text": "وقوله تعالى: \"إذ أرسلنا إليهم اثنين فكذبوهما\" أي بادروهما بالتكذيب \"فعززنا بثالث\" أي قويناهما وشددنا أزرهما برسول ثالث. قال ابن جريج عن وهب بن سليمان عن شعيب الجبابي قال كان اسم الرسولين الأولين شمعون ويوحنا واسم الثالث بولص والقرية أنطاكية \"فقالوا\" أي لأهل تلك القرية \"إنا إليكم مرسلون\" أي من ربكم الذي خلقكم يأمركم بعبادته وحده لا شريك له وقاله أبو العالية وزعم قتادة أنهم كانوا رسل المسيح عليه السلام إلى أهل أنطاكية."
    },
    {
      "ayah": 15,
      "surah": 36,
      "text": "\"قالوا ما أنتم إلا بشر مثلنا\" أى فكيف أوحي إليكم وأنتم بشر ونحن بشر فلم لا أوحي إلينا مثلكم ولو كنتم رسلا لكنتم ملائكة وهذه شبهة كثير من الأمم المكذبة كما أخبر الله تعالى عنهم في قوله عز وجل \"ذلك بأنه كانت تأتيهم رسلهم بالبينات فقالوا أبشر يهدوننا\" أي استعجبوا من ذلك وأنكروه وقوله تعالى: \"قالوا إن أنتم إلا بشر مثلنا تريدون أن تصدونا عما كان يعبد آباؤنا فائتونا بسلطان مبين\" وقوله تعالى حكاية عنهم في قوله تعالى \"ولئن أطعتم بشرا مثلكم إنكم إذا لخاسرون\" وقوله تعالى: \"وما منع الناس أن يؤمنوا إذ جاءهم الهدى إلا أن قالوا أبعث الله بشرا رسولا\"."
    },
    {
      "ayah": 16,
      "surah": 36,
      "text": "ولهذا قال هؤلاء \"ما أنتم إلا بشر مثلنا وما أنزل الرحمن من شيء إن أنتم إلا تكذبون قالوا ربنا يعلم إنا إليكم لمرسلون\" أي أجابتهم رسلهم الثلاثة قائلين الله يعلم أنا رسله إليكم ولو كنا كذبة عليه لانتقم منا أشد الانتقام ولكنه سيعزنا وينصرنا عليكم وستعلمون لمن تكون عاقبة الدار كقوله تعالى: \"قل كفى بالله بيني وبينكم شهيدا يعلم ما في السموات وما في الأرض والذين آمنوا بالباطل وكفروا بالله أولئك هم الخاسرون\"."
    },
    {
      "ayah": 17,
      "surah": 36,
      "text": "\"وما علينا إلا البلاغ المبين\" يقولون إنما علينا أن نبلغكم ما أرسلنا به إليكم فإذا أطعتم كانت لكم السعادة في الدنيا والأخرى وإن لم تجيبوا فستعلمون غب ذلك والله أعلم."
    },
    {
      "ayah": 18,
      "surah": 36,
      "text": "فعند ذلك قال لهم أهل القرية \"إنا تطيرنا بكم\" أي لم نر على وجوهكم خيرا في عيشنا. وقال قتادة يقولون إن أصابنا شر فإنما هو من أجلكم. وقال مجاهد يقولون لم يدخل مثلكم إلى قرية إلا عذب أهلها \"لئن لم تنتهوا لنرجمنكم\" قال قتادة بالحجارة وقال مجاهد بالشتم \"وليمسنكم منا عذاب أليم\" أي عقوبة شديدة فقالت لهم رسلهم."
    },
    {
      "ayah": 19,
      "surah": 36,
      "text": "\"طائركم معكم\" أي مردود عليكم كقوله تعالى في قوم فرعون \"فإذا جاءتهم الحسنة قالوا لنا هذه وإن تصبهم سيئة يطيروا بموسى ومن معه ألا إنما طائرهم عند الله\" وقال قوم صالح \"اطيرنا بك وبمن معك قال طائركم عند الله\" وقال قتادة ووهب بن منبه أي أعمالكم معكم. وقال عز وجل \"وإن تصبهم حسنة يقولوا هذه من عند الله وإن تصبهم سيئة يقولوا هذه من عندك قل كل من عند الله فما لهؤلاء القوم لا يكادون يفقهون حديثا\" وقوله تعالى: \"أئن ذكرتم بل أنتم قوم مسرفون\" أي من أجل أنا ذكرناكم وأمرناكم بتوحيد الله وإخلاص العبادة له قابلتمونا بهذا الكلام وتوعدتمونا وتهددتمونا بل أنتم قوم مسرفون. وقال قتادة أي إن ذكرناكم بالله تطيرتم منا بل أنتم قوم مسرفون."
    },
    { "ayah": 2, "surah": 36, "text": "\"والقرآن الحكيم\" أي المحكم الذي لا يأتيه الباطل من بين يديه ولا من خلفه." },
    {
      "ayah": 20,
      "surah": 36,
      "text": "قال ابن إسحاق فيما بلغه عن ابن عباس رضي الله عنهما وكعب الأحبار ووهب بن منبه أن أهل القرية هموا بقتل رسلهم فجاءهم رجل من أقصى المدينة يسعى أي لينصرهم من قومه قالوا وهو حبيب وكان يعمل الحرير وهو الحباك وكان رجلا سقيما قد أسرع فيه الجذام وكان كثير الصدقة يتصدق بنصف كسبه مستقيم الفطرة وقال ابن إسحاق عن رجل سماه عن الحكم عن مقسم أو مجاهد عن ابن عباس رضي الله عنهما قال اسم صاحب يس حبيب وكان الجذام قد أسرع فيه. وقال الثوري عن عاصم الأحول عن أبي مجلز كان اسمه حبيب بن سري وقال شبيب بن بشر عن عكرمة عن ابن عباس رضي الله عنهما قال اسم صاحب يس حبيب النجار فقتله قومه وقال السدي كان قصارا وقال عمر بن الحكم كان إسكافا وقال قتادة كان يتعبد في غار هناك \"قال يا قوم اتبعوا المرسلين\" يحض قومه على اتباع الرسل الذين أتوهم."
    },
    {
      "ayah": 21,
      "surah": 36,
      "text": "\"اتبعوا من لا يسألكم أجرا\" أي على إبلاغ الرسالة \"وهم مهتدون\" فيما يدعونكم إليه من عبادة الله وحده لا شريك له."
    },
    {
      "ayah": 22,
      "surah": 36,
      "text": "\"وما لي لا أعبد الذي فطرني\" أي وما يمنعني من إخلاص العبادة للذي خلقني وحده لا شريك له \"وإليه ترجعون\" أي يوم المعاد فيجازيكم على أعمالكم إن خيرا فخير وإن شرا فشر."
    },
    {
      "ayah": 23,
      "surah": 36,
      "text": "\"أأتخذ من دونه آلهة\" استفهام إنكار وتوبيخ وتقريع \"إن يردن الرحمن بضر لا تغن عني شفاعتهم شيئا ولا ينقذون\" أي هذه الآلهة التي تعبدونها من دونه لا يملكون من الأمر شيئا فإن الله تعالى لو أرادني بسوء \"فلا كاشف له إلا هو\" وهذه الأصنام لا تملك دفع ذلك ولا منعه ولا ينقذونني مما أنا فيه."
    },
    { "ayah": 24, "surah": 36, "text": "\"إنى إذا لفي ضلال مبين\" أى إن اتخذتها آلهة من دون الله." },
    {
      "ayah": 25,
      "surah": 36,
      "text": "وقوله تعالى: \"إني آمنت بربكم فاسمعون\" قال ابن إسحاق فيما بلغه عن ابن عباس رضي الله عنهما وكعب ووهب يقول لقومه \"إني آمنت بربكم\" الذي كفرتم به \"فاسمعون\" أي فاسمعوا قولي ويحتمل أن يكون خطابه للرسل بقوله \"إني آمنت بربكم\" أي الذي أرسلكم \"فاسمعون\" أي فاشهدوا لي بذلك عنده وقد حكاه ابن جرير فقال وقال آخرون بل خاطب بذلك الرسل وقال لهم اسمعوا قولي لتشهدوا لي بما أقول لكم عند ربي إنى آمنت بربكم واتبعتكم وهذا القول الذي حكاه عن هؤلاء أظهر في المعنى والله أعلم. قال ابن إسحاق فيما بلغه عن ابن عباس رضي الله عنهما وكعب ووهب رضي الله عنهم فلما قال ذلك وثبوا عليه وثبة رجل واحد فقتلوه ولم يكن له أحد يمنع عنه وقال قتادة جعلوا يرجمونه بالحجارة وهو يقول اللهم اهد قومي فإنهم لا يعلمون فلم يزالوا به حتى أقعصوه وهو يقول كذلك فقتلوه رحمه الله."
    },
    {
      "ayah": 26,
      "surah": 36,
      "text": "قال محمد بن إسحاق عن بعض أصحابه عن ابن مسعود رضي الله عنه أنهما وطئوه بأرجلهم حتى خرج قصه من دبره وقال الله له \"ادخل الجنة\" فدخلها فهو يرزق فيها قد أذهب الله عنه سقم الدنيا وحزنها ونصبها وقال مجاهد قيل لحبيب النجار ادخل الجنة وذلك أنه قتل فوجبت له فلما رأى الثواب \"قال يا ليت قومي يعلمون\" قال قتادة لا تلقى المؤمن إلا ناصحا لا تلقاه غاشا لما عاين ما عاين من كرامة الله تعالى \"قال يا ليت قومي يعلمون بما غفر لي ربي وجعلني من المكرمين\" تمنى والله أن يعلم قومه بما عاين من كرامة الله وما هجم عليه وقال ابن عباس نصح قومه في حياته بقوله \"يا قومي اتبعوا المرسلين\" وبعد مماته فى قوله \"يا ليت قومي يعلمون بما غفر لي ربي وجعلني من المكرمين\" رواه ابن أبي حاتم وقال سفيان الثوري عن عاصم الأحول عن أبي مجلز."
    },
    {
      "ayah": 27,
      "surah": 36,
      "text": "\"بما غفر لي ربي وجعلني من المكرمين\" بإيماني بربي وتصديقي المرسلين ومقصوده أنهم لو اطلعوا على ما حصل لي من الثواب والجزاء والنعيم المقيم لقادهم ذلك إلى اتباع الرسل فرحمه الله ورضي عنه فلقد كان حريصا على هداية قومه. قال ابن أبي حاتم حدثنا أبي حدثنا هشام بن عبيد الله حدثنا ابن جابر هو محمد عن عبدالملك يعني ابن عمير قال: قال عروة بن مسعود الثقفي رضي الله عنه للنبي صلى الله عليه وسلم ابعثني إلى قومي أدعوهم إلى الإسلام فقال رسول الله صلى الله عليه وسلم: \"إني أخاف أن يقتلوك\" فقال لو وجدوني نائما ما أيقظوني فقال له رسول الله صلى الله عليه وسلم: \"انطلق\" فانطلق فمر على اللات والعزى فقال لأصبحنك غدا بما يسوءك فغضبت ثقيف فقال يا معشر ثقيف إن اللات لا لات وإن العزى لا عزى أسلموا تسلموا يا معشر الأحلاف إن العزى لا عزى وإن اللات لا لات أسلموا تسلموا قال ذلك ثلاث مرات فرماه رجل فأصاب أكحله فقتله فبلغ رسول الله صلى الله عليه وسلم فقال: \"هذا مثله كمثل صاحب يس\" \"قال يا ليت قومي يعلمون بما غفر لي ربي وجعلني من المكرمين\". وقال محمد بن إسحاق عن عبدالله بن عبدالرحمن بن معمر بن حزم أنه حدث عن كعب الأحبار أنه ذكر له حبيب بن زيد بن عاصم أخو بني مازن بن النجار الذي كان مسيلمة الكذاب قطعه باليمامة حين جعل يسأله عن رسول الله صلى الله عليه وسلم فجعل يقول له أتشهد أن محمدا رسول الله؟ فيقول نعم ثم يقول أتشهد أني رسول الله فيقول لا أسمع فيقول له مسيلمة لعنه الله أتسمع هذا ولا تسمع ذاك؟ فيقول نعم فجعل يقطعه عضوا عضوا كلما سأله لم يزده على ذلك حتى مات في يديه فقال كعب حين قيل له اسمه حبيب وكان والله صاحب يس اسمه حبيب."
    },
    {
      "ayah": 28,
      "surah": 36,
      "text": "وقوله تبارك وتعالى \"وما أنزلنا على قومه من بعده من جند من السماء وما كنا منزلين\" يخبر تعالى أنه انتقم من قومه بعد قتلهم إياه غضبا منه تبارك وتعالى عليهم لأنهم كذبوا رسله وقتلوا وليه ويذكر عز وجل أنه ما أنزل عليهم وما احتاج في إهلاكه إياهم إلى إنزال جند من الملائكة عليهم بل الأمر كان أيسر من ذلك. قاله ابن مسعود فيما رواه ابن إسحاق عن بعض أصحابه أنه قال في قوله تعالى: \"وما أنزلنا على قومه من بعده من جند من السماء وما كنا منزلين\" أي ما كاثرناهم بالجموع الأمر كان أيسر علينا من ذلك."
    },
    {
      "ayah": 29,
      "surah": 36,
      "text": "\"إن كانت إلا صيحه واحدة فإذا هم خامدون\" قال فأهلك الله تعالى ذلك الملك وأهل أنطاكية فبادوا عن وجه الأرض فلم يبق منهم باقية وقيل \"وما كنا منزلين\" أي وما كنا ننزل الملائكة على الأمم إذا أهلكناهم بل نبعث عليهم عذابا يدمرهم وقيل المعنى في قوله تعالى \"وما أنزلنا على قومه من بعده من جند من السماء\" أى من رسالة أخرى إليهم قاله مجاهد وقتادة قال قتادة فلا والله ما عاتب الله قومه بعد قتله \"إن كانت إلا صيحة واحدة فإذا هم خامدون\" قال ابن جرير والأول أصح لأن الرسالة لا تسمى جندا. قال المفسرون بعث الله تعالى إليهم جبريل عليه الصلاة والسلام فأخذ بعضادتي باب بلدهم ثم صاح فيهم صيحة واحدة فإذا هم خامدون عن آخرهم لم يبق فيهم روح تتردد في جسد وقد تقدم عن كثير من السلف أن هذه القرية هي أنطاكية وأن هؤلاء الثلاثة كانوا رسلا من عند المسيح عيسى ابن مريم عليه الصلاة والسلام كما نص عليه قتادة وغيره وهو الذي لم يذكر عن واحد من متأخري المفسرين غيره وفي ذلك نظر من وجوه \"أحدها\" أن ظاهر القصة يدل على أن هؤلاء كانوا رسل الله عز وجل لا من جهة المسيح عليه السلام كما قال تعالى: \"إذ أرسلنا إليهم اثنين فكذبوهما فعززنا بثالث فقالوا إنا إليكم مرسلون - إلى أن قالوا - ربنا يعلم إنا إليكم لمرسلون وما علينا إلا البلاغ المبين\" ولو كان هؤلاء من الحواريين لقالوا عبارة تناسب أنهم من عند المسيح عليه السلام والله تعالى أعلم ثم لو كانوا رسل المسيح لما قالوا لهم \"إن أنتم إلا بشر مثلنا\" \"الثاني\" أن أهل أنطاكية آمنوا برسل المسيح إليهم وكانوا أول مدينة آمنت بالمسيح ولهذا كانت عند النصارى إحدى المدائن الأربعة اللاتي فيهن بتاركة وهن القدس لأنها بلد المسيح وأنطاكية لأنها أول بلدة آمنت بالمسيح عن آخر أهلها والإسكندرية لأن فيها اصطلحوا على اتخاذ البتاركة والمطارنة والأساقفة والقساوسة والشمامسة والرهابين. ثم رومية لأنها مدينة الملك قسطنطين الذي نصر دينهم وأوطده ولما ابتنى القسطنطينية نقلوا البترك من رومية إليها كما ذكره غير واحد ممن ذكر تواريخهم كسعيد بن بطريق وغيره من أهل الكتاب والمسلمين فإذا تقرر أن أنطاكية أول مدينة آمنت فأهل هذه القرية ذكر الله تعالى أنهم كذبوا رسله وأنه أهلكهم بصيحة واحدة أخمدتهم والله أعلم. \"الثالث\" أن قصة أنطاكية مع الحواريين أصحاب المسيح بعد نزول التوراة وقد ذكر أبو سعيد الخدري رضي الله عنه وغير واحد من السلف أن الله تبارك وتعالى بعد إنزاله التوراة لم يهلك أمة من الأمم عن آخرهم بعذاب يبعثه عليهم بل أمر المؤمنين بعد ذلك بقتال المشركين ذكروه عند قوله تبارك وتعالى: \"ولقد آتينا موسى الكتاب من بعد ما أهلكنا القرون الأولى\" فعلى هذا يتعين أن هذه القرية المذكورة في القرآن قرية أخرى غير أنطاكية كما أطلق ذلك غير واحد من السلف أيضا أو تكون أنطاكية إن كان لفظها محفوظا في هذه القصة مدينة أخرى غير هذه المشهورة المعروفة فإن هذه لم يعرف أنها أهلكت لا في الملة النصرانية ولا قبل ذلك والله سبحانه وتعالى أعلم فأما الحديث الذي رواه الحافظ أبو القاسم الطبراني حدثنا الحسين بن إسحاق التستري حدثنا الحسين بن أبي السري العسقلاني حدثنا حسين الأشقر حدثنا ابن عيينة عن ابن أبي نجيح عن مجاهد عن ابن عباس رضي الله عنهما عن النبي صلى الله عليه وسلم قال: \"السبق ثلاثة: فالسابق إلى موسى عليه الصلاة والسلام يوشع بن نون والسابق إلى عيسى عليه الصلاة والسلام صاحب يس والسابق إلى محمد صلى الله عليه وسلم علي بن أبي طالب رضي الله عنه\" فإنه حديث منكر لا يعرف إلا من طريق حسين الأشقر وهو شيعي متروك والله سبحانه وتعالى أعلم بالصواب."
    },
    { "ayah": 3, "surah": 36, "text": "\"إنك\" أي يا محمد." },
    {
      "ayah": 30,
      "surah": 36,
      "text": "قال علي بن أبي طلحة عن ابن عباس في قوله تعالى: \"يا حسرة على العباد\" أي يا ويل العباد وقال قتادة \"يا حسرة على العباد\" أي يا حسرة العباد على أنفسهم على ما ضيعت من أمر الله وفرطت في جنب الله وفي بعض القراءات \"يا حسرة العباد على أنفسها\" ومعنى هذا يا حسرتهم وندامتهم يوم القيامة إذا عاينوا العذاب كيف كذبوا رسل الله وخالفوا أمر الله فإنهم كانوا في الدار الدنيا المكذبون منهم \"ما يأتيهم من رسول إلا كانوا به يستهزئون\" أي يكذبونه ويستهزئون به ويجحدون ما أرسل به من الحق."
    },
    {
      "ayah": 31,
      "surah": 36,
      "text": "ثم قال تعالى: \"ألم يروا كم أهلكنا قبلهم من القرون أنهم إليهم لا يرجعون\" أي ألم يتعظوا بمن أهلك الله قبلهم من المكذبين للرسل كيف لم يكن لهم إلى هذه الدنيا كرة ولا رجعة ولم يكن الأمر كما زعم كثير من جهلتهم وفجرتهم من قولهم \"إن هي إلا حياتنا الدنيا نموت ونحيا\"وهم القائلون بالدور من الدهرية وهم الذين يعتقدون جهلا منهم أنهم يعودون إلى الدنيا كما كانوا فيها فرد الله تبارك وتعالى عليهم باطلهم فقال تبارك وتعالى \"ألم يروا كم أهلكنا قبلهم من القرون أنهم إليهم لا يرجعون\"."
    },
    {
      "ayah": 32,
      "surah": 36,
      "text": "وقوله عز وجل \"وإن كل لما جميع لدينا محضرون\" أي وإن جميع الأمم الماضية والآتية ستحضر للحساب يوم القيام بين يدي الله جل وعلا فيجازيهم بأعمالهم كلها خيرها وشرها ومعنى هذه كقوله جل وعلا \"وإن كلا لما ليوفينهم ربك أعمالهم\" وقد اختلف القراء في أداء هذا الحرف فمنهم من قرأ \"وإن كل لما\" بالتخفيف فعنده أن إن للإثبات ومنهم من شدد \"لما\" وجعل إن نافية ولما بمعنى إلا تقديره وما كل إلا جميع لدينا محضرون ومعنى القراءتين واحد والله سبحانه وتعالى أعلم."
    },
    {
      "ayah": 33,
      "surah": 36,
      "text": "يقول تبارك وتعالى \"وآية لهم\" أي دلالة لهم على وجود الصانع وقدرته التامة وإحيائه الموتى \"الأرض الميتة\" أي إذا كانت ميتة هامدة لا شيء فيها من النبات فإذا أنزل الله تعالى عليها الماء اهتزت وربت وأنبتت من كل زوج بهيج ولهذا قال تعالى: \"أحييناها وأخرجنا منها حبا فمنه يأكلون\" أي جعلنا رزقا لهم ولأنعامهم."
    },
    {
      "ayah": 34,
      "surah": 36,
      "text": "\"وجعلنا فيها جنات من نخيل وأعناب وفجرنا فيها من العيون\" أي جعلنا فيها أنهارا سارحة في أمكنة يحتاجون إليها."
    },
    {
      "ayah": 35,
      "surah": 36,
      "text": "\"ليأكلوا من ثمره\"; لما امتن على خلقه بإيجاد الزروع لهم عطف بذكر الثمار وتنوعها وأصنافها."
    },
    {
      "ayah": 36,
      "surah": 36,
      "text": "وقوله جل وعلا \"وما عملته أيديهم\" أي وما ذاك كله إلا من رحمة الله تعالى بهم لا بسعيهم ولا كدهم ولا بحولهم وقوتهم قاله ابن عباس رضي الله عنهما وقتادة ولهذا قال تعالى \"أفلا يشكرون\" أي فهلا يشكرونه على ما أنعم به عليهم من هذه النعم التي لا تعد ولا تحصى واختار ابن جرير - بل جزم به ولم يحك غيره إلا احتمالا- أن ما في قوله تعالى: \"وما عملته أيديهم\" بمعنى الذي تقديره ليأكلوا من ثمره ومما عملته أيديهم أي غرسوه ونصبوه قال وهي كذلك في قراءة ابن مسعود رضي الله تعالى عنه \"ليأكلوا من ثمره ومما عملته أيديهم أفلا يشكرون\" ثم قال تبارك وتعالى \"سبحان الذي خلق الأزواج كلها مما تنبت الأرض\" أي من زروع وثمار ونبات \"ومن أنفسهم\" فجعلهم ذكرا وأنثى \"ومما لا يعلمون\" أي من مخلوقات شتى لا يعرفونها كما قال جلت عظمته \"ومن كل شيء خلقنا زوجين لعلكم تذكرون\"."
    },
    {
      "ayah": 37,
      "surah": 36,
      "text": "يقول تعالى ومن الدلالة لهم على قدرته تبارك وتعالى العظيمة خلق الليل والنهار هذا بظلامه وهذا بضيائه وجعلهما يتعاقبان يجيء هذا فيذهب هذا ويذهب هذا فيجيء هذا كما قال تعالى: \"يغشي الليل النهار يطلبه حثيثا\" ولهذا قال عز وجل ههنا \"وآية لهم الليل نسلخ منه النهار\" أي نصرمه منه فيذهب فيقبل الليل ولهذا قال تبارك وتعالى \"فإذا هم مظلمون\" كما جاء في الحديث \"إذا أقبل الليل من ههنا وأدبر النهار من ههنا وغربت الشمس فقد أفطر الصائم\" هذا هو الظاهر من الآية وزعم قتادة أنها كقوله تعالى: \"يولج الليل في النهار ويولج النهار في الليل\" وقد ضعف ابن جرير قول قتادة ههنا وقال إنما معنى الإيلاج الأخذ من هذا في هذا وليس هذا مرادا في هذه الآية وهذا الذي قاله ابن جرير حق."
    },
    {
      "ayah": 38,
      "surah": 36,
      "text": "وقوله جل جلاله \"والشمس تجري لمسقر لها ذلك تقدير العزيز العليم\" في معنى قوله \"لمستقر لها\" قولان أحدهما أن المراد مستقرها المكاني وهو تحت العرش مما يلي الأرض في ذلك الجانب وهي أينما كانت فهي تحت العرش وجميع المخلوقات لأنه سقفها وليس بكرة كما يزعمه كثير من أرباب الهيئة وإنما هو قبة ذات قوائم تحمله الملائكة وهو فوق العالم مما يلي رؤوس الناس فالشمس إذا كانت في قبة الفلك وقت الظهيرة تكون أقرب ما تكون إلى العرش فإذا استدارت في فلكها الرابع إلى مقابلة هذا المقام وهو وقت نصف الليل صارت أبعد ما تكون إلى العرش فحينئذ تسجد وتستأذن في الطلوع كما جاءت بذلك الأحاديث قال البخاري حدثنا أبو نعيم حدثنا الأعمش عن إبراهيم التيمي عن أبيه عن أبي ذر رضي الله عنه قال: كنت مع النبي صلى الله عليه وسلم في المسجد عند غروب الشمس فقال صلى الله عليه وسلم \"يا أبا ذر أتدري أين تغرب الشمس؟ \"قلت الله ورسوله أعلم قال صلى الله عليه وسلم. \"فإنها تذهب حتى تسجد تحت العرش فذلك قوله تعالى: \"والشمس تجري لمستقر لها ذلك تقدير العزيز العليم\" \"حدثنا عبدالله بن الزبير الحميدي حدثنا وكيع عن الأعمش عن إبراهيم التيمي عن أبيه عن أبي ذر رضي الله عنه قال: سألت رسول الله صلى الله عليه وسلم عن قوله تبارك وتعالى: \"والشمس تجري لمستقر لها\" قال صلى الله عليه وسلم \"مستقرها تحت العرش\" هكذا أورده ههنا وقد أخرجه في أماكن متعددة ورواه بقية الجماعة إلا ابن ماجه من طرق عن الأعمش به وقال الإمام أحمد حدثنا محمد بن عبيد عن الأعمش عن إبراهيم التيمي عن أبيه عن أبي ذر قال كنت مع رسول الله صلى الله عليه وسلم في المسجد حين غربت الشمس فقال صلى الله عليه وسلم \"يا أبا ذر أتدري أين تذهب الشمس؟ \"قلت الله ورسوله أعلم قال صلى الله عليه وسلم \"فإنها تذهب حتى تسجد بين يدي ربها عز وجل فتستأذن في الرجوع فيؤذن لها وكأنها قد قيل لها ارجعي من حيث جئت فترجع إلى مطلعها وذلك مستقرها\" ثم قرأ \"والشمس تجري لمستقر لها\" قال سفيان الثوري عن الأعمش عن إبراهيم التيمي عن أبيه عن أبي ذر رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم لأبي ذر حين غربت الشمس \"أتدري أين تذهب؟ \"قلت الله ورسوله أعلم قال صلى الله عليه وسلم \"فإنها تذهب حتى تسجد تحت العرش فتستأذن فيؤذن لها ويوشك أن تسجد فلا يقبل منها وتستأذن فلا يؤذن لها ويقال لها ارجعي من حيث جئت فتطلع من مغربها فذلك قوله تعالى: \"والشمس تجري لمستقر لها ذلك تقدير العزيز العليم\". وقال عبدالرزاق أخبرنا معمر عن أبي إسحاق عن وهب بن جابر عن عبدالله بن عمرو رضي الله عنهما قال في قوله تعالى: \"والشمس تجري لمستقر لها\" قال إن الشمس تطلع فتردها ذنوب بني آدم حتى إذا غربت سلمت وسجدت واستأذنت فيؤذن لها حتى إذا كان يوم غربت فسلمت وسجدت واستأذنت فلا يؤذن لها فتقول إن المسير بعيد وإني إن لا يؤذن لي لا أبلغ فتحبس ما شاء الله أن تحبس ثم يقال لها اطلعي من حيث غربت قال فمن يومئذ إلى يوم القيامة لا ينفع نفسا إيمانها لم تكن آمنت من قبل أو كسبت في إيمانها خيرا وقيل المراد بمستقرها هو انتهاء سيرها وهو غاية ارتفاعها في السماء في الصيف وهو أوجها ثم غاية انخفاضها في الشتاء وهو الحضيض \"والقول الثاني\" أن المراد بمستقرها هو منتهى سيرها وهو يوم القيامة يبطل سيرها وتسكن حركتها وتكور وينتهي هذا العالم إلى غايته وهذا هو مستقرها الزماني قال قتادة \"لمستقر لها\" أي لوقتها ولأجل لا تعدوه وقيل المراد أنها لا تزال تنتقل في مطالعها الصيفية إلى مدة لا تزيد عليها ثم تنتقل في مطالع الشتاء إلى مدة لا تزيد عليها يروى هذا عن عبدالله بن عمرو رضي الله عنهما. وقرأ ابن مسعود وابن عباس رضي الله عنهم \"والشمس تجري لا مستقر لها\" أي لا قرار لها ولا سكون بل هي سائرة ليلا ونهارا لا تفتر ولا تقف كما قال تبارك وتعالى \"وسخر لكم الشمس والقمر دائبين\" أي لا يفتران ولا يقفان إلى يوم القيامة \"ذلك تقدير العزيز\" أي الذي لا يخالف ولا يمانع \"العليم\" بجميع الحركات والسكنات وقد قدر ذلك ووقته على منوال لا اختلاف فيه ولا تعاكس كما قال عز وجل \"فالق الإصباح وجعل الليل سكنا والشمس والقمر حسبانا ذلك تقدير العزيز العليم\" وهكذا ختم آية حم السجدة بقوله تعالى: \"ذلك تقدير العزيز العليم\"."
    },
    {
      "ayah": 39,
      "surah": 36,
      "text": "ثم قال جل وعلا \"والقمر قدرناه منازل\" أي جعلناه يسير سيرا آخر يستدل به على مضي الشهور كما أن الشمس يعرف بها الليل والنهار كما قال عز وجل \"يسألونك عن الأهلة قل هي مواقيت للناس والحج\". وقال تعالى: \"هو الذي جعل الشمس ضياء والقمر نورا وقدره منازل لتعلموا عدد السنين والحساب\" الآية وقال تبارك وتعالى: \"وجعلنا الليل والنهار آيتين فمحونا آية الليل وجعلنا آية النهار مبصرة لتبتغوا فضلا من ربكم ولتعلموا عدد السنين والحساب وكل شيء فصلناه تفصيلا\" فجعل الشمس لها ضوء يخصها والقمر له نور يخصه وفاوت بين سير هذه وهذا فالشمس تطلع كل يوم وتغرب في آخره على ضوء واحد ولكن تنتقل في مطالعها ومغاربها صيفا وشتاء يطول بسبب ذلك النهار ويقصر الليل ثم يطول الليل ويقصر النهار وجعل سلطانها بالنهار فهي كوكب نهاري وأما القمر فقدره منازل يطلع في أول ليلة من الشهر ضئيلا قليل النور ثم يزداد نورا في الليلة الثانية ويرتفع منزلة ثم كلما ارتفع ازداد ضياء وإن كان مقتبسا من الشمس حتى يتكامل نوره في الليلة الرابعة عشرة ثم يشرع في النقص إلى آخر الشهر حتى يصير كالعرجون القديم. قال ابن عباس رضي الله عنهما عنهما وهو أصل العذق. وقال مجاهد العرجون القديم أي العذق اليابس يعني ابن عباس رضي الله عنهما أصل العنقود من الرطب إذا عتق ويبس وانحنى وكذا قال غيرهما ثم بعد هذا يبديه الله تعالى جديدا في أول الشهر الآخر والعرب تسمي كل ثلاث ليال من الشهر باسم باعتبار القمر فيسمون الثلاث الأول غرر واللواتي بعدها نقل واللواتي بعدها تسع لأن أخراهن التاسعة واللواتي بعدها عشر لأن أولاهن العاشرة واللواتي بعدها البيض لأن ضوء القمر فيهن إلى آخرهن واللواتي بعدهن درع جمع درعاء لأن أولهن أسود لتأخر القمر في أولهن منه ومنه الشاة الدرعاء وهي التي رأسها أسود وبعدهن ثلاث ظلم ثم ثلاث حنادس وثلاث دآدي وثلاث محاق لانمحاق القمر أو الشهر فيهن وكان أبو عبيدة رضي الله عنه ينكر التسع والعشر. كذا قال في كتاب غريب المصنف."
    },
    { "ayah": 4, "surah": 36, "text": "\"لمن المرسلين على صراط مستقيم\" أي على منهج ودين قويم وشرع مستقيم." },
    {
      "ayah": 40,
      "surah": 36,
      "text": "وقوله تبارك وتعالى: \"لا الشمس ينبغي لها أن تدرك القمر\" قال مجاهد لكل منهما حد لا يعدوه ولا يقصر دونه إذا جاء سلطان هذا ذهب هذا وإذا ذهب سلطان هذا جاء سلطان هذا وقال عبدالرزاق أخبرنا معمر عن الحسن في قوله تعالى: \"لا الشمس ينبغي لها أن تدرك القمر\" قال ذلك ليلة الهلال. وروى ابن أبي حاتم ههنا عن عبدالله بن المبارك أنه قال إن للريح جناحا وإن القمر يأوي إلى غلاف من الماء وقال الثوري عن إسماعيل بن أبي خالد عن أبي صالح لا يدرك هذا ضوء هذا ولا هذا ضوء هذا. وقال عكرمة فى قوله عز وجل \"لا الشمس ينبغي لها أن تدرك القمر\" يعني أن لكل منهما سلطانا فلا ينبغي للشمس أن تطلع بالليل. وقوله تعالى: \"ولا الليل سابق النهار\" يقول لا ينبغي إذا كان الليل أن يكون ليل آخر حتى يكون النهار فسلطان الشمس بالنهار وسلطان القمر بالليل وقال الضحاك لا يذهب الليل من ههنا حتى يجيء النهار من ههنا وأومأ بيده إلى المشرق وقال مجاهد \"ولا الليل سابق النهار\" يطلبان حثيثين يسلخ أحدهما من الآخر والمعنى في هذا أنه لا فترة بين الليل والنهار بل كل منهما يعقب الآخر بلا مهلة ولا تراخ لأنهما مسخران دائبين يتطالبان طلبا حثيثا. وقوله تبارك وتعالى \"وكل في فلك يسبحون\" يعني الليل والنهار والشمس والقمر كلهم يسبحون أي يدورون في فلك السماء. قاله ابن عباس وعكرمة والضحاك والحسن وقتادة وعطاء الخراساني وقال عبدالرحمن بن زيد بن أسلم في فلك بين السماء والأرض. رواه ابن أبي حاتم وهو غريب جدا بل منكر قال ابن عباس رضي الله عنهما وغير واحد من السلف في فلكة كفلكة المغزل وقال مجاهد الفلك كحديد الرحى أو كفلكة المغزل لا يدور المغزل إلا بها ولا تدور إلا به."
    },
    {
      "ayah": 41,
      "surah": 36,
      "text": "يقول تبارك وتعالى ودلالة لهم أيضا على قدرته تبارك وتعالى تسخيره البحر ليحمل السفن فمن ذلك بل أوله سفينة نوح عليه الصلاة والسلام التي أنجاه الله تعالى فيها بمن معه من المؤمنين الذين لم يبق على وجه الأرض من ذرية آدم عليه الصلاة والسلام غيرهم ولهذا قال عز وجل \"وآية لهم أنا حملنا ذريتهم\" أي آباءهم \"في الفلك المشحون\" أي في السفينة المملوءة من الأمتعة والحيوانات التي أمره الله تبارك وتعالى أن يحمل فيها من كل زوجين اثنين قال ابن عباس رضي الله عنهما المشحون الموقر وكذا قال سعيد بن جبير والشعبي وقتادة والسدي وقال الضحاك وقتادة وابن زيد وهي سفينة نوح عليه الصلاة والسلام."
    },
    {
      "ayah": 42,
      "surah": 36,
      "text": "وقوله جل وعلا \"وخلقنا لهم من مثله ما يركبون\" قال العوفي عن ابن عباس رضي الله عنهما يعني بذلك الإبل فإنها سفن البر يحملون عليها ويركبونها وكذا قال عكرمة ومجاهد والحسن وقتادة في رواية عبدالله بن شداد وغيرهم وقال السدي في رواية هي الأنعام. وقال ابن جرير حدثنا الفضل بن الصباح حدثنا محمد بن فضيل عن عطاء عن سعيد بن جبير عن ابن عباس رضي الله عنهما قال أتدرون ما قوله تعالى \"وخلقنا لهم من مثله ما يركبون\"؟ قلنا لا قال هي السفن جعلت من بعد سفينة نوح عليه الصلاة والسلام على مثلها وكذا قال أبو مالك والضحاك وقتادة وأبو صالح والسدي أيضا المراد بقوله تعالى: \"وخلقنا لهم من مثله ما يركبون\" أي السفن ويقوي هذا المذهب في المعنى قوله جل وعلا \"إنا لما طغى الماء حملناكم في الجارية لنجعلها لكم تذكرة وتعيها أذن واعية\"."
    },
    {
      "ayah": 43,
      "surah": 36,
      "text": "وقوله عز وجل \"وإن نشأ نغرقهم\" يعني الذين في السفن \"فلا صريخ لهم\" أي فلا مغيث لهم مما هم فيه \"ولا هم ينقذون\" أي مما أصابهم."
    },
    {
      "ayah": 44,
      "surah": 36,
      "text": "\"إلا رحمه منا\" وهذا استثناء منقطع تقديره ولكن برحمتنا نسيركم في البر والبحر ونسلمكم إلى أجل مسمى ولهذا قال تعالى: \"ومتاعا إلى حين\" أي إلى وقت معلوم عند الله عز وجل."
    },
    {
      "ayah": 45,
      "surah": 36,
      "text": "يقول تعالى مخبرا عن تمادي المشركين فى غيهم وضلالهم وعدم اكتراثهم بذنوبهم التي أسلفوها وما يستقبلون بين أيديهم يوم القيامة \"وإذا قيل لهم اتقوا ما بين أيديكم وما خلفكم\" قال مجاهد من الذنوب وقال غيره بالعكس \"لعلكم ترحمون\" أي لعل الله باتقائكم ذلك يرحمكم ويؤمنكم من عذابه وتقدير الكلام أنهم لا يجيبون إلى ذلك بل يعرضون عنه."
    },
    {
      "ayah": 46,
      "surah": 36,
      "text": "واكتفى عن ذلك بقوله تعالى: \"وما تأتيهم من آية من آيات ربهم\" أي على التوحيد وصدق الرسل \"إلا كانوا عنها معرضين\" أي لا يتأملونها ولا يقبلونها ولا ينتفعون بها."
    },
    {
      "ayah": 47,
      "surah": 36,
      "text": "وقوله عز وجل \"وإذا قيل لهم أنفقوا مما رزقكم الله\" أي وإذا أمروا بالإنفاق مما رزقهم الله على الفقراء والمحاويج من المسلمين \"قال الذين كفروا للذين آمنوا\" أي عن الذين آمنوا من الفقراء أي قالوا لمن أمرهم من المؤمنين بالإنفاق محاجين لهم فيما أمروهم به \"أنطعم من لو يشاء الله أطعمه\" أي وهؤلاء الذين أمرتمونا بالإنفاق عليهم لو شاء الله لأغناهم ولأطعمهم من رزقه فنحن نوافق مشيئة الله تعالى فيهم \"إن أنتم إلا في ضلال مبين\" أي في أمركم لنا بذلك قال ابن جرير ويحتمل أن يكون من قول الله عز وجل للكفار حين ناظروا المومنين وردوا عليهم فقال لهم \"إن أنتم إلا في ضلال مبين\" وفي هذا نظر والله أعلم."
    },
    {
      "ayah": 48,
      "surah": 36,
      "text": "يخبر تعالى عن استبعاد الكفرة لقيام الساعة في قولهم \"متى هذا الوعد\" \"يستعجل بها الذين لا يؤمنون بها\"."
    },
    {
      "ayah": 49,
      "surah": 36,
      "text": "قال الله عز وجل \"ما ينظرون إلا صيحة واحدة تأخذهم وهم يخصمون\" أي ما ينتظرون إلا صيحة واحدة وهذه والله أعلم نفخة الفزع ينفخ في الصور نفخة الفزع والناس في أسواقهم ومعايشهم يختصمون ويتشاجرون على عادتهم فبينما هم كذلك إذ أمر الله عز وجل إسرافيل فنفخ في الصور نفخة يطولها ويمدها فلا يبقى أحد على وجه الأرض إلا أصغى ليتا ورفع ليتا وهي صفحة العنق يتسمع الصوت من قِبَل السماء ثم يساق الموجودون من الناس إلى محشر القيامة بالنار تحيط بهم من جوانبهم."
    },
    {
      "ayah": 5,
      "surah": 36,
      "text": "\"تنزيل العزيز الرحيم\" أي هذا الصراط والمنهج والدين الذي جئت به تنزيل من رب العزة الرحيم بعباده المؤمنين كما قال تعالى: \"وإنك لتهدي إلى صراط مستقيم صراط الله الذي له ما في السموات وما في الأرض ألا إلى الله تصير الأمور\"."
    },
    {
      "ayah": 50,
      "surah": 36,
      "text": "ولهذا قال تعالى: \"فلا يستطيعون توصية\" أي على ما يملكونه الأمر أهم من ذلك \"ولا إلى أهلهم يرجعون\" وقد وردت ههنا آثار وأحاديث ذكرناها في موضع آخر ثم يكون بعد هذا نفخة الصعق التي تموت بها الأحياء كلهم ما عدا الحي القيوم ثم بعد ذلك نفخة البعث."
    },
    {
      "ayah": 51,
      "surah": 36,
      "text": "هذه هي النفخة الثالثة وهي نفخة البعث والنشور للقيام من الأجداث والقبور ولهذا قال تعالى: \"فإذا هم من الأجداث إلى ربهم ينسلون\" والنسلان هو المشي السريع كما قال تعالى: \"يوم يخرجون من الأجداث سراعا كأنهم إلى نصب يوفضون\"."
    },
    {
      "ayah": 52,
      "surah": 36,
      "text": "\"قالوا يا ويلنا من بعثنا من مرقدنا\" يعنون قبورهم التي كانوا يعتقدون في الدار الدنيا أنهم لا يبعثون منها فلما عاينوا ما كذبوا به في محشرهم \"قالوا يا ويلنا من بعثنا من مرقدنا\" وهذا لا ينفي عذابهم في قبورهم لأنه بالنسبة إلى ما بعده في الشدة كالرقاد. قال أبي بن كعب رضي الله عنه ومجاهد والحسن وقتادة ينامون نومة قبل البعث قال قتادة وذلك بين النفختين فلذلك يقولون من بعثنا من مرقدنا فإذا قالوا ذلك أجابهم المؤمنون - قاله غير واحد من السلف - \"هذا ما وعد الرحمن وصدق المرسلون\" وقال الحسن إنما يجيبهم بذلك الملائكةُ ولا منافاة إذ الجمع ممكن والله سبحانه وتعالى أعلم. وقال عبدالرحمن بن زيد: الجميع من قول الكفار \"يا ويلنا من بعثنا من مرقدنا هذا ما وعد الرحمن وصدق المرسلون\" نقله ابن جرير واختار الأول وهو أصح وذلك كقوله تبارك وتعالى في الصافات \"وقالوا يا ويلنا هذا يوم الدين هذا يوم الفصل الذي كنتم به تكذبون\" وقال الله عز وجل \"ويوم تقوم الساعة يقسم المجرمون ما لبثوا غير ساعة كذلك كانوا يؤفكون وقال الذين أوتوا العلم والإيمان لقد لبثتم فى كتاب الله إلى يوم البعث فهذا يوم البعث ولكنكم كنتم لا تعلمون\"."
    },
    {
      "ayah": 53,
      "surah": 36,
      "text": "وقوله تعالى: \"إن كانت إلا صيحة واحدة فإذا هم جميع لدينا محضرون\" كقوله عز وجل \"فإنما هي زجرة واحدة فإذا هم بالساهرة\" وقال جلت عظمته \"وما أمر الساعة إلا كلمح البصر أو هو أقرب\" وقال جل جلاله \"يوم يدعوكم فتستجيبون بحمده وتظنون إن لبثتم إلا قليلا\" أي إنما نأمرهم أمرا واحدا فإذا الجميع محضرون."
    },
    { "ayah": 54, "surah": 36, "text": "\"فاليوم لا تظلم نفس شيئا\" أي من عملها \"ولا تجزون إلا ما كنتم تعلمون\"." },
    {
      "ayah": 55,
      "surah": 36,
      "text": "يخبر تعالى عن أهل الجنة أنهم يوم القيامة إذا ارتحلوا من العرصات فنزلوا في روضات الجنات أنهم في شغل عن غيرهم بما هم فيه من النعيم المقيم والفوز العظيم قال الحسن البصري وإسماعيل بن أبي خالد في شغل عما فيه أهل النار من العذاب وقال مجاهد \"في شغل فاكهون\" أي في نعيم معجبون أي به وكذا قال قتادة وقال ابن عباس رضي الله عنهما فاكهون أي فرحون قال عبدالله بن مسعود وابن عباس رضي الله عنهما وسعيد بن المسيب وعكرمة والحسن وقتادة والأعمش وسليمان التيمي والأوزاعي في قوله تبارك وتعالى \"إن أصحاب الجنة اليوم في شغل فاكهون\" قالوا شغلهم افتضاض الأبكار وقال ابن عباس رضي الله عنهما في رواية عنه \"في شغل فاكهون\" أي بسماع الأوتار وقال أبو حاتم لعله غلط من المستمع وإنما هو افتضاض الأبكار."
    },
    {
      "ayah": 56,
      "surah": 36,
      "text": "وقوله عز وجل \"هم وأزواجهم\" قال مجاهد وحلائلهم \"في ظلال\" أي في ظلال الأشجار \"على الأرائك متكئون\" قال ابن عباس ومجاهد وعكرمة ومحمد بن كعب والحسن وقتادة والسدي وخصيف \"الأرائك\" هي السرر تحت الحجال \"قلت\" نظيره في الدنيا هذه التخوت تحت البشاخين والله سبحانه وتعالى أعلم."
    },
    {
      "ayah": 57,
      "surah": 36,
      "text": "وقوله عز وجل \"لهم فيها فاكهة\" أي من جميع أنواعها \"ولهم ما يدعون\" أي مهما طلبوا وجدوا من جميع أصناف الملاذ. قال ابن أبي حاتم حدثنا محمد بن عوف الحمصي حدثنا عثمان بن سعيد بن كثير بن دينار حدثنا محمد بن مهاجر عن الضحاك المعافري عن سليمان بن موسى حدثني كريب أنه سمع أسامة بن زيد رضي الله عنهما يقول: قال رسول الله صلى الله عليه وسلم \"ألا هل مشمر إلى الجنة؟ فإن الجنة لا خطر لها هي ورب الكعبة نور كلها يتلألأ وريحانة تهتز وقصر مشيد; ونهر مطرد وثمرة نضيجة وزوجة حسناء جميلة وحلل كثيرة ومقام في أبد في دار سلامة وفاكهة خضرة وخير ونعمة في محلة عالية بهية\" قالوا نعم يا رسول الله نحن المشمرون لها. قال صلى الله عليه وسلم \"قولوا إن شاء الله\" فقال القوم إن شاء الله وكذا رواه ابن ماجة في كتاب الزهد من سننه من حديث الوليد بن مسلم عن محمد بن مهاجر به."
    },
    {
      "ayah": 58,
      "surah": 36,
      "text": "وقوله تعالى: \"سلام قولا من رب رحيم\" قال ابن جريج قال ابن عباس رضي الله عنهما في قوله تعالى: \"سلام قولا من رب رحيم\" فإن الله تعالى نفسه سلام على أهل الجنة وهذا الذي قال ابن عباس رضي الله عنهما كقوله تعالى: \"تحيتهم يوم يلقونه سلام\". وقد روى ابن أبي حاتم ههنا حديثا وفي إسناده نظر فإنه قال: حدثنا موسى بن يوسف حدثنا محمد بن عبدالملك بن أبي الشوارب حدثنا أبو عاصم العبداني حدثنا الفضل الرقاشي عن محمد بن المنكدر عن جابر بن عبدالله رضي الله عنهما قال: قال رسول الله صلى الله عليه وسلم \"بينا أهل الجنة في نعيمهم إذ سطع عليهم نور فرفعوا رؤوسهم فإذا الرب تعالى قد أشرف عليهم من فوقهم فقال السلام عليكم يا أهل الجنة فذلك قوله تعالى: \"سلام قولا من رب رحيم\" قال فينظر إليهم وينظرون إليه فلا يلتفتون إلى شيء من النعيم ما داموا ينظرون إليه حتى يحتجب عنهم ويبقى نوره وبركته عليهم وفي ديارهم \"ورواه ابن ماجة في كتاب السنة من سننه عن محمد بن عبدالملك بن أبي الشوارب به. وقال ابن جرير حدثنا يونس بن عبدالأعلى أخبرنا ابن وهب حدثنا حرملة عن سليمان بن حميد قال سمعت محمد بن كعب القرظي يحدث عن عمر بن عبدالعزيز رضي الله عنه قال: إذا فرغ الله تعالى من أهل الجنة والنار أقبل في ظلل من الغمام والملائكة قال فيسلم على أهل الجنة فيردون عليه السلام قال القرظي وهذا في كتاب الله تعالى \"سلام قولا من رب رحيم\" فيقول الله عز وجل سلوني فيقولون ماذا نسألك أي رب؟ قال بلى سلوني قالوا نسألك أي رب رضاك قال رضائي أَحَلَّكم دار كرامتي قالوا يا رب فما الذي نسألك فوعزتك وجلالك وارتفاع مكانك لو قسمت علينا رزق الثقلين لأطعمناهم ولأسقيناهم ولألبسناهم ولأخدمناهم لا ينقصنا ذلك شيئا قال تعالى إن لدي مزيدا قال فيفعل ذلك بهم في درجهم حتى يستوي في مجلسه قال ثم تأتيهم التحف من الله عز وجل تحملها إليهم الملائكة ثم ذكر نحوه. وهذا خبر غريب أورده ابن جرير من طرق والله أعلم."
    },
    {
      "ayah": 59,
      "surah": 36,
      "text": "يقول تعالى مخبرا عما يؤول إليه حال الكفار يوم القيامة من أمره لهم أن يمتازوا بمعنى يميزون عن المؤمنين في موقفهم كقوله تعالى: \"ويوم نحشرهم جميعا ثم نقول للذين أشركوا مكانكم أنتم وشركاؤكم فزيلنا بينهم\" وقال عز وجل \"ويوم تقوم الساعة يومئذ يتفرقون\" \"يومئذ يصدعون\" أي يصيرون صدعين فرقتين \"احشروا الذين ظلموا وأزواجهم وما كانوا يعبدون من دون الله فاهدوهم إلى صراط الجحيم\"."
    },
    {
      "ayah": 6,
      "surah": 36,
      "text": "وقوله تعالى \"لتنذر قوما ما أنذر آباؤهم فهم غافلون\" يعني بهم العرب فإنه ما أتاهم من نذير من قبله وذكرهم وحدهم لا ينفي من عداهم كما أن ذكر بعض الأفراد لا ينفي العموم وقد تقدم ذكر الآيات والأحاديث المتواترة في عموم بعثته صلى الله عليه وسلم."
    },
    {
      "ayah": 60,
      "surah": 36,
      "text": "وقوله تعالى: \"ألم أعهد إليكم يا بني آدم أن لا تعبدوا الشيطان إنه لكم عدو مبين\" هذا تقريع من الله تعالى للكفرة من بني آدم الذين أطاعوا الشيطان وهو عدو لهم مبين وعصوا الرحمن وهو الذي خلقهم ورزقهم."
    },
    {
      "ayah": 61,
      "surah": 36,
      "text": "ولهذا قال تعالى: \"وأن اعبدوني هذا صراط مستقيم\" أي قد أمرتكم في دار الدنيا بعصيان الشيطان وأمرتكم بعبادتي وهذا هو الصراط المستقيم فسلكتم غير ذلك واتبعتم الشيطان فيما أمركم به."
    },
    {
      "ayah": 62,
      "surah": 36,
      "text": "ولهذا قال عز وجل \"ولقد أضل منكم جبلا كثيرا\" يقال جبلا بكسر الجيم وتشديد اللام ويقال جبلا بضم الجيم والباء وتخفيف اللام ومنهم من يسكن الباء والمراد بذلك الخلق الكثير قاله مجاهد وقتادة والسدي وسفيان بن عيينة. وقوله تعالى: \"أفلم تكونوا تعقلون\" أي أفما كان لكم عقل في مخالفة ربكم فيما أمركم به من عبادته وحده لا شريك له وعدو لكم إلى اتباع الشيطان. قال ابن جريج حدثنا كريب حدثنا عبدالرحمن بن محمد المحاربي عن إسماعيل بن رافع عمن حدثه عن محمد بن كعب القرظي عن أبي هريرة رضي الله عنه أن رسول الله صلى الله عليه وسلم قال \"إذا كان يوم القيامة أمر الله تعالى جهنم فيخرج منها عنق ساطع مظلم يقول \"ألم أعهد إليكم يا بني آدم أن لا تعبدوا الشيطان إنه لكم عدو مبين وأن اعبدوني هذا صراط مستقيم ولقد أضل منكم جبلا كثيرا أفلم تكونوا تعقلون هذه جهنم التي كنتم توعدون\" \"وامتازوا اليوم أيها المجرمون\" فيتميز الناس ويجثون وهي التي يقول الله عز وجل \"وترى كل أمة جاثية كل أمة تدعى إلى كتابها اليوم تجزون ما كنتم تعملون\"."
    },
    {
      "ayah": 63,
      "surah": 36,
      "text": "يقال للكفرة من بني آدم يوم القيامة وقد برزت الجحيم لهم تقريعا وتوبيخا\" هذه جهنم التي كنتم توعدون\" أي هذه التي حذرتكم الرسل فكذبتموهم."
    },
    {
      "ayah": 64,
      "surah": 36,
      "text": "\"اصلوها اليوم بما كنتم تكفرون\" كما قال تعالى: \"يوم يدعون إلى نار جهنم دعا هذه النار التي كنتم بها تكذبون أفسحر هذا أم أنتم لا تبصرون\"."
    },
    {
      "ayah": 65,
      "surah": 36,
      "text": "يكسبون. وقوله تعالى: \"اليوم نختم على أفواههم وتكلمنا أيديهم وتشهد أرجلهم بما كانوا يكسبون\" هذا حال الكفار والمنافقين يوم القيامة حين ينكرون ما اجترموه في الدنيا ويحلفون ما فعلوه فيختم الله على أفواههم ويستنطق جوارحهم بما عملت. قال ابن أبي حاتم حدثنا أبو شيبة إبراهيم بن عبدالله بن أبي شيبة حدثنا منجاب بن الحارث التميمي حدثنا أبو عامر الأزدي حدثنا سفيان عن عبيد المكتب عن الفضل بن عمرو عن الشعبي عن أنس بن مالك رضي الله عنه قال: كنا عند النبي صلى الله عليه وسلم فضحك حتى بدت نواجذه ثم قال صلى الله عليه وسلم \"أتدرون مم أضحك؟ \"قلنا الله ورسوله أعلم قال صلى الله عليه وسلم \"من مجادلة العبد ربه يوم القيامة يقول رب ألم تجرني من الظلم؟ فيقول بلى فيقول لا أجيز علي إلا شاهدا من نفسي فيقول كفى بنفسك اليوم عليك حسيبا وبالكرام الكاتبين شهودا فيختم على فيه ويقال لأركانه انطقي بعمله ثم يخلى بينه وبين الكلام فيقول بعدا لكن وسحقا فعنكن كنت أناضل\" وقد رواه مسلم والنسائي كلاهما عن أبي بكر بن أبي النضر عن أبي النضر عن عبيد الله بن عبدالرحمن الأشجعي عن سفيان هو الثوري به. ثم قال النسائي لا أعلم أحدا روى هذا الحديث عن سفيان غير الأشجعي وهو حديث غريب والله تعالى أعلم. كذا قال وقد تقدم من رواية أبي عامر عن عبدالملك بن عمرو الأسدي وهو العقدي عن سفيان وقال عبدالرزاق أخبرنا معمر عن بهز بن حكيم عن أبيه عن جده عن النبي صلى الله عليه وسلم قال \"إنكم تدعون مفدما على أفواهكم بالفدام فأول ما يسئل عن أحدكم فخذه وكتفه\" رواه النسائي عن محمد بن رافع عن عبدالرزاق به وقال سفيان بن عيينة عن سهيل عن أبيه عن أبي هريرة رضي الله عنه عن رسول الله صلى الله عليه وسلم في حديث القيامة الطويل قال فيه \"ثم يلقى الثالث فيقول ما أنت؟ فيقول أنا عبدك آمنت بك وبنبيك وبكتابك وصمت وصليت وتصدقت ويثني بخير ما استطاع - قال - فيقال له ألا نبعث عليك شاهدنا؟ - قال - فيفكر في نفسه من الذي يشهد عليه فيختم على فيه ويقال لفخذه انطقي - قال - فتنطق فخذه ولحمه وعظامه بما كان يعمل وذلك المنافق وذلك ليعذر من نفسه وذلك الذي يسخط الله تعالى عليه\" ورواه مسلم وأبو داود من حديث سفيان بن عيينة به بطوله ثم قال ابن أبي حاتم رحمه الله حدثنا أبي حدثنا هشام بن عمار حدثنا إسماعيل بن عياش حدثنا ضمضم بن زرعة عن شريح بن عبيد عن عقبة بن عامر رضي الله عنه أنه سمع رسول الله صلى الله عليه وسلم يقول \"إن أول عظم من الإنسان يتكلم يوم يختم على الأفواه فخذه من الرجل اليسرى\" وروى ابن جرير عن محمد بن عوف عن عبدالله بن المبارك عن إسماعيل بن عياش به مثله. وقد جود إسناده الإمام أحمد رحمه الله فقال حدثنا الحكم بن نافع حدثنا إسماعيل بن عياش عن ضمضم بن زرعة عن شريح بن عبيد الحضرمي عمن حدثه عن عقبة بن عامر رضي الله عنه أنه سمع رسول الله صلى الله عليه وسلم يقول \"إن أول عظم من الإنسان يتكلم يوم يختم على الأفواه فخذه من الرجل الشمال\" وقال ابن جرير حدثنا يعقوب بن إبراهيم حدثنا ابن علية حدثنا يونس بن عبيد عن حميد بن هلال قال: قال أبو بردة قال أبو موسى هو الأشعري رضي الله عنه يدعى المؤمن للحساب يوم القيامة فيعرض عليه ربه عمله فيما بينه وبينه فيعترف فيقول نعم أي رب عملت عملت عملت قال فيغفر الله تعالى له ذنوبه ويستره منها قال فما على الأرض خليقة ترى من تلك الذنوب شيئا وتبدو حسناته فود أن الناس كلهم يرونها ويدعى الكافر والمنافق للحساب فيعرض عليه ربه عمله فيجحد ويقول أي رب وعزتك لقد كتب على هذا الملك ما لم أعمل فيقول له الملك أما عملت كذا في يوم كذا في مكان كذا؟ فيقول لا وعزتك أي رب ما عملته فإذا فعل ذلك ختم الله تعالى على فيه قال أبو موسى الأشعري رضي الله عنه فإني أحسب أول ما ينطق منه الفخذ اليمنى ثم تلا \"اليوم نختم على أفواههم وتكلمنا أيديهم وتشهد أرجلهم بما كانوا يكسبون\"."
    },
    {
      "ayah": 66,
      "surah": 36,
      "text": "وقوله تبارك وتعالى: \"ولو نشاء لطمسنا على أعينهم فاستبقوا الصراط فأنى يبصرون\" قال علي بن أبي طلحة عن ابن عباس رضي الله عنهما في تفسيرها يقول ولو نشاء لأضللناهم عن الهدى فكيف يهتدون وقال مرة أعميناهم وقال الحسن البصري ولو شاء الله لطمس على أعينهم فجعلهم عميا يترددون وقال السدي يقول ولو نشاء أعمينا أبصارهم وقال مجاهد وأبو صالح وقتاده والسدي فاستبقوا الصراط يعني الطريق وقال ابن زيد يعني بالصراط ههنا فأنى يبصرون وقد طمسنا على أعينهم وقال العوفي عن ابن عباس رضي الله عنهما \"فأني يبصرون\" لا يبصرون الحق."
    },
    {
      "ayah": 67,
      "surah": 36,
      "text": "وقوله عز وجل \"ولو نشاء لمسخناهم على مكانتهم\" قال العوفي عن ابن عباس رضي الله عنهما أهلكناهم وقال السدي يعني لغيرنا خلقهم وقال أبو صالح لجعلناهم حجارة وقال الحسن البصري وقتادة لأقعدهم على أرجلهم ولهذا قال تبارك وتعالى \"فما استطاعوا مضيا\" أي إلى أمام \"ولا يرجعون\" إلى وراء بل يلزمون حالا واحدا لا يتقدمون ولا يتأخرون."
    },
    {
      "ayah": 68,
      "surah": 36,
      "text": "يخبر تعالى عن ابن آدم أنه كلما طال عمره رد إلى الضعف بعد القوة والعجز بعد النشاط كما قال تبارك وتعالى \"الله الذي خلقكم من ضعف ثم جعل من بعد ضعف قوة ثم جعل من بعد قوة ضعفا وشيبة يخلق ما يشاء وهو العليم القدير\" وقال عز وجل \"ومنكم من يرد إلى أرذل العمر لكيلا يعلم من بعد علم شيئا\" والمراد من هذا والله أعلم الإخبار عن هذه الدار بأنها دار زوال وانتقال لا دار دوام واستقرار ولهذا قال عز وجل \"أفلا يعقلون\" أي يتفكرون بعقولهم في ابتداء خلقهم ثم صيرورتهم إلى سن الشيبة ثم إلى الشيخوخة ليعلموا أنهم خلقوا لدار أخرى لا زوال لها ولا انتقال منها ولا محيد عنها وهي الدار الآخرة."
    },
    {
      "ayah": 69,
      "surah": 36,
      "text": "وقوله تبارك وتعالى \"وما علمناه الشعر وما ينبغي له\" يقول عز وجل مخبرا عن نبيه محمد صلى الله عليه وسلم أنه ما علمه الشعر \"وما ينبغي له\" أي ما هو في طبعه فلا يحسنه ولا يحبه ولا تقتضيه جبلته ولهذا ورد أنه صلى الله عليه وسلم كان لا يحفظ بيتا على وزن منتظم بل إن أنشده زحفه أو لم يتمه وقال أبو زرعة الرازي حدثنا إسماعيل بن مجالد عن أبيه عن الشعبي أنه قال: ما ولد عبدالمطلب ذكرا ولا أنثى إلا يقول الشعر إلا رسول الله صلى الله عليه وسلم ذكره ابن عساكر في ترجمة عتبة بن أبي لهب الذي أكله الأسد بالزرقاء قال ابن أبي حاتم حدثنا أبي حدثتا أبو سلمة حدثنا حماد بن سلمة عن علي بن زيد عن الحسن هو البصري قال إن رسول الله صلى الله عليه وسلم كان يتمثل بهذا البيت: كفى بالإسلام والشيب للمرء ناهيا فقال أبو بكر رضي الله عنه: يا رسول الله كفى الشيب والإسلام للمرء ناهيا قال أبو بكر أو عمر رضي الله عنهما أشهد أنك رسول الله يقول تعالى \"وما علمناه الشعر وما ينبغي له\" وهكذا روى البيهقي في الدلائل أن رسول الله صلى الله عليه وسلم قال للعباس بن مرداس السلمي رضي الله عنه \"أنت القائل: أتجعل نهبى ونهب العبيد بين الأقرع وعيينة. فقال إنما هو بين عيينة والأقرع فقال صلى الله عليه وسلم \"الكل سواء\" يعني في المعنى صلوات الله وسلامه عليه والله أعلم. وقد ذكر السهيلي في الروض الأنف لهذا التقديم والتأخير الذي وقع في كلامه صلى الله عليه وسلم في هذا البيت مناسبة أغرب فيها حاصلها شرف الأقرع بن حابس على عيينة بن بدر الفزاري لأنه ارتد أيام الصديق رضي الله عنه بخلاف ذاك والله أعلم وهكذا روى الأموي في مغازيه أن رسول الله صلى الله عليه وسلم جعل يمشي بين القتلى يوم بدر وهو يقول \"هاما\" فيقول الصديق رضي الله عنه متمما للبيت: من رجال أعزة علينا وهم كانوا أعق وأظلما وهذا لبعض شعراء العرب في قصيدة له وهي في الحماسة وقال الإمام أحمد حدثنا هشيم حدثنا مغيرة عن الشعبي عن عائشة رضي الله عنها قالت كان رسول الله صلى الله عليه وسلم إذا استراب الخبر تمثل فيه ببيت طرفة: ويأتيك بالأخبار من لم تزود وهكذا رواه النسائي في اليوم والليلة من طريق إبراهيم بن مهاجر عن الشعبي عنها. ورواه الترمذي والنسائي أيضا من حديث المقدام بن شريح بن هانئ عن أبيه عن عائشة رضي الله عنها كذلك ثم قال الترمذي هذا حديث حسن صحيح. وقال الحافظ أبو بكر البزار حدثنا يوسف بن موسى حدثنا أسامه عن زائدة عن سماك عن عكرمة عن ابن عباس رضي الله عنهما قال كان رسول الله صلى الله عليه وسلم يتمثل من الأشعار: ويأتيك بالأخبار من لم تزود ثم قال ورواه غير زائدة عن سماك عن عطية عن عائشة رضي الله عنها وهذا في شعر طرفه بن العبد في معلقته المشهورة وهذا المذكور عجز بيت منها أوله. ستبدي لك الأيام ما كنت جاهلا ويأتيك بالأخبار من لم تزود ويأتيك بالأخبار من لم تبع له بتاتا ولم تضرب له وقت موعد وقال سعيد بن عروة عن قتادة قيل لعائشة رضي الله عنها هل كان رسول الله صلى الله عليه وسلم يتمثل بشيء من الشعر؟ قالت رضي الله عنها: كان أبغض الحديث إليه غير أنه صلى الله عليه وسلم كان يتمثل ببيت أخي بني قيس فيجعل أوله آخره وآخره أوله فقال أبو بكر رضي الله عنه ليس هذا هكذا يا رسول الله فقال رسول الله صلى الله عليه وسلم \"إني والله ما أنا بشاعر وما ينبغي لي\" رواه ابن أبي حاتم وابن جرير وهذا لفظه وقال معمر عن قتادة بلغني أن عائشة رضي الله عنها سئلت هل كان رسول الله صلى الله عليه وسلم يتمثل بشيء من الشعر؟ فقالت رضي الله عنها: لا إلا بيت طرفة ستبدي لك الأيام ما كنت جاهلا ويأتيك بالأخبار ما لم تزود فجعل صلى الله عليه وسلم يقول \"من لم تزود بالأخبار\" فقال أبو بكر ليس هذا هكذا فقال صلى الله عليه وسلم \"إني لست بشاعر ولا ينبغي لي\" وقال الحافظ أبو بكر البيهقي أخبرنا أبو عبدالحافظ حدثنا أبو حفص عمر بن أحمد بن نعيم وكيل المتقي ببغداد حدثنا أبو محمد عبدالله بن هلال النحوي الضرير حدثنا علي بن عمرو الأنصاري حدثنا سفيان بن عيينة عن الزهري عن عروة عن عائشة رضي الله عنها قالت: ما جمع رسول الله صلى الله عليه وسلم بيت شعر قط إلا بيتا واحدا. تفاءل بما تهوى يكن فلقلما يقال لشيء ما كان إلا تحققا سألت شيخنا الحافظ أبا الحجاج المزي عن هذا الحديث فقال هو منكر ولم يعرف شيخ الحاكم ولا الضرير وثبت في الصحيح أنه صلى الله عليه وسلم تمثل يوم حفر الخندق بأبيات عبدالله بن رواحة رضي الله عنه ولكن تبعا لقول أصحابه رضي الله عنهم فإنهم يرتجزون وهم يحفرون فيقولون. اللهم لولا أنت ما أهتدينا ولا تصدقنا ولا صلينا فأنزلن سكينة علــــــينا وثبت الأقدام إن لاقينا إن الألى قد بغوا علـــينا إذا أرادوا فتنة أبينا ويرفع صلى الله عليه وسلم بقوله أبينا ويمدها وقد روى هذا بزحاف في الصحيحين أيضا وكذا ثبت أنه صلى الله عليه وسلم قال يوم حنين وهو راكب البغلة يقدم بها في نحور العدو: أنا النبي لا كذب أنا ابن عبدالمطلب لكن قالوا هذا وقع اتفاقا من غير قصد لوزن شعر بل جرى على اللسان من غير قصد إليه وكذلك ما ثبت في الصحيحين عن جندب بن عبدالله رضي الله عنه قال كنا مع رسول الله صلى الله عليه وسلم في غار فنكبت أصبعه فقال صلى الله عليه وسلم: هل أنت إلا أصبع دميت وفي سبيل الله ما لقيت وسيأتي عند قوله تعالى \"إلا اللمم\" إنشاد إن تغفر اللهم تغفـر جما وأي عبد لك ما ألما وكل هذا لا ينافي كونه صلى الله عليه وسلم ما علم شعرا ولا ينبغي له فإن الله تعالى إنما علمه القرآن العظيم \"الذي لا يأتيه الباطل من بين يديه ولا من خلفه تنزيل من حكيم حميد\" وليس هو بشعر كما زعمه طائفة من جهلة كفار قريش ولا كهانة ولا مفتعل ولا سحر يؤثر كما تنوعت فيه أقوال الضلال وآراء الجهال وقد كانت سجيته صلى الله عليه وسلم تأبى صناعة الشعر طبعا وشرعا كما رواه أبو داود قال حدثنا عبيد الله بن عمرو حدثنا عبدالله بن يزيد حدثنا سعيد بن أبي أيوب حدثنا شرحبيل بن يزيد المعافري عن عبدالرحمن بن رافع التنوخي قال سمعت عبدالله بن عمرو رضي الله عنهما يقول سمعت رسول الله صلى الله عليه وسلم يقول \"ما أبالي ما أوتيت إن أنا شربت ترياقا أو تعلقت تميمة أو قلت الشعر من قبل نفسي\" تفرد به أبو داود وقال الإمام أحمد رحمه الله حدثنا عبدالرحمن بن مهدي عن الأسود بن شيبان عن أبي نوفل قال سألت عائشة رضي الله عنها هل كان رسول الله صلى الله عليه وسلم بسائغ عنده الشعر؟ فقالت قد كان أبغض الحديث إليه وقال عن عائشة رضي الله عنها كان رسول الله صلى الله عليه وسلم يعجبه الجوامع من الدعاء ويدع ما بين ذلك وقال أبو داود حدثنا أبو الوليد الطيالسي حدثنا شعبة عن الأعمش عن أبي صالح عن أبي هريرة رضي الله عنه عن النبي صلى الله عليه وسلم \"لأن يمتلئ جوف أحدكم قيحا خير له من أن يمتلئ شعرا\" انفرد به من هذا الوجه وإسناده على شرط الشيخين ولم يخرجاه. وقال الإمام أحمد حدثنا قزعة بن سويد الباهلي عن عاصم بن مخلد عن أبي الأشعث الصنعاني ح وحدثنا الأشيب فقال عن أبي عاصم عن أبي الأشعث عن شداد بن أوس رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم \"من قرض بيت شعر بعد العشاء الآخرة لم تقبل له صلاة تلك الليلة\" وهذا حديث غريب من هذا الوجه ولم يخرجه أحد من أصحاب الكتب الستة والمراد بذلك نظمه لا إنشاده والله أعلم على أن الشعر فيه ما هو مشروع وهو هجاء المشركين الذي كان يتعاطاه شعراء الإسلام كحسان بن ثابت رضي الله عنه وكعب بن مالك وعبدالله بن رواحة وأمثالهم وأضرابهم رضي الله عنهم أجمعين ومنه ما فيه حكم ومواعظ وآداب كما يوجد في شعر جماعة من الجاهلية ومنهم أمية بن أبي الصلت الذي قال فيه رسول الله صلى الله عليه وسلم \"آمن شعره وكفر قلبه\" وقد أنشد بعض الصحابة رضي الله عنهم للنبي صلى الله عليه وسلم مائة بيت يقول صلى الله عليه وسلم عقب كل بيت \"هيه\" يعني يستطعمه فيزيده من ذلك وقد روى أبو داود من حديث أبي بن كعب وبريدة بن الحصيب وعبدالله بن عباس رضي الله عنهم أن رسول الله صلى الله عليه وسلم قال \"إن من البيان سحرا وإن من الشعر حكما\" ولهذا قال \"وما علمناه الشعر\" يعني محمدا صلى الله عليه وسلم ما علمه الله الشعر \"وما ينبغي له\" أي وما يصلح له \"إن هو إلا ذكر وقرآن مبين\" أي ما هذا الذي علمناه \"إلا ذكر وقرآن مبين\" أي بين واضح جلي لمن تأمله وتدبره."
    },
    {
      "ayah": 7,
      "surah": 36,
      "text": "قوله تعالى: \"قل يا أيها الناس إني رسول الله إليكم جميعا\". وقوله تعالى \"لقد حق القول على أكثرهم\" قال ابن جرير لقد وجب العذاب على أكثرهم بأن الله تعالى قد حتم عليهم في أم الكتاب أنهم لا يؤمنون \"فهم لا يؤمنون\" بالله ولا يصدقون رسله."
    },
    {
      "ayah": 70,
      "surah": 36,
      "text": "ولهذا قال تعالى: \"لينذر من كان حيا\" أي لينذر هذا القرآن المبين كل حي على وجه الأرض كقوله \"لأنذركم به ومن بلغ\" وقال جل وعلا \"ومن يكفر به من الأحزاب فالنار موعده\" وإنما ينتفع بنذارته من هو حي القلب مستنير البصيرة كما قال قتادة حي القلب حي البصر وقال الضحاك يعني عاقلا \"ويحق القول على الكافرين\" أي هو رحمة للمؤمنين وحجة على الكافرين."
    },
    {
      "ayah": 71,
      "surah": 36,
      "text": "يذكر تعالى ما أنعم به على خلقه من هذه الأنعام التي سخرها لهم \"فهم لها مالكون\" قال قتادة مطيقون أي جعلهم يقهرونها وهي ذليلة لهم لا تمتنع منهم بل لو جاء صغير إلى بعير لأناخه ولو شاء لأقامه وساقه وذاك ذليل منقاد معه وكذا لو كان القطار مائة بعير أو أكثر لسار الجميع بسير الصغير."
    },
    {
      "ayah": 72,
      "surah": 36,
      "text": "وقوله تعالى: \"فمنها ركوبهم ومنها يأكلون\" أي منها ما يركبون في الأسفار ويحملون عليه الأثقال إلى سائر الجهات والأقطار \"ومنها يأكلون\" إذا شاءوا نحروا واجتزروا."
    },
    {
      "ayah": 73,
      "surah": 36,
      "text": "\"ولهم فيها منافع\" أي من أصوافها وأوبارها وأشعارها أثاثا ومتاعا إلى حين \"ومشارب\" أي من ألبانها وأبوالها لمن يتداوى ونحو ذلك \"أفلا يشكرون\" أي أفلا يوحدون خالق ذلك ومسخره ولا يشركون به غيره؟."
    },
    {
      "ayah": 74,
      "surah": 36,
      "text": "يقول تعالى منكرا على المشركين في اتخاذهم الأنداد آلهة مع الله يبتغون بذلك أن تنصرهم تلك الآلهة وترزقهم وتقربهم إلى الله زلفى."
    },
    {
      "ayah": 75,
      "surah": 36,
      "text": "قال الله تعالى: \"لا يسطيعون نصرهم\" أي لا تقدر الآلهة على نصر عابديها بل هي أضعف من ذلك وأقل وأذل وأحقر وأدحر بل لا تقدر على الاستنصار لأنفسها ولا الانتقام ممن أرادها بسوء لأنها جماد لا تسمع ولا تعقل وقوله تبارك وتعالى: \"وهم لهم جند محضرون\" قال مجاهد يعني عند الحساب يريد أن هذه الأصنام محشورة مجموعة يوم القيامة محضرة عند حساب عابديها ليكون ذلك أبلغ في حزنهم وأدل عليهم في إقامة الحجة عليهم وقال قتادة \"لا يستطيعون نصرهم\" يعني الآلهة \"وهم لهم جند محضرون\" والمشركون يغضبون للآلهة في الدنيا وهي لا تسوق إليهم خيرا ولا تدفع عنهم شرا إنما هي أصنام وهكذا قال الحسن البصري وهذا القول حسن وهو اختيار ابن جرير رحمه الله تعالى."
    },
    {
      "ayah": 76,
      "surah": 36,
      "text": "وقوله تعالى: \"فلا يحزنك قولهم\" أي تكذيبهم لك وكفرهم بالله \"إنا نعلم ما يسرون وما يعلنون\" أي نحن نعلم جميع ما هم فيه وسنجزيهم وصفهم ونعاملهم على ذلك يوم لا يفقدون من أعمالهم جليلا ولا حقيرا ولا صغيرا ولا كبيرا بل يعرض عليهم جميع ما كانوا يعملون قديما وحديثا."
    },
    {
      "ayah": 77,
      "surah": 36,
      "text": "قال مجاهد وعكرمة وعروة بن الزبير والسدي وقتادة جاء أبي بن خلف لعنه الله إلى رسول الله صلى الله عليه وسلم وفي يده عظم رميم وهو يفته ويذروه في الهواء وهو يقول يا محمد أتزعم أن الله يبعث هذا؟ قال صلى الله عليه وسلم \"نعم يميتك الله تعالى ثم يبعثك ثم يحشرك إلى النار\" ونزلت هذه الآيات من آخر يس \"أو لم ير الإنسان أنا خلقناه من نطفة\" إلى آخرهن وقال ابن أبي حاتم حدثنا علي بن الحسين بن الجنيد حدثنا محمد بن العلاء حدثنا عثمان بن سعيد الزيات عن هشيم عن أبي بشر عن سعيد بن جبير عن ابن عباس رضي الله عنهما قال: إن العاص بن وائل أخذ عظما من البطحاء ففته بيده ثم قال لرسول الله صلى الله عليه وسلم أيحيي الله هذا بعد ما أرى؟ فقال رسول الله صلى الله عليه وسلم \"نعم يميتك الله ثم يحييك ثم يدخلك جهنم\" قال فنزلت الآيات من آخر يس ورواه ابن جرير عن يعقوب بن إبراهيم عن هشيم عن أبي بشر عن سعيد بن جبير فذكره ولم يذكر ابن عباس رضي الله عنهما وروى من طريق العوفي عن ابن عباس رضي الله عنهما قال: جاء عبدالله بن أبي بعظم ففته وذكر نحو ما تقدم وهذا منكر لأن السورة مكية وعبدالله بن أبي بن سلول إنما كان بالمدينة وعلى كل تقدير سواء كانت هذه الآيات قد نزلت في أبي بن خلف أو العاص بن وائل أو فيهما فهي عامة في كل من أنكر البعث والألف واللام في قوله تعالى: \"أو لم ير الإنسان\" للجنس يعم كل منكر للبعث \"أنا خلقناه من نطفة فإذا هو خصيم مبين\" أي أو لم يستدل من أنكر البعث بالبدء على الإعادة فإن الله ابتدأ خلق الإنسان من سلالة من ماء مهين فخلقه من شيء حقير ضعيف مهين كما قال عز وجل \"ألم نخلقكم من ماء مهين فجعلناه في قرار مكين إلى قدر معلوم\" وقال تعالى: \"إنا خلقنا الإنسان من نطفة أمشاج\" أي من نطفة من أخلاط متفرقة فالذي خلقه من هذه النطفة الضعيفة أليس بقادر على إعادته بعد موته كما قال الإمام أحمد في مسنده حدثنا أبو المغيرة حدثنا جرير حدثني عبدالرحمن بن ميسرة عن جبير بن نفير عن بشر بن جحاش قال إن رسول الله صلى الله عليه وسلم بصق يوما في كفه فوضع عليها أصبعه ثم قال رسول الله صلى الله عليه وسلم \"قال الله تعالى بني آدم أنى تعجزني وقد خلقتك من مثل هذه حتى إذا سويتك وعدلتك مشيت بين برديك وللأرض منك وئيد فجمعت ومنعت حتى إذا بلغت التراقي قلت أتصدق وأنى أوان الصدقة؟\" ورواه ابن ماجه عن أبي بكر بن أبي شيبة عن يزيد بن هارون عن جرير بن عثمان به."
    },
    {
      "ayah": 78,
      "surah": 36,
      "text": "ولهذا قال تعالى: \"وضرب لنا مثلا ونسي خلقه قال من يحيي العظام وهي رميم\" أي استبعد إعادة الله تعالى ذي القدرة العظيمة التي خلقت السموات والأرض للأجساد والعظام الرميمة ونسي نفسه وأن الله تعالى خلقه من العدم إلى الوجود فعلم من نفسه ما هو أعظم مما استبعده وأنكره وجحده."
    },
    {
      "ayah": 79,
      "surah": 36,
      "text": "ولهذا قال عز وجل \"قل يحييها الذي أنشأها أول مرة وهو بكل خلق عليم\" أي يعلم العظام في سائر أقطار الأرض وأرجائها أين ذهبت وأين تفرقت وتمزقت قال الإمام أحمد حدثنا عفان حدثنا أبو عوانة عن عبدالملك بن عمير عن ربعي قال: قال عقبة بن عمرو لحذيفة رضي الله عنهما ألا تحدثنا ما سمعت من رسول الله صلى الله عليه وسلم فقال سمعته صلى الله عليه وسلم يقول \"إن رجلا حضره الموت فلما يئس من الحياة أوصى أهله إذا أنا مت فاجمعوا لي حطبا كثيرا جزلا ثم أوقدوا فيه نارا حتى إذا أكلت لحمي وخلصت إلى عظمي فامتحشت فخذوها فدقوها فذروها في اليم ففعلوا فجمعه الله تعالى إليه ثم قال له لم فعلت ذلك؟ قال من خشيتك فغفر الله عز وجل له\" فقال عقبة بن عمرو: وأنا سمعته صلى الله عليه وسلم يقول ذلك وكان نباشا وقد أخرجاه في الصحيحين من حديث عبد الملك بن عمير بألفاظ كثيرة منها أنه أمر بنيه أن يحرقوه ثم يسحقوه ثم يذروا نصفه في البر ونصفه في البحر في يوم رائح أي كثير الهواء ففعلوا ذلك فأمر الله تعالى البحر فجمع ما فيه وأمر البر فجمع ما فيه ثم قال له كن فإذا هو رجل قائم فقال له ما حملك على ما صنعت؟ قال: مخافتك وأنت أعلم; فما تلافاه أن غفر له."
    },
    {
      "ayah": 8,
      "surah": 36,
      "text": "يقول تعالى إنا جعلنا هؤلاء المحتوم عليهم بالشقاء نسبتهم إلى الوصول إلى الهدى كنسبة من جعل في عنقه غل فجمع يديه مع عنقه تحت ذقنه فارتفع رأسه فصار مقمحا ولهذا قال تعالى \"فهم مقمحون\" والمقمح هو الرافع رأسه كما قالت أم زرع في كلامها: وأشرب فأتقمح; أي أشرب فأروي وأرفع رأسي تهنيئا وترويا واكتفى بذكر الغل في العنق عن ذكر اليدين وإن كانتا مرادتين كما قال الشاعر: فما أدري إذا يممت أرضا أريد الخير أيــهما يليني أألخير الذي أنا ابتغيه أم الشـر الذي لا يأتليني فاكتفى بذكر الخير عن ذكر الشر لما دل الكلام والسياق عليه. وهكذا هذا لما كان الغل إنما يعرف فيما جمع اليدين مع العنق اكتفى بذكر العنق عن اليدين قال العوفي عن ابن عباس رضي الله عنهما في قوله تعالى \"إنا جعلنا في أعناقهم أغلالا فهي إلى الأذقان فهم مقمحون\" قال هو كقوله عز وجل \"ولا تجعل يدك مغلولة إلى عنقك\" يعني بذلك أن أيديهم موثقة إلى أعناقهم لا يستطيعون أن يبسطوها بخير. وقال مجاهد \"فهم مقمحون\" قال رافعي رؤوسهم وأيديهم موضوعة على أفواههم فهم مغلولون عن كل خير."
    },
    {
      "ayah": 80,
      "surah": 36,
      "text": "وقوله تعالى: \"الذي جعل لكم من الشجر الأخضر نارا فإذا أنتم منه توقدون\" أي الذي بدأ خلق هذا الشجر من ماء حتى صار خضرا نضرا ذا ثمر وينع ثم أعاده إلى أن صار حطبا يابسا توقد به النار كذلك هو فعال لما يشاء قادر على ما يريد لا يمنعه شيء قال قتادة في قوله \"الذي جعل لكم من الشجر الأخضر نارا فإذا أنتم منه توقدون\" يقول الذي أخرج هذه النار من هذا الشجر قادر على أن يبعثه وقيل المراد بذلك شجر المرخ والعفار ينبت في أرض الحجاز فيأتي من أراد قدح نار وليس معه زناد فيأخذ منه عودين أخضرين ويقدح أحدهما بالآخر فتتولد النار من بينهما كالزناد سواء وروي هذا عن ابن عباس رضي الله عنهما وفي المثل: لكل شجر نار واستمجد المرخ والغفار وقال الحكماء في كل شجر نار إلا العناب."
    },
    {
      "ayah": 81,
      "surah": 36,
      "text": "يقول تعالى مخبرا منبها على قدرته العظيمة في خلق السموات السبع بما فيها من الكواكب السيارة والثوابت والأرضين السبع وما فيها من جبال ورمال وبحار وقفار وما بين ذلك ومرشدا إلى الاستدلال على إعادة الأجساد بخلق هذه الأشياء العظيمة كقوله تعالى: \"لخلق السموات والأرض أكبر من خلق الناس\" وقال عز وجل ههنا \"أو ليس الذي خلق السموات والأرض بقادر على أن يخلق مثلهم\" أي مثل البشر فيعيدهم كما بدأهم قاله ابن جرير وهذه الآية الكريمة كقوله عز وجل \"أو لم يروا أن الله الذي خلق السموات والأرض ولم يعي بخلقهن بقادر على أن يحيي الموتى بلى إنه على كل شيء قدير\"."
    },
    {
      "ayah": 82,
      "surah": 36,
      "text": "وقال تبارك وتعالى ههنا \"بلى وهو الخلاق العليم إنما أمره إذا أراد شيئا أن يقول له كن فيكون\" أي إنما يأمر بالشيء أمرا واحدا لا يحتاج إلى تكرار وتأكيد. إذا ما أراد الله أمرا فإنما يقول له كن قوله فيكون وقال الإمام أحمد حدثنا محمد بن نمير حدثنا موسى بن المسيب عن شهر عن عبدالرحمن عن أبي ذر رضي الله عنه قال إن رسول الله صلى الله عليه وسلم قال \"إن الله تعالى يقول يا عبادي كلكم مذنب إلا من عافيت فاستغفروني أغفر لكم وكلكم فقير إلا من أغنيت إني جواد ماجد واجد أفعل ما أشاء عطائي كلام وعذابي كلام إذا أردت شيئا فإنما أقول له كن فيكون\"."
    },
    {
      "ayah": 83,
      "surah": 36,
      "text": "وقوله تعالى: \"فسبحان الذي بيده ملكوت كل شي وإليه ترجعون\" أي تنزيه وتقديس وتبرئة من السوء للحي القيوم الذي بيده مقاليد السموات والأرض وإليه رجع الأمر كله وله الخلق والأمر وإليه يرجع العباد يوم المعاد فيجازي كل عامل بعمله وهو العادل المنعم المتفضل. ومعنى قوله سبحانه وتعالى \"فسبحان الذي بيده ملكوت كل شيء\" كقوله عز وجل \"قل من بيده ملكوت كل شيء\" وكقوله تعالى: \"تبارك الذي بيده الملك\" فالملك والملكوت واحد في المعنى كرحمة ورحموت ورهبة ورهبوت وجبر وجبروت ومن الناس من زعم أن الملك هو عالم الأجسام والملكوت هو عالم الأرواح والصحيح الأول وهو الذي عليه الجمهور من المفسرين وغيرهم. قال الإمام أحمد حدثنا شريح بن النعمان حدثنا حماد عن عبدالملك بن عمير حدثني ابن عم لحذيفة عن حذيفة رضي الله عنه قال: قمت مع رسول الله صلى الله عليه وسلم ذات ليلة فقرأ السبع الطوال في سبع ركعات وكان صلى الله عليه وسلم إذا رفع رأسه من الركوع قال \"سمع الله لمن حمده - ثم قال - الحمد لله ذي الملكوت والجبروت والكبرياء والعظمة\" وكان ركوعه مثل قيامه وسجوده مثل ركوعه فانصرف وقد كادت تنكسر رجلاي. وقد روى أبو داود والترمذي في الشمائل والنسائي من حديث شعبة عن عمرو بن مرة عن أبي حمزة مولى الأنصار عن رجل من بني عبس عن حذيفة رضي الله عنه أنه رأى رسول الله صلى الله عليه وسلم يصلي من الليل وكان يقول \"الله أكبر - ثلاثا - ذي الملكوت والجبروت والكبرياء والعظمة\" ثم استفتح فقرأ البقرة ثم ركع فكان ركوعه نحوا من قيامه وكان يقول في ركوعه \"سبحان ربي العظيم\" ثم رفع رأسه من الركوع فكان قيامه نحوا من ركوعه وكان يقول في قيامه \"لربي الحمد\" ثم سجد فكان سجوده نحوا من قيامه وكان يقول في سجوده \"سبحان ربي الأعلى\" ثم رفع رأسه من السجود وكان يقعد فيما بين السجدتين نحوا من سجوده وكان يقول \"رب اغفر لي رب اغفر لي\" فصلى أربع ركعات فقرأ فيهن البقرة وآل عمران والنساء والمائدة أو الأنعام - شك شعبة - هذا لفظ أبي داود. وقال النسائي: أبو حمزة عندنا طلحة بن يزيد وهذا الرجل يشبه أن يكون صلة كذا قال: والأشبه أن يكون ابن عم حذيفة كما تقدم في رواية الإمام أحمد والله أعلم. وأما رواية صلة بن زفر عن حذيفة رضي الله عنه فإنها في صحيح مسلم ولكن ليس فيها الملكوت والجبروت والكبرياء والعظمة. وقال أبو داود حدثنا أحمد بن صالح حدثنا ابن وهب حدثني معاوية بن صالح عن عمرو بن قيس عن عاصم بن حميد عن عوف بن مالك الأشجعي رضي الله عنه قال: قمت مع رسول الله صلى الله عليه وسلم الله ليلة فقام فقرأ سورة البقرة لا يمر بآية رحمة إلا وقف وسأل ولا يمر بآية عذاب إلا وقف وتعوذ قال ثم ركع بقدر قيامه يقول في ركوعه \"سبحان ذي الجبروت والملكوت والكبرياء والعظمة\" ثم سجد بقدر قيامه ثم قال في سجوده مثل ذلك ثم قام فقرأ بآل عمران ثم قرأ سورة سورة ورواه الترمذي في الشمائل والنسائي من حديث معاوية بن صالح به. آخر تفسير سورة يس ولله الحمد والمنة."
    },
    {
      "ayah": 9,
      "surah": 36,
      "text": "وقوله تعالى \"وجعلنا من بين أيديهم سدا\" قال مجاهد عن الحق \"ومن خلفهم سدا\" قال مجاهد: عن الحق فهم مترددون. وقال قتادة في الضلالات وقوله تعالى \"فأغشيناهم\" أي أغشينا أبصارهم عن الحق \"فهم لا يبصرون\" أي لا ينتفعون بخير ولا يهتدون إليه قال ابن جرير: وروي عن ابن عباس رضي الله عنهما أنه كان يقرأ \"قأغشيناهم\" بالعين المهملة من العشا وهو داء في العين وقال عبدالرحمن بن زيد بن أسلم: جعل الله تعالى هذا السد بينهم وبين الإسلام والإيمان فهم لا يخلصون إليه وقرأ \"إن الذين حقت عليهم كلمة ربك لا يؤمنون ولو جاءتهم كل آية حتى يروا العذاب الأليم\" ثم قال: من منعه الله تعالى لا يستطيع. وقال عكرمة قال أبو جهل لئن رأيت محمدا لأفعلن ولأفعلن فأنزلت \"إنا جعلنا في أعناقهم أغلالا - إلى قوله - فهم لا يبصرون\" قال وكانوا يقولون هذا محمد فيقول أين هو أين هو؟ لا يبصره رواه ابن جرير; وقال محمد بن إسحاق حدثني يزيد بن زياد عن محمد بن كعب قال: قال أبو جهل وهم جلوس إن محمدا يزعم أنكم إن تابعتموه كنتم ملوكا فإذا متم بعثتم بعد موتكم وكانت لكم جنان خير من جنان الأردن وأنكم إن خالفتموه كان لكم منه ذبح ثم بعثتم بعد موتكم وكانت لكم نار تعذبون بها وخرج عليهم رسول الله صلى الله عليه وسلم عند ذلك وفي يده حفنة من تراب وقد أخذ الله تعالى على أعينهم دونه فجعل يذرها على رؤوسهم ويقرأ \"يس والقرآن الحكيم - حتى انتهى إلى قوله تعالى - وجعلنا من بين أيديهم سدا ومن خلفهم سدا فأغشيناهم فهم لا يبصرون\" وانطلق رسول الله صلى الله عليه وسلم لحاجته وباتوا رصداء على بابه حتى خرج عليهم بعد ذلك خارج من الدار فقال مالكم ؟ قالوا ننتظر محمدا قال قد خرج عليكم فما بقي منكم من رجل إلا وضع على رأسه ترابا ثم ذهب لحاجته فجعل كل رجل منهم ينفض ما على رأسه من التراب. قال وقد بلغ النبي صلى الله عليه وسلم قول أبي جهل فقال: \"وأنا أقول ذلك إن لهم مني لذبحا وإنه لآخذهم\" وقوله تبارك وتعالى."
    }
  ]
}
