{
  "ayahs": [
    {
      "ayah": 1,
      "surah": 37,
      "text": "سورة الصافات: قال النسائي: أخبرنا إسماعيل بن مسعود حدثنا خالد يعني ابن الحارث - عن أبي ذئب قال أخبرنا الحارث بن عبد الرحمن عن سالم بن عبدالله عن عبدالله بن عمر رضي الله عنهما قال: كان رسول الله صلى الله عليه وسلم يأمرنا بالتخفيف ويؤمنا بالصافات تفرد به النسائي. بسم الله الرحمن الرحيم قال سفيان الثوري عن الأعمش عن أبي الضحى عن مسروق عن عبدالله بن مسعود رضي الله عنه أنه قال \"والصافات صفا\" وهي الملائكة."
    },
    {
      "ayah": 10,
      "surah": 37,
      "text": "وقوله تبارك وتعالى \"إلا من خطف الخطفة\" أي إلا من اختطف من الشياطين الخطفة وهي الكلمة يسمعها من السماء فيلقيها إلى الذي تحته ويلقيها الآخر إلى الذي تحته فربما أدركه الشهاب قبل أن يلقيها وربما ألقاها بقدر الله تعالى قبل أن يأتيه الشهاب فيحرقه فيذهب بها الآخر إلى الكاهن كما تقدم في الحديث ولهذا قال \"إلا من خطف الخطفة فأتبعه شهاب ثاقب\" أي مستنير قال ابن جرير حدثنا أبو كريب حدثنا وكيع عن إسرائيل عن أبي إسحاق عن سعيد بن جبير عن ابن عباس رضي الله عنهما قال: كان للشياطين مقاعد في السماء قال فكانوا يستمعون الوحي قال وكانت النجوم لا تجري وكانت الشياطين لا ترمى قال فإذا سمعوا الوحي نزلوا إلى الأرض فزادوا في الكلمة تسعا قال فلما بعث رسول الله صلى الله عليه وسلم جعل الشيطان إذا قعد مقعده جاءه شهاب فلم يخطئه حتى يحرقه قال فشكوا ذلك إلى إبليس لعنه الله فقال ما هو إلا من أمر حدث قال فبعث جنوده فإذا رسول الله صلى الله عليه وسلم قائم يصلي بين جبلي نخلة قال وكيع يعني بطن نخلة قال فرجعوا إلى إبليس فأخبروه فقال هذا الذي حدث وستأتي إن شاء الله تعالى الأحاديث الواردة مع الآثار في هذا المعنى عند قوله تعالى إخبارا عن الجن أنهم قالوا \"وأنا لمسنا السماء فوجدناها ملئت حرسا شديدا وشهبا وأنا كنا نقعد منها مقاعد للسمع فمن يستمع الآن يجد له شهابا رصدا وأنا لا ندري أشر أريد بمن في الأرض أم أراد بهم ربهم رشدا\"."
    },
    {
      "ayah": 100,
      "surah": 37,
      "text": "يقول تعالى مخبرا عن خليله إبراهيم عليه الصلاة والسلام إنه بعدما نصره الله تعالى على قومه وأيس من إيمانهم بعدما شاهدوا من الآيات العظيمة هاجر من بين أظهرهم وقال \"إني ذاهب إلى ربي سيهدين رب هب لي من الصالحين\" يعني أولادا مطيعين يكونون عوضا من قومه وعشيرته الذين فارقهم."
    },
    {
      "ayah": 101,
      "surah": 37,
      "text": "وهذا الغلام هو إسماعيل عليه السلام فإنه أول ولد بشر به إبراهيم عليه السلام وهو أكبر من إسحاق باتفاق المسلمين وأهل الكتاب بل في نص كتابهم أن إسماعيل عليه السلام ولد ولإبراهيم عليه السلام ست وثمانون سنة وولد إسحاق وعمر إبراهيم عليه الصلاة والسلام تسع وتسعون سنة وعندهم أن الله تبارك وتعالى أمر إبراهيم أن يذبح ابنه وحيده وفي نسخة أخرى بكره فأقحموا ههنا كذبا وبهتانا إسحاق ولا يجوز هذا لأنه مخالف لنص كتابهم وإنما أقحموا إسحاق لأنه أبوهم وإسماعيل أبو العرب فحسدوهم فزادوا ذلك وحرفوا وحيدك بمعنى الذي ليس عندك غيره فإن إسماعيل كان ذهب به وبأمه إلى مكة وهو تأويل وتحريف باطل فإنه لا يقال وحيدك إلا لمن ليس له غيره وأيضا فإن أول ولد له معزة ما ليس لمن بعده من الأولاد فالأمر بذبحه أبلغ في الابتلاء والاختبار وقد ذهب جماعة من أهل العلم إلى أن الذبيح هو إسحاق وحكي ذلك عن طائفة من السلف حتى نقل عن بعض الصحابة رضي الله عنهم أيضا وليس ذلك في كتاب ولا سنة وما أظن ذلك تلقي إلا عن أحبار أهل الكتاب وأخذ ذلك مسلما من غير حجة وهذا كتاب الله شاهد ومرشد إلى أنه إسماعيل فإنه ذكر البشارة بغلام حليم وذكر أنه الذبيح ثم قال بعد ذلك \"وبشرناه بإسحاق نبيا من الصالحين\" ولما بشرت الملائكة إبراهيم بإسحاق قالوا \"إنا نبشرك بغلام عليم\". وقال تعالى \"فبشرناها بإسحاق ومن وراء إسحاق يعقوب\" أي يولد له في حياتهما ولد يسمى يعقوب فيكون من ذريته عقب ونسل وقد قدمنا هناك أنه لا يجوز بعد هذا أن يؤمر بذبحه وهو صغير لأن الله تعالى قد وعدهما بأنه سيعقب ويكون له نسل فكيف يمكن بعد هذا أن يؤمر بذبحه صغيرا وإسماعيل وصف ههنا بالحليم لأنه مناسب لهذا المقام."
    },
    {
      "ayah": 102,
      "surah": 37,
      "text": "وقوله تعالى \"فلما بلغ معه السعي\" أى كبر وترعرع وصار يذهب مع أبيه ويمشي معه وقد كان إبراهيم عليه الصلاة والسلام يذهب في كل وقت يتفقد ولده وأم ولده ببلاد فاران وينظر في أمرهما وقد ذكر أنه كان يركب على البراق سريعا إلى هناك والله أعلم وعن ابن عباس رضي الله عنهما ومجاهد وعكرمة وسعيد بن جبير وعطاء الخراساني وزيد بن أسلم وغيرهم \"فلما بلغ معه السعي\" بمعنى شب وارتحل وأطاق ما يفعله أبوه من السعي والعمل \"فلما بلغ معه السعي قال يا بني إني أرى فى المنام أني أذبحك فانظر ماذا ترى\" قال عبيد بن عمير رؤيا الأنبياء وحي ثم تلا هذه الآية \"قال يا بني إني أرى في المنام أني أذبحك فانظر ماذا ترى\" وقد قال ابن أبي حاتم حدثنا علي بن الحسين بن الجنيد حدثنا أبو عبدالملك الكرندي حدثنا سفيان بن عيينة عن إسرائيل بن يونس عن سماك عن عكرمة عن ابن عباس رضي الله عنهما قال: قال رسول الله صلى الله عليه وسلم \"رؤيا الأنبياء فى المنام وحي\" ليس هو في شيء من الكتب الستة من هذا الوجه وإنما أعلم ابنه بذلك ليكون أهون عليه وليختبر صبره وجلده وعزمه في صغره على طاعة الله تعالى وطاعة أبيه \"قال يا أبت افعل ما تؤمر\" أي امض لما أمرك الله من ذبحي \"ستجدني إن شاء الله من الصابرين\" أي سأصبر وأحتسب ذلك عند الله عز وجل وصدق صلوات الله وسلامه عليه فيما وعد ولهذا قال الله تعالى \"واذكر فى الكتاب إسماعيل إنه كان صادق الوعد وكان رسولا نبيا وكان يأمر أهله بالصلاة والزكاة وكان عند ربه مرضيا\"."
    },
    {
      "ayah": 103,
      "surah": 37,
      "text": "أي فلما تشهدا وذكرا الله تعالى إبراهيم على الذبح والولد شهادة الموت وقيل أسلما يعني استسلما وانقادا إبراهيم امتثل أمر الله تعالى لإسماعيل طاعة لله ولأبيه قال مجاهد وعكرمة وقتادة والسدي وابن إسحاق وغيرهم ومعنى تله للجبين أي صرعه على وجهه ليذبحه من قفاه ولا يشاهد وجهه عند ذبحه ليكون أهون عليه قال ابن عباس رضي الله عنهما ومجاهد وسعيد بن جبير والضحاك وقتادة \"وتله للجبين\" أكبه على وجهه وقال الإمام أحمد حدثنا شريح ويونس قالا حدثنا حماد بن سلمة عن أبي عاصم الغنوي عن أبي الطفيل عن ابن عباس رضي الله عنهما أنه قال لما أمر إبراهيم عليه الصلاة والسلام بالمناسك عرض له الشيطان عند السعي فسابقه فسبقه إبراهيم عليه الصلاة والسلام ثم ذهب به جبريل عليه الصلاة والسلام إلى جمرة العقبة فعرض له الشيطان فرماه بسبع حصيات حتى ذهب ثم عرض له عند الجمرة الوسطى فرماه بسبع حصيات وثم تله للجبين وعلى إسماعيل عليه الصلاة والسلام قميص أبيض فقال له يا أبت إنه ليس لي ثوب تكفنني فيه غيره فاخلعه حتى تكففني فيه فعالجه ليخلعه فنودي من خلفه \"أن يا إبراهيم قد صدقت الرؤيا\" فالتفت إبراهيم فإذا بكبش أبيض أقرن أعين قال ابن عباس لقد رأيتنا نتتبع ذلك الضرب من الكباش وذكر هشام الحديث في المناسك بطوله ثم رواه أحمد بطوله عن يونس عن حماد بن سلمة عن عطاء بن السائب عن سعيد بن جبير عن ابن عباس رضي الله عنهما فذكره إلا أنه قال إسحاق فعن ابن عباس رضي الله عنهما في تسمية الذبيح روايتان والأظهر عنه إسماعيل لما سيأتي بيانه إن شاء الله تعالى وقال محمد بن إسحاق عن الحسن بن دينار عن قتادة عن جعفر بن إياس عن ابن عباس رضي الله عنهما فى قوله تبارك وتعالى \"وفديناه بذبح عظيم\" قال خرج عليه كبش من الجنة قد رعى قبل ذلك أربعين خريفا فأرسل إبراهيم عليه الصلاة والسلام ابنه واتبع الكبش فأخرجه إلى الجمرة الأولى فرماه بسبع حصيات ثم أفلته عندها فجاء إلى الجمرة الوسطى فأخرجه عندها فرماه بسبع حصيات ثم أفلته فأدركه عند الجمرة الكبرى فرماه بسبع حصيات فأخرجه عندها ثم أخذه فأتى به المنحر من منى فذبحه فوالذي نفس ابن عباس بيده لقد كان أول الإسلام وإن رأس الكبش لمعلق بقرنيه في ميزاب الكعبة حتى وحش يعني يبس. وقال عبدالرزاق أخبرنا معمر عن الزهري أخبرنا القاسم قال اجتمع أبو هريرة وكعب فجعل أبو هريرة رضي الله عنه يحدث عن النبي صلى الله عليه وسلم وجعل كعب يحدث عن الكتب فقال أبو هريرة رضي الله عنه قال النبي صلى الله عليه وسلم \"إن لكل نبي دعوة مستجابة وإني قد خبأت دعوتي شفاعة لأمتي يوم القيامة\" فقال له كعب أنت سمعت هذا من رسول الله صلى الله عليه وسلم؟ قال نعم قال فداك أبي وأمي - أو فداه أبي وأمي - أفلا أخبرك عن إبراهيم عليه الصلاة والسلام؟ إنه لما أُرى ذبح ابنه إسحاق قال الشيطان إن لم أفتن هؤلاء عند هذه لم أفتنهم أبدا فخرج إبراهيم عليه الصلاة والسلام بابنه ليذبحه فذهب الشيطان فدخل على سارة فقال أين ذهب إبراهيم بابنك؟ قالت غدا به لبعض حاجته قال فإنه لم يغد به لحاجة إنما ذهب به ليذبحه قالت ولم يذبحه؟ قال زعم أن ربه أمره بذلك قالت فقد أحسن أن يطيع ربه فذهب الشيطان فى أثرهما فقال للغلام أين يذهب بك أبوك؟ قال لبعض حاجته قال فإنه لا يذهب بك لحاجة ولكنه يذهب بك ليذبحك قال ولم يذبحني؟ قال يزعم أن ربه أمره بذلك قال فوالله لئن كان الله تعالى أمره بذلك ليفعلن قال فيئس منه فتركه ولحق بإبراهيم عليه الصلاة والسلام فقال أين غدوت بابنك؟ قال لحاجة قال فإنك لم تغد به لحاجة وإنما غدوت لتذبحه قال ولم أذبحه؟ قال تزعم أن ربك أمرك بذلك قال فوالله لئن كان الله تعالى أمرني بذلك لأفعلن قال فتركه ويئس أن يطاع وقد رواه ابن جرير عن يونس عن ابن وهب عن يونس بن يزيد عن ابن شهاب قال إن عمرو بن أبي سفيان بن أسيد بن جارية الثقفي أخبره أن كعبا قال لأبي هريرة فذكره بطوله وقال في آخره وأوحى الله تعالى إلى إسحاق أني أعطيتك دعوة أستجيب لك فيها قال إسحاق اللهم إني أدعوك أن تستجيب لي أيما عبد لقيك من الأولين والآخرين لا يشرك بك شيئا فأدخله الجنة. وقال ابن أبي حاتم حدثنا أبي حدثنا محمد بن الوزير الدمشقي حدثنا الوليد بن مسلم حدثنا عبدالرحمن بن زيد بن أسلم عن أبيه عن عطاء بن يسار عن أبي هريرة قال: قال رسول الله صلى الله عليه وسلم \"إن الله تبارك وتعالى خيرني بين أن يغفر لنصف أمتي وبين أن يجيب شفاعتي فاخترت شفاعتي ورجوت أن تكفر الجم لأمتي ولولا الذي سبقني إليه العبد الصالح لتعجلت فيها دعوتي إن الله تعالى لما فرج عن إسحاق كرب الذبح قيل له يا إسحاق سل تعط فقال أما والذي نفسي بيده لأتعجلنها قبل نزغات الشيطان اللهم من مات لا يشرك بك شيئا فاغفر له وأدخله الجنة\" هذا حديث غريب منكر وعبدالرحمن بن زيد بن أسلم ضعيف الحديث وأخشى أن يكون في الحديث زيادة مدرجة وهي قوله إن الله تعالى لما فرج عن إسحاق إلى آخره والله أعلم فهذا إن كان محفوظا فالأشبه أن السياق إنما هو عن إسماعيل وإنما حرفوه بإسحاق حسدا منهم كما تقدم وإلا فالمناسك والذبائح إنما محلها بمنى من أرض مكة حيث كان إسماعيل لا إسحاق فإنه إنما كان ببلاد كنعان من أرض الشام."
    },
    {
      "ayah": 104,
      "surah": 37,
      "text": "وقوله تعالى \"وناديناه أن يا إبراهيم قد صدقت الرؤيا\" أي قد حصل المقصود من رؤياك بإضجاعك ولدك للذبح وذكر السدي وغيره أنه أمر السكين على رقبته فلم تقطع شيئا بل حال بينها وبينه صفحة من نحاس ونودي إبراهيم عليه الصلاة والسلام عند ذلك \"قد صدقت الرؤيا\"."
    },
    {
      "ayah": 105,
      "surah": 37,
      "text": "وقوله تعالى \"إنا كذلك نجزي المحسنين\" أي هكذا نصرف عمن أطاعنا المكاره والشدائد ونجعل لهم من أمرهم فرجا ومخرجا كقوله تعالى \"ومن يتق الله يجعل له مخرجا ويرزقه من حيث لا يحتسب ومن يتوكل على الله فهو حسبه إن الله بالغ أمره قد جعل الله لكل شيء قدرا\" وقد استدل بهذه الآية والقصة جماعة من علماء الأصول على صحة النسخ قبل التمكن من الفعل خلافا لطائفة من المعتزلة والدلالة من هذه ظاهرة لأن الله تعالى شرع لإبراهيم عليه الصلاة والسلام ذبح ولده ثم نسخه عنه وصرفه إلى الفداء وإنما كان المقصود من شرعه أولا إثابة الخليل على الصبر على ذبح ولده وعزمه على ذلك."
    },
    {
      "ayah": 106,
      "surah": 37,
      "text": "ولهذا قال تعالى \"إن هذا لهو البلاء المبين\" أي الاختبار الواضح الجلي حيث أمر بذبح ولده فسارع إلى ذلك مستسلما لأمر الله تعالى منقادا لطاعته ولهذا قال تعالى \"وإبراهيم الذي وفى\"."
    },
    {
      "ayah": 107,
      "surah": 37,
      "text": "وقوله تعالى \"وفديناه بذبح عظيم\" قال سفيان الثوري عن جابر الجعفي عن أبي الطفيل عن علي رضي الله عنه \"وفديناه بذبح عظيم\" قال بكبش أبيض أعين أقرن قد ربط بسمرة قال أبو الطفيل وجدوه مربوطا بسمرة في ثبير وقال الثوري أيضا عن عبدالله بن عثمان بن خثيم عن سعيد بن جبير عن ابن عباس رضي الله عنهما قال كبش قد رعا في الجنة أربعين خريفا. وقال ابن أبي حاتم حدثنا أبي حدثنا يوسف بن يعقوب الصفار حدثنا داود العطار عن ابن خثيم عن سعيد بن جبير عن ابن عباس رضي الله عنهما قال الصخرة التي بمنى بأصل ثبير هي الصخرة التي ذبح عليها إبراهيم فداء إسحاق ابنه هبط عليه من ثبير كبش أعين أقرن له ثغاء فذبحه وهو الكبش الذي قربه ابن آدم فتقبل منه فكان مخزونا حتى فدى به إسحاق وروي أيضا عن سعيد بن جبير أنه قال كان الكبش يرتع فى الجنة حتى شقق عنه ثبير وكان عليه عهن أحمر وعن الحسن البصري أنه قال كان اسم كبش إبراهيم عليه الصلاة والسلام جرير وقال ابن جريج قال عبيد بن عمير ذبحه بالمقام وقال مجاهد ذبحه بمنى عند المنحر. وقال هشيم عن سيار عن عكرمة عن ابن عباس رضي الله عنهما كان أفتى الذي جعل عليه نذرا أن ينحر نفسه فأمره بمائة من الإبل ثم قال بعد ذلك لو كنت أفتيه بكبش لأجزأه أن يذبح كبشا فإن الله تعالى قال في كتابه \"وفديناه بذبح عظيم\" والصحيح الذي عليه الأكثرون أنه يفدي بكبش وقال الثوري عن رجل عن أبي صالح عن ابن عباس في قوله تعالى \"وفديناه بذبح عظيم\" قال وعل وقال محمد بن إسحاق عن عمرو بن عبيد عن الحسن أنه كان يقول ما فدي إسماعيل عليه السلام إلا بتيس من الأروى أهبط عليه من ثبير. وقد قال الإمام أحمد حدثنا سفيان حدثني منصور عن خاله مسافع عن صفية بنت شيبة قالت أخبرتني امرأة من بني سليم ولدت عامة أهل دارنا أرسل رسول الله صلى الله عليه وسلم إلى عثمان بن طلحة رضي الله عنه وقالت مرة إنها سألت عثمان لم دعاك النبي صلى الله عليه وسلم؟ قال: قال لي رسول الله صلى الله عليه وسلم \"إني كنت رأيت قرني الكبش حين دخلت البيت فنسيت أن آمرك أن تخمرهما فخمرهما فإنه لا ينبغي أن يكون في البيت شيء يشغل المصلي\" قال سفيان لم يزل قرنا الكبش معلقين في البيت حتى احترق البيت فاحترقا وهذا دليل مستقل على أنه إسماعيل عليه الصلاة والسلام فإن قريشا توارثوا قرني الكبش الذي فدى به إبراهيم خلفا عن سلف وجيلا بعد جيل إلى أن بعث الله رسوله صلى الله عليه وسلم. \"فصل في ذكر الآثار الواردة عن السلف في أن الذبيح من هو\" \"ذكر من قال هو إسحاق عليه الصلاة والسلام\" قال حمزة الزيات عن أبي ميسرة رحمه الله قال: قال يوسف عليه عليه الصلاة والسلام للملك في وجهه ترغب أن تأكل معي وأنا والله يوسف بن يعقوب نبي الله ابن إسحاق ذبيح الله بن إبراهيم خليل الله وقال الثوري عن أبى سنان عن ابن أبي الهذيل أن يوسف عليه السلام قال للملك كذلك أيضا وقال سفيان الثوري عن زيد بن أسلم عن عبدالله بن عبيد بن عمير عن أبيه قال: قال موسى عليه الصلاة والسلام يا رب يقولون بإله إبراهيم وإسحاق ويعقوب فبم قالوا ذلك؟ قال: إن إبراهيم لم يعدل بي شيء قط إلا اختارني عليه وإن إسحاق جاد لي بالذبح وهو بغير ذلك أجود وإن يعقوب كلما زدته بلاء زادني حسن ظن وقال شعبة عن أبي إسحاق عن أبي الأحوص قال افتخر رجل عند ابن مسعود رضي الله عنه فقال أنا فلان بن فلان ابن الأشياخ الكرام فقال عبدالله بن مسعود رضي الله عنه ذاك يوسف بن يعقوب بن إسحاق ذبيح الله بن إبراهيم خليل الله. وهذا صحيح عن ابن مسعود رضي الله عنه وكذا روى عكرمة عن ابن عباس رضي الله عنهما أنه إسحاق وعن أبيه العباس علي بن أبي طالب مثل ذلك وكذا قال عكرمة وسعيد بن جبير ومجاهد والشعبي وعبيد بن عمير وأبو ميسرة وزيد بن أسلم وعبدالله بن شقيق والزهري والقاسم بن أبي برزة ومكحول وعثمان بن أبي حاضر والسدي والحسن وقتادة وأبو الهذيل وابن سابط وهذا اختيار ابن جرير وتقدم روايته عن كعب الأحبار أنه إسحاق وهكذا روى ابن إسحاق عن عبدالله بن أبى بكر عن الزهري عن أبي سفيان عن العلاء بن جارية عن أبي هريرة رضي الله عنه عن كعب الأحبار أنه قال هو إسحاق وهذه الأقوال والله أعلم كلها مأخوذة عن كعب الأحبار فإنه لما أسلم في الدولة العمرية جعل يحدث عمر رضي الله عنه عن كتبه قديما فربما استمع له عمر رضي الله عنه فترخص الناس في استماع ما عنده ونقلوا ما عنده عنه غثها وسمينها وليس لهذه الأمة والله أعلم حاجة إلى حرف واحد مما عنده وقد حكى البغوي القول بأنه إسحاق عن عمر وعلي وابن مسعود والعباس رضي الله عنهم ومن التابعين عن كعب الأحبار وسعيد بن جبير وقتادة ومسروق عكرمة وعطاء و مقاتل والزهري والسدي قال وهو إحدى الروايتين عن ابن عباس رضي الله عنهما وقد ورد في ذلك حديث لو ثبت لقلنا به على الرأس والعين ولكن لم يصح سنده. قال ابن جرير حدثنا أبو كريب حدثنا زيد بن حباب عن الحسن بن دينار عن علي بن زيد بن جدعان عن الحسن عن الأحنف بن قيس عن العباس بن عبدالمطلب رضي الله عنه عن النبي صلى الله عليه وسلم في حديث ذكره قال \"هو إسحاق\" ففي إسناده ضعيفان وهما الحسن بن دينار البصري متروك وعلي بن زيد بن جدعان منكر الحديث وقد رواه ابن أبي حاتم عن أبيه عن مسلم بن إبراهيم عن حماد بن سلمة عن علي بن زيد بن جدعان به مرفوعا ثم قال قد رواه مبارك بن فضالة عن الحسن عن الأحنف عن العباس رضي الله عنه وهذا أشبه وأصح والله أعلم. \"ذكر الآثار الواردة بأنه إسماعيل عليه الصلاة والسلام وهو الصحيح المقطوع به\" قد تقدمت الرواية عن ابن عباس رضي الله عنهما أنه إسحاق عليه الصلاة والسلام والله تعالى أعلم وقال سعيد بن جبير وعامر الشعبي ويوسف بن مهران ومجاهد وعطاء وغير واحد عن ابن عباس رضي الله عنهما هو إسماعيل عليه الصلاة والسلام وقال ابن جرير حدثني يونس أخبرنا ابن وهب أخبرني عمرو بن قيس عن عطاء بن أبي رباح عن ابن عباس أنه قال المفدى إسماعيل عليه السلام وزعمت اليهود أنه إسحاق وكذبت اليهود وقال إسرائيل عن ثور عن مجاهد عن ابن عمر رضي الله عنهما قال الذبيح إسماعيل وقال ابن أبي نجيح عن مجاهد هو إسماعيل عليه السلام وكذا قال يوسف بن مهران وقال الشعبي هو إسماعيل عليه الصلاة والسلام وقد رأيت قرني الكبش في الكعبة وقال محمد بن إسحاق عن الحسن بن دينار وعمرو بن عبيد عن الحسن البصري أنه كان لا يشك في ذلك أن الذي أمر بذبحه من ابني إبراهيم إسماعيل عليه السلام قال ابن إسحاق وسمعت محمد بن كعب القرظي وهو يقول إن الذي أمر الله تعالى إبراهيم بذبحه من ابنيه إسماعيل وإنا لنجد ذلك في كتاب الله تعالى وذلك أن الله تعالى حين فرغ من قصة المذبوح من ابني إبراهيم قال الله تعالى \"وبشرناه بإسحاق نبيا من الصالحين\" ويقول الله تعالى \"فبشرناها بإسحاق ومن وراء إسحاق يعقوب\" يقول بابن وابن ابن فلم يكن ليأمره بذبح إسحاق وله فيه من الموعد بما وعده وما الذي أمر بذبحه إلا إسماعيل قال ابن إسحاق سمعته يقول ذلك كثيرا وقال ابن إسحاق عن بريدة بن سفيان الأسلمي عن محمد بن كعب القرظي أنه حدثهم أنه ذكر ذلك لعمر بن عبدالعزيز رضي الله عنه وهو خليفة إذ كان معه بالشام فقال له عمر إن هذا لشيء ما كنت أنظر فيه وإني لأراه كما قلت ثم أرسل إلى رجل كان عنده بالشام كان يهوديا فأسلم وحسن إسلامه وكان يرى أنه من علمائهم فسأله عمر بن عبدالعزيز رضي الله عنه عن ذلك قال محمد بن كعب وأنا عند عمر بن عبدالعزيز فقال له عمر أي ابني إبراهيم أمر بذبحه؟ فقال إسماعيل والله يا أمير المؤمنين وإن يهود لتعلم بذلك ولكنهم يحسدونكم معشر العرب على أن يكون أباكم الذي كان من أمر الله فيه والفضل الذي ذكر الله تعالى منه لصبره لما أمر به فهم يجحدون ذلك ويزعمون أنه إسحاق لأن إسحاق أبوهم والله أعلم أيهما كان وكل قد كان طاهرا طيبا مطيعا لله عز وجل وقال عبدالله بن الإمام أحمد بن حنبل رحمه الله سألت أبي عن الذبيح هل هو إسماعيل أو إسحاق فقال إسماعيل ذكره فى كتاب الزهد وقال ابن أبي حاتم وسمعت أبي يقول الصحيح أن الذبيح إسماعيل عليه الصلاة والسلام قال وروي عن علي وابن عمر وأبي هريرة وأبي الطفيل وسعيد بن المسيب وسعيد بن جبير والحسن ومجاهد والشعبي ومحمد بن كعب القرظي وأبي جعفر محمد بن علي وأبي صالح رضي الله عنهم أنهم قالوا الذبيح إسماعيل. وقال البغوي فى تفسيره وإليه ذهب عبدالله بن عمر وسعيد بن المسيب والسدي والحسن البصري ومجاهد والربيع بن أنس ومحمد بن كعب القرظي والكلبي وهو رواية عن ابن عباس وحكاه أيضا عن أبي عمرو بن العلاء وقد روى ابن جرير في ذلك حديثا غريبا فقال حدثني محمد بن عمار الرازي حدثنا إسماعيل بن عبيد بن أبي كريمة حدثنا عمر بن عبدالرحيم الخطابي عن عبيد الله بن محمد العتبي من ولد عتبة بن أبي سفيان عن أبيه حدثني عبدالله بن سعيد عن الصنابحي قال كنا عند معاوية بن أبي سفيان فذكروا الذبيح إسماعيل أو إسحاق فقال على الخبير سقطتم: كنا عند رسول الله صلى الله عليه وسلم فجاءه رجل فقال يا رسول الله عد علي مما أفاء الله عليك يا ابن الذبيحين فضحك رسول الله صلى الله عليه وسلم\" فقيل له يا أمير المؤمنين وما الذبيحان؟ فقال إن عبدالمطلب لما أمر بحفر زمزم نذر لله إن سهل الله له أمرها عليه ليذبحن أحد ولده قال فخرج السهم على عبدالله فمنعه أخواله وقالوا افد ابنك بمائة من الإبل ففداه بمائة من الإبل والثاني إسماعيل. وهذا حديث غريب جدا وقد رواه الأموي فى مغازيه حدثنا بعض أصحابنا أخبرنا إسماعيل بن عبيد بن أبي كريمة حدثنا عمرو بن عبد الرحمن القرشي حدثنا عبيد الله بن محمد العتبي من ولد عتبة بن أبي سفيان حدثنا عبدالله بن سعيد حدثنا الصنابحي قال حضرنا مجلس معاوية رضي الله عنه فتذاكر القوم إسماعيل أو إسحاق وذكره كذا كتبته من نسخة مغلوطة. وإنما عول ابن جرير في اختياره أن الذبيح إسحاق على قوله تعالى \"فبشرناه بغلام حليم\" فجعل هذه البشارة هي البشارة بإسحاق في قوله تعالى \"وبشروه بغلام عليم\" وأجاب عن البشارة بيعقوب بأنه قد كان بلغ معه السعي أي العمل ومن الممكن أنه قد كان ولد له أولاد مع يعقوب أيضا قال وأما القرنان اللذان كانا معلقين بالكعبة فمن الجائز أنهما نقلا من بلاد كنعان قال وقد تقدم أن من الناس من ذهب إلى أنه ذبح إسحاق هناك هذا ما اعتمد عليه في تفسيره وليس إليه بمذهب ولا لازم بل هو بعيد جدا والذي استدل به محمد بن كعب القرظي على أنه إسماعيل أثبت وأصح وأقوى والله أعلم."
    },
    {
      "ayah": 108,
      "surah": 37,
      "text": "وقوله تعالى \"وفديناه بذبح عظيم\" قال سفيان الثوري عن جابر الجعفي عن أبي الطفيل عن علي رضي الله عنه \"وفديناه بذبح عظيم\" قال بكبش أبيض أعين أقرن قد ربط بسمرة قال أبو الطفيل وجدوه مربوطا بسمرة في ثبير وقال الثوري أيضا عن عبدالله بن عثمان بن خثيم عن سعيد بن جبير عن ابن عباس رضي الله عنهما قال كبش قد رعا في الجنة أربعين خريفا. وقال ابن أبي حاتم حدثنا أبي حدثنا يوسف بن يعقوب الصفار حدثنا داود العطار عن ابن خثيم عن سعيد بن جبير عن ابن عباس رضي الله عنهما قال الصخرة التي بمنى بأصل ثبير هي الصخرة التي ذبح عليها إبراهيم فداء إسحاق ابنه هبط عليه من ثبير كبش أعين أقرن له ثغاء فذبحه وهو الكبش الذي قربه ابن آدم فتقبل منه فكان مخزونا حتى فدى به إسحاق وروي أيضا عن سعيد بن جبير أنه قال كان الكبش يرتع فى الجنة حتى شقق عنه ثبير وكان عليه عهن أحمر وعن الحسن البصري أنه قال كان اسم كبش إبراهيم عليه الصلاة والسلام جرير وقال ابن جريج قال عبيد بن عمير ذبحه بالمقام وقال مجاهد ذبحه بمنى عند المنحر. وقال هشيم عن سيار عن عكرمة عن ابن عباس رضي الله عنهما كان أفتى الذي جعل عليه نذرا أن ينحر نفسه فأمره بمائة من الإبل ثم قال بعد ذلك لو كنت أفتيه بكبش لأجزأه أن يذبح كبشا فإن الله تعالى قال في كتابه \"وفديناه بذبح عظيم\" والصحيح الذي عليه الأكثرون أنه يفدي بكبش وقال الثوري عن رجل عن أبي صالح عن ابن عباس في قوله تعالى \"وفديناه بذبح عظيم\" قال وعل وقال محمد بن إسحاق عن عمرو بن عبيد عن الحسن أنه كان يقول ما فدي إسماعيل عليه السلام إلا بتيس من الأروى أهبط عليه من ثبير. وقد قال الإمام أحمد حدثنا سفيان حدثني منصور عن خاله مسافع عن صفية بنت شيبة قالت أخبرتني امرأة من بني سليم ولدت عامة أهل دارنا أرسل رسول الله صلى الله عليه وسلم إلى عثمان بن طلحة رضي الله عنه وقالت مرة إنها سألت عثمان لم دعاك النبي صلى الله عليه وسلم؟ قال: قال لي رسول الله صلى الله عليه وسلم \"إني كنت رأيت قرني الكبش حين دخلت البيت فنسيت أن آمرك أن تخمرهما فخمرهما فإنه لا ينبغي أن يكون في البيت شيء يشغل المصلي\" قال سفيان لم يزل قرنا الكبش معلقين في البيت حتى احترق البيت فاحترقا وهذا دليل مستقل على أنه إسماعيل عليه الصلاة والسلام فإن قريشا توارثوا قرني الكبش الذي فدى به إبراهيم خلفا عن سلف وجيلا بعد جيل إلى أن بعث الله رسوله صلى الله عليه وسلم. \"فصل في ذكر الآثار الواردة عن السلف في أن الذبيح من هو\" \"ذكر من قال هو إسحاق عليه الصلاة والسلام\" قال حمزة الزيات عن أبي ميسرة رحمه الله قال: قال يوسف عليه عليه الصلاة والسلام للملك في وجهه ترغب أن تأكل معي وأنا والله يوسف بن يعقوب نبي الله ابن إسحاق ذبيح الله بن إبراهيم خليل الله وقال الثوري عن أبى سنان عن ابن أبي الهذيل أن يوسف عليه السلام قال للملك كذلك أيضا وقال سفيان الثوري عن زيد بن أسلم عن عبدالله بن عبيد بن عمير عن أبيه قال: قال موسى عليه الصلاة والسلام يا رب يقولون بإله إبراهيم وإسحاق ويعقوب فبم قالوا ذلك؟ قال: إن إبراهيم لم يعدل بي شيء قط إلا اختارني عليه وإن إسحاق جاد لي بالذبح وهو بغير ذلك أجود وإن يعقوب كلما زدته بلاء زادني حسن ظن وقال شعبة عن أبي إسحاق عن أبي الأحوص قال افتخر رجل عند ابن مسعود رضي الله عنه فقال أنا فلان بن فلان ابن الأشياخ الكرام فقال عبدالله بن مسعود رضي الله عنه ذاك يوسف بن يعقوب بن إسحاق ذبيح الله بن إبراهيم خليل الله. وهذا صحيح عن ابن مسعود رضي الله عنه وكذا روى عكرمة عن ابن عباس رضي الله عنهما أنه إسحاق وعن أبيه العباس علي بن أبي طالب مثل ذلك وكذا قال عكرمة وسعيد بن جبير ومجاهد والشعبي وعبيد بن عمير وأبو ميسرة وزيد بن أسلم وعبدالله بن شقيق والزهري والقاسم بن أبي برزة ومكحول وعثمان بن أبي حاضر والسدي والحسن وقتادة وأبو الهذيل وابن سابط وهذا اختيار ابن جرير وتقدم روايته عن كعب الأحبار أنه إسحاق وهكذا روى ابن إسحاق عن عبدالله بن أبى بكر عن الزهري عن أبي سفيان عن العلاء بن جارية عن أبي هريرة رضي الله عنه عن كعب الأحبار أنه قال هو إسحاق وهذه الأقوال والله أعلم كلها مأخوذة عن كعب الأحبار فإنه لما أسلم في الدولة العمرية جعل يحدث عمر رضي الله عنه عن كتبه قديما فربما استمع له عمر رضي الله عنه فترخص الناس في استماع ما عنده ونقلوا ما عنده عنه غثها وسمينها وليس لهذه الأمة والله أعلم حاجة إلى حرف واحد مما عنده وقد حكى البغوي القول بأنه إسحاق عن عمر وعلي وابن مسعود والعباس رضي الله عنهم ومن التابعين عن كعب الأحبار وسعيد بن جبير وقتادة ومسروق عكرمة وعطاء و مقاتل والزهري والسدي قال وهو إحدى الروايتين عن ابن عباس رضي الله عنهما وقد ورد في ذلك حديث لو ثبت لقلنا به على الرأس والعين ولكن لم يصح سنده. قال ابن جرير حدثنا أبو كريب حدثنا زيد بن حباب عن الحسن بن دينار عن علي بن زيد بن جدعان عن الحسن عن الأحنف بن قيس عن العباس بن عبدالمطلب رضي الله عنه عن النبي صلى الله عليه وسلم في حديث ذكره قال \"هو إسحاق\" ففي إسناده ضعيفان وهما الحسن بن دينار البصري متروك وعلي بن زيد بن جدعان منكر الحديث وقد رواه ابن أبي حاتم عن أبيه عن مسلم بن إبراهيم عن حماد بن سلمة عن علي بن زيد بن جدعان به مرفوعا ثم قال قد رواه مبارك بن فضالة عن الحسن عن الأحنف عن العباس رضي الله عنه وهذا أشبه وأصح والله أعلم. \"ذكر الآثار الواردة بأنه إسماعيل عليه الصلاة والسلام وهو الصحيح المقطوع به\" قد تقدمت الرواية عن ابن عباس رضي الله عنهما أنه إسحاق عليه الصلاة والسلام والله تعالى أعلم وقال سعيد بن جبير وعامر الشعبي ويوسف بن مهران ومجاهد وعطاء وغير واحد عن ابن عباس رضي الله عنهما هو إسماعيل عليه الصلاة والسلام وقال ابن جرير حدثني يونس أخبرنا ابن وهب أخبرني عمرو بن قيس عن عطاء بن أبي رباح عن ابن عباس أنه قال المفدى إسماعيل عليه السلام وزعمت اليهود أنه إسحاق وكذبت اليهود وقال إسرائيل عن ثور عن مجاهد عن ابن عمر رضي الله عنهما قال الذبيح إسماعيل وقال ابن أبي نجيح عن مجاهد هو إسماعيل عليه السلام وكذا قال يوسف بن مهران وقال الشعبي هو إسماعيل عليه الصلاة والسلام وقد رأيت قرني الكبش في الكعبة وقال محمد بن إسحاق عن الحسن بن دينار وعمرو بن عبيد عن الحسن البصري أنه كان لا يشك في ذلك أن الذي أمر بذبحه من ابني إبراهيم إسماعيل عليه السلام قال ابن إسحاق وسمعت محمد بن كعب القرظي وهو يقول إن الذي أمر الله تعالى إبراهيم بذبحه من ابنيه إسماعيل وإنا لنجد ذلك في كتاب الله تعالى وذلك أن الله تعالى حين فرغ من قصة المذبوح من ابني إبراهيم قال الله تعالى \"وبشرناه بإسحاق نبيا من الصالحين\" ويقول الله تعالى \"فبشرناها بإسحاق ومن وراء إسحاق يعقوب\" يقول بابن وابن ابن فلم يكن ليأمره بذبح إسحاق وله فيه من الموعد بما وعده وما الذي أمر بذبحه إلا إسماعيل قال ابن إسحاق سمعته يقول ذلك كثيرا وقال ابن إسحاق عن بريدة بن سفيان الأسلمي عن محمد بن كعب القرظي أنه حدثهم أنه ذكر ذلك لعمر بن عبدالعزيز رضي الله عنه وهو خليفة إذ كان معه بالشام فقال له عمر إن هذا لشيء ما كنت أنظر فيه وإني لأراه كما قلت ثم أرسل إلى رجل كان عنده بالشام كان يهوديا فأسلم وحسن إسلامه وكان يرى أنه من علمائهم فسأله عمر بن عبدالعزيز رضي الله عنه عن ذلك قال محمد بن كعب وأنا عند عمر بن عبدالعزيز فقال له عمر أي ابني إبراهيم أمر بذبحه؟ فقال إسماعيل والله يا أمير المؤمنين وإن يهود لتعلم بذلك ولكنهم يحسدونكم معشر العرب على أن يكون أباكم الذي كان من أمر الله فيه والفضل الذي ذكر الله تعالى منه لصبره لما أمر به فهم يجحدون ذلك ويزعمون أنه إسحاق لأن إسحاق أبوهم والله أعلم أيهما كان وكل قد كان طاهرا طيبا مطيعا لله عز وجل وقال عبدالله بن الإمام أحمد بن حنبل رحمه الله سألت أبي عن الذبيح هل هو إسماعيل أو إسحاق فقال إسماعيل ذكره فى كتاب الزهد وقال ابن أبي حاتم وسمعت أبي يقول الصحيح أن الذبيح إسماعيل عليه الصلاة والسلام قال وروي عن علي وابن عمر وأبي هريرة وأبي الطفيل وسعيد بن المسيب وسعيد بن جبير والحسن ومجاهد والشعبي ومحمد بن كعب القرظي وأبي جعفر محمد بن علي وأبي صالح رضي الله عنهم أنهم قالوا الذبيح إسماعيل. وقال البغوي فى تفسيره وإليه ذهب عبدالله بن عمر وسعيد بن المسيب والسدي والحسن البصري ومجاهد والربيع بن أنس ومحمد بن كعب القرظي والكلبي وهو رواية عن ابن عباس وحكاه أيضا عن أبي عمرو بن العلاء وقد روى ابن جرير في ذلك حديثا غريبا فقال حدثني محمد بن عمار الرازي حدثنا إسماعيل بن عبيد بن أبي كريمة حدثنا عمر بن عبدالرحيم الخطابي عن عبيد الله بن محمد العتبي من ولد عتبة بن أبي سفيان عن أبيه حدثني عبدالله بن سعيد عن الصنابحي قال كنا عند معاوية بن أبي سفيان فذكروا الذبيح إسماعيل أو إسحاق فقال على الخبير سقطتم: كنا عند رسول الله صلى الله عليه وسلم فجاءه رجل فقال يا رسول الله عد علي مما أفاء الله عليك يا ابن الذبيحين فضحك رسول الله صلى الله عليه وسلم\" فقيل له يا أمير المؤمنين وما الذبيحان؟ فقال إن عبدالمطلب لما أمر بحفر زمزم نذر لله إن سهل الله له أمرها عليه ليذبحن أحد ولده قال فخرج السهم على عبدالله فمنعه أخواله وقالوا افد ابنك بمائة من الإبل ففداه بمائة من الإبل والثاني إسماعيل. وهذا حديث غريب جدا وقد رواه الأموي فى مغازيه حدثنا بعض أصحابنا أخبرنا إسماعيل بن عبيد بن أبي كريمة حدثنا عمرو بن عبد الرحمن القرشي حدثنا عبيد الله بن محمد العتبي من ولد عتبة بن أبي سفيان حدثنا عبدالله بن سعيد حدثنا الصنابحي قال حضرنا مجلس معاوية رضي الله عنه فتذاكر القوم إسماعيل أو إسحاق وذكره كذا كتبته من نسخة مغلوطة. وإنما عول ابن جرير في اختياره أن الذبيح إسحاق على قوله تعالى \"فبشرناه بغلام حليم\" فجعل هذه البشارة هي البشارة بإسحاق في قوله تعالى \"وبشروه بغلام عليم\" وأجاب عن البشارة بيعقوب بأنه قد كان بلغ معه السعي أي العمل ومن الممكن أنه قد كان ولد له أولاد مع يعقوب أيضا قال وأما القرنان اللذان كانا معلقين بالكعبة فمن الجائز أنهما نقلا من بلاد كنعان قال وقد تقدم أن من الناس من ذهب إلى أنه ذبح إسحاق هناك هذا ما اعتمد عليه في تفسيره وليس إليه بمذهب ولا لازم بل هو بعيد جدا والذي استدل به محمد بن كعب القرظي على أنه إسماعيل أثبت وأصح وأقوى والله أعلم."
    },
    {
      "ayah": 109,
      "surah": 37,
      "text": "وقوله تعالى \"وفديناه بذبح عظيم\" قال سفيان الثوري عن جابر الجعفي عن أبي الطفيل عن علي رضي الله عنه \"وفديناه بذبح عظيم\" قال بكبش أبيض أعين أقرن قد ربط بسمرة قال أبو الطفيل وجدوه مربوطا بسمرة في ثبير وقال الثوري أيضا عن عبدالله بن عثمان بن خثيم عن سعيد بن جبير عن ابن عباس رضي الله عنهما قال كبش قد رعا في الجنة أربعين خريفا. وقال ابن أبي حاتم حدثنا أبي حدثنا يوسف بن يعقوب الصفار حدثنا داود العطار عن ابن خثيم عن سعيد بن جبير عن ابن عباس رضي الله عنهما قال الصخرة التي بمنى بأصل ثبير هي الصخرة التي ذبح عليها إبراهيم فداء إسحاق ابنه هبط عليه من ثبير كبش أعين أقرن له ثغاء فذبحه وهو الكبش الذي قربه ابن آدم فتقبل منه فكان مخزونا حتى فدى به إسحاق وروي أيضا عن سعيد بن جبير أنه قال كان الكبش يرتع فى الجنة حتى شقق عنه ثبير وكان عليه عهن أحمر وعن الحسن البصري أنه قال كان اسم كبش إبراهيم عليه الصلاة والسلام جرير وقال ابن جريج قال عبيد بن عمير ذبحه بالمقام وقال مجاهد ذبحه بمنى عند المنحر. وقال هشيم عن سيار عن عكرمة عن ابن عباس رضي الله عنهما كان أفتى الذي جعل عليه نذرا أن ينحر نفسه فأمره بمائة من الإبل ثم قال بعد ذلك لو كنت أفتيه بكبش لأجزأه أن يذبح كبشا فإن الله تعالى قال في كتابه \"وفديناه بذبح عظيم\" والصحيح الذي عليه الأكثرون أنه يفدي بكبش وقال الثوري عن رجل عن أبي صالح عن ابن عباس في قوله تعالى \"وفديناه بذبح عظيم\" قال وعل وقال محمد بن إسحاق عن عمرو بن عبيد عن الحسن أنه كان يقول ما فدي إسماعيل عليه السلام إلا بتيس من الأروى أهبط عليه من ثبير. وقد قال الإمام أحمد حدثنا سفيان حدثني منصور عن خاله مسافع عن صفية بنت شيبة قالت أخبرتني امرأة من بني سليم ولدت عامة أهل دارنا أرسل رسول الله صلى الله عليه وسلم إلى عثمان بن طلحة رضي الله عنه وقالت مرة إنها سألت عثمان لم دعاك النبي صلى الله عليه وسلم؟ قال: قال لي رسول الله صلى الله عليه وسلم \"إني كنت رأيت قرني الكبش حين دخلت البيت فنسيت أن آمرك أن تخمرهما فخمرهما فإنه لا ينبغي أن يكون في البيت شيء يشغل المصلي\" قال سفيان لم يزل قرنا الكبش معلقين في البيت حتى احترق البيت فاحترقا وهذا دليل مستقل على أنه إسماعيل عليه الصلاة والسلام فإن قريشا توارثوا قرني الكبش الذي فدى به إبراهيم خلفا عن سلف وجيلا بعد جيل إلى أن بعث الله رسوله صلى الله عليه وسلم. \"فصل في ذكر الآثار الواردة عن السلف في أن الذبيح من هو\" \"ذكر من قال هو إسحاق عليه الصلاة والسلام\" قال حمزة الزيات عن أبي ميسرة رحمه الله قال: قال يوسف عليه عليه الصلاة والسلام للملك في وجهه ترغب أن تأكل معي وأنا والله يوسف بن يعقوب نبي الله ابن إسحاق ذبيح الله بن إبراهيم خليل الله وقال الثوري عن أبى سنان عن ابن أبي الهذيل أن يوسف عليه السلام قال للملك كذلك أيضا وقال سفيان الثوري عن زيد بن أسلم عن عبدالله بن عبيد بن عمير عن أبيه قال: قال موسى عليه الصلاة والسلام يا رب يقولون بإله إبراهيم وإسحاق ويعقوب فبم قالوا ذلك؟ قال: إن إبراهيم لم يعدل بي شيء قط إلا اختارني عليه وإن إسحاق جاد لي بالذبح وهو بغير ذلك أجود وإن يعقوب كلما زدته بلاء زادني حسن ظن وقال شعبة عن أبي إسحاق عن أبي الأحوص قال افتخر رجل عند ابن مسعود رضي الله عنه فقال أنا فلان بن فلان ابن الأشياخ الكرام فقال عبدالله بن مسعود رضي الله عنه ذاك يوسف بن يعقوب بن إسحاق ذبيح الله بن إبراهيم خليل الله. وهذا صحيح عن ابن مسعود رضي الله عنه وكذا روى عكرمة عن ابن عباس رضي الله عنهما أنه إسحاق وعن أبيه العباس علي بن أبي طالب مثل ذلك وكذا قال عكرمة وسعيد بن جبير ومجاهد والشعبي وعبيد بن عمير وأبو ميسرة وزيد بن أسلم وعبدالله بن شقيق والزهري والقاسم بن أبي برزة ومكحول وعثمان بن أبي حاضر والسدي والحسن وقتادة وأبو الهذيل وابن سابط وهذا اختيار ابن جرير وتقدم روايته عن كعب الأحبار أنه إسحاق وهكذا روى ابن إسحاق عن عبدالله بن أبى بكر عن الزهري عن أبي سفيان عن العلاء بن جارية عن أبي هريرة رضي الله عنه عن كعب الأحبار أنه قال هو إسحاق وهذه الأقوال والله أعلم كلها مأخوذة عن كعب الأحبار فإنه لما أسلم في الدولة العمرية جعل يحدث عمر رضي الله عنه عن كتبه قديما فربما استمع له عمر رضي الله عنه فترخص الناس في استماع ما عنده ونقلوا ما عنده عنه غثها وسمينها وليس لهذه الأمة والله أعلم حاجة إلى حرف واحد مما عنده وقد حكى البغوي القول بأنه إسحاق عن عمر وعلي وابن مسعود والعباس رضي الله عنهم ومن التابعين عن كعب الأحبار وسعيد بن جبير وقتادة ومسروق عكرمة وعطاء و مقاتل والزهري والسدي قال وهو إحدى الروايتين عن ابن عباس رضي الله عنهما وقد ورد في ذلك حديث لو ثبت لقلنا به على الرأس والعين ولكن لم يصح سنده. قال ابن جرير حدثنا أبو كريب حدثنا زيد بن حباب عن الحسن بن دينار عن علي بن زيد بن جدعان عن الحسن عن الأحنف بن قيس عن العباس بن عبدالمطلب رضي الله عنه عن النبي صلى الله عليه وسلم في حديث ذكره قال \"هو إسحاق\" ففي إسناده ضعيفان وهما الحسن بن دينار البصري متروك وعلي بن زيد بن جدعان منكر الحديث وقد رواه ابن أبي حاتم عن أبيه عن مسلم بن إبراهيم عن حماد بن سلمة عن علي بن زيد بن جدعان به مرفوعا ثم قال قد رواه مبارك بن فضالة عن الحسن عن الأحنف عن العباس رضي الله عنه وهذا أشبه وأصح والله أعلم. \"ذكر الآثار الواردة بأنه إسماعيل عليه الصلاة والسلام وهو الصحيح المقطوع به\" قد تقدمت الرواية عن ابن عباس رضي الله عنهما أنه إسحاق عليه الصلاة والسلام والله تعالى أعلم وقال سعيد بن جبير وعامر الشعبي ويوسف بن مهران ومجاهد وعطاء وغير واحد عن ابن عباس رضي الله عنهما هو إسماعيل عليه الصلاة والسلام وقال ابن جرير حدثني يونس أخبرنا ابن وهب أخبرني عمرو بن قيس عن عطاء بن أبي رباح عن ابن عباس أنه قال المفدى إسماعيل عليه السلام وزعمت اليهود أنه إسحاق وكذبت اليهود وقال إسرائيل عن ثور عن مجاهد عن ابن عمر رضي الله عنهما قال الذبيح إسماعيل وقال ابن أبي نجيح عن مجاهد هو إسماعيل عليه السلام وكذا قال يوسف بن مهران وقال الشعبي هو إسماعيل عليه الصلاة والسلام وقد رأيت قرني الكبش في الكعبة وقال محمد بن إسحاق عن الحسن بن دينار وعمرو بن عبيد عن الحسن البصري أنه كان لا يشك في ذلك أن الذي أمر بذبحه من ابني إبراهيم إسماعيل عليه السلام قال ابن إسحاق وسمعت محمد بن كعب القرظي وهو يقول إن الذي أمر الله تعالى إبراهيم بذبحه من ابنيه إسماعيل وإنا لنجد ذلك في كتاب الله تعالى وذلك أن الله تعالى حين فرغ من قصة المذبوح من ابني إبراهيم قال الله تعالى \"وبشرناه بإسحاق نبيا من الصالحين\" ويقول الله تعالى \"فبشرناها بإسحاق ومن وراء إسحاق يعقوب\" يقول بابن وابن ابن فلم يكن ليأمره بذبح إسحاق وله فيه من الموعد بما وعده وما الذي أمر بذبحه إلا إسماعيل قال ابن إسحاق سمعته يقول ذلك كثيرا وقال ابن إسحاق عن بريدة بن سفيان الأسلمي عن محمد بن كعب القرظي أنه حدثهم أنه ذكر ذلك لعمر بن عبدالعزيز رضي الله عنه وهو خليفة إذ كان معه بالشام فقال له عمر إن هذا لشيء ما كنت أنظر فيه وإني لأراه كما قلت ثم أرسل إلى رجل كان عنده بالشام كان يهوديا فأسلم وحسن إسلامه وكان يرى أنه من علمائهم فسأله عمر بن عبدالعزيز رضي الله عنه عن ذلك قال محمد بن كعب وأنا عند عمر بن عبدالعزيز فقال له عمر أي ابني إبراهيم أمر بذبحه؟ فقال إسماعيل والله يا أمير المؤمنين وإن يهود لتعلم بذلك ولكنهم يحسدونكم معشر العرب على أن يكون أباكم الذي كان من أمر الله فيه والفضل الذي ذكر الله تعالى منه لصبره لما أمر به فهم يجحدون ذلك ويزعمون أنه إسحاق لأن إسحاق أبوهم والله أعلم أيهما كان وكل قد كان طاهرا طيبا مطيعا لله عز وجل وقال عبدالله بن الإمام أحمد بن حنبل رحمه الله سألت أبي عن الذبيح هل هو إسماعيل أو إسحاق فقال إسماعيل ذكره فى كتاب الزهد وقال ابن أبي حاتم وسمعت أبي يقول الصحيح أن الذبيح إسماعيل عليه الصلاة والسلام قال وروي عن علي وابن عمر وأبي هريرة وأبي الطفيل وسعيد بن المسيب وسعيد بن جبير والحسن ومجاهد والشعبي ومحمد بن كعب القرظي وأبي جعفر محمد بن علي وأبي صالح رضي الله عنهم أنهم قالوا الذبيح إسماعيل. وقال البغوي فى تفسيره وإليه ذهب عبدالله بن عمر وسعيد بن المسيب والسدي والحسن البصري ومجاهد والربيع بن أنس ومحمد بن كعب القرظي والكلبي وهو رواية عن ابن عباس وحكاه أيضا عن أبي عمرو بن العلاء وقد روى ابن جرير في ذلك حديثا غريبا فقال حدثني محمد بن عمار الرازي حدثنا إسماعيل بن عبيد بن أبي كريمة حدثنا عمر بن عبدالرحيم الخطابي عن عبيد الله بن محمد العتبي من ولد عتبة بن أبي سفيان عن أبيه حدثني عبدالله بن سعيد عن الصنابحي قال كنا عند معاوية بن أبي سفيان فذكروا الذبيح إسماعيل أو إسحاق فقال على الخبير سقطتم: كنا عند رسول الله صلى الله عليه وسلم فجاءه رجل فقال يا رسول الله عد علي مما أفاء الله عليك يا ابن الذبيحين فضحك رسول الله صلى الله عليه وسلم\" فقيل له يا أمير المؤمنين وما الذبيحان؟ فقال إن عبدالمطلب لما أمر بحفر زمزم نذر لله إن سهل الله له أمرها عليه ليذبحن أحد ولده قال فخرج السهم على عبدالله فمنعه أخواله وقالوا افد ابنك بمائة من الإبل ففداه بمائة من الإبل والثاني إسماعيل. وهذا حديث غريب جدا وقد رواه الأموي فى مغازيه حدثنا بعض أصحابنا أخبرنا إسماعيل بن عبيد بن أبي كريمة حدثنا عمرو بن عبد الرحمن القرشي حدثنا عبيد الله بن محمد العتبي من ولد عتبة بن أبي سفيان حدثنا عبدالله بن سعيد حدثنا الصنابحي قال حضرنا مجلس معاوية رضي الله عنه فتذاكر القوم إسماعيل أو إسحاق وذكره كذا كتبته من نسخة مغلوطة. وإنما عول ابن جرير في اختياره أن الذبيح إسحاق على قوله تعالى \"فبشرناه بغلام حليم\" فجعل هذه البشارة هي البشارة بإسحاق في قوله تعالى \"وبشروه بغلام عليم\" وأجاب عن البشارة بيعقوب بأنه قد كان بلغ معه السعي أي العمل ومن الممكن أنه قد كان ولد له أولاد مع يعقوب أيضا قال وأما القرنان اللذان كانا معلقين بالكعبة فمن الجائز أنهما نقلا من بلاد كنعان قال وقد تقدم أن من الناس من ذهب إلى أنه ذبح إسحاق هناك هذا ما اعتمد عليه في تفسيره وليس إليه بمذهب ولا لازم بل هو بعيد جدا والذي استدل به محمد بن كعب القرظي على أنه إسماعيل أثبت وأصح وأقوى والله أعلم."
    },
    {
      "ayah": 11,
      "surah": 37,
      "text": "يقول تعالى: فسل هؤلاء المنكرين للبعث أيما أشد خلقا هم أم السموات والأرض وما بينهما من الملائكة والشياطين والمخلوقات العظيمة؟ وقرأ ابن مسعود رضي الله عنه \"أم من عددنا\" فإنهم يقرون أن هذه المخلوقات أشد خلقا منهم منهم وإذا كان الأمر كذلك فلم ينكرون البعث وهم يشاهدون ما هو أعظم مما أنكروا كما قال عز وجل \"لخلق السموات والأرض أكبر من خلق الناس ولكن أكثر الناس لا يعلمون\" ثم بين أنهم خلقوا من شيء ضعيف فقال \"إنا خلقناهم من طين لازب\" قال مجاهد وسعيد بن جبير والضحاك هو الجيد الذي يلتزق بعضه ببعض وقال ابن عباس رضي الله عنهما وعكرمة هو اللزج الجيد وقال قتادة هو الذي يلزق باليد."
    },
    {
      "ayah": 110,
      "surah": 37,
      "text": "وقوله تعالى \"وفديناه بذبح عظيم\" قال سفيان الثوري عن جابر الجعفي عن أبي الطفيل عن علي رضي الله عنه \"وفديناه بذبح عظيم\" قال بكبش أبيض أعين أقرن قد ربط بسمرة قال أبو الطفيل وجدوه مربوطا بسمرة في ثبير وقال الثوري أيضا عن عبدالله بن عثمان بن خثيم عن سعيد بن جبير عن ابن عباس رضي الله عنهما قال كبش قد رعا في الجنة أربعين خريفا. وقال ابن أبي حاتم حدثنا أبي حدثنا يوسف بن يعقوب الصفار حدثنا داود العطار عن ابن خثيم عن سعيد بن جبير عن ابن عباس رضي الله عنهما قال الصخرة التي بمنى بأصل ثبير هي الصخرة التي ذبح عليها إبراهيم فداء إسحاق ابنه هبط عليه من ثبير كبش أعين أقرن له ثغاء فذبحه وهو الكبش الذي قربه ابن آدم فتقبل منه فكان مخزونا حتى فدى به إسحاق وروي أيضا عن سعيد بن جبير أنه قال كان الكبش يرتع فى الجنة حتى شقق عنه ثبير وكان عليه عهن أحمر وعن الحسن البصري أنه قال كان اسم كبش إبراهيم عليه الصلاة والسلام جرير وقال ابن جريج قال عبيد بن عمير ذبحه بالمقام وقال مجاهد ذبحه بمنى عند المنحر. وقال هشيم عن سيار عن عكرمة عن ابن عباس رضي الله عنهما كان أفتى الذي جعل عليه نذرا أن ينحر نفسه فأمره بمائة من الإبل ثم قال بعد ذلك لو كنت أفتيه بكبش لأجزأه أن يذبح كبشا فإن الله تعالى قال في كتابه \"وفديناه بذبح عظيم\" والصحيح الذي عليه الأكثرون أنه يفدي بكبش وقال الثوري عن رجل عن أبي صالح عن ابن عباس في قوله تعالى \"وفديناه بذبح عظيم\" قال وعل وقال محمد بن إسحاق عن عمرو بن عبيد عن الحسن أنه كان يقول ما فدي إسماعيل عليه السلام إلا بتيس من الأروى أهبط عليه من ثبير. وقد قال الإمام أحمد حدثنا سفيان حدثني منصور عن خاله مسافع عن صفية بنت شيبة قالت أخبرتني امرأة من بني سليم ولدت عامة أهل دارنا أرسل رسول الله صلى الله عليه وسلم إلى عثمان بن طلحة رضي الله عنه وقالت مرة إنها سألت عثمان لم دعاك النبي صلى الله عليه وسلم؟ قال: قال لي رسول الله صلى الله عليه وسلم \"إني كنت رأيت قرني الكبش حين دخلت البيت فنسيت أن آمرك أن تخمرهما فخمرهما فإنه لا ينبغي أن يكون في البيت شيء يشغل المصلي\" قال سفيان لم يزل قرنا الكبش معلقين في البيت حتى احترق البيت فاحترقا وهذا دليل مستقل على أنه إسماعيل عليه الصلاة والسلام فإن قريشا توارثوا قرني الكبش الذي فدى به إبراهيم خلفا عن سلف وجيلا بعد جيل إلى أن بعث الله رسوله صلى الله عليه وسلم. \"فصل في ذكر الآثار الواردة عن السلف في أن الذبيح من هو\" \"ذكر من قال هو إسحاق عليه الصلاة والسلام\" قال حمزة الزيات عن أبي ميسرة رحمه الله قال: قال يوسف عليه عليه الصلاة والسلام للملك في وجهه ترغب أن تأكل معي وأنا والله يوسف بن يعقوب نبي الله ابن إسحاق ذبيح الله بن إبراهيم خليل الله وقال الثوري عن أبى سنان عن ابن أبي الهذيل أن يوسف عليه السلام قال للملك كذلك أيضا وقال سفيان الثوري عن زيد بن أسلم عن عبدالله بن عبيد بن عمير عن أبيه قال: قال موسى عليه الصلاة والسلام يا رب يقولون بإله إبراهيم وإسحاق ويعقوب فبم قالوا ذلك؟ قال: إن إبراهيم لم يعدل بي شيء قط إلا اختارني عليه وإن إسحاق جاد لي بالذبح وهو بغير ذلك أجود وإن يعقوب كلما زدته بلاء زادني حسن ظن وقال شعبة عن أبي إسحاق عن أبي الأحوص قال افتخر رجل عند ابن مسعود رضي الله عنه فقال أنا فلان بن فلان ابن الأشياخ الكرام فقال عبدالله بن مسعود رضي الله عنه ذاك يوسف بن يعقوب بن إسحاق ذبيح الله بن إبراهيم خليل الله. وهذا صحيح عن ابن مسعود رضي الله عنه وكذا روى عكرمة عن ابن عباس رضي الله عنهما أنه إسحاق وعن أبيه العباس علي بن أبي طالب مثل ذلك وكذا قال عكرمة وسعيد بن جبير ومجاهد والشعبي وعبيد بن عمير وأبو ميسرة وزيد بن أسلم وعبدالله بن شقيق والزهري والقاسم بن أبي برزة ومكحول وعثمان بن أبي حاضر والسدي والحسن وقتادة وأبو الهذيل وابن سابط وهذا اختيار ابن جرير وتقدم روايته عن كعب الأحبار أنه إسحاق وهكذا روى ابن إسحاق عن عبدالله بن أبى بكر عن الزهري عن أبي سفيان عن العلاء بن جارية عن أبي هريرة رضي الله عنه عن كعب الأحبار أنه قال هو إسحاق وهذه الأقوال والله أعلم كلها مأخوذة عن كعب الأحبار فإنه لما أسلم في الدولة العمرية جعل يحدث عمر رضي الله عنه عن كتبه قديما فربما استمع له عمر رضي الله عنه فترخص الناس في استماع ما عنده ونقلوا ما عنده عنه غثها وسمينها وليس لهذه الأمة والله أعلم حاجة إلى حرف واحد مما عنده وقد حكى البغوي القول بأنه إسحاق عن عمر وعلي وابن مسعود والعباس رضي الله عنهم ومن التابعين عن كعب الأحبار وسعيد بن جبير وقتادة ومسروق عكرمة وعطاء و مقاتل والزهري والسدي قال وهو إحدى الروايتين عن ابن عباس رضي الله عنهما وقد ورد في ذلك حديث لو ثبت لقلنا به على الرأس والعين ولكن لم يصح سنده. قال ابن جرير حدثنا أبو كريب حدثنا زيد بن حباب عن الحسن بن دينار عن علي بن زيد بن جدعان عن الحسن عن الأحنف بن قيس عن العباس بن عبدالمطلب رضي الله عنه عن النبي صلى الله عليه وسلم في حديث ذكره قال \"هو إسحاق\" ففي إسناده ضعيفان وهما الحسن بن دينار البصري متروك وعلي بن زيد بن جدعان منكر الحديث وقد رواه ابن أبي حاتم عن أبيه عن مسلم بن إبراهيم عن حماد بن سلمة عن علي بن زيد بن جدعان به مرفوعا ثم قال قد رواه مبارك بن فضالة عن الحسن عن الأحنف عن العباس رضي الله عنه وهذا أشبه وأصح والله أعلم. \"ذكر الآثار الواردة بأنه إسماعيل عليه الصلاة والسلام وهو الصحيح المقطوع به\" قد تقدمت الرواية عن ابن عباس رضي الله عنهما أنه إسحاق عليه الصلاة والسلام والله تعالى أعلم وقال سعيد بن جبير وعامر الشعبي ويوسف بن مهران ومجاهد وعطاء وغير واحد عن ابن عباس رضي الله عنهما هو إسماعيل عليه الصلاة والسلام وقال ابن جرير حدثني يونس أخبرنا ابن وهب أخبرني عمرو بن قيس عن عطاء بن أبي رباح عن ابن عباس أنه قال المفدى إسماعيل عليه السلام وزعمت اليهود أنه إسحاق وكذبت اليهود وقال إسرائيل عن ثور عن مجاهد عن ابن عمر رضي الله عنهما قال الذبيح إسماعيل وقال ابن أبي نجيح عن مجاهد هو إسماعيل عليه السلام وكذا قال يوسف بن مهران وقال الشعبي هو إسماعيل عليه الصلاة والسلام وقد رأيت قرني الكبش في الكعبة وقال محمد بن إسحاق عن الحسن بن دينار وعمرو بن عبيد عن الحسن البصري أنه كان لا يشك في ذلك أن الذي أمر بذبحه من ابني إبراهيم إسماعيل عليه السلام قال ابن إسحاق وسمعت محمد بن كعب القرظي وهو يقول إن الذي أمر الله تعالى إبراهيم بذبحه من ابنيه إسماعيل وإنا لنجد ذلك في كتاب الله تعالى وذلك أن الله تعالى حين فرغ من قصة المذبوح من ابني إبراهيم قال الله تعالى \"وبشرناه بإسحاق نبيا من الصالحين\" ويقول الله تعالى \"فبشرناها بإسحاق ومن وراء إسحاق يعقوب\" يقول بابن وابن ابن فلم يكن ليأمره بذبح إسحاق وله فيه من الموعد بما وعده وما الذي أمر بذبحه إلا إسماعيل قال ابن إسحاق سمعته يقول ذلك كثيرا وقال ابن إسحاق عن بريدة بن سفيان الأسلمي عن محمد بن كعب القرظي أنه حدثهم أنه ذكر ذلك لعمر بن عبدالعزيز رضي الله عنه وهو خليفة إذ كان معه بالشام فقال له عمر إن هذا لشيء ما كنت أنظر فيه وإني لأراه كما قلت ثم أرسل إلى رجل كان عنده بالشام كان يهوديا فأسلم وحسن إسلامه وكان يرى أنه من علمائهم فسأله عمر بن عبدالعزيز رضي الله عنه عن ذلك قال محمد بن كعب وأنا عند عمر بن عبدالعزيز فقال له عمر أي ابني إبراهيم أمر بذبحه؟ فقال إسماعيل والله يا أمير المؤمنين وإن يهود لتعلم بذلك ولكنهم يحسدونكم معشر العرب على أن يكون أباكم الذي كان من أمر الله فيه والفضل الذي ذكر الله تعالى منه لصبره لما أمر به فهم يجحدون ذلك ويزعمون أنه إسحاق لأن إسحاق أبوهم والله أعلم أيهما كان وكل قد كان طاهرا طيبا مطيعا لله عز وجل وقال عبدالله بن الإمام أحمد بن حنبل رحمه الله سألت أبي عن الذبيح هل هو إسماعيل أو إسحاق فقال إسماعيل ذكره فى كتاب الزهد وقال ابن أبي حاتم وسمعت أبي يقول الصحيح أن الذبيح إسماعيل عليه الصلاة والسلام قال وروي عن علي وابن عمر وأبي هريرة وأبي الطفيل وسعيد بن المسيب وسعيد بن جبير والحسن ومجاهد والشعبي ومحمد بن كعب القرظي وأبي جعفر محمد بن علي وأبي صالح رضي الله عنهم أنهم قالوا الذبيح إسماعيل. وقال البغوي فى تفسيره وإليه ذهب عبدالله بن عمر وسعيد بن المسيب والسدي والحسن البصري ومجاهد والربيع بن أنس ومحمد بن كعب القرظي والكلبي وهو رواية عن ابن عباس وحكاه أيضا عن أبي عمرو بن العلاء وقد روى ابن جرير في ذلك حديثا غريبا فقال حدثني محمد بن عمار الرازي حدثنا إسماعيل بن عبيد بن أبي كريمة حدثنا عمر بن عبدالرحيم الخطابي عن عبيد الله بن محمد العتبي من ولد عتبة بن أبي سفيان عن أبيه حدثني عبدالله بن سعيد عن الصنابحي قال كنا عند معاوية بن أبي سفيان فذكروا الذبيح إسماعيل أو إسحاق فقال على الخبير سقطتم: كنا عند رسول الله صلى الله عليه وسلم فجاءه رجل فقال يا رسول الله عد علي مما أفاء الله عليك يا ابن الذبيحين فضحك رسول الله صلى الله عليه وسلم\" فقيل له يا أمير المؤمنين وما الذبيحان؟ فقال إن عبدالمطلب لما أمر بحفر زمزم نذر لله إن سهل الله له أمرها عليه ليذبحن أحد ولده قال فخرج السهم على عبدالله فمنعه أخواله وقالوا افد ابنك بمائة من الإبل ففداه بمائة من الإبل والثاني إسماعيل. وهذا حديث غريب جدا وقد رواه الأموي فى مغازيه حدثنا بعض أصحابنا أخبرنا إسماعيل بن عبيد بن أبي كريمة حدثنا عمرو بن عبد الرحمن القرشي حدثنا عبيد الله بن محمد العتبي من ولد عتبة بن أبي سفيان حدثنا عبدالله بن سعيد حدثنا الصنابحي قال حضرنا مجلس معاوية رضي الله عنه فتذاكر القوم إسماعيل أو إسحاق وذكره كذا كتبته من نسخة مغلوطة. وإنما عول ابن جرير في اختياره أن الذبيح إسحاق على قوله تعالى \"فبشرناه بغلام حليم\" فجعل هذه البشارة هي البشارة بإسحاق في قوله تعالى \"وبشروه بغلام عليم\" وأجاب عن البشارة بيعقوب بأنه قد كان بلغ معه السعي أي العمل ومن الممكن أنه قد كان ولد له أولاد مع يعقوب أيضا قال وأما القرنان اللذان كانا معلقين بالكعبة فمن الجائز أنهما نقلا من بلاد كنعان قال وقد تقدم أن من الناس من ذهب إلى أنه ذبح إسحاق هناك هذا ما اعتمد عليه في تفسيره وليس إليه بمذهب ولا لازم بل هو بعيد جدا والذي استدل به محمد بن كعب القرظي على أنه إسماعيل أثبت وأصح وأقوى والله أعلم."
    },
    {
      "ayah": 111,
      "surah": 37,
      "text": "وقوله تعالى \"وفديناه بذبح عظيم\" قال سفيان الثوري عن جابر الجعفي عن أبي الطفيل عن علي رضي الله عنه \"وفديناه بذبح عظيم\" قال بكبش أبيض أعين أقرن قد ربط بسمرة قال أبو الطفيل وجدوه مربوطا بسمرة في ثبير وقال الثوري أيضا عن عبدالله بن عثمان بن خثيم عن سعيد بن جبير عن ابن عباس رضي الله عنهما قال كبش قد رعا في الجنة أربعين خريفا. وقال ابن أبي حاتم حدثنا أبي حدثنا يوسف بن يعقوب الصفار حدثنا داود العطار عن ابن خثيم عن سعيد بن جبير عن ابن عباس رضي الله عنهما قال الصخرة التي بمنى بأصل ثبير هي الصخرة التي ذبح عليها إبراهيم فداء إسحاق ابنه هبط عليه من ثبير كبش أعين أقرن له ثغاء فذبحه وهو الكبش الذي قربه ابن آدم فتقبل منه فكان مخزونا حتى فدى به إسحاق وروي أيضا عن سعيد بن جبير أنه قال كان الكبش يرتع فى الجنة حتى شقق عنه ثبير وكان عليه عهن أحمر وعن الحسن البصري أنه قال كان اسم كبش إبراهيم عليه الصلاة والسلام جرير وقال ابن جريج قال عبيد بن عمير ذبحه بالمقام وقال مجاهد ذبحه بمنى عند المنحر. وقال هشيم عن سيار عن عكرمة عن ابن عباس رضي الله عنهما كان أفتى الذي جعل عليه نذرا أن ينحر نفسه فأمره بمائة من الإبل ثم قال بعد ذلك لو كنت أفتيه بكبش لأجزأه أن يذبح كبشا فإن الله تعالى قال في كتابه \"وفديناه بذبح عظيم\" والصحيح الذي عليه الأكثرون أنه يفدي بكبش وقال الثوري عن رجل عن أبي صالح عن ابن عباس في قوله تعالى \"وفديناه بذبح عظيم\" قال وعل وقال محمد بن إسحاق عن عمرو بن عبيد عن الحسن أنه كان يقول ما فدي إسماعيل عليه السلام إلا بتيس من الأروى أهبط عليه من ثبير. وقد قال الإمام أحمد حدثنا سفيان حدثني منصور عن خاله مسافع عن صفية بنت شيبة قالت أخبرتني امرأة من بني سليم ولدت عامة أهل دارنا أرسل رسول الله صلى الله عليه وسلم إلى عثمان بن طلحة رضي الله عنه وقالت مرة إنها سألت عثمان لم دعاك النبي صلى الله عليه وسلم؟ قال: قال لي رسول الله صلى الله عليه وسلم \"إني كنت رأيت قرني الكبش حين دخلت البيت فنسيت أن آمرك أن تخمرهما فخمرهما فإنه لا ينبغي أن يكون في البيت شيء يشغل المصلي\" قال سفيان لم يزل قرنا الكبش معلقين في البيت حتى احترق البيت فاحترقا وهذا دليل مستقل على أنه إسماعيل عليه الصلاة والسلام فإن قريشا توارثوا قرني الكبش الذي فدى به إبراهيم خلفا عن سلف وجيلا بعد جيل إلى أن بعث الله رسوله صلى الله عليه وسلم. \"فصل في ذكر الآثار الواردة عن السلف في أن الذبيح من هو\" \"ذكر من قال هو إسحاق عليه الصلاة والسلام\" قال حمزة الزيات عن أبي ميسرة رحمه الله قال: قال يوسف عليه عليه الصلاة والسلام للملك في وجهه ترغب أن تأكل معي وأنا والله يوسف بن يعقوب نبي الله ابن إسحاق ذبيح الله بن إبراهيم خليل الله وقال الثوري عن أبى سنان عن ابن أبي الهذيل أن يوسف عليه السلام قال للملك كذلك أيضا وقال سفيان الثوري عن زيد بن أسلم عن عبدالله بن عبيد بن عمير عن أبيه قال: قال موسى عليه الصلاة والسلام يا رب يقولون بإله إبراهيم وإسحاق ويعقوب فبم قالوا ذلك؟ قال: إن إبراهيم لم يعدل بي شيء قط إلا اختارني عليه وإن إسحاق جاد لي بالذبح وهو بغير ذلك أجود وإن يعقوب كلما زدته بلاء زادني حسن ظن وقال شعبة عن أبي إسحاق عن أبي الأحوص قال افتخر رجل عند ابن مسعود رضي الله عنه فقال أنا فلان بن فلان ابن الأشياخ الكرام فقال عبدالله بن مسعود رضي الله عنه ذاك يوسف بن يعقوب بن إسحاق ذبيح الله بن إبراهيم خليل الله. وهذا صحيح عن ابن مسعود رضي الله عنه وكذا روى عكرمة عن ابن عباس رضي الله عنهما أنه إسحاق وعن أبيه العباس علي بن أبي طالب مثل ذلك وكذا قال عكرمة وسعيد بن جبير ومجاهد والشعبي وعبيد بن عمير وأبو ميسرة وزيد بن أسلم وعبدالله بن شقيق والزهري والقاسم بن أبي برزة ومكحول وعثمان بن أبي حاضر والسدي والحسن وقتادة وأبو الهذيل وابن سابط وهذا اختيار ابن جرير وتقدم روايته عن كعب الأحبار أنه إسحاق وهكذا روى ابن إسحاق عن عبدالله بن أبى بكر عن الزهري عن أبي سفيان عن العلاء بن جارية عن أبي هريرة رضي الله عنه عن كعب الأحبار أنه قال هو إسحاق وهذه الأقوال والله أعلم كلها مأخوذة عن كعب الأحبار فإنه لما أسلم في الدولة العمرية جعل يحدث عمر رضي الله عنه عن كتبه قديما فربما استمع له عمر رضي الله عنه فترخص الناس في استماع ما عنده ونقلوا ما عنده عنه غثها وسمينها وليس لهذه الأمة والله أعلم حاجة إلى حرف واحد مما عنده وقد حكى البغوي القول بأنه إسحاق عن عمر وعلي وابن مسعود والعباس رضي الله عنهم ومن التابعين عن كعب الأحبار وسعيد بن جبير وقتادة ومسروق عكرمة وعطاء و مقاتل والزهري والسدي قال وهو إحدى الروايتين عن ابن عباس رضي الله عنهما وقد ورد في ذلك حديث لو ثبت لقلنا به على الرأس والعين ولكن لم يصح سنده. قال ابن جرير حدثنا أبو كريب حدثنا زيد بن حباب عن الحسن بن دينار عن علي بن زيد بن جدعان عن الحسن عن الأحنف بن قيس عن العباس بن عبدالمطلب رضي الله عنه عن النبي صلى الله عليه وسلم في حديث ذكره قال \"هو إسحاق\" ففي إسناده ضعيفان وهما الحسن بن دينار البصري متروك وعلي بن زيد بن جدعان منكر الحديث وقد رواه ابن أبي حاتم عن أبيه عن مسلم بن إبراهيم عن حماد بن سلمة عن علي بن زيد بن جدعان به مرفوعا ثم قال قد رواه مبارك بن فضالة عن الحسن عن الأحنف عن العباس رضي الله عنه وهذا أشبه وأصح والله أعلم. \"ذكر الآثار الواردة بأنه إسماعيل عليه الصلاة والسلام وهو الصحيح المقطوع به\" قد تقدمت الرواية عن ابن عباس رضي الله عنهما أنه إسحاق عليه الصلاة والسلام والله تعالى أعلم وقال سعيد بن جبير وعامر الشعبي ويوسف بن مهران ومجاهد وعطاء وغير واحد عن ابن عباس رضي الله عنهما هو إسماعيل عليه الصلاة والسلام وقال ابن جرير حدثني يونس أخبرنا ابن وهب أخبرني عمرو بن قيس عن عطاء بن أبي رباح عن ابن عباس أنه قال المفدى إسماعيل عليه السلام وزعمت اليهود أنه إسحاق وكذبت اليهود وقال إسرائيل عن ثور عن مجاهد عن ابن عمر رضي الله عنهما قال الذبيح إسماعيل وقال ابن أبي نجيح عن مجاهد هو إسماعيل عليه السلام وكذا قال يوسف بن مهران وقال الشعبي هو إسماعيل عليه الصلاة والسلام وقد رأيت قرني الكبش في الكعبة وقال محمد بن إسحاق عن الحسن بن دينار وعمرو بن عبيد عن الحسن البصري أنه كان لا يشك في ذلك أن الذي أمر بذبحه من ابني إبراهيم إسماعيل عليه السلام قال ابن إسحاق وسمعت محمد بن كعب القرظي وهو يقول إن الذي أمر الله تعالى إبراهيم بذبحه من ابنيه إسماعيل وإنا لنجد ذلك في كتاب الله تعالى وذلك أن الله تعالى حين فرغ من قصة المذبوح من ابني إبراهيم قال الله تعالى \"وبشرناه بإسحاق نبيا من الصالحين\" ويقول الله تعالى \"فبشرناها بإسحاق ومن وراء إسحاق يعقوب\" يقول بابن وابن ابن فلم يكن ليأمره بذبح إسحاق وله فيه من الموعد بما وعده وما الذي أمر بذبحه إلا إسماعيل قال ابن إسحاق سمعته يقول ذلك كثيرا وقال ابن إسحاق عن بريدة بن سفيان الأسلمي عن محمد بن كعب القرظي أنه حدثهم أنه ذكر ذلك لعمر بن عبدالعزيز رضي الله عنه وهو خليفة إذ كان معه بالشام فقال له عمر إن هذا لشيء ما كنت أنظر فيه وإني لأراه كما قلت ثم أرسل إلى رجل كان عنده بالشام كان يهوديا فأسلم وحسن إسلامه وكان يرى أنه من علمائهم فسأله عمر بن عبدالعزيز رضي الله عنه عن ذلك قال محمد بن كعب وأنا عند عمر بن عبدالعزيز فقال له عمر أي ابني إبراهيم أمر بذبحه؟ فقال إسماعيل والله يا أمير المؤمنين وإن يهود لتعلم بذلك ولكنهم يحسدونكم معشر العرب على أن يكون أباكم الذي كان من أمر الله فيه والفضل الذي ذكر الله تعالى منه لصبره لما أمر به فهم يجحدون ذلك ويزعمون أنه إسحاق لأن إسحاق أبوهم والله أعلم أيهما كان وكل قد كان طاهرا طيبا مطيعا لله عز وجل وقال عبدالله بن الإمام أحمد بن حنبل رحمه الله سألت أبي عن الذبيح هل هو إسماعيل أو إسحاق فقال إسماعيل ذكره فى كتاب الزهد وقال ابن أبي حاتم وسمعت أبي يقول الصحيح أن الذبيح إسماعيل عليه الصلاة والسلام قال وروي عن علي وابن عمر وأبي هريرة وأبي الطفيل وسعيد بن المسيب وسعيد بن جبير والحسن ومجاهد والشعبي ومحمد بن كعب القرظي وأبي جعفر محمد بن علي وأبي صالح رضي الله عنهم أنهم قالوا الذبيح إسماعيل. وقال البغوي فى تفسيره وإليه ذهب عبدالله بن عمر وسعيد بن المسيب والسدي والحسن البصري ومجاهد والربيع بن أنس ومحمد بن كعب القرظي والكلبي وهو رواية عن ابن عباس وحكاه أيضا عن أبي عمرو بن العلاء وقد روى ابن جرير في ذلك حديثا غريبا فقال حدثني محمد بن عمار الرازي حدثنا إسماعيل بن عبيد بن أبي كريمة حدثنا عمر بن عبدالرحيم الخطابي عن عبيد الله بن محمد العتبي من ولد عتبة بن أبي سفيان عن أبيه حدثني عبدالله بن سعيد عن الصنابحي قال كنا عند معاوية بن أبي سفيان فذكروا الذبيح إسماعيل أو إسحاق فقال على الخبير سقطتم: كنا عند رسول الله صلى الله عليه وسلم فجاءه رجل فقال يا رسول الله عد علي مما أفاء الله عليك يا ابن الذبيحين فضحك رسول الله صلى الله عليه وسلم\" فقيل له يا أمير المؤمنين وما الذبيحان؟ فقال إن عبدالمطلب لما أمر بحفر زمزم نذر لله إن سهل الله له أمرها عليه ليذبحن أحد ولده قال فخرج السهم على عبدالله فمنعه أخواله وقالوا افد ابنك بمائة من الإبل ففداه بمائة من الإبل والثاني إسماعيل. وهذا حديث غريب جدا وقد رواه الأموي فى مغازيه حدثنا بعض أصحابنا أخبرنا إسماعيل بن عبيد بن أبي كريمة حدثنا عمرو بن عبد الرحمن القرشي حدثنا عبيد الله بن محمد العتبي من ولد عتبة بن أبي سفيان حدثنا عبدالله بن سعيد حدثنا الصنابحي قال حضرنا مجلس معاوية رضي الله عنه فتذاكر القوم إسماعيل أو إسحاق وذكره كذا كتبته من نسخة مغلوطة. وإنما عول ابن جرير في اختياره أن الذبيح إسحاق على قوله تعالى \"فبشرناه بغلام حليم\" فجعل هذه البشارة هي البشارة بإسحاق في قوله تعالى \"وبشروه بغلام عليم\" وأجاب عن البشارة بيعقوب بأنه قد كان بلغ معه السعي أي العمل ومن الممكن أنه قد كان ولد له أولاد مع يعقوب أيضا قال وأما القرنان اللذان كانا معلقين بالكعبة فمن الجائز أنهما نقلا من بلاد كنعان قال وقد تقدم أن من الناس من ذهب إلى أنه ذبح إسحاق هناك هذا ما اعتمد عليه في تفسيره وليس إليه بمذهب ولا لازم بل هو بعيد جدا والذي استدل به محمد بن كعب القرظي على أنه إسماعيل أثبت وأصح وأقوى والله أعلم."
    },
    {
      "ayah": 112,
      "surah": 37,
      "text": "قوله تعالى \"وبشرناه بإسحاق نبيا من الصالحين\" لما تقدمت البشارة بالذبيح وهو إسماعيل عطف بذكر البشارة بأخيه إسحاق وقد ذكرت في سورتي هود والحجر قوله تعالى \"نبيا\" حال مقدرة أي سيصير منه نبي صالح. وقال ابن جرير حدثني يعقوب حدثنا ابن علية عن داود عن عكرمة قال: قال ابن عباس رضي الله عنهما الذبيح إسحاق قال وقوله تعالى \"وبشرناه بإسحاق نبيا من الصالحين\" قال بشر بنبوته - قال - وقوله تعالى \"ووهبنا له من رحمتنا أخاه هارون نبيا\" قال كان هارون أكبر من موسى ولكن أراد وهب له نبوته وحدثنا ابن عبدالأعلى حدثنا المعتمر بن سليمان قال سمعت داود يحدث عن عكرمة عن ابن عباس رضي الله عنهما في هذه الآية \"وبشرناه بإسحاق نبيا من الصالحين\" قال إنما بشر به نبيا من الصالحين قال إنما بشر به نبيا حين فداه الله عز وجل من الذبح ولم تكن البشارة بالنبوة عند مولده. وقال ابن أبي حاتم حدثنا أبي حدثنا أبو نعيم حدثنا سفيان الثوري عن داود عن عكرمة عن ابن عباس \"وبشرناه بإسحاق نبيا من الصالحين\" قال بشر به حين ولد وحين نبئ وقال سعيد بن أبي عروبة عن قتادة في قوله تعالى \"وبشرناه بإسحاق نبيا من الصالحين\" قال بعدما كان من أمره لما جاد الله تعالى بنفسه وقال الله عز وجل \"وباركنا عليه وعلى إسحاق\"."
    },
    {
      "ayah": 113,
      "surah": 37,
      "text": "كقوله تعالى \"قيل يا نوح اهبط بسلام منا وبركات عليك وعلى أمم ممن معك وأمم سنمتعهم ثم يمسهم منا عذاب أليم\"."
    },
    {
      "ayah": 114,
      "surah": 37,
      "text": "يذكر تعالى ما أنعم به على موسى وهارون من النبوة والنجاة بمن آمن معهما من قهر فرعون وقومه وما كان يعتمد في حقهم من الإساءة العظيمة من قتل الأبناء واستحياء النساء واستعمالهم في أخس الأشياء ثم بعد هذا كله نصرهم عليهم وأقر أعينهم منهم فغلبوهم وأخذوا أرضهم وأموالهم وما كانوا جمعوه طول حياتهم ثم أنزل الله عز وجل على موسى الكتاب العظيم الواضح الجلي المستبين وهو التوراة كما قال تعالى \"ولقد آتينا موسى وهارون الفرقان وضياء\"."
    },
    {
      "ayah": 115,
      "surah": 37,
      "text": "يذكر تعالى ما أنعم به على موسى وهارون من النبوة والنجاة بمن آمن معهما من قهر فرعون وقومه وما كان يعتمد في حقهم من الإساءة العظيمة من قتل الأبناء واستحياء النساء واستعمالهم في أخس الأشياء ثم بعد هذا كله نصرهم عليهم وأقر أعينهم منهم فغلبوهم وأخذوا أرضهم وأموالهم وما كانوا جمعوه طول حياتهم ثم أنزل الله عز وجل على موسى الكتاب العظيم الواضح الجلي المستبين وهو التوراة كما قال تعالى \"ولقد آتينا موسى وهارون الفرقان وضياء\"."
    },
    {
      "ayah": 116,
      "surah": 37,
      "text": "يذكر تعالى ما أنعم به على موسى وهارون من النبوة والنجاة بمن آمن معهما من قهر فرعون وقومه وما كان يعتمد في حقهم من الإساءة العظيمة من قتل الأبناء واستحياء النساء واستعمالهم في أخس الأشياء ثم بعد هذا كله نصرهم عليهم وأقر أعينهم منهم فغلبوهم وأخذوا أرضهم وأموالهم وما كانوا جمعوه طول حياتهم ثم أنزل الله عز وجل على موسى الكتاب العظيم الواضح الجلي المستبين وهو التوراة كما قال تعالى \"ولقد آتينا موسى وهارون الفرقان وضياء\"."
    },
    { "ayah": 117, "surah": 37, "text": "أى في الأقوال والأفعال." },
    { "ayah": 118, "surah": 37, "text": "أى في الأقوال والأفعال." },
    {
      "ayah": 119,
      "surah": 37,
      "text": "\"وتركنا عليهما في الآخرين\" أي أبقينا لهما من بعدهما ذكرا جميلا وثناء حسنا ثم فسره بقوله تعالى \"سلام على موسى وهارون إنا كذلك نجزي المحسنين إنهما من عبادنا المؤمنين\"."
    },
    {
      "ayah": 12,
      "surah": 37,
      "text": "وقوله عز وجل بل عجبت ويسخرون أى بل عجبت يا محمد من تكذيب هؤلاء المنكرين للبعث وأنت موقن مصدق بما أخبر الله تعالى من الأمر العجيب وهو إعادة الأجسام بعد فنائها وهم بخلاف أمرك من شدة تكذيبهم يسخرون مما تقول لهم من ذلك."
    },
    {
      "ayah": 120,
      "surah": 37,
      "text": "\"وتركنا عليهما في الآخرين\" أي أبقينا لهما من بعدهما ذكرا جميلا وثناء حسنا ثم فسره بقوله تعالى \"سلام على موسى وهارون إنا كذلك نجزي المحسنين إنهما من عبادنا المؤمنين\"."
    },
    {
      "ayah": 121,
      "surah": 37,
      "text": "\"وتركنا عليهما في الآخرين\" أي أبقينا لهما من بعدهما ذكرا جميلا وثناء حسنا ثم فسره بقوله تعالى \"سلام على موسى وهارون إنا كذلك نجزي المحسنين إنهما من عبادنا المؤمنين\"."
    },
    {
      "ayah": 122,
      "surah": 37,
      "text": "\"وتركنا عليهما في الآخرين\" أي أبقينا لهما من بعدهما ذكرا جميلا وثناء حسنا ثم فسره بقوله تعالى \"سلام على موسى وهارون إنا كذلك نجزي المحسنين إنهما من عبادنا المؤمنين\"."
    },
    {
      "ayah": 123,
      "surah": 37,
      "text": "قال قتادة ومحمد بن إسحاق يقال إلياس هو إدريس وقال ابن أبي حاتم حدثنا أبي حدثنا أبو نعيم حدثنا إسرائيل عن أبي إسحاق عن عبيدة بن ربحة عن عبدالله بن مسعود رضي الله عنه قال: إلياس هو إدريس وكذا قال الضحاك وقال وهب بن منبه هو إلياس بن نسي بن فنحاص بن العيزار بن هارون بن عمران بعثه الله تعالى في بني إسرائيل بعد حزقيل رضي الله عنهما وكانوا قد عبدوا صنما يقال له بعل فدعاهم إلى الله تعالى ونهاهم عن عبادة ما سواه وكان قد آمن به ملكهم ثم ارتد واستمروا على ضلالتهم ولم يؤمن به منهم أحد فدعا الله عليهم فحبس عنهم القطر ثلاث سنين ثم سألوه أن يكشف ذلك عنهم ووعدوه الإيمان به إن هم أصابهم المطر فدعا الله تعالى لهم فجاءهم الغيث فاستمروا على أخبث ما كانوا عليه من الكفر فسأل الله أن يقبضه إليه وكان قد نشأ على يديه اليسع بن أخطوب عليهما الصلاة والسلام فأمر إلياس أن يذهب إلى مكان كذا وكذا فمهما جاءه فليركبه ولا يهبه فجاءته فرس من نار فركب وألبسه الله تعالى النور وكساه الريش وكان يطير مع الملائكة ملكا إنسيا سماويا أرضيا هكذا حكاه وهب بن منبه عن أهل الكتاب والله أعلم بصحته."
    },
    { "ayah": 124, "surah": 37, "text": "أي ألا تخافون الله عز وجل فى عبادتكم غيره." },
    {
      "ayah": 125,
      "surah": 37,
      "text": "قال ابن عباس رضي الله عنهما ومجاهد وعكرمة وقتادة والسدي بعلا يعني ربا قال عكرمة وقتادة وهي لغة أهل اليمن وفي رواية عن قتادة قال: وهي لغة أزد شنوءة وقال ابن إسحاق أخبرني بعض أهل العلم أنهم كانوا يعبدون امرأة اسمها بعل وقال عبدالرحمن بن زيد بن أسلم عن أبيه هو اسم صنم كان يعبده أهل مدينة يقال لها بعلبك غربي دمشق وقال الضحاك هو صنم كانوا يعبدونه وقوله تعالى \"أتدعون بعلا\" أي أتعبدون صنما \"وتذرون أحسن الخالقين\"."
    },
    { "ayah": 126, "surah": 37, "text": "أي هو المستحق للعبادة وحده لا شريك له." },
    { "ayah": 127, "surah": 37, "text": "أي للعذاب يوم الحساب." },
    { "ayah": 128, "surah": 37, "text": "أي الموحدين منهم وهذا استثناء منقطع من مثبت." },
    { "ayah": 129, "surah": 37, "text": "أي ثناء جميلا." },
    {
      "ayah": 13,
      "surah": 37,
      "text": "وقوله عز وجل بل عجبت ويسخرون أى بل عجبت يا محمد من تكذيب هؤلاء المنكرين للبعث وأنت موقن مصدق بما أخبر الله تعالى من الأمر العجيب وهو إعادة الأجسام بعد فنائها وهم بخلاف أمرك من شدة تكذيبهم يسخرون مما تقول لهم من ذلك."
    },
    {
      "ayah": 130,
      "surah": 37,
      "text": "كما يقال في إسماعيل إسماعين وهي لغة بني أسد وأنشد بعض بني تميم في ضب صاده: يقول رب السوق لما جينا هذا ورب البيت إسرائينا ويقال ميكال وميكائيل وميكائين وإبراهيم وإبراهام وإسرائيل وإسرائين وطور سيناء وطور سنين وهو موضع واحد وكل هذا سائغ وقرأ آخرون \" سلام على إدراسين \"وهي قراءة ابن مسعود رضي الله عنه آخرون \" سلام على آل ياسين \"يعني آل محمد صلى الله عليه وسلم."
    },
    {
      "ayah": 131,
      "surah": 37,
      "text": "وقوله تعالى \"إنا كذلك نجزي المحسنين إنه من عبادنا المؤمنين\" قد تقدم تفسيره والله تعالى أعلم."
    },
    {
      "ayah": 132,
      "surah": 37,
      "text": "وقوله تعالى \"إنا كذلك نجزي المحسنين إنه من عبادنا المؤمنين\" قد تقدم تفسيره والله تعالى أعلم."
    },
    { "ayah": 133, "surah": 37, "text": "يخبر تعالى عن عبده ورسوله لوط رضي الله عنهما أنه بعثه إلى قومه." },
    { "ayah": 134, "surah": 37, "text": "فكذبوه فنجاه الله تعالى من بين أظهرهم هو وأهله." },
    { "ayah": 135, "surah": 37, "text": "إلا امرأته فإنها هلكت مع من هلك من قومها." },
    {
      "ayah": 136,
      "surah": 37,
      "text": "فإن الله تعالى أهلكهم بأنواع من العقوبات وجعل محلتهم من الأرض بحيرة منتنة قبيحة المنظر والطعم والريح وجعلها بسبيل مقيم يمر بها المسافرون ليلا ونهارا."
    },
    { "ayah": 137, "surah": 37, "text": "لا يوجد تفسير لهذه الأية" },
    {
      "ayah": 138,
      "surah": 37,
      "text": "ولهذا قال تعالى \"وإنكم لتمرون عليهم مصبحين وبالليل أفلا تعقلون\" أي أفلا تعتبرون بهم كيف دمر الله عليهم وتعلمون أن للكافرين أمثالها؟."
    },
    {
      "ayah": 139,
      "surah": 37,
      "text": "قد تقدمت قصة يونس عليه الصلاة والسلام في سورة الأنبياء وفي الصحيحين عن رسول الله صلى الله عليه وسلم أنه قال \"ما ينبغي لعبد أن يقول أنا خير من يونس بن متى\" ونسبه إلى أمه وفي رواية إلى أبيه."
    },
    {
      "ayah": 14,
      "surah": 37,
      "text": "قال قتادة عجب محمد صلى الله عليه وسلم وسخر ضلال بني آدم \"وإذا رأوا آية\" أي دلالة واضحة على ذلك \"يستسخرون\" قال مجاهد وقتادة يستهزئون."
    },
    {
      "ayah": 140,
      "surah": 37,
      "text": "قوله تعالى \"إذا أبق إلى الفلك المشحون\" قال ابن عباس رضي الله عنهما هو الموقر أي المملوء بالأمتعة."
    },
    {
      "ayah": 141,
      "surah": 37,
      "text": "\"فساهم\" أي قارع \"فكان من المدحضين\" أي المغلوبين وذلك أن السفينة تلعبت بها الأمواج من كل جانب وأشرفوا على الغرق فساهموا على من تقع عليه القرعة يلقى في البحر لتخف بهم السفينة فوقعت القرعة على نبي الله يونس عليه الصلاة والسلام ثلاث مرات وهم يضنون به أن يلقى من بينهم فتجرد من ثيابه ليلقي نفسه وهم يأبون عليه ذلك."
    },
    {
      "ayah": 142,
      "surah": 37,
      "text": "وأمر الله تعالى حوتا من البحر الأخضر أن يشق البحار وأن يلتقم يونس عليه السلام فلا يهشم له لحما ولا يكسر له عظما فجاء ذلك الحوت وألقى يونس عليه السلام نفسه فالتقمه الحوت وذهب به فطاف به البحار كلها. ولما استقر يونس في بطن الحوت حسب أنه قد مات ثم حرك رأسه ورجليه وأطرافه فإذا هو حي فقام فصلى في بطن الحوت وكان من جملة دعائه يا رب اتخذت لك مسجدا في موضع لم يبلغه أحد من الناس واختلفوا في مقدار ما لبث فى بطن الحوت فقيل ثلاثة أيام قاله قتادة وقيل سبعة قاله جعفر الصادق رضي الله عنه وقيل أربعين يوما قاله أبو مالك وقال مجاهد عن الشعبي: التقمه ضحى ولفظه عشية والله تعالى أعلم بمقدار ذلك وفي شعر أمية بن أبي الصلت: وأنت بفضل منك نجيت يونسا وقد بات في أضعاف حوت لياليا."
    },
    {
      "ayah": 143,
      "surah": 37,
      "text": "وقوله تعالى \"فلولا أنه كان من المسبحين للبث في بطنه إلى يوم يبعثون\" قيل لولا ما تقدم له من العمل في الرخاء قاله الضحاك بن قيس وأبو العالية ووهب بن منبه وقتادة وغير واحد واختاره ابن جرير وقد ورد في الحديث الذي سنورده إن شاء الله تعالى ما يدل على ذلك إن صح الخبر وفي حديث ابن عباس \"تعرف إلى الله في الرخاء يعرفك في الشدة\". وقال ابن عباس رضي الله عنهما وسعيد بن جبير والضحاك وعطاء بن السائب والسدي والحسن وقتادة \"فلولا أنه كان من المسبحين\" يعني المصلين وصرح بعضهم بأنه كان من المصلين قبل ذلك وقال بعضهم كان من المسبحين في جوف أبويه وقيل المراد \"فلولا أنه كان من المسبحين\" هو قوله عز وجل \"فنادى في الظلمات أن لا إله إلا أنت سبحانك إني كنت من الظالمين فاستجبنا له ونجيناه من الغم وكذلك ننجي المؤمنين\" قاله سعيد بن جبير وغيره. وقال ابن أبي حاتم حدثنا أبو عبيد الله بن أخي بن وهب حدثنا عمي حدثنا أبو صخر أن يزيد الرقاشي حدثه أنه سمع أنس بن مالك رضي الله عنه - ولا أعلم أنسا إلا يرفع الحديث إلى رسول الله صلى الله عليه وسلم - \"أن يونس النبي عليه الصلاة والسلام حين بدا له أن يدعو بهذه الكلمات وهو في بطن الحوت فقال اللهم لا إله إلا أنت سبحانك إني كنت من الظالمين فأقلبت الدعوة تحن بالعرش قالت الملائكة يا رب هذا صوت ضعيف معروف من بلاد بعيده غريبة فقال الله تعالى أما تعرفون ذلك قالوا يا رب ومن هو؟ قال عز وجل عبدي يونس قالوا عبدك يونس الذي لم يزل يرفع له عمل متقبل ودعوة مستجابة؟ قالوا يا رب أولا ترحم ما كان يصنع في الرخاء فتنجيه في البلاء؟ قال بلى فأمر الحوت فطرحه بالعراء\" ورواه ابن جرير عز يونس عن ابن وهب به زاد ابن أبي حاتم قال أبو صخر حميد بن زياد فأخبرني ابن قسيط وأنا أحدثه هذا الحديث أنه سمع أبا هريرة رضي الله عنه يقول: طرح بالعراء وأنبت الله عز وجل عليه اليقطينة قلنا يا أبا هريرة وما اليقطينة؟ قال شجرة الدباء. قال أبو هريرة رضي الله عنه: وهيأ الله له أروية وحشية تأكل من خشاش الأرض - أو قال هشاش الأرض - قال فتتفشح عليه فترويه من لبنها كل عشية وبكرة حتى نبت وقال أمية بن أبي الصلت في ذلك بيتا من شعره وهو: فأنبت يقطينا عليه برحمة من الله لولا الله ألقي ضاحيا."
    },
    {
      "ayah": 144,
      "surah": 37,
      "text": "وقوله تعالى \"فلولا أنه كان من المسبحين للبث في بطنه إلى يوم يبعثون\" قيل لولا ما تقدم له من العمل في الرخاء قاله الضحاك بن قيس وأبو العالية ووهب بن منبه وقتادة وغير واحد واختاره ابن جرير وقد ورد في الحديث الذي سنورده إن شاء الله تعالى ما يدل على ذلك إن صح الخبر وفي حديث ابن عباس \"تعرف إلى الله في الرخاء يعرفك في الشدة\". وقال ابن عباس رضي الله عنهما وسعيد بن جبير والضحاك وعطاء بن السائب والسدي والحسن وقتادة \"فلولا أنه كان من المسبحين\" يعني المصلين وصرح بعضهم بأنه كان من المصلين قبل ذلك وقال بعضهم كان من المسبحين في جوف أبويه وقيل المراد \"فلولا أنه كان من المسبحين\" هو قوله عز وجل \"فنادى في الظلمات أن لا إله إلا أنت سبحانك إني كنت من الظالمين فاستجبنا له ونجيناه من الغم وكذلك ننجي المؤمنين\" قاله سعيد بن جبير وغيره. وقال ابن أبي حاتم حدثنا أبو عبيد الله بن أخي بن وهب حدثنا عمي حدثنا أبو صخر أن يزيد الرقاشي حدثه أنه سمع أنس بن مالك رضي الله عنه - ولا أعلم أنسا إلا يرفع الحديث إلى رسول الله صلى الله عليه وسلم - \"أن يونس النبي عليه الصلاة والسلام حين بدا له أن يدعو بهذه الكلمات وهو في بطن الحوت فقال اللهم لا إله إلا أنت سبحانك إني كنت من الظالمين فأقلبت الدعوة تحن بالعرش قالت الملائكة يا رب هذا صوت ضعيف معروف من بلاد بعيده غريبة فقال الله تعالى أما تعرفون ذلك قالوا يا رب ومن هو؟ قال عز وجل عبدي يونس قالوا عبدك يونس الذي لم يزل يرفع له عمل متقبل ودعوة مستجابة؟ قالوا يا رب أولا ترحم ما كان يصنع في الرخاء فتنجيه في البلاء؟ قال بلى فأمر الحوت فطرحه بالعراء\" ورواه ابن جرير عز يونس عن ابن وهب به زاد ابن أبي حاتم قال أبو صخر حميد بن زياد فأخبرني ابن قسيط وأنا أحدثه هذا الحديث أنه سمع أبا هريرة رضي الله عنه يقول: طرح بالعراء وأنبت الله عز وجل عليه اليقطينة قلنا يا أبا هريرة وما اليقطينة؟ قال شجرة الدباء. قال أبو هريرة رضي الله عنه: وهيأ الله له أروية وحشية تأكل من خشاش الأرض - أو قال هشاش الأرض - قال فتتفشح عليه فترويه من لبنها كل عشية وبكرة حتى نبت وقال أمية بن أبي الصلت في ذلك بيتا من شعره وهو: فأنبت يقطينا عليه برحمة من الله لولا الله ألقي ضاحيا."
    },
    {
      "ayah": 145,
      "surah": 37,
      "text": "وقد تقدم حديث أبي هريرة رضي الله عنه مسندا مرفوعا في تفسير سورة الأنبياء ولهذا قال تعالى \"فنبذناه\" أي لقيناه \"بالعراء\" قال ابن عباس رضي الله عنهما وغيره وهي الأرض التي ليس بها نبت ولا بناء قيل على جانب دجلة وقيل بأرض اليمن فالله أعلم \"وهو سقيم\" أي ضعيف البدن قال ابن مسعود رضي الله عنه كهيئة الفرخ ليس عليه ريش وقال السدي كهيئة الظبي حين يولد وهو المنفوس وقاله ابن عباس رضي الله عنهما وابن زيد أيضا."
    },
    {
      "ayah": 146,
      "surah": 37,
      "text": "قال ابن مسعود وابن عباس رضي الله عنهم ومجاهد وعكرمة وسعيد بن جبير ووهب بن منبه وهلال بن يساف وعبدالله بن طاوس والسدي وقتادة والضحاك وعطاء الخراساني وغير واحد قالوا كلهم اليقطين هو القرع وقال هشيم عن القاسم بن أبي أيوب عن سعيد بن جبير وكل شجرة لا ساق لها فهي من اليقطين وفي رواية عنه كل شجرة تهلك من عامها فهي من اليقطين وذكر بعضهم في القرع فوائد منها سرعة نباته وتظليل ورقه لكبره ونعومته وأنه لا يقربها الذباب وجودة تغذية ثمره وأنه يؤكل نيئا ومطبوخا وقشره أيضا وقد ثبت أن رسول الله صلى الله عليه وسلم كان يحب الدباء ويتتبعه من نواحي الصحفة."
    },
    {
      "ayah": 147,
      "surah": 37,
      "text": "وقوله تعالى \"وأرسلناه إلى مائة ألف أو يزيدون\" روى شهر بن حوشب عن ابن عباس رضي الله عنهما أنه قال إنما كانت رسالة يونس عليه الصلاة والسلام بعدما نبذه الحوت رواه ابن جرير حدثني الحارث حدثنا أبو هلال عن شهر به وقال ابن أبي نجيح عن مجاهد أرسل إليهم قبل أن يلتقمه الحوت \"قلت\" ولا مانع أن يكون الذين أرسل إليهم أولا أمر بالعود إليهم بعد خروجه من الحوت فصدقوه كلهم وآمنوا به وحكى البغوي أنه أرسل إلى أمة أخرى بعد خروجه من الحوت كانوا مائة ألف أو يزيدون وقوله تعالى \"أو يزيدون\" قال ابن عباس رضي الله عنهما في رواية عنه: بل يزيدون وكانوا مائة وثلاثين ألفا وعنه مائة ألف وبضعة وثلاثين ألفا وعنه مائة ألف وبضعة وأربعين ألفا والله أعلم وقال سعيد بن جبير يزيدون سبعين ألفا وقال مكحول كانوا مائة ألف وعشرة آلاف رواه ابن أبي حاتم وقال ابن جرير حدثنا محمد بن عبدالرحيم البرقي حدثنا عمرو بن أبي سلمة قال سمعت زهيرا يحدث عمن سمع أبا العالية يقول حدثني أبي بن كعب رضي الله عنه أنه سأل رسول الله صلى الله عليه وسلم عن قوله تعالى \"وأرسلناه إلى مائة ألف أو يزيدون\" قال \"يزيدون عشرين ألفا ورواه الترمذي عن علي بن حجر عن الوليد بن مسلم عن زهير عن رجل عن أبي العالية عن أبي بن كعب به وقال غريب رواه ابن أبي حاتم من حديث زهير به قال ابن جرير: وكان بعض أهل العربية من أهل البصرة يقول في ذلك معناه إلى المائة الألف أو كانوا يزيدون عندكم يقول كذلك كانوا عندكم ولهذا سلك ابن جرير ههنا ما سلكه عند قوله تعالى \"ثم قست قلوبكم من بعد ذلك فهي كالحجارة أو أشد قسوة\" وقوله تعالى \"إذا فريق منهم يخشون الناس كخشية الله أو أشد خشية\" وقوله تعالى \"فكان قاب قوسين أو أدنى\" المراد ليس أنقص من ذلك بل أزيد."
    },
    {
      "ayah": 148,
      "surah": 37,
      "text": "وقوله تعالى \"فآمنوا\" أي فآمن هؤلاء القوم الذين أرسل إليهم يونس عليه السلام جميعهم \"فمتعناهم إلى حين\" أي إلى وقت آجالهم كقوله جلت عظمته \"فلولا كانت قرية آمنت فنفعها إيمانها إلا قوم يونس لما آمنوا كشفنا عنهم عذاب الخزي في الحياة الدنيا ومتعناهم إلى حين\"."
    },
    {
      "ayah": 149,
      "surah": 37,
      "text": "يقول تعالى منكرا على هؤلاء المشركين في جعلهم لله تعالى البنات سبحانه ولهم ما يشتهون أي من الذكور أي يودون لأنفسهم الجيد \"وإذا بشر أحدهم بالأنثى ظل وجهه مسودا وهو كظيم\" أي يسوءه ذلك ولا يختار لنفسه إلا البنين يقول عز وجل فكيف نسبوا إلى الله تعالى القسم الذي لا يختارونه لأنفسهم ولهذا قال تعالى \"فاستفتهم\" أي سلهم على سبيل الإنكار عليهم \"ألربك البنات ولهم البنون\" كقوله عز وجل \"ألكم الذكر وله الأنثى تلك إذا قسمة ضيزى\"."
    },
    { "ayah": 15, "surah": 37, "text": "أي إن هذا الذي جئت به إلا سحر مبين." },
    {
      "ayah": 150,
      "surah": 37,
      "text": "أي كيف حكموا على الملائكة أنهم إناث وما شاهدوا خلقهم كقوله جل وعلا \"وجعلوا الملائكة الذين هم عباد الرحمن إناثا أشهدوا خلقهم ستكتب شهادتهم ويسئلون أي يسئلون عن ذلك يوم القيامة."
    },
    {
      "ayah": 151,
      "surah": 37,
      "text": "قوله جلت عظمته \"ألا إنهم من إفكهم\" أي من كذبهم \"ليقولون ولد الله\" أي صدر منه الولد \"وإنهم لكاذبون\" فذكر الله تعالى عنهم في الملائكة ثلاثة أقوال فى غاية الكفر والكذب فأولا جعلوهم بنات الله فجعلوا لله ولدا تعالى وتقدس وجعلوا ذلك الولد أنثى ثم عبدوهم من دون الله تعالى وتقدس وكل منها كاف في التخليد في نار جهنم."
    },
    {
      "ayah": 152,
      "surah": 37,
      "text": "قوله جلت عظمته \"ألا إنهم من إفكهم\" أي من كذبهم \"ليقولون ولد الله\" أي صدر منه الولد \"وإنهم لكاذبون\" فذكر الله تعالى عنهم في الملائكة ثلاثة أقوال فى غاية الكفر والكذب فأولا جعلوهم بنات الله فجعلوا لله ولدا تعالى وتقدس وجعلوا ذلك الولد أنثى ثم عبدوهم من دون الله تعالى وتقدس وكل منها كاف في التخليد في نار جهنم."
    },
    {
      "ayah": 153,
      "surah": 37,
      "text": "قال تعالى منكرا عليهم \"أصطفى البنات على البنين\" أي أي شيء يحمله عن أن يختار البنات دون البنين كقوله عز وجل \"أفأصفاكم ربكم بالبنين واتخذ من الملائكة إناثا إنكم لتقولون قولا عظيما\" ولهذا قال تبارك وتعالى \"ما لكم كيف تحكمون\" أي ما لكم عقول تتدبرون بها ما تقولون."
    },
    {
      "ayah": 154,
      "surah": 37,
      "text": "قال تعالى منكرا عليهم \"أصطفى البنات على البنين\" أي أي شيء يحمله عن أن يختار البنات دون البنين كقوله عز وجل \"أفأصفاكم ربكم بالبنين واتخذ من الملائكة إناثا إنكم لتقولون قولا عظيما\" ولهذا قال تبارك وتعالى \"ما لكم كيف تحكمون\" أي ما لكم عقول تتدبرون بها ما تقولون."
    },
    { "ayah": 155, "surah": 37, "text": "\"أفلا تذكرون أم لكم سلطان مبين\" أي حجة على ما تقولونه؟." },
    { "ayah": 156, "surah": 37, "text": "\"أفلا تذكرون أم لكم سلطان مبين\" أي حجة على ما تقولونه؟." },
    {
      "ayah": 157,
      "surah": 37,
      "text": "أى هاتوا برهانا على ذلك يكون مستندا إلى كتاب منزل من السماء عن الله تعالى أنه اتخذ ما تقولونه فإن ما تقولونه لا يمكن استناده إلى عقل بل لا يجوزه العقل بالكلية."
    },
    {
      "ayah": 158,
      "surah": 37,
      "text": "وقوله تعالى \"وجعلوا بينه وبين الجنة نسبا\" قال مجاهد قال المشركون الملائكة بنات الله تعالى فقال أبو بكر رضي الله عنه عنه فمن أمهاتهن؟ قالوا بنات سروات الجن وكذا قال قتادة وابن زيد ولهذا قال تبارك وتعالى \"ولقد علمت الجنة\" أي الذين نسبوا إليهم ذلك \"إنهم لمحضرون\" أي إن الذين قالوا ذلك لمحضرون في العذاب يوم الحساب لكذبهم في ذلك وافترائهم وقولهم الباطل بلا علم وقال العوفي عن ابن عباس رضي الله عنهما في قوله تعالى \"وجعلوا بينه وبين الجنة نسبا\" قال زعم أعداء الله أنه تبارك وتعالى هو وإبليس أخوان تعالى الله عن ذلك علوا كبيرا حكاه ابن جرير."
    },
    {
      "ayah": 159,
      "surah": 37,
      "text": "وقوله جلت عظمه \"سبحان الله عما يصفون\" أي تعالى وتقدس وتنزه عن أن يكون له ولد وعما يصفه به الظالمون الملحدون علوا كبيرا."
    },
    { "ayah": 16, "surah": 37, "text": "يستبعدون ذلك ويكذبون به." },
    {
      "ayah": 160,
      "surah": 37,
      "text": "استثناء منقطع وهو من مثبت إلا أن يكون الضمير قوله تعالى \"عما يصفون\" عائد إلى الناس جميعهم ثم استثنى منهم المخلصين وهم المتبعون للحق المنزل على كل نبي مرسل وجعل ابن جرير هذا الاستثناء من قوله تعالى \"إنهم لمحضرون إلا عباد الله المخلصين\" وفي هذا الذي قاله نظر والله سبحانه وتعالى أعلم."
    },
    {
      "ayah": 161,
      "surah": 37,
      "text": "يقول تعالى مخاطبا للمشركين \"فإنكم وما تعبدون ما أنتم عليه بفاتنين إلا من هو صال الجحيم\" أي إنما ينقاد لمقالتكم وما أنتم عليه من الضلالة والعبادة الباطلة من هو أضل منكم ممن ذرئ للنار \"لهم قلوب لا يفقهون بها ولهم أعين لا يبصرون بها ولهم آذان لا يسمعون بها أولئك كالأنعام بل هم أضل أولئك هم الغافلون\" فهذا الضرب من الناس هو الذي ينقاد لدين الشرك والكفر والضلالة كما قال تبارك وتعالى \"إنكم لفي قول مختلف يؤفك عنه من أفك\" أي إنما يضل به من هو مأفوك ومبطل ثم قال تبارك وتعالى منزها للملائكة مما نسبوا إليهم من الكفر بهم والكذب عليهم أنهم بنات الله."
    },
    {
      "ayah": 162,
      "surah": 37,
      "text": "يقول تعالى مخاطبا للمشركين \"فإنكم وما تعبدون ما أنتم عليه بفاتنين إلا من هو صال الجحيم\" أي إنما ينقاد لمقالتكم وما أنتم عليه من الضلالة والعبادة الباطلة من هو أضل منكم ممن ذرئ للنار \"لهم قلوب لا يفقهون بها ولهم أعين لا يبصرون بها ولهم آذان لا يسمعون بها أولئك كالأنعام بل هم أضل أولئك هم الغافلون\" فهذا الضرب من الناس هو الذي ينقاد لدين الشرك والكفر والضلالة كما قال تبارك وتعالى \"إنكم لفي قول مختلف يؤفك عنه من أفك\" أي إنما يضل به من هو مأفوك ومبطل ثم قال تبارك وتعالى منزها للملائكة مما نسبوا إليهم من الكفر بهم والكذب عليهم أنهم بنات الله."
    },
    {
      "ayah": 163,
      "surah": 37,
      "text": "يقول تعالى مخاطبا للمشركين \"فإنكم وما تعبدون ما أنتم عليه بفاتنين إلا من هو صال الجحيم\" أي إنما ينقاد لمقالتكم وما أنتم عليه من الضلالة والعبادة الباطلة من هو أضل منكم ممن ذرئ للنار \"لهم قلوب لا يفقهون بها ولهم أعين لا يبصرون بها ولهم آذان لا يسمعون بها أولئك كالأنعام بل هم أضل أولئك هم الغافلون\" فهذا الضرب من الناس هو الذي ينقاد لدين الشرك والكفر والضلالة كما قال تبارك وتعالى \"إنكم لفي قول مختلف يؤفك عنه من أفك\" أي إنما يضل به من هو مأفوك ومبطل ثم قال تبارك وتعالى منزها للملائكة مما نسبوا إليهم من الكفر بهم والكذب عليهم أنهم بنات الله."
    },
    {
      "ayah": 164,
      "surah": 37,
      "text": "أي له موضع مخصوص في السموات ومقامات العبادات لا يتجاوزه ولا يتعداه وقال ابن عساكر في ترجمته لمحمد بن خالد بسنده إلى عبد الرحمن بن العلاء بن سعد عن أبيه وكان ممن بايع يوم الفتح أن رسول الله صلى الله عليه وسلم قال يوما لجلسائه \"أطت السماء وحق لها أن تئط ليس فيها موضع قدم إلا عليه ملك راكع أو ساجد\" ثم قرأ صلى الله عليه وسلم \"\"وما منا إلا له مقام معلوم وإنا لنحن الصافون وإنا لنحن المسبحون\"\" وقال الضحاك في تفسيره \"وما منا إلا له مقام معلوم\" قال كان مسروق يروي عن عائشة رضي الله عنها أنها قالت: قال رسول الله صلى الله عليه وسلم \"ما من السماء الدنيا موضع إلا عليه ملك ساجد أو قائم\" فذلك قوله تعالى \"وما منا إلا له مقام معلوم\" وقال الأعمش عن أبي إسحاق عن مسروق عن ابن عباس رضي الله عنه قال: إن في السماوات لسماء ما فيها موضع شبر إلا عليه جبهة ملك أو قدماه ثم قرأ عبدالله رضي الله عنه \"وما منا إلا له مقام معلوم\" وكذا قال سعيد بن جبير وقال قتادة كانوا يصلون الرجال والنساء جميعا حتى نزلت \"وما منا إلا له مقام معلوم\" فتقدم الرجال وتأخر النساء."
    },
    {
      "ayah": 165,
      "surah": 37,
      "text": "أي نقف صفوفا في الطاعة كما تقدم عند قوله تبارك وتعالى \"والصافات صفا\" قال ابن جريج عن الوليد بن عبدالله بن أبي مغيث قال كانوا لا يصفون في الصلاة حتى نزلت \"وإنا لنحن الصافون\" فصفوا وقال أبو نضرة كان عمر رضي الله عنه إذا أقيمت الصلاة استقبل الناس بوجهه ثم قال أقيموا صفوفكم استووا قياما يريد الله تعالى بكم هدي الملائكة ثم يقول \"وإنا لنحن الصافون\" تأخر يا فلان تقدم يا فلان ثم يتقدم فيكبر رواه ابن أبي حاتم وابن جرير وفي صحيح مسلم عن حذيفة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم \"فضلنا على الناس بثلاث: جعلت صفوفنا كصفوف الملائكة وجعلت لنا الأرض مسجدا وتربتها طهورا\" الحديث."
    },
    {
      "ayah": 166,
      "surah": 37,
      "text": "أي نصطف فنسبح الرب ونمجده ونقدسه وننزهه عن النقائص فنحن عبيد له فقراء إليه خاضعون لديه. وقال ابن عباس رضي الله عنهما ومجاهد \"وما منا إلا له مقام معلوم\" الملائكة \"وإنا لنحن الصافون\" الملائكة \"وإنا لنحن المسبحون\" الملائكة نسبح الله عز وجل. وقال قتادة \"وإنا لنحن المسبحون\" يعني المصلون يثبتون بمكانهم من العبادة كما قال تبارك وتعالى \"وقالوا اتخذ الرحمن ولدا سبحانه بل عباد مكرمون لا يسبقونه بالقول وهم بأمره يعملون يعلم ما بين أيديهم وما خلفهم ولا يشفعون إلا لمن ارتضى وهم من خشيته مشفقون ومن يقل منهم إني إله من دونه فذلك نجزيه جهنم كذلك نجزي الظالمين\"."
    },
    {
      "ayah": 167,
      "surah": 37,
      "text": "قوله جل وعلا \"وإن كانوا ليقولون لو أن عندنا ذكرا من الأولين لكنا عباد الله المخلصين\" أي قد كانوا يتمنون قبل أن تأتيهم يا محمد لو كان عندهم من يذكرهم بأمر الله وما كان من أمر القرون الأولى ويأتيهم بكتاب الله كما قال جل جلاله \"وأقسموا بالله جهد أيمانهم لئن جاءهم نذير ليكونن أهدى من إحدى الأمم فلما جاءهم نذير ما زادهم إلا نفورا\" وقال تعالى \"أن تقولوا إنما أنزل الكتاب على طائفتين من قبلنا وإن كنا عن دراستهم لغافلين أو تقولوا لو أنا أنزل علينا الكتاب لكنا أهدى منهم فقد جاءكم بينة من ربكم وهدى ورحمة فمن أظلم ممن كذب بآيات الله وصدف عنها سنجزي الذين يصدفون عن آياتنا سوء العذاب بما كانوا يصدفون\" ولهذا قال تعالى ههنا \"فكفروا به فسوف يعلمون\" وعيد أكيد وتهديد شديد على كفرهم بربهم عز وجل وتكذيبهم رسوله صلى الله عليه وسلم."
    },
    {
      "ayah": 168,
      "surah": 37,
      "text": "قوله جل وعلا \"وإن كانوا ليقولون لو أن عندنا ذكرا من الأولين لكنا عباد الله المخلصين\" أي قد كانوا يتمنون قبل أن تأتيهم يا محمد لو كان عندهم من يذكرهم بأمر الله وما كان من أمر القرون الأولى ويأتيهم بكتاب الله كما قال جل جلاله \"وأقسموا بالله جهد أيمانهم لئن جاءهم نذير ليكونن أهدى من إحدى الأمم فلما جاءهم نذير ما زادهم إلا نفورا\" وقال تعالى \"أن تقولوا إنما أنزل الكتاب على طائفتين من قبلنا وإن كنا عن دراستهم لغافلين أو تقولوا لو أنا أنزل علينا الكتاب لكنا أهدى منهم فقد جاءكم بينة من ربكم وهدى ورحمة فمن أظلم ممن كذب بآيات الله وصدف عنها سنجزي الذين يصدفون عن آياتنا سوء العذاب بما كانوا يصدفون\" ولهذا قال تعالى ههنا \"فكفروا به فسوف يعلمون\" وعيد أكيد وتهديد شديد على كفرهم بربهم عز وجل وتكذيبهم رسوله صلى الله عليه وسلم."
    },
    {
      "ayah": 169,
      "surah": 37,
      "text": "قوله جل وعلا \"وإن كانوا ليقولون لو أن عندنا ذكرا من الأولين لكنا عباد الله المخلصين\" أي قد كانوا يتمنون قبل أن تأتيهم يا محمد لو كان عندهم من يذكرهم بأمر الله وما كان من أمر القرون الأولى ويأتيهم بكتاب الله كما قال جل جلاله \"وأقسموا بالله جهد أيمانهم لئن جاءهم نذير ليكونن أهدى من إحدى الأمم فلما جاءهم نذير ما زادهم إلا نفورا\" وقال تعالى \"أن تقولوا إنما أنزل الكتاب على طائفتين من قبلنا وإن كنا عن دراستهم لغافلين أو تقولوا لو أنا أنزل علينا الكتاب لكنا أهدى منهم فقد جاءكم بينة من ربكم وهدى ورحمة فمن أظلم ممن كذب بآيات الله وصدف عنها سنجزي الذين يصدفون عن آياتنا سوء العذاب بما كانوا يصدفون\" ولهذا قال تعالى ههنا \"فكفروا به فسوف يعلمون\" وعيد أكيد وتهديد شديد على كفرهم بربهم عز وجل وتكذيبهم رسوله صلى الله عليه وسلم."
    },
    { "ayah": 17, "surah": 37, "text": "يستبعدون ذلك ويكذبون به." },
    {
      "ayah": 170,
      "surah": 37,
      "text": "قوله جل وعلا \"وإن كانوا ليقولون لو أن عندنا ذكرا من الأولين لكنا عباد الله المخلصين\" أي قد كانوا يتمنون قبل أن تأتيهم يا محمد لو كان عندهم من يذكرهم بأمر الله وما كان من أمر القرون الأولى ويأتيهم بكتاب الله كما قال جل جلاله \"وأقسموا بالله جهد أيمانهم لئن جاءهم نذير ليكونن أهدى من إحدى الأمم فلما جاءهم نذير ما زادهم إلا نفورا\" وقال تعالى \"أن تقولوا إنما أنزل الكتاب على طائفتين من قبلنا وإن كنا عن دراستهم لغافلين أو تقولوا لو أنا أنزل علينا الكتاب لكنا أهدى منهم فقد جاءكم بينة من ربكم وهدى ورحمة فمن أظلم ممن كذب بآيات الله وصدف عنها سنجزي الذين يصدفون عن آياتنا سوء العذاب بما كانوا يصدفون\" ولهذا قال تعالى ههنا \"فكفروا به فسوف يعلمون\" وعيد أكيد وتهديد شديد على كفرهم بربهم عز وجل وتكذيبهم رسوله صلى الله عليه وسلم."
    },
    {
      "ayah": 171,
      "surah": 37,
      "text": "يقول تبارك وتعالى \"ولقد سبقت كلمتنا لعبادنا المرسلين\" أي تقدم فى الكتاب الأول أن العاقبة للرسل وأتباعهم في الدنيا والآخرة كما قال تعالى \"كتب الله لأغلبن أنا ورسلي إن الله قوي عزيز\" وقال عز وجل \"إنا لننصر رسلنا والذين آمنوا في الحياة الدنيا ويوم يقوم الأشهاد\" ولهذا قال جل جلاله \"ولقد سبقت كلمتنا لعبادنا المرسلين إنهم لهم المنصورون\" أي في الدنيا والآخرة كما تقدم بيان نصرتهم على قومهم ممن كذبهم وخالفهم كيف أهلك الله الكافرين ونجى عباده المؤمنين."
    },
    {
      "ayah": 172,
      "surah": 37,
      "text": "يقول تبارك وتعالى \"ولقد سبقت كلمتنا لعبادنا المرسلين\" أي تقدم فى الكتاب الأول أن العاقبة للرسل وأتباعهم في الدنيا والآخرة كما قال تعالى \"كتب الله لأغلبن أنا ورسلي إن الله قوي عزيز\" وقال عز وجل \"إنا لننصر رسلنا والذين آمنوا في الحياة الدنيا ويوم يقوم الأشهاد\" ولهذا قال جل جلاله \"ولقد سبقت كلمتنا لعبادنا المرسلين إنهم لهم المنصورون\" أي في الدنيا والآخرة كما تقدم بيان نصرتهم على قومهم ممن كذبهم وخالفهم كيف أهلك الله الكافرين ونجى عباده المؤمنين."
    },
    { "ayah": 173, "surah": 37, "text": "أي تكون لهم العاقبة." },
    {
      "ayah": 174,
      "surah": 37,
      "text": "أي اصبر على أذاهم لك وانتظر إلى وقت مؤجل فإنا سنجعل لك العاقبة والنصرة والظفر ولهذا قال بعضهم غيا ذلك إلي يوم بدر وما بعدها أيضا في معناها."
    },
    {
      "ayah": 175,
      "surah": 37,
      "text": "أي انظرهم وارتقب ماذا يحل بهم من العذاب والنكال بمخالفتك وتكذيبك ولهذا قال تعالى على وجه التهديد والوعيد \"فسوف يبصرون\"."
    },
    {
      "ayah": 176,
      "surah": 37,
      "text": "أي هم إنما يستعجلون العذاب لتكذيبهم وكفرهم بك فإن الله تعالى يغضب عليهم بذلك ويجعل لهم العقوبة ومع هذا أيضا كانوا من كفرهم وعنادهم يستعجلون العذاب والعقوبة."
    },
    {
      "ayah": 177,
      "surah": 37,
      "text": "أي فإذا نزل العذاب بمحلتهم فبئس ذلك اليوم يومهم بإهلاكهم ودمارهم وقال السدي \"فإذا نزل بساحتهم\" يعنى بدارهم \"فساء صباح المنذرين\" أي فبئس ما يصبحون أي بئس الصباح صباحهم ولهذا ثبت في الصحيحين من حديث إسماعيل بن علية عن عبدالعزيز بن صهيب عن أنس رضي الله عنه قال: صبح رسول الله صلى الله عليه وسلم خير فلما خرجوا بفؤوسهم ومساحيهم ورأوا الجيش رجعوا وهم يقولون محمد والله محمد والخميس فقال النبي صلى الله عليه وسلم \"الله أكبر خربت خيبر إنا إذا نزلنا بساحة قوم فساء صباح المنذرين\" ورواه البخاري من حديث مالك عن حميد عن أنس رضي الله عنه وقال الإمام أحمد حدثنا روح حدثنا سعيد بن أبي عروبة عن قتادة عن أنس بن مالك عن أبي طلحة رضي الله عنه قال: لما صبح رسول الله صلى الله عليه وسلم خيبر وقد أخذوا مساحيهم وغدوا إلى حروثهم وأرضيهم فلما رأوا النبي صلى الله عليه وسلم نكصوا مدبرين فقال نبي الله صلى الله عليه وسلم \"إنا إذا نزلنا بساحة قوم فساء صباح المنذرين\" لم يخرجوه عن هذا الوجه وهو صحيح على شرط الشيخين."
    },
    {
      "ayah": 178,
      "surah": 37,
      "text": "قوله \"وتول عنهم حتى حين وأبصر فسوف يبصرون\" تأكيد لما تقدم من الأمر بذلك والله سبحانه وتعالى أعلم."
    },
    {
      "ayah": 179,
      "surah": 37,
      "text": "قوله \"وتول عنهم حتى حين وأبصر فسوف يبصرون\" تأكيد لما تقدم من الأمر بذلك والله سبحانه وتعالى أعلم."
    },
    {
      "ayah": 18,
      "surah": 37,
      "text": "أي قل لهم يا محمد نعم تبعثون يوم القيامة بعدما تصيرون ترابا وعظاما وأنتم داخرون أي حقيرون تحت القدرة العظيمة كما قال تبارك وتعالى \"وكل أتوه داخرين\" وقال \"إن الذين يستكبرون عن عبادتي سيدخلون جهنم داخرين\"."
    },
    {
      "ayah": 180,
      "surah": 37,
      "text": "ينزه تبارك وتعالى نفسه ويقدسها ويبرئها عما يقول الظالمون المكذبون المعتدون تعالى وتنزه وتقدس عن قولهم علوا كبيرا ولهذا قال تبارك وتعالى \"سبحان ربك رب العزة\" أي ذي العزة التي لا ترام \"عما يصفون\" أي عن قول هؤلاء المعتدين المفترين."
    },
    { "ayah": 181, "surah": 37, "text": "أي سلام الله عليهم في الدنيا والآخرة لسلامة ما قالوه فى ربهم وصحته وحقيته." },
    {
      "ayah": 182,
      "surah": 37,
      "text": "أي له الحمد في الأولى والآخرة في كل حال ولما كان التسبيح يتضمن التنزيه والتبرئة من النقص بدلالة المطابقة ويستلزم إثبات الكمال كما أن الحمد يدل على إثبات صفات الكمال مطابقة ويستلزم التنزيه من النقص قرن بينهما في هذا الموضع وفي مواضع كثيرة من القرآن ولهذا قال تبارك وتعالى \"سبحان ربك رب العزة عما يصفون وسلام على المرسلين والحمد لله رب العالمين\" وقال سعيد بن أبي عروبة عن قتادة قال: قال رسول الله صلى الله عليه وسلم \"إذا سلمتم علي فسلموا على المرسلين فأنا رسول من المرسلين\" هكذا رواه ابن جرير وابن أبي حاتم من حديث سعيد عنه كذلك وقد أسنده ابن أبي حاتم رحمه الله فقال حدثنا علي بن الحسين بن الجنيد حدثنا أبو بكر الأعين ومحمد بن عبدالرحيم صاعقة قالا حدثنا حسين بن محمد حدثنا شيبان عن قتادة قال حدثنا أنس بن مالك عن أبي طلحة رضي الله عنهما قال: قال رسول الله صلى الله عليه وسلم \"إذا سلمتم علي فسلموا على المرسلين\" وقال الحافظ أبو يعلى حدثنا محمد بن أبي بكر حدثنا نوح حدثنا أبو هارون عن أبي سعيد رضي الله عنه عن رسول الله صلى الله عليه وسلم أنه كان إذا أراد أن يسلم قال \"سبحان ربك رب العزة عما يصفون وسلام على المرسلين والحمد لله رب العالمين\" ثم يسلم إسناده ضعيف وقال ابن أبي حاتم حدثنا عمار بن خالد الواسطي حدثنا شبابة عن يونس بن أبي إسحاق عن الشعبي قال: قال رسول الله صلى الله عليه وسلم \"من سره أن يكتال بالمكيال الأوفى من الأجر يوم القيامة فليقل آخر مجلسه حين يريد أن يقوم سبحان ربك رب العزة عما يصفون وسلام على المرسلين والحمد لله رب العالمين\" وروي من وجه آخر متصل موقوف على علي رضي الله عنه قال أبو محمد البغوي في تفسيره أخبرنا أبو سعيد أحمد بن إبراهيم الشريحي أخبرنا أبو إسحاق الثعلبي أخبرني ابن منجويه حدثنا أحمد بن جعفر بن حمدان حدثنا إبراهيم بن سهلويه حدثنا علي بن محمد الطنافسي حدثنا وكيع عن ثابت بن أبي صفية عن الأصبغ بن نباتة عن علي رضي الله عنه قال: من أحب أن يكتال بالمكيال الأوفى من الأجر يوم القيامة فليكن آخر كلامه في مجلسه سبحان ربك رب العزة عما يصفون وسلام على المرسلين والحمد لله رب العالمين وروى الطبراني من طريق عبدالله بن صخر بن أنس عن عبدالله بن زيد بن أرقم عن أبيه عن رسول الله صلى الله عليه وسلم أنه قال \"من قال دبر كل صلاة سبحان ربك رب العزة عما يصفون وسلام على المرسلين والحمد لله رب العالمين ثلاث مرات فقد اكتال بالجريب الأوفى من الأجر\" وقد وردت أحاديث في كفارة المجلس: سبحانك اللهم وبحمدك لا إله إلا أنت أستغفرك وأتوب إليك. وقد أفردت لها جزءا على حدة والله سبحانه وتعالى أعلم."
    },
    {
      "ayah": 19,
      "surah": 37,
      "text": "قال جلت عظمته \"فإنما هي زجرة واحدة فإذا هم ينظرون\" أي فإنما هو أمر واحد من الله عز وجل يدعوهم دعوة واحدة أن يخرجوا من الأرض فإذا هم قيام بين يديه ينظرون إلى أهوال يوم القيامة والله تعالى أعلم."
    },
    { "ayah": 2, "surah": 37, "text": "هي الملائكة." },
    {
      "ayah": 20,
      "surah": 37,
      "text": "يخبر تعالى عن قيل الكفار يوم القيامة أنهم يرجعون على أنفسهم بالملامة ويعترفون بأنهم كانوا ظالمين لأنفسهم في الدار الدنيا فإذا عاينوا أهوال القيامة ندموا كل الندم حيث لا ينفعهم الندم \"وقالوا يا ويلنا هذا يوم الدين\" فتقول لهم الملائكة والمؤمنون \"هذا يوم الفصل الذي كنتم به تكذبون\" وهذا يقال لهم على وجه التقريع والتوبيخ ويأمر الله تعالى الملائكة أن تميز الكفار من المؤمنين في الموقف في محشرهم ومنشرهم ولهذا قال تعالى \"احشروا الذين ظلموا وأزواجهم\" قال النعمان بن بشير رضي الله عنه يعني بأزواجهم أشباههم وأمثالهم وكذا قال ابن عباس وسعيد بن جبير وعكرمة ومجاهد والسدي وأبو صالح وأبو العالية وزيد بن أسلم وقال سفيان الثوري عن سماك عن النعمان بن بشير عن عمر بن الخطاب رضي الله عنه \"احشروا الذين ظلموا وأزواجهم\" قال إخوانهم. وقال شريك عن سماك عن النعمان قال: سمعت عمر يقول \"احشروا الذين ظلموا وأزواجهم\" قال أشباههم قال يجيء أصحاب الزنا مع أصحاب الزنا وأصحاب الربا مع أصحاب الربا وأصحاب الخمر مع أصحاب الخمر وقال خصيف عن مقسم عن ابن عباس رضي الله عنهما أزواجهم نساءهم وهذا غريب والمعروف عنه الأول كما رواه مجاهد وسعيد بن جبير عنه أزواجهم قرناءهم وما كانوا يعبدون من دون الله أي من الأصنام والأنداد تحشر معهم في أماكنهم."
    },
    {
      "ayah": 21,
      "surah": 37,
      "text": "يخبر تعالى عن قيل الكفار يوم القيامة أنهم يرجعون على أنفسهم بالملامة ويعترفون بأنهم كانوا ظالمين لأنفسهم في الدار الدنيا فإذا عاينوا أهوال القيامة ندموا كل الندم حيث لا ينفعهم الندم \"وقالوا يا ويلنا هذا يوم الدين\" فتقول لهم الملائكة والمؤمنون \"هذا يوم الفصل الذي كنتم به تكذبون\" وهذا يقال لهم على وجه التقريع والتوبيخ ويأمر الله تعالى الملائكة أن تميز الكفار من المؤمنين في الموقف في محشرهم ومنشرهم ولهذا قال تعالى \"احشروا الذين ظلموا وأزواجهم\" قال النعمان بن بشير رضي الله عنه يعني بأزواجهم أشباههم وأمثالهم وكذا قال ابن عباس وسعيد بن جبير وعكرمة ومجاهد والسدي وأبو صالح وأبو العالية وزيد بن أسلم وقال سفيان الثوري عن سماك عن النعمان بن بشير عن عمر بن الخطاب رضي الله عنه \"احشروا الذين ظلموا وأزواجهم\" قال إخوانهم. وقال شريك عن سماك عن النعمان قال: سمعت عمر يقول \"احشروا الذين ظلموا وأزواجهم\" قال أشباههم قال يجيء أصحاب الزنا مع أصحاب الزنا وأصحاب الربا مع أصحاب الربا وأصحاب الخمر مع أصحاب الخمر وقال خصيف عن مقسم عن ابن عباس رضي الله عنهما أزواجهم نساءهم وهذا غريب والمعروف عنه الأول كما رواه مجاهد وسعيد بن جبير عنه أزواجهم قرناءهم وما كانوا يعبدون من دون الله أي من الأصنام والأنداد تحشر معهم في أماكنهم."
    },
    {
      "ayah": 22,
      "surah": 37,
      "text": "يخبر تعالى عن قيل الكفار يوم القيامة أنهم يرجعون على أنفسهم بالملامة ويعترفون بأنهم كانوا ظالمين لأنفسهم في الدار الدنيا فإذا عاينوا أهوال القيامة ندموا كل الندم حيث لا ينفعهم الندم \"وقالوا يا ويلنا هذا يوم الدين\" فتقول لهم الملائكة والمؤمنون \"هذا يوم الفصل الذي كنتم به تكذبون\" وهذا يقال لهم على وجه التقريع والتوبيخ ويأمر الله تعالى الملائكة أن تميز الكفار من المؤمنين في الموقف في محشرهم ومنشرهم ولهذا قال تعالى \"احشروا الذين ظلموا وأزواجهم\" قال النعمان بن بشير رضي الله عنه يعني بأزواجهم أشباههم وأمثالهم وكذا قال ابن عباس وسعيد بن جبير وعكرمة ومجاهد والسدي وأبو صالح وأبو العالية وزيد بن أسلم وقال سفيان الثوري عن سماك عن النعمان بن بشير عن عمر بن الخطاب رضي الله عنه \"احشروا الذين ظلموا وأزواجهم\" قال إخوانهم. وقال شريك عن سماك عن النعمان قال: سمعت عمر يقول \"احشروا الذين ظلموا وأزواجهم\" قال أشباههم قال يجيء أصحاب الزنا مع أصحاب الزنا وأصحاب الربا مع أصحاب الربا وأصحاب الخمر مع أصحاب الخمر وقال خصيف عن مقسم عن ابن عباس رضي الله عنهما أزواجهم نساءهم وهذا غريب والمعروف عنه الأول كما رواه مجاهد وسعيد بن جبير عنه أزواجهم قرناءهم وما كانوا يعبدون من دون الله أي من الأصنام والأنداد تحشر معهم في أماكنهم."
    },
    {
      "ayah": 23,
      "surah": 37,
      "text": "وقوله تعالى \"فاهدوهم إلى صراط الجحيم\" أي أرشدوهم إلى طريق جهنم وهذا كقوله تعالى \"ونحشرهم يوم القيامة على وجوههم عميا وبكما وصما مأواهم جهنم كلما خبت زدناهم سعيرا\"."
    },
    {
      "ayah": 24,
      "surah": 37,
      "text": "أي قفوهم حتى يسئلوا عن أعمالهم وأقوالهم التي صدرت عنهم في الدار الدنيا كما قال الضحاك عن ابن عباس يعني احبسوهم إنهم محاسبون. وقال ابن أبي حاتم حدثنا أبي حدثنا النفيلي حدثنا المعتمر بن سليمان قال سمعت ليثا يحدث عن بشير عن أنس بن مالك رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم \"أيما داع دعا إلى شيء كان موقوفا معه إلى يوم القيامة لا يغادره ولا يفارقه وإن دعا رجل رجلا\" ثم قرأ \"وقفوهم إنهم مسئولون\" ورواه الترمذي من حديث ليث بن أبي سليم ورواه ابن جرير عن يعقوب بن إبراهيم عن معتمر عن ليث عن رجل عن أنس رضي الله عنه مرفوعا."
    },
    {
      "ayah": 25,
      "surah": 37,
      "text": "وقال عبدالله بن المبارك سمعت عثمان بن زائدة يقول إن أول ما يسئل عنه الرجل جلساؤه ثم يقال لهم على سبيل التقريع والتوبيخ \"ما لكم لا تناصرون\" أي كما زعمتم أنكم جميع منتصر."
    },
    { "ayah": 26, "surah": 37, "text": "أي منقادون لأمر الله لا يخالفونه ولا يحيدون عنه والله أعلم." },
    {
      "ayah": 27,
      "surah": 37,
      "text": "يذكر تعالى أن الكفار يتلاومون في عرصات القيامة كما يتخاصمون في دركات النار \"فيقول الضعفاء للذين استكبروا إنا كنا لكم تبعا فهل أنتم مغنون عنا نصيبا من النار قال الذين استكبروا إنا كل فيها إن الله قد حكم بين العباد\" وقال تعالى \"ولو ترى إذ الظالمون موقوفون عند ربهم يرجع بعضهم إلى بعض القول يقول الذين استضعفوا للذين استكبروا لولا أنتم لكنا مؤمنين قال الذين استكبروا للذين استضعفوا أنحن صددناكم عن الهدى بعد إذ جاءكم بل كنتم مجرمين وقال الذين استضعفوا للذين استكبروا بل مكر الليل والنهار إذ تأمروننا أن نكفر بالله ونجعل له أندادا وأسروا الندامة لما رأوا العذاب وجعلنا الأغلال في أعناق الذين كفروا هل يجزون إلا ما كانوا يعملون\" وهكذا قالوا لهم ههنا \"إنكم كنتم تأتوننا عن اليمين\" قال الضحاك عن ابن عباس يقولون كنتم تقهروننا بالقدرة منكم علينا لأنا كنا أذلاء وكنتم أعزاء وقال مجاهد يعني عن الحق والكفار تقوله للشياطين وقال قتادة قالت الإنس للجن إنكم كنتم تأتوننا عن اليمين قال من قبل الخير فتنهونا عنه وتبطئونا عنه وقال السدي تأتوننا من قبل الحق وتزينوا لنا الباطل وتصدونا عن الحق وقال الحسن في قوله تعالى \"إنكم كنتم تأتوننا عن اليمين\" أي والله يأتيه عند كل خير يريده فيصده عنه وقال ابن زيد معناه تحولون بيننا وبين الخير ورددتمونا عن الإسلام والإيمان والعمل بالخير الذي أمرنا به وقال يزيد الرشك من قبل لا إله إلا الله وقال خصيف يعنون من قبل ميامنهم وقال عكرمة \"إنكم كنتم تأتوننا عن اليمين\" قال من حيث نأمنكم."
    },
    {
      "ayah": 28,
      "surah": 37,
      "text": "يذكر تعالى أن الكفار يتلاومون في عرصات القيامة كما يتخاصمون في دركات النار \"فيقول الضعفاء للذين استكبروا إنا كنا لكم تبعا فهل أنتم مغنون عنا نصيبا من النار قال الذين استكبروا إنا كل فيها إن الله قد حكم بين العباد\" وقال تعالى \"ولو ترى إذ الظالمون موقوفون عند ربهم يرجع بعضهم إلى بعض القول يقول الذين استضعفوا للذين استكبروا لولا أنتم لكنا مؤمنين قال الذين استكبروا للذين استضعفوا أنحن صددناكم عن الهدى بعد إذ جاءكم بل كنتم مجرمين وقال الذين استضعفوا للذين استكبروا بل مكر الليل والنهار إذ تأمروننا أن نكفر بالله ونجعل له أندادا وأسروا الندامة لما رأوا العذاب وجعلنا الأغلال في أعناق الذين كفروا هل يجزون إلا ما كانوا يعملون\" وهكذا قالوا لهم ههنا \"إنكم كنتم تأتوننا عن اليمين\" قال الضحاك عن ابن عباس يقولون كنتم تقهروننا بالقدرة منكم علينا لأنا كنا أذلاء وكنتم أعزاء وقال مجاهد يعني عن الحق والكفار تقوله للشياطين وقال قتادة قالت الإنس للجن إنكم كنتم تأتوننا عن اليمين قال من قبل الخير فتنهونا عنه وتبطئونا عنه وقال السدي تأتوننا من قبل الحق وتزينوا لنا الباطل وتصدونا عن الحق وقال الحسن في قوله تعالى \"إنكم كنتم تأتوننا عن اليمين\" أي والله يأتيه عند كل خير يريده فيصده عنه وقال ابن زيد معناه تحولون بيننا وبين الخير ورددتمونا عن الإسلام والإيمان والعمل بالخير الذي أمرنا به وقال يزيد الرشك من قبل لا إله إلا الله وقال خصيف يعنون من قبل ميامنهم وقال عكرمة \"إنكم كنتم تأتوننا عن اليمين\" قال من حيث نأمنكم."
    },
    {
      "ayah": 29,
      "surah": 37,
      "text": "تقول القادة من الجن والإنس للأتباع ما الأمر كما تزعمون بل كانت قلوبكم منكرة للإيمان قابلة للكفر والعصيان."
    },
    {
      "ayah": 3,
      "surah": 37,
      "text": "هي الملائكة وكذا قال ابن عباس رضي الله عنهما ومسروق وسعيد بن جبير وعكرمة ومجاهد والسدي وقتادة والربيع بن أنس قال قتادة الملائكة صفوف فى السماء. وقال مسلم حدثنا أبو بكر بن أبي شيبة حدثنا محمد بن فضيل عن أبي مالك الأشجعي عن ربعي عن حذيفة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم \"فضلنا على الناس بثلاث: جعلت صفوفنا كصفوف الملائكة وجعلت لنا الأرض كلها مسجدا وجعل لنا ترابها طهورا إذا لم نجد الماء\" وقد روى مسلم أيضا وأبو داود والنسائي وابن ماجه من حديث الأعمش عن المسيب بن رافع عن تميم بن طرفة عن جابر بن سمرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم \"ألا تصفون كما تصف الملائكة عند ربهم؟\" قلنا وكيف تصف الملائكة عند ربهم؟ قال صلى الله عليه وسلم \"يتمون الصفوف المتقدمة ويتراصون في الصف\" وقال السدي وغيره معنى قوله تعالى \"فالزاجرات زجرا\" أنها تزجر السحاب. وقال الربيع بن أنس \"فالزاجرات زجرا\" ما زجر الله تعالى عنه في القرآن وكذا روى مالك عن زيد بن اسلم \"فالتاليات ذكرا\" قال السدي الملائكة يجيئون بالكتاب والقرآن من عند الله إلى الناس وهذه الآية كقوله تعالى \"فالملقيات ذكرا عذرا أو نذرا\"."
    },
    {
      "ayah": 30,
      "surah": 37,
      "text": "\"وما كان لنا عليكم من سلطان\" أي من حجة على صحة ما دعوناكم إليه \"بل كنتم قوما طاغين\" أي بل كان فيكم طغيان ومجاوزة للحق فلهذا استجبتم لنا وتركتم الحق الذي جاءتكم به الأنبياء وأقاموا لكم الحجج على صحة ما جاءوكم به فخالفتموهم."
    },
    {
      "ayah": 31,
      "surah": 37,
      "text": "يقول الكبراء للمستضعفين حقت علينا كلمة الله إنا من الأشقياء الذائقين للعذاب يوم القيامة \"فأغويناكم\" أي دعوناكم إلى الضلالة \"إنا كنا غاوين\" أي فدعوناكم إلى ما نحن فيه فاستجبتم لنا."
    },
    {
      "ayah": 32,
      "surah": 37,
      "text": "يقول الكبراء للمستضعفين حقت علينا كلمة الله إنا من الأشقياء الذائقين للعذاب يوم القيامة \"فأغويناكم\" أي دعوناكم إلى الضلالة \"إنا كنا غاوين\" أي فدعوناكم إلى ما نحن فيه فاستجبتم لنا."
    },
    {
      "ayah": 33,
      "surah": 37,
      "text": "قال الله تبارك وتعالى \"فإنهم يومئذ في العذاب مشتركون\" أي الجميع في النار كل بحسبه."
    },
    {
      "ayah": 34,
      "surah": 37,
      "text": "\"إنا كذلك نفعل بالمجرمين إنهم كانوا\" أي في الدار الدنيا \"إذا قيل لهم لا إله إلا الله يستكبرون\" أي يستكبرون أن يقولوها كما يقولها المؤمنون. قال ابن أبي حاتم حدثنا عبيد الله بن أخي بن وهب حدثنا عمي حدثنا الليث عن ابن مسافر يعني عبدالرحمن بن خالد عن ابن شهاب عن سعيد بن المسيب عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم \"أمرت أن أقاتل الناس حتى يقولوا لا إله إلا الله فمن قال لا إله إلا الله فقد عصم مني ماله ونفسه إلا بحقه وحسابه على الله عز وجل\" وأنزل الله تعالى في كتابه العزيز وذكر قوما استكبروا فقال تعالى \"إنهم كانوا إذا قيل لهم لا إله إلا الله يستكبرون\". وقال ابن أبي حاتم أيضا حدثنا أبي حدثنا أبو سلمة موسى بن إسماعيل حدثنا حماد عن سعيد الجريري عن أبي العلاء قال: يؤتى باليهود يوم القيامة فيقال لهم ما كنتم تعبدون؟ فيقولون نعبد الله وعزيرا فيقال لهم خذوا ذات الشمال ثم يؤتى بالنصارى فيقال لهم ما كنتم تعبدون؟ فيقولون نعبد الله والمسيح فيقال لهم خذوا ذات الشمال ثم يؤتى بالمشركين فيقال لهم لا إله إلا الله فيستكبرون ثم يقال لهم لا إله إلا الله فيستكبرون ثم يقال لهم لا إله إلا الله فيستكبرون فيقال لهم خذوا ذات الشمال. قال أبو نضرة فينطلقون أسرع من الطير قال أبو العلاء ثم يؤتى بالمسلمين فيقال لهم ما كنتم تعبدون؟ فيقولون كنا نعبد الله تعالى فيقال لهم هل تعرفونه إذا رأيتموه؟ فيقولون نعم فيقال لهم فكيف تعرفونه ولم تروه؟ فيقولون نعلم أنه لا عدل له قال فيتعرف لهم تبارك وتعالى وتقدس وينجي الله المؤمنين."
    },
    {
      "ayah": 35,
      "surah": 37,
      "text": "\"إنا كذلك نفعل بالمجرمين إنهم كانوا\" أي في الدار الدنيا \"إذا قيل لهم لا إله إلا الله يستكبرون\" أي يستكبرون أن يقولوها كما يقولها المؤمنون. قال ابن أبي حاتم حدثنا عبيد الله بن أخي بن وهب حدثنا عمي حدثنا الليث عن ابن مسافر يعني عبدالرحمن بن خالد عن ابن شهاب عن سعيد بن المسيب عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم \"أمرت أن أقاتل الناس حتى يقولوا لا إله إلا الله فمن قال لا إله إلا الله فقد عصم مني ماله ونفسه إلا بحقه وحسابه على الله عز وجل\" وأنزل الله تعالى في كتابه العزيز وذكر قوما استكبروا فقال تعالى \"إنهم كانوا إذا قيل لهم لا إله إلا الله يستكبرون\". وقال ابن أبي حاتم أيضا حدثنا أبي حدثنا أبو سلمة موسى بن إسماعيل حدثنا حماد عن سعيد الجريري عن أبي العلاء قال: يؤتى باليهود يوم القيامة فيقال لهم ما كنتم تعبدون؟ فيقولون نعبد الله وعزيرا فيقال لهم خذوا ذات الشمال ثم يؤتى بالنصارى فيقال لهم ما كنتم تعبدون؟ فيقولون نعبد الله والمسيح فيقال لهم خذوا ذات الشمال ثم يؤتى بالمشركين فيقال لهم لا إله إلا الله فيستكبرون ثم يقال لهم لا إله إلا الله فيستكبرون ثم يقال لهم لا إله إلا الله فيستكبرون فيقال لهم خذوا ذات الشمال. قال أبو نضرة فينطلقون أسرع من الطير قال أبو العلاء ثم يؤتى بالمسلمين فيقال لهم ما كنتم تعبدون؟ فيقولون كنا نعبد الله تعالى فيقال لهم هل تعرفونه إذا رأيتموه؟ فيقولون نعم فيقال لهم فكيف تعرفونه ولم تروه؟ فيقولون نعلم أنه لا عدل له قال فيتعرف لهم تبارك وتعالى وتقدس وينجي الله المؤمنين."
    },
    {
      "ayah": 36,
      "surah": 37,
      "text": "أي أنحن نترك عبادة آلهتنا وآلهة آبائنا عن قول هذا الشاعر المجنون يعنون رسول الله صلى الله عليه وسلم."
    },
    {
      "ayah": 37,
      "surah": 37,
      "text": "قال الله تعالى تكذيبا لهم وردا عليهم \"بل جاء بالحق\" يعني رسول الله صلى الله عليه وسلم جاء بالحق في جميع شرعة الله تعالى له من الأخبار والطلب \"وصدق المرسلين\" أي صدقهم فيما أخبروا عنه من الصفات الحميدة والمناهج السديدة وأخبر عن الله تعالى فى شرعه وأمره كما اخبروا \"ما يقال لك إلا ما قد قيل للرسل من قبلك\" الآية."
    },
    {
      "ayah": 38,
      "surah": 37,
      "text": "يقول تعالى مخاطبا للناس \"إنكم لذائقو العذاب الأليم وما تجزون إلا ما كنتم تعملون\" ثم استثنى من ذلك عباده المخلصين كما قال تعالى \"والعصر إن الإنسان لفي خسر إلا الذين آمنوا وعملوا الصالحات\" وقال عز وجل \"لقد خلقنا الإنسان في أحسن تقويم ثم رددناه أسفل سافلين إلا الذين آمنوا وعملوا الصالحات\" وقال تعالى \"وإن منكم إلا واردها كان على ربك حتما مقضيا ثم ننجي الذين اتقوا ونذر الظالمين فيها جثيا\" وقال تعالى \"كل نفس بما كسبت رهينة إلا أصحاب اليمين\" ولهذا قال جل وعلا ههنا \"إلا عباد الله المخلصين\" أي ليسوا يذوقون العذاب الأليم ولا يناقشون في الحساب بل يتجاوز عن سيئاتهم إن كان لهم سيئات ويجزون الحسنة بعشر أمثالها إلى سبعمائة ضعف إلى أضعاف كثيرة إلى ما يشاء الله تعالى من التضعيف."
    },
    {
      "ayah": 39,
      "surah": 37,
      "text": "يقول تعالى مخاطبا للناس \"إنكم لذائقو العذاب الأليم وما تجزون إلا ما كنتم تعملون\" ثم استثنى من ذلك عباده المخلصين كما قال تعالى \"والعصر إن الإنسان لفي خسر إلا الذين آمنوا وعملوا الصالحات\" وقال عز وجل \"لقد خلقنا الإنسان في أحسن تقويم ثم رددناه أسفل سافلين إلا الذين آمنوا وعملوا الصالحات\" وقال تعالى \"وإن منكم إلا واردها كان على ربك حتما مقضيا ثم ننجي الذين اتقوا ونذر الظالمين فيها جثيا\" وقال تعالى \"كل نفس بما كسبت رهينة إلا أصحاب اليمين\" ولهذا قال جل وعلا ههنا \"إلا عباد الله المخلصين\" أي ليسوا يذوقون العذاب الأليم ولا يناقشون في الحساب بل يتجاوز عن سيئاتهم إن كان لهم سيئات ويجزون الحسنة بعشر أمثالها إلى سبعمائة ضعف إلى أضعاف كثيرة إلى ما يشاء الله تعالى من التضعيف."
    },
    {
      "ayah": 4,
      "surah": 37,
      "text": "وقوله عز وجل \"إن إلهكم لواحد رب السموات والأرض\" هذا هو المقسم عليه أنه تعالى لا إله إلا هو رب السموات والأرض \"وما بينهما\" أي من المخلوقات \"ورب المشارق\" أي هو المالك المتصرف في الخلق بتسخيره بما فيه من كواكب ثوابت وسيارات تبدو من المشرق وتغرب من المغرب واكتفى بذكر المشارق عن المغارب لدلالتها عليه وقد صرح بذلك في قوله عز وجل \"فلا أقسم برب المشارق والمغارب إنا لقادرون\" وقال تعالى فى الآية الأخرى \"رب المشرقين ورب المغربين\" يعني في الشتاء والصيف للشمس والقمر."
    },
    {
      "ayah": 40,
      "surah": 37,
      "text": "يقول تعالى مخاطبا للناس \"إنكم لذائقو العذاب الأليم وما تجزون إلا ما كنتم تعملون\" ثم استثنى من ذلك عباده المخلصين كما قال تعالى \"والعصر إن الإنسان لفي خسر إلا الذين آمنوا وعملوا الصالحات\" وقال عز وجل \"لقد خلقنا الإنسان في أحسن تقويم ثم رددناه أسفل سافلين إلا الذين آمنوا وعملوا الصالحات\" وقال تعالى \"وإن منكم إلا واردها كان على ربك حتما مقضيا ثم ننجي الذين اتقوا ونذر الظالمين فيها جثيا\" وقال تعالى \"كل نفس بما كسبت رهينة إلا أصحاب اليمين\" ولهذا قال جل وعلا ههنا \"إلا عباد الله المخلصين\" أي ليسوا يذوقون العذاب الأليم ولا يناقشون في الحساب بل يتجاوز عن سيئاتهم إن كان لهم سيئات ويجزون الحسنة بعشر أمثالها إلى سبعمائة ضعف إلى أضعاف كثيرة إلى ما يشاء الله تعالى من التضعيف."
    },
    {
      "ayah": 41,
      "surah": 37,
      "text": "قوله جل وعلا \"أولئك لهم رزق معلوم\" قال قتادة والسدي يعني الجنة ثم فسره بقوله تعالى \"فواكه\" أي متنوعة \"وهم مكرمون\" أي يخدمون ويرفهون وينعمون."
    },
    {
      "ayah": 42,
      "surah": 37,
      "text": "قوله جل وعلا \"أولئك لهم رزق معلوم\" قال قتادة والسدي يعني الجنة ثم فسره بقوله تعالى \"فواكه\" أي متنوعة \"وهم مكرمون\" أي يخدمون ويرفهون وينعمون."
    },
    {
      "ayah": 43,
      "surah": 37,
      "text": "قال مجاهد لا ينظر بعضهم إلى قفا بعض وقال ابن أبي حاتم حدثنا يحيى بن عبدك القزويني حدثنا حسان بن حسان حدثنا إبراهيم بن بشر حدثنا يحيى بن معين حدثنا إبراهيم القرشي عن سعيد بن شرحبيل عن زيد بن أبي أوفى رضي الله عنه قال خرج علينا رسول الله صلى الله عليه وسلم فتلا هذه الآية \"\"على سرر متقابلين\" ينظر بعضهم إلى بعض\" حديث غريب."
    },
    {
      "ayah": 44,
      "surah": 37,
      "text": "قال مجاهد لا ينظر بعضهم إلى قفا بعض وقال ابن أبي حاتم حدثنا يحيى بن عبدك القزويني حدثنا حسان بن حسان حدثنا إبراهيم بن بشر حدثنا يحيى بن معين حدثنا إبراهيم القرشي عن سعيد بن شرحبيل عن زيد بن أبي أوفى رضي الله عنه قال خرج علينا رسول الله صلى الله عليه وسلم فتلا هذه الآية \"\"على سرر متقابلين\" ينظر بعضهم إلى بعض\" حديث غريب."
    },
    {
      "ayah": 45,
      "surah": 37,
      "text": "قوله تعالى \"يطاف عليهم بكأس من معين بيضاء لذة للشاربين لا فيها غول ولا هم عنها ينزفون\" كما قال عز وجل في الآية الأخرى \"يطوف عليهم ولدان مخلدون بأكواب وأباريق وكأس من معين لا يصدعون عنها ولا ينزفون\" نزه الله سبحانه وتعالى خمر الجنة عن الآفات التي في خمر الدنيا من صداع الرأس ووجع البطن وهو الغول وذهابها بالعقل جملة فقال تعالى ههنا \"يطاف عليهم بكأس من معين\" أي بخمر من أنهار جارية لا يخافون انقطاعها ولا فراغها قال مالك عن زيد بن أسلم: خمر جارية بيضاء أي لونها مشرق حسن بهي لا كخمر الدنيا في منظرها البشع الرديء من حمرة أو سواد أو اصفرار أو كدورة إلى غير ذلك مما ينفر الطبع السليم وقوله عز وجل \"لذة للشاربين\" أي طعمها طيب كلونها وطيب الطعم دليل على طيب الريح بخلاف خمر الدنيا في جميع ذلك."
    },
    {
      "ayah": 46,
      "surah": 37,
      "text": "قوله تعالى \"يطاف عليهم بكأس من معين بيضاء لذة للشاربين لا فيها غول ولا هم عنها ينزفون\" كما قال عز وجل في الآية الأخرى \"يطوف عليهم ولدان مخلدون بأكواب وأباريق وكأس من معين لا يصدعون عنها ولا ينزفون\" نزه الله سبحانه وتعالى خمر الجنة عن الآفات التي في خمر الدنيا من صداع الرأس ووجع البطن وهو الغول وذهابها بالعقل جملة فقال تعالى ههنا \"يطاف عليهم بكأس من معين\" أي بخمر من أنهار جارية لا يخافون انقطاعها ولا فراغها قال مالك عن زيد بن أسلم: خمر جارية بيضاء أي لونها مشرق حسن بهي لا كخمر الدنيا في منظرها البشع الرديء من حمرة أو سواد أو اصفرار أو كدورة إلى غير ذلك مما ينفر الطبع السليم وقوله عز وجل \"لذة للشاربين\" أي طعمها طيب كلونها وطيب الطعم دليل على طيب الريح بخلاف خمر الدنيا في جميع ذلك."
    },
    {
      "ayah": 47,
      "surah": 37,
      "text": "وقوله تعالى \"لا فيها غول\" يعني لا تؤثر فيهم عولا وهو وجع البطن قاله ابن عباس رضي الله عنهما ومجاهد وقتادة وابن زيد كما تفعله خمر الدنيا من القولنج ونحوه لكثرة مائيتها وقيل المراد بالغول ههنا صداع الرأس وروي هكذا عن ابن عباس رضي الله عنهما وقال قتادة هو صداع الرأس ووجع البطن وعنه وعن السدي لا تغتال عقولهم كما قال الشاعر: فمنا زالت الكأس تغتالنا وتذهب بالأول الأول وقال سعيد بن جبير لا مكروه فيها ولا أذى والصحيح قول مجاهد أنه وجع البطن وقوله تعالى \"ولاهم عنها ينزفون\" قال مجاهد لا تذهب عقولهم وكذا قال ابن عباس ومحمد بن كعب والحسن وعطاء بن أبي مسلم الخراساني والسدي وغيرهم وقال الضحاك عن ابن عباس في الخمر أربع خصال السكر والصداع والقيء والبول فذكر الله تعالى خمر الجنة فنزهها عن هذه الخصال."
    },
    {
      "ayah": 48,
      "surah": 37,
      "text": "قوله تعالى \"وعندهم قاصرات الطرف\" أي عفيفات لا ينظرن إلى غير أزواجهن كذا قال ابن عباس رضي الله عنهما ومجاهد وزيد بن أسلم وقتادة والسدي وغيرهم. وقوله تبارك وتعالى \"عين\" أي حسان الأعين وقيل ضخام الأعين وهو يرجع إلى الأول وهي النجلاء العيناء فوصف عيونهن بالحسن والعفة كقول زليخا في يوسف عليه الصلاة والسلام حين جملته وأخرجته على تلك النسوة فأعظمنه وأكبرنه وظنن أنه ملك من الملائكة لحسنه وبهاء منظره قالت \"فذلكن الذي لمتنني فيه ولقد راودته عن نفسه فاستعصم\" أي هو مع هذا الجمال عفيف تقي نقي وهكذا الحور العين \"خيرات حسان\" ولهذا قال عز وجل \"وعندهم قاصرات الطرف عين\"."
    },
    {
      "ayah": 49,
      "surah": 37,
      "text": "وقوله جل جلاله \"كأنهن بيض مكنون\" وصفهن بترافة الأبدان بأحسن الألوان قال علي بن أبي طلحة عن ابن عباس رضي الله عنهما \"كأنهن بيض مكنون\" يقول اللؤلؤ المكنون وينشد ههنا بيت أبي دهبل الشاعر وهو قوله في قصيدة له وهي زهراء مثل لؤلؤة الغواص ميزت من جوهر مكنون وقال الحسن \"كأنهن بيض مكنون\" يعني محصون لم تمسه الأيدي وقال السدي البيض في عشه مكنون وقال سعيد بن جبير \"كأنهن بيض مكنون\" يعني بطن البيض وقال عطاء الخراساني هو السحاء الذي يكون بين قشرته العليا ولباب البيضة وقال السدي \"كأنهن بيض مكنون\" يقول بياض البيض حين ينزع قشرته واختاره ابن جرير لقوله مكنون قال والقشرة العليا يمسها جناح الطير والعش وتنالها الأيدي بخلاف داخلها والله أعلم. وقال ابن جرير حدثنا أحمد بن عبدالرحمن بن وهب حدثنا محمد بن الفرح الصدفي الدمياطي عن عمرو بن هاشم عن ابن أبي كريمة عن هشام عن الحسن عن أمه عن أم سلمة رضي الله عنها قالت: قلت يا رسول الله أخبرني عن قول الله عز وجل \"حور عين\" قال \"العين الضخام العيون شفر الحوراء بمنزلة جناح النسر\" قلت يا رسول الله أخبرني عن قول الله عز وجل \"كأنهن بيض مكنون\" قال \"رقتهن كرقة الجلدة التي رأسها في داخل البيضة التي تلي القشر وهي الغرقئ\". وقال ابن أبي حاتم حدثنا أبي حدثنا أبو غسان النهدي حدثنا عبدالسلام بن حرب عن ليث عن الربيع بن أنس عن أنس رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم \"أنا أول الناس خروجا إذا بعثوا وأنا خطيبهم إذا وفدوا وأنا مبشرهم إذا حزنوا وأنا شفيعهم إذا حبسوا لواء الحمد يومئذ بيدي وأنا أكرم ولد آدم على الله عز وجل ولا فخر يطوف علي ألف خادم كأنهن البيض المكنون - أو اللؤلؤ المكنون\" والله تعالى أعلم بالصواب."
    },
    {
      "ayah": 5,
      "surah": 37,
      "text": "وقوله عز وجل \"إن إلهكم لواحد رب السموات والأرض\" هذا هو المقسم عليه أنه تعالى لا إله إلا هو رب السموات والأرض \"وما بينهما\" أي من المخلوقات \"ورب المشارق\" أي هو المالك المتصرف في الخلق بتسخيره بما فيه من كواكب ثوابت وسيارات تبدو من المشرق وتغرب من المغرب واكتفى بذكر المشارق عن المغارب لدلالتها عليه وقد صرح بذلك في قوله عز وجل \"فلا أقسم برب المشارق والمغارب إنا لقادرون\" وقال تعالى فى الآية الأخرى \"رب المشرقين ورب المغربين\" يعني في الشتاء والصيف للشمس والقمر."
    },
    {
      "ayah": 50,
      "surah": 37,
      "text": "يخير تعالى عن أهل الجنة أنه أقبل بعضهم على بعض يتساءلون أي عن أحوالهم وكيف كانوا في الدنيا وماذا كانوا يعانون فيها وذلك من حديثهم على شرابهم واجتماعهم في تنادمهم ومعاشرتهم في مجالسهم وهم جلوس على السرر والخدم بين أيديهم يسعون ويجيئون بكل خير عظيم من مآكل ومشارب وملابس وغير ذلك مما لا عين رأت ولا أذن سمعت ولا خطر على قلب بشر."
    },
    {
      "ayah": 51,
      "surah": 37,
      "text": "قال مجاهد يعني شيطانا وقال العوفي عن ابن عباس رضي الله عنهما هو الرجل المشرك يكون له صاحب من أهل الإيمان في الدنيا ولا تنافي بين كلام مجاهد وابن عباس رضي الله عنهما فإن الشيطان يكون من الجن فيوسوس في النفس ويكون من الإنس فيقول كلاما تسمعه الأذنان وكلاهما يتعاونان قال الله تعالى \"يوحي بعضهم إلى بعض زخرف القول غرورا\" وكل منهما يوسوس كما قال الله عز وجل \"من شر الوسواس الخناس الذي يوسوس في صدور الناس من الجنة والناس\"."
    },
    {
      "ayah": 52,
      "surah": 37,
      "text": "أي أأنت تصدق بالبعث والنشور والحساب والجزاء يعني يقول ذلك على وجه التعجب والتكذيب والاستبعاد والكفر والعناد."
    },
    {
      "ayah": 53,
      "surah": 37,
      "text": "قال مجاهد والسدي لمحاسبون وقال ابن عباس رضي الله عنهما ومحمد بن كعب القرظي لمجزيون بأعمالنا وكلاهما صحيح."
    },
    { "ayah": 54, "surah": 37, "text": "أي مشرفون يقول المؤمن لأصحابه وجلسائه من أهل الجنة." },
    {
      "ayah": 55,
      "surah": 37,
      "text": "قال ابن عباس رضي الله عنهما وسعيد بن جبير وخليد العصري وقتادة والسدي وعطاء الخراساني يعني فى وسط الجحيم وقال الحسن البصري في وسط الجحيم كأنه شهاب يتقد وقال قتادة ذكر لنا أنه اطلع فرأى جماجم القوم تغلي وذكر لنا أن كعب الأحبار قال في الجنة كوى إذا أراد أحد من أهلها أن ينظر إلى عدوه في النار اطلع فيها فازداد شكرا."
    },
    { "ayah": 56, "surah": 37, "text": "يقول المؤمن مخاطبا للكافر والله إن كدت لتهلكني لو أطعتك." },
    {
      "ayah": 57,
      "surah": 37,
      "text": "أي ولولا فضل الله علي لكنت مثلك في سواء الجحيم حيث أنت محضر معك في العذاب ولكنه تفضل علي ورحمني فهداني للإيمان وأرشدني إلى توحيده \"وما كنا لنهتدي لولا أن هدانا الله\"."
    },
    {
      "ayah": 58,
      "surah": 37,
      "text": "قوله تعالى \"أفما نحن بميتين إلا موتتنا الأولى\" وما نحن بمعذبين هذا من كلام المؤمن مغتبطا نفسه بما أعطاه الله تعالى من الخلد في الجنة والإقامة في دار الكرامة بلا موت فيها ولا عذاب ولهذا قال عز وجل \"إن هذا لهو الفوز العظيم\" وقال ابن أبي حاتم حدثنا أبو عبدالله الظهراني حدثنا حفص بن عمر العدني حدثنا الحكم بن أبان عن عكرمة قال: قال ابن عباس رضي الله عنهما في قول الله تبارك وتعالى لأهل الجنة \"كلوا وأشربوا هنيئا بما كنتم تعملون\" قال ابن عباس رضي الله عنهما وقوله عز وجل \"هنيئا\" أي لا يموتون فيها فعندها قالوا \"أفما نحن بميتين إلا موتتنا الأولى وما نحن بمعذبين\" وقال الحسن البصري علموا أن كل نعيم فإن الموت يقطعه فقالوا \"أفما نحن بميتين إلا موتتنا الأولى وما نحن بمعذبين\" قيل لا قالوا \"إن هذا لهو الفوز العظيم\"."
    },
    {
      "ayah": 59,
      "surah": 37,
      "text": "قوله تعالى \"أفما نحن بميتين إلا موتتنا الأولى\" وما نحن بمعذبين هذا من كلام المؤمن مغتبطا نفسه بما أعطاه الله تعالى من الخلد في الجنة والإقامة في دار الكرامة بلا موت فيها ولا عذاب ولهذا قال عز وجل \"إن هذا لهو الفوز العظيم\" وقال ابن أبي حاتم حدثنا أبو عبدالله الظهراني حدثنا حفص بن عمر العدني حدثنا الحكم بن أبان عن عكرمة قال: قال ابن عباس رضي الله عنهما في قول الله تبارك وتعالى لأهل الجنة \"كلوا وأشربوا هنيئا بما كنتم تعملون\" قال ابن عباس رضي الله عنهما وقوله عز وجل \"هنيئا\" أي لا يموتون فيها فعندها قالوا \"أفما نحن بميتين إلا موتتنا الأولى وما نحن بمعذبين\" وقال الحسن البصري علموا أن كل نعيم فإن الموت يقطعه فقالوا \"أفما نحن بميتين إلا موتتنا الأولى وما نحن بمعذبين\" قيل لا قالوا \"إن هذا لهو الفوز العظيم\"."
    },
    {
      "ayah": 6,
      "surah": 37,
      "text": "يخبر تعالى أنه زين السماء الدنيا للناظرين إليها من أهل الأرض بزينة الكواكب قرئ بالإضافة وبالبدل وكلاهما بمعنى واحد فالكواكب السيارة والثوابت يثقب ضوءها جرم السماء الشفاف فتضيء لأهل الأرض كما قال تبارك وتعالى \"ولقد زينا السماء الدنيا بمصابيح وجعلناها رجوما للشياطين واعتدنا لهم عذاب السعير\" وقال عز وجل \"ولقد جعلنا في السماء بروجا وزيناها للناظرين وحفظناها من كل شيطان رجيم إلا من استرق السمع فأتبعه شهاب مبين\"."
    },
    {
      "ayah": 60,
      "surah": 37,
      "text": "قوله تعالى \"أفما نحن بميتين إلا موتتنا الأولى\" وما نحن بمعذبين هذا من كلام المؤمن مغتبطا نفسه بما أعطاه الله تعالى من الخلد في الجنة والإقامة في دار الكرامة بلا موت فيها ولا عذاب ولهذا قال عز وجل \"إن هذا لهو الفوز العظيم\" وقال ابن أبي حاتم حدثنا أبو عبدالله الظهراني حدثنا حفص بن عمر العدني حدثنا الحكم بن أبان عن عكرمة قال: قال ابن عباس رضي الله عنهما في قول الله تبارك وتعالى لأهل الجنة \"كلوا وأشربوا هنيئا بما كنتم تعملون\" قال ابن عباس رضي الله عنهما وقوله عز وجل \"هنيئا\" أي لا يموتون فيها فعندها قالوا \"أفما نحن بميتين إلا موتتنا الأولى وما نحن بمعذبين\" وقال الحسن البصري علموا أن كل نعيم فإن الموت يقطعه فقالوا \"أفما نحن بميتين إلا موتتنا الأولى وما نحن بمعذبين\" قيل لا قالوا \"إن هذا لهو الفوز العظيم\"."
    },
    {
      "ayah": 61,
      "surah": 37,
      "text": "وقوله جل جلاله \"لمثل هذا فليعمل العاملون\" قال قتادة هذا من كلام أهل الجنة وقال ابن جرير هو من كلام الله تعالى ومعناه لمثل هذا النعيم وهذا الفوز فليعمل العاملون في الدنيا ليصيروا إليه في الآخرة وقد ذكروا قصة رجلين كانا شريكين في بني إسرائيل تدخل في ضمن عموم هذه الآية الكريمة قال أبو جعفر بن جرير حدثني إسحاق بن إبراهيم بن حبيب بن الشهيد حدثنا عتاب بن بشير عن خصيف عن فرات بن ثعلبة النهراني في قوله \"إني كان لي قرين\" قال إن رجلين كانا شريكين فاجتمع لهما ثمانية آلاف دينار وكان احدهما له حرفة والآخر ليس له حرفة فقال الذي له حرفة للآخر ليس عندك حرفة ما أراني إلا مفارقك ومقاسمك فقاسمه وفارقه ثم إن الرجل اشترى دارا بألف دينار كانت لملك مات فدعا صاحبه فأراه فقال كيف ترى هذه الدار ابتعتها بألف دينار؟ قال ما أحسنها فلما خرج قال اللهم إن صاحبي هذا قد ابتاع هذه الدار بألف دينار وأني أسألك دارا من دور الجنة فتصدق بألف دينار ثم مكث ما شاء الله تعالى أن يمكث ثم إنه تزوج بامرأة بألف دينار فدعاه وصنع له طعاما فلما أتاه قال إني تزوجت هذه المرأة بألف دينار قال ما أحسن هذا فلما انصرف قال يا رب إن صاحبي تزوج امرأة بألف دينار وإني أسألك امرأة من الحور العين فتصدق بألف دينار ثم إنه مكث ما شاء الله تعالى أن يمكث ثم اشترى بستانين بألفي دينار ثم دعاه فأراه فقال إني ابتعت هذين البستانين بألفي دينار فقال ما أحسن هذا فلما خرج قال يا رب إن صاحبي قد اشترى بستانين بألفي دينار وأنا أسألك بستانين في الجنة فتصدق بألفي دينار ثم إن الملك أتاهما فتوفاهما ثم انطلق بهذا المتصدق فأدخله دارا تعجبه وإذا بامرأة تطلع يضيء ما تحتها من حسنها ثم أدخله بستانين وشيئا الله به عليم فقال عند ذلك ما أشبه هذا برجل كان من أمره كذا وكذا قال فإنه ذاك ولك هذا المنزل والبستانان والمرأة قال فإنه كان لي صاحب يقول \"أئنك لمن المصدقين\" قيل له فإنه الجحيم قال هل \"أنتم مطلعون فاطلع فرآه في سواء الجحيم\" فقال عند ذلك \"تالله إن كدت لتردين ولولا نعمة ربي لكنت من المحضرين\" الآيات قال ابن جرير وهذا يقوي قراءة من قرأ \"أئنك لمن المصدقين\" بالتشديد وقال ابن أبي حاتم حدثنا الحسن بن عرفة حدثنا عمرو بن عبدالرحمن الأبار أخبرنا أبو حفص قال سألت إسماعيل السدي عن هذه الآية \"قال قائل منهم إني كان لي قرين يقول أئنك لمن المصدقين\" قال: فقال لي ما ذكرك هذا؟ قلت قرأته آنفا فأحببت أن أسألك عنه فقال أما فاحفظ كان شريكان في بني إسرائيل أحدهما مؤمن والآخر كافر فافترقا على ستة آلاف دينار لكل واحد منهما ثلاثة آلاف دينار ثم افترقا فمكثا ما شاء الله تعالى أن يمكثا ثم التقيا فقال الكافر للمؤمن ما صنعت في مالك؟ أضربت به شيئا أتجرت به في شيء؟ فقال له المؤمن لا فما صنعت أنت؟ فقال اشتريت به أرضا ونخلا وثمارا وأنهارا بألف دينار - قال - فقال له المؤمن أو فعلت؟ قال نعم قال فرجع المؤمن حتى إذا كان الليل صلى ما شاء الله تعالى أن يصلي فلما انصرف أخذ ألف دينار فوضعها بين يديه ثم قال: اللهم إن فلانا - يعني شريكه الكافر - اشترى أرضا ونخلا وثمارا وأنهارا بألف دينار ثم يموت غدا ويتركها اللهم إني اشتريت منك بهذه الألف دينار أرضا ونخلا وثمارا وأنهارا في الجنة - قال - ثم أصبح فقسمها في المساكين - قال- ثم مكثا ما شاء الله تعالى أن يمكثا ثم التقيا فقال الكافر للمؤمن ما صنعت فى مالك أضربت به في شيء أتجرت به في شيء؟ قال لا قال فما صنعت أنت؟ قال كانت ضيعتي قد اشتد على مؤونتها فاشتريت رقيقا بألف دينار يقومون لي فيها يعملون لي فيها فقال له المومن أو فعلت؟ قال نعم - قال- فرجع المؤمن حتى إذا كان الليل صلى ما شاء الله تعالى أن يصلي فلما أنصرف أخذ ألف دينار فوضعها بين يديه ثم قال اللهم إن فلانا- يعني شريكه الكافر- اشترى رقيقا من رقيق الدنيا بألف دينار يموت غدا فيتركهم أو يموتون فيتركونه اللهم إني اشتريت منك بهذه الألف الدينار رقيقا في الجنة - قال - ثم أصبح فقسمها في المساكين - قال - ثم مكثا ما شاء الله تعالى أن يمكثا ثم التقيا فقال الكافر للمؤمن ما صنعت في مالك أضربت به في شيء أتجرت به في شيء؟ قال لا فما صنعت أنت؟ قال كان امري كله قد تم إلا شيئا واحدا فلانة قد مات عنها زوجها فأصدقتها ألف دينار فجاءتني بها ومثلها معها فقال له المؤمن أو فعلت؟ قال نعم قال فرجع المؤمن حتى إذا كان الليل صلى ما شاء الله تعالى أن يصلي فلما انصرف أخذ الألف الدينار الباقية فوضعها بين يديه وقال اللهم إن فلانا - يعني شريكه الكافر- تزوج زوجة من أزواج الدنيا بألف دينار فيموت غدا فيتركها أو تموت غدا فتتركه اللهم وإني أخطب إليك بهذه الألف الدينار حوراء عيناء في الجنة - قال - ثم أصبح فقسمها بين المساكين قال - فبقي المؤمن ليس عنده شيء قال فلبس قميصا من قطن وكساء من صوف ثم أخذ مرا فجعله على رقبته يعمل الشيء ويحفر الشيء بقوته قال فجاءه رجل فقال له يا عبدالله أتؤاجرني نفسك مشاهرة شهرا بشهر تقوم على دواب لي تعلفا وتكنس سرقينها قال أفعل قال فواجره نفسه مشاهرة شهرا بشهر يقوم على دوابه وقال وكان صاحب الدواب يغدو كل يوم ينظر إلى دوابه فإذا رأى منها دابة ضامرة أخذ برأسه فوجأ عنقه ثم يقول له سرقت شعير هذه البارحة قال فلما رأى المؤمن هذه الشدة قال لآتين شريكي الكافر فلأعملن في أرضه فليطعمني هذه الكسرة يوما بيوم ويكسوني هذين الثوبين إذا بليا قال فانطلق يريده فانتهى إلى بابه وهو ممس فإذا قصر مشيد فى السماء وإذا حوله البوابون فقال لهم استأذنوا لي على صاحب هذا القصر فإنكم إذا فعلتم سره ذلك فقالوا له انطلق إن كانت صادقا فنم في ناحية فإذا أصبحت فتعرض له قال فانطلق المؤمن فألقى نصف كسائه تحته ونصفه ثم نام فلما أصبح أتى شريكه فتعرض له فخرج شريكه الكافر وهو راكب فلما رآه عرفه فوقف عليه وسلم عليه وصافحه ثم قال له ألم تأخذ من المال مثل ما أخذت؟ قال بلى قال وهذه حالي وهذه حالك؟ قال بلى قال أخبرني ما صنعت في مالك؟ قال لا تسألني عنه قال فما جاء بك؟ قال جئت أعمل فى أرضك هذه فتطعمني هذه الكسرة يوما بيوم وتكسوني هذين الثوبين إذا بليا قال لا ولكن أصنع بك ما هو خير من هذا ولكن لا ترى مني خيرا حتى تخبرني ما صنعت في مالك قال أقرضته قال من؟ قال المليء الوفي قال من؟ قال الله ربي قال وهو مصافحه فانتزع يده من يده ثم قال \"أئنك لمن المصدقين أئذا متنا وكنا ترابا وعظاما أئنا لمدينون\" قال السدي محاسبون قال فانطلق الكافر وتركه قال فلما رآه المؤمن وليس يلوي عليه رجع وتركه يعيش المؤمن في شدة من الزمان ويعيش الكافر في رخاء من الزمان قال فإذا كان يوم القيامة وأدخل الله تعالى المؤمن الجنة يمر فإذا هو بأرض ونخل وثمار وأنهار فيقول لمن هذا؟ فيقال هذا لك فيقول يا سبحان الله أو بلغ من فضل عملي أن أثاب بمثل هذا؟ قال ثم يمر فإذا هو برقيق لا تحصى عدتهم فيقول لمن هذا؟ فيقول هؤلاء لك فيقول يا سبحان الله أو بلغ من فضل عملي أن أثاب بمثل هذا قال ثم يمر فإذا هو بقبة من ياقوتة حمراء مجوفة فيها حوراء عيناء فيقول لمن هذه فيقال هذه لك فيقول يا سبحان الله أو بلغ من فضل عملي أن أثاب بمثل هذا قال ثم يذكر المؤمن شريكه الكافر فيقول \"إني كان لي قرين يقول أئنك لمن المصدقين أئذا متنا وكنا ترابا وعظاما أئنا لمدينون\" قال فالجنة عالية والنار هاوية قال فيريه الله تعالى شريكه في وسط الجحيم من بين أهل النار فإذا رآه المؤمن عرفه فيقول \"تالله إن كدت لتردين ولولا نعمة ربي لكنت من المحضرين أفما نحن بميتين إلا موتتنا الأولى وما نحن بمعذبين إن هذا لهو الفوز العظيم لمثل هذا فليعمل العاملون\" بمثل ما قد من عليه قال فيتذكر المؤمن ما مر عليه في الدنيا من الشدة فلا يذكر مما مر عليه في الدنيا من الشدة أشد عليه من الموت."
    },
    {
      "ayah": 62,
      "surah": 37,
      "text": "يقول الله تعالى أهذا الذي ذكره من الجنة وما فيها من مآكل ومشارب ومناكح وغير ذلك من الملاذ خير ضيافة وعطاء \"أم شجرة الزقوم\" أي التي في جهنم وقد يحتمل أن يكون المراد بذلك شجرة واحدة معينة كما قال بعضهم إنها شجرة تمتد فروعها إلى جميع محال جهنم كما أن شجرة طوبى ما من دار في الجنة إلا وفيها منها غصن وقد يحتمل أن يكون المراد بذلك جنس شجر يقال له الزقوم كقوله تعالى \"وشجرة تخرج من طور سيناء تنبت بالدهن وصبغ للآكلين\" يعني الزيتونة ويؤيد ذلك قوله تعالى \"ثم إنكم أيها الضالون المكذبون لآكلون من شجر من زقوم\"."
    },
    {
      "ayah": 63,
      "surah": 37,
      "text": "قال قتادة ذكرت شجرة الزقوم فافتتن بها أهل الضلالة وقالوا صاحبكم ينبئكم أن في النار شجرة والنار تأكل الشجر فأنزل الله تعالى \"إنها شجرة تخرج في أصل الجحيم\" غذيت من النار ومنها خلقت وقال مجاهد \"إنا جعلناها فتنة للظالمين\" قال أبو جهل لعنه الله إنما الزقوم التمر والزبد أتزقمه قلت ومعنى الآية إنما أخبرناك يا محمد بشجرة الزقوم اختبارا نختبر به الناس من يصدق منهم ممن يكذب كقوله تبارك وتعالى \"وما جعلنا الرؤيا التي أريناك إلا فتنة للناس والشجرة الملعونة في القرآن ونخوفهم فما يزيدهم إلا طغيانا كبيرا\"."
    },
    {
      "ayah": 64,
      "surah": 37,
      "text": "قوله تعالى \"إنها شجرة تخرج في أصل الجحيم\" أي أصل منبتها فى قرار النار طلعها كأنه رؤوس الشياطين تبشيع لها وتكريه لذكرها. قال وهب بن منبه شعور الشياطين قائمة إلى السماء وأنما شبهها برؤوس الشياطين وإن لم تكن معروفة عند المخاطبين لأنه قد استقر في النفوس أن الشياطين قبيحة المنظر وقيل المراد بذلك ضرب من الحيات رؤوسها بشعة المنظر وقيل جنس من النبات طلعه فى غاية الفحاشة وفى هذين الاحتمالين نظر وقد ذكرهما ابن جرير والأول أقوى وأولى والله أعلم."
    },
    {
      "ayah": 65,
      "surah": 37,
      "text": "قوله تعالى \"إنها شجرة تخرج في أصل الجحيم\" أي أصل منبتها فى قرار النار طلعها كأنه رؤوس الشياطين تبشيع لها وتكريه لذكرها. قال وهب بن منبه شعور الشياطين قائمة إلى السماء وأنما شبهها برؤوس الشياطين وإن لم تكن معروفة عند المخاطبين لأنه قد استقر في النفوس أن الشياطين قبيحة المنظر وقيل المراد بذلك ضرب من الحيات رؤوسها بشعة المنظر وقيل جنس من النبات طلعه فى غاية الفحاشة وفى هذين الاحتمالين نظر وقد ذكرهما ابن جرير والأول أقوى وأولى والله أعلم."
    },
    {
      "ayah": 66,
      "surah": 37,
      "text": "ذكر تعالى أنهم يأكلون من هذه الشجرة التي لا أبشع منها ولا أقبح من منظرها مع ما هي عليه من سوء الطعم والريح والطبع فإنهم ليضطرون إلى الأكل منها لأنهم لا يجدون إلا إياها وما هو فى معناها كما قال تعالى \"ليس لهم طعام إلا من ضريع لا يسمن ولا يغني من جوع\" وقال ابن أبى حاتم رحمه الله حدثنا أبي حدثنا عمرو بن مرزوق حدثنا شعبة عن الأعمش عن مجاهد عن ابن عباس رضي الله عنهما أن رسول الله صلى الله عليه وسلم تلا هذه الآية وقال \"اتقوا الله حق تقاته فلو أن قطرة من الزقوم قطرت في بحار الدنيا لأفسدت على أهل الأرض معايشهم فكيف بمن يكون طعامه؟\" ورواه الترمذي والنسائي وابن ماجه من حديث شعبة وقال الترمذي حسن صحيح."
    },
    {
      "ayah": 67,
      "surah": 37,
      "text": "قال ابن عباس رضي الله عنهما يعني شرب الحميم على الزقوم وقال في رواية عنه \"شوبا من حميم\" مزجا من حميم وقال غيره يعني يمزج لهم الحميم بصديد وغساق ممـا يسيل من فروجهم وعيونهم وقال ابن أبي حاتم حدثنا أبي حدثنا حيوة بن شريح الحضرمي حدثنا بقية بن الوليد عن صفوان بن عمر وأخبرني عبيد بن بشير عن أبي أمامة الباهلي رضي الله عنه عن رسول الله صلى الله عليه وسلم أنه كان يقول: \"يقرب - يعني إلى أهل النار- ماء فيتكرهه فإذا أدني منه شوى وجهه ووقعت فروة رأسه فيه فإذا شربه قطع أمعاءه حتى تخرج من دبره\" وقال ابن أبي حاتم حدثنا أبي حدثنا عمرو بن رافع حدثنا يعقوب بن عبدالله عن جعفر وهارون بن عنترة عن سعد بن جبير قال إذا جاع أهل النار استغاثوا بشجرة الزقوم فأكلوا منها فاختلست جلود وجوههم فلو أن مارا مر بهم يعرفهم لعرفهم بوجوههم فيها ثم يصب عليهم العطش فيستغيثون فيغاثوا بماء كالمهل وهو الذي قد انتهى حره فإذا أدنوه من أفواههم اشتوى من حره لحوم وجوههم التي قد سقطت عنها الجلود ويصهر ما في بطونهم فيمشون تسيل أمعاءهم وتتساقط جلودهم ثم يضربون بمقامع من حديد فيسقط كل عضو على حياله يدعون بالثبور."
    },
    {
      "ayah": 68,
      "surah": 37,
      "text": "أي ثم إن مردهم بعد هذا الفصل لإلى نار تتأجج وجحيم تتوقد وسعير تتوهج فتارة في هذا وتارة فى هذا كما قال تعالى \"يطوفون بينها وبين حميم آن\" هكذا تلا قتادة هذه الآية وهو تفسير حسن قوي وقال السدي في قراءة عبدالله رضي الله عنه عنه \"ثم إن مقيلهم لإلى الجحيم\" وكان عبدالله رضي الله عنه يقول والذي نفسي بيده لا ينتصف النهار يوم القيامة حتى يقيل أهل الجنة في الجنة وأهل النار في النار ثم قرأ \"أصحاب الجنة يومئذ خير مستقرا وأحسن مقيلا\" وروى الثوري عن ميسرة عن المنهال بن عمرو عن أبي عبيدة عن عبدالله رضي الله عنه قال: لا ينتصف النهار يوم القيامة حتى يقيل هؤلاء ويقيل هؤلاء قال سفيان -أراه- ثم قرأ \"أصحاب الجنة يومئذ خير مستقرا وأحسن مقيلا\" ثم إن مقيلهم لإلى الجحيم قلت على هذا التفسير تكون ثم عاطفة لخبر على خبر."
    },
    {
      "ayah": 69,
      "surah": 37,
      "text": "وقوله تعالى \"إنهم ألفوا آباءهم ضالين\" أي إنما جازيناهم بذلك لأنهم وجدوا آباءهم على الضلالة فاتبعوهم فيها بمجرد ذلك من غير دليل ولا برهان ولهذا قال \"فهم على آثارهم يهرعون\" قال مجاهد شبيهة بالهرولة وقال سعيد ابن جبير يسفهون."
    },
    {
      "ayah": 7,
      "surah": 37,
      "text": "قوله جل وعلا ههنا \"وحفظا\" تقديره وحفظناها حفظا \"من كل شيطان مارد\": يعني المتمرد العاتي."
    },
    {
      "ayah": 70,
      "surah": 37,
      "text": "وقوله تعالى \"إنهم ألفوا آباءهم ضالين\" أي إنما جازيناهم بذلك لأنهم وجدوا آباءهم على الضلالة فاتبعوهم فيها بمجرد ذلك من غير دليل ولا برهان ولهذا قال \"فهم على آثارهم يهرعون\" قال مجاهد شبيهة بالهرولة وقال سعيد ابن جبير يسفهون."
    },
    { "ayah": 71, "surah": 37, "text": "يخبر تعالى عن الأمم الماضية أن أكثرهم كانوا ضالين يجعلون مع الله آلهة أخرى." },
    {
      "ayah": 72,
      "surah": 37,
      "text": "وذكر تعالى أنه أرسل فيهم منذرين ينذرون بأس الله ويحذرونهم سطوته ونقمته ممن كفر به وعبد غيره وأنهم تمادوا على مخالفة رسلهم وتكذيبهم فأهلك المكذبين ودمرهم ونجى المؤمنين ونصرهم وظفرهم ولهذا قال تعالى \"فانظر كيف كان عاقبة المنذرين إلا عباد الله المخلصين\"."
    },
    {
      "ayah": 73,
      "surah": 37,
      "text": "وذكر تعالى أنه أرسل فيهم منذرين ينذرون بأس الله ويحذرونهم سطوته ونقمته ممن كفر به وعبد غيره وأنهم تمادوا على مخالفة رسلهم وتكذيبهم فأهلك المكذبين ودمرهم ونجى المؤمنين ونصرهم وظفرهم ولهذا قال تعالى \"فانظر كيف كان عاقبة المنذرين إلا عباد الله المخلصين\"."
    },
    {
      "ayah": 74,
      "surah": 37,
      "text": "وذكر تعالى أنه أرسل فيهم منذرين ينذرون بأس الله ويحذرونهم سطوته ونقمته ممن كفر به وعبد غيره وأنهم تمادوا على مخالفة رسلهم وتكذيبهم فأهلك المكذبين ودمرهم ونجى المؤمنين ونصرهم وظفرهم ولهذا قال تعالى \"فانظر كيف كان عاقبة المنذرين إلا عباد الله المخلصين\"."
    },
    {
      "ayah": 75,
      "surah": 37,
      "text": "لما ذكر تعالى عن أكثر الأولين أنهم ضلوا عن سبيل النجاة شرع يبين ذلك مفصلا فذكر نوحا عليه الصلاة والسلام وما لقي من قومه من التكذيب وأنه لم يؤمن منهم إلا القليل مع طول المدة لبث فيهم ألف سنة إلا خمسين عاما فلما طال عليه ذلك واشتد عليه تكذيبهم وكلما دعاهم ازدادوا نفرة فدعا ربه أني مغلوب فانتصر فغضب الله تعالى لغضبه عليهم ولهذا قال عز وجل \"ولقد نادانا نوح فلنعم المجيبون\" أي فلنعم المجيبون له."
    },
    { "ayah": 76, "surah": 37, "text": "وهو التكذيب والأذى." },
    {
      "ayah": 77,
      "surah": 37,
      "text": "قال علي بن أبي طلحة عن ابن عباس رضي الله عنهما يقول: لم تبق إلا ذرية نوح عليه السلام وقال سعيد بن أبي عروبة عن قتادة في قوله تبارك وتعالى \"وجعلنا ذريته هم الباقين\" قال الناس كلهم من ذرية نوح عليه السلام وقد روى الترمذي وابن جرير وابن أبي حاتم من حديث سعيد بن بشير عن قتادة عن الحسن عن سمرة رضي الله عنه عن النبي صلى الله عليه وسلم في قوله تعالى \"وجعلنا ذريته هم الباقين\" قال \"سام وحام ويافث\" وقال الإمام أحمد حدثنا عبدالوهاب عن سعيد عن قتادة عن الحسن عن سمرة رضي الله عنه أن نبي الله صلى الله عليه وسلم قال \"سام أبو العرب وحام أبو الحبش ويافث أبو الروم\" ورواه الترمذي عن بشر بن معاذ العقدي عن يزيد بن زريع عن سعيد وهو ابن أبي عروبة عن قتادة به قال الحافظ أبو عمر بن عبدالبر: وقد روي عن عمران بن حصين رضي الله عنه عن النبي صلى الله عليه وسلم مثله والمراد بالروم ههنا هم الروم الأول وهم اليونان المنتسبون إلى رومي بن ليطي بن يونان بن يافث بن نوح عليه السلام ثم روي من حديث إسماعيل بن عياش عن يحيى بن سعيد عن سعيد بن المسيب قال: ولد نوح عليه السلام ثلاثة: سام ويافث وحام وولد كل واحد من هؤلاء الثلاثة ثلاثة فولد سام العرب وفارس والروم وولد يافث الترك والصقالبة ويأجوج ومأجوج وولد حام القبط والسودان والبربر وروي عن وهب بن منبه نحو هذا والله أعلم."
    },
    {
      "ayah": 78,
      "surah": 37,
      "text": "قال ابن عباس رضي الله عنهما يذكر بخير وقال مجاهد يعني لسان صدق للأنبياء كلهم وقال قتادة والسدي أبقى الله عليه الثناء الحسن في الآخرين. وقال الضحاك السلام والثناء الحسن."
    },
    {
      "ayah": 79,
      "surah": 37,
      "text": "مفسر لما أبقى عليه من الذكر الجميل والثناء الحسن أنه يسلم عليه في جميع الطوائف والأمم."
    },
    {
      "ayah": 8,
      "surah": 37,
      "text": "إذا أراد أن يسترق السمع أتاه شهاب ثاقب فأحرقه ولهذا قال جل جلاله \"لا يسمعون إلى الملإ الأعلى\" أي لئلا يصلوا إلى الملإ الأعلى وهي السموات ومن فيها من الملائكة إذا تكلموا بما يوحيه الله تعالى مما يقوله من شرعه وقدره كما تقدم بيان ذلك في الأحاديث التي أوردناها عند قوله تبارك وتعالى \"حتى إذا فزع عن قلوبهم قالوا ماذا قال ربكم قالوا الحق وهو العلي الكبير\" ولهذا قال تعالى \"ويقذفون\" أي يرمون \"من كل جانب\" أي من كل جهة يقصدون السماء منها."
    },
    {
      "ayah": 80,
      "surah": 37,
      "text": "أي هكذا نجزي من أحسن من العباد في طاعة الله تعالى نجعل له لسان صدق يذكر به بعده بحسب مرتبته في ذلك."
    },
    { "ayah": 81, "surah": 37, "text": "أي المصدقين الموحدين الموقنين." },
    {
      "ayah": 82,
      "surah": 37,
      "text": "أي أهلكناهم فلم يبق منهم عين تطرف ولا ذكر ولا عين ولا أثر ولا يعرفون إلا بهذه الصفة القبيحة."
    },
    {
      "ayah": 83,
      "surah": 37,
      "text": "قال علي بن أبي طلحة عن ابن عباس رضي الله عنهما \"وإن من شيعته لإبراهيم\" يقول من أصل دينه وقال مجاهد على منهاجه وسنته."
    },
    {
      "ayah": 84,
      "surah": 37,
      "text": "قال ابن عباس رضي الله عنهما يعني شهادة أن لا إله إلا الله. وقال ابن أبي حاتم حدثنا أبو سعيد الأشج حدثنا أبو أسامة عن عوف قلت لمحمد بن سيرين ما القلب السليم؟ قال يعلم أن الله حق وأن الساعة آتية لا ريب فيها وأن الله يبعث من في القبور وقال الحسن سليم من الشرك وقال عروة لا يكون لعانا."
    },
    {
      "ayah": 85,
      "surah": 37,
      "text": "وقوله تعالى \"إذ قال لأبيه وقومه ماذا تعبدون\" أنكر عليهم عبادة الأصنام والأنداد ولهذا قال عز وجل \"أئفكا آلهة دون الله تريدون فما ظنكم برب العالمين\" قال قتادة يعني ما ظنكم أنه فاعل بكم إذا لاقيتموه وقد عبدتم معه غيره."
    },
    {
      "ayah": 86,
      "surah": 37,
      "text": "وقوله تعالى \"إذ قال لأبيه وقومه ماذا تعبدون\" أنكر عليهم عبادة الأصنام والأنداد ولهذا قال عز وجل \"أئفكا آلهة دون الله تريدون فما ظنكم برب العالمين\" قال قتادة يعني ما ظنكم أنه فاعل بكم إذا لاقيتموه وقد عبدتم معه غيره."
    },
    {
      "ayah": 87,
      "surah": 37,
      "text": "وقوله تعالى \"إذ قال لأبيه وقومه ماذا تعبدون\" أنكر عليهم عبادة الأصنام والأنداد ولهذا قال عز وجل \"أئفكا آلهة دون الله تريدون فما ظنكم برب العالمين\" قال قتادة يعني ما ظنكم أنه فاعل بكم إذا لاقيتموه وقد عبدتم معه غيره."
    },
    {
      "ayah": 88,
      "surah": 37,
      "text": "إنما قال إبراهيم عليه الصلاة والسلام لقومه ذلك ليقيم في البلد إذا ذهبوا إلى عيدهم فإنه كان قد أزف خروجهم إلى عيد لهم فأحب أن يختلي بآلهتهم ليكسرها فقال لهم كلاما هو حق في نفس الأمر فهموا منه أنه سقيم على مقتضى ما يعتقدونه \"فتولوا عنه مدبرين\" قال قتادة والعرب تقول لمن تفكر نظر في النجوم يعني قتادة أنه نظر إلى السماء متفكرا فيما يلهيهم به فقال \"إني سقيم\" أي ضعيف فأما الحديث الذي رواه ابن جرير ههنا حدثنا أبو كريب حدثنا أبو أسامة حدثني هشام عن محمد عن أبي هريرة رضي الله عنه أن رسول الله صلى الله عليه وسلم قال \"لم يكذب إبراهيم عليه الصلاة والسلام غير ثلاث كذبات: ثنتين في ذات الله تعالى قوله \"إني سقيم\" وقوله \"بل فعله كبيرهم هذا\" وقوله في سارة هي أختي\" فهو حديث مخرج في الصحاح والسنن من طرق ولكن ليس هذا من باب الكذب الحقيقي الذي يذم فاعله حاشا وكلا ولما إنما أطلق الكذب على هذا تجوزا وإنما هو من المعاريض في الكلام لمقصد شرعي ديني كما جاء في الحديث \"إن في المعاريض لمندوحة عن الكذب\" وقال ابن أبي حاتم حدثنا أبي حدثنا ابن أبي عمر حدثنا سفيان عن علي بن زيد بن جدعان عن أبي نضرة عن أبي سعيد رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم كلمات إبراهيم عليه الصلاة والسلام الثلاث التي قال \"ما منها كلمة إلا ما حل بها عن دين الله تعالى فقال \"إني سقيم\" وقال \"بل فعله كبيرهم هذا\" وقال للملك حين أراد امرأته هي أختي\" قال سفيان في قوله \"إني سقيم\" يعني طعين وكانوا يفرون من المطعون فأراد أن يخلو بآلهتهم وكذا قال العوفي عن ابن عباس رضي الله عنهما في قوله تعالى \"فنظر نظرة في النجوم فقال إني سقيم\" فقالوا له وهو في بيت آلهتهم: أخرج فقال إني مطعون فتركوه مخافة الطاعون وقال قتادة عن سعيد بن المسيب رأى نجما طلع فقال \"إني سقيم\" كابد نبي الله عن دينه فقال \"إني سقيم\" وقال آخرون \"فقال إني سقيم\" بالنسبة إلى ما يستقبل يعني مرض الموت وقيل أراد \"إني سقيم\" أي مريض القلب من عبادتكم الأوثان من دون الله تعالى وقال الحسن البصري: خرج قوم إبراهيم إلى عيدهم فأرادوه على الخروج فاضطجع على ظهره وقال \"إني سقيم\" وجعل ينظر في السماء فلما خرجوا أقبل إلى آلهتهم فكسرها ورواه ابن أبي حاتم."
    },
    {
      "ayah": 89,
      "surah": 37,
      "text": "إنما قال إبراهيم عليه الصلاة والسلام لقومه ذلك ليقيم في البلد إذا ذهبوا إلى عيدهم فإنه كان قد أزف خروجهم إلى عيد لهم فأحب أن يختلي بآلهتهم ليكسرها فقال لهم كلاما هو حق في نفس الأمر فهموا منه أنه سقيم على مقتضى ما يعتقدونه \"فتولوا عنه مدبرين\" قال قتادة والعرب تقول لمن تفكر نظر في النجوم يعني قتادة أنه نظر إلى السماء متفكرا فيما يلهيهم به فقال \"إني سقيم\" أي ضعيف فأما الحديث الذي رواه ابن جرير ههنا حدثنا أبو كريب حدثنا أبو أسامة حدثني هشام عن محمد عن أبي هريرة رضي الله عنه أن رسول الله صلى الله عليه وسلم قال \"لم يكذب إبراهيم عليه الصلاة والسلام غير ثلاث كذبات: ثنتين في ذات الله تعالى قوله \"إني سقيم\" وقوله \"بل فعله كبيرهم هذا\" وقوله في سارة هي أختي\" فهو حديث مخرج في الصحاح والسنن من طرق ولكن ليس هذا من باب الكذب الحقيقي الذي يذم فاعله حاشا وكلا ولما إنما أطلق الكذب على هذا تجوزا وإنما هو من المعاريض في الكلام لمقصد شرعي ديني كما جاء في الحديث \"إن في المعاريض لمندوحة عن الكذب\" وقال ابن أبي حاتم حدثنا أبي حدثنا ابن أبي عمر حدثنا سفيان عن علي بن زيد بن جدعان عن أبي نضرة عن أبي سعيد رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم كلمات إبراهيم عليه الصلاة والسلام الثلاث التي قال \"ما منها كلمة إلا ما حل بها عن دين الله تعالى فقال \"إني سقيم\" وقال \"بل فعله كبيرهم هذا\" وقال للملك حين أراد امرأته هي أختي\" قال سفيان في قوله \"إني سقيم\" يعني طعين وكانوا يفرون من المطعون فأراد أن يخلو بآلهتهم وكذا قال العوفي عن ابن عباس رضي الله عنهما في قوله تعالى \"فنظر نظرة في النجوم فقال إني سقيم\" فقالوا له وهو في بيت آلهتهم: أخرج فقال إني مطعون فتركوه مخافة الطاعون وقال قتادة عن سعيد بن المسيب رأى نجما طلع فقال \"إني سقيم\" كابد نبي الله عن دينه فقال \"إني سقيم\" وقال آخرون \"فقال إني سقيم\" بالنسبة إلى ما يستقبل يعني مرض الموت وقيل أراد \"إني سقيم\" أي مريض القلب من عبادتكم الأوثان من دون الله تعالى وقال الحسن البصري: خرج قوم إبراهيم إلى عيدهم فأرادوه على الخروج فاضطجع على ظهره وقال \"إني سقيم\" وجعل ينظر في السماء فلما خرجوا أقبل إلى آلهتهم فكسرها ورواه ابن أبي حاتم."
    },
    {
      "ayah": 9,
      "surah": 37,
      "text": "\"دحورا\" أي رجما يدحرون به ويزجرون ويمنعون من الوصول إلى ذلك ويرجمون \"ولهم عذاب واصب\" أي في الدار الآخرة لهم عذاب دائم موجع مستمر كما قال جلت عظمته \"وأعتدنا لهم عذاب السعير\"."
    },
    { "ayah": 90, "surah": 37, "text": "أي ذهب إليها بعدما خرجوا في سرعة واختفاء." },
    {
      "ayah": 91,
      "surah": 37,
      "text": "\"فقال ألا تأكلون\" وذلك أنهم كانوا قد وضعوا بين أيديها طعاما قربانا لتبرك لهم فيه. قال السدي: دخل إبراهيم عليه السلام إلى بيت الآلهة فإذا هم في بهو عظيم وإذا مستقبل باب البهو صنم عظيم إلى جنبه أصغر منه بعضها إلى جنب بعض كل صنم يليه أصغر منه حتى بلغوا باب البهو وإذا هم قد جعلوا طعاما ووضعوه بين أيدي الآلهة وقالوا إذا كان حين نرجع وقد بركت الآلهة في طعامنا أكلناه. فلما نظر إبراهيم عليه الصلاة والسلام إلى ما بين أيديهم من الطعام قال \"ألا تأكلون ما لكم لا تنطقون\"."
    },
    {
      "ayah": 92,
      "surah": 37,
      "text": "\"فقال ألا تأكلون\" وذلك أنهم كانوا قد وضعوا بين أيديها طعاما قربانا لتبرك لهم فيه. قال السدي: دخل إبراهيم عليه السلام إلى بيت الآلهة فإذا هم في بهو عظيم وإذا مستقبل باب البهو صنم عظيم إلى جنبه أصغر منه بعضها إلى جنب بعض كل صنم يليه أصغر منه حتى بلغوا باب البهو وإذا هم قد جعلوا طعاما ووضعوه بين أيدي الآلهة وقالوا إذا كان حين نرجع وقد بركت الآلهة في طعامنا أكلناه. فلما نظر إبراهيم عليه الصلاة والسلام إلى ما بين أيديهم من الطعام قال \"ألا تأكلون ما لكم لا تنطقون\"."
    },
    {
      "ayah": 93,
      "surah": 37,
      "text": "وقوله تعالى \"فراغ عليهم ضربا باليمين\" قال الفراء معناه مال عليهم ضربا باليمين وقال قتادة والجوهري فأقبل عليهم ضربا باليمين وإنما ضربهم باليمين لأنها أشد وأنكى ولهذا تركهم جذاذا إلا كبيرا لهم لعلهم إليه يرجعون كما تقدم في سورة الأنبياء عليهم الصلاة والسلام تفسير ذلك."
    },
    { "ayah": 94, "surah": 37, "text": "قوله تعالى ههنا \"فأقبلوا إليه يزفون\" قال مجاهد وغير واحد أي يسرعون." },
    {
      "ayah": 95,
      "surah": 37,
      "text": "وهذه القصة ههنا مختصرة وفي سورة الأنبياء مبسوطة فإنهم لما رجعوا ما عرفوا من أول وهلة من فعل ذلك حتى كشفوا واستعلموا فعرفوا أن إبراهيم عليه الصلاة والسلام هو الذي فعل ذلك فلما جاءوا ليعاتبوه أخذ في تأنيبهم وعيبهم فقال \"أتعبدون ما تنحتون\" أي أتعبدون من دون الله من الأصنام ما أنتم تنحتونها وتجعلونها بأيديكم."
    },
    {
      "ayah": 96,
      "surah": 37,
      "text": "يحتمل أن تكون ما مصدرية فيكون تقدير الكلام خلقكم وعملكم ويحتمل أن تكون بمعنى الذي تقديره والله خلقكم والذي تعملونه وكلا القولين متلازم والأول أظهر لما رواه البخاري في كتاب أفعال العباد عن علي بن المديني عن مروان بن معاوية عن أبي مالك عن ربعي بن حراش عن حذيفة رضي الله عنه مرفوعا قال \"إن الله تعالى يصنع كل صانع وصنعته\" وقرأ بعضهم \"والله خلقكم وما تعملون\" فعند ذلك لما قامت عليهم الحجة عدلوا إلى أخذه باليد والقهر."
    },
    {
      "ayah": 97,
      "surah": 37,
      "text": "فقالوا \"ابنوا له بنيانا فألقوه في الجحيم\" وكان من أمرهم ما تقدم بيانه في سورة الأنبياء عليهم الصلاة والسلام ونجاه الله من النار وأظهره عليهم وأعلى حجته ونصرها ولهذا قال تعالى \"وأرادوا به كيدا فجعلناهم الأسفلين\"."
    },
    {
      "ayah": 98,
      "surah": 37,
      "text": "فقالوا \"ابنوا له بنيانا فألقوه في الجحيم\" وكان من أمرهم ما تقدم بيانه في سورة الأنبياء عليهم الصلاة والسلام ونجاه الله من النار وأظهره عليهم وأعلى حجته ونصرها ولهذا قال تعالى \"وأرادوا به كيدا فجعلناهم الأسفلين\"."
    },
    {
      "ayah": 99,
      "surah": 37,
      "text": "يقول تعالى مخبرا عن خليله إبراهيم عليه الصلاة والسلام إنه بعدما نصره الله تعالى على قومه وأيس من إيمانهم بعدما شاهدوا من الآيات العظيمة هاجر من بين أظهرهم وقال \"إني ذاهب إلى ربي سيهدين رب هب لي من الصالحين\" يعني أولادا مطيعين يكونون عوضا من قومه وعشيرته الذين فارقهم."
    }
  ]
}
