{
  "ayahs": [
    {
      "ayah": 1,
      "surah": 38,
      "text": "* قد اختلف المفسرون في الحروف المقطعة التي في أوائل السور فمنهم من قال هي مما استأثر الله بعلمه فردوا علمها إلى الله ولم يفسرها حكاه القرطبي في تفسيره عن أبي بكر وعمر وعثمان وعلي وابن مسعود رضي الله عنهم أجمعين وقاله عامر الشعبي وسفيان الثوري والربيع بن خيثم واختاره أبو حاتم بن حبان. ومنهم من فسرها واختلف هؤلاء في معناها فقال عبدالرحمن بن زيد بن أسلم إنما هي أسماء السور. قال العلامة أبو القاسم محمود بن عمر الزمخشري في تفسيره وعليه إطباق الأكثر ونقل عن سيبويه أنه نص عليه ويعتضد لهذا بما ورد في الصحيحين عن أبي هريرة أن رسول الله صلى الله عليه وسلم كان يقرأ في صلاة الصبح يوم الجمعة \"الم\" السجدة و \"هل أتى على الإنسان\" وقال سفيان الثوري عن ابن أبي نجيح عن مجاهد أنه قال: الم وحم والمص وص. فواتح افتتح الله بها القرآن وكذا قال غيره عن مجاهد وقال مجاهد في رواية أبي حذيفة موسى بن مسعود عن شبل عن ابن أبي نجيح عنه أنه قال الم اسم من أسماء القرآن وهكذا وقال قتادة وزيد بن أسلم ولعل هذا يرجع إلى معنى قول عبدالرحمن بن زيد بن أسلم أنه اسم من أسماء السور فإن كل سورة يطلق عليها اسم القرآن فإنه يبعد أن يكون المص اسما للقرآن كله لأن المتبادر إلى فهم سامع من يقول قرأت المص إنما ذلك عبارة عن سورة الأعراف لا لمجموع القرآن والله أعلم. وقيل هي اسم من أسماء الله تعالى فقال عنها في فواتح السور من أسماء الله تعالى وكذلك قال سالم بن عبدالله وإسماعيل بن عبدالرحمن السدي الكبير وقال شعبة عن السدي بلغني أن ابن عباس قال الم اسم من أسماء الله الأعظم. هكذا رواه ابن أبي حاتم من حديث شعبة ورواه ابن جرير عن بندار عن ابن مهدي عن شعبة قال سألت السدي عن حم وطس والم فقال قال ابن عباس هي اسم الله الأعظم وقال ابن جرير وحدثنا محمد بن المثنى حدثنا أبو النعمان حدثنا شعبة عن إسماعيل السدي عن مرة الهمذاني قال: قال عبدالله فذكر نحوه. وحُكي مثله عن علي وابن عباس وقال علي بن أبي طلحة عن ابن عباس هو قسم أقسم الله به وهو من أسماء الله تعالى وروى ابن أبي حاتم وابن جرير من حديث ابن علية عن خالد الحذاء عن عكرمة أنه قال الم قسم. وروينا أيضا من حديث شريك بن عبدالله بن عطاء بن السائب عن أبى الضحى عن ابن عباس: الم قال أنا الله أعلم وكذا قال سعيد بن جبير وقال السدي عن أبي مالك وعن أبي صالح عن ابن عباس وعن مرة الهمذاني عن ابن مسعود وعن ناس من أصحاب النبي صلى الله عليه وسلم الم قال أما الم فهي حروف استفتحت من حروف هجاء أسماء الله تعالى. قال وأبو جعفر الرازي عن الربيع بن أنس عن أبي العالية في قوله تعالى الم قال هذه الأحرف الثلاثة من التسعة والعشرين حرفا دارت فيها الألسن كلها ليس منها حرف إلا وهو مفتاح اسم من أسمائه وليس منها حرف إلا وهو من آلائه وبلألائه ليس منها حرف إلا وهو في مدة أقوام وآجالهم. قال عيسى ابن مريم عليه السلام وعجب: فقال أعجب أنهم يظنون بأسمائه ويعيشون في رزقه فكيف يكفرون به فالألف مفتاح الله واللام مفتاح اسمه لطيف والميم مفتاح اسمه مجيد فالألف آلاء الله واللام لطف الله والميم مجد الله والألف سنة واللام ثلاثون سنة والميم أربعون سنة. هذا لفظ ابن أبي حاتم ونحوه رواه ابن جرير ثم شرع يوجه كل واحد من هذه الأقوال ويوفق بينها وأنه لا منافاة بين كل واحد منها وبين الآخر وأن الجمع ممكن فهي أسماء للسور ومن أسماء الله تعالى يفتتح بها السور فكل حرف منها دل على اسم من أسمائه وصفة من صفاته كما افتتح سورا كثيرة بتحميده وتسبيحه وتعظيمه قال ولا مانع من دلالة الحرف منها على اسم من أسماء الله وعلى صفة من صفاته وعلى مدة وغير ذلك كما ذكره الربيع بن أنس عن أبي العالية لأن الكلمة الواحدة تطلق على معاني كثيرة كلفظة الأمة فإنها تطلق ويراد به الدين كقوله تعالى \"إنا وجدنا آباءنا على أمة\" وتطلق ويراد بها الرجل المطيع لله كقوله تعالى \"إن إبراهيم كان أمة قانتا لله حنيفا ولم يك من المشركين\" وتطلق ويراد بها الجماعة كقوله تعالى \"وجد عليه أمة من الناس يسقون\" وقوله تعالى \"ولقد بعثنا في كل أمة رسولا\" وتطلق ويراد بها الحين من الدهر كقوله تعالى \"وقال الذي نجا منهما وادكر بعد أمة\" أي بعد حين على أصح القولين قال فكذلك هذا. هذا حاصل كلامه موجها ولكن هذا ليس كما ذكره أبو العالية فإن أبا العالية زعم أن الحرف دل على هذا وعلى هذا وعلى هذا معا ولفظة الأمة وما أشبهها من الألفاظ المشتركة في الاصطلاح إنما دل في القرآن في كل موطن على معنى واحد دل عليه سياق الكلام فأما حمله على مجموع محامله إذا أمكن فمسألة مختلف فيها بين علماء الأصول ليس هذا موضع البحث فيها والله أعلم. ثم إن لفظة الأمة تدل على كل من معانيها في سياق الكلام بدلالة الوضع فأما دلالة الحرف الواحد على اسم يمكن أن يدل على اسم آخر من غير أن يكون أحدهما أولى من الآخر في التقدير أو الإضمار بوضع ولا بغيره فهذا مما لا يفهم إلا بتوقيف والمسألة مختلف فيها وليس فيها إجماع حتى يحكم به وما أنشدوه من الشواهد على صحة إطلاق الحرف الواحد على بقية الكلمة فإن في السياق ما يدل على ما حذف بخلاف هذا كما قال الشاعر: قلنا قفي لنا فقالت قاف لا تحسبي أنا نسينا الإيجاف تعني وقفت. وقال الآخر: ما للظليم عال كيف لا يـ ينقد عنه جلده إذا يـ فقال ابن جرير كأنه أراد أن يقول إذا يفعل كذا وكذا فاكتفى بالياء من يفعل وقال الآخر: بالخير خيرات وان شرا فـ ولا أريد الشر إلا أن تـ يقول وإن شرا فشرا ولا أريد الشر إلا أن تشاء فاكتفى بالفاء والتاء من الكلمتين عن بقيتهما ولكن هذا ظاهر من سياق الكلام والله أعلم. قال القرطبي وفي الحديث \"من أعان على قتل مسلم بشطر كلمة\" الحديث قال سفيان هو أن يقول في اقتل\"ا قـ\" وقال خصيف عن مجاهد أنه قال فواتح السور كلها\"ق وص وحم وطسم والر\" وغير ذلك هجاء موضوع وقال بعض أهل العربية هي حروف من حروف المعجم استغنى بذكر ما ذكر منها في أوائل السور عن ذكر بواقيها التي هي تتمة الثمانية والعشرين حرفا كما يقول القائل ابني يكتب في - ا ب ت ث - أي في حروف المعجم الثمانية والعشرين فيستغني بذكر بعضها عن مجموعها حكاه ابن جرير. قلت مجموع الحروف المذكورة في أوائل السور بحذف المكرر منها أربعة عشر حرفا وهي - ال م ص ر ك ه ي ع ط س ح ق ن- يجمعها قولك: نص حكيم قاطع له سر. وهي نصف الحروف عددا والمذكور منها أشرف من المتروك وبيان ذلك من صناعة التصريف. قال الزمخشري وهذه الحروف الأربعة عشر مشتملة على أصناف أجناس الحروف يعني من المهموسة والمجهورة ومن الرخوة والشديدة ومن المطبقة والمفتوحة ومن المستعلية والمنخفضة ومن حروف القلقلة. وقد سردها مفصلة ثم قال: فسبحان الذي دقت في كل شيء حكمته. وهذه الأجناس المعدودة مكثورة بالمذكورة منها وقد علمت أن معظم الشيء وجله ينزل منزلة كله وههنا ههنا لخص بعضهم في هذا المقام كلاما فقال: لا شك أن هذه الحروف لم ينزلها سبحانه وتعالى عبثا ولا سدى ومن قال من الجهلة إن في القرآن ما هو تعبد لا معنى له بالكلمة فقد أخطأ خطأ كبيرا فتعين أن لها معنى في نفس الأمر فإن صح لنا فيها عن المعصوم شيء قلنا به وإلا وقفنا حيث وقفنا وقلنا \"آمنا به كل من عند ربنا\" ولم يجمع العلماء فيها على شيء معين وإنما اختلفوا فمن ظهر له بعض الأقوال بدليل فعليه اتباعه وإلا فالوقف حتى يتبين هذا المقام. المقام الآخر في الحكمة التي اقتضت إيراد هذه الحروف في أوائل السور ما هي مع قطع النظر عن معانيها في أنفسها فقال بعضهم إنما ذكرت ليعرف بها أوائل السور حكاه ابن جرير وهذا ضعيف لأن الفصل حاصل بدونها فيما لم تذكر فيه وفيما ذكرت فيه البسملة تلاوة وكتابة وقال آخرون بل ابتدئ بها لتفتح لاستماعها أسماع المشركين إذ تواصوا بالإعراض عن القرآن حتى إذا استمعوا له تلا عليهم المؤلف منه حكاه ابن جرير أيضا وهو ضعيف أيضا لأنه لو كان كذلك لكان ذلك في جميع السور لا يكون في بعضها بل غالبها ليس كذلك ولو كـان كذلك أيضا لانبغى الابتداء بها في أوائل الكلام معهم سواء كان افتتاح سورة أو غير ذلك ثم إن هذه السورة والتي تليها أعني البقرة وآل عمران مدنيتان ليستا خطابا للمشركين فانتقض ما ذكروه بهذه الوجوه. وقال آخرون بل إنما ذكرت هذه الحروف في أوائل السور التي ذكرت فيها بيانا لإعجاز القرآن وأن الخلق عاجزون عن معارضته بمثله هذا مع أنه مركب من هذه الحروف المقطعة التي يتخاطبون بها وقد حكى هذا المذهب الرازي في تفسيره عن المبرد وجمع من المحققين وحكى القرطبي عن الفراء وقطرب نحو هذا وقرره الزمخشري فى كشافه ونصره أتم نصر وإليه ذهب الشيخ الإمام العلامة أبو العباس ابن تيمية وشيخنا الحافظ المجتهد أبو الحجاج المزي وحكاه لي عن ابن تيمية. قال الزمخشري ولم ترد كلها مجموعة في أول القرآن وإنما كررت ليكون أبلغ في التحدي والتبكيت كما كررت قصص كثيرة وكرر التحدي بالصريح في أماكن قال وجاء منها على حرف واحد كقوله - ص ن ق- وحرفين مثل \"حم\" وثلاثة مثل \"الم\" وأربعة مثل \"المر\" و \"المص\" وخمسة مثل \"كهيعص- و- حم عسق\" لأن أساليب كلامهم على هذا من الكلمات ما هو على حرف وعلى حرفين وعلى ثلاثة وعلى أربعة وعلى خمسة لا أكثر من ذلك \"قلت\" ولهذا كل سورة افتتحت بالحروف فلا بد أن يذكر فيها الانتصار للقرآن وبيان إعجازه وعظمته وهذا معلوم بالاستقراء وهو الواقع في تسع وعشرين سورة ولهذا يقول تعالى \"الم ذلك الكتاب لا ريب فيه\" \"الم الله لا إله إلا هو الحي القيوم نزل عليك الكتاب بالحق مصدقا لما بين يديه\" \"المص كتاب أنزل إليك فلا يكن في صدرك حرج منه\" \"الر كتاب أنزلناه إليك لتخرج الناس من الظلمات إلى النور بإذن ربهم\" \"الم تنزيل الكتاب لا ريب فيه من رب العالمين\" \"حم تنزيل من الرحمن الرحيم\" \"حم عسق كذلك يوحي إليك وإلى الذين من قبلك الله العزيز الحكيم\" وغير ذلك من الآيات الدالة على صحة ما ذهب إليه هؤلاء لمن أمعن النظر والله أعلم. وأما من زعم أنها دالة على معرفة المدد وأنه يستخرج من ذلك أوقات الحوادث والفتن والملاحم فقد ادعى ما ليس له وطار في غير مطاره وقد ورد في ذلك حديث ضعيف وهو مع ذلك أدل على بطلان هذا المسلك من التمسك به على صحته وهو ما رواه محمد بن إسحق بن يسار صاحب المغازي حدثني الكلبي عن أبي صالح عن ابن عباس عن جابر بن عبدالله بن رباب قال مر أبو ياسر بن أخطب في رجال من يهود برسول الله صلى الله عليه وسلم وهو يتلو فاتحة سورة البقرة \"الم ذلك الكتاب لا ريب فيه\" فأتى أخاه بن أخطب في رجال من اليهود فقال تعلمون والله لقد سمعت محمدا يتلو فيما أنزل الله تعالى عليه \"الم ذلك الكتاب لا ريب فيه\" فقال أنت سمعته قال نعم قال فمشى حي بن أخطب في أولئك النفر من اليهود إلى رسول الله صلى الله عليه وسلم فقالوا يا محمد ألم يذكر أنك تتلوا فيما أنزل الله عليك \"الم ذلك الكتاب\"؟ فقال رسول الله صلى الله عليه وسلم \"بلى\" فقالوا جاءك بهذا جبريل من عند الله؟ فقال \"نعم\" قالوا لقد بعث الله قبلك أنبياء ما نعلمه بين لنبي منهم ما مدة ملكه وما أجل أمته غيرك. فقام حي بن أخطب وأقبل على من كان معه فقال لهم الألف واحدة واللام ثلاثون والميم أربعون فهذه إحدى وسبعون سنة أفتدخلون في دين نبي إنما مدة ملكه وأجل أمته إحدى وسبعون سنة؟ ثم أقبل على رسول الله صلى الله عليه وسلم فقال يا محمد هل مع هذا غيره فقال \"نعم\" قال ما ذاك؟ قال \"المص\" قال هذا أثقل وأطول الألف واحد واللام ثلاثون والميم أربعون والصاد تسعون فهذه إحدى وثلاثون ومائة سنة. هل مع هذا يا محمد غيره؟ قال \"نعم\" قال ما ذاك؟ قال \"الر\" قال هذا أثقل وأطول الألف واحدة واللام ثلاثون والراء مائتان فهذه إحدى وثلاثون ومائتا سنة. فهل مع هذا يا محمد غيره؟ قال \"نعم\" قال ماذا قال \"المر\" قال هذه أثقل وأطول الألف واحدة واللام ثلاثون والميم أربعون والراء مائتان فهذه إحدى وسبعون ومائتان ثم قال: لقد لبس علينا أمرك يا محمد حتى ما ندري أقليلا أعطيت أم كثيرا. ثم قال قوموا عنه ثم قال أبو ياسر لأخيه حي بن أخطب ولمن معه من الأحبار ما يدريكم لعله قد جمع هذا لمحمد كله إحدى وسبعون وإحدى وثلاثون ومائة وإحدى وثلاثون ومائتان وإحدى وسبعون ومائتان فذلك سبعمائة وأربع سنين؟ فقالوا لقد تشابه علينا أمره فيزعمون أن هؤلاء الآيات نزلت فيهم \"هو الذي أنزل عليك الكتاب منه آيات محكمات هن أم الكتاب وأخر متشابهات\" فهذا الحديث مداره على محمد بن السائب الكلبي وهو ممن لا يحتج بما انفرد به ثم كان مقتضى هذا المسلك إن كان صحيحا أن يحسب ما لكل حرف من الحروف الأربعة عشر التي ذكرناها وذلك يبلغ منه جملة كثيرة وإن حسبت مع التكرر فأطم وأعظم والله أعلم. وقوله تعالى \"والقرآن ذي الذكر\" أي والقرآن المشتمل على ما فيه ذكر للعباد ونفع لهم في المعاش والمعاد قال الضحاك في قوله تعالى \" ذي الذكر\" كقوله تعالى \" لقد أنزلنا إليكم كتابا فيه ذكركم\" أي تذكيركم وكذا قال قتادة وأختاره ابن جرير. وقال ابن عباس رضي الله عنهما وسعيد بن جبير وإسماعيل بن أبي خالد وابن عيينة وأبو حصين وأبو صالح والسدي \"ذي الذكر\" ذي الشرف أي ذي الشأن والمكانة ولا منافاة بين القولين فإنه كتاب شريف مشتمل على التذكير والإعذار والإنذار واختلفوا في جواب هذا القسم فقال بعضهم هو قوله تعالى \"إن كل إلا كذب الرسل فحق عقاب \" وقيل قوله تعالى \"إن ذلك لحق تخاصم أهل النار \" حكاهما ابن جرير وهذا الثاني فيه بعد كبير وضعفه ابن جرير وقال قتادة جوابه \"بل الذين كفروا في عزة وشقاق \" واختاره ابن جرير ثم حكى ابن جرير عن بعض أهل العربية أنه قال جوابه \"ص\" بمعنى صدق حق \"والقرآن ذي الذكر \" وقيل جوابه ما تضمنه سياق السورة بكمالها والله أعلم."
    },
    {
      "ayah": 10,
      "surah": 38,
      "text": "وقوله تعالى \"أم لهم ملك السموات والأرض وما بينهما فليرتقوا في الأسباب\" أي إن كان لهم ذلك فليصعدوا في الأسباب قال ابن عباس رضي الله عنهما ومجاهد وسعيد بن جبير وقتادة وغيرهم يعني طرق السماء وقال الضحاك رحمه الله تعالى فليصعدوا إلى السماء السابعة."
    },
    {
      "ayah": 11,
      "surah": 38,
      "text": "قال عز وجل \"جند ما هنالك مهزوم من الأحزاب\" أي هؤلاء الجند المكذبون الذين هم فى عزة وشقاق سيهزمون ويغلبون ومكبتون كما كبت الذين من قبلهم من الأحزاب المكذبين وهذه الآية كقوله جلت عظمته \"أم يقولون نحن جميع منتصر سيهزم الجمع ويولون الدبر\" وكان ذلك يوم بدر \"بل الساعة موعدهم والساعة أدهى وأمر\"."
    },
    {
      "ayah": 12,
      "surah": 38,
      "text": "يقول تعالى مخبرا عن هؤلاء القرون الماضية وما حل بهم من العذاب والنكال والنقمات في مخالفة الرسل وتكذيب الأنبياء عليهم الصلاة والسلام وقد تقدمت قصصهم مبسوطة في أماكن متعددة وقوله تعالى \"أولئك الأحزاب\" أي كانوا أكثر منكم وأشد قوة وأكثر أموالا وأولادا فما دافع ذلك عنهم من عذاب الله من شيء لما جاء أمر ربك ولهذا قال عز وجل \"إن كل إلا كذب الرسل فحق عقاب\" فجعل علة إهلاكهم هو تكذيبهم بالرسل فليحذر المخاطبون من ذلك أشد الحذر."
    },
    {
      "ayah": 13,
      "surah": 38,
      "text": "يقول تعالى مخبرا عن هؤلاء القرون الماضية وما حل بهم من العذاب والنكال والنقمات في مخالفة الرسل وتكذيب الأنبياء عليهم الصلاة والسلام وقد تقدمت قصصهم مبسوطة في أماكن متعددة وقوله تعالى \"أولئك الأحزاب\" أي كانوا أكثر منكم وأشد قوة وأكثر أموالا وأولادا فما دافع ذلك عنهم من عذاب الله من شيء لما جاء أمر ربك ولهذا قال عز وجل \"إن كل إلا كذب الرسل فحق عقاب\" فجعل علة إهلاكهم هو تكذيبهم بالرسل فليحذر المخاطبون من ذلك أشد الحذر."
    },
    {
      "ayah": 14,
      "surah": 38,
      "text": "يقول تعالى مخبرا عن هؤلاء القرون الماضية وما حل بهم من العذاب والنكال والنقمات في مخالفة الرسل وتكذيب الأنبياء عليهم الصلاة والسلام وقد تقدمت قصصهم مبسوطة في أماكن متعددة وقوله تعالى \"أولئك الأحزاب\" أي كانوا أكثر منكم وأشد قوة وأكثر أموالا وأولادا فما دافع ذلك عنهم من عذاب الله من شيء لما جاء أمر ربك ولهذا قال عز وجل \"إن كل إلا كذب الرسل فحق عقاب\" فجعل علة إهلاكهم هو تكذيبهم بالرسل فليحذر المخاطبون من ذلك أشد الحذر."
    },
    {
      "ayah": 15,
      "surah": 38,
      "text": "وقوله تعالى \"وما ينظر هؤلاء إلا صيحة واحدة ما لها من فواق\" قال مالك عن زيد بن أسلم أي ليس لها مثنوية أي ما ينظرون إلا الساعة أن تأتيهم بغتة فقد جاء أشراطها أي فقد اقتربت ودنت وأزفت وهذه الصيحة هي نفخة الفزع التي يأمر الله تعالى إسرائيل أن يطولها فلا يبقى أحد من أهل السموات والأرض إلا فزع إلا من استثنى الله عز وجل."
    },
    {
      "ayah": 16,
      "surah": 38,
      "text": "وقوله جل جلاله \"وقالوا ربنا عجل لنا قطنا قبل يوم الحساب\" هذا إنكار من الله تعالى على المشركين في دعائهم على أنفسهم بتعجيل العذاب فإن القط هو الكتاب وقيل هو الحظ والنصيب قال ابن عباس رضي الله عنهما ومجاهد والضحاك والحسن وغير واحد سألوا تعجيل العذاب زاد قتادة كما قالوا \"اللهم إن كان هذا هو الحق من عندك فأمطر علينا حجارة من السماء أو ائتنا بعذاب أليم\" وقيل سألوا تعجيل نصيبهم من الجنة إن كانت موجودة ليلقوا ذاك في الدنيا وإنما خرج هذا منهم مخرج الاستبعاد والتكذيب."
    },
    {
      "ayah": 17,
      "surah": 38,
      "text": "وقوله جل جلاله \"وقالوا ربنا عجل لنا قطنا قبل يوم الحساب\" هذا إنكار من الله تعالى على المشركين في دعائهم على أنفسهم بتعجيل العذاب فإن القط هو الكتاب وقيل هو الحظ والنصيب قال ابن عباس رضي الله عنهما ومجاهد والضحاك والحسن وغير واحد سألوا تعجيل العذاب زاد قتادة كما قالوا \"اللهم إن كان هذا هو الحق من عندك فأمطر علينا حجارة من السماء أو ائتنا بعذاب أليم\" وقيل سألوا تعجيل نصيبهم من الجنة إن كانت موجودة ليلقوا ذاك في الدنيا وإنما خرج هذا منهم مخرج الاستبعاد والتكذيب.وقال ابن جرير سألوا تعجيل ما يستحقونه من الخير أو الشر في الدنيا وهذا الذي قاله جيد وعليه يدور كلام الضحاك وإسماعيل بن أبي خالد والله أعلم ولما كان هذا الكلام منهم على وجه الاستهزاء والاستبعاد قال الله تعالى لرسوله صلى الله عليه وسلم آمرا له بالصبر على أذاهم ومبشرا له على صبره بالعاقبة والنصر والظفر.يذكر تعالى عن عبده ورسوله داود عليه الصلاة والسلام أنه كان ذا أيد والأيد القوة في العلم والعمل قال ابن عباس رضي الله عنهما والسدى وابن زيد الأيد: القوة وقرأ ابن زيد \"والسماء بنيناها بأيد وإنا لموسعون\" وقال مجاهد الأيد القوة في الطاعة وقال قتادة أعطي داود عليه الصلاة والسلام قوة في العبادة وفقها في الإسلام وقد ذكر لنا أنه عليه الصلاة والسلام كان يقوم ثلث الليل ويصوم نصف الدهر وهذا ثابت في الصحيحين عن رسول الله صلى الله عليه وسلم أنه قال \"أحب الصلاة إلى الله تعالى صلاة داود وأحب الصيام إلى الله عز وجل صيام داود كان ينام نصف الليل ويقوم ثلثه وينام سدسه وكان يصوم يوما ويفطر يوما ولا يفر إذا لاقى وإنه كان أوابا \"وهو إلى الله عز وجل في جميع أموره وشؤونه."
    },
    {
      "ayah": 18,
      "surah": 38,
      "text": "وقوله تعالى \"إنا سخرك الجبال معه يسبحن بالعشي والإشراق\" أي أنه تعالى سخر الجبال تسبح معه عند إشراق الشمس وآخر النهار كما قال عز وجل \"يا جبال أوبي معه والطير\" وكذلك كانت الطير تسبح بتسبيحه وترجع بترجيعه إذا مر به الطير وهو سابح في الهواء فسمعه وهو يترنم بقراءة الزبور لا يستطيع الذهاب بل يقف في الهواء ويسبح معه وتجيبه الجبال الشامخات ترجع معه وتسبح تبعا له قال ابن جرير حدثنا أبو كريب حدثنا محمد بن بشر عن مسعر عن عبد الكريم عن موسى بن أبي كثير عن ابن عباس رضي الله عنهما أنه بلغه أن أم هانئ رضي الله عنها ذكرت أن رسول الله صلى الله عليه وسلم يوم فتح مكة صلى الضحى ثمان ركعات فقال ابن عباس رضي الله عنهما قد ظننت أن لهذه الساعة صلاة يقول الله عز وجل \"يسبحن بالعشي والإشراق\" ثم رواه من حديث سعيد بن أبي عروبة عن أبي المتوكل عن أيوب بن صفوان عن مولاه عبد الله بن الحارث بن نوفل أن ابن عباس رضي الله عنهما كان لا يصلي الضحى قال فأدخلته على أم هانئ رضي الله عنها فقلت أخبري هذا ما أخرتني فقالت: دخل علي رسول الله صلى الله عليه وسلم يوم الفتح في بيتي ثم أمر بماء صب في قصعة ثم أمر بثوب فأخذ بيني وبينه فاغتسل ثم رش ناحية البيت فصلى ثمان ركعات وذلك من الضحى قيامهن وركوعهن وسجودهن وجلوسهن سواء قريب بعضهم من بعض فخرج ابن عباس رضي الله عنهما وهو يقول لقد قرأت ما بين اللوحين ما عرفت صلاة الضحى إلا الآن \"يسبحن بالعشي والإشراق\" وكنت أقول أين صلاة الإشراق وكان بعد يقول صلاة الإشراق ولهذا قال عز وجل \"والطير محشورة\" أي محبوسة في الهواء \"كل له أواب\" أي مطيع يسبح تبعا له قال سعيد بن جبير وقتادة ومالك عن زيد بن أسلم وابن زيد \"كل له أواب\" أي مطيع."
    },
    {
      "ayah": 19,
      "surah": 38,
      "text": "وقوله تعالى \"إنا سخرك الجبال معه يسبحن بالعشي والإشراق\" أي أنه تعالى سخر الجبال تسبح معه عند إشراق الشمس وآخر النهار كما قال عز وجل \"يا جبال أوبي معه والطير\" وكذلك كانت الطير تسبح بتسبيحه وترجع بترجيعه إذا مر به الطير وهو سابح في الهواء فسمعه وهو يترنم بقراءة الزبور لا يستطيع الذهاب بل يقف في الهواء ويسبح معه وتجيبه الجبال الشامخات ترجع معه وتسبح تبعا له قال ابن جرير حدثنا أبو كريب حدثنا محمد بن بشر عن مسعر عن عبد الكريم عن موسى بن أبي كثير عن ابن عباس رضي الله عنهما أنه بلغه أن أم هانئ رضي الله عنها ذكرت أن رسول الله صلى الله عليه وسلم يوم فتح مكة صلى الضحى ثمان ركعات فقال ابن عباس رضي الله عنهما قد ظننت أن لهذه الساعة صلاة يقول الله عز وجل \"يسبحن بالعشي والإشراق\" ثم رواه من حديث سعيد بن أبي عروبة عن أبي المتوكل عن أيوب بن صفوان عن مولاه عبد الله بن الحارث بن نوفل أن ابن عباس رضي الله عنهما كان لا يصلي الضحى قال فأدخلته على أم هانئ رضي الله عنها فقلت أخبري هذا ما أخرتني فقالت: دخل علي رسول الله صلى الله عليه وسلم يوم الفتح في بيتي ثم أمر بماء صب في قصعة ثم أمر بثوب فأخذ بيني وبينه فاغتسل ثم رش ناحية البيت فصلى ثمان ركعات وذلك من الضحى قيامهن وركوعهن وسجودهن وجلوسهن سواء قريب بعضهم من بعض فخرج ابن عباس رضي الله عنهما وهو يقول لقد قرأت ما بين اللوحين ما عرفت صلاة الضحى إلا الآن \"يسبحن بالعشي والإشراق\" وكنت أقول أين صلاة الإشراق وكان بعد يقول صلاة الإشراق ولهذا قال عز وجل \"والطير محشورة\" أي محبوسة في الهواء \"كل له أواب\" أي مطيع يسبح تبعا له قال سعيد بن جبير وقتادة ومالك عن زيد بن أسلم وابن زيد \"كل له أواب\" أي مطيع."
    },
    {
      "ayah": 2,
      "surah": 38,
      "text": "وقوله تبارك وتعالى \"بل الذين كفروا في عزة وشقاق\" أي إن في هذا القرآن لذكرى لمن يتذكر وعبرة لمن يعتبر وإنما لم ينتفع به الكافرون لأنهم \"في عزة\" أي استكبار عنه وحمية \"وشقاق\" أي ومخالفة له ومعاندة ومفارقة ثم خوفهم ما أهلك به الأمم المكذبة قبلهم بسبب مخالفتهم للرسل وتكذيبهم الكتب المنزلة من السماء."
    },
    {
      "ayah": 20,
      "surah": 38,
      "text": "وقوله تعالى \"وشددنا ملكه\" أن جعلنا له ملكا كاملا من جميع ما يحتاج إليه الملوك قال ابن أبي نجيح عن مجاهد كان أشد أهل الدنيا سلطانا وقال السدي كان يحرسه كل يوم أربعة آلاف وقال بعض السلف بلغني أنه كان يحرسه في كل ليلة ثلاثة وثلاثون ألفا لا تدور عليهم النوبة إلى مثلها من العام القابل وقال غيره أربعون ألفا مشتملون بالسلاح وقد ذكر ابن جرير وابن أبي حاتم من رواية علباء بن أحمر عن عكرمة عن ابن عباس رضي الله عنهما أن نفرين من بني إسرائيل استعدى أحدهما على الآخر إلى داود عليه الصلاة والسلام أنه اغتصبه بقرا فأنكر الآخر ولم يكن للمدعي بينة فأرجأ أمرهما فلما كان الليل أمر داود عليه الصلاة والسلام في المنام بقتل المدعي فلما كان النهار طلبهما وأمر بقتل المدعي فقال يا نبي الله علام تقتلني وقد اغتصبني هذا بقري ؟ فقال له إن الله تعالى أمرني بقتلك فأنا قاتلك لا محالة فقال والله يا نبي الله إن الله لم يأمرك بقتلي لأجل هذا الذي ادعيت عليه وإنى لصادق فيما ادعيت ولكني كنت قد اغتلت أباه وقتلته ولم يشعر بذلك أحد فأمر به داود عليه السلام فقتل قال ابن عباس عليه السلام فاشتدت هيبته في بني إسرائيل وهو الذي يقول الله عز وجل \"وشددنا ملكه\" وقوله جل وعلا \"وأتيناه الحكمة\" قال مجاهد يعني الفهم والعقل والفطنة وقال مرة: الحكمة والعدل وقال مرة: الصواب وقال قتادة كتاب الله واتباع ما فيه وقال السدي \"الحكمة\" النبوة وقوله جل جلاله \"وفصل الخطاب\" قال شريح القاضي والشعبي فصل الخطاب الشهود والأيمان وقال قتادة شاهدان على المدعي أو يمين المدعى عليه هو فصل الخطاب الذي فصل به الأنبياء والرسل أو قال المؤمنون والصالحون وهو قضاء هذه الأمة إلى يوم القيامة وكذا قال أبو عبد الرحمن السلمي و قال مجاهد والسدي هو إصابة القضاء وفهم ذلك وقال مجاهد أيضا هو الفصل في الكلام وفي الحكم وهذا يشمل هذا كله وهو المراد واختاره ابن جرير وقال ابن أبي حاتم حدثنا عمر بن شبة النميري حدثنا إبراهيم بن المنذر حدثني عبد العزيز بن أبي ثابت عن عبد الرحمن بن أبي الزناد عن أبيه عن بلال بن أبي بردة عن أبيه عن أبي موسى رضي الله عنه قال: أول من قال أما بعد داود عليه السلام وهو فصل الخطاب وكذا قال الشعبي فصل الخطاب أما بعد."
    },
    {
      "ayah": 21,
      "surah": 38,
      "text": "قد ذكر المفسرون ههنا قصة أكثرها مأخوذ من الإسرائيليات ولم يثبت فيها عن المعصوم حديث يجب اتباعه ولكن روى ابن أبي حاتم هنا حديثا لا يصح سنده لأنه من رواية يزيد الرقاشي عن أنس رضي الله عنه ويزيد وإن كان من الصالحين لكنه ضعيف الحديث عند الأئمة فالأولى أن يقتصر على مجرد تلاوة هذه القصة وأن يرد علمها إلى الله عز وجل فإن القرآن حق وما تضمن فهو حق أيضا وقوله تعالى \"ففزع منهم\" إنما كان ذلك لأنه كان في محرابه وهو أشرف مكان في داره وكان قد أمر أن لا يدخل عليه أحد ذلك اليوم فلم يشعر إلا بشخصين قد تسورا عليه المحراب أي احتاطا به يسألانه عن شأنهما وقوله عز وجل \"وعزني في الخطاب\" أي غلبني يقال عز يعز إذا قهر وغلب وقوله تعالى \"وظن داود إنما فتناه\" قال علي بن أبي طلحة عن ابن عباس رضي الله عنهما أي اختبرناه وقوله تعالى \"وخر راكعا\" أي ساجدا \"وأناب\" ويحتمل أنه ركع أولا ثم سجد بعد ذلك وقد ذكر أنه استمر ساجدا \"أربعين صباحا\" فغفرنا له ذلك أي ما كان منه مما يقال فيه إن حسنات الأبرار سيئات المقربين وقد اختلف الأئمة في سجدة ص هل هي من عزائم السجود ؟ على قولين الجديد من مذهب الشافعي رضي الله عنه أنها ليست من عزائم السجود بل هي سجدة شكر والدليل على ذلك ما رواه الإمام أحمد حيث قال حدثنا إسماعيل هو ابن علية عن أيوب عن عكرمة عن ابن عباس رضي الله عنهما أنه قال في السجدة في ص ليست من عزائم السجود وقد رأيت رسول الله صلى الله عليه وسلم يسجد فيها ورواه البخاري وأبو داود والترمذي والنسائي في تفسيره من حديث أيوب به وقال الترمذي حسن صحيح وقال النسائي أيضا عند تفسير هذه الآية أخبرني إبراهيم بن الحسن هو المقسمي حدثنا حجاج بن محمد عن عمر بن ذر عن أبيه عن سعيد بن جبير عن ابن عباس رضي الله عنهما قال: إن النبي صلى الله عليه وسلم سجد في ص وقال \" سجدها داود عليه الصلاة والسلام توبة ونسجدها شكرا\" تفرد بروايته النسائي ورجال إسناده كلهم ثقات وقد أخبرني شيخنا الحافظ أبو الحجاج المزي قراءة عليه وأنا أسمع أخبرنا أبو إسحاق المدرجي أخبرنا زاهر بن أبي طاهر الثقفي حدثنا زاهر بن أبي طاهر الشحامي أخبرنا أبو سعيد الكنجدروذي أخبرنا الحاكم أبو أحمد محمد بن محمد الحافظ أخبرنا أبو العباس السراج حدثنا هارون بن عبد الله حدثنا محمد بن يزيد ابن خنيس عن الحسن بن محمد بن عبيد الله بن أبي يزيد قال: قال لي ابن جريج يا حسن حدثني جدك عبيد الله بن أبي يزيد عن ابن عباس رضي الله عنهما فقال جاء رجل إلى النبي صلى الله عليه وسلم فقال يا رسول الله إنى رأيت فيما يرى النائم كأنى أصلي خلف شجرة فقرأت السجدة فسجدت فسجدت الشجرة بسجودي فسمعتها تقول وهي ساجدة: اللهم اكتب لي بها عندك أجرا وأجعلها لي عندك دخرا وضع بها عني وزرا وأقبلها مني كما فبلتها من عبدك داود قال ابن عباس رضي الله عنهما فرأيت النبي صلى الله عليه وسلم قام فقرأ السجدة ثم سجد فسمعته يقول وهو ساجد كما حكى الرجل من كلام الشجرة رواه الترمذي عن قتيبة وابن ماجة عن أبي بكر بن خلاد كلاهما عن محمد بن يزيد بن خنيس نحوه وقال الترمذي غريب لا نعرفه إلا من هذا الوجه وقال البخاري عند تفسيرها أيضا حدثنا محمد بن عبد الله حدثنا محمد بن عبيد الطنافسي عن العوام قال سألت مجاهدا عن سجدة ص فقال: سألت ابن عباس رضي الله عنهما من أين سجدت فقال أو ما تقرأ \"ومن ذريته داود وسليمان\" \"أولئك الذين هدى الله فبهداهم اقتده\" فكان داود عليه الصلاة والسلام ممن أمر نبيكم صلى الله عليه وسلم أن يقتدي به فسجدها داود عليه الصلاة والسلام فسجدها رسول الله صلى الله عليه وسلم وقال الإمام أحمد حدثنا عفان حدثنا يزيد بن زريع حدثنا حميد حدثنا بكر هو ابن عبد الله المزني أنه أخبره أن أبا سعيد الخدري رضي الله عنه رأى رؤيا أنه يكتب ص فلما بلغ إلى الآية التي يسجد بها رأى الدواة والقلم وكل شيء بحضرته انقلب ساجدا قال قفصها على النبي صلى الله عليه وسلم فلم يزل يسجد بها بعد تفرد به أحمد وقال أبو داود حدثنا أحمد بن صالح حدثنا ابن وهب أخبرني عمرو بن الحارث عن سعيد بن أبي هلال عن عياض بن عبد الله بن سعد بن أبي سرح عن أبي سعيد الخدري رضي الله عنه قال: قرأ رسول الله صلى الله عليه وسلم وهو على المنبر \"ص\" فلما بلغ السجدة نزل فسجد وسجد الناس معه فلما كان يوم آخر قرأها فلما بلغ السجدة تشزن الناس للسجود فقال صلى الله عليه وسلم \"إنما هي توبة نبي ولكني رأيتكم تشزنتم \"فنزل وسجد تفرد به أبو داود وإسناده عل شرط الصحيح."
    },
    {
      "ayah": 22,
      "surah": 38,
      "text": "قد ذكر المفسرون ههنا قصة أكثرها مأخوذ من الإسرائيليات ولم يثبت فيها عن المعصوم حديث يجب اتباعه ولكن روى ابن أبي حاتم هنا حديثا لا يصح سنده لأنه من رواية يزيد الرقاشي عن أنس رضي الله عنه ويزيد وإن كان من الصالحين لكنه ضعيف الحديث عند الأئمة فالأولى أن يقتصر على مجرد تلاوة هذه القصة وأن يرد علمها إلى الله عز وجل فإن القرآن حق وما تضمن فهو حق أيضا وقوله تعالى \"ففزع منهم\" إنما كان ذلك لأنه كان في محرابه وهو أشرف مكان في داره وكان قد أمر أن لا يدخل عليه أحد ذلك اليوم فلم يشعر إلا بشخصين قد تسورا عليه المحراب أي احتاطا به يسألانه عن شأنهما وقوله عز وجل \"وعزني في الخطاب\" أي غلبني يقال عز يعز إذا قهر وغلب وقوله تعالى \"وظن داود إنما فتناه\" قال علي بن أبي طلحة عن ابن عباس رضي الله عنهما أي اختبرناه وقوله تعالى \"وخر راكعا\" أي ساجدا \"وأناب\" ويحتمل أنه ركع أولا ثم سجد بعد ذلك وقد ذكر أنه استمر ساجدا \"أربعين صباحا\" فغفرنا له ذلك أي ما كان منه مما يقال فيه إن حسنات الأبرار سيئات المقربين وقد اختلف الأئمة في سجدة ص هل هي من عزائم السجود ؟ على قولين الجديد من مذهب الشافعي رضي الله عنه أنها ليست من عزائم السجود بل هي سجدة شكر والدليل على ذلك ما رواه الإمام أحمد حيث قال حدثنا إسماعيل هو ابن علية عن أيوب عن عكرمة عن ابن عباس رضي الله عنهما أنه قال في السجدة في ص ليست من عزائم السجود وقد رأيت رسول الله صلى الله عليه وسلم يسجد فيها ورواه البخاري وأبو داود والترمذي والنسائي في تفسيره من حديث أيوب به وقال الترمذي حسن صحيح وقال النسائي أيضا عند تفسير هذه الآية أخبرني إبراهيم بن الحسن هو المقسمي حدثنا حجاج بن محمد عن عمر بن ذر عن أبيه عن سعيد بن جبير عن ابن عباس رضي الله عنهما قال: إن النبي صلى الله عليه وسلم سجد في ص وقال \" سجدها داود عليه الصلاة والسلام توبة ونسجدها شكرا\" تفرد بروايته النسائي ورجال إسناده كلهم ثقات وقد أخبرني شيخنا الحافظ أبو الحجاج المزي قراءة عليه وأنا أسمع أخبرنا أبو إسحاق المدرجي أخبرنا زاهر بن أبي طاهر الثقفي حدثنا زاهر بن أبي طاهر الشحامي أخبرنا أبو سعيد الكنجدروذي أخبرنا الحاكم أبو أحمد محمد بن محمد الحافظ أخبرنا أبو العباس السراج حدثنا هارون بن عبد الله حدثنا محمد بن يزيد ابن خنيس عن الحسن بن محمد بن عبيد الله بن أبي يزيد قال: قال لي ابن جريج يا حسن حدثني جدك عبيد الله بن أبي يزيد عن ابن عباس رضي الله عنهما فقال جاء رجل إلى النبي صلى الله عليه وسلم فقال يا رسول الله إنى رأيت فيما يرى النائم كأنى أصلي خلف شجرة فقرأت السجدة فسجدت فسجدت الشجرة بسجودي فسمعتها تقول وهي ساجدة: اللهم اكتب لي بها عندك أجرا وأجعلها لي عندك دخرا وضع بها عني وزرا وأقبلها مني كما فبلتها من عبدك داود قال ابن عباس رضي الله عنهما فرأيت النبي صلى الله عليه وسلم قام فقرأ السجدة ثم سجد فسمعته يقول وهو ساجد كما حكى الرجل من كلام الشجرة رواه الترمذي عن قتيبة وابن ماجة عن أبي بكر بن خلاد كلاهما عن محمد بن يزيد بن خنيس نحوه وقال الترمذي غريب لا نعرفه إلا من هذا الوجه وقال البخاري عند تفسيرها أيضا حدثنا محمد بن عبد الله حدثنا محمد بن عبيد الطنافسي عن العوام قال سألت مجاهدا عن سجدة ص فقال: سألت ابن عباس رضي الله عنهما من أين سجدت فقال أو ما تقرأ \"ومن ذريته داود وسليمان\" \"أولئك الذين هدى الله فبهداهم اقتده\" فكان داود عليه الصلاة والسلام ممن أمر نبيكم صلى الله عليه وسلم أن يقتدي به فسجدها داود عليه الصلاة والسلام فسجدها رسول الله صلى الله عليه وسلم وقال الإمام أحمد حدثنا عفان حدثنا يزيد بن زريع حدثنا حميد حدثنا بكر هو ابن عبد الله المزني أنه أخبره أن أبا سعيد الخدري رضي الله عنه رأى رؤيا أنه يكتب ص فلما بلغ إلى الآية التي يسجد بها رأى الدواة والقلم وكل شيء بحضرته انقلب ساجدا قال قفصها على النبي صلى الله عليه وسلم فلم يزل يسجد بها بعد تفرد به أحمد وقال أبو داود حدثنا أحمد بن صالح حدثنا ابن وهب أخبرني عمرو بن الحارث عن سعيد بن أبي هلال عن عياض بن عبد الله بن سعد بن أبي سرح عن أبي سعيد الخدري رضي الله عنه قال: قرأ رسول الله صلى الله عليه وسلم وهو على المنبر \"ص\" فلما بلغ السجدة نزل فسجد وسجد الناس معه فلما كان يوم آخر قرأها فلما بلغ السجدة تشزن الناس للسجود فقال صلى الله عليه وسلم \"إنما هي توبة نبي ولكني رأيتكم تشزنتم \"فنزل وسجد تفرد به أبو داود وإسناده عل شرط الصحيح."
    },
    {
      "ayah": 23,
      "surah": 38,
      "text": "قد ذكر المفسرون ههنا قصة أكثرها مأخوذ من الإسرائيليات ولم يثبت فيها عن المعصوم حديث يجب اتباعه ولكن روى ابن أبي حاتم هنا حديثا لا يصح سنده لأنه من رواية يزيد الرقاشي عن أنس رضي الله عنه ويزيد وإن كان من الصالحين لكنه ضعيف الحديث عند الأئمة فالأولى أن يقتصر على مجرد تلاوة هذه القصة وأن يرد علمها إلى الله عز وجل فإن القرآن حق وما تضمن فهو حق أيضا وقوله تعالى \"ففزع منهم\" إنما كان ذلك لأنه كان في محرابه وهو أشرف مكان في داره وكان قد أمر أن لا يدخل عليه أحد ذلك اليوم فلم يشعر إلا بشخصين قد تسورا عليه المحراب أي احتاطا به يسألانه عن شأنهما وقوله عز وجل \"وعزني في الخطاب\" أي غلبني يقال عز يعز إذا قهر وغلب وقوله تعالى \"وظن داود إنما فتناه\" قال علي بن أبي طلحة عن ابن عباس رضي الله عنهما أي اختبرناه وقوله تعالى \"وخر راكعا\" أي ساجدا \"وأناب\" ويحتمل أنه ركع أولا ثم سجد بعد ذلك وقد ذكر أنه استمر ساجدا \"أربعين صباحا\" فغفرنا له ذلك أي ما كان منه مما يقال فيه إن حسنات الأبرار سيئات المقربين وقد اختلف الأئمة في سجدة ص هل هي من عزائم السجود ؟ على قولين الجديد من مذهب الشافعي رضي الله عنه أنها ليست من عزائم السجود بل هي سجدة شكر والدليل على ذلك ما رواه الإمام أحمد حيث قال حدثنا إسماعيل هو ابن علية عن أيوب عن عكرمة عن ابن عباس رضي الله عنهما أنه قال في السجدة في ص ليست من عزائم السجود وقد رأيت رسول الله صلى الله عليه وسلم يسجد فيها ورواه البخاري وأبو داود والترمذي والنسائي في تفسيره من حديث أيوب به وقال الترمذي حسن صحيح وقال النسائي أيضا عند تفسير هذه الآية أخبرني إبراهيم بن الحسن هو المقسمي حدثنا حجاج بن محمد عن عمر بن ذر عن أبيه عن سعيد بن جبير عن ابن عباس رضي الله عنهما قال: إن النبي صلى الله عليه وسلم سجد في ص وقال \" سجدها داود عليه الصلاة والسلام توبة ونسجدها شكرا\" تفرد بروايته النسائي ورجال إسناده كلهم ثقات وقد أخبرني شيخنا الحافظ أبو الحجاج المزي قراءة عليه وأنا أسمع أخبرنا أبو إسحاق المدرجي أخبرنا زاهر بن أبي طاهر الثقفي حدثنا زاهر بن أبي طاهر الشحامي أخبرنا أبو سعيد الكنجدروذي أخبرنا الحاكم أبو أحمد محمد بن محمد الحافظ أخبرنا أبو العباس السراج حدثنا هارون بن عبد الله حدثنا محمد بن يزيد ابن خنيس عن الحسن بن محمد بن عبيد الله بن أبي يزيد قال: قال لي ابن جريج يا حسن حدثني جدك عبيد الله بن أبي يزيد عن ابن عباس رضي الله عنهما فقال جاء رجل إلى النبي صلى الله عليه وسلم فقال يا رسول الله إنى رأيت فيما يرى النائم كأنى أصلي خلف شجرة فقرأت السجدة فسجدت فسجدت الشجرة بسجودي فسمعتها تقول وهي ساجدة: اللهم اكتب لي بها عندك أجرا وأجعلها لي عندك دخرا وضع بها عني وزرا وأقبلها مني كما فبلتها من عبدك داود قال ابن عباس رضي الله عنهما فرأيت النبي صلى الله عليه وسلم قام فقرأ السجدة ثم سجد فسمعته يقول وهو ساجد كما حكى الرجل من كلام الشجرة رواه الترمذي عن قتيبة وابن ماجة عن أبي بكر بن خلاد كلاهما عن محمد بن يزيد بن خنيس نحوه وقال الترمذي غريب لا نعرفه إلا من هذا الوجه وقال البخاري عند تفسيرها أيضا حدثنا محمد بن عبد الله حدثنا محمد بن عبيد الطنافسي عن العوام قال سألت مجاهدا عن سجدة ص فقال: سألت ابن عباس رضي الله عنهما من أين سجدت فقال أو ما تقرأ \"ومن ذريته داود وسليمان\" \"أولئك الذين هدى الله فبهداهم اقتده\" فكان داود عليه الصلاة والسلام ممن أمر نبيكم صلى الله عليه وسلم أن يقتدي به فسجدها داود عليه الصلاة والسلام فسجدها رسول الله صلى الله عليه وسلم وقال الإمام أحمد حدثنا عفان حدثنا يزيد بن زريع حدثنا حميد حدثنا بكر هو ابن عبد الله المزني أنه أخبره أن أبا سعيد الخدري رضي الله عنه رأى رؤيا أنه يكتب ص فلما بلغ إلى الآية التي يسجد بها رأى الدواة والقلم وكل شيء بحضرته انقلب ساجدا قال قفصها على النبي صلى الله عليه وسلم فلم يزل يسجد بها بعد تفرد به أحمد وقال أبو داود حدثنا أحمد بن صالح حدثنا ابن وهب أخبرني عمرو بن الحارث عن سعيد بن أبي هلال عن عياض بن عبد الله بن سعد بن أبي سرح عن أبي سعيد الخدري رضي الله عنه قال: قرأ رسول الله صلى الله عليه وسلم وهو على المنبر \"ص\" فلما بلغ السجدة نزل فسجد وسجد الناس معه فلما كان يوم آخر قرأها فلما بلغ السجدة تشزن الناس للسجود فقال صلى الله عليه وسلم \"إنما هي توبة نبي ولكني رأيتكم تشزنتم \"فنزل وسجد تفرد به أبو داود وإسناده عل شرط الصحيح."
    },
    {
      "ayah": 24,
      "surah": 38,
      "text": "قد ذكر المفسرون ههنا قصة أكثرها مأخوذ من الإسرائيليات ولم يثبت فيها عن المعصوم حديث يجب اتباعه ولكن روى ابن أبي حاتم هنا حديثا لا يصح سنده لأنه من رواية يزيد الرقاشي عن أنس رضي الله عنه ويزيد وإن كان من الصالحين لكنه ضعيف الحديث عند الأئمة فالأولى أن يقتصر على مجرد تلاوة هذه القصة وأن يرد علمها إلى الله عز وجل فإن القرآن حق وما تضمن فهو حق أيضا وقوله تعالى \"ففزع منهم\" إنما كان ذلك لأنه كان في محرابه وهو أشرف مكان في داره وكان قد أمر أن لا يدخل عليه أحد ذلك اليوم فلم يشعر إلا بشخصين قد تسورا عليه المحراب أي احتاطا به يسألانه عن شأنهما وقوله عز وجل \"وعزني في الخطاب\" أي غلبني يقال عز يعز إذا قهر وغلب وقوله تعالى \"وظن داود إنما فتناه\" قال علي بن أبي طلحة عن ابن عباس رضي الله عنهما أي اختبرناه وقوله تعالى \"وخر راكعا\" أي ساجدا \"وأناب\" ويحتمل أنه ركع أولا ثم سجد بعد ذلك وقد ذكر أنه استمر ساجدا \"أربعين صباحا\" فغفرنا له ذلك أي ما كان منه مما يقال فيه إن حسنات الأبرار سيئات المقربين وقد اختلف الأئمة في سجدة ص هل هي من عزائم السجود ؟ على قولين الجديد من مذهب الشافعي رضي الله عنه أنها ليست من عزائم السجود بل هي سجدة شكر والدليل على ذلك ما رواه الإمام أحمد حيث قال حدثنا إسماعيل هو ابن علية عن أيوب عن عكرمة عن ابن عباس رضي الله عنهما أنه قال في السجدة في ص ليست من عزائم السجود وقد رأيت رسول الله صلى الله عليه وسلم يسجد فيها ورواه البخاري وأبو داود والترمذي والنسائي في تفسيره من حديث أيوب به وقال الترمذي حسن صحيح وقال النسائي أيضا عند تفسير هذه الآية أخبرني إبراهيم بن الحسن هو المقسمي حدثنا حجاج بن محمد عن عمر بن ذر عن أبيه عن سعيد بن جبير عن ابن عباس رضي الله عنهما قال: إن النبي صلى الله عليه وسلم سجد في ص وقال \" سجدها داود عليه الصلاة والسلام توبة ونسجدها شكرا\" تفرد بروايته النسائي ورجال إسناده كلهم ثقات وقد أخبرني شيخنا الحافظ أبو الحجاج المزي قراءة عليه وأنا أسمع أخبرنا أبو إسحاق المدرجي أخبرنا زاهر بن أبي طاهر الثقفي حدثنا زاهر بن أبي طاهر الشحامي أخبرنا أبو سعيد الكنجدروذي أخبرنا الحاكم أبو أحمد محمد بن محمد الحافظ أخبرنا أبو العباس السراج حدثنا هارون بن عبد الله حدثنا محمد بن يزيد ابن خنيس عن الحسن بن محمد بن عبيد الله بن أبي يزيد قال: قال لي ابن جريج يا حسن حدثني جدك عبيد الله بن أبي يزيد عن ابن عباس رضي الله عنهما فقال جاء رجل إلى النبي صلى الله عليه وسلم فقال يا رسول الله إنى رأيت فيما يرى النائم كأنى أصلي خلف شجرة فقرأت السجدة فسجدت فسجدت الشجرة بسجودي فسمعتها تقول وهي ساجدة: اللهم اكتب لي بها عندك أجرا وأجعلها لي عندك دخرا وضع بها عني وزرا وأقبلها مني كما فبلتها من عبدك داود قال ابن عباس رضي الله عنهما فرأيت النبي صلى الله عليه وسلم قام فقرأ السجدة ثم سجد فسمعته يقول وهو ساجد كما حكى الرجل من كلام الشجرة رواه الترمذي عن قتيبة وابن ماجة عن أبي بكر بن خلاد كلاهما عن محمد بن يزيد بن خنيس نحوه وقال الترمذي غريب لا نعرفه إلا من هذا الوجه وقال البخاري عند تفسيرها أيضا حدثنا محمد بن عبد الله حدثنا محمد بن عبيد الطنافسي عن العوام قال سألت مجاهدا عن سجدة ص فقال: سألت ابن عباس رضي الله عنهما من أين سجدت فقال أو ما تقرأ \"ومن ذريته داود وسليمان\" \"أولئك الذين هدى الله فبهداهم اقتده\" فكان داود عليه الصلاة والسلام ممن أمر نبيكم صلى الله عليه وسلم أن يقتدي به فسجدها داود عليه الصلاة والسلام فسجدها رسول الله صلى الله عليه وسلم وقال الإمام أحمد حدثنا عفان حدثنا يزيد بن زريع حدثنا حميد حدثنا بكر هو ابن عبد الله المزني أنه أخبره أن أبا سعيد الخدري رضي الله عنه رأى رؤيا أنه يكتب ص فلما بلغ إلى الآية التي يسجد بها رأى الدواة والقلم وكل شيء بحضرته انقلب ساجدا قال قفصها على النبي صلى الله عليه وسلم فلم يزل يسجد بها بعد تفرد به أحمد وقال أبو داود حدثنا أحمد بن صالح حدثنا ابن وهب أخبرني عمرو بن الحارث عن سعيد بن أبي هلال عن عياض بن عبد الله بن سعد بن أبي سرح عن أبي سعيد الخدري رضي الله عنه قال: قرأ رسول الله صلى الله عليه وسلم وهو على المنبر \"ص\" فلما بلغ السجدة نزل فسجد وسجد الناس معه فلما كان يوم آخر قرأها فلما بلغ السجدة تشزن الناس للسجود فقال صلى الله عليه وسلم \"إنما هي توبة نبي ولكني رأيتكم تشزنتم \"فنزل وسجد تفرد به أبو داود وإسناده على شرط الصحيح."
    },
    {
      "ayah": 25,
      "surah": 38,
      "text": "وقوله تعالى \"وإن له عندنا لزلفى وحسن مآب\" أي وإن له يوم القيامة لقربة يقربه الله عز وجل بها وحسن مرجع وهو الدرجات العالية في الجنة لنوبته وعدله التام في ملكه كما جاء في الصحيح \" المقسطون على منابر من نور عن يمين الرحمن وكلتا يديه يمين الذين يقسطون في أهليهم وما ولوا \"وقال الإمام أحمد حدثنا يحي بن آدم ثنا فضيل عن عطية عن أبي سعيد الخدري قال: قال رسول الله صلى الله عليه وسلم \" إن أحب الناس إلى الله يوم القيامة وأقربهم منه مجلسا إمام عادل وإن أبغض الناس إلى الله يوم القيامة وأشدهم عذابا إمام جائر \"ورواه الترمذي من حديث فضيل وهو ابن مرزوق الأغر عن عطية به وقال لا نعرفه مرفوعا إلا من هذا الوجه وقال ابن أبي حاتم حدثنا أبو زرعة ثنا عبد الله بن أبي زياد ثنا سيار ثنا جعفر بن سليمان سمعت مالك بن دينار في قوله تعالى \"وإن له عندنا لزلفى وحسن مآب \" قال يقام داود يوم القيامة عند ساق العرش ثم يقول يا داود مجدني اليوم بذلك الصوت الحسن الرحيم الذي كنت تمجدني في الدنيا فيقول وكيف وقد سلبته ؟ فيقول الله عز وجل إني أرده عليك اليوم قال فيرفع داود عليه الصلاة والسلام بصوت يستفرغ نعيم أهل الجنان."
    },
    {
      "ayah": 26,
      "surah": 38,
      "text": "هذه وصية من الله عز وجل لولاة الأمور أن يحكموا بين الناس بالحق المنزل من عنده تبارك وتعالى ولا يعدلوا عنه فيضلوا عن سبيل الله وقد توعد تبارك وتعالى من ضل عن سبيله وتناسى يوم الحساب بالوعيد الأكيد والعذاب الشديد قال ابن أبي حاتم حدثنا أبى حدثنا هشام بن خالد حدثنا الوليد حدثنا مروان بن جناح حدثني إبراهيم أبو زرعة كان قد قرأ الكتاب أن الوليد بن عبد الملك قال له أيحاسب الخليفة فإنك قد قرأت الكتاب الأول وقرأت القرآن وفقهت فقلت يا أمير المؤمنين أقول ؟ قال قل في أمان الله قلت يا أمير المؤمنين أنت أكرم على الله أو داود عليه الصلاة والسلام إن الله تعالى جمع له النبوة والخلافة ثم توعده في كتابه فقال تعالى \"يا داود إنا جعلناك خليفة في الأرض فاحكم بين الناس بالحق ولا تتبع الهوى فيضلك عن سبيل الله\" الآية وقال عكرمة \" لهم عذاب شديد بما نسوا يوم الحساب \" هذا من المقدم والمؤخر لهم عذاب شديد يوم الحساب بما نسوا وقال السدي لهم عذاب شديد بما تركوا إن يعملوا ليوم الحساب وهذا القول أمشى على ظاهر الآية والله سبحانه وتعالى الموفق للصواب."
    },
    {
      "ayah": 27,
      "surah": 38,
      "text": "يخبر تعالى أنه ما خلق الخلق عبثا وإنما خلقهم ليعبدوه ويوحدوه ثم يجمعهم يوم الجمع فيثيب المطيع ويعذب الكافر ولهذا قال تبارك وتعالى \"وما خلقنا السماء والأرض وما بينهما باطلا ذلك ظن الذين كفروا\" أي الذين لا يرون بعثا ولا معادا وإنما يعتقدون هذه الدار فقط \"فويل للذين كفروا من النار\" أي ويل لهم يوم معادهم ونشورهم من النار المعدة لهم ثم بين تعالى أنه عز وجل من عدله وحكمته لا يساوي بين المؤمنين والكافرين."
    },
    {
      "ayah": 28,
      "surah": 38,
      "text": "قال تعالى \"أم نجعل الذين آمنوا وعملوا الصالحات كالمفسدين في الأرض أم نجعل المتقين كالفجار\" أي لا نفعل ذلك ولا يستوون عند الله وإذا كان الأمر كذلك فلا بد من دار أخرى يثاب فيها هذا المطيع ويعاقب فيها هذا الفاجر وهذا الإرشاد يدل العقول السليمة والفطر المستقيمة على أنه لا بد من معاد وجزاء فإنا نرى الظالم الباغي يزداد ماله وولده ونعيمه ويموت كذلك ونرى المطيع المظلوم يموت بكمده فلا بد في حكمة الحكيم العليم العادل الذي لا يظلم مثقال ذرة من إنصاف هذا من هذا وإذا لم يقع هذا في هذه الدار فتعين أن هناك دارا أخرى لهذا الجزاء والمواساة ولما كان القرآن يرشد إلى المقاصد الصحيحة والمآخذ العقلية الصريحة."
    },
    {
      "ayah": 29,
      "surah": 38,
      "text": "قال تعالى \"كتاب أنزلناه إليك مبارك ليدبروا آياته وليتذكر أولو الألباب\" أي ذوو العقول وهي الألباب جمع لب وهو العقل قال الحسن البصري والله ما تدبره بحفظ حروفه وإضاعة حدوده حتى إن أحدهم ليقول قرأت القرآن كله ما يرى له القرآن فى خلق ولا عمل رواه ابن أبي حاتم."
    },
    {
      "ayah": 3,
      "surah": 38,
      "text": "فقال تعالى \"كم أهلكنا من قبلهم من قرن \" أي من أمة مكذبة \"فنادوا\" أي حين جاءهم العذاب استغاثوا وجأروا إلى الله تعالى وليس ذلك بمجد عنهم شيئا كما قال عز وجل \"فلما أحسوا بأسنا إذا هم منها يركضون\" أي يهربون \"لا تركضوا وارجعوا إلى ما أترفتم فيه ومساكنكم لعلكم تسألون\" قال أبو داود الطيالسي حدثنا شعبة عن أبي إسحاق التميمي قال: سألت ابن عباس رضي الله تعالى عنهما عن قول الله تبارك وتعالى فنادوا \"ولات حين مناص \" قال ليس بحين نداء ولا نزو ولا فرار وقال علي بن أبي طلحة عن ابن عباس رضي الله تعالى عنهما ليس بحين مغاث وقال شبيب بن بشر عن عكرمة عن ابن عباس نادوا النداء حين لا ينفعهم وأنشد تذكر ليلى لات حين تذكر وقال محمد بن كعب في قوله تعالى \"فنادوا ولات حين مناص \" يقول نادوا بالتوحيد حين تولت الدنيا عنهم واستناصوا للتوبة حيت تولت الدنيا عنهم وقال قتادة لما رأوا العذاب أرادوا التوبة في غير حين النداء وقال مجاهد \"فنادوا ولات حين مناص \" ليس بحين فرار ولا إجابة وقد روي نحو هذا عن عكرمة وسعيد بن جبير وأبي مالك والضحاك وزيد بن أسلم والحسن وقتادة وعن مالك عن زيد بن أسلم \"ولات حين مناص \" ولا نداء في غير حين النداء وهذه الكلمة وهي لات هي لا التي للنفى زيدت معها التاء كما تزاد في ثم فيقولون ثمت ورب فيقولون ربت وهى مفصولة والوقف عليها ومنهم من حكى عن المصحف الإمام فيما ذكره ابن جرير أنها متصلة بحين ولا تحين مناص والمشهور الأول ثم قرأ الجمهور بنصب حين تقديره وليس الحين حين مناص ومنهم من جوز النصب بها وأنشد تذكر حب ليلى لات حينا واأضحى الشيب قد قطع القرينا ومنهم من جرز الجر بها وأنشد: طلبوا صلحنا ولات أوان فأجبنا أن ليس حين بقاء وأنشد بعضهم أيضا: ولات ساعة مندم بخفض الساعة وأهل اللغة يقولون النوص التأخر والبوص التقدم ولهذا قال تبارك وتعالى \"ولات حين مناص\" أي ليس الحين حين فرار ولا ذهاب والله سبحانه وتعالى الموفق للصواب."
    },
    {
      "ayah": 30,
      "surah": 38,
      "text": "يقول تعالى مخبرا أنه وهب لداود سليمان أي نبيا كما قال عز وجل \"وورت سليمان داود\" أي في النبوة وإلا فقد كان له بنون غيره فإنه قد كان عنده مائة امرأة حرائر وقوله تعالى \"نعم العبد إنه أواب\" ثناء على سليمان بأنه كثير الطاعة والعبادة والإنابة إلى الله عز وجل قال ابن أبي حاتم حدثنا أبي حدثنا عمرو بن خالد حدثنا الوليد بن جابر حدثنا مكحول قال لما وهب الله تعالى لداود سليمان قال له يا بني ما أحسن ؟ قال سكينة الله والإيمان قال فما أقبح ؟ قال كفر بعد إيمان قال فما أحلى قال روح الله بين عباده قال فما أبرد ؟ قال عفو الله عن الناس وعفو الناس بعضهم عن بعض قال داود عليه السلام فأنت نبي."
    },
    {
      "ayah": 31,
      "surah": 38,
      "text": "قوله تعالى \"إذ عرض عليه بالعشي الصافنات الجياد\" أي إذ عرض على سليمان عليه الصلاة والسلام في حال مملكته وسلطانه الخيل الصافنات قال مجاهد وهي التي تقف على ثلاث وطرف حافر الرابعة والجياد السراع وكذا قال غير واحد من السلف وقال ابن جرير حدثنا محمد بن بشار حدثنا مؤمل حدثنا سفيان عن أبيه سعيد بن مسروق عن إبراهيم التيمي في قوله عز وجل \" إذ عرض عليه بالعشي الصافنات الجياد\" قال كانت عشرين فرسا ذات أجنحة كذا رواه ابن جرير.وقال ابن أبي حاتم حدثنا أبو زرعة حدثنا إبراهيم بن موسى حدثنا ابن أبي زائدة أخبرني إسرائيل عن سعيد بن مسروق عن إبراهيم التيمي قال كانت الخيل التي شغلت سليمان عليه الصلاة والسلام عشرين ألف فرس فعقرها وهذا أشبه والله أعلم وقال أبو داود حدثنا محمد بن عوف حدثنا سعيد بن أبي مريم أخبرنا يحيى بن أيوب حدثني عمارة بن غزية أن محمد بن إبراهيم حدثه عن أبي سلمة بن عبد الرحمن عن عائشة رضي الله عنها قالت قدم رسول الله صلى الله عليه وسلم من غزوة تبوك أو خيبر وفي سهوتها ستر فهبت الريح فكشفت ناحية الستر عن بنات لعائشة رضي الله عنها لعب فقال صلى الله عليه وسلم \" ما هذا يا عائشة ؟ \"قالت رضي الله عنها بناتي ورأى بينهن فرسا له جناحان من رقاع فقال صلى الله عليه وسلم \" ما هذا الذي أرى وسطهن ؟ \"قالت رضي الله عنها فرس قال رسول الله صلى الله عليه وسلم \" ما هذا الذي عليه ؟ \"قالت رضي الله عنها جناحان قال رسول الله صلى الله عليه وسلم \" فرس له جناحان ؟ \"قالت رضي الله عنها أما سمعت أن سليمان عليه الصلاة والسلام كانت له خيل لها أجنحة قالت رضي الله عنها فضحك صلى الله عليه وسلم حتى رأيت نواجذه."
    },
    {
      "ayah": 32,
      "surah": 38,
      "text": "وقوله تبارك وتعالى \"فقال إني أحببت حب الخير عن ذكر ربي حتى توارت بالحجاب\" ذكر غير واحد من السلف والمفسرين أنه اشتغل بعرضها حتى فات وقت صلاة العصر والذي يقطع به أنه لم يتركها عمدا بل نسيانا كما شغل النبي يوم الخندق عن صلاة العصر حتى صلاها بعد الغروب وذلك ثابت في الصحيحين من غير وجه من ذلك عن جابر رضي الله عنه قال جاء عمر رضي الله عنه يوم الخندق بعدما غربت الشمس فجعل يسب كفار قريش ويقول يا رسول الله والله ما كدت أصلي العصر حتى كادت الشمس تغرب فقال رسول الله صلى الله عليه وسلم \" والله ما صليتها \"فقال فقمنا إلى بطحان فتوضأ نبي الله للصلاة وتوضأنا لها فصلى العصر بعدما غربت الشمس ثم صلى بعدها المغرب ويحتمل أنه كان سائغا في ملتهم تأخير الصلاة لعذر الغزو والقتال والخيل تراد للقنال وقد ادعى طائفة من العلماء أن هذا كان مشروعا فنسخ ذلك بصلاة الخوف ومنهم من ذهب إلى ذلك فى حال المسايفة والمضايقة حيث لا تمكن صلاة ولا ركوع ولا سجود كما فعل الصحابة رضي الله عنهم في فتح تستر وهو منقول عن مكحول والأوزاعي وغيرهما والأول أقرب لأنه قال بعده \"ردوها علي فطفق مسحا بالسوق والأعناق\" قال الحسن البصري لا قال: والله لا تشغليني عن عبادة ربي آخر ما عليك ثم أمر بها فعقرت وكذا قال قتادة وقال السدي ضرب أعناقها وعراقيبها بالسيوف وقال علي بن أبي طلحة عن ابن عباس رضي الله عنهما جعل يمسح أعراف الخيل وعراقيبها حبا لها وهذا القول اختاره ابن جرير قال لأنه لم يكن ليعذب حيوانا بالعرقبة ويهلك مالا من ماله بلا سيب سوى أنه اشتغل عن صلاته بالنظر إليها ولا ذنب لها وهذا الذي رجح به ابن جرير فيه نظر لأنه قد يكون في شرعهم جواز مثل هذا ولا سيما إذا كان غضبا لله تعالى بسبب أنه اشتغل بها حتى خرج وقت الصلاة ولهذا لما خرج عنها لله تعالى عوضه الله عز وجل ما هو خير منها وهو الريح التي تجري بأمره رخاء حيث أصاب غدوها شهر ورواحها شهر فهذا اسرع وخير من الخيل قال الإمام أحمد: حدثنا إسماعيل حدثنا سليمان بن المغيرة عن حميد بن هلال عن أبي قتادة وأبي الدهماء وكانا يكثران السفر نحو البيت قالا أتينا على رجل من أهل البادية فقال لنا البدوي أخذ بيدي رسول الله فجعل يعلمني مما علمه الله عز وجل وقال \"إنك لا تدع شيئا اتقاء الله تعالى إلا أعطاك الله عز وجل خيرا منه\"."
    },
    {
      "ayah": 33,
      "surah": 38,
      "text": "وقوله تبارك وتعالى \"فقال إني أحببت حب الخير عن ذكر ربي حتى توارت بالحجاب\" ذكر غير واحد من السلف والمفسرين أنه اشتغل بعرضها حتى فات وقت صلاة العصر والذي يقطع به أنه لم يتركها عمدا بل نسيانا كما شغل النبي يوم الخندق عن صلاة العصر حتى صلاها بعد الغروب وذلك ثابت في الصحيحين من غير وجه من ذلك عن جابر رضي الله عنه قال جاء عمر رضي الله عنه يوم الخندق بعدما غربت الشمس فجعل يسب كفار قريش ويقول يا رسول الله والله ما كدت أصلي العصر حتى كادت الشمس تغرب فقال رسول الله صلى الله عليه وسلم \" والله ما صليتها \"فقال فقمنا إلى بطحان فتوضأ نبي الله للصلاة وتوضأنا لها فصلى العصر بعدما غربت الشمس ثم صلى بعدها المغرب ويحتمل أنه كان سائغا في ملتهم تأخير الصلاة لعذر الغزو والقتال والخيل تراد للقنال وقد ادعى طائفة من العلماء أن هذا كان مشروعا فنسخ ذلك بصلاة الخوف ومنهم من ذهب إلى ذلك فى حال المسايفة والمضايقة حيث لا تمكن صلاة ولا ركوع ولا سجود كما فعل الصحابة رضي الله عنهم في فتح تستر وهو منقول عن مكحول والأوزاعي وغيرهما والأول أقرب لأنه قال بعده \"ردوها علي فطفق مسحا بالسوق والأعناق\" قال الحسن البصري لا قال: والله لا تشغليني عن عبادة ربي آخر ما عليك ثم أمر بها فعقرت وكذا قال قتادة وقال السدي ضرب أعناقها وعراقيبها بالسيوف وقال علي بن أبي طلحة عن ابن عباس رضي الله عنهما جعل يمسح أعراف الخيل وعراقيبها حبا لها وهذا القول اختاره ابن جرير قال لأنه لم يكن ليعذب حيوانا بالعرقبة ويهلك مالا من ماله بلا سيب سوى أنه اشتغل عن صلاته بالنظر إليها ولا ذنب لها وهذا الذي رجح به ابن جرير فيه نظر لأنه قد يكون في شرعهم جواز مثل هذا ولا سيما إذا كان غضبا لله تعالى بسبب أنه اشتغل بها حتى خرج وقت الصلاة ولهذا لما خرج عنها لله تعالى عوضه الله عز وجل ما هو خير منها وهو الريح التي تجري بأمره رخاء حيث أصاب غدوها شهر ورواحها شهر فهذا اسرع وخير من الخيل قال الإمام أحمد: حدثنا إسماعيل حدثنا سليمان بن المغيرة عن حميد بن هلال عن أبي قتادة وأبي الدهماء وكانا يكثران السفر نحو البيت قالا أتينا على رجل من أهل البادية فقال لنا البدوي أخذ بيدي رسول الله فجعل يعلمني مما علمه الله عز وجل وقال \"إنك لا تدع شيئا اتقاء الله تعالى إلا أعطاك الله عز وجل خيرا منه\"."
    },
    {
      "ayah": 34,
      "surah": 38,
      "text": "يقول تعالى \"ولقد فتنا سليمان\" أي اختبرناه بأن سلبناه الملك \"وألقينا على كرسيه جسدا\" قال ابن عباس رضي الله عنهما ومجاهد وسعد بن جبير والحسن وقتادة وغيرهم يعني شيطانا \"ثم أناب\" أي رجع إلى ملكه وسلطانه وأبهته قال ابن جرير وكان اسم ذلك الشيطان صخرا قاله ابن عباس رضي الله عنهما وقتادة وقيل آصف قاله مجاهد وقيل أصروا قاله مجاهد أيضا وقيل حبيق قاله السدي وقد ذكروا هذه القصة مبسوطة ومختصرة وقد قال سعيد بن أبي عروبة عن قتادة قال أمر سليمان عليه الصلاة والسلام ببناء بيت المقدس فقيل له ابنه ولا يسمع فيه صوت حديد قال فطلب ذلك فله يقدر عليه فقيل له إن شيطانا في البحر يقال له صخر شبه المارد قال فطلبه وكانت في البحر عين يردها في كل سبعة أيام مرة فنزح ماءها وجعل فيها خمرا فجاء يوم وروده فإذا هو بالخمر فقال إنك لشراب طيب إلا أنك تصبين الحليم وتزيدين الجاهل جهلا قال ثم رجع حتى عطش عطشا شديدا ثم أتاها فقال إنك لشراب طيب إلا أنك تصبين الحليم وتزيدين الجاهل جهلا قال ثم شربها حتى غلب على عقله قال فأرى الخاتم أو ختم به بين كتفيه فذل قال وكان ملكه في خاتمه فأتي به سليمان عليه الصلاة والسلام فقال إنا قد أمرنا ببناء هذا البيت وقيل لنا لا يسمعن فيه صوت حديد قال فأتى ببيض الهدهد فجعل عليه زجاجة فجاء الهدهد فدار حولها فجعل يرى بيضه ولا يقدر عليه فذهب فجاء بالماس فوضعه عليه فقطعها به حتى أفضى إلى بيضه فأخذ الماس فجعلوا يقطعون به الحجارة وكان سليمان عليه الصلاة والسلام إذا أراد أن يدخل الخلاء أو الحمام لم يدخل بالخاتم فانطلق يوما إلى الحمام وذلك الشيطان صخر معه وذلك عند مقارفة قارف فيها بعض نسائه قال فدخل الحمام وأعطى الشيطان خاتمه فألقاه في البحر فالتقمته سمكة ونزع ملك سليمان منه وألقي على الشيطان شبه سليمان قال فجاء فقعد على كرسيه وسريره وسلط على ملك سليمان كله غير نسائه قال فجعل يقضي بينهم وجعلوا ينكرون منه أشياء حتى قالوا لقد فتن نبي الله وكان فيهم رجل يشبهونه بعمر بن الخطاب رضي الله عنه في القوة فقال والله لأجربنه قال فقال يا نبي الله وهو لا يرى إلا أنه نبي الله أحدنا تصيبه الجنابة فى الليلة الباردة فيدع الغسل عمدا حتى تطلع الشمس أترى عليه بأسا ؟ قال لا فبينما هو كذلك أربعين ليلة إذ وجد نبي الله خاتمه في بطن سمكة فأقبل فجعل لا يستقبله جني ولا طير إلا سجد له حتى انتهى إليهم \"وألقينا على كرسيه جسدا\" قال هو الشيطان صخر وقال السدي \"ولقد فتنا سليمان\" أي ابتلينا سليمان \"وألقينا على كرسيه جسدا\" قال شيطانا جلس على كرسيه أربعين يوما قال كان لسليمان عليه الصلاة والسلام مائة امرأة وكانت امرأة منهن يقال لها جرادة وهي آثر نسائه وآمنهن عنده وكان إذا أجنب أو أتى حاجة نزع خاتمه ولم يأمن عليه أحدا من الناس غيرها فأعطاها يوما خاتمه ودخل الخلاء فخرج الشيطان فى صورته فقال هاتي الخاتم فأعطته فجاء حتى جلس على مجلس سليمان عليه الصلاة والسلام وخرج سليمان بعد ذلك فسألها أن تعطيه خاتمه فقالت ألم تأخذه قبل ؟ قال لا وخرج كأنه تائه ومكث الشيطان يحكم بين الناس أربعين يوما قال فأنكر الناس أحكامه فاجتمع قراء بني إسرائيل وعلماؤهم فجاءوا حتى دخلوا على نسائه فقالوا لهن إنا قد أنكرنا هذا فإن كان سليمان فقد ذهب عقله وأنكرنا أحكامه قال فبكى النساء عند ذلك قال فأقبلوا يمشون حتى أتوه فأحدقوا به ثم نشروا يقرءون التوراة قال فطار من بين أيديهم حتى وقع على شرفة والخاتم معه ثم طار حتى ذهب إلى البحر فوقع الخاتم منه في البحر فابتلعه حوت من حيتان البحر قال وأقبل سليمان عليه الصلاة والسلام في حاله التي كان فيها حتى انتهى إلى صياد من صيادي البحر وهو جائع وقد اشتد جوعه فسألهم من صيدهم وقال إني أنا سليمان فقام إليه بعضهم فضربه بعصا فشجه فجعل يغسل دمه وهو على شاطئ البحر فلام الصيادون صاحبهم الذي ضربه فقالوا بئس ما صنعت حيث ضربته قال إنه زعم أنه سليمان قال فأعطوه سمكتين مما قد مذر عندهم ولم يشغله ما كان به من الضرب حتى قام إلى شاطئ البحر فشق بطونهما فجعل يغسل فوجد خاتمه في بطن إحداهما فأخذه فلبسه فرد الله عليه بهاءه وملكه فجاءت الطير حتى حامت عليه فعرف القوم أنه سليمان عليه الصلاة والسلام فقام القوم يعتذرون مما صنعوا فقال ما أحمدكم على عذركم ولا ألومكم على ما كان منكم كان هذا الأمر لا بد منه قال فجاء حتى أتى ملكه وأرسل إلى الشيطان فجيء به فأمر به فجعل في صندوق من حديد ثم أطبق عليه وقفل عليه بقفل وختم عليه بخاتمه ثم أمر به فألقي في البحر فهو فيه حتى تقوم الساعة وكان اسمه حبقيق قال وسخر الله له الريح ولم تكن سخرت له قبل ذلك وهو قوله \"وهب لي ملكا لا ينبغي لأحد من بعدي إنك أنت الوهاب\" وقال ابن أبي نجيح عن مجاهد في قوله تبارك وتعالى \"وألقينا على كرسيه جسدا\" قال شيطانا يقال له آصف فقال له سليمان عليه السلام كيف تفتنون الناس ؟ قال أرني خاتمك أخبرك فلما أعطاه إياه نبذه آصف فى البحر فساح سليمان عليه السلام وذهب ملكه وقعد آصف على كرسيه ومنعه الله تبارك وتعالى من نساء سليمان فلم يقربهن ولم يقربنه وأنكرنه قال فكان سليمان عليه الصلاة والسلام يستطعم فيقول أتعرفوني ؟ أطعموني أنا سليمان فيكذبونه حتى أعطته امرأته يوما حوتا ففتح بطنه فوجد خاتمه فى بطنه فرجع إليه ملكه وفر آصف فدخل البحر هذه كلها من الإسرائيليات ومن أنكرها ما قاله ابن أبي حاتم حدثنا علي بن الحسين حدثنا محمد بن العلاء وعثمان بن أبي شيبة وعلي بن محمد قالوا حدثنا أبو معاوية أخبرنا الأعمش عن المنهال بن عمرو عن سعيد بن جبير عن ابن عباس رضي الله عنهما في قوله تعالى \"وألقينا على كرسيه جسدا ثم أناب\" قال أراد سليمان عليه الصلاة والسلام أن يدخل الخلاء فأعطى الجرادة خاتمه وكانت الجرادة امرأته وكانت أحب نسائه إليه فجاء الشيطان في صورة سليمان فقال لها هاتي خاتمي فأعطته إياه فلما لبسه دانت له الإنس والجن والشياطين فلما خرج سليمان عليه السلام من الخلاء قال لها هاتي خاتمي قالت قد أعطيته سليمان قال أنا سليمان قالت كذبت ما أنت بسليمان فجعل لا يأتي أحدا يقول له أنا سليمان إلا كذبه حتي جعل الصبيان يرمونه بالحجارة فلما رأى ذلك سليمان عرف أنه من أمر الله عز وجل قال وقام الشيطان يحكم بين الناس فلما أراد الله تبارك وتعالى أن يرد على سليمان سلطانه ألقى في قلوب الناس إنكار ذلك الشيطان قال فأرسلوا إلى نساء سليمان فقالوا لهن أتنكرن من سليمان شيئا ؟ قلن نعم إنه يأتينا ونحن حيض وما كان يأتينا قبل ذلك فلما رأى الشيطان أنه قد فطن له ظن أن أمره قد انقطع فكتبوا كتبا فيها سحر وكفر فدفنوها تحت كرسي سليمان ثم أثاروها وقرءوها على الناس وقالوا بهذا كان يظهر سليمان على الناس ويغلبهم فأكفر الناس سليمان عليه الصلاة والسلام فلم يزالوا يكفرونه وبعث ذلك الشيطان بالخاتم فطرحه في البحر فتلقته سمكة فأخذه وكان سليمان عليه السلام يحمل على شط البحر بالأجر فجاء رجل فاشترى سمكا فيه تلك السمكة التي في بطنها الخاتم فدعا سليمان عليه الصلاة والسلام فقال تحمل لي هذا السمك ؟ فقال نعم قال بكم ؟ قال بسمكة من هذا السمك قال فحمل سليمان عليه الصلاة والسلام السمك ثم انطلق به إلى منزله فلما انتهى الرجل إلى بابه أعطاه تلك السمكة التي في بطنها الخاتم فأخذها سليمان عليه الصلاة والسلام فشق بطنها فإذا الخاتم في جوفها فأخذه فلبسه قال فلما لبسه دانت له الجن والإنس والشياطين وعاد إلى حاله وهرب الشيطان حتى لحق بجزيرة من جزائر البحر فأرسل سليمان عليه السلام في طلبه وكان شيطانا مريدا فجعلوا يطلبونه ولا يقدرون عليه حتى وجدوه يوما نائما فجاءوا فبنوا عليه بنيانا من رصاص فاستيقظ فوثب فجعل لا يثب في مكان من البيت إلا أنماط معه من الرصاص قال فأخذوه فأوثقوه وجاءوا به إلى سليمان عليه الصلاة والسلام فأمر به فنقر له تخت من رخام ثم أدخل في جوفه ثم سد بالنحاس ثم أمر به فطرح في البحر فذلك قوله تبارك وتعالى \"ولقد فتنا سليمان وألقينا على كرسيه جسدا\" ثم أناب يعني الشيطان الذي كان سلط عليه إسناده إلى ابن عباس رضي الله عنهما قوي ولكن الظاهر أنه إنما تلقاه ابن عباس رضي الله عنهما إن صح عنه من أهل الكتاب وفيهم طائفة لا يعتقدون نبوة سليمان عليه الصلاة والسلام فالظاهر أنهم يكذبون عليه ولهذا كان في السياق منكرات من أشدها ذكر النساء فإن المشهور عن مجاهد وغير واحد من أئمة السلف أن ذلك الجني لم يسلط على نساء سليمان بل عصمهن الله عز وجل منه تشريفا وتكريما لنبيه عليه السلام وقد رويت هذه القصة مطولة عن جماعة من السلف رضي الله عنهم كسعيد بن المسيب وزيد بن أسلم وجماعة آخرين وكلها متلقاة من قصص أهل الكتاب والله سبحانه وتعالى أعلم بالصواب وقال يحيى بن أبي عروبة الشيباني: وجد سليمان خاتمه بعسقلان فمشى في حرقة إلى بيت المقدس تواضعا لله عز وجل رواه ابن أبي حاتم وقد روى ابن أبي حاتم عن كعب الأحبار في صفة كرسي سليمان عليه الصلاة والسلام خبرا عجيبا فقال حدثنا أبي رحمه الله حدثنا أبو صالح كاتب الليث أخبرني أبو إسحاق المصري عن كعب الأحبار أنه لما فرغ من حديث إرم ذات العماد قال له معاومة يا أبا إسحاق أخبرني عن كرسي سليمان بن داود عليهما الصلاة والسلام وما كان عليه ومن أي شيء هو ؟ فقال كان كرسي سليمان من أنياب الفيلة مرصعا بالدر والياقوت والزبرجد واللؤلؤ وقد جعل له درجة منها مفصصا بالدر والياقوت والزبرجد ثم أمر بالكرسي فحف من جانبيه بالنخل نخل من ذهب شماريخها من ياقوت وزبرجد ولؤلؤ وجعل على روؤس النخل التي عن يمين الكرسي طواويس من ذهب ثم جعل على رؤوس النخل التي على يسار الكرسي نسورا من ذهب مقابلة الطواويس وجعل على يمين الدرجة الأولى شجرتي صنوبر من ذهب عن يسارها أسدان من ذهب وعلى رؤوس الأسدين عمودان من زبرجد وجعل من جانبي الكرسي شجرتي كرم من ذهب قد أظلتا الكرسي وجعل عناقيدهما درا وياقوتا أحمر ثم جعل فوق درج الكرسي أسدان عظيمان من ذهب مجوفان محشوان مسكا وعنبرا فإذا أراد سليمان عليه السلام أن يصعد على كرسيه استدار الأسدان ساعة ثم يقعان فينضحان ما في آجوافهما من المسك والعنبر حول كرسي سليمان عليه الصلاة والسلام ثم يوضع منبران من ذهب واحد لخليفته والآخر لرئيس أحبار بني إسرائيل ذلك الزمان ثم يوضع أمام كرسيه سبعون منبرا من ذهب يقعد عليها سبعون قاضيا من بنى إسرائيل وعلمائهم وأهل الشرف منهم والطول ومن خلف تلك المنابر كلها خمسة وثلاثون منبرا من ذهب ليس عليها أحد فإذا أراد أن يصعد على كرسيه وضع قدميه على الدرجة السفلى فاستدار الكرسي كله بما فيه وما عليه ويبسط الأسد يده اليمنى وينشر النسر جناحه الأيسر ثم يصعد عليه الصلاة والسلام على الدرجة الثانية فيبسط الأسد يده الأسد يده اليسرى وينشر النسر جناحه الأيمن فإذا استوى سليمان عليه الصلاة والسلام على الدرجة الثالثة وقعد على الكرسي أحذ نسر من تلك النسور عظيم تاج سليمان عليه الصلاة والسلام فوضعه على رأسه فإذا وضعه على رأسه استدار الكرسي بما فيه كما تدور الرحى المسرعة فقال معاوية رضي الله عنه وما الذي يديره يا أبا إسحاق ؟ قال تنين من ذهب ذلك الكرسي عليه وهو عظيم مما عمله صخر الجني فإذا أحست بدورانه دارت تلك الأسود والنسور والطواويس التي في أسفل الكرسي دون التي أعلاه فإذا وقف وقفن كلهن منكسات رؤوسهن على رأس سليمان عليه الصلاة والسلام وهو جالس ثم ينضحن جميعا ما في أجوافهن من المسك والعنبر على رأس سليمان بن داود عليهما الصلاة والسلام ثم تتناول حمامة من ذهب واقفة على عمود من جوهر التوراة فتجعلها في يده فيقرأها سليمان عليه الصلاة والسلام على الناس وذكر تمام الخبر وهو غريب جدا."
    },
    {
      "ayah": 35,
      "surah": 38,
      "text": "قال \"رب اغفر لي وهب لى ملكا لا ينبغي لأحد من بعدي إنك أنت الوهاب\" قال بعضهم معناه لا ينبغي لأحد من بعدي أي لا يصلح لأحد أن يسلبنيه بعدي كما كان من قضية الجسد الذي ألقي على كرسيه لا أنه يحجر على من بعده من الناس والصحيح أنه سأل من الله تعالى ملكا لا يكون لأحد من بعده من البشر مثله وهذا هو ظاهر السياق من الآية وبذلك وردت الأحاديث الصحيحة من طرق عن رسول الله صلى الله عليه وسلم قال البخاري عند تفسير هذه الآية حدثنا إسحاق بن إبراهيم أخبرنا روح ومحمد بن جعفر عن شعبة عن محمد بن زياد عن أبي هريرة رضي الله عنه عن النبي صلى الله عليه وسلم قال \"إن عفريتا من الجن تفلت علي البارحة- أو كلمة نحوها ليقطع علي الصلاة فأمكنني الله تبارك وتعالى منه وأردت أن أربطه إلى سارية من سواري المسجد حتى تصبحوا وتنظروا إليه كلكم فذكرت قول أخي سليمان عليه الصلاة والسلام \"رب اغفر لي وهب لي ملكا لا ينبغي لأحد من بعدي \" قال روح فرده خاسئا وكذا رواه مسلم والنسائي من حديث شعبة به وقال مسلم في صحيحه حدثنا محمد بن سلمة المرادي حدثنا عبدالله بن وهب عن معاوية بن صالح حدثني ربيعه بن يزيد عن أبي إدريس الخولاني عن أبي الدرداء رضي الله عنه قال قام رسول الله صلى الله عليه وسلم يصلي فسمعناه يقول \"أعوذ بالله منك - ثم قال ألعنك بلعنة الله \"ثلاثا وبسط يده كأنه يتناول شيئا فلما فرغ من الصلاة قلنا يا رسول الله سمعناك تقول في الصلاة شيئا لم نسمعك تقوله قبل ذلك ورأيناك بسطت يدك قال صلى الله عليه وسلم \"إن عدو الله إبليس جاء بشهاب من نار ليجعله في وجهي فقلت أعوذ بالله منك ثلاث مرات ثم قلت ألعنك بلعنة الله التامة فلم يستأخر ثلاث مرات ثم أردت أن آخذه والله لولا دعوة أخينا سليمان لأصبح موثقا يلعب به صبيان أهل المدينة \"وقال الإمام أحمد حدثنا أبو أحمد ثنا ميسرة بن معبد حدثنا أبو عبيد حاجب سليمان قال رأيت عطاء بن يزيد الليثي قائما يصلي فذهبت أمر بين يديه فردني ثم قال حدثني أبو سعيد الخدري رضي الله عنه أن رسول الله صلى الله عليه وسلم قام يصلى صلاة الصبح وهو خلفه فقرأ فالتبست عليه القراءة فلما فرغ من صلاته قال \"لو رأيتموني وإبليس فأهويت بيدي فما زلت أخنقه حتى وجدت برد لعابه بين أصبعي هاتين - الإبهام والتي تليها - ولولا دعوة أخي سليمان لأصبح مربوطا بسارية من سواري المسجد يتلاعب به صبيان المدينة فمن استطاع منكم أن لا يحول بينه وبين القبلة أحد فليفعل \"وقد روى أبو داود منه \" من استطاع منكم أن لا يحول بينه وبين القبلة أحد فليفعل \"عن أحمد بن أبي سريج عن أبي أحمد الزبيري به وقال الإمام أحمد حدثنا معاوية بن عمرو حدثنا إبراهيم بن محمد الفزاري حدثنا الأوزاعي حدثني ربيعة بن يزيد بن عبد الله الديلمي قال دخلت على عبد الله بن عمرو رضي الله عنهما وهو في حائط له بالطائف يقال له الوهط وهو مخاصر فتى من قريش يزن بشرب الخمر فقلت بلغني عنك حديث وأنه \" من شرب من الخمر لم يقبل الله عز وجل له توبة أربعين صباحا وأن الشقي من شقي في بطن أمه وأنه من أتى بيت المقدس لا تنهزه إلا الصلاة فيه خرج من خطيئته مثل يوم ولدته أمه \"فلما سمع الفتى ذكر الخمر اجتذب يده من يده ثم انطلق فقال عبد الله بن عمرو رضي الله عنهما إني لا أحل لأحد أن يقول علي ما لم أقل سمعت رسول الله صلى الله عليه وسلم يقول \" من شرب من الخمر شربة لا تقبل له صلاة أربعين صباحا فإن تاب تاب الله عليه فإن عاد لم تقبل له صلاة أربعين صباحا فإن تاب تاب الله عليه - قال فلا أدري في الثالثة أو الرابعة قال - فإن عاد كان حقا على الله تعالى أن يسقيه من طينة الخبال يوم القيامة \"قال وسمعت رسول الله صلى الله عليه وسلم يقول \" إن الله عز وجل خلق خلقه في ظلمة ثم ألقى عليهم من نوره فمن أصابه من نوره يومئذ اهتدى ومن أخطأه ضل فلذلك أقول جف القلم على علم الله عز وجل \" وسمعت رسول الله صلى الله عليه وسلم يقول \" إن سليمان عليه السلام سأل الله تعالى ثلاثا فأعطاه اثنتين ونحن نرجو أن تكون لنا الثالثة سأله حكما يصادف حكمه فأعطاه إياه وسأله ملكا لا ينبغي لأحد من بعده فأعطاه إياه وسأله أيما رجل خرج من بيته لا يريد إلا الصلاة في هذا المسجد خرج من خطيئته كيوم ولدته أمه فنحن نرجو أن يكون الله عز وجل قد أعطانا إياها \"وقد روى هذا الفصل الأخير من هذا الحديث النسائي وابن ماجه من طرق عن عبد الله بن فيروز الديلمي عن عبد الله بن عمر رضي الله عنهما قال: قال رسول الله صلى الله عليه وسلم \" إن سليمان عليه الصلاة والسلام لما بنى بيت المقدس سأل ربه عز وجل خلالا ثلاثا \"وذكره وقد روي من حديث رافع بن عمير رضي الله عنه بإسناد وسياق غريبين فقال الطبراني حدثنا محمد بن الحسن بن قتيبة العسقلاني حدثنا محمد بن أيوب بن سويد حدثني أبي حدثنا إبراهيم بن أبي عبلة عن أبي الزاهرية عن رافع بن عمير قال سمعت رسول الله صلى الله عليه وسلم يقول \" قال الله عز وجل لداود عليه الصلاة والسلام ابن لي بيتا في الأرض فبنى داود بيتا لنفسه قبل البيت الذي أمر به فأوحى الله إليه: يا داود نصبت بيتك قبل بيتي قال: يا رب هكذا قضيت من ملك استأثر ثم أخذ في بناء المسجد فلما تم السور سقط ثلاث فشكا ذلك إلى الله عز وجل فقال: يا داود إنك لا تصلح أن تبني لي بيتا قال: ولم يا رب ؟ قال: لما جرى على يديك من الدماء قال: يا رب أو ما كان ذلك في هواك ومحبتك ؟ قال: بلى ولكنهم عبادي وأنا أرحمهم فشق ذلك عليه فأوحى الله إليه: لا تحزن فإني سأقضي بناءه على يدي ابنك سليمان فلما مات داود أخذ سليمان في بنائه ولما تم قرب القرابين وذبح الذبائح وجمع بنى إسرائيل فأوحى الله إليه قد أرى سرورك ببنيان بيتي فسلني أعطك قال أسألك ثلاث خصال حكما يصادف حكمك وملكا لا ينبغي لأحد من بعدي ومن أتي هذا البيت لا يريد إلا الصلاة فيه خرج من ذنوبه كيوم ولدته أمه - قال رسول الله صلى الله عليه وسلم أما الثنتان فقد أعطيهما وأنا أرجو أن يكون قد أعطي الثالثة \"وقال الإمام أحمد حدثنا عبد الصمد حدثنا عمر بن راشد اليمامي حدثنا إياس بن سلمة بن الأكوع عن أبيه رضي الله عنه قال ما سمعت رسول الله صلى الله عليه وسلم دعا إلا استفتحه \" سبحان الله ربي العلي الأعلى الوهاب \"وقد قال أبو عبيد حدثنا علي بن ثابت عن جعفر بن برقان عن صالح بن مسمار قال: لما مات نبي الله داود عليه السلام أوحى الله تبارك وتعالى إلى ابنه سليمان عليه الصلاة والسلام أن سلني حاجتك قال: أسألك أن تجعل لي قلبا يخشاك كما كان قلب أبي وأن تجعل قلبي يحبك كما كان قلب أبي فقال الله عز وجل: أرسلت إلى عبدي وسألته حاجته فكانت حاجته أن أجعل قلبه يخشاني وأن أجعل قلبه يحبني لأهبن له ملكا لا ينبغي لأحد من بعده."
    },
    {
      "ayah": 36,
      "surah": 38,
      "text": "قال الله جلت عظمته: \" فسخرنا له الريح تجري بأمره رخاء حيث أصاب\" - والتي بعدى - قال فأعطاه ما أعطاه وفي الآخرة لا حساب عليه.هكذا أورده أبو القاسم بن عساكر في ترجمة سليمان عليه الصلاة والسلام في تاريخه 0 وروي عن بعض السلف أنه قال: بلغن عن داود عليه الصلاة والسلام أنه قال إلهي كن لسليمان كما كنت لي فأوحى الله عز وجل إليه: أن قل لسليمان أن يكون لي كما كنت لي أكن له كما كنت لك وقوله تبارك وتعالى \"فسخرنا له الريح تجري بأمره رخاء حيث أصاب\" قال الحسن البصري رحمه الله لما عقر سليمان عليه الصلاة والسلام الخيل غضبا لله عز وجل عوضه الله تعالى ما هو خير منها وأسرع الريح التي غدوها شهر ورواحها شهر وقوله جل وعلا \"حيث أصاب\" أي حيث أراد من البلاد."
    },
    {
      "ayah": 37,
      "surah": 38,
      "text": "قوله جل جلاله \"والشياطين كل بناء وغواص\" أي منهم من هو مستعمل في الأبنية الهائلة من محاريب وتماثيل وجفان كالجواب وقدور راسيات إلى غير ذلك من الأعمال الشاقة التي لا يقدر عليها البشر وطائفة غواصون في البحار يستخرجون ما فيها من اللآلئ والجواهر والأشياء النفيسة التي لا توجد إلا فيها \"وآخرين مقرنين في الأصفاد\" أي موثقون في الأغلال والأكبال ممن فد تمرد وعصى وامتنع من العمل وأبى أو قد أساء في صنيعه واعتدى."
    },
    {
      "ayah": 38,
      "surah": 38,
      "text": "قوله جل جلاله \"والشياطين كل بناء وغواص\" أي منهم من هو مستعمل في الأبنية الهائلة من محاريب وتماثيل وجفان كالجواب وقدور راسيات إلى غير ذلك من الأعمال الشاقة التي لا يقدر عليها البشر وطائفة غواصون في البحار يستخرجون ما فيها من اللآلئ والجواهر والأشياء النفيسة التي لا توجد إلا فيها \"وآخرين مقرنين في الأصفاد\" أي موثقون في الأغلال والأكبال ممن فد تمرد وعصى وامتنع من العمل وأبى أو قد أساء في صنيعه واعتدى."
    },
    {
      "ayah": 39,
      "surah": 38,
      "text": "وقوله عز وجل \"هذا عطاؤنا فامنن أو أمسك بغير حساب\" أي هذا الذي أعطيناك من الملك التام والسلطان الكامل كما سألتنا فأعط من شئت واحرم من شئت لا حساب عليك أى مهما فعلت فهو جائز لك احكم بما شئت فهو صواب وقد ثبت في الصحيحين أن رسول الله صلى الله عليه وسلم لما خير بين أن يكون عبدا رسولا- وهو الذي يفعل ما يؤمر به وإنما هو قاسم يقسم بين الناس كما أمره الله تعالى به- وبين أن يكون نبيا ملكا يعطي من يشاء ويمنع من يشاء بلا حساب ولا جناح: اختار المنزلة الأولى بعدما استشار جبريل عليه الصلاة والسلام فقال له تواضع فاختار المنزلة الأولى لأنها أرفع قدرا عند الله عز وجل وأعلى منزلة في المعاد وإن كانت المنزلة الثانية وهي النبوة مع الملك عظيمة أيضا في الدنيا والآخرة ولهذا لما ذكر تبارك وتعالى ما أعطى سليمان عليه الصلاة والسلام في الدنيا نبه تعالى على أنه ذو حظ عظيم عند الله يوم القيامة أيضا."
    },
    {
      "ayah": 4,
      "surah": 38,
      "text": "يقول تعالى مخبرا عن المشركين في تعجيهم من بعثة رسول الله صلى الله عليه وسلم بشيرا نذيرا كما قال عز وجل \"أكان للناس عجبا أن أوحينا إلى رجل منهم أن أنذر الناس وبشر الذين آمنوا أن لهم قدم صدق عند ربهم قال الكافرون إن هذا لساحر مبين \" وقال جل وعلا ههنا \"وعجبوا أن جاءهم منذر منهم\" أي بشر مثلهم وقال الكافرون \"هذا ساحر كذاب\"."
    },
    { "ayah": 40, "surah": 38, "text": "قال تعالى \"وإن له عندنا لزلفى وحسن مآب\" أي في الدار والآخرة." },
    {
      "ayah": 41,
      "surah": 38,
      "text": "يذكر تبارك وتعالى عبده ورسوله أيوب عليه الصلاة والسلام وما كان ابتلاه تعالى به من الضر في جسده وماله وولده حتى لم يبق من جسده مغرز إبرة سليما سوى قلبه ولم يبق له من الدنيا شيء يستعين به على مرضه وما هو فيه غير أن زوجته حفظت وده لإيمانها بالله تعالى ورسوله فكات تخدم الناس بالأجرة وتطعمه وتخدمه نحوا من ثماني عشرة سنة وقد كان قبل ذلك في مال جزيل وأولاد وسعة طائله من الدنيا فسلب جميع ذلك حتى آل به الحال إلى أن ألقي على مزبلة من مزابل البلدة هذه المدة بكمالها ورفضه القريب والبعيد سوى زوجته رضي الله عنها فإنها كانت لا مفارقه صباحا ومساء إلا بسبب خدمة الناس ثم تعود إليه قريبا فلما طال المطال واشتد الحال وانتهى القدر وتم الأجل المقدر تضرع إلى رب العالمين وإله المرسلين فقال \"إني مسني الضر وأنت أرحم الراحمين\" وفي هذه الآية الكريمة قال \"واذكر عبدنا أيوب إذ نادى ربه أني مسني الشيطان بنصب وعذاب \" قيل بنصب في بدني وعذاب في مالي وولدي فعند ذلك استجاب له أرحم الراحمين وأمره أن يقوم من مقامه وأن يركض الأرض برجله ففعل فأنبع الله تعالى عينا وأمره أن يغتسل منها فأذهبت جميع ما كان في بدنه من الأذى ثم أمره فضرب الأرض فى مكان آخر فأنبع له عينا أخرى وأمره أن يشرب منها فأذهبت جميع ما كان في باطنه من السوء وتكاملت العافية ظاهرا وباطنا ولهذا قال تبارك وتعالى \"اركض برجلك هذا مغتسل بارد وشراب \" قال ابن جرير وابن أبي حاتم جميعا حدثنا يونس بن عبد الأعلى أخبرنا ابن وهب أخبرني نافع بن يزيد عن عقيل عن ابن شهاب عن أنس بن مالك رضي الله عنه قال: إن رسول الله صلى الله عليه وسلم قال: \" إن نبي الله أيوب عليه الصلاة والسلام لبث به بلاؤه ثماني عشرة سنة فرفضه القريب والبعيد إلا رجلين كانا من أخص إخوانه به كانا يغدوان إليه ويروحان فقال أحدهما لصاحبه تعلم والله لقد أذنب أيوب ذنبا ما أذنبه أحد من العالمين قال له صاحبه وما ذاك ؟ قال منذ ثماني عشرة سنة لم يرحمه الله تعالى فيكشف ما به فلما راحا إليه لم يصبر الرجل حتى ذكر ذلك له فقال أيوب عليه الصلاة والسلام لا أدري ما تقول غير أن الله عز وجل يعلم أني كنت أمر على الرجلين يتنازعان فيذكران الله تعالى فأرجع إلى بيتي فأكفر عنهما كراهية أن يذكر الله تعالى إلا في حق وقال وكان يخرج إلى حاجته فإذا قضاها أمسكت امرأته بيده حتى يبلغ فلما كان ذات يوم أبطأ عليها فأوحى الله تبارك وتعالى إلى أيوب عليه الصلاة والسلام \"أن اركض برجلك هذا مغتسل بارد وشراب\" فاستبطأته فالتفتت تنظر فأقبل عليها قد أذهب الله ما به من البلاء وهو على أحسن ما كان فلما رأته قالت أي بارك الله فيك هل رأيت نبي الله هذا المبتلى ؟ فوالله القدير على ذلك ما رأيت رجلا أشبه به منك إذ كان صحيحا قال فإني أنا هو قال وكان له أنذران أندر للقمح وأندر للشعير فبعث الله تعالى سحابتين فلما كانت إحداهما على أندر القمح أفرغت فيه الذهب حتى فاض وأفرغت الأخرى في أندر الشعير حتى فاض \"هذا لفظ ابن جرير رحمه الله وقال الإمام أحمد حدثنا عبد الرزاق حدثنا معمر عن همام بن منبه قال: هذا ما حدثنا أبو هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم \" بينما أيوب يغتسل عريانا خر عليه جراد من ذهب فجعل أيوب عليه الصلاة والسلام يحثو في ثوبه فناداه ربه عز وجل يا أيوب ألم أكن أغنيتك عما ترى قال عليه الصلاة والسلام بلى يا رب ولكن لا غنى بي عن بركتك \"انفرد بإخراجه البخاري من حديث عبد الرزاق به ولهذا قال تبارك وتعالى \"ووهبنا له أهله ومثلهم معهم رحمة منا وذكرى لأولي الألباب\" قال الحسن وقتادة أحياهم الله تعالى له بأعيانهم وزادهم مثلهم معهم وقوله عز وجل \"رحمة منا\" أي به على صبره وثباته وإنابته وتواضعه واستكانته \"وذكرى لأولي الألباب\" أي لذوي العقول ليعلموا أن عاقبة الصبر الفرج والمخرج والراحة."
    },
    {
      "ayah": 42,
      "surah": 38,
      "text": "يذكر تبارك وتعالى عبده ورسوله أيوب عليه الصلاة والسلام وما كان ابتلاه تعالى به من الضر في جسده وماله وولده حتى لم يبق من جسده مغرز إبرة سليما سوى قلبه ولم يبق له من الدنيا شيء يستعين به على مرضه وما هو فيه غير أن زوجته حفظت وده لإيمانها بالله تعالى ورسوله فكات تخدم الناس بالأجرة وتطعمه وتخدمه نحوا من ثماني عشرة سنة وقد كان قبل ذلك في مال جزيل وأولاد وسعة طائله من الدنيا فسلب جميع ذلك حتى آل به الحال إلى أن ألقي على مزبلة من مزابل البلدة هذه المدة بكمالها ورفضه القريب والبعيد سوى زوجته رضي الله عنها فإنها كانت لا مفارقه صباحا ومساء إلا بسبب خدمة الناس ثم تعود إليه قريبا فلما طال المطال واشتد الحال وانتهى القدر وتم الأجل المقدر تضرع إلى رب العالمين وإله المرسلين فقال \"إني مسني الضر وأنت أرحم الراحمين\" وفي هذه الآية الكريمة قال \"واذكر عبدنا أيوب إذ نادى ربه أني مسني الشيطان بنصب وعذاب \" قيل بنصب في بدني وعذاب في مالي وولدي فعند ذلك استجاب له أرحم الراحمين وأمره أن يقوم من مقامه وأن يركض الأرض برجله ففعل فأنبع الله تعالى عينا وأمره أن يغتسل منها فأذهبت جميع ما كان في بدنه من الأذى ثم أمره فضرب الأرض فى مكان آخر فأنبع له عينا أخرى وأمره أن يشرب منها فأذهبت جميع ما كان في باطنه من السوء وتكاملت العافية ظاهرا وباطنا ولهذا قال تبارك وتعالى \"اركض برجلك هذا مغتسل بارد وشراب \" قال ابن جرير وابن أبي حاتم جميعا حدثنا يونس بن عبد الأعلى أخبرنا ابن وهب أخبرني نافع بن يزيد عن عقيل عن ابن شهاب عن أنس بن مالك رضي الله عنه قال: إن رسول الله صلى الله عليه وسلم قال: \" إن نبي الله أيوب عليه الصلاة والسلام لبث به بلاؤه ثماني عشرة سنة فرفضه القريب والبعيد إلا رجلين كانا من أخص إخوانه به كانا يغدوان إليه ويروحان فقال أحدهما لصاحبه تعلم والله لقد أذنب أيوب ذنبا ما أذنبه أحد من العالمين قال له صاحبه وما ذاك ؟ قال منذ ثماني عشرة سنة لم يرحمه الله تعالى فيكشف ما به فلما راحا إليه لم يصبر الرجل حتى ذكر ذلك له فقال أيوب عليه الصلاة والسلام لا أدري ما تقول غير أن الله عز وجل يعلم أني كنت أمر على الرجلين يتنازعان فيذكران الله تعالى فأرجع إلى بيتي فأكفر عنهما كراهية أن يذكر الله تعالى إلا في حق وقال وكان يخرج إلى حاجته فإذا قضاها أمسكت امرأته بيده حتى يبلغ فلما كان ذات يوم أبطأ عليها فأوحى الله تبارك وتعالى إلى أيوب عليه الصلاة والسلام \"أن اركض برجلك هذا مغتسل بارد وشراب\" فاستبطأته فالتفتت تنظر فأقبل عليها قد أذهب الله ما به من البلاء وهو على أحسن ما كان فلما رأته قالت أي بارك الله فيك هل رأيت نبي الله هذا المبتلى ؟ فوالله القدير على ذلك ما رأيت رجلا أشبه به منك إذ كان صحيحا قال فإني أنا هو قال وكان له أنذران أندر للقمح وأندر للشعير فبعث الله تعالى سحابتين فلما كانت إحداهما على أندر القمح أفرغت فيه الذهب حتى فاض وأفرغت الأخرى في أندر الشعير حتى فاض \"هذا لفظ ابن جرير رحمه الله وقال الإمام أحمد حدثنا عبد الرزاق حدثنا معمر عن همام بن منبه قال: هذا ما حدثنا أبو هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم \" بينما أيوب يغتسل عريانا خر عليه جراد من ذهب فجعل أيوب عليه الصلاة والسلام يحثو في ثوبه فناداه ربه عز وجل يا أيوب ألم أكن أغنيتك عما ترى قال عليه الصلاة والسلام بلى يا رب ولكن لا غنى بي عن بركتك \"انفرد بإخراجه البخاري من حديث عبد الرزاق به ولهذا قال تبارك وتعالى \"ووهبنا له أهله ومثلهم معهم رحمة منا وذكرى لأولي الألباب\" قال الحسن وقتادة أحياهم الله تعالى له بأعيانهم وزادهم مثلهم معهم وقوله عز وجل \"رحمة منا\" أي به على صبره وثباته وإنابته وتواضعه واستكانته \"وذكرى لأولي الألباب\" أي لذوي العقول ليعلموا أن عاقبة الصبر الفرج والمخرج والراحة."
    },
    {
      "ayah": 43,
      "surah": 38,
      "text": "يذكر تبارك وتعالى عبده ورسوله أيوب عليه الصلاة والسلام وما كان ابتلاه تعالى به من الضر في جسده وماله وولده حتى لم يبق من جسده مغرز إبرة سليما سوى قلبه ولم يبق له من الدنيا شيء يستعين به على مرضه وما هو فيه غير أن زوجته حفظت وده لإيمانها بالله تعالى ورسوله فكات تخدم الناس بالأجرة وتطعمه وتخدمه نحوا من ثماني عشرة سنة وقد كان قبل ذلك في مال جزيل وأولاد وسعة طائله من الدنيا فسلب جميع ذلك حتى آل به الحال إلى أن ألقي على مزبلة من مزابل البلدة هذه المدة بكمالها ورفضه القريب والبعيد سوى زوجته رضي الله عنها فإنها كانت لا مفارقه صباحا ومساء إلا بسبب خدمة الناس ثم تعود إليه قريبا فلما طال المطال واشتد الحال وانتهى القدر وتم الأجل المقدر تضرع إلى رب العالمين وإله المرسلين فقال \"إني مسني الضر وأنت أرحم الراحمين\" وفي هذه الآية الكريمة قال \"واذكر عبدنا أيوب إذ نادى ربه أني مسني الشيطان بنصب وعذاب \" قيل بنصب في بدني وعذاب في مالي وولدي فعند ذلك استجاب له أرحم الراحمين وأمره أن يقوم من مقامه وأن يركض الأرض برجله ففعل فأنبع الله تعالى عينا وأمره أن يغتسل منها فأذهبت جميع ما كان في بدنه من الأذى ثم أمره فضرب الأرض فى مكان آخر فأنبع له عينا أخرى وأمره أن يشرب منها فأذهبت جميع ما كان في باطنه من السوء وتكاملت العافية ظاهرا وباطنا ولهذا قال تبارك وتعالى \"اركض برجلك هذا مغتسل بارد وشراب \" قال ابن جرير وابن أبي حاتم جميعا حدثنا يونس بن عبد الأعلى أخبرنا ابن وهب أخبرني نافع بن يزيد عن عقيل عن ابن شهاب عن أنس بن مالك رضي الله عنه قال: إن رسول الله صلى الله عليه وسلم قال: \" إن نبي الله أيوب عليه الصلاة والسلام لبث به بلاؤه ثماني عشرة سنة فرفضه القريب والبعيد إلا رجلين كانا من أخص إخوانه به كانا يغدوان إليه ويروحان فقال أحدهما لصاحبه تعلم والله لقد أذنب أيوب ذنبا ما أذنبه أحد من العالمين قال له صاحبه وما ذاك ؟ قال منذ ثماني عشرة سنة لم يرحمه الله تعالى فيكشف ما به فلما راحا إليه لم يصبر الرجل حتى ذكر ذلك له فقال أيوب عليه الصلاة والسلام لا أدري ما تقول غير أن الله عز وجل يعلم أني كنت أمر على الرجلين يتنازعان فيذكران الله تعالى فأرجع إلى بيتي فأكفر عنهما كراهية أن يذكر الله تعالى إلا في حق وقال وكان يخرج إلى حاجته فإذا قضاها أمسكت امرأته بيده حتى يبلغ فلما كان ذات يوم أبطأ عليها فأوحى الله تبارك وتعالى إلى أيوب عليه الصلاة والسلام \"أن اركض برجلك هذا مغتسل بارد وشراب\" فاستبطأته فالتفتت تنظر فأقبل عليها قد أذهب الله ما به من البلاء وهو على أحسن ما كان فلما رأته قالت أي بارك الله فيك هل رأيت نبي الله هذا المبتلى ؟ فوالله القدير على ذلك ما رأيت رجلا أشبه به منك إذ كان صحيحا قال فإني أنا هو قال وكان له أنذران أندر للقمح وأندر للشعير فبعث الله تعالى سحابتين فلما كانت إحداهما على أندر القمح أفرغت فيه الذهب حتى فاض وأفرغت الأخرى في أندر الشعير حتى فاض \"هذا لفظ ابن جرير رحمه الله وقال الإمام أحمد حدثنا عبد الرزاق حدثنا معمر عن همام بن منبه قال: هذا ما حدثنا أبو هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم \" بينما أيوب يغتسل عريانا خر عليه جراد من ذهب فجعل أيوب عليه الصلاة والسلام يحثو في ثوبه فناداه ربه عز وجل يا أيوب ألم أكن أغنيتك عما ترى قال عليه الصلاة والسلام بلى يا رب ولكن لا غنى بي عن بركتك \"انفرد بإخراجه البخاري من حديث عبد الرزاق به ولهذا قال تبارك وتعالى \"ووهبنا له أهله ومثلهم معهم رحمة منا وذكرى لأولي الألباب\" قال الحسن وقتادة أحياهم الله تعالى له بأعيانهم وزادهم مثلهم معهم وقوله عز وجل \"رحمة منا\" أي به على صبره وثباته وإنابته وتواضعه واستكانته \"وذكرى لأولي الألباب\" أي لذوي العقول ليعلموا أن عاقبة الصبر الفرج والمخرج والراحة."
    },
    {
      "ayah": 44,
      "surah": 38,
      "text": "قوله جلت عظمته \"وخذ بيدك ضغط فاضرب به ولا تحنث\" وذلك أن أيوب عليه الصلاة والسلام كان قد غضب على زوجته ووجد عليها في أمر فعلته قيل باعت ضفيرتها بخبز فأطعمته إياه فلامها على ذلك وحلف إن شفاه الله تعالى ليضربنها مائة جلدة وقيل لغير ذلك من الأسباب فلما شفاه الله عز وجل وعافاه ما كان جزاؤها مع هذه الخدمة التامة والرحمة والشفقة والإحسان أن تقابل بالضرب فأفتاه الله عز وجل أن يأخذ ضغثا وهو الشمراخ فيه مائة قضيب فيضربها به ضربة واحدة وقد برت يمينه وخرج من حنثه ووفى بنذره وهذا من الفرج والمخرج لمن اتقى الله تعالى وأناب إليه ولهذا قال جل وعلا \"إنا وجدناه صابرا نعم العبد إنه أواب\" أثنى الله تعالى عليه ومدحه بأنه \" نعم العبد إنه أواب\" أي رجاع منيب ولهذا قال جل جلاله \"ومن يتق الله يجعل له مخرجا ويرزقه من حيث لا يحتسب ومن يتوكل على الله فهو حسبه إن الله بالغ أمره قد جعل الله لكل شيء قدرا \" واستدل كثير من الفقهاء بهذه الآية الكريمة على مسائل في الأيمان وغيرى وقد أخذوها بمقتضاها والله أعلم بالصواب."
    },
    {
      "ayah": 45,
      "surah": 38,
      "text": "يقول تبارك وتعالى مخبرا عن فضائل عباده المرسلين وأنبيائه العابدين \" واذكر عبادنا إبراهيم وإسحاق ويعقوب أولى الأيدي والأبصار\" يعني بذلك العمل الصالح والعلم النافع والقوة في العبادة والبصيرة النافذة قال علي بن أبي طلحة عن ابن عباس رضي الله عنهما \"أولي الأيدي \" يقول أولي القوة \"والأبصار\" يقول الفقه في الدين وقال مجاهد \"أولي الأيدي\" يعني القوة في طاعة الله تعالى والأبصار يعني البصر في الحق وقال قتادة والسدي أعطوا قوة في العبادة وبصرا في الدين."
    },
    {
      "ayah": 46,
      "surah": 38,
      "text": "وقوله تبارك وتعالى \"إنا أخلصناهم بخالصة ذكرى الدار\" قال مجاهد أي جعلناهم يعملون للآخرة ليس لهم هم غيرها وكذا قال السدي ذكرهم للآخرة وعملهم لها وقال مالك بن دينار نزع الله تعالى من قلوبهم حب الدنيا وذكرها وأخلصهم بحب الآخرة وذكرها وكذا قال عطاء الخراساني وقال سعيد بن جبير يعني بالدار الجنة يقول أخلصناها لهم بذكرهم لها وقال في رواية أخرى ذكرى الدار عقبى الدار وقال قتادة كانوا يذكرون الناس الدار الآخرة والعمل لها وقال ابن زيد جعل لهم خاصة أفضل شيء في الدار الآخرة."
    },
    {
      "ayah": 47,
      "surah": 38,
      "text": "وقوله تعالى \"وإنهم عندنا لمن المصطفين الأخيار\" أي لمن المختارين المجتبين الأخيار فهم أخيار مختارون."
    },
    {
      "ayah": 48,
      "surah": 38,
      "text": "وقوله تعالى \"واذكر إسماعيل واليسع وذا الكفل\" وكل من الأخيار قد تقدم الكلام على قصصهم وأخبارهم مستقصاة في سورة الأنبياء عليهم الصلاة والسلام بما أغنى عن إعادته ههنا وقوله عز وجل."
    },
    { "ayah": 49, "surah": 38, "text": "\"هذا ذكر\" أي هذا فصل فيه ذكر لمن يتذكر وقال السدي يعني القرآن العظيم." },
    {
      "ayah": 5,
      "surah": 38,
      "text": "\"أجعل الآلهة إلها واحدا\" أي أزعم أن المعبود واحد لا إله إلا هو؟ أنكر المشركون ذلك قبحهم الله تعالى وتعجبوا من ترك الشرك بالله فإنهم قد تلقوا عن آبائهم عبادة الأوثان وأشربته قلوبهم فلما دعاهم الرسول صلى الله عليه وسلم إلى خلع ذلك من قلوبهم وإفراد الإله بالوحدانية أعظموا ذلك وتعجبوا وقالوا \"أجعل الآلهة إلها واحدا إن هذا لشيء عجاب\"."
    },
    {
      "ayah": 50,
      "surah": 38,
      "text": "يخبر تعالى عن عباده المؤمنين السعداء أن لهم في الدار الآخرة لحسن مآب وهو المرجع والمنقلب ثم فسره بقوله تعالى \"جنات عدن\" أي جنات إقامة مفتحة لهم الأبواب والألف واللام ههنا الإضافة كأنه يقول مفتحة لهم أبوابها أي إذا جاءوها فتحت لهم أبوابها قال ابن أبي حاتم حدثنا محمد بن ثواب الهباري حدثنا عبدالله بن نمير حدثنا عبدالله بن مسلم يعني ابن هرمز عن ابن سابط عن عبدالله بن عمرو رضي الله عنهما قال: قال رسول الله صلى الله عليه وسلم \"إن في الجنة قصرا يقال له عدن حوله البروج والمروج له خمسة آلاف باب عند كل باب خمسة آلاف حبرة لا يدخله - أو لا يسكنه - إلا نبي أو صديق أو شهيد أو أمام عدل\" وقد رود في ذكر أبواب الجنة الثمانية أحاديث كثيرة من وجوه عديدة."
    },
    {
      "ayah": 51,
      "surah": 38,
      "text": "قوله عز وجل \"متكئين فيها\" قيل متربعين على سرر تحت الحجال \"يدعون فيها بفاكهة كثيرة\" أي مهما طلبوا وجدوا وأحضر كما أرادو \"وشراب\" أي من أي أنواعه شاءوا أتتهم به الخدام \"بأكواب وأباريق وكأس من معين\"."
    },
    {
      "ayah": 52,
      "surah": 38,
      "text": "\"وعندهم قاصرات الطرف\" أي عن غير أزواجهن فلا يلتفن إلى غير بعولتهن \"أتراب\" أي متساويات في السن والعمر هذا معنى قول ابن عباس رضي الله عنهما ومجاهد وسعيد بن جبير ومحمد بن كعب والسدي."
    },
    {
      "ayah": 53,
      "surah": 38,
      "text": "\"هذا ما توعدون ليوم الحساب\" أي هذا الذي ذكرنا من صفة الجنة هي التي وعدها لعباده المتقين التي يصيرون إليها بعد نشوزهم وقيامهم من قبورهم وسلامتهم من النار ثم أخبر تبارك وتعالى عن الجنة أنه فراغ لها ولا زوال ولا أنقضاء ولا أنتهاء فقال تعالى \"إن هذا لرزقنا ماله من نفاد\" كقوله عز وجل \"ما عندكم ينفد وما عند اللّه باق\" وكقوله جل وعلا \"عطاء غير مجذوذ\" وكقوله تعالى \"لهم أجر غير منمون\" أي غير مقطوع وكقوله عز وجل \"أكلها دائم وظلها تلك عقبى الذين أتقوا وعقبى الكافرين النار\" والآيات في هذا كثيرة جدا."
    },
    {
      "ayah": 54,
      "surah": 38,
      "text": "\"هذا ما توعدون ليوم الحساب\" أي هذا الذي ذكرنا من صفة الجنة هي التي وعدها لعباده المتقين التي يصيرون إليها بعد نشوزهم وقيامهم من قبورهم وسلامتهم من النار ثم أخبر تبارك وتعالى عن الجنة أنه فراغ لها ولا زوال ولا أنقضاء ولا أنتهاء فقال تعالى \"إن هذا لرزقنا ماله من نفاد\" كقوله عز وجل \"ما عندكم ينفد وما عند اللّه باق\" وكقوله جل وعلا \"عطاء غير مجذوذ\" وكقوله تعالى \"لهم أجر غير منمون\" أي غير مقطوع وكقوله عز وجل \"أكلها دائم وظلها تلك عقبى الذين أتقوا وعقبى الكافرين النار\" والآيات في هذا كثيرة جدا."
    },
    {
      "ayah": 55,
      "surah": 38,
      "text": "لما ذكر تبارك وتعالى مآل السعداء ثنى بذكر حال الأشقياء ومرجعهم ومآبهم فى دار معادهم وحسابهم فقال عز وجل \"هذا وإن للطاغين\" وهم الخارجون عن طاعة اللّه عز وجل المخالفون لرسل اللّه صلى الله عليه وسلم \"لشر مآب \" أي لسوء منقلب ومرجع ثم فسره بقوله جل وعلا \"جهنم يصلونها\" أي يدخلونها فتغمرهم من جميع جوانبهم \" فبئس المهاد هذا فليذوقوه حميم وغساق\" أم الحميم فهو الحار الذي قد أنتهى حره وأما الغساق فهو ضده وهو البارد الذي لا يستطاع من شدة برده المؤلم ولهذا قال عز وجل \"وآخر من شكله أزواج\" أي وأشياء من هذا القبيل: الشيء وضده يعاقبون بها قال الإمام أحمد حدثنا حسن بن موسى حدثنا ابن لهيعة حدثنا دراج عن أبي الهيثم عن أبي سعيد رضي الله عنه عن رسول اللّه صلى الله عليه وسلم أنه قال \"لو أن دلوا من غساق يهراق في الدنيا لأنتن أهل الدنيا\" ورواه الترمذي عن سويد بن نصر عن ابن المبارك عن رشدين بن سعد عن عمرو بن الحارث عن دراج به ثم قال لا نعرفه إلا من حديث رشدين كذا قال وقد تقدم من غير حديثه ورواه ابن جرير عن يونس بن عبد الأعلى عن ابن وهب عن عمرو بن الحارث به. وقال كعب الأحبار: غساق عين في جهنم يسيل إليها حمة كل ذات حمة من حية وعقرب وغير ذلك فيستنقع فيؤتي بالآدمي فيغمس فيها غمسة واحدة فيخرج وقد سقط جلده ولحمه عن العظام ويتعلق جلده ولحمه في كعبيه وعقبيه ويجر لحمه كله كما يجر الرجل ثوبه رواه ابن أبي حاتم."
    },
    {
      "ayah": 56,
      "surah": 38,
      "text": "لما ذكر تبارك وتعالى مآل السعداء ثنى بذكر حال الأشقياء ومرجعهم ومآبهم فى دار معادهم وحسابهم فقال عز وجل \"هذا وإن للطاغين\" وهم الخارجون عن طاعة اللّه عز وجل المخالفون لرسل اللّه صلى الله عليه وسلم \"لشر مآب \" أي لسوء منقلب ومرجع ثم فسره بقوله جل وعلا \"جهنم يصلونها\" أي يدخلونها فتغمرهم من جميع جوانبهم \" فبئس المهاد هذا فليذوقوه حميم وغساق\" أم الحميم فهو الحار الذي قد أنتهى حره وأما الغساق فهو ضده وهو البارد الذي لا يستطاع من شدة برده المؤلم ولهذا قال عز وجل \"وآخر من شكله أزواج\" أي وأشياء من هذا القبيل: الشيء وضده يعاقبون بها قال الإمام أحمد حدثنا حسن بن موسى حدثنا ابن لهيعة حدثنا دراج عن أبي الهيثم عن أبي سعيد رضي الله عنه عن رسول اللّه صلى الله عليه وسلم أنه قال \"لو أن دلوا من غساق يهراق في الدنيا لأنتن أهل الدنيا\" ورواه الترمذي عن سويد بن نصر عن ابن المبارك عن رشدين بن سعد عن عمرو بن الحارث عن دراج به ثم قال لا نعرفه إلا من حديث رشدين كذا قال وقد تقدم من غير حديثه ورواه ابن جرير عن يونس بن عبد الأعلى عن ابن وهب عن عمرو بن الحارث به. وقال كعب الأحبار: غساق عين في جهنم يسيل إليها حمة كل ذات حمة من حية وعقرب وغير ذلك فيستنقع فيؤتي بالآدمي فيغمس فيها غمسة واحدة فيخرج وقد سقط جلده ولحمه عن العظام ويتعلق جلده ولحمه في كعبيه وعقبيه ويجر لحمه كله كما يجر الرجل ثوبه رواه ابن أبي حاتم."
    },
    {
      "ayah": 57,
      "surah": 38,
      "text": "لما ذكر تبارك وتعالى مآل السعداء ثنى بذكر حال الأشقياء ومرجعهم ومآبهم فى دار معادهم وحسابهم فقال عز وجل \"هذا وإن للطاغين\" وهم الخارجون عن طاعة اللّه عز وجل المخالفون لرسل اللّه صلى الله عليه وسلم \"لشر مآب \" أي لسوء منقلب ومرجع ثم فسره بقوله جل وعلا \"جهنم يصلونها\" أي يدخلونها فتغمرهم من جميع جوانبهم \" فبئس المهاد هذا فليذوقوه حميم وغساق\" أم الحميم فهو الحار الذي قد أنتهى حره وأما الغساق فهو ضده وهو البارد الذي لا يستطاع من شدة برده المؤلم ولهذا قال عز وجل \"وآخر من شكله أزواج\" أي وأشياء من هذا القبيل: الشيء وضده يعاقبون بها قال الإمام أحمد حدثنا حسن بن موسى حدثنا ابن لهيعة حدثنا دراج عن أبي الهيثم عن أبي سعيد رضي الله عنه عن رسول اللّه صلى الله عليه وسلم أنه قال \"لو أن دلوا من غساق يهراق في الدنيا لأنتن أهل الدنيا\" ورواه الترمذي عن سويد بن نصر عن ابن المبارك عن رشدين بن سعد عن عمرو بن الحارث عن دراج به ثم قال لا نعرفه إلا من حديث رشدين كذا قال وقد تقدم من غير حديثه ورواه ابن جرير عن يونس بن عبد الأعلى عن ابن وهب عن عمرو بن الحارث به. وقال كعب الأحبار: غساق عين في جهنم يسيل إليها حمة كل ذات حمة من حية وعقرب وغير ذلك فيستنقع فيؤتي بالآدمي فيغمس فيها غمسة واحدة فيخرج وقد سقط جلده ولحمه عن العظام ويتعلق جلده ولحمه في كعبيه وعقبيه ويجر لحمه كله كما يجر الرجل ثوبه رواه ابن أبي حاتم."
    },
    {
      "ayah": 58,
      "surah": 38,
      "text": "وقال الحسن البصري في قوله تعالى \"وآخر من شكله أزواج\" ألوان من العذاب وقال غيره كالزمهرير والسموم وشرب الحميم وأكل الزقوم والصعود والهوى إلى غير ذلك من الأشياء المختلفة المتضادة والجميع مما يعذبون به ويهانون بسبب وقوله عز وجل \"هذا فوج مقتحم معكم لا مرحبا بهم إنهم صالوا النار \" هذا إخبار من اللّه تعالى عن قيل أهل النار بعضهم لبعض كما قال تعالى \"كلما دخلت أمة لعنت أختها \" يعني بدل السلام يتلاعنون ويتكاذبون ويكفر بعضهم ببعض فتقول الطائفة التي تدخل قبل الأخرى إذا أقبلت التي بعدها مع الخزنة من الزبانية \"هذا فوج مقتحم \" أي \"داخل معكم لا مرحبا بهم إنهم صالوا النار\" أي لأنهم من أهل جهنم \"قالوا بل أنتم لا مرحبا بكم \" أي فيقول لهم الداخلون \"بل أنتم لا مرحبا بكم أنتم قدمتموه لنا\" أي أنتم دعوتمونا إلى ما أفضى بنا إلى هذا المصير \" فبئس القرار \" أي فبئس المنزل والمستقر والمصير قالوا \" ربنا من قدم لنا هذا فزده عذابا ضعفا في النار\" كما قال عز وجل \" قالت أخراهم لأولاهم ربنا هؤلاء أضلونا فآتهم عذابا ضعفا من النار قال لكل ضعف ولكن لا تعلمون\" أي لكل منكم عذاب بحسبه \" وقالوا ما لنا لا نرى رجالا كنا نعدهم من الأشرار أتخذناهم سخريا أم زاغت عنهم الأبصار\" هكذا إخبار عن الكفار في النار أنهم يفتقدون رجالا كانوا يعتقدون أنهم على الضلالة وهم المـؤمنون في زعمهم قالوا مالنا لا نراهم معنا في النار ؟ قال مجاهد هذا قول أبي جهل يقول مالي لا أرى بلالا وعمارا وصهيبا وفلانا وفلانا. وهذا ضرب مثل وإلا فكل الكفار هذا حالهم يعقدون أن المؤمنين يدخلون النار فلما دخل الكفار النار افتقدوهم فلم يجدوهم فقالوا \"ما لنا لا نرى رجالا كنا نعدهم من الأشرار أتخذناهم سخريا\" أي في الدار الدنيا \"أم زاغت عنهم الأبصار\" يسلون أنفسهم بالمحال يقولون أو لعلهم معنا في جهنم ولكن لم يقع بصرنا عليهم فعند ذلك يعرفون أنهم في الدرجات العاليات وهو قوله عز وجل \" ونادى أصحاب الجنة أصحاب النار أن قد وجدنا ما وعدنا ربنا حقا فهل وجدتم ما وعد ربكم حقا قالوا نعم فأذن مؤذن بينهم أن لعنة الله على الظالمين إلى قوله- ادخلوا الجنة لا خوف عليكم ولا أنتم تحزنون\"."
    },
    {
      "ayah": 59,
      "surah": 38,
      "text": "وقال الحسن البصري في قوله تعالى \"وآخر من شكله أزواج\" ألوان من العذاب وقال غيره كالزمهرير والسموم وشرب الحميم وأكل الزقوم والصعود والهوى إلى غير ذلك من الأشياء المختلفة المتضادة والجميع مما يعذبون به ويهانون بسبب وقوله عز وجل \"هذا فوج مقتحم معكم لا مرحبا بهم إنهم صالوا النار \" هذا إخبار من اللّه تعالى عن قيل أهل النار بعضهم لبعض كما قال تعالى \"كلما دخلت أمة لعنت أختها \" يعني بدل السلام يتلاعنون ويتكاذبون ويكفر بعضهم ببعض فتقول الطائفة التي تدخل قبل الأخرى إذا أقبلت التي بعدها مع الخزنة من الزبانية \"هذا فوج مقتحم \" أي \"داخل معكم لا مرحبا بهم إنهم صالوا النار\" أي لأنهم من أهل جهنم \"قالوا بل أنتم لا مرحبا بكم \" أي فيقول لهم الداخلون \"بل أنتم لا مرحبا بكم أنتم قدمتموه لنا\" أي أنتم دعوتمونا إلى ما أفضى بنا إلى هذا المصير \" فبئس القرار \" أي فبئس المنزل والمستقر والمصير قالوا \" ربنا من قدم لنا هذا فزده عذابا ضعفا في النار\" كما قال عز وجل \" قالت أخراهم لأولاهم ربنا هؤلاء أضلونا فآتهم عذابا ضعفا من النار قال لكل ضعف ولكن لا تعلمون\" أي لكل منكم عذاب بحسبه \" وقالوا ما لنا لا نرى رجالا كنا نعدهم من الأشرار أتخذناهم سخريا أم زاغت عنهم الأبصار\" هكذا إخبار عن الكفار في النار أنهم يفتقدون رجالا كانوا يعتقدون أنهم على الضلالة وهم المـؤمنون في زعمهم قالوا مالنا لا نراهم معنا في النار ؟ قال مجاهد هذا قول أبي جهل يقول مالي لا أرى بلالا وعمارا وصهيبا وفلانا وفلانا. وهذا ضرب مثل وإلا فكل الكفار هذا حالهم يعقدون أن المؤمنين يدخلون النار فلما دخل الكفار النار افتقدوهم فلم يجدوهم فقالوا \"ما لنا لا نرى رجالا كنا نعدهم من الأشرار أتخذناهم سخريا\" أي في الدار الدنيا \"أم زاغت عنهم الأبصار\" يسلون أنفسهم بالمحال يقولون أو لعلهم معنا في جهنم ولكن لم يقع بصرنا عليهم فعند ذلك يعرفون أنهم في الدرجات العاليات وهو قوله عز وجل \" ونادى أصحاب الجنة أصحاب النار أن قد وجدنا ما وعدنا ربنا حقا فهل وجدتم ما وعد ربكم حقا قالوا نعم فأذن مؤذن بينهم أن لعنة الله على الظالمين إلى قوله- ادخلوا الجنة لا خوف عليكم ولا أنتم تحزنون\"."
    },
    {
      "ayah": 6,
      "surah": 38,
      "text": "\"وانطلق الملأ منهم\" وهم سادتهم وقادتهم ورؤساؤهم وكبراؤهم قائلين \"امشوا\" أي استمروا على دينكم \"واصبروا على آلهتكم\" ولا تستجيبوا لما يدعوكم إليه محمد من التوحيد وقوله تعالى \"إن هذا لشيء يراد\" قال ابن جرير إن هذا الذي يدعونا إليه محمد صلى الله عليه وسلم من التوحيد لشيء يريد به الشرف عليكم والاستعلاء وأن يكون له منكم أتباع ولسنا نجيبه إليه \"ذكر سبب نزول هذه الآيات الكريمات \"قال السدي إن ناسا من قريش اجتمعوا فيهم أبو جهل بن هشام والعاص بن وائل والأسود بن المطلب والأسود بن عبد يغوث في نفر من مشيخة قريش فقال بعضهم لبعض انطلقوا بنا إلى أبى طالب فلنكلمه فيه فلينصفنا منه فليكف عن شتم آلهتنا وندعه وإلهه الذي يعبده فإنا نخاف أن يموت هذا الشيخ فيكون منا إليه شيء فتعيرنا به العرب يقولون تركوه حتى إذا مات عنه تناولوه فبعثوا رجلا منهم يقال له المطلب فاستأذن لهم على أبي طالب فقال هؤلاء مشيخة قومك وسراتهم يستأذنون عليك قال أدخلهم فلما دخلوا عليه قالوا يا أبا طالب أنت كبيرنا وسيدنا فأنصفنا من ابن أخيك فمره فليكف عن شتم آلهتنا ندعه وإلهه قال فبعث إليه أبو طالب فلما دخل عليه رسول الله صلى الله عليه وسلم قال: يا ابن أخي هؤلاء مشيخة قومك وسراتهم وقد سألوك أن تكف عن شتم آلهتهم ويدعوك وإلهك قال صلى الله عليه وسلم \" يا عم أفلا أدعوهم إلى ما هو خير لهم ؟ \"قال وإلام تدعوهم ؟ قال صلى الله عليه وسلم \"أدعوهم أن يتكلموا بكلمة تدين لهم بها العرب ويملكون بها العجم \"فقال أبو جهل لعنه الله من بين القوم ما هي وأبيك لنعطينكها وعشر أمثالها قال صلى الله عليه وسلم \"تقولون لا إله إلا الله \" فنفروا وقالوا سلنا غيرها قال صلى الله عليه وسلم \"لو جئتمونى بالشمس حتى تضعوها في يدي ما سألتكم غيرها \"فقاموا من عنده غضابا وقالوا والله لنشتمنك وإلهك الذي أمرك بهذا \"وانطلق الملأ منهم أن امشوا واصبروا على آلهتكم إن هذا لشيء يراد\" ورواه ابن أبي حاتم وابن جرير وزاد فلما خرجوا دعا رسول الله صلى الله عليه وسلم عمه إلى قول لا إله إلا الله فأبى وقال بل على دين الأشياخ ونزلت \"إنك لا تهدي من أحببت\" وقال أبو جعفر بن جرير حدثنا أبو كريب وابن وكيع قالا حدثنا أبو أسامة حدثنا الأعمش حدثنا عباد عن سعيد بن جبير عن ابن عباس رضي الله عنهما قال: لما مرض أبو طالب دخل عليه رهط من قريش فيهم أبو جهل فقالوا: إن ابن أخيك يشتم آلهتنا ويفعل ويفعل ويقول ويقول فلو بعثت إليه فنهيته فبعث إليه فجاء النبي فدخل البيت وبينهم وبين أبي طالب قدر مجلس رجل قال فخشي أبو جهل لعنه الله إن جلس إلى جنب أبى طالب أن يكون أرق له عليه فوثب فجلس في ذلك المجلس ولم يجد رسول الله صلى الله عليه وسلم مجلسا قرب عمه فجلس عند الباب فقال له أبو طالب أي ابن أخي مال قومك يشكونك ويزعمون أنك تشتم آلهتهم وتقول وتقول ؟ قال وأكثروا عليه من القول وتكلم رسول الله صلى الله عليه وسلم فقال \"يا عم إنى أريدهم على كلمة واحدة يقولونها تدين لهم بها العرب وتؤدي إليهم بها العجم الجزية\" ففزعوا لكلمته ولقوله فقال القوم كلمة واحدة نعم وأبيك عشرا فقالوا وما هي قال أبو طالب وأي كلمة هي يا ابن أخي ؟ قال صلى الله عليه وسلم \"لا إله إلا الله\" فقاموا فزعين منفضون ثيابهم وهم يقولون \"أجعل الآلهة إلها واحدا إن هذا لشيء عجاب\" قال ونزلت من هذا الموضع إلى قوله \"بل لما يذوقوا عذاب\" لفظ أبي كريب وهكذا رواه الإمام أحمد والنسائي من حديث محمد بن عبد الله بن نمير كلاهما عن أبى أسامة عن الأعمش عن عباد غير منسوب به نحوه ورواه الترمذي والنسائي وابن أبي سعيد وابن جرير أيضا كلهم في تفاسيرهم من حديث سفيان الثوري عن الأعمش عن يحيى بن عمارة الكوفي عن سعيد بن جبير عن ابن عباس رضي الله عنهما فذكر نحوه."
    },
    {
      "ayah": 60,
      "surah": 38,
      "text": "وقال الحسن البصري في قوله تعالى \"وآخر من شكله أزواج\" ألوان من العذاب وقال غيره كالزمهرير والسموم وشرب الحميم وأكل الزقوم والصعود والهوى إلى غير ذلك من الأشياء المختلفة المتضادة والجميع مما يعذبون به ويهانون بسبب وقوله عز وجل \"هذا فوج مقتحم معكم لا مرحبا بهم إنهم صالوا النار \" هذا إخبار من اللّه تعالى عن قيل أهل النار بعضهم لبعض كما قال تعالى \"كلما دخلت أمة لعنت أختها \" يعني بدل السلام يتلاعنون ويتكاذبون ويكفر بعضهم ببعض فتقول الطائفة التي تدخل قبل الأخرى إذا أقبلت التي بعدها مع الخزنة من الزبانية \"هذا فوج مقتحم \" أي \"داخل معكم لا مرحبا بهم إنهم صالوا النار\" أي لأنهم من أهل جهنم \"قالوا بل أنتم لا مرحبا بكم \" أي فيقول لهم الداخلون \"بل أنتم لا مرحبا بكم أنتم قدمتموه لنا\" أي أنتم دعوتمونا إلى ما أفضى بنا إلى هذا المصير \" فبئس القرار \" أي فبئس المنزل والمستقر والمصير قالوا \" ربنا من قدم لنا هذا فزده عذابا ضعفا في النار\" كما قال عز وجل \" قالت أخراهم لأولاهم ربنا هؤلاء أضلونا فآتهم عذابا ضعفا من النار قال لكل ضعف ولكن لا تعلمون\" أي لكل منكم عذاب بحسبه \" وقالوا ما لنا لا نرى رجالا كنا نعدهم من الأشرار أتخذناهم سخريا أم زاغت عنهم الأبصار\" هكذا إخبار عن الكفار في النار أنهم يفتقدون رجالا كانوا يعتقدون أنهم على الضلالة وهم المـؤمنون في زعمهم قالوا مالنا لا نراهم معنا في النار ؟ قال مجاهد هذا قول أبي جهل يقول مالي لا أرى بلالا وعمارا وصهيبا وفلانا وفلانا. وهذا ضرب مثل وإلا فكل الكفار هذا حالهم يعقدون أن المؤمنين يدخلون النار فلما دخل الكفار النار افتقدوهم فلم يجدوهم فقالوا \"ما لنا لا نرى رجالا كنا نعدهم من الأشرار أتخذناهم سخريا\" أي في الدار الدنيا \"أم زاغت عنهم الأبصار\" يسلون أنفسهم بالمحال يقولون أو لعلهم معنا في جهنم ولكن لم يقع بصرنا عليهم فعند ذلك يعرفون أنهم في الدرجات العاليات وهو قوله عز وجل \" ونادى أصحاب الجنة أصحاب النار أن قد وجدنا ما وعدنا ربنا حقا فهل وجدتم ما وعد ربكم حقا قالوا نعم فأذن مؤذن بينهم أن لعنة الله على الظالمين إلى قوله- ادخلوا الجنة لا خوف عليكم ولا أنتم تحزنون\"."
    },
    {
      "ayah": 61,
      "surah": 38,
      "text": "وقال الحسن البصري في قوله تعالى \"وآخر من شكله أزواج\" ألوان من العذاب وقال غيره كالزمهرير والسموم وشرب الحميم وأكل الزقوم والصعود والهوى إلى غير ذلك من الأشياء المختلفة المتضادة والجميع مما يعذبون به ويهانون بسبب وقوله عز وجل \"هذا فوج مقتحم معكم لا مرحبا بهم إنهم صالوا النار \" هذا إخبار من اللّه تعالى عن قيل أهل النار بعضهم لبعض كما قال تعالى \"كلما دخلت أمة لعنت أختها \" يعني بدل السلام يتلاعنون ويتكاذبون ويكفر بعضهم ببعض فتقول الطائفة التي تدخل قبل الأخرى إذا أقبلت التي بعدها مع الخزنة من الزبانية \"هذا فوج مقتحم \" أي \"داخل معكم لا مرحبا بهم إنهم صالوا النار\" أي لأنهم من أهل جهنم \"قالوا بل أنتم لا مرحبا بكم \" أي فيقول لهم الداخلون \"بل أنتم لا مرحبا بكم أنتم قدمتموه لنا\" أي أنتم دعوتمونا إلى ما أفضى بنا إلى هذا المصير \" فبئس القرار \" أي فبئس المنزل والمستقر والمصير قالوا \" ربنا من قدم لنا هذا فزده عذابا ضعفا في النار\" كما قال عز وجل \" قالت أخراهم لأولاهم ربنا هؤلاء أضلونا فآتهم عذابا ضعفا من النار قال لكل ضعف ولكن لا تعلمون\" أي لكل منكم عذاب بحسبه \" وقالوا ما لنا لا نرى رجالا كنا نعدهم من الأشرار أتخذناهم سخريا أم زاغت عنهم الأبصار\" هكذا إخبار عن الكفار في النار أنهم يفتقدون رجالا كانوا يعتقدون أنهم على الضلالة وهم المـؤمنون في زعمهم قالوا مالنا لا نراهم معنا في النار ؟ قال مجاهد هذا قول أبي جهل يقول مالي لا أرى بلالا وعمارا وصهيبا وفلانا وفلانا. وهذا ضرب مثل وإلا فكل الكفار هذا حالهم يعقدون أن المؤمنين يدخلون النار فلما دخل الكفار النار افتقدوهم فلم يجدوهم فقالوا \"ما لنا لا نرى رجالا كنا نعدهم من الأشرار أتخذناهم سخريا\" أي في الدار الدنيا \"أم زاغت عنهم الأبصار\" يسلون أنفسهم بالمحال يقولون أو لعلهم معنا في جهنم ولكن لم يقع بصرنا عليهم فعند ذلك يعرفون أنهم في الدرجات العاليات وهو قوله عز وجل \" ونادى أصحاب الجنة أصحاب النار أن قد وجدنا ما وعدنا ربنا حقا فهل وجدتم ما وعد ربكم حقا قالوا نعم فأذن مؤذن بينهم أن لعنة الله على الظالمين إلى قوله- ادخلوا الجنة لا خوف عليكم ولا أنتم تحزنون\"."
    },
    {
      "ayah": 62,
      "surah": 38,
      "text": "وقال الحسن البصري في قوله تعالى \"وآخر من شكله أزواج\" ألوان من العذاب وقال غيره كالزمهرير والسموم وشرب الحميم وأكل الزقوم والصعود والهوى إلى غير ذلك من الأشياء المختلفة المتضادة والجميع مما يعذبون به ويهانون بسبب وقوله عز وجل \"هذا فوج مقتحم معكم لا مرحبا بهم إنهم صالوا النار \" هذا إخبار من اللّه تعالى عن قيل أهل النار بعضهم لبعض كما قال تعالى \"كلما دخلت أمة لعنت أختها \" يعني بدل السلام يتلاعنون ويتكاذبون ويكفر بعضهم ببعض فتقول الطائفة التي تدخل قبل الأخرى إذا أقبلت التي بعدها مع الخزنة من الزبانية \"هذا فوج مقتحم \" أي \"داخل معكم لا مرحبا بهم إنهم صالوا النار\" أي لأنهم من أهل جهنم \"قالوا بل أنتم لا مرحبا بكم \" أي فيقول لهم الداخلون \"بل أنتم لا مرحبا بكم أنتم قدمتموه لنا\" أي أنتم دعوتمونا إلى ما أفضى بنا إلى هذا المصير \" فبئس القرار \" أي فبئس المنزل والمستقر والمصير قالوا \" ربنا من قدم لنا هذا فزده عذابا ضعفا في النار\" كما قال عز وجل \" قالت أخراهم لأولاهم ربنا هؤلاء أضلونا فآتهم عذابا ضعفا من النار قال لكل ضعف ولكن لا تعلمون\" أي لكل منكم عذاب بحسبه \" وقالوا ما لنا لا نرى رجالا كنا نعدهم من الأشرار أتخذناهم سخريا أم زاغت عنهم الأبصار\" هكذا إخبار عن الكفار في النار أنهم يفتقدون رجالا كانوا يعتقدون أنهم على الضلالة وهم المـؤمنون في زعمهم قالوا مالنا لا نراهم معنا في النار ؟ قال مجاهد هذا قول أبي جهل يقول مالي لا أرى بلالا وعمارا وصهيبا وفلانا وفلانا. وهذا ضرب مثل وإلا فكل الكفار هذا حالهم يعقدون أن المؤمنين يدخلون النار فلما دخل الكفار النار افتقدوهم فلم يجدوهم فقالوا \"ما لنا لا نرى رجالا كنا نعدهم من الأشرار أتخذناهم سخريا\" أي في الدار الدنيا \"أم زاغت عنهم الأبصار\" يسلون أنفسهم بالمحال يقولون أو لعلهم معنا في جهنم ولكن لم يقع بصرنا عليهم فعند ذلك يعرفون أنهم في الدرجات العاليات وهو قوله عز وجل \" ونادى أصحاب الجنة أصحاب النار أن قد وجدنا ما وعدنا ربنا حقا فهل وجدتم ما وعد ربكم حقا قالوا نعم فأذن مؤذن بينهم أن لعنة الله على الظالمين إلى قوله- ادخلوا الجنة لا خوف عليكم ولا أنتم تحزنون\"."
    },
    {
      "ayah": 63,
      "surah": 38,
      "text": "وقال الحسن البصري في قوله تعالى \"وآخر من شكله أزواج\" ألوان من العذاب وقال غيره كالزمهرير والسموم وشرب الحميم وأكل الزقوم والصعود والهوى إلى غير ذلك من الأشياء المختلفة المتضادة والجميع مما يعذبون به ويهانون بسبب وقوله عز وجل \"هذا فوج مقتحم معكم لا مرحبا بهم إنهم صالوا النار \" هذا إخبار من اللّه تعالى عن قيل أهل النار بعضهم لبعض كما قال تعالى \"كلما دخلت أمة لعنت أختها \" يعني بدل السلام يتلاعنون ويتكاذبون ويكفر بعضهم ببعض فتقول الطائفة التي تدخل قبل الأخرى إذا أقبلت التي بعدها مع الخزنة من الزبانية \"هذا فوج مقتحم \" أي \"داخل معكم لا مرحبا بهم إنهم صالوا النار\" أي لأنهم من أهل جهنم \"قالوا بل أنتم لا مرحبا بكم \" أي فيقول لهم الداخلون \"بل أنتم لا مرحبا بكم أنتم قدمتموه لنا\" أي أنتم دعوتمونا إلى ما أفضى بنا إلى هذا المصير \" فبئس القرار \" أي فبئس المنزل والمستقر والمصير قالوا \" ربنا من قدم لنا هذا فزده عذابا ضعفا في النار\" كما قال عز وجل \" قالت أخراهم لأولاهم ربنا هؤلاء أضلونا فآتهم عذابا ضعفا من النار قال لكل ضعف ولكن لا تعلمون\" أي لكل منكم عذاب بحسبه \" وقالوا ما لنا لا نرى رجالا كنا نعدهم من الأشرار أتخذناهم سخريا أم زاغت عنهم الأبصار\" هكذا إخبار عن الكفار في النار أنهم يفتقدون رجالا كانوا يعتقدون أنهم على الضلالة وهم المـؤمنون في زعمهم قالوا مالنا لا نراهم معنا في النار ؟ قال مجاهد هذا قول أبي جهل يقول مالي لا أرى بلالا وعمارا وصهيبا وفلانا وفلانا. وهذا ضرب مثل وإلا فكل الكفار هذا حالهم يعقدون أن المؤمنين يدخلون النار فلما دخل الكفار النار افتقدوهم فلم يجدوهم فقالوا \"ما لنا لا نرى رجالا كنا نعدهم من الأشرار أتخذناهم سخريا\" أي في الدار الدنيا \"أم زاغت عنهم الأبصار\" يسلون أنفسهم بالمحال يقولون أو لعلهم معنا في جهنم ولكن لم يقع بصرنا عليهم فعند ذلك يعرفون أنهم في الدرجات العاليات وهو قوله عز وجل \" ونادى أصحاب الجنة أصحاب النار أن قد وجدنا ما وعدنا ربنا حقا فهل وجدتم ما وعد ربكم حقا قالوا نعم فأذن مؤذن بينهم أن لعنة الله على الظالمين إلى قوله- ادخلوا الجنة لا خوف عليكم ولا أنتم تحزنون\"."
    },
    {
      "ayah": 64,
      "surah": 38,
      "text": "وقوله تعالى \"إن ذلك لحق تخاصم أهل النار\" أي إن هذا الذي أخبرناك به يا محمد من تخاصم أهل النار بعضهم في بعض ولعن بعضهم لبعض لحق لا مرية فيه ولا شك."
    },
    {
      "ayah": 65,
      "surah": 38,
      "text": "يقول تعالى آمرا رسوله صلى الله عليه وسلم أن يقول للكفار بالله المشركين به المكذبين لرسوله إنما أنا منذر لست كما تزعمون \" وما من إله إلا اللّه الواحد القهار \" أي هو وحده قد قهر كل شيء وغلبه."
    },
    {
      "ayah": 66,
      "surah": 38,
      "text": "\"رب السموات والأرض وما بينهما\" أي هو مالك جميع ذلك ومتصرف فيه \"العزيز الغفار\" أي غفار مع عظمته وعزته."
    },
    { "ayah": 67, "surah": 38, "text": "\"قل هو نبأ عظيم\" أي خبر عظيم وشأن بليغ وهو إرسال اللّه تعالى إياي إليكم." },
    {
      "ayah": 68,
      "surah": 38,
      "text": "\"أنتم عنه معرضون\" أي غافلون قال مجاهد وشريح القاضي والسدي في قوله عز وجل \" قل هو نبأ\" عظيم يعني القرآن."
    },
    {
      "ayah": 69,
      "surah": 38,
      "text": "وقوله تعالى \"ما كان لي من علم بالملأ الأعلى إذ يختصمون\" أي لولا الوحى من أين كنت أدري باختلاف الملأ الأعلى ؟ يعنى.. شأن آدم عليه الصلاة والسلام وامتناع إبليس من السجود له ومحاجته ربه في تفضيله عليه فأما الحديث الذي رواه الإمام أحمد حيث قال حدثنا أبو سعيد مولى بني هاشم حدثنا جهضم اليمامي عن يحيى بن أبي كثير عن زيد بن أبي سلام عن أبي سلام عن عبد الرحمن بن عائش عن مالك بن يخامر عن معاذ رضي الله عنه قال احتبس علينا رسول اللّه صلى الله عليه وسلم ذات غداة من صلاة الصبح حتى كدنا نتراءى قرن الشمس فخرج صلى الله عليه وسلم سريعا فثوب بالصلاة فصلى وتجوز في صلاته فلما سلم قال عليه الصلاة والسلام \" كما أنتم \"ثم أقبل إلينا فقال \" إنى قمت من الليل فصليت ما قدر لي فنعست في صلاتي حتى استيقظت فإذا أنا بربي عز وجل في أحسن صورة فقال يا محمد أتدري فيم يختصم الملأ الأعلى ؟ قلت لا أدري يا رب -أعادها ثلاثا ـ فرأيته وضع كفه بين كتفي حتى وجدت برد أنامله بين صدري فتجلى لي كل شيء وعرفت فقال يا محمد فيم يختصم الملأ الأعلى ؟ قلت في الكفارات قال وما الكفارات ؟ قلت نقل الأقدام إلى الجماعات والجلوس فى المساجد بعد الصلوات لإسباغ الوضوء عند الكريهات ؟ قال وما الدرجات ؟ قلت إطعام الطعام ولين الكلام والصلاة والناس نيام قال سل قلت اللهم إني أسألك فعل الخيرات وترك المنكرات وحب المساكين وأن تغفر لي وترحمني وإذا أردت فتنة بقوم فتوفني غير مفتون وأسألك حبك وحب من يحبك وحب عمل يقربني إلى حبك- وقال رسول اللّه صلى الله عليه وسلم ـ إنها حق فادرسوها وتعلموها \"فهو حديث المنام المشهور ومن جعله يقظة فقد غلط وهو في السنن من طرق وهذا الحديث يعينه قد رواه الترمذي من حديث جهضم بن عبدالله اليمامي به وقال الحسن صحيح وليس هذا الاختصام هو الاختصام المذكور في القرآن فإن هذا قد فسر وأما الاختصام الذي في القرآن فقد فسر بعد هذا وهو قوله تعالى."
    },
    {
      "ayah": 7,
      "surah": 38,
      "text": "قال الترمذي حسن وقولهم \"ما سمعنا بهذا في في الملة الآخرة\" أي ما سمعنا بهذا الذي يدعونا إليه محمد من التوحيد في الملة الآخرة قال مجاهد وقتادة وأبو زيد يعنون دين قريش وقال غيرهم يعنون النصرانية قالوا محمد بن كعب والسدي وقال العوفي عن ابن عباس رضي الله عنهما ما سمعنا بهذا في الملة الآخرة يعني النصرانية قالوا لو كان هذا القرآن حقا لأخبرتنا به النصارى \"إن اختلاق\"."
    },
    { "ayah": 70, "surah": 38, "text": "لا يوجد تفسير لهذه الأية" },
    {
      "ayah": 71,
      "surah": 38,
      "text": "وقوله تعالى \"ما كان لي من علم بالملأ الأعلى إذ يختصمون\" أي لولا الوحى من أين كنت أدري باختلاف الملأ الأعلى ؟ يعنى.. شأن آدم عليه الصلاة والسلام وامتناع إبليس من السجود له ومحاجته ربه في تفضيله عليه فأما الحديث الذي رواه الإمام أحمد حيث قال حدثنا أبو سعيد مولى بني هاشم حدثنا جهضم اليمامي عن يحيى بن أبي كثير عن زيد بن أبي سلام عن أبي سلام عن عبد الرحمن بن عائش عن مالك بن يخامر عن معاذ رضي الله عنه قال احتبس علينا رسول اللّه صلى الله عليه وسلم ذات غداة من صلاة الصبح حتى كدنا نتراءى قرن الشمس فخرج صلى الله عليه وسلم سريعا فثوب بالصلاة فصلى وتجوز في صلاته فلما سلم قال عليه الصلاة والسلام \" كما أنتم \"ثم أقبل إلينا فقال \" إنى قمت من الليل فصليت ما قدر لي فنعست في صلاتي حتى استيقظت فإذا أنا بربي عز وجل في أحسن صورة فقال يا محمد أتدري فيم يختصم الملأ الأعلى ؟ قلت لا أدري يا رب -أعادها ثلاثا ـ فرأيته وضع كفه بين كتفي حتى وجدت برد أنامله بين صدري فتجلى لي كل شيء وعرفت فقال يا محمد فيم يختصم الملأ الأعلى ؟ قلت في الكفارات قال وما الكفارات ؟ قلت نقل الأقدام إلى الجماعات والجلوس فى المساجد بعد الصلوات لإسباغ الوضوء عند الكريهات ؟ قال وما الدرجات ؟ قلت إطعام الطعام ولين الكلام والصلاة والناس نيام قال سل قلت اللهم إني أسألك فعل الخيرات وترك المنكرات وحب المساكين وأن تغفر لي وترحمني وإذا أردت فتنة بقوم فتوفني غير مفتون وأسألك حبك وحب من يحبك وحب عمل يقربني إلى حبك- وقال رسول اللّه صلى الله عليه وسلم ـ إنها حق فادرسوها وتعلموها \"فهو حديث المنام المشهور ومن جعله يقظة فقد غلط وهو في السنن من طرق وهذا الحديث يعينه قد رواه الترمذي من حديث جهضم بن عبدالله اليمامي به وقال الحسن صحيح وليس هذا الاختصام هو الاختصام المذكور في القرآن فإن هذا قد فسر وأما الاختصام الذي في القرآن فقد فسر بعد هذا وهو قوله تعالى."
    },
    {
      "ayah": 72,
      "surah": 38,
      "text": "هذه القصة ذكرها اللّه تبارك وتعالى في سورة البقرة وفي أول سورة الأعراف وفي سورة الحجر وسبحان والكهف وهنا وهي أن اللّه سبحانه وتعالى أعلم الملائكة قبل خلق آدم عليه الصلاة والسلام بأنه سيخلق بشرا من صلصال من حمأ مسنون وتقدم إليهم بالأمر: متى فرغ من خلقه وتسويته فليسجدوا له إكراما وإعظاما واحتراما وامتثالا لأمر الله عز وجل فامتثل الملائكة كلهم ذلك سوى إبليس ولم يكن منهم جنسا كان من الجن فخانه. طبعه وجبلته أحوج ما كان إليه فاستنكف عن السجود لآدم وخاصم ربه عز وجل فيه وادعى أنه خير من آدم فإنه مخلوق من نار وآدم خلق من طين والنار خير من الطين في زعمه وقد أخطأ في ذلك وخالف أمر اللّه تعالى وكفر بذلك فأبعده الله عز وجل وأرغم أنفه وطرده عن باب رحمته ومحل أنسه وحضرة قدسه وسماه إبليس إعلاما له بأنه قد أبلس من الرحمة وأنزله من السماء مذموما مدحورا إلى الأرض فسأل اللّه النظرة إلى يوم البعث فأنظره الحليم الذي لا يعجل على من عصاه فلما أمن الهلاك إلى القيامة تمرد وطغى وقال \" فبعزتك لأغوينهم أجمعين إلا عبادك منهم المخلصين\" كما قال عز وجل \" أرأيتك هذا الذي كرمت علي لئن أخرتن إلى يوم القيامة لأحتنكن ذريته إلا قليلا\" وهؤلاء هم المسنون في الآية الأخرى وهي قوله تعالى \" إن عبادي ليس لك عليهم سلطان وكفى بربك وكيلا\" وقوله تبارك وتعالى \" قال فالحق والحق أقول لأملأن جهنم منك وممن تبعك منهم أجمعين \" قرأ ذلك جماعة منهم مجاهد برفع الحق الأول وفسره مجاهد بأن معناه أنا الحق والحق أقول وفي رواية عنه: الحق مني وأقول الحق وقرأ آخرون بنصبهما قال السدي هو قسم أقسم اللّه به \" قلت \"وهذه الآية كقوله تعالى \" ولكن حق القول مني لأملأن جهنم من الجنة والناس أجمعين\" وكقوله عز وجل \" قال اذهب فمن تبعك منهم فإن جهنم جزاؤكم جزاء موفورا \"."
    },
    {
      "ayah": 73,
      "surah": 38,
      "text": "هذه القصة ذكرها اللّه تبارك وتعالى في سورة البقرة وفي أول سورة الأعراف وفي سورة الحجر وسبحان والكهف وهنا وهي أن اللّه سبحانه وتعالى أعلم الملائكة قبل خلق آدم عليه الصلاة والسلام بأنه سيخلق بشرا من صلصال من حمأ مسنون وتقدم إليهم بالأمر: متى فرغ من خلقه وتسويته فليسجدوا له إكراما وإعظاما واحتراما وامتثالا لأمر الله عز وجل فامتثل الملائكة كلهم ذلك سوى إبليس ولم يكن منهم جنسا كان من الجن فخانه. طبعه وجبلته أحوج ما كان إليه فاستنكف عن السجود لآدم وخاصم ربه عز وجل فيه وادعى أنه خير من آدم فإنه مخلوق من نار وآدم خلق من طين والنار خير من الطين في زعمه وقد أخطأ في ذلك وخالف أمر اللّه تعالى وكفر بذلك فأبعده الله عز وجل وأرغم أنفه وطرده عن باب رحمته ومحل أنسه وحضرة قدسه وسماه إبليس إعلاما له بأنه قد أبلس من الرحمة وأنزله من السماء مذموما مدحورا إلى الأرض فسأل اللّه النظرة إلى يوم البعث فأنظره الحليم الذي لا يعجل على من عصاه فلما أمن الهلاك إلى القيامة تمرد وطغى وقال \" فبعزتك لأغوينهم أجمعين إلا عبادك منهم المخلصين\" كما قال عز وجل \" أرأيتك هذا الذي كرمت علي لئن أخرتن إلى يوم القيامة لأحتنكن ذريته إلا قليلا\" وهؤلاء هم المسنون في الآية الأخرى وهي قوله تعالى \" إن عبادي ليس لك عليهم سلطان وكفى بربك وكيلا\" وقوله تبارك وتعالى \" قال فالحق والحق أقول لأملأن جهنم منك وممن تبعك منهم أجمعين \" قرأ ذلك جماعة منهم مجاهد برفع الحق الأول وفسره مجاهد بأن معناه أنا الحق والحق أقول وفي رواية عنه: الحق مني وأقول الحق وقرأ آخرون بنصبهما قال السدي هو قسم أقسم اللّه به \" قلت \"وهذه الآية كقوله تعالى \" ولكن حق القول مني لأملأن جهنم من الجنة والناس أجمعين\" وكقوله عز وجل \" قال اذهب فمن تبعك منهم فإن جهنم جزاؤكم جزاء موفورا \"."
    },
    {
      "ayah": 74,
      "surah": 38,
      "text": "هذه القصة ذكرها اللّه تبارك وتعالى في سورة البقرة وفي أول سورة الأعراف وفي سورة الحجر وسبحان والكهف وهنا وهي أن اللّه سبحانه وتعالى أعلم الملائكة قبل خلق آدم عليه الصلاة والسلام بأنه سيخلق بشرا من صلصال من حمأ مسنون وتقدم إليهم بالأمر: متى فرغ من خلقه وتسويته فليسجدوا له إكراما وإعظاما واحتراما وامتثالا لأمر الله عز وجل فامتثل الملائكة كلهم ذلك سوى إبليس ولم يكن منهم جنسا كان من الجن فخانه. طبعه وجبلته أحوج ما كان إليه فاستنكف عن السجود لآدم وخاصم ربه عز وجل فيه وادعى أنه خير من آدم فإنه مخلوق من نار وآدم خلق من طين والنار خير من الطين في زعمه وقد أخطأ في ذلك وخالف أمر اللّه تعالى وكفر بذلك فأبعده الله عز وجل وأرغم أنفه وطرده عن باب رحمته ومحل أنسه وحضرة قدسه وسماه إبليس إعلاما له بأنه قد أبلس من الرحمة وأنزله من السماء مذموما مدحورا إلى الأرض فسأل اللّه النظرة إلى يوم البعث فأنظره الحليم الذي لا يعجل على من عصاه فلما أمن الهلاك إلى القيامة تمرد وطغى وقال \" فبعزتك لأغوينهم أجمعين إلا عبادك منهم المخلصين\" كما قال عز وجل \" أرأيتك هذا الذي كرمت علي لئن أخرتن إلى يوم القيامة لأحتنكن ذريته إلا قليلا\" وهؤلاء هم المسنون في الآية الأخرى وهي قوله تعالى \" إن عبادي ليس لك عليهم سلطان وكفى بربك وكيلا\" وقوله تبارك وتعالى \" قال فالحق والحق أقول لأملأن جهنم منك وممن تبعك منهم أجمعين \" قرأ ذلك جماعة منهم مجاهد برفع الحق الأول وفسره مجاهد بأن معناه أنا الحق والحق أقول وفي رواية عنه: الحق مني وأقول الحق وقرأ آخرون بنصبهما قال السدي هو قسم أقسم اللّه به \" قلت \"وهذه الآية كقوله تعالى \" ولكن حق القول مني لأملأن جهنم من الجنة والناس أجمعين\" وكقوله عز وجل \" قال اذهب فمن تبعك منهم فإن جهنم جزاؤكم جزاء موفورا \"."
    },
    {
      "ayah": 75,
      "surah": 38,
      "text": "هذه القصة ذكرها اللّه تبارك وتعالى في سورة البقرة وفي أول سورة الأعراف وفي سورة الحجر وسبحان والكهف وهنا وهي أن اللّه سبحانه وتعالى أعلم الملائكة قبل خلق آدم عليه الصلاة والسلام بأنه سيخلق بشرا من صلصال من حمأ مسنون وتقدم إليهم بالأمر: متى فرغ من خلقه وتسويته فليسجدوا له إكراما وإعظاما واحتراما وامتثالا لأمر الله عز وجل فامتثل الملائكة كلهم ذلك سوى إبليس ولم يكن منهم جنسا كان من الجن فخانه. طبعه وجبلته أحوج ما كان إليه فاستنكف عن السجود لآدم وخاصم ربه عز وجل فيه وادعى أنه خير من آدم فإنه مخلوق من نار وآدم خلق من طين والنار خير من الطين في زعمه وقد أخطأ في ذلك وخالف أمر اللّه تعالى وكفر بذلك فأبعده الله عز وجل وأرغم أنفه وطرده عن باب رحمته ومحل أنسه وحضرة قدسه وسماه إبليس إعلاما له بأنه قد أبلس من الرحمة وأنزله من السماء مذموما مدحورا إلى الأرض فسأل اللّه النظرة إلى يوم البعث فأنظره الحليم الذي لا يعجل على من عصاه فلما أمن الهلاك إلى القيامة تمرد وطغى وقال \" فبعزتك لأغوينهم أجمعين إلا عبادك منهم المخلصين\" كما قال عز وجل \" أرأيتك هذا الذي كرمت علي لئن أخرتن إلى يوم القيامة لأحتنكن ذريته إلا قليلا\" وهؤلاء هم المسنون في الآية الأخرى وهي قوله تعالى \" إن عبادي ليس لك عليهم سلطان وكفى بربك وكيلا\" وقوله تبارك وتعالى \" قال فالحق والحق أقول لأملأن جهنم منك وممن تبعك منهم أجمعين \" قرأ ذلك جماعة منهم مجاهد برفع الحق الأول وفسره مجاهد بأن معناه أنا الحق والحق أقول وفي رواية عنه: الحق مني وأقول الحق وقرأ آخرون بنصبهما قال السدي هو قسم أقسم اللّه به \" قلت \"وهذه الآية كقوله تعالى \" ولكن حق القول مني لأملأن جهنم من الجنة والناس أجمعين\" وكقوله عز وجل \" قال اذهب فمن تبعك منهم فإن جهنم جزاؤكم جزاء موفورا \"."
    },
    {
      "ayah": 76,
      "surah": 38,
      "text": "هذه القصة ذكرها اللّه تبارك وتعالى في سورة البقرة وفي أول سورة الأعراف وفي سورة الحجر وسبحان والكهف وهنا وهي أن اللّه سبحانه وتعالى أعلم الملائكة قبل خلق آدم عليه الصلاة والسلام بأنه سيخلق بشرا من صلصال من حمأ مسنون وتقدم إليهم بالأمر: متى فرغ من خلقه وتسويته فليسجدوا له إكراما وإعظاما واحتراما وامتثالا لأمر الله عز وجل فامتثل الملائكة كلهم ذلك سوى إبليس ولم يكن منهم جنسا كان من الجن فخانه. طبعه وجبلته أحوج ما كان إليه فاستنكف عن السجود لآدم وخاصم ربه عز وجل فيه وادعى أنه خير من آدم فإنه مخلوق من نار وآدم خلق من طين والنار خير من الطين في زعمه وقد أخطأ في ذلك وخالف أمر اللّه تعالى وكفر بذلك فأبعده الله عز وجل وأرغم أنفه وطرده عن باب رحمته ومحل أنسه وحضرة قدسه وسماه إبليس إعلاما له بأنه قد أبلس من الرحمة وأنزله من السماء مذموما مدحورا إلى الأرض فسأل اللّه النظرة إلى يوم البعث فأنظره الحليم الذي لا يعجل على من عصاه فلما أمن الهلاك إلى القيامة تمرد وطغى وقال \" فبعزتك لأغوينهم أجمعين إلا عبادك منهم المخلصين\" كما قال عز وجل \" أرأيتك هذا الذي كرمت علي لئن أخرتن إلى يوم القيامة لأحتنكن ذريته إلا قليلا\" وهؤلاء هم المسنون في الآية الأخرى وهي قوله تعالى \" إن عبادي ليس لك عليهم سلطان وكفى بربك وكيلا\" وقوله تبارك وتعالى \" قال فالحق والحق أقول لأملأن جهنم منك وممن تبعك منهم أجمعين \" قرأ ذلك جماعة منهم مجاهد برفع الحق الأول وفسره مجاهد بأن معناه أنا الحق والحق أقول وفي رواية عنه: الحق مني وأقول الحق وقرأ آخرون بنصبهما قال السدي هو قسم أقسم اللّه به \" قلت \"وهذه الآية كقوله تعالى \" ولكن حق القول مني لأملأن جهنم من الجنة والناس أجمعين\" وكقوله عز وجل \" قال اذهب فمن تبعك منهم فإن جهنم جزاؤكم جزاء موفورا \"."
    },
    {
      "ayah": 77,
      "surah": 38,
      "text": "هذه القصة ذكرها اللّه تبارك وتعالى في سورة البقرة وفي أول سورة الأعراف وفي سورة الحجر وسبحان والكهف وهنا وهي أن اللّه سبحانه وتعالى أعلم الملائكة قبل خلق آدم عليه الصلاة والسلام بأنه سيخلق بشرا من صلصال من حمأ مسنون وتقدم إليهم بالأمر: متى فرغ من خلقه وتسويته فليسجدوا له إكراما وإعظاما واحتراما وامتثالا لأمر الله عز وجل فامتثل الملائكة كلهم ذلك سوى إبليس ولم يكن منهم جنسا كان من الجن فخانه. طبعه وجبلته أحوج ما كان إليه فاستنكف عن السجود لآدم وخاصم ربه عز وجل فيه وادعى أنه خير من آدم فإنه مخلوق من نار وآدم خلق من طين والنار خير من الطين في زعمه وقد أخطأ في ذلك وخالف أمر اللّه تعالى وكفر بذلك فأبعده الله عز وجل وأرغم أنفه وطرده عن باب رحمته ومحل أنسه وحضرة قدسه وسماه إبليس إعلاما له بأنه قد أبلس من الرحمة وأنزله من السماء مذموما مدحورا إلى الأرض فسأل اللّه النظرة إلى يوم البعث فأنظره الحليم الذي لا يعجل على من عصاه فلما أمن الهلاك إلى القيامة تمرد وطغى وقال \" فبعزتك لأغوينهم أجمعين إلا عبادك منهم المخلصين\" كما قال عز وجل \" أرأيتك هذا الذي كرمت علي لئن أخرتن إلى يوم القيامة لأحتنكن ذريته إلا قليلا\" وهؤلاء هم المسنون في الآية الأخرى وهي قوله تعالى \" إن عبادي ليس لك عليهم سلطان وكفى بربك وكيلا\" وقوله تبارك وتعالى \" قال فالحق والحق أقول لأملأن جهنم منك وممن تبعك منهم أجمعين \" قرأ ذلك جماعة منهم مجاهد برفع الحق الأول وفسره مجاهد بأن معناه أنا الحق والحق أقول وفي رواية عنه: الحق مني وأقول الحق وقرأ آخرون بنصبهما قال السدي هو قسم أقسم اللّه به \" قلت \"وهذه الآية كقوله تعالى \" ولكن حق القول مني لأملأن جهنم من الجنة والناس أجمعين\" وكقوله عز وجل \" قال اذهب فمن تبعك منهم فإن جهنم جزاؤكم جزاء موفورا \"."
    },
    {
      "ayah": 78,
      "surah": 38,
      "text": "هذه القصة ذكرها اللّه تبارك وتعالى في سورة البقرة وفي أول سورة الأعراف وفي سورة الحجر وسبحان والكهف وهنا وهي أن اللّه سبحانه وتعالى أعلم الملائكة قبل خلق آدم عليه الصلاة والسلام بأنه سيخلق بشرا من صلصال من حمأ مسنون وتقدم إليهم بالأمر: متى فرغ من خلقه وتسويته فليسجدوا له إكراما وإعظاما واحتراما وامتثالا لأمر الله عز وجل فامتثل الملائكة كلهم ذلك سوى إبليس ولم يكن منهم جنسا كان من الجن فخانه. طبعه وجبلته أحوج ما كان إليه فاستنكف عن السجود لآدم وخاصم ربه عز وجل فيه وادعى أنه خير من آدم فإنه مخلوق من نار وآدم خلق من طين والنار خير من الطين في زعمه وقد أخطأ في ذلك وخالف أمر اللّه تعالى وكفر بذلك فأبعده الله عز وجل وأرغم أنفه وطرده عن باب رحمته ومحل أنسه وحضرة قدسه وسماه إبليس إعلاما له بأنه قد أبلس من الرحمة وأنزله من السماء مذموما مدحورا إلى الأرض فسأل اللّه النظرة إلى يوم البعث فأنظره الحليم الذي لا يعجل على من عصاه فلما أمن الهلاك إلى القيامة تمرد وطغى وقال \" فبعزتك لأغوينهم أجمعين إلا عبادك منهم المخلصين\" كما قال عز وجل \" أرأيتك هذا الذي كرمت علي لئن أخرتن إلى يوم القيامة لأحتنكن ذريته إلا قليلا\" وهؤلاء هم المسنون في الآية الأخرى وهي قوله تعالى \" إن عبادي ليس لك عليهم سلطان وكفى بربك وكيلا\" وقوله تبارك وتعالى \" قال فالحق والحق أقول لأملأن جهنم منك وممن تبعك منهم أجمعين \" قرأ ذلك جماعة منهم مجاهد برفع الحق الأول وفسره مجاهد بأن معناه أنا الحق والحق أقول وفي رواية عنه: الحق مني وأقول الحق وقرأ آخرون بنصبهما قال السدي هو قسم أقسم اللّه به \" قلت \"وهذه الآية كقوله تعالى \" ولكن حق القول مني لأملأن جهنم من الجنة والناس أجمعين\" وكقوله عز وجل \" قال اذهب فمن تبعك منهم فإن جهنم جزاؤكم جزاء موفورا \"."
    },
    {
      "ayah": 79,
      "surah": 38,
      "text": "هذه القصة ذكرها اللّه تبارك وتعالى في سورة البقرة وفي أول سورة الأعراف وفي سورة الحجر وسبحان والكهف وهنا وهي أن اللّه سبحانه وتعالى أعلم الملائكة قبل خلق آدم عليه الصلاة والسلام بأنه سيخلق بشرا من صلصال من حمأ مسنون وتقدم إليهم بالأمر: متى فرغ من خلقه وتسويته فليسجدوا له إكراما وإعظاما واحتراما وامتثالا لأمر الله عز وجل فامتثل الملائكة كلهم ذلك سوى إبليس ولم يكن منهم جنسا كان من الجن فخانه. طبعه وجبلته أحوج ما كان إليه فاستنكف عن السجود لآدم وخاصم ربه عز وجل فيه وادعى أنه خير من آدم فإنه مخلوق من نار وآدم خلق من طين والنار خير من الطين في زعمه وقد أخطأ في ذلك وخالف أمر اللّه تعالى وكفر بذلك فأبعده الله عز وجل وأرغم أنفه وطرده عن باب رحمته ومحل أنسه وحضرة قدسه وسماه إبليس إعلاما له بأنه قد أبلس من الرحمة وأنزله من السماء مذموما مدحورا إلى الأرض فسأل اللّه النظرة إلى يوم البعث فأنظره الحليم الذي لا يعجل على من عصاه فلما أمن الهلاك إلى القيامة تمرد وطغى وقال \" فبعزتك لأغوينهم أجمعين إلا عبادك منهم المخلصين\" كما قال عز وجل \" أرأيتك هذا الذي كرمت علي لئن أخرتن إلى يوم القيامة لأحتنكن ذريته إلا قليلا\" وهؤلاء هم المسنون في الآية الأخرى وهي قوله تعالى \" إن عبادي ليس لك عليهم سلطان وكفى بربك وكيلا\" وقوله تبارك وتعالى \" قال فالحق والحق أقول لأملأن جهنم منك وممن تبعك منهم أجمعين \" قرأ ذلك جماعة منهم مجاهد برفع الحق الأول وفسره مجاهد بأن معناه أنا الحق والحق أقول وفي رواية عنه: الحق مني وأقول الحق وقرأ آخرون بنصبهما قال السدي هو قسم أقسم اللّه به \" قلت \"وهذه الآية كقوله تعالى \" ولكن حق القول مني لأملأن جهنم من الجنة والناس أجمعين\" وكقوله عز وجل \" قال اذهب فمن تبعك منهم فإن جهنم جزاؤكم جزاء موفورا \"."
    },
    {
      "ayah": 8,
      "surah": 38,
      "text": "قال مجاهد وقتادة كذب وقال ابن عباس تخرص وقولهم \"أأنزل عليه الذكر من بيننا\" يعني أنهم يستبعدون تخصيصه بإنزال القرآن عليه من بينهم كلهم كما قال في الآية الأخرى \"لولا نزل هذا القرآن على رجل من القريتين عظيم\" قال الله تعالى \"أهم يقسمون رحمة ربك نحن قسمنا بينهم معيشتهم في الحياة الدنيا ورفعنا بعضهم فوق بعض درجات\" ولهذا لما قالوا هذا الذي دل على جهلهم وقلة عقلهم في استبعادهم إنزال القرآن على الرسول من بينهم قال الله تعالى \"بل لما يذوقوا عذاب\" أي إنما يقولون هذا لأنهم ما ذاقوا إلى حين قولهم ذلك عذاب الله تعالى ونقمته سيعلمون غب ما قالوا وما كذبوا به يوم يدعون إلى نار جهنم دعا ثم قال تعالى مبينا أنه المتصرف في ملكه الفعال لما يشاء الذي يعطي من يشاء ما يشاء ويعز من يشاء فلا يهديه ويهدي من يشاء ويضل من يشاء وينزل الروح من أمره على من يشاء من عباده ويختم على قلب من يشاء فلا يهديه أحد من بعد الله لأن العباد لا يملكون شيئا من الأمر وليس إليهم من التصرف في الملك ولا مثقال ذرة وما يملكون من قطمير ولهذا قال تعالى منكرا عليهم \"أم عندهم خزائن رحمة ربك العزيز الوهاب\" أي العزيز الذي لا يرام جنابه الوهاب الذي يعطي ما يريد لمن يريد وهذه الآية الكريمة شبيهة بقوله تعالى أم لهم نصيب من الملك فإذا لا يؤتون الناس نقيرا أم يحسدون الناس على ما آتاهم الله من فضله فقد آتينا آل إبراهيم الكتاب والحكمة وآتيناهم ملكا عظيما فمنهم من آمن به ومنهم من صد عنه وكفى بجهنم سعيرا وقوله تعالى \" قل لو أنتم تملكون خزائن رحمة ربي إذا لأمسكتم خشية الإنفاق وكان الإنسان قتورا\" وذلك بعد الحكاية عن الكفار أنهم أنكروا بعثة الرسول البشري صلى الله عليه وسلم وكما أخبر عز وجل عن قوم صالح عليه السلام حين قالوا \"أألقي الذكر عليه من بيننا بل هو كذاب أشر سيعلمون غدا من الكذاب الأشر\"."
    },
    {
      "ayah": 80,
      "surah": 38,
      "text": "هذه القصة ذكرها اللّه تبارك وتعالى في سورة البقرة وفي أول سورة الأعراف وفي سورة الحجر وسبحان والكهف وهنا وهي أن اللّه سبحانه وتعالى أعلم الملائكة قبل خلق آدم عليه الصلاة والسلام بأنه سيخلق بشرا من صلصال من حمأ مسنون وتقدم إليهم بالأمر: متى فرغ من خلقه وتسويته فليسجدوا له إكراما وإعظاما واحتراما وامتثالا لأمر الله عز وجل فامتثل الملائكة كلهم ذلك سوى إبليس ولم يكن منهم جنسا كان من الجن فخانه. طبعه وجبلته أحوج ما كان إليه فاستنكف عن السجود لآدم وخاصم ربه عز وجل فيه وادعى أنه خير من آدم فإنه مخلوق من نار وآدم خلق من طين والنار خير من الطين في زعمه وقد أخطأ في ذلك وخالف أمر اللّه تعالى وكفر بذلك فأبعده الله عز وجل وأرغم أنفه وطرده عن باب رحمته ومحل أنسه وحضرة قدسه وسماه إبليس إعلاما له بأنه قد أبلس من الرحمة وأنزله من السماء مذموما مدحورا إلى الأرض فسأل اللّه النظرة إلى يوم البعث فأنظره الحليم الذي لا يعجل على من عصاه فلما أمن الهلاك إلى القيامة تمرد وطغى وقال \" فبعزتك لأغوينهم أجمعين إلا عبادك منهم المخلصين\" كما قال عز وجل \" أرأيتك هذا الذي كرمت علي لئن أخرتن إلى يوم القيامة لأحتنكن ذريته إلا قليلا\" وهؤلاء هم المسنون في الآية الأخرى وهي قوله تعالى \" إن عبادي ليس لك عليهم سلطان وكفى بربك وكيلا\" وقوله تبارك وتعالى \" قال فالحق والحق أقول لأملأن جهنم منك وممن تبعك منهم أجمعين \" قرأ ذلك جماعة منهم مجاهد برفع الحق الأول وفسره مجاهد بأن معناه أنا الحق والحق أقول وفي رواية عنه: الحق مني وأقول الحق وقرأ آخرون بنصبهما قال السدي هو قسم أقسم اللّه به \" قلت \"وهذه الآية كقوله تعالى \" ولكن حق القول مني لأملأن جهنم من الجنة والناس أجمعين\" وكقوله عز وجل \" قال اذهب فمن تبعك منهم فإن جهنم جزاؤكم جزاء موفورا \"."
    },
    {
      "ayah": 81,
      "surah": 38,
      "text": "هذه القصة ذكرها اللّه تبارك وتعالى في سورة البقرة وفي أول سورة الأعراف وفي سورة الحجر وسبحان والكهف وهنا وهي أن اللّه سبحانه وتعالى أعلم الملائكة قبل خلق آدم عليه الصلاة والسلام بأنه سيخلق بشرا من صلصال من حمأ مسنون وتقدم إليهم بالأمر: متى فرغ من خلقه وتسويته فليسجدوا له إكراما وإعظاما واحتراما وامتثالا لأمر الله عز وجل فامتثل الملائكة كلهم ذلك سوى إبليس ولم يكن منهم جنسا كان من الجن فخانه. طبعه وجبلته أحوج ما كان إليه فاستنكف عن السجود لآدم وخاصم ربه عز وجل فيه وادعى أنه خير من آدم فإنه مخلوق من نار وآدم خلق من طين والنار خير من الطين في زعمه وقد أخطأ في ذلك وخالف أمر اللّه تعالى وكفر بذلك فأبعده الله عز وجل وأرغم أنفه وطرده عن باب رحمته ومحل أنسه وحضرة قدسه وسماه إبليس إعلاما له بأنه قد أبلس من الرحمة وأنزله من السماء مذموما مدحورا إلى الأرض فسأل اللّه النظرة إلى يوم البعث فأنظره الحليم الذي لا يعجل على من عصاه فلما أمن الهلاك إلى القيامة تمرد وطغى وقال \" فبعزتك لأغوينهم أجمعين إلا عبادك منهم المخلصين\" كما قال عز وجل \" أرأيتك هذا الذي كرمت علي لئن أخرتن إلى يوم القيامة لأحتنكن ذريته إلا قليلا\" وهؤلاء هم المسنون في الآية الأخرى وهي قوله تعالى \" إن عبادي ليس لك عليهم سلطان وكفى بربك وكيلا\" وقوله تبارك وتعالى \" قال فالحق والحق أقول لأملأن جهنم منك وممن تبعك منهم أجمعين \" قرأ ذلك جماعة منهم مجاهد برفع الحق الأول وفسره مجاهد بأن معناه أنا الحق والحق أقول وفي رواية عنه: الحق مني وأقول الحق وقرأ آخرون بنصبهما قال السدي هو قسم أقسم اللّه به \" قلت \"وهذه الآية كقوله تعالى \" ولكن حق القول مني لأملأن جهنم من الجنة والناس أجمعين\" وكقوله عز وجل \" قال اذهب فمن تبعك منهم فإن جهنم جزاؤكم جزاء موفورا \"."
    },
    {
      "ayah": 82,
      "surah": 38,
      "text": "هذه القصة ذكرها اللّه تبارك وتعالى في سورة البقرة وفي أول سورة الأعراف وفي سورة الحجر وسبحان والكهف وهنا وهي أن اللّه سبحانه وتعالى أعلم الملائكة قبل خلق آدم عليه الصلاة والسلام بأنه سيخلق بشرا من صلصال من حمأ مسنون وتقدم إليهم بالأمر: متى فرغ من خلقه وتسويته فليسجدوا له إكراما وإعظاما واحتراما وامتثالا لأمر الله عز وجل فامتثل الملائكة كلهم ذلك سوى إبليس ولم يكن منهم جنسا كان من الجن فخانه. طبعه وجبلته أحوج ما كان إليه فاستنكف عن السجود لآدم وخاصم ربه عز وجل فيه وادعى أنه خير من آدم فإنه مخلوق من نار وآدم خلق من طين والنار خير من الطين في زعمه وقد أخطأ في ذلك وخالف أمر اللّه تعالى وكفر بذلك فأبعده الله عز وجل وأرغم أنفه وطرده عن باب رحمته ومحل أنسه وحضرة قدسه وسماه إبليس إعلاما له بأنه قد أبلس من الرحمة وأنزله من السماء مذموما مدحورا إلى الأرض فسأل اللّه النظرة إلى يوم البعث فأنظره الحليم الذي لا يعجل على من عصاه فلما أمن الهلاك إلى القيامة تمرد وطغى وقال \" فبعزتك لأغوينهم أجمعين إلا عبادك منهم المخلصين\" كما قال عز وجل \" أرأيتك هذا الذي كرمت علي لئن أخرتن إلى يوم القيامة لأحتنكن ذريته إلا قليلا\" وهؤلاء هم المسنون في الآية الأخرى وهي قوله تعالى \" إن عبادي ليس لك عليهم سلطان وكفى بربك وكيلا\" وقوله تبارك وتعالى \" قال فالحق والحق أقول لأملأن جهنم منك وممن تبعك منهم أجمعين \" قرأ ذلك جماعة منهم مجاهد برفع الحق الأول وفسره مجاهد بأن معناه أنا الحق والحق أقول وفي رواية عنه: الحق مني وأقول الحق وقرأ آخرون بنصبهما قال السدي هو قسم أقسم اللّه به \" قلت \"وهذه الآية كقوله تعالى \" ولكن حق القول مني لأملأن جهنم من الجنة والناس أجمعين\" وكقوله عز وجل \" قال اذهب فمن تبعك منهم فإن جهنم جزاؤكم جزاء موفورا \"."
    },
    {
      "ayah": 83,
      "surah": 38,
      "text": "هذه القصة ذكرها اللّه تبارك وتعالى في سورة البقرة وفي أول سورة الأعراف وفي سورة الحجر وسبحان والكهف وهنا وهي أن اللّه سبحانه وتعالى أعلم الملائكة قبل خلق آدم عليه الصلاة والسلام بأنه سيخلق بشرا من صلصال من حمأ مسنون وتقدم إليهم بالأمر: متى فرغ من خلقه وتسويته فليسجدوا له إكراما وإعظاما واحتراما وامتثالا لأمر الله عز وجل فامتثل الملائكة كلهم ذلك سوى إبليس ولم يكن منهم جنسا كان من الجن فخانه. طبعه وجبلته أحوج ما كان إليه فاستنكف عن السجود لآدم وخاصم ربه عز وجل فيه وادعى أنه خير من آدم فإنه مخلوق من نار وآدم خلق من طين والنار خير من الطين في زعمه وقد أخطأ في ذلك وخالف أمر اللّه تعالى وكفر بذلك فأبعده الله عز وجل وأرغم أنفه وطرده عن باب رحمته ومحل أنسه وحضرة قدسه وسماه إبليس إعلاما له بأنه قد أبلس من الرحمة وأنزله من السماء مذموما مدحورا إلى الأرض فسأل اللّه النظرة إلى يوم البعث فأنظره الحليم الذي لا يعجل على من عصاه فلما أمن الهلاك إلى القيامة تمرد وطغى وقال \" فبعزتك لأغوينهم أجمعين إلا عبادك منهم المخلصين\" كما قال عز وجل \" أرأيتك هذا الذي كرمت علي لئن أخرتن إلى يوم القيامة لأحتنكن ذريته إلا قليلا\" وهؤلاء هم المسنون في الآية الأخرى وهي قوله تعالى \" إن عبادي ليس لك عليهم سلطان وكفى بربك وكيلا\" وقوله تبارك وتعالى \" قال فالحق والحق أقول لأملأن جهنم منك وممن تبعك منهم أجمعين \" قرأ ذلك جماعة منهم مجاهد برفع الحق الأول وفسره مجاهد بأن معناه أنا الحق والحق أقول وفي رواية عنه: الحق مني وأقول الحق وقرأ آخرون بنصبهما قال السدي هو قسم أقسم اللّه به \" قلت \"وهذه الآية كقوله تعالى \" ولكن حق القول مني لأملأن جهنم من الجنة والناس أجمعين\" وكقوله عز وجل \" قال اذهب فمن تبعك منهم فإن جهنم جزاؤكم جزاء موفورا \"."
    },
    {
      "ayah": 84,
      "surah": 38,
      "text": "هذه القصة ذكرها اللّه تبارك وتعالى في سورة البقرة وفي أول سورة الأعراف وفي سورة الحجر وسبحان والكهف وهنا وهي أن اللّه سبحانه وتعالى أعلم الملائكة قبل خلق آدم عليه الصلاة والسلام بأنه سيخلق بشرا من صلصال من حمأ مسنون وتقدم إليهم بالأمر: متى فرغ من خلقه وتسويته فليسجدوا له إكراما وإعظاما واحتراما وامتثالا لأمر الله عز وجل فامتثل الملائكة كلهم ذلك سوى إبليس ولم يكن منهم جنسا كان من الجن فخانه. طبعه وجبلته أحوج ما كان إليه فاستنكف عن السجود لآدم وخاصم ربه عز وجل فيه وادعى أنه خير من آدم فإنه مخلوق من نار وآدم خلق من طين والنار خير من الطين في زعمه وقد أخطأ في ذلك وخالف أمر اللّه تعالى وكفر بذلك فأبعده الله عز وجل وأرغم أنفه وطرده عن باب رحمته ومحل أنسه وحضرة قدسه وسماه إبليس إعلاما له بأنه قد أبلس من الرحمة وأنزله من السماء مذموما مدحورا إلى الأرض فسأل اللّه النظرة إلى يوم البعث فأنظره الحليم الذي لا يعجل على من عصاه فلما أمن الهلاك إلى القيامة تمرد وطغى وقال \" فبعزتك لأغوينهم أجمعين إلا عبادك منهم المخلصين\" كما قال عز وجل \" أرأيتك هذا الذي كرمت علي لئن أخرتن إلى يوم القيامة لأحتنكن ذريته إلا قليلا\" وهؤلاء هم المسنون في الآية الأخرى وهي قوله تعالى \" إن عبادي ليس لك عليهم سلطان وكفى بربك وكيلا\" وقوله تبارك وتعالى \" قال فالحق والحق أقول لأملأن جهنم منك وممن تبعك منهم أجمعين \" قرأ ذلك جماعة منهم مجاهد برفع الحق الأول وفسره مجاهد بأن معناه أنا الحق والحق أقول وفي رواية عنه: الحق مني وأقول الحق وقرأ آخرون بنصبهما قال السدي هو قسم أقسم اللّه به \" قلت \"وهذه الآية كقوله تعالى \" ولكن حق القول مني لأملأن جهنم من الجنة والناس أجمعين\" وكقوله عز وجل \" قال اذهب فمن تبعك منهم فإن جهنم جزاؤكم جزاء موفورا \"."
    },
    {
      "ayah": 85,
      "surah": 38,
      "text": "هذه القصة ذكرها اللّه تبارك وتعالى في سورة البقرة وفي أول سورة الأعراف وفي سورة الحجر وسبحان والكهف وهنا وهي أن اللّه سبحانه وتعالى أعلم الملائكة قبل خلق آدم عليه الصلاة والسلام بأنه سيخلق بشرا من صلصال من حمأ مسنون وتقدم إليهم بالأمر: متى فرغ من خلقه وتسويته فليسجدوا له إكراما وإعظاما واحتراما وامتثالا لأمر الله عز وجل فامتثل الملائكة كلهم ذلك سوى إبليس ولم يكن منهم جنسا كان من الجن فخانه. طبعه وجبلته أحوج ما كان إليه فاستنكف عن السجود لآدم وخاصم ربه عز وجل فيه وادعى أنه خير من آدم فإنه مخلوق من نار وآدم خلق من طين والنار خير من الطين في زعمه وقد أخطأ في ذلك وخالف أمر اللّه تعالى وكفر بذلك فأبعده الله عز وجل وأرغم أنفه وطرده عن باب رحمته ومحل أنسه وحضرة قدسه وسماه إبليس إعلاما له بأنه قد أبلس من الرحمة وأنزله من السماء مذموما مدحورا إلى الأرض فسأل اللّه النظرة إلى يوم البعث فأنظره الحليم الذي لا يعجل على من عصاه فلما أمن الهلاك إلى القيامة تمرد وطغى وقال \" فبعزتك لأغوينهم أجمعين إلا عبادك منهم المخلصين\" كما قال عز وجل \" أرأيتك هذا الذي كرمت علي لئن أخرتن إلى يوم القيامة لأحتنكن ذريته إلا قليلا\" وهؤلاء هم المسنون في الآية الأخرى وهي قوله تعالى \" إن عبادي ليس لك عليهم سلطان وكفى بربك وكيلا\" وقوله تبارك وتعالى \" قال فالحق والحق أقول لأملأن جهنم منك وممن تبعك منهم أجمعين \" قرأ ذلك جماعة منهم مجاهد برفع الحق الأول وفسره مجاهد بأن معناه أنا الحق والحق أقول وفي رواية عنه: الحق مني وأقول الحق وقرأ آخرون بنصبهما قال السدي هو قسم أقسم اللّه به \" قلت \"وهذه الآية كقوله تعالى \" ولكن حق القول مني لأملأن جهنم من الجنة والناس أجمعين\" وكقوله عز وجل \" قال اذهب فمن تبعك منهم فإن جهنم جزاؤكم جزاء موفورا \"."
    },
    {
      "ayah": 86,
      "surah": 38,
      "text": "يقول تعالى قل يا محمد لهؤلاء المشركين ما أسألهم على هذا البلاغ وهذا النصح أجرا تعطونيه من عرض الحياة الدنيا \"وما أنا من المتكلفين\" أي وما أريد على ما أرسلني اللّه تعالى به ولا أبتغي زيادة عليه بل ما أمرت به أديته لا أزيد عليه ولا أنقص منه وإنما أبتغي بذلك وجه اللّه عز وجل والدار الآخرة قال سفيان الثوري عن الأعمش ومنصور عن أبي الضحى عن مسروق قال: أتينا عبدالله بن مسعود رضي الله عنه قال يا أيها الناس من علم شيئا فليقل به ومن لم يعلم فليقل اللّه أعلم فإن من العلم أن يقول الرجل لما لا يعلم اللّه أعلم فإن اللّه عز وجل قال لنبيكم \" قل ما أسألكم عليه من أجر وما أنا من المتكلفين \"أخرجاه من حديث الأعمش به."
    },
    {
      "ayah": 87,
      "surah": 38,
      "text": "وقوله تعالى \" إن هو إلا ذكر للعالمين \" يعني القرآن ذكر لجميع المكلفين من الإنس والجن قاله ابن عباس رضي الله عنهما وروى ابن أبي حاتم عن أبيه عن أبي غسان مالك بن إسماعيل حدثنا قيس بن عطاء بن السائب عن سعيد بن جبير عن ابن عباس رضي الله عنهما في قوله تعالى \" للعالمين\" قال الجن والإنس وهذه الآية كقوله تعالى \" لأنذركم به ومن بلغ \" وكقوله عز وجل \" ومن يكفر به من الأحزاب فالنار موعده \"."
    },
    {
      "ayah": 88,
      "surah": 38,
      "text": "وقوله تعالى \"ولتعلمن نبأه\" أي خيره وصدقه \" بعد حين\" أي عن قريب قال قتادة بعد الموت وقال عكرمة يعني يوم القيامة ولا منافاة بين القولين فإن من مات فقد دخل في حكم القيامة وقال قتادة في قوله تعالى \" ولتعلمن نبأه بعين حين \" قال الحسن يا ابن آدم عند الموت يأتيك الخبر اليقين. آخر تفسير سورة ص وللّه الحمد المنة."
    },
    {
      "ayah": 9,
      "surah": 38,
      "text": "قال مجاهد وقتادة كذب وقال ابن عباس تخرص وقولهم \"أأنزل عليه الذكر من بيننا\" يعني أنهم يستبعدون تخصيصه بإنزال القرآن عليه من بينهم كلهم كما قال في الآية الأخرى \"لولا نزل هذا القرآن على رجل من القريتين عظيم\" قال الله تعالى \"أهم يقسمون رحمة ربك نحن قسمنا بينهم معيشتهم في الحياة الدنيا ورفعنا بعضهم فوق بعض درجات\" ولهذا لما قالوا هذا الذي دل على جهلهم وقلة عقلهم في استبعادهم إنزال القرآن على الرسول من بينهم قال الله تعالى \"بل لما يذوقوا عذاب\" أي إنما يقولون هذا لأنهم ما ذاقوا إلى حين قولهم ذلك عذاب الله تعالى ونقمته سيعلمون غب ما قالوا وما كذبوا به يوم يدعون إلى نار جهنم دعا ثم قال تعالى مبينا أنه المتصرف في ملكه الفعال لما يشاء الذي يعطي من يشاء ما يشاء ويعز من يشاء فلا يهديه ويهدي من يشاء ويضل من يشاء وينزل الروح من أمره على من يشاء من عباده ويختم على قلب من يشاء فلا يهديه أحد من بعد الله لأن العباد لا يملكون شيئا من الأمر وليس إليهم من التصرف في الملك ولا مثقال ذرة وما يملكون من قطمير ولهذا قال تعالى منكرا عليهم \"أم عندهم خزائن رحمة ربك العزيز الوهاب\" أي العزيز الذي لا يرام جنابه الوهاب الذي يعطي ما يريد لمن يريد وهذه الآية الكريمة شبيهة بقوله تعالى أم لهم نصيب من الملك فإذا لا يؤتون الناس نقيرا أم يحسدون الناس على ما آتاهم الله من فضله فقد آتينا آل إبراهيم الكتاب والحكمة وآتيناهم ملكا عظيما فمنهم من آمن به ومنهم من صد عنه وكفى بجهنم سعيرا وقوله تعالى \" قل لو أنتم تملكون خزائن رحمة ربي إذا لأمسكتم خشية الإنفاق وكان الإنسان قتورا\" وذلك بعد الحكاية عن الكفار أنهم أنكروا بعثة الرسول البشري صلى الله عليه وسلم وكما أخبر عز وجل عن قوم صالح عليه السلام حين قالوا \"أألقي الذكر عليه من بيننا بل هو كذاب أشر سيعلمون غدا من الكذاب الأشر\"."
    }
  ]
}
