{
  "ayahs": [
    {
      "ayah": 1,
      "surah": 39,
      "text": "سورة الزمر: قال النسائي حدثنا محمد بن النضر بن مساور حدثنا حماد عن مروان بن أبي لبابة عن عائشة رضي الله عنها قالت كان رسول الله صلى الله عليه وسلم يصوم حتى نقول ما يريد أن يفطر ويفطر حتى نقول ما يريد أن يصوم وكان صلى الله عليه وسلم يقرأ في كل ليلة بني إسرائيل والزمر. يخبر تعالى أن تنزيل هذا الكتاب وهو القرآن العظيم من عنده تبارك وتعالى فهو الحق الذي لا مرية فيه ولا شك كما قال عز وجل \"وإنه لتنزيل رب العالمين نزل به الروح الأمين على قلبك لتكون من المنذرين بلسان عربي مبين\" وقال تبارك وتعالى \"وإنه لكتاب عزيز لا يأتيه الباطل من بين يديه ولا من خلفه تنزيل من حكيم حميد\" وقال جل وعلا ههنا \"تنزيل الكتاب من الله العزيز\" أي المنيع الجناب \"الحكيم\" أي في أقواله وأفعاله وشرعه وقدره."
    },
    {
      "ayah": 10,
      "surah": 39,
      "text": "يقول تعالى آمرا عباده المؤمنين بالاستمرار على طاعته وتقواه \"قل يا عباد الذين آمنوا اتقوا ربكم للذين احسنوا في هذه الدنيا حسنة\" أي لمن أحسن العمل في هذه الدنيا حسنة في دنياهم وأخراهم. وقوله \"وأرض الله واسعة\" قال مجاهد فهاجروا فيها وجاهدوا واعتزلوا الأوثان وقال شريك عن منصور عن عطاء في قوله تبارك وتعالى \"وأرض الله واسعة\" قال إذا دعيتم إلى معصيته فاهربوا ثم قرأ \"ألم تكن أرض الله واسعة فتهاجروا فيها\" وقوله تعالى \"إنما يوفى الصابرون أجرهم بغير حساب\" قال الأوزاعي ليس يوزن لهم ولا يكال لهم إنما يغرف لهم غرفا وقال ابن جريج بلغني أنه لا يحسب عليهم ثواب عملهم قط ولكن يزادون على ذلك وقال السدي \"إنما يوفى الصابرون أجرهم بغير حساب\" يعني في الجنة."
    },
    { "ayah": 11, "surah": 39, "text": "أي إنما أمرت بإخلاص العبادة لله وحده لا شريك له." },
    { "ayah": 12, "surah": 39, "text": "قال السدي يعني من أمته صلى الله عليه وسلم." },
    {
      "ayah": 13,
      "surah": 39,
      "text": "يقول تعالى قل يا محمد وأنت رسول الله \"إني أخاف إن عصيت ربي عذاب يوم عظيم\" وهو يوم القيامة وهذا شرط ومعناه التعريض بغيره بطريق الأولى والأخرى."
    },
    {
      "ayah": 14,
      "surah": 39,
      "text": "\"قل الله أعبد مخلصا له ديني فاعبدوا ما شئتم من دونه\" وهذا أيضا تهديد وتبرٍّ منهم."
    },
    {
      "ayah": 15,
      "surah": 39,
      "text": "\"قل إن الخاسرين\" أي إنما الخاسرون كل الخسران \"الذين خسروا أنفسهم وأهليهم يوم القيامة\" أي تفارقوا فلا التقاء لهم أبدا وسواء ذهب أهلوهم إلى الجنة وقد ذهبوا هم إلى النار أو أن الجميع أسكنوا النار ولكن لا اجتماع لهم ولا سرور \"ألا ذلك هو الخسران المبين\" أي هذا هو الخسران المبين الظاهر الواضح."
    },
    {
      "ayah": 16,
      "surah": 39,
      "text": "ثم وصف حالهم في النار فقال \"لهم من فوقهم ظلل من النار ومن تحتهم ظلل\" كما قال عز وجل \"لهم من جهنم مهاد ومن فوقهم غواش وكذلك نجز الظالمين\" وقال تعالى \"يوم يغشاهم العذاب من فوقهم ومن تحت أرجلهم ويقول ذوقوا ما كنتم تعملون\" وقوله جل جلاله \"ذلك يخوف الله به عباده\" أي إنما يقص خبر هذا الكائن لا محالة ليخوف به عباده لينزجروا عن المحارم والمآثم وقوله تعالى \"يا عباد فاتقون\" أي اخشوا بأسي وسطوتي وعذابي ونقمتي."
    },
    {
      "ayah": 17,
      "surah": 39,
      "text": "قال عبدالرحمن بن زيد بن أسلم عن أبيه \"والذين اجتنبوا الطاغوت أن يعبدوها\" نزلت في زيد بن عمرو بن نفيل وأبي ذر وسلمان الفارسي رضي الله تعالى عنهم والصحيح أنها شاملة لهم ولغيرهم ممن اجتنب عبادة الأوثان وأناب إلى عبادة الرحمن فهؤلاء هم الذين لهم البشرى في الحياة الدنيا وفي الآخرة."
    },
    {
      "ayah": 18,
      "surah": 39,
      "text": "ثم قال عز وجل \"فبشر عباد الذين يستمعون القول فيتبعون أحسنه\" أي يفهمونه ويعملون بما فيه كقوله تبارك وتعالى لموسى عليه الصلاة والسلام حين آتاه التوراة \"فخذها بقوة وأمر قومك يأخذوا بأحسنها\" \"أولئك الذين هداهم الله\" أي المتصفون بهذه الصفة هم الذين هداهم الله في الدنيا والآخرة \"وأولئك هم أولوا الألباب\" أي ذو العقول الصحيحة والفطر المستقيمة."
    },
    {
      "ayah": 19,
      "surah": 39,
      "text": "يقول تعالى أفمن كتب الله أنه شقي تقدر تنقذه مما هو فيه من الضلال والهلاك؟ أي لا يهديه أحد من بعد الله لأنه من يضلل الله فلا هادي له ومن يهده فلا مضل له."
    },
    {
      "ayah": 2,
      "surah": 39,
      "text": "أي فاعبد الله وحده لا شريك له وادع الخلق إلى ذلك وأعلمهم أنه لا تصلح العبادة إلا له وحده وأنه ليس له شريك ولا عديل ولا نديد ولهذا قال تعالى \"ألا لله الدين الخالص\" أى لا يقبل من العمل إلا ما أخلص فيه العامل لله وحده لا شريك له."
    },
    {
      "ayah": 20,
      "surah": 39,
      "text": "ثم أخبر عز وجل عن عباده السعداء أن لهم غرفا في الجنة وهي القصور أى الشاهقة \"من فوقها غرف مبنية\" طباق فوق طباق مبنيات محكمات مزخرفات عاليات قال عبدالله بن الإمام أحمد حدثنا عباد بن يعقوب الأسدي حدثنا محمد بن فضيل عن عبدالرحمن بن إسحاق عن النعمان بن سعد عن علي رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم \"إن في الجنة لغرفا يرى بطونها من ظهورها وظهورها من بطونها\" فقال أعرابي لمن هي يا رسول الله؟ قال صلى الله عليه وسلم \"لمن أطاب الكلام وأطعم الطعام وصلى بالليل والناس نيام\" ورواه الترمذي من حديث عبدالرحمن بن إسحاق وقال حسن غريب وقد تكلم بعض أهل العلم فيه من قبل حفظه وقال الإمام أحمد حدثنا عبدالرزاق حدثنا معمر عن يحيى بن أبي كثير عن ابن معانق ـ أو أبي معانق - عن أبي مالك الأشعري رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم \"إن في الجنة لغرقا يرى ظاهرها من باطنها وباطنها من ظاهرها أعدها الله تعالى لمن أطعم الطعام وألان الكلام وتابع الصيام وصلى والناس نيام\" تفرد به أحمد من حديث عبدالله بن معانق الأشعري عن أبي مالك الأشعري رضي الله عنه به وقال الإمام أحمد حدثنا قتيبة بن سعيد حدثنا يعقوب بن عبدالرحمن عن أبي حازم عن سهل بن سعد رضي الله عنه أن رسول الله صلى الله عليه وسلم قال \"إن أهل الجنة ليتراءون الغرفة في الجنة كما تراءون الكوكب في أفق السماء\" قال فحدثت بذلك النعمان بن أبي عياش فقال سمعت أبا سعيد الخدري رضي الله عنه يقول \"كما تراءون الكوكب الذي في الأفق الشرقي أو الغربي\" أخرجاه في الصحيحين من حديث أبي حازم وأخرجاه أيضا في الصحيحين من حديث مالك عن صفوان بن سليم عن عطاء بن يسار عن أبي سعيد رضي الله عنه عن النبي صلى الله عليه وسلم وقال الإمام أحمد حدثنا فزارة أخبرني فليح عن هلال بن علي عن عطاء بن يسار عن أبي هريرة رضي الله عنه أن رسول الله صلى الله عليه وسلم قال \"إن أهل الجنة ليتراءون في الجنة أهل الغرف كما تراءون الكوكب الدري الغارب في الأفق الطالع ـ في تفاضل أهل الدرجات - فقالوا يا رسول الله أولئك النبيون؟ فقال صلى الله عليه وسلم \"بلى والذي نفسي بيده وأقوام آمنوا بالله وصدقوا الرسل\" ورواه الترمذي عن سويد عن ابن المبارك عن فليح به وقال حسن صحيح وقال الإمام أحمد حدثنا أبو النضر وأبو عامر قالا حدثنا زهير حدثنا سعد الطائي حدثنا أبو المدله مولى أم المؤمنين رضي الله عنها أنه سمع أبا هريرة رضي الله عنه يقول: قلنا يا رسول الله إنا إذا رأيناك رقت قلوبنا وكنا من أهل الآخرة فإذا فارقناك أعجبتنا الدنيا وشممنا النساء والأولاد قال صلى الله عليه وسلم \"لو أنكم تكونون على كل حال على الحال التي أنتم عليها عندي لصافحتكم الملائكة بأكفهم ولزارتكم في بيوتكم ولو لم تذنبوا لجاء الله عز وجل بقوم يذنبون كي يغفر لهم\" قلنا يا رسول الله حدثنا عن الجنة ما بناؤها؟ قال صلى الله عليه وسلم \"لبنة ذهب ولبنة فضة وملاطها المسك الأذفر وحصباؤها اللؤلؤ والياقوت وترابها الزعفران من يدخلها ينعم ولا يبأس ويخلد ولا يموت لا تبلى ثيابه ولا يفنى شبابه ثلاثة لا ترد دعوتهم: الإمام العادل والصائم حتى يفطر ودعوة المظلوم حمل على الغمام وتفتح لها أبواب السموات ويقول الرب تبارك وتعالى وعزتي لأنصرنك ولو بعد حين\" وروى الترمذي وابن ماجة بعضه من حديث سعد بن أبي مجاهد الطائي وكان ثقة عن أبي المدله وكان ثقة به. وقوله تعالى \"تجري من تحتها الأنهار\" أي تسلك الأنهار بين خلال ذلك كما يشاءوا وأين أرادوا \"وعد الله\" أي هذا الذي ذكرناه وعد وعده الله عباده المؤمنين \"إن الله لا يخلف الميعاد\"."
    },
    {
      "ayah": 21,
      "surah": 39,
      "text": "يخبر تعالى أن أصل الماء في الأرض من السماء كما قال عز وجل \"وأنزلنا من السماء ماء طهورا\" فإذا أنزل الماء من السماء كمن في الأرض ثم يصرفه تعالى في أجزاء الأرض كما يشاء وينبعه عيونا ما بين صغار وكبار بحسب الحاجة إليها ولهذا قال تبارك وتعالى \"فسلكه ينابيع في الأرض\" قال ابن أبي حاتم حدثنا علي بن الحسين حدثنا عمرو بن علي حدثنا أبو قتيبة عتبة بن اليقظان عن عكرمة عن ابن عباس رضي الله عنهما في قوله تعالى \"ألم تر أن الله أنزل من السماء ماء فسلكه ينابيع في الأرض\" قال ليس في الأرض ماء إلا نزل من السماء ولكن عروق في ألأرض تغيره فذلك قوله تعالى \"فسلكه ينابيع في الأرض\" فمن سره أن يعود الملح عذبا فليصعده وكذا. قال سعيد بن جبير وعامر والشعبي أن كل ماء في الأرض فأصله من السماء وقال سعيد بن جبير أصله من الثلج يعني أن الثلج يتراكم على الجبال فيسكن في قرارها فتنبع العيون من أسافلها وقوله تعالى \"ثم يخرج به زرعا مختلفا ألوانه\" أي ثم يخرج بالماء النازل من السماء والنابع من الأرض زرعا مختلفا ألوانه أي أشكاله وطعومه وروائحه ومنافعه \"ثم يهيج\" أي بعد نضارته وشبابه يكتهل فتراه مصفرا قد خالطه اليبس \"ثم يجعله حطاما\" أي ثم يعود يابسا يتحطم \"إن في ذلك لذكرى لأولي الألباب\" أي الذين يتذكرون بهذا فيعتبرون إلى أن الدنيا هكذا تكون خضرة نضرة حسناء ثم تعود عجوزا شوهاء والشاب يعود شيخا هرما كبيرا ضعيفا وبعد ذلك كله الموت فالسعيد من كان حاله بعده إلى خير وكثيرا ما يضرب الله تعالى مثل الحياة الدنيا بما ينزل الله من السماء من ماء وينبت به زروعا وثمارا ثم يكون بعد ذلك حطاما كما قال تعالى \"واضرب لهم مثل الحياة الدنيا كماء أنزلناه من السماء فاختلط به نبات الأرض فأصبح هشيما تذروه الرياح وكان الله على كل شيء مقتدرا\"."
    },
    {
      "ayah": 22,
      "surah": 39,
      "text": "وقوله تبارك وتعالى \"أفمن شرح الله صدره للإسلام فهو على نور من ربه\" أي هل يستوي هذا ومن هو قاسي القلب بعيد عن الحق كقوله عز وجل \"أو من كان ميتا فأحييناه وجعلنا له نورا يمشي به في الناس كمن مثله في الظلمات ليس بخارج منها\" ولهذا قال تعالى \"فويل للقاسية قلوبهم من ذكر الله\" أي فلا تلين عند ذكره ولا تخشع ولا تعي ولا تفهم \"أولئك في ضلال مبين\"."
    },
    {
      "ayah": 23,
      "surah": 39,
      "text": "هذا مدح من الله عز وجل لكتابه القرآن العظيم المنزل على رسوله الكريم قال الله تعالى \"الله نزل أحسن الحديث كتابا متشابها مثاني\" قال مجاهد يعني القرآن كله متشابه مثاني وقال قتادة: الآية تشبه الآية والحرف يشبه الحرف وقال الضحاك: مثاني ترديد القول ليفهموا عن ربهم تبارك وتعالى وقال عكرمة والحسن ثنى الله فيه القضاء زاد الحسن تكون السورة فيها آية وفي السورة الأخرى آية تشبهها قال عبدالرحمن بن زيد بن أسلم: مثاني مردد ردد موسى في القرآن وصالح وهود والأنبياء عليهم الصلاة والسلام في أمكنة كثيرة وقال سعيد بن جبير عن ابن عباس رضي الله عنهما \"مثاني\" قال القرآن يشبه بعضه بعضا ويرد بعضه على بعض وقال بعض العلماء ويروى عن سفيان بن عينة معنى قوله تعالى \"متشابها مثاني\" إن سياقات القرآن تارة تكون في معنى واحد فهذان من المتشابه وتارة تكون بذكر الشيء وضده كذكر المؤمنين ثم الكافرين وكصفة الجنة ثم صفة النار وما أشبه هذا فهذا من المثاني كقوله تعالى \"إن الأبرار لفي نعيم وإن الفجار لفي جحيم\" وكقوله عز وجل \"كلا إن كتاب الفجار لفي سجين - إلى أن قال - كلا إن كتاب الأبرار لفي عليين\" \"هذا ذكر وإن للمتقين لحسن مآب - إلى أن قال - هذا وإن للطاغين لشر مآب\" ونحو هذا من السياقات فهذا كله من المثاني أي في معنيين اثنين وأما إذا كان السياق كله في معنى واحد يشبه بعضه بعضا فهو المتشابه وليس هذا من المتشابه المذكور في قوله تعالى \"منه آيات محكمات هن أم الكتاب وأخر متشابهات\" ذاك معنى آخر. وقوله تعالى \"تقشعر منه جلود الذين يخشون ربهم ثم تلين جلودهم وقلوبهم إلى ذكر الله\" أي هذه صفة الأبرار عند سماع كلام الجبار المهيمن العزيز الغفار لما يفهمون منه من الوعد والوعيد والتخويف والتهديد تقشعر منه جلودهم من الخشية والخوف \"ثم تلين جلودهم وقلوبهم إلى ذكر الله\" لما يرجون ويؤملون من رحمته ولطفه فهم مخالفون لغيرهم من الفجار من وجوه \"أحدها\" أن سماع هؤلاء هو تلاوة الآيات وسماع أولئك نغمات الأبيات أصوات القينات \"الثاني\" أنهم إذا تليت عليهم آيات الرحمن خروا سجدا وبكيا بأدب وخشية ورجاء ومحبة وفهم وعلم كما قال تبارك وتعالى \"إنما المؤمنون الذين إذا ذكر الله وجلت قلوبهم وإذا تليت عليهم آياته زادتهم إيمانا وعلى ربهم يتوكلون الذين يقيمون الصلاة ومما رزقناهم ينفقون أولئك هم المؤمنون حقا لهم درجات عند ربهم ومغفرة ورزق كريم\" وقال تعالى \"والذين إذا ذكروا بآيات ربهم لم يخروا عليها صما وعميانا\" أي لم يكونوا عند سماعها متشاغلين لاهين عنها بل مصغين إليها فاهمين بصيرين بمعانيها فلهذا إنما يعملون بها ويسجدون عندها عن بصيرة لا عن جهل ومتابعة لغيرهم \"الثالث\" أنهم يلزمون الأدب عند سماعها كما كان الصحابة رضي الله عنهم عند سماعهم كلام الله تعالى من تلاوة رسول الله تقشعر جلودهم ثم تلين مع قلوبهم إلى ذكر الله لم يكونوا يتصارخون ولا يتكلفون ما ليس فيهم بل عندهم من الثبات والسكون والأدب والخشية ما لا يلحقهم أحد في ذلك ولهذا فازوا بالمدح من الرب الأعلى في الدنيا والآخرة قال عبدالرزاق حدثنا معمر قال تلا قتادة رحمه الله \"تقشعر منه جلود الذين يخشون ربهم ثم تلين جلودهم وقلوبهم إلى ذكر الله\" قال هذا نعت أولياء الله نعتهم الله عز وجل بأن تقشعر جلودهم وتبكي أعينهم وتطمئن قلوبهم إلى ذكر الله ولم ينعتهم بذهاب عقولهم والغشيان عليهم إنما هذا في أهل البدع وهذا من الشيطان وقال السدي \"ثم تلين جلودهم وقلوبهم إلى ذكر الله\" أي إلى وعد الله وقوله \"ذلك هدى الله يهدي به من يشاء من عباده\" أي هذه صفة من هداه الله ومن كان على خلاف ذلك فهو ممن أضله الله \"ومن يضلل الله فما له من هاد\"."
    },
    {
      "ayah": 24,
      "surah": 39,
      "text": "يقول تعالى \"أفمن يتقي بوجهه سوء العذاب يوم القيامة\" ويقرع فيقال له ولأمثاله من الظالمين \"ذوقوا ما كنتم تكسبون\" كمن يأتي آمنا يوم القيامة كما قال عز وجل \"أفمن يمشي مكبا على وجهه أهدى أم من يمشي سويا على صراط مستقيم\" وقال جل وعلا \"يوم يسحبون في النار على وجوههم ذوقوا مس سقر\" وقال تبارك وتعالى \"أفمن يلقى في النار خير أم من يأتي آمنا يوم القيامة\" واكتفى في هذه الآية بأحد القسمين عن الآخر كقول الشاعر: فما أدري إذا يممت أرضا أريد الخير أيهما يليني يعنى الخير أو الشر."
    },
    {
      "ayah": 25,
      "surah": 39,
      "text": "يعني القرون الماضية المكذبة للرسل أهلكهم الله بذنوبهم وما كان لهم من الله من واق."
    },
    {
      "ayah": 26,
      "surah": 39,
      "text": "وقوله جل وعلا \"فأذاقهم الله الخزي في الحياة الدنيا\" أي بما أنزل بهم من العذاب والنكال وتشفي المؤمنين منهم فليحذر المخاطبون من ذلك فإنهم قد كذبوا أشرف الرسل وخاتم الأنبياء صلى الله عليه وسلم والذي أعده الله جل جلاله لهم في الآخرة من العذاب الشديد أعظم مما أصابهم في الدنيا ولهذا قال عز وجل \"ولعذاب الآخرة أكبر لو كانوا يعلمون\"."
    },
    {
      "ayah": 27,
      "surah": 39,
      "text": "يقول تعالى \"ولقد ضربنا للناس في هذا القرآن من كل مثل\" أي بينا للناس فيه بضرب الأمثال \"لعلهم يتذكرون\" فإن المثل يقرب المعنى إلى الأذهان كما قال تبارك وتعالى \"ضرب لكم مثلا من أنفسكم\" أي تعلمونه من أنفسكم وقال عز وجل \"وتلك الأمثال نضربها للناس وما يعقلها إلا العالمون\"."
    },
    {
      "ayah": 28,
      "surah": 39,
      "text": "وقوله جل وعلا \"قرآنا عربيا غير ذي عوج\" أي هو قرآن بلسان عربي مبين لا اعوجاج فيه ولا انحراف ولا لبس بل هو بيان ووضوح وبرهان وإنما جعله الله تعالى كذلك وأنزله بذلك \"لعلهم يتقون\" أي يحذرون ما فيه من الوعيد ويعملون بما فيه من الوعد."
    },
    {
      "ayah": 29,
      "surah": 39,
      "text": "ثم قال \"ضرب الله مثلا رجلا فيه شركاء متشاكسون\" أي يتنازعون في ذلك العبد المشترك بينهم \"ورجلا سلما\" أي سالما \"لرجل\" أي خالصا لا يملكه أحد غيره \"هل يستويان مثلا\" أي لا يستوي هذا وهذا كذلك لا يستوي المشرك الذي يعبد آلهة مع الله والمؤمن المخلص الذي لا يعبد إلا الله وحده لا شريك له فأين هذا من هذا؟ قال ابن عباس رضي الله عنهما مجاهد وغير واحد: هذه الآية ضربت مثلا للمشرك والمخلص ولما كان هذا المثل ظاهرا بينا جليا قال \"الحمد لله\" أي على إقامة الحجة عليهم \"بل أكثرهم لا يعلمون\" أي فلهذا يشركون بالله."
    },
    {
      "ayah": 3,
      "surah": 39,
      "text": "وقال قتادة في قوله تبارك وتعالى \"ألا لله الدين الخالص\" شهادة أن لا إله إلا الله ثم أخبر عز وجل عن عباد الأصنام من المشركين أنهم يقولون \"ما نعبدهم إلا ليقربونا إلى الله زلفى\" أي إنما يحملهم على عبادتهم لهم أنهم عمدوا إلى أصنام اتخذوها على صور الملائكة المقربين في زعمهم فعبدوا تلك الصور تنزيلا لذلك منزلة عبادتهم الملائكة ليشفعوا لهم عند الله تعالى فينصرهم ورزقهم وما ينوبهم من أمور الدنيا فأما المعاد فكانوا جاحدين له كافرين به. قال قتادة والسدي ومالك عن زيد بن أسلم وابن زيد \"إلا ليقربونا إلى الله زلفى\" أي ليشفعوا لنا ويقربونا عنده منزلة ولهذا كانوا يقولون في تلبيتهم إذا حجوا في جاهليتهم لبيك لا شريك لك إلا شريكا هو لك تملكه وما ملك وهذه الشبهة هي التي اعتمدها المشركون في قديم الدهر وحديته وجاءتهم الرسل صلوات الله وسلامه عليهم أجمعين بردها والنهي عنها والدعوة إلى إفراد العبادة لله وحده لا شريك له وأن هذا شيء اخترعه المشركون من عند أنفسهم لم يأذن الله فيه ولا رضي به بل أبغضه ونهى عنه \"ولقد بعثنا في كل أمة رسولا أن أعبدوا الله واجتنبوا الطاغوت\" \"وما أرسلنا من قبلك من رسول إلا نوحي إليه أنه لا إله إلا أنا فاعبدون\" وأخبر أن الملائكة التي في السموات من الملائكة المقربين وغيرهم كلهم عبيد خاضعون لله لا يشفعون عنده إلا بإذنه لمن ارتضى وليسوا عنده كالأمراء عند ملوكهم يشفعون عندهم بغير إذنهم فيما أحبه الملوك وأبوه \"فلا تضربوا لله الأمثال\" تعالى الله عن ذلك علوا كبيرا وقوله عز وجل \"إن الله يحكم بينهم\" أي يوم القيامة \"فيما هم فيه يختلفون\" أي سيفصل بين الخلاف يوم معادهم ويجزي كل عامل بعمله\" ويوم يحشرهم جميعا ثم يقول للملائكة أهؤلاء إياكم كانوا يعبدون قالوا سبحانك أنت ولينا من دونهم بل كانوا يعبدون الجن أكثرهم بهم مؤمنون\" وقوله عز وجل \"إن الله لا يهدي من هو كاذب كفار\" أي لا يرشد إلى الهداية من قصده الكذب والافتراء على الله تعالى وقلبه كافر بآياته وحججه وبراهينه ثم بين تعالى أنه لا ولد له كما يزعمه جهلة المشركين في الملائكة والمعاندون من اليهود والنصارى في العزير وعيسى."
    },
    {
      "ayah": 30,
      "surah": 39,
      "text": "هذه الآية من الآيات التي استشهد بها الصديق رضي الله عنه عند موت الرسول صلى الله عليه وسلم حتى تحقق الناس موته مع قوله عز وجل \"وما محمد إلا رسول قد خلت من قبله الرسل أفإن مات أو قتل انقلبتم على أعقابكم ومن ينقلب على عقبيه فلن يضر الله شيئا وسيجزي الله الشاكرين\" ومعنى هذه الآية أنكم ستنقلون من هذه الدار لا محالة وستجتمعون عند الله تعالى في الدار الآخرة وتختصمون فيما أنتم فيه في الدنيا من التوحيد والشرك بين يدي الله عز وجل فيفصل بينكم ويفتح بالحق وهو الفتاح العليم فينجي المؤمنين المخلصين الموحدين ويعذب الكافرين الجاحدين المشركين المكذبين ثم إن هذه الآية وإن كان سياقها في المؤمنين والكافرين وذكر الخصومة بينهم في الدار الآخرة فإنها شاملة لكل متنازعين في الدنيا فإنه تعاد عليهم الخصومة في الدار الآخرة."
    },
    {
      "ayah": 31,
      "surah": 39,
      "text": "قال ابن أبي حاتم رحمه الله حدثنا محمد بن عبيد الله بن يزيد المقري حدثنا سفيان عن محمد بن عمرو عن أبي حاطب - يعني يحيى بن عبدالرحمن - عن ابن الزبير رضي الله عنهما قال لما نزلت \"ثم إنكم يوم القيامة عند ربكم تختصمون\" قال الزبير رضي الله عنه: يا رسول الله أتكرر علينا الخصومة؟ قال صلى الله عليه وسلم \"نعم\" قال رضي الله عنه\" إن الأمر إذا لشديد. وكذا رواه الإمام أحمد عن سفيان وعنده زيادة ولما نزلت \"ثم لتسئلن يومئذ عن النعيم\" قال الزبير رضي الله عنه: أي رسول الله أي نعيم نسأل عنه وإنما نعيمنا الأسودان: التمر والماء؟ قال صلى الله عليه وسلم \"أما إن ذلك سيكون\" وقد روى هذه الزيادة الترمذي وابن ماجه من حديث سفيان به وقال الترمذي حسن وقال أحمد أيضا حدثنا ابن نمير حدثنا محمد - يعني ابن عمرو - عن يحيى بن عبدالرحمن بن حاطب عن عبدالله بن الزبير عن الزبير بن العوام رضي الله عنه قال: لما نزلت هذه السورة على رسول الله صلى الله عليه وسلم \"إنك ميت وإنهم ميتون ثم إنكم يوم القيامة عند ربكم تختصمون\" قال الزبير رضي الله عنه أي رسول الله أيكرر علينا ما كان بيننا في الدنيا مع خواص الذنوب؟ قال صلى الله عليه وسلم \"نعم ليكررن عليكم حتى يؤدى إلى كل ذي حق حقه\" قال الزبير رضي الله عنه: والله إن الأمر لشديد رواه الترمذي من حديث محمد بن عمرو به وقال حسن صحيح وقال الإمام أحمد حدثنا قتيبة بن سعيد حدثنا ابن لهيعة عن أبي عياش عن عقبة بن عامر رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم \"أول الخصمين يوم القيامة جاران\" تفرد به أحمد وقال الإمام أحمد أيضا حدثنا حسن بن موسى حدثنا ابن لهيعة حدثنا دراج عن أبي الهيثم عن أبي سعيد رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم \"والذي نفسي بيده إنه ليختصم حتى الشاتان فيما انتطحتا\" تفرد به أحمد رحمه الله وفي المسند عن أبي ذر رضي الله عنه أنه قال رأى رسول الله صلى الله عليه وسلم شاتين ينتطحان فقال \"أتدري فيم ينتطحان يا أبا ذر؟\" قلت لا قال صلى الله عليه وسلم \"لكن الله يدري وسيحكم بينهما\" وقال الحافظ أبو بكر البزار حدثنا سهل بن محمد حدثنا حيان بن أغلب ما أبي حدثنا ثابت عن أنس رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم \"يجاء بالإمام الجائر الخائن يوم القيامة فتخاصمه الرعية فيفلحون عليه فيقال له سد ركنا من أركان جهنم\" ثم قال الأغلب بن تميم ليس بالحافظ. وقال علي بن أبي طلحة عن ابن عباس رضي الله عنهما \"ثم إنكم يوم القيامة عند ربكم تختصمون\" يقول يخاصم الصادق الكاذب والمظلوم الظالم والمهتدي الضال والضعيف المستكبر وقد روى ابن منده في كتاب الروح عن ابن عباس رضي الله عنهما أنه قال: يختصم الناس يوم القيامة حتى تختصم الروح مع الجسد فتقول الروح للجسد أنت فعلت ويقول الجسد للروح أنت أمرت وأنت سولت فيبعث الله تعالى ملكا يفصل بينهما فيقول لهما إن مثلكما كمثل رجل مقعد بصير والآخر ضرير دخلا بستانا فقال المقعد للضرير إني أرى ههنا ثمارا ولكن لا أصل إليها فقال له الضرير اركبني فتناولها فركبه فتناولها فأيهما المعتدي؟ فيقولان كلاهما فيقول لهما الملك فإنكما قد حكمتما على أنفسكما يعني أن الجسد للروح كالمطية وهو راكبه. وقال ابن أبي حاتم حدثنا جعفر بن أحمد بن عوسجة حدثنا ضرار حدثنا أبو سلمة الخزاعي حدثنا منصور بن سلمة حدثنا القمي - يعني يعقوب بن عبدالله - عن جعفر بن المغيرة عن سعيد بن جبير عن ابن عمر رضي الله عنهما قال: نزلت هذه الآية وما نعلم في أي شيء نزلت \"ثم إنكم يوم القيامة عند ربكم تختصمون\" قال قلنا من نخاصم؟ ليس بيننا وبين أهل الكتاب خصومة فمن نخاصم؟ حتى وقعت الفتنة فقال ابن عمر رضي الله عنهما: هذا الذي وعدنا ربنا عز وجل نختصم فيه ورواه النسائي عن محمد بن عامر عن منصور بن سلمة به وقال أبو العالية في قوله تبارك وتعالي \"ثم إنكم يوم القيامة عند ربكم تختصمون\" قال يعني أهل القبلة وقال ابن زيد: يعني أهل الإسلام وأهل الكفر وقد قدمنا أن الصحيح العموم والله سبحانه وتعالى أعلم."
    },
    {
      "ayah": 32,
      "surah": 39,
      "text": "يقول عز وجل مخاطبا للمشركين الذين افتروا على الله وجعلوا معه آلهة أخرى وادعوا أن الملائكة بنات الله وجعلوا لله ولدا تعالى الله عن قولهم علوا كبيرا ومع هذا كذبوا بالحق إذ جاءهم على ألسنة رسل الله صلوات الله وسلامه عليهم أجمعين ولهذا قال عز وجل \"فمن أظلم ممن كذب على الله وكذب بالصدق إذ جاءه\" أي لا أحد أظلم من هذا لأنه جمع بين طرفي الباطل كذب على الله وكذب رسول الله صلى الله عليه وسلم قالوا الباطل وردوا الحق ولهذا قال جلت عظمته متوعدا لهم \"أليس في جهنم مثوى للكافرين\" وهم الجاحدون المكذبون."
    },
    {
      "ayah": 33,
      "surah": 39,
      "text": "ثم قال جل وعلا \"والذي جاء بالصدق وصدق به\" قال مجاهد وقتادة والربيع بن أنس وابن زيد: الذي جاء بالصدق هو رسول الله صلى الله عليه وسلم وقال السدي هو جبريل عليه السلام \"وصدق به\" يعني محمدا وقال علي بن أبي طلحة عن ابن عباس رضي الله عنهما \"والذي جاء بالصدق\" قال من جاء بلا إله إلا الله \"وصدق به\" يعني رسول الله صلى الله عليه وسلم وقرأ الربيع بن أنس \"الذين جاءوا بالصدق\" يعني الأنبياء \"وصدقوا به\" يعني الأتباع. وقال ليث بن أبي سليم عن مجاهد \"والذي جاء بالصدق وصدق به\" قال أصحاب القرآن المؤمنون يجيئون يوم القيامة فيقولون هذا ما أعطيتمونا فعملنا فيه بما أمرتمونا. وهذا القول عن مجاهد يشمل كل المؤمنين فإن المؤمنين يقولون الحق ويعملون به والرسول صلى الله عليه وسلم أولى الناس بالدخول في هذه الآية على هذا التفسير فإنه جاء بالصدق وصدق المرسلين وآمن بما أنزل إليه من ربه والمؤمنون كل آمن بالله وملائكته وكتبه ورسله. وقال عبدالرحمن بن زيد بن أسلم \"والذي جاء بالصدق\" هو رسول الله صلى الله عليه وسلم \"وصدق به\" قال المسلمون \"أولئك هم المتقون\" قال ابن عباس رضي الله عنهما اتقوا الشرك."
    },
    { "ayah": 34, "surah": 39, "text": "\"لهم ما يشاءون عند ربهم\" يعني في الجنة مهما طلبوا وجدوا." },
    {
      "ayah": 35,
      "surah": 39,
      "text": "\" ليكفر الله عنهم أسوأ الذي عملوا ويجزيهم أجرهم بأحسن الذي كانوا يعملون\" كما قال عز وجل في الآية الأخرى \"أولئك الذين نتقبل عنهم أحسن ما عملوا ونتجاوز عن سيئاتهم في أصحاب الجنة وعد الصدق الذي كانوا يوعدون\"."
    },
    {
      "ayah": 36,
      "surah": 39,
      "text": "يقول تعالى \"أليس الله بكاف عبده\" وقرأ بعضهم \"عباده\" يعني أنه تعالى يكفي من عبده وتوكل عليه وقال ابن أبي حاتم ههنا حدثنا أبو عبدالله ابن أخي ابن وهب حدثنا عمي حدثنا أبو هانئ عن أبي علي عمرو بن مالك الجنبي عن فضالة بن عبيد الأنصاري رضي الله عنه أنه سمع رسول الله صلى الله عليه وسلم يقول \"أفلح من هدي إلى الإسلام وكان عيشه كفافا وقنع به\" ورواه الترمذي والنسائي من حديث حيوة بن شريح عن أبي هانئ الخولاني به وقال الترمذي صحيح \"ويخوفونك بالذين من دونه\" يعني المشركين يخوفون الرسول صلى الله عليه وسلم ويتوعدونه بأصنامهم وآلهتهم التي يدعونها من دون الله جهلا منهم وضلالا ولهذا قال عز وجل \"ومن يضلل الله فما له من هاد."
    },
    {
      "ayah": 37,
      "surah": 39,
      "text": "أي منيع الجناب لا يضام من استند إلى جنابه ولجأ إلى بابه فإنه العزيز الذي لا أعز منه ولا أشد انتقاما منه ممن كفر به وأشرك وعاند رسوله صلى الله عليه وسلم."
    },
    {
      "ayah": 38,
      "surah": 39,
      "text": "وقوله تعالى \"ولئن سألتهم من خلق السموات والأرض ليقولن الله\" يعني المشركين كانوا يعترفون بأن الله عز وجل هو الخالق للأشياء كلها ومع هذا يعبدون معه غيره مما لا يملك لهم ضرا ولا نفعا ولهذا قال تبارك وتعالى \"قل أفرأيتم ما تدعون من دون الله إن أرادني الله بضر هل هن كاشفات ضره أو أرادني برحمة هل هن ممسكات رحمته\" أي لا تستطيع شيئا من الأمر وذكر ابن أبي حاتم ههنا حديث قيس بن الحجاج عن حنش الصنعاني عن ابن عباس رضي الله عنهما مرفوعا \"احفظ الله يحفظك احفظ الله تجده تجاهك تعرف إلى الله في الرخاء يعرفك في الشدة إذا سألت فاسأل الله وإذا استعنت فاستعن بالله واعلم أن الأمة لو اجتمعوا على أن يضروك بشيء لم يكتبه الله عليك لم يضروك ولو اجتمعوا على أن ينفعوك بشيء لم يكتبه الله لك لم ينفعوك جفت الصحف ورفعت الأقلام واعمل لله بالشكر في اليقين واعلم أن في الصبر على ما تكره خيرا كثيرا وأن النصر مع الصبر وأن الفرج مع الكرب وأن مع العسر يسرا\" \"قل حسبي الله\" أي الله كافي \"عليه توكلت وعليه فليتوكل المتوكلون\" كما قال هود عليه الصلاة والسلام حين قال قومه \"إن نقول إلا اعتراك بعض آلهتنا بسوء قال إني أشهد الله واشهدوا أني بريء مما تشركون من دونه فكيدوني جميعا ثم لا تنظرون إني توكلت على الله ربي وربكم ما من دابة إلا هو آخذ بناصيتها إن ربي على صراط مستقيم\". وقال ابن أبي حاتم حدثنا أحمد بن عصام الأنصاري حدثنا عبدالله بن بكر السهمي حدثنا محمد بن حاتم عن أبي المقدام مولى آل عثمان عن محمد بن كعب القرظي حدثنا ابن عباس رضي الله عنهما رفع الحديث إلى رسول الله صلى الله عليه وسلم قال \"من أحب أن يكون أقوى الناس فليتوكل على الله ومن أحب أن يكون أغنى الناس فليكن بما في يد الله عز وجل أوثق منه بما في يديه ومن أحب أن يكون أكرم الناس فليتق الله عز وجل \"."
    },
    {
      "ayah": 39,
      "surah": 39,
      "text": "وقوله تعالى \"قل يا قوم اعملوا على مكانتكم\" أي على طريقتكم وهذا تهديد ووعيد \"إني عامل\" أي على طريقتي ومنهجي \"فسوف تعلمون\" أي ستعلمون غب ذلك ووباله."
    },
    {
      "ayah": 4,
      "surah": 39,
      "text": "فقال تبارك وتعالى \"لو أراد الله أن يتخذ ولدا لاصطفى مما يخلق ما يشاء\" أي لكان الأمر على خلاف ما يزعمون وهذا شرط لا يلزم وقوعه ولا جوازه بل هو محال وإنما قصد تجهيلهم فيما ادعوه وزعموه كما قال عز وجل \"لو أردنا أن نتخذ لهوا لاتخذناه من لدنا إن كنا فاعلين\" \"قل إن كان للرحمن ولد فأنا أول العابدين\" كل هذا من باب الشرط ويجوز تعليق الشرط على المستحيل لمقصد المتكلم وقوله تعالى \"سبحانه هو الله الواحد القهار\" أي تعالى وتنزه وتقدس عن أن يكون له ولد فإنه الواحد الأحد الفرد الصمد الذي كل شيء عبد لديه فقير إليه وهو الغنى عما سواه الذي قد قهر الأشياء فدانت له وذلت وخضعت تبارك وتعالى عما يقول الظالمون والجاحدون علوا كبيرا."
    },
    {
      "ayah": 40,
      "surah": 39,
      "text": "\"من يأتيه عذاب يخزيه\" أي في الدنيا \"ويحل عليه عذاب مقيم\" أي دائم ومستمر لا محيد عنه وذلك يوم القيامة أعاذنا الله منها."
    },
    {
      "ayah": 41,
      "surah": 39,
      "text": "يقول تعالى مخاطبا رسوله محمدا صلى الله عليه وسلم \"إنا أنزلنا عليك الكتاب\" يعني القرآن \"للناس بالحق\" أي لجميع الخلق من الإنس والجن لتنذرهم به \"فمن اهتدى فلنفسه\" أي فإنما يعود نفع ذلك إلى نفسه \"ومن ضل فإنما يضل عليها\" أي إنما يرجع وبال ذلك على نفسه \"وما أنت عليهم بوكيل\" أي بموكل أن يهتدوا \"إنما أنت نذير والله على كل شيء وكيل\" \"إنما عليك البلاغ وعلينا الحساب\"."
    },
    {
      "ayah": 42,
      "surah": 39,
      "text": "ثم قال تعالى مخبرا عن نفسه الكريمة بأنه المتصرف في الوجود بما يشاء وأنه يتوفى الأنفس الوفاة الكبرى بما يرسل من الحفظة الذين يقبضونها من الأبدان والوفاة الصغرى عند المنام كما قال تبارك وتعالى \"وهو الذي يتوفاكم بالليل ويعلم ما جرحتم بالنهار ثم يبعثكم فيه ليقضي أجل مسمى إليه مرجعكم ثم ينبئكم بما كنتم تعملون وهو القاهر فوق عباده ويرسل عليكم حفظة حتى إذا جاء أحدكم الموت توفته رسلنا وهم لا يفرطون\" فذكر الوفاتين الصغرى ثم الكبرى وفي هذه الآية ذكر الكبرى ثم الصغرى ولهذا قال تبارك وتعالى \"الله يتوفى الأنفس حين موتها والتي لم تمت في منامها فيمسك التي قضي عليها الموت ويرسل الأخرى إلى أجل مسمى\" فيه دلالة على أنها تجتمع في الملإ الأعلى كما ورد بذلك الحديث المرفوع الذي رواه ابن منده وغيره وفي صحيحي البخاري ومسلم من حديث عبيد الله بن عمر عن سعيد بن أبي سعيد عن أبيه عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم \"إذا أوى أحدكم إلى فراشه فلينفضه بداخلة إزاره فإنه لا يدري ما خلفه عليه ثم ليقل باسمك ربي وضعت جنبي وبك أرفعه إن أمسكت نفسي فارحمها وإن أرسلتها فاحفظها بما تحفظ به عبادك الصالحين\" وقال بعض السلف يقبض أرواح الأموات إذا ماتوا وأرواح الأحياء إذا ناموا فتتعارف ما شاء الله تعالى أن تتعارف \"فيمسك التي قضى عليها الموت\" التي قد ماتت ويرسل الأخرى إلى أجل مسمى قال السدي إلى بقية أجلها وقال ابن عباس رضي الله عنهما يمسك أنفس الأموات ويرسل أنفس الأحياء ولا يغلط \"إن في ذلك لآيات لقوم يتفكرون\"."
    },
    {
      "ayah": 43,
      "surah": 39,
      "text": "يقول تعالى ذاما للمشركين في اتخاذهم شفعاء من دون الله وهم الأصنام والأنداد التي اتخذوها من تلقاء أنفسهم بلا دليل ولا برهان هداهم على ذلك وهي لا تملك شيئا من الأمر بل وليس لها عقل تعقل به ولا سمع تسمع به ولا بصر تبصر به بل هي جمادات أسوأ حالا من الحيوان بكثير."
    },
    {
      "ayah": 44,
      "surah": 39,
      "text": "ثم قال قل أي يا محمد لهؤلاء الزاعمين إن ما اتخذوه شفعاء لهم عند الله تعالى أخبرهم أن الشفاعة لا تنفع عند الله إلا لمن ارتضاه وأذن له فمرجعها كلها إليه \"من ذا الذي يشفع عنده إلا بإذنه\" \"له ملك السموات والأرض\" أي هو المتصرف في جميع ذلك \"ثم إليه ترجعون\" أي يوم القيامة فيحكم بينكم بعدله ويجزي كلا بعمله."
    },
    {
      "ayah": 45,
      "surah": 39,
      "text": "ثم قال تعالى ذاما للمشركين أيضا \"وإذا ذكر الله وحده\" أي إذا قيل لا إله إلا الله وحده \"اشمأزت قلوب الذين لا يؤمنون بالآخرة\" قال مجاهد اشمأزت انقبضت وقال السدي نفرت وقال قتادة كفرت واستكبرت وقال مالك عن زيد بن أسلم استكبرت كما قال تعالى \"إنهم كانوا إذا قيل لهم لا إله إلا الله يستكبرون\" أي عن المتابعة والانقياد لها فقلوبهم لا تقبل الخير ومن لم يقبل الخير يقبل الشر ولذلك قال تبارك وتعالى \"وإذا ذكر الذين من دونه\" أي من الأصنام والأنداد قاله مجاهد \"إذا هم يستبشرون\" أي يفرحون ويسرون."
    },
    {
      "ayah": 46,
      "surah": 39,
      "text": "يقول تبارك وتعالى بعدما ذكر عن المشركين ما ذكر من المذمة لهم في حبهم الشرك ونفرتهم عن التوحيد \"قل اللهم فاطر السموات والأرض عالم الغيب والشهادة\" أي ادع أنت الله وحده لا شريك له الذي خلق السموات والأرض وفطرها أي جعلها على غير مثال سبق \"عالم الغيب والشهادة\" أي السر والعلانية \"أنت تحكم بين عبادك فيما كانوا فيه يختلفون\" أي في دنياهم ستفصل بينهم يوم معادهم ونشورهم وقيامهم من قبورهم. قال مسلم في صحيحه حدثنا عبد بن حميد حدثنا عمر بن يونس حدثنا عكرمة بن عمار حدثنا يحيى بن أبي كثير حدثني أبو سلمة بن عبدالرحمن قال: سألت عائشة رضي الله عنها بأي شيء كان رسول الله صلى الله عليه وسلم يفتتح صلاته إذا قام من الليل؟ قالت رضي الله عنها كان رسول الله صلى الله عليه وسلم إذا قام من الليل افتتح صلاته \"اللهم رب جبريل وميكائيل وإسرافيل فاطر السموات والأرض عالم الغيب والشهادة أنت تحكم بين عبادك فيما كانوا فيه يختلفون اهدني لما اختلف فيه من الحق بإذنك إنك تهدي من تشاء إلى صراط مستقيم\". وقال الإمام أحمد حدثنا عفان حدثنا حماد بن سلمة أخبرنا سهيل عن أبي صالح وعبدالله بن عثمان بن خثيم عن عون بن عبدالله بن عتبة بن مسعود عن عبدالله بن مسعود رضي الله عنه قال: إن رسول الله صلى الله عليه وسلم قال \"من قال اللهم فاطر السموات والأرض عالم الغيب والشهادة إني أعهد إليك في هذه الدنيا أني أشهد أن لا إله إلا أنت وحدك لا شريك لك وأن محمدا عبدك ورسولك فإنك إن تكلني إلى نفسي تقربني من الشر وتباعدني من الخير وإني لا أثق إلا برحمتك فاجعل لي عندك عهدا توفينه يوم القيامة إنك لا تخلف الميعاد إلا قال الله عز وجل لملائكته يوم القيامة إن عبدي قد عهد إلى عهدا فأوفوه إياه فيدخله الله الجنة\" قال سهيل فأخبرت القاسم بن عبدالرحمن أن عونا أخبر بكذا وكذا فقال ما فينا جارية إلا وهي تقول هذا في خدرها انفرد به الإمام أحمد. وقال الإمام أحمد حدثنا حسن حدثنا ابن لهيعة حدثني حيي بن عبدالله أن أبا عبدالرحمن حدثه قال أخرج لنا عبدالله بن عمرو رضي الله عنهما قرطاسا وقال: كان رسول الله صلى الله عليه وسلم يعلمنا نقول \"اللهم فاطر السموات والأرض عالم الغيب والشهادة أنت رب كل شيء وإله كل شيء أشهد أن لا إله إلا أنت وحدك لا شريك لك وأن محمدا عبدك ورسولك والملائكة يشهدون أعوذ بك من الشيطان وشركه وأعوذ بك أن أقترف على نفسي إثما أو أجره إلى مسلم\" قال أبو عبدالرحمن رضي الله عنه كان رسول الله صلى الله عليه وسلم يعلمه عبدالله بن عمرو رضي الله عنهما أن يقول ذلك حين يريد أن ينام تفرد به أحمد أيضا. وقال الإمام أحمد أيضا حدثنا خلف بن الوليد حدثنا ابن عياش عن محمد بن زياد الألهاني عن أبي راشد الحبراني قال: أتيت عبدالله بن عمرو رضي الله عنهما فقلت له حدثنا ما سمعت من رسول الله صلى الله عليه وسلم فألقى بين يدي صحيفة فقال هذا ما كتب لي رسول الله صلى الله عليه وسلم فنظرت فيها فإذا فيها أن أبا بكر الصديق رضي الله عنه قال: يا رسول الله علمني ما أقول إذا أصبحت وإذا أمسيت فقال له رسول الله صلى الله عليه وسلم \" يا أبا بكر قل اللهم فاطر السموات والأرض عالم الغيب والشهادة لا إله إلا أنت رب كل شي ومليكه أعوذ بك من شر نفسي وشر الشيطان وشركه أو أقترف على نفسي سوءا أو أجره إلى مسلم\" ورواه الترمذي عن الحسن بن عرفة عن إسماعيل بن عياش به وقال حسن غريب من هذا الوجه وقال الإمام أحمد حدثنا هاشم حدثنا سيار عن ليث عن مجاهد قال: قال أبو بكر الصديق أمرني رسول الله صلى الله عليه وسلم أن أقول إذا أصبحت وإذا أمسيت وإذا أخذت مضجعي من الليل \"اللهم فاطر السموات والأرض الخ\"."
    },
    {
      "ayah": 47,
      "surah": 39,
      "text": "وقوله عز وجل \"ولو أن للذين ظلموا\" وهم المشركون \"ما في الأرض جميعا ومثله معه\" أي ولو أن جميع ما في الأرض وضعفه معه \"لافتدوا به من سوء العذاب\" أي الذي أوجبه الله تعالى لهم يوم القيامة ومع هذا لا يقبل منهم الفداء ولو كان ملء الأرض ذهبا كما قال في الآية الأخرى \"وبدا لهم من الله ما لم يكونوا يحتسبون\" أي وظهر لهم من الله من العذاب والنكال بهم ما لم يكن في بالهم ولا في حسابهم."
    },
    {
      "ayah": 48,
      "surah": 39,
      "text": "\"وبدا لهم سيئات ما كسبوا\" أي وظهر لهم جزاء ما اكتسبوا في الدار الدنيا من المحارم والمأثم \"وحاق بهم ما كانوا به يستهزئون\" أي وأحاط بهم من العذاب والنكال ما كانوا يستهزئون به في الدار الدنيا."
    },
    {
      "ayah": 49,
      "surah": 39,
      "text": "يقول تبارك وتعالى مخبرا عن الإنسان أنه في حال الضراء يتضرع إلى الله عز وجل وينيب إليه ويدعوه وإذا خوله نعمة منه بغى وطغى وقال \"إنما أوتيته على علم\" أي لما يعلم الله تعالى من استحقاقي له ولولا أني عند الله خصيص لما خولني هذا قال قتادة على علم عندي على خبر عندي قال الله عز وجل \"بل هي فتنة\" أي ليس الأمر كما زعم بل إنما أنعمنا عليه بهذه النعمة لنختبره فيما أنعمنا عليه أيطيع أم يعصي مع علمنا المتقدم بذلك فهي فتنة. أي اختبار \"ولكن أكثرهم لا يعلمون\" فلهذا يقولون ما يقولون ويدعون."
    },
    {
      "ayah": 5,
      "surah": 39,
      "text": "يخبر تعالى أنه الخالق لما في السموات والأرض وما بين ذلك من الأشياء وبأنه مالك الملك المتصرف فيه يقلب ليله ونهاره \"يكور الليل على النهار ويكور النهار على الليل\" أي سخرهما يجريان متعاقبين لا يفتران كل منهما يطلب الآخر طلبا حثيثا كقوله تبارك وتعالى \"يغشى الليل النهار يطلبه حثيثا\" هذا معنى ما روي عن ابن عباس رضي الله عنهما ومجاهد وقتادة والسدي وغيرهم. وقوله عز وجل \"وسخر الشمس والقمر كل يجري لأجل مسمى\" أي إلى مدة معلومة عند الله تعالى ثم ينقضي يوم القيامة \"ألا هو العزيز الغفار\" أي مع عزته وعظمته وكبريائه هو غفار لمن عصاه ثم تاب وأناب إليه."
    },
    {
      "ayah": 50,
      "surah": 39,
      "text": "أي قد قال هذه المقالة وزعم هذا الزعم وادعى هذه الدعوى كثير ممن سلف من الأمم \"فما أغنى عنهم ما كانوا يكسبون\" أي فما صح قولهم ولا نفعهم جمعهم وما كانوا يكسبون."
    },
    {
      "ayah": 51,
      "surah": 39,
      "text": "\"فأصابهم سيئات ما كسبوا والذين ظلموا من هؤلاء\" أي من المخاطبين \"سيصيبهم سيئات ما كسبوا\" أي كما أصاب أولئك \"وما هم بمعجزين\" كما قال تبارك وتعالى مخبرا عن قارون أنه قال له قومه\"لا تفرح إن الله لا يحب الفرحين وابتغ فيما آتاك الله الدار الآخرة ولا تنس نصيبك من الدنيا وأحسن كما أحسن الله إليك ولا تبغ الفساد في الأرض إن الله لا يحب المفسدين قال إنما أوتيته على علم عندي أو لم يعلم أن الله قد أهلك من قبله من القرون من هو أشد منه قوة وأكثر جمعا ولا يسئل عن ذنوبهم المجرمون\" وقال تعالى \"وقالوا نحن أكثر أموالا وأولادا وما نحن بمعذبين\"."
    },
    {
      "ayah": 52,
      "surah": 39,
      "text": "وقوله تبارك وتعالى \"أو لم يعلموا أن الله يبسط الرزق لمن يشاء ويقدر\" أي يوسعه على قوم ويضيقه على آخرين \"إن في ذلك لآيات لقوم يؤمنون\" أي لعبرا وحججا."
    },
    {
      "ayah": 53,
      "surah": 39,
      "text": "هذه الآية الكريمة دعوة لجميع العصاة من الكفرة وغيرهم إلى التوبة والإنابة وإخبار بأن الله تبارك وتعالى يغفر الذنوب جميعا لمن تاب منها ورجع عنها وإن كانت مهما كانت وإن كثرت وكانت مثل زبد البحر ولا يصح حمل هذه على غير توبة لأن الشرك لا يغفر لمن لم يتب منه. قال البخاري حدثنا إبراهيم بن موسى أخبرنا هشام بن يوسف أن ابن جريج أخبرهم قال يعلى إن سعيد بن جبير أخبره عن ابن عباس رضي الله عنهما أن ناسا من أهل الشرك كانوا قد قتلوا فأكثروا وزنوا فأكثروا فأتوا محمد صلى الله عليه وسلم فقالوا إن الذي تقول وتدعو إليه لحسن لو تخبرنا أن لما عملنا كفار فنزل \"والذين لا يدعون مع الله إلها آخر ولا يقتلون النفس التي حرم الله إلا بالحق ولا يزنون\" ونزل \"قل يا عبادي الذين أسرفوا على أنفسهم لا تقنطوا من رحمة الله\" وهكذا رواه مسلم وأبو داود والنسائي من حديث ابن جريج عن يعلى بن مسلم المكي عن سعيد بن جبير عن ابن عباس رضي الله عنهما به. والمراد من الآية الأولى قوله تعالى \"إلا من تاب وآمن وعمل عملا صالحا\" الآية. وقال الإمام أحمد حدثنا حسن ثنا ابن لهيعة حدثنا أبو قبيل قال: سمعت أبا عبدالرحمن المزني يقول سمعت ثوبان مولى رسول الله صلى الله عليه وسلم يقول سمعت رسول الله صلى الله عليه وسلم يقول: \"ما أحب أن لي الدنيا وما فيها بهذه الآية \"قل يا عبادي الذين أسرفوا على أنفسهم\" إلى آخر الآية فقال رجل يا رسول الله فمن أشرك؟ فسكت النبي صلى الله عليه وسلم ثم قال \"ألا ومن أشرك\" - ثلاث مرات - تفرد به الإمام أحمد. وقال الإمام أحمد أيضا حدثنا شريح بن النعمان حدثنا نوح بن قيس عن أشعث بن جابر الحداني عن مكحول عن عمرو بن عنبسة رضي الله عنه قال جاء رجل إلى النبي صلى الله عليه وسلم شيخ كبير يدعم على عصا له فقال: يا رسول الله إن لي غدرات وفجرات فهل يغفر لي؟ فقال صلى الله عليه وسلم \"ألست تشهد أن لا إله إلا الله؟\" قال: بلى وأشهد أنك رسول الله فقال صلى الله عليه وسلم \"قد غفر لك غدراتك وفجراتك\" تفرد به أحمد. وقال الإمام أحمد حدثنا يزيد بن هارون حدثنا حماد بن سلمة عن ثابت عن شهر بن حوشب عن أسماء بنت يزيد رضي الله عنها قالت سمعت رسول الله صلى الله عليه وسلم يقرأ \"إنه عمل غير صالح\" وسمعته صلى الله عليه وسلم يقول \"قل يا عبادي الذين أسرفوا على أنفسهم لا تقنطوا من رحمة الله إن الله يغفر الذنوب جميعا\" ولا يبالي \"إنه هو الغفور الرحيم\" ورواه أبو داود والترمذي من حديث ثابت فهذه الأحاديث كلها دالة على أن المراد أنه يغفر جميع ذلك مع التوبة ولا يقنطن عبد من رحمة الله وإن عظمت ذنوبه وكثرت فإن باب الرحمة والتوبة واسع قال الله تعالى \"ألم يعلموا أن الله هو يقبل التوبة عن عباده\" وقال عز وجل \"ومن يعمل سوءا أو يظلم نفسه ثم يستغفر الله يجد الله غفورا رحيما\" وقال جل وعلا في حق المنافقين \"إن المنافقين في الدرك الأسفل من النار ولن تجد لهم نصيرا إلا الذين تابوا واصلحوا\" وقال جل جلاله \"لقد كفر الذين قالوا إن الله ثالث ثلاثة وما من إله إلا إله واحد وإن لم ينتهوا عما يقولون ليمسن الذين كفروا منهم عذاب أليم\" ثم قال جلت عظمته \"أفلا يتوبون إلى الله ويستغفرونه والله غفور رحيم\" وقال تبارك وتعالى \"إن الذين فتنوا المؤمنين والمؤمنات ثم لم يتوبوا\" قال الحسن البصري رحمة الله عليه انظروا إلى هذا الكرم والجود قتلوا أولياءه وهو يدعوهم إلى التوبة والمغفرة والآيات في هذا كثيرة جدا. وفي الصحيحين عن أبي سعيد رضي الله عنه عن رسول الله صلى الله عليه وسلم حديث الذي قتل تسعة وتسعين نفسا ثم ندم وسأل عابدا من عباد بني إسرائيل هل له من توبة؟ فقال لا فقتله وأكمل به مائة ثم سأل عالما من علمائهم هل له من توبة فقال ومن يحول بينك وبين التوبة؟ ثم أمره بالذهاب إلى قرية يعبد الله فيها فقصدها فأتاه الموت في أثناء الطريق فاختصمت فيه ملائكة الرحمة وملائكة العذاب فأمر الله عز وجل أن يقيسوا ما بين الأرضين فإلى أيهما كان أقرب فهو منها فوجدوه أقرب إلى الأرض التي هاجر إليها بشبر فقبضته ملائكة الرحمة وذكر أنه نأى بصدره عند الموت وأن الله تبارك وتعالى أمر البلدة الخيرة أن تقترب وأمر تلك البلدة أن تتباعد هذا معنى الحديث وقد كتبناه في موضع آخر بلفظه قال علي بن أبي طلحة عن ابن عباس رضي الله عنهما في قوله عز وجل \"قل يا عبادي الذين أسرفوا على أنفسهم لا تقنطوا من رحمة الله إن الله يغفر الذنوب جميعا\" إلى آخر الآية قال قد دعا الله تعالى إلى مغفرته من زعم أن المسيح هو الله ومن زعم أن المسيح هو ابن الله ومن زعم أن عزيرا ابن الله ومن زعم أن الله فقير ومن زعم أن يد الله مغلولة ومن زعم أن الله ثالث ثلاثة يقول الله تعالى لهؤلاء \"أفلا يتوبون إلى الله ويستغفرونه والله غفور رحيم\" ثم دعا إلى التوبة من هو أعظم قولا من هؤلاء من قال أنا ربكم الأعلى وقال\" ما علمت لكم من إله غيري\" قال ابن عباس رضي الله تعالى عنهما من آيس عباد الله من التوبة بعد هذا فقد جحد كتاب الله عز وجل. ولكن لا يقدر العبد أن يتوب حتى يتوب الله عليه وروي الطبراني من طريق الشعبي عن سنيد بن شكل أنه قال سمعت ابن مسعود يقول إن أعظم آية في كتاب الله \"الله لا إله إلا هو الحي القيوم\" وإن أجمع آية في القرآن بخير وشر \"إن الله يأمر بالعدل والإحسان\" وإن أكثر آية في القرآن فرحا في سورة الغرف \"قل يا عبادي الذي أسرفوا على أنفسهم لا تقنطوا من رحمة الله\" وإن أشد آية في كتاب الله تفويضا \"ومن يتق الله يجعل له مخرجا ويرزقه من حيث لا يحتسب\" فقال له مسروق صدقت. وقال الأعمش عن أبي سعيد عن أبي الكنود قال مر عبدالله - يعني ابن مسعود - رضي الله عنه على قاص وهو يذكر الناس فقال يا مذكر لم تقنط الناس من رحمة الله؟ ثم قرأ \"قل يا عبادي الذين أسرفوا على أنفسهم لا تقنطوا من رحمة الله\" رواه ابن أبي حاتم رحمه الله. \"ذكر أحاديث فيها نفي القنوط\". قال الإمام أحمد حدثنا شريح بن النعمان حدثنا أبو عبيدة عبدالمؤمن بن عبيدالله السدي حدثني حسن السدوسي قال دخلت على أنس بن مالك رضي الله تعالى عنه فقال سمعت رسول الله صلى الله عليه وسلم يقول \"والذي نفسي بيده لو أخطأتم حتى تملأ خطاياكم ما بين السماء والأرض ثم استغفرتم الله تعالى لغفر لكم\" والذي نفس محمد صلى الله عليه وسلم بيده لو لم تخطئوا لجاء الله عز وجل بقوم يخطئون ثم يستغفرون الله فيغفر لهم \" تفرد به أحمد. وقال الإمام أحمد حدثنا إسحاق بن عيسى حدثني الليث حدثني محمد بن قيس قاص عمر بن عبد العزيز عن أبي صرمة عن أبي أيوب الأنصاري رضي الله عنه أنه قال حين حضرته الوفاة قد كنت كتمت منكم شيئا سمعته من رسول الله صلى الله عليه وسلم يقول \" لولا أنكم تذنبون لخلق الله عز وجل قوما يذنبون فيغفر لهم\" هكذا رواه الإمام أحمد وأخرجه مسلم في صحيحه والترمذي جميعا عن قتيبة عن الليث بن سعد به. ورواه مسلم من وجه آخر به عن محمد بن كعب القرظي عن أبي صرمة - وهو الأنصاري صحابي عن أبي أيوب رضي الله تعالى عنهما به. وقال الإمام أحمد حدثنا أحمد بن عبدالملك الحراني حدثنا يحيى بن عمرو بن مالك البكري قال سمعت أبي يحدث عن أبي الجوزاء عن ابن عباس رضي الله تعالى عنهما قال: قال رسول الله صلى الله عليه وسلم \" كفارة الذنب الندامة \" وقال رسول الله صلى الله عليه وسلم \" لو لم تذنبوا لجاء الله تعالى بقوم يذنبون فيغفر لهم \" تفرد به أحمد. وقال عبدالله ابن الإمام أحمد حدثني عبد الأعلى بن حماد القرشي حدثنا داود بن عبدالرحمن حدثنا أبو عبدالله مسلمة بن عبدالله الرازي عن أبي عمرو البجلي عن عبد الملك بن سفيان الثقفي عن أبي جعفر محمد بن علي عن محمد بن الحنفية عن أبيه علي بن أبي طالب رضي الله تعالى عنه قال: قال رسول الله صلى الله عليه وسلم \" إن الله تعالى يحب العبد المفتن التواب \" ولم يخرجوه من هذا الوجه. وقال ابن أبي حاتم حدثنا أبي حدثنا موسى بن إسماعيل حدثنا حماد حدثنا ثابت وحميد عن عبدالله بن عبيد بن عمير قال \" إن إبليس - لعنه الله تعالى - قال يا رب إنك أخرجتني من الجنة من أجل آدم وإني لا أستطيعه إلا بسلطانك قال فأنت مسلط قال يا رب زدني قال لا يولد له ولد إلا ولد لك مثله قال يا رب زدني قال أجعل صدورهم مساكن لكم وتجرون منهم مجرى الدم قال يا رب زدني قال أجلب عليهم بخيلك ورجلك وشاركهم في الأموال والأولاد وعدهم وما يعدهم الشيطان إلا غرورا فقال آدم عليه الصلاة والسلام يا رب قد سلطته علي وإني لا أمتنع إلا بك قال تبارك وتعالى لا يولد لك ولد إلا وكلت به من يحفظه من قرناء السوء قال يا رب زدني قال الحسنة عشر أو أزيد والسيئة واحدة أو أمحوها قال يا رب زدني قال باب التوبة مفتوح ما كان الروح في الجسد قال يا رب زدني قال \"يا عبادي الذين أسرفوا على أنفسهم لا تقنطوا من رحمة الله إن الله يغفر الذنوب جميعا إنه هو الغفور الرحيم\". وقال محمد بن إسحاق قال نافع عن عبدالله بن عمر عن عمر رضي الله عنهما في حديثه قال وكنا نقول ما الله بقابل ممن افتتن صرفا ولا عدلا ولا توبة عرفوا الله ثم رجعوا إلى الكفر لبلاء أصابهم قال وكانوا يقولون ذلك لأنفسهم قال فلما قدم رسول الله صلى الله عليه وسلم المدينة أنزل الله تعالى فيهم وفي قولنا وقولهم لأنفسهم \"يا عبادي الذين أسرفوا على أنفسهم لا تقنطوا من رحمة الله إن الله يغفر الذنوب جميعا إنه هو الغفور الرحيم وأنيبوا إلى ربكم وأسلموا له من قبل أن يأتيكم العذاب ثم لا تنصرون واتبعوا أحسن ما أنزل إليكم من ربكم من قبل أن يأتيكم العذاب بغتة وأنتم لا تشعرون\" قال عمر رضي الله عنه فكتبتها بيدي في صحيفة وبعثت بها إلى هشام بن العاص رضي الله عنه قال: فقال هشام لما أتتني جعلت أقرأها بذي طوى أصعد بها فيه وأصوت ولا أفهمها حتى قلت اللهم أفهمنيها قال فألقى الله عز وجل في قلبي أنها إنما أنزلت فينا وفيما كنا نقول في أنفسنا ويقال فينا فرجعت إلى بعيري فجلست عليه فلحقت برسول الله صلى الله عليه وسلم بالمدينة."
    },
    {
      "ayah": 54,
      "surah": 39,
      "text": "ثم استحث تبارك وتعالى عباده إلى المسارعة إلى التوبة فقال \"وأنيبوا إلى ربكم وأسلموا له\" إلخ: أي ارجعوا إلى الله واستسلموا له \"من قبل أن يأتيكم العذاب ثم لا تنصرون\" أي بادروا بالتوبة والعمل الصالح قبل حلول النقمة."
    },
    {
      "ayah": 55,
      "surah": 39,
      "text": "\"واتبعوا أحسن ما أنزل إليكم من ربكم\" وهو القرآن العظيم \"من قبل أن يأتيكم العذاب بغتة وأنتم لا تشعرون\" أي من حيث لا تعلمون ولا تشعرون."
    },
    {
      "ayah": 56,
      "surah": 39,
      "text": "ثم قال عز وجل \"أن تقول نفس يا حسرتى على ما فرطت في جنب الله\" أي يوم القيامة يتحسر المجرم المفرط في التوبة والإنابة ويود لو كان من المحسنين المخلصين المطيعين لله عز وجل وقوله تبارك وتعالى \"وإن كنت لمن الساخرين\" أي إنما كان عملي في الدنيا عمل ساخر مستهزئ غير موقن مصدق."
    },
    {
      "ayah": 57,
      "surah": 39,
      "text": "\"أو تقول لو أن الله هداني لكنت من المتقين أو تقول حين ترى العذاب لو أن لي كرة فأكون من المحسنين\" أي تود لو أعيدت إلى الدنيا لتحسن العمل. قال علي بن أبي طلحة عن ابن عباس رضي الله تعالى عنهما أخبر الله سبحانه وتعالى ما العباد قائلون قبل أن يقولوه وعملهم قبل أن يعملوه وقال تعالى \"ولا ينبئك مثل خبير\" \"أن تقول نفس يا حسرتا على ما فرطت في جنب الله وإن كنت لمن الساخرين أو تقول لو أن الله هداني لكنت من المتقين أو تقول حين ترى العذاب لو أن لي كرة فأكون من المحسنين\" فأخبر الله عز وجل أن لو ردوا لما قدروا على الهدى فقال \"ولو ردوا لعادوا لما نهوا عنه وإنهم لكاذبون\" وقد قال الإمام أحمد حدثنا أسود حدثنا أبو بكر عن الأعمش عن أبي صالح عن أبي هريرة رضي الله تعالى عنه قال: قال رسول الله صلى الله عليه وسلم \" كل أهل النار يرى مقعده من الجنة فيقول لو أن الله هداني فتكون عليه حسرة قال وكل أهل الجنة يرى مقعده من النار فيقول لولا أن الله هداني قال فيكون له الشكر\" ورواه النسائي من حديث أبي بكر بن عياش به ولما تمنى أهل الجرائم العود إلى الدنيا وتحسروا على تصديق آيات الله واتباع رسله."
    },
    {
      "ayah": 58,
      "surah": 39,
      "text": "\"أو تقول لو أن الله هداني لكنت من المتقين أو تقول حين ترى العذاب لو أن لي كرة فأكون من المحسنين\" أي تود لو أعيدت إلى الدنيا لتحسن العمل. قال علي بن أبي طلحة عن ابن عباس رضي الله تعالى عنهما أخبر الله سبحانه وتعالى ما العباد قائلون قبل أن يقولوه وعملهم قبل أن يعملوه وقال تعالى \"ولا ينبئك مثل خبير\" \"أن تقول نفس يا حسرتا على ما فرطت في جنب الله وإن كنت لمن الساخرين أو تقول لو أن الله هداني لكنت من المتقين أو تقول حين ترى العذاب لو أن لي كرة فأكون من المحسنين\" فأخبر الله عز وجل أن لو ردوا لما قدروا على الهدى فقال \"ولو ردوا لعادوا لما نهوا عنه وإنهم لكاذبون\" وقد قال الإمام أحمد حدثنا أسود حدثنا أبو بكر عن الأعمش عن أبي صالح عن أبي هريرة رضي الله تعالى عنه قال: قال رسول الله صلى الله عليه وسلم \" كل أهل النار يرى مقعده من الجنة فيقول لو أن الله هداني فتكون عليه حسرة قال وكل أهل الجنة يرى مقعده من النار فيقول لولا أن الله هداني قال فيكون له الشكر\" ورواه النسائي من حديث أبي بكر بن عياش به ولما تمنى أهل الجرائم العود إلى الدنيا وتحسروا على تصديق آيات الله واتباع رسله قال تعالى \"بلى قد جاءتك آياتي فكذبت بها واستكبرت وكنت من الكافرين\"."
    },
    {
      "ayah": 59,
      "surah": 39,
      "text": "أي قد جاءتك أيها العبد النادم على ما كان منه آيات في الدار الدنيا وقامت حججي عليك فكذبت بها واستكبرت عن اتباعها وكنت من الكافرين بها الجاحدين لها."
    },
    {
      "ayah": 6,
      "surah": 39,
      "text": "وقوله جلت عظمته \"خلقكم من نفس واحدة\" أي خلقكم مع اختلاف أجناسكم وأصنافكم وألسنتكم وألوانكم من نفس واحدة وهو آدم عليه الصلاة والسلام \"ثم جعل منها زوجها\" وهي حواء عليها السلام كقوله تعالى \"يا أيها الناس اتقوا ربكم الذي خلقكم من نفس واحدة وخلق منها زوجها وبث منهما رجالا كثيرا ونساء\" وقوله تعالى \"وأنزل لكم من الأنعام ثمانية أزواج\" أي وخلق لكم من ظهور الأنعام ثمانية أزواج وهي المذكورة في سورة الأنعام ثمانية أزواج من الضأن اثنين ومن المعز اثنين ومن الإبل اثنين ومن البقر اثنين وقوله عز وجل \"يخلقكم في بطون أمهاتكم\" أي قدركم في بطون أمهاتكم \"خلقا من بعد خلق\" يكون أحدكم أولا نطفة ثم يكون علقة ثم يكون مضغة ثم يخلق فيكون لحما وعظما وعصبا وعروقا وينفخ فيه الروح فيصير خلق آخر \"فتبارك الله أحسن الخالقين\". وقوله جل وعلا \"في ظلمات ثلاث\" يعني في ظلمة الرحم وظلمة المشيمة التي هي كالغشاوة والوقاية على الولد وظلمة البطن كذا قال ابن عباس رضي الله عنهما ومجاهد وعكرمة وأبو مالك والضحاك وقتادة والسدي وابن زيد. وقوله جل جلاله \"ذلكم الله ربكم\" أي هذا الذي خلق السموات والأرض وما بينهما وخلقكم وخلق آباءكم هو الرب له الملك والتصرف في جميع ذلك \"لا إله إلا هو\" أي الذي لا تنبغي العبادة إلا له وحده لا شريك له \"فأنى تصرفون\" أي فكيف تعبدون معه غيره؟ أين يذهب بعقولكم؟."
    },
    {
      "ayah": 60,
      "surah": 39,
      "text": "يخبر تعالى عن يوم القيامة أنه تسود فيه وجوه وتبيض فيه وجوه تسود وجوه أهل الفرقة والاختلاف وتبيض وجوه أهل السنة والجماعة قال تعالى ههنا \"ويوم القيامة ترى الذين كذبوا على الله\" أي في دعواهم له شريكا وولدا \"وجوههم مسودة\" أي بكذبهم وافترائهم وقوله تعالى \"أليس في جهنم مثوى للمتكبرين\" أي أليست جهنم كافية لهم سجنا وموئلا لهم فيها الخزي والهوان بسبب تكبرهم وتجبرهم وإبائهم عن الانقياد للحق. قال ابن أبي حاتم حدثنا أبو عبيدالله ابن أخي ابن وهب حدثنا عمي حدثنا عيسى بن أبي عيسى الخياط عن عمرو بن شعيب عن أبيه عن جده رضي الله عنه أن رسول الله صلى الله عليه وسلم قال \"إن المتكبرين يحشرون يوم القيامة أشباه الذر في صور الناس يعلوهم كل شيء من الصغار حتى يدخلوا سجنا من النار في واد يقال له بولس من نار الأنيار ويسقون من عصارة أهل النار ومن طينة الخبال\"."
    },
    {
      "ayah": 61,
      "surah": 39,
      "text": "وقوله تبارك وتعالى \"وينجي الله الذين اتقوا بمفازتهم\" أي بما سبق لهم من السعادة والفوز عند الله \"لا يمسهم السوء\" أي يوم القيامة \"ولا هم يحزنون\" أي ولا يحزنهم الفزع الأكبر بل هم آمنون من كل فزع مزحزحون عن كل شر نائلون كل خير."
    },
    {
      "ayah": 62,
      "surah": 39,
      "text": "يخبر تعالى أنه خالق الأشياء كلها وربها ومليكها والمتصرف فيها وكل تحت تدبير وقهره وكلاءته."
    },
    {
      "ayah": 63,
      "surah": 39,
      "text": "وقوله عز وجل \"له مقاليد السموات والأرض\" قال مجاهد: المقاليد هي المفاتيح بالفارسية وكذا قال قتادة وابن زيد وسفيان ابن عينة وقال السدي \"له مقاليد السموات والأرض\" أي خزائن السموات والأرض والمعنى على كلا القولين أن أزمة الأمور بيده تبارك وتعالى له الملك وله الحمد وهو على كل شيء قدير ولهذا قال جل وعلا \"والذين كفروا بآيات الله\" أي حججه وبراهينه \"أولئك هم الخاسرون\" وقد روى ابن أبي حاتم ههنا حديثا غريبا جدا وفي صحته نظر ولكن نحن نذكره كما ذكره فإنه قال حدثنا يزيد بن سنان البصري بمصر حدثنا يحيى بن حماد حدثنا الأغلب بن تميم عن مخلد بن هذيل العبدي عن عبدالرحمن المدني عن عبدالله بن عمر عن عثمان بن عفان رضي الله عنه أنه سأل رسول الله صلى الله عليه وسلم عن تفسير قوله تعالى \"له مقاليد السموات والأرض\" فقال \"ما سألني عنها أحد قبلك يا عثمان\" قال صلى الله عليه وسلم \"تفسيرها لا إله إلا الله والله أكبر وسبحان الله وبحمده استغفر الله ولا قوة إلا بالله الأول والآخر والظاهر والباطن بيده الخير يحيي ويميت وهو على كل شيء قدير من قالها يا عثمان إذا أصبح عشر مرار أعطي خصالا ستا: أما أولاهن فيحرس من إبليس وجنوده وأما الثانية فيعطي قنطارا من الأجر وأما الثالثة فترفع له درجة في الجنة وأما الرابعة فيتزوج من الحور العين وأما الخامسة فيحضره اثنا عشر ملكا وأما السادسة فيعطي من الأجر كمن قرأ القرآن والتوراة والإنجيل والزبور وله مع هذا يا عثمان من الأجر كمن حج وتقبلت حجته واعتمر فتقبلت عمرته فإن مات من يومه طبع عليه بطابع الشهداء\" ورواه أبو يعلى الموصلي من حديث يحيى بن حماد به مثله وهو غريب وفيه نكارة شديدة والله أعلم."
    },
    {
      "ayah": 64,
      "surah": 39,
      "text": "ذكروا في سبب نزولها ما رواه ابن أبي حاتم وغيره عن ابن عباس رضي الله عنهما أن المشركين من جهلهم دعوا رسول الله إلى عبادة آلهتهم ويعبدوا معه إلهه فنزلت \"قل أفغير الله تأمروني أعبد أيها الجاهلون."
    },
    { "ayah": 65, "surah": 39, "text": "وهذه كقوله تعالى \"ولو أشركوا لحبط عنهم ما كانوا يعملون\"." },
    { "ayah": 66, "surah": 39, "text": "أي أخلص العبادة لله وحده لا شريك له أنت ومن اتبعك وصدقك." },
    {
      "ayah": 67,
      "surah": 39,
      "text": "يقول تبارك وتعالى \"وما قدروا الله حق قدره\" أي ما قدر المشركون الله حق قدره حين عبدوا معه غيره وهو العظيم الذي لا أعظم منه القادر على كل شيء المالك لكل شيء وكل شيء تحت قهره وقدرته قال مجاهد نزلت في قريش وقال السدي ما عظموه حق تعظيمه وقال محمد بن كعب لو قدروه حق قدره ما كذبوا. وقال علي بن أبي طلحة عن ابن عباس رضي الله عنهما \"وما قدروا الله حق قدره هم الكفار الذين لم يؤمنوا بقدرة الله عليهم فمن آمن أن الله على كل شي قدير فقد قدر الله حق قدره ومن لم يؤمن بذلك فلم يقدر الله حق قدره وقد وردت أحاديث كثيرة متعلقة بهذه الآية الكريمة والطريق فيها وفي أمثالها مذهب السلف وهو إمرارها كما جاءت من غير تكييف ولا تحريف. قال البخاري قوله تعالى \"وما قدروا الله حق قدره\" حدثنا آدم حدثنا سفيان عن منصور عن إبراهيم عن عبيدة عن عبدالله بن مسعود رضي الله عنه قال: جاء حبر من الأحبار إلى رسول الله صلى الله عليه وسلم فقال يا محمد إنا نجد أن الله عز وجل يجعل السموات على أصبع والأرضين على أصبع والشجر على أصبع والماء والثرى على أصبع وسائر الخلق على أصبع فيقول أنا الملك فضحك رسول الله صلى الله عليه وسلم حتى بدت نواجذه تصديقا لقول الحبر ثم قرأ رسول الله صلى الله عليه وسلم \"وما قدروا الله حق قدره والأرض جميعا قبضته يوم القيامة\" الآية ورواه البخاري أيضا في غير هذا الموضع من صحيحه والإمام أحمد ومسلم والترمذي والنسائي في التفسير من سننيهما كلهم من حديث سليمان بن مهران الأعمش عن إبراهيم عن عبيدة عن ابن مسعود رضي الله عنه بنحوه وقال الإمام أحمد حدثنا أبو معاوية حدثنا الأعمش عن إبراهيم عن علقمة عن عبدالله رضي الله عنه قال جاء رجل إلى النبي صلى الله عليه وسلم من أهل الكتاب فقال يا أبا القاسم أبلغك أن الله تعالى يحمل الخلائق على أصبع والسموات على أصبع والأرضين على أصبع والشجر على أصبع والماء والثرى على أصبع؟ قال فضحك رسول الله صلى الله عليه وسلم حتى بدت نواجذه قال وأنزل الله عز وجل \"وما قدروا الله حق قدره\" إلى آخر الآية وهكذا رواه البخاري ومسلم والنسائي من طرق عن الأعمش به وقال الإمام أحمد حدثنا حسين بن حسن الأشقر حدثنا أبو كدينة عن عطاء عن أبي الضحى عن ابن عباس رضي الله عنهما قال مر يهودي برسول الله صلى الله عليه وسلم وهو جالس فقال: كيف تقول يا أبا القاسم يوم يجعل الله سبحانه وتعالى السماء على ذه - وأشار بالسبابة- والأرض على ذه والجبال على ذه وسائر الخلق على ذه - كل ذلك يشير بأصابعه - قال فأنزل الله عز وجل \"وما قدروا الله حق قدره\" الآية وكذا رواه الترمذي في التفسير عن عبدالله بن عبدالرحمن الدارمي عن محمد بن الصلت عن أبي جعفر عن أبي كدينة يحيى بن المهلب عن عطاء بن السائب عن أبي الضحى مسلم بن صبيح به وقال الحسن صحيح غريب لا نعرفه إلا من هذا الوجه. ثم قال البخاري حدثنا سعيد بن عفير حدثنا الليث حدثنا عبدالرحمن بن خالد بن مسافر عن ابن شهاب عن أبي سلمة بن عبدالرحمن أن أبا هريرة رضي الله عنه قال: سمعت رسول الله صلى الله عليه وسلم يقول \"يقبض الله تعالى الأرض ويطوي السماء بيمينه ثم يقول أنا الملك أين ملوك الأرض\" تفرد به من هذا الوجه ورواه مسلم من وجه آخر. وقال البخاري في موضع آخر حدثنا مقدم بن محمد حدثنا عمي القاسم بن يحيى عن عبيدالله عن نافع عن ابن عمر رضي الله عنهما عن رسول الله صلى الله عليه وسلم قال \"إن الله تبارك وتعالى يقبض يوم القيامة الأرضين على أصبع وتكون السموات بيمينه ثم يقول أنا الملك\" تفرد به أيضا من هذا الوجه ورواه مسلم من وجه آخر وقد رواه الإمام أحمد من طريق أخرى بلفظ آخر أبسط من هذا السياق وأطول فقال حدثنا عفان حدثنا حماد بن سلمة أخبرنا إسحاق بن عبدالله بن أبي طلحة عن عبيدالله بن مقسم عن ابن عمر رضي الله عنهما قال إن رسول الله صلى الله عليه وسلم قرأ هذه الآية ذات يوم على المنبر \"وما قدروا الله حق قدره والأرض جميعا قبضته يوم القيامة والسموات مطويات بيمينه سبحانه وتعالى عما يشركون\" ورسول الله صلى الله عليه وسلم يقول هكذا بيده يحركها يقبل بها ويدبر\" يمجد الرب نفسه أنا الجبار أنا المتكبر أنا الملك أنا العزيز أنا الكريم\" فرجف برسول الله صلى الله عليه وسلم المنبر حتى قلنا ليخرن به وقد رواه مسلم والنسائي وابن ماجه من حديث عبد العزيز بن أبي حازم زاد مسلم ويعقوب بن عبدالرحمن كلاهما عن أبي حازم عن عبيدالله بن مقسم عن ابن عمر رضي الله عنهما به نحوه ولفظ مسلم عن عبيدالله بن مقسم في هذا الحديث أنه نظر إلى عبدالله بن عمر رضي الله عنهما كيف يحكي النبي صلى الله عليه وسلم قال يأخذ الله تبارك وتعالى سمواته وأرضيه بيده ويقول أنا الملك ويقبض أصابعه ويبسطها أنا الملك حتى نظرت إلى المنبر يتحرك من أسفل شيء منه حتى أني لأقول أساقط هو برسول الله؟ صلى الله عليه وسلم. وقال البزار حدثنا سليمان بن سيف حدثنا أبو علي الحنفي حدثنا عباد المنقري حدثني محمد بن المنكدر قال حدثنا عبدالله بن عمر رضي الله عنهما قال: إن رسول الله صلى الله عليه وسلم قرأ هذه الآية على المنبر \"وما قدروا الله حق قدره\" - حتى بلغ -\" سبحانه وتعالى عما يشركون\" فقال المنبر هكذا فجاء وذهب ثلاث مرات والله أعلم ورواه الإمام الحافظ أبو القاسم الطبراني من حديث عبيد بن عمير عن عبدالله بن عمرو رضي الله عنهما وقال صحيح وقال الطبراني في المعجم الكبير حدثنا عبدالرحمن بن معاوية العتبي حدثنا حسان بن نافع عن صخر بن جويرية حدثنا سعيد بن سالم القداح عن معمر بن الحسن عن بكر بن خنيس عن أبي شيبة عن عبدالملك بن عمير عن جرير رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم لنفر من أصحابه رضي الله عنهم \"إني قارئ عليكم آيات من آخر سورة الزمر فمن بكى منكم وجبت له الجنة\" فقرأها صلى الله عليه وسلم من عند \"وما فدروا الله حق قدره\" إلى آخر السورة فمنا من بكى ومنا من لم يبك فقال الذين لم يبكوا يا رسول الله لقد جهدنا أن نبكي فلم نبك فقال صلى الله عليه وسلم \"إني سأقرؤها عليكم فمن لم يبك فليتباك\" هذا حديث غريب جدا وأغرب منه ما رواه في المعجم الكبير أيضا حدثنا هاشم بن زيد حدثنا محمد بن إسماعيل بن عياش حدثني أبي حدثني ضمضم بن زرعة عن شريح بن عبيد عن أبي مالك الأشعري قال: قال رسول الله \"إن الله تعالى يقول ثلاث خلال غيبتهن عن عبادي لو رآهن رجل ما عمل بسوء أبدا: لو كشفت غطائي فرآني حتى استيقن ويعلم كيف أفعل بخلقي إذا أتيتهم وقبضت السموات بيدي ثم قبضت الأرضين ثم قلت أنا الملك من ذا الذي له الملك دوني فأريهم الجنة وما أعددت لهم فيها من كل خير فيستيقنوها وأريهم النار وما أعددت لهم فيها من كل شر فيستيقنوها ولكن عمدا غيبت ذلك عنهم لأعلم كيف يعملون وقد بينته لهم\" وهذا إسناد متقارب وهي نسخة تروى بها أحاديث جمة والله أعلم."
    },
    {
      "ayah": 68,
      "surah": 39,
      "text": "يقول تبارك وتعالى مخبرا عن هول يوم القيامة وما يكون فيه من الآيات العظيمة والزلازل الهائلة فقوله تعالى \"ونفخ في الصور فصعق من في السموات ومن في الأرض إلا من شاء الله\" هذه النفخة هي الثانية وهي نفخة الصعق وهي التي يموت بها الأحياء من أهل السموات والأرض إلا من شاء الله كما جاء مصرحا به مفسرا في حديث الصور المشهور ثم يقبض أرواح الباقين حتى يكون آخر من يموت ملك الموت وينفرد الحي القيوم الذي كان أولا وهو الباقي آخرا بالديمومة والبقاء ويقول \"لمن الملك اليوم\" ثلاث مرات ثم يجيب نفسه بنفسه فيقول \"لله الواحد القهار\" أنا الذي كنت وحدي وقد قهرت كل شيء وحكمت بالفناء على كل شيء ثم يحيي أول من يحيي إسرافيل ويأمره أن ينفخ في الصور أخرى وهي النفخة الثالثة نفخة البعث قال الله عز وجل \"ثم نفخ فيه أخرى فإذا هم قيام ينظرون\" أي أحياء بعدما كانوا عظاما ورفاتا صاروا أحياء ينظرون إلى أهوال يوم القيامة كما قال تعالى \"فإنما هى زجرة واحدة فإذا هم بالساهرة\". وقال عز وجل \"يوم يدعوكم فتستجيبون بحمده وتظنون إن لبثتم إلا قليلا\" وقال جل وعلا \"ومن آياته أن تقوم السماء والأرض بأمره ثم إذا دعاكم دعوة من الأرض إذا أنتم تخرجون\" قال الإمام أحمد حدثنا محمد بن جعفر حدثنا شعبة عن النعمان بن سالم قال سمعت يعقوب بن عاصم بن عروة بن مسعود قال سمعت رجلا قال لعبدالله بن عمرو رضي الله عنهما انك تقول الساعة تقوم إلى كذا وكذا قال لقد هممت أن لا أحدثكم شيئا إنما قلت سترون بعد قليل أمرا عظيما ثم قال عبدالله بن عمرو رضي الله عنهما قال رسول الله صلى الله عليه وسلم \"يخرج الدجال في أمتي فيمكث فيهم أربعين لا أدري أربعين يوما أو أربعين شهرا أو أربعين عاما أو أربعين ليلة فيبعث الله تعالى عيسى ابن مريم عليهما الصلاة والسلام كأنه عروة بن مسعود الثقفي فيظهر فيهلكه الله تعالى ثم يلبث الناس بعده سنين سبعا ليس بين اثنين عداوة ثم يرسل الله تعالى ريحا باردة من قبل الشام فلا يبقى أحد في قلبه مثقال ذرة من إيمان إلا قبضته حتى أن لو كان أحدهم كان في كبد جبل لدخلت عليه\" قال سمعتها من رسول الله صلى الله عليه وسلم \"ويبقى شرار الناس في خفة الطير وأحلام السباع لا يعرفون معروفا ولا ينكرون منكرا قال فيتمثل لهم الشيطان فقول ألا تستجيبون فيأمرهم بعبادة الأوثان فيعبدونها وهم في ذلك دارة أرزاقهم حسن عيشهم ثم ينفخ في الصور فلا يسمعه أحد إلا أصغى ليتا ورفع ليتا وأول من يسمعه رجل يلوط حوضه فيصعق ثم لا يبقى أحد إلا صعق ثم يرسل الله تعالى أو ينزل الله عز وجل مطرا كأنه الظل - أو الطل شك نعمان - فتنبت منه أجساد الناس ثم ينفخ فيه أخرى فإذا هم قيام ينظرون ثم يقال أيها الناس هلموا إلى ربكم \"وقفوهم إنهم مسئولون\" قال ثم يقال أخرجوا بعث النار قال فيقال كم؟ فيقال من كل ألف تسعمائة وتسعة وتسعين فيومئذ تبعث الولدان شيبا ويومئذ يكشف عن ساق\" انفرد بإخراجه مسلم في صحيحه. \"حديث أبي هريرة رضي الله عنه\" وقال البخاري حدثنا عمر بن حفص بن غياث حدثنا أبي حدثنا الأعمش قال سمعت أبا صالح قال سمعت أبا هريرة رضي الله تعالى عنه يحدث عن النبي صلى الله عليه وسلم قال \"ما بين النفختين أربعون\" قالوا يا أبا هريرة أربعون يوما؟ قال رضي الله تعالى عنه أبيت قالوا أربعون سنة؟ قال أبيت قالوا أربعون شهرا؟ قال أبيت ويبلى كل شيء من الإنسان إلا عجب ذنبه فيه يركب الخلق وقال أبو يعلى حدثنا يحيى بن معين حدثنا أبو اليمان حدثنا إسماعيل بن عياش عن عمر بن محمد عن زيد بن أسلم عن أبيه عن أبي هريرة رضي الله عنه عن النبي صلى الله عليه وسلم قال \"سألت جبريل عليه الصلاة والسلام عن هذه الآية \"ونفخ في الصور فصعق من في السموات ومن في الأرض إلا من شاء الله\" من الذين لم يشأ الله تعالى أن يصعقهم؟ قال هم الشهداء يتقلدون أسيافهم حول عرشه تتلقاهم ملائكة يوم القيامة إلى المحشر بنجائب من ياقوت نمارها ألين من الحرير مد خطاها مد أبصار الرجال يسيرون في الجنة يقولون عند طول النزهة انطلقوا بنا إلى ربنا لننظر كيف يقضي بين خلقه يضحك إليهم إلهي وإذا ضحك إلى عبد في موطن فلا حساب عليه\" رجاله كلهم ثقات إلا شيخ إسماعيل بن عياش فإنه غير معروف والله سبحانه وتعالى أعلم."
    },
    {
      "ayah": 69,
      "surah": 39,
      "text": "وقوله تبارك وتعالى \"وأشرقت الأرض بنور ربها\" أي أضاءت يوم القيامة إذا تجلى الحق جل وعلا للخلائق لفصل القضاء \"ووضع الكتاب\" قال قتادة كتاب الأعمال \"وجيء بالنبيين\" قال ابن عباس رضي الله تعالى عنهما يشهدون على الأمم بأنهم بلغوهم رسالات الله إليهم \"والشهداء\" أي الشهداء من الملائكة الحفظة على أعمال العباد من خير وشر \"وقضى بينهم بالحق\" أي بالعدل \"وهم لا يظلمون\" قال الله تعالى \"ونضع الموازين القسط ليوم القيامة فلا تظلم نفس شيئا وإن كان مثقال حبة من خردل أتينا بها وكفى بنا حاسبين\" وقال جل وعلا \"إن الله لا يظلم مثقال ذرة وإن تك حسنة يضاعفها ويؤت من لدنه أجرا عظيما\"."
    },
    {
      "ayah": 7,
      "surah": 39,
      "text": "يقول تبارك وتعالى مخبرا عن نفسه تبارك وتعالى أنه الغني عما سواه من المخلوقات كما قال موسى عليه الصلاة والسلام \"إن تكفروا أنتم ومن في الأرض جميعا فإن الله لغني حميد\" وفي صحيح مسلم \"يا عبادي لو أن أولكم وآخركم وإنكم وجنكم كانوا على أفجر قلب رجل منكم ما نقص ذلك من ملكي شيئا\". وقوله تعالى \"ولا يرضى لعباده الكفر\" أي لا يحبه ولا يأمر به \"وإن تشكروا يرضه لكم\" أي يحبه لكم ويزدكم من فضله \"ولا تزر وازرة وزر أخرى\" أي لا تحمل نفس عن نفس شيئا بل كل مطالب بأمر نفسه \"ثم إلى ربكم مرجعكم فينبئكم بما كنتم تعملون إنه عليم بذات الصدور\" أي فلا تخفى عليه خافية."
    },
    { "ayah": 70, "surah": 39, "text": "أي من خير أو شر \"وهو أعلم بما يفعلون\"." },
    {
      "ayah": 71,
      "surah": 39,
      "text": "يخبر تعالى عن حال الأشقياء الكفار كيف يساقون إلى النار وإنما يساقون سوقا عنيفا بزجر وتهديد ووعيد كما قال عز وجل \"يوم يدعون إلى نار جهنم دعا\" أي يدفعون إليها دفعا وهذا وهم عطاش ظماء كما قال جل وعلا في الآية الأخرى \"يوم نحشر المتقين إلى الرحمن وفدا ونسوق المجرمين إلى جهنم وردا\" وهم في تلك الحال صم وبكم وعمي منهم من يمشي على وجهه \"ونحشرهم يوم القيامة على وجوههم عميا وبكما وصما مأواهم جهنم كلما خبت زدناهم سعيرا\" وقوله تبارك وتعالى \"حتى إذا جاءوها فتحت أبوابها\" أي بمجرد وصولهم إليها فتحت لهم أبوابها سريعا لتعجل لهم العقوبة ثم يقول لهم خزنتها من الزبانية الذين هم غلاظ الأخلاق شداد القوى على وجه التقريع والتوبيخ والتنكيل \"ألم يأتكم رسل منكم\" أي من جنسكم تتمكنون من مخاطبتهم والأخذ عنهم \"يتلون عليكم آيات ربكم\" أى يقيمون عليكم الحجج والبراهين على صحة ما دعوكم إليه \"وينذرونكم لقاء يومكم هذا\" أي ويحذرونكم من شر هذا اليوم؟ فيقول الكفار لهم \"بلى\" أي قد جاءونا وأنذروا وأقاموا علينا الحجج والبراهين \"ولكن حقت كلمة العذاب على الكافرين\" أي ولكن كذبناهم وخالفناهم لما سبق لنا من الشقوة التي كنا نستحقها حيث عدلنا عن الحق إلى الباطل كما قال عز وجل مخبرا عنهم في الآية الأخرى \"كلما ألقي فيها فوج سألهم حزنتها ألم يأتكم نذير قالوا بلى قد جاءنا نذير فكذبنا وقلنا ما نزل الله من شيء إن أنتم إلا في ضلال كبير وقالوا لو كنا نسمع أو نعقل ما كنا في أصحاب السعير\" أي رجعوا على أنفسهم بالملامة والندامة \"فاعترفوا بذنبهم فسحقا لأصحاب السعير\" أي بعدا لهم وخسارا."
    },
    {
      "ayah": 72,
      "surah": 39,
      "text": "وقوله تبارك وتعالى ههنا \"قيل ادخلوا أبواب جهنم خالدين فيها\" أي كل من رآهم وعلم حالهم يشهد عليهم بأنهم مستحقون للعذاب ولهذا لم يسند هذا القول إلى قائل معين بل أطلقه ليدل على أن الكون شاهد عليهم بأنهم يستحقون ما هم فيه بما حكم العدل الخبير عليهم به ولهذا قال جل وعلا \"قيل ادخلوا أبواب جهنم خالدين فيها\" أي ماكثين فيها لا خروج لكم منها ولا زوال لكم عنها \"فبئس مثوى المتكبرين\" أي فبئس المصير وبئس المقيل لكم بسبب تكبركم في الدنيا وإبائكم عن اتباع الحق فهو الذي صيركم إلى ما أنتم فيه فبئس الحال وبئس المآل."
    },
    {
      "ayah": 73,
      "surah": 39,
      "text": "وهذا إخبار عن حال السعداء المؤمنين حين يساقون على النجائب وفدا إلى الجنة \"زمرا\" أي جماعة بعد جماعة: المقربون ثم الأبرار ثم الذين يلونهم ثم الذين يلونهم كل طائفة مع من يناسبهم: الأنبياء مع الأنبياء والصديقون مع أشكالهم والشهداء مع أضرابهم والعلماء مع أقرانهم وكل صنف مع صنف كل زمرة تناسب بعضها بعضا \"حتى إذا جاءوها\" أي وصلوا إلى أبواب الجنة بعد مجاوزة الصراط حبسوا على قنطرة بين الجنة والنار فاقتص لهم مظالم كانت بينهم في الدنيا حتى إذا هذبوا ونقوا أذن لهم في دخول الجنة وقد ورد في حديث الصور أن المؤمنين إذا انتهوا إلى أبواب الجنة تشاوروا فيمن يستأذن لهم في الدخول فيقصدون آدم ثم نوحا ثم إبراهيم ثم موسى ثم عيسى ثم محمدا وعليهم أجمعين كما فعلوا في العرصات عند استشفاعهم إلى الله عز وجل أن يأتي لفصل القضاء ليظهر شرف محمد صلى الله عليه وسلم وعلى سائر البشر في المواطن كلها وقد ثبت في صحيح مسلم عن أنس رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم \"أنا أول شفيع في الجنة\" وفي لفظ لمسلم \"وأنا أول من يقرع باب الجنة\". وقال الإمام أحمد حدثنا هاشم حدثنا سليمان عن ثابت عن أنس بن مالك رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم \"آتي باب الجنة يوم القيامة فأستفتح فيقول الخازن من أنت؟ فأقول محمد - قال - فيقول بك أمرت أن لا أفتح لأحد قبلك\" ورواه مسلم عن عمرو بن محمد الناقد وزهير بن حرب كلاهما عن أبي النضر هاشم بن القاسم عن سليمان وهو ابن المغيرة القيسي عن ثابت عن أنس رضي الله عنه به. وقال الإمام أحمد حدثنا عبدالرزاق حدثنا معمر عن همام بن منبه عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم \"أول زمرة تلج الجنة صورهم على صورة القمر ليلة البدر لا يبصقون فيها ولا يمتخطون فيها ولا يتغوطون فيها آنيتهم وأمشاطهم الذهب والفضة ومجامرهم الألوة ورشحهم المسك ولكل واحد منهم زوجتان يرى مخ ساقهما من وراء اللحم من الحسن لا اختلاف بينهم ولا تباغض قلوبهم على قلب واحد يسبحون الله تعالى بكرة وعشيا\" ورواه البخاري عن محمد بن مقاتل عن ابن المبارك ورواه مسلم عن محمد بن رافع عن عبدالرزاق كلاهما عن معمر بإسناده نحوه وكذا رواه أبو الزناد عن الأعرج عن أبي هريرة رضي الله تعالى عنه عن رسول الله صلى الله عليه وسلم. وقال الحافظ أبو يعلى حدثنا أبو خيثمة حدثنا جرير عن عمارة بن القعقاع عن أبي زرعة عن أبى هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم \"أول زمرة يدخلون الجنة على صورة القمر ليلة البدر والذين يلونهم على ضوء أشد كوكب دري في السماء إضاءة لا يبولون ولا يتغوطون ولا يتفلون ولا يمتخطون أمشاطهم الذهب ورشحهم المسك ومجامرهم الألوة وأزواجهم الحور العين أخلاقهم على خلق رجل واحد على صورة أبيهم آدم ستون ذراعا في السماء\". وأخرجاه أيضا من حديث جرير. وقال الزهري عن سعيد عن أبي هريرة رضي الله عنه عن رسول الله صلى الله عليه وسلم قال \"يدخل الجنة من أمتي زمرة هم سبعون ألفا تضيء وجوههم إضاءة القمر ليلة البدر\" فقام عكاشة بن محصن فقال يا رسول الله ادع الله أن يجعلني منهم فقال \"اللهم اجعله منهم\" ثم قام رجل من الأنصار فقال يا رسول الله ادع الله تعالى أن يجعلني منهم فقال صلى الله عليه وسلم \"سبقك بها عكاشة\" أخرجاه وقد روى هذا الحديث - في السبعين ألفا يدخلون الجنة بغير حساب - البخاري ومسلم عن ابن عباس رضي الله تعالى عنهما وجابر بن عبدالله وعمران بن حصين وابن مسعود ورفاعة بن عرابة الجهني وأم قيس بنت محصن رضي الله عنهم ولهما عن أبي حازم عن سهل بن سعد رضي الله تعالى عنه أن رسول الله صلى الله عليه وسلم قال \"ليدخلن الجنة من أمتي سبعون ألفا أو سبعمائة ألف آخذ بعضهم ببعض حتى يدخل أولهم وآخرهم الجنة وجوههم على صورة القمر ليلة البدر\". وقال أبو بكر بن أبي شيبة حدثنا إسماعيل بن عياش عن محمد بن زياد قال سمعت أبا أمامة الباهلي رضي الله عنه يقول سمعت رسول الله صلى الله عليه وسلم يقول \"وعدني ربي عز وجل أن يدخل الجنة من أمتي سبعين ألفا مع كل ألف سبعون ألفا لا حساب عليهم ولا عذاب وثلاث حثيات من حثيات ربي عز وجل\" وكذا رواه الوليد بن مسلم عن صفوان بن عمرو عن حكيم بن عامر عن أبي اليمان عامر بن عبدالله بن يحيى عن أبي أمامة ورواه الطبراني عن عيينة بن عبدالسلمي \"ثم مع كل ألف سبعين ألفا\" ويروى مثله عن ثوبان وأبي سعيد الأنماري وله شواهد من وجوه كثيرة وقوله تعالى \"حتى إذا جاءوها وفتحت أبوابها وقال لهم خزنتها سلام عليكم طبتم فادخلوها خالدين\" لم يذكر الجواب ههنا وتقديره حتى إذا جاءوها وكانت هذه الأمور من فتح الأبواب لهم إكراما وتعظيما وتلقتهم الملائكة الخزنة بالبشارة والسلام والثناء كما تلقى الزبانية الكفرة بالتثريب والتأنيب فتقديره إذا كان هذا سعدوا وطابوا وسروا وفرحوا بقدر كل ما يكون لهم فيه نعيم وإذا حذف الجواب ههنا ذهب الذهن كل مذهب في الرجاء والأمل ومن زعم أن الواو في قوله تبارك وتعالى \"وفتحت أبوابها\" واو الثمانية واستدل به على أن أبواب الجنة ثمانية فقد أبعد النجعة وأغرق في النزع وإنما يستفاد كون أبواب الجنة ثمانية من الأحاديث الصحيحة. قال الإمام أحمد حدثنا عبدالرزاق أخبرنا معمر عن الزهري عن حميد بن عبدالرحمن عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم \"من أنفق زوجين من ماله في سبيل الله تعالى دعي من أبواب الجنة وللجنة أبواب فمن كان من أهل الصلاة دعي من باب الصلاة ومن كان من أهل الصدقة دعي من باب الصدقة ومن كان من أهل الجهاد دعي من باب الجهاد ومن كان من أهل الصيام دعي من باب الريان\" فقال أبو بكر رضي الله تعالى عنه يا رسول الله ما على أحد من ضرورة دعي من أيها دعي فهل يدعى منها كلها أحد يا رسول الله؟ قال صلى الله عليه وسلم \"نعم وأرجو أن تكون منهم\" رواه البخاري ومسلم من حديث الزهري بنحوه وفيهما من حديث أبي حازم سلمة بن دينار عن سهل بن سعد رضي الله عنه أن رسول الله صلى الله عليه وسلم قال \"إن في الجنة ثمانية أبواب باب منها يسمى الريان لا يدخله إلا الصائمون\". وفي صحيح مسلم عن عمر بن الخطاب رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم \"ما منكم من أحد يتوضأ فيبلغ أو فيسبغ الوضوء ثم يقول أشهد أن لا إله إلا الله وأن محمدا عبده ورسوله إلا فتحت له أبواب الجنة الثمانية يدخل من أيها شاء\". وقال الحسن بن عرفة حدثنا إسماعيل بن عياش عن عبدالله بن عبدالرحمن عن أبي حسين عن شهر بن حوشب عن معاذ رضي الله عنه قال: قال لي رسول الله صلى الله عليه وسلم \"مفتاح الجنة لا إله إلا الله\" \"ذكر سعة أبواب الجنة - فسأل الله من فضله العظيم أن يجعلنا من أهلها\". في الصحيحين من حديث أبي زرعة عن أبي هريرة رضي الله عنه في حديث الشفاعة الطويل \"فيقول الله تعالى يا محمد أدخل من لا حساب عليه من أمتك من الباب الأيمن وهم شركاء الناس في الأبواب الأخر والذي نفس محمد بيده إن ما بين المصراعين من مصاريع الجنة ما بين عضادتي الباب لكما بين مكة وهجر- أو هجر ومكة - وفي رواية- مكة وبصرى\". وفي صحيح مسلم عن عتبة بن غزوان أنه خطبهم خطبة فقال فيها ولقد ذكر لنا أن ما بين مصراعين من مصاريع الجنة مسيرة أربعين سنة وليأتين عليه يوم وهو كظيظ من الزحام وفي المسند عن حكيم بن معاوية عن أبيه رضي الله عنه عن رسول الله صلى الله عليه وسلم مثله وقال عبد بن حميد حدثنا الحسن بن موسى حدثنا ابن لهيعة حدثنا دراج عن أبي الهيثم عن أبي سعيد رضي الله عنه عن رسول الله صلى الله عليه وسلم قال \"إن ما بين مصراعين في الجنة مسيرة أربعين سنة\" وقوله تبارك وتعالى \"وقال لهم خزنتها سلام عليكم طبتم\" أي طابت أعمالكم وأقوالكم وطاب سعيكم وطاب جزاؤكم كما أمر رسول الله صلى الله عليه وسلم أن ينادي بين المسلمين في بعض الغزوات \"إن الجنة لا يدخلها إلا نفس مسلمة - وفي رواية - مؤمنة\" وقوله \"فادخلوها خالدين\" أي ماكثين فيها أبدا لا يبغون عنها حولا."
    },
    {
      "ayah": 74,
      "surah": 39,
      "text": "أي يقول المؤمنون إذا عاينوا في الجنة ذلك الثواب الوافر والعطاء العظيم والنعيم المقيم والملك الكبير يقولون عند ذلك \"الحمد لله الذي صدقنا وعده\" أي الذي كان وعدنا على ألسنة رسله الكرام كما دعوا في الدنيا \"ربنا وآتنا ما وعدتنا على رسلك ولا تخزنا يوم القيامة إنك لا تخلف الميعاد\" \"وقالوا الحمد لله الذي هدانا لهذا وما كنا لنهتدي لولا أن هدانا الله لقد جاءت رسل ربنا بالحق\" \"وقالوا الحمد لله الذي أذهب عنا الحزن إن ربنا لغفور شكور الذي أحلنا دار المقامة من فضله لا يمسنا فيها نصب ولا يمسنا فيها لغوب \" وقولهم \"وأورثنا الأرض نتبوأ من الجنة حيث نشاء فنعم أجر العاملين\". قال أبو العالية وأبو صالح وقتادة والسدي وابن زيد أي أرض الجنة فهذه الآية كقوله تعالى \"ولقد كتبنا في الزبور من بعد الذكر أن الأرض يرثها عبادي الصالحون\" ولهذا قالوا \"نتبوأ من الجنة حيث نشاء\" أي أين شئنا حللنا فنعم الأجر أجرنا على عملنا وفي الصحيحين من حديث الزهري عن أنس رضي الله عنه في قصة المعراج قال النبي صلى الله عليه وسلم \"أدخلت الجنة فإذا فيها جنابذ اللؤلؤ وإذا ترابها المسك\". وقال عبد بن حميد حدثنا روح بن عبادة حدثنا حماد بن سلمة عن الجريري عن أبي نضرة عن أبي سعيد رضي الله عنه قال إن رسول الله صلى الله عليه وسلم سأل ابن صائد عن تربة الجنة فقال: درمكة بيضاء مسك خالص فقال رسول الله صلى الله عليه وسلم \"صدق\" وكذا رواه مسلم من حديث أبي سلمة عن أبي نضرة عن أبي سعيد رضي الله عنه به ورواه مسلم أيضا عن أبي بكر بن شيبة عن أبي أسامة عن الجريري عن أبي نضرة عن أبي سعيد رضي الله عنه قال إن ابن صائد سأل رسول الله صلى الله عليه وسلم عن تربة الجنة فقال \"درمكة بيضاء مسك خالص\" وقال ابن أبي حاتم حدثنا أبي حدثنا أبو غسان مالك بن إسماعيل حدثنا إسرائيل عن أبي إسحاق عن عاصم بن ضمرة عن علي بن أبي طالب رضي الله عنه في قوله \"وسيق الذين اتقوا ربهم إلى الجنة زمرا\" قال سيقوا حتى انتهوا إلى باب من أبواب الجنة فوجدوا عندها شجرة يخرج من تحت ساقها عينان فعمدوا إلى إحداهما فتطهروا منها فجرت عليهم نضرة النعيم فلم تغير أبشارهم بعدها أبدا ولم تشيعت أشعارهم أبدا بعدها كأنما دهنوا بالدهان ثم عمدوا إلى الأخرى كأنما أمروا بها فشربوا منها فأذهبت ما كان في بطونهم من أذى أو قذى وتلقتهم الملائكة على أبواب الجنة \"سلام عليكم طبتم فادخلوها خالدين\" وتلقى كل غلمان صاحبهم يطوفون به فعل الولدان بالحميم جاء من الغيبة أبشر قد أعد الله لك من الكرامة كذا وكذا قد أعد الله لك من الكرامة كذا وكذا قال وينطلق غلام من غلمانه إلى أزواجه من الحور العين فيقول هذا فلان باسمه في الدنيا - فيقلن أنت رأيته فيقول نعم فيستخفهن الفرح حتى تخرج إلى أسكفة الباب قال فيجيء فإذا هو بنمارق مصفوفة وأكواب موضوعة وزرابي مبثوثه قال ثم ينظر إلى تأسيس بنيانه فإذا هو قد أسس على جندل اللؤلؤ بين أحمر وأخضر وأصفر وأبيض ومن كل لون ثم يرفع طرفه إلى سقفه فلولا أن الله تعالى قدره له لم أن يذهب ببصره إنه لمثل البرق ثم ينظر إلى أزواجه من الحور العين ثم يتكئ على أريكة ثم يقول \"الحمد لله الذي هدانا لهذا وما كنا لنهتدي لولا أن هدانا الله\". ثم قال حدثنا أبي حدثنا أبو غسان مالك بن إسماعيل النهدي حدثنا مسلمة بن جعفر البجلي قال: سمعت أبا معاذ البصري يقول إن عليا رضي الله عنه كان ذات يوم عند رسول الله صلى الله عليه وسلم فقال النبي صلى الله عليه وسلم \"والذي نفسي بيده إنهم إذا خرجوا من قبورهم يستقبلون - أو يؤتون - بنوق لها أجنحة وعليها رحال الذهب شراك نعالهم نور يتلألأ كل خطوة منها مد البصر فينتهون إلى شجرة ينبع من أصلها عينان فيشربون من إحداهما فتغسل ما في بطونهم من دنس ويغتسلون من الأخرى فلا تشعث أبشارهم ولا أشعارهم بعدها أبدا وتجري عليهم نضرة النعيم فينتهون - أو فيأتون - باب الجنة فإذا حلقة من ياقوتة حمراء على صفائح الذهب فيضربون بالحلقة على الصفيحة فيسمع لها طنين يا علي فيبلغ كل حوراء أن زوجها قد أقبل فتبعث قيمها فيفتح له فإذا رآه خر له - قال مسلمة أراه قال ساجدا - فيقول ارفع رأسك فإنما أنا قيمك وكلت بأمرك فيتبعه ويقفو أثره فتستخف الحوراء العجلة فتخرج من خيام الدر والياقوت حتى تعتنقه ثم تقول أنت حبي وأنا حبك وأنا الخالدة التي لا أموت وأنا الناعمة التي لا أبأس وأنا الراضية التي لا أسخط وأنا المقيمة التي لا أظعن فيدخل بيتا من أسه إلى أسقفه مائة ألف ذراع بناؤه على جندل اللؤلؤ طرائق أصفر وأخضر وأحمر ليس منها طريقة تشاكل صاحبتها في البيت سبعون سريرا على كل سرير سبعون حشية على كل حشية سبعون زوجة على كل زوجة سبعون حلة يرى مخ ساقها من باطن الحلل يقضي جماعها في مقدار ليلة من لياليكم هذه الأنهار من تحتهم تطرد أنهار من ماء غير آسن- قال صاف لا كدر فيه- وأنهار من لبن لم يتغير طعمه - قال لم يخرج من ضروع الماشية - وأنهار من خمر لذة للشاربين - قال لم تعصرها الرجال بأقدامهم - وأنهار من عسل مصفى - قال لم يخرج من بطون النحل - يستجني الثمار فإن شاء قائما وإن شاء قاعدا وإن شاء متكئا - ثم تلا \"ودانية عليهم ظلالها وذللت قطوفها تذليلا\" - فيشتهي الطعام فيأتيه طير أبيض - قال وربما قال أخضر قال - فترفع أجنحتها فيأكل من جنوبها أي الألوان شاء ثم يطير فيذهب فيدخل الملك فيقول: سلام عليكم تلكم الجنة أورثتموها بما كنتم تعملون. ولو أن شعرة من شعر الحوراء وقعت في الأرض لأضاءت الشمس معها سوادا في نور\" هذا حديث غريب وكأنه مرسل والله أعلم."
    },
    {
      "ayah": 75,
      "surah": 39,
      "text": "لما ذكر تعالى حكمه في أهل الجنة والنار وأنه كلا في المحل الذي يليق به ويصلح له وهو العادل في ذلك الذي لا يجور أخبر عن ملائكته أنهم محدقون من حول العرش المجيد يسبحون بحمد ربهم ويمجدونه ويعظمونه ويقدسونه وينزهونه عن النقائص والجرر وقد فصل القضية وقضى الأمر وحكم بالعدل ولهذا قال عز وجل \"وقضى بينهم\" أي بين الخلائق \"بالحق\". ثم قال \"وقيل الحمد لله رب العالمين\" أي نطق الكون أجمعه ناطقه وبهيمه لله رب العالمين بالحمد في حكمه وعدله ولهذا لم يسند القول إلى قائل بل أطلقه فدل على أن جميع المخلوقات شهدت له بالحمد قال قتادة افتتح الخلق بالحمد في قوله \"الحمد لله الذي خلق السموات والأرض\" واختتم بالحمد في قوله تبارك وتعالى \"وقضى بينهم بالحق وقيل الحمد لله رب العالمين\"."
    },
    {
      "ayah": 8,
      "surah": 39,
      "text": "وقوله عز وجل \"وإذا مس الإنسان ضر دعا ربه منيبا إليه\" أي عند الحاجة يتضرع ويستغيث بالله وحده لا شريك له كما قال تعالى \"وإذا مسكم الضر في البحر ضل من تدعون إلا إياه فلما نجاكم إلى البر أعرضتم وكان الإنسان كفورا\" ولهذا قال تبارك وتعالى \"ثم إذا خوله نعمة منه نسي ما كان يدعو إليه من قبل\" أي في حال الرفاهية ينسى ذلك الدعاء والتضرع كما قال جل جلاله \"وإذا مس الإنسان الضر دعانا لجنبه أو قاعدا أو قائما فلما كشفنا عنه ضره مر كأن لم يدعنا إلى ضر مسه\" وقوله تعالى \"وجعل لله أندادا ليضل عن سبيله\" أي في حال العافية يشرك بالله ويجعل له أندادا \"قل تمتع بكفرك فليلا إنك من أصحاب النار\" أي قل لمن هذه حالته وطريقته ومسلكه تمتع بكفرك قليلا وهو تهديد شديد ووعيد أكيد كقوله تعالى \"قل تمتعوا فإن مصيركم إلى النار\" وقوله تعالى\" نمتعهم قليلا ثم نضطرهم إلى عذاب غليظ\"."
    },
    {
      "ayah": 9,
      "surah": 39,
      "text": "يقول عز وجل أمن هذه صفته كمن أشرك بالله وجعل له أندادا؟ لا يستوون عند الله كما قال تعالى \"ليسوا سواء من أهل الكتاب أما قائمة يتلون آيات الله آناء الليل وهم يسجدون\" وقال تبارك وتعالى ههنا \"أمن هو قانت آناء الليل ساجدا وقائما\" أي في حال سجوده وفي حال قيامه ولهذا استدل بهذه الآية من ذهب إلى أن القنوت هو الخشوع في الصلاة ليس هو القيام وحده كما ذهب إليه آخرون. قال الثوري عن فراس عن الشعبي عن مسروق عن ابن مسعود رضي الله عنه أنه قال: القانت المطيع لله عز وجل ولرسوله صلى الله عليه وسلم وقال ابن عباس رضي الله عنهما والحسن والسدي وابن زيد آناء الليل جوف الليل وقال الثوري عن منصور بلغنا أن ذلك بين المغرب والعشاء وقال الحسن وقتادة آناء الليل أوله وأوسطه وآخره وقوله تعالى \"يحذر الآخرة ويرجو رحمة ربه\" أي في حال عبادته خائف راج ولا بد في العبادة من هذا وهذا وأن يكون الخوف في مدة الحياة هو الغالب ولهذا قال تعالى \"يحذر الآخرة ويرجو رحمة ربه\" فإذا كان عند الاحتضار فليكن الرجاء هو الغالب عليه كما قال الإمام عبد بن حميد في مسنده حدثنا يحيى بن عبدالحميد حدثنا جعفر بن سليمان حدثنا ثابت عن أنس رضي الله عنه قال دخل رسول الله صلى الله عليه وسلم على رجل وهو في الموت فقال له \"كيف تجدك؟\" فقال له أرجو وأخاف فقال رسول الله صلى الله عليه وسلم \"لا يجتمعان في قلب عبد في مثل هذا الموطن إلا أعطاه الله عز وجل الذي يرجو وأمنه الذي يخافه\".. ورواه الترمذي والنسائي في اليوم والليلة وابن ماجه من حديث سيار بن حاتم عن جعفر بن سليمان به قال الترمذي غريب وقد رواه بعضهم عن ثابت عن أنس عن النبي صلى الله عليه وسلم مرسلا. وقال ابن أبي حاتم حدثنا عمر بن أبي شيبة عن عبيدة النميري حدثنا أبو خلف بن عبدالله بن عيسى الخراز حدثنا يحيى البكاء أنه سمع ابن عمر رضي الله عنهما يقرأ \"أمن هو قانت آناء الليل ساجدا وقائما يحذر الآخرة ويرجو رحمة ربه\" قال ابن عمر ذاك عثمان بن عفان رضي الله عنه وإنما قال ابن عمر رضي الله عنهما ذلك لكثرة صلاة أمير المؤمنين عثمان رضي الله عنه بالليل وقراءته حتى أنه ربما قرأ القرآن في ركعه كما روى ذلك أبو عبيدة عنه رضي الله تعالى عنه وقال الشاعر: ضحوا بأشمط عنوان السجود به يقطع الليل تسبيحا وقرآنا وقال الإمام أحمد كتب إلى الربيع بن نافع حدثنا الهيثم بن حميد عن زيد بن واقد عن سليمان بن موسى عن كثير بن مرة عن تميم الداري رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم من قرأ بمائة أية في ليلة كتب له قنوت ليلة\" وكذا رواه النسائي في اليوم والليلة عن إبراهيم بن يعقوب عن عبدالله بن يوسف والربيع بن نافع كلاهما عن الهيثم بن حميد به. وقوله تعالى \"قل هل يستوي الذين يعلمون والذين لا يعلمون\" أي هل يستوي هذا والذي قبله ممن جعل لله أندادا ليضل عن سبيله \"إنما يتذكر أولوا الألباب\" أي إنما يعلم الفرق بين هذا وهذا ومن له لب وهو العقل والله أعلم."
    }
  ]
}
