{
  "ayahs": [
    {
      "ayah": 1,
      "surah": 40,
      "text": "سورة غافر: قد كره بعض السلف منهم محمد بن سيرين أن يقال الحواميم وإنما يقال آل حم قال عبدالله بن مسعود رضي الله عنه آل حم ديباج القرآن وقال ابن عباس رضي الله عنهما إن لكل شيء لبابا ولباب القرآن آل حم أو قال الحواميم. وقال مسعر بن كدام كان يقال لهن العرائس روى ذلك كله الإمام العالم أبو عبيد القاسم بن سلام رحمه الله تعالى في كتاب فضائل القرآن. وقال حميد بن زنجويه حدثنا عبيدالله بن موسى حدثنا إسرائيل عن أبي إسحاق عن أبي الأحوص عن عبدالله رضي الله عنه قال: إن مثل القرآن كمثل رجل انطلق يرتاد لأهله منزلا فمر بأثر غيث فبينما هو يسير فيه ويتعجب منه إذ هبط على روضات دمثات فقال عجبت من الغيث الأول فهذا أعجب وأعجب فقيل له إن مثل الغيث الأول مثل عظم القرآن وإن مثل هؤلاء الروضات الدمثات مثل آل حم في القرآن أورده البغوي. وقال ابن لهيعة عن يزيد بن أبي حبيب أن الجراح بن أبي الجراح حدثه عن ابن عباس رضي الله عنهما قال: لكل شيء لباب ولباب القرآن الحواميم وقال ابن مسعود رضي الله عنه إذا وقعت في آل حم فقد وقعت في روضات أتأنق فيهن. وقال أبو عبيد ثنا الأشجعي حدثنا مسعر- هو ابن كدام - عمن حدثه أن رجلا رأى أبا الدرداء رضي الله عنه يبني مسجدا فقال له ما هذا؟ فقال أبنيه من أجل آل حم وقد يكون هذا المسجد الذي بناه أبو الدرداء رضي الله عنه هو المسجد المنسوب إليه داخل قلعة دمشق وقد يكون صيانتها وحفظها ببركته وبركة ما وضع له فإن هذا الكلام يدل على النصر على الأعداء كما قال رسول الله صلى الله عليه وسلم لأصحابه في بعض الغزوات \"إن بيتم الليلة فقولوا حم لا ينصرون - وفي رواية - لا تنصرون\" وقال الحافظ أبو بكر البزار حدثنا أحمد بن الحكم بن ظبيان بن خلف المازني ومحمد بن الليث الهمداني قالا حدثنا موسى بن مسعود حدثنا عبدالرحمن بن أبي بكر المليكي عن زرارة بن مصعب عن أبي سلمة عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم \"من قرأ آية الكرسي وأول حم المؤمن عصم ذلك اليوم من كل سوء\" ثم قال لا نعلمه يروى إلا بهذا الإسناد ورواه الترمذي من حديث المليكي وقال تكلم فيه بعض أهل العلم من قبل حفظه. بسم الله الرحمن الرحيم قد اختلف المفسرون في الحروف المقطعة التي في أوائل السور فمنهم من قال هي مما استأثر الله بعلمه فردوا علمها إلى الله ولم يفسرها حكاه القرطبي في تفسـره عن أبي بكر وعمر وعثمان وعلي وابن مسعود رضي الله عنهم أجمعين وقاله عامر الشعبي وسفيان الثوري والربيع بن خيثم واختاره أبو حاتم بن حبان. ومنهم من فسرها واختلف هؤلاء في معناها فقال عبدالرحمن بن زيد بن أسلم إنما هي أسماء السور. قال العلامة أبو القاسم محمود بن عمر الزمخشري في تفسيره وعليه إطباق الأكثر ونقل عن سيبويه أنه نص عليه ويعتضد لهذا بما ورد في الصحيحين عن أبي هريرة أن رسول الله صلى الله عليه وسلم كان يقرأ في صلاة الصبح يوم الجمعة \"الم\" السجدة و \"هل أتى على الإنسان\" وقال سفيان الثوري عن ابن أبي نجيح عن مجاهد أنه قال: الم وحم والمص وص. فواتح افتتح الله بها القرآن وكذا قيل إن \"حم\" اسم من أسماء الله عز وجل وأنشدوا في ذلك بيتا يذكرني حم والرمح شاجر فهلا تلاحم قبل التقدم وقد ورد في الحديث الذي رواه أبو داود والترمذي من حديث الثوري عن أبي إسحاق عن المهلب بن أبي صفرة قال: حدثني من سمع رسول الله صلى الله عليه وسلم يقول \"إن بيتم الليلة فقولوا حم لا ينصرون\" وهذا إسناد صحيح واختار أبو عبيد أن يروي فقولوا حم لا ينصروا أى إن قلتم ذلك لا ينصروا جعله جزاء لقوله فقولوا."
    },
    {
      "ayah": 10,
      "surah": 40,
      "text": "يقول تعالى مخبرا عن الكفار أنهم ينادون يوم القيامة وهم في غمرات النيران يتلظون وذلك عندما باشروا من عذاب الله تعالى مالا قبل لأحد به فمقتوا عند ذلك أنفسهم وأبغضوها غاية البغض بسبب ما أسلفوا من الأعمال السيئة التي كانت سبب دخولهم إلى النار فأخبرتهم الملائكة عند ذلك إخبارا عاليا نادوهم نداء بأن مقت الله تعالى لهم في الدنيا حين كان يعرض عليهم الإيمان فيكفرون أشد من مقتكم أيها المعذبون أنفسكم اليوم في هذه الحالة. قال قتادة في قوله تعالى \"لمقت الله أكبر من مقتكم أنفسكم إذ تدعون إلى الإيمان فتكفرون\" يقول لمقت الله أهل الضلالة حين عرض عليهم الإيمان في الدنيا فتركوه وأبوا أن يقبلوه أكبر مما مقتوا أنفسهم حين عاينوا عذاب الله يوم القيامة وهكذا قال الحسن البصري ومجاهد والسدى وذر بن عبيدالله الهمداني وعبدالرحمن بن زيد بن أسلم وابن جرير الطبري رحمة الله عليهم أجمعين."
    },
    {
      "ayah": 11,
      "surah": 40,
      "text": "وقوله \"قالوا ربنا أمتنا اثنتين وأحييتنا اثنتين\" قال الثوري عن أبي إسحاق عن أبي الأحوص عن ابن مسعود رضي الله عنه هذه الآية كقوله تعالى \"كيف تكفرون بالله وكنتم أمواتا فأحياكم ثم يميتكم ثم يحييكم ثم إليه ترجعون\" وكذا قال ابن عباس والضحاك وقتادة وأبو مالك وهذا هو الصواب الذي لا شك فيه ولا مرية. وقال السدي أميتوا في الدنيا ثم أحيوا في قبورهم فخوطبوا ثم أميتوا ثم أحيوا يوم القيامة وقال ابن زيد: أحيوا حين أخذ عليهم الميثاق من صلب آدم عليه السلام ثم خلقهم في الأرحام ثم أماتهم ثم أحياهم يوم القيامة وهذان القولان من السدي وابن زيد ضعيفان لأنه يلزمهما على ما قالا ثلاث إحياءات وإماتات والصحيح قول ابن مسعود وابن عباس ومن تابعهما والمقصود من هذا كله أن الكفار يسألون الرجعة وهم وقوف بين يدي الله عز وجل في عرصات القيامة كما قال عز وجل \"ولو ترى إذ المجرمون ناكسو رءوسهم عند ربهم ربنا أبصرنا وسمعنا فارجعنا نعمل صالحا إنا موقنون\" فلا يجابون ثم إذا رأوا النار وعاينوها ووقفوا عليها ونظروا إلى ما فيها من العذاب والنكال سألوا الرجعة أشد مما سألوا أول مرة فلا يجابون قال الله تعالى \"ولو ترى إذ وقفوا على النار فقالوا يا ليتنا نرد ولا نكذب بآيات ربنا ونكون من المؤمنين بل بدا لهم ما كانوا يخفون من قبل ولو ردوا لعادوا لما نهوا عنه وإنهم لكاذبون\" فإذا دخلوا النار وذاقوا مسها وحسيسها ومقامعها وأغلالها كان سؤالهم للرجعة أشد وأعظم\" وهم يصطرخون فيها ربنا أخرجنا نعمل صالحا غير الذي كنا نعمل أو لم نعمركم ما يتذكر فيه من تذكر وجاءكم النذير فذوقوا فما للظالمين من نصير\" \"ربنا أخرجنا منها فإن عدنا فإنا ظالمون قال اخسئوا فيها ولا تكلمون\" وفي هذه الآية الكريمة تلطفوا في السؤال وقدموا بين يدي كلامهم مقدمة وهي قولهم \"ربنا أمتنا اثنتين وأحييتنا اثنتين\" أي قدرتك عظيمة فإنك أحييتنا بعدما كنا أمواتا ثم أمتنا ثم أحييتنا فأنت قادر على ما تشاء وقد اعترفنا بذنوبنا وإننا كنا ظالمين لأنفسنا في الدار الدنيا \"فهل إلى خروج من سبيل\" أي فهل أنت مجيبنا إلى أن تعيدنا إلى الدار الدنيا فإنك قادر على ذلك لنعمل غير الذي كنا نعمل فإن عدنا إلى ما كنا فيه فإنا ظالمون فأجيبوا أن لا سبيل إلى عودكم ومرجعكم إلى الدار الدنيا ثم علل المنع من ذلك بأن سجاياكم لا تقبل الحق ولا تقتضيه بل تمجه وتنفيه."
    },
    {
      "ayah": 12,
      "surah": 40,
      "text": "أي أنتم هكذا تكونون وإن رددتم إلى الدار الدنيا كما قال عز وجل \"ولو ردوا لعادوا لما نهوا عنه وإنهم لكاذبون\" وقوله جل وعلا \"فالحكم لله العلي الكبير\" أي هو الحاكم في خلقه العادل الذي لا يجور فيهدي من يشاء ويضل من يشاء ويرحم من يشاء ويعذب من يشاء لا إله إلا هو."
    },
    {
      "ayah": 13,
      "surah": 40,
      "text": "قوله جل جلاله \"هو الذي يريكم آياته\" أي يظهر قدرته لخلقه بما يشاهدونه في خلقه العلوي والسفلي من الآيات العظيمة الدالة على كمال خالقها ومبدعها ومنشئها \"وينزل لكم من السماء رزقا\" وهو المطر الذي يخرج به من الزروع والثمار ما هو مشاهد بالحس من اختلاف ألوانه وطعومه وروائحه وأشكاله وألوانه وهو ماء واحد فبالقدرة العظيمة فاوت بين هذه الأشياء \"وما يتذكر\" أي يعتبر ويتفكر في هذه الأشياء ويستدل بها على عظمة خالقها \"إلا من ينيب\" أي من هو بصير منيب إلى الله تبارك وتعالى."
    },
    {
      "ayah": 14,
      "surah": 40,
      "text": "أي فاخلصوا لله وحده العبادة والدعاء وخالفوا المشركين في مسلكهم ومذهبهم. قال الإمام أحمد حدثنا عبدالله بن نمير حدثنا هشام يعني بن عروة بن الزبير عن أبي الزبير محمد بن مسلم بن تدرس المكي قال: كان عبدالله بن الزبير يقول في دبر كل صلاة حين يسلم لا إله إلا الله وحده لا شريك له له الملك وله الحمد وهو على كل شيء قدير لا حول ولا قوة إلا بالله لا إله إلا الله ولا نعبد إلا إياه له النعمة وله الفضل وله الثناء الحسن لا إله إلا الله مخلصين له الدين ولو كره الكافرون قال وكان رسول الله صلى الله عليه وسلم يهل بهن دبر كل صلاة. ورواه مسلم وأبو داود والنسائي من طرق عن هشام بن عروة وحجاج بن أبي عثمان وموسى بن عقبة ثلاثتهم عن أبي الزبير عن عبدالله بن الزبير قال: كان رسول الله صلى الله عليه وسلم يقول في دبر كل صلاة \"لا إله إلا الله وحده لا شريك له\" وذكر تمامه. وقد ثبت في الصحيح عن ابن الزبير رضي الله عنهما أن رسول الله صلى الله عليه وسلم كان يقول عقب الصلوات المكتوبات \"لا إله إلا الله وحده لا شريك له له الملك وله الحمد وهو على كل شيء قدير لا حول ولا قوة إلا بالله لا إله إلا الله ولا نعبد إلا إياه له النعمة وله الفضل وله الثناء الحسن لا إله إلا الله مخلصين له الدين ولو كره الكافرون\". وقال ابن أبي حاتم حدثنا الربيع حدثنا الخصيب بن ناصح حدثنا صالح يعني المري عن هشام بن حسان عن ابن سيرين عن أبي هريرة رضي الله عنه عن النبي صلى الله عليه وسلم قال \"ادعوا الله تبارك وتعالى وأنتم موقنون بالإجابة واعلموا أن الله تعالى لا يستجيب دعاء من قلب غافل لاه\"."
    },
    {
      "ayah": 15,
      "surah": 40,
      "text": "يقول تعالى مخبرا عن عظمته وكبريائه وارتقاع عرشه العظيم العالي على جميع مخلوقاته كالسقف لها كما قال تعالى \"من الله ذي المعارج تعرج الملائكة والروح إليه في يوم كان مقداره خمسين ألف سنة\" وسيأتي إن شاء الله تعالى بيان أن هذه مسافة ما بين العرش إلى الأرض السابعة في قول جماعة من السلف والخلف وهو الأرجح إن شاء الله وقد ذكر غير واحد أن العرش من ياقوته حمراء اتساع ما بين قطريه مسيرة خمسين ألف سنة وارتفاعه عن الأرض السابعة مسيرة خمسين ألف سنة وقد تقدم في حديث الأوعال ما يدل على ارتفاعه عن السموات السبع بشيء عظيم. وقوله تعالى \"يلقي الروح من أمره علي من يشاء من عباده\" كقوله جلت عظمته \"ينزل الملائكة بالروح من أمره على من يشاء من عباده أن أنذروا أنه لا إله إلا أنا فاتقون\" وكقوله تعالى \"وإنه لتنزيل رب العالمين نزل به الروح الأمين على قلبك لتكون من المنذرين\" ولهذا قال عز وجل \"لينذر يوم التلاق\" قال علي بن أبي طلحة عن ابن عباس يوم التلاق اسم من أسماء يوم القيامة حذر الله منه عباده وقال ابن جريج قال ابن عباس رضي الله عنهما يلتقي فيه آدم وآخر ولده وقال ابن زيد يلتقي فيه العباد وقال قتادة والسدي وبلال بن سعد وسفيان بن عيينة يلتقي فيه أهل السماء وأهل الأرض والخالق والخلق وقال ميمون بن مهران يلتقي الظالم والمظلوم وقد يقال إن يوم التلاق يشمل هذا كله ويشمل أن كل عامل سيلقى ما عمله من خير وشر كما قاله آخرون."
    },
    {
      "ayah": 16,
      "surah": 40,
      "text": "قوله جل جلاله \"يوم هم بارزون لا يخفى على الله منهم شيء\" أي ظاهرون بادون كلهم لا شيء يكنهم ولا يظلهم ولا يسترهم ولهذا قال \"يوم هم بارزون لا يخفى على الله منهم شيء\" أي الجميع في علمه على السواء. وقوله تبارك وتعالى \"لمن الملك اليوم لله الواحد القهار\" قد تقدم في حديث ابن عمر رضي الله عنهما أنه تعالى يطوي السموات والأرض بيده ثم يقول أنا الملك أنا الجبار أنا المتكبر أين ملوك الأرض؟ أين الجبارون؟ أين المتكبرون؟ وفي حديث الصور أنه عز وجل إذا قبض أرواح جميع خلقه فلم يبق سواه وحده لا شريك له حينئذ يقول لمن الملك اليوم؟ ثلاث مرات ثم يجيب نفسه قائلا \"لله الواحد القهار\" أي الذي هو وحده قد قهر كل شيء وغلبه وقد قال ابن أبي حاتم حدثنا محمد بن غالب الدقاق حدثنا عبيد بن عبيدة حدثنا معتمر عن أبيه حدثنا أبو النضر عن ابن عباس رضي الله عنهما قال: ينادي مناد بين يدي الساعة يا أيها الناس أتتكم الساعة فيسمعها الأحياء والأموات قال وينزل الله عز وجل إلى السماء الدنيا ويقول \"لمن الملك اليوم لله الواحد القهار\"."
    },
    {
      "ayah": 17,
      "surah": 40,
      "text": "يخبر تعالى عن عدله في حكمه بين خلقه أنه لا يظلم مثقال ذرة من خير ولا من شر بل يجزي بالحسنة عشر أمثالها وبالسيئة واحدة ولهذا قال تبارك وتعالى \"لا ظلم اليوم\" كما ثبت في صحيح مسلم عن أبي ذر\" رضي الله عنه عن رسول الله صلى الله عليه وسلم فيما يحكى عن ربه عز وجل أنه قال \"يا عبادي إني حرمت الظلم على نفسي وجعلته بينكم محرما فلا تظالموا - إلى أن قال- يا عبادي إنما هي أعمالكم أحصيها عليكم ثم أوفيكم إياها فمن وجد خيرا فليحمد الله تبارك وتعالى ومن وجد غير ذلك فلا يلومن إلا نفسه\" وقوله عز وجل \"إن الله سريع الحساب\" أي يحاسب الخلائق كلهم كما يحاسب نفسا واحدة كما قال جل وعلا \"ما خلقكم ولا بعثكم إلا كنفس واحدة\" وقال جل جلاله \"وما أمرنا إلا واحدة كلمح البصر\"."
    },
    {
      "ayah": 18,
      "surah": 40,
      "text": "يوم الآزفة اسم من أسماء يوم القيامة وسميت بذلك لاقترابها كما قال تعالى \"أزفت الآزفة ليس لها من دون الله كاشفة\" وقال عز وجل \"اقتربت الساعة وانشق القمر\" وقال جل وعلا \"اقترب للناس حسابهم\" وقال \"أتى أمر الله فلا تستعجلوه\" وقال جل جلاله\" فلما رأوه زلفة سيئت وجوه الذين كفروا\" الآية. وقوله تبارك وتعالى \"إذ القلوب لدى الحناجر كاظمين\" قال قتادة وقفت القلوب في الحناجر من الخوف فلا تخرج ولا تعود إلى أماكنها وكذا قال عكرمة والسدي وغير واحد ومعنى كاظمين أي ساكتين لا يتكلم أحد إلا بإذنه \"يوم يقوم الروح والملائكة صفا لا يتكلمون إلا من أذن له الرحمن وقال صوابا\" وقال ابن جريج \"كاظمين\" أي باكين. وقوله سبحانه وتعالى \"ما للظالمين من حميم ولا شفيع يطاع\" أي ليس للذين ظلموا أنفسهم بالشرك بالله من قريب منهم ينفعهم ولا شفيع يشفع فيهم بل قد تقطعت بهم الأسباب من كل خير."
    },
    {
      "ayah": 19,
      "surah": 40,
      "text": "يخبر عز وجل عن علمه التام المحيط بجميع الأشياء جليلها وحقيرها صغيرها وكبيرها دقيقها ولطيفها ليحذر الناس علمه فيهم فيستحيوا من الله تعالى حق الحياء ويتقوه حق تقواه ويراقبوه مراقبة من يعلم أنه يراه فإنه عز وجل يعلم العين الخائنة وإن أبدت أمانة ويعلم ما تنطوي عليه خبايا الصدور من الضمائر والسرائر. قال ابن عباس رضي الله عنهما في قوله تعالى \"يعلم خائنة الأعين وما تخفي الصدور\" هو الرجل يدخل على أهل البيت بيتهم وفيهم المرأة الحسناء أو تمر به وبهم المرأة الحسناء فإذا غفلوا لحظ إليها فإذا فطنوا غض بصره عنها فإذا غفلوا لحظ فإذا فطنوا غض وقد اطلع الله تعالى من قلبه أنه ود أن لو اطلع على فرجها رواه ابن أبي حاتم وقال الضحاك \"خائنة الأعين\" هو الغمز وقول الرجل رأيت ولم ير. أو لم أر وقد رأى وقال ابن عباس رضي الله تعالى عنهما يعلم الله تعالى من العين في نظرها هل تريد الخيانة أم لا؟ وكذا قال مجاهد وقتادة وقال ابن عباس رضي الله عنهما في قوله تعالى \"وما تخفي الصدور\" يعلم إذا أنت قدرت عليها هل تزني بها أم لا؟ وقال السدي \"وما تخفى الصدور\" أي من الوسوسة."
    },
    {
      "ayah": 2,
      "surah": 40,
      "text": "أي تنزيل هذا الكتاب وهو القرآن من الله ذي العزة والعلم فلا يرام جنابه ولا يخفى عليه الذر وإن تكاثف حجابه."
    },
    {
      "ayah": 20,
      "surah": 40,
      "text": "وقوله عز وجل \"والله يقضي بالحق\" أي يحكم بالعدل قال الأعمش عن سعيد بن جبير عن ابن عباس في قوله تعالى \"والله يقضي بالحق\" قادر على أن يجزي بالحسنة الحسنة وبالسيئة السيئة \"إن الله هو السميع البصير\" وهذا الذي فسر به ابن عباس رضي الله عنهما هذه الآية كقوله تبارك وتعالى \"ليجزي الذين أساءوا بما عملوا ويجزي الذين أحسنوا بالحسنى\" وقوله جل وعلا \"والذين يدعون من دونه\" أي من الأصنام والأوثان والأنداد \"لا يقضون بشيء\" أي لا يملكون شيئا ولا يحكمون بشيء \"إن الله هو السميع البصير\" أي سميع لأقوال خلقه بصير بهم فيهدي من يشاء ويضل من يشاء وهو الحاكم العادل في جميع ذلك."
    },
    {
      "ayah": 21,
      "surah": 40,
      "text": "يقول تعالى \"أو لم يسيروا\" هؤلاء المكذبون برسالتك يا محمد \"في الأرض فينظروا كيف كان عاقبة الذين كانوا من قبلهم\" أي من الأمم المكذبة بالأنبياء عليهم الصلاة والسلام ما حل بهم من العذاب والنكال مع أنهم كانوا أشد من هؤلاء قوة \"وآثارا في الأرض\" أي أثروا في الأرض من البنايات والمعالم والديارات ما لا يقدر هؤلاء عليه كما قال عز وجل \"ولقد مكناهم فيما إن مكناكم فيه\" وقال تعالى \"وأثاروا الأرض وعمروها أكثر مما عمروها\" أي مع هذه القوة العظيمة والبأس الشديد أخذهم الله بذنوبهم وهي كفرهم برسلهم \"وما كان لهم من الله من واق\" أي وما دفع عنهم عذاب الله أحد ولا رده عنهم راد ولا وقاهم واق ثم ذكر علة أخذه إياهم وذنوبهم التي ارتكبوها واجترموها."
    },
    {
      "ayah": 22,
      "surah": 40,
      "text": "فقال تعالى \"ذلك بأنهم كانت تأتيهم رسلهم بالبينات \"أي بالدلائل الواضحات والبراهين القاطعات \"فكفروا\" أي مع هذا البيان والبرهان كفروا وجحدوا \"فأخذهم الله\" تعالى أي أهلكهم ودمر عليهم وللكافرين أمثالها \"إنه قوي شديد العقاب\" أي ذو قوة عظيمة وبطش شديد \"وهو شديد العقاب\" أي عقابه أليم شديد وجيع أعاذنا الله تبارك وتعالى منه."
    },
    {
      "ayah": 23,
      "surah": 40,
      "text": "يقول تعالى مسليا لنبيه محمد صلى الله عليه وسلم في تكذيب من كذبه من قومه ومبشرا له بأن العاقبة والنصرة له في الدنيا والآخرة كما جرى لموسى بن عمران عليه السلام فإن الله تعالي أرسله بالآيات البينات والدلائل الواضحات ولهذا قال تعالى \"بآياتنا وسلطان مبين\" والسلطان هو الحجة والبرهان."
    },
    {
      "ayah": 24,
      "surah": 40,
      "text": "\"إلى فرعون\" وهو ملك القبط بالديار المصرية \"وهامان\" وهو وزيره في مملكته \"وقارون\" وكان أكثر الناس في زمانه مالا وتجارة \"فقالوا ساحر كذاب\" أي كذبوه وجعلوه ساحرا مجنونا مموها كذابا في أن الله أرسله وهذه كقوله تعالى \"كذلك ما أتى الذين من قبلهم من رسول إلا قالوا ساحر أو مجنون أتواصوا به بل هم قوم طاغون\"."
    },
    {
      "ayah": 25,
      "surah": 40,
      "text": "\"فلما جاءهم بالحق من عندنا\" أي بالرهان القاطع الدال على أن الله عز وجل أرسله إليهم \"قالوا اقتلوا أبناء الذين آمنوا معه واستحيوا نساءهم\" وهذا أمر ثان من فرعون بقتل ذكور بني إسرائيل أما الأول فكان لأجل الاحتراز من وجود موسى أو لإذلال هذا الشعب وتقليل عددهم أو لمجموع الأمرين وأما الأمر الثاني فللعلة الثانية ولإهانة هذا الشعب ولكي يتشاءموا بموسى عليه السلام ولهذا قالوا \"أوذينا من قبل أن تأتينا ومن بعدما جئتنا قال عسى ربكم أن يهلك عدوكم ويستخلفكم في الأرض فينظر كيف تعملون \"قال قتادة هذا أمر بعد أمر قال الله عز وجل \"وما كيد الكافرين إلا في ضلال\" أي وما مكرهم وقصدهم الذي هو تقليل عدد بني إسرائيل لئلا ينصروا عليهم إلا ذاهب وهالك في ضلال."
    },
    {
      "ayah": 26,
      "surah": 40,
      "text": "\"وقال فرعون ذروني أقتل موسى وليدع ربه\" وهذا عزم من فرعون لعنه الله تعالى على قتل موسى عليه الصلاة والسلام أي قال لقومه دعوني حتى أقتل لكم هذا \"وليدع ربه\" أي لا أبالي منه وهذا في غاية الجحد والتجهرم والعناد وقوله قبحه الله \"إني أخاف أن يبدل دينكم أو أن يظهر في الأرض الفساد \"يعني موسى يخشى فرعون أن يضل موسى الناس ويغير رسومهم وعاداتهم وهذا كما يقال في المثل: صار فرعون مذكرا يعني واعظا يشفق على الناس من موسى عليه السلام. وقرأ الأكثرون \"أن يبدل دينكم وأن يظهر في الأرض الفساد\" وقرأ الآخرون \"أن يبدل دينكم أو أن يظهر في الأرض الفساد\" وقرأ بعضهم \"يظهر في الأرض الفساد\" بالضم."
    },
    {
      "ayah": 27,
      "surah": 40,
      "text": "\"وقال موسى إنى عذت بربي وربكم من كل متكبر لا يؤمن بيوم الحساب \"أي لما بلغه قول فرعون \"ذروني أقتل موسى\" قال موسى عليه السلام استجرت بالله وعذت به من شره وشر أمثاله ولهذا قال \"إنى عذت بربي وربكم\" أيها المخاطبون \"من كل متكبر\" أي عن الحق مجرم \"لا يؤمن بيوم الحساب\" ولهذا جاء في الحديث عن أبي موسى رضي الله عنه أن رسول الله صلى الله عليه وسلم كان إذا خاف قوما قال \"اللهم إنا نعوذ بك من شرورهم وندرأ بك في نحورهم\"."
    },
    {
      "ayah": 28,
      "surah": 40,
      "text": "المشهور أن هذا الرجل المؤمن كان قبطيا من آل فرعون قال السدي: كان ابن عم فرعون ويقال إنه الذي نجا مع موسى عليه الصلاة والسلام واختاره ابن جرير ورد قول من ذهب إلى أنه كان إسرائيليا لأن فرعون انفعل لكلامه واستمع وكف عن قتل موسى عليه السلام ولو كان إسرائيليا لأوشك أن يعاجل بالعقوبة لأنه منهم وقال ابن جرير عن ابن عباس رضي الله عنهما لم يؤمن من آل فرعون سوى هذا الرجل وامرأة فرعون والذي قال \"يا موسى إن الملأ يأتمرون بك ليقتلوك\" رواه ابن أبي حاتم وقد كان هذا الرجل يكتم إيمانه عن قومه القبط فلم يظهر إلا هذا اليوم حين قال فرعون \"ذروني أقتل موسى\" فأخذت الرجل غضبة لله عز وجل وأفضل الجهاد كلمة عدل عند سلطان جائر كما ثبت بذلك الحديث ولا أعظم من هذه الكلمة عند فرعون وهي قوله \"أتقتلون رجلا أن يقول ربي الله\" اللهم إلا ما رواه البخاري فى صحيحه حيث قال حدثنا علي بن عبدالله حدثنا الوليد بن مسلم حدثنا الأوزاعي حدثني يحيى بن أبي كثير حدثني محمد بن إبراهيم التيمي حدثني عروة بن الزبير رضي الله تعالى عنهما قال: قلت لعبدالله بن عمرو بن العاص رضي الله عنهما أخبرني بأشد شيء صنعه المشركون برسول الله صلى الله عليه وسلم قال بينا رسول الله صلى الله عليه وسلم يصلي بفناء الكعبة إذ أقبل عقبة بن أبي معيط فأخذ بمنكب رسول الله صلى الله عليه وسلم ولوى ثوبه فى عنقه فخنقه خنقا شديدا فأقبل أبو بكر رضي الله عنه فأخذ بمنكبه ودفعه عن النبي صلى الله عليه وسلم ثم قال \"أتقتلون رجلا أن يقول ربي الله وقد جاءكم بالبينات من ربكم\" انفرد به البخاري من حديث الأوزاعي قال وتابعه محمد ابن إسحاق عن إبراهيم بن عروة عن أبيه به وقال ابن أبي حاتم حدثنا هارون بن إسحاق الهمداني حدثنا عبدة عن هشام - يعني ابن عروة - عن أبيه عن عمرو بن العاص رضي الله عنه أنه سئل ما أشد ما رأيت قريشا بلغوا من رسول الله صلى الله عليه وسلم؟ قال مر صلى الله عليه وسلم بهم ذات يوم فقالوا له أنت تنهانا أن نعبد ما يعبد آباؤنا؟ فقال \"أنا ذاك\" فقاموا إليه فأخذوا بمجامع ثيابه فرأيت أبا بكر رضي الله عنه محتضنه من وراءه وهو يصيح بأعلى صوته وإن عينيه ليسيلان وهو يقول يا قوم \"أتقتلون رجلا أن يقول ربي الله وقد جاءكم بالبينات من ربكم\" حتى فرغ من الآية كلها وهكذا رواه النسائي من حديث عبدة فجعله من مسند عمرو بن العاص رضي الله عنه وقوله تعالى \"وقد جاءكم بالبينات من ربكم\" أي كيف تقتلون رجلا لكونه يقول ربي الله وقد أقام لكم البرهان على صدق ما جاءكم به من الحق؟ ثم تنزل معهم في المخاطبة فقال \"وإن يك كاذبا فعليه كذبه وإن يك صادقا يصبكم بعض الذي يعدكم\" يعني إذا لم يظهر لكم صحة ما جاءكم به فمن العقل والرأي التام والحزم أن تتركوه ونفسه فلا تؤذوه فإن يك كاذبا فإن الله سبحانه وتعالى سيجازيه على كذبه بالعقوبة في الدنيا والآخرة وإن يك صادقا وقد آذيتموه يصبكم بعض الذي يعدكم فإنه يتوعدكم إن خالفتموه بعذاب في الدنيا والآخرة فمن الجائز عندكم أن يكون صادقا فينبغي على هذا أن لا تتعرضوا له بل اتركوه وقومه يدعوهم ويتبعونه وهكذا أخبر الله عز وجل عن موسى عليه السلام أنه طلب من فرعون وقومه الموادعة في قوله \"ولقد فتنا قبلهم قوم فرعون وجاءهم رسول كريم أن أدوا إلي عباد الله إني لكم رسول أمين وأن لا تعلوا على الله إني آتيكم بسلطان مبين وإني عذت بربي وربكم أن ترجمون وإن لم تؤمنوا لي فاعتزلون\" وهكذا قال رسول الله صلى الله عليه وسلم لقريش أن يتركوه يدعو إلى الله تعالى عباد الله ولا يمسوه بسوء ويصلوا ما بينه وبينهم من القرابة فى ترك أذيته قال الله عز وجل \"قل لا أسألكم عليه أجرا إلا المودة في القربى\" أي أن لا تؤذوني فيما بيني وبينكم من القرابة فلا تؤذوني وتتركوا بيني وبين الناس وعلى هذا وقعت الهدنة يوم الحديبية وكان فتحا مبينا وقوله جل وعلا \"إن الله لا يهدي من هو مسرف كذاب\" أي لو كان هذا الذي يزعم أن الله تعالى أرسله إليكم كاذبا كما تزعمون لكان أمره بينا يظهر لكل أحد في أقواله وأفعاله فكانت تكون في غاية الاختلاف والاضطراب وهذا نرى أمره سديدا ومنهجه مستقيما ولو كان من المسرفين الكذابين لما هداه الله وأرشده إلى ما ترون من انتظام أمره وفعله."
    },
    {
      "ayah": 29,
      "surah": 40,
      "text": "ثم قال المؤمن محذرا قومه زوال نعمة الله عنهم وحلول نقمة الله بهم \"يا قوم لكم الملك اليوم ظاهرين في الأرض\" أي قد أنعم الله عليكم بهذا الملك والظهور في الأرض بالكلمة النافذة والجاه العريض فراعوا هذه النعمة بشكر الله تعالى وتصديق رسوله صلى الله عليه وسلم واحذروا نقمة الله إن كذبتم رسوله \"فمن ينصرنا من بأس الله إن جاءنا\" أي لا تغني عنكم هذه الجنود وهذه العساكر ولا ترد عنا شيئا من بأس الله إن أرادنا بسوء \"قال فرعون\" لقومه رادا على ما أشار به هذا الرجل الصالح البار الراشد الذي كان أحق بالملك من فرعون \"ما أريكم إلا ما أرى\" أي ما أقول لكم وأشير عليكم إلا ما أراه لنفسي وقد كذب فرعون فإنه كان يتحقق صدق موسى عليه السلام فيما جاء به من الرسالة \"قال لقد علمت ما أنزل هؤلاء إلا رب السماوات والأرض بصائر\" وقال الله تعالى \"وجحدوا بها واستيقنتها أنفسهم ظلما وعلوا\" فقوله \"ما أريكم إلا ما أرى\" كذب فيه وافترى وخان الله تبارك وتعالى ورسوله صلى الله عليه وسلم ورعيته فغشهم وما نصحهم وكذا قوله \"وما أهديكم إلا سبيل الرشاد\" أي وما أدعوكم إلا إلى طريق الحق والصدق والرشد وقد كذب أيضا في ذلك وإن كان قومه قد أطاعوه واتبعوه. قال الله تبارك وتعالى \"فاتبعوا أمر فرعون وما أمر فرعون برشيد\" وقال جلت عظمته \"وأضل فرعون قومه وما هدى\" وفي الحديث \"ما من إمام يموت يوم يموت وهو غاش لرعيته إلا لم يرح رائحة الجنة وإن ريحها ليوجد من مسيرة خمسمائة عام\". والله سبحانه وتعالى الموفق للصواب."
    },
    {
      "ayah": 3,
      "surah": 40,
      "text": "أي يغفر ما سلف من الذنب ويقبل التوبة في المستقبل لمن تاب إليه وخضع لديه وقوله جل وعلا \"شديد العقاب\" أي لمن تمرد وطغى وآثر الحياة الدنيا وعتا عن أوامر الله تعالى وبغى وهذه كقوله \"نبئ عبادي أني أنا الغفور الرحيم وأن عذابي هو العذاب الأليم\" يقرن هذين الوصفين كثيرا في مواضع متعددة من القرآن ليبقى العبد بين الرجاء والخوف. وقوله تعالى \"ذي الطول\" قال ابن عباس رضي الله عنهما يعني السعة والغنى. وهكذا قال مجاهد وقتادة وقال يزيد بن الأصم: ذي الطول يعني الخير الكثير وقال عكرمة \"ذي الطول\" ذي المن وقال قتادة ذي النعم والفواضل والمعنى أنه المتفضل على عباده المتطول عليهم بما هم فيه من المنن والإنعام التي لا يطيقون القيام بشكر واحدة منها \"وإن تعدوا نعمة الله لا تحصوها\" الآية. وقوله جلت عظمته \"لا إله إلا هو\" أي لا نظير له في جميع صفاته فلا إله غيره ولا رب سواه \"إليه المصير\" أي المرجع والمآب فيجازي كل عامل بعمله \"وهو سريع الحساب\" وقال أبو بكر بن عياش سمعت أبا إسحاق السبيعي يقول: جاء رجل إلى عمر بن الخطاب رضي الله عنه فقال يا أمير المؤمنين إني قتلت فهل لي من توبة؟ فقرأ عمر رضي الله عنه \"حم تنزيل الكتاب من الله العزيز العليم غافر الذنب وقابل التوب شديد العقاب\" وقال اعمل ولا تيأس. رواه ابن أبي حاتم واللفظ له وابن جرير. وقال ابن أبي حاتم حدثنا أبي ثنا موسى بن مروان الرقي ثنا عمر يعني ابن أيوب أنا جعفر بن برقان عن يزيد بن الأصم قال: كان رجل من أهل الشام ذو بأس وكان يفد إلى عمر بن الخطاب رضي الله عنه ففقده عمر فقال ما فعل فلان بن فلان؟ فقالوا يا أمير المؤمنين تتابع في هذا الشراب قال فدعا عمر كاتبه فقال اكتب من عمر بن الخطاب إلى فلان بن فلان سلام عليك فإني أحمد إليك الله الذي لا إله إلا هو غافر الذنب وقابل التوب شديد العقاب ذي الطول لا إله إلا هو إليه المصير ثم قال لأصحابه ادعوا الله لأخيكم أن يقبل بقلبه ويتوب الله عليه فلما بلغ الرجل كتاب عمر رضي الله عنه جعل يقرؤه ويردده ويقول غافر الذنب وقابل التوب شديد العقاب قد حذرني عقوبته ووعدني أن يغفر لي. ورواه الحافظ أبو نعيم من حديث جعفر بن برقان وزاد فلم يزل يرددها على نفسه ثم بكى ثم نزع فأحسن النزع فلما بلغ عمر خبره قال هكذا فاصنعوا إذا رأيتم أخا لكم زل زلة فسددوه ووثقوه وادعوا الله له أن يتوب ولا تكونوا أعوانا للشيطان عليه. وقال ابن أبي حاتم حدثنا عمر بن شبة ثنا حماد بن واقد ثنا أبو عمر الصفار ثنا ثابت البناني قال كنت مع مصعب بن الزبير رضي الله عنه في سواد الكوفة فدخلت حائطا أصلي ركعتين فافتتحت حم المؤمن حتى بلغت لا إله إلا هو إليه المصير فإذا رجل خلفي على بغلة شهباء عليه مقطعات يمنية فقال إذا قلت غافر الذنب فقل يا غافر الذنب اغفر لي ذنبي وإذا قلت وقابل التوب فقل يا قابل التوب اقبل توبتي وإذا قلت شديد العقاب فقل يا شديد العقاب لا تعاقبني قال فالتفت فلم أر أحدا فخرجت إلى الباب فقلت مر بكم رجل عليه مقطعات يمنية؟ قالوا ما رأينا أحدا فكانوا يرون أنه إلياس ثم رواه من طريق أخرى عن ثابت بنحوه وليس فيه ذكر إلياس والله سبحانه وتعالى أعلم."
    },
    {
      "ayah": 30,
      "surah": 40,
      "text": "هذا إخبار من الله عز وجل عن هذا الرجل الصالح مؤمن آل فرعون أنه حذر قومه بأس الله تعالى في الدنيا والآخرة فقال \"يا قوم إني أخاف عليكم مثل يوم الأحزاب\"."
    },
    {
      "ayah": 31,
      "surah": 40,
      "text": "أي الذين كذبوا رسل الله في قديم الدهر كقوم نوح وعاد وثمود والذين من بعدهم من الأمم المكذبة كيف حل بهم بأس الله وما رده عنهم راد ولا صده عنهم صاد \"وما الله يريد ظلما للعباد\" أى إنما أهلكهم الله تعالى بذنوبهم وتكذيبهم رسله ومخالفتهم أمره فأنفذ فيهم قدره."
    },
    {
      "ayah": 32,
      "surah": 40,
      "text": "يعني يوم القيامة وسمي بذلك قال بعضهم لما جاء في حديث الصور إن الأرض إذا زلزلت وانشقت من قطر إلى قطر وماجت وارتجت فنظر الناس إلى ذلك ذهبوا هاربين ينادي بعضهم بعضا وقال آخرون منهم الضحاك بل ذلك إذا جيء بجهنم ذهب الناس هرابا منها فتتلقاهم الملائكة فتردهم إلى مقام المحشر وهو قوله تعالى \"والملك على أرجائها\" وقوله \"يا معشر الجن والإنس إن استطعتم أن تنفذوا من أقطار السموات والأرض فانفذوا لا تنفذون إلا بسلطان\". وقد روي عن ابن عباس رضي الله عنه والحسن والضحاك أنهم قرءوا يوم التناد بتشديد الدال من ند البعير إذا تردى وذهب وقيل لأن الميزان عنده ملك إذا وزن عمل العبد فرجح نادى بأعلى صوته ألا قد سعد فلان بن فلان سعادة لا يشقى بعدها أبدا وإن خف عمله نادى ألا قد شقي فلان بن فلان وقال قتادة ينادي كل قوم بأعمالهم: ينادي أهل الجنة أهل الجنة وأهل النار أهل النار وقيل سمي بذلك لمناداة أهل الجنة أهل النار \"أن قد وجدنا ما وعدنا ربنا حقا فهل وجدتم ما وعد ربكم حقا قالوا نعم\" ومناداة أهل النار أهل الجنة \"أن أفيضوا علينا من الماء أو مما رزقكم الله قالوا إن الله حرمهما على الكافرين\" ولمناداة أصحاب الأعراف أهل الجنة وأهل النار كما هو مذكور في سورة الأعراف واختار البغوي وغيره أنه سمى بذلك لمجموع ذلك وهو قول حسن جيد والله أعلم."
    },
    {
      "ayah": 33,
      "surah": 40,
      "text": "وقوله تعالى \"يوم تولون مدبرين\" أي ذاهبين هاربين \"كلا لا وزر إلى ربك يومئذ المستقر\" ولهذا قال عز وجل \"مالكم من الله من عاصم\" أي لا مانع يمنعكم من بأس الله وعذابه \"ومن يضلل الله فما له من هاد\" أي من أضله الله فلا هادي له غيره."
    },
    {
      "ayah": 34,
      "surah": 40,
      "text": "وقوله تبارك وتعالى \"ولقد جاءكم يوسف من قبل بالبينات\" يعني أهل مصر فد بعث الله فيهم رسولا من قبل موسى عليه الصلاة والسلام وهو يوسف عليه الصلاة والسلام كان عزيز أهل مصر وكان رسولا يدعو إلى الله تعالى أمته بالقسط فما أطاعوه تلك الطاعة إلا بمجرد الوزارة والجاه الدنيوي ولهذا قال تعالى \"فما زلتم في شك مما جاءكم به حتى إذا هلك قلتم لن يبعث الله من بعده رسولا\" أي يئستم فقلتم طامعين \"لن يبعث الله من بعده رسولا\" وذلك لكفرهم وتكذيبهم \"كذلك يضل الله من هو مسرف مرتاب\" أي كحالكم هذا يكون حال من يضله الله لإسرافه فى أفعاله وارتياب قلبه."
    },
    {
      "ayah": 35,
      "surah": 40,
      "text": "ثم قال عز وجل \"الذين يجادلون في آيات الله بغير سلطان أتاهم\" أي الذين يدفعون الحق بالباطل ويجادلون الحجج بغير دليل وحجة معهم من الله تعالى فإن الله عز وجل يمقت على ذلك أشد المقت ولهذا قال تعالى \"كبر مقتا عند الله وعند الذين آمنوا\" أي والمؤمنون أيضا يبغضون من تكون هذه صفته فإن من كانت هذه صفته يطبع الله على قلبه فلا يعرف بعد ذلك معروفا ولا ينكر منكرا ولهذا قال تبارك وتعالى \"كذلك يطبع الله على كل قلب متكبر\" أي على اتباع الحق \"جبار\" وروى ابن أبي حاتم عن عكرمة وحكي عن الشعبي أنهما قالا لا يكون الإنسان جبارا حتى يقتل نفسين وقال أبو عمران الجوني وقتادة: آية الجبابرة القتل بغير حق والله تعالى أعلم."
    },
    {
      "ayah": 36,
      "surah": 40,
      "text": "يقول تعالى مخبرا عن فرعون وعتوه وتمرده وافترائه في تكذيبه موسى عليه الصلاة والسلام أنه أمر وزيره هامان أن يبني له صرحا وهو القصر العالي المنيف الشاهق وكان اتخاذه من الآجر المضروب من الطين المشوي كما قال تعالى \"فأوقد لي يا هامان على الطين فاجعل لي صرحا\" ولهذا قال إبراهيم النخعي كانوا يكرهون البناء بالآجر وأن يجعلوه في قبورهم رواه ابن أبي حاتم."
    },
    {
      "ayah": 37,
      "surah": 40,
      "text": "وقوله \"لعلي أبلغ الأسباب أسباب السموات\" الخ قال سعيد بن جبير وأبو صالح أبواب السماوات وقيل طرق السماوات \"فأطلع إلى إله موسى وإني لأظنه كاذبا\" وهذا من كفره وتمرده أنه كذب موسى عليه الصلاة والسلام في أن الله عز وجل أرسله إليه قال الله تعالى \"وكذلك زين لفرعون سوء عمله وصد عن السبيل\" أي بصنعه هذا الذي أراد أن يوهم به الرعية أنه يعمل شيئا يتوصل به إلى تكذيب موسى عليه الصلاة والسلام ولهذا قال تعالى \"وما كيد فرعون إلا في تباب\" قال ابن عباس ومجاهد يعني إلا في خسار."
    },
    {
      "ayah": 38,
      "surah": 40,
      "text": "يقول المؤمن لقومه ممن تمرد وطغى وآثر الحياة الدنيا ونسي الجبار الأعلى فقال لهم \"يا قوم اتبعون أهدكم سبيل الرشاد\" لا كما كذب فرعون فى قوله \"وما أهديكم إلا سبيل الرشاد\" ثم زهدهم في الدنيا التي قد آثروها على الأخرى وصدتهم عن التصديق برسول الله موسى عليه الصلاة والسلام."
    },
    {
      "ayah": 39,
      "surah": 40,
      "text": "فقال \"يا قوم إنما هذه الحياة الدنيا متاع\" أي قليلة زائلة فانية عن قريب تذهب وتضمحل \"وإن الآخرة هى دار القرار\" أي الدار التي لا زوال لها ولا انتقال منها ولا ظعن عنها إلى غيرها بل إما نعيم وإما جحيم."
    },
    {
      "ayah": 4,
      "surah": 40,
      "text": "يقول تعالى ما يدفع الحق ويجادل فيه بعد البيان وظهور البرهان \"إلا الذين كفروا\" أي الجاحدون لآيات الله وحججه وبراهينه \"فلا يغررك تقلبهم فى البلاد\" أي في أموالها ونعيمها وزهرتها كما قال جل وعلا \"لا يغرنك تقلب الذين كفروا في البلاد متاع قليل ثم مأواهم جهنم وبئس المهاد\" وقال عز وجل \"نمتعهم قليلا ثم نضطرهم إلى عذاب غليظ\"."
    },
    {
      "ayah": 40,
      "surah": 40,
      "text": "\"من عمل سيئة فلا يجزي إلا مثلها\" أى واحدة مثلها \"ومن عمل صالحا من ذكر أو أنثى وهو مؤمن فأولئك يدخلون الجنة يرزقون فيها بغير حساب\" أي لا يتقدر بجزاء بل يثيبه الله عز وجل ثوابا كثيرا لا انقضاء له ولا نفاد."
    },
    {
      "ayah": 41,
      "surah": 40,
      "text": "يقول لهم المؤمن ما بالي أدعوكم إلى النجاة وهي عبادة الله وحده لا شريك له وتصديق رسوله صلى الله عليه وسلم الذي بعثه."
    },
    {
      "ayah": 42,
      "surah": 40,
      "text": "\"تدعونني لأكفر بالله وأشرك به ما ليس لي به علم\" أي على جهل بلا دليل \"وأنا أدعوكم إلى العزيز الغفار\" أي هو في عزته وكبريائه يغفر ذنب من تاب إليه."
    },
    {
      "ayah": 43,
      "surah": 40,
      "text": "\"لا جرم أنما تدعونني إليه \"يقول حقا قال السدي وابن جريج معنى قوله \"لا جرم\" حقا وقال الضحاك \"لا جرم\" لا كذب وقال علي بن أبي طلحة عن ابن عباس \"لا جرم\" يقول بلى إن الذي تدعونني إليه من الأصنام والأنداد \"ليس له دعوة في الدنيا ولا في الآخرة\" قال مجاهد: الوثن ليس له شيء وقال قتادة يعني الوثن لا ينفع ولا يضر وقال السدي: لا يجيب داعيه لا في الدنيا ولا في الآخرة وهذا كقوله تبارك وتعالى \"ومن أضل ممن يدعو من دون الله من لا يستجيب له إلى يوم القيامة وهم عن دعائهم غافلون وإذا حشر الناس كانوا لهم أعداء وكانوا بعبادتهم كافرين\" \"إن تدعوهم لا يسمعوا دعاءكم ولو سمعوا ما استجابوا لكم\" وقوله \"وأن مردنا إلى الله\" أي في الدار الآخرة فيجازي كل بعمله ولهذا قال \"وأن المسرفين هم أصحاب النار\" أي خالدين فيها بإسرافهم وهو شركهم بالله عز وجل."
    },
    {
      "ayah": 44,
      "surah": 40,
      "text": "\"فستذكرون ما أقول لكم \"أي سوف تعلمون صدق ما أمرتكم به ونهيتكم عنه ونصحتكم ووضحت لكم وتتذكرونه وتندمون حيث لا ينفعكم الندم \"وأفوض أمري إلى الله\" أى وأتوكل على الله وأستعينه وأقاطعكم وأباعدكم \"إن الله بصير بالعباد\" أى هو بصير بهم تعالى وتقدس فيهدي من يستحق الهداية ويضل من يستحق الإضلال وله الحجة البالغة والحكمة التامة والقدر النافذ."
    },
    {
      "ayah": 45,
      "surah": 40,
      "text": "وقوله تبارك وتعالى \"فوقاه الله سيئات ما مكروا\" أي في الدنيا والآخرة أما في الدنيا فنجاه الله تعالى مع موسى عليه الصلاة والسلام وأما في الآخرة فبالجنة \"وحاق بآل فرعون سوء العذاب\" وهو الغرق في اليم ثم النقلة منه إلى الجحيم."
    },
    {
      "ayah": 46,
      "surah": 40,
      "text": "قوله تعالى \"النار يعرضون عليها غدوا وعشيا\" فإن أرواحهم تعرض على النار صباحا ومساء إلى قيام الساعة فإذا كان يوم القيامة اجتمعت أرواحهم وأجسادهم في النار ولهذا قال \"ويوم تقوم الساعة أدخلوا آل فرعون أشد العذاب\" أى أشده ألما وأعظمه نكالا. وهذه الآية أصل كبير في استدلال أهل السنة على عذاب البرزخ فى القبور. ولكن هنا سؤال وهو أنه لا شك أن هذه الآية مكية وقد استدلوا بها على عذاب القبر في البرزخ وقد قال الإمام أحمد ثنا هاشم هو ابن القاسم أبو النضر ثنا إسحاق بن سعيد هو ابن عمرو بن سعيد بن العاص ثنا سعيد يعني أباه عن عائشة رضي الله عنها أن يهودية كانت تخدمها فلا تصنع عائشة رضي الله عنها إليها شيئا من المعروف إلا قالت لها اليهودية وقاك الله عذاب القبر قالت عائشة رضي الله عنها فدخل رسول الله صلى الله عليه وسلم عليّ فقلت يا رسول الله هل للقبر عذاب قبل يوم القيامة؟ قال صلى الله عليه وسلم لا من زعم ذلك؟ \"قالت هذه اليهودية لا أصنع إليها شيئا من المعروف إلا قالت وقاك الله عذاب القبر قال: صلى الله عليه وسلم \"كذبت يهود وهم على الله أكذب لا عذاب دون يوم القيامة\" ثم مكث بعد ذلك ما شاء الله أن يمكث فخرج ذات يوم نصف النهار مشتملا بثوبه محمرة عيناه وهو ينادي بأعلى صوته \"القبر كقطع الليل المظلم أيها الناس لو تعلمون ما أعلم بكيتم كثيرا وضحكتم قليلا أيها الناس استعيذوا بالله من عذاب القبر فإن عذاب القبر حق\" وهذا إسناد صحيح على شرط البخاري ومسلم ولم يخرجاه. وروى أحمد ثنا يزيد ثنا سفيان عن الزهري عن عروة عن عائشة رضي الله عنها قالت سألتها امرأة يهودية فأعطتها فقالت لها وقاك الله من عذاب القبر فأنكرت عائشة رضي الله عنها ذلك فلما رأت النبي صلى الله عليه وسلم قالت له: فقال صلى الله عليه وسلم \"لا\" قالت عائشة رضي الله عنها ثم قال لنا رسول الله بعد ذلك \"وإنه أوحي إلي أنكم تفتنون في قبوركم\" وهذا أيضا على شرطهما. فيقال فما الجمع بين هذا وبين كون الآية مكية وفيها الدلالة على عذاب البرزخ؟ والجواب أن الآية دلت على عرض الأرواح على النار غدوا وعشيا في البرزخ وليس فيها دلالة على اتصال تألمها بأجسادها في القبور إذ قد يكون ذلك مختصا بالروح فأما حصول ذلك للجسد في البرزخ وتألمه بسببه فلم يدل عليه إلا السنة في الأحاديث المرضية الآتي ذكرها. وقد يقال إن هذه الآية إنما دلت على عذاب الكفار فى البرزخ ولا يلزم من ذلك أن يعذب المؤمن في قبره بذنب ومما يدل على ذلك ما رواه الإمام أحمد ثنا عثمان بن عمر ثنا يونس عن الزهري عن عروة عن عائشة رضي الله عنها أن رسول الله صلى الله عليه وسلم دخل عليها وعندها امرأة من اليهود وهي تقول أشعرت أنكم تفتنون في قبوركم؟ فارتاع رسول الله صلى الله عليه وسلم وقال \"إنما يفتن يهود\" قالت عائشة رضي الله عنها فلبثنا ليالي ثم قال رسول الله صلى الله عليه وسلم \"ألا إنكم تفتنون في القبور\" وقالت عائشة رضي الله عنها فكان رسول الله صلى الله عليه وسلم بعد يستعيذ من عذاب القبر وهكذا رواه مسلم عن هارون بن سعيد وحرملة كلاهما عن ابن وهب عن يونس بن يزيد الأيلي عن الزهري به. وقد يقال إن هذه الآية دلت على عذاب الأرواح في البرزخ ولا يلزم من ذلك أن يتصل في الأجساد في قبورها فلما أوحى إلى النبي صلى الله عليه وسلم في ذلك بخصوصه استعاذ منه والله سبحانه وتعالى أعلم. وقد روى البخاري من حديث شعبة عن أشعث عن ابن أبي الشعثاء عن أبيه عن مسروق عن عائشة رضي الله عنها أن يهودية دخلت عليها فقالت نعوذ بالله من عذاب القبر فسألت عائشة رضي الله عنها رسول الله صلى الله عليه وسلم عن عذاب القبر فقال صلى الله عليه وسلم \"نعم عذاب القبر حق\" قالت عائشة رضي الله عنها: فما رأيت رسول الله صلى الله عليه وسلم بعد صلى صلاة إلا تعوذ من عذاب القبر. فهذا يدل على أنه بادر صلى الله عليه وسلم إلى تصديق اليهودية في هذا الخبر وقرر عليه وفي الأخبار المتقدمة أنه أنكر ذلك حتى جاءه الوحي فلعلهما قضيتان والله سبحانه أعلم وأحاديث عذاب القبر كثيرة جدا وقال قتادة في قوله تعالى \"غدوا وعشيا\" صباحا ومساء ما بقيت الدنيا يقال لهم يا آل فرعون هذه منازلكم توبيخا ونقمة وصغارا لهم. وقال ابن زيد هم فيها اليوم يغدى بهم ويراح إلى أن تقوم الساعة. وقال ابن أبي حاتم ثنا أبو سعيد ثنا المحاربي ثنا ليث عن عبدالرحمن بن ثروان عن هذيل عن عبدالله بن مسعود رضي الله عنه قال: إن أرواح الشهداء في أجواف طيور خضر تسرح بهم فى الجنة حيث شاءوا وإن أرواح ولدان المؤمنين في أجواف عصافير تسرح في الجنة حيث شاءت فتأوي إلى قناديل معلقة في العرش وإن أرواح آل فرعون في أجواف طيور سود تغدو على جهنم وتروح عليها فذلك عرضها وقد رواه الثوري عن أبي قيس عن أبي الهذيل ابن شرحبيل من كلامه في أرواح آل فرعون وكذلك قال السدي. وفي حديث الإسراء من رواية أبي هارون العبدي عن أبي سعيد الخدري رضي الله عنه عن رسول الله صلى الله عليه وسلم قال فيه \"ثم انطلق به إلى خلق كثير من خلق الله رجال كل رجل منهم بطنه مثل البيت الضخم مصفدون على سابلة آل فرعون وآل فرعون يعرضون على النار غدوا وعشيا \"ويوم تقوم الساعة أدخلوا آل فرعون أشد العذاب\" وآل فرعون كالإبل المسومة يخبطون الحجارة والشجر ولا يعقلون\" وقال ابن أبي حاتم ثنا علي بن الحسين ثنا زيد بن أخرم ثنا عامر بن مدرك الحارثي ثنا عتبة - يعني ابن يقظان - عن قيس بن مسلم عن طارق عن شهاب عن ابن مسعود رضي الله عنه عن النبي صلى الله عليه وسلم قال: \"ما أحسن محسن من مسلم أو كافر إلا أثابه الله تعالى\" قال قلنا يا رسول الله ما إثابة الله الكافر؟ فقال \"إن كان قد وصل رحما أو تصدق بصدقة أو عمل حسنة أثابه الله تبارك وتعالى المال والولد والصحة وأشباه ذلك\" قلنا فما إثابته في الآخرة؟ قال صلى الله عليه وسلم \"عذابا دون العذاب\" وقرأ \"أدخلوا آل فرعون أشد العذاب\" ورواه البزار في مسنده عن زيد بن أخرم ثم قال: لا نعلم له إسنادا غير هذا. وقال ابن جرير ثنا عبد الكريم بن أبي عمير ثنا حماد بن محمد الفزاري البلخي قال سمعت الأوزاعي وسأله رجل فقال رحمك الله رأينا طيورا تخرج من البحر تأخذ ناحية الغرب بيضا فوجا فوجا لا يعلم عددها إلا الله عز وجل فإذا كان العشي رجع مثلها سوداء قال وفطنتم إلى ذلك؟ قال نعم قال إن ذلك الطير في حواصلها أرواح آل فرعون يعرضون على النار غدوا وعشيا فترجع إلى وكورها وقد احترفت أرياشها وصارت سوداء فينبت عليها من الليل ريش أبيض ويتناثر الأسود ثم تغدوا على النار غدوا وعشيا ثم ترجع إلى وكورها فذلك دأبهم في الدنيا فإذا كان يوم القيامة قال الله تعالى \"أدخلوا آل فرعون أشد العذاب\" قال وكانوا يقولون إنهم ستمائة وألف مقاتل وقال الإمام أحمد ثنا إسحاق ثنا مالك عن نافع عن ابن عمر رضي الله عنهما قال: قال رسول الله صلى الله عليه وسلم \"إن أحدكم إذا مات عرض عليه مقعده بالغداة والعشي إن كان من أهل الجنة فمن أهل الجنة وإن كان من أهل النار فمن أهل النار فيقال هذا مقعدك حتى يبعثك الله عز وجل إليه يوم القيامة\" أخرجاه في الصحيحين من حديث مالك به."
    },
    {
      "ayah": 47,
      "surah": 40,
      "text": "يخبر تعالى عن تحاج أهل النار في النار وتخاصمهم وفرعون وقومه من جملتهم فيقول الضعفاء وهم الأتباع للذين استكبروا وهم القادة والسادة والكبراء \"إنا كنا لكم تبعا\" أي أطعناكم فيما دعوتمونا إليه في الدنيا من الكفر والضلال \"فهل أنتم مغنون عنا نصيبا من النار\" أي قسطا تتحملونه عنا."
    },
    {
      "ayah": 48,
      "surah": 40,
      "text": "\"قال الذين استكبروا إنا كل فيها\" أي لا نتحمل عنكم شيئا كفى بنا ما عندنا وما حملنا من العذاب والنكال\" إن الله قد حكم بين العباد\" أي فقسم بيننا العذاب بقدر ما يستحقه كل منا."
    },
    {
      "ayah": 49,
      "surah": 40,
      "text": "لما علموا أن الله عز وجل لا يستجيب منهم ولا يستمع لدعائهم بل قد قال \"اخسئوا فيها ولا تكلمون\" سألوا الخزنة وهم كالسجانين لأهل النار أن يدعوا لهم الله تعالى في أن يخفف عن الكافرين ولو يوما واحدا من العذاب."
    },
    {
      "ayah": 5,
      "surah": 40,
      "text": "ثم قال تعالى مسليا لنبيه محمد صلى الله عليه وسلم في تكذيب من كذبه من قومه بأن له أسوة من سلف من الأنبياء عليهم الصلاة والسلام فإنه قد كذبهم أممهم وخالفوهم وما آمن بهم منهم إلا قليل فقال \"كذبت قبلهم قوم نوح\" وهو أول رسول بعثه الله ينهى عن عبادة الأوثان \"والأحزاب من بعدهم\" أي من كل أمة \"وهمت كل أمة برسولهم ليأخذوه\" أي حرصوا على قتله بكل ممكن ومنهم من قتل رسوله \"وجادلوا بالباطل ليدحضوا به الحق\" أي ما حلوا بالشبهة ليردوا الحق الواضح الجلي. وفد قال أبو القاسم الطبراني ثنا علي بن عبدالعزيز ثنا عارم أبو النعمان ثنا معتمر بن سليمان قال سمعت أبي يحدث عن حنش عن عكرمة عن ابن عباس رضي الله عنه عن النبي صلى الله عليه وسلم قال \"من أعان باطلا ليدحض به حقا فقد برئت منه ذمة الله تعالى وذمة رسوله صلى الله عليه وسلم\" وقوله جلت عظمته \"فأخذتهم\" أي أهلكتهم على ما صنعوا من هذه الآثام والذنوب العظام \"فكيف كان عقاب\" أي فكيف بلغك عذابي لهم ونكالي بهم قد كان شديدا موجعا مؤلما قال قتادة كان شديدا والله."
    },
    {
      "ayah": 50,
      "surah": 40,
      "text": "قالت لهم الخزنة رادين عليهم \"أو لم تك تأتيكم رسلكم بالبينات\" أي أو ما قامت عليكم الحجج في الدنيا على ألسنة الرسل \"قالوا بلى قالوا فادعوا\" أي أنتم لأنفسكم فنحن لا ندعو لكم ولا نسمع منكم ولا نود خلاصكم ونحن منكم براء ثم نخبركم أنه سواء دعوتم أو لم تدعوا لا يستجاب لكم ولا يخفف عنكم ولهذا قالوا \"وما دعاء الكافرين إلا في ضلال\" أي إلا في ذهاب لا يقبل ولا يستجاب."
    },
    {
      "ayah": 51,
      "surah": 40,
      "text": "قد أورد أبو جعفر ابن جرير رحمه الله تعالى عند قوله تعالى \"إنا لننصر رسلنا والذين آمنوا في الحياة الدنيا\" سؤالا فقال قد علم أن بعض الأنبياء عليهم الصلاة والسلام قتله قومه بالكلية كيحيى وزكريا وشعيا ومنهم من خرج من بين أظهرهم إما مهاجرا كإبراهيم وإما إلى السماء كعيسى فأين النصرة في الدنيا؟ ثم أجاب عن ذلك بجوابين \"أحدهما\" أن يكون الخبر خرج عاما والمراد به البعض قال وهذا سائغ في اللغة \"الثاني\" أن يكون المراد بالنصر الانتصار لهم ممن آذاهم وسواء كان ذلك بحضرتهم أو في غيبتهم أو بعد موتهم كما فعل بقتلة يحيى وزكريا وشعيا سلط عليهم من أعدائهم من أهانهم وسفك دماءهم وقد ذكر أن النمروذ أخذه الله تعالى أخذ عزيز مقتدر وأما الذين راموا صلب المسيح عليه السلام من اليهود فسلط الله تعالى عليهم الروم فأهانوهم وأذلوهم وأظهرهم الله تعالى عليهم ثم قبل يوم القيامة سينزل عيسى بن مريم عليه الصلاة والسلام إماما عادلا وحمكا مقسطا فيقتل المسيح الدجال وجنوده من اليهود ويقتل الخنزير ويكسر الصليب ويضع الجزية فلا يقبل إلا الإسلام وهذه نصرة عظيمة وهذه سنة الله تعالى في خلقه في قديم الدهر وحديثه أنه ينصر عباده المؤمنين في الدنيا ويقر أعينهم ممن آذاهم. ففي صحيح البخاري عن أبي هريرة رضي الله عنه عن رسول الله صلى الله عليه وسلم أنه قال \"يقول الله تبارك وتعالى من عادى لى وليا فقد بارزني بالحرب\". وفى الحديث الآخر \"إني لأثأر لأوليائي كما يثأر الليث الحرب\" ولهذا أهلك الله عز وجل قوم نوح وعاد وثمود وأصحاب الرس وقوم لوط وأهل مدين وأشباههم وأضرابهم ممن كذب الرسل وخالف الحق وأنجى الله تعالى من بينهم المؤمنين فلم يهلك منهم أحدا وعذب الكافرين فلم يفلت منهم أحدا قال السدي لم يبعث الله عز وجل رسولا قط إلى قوم فيقتلونه أو قوما من المؤمنين يدعون إلى الحق فيقتلون فيذهب ذلك القرن حتى يبعث الله تبارك وتعالى لهم من ينصرهم فيطلب بدمائهم ممن فعل ذلك بهم في الدنيا قال فكانت الأنبياء والمؤمنون يقتلون في الدنيا وهم منصورون فيها وهكذا نصر الله نبيه محمدا صلى الله عليه وسلم وأصحابه على من خالفه وناوأه وكذبه وعاداه فجعل كلمته هي العليا ودينه هو الظاهر على سائر الأديان وأمره بالهجرة من بين ظهراني قومه إلى المدينة النبوية وجعل له فيها أنصارا وأعوانا ثم منحه أكتاف المشركين يوم بدر فنصره عليهم وخذلهم وقتل صناديدهم وأسر سراتهم فاستاقهم مقرنين في الأصفاد ثم من عليهم بأخذه الفداء منهم ثم بعد مدة قريبة فتح عليه مكة فقرت عينه ببلده وهو البلد المحرم الحرام المشرف المعظم فأنقذه الله تعالى به مما كان فيه من الكفر والشرك وفتح له اليمن ودانت له جزيرة العرب بكمالها ودخل الناس في دين الله أفواجا ثم قبضه الله تعالى إليه لما له عنده من الكرامة العظيمة فأقام الله تبارك وتعالى أصحابه خلفاء بعده فبلغوا عنه دين الله عز وجل ودعوا عباد الله تعالى إلى الله جل وعلا وفتحوا البلاد والرساتيق والأقاليم والمدائن والقرى والقلوب حتى انتشرت الدعوة المحمدية في مشارق الأرض ومغاربها ثم لا يزال هذا الدين قائما منصورا ظاهرا إلى قيام الساعة ولهذا قال تعالى \"إنا لننصر رسلنا والذين آمنوا في الحياة الدنيا ويوم يقوم الأشهاد\" أي يوم القيامة تكون النصرة أعظم وأكبر وأجل قال مجاهد: الأشهاد الملائكة."
    },
    {
      "ayah": 52,
      "surah": 40,
      "text": "قوله تعالى \"يوم لا ينفع الظالمين معذرتهم\" بدل من قوله \"ويوم يقوم الأشهاد\" وقرأ آخرون يوم بالرفع كأنه فسره به \"يوم يقوم الأشهاد يوم لا ينفع الظالمين\" وهم المشركون \"معذرتهم\" أي لا يقبل منهم عذر ولا فدية \"ولهم اللعنة\" أي الإبعاد والطرد من الرحمة \"ولهم سوء الدار\" وهي النار قاله السدي بئس المنزل والمقيل وقال علي بن أبي طلحة عن ابن عباس رضي الله عنهما \"ولهم سوء الدار\" أي سوء العاقبة."
    },
    {
      "ayah": 53,
      "surah": 40,
      "text": "وقوله تعالى \"ولقد آتينا موسى الهدى\" وهو ما بعثه الله عز وجل به من الهدى والنور \"وأورثنا بني إسرائيل الكتاب\" أي جعلنا لهم العاقبة وأورثناهم بلاد فرعون وأمواله وحواصله وأرضه بما صبروا على طاعة الله تبارك وتعالى واتباع رسوله موسى عليه الصلاة والسلام وفي الكتاب الذي أورثوه وهو التوراة."
    },
    { "ayah": 54, "surah": 40, "text": "وهي العقول الصحيحة السليمة." },
    {
      "ayah": 55,
      "surah": 40,
      "text": "قوله عز وجل \"فاصبر\" أي يا محمد \"إن وعد الله حق\" أي وعدناك أنا سنعلي كلمتك ونجعل العاقبة لك ولمن اتبعك \"والله لا يخلف الميعاد\" وهذا الذي أخبرناك به حق لا مرية فيه ولا شك وقوله تبارك وتعالى \"واستغفر لذنبك\" هذا تهييج للأمة على الاستغفار \"وسبح بحمد ربك بالعشي\" أي في أواخر النهار وأوائل الليل \"والإبكار\" وهي أوائل النهار وأواخر الليل."
    },
    {
      "ayah": 56,
      "surah": 40,
      "text": "وقوله تعالى \"إن الذين يجادلون في آيات الله بغير سلطان أتاهم\" أي يدفعون الحق بالباطل ويردون الحجج الصحيحة بالشبه الفاسدة بلا برهان ولا حجة من الله \"إن فى صدورهم إلا كبر ما هم ببالغيه\" أي ما في صدورهم إلا كبر على اتباع الحق واحتقار لمن جاءهم به وليس ما يرومونه من إخماد الحق وإعلاء الباطل بحاصل لهم بل الحق هو المرفوع وقولهم وقصدهم هو الموضوع \"فاستعذ بالله\" أي من حال مثل هؤلاء أو من شر مثل هؤلاء المجادلين فى آيات الله بغير سلطان هذا تفسير ابن جرير وقال كعب وأبو العالية نزلت هذه الآية في اليهود \"إن الذين يجادلون في آيات الله بغير سلطان أتاهم إن في صدورهم إلا كبر ما هم ببالغيه\" قال أبو العالية وذلك أنهم ادعوا أن الدجال منهم وأنهم يملكون به الأرض فقال الله تعالى لنبيه صلى الله عليه وسلم آمرا له أن يستعيذ من فتنة الدجال ولهذا قال عز وجل \"فاستعذ بالله إنه هو السميع البصير\" وهذا قول غريب وفيه تعسف بعيد وإن كان قد رواه ابن أبي حاتم في كتابه والله سبحانه وتعالى أعلم."
    },
    {
      "ayah": 57,
      "surah": 40,
      "text": "يقول تعالى منبها على أنه يعيد الخلائق يوم القيامة وأن ذلك سهل عليه يسير لديه بأنه خلق السماوات والأرض وخلقهما أكبر من خلق الناس بدأة وإعادة فمن قدر على ذلك فهو قادر على ما دونه بطريق الأولى والأحرى كما قال تعالى \"أو لم يروا أن الله الذي خلق السماوات والأرض ولم يعي بخلقهن بقادر على أن يحيي الموتى بلى إنه على كل شيء قدير\" وقال ههنا \"لخلق السماوات والأرض أكبر من خلق الناس ولكن أكثر الناس لا يعلمون\" فلهذا لا يتدبرون هذه الحجة ولا يتأملونها كما كان كثير من العرب يعترفون بأن الله تعالى خلق السماوات والأرض وينكرون المعاد استبعادا وكفرا وعنادا وقد اعترفوا بما هو أولى مما أنكروا."
    },
    {
      "ayah": 58,
      "surah": 40,
      "text": "أي كما لا يستوي الأعمى الذي لا يبصر شيئا والبصير الذي يرى ما انتهى إليه بصره بل بينهما فرق عظيم كذلك لا يستوي المؤمنون الأبرار والكفرة الفجار \"قليلا ما تتذكرون\" أي ما أقل ما يتذكر كثير من الناس."
    },
    {
      "ayah": 59,
      "surah": 40,
      "text": "ثم قال تعالى \"إن الساعة لآتية\" أي لكائنة وواقعة \"لا ريب فيها ولكن أكثر الناس لا يؤمنون\" أي لا يصدقون بها بل يكذبون بوجودها. قال ابن أبي حاتم ثنا محمد بن عبدالله بن عبد الحكم ثنا أشهب حدثنا مالك عن شيخ قديم من أهل اليمن قدم من ثم قال سمعت أن الساعة إذا دنت اشتد البلاء على الناس واشتد حر الشمس والله أعلم."
    },
    {
      "ayah": 6,
      "surah": 40,
      "text": "أى كما حقت كلمة العذاب على الذين كفروا من الأمم السالفة كذلك حقت على المكذبين من هؤلاء الذين كذبوك وخالفوك يا محمد بطريق الأولى والأحرى لأن من كذبك فلا وثوق له بتصديق غيرك والله أعلم."
    },
    {
      "ayah": 60,
      "surah": 40,
      "text": "هذا من فضله تبارك وتعالى وكرمه أنه ندب عباده إلى دعائه وتكفل لهم بالإجابة كما كان سفيان الثوري يقول يا من أحب عباده إليه من سأله فأكثر سؤاله ويا من أبغض عباده إليه من لم يسأله وليس أحد كذلك غيرك يا رب. رواه ابن أبي حاتم وفي هذا المعنى يقول الشاعر: الله يغضب إن تركت سؤاله وبني آدم حين يسأل يغضب وقال قتادة: قال كعب الأحبار أعطيت هذه الأمة ثلاثا لم تعطهن أمة قبلها إلا نبي: كان إذا أرسل الله نبيا قال له أنت شاهد على أمتك وجعلكم شهداء على الناس وكان يقال له ليس عليك في الدين من حرج وقال لهذه الأمة \"وما جعل عليكم في الدين من حرج\" وكان يقال له ادعني أستجب لك وقال لهذه الأمة \"ادعوني أستجب لكم\" رواه ابن أبي حاتم. وقال الإمام الحافظ أبو يعلى أحمد بن علي بن المثنى الموصلي في مسنده حدثنا أبو إبراهيم الترجماني حدثنا صالح المدني قال سمعت الحسن يحدث عن أنس بن مالك رضي الله عنه عن النبي صلى الله عليه وسلم فيما يروي عن ربه عز وجل قال \"أربع خصال واحدة منهن لي وواحدة لك وواحدة فيما بيني وبينك وواحدة فيما بينك وبين عبادي فأما التي لي فتعبدني لا تشرك بي شيئا وأما التي لك علي فما عملت من خير جزيتك به وأما التي بيني وبينك فمنك الدعاء وعلي الإجابة وأما التي بينك وبين عبادي فارض لهم ما ترضى لنفسك\". وقال الإمام أحمد حدثنا أبو معاوية حـدثنا الأعمش عن ذر عن يسيع الكندي عن النعمان بن بشير رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم \"إن الدعاء هو العبادة\" ثم قرأ \"ادعوني أستجب لكم إن الذين يستكبرون عن عبادتي سيدخلون جهنم داخرين\" وهكذا رواه أصحاب السنن الترمذي والنسائي وابن ماجة وابن أبي حاتم وابن جرير كلهم من حديث الأعمش به وقال الترمذي حسن صحيح ورواه أبو داود والترمذي والنسائي وابن جرير أيضا من حديث شعبة عن منصور والأعمش كلاهما عن ذر به وكذا رواه ابن يونس عن أسيد بن عاصم بن مهران حدثنا النعمان بن عبد السلام حدثنا سفيان الثوري عن منصور عن ذر به ورواه ابن حبان والحاكم في صحيحيهما وقال الحاكم صحيح الإسناد. وقال الإمام أحمد حدثنا وكيع حدثني أبو صالح المدني شيخ من أهل المدينة سمعه عن أبي صالح وقال مرة سمعت أبا صالح يحدث عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم \"من لم يدع الله عز وجل غضب عليه\" تفرد به أحمد وهذا إسناد لا بأس به وقال الإمام أحمد أيضا حدثنا مروان الفزاري حدثنا صبيح أبو المليح سمعت أبا صالح يحدث عن أبي هريرة قال: قال رسول الله صلى الله عليه وسلم \"من لا يسأله يغضب عليه\" قال ابن معين أبو المليح هذا اسمه: صبيح كذا قيده بالضم عبد الغني بن سعيد وأما أبو صالح هذا فهو الخوزي سكن شعب الخوز قاله البزار في مسنده وكذا وقع في روايته أبو المليح الفارسي عن أبي صالح الخوزي عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم \"من لم يسأل الله يغضب عليه\". وقال الحافظ أبو محمد الحسن بن عبدالرحمن الرامهرمزي حدثنا همام حدثنا إبراهيم بن الحسن حدثنا نائل بن نجيح حدثني عائذ بن حبيب عن محمد بن سعيد قال لما مات محمد بن مسلمة الأنصاري وجدنا في ذؤابة سيفه كتابا بسم الله الرحمن الرحيم سمعت رسول الله صلى الله عليه وسلم يقول \"إن لربكم في بقية أيام دهركم نفحات فتعرضوا له لعل دعوة أن توافق رحمة فيسعد بها صاحبها سعادة لا يخسر بعدها أبدا\" وقوله عز وجل \"إن الذين يستكبرون عن عبادتي\" أي عن دعائي وتوحيدي سيدخلون جهنم داخرين أي صاغرين حقيرين كما قال الإمام أحمد حدثنا يحيى بن سعيد عن ابن عجلان حدثني عمرو بن شعيب عن أبيه عن جده عن النبي صلى الله عليه وسلم قال \"يحشر المتكبرون يوم القيامة أمثال الذر في صور الناس يعلوهم كل شيء من الصغار حتى يدخلوا سجنا في جهنم يقال له بولس تعلوهم نار الأنيار يسقون من طينة الخبال عصارة أهل النار\". وقال ابن أبي حاتم حدثنا علي بن الحسين حدثنا أبو بكر بن محمد بن يزيد بن خنيس قال سمعت أبي يحدث عن وهيب بن الورد حدثني رجل قال كنت أسير ذات يوم في أرض الروم فسمعت هاتفا من فوق رأس جبل وهو يقول: يا رب عجبت لمن عرفك كيف يرجو أحدا غيرك يا رب عجبت لمن عرفك كيف يطلب حوائجه إلى أحد غيرك قال ثم ذهبت ثم جاءت الطامة الكبرى قال ثم عاد الثانية فقال يا رب عجبت لمن عرفك كيف يتعرض لشيء من سخطك يرضي غيرك قال وهيب وهذه الطامة الكبرى قال فناديته أجني أنت أم إنسي؟ قال بل إنسي أشغل نفسك بما يعنيك عما لا يعنيك."
    },
    {
      "ayah": 61,
      "surah": 40,
      "text": "يقول تعالى ممتنا على خلقه بما جعل لهم من الليل الذي يسكنون فيه ويستريحون من حركات ترددهم في المعايش بالنهار وجعل النهار مبصرا أي مضيئا ليتصرفوا فيه بالأسفار وقطع الأقطار والتمكن من الصناعات \"إن الله لذو فضل على الناس ولكن أكثر الناس لا يشكرون\" أي لا يقومون بشكر نعم الله عليهم."
    },
    {
      "ayah": 62,
      "surah": 40,
      "text": "قال عز وجل \"ذلكم الله ربكم خالق كل شيء لا إله إلا هو\" أي الذي فعل هذه الأشياء هو الله الواحد الأحد خالق الأشياء الذي لا إله غيره ولا رب سواه \"فأنى تؤفكون\" أي فكيف تعبدون غيره من الأصنام التي لا تخلق شيئا بل هي مخلوقة منحوته."
    },
    {
      "ayah": 63,
      "surah": 40,
      "text": "أي كما ضل هؤلاء بعبادة غير الله كذلك أفك الذين من قبلهم فعبدوا غيره بلا دليل ولا برهان بل بمجرد الجهل والهوى وجحدوا حجج الله وآياته."
    },
    {
      "ayah": 64,
      "surah": 40,
      "text": "قوله تعالى \"الله الذي جعل لكم الأرض قرارا\" أي جعلها لكم مستقرا بساطا مهادا تعيشون عليها وتتصرفون فيها وتمشون في مناكبها وأرساها بالجبال لئلا تميد بكم \"والسماء بناء\" أي سقفا للعالم محفوظا \"وصوركم فأحسن صوركم\" أي فخلقكم في أحسن الأشكال ومنحكم أكمل الصور في أحسن تقويم \"ورزقكم من الطيبات \"أي من المآكل والمشارب في الدنيا فذكر أنه خلق الدار والسكان والأرزاق فهو الخالق الرازق كما قال تعالى في سورة البقرة \"يا أيها الناس اعبدوا ربكم الذي خلقكم والذين من قبلكم لعلكم تتقون الذي جعل لكم الأرض فراشا والسماء بناء وأنزل من السماء ماء فأخرج به من الثمرات رزقا لكم فلا تجعلوا لله أندادا وأنتم تعلمون\". وقال تعالى ههنا بعد خلق هذه الأشياء \"ذلكم الله ربكم فتبارك الله رب العالمين\" أي فتعالى وتقدس وتنزه رب العالمين كلهم."
    },
    {
      "ayah": 65,
      "surah": 40,
      "text": "قال تعالى \"هو الحي لا إله إلا هو\" أي هو الحي أزلا وأبدا لم يزل ولا يزال وهو الأول والآخر والظاهر والباطن \"لا إله إلا هو\" أي لا نظير له ولا عديل له \"فادعوه مخلصين له الدين\" أي موحدين له مقرين بأنه لا إله إلا هو الحمد لله رب العالمين. قال ابن جرير: كان جماعة من أهل العلم يأمرون من قال لا إله إلا الله أن يتبعها بالحمد لله رب العالمين عملا بهذه الآية. ثم روى عن محمد بن علي بن الحسين بن شقيق عن أبيه عن الحسين بن واقد عن الأعمش عن مجاهد عن ابن عباس قال: من قال لا إله إلا الله فليقل على أثرها الحمد لله رب العالمين وذلك قوله تعالى \"فادعوه مخلصين له الدين الحمد لله رب العالمين\". وقال أبو أسامة وغيره عن إسماعيل بن أبي خالد عن سعيد بن جبير قال إذا قرأت \"فادعوا الله مخلصين له الدين\" فقل لا إله إلا الله وقل على أثرها الحمد لله رب العالمين ثم قرأ هذه الآية \"فادعوه مخلصين له الدين الحمد لله رب العالمين\". قال الإمام أحمد حدثنا ابن نمير حدثنا هشام يعني ابن عروة بن الزبير عن أبي الزبير محمد بن مسلم بن تدرس المكي قال كان عبدالله بن الزبير يقول في دبر كل صلاة حين يسلم لا إله إلا الله وحده لا شريك له له الملك وله الحمد وهو على كل شيء قدير لا حول ولا قوة إلا بالله لا إله إلا الله ولا نعبد إلا إياه له النعمة وله الفضل وله الثناء الحسن لا إله إلا الله مخلصين له الدين ولو كره الكافرون قال وكان رسول الله صلى الله عليه وسلم يهل بهن دبر كل صلاة ورواه مسلم وأبو داود والنسائي من طرق عن هشام بن عروة وحجاج بن أبي عثمان وموسى بن عقبة ثلاثتهم عن أبي الزبير عن عبدالله بن الزبير قال: كان رسول الله صلى الله عليه وسلم يقول في دبر كل صلاة \"لا إله إلا الله وحده لا شريك له\" وذكر تمامه."
    },
    {
      "ayah": 66,
      "surah": 40,
      "text": "يقول تبارك وتعالى قل يا محمد لهؤلاء المشركين إن الله عز وجل ينهى أن يعبد أحد سواه من الأصنام والأنداد والأوثان وقد بين تبارك وتعالى أنه لا يستحق العبادة أحد سواه."
    },
    {
      "ayah": 67,
      "surah": 40,
      "text": "في قوله جلت عظمته \"هو الذي خلقكم من تراب ثم من نطفة ثم من علقة ثم يخرجكم طفلا ثم لتبلغوا أشدكم ثم لتكونوا شيوخا\" أي هو الذي يقلبكم في هذه الأطوار كلها وحده لا شريك له وعن أمره وتدبيره وتقديره يكون ذلك كله\" ومنكم من يتوفى من قبل\" أي من قبل أن يوجد ويخرج إلى هذا العالم بل تسقطه أمه سقطا ومنهم من يتوفى صغيرا وشابا وكهلا قبل الشيخوخة كقوله تعالى \"لنبين لكم ونقر في الأرحام ما نشاء إلى أجل مسمى\" وقال عز وجل ههنا \"ولتبلغوا أجلا مسمى ولعلكم تعقلون\" قال ابن جريج تتذكرون البعث."
    },
    {
      "ayah": 68,
      "surah": 40,
      "text": "قال تعالى \"هو الذي يحيى ويميت\" أي هو المنفرد بذلك لا يقدر على ذلك أحد سواه \"فإذا قضى أمرا فإنما يقول له كن فيكون\" أي لا يخالف ولا يمانع بل ما شاء كان لا محالة."
    },
    {
      "ayah": 69,
      "surah": 40,
      "text": "يقول تعالى ألا تعجب يا محمد من هؤلاء المكذبين بآيات الله ويجادلون في الحق بالباطل كيف تصرف عقولهم عن الهدى إلى الضلال."
    },
    {
      "ayah": 7,
      "surah": 40,
      "text": "يخبر تعالى عن الملائكة المقربين من حملة العرش الأربعة ومن حوله من الملائكة الكروبيين بأنهم يسبحون بحمد ربهم أي يقرنون بين التسبيح الدال على نفي النقائص والتحميد المقتضي لإثبات صفات المدح \"ويؤمنون به\" أي خاشعون له أذلاء بين يديه وأنهم \"يستغفرون للذين آمنوا\" أي من أهل الأرض ممن آمن بالغيب فقيض الله تعالى ملائكته المقربين أن يدعوا للمؤمنين بظهر الغيب ولما كان هذا من سجايا الملائكة عليهم الصلاة والسلام كانوا يؤمنون على دعاء المؤمن لأخيه بظهر الغيب كما ثبت في صحيح مسلم \"إذا دعا المسلم لأخيه بظهر الغيب قال الملك آمين ولك بمثله\" وقد قال الإمام أحمد حدثنا عبدالله بن محمد - هو ابن شيبة - حدثنا عبيدة بن سليمان عن محمد بن إسحاق عن يعقوب بن عتبة عن عكرمة عن ابن عباس رضي الله عنهما قال: قال رسول الله صلى الله عليه وسلم \"صدق أمية بن أبي الصلت في شيء من شعره\" فقال: زحل وثور تحت رجل يمينه والنسر للأخرى وليث مرصد فقال رسول الله صلى الله عليه وسلم \"صدق\" فقال: والشمس تطلع كل آخر ليلة حمراء يصبح لونها يتورد تأبي فما تطلع لنا في رسلها إلا معذبة وإلا تجلد فقال رسول الله صلى الله عليه وسلم \"صدق\" وهذا إسناد جيد وهو يقتضي أن حملة العرش اليوم أربعة فإذا كان يوم القيامة كانوا ثمانية كما قال تعالى \"ويحمل عرش ربك فوقهم يومئذ ثمانية\" وهنا سؤال وهو أن يقال ما الجمع بين المفهوم من هذه الآية ودلالة هذا الحديث؟ وبين الحديث الذي رواه أبو داود ثنا محمد بن الصباح البزار ثنا الوليد بن أبي ثور عن سماك عن عبدالله بن عميرة عن الأحنف بن قيس عن العباس بن عبد المطلب رضي الله عنه قال: كنت بالبطحاء في عصابة فيهم رسول الله صلى الله عليه وسلم فمرت بهم سحابة فنظر إليها فقال \"ما تسمون هذه؟\" قالوا السحاب قال \"والمزن\" قالوا والمزن قال \"والعنان\" قالوا والعنان - قال أبو داود ولم أتقن العنان جيدا - قال \"هل تدرون بعد ما بين السماء والأرض؟\" قالوا لا ندري قال \"بعد ما بينهما إما واحدة أو اثنتان أو ثلاث وسبعون سنة ثم السماء فوقها كذلك حتى عد سبع سموات ثم فوق السماء السابعة بحر ما بين أسفله وأعلاه مثل ما بين سماء إلى سماء ثم فوق ذلك ثمانية أوعال بين أظلافهن وركبهن مثل ما بين سماء إلى سماء ثم على ظهورهن العرش بين أسفله وأعلاه مثل ما بين سماء إلى سماء ثم الله تبارك وتعالى فوق ذلك\". ثم رواه أبو داود والترمذي وابن ماجة من حديث سماك بن حرب به وقال الترمذي حسن غريب وهذا يقتضي أن حملة العرش ثمانية كما قال شهر ابن حوشب رضي الله عنه حملة العرش ثمانية أربعة منهم يقولون سبحانك اللهم وبحمدك لك الحمد على حلمك بعد علمك وأربعة يقولون سبحانك اللهم وبحمدك لك الحمد على عفوك بعد قدرتك ولهذا يقولون إذا استغفروا للذين آمنوا \"ربنا وسعت كل شيء رحمة وعلما\" أي رحمتك تسع ذنوبهم وخطاياهم وعلمك محيط بجميع أعمالهم وأقوالهم وحركاتهم وسكناتهم \"فاغفر للذين تابوا واتبعوا سبيلك\" أي فاصفح عن المسيئين إذا تابوا وأنابوا وأقلعوا عما كانوا فيه واتبعوا ما أمرتهم به من فعل الخيرات وترك المنكرات \"وقهم عذاب الجحيم\" أي وزحزحهم عن عذاب الجحيم وهو العذاب الموجع الأليم."
    },
    {
      "ayah": 70,
      "surah": 40,
      "text": "\"الذين كذبوا بالكتاب وبما أرسلنا به رسلنا\" أي من الهدى والبيان \"فسوف يعلمون\" هذا تهديد شديد ووعيد أكيد من الرب جل جلاله لهؤلاء كما قال تعالى \"ويل يومئذ للمكذبين\"."
    },
    {
      "ayah": 71,
      "surah": 40,
      "text": "أي متصلة بالأغلال بأيدي الزبانية يسحبونهم على وجوههم تارة إلى الحميم وتارة إلى الجحيم."
    },
    {
      "ayah": 72,
      "surah": 40,
      "text": "قال تعالى \"يسحبون فى الحميم ثم في النار يسجرون\" كما قال تبارك وتعالى \"هذه جهنم التي يكذب بها المجرمون يطوفون بينها وبن حميم آن\" وقال تعالى بعد ذكر أكلهم الزقوم وشربهم الحميم \"ثم إن مرجعهم لإلى الجحيم\" وقال عز وجل \"وأصحاب الشمال ما أصحاب الشمال في سموم وحميم وظل من يحموم لا بارد ولا كريم - إلى أن قال - ثم إنكم أيها الضالون المكذبون لآكلون من شجر من زقوم فمالئون منها البطون فشاربون عليه من الحميم فشاربون شرب الهيم هذا نزلهم يوم الدين\" وقال عز وجل \"إن شجرة الزقوم طعام الأثيم كالمهل يغلي في البطون كغلي الحميم خذوه فاعتلوه إلى سواء الجحيم ثم صبوا فوق رأسه من عذاب الحميم ذق إنك أنت العزيز الكريم إن هذا ما كنتم به تمترون\" أي يقال لهم ذلك على وجه التقريع والتوبيخ والتحقير والتصغير والتهكم والاستهزاء بهم قال ابن أبي حاتم حدثنا علي بن الحسين حدثنا أحمد بن منيع حدثنا منصور بن عمار حدثنا بشير بن طلحة الخزامي عن خالد بن دريك عن يعلى بن منبه رفع الحديث إلى رسول الله صلى الله عليه وسلم قال \"ينشئ الله عز وجل سحابة لأهل النار سوداء مظلمة ويقال يا أهل النار أي شيء تطلبون؟ فيذكرون بها سحاب الدنيا فيقول نسأل بارد الشراب فتمطرهم أغلالا تزيد في أغلالهم وسلاسل تزيد في سلاسلهم وجمرا يلهب النار عليهم\" هذا حديث غريب."
    },
    {
      "ayah": 73,
      "surah": 40,
      "text": "قوله تعالى \"ثم قيل لهم أينما كنتم تشركون من دون الله\" أي قيل لهم أين الأصنام التي كنتم تعبدونها من دون الله هل ينصرونكم اليوم."
    },
    {
      "ayah": 74,
      "surah": 40,
      "text": "\"قالوا ضلوا عنا\" أي ذهبوا فلم ينفعونا \"بل لم نكن ندعو من قبل شيئا\" أي جحدوا عبادتهم كقوله جلت عظمته \"ثم لم تكن فتنتهم إلا أن قالوا والله ربنا ما كنا مشركين\" ولهذا قال عز وجل \"كذلك يضل الله الكافرين\"."
    },
    {
      "ayah": 75,
      "surah": 40,
      "text": "أي تقول لهم الملائكة هذا الذي أنتم فيه جزاء على فرحكم في الدنيا بغير الحق ومرحكم وأشركم وبطركم."
    },
    {
      "ayah": 76,
      "surah": 40,
      "text": "أي فبئس المنزل والمقيل الذي فيه الهوان والعذاب الشديد لمن استكبر عن آيات الله واتباع دلائله وحججه والله أعلم."
    },
    {
      "ayah": 77,
      "surah": 40,
      "text": "يقول تعالى آمرا رسوله صلى الله عليه وسلم بالصبر على تكذيب من كذبه من قومه فإن الله تعالى سينجز لك ما وعدك من النصر والظفر على قومك وجعل العاقبة لك ولمن اتبعك في الدنيا والآخرة \"فإما نرينك بعض الذي نعدهم\" أي في الدنيا وكذلك وقع فإن الله تعالى أقر أعينهم من كبرائهم وعظمائهم أبيدوا في يوم بدر ثم فتح الله عليه مكة وسائر جزيرة العرب في حياته صلى الله عليه وسلم وقوله عز وجل \"أو نتوفينك فإلينا يرجعون\" أي فنذيقهم العذاب الشديد في الآخرة."
    },
    {
      "ayah": 78,
      "surah": 40,
      "text": "قال تعالى مسليا له \"ولقد أرسلنا رسلا من قبلك منهم من قصصنا عليك\" كما قال جل وعلا في سورة النساء سواء أي منهم من أوحينا إليك خبرهم وقصصهم مع قومهم كيف كذبوهم ثم كانت للرسل العاقبة والنصرة \"ومنهم من لم نقصص عليك\" وهم أكثر ممن ذكر بأضعاف أضعاف كما تقدم التنبيه على ذلك في سورة النساء ولله الحمد والمنة. وقوله تعالى \"وما كان لرسول أن يأتي بأية إلا بإذن الله\" أي ولم يكن لواحد من الرسل أن يأتي قومه بخارق للعادات إلا أن يأذن الله له في ذلك فيدل ذلك على صدقه فيما جاءهم به \"فإذا جاء أمر الله\" وهو عذابه ونكاله المحيط بالمكذبين \"قضى بالحق\" فينجي المؤمنين ويهلك الكافرين ولهذا قال عز وجل \"وخسر هنالك المبطلون\"."
    },
    {
      "ayah": 79,
      "surah": 40,
      "text": "يقول تعالى ممتنا على عباده بما خلق لهم من الأنعام وهي الإبل والبقر والغنم فمنها ركوبهم ومنها يأكلون."
    },
    {
      "ayah": 8,
      "surah": 40,
      "text": "أي اجمع بينهم وبينهم لتقر بذلك أعينهم بالاجتماع في منازل متجاورة كما قال تبارك وتعالى \"والذين آمنوا واتبعتهم ذريتهم بإيمان ألحقنا بهم ذريتهم وما ألتناهم من عملهم من شيء\" أي ساوينا بين الكل في المنزلة لتقر أعينهم وما نقصنا العالي حتى يساوي الداني بل رفعنا ناقص العمل فساويناه بكثير العمل تفضلا منا ومنة. وقال سعيد بن جبير إن المؤمن إذا دخل الجنة سأل عن أبيه وابنه وأخيه أين هم؟ فيقال إنهم لم يبلغوا طبقتك في العمل فيقول إني إنما عملت لي ولهم فيلحقون به في الدرجة ثم تلا سعيد بن جبير هذه الآية \"ربنا وأدخلهم جنات عدن التي وعدتهم ومن صلح من آبائهم وأزواجهم وذرياتهم إنك أنت العزيز الحكيم\" قال مطرف بن عبدالله بن الشخير أنصح عباد الله للمؤمنين الملائكة ثم تلا هذه الآية \"ربنا وأدخلهم جنات عدن التي وعدتهم\" الآية وأغش عباده للمؤمنين الشياطين. وقوله تبارك وتعالى \"إنك أنت العزيز الحكيم\" أي الذي لا يمانع ولا يغالب وما شاء كان وما لم يشأ لم يكن الحكيم في أقوالك وأفعالك من شرعك وقدرك."
    },
    {
      "ayah": 80,
      "surah": 40,
      "text": "فالإبل تركب وتؤكل وتحلب ويحمل عليها الأثقال في الأسفار والرحال إلى البلاد النائية والأقطار الشاسعة والبقر تؤكل ويشرب لبنها وتحرث عليها الأرض والغنم تؤكل ويشرب لبنها والجميع تجز أصوافها وأشعارها وأوبارها فيتخذ منها الأثاث والثياب والأمتعة كما فصل وبين في أماكن تقدم ذكرها في سورة الأنعام وسورة النحل وغير ذلك ولذا قال عز وجل ههنا \"لتركبوا منها ومنها تأكلون ولكم فيها منافع ولتبلغوا عليها حاجة في صدوركم وعليها وعلى الفلك تحملون\"."
    },
    {
      "ayah": 81,
      "surah": 40,
      "text": "قوله جل وعلا \"ويريكم آياته\" أي حججه وبراهينه في الآفاق وفي أنفسكم \"فأي آيات الله تنكرون\" أي لا تقدرون على إنكار شيء من آياته إلا أن تعاندوا وتكابروا."
    },
    {
      "ayah": 82,
      "surah": 40,
      "text": "يخبر تعالى عن الأمم المكذبة بالرسل في قديم الدهر وماذا حل بهم من العذاب الشديد مع شدة قواهم وما أثروه في الأرض وجمعوه من الأموال فما أغنى عنهم ذلك شيئا ولا رد عنهم ذرة من بأس الله."
    },
    {
      "ayah": 83,
      "surah": 40,
      "text": "وذلك لأنهم لما جاءتهم الرسل بالبينات والحجج القاطعات والبراهين الدامغات لم يلتفتوا إليهم ولا أقبلوا عليهم واستغنوا بما عندهم من العلم في زعمهم عما جاءتهم به الرسل قال مجاهد قالوا نحن أعلم منهم لن نبعث ولن نعذب وقال السدي فرحوا بما عندهم من العلم بجهالتهم فأتاهم من بأس الله تعالى ما لا قبل لهم به \"وحاق بهم\" أي أحاط بهم \"ما كانوا به يستهزئون\" أي يكذبون ويستبعدون وقوعه."
    },
    {
      "ayah": 84,
      "surah": 40,
      "text": "\"فلما رأوا بأسنا\" أي عاينوا وقوع العذاب بهم \"قالوا آمنا بالله وحده وكفرنا بما كنا به مشركين\" أى وحدوا الله عز وجل وكفروا بالطاغوت ولكن حيث لا تقال العثرات ولا تنفع المعذرة وهذا كما قال فرعون حين أدركه الغرق \"آمنت أنه لا إله إلا الذي آمنت به بنو إسرائيل وأنا من المسلمين\" قال الله تبارك تعالى \"الآن وقد عصيت قبل وكنت من المفسدين\" أي فلم يقبل الله منه لأنه قد استجاب لنبيه موسى عليه الصلاة والسلام دعاءه عليه حين قال \"واشدد على قلوبهم فلا يؤمنوا حتى يروا العذاب الأليم\"."
    },
    {
      "ayah": 85,
      "surah": 40,
      "text": "قال تعالى \"فلم يك ينفعهم إيمانهم لما رأوا بأسنا سنة الله التي قد خلت في عباده\" أي هذا حكم الله في جميع من تاب عند معاينة العذاب أنه لا يقبل ولهذا جاء في الحديث \"إن الله تعالى يقبل توبة العبد ما لم يغرغر\" أي فإذا غرغر وبلغت الروح الحنجرة وعاين الملكفلا توبة حينئذ ولهذا قال تعالى \"وخسر هنالك الكافرون\"."
    },
    {
      "ayah": 9,
      "surah": 40,
      "text": "\"وقهم السيئات\" أي فعلها أو وبالها ممن وقعت منه \"ومن تق السيئات يومئذ\" أي يوم القيامة \"فقد رحمته\" أي لطفت به ونجيته من العقوبة \"وذلك هو الفوز العظيم\"."
    }
  ]
}
