{
  "ayahs": [
    {
      "ayah": 1,
      "surah": 41,
      "text": "قد اختلف المفسرون في الحروف المقطعة التي في أوائل السور فمنهم من قال هي مما استأثر الله بعلمه فردوا علمها إلى الله ولم يفسرها حكاه القرطبي في تفسـره عن أبي بكر وعمر وعثمان وعلي وابن مسعود رضي الله عنهم أجمعين وقاله عامر الشعبي وسفيان الثوري والربيع بن خيثم واختاره أبو حاتم بن حبان. ومنهم من فسرها واختلف هؤلاء في معناها فقال عبدالرحمن بن زيد بن أسلم إنما هي أسماء السور. قال العلامة أبو القاسم محمود بن عمر الزمخشري في تفسيره وعليه إطباق الأكثر ونقل عن سيبويه أنه نص عليه ويعتضد لهذا بما ورد في الصحيحين عن أبي هريرة أن رسول الله صلى الله عليه وسلم كان يقرأ في صلاة الصبح يوم الجمعة \"الم\" السجدة و \"هل أتى على الإنسان\" وقال سفيان الثوري عن ابن أبي نجيح عن مجاهد أنه قال: الم وحم والمص وص. فواتح افتتح الله بها القرآن."
    },
    {
      "ayah": 10,
      "surah": 41,
      "text": "\"وجعل فيها رواسي من فوقها وبارك فيها\" أي جعلها مباركة قابلة للخير والبذر والغراس\"وقدر فيها أقواتها\" وهو ما يحتاج أهلها إليه من الأرزاق والأماكن التي تزرع وتغرس يعني يوم الثلاثاء والأربعاء فهما مع اليومين السابقين أربعة ولهذا قال \"في أربعة أيام سواء للسائلين\" أي لمن أراد السؤال عن ذلك ليعلمه وقال عكرمة ومجاهد في قوله عز وجل \"وقدر فيها أقواتها\" وجعل في كل أرض مالا يصلح في غيرها ومنه العصب باليمن والسابوري بسابور والطيالسة بالري وقال ابن عباس وقتادة والسدي في قوله تعالى \"سواء للسائلين\" أي لمن أراد السؤال عن ذلك وقال ابن زيد معناه وقدر فيها أقواتها فى أربعة أيام سواء للسائلين أي على وفق مراده من له حاجة إلى رزق أو حاجة فإن الله تعالى قدر له ما هو محتاج إليه وهذا القول يشبه ما ذكروه في قوله تعالى \"وآتاكم من كل ما سألتموه\" والله أعلم."
    },
    {
      "ayah": 11,
      "surah": 41,
      "text": "وقوله تبارك وتعالى \"ثم استوى إلى السماء وهي دخان\" وهو بخار الماء المتصاعد منه حين خلقت الأرض \"فقال. لها وللأرض ائتيا طوعا أو كرها\" أي استجيبا لأمري وانفعلا لفعلي طائعتين أو مكرهتين قال الثوري عن ابن جريج عن سليمان بن موسى عن مجاهد عن ابن عباس في قوله تعالى \"فقال لها وللأرض ائتيا طوعا أو كرها\" قال: قال الله تبارك وتعالى للسماوات أطلعي شمسي وقمرى ونجومي وقال للأرض شققي أنهارك وأخرجي ثمارك \"قالتا أتينا طائعين\" واختاره ابن جرير رحمه الله قالتا أتينا طائعين أي بل نستجيب لك مطيعين بما فينا مما تريد خلقه من الملائكة والجن والإنس جميعا مطيعين لك حكاه ابن جرير عن بعض أهل العربية قال وقيل تنزيلا لهن معاملة من يعقل بكلامهما وقيل إن المتكلم من الأرض بذلك هو مكان الكعبة ومن السماء ما يسامته منها والله أعلم وقال الحسن البصري لو أبيا عليه أمره لعذبهما عذابا يجدان ألمه ورواه ابن أبي حاتم."
    },
    {
      "ayah": 12,
      "surah": 41,
      "text": "\"فقضاهن سبع سموات في يومين\" أي ففرغ من تسويتهن سبع سموات في يومين أي آخرين وهما يوم الخميس ويوم الجمعة \"وأوحى في كل سماء أمرها\" أي ورتب مقررا في كل سماء ما تحتاج إليه من الملائكة وما فيها من الأشياء التي لا يعلمها إلا هو \"وزينا السماء الدنيا بمصابيح\" وهي الكواكب المنيرة المشرقة على أهل الأرض \"وحفظا\" أي حرسا من الشياطين أن تستمع إلى الملإ الأعلى \"ذلك تقدير العزيز العليم\" أي العزيز الذي قد عز كل شيء فغلبه وقهره العليم بجميع حركات المخلوقات وسكناتهم قال ابن جرير حدثنا هناد بن السري حدثنا أبو بكر بن عياش عن أبي سعيد البقال عن عكرمة عن ابن عباس - قال هناد قرأت سائر الحديث - أن اليهود أتت النبي صلى الله عليه وسلم فسألته عن خلق السماوات والأرض فقال صلى الله عليه وسلم \"خلق الله تعالى الأرض يوم الأحد ويوم الإثنين وخلق الجبال يوم الثلاثاء وما فيهن من منافع وخلق يوم الأربعاء - الشجر والماء والمدائن والعمران والخراب - فهذه أربعة \"قل أئنكم لتكفرون بالذي خلق الأرض في يومين وتجعلون له أندادا ذلك رب العالمين وجعل فيهل رواسي من فوقها وبارك فيها وقدر فيها أقواتها في أربعة أيام سواء للسائلين\" لمن سأله قال وخلق يوم الخميس السماء وخلق يوم الجمعة النجوم والشمس والقمر والملائكة إلى ثلاث ساعات بقيت منه وفي الثانية ألقى الآفة على كل شىء مما ينتفع به الناس وفي الثالثة آدم وأسكنه الجنة وأمر إبليس بالسجود له وأخرجه منها في آخر ساعة\" ثم قالت اليهود ثم ماذا يا محمد قال \"ثم استوى على العرش\" قالوا قد أصبت لو أتممت فالوا: ثم استراح فغضب النبي صلى الله عليه وسلم غضبا شديدا فنزل \"ولقد خلقنا السموات والأرض وما بينهما في ستة أيام وما مسنا من لغوب فاصبر على ما يقولون\" هذا الحديث فيه غرابة فأما حديث ابن جريج عن إسماعيل بن أمية عن أيوب بن خالد عن عبدالله بن رافع عن أبي هريرة رضي الله عنه قال أخذ رسول الله صلى الله عليه وسلم بيدى فقال \"خلق الله التربة يوم السبت وخلق فيها الجبال يوم الأحد وخلق الشجر يوم الإثنين وخلق المكروه يوم الثلاثاء وخلق النور يوم الأربعاء وبث فيها الدواب يوم الخميس وخلق آدم بعد العصر يوم الجمعة آخر الخلق في آخر ساعة من ساعات يوم الجمعة فيما بين العصر إلى الليل\" فقد رواه مسلم والنسائي في كتابيهما من حديث ابن جريج به وهو من غرائب الصحيح وقد علله البخاري في التاريخ فقال رواه بعضهم عن أبي هريرة رضي الله عنه عن كعب الأحبار وهو الأصح."
    },
    {
      "ayah": 13,
      "surah": 41,
      "text": "يقول تعالى قل يا محمد لهؤلاء المشركين المكذبين بما جئتهم به من الحق إن أعرضتم عما جئتكم به من عند الله تعالى فإني أنذركم حلول نقمة الله بكم كما حلت بالأمم الماضين من المكذبين بالمرسلين \"صاعقة مثل صاعقة عاد وثمود\" أي ومن شاكلهما ممن فعل كفعلهما."
    },
    {
      "ayah": 14,
      "surah": 41,
      "text": "\"إذ جاءتهم الرسل من بين أيديهم ومن خلفهم\" كقوله تعالى \"واذكر أخا عاد إذ أنذر قومه بالأحقاف وقد خلت النذر من بين يديه ومن خلفه\" أي في القرى المجاورة لبلادهم بعث الله إليهم الرسل يأمرون بعبادة الله وحده لا شريك له ومبشرين ومنذرين ورأوا ما أحل الله بأعدائه من النقم وما ألبس أولياءه من النعم ومع هذا ما آمنوا ولا صدقوا بل كذبوا وجحدوا وقالوا \"لو شاء ربنا لأنزل ملائكة\" أي لو أرسل الله رسلا لكانوا ملائكة من عنده \"فإنا بما أرسلتم به\" أي أيها البشر \"كافرون\" أي لا نتبعكم وأنتم بشر مثلنا."
    },
    {
      "ayah": 15,
      "surah": 41,
      "text": "قال الله تعالى \"فأما عاد فاستكبروا في الأرض\" أي بغوا وعتوا وعصوا\" وقالوا من أشد منا قوة\" أي منوا بشدة تركيبهم وقواهم واعتقدوا أنهم يمتنعون بها من بأس الله \"أو لم يروا أن الله الذي خلقهم هو أشد منهم قوة\" أي أفما يتفكرون فيمن يبارزون بالعداوة فإنه العظيم الذي خلق الأشياء وركب فيها قواها الحاملة لها وإن بطشه شديد كما قال عز وجل \"والسماء بنيناها بأيد وإنا لموسعون\" فبارزوا الجبار بالعداوة وجحدوا بآياته وعصوا رسله."
    },
    {
      "ayah": 16,
      "surah": 41,
      "text": "قال تعالى \"فأرسلنا عليهم ريح صرصرا\" قال بعضهم وهي الشديدة الهبوب وقيل الباردة وقيل هي التي لها صوت والحق أنها متصفة بجميع ذلك فإنها كانت ريحا شديدة قوية لتكون عقوبتهم من جنس ما اغتروا به من قواهم وكانت باردة شديدة البرد جدا كقوله تعالى \"بريح صرصر عاتية\" أي باردة شديدة وكانت ذات صوت مزعج ومنه سمي النهر المشهور ببلاد المشرق صرصرا لقوة صوت جريه. وقوله تعالى \"في أيام نحسات\" أي متتابعات \"سبع ليال وثمانية أيام حسوما\" وكقوله \"في يوم نحس مستمر\" أي ابتدءوا بهذا العذاب في يوم نحس عليهم واستمر بهم هذا النحس \"سبع ليال وثمانية أيام حسوما\" حتى أبادهم عن آخرهم واتصل بهم خزي الدنيا بعذاب الآخرة ولهذا قال \"لنذيقنهم عذاب الخزي في الحياة الدنيا ولعذاب الآخرة أخزى\" أي أشد خزيا لهم \"وهم لا ينصرون\" أي فى الأخرى كما لم ينصروا في الدنيا وما كان لهم من الله من واق يقيهم العذاب ويدرأ عنهم النكال."
    },
    {
      "ayah": 17,
      "surah": 41,
      "text": "وقوله عز وجل \"وأما ثمود فهديناهم\" قال ابن عباس رضي الله عنهما وأبو العالية وسعيد بن جبير وقتادة والسدي وابن زيد: بينا لهم وقال الثوري دعوناهم \"فاستحبوا العمى على الهدى\" أي بصرناهم وبينا لهم ووضحنا لهم الحق على لسان نبيهم صالح عليه الصلاة والسلام فخالفوه وكذبوه وعقروا ناقة الله تعالى التي جعلها آية وعلامة على صدق نبيهم \"فأخذتهم صاعقة العذاب الهون\" أي بعث الله عليهم صيحة ورجفة وذلا وهوانا وعذابا ونكالا \"بما كانوا يكسبون\" أي من التكذيب والجحود."
    },
    {
      "ayah": 18,
      "surah": 41,
      "text": "\"ونجينا الذين آمنوا\" أي من بين أظهرهم لم يمسهم سوء ولا نالهم من ذلك ضرر بل نجاهم الله تعالى مع نبيهم صالح عليه الصلاة والسلام بإيمانهم وبتقواهم لله عز وجل."
    },
    {
      "ayah": 19,
      "surah": 41,
      "text": "يقول تعالى \"يوم يحشر أعداء الله إلى النار فهم يوزعون\" أي اذكر لهؤلاء المشركين يوم يحشرون إلى النار يوزعون أي تجمع الزبانية أولهم على آخرهم كما قال تبارك وتعالى \"ونسوق المجرمين إلى جهنم وردا\" أي عطاشا."
    },
    {
      "ayah": 2,
      "surah": 41,
      "text": "يعني القرآن منزل من الرحمن الرحيم كقوله \"قل نزله روح القدس من ربك بالحق\" وقوله \"وإنه لتنزيل رب العالمين نزل به الروح الأمين على قلبك لتكون من المنذرين\"."
    },
    {
      "ayah": 20,
      "surah": 41,
      "text": "قوله عز وجل \"حتى إذا ما جاءوها\" أي وقفوا عليها \"شهد عليهم سمعهم وأبصارهم وجلودهم بما كانوا يعملون\" أي بأعمالهم مما قدموه وأخروه لا يكتم منه حرف."
    },
    {
      "ayah": 21,
      "surah": 41,
      "text": "\"وقالوا لجلودهم لم شهدتم علينا\" أي لاموا أعضاءهم وجلودهم حين شهدوا عليهم فعند ذلك أجابتهم الأعضاء \"قالوا أنطقنا الله الذي أنطق كل شيء وهو خلقكم أول مرة\" أي فهو لا يخالف ولا يمانع وإليه ترجعون. قال الحافظ أبو بكر البزار حدثنا محمد بن عبد الرحيم حدثنا علي بن قادم حدثنا شريك عن عبيد المكتب عن الشعبي عن أنس بن مالك رضي الله عنه قال ضحك رسول الله صلى الله عليه وسلم ذات يوم وتبسم فقال صلى الله عليه وسلم \"ألا تسألوني عن أي شيء ضحكت؟\" قالوا يا رسول الله من أي شيء ضحكت؟ قال صلى الله عليه وسلم \"عجبت من مجادلة العبد ربه يوم القيامة يقول أي ربي أليس وعدتني أن لا تظلمني؟ قال بلى فيقول فإنى لا أقبل علي شاهدا إلا من نفسي فيقول الله تبارك وتعالى أو ليس كفى بي شهيدا وبالملائكة الكرام الكاتبين؟ قال فيردد هذا الكلام مرارا قال فيختم على فيه وتتكلم أركانه بما كان يعمل فيقول بعدا لكم وسحقا عنكن كنت أجادل\" ثم رواه هو وابن أبي حاتم من حديث أبي عامر الأسدي عن الثوري عن عبيد المكتب عن فضيل بن عمرو عن الشعبي ثم قال لا نعلم رواه عن أنس رضي الله عنه غير الشعبي وقد أخرجه مسلم والنسائي جميعا عن أبي بكر بن أبي النضر عن أبي النضر عن عبيدالله بن عبدالرحمن الأشجعي. عن الثوري به ثم قال النسائي لا أعلم أحدا رواه عن الثوري غير الأشجعي وليس كما قال كما رأيت والله أعلم. وقال ابن أبي حاتم حدثنا أبي حدثنا أحمد بن إبراهيم حدثنا إسماعيل ابن عليه عن يونس بن عبيد عن حميد بن هلال قال: قال أبو بردة قال أبو موسى: ويدعى الكافر والمنافق للحساب فيعرض عليه ربه عز وجل عمله فيجحد ويقول أي رب وعزتك لقد كتب علي هذا الملك ما لم أعمل فيقول له الملك أما عملت كذا في يوم كذا في مكان كذا؟ فيقول لا وعزتك أي رب ما عملته قال فإذا فعل ذلك ختم على فيه قال الأشعري رضي الله عنه فإنى لأحسب أول ما ينطق منه فخذه اليمنى. وقال الحافظ أبو يعلى حدثنا زهير حدثنا حسن عن ابن لهيعة قال دراج عن أبي الليث عن أبى سعيد الخدري رضي الله عنه عن النبي صلى الله عليه وسلم قال \"إذا كان يوم القيامة عرف الكافر بعمله فجحد وخاصم فيقول هؤلاء جيرانك يشهدون عليك فيقول كذبوا فيقول أهلك وعشيرتك فيقول كذبوا فيقول احلفوا فيحلفون ثم يصمتهم الله تعالى وتشهد عليهم ألسنتهم ويدخلهم النار\" وقال ابن أبي حاتم حدثنا أبي حدثنا أحمد بن إبراهيم حدثنا عبدالصمد بن عبدالوارث قال سمعت أبي يقول حدثنا علي بن زيد عن مسلم بن صبيح أبي الضحى عن ابن عباس رضي الله عنهما أنه قال لابن الأزرق إن يوم القيامة يأتي على الناس منه حين لا ينطقون ولا يعتذرون ولا يتكلمون حتى يؤذن لهم ثم يؤذن لهم فيختصمون فيجحد الجاحد بشركه بالله تعالى فيحلفون له كما يحلفون لكم فيبعث الله تعالى عليهم حين يجحدون شهداء من أنفسهم جلودهم وأبصارهم وأيديهم وأرجلهم ويختم على أفواههم ثم يفتح لهم الأفواه فتخاصم الجوارح فتقول \"أنطقنا الله الذي أنطق كل شيء وهو خلقكم أول مرة وإليه ترجعون\" فتقر الألسنة بعد الجحود. وقال ابن أبي حاتم حدثنا أبي حدثنا عبدة بن سليمان حدثنا ابن المبارك حدثنا صفوان بن عمرو عن عبدالرحمن بن جبير الحضرمي عن رافع أبي الحسن قال وصف رجلا جحد قال فيشير الله تعالى إلى لسانه فيربو فى فمه حتى يملأه فلا يستطيع أن ينطق بكلمة ثم يقول لآرابه كلها تكلمي واشهدي عليه فيشهد عليه سمعه وبصره وجلده وفرجه ويداه ورجلاه صنعنا عملنا فعلنا وقد تقدم أحاديث كثيرة وآثار عند قوله تعالى في سورة يس \"اليوم نختم على أفواههم وتكلمنا أيديهم وتشهد أرجلهم بما كانوا يكسبون\" بما أغنى عن إعادته ههنا. وقال ابن أبي حاتم حدثنا أبي حدثنا سويد بن سعيد حدثنا يحيى بن سليم الطائفي عن أبي خيثم عن أبي الزبير عن جابر بن عبدالله رضي الله عنهما قال لما رجعت إلى رسول الله صلى الله عليه وسلم مهاجرة البحر قال \"ألا تحدثون بأعاجيب ما رأيتم بأرض الحبشة؟\" فقال فتية منهم بلى يا رسول الله بينما نحن جلوس إذ مرت علينا عجوز من عجائز رهبانيهم تحمل على رأسها قلة من ماء فمرت بفتى منهم فجعل إحدى يديه بين كتفيها ثم دفعها فخرت على ركبتيها فانكسرت قلتها فلما ارتفعت التفتت إليه فقالت سوف تعلم يا غدر إذا وضع الله الكرسي وجمع الأولين والآخرين وتكلمت الأيدي والأرجل بما كانوا يكسبون فسوف تعلم كيف أمري وأمرك عنده غدا؟ قال يقول رسول الله صلى الله عليه وسلم \"صدقت صدقت كيف يقدس الله قوما لا يؤخذ لضعيفهم من شديدهم\" هذا حديث غريب من هذا الوجه ورواه ابن أبي الدنيا في كتاب الأهوال حدثنا إسحاق بن إبراهيم حدثنا يحيى بن سليم به."
    },
    {
      "ayah": 22,
      "surah": 41,
      "text": "وقوله تعالى \"وما كنتم تستترون أن يشهد عليكم سمعكم ولا أبصاركم ولا جلودكم\" أي تقول لهم الأعضاء والجلود حين يلومونها على الشهادة عليهم ما كنتم تكتمون منا الذي كنتم تفعلونه بل كنتم تجاهرون الله بالكفر والمعاصي ولا تبالون منه في زعمكم لأنكم كنتم لا تعتقدون أنه يعلم جميع أفعالكم ولهذا قال تعالى \"ولكن ظننتم أن الله لا يعلم كثيرا مما تعملون وذلك ظنكم الذي ظننتم بربكم أرداكم\" أي هذا الظن الفاسد وهو اعتقادكم أن الله تعالى لا يعلم كثيرا مما تعملون هو الذي أتلفكم وأرداكم عند ربكم \"فأصبحتم من الخاسرين\" أي في مواقف القيامة خسرتم أنفسكم وأهليكم. قال الإمام أحمد حدثنا أبو معاوية حدثنا الأعمش عن عمار عن عبدالرحمن بن يزيد عن عبدالله رضي الله عنه قال كنت مستترا بأستار الكعبة فجاء ثلاثة نفر قرشي وختناه ثقفيان - أو ثقفي وختناه قرشيان - كثير شحم بطونهم قليل فقه قلوبهم فتكلموا بكلام لم أسمعه فقال أحدهما أترون أن الله يسمع كلامنا هذا؟ فقال الآخر إنا إذا رفعنا أصواتنا سمعه وإذا لم نرفعه لم يسمعه فقال الآخر إن سمع منه شيئا سمعه كله - قال- فذكرت ذلك للنبي صلى الله عليه وسلم فأنزل الله عز وجل \"وما كنتم تستترون أن يشهد عليكم سمعكم ولا أبصاركم ولا جلودكم - إلى قوله - من الخاسرين\" وهكذا رواه الترمذي عن هناد عن أبي معاوية بإسناده نحوه وأخرجه أحمد ومسلم والترمذي أيضا من حديث سفيان الثوري عن الأعمش عن عمارة بن عمير عن وهب بن ربيعة عن عبدالله بن مسعود بنحوه ورواه البخاري ومسلم أيضا من حديث السفيانين كلاهما عن منصور عن مجاهد عن أبي معمر عبدالله بن سخبرة عن ابن مسعود رضي الله عنه به وقال عبدالرزاق حدثنا معمر عن بهز بن حكيم عن أبيه عن جده عن النبي صلى الله عليه وسلم في قوله تعالى \"أن يشهد عليكم سمعكم ولا أبصاركم ولا جلودكم\" قال \"إنكم تدعون يوم القيامة مفدما على أفواهكم بالفدام فأول شيء يبين عن أحدكم فخذه وكفه\"."
    },
    {
      "ayah": 23,
      "surah": 41,
      "text": "قال معمر: وتلا الحسن \"وذلكم ظنكم الذي ظننتم بربكم أرادكم\" ثم قال: قال رسول الله صلى الله عليه وسلم \"قال الله تعالى أنا مع عبدي عند ظنه بي وأنا معه إذا دعاني\" ثم افتر الحسن ينظر في هذا فقال: ألا إنما عمل الناس على قدر ظنونهم بربهم فأما المؤمن فأحسن الظن بربه فأحسن العمل وأما الكافر والمنافق فأساءا الظن بالله فأساء العمل ثم قال: قال الله تبارك وتعالى \"وما كنتم تستترون أن يشهد عليكم سمعكم ولا أبصاركم - إلى قوله - وذلكم ظنكم الذي ظننتم بربكم أرداكم\" الآية. وقال الإمام أحمد حدثنا النضر بن إسماعيل القاص وهو أبو المغيرة حدثنا ابن أبي ليلى عن ابن الزبير عن جابر رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم \" لا يموتن أحد منكم إلا وهو يحسن بالله الظن فإن قوما قد أرداهم سوء ظنهم بالله فقال الله تعالى \"وذلكم ظنكم الذي ظننتم بربكم أرداكم فأصبحتم من الخاسرين\"."
    },
    {
      "ayah": 24,
      "surah": 41,
      "text": "أي سواء عليهم صبروا أم لم يصبروا هم فى النار لا محيد لهم عنها ولا خروج لهم منها وإن طلبوا أن يستعتبوا ويبدوا أعذارا فما لهم أعذار ولا تقال لهم عثرات. قال ابن جرير: ومعنى قوله تعالى \"وإن يستعتبوا\" أي يسألوا الرجعة إلى الدنيا فلا جواب لهم قال وهذا كقوله تعالى إخبارا عنهم \"قالوا ربنا غلبت علينا شقوتنا وكنا قوما ضالين ربنا أخرجنا منها فإن عدنا فإنا ظالمون قال اخسئوا فيها ولا تكلمون\"."
    },
    {
      "ayah": 25,
      "surah": 41,
      "text": "يذكر تعالى أنه هو الذي أضل المشركين وأن ذلك بمشيئته وكونه وقدرته وهو الحكيم في أفعاله بما قيض لهم من القرناء من شياطين الإنس والجن \"فزينوا لهم ما بين أيديهم وما خلفهم\" أي حسنوا لهم أعمالهم في الماضي وبالنسبة إلى المستقبل فلم يروا أنفسهم إلا محسنين كما قال تعالى \"ومن يعش عن ذكر الرحمن نقيض له شيطانا فهو له قرين وإنهم ليصدونهم عن السبيل ويحسبون أنهم مهتدون\". وقوله تعالى \"وحق عليهم القول\" أي كلمة العذاب كما حق على أمم قد خلت من قبلهم ممن فعل كفعلهم من الجن والإنس إنهم كانوا خاسرين أي استووا هم في الخسار والدمار."
    },
    {
      "ayah": 26,
      "surah": 41,
      "text": "قوله تعالى \"وقال الذين كفروا لا تسمعوا لهذا القرآن\" أي تواصوا فيما بينهم أن لا يطيعوا للقرآن ولا ينقادوا لأوامره \"والغوا فيه\" أي إذا تلي لا تسمعوا له كما قال مجاهد والغوا فيه يعني بالمكاء والصفير والتخليط في المنطق على رسول الله صلى الله عليه وسلم إذا قرأ القرآن قريش تفعله وقال الضحاك عن ابن عباس \"والغوا فيه\" عيبوه وقال قتادة اجحدوا به وأنكروه وعادوه \"لعلكم تغلبون\" هذا حال هؤلاء الجهلة من الكفار ومن سلك مسلكهم عند سماع القرآن وقد أمر الله سبحانه وتعالى عباده المؤمنين بخلاف ذلك فقال تعالى \"وإذا قرئ القرآن فاستمعوا له وأنصتوا لعلكم ترحمون\"."
    },
    {
      "ayah": 27,
      "surah": 41,
      "text": "ثم قال عز وجل منتصرا للقرآن ومنتقما ممن عاداه من أهل الكفران \"فلنذيقن الذين كفروا عذابا شديدا\" أي في مقابلة ما اعتمدوه في القرآن وعند سماعه \"ولنجزينهم أسوأ الذي كانوا يعملون\" أي بشر أعمالهم وسيء أفعالهم."
    },
    { "ayah": 28, "surah": 41, "text": "أي بشر أعمالهم وسيء أفعالهم." },
    {
      "ayah": 29,
      "surah": 41,
      "text": "قال سفيان الثوري عن سلمة بن كهيل عن مالك بن الحصين الفزاري عن أبيه عن علي رضي الله عنه في قوله تعالى \"اللذين أضلانا\" قال إبليس وابن آدم الذي قتل أخاه وهكذا روى العوفي عن علي رضي الله عنه مثل ذلك وقال السدي عن علي رضي الله عنه فإبليس يدعو به كل صاحب شرك وابن آدم يدعو به كل صاحب كبيرة فإبليس الداعي إلى كل شر من شرك فما دونه وابن آدم الأول كما ثبت في الحديث\" ما قتلت نفس ظلما إلا كان على ابن آدم الأول كفل من دمها لأنه أول من سن القتل\". وقولهم \"نجعلهما تحت أقدامنا\" أي أسفل منا في العذاب ليكونا أشد عذابا منا ولهذا قالوا\" ليكونا من الأسفلين\" أي في الدرك الأسفل من النار كما تقدم في الأعراف في سؤال الأتباع من الله تعالى أن يعذب قادتهم أضعاف عذابهم \"قال لكل ضعف ولكن لا تعلمون\" أي أنه تعالى قد أعطى كلا منهم ما يستحقه من العذاب والنكال بحسب عمله وإفساده كما قال تعالى \"الذين كفروا وصدوا عن سبيل الله زدناهم عذابا فوق العذاب بما كانوا يفسدون\"."
    },
    {
      "ayah": 3,
      "surah": 41,
      "text": "قوله تبارك وتعالى \"كتاب فصلت آياته\" أي بينت معانيه وأحكمت أحكامه \"قرآنا عربيا\" أي في حال كونه قرآنا عربيا بينا واضحا فمعانيه مفصلة وألفاظه واضحة غير مشكلة كقوله تعالى \"كتاب أحكمت آياته ثم فصلت من لدن حكيم خبير\" أي هو معجز من حيث لفظه ومعناه \"لا يأتيه الباطل من بين يديه ولا من خلفه تنزيل من حكيم حميد\" وقوله تعالى \"لقوم يعلمون\" أي إنما يعرف هذا البيان والوضوح العلماء الراسخون."
    },
    {
      "ayah": 30,
      "surah": 41,
      "text": "يقول تعالى \"إن الذين قالوا ربنا الله ثم استقاموا\" أي أخلصوا العمل لله وعملوا بطاعة الله تعالى على ما شرع الله لهم قال الحافظ أبو يعلى الموصلي حدثنا الجراح حدثنا سلم بن قتيبة أبو قتيبة الشعيري ثنا سهيل بن أبي حازم حدثنا ثابت عن أنس بن مالك رضي الله عنه قال: قرأ علينا رسول الله صلى الله عليه وسلم هذه الآية \"إن الذين قالوا ربنا الله ثم استقاموا\" قد قالها ناس ثم كفر أكثرهم فمن قالها حتى يموت فقد استقام عليها وكذا رواه النسائي في تفسيره والبزار وابن جرير عن عمرو عن علي الفلاس عن سلم بن قتيبة به. وكذا رواه ابن أبي حاتم عن أبيه عن الفلاس به ثم قال ابن جرير حدثنا ابن بشار حدثنا عبدالرحمن حدثنا سفيان عن أبي إسحاق عن عامر بن سعيد عن سعيد بن عمران قال: قرأت عند أبي بكر الصديق رضي الله عنه هذه الآية \"إن الذين قالوا ربنا الله ثم استقاموا\" قال هم الذين لم يشركوا بالله شيئا ثم روى من حديث الأسود بن هلال قال: قال أبو بكر الصديق رضي الله عنه ما تقولون في هذه الآية \"إن الذين قالوا ربنا الله ثم استقاموا\" قال فقالوا \"ربنا الله ثم استقاموا\" من ذنب فقال لقد حملتموه على غير المحمل قالوا ربنا الله ثم استقاموا فلم يلتفتوا إلى إله غيره. وكذا قال مجاهد وعكرمة والسدي وغير واحد وقال ابن أبي حاتم حدثنا أبو عبدالله الظهراني أخبرنا حفص بن عمر العقدي عن الحكم بن أبان عن عكرمة قال سئل ابن عباس رضي الله عنهما أي آية في كتاب الله تبارك وتعالى أرخص؟ قال قوله تعالى \"إن الذين قالوا ربنا الله ثم استقاموا\" على شهادة أن لا إله إلا الله وقال الزهري: تلا عمر رضي الله عنه هذه الآية على المنبر ثم قال استقاموا والله لله بطاعته ولم يروغوا روغان الثعالب وقال علي بن أبي طلحة عن ابن عباس رضي الله عنهما \"قالوا ربنا الله ثم استقاموا\" على أداء فرائضه وكذا قال قتادة قال وكان الحسن يقول اللهم أنت ربنا فارزقنا الاستقامة وقال أبو العالية \"ثم استقاموا\" أخلصوا له الدين والعمل. وقال الإمام أحمد حدثنا هشيم حدثنا يعلى بن عطاء عن عبدالله بن سفيان الثقفي عن أبيه أن رجلا قال يا رسول الله مرني بأمر في الإسلام لا أسأل عنه أحدا بعدك قال صلى الله عليه وسلم \"قل آمنت بالله ثم استقم\" قلت فما أتقى؟ فأومأ إلى لسانه. ورواه النسائي من حديث شعبة عن يعلى بن عطاء به. ثم قال الإمام أحمد حدثنا يزيد بن هارون أخبرنا إبراهيم بن سعد حدثني ابن شهاب عن عبدالرحمن بن ماعز الغامدي عن سفيان بن عبدالله الثقفي قال: قلت يا رسول الله حدثني بأمر اعتصم به قال صلى الله عليه وسلم \"قل ربي الله ثم استقم\" قلت يا رسول الله ما أكثر ما تخاف عليّ؟ فأخذ رسول الله صلى الله عليه وسلم بطرف لسان نفسه ثم قال \"هذا\" وهكذا رواه الترمذي وابن ماجه من حديث الزهري به وقال الترمذي حسن صحيح. وقد أخرجه مسلم في صحيحه والنسائي من حديث هشام بن عروة عن أبيه عن سفيان بن عبدالله الثقفي قال قلت يا رسول الله قل لي في الإسلام قولا لا أسأل عنه أحدا بعدك قال صلى الله عليه وسلم \"قل آمنت بالله ثم استقم\" وذكر تمام الحديث. وقوله تعالى \"تتنزل عليهم الملائكة\" قال مجاهد والسدى وزيد بن أسلم وابنه يعني عند الموت قائلين \"أن لا تخافوا\" قال مجاهد وعكرمة وزيد بن أسلم أي مما تقدمون عليه من أمر الآخرة \"ولا تحزنوا\" على ما خلفتموه من أمر الدنيا من ولد وأهل ومال أو دين فإنا نخلفكم فيه \"وأبشروا بالجنة التي كنتم توعدون\" فيبشرونهم بذهاب الشر وحصول الخير وهذا كما جاء في حديث البراء رضي الله عنه قال \"إن الملائكة تقول لروح المؤمن اخرجي أيتها الروح الطيبة في الجسد الطيب كنت تعمرينه اخرجى إلى روح وريحان ورب غير غضبان\" وقيل إن الملائكة تتنزل عليهم يوم خروجهم من قبورهم حكاه ابن جرير عن ابن عباس والسدي. وقال ابن أبي حاتم: حدثنا أبو زرعة حدثنا عبد السلام بن مطهر حدثنا جعفر بن سليمان قال سمعت ثابتا قرأ سورة حم السجدة حتى بلغ \"إن الذين قالوا ربنا الله ثم استقاموا تتنزل عليهم الملائكة\" فوقف فقال بلغنا أن العبد المؤمن حين يبعثه الله تعالى من قبره يتلقاه الملكان اللذان كانا معه في الدنيا فيقولان له لا تخف ولا تحزن \"وأبشروا بالجنة التي كنتم توعدون\" قال فيؤمن الله تعالى خوفه ويقر عينه فما عظيمة يخشى الناس يوم القيامة إلا هي للمؤمن قرة عين لما هداه الله تبارك وتعالى ولما كان يعمل له في الدنيا وقال زيد بن أسلم يبشرونه عند موته وفي قبره وحين يبعث رواه ابن أبي حاتم وهذا القول يجمع الأقوال كلها وهو حسن جدا وهو الواقع."
    },
    {
      "ayah": 31,
      "surah": 41,
      "text": "قوله تبارك وتعالى \"نحن أولياؤكم في الحياة الدنيا وفي الآخرة\" أي تقول الملائكة للمؤمنين عند الاحتضار نحن كنا أولياءكم أي قرناءكم في الحياة الدنيا نسددكم ونوفقكم ونحفظكم بأمر الله وكذلك نكون معكم في الآخرة نؤنس منكم الوحشة في القبور وعند النفخة في الصور ونؤمنكم يوم البعث والنشور ونجاوز بكم الصراط المستقيم ونوصلكم إلى جنات النعيم \"ولكم فيها ما تشتهي أنفسكم\" أي في الجنة من جميع ما تختارون مما تشتهيه النفوس وتقر به العيون \"ولكم فيها ما تدعون\" أي مهما طلبتم وجدتم وحضر بين أيديكم كما اخترتم."
    },
    {
      "ayah": 32,
      "surah": 41,
      "text": "أي ضيافة وعطاء وإنعاما من غفور لذنوبكم رحيم بكم رؤوف حيث غفر وستر ورحم ولطف وقد ذكر ابن أبي حاتم ههنا حديث سوق الجنة عند قوله تعالى \"ولكم فيها ما تشتهي أنفسكم ولكم فيهـا ما تدعون نزلا من غفور رحيم\" فقال حدثنا أبي ثنا هشام بن عمار ثنا عبد الحميد بن حبيب بن أبي العشرين أبي سعيد حدثنا الأوزاعي حدثني حسان بن عطية عن سعيد بن المسيب أنه لقي أبا هريرة رضي الله عنه فقال أبو هريرة رضي الله عنه أسأل الله أن يجمع بيني وبينك فى سوق الجنة فقال سعيد أو فيها سوق؟ فقال نعم أخبرنى رسول الله صلى الله عليه وسلم أن أهل الجنة إذا دخلوا فيها نزلوا بفضل أعمالهم فيؤذن لهم في مقدار يوم الجمعة من أيام الدنيا فيزورون الله عز وجل ويبرز لهم عرشه ويتبدى لهم في روضة من رياض الجنة ويوضع لهم منابر من نور ومنابر من لؤلؤ ومنابر من ياقوت ومنابر من زبرجد ومنابر من ذهب ومنابر من فضة ويجلس أدناهم وما فيهم دنيء على كثبان المسك والكافور ما يرون أن أصحاب الكراسي بأفضل منهم مجلسا قال أبو هريرة رضي الله عنه قلت يا رسول الله وهل نرى ربنا؟ قال صلى الله عليه وسلم \"نعم هل تمارون في رؤية الشمس والقمر ليلة البدر؟\" فلنا لا: قال صلى الله عليه وسلم \"فكذلك لا تتمارون في رؤية ربكم تعالى ولا يبقى في ذلك المجلس أحد إلا حاضره الله محاضرة حتى إنه ليقول للرجل منهم يا فلان بن فلان أتذكر يوم عملت كذا وكذا - يذكره ببعض غدراته في الدنيا- فيقول أي رب أفلم تغفر لي؟ فيقول بلى فبسعة مغفرتي بلغت منزلتك هذه- قال- فبينما هم على ذلك غشيتهم سحابة من فوقهم فأمطرت عليهم طيبا لم يجدوا مثل ريحه شيئا قط - قال- ثم يقول ربنا عز وجل قوموا إلى ما أعددت لكم من الكرامة وخذوا ما اشتهيتم قال فنأتي سوقا قد حفت به الملائكة فيها ما لم تنظر العيون إلى مثله ولم تسمع الآذان ولم يخطر على القلوب قال فيحمل لنا ما اشتهينا ليس يباع فيه شيء ولا يشترى وفي ذلك السوق يلقى أهل الجنة بعضهم بعضا قال فيقبل الرجل ذو المنزلة الرفيعة فيلقى من هو دونه وما فيهم دنيء فيروعه ما يرى عليه من اللباس فما ينقضي آخر حديثه حتى يتمثل عليه أحسن منه وذلك لأنه لا ينبغي لأحد أن يحزن فيهل ثم ننصرف إلى منازلنا فيتلقانا أزواجنا فيقلن مرحبا وأهلا بحبيبنا لقد جئت وإن بك من الجمال والطيب أفضل مما فارقتنا عليه فيقول إنا جالسنا اليوم ربنا الجبار تبارك وتعالى وبحقنا أن ننقلب بمثل ما انقلبنا به\". وقد رواه الترمذي في صفة الجنة من جامعه عن محمد بن إسماعيل عن هشام بن عمار ورواه ابن ماجة عن هشام بن عمار به نحوه ثم قال الترمذي هذا حديث غريب لا نعرفه إلا من هذا الوجه. وقال الإمام أحمد حدثنا ابن أبي عدي عن حميد عن أنس رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم \"من أحب لقاء الله أحب الله لقاءه ومن كره لقاء الله كره الله لقاءه\" قلنا يا رسول الله كلنا نكره الموت قال صلى الله عليه وسلم \"ليس ذلك كراهية الموت ولكن المؤمن إذا حضر جاءه البشير من الله تعالى بما هو صائر إليه فليس شيء أحب إليه من أن يكون قد لقي الله تعالى فأحب الله لقاءه قال وإن الفاجر أو الكافر إذا حضر جاءه بما هو صائر إليه من الشر أو ما يلقى من الشر فكره لقاء الله فكره الله لقاءه\" وهذا حديث صحيح وقد ورد في الصحيح من غير هذا الوجه."
    },
    {
      "ayah": 33,
      "surah": 41,
      "text": "يقول عز وجل \"ومن أحسن قولا ممن دعا إلى الله\" أي دعا عباد الله إليه \"وعمل صالحا وقال إنني من المسلمين\" أي وهو في نفسه مهتد بما يقوله فنفعه لنفسه ولغيره لازم ومتعد وليس هو من الذين يأمرون بالمعروف ولا يأتونه وينهون عن المنكر ويأتونه بل يأتمر بالخير ويترك الشر ويدعو الخلق إلى الخالق تبارك وتعالى وهذه عامة في كل من دعا إلى خير وهو فى نفسه مهتد ورسول الله صلى الله عليه وسلم أولى الناس بذلك كما قال محمد بن سيرين والسدي وعبدالرحمن بن زيد بن أسلم وقيل المراد بها المؤذنون الصلحاء كما ثبت في صحيح مسلم \"المؤذنون أطول الناس أعناقا يوم القيامة\" وفي السنن مرفوعا \"الإمام ضامن والمؤذن مؤتمن فأرشد الله الأئمة وغفر للمؤذنين\" وقال ابن أبي حاتم حدثنا علي بن الحسين حدثنا محمد بن عروة الهروي حدثنا غسان قاضي هراة وقال أبو زرعة حدثنا إبراهيم بن طهمان عن مطر عن الحسن عن سعد بن أبي وقاص رضي الله عنه أنه قال \"سهام المؤذنين عند الله تعالى يوم القيامة كسهام المجاهدين وهو بين الأذان والإقامة كالمتشحط في سبيل الله تعالى في دمه. قال: وقال ابن مسعود رضي الله عنه لو كنت مؤذنا ما باليت أن لا أحج ولا أعتمر ولا أجاهد قال وقال عمر بن الخطاب رضي الله عنه لو كنت مؤذنا لكمل أمري وما باليت أن لا أنتصب لقيام الليل ولا لصيام النهار سمعت رسول الله صلى الله عليه وسلم يقول \"اللهم اغفر للمؤذنين ثلاثا\" قال: فقلت يا رسول الله تركتنا ونحن نجتلد على الأذان بالسيوف قال\" كلا يا عمر إنه سيأتي على الناس زمان يتركون الأذان على ضعفائهم وتلك لحوم حرمها الله عز وجل على النار لحوم المؤذنين\" قال: وقالت عائشة رضي الله تعالى عنها ولهم هذه الآية \"ومن أحسن قولا ممن دعا إلى الله وعمل صالحا وقال إنني من المسلمين\" قالت فهو المؤذن إذا قال حي على الصلاة فقد دعا إلى الله وهكذا قال ابن عمر رضي الله عنهما وعكرمة إنهـا نزلت في المؤذنين وقد ذكر البغوي عن أبي أمامة الباهلي رضي الله عنه أنه قال في قوله عز وجل \"وعمل صالحا\" يعني صلاة ركعتين بين الأذان والإقامة ثم أورد البغوي حديث عبدالله بن المغفل رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم \"بين كل أذانين صلاة - ثم قال في الثالثة - لمن شاء\" وقد أخرجه الجماعة في كتبهم من حديث عبدالله بن بريدة عنه وحديث الثوري عن زيد العمي عن أبي إياس معاوية بن قرة عن أنس بن مالك رضي الله عنه قال الثوري لا أراه إلا قد رفعه إلى النبي صلى الله عليه وسلم \"الدعاء لا يرد بين الأذان والإقامة\" ورواه أبو داود والترمذي والنسائي في اليوم والليلة كلهم من حديث الثوري به وقال الترمذي هذا حديث حسن ورواه النسائي أيضا من حديث سليمان التيمي عن قتادة عن أنس به والصحيح أن الآية عامة في المؤذنين وفي غيرهم فأما حال نزول هذه الآية فإنه لم يكن الأذان مشروعا بالكلية لأنها مكية والأذان إنما شرع بالمدينة بعد الهجرة حين أريه عبدالله بن عبد ربه الأنصاري رضي الله عنه . في منامه فقصه على رسول الله صلى الله عليه وسلم فأمره أن يلقيه على بلال رضي الله عنه فإنه أندى صوتا كما هو مقرر في موضعه فالصحيح إذن أنها عامة كما قال عبد الرزاق عن معمر عن الحسن البصري أنه تلا هذه الآية \"ومن أحسن قولا ممن دعا إلى الله وعمل صالحا وقال إنني من المسلمين\" فقال هذا حبيب الله هذا ولي الله هذا صفوة الله هذا خيرة الله هذا أحب أهل الأرض إلى الله أجاب الله في دعوته ودعا الناس إلى ما أجاب الله فيه من دعوته وعمل صالحا في إجابته وقال إنني من المسلمين هذا خليفة الله."
    },
    {
      "ayah": 34,
      "surah": 41,
      "text": "قوله تعالى \"ولا تستوي الحسنة ولا السيئة\" أي فرق عظيم بين هذه وهذه \"ادفع بالتي هي أحسن\" أى من أساء إليك فادفعه عنك بالإحسان إليه كما قال عمر رضي الله عنه: ما عاقبت من عصى الله فيك بمثل أن تطيع الله فيه. وقوله عز وجل \"فإذا الذي بينك وبينه عداوة كأنه ولى حميم\" وهو الصديق أى إذا أحسنت إلى من أساء إليك قادته تلك الحسنة إليه إلى مصافاتك ومحبتك والحنو عليك حتى يصير كأنه ولي لك حميم أي قريب إليك من الشفقة عليك والإحسان إليك."
    },
    {
      "ayah": 35,
      "surah": 41,
      "text": "قال عز وجل \"وما يلقاها إلا الذين صبروا\" أي وما يقبل هذه الوصية ويعمل بها إلا من صبر على ذلك فإنه يشق على النفوس \"وما يلقاها إلا ذو حظ عظيم\" أي ذو نصيب وافر من السعادة في الدنيا والآخرة قال علي بن أبي طلحة عن ابن عباس في تفسير هذه الآية: أمر الله المؤمنين بالصبر عند الغضب والحلم عند الجهل والعفو عند الإساءة فإذا فعلوا ذلك عصمهم الله من الشيطان وخضع لهم عدوهم كأنه ولي حميم."
    },
    {
      "ayah": 36,
      "surah": 41,
      "text": "وقوله تعالى \"وإما ينزغنك من الشيطان نزغ فاستعذ بالله\" أي أن شيطان الإنس ربما ينخدع بالإحسان إليه فأما شيطان الجن فإنه لا حيلة فيه إذا وسوس إلا الاستعاذة بخالقه الذي سلطه عليك فإذا استعذت بالله والتجأت إليه كفه عنك ورد كيده وقد كان رسول الله صلى الله عليه وسلم إذا قام إلى الصلاة يقول \" أعوذ بالله السميع العليم من الشيطان الرجيم من همزه ونفخه ونفثه\" وقد قدمنا أن هذا المقام لا نظير له في القرآن إلا في سورة الأعراف عند قوله تعالى \"خذ العفو وأمر بالعرف وأعرض عن الجاهلين وإما ينزغنك من الشيطان نزغ فاستعذ بالله إنه هو السميع العليم\" وفي سورة المؤمنين عند قوله \"ادفع بالتي هي أحسن السيئة نحن أعلم بما يصفون وقل رب أعوذ بك من همزات الشياطين وأعوذ بك رب أن يحضرون\"."
    },
    {
      "ayah": 37,
      "surah": 41,
      "text": "يقول تعالى منبها خلقه على قدرته العظيمة وأنه الذي لا نظير له وأنه على ما يشاء قادر \"ومن آياته الليل والنهار والشمس والقمر\" أي أنه خلق الليل بظلامه والنهار بضيائه وهما متعاقبان لا يفتران والشمس ونورها وإشراقها والقمر وضياؤه وتقدير منازله في فلكه واختلاف سيره في سمائه ليعرف باختلاف سيره وسير الشمس مقادير الليل والنهار والجمع والشهور والأعوام ويتبين بذلك حلول الحقوق وأوقات العبادات والمعاملات ثم لما كان الشمس والقمر أحسن الأجرام المشاهدة في العالم العلوي والسفلي نبه تعالى على أنهما مخلوقان عبدان من عبيده تحت قهره وتسخيره فقال \"لا تسجدوا للشمس ولا للقمر واسجدوا لله الذي خلقهن إن كنتم إياه تعبدون\" أي ولا تشركوا به فما تنفعكم عبادتكم له مع عبادتكم لغيره فإنه لا يغفر أن يشرك به."
    },
    {
      "ayah": 38,
      "surah": 41,
      "text": "\"فإن استكبروا\" أي عن إفراد العبادة له وأبوا إلا أن يشركوا معه غيره \"فالذين عند ربك\" يعني الملائكة \"يسبحون له بالليل والنهار وهم لا يسأمون\" كقوله عز وجل \"فإن يكفر بها هؤلاء فقد وكلنا بها قوما ليسوا بها بكافرين\" وقال الحافظ أبو يعلى حدثنا سفيان يعني ابن وكيع حدثنا أبي عن ابن أبي ليلى عن أبي الزبير عن جابر رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم \"لا تسبوا الليل ولا النهار ولا الشمس ولا القمر ولا الرياح فإنها ترسل رحمة لقوم وعذابا لقوم\"."
    },
    {
      "ayah": 39,
      "surah": 41,
      "text": "\"ومن آياته\" أي على قدرته على إعادة الموتى \"أنك ترى الأرض خاشعة\" أى هامدة لا نبات فيها بل هى ميتة \"فإذا أنزلنا عليها الماء اهتزت وربت\" أي أخرجت من جميع ألوان الزروع والثمار \"إن الذي أحياها لمحيى الموتى إنه على كل شيء قدير\"."
    },
    {
      "ayah": 4,
      "surah": 41,
      "text": "\"بشيرا ونذيرا\" أي تارة يبشر المؤمنين وتارة ينذر الكافرين \"فأعرض أكثرهم فهم لا يسمعون\" أي أكثر قريش فهم لا يفهمون منه شيئا مع بيانه ووضوحه."
    },
    {
      "ayah": 40,
      "surah": 41,
      "text": "\"إن الذين يلحدون في آياتنا\" قال ابن عباس: الإلحاد وضع الكلام على غير مواضعه وقال قتادة وغيره هو الكفر والعناد. وقوله عز وجل \"لا يخفون علينا \"فيه تهديد شديد ووعيد أكيد أي أنه تعالى عالم بمن يلحد في آياته وأسمائه وصفاته وسيجزيه على ذلك بالعقوبة والنكال ولهذا قال تعالى \"أفمن يلقى في النار خير أم من يأتي آمنا يوم القيامة\" أي أيستوي هذا وهذا؟ لا يستويان. ثم قال عز وجل تهديدا للكفرة \"اعملوا ما شئتم\" قال مجاهد والضحاك وعطاء الخراسانى \"اعملوا ما شئتم\" وعيد: أي من خير أو شر إنه عليم بكم وبصير بأعمالكم ولهذا قال \"إنه بما تعملون بصير\"."
    },
    {
      "ayah": 41,
      "surah": 41,
      "text": "\"إن الذين كفروا بالذكر لما جاءهم\" قال الضحاك والسدي وقتادة وهو القرآن \"وإنه لكتاب عزيز\" أي منيع الجناب لا يرام أن يأتي أحد بمثله."
    },
    {
      "ayah": 42,
      "surah": 41,
      "text": "\"لا يأتيه الباطل من بين يديه ولا من خلفه\" أي ليس للبطلان إليه سبيل لأنه منزل من رب العالمين ولهذا قال \"تنزيل من حكيم حميد\" أي حكيم في أقواله وأفعاله حميد بمعنى محمود أي في جميع ما يأمر به وينهى عنه الجميع محمودة عواقبه وغاياته."
    },
    {
      "ayah": 43,
      "surah": 41,
      "text": "\"ما يقال لك إلا ما قد قيل للرسل من قبلك\" قال قتادة والسدي وغيرهما ما يقال لك من التكذيب إلا كما قد قيل للرسل من قبلك فكما كذبت كذبوا وكما صبروا على أذى قومهم لهم فأصبر أنت على أذى قومك لك وهذا اختيار ابن جرير ولم يحك هو ولا ابن أبي حاتم غيره. وقوله تعالى \"إن ربك لذو مغفرة\" أي لمن تاب إليه \"وذو عقاب أليم\" أي لمن استمر على كفره وطغيانه وعناده وشقاقه ومخالفته. قال ابن أبي حاتم حدثنا أبي حدثنا موسى بن إسماعيل حدثنا حماد عن علي بن زيد عن سعيد بن المسيب قال نزلت هذه الآية \"إن ربك لذو مغفرة\" قال رسول الله صلى الله عليه وسلم \"لولا عفو الله وتجاوزه ما هنأ أحدا العيش ولولا وعيده وعقابه لاتكل كل أحد\"."
    },
    {
      "ayah": 44,
      "surah": 41,
      "text": "لما ذكر تعالى القرآن وفصاحته وبلاغته وإحكامه في لفظه ومعناه ومع هذا لم يؤمن به المشركون نبه على أن كفرهم به كفر عناد وتعنت كما قال عز وجل \"ولو نزلناه على بعض الأعجمين فقرأه عليهم ما كانوا به مؤمنين\" كذلك لو أنزل القرآن كله بلغة العجم لقالوا على وجه التعنت والعناد \"لولا فصلت آياته أأعجمي وعربي\" أي لقالوا هلا أنزل مفصلا بلغة العرب ولأنكروا ذلك فقالوا أعجمي وعربي أي كيف ينزل كلام أعجمي على مخاطب عربي لا يفهمه؟ هكذا روي هذا المعنى عن ابن عباس ومجاهد وعكرمة وسعيد بن جبير والسدي وغيرهم وقيل المراد بقولهم \"لولا فصلت آياته أأعجمي وعربي\" أي هل ينزل بعضها بالأعجمي وبعضها بالعربي؟ هذا قول الحسن البصري وكان يقرؤها كذلك بلا استفهام في قوله أعجمي وهو رواية عن سعيد بن جبير وهو فى التعنت والعناد أبلغ ثم قال عز وجل \"قل هو للذين آمنوا هدى وشفاء\" أي قل يا محمد هذا القرآن لمن آمن به هدى لقلبه وشفاء لما في الصدور من الشكوك والريب \"والذين لا يؤمنون في آذانهم وقر\" أي لا يفهمون ما فيه \"وهو عليهم عمى\" أي لا يهتدون إلى ما فيه من البيان كما قال سبحانه وتعالى \"وننزل من القرآن ما هو شفاء ورحمة للمؤمنين ولا يزيد الظالمين إلا خسارا\" \"أولئك ينادون من مكان بعيد\" قال مجاهد يعني بعيد من قلوبهم قال ابن جرير معناه كأن من يخاطبهم يناديهم من مكان بعيد لا يفهمون ما يقول قلت وهذا كقوله تعالى \"ومثل الذين كفروا كمثل الذي ينعق بما لا يسمع إلا دعاء ونداء صم بكم عمي فهم لا يعقلون\" وقال الضحاك ينادون يوم القيامة بأشنع أسمائهم. وقال السدي كان عمر بن الخطاب رضي الله عنه جالسا عند رجل من المسلمين يقضي إذ قال يا لبيكاه فقال له عمر رضي الله عنه لم تلبي؟ هل رأيت أحدا أو دعاك أحد؟ فقال دعاني داع من وراء البحر فقال عمر رضي الله عنه أولئك ينادون من مكان بعيد رواه ابن أبي حاتم."
    },
    {
      "ayah": 45,
      "surah": 41,
      "text": "\"ولقد أتينا موسى الكتاب فاختلف فيه\" أي كذب وأوذي \"فاصبر كما صبر أولوا العزم من الرسل\" \"ولولا كلمة سبقت من ربك إلى أجل مسمى\" بتأخير الحساب إلى يوم المعاد \"لقضي بينهم\" أي لعجل لهم العذاب بل لهم موعد لن يجدوا من دونه موئلا \"وإنهم لفي شك منه مريب\" أي وما كان تكذيبهم له عن بصيرة منهم لما قالوا بل كانوا شاكين فيما قالوه غير محققين لشيء كانوا فيه. هكذا وجهه ابن جرير وهو محتمل والله أعلم."
    },
    {
      "ayah": 46,
      "surah": 41,
      "text": "\"من عمل صالحا فلنفسه\" أي إنما يعود نفع ذلك على نفسه \"ومن أساء فعليها\" أي إنما يرجع وبال ذلك عليه \"وما ربك بظلام للعبيد\" أي لا يعاقب أحدا إلا بذنبه ولا يعذب أحدا إلا بعد قيام الحجة عليه وإرسال الرسول إليه."
    },
    {
      "ayah": 47,
      "surah": 41,
      "text": "\"إليه يرد علم الساعة\" أي لا يعلم ذلك أحد سواه كما قال محمد صلى الله عليه وسلم وهو سيد البشر لجبريل عليه الصلاة والسلام وهو من سادات الملائكة حين سأله عن الساعة فقال \"ما المسئول عنها بأعلم من السائل\" وكما قال عز وجل \"إلى ربك منتهاها\" وقال جل جلاله \"لا يجليها لوقتها إلا هو\" وقوله تبارك وتعالى \"وما تخرج من ثمرات من أكمامها وما تحمل من أنثى ولا تضع إلا بعلمه\" أي الجميع بعلمه لا يعزب عن علمه مثقال ذرة في الأرض ولا في السماء وقد قال سبحانه وتعالى \"وما تسقط من ورقة إلا يعلمها\" وقال جلت عظمته \"يعلم ما تحمل كل أنثى وما تغيض الأرحام وما تزداد وكل شيء عنده بمقدار\" وقال تعالى \"وما يعمر من معمر ولا ينقص من عمره إلا في كتاب إن ذلك على الله يسير\". وقوله جل وعلا \"ويوم يناديهم أين شركائي\" أي يوم القيامة ينادي الله المشركين على رءوس الخلائق أين شركائي الذين عبدتموهم معي \"قالوا آذناك\" أي أعلمناك \"ما منا من شهيد\" أي ليس أحد منا يشهد اليوم أن معك شريكا."
    },
    {
      "ayah": 48,
      "surah": 41,
      "text": "\"وضل عنهم ما كانوا يدعون من قبل\" أي ذهبوا فلم ينفعوهم \"وظنوا ما لهم من محيص\" أي وظن المشركون يوم القيامة وهذا بمعنى اليقين \"ما لهم من محيص\" أي لا محيد لهم عن عذاب الله كقوله تعالى \"ورأى المجرمون النار فظنوا أنهم مواقعوها ولم يجدوا عنها مصرفا\"."
    },
    {
      "ayah": 49,
      "surah": 41,
      "text": "يقول تعالى لا يمل الإنسان من دعاء ربه بالخير وهو المال وصحة الجسم وغير ذلك وإن مسه الشر وهو البلاء أو الفقر \"فيئوس قنوط\" أي يقع في ذهنه أنه لا يتهيأ له بعد هذا خير."
    },
    {
      "ayah": 5,
      "surah": 41,
      "text": "\"وقالوا قلوبنا فى أكنة\" أي في غلف مغطاة \"مما تدعونا إليه وفي آذاننا وقر\" أي صمم عما جئتنا به \"ومن بيننا وبينك حجاب\" فلا يصل إلينا شيء مما تقول \"فاعمل إننا عاملون\" أي اعمل أنت على طريقتك ونحن على طريقتنا لا نتابعك قال الإمام العالم عبد بن حميد في مسنده حدثني ابن أبي شيبة حدثنا علي بن مسهر عن الأجلح عن الزيال بن حرملة الأسدي عن جابر بن عبدالله رضي الله عنه قال: اجتمعت قريش يوما فقالوا انظروا أعلمكم بالسحر والكهانة والشعر فليأت هذا الرجل الذي قد فرق جماعتنا وشتت أمرنا وعاب ديننا فليكلمه ولننظر ماذا يرد عليه فقالوا ما نعلم أحدا غير عتبة بن ربيعة فقالوا أنت يا أبا الوليد فأتاه عتبة فقال: يا محمد أنت خير أم عبدالله؟ فسكت رسول الله صلى الله عليه وسلم فقال أنت خير أم عبد المطلب؟ فسكت رسول الله صلى الله عليه وسلم فقال إن كنت تزعم أن هؤلاء خير منك فقد عبدوا الآلهة التي عبت وإن كنت تزعم أنك خير منهم فتكلم حتى نسمع قولك إنا والله ما رأينا سخلة قط أشأم على قومك منك فرقت جماعتنا وشتت أمرنا وعبت ديننا وفضحتنا في العرب حتى لقد طار فيهم أن في قريش ساحرا وأن في قريش كاهنا والله ما ننتظر إلا مثل صيحة الحبلى أن يقوم بعضنا إلى بعض بالسيوف حتى نتفانى أيها الرجل إن كان إنما بك الحاجة جمعنا لك حتى تكون أغنى قريش رجلا واحدا وإن كان إنما بك الباءة فاختر أي نساء قريش شئت فلنزوجك عشرا فقال رسول الله صلى الله عليه وسلم فرغت؟ قال نعم فقال رسول الله صلى الله عليه وسلم \"بسم الله الرحمن الرحيم حم تنزيل من الرحمن الرحيم - حتى بلغ - فإن أعرضوا فقل أنذرتكم صاعقة مثل صاعقة عاد وثمود\" فقال عتبة حسبك حسبك عندك غير هذا؟ فقال رسول الله صلى الله عليه وسلم \"لا\" فرجع إلى قريش فقالوا ما وراءك؟ قال ما تركت شيئا أرى أنكم تكلمون به إلا كلمته قالوا فهل أجابك؟ قال نعم لا والذي نصبها بنية ما فهمت شيئا مما قاله غير أنه أنذركم صاعقة مثل صاعقة عاد وثمود قالوا ويلك يكلمك الرجل بالعربية لا تدري ما قال؟ قال لا والله ما فهمت شيئا مما قال غير ذكر الصاعقة. وهكذا رواه الحافظ أبو يعلى الموصلي في مسنده عن أبي بكر بن أبي شيبة بإسناده مثله سواء وقد ساقه البغوي في تفسيره بسنده عن محمد بن فضيل عن الأجلح وهو ابن عبدالله الكندي الكوفي وقد ضعف بعض الشيء عن الزيال بن حرملة عن جابر بن عبدالله رضي الله عنه فذكر الحديث إلى قوله \"فإن أعرضوا فقل أنذرتكم صاعقة مثل صاعقة عاد وثمود\" فأمسك عتبة على فيه وناشده بالرحم ورجع إلى أهله ولم يخرج إلى قريش واحتبس عنهم فقال أبو جهل يا معشر قريش والله ما نرى عتبة إلا قد صبأ إلى محمد وأعجبه طعامه وما ذاك إلا من حاجة أصابته فإنطلقوا بنا إليه فإنطلقوا إليه فقال أبو جهل يا عتبة ما حبسك عنا إلا أنك صبأت إلى محمد وأعجبك طعامه فإن كانت بك حاجة جمعنا لك من أموالنا ما يغنيك عن طعام محمد فغضب عتبة وأقسم أن لا يكلم محمدا أبدا وقال والله لقد علمتم أنى من أكثر قريش مالا ولكني أتيته وقصصت عليه القصة فأجابني بشيء والله ما هو بشعر ولا كهانة ولا سحر وقرأ السورةإلى قوله تعالى \"فإن أعرضوا فقل أنذرتكم صاعقة مثل صاعقة عاد وثمود\" فأمسكت بفيه وناشدته بالرحم أن يكف وقد علمتم أن محمدا إذا قال شيئا لم يكذب فخشيت أن ينزل بكم العذاب وهذا السياق أشبه من سياق البزار وأبي يعلى والله تعالى أعلم وقد أورد هذه القصة الإمام محمد ابن إسحاق بن يسار في كتاب السيرة على خلاف هذا النمط فقال حدثني يزيد بن زياد عن محمد بن كعب القرظي قال: حدثت أن عتبة بن ربيعة- وكان سيدا- قال يوما وهو جالس في نادي قريش - ورسول الله صلى الله عليه وسلم جالس في المسجد وحده- يا معشر قريش ألا أقوم إلى محمد فأكلمه وأعرض عليه أمورا لعله أن يقبل بعضها فنعطيه أيها شاء ويكف عنا؟ - وذلك حين أسلم حمزة رضي الله عنه ورأوا أصحاب رسول الله صلى الله عليه وسلم يزيدون ويكثرون - فقالوا بلى يا أبا الوليد فقم إليه فكلمه فقام إليه عتبة حتى جلس إلى رسول الله صلى الله عليه وسلم فقال: يا ابن أخي إنك منا حيث علمت من السطة في العشيرة. والمكان في النسب وإنك قد أتيت قومك بأمر عظيم فرقت به جماعتهم وسفهت به أحلامهم وعبت به آلهتهم ودينهم وكفرت به من مضى من آبائهم فاسمع مني أعرض عليك أمورا ننظر فيها لعلك تقبل منها بعضها قال: فقال له رسول الله صلى الله عليه وسلم \"فل يا أبا الوليد أسمع\" قال يا ابن أخي إن كنت إنما تريد بما جئت به من هذا الأمر مالا جمعنا لك من أموالنا حتى تكون أكثرنا مالا وإن كنت تريد به شرفا سودناك علينا حتى لا نقطع أمرا دونك وإن كنت تريد به ملكا ملكناك علينا وإن كان هذا الذي يأتيك رئيا تراه لا تستطيع رده عن نفسك طلبنا لك الأطباء وبذلنا فيه أموالنا حتى نبرئك منه فإنه ربما غلب التابع على الرجل حتى يداوي منه أو كما قال له حتى إذا فرغ عتبة ورسول الله صلى الله عليه وسلم يستمع منه قال \"أفرغت يا أبا الوليد؟\" قال نعم. قال \"فاستمع منى\" قال أفعل. قال \"بسم الله الرحمن الرحيم حم تنزيل من الرحمن الرحيم كتاب فصلت آياته قرآنا عربيا لقوم يعلمون بشيرا ونذيرا فأعرض أكثرهم فهم لا يسمعون\" ثم مضى رسول الله صلى الله عليه وسلم فيها وهو يقرؤها عليه فلما سمع عتبة أنصت لها وألقى يديه خلف ظهره معتمدا عليهما يستمع منه حتى انتهى رسول الله صلى الله عليه وسلم إلى السجدة منها فسجد ثم قال \"قد سمعت يا أبا الوليد ما سمعت فأنت وذاك\" فقام عتبة إلى أصحابه فقال بعضهم لبعض نحلف بالله لقد جاءكم أبو الوليد بغير الوجه الذي ذهب به فلما جلس إليهم قالوا ما وراءك يا أبا الوليد؟ قال ورائي أني سمعت قولا والله ما سمعت مثله قط والله ما هو بالسحر ولا بالشعر ولا بالكهانة يا معشر قريش أطيعونى واجعلوها لي خلوا بين الرجل وبين ما هو فيه فاعتزلوه فوالله ليكونن لقوله الذي سمعت نبأ فإن تصبه العرب فقد كفيتموه بغيركم وإن يظهر على العرب فملكه ملككم وعزه عزكم وكنتم أسعد الناس به قالوا سحرك والله يا أبا الوليد بلسانه؟ قال هذا رأيي فيه فاصنعوا ما بدا لكم وهذا السياق أشبه من الذي قبله والله أعلم."
    },
    {
      "ayah": 50,
      "surah": 41,
      "text": "\"ولئن أذقناه رحمة منا من بعد ضراء مسته ليقولن هذا لي\" أي إذا أصابه خير ورزق بعدما كان في شدة ليقولن هذا لي إنى كنت أستحقه عند ربي \"وما أظن الساعة قائمة\" أي يكفر بقيام الساعة أي لأجل أنه خول نعمة يبطر ويفخر ويكفر كما قال تعالى \"كلا إن الإنسان ليطغى أن رآه استغنى\" \"ولئن رجعت إلى ربي إن لي عنده للحسنى\" أي ولئن كان ثم معاد فليحسنن إلى ربي كما أحسن إلي في هذه الدار يتمنى على الله عز وجل مع إساءته العمل وعدم اليقين قال الله تبارك وتعالى \"فلننبئن الذين كفروا بما عملوا ولنذيقنهم من عذاب غليظ\" يتهدد تعالى من كان هذا عمله واعتقاده بالعقاب والنكال."
    },
    {
      "ayah": 51,
      "surah": 41,
      "text": "\"وإذا أنعمنا على الإنسان أعرض ونأى بجانبه\" أي أعرض عن الطاعة واستكبر عن الانقياد لأوامر الله عز وجل كقوله جل جلاله \"فتولى بركنه\" \"وإذا مسه الشر\" أي الشدة \"فذو دعاء عريض\" أي يطيل المسئلة في الشيء الواحد فالكلام العريض ما طال لفظه وقل معناه والوجيز عكسه وهو ما قل ودل وقد قال تعالى \"وإذا مس الإنسان الضر دعانا لجنبه أو قاعدا أو قائما فلما كشفنا عنه ضره مر كأن لم يدعنا إلى ضر مسه\" الآية."
    },
    {
      "ayah": 52,
      "surah": 41,
      "text": "\"قل\" يا محمد لهؤلاء المشركين المكذبين بالقرآن \"أرأيتم إن كان\" هذا القرآن \"من عند الله ثم كفرتم به\" أي كيف ترون حالكم عند الذي أنزله على رسوله؟ ولهذا قال عز وجل \"من أضل ممن هو في شقاق بعيد\" أي في كفر وعناد ومشاقة للحق ومسلك بعيد من الهدى."
    },
    {
      "ayah": 53,
      "surah": 41,
      "text": "\"سنريهم آياتنا في الآفاق وفي أنفسهم\" أي سنظهر لهم دلالاتنا وحججنا على كون القرآن حقا منزلا من عند الله على رسول الله صلى الله عليه وسلم بدلائل خارجية \"في الآفاق\" من الفتوحات وظهور الإسلام على الأقاليم وسائر الأديان قال مجاهد والحسن والسدي ودلائل في أنفسهم قالوا: وقعة بدر وفتح مكة ونحو ذلك من الوقائع التي حلت بهم نصر الله فيها محمدا صلى الله عليه وسلم وصحبه وخذل فيها الباطل وحزبه ويحتمل أن يكون المراد من ذلك ما الإنسان مركب منه وفيه وعليه من المواد والاختلاط والهيئات العجيبة كما هو مبسوط في علم التشريح الدال على حكمة الصانع تبارك وتعالى وكذلك ما هو مجبول عليه من الأخلاق المتباينة من حسن وقبح وغير ذلك وما هو متصرف فيه تحت الأقدار التي لا يقدر بحوله وقوته وحيله وحذره أن يجوزها ولا يتعداها كما أنشده ابن أبي الدنيا في كتابه التفكر والاعتبار عن شيخه أبي جعفر القرشي حيث قال وأحسن المقال وإذا نظرت تريد معتبرا فانظر إليك ففيك معتبر أنت الذي تمسي وتصبح في الدنيا وكل أموره عبر أنت المصرف كان في صغر ثم استقل بشخصك الكبر أنت الذي تنعاه خلقته ينعاه منه الشعر والبشر أنت الذي تعطى وتسلب لا ينجيه من أن يسلب الحذر أنت الذي لا شيء منه له وأحق منه بماله القدر وقوله تعالى \"حتى يتبين لهم أنه الحق أو لم يكف بربك أنه على كل شيء شهيد\" أي كفى بالله شهيدا على أفعال عباده وأقوالهم وهو يشهد أن محمدا صلى الله عليه وسلم صادق فيما أخبر به عنه كما قال \"لكن الله يشهد بما أنزل إليك أنزله بعلمه\" الآية."
    },
    {
      "ayah": 54,
      "surah": 41,
      "text": "وقوله تعالى \"ألا إنهم في مرية من لقاء ربهم\" أي في شك من قيام الساعة ولهذا لا يتفكرون فيه ولا يعملون له ولا يحذرون منه بل هو عندهم هدر لا يعبئون به وهو كائن لا محالة وواقع لا ريب فيه قال ابن أبي الدنيا حدثنا أحمد بن إبراهيم حدثنا خلف بن تميم حدثنا عبدالله بن محمد حدثنا سعيد الأنصاري قال: إن عمر بن عبدالعزيز رضي الله عنه صعد المنبر فحمد الله وأثنى عليه ثم قال: أما بعد أيها الناس فإني لم أجمعكم لأمر أحدثه فيكم ولكن فكرت في هذا الأمر الذي أنتم إليه صائرون فعلمت أن المصدق بهذا الأمر أحمق والمكذب به هالك ثم نزل. ومعنى قوله رضي الله عنه أن المصدق به أحمق أي لأنه لا يعمل له عمل مثله ولا يحذر منه ولا يخاف من هوله وهو مع ذلك مصدق به موقن بوقوعه وهو مع ذلك يتمادى في لعبه وغفلته وشهواته وذنوبه فهو أحمق بهذا الاعتبار والأحمق في اللغة ضعيف العقل وقوله والمكذب به هالك هذا واضح والله أعلم. ثم قال تعالى مقررا أنه على كل شيء قدير وبكل شيء محيط وإقامة الساعة لديه يسير سهل عليه تبارك وتعالى \"ألا إنه بكل شيء محيط\" أي المخلوقات كلها تحت قهره وفي قبضته وتحت طي علمه وهو المتصرف فيها كلها بحكمه فما شاء كان وما لم يشأ لم يكن لا إله إلاهو. آخر تفسير سورة حم السجدة ولله الحمد والمنة."
    },
    {
      "ayah": 6,
      "surah": 41,
      "text": "يقول تعالى قل يا محمد لهؤلاء المكذبين المشركين \"إنما أنا بشر مثلكم يوحى إلي أنما إلهكم إله واحد\" لا كما تعبدونه من الأصنام والأنداد والأرباب المتفرقين إنما الله إله واحد \"فاستقيموا إليه\" أي أخلصوا له العبادة على منوال ما أمركم به على ألسنة الرسل \"واستغفروه\" أي لسالف الذنوب \"وويل للمشركين\" أي دمار لهم وهلاك عليهم."
    },
    {
      "ayah": 7,
      "surah": 41,
      "text": "\"الذين لا يؤتون الزكاة\" قال علي بن أبي طلحة عن ابن عباس يعني الذين لا يشهدون أن لا إله إلا الله وكذا قال عكرمة وهذا كقوله تبارك وتعالى \"قد أفلح من زكاها وقد خاب من دساها\" وكقوله جلت عظمته \"قد أفلح من تزكى وذكر اسم ربه فصلى\" وقوله عز وجل \"فقل هل لك إلى أن تزكى\" والمراد بالزكاة ههنا طهارة النفس من الأخلاق الرذيلة ومن أهم ذلك طهارة النفس من الشرك وزكاة المال إنما سميت زكاة لأنها تطهره من الحرام وتكون سببا لزيادته وبركته وكثرة نفعه وتوفيقا إلى استعماله فى الطاعات. وقال السدي \"وويل للمشركين الذي لا يؤتون الزكاة\" أي لا يؤدون الزكاة وقال معاوية بن قرة ليس هم من أهل الزكاة وقال قتادة يمنعون زكاة أموالهم وهذا هو الظاهر عند كثير من المفسرين واختاره ابن جرير وفيه نظر لأن إيجاب الزكاة إنما كان في السنة الثانية من الهجرة إلى المدينة على ما ذكره غير واحد وهذه الآية مكية. اللهم إلا أن يقال لا يبعد أن يكون أصل الصدقة والزكاة كان مأمورا به في ابتداء البعثة كقوله تبارك وتعالى \"وآتوا حقه يوم حصاده\" فأما الزكاة ذات النصب والمقادير فإنما بين أمرها بالمدينة ويكون هذا جمعا بين القولين كما أن أصل الصلاة كان واجبا قبل طلوع الشمس وقبل غروبها في ابتداء البعثة فلما كان ليلة الإسراء قبل الهجرة بسنة ونصف فرض الله تعالى على رسوله صلى الله عليه وسلم الصلوات الخمس وفصل شروطها وأركانها وما يتعلق بها بعد ذلك شيئا فشيئا والله أعلم."
    },
    {
      "ayah": 8,
      "surah": 41,
      "text": "\"إن الذين آمنوا وعملوا الصالحات لهم أجر غير ممنون\" قال مجاهد وغيره غير مقطوع ولا مجبوب كقوله تعالى \"ماكثين فيها أبدا\" وكقوله عز وجل \"عطاء غير مجذوذ\" وقال السدي غير ممنون عليهم وقد رد عليه هذا التفسير بعض الأئمة فإن المنة لله تعالى على أهل الجنة قال الله تبارك وتعالى \"بل الله يمن عليكم أن هداكم للإيمان\" وقال أهل الجنة \"فمن الله علينا ووقانا عذاب السموم\" وقال رسول الله صلى الله عليه وسلم \"إلا أن يتغمدني الله برحمة منه وفضل\"."
    },
    {
      "ayah": 9,
      "surah": 41,
      "text": "هذا إنكار من الله تعالى على المشركين الذين عبدوا معه غيره وهو الخالق لكل شيء القاهر لكل شيء المقتدر على كل شيء فقال \"قل أئنكم لتكفرون بالذي خلق الأرض في يومين وتجعلون له أندادا\" أي نظراء وأمثالا تعبدونها معه \"ذلك رب العالمين\" أي الخالق للأشياء هو رب العالمين كلهم. وهذا المكان فيه تفصيل لقوله تعالى \"خلق السموات والأرض في ستة أيام\" ففصل ههنا ما يختص بالأرض مما اختص بالسماء فذكر أنه خلق الأرض أولا لأنها كالأساس والأصل أن يبدأ بالأساس ثم بعده بالسقف كما قال عز وجل \"هو الذي خلق لكم ما في الأرض جميعا ثم استوى إلى السماء فسواهن سبع سموات\" الآية فأما قوله تعالى \"أأنتم أشد خلقا أم السماء بناها رفع سمكها فسواها وأغطش ليلها وأخرج ضحاها والأرض بعد ذلك دحاها أخرج منها ماءها ومرعاها والجبال أرساها متاعا لكم ولأنعامكم\" ففي هذه الآية أن دحو الأرض كان بعد خلق السماء فالدحو هو مفسر بقوله \"أخرج منها ماءها ومرعاها\" وكان هذا بعد خلق السماء فأما خلق الأرض فقبل خلق السماء بالنص وبهذا أجاب ابن عباس رضي الله تعالى عنه فيما ذكره البخاري عند تفسير هذه الآية من صحيحه فإنه قال: وقال المنهال عن سعيد بن جبير قال: قال رجل لابن عباس رضي الله عنهما إني لأجد في القرآن أشياء تختلف عليّ قال \"فلا أنساب بينهم يومئذ ولا يتساءلون\" \"وأقبل بعضهم على بعض يتساءلون\" \"ولا يكتمون الله حديثا\" \"والله ربنا ما كنا مشركين\" فقد كتموا في هذه الآية. وقال تعالى \"أأنتم أشد خلقا أم السماء بناها - إلى قوله - والأرض بعد ذلك دحاها\" فذكر خلق السماء قبل الأرض ثم قال تعالى \"قل أئنكم لتكفرون بالذي خلق الأرض في يومين - إلى قوله - طائعين\" فذكر في هذه خلق الأرض قبل خلق السماء قال \"وكان الله غفورا رحيما\" \"عزيزا حكيما\" \"سميعا بصيرا\" فكأنه كان ثم مضى؟ قال ابن عباس رضي الله عنهما \"فلا أنساب بينهم يومئذ ولا يتساءلون\" في النفخة الأولى ثم \"نفخ في الصور فصعق من في السماوات ومن في الأرض إلا من شاء الله \"فلا أنساب بينهم عند ذلك ولا يتساءلون بينهم في النفخة الأخرى \"وأقبل بعضهم على بعض يتساءلون\" وأما قوله \"والله ربنا ما كنا مشركين\" \"ولا يكتمون الله حديثا\" فإن الله تعالى يغفر لأهل الإخلاص ذنوبهم فيقول المشركون تعالوا نقول لم نكن مشركين فيختم على أفواههم فتنطق أيديهم فعند ذلك يعرف أن الله تعالى لا يكتم حديثا وعنده \"يود الذين كفروا\" الآية وخلق الأرض في يومين ثم خلق السماء ثم استوى إلى السماء فسواهن في يومين آخرين ثم دحى الأرض ودحيهـا أن أخرج منها الماء والمرعى وخلق الجبال والرمال والجماد والآكام وما بينهما في يومين آخرين فذلك قوله تعالى دحاها وقوله \"خلق الأرض في يومين\" فخلق الأرض وما فيها من شيء في أربعة أيام وخلق السماوات في يومين \"وكان الله غفورا رحيما\" سمى نفسه بذلك وذلك قوله أي لم يزل كذلك فإن الله تعالى لم يرد شيئا إلا أصاب به الذي أراد فلا يختلفن عليك القرآن فإن كلا من عند الله عز وجل قال البخاري حدثنيه يوسف بن عدي حدثنا عبيدالله بن عمرو عن زيد بن أبي أنيسة عن المنهال - هو ابن عمرو- الحديث. وقوله \"خلق الأرض فى يومين\" يعني يوم الأحد ويوم الإثنين."
    }
  ]
}
