{
  "ayahs": [
    {
      "ayah": 1,
      "surah": 42,
      "text": "قد تقدم الكلام على الحروف المقطعة وقد روى ابن جرير ههنا أثرا غريبا عجيبا منكرا فقال أخبرنا أحمد بن زهير حدثنا عبدالوهاب بن نجدة الحوطي حدثنا أبو المغيرة عبدالقدوس بن الحجاج عن أرطاة بن المنذر قال: جاء رجل إلى ابن عباس رضي الله عنهما قال له وعنده حذيفة بن اليمان رضي الله تعالى عنه أخبرني عن تفسير قول الله تعالى \"حم عسق\" قال فأطرق ثم أعرض عنه ثم كرر مقالته فأعـرض عنه فلم يجبه بشيء وكره مقالته ثم كررها الثالثة فلم يحر إليه شيئا فقال له حذيفة رضي الله عنه أنا أنبئك بها قد عرفت لم كرهها نزلت في رجل من أهل بيته يقال له عبدالإله وعبدالله ينزل على نهر من أنهار المشرق تبنى عليه مدينتان يشق النهر بينهما شقا فإذا أذن الله تبارك وتعالى في زوال ملكهم وانقطاع دولتهم ومدتهم بعث الله عز وجل على إحداهما نارا ليلا فتصبح سوداء مظلمة وقد احترقت كأنها لم تكن مكانها وتصبح صاحبتها متعجبة كيف أفلتت؟ فما هو إلا بياض يومها ذلك حتى يجتمع فيها كل جبار عنيد منهم ثم يخسف الله بها وبهم جميعا فذلك قوله تعالى \"حم عسق\" يعني عزيمة من الله تعالى وفتنة وقضاء حم عين يعني عدلا منه سين يعني سيكون ق يعني واقع بهاتين المدينتين وأغرب منه ما رواه الحافظ أبو يعلى الموصلي في الجزء الثاني من مسند ابن عباس رضي الله عنه عن أبي ذر رضي الله عنه عن النبي صلى الله عليه وسلم في ذلك ولكن إسناده ضعيف جدا ومنقطع فإنه قال حدثنا أبو طالب عبدالجبار بن عاصم حدثنا أبو عبدالله الحسن بن يحيى الخشني الدمشقي عن أبي معاوية قال: صعد عمر بن الخطاب رضي الله عنه المنبر فقال: أيها الناس هل سمع منكـم أحد رسول الله صلى الله عليه وسلم يفسر \"حم عسق\" فوثب ابن عباس رضي الله عنه فقال أنا قال حم اسم من أسماء الله تعالى قال فعين؟ قال عاين المولون عذاب يوم بدر قال فسين؟ قال سيعلم الذين ظلموا أي منقلب ينقلبون قال فقاف؟ فسكت فقام أبو ذر ففسر كما قال ابن عباس رضي الله عنهما وقال قاف قارعة من السماء تغشى الناس."
    },
    {
      "ayah": 10,
      "surah": 42,
      "text": "أي مهما اختلفتم فيه من الأمور وهذا عام في جميع الأشياء \"فحكمه إلى الله\" أي هو الحاكم فيه بكتابه وسنة نبيه صلى الله عليه وسلم كقوله جل وعلا \"فإن تنازعتم في شيء فردوه إلى الله والرسول\" \"ذلكم الله ربي\" أي الحاكم في كل شيء \"عليه توكلت وإليه أنيب\" أي أرجع في جميع الأمور."
    },
    {
      "ayah": 11,
      "surah": 42,
      "text": "وقوله جل جلاله \"فاطر السموات والأرض\" أي خالقهما وما بينهما \"جعل لكم من أنفسكم أزواجا\" أي من جنسكم وشكلكم منة عليكم وتفضلا جعل من جنسكم ذكرا وأنثى \"ومن الأنعام أزواجا\" أي وخلق لكم من الأنعام ثمانية أزواج وقوله تبارك وتعالى \"يذرؤكم فيه\" أي يخلقكم فيه أي في ذلك الخلق على هذه الصفة لا يزال يذرؤكم فيه ذكورا وإناثا خلقا من بعد خلق وجيلا بعد جيل ونسلا بعد نسل من الناس والأنعام وقال البغوي يذرؤكم فيه أي في الرحم وقيل في البطن وقيل في هذا الوجه من الخلقة. قال مجاهد نسلا بعد نسل من الناس والأنعام وقيل في بمعنى الباء أي يذرؤكم به \"ليس كمثله شيء\" أي ليس كخالق الأزواج كلها شيء لأنه الفرد الصمد الذي لا نظير له \"وهو السميع البصير\"."
    },
    {
      "ayah": 12,
      "surah": 42,
      "text": "وقوله عز وجل \"له مقاليد السماوات والأرض\" قال مجاهد: المقاليد هي المفاتيح بالفارسية وكذا قال قتادة وابن زيد وسفيان بن عيينة وقال السدي \"له مقاليد السماوات والأرض\" أي خزائن السماوات والأرض والمعنى على كلا القولين أن أزمة الأمور بيده تبارك وتعالى له الملك وله الحمد وهو على كل شيء قدير. وحاصل ذلك أنه المتصرف الحاكم فيهما \"يبسط الرزق لمن يشاء ويقدر\" أي يوسع على من يشاء ويضيق على من يشاء وله الحكمة والعدل التام \"إنه بكل شيء عليم\"."
    },
    {
      "ayah": 13,
      "surah": 42,
      "text": "يقول تعالى لهذه الأمة \"شرع لكم من الدين ما وصى به نوحا والذي أوحينا إليك\" فذكر أول الرسل بعد آدم عليه السلام وهو نوح عليه السلام وآخرهم وهو محمد صلى الله عليه وسلم ثم ذكر من بين ذلك من أولي العزم وهو إبراهيم وموسى وعيسى ابن مريم وهذه الآية انتظمت ذكر الخمسة كما اشتملت آية الأحزاب عليهم في قوله تبارك وتعالى \"وإذ أخذنا من النبيين ميثاقهم ومنك ومن نوح وإبراهيم وموسى وعيسى ابن مريم\" الآية والدين الذي جاءت به الرسل كلهم هو عبادة الله وحده لا شريك له كما قال عز وجل \"وما أرسلنا من قبلك من رسول إلا نوحي إليه أنه لا إله إلا أنا فاعبدون\". وفي الحديث \"نحن معشر الأنبياء أولاد علات ديننا واحد\" أي القدر المشترك بينهم هو عبادة الله وحده لا شريك له وإن اختلفت شرائعهم ومناهجهم كقوله جل جلاله \"لكل جعلنا منكم شرعة ومنهاجا\" ولهذا قال تعالى ههنا \"أن أقيموا الدين ولا تتفرقوا فيه\" أي أوصى الله تعالى جميع الأنبياء عليهم الصلاة والسلام بالائتلاف والجماعة ونهاهم عن الافتراق والاختلاف. وقوله عز وجل \"كبر على المشركين ما تدعوهم إليه\" أي شق عليهم وأنكروا ما تدعوهم إليه يا محمد من التوحيد. ثم قال جل جلاله \"الله يجتبي إليه من يشاء ويهدي إليه من ينيب\" أي هو الذي يقدر الهداية لمن يستحقها ويكتب الضلالة على من آثرها على طريق الرشد."
    },
    {
      "ayah": 14,
      "surah": 42,
      "text": "قال تبارك وتعالى \"وما اختلفوا إلا من بعد ما جاءهم العلم\" أي إنما كان مخالفتهم للحق بعد بلوغه إليهم وقيام الحجة عليهم وما حملهم على ذلك إلا البغي والعناد والمشاقة ثم قال عز وجل \"ولولا كلمة سبقت من ربك إلى أجل مسمى\" أي لولا الكلمة السابقة من الله تعالى بإنظار العباد بإقامة حسابهم إلى يوم المعاد لعجل عليهم العقوبة في الدنيا سريعا. وقوله جلت عظمته \"وإن الذين أورثوا الكتاب من بعدهم\" يعني الجيل المتأخر بعد القرن الأول المكذب للحق \"لفي شك منه مريب\" أي ليسوا على يقين من أمرهم وإيمانهم وإنما هم مقلدون لآبائهم وأسلافهم بلا دليل ولا برهان وهم في حيرة من أمرهم وشك مريب وشقاق بعيد."
    },
    {
      "ayah": 15,
      "surah": 42,
      "text": "اشتملت هذه الآية الكريمة على عشر كلمات مستقلات كل منها منفصلة عن التي قبلها حكم برأسها قالوا ولا نظير لها سوى آية الكرسي فإنها أيضا عشر فصول كهذه. وقوله \"فلذلك فادع\" أي فللذي أوحينا إليك من الدين الذي وصينا به جميع المرسلين قبلك أصحاب الشرائع الكبار المتبعة كأولي العزم وغيرهم فادع الناس إليه. وقوله عز وجل \"واستقم كما أمرت\" أي واستقم أنت ومن اتبعك على عبادة الله تعالى كما أمركم الله عز وجل وقوله تعالى \"ولا تتبع أهواءهم\" يعني المشركين فيما اختلفوا فيه وكذبوه وافتروه من عبادة الأوثان. وقوله جل وعلا \"وقل آمنت بما أنزل الله من كتاب\" أي صدقت بجميع الكتب المنزلة من السماء على الأنبياء لا نفرق بين أحد منهم. وقوله \"وأمرت لأعدل بينكم\" أي في الحكم كما أمرني الله وقوله جلت عظمته \"الله ربنا وربكم\" أي هو المعبود لا إله غيره فنحن نقر بذلك اختيارا وأنتم وإن لم تفعلوه اختيارا فله يسجد من في العالمين طوعا وإجبارا. وقوله تبارك وتعالى \"لنا أعمالنا ولكم أعمالكم\" أي نحن برآء منكم كما قال سبحانه وتعالى \"وإن كذبوك فقل لي عملي ولكم عملكم أنتم بريئون مما أعمل وأنا بريء مما تعملون\" وقوله تعالى \"لا حجة بيننا وبينكم\" قال مجاهد أي لا خصومة قال السدي وذلك قبل نزول آية السيف وهذا متجه لأن هذه الآية مكية وآية السيف بعد الهجرة. وقوله عز وجل \"الله يجمع بيننا\" أي يوم القيامة كقوله \"قل يجمع بيننا ربنا ثم يفتح بيننا بالحق وهو الفتاح العليم\" وقوله جل وعلا \"وإليه المصير\" أي المرجع والمآب يوم الحساب."
    },
    {
      "ayah": 16,
      "surah": 42,
      "text": "يقول تعالى متوعدا الذين يصدون عن سبيل الله من آمن به \"والذين يحاجون في الله من بعدما استجيب له\" أي يجادلون المؤمنين المستجيبين لله ولرسوله ليصدوهم عما سلكوه من طريق الهدى \"حجتهم داحضة عند ربهم\" أي باطلة عند الله \"وعليهم غضب\" أي منه \"ولهم عذاب شديد\" أي يوم القيامة قال ابن عباس رضي الله عنه ومجاهد جادلوا المؤمنين بعدما استجابوا لله ولرسوله ليصدوهم عن الهدى وطمعوا أن تعود الجاهلية وقال قتادة هم اليهود والنصارى قالوا لهم ديننا خير من دينكم ونبينا قبل نبيكم ونحن خير منكم وأولى بالله منكم وقد كذبوا في ذلك."
    },
    {
      "ayah": 17,
      "surah": 42,
      "text": "يعني الكتب المنزلة من عنده على أنبيائه \"والميزان\" وهو العدل والإنصاف قاله مجاهد وقتادة وهذه كقوله تعالى \"لقد أرسلنا رسلنا بالبينات وأنزلنا معهم الكتاب والميزان ليقوم الناس بالقسط\" وقوله \"والسماء رفعها ووضع الميزان ألا تطغوا في الميزان وأقيموا الوزن بالقسط ولا تخسروا الميزان\". وقوله تبارك وتعالى \"وما يدريك لعل الساعة قريب\" فيه ترغيب فيها وترهيب منها وتزهيد في الدنيا."
    },
    {
      "ayah": 18,
      "surah": 42,
      "text": "أي يقولون متى هذا الوعد إن كنتم صادقين وإنما يقولون ذلك تكذيبا واستبعادا وكفرا وعنادا \"والذين آمنوا مشفقون منها\" أي خائفون وجلون من وقوعها \"ويعلمون أنها الحق\" أي كائنة لا محالة فهم مستعدون لها عاملون من أجلها. وقد روي من طرق تبلغ درجة التواتر في الصحاح والحسان والسنن والمسانيد وفي بعض ألفاظه أن رجلا سأل رسول الله صلى الله عليه وسلم بصوت جهوري وهو في بعض أسفاره فناداه فقال يا محمد فقال له رسول الله صلى الله عليه وسلم نحوا من صوته \"هاؤم\" فقال له متى الساعة؟ فقال رسول الله صلى الله عليه وسلم \"ويحك إنها كائنة فما أعددت لها؟ \" فقال حب الله ورسوله فقال صلى الله عليه وسلم \"أنت مع من أحببت\" فقوله في الحديث \"المرء مع من أحب\" هذا متواتر لا محالة والغرض أنه لم يجبه عن وقت الساعة بل أمره بالاستعداد لها. وقوله تعالى \"ألا إن الذين يمارون في الساعة\" أي يجادلون في وجودها ويدفعون وقوعها \"لفي ضلال بعيد\" أي في جهل بين لأن الذي خلق السموات والأرض قادر على إحياء الموتى بطريق الأولى والأحرى كما قال تعالى \"وهو الذي يبدأ الخلق ثم يعيده وهو أهون عليه\"."
    },
    {
      "ayah": 19,
      "surah": 42,
      "text": "يقول تعالى مخبرا عن لطفه بخلقه في رزقه إياهم عن آخرهم لا ينسى أحدا منهم سواء في رزقه البر والفاجر كقوله عز وجل \"وما من دابة في الأرض إلا على الله رزقها ويعلم مستقرها ومستودعها كل في كتاب مبين\" ولها نظائر كثيرة وقوله جل وعلا \"يرزق من يشاء\" أي يوسع على من يشاء \"وهو القوي العزيز\" أي لا يعجزه شيء."
    },
    {
      "ayah": 2,
      "surah": 42,
      "text": "قد تقدم الكلام على الحروف المقطعة وقد روى ابن جرير ههنا أثرا غريبا عجيبا منكرا فقال أخبرنا أحمد بن زهير حدثنا عبدالوهاب بن نجدة الحوطي حدثنا أبو المغيرة عبدالقدوس بن الحجاج عن أرطاة بن المنذر قال: جاء رجل إلى ابن عباس رضي الله عنهما قال له وعنده حذيفة بن اليمان رضي الله تعالى عنه أخبرني عن تفسير قول الله تعالى \"حم عسق\" قال فأطرق ثم أعرض عنه ثم كرر مقالته فأعـرض عنه فلم يجبه بشيء وكره مقالته ثم كررها الثالثة فلم يحر إليه شيئا فقال له حذيفة رضي الله عنه أنا أنبئك بها قد عرفت لم كرهها نزلت في رجل من أهل بيته يقال له عبدالإله وعبدالله ينزل على نهر من أنهار المشرق تبنى عليه مدينتان يشق النهر بينهما شقا فإذا أذن الله تبارك وتعالى في زوال ملكهم وانقطاع دولتهم ومدتهم بعث الله عز وجل على إحداهما نارا ليلا فتصبح سوداء مظلمة وقد احترقت كأنها لم تكن مكانها وتصبح صاحبتها متعجبة كيف أفلتت؟ فما هو إلا بياض يومها ذلك حتى يجتمع فيها كل جبار عنيد منهم ثم يخسف الله بها وبهم جميعا فذلك قوله تعالى \"حم عسق\" يعني عزيمة من الله تعالى وفتنة وقضاء حم عين يعني عدلا منه سين يعني سيكون ق يعني واقع بهاتين المدينتين وأغرب منه ما رواه الحافظ أبو يعلى الموصلي في الجزء الثاني من مسند ابن عباس رضي الله عنه عن أبي ذر رضي الله عنه عن النبي صلى الله عليه وسلم في ذلك ولكن إسناده ضعيف جدا ومنقطع فإنه قال حدثنا أبو طالب عبدالجبار بن عاصم حدثنا أبو عبدالله الحسن بن يحيى الخشني الدمشقي عن أبي معاوية قال: صعد عمر بن الخطاب رضي الله عنه المنبر فقال: أيها الناس هل سمع منكـم أحد رسول الله صلى الله عليه وسلم يفسر \"حم عسق\" فوثب ابن عباس رضي الله عنه فقال أنا قال حم اسم من أسماء الله تعالى قال فعين؟ قال عاين المولون عذاب يوم بدر قال فسين؟ قال سيعلم الذين ظلموا أي منقلب ينقلبون قال فقاف؟ فسكت فقام أبو ذر ففسر كما قال ابن عباس رضي الله عنهما وقال قاف قارعة من السماء تغشى الناس."
    },
    {
      "ayah": 20,
      "surah": 42,
      "text": "قال عز وجل \"من كان يريد حرث الآخرة\" أي عمل الآخرة \"نزد له في حرثه\" أي نقويه ونعينه على ما هو بصدده ونكثر نماءه ونجزيه بالحسنة عشر أمثالها إلى سبعمائه ضعف إلى ما يشاء الله \"ومن كان يريد حرث الدنيا نؤته منها وما له في الآخرة من نصيب\" أي ومن كان إنما سعيه ليحصل له شيء من الدنيا وليس له إلى الآخرة هم البتة بالكلية حرمه الله الآخرة والدنيا إن شاء أعطاه منها وإن لم يشأ لم يحصل لا هذه ولا هذه. وفاز الساعي بهذه النية بالصفقة الخاسرة في الدنيا والآخرة والدليل على هذا أن هذه الآية ههنا مقيدة بالآية التي في سبحان وهي قوله تبارك وتعالى \"من كان يريد العاجلة عجلنا له فيها ما نشاء لمن نريد ثم جعلنا له جهنم يصلاها مذموما مدحورا ومن أراد الآخرة وسعى لها سعيها وهو مؤمن فأولئك كان سعيهم مشكورا كلا نمد هؤلاء وهؤلاء من عطاء ربك وما كان عطاء ربك محظورا أنظر كيف فضلنا بعضهم على بعض وللآخرة أكبر درجات وأكبر تفضيلا\". وقال الثوري عن معمر عن أبي العالية عن أبي بن كعب رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم بشر هذه الأمة بالسناء والرفعة والنصر والتمكين في الأرض فمن عمل منهم عمل الآخرة للدنيا لم يكن له فى الآخرة من نصيب\"."
    },
    {
      "ayah": 21,
      "surah": 42,
      "text": "قوله جل وعلا \"أم لهم شركاء شرعوا لهم من الدين ما لم يأذن به الله\" أي هم لا يتبعون ما شرع الله لك من الدين القويم بل يتبعون ما شرع لهم شياطينهم من الجن والإنس من تحريم ما حرموا عليهم من البحيرة والسائبة والوصيلة والحام وتحليل أكل الميتة والدم والقمار إلى نحو ذلك من الضلالات والجهالة الباطلة التي كانوا قد اخترعوها في جاهليتهم من التحليل والتحريم والعبادات الباطلة والأموال الفاسدة. وقد ثبت في الصحيح أن رسول الله صلى الله عليه وسلم قال \"رأيت عمرو بن لحي بن قمعة يجر قصبه في النار\" لأنه أول من سيب السوائب وكان هذا الرجل أحد ملوك خزاعة وهو أول من فعل هذه الأشياء وهو الذي حمل قريشا على عبادة الأصنام لعنه الله وقبحه ولهذا قال تعالى \"ولولا كلمة الفصل لقضي بينهم\" أي لعوجلوا بالعقوبة لولا ما تقدم من الإنظار إلى يوم المعاد \"وإن الظالمين لهم عذاب أليم\" أي شديد موجع في جهنم وبئس المصير."
    },
    {
      "ayah": 22,
      "surah": 42,
      "text": "أي في عرصات القيامة \"وهو واقع بهم\" أي الذي يخافون منه واقع بهم لا محالة هذا حالهم يوم معادهم وهم في هذا الخوف والوجل \"والذين آمنوا وعملوا الصالحات في روضات الجنات لهم ما يشاءون عند ربهم\" فأين هذا من هذا؟ أي أين من هو في العرصات في الذل والهـوان والخوف المحقق عليه بظلمه ممن هو في روضات الجنات فيما يشاء من مآكل ومشارب وملابس ومساكن ومناظر ومناكـح وملاذ مما لا عين رأيت ولا أذن سمعت ولا خطر على قلب بشر. قال الحسن بن عرفة حدثنا عمرو بن عبدالرحمن الأبار حدثنا محمد بن سعد الأنصاري عن أبي طيبة قال إن الشرب من أهل الجنة لتظلهم السحابة فتقول ما أمطركم؟ قال فما يدعو داع من القوم بشيء إلا أمطرتهم حتى إن القائل منهم ليقول أمطرينا كواعب أترابا. ورواه ابن جرير عن الحسن بن عرفة به ولهذا قال تعالى \"ذلك هو الفضل الكبير\" أي الفوز العظيم والنعمة التامة السابغة الشاملة العامة."
    },
    {
      "ayah": 23,
      "surah": 42,
      "text": "يقول تعالى لما ذكر روضات الجنات لعباده الذين آمنوا وعملوا الصالحات \"ذلك الذي يبشر الله عباده الذين آمنوا وعملوا الصالحات\" أي هذا حاصل لهم كائن لا محاله ببشاره الله تعالى لهم به. وقوله عز وجل \"قل لا أسألكم عليه أجرا إلا المودة في القربى\" أي قل يا محمد لهؤلاء المشركين من كفار قريش لا أسألكم على هذا البلاغ والنصح لكم مالا تعطونيه وإنما أطلب منكم أن تكفوا شركم عني وتذروني أبلغ رسالات ربي إن لم تنصروني فلا تؤذوني بما بيني وبينكم من القرابة. قال البخاري حدثنا محمد بن بشار حدثنا محمد بن جعفر حدثنا شعبة عن عبدالملك بن ميسرة قال سمعت طاوسا يحدث عن ابن عباس رضي الله عنهما أنه سئل عن قوله تعالى \"إلا المودة في القربى\" فقال سعيد بن جبير قربى آل محمد فقال ابن عباس عجلت إن النبي صلى الله عليه وسلم لم يكن بطن من قريش إلا كان له فيهم قرابة فقال إلا أن تصلوا ما بيني وبينكم من القرابة وانفرد به البخاري ورواه الإمام أحمد عن يحيى القطان عن شعبة به وهكذا روى عامر الشعبي والضحاك وعلي بن أبي طلحة والعوفي ويوسف بن مهران وغير واحد عن ابن عباس رضي الله عنهما مثله وبه قال مجاهد وعكرمة وقتادة والسدي وأبو مالك وعبدالرحمن بن زيد بن أسلم وغيرهم. وقال الحافظ أبو القاسم الطبراني حدثنا هاشم بن القاسم بن زيد الطبراني وجعفر القلانسي قالا حدثنا آدم بن أبي إياس حدثنا شريك عن خصيف عن سعيد بن جبير عن ابن عباس رضي الله عنهما قال: قال لهم رسول الله صلى الله عليه وسلم \"لا أسألكم عليه أجرا إلا أن تودوني في نفسي لقرابتي منكم وتحفظوا القرابة بيني وبينكم\" وروى الإمام أحمد عن حسن بن موسى حدثنا قزعة يعني ابن سويد وابن أبي حاتم عن أبيه عن مسلم بن إبراهيم عن قزعة بن سويد عن ابن أبي نجيح عن مجاهد عن ابن عباس رضي الله عنهما أن النبي صلى الله عليه وسلم قال \" لا أسألكم على ما آتيتكم من البينات والهدى أجرا إلا أن توادوا الله تعالى وأن تقربوا إليه بطاعته\" وهكذا روى قتادة عن الحسن البصري مثله وهذا كأنه تفسير بقول ثان كأنه يقول إلا المودة في القربى أي إلا أن تعملوا بالطاعة التي تقربكم عند الله زلفى. وقول ثالث وهو ما حكاه البخاري وغيره رواية عن سعيد بن جبير ما معناه أنه قال معنى ذلك أن تودوني في قرابتي أي تحسنوا إليهم وتبروهم. وقال السدي عن أبي الديلم قال: لما جيء بعلي بن الحسين رضي الله عنه أسيرا فأقيم على درج دمشق قام رجل من أهل الشام فقال الحمد لله الذي قتلكم واستأصلكم وقطع قرن الفتنة فقال له علي بن الحسين رضي الله عنه أقرأت القرآن؟ قال نعم. قال أقرأت آل حم؟ قال قرأت القرآن ولم أقرأ آل حم قال ما قرأت \"قل لا أسألكم عليه أجرا إلا المودة في القربى\"؟ قال وإنكم لأنتم هم؟ قال نعم وقال أبو إسحاق السبيعي سألت عمرو بن شعيب عن قوله تبارك وتعالى \"قل لا أسألكم عليه أجرا إلا المودة في القربى\" فقال قربى النبي صلى الله عليه وسلم رواهما ابن جرير. ثم قال ابن جرير حدثنا أبو كريب حدثنا مالك بن إسماعيل حدثنا عبدالسلام حدثني يزيد بن أبي زياد عن مقسم عن ابن عباس رضي الله عنهما قال: قالت الأنصار فعلنا وفعلنا وكأنهم فخروا فقال ابن عباس أو العباس رضي الله عنهما - شك عبدالسلام - لنا الفضل عليكم فبلغ ذلك رسول الله صلى الله عليه وسلم فأتاهم في مجالسهم فقال \"يا معشر الأنصار ألم تكونوا أذلة فأعزكم الله بي؟ \" قالوا بلى يا رسول الله قال صلى الله عليه وسلم ألم تكونوا ضلالا فهداكم الله بي؟ \" قالوا بلى يا رسول الله قال \"أفلا تجيبوني\" قالوا ما نقول يا رسول الله؟ قال \"ألا تقولون ألم يخرجك قومك فآويناك أو لم يكذبوك فصدقناك أو لم يخذلوك فنصرناك\" قال فما زال صلى الله عليه وسلم يقول حتى جثوا على الركب وقالوا أموالنا في أيدينا لله ولرسوله قال فنزلت \"قل لا أسألكم عليه أجرا إلا المودة في القربى\" وهكذا رواه ابن أبي حاتم عن علي بن الحسين عن عبدالمؤمن بن علي عن عبدالسلام عن يزيد بن أبي زياد وهو ضعيف بإسناده مثله أو قريبا منه. وفي الصحيحين في قسم غنائم حنين قريب من هذا السياق ولكن ليس فيه ذكر نزول هذه الآية وذكر نزولها في المدينة فيه نظر لأن السورة مكية وليس يظهر بين هذه الآية وهذا السياق مناسبة والله أعلم. وقال ابن أبي حاتم حدثنا علي بن الحسين حدثنا رجل سماه حدثنا حسين الأشقر عن قيس عن الأعمش عن سعيد بن جبير عن ابن عباس رضي الله عنه قال: لما نزلت هذه الآية \"قل لا أسألكم عليه أجرا إلا المودة في القربى\" قالوا يا رسول الله من هؤلاء الذين أمر الله بمودتهم؟ قال \"فاطمة وولدها رضي الله عنهم\" وهذا إسناد ضعيف فيه مبهم لا يعرف عن شيخ شيعي مخترق وهو حسين الأشقر ولا يقبل خبره في هذا المحل وذكر نزول الآية في المدينة بعيد فإنها مكية ولم يكن إذ ذاك لفاطمة رضي الله عنها أولاد بالكلية فإنها لم تتزوج بعلي رضي الله عنه إلا بعد بدر من السنة الثانية من الهجرة والحق تفسير هذه الآية بما فسرها به حبر الأمة وترجمان القرآن عبدالله بن عباس رضي الله عنهما كما رواه عنه البخاري ولا ننكر الوصاة بأهل البيت والأمر بالإحسان إليهم واحترامهم وإكرامهم فإنهم من ذرية طاهرة من أشرف بيت وجد على وجه الأرض فخرا وحسبا ونسبا ولا سيما إذا كانوا متبعين للسنة النبوية الصحيحة الواضحة الجلية كما كان عليه سلفهم كالعباس وبنيه وعلي وأهل بيته وذريته رضي الله عنهم أجمعين. وقد ثبت في الصحيح أن رسول الله صلى الله عليه وسلم قال في خطبته بغدير خم \"إني تارك فيكم الثقلين كتاب الله وعترتي وإنهما لم يفترقا حتى يردا على الحوض\" وقال الإمام أحمد حدثنا يزيد بن هارون أنا إسماعيل بن أبي خالد عن يزيد بن أبي زياد عن عبدالله بن الحارث عن العباس بن عبدالمطلب رضي الله عنه قال: قلت يا رسول الله إن قريشا إذا لقي بعضهم بعضا لقوهم ببشر حسن وإذا لقونا لقونا بوجوه لا نعرفها قال فغضب النبي صلى الله عليه وسلم غضبا شديدا وقال \"والذي نفسي بيده لا يدخل قلب الرجل الإيمان حتى يحبكم لله ولرسوله\" ثم قال أحمد حدثنا جرير عن يزيد بن أبي زياد عن عبدالله بن الحارث عن عبدالمطلب بن ربيعة قال دخل العباس رضي الله عنه على رسول الله صلى الله عليه وسلم فقال إنا لنخرج فنرى قريشا تحدث فإذا رأونا سكتوا فغضب رسول الله صلى الله عليه وسلم ودر عرق بين عينيه ثم قال صلى الله عليه وسلم \"والله لا يدخل قلب امرئ مسلم إيمان حتى يحبكم لله ولقرابتي\" وقال البخاري حدثنا عبدالله بن عبد الوهاب حدثنا خالد حدثنا شعبة عن واقد قال سمعت أبي يحدث عن ابن عمر رضي الله عنهما عن أبي بكر - هو الصديق - رضي الله عنه قال ارقبوا محمدا صلى الله عليه وسلم في أهل بيته. وفي الصحيح أن الصديق رضي الله عنه قال لعلي رضي الله عنه: والله لقرابة رسول الله صلى الله عليه وسلم أحب إلي أن أصل من قرابتي وقال عمر بن الخطاب للعباس رضي الله تعالى عنهما والله لإسلامك يوم أسلمت كان أحب إلي من إسلام الخطاب لو أسلم لأن إسلامك كان أحب إلى رسول الله صلى الله عليه وسلم من إسلام الخطاب. فحال الشيخين رضي الله عنهما هو الواجب على كل أحد أن يكون كذلك ولهذا كانا أفضل المؤمنين بعد النبيين والمرسلين رضي الله عنهما وعن سائر الصحابة أجمعين وقال الإمام أحمد رحمه الله حدثنا إسماعيل بن إبراهيم عن أبي حيان التيمي حدثني يزيد بن حيان قال انطلقت أنا وحصين بن ميسرة وعمر بن مسلم إلى زيد بن أرقم رضي الله عنه فلما جلسنا إليه قال حصين لقد لقيت يا زيد خيرا كثيرا: رأيت رسول الله صلى الله عليه وسلم وسمعت حديثه وغزوت معه وصليت معه لقد رأيت يا زيد خيرا كثيرا حدثنا يا زيد ما سمعت من رسول الله صلى الله عليه وسلم فقال: يا ابن أخي لقد كبر سني وقدم عهدي ونسيت بعض الذي كنت أعي من رسول الله صلى الله عليه وسلم فما حدثتكم فاقبلوه وما لا فلا تكلفونيه ثم قال رضي الله عنه: قام رسول الله صلى الله عليه وسلم يوما خطيبا فينا بماء يدعى خما بين مكة والمدينة فحمد الله تعالى وأثنى عليه وذكر ووعظ ثم قال صلى الله عليه وسلم \"أما بعد أيها الناس إنما أنا بشر يوشك أن يأتيني رسول ربي فأجيب وإني تارك فيكم الثقلين أولهما كتاب الله تعالى فيه الهدى والنور فخذوا بكتاب الله واستمسكوا به\" فحث على كتاب الله ورغب فيه وقال صلى الله عليه وسلم \"وأهل بيتي أذكركم الله في أهل بيتي أذكركم الله في أهل بيتي\" فقال له حصين ومن أهل بيته يا زيد؟ أليس نساؤه من أهل بيته؟ قال إن نساءه لسن من أهل بيته ولكن أهل بيته من حرم عليه الصدقة بعده قال ومن هم؟ قال هم آل علي وآل عقيل وآل جعفر وآل العباس رضي الله عنهم قال أكل هؤلاء حرم عليه الصدقة؟ قال نعم. وهكذا رواه مسلم والنسائي من طرق يزيد بن حبان به وقال أبو عيسى الترمذي حدثنا علي بن المنذر الكوفي حدثنا محمد بن فضيل حدثنا الأعمش عن عطية عن أبي سعيد والأعمش عن حبيب بن أبي ثابت عن زيد بن أرقم رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم \"إني تارك فيكم ما إن تمسكتم به لن تضلوا بعدي أحدهما أعظم من الآخر: كتاب الله حبل ممدود من السماء إلى الأرض والآخر عترتي أهل بيتي ولن يفترقا حتى يردا علي الحوض فانظروا كيف تخلفوني فيهما\" تفرد بروايته ثم قال هذا حديث حسن غريب وقال الترمذي أيضا حدثنا نصر بن عبدالرحمن الكوفي حدثنا زيد بن الحسـن عن جعفر بن محمد بن الحسن عن أبيه عن جابر بن عبدالله رضي الله عنهما قال: رأيت رسول الله صلى الله عليه وسلم في حجته يوم عرفة وهو على ناقته القصواء يخطب فسمعته يقول \"يا أيها الناس إني تركت فيكم ما إن اخذتم به لن تضلوا كتاب الله وعترتي أهل بيتي \" تفرد به الترمذي أيضا وقال حسن غريب. وفي الباب عن أبي ذر وأبي سعيد وزيد بن أرقم وحذيفة بن أسيد رضي الله عنهم. ثم قال الترمذي أيضا ثنا أبو داود سليمان الأشعث حدثنا يحيى بن معين حدثنا هشام بن يوسف عن عبدالله بن سليمان النوفلي عن محمد بن علي بن عبدالله بن عباس عن أبيه عن جده عبدالله بن عباس رضي الله عنهم قال: قال رسول الله صلى الله عليه وسلم \"أحبوا الله تعالى لما يغذوكم من نعمه وأحبوني بحب الله وأحبوا أهل بيتي بحبي\" ثم قال حسن غريب إنما نعرفه من هذا الوجه وقد أوردنا أحاديث أخر عند قوله تعالى \"إنما يريد الله ليذهب عنكم الرجس أهل البيت ويطهركم تطهيرا\" بما أغنى عن إعادتها ههنا ولله الحمد والمنة. وقال الحافظ أبو يعلى حدثنا سويد بن سعيد حدثنا مفضل بن عبدالله عن أبي إسحاق عن حنش قال سمعت أبا ذر رضي الله عنه وهو آخذ بحلقة الباب يقول: يا أيها الناس من عرفني فقد عرفني ومن أنكرني فأنا أبو ذر سمعت رسول الله صلى الله عليه وسلم يقول \"إنما مثل أهل بيتي فيكم كمثل سفينة نوح عليه الصلاة والسلام من دخلها نجا. ومن تخلف عنها هلك\" هذا بهذا الإسناد ضعيف. وقوله عز وجل \"ومن يقترف حسنة نزد له فيها حسنا\" أي ومن يعمل حسنة نزد له فيها حسنا أي أجرا وثوابا كقوله تعالى \"إن الله لا يظلم مثقال ذرة وإن تك حسنة يضاعفها ويؤت من لدنه أجرا عظيما\" وقال بعض السلف إن من ثواب الحسنة الحسنة بعدها ومن جزاء السيئة بعدها وقوله تعالى \"إن الله غفور شكور\" أي يغفر الكثير من السيئات ويكثر القليل من الحسنات فيستر ويغفر ويضاعف فيشكر."
    },
    {
      "ayah": 24,
      "surah": 42,
      "text": "أي لو افتريت عليه كذبا كما يزعم هؤلاء الجاهلون \"يختم على قلبك\" أي يطبع على قلبك وسلبك ما كان آتاك من القرآن كقوله جل جلاله \"ولو تقول علينا بعض الأقاويل لأخذنا منه باليمين ثم لقطعنا منه الوتين فما منكم من أحد عنه حاجزين\" أي لانتقمنا منه أشد الانتقام وما قدر أحد من الناس أن يحجز عنه. وقوله جلت عظمته \"ويمح الله الباطل\" ليس معطوفا على قوله \"يختم\" فيكون مجزوما بل هو مرفوع على الابتداء. قاله ابن جرير قال وحذفت من كتابته الواو في رسم مصحف الإمام كما حذفت في قوله \"سندع الزبانية\" وقوله تعالى \"ويدع الإنسان بالشر دعاءه بالخير\". وقوله عز وجل \"ويحق الحق بكلماته\" معطوف على \"ويمح الله الباطل ويحق الحق\" أي يحققه ويثبته ويبينه ويوضحه بكلماته أي بحججه وبراهينه \"إنه عليم بذات الصدور\" أي بما تكنه الضمائر وتنطوي عليه السرائر."
    },
    {
      "ayah": 25,
      "surah": 42,
      "text": "يقول تعالى ممتنا على عباده بقبول توبتهم إليه إذا تابوا ورجعوا إليه إنه من كرمه وحلمه أنه يعفو ويصفح ويستر ويغفر كقوله عز وجل \"ومن يعمل سوءا أو يظلم نفسه ثم يستغفر الله يجد الله غفورا رحيما\" وقد ثبت في صحيح مسلم رحمة الله عليه حيث قال حدثنا محمد بن الصباح وزهير بن حرب قالا: حدثنا عمر بن يونس حدثنا عكرمة بن عمار حدثنا إسحاق بن أبي طلحة حدثني أنس بن مالك وهو عمه رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم \"لله تعالى أشد فرحا بتوبة عبده حين يتوب إليه من أحدكم كانت راحلته بأرض فلاة فانفلتت منه وعليها طعامه وشرابه فأيس منها فأتى شجرة فاضطجع في ظلها قد أيس من راحلته فبينما هو كذلك إذا هو بها قائمة عنده فأخذ بخطامها ثم قال من شدة الفرح اللهم أنت عبدي وأنا ربك - أخطأ من شدة الفرح -\" وقد ثبت أيضا في الصحيح من رواية عبدالله بن مسعود رضي الله عنه نحوه وقال عبدالرزاق عن معمر عن الزهري في قوله تعالى \"وهو الذي يقبل التوبة عن عباده\" إن أبا هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم \"لله أشد فرحا بتوبة عبده من أحدكم يجد ضالته في المكان الذي يخاف أن يقتله فيه العطش\" وقال همام بن الحارث سئل ابن مسعود رضي الله عنه عن الرجل يفجر بالمرأة ثم يتزوجها؟ قال لا بأس به وقرأ \"وهو الذي يقبل التوبة عن عباده\" الآية. رواه ابن جرير وابن أبي حاتم من حديث شريح القاضي عن إبراهيم بن مهاجر عن إبراهيم النخعي عن همام فذكره وقوله عز وجل \"ويعفو عن السيئات\" أي يقبل التوبة في المستقبل ويعفو عن السيئات في الماضي \"ويعلم ما تفعلون\" أي هو عالم بجميع ما فعلتم وصنعتم وقلتم ومع هذا يتوب على من تاب إليه."
    },
    {
      "ayah": 26,
      "surah": 42,
      "text": "قال السدي يعني يستجيب لهم وكذا قال ابن جرير معناه يستجيب لهم الدعاء لأنفسهم ولأصحابهم وإخوانهم وحكاه عن بعض النحاة وأنه جعلها كقوله عز وجل \"فاستجاب لهم ربهم\" ثم روى هو وابن أبي حاتم من حديث الأعمش عن شقيق بن سلمة عن سلمة بن سبرة قال خطبنا معاذ رضي الله عنه بالشام فقال أنتم المؤمنون وأنتم أهل الجنة والله إني لأرجو أن يدخل الله تعالى من تسبون من فارس والروم الجنة وذلك بأن أحدكم إذا عمل له يعني أحدهم عملا قال أحسنت رحمك الله أحسنت بارك الله فيك ثم قرأ \"ويستجيب الذين آمنوا وعملوا الصالحات ويزيدهم من فضله\". وحكى ابن جرير من بعض أهل العربية أنه جعل قوله \"الذين يستمعون القول\" أي هم الذين يستجيبون للحق ويتبعونه كقوله تبارك وتعالى \"إنما يستجيب الذين يسمعون والموتى يبعثهم الله\" والمعنى الأول أظهر لقوله تعالى \"ويزيدهم من فضله\" أي يسـتجيب دعاءهم ويزيدهم فوق ذلك. ولهذا قال ابن أبي حاتم حدثنا علي بن الحسين حدثنا محمد بن المصفى حدثنا بقية حدثنا إسماعيل بن عبدالله الكندي حدثنا الأعمش عن شقيق عن عبدالله رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم في قوله تعالى \"ويزيدهم من فضله\" قال \"الشفاعة لمن وجبت له النار ممن صنع إليهم معروفا في الدنيا\" وقال قتادة عن إبراهيم النخعي في قوله عز وجل \"ويستجيب الذين آمنوا وعملوا الصالحات\" قال يشفعون في إخوانهم \"ويزيدهم من فضله\" قال يشفعون في إخوان إخوانهم. وقوله عز وجل \"والكافرون لهم عذاب شديد\" لما ذكر المؤمنين وما لهم من الثواب الجزيل ذكر الكافرين وما لهم عنده يوم القيامة من العذاب الشديد الموجع المؤلم يوم معادهم وحسابهم."
    },
    {
      "ayah": 27,
      "surah": 42,
      "text": "أي لو أعطاهم فوق حاجتهم من الرزق لحملهم ذلك على البغي والطغيان من بعضهم على بعض أشرا وبطرا وقال قتادة كان يقال خير العيش ما لا يلهيك ولا يطغيك وذكر قتادة حديث \"إنما أخاف عليكم ما يخرج الله تعالى من زهرة الحياة الدنيا\" وسؤال السائل أيأتي الخير بالشر؟ الحديث. وقوله عـز وجل \"ولكن ينزل بقدر ما يشاء إنه بعباده خبير بصير\" أي ولكن يرزقهم من الرزق ما يختاره مما فيه صلاحهم وهو أعلم بذلك فيغني من يستحق الغنى ويفقر من يستحق الفقر كما جاء في الحديث المروي \"إن من عبادي من لا يصلحه إلا الغنى ولو أفقرته لأفسدت عليه دينه وإن من عبادي من لا يصلحه إلا الفقر ولو أغنيته لأفسدت عليه دينه\"."
    },
    {
      "ayah": 28,
      "surah": 42,
      "text": "أي من بعد إياس الناس من نزول المطر ينزله عليهم في وقت حاجتهم وفقرهم إليه كقوله عز وجل \"وإن كانوا من قبل أن ينزل عليهم من قبله لمبلسين\" وقوله جل جلاله \"وينشر رحمته\" أي يعم بها الوجود على أهل ذلك القطر وتلك الناحية قال قتادة ذكر لنا أن رجلا قال لعمر بن الخطاب رضي الله عنه يا أمير المؤمنين قحط المطر وقنط الناس فقال عمر رضي الله عنه مطرتم ثم قرأ \"وهو الذي ينزل الغيث من بعد ما قنطوا وينشر رحمته وهو الولي الحميد\" أي هو المتصرف لخلقه بما ينفعهم في دنياهم وأخراهم وهو المحمود العاقبة في جميع ما يقدره ويفعله."
    },
    {
      "ayah": 29,
      "surah": 42,
      "text": "يقول تعالى \"ومن آياته\" الدالة على عظمته وقدرته العظيمة وسلطانه القاهر \"خلق السماوات والأرض وما بث فيهما\" أي ذرأ فيهما أي في السماوات والأرض \"من دابة\" وهذا يشمل الملائكة والإنس والجن وسائر الحيوانات على اختلاف أشكالهم وألوانهم ولغاتهم وطباعهم وأجناسهم وأنواعهم وقد فرقهم في أرجاء أقطار السماوات والأرض \"وهو\" مع هذا كله \"على جمعهم إذا يشاء قدير\" أي يوم القيامة يجمع الأولين والآخرين وسائر الخلائق في صعيد واحد يسمعهم الداعي وينفذهم البصر فيحكم فيهم بحكمه العدل الحق."
    },
    {
      "ayah": 3,
      "surah": 42,
      "text": "قوله عز وجل \"كذلك يوحي إليك وإلى الذين من قبلك الله العزيز الحكيم\" أي كما أنزل إليك هذا القرآن كذلك أنزل الكتب والصحف على الأنبياء قبلك. وقوله تعالى \"الله العزيز\" أي في انتقامه \"الحكيم\" في أقواله وأفعاله. قال الإمام مالك رحمه الله عن هشام بن عروة عن أبيه عن عائشة رضي الله عنها قالت إن الحارث بن هشام سأل رسول الله صلى الله عليه وسلم فقال يا رسول الله كيف يأتيك الوحي؟ فقال رسول الله صلى الله عليه وسلم \"أحيانا يأتيني مثل صلصلة الجرس وهو أشده علي فيفصم عني وقد وعيت ما قال وأحيانا يأتيني الملك رجلا فيكلمني فأعي ما يقول\" قالت عائشة رضي الله عنها فلقد رأيته ينزل عليه الوحي في اليوم الشديد البرد فيفصم عنه وإن جبينه صلى الله عليه وسلم ليتفصد عرقا. أخرجاه في الصحيحين ولفظه للبخاري. وقد رواه الطبراني عن عبدالله بن الإمام أحمد عن أبيه عن عامر بن صالح عن هشام بن عروة عن أبيه عن عائشة رضي الله عنها عن الحارث بن هشام أنه سأل رسول الله صلى الله عليه وسلم كيف ينزل عليك الوحي؟ فقال صلى الله عليه وسلم \"في مثل صلصلة الجرس فيفصم عني وقد وعيت ما قال - وقال - وهو أشده علي قال وأحيانا يأتيني الملك فيتمثل لي فيكلمني فأعي ما يقول\". وقال الإمام أحمد حدثنا قتيبة حدثنا ابن لهيعة عن يزيد بن أبي حبيب عن عمرو بن الوليد عن عبدالله بن عمرو رضي الله عنهما قال: سألت رسول الله صلى الله عليه وسلم فقلت يا رسول الله هل تحس بالوحي؟ فقال رسول الله صلى الله عليه وسلم \"أسمع صلاصل ثم أسكت عند ذلك فما من مرة يوحى إلي إلا ظننت أن نفسي تقبض\" تفرد به أحمد. وقد ذكرنا كيفية إتيان الوحي إلى رسول الله صلى الله عليه وسلم في أول شرح البخاري بما أغنى عن إعادته ههنا ولله الحمد والمنة."
    },
    {
      "ayah": 30,
      "surah": 42,
      "text": "أي مهما أصابكم أيهـا الناس من المصائب فإنما هي عن سيئات تقدمت لكم \"ويعفو عن كثير\" أي من السيئات فلا يجازيكم عليها بل يعفو عنها \"ولو يؤاخذ الله الناس بما كسبوا ما ترك على ظهرها من دابة\" وفي الحديث الصحيح \"والذي نفسي بيده لا يصيب المؤمن من نصب ولا وصب ولا هم ولا حزن إلا كفر الله عنه بها من خطاياه حتى الشوكة يشاكها\" وقال ابن جرير ثنا يعقوب بن إبراهيم حدثنا ابن علية حدثنا أيوب قال: قرأت في كتاب أبي قلابة قال نزلت \"فمن يعمل مثقال ذرة خيرا يره ومن يعمل مثقال ذرة شرا يره\" وأبو بكر رضي الله عنه يأكل فأمسك وقال: يا رسول الله إني أرى ما عملت من خير وشر؟ فقال \"أرأيت ما رأيت مما تكره؟ فهو من مثاقيل ذر الشر وتدخل مثاقيل الخير حتى تعطاه يوم القيامة\" قال: قال أبو إدريس فإني أرى مصداقها في كتاب الله تعالى \"وما أصابكم من مصيبة فبما كسبت أيديكم ويعفو عن كثير\" ثم رواه من وجه آخر عن أبي قلابة عن أنس رضي الله عنه قال والأول أصح. وقال ابن أبي حاتم حدثنا أبي حدثنا محمد بن عيسى بن الطباع حدثنا مروان عن معاوية الفزاري حدثنا الأزهر بن راشد الكاهلي عن الخضر بن القواس البجلي عن أبي سخيلة عن علي رضي الله عنه قال: ألا أخبركم بأفضل آية في كتاب الله عز وجل وحدثنا به رسول الله صلى الله عليه وسلم؟ قال \"ما أصابكم من مصيبة فبما كسبت أيديكم ويعفو عن كثير\" وسأفسرها لك يا علي: ما أصابكم من مرض أو عقوبة أو بلاء في الدنيا فبما كسبت أيديكم والله تعالى أحلم من أن يثني عليه العقوبة فى الآخرة وما عفا الله عنه في الدنيا فالله تعالى أكرم من أن يعود بعد عفوه\" وكذا رواه الإمام أحمد عن مروان بن معاوية وعبدة عن أبي سخيلة قال: قال علي رضي الله عنه فذكر نحوه مرفوعا. ثم روى ابن أبي حاتم نحوه من وجه آخر موقوفا فقال: حدثنا أبي حدثنا منصور بن أبي مزاحم حدثنا أبو سعيد بن أبي الوضاح عن أبي الحسن عن أبي جحيفة قال دخلت على علي بن أبي طالب رضي الله عنه فقال: ألا أحدثكم بحديث ينبغي لكل مؤمن أن يعيه؟ قال فسألناه فتلا هذه الآية \"وما أصابكم من مصيبة فبما كسبت أيديكم ويعفو عن كثير\" قال ما عاقب الله تعالى به في الدنيا فالله أحلم من أن يثني عليه العقوبة يوم القيامة وما عفا الله عنه في الدنيا فالله أكرم من أن يعود في عفوه يوم القيامة وقال الإمام أحمد حدثنا يعلى بن عبيد حدثنا طلحة يعني ابن يحيى عن أبي بردة عن معاوية هو ابن أبي سفيان رضي الله عنه قال: سمعت رسول الله صلى الله عليه وسلم يقول \"ما من شيء يصيب المؤمن في جسده يؤذيه إلا كفر الله تعالى عنه به من سيئاته\" وقال الإمام أحمد أيضا حدثنا حسن عن زائدة عن ليث عن مجاهد عن عائشة رضي الله عنها قالت: قال رسول الله صلى الله عليه وسلم \"إذا كثرت ذنوب العبد ولم يكن له ما يكفرها ابتلاه الله تعالى بالحزن ليكفرها\". وقال ابن أبي حاتم حدثنا عمرو بن عبدالله الأودي حدثنا أبو أسامة عن إسماعيل بن مسلم عن الحسن هو البصري قال في قوله تبارك وتعالى \"وما أصابكم من مصيبة فبما كسبت أيديكم ويعفو عن كثير\" قال لما نزلت قال رسول الله صلى الله عليه وسلم \"والذي نفس محمد بيده ما من خدش عود ولا اختلاج عرق ولا عثرة قدم إلا بذنب وما يعفو الله عنه أكثر\". وقال أيضا حدثنا أبي حدثنا عمرو بن علي حدثنا هشيم عن منصور عن الحسن عن عمران بن حصين رضي الله عنه قال: دخل عليه بعض أصحابه وقد كان ابتلي في جسده فقال له بعضهم إنا لنبأس لك لما نرى فيك قال فلا تبتئس بما ترى فإن ما ترى بذنب وما يعفو الله عنه أكثر ثم تلا هذه الآية \"وما أصابكم من مصيبة فبما كسبت أيديكم ويعفو عن كثير\". وحدثنا أبي حدثنا يحيى بن عبدالحميد الحماني حدثنا جرير عن أبي البلاد قال: قلت للعلاء بن بدر \"وما أصابكم من مصيبة فبما كسبت أيديكم\" وقد ذهب بصري وأنا غلام؟ قال فبذنوب والديك. وحدثنا أبي حدثنا علي بن محمد الطنافسي حدثنا وكيع عن عبد العزيز بن أبي داود عن الضحاك قال ما نعلم أحدا حفظ القرآن ثم نسـيه إلا بذنب ثم قرأ الضحاك \"وما أصابكم من مصيبة فبما كسبت أيديكم ويعفو عن كثير\" ثم يقول الضحاك وأي مصيبة أعظم من نسيان القرآن."
    },
    { "ayah": 31, "surah": 42, "text": "لا يوجد تفسير لهذه الأية" },
    {
      "ayah": 32,
      "surah": 42,
      "text": "يقول تعالى ومن آياته الدالة على قدرته الباهرة وسلطانه تسخيره البحر لتجري فيه الفلك بأمره وهي الجواري في البحر كالأعلام أي كالجبال قاله مجاهد والحسن والسدي والضحاك أي هذه في البحر كالجبال في البر."
    },
    {
      "ayah": 33,
      "surah": 42,
      "text": "أي التي تسير في البحر بالسفن لو شاء لسكنها حتى لا تتحرك السفن بل تبقى راكدة لا تجيء ولا تذهب بل واقفة على ظهره أي على وجه الماء \"إن في ذلك لآيات لكل صبار\" أي في الشدائد \"شكور\" أي إن في تسخيره البحر وإجرائه في الهوى بقدر ما يحتاجون إليه لسيرهم لدلالات على نعمه تعالى على خلقه لكل صبار أي في الشدائد شكور في الرخاء."
    },
    {
      "ayah": 34,
      "surah": 42,
      "text": "أي ولو شاء لأهلك السفن وغرقها بذنوب أهلها الذين هم راكبون فيها \"ويعف عن كثير\" أي من ذنوبهم ولو آخذهم بجميع ذنوبهم لأهلك كل من ركب البحر وقال بعض علماء التفسير معنى قوله تعالى \"أو يوبقهن بما كسبوا\" أي لو شاء لأرسل الريح قوية عاتية فأخذت السفن وأحالتها عن سيرها المستقيم فصرفتها ذات اليمين أو ذات الشمال آبقة لا تسير على طريق ولا إلى جهة مقصد وهذا القول هو يتضمن هلاكها وهو مناسب للأول وهو أنه تعالى لو شاء لسكن الريح فوقفت أو لقواه فشردت وأبقت وهلكت ولكن من لطفه ورحمته أنه يرسله بحسب الحاجة كما يرسل المطر بقدر الكفاية ولو أنزله كثيرا جدا لهدم البنيان أو قليلا لما أنبت الزرع والثمار حتى إنه يرسل إلى مثل بلاد مصر سيحا من أرض أخرى غيرها لأنهم لا يحتاجون إلى مطر ولو أنزل عليهم لهدم بنيانهم وأسقط جدرانهم."
    },
    { "ayah": 35, "surah": 42, "text": "أي لا محيد لهم عن بأسنا ونقمتنا فإنهم مقهورون بقدرتنا." },
    {
      "ayah": 36,
      "surah": 42,
      "text": "يقول تعالى محقرا لشأن الحياة الدنيا وزينتها وما فيها من الزهرة والنعيم الفاني بقوله تعالى \"فما أوتيتم من شيء فمتاع الحياة الدنيا\" أي مهما حصلتم وجمعتم فلا تغتروا به فإنما هو متاع الحياة الدنيا وهي دار دنيئة فانية زائلة لا محالة \"وما عند الله خير وأبقى\" أي وثواب الله تعالى خير من الدنيا وهو باق سرمدي فلا تقدموا الفاني على الباقي ولهذا قال تعالى \"للذين آمنوا\" أي للذين صبروا على ترك الملاذ في الدنيا \"وعلى ربهم يتوكلون\" أي ليعينهم على الصبر في أداء الواجبات وترك المحرمات."
    },
    {
      "ayah": 37,
      "surah": 42,
      "text": "قال الإمام أحمد حدثنا أبو معاوية حدثنا الأعمش عن شقيق عن عبدالله قال: قال رسول الله صلى الله عليه وسلم \"لا أحد أغير من الله فلذلك حرم الفواحش ما ظهر منها وما بطن ولا أحد أحب إليه المدح من الله\" أخرجاه في الصحيحين من حديث سليمان بن مهران الأعمش عن شقيق عن أبي وائل عن عبدالله بن مسعود. \"وإذا ما غضبوا هم يغفرون\" أي سجيتهم تقتضي الصفح والعفو عن الناس ليس سجيتهم الانتقام من الناس وقد ثبت في الصحيح أن رسول الله صلى الله عليه وسلم ما انتقم لنفسه قط إلا أن تنتهك حرمات الله. وفي حديث آخر كان يقول لأحدنا عند المعتبة \"ماله تربت يمينه\" وقال ابن أبي حاتم حدثنا أبي حدثنا ابن أبي عمر حدثنا سفيان عن زائدة عن منصور عن إبراهيم قال: كان المؤمنون يكرهون أن يستذلوا وكانوا إذا قدروا عفوا."
    },
    {
      "ayah": 38,
      "surah": 42,
      "text": "أي اتبعوا رسله وأطاعوا أمره واجتنبوا زجره \"وأقاموا الصلاة\" وهي أعظم العبادات لله عز وجل \"وأمرهم شورى بينهم\" أي لا يبرمون أمرا حتى يتشاوروا فيه ليتساعدوا بآرائهم في مثل الحروب وما جرى مجراها كما قال تبارك وتعالى \"وشاورهم في الأمر\" الآية ولهذا كان صلى الله عليه وسلم يشاورهم في الحروب ونحوها ليطيب بذلك قلوبهم وهكذا لما حضرت عمر بن الخطاب رضي الله عنه الوفاة حين طعن جعل الأمر بعده شورى في ستة نفر وهم عثمان وعلي وطلحة والزبير وسعد وعبدالرحمن بن عوف رضي الله عنهم فاجتمع رأي الصحابة كلهم رضي الله عنهم على تقديم عثمان عليهم رضي الله عنهم \"ومما رزقناهم ينفقون\" وذلك بالإحسان إلى خلق الله الأقرب إليهم منهم فالأقرب."
    },
    {
      "ayah": 39,
      "surah": 42,
      "text": "أي فيهم قوة الانتصار ممن ظلمهم واعتدى عليهم ليسوا بالعاجزين ولا الأذلين بل يقدرون على الانتقام ممن بغى عليهم وإن كانوا مع هذا إذا قدروا عفوا كما قال يوسف عليه الصلاة والسلام لإخوته \"لا تثريب عليكم اليوم يغفر الله لكم\" مع قدرته على مؤاخذتهم ومقابلتهم على صنيعهم إليه وكما عفا رسول الله صلى الله عليه وسلم عن أولئك النفر الثمانين الذين قصدوه عام الحديبية ونزلوا من جبل التنعيم فلما قدر عليهم مَنَّ عليهم مع قدرته على الانتقام وكذلك عفوه صلى الله عليه وسلم عن غورث بن الحارث الذي أراد الفتك به حين اخترط سيفه وهو نائم فاستيقظ صلى الله عليه وسلم وهو في يده مصلتا فانتهره فوضعه من يده وأخذ رسول الله صلى الله عليه وسلم السيف في يده ودعا أصحابه ثم أعلمهم بما كان من أمره وأمر هذا الرجل وعفا عنه وكذلك عفا صلى الله عليه وسلم عن لبيد بن الأعصم الذي سحره عليه السلام ومع هذا لم يعرض له ولا عاتبه مع قدرته عليه وكذلك عفوه صلى الله عليه وسلم عن المرأة اليهودية - وهي زينب أخت مرحب اليهودي الخيبري الذي قتله محمود بن سلمة - التي سمت الذراع يوم خيبر - فأخبره الذراع بذلك - فدعاها فاعترفت فقال صلى الله عليه وسلم \"ما حملك على ذلك؟\" قالت أردت إن كنت نبيا لم يضرك وإن لم تكن نبيا استرحنا منك فأطلقها عليه الصلاة والسلام ولكن لما مات منه بشر بن البراء رضي الله عنه قتلها به والأحاديث والآثار في هذا كثيرة جدا والله سبحانه وتعالى أعلم."
    },
    {
      "ayah": 4,
      "surah": 42,
      "text": "أي الجميع عبيد له وملك له تحت قهره وتصريفه \"وهو العلي العظيم\" كقوله تعالى \"وهو الكبير المتعال\" \"وهو العلي الكبير\" والآيات في هذا كثيرة."
    },
    {
      "ayah": 40,
      "surah": 42,
      "text": "قوله تبارك وتعالى \"وجزاء سيئة سيئة مثلها\" كقوله تعالى \"فمن اعتدى عليكم فاعتدوا عليه بمثل ما اعتدى عليكم\" وكقوله \"وإن عاقبتم فعاقبوا بمثل ما عوقبتم به\" الآية فشرع العدل وهو القصاص وندب إلى الفضل وهو العفو كقوله جل وعلا \"والجروح قصاص فمن تصدق به فهو كفارة له\" ولهذا قال ههنا \"فمن عفا وأصلح فأجره على الله\" أي لا يضيع ذلك عند الله كما صح ذلك في الحديث \"وما زاد الله تعالى عبدا بعفو إلا عزا\" وقوله تعالى \"إنه لا يحب الظالمين\" أي المعتدين وهو المبتدئ بالسيئة."
    },
    {
      "ayah": 41,
      "surah": 42,
      "text": "أي ليس عليهم جناح في الانتصار ممن ظلمهم قال ابن جرير حدثنا محمد بن عبد الله بن بزيع حدثنا معاذ بن معاذ حدثنا ابن عون قال كنت أسأل عن الانتصار \"ولمن انتصر بعد ظلمه فأولئك ما عليهم من سبيل\" فحدثني علي بن زيد بن جدعان عن أم محمد امرأة أبيه - قال ابن عون: زعموا أنها كانت تدخل على أم المؤمنين عائشة رضي الله عنها - قالت: قالت أم المؤمنين رضي الله عنها دخل علينا رسول الله صلى الله عليه وسلم وعندنا زينب بنت جحش رضي الله عنها فجعل صلى الله عليه وسلم يصنع بيده شيئا فلم يفطن لها فقلت بيده حتى فطنته لها فأمسك وأقبلت زينب رضي الله عنها تفحم لعائشة رضي الله عنها فنهاها فأبت أن تنتهي فقال لعائشة رضي الله عنها \"سبيها\" فسبتها فغلبتها وانطلقت زينب رضي الله عنها فأتت عليا رضي الله عنه فقالت إن عائشة تقع بكم وتفعل بكم فجاءت فاطمة رضي الله عنها فقال صلى الله عليه وسلم لها \"إنها حبة أبيك ورب الكعبة\" فانصرفت وقالت لعلي رضي الله عنه إني قلت له صلى الله عليه وسلم كذا وكذا فقال لي كذا وكذا قال وجاء علي إلى النبي صلى الله عليه وسلم وكلمه في ذلك هكذا أورد هذا السياق وعلي بن زيد بن جدعان يأتي في رواياته بالمنكرات غالبا وهذا فيه نكارة والصحيح خلاف هذا السياق كما رواه النسائي وابن ماجة من حديث خالد بن سلمة الفأفاء عن عبدالله البهي عن عروة قال: قالت عائشة رضي الله عنها ما علمت حتى دخلت علي زينب بغير إذن وهي غضبى ثم قالت لرسول الله صلى الله عليه وسلم حسبك إذا قلبت لك ابنة أبي بكر درعها ثم أقبلت علي فأعرضت عنها حتى قال النبي صلى الله عليه وسلم \"دونك فانتصري\" فأقبلت عليها حتى رأيت ريقها قد يبس في فمها ما ترد علي شيئا فرأيت النبي صلى الله عليه وسلم يتهلل وجهه وهذا لفظ النسائي. وقال البزار حدثنا يوسف بن موسى حدثنا أبو غسان حدثنا أبو الأحوص عن أبي حمزة عن إبراهيم عن الأسود عن عائشة رضي الله عنها قالت: قال رسول الله صلى الله عليه وسلم \"من دعا على من ظلمه فقد انتصر\" ورواه الترمذي من حديث أبي الأحوص عن أبي حمزة واسمه ميمون ثم قال لا نعرفه إلا من حديثه وقد تكلم فيه من قبل حفظه."
    },
    {
      "ayah": 42,
      "surah": 42,
      "text": "قوله عز وجل \"إنما السبيل\" أي إنما الحرج والعنت \"على الذين يظلمون الناس ويبغون في الأرض بغير الحق\" أي يبدءون الناس بالظلم كما جاء في الحديث الصحيح \"المستبان ما قالا فعلى البادئ ما لم يعتد المظلوم\" \"أولئك لهم عذاب أليم\" أي شديد موجع. قال أبو بكر بن أبي شيبة حدثنا الحسن بن موسى حدثنا سعيد بن زيد أخو حماد بن زيد حدثنا عثمان الشحام حدثنا محمد بن واسع قال قدمت مكة فإذا على الخندق قنطرة فأخذت فانطلق بي إلى مروان بن المهلب وهو أمير على البصرة فقال ما حاجتك يا أبا عبدالله؟ قلت أحاجتي إن استطعت أن تكون كما كان أخو بني عدي قال ومن أخو بني عدي؟ قال العلاء بن زياد استعمل صديقا له مرة على عمل فكتب إليه أما بعد فإن استطعت أن لا تبيت إلا وظهرك خفيف وبطنك خميص وكفك نقية من دماء المسلمين وأموالهم فإنك إذا فعلت ذلك لم يكن عليك سبيل \"إنما السبيل على الذين يظلمون الناس ويبغون في الأرض بغير الحق أولئك لهم عذاب أليم\" فقال مروان صدق والله ونصح ثم قال ما حاجتك يا أبا عبدالله؟ قلت حاجتي أن تلحقني بأهلي قال نعم رواه ابن أبي حاتم."
    },
    {
      "ayah": 43,
      "surah": 42,
      "text": "إن الله تعالى لما ذم الظلم وأهله وشرع القصاص قال نادبا إلى العفو والصفح \"ولمن صبر وغفر\" أي صبر على الأذى وستر السيئة \"إن ذلك لمن عزم الأمور\" قال سعيد بن جبير يعني لمن حق الأمور التي أمر الله تعالى بها أي لمن الأمور المشكورة والأفعال الحميدة التي عليها ثواب جزيل وثناء جميل وقال ابن أبي حاتم حدثنا أبي حدثنا عمران بن موسى الطرسوسي حدثنا عبدالصمد بن يزيد خادم الفضيل بن عياض قال سمعت الفضيل بن عياض يقول إذا أتاك رجل يشكو إليك رجلا فقل يا أخى اعف عنه فإن العفو أقرب للتقوى فإن قال لا يحتمل قلبي العفو ولكن أنتصر كما أمرني الله عز وجل فقل له إن كنت تحسن أن تنتصر وإلا فارجع إلى باب العفو فإنه باب واسع فإنه من عفا وأصلح فأجره على الله وصاحب العفو ينام على فراشه بالليل وصاحب الانتصار يقلب الأمور. وقال الإمام أحمد حدثنا يحيى يعني ابن سعيد القطان عن ابن عجلان حدثنا سعيد بن أبي سعيد عن أبي هريرة رضي الله عنه قال إن رجلا شتم أبا بكر رضي الله عنه والنبي صلى الله عليه وسلم جالس فجعل النبي صلى الله عليه وسلم يعجب ويتبسم فلما أكثر رد عليه بعض قوله فغضب النبي صلى الله عليه وسلم وقام فلحقه أبو بكر رضي الله عنه فقال يا رسول الله إنه كان يشتمني وأنت جالس فلما رددت عليه بعض قوله غضبت وقمت قال \"إنه كان معك ملك يرد عنك فلما رددت عليه بعض قوله حضر الشيطان فلم أكن لأقعد مع الشيطان - ثم قال - يا أبا بكر ثلاث كلهن حق ما من عبد ظلم بمظلمة فيغضي عنها لله إلا أعزه الله تعالى بها ونصره وما فتح رجل باب عطية يريد بها صلة إلا زاده الله بها كثرة وما فتح رجل باب مسئلة يريد بها كثرة إلا زاده الله عز وجل بها قلة\" كذا رواه أبو داود عن عبدالأعلى بن حماد عن سفيان بن عيينة قال ورواه صفوان بن عيسى كلاهما عن محمد بن عجلان ورواه من طريق الليث عن سعيد المقبري عن بشير بن المحرر عن سعيد بن المسيب مرسلا وهذا الحديث في غاية الحسن في المعنى وهو مناسب للصديق رضي الله عنه."
    },
    {
      "ayah": 44,
      "surah": 42,
      "text": "يقول تعالى مخبرا عن نفسه الكريمة أنه ما شاء كان ولا راد له وما لم يشأ لم يكن فلا موجد له وأنه من هداه فلا مضل له ومن يضلل الله فلا هادي له كما قال عز وجل \"ومن يضلل فلن تجد له وليا مرشدا\" ثم قال عز وجل مخبرا عن الظالمين وهم المشركون بالله \"لما رأوا العذاب\" أي يوم القيامة تمنوا الرجعة إلى الدنيا \"يقولون هل إلى مرد من سبيل\" كما قال جل وعلا \"ولو ترى إذ وقفوا على النار فقالوا يا ليتنا نرد ولا نكذب بآيات ربنا ونكون من المؤمنين بل بدا لهم ما كانوا يخفون من قبل ولو ردوا لعادوا لما نهوا عنه وإنهم لكاذبون\"."
    },
    {
      "ayah": 45,
      "surah": 42,
      "text": "قوله عز وجل \"وتراهم يعرضون عليها\" أي على النار \"خاشعين من الذل\" أي الذي قد اعتراهم بما أسلفوا من عصيان الله تعالى \"ينظرون من طرف خفي\" قال مجاهد يعني ذليل أي ينظرون إليها مسارقة خوفا منهـا والذي يحذرون منه واقع بهم لا محالة وما هو أعظم مما في نفوسهم أجارنا الله من ذلك \"وقال الذين آمنوا\" أي يقولون يوم القيامة \"إن الخاسرين\" أي الخسار الأكبر \"الذين خسروا أنفسهم وأهليهم يوم القيامة\" أي ذهب بهم إلى النار فعدموا لذتهم في دار الأبد وخسروا أنفسهم وفرق بينهم وبين أحبابهم وأصحابهم وأهاليهم وقراباتهم فخسروهم \"ألا إن الظالمين في عذاب مقيم\" أي دائم سرمدي أبدي لا خروج لهم منها ولا محيـد لهم عنها."
    },
    {
      "ayah": 46,
      "surah": 42,
      "text": "أي ينقذوهم مما هم فيه من العذاب والنكال \"ومن يضلل الله فما له من سبيل\" أي ليس له خلاص."
    },
    {
      "ayah": 47,
      "surah": 42,
      "text": "لما ذكر تعالى ما يكون في يوم القيامة من الأهوال والأمور العظام الهائلة حذر منه وأمر بالاستعداد له فقال \"استجيبوا لربكم من قبل أن يأتي يوم لا مرد له من الله\" أي إذا أمر بكونه فإنه كلمح البصر يكون وليس له دافع ولا مانع. وقوله عز وجل \"ما لكم من ملجأ يومئذ وما لكم من نكير\" أي ليس لكم حصن تتحصنون فيه ولا مكان يستركم وتتنكرون فيه فتغيبون عن بصره تبارك وتعالى بل هو محيط بكم بعلمه وبصره وقدرته فلا ملجأ منه إلا إليه \"يقول الإنسان يومئذ أين المفر كلا لا وزر إلى ربك يومئذ المستقر\"."
    },
    {
      "ayah": 48,
      "surah": 42,
      "text": "قوله تعالى \"فإن أعرضوا\" يعني المشركين \"فما أرسلناك عليهم حفيظا\" أي لست عليهم بمصيطر وقال عز وجل \"ليس عليك هداهم ولكن الله يهدي من يشاء\" وقال تعالى \"فإنما عليك البلاغ وعلينا الحساب\" وقال جل وعلا ههنا \"إن عليك إلا البلاغ\" أي إنما كلفناك أن تبلغهم رسالة الله اليهم ثم قال تبارك وتعالى \"وإنا إذا أذقنا الإنسان منا رحمة فرح بها\" أي إذا أصابه رخاء ونعمة فرح بذلك \"وإن تصبهم\" يعني الناس \"سيئة\" أي جدب ونقمة وبلاء وشدة \"فإن الإنسان كفور\" أي يجحد ما تقدم من النعم ولا يعرف إلا الساعة الراهنة فإن أصابته نعمة أشر وبطر وإن أصابته محنة يئس وقنط كما قال رسول الله صلى الله عليه وسلم للنساء \"يا معشر النساء تصدقن فإني رأيتكن أكثر أهل النار\" فقالت امرأة ولم يا رسول الله؟ فقال صلى الله عليه وسلم \"لأنكن تكثرن الشكاية وتكفرن العشير لو أحسنت إلى إحداهن الدهر ثم تركت يوما قالت ما رأيت منك خيرا قط\" وهذا حال أكثر النساء إلا من هداه الله تعالى وألهمه رشده وكان من الذين آمنوا وعملوا الصالحات فالمؤمن كما قال صلى الله عليه وسلم \"إن أصابته سراء فشكر فكان خيرا له وإن أصابته ضراء صبر فكان خيرا له وليس ذلك لأحد إلا للمؤمن\"."
    },
    {
      "ayah": 49,
      "surah": 42,
      "text": "يخبر تعالى أنه خالق السماوات والأرض ومالكهما والمتصرف فيهما وأنه ما شاء كان وما لم يشأ لم يكن وأنه يعطي من يشاء ويمنع من يشاء ولا مانع لما أعطى ولا معطي لما منع وأنه يخلق ما يشاء \"يهب لمن يشاء إناثا\" أي يرزقه البنات فقط قال البغوي ومنهم لوط عليه الصلاة والسلام \"ويهب لمن يشاء الذكور\" أي يرزقه البنين فقط قال البغوي كإبراهيم الخليل عليه الصلاة والسلام لم يولد له أنثى."
    },
    {
      "ayah": 5,
      "surah": 42,
      "text": "قوله عز وجل \"تكاد السماوات يتفطرن من فوقهن\" قال ابن عباس رضي الله عنهما والضحاك وقتادة والسدي وكعب الأحبار أي فرقا من العظمة \"والملائكة يسبحون بحمد ربهم ويستغفرون لمن في الأرض\" كقوله جل وعلا \"الذين يحملون العرش ومن حوله يسبحون بحمد ربهم ويؤمنون به ويستغفرون للذين آمنوا ربنا وسعت كل شيء رحمة وعلما\" وقوله جل جلاله \"ألا إن الله هو الغفور الرحيم\" إعلام بذلك وتنويه به."
    },
    {
      "ayah": 50,
      "surah": 42,
      "text": "أي ويعطي لمن يشاء من الناس الزوجين الذكر والأنثى أي من هذا وهذا قال البغوي كمحمد صلى الله عليه وسلم \"ويجعل من يشاء عقيما\" أي لا يولد له قال البغوي كيحيى وعيسى عليهما الصلاة والسلام فجعل الناس أربعة أقسام منهم من يعطيه البنات ومنهم من يعطيه البنين ومنهم من يعطيه من النوعين ذكورا وإناثا ومنهم من يمنعه هذا وهذا فيجعله عقيما لا نسل له ولا ولد له \"إنه عليم\" أي بمن يستحق كل قسم من هذه الأقسام \"قدير\" أي على من يشاء من تفاوت الناس في ذلك وهذا المقام شبيه بقوله تبارك وتعالى عن عيسى عليه الصلاة والسلام \"ولنجعله آية للناس\" أي دلالة لهم على قدرته تعالى وتقدس حيث خلق الخلق على أربعة أقسام فآدم عليه الصلاة والسلام مخلوق من تراب لا من ذكر ولا أنثى وحواء عليها السلام مخلوقة من ذكر بلا أنثى وسائر الخلق سوى عيسى عليه السلام من ذكر وأنثى وعيسى عليه السلام من أنثى بلا ذكر فتمت الدلالة بخلق عيسى بن مريم عليهما الصلاة والسلام ولهذا قال تعالى \"ولنجعله آية للناس\" فهذا المقام في الآباء والمقام الأول في الأبناء وكل منهما أربعة أقسام فسبحان العليم القدير."
    },
    {
      "ayah": 51,
      "surah": 42,
      "text": "هذه مقامات الوحي بالنسبة إلى جناب الله عز وجل وهو أنه تبارك وتعالى تارة يقذف في روع النبي صلى الله عليه وسلم شيئا لا يتمارى فيه أنه من الله عز وجل كما جاء في صحيح ابن حبان عن رسول الله صلى الله عليه وسلم أنه قال: \"إن روح القدس نفث في روعي أن نفسا لن تموت حتى تستكمل رزقها أجلها فاتقوا الله وأجملوا في الطلب\". وقوله تعالى \"أو من وراء حجاب\" كما كلم موسى عليه الصلاة والسلام فإنه سأل الرؤية بعد التكليم فحجب عنها وفي الصحيح أن رسول الله صلى الله عليه وسلم قال لجابر بن عبدالله رضي الله عنهما \"ما كلم الله أحدا إلا من وراء حجاب وإنه كلم أباك كفاحا\" كذا جاء الحديث وكان قد قتل يوم أحد ولكن هذا في عالم البرزخ والآية إنما هي في الدار الدنيا وقوله عز وجل \"أو يرسل رسولا فيوحي بإذنه ما يشاء\" كما ينزل جبريل عليه الصلاة والسلام وغيره من الملائكة على الأنبياء عليهم الصلاة والسلام \"إنه علي حكيم\" فهو علي عليم خبير حكيم."
    },
    {
      "ayah": 52,
      "surah": 42,
      "text": "قوله عز وجل \"وكذلك أوحينا إليك روحا من أمرنا\" يعني القرآن \"ما كنت تدري ما الكتاب ولا الإيمان\" أي على التفصيل الذي شرع لك في القرآن \"ولكن جعلناه\" أي القرآن \"نورا نهدي به من نشاء من عبادنا\" كقوله تعالى \"قل هو للذين آمنوا هدى وشفاء والذين لا يؤمنون في آذانهم وقر وهو عليهم عمى\" الآية وقوله تعالى \"وإنك\" أي يا محمد \"لتهدي إلى صراط مستقيم\" وهو الخلق القويم."
    },
    {
      "ayah": 53,
      "surah": 42,
      "text": "أي شرعه الذي أمر به الله \"الذى له ما في السماوات وما في الأرض\" أي ربهما ومالكهما والمتصرف فيهما والحاكم الذي لا معقب لحكمه \"ألا إلى الله تصير الأمور\" أي ترجع الأمور فيفصلها ويحكم فيها سبحانه وتعالى عما يقول الظالمون والجاحدون علوا كبيرا."
    },
    {
      "ayah": 6,
      "surah": 42,
      "text": "يعني المشركين \"الله حفيظ عليهم\" أي شهيد على أعمالهم يحصيها ويعدها عدا وسيجزيهم بها أوفر الجزاء \"وما أنت عليهم بوكيل\" أي إنما أنت نذير والله على كل شيء وكيل."
    },
    {
      "ayah": 7,
      "surah": 42,
      "text": "يقول تعالى وكما أوحينا إلى الأنبياء قبلك \"أوحينا إليك قرآنا عربيا\" أي واضحا جليا بينا \"لتنذر أم القرى \" وهي مكة \"ومن حولها\" أي من سائر البلاد شرقا وغربا وسميت مكة أم القرى لأنها أشرف من سائر البلاد لأدلة كثيرة مذكورة في مواضعها ومن أوجز ذلك وأدله ما قال الإمام أحمد حدثنا أبو اليمان حدثنا شعيب عن الزهري حدثنا أبو سلمة بن عبدالرحمن قال: إن عبدالله بن عدي بن الحمراء الزهري أخبره أنه سمع رسول الله صلى الله عليه وسلم يقول وهو واقف بالحزورة في سوق مكة \"والله إنك لخير أرض الله وأحب أرض الله إلى الله ولولا أني أخرجت منك ما خرجت \" هكذا رواية الترمذي والنسائي وابن ماجة من حديث الزهري به وقال الترمذي حسن صحيح. وقوله عز وجل \"وتنذر يوم الجمع\" وهو يوم القيامة يجمع الله الأولين والآخرين في صعيد واحد وقوله تعالى \"لا ريب فيه\" أي لا شك في وقوعه وأنه كائن لا محالة وقوله جل وعلا \"فريق في الجنة وفريق في السعير\" كقوله تعالى \"يوم يجمعكم ليوم الجمع ذلك يوم التغابن\" أي يغبن أهل الجنة أهل النار وكقوله عز وجل \"إن في ذلك لآية لمن خاف عذاب الآخرة ذلك يوم مجموع له الناس وذلك يوم مشهود وما نؤخره إلا لأجل معدود يوم يأت لا تكلم نفس إلا بإذنه فمنهم شقي وسعيد\" قال الإمام أحمد حدثنا هاشم بن القاسم حدثنا ليث حدثني أبو قبيل المعافري عن شفي الأصبحي عن عبدالله بن عمرو رضي الله عنهما قال خرج علينا رسول الله صلى الله عليه وسلم وفي يده كتابان فقال \"أتدرون ما هذان الكتابان؟ \" قلنا لا إلا أن تخبرنا يا رسول الله قال صلى الله عليه وسلم للذي في يمينه \"هذا كتاب من رب العالمين بأسماء أهل الجنة وأسماء آبائهم وقبائلهم - ثم أجمل على أخرهم - لا يزاد فيهم ولا ينقص منهم أبدا - ثم قال صلى الله عليه وسلم للذي في يساره - هذا كتاب أهل النار بأسمائهم وأسماء آبائهم وقبائلهم - ثم أجمل على آخرهم - لا يزاد فيهم ولا ينقص منهم أبدا\". فقال أصحاب رسول الله صلى الله عليه وسلم فلأي شيء نعمل إن كان هذا أمر قد فرغ منه قال رسول الله صلى الله عليه وسلم \"سددوا وقاربوا فإن صاحب الجنة يختم له بعمل أهل الجنة وإن عمل أي عمل وإن صاحب النار يختم له بعمل أهل النار وإن عمل أي عمل\" ثم قال صلى الله عليه وسلم بيده فقبضها ثم قال \"فرغ ربكم عز وجل من العباد - ثم قال باليمنى فنبذ بها فقال - فريق في الجنة - ونبذ باليسرى وقال - فريق في السعير\" وهكذا رواه الترمذي والنسائي جميعا عن قتيبة عن الليث بن سعد وبكر بن مضر كلاهما عن أبي قبيل عن شفي بن ماتع الأصبحي عن عبدالله بن عمرو رضي الله عنهما به وقال الترمذي حسن صحيح غريب وساقه البغوي في تفسيره من طريق بشر بن بكر عن سعيد بن عثمان عن أبي الزاهرية عن عبدالله بن عمرو رضي الله عنهما عن النبي صلى الله عليه وسلم فذكره بنحوه وعنده زيادات منها - ثم فريق في الجنة وفريق في السعير عدل من الله عز وجل - ورواه ابن أبي حاتم عن أبيه عن عبدالله بن صالح كاتب الليث عن الليث به ورواه ابن جرير عن يونس عن ابن وهب عن عمرو بن الحارث عن أبي قبيل عن شفي عن رجل من الصحابة رضي الله عنهم فذكره ثم روى عن يونس عن ابن وهب عن عمرو بن الحارث وحيوة بن شريح عن يحيى بن أبي أسيد أن أبا فراس حدثه أنه سمع عبدالله بن عمرو رضي الله عنهما يقول: \"إن الله تعالى لما خلق آدم نفضه نفض المرود وأخرج منه كل ذريته فخرج أمثال النغف فقبضهم قبضتين ثم قال شقي وسعيد ثم ألقاهما ثم قبضهما فقال فريق في الجنة وفريق في السعير\" وهذا الموقوف أشبه بالصواب والله سبحانه وتعالى أعلم. وقال الإمام أحمد حدثنا عبدالصمد حدثنا حماد يعني ابن سلمة أخبرنا الجريري عن أبي نضرة قال: إن رجلا من أصحاب النبي صلى الله عليه وسلم يقال له أبو عبدالله دخل عليه أصحابه يعني يزورونه فوجدوه يبكي فقالوا له ما يبكيك ألم يقل لك رسول الله صلى الله عليه وسلم \"خذ من شاربك ثم افره حتى تلقاني\" قال بلى ولكن سمعت رسول الله صلى الله عليه وسلم يقول \"إن الله تعالى قبض بيمينه قبضة وأخرى باليد الأخرى قال هذه لهذه وهذه لهذه ولا أبالي\" فلا أدري في أي القبضتين أنا. وأحاديث القدر في الصحاح والسنن والمسانيد كثيرة جدا منها حديث علي وابن مسعود وعائشة وجماعة جمة رضي الله عنهم أجمعين."
    },
    {
      "ayah": 8,
      "surah": 42,
      "text": "وقوله تبارك وتعالى \"ولو شاء الله لجعلهم أمة واحدة\" أي إما على الهداية أو على الضلالة ولكنه تعالى فاوت بينهم فهدى من يشاء إلى الحق وأضل من يشاء عنه وله الحكمة والحجة البالغة ولهذا قال عز وجل \"ولكن يدخل من يشاء في رحمته والظالمون ما لهم من ولي ولا نصير\". وقال ابن جرير حدثني يونس أخبرنا وهيب أخبرني الحارث عن عمرو بن أبي سويد أنه حدثه عن ابن حجيرة أنه بلغه أن موسى عليه الصلاة والسلام قال: يا رب خلقك الذين خلقتهم جعلت منهم فريقا في الجنة وفريقا في النار لو ما أدخلتهم كلهم الجنة فقال يا موسى ارفع درعك فرفع قال قد رفعت قال ارفع فرفع فلم يترك شيئا قال يا رب قد رفعت قال ارفع قال قد رفعت إلا مالا خير فيه قال كذلك أدخل خلقي كلهم الجنة إلا مالا خير فيه."
    },
    {
      "ayah": 9,
      "surah": 42,
      "text": "يقول تعالى منكرا على المشركين في اتخاذهم آلهة من دون الله ومخبرا أنه هو الولي الحق الذي لا تنبغي العبادة إلا له وحده فإنه هو القادر على إحياء الموتى وهو على كل شيء قدير."
    }
  ]
}
