{
  "ayahs": [
    {
      "ayah": 1,
      "surah": 43,
      "text": "قد اختلف المفسرون في الحروف المقطعة التي في أوائل السور فمنهم من قال هي مما استأثر الله بعلمه فردوا علمها إلى الله ولم يفسرها حكاه القرطبي في تفسـره عن أبي بكر وعمر وعثمان وعلي وابن مسعود رضي الله عنهم أجمعين وقاله عامر الشعبي وسفيان الثوري والربيع بن خيثم واختاره أبو حاتم بن حبان. ومنهم من فسرها واختلف هؤلاء في معناها فقال عبدالرحمن بن زيد بن أسلم إنما هي أسماء السور. قال العلامة أبو القاسم محمود بن عمر الزمخشري في تفسيره وعليه إطباق الأكثر ونقل عن سيبويه أنه نص عليه ويعتضد لهذا بما ورد في الصحيحين عن أبي هريرة أن رسول الله صلى الله عليه وسلم كان يقرأ في صلاة الصبح يوم الجمعة \"الم\" السجدة و \"هل أتى على الإنسان\" وقال سفيان الثوري عن ابن أبي نجيح عن مجاهد أنه قال: الم وحم والمص وص. فواتح افتتح الله بها القرآن."
    },
    {
      "ayah": 10,
      "surah": 43,
      "text": "أي فراشا قرارا ثابتة تسيرون عليها وتقومون وتنامون وتنصرفون مع أنها مخلوقة على تيار الماء لكنه أرساها بالجبال لئلا تميد هكذا ولا هكذا \"وجعل لكم فيها سبلا\" أي طرقا بين الجبال والأودية \"لعلكم تهتدون\" أي في سيركم من بلد إلى بلد وقطر إلى قطر وإقليم إلى إقليم."
    },
    {
      "ayah": 11,
      "surah": 43,
      "text": "أي بحسب الكفاية لزروعكم وثماركم وشربكم لأنفسكم ولأنعامكم وقوله تبارك وتعالى \"فأنشرنا به بلدة ميتا\" أي أرضا ميتة فلما جاءها الماء اهتزت وربت وأنبتت من كل زوج بهيج ثم نبه تعالى بإحياء الأرض على إحياء الأجساد يوم المعاد بعد موتها فقال \"كذلك تخرجون\"."
    },
    {
      "ayah": 12,
      "surah": 43,
      "text": "أي مما تنبت الأرض من سائر الأصناف من نبات وزروع وثمار وأزاهير وغير ذلك ومن الحيوانات على اختلاف أجناسها وأصنافها \"وجعل لكم من الفلك\" أي السفن \"والأنعام ما تركبون\" أي ذللها لكم وسخرها ويسرها لأكلكم لحومها وشربكم ألبانها وركوبكم ظهورها."
    },
    {
      "ayah": 13,
      "surah": 43,
      "text": "أي لتستووا متمكنين مرتفعين \"على ظهوره\" أي على ظهور هذا الجنس \"ثم تذكروا نعمة ربكم\" أي فيما سخر لكم \"إذا استويتم عليه وتقولوا سبحان الذي سخر لنا هذا وما كنا له مقرنين\" أي مقاومين ولولا تسخير الله لنا هذا ما قدرنا عليه قال ابن عباس رضي الله عنهما وقتادة والسدي وابن زيد: مقرنين أي مطيقين."
    },
    {
      "ayah": 14,
      "surah": 43,
      "text": "أي لصائرون إليه بعد مماتنا وإليه سيرنا الأكبر وهذا من باب التنبيه بسير الدنيا على سير الآخرة كما نبه بالزاد الدنيوي على الزاد الأخروي في قوله تعالى \"وتزودوا فإن خير الزاد التقوى\" وباللباس الدنيوي على الأخروي في قوله تعالى \"وريشا ولباس التقوى ذلك خير\". \"ذكر الأحاديث الواردة عند ركوب الدابة\" \"حديث أمير المؤمنين على بن أبي طالب\" رضي الله عنه. قال الإمام حدثنا يزيد حدثنا شريك بن عبد الله عن أبي إسحاق عن علي بن ربيعة قال رأيت عليا رضي الله عنه أتي بدابة فلما وضع رجله في الركاب قال: بسم الله فلما استوى عليها قال: الحمد لله \"سبحان الذي سخر لنا هذا وما كنا له مقرنين وإنا إلى ربنا لمنقلبون \"ثم حمد الله تعالى ثلاثا وكبر ثلاثا ثم قال سبحانك لا إله إلا أنت قد ظلمت نفسي فاغفر لي ثم ضحك فقلت له مم ضحكت يا أمير المؤمنين ؟ فقال رضي الله عنه رأيت رسول الله صلى الله عليه وسلم فعل مثل ما فعلت ثم ضحك فقلت مم ضحكت يا رسول الله فقال صلى الله عليه وسلم \" يعجب الرب تبارك وتعالى من عبده إذا قال رب اغفر لي ويقول علم عبدي أنه لا يغفر الذنوب غيري.\" وهكذا رواه أبو داود والترمذي والنسائي من حديث أبي الأحوص زاد النسائي ومنصور عن أبي إسحاق السبيعي عن علي بن ربيعة الأسدي الوالي به وقال الترمذي حسن صحيح وقد قال عبد الرحمن بن مهدي عن شعبة قلت لأبي إسحاق السبيعي ممن سمعت هذا الحديث ؟ قال من يونس بن خباب فلقيت يونس بن خباب فقلت ممن سمعته ؟ فقال من رجل سمعه من علي بن ربيعة ورواه بعضهم عن يونس بن خباب عن شقيق بن عقبة الأسدي عن علي بن ربيعة الوابي به \"حديث عبدالله بن عباس\" رضي الله عنهما قال الإمام أحمد حدثنا أبو المغيرة حدثنا أبو بكر بن عبدالله عن علي بن أبي طلحة عن عبدالله بن عباس رضي الله عنهما قال.إن رسول الله صلى الله عليه وسلم أردفه على دابته فلما استوى عليها كبر رسول الله صلى الله عليه وسلم ثلاثا وحمد ثلاثا وسبح ثلاثا وهلل الله واحدة ثم استلقى عليه وضحك ثم أقبل عليه فقال \" ما من امرىء مسلم يركب دابة فيصنع كما صنعت إلا أقبل الله عز وجل عليه فضحك إليه كما ضحكت إليك \" تفرد به أحمد \"حديث عبدالله بن عمر\" رضي الله عنهما قال الإمام أحمد حدثنا أبو كامل حدثنا حماد بن سلمة عن أبي الزبير عن علي بن عبدالله البارقي عن عبدالله بن عمر رضي الله عنهما قال: إن النبي صلى الله عليه وسلم كان إذا ركب راحلته كبر ثلاثا ثم قال \" سبحان الذي سخر لنا هذا وما كنا له مقرنين وإنا إلى ربنا لمنقلبون - ثم يقول- اللهم إنى أسألك في سفري هذا البر والتقوى ومن العمل ما ترضى اللهم هون علينا السفر واطو لنا البعيد اللهم أنت الصاحب في السفر والخليفة في الأهل اللهم اصحبنا في سفرنا واخلفنا في أهلنا \" وكان صلى الله عليه وسلم إذا رجع إلى أهله قال \"آيبون تائبون إن شاء الله عابدون لربنا حامدون\" وهكذا رواه مسلم وأبو داود والنسائي من حديث ابن جريج والترمذي من حديث حماد بن سلمة كلاهما عن أبي الزبير به \"حديث آخر\" قال الإمام أحمد حدثنا محمد بن عبيد حدثنا محمد بن إسحاق عن محمد بن إبراهيم عن عمرو بن الحكم بن ثوبان عن أبي لاس الخزاعي قال حملنا رسول الله صلى الله عليه وسلم على إبل من إبل الصدقة إلى الحج فقلنا يا رسول الله ما نرى أن تحملنا هذه فقال صلى الله عليه وسلم \"ما من بعير إلا في ذروته شيطان فاذكروا اسم الله عليها إذا ركبتموها كما آمركم ثم امتهنوها لأنفسكم فإنما يحمل الله عز وجل \" أبو لاس اسمه محمد بن الأسود بن خلف \"حديث آخر\" في معناه قال أحمد حدثنا عتاب أخبرنا عبدالله ح وعلي بن إسحاق أخبرنا عبدالله يعني ابن المبارك أخبرنا أسامة بن زيد أخبرني محمد بن حمزة أنه سمع أباه يقول سمعت رسـول الله صلى الله عليه وسلم يقول \"على ظهـر كل بعير شيطان فإذا ركبتموها فسموا الله عز وجل ثم لا تقصروا عن حاجاتكم \"."
    },
    {
      "ayah": 15,
      "surah": 43,
      "text": "يقول تعالى مخبرا عن المشركين فيما افتروه وكذبوه في جعلهم بعض الأنعام لطواغيتهم وبعضها لله تعالى كما ذكر الله عز وجل عنهم في سورة الأنعام في قوله تبارك وتعالى \"وجعلوا لله مما ذرأ من الحرث والأنعام نصيبا فقالوا هذا لله بزعمهم وهذا لشركائنا فما كان لشركائهم فلا يصل إلى الله وما كان لله فهو يصل إلى شركائهم ساء ما يحكمون\" وكذلك جعلوا له من قسمة البنات والبنين أخسهما وأردأهما وهو البنات كما قال تعالى \"ألكم الذكر وله الأنثى تلك إذا قسمة ضيزى\" وقال جل وعلا ههنا \"وجعلوا له من عباده جزءا إن الإنسان لكفور مبين\"."
    },
    { "ayah": 16, "surah": 43, "text": "وهذا إنكار عليهم غاية الإنكار." },
    {
      "ayah": 17,
      "surah": 43,
      "text": "ثم ذكر تمام الإنكار فقال جلت عظمته \"وإذا بشر أحدهم بما ضرب للرحمن مثلا ظل وجهه مسودا وهو كظيم\" أي إذا بشر أحد هؤلاء بما جعلوه لله من البنات يأنف من ذلك غاية الأنفة وتعلوه كآبة من سوء ما بشر به ويتوارى من القوم من خجله من ذلك يقول تبارك وتعالى فكيف تأنفون أنتم من ذلك وتنسبونه إلى الله عز وجل."
    },
    {
      "ayah": 18,
      "surah": 43,
      "text": "أي المرأة ناقصة يكمل نقصهـا بلبس الحلي منذ تكون طفلة وإذا خاصمت فلا عبارة لها بل هي عاجزة عيية أو من يكون هكذا ينسب إلى جناب الله العظيم ؟ فالأنثى ناقصة الظاهر والباطن في الصورة والمعنى فيكمل نقص ظاهرها وصورتها بلبس الحلي وما في معناه ليجبر ما فيها من نقص كما قال بعض شعراء العرب وما الحلي إلا زينة من نقيصة يتمم من حسن إذا الحسن قصرا وأما إذا كان الجمال موفرا كحسنك لم يحتج إلى أن يزورا وأما نقص معناها فإنها ضعيفة عاجزة عن الانتصار عند الانتصار لا عبارة لها ولا همة كما قال بعض العرب وقد بشر ببنت ما هى بنعم الولد نصرها بكاء وبرها سرقة."
    },
    {
      "ayah": 19,
      "surah": 43,
      "text": "أي اعتقدوا فيهم ذلك فأنكر عليهم تعالى قولهم ذلك فقال \"أشهدوا خلقهم\" أي شاهدوه وقد خلقهم الله إناثا \"ستكتب شهادتهم\" أي بذلك \"ويسئلون\" عن ذلك يوم القيامة وهذا تهديد شديد ووعيد أكيد."
    },
    {
      "ayah": 2,
      "surah": 43,
      "text": "أي البين الواضح الجلي المعاني والألفاظ لأنه نزل بلغة العرب التي هي أفصح اللغات للتخاطب بين الناس."
    },
    {
      "ayah": 20,
      "surah": 43,
      "text": "أي لو أراد الله لحال بيننا وبن عبادة الأصنام التي هى على صورة الملائكة التي هي بنات الله فإنه عالم بذلك وهو يقررنا عليه فجمعوا بين أنوع كثيرة من الخطأ \"أحدها\" جعلهم لله تعالى ولدا تعالى وتقدس وتنزه عن ذلك علوا كبيرا \"الثاني\" دعواهم أنه اصطفى البنات على البنين فجعلوا الملائكة الذين هم عباد الرحمن إناثا \"الثالث\" عبادتهم لهم مع ذلك كله بلا دليل ولا برهان ولا إذن من الله عز وجل بل بمجرد الآراء والأهواء والتقليد للأسلاف والكبراء والآباء والخبط في الجاهلية الجهلاء \"الرابع\" احتجاجهم بتقديرهم على ذلك قدرا وقد جهلوا في هذا الاحتجاج جهلا كبيرا فإنه تعالى قد أنكر ذلك عليهم أشد الإنكار فإنه منذ بعث الرسل وأنزل الكتب يأمر بعبادته وحده لا شريك له وينهى عن عبادة ما سواه قال تعالى \"ولقد بعثنا في كل أمة رسولا أن اعبدوا الله واجتنبوا الطاغوت فمنهم من هدى الله ومنهم من حطت عليه الضلالة فسيروا في الأرض فانظروا كيف كان عاقبة المكذبين\" وقال عز وجل \"واسأل من أرسلنا من قبلك من رسلنا أجعلنا من دون الرحمن آلهة يعبدون\" وقال جل وعلا في هذه الآية بعد أن ذكر حجتهم هذه \"ما لهم بذلك من علم\" أي بصحة ما قالوه واحتجوا به \"إن هم إلا يخرصون\" أي يكذبون ويتقولون وقال مجاهد في قوله تعالى \"ما لهم بذلك من علم إن هم إلا يخرصون\" يعني ما يعلمون قدرة الله تبارك وتعالى على ذلك."
    },
    {
      "ayah": 21,
      "surah": 43,
      "text": "يقول تعالى منكرا على المشركين في عبادتهم غير الله بلا برهان ولا دليل ولا حجة \"أم آتيناهم كتابا من قبله \" أي من قبل شركهم \"فهم به مستمسكون\" أي فيما هم فيه أي ليس الأمر كذلك كقوله عز وجل \"أم أنزلنا عليهم سلطانا فهو يتكلم بما كانوا به مشركون\" أي لم يكن ذلك."
    },
    {
      "ayah": 22,
      "surah": 43,
      "text": "أي ليس لهم مستند فيما هم فيه من الشرك سوى تقليد الآباء والأجداد بأنهم كانوا على أمة والمراد بها الذين ههنا وفي قوله تبارك تعالى \"إن هذه أمتكم أمة واحدة\" وقولهم \"وإنا على آثارهم\" أي ورائهم \"مهتدون\" دعوى منهم بلا دليل ثم بين جل وعلا أن مقالة هؤلاء قد سبقهم إليها أشباههم ونظراؤهم من الأمم السالفة المكذبة للرسل تشابهت قلوبهم فقالوا مثل مقالتهم \"كذلك ما أتى الذين من قبلهم من رسول إلا قالوا ساحر أو مجنون أتواصوا به بل هم قوم طاغون\"."
    },
    { "ayah": 23, "surah": 43, "text": "لا يوجد تفسير لهذه الأية" },
    {
      "ayah": 24,
      "surah": 43,
      "text": "قال عز وجل \"قل\" أي يا محمد لهؤلاء المشركين \"أو لو جئتكم بأهدى مما وجدتم عليه آباءكم قالوا إنا بما أرسلتم به كافرون\" أي ولو علموا وتيقنوا صحة ما جئتهم به لما انقادوا لذلك لسوء قصدهم ومكابرتهم للحق وأهله."
    },
    {
      "ayah": 25,
      "surah": 43,
      "text": "قال تعالى \"فانتقمنا منهم\" أي من الأمم المكذبة بأنواع من العذاب كما فصله تبارك وتعالى في قصصهم \"فانظر كيف كان عاقبة المكذبين\" أي كيف بادوا وهلكوا وكيف نجى الله المؤمنين."
    },
    {
      "ayah": 26,
      "surah": 43,
      "text": "يقول تعالى مخبرا عن عبده ورسوله وخليله إمام الحنفاء ووالد من بعث بعده من الأنبياء الذي تنتسب إليه قريش في نسبها ومذهبها أنه تبرأ من أبيه وقومه في عبادتهم الأوثان."
    },
    { "ayah": 27, "surah": 43, "text": "لا يوجد تفسير لهذه الأية" },
    {
      "ayah": 28,
      "surah": 43,
      "text": "أي هذه الكلمة وهي عبادة الله وحده لا شريك له وخلع ما سواه من الأوثان وهي لا إله إلا الله أي جعلها دائمة في ذريته يقتدي به فيها من هداه الله تعالى من ذريه إبراهيم عليه الصلاة والسلام. \"لعلهم يرجعون\" أي إليها قال عكرمة ومجاهد والضحاك وقتادة والسدي وغيرهم في قوله عز وجل \"وجعلها كلمة باقية في عقبه\" يعني لا إله إلا الله لا يزال فى ذريته من يقولها وروي نحوه عن ابن عباس رضي الله عنهما وقال ابن زيد كلمة الإسلام وهو يرجع إلى ما قاله الجماعة."
    },
    {
      "ayah": 29,
      "surah": 43,
      "text": "قال جل وعلا \"بل متعت هؤلاء\" يعني المشركين \"وآباءهم\" أي فتطاول عليهم العمر في ضلالهم \"حتى جاءهم الحق ورسول مبين \" أي بين الرسالة والنذارة."
    },
    {
      "ayah": 3,
      "surah": 43,
      "text": "قال تعالى \"إنا جعلناه\" أي أنزلناه \"قرآنا عربيا\" أي بلغة العرب فصيحا واضحا \"لعلكم تعقلون\" أي تفهمونه وتتدبرونه كما قال عز وجل \"بلسان عربي مبين\"."
    },
    { "ayah": 30, "surah": 43, "text": "أي كابروه وعاندوه ودفعوا بالصدور والراح كفرا وحسدا وبغيا." },
    {
      "ayah": 31,
      "surah": 43,
      "text": "\"وقالوا\" أي كالمعترضين على الذي أنزله تعالى وتقدس \"لولا نزل هذا القرآن على رجل من القريتين عظيم\" أي هلا كان إنزال هذا القرآن على رجل عظيم كبير في أعينهم من القريتين ؟ يعنون مكة والطائف قاله ابن عباس رضي الله عنهما وعكرمة ومحمد بن كعب القرظي وقتادة والسدي وابن زيد وقد ذكر غير واحد منهم أنهم أرادوا بذلك الوليد بن المغيرة وعروة بن مسعود الثقفي وقال مالك عن زيد بن أسلم والضحاك والسدي يعنون الوليد بن المغيرة ومسعود بن عمرو الثقفي وعن مجاهد يعنون عمير بن عمرو بن مسعود الثقفي وعنه أيضا أنهم يعنون عتبة بن ربيعة وعن ابن عباس رضي الله عنهما جبارا من جبابرة قريش وعنه رضي الله عنهما أنهم يعنون الوليد بن المغيرة وحبيب بن عمرو بن عمير الثقفي وعن مجاهد يعنون عتبة ابن ربيعة بمكة وابن عبداليل بالطائف وقال السدي عنوا بذلك الوليد بن المغيرة وكنانة بن عمرو بن عمير الثقفي والظاهر أن مرادهم رجل كبير من أي البلدتين كان."
    },
    {
      "ayah": 32,
      "surah": 43,
      "text": "أهم يقسمون رحمة ربك\" أي ليس الأمر مردودا إليهم بل إلى الله عز وجل والله أعلم حيث يجعل رسالاته فإنه لا ينزلها إلا على أزكى الخلق قلبا ونفسا وأشرفهم بيتا وأطهرهم أصلا ثم قال عز وجل مبينا أنه قد فاوت بين خلقه فيما أعطاهم من الأموال والأرزاق والعقول والفهوم وغير ذلك من القوى الظاهرة والباطنة فقال \"نحن قسمنا بينهم معيشتهم في الحياة الدنيا\" الآية.وقوله جلت عظمته \"ليتخذ بعضهم بعضا سخريا\" قيل معناه ليسخر بعضهم بعضا في الأعمال لاحتياج هذا إلى هذا وهذا إلى هذا قاله السدي وغيره وقال قتادة والضحاك ليملك بعضهم بعضا وهو راجع إلى الأول ثم قال عز وجل \"ورحمة ربك خير مما يجمعون\" أي رحمة الله بخلقه خير لهم مما بأيديهم من الأموال ومتاع الحياة الدنيا."
    },
    {
      "ayah": 33,
      "surah": 43,
      "text": "أى لولا أن يعتقد كثير من الناس الجهلة أن إعطاءنا المال دليل على محبتنا لمن أعطيناه فيجتمعوا على الكفر لأجل المال هذا معنى قول ابن عباس والحسن وقتادة والسدي وغيرهم \"لجعلنا لمن يكفر بالرحمن لبيوتهم سقفا من فضة ومعارج\" أي سلالم ودرجا من فضة.قاله ابن عباس ومجاهد وقتادة والسدي وابن زيد وغيرهم \"عليها يظهرون\" أي يصعدون."
    },
    { "ayah": 34, "surah": 43, "text": "أي أغلاقا على أبـوابهم \"وسررا عليها يتكئون\" أي جميع ذلك يكون فضة." },
    {
      "ayah": 35,
      "surah": 43,
      "text": "\"وزخرفا\" أي وذهبا قاله ابن عباس وقتادة والسدي وابن زيد.ثم قال تبارك وتعالى \" وإن كل ذلك لما متاع الحياة الدنيا\" أي إنما ذلك من الدنيا الفانية الزائلة الحقيرة عند الله تعالى أي يعجل لهم بحسانهم التي يعملونها في الدنيا مآكل ومشارب ليوافوا الآخرة وليس لهم عند الله تبارك وتعالى حسنة يجزيهم بها كما ورد به الحديث الصحيح وورد في حديث آخر \" لو أن الدنيا تزن عند الله جناح بعوضة ما سقى منهـا كافرا شربة ماء\" أسنده البغوي من رواية زكريا بن منظور عن أبى حازم عن سهل بن سعد رضي الله عنه عن النبي صلى الله عليه وسلم فذكره ورواه الطبراني من طريق زمعة بن صالح عن أبي حازم عن سهل بن سعد عن النبي صلى الله عليه وسلم \"لو عدلت الدنيا عند الله جناح بعوضة ما أعطى كافرا منها شيئا\" ثم قال سبحانه وتعالى \"والآخرة عند ربك للمتقين\" أي هي لهم خاصة لا يشاركهم فيها أحد غيرهم لهذا لما قال عمر بن الخطاب رضي الله عنه لرسول الله صلى الله عليه وسلم حين صعد إليه في تلك المشربة لما آلى صلى الله عليه وسلم من نسائه فرآه على رمال حصير قد أثر بجنبه فابتدرت عيناه بالبكاء وقال يا رسول الله هذا كسرى وقيصر فيما هما فيه وأنت صفوة الله من خلقه وكان رسول الله صلى الله عليه وسلم متكئا فجلس وقال \" أو في شك أنت يا ابن الخطاب ؟\" ثم قال صلى الله عليه وسلم \"أولئك قوم عجلت لهم طيباتهم في حياتهم الدنيا\" وفى رواية \"أما ترضى أن تكون لهم الدنيا ولنا الآخرة ؟ \" وفي الصحيح أيضا وغيرهما أن رسول الله صلى الله عليه وسلم قال \" لا تشربوا في آنية الذهب والفضة. ولا تأكلوا في صحافها فإنها لهم في الدنيا ولنا في الآخرة\" وإنما خولهم الله تعالى في الدنيا لحقارتها كما روى الترمذي وابن ماجة من طريق أبي حازم عن سهل بن سعد قال: قال رسول الله صلى الله عليه وسلم \"لو كانت الدنيا تزن عند الله جناح بعوضة ما سقى منها كافرا شربة ماء أبدا \" قال الترمذي حسن صحيح."
    },
    {
      "ayah": 36,
      "surah": 43,
      "text": "أي يتعامى ويتغافل ويعرض \"عن ذكر الرحمن\" والعشا في العين ضعف بصرها والمراد ههنا عشا البصيرة \"نقيض له شيطانا فهو له قرين\" كقوله تعالى \"ومن يشاقق الرسول من بعد ما تبين له الهدى\" الآية وكقوله \"فلما زاغوا أزاغ الله قلوبهم\" وكقوله جل جلاله \"وقيضنا لهم قرناء فزينوا لهم ما بين أيديهم وما خلفهم\"."
    },
    {
      "ayah": 37,
      "surah": 43,
      "text": "أي هذا الذي تغافل عن الهدى نقيض له من الشياطين من يضله ويهديه إلى صراط الجحيم."
    },
    {
      "ayah": 38,
      "surah": 43,
      "text": "أي إذا وافى الله عز وجل يوم القيامة يتبرم من الشيطان الذي وكل به وقرأ بعضهم \"حتى إذا جاءانا\" يعني القرين والمقارن قال عبد الرزاق أخبرنا معمر عن سعيد الجريري قال: بلغنا أن الكافر إذا بعث من قبره يوم القيامة شفع بيده شيطان فلم يفارقه حتى يصيرهما الله تبارك وتعالى إلى النار فذلك حين يقول \"يا ليت بيني وبينك بعد المشرقين فبئس القرين\" والمراد بالمشرقين ههنا هو ما بين المشرق والمغرب وإنما استعمل ههنا تغليبا كما يقال: القمران والعمران والأبوان قاله ابن جرير وغيره."
    },
    { "ayah": 39, "surah": 43, "text": "أي لا يغني عنكم اجتماعكم في النار واشتراككم في العذاب الأليم." },
    {
      "ayah": 4,
      "surah": 43,
      "text": "قوله تعالى \"وإنه في أم الكتاب لدينا لعلي حكيم\" بين شرفه في الملإ الأعلى ليشرفه ويعظمه ويطيعه أهل الأرض فقال تعالى \"وإنه\" أي القرآن\" في أم الكتاب\" أي اللوح المحفوظ قاله ابن عباس رضي الله عنهما ومجاهد \"لدينا\" أي عندنا قاله قتادة وغيره \"لعلي\" أي ذو مكانة عظيمة وشرف وفضل قاله قتادة \"حكيم\" أي محكم برئ من اللبس والزيغ وهذا كله تنبيه على شرفه وفضله كما قال تبارك وتعالى \"إنه لقرآن كريم في كتاب مكنون لا يمسه إلا المطهرون تنزيل من رب العالمين\" وقال تعالى \"كلا إنها تذكرة فمن شاء ذكره في صحف مكرمة مرفوعة مطهرة بأيدي سفرة كرام بررة\" ولهذا استنبط العلماء رضي الله عنهم من هاتين الآيتين أن المحدث لا يمس المصحف كما ورد به الحديث إن صح لأن الملائكة يعظمون المصاحف المشتملة على القرآن في الملإ الأعلى فأهل الأرض بذلك أولى وأحرى لأنه نزل عليهم وخطابه متوجه إليهم فهم أحق أن يقابلوه بالإكرام والتعظيم والانقياد له بالقبول والتسليم لقوله تعالى \"وإنه في أم الكتاب لدينا لعلي حكيم\"."
    },
    {
      "ayah": 40,
      "surah": 43,
      "text": "أي ليس ذلك إليك إنما عليك البلاغ وليس عليك هداهم ولكن الله يهدي من يشاء ويضل من يشاء وهو الحكم العدل في ذلك."
    },
    { "ayah": 41, "surah": 43, "text": "أى لابد أن ننتقم منهم ونعاقبهم ولو ذهبت أنت." },
    {
      "ayah": 42,
      "surah": 43,
      "text": "أي نحن قادرون على هذا وعلى هذا ولم يقبض الله تعالى رسوله صلى الله عليه وسلم حتى أقر عينه من أعدائه وحكمه في نواصيهم وملكه ما تضمنته صياصيهم هذا معنى قول السدي واختاره ابن جرير وقال ابن جرير حدثنا ابن عبد الأعلى حدثنا أبو ثور عن معمر قال تلا قتادة \"فإما نذهبن بك فإنا منهم منتقمون\" فقال ذهب النبي صلى الله عليه وسلم وبقيت النقمة ولم ير الله تبارك وتعالى نبيه صلى الله عليه وسلم في أمته شيئا يكرهه حتى مضى ولم يكن نبي قط إلا وقد رأى العقوبة في أمته إلا نبيكم صلى الله عليه وسلم قال وذكر لنا أن رسول الله صلى الله عليه وسلم أري ما يصيب أمته من بعده فما رئي ضاحكا منبسطا حتى قبضه الله عز وجل وذكر من رواية سعيد بن أبي عروبة عن قتادة نحوه ثم روى ابن جرير عن الحسن نحو ذلك أيضا وفي الحديث النجوم أمنة للسماء فإذا ذهبت النجوم أتى السماء ما توعد وأنا أمنة لأصحابي فإذا ذهبت أتى أصحابي ما يوعدون."
    },
    {
      "ayah": 43,
      "surah": 43,
      "text": "أي خذ بالقرآن المنزل على قلبك فإنه هو الحق وما يهدي إليه هو الحق المفضي إلى صراط الله المستقيم الموصل إلى جنات النعيم والخير الدائم المقيم."
    },
    {
      "ayah": 44,
      "surah": 43,
      "text": "قيل معناه لشرف لك ولقومك قاله ابن عباس رضي الله تعالى عنهما ومجاهد وقتادة والسدي. وابن زيد واختاره ابن جرير ولم يحك سواه وأورد الترمذي ههنا حديث الزهري عن محمد بن جبير بن مطعم عن معاوية رضي الله عنه قال سمعت رسول الله صلى الله عليه وسلم يقول \" إن هذا الأمر في قريش لا ينازعهم فيه أحد إلا أكبه الله تعالى على وجهه ما أقاموا الدين \"رواه البخاري و معناه أنه شرف لهم من حيث إنه أنزل بلغتهم فهم أفهم الناس له فينبغي أن يكونوا أقوم الناس به وأعملهم بمقتضاه وهكذا كان خيارهم وصفوتهم من الخلص من المهاجرين والسابقين الأولين ومن شابههم وتابعهم وقيل معناه \"وإنه لذكر لك ولقومك\" أي لتذكير لك ولقومك وتخصيصهم بالذكر لا ينفي من سواهم كقوله تعالى \"لقد أنزلنا إليكم كتابا فيه ذكركم أفلا تعقلون\" وكقوله تبارك وتعالى \"وأنذر عشيرتك الأقربين\" \"وسوف تسئلون\" أي عن هذا القرآن وكيف كنتم في العمل به والاستجابة له."
    },
    {
      "ayah": 45,
      "surah": 43,
      "text": "وقوله سبحانه وتعالي \"واسئل من أرسلنا من قبلك من رسلنا أجعلنا من دون الرحمن آلهة يعبدون\" أي جميع الرسل دعوا إلى ما دعوت الناس إليه من عبادة الله وحده لا شريك له ونهوا عن عبادة الأصنام والأنداد كقوله جلت عظمته \"ولقد بعثنا في كل أمة رسولا أن اعبدوا الله واجتنبوا الطاغوت\" قال مجـاهد في قراءة عبدالله بن مسعود رضي الله عنه واسئل الذين أرسلنا إليهم قبلك رسلنا وهكذا حكاه قتادة والضحاك والسدي وابن مسعود رضي الله عنه وهذا كأنه تفسير لا تلاوة والله أعلم.وقال عبد الرحمن بن زيد ابن أسلم واسألهم ليلة الإسراء فإن الأنبياء عليهم الصلاة والسلام جمعوا له واختار ابن جرير الأول والله أعلم."
    },
    {
      "ayah": 46,
      "surah": 43,
      "text": "يقول تعالى مخبرا عن عبده ورسوله موسى عليه الصلاة والسلام أنه ابتعثه إلى فرعون وملئِه من الأمراء والوزراء والقادة والأتباع والرعايا من القبط وبني إسرائيل يدعوهم إلى عبادة الله وحده لا شريك له وينهاهم عن عبادة ما سواه وأنه بعث معه آيات عظاما كيده وعصاه وما أرسل معه من الطوفان والجراد والقمل والضفادع والدم ومن نقص الزروع والأنفس والثمرات."
    },
    {
      "ayah": 47,
      "surah": 43,
      "text": "ومع هذا كله استكبروا عن اتباعها والانقياد لها وكذبوها وسخروا منها وضحكوا ممن جاءهم بها."
    },
    { "ayah": 48, "surah": 43, "text": "أي ومع هذا ما رجعوا عن غيهم وضلالهم وجهلهم وخبالهم." },
    {
      "ayah": 49,
      "surah": 43,
      "text": "أي كلما جاءتهم آية من هذه الآيات يضرعون إلى موسى عليه الصلاة والسلام ويتلطفون له في العبارة بقولهم \"يا أيها الساحر\" أي العالم قاله ابن جرير وكان علماء زمانهم هم السحرة ولم يكن السحر في زمانهم مذموما عندهم فليس هذا منهم على سبيل الانتقاص منهم لأن الحال حال ضرورة منهم إليه لا تناسب ذلك وإنما هو تعظيم في زعمهم ففي كل مرة يعدون موسى عليه السلام إن كشف عنهم هذا أن يؤمنوا به ويرسلوا معه بني إسرائيل."
    },
    {
      "ayah": 5,
      "surah": 43,
      "text": "اختلف المفسرون فى معناها فقيل معناها أتحسبون أن نصفح عنكم فلا نعذبكم ولم تفعلوا ما أمرتم به قاله ابن عباس رضي الله عنهما وأبو صالح ومجاهد والسدي واختاره ابن جرير وقال قتادة في قوله تعالى \"أفنضرب عنكم الذكر صفحا\" والله لو أن هذا القرآن رفع حين ردته أوائل هذه الأمة لهلكوا ولكن الله تعالى عاد بعائدته ورحمته فكرره عليهم ودعاهم إليه عشرين سنة أو ما شاء الله من ذلك وقول قتادة لطيف المعنى جدا وحاصله أنه يقول في معناه أنه تعالى من لطفه ورحمته بخلقه لا يترك دعاءهم إلى الخير وإلى الذكر الحكيم وهو القرآن وإن كانوا مسرفين معرضين عنه بل أمر به ليهتدي به من قدر هدايته وتقوم الحجة على من كتب شقاوته ثم قال جل وعلا مسليا لنبيه صلى الله عليه وسلم في تكذيب من كذبه من قومه وآمرا له بالصبر عليهم."
    },
    {
      "ayah": 50,
      "surah": 43,
      "text": "أي في كل مرة ينكثون ما عاهدوا عليه وهذا كقوله تبارك وتعالى \"فأرسلنا عليهم الطوفان والجراد والقمل والضفادع والدم آيات مفصلات فاستكبروا وكانوا قوما مجرمين ولما وقع عليهم الرجز قالوا يا موسى ادع لنا ربك بما عهد عندك لئن كشفت عنا الرجز لنؤمنن لك ولنرسلن معك بني إسرائيل فلما كشفنا عنهم الرجز إلى أجل هم بالغوه إذا هم ينكثون\"."
    },
    {
      "ayah": 51,
      "surah": 43,
      "text": "يقول تعالى مخبرا عن فرعون وتمرده وعتوه وكفره وعناده أنه جمع قومه فنادى فيهم متبجحا مفتخرا بملك مصر وتصرفه فيها \"أليس لى ملك مصر وهذه الأنهار تجري من تحتي\" قال قتادة قد كانت لهم جنات وأنهار ماء \"أفلا تبصرون\" أي أفلا ترون ما أنا فيه من العظمة والملك يعني وموسى وأتباعه فقراء ضعفاء وهذا كقوله تعالى \"فحشر فنادى فقال أنا ربكم الأعلى فأخذه الله نكال الآخرة والأولى\"."
    },
    {
      "ayah": 52,
      "surah": 43,
      "text": "قال السدي يقول بل أنا خير من هذا الذي هو مهين وهكذا قال بعض نحاة البصرة: إن أم ههنا بمعنى بل ويؤيد هذا ما حكاه الفراء عن بعض القراء أنه قرأها \"أما أنا خير من هذا الذي هو مهين\" قال ابن جرير ولو صحت هذه القراءة لكان معناها صحيحا واضحا ولكنها خلاف قراءة الأمصار فإنهم قرأوا \"أم أنا خير من هذا الذي هو مهين\" على الاستفهام \"قلت\" وعلى كل تقدير فإنما يعني فرعون لعنه الله بذلك أنه خير من موسى عليه الصلاة والسلام وقد كذب في قوله هذا كذبا بينا واضحا فعليه لعائن الله المتتابعة إلى يوم القيامة ويعني بقوله مهين كما قال سفيان حقير وقال قتادة والسدي يعني ضعيف وقال ابن جرير يعني لا ملك له ولا سلطان ولا مال \"ولا يكاد يبين\" يعني لا يكاد يفصح عن كلامه فهو عيي حصر قال السدي \"لا يكاد يبين\" أي لا يكاد يفهم وقال قتادة والسدي وابن جرير يعني عيي اللسان وقال سفيان يعني في لسانه شئ من الجمرة حين وضعها في فمه وهو صغير وهذا قاله فرعون لعنه الله كذب واختلاق وإنما حمله على هذا الكفر والعناد وهو ينظر إلى موسى عليه الصلاة والسلام بعين كافرة شقية وقد كان موسى عليه السلام من الجلالة والعظمة والبهاء فى صورة يبهر أبصار ذوي الألباب وقوله \"مهين\" كذب بل هو المهين الحقير خلقة وخلقا ودينا وموسى هو الشريف الرئيس الصادق البار الراشد وقوله \"ولا يكاد يبين\" افتراء أيضا فإنه وإن كان قد أصاب لسانه في حال صغره شئ من جهة تلك الجمرة فقد سأل الله عز وجل أن يحل عقدة من لسانه ليفقهوا قوله وقد استجاب الله تبارك تعالى له ذلك في قوله \"قد أوتيت سؤلك يا موسى\" وبتقدير أن يكون قد بقي شيء لم يسأل إزالته كما قاله الحسن البصري وإنما سأل زوال ما يحصل معه الإبلاغ والإفهام فالأشياء الخلقية التي ليست من فعل العبد لا يعاب بها ولا يذم عليها وفرعون وإن كان يفهم وله عقل فهـو يدري هذا وإنما أراد الترويج على رعيته فإنهم كانوا جهلة أغبياء."
    },
    {
      "ayah": 53,
      "surah": 43,
      "text": "وهي ما يجعل في الأيدي من الحلى قاله ابن عباس رضي الله عنهما وقتادة وغير واحد \"أو جاء معه الملائكة مقترنين\" أى يكنفونه خدمة له ويشهدون بتصديقه نظر إلى الشكل الظاهر ولم يفهم السر المعنوي الذي هو أظهر مما نظر إليه لو كان يفهم."
    },
    { "ayah": 54, "surah": 43, "text": "أي استخف عقولهم فدعاهم إلى الضلالة فاستجابوا له." },
    {
      "ayah": 55,
      "surah": 43,
      "text": "قال علي بن أبي طلحة عن ابن عباس رضي الله عنهما آسفونا أسخطونا وقال الضحاك عنه أغضبونا وهكذا قال ابن عباس أيضا ومجاهد وعكرمة وسعيد بن جبير ومحد بن كعب القرظي وقتادة والسدي وغيرهم من المفسرين وقال ابن أبي حاتم حدثنا أبي حدثنا عبيدالله بن أخي ابن وهب حدثنا عمي حدثنا ابن لهيعة عن عقبة بن مسلم التجيبي عن عقبة بن عامر رضي الله عنه أن رسول الله صلى الله عليه وسلم قال \"إذا رأيت الله تبارك وتعالى يعطي العبد ما يشاء وهو مقيم على معاصيه فإنما ذلك استدراج منه له \" ثم تلا صلى الله عليه وسلم \"فلما آسفونا انتقمنا منهم فأغرقناهم أجمعين\" وحدثنا أبي حدثنا يحيى بن عبد الحميد الحماني حدثنا قيس بن الربيع عن قيس بن مسلم عن طارق بن شهاب قال كنت عند عبدالله رضي الله عنه فذكر عنده موت الفجأة فقال تخفيف على المؤمن وحسرة على الكافر ثم قرأ رضي الله عنه \"فلما آسفونا انتقمنا منهم فأغرقناهم أجمعين\" وقال عمر بن عبد العزيز رضي الله عنه وجدت النقمة مع الغفلة يعني قوله تبارك وتعالى \"فلما آسفونا انتقمنا منهم فأغرقناهم أجمعين\"."
    },
    {
      "ayah": 56,
      "surah": 43,
      "text": "قال أبو مجلز سلفا لمثل من عمل بعملهم وقال هو ومجاهد ومثلا أي عبرة لمن بعدهم والله سبحانه وتعالى الموفق للصواب وإليه المرجع والمآب."
    },
    {
      "ayah": 57,
      "surah": 43,
      "text": "يقول تعالى مخبرا عن تعنت قريش فى كفرهم وتعمدهم العناد والجدل \"ولما ضرب ابن مريم مثلا إذا قومك منه يصدون\" قال غير واحد عن ابن عباس رضي الله عنهما ومجاهد وعكرمة والسدي والضحاك يضحكون أي أعجبوا بذلك وقال قتادة يجزعون ويضحكون وقال إبراهيم النخعي يعرضون وكأن السبب في ذلك ما ذكره محمد بن إسحاق فى السيرة حيث قال: وجلس رسول الله صلى الله عليه وسلم فيما بلغني يوما مع الوليد بن المغيرة في المسجد فجاء النضر بن الحارث حتى جلس معهم وفي المجلس غير واحد من رجال قريش فتكلم رسول الله صلى الله عليه وسلم فعرض له النضر بن الحارث فكلمه رسول الله صلى الله عليه وسلم حتى أفحمه ثم تلا عليه وعليهم \"إنكم وما تعبدون من دون الله حصب جهنم أنتم لها واردون\" الآيات.ثم قام رسول الله صلى الله عليه وسلم وأقبل عبدالله بن الزبعري التميمي حتى جلس فقال الوليد بن المغيرة له: والله ما قام النضر بن الحارث لابن عبد المطلب وما قعد وقد زعم محمد أنا وما نعبد من آلهتنا هذه.حصب جهنم فقال عبدالله بن الزبعري أما والله لو وجدته لخصمته سلوا محمدا أكل ما يعبد من دون الله في جهنم مع من عبده ؟ فنحن نعبد الملائكة واليهود تعبد عزيرا والنصارى تعبد المسيح عيسى ابن مريم فعجب الوليد ومن كان معه في المجلس من قول عبدالله بن الزبعري ورأوا أنه قد احتج وخاصم فذكر ذلك لرسول الله صلى الله عليه وسلم فقال \"كل من أحب أن يعبد من دون الله فهو مع من عبده فإنهم إنما يعبدون الشيطان ومن أمرهم بعبادته \" فأنزل الله عز وجل \"إن الذين سبقت لهم منا الحسنى أولئك عنها مبعدون\" أي عيسى وعزير ومن عبد معهما من الأحبار والرهبان الذين مضوا على طاعة الله عز وجل فاتخذهم من بعدهم من أهل الضلالة أربابا من دون الله ونزل فيما يذكر من أنهم يعبدون الملائكة وأنهم بنات الله \"وقالوا اتخذ الرحمن ولدا سبحانه بل عباد مكرمون\" الآيات ونزل فيما يذكر من أمر عيسى عليه الصلاة والسلام وأنه يعبد من دون الله وعجب الوليد ومن حضر من حجته وخصومته \"ولما ضرب ابن مريم مثلا إذا قومك منه يصدون\"أي يصدون عن أمرك بذلك من قوله.ثم ذكر عيسى عليه الصلاة والسلام فقال \"إن هو إلا عبد أنعمنا عليه وجعلناه مثلا لبني إسرائيل ولو نشاء لجعلنا منكم ملائكة في الأرض يخلفون وإنه لعلم للساعة\" أي ما وضع على يديه من الآيات من إحياء الموتى وإبراء الأسقام فكفى به دليلا على علم الساعة يقول \"فلا تمترن بهل واتبعون هذا صراط مستقيم\" وذكر ابن جرير من رواية العوفي عن ابن عباس رضي الله عنهما قوله \"ولما ضرب ابن مريم مثلا إذا قومك منه يصدون\" قال يعني قريشا لما قيل لهم \"إنكم وما تعبدون من دون الله حصب جهنم أنتم لها واردون\" إلى آخر الآيات فقالت له قريش فما ابن مريم ؟ قال \" ذاك عبدالله ورسوله\" فقالوا والله ما يريد هذا إلا أن نتخذه ربا كما اتخذت النصارى عيسى بن مريم ربا فقال الله عز وجل \"ما ضربوه لك إلا جدلا بل هم قوم خصمون\". وقال الإمام أحمد حدثنا هاشم بن القاسم حدثنا شيبان عن عاصم بن أبي النجود عن أبي رزين عن أبي يحيى مولى ابن عقيل الأنصاري قال: قال ابن عباس رضي الله عنهما: لقد علمت آية من القرآن ما سألني عنها رجل قط ولا أدري أعلمها الناس فلم يسألوا عنها أم لم يفطنوا لها فيسألوا عنها قال ثم طفق يحدثنا فلما قام تلاومنا أن لا نكون سألناه عنها فقلت أنا لها إذا راح غدا فلما راح الغد قلت يا ابن عباس ذكرت أمس أن آية من القرآن لم يسألك عنها رجل قط فلا يدري أعلمها الناس أم لم يفطنوا لها فقلت أخبرني عنها وعن اللاتي قرأت قبلها قال رضي الله عنه نعم إن رسول الله صلى الله عليه وسلم قال لقريش \" يا معشر قريش إنه ليس أحد يعبد من دون الله فيه خير \" وقد علمت قريش أن النصارى تعبد عيسى ابن مريم عليهما الصلاة والسلام وما تقول في محمد صلى الله عليه وسلم فقالوا يا محمد ألست تزعم أن عيسى عليه الصلاة والسلام كان نبيا وعبدا من عباد الله صالحا فإن كنت صادقا كان آلهتهم كما تقولون قال فأنزل الله عز وجل \"ولما ضرب ابن مريم مثلا إذا قومك منه يصدون\" قلت ما يصدون ؟ قال يضحكون \"وإنه لعلم للساعة\" قال هو خروج عيسى ابن مريم عليه الصلاة والسلام قبل يوم القيامة وقال ابن أبي حاتم حدثنا محمد بن يعقوب الدمشقي حدثنا آدم حدثنا شيبان عن عاصم بن أبي النجود عن أبي أحمد مولى الأنصار عن ابن عباس رضي الله عنهما قال: قال رسول الله صلى الله عليه وسلم \" يا معشر قريش إنه ليس أحد يعبد من دون الله فيه خير\" فقالوا له ألست تزعم أن عيسى كان نبيا وعبدا من عباد الله صالحا فقد كان يعبد من دون الله ؟ فأنزل الله عز وجل \"ولما ضرب ابن مريم مثلا إذا قومك منه يصدون\" وقال مجاهد في قوله تعالى \"ولما ضرب ابن مريم مثلا إذا قومك منه يصدون\" قالت قريش إنما يريد محمد أن نعبده كما عبد قوم عيسى عيسى عليه السلام ونحو هذا قال قتادة."
    },
    {
      "ayah": 58,
      "surah": 43,
      "text": "قال قتادة يقولون آلهتنا خير منه وقال قتادة قرأ ابن مسعود رضي الله عنه وقولوا أآلهتنا خير أم هذا يعنون محمدا صلى الله عليه وسلم.وقوله تبارك وتعالى \"ما ضربوه لك إلا جدلا\" أي مراء وهم يعلمون أنه ليس بوارد على الآية لأنها لما لا يعقل وهي قوله تعالى \"إنكم وما تعبدون من دون الله حصب جهنم \"ثم هى خطاب لقريش وهم إنما كانوا يعبدون الأصنام والأنداد ولم يكونوا يعبدون المسيح حتى يوردوه فتعين أن مقالتهم إنما كانت جدلا منهم ليسوا يعتقدون صحتها وقد قال الإمام أحمد رحمه الله تعالى حدثنا ابن نمير حدثنا حجاج بن دينار عن أبي غالب عن أبي أمامة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم \" ما ضل قوم بعد هدى كانوا عليه إلا أورثوا الجدل \" ثم تلا رسول الله صلى الله عليه وسلم هذه الآية \"ما ضربوه لك إلا جدلا بل هم قوم خصمون\" وقد رواه الترمذي وابن ماجة وابن جرير من حديث حجاج بن دينار به ثم قال الترمذي حسن صحيح لا نعرفه إلا من حديثه كذا قال وقد روي من وجه آخر عن أبي أمامة رضي الله عنه بزيادة فقال ابن أبي حاتم حدثنا حميد بن عياش الرملي حدثنا مؤمل حدثنا حماد أخبرنا ابن مخزوم عن القاسم بن أبي عبد الرحمن السامي عن أبي أمامة رضي الله عنه قال حماد لا أدري رفعه أم لا ؟ قال: ما ضلت أمة بعد نبيها إلا كان أول ضـلالها التكذيب بالقدر وما ضلت أمة بعد نبيها إلا أعطوا الجدل ثم قرأ \"ما ضربوه لك إلا جدلا بل هم قوم خصمون\" وقال ابن جرير أيضا حدثنا أبو كريب حدثنا أحمد بن عبد الرحمن عن عبادة بن عباد عن جعفر عن القاسم عن أبي أمامة رضي الله عنه قال: إن رسول الله صلى الله عليه وسلم خرج على الناس وهم يتنازعون في القرآن فغضب غضبا شديدا حتى كأنما صب على وجهه الخل ثم قال صلى الله عليه وسلم \" لا تضربوا كتاب الله بعضه ببعض فإنه ما ضل قوم قط إلا أوتوا الجدل \" ثم تلا صلى الله عليه وسلم \"ما ضربوه لك إلا جدلا بل هم قوم خصمون\"."
    },
    {
      "ayah": 59,
      "surah": 43,
      "text": "قوله تعالى \"إن هو إلا عبد أنعمنا عليه\" يعني عيسى عليه الصلاة والسلام ما هو إلا عبد من عباد الله عز وجل أنعم الله عليه بالنبوة والرسالة \"وجعلناه مثلا لبني إسرائيل\" أي دلالة وحجة وبرهانا على قدرتنا على ما نشاء."
    },
    { "ayah": 6, "surah": 43, "text": "أى في شيع الأولين." },
    {
      "ayah": 60,
      "surah": 43,
      "text": "وقوله عز وجل \"ولو نشاء لجعلنا منكم\" أي بدلكم \"ملائكة في الأرض يخلفون\" قال السدي يخلفونك فيها وقال ابن عباس رضي الله عنهما وقتادة يخلف بعضهم بعضا كما يخلف بعضكم بعضا وهذا القول يستلزم الأول وقال مجاهد يعمرون الأرض بدلكم."
    },
    {
      "ayah": 61,
      "surah": 43,
      "text": "قوله سبحانه وتعالى \"وإنه لعلم للساعة\" تقدم تفسير ابن إسحاق أن المراد من ذلك ما بعث به عيسى عليه الصلاة والسلام من إحياء الموتى وإبراء الأكمه والأبرص وغير ذلك من الأسقام وفي هذا نظر وأبعد منه ما حكاه قتادة عن الحسن البصري وسعيد بن جبير أن الضمير في وإنه عائد على القرآن بل الصحيح أنه عائد على عيسى عليه الصلاة والسلام فإن السياق في ذكره ثم المراد بذلك نزوله قبل يوم القيامة كما قال تبارك وتعالى \"وإن من أهل الكتاب إلا ليؤمنن به قبل موته\" أي قبل موت عيسى عليه الصلاة والسلام \"ثم يوم القيامة يكون عليهم شهيدا\" ويؤيد هذا المعنى القراءة الأخرى \"وإنه لعلم للساعة\" أي أمارة ودليل على وقوع الساعة قال مجاهد \"وإنه لعلم للساعة\" أي آية للساعة خروج عيسى ابن مريم عليه السلام قبل يوم القيامة وهكذا روي عن أبي هريرة وابن عباس وأبي العالية وأبي مالك وعكرمة والحسن وقتادة والضحاك وغيرهم وقد تواترت الأحاديث عن رسول الله صلى الله عليه وسلم أنه أخبر بنزول عيسى عليه السلام قبل يوم القيامة إماما عادلا وحكما مقسطا. وقوله تعالى \"فلا تمترون بها\" أي لا تشكوا فيها إنها واقعة وكائنة لا محالة \"واتبعون\" أي فيما أخبركم به."
    },
    { "ayah": 62, "surah": 43, "text": "أي عن اتباع الحق." },
    {
      "ayah": 63,
      "surah": 43,
      "text": "\"و لما جاء عيسى بالبينات قال قد جئتكم بالحكمة\" أي بالنبوة \"ولأبين لكم بعض الذي تختلفون فيه\" قال ابن جرير يعني من الأمور الدينية لا الدنيوية وهذا الذي قاله حسن جيد ثم رد قول من زعم أن بعض ههنا بمعنى كل واستشهد بقول لبيد الشاعر حيث قال: تزال أمكنة إذا لم أرضهـا أو يتعلق بعض النفوس حمامهـا وأولوه علي أنه أراد جميع النفوس; قال ابن جرير وإنما أراد نفسه فقط وعبر بالبعض عنها وهذا الذي قاله محتمل.وقوله عز وجل \"فاتقوا الله\" أي فيما أمركم به \"وأطيعون\" فيما جئتكم به."
    },
    {
      "ayah": 64,
      "surah": 43,
      "text": "أي أنا وأنتم عبيد له فقراء إليه مشتركون في عبادته وحده لا شريك له \"هذا صراط مستقيم\" أي هذا الذي جئتكم به هو الصراط المستقيم وهو عبادة الرب جل وعلا وحده."
    },
    {
      "ayah": 65,
      "surah": 43,
      "text": "أي اختلفت الفرق وصاروا شيعا فيه منهم من يقر بأنه عبدالله ورسوله وهو الحق ومنهم من يدعي أنه ولد الله ومنهم من يقول إنه الله تعالى الله عن قولهم علوا كبيرا.ولهذا قال تعالى \"فويل للذين ظلموا من عذاب يوم أليم\"."
    },
    {
      "ayah": 66,
      "surah": 43,
      "text": "يقول تعالى هل ينتظر هؤلاء المشركون المكذبون للرسل \"إلا الساعة أن تأتيهم بغتة وهم لا يشعرون\" أي فإنها كائنة لا محاله وواقعة وهؤلاء غافلون عنها غير مستعدين فإذا جاءت إنما تجيء وهم لا يشعرون بها فحينئذ يندمون كل الندم حيث لا ينفعهم ولا يدفع عنهم."
    },
    {
      "ayah": 67,
      "surah": 43,
      "text": "أي كل صداقة وصحابة لغير الله فإنها تنقلب يوم القيامة عداوة إلا ما كان لله عز وجل فإنه دائم بدوامه وهذا كما قال إبراهيم عليه الصلاة والسلام لقومه \"إنما اتخذتم من دون الله أوثانا مودة بينكم في الحياة الدنيا ثم يوم القيامة يكفر بعضكم ببعض ويلعن بعضكم بعضا ومأواكم النار وما لكم من ناصرين \". وقال عبد الرزاق أخبرنا إسرائيل عن أبي إسحاق عن الحارث عن علي رضي الله عنه \"الأخلاء يومئذ بعضهم لبعض عدو إلا المتقين\" قال خليلان مؤمنان وخليلان كافران فتوفي أحد المؤمنين وبشر بالجنة فذكر خليله فقال اللهم إن فلانا خليلي كان يأمرني بطاعتك وطاعة رسولك ويأمرني بالخير وينهاني عن الشر وينبئني أني ملاقيك اللهم فلا تضله بعدي حتى تريه مثل ما أريتني وترضى عنه كما رضيت عني فيقال له اذهب فلو تعلم ما له عندي لضحكت كثيرا وبكيت قليلا قال ثم يموت الآخر فتجتمع أرواحهما فيقال ليثن أحدكما على صاحبه فيقول كل واحد منهما لصاحبه نعم الأخ ونعم الصاحب ونعم الخليل وإذا مات أحد الكافرين وبشر بالنار ذكر خليله فيقول اللهم إن خليلي فلانا كان يأمرني بمعصيتك ومعصية رسولك ويأمرني بالشر وينهاني عن الخير ويخبرني أني غير ملاقيك اللهم فلا تهده بعدي حتى تريه مثل ما أريتني وتسخط عليه كما سخطت علي قال فيموت الكافر الآخر فيجمع بين أرواحهما فيقال ليثن كل واحد منكما على صاحبه فيقول كل واحد منهما لصاحبه بئس الأخ وبئس الصاحب وبئس الخليل.رواه ابن أبي حاتم وقال ابن عباس رضي الله عنهما ومجاهد وقتادة صارت كل خلة عداوة يوم القيامة إلا المتقين وروى الحافظ ابن عساكر في ترجمة هشام بن أحمد عن هشام بن عبدالله بن كثير حدثنا أبو جعفر محمد بن الخضر بالرقة عن معافى حدثنا حكيم بن نافع عن الأعمش عن أبي صالح عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم \" لو أن رجلين تحابا في الله أحدهما بالمشرق والآخر بالمغرب لجمع الله تعالى بينهما يوم القيامة يقول هذا الذي أحببته في \"."
    },
    { "ayah": 68, "surah": 43, "text": "أي بشرهم." },
    {
      "ayah": 69,
      "surah": 43,
      "text": "أي آمنت قلوبهم وبواطنهم وانقادت لشرع الله جوارحهم وظواهرهم قال المعتمر بن سليمان عن أبيه إذا كان يوم القيامة فإن الناس حين يبعثون لا يبقى أحد منهم إلا فزع فنادي مناد \"يا عباد لا خوف عليكم اليوم ولا أنتم تحزنون\" فيرجوها الناس كلهم قال فيتبعها \"الذين آمنوا بآياتنا وكانوا مسلمين\" قال فييأس الناس منها غير المؤمنين."
    },
    { "ayah": 7, "surah": 43, "text": "أي يكذبونه ويسخرون به." },
    {
      "ayah": 70,
      "surah": 43,
      "text": "أي يقال لهم ادخلوا الجنة \"أنتم وأزواجكم\" أي نظراؤكم \"تحبرون\" أي تتنعمون وتسعدون قال يحيى بن أبي كثير يعني سماع الغناء. والحبرة أعم من هذا كله قال العجاج: فالحمد لله الذي أعطى الحبر موالى الحق إن المولى شكر."
    },
    {
      "ayah": 71,
      "surah": 43,
      "text": "أي زباديِّ آنية الطعام \"وأكواب\" وهي آنية الشراب أي من ذهب لا خراطيم لها ولا عرى \"وفيها ما تشتهي الأنفس\" وقرأ بعضهم تشتهيه الأنفس \"وتلذ الأعين\" أي طيب الطعم والريح وحسن المنظر قال عبد الرزاق أخبرنا معمر أخبرني إسماعيل بن أبي سعيد قال: إن عكرمة مولى ابن عباس رضي الله عنهما أخبره أن رسول الله صلى الله عليه وسلم قال \" إن أدنى أهل الجنة منزلة وأسفلهم درجة لرجل لا يدخل الجنة بعده أحد يفسح له في بصره مسيرة مائة عام في قصور من ذهب وخيام من لؤلؤ ليس فيها موضع شبر إلا معمور يغدى عليه ويراح بسبعين ألف صحفة من ذهب ليس فيها صحفة إلا فيها لون ليس في الأخرى مثله شهوته في آخرها كشهوته في أولها لو نزل به جميع أهل الأرض لوسع عليهم مما أعطى لا ينقص ذلك مما أوتي شيئا\" وقال ابن أبي حاتم حدثنا علي بن الحسين بن الجنيد حدثنا عمرو بن سواد السرحي حدثني عبدالله بن وهب عن ابن لهيعة عن عقيل بن خالد عن الحسن عن أبي هريرة رضي الله عنه أن أبا أمامة رضي الله عنه حدث أن رسول الله صلى الله عليه وسلم حدثهم وذكر الجنة فقال \" والذي نفس محمد بيده ليأخذن أحدكم اللقمة فيجعلهـا في فيه ثم يخطر على باله طعام آخر فيتحول الطعام الذي في فيه على الذي اشتهى \" ثم قرأ رسول الله صلى الله عليه وسلم \"وفيها ما تشتهيه الأنفس وتلذ الأعين وأنتم فيها خالدون\" وقال الإمام أحمد حدثنا حسن هو ابن موسى حدثنا مسكين بن عبدالعزيز حدثنا أبو الأشعث الضرير عن شهر بن حوشب عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم \" إن أدنى أهل الجنة منزلة من له لسبع درجات وهو على السادسة وفوقه السابعة وإن له ثلثمائة خادم ويغدى عليه ويراح كل يوم بثلثمائة صحفة - ولا أعلمه إلا قال من ذهب- في كل صحفة لون ليس في الأخرى وإنه ليلذ أوله كما يلذ آخره ومن الأشربة ثلثمائة إناء في كل إناء لون ليس في الآخر وإنه ليلذ أوله كما يلذ آخره وإنه ليقول يا رب لو أذنت لي لأطعمت أهل الجنة وسقيتهم لم ينقص مما عندي شيء وإن له من الحور العين لاثنين وسبعين زوجة سوى أزواجه من الدنيا وإن الواحدة منهن لتأخذ مقعدها قدر ميل من الأرض\".وقوله تعالى \"وأنتم فيها\" أي في الجنة \"خالدون\" أي لا تخرجون منها ولا تبغون عنها حولا."
    },
    {
      "ayah": 72,
      "surah": 43,
      "text": "ثم قيل لهم على وجه التفضل والامتنان \"وتلك الجنة التي أورثتموها بما كنتم تعملون\" أي أعمالكم الصالحة كانت سببا لشمول رحمة الله إياكم فإنه لا يدخل أحدا عمله الجنة ولكن برحمة الله وفضله وإنما الدرجات ينال تفاوتها بحسب الأعمال الصالحات قال ابن أبي حاتم حدثنا الفضل بن شاذان المقري حدثنا يوسف بن يعقوب يعني الصفار حدثنا أبو بكر بن عياش عن الأعمش عن أبي صالح عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم \" كل أهل النار يرى منزله من الجنة حسرة فيكون له فيقول \"لو أن الله هداني لكنت من المتقين\" وكل أهل الجنة يرى منزله من النار فيقول \" وما كنا لنهتدي لولا أن هدانا الله\" فيكون له شكرا \" قال: وقال رسول الله صلى الله عليه وسلم \" ما من أحد إلا وله منزل في الجنة ومنزل في النار فالكافر يرث المؤمن منزله من النار والمؤمن يرث الكافر منزلة من الجنة\" وذلك قوله تعالى \"وتلك الجنة التي أورثتموها بما كنتم تعملون\"."
    },
    {
      "ayah": 73,
      "surah": 43,
      "text": "قوله تعالى \"لكم فيها فاكهة كثيرة\" أي من جميع الأنواع \"منها تأكلون\" أي مهما اخترتم وأردتم ولما ذكر الطعام والشراب ذكر بعده الفاكهة لتتم النعمة والغبطة والله تعالى أعلم."
    },
    {
      "ayah": 74,
      "surah": 43,
      "text": "لما ذكر تعالى حال السعداء ثنى بذكر الأشقياء فقال \"إن المجرمين في عذاب جهنم خالدون\"."
    },
    { "ayah": 75, "surah": 43, "text": "أي ساعة واحدة \"وهم فيه مبلسون\" أي آيسون من كل خير." },
    {
      "ayah": 76,
      "surah": 43,
      "text": "أي بأعمالهم السيئة بعد قيام الحجة عليهم وإرسال الرسل إليهم فكذبوا وعصوا فجوزوا بذلك جزاء وفاقا وما ربك بظلام للعبيد."
    },
    {
      "ayah": 77,
      "surah": 43,
      "text": "\"ونادوا يا مالك\" وهو خازن النار قال البخاري حدثنا حجاج بن منهال حدثنا سفيان بن عيينة عن عمرو بن عطاء عن صفوان بن يعلى عن أبيه رضي الله عنه قال سمعت رسول الله صلى الله عليه وسلم يقرأ على المنبر \"ونادوا يا مالك ليقض علينا ربك\" أي يقبض أرواحنا فيريحنا مما نحن فيه فإنهم كما قال تعالى \"لا يقضى عليهم فيموتوا ولا يخفف عنهم من عذابها\" وقال عز وجل \"ويتجنبها الأشقى الذي يصلى النار الكبرى ثم لا يموت فيها ولا يحيا\" فلما سألوا أن يموتوا أجابهم مالك \"قال إنكم ماكثون\" قال ابن عباس مكث ألف سنة ثم قال إنكم ماكثون رواه ابن أبي حاتم أي لا خروج لكم منها ولا محيد لكم عنها ثم ذكر سبب شقوتهم وهو مخالفتهم للحق ومعاندتهم له."
    },
    {
      "ayah": 78,
      "surah": 43,
      "text": "قال \"لقد جئناكم بالحق\" أي بيناه لكم ووضحناه وفسرناه \"ولكن أكثركم للحق كارهون\" أي ولكن كانت سجاياكم لا تقبله ولا تقبل عليه وإنما تنقاد للباطل وتعظمه وتصد عن الحق وتأباه وتبغض أهله فعودوا على أنفسكم بالملامة واندموا حيث لا تنفعكم الندامة."
    },
    {
      "ayah": 79,
      "surah": 43,
      "text": "قال مجاهد أرادوا كيد شر فكدناهم وهذا الذي قاله مجاهد كما قال تعالى \"ومكروا مكرا ومكرنا مكرا وهم لا يشعرون\" وذلك لأن المشركين كانوا يتحيلون في رد الحق بالباطل بحيل ومكر يسلكونه فكادهم الله تعالى ورد وبال ذلك عليهم."
    },
    {
      "ayah": 8,
      "surah": 43,
      "text": "أي فأهلكنا المكذبين بالرسل وقد كانوا أشد بطشا من هؤلاء المكذبين لك يا محمد كقوله عز وجل \"أفلم يسيروا في الأرض فينظروا كيف كان عاقبة الذين من قبلهم كانوا أكثر منهم وأشد قوة\" والآيات في ذلك كثيرة جدا.وقوله جل جلاله \"ومضى مثل الأولين\" قال مجاهد: سنتهم وقال قتادة: عقوبتهم وقال غيرهما: عبرتهم أي جعلناهم عبرة لمن بعدهم من المكذبين أن يصيبهم ما أصابهم كقوله تعالى في آخر هذه السورة \"فجعلناهم سلفا ومثلا للآخرين\" وكقوله جلت عظمته \"سنة الله التي قد خلت في عباده\" وقال عز وجل \"ولن تجد لسنة الله تبديلا\"."
    },
    {
      "ayah": 80,
      "surah": 43,
      "text": "قال \"أم يحسبون أنا لا نسمع سرهم ونجواهم\" أي سرهم وعلانيتهم \"بلى ورسلنا لديهم يكتبون\" أي نحن نعلم ما هم عليه والملائكة أيضا يكتبون أعمالهم صغيرها وكبيرها."
    },
    {
      "ayah": 81,
      "surah": 43,
      "text": "يقول تعالى \"قل\" يا محمد \"إن كان للرحمن ولد فأنا أول العابدين\" أي لو فرض هذا لعبدته على ذلك لأني عبد من عبيده مطيع لجميع ما يأمرني به ليس عندي استكبار ولا إباء عن عبادته فلو فرض هذا لكان هذا ولكن هذا ممتنع في حقه تعالى والشرط لا يلزم منه الوقوع ولا الجواز أيضا كما قال عز وجل \"لو أراد الله أن يتخذ ولدا لاصطفى مما يخلق ما يشاء سبحانه هو الله الواحد القهار\" وقال بعض المفسرين في قوله تعالى \"فأنا أول العابدين\" أي الآنفين ومنهم سفيان الثوري والبخاري حكاه فقال ويقال أول العابدين الجاحدين من عبد يعبد وذكر ابن جرير لهذا القول من الشواهد ما رواه عن يونس بن عبد الأعلى عن ابن وهب حدثني ابن أبي ذئب عن أبي قسيط عن بعجة بن بدر الجهني أن امرأة منهم دخلت على زوجها وهو رجل منهم أيضا فولدت له في ستة أشهر فذكر ذلك زوجها لعثمان بن عفان رضي الله عنه فأمر بها أن ترجم فدخل عليه علي بن أبي طالب رضي الله عنه فقال إن الله تعالى يقول في كتابه \"وحمله وفصاله ثلاثون شهرا\" وقال عز وجل \"وفصاله في عامين \" قال فوالله ما عبد عثمان رضي الله عنه أن بعث إليها ترد قال يونس قال ابن وهب عبد استنكف وقال الشاعر: متى مايشأ ذو الود يصرم خليله ويعبد عليه لا محالة ظالما وهذا القول فيه نظر لأنه كيف يلتئم مع الشرط فيكون تقديره إن كان هذا فأنا ممتنع منه؟ هذا فيه نظر فليتأمل اللهم إلا أن يقال أن إن ليست شرطا وإنما هي نافية كما قال على بن أبي طلحه عن ابن عباس رضي الله عنهما في قوله تعالى \"قل إن كان للرحمن ولد\" يقول لم يكن للرحمن ولد فأنا أول الشاهدين وقال قتادة هي كلمة من كلام العرب \"إن كان للرحمن ولد فأنا أول العابدين\" أي إن ذلك لم يكن فلا ينبغي وقال أبو صخر \"قل إن كان للرحمن ولد فأنا أول العابدين\" أي فأنا أول من عبده بأن لا ولد له وأول من وحده وكذا قال عبد الرحمن بن زيد بن أسلم وقال مجاهد \"فأنا أول العابدين\" أي أول من عبده ووحده وكذبكم وقال البخاري \"فأنا أول العابدين\" الآنفين وهما لغتان رجل عابد وعبد والأول أقرب على أنه شرط وجزاء ولكن هو ممتنع وقال السدي \"قل إن كان للرحمن ولد فأنا أول العابدين\" يقول لو كان له ولد كنت أول من عبده بأن له ولد ولكن لا ولد له وهو اختيار ابن جرير ورد قول من زعم أن إن نافية."
    },
    {
      "ayah": 82,
      "surah": 43,
      "text": "أي تعالى وتقدس وتنزه خالق الأشياء عن أن يكون له ولد فإنه فرد أحد لا نظير له ولا كفء له فلا ولد له."
    },
    {
      "ayah": 83,
      "surah": 43,
      "text": "\"فذرهم يخوضوا\" أى في جهلهم وضلالهم \"ويلعبون\" في دنياهم \"حتى يلاقوا يومهم الذي يوعدون \"وهو يوم القيامة أي فسوف يعلمون كيف يكون مصيرهم ومآلهم وحالهم في ذلك اليوم."
    },
    {
      "ayah": 84,
      "surah": 43,
      "text": "أي هو إله من في السماء وإله من في الأرض يعبده أهلهما وكلهم خاضعون له أذلاء بين يديه \"هو الحكيم العليم\" وهذه الآية كقوله سبحانه وتعالى \"وهو الله في السموات وفي الأرض يعلم سركم وجهركم ويعلم ما تكسبون\" أي هو المدعو الله في السموات والأرض."
    },
    {
      "ayah": 85,
      "surah": 43,
      "text": "أي هو خالقهما ومالكهما والمتصرف فيهما بلا مدافعة ولا ممانعة فسبحانه وتعالى عن الولد وتبارك أي استقر له السلامة من العيوب والنقائص لأنه الرب العلي العظيم المالك للأشياء الذي بيده أزمة الأمور نقضا وإبراما \"وعنده علم الساعة\" أي لا يجليها لوقتها إلا هو \"وإليه ترجعون\" أي فيجازي كلا بعمله إن خيرا فخير وإن شرا فشر."
    },
    {
      "ayah": 86,
      "surah": 43,
      "text": "\"ولا يملك الذين يدعون من دونه\" أي من الأصنام والأوثان \"الشفاعة\" أي لا يقدرون على الشفاعة لهم \"إلا من شهد بالحق وهم يعلمون\" هذا استثناء منقطع أي لكن من شهد بالحق على بصيرة وعلم فإنه تنفع شفاعته عنده بإذنه له."
    },
    {
      "ayah": 87,
      "surah": 43,
      "text": "أي ولئن سألت هؤلاء المشركين بالله العابدين معه غيره \"من خلقهم ليقولن الله\" أي هم يعترفون أنه الخالق للأشياء جميعها وحده لا شريك له في ذلك ومع هذا يعبدون معه غيره ممن لا يملك شيئا ولا يقدر على شيء فهم فى ذلك في غاية الجهل والسفاهة وسخافة العقل ولهذا قال تعالى \"فأنى يؤفكون\"."
    },
    {
      "ayah": 88,
      "surah": 43,
      "text": "أي وقال محمد صلى الله عليه وسلم قيله أي شكا إلى ربه شكواه من قومه الذين كذبوه فقال يا رب إن هؤلاء قوم لا يؤمنون كما أخبر تعالى في الآية الأخرى \"وقال الرسول يا رب إن قومي اتخذوا هذا القرآن مهجورا\" وهذا الذي قلناه هو قول ابن مسعود رضي الله عنه ومجاهد وقتادة وعليه فسر ابن جرير قال البخاري وقرأ عبدالله يعني ابن مسعود رضي الله عنه \"وقال الرسول يا رب\" وقال مجاهد في قوله \"وقيله يا رب إن هؤلاء قوم لا يؤمنون\" قال يؤثر الله عز وجل قول محمد صلى الله عليه وسلم وقال قتادة هو قول نبيكم صلى الله عليه وسلم يشكو قومه إلى ربه عز وجل ثم حكى ابن جرير في قوله تعالى \"وقيله يا رب\" قراءتين إحداهما النصب ولها توجيهان أحدهما أنه معطوف على قوله تبارك وتعالى \"نسمع سرهم ونجواهم\" والثاني أن يقدر فعل وقال قيله والثانية الخفض وقيله عطفا على قوله \"وعنده علم الساعة\" وتقديره وعلم قيله."
    },
    {
      "ayah": 89,
      "surah": 43,
      "text": "أي المشركين \"وقل سلام\" أي لا تجاوبهم بمثل ما يخاطبونك به من الكلام السيء ولكن تألفهم واصفح عنهم فعلا وقولا \"فسوف يعلمون\" هذا تهديد من الله تعالى لهم ولهذا أحل بهم بأسه الذي لا يرد وأعلى دينه وكلمته وشرع بعد ذلك الجهاد والجلاد حتى دخل الناس فى دين الله أفواجًا وانتشر الإسلام في المشارق والمغارب والله أعلم. آخر تفسير سورة الزخرف."
    },
    {
      "ayah": 9,
      "surah": 43,
      "text": "يقول تعالى ولئن سألت يا محمد هؤلاء المشركين بالله العابدين معه غيره \"من خلق السماوات والأرض ليقولن خلقهن العزيز العليم\" أي ليعترفن بأن الخالق لذلك هو الله وحده لا شريك له وهم مع هذا يعبدون معه غيره من الأصنام والأنداد."
    }
  ]
}
