{
  "ayahs": [
    {
      "ayah": 1,
      "surah": 44,
      "text": "سورة الدخان: قال الترمذي حدثنا سفيان بن وكيع حدثنا زيد بن الحباب عن عمرو بن أبي خثعم عن يحيى بن أبى كثير عن أبي سلمة عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم \"من قرأ حم الدخان في ليلة أصبح يستغفر له سبعون ألف ملك\" ثم قال غريب لا نعرفه إلا من هذا الوجه وعمرو بن أبي خثعم يضعف قال البخاري منكر الحديث ثم قال حدثنا نصر بن عبدالرحمن الكوفي حدثنا زيد بن الحباب عن هشام أبي المقدام عن الحسن عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم \"من قرأ حم الدخان في ليلة الجمعة غفر له\" ثم قال غريب لا نعرفه إلا من هذا الوجه وهشام أبو المقدام يضعف والحسن لم يسمع من أبي هريرة رضي الله عنه كذا قال أيوب ويونس بن عبيد وعلي بن زيد رحمة الله عليهم أجمعين: وفي مسند البزار من رواية أبي الطفيل عامر بن واثلة عن زيد بن حارثة أن رسول الله صلى الله عليه وسلم قال لابن صياد \"إني قد خبأت خبأ فما هو\" وخبأ له رسول الله صلى الله عليه وسلم سورة الدخان فقال هو الدخ فقال \"اخسأ ما شاء الله\" ثم انصرف. بسم الله الرحمن الرحيم يقول تعالى مخبرا عن القرآن العظيم."
    },
    {
      "ayah": 10,
      "surah": 44,
      "text": "\"فارتقب يوم تأتي السماء بدخان مبين\" قال سليمان بن مهران الأعمش عن أبي الضحى مسلم بن صبيح عن مسروق قال دخلنا المسجد يعني مسجد الكوفة عند أبواب كندة فإذا رجل يقص على أصحابه \"يوم تأتي السماء بدخان مبين\" تدرون ما ذلك الدخان؟ ذلك دخان يأتي يوم القيامة فيأخذ بأسماع المنافقين وأبصارهم ويأخذ المؤمنين منه شبه الزكام قال فأتينا ابن مسعود رضي الله عنه فذكرنا ذلك له وكان مضطجعا ففزع فقعد وقال إن الله عز وجل قال لنبيكم صلى الله عليه وسلم \"قل ما أسألكم عليه من أجر وما أنا من المتكلفين\" إن من العلم أن يقول الرجل لما لا يعلم الله أعلم سأحدثكم عن ذلك إن قريشا لما أبطأت عن الإسلام واستعصت على رسول الله صلى الله عليه وسلم دعا عليهم بسنين كسني يوسف فأصابهم من الجهد والجوع حتى أكلوا العظام والميتة وجعلوا يرفعون أبصارهم إلى السماء فلا يرون إلا الدخان وفي رواية فجعل الرجل ينظر إلى السماء فيرى ما بينه وبينها كهيئة الدخان من الجهد قال الله تعالى \"فارتقب يوم تأتي السماء بدخان مبين يغشى الناس هذا عذاب أليم\" فأتى رسول الله صلى الله عليه وسلم فقيل له يا رسول الله استسق الله لمضر فإنها قد هلكت فاستسقى صلى الله عليه وسلم لهم فسقوا فنزلت \"إنا كاشفوا العذاب قليلا إنكم عائدون\" قال ابن مسعود رضي الله عنه فيكشف عنهم العذاب يوم القيامة فلما أصابهم الرفاهية عادوا إلى حالهم فأنزل الله عز وجل \"يوم نبطش البطشة الكبرى إنا منتقمون\" قال يعني يوم بدر قال ابن مسعود رضي الله عنه فقد مضى خمسة: الدخان والروم والقمر والبطشة واللزام وهذا الحديث مخرج في الصحيحين ورواه الإمام أحمد في مسنده وهو عند الترمذي والنسائي في تفسيريهما وعند ابن جرير وابن أبي حاتم من طرق متعددة عن الأعمش به وقد وافق ابن مسعود رضي الله عنه على تفسير الأية بهذا وأن الدخان مضى جماعة من السلف: كمجاهد وأبى العالية وإبراهيم النخعي والضحاك وعطية العوفي وهو اختيار ابن جرير وقال ابن أبي حاتم حدثنا أبي حدثنا جعفر بن مسافر حدثنا يحيى بن حسان حدثنا ابن لهيعة حدثنا عبدالرحمن الأعرج في قوله عز وجل \"يوم تأتي السماء بدخان مبين\" قال كان يوم فتح مكة وهذا القول غريب جدا بل منكر وقال أخرون لم يمض الدخان بعد بل هو من أمارات الساعة كما تقدم من حديث أبي سريحة حذيفة بن أسيد الغفاري رضي الله عنه قال أشرف علينا رسول الله صلى الله عليه وسلم من غرفة ونحن نتذاكر الساعة فقال صلى الله عليه وسلم \"لا تقوم الساعة حتى تروا عشر آيات: طلوع الشمس من مغربها والدخان والدابة وخروج يأجوج ومأجوج وخروج عيسى بن مريم والدجال وثلاثة خسوف: خسف بالمشرق وخسف بالمغرب وخسف بجزيرة العرب ونار تخرج من قعر عدن تسوق الناس - أو تحشر الناس - تبيت معهم حيث باتوا وتقيل معهم حيث قالوا\" تفرد بإخراجه مسلم في صحيحه وفي الصحيحين أن رسول الله صلى الله عليه وسلم قال لابن صياد \"إنى خبأت لك خبأ\" قال هو الدخ فقال صلى الله عليه وسلم له \"اخسأ فلن تعدو قدرك\" قال وخبأ له رسول الله صلى الله عليه وسلم \"فارتقب يوم تأتي السماء بدخان مبين\" وهذا فيه إشعار بأنه من المنتظر المرتقب وابن صياد كاشف على طريقة الكهان بلسان الجان وهم يقرظون العبارة ولهذا قال هو الدخ يعني الدخان فعندها عرف رسول الله صلى الله عليه وسلم مادته وأنها شيطانية فقال صلى الله عليه وسلم \"اخسأ فلن تعدو قدرك\" ثم قال ابن جرير وحدثني عصام بن رواد بن الجراح حدثنا أبي حدثنا سفيان بن أبي سعيد الثوري حدثنا منصور بن المعتمر عن ربعي بن حراش قال سمعت حذيفة بن اليمان رضي الله عنه يقول: قال رسول الله صلى الله عليه وسلم \"إن أول الآيات الدجال ونزول عيسى بن مريم عليهما الصلاة والسلام ونار تخرج من قعر عدن أبين تسوق الناس إلى المحشر تقيل معهم إذا قالوا والدخان - قال حذيفة رضي الله عنه يا رسول الله وما الدخان؟ فتلا رسول الله صلى الله عليه وسلم هذه الآية \"فارتقب يوم تأتي السماء بدخان مبين يغشى الناس هذا عذاب أليم\" - يملأ ما بين المشرق والمغرب يمكث أربعين يوما وليلة وأما المؤمن فيصيبه منه كهيئة الزكمة وأما الكافر فيكون بمنزله السكران يخرج من منخريه وأذنيه ودبره\" قال ابن جرير لو صح هذا الحديث لكان فاصلا وإنما لم أشهد له بالصحة لأن محمد بن خلف العسقلاني حدثني أنه سأل روادا عن هذا الحديث هل سمعه من سفيان؟ فقال له لا قال أقرأته عليه؟ قال لا قال: فقلت له أقرأ عليه وأنت حاضر فأقربه فقال لا فقلت له فمن أين جئت به فقال جاءني به قوم فعرضوه علي وقالوا لى سمعه منا فقرءوه علي ثم ذهبوا فحدثوا به عني أو كما قال وقد أجاد ابن جرير في هذا الحديث ههنا فإنه موضوع بهذا السند وقد أكثر ابن جرير من سياقه في أماكن من هذا التفسير وفيه منكرات كثيرة جدا ولا سيما في أول سورة بني إسرائيل في ذكر المسجد الأقصى والله أعلم وقال ابن جرير أيضا حدثني محمد بن عوف حدثنا محمد بن إسماعيل بن عياش حدثني أبي حدثني ضمضم بن زرعة عن شريح بن عبيد عن أبي مالك الأشعري رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم \"إن ربكم أنذركم ثلاثا الدخان يأخذ المؤمن كالزكمة ويأخذ الكافر فينتفخ حتى يخرج من كل مسمع منه والثانية الدابة والثالثة الدجال\" ورواه الطبراني عن هاشم بن يزيد عن محمد بن إسماعيل بن عياش به وهذا إسناد جيد وقال ابن أبي حاتم حدثنا أبو زرعة حدثنا صفوان حدثنا الوليد حدثنا خليل عن الحسن عن أبي سعيد الخدري رضي الله عنه أن رسول الله صلى الله عليه وسلم قال \"يهيج الدخان بالناس فأما المؤمن فيأخذه كالزكمة وأما الكافر فينفخه حتى يخرج من كل مسمع منه\" ورواه سعيد بن أبي عروبة عن قتادة عن الحسن عن أبي سعيد الخدري رضي الله عنه موقوفا وروى سعيد بن عوف عن الحسن مثله. وقال ابن أبي حاتم حدثنا أبي حدثنا عبدالله بن صالح بن مسلم حدثنا إسرائيل عن أبي إسحاق عن الحارث عن علي رضي الله عنه قال: لم تمض آية الدخان بعد يأخذ المؤمن كهيئة الزكام وتنفخ الكافر حتى ينفذ. وروى ابن جرير من حديث الوليد بن جميع عن عبدالملك بن المغيرة عن عبدالرحمن بن السليماني عن ابن عمر رضي الله عنهما قال: يخرج الدخان فيأخذ المؤمن كهيئة الزكام ويدخل مسامع الكافر والمنافق حتى يكون كالرأس الحنيذ أي المشوي على الرضف ثم قال ابن جرير حدثني يعقوب حدثنا ابن علية عن ابن جريج عن عبدالله بن أبي مليكة قال غدوت على ابن عباس رضي الله عنهما ذات يوم فقال ما نمت الليلة حتى أصبحت قلت لم؟ قال: قالوا طلع الكوكب ذو الذنب فخشيت أن يكون الدخان قد طرق فما نمت حتى أصبحت وهكذا رواه ابن أبي حاتم عن أبيه عن ابن عمر عن سفيان عن عبدالله بن أبي يزيد عن عبدالله بن أبي مليكة عن ابن عباس رضي الله عنهما فذكره وهذا إسناد صحيح إلى ابن عباس رضي الله عنهما حبر الأمة وترجمان القرآن وهكذا قول من وافقه من الصحابة والتابعين رضي الله عنهم أجمعين مع الأحاديث المرفوعة من الصحاح والحسان وغيرهما التي أوردوها مما فيه مقنع ودلالة ظاهرة على أن الدخان من الآيات المنتظرة مع أنه ظاهر القرآن قال الله تبارك وتعالى \"فارتقب يوم تأتي السماء بدخان مبين\" أي بين واضح يراه كل أحد وعلى ما فسر به ابن مسعود رضي الله عنه إنما هو خيال رأوه في أعينهم من شدة الجوع والجهد."
    },
    {
      "ayah": 11,
      "surah": 44,
      "text": "قوله تعالى \"يغشى الناس\" أي يتغشاهم ويعميهم ولو كان أمرا خياليا يخص أهل مكة المشركين لما قيل فيه \"يغشى الناس\". وقوله تعالى \"هذا عذاب اليم\" أي يقال لهم ذلك تقريعا وتوبيخا كقوله عز وجل \"يوم يدعون إلى نار جهنم دعا هذه النار التي كنتم بها تكذبون\" أو يقول بعضهم لبعض ذلك."
    },
    {
      "ayah": 12,
      "surah": 44,
      "text": "قوله سبحانه وتعالى \"ربنا اكشف عنا العذاب إنا مؤمنون\" أي يقول الكافرون إذا عاينوا عذاب الله وعقابه سائلين رفعه وكشفه عنهم كقوله جلت عظمته \"ولو ترى إذ وقفوا على النار فقالوا يا ليتنا نرد ولا نكذب بأيات ربنا ونكون من المؤمنين\" وكذا قوله جل و علا \"وأنذر الناس يوم يأتيهم العذاب فيقول الذين ظلموا ربنا أخرنا إلى أجل قريب نجب دعوتك ونتبع الرسل أو لم تكونوا أقسمتم من قبل مالكم من زوال\"."
    },
    {
      "ayah": 13,
      "surah": 44,
      "text": "قال جل وعلا ههنا \"أنى لهم الذكرى وقد جاءهم رسول مبين\" يقول كيف لهم بالتذكر وقد أرسلنا إليهم رسولا بين الرسالة والنذارة."
    },
    {
      "ayah": 14,
      "surah": 44,
      "text": "\"ثم تولوا عنه وقالوا معلم مجنون\" ومع هذا تولوا عنه وما وافقوه بل كذبوه وقالوا معلم مجنون وهذا كقوله جلت عظمته \"يوم يتذكر الإنسان وأنى له الذكرى\" الآية وكقوله عز وجل \"ولو ترى إذ فزعوا فلا فوت وأخذوا من مكان قريب وقالوا آمنا به وأنى لهم التناوش من مكان بعيد\" إلى آخر السورة."
    },
    {
      "ayah": 15,
      "surah": 44,
      "text": "قوله تعالى \"إنا كاشفوا العذاب قليلا إنكم عائدون\" يحتمل معنين \"أحدهما\" أنه يقول تعالى ولو كشفنا عنكم العذاب ورجعناكم إلى الدار الدنيا لعدتم إلى ما كنتم فيه من الكفر والتكذيب كقوله تعالى \"ولو رحمناهم وكشفنا ما بهم من ضر للجوا في طغيانهم يعمهون\" وكقوله جلت عظمته \"ولو ردوا لعادوا لما نهوا عنه وإنهم لكاذبون\" \"والثاني\" أن يكون المراد إنا مؤخرو العذاب عنكم قليلا بعد أنعقاد أسبابه ووصوله إليكم وأنتم مستمرون فيما أنتم فيه من الطغيان والضلال ولا يلزم من الكشف عنهم أن يكون باشرهم كقوله تعالى \"إلا قوم يونس لما آمنوا كشفنا عنهم عذاب الخزي في الحياة الدنيا ومتعناهم إلى حين\" ولم يكن العذاب باشرهم واتصل بهم بل كان قد انعقد سببه عليهم ولا يلزم أيضا أن يكونوا قد أقلعوا عن كفرهم ثم عادوا إليه قال الله تعالى إخبارا عن شعيب عليه السلام أنه قال لقومه حين قالوا لنخرجنك يا شعيب والذين آمنوا معك من قريتنا أو لتعودن في ملتنا قال أو لو كنا كارهين قد افترينا على الله كذبا إن عدنا في ملتكم بعد إذ نجانا الله منها وشعيب عليه السلام لم يكن قط على ملتهم وطريقتهم وقال قتادة إنكم عائدون إلى عذاب الله."
    },
    {
      "ayah": 16,
      "surah": 44,
      "text": "فسر ذلك ابن مسعود رضي الله عنه بيوم بدر وهذا قول جماعة ممن وافق ابن مسعود رضي الله عنه على تفسيره الدخان بما تقدم وروي أيضا عن ابن عباس رضي الله عنهما من رواية العوفي عنه وعن أبي بن كعب رضي الله عنه وهو محتمل والظاهر أن ذلك يوم القيامة وإن كان يوم بدر يوم بطشة أيضا قال ابن جرير حدثني يعقوب حدثنا ابن علية حدثنا خالد الحذاء عن عكرمة قال: قال ابن عباس رضي الله عنهما قال ابن مسعود رضي الله عنه: البطشة الكبرى يوم بدر وأنا أقول هي يوم القيامة وهذا إسناد صحيح عنه ربه يقول الحسن البصري وعكرمة في أصح الروايتين عنه والله أعلم."
    },
    {
      "ayah": 17,
      "surah": 44,
      "text": "يقول تعالى ولقد اختبرنا قبل هؤلاء المشركين قوم فرعون وهم قبط مصر \"وجاءهم رسول كريم\" يعني موسى كليمه عليه الصلاة والسلام."
    },
    {
      "ayah": 18,
      "surah": 44,
      "text": "\"أن أدوا إلى عباد الله\" كقوله عز وجل \"أن أرسل معنا بني إسرائيل ولا تعذبهم قد جئناك بأية من ربك والسلام على من اتبع الهدى\" وقوله جل وعلا \"إني لكم رسول أمين\" أي مأمون على ما أبلغكموه."
    },
    {
      "ayah": 19,
      "surah": 44,
      "text": "قوله تعالى \"وأن لا تعلوا على الله\" أي لا تستكبروا عن اتباع آياته والانقياد لحججه والإيمان ببراهينه كقوله عز وجل \"إن الذين يستكبرون عن عبادتي سيدخلون جهنم داخرين\" \"إنى آتيكم بسلطان مبين\" أي بحجة ظاهرة واضحة وهي ما أرسله الله تعالى به من الآيات البينات والأدلة القاطعات."
    },
    { "ayah": 2, "surah": 44, "text": "يقول تعالى مخبرا عن القرآن العظيم." },
    {
      "ayah": 20,
      "surah": 44,
      "text": "قال ابن عباس رضي الله عنهما وأبو صالح هو الرجم باللسان وهو الشتم وقال قتادة الرجم بالحجارة أي أعوذ بالله الذي خلقني وخلقكم من أن تصلوا إلي بسوء من قول أو فعل."
    },
    {
      "ayah": 21,
      "surah": 44,
      "text": "أي فلا تتعرضوا لي ودعوا الأمر بيني وبينكم مسالمة إلى أن يقضي الله بيننا فلما طال مقامه صلى الله عليه وسلم بين أظهرهم وأقام حجج الله تعالى عليهم كل ذلك وما زادهم ذك إلا كفرا وعنادا دعا ربه عليهم دعوة نفذت فيهم كما قال تبارك وتعالى \"وقال موسى ربنا إنك آتيت فرعون وملأه زينة وأموالا في الحياة الدنيا ربنا ليضلوا عن سبيلك ربنا اطمس على أموالهم واشدد على قلوبهم فلا يؤمنوا حتى يروا العذاب الأليم قال قد أجيبت دعوتكما فاستقيما\"."
    },
    {
      "ayah": 22,
      "surah": 44,
      "text": "هكذا قال ههنا \"فدعا ربه أن هؤلاء قوم مجرمون\" فعند ذلك أمره الله تعالى أن يخرج ببني إسرائيل من بين أظهرهم من غير أمر فرعون ومشاورته واستئذانه ولهذا قال جل جلاله."
    },
    {
      "ayah": 23,
      "surah": 44,
      "text": "كما قال تعالى \"ولقد أوحينا إلى موسى أن أسر بعبادي فاضرب لهم طريقا في البحر يبسا لا تخاف دركا ولا تخشى\"."
    },
    {
      "ayah": 24,
      "surah": 44,
      "text": "وذلك أن موسى عليه الصلاة والسلام لما جاوز هو وبنو إسرائيل البحر أراد موسى أن يضربه بعصاه حتى يعود كما كان ليصير حائلا بينهم وبين فرعون فلا يصل إليهم فأمره الله تعالى أن يتركه على حاله ساكنا وبشره بأنهم جند مغرقون فيه وأنه لا يخاف دركا ولا يخشى قال ابن عباس رضي الله عنهما واترك البحر رهوا كهيئه وامضه وقال مجاهد رهوا طريقا يبسا كهيئه يقول لا تأمره يرجع اتركه حتى يرجع آخرهم وكذا قال عكرمة والربيع بن أنس والضحاك وقتادة وابن زيد وكعب الأحبار وسماك بن حرب وغير واحد."
    },
    { "ayah": 25, "surah": 44, "text": "وهي البساتين \"وعيون وزروع\" والمراد بها الأنهار والآبار." },
    {
      "ayah": 26,
      "surah": 44,
      "text": "\"ومقام كريم\" وهي المساكن الأنيقة والأماكن الحسنة. وقال مجاهد وسعيد بن جبير \"ومقام كريم\" المنابر وقال ابن لهيعة عن وهب بن عبدالله المعافري عن عبدالله بن عمرو رضي الله تعالى عنهما قال نيل مصر سيد الأنهار سخر الله تعالى له كل نهر بين المشرق والمغرب وذلله له فإذا أراد الله عز وجل أن يجري نيل مصر أمر كل نهر أن يمده فأمدته الأنهار بمائها وفجر الله تبارك وتعالى له الأرض عيونا فإذا انتهى جريه إلى ما أراد الله جل وعلا أوحى الله تعالى إلى كل ماء أن يرجع إلى عنصره وقال في قول الله تعالى \"فأخرجناهم من جنات وعيون وزروع ومقام كريم ونعمة كانوا فيها فاكيهن\" قال كانت الجنان بحافتي نهر النيل من أوله إلى آخره في الشقين جميعا ما بين أسوان إلى رشيد وكان له تسع خليج: خليج الأسكندريه وخليج دمياط وخليج سردوس وخليج منف وخليج الفيوم وخليج المنتهى متصلة لا ينقطع منها شيء عن شيء وزرع ما بين الجبلين كله من أول مصر إلى آخر ما يبلغه الماء وكانت جميع أرض مصر تروى من ستة عشر ذراعا لما قدروا ودبروا من قناطرها وجسورها وخلجها."
    },
    {
      "ayah": 27,
      "surah": 44,
      "text": "\"ونعمة كانوا فيها فاكهين\" أي عيشة كانوا يتفكهون فيها فيأكلون ما شاءوا ويلبسون ما أحبوا مع الأموال والجاهات والحكم فى البلاد فسلبوا ذلك جميعه في صبيحة واحدة وفارقوا الدنيا وصاروا إلى جهنم وبئس المصير واستولى على البلاد المصرية وتلك الحواصل الفرعونية والممالك القبطية بنو إسرائيل كما قال تبارك وتعالى \"كذلك وأورثناها بنى إسرائيل\" وقال فى الآية الأخرى \"وأورثنا القوم الذين كانوا يستضعفون مشارق الأرض ومغاربها التي باركنا فيها وتمت كلمة ربك الحسنى على بني إسرائيل بما صبروا ودمرنا ما كان يصنع فرعون وقومه وما كانوا يعرشون\"."
    },
    { "ayah": 28, "surah": 44, "text": "قال عز وجل ههنا \"كذلك وأورثناها قوما آخرين\" وهم بنو إسرائيل كما تقدم." },
    {
      "ayah": 29,
      "surah": 44,
      "text": "قوله سبحانه وتعالى \"فما بكت عليهم السماء والأرض\" أي لم تكن لهم أعمال صالحة تصعد في أبواب السماء فتبكي على فقدهم ولا لهم في الأرض بقاع عبدوا الله تعالى فيها فقدتهم فلهذا استحقوا أن لا ينظروا ولا يؤخروا لكفرهم وإجرامهم وعتوهم وعنادهم. قال الحافظ أبو يعلى الموصلي في مسنده حدثنا أحمد بن إسحاق البصري حدثنا مكي بن إبراهيم حدثنا موسى بن عبيدة حدثني يزيد الرقاشي حدثني أنس بن مالك رضي الله عنه عن النبي صلى الله عليه وسلم قال \"ما من عبد إلا وله في السماء بابان: باب يخرج منه رزقه وباب يدخل منه عمله وكلامه فإذا مات فقداه وبكيا عليه \"وتلا هذه الآية \"فما بكت عليهم السماء والأرض\" وذكر أنهم لم يكونوا عملوا على الأرض عملا صالحا يبكي عليهم ولم يصعد لهم إلى السماء من كلامهم ولا من عملهم كلام طيب ولا عمل صالح فتفقدهم فتبكي عليهم ورواه ابن أبي حاتم من حديث موسى بن عبيدة وهو الربذي. وقال ابن جرير حدثني يحيى بن طلحة حدثني عيسى بن يونس عن صفوان بن عمرو عن شريح بن عبيد الحضرمي قال: قال رسول الله صلى الله عليه وسلم \"إن الإسلام بدأ غريبا وسيعود غريبا كما بدأ ألا لا غربة على مؤمن ما مات مؤمن في غربة غابت عنه فيها بواكيه إلا بكت عليه السماء والأرض - ثم قرأ رسول الله صلى الله عليه وسلم - فما بكت عليهم السماء والأرض - ثم قال - إنهما لا يبكيان على الكافر\" وقال ابن أبى حاتم حدثنا أحمد بن عصام حدثنا أبو أحمد يعني الزبيري حدثنا العلاء بن صالح عن المنهال بن عمرو عن عباد بن عبدالله قال سأل رجل عليا رضي الله عنه هل تبكي السماء والأرض على أحد؟ فقال له لقد سألتني عن شيء ما سألني عنه أحد قبلك إنه ليس من عبد إلا له مصلى فى الأرض مصعد عمله من السماء وإن آل فرعون لم يكن لهم عمل صالح في الأرض ولا عمل يصعد في السماء ثم قرأ علي رضي الله عنه \"فما بكت عليهم السماء والأرض وما كانوا منظرين\" وقال ابن جرير حدثنا أبو كريب حدثنا طلق بن غنام عن زائدة عن منصور عن منهال عن سعيد بن جبير قال أتى ابن عباس رضي الله عنهما رجل فقال يا أبا العباس أرأيت قول الله تعالى \"فما بكت عليهم السماء والأرض وما كانوا منظرين\" فهل تبكي السماء والأرض على أحد؟ قال رضي الله عنه نعم إنه ليس أحد من الخلائق إلا وله باب في السماء منه ينزل رزقه وفيه يصعد عمله فإذا مات المؤمن فأغلق بابه من السماء الذي كان يصعد فيه عمله وينزل منه رزقه ففقده بكى عليه وإذا فقده مصلاه من الأرض التي كان يصلي فيها ويذكر الله عز وجل فيها بكت عليه وإن قوم فرعون لم تكن لهم في الأرض آثار صالحة ولم يكن يصعد إلى الله عز وجل منهم خير فلم تبك عليهم السماء والأرض وروى العوفي عن ابن عباس نحو هذا. وقال سفيان الثوري عن أبي يحيى القتات عن مجاهد عن ابن عباس رضي الله عنهما قال: كان يقال تبكي الأرض على المؤمن أربعين صباحا وكذا قال مجاهد وسعيد بن جبير وغير واحد وقال مجاهد أيضا ما مات مؤمن إلا بكت عليه السماء والأرض أربعين صباحا قال: فقلت له أتبكي الأرض؟ فقال أتعجب؟ وما للأرض لا تبكي على عبد كان يعمرها بالركوع والسجود؟ وما للسماء لا تبكي على عبد كان لتكره وتسبيحه فيها دوي كدوي النحل. وقال قتادة كانوا أهون على الله عز وجل من أن تبكي عليهم السماء والأرض وقال ابن أبي حاتم حدثنا علي بن الحسين حدثنا عبدالسلام بن عاصم حدثنا إسحاق بن إسماعيل حدثنا المستورد بن سابق عن عبيد المكتب عن إبراهيم قال ما بكت السماء منذ كانت الدنيا إلا على اثنين قلت لعبيد أليس السماء والأرض تبكي على المؤمن؟ قال ذاك مقامه حيث يصعد عمله قال وتدري ما بكاء السماء؟ قلت لا قال تحمر وتصير وردة كالدهان: إن يحيى بن زكريا عليه الصلاة والسلام لما قتل احمرت السماء وقطرت دما وإن الحسين بن علي رضي الله عنهما لما قتل احمرت السماء. وحدثنا علي بن الحسين حدثنا أبو غسان محمد بن عمر وزنيج حدثنا جرير عن يزيد بن أبي زياد قال لما قتل الحسين بن علي رضي الله عنهما احمرت آقاق السماء أربعة أشهر قال يزيد واحمرارها بكاؤها وهكذا قال السدي في الكبير وقال عطاء الخراساني بكاؤها أن تحمر أطرافها وذكروا أيضا في مقتل الحسين رضي الله عنه أنه ما قلب حجر يومئذ إلا وجد تحته دم عبيط وأنه كسفت الشمس واحمر الأفق وسقطت حجارة وفي كل من ذلك نظر والظاهر أنه من سخف الشيعة وكذبهم ليعظموا الأمر ولا شك أنه عظيم ولكن لم يقع هذا الذي اختلقوه وكذبوه وقد وقع ما هو أعظم من قتل الحسين رضي الله عنه ولم يقع شيء مما ذكروه فإنه قد قتل أبوه علي بن أبي طالب رضي الله عنه وهو أفضل منه بالإجماع ولم يقع شيء من ذلك وعثمان بن عفان رضي الله عنه قتل محصورا مظلوما ولم يكن شيء من ذلك وعمر بن الخطاب رضي الله عنه قتل في المحراب في صلاة الصبح وكأن المسلمين لم تطرقهم مصيبة قبل ذلك ولم يكن شيء من ذلك وهذا رسول الله صلى الله عليه وسلم وهو سيد البشر في الدنيا والآخرة يوم مات لم يكن شيء مما ذكروه ويوم مات إبراهيم بن النبي صلى الله عليه وسلم خسفت الشمس فقال الناس خسفت لموت إبراهيم فصلى بهم رسول الله صلى الله عليه وسلم صلاة الكسوف وخطبهم وبين لهم أن الشمس والقمر لا ينخسفان لموت أحد ولا لحياته."
    },
    {
      "ayah": 3,
      "surah": 44,
      "text": "إنا أنزلناه في ليلة القدر وكان ذلك في شهر رمضان كما قال تبارك وتعالى \"شهر رمضان الذي أنزل فيه القرآن\" وقد ذكرنا الأحاديث الواردة في ذلك في سورة البقرة بما أغنى عن إعادته ومن قال إنها ليلة النصف من شعبان كما روي عن عكرمة فقد أبعد النجعة فإن نص القرآن أنها في رمضان. والحديث الذي رواه عبدالله بن صالح عن الليث عن عقيل عن الزهري أخبرني عثمان بن محمد بن المغيرة بن الأخنس قال: إن رسول الله صلى الله عليه وسلم قال \"تقطع الآجال من شعبان إلى شعبان حتى إن الرجل لينكح ويولد له وقد أخرج اسمه في الموتى\" فهو حديث مرسل ومثله لا يعارض به النصوص. وقوله عز وجل \"إنا كنا منذرين\" أي معلمين الناس ما ينفعهم ويضرهم شرعا لتقوم حجة الله على عباده."
    },
    {
      "ayah": 30,
      "surah": 44,
      "text": "قوله تبارك وتعالى \"ولقد نجينا بني إسرائيل من العذاب المهين من فرعون إنه كان عاليا من المسرفين\" يمتن عليهم تعالى بذلك حيث أنقذهم مما كانوا فيه من إهانة فرعون وإذلاله لهم وتسخيره إياهم في الأعمال المهينة الشاقة."
    },
    {
      "ayah": 31,
      "surah": 44,
      "text": "وقوله تعالى \"من فرعون إنه كان عاليا\" أي مستكبرا جبارا عنيدا كقوله عز وجل \"إن فرعون علا في الأرض \" وقوله جلت عظمته فاستكبروا وكانوا قوما عالين من المسرفين أي مسرف في أمره سخيف الرأي على نفسه."
    },
    {
      "ayah": 32,
      "surah": 44,
      "text": "قال مجاهد \"اخترناهم على علم على العالمين\" على من هم بين ظهريه وقال قتادة اختيروا على أهل زمانهم ذلك وكان يقال إن لكل زمان عالما وهذا كقوله تعالى \"قال يا موسى إنى اصطفيتك على الناس\" أي أهل زمانه ذلك كقوله عز وجل لمريم عليها السلام \"واصطفاك على نساء العالمين\" أي في زمنها فإن خديجة رضي الله عنها إما أفضل منها أو مساوية لها في الفضل وكذا آسية بنت مزاحم امرأة فرعون وفضل عائشة رضي الله عنه على النساء كفضل الثريد على سائر الطعام."
    },
    {
      "ayah": 33,
      "surah": 44,
      "text": "قوله جل جلاله \"وآتيناهم من الآيات\" أي الحجج والبراهين وخوارق العادات \"ما فيه بلاء مبين\" أي اختبار ظاهر جلي لمن اهتدى به."
    },
    {
      "ayah": 34,
      "surah": 44,
      "text": "يقول تعالى منكرا على المشركين فى إنكارهم البعث والمعاد وأنه ما ثم إلا هذه الحياة الدنيا ولا حياة بعد الممات ولا بعث ولا نشور ويحتجون بأبائهم الماضين الذين ذهبوا فلم يرجعوا فإن كان البعث حقا \"فأتوا بأبائنا إن كنتم صادقين\"."
    },
    {
      "ayah": 35,
      "surah": 44,
      "text": "يقول تعالى منكرا على المشركين فى إنكارهم البعث والمعاد وأنه ما ثم إلا هذه الحياة الدنيا ولا حياة بعد الممات ولا بعث ولا نشور ويحتجون بأبائهم الماضين الذين ذهبوا فلم يرجعوا فإن كان البعث حقا \"فأتوا بأبائنا إن كنتم صادقين\"."
    },
    {
      "ayah": 36,
      "surah": 44,
      "text": "وهذه حجة باطلة وشبهة فاسدة فإن المعاد إنما هو يوم القيامة لا في الدار الدنيا بل بعد انقضائها \"وذهابها\" وفراغها يعيد الله العالمين خلقا جديدا ويجعل الظالمين لنار جهنم وقودا يوم تكونوا شهداء على الناس ويكون الرسول عليكم شهيدا."
    },
    {
      "ayah": 37,
      "surah": 44,
      "text": "ثم قال تعالى متهددا لهم ومتوعدا ومنذرا لهم بأسه الذي لا يرد كما حل بأشباههم ونظرائهم من المشركين المنكرين للبعث كقوم تبع وهم سبأ حيث أهلكهم الله عز وجل وخرب بلادهم وشردهم في البلاد وفرقهم شذر مذر كما تقدم ذلك في سورة سبأ وهي مصدرة بإنكار المشركين للمعاد وكذلك ههنا شبههم بأولئك وقد كانوا عربا من قحطان كما أن هؤلاء عرب من عدنان وقد كانت حمير وهم سبأ كلما ملك فيهم رجل سموه تبعا كما يقال كسرى لمن ملك الفرس وقيصر لمن ملك الروم وفرعون لمن ملك مصر كافرا والنجاشي لمن ملك الحبشة وغير ذلك من أعلام الأجناس ولكن اتفق أن بعض تبابعتهم خرج من اليمن وسار في البلاد حتى وصل إلى سمرقند واشتد ملكه وعظم سلطانه وجيشه واتسعت مملكته وبلاده وكثرت رعاياه وهو الذي مصر الحيرة فاتفق أنه مر بالمدينة النبوية وذلك في أيام الجاهلية فأراد قتال أهلها فمانعوه وقاتلوه بالنهار وجعلوا يقرونه الليل فاستحيا منهم وكف عنهم واستصحب معه حبرين من أحبار يهود كانا قد نصحاه وأخبراه أنه لا سبيل له على هذه البلدة فإنها مهاجر نبي يكون في آخر الزمان فرجع عنها وأخذهما معه إلى بلاد اليمن ا فلما اجتاز بمكة أراد هدم الكعبة فنهيناه عن ذلك أيضا وأخبراه بعظمة هذا البيت وأنه من بناء إبراهيم الخليل عليه الصلاة والسلام وأنه سيكون له شأن عظيم على يدي ذلك النبي المبعوث في آخر الزمان فعظمها وطاف بها وكساها الملاء والوصائل والحبر ثم كر راجعا إلى اليمن ودعا أهلها إلى اليهود معه وكان إذا ذاك دين موسى عليه الصلاة والسلام فيه من يكون على الهداية قبل بعثة المسيح عليه الصلاة والسلام فتهود معه عامة أهل اليمن وقد ذكر القصة بطولها الإمام محمد بن إسحاق في كتابه السيرة وقد ترجمه الحافظ ابن عساكر في تاريخه ترجمة حافلة أورد فيها أشياء كثيرة مما ذكرنا ومما لم يذكر وذكر أنه ملك دمشق وأنه كان إذا استعرض الخيل صفت له من دمشق إلى اليمن ثم ساق من طريق عبدالرزاق عن معمر عن ابن أبي ذئب عن المقبري عن أبي هريرة رضي الله عنه عن النبي صلى الله عليه وسلم قال \"ما أدري الحدود طهارة لأهلها أم لا؟ ولا أدري تبع لعينا كان أم لا؟ ولا أدري ذو القرنين نبيا كان أم ملكا\" وقال غيره \"عزير أكان نبيا أم لا؟\" وهكذا رواه ابن أبن حاتم عن محمد بن حماد الظهراني عن عبدالرزاق قال الدارقطني تفرد به عبدالرزاق. ثم روى ابن عساكر من طريق محمد بن كريب عن أبيه عن ابن عباس رضي الله عنهما مرفوعا \"عزير لا أدري أنبيا كان أم لا؟ ولا أدري ألعين تبع أم لا؟\" ثم أورد ما جاء في النهي عن سبه ولعنته كما سيأتي إن شاء الله تعالى وكأنه والله أعلم كان كافرا ثم أسلم وتابع دين الكليم على يدي من كان من أحبار اليهود في ذلك الزمان على الحق قبل بعثة المسيح عليه السلام وحج البيت في زمن الجرهميين وكساه الملاء والوصائل من الحرير والحبر ونحر عنده ستة آلاف بدنة وعظمه وأكرمه ثم عاد إلى اليمن وقد ساق قصته بطولها الحافظ ابن عساكر من طرق متعددة مطوله مبسوطة عن أبي بن كعب وعبدالله بن سلام وعبدالله بن عباس رضي الله عنهم وكعب الأحبار وإليه المرجع في ذلك كله وإلى عبدالله بن سلام أيضا وهو أثبت وأكبرو أعلم وكذا روى قصته وهب بن منبه ومحمد بن إسحاق فى السيرة كما هو مشهور فيها. وقد اختلط عل الحافظ ابن عساكر في بعض السياقات ترجمة تبع هذا بترجمة آخر متأخر عنه بدهر طويل فإن تبعا هذا المشار إليه في القرآن أسلم قومه على يديه ثم لما توفي عادوا بعده إلى عبادة النيران والأصنام فعاقبهم الله تعالى كما ذكره في سورة سبأ وقد بسطنا قصتهم هنالك وللّه الحمد والمنة وقال سعيد بن جبير كسا تبع الكعبة وكان سعيد ينهى عن سبه وتبع هذا هو تبع الأوسط واسمه أسعد أبو كريب بن مليكرب اليماني ذكروا أنه ملك على قومه ثلاثمائة سنة وستا وعشرين سنة ولم يكن فى حمر أطول مدة منه وتوفي قبل مبعث رسول الله صلى الله عليه وسلم بنحو من سبعمائة سنة. وذكروا أنه لما ذكر له الحبران من يهود المدينة أن هذه البلدة مهاجر نبي في آخر الزمان اسمه أحمد قال في ذلك شعرا واستودعه عند أهل المدينة فكانوا يتوارثونه ويروونه خلفا عن سلف وكان ممن يحفظه أبو أيوب خالد بن زيد الذي نزل رسول الله صلى الله عليه وسلم في داره وهو: شهدت على أحمد أنه رسول من الله باري النسم فلو مد عمري إلى عمره لكنت وزيرا له وابن عم وجاهدت بالسيف أعداءه وفرجت من صدره كل غم وذكر ابن أبي الدنيا أنه حفر قبر بصنعاء فى الإسلام فوجدوا فيه امرأتين صحيحتين وعند رءوسهما لوح من فضة مكتوب فيه بالذهب: هذا قبر حيي وتميس وروي حيي وتماضر ابنتي تبع ماتتا وهما تشهدان أن لا إله إلا الله ولا تشركان به شيئا وعلى ذلك مات الصالحون قبلهما وقد ذكرنا في سورة سبأ شعر سبأ في ذلك أيضا قال قتادة ذكر لنا أن كعبا كان يقول في تبع نعت الرجل الصالح ذم الله تعالى قومه ولم يذمه قال وكانت عائشة رضي الله عنها تقول: لا تسبوا تبعا فإنه قد كان رجلا صالحا. وقال ابن أبي حاتم حدثنا أبو زرعة حدثنا صفوان حدثنا الوليد حدثنا عبدالله بن لهيعة عن أبي زرعة - يعني عمرو بن جابر الحضرمي - قال سمعت سهل بن سعد الساعدي رضي الله عنه يقول قال رسول الله صلى الله عليه وسلم \"لا تسبوا تبعا فإنه قد كان أسلم\" ورواه الإمام أحمد في مسنده عن حسن بن موسى عن ابن لهيعة به. وقال الطبراني حدثنا أحمد بن علي الأبار حدثنا أحمد بن محمد بن أبي برزة حدثنا مؤمل بن إسماعيل حدثنا سفيان عن سماك بن حرب عن عكرمة عن ابن عباس رضي الله عنهما عن النبي صلى الله عليه وسلم قال: \"لا تسبوا تبعا فإنه قد أسلم\" وقال عبدالرزاق أيضا أخبرنا معمر عن ابن أبي ذئب عن المقبري عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم \"ما أدري تبع نبيا كان أم غير نبي\" وتقدم بهذا السند من رواية ابن أبي حاتم كما أورده ابن عساكر \"لا أدري تبع كان لعينا أم لا\" فالله أعلم. ورواه ابن عساكر من طريق زكريا بن يحيى المدني عن عكرمة عن ابن عباس موقوفا وقال عبدالرزاق أخبرنا عمران أبو الهذيل أخبرني تميم بن عبدالرحمن قال: قال عطاء بن أبي رباح لا تسبوا تبعا فإن رسول الله صلى الله عليه وسلم نهى عن سبه والله تعالى أعلم."
    },
    {
      "ayah": 38,
      "surah": 44,
      "text": "يقول تعالى مخبرا عن عدله وتنزيهه نفسه عن اللعب والعبث والباطل كقوله جل وعلا \"وما خلقنا السماء والأرض وما بينهما باطلا ذلك ظن الذين كفروا فويل للذين كفروا من النار\"."
    },
    {
      "ayah": 39,
      "surah": 44,
      "text": "قال تعالى \"أفحسبتم أنما خلقناكم عبثا وأنكم إلينا لا ترجعون فتعالى الله الملك الحق لا إله إلا هو رب العرش الكريم\"."
    },
    {
      "ayah": 4,
      "surah": 44,
      "text": "قال عز وجل \"فيها يفرق كل أمر حكيم\" أي في ليلة القدر يفصل من اللوح المحفوظ إلى الكتبة أمر السنة وما يكون فيها من الآجال والأرزاق وما يكون فيها إلى آخرها وهكذا روي عن ابن عمر ومجاهد وأبي مالك والضحاك وغير واحد من السلف. وقوله جل وعلا \"حكيم\" أي محكم لا يبدل ولا يغير."
    },
    {
      "ayah": 40,
      "surah": 44,
      "text": "قال تعالى \"إن يوم الفصل ميقاتهم أجمعين\" وهو يوم القيامة يفصل الله تعالى فيه بين الخلائق فيعذب الكافرين ويثيب المؤمنين وقوله عز وجل \"ميقاتهم أجمعين\" أي يجمعهم كلهم أولهم وآخرهم."
    },
    {
      "ayah": 41,
      "surah": 44,
      "text": "\"يوم لا يغني مولى عن مولى شيئا\" أي لا ينفع قريب قريبا كقوله سبحانه وتعالى \"فإذا نفخ في الصور فلا أنساب بينهم يومئذ ولا يتساءلون\" وكقوله جلت عظمته \"ولا يسأل حميم حميما يبصرونهم\" أي لا يسأل أخا له عن حاله وهو يراه عيانا. وقوله جل وعلا \"ولا هم ينصرون\" أي لا ينصر القريب قريبه ولا يأتيه نصره من خارج."
    },
    {
      "ayah": 42,
      "surah": 44,
      "text": "قال \"إلا من رحم الله\" أي لا ينفع يومئذ إلا رحمة الله عز وجل بخلقه \"إنه هو العزيز الرحيم\" أي هو عزيز ذو رحمة واسعة."
    },
    {
      "ayah": 43,
      "surah": 44,
      "text": "يقول تعالى مخبرا عما يعذب به الكافرين الجاحدين للقائه \"إن شجرة طعام الأثيم\" والأثيم أي في قوله وفعله وهو الكافر وذكر غير واحد أنه أبو جهل ولا شك في دخوله في هذه الآية ولكن ليست خاصة به قال ابن جرير حدثنا محمد بن بشار حدثنا عبدالرحمن حدثنا سفيان عن الأعمش عن إبراهيم عن همام بن الحارث أن أبا الدرداء كان يقرئ رجلا \"إن شجرة الزقوم طعام الأثيم\" فقال طعام اليتيم فقال أبو الدرداء رضي الله عنه قل إن شجرة الزقوم طعام الفاجر أي ليس له طعام من غيرها قال مجاهد ولو وقعت قطرة منها في الأرض لأفسدت على أهل الأرض معايشهم وقد مقدم نحوه مرفوعا."
    },
    {
      "ayah": 44,
      "surah": 44,
      "text": "\"طعام الأثيم\" والأثيم أي في قوله وفعله وهو الكافر وذكر غير واحد أنه أبو جهل ولا شك في دخوله في هذه الآية ولكن ليست خاصة به قال ابن جرير حدثنا محمد بن بشار حدثنا عبدالرحمن حدثنا سفيان عن الأعمش عن إبراهيم عن همام بن الحارث أن أبا الدرداء كان يقرئ رجلا \"إن شجرة الزقوم طعام الأثيم\" فقال طعام اليتيم فقال أبو الدرداء رضي الله عنه قل إن شجرة الزقوم طعام الفاجر أي ليس له طعام من غيرها قال مجاهد ولو وقعت قطرة منها في الأرض لأفسدت على أهل الأرض معايشهم وقد مقدم نحوه مرفوعا."
    },
    { "ayah": 45, "surah": 44, "text": "قوله \"كالمهل\" قالوا كعكر الزيت \"يغلي في البطون\"." },
    { "ayah": 46, "surah": 44, "text": "\"كغلي الحميم\" أي من حرارتها ورداءتها." },
    {
      "ayah": 47,
      "surah": 44,
      "text": "قوله \"خذوه أي الكافر وقد ورد أنه تعالى إذا قال للزبانية خذوه ابتدره سبعون ألفا منهم وقوله \"فاعتلوه\" أي سوقوه سحبا ودفعا في ظهره قال مجاهد \"خذوه فاعتلوه\" أي خذوه فادفعوه; وقال الفرزدق: ليس الكرام بناحليك أباهم حتى ترد إلى عطية تعتل \"إلى سواء الجحيم\" أي وسطها."
    },
    {
      "ayah": 48,
      "surah": 44,
      "text": "\"ثم صبوا فوق رأسه من عذاب الحميم\" كقوله عز وجل \"يصب من فوق رءوسهم الحميم يصهر به ما في بطونهم والجلود\" وقد تقدم أن الملك يضربه بمقمعة من حديد فتفتح دماغه ثم يصب الحميم على رأسه فينزل في بدنه فيسلت ما في بطنه من أمعائه حتى تمرق من كعبيه - أعاذنا الله تعالى من ذلك."
    },
    {
      "ayah": 49,
      "surah": 44,
      "text": "قوله تعالى \"ذق إنك أنت العزيز الكريم\" أي قولوا له ذلك على وجه التهكم والتوبيخ وقال الضحاك عن ابن عباس أي لست بعزيز ولا كريم. وقد قال الأموي في مغازيه حدثنا أسباط بن محمد حدثنا أبو بكر الهذلي عن عكرمة قال لقى رسول الله صلى الله عليه وسلم أبا جهل لعنه الله فقال \"إن الله تعالى أمرني أن أقول لك أولى لك فأولى ثم أولى لك فأولى\" قال فنزع ثوبه من يده وقال ما تستطيع لي أنت ولا صاحبك من شيء ولقد علمت أني أمنع أهل البطحاء وأنا العزيز الكريم قال فقتله الله تعالى يوم بدر وأذله وعيره بكلمته وأنزل \"ذق إنك أنت العزيز الكريم\"."
    },
    {
      "ayah": 5,
      "surah": 44,
      "text": "\"أمرا من عندنا\" أي جميع ما يكون ويقدره الله تعالى وما يوحيه فبأمره وإذنه وعلمه \"إنا كنا مرسلين\" أي إلى الناس رسولا يتلو عليهم آيات الله مبينات فإن الحاجة كانت ماسة إليه."
    },
    {
      "ayah": 50,
      "surah": 44,
      "text": "قوله عز وجل \"إن هذا ما كنتم به تمترون\" كقوله تعالى \"يوم يدعون إلى نار جهنم دعا هذه النار التي كنتم بها تكذبون أفسحر هذا أم أنتم لا تبصرون\" ولهذا قال تعالى ههنا \"إن هذا ما كنتم به تمترون\"."
    },
    {
      "ayah": 51,
      "surah": 44,
      "text": "لما ذكر تعالى حال الأشقياء عطف بذكر السعداء ولهذا سمي القرآن مثاني فقال \"إن المتقين\" أي لله في الدنيا \"في مقام أمين\" أي في الآخرة وهو الجنة قد أمنوا فيها من الموت والخروج ومن كل هم وحزن وجزع وتعب ونصب ومن الشيطان وكيده وسائر الآفات والمصائب."
    },
    { "ayah": 52, "surah": 44, "text": "\"في جنات وعيون\" وهذا في مقابلة ما أولئك فيه من شجرة الزقوم وشرب الحميم." },
    {
      "ayah": 53,
      "surah": 44,
      "text": "قوله تعالى \"يلبسون من سندس\" وهو رفيع الحرير كالقمصان ونحوها \"وإستبرق\" وهو ما فيه بريق ولمعان وذلك كالرياش وما يلبس على أعالي القماش \"متقابلين\" أي على السرر لا يجلس أحد منهم وظهره إلى غيره."
    },
    {
      "ayah": 54,
      "surah": 44,
      "text": "قوله تعالى كذلك \"وزوجناهم بحور عين\" أي هذا العطاء مع ما قد منحناهم من الزوجات الحسان الحور العين اللاتي \"لم يطمثهن إنس قبلهم ولا جان\" \"كأنهن الياقوت والمرجان\" \"هل جزاء الإحسان إلا الإحسان\" قال ابن أبي حاتم حدثنا أبي حدثنا نوح بن حبيب حدثنا نصر بن مزاحم العطار حدثنا عمر بن سعد عن رجل عن أنس رضي الله عنه رفعه نوح قال: لو أن حوراء بزقت في بحر لجي لعذب الماء لعذوبة ريقها."
    },
    {
      "ayah": 55,
      "surah": 44,
      "text": "قوله عز وجل \"يدعون فيها بكل فاكهة آمنين\" أي مهما طلبوا من أنواع الثمار أحضر لهم وهم آمنون من انقطاعه وامتناعه بل يحضر إليهم كلما أرادوا."
    },
    {
      "ayah": 56,
      "surah": 44,
      "text": "قوله \"لا يذوقون فيها الموت إلا الموتة الأولى\" هذا استثناء يؤكد النفي فإنه استثناء منقطع ومعناه أنهم لا يذوقون فيها الموت أبدا كما ثبت في الصحيحين أن رسول الله صلى الله عليه وسلم قال \"يؤتى بالموت في صورة كبش أملح فيوقف بين الجنة والنار ثم يذبح ثم يقال يا أهل الجنة خلود فلا موت ويا أهل النار خلود فلا موت\" وقد تقدم الحديث في سورة مريم عليها السلام. وقال عبدالرزاق حدثنا سفيان الثوري عن أبي إسحاق عن أبي مسلم الأغر عن أبي سعيد وأبي هريرة رضي الله عنهما قالا: قال رسول الله صلى الله عليه وسلم \"يقال لأهل الجنة إن لكم أن تصحوا فلا تسقموا أبدا وإن لكم أن تعيشوا فلا تموتوا أبدا وإن لكم أن تنعموا فلا تبأسوا أبدا وإن لكم أن تشبوا فلا تهرموا أبدا\" رواه مسلم عن إسحاق بن راهويه وعبد بن حميد كلاهما عن عبدالرزاق به هكذا يقول أبو إسحاق وأهل العراق أبو مسلم الأغر وأهل المدينة يقولون أبو عبدالله الأغر. وقال أبو بكر بن أبي داود السجستاني حدثنا أحمد بن حفص عن أبيه عن إبراهيم بن طهمان عن الحجاج هو ابن حجاج عن عبادة عن عبدالله بن عمرو عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم \"من اتقى الله دخل الجنة ينعم فيها ولا يبأس ويحيا فيها فلا يموت لا تبلي ثيابه ولا يفنى شبابه\" وقال أبو القاسم الطبراني حدثنا أحمد بن يحيى حدثنا عمرو بن محمد الناقد حدثنا سليم بن عبدالله الرقي حدثنا مصعب بن إبراهيم حدثنا عمران بن الربيع الكوفي عن يحيى بن سعيد الأنصاري عن محمد بن المنكدر عن جابر رضي الله عنه قال: سئل نبي الله صلى الله عليه وسلم أينام أهل الجنة؟ فقال صلى الله عليه وسلم \"النوم أخو الموت وأهل الجنة لا ينامون\" وهكذا رواه أبو بكر بن مردوية في تفسيره حدا أحمد بن القاسم بن صدقه المصري حدثنا المقدام بن داود حدثنا عبدالله بن المغيرة حدثنا سفيان الثوري عن محمد بن المنكدر عن جابر بن عبدالله رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم \"النوم أخو الموت وأهل الجنة لا ينامون\". وقال أبو بكر البزار في مسنده حدثنا الفضل بن يعقوب حدثنا محمد بن يوسف الفريابي عن سفيان عن محمد بن المنكدر عن جابر رضي الله عنه قال: قيل يا رسول الله هل ينام أهل الجنة؟ قال صلى الله عليه وسلم \"لا النوم أخو الموت\" ثم قال لا نعلم أحدا أسنده عن ابن المنكدر عن جابر رضي الله عنه إلا الثوري ولا عن الثوري إلا الفريابي هكذا قال وقد تقدم خلاف ذلك والله أعلم وقولـه تعالى \"ووقاهم عذاب الجحيم\" أي مع هذا النعيم العظيم المقيم قد وقاهم وسلمهم ونجاهم وزحزحهم عن العذاب الأليم في دركات الجحيم فحصل لهم المطلوب ونجاهم من المرهوب."
    },
    {
      "ayah": 57,
      "surah": 44,
      "text": "قال عز وجل \"فضلا من ربك ذلك هو الفوز العظيم\" أي إنما كان هذا بفضله عليهم وإحسانه إليهم كما ثبت في الصحيح عن رسول الله صلى الله عليه وسلم أنه قال \"اعملوا وسددوا وقاربوا واعلموا أن أحدا لن يدخله عمله الجنة\" قالوا ولا أنت يا رسول الله؟ قال صلى الله عليه وسلم \"ولا أنا إلا أن يتغمدني الله برحمة منه وفضل."
    },
    {
      "ayah": 58,
      "surah": 44,
      "text": "قوله تبارك وتعالى \"فإنما يسرناه بلسانك لعلهم يتذكرون\" أي إنما يسرنا هذا القرآن الذي أنزلناه سهلا واضحا بينا جليا بلسانك الذي هو أفصح اللغات وأجلاها وأحلاها وأعلاها \"لعلهم يتذكرون\" أي يتفهمون ويعلمون ثم لما كان مع هذا الوضوح والبيان من الناس من كفر وخالف وعاند قال الله تعالى لرسوله صلى الله عليه وسلم مسليا له وواعدا له بالنصر ومتوعدا لمن كذبه بالعطب والهلاك."
    },
    {
      "ayah": 59,
      "surah": 44,
      "text": "\"فارتقب\" أي انتظر \"إنهم مرتقبون\" أي فسيعلمون لمن تكون النصرة والظفر وعلو الكلمة في الدنيا والآخرة فإنها لك يا محمد ولإخوانك من النبيين والمرسلين ومن اتبعكم من المومنين كما قال تعالى \"كتب الله لأغلبن أنا ورسلي\" الآية وقال تعالى \"إنا لننصر رسلنا والذين آمنوا في الحياة الدنيا ويوم يقوم الأشهاد يوم لا ينفع الظالمين معذرتهم ولهم اللعنة ولهم سوء الدار\" آخر تفسير سورة الدخان ولله الحمد والمنة وبه التوفيق والعصمة."
    },
    { "ayah": 6, "surah": 44, "text": "أي الذي أنزل القرآن هو رب السموات والأرض." },
    {
      "ayah": 7,
      "surah": 44,
      "text": "رب السموات والأرض وما بينهما وخالقهما ومالكهما وما فيهما إن كنتم موقنين أي إن كنتم متحققين."
    },
    {
      "ayah": 8,
      "surah": 44,
      "text": "قال تعالى \"لا إله إلا هو يحيى ويميت ربكم ورب آبائكم الأولين\" وهذه الآية كقوله تعالى \"قل يا أيها الناس إني رسول الله إليكم جميعا الذي له ملك السموات والأرض لا إله إلا هو يحيى ويميت\" الآية."
    },
    {
      "ayah": 9,
      "surah": 44,
      "text": "يقول تعالى بل هؤلاء المشركون في شك يلعبون أي قد جاءهم الحق اليقين وهم يشكون فيه ويمترون ولا يصدقون به."
    }
  ]
}
