{
  "ayahs": [
    {
      "ayah": 1,
      "surah": 45,
      "text": "قد اختلف المفسرون في الحروف المقطعة التي في أوائل السور فمنهم من قال هي مما استأثر الله بعلمه فردوا علمها إلى الله ولم يفسرها حكاه القرطبي في تفسـره عن أبي بكر وعمر وعثمان وعلي وابن مسعود رضي الله عنهم أجمعين وقاله عامر الشعبي وسفيان الثوري والربيع بن خيثم واختاره أبو حاتم بن حبان. ومنهم من فسرها واختلف هؤلاء في معناها فقال عبدالرحمن بن زيد بن أسلم إنما هي أسماء السور. قال العلامة أبو القاسم محمود بن عمر الزمخشري في تفسيره وعليه إطباق الأكثر ونقل عن سيبويه أنه نص عليه ويعتضد لهذا بما ورد في الصحيحين عن أبي هريرة أن رسول الله صلى الله عليه وسلم كان يقرأ في صلاة الصبح يوم الجمعة \"الم\" السجدة و \"هل أتى على الإنسان\" وقال سفيان الثوري عن ابن أبي نجيح عن مجاهد أنه قال: الم وحم والمص وص. فواتح افتتح الله بها القرآن وكذا قال غيره عن مجاهد وقال مجاهد في رواية أبي حذيفة موسى بن مسعود عن شبل عن ابن أبي نجيح عنه أنه قال الم اسم من أسماء القرآن وهكذا وقال قتادة وزيد بن أسلم ولعل هذا يرجع إلى معنى قول عبدالرحمن بن زيد بن أسلم أنه اسم من أسماء السور فإن كل سورة يطلق عليها اسم القرآن فإنه يبعد أن يكون المص اسما للقرآن كله لأن المتبادر إلى فهم سامع من يقول قرأت المص إنما ذلك عبارة عن سورة الأعراف لا لمجموع القرآن والله أعلم. وقيل هي اسم من أسماء الله تعالى فقال عنها في فواتح السور من أسماء الله تعالى وكذلك قال سالم بن عبدالله وإسماعيل بن عبدالرحمن السدي الكبير وقال شعبة عن السدي بلغني أن ابن عباس قال الم اسم من أسماء الله الأعظم. هكذا رواه ابن أبي حاتم من حديث شعبة ورواه ابن جرير عن بندار عن ابن مهدي عن شعبة قال سألت السدي عن حم وطس والم فقال قال ابن عباس هي اسم الله الأعظم."
    },
    {
      "ayah": 10,
      "surah": 45,
      "text": "ثم فسر العذاب الحاصل له يوم معاده فقال من ورائهم جهنم أي كل من اتصف بذلك سيصيرون إلى جهنم يوم القيامة ولا يغني عنهم ما كسبوا شيئا أي لا تنفعهم أموالهم ولا أولادهم ولا ما اتخذوا من دون الله أولياء أي ولا تغني عنهم الآلهة التي عبدوها من دون الله شيئا ولهم عذاب عظيم."
    },
    {
      "ayah": 11,
      "surah": 45,
      "text": "ثم قال تبارك وتعالى هذا هدى يعني القرآن والذين كفروا بآيات ربهم لهم عذاب من رجز أليم وهو المؤلم الموجع والله سبحانه وتعالى أعلم."
    },
    {
      "ayah": 12,
      "surah": 45,
      "text": "يذكر تعالى نعمه على عبيده فيما سخر لهم من البحر لتجري الفلك وهي السفن فيه بأمره تعالى فإنه هو الذي أمر البحر بحملها ولتبتغوا من فضله أي في المتاجر والمكاسب ولعلكم تشكرون أي على حصول المنافع المجلوبة إليكم من الأقاليم النائية والآفاق القاصية."
    },
    {
      "ayah": 13,
      "surah": 45,
      "text": "وسخر لكم ما في السموات وما في الأرض أي من الكواكب والجبال والبحار والأنهار وجميع ما تنتفعون به أي الجميع من فضله وإحسانه وامتنانه ولهذا قال جميعا منه أي من عنده وحده لا شريك له فى ذلك كما قال تبارك وتعالى وما بكم من نعمة فمن الله ثم إذا مسكم الضر فإليه تجأرون وروى ابن جرير من طريق العوفي عن ابن عباس ما في قوله تبارك وتعالى وسخر لكم ما في السموات وما في الأرض جميعا منه كل شيء هو من الله. وذلك الإسم فيه إسم من أسمائه فذلك جميعا منه ولا ينازعه فيه المنازعون واستيقن أنه كذلك وقال ابن أبي حاتم حدثنا أبي حدثنا محمد بن خلف العسقلاني حدثنا الفريابي عن سفيان عن الأعمش عن المنهال بن عمرو عن أبي أراكة قال سأل رجل عبدالله بن عمر قال مم خلق الخلق؟ قال من النور والنار والظلمة والثرى قال وائت ابن عباس فاسأله فأتاه فقال له مثل ذلك فقال ارجع إليه فسله مم خلق ذلك كله؟ فرجع إليه فسأله قتلا وسخر لكم ما في السموات وما في الأرض جميعا منه هذا أثر غريب وفيه نكارة إن فى ذلك لآيات لقوم يتفكرون."
    },
    {
      "ayah": 14,
      "surah": 45,
      "text": "وقوله تعالى قل للذين آمنوا يغفروا للذين لا يرجون أيام الله أي ليصفحوا عنهم ويتحملوا الأذى منهم وكان هذا في ابتداء الإسلام أمروا أن يصبروا على أذى المشركين وأهل الكتاب ليكون ذلك كالتأليف لهم ثم لما أصروا علن العناد شرع الله للمؤمنين الجلاء والجهاد. هكذا روي عن ابن عباس وقتادة وقال مجاهد لا يرجون أيام الله لا ينالون نعم الله تعالى وقوله تبارك وتعالى ليجزي قوما بما كانوا يكسبون أي إذا صفحوا عنهم في الدنيا فإن الله عز وجل مجازيهم بأعمالهم السيئة في الآخرة."
    },
    {
      "ayah": 15,
      "surah": 45,
      "text": "ولهذا قال تعالى من عمل صالحا فلنفسه ومن أساء فعليها ثم إلى ربكم ترجعون أي تعودون إليه يوم القيامة فتعرضون بأعمالكم عليه فيجزيكم بأعمالكم خيرها وشرها والله سبحانه وتعالى أعلم."
    },
    {
      "ayah": 16,
      "surah": 45,
      "text": "يذكر تعالى ما أنعم به على بني إسرائيل من إنزال الكتب عليهم وإرسال الرسل إليهم وجعله الملك فيه ولهذا قال تبارك وتعالى ولقد آتينا بني إسرائيل الكتاب والحكم والنبوة ورزقناهم من الطيبات أي من المآكل والمشارب وفضلناهم على العالمين أي في زمانهم."
    },
    {
      "ayah": 17,
      "surah": 45,
      "text": "وآتيناهم بينات من الأمر أي حججا وبراهين وأدلة قاطعات فقامت عليهم الحجج ثم اختلفوا بعد ذلك من بعد قيام الحجة وإنما كان ذلك بغيا منهم على بعضهم بعضا إن ربك يا محمد يقضي بينهم يوم القيامة فيما كانوا فيه يختلفون أي سيفصل بينهم بحكمه العدل وهذا فيه تحذير لهذه الأمة أن تسلك مسلكهم وأن تقصد منهجهم."
    },
    {
      "ayah": 18,
      "surah": 45,
      "text": "ولهذا قال جل وعلا ثم جعلناك على شريعة من الأمر فاتبعها ولا تتبع أهواء الذين لا يعلمون أي اتبع ما أوحي إليك من ربك لا إله إلا هو وأعرض عن المشركين."
    },
    {
      "ayah": 19,
      "surah": 45,
      "text": "وقال جل جلاله ههنا إنهم لن يغنوا عنك من الله شيئا وإن الظالمين بعضهم أولياء بعض أي وماذا تغني عنهم ولايتهم لبعضهم بعضا فإنهم لا يزيدونهم إلا خسارا ودمارا وهلاكا والله ولي المتقين وهو تعالى يخرجهم من الظلمات إلى النور والذين كفروا أولياؤهم الطاغوت يخرجونهم من النور إلى الظلمات."
    },
    {
      "ayah": 2,
      "surah": 45,
      "text": "يخبر تعالى أنه أنزل الكتاب على عبده ورسوله محمد صلوات الله وسلامه عليه دائما إلى يوم الدين ووصف نفسه بالعزة التي لا ترام والحكمة في الأقوال والأفعال."
    },
    { "ayah": 20, "surah": 45, "text": "ثم قال عز وجل هذا بصائر للناس يعني القرآن وهدى ورحمة لقوم يوقنون." },
    {
      "ayah": 21,
      "surah": 45,
      "text": "يقول تعالى لا يستوي المؤمنون والكافرون كما قال عز وجل لا يستوي أصحاب النار وأصحاب الجنة أصحاب الجنة هم الفائزون وقال تبارك وتعالى أم حسب الذين اجترحوا السيئات أي عملوها وكسبوها أن نجعلهم كالذين آمنوا وعملوا الصالحات سواء محياهم ومماتهم أى نساويهم بهم في الدنيا والآخرة ساء ما يحكمون أي ساء ما ظنوا بنا وبعدلنا أن نساوي بين الأبرار والفجار فى الدار الآخرة وفي هذه الدار قال الحافظ أبو يعلى حدثنا مؤمل بن إهاب حدثنا بكير بن عثمان التنوخي حدثنا الوضين بن عطاء عن يزيد بن مرثد الباجي عن أبي ذر قال: إن الله تعالى بنى دينه على أربعة أركان فمن صبر عليهن ولم يعمل بهن لقي الله من الفاسقين قيل وما هن يا أبا ذر؟ قال يسلم حلال الله لله وحرام الله لله وأمر الله لله ونهي الله لله لا يؤتمن عليهن إلا الله قال أبو القاسم صلى الله عليه وسلم \"كما أنه لا يجتنى من الشوك العنب كذلك لا ينال الفجار منازل الأبرار\" هذا حديث غريب من هذا الوجه وقد ذكر محمد بن إسحاق في كتاب السرة أنهم وجدوا حجرا بمكة في أس الكعبة مكتوب عليه: تعملون السيئات وترجون الحسنات أجل كما يجنى من الشوك العنب. وقد روى الطبراني من حديث شعبة عن عمرو بن مرة عن أبي الضحى عن مسروق أن تميما الداري قام ليلة حتى أصبح يردد هذه الآية أم حسب الذين اجترحوا السيئات أن نجعلهم كالذين آمنوا وعملوا الصالحات ولهذا قال تعالى ساء ما يحكمون."
    },
    {
      "ayah": 22,
      "surah": 45,
      "text": "وقال عز وجل وخلق الله السموات والأرض بالحق أي بالعدل ولتجزى كل نفس بما كسبت وهم لا يظلمون."
    },
    {
      "ayah": 23,
      "surah": 45,
      "text": "ثم قال جل وعلا أفرأيت من اتخذ إلهه هواه أي إنما يأتمر بهواه فمهما رآه حسنا فعله ومهما رآه قبيحا تركه وهذا قد يستدل به على المعتزلة في قولهم بالتحسين والتقبيح العقليين وعن مالك فيما روي عنه من التفسير لا يهوى شيئا إلا عبده وقوله وأضله الله على علم محتمل قولين \"أحدهما\" وأضله الله لعلمه أنه يستحق ذلك \"والآخر\" وأضله الله بعد بلوغ العلم إليه وقيام الحجة عليه والثاني يستلزم الأول ولا ينعكس وختم على سمعه وقلبه وجعل على بصره غشاوة أي فلا يسمع ما ينفعه ولا يعي شيئا يهتدي به ولا يرى حجة يستضيء بها ولهذا قال تعالى فمن يهديه من بعد الله أفلا تذكرون كقوله تعالى من يضلل الله فلا هادي له ويذرهم في طغيانهم يعمهون."
    },
    {
      "ayah": 24,
      "surah": 45,
      "text": "يخبر تعالى عن قول الدهرية من الكفار ومن وافقهم من مشركي العرب في إنكار المعاد وقالوا ما هي إلا حياتنا الدنيا نموت ونحيا أي ما ثم إلا هذه الدار يموت قوم ويعيش آخرون وما ثم معاد ولا قيامة وهذا يقوله مشركو العرب المنكرون المعاد وتقوله الفلاسفة الإلهيون منهم وهم ينكرون البداءة والرجعة وتقوله الفلاسفة الدهرية الدرية المنكرون للصانع المعتقدون أن في كل ستة وثلاثين ألف سنة يعود كل شيء إلى ما كان عليه وزعموا أن هذا قد تكرر مرات لا تتناهى فكابروا العقول وكذبوا المنقول ولهذا قالوا وما يهلكنا إلا الدهر قال الله تعالى وما لهم بذلك من علم إن هم إلا يظنون أي يتوهمون ويتخيلون. فأما الحديث الذي أخرجه صاحبا الصحيح وأبو داود والنسائي من رواية سفيان بن عينة عن الزهري عن سعيد بن المسيب عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم \"يقول تعالى يؤذيني ابن آدم يسب الدهر وأنا الدهر بيدي الأمر أقلب ليله ونهاره\" وفي رواية \"لا تسبوا الدهر فإن الله تعالى هو الدهر\" وقد أورده ابن جرير بسياق غريب جدا فقال: حدثنا أبو كريب حدثنا سفيان بن عينة عن الزهري عن سعيد بن المسيب عن أبي هريره رضي الله عنه عن النبي صلى الله عليه وسلم قال \"كان أهل الجاهلية يقولون إنما يهلكنا الليل والنهار وهو الذي يهلكنا يميتنا ويحينا فقال الله تعالى في كتابه وقالوا ما هي إلا حياتنا الدنيا نموت ونحيا وما يهلكنا إلا الدهر ويسبون الدهر فقال الله عز وجل: يؤذيني ابن آدم يسب الدهر وأنا الدهر بيدي الأمر أقلب الليل والنهار\" وكذا رواه ابن أبي حاتم عن أحمد بن منصور عن شريح بن النعمان عن ابن عيينة مثله ثم روى عن يونس عن ابن وهب عن الزهري عن أبي سلمة عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم \"قال الله تعال يسب ابن آدم الدهر وأنا الدهر بيدي الليل والنهار وأخرجه صاحبا الصحيح والنسائي من حديث يونس بن يزيد به وقال محمد بن إسحاق عن العلاء بن عبدالرحمن عن أبيه عن أبي هريرة رضي الله عنه أن رسول الله صلى الله عليه وسلم قال \"يقول الله تعالى أستقرضت عبدي فلم يعطني وسبني عبدي يقول وادهراه وأنا الدهر\" قال الشافعي وأبو عبيدة وغيرهما من الأئمة في تفسر قوله صلى الله عليه وسلم \"لا تسبوا الدهر فإن الله هو الدهر\" كانت العرب في جاهليتها إذا أصابهم شدة أو بلاء أو نكبة قالوا يا خيبة الدهر فيسندون تلك الأفعال إلى الدهر ويسبونه وإنما فاعلها هو الله تعالى فكأنهم إنما سبوا الله عز وجل لأنه فاعل ذلك في الحقيقة فلهذا نهى عن سب الدهر بهذا الاعتبار لأن الله تعالى هو الدهر الذي يعنونه ويسندون إليه تلك الأفعال وقد غلط ابن حزم ومن نحا نحوه من الظاهرية فى عدهم الدهر من الأسماء الحسنى أخذا من هذا الحديث هذا أحسن ما قيل في تفسيره وهو المراد والله أعلم."
    },
    {
      "ayah": 25,
      "surah": 45,
      "text": "وقوله تعالي وإذا تتلى عليهم آياتنا بينات أي إذا استدل عليهم وبين لهم الحق وأن الله تعالى قادر على إعادة الأبدان بهد فنائها وتفرقها ما كان حجتهم إلا ان قالوا ائتوا بآبائنا إن كنتم صادقين أي أحيوهم إن كان ما تقولونه حقا."
    },
    {
      "ayah": 26,
      "surah": 45,
      "text": "قال الله تعالى\"قل الله يحيكم ثم يميتكم\" أي كما تشاهدون ذلك يخرجكم من العدم إلى الوجود\"كيف تكفرون بالله وكنتم أمواتا فأحياكم ثم يميتكم ثم يحييكم\" أي الذي قدر على البداءة قادر على الإعادة بطريق الأولى والأخرى \"وهو الذي يبدأ الخلق ثم يعيده وهو أهون عليه\" \"ثم يجمعكم إلى يوم القيامة لا ريب فيه\" أي إنما يجمعكم إلى يوم القيامة لا يعيدكم في الدنيا حتى تقولوا\"ائتوا بآبائنا إن كنتم صادقين\" \"يوم يجمعكم ليوم الجمع\" \"لأي يوم أجلت ليوم الفصل\" \"وما نؤخره إلا لأجل معدود\" وقال ههنا\"ثم يجمعكم إلى يوم القيامة لا ريب فيه\" أي لا شك فيه\"ولكن أكثر الناس لا يعلمون\"أي فلهذا ينكرون المعاد وستبعدون قيام الأجساد قال الله تعالى\"إنهم يرونه بعيدا ونراه قريبا\" أي يرون وقوعه بعيدا والمؤمنون يرون ذلك سهلا قريبا."
    },
    {
      "ayah": 27,
      "surah": 45,
      "text": "يخبر تعالى أنه مالك السموات والأرض والحاكم فيهما في الدنيا والآخرة ولهذا قال عز وجل ويوم تقوم الساعة أي يوم القيامة يخسر المبطلون وهم الكافرون بالله الجاحدون بما أنزله على رسله من الآيات البينات والدلائل الواضحات. وقال ابن أبي حاتم قدم سفيان الثوري المدينة فسمع المعافري يتكلم ببعض ما يضحك به الناس فقال له يا شيخ أما علمت أن لله تعالى يوما يخسر فيه المبطلون؟ قال فما زالت تعرف في المعافري حتى لحق بالله تعالى."
    },
    {
      "ayah": 28,
      "surah": 45,
      "text": "ذكره ابن أبي حاتم ثم قال تعالى وترى كل أمة جاثية أي على ركبها من الشدة والعظمة ويقال إن هذا إذا جيء بجهنم فإنها تزفر زفرة لا يبقى أحد إلا جثا لركبتيه حتى إبراهيم الخليل عليه الصلاة والسلام ويقول نفسي نفسي نفسي لا أسألك اليوم إلا نفسي وحتى إن عيسى عليه الصلاة والسلام ليقول لا أسألك اليوم إلا نفسي لا أسألك مريم التي ولدتني. وقال مجاهد وكعب الأحبار والحسن البصري كل أما جاثية أي على الركب وقال عكرمة جاثية متميزة على ناحيتها وليس على الركب والأول أولى. قال ابن أبي حاتم حدثنا محمد بن عبدالله بن يزيد المقري حدثنا سفيان بن عيينة عن عمرو عن عبدالله بن باباه أن رسول الله صلى الله عليه وسلم قال \"كأني أراكم جاثين بالكوم دون جهنم\".وقال إسماعيل بن أبي رافع المدني عن محمد بن كعب عن أبي هريرة رضي الله عنه مرفوعا في حديث الصور فيتميز الناس وتجثو الأمم وهي التي يقول الله تعالى وترى كل أمة جاثية كل أمة تدعي إلى كتابها وهذا فيه جمع بين القولين ولا منافاة والله أعلم. وقوله عز وجل كل أمة تدعى إلى كتابها يعني كتاب أعمالها كقوله جل جلاله ووضع الكتاب وجيء بالنبيين والشهداء ولهذا قال سبحانه وتعالى اليوم تجزون ما كنتم تعملون أي تجازون بأعمالكم خيرها وشرها كقوله عز وجل ينبأ الإنسان يومئذ بما قدم وأخر بل الإنسان على نفسه بصيرة ولو ألقى معاذيره."
    },
    {
      "ayah": 29,
      "surah": 45,
      "text": "ولهذا قال جلت عظمته هذا كتابنا ينطق عليكم بالحق أي يستحضر جميع أعمالكم من غير زيادة ولا نقص كقوله جل جلاله ووضع الكتاب فترى المجرمين مشفقين مما فيه ويقولون يا ويلتنا ما لهذا الكتاب لا يغادر صغيرة ولا كبيرة إلا أحصاها ووجدوا ما عملوا حاضرا ولا يظلم ربك أحدا وقوله عز وجل إنا كنا نستنسخ ما كنتم تعملون أي إنا كنا نأمر الحفظة أن تكتب أعمالكم عليكم قال ابن عباس وغيره تكتب الملائكة أعمال العباد ثم تصعد بها إلى السماء فيقابلون الملائكة الذين في ديوان الأعمال على ما بأيدي الكتبة مما فد أبرز لهم من اللوح المحفوظ في كل ليلة قدر مما كتبه الله في القدم على العباد قبل أن يخلقهم فلا يزيد حرفا ولا ينقص حرفا ثم قرأ إنا كنا نستنسخ ما كنتم تعملون."
    },
    {
      "ayah": 3,
      "surah": 45,
      "text": "يرشد تعالى خلقه إلى التفكر في آلائه ونعمه وقدرته العظيمة التي خلق بهما السموات الأرض."
    },
    {
      "ayah": 30,
      "surah": 45,
      "text": "يخبر تعالى عن حكمه في خلقه يوم القيامة فقال تعالى فأما الذين آمنوا وعملوا الصالحات أي آمنت قلوبهم وعملت جوارحهم الأعمال الصالحة وهي الخالصة الموافقة للشرع فيدخلهم ربهم في رحمته وهي الجنة كما ثبت في الصحيح أن الله تعالى قال للجنة أنت رحمتي أرحم بك من أشاء ذلك هو الفوز المبين أي البين الواضح."
    },
    {
      "ayah": 31,
      "surah": 45,
      "text": "ثم قال تعالى وأما الذين كفروا أفلم تكن آياتي تتلى عليكم فاستكبرتم أي يقال لهم ذلك تقريعا وتوبيخا أما قرئت عليكم آيات الله تعالى فاستكبرتم عن اتباعها وأعرضتم عن سماعها وكنتم قوما مجرمين في أفعالكم مع ما اشتملت عليه قلوبكم من التكذيب."
    },
    {
      "ayah": 32,
      "surah": 45,
      "text": "وإذا قيل إن وعد الله حق والساعة لا ريب فيها أي إذا قال لكم المؤمنون ذلك قلتم ما ندري ما الساعة أي لا نعرفها إن نظن إلا ظنا أي إن نتوهم وقوعها إلا توهما أي مرجوحا ولهذا قال وما نحن بمستيقنين أي بمتحققين."
    },
    {
      "ayah": 33,
      "surah": 45,
      "text": "قال الله تعالى وبدا لهم سيئات ما عملوا أي وظهر لهم عقوبة أعمالهم السيئة وحاق بهم أي أحاط بهم ما كانوا به يستهزئون أي من العذاب والنكال."
    },
    {
      "ayah": 34,
      "surah": 45,
      "text": "وقيل اليوم ننساكم أي نعاملكم معاملة الناسي لكم في نار جهنم كما نسيتم لقاء يومكم هذا أي فلم تعملوا له لأنكم لم تصدقوا به ومأواكم النار وما لكم من ناصرين وقد ثبت في الصحيح أن الله تعالى يقول لبعض العبد يوم القيامة \"ألم أزوجك؟ ألم أكرمك؟ ألم أسخر لك الخيل والإبل وأذرك ترأس وتربع؟ فيقول بلى يا رب فيقول أفظننت أنك ملاقى؟ فيقول لا فيقول الله تعالى فاليوم أنساك كما نسيتني\"."
    },
    {
      "ayah": 35,
      "surah": 45,
      "text": "قال الله تعالى ذلكم بأنكم اتخذتم آيات الله هزوا أي إنما جازيناكم هذا الجزاء لأنكم اتخذتم حجج الله عليكم سخريا تسخرون وتستهزئون بها وغرتكم الحياة الدنيا أي خدعتكم فاطمأننتم إليها فأصبحتم من الخاسرين ولهذا قال عز وجل فاليوم لا يخرجون منها أي من النار ولا هم يستعتبون أي لا يطلب منهم العتبى بل يعذبون بغير حساب ولا عتاب كما تدخل طائفة من المؤمنين الجنة بغير عذاب ولا حساب."
    },
    {
      "ayah": 36,
      "surah": 45,
      "text": "ثم لما ذكر تعالى حكمه في المؤمنين والكافرين قال فلله الحمد رب السموات ورب الأرض أي المالك لهما وما فيهما ولهذا قال رب العالمين."
    },
    {
      "ayah": 37,
      "surah": 45,
      "text": "ثم قال جل وعلا وله الكبرياء في السموات والأرض قال مجاهد يعني السلطان أي هو العظيم الممجد الذي كل شيء خاضع لديه فقير إليه. وقد ورد في الحديث الصحيح \"يقول الله تعالى العظمة إزاري والكبرياء ردائي فمن نازعني واحدا منهما أسكنته ناري\" رواه مسلم من حديث الأعمش عن أبي إسحاق عن الأغر أبي مسلم عن أبي هريرة وأبي سعيد عن رسول الله صلى الله عليه وسلم بنحوه وقوله تعالى هو العزيز أي الذي لا يغالب ولا يمانع الحكيم في أقواله وأفعاله وشرعه وقدره تعالى وتقدس لا إله إلا هو آخر تفسير سورة الجاثية ولله الحمد والمنة وبه التوفيق والعصمة."
    },
    {
      "ayah": 4,
      "surah": 45,
      "text": "وما فيهما من المخلوقات المختلفة الأجناس والأنواع من الملائكة والجن والإنس والدواب والطيور والوحوش والسباع والحشرات وما في البحر من الأصناف المتنوعة."
    },
    {
      "ayah": 5,
      "surah": 45,
      "text": "واختلاف الليل والنهار في تعاقبهما دائبين لا يفتران هذا بظلامه وهذا بضيائه وما أنزل الله تبارك وتعالى من السحاب من المطر في وقت الحاجة إليه وسماه رزقا لأن به يحصل الرزق فأحيا به الأرض بعد موتها أي بعدما كانت هامدة لا نبات فيها ولا شيء. وقوله عز وجل وتصريف الرياح أي جنوبا وشمالا ودبورا وصبا برية وبحرية ليلية ونهارية ومنها ما هو للمطر ومنها ما هو للقاح ومنها ما هو غذاء للأرواح ومنها ما هو عقيم لا ينتج وقال سبحانه وتعالى أولا لآيات للمؤمنين ثم يوقنون ثم يعقلون وهو ترق من حال شريف إلى ما هو أشرف منه وأعلى هذه الآيات شبيهة بآية البقرة وهي قوله تعالى إن في خلق السموات الأرض واختلاف الليل والنهار والفلك التي تجري في البحر بما ينفع الناس وما أنزل الله من السماء من ماء فأحيا به الأرض بعد موتها وبث فيها من كل دابة وتصريف الرياح والسحاب المسخر بين السماء والأرض لآيات لقوم يعقلون وقد أورد ابن أبي حاتم ههنا عن وهب بن منبه أثرا طويلا غريبا في خلق الإنسان من الأخلاط الأربعة والله أعلم."
    },
    {
      "ayah": 6,
      "surah": 45,
      "text": "يقول تعالى تلك آيات الله يعني القرآن بما فيه من الحجج والبينات نتلوها عليك بالحق أي متضمنة الحق من الحق فإذا كانوا لا يؤمنون بها ولا ينقادون لها فبأي حديث بعد الله وآياته يؤمنون."
    },
    {
      "ayah": 7,
      "surah": 45,
      "text": "ثم قال تعالى ويل لكل أفاك أثيم أي أفاك في قوله كذاب حلاف مهين أثيم في فعله وقلبه كافر بأيات الله."
    },
    {
      "ayah": 8,
      "surah": 45,
      "text": "ولهذا قال\"يسمع آيات الله تتلى عليه\" أي تقرأ عليه ثم يصر أي على كفره وجحوده استكبارا وعنادا كأن لم يسمعها أي كأنه ما سمعها فبشره بعذاب أليم أي فأخبره أن له عند الله تعالى يوم القيامة عذابا أليما موجعا."
    },
    {
      "ayah": 9,
      "surah": 45,
      "text": "وإذا علم من أياتنا شيئا اتخذها هزوا أي إذا حفظ شيئا من القرآن كفر به واتخذه سخريا وهزوا أولئك لهم عذاب مهين أى في مقابلة ما استهان بالقرآن واستهزأ به ولهذا روى مسلم في صحيحه عن ابن عمر قال نهى رسول الله صلى الله عليه وسلم أن يسافر بالقرآن إلى أرض العدو مخافة أن يناله العدو."
    }
  ]
}
