{
  "ayahs": [
    {
      "ayah": 1,
      "surah": 46,
      "text": "قد اختلف المفسرون في الحروف المقطعة التي في أوائل السور فمنهم من قال هي مما استأثر الله بعلمه فردوا علمها إلى الله ولم يفسرها حكاه القرطبي في تفسـره عن أبي بكر وعمر وعثمان وعلي وابن مسعود رضي الله عنهم أجمعين وقاله عامر الشعبي وسفيان الثوري والربيع بن خيثم واختاره أبو حاتم بن حبان. ومنهم من فسرها واختلف هؤلاء في معناها فقال عبدالرحمن بن زيد بن أسلم إنما هي أسماء السور. قال العلامة أبو القاسم محمود بن عمر الزمخشري في تفسيره وعليه إطباق الأكثر ونقل عن سيبويه أنه نص عليه ويعتضد لهذا بما ورد في الصحيحين عن أبي هريرة أن رسول الله صلى الله عليه وسلم كان يقرأ في صلاة الصبح يوم الجمعة \"الم\" السجدة و \"هل أتى على الإنسان\" وقال سفيان الثوري عن ابن أبي نجيح عن مجاهد أنه قال: الم وحم والمص وص. فواتح افتتح الله بها القرآن وكذا قال غيره عن مجاهد وقال مجاهد في رواية أبي حذيفة موسى بن مسعود عن شبل عن ابن أبي نجيح عنه أنه قال الم اسم من أسماء القرآن وهكذا وقال قتادة وزيد بن أسلم ولعل هذا يرجع إلى معنى قول عبدالرحمن بن زيد بن أسلم أنه اسم من أسماء السور فإن كل سورة يطلق عليها اسم القرآن فإنه يبعد أن يكون المص اسما للقرآن كله لأن المتبادر إلى فهم سامع من يقول قرأت المص إنما ذلك عبارة عن سورة الأعراف لا لمجموع القرآن والله أعلم. وقيل هي اسم من أسماء الله تعالى فقال عنها في فواتح السور من أسماء الله تعالى وكذلك قال سالم بن عبدالله وإسماعيل بن عبدالرحمن السدي الكبير وقال شعبة عن السدي بلغني أن ابن عباس قال الم اسم من أسماء الله الأعظم. هكذا رواه ابن أبي حاتم من حديث شعبة ورواه ابن جرير عن بندار عن ابن مهدي عن شعبة قال سألت السدي عن حم وطس والم فقال قال ابن عباس هي اسم الله الأعظم."
    },
    {
      "ayah": 10,
      "surah": 46,
      "text": "يقول تعالى \"قل\" يا محمد لهؤلاء المشركين الكافرين بالقرآن \"أرأيتم إن كان\" هذا القرآن \"من عند الله وكفرتم به\" أي ما ظنكم أن الله صانع بكم إن كان هذا الكتاب الذي جئتكم به قد أنزله علي لأبلغكموه وقد كفرتم به وكذبتموه \"وشهد شاهد من بنى إسرائيل على مثله\" أي وقد شهدت بصدقه وصحته الكتب المتقدمة المنزلة على الأنبياء عليهم الصلاة والسلام قبلي بشرت به وأخبرت بمثل ما أخبر هذا القرآن به. وقوله عز وجل \"فآمن\" أي هذا الذي شهد بصدقه من بني إسرائيل لمعرفته بحقيقته \"واستكبرتم\" أنتم عن اتباعه وقال مسروق فآمن هذا الشاهد بنبيه وكتابه وكفرتم أنتم بنبيكم وكتابكم \"إن الله لا يهدي القوم الظالمين\" وهذا الشاهد اسم جنس يعم عبدالله بن سلام وغيره فإن هذه الآية مكية نزلت قبل إسلام عبدالله بن سلام رضي الله عنه وهذه كقوله تبارك وتعالى \"وإذا يتلى عليهم قالوا آمنا به إنه الحق من ربنا إنا كنا من قبله مسلمين\" وقال \"إن الذين أوتوا العلم من قبله إذا يتلى عليهم يخرون للأذقان سجدا ويقولون سبحان ربنا إن كان وعد ربنا لمفعولا\" قال مسروق والشعبي ليس بعبدالله بن سلام هذه الآية مكية وإسلام عبدالله بن سلام كان بالمدينة. رواه عنهما ابن جرير وابن أبي حاتم واختاره ابن جرير. وقال مالك عن أبي النضر عن عامر بن سعد عن أبيه قال ما سمعت رسول الله صلى الله عليه وسلم يقول لأحد يمشي على وجه الأرض إنه من أهل الجنة إلا لعبدالله بن سلام رضي الله عنه قال وفيه نزلت \"وشهد شاهد من بني إسرائيل على مثله\" رواه البخاري ومسلم والنسائي من حديث مالك به. وكذا قال ابن عباس رضي الله عنهما ومجاهد والضحاك وقتادة وعكرمة ويوسف بن عبدالله بن سلام وهلال بن يساف والسدي والثوري ومالك بن أنس وابن زيد أنهم كلهم قالوا: إنه عبدالله بن سلام."
    },
    {
      "ayah": 11,
      "surah": 46,
      "text": "وقوله تعالى \"وقال الذين كفروا للذين آمنوا لو كان خيرا ما سبقونا إليه\" أي قالوا عن المؤمنين بالقرآن لو كان القرآن خيرا ما سبقنا هؤلاء إليه يعنون بلالا وعمارا وصهيبا وخبابا رضي الله عنهم وأشباههم وأضرابهم من المستضعفين والعبيد والإماء وما ذاك إلا لأنهم عند أنفسهم يعتقدون أن لهم عند الله وجاهة وله بهم عناية. وقد غلطوا في ذلك غلطا فاحشا وأخطئوا خطأ بينا كما قال تبارك وتعالى \"وكذلك فتنا بعضهم ببعض ليقولوا أهؤلاء من الله عليهم من بيننا\" أى يتعجبون كيف اهتدى هؤلاء دوننا ولهذا قالوا \"لو كان خيرا ما سبقونا إليه\" وأما أهل السنة والجماعة فيقولون في كل فعل وقول لم يثبت عن الصحابة رضي الله عنهم هو بدعة لأنه لو كان خيرا لسبقونا إليه لأنهم لم يتركوا خصلة من خصال الخير إلا وقد بادروا إليها. وقوله تعالى \"وإذ لم يهتدوا به\" أي بالقرآن \"فسيقولون هذا إفك قديم\" أي كذب قديم أي مأثور عن الناس الأقدمين فينتقصون القرآن وأهله وهذا هو الكبر الذي قال رسول الله صلى الله عليه وسلم \"بطر الحق وغمط الناس\"."
    },
    {
      "ayah": 12,
      "surah": 46,
      "text": "ثم قال تعالى \"ومن قبله كتاب موسى\" وهو التوراة \"إماما ورحمة \"وهذا كتاب\" يعني القرآن مصدق أي لما قبله من الكتب \"لسانا عربيا\" أي فصيحا بينا واضحا \"لينذر الذين ظلموا وبشرى للمحسنين\" أي مشتمل على النذارة للكافرين والبشارة للمؤمنين."
    },
    {
      "ayah": 13,
      "surah": 46,
      "text": "وقوله تعالى \"إن الذين قالوا ربنا الله ثم استقاموا\" تقدم تفسيرها في سورة حم السجدة وقوله تعالى \"فلا خوف عليهم\" أي فيما يستقبلون \"ولا هم يحزنون\" على ما خلفوا."
    },
    { "ayah": 14, "surah": 46, "text": "أي الأعمال سبب لنيل الرحمة لهم وسبوغها عليهم والله أعلم." },
    {
      "ayah": 15,
      "surah": 46,
      "text": "لما ذكر تعالى في الآية الأولى التوحيد له وإخلاص العبادة والاستقامة إليه عطف بالوصية بالوالدين كما هو مقرون في غير ما آية من القرآن كقوله عز وجل \"وقضى ربك ألا تعبدوا إلا إياه وبالوالدين إحسانا\" وقوله جل جلاله \"أن اشكر لي ولوالديك إلي المصير\" إلى غير ذلك فن الآيات الكثيرة. وقال عز وجل ههنا \"ووصينا الإنسان بوالديه إحسانا\" أي أمرناه بالإحسان إليهما والحنو عليهما وقال أبو داود الطيالسي حدثنا شعبة أخبرني سماك بن حرب قال سمعت مصعب بن سعد يحدث عن سعد رضي الله عنه قال: قالت أم سعد لسعد أليس قد أمر الله بطاعة الوالدين فلا آكل طعاما ولا أشرب شرابا حتى تكفر بالله تعالى فامتنعت من الطعام والشراب حتى جعلوا يفتحون فاها بالعصا ونزلت هذه الآية \"ووصينا الإنسان بوالديه إحسانا\" الآية ورواه مسلم وأهل السنن إلا ابن ماجه من حديث شعبة بإسناد نحوه وأطول منه \"حملته أمه كرها\" أي قاست بسببه في حال حمله مشقة وتعبا من وحم وغثيان وثقل وكرب إلى غير ذلك مما تنال الحوامل من التعب والمشقة \"ووضعته كرها\" أي بمشقة أيضا من الطلق وشدته \"وحمله وفصاله ثلاثون شهرا \". وقد استدل علي رضي الله عنه بهذه الآية مع التي فى لقمان \"وفصاله في عامين وقوله تبارك وتعالى \"والوالدت يرضعن أولادهن حولين كاملين لمن أراد أن يتم الرضاعة\" على أن أقل مدة الحمل ستة أشهر وهو استنباط قوي صحيح ووافقه عليه عثمان وجماعة من الصحابة قال محمد بن إسحاق بن يسار عن يزيد بن عبدالله بن قسيط عن معمر بن عبدالله الجهني قال تزوج رجل منا امرأة من جهينة فولدت له لتمام ستة أشهر فانطلق زوجها إلى عثمان رضي الله عنه فذكر ذلك له فبعث إليها فلما قامت لتلبس ثيابها بكت أختها فقالت وما يبكيك فوالله ما التبس بي أحد من خلق الله تعالى غيره قط فيقضي الله سبحانه وتعالى في ما شاء فلما أتي بها عثمان رضي الله عنه أمر برجمها فبلغ ذلك عليا رضي الله عنه فأتاه فقال له ما تصنع؟ قال ولدت تماما لستة أشهر وهل يكون ذلك ؟ فقال له علي رضي الله عنه أما تقرأ القرآن؟ قال بلى قال أما سمعت الله عز وجل يقول \"وحمله وفصاله ثلاثون شهرا \" وقال \"حولين كاملين\" فلم نجده بقي إلا ستة أشهر قال: فقال عثمان رضي الله عنه والله ما فطنت بهذا علي بالمرأة فوجدوها قد فرغ منها قال: فقال معمر فوالله ما الغراب بالغراب ولا البيضة بالبيضة بأشبه منه بأبيه فلما رآه أبوه قال ابني والله لا أشك فيه قال وابتلاه الله تعالى بهذه القرحة بوجهه الآكلة فما زالت تأكله حتى مات رواه ابن أبي حاتم وقد أوردناه من وجه آخر عند قوله عز وجل \"فأنا أول العابدين\". وقال ابن أبي حاتم حدثنا أبي حدثنا فروة بن أبي المغراء حدثنا علي بن مسهر عن داود بن أبي هند عن عكرمة عن ابن عباس رضي الله عنهما قال: إذا وضعت المرأة لتسعة أشهر كفاه من الرضاع أحد وعشرون شهرا وإذا وضعته لسبعة أشهر كفاه من الرضاع ثلاثة وعشرون شهرا وإذا وضعته لستة أشهر فحولين كاملين لأن الله تعالى يقول \"وحمله وفصاله ثلاثون شهرا حتى إذا بلغ أشده\" أي قوي وشب وارتجل \"وبلغ أربعين سنة\" أي تناهى عقله وكمل فهمه وحلمه ويقال إنه لا يتغير غالبا عما يكون عليه ابن الأربعين قال أبو بكر بن عياش عن الأعمش عن القاسم بن عبد الرحمن قال: قلت لمسروق متى يؤخذ الرجل بذنوبه قال إذا بلغت الأربعين فخذ حذرك وقال الحافظ أبو يعلى الموصلي حدثنا أبو عبدالله القواريري حدثنا عروة بن قيس الأزدي وكان قد بلغ مائة سنة حدثنا أبو الحسن الكوفي عمر بن أوس قال: قال محمد بن عمرو بن عثمان عن عثمان رضي الله عنه عن النبي صلى الله عليه وسلم \"قال العبد المسلم إذا بلغ أربعين سنة خفف الله تعالى حسابه وإذا بلغ ستين سنة رزقه الله تعالى الإنابة إليه وإذا بلغ سبعين سنة أحبه أهل السماء وإذا بلغ ثمانين سنة ثبت الله تعالى حسناته ومحا سيئاته وإذا بلغ تسعين سنة غفر الله له ما تقدم من ذنبه وما تأخر وشفعه الله تعالى في أهل بيته وكتب في السماء أسير الله في أرضه\" وقد روي هذا من غير هذا الوجه وهو في مسند الإمام أحمد وقد قال الحجاج بن عبدالله الحكمي أحد أمراء بني أمية بدمشق تركت المعاصي والذنوب أربعين سنة حياء من الناس ثم تركتها حياء من الله عز وجل وما أحسن قول الشاعر: صبا ما صبا حتى علا الشيب رأسه فلما علاه قال للباطل أبعد \"قال رب أوزعني\" أي ألهمني \"أن أشكر نعمتك التي أنعمت علي وعلى والدي وأن أعمل صالحا ترضاه\" أي في المستقبل \"وأصلح لي في ذريتي\" أي نسلي وعقبي \"إني تبت إليك وإني من المسلمين\" وهذا فيه إرشاد لمن بلغ الأربعين أن يجدد التوبة والإنابة إلى الله عز وجل ويعزم عليها وقد روى أبو داود في سننه عن ابن مسعود رضي الله عنه أن رسول الله صلى الله عليه وسلم كان يعلمهم أن يقولوا في التشهد \"اللهم ألف بين قلوبنا وأصلح ذات بيننا واهدنا سبل السلام ونجنا من الظلمات إلى النور وجنبنا الفواحش ما ظهر منها وما بطن وبارك لنا في أسماعنا وأبصارنا وقلوبنا وأزواجنا وذرياتنا وتب علينا إنك أنت التواب الرحيم واجعلنا شاكرين لنعمتك مثنين بها عليك قابليها أتممها علينا\"."
    },
    {
      "ayah": 16,
      "surah": 46,
      "text": "قال الله عز وجل \"أولئك الذين نتقبل عنهم أحسن ما عملوا ونتجاوز عن سيئاتهم في أصحاب الجنة\" أي هؤلاء المتصفون بما ذكرنا التائبون إلى الله المنيبون إليه المستدركون ما فات بالتوبة والاستغفار هم الذين نتقبل عنهم أحسن ما عملوا ونتجاوز عن سيئاتهم فيغفر لهم الكثير من الزلل ونتقبل منهم اليسير من العمل من أصحاب الجنة أي هم في جملة أصحاب الجنة وهذا حكمهم عند الله كما وعد الله عز وجل من تاب إليه وأناب. ولهذا قال تعالى \"وعد الصدق الذي كانوا يوعدون\" قال ابن جرير حدثني يعقوب بن إبراهيم حدثنا المعتمر بن سليمان عن الحكم بن أبان عن الغطريف عن جابر بن زيد عن ابن عباس رضي الله عنه عن رسول الله صلى الله عليه وسلم عن الروح الأمين عليه الصلاة والسلام قال \"يؤتي بحسنات العبد وسيئاته فيقتص بعضها ببعض فإن بقيت حسنة وسع الله تعالى له في الجنة\" قال فدخلت على يزداد فحدث بمثل هذا قال: قلت فإن ذهبت الحسنة قال \"أولئك الذين نتقبل عنهم أحسن ما عملوا ونتجاوز عن سيئاتهم في أصحاب الجنة وعد الصدق الذي كانوا يوعدون\" وهكذا رواه ابن أبي حاتم عن أبيه عن محمد بن عبدالأعلى الصنعاني عن المعتمر بن سليمان بإسناده مثله وزاد عن الروح الأمين قال: قال الرب جل جلاله يؤتي بحسنات العبد وسيئاته فذكره وهو حديث غريب وإسناده جيد لا بأس به. وقال ابن أبي حاتم حدثنا أبي حدثنا سليمان بن معبد حدثنا عمرو بن عاصم الكلائي حدثنا أبو عوانة عن أبي بشر جعفر بن أبي وحشية عن أبي وحشية عن يوسف بن سعد عن محمد بن حاطب وقال ونزل في داري حيث ظهر علي رضي الله عنه على أهل البصرة فقال لي يوما لقد شهدت أمير المؤمنين عليا رضي الله عنه وعنده عمار وصعصعة والأشتر ومحمد بن أبي بكر رضي الله عنهم فذكروا عثمان رضي الله عنه فنالوا منه فكان علي رضي الله عنه على السرير ومعه عود في يده فقال قائل منهم إن عندكم من يفصل بينكم فسألوه فقال علي رضي الله عنه كان عثمان رضي الله عنه من الذين قال الله تعالى \"أولئك الذين نتقبل عنهم أحسن ما عملوا ونتجاوز عن سيئاتهم في أصحاب الجنة وعد الصدق الذي كانوا يوعدون\" قال والله عثمان وأصحاب عثمان رضي الله قالها ثلاثا قال يوسف فقلت لمحمد بن حاطب الله لسمعت هذا من علي ؟ قال الله لسمعت هذا من علي رضي الله عنه."
    },
    {
      "ayah": 17,
      "surah": 46,
      "text": "لما ذكر تعالى حال الداعين للوالدين البارين بهما وما لهم عنده من الفوز والنجاة عطف بحال الأشقياء العاقين للوالدين فقال \"والذي قال لوالديه أف لكما\" وهذا عام في كل من قال هذا ومن زعم أنها نزلت في عبدالرحمن بن أبن بكر رضي الله عنهما فقوله ضعيف لأن عبدالرحمن بن أبي بكر رضي الله عنهما أسلم بعد ذلك وحسن إسلامه وكان من خيار أهل زمانه وروى العوفي عن ابن عباس رضي الله عنهما أنها نزلت في ابن لأبي بكر الصديق رضي الله عنهما وفى صحة هذا نظر والله تعالى أعلم. وقال ابن جريج عن مجاهد نزلت في عبدالله بن أبي بكر رضي الله عنهما قاله ابن جريج وقال آخرون عبدالرحمن بن أبي بكر رضي الله عنهم وهذا أيضا قول السدي وإنما هذا عام في كل من عق والديه وكذب بالحق فقال لوالديه \"أف لكما\" عقهما وقال ابن أبي حاتم حدثنا على بن الحسين حدثنا محمد بن العلاء حدثنا يحيى بن أبي زائدة عن إسماعيل بن أبي خالد أخبرني عبدالله بن المديني قال إني لفي المسجد حين خطب مروان فقال إن الله تعالى قد أرى أمير المؤمنين في يزيد رأيا حسنا وإن يستخلفه فقد استخلف أبو بكر وعمر رضي الله عنهما فقال عبدالرحمن بن أبي بكر رضي الله عنهما أهرقلية؟ إن أبا بكر رضي الله عنه والله ما جعلها في أحد من ولده ولا أحدا من أهل بيته ولا جعلها معاوية في ولده إلا رحمه وكرامة لولده فقال مروان ألست الذي قال لوالديه أف لكما؟ فقال عبدالرحمن رضي الله عنه ألست ابن اللعين الذي لعن رسول الله صلى الله عليه وسلم أباك قال وسمعتهما عائشة رضي الله عنها فقالت يا مروان أنت القائل لعبدالرحمن رضي الله عنه كذا وكذا كذبت ما فيه نزلت ولكن نزلت في فلان بن فلان ثم انتحب مروان ثم نزل عن المنبر حتى أتى باب حجرتها فجعل يكلمها حتى انصرف وقد رواه البخاري بإسناد آخر ولفظ آخر فقال حدثنا موسى بن إسماعيل حدثنا أبو عوانة عن أبي بشر عن يوسف بن ماهك قال كان مروان على الحجاز استعمله معاوية بن أبي سفيان رضي الله عنهما فخطب وجعل يذكر يزيد بن معاوية لكي يبايع له بعد أبيه فقال له عبدالرحمن بن أبي بكر رضي الله عنهما شيئا فقال خذوه فدخل بيت عائشة رضي الله عنها فلم يقدروا عليه فقال مروان إن هذا الذي أنزل فيه \"والذي قال لوالديه أف لكما أتعدانني أن أخرج وقد خلت القرون من قبلي\" فقالت عائشة رضي الله عنها من وراء الحجاب: ما أنزل الله عز وجل فينا شيئا من القرآن إلا أن الله تعالى أنزل عذري. \"طريق أخرى\" قال النسائي حدثنا علي بن الحسين حدثنا أمية بن خالد حدثنا شعبة عن محمد بن زياد قال لما بايع معاوية رضي الله عنه لابنه قال مروان سنة أبي بكر وعمر رضي الله عنهما فقال عبدالرحمن بن أبي بكر رضي الله عنهما سنة هرقل وقيصر فقال مروان هذا الذي أنزل الله تعالى فيه \"والذي قال لوالديه أف لكما\" الآية فبلغ ذلك عائشة رضي الله عنها فقالت كذب مروان والله ما هو به ولو شئت أن أسمي الذي أنزلت فيه لسميته ولكن رسول الله صلى الله عليه وسلم لعن أبا مروان ومروان في صلبه فمروان فضض من لعنة الله.وقوله \"أتعدانني أن أخرج\" أي أبعث \"وقد خلت القرون من قبلي\" أي قد مضى الناس فلم يرجع منهم مخبر \"وهما يستغيثان الله \" أي يسألان الله فيه أن يهديه ويقولان لولدهما \"ويلك آمن إن وعد الله حق فيقول ما هذا إلا أساطير الأولين\"."
    },
    {
      "ayah": 18,
      "surah": 46,
      "text": "قال الله تعالى \"أولئك الذين حق عليهم القول في أمم قد خلت من قبلهم من الجن والإنس إنهم كانوا خاسرين\" أي دخلوا في زمرة أشباههم وأضرابهم من الكافرين الخاسرين أنفسهم وأهليهم يوم القياما وقوله أولئك بعد قوله والذي قال دليل على ما ذكرناه من أنه جنس يعم كل من كان كذلك وقال الحسن وقتادة هو الكافر الفاجر العاق لوالديه المكذب بالبعث وقد روى الحافظ ابن عساكر في ترجمه سهل بن داود من طريق همام بن عمار حدثنا حماد بن عبدالرحمن حدثنا خالد الزبرقان العليمي عن سليم بن حبيب عن أبي أمامة الباهلي رضي الله عنه عن النبي صلى الله عليه وسلم قال \"أربعة لعنهم الله تعالى من فوق عرشه وأمنت عليهم الملائكة مضل المساكين\" قال خالد الذي يهوي بيده إلى المسكين فيقول هلم أعطيك فإذا جاءه قال ليس معي شيء \"والذي يقول للماعون ابن وليس بين يديه شيء والرجل يسأل عن دار القوم فيدلونه على غيرها والذي يضرب الوالدين حتى يستغيثا\" غريب جدا."
    },
    {
      "ayah": 19,
      "surah": 46,
      "text": "وقوله تبارك وتعالى \"ولكل درجات مما عملوا\" أي لكل عذاب بحسب عمله \"وليوفيهم أعمالهم وهم لا يظلمون\" أي لا يظلمهم مثقال ذرة فما دونها قال عبدالرحمن بن زيد بن أسلم درجات النار تذهب سفالا ودرجات الجنة تذهب علوا."
    },
    {
      "ayah": 2,
      "surah": 46,
      "text": "يخبر تعالى أنه أنزل الكتاب على عبده ورسوله محمد صلوات الله وسلامه عليه دائما إلى يوم الدين ووصف نفسه بالعزة التي لا ترام والحكمة في الأقوال والأفعال."
    },
    {
      "ayah": 20,
      "surah": 46,
      "text": "وقوله عز وجل \"ويوم يعرض الذين كفروا على النار أذهبتم طيباتكم في حياتكم الدنيا واستمتعتم بها أي يقال لهم ذلك تقريعا وتوبيخا وقد تورع أمير المؤمنين عمر بن الخطاب رضي الله عنه عن كثير من طيبات المآكل والمشارب وتنزه عنها ويقول إني أخاف أن أكون كالذين قال الله لهم ووبخهم وقرعهم \"أذهبتم طيباتكم فى حياتكم الدنيا واستمتعتم بها\" وقال أبو مجلز ليفقدن أقوام حسنات كانت لهم في الدنيا فيقال لهم \"أذهبتم طيباتكم في حياتكم الدنيا\" وقوله عز وجل \"فاليوم تجزون عذاب الهون بما كنتم تستكبرون في الأرض بغير الحق وبما كنتم تفسقون\" فجوزوا من جنس عملهم فكما متعوا أنفسهم واستكبروا عن اتباع الحق وتعاطوا الفسق والمعاصي جازاهم الله تبارك وتعالى بعذاب الهون وهو الإهانة والخزي والآلام الموجعة والحسرات المتتابعة والمنازل في الدركات المفظعة أجارنا الله سبحانه وتعالى من ذلك كله."
    },
    {
      "ayah": 21,
      "surah": 46,
      "text": "يقول تعالى مسليا لنبيه صلى الله عليه وسلم فى تكذيب من كذبه من قوله \"واذكر أخا عاد\" وهو هود عليه الصلاة والسلام بعثه الله عز وجل إلى عاد الأولى وكانوا يسكنون الأحقاف جمع حقف وهو الجبل من الرمل قاله ابن زيد وقال عكرمة الأحقاف الجبل والغار وقال على بن أبي طالب رضي الله عنهما الأحقاف واد بحضرموت يدعي برهوت تلقى فيه أرواح الكفار وقال قتادة ذكر لنا أن عادا كانوا حيا بالمن أهل رمل مشرفين على البحر بأرض يقال لها الشحر. قال ابن ماجه \"باب إذا دعا فليبدأ بنفسه\" حدثنا الحسين بن علي على الخلال حدثنا أبي حدثنا زيد بن الحباب حدثنا سفيان حدثنا علي بن إسحاق عن سعيد بن جبير عن ابن عباس رضي الله عنهما قال: قال رسول الله صلى الله عليه وسلم \" يرحمنا الله وأخا عاد \" وقوله تعالى \"وقد خلت النذر من بين يديه ومن خلفه\" يعني وقد أرسل الله تعالى إلى من حول بلادهم في القرى مرسلين ومنذرين كقوله عز وجل \"فجعلناها نكالا لما بين يديها وما خلفهما\" وكقوله جل وعلا \"فإن أعرضوا فقل أنذرتكم صاعقة مثل صاعقة عاد وثمود إذ جاءتهم الرسل من بين أيديهم ومن خلفهم ألا تعبدوا إلا الله إني أخاف عليكم عذاب يوم عظيم\"."
    },
    {
      "ayah": 22,
      "surah": 46,
      "text": "أي قال لهم هود ذلك فأجابه قومه قائلين \"أجئتنا لتأفكنا عن آلهتنا\" أي لتصدنا عن آلهتنا \"فائتنا بما تعدنا إن كنت من الصادقين\" استعجلوا عذاب الله وعقوبته استبعادا منهم وقوعه كقوله جلت عظمته \"يستعجل بها الذين لا يؤمنون بها\"."
    },
    {
      "ayah": 23,
      "surah": 46,
      "text": "\"قال إنما العلم عند الله \" أي الله أعلم بكم إن كنتم مستحقين لتعجيل العذاب فسيفعل ذلك بكم وأما أنا فمن شأني أني أبلغكم ما أرسلت به \"ولكني أراكم قوما تجهلون\" أي لا تعقلون ولا تفهمون."
    },
    {
      "ayah": 24,
      "surah": 46,
      "text": "قال الله تعالى \"فلما رأوه عارضا مستقبل أوديتهم\" أي لما رأوا العذاب مستقبلهم اعتقدوا أنه عارض ممطر ففرحوا واستبشروا به وقد كانوا ممحلين محتاجين إلى المطر قال الله تعالى \"بل هو ما استعجلتم به ريح فيها عذاب أليم\" أي هو العذاب الذي قلتم فائتنا بما تعدنا إن كنت من الصادقين."
    },
    {
      "ayah": 25,
      "surah": 46,
      "text": "\"تدمر\" أي تخرب \"كل شيء\" من بلادهم مما من شأنه الخراب \"بأمر ربها\" أي بإذن الله لها في ذلك كقوله سبحانه وتعالى \"ما تذر من شيء أتت عليه إلا جعلته كالرميم\" أي كالشيء البالي ولهذا قال عز وجل \"فأصبحوا لا يرى إلا مساكنهم\" أي قد بادوا كلهم عن آخرهم ولم تبق لهم باقية \"كذلك نجزي القوم المجرمين\" أي هذا حكمنا فيمن كذب رسلنا وخالف أمرنا وقد ورد حديث في قصتهم وهو غريب جدا من غرائب الحديث وأفراده قال الإمام أحمد حدثنا زيد بن الحباب حدثني أبو المنذر سلام بن سليمان النحوي قال حدثنا عاصم بن أبي النجود عن أبي وائل عن الحارث البكري قال خرجت أشكو العلاء بن الحضرمي إلى رسول الله صلى الله عليه وسلم فمررت بالربذة فإذا عجوز من بني تميم منقطع بها فقالت لي يا عبدالله: إن لي إلى رسول الله حاجة فهل أنت مبلغي إليه؟ قال فحملتها فأتيت بها المدينة فإذا المسجد غاص بأهله وإذا راية سوداء تخفق وإذا بلال رضي الله عنه متقلدا السيف بين يدي رسول الله صلى الله عليه وسلم فقلت ما شأن الناس؟ قالوا يريد أن يبعث عمرو بن العاص رضى الله عنه وجها قال فجلست فدخل منزله أو قال رحله فاستأذنت عليه فأذن لي فدخلت فسلمت فقال صلى الله عليه وسلم \" هل كان بينكم وبين تميم شيء؟ \" قلت نعم وكانت لنا الدائرة عليهم ومررت بعجوز من بني تميم منقطع بها فسألتني أن أحملها إليك فها هي بالباب فإذن لها فدخلت فقلت يا رسول الله إني رأيت أن تجعل بيننا وبين تميم حاجزا فاجعل الدهناء فحميت العجوز واستوفزت وقالت يا رسول الله فإلى أين يضطر مضطرك؟ قال: قلت إن مثلي ما قال الأول: معزى حملت حتفها حملت هذه ولا أشعر أنها كانت لي خصما أعوذ بالله ورسوله أن أكون كوافد عاد قال لي \" وما وافد عاد؟ \" وهو أعلم بالحديث منه ولكن يستطعمه قلت إن عادا قحطوا فبعوا وفدا لهم يقال له قيل فمر بمعاوية بن بكر فأقام عنده شهرا يسقيه الخمر وتغنيه جاريتان يقال لهما الجرادتان فلما مضى الشهر خرج إلى جبال مهرة فقال اللهم إنك تعلم أني لم أجيء إلى مريض فأداويه ولا إلى أسير فأفاديه اللهم اسق عادا ما كنت تسقيه فمرت به سحابات سود فنودي منها اختر فأومأ إلى سحابة منها سوداء فنودي منها خذها رمادا لا تبقى من عاد أحدا قال فما بلغني أنه أرسل عليهم من الريح إلا قدر ما يجري في خاتمي هذا حتى هلكوا قال أبو وائل وصدق وكانت المرأة والرجل إذا بعثوا وافدا لهم قالوا لا تكن كوافد عاد ورواه الترمذي والنسائي وابن ماجه كما تقدم في سورة الأعراف. وقال الإمام أحمد حدثنا هارون بن معروف أخبرنا ابن وهب أخبرنا عمرو أن أبا النضر حدثه عن سليمان بن يسار عن عائشة رضي الله عنها أنها قالت ما رأيت رسول الله صلى الله عليه وسلم مستجمعا ضاحكا حتى أرى منه لهواته إنما كان يتبسم وقالت كان رسول الله صلى الله عليه وسلم إذا رأى غيما أو ريحا عرف ذلك في وجهه قالت يا رسول الله إن الناس إذا رأوا الغيم فرحوا رجاء أن يكون فيه المطر وأراك إذا رأيته عرفت في وجهك الكراهية فقال رسول الله صلى الله عليه وسلم \" يا عائشة ما يؤمنني أن يكون فيه عذاب قد عذب قوم بالريح وقد رأى قوم العذاب وقالوا هذا عارض ممطرنا \" وأخرجاه من حديث ابن وهب \"طريق أخرى\" قال الإمام أحمد حدثنا عبدالرحمن عن سفيان عن المقدام بن شريح عن أبيه جن عائشة رضي الله عنها قالت إن رسول الله صلى الله عليه وسلم كان إذا رأى ناشئا في أفق من آفاق السماء ترك عمله وإن كان في صلاته ثم يقول \"اللهم إني أعوذ بك من شر ما فيه فإن كشفه الله تعالى حمد الله عز وجل وإن أمطر قال اللهم صيبا نافعا \" \"طريق أخرى\" قال مسلم فى صحيحه حدثنا أبو بكر الطاهر أخبرنا ابن وهب قال سمعت ابن جريج يحدثنا عن عطاء بن أبي رباح عن عائشة رضي الله عنها قالت كان رسول الله صلى الله عليه وسلم إذا عصفت الريح قال \"اللهم إني أسألك خيرها وخير ما فيها وخير ما أرسلت به وأعوذ بك من شرها وشر ما فيها وشر ما أرسلت به \" قالت وإذا تخبلت السماء تغير لونه وخرج ودخل وأقبل وأدبر فإذا أمطرت سري عنه فعرفت ذلك عائشة رضي الله عنها فسألته فقال رسول الله صلى الله عليه وسلم \" لعله يا عائشة كما قال قوم عاد \"فلما رأوه عارضا مستقبل أوديتهم قالوا هذا عارض ممطرنا\" وقد ذكرنا قصة هلاك قوم عاد في سورة الأعراف وهود بما أغنى عن إعادته ههنا ولله تعالى الحمد والمنة وقال الطبراني حدثنا عبدان بن أحمد حدثنا إسماعيل بن زكريا الكوفي حدثنا أبو مالك بن مسلم الملائي عن مجاهد وسعيد بن جبير عن ابن عباس قال: قال رسول الله صلى الله عليه وسلم \" ما فتح على عاد من الريح إلا مثل موضع الخاتم ثم أرسلت عليهم في البدو إلى الحضر فلما رآها أهل الحضر قالوا هذا عارض ممطرنا مستقبل أوديتنا وكان أهل البوادي فيها فألقى أهل البادية على أهل الحاضرة حتى هلكوا ـ قال ـ عتت على خزانها حتى خرجت من خلال الأبواب \" والله سبحانه وتعالى أعلم."
    },
    {
      "ayah": 26,
      "surah": 46,
      "text": "يقول تعالى ولقد مكنا الأمم السالفة في الدنيا من الأموال والأولاد وأعطيناهم منها ما لم نعطكم مثله ولا قريبا منه \"وجعلنا لهم سمعا وأبصارا وأفئدة فما أغنى عنهم سمعهم ولا أبصارهم ولا أفئدتهم من شيء إذ كانوا يجحدون بآيات الله وحاق بهم ما كانوا به يستهزئون\" أي وأحاط بهم العذاب والنكال الذي كانوا يكذبون به ويستبعدون وقوعه أي فاحذروا أيها المخاطبون أن تكونوا مثلهم فيصيبكم مثل ما أصابهم من العذاب في الدنيا والآخرة."
    },
    {
      "ayah": 27,
      "surah": 46,
      "text": "وقوله تعالى \"ولقد أهلكنا ما حولكم من القرى\" يعني أهل مكة قد أهلك الله الأمم المكذبة بالرسل مما حولها كعاد وكانوا بالأحقاف بحضرموت عند اليمن وثمود وكانت منازلهم بينهم وبين الشام وكذلك سبأ وهم أهل اليمن ومدين وكانت في طريقهم وممرهم إلى غزة وكذلك بحيرة قوم لوط كانوا يمرون بها أيضا وقوله عز وجل \"وصرفنا الآيات\" أي بيناها وأوضحناها \"لعلهم يرجعون\"."
    },
    {
      "ayah": 28,
      "surah": 46,
      "text": "\"فلولا نصرهم الذين اتخذوا من دون الله قربانا آلهة\" أي فهل نصروهم عند احتياجهم إليهم؟ بل ضلوا عنهم أي بل ذهبوا عنهم أحوج ما كانوا إليهم \"وذلك إفكهم\" أي كذبهم \"وما كانوا يفترون\" أي وافتراؤهم في اتخاذهم إياهم آلهة وقد خابوا وخسروا في عبادتهم لها واعتمادهم عليها والله أعلم."
    },
    {
      "ayah": 29,
      "surah": 46,
      "text": "قال الإمام أحمد حدثنا سفيان حدثنا عمرو سمعت عكرمة عن الزبير \"وإذ صرفنا إليك نفرا من الجن يستمعون القرآن\" قال بنخلة ورسول الله صلى الله عليه وسلم يصلي العشاء الآخرة \"كادوا يكونون عليه لبدا\" قال سفيان ألبد بعضهم على بعض كاللبد بعضه على بعض تفرد به أحمد وسيأتي من رواية ابن جرير عن عكرمة عن ابن عباس أنهم سبعة من جن نصيبين وقال الإمام أحمد حدثنا عفان حدثنا أبن عوانة ح وقال الإمام الشهير الحافظ أبو بكر البيهقي في كتابه دلائل النبوة أخبرنا أبو الحسن علي بن أحمد بن عبدان أخبرنا أحمد بن عبيد الصفار حدثنا إسماعيل القاضي أخبرنا مسدد حدثنا أبو عوانة عن أبي بشر عن سعيد بن جبير عن ابن عباس رضي الله عنهما قال: ما قرأ رسول الله صلى الله عليه وسلم على الجن ولا رآهم انطلق رسول الله صلى الله عليه وسلم فى طائفة من أصحابه عامدين إلى سوق عكاظ وقد حيل بين الشياطين وبين خبر السماء وأرسلت عليهم الشهب فرجعت الشياطين إلى قومهم فقالوا ما لكم؟ فقالوا حيل بيننا وبين خبر السماء وأرسلت علينا الشهب قالوا ما حال بينكم وبين خبر السماء إلا شيء حدث فاضربوا مشارق الأرض ومغاربها وانظروا ما هذا الذي حال بينكم وبين خبر السماء فانطلقوا يضربون مشارق الأرض ومغاربها يبتغون ما هذا الذي حال بينهم وبين خبر السماء فانصرف أولئك النفر الذين توجهوا نحو تهامة إلى رسول الله صلى الله عليه وسلم وهو بنخلة عامدا إلى سوق عكاظ وهو يصلي بأصحابه صلاة الفجر فلما سمعوا القرآن استمعوا له فقالوا هذا والله الذي حال بينكم وبين خبر السماء فهنالك حين رجعوا إلى قومهم فقالوا \"إنا سمعنا قرآنا عجبا يهدي إلى الرشد فآمنا به ولن نشرك بربنا أحدا\" وأنزل الله على نبيه صلى الله عليه وسلم \"قل أوحى إلى أنه استمع نفر من الجن\" وإنما أوحي إليه قول الجن رواه البخاري عن مسدد بنحوه وأخرجه مسلم عن شيبان بن فروج عن أبي عوانة به. ورواه الترمذي والنسائي في التفسير من حديث أبي عوانة وقال الإمام أحمد أيضا حدثنا أبو أحمد حدثنا إسرائيل عن أبي إسحاق عن سعيد ابن جبير عن ابن عباس رضي الله عنهما قال كان الجن يستمعون الوحي فيسمعون الكلمة فيزيدون فيها عشرا فيكون ما سمعوا حقا وما زادوا باطلا وكانت النجوم لا يرمي بها قبل ذلك فلما بعث رسول الله صلى الله عليه وسلم كان أحدهم لا يأتي مقعده إلا رمي بشهاب يحرق ما أصاب فشكوا ذلك إلى إبليس فقال ما هذا إلا من أمر قد حدث فبث جنوده فإذا بالنبي صلى الله عليه وسلم يصلي بين جبلي نخلة فأتوه فأخبروه فقال هذا الحدث الذي حدث في الأرض ورواه الترمذي والنسائي فى كتابي التفسير من سننيهما من حديث إسرائيل به وقال الترمذي حسن صحيح وهكذا رواه أيوب عن سعيد بن جبير عن ابن عباس رضي الله عنهما. وكذا رواه العوفي عن ابن عباس أيضا بمثل هذا السياق بطوله وهكذا قال الحسن البصري إنه صلى الله عليه وسلم ما شعر بأمرهم حتى أنزل الله تعالى عليه بخبرهم وذكر محمد بن إسحاق عن يزيد بن رومان عن محمد بن كعب القرظي قصة خروج النبي صلى الله عليه وسلم إلى الطائف ودعائه إياهم إلى الله عز وجل وأبائهم عليه فذكر القصة بطولها وأورد ذلك الدعاء الحسن \"اللهم إليك أشكو ضعف قوتي وقلة حيلتي وهواني على الناس يا أرحم الراحمين أنت أرحم الراحمين وأنت رب المستضعفين وأنت ربي إلى من تكلني؟ إلى عدو بعيد يتجهمني أم إلى صديق قريب ملكته أمري إن لم يكن بك غضب علي فلا أبالي غير أن عافيتك أوسع لي أعوذ بنور وجهك الذي أشرقت له الظلمات وصلح عليه أمر الدنيا والآخرة أن ينزل بي غضبك أو يحل بي سخطك ولك العتبي حتى ترضى ولا حول ولا قوة إلا بك \" قال فلما انصرف عنهم بات بنخلة فقرأ تلك الليلة من القرآن فاستمعه الجن من أهل نصيبين وهذا صحيح ولكن قوله إن الجن كان استماعهم تلك الليلة فيه نظر فإن الجن كان استماعهم في ابتداء الإيحاء كما دل عليه حديث ابن عباس رضي الله عنهما المذكور وخروجه صلى الله عليه وسلم إلى الطائف كان بعد موت عمه وذلك قبل الهجرة بسنة أو سنتين كما قرره ابن إسحاق وغيره والله أعلم وقال أبو بكر بن أبي شيبة حدثنا أبو أحمد الزبيري حدثنا سفيان عن عاصم عن زر عن عبدالله بن مسعود رضي الله عنه قال: هبطوا على النبي صلى الله عليه وسلم وهو يقرأ القرآن ببطن نخلة \"فلما سمعوه قالوا أنصتوا\" قال صه وكانوا تسعة أحدهم زوبعة فأنزل الله عز وجل \"وإذا صرفنا إليك نفرا من الجن يستمعون القرآن فلما حضروه قالوا أنصتوا فلما قضى ولوا إلى قومهم منذرين\" ـ إلى ـ \"ضلال مبين\" فهذا مع الأول من رواية ابن عباس رضي الله عنهما يقتضي أن رسول الله صلى الله عليه وسلم لم يشعر بحضورهم في هذه المرة وإنما استمعوا قراءته ثم رجعوا إلى قومهم ثم بعد ذلك وفدوا إليه أرسالا قوما بعد قوم وفوجا بعد فوج كما ستأتي بذلك الأخبار في موضعها والآثار مما سنوردها ههنا إن شاء الله تعالى وبه الثقة. فأما ما رواه البخاري ومسلم جميعا عن أبي قدامة عبيد الله بن سعيد السرخسي عن أبي أسامة حماد بن أسامة عن مسعر بن ندام عن معن بن عبد الرحمن. قال سمعت أبي يقول سألت مسروقا من آذن النبي صلى الله عليه وسلم ليلة استمعوا القرآن؟ فقال حدثني أبوك يعني ابن مسعود رضي الله عنه أنه آذنته بهم شجرة فيحتمل أن يكون هذا في المرة الأولى ويكون إثباتا مقدما على نفي ابن عباس رضي الله عنهما ويحتمل أن يكون في الأولى ولكن لم يشعر بهم حال استماعهم حتى آذنته بهم الشجرة أي أعلمته باجتماعهم والله أعلم ويحتمل أن يكون هذا في بعض الميرات المتأخرات والله أعلم. قال الحافظ البيهقي وهذا الذي حكاه ابن عباس رضي الله عنه إنما هو أول ما سمعت الجن قراءة رسول الله صلى الله عليه وسلم وعلمت حاله وفي ذلك الوقت لم يقرأ عليهم ولم يرهم ثم بعد ذلك أتاه داعي الجن فقرأ عليهم القرآن ودعاهم إلى الله عز وجل كما رواه عبدالله بن مسعود. \"ذكر الروايات عنه بذلك\" قال الإمام أحمد حدثنا إسماعيل بن إبراهيم حدثنا داود عن الشعبي وابن أبي زائدة أخبرنا داود عن الشعبي عن علقمة قال: قلت لعبدالله بن مسعود رضي الله عنه هل صحب رسول الله صلى الله عليه وسلم ليلة الجن منكم أحد؟ فقال ما صحبه منا أحد ولكنا فقدناه ذات ليلة بمكة فقلنا اغتيل؟ استطير؟ ما فعل؟ قال فبتنا بشر ليلة بات بها قوم فلما كان في وجه الصبح أو قال في السحر إذا نحن به يجيء من قبل حراء فقلنا يا رسول الله فذكروا له الذي كانوا فيه فقال \"إنه أتاني داعي الجن فأتيتهم فقرأت عليهم\" قال فانطلق فأرانا آثارهم وآثار نيرانهم قال: قال الشعبي سألوه الزاد قال عامر سألوه بمكة وكانوا من جن الجزيرة فقال \"كل عظم ذكر اسم الله عليه يقع في أيديكم أوفر ما يكون لحما وكل بعرة أو روثة علف لدوابكم قال فلا تستنجوا بهما فإنهما زاد إخوانكم من الجن\" وهكذا رواه مسلم في صحيحه عن علي بن حجر عن إسماعيل بن علية به نحوه. وقال مسلم أيضا حدثنا محمد بن المثنى حدثنا عبدالأعلى حدثنا داود وهو ابن أبي هند عن عامر قال: سألت علقمة هل كان ابن مسعود رضي الله عنه شهد مع رسول الله صلى الله عليه وسلم ليلة الجن قال: فقال علقمة: أنا سألت ابن مسعود رضي الله عنه فقلت هل شهد أحد منكم مع رسول الله صلى الله عليه وسلم ليلة الجن؟ قال لا ولكنا كنا مع رسول الله صلى الله عليه وسلم ذات ليلة ففقدناه فالتمسناه في الأودية والشعاب فقيل استطير؟ اغتيل؟ قال فبتنا بشر ليلة بات بها قوم فلما أصبحنا إذا هو جاء من قبل حراء قال: رسول الله فقدناك فطلبناك فلم نجدك فبتنا بشر ليلة بات بها قوم فقال \"أتاني داعي الجن فذهبت معهم فقرأت عليهم القرآن \" قال فانطلق بنا فأرانا آثارهم وآثار نيرانهم وسألوه الزاد فقال \"كل عظم ذكر اسم الله عليه يقع في أيديكم أوفر ما يكون لحما وكل بعرة أو روثة علف لدوابكم\" قال رسول الله صلى الله عليه وسلم \"فلا تستنجوا بهما فإنهما طعام إخوانكم\" \"طريق أخرى\" عن ابن مسعود رضي الله عنه قال أبو جعفر بن جرير حدثني أحمد بن عبد الرحمن حدثني عمي حدثني يونس عن الزهري عن عبيد الله قال: إن عبدالله بن مسعود قال: سمعت رسول الله صلى الله عليه وسلم يقول \" بت الليلة أقرأ على الجن واقفا بالحجون\" \"طريق أخرى\" فيها إنه كان معه ليلة الجن ابن جرير رحمه الله حدثني أحمد بن عبدالرحمن بن وهب حدثنا عمي عبدالله بن وهب أخبرني يونس عن ابن شهاب عن أبي عثمان بن شبة الخزاعي وكان من أهل الشام قال: إن عبدالله بن مسعود رضي الله عنه قال رسول الله صلى الله عليه وسلم لأصحابه وهو بمكة \" من أحب منكم أن يحضر أمر الجن الليلة فليفعل\" فلم يحضر منهم أحد غيري قال فانطلقنا حتى إذا كنا بأعلى مكة خط لي برجله خطا ثم أمرني أن أجلس فيه ثم انطلق حتى قام فافتتح القرآن فغشيته أسودة كثيرة حالت بين وبينه حتى ما أسمع صوته ثم طفقوا يتقطعون مثل قطع السحاب ذاهبين حتى بقي منهم رهط ففرغ رسول الله صلى الله عليه وسلم مع الفجر فانطلق فتبرز ثم أتاني فقال \" ما فعل الرهط؟ \" قلت هم أولئك رسول الله فأعطاهم عظما وروثا زادا ثم نهى أن يستطيب أحد بروث أو عظم. ورواه ابن جرير عن محمد بن عبدالله بن عبدالحكم عن أبي زرعة وهب بن بن راشد عن يونس بن يزيد الأيلي به. ورواه البيهقي في الدلائل من حديث عبدالله بن صالح كاتب الليث عن يونس به وقد روى إسحاق بن راهواية عن جرير عن قابوس بن أبي ظبيان عن أبيه عن ابن مسعود رضي الله عنه فذكر نحو ما تقدم ورواه الحافظ أبو نعيم من طريق موسى بن عبيدة عن سعيد بن الحارث عن أبي المعلى عن ابن مسعود رضي الله عنه فذكر نحوه أيضا. \"طريق أخرى\" قال أبو نعيم حدثنا أبو بكر بن مالك حدثنا عبدالله بن أحمد بن حنبل حدثني أبي قال حدثنا عفان وعكرمة قالا حدثنا معتمر قال: قال أبي حدثني أبو تميمة عن عمرو ولعله قد يكون قال البكالي يحدثه عمرو عن عبدالله بن مسعود رضي الله عنه قال: استتبعني رسول الله صلى الله عليه وسلم فانطلقنا حتى أتينا مكان كذا وكذا فخط لي خطا فقال \" كن بين ظهر هذه لا تخرج منها فإنك إن خرجت منها هلكت \" فذكر الحديث بطوله وفيه غرابة شديدة \"طريق أخرى\" قال ابن جرير حدثنا ابن عبدالأعلى حدثنا ابن ثور عن معمر عن يحيى بن أبي كثير عن عبدالله بن عمرو بن غيلان الثقفي أنه قال لابن مسعود حدثت أنك كنت مع رسول الله صلى الله عليه وسلم ليلة وفد الجن قال أجل قال فكيف كان؟ فذكر الحديث وذكر أن النبي صلى الله عليه وسلم خط عليه خطا وقال \" لا تبرح منها \" فذكر مثل العجاجة السوداء فغشيت رسول الله صلى الله عليه وسلم فذعر ثلاث مرات حتى إذا كان قريبا من الصبح أتاني النبي صلى الله عليه وسلم فقال \" أنمت؟ \" فقلت لا والله ولعد هممت مرارا أن أستغيث بالناس حتى سمعتك تقرعهم بعصاك تقول \" اجلسوا \" فقال صلى الله عليه وسلم \" لو خرجت لم آمن أن يتخطفك بعضهم \" ثم قال صلى الله عليه وسلم \" هل رأيت شيئا؟ \" قلت نعم رأيت رجالا سودا مستثفرين ثيابا بياضا قال صلى الله عليه وسلم \" أولئك جن نصيبين سألوني المتاع ـ والمتاع الزاد ـ فمتعتهم بكل عظم حائل أو بعرة أو روثة \" ـ فقلت يا رسول الله وما يغني ذلك عنهم؟ فقال صلى الله عليه وسلم ـ \" إنهم لا يجدون عظما إلا وجدوا عليه لحمه يوم أكل ولا ورثا إلا وجدوا فيها حبها يوم أكلت فلا يستنقين أحد منكم إذا خرج من الخلاء بعظم ولا بعرة ولا روثة \" \"طريق أخرى\" قال الحافظ أبو بكر البيهقي أخبرنا أبو عبد الرحمن السلمي وأبو نصر بن قتاده قال أخبرنا أبو محمد يحيى بن منصور القاضي حدثنا أبو عبدالله بن إبراهيم البوشنجي حدثنا روح بن صلاح حدثنا موسى بن علي بن رباح عن أبيه عن عبدالله بن مسعود رضي الله عنه قال استتبعني رسول الله صلى الله عليه وسلم فقال \" إن نفرا من الجن خمسة عشر بني إخوة وبني عم يأتوني الليلة أقرأ عليهم القرآن \"فانطلق معه إلى المكان الذي أراد فخط لي خطا وأجلسني فيه وقال لي \"لا تخرج من هذا\" فبت فيه حتى أتاني رسول الله صلى الله عليه وسلم مع السحر في يده عظم حائل وروثة وحمة فقال \" إذا ذهبت إلى الخلاء فلا تستنج بشيء من هؤلاء \" قال فلما أصبحت قلت لأعلمن حيث كان رسول الله صلى الله عليه وسلم قال فذهبت فرأيت موضع مبرك ستين بعيرا. \"طريق أخرى\" قال البيهقي أخبرنا أبو عبدالله الحافظ أخبرنا أبو العباس الأصم حدثنا العباس بن محمد الدوري حدثنا عثمان بن عمر عن الشمر بن الريان عن أبي الجوزاء عن عبدالله بن مسعود رضي الله عنه قال انطلقت مع رسول الله صلى الله عليه وسلم ليلة الجن حتى أتى الحجون فخط لي خطا ثم تقدم إليهم فازدحموا عليه فقال سيد لهم يقال له وزدان أنا أرحلهم عنك فقال \" إني لن يجيرني من الله أحد \". \"طريق أخرى\" قال الإمام أحمد حدثنا عبدالرزاق حدثنا سفيان عن أبي فزارة العبسي حدثنا أبو زيد مولى عمرو بن حريث عن ابن مسعود رضي الله عنه قال لما كان ليلة الجن قال لي النبي صلى الله عليه وسلم \"أمعك ماء؟\" قلت ليس معي ماء ولكن معي إداوة فيها نبيذ فقال النبي صلى الله عليه وسلم \" تمرة طيبة وماء طهور \" ورواه أبو داود والترمذي وابن ماجه من حديث ابن زيد به. \"طريق أخرى\" قال الإمام أحمد حدثنا يحيى بن إسحاق أخبرنا ابن لهيعة عن قيس بن الحجاج عن حنش الصنعاني عن ابن عباس عن عبدالله بن مسعود رضي الله عنه قال إنه كان مع رسول الله صلى الله عليه وسلم ليلة الجن فقال رسول الله صلى الله عليه وسلم \" يا عبدالله أمعك ماء \" قال: معي نبيذ في إداوة قال صلى الله عليه وسلم \"اصبب علي\" فتوضأ فقال النبي صلى الله عليه وسلم \" يا عبدالله شراب وطهور \" تفرد به أحمد من هذا الوجه وقد أورده الدارقطني من طريق آخر عن ابن مسعود رضي الله عنه به. \"طربن أخرى\" قال الإمام أحمد حدثنا عبدالرزاق أخبرني أبي عن ميناء عن عبدالله رضي الله عنه قال كنت مع رسول الله صلى الله عليه وسلم ليلة وفد الجن فلما انصرف تنفس فقلت ما شأنك؟ قال \" نعيت إلي نفسي يا ابن مسعود \" هكذا رأيته فى المسند مختصرا وقد رواه الحافظ أبو نعيم في كتابه دلائل النبوة فقال حدثنا سليمان بن أحمد بن أيوب حدثنا إسحاق بن إبراهيم وحدثنا أبو بكر بن مالك حدثنا عبدالله بن أحمد بن حنبل حدثنا أبي قالا حدثنا عبد الرزاق عن أبيه عن ميناء عن ابن مسعود قال. كنت مع رسول الله صلى الله عليه وسلم ليلة وفد الجن فتنفس فقلت مالك يا رسول الله؟ قال \" نعيت إلي نفسي يا ابن مسعود \" قلت استخلف قال \" من؟ \" قلت أبا بكر قال فسكت ثم مضى ساعة فتنفس فقلت ما شأنك بأبي أنت وأمى يا رسول الله؟ قال \" نعيت إلي نفسي يا ابن مسعود \" قلت فاستخلف قال من؟ \" قلت عمر فسكت ثم مضى ساعة ثم تنفس فقلت ما شأنك. قال \" نعيت إلي نفسي \" قلت فاستخلف قال صلى الله عليه وسلم \" من؟ \" قلت علي بن أبي طالب رضي الله عنه قال صلى الله عليه وسلم: أما والذي نفسي بيده لئن أطاعوه ليدخلن الجنة أجمعين أكتعين \" وهو حديث غريب جدا وأحرى به أن لا يكون محفوظا وبتقدير صحته فالظاهر أن هذا بعد وفودهم إليه بالمدينة على ما سنورده إن شاء الله تعالى فإن في ذلك الوقت كان في آخر الأمر لما فتحت مكة ودخل الناس والجان أيضا في دين الله أفواجا نزلت سورة \"إذا جاء نصر الله والفتح ورأيت الناس يدخلون في دين الله أفواجا فسبح بحمد ربك واستغفره\" إنه كان توابا وهي السورة التي نعيت نفسه الكريمة فيها إليه كما نص على ذلك ابن عباس رضي الله عنهما ووافقه عمر بن الخطاب رضى الله عنه عليه وقد ورد في ذلك حديث سنورده إن شاء الله تعالى عند تفسيرها والله أعلم وقد رواه أبو نعيم أيضا عن الطبراني عن محمد بن عبدالله الحضرمي عن علي بن الحسين بن أبي بردة عن يحيى بن سعيد الأسلمي عن حرب بن صبيح عن سعيد بن سلمة عن أبي مرة الصنعاني عن أبي عبدالله الجدلي عن ابن مسعود رضى الله عنه فذكره وذكر فيه قصة الاستخلاف وهذا إسناد غريب وسياق عجيب. \"طريق أخرى\" قال الإمام أحمد: حدثنا أبو سعيد حدثنا حماد بن سلمة عن علي بن زيد عن أبي رافع عن ابن مسعود أن رسول الله صلى الله عليه وسلم خط حوله فكان أحدهم مثل سواد النحل وقال \" لا تبرح مكانك فأقرئهم كتاب الله \" فلما رأى المرعى قال كأنهم هؤلاء وقال النبي صلى الله عليه وسلم \" أمعك ماء؟ \" قلت لا قال: \" أمعك نبيذ؟ \" قلت نعم فتوضأ به \"طريق أخرى مرسلة\" قال ابن أبي حاتم حدثنا أبو عبدالله الطهراني أخبرنا حفص بن عمر العدني حدثنا الحكم بن أبان عن عكرمة فى قوله تعالى \"وإذ صرفنا إليك نفرا من الجن\" قال هم اثنا عشر ألفا جاءوا من جزيرة الموصل فقال النبي صلى الله عليه وسلم لابن مسعود \" أنظرني حتى آتيك \" وخط عليه خطا وقال \" لا تبرح حتى آتيك \" فلما خشيهم ابن مسعود رضي الله عنه كاد أن يذهب فذكر قول رسول الله صلى الله عليه وسلم فلم يبرح فقال له النبي صلى الله عليه وسلم \" لو ذهبت ما التقينا إلى يوم القيامة\". \"طريق أخرى مرسلة أيضا\" قال سعيد بن أبي عروبة عن قتادة في قوله تعالى \"وإذ صرفنا إليك نفرا من الجن يستمعون القرآن\" قال ذكر لنا أنهم صرفوا إليه من نينوى وأن نبي الله صلى الله عليه وسلم قال \" إني أمرت أن أقرأ على الجن فأيكم يتبعني؟ \" فأطرقوا ثم استتبعهم فأطرقوا ثم استتبعهم الثالثة فقال رجل يا رسول الله إن ذاك لذو ندبة فأتبعه ابن مسعود أخو هذيل قال فدخل النبي صلى الله عليه وسلم شعبا يقال له شعب الحجون وخط عليه وخط على ابن مسعود خطا ليثبته بذلك قال فجعلت أهال وأرى أمثال النسور تمشي في دفوفها وسمعت لغطا شديدا حتى خفت على نبي الله صلى الله عليه وسلم ثم تلا القرآن فلما رجع رسول الله صلى الله عليه وسلم قلت رسول الله ما اللغط الذي سمعت؟ قال \" اختصموا في قتيل فقضي بينهم بالحق \" رواه ابن جرير وابن أبي حاتم. فهذه الطرق كلها تدل عل أنه صلى الله عليه وسلم ذهب إلى الجن قصدا فتلا عليهم القرآن ودعاهم إلى الله عز وجل وشرع الله تعالى لهم على لسانه ما هم محتاجون إليه في ذلك الوقت وقد يحتمل أن أول مرة سمعوه يقرأ القرآن لم يشعر بهم كما قاله ابن عباس رضي الله عنهما ثم بعد ذلك وفدوا إليه كما رواه ابن مسعود رضي الله عنه وأما ابن مسعود فإنه لم يكن مع رسول الله صلى الله عليه وسلم حال مخاطبته الجن ودعائه إياهم وإنما كان بعيدا منه ولم يخرج مع النبي صلى الله عليه وسلم أحد سواه ومع هذا لم يشهد حال المخاطبة هذه طريقة البيهقي. وقد يحتمل أن يكون أول مرة خرج إليهم لم يكن معه صلى الله عليه وسلم ابن مسعود ولا غيره كما هو ظاهر سياق الرواية الأولى من طريق الإمام أحمد وهي عند مسلم ثم بعد ذلك خرج معه ليلة أخرى والله أعلم كما روى ابن أبي حاتم في تفسير \"قل أوحي إلي\" من حديث ابن جريج قال: قال عبد العزيز بن عمر: أما الجن الذين لقوه بنخلة فجن نينوى وأما الجن الذين لقوه بمكة فجن نصيبين وتأوله البيهقي على أنه يقول فبتنا بشر ليلة بات بها قوم على غير ابن مسعود رضي الله عنه ممن لم يعلم بخروجه صلى الله عليه وسلم إلى الجن وهو محتمل على بعد والله أعلم. وقد قال الحافظ أبو بكر البيهقي أخبرنا أبو عمرو محمد بن عبدالله الأديب حدثنا أبو بكر الإسماعيلي أخبرنا الحسن بن سفيان حدثني سويد بن سعيد حدثنا عمرو بن يحيى عن جده سعيد بن عمرو قال كان أبو هريرة رضي الله عنه يتبع رسول الله صلى الله عليه وسلم بإداوة لوضوئه وحاجته فأدركه يوما فقال \" من هذا؟ \" قال أنا أبو هريرة قال صلى الله عليه وسلم \" ائتني بأحجار استنج بها ولا تأتني بعظم ولا روثة \" فأتيته بأحجار في ثوبي فوضعتها إلى جنبه حتى إذا فرغ وقام اتبعته فقلت يا رسول الله ما بال العظم والروثة؟ قال صلى الله عليه وسلم \" أتاني وفد جن نصيبين فسألوني الزاد فدعوت الله تعالى لهم أن لا يمروا بروثة ولا عظم إلا وجدوه طعاما \" أخرجه البخاري في صحيحه عن موسى بن إسماعيل عن عمرو بن يحيى بإسناده قريبا منه فهذا يدل مع ما تقدم على أنهم وفدوا عليه بعد ذلك. وسنذكر إن شاء الله تعالى ما يدل على تكرار ذلك. وقد روي عن ابن عباس غير ما روي عنه أولا من وجه جيد فقال ابن جرير حدثنا أبو كريب حدثنا عبدالحميد الحماني حدثنا النضر بن عربي عن عكرمة عن ابن عباس رضي الله عنهما في قوله تعالى \"وإذ صرفنا إليك نفرا من الجن\" الآية قال كانوا سبعة نفر من أهل نصيبين فجعلهم رسول الله صلى الله عليه وسلم رسلا إلى قومهم. فهذا يدل على أنه قد روى القصتين. وقال ابن أبي حازم حدثنا علي بن الحسين حدثنا سويد بن عبدالعزيز حدثنا رجل سماه عن ابن جريج عن مجاهد \"وإذ صرفنا إليك نفرا من الجن\" الآية قال كانوا سبعة نفر ثلاثة من أهل حران وأربعة من أهل نصيبين وكانت أسماؤهم حسى وحسي ومنسى وساصر وناصر والأردوبيان والأحتم وذكر أبو حمزة الثمالي أن هذا الحي من الجن كان يقال لهم بنو الشيصبان وكانوا أكثر الجن عددا وأشرفهم نسبا وهم كانوا عامة جنود إبليس. وقال سفيان الثوري عن عاصم عن ذر عن ابن مسعود رضي الله عنه كانوا تسعة أحدهم زوبعة أتوه من أصل نخلة وتقدم عنهم أنهم كانوا خمسة عشر. وفي رواية أنهم كانوا على ستين راحلة وتقدم عنه أن اسم سيدهم وردان وقيل كانوا ثلثمائة وتقدم عن عكرمة أنهم كانوا اثنى عشر ألفا فلعل هذا الاختلاف دليل على تكرر وفادتهم عليه صلى الله عليه وسلم ومما يدل على ذلك ما قاله البخاري في صحيحه حدثنا يحيى بن سليمان حدثني ابن وهب حدثني عمر هو ابن محمد قال إن سالما حدثه عن عبدالله بن عمر رضي الله عنه قال ما سمعت عمر رضي الله عنه يقول لشيء قط إني لأظنه هكذا إلا كان كما يظن بينما عمر بن الخطاب رضي الله عنه جالس إذ مر به رجل جميل فقال لقد أخطأ ظني أو أن هذا على دينه في الجاهلية أو لقد قان كاهنهم علي بالرجل فدعى له فقال له ذلك فقال ما رأيت كاليوم استقبل به رجل مسلم قال فإني أعزم عليك إلا ما أخبرتني قال كنت كاهنهم في الجاهلية قال فما أعجب ما جاءتك به جنيتك قال بينما أنا يوما في السوق جاءتني أعرف فيها الفزع فقالت: ألم تر الجن وإبلاسها ويأسها من بعد إنكاسها ولحقوها بالقلاص وأحلاسها قال عمر رضي الله عنه صدق بينما أنا نائم عند آلهتهم إذ جاء رجل بعجل فذبحه فصرخ به صارخ لم أسمع صارخا قط أشد صوتا منه يقول يا جليح أمر نجيح رجل فصيح يقول لا إله إلا الله قال فوثب القوم فقلت لا أبرح حتى أعلم ما وراء هذا ثم نادى يا جليح أمر نجيح رجل فصيح يقول لا إله إلا الله فقمت فما نشبنا أن قيل هذا نبي. هذا سياق البخاري وقد رواه البيهقي من حديث ابن وهب بنحوه ثم قال وظاهر هذه الرواية يوهم أن عمر رضي الله عنه بنفسه سمع الصارخ يصرخ من العجل الذي ذبح وكذلك هو صريح في رواية ضعيفة عن عمر رضي الله عنه وسائر الروايات تدل على أن هذا الكاهن هو الذي أخبر بذلك عن رؤيته وسماعه والله أعلم. وهذا الذي قاله البيهقي هو المتجه وهذا الرجل هو سواد بن قارب وقد ذكرت هذا مستقصى في سيرة عمر رضي الله عنه فمن أراده فليأخذه من ثم ولله الحمد والمنة. وقال البيهقي حديث سواد بن قارب ويشبه أن يكون هذا هو الكاهن الذي لم يذكر اسمه فى الحديث الصحيح أخبرنا أبو القاسم الحسن بن محمد بن حبيب المفسر من أصل سماعه أخبرنا أبو عبدالله محمد بن عبدالله الصفار الأصبهاني قراءة عليه حدثنا أبو جعفر أحمد بن موسى الحمار الكوفي بالكوفة حدثنا زياد بن يزيد بن بادويه ثنا أبو بكر القصري حدثنا محمد بن نواس الكوفي حدثنا أبو بكر بن عياش عن أبي إسحاق عن البراء رضي الله عنه قال بينما عمر بن الخطاب رضي الله عنه يخطب الناس على منبر رسول الله صلى الله عليه وسلم إذ قال أيها الناس أفيكم سواد بن قارب؟ قال فلم يجبه أحد تلك السنة فلما كانت السنة المقبلة قال: أيها الناس أفيكم سواد بن قارب؟ قال: فقلت يا أمير المؤمنين وما سواد بن قارب؟ قال: فقال له عمر رضي الله عنه يا سواد حدثنا ببدء إسلامك كيف كان قال سواد فإني كنت نازلا بالهند وكان لي رئي من الجن قال فبينا أنا ذات ليلة نائم إذ جاءني في منامي ذلك قال قم فافهم واعقل إن كنت تعقل قد بعث رسول من لؤي بن غالب ثم أنشأ يقول: عجبت للجن وتحساسها وشدها العيس بأحلاسها تهوى إلى مكة تبغي الهدى ما خير الجن كأنحاسها فانهض إلى الصفوة من هاشم واسم بعينيك إلى رأسها قال ثم أنبهتي فأفزعني وقال يا سواد بن قارب إن الله عز وجل بعث نبيا فانهض إليه تهتد وترشد فلما كان من الليلة الثانية أتاني فأنبهني ثم أنشأ يقول: عجبت للجن وتطلابها وشدها العيس بأقتابها تهوي إلى يعني مكة تبغي الهدى ليس قداماها كأذنابها فانهض إلى الصفوة من هاشم واسم بعينيك إلى قابها فلما كان في الليلة الثالثة أتاني فأنبهني ثم قال: عجبت للجن وتخبارها وشدها العيس بأكوارها تهوي إلى مكة تبغي الهدى ليس ذوو الشر كأخيارها فانهض إلى الصفوة من هاشم ما مؤمنوا الجن ككفارها قال: فلما سمعته تكرر ليلة بعد ليلة وقع في قلبي حب الإسلام من أمر رسول الله صلى الله عليه وسلم ما شاء الله قال فانطلقت إلى رحلي فشددته على راحلتي فما حللت تسعة ولا عقدت أخرى حتى أتيت رسول الله صلى الله عليه وسلم فإذا هو بالمدينة مكة والناس عليه كعرف الفرس فلما رآني النبي قال \" مرحبا بك يا سواد بن قارب قد علمنا ما جاء بك \" قال: قلت يا رسول الله قد قلت شعرا فاسمعه مني قال صلى الله عليه وسلم \" قل يا سواد \" فقلت: أتاني رئي بعد ليل وهجعة ولم يك فيما قد بلوت بكاذب ثلات ليال قوله كل ليلة أتاك رسول من لؤي بن غالب فشمرت عن ساقي الإزار ووسطت بي الدعلب الوجناء بين السباسب فاشهد أن الله لا رب غيره وأنك مأمون على كل غائب وأنك أدنى المرسلين وسيلة إلى الله يا ابن الأكرمين الأطايب فمرنا بما يأتيك يا خير مرسل وإن كان فيما جاء شيب الذوائب وكن لى شفيعا يوم لا ذو شفاعة سواك بمغن عن سواد بن قارب قال فضحك النبي صلى الله عليه وسلم حتى بدت نواجذه وقال لي \" أفلجت يا سواد \" فقال له عمر رضي الله عنه هل يأتيك رئيك الآن؟ فقال \" منذ قرأت القرآن لم يأتني ونعم العوض كتاب الله عز وجل من الجن \" ثم أسنده البيهقي من وجهين آخرين ومما يدل على وفادتهم إليه صلى الله عليه وسلم بعدما هاجر إلى المدينة الحديث الذي رواه الحافظ أبو نعيم في كتاب دلائل النبوة حدثنا سليمان بن أحمد حدثنا محمد بن عبدة المصيصي حدثنا أبو توبة الربيع بن نافع حدثنا معاوية سلام عن زيد بن أسلم أنه سمع أبا سلام يقول حدثني من حدثه عمرو بن غيلان الثقفي قال أتيت عبدالله بن مسعود رضي الله عنه فقلت له حدثت أنك كنت مع رسول الله صلى الله عليه وسلم ليلة وفد الجن قال أجل قلت حدثني كيف كان شأنه؟ فقال إن أهل الصفة أخذ كل رجل منهم رجل يعشيه وتركت فلم يأخذني أحد منهم فمر بي رسول صلى الله عليه وسلم فقال \" من هذا؟ \" فقلت أنا ابن مسعود فقال صلى الله عليه وسلم \" ما أخذك أحد يعشيك؟ \" فقلت لا قال صلى الله عليه وسلم \" فانطلق لعلي أجد لك شيئا \" قال فانطلقنا حتى أتى رسول الله صلى الله عليه وسلم حجرة أم سلمة فتركني قائما ودخل إلى أهله ثم خرجت الجارية فقالت يا ابن مسعود إن رسول الله صلى الله عليه وسلم لم يجد لك عشاء فارجع إلى مضجعك. قال فرجعت إلى المسجد فجمعت حصباء المسجد فوسدته والتففت بثوبي فلم ألبث إلا قليلا حتى جاءت الجارية قالت أجب رسول الله فاتبعتها وأنا أرجو العشاء حتى إذا بلغت مقامي خرج رسول الله صلى الله عليه وسلم وفي يده عسيب من نخل فعرض به على صدري فقال صلى الله عليه وسلم \" انطلق أنت معي حيث انطلقت؟ \" قلت ما شاء الله فأعادها على ثلاث مرات كل ذلك أقول ما شاء الله فانطلق وانطلقت معه حتى أتينا بقيع الغرقد فخط صلى الله عليه وسلم بعصاه خطا ثم قال \" اجلس فيها ولا تبرج حتى آتيك \" ثم انطلق يمشي وأنا أنظر إليه خلال النخل حتى إذا كان من حيث لا أراه ثارت قبله العجاجة السوداء ففرقت فقلت ألحق برسول الله صلى الله عليه وسلم فإني أظن أن هوازن مكروا برسول الله صلى الله عليه وسلم ليقتلوه فأسعى إلى البيوت فأستغيث الناس فذكرت أن رسول الله صلى الله عليه وسلم أوصاني أن لا أبرح مكاني الذي أنا فيه فسمعت رسول الله صلى الله عليه وسلم يقرعهم بعصاه ويقول \" اجلسوا \" فجلسوا حتى كاد ينشق عمود الصبح ثم ثاروا وذهبوا فأتاني رسول الله صلى الله عليه وسلم فقال \" أنمت بعدي؟ \" فقلت لا ولقد فزعت الفزعة الأولى حتى رأيت أن آتي البيوت فأستغيث الناس حتى سمعتك تقرعهم بعصاك وكنت أظنها هوازن مكروا برسول الله صلى الله عليه وسلم ليقتلوه فقال \" لو أنك خرجت من هذه الحلقة ما أمنت عليك أن يختطفك بعضهم فهل رأيت من شيء منهم \"؟ فقلت رأيت رجالا سودا مستثفرين بثياب بيض فقال رسول الله صلى الله عليه وسلم \" أولئك وفد جن نصيبين أتوني فسألوني الزاد والمتاع فمتعتهم بكل عظم حائل أو روثة أو بعرة\" قلت فما يغني عنهم ذلك قال صلى الله عليه وسلم \" إنهم لا يجدون عظما إلا وجدوا عليه لحمه الذي كان عليه يوم أكل ولا روثة إلا وجدوا فيها حبها الذي كان فيها يوم أكلت فلا يستنقي أحد منكم بعظم ولا بعرة \" وهذا إسناد غريب جدا ولكن فيه رجل مبهم لم يسم والله تعالى أعلم وقد روى الحافظ أبو نعيم من حديث بقية بن الوليد حدثني نمير بن زيد القنبر حدثنا أبي حدثنا قحافة بن ربيعة حدثني الزبير بن العوام قال: صلى بنا رسول الله صلى الله عليه وسلم صلاة الصبح في مسجد المدينة فلما انصرف قال \" أيكم يتبعني إلى وفد الجن الليلة؟ \" فأسكت القوم ثلاثا فمر بي فأخذ بيدي فجعلت أمشي معه حتى حبست عنا جبال المدينة كلها وأفضينا إلى أرض برازا فإذا برجال طوال كأنهم الرماح مستثفربن بثيابهم من بين أرجلهم فلما رأيتهم غشيتني رعدة شديدة ثم ذكر نحو حديث ابن مسعود المتقدم وهذا حديث غريب والله أعلم. ومما يتعلق بوفود الجن ما رواه الحافظ أبو نعيم حدثنا أبو محمد بن حبان حدثنا أبو الطيب أحمد بن روح حدثنا يعقوب الدورقي حدثنا الوليد بن بكير التميمي حدثنا حصين بن عمر أخبرني عبيد المكتب عن إبراهيم قال خرج نفر من أصحاب عبدالله يريدون الحج حتى إذا كانوا في بعض الطريق إذا هم بحية تنثنى على الطريق أبيض ينفح منه ريح المسك فقلت لأصحابي امضوا فلست ببارح حتى أنظر إلى ما يصير إليه أمر هذه الحية قال فما لبثت أن ماتت فعمدت إلى خرقة بيضاء فلففتها فيها ثم نحيتها عن الطريق فدفنتها وأدركت أصحابي في المتعشى قال فوالله إنا لقعود إذ أقبل أربع نسوة من قبل المغرب فقالت واحدة منهن: أيكم دفن عمرا؟ قلنا ومن عمرو؟ قالت أيكم دفن الحية؟ قال: فقلت أنا فقالت أما والله لقد دفنت صواما قواما يأمر بما أنزل الله تعالى ولقد آمن بنبيكم وسمع صفته من السماء قبل أن يبعث بأربعمائة عام قال الرجل فحمدنا الله تعالى ثم قضينا حجتنا ثم مررت بعمر بن الخطاب رضي الله عنه بالمدينة فأنبأته بأمر الحية فقال صدقت سمعت رسول الله صلى الله عليه وسلم يقول \" لقد آمن بي قبل أن أبعث بأربعمائة سنة \" وهذا حديث غريب جدا والله أعلم. قال أبو نعيم: وقد روى الثوري عن أبي إسحاق عن الشعبي عن رجل من ثقيف بنحوه وروى عبدالله بن أحمد والطبراني عن صفوان بن المعطل ـ هو الذي نزل ودفن تلك الحية من بين الصحابة وأنهم قالوا إنه آخر التسعة موتا الذين أتوا رسول الله صلى الله عليه وسلم يستعمون القرآن وروى أبو نعيم من حديث الليث بن سعد عن عبدالعزيز بن أبي سلمة الماجشون عن عمه عن معاذ بن عبدالله بن معمر قال كنت جالسا عند عثمان بن عفان رضي الله عنه فجاء رجل فقال يا أمير المؤمنين إني كنت بفلاة من الأرض فذكر أنه رأى ثعبانين اقتتلا ثم قتل أحدهما الآخر قال فذهبت إلى المعترك فوجدت حيات كثيرة مقتولة وإذ ينفح من بعضها ريح المسك فجعلت أشمها واحدة واحدة حتى وجدت ذلك من حية صفراء رقيقة فلففتها في عمامتي ودفنتها فبينا أنا أمشي إذ ناداني مناد: يا عبدالله لقد هديت هذان حيان من الجن بنو شعيان وبنو قيس التقوا فكان من القتلى ما رأيت واستشهد الذي دفنته وكان من الذين سمعوا الوحي من رسول الله صلى الله عليه وسلم قال: فقال عثمان لذلك الرجل إن كنت صادقا فقد رأيت عجبا وإن كنت كاذبا فعليك كذبك وقوله تبارك وتعالى \"وإذ صرفنا إليك نفرا من الجن\" أي طائفة من الجن \"يستمعون القرآن فلما حضروه قالوا أنصتوا\" أي استمعوا وهذا أدب منهم وقد قال الحافظ البيهقي حدثنا الإمام أبو الطيب سهل بن محمد بن سليمان أخبرنا أبو الحسن محمد بن عبدالله الدقاق حدثنا محمد بن إبراهيم البوشنجي حدثنا هشام بن عمار الدمشقي حدثنا الوليد بن مسلم عن زهير بن محمد عن محمد بن المنكدر عن جابر بن عبدالله قال قرأ رسول الله صلى الله عليه وسلم سورة الرحمن حتى ختمها ثم قال \" مالي أراكم سكوتا؟ للجن كانوا أحسن منكم ردا ما قرأت عليهم هذه الآية من مرة \"فبأي آلاء ربكما تكذبان\" إلا قالوا: ولا بشيء من آلائك أو نعمك ربا نكذب فلك الحمد \" ورواه الترمذي في التفسير عن أبي مسلم عبدالرحمن بن واقد عن الوليد بن مسلم به قال خرج رسول الله صلى الله عليه وسلم على أصحابه فقرأ عليهم سورة الرحمن فذكره ثم قال الترمذي: غريب لا نعرفه إلا من حديث الوليد عن زهير كذا قال وقد رواه البيهقي من حديث مروان بن محمد الطاطري عن زهير بن محمد به مثله وقوله عز وجل \"فلما قضى\" أي فرغ كقوله تعالى \"فإذا قضيت الصلاة\" \"فقضاهن سبع سموات في يومين\" \"فإذا قضيتم مناسككم\" \"ولوا إلى قومهم منذرين\" أي رجعوا إلى قومهم فأنذروهم ما سمعوه من رسول الله صلى الله عليه وسلم كقوله جل وعلا \"ليتفقهوا في الدين ولينذروا قومهم إذا رجعوا إليهم لعلهم يحذرون\" وقد استدل بهذه الآية على أنه في الجن نذر وليس فيهم رسل ولا شك أن الجن لم يبعث الله تعالى منهم رسولا لقوله تعالى \"وما أرسلنا قبلك إلا رجالا نوحي إليهم من أهل القرى\" وقال عز وجل \"وما أرسلنا قبلك من المرسلين إلا إنهم ليأكلون الطعام ويمشون في الأسواق\" وقال عن إبراهيم الخليل عليه الصلاة والسلام \"وجعلنا في ذريته النبوة والكتاب\" فكل نبي بعثه الله تعالى بعد إبراهيم فمن ذريته وسلالته فأما قوله تبارك وتعالى في الأنعام \"يا معشر الجن والإنس ألم يأتكم رسل منكم\" فالمراد من مجموع الجنسين فيصدق على أحدهما وهو الإنس كقوله \"يخرج منهما اللؤلؤ والمرجان\" أي أحدهما."
    },
    {
      "ayah": 3,
      "surah": 46,
      "text": "ثم قال تعالى ما خلقنا السموات والأرض وما بينهما إلا بالحق أي لا على وجه العبث والباطل \"وأجل مسمى\" أي وإلى مدة معينة مضروبة لا تزيد ولا تنقص. وقوله تعالى \"والذين كفروا عما أنذروا معرضون\" أي لاهون عما يراد بهم وقد أنزل الله تعالى إليهم كتابا وأرسل إليهم رسولا وهم معرضون عن ذلك كله أي وسيعلمون غب ذلك."
    },
    {
      "ayah": 30,
      "surah": 46,
      "text": "ثم إنه تعالى فسر إنذار الجن لقومهم فقال مخبرا عنهم \"قالوا يا قومنا إنا سمعنا كتابا أنزل من بعد موسى\" ولم يذكروا عيسى لأن عيسى عليه السلام أنزل عليه الإنجيل فيه مواعظ وترقيقات وقليل من التحليل والتحريم وهو في الحقيقة كالمتمم لشريعة التوراة فالعمدة هو التوراة فلهذا قالوا أنزل من بعد موسى وهكذا قال ورقة بن نوفل حين أخبره النبي صلى الله عليه وسلم بقصة نزول جبريل عليه عليه الصلاة والسلام أول مرة فقال بخ بخ هذا الناموس الذي كان يأتي موسى يا ليتني أكون فيها جذعا \"مصدقا لما بين يديه\" أي من الكتب المنزلة على الأنبياء قبله وقولهم \"يهدي إلى الحق\" أي فى الاعتقاد والإخبار \"وإلى طريق مستقيم\" في الأعمال فإن القرآن مشتمل على شيئين خبر وطلب فخبره صدق وطلبه عدل كما قال تعالى \"وتمت كلمة ربك صدقا وعدلا\" وقال سبحانه وتعالى \"هو الذي أرسل رسوله بالهدى ودين الحق\" فالهدى هر العلم النافع ودين الحق هو العمل الصالح وهذا قالت الجن \"يهدي إلى الحق\" في الاعتقادات \"وإلى طريق مستقيم\" أي فى العمليات."
    },
    {
      "ayah": 31,
      "surah": 46,
      "text": "\"يا قومنا أجيبوا داعي الله \" فيه دلالة على أنه تعالى أرسل محمدا صلى الله عليه وسلم إلى الثقلين الجن والإنس حيث دعاهم إلى الله تعالى وقرأ عليهم السورة التي فيها خطاب الفريقين وتكليفهم ووعدهم ووعيدهم وهى سورة الرحمن ولهذا قال \"أجيبوا داعي الله وآمنوا به\" وقوله تعالى \"يغفر لكم من ذنوبكم\" قيل إن ههنا زائدة وفيه نظر لأن زيادتها في الإثبات قليل وقيل إنها على بابها للتبغيض \"ويجركم من عذاب أليم\" أي ويقيكم من عذابه الأليم. وقد استدل بهذه الآية من ذهب من العلماء إلى أن الجن المؤمنين لا يدخلون الجنة وإنما جزاء صالحيهم أن يجاروا من عذاب النار يوم القيامة ولهذا قالوا هذا في هذا المقام وهو مقام تبجح ومبالغة فلو كان لهم جزاء على الإيمان أعلى من هذا لأوشك أن يذكروه. وقال ابن أبي حاتم حدثنا أبي قال حدثت عن جرير عن ليث عن مجاهد عن ابن عباس رضي الله عنهما قال: لا يدخل مؤمنو الجن الجنة لأنهم من ذرية إبليس ولا ندخل ذرية إبليس الجنة والحق أن مؤمنيهم كمؤمني الإنس يدخلون الجنة كما هو مذهب جماعة من السلف وقد استدل بعضهم لهذا بقوله عز وجل \"لم يطمئن إني قبلهم ولا جان\" وفي هذا الاستدلال نظر وأحسن منه قوله جل وعلا \"ولمن خاف مقام ربه جنتان فبأي آلاء ربكما تكذبان\" فقد امتن تعالى على الثقلين بأن جعل جزاء محسنهم الجنة وقد قابلت الجن هذه الآية بالشكر القولي أبلغ من الإنس فقالوا ولا بشيء من آلائك ربنا نكذب فلك الحمد فلم يكن تعالى ليمتن عليهم بجزاء لا يحصل لهم وأيضا فإنه إذا كان يجازى كافرهم بالنار وهو مقام عدل فلأن يجازي مؤمنهم بالجنة وهو مقام فضل بطريق الأولى والأحرى. ومما يدل أيضا على ذلك عموم قوله تعالى \"إن الذين آمنوا وعملوا الصالحات كانت لهم جنات الفردوس نزلا\" وما أشبه ذلك من الآيات. وقد أفردت هذه المسألة في جزء على حدة ولله الحمد والمنة وهذه الجنة لا يزال فيها فضل حتى ينشئ الله تعالى لها خلقا أفلا يسكنها من آمن به وعمل له صالحا وما ذكروه ههنا على الإيمان من تكفير الذنوب والإجارة من العذاب الأليم هو يستلزم دخول الجنة لأنه ليس في الآخرة إلا الجنة أو النار فمن أجير من النار دخل الجنة لا محالة ولم يرد معنا نص صريح ولا ظاهر عن الشارع أن مؤمني الجن لا يدخلون الجنة وإن أجيروا من النار ولو صح لقلنا به والله أعلم. وهذا نوح عليه الصلاة والسلام يقول لقومه \"يغفر لكم من ذنوبكم ويؤخركم إلى أجل مسمى\" ولا خلاف أن مؤمني قومه في الجنة فكذلك هؤلاء.. وقد حكي فيهم أقوال غريبة فعن عمر بن عبدالعزيز رضي الله عنه أنهم لا يدخلون بحبوحة الجنة وإنما يكونون في ربضها وحولها وفي أرجائها ومن الناس من زعم أنهم في الجنة يراهم بنو آدم ولا يرون بني آدم بعكس ما كانوا عليه في الدار الدنيا ومن الناس من قال لا يأكلون في الجنة ولا يشربون وإنما يلهمون التسبيح والتحميد والتقديس عوضا عن الطعام والشراب كالملائكة لأنهم من جنسهم وكل هذه الأقوال فيها نظر ولا دليل عليها."
    },
    {
      "ayah": 32,
      "surah": 46,
      "text": "ثم قال مخبرا عنهم \"ومن لا يجب داعي الله فليس بمعجز في الأرض\" أي بل قدرة الله شاملة له ومحيطة به \"وليس لهم من دونه أولياء\" أي لا يجيرهم منه أحد \"أولئك في ضلال مبين\" وهذا مقام تهديد وترهيب فدعوا قومهم بالترغيب والترهيب ولهذا نجع في كثير منهم وجاءوا إلى رسول الله صلى الله عليه وسلم وفودا وفودا كما تقدم بيانه ولله الحمد والله أعلم."
    },
    {
      "ayah": 33,
      "surah": 46,
      "text": "يقول تعالى أو لم ير هؤلاء المنكرون للبعث يوم القيامة المستبعدون لقيام الأجساد يوم المعاد \"أن الله الذي خلق السموات والأرض ولم يعي بخلقهن\" أي ولم يكرثه خلقهن بل قال لها كوني فكانت بلا ممانعة ولا مخالفة بل طائعة مجيبة خائفة وجلة أفليس ذلك بقادر على أن يحي الموتى؟ كما قال عز وجل في الآية الأخرى \"لخلق السموات والأرض أكبر من خلق الناس ولكن أكثر الناس لا يعلمون\" ولهذا قال تعالى بلى إنه على كل شيء قدير."
    },
    {
      "ayah": 34,
      "surah": 46,
      "text": "ثم قال جل جلاله مهددا ومتوعدا لمن كفر به \"ويوم يعرض الذين كفروا على النار أليس هذا بالحق\" أي يقال لهم أما هذا حق أفسحر هذا أم أنتم لا تبصرون ؟ \"قالوا بلى وربنا\" أي لا يسعهم إلا الاعتراف \"قال فذوقوا العذاب بما كنتم تكفرون\"."
    },
    {
      "ayah": 35,
      "surah": 46,
      "text": "ثم قال تبارك وتعالى آمرا رسوله صلى الله عليه وسلم بالصبر تكذيب من كذبه قومه \"فاصبر كما صبر أولو العزم من الرسل\" أي على تكذيب قومهم لهم وقد اختلفوا في تعداد أولي العزم على أقوال وأشهرها أنهم نوح وإبراهيم وموسى وعيسى وخاتم الأنبياء كلهم محمد صلى الله عليه وسلم قد نص الله تعالى على أسمائهم من بين الأنبياء في آيتين من سورتي الأحزاب والشورى وقد يحتمل أن يكون المراد بأولي العزم جميع الرسل فتكون \"من\" في قوله من الرسل لبيان الجنس والله أعلم وقد قال ابن أبي حاتم حدثنا محمد بن الحجاج الحضرمي حدثنا السري بن حيان حدثنا عباد بن عباد حدثنا مجالد بن سعيد عن الشعبي عن مسروق قال: قالت يا عائشة رضي الله عنها ظل رسول الله صلى الله عليه وسلم صائما ثم طواه ثم ظل صائما ثم طواه ثم ظل صائما ثم قال \" يا عائشة إن الدنيا لا تنبغي لمحمد ولا لآل محمد يا عائشة إن الله تعالى لم يرض من أولى العزم من الرسل إلا بالصبر على مكروهها والصبر عن محبوبها ثم لم يرض مني إلا أن يكلفني ما كلفهم \"فاصبر كما صبر أولو العزم من الرسل\" وإني والله لأصبرن كما صبروا جهدي ولا قوة إلا بالله \" \"ولا تستعجل لهم\" أي لا تستعجل لهم حلول العقوبة بهم كقوله تبارك وتعالى \"فذرني والمكذبين أولي النعمة ومهلهم قليلا\" وكقوله تعالى \"فمهل الكافرين أمهلهم رويدا\" \"كأنهم يوم يرون ما يوعدون لم يلبثوا إلا ساعة من نهار\" كقوله جل وعلا \"كأنهم يوم يرونها لم يلبثوا إلا عشية أو ضحاها\" وكقوله عز وجل \"ويوم نحشرهم كأن لم يلبثوا إلا ساعة من النهار يتعارفون بينهم\" الآية وقوله جل وعلا \"بلاغ\" قال ابن جرير يحتمل معنيين \"أحدهما\" أن يكون تقديره وذلك لبث بلاغ \"وآخر\" أن يكون تقديره هذا القرآن بلاغ. وقوله تعالى \"فهل يهلك إلا القوم الفاسقون\" أي لا يهلك على الله إلا هالك. وهذا من عدله عز وجل أنه لا يعذب إلا من يستحق العذاب والله أعلم. آخر تفسير سورة الأحقاف ولله الحمد والمنة وبه التوفيق والعصمة."
    },
    {
      "ayah": 4,
      "surah": 46,
      "text": "ثم قال تعالى \"قل\" أي لهؤلاء المشركين العابدين مع الله غيره \"أرأيتم ما تدعون من دون الله أروني ماذا خلقوا من الأرض\" أي أرشدوني إلى المكان الذي استقلوا بخلقه من الأرض \"أم لهم شرك في السموات\" أي ولا شرك لهم في السموات ولا في الأرض وما يملكون من قطمير إن الملك والتصرف كله إلا لله عز وجل فكيف تعبدون معه غيره وتشركون به؟ من أرشدكم إلى هذا؟ من دعاكم إليه؟ أهو أمركم به؟ أم هو شيء اقترحتموه من عند أنفسكم؟ ولهذا قال \"ائتوني بكتاب من قبل هذا\" أي هاتوا كتابا من كتب الله المنزلة على الأنبياء عليهم الصلاة والسلام يأمركم بعبادة هذه الأصنام \"أو أثارة من علم\" أي دليل بين علي هذا المسلك الذي سلكتموه \"إن كنتم صادقين\" أي لا دليل لكم لا نقليا ولا عقليا على ذلك ولهذا قرأ آخرون أو أثرة من علم أي أو علم صحيح تؤثرونه عن أحد ممن قبلكم كما قال مجاهد في قوله تعالى \"أو أثارة من علم\" أو أحد يأثر علما وقال العوفي عن ابن عباس أو بينة من الأمر. وقال الإمام أحمد حدثنا يحيى عن سفيان عن صفوان بن سليم عن أبي سلمة بن عبدالرحمن عن ابن عباس رضي الله عنهما قال سفيان لا أعلم إلا عن النبي صلى الله عليه وسلم أو أثرة من علم قال الخط. وقال أبو بكر بن عياش أو بقية من علم وقال الحسن البصري أو أثارة شيء يستخرجه فيثيره وقال ابن عباس رضي الله عنهما ومجاهد وأبو بكر ابن عياش أيضا أو أثارة من علم يعني الخط وقال قتادة أو أثارة من علم خاصة من علم وكل هذه الأقوال متقاربة وهي راجعة إلى ما قلناه وهو اختيار ابن جرير رحمه الله وأكرمه وأحسن مثواه."
    },
    {
      "ayah": 5,
      "surah": 46,
      "text": "وقوله تبارك وتعالى \"ومن أضل ممن يدعو من دون الله من لا يستجيب له إلى يوم القيامة وهم عن دعائهم غافلون\" أي لا أضل ممن يدعو من دون الله أصناما ويطلب منها ما لا تستطيعه إلى يوم القيامة وهي غافلة عما يقول لا تسمع ولا تبصر ولا تبطش لأنها جماد حجارة صم."
    },
    {
      "ayah": 6,
      "surah": 46,
      "text": "وقوله تبارك وتعالى \"وإذا حشر الناس كانوا لهم أعداء وكانوا بعبادتهم كافرين\" كقوله عز وجل \"واتخذوا من دون الله آلهة ليكونوا لهم عزا كلا سيكفرون بعبادتهم ويكونون عليهم ضدا\" أي سيخونونهم أحرج ما يكونون إليهم وقال الخليل عليه الصلاة والسلام \"إنما اتخذتم من دون الله أوثانا مودة بينكم في الحياة الدنيا ثم يوم القيامة يكفر بعضكم ببعض ويلعن بعضكم بعضا ومأواكم النار وما لكم من ناصرين\"."
    },
    {
      "ayah": 7,
      "surah": 46,
      "text": "يقول عز وجل مخبرا عن المشركين في كفرهم وعنادهم أنهم إذا تتلى عليهم آيات الله بينات أي في حال بيانها ووضوحها وجلائها يقولون هذا سحر مبين أي سحر واضح وقد كذبوا وافتروا وضلوا وكفروا."
    },
    {
      "ayah": 8,
      "surah": 46,
      "text": "أم يقولون افتراه يعنون محمدا صلى الله عليه وسلم. قال الله عز وجل قل \"إن افتريته فلا تملكون لي من الله شيئا \" أي لو كذبت عليه وزعمت أنه أرسلني وليس كذلك لعاقبني أشد العقوبة ولم يقدر أحد من أهل الأرض لا أنتم ولا غيركم أن يجيرني منه كقوله تبارك وتعالى \"قل إني لن يجيرني من الله أحد ولن أجد من دونه ملتحدا إلا بلاغا من الله ورسالاته\" وقال تعالى \"ولو تقول علينا بعض الأقاويل لأخذنا منه باليمين ثم لقطعنا منه الوتين فما منكم من أحد عنه حاجزين\" ولهذا قال سبحانه وتعالى ههنا \"قل إن افتريته فلا تملكون لي من الله شيئا هو أعلم بما تفيضون فيه كفى به شهيدا بيني وبينكم\" هذا تهديد لهم ووعيد أكيد وترهيب شديد. وقوله جل وعلا \"وهو الغفور الرحيم\" ترغيب لهم إلى التوبة والإنابة أي ومع هذا كله إن رجعتم وتبتم تاب عليكم وعفا عنكم وغفر ورحم وهذه الآية كقوله عز وجل في سورة الفرقان \"وقالوا أساطير الأولين اكتتبها فهي تملى عليه بكرة وأصيلا قل أنزله الذي يعلم السر في السموات والأرض إنه كان غفورا رحيما \"."
    },
    {
      "ayah": 9,
      "surah": 46,
      "text": "وقوله تبارك وتعالى \"قل ما كنت بدعا من الرسل\" أي لست بأول رسول طرق العالم بل قد جاءت الرسل من قبلي فما أنا بالأمر الذي لا نظير له حتى تستنكروني وتستبعدون بعثتي إليكم فإنه قد أرسل الله جل وعلا قبلي جميع الأنبياء إلى الأمم قال ابن عباس رضي الله عنهما ومجاهد وقتادة \"وما كنت بدعا من الرسل\" ما أنا بأول رسول ولم يحك ابن جرير ولا ابن أبي حاتم غير ذلك. وقوله تعالى \"وما أدري ما يفعل بي ولا بكم\" قال علي بن أبي طلحة عن ابن عباس رضي الله عنهما في هذه الآية نزل بعدها \"ليغفر لك الله ما تقدم من ذنبك وما تأخر\" وهكذا قال عكرمة والحسن وقتادة إنها منسوخة بقوله تعالى \"ليغفر لك الله ما تقدم من ذنبك وما تأخر\" قالوا ولما نزلت هذه الآية قال رجل من المسلمين هذا قد بين الله تعالى ما هو فاعل بك يا رسول الله فما هو فاعل بنا؟ فأنزل الله تعالى \"ليدخل المؤمنين والمؤمنات جنات تجري من تحتها الأنهار\" هكذا قال والذي هو ثابت في الصحيح أن المؤمنين قالوا هنيئا لك يا رسول الله فما لنا؟ فأنزل الله سبحانه وتعالى هذه الآية وقال الضحاك \"وما أدري ما يفعل بي ولا بكم\" أي ما أدري بماذا أومر وبماذا أنهى بعد هذا؟ وقال أبو بكر الهذلي عن الحسن البصري في قوله تعالى \"وما أدري ما يفعل بي ولا بكم\" قال أما في الآخرة فمعاذ الله وقد علم أنه في الجنة ولكن قال لا أدري ما يفعل بي ولا بكم في الدنيا أخرج كما أخرجت الأنبياء عليهم الصلاة والسلام من قبلي؟ أم أقتل كما قتلت الأنبياء من قبلي؟ ولا أدري أيخسف بكم أو ترمون بالحجارة؟ وهذا القول هو الذي عول عليه ابن جرير وأنه لا يجوز غيره ولا شك أن هذا هو اللائق به صلى الله عليه وسلم فإنه بالنسبة إلى الآخرة جازم أنه يصير إلى الجنة هو ومن اتبعه. وأما في الدنيا فلم يدر ما كان يؤول إليه أمره وأمر مشركي قريش إلى ماذا؟ أيؤمنون أم يكفرون فيعذبون فيستأصلون بكفرهم فأما الحديث الذي رواه الإمام أحمد حدثنا يعقوب حدثنا أبي عن ابن شهاب عن خارجة بن زيد بن ثابت عن أم العلاء وهى امرأة من نسائهم أخبرته وكانت بايعت رسول الله صلى الله عليه وسلم قالت طار لهم في السكنى حين اقترعت الأنصار على سكنى المهاجرين عثمان بن مظعون رضي الله عنهما فاشتكى عثمان رضي الله عنهما عندنا فمرضناه حتى إذا توفي أدرجناه في أثوابه فدخل علينا رسول الله صلى الله عليه وسلم فقلت رحمة الله عليك أبا السائب شهادتي عليك لقد أكرمك الله عز وجل فقال رسول الله صلى الله عليه وسلم \"وما يدريك أن الله تعالى أكرمه؟\" فقلت لا أدري بأبي أنت وأمي فقال رسول الله صلى الله عليه وسلم \"أما هو فقد جاءه اليقين من ربه وإني لأرجو له الخير والله ما أدري وأنا رسول الله ما يفعل بي\" قالت: فقلت والله لا أزكي أحدا بعده أبدا وأحزنني ذلك فنمت فرأيت لعثمان رضي الله عنهما عينا تجري فجئت إلى رسول الله صلى الله عليه وسلم فأخبرته بذلك فقال رسول الله صلى الله عليه وسلم \"ذاك عمله\" فقد انفرد بإخراجه البخاري دون مسلم وفي لفظ له \"ما أدري وأنا رسول الله صلى الله عليه وسلم ما يفعل به\" وهذا أشبه أن يكون هو المحفوظ بدليل قولها فأحزنني ذلك وفي هذا وأمثاله دلالة على أنه لا يقطع لمعين بالجنة إلا الذي نص الشارع على تعينهم كالعشرة ابن سلام والعميصاء وبلال وسراقة وعبد الذين عمرو بن حرام والد جابر والقراء السبعين الذين قتلوا ببئر معونة وزيد بن حارثة وجعفر وابن رواحة وما أشبه هؤلاء. وقوله إن اتبع إلا ما يوحى إلي أي إنما أتبع ما ينزله الله علي من الوحي وما أنا إلا نذير مبين أي بين النذارة أمري ظاهر لكل ذي لب وعقل والله أعلم."
    }
  ]
}
