{
  "ayahs": [
    {
      "ayah": 1,
      "surah": 47,
      "text": "\"الذين كفروا\" أي بآيات الله \"وصدوا\" غيرهم \"عن سبيل الله أضل أعمالهم\" أي أبطلها وأذهبها ولم يجعل لهل ثوابا ولا جزاء كقوله تعالى \"وقدمنا إلى ما عملوا من عمل فجعلناه هباء منثورا\"."
    },
    {
      "ayah": 10,
      "surah": 47,
      "text": "يقول تعالى \"أفلم يسيروا\" يعني المشركين بالله المكذبين لرسوله \"في الأرض فينظروا كيف كان عاقبة الذين من قبلهم دمر الله عليهم\" أي عاقبهم بتكذيبهم وكفرهم أي ونجى المؤمنين من بين أظهرهم ولهذا قال تعالى \"وللكافرين أمثالها\"."
    },
    {
      "ayah": 11,
      "surah": 47,
      "text": "ولهذا لما قال أبو سفيان صخر بن حرب رئيس المشركين يوم أحد حين سأل عن النبي صلى الله عليه وسلم وعن أبي بكر وعمر رضي الله عنهما فلم يجب وقال أما هؤلاء فقد هلكوا وأجابه عمر بن الخطاب رضي الله عنه فقال كذبت يا عدو الله بل أبقى الله تعالى لك ما يسوءك وإن الذين عددت لأحياء فقال أبو سفيان يوم بيوم بدر والحرب سجال أما إنكم ستجدون مثلة لم آمر بها ولم أنه عنها ذهب يرتجز ويقول ثم اعل هبل اعل هبل فقال رسول الله صلى الله عليه وسلم \"ألا تجيبوه؟\" قالوا يا رسول الله وما نقول؟ قال صلى الله عليه وسلم قولوا \"الله أعلى وأجل\" ثم قال أبو سفيان لنا العزى ولا عزى لكم فقال رسول الله صلى الله عليه وسلم \"ألا تجيبوه؟\" قالوا وما نقول يا رسول الله؟ قال قولوا \"الله مولانا ولا مولى لكم\"."
    },
    {
      "ayah": 12,
      "surah": 47,
      "text": "\"إن الله يدخل الذين آمنوا وعملوا الصالحات جنات تجري من تحتها الأنهار\" أي يوم القيامة \"والذين كفروا يتمتعون ويأكلون كما تأكل الأنعام\" أي في دنياهم يتمتعون بها ويأكلون منها كأكل الأنعام خضما وقضما وليس لهم همة إلا في ذلك ولهذا ثبت في الصحيح \"المؤمن يأكل في معي واحد والكافر يأكل في سبعة أمعاء\" ثم قال تعالى \"والنار مثوى لهم\" أي يوم جزائهم."
    },
    {
      "ayah": 13,
      "surah": 47,
      "text": "\"وكأين من قرية هى أشد قوة من قريتك التي أخرجتك\" يعني مكة \"أهلكناهم فلا ناصر لهم\" وهذا تهديد شديد ووعيد أكيد لأهل مكة في تكذيبهم لرسول الله صلى الله عليه وسلم وهو سيد الرسل وخاتم الأنبياء فإذا كان الله عز وجل قد أهلك الأمم الذين كذبوا الرسل قبله بسببهم وقد كانوا أشد قوة من هؤلاء فماذا ظن هؤلاء أن يفعل الله بهم في الدنيا والأخرى؟ فإن رفع عن كثير منهم العقوبة في الدنيا لبركة وجود الرسول نبي الرحمة فإن العذاب يوفر على الكافرين به في معادهم \"يضاعف لهم العذاب ما كانوا يستطيعون السمع وما كانوا يبصرون\" وقوله تعالى \"من قريتك التي أخرجتك\" أي الذين أخرجوك من بين أظهرهم وقال ابن أبي حاتم ذكر أبي عن محمد بن عبدالأعلى عن المعتمر بن سليمان عن أبيه عن حنش عن عكرمة عن ابن عباس رضي الله عنهما أن النبي صلى الله عليه وسلم لما خرج من مكة إلى الغار وأتاه فالتفت إلى مكة وقال \"أنت أحب بلاد الله إلى الله وأنت أحب بلاد الله إلي ولولا أن المشركين أخرجوني لم أخرج منك\" فأعدى الأعداء من عدا على الله تعالى في حرمه أو قتل غير قاتله أو قتل بذحول الجاهلية فأنزل الله تعالى على نبيه صلى الله عليه وسلم \"وكأين من قرية هي أشد قوة من قريتك التي أخرجتك أهلكناهم فلا ناصر لهم\"."
    },
    {
      "ayah": 14,
      "surah": 47,
      "text": "\"أفمن كان على بينة من ربه\" أي على بصيرة ويقين في أمر الله ودينه بما أنزل الله في كتابه من الهدى والعلم وبما جبله الله عليه من الفطرة المستقيمة \"كمن زين له سوء عمله واتبعوا أهواءهم\" أي ليس هذا كهذا كقوله تعالى \"أفمن يعلم أنما أنزل إليك من ربك الحق كمن هو أعمى\" وكقوله تعالى \"لا يستوي أصحاب النار وأصحاب الجنة أصحاب الجنة هم الفائزون\"."
    },
    {
      "ayah": 15,
      "surah": 47,
      "text": "\"مثل الجنة التي وعد المتقون\" قال عكرمة \"مثل الجنة\" أي نعتها \"فيها أنهار من ماء غير آسن\" قال ابن عباس رضي الله عنهما والحسن وقتادة يعني غر متغير وقال قتادة والضحاك وعطاء الخراساني غير منتن والعرب تقول أسن الماء إذا تغير ريحه وفي حديث مرفوع أورده ابن أبي حاتم غير آسن يعني الصافي الذي لا كدر فيه وقال ابن أبي حاتم حدثنا أبو سعيد الأشج حدثنا وكيع عن الأعمش عن عبدالله بن مره عن مسروق قال: قال عبد الله رضي الله عنه أنهار الجنة تفجر من جبل من مسك \"وأنهار من لبن لم يتغير طعمه\" أي بل في غاية البياض والحلاوة والدسومة وفي حديث مرفوع \"لم يخرج من ضروع الماشية\" \"وأنهار من خمر لذة للشاربين\" أي ليست كريهة الطعم والرائحة كخمر الدنيا بل حسنة المنظر والطعم والرائحة والفعل \"لا فيها غول ولا هم عنها ينزفون\" \"لا يصدعون عنها ولا ينزفون\" \"بيضاء لذة للشاربين\" وفي حديث مرفوع \"لم يعصرها الرجال بأقدامهم\" \"وأنهار من عسل مصفى\" أي وهو في غاية الصفاء وحسن اللون والطعم والريح وفي حديث مرفوع \"لم يخرج من بطون النحل\" وقال الإمام أحمد حدثنا يزيد بن هارون اخبرنا الجريري عن حكيم بن معاوية عن أبيه قال سمعت رسول الله صلى الله عليه وسلم يقول: \"في الجنة بحر اللبن وبحر الماء وبحر العسل وبحر الخمر ثم تشقق الأنهار منها بعد\" ورواه الترمذي في صفة الجنة عن محمد بن يسار عن يزيد بن هارون عن سعيد بن أبي إياس الجريري وقال حسن صحيح قال أبو بكر بن مردويه حدثنا أحمد بن محمد بن عاصم حدثنا عبدالله بن محمد بن النعمان حدثنا مسلم بن إبراهيم حدثنا الحارت بن عبيد أبو قدامة الأيادي حدثنا أبو عمران الجوني عن أبي بكر بن عبدالله بن قيس عن أبيه قال: قال رسول الله صلى الله عليه وسلم \"هذه الأنهار تشخب من جنة عدن في جوبة ثم تصدع بعد أنهارا\" وفي الصحيح \"إذا سألتم الله تعالى فاسألوه الفردوس فإنه أوسط الجنة وأعلى الجنة ومنه تفجر أنهار الجنة وفوقه عرش الرحمن\" وقال الحافظ أبو القاسم الطبراني حدثنا مصعب بن إبراهيم بن حمزة الزبيري وعبدالله بن الصفر السكري قالا حدثنا إبراهيم بن المنذر الحزامي حدثنا عبدالرحمن بن المغيرة حدثني عبدالرحمن بن عياش عن دلهم بن الأسود قال دلهم وحدثنيه أيضا أبو الأسود عن عاصم بن لقيط قال إن لقيط بن عامر خرج وافدا إلى رسول الله صلى الله عليه وسلم قلت يا رسول الله فعلى ما نطلع من الجنة؟ قال صلى الله عليه وسلم \"على أنهار عسل مصفى وأنهار من خمر ما بها صداع ولا ندامة وأنهار من لبن لم يتغير طعمه وماء غير آسن وفاكهة لعمر إلهك ما تعلمون وخير من مثله وأزواج مطهرة\" قلت يا رسول الله أولنا فيها أزواج مصلحات؟ قال \"الصالحات للصالحين تلذونهن مثل لذاتكم في الدنيا ويلذونكم غير أن لا توالد\" وقال أبو بكر عبدالله بن محمد بن أبي الدنيا حدثنا يعقوب بن عبيد عن يزيد بن هارون أخبرني الجريري عن معاوية بن قرة عن أبيه عن أنس بن مالك رضي الله عنه قال: لعلكم تظنون أن أنهار الجنة تجرى في أخدود في الأرض والله إنها لتجري سائحة على وجه الأرض حافاتها قباب اللؤلؤ وطينها المسك الأذفر وقد رواه أبو بكر بن مردويه من حديث مهدي بن حكيم عن يزيد بن هارون به مرفوعا وقوله تعالى \"ولهم فيها من كل الثمرات\" كقوله عز وجل \"يدعون فيها بكل فاكهة آمنين\" وقوله تبارك وتعالى \"فيهما من كل فاكهة زوجان\" وقوله سبحانه وتعالى \"ومغفرة من ربهم\" أي مع ذلك كله وقوله سبحانه وتعالى \"كمن هو خالد في النار\" أي أهؤلاء الذين ذكرنا منزلتهم من الجنة كمن هو خالد في النار؟ ليس هؤلاء كهؤلاء وليس من هو في الدرجات كمن هو في الدركات \"وسقوا ماء حميما\" أي حارا شديد الحر لا يستطاع \"فقطع أمعاءهم\" أي قطع ما في بطونهم من الأمعاء والأحشاء ـ عياذا بالله تعالى من ذلك ـ."
    },
    {
      "ayah": 16,
      "surah": 47,
      "text": "يقول تعالى مخبرا عن المنافقين في بلادتهم وقلة فهمهم حيث كانوا يجلسون إلى رسول الله صلى الله عليه وسلم ويستمعون كلامه فلا يفهمون منه شيئا فإذا خرجوا من عنده \"قالوا للذين أوتوا العلم من الصحابة\" رضي الله عنهم \"ماذا قال آنفا\" أي الساعة لا يعقلون ما قال ولا يكترثون له قال الله تعالى \"أولئك الذين طبع الله على قلوبهم واتبعوا أهواءهم\" أي فلا فهم صحيح ولا قصد صحيح."
    },
    {
      "ayah": 17,
      "surah": 47,
      "text": "أي والذين قصدوا الهداية وفقهم الله تعالى لها فهداهم إليها وثبتهم عليها وزادهم منها \"وآتاهم تقواهم\" أي ألهمهم رشدهم."
    },
    {
      "ayah": 18,
      "surah": 47,
      "text": "\"فهل ينظرون إلا الساعة أن تأتيهم بغتة\" أي وهم غافلون عنها \"فقد جاء أشراطها\" أي أمارات اقترابها كقوله تبارك وتعالى \"هذا نذير من النذر الأولى أزفت الآزفة\" وكقوله جلت عظمته \"اقتربت الساعة وانشق القمر\" وقوله سبحانه وتعالى \"أتى أمر الله فلا تستعجلوه\" وقوله جل وعلا \"اقترب للناس حسابهم وهم في غفلة معرضون\" فبعثة رسول الله صلى الله عليه وسلم من أشراط الساعة لأنه خاتم الرسل الذي أكمل الله تعالى به الدين وأقام به الحجة على العالمين وقد أخبر صلى الله عليه وسلم بأمارات الساعة وأشراطها وأبان عن ذلك وأوضحه بما لم يؤته نبي قبله كما هو مبسوط في موضعه وقال الحسن البصري بعثة محمد صلى الله عليه وسلم من أشراط الساعة وهو كما قال ولهذا جاء في أسمائه صلى الله عليه وسلم أنه نبي التوبة ونبي الملحمة والحاشر الذي يحشر الناس على قدميه والعاقب الذي ليس بعده نبي. وقال البخاري حدثنا أحمد بن المقدام حدثنا فضيل بن سليمان حدثنا أبو رجاء حدثنا سهل بن سعد رضي الله عنه قال رأيت رسول الله صلى الله عليه وسلم قال بأصبعيه هكذا بالوسطى والتي تليها \"بعثت أنا والساعة كهاتين\" ثم قال تعالى \"فأني لهم إذا جاءتهم ذكراهم\" أي فكيف للكافرين بالتذكر إذا جاءتهم القيامة حيث لا ينفعهم ذلك؟ كقوله تعالى \"يومئذ يتذكر الإنسان وأنى له الذكرى\" \"وقالوا آمنا به وأنى لهم التناوش من مكان بعيد\" ."
    },
    {
      "ayah": 19,
      "surah": 47,
      "text": "\"فاعلم أنه لا إله إلا الله\" هذا إخبار بأنه لا إله إلا الله ولا يتأتى كونه آمرا بعلم ذلك ولهذا عطف عليه قوله عز وجل \"واستغفر لذنبك وللمؤمنين والمؤمنات\" وفي الصحيح أن رسول الله صلى الله عليه وسلم كان يقول \"اللهم اغفر لي خطيئتي وجهلي وإسرافي في أمري وما أنت اعلم به مني اللهم اغفر لي هزلي وجدي وخطئي وعمدي وكل ذلك عندي\" وفي الصحيح أنه كان يقول في آخر الصلاة \"اللهم اغفر لي ما قدمت وما أخرت وما أسررت وما أعلنت وما أسرفت وما أنت أعلم به مني أنت إلهي لا إله إلا أنت\" وفي الصحيح أنه قال \"يأيها الناس توبوا إلى ربكم فإني أستغفر الله وأتوب إليه في اليوم أكثر من سبعين مرة\" وقال الإمام أحمد حدثنا بن جعفر حدثنا شعبة عن عاصم الأحول قال سمعت عبدالله بن سرخس قال أتيت رسول الله صلى الله عليه وسلم فأكلت معه من طعامه فقلت غفر الله لك يا رسول الله فقال صلى الله عليه وسلم \"ولك\" فقلت أستغفر لك؟ فقال رسول الله صلى الله عليه وسلم \"نعم ولكم\" وقرأ \"واستغفر لذنبك وللمؤمنين والمؤمنات\" ثم نظرت إلى بعض كتفه الأيمن ـ أو كتفه الأيسر شعبة الذي شك ـ فإذا هو كهيئة الجمع عليه الثآليل ورواه مسلم والترمذي والنسائي وابن جرير وابن أبي حاتم من طرق عن عاصم الأحول به وفي الحديث الآخر الذي رواه أبو يعلى حدثنا محمد بن عون حدثنا عثمان بن مطر حدثنا عبدالغفور عن أبي نصر عن أبي رجاء عن أبي بكر الصديق رضي الله عنه عن رسول الله صلى الله عليه وسلم أنه قال \"عليكم بلا إله إلا الله والاستغفار فأكثروا منهما فان إبليس قال إنما أهلكت الناس بالذنوب وأهلكوني بلا إله إلا الله والاستغفار فلما رأيت ذلك أهلكتهم بالأهواء فهم يحسبون أنهم مهتدون\" وفي الأثر المروي \"قال إبليس وعزتك وجلالك لا أزال أغويهم ما دامت أرواحهم في أجسادهم فقال الله عز وجل وعزتي وجلالي لا أزال أغفر لهم ما استغفروني\" والأحاديث في فضل الاستغفار كثيرة جدا وقوله تبارك وتعالى \"والله يعلم متقلبكم ومثواكم\" أي يعلم تصرفكم في نهاركم ومستقركم في ليلكم كقوله تبارك وتعالى \"وهو الذي يتوفاكم بالليل ويعلم ما جرحتم بالنهار\" وقوله سبحانه وتعالى \"وما من دابة في الأرض إلا على الله رزقها ويعلم مستقرها ومستودعها كل في كتاب مبين\" وهذا القول ذهب إليه ابن جريج وهو اختيار ابن جرير وعن ابن عباس رضي الله عنهما متقلبكم في الدنيا ومثواكم في الآخرة وقال السدي متقلبكم في الدنيا ومثواكم في قبوركم والأول أولى وأظهر والله أعلم."
    },
    {
      "ayah": 2,
      "surah": 47,
      "text": "\"والذين آمنوا وعملوا الصالحات\" أي آمنت قلوبهم وسرائرهم وانقادت لشرع الله جوارحهم وبواطنهم وظواهرهم \"وآمنوا بما نزل على محمد\" عطف خاص على عام وهو دليل على أنه شرط في صحة الإيمان بعد بعثته صلى الله عليه وسلم وقوله تبارك وتعالى \"وهو الحق من ربهم\" جملة معترضة حسنة ولهذا قال جل جلاله \"كفر عنهم سيئاتهم وأصلح بالهم\" قال ابن عباس رضي الله عنهما: أي أمرهم وقال مجاهد: شأنهم وقال قتاده وابن زيد حالهم والكل متقارب وقد جاء في حديث تشميت العاطس \"يهديكم الله ويصلح بالكم\"."
    },
    {
      "ayah": 20,
      "surah": 47,
      "text": "يقول تعالى مخبرا عن المؤمنين أنهم تمنوا شرعية الجهاد فلما فرضه الله عز وجل وأمر به نكل عنه كثير من الناس كقوله تبارك وتعالى \"ألم تر إلى الذين قيل لهم كفوا أيديكم وأقيموا الصلاة وآتوا الزكاة فلما كتب عليهم القتال إذا فريق منهم يخشون الناس كخشية الله أو أشد خشية وقالوا ربنا لم كتبت علينا القتال لولا أخرتنا إلى أجل قريب قل متاع الدنيا قليل والآخرة خير لمن اتقى ولا تظلمون فتيلا\" وقال عز وجل ههنا \"ويقول الذين آمنوا لولا نزلت سورة\" أي مشتملة على حكم القتال ولهذا قال \"فإذا أنزلت سورة محكمة وذكر فيها القتال رأيت الذين في قلوبهم مرض ينظرون إليك نظر المغشي عليه من الموت\" أي من فزعهم ورعبهم وجبنهم من لقاء الأعداء."
    },
    {
      "ayah": 21,
      "surah": 47,
      "text": "قال مشجعا لهم \"فأولى لهم طاعة وقول معروف\" أي وكان الأولى بهم أن يسمعوا ويطيعوا أي في الحالة الراهنة \"فإذا عزم الأمر\" أي جد الحال وحضر القتال \"فلو صدقوا الله\" أي أخلصوا له النية \"لكان خيرا لهم\"."
    },
    {
      "ayah": 22,
      "surah": 47,
      "text": "\"فهل عسيتم إن توليتم\" أي عن الجهاد ونكلتم عنه \"أن تفسدوا في الأرض وتقطعوا أرحامكم\" أي تعودوا إلى ما كنتم فيه من الجاهلية الجهلاء تسفكون الدماء وتقطعون الأرحام."
    },
    {
      "ayah": 23,
      "surah": 47,
      "text": "وهذا نهى عن الإفساد في الأرض عموما وعن قطع الأرحام خصوصا بل قد أمر الله تعالى بالإصلاح في الأرض وصلة الأرحام وهو الإحسان إلى الأقارب في المقال والأفعال وبذل الأموال وقد وردت الأحاديث الصحاح والحسان بذلك عن رسول الله صلى الله عليه وسلم من طرق عديدة ووجوه كثيرة قال البخاري حدثنا خالد بن مخلد حدثنا سليمان حدثني معاوية بن أبي مزرد عن سعيد بن يسار عن أبي هريرة رضي الله عنه عن النبي صلى الله عليه وسلم قال: \"خلق الله تعالى الخلق فلما فرغ منه قامت الرحم فأخذت بحقوي الرحمن عز وجل فقال مه فقالت هذا مقام العائذ بك من القطيعة فقال تعالى: ألا ترضين أن أصل من وصلك وأقطع من قطعك؟ قالت بلى قال فذاك لك\" قال أبو هريرة رضي الله عنه اقرءوا إن شئتم \"فهل عسيتم إن توليتم أن تفسدوا في الأرض وتقطعوا أرحامكم\" ثم رواه البخاري من طريقين آخرين عن معاوية بن أبي مزرد به قال: قال رسول الله صلى الله عليه وسلم: \"اقرءوا إن شئتم\" فهل عستم إن توليتم أن تفسدوا في الأرض وتقطعوا أرحامكم\" ورواه مسلم من حديث معاوية بن أبي مزرد به وقال الإمام أحمد حدثنا إسماعيل بن علية حدثنا عيينة بن عبدالرحمن بن جوشن عن أبيه عن أبي بكرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم \"ما من ذنب أحرى أن يعجل الله تعالى عقوبته في الدنيا مع ما يدخر لصاحبه في الآخرة من البغي وقطيعة الرحم\" ورواه أبو داود والترمذي وابن ماجة من حديث إسماعيل هو ابن علية به وقال الترمذي هذا حديث صحيح وقال الإمام أحمد حدثنا محمد بن بكر حدثنا ميمون أبو محمد المراني حدثنا محمد بن عباد المخزومي عن ثوبان رضي الله عنه عن رسول الله صلى الله عليه وسلم قال \"من سره النساء في الأجل والزيادة في الرزق فليصل رحمه\" تفرد به أحمد وله شاهد في الصحيح وقال أحمد أيضا حدثنا يزيد بن هارون حدثنا حجاج ابن أرطاة عن عمرو بن شعيب عن أبيه عن جده قال جاء رجل إلى رسول الله صلى الله عليه وسلم فقال يا رسول الله إن لي ذوي أرحام أصل ويقطعون وأعفو ويظلمون وأحسن ويسيئون أفأكافئهم؟ قال صلى الله عليه وسلم \"لا إذن تتركون جميعا ولكن جد بالفضل وصلهم فإنه لن يزال معك ظهير من الله عز وجل ما كنت على ذلك\" تفرد به أحمد من هذا الوجه وله شاهد من وجه آخر وقال الإمام أحمد حدثنا يعلى حدثنا مطر عن مجاهد عن عبدالله بن عمرو رضي الله عنهما قال: قال رسول الله صلى الله عليه وسلم \"إن الرحم معلقة بالعرش وليس الواصل بالمكافئ ولكن الواصل الذي إذا قطعت رحمه وصلها\" رواه البخاري وقال أحمد حدثنا بهز حدثنا حماد بن سلمة أخبرنا قتادة عن أبي ثمامة الثقفي عن عبدالله بن عمرو رضي الله عنهما قال: قال رسول الله صلى الله عليه وسلم \"توضع الرحم يوم القيامة لها حجبة كحجبة المغزل تكلم بلسان طلق ذلق فتقطع من قطعها وتصل من وصلها\" وقال الإمام أحمد حدثنا سفيان حدثنا عمرو عن أبي قابوس عن عبدالله بن عمرو رضي الله عنهما يبلغ به النبي صلى الله عليه وسلم قال \"الراحمون يرحمهم الرحمن ارحموا أهل الأرض يرحمكم أهل السماء والرحم شجنة من الرحمن من وصلها وصلته ومن قطعها بتته\" وقد رواه أبو داود والترمذي من حديث سفيان بن عينة عن عمرو بن دينار به وهذا هو الذي يروي بتسلسل الأولية وقال الترمذي حسن صحيح وقال الإمام أحمد حدثنا يزيد بن هارون حدثنا هشام الدستوائي عن يحيى بن أبي كثير عن إبراهيم ابن عبدالله بن فارض أن أباه حدثه أنه دخل على عبدالرحمن بن عوف رضي الله عنه وهو مريض فقال له عبدالرحمن رضي الله عنه وصلتك رحم إن رسول الله صلى الله عليه وسلم قال: \"قال الله عز وجل أنا الرحمن خلقت الرحم وشققت لها اسما من اسمي فمن يصلها أصله ومن يقطعها أقطعه فأبته ـ أو قال ـ من بتها أبته\" تفرد به أحمد من هذا الوجه ورواه أحمد أيضا من حديث الزهري عن أبي سلمة عن المرداد ـ أو أبي المرداد ـ عن عبدالرحمن بن عوف به ورواه أبو داود والترمذي من رواية أبي سلمة عن أبيه والأحاديث في هذا كثيرة جدا وقال الطهراني حدثنا علي بن عبد العزيز حدثنا محمد بن عمار الموصلي حدثنا عيسى بن يونس عن الحجاج بن يونس عن الحجاج بن القرافصة عن أبي عمر البصري عن سليمان قال: قال رسول الله صلى الله عليه وسلم الأرواح جنود مجندة فما تعارف منها ائتلف وما تناكر منها اختلف\" وبه قال رسول الله صلى الله عليه وسلم: \"إذا ظهر القول وحزن العمل وائتلفت الألسنة وتباغضت القلوب وقطع كل ذي رحم رحمه فعند ذلك لعنهم الله وأصمهم وأعمى أبصارهم\" والأحاديث في هذا كثيرة والله أعلم."
    },
    {
      "ayah": 24,
      "surah": 47,
      "text": "يقول تعالى آمرا بتدبر القرآن وتفهمه وناهيا عن الإعراض عنه فقال \"أفلا يتدبرون القرآن أم على قلوب أقفالها\" أي بل على قلوب أقفالها فهي مطبقة لا يخلص إليها شيء من معانيه قال ابن جرير حدثنا بشر حدثنا حماد بن زيد حدثنا هشام بن عروة عن أبيه رضي الله عنه قال تلا رسول الله صلى الله عليه وسلم يوما \"أفلا يتدبرون القرآن أم على قلوب أقفالها\" فقال شاب من أهل اليمن بل عليها أقفالها حتى يكون الله تعالى يفتحها أو يفرجها فما زال الشاب في نفس عمر رضي الله عنه حتى ولي فاستعان به."
    },
    {
      "ayah": 25,
      "surah": 47,
      "text": "أي فارقوا الإيمان ورجعوا إلى الكفر \"من بعد ما تبين لهم الهدى الشيطان سول لهم\" أي زين لهم ذلك وحسنه \"وأملى لهم\" أي غرهم وخدعهم."
    },
    {
      "ayah": 26,
      "surah": 47,
      "text": "أي مالئوهم وناصحوهم في الباطن على الباطل وهذا شأن المنافقين يظهرون خلاف ما يبطنون ولهذا قال الله عز وجل \"والله يعلم إسرارهم\" أي ما يسرون وما يخفون الله مطلع عليه وعالم به كقوله تبارك وتعالى \"والله يكتب ما يبيتون\" ."
    },
    {
      "ayah": 27,
      "surah": 47,
      "text": "أي كيف حالهم إذا جاءتهم الملائكة لقبض أرواحهم وتعاصت الأرواح في أجسادهم واستخرجتها الملائكة بالعنف والقهر والضرب كما قال سبحانه وتعالى \"ولو ترى إذ يتوفى الذين كفروا الملائكة يضربون وجوههم وأدبارهم\"الأية وقال تعالى \"ولو ترى إذ الظالمون في غمرات الموت والملائكة باسطو أيديهم\" أي بالضرب \"أخرجوا أنفسكم اليوم تجزون عذاب الهون بما كنتم تقولون على الله غير الحق وكنتم عن آياته تستكبرون\"."
    },
    { "ayah": 28, "surah": 47, "text": "لا يوجد تفسير لهذه الأية" },
    {
      "ayah": 29,
      "surah": 47,
      "text": "أي أيعتقد المنافقون أن الله لا يكشف أمرهم لعباده المؤمنين بل سيوضح أمرهم ويجليه حتى يفهمهم ذوو البصائر وقد أنزل الله تعالى في ذلك سورة براءة فبين فيها فضائحهم وما يعتمدونه من الأفعال الدالة على نفاقهم ولهذا كانت تسمى الفاضحة والأضغان جمع ضغن وهو ما في النفوس من الحسد والحقد للإسلام وأهله والقائمين بنصره."
    },
    {
      "ayah": 3,
      "surah": 47,
      "text": "\"ذلك بأن الذين كفروا اتبعوا الباطل\" أي إنما أبطلنا أعمال الكفار وتجاوزنا عن سيئات الأبرار وأصلحنا شؤونهم لأن الذين كفروا اتبعوا الباطل أي اختاروا الباطل على الحق \"وأن الذين آمنوا اتبعوا الحق من ربهم كذلك يضرب الله للناس أمثالهم\" أي يبين لهم مآل أعمالهم وما يصيرون إليه في معادهم والله سبحانه وتعالى أعلم."
    },
    {
      "ayah": 30,
      "surah": 47,
      "text": "يقول عز وجل ولو نشاء يا محمد لأريناك أشخاصهم فعرفتهم عيانا ولكن لم يفعل تعالى ذلك في جميع المنافقين سترا منه على خلقه وحملا للأمور على ظاهر السلامة وردا للسرائر إلى عالمها \"ولتعرفنهم في لحن القول\" أي فيما يبدو من كلامهم الدال على مقاصدهم يفهم المتكلم من أي الحزبين هو بمعاني كلامه وفحواه وهو المراد من لحن القول كما قال أمير المؤمنين عثمان بن عفان رضي الله عنه ما أسر أحد سريرة إلا أبداها الله على صفحات وجهه وفلتات لسانه وفي الحديث \"ما أسر أحد سريرة إلا كساه الله تعالى جلبابها إن خيرا فخير وإن شرا فشر\" وقد ذكرنا ما يستدل به على نفاق الرجل وتكلمنا على نفاق العمل والاعتقاد في أول شرح البخاري بما أغنى عن إعادته ههنا. وقد ورد في الحديث تعيين جماعة من المنافقين. قال الإمام أحمد حدثنا وكيع حدثنا سفيان عن سلمة بن عياض عن أبيه عن أبي مسعود عقبة بن عمرو رضي الله عنه قال خطبنا رسول الله صلى الله عليه وسلم خطبة فحمد الله تعالى وأثنى عليه ثم قال \"إن منكم منافقين فمن سميت فليقم ـ ثم قال ـ قم يا فلان قم يا فلان قم يا فلان ـ حتى سمى ستة وثلاثين رجلا ثم قال ـ إن فيكم أو منكم ـ منافقين فاتقوا الله\" قال فمر عمر رضي الله عنه برجل ممن سمي مقنع قد كان يعرفه فقال مالك؟ فحدثه بما قال رسول الله صلى الله عليه وسلم فقال بعدا لك سائر اليوم."
    },
    {
      "ayah": 31,
      "surah": 47,
      "text": "\"ولنبلونكم\" أي لنختبرنكم بالأوامر والنواهي \"حتى نعلم المجاهدين منكم والصابرين ونبلو أخباركم\" وليس في تقدم علم الله تعالى بما هو كائن أنه سيكون شك ولا ريب فالمراد حتى نعلم وقوعه ولهذا يقول ابن عباس رضي الله عنهما في مثل هذا إلا لنعلم أي لنرى."
    },
    {
      "ayah": 32,
      "surah": 47,
      "text": "يخبر تعالى عمن كفر وصد عن سبيل الله وخالف الرسول وشاقه وارتد عن الإيمان من بعد ما تبين له الهدى أنه لن يضر الله شيئا وإنما يضر نفسه ويخسرها يوم معادها وسيحبط الله عمله فلا يثيبه على سالف من عمله الذي عقبه بردته مثقال بعوضة من خير بل يحبطه ويمحقه بالكلية كما أن الحسنات يذهبن السيئات."
    },
    {
      "ayah": 33,
      "surah": 47,
      "text": "وقد قال الإمام محمد بن نصر المروزي في كتاب الصلاة حدثنا أبو قدامة حدثنا وكيع حدثنا أبو جعفر الرازي عن الربيع بن أنس عن أبي العالية قال كان أصحاب رسول الله صلى الله عليه وسلم يرون أنه لا يضر مع لا إله إلا الله ذنب كما لا ينفع مع الشرك عمل فخافوا أن يبطل الذنب العمل ثم روى من طريق عبدالله ابن المبارك اخبرني بكر بن معروف عن مقاتل بن حيان عن نافع عن ابن عمر رضي الله عنهما قال: كنا معشر أصحاب رسول الله صلى الله عليه وسلم نرى أنه ليس شيء من الحسنات إلا مقبول حتى نزلت \"أطيعوا الله وأطيعوا الرسول ولا تبطلوا أعمالكم\" فقلنا ما هذا الذي يبطل أعمالنا؟ فقلنا الكبائر الموجبات والفواحش حتى نزل قوله تعالى \"إن الله لا يغفر أن يشرك به ويغفر ما دون ذلك لمن يشاء\" فلما نزلت كففنا عن القول في ذلك فكنا نخاف على من أصاب الكبائر والفواحش ونرجو لمن لم يصبها ثم أمر تبارك وتعالى عباده المؤمنين بطاعته وطاعة رسوله التي هي سعادتهم في الدنيا والآخرة ونهاهم عن الارتداد الذي هو مبطل للأعمال ولهذا قال تعالى \"ولا تبطلوا أعمالكم\" أي بالردة."
    },
    {
      "ayah": 34,
      "surah": 47,
      "text": "قوله تعالى \"إن الذين كفروا وصدوا عن سبيل الله ثم ماتوا وهم كفار فلن يغفر الله لهم\" كقوله سبحانه وتعالى \"إن الله لا يغفر أن يشرك به ويغفر ما دون ذلك لمن يشاء\" الآية."
    },
    {
      "ayah": 35,
      "surah": 47,
      "text": "قال جل وعلا لعباده المؤمنين \"فلا تهنوا\" أى لا تضعفوا عن الأعداء \"وتدعوا إلى السلم\" أي المهادنة والمسالمة ووضع القتال بينكم وبين الكفار في حال قوتكم وكثرة عددكم وعدتكم ولهذا قال \"فلا تهنوا وتدعوا إلى السلم وأنتم الأعلون\" أي في حال علوكم على عدوكم فأما إذا كان الكفار فيهم قوة وكثرة بالنسبة إلى جميع المسلمين ورأى الإمام في المهادنة والمعاهدة مصلحة فله أن يفعل ذلك كما فعل رسول الله صلى الله عليه وسلم حين صده كفار قريش عن مكة ودعوه إلى الصلح ووضع الحرب بينهم وبينه عشر سنين فأجابهم صلى الله عليه وسلم إلى ذلك وقوله جلت عظمته \"والله معكم\" فيه بشارة عظيمة بالنصر والظفر على الأعداء \"ولن يتركم أعمالكم\" أي ولن يحبطها ويبطلها ويسلبكم إياها بل يوفيكم ثوابها ولا ينقصكم منها شيئا والله أعلم."
    },
    {
      "ayah": 36,
      "surah": 47,
      "text": "يقول تعالى تحقيرا لأمر الدنيا وتهوينا لشأنها \"إنما الحياة الدنيا لعب ولهو\" أي حاصلها ذلك إلا ما كان منها لله عز وجل ولهذا قال تعالى \"وإن تؤمنوا وتتقوا يؤتكم أجوركم ولا يسألكم أموالكم\" أي هو غني عنكم لا يطلب منكم شيئا وإنما فرض عليكم الصدقات من الأموال مواساة لإخوانكم الفقراء ليعود نفع ذلك عليكم ويرجع ثوابه إليكم."
    },
    {
      "ayah": 37,
      "surah": 47,
      "text": "\"إن يسألكموها فيحفكم تبخلوا\" أي يحرجكم تبخلوا \"ويخرج أضغانكم\" قال قتادة: قد علم الله تعالى أن في إخراج الأموال إخراج الأضغان وصدق قتاده فإن المال محبوب ولا يصرف إلا فيما هو أحب إلى الشخص منه."
    },
    {
      "ayah": 38,
      "surah": 47,
      "text": "\"ها أنتم هؤلاء تدعون لتنفقوا في سبيل الله فمنكم من يبخل\" أي لا يجيب إلى ذلك \"ومن يبخل فإنما يبخل عن نفسه\" أي إنما نقص نفسه من الأجر وإنما يعود وبال ذلك عليه \"والله الغني\" أي عن كل ما سواه وكل شيء فقير إليه دائما ولهذا قال تعالى \"وأنتم الفقراء\" أي بالذات إليه فوصفه بالغني وصف لازم له ووصف الخلق بالفقر وصف لازم لهم لا ينفكون عنه. وقوله تعالى \"وإن تتولوا\" أي عن طاعته واتباع شرعه \"يستبدل قوما غيركم ثم لا يكونوا أمثالكم\" أي ولكن يكونون سامعين مطيعين له ولأوامره. وقال ابن أبي حاتم وابن جرير حدثنا يونس بن عبدالأعلى حدثنا ابن وهب أخبرني مسلم بن خالد عن العلاء بن عبدالرحمن عن أبيه عن أبي هريره رضي الله عنه قال إن رسول الله صلى الله عليه وسلم تلا هذه الآية \"وإن تتولوا يستبدل قوما غيركم ثم لا يكونوا أمثالكم\" قالوا يا رسول الله من هؤلاء الذين إن تولينا استبدل بنا ثم لا يكونوا أمثالنا؟ قال فضرب بيده على كتف سلمان الفارسي رضي الله عنه ثم قال \"هذا وقومه ولو كان الدين عند الثريا لتناوله رجال من الفرس\" تفرد به مسلم بن خالد الزنجي ورواه عنه غير واحد وقد تكلم فيه بعض الأئمة رحمة الله عليهم والله أعلم. آخر تفسير سورة القتال ولله الحمد والمنة."
    },
    {
      "ayah": 4,
      "surah": 47,
      "text": "يقول تعالى مرشدا للمؤمنين إلى ما يعتمدونه في حروبهم مع المشركين \"فإذا لقيتم الذين كفروا فضرب الرقاب\" أي إذا واجهتموهم فاحصدوهم حصدا بالسيوف \"حتى إذا أثخنتموهم\" أي أهلكتموهم قتلا \"فشدوا الوثاق\" الأسارى الذين تأسرونهم ثم أنتم بعد انقضاء الحرب وانفصال المعركة مخيرون في أمرهم إن شئتم مننتم عليهم فأطلقتم أساراهم مجانا وإن شئتم فاديتموهم بمال تأخذونه منهم وتشاطرونهم عليه والظاهر أن هذه الآية نزلت بعد وقعة بدر فإن الله سبحانه وتعالى عاتب المؤمنين على الاستكثار من الأسارى يومئذ ليأخذوا منهم الفداء والتقليل من القتل يومئذ فقال \"ما كان لنبي أن يكون له أسرى حتى يثخن في الأرض تريدون عرض الدنيا والله يريد الآخرة والله عزيز حكيم لولا كتاب من الله سبق لمسكم فيما أخذتم عذاب عظيم\" ثم قد ادعى بعض العلماء أن هذه الأية المخيرة بين مفاداة الأسير والمن عليه منسوخة بقوله تعالى \"فإذا انسلخ الأشهر الحرم فاقتلوا المشركين حيث وجدتموهم\" الآية رواه العوفي عن ابن عباس رضي الله عنهما وقاله قتادة والضحاك والسدي وابن جريج وقال الآخرون وهم الأكثرون ليست بمنسوخة ثم قال بعضهم إنما الإمام مخير بين المن على الأسير ومفاداته فقط ولا يجوز له قتله وقال آخرون منهم بل له أن يقتله إن شاء لحديث قتل النبي صلى الله عليه وسلم النضر بن الحارث وعقبة بن أبي معيط من أسارى بدر وقال ثمامة بن أثال لرسول الله صلى الله عليه وسلم حين قال له \"ما عندك يا ثمامة؟\" فقال إن تقتل تقتل ذا دم وإن تمنن تمنن على شاكر وإن كنت تريد المال فاسأل تعط منه ما شئت وزاد الشافعي رحمة الله عليه فقال الإمام مخير بين قتله أو المن عليه أو مفاداته أو استرقاقه أيضا وهذه المسألة محررة في علم الفروع وقد دللنا على ذلك في كتابنا الأحكام ولله سبحانه وتعالى الحمد والمنة وقوله عز وجل \"حتى تضع الحرب أوزارها\" قال مجاهد حتى ينزل عيسى بن مريم عليه الصلاة والسلام وكأنه أخذه من قوله صلى الله عليه وسلم \"لا تزال طائفة من أمتي ظاهرين على الحق حتى يقاتل آخرهم الدجال\" وقال الإمام أحمد حدثنا الحكم بن نافع حدثنا إسماعيل ابن عياش عن إبراهيم بن سليمان عن الوليد بن عبدالرحمن الجرشي عن جبير بن نفير قال إن سلمة بن نفيل أخبرهم أنه أتي رسول الله صلى الله عليه وسلم فقال إنى سيبت الخيل وألقيت السلاح ووضعت الحرب أوزارها وقلت لا قتال فقال له النبي صلى الله عليه وسلم \"الآن جاء القتال لا تزال طائفة من أمتي ظاهرين على الناس يزيغ الله تعالى قلوب أقوام فيقاتلونهم ويرزقهم الله منهم حتى يأتي أمر الله وهم على ذلك ألا إن عقد دار المؤمنين بالشام والخيل معقود في نواصيها الخير إلى يوم القيامة\" وهكذا رواه النسائي من طريقين عن جبير بن نفير عن سلمة بن نفيل السكوني به وقال أبو القاسم البغوي حدثنا داود بن رشيد حدثنا الوليد عن جبير بن محمد بن مهاجر عن الوليد بن عبدالرحمن الجرشي عن جبير بن نفير عن النواس بن سمعان رضي الله عنه قال لما فتح على رسول الله صلى الله عليه وسلم فتح قالوا يا رسول الله سيبت الخيل ووضعت السلاح ووضعت الحرب أوزارها قالوا لا قتال قال: \"كذبوا الآن جاء القتال لا يزال الله تعالى يزيغ قلوب قوم يقاتلونهم فيرزقهم منهم حتى يأتي أمر الله وهم على ذلك وعقد دار المسلمين بالشام\" وهكذا رواه الحافظ أبو يعلي الموصلي عن داود بن رشيد به والمحفوظ أنه من رواية سلمة بن نفيل كما تقدم وهذا يقوي القول بعدم النسخ كأنه شرع هذا الحكم في الحرب إلى أن لا يبقى حرب وقال قتادة \"حتى تضع الحرب أوزارها\" حتى لا يبقى شرك وهذا كقوله تعالى \"وقاتلوهم حتى لا تكون فتنة ويكون الدين لله\" ثم قال بعضهم حتى تضع الحرب أوزارها أي أوزار المحاربين وهم المشركون بأن يتوبوا إلى الله عز وجل وقيل أوزار أهلها بأن يبذلوا الوسع في طاعة الله تعالى وقوله عز وجل \"ذلك ولو يشاء الله لانتصر منهم\" أي هذا ولو شاء الله لانتقم من الكافرين بعقوبة ونكال من عنده \"ولكن ليبلو بعضكم ببعض\" أي ولكن شرع لكم الجهاد وقتال الأعداء ليختبركم وليبلو أخباركم كما ذكر حكمته في شرعية الجهاد في سورتي آل عمران وبراءة في قوله تعالى \"أم حسبتم أن تدخلوا الجنة ولما يعلم الله الذين جاهدوا منكم ويعلم الصابرين\" وقال تبارك وتعالي في سورة براءة \"قاتلوهم يعذبهم الله بأيديكم ويخزهم وينصركم عليهم ويشف صدور قوم مؤمنين ويذهب غيظ قلوبهم ويتوب الله على من يشاء والله عليم حكيم\" ثم لما كان من شأن القتال أن يقتل كثير من المؤمنين قال \"والذين قتلوا في سبيل الله فلن يضل أعمالهم\" أي لن يذهبها بل يكثرها وينميها ويضاعفها ومنهم من يجري عليه عمله طول برزخه كما ورد بذلك الحديث الذي رواه الإمام أحمد في مسنده حيث قال: حدثنا زيد بن يحيى الدمشقي حدثنا ابن ثوبان عن أبيه عن مكحول عن كثير بن مرة عن قيس الجذامي ـ رجل كانت له صحبة ـ قال: قال رسول الله صلى الله عليه وسلم \"يعطى الشهيد ست خصال: عند أول قطرة من دمه تكفر عنه كل خطيئة ويرى مقعده من الجنة ويزوج من الحور العين ويأمن من الفزع الأكبر ومن عذاب القبر ويحلى حلة الإيمان\" تفرد به أحمد رحمه الله \" حديث آخر \"قال أحمد أيضا حدثنا الحكم بن نافع حدثني إسماعيل بن عياش عن يحيى بن سعيد عن خالد بن معدان عن المقدام بن معد يكرب الكندي رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم \"إن للشهيد عند الله ست خصال: أن يغفر له في أول دفقة من دمه ويرى مقعده من الجنة ويحلى حلة الإيمان ويزوج من الحور العين ويجار من عذاب القبر ويأمن من الفزع الأكبر ويوضع على رأسه تاج الوقار مرصع بالدر والياقوت الياقوتة منه خير من الدنيا وما فيها ويزوج اثنتين وسبعين زوجة من الحور العين ويشفع في سبعين إنسانا من أقاربه\" وقد أخرجه الترمذي وصححه وابن ماجة وفي صحيح مسلم عن عبدالله بن عمرو رضي الله عنهما عن أبي قتادة رضي الله عنه أن رسول الله صلى الله عليه وسلم قال \"يغفر للشهيد كل شيء إلا الدين\" وروي من حديث جماعة من الصحابة رضي الله عنهم وقال أبو الدرداء رضي الله عنه قال رسول الله صلى الله عليه وسلم \"يشفع الشهيد في سبعين من أهل بيته\" ورواه أبو داود والأحاديث في فضل الشهيد كثيرة جدا."
    },
    {
      "ayah": 5,
      "surah": 47,
      "text": "\"سيهديهم\" أي إلى الجنة كقوله تعالى \"إن الذين آمنوا وعملوا الصالحات يهديهم ربهم بإيمانهم تجري من تحتهم الأنهار في جنات النعيم\" وقوله عز وجل \"ويصلح بالهم\" أي أمرهم وحالهم."
    },
    {
      "ayah": 6,
      "surah": 47,
      "text": "أي عرفهم بها وهداهم إليها قال مجاهد يهتدي أهلها إلى بيوتهم ومساكنهم وحيث قسم الله لهم منها لا يخطئون كأنهم ساكنوها منذ خلقوا لا يستدلون عليها أحدا وروى مالك عن زيد بن أسلم نحو هذا وقال محمد بن كعب يعرفون بيوتهم إذا دخلوا الجنة كما تعرفون بيوتكم إذا انصرفتم من الجمعة وقال مقاتل ابن حيان بلغنا أن الملك الذي كان وكل بحفظ عمله في الدنيا يمشي بين يديه في الجنة ويتبعه ابن آدم حتى يأتي أقصى منزل هو له فيعرفه كل شيء أعطاه الله تعالى في الجنة فإذا انتهى إلى أقصى منزلة في الجنة دخل إلى منزله وأزواجه وانصرف الملك عنه ذكره ابن أبي حاتم رحمه الله وقد ورد الحديث الصحيح بذلك أيضا رواه البخاري من حديث قتادة عن أبي المتوكل الناجي عن أبي سعيد الخدري رضي الله عنه أن رسول الله صلى الله عليه وسلم قال \"إذا خلص المؤمنون من النار حبسوا بقنطرة بين الجنة والنار يتقاصون مظالم كانت بينهم في الدنيا حتى إذا هذبوا ونقوا أذن لهم في دخول الجنة والذي نفسي بيده إن أحدهم بمنزله في الجنة أهدى منه بمنزله الذي كان في الدنيا\"."
    },
    {
      "ayah": 7,
      "surah": 47,
      "text": "\" كقوله عز وجل \"ولينصرن الله من ينصره\" فإن الجزاء من جنس العمل ولهذا قال تعالى \"يثبت أقدامكم\" كما جاء في الحديث \"من بلغ ذا سلطان حاجه من لا يستطيع إبلاغها ثبت الله تعالى قدميه على الصراط يوم القيامة\"."
    },
    {
      "ayah": 8,
      "surah": 47,
      "text": "\"والذين كفروا فتعسا لهم\" عكس تثبيت الأقدام للمؤمنين الناصرين لله تعالى ولرسوله صلى الله عليه وسلم وقد ثبت في الحديث عن رسول الله صلى الله عليه وسلم أنه قال \"تعس عبد الدينار تعس عبد الدرهم تعس عبد القطيفة تعس وانتكس وإذا شيك فلا انتقش\" أي فلا شفاه الله عز وجل\" وقوله سبحانه وتعالى \"وأضل أعمالهم\" أي أحبطها وأبطلها."
    },
    { "ayah": 9, "surah": 47, "text": "\"ذلك بأنهم كرهوا ما أنزل الله\" أي لا يريدونه ولا يحبونه \"فأحبط أعمالهم\"." }
  ]
}
