{
  "ayahs": [
    {
      "ayah": 1,
      "surah": 48,
      "text": "سورة الفتح: قال الإمام أحمد حدثنا وكيع حدثنا شعبة عن معاوية بن قرة قال سمعت عبدالله بن مغفل يقول قرأ رسول الله صلى الله عليه وسلم عام الفتح في مسيره سورة الفتح على راحلته فرجع فيها قال معاوية لولا أني أكره أن يجتمع الناس علينا لحكيت قراءته أخرجاه من حديث شعبة به. نزلت هذه السورة الكريمة لما رجع رسول الله صلى الله عليه وسلم من الحديبية في ذي القعدة من سنة ست من الهجرة حين صده المشركون عن الوصول إلى المسجد الحرام فيقضي عمرته فيه وحالوا بينه وبين ذلك ثم مالوا إلى المصالحة والمهادنة وأن يرجع عامه هذا ثم يأتي من قابل فأجابهم إلى ذلك على كره من جماعة من الصحابة منهم عمر بن الخطاب رضي الله عنه كما سيأتي تفصيله في موضعه من تفسير هذه السورة إن شاء الله تعالى فلما نحر هديه حيث أحصر ورجع أنزل الله عز وجل هذه السورة فيما كان من أمره وأمرهم وجعل ذلك الصلح فتحا باعتبار ما فيه من المصلحة وما آل الأمر إليه كما روى ابن مسعود رضي الله عنه وغيره أنه قال: إنكم تعدون الفتح فتح مكة ونحن نعد الفتح صلح الحديبية وقال الأعمش عن أبي سفيان عن جابر رضي الله عنه قال: ما كنا نعد الفتح إلا يوم الحديبية وقال البخاري حدثنا عبيدالله بن موسى عن إسرائيل عن أبي إسحاق عن البراء رضي الله عنه قال: تعدون أنتم الفتح فتح مكة وقد كان فتح مكة فتحا ونحن نعد الفتح بيعة الرضوان يوم الحديبية كنا مع رسول الله صلى الله عليه وسلم أربع عشرة مائة والحديبية بئر فنزحناها فلم نترك فيها قطرة فبلغ ذلك رسول الله صلى الله عليه وسلم فأتاها فجلس على شفيرها ثم دعا بإناء من ماء فتوضأ ثم تمضمض ودعا ثم صبه فيها فتركناها غير بعيد ثم إنها أصدرتنا ما شئنا نحن وركائبنا وقال الإمام أحمد حدثنا نوح حدثنا مالك بن أنس عن زيد بن أسلم عن أبيه عن عمر بن الخطاب رضي الله عنه قال: كنا مع رسول الله صلى الله عليه وسلم في سفر قال فسألته عن شيء ثلاث مرات فلم يرد علي قال فقلت في نفسي ثكلتك أمك يا ابن الخطاب ألححت كررت على رسول الله صلى الله عليه وسلم ثلاث مرات فلم يرد عليك؟ قال فركبت راحلتي فحركت بعيري فتقدمت مخافة أن يكون نزل في شيء قال فإذا أنا بمناد يا عمر قال فرجعت وأنا أظن أنه نزل في شيء قال: فقال النبي صلى الله عليه وسلم \"نزل علي البارحة سورة هي أحب إلي من الدنيا وما فيها: \"إن فتحنا لك فتحا مبينا ليغفر لك الله ما تقدم من ذنبك وما تأخر\" ورواه البخاري والترمذي والنسائي من طرق عن مالك رحمه الله وقال علي بن المديني هذا إسناد مدني جيد لم نجده إلا عندهم."
    },
    {
      "ayah": 10,
      "surah": 48,
      "text": "ثم قال عز وجل لرسوله صلى الله عليه وسلم تشريفا له وتعظيما وتكريما \"إن الذين يبايعونك إنما يبايعون الله\" كقوله جل وعلا \"من يطع الرسول فقد أطاع الله\" \"يد الله فوق أيديهم\" أي هو حاضر معهم يسمع أقوالهم ويرى مكانهم ويعلم ضمائرهم وظواهرهم فهو تعالى هو المبايع بواسطة رسول الله صلى الله عليه وسلم كقوله تعالى \"إن الله اشترى من المؤمنين أنفسهم وأموالهم بأن لهم الجنة يقاتلون فى سبيل الله فيقتلون ويقتلون وعدا عليه حقا في التوراة والإنجيل والقرآن ومن أوفى بعهده من الله فاستبشروا بيعكم الذي بايعتم به وذلك هو الفوز العظيم\" وقد قال ابن أبي حاتم حدثنا علي بن الحسين حدثنا الفضل بن يحيى الأنباري حدثنا علي بن بكار عن محمد بن عمرو عن أبي سلمة عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم \"من سل سيفه في سبيل الله فقد بايع الله\" وحدثنا أبي حدثنا يحيى بن المغيرة أخبرنا جرير عن عبدالله بن عثمان بن خثيم عن سعيد بن جبير عن ابن عباس رضي الله عنهما قال: قال رسول الله صلى الله عليه وسلم في الحجر \"والله ليبعثنه الله عز وجل يوم القيامة له عينان ينظر بهما ولسان ينطق به ويشهد على من استلمه بالحق فمن استلمه فقد بايع الله تعالى\" ثم قرأ رسول الله صلى الله عليه وسلم \"إن الذين يبايعونك إنما يبايعون الله يد الله فوق أيديهم\" ولهذا قال تعالى ههنا \"فمن نكث فإنما ينكث على نفسه\" أي إنما يعود وبال ذلك على الناكث والله غني عنه \"ومن أوفى بما عاهد عليه الله فسيؤتيه أجرا عظيما\" أي ثوابا جزيلا وهذه البيعة هي بيعة الرضوان وكانت تحت شجرة سمرة بالحديبية وكان الصحابة رضي الله عنهم الذين بايعوا رسول الله صلى الله عليه وسلم يومئذ قيل ألفا وثلثمائة وقيل وأربعمائة وقيل وخمسمائة والأوسط أصح \"ذكر الأحاديث الواردة في ذلك\" قال البخاري حدثنا قتيبة حدثنا سفيان عن عمرو عن جابر رضي الله عنه قال كنا يوم الحديبية ألفا وأربعمائة ورواه مسلم من حديث سفيان بن عيينة به وأخرجاه أيضا من حديث الأعمش عن سالم بن أبي الجعد عن جابر رضي الله عنه قال: كنا يومئذ ألفا وأربعمائة ووضع يده في ذلك الماء فجعل الماء ينبع من بين أصابعه حتى رووا كلهم وهذا مختصر من سياق آخر حين ذكر قصة عطشهم يوم الحديبية وأن رسول الله صلى الله عليه وسلم أعطاهم سهما من كنانته فوضعوه في بئر الحديبية فجاشت بالماء حتى كفتهم فقيل لجابر رضي الله عنه كم كنتم يومئذ؟ قال كنا ألفا وأربعمائة ولو كنا مائة ألف لكفانا وفي رواية في الصحيحين عن جابر رضي الله عنه أنهم كانوا خمس عشرة مائة وروى البخاري من حديث قتادة قلت لسعيد بن المسيب كم كان الذين شهدوا بيعة الرضوان؟ قال خمس عشرة مائة قلت فإن جابر بن عبدالله رضي الله عنهما قال كانوا أربع عشرة مائه قال رحمه الله: وهم هو حدثني أنهم كانوا خمس عشرة مائة قال البيهقي هذه الرواية تدل على أنه كان في القديم يقول خمس عشرة مائة ثم ذكر الوهم فقال أربع عشرة مائة وروى العوفي عن ابن عباس رضي الله عنهما أنهم كانوا ألفا وخمسمائة وخمسة وعشرين والمشهور الذي رواه عنه غير واحد أربع عشرة مائة وهذا هو الذي رواه البيهقي عن الحاكم عن الأصم عن العباس الدوري عن يحيى بن معين عن شبابة بن سوار عن شعبة عن قتادة عن سعيد بن المسيب عن أبيه قال: كنا مع رسول الله صلى الله عليه وسلم تحت الشجرة ألفا وأربعمائة وكذلك هو الذي في رواية سلمة بن الأكوع ومعقل بن يسار البراء بن عازب رضي الله عنهم وبه يقول غير واحد من أصحاب المغازي والسير وقد أخرج صاحبا الصحيح من حديث شعبة عن عمرو بن مرة قال: سمعت عبدالله بن أبي أوفى رضي الله عنه يقول: كان أصحاب الشجرة ألفا وأربعمائة وكانت أسلم يومئذ ثمن المهاجرين وروى محمد بن إسحاق في السيرة عن الزهري عن عروة بن الزبير عن المسور بن مخرمة ومروان بن الحكم أنهما حدثاه قالا: خرج رسول الله صلى الله عليه وسلم عام الحديبية يريد زيارة البيت لا يريد قتالا وساق معه الهدي سبعين بدنة وكان الناس سبعمائة رجل كل بدنة عن عشرة نفر وكان جابر بن عبدالله رضي الله عنهما فيما بلغني عنه يقول: كنا أصحاب الحديبية أربعة عشرة مائة كذا قال ابن إسحاق وهو معدود من أوهامه فإن المحفوظ في الصحيحين أنهم كانوا بضع عشرة مائة كما سيأتي إن شاء الله تعالى. \"ذكر سبب هده البيعة العظيمة\" قال محمد بن إسحاق بن يسار في السيرة ثم دعا رسول الله صلى الله عليه وسلم عمر بن الخطاب رضي الله عنه ليبعثه إلى مكة ليبلغ عنه أشراف قريش ما جاء له فقال يا رسول الله إنى أخاف قريشا على نفسي وليس بمكة من بني عدي بن كعب من يمنعني وقد عرفت قريش عداوتي إياها وغلظي عليها ولكني أدلك على رجل أعز بها مني عثمان بن عفان رضي الله عنه نبعثه إلى أبي سفيان وأشراف قريش يخبرهم أنه لم يأت لحرب وأنه إنما جاء زائرا لهذا البيت ومعظما لحرمته فخرج عثمان رضي الله عنه إلى مكة فلقيه أبان بن سعيد بن العاص حين دخل مكة أو قبل أن يدخلها فحمله بين يديه ثم أجاره حتى بلغ رسالة رسول الله صلى الله عليه وسلم فانطلق عثمان رضي الله عنه حتى أتى أبا سفيان وعظماء قريش فبلغهم عن رسول الله صلى الله عليه وسلم ما أرسله به فقالوا لعثمان رضي الله عنه حين فرغ من رسالة رسول الله صلى الله عليه وسلم إليهم إن شئت أن تطوف بالبيت فطف فقال ما كنت لأفعل حتى يطوف به رسول صلى الله عليه وسلم واحتبسته قريش عندها فبلغ رسول الله صلى الله عليه وسلم والمسلمين أن عثمان رضي الله عنه قد قتل قال ابن إسحاق فحدثني عبدالله بن أبي بكر أن رسول الله صلى الله عليه وسلم قال حين بلغه أن عثمان قد قتل: \"لا نبرح حتى نناجز القوم\" ودعا رسول الله صلى الله عليه وسلم الناس إلى البيعة فكانت بيعة الرضوان تحت الشجرة فكان الناس يقولون بايعهم رسول الله صلى الله عليه وسلم على الموت وكان جابر بن عبدالله رضي الله عنهما يقول: إن رسول الله صلى الله عليه وسلم لم يبايعهم على الموت ولكن بايعنا على أن لا نفر فبايع الناس ولم يتخلف أحد من المسلمين حضرها إلا الجد بن قيس أخو بني سلمة فكان جابر رضي الله عنه يقول والله لكأني أنظر إليه لاصقا بإبط ناقته قد صبأ إليها يستتر بها من الناس ثم أتى رسول الله صلى الله عليه وسلم أن الذي كان من أمر عثمان رضي الله عنه باطل وذكر ابن لهيعة عن أبي الأسود عن عروة بن الزبير رضي الله عنهما قريبا من هذا السياق وذاد في سياقه أن قريشا بعثوا وعندهم عثمان رضي الله عنه سهيل بن عمرو وحويطب بن عبدالعزى ومكرز بن حفص إلى رسول الله صلى الله عليه وسلم فبينما هم عندهم إذ وقع كلام بين بعض المسلمين وبعض المشركين وتراموا بالنبل والحجارة وصاح الفريقان كلاهما وارتهن كل من الفريقين من عنده من الرسل ونادى منادي رسول الله صلى الله عليه وسلم ألا إن روح القدس قد نزل على رسول الله صلى الله عليه وسلم وأمر بالبيعة فأخرجوا على اسم الله تعالى فبايعوا فسار المسلمون إلى رسول الله صلى الله عليه وسلم وهو تحت الشجرة فبايعوه على أن لا يفروا أبدا فأرعب ذلك المشركين وأرسلوا من كان عندهم من المسلمين ودعوا إلى الموادعة والصلح وقال الحافظ أبو بكر البيهقي أخبرنا علي بن أحمد بن عبدان أخبرنا أحمد بن عبيد الصفار حدثنا هشام حدثنا الحسن بن بشير حدثنا الحكم بن عبدالملك عن قتادة عن أنس بن مالك رضي الله عنه قال لما أمر رسول الله صلى الله عليه وسلم ببيعة الرضوان كان عثمان بن عفان رضي الله عنه رسول رسول الله صلى الله عليه وسلم إلى أهل مكة فبايع الناس فقال رسول الله صلى الله عليه وسلم: \"اللهم إن عثمان في حاجة الله تعالى وحاجة رسوله\" فضرب بإحدى يديه على الأخرى فكانت يد رسول الله صلى الله عليه وسلم لعثمان رضي الله عنه خيرا من أيديهم لأنفسهم قال ابن هشام حدثني من أثق به عمن حدثه بإسناد له عن أبي مليكة عن ابن عمر رضي الله عنهما قال: بايع رسول الله صلى الله عليه وسلم لعثمان رضي الله عنه فضرب بإحدى يديه على الأخرى وقال عبدالملك بن هشام النحوي فذكر وكيع عن إسماعيل بن أبى خالد عن الشعبي قال: إن أول من بايع رسول الله صلى الله عليه وسلم بيعة الرضوان أبو سنان الأسدي وقال أبو بكر عبدالله بن الزبير الحميدي حدثنا سفيان حدثنا ابن أبي خالد عن الشعبي قال لما دعا رسول الله صلى الله عليه وسلم الناس إلى البيعة كان أول من انتهى إليه أبو سنان الأسدي فقال ابسط يدك أبايعك فقال النبي صلى الله عليه وسلم \"علام تبايعني؟\" فقال أبو سنان رضي الله عنه على ما في نفسك هذا أبو سنان بن وهب الأسدي رضي الله عنه وقال البخاري حدثنا شجاع بن الوليد أنه سمع النضر بن محمد يقول حدثنا صخر بن الربيع عن نافع رضي الله عنه قال إن الناس يتحدثون أن ابن عمر رضي الله عنهما أسلم قبل عمر وليس كذلك ولكن عمر رضي الله عنه يوم الحديبية أرسل عبدالله إلى الفرس له عند رجل من الأنصار أن يأتي به ليقاتل عليه ورسول الله صلى الله عليه وسلم يبايع عند الشجرة وعمر رضي الله عنه لا يدري بذلك فبايعه عبدالله رضي الله عنه ثم ذهب إلى الفرس فجاء به إلى عمر رضي الله عنه وعمر رضي الله عنه يستلئم للقتال فاخبره أن رسول الله صلى الله عليه وسلم يبايع تحت الشجرة فانطلق فذهب معه حتى بايع رسول الله صلى الله عليه وسلم وهي التي يتحدث الناس أن ابن عمر أسلم قبل عمر رضي الله عنهما ثم قال البخاري وقال هشام بن عمار حدثنا الوليد بن مسلم حدثنا عمرو بن محمد العمري أخبرني نافع عن ابن عمر رضي الله عنهما قال: إن الناس كانوا مع رسول الله صلى الله عليه وسلم قد تفرقوا في ظلال الشجر فإذا الناس محدقون بالنبي صلى الله عليه وسلم فقال يعني عمر رضي الله عنه يا عبدالله انظر ما شأن الناس قد أحدقوا برسول الله صلى الله عليه وسلم فوجدهم يبايعون فبايع ثم رجع إلى عمر رضي الله عنه فخرج فبايع وقد أسنده البيهقي عن أبي عمرو الأديب عن أبي بكر الإسماعيلي عن الحسن بن سفيان عن دحيم حدثني الوليد بن مسلم فذكره وقال الليث عن أبي الزبير عن جابر رضي الله عنه قال: كنا يوم الحديبية ألفا وأربعمائة فبايعناه وعمر رضي الله عنه أخذ بيده تحت الشجرة وهي سمرة وقال بايعناه على أن لا نفر ولم نبايعه على الموت رواه مسلم عن قتيبة عنه وروى مسلم عن يحيى عن يزيد بن زريع عن خالد عن الحكم بن عبدالله الأعرج عن معقل بن يسار رضي الله عنه قال: لقد رأيتني يوم الشجرة والنبي صلى الله عليه وسلم يبايع الناس وأنا رافع غصنا من أغصانها على رأسه ونحن أربع عشرة مائة قال ولم نبايعه على الموت ولكن بايعناه على أن لا نفر وقال البخاري حدثنا المكي بن إبراهيم عن يزيد بن أبي عبيد عن سلمة بن الأكوع رضي الله عنه قال: بايعت رسول الله صلى الله عليه وسلم تحت الشجرة قال يزيد قلت يا أبا مسلمة على أي شيء كنتم تبايعون يومئذ؟ قال على الموت وقال البخاري أيضا حدثنا أبو عاصم حدثنا يزيد ابن أبي عبيد عن سلمة رضي الله عنه قال: بايعت رسول الله صلى الله عليه وسلم يوم الحديبية ثم تنحيت فقال صلى الله عليه وسلم \"يا سلمة ألا تبايع؟ \" قلت قد بايعت قال صلى الله عليه وسلم \"أقبل فبايع\" فدنوت فبايعته قلت علام بايعته يا سلمة؟ قال على الموت وأخرجه مسلم من وجه آخر عن يزيد بن أبي عبيد وكذا روى البخاري عن عباد بن تميم أنهم بايعوه على الموت وقال البيهقي أخبرنا أبو عبدالله الحافظ أخبرنا أبو الفضل بن إبراهيم حدثنا أحمد بن سلمة حدثنا إسحاق بن إبراهيم حدثنا أبو عامر العقدي حدثنا عبدالملك بن عمرو حدثنا عكرمة بن عمار اليمامي عن إياس بن سلمة عن أبيه سلمة بن الأكوع رضي الله عنه قال: قدمنا الحديبية مع رسول الله صلى الله عليه وسلم ونحن أربع عشرة مائة وعليها خمسون شاة لا ترويها فقعد رسول الله صلى الله عليه وسلم على جباها يعني الركي فإما دعا وإما بصق فيها فجاشت فسقينا واستقينا قال ثم إن رسول الله صلى الله عليه وسلم دعا إلى البيعة في أصل الشجرة فبايعته أول الناس ثم بايع وبايع حتى إذا كان في وسط الناس قال صلى الله عليه وسلم \"بايعني يا سلمة\" قال: قلت يا رسول الله قد بايعتك في أول الناس قال صلى الله عليه وسلم \"وأيضا\" قال ورآني رسول الله صلى الله عليه وسلم عزلا فأعطاني حجفة أو درقة ثم بايع حتى إذا كان فى آخر الناس قال صلى الله عليه وسلم \"ألا تبايع يا سلمة؟\" قال: قلت يا رسول الله قد بايعتك في أول الناس وأوسطهم قال صلى الله عليه وسلم \"وأيضا\" فبايعته الثالثة فقال رسول الله صلى الله عليه وسلم \"يا سلمة أبن حجفتك أو درقتك التي أعطيتك؟\" قال: قلت يا رسول الله لقيني عامر عزلا فأعطيتها إياه فضحك رسول الله صلى الله عليه وسلم ثم قال \"إنك كالذي قال الأول اللهم ابغني حبيبا هو أحب إلي من نفسي\" قال ثم إن المشركين من أهل مكة راسلونا في الصلح حتى مشى بعضنا في بعض فاصطلحنا قال وكنت خادما لطلحة بن عبيدالله رضي الله عنه أسقي فرسه وأجنبه وآكل من طعامه وتركت أهلي ومالي مهاجرا إلى الله ورسوله فلما اصطلحنا نحن وأهل مكة واختلط بعضنا في بعض أتيت شجرة فكشحت شوكها ثم اضطجعت في أصلها في ظلها فأتاني أربعة من مشركي أهل مكه فجعلوا يقعون فى رسول الله صلى الله عليه وسلم فأبغضتهم وتحولت إلى شجرة أخرى فعلقوا سلاحهم واضطجعوا فبينما هم كذلك إذ نادى مناد من أسفل الوادي يا للمهاجرين قتل ابن زنيم فاخترطت سيفى فشددت على أولئك الأربعة وهم رقود فأخذت سلاحهم وجعلته ضغثا في يدي ثم قلت والذي كرم وجه محمد صلى الله عليه وسلم لا يرفع أحد منكم رأسه إلا ضربت الذي فيه عيناه قال ثم جئت بهم أسوقهم إلى رسول الله صلى الله عليه وسلم قال وجاء عمي ما مر برجل من العبلات يقال له مكرز من المشركين يقوده حتى وقفنا بهم على رسول الله صلى الله عليه وسلم في سبعين من المشركين فنظر إليهم رسول الله صلى الله عليه وسلم وقال \"دعوهم يكن لهم بدء الفجور وثناؤه\" فعفا عنهم رسول الله صلى الله عليه وسلم وأنزل الله عز وجل \"وهو الذي كف أيديهم عنكم وأيديكم عنهم ببطن مكة من بعد أن أظفركم عليهم\" الآية وهكذا رواه مسلم عن إسحاق بن راهوية بسنده نحوه أو قريبا منه وثبت في الصحيحين من حديث أبي عوانة عن طارق عن سعيد بن المسيب قال: كان أبي ممن بايع رسول الله صلى الله عليه وسلم تحت الشجرة قال فانطلقنا من قابل حاجين فخفي علينا مكانها فإن كان بينت لكم فأنتم أعلم وقال أبو بكر الحميدي حدثنا سفيان حدثنا أبو الزبير حدثنا جابر رضي الله عنه قال لما دعا رسول الله الناس إلى البيعة وجدنا رجلا منا يقال له الجد بن قيس مختبئا تحت إبط بعيره رواه مسلم من حديث ابن جريج عن ابن الزبير به وقال الحميدي أيضا حدثنا سفيان عن عمرو أنه سمع جابرا رضي الله عنه قال كنا يوم الحديبية ألفا وأربعمائة فقال لنا رسول الله صلى الله عليه وسلم \"أنتم خير أهل الأرض اليوم\" قال جابر رضي الله عنه: لو كنت أبصر لأريتكم موضع الشجرة قال سفيان إنهم اختلفوا في موضعها أخرجاه من حديث سفيان وقال الإمام أحمد حدثنا يونس حدثنا الليث عن أبي الزبير عن جابر رضي الله عنه عن رسول الله صلى الله عليه وسلم أنه قال \"لا يدخل النار أحد ممن بايع تحت الشجرة\" وقال ابن أبي حاتم حدثنا محمد بن هارون الفلاس المخرمي حدثنا سعيد بن عمرو الأشعثي حدثنا محمد بن ثابت العبدي عن خداش بن عياش عن أبي الزبير عن جابر رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم \"يدخل من بايع تحت الشجرة كلهم الجنة إلا صاحب الجمل الأحمر\" قال فانطلقنا نبتدره فإذا رجل قد أضل بعيره فقلنا تعال فبايع قال أصيب بعيري أحب إلي من أن أبايع وقال عبدالله بن أحمد حدثنا عبيدالله بن معاذ حدثنا أبي حدثنا قرة عن أبي الزبير عن جابر رضي الله عنه عن النبي صلى الله عليه وسلم أنه قال \"من يصعد الثنية ثنية المرار فإنه يحط عنه ما حط عن بني إسرائيل \"فكان أول من صعد خيل بني الخزرج ثم تبادر الناس بعد فقال النبي صلى الله عليه وسلم \"كلكم مغفور له إلا صاحب الجمل الأحمر \"فقلنا تعال يستغفر لك رسول الله صلى الله عليه وسلم فقال والله لأن أجد ضالتي أحب إلي من أن يستغفر لي صاحبكم فإذا هو رجل ينشد ضالة رواه مسلم عن عبيدالله به وقال ابن جريج أخبرني أبو الزبير أنه سمع جابرا رضي الله عنه يقول أخبرتني أم مبشر أنها سمعت رسول الله صلى الله عليه وسلم يقول عند حفصة رضي الله عنها \"لا يدخل النار إن شاء الله تعالى من أصحاب الشجرة الذين بايعوا تحتها أحد\" قالت بلى يا رسول الله فانتهرها فقالت حفصة رضي الله عنها \"وإن منكم إلا واردها\" فقال النبي صلى الله عليه وسلم \"قد قال الله تعالى \"ثم ننجي الذين اتقوا ونذر الظالمين فيها جثيا\" رواه مسلم وفيه أيضا عن قتيبة عن الليث عن أبي الزبير عن جابر رضي الله عنه قال: إن عبدا لحاطب بن أبي بلتعة جاء يشكو حاطبا فقال يا رسول الله ليدخلن حاطب النار فقال رسول الله صلى الله عليه وسلم \"كذبت لا يدخلها فإنه قد شهد بدرا والحديبية\" ولهذا قال تعالى في الثناء عليهم \"إن الذين يبايعونك إنما يبايعون الله يد الله فوق أيديهم فمن نكث فإنما ينكث على نفسه ومن أوفى بما عاهد عليه الله فسيؤتيه أجرا عظيما\" كما قال عز وجل في الآية الأخرى \"لقد رضي الله عن المؤمنين إذ يبايعونك تحت الشجرة فعلم ما في قلوبهم فأنزل السكينة عليهم وأثابهم فتحا قريبا\"."
    },
    {
      "ayah": 11,
      "surah": 48,
      "text": "يقول تعالى مخبرا رسوله صلى الله عليه وسلم بما يعتذر به المخلفون من الأعراب الذين اختاروا المقام في أهليهم وشغلهم وتركوا المسير مع رسول الله صلى الله عليه وسلم فاعتذروا بشغلهم بذلك وسألوا أن يستغفر لهم الرسول صلى الله عليه وسلم وذلك قول منهم لا على سبيل الاعتقاد بل على وجه التقية والمصانعة ولهذا قال تعالى \"يقولون بألسنتهم ما ليس في قلوبهم قل فمن يملك لكم من الله شيئا إن أراد بكم ضرا أو أراد بكم نفعا\" أي لا يقدر أحدا أن يرد ما أراده الله فيكم تعالى وتقدس وهو العليم بسرائركم وضمائركم وإن صانعتمونا ونافقتمونا ولهذا قال تعالى \"بل كان الله بما تعملون خبيرا\"."
    },
    {
      "ayah": 12,
      "surah": 48,
      "text": "أي لم يكن تخلفكم تخلف معذور ولا عاص بل تخلف نفاق \"بل ظننتم أن لن ينقلب الرسول والمؤمنون إلى أهليهم أبدا\" أي اعتقدتم أنهم يقتلون وتستأصل شأفتهم وتستباد خضراؤهم ولا يرجع منهم مخبر \"وظننتم ظن السوء وكنتم قوما بورا\" أي هلكي قاله ابن عباس رضي الله عنهما ومجاهد وغير واحد وقال قتادة فاسدين وقيل هي لغة عمان."
    },
    {
      "ayah": 13,
      "surah": 48,
      "text": "أي من لم يخلص العمل في الظاهر والباطن لله فإن الله تعالى سيعذبه في السعير وإن أظهر للناس ما يعتقدون خلاف ما هو عليه في نفس الأمر."
    },
    {
      "ayah": 14,
      "surah": 48,
      "text": "ثم بين تعالى أنه الحاكم المالك المتصرف في أهل السموات والأرض \"يغفر لمن يشاء ويعذب من يشاء وكان الله غفورا رحيما\" أي لمن تاب إليه وأناب وخضع لديه."
    },
    {
      "ayah": 15,
      "surah": 48,
      "text": "يقول تعالى مخبرا عن الأعراب الذين تخلفوا عن رسول الله صلى الله عليه وسلم في عمرة الحديبية إذ ذهب النبي صلى الله عليه وسلم وأصحابه رضي الله عنهم إلى خيبر يفتحونها أنهم يسألون أن يخرجوا معهم إلى المغنم وقد تخلفوا عن وقت محاربة الأعداء ومجالدتهم ومصابرتهم فأمر الله تعالى رسوله صلى الله عليه وسلم أن لا يأذن لهم في ذلك معاقبة لهم من جنس ذنبهم فإن الله تعالى قد وعد أهل الحديبية بمغانم خيبر وحدهم لا يشاركهم فيها غيرهم من الأعراب المتخلفين فلا يقع غير ذلك شرعا ولا قدرا ولهذا قال تعالى \"يريدون أن يبدلوا كلام الله\" قال مجاهد وقتادة وجويبر وهو الوعد الذي وعد به أهل الحديبية واختاره ابن جرير وقال ابن زيد هو قوله تعالى \"فإن رجعك الله إلى طائفة منهم فاستأذنوك للخروج فقل لن تخرجوا معي أبدا ولن تقاتلوا معي عدوا إنكم رضيتم بالقعود أول مرة فاقعدوا مع الخالفين\" وهذا الذي قاله ابن زيد فيه نظر لأن هذه الآية التي في براءة نزلت في غزوة تبوك وهي متأخرة عن عمرة الحديبية وقال ابن جريج \"يريدون أن يبدلوا كلام الله\" يعني بتثبيطهم المسلمين عن الجهاد \"قل لن تتبعونا كذلكم قال الله من قبل\" أي وعد الله أهل الحديبية قبل سؤالكم الخروج معهم \"فسيقولون بل تحسدوننا\" أي أن نشرككم في المغانم \"بل كانوا لا يفقهون إلا قليلا\" أي ليس الأمر كما زعموا ولكن لا فهم لهم."
    },
    {
      "ayah": 16,
      "surah": 48,
      "text": "اختلف المفسرون في هؤلاء القوم الذين يدعون إليهم الذين هم أولو بأس شديد على أقوال \"أحدها\" أنهم هوازن رواه شعبة عن أبي بشر عن سعيد بن جبير أو عكرمة أو جميعا ورواه هشيم عن أبي بشر عنهما وبه يقول قتادة في رواية عنه \"الثاني\" ثقيف قاله الضحاك \"الثالث\" بنو حنيفة قاله جويبر ورواه محمد بن إسحاق عن الزهري وروى مثله عن سعيد وعكرمة \"الرابع\" هم أهل فارس رواه علي بن أبي طلحة عن ابن عباس رضي الله عنهما وبه يقول عطاء ومجاهد وعكرمة في إحدى الروايات عنه وقال كعب الأحبار هم الروم وعن ابن أبي ليلى وعطاء والحسن وقتادة وهم فارس والروم وعن مجاهد هم أهل الأوثان وعنه أيضا هم رجال أولو بأس شديد ولم يعين فرقة وبه يقول ابن جريج وهو اختيار ابن جرير وقال ابن أبي حاتم حدثنا الأشج حدثنا عبدالرحمن بن إسحاق القواريري عن معمر عن الزهري في قوله تعالى \"ستدعون إلى قوم أولي بأس شديد\" قال لم يأت أولئك بعد وحدثنا أبي حدثنا ابن أبي عمر حدثنا سفيان عن ابن أبي خالد عن أبيه عن أبي هريرة رضي الله عنه في قوله تعالى \"ستدعون إلى قوم أولى بأس شديد\" قال هم البارزون قال وحدثنا سفيان عن الزهري عن سعيد بن المسيب عن أبي هريرة رضي الله عنه عن النبي صلى الله عليه وسلم قال \"لا تقوم الساعة حتى تقاتلوا قوما صغار الأعين ذلف الأنوف كأن وجوههم المجان المطرقة\" قال سفيان هم الترك قال ابن أبي عمر وجدت في مكان آخر حدثنا ابن أبي خالد عن أبيه قال نزل علينا أبو هريرة رضي الله عنه ففسر قول رسول الله صلى الله عليه وسلم \"تقاتلوا قوما نعالهم الشعر\" قال هم البارزون يعني الأكراد وقوله تعالى \"تقاتلونهم أو يسلمون\" يعني شرع لكم جهادهم وقتالهم فلا يزال ذلك مستمرا عليهم ولكم النصرة عليهم أو يسلمون فيدخلون في دينكم بلا قتال بل باختيار ثم قال عز وجل \"فإن تطيعوا\" أي تستجيبوا وتنفروا في الجهاد وتؤدوا الذي عليكم فيه \"يؤتكم الله أجرا حسنا وإن تتولوا كما توليتم من قبل\" يعني زمن الحديبية حيث دعيتم فتخلفتم \"يعذبكم عذابا أليما\"."
    },
    {
      "ayah": 17,
      "surah": 48,
      "text": "ثم ذكر تعالى الأعذار في ترك الجهاد فمنها لازم كالعمي والعرج المستمر وعارض كالمرض الذي يطرأ أياما ثم يزول فهو فى حال مرضه ملحق بذوي الأعذار اللازمة حتى يبرأ ثم قال تبارك وتعالى مرغبا في الجهاد وطاعه الله ورسوله \"ومن يطع الله ورسوله يدخله جنات تجري من تحتها الأنهار ومن يتول\" أي ينكل عن الجهاد ويقبل على المعاش \"يعذبه عذابا أليما\" في الدنيا بالمذلة وفي الآخرة بالنار والله تعالى أعلم."
    },
    {
      "ayah": 18,
      "surah": 48,
      "text": "يخبر تعالى عن رضاه عن المؤمنين الذين بايعوا رسول الله صلى الله عليه وسلم تحت الشجرة وقد تقدم ذكر عدتهم وأنهم كانوا ألفا وأربعمائة وأن الشجرة كانت سمرة بأرض الحديبية قال البخاري حدثنا محمود حدثنا عبيدالله عن إسرائيل عن طارق أن عبدالرحمن رضي الله عنه قال انطلقت حاجا فمررت بقوم يصلون فقلت ما هذا المسجد؟ قالوا هذه الشجرة حيث بايع رسول الله صلى الله عليه وسلم بيعة الرضوان فأتيت سعيد بن المسيب فأخبرته فقال سعيد حدثني أبي أنه كان فيمن بايع رسول الله صلى الله عليه وسلم تحت الشجرة قال فلما خرجنا من العام المقبل نسيناها فلم نقدر عليها فقال سعيد إن أصحاب محمد صلى الله عليه وسلم لم يعلموها وعلمتموها أنتم فأنتم أعلم وقوله تعالى \"فعلم ما في قلوبهم\" أي من الصدق والوفاء والسمع والطاعة \"فأنزل السكينة\" وهي الطمأنينة \"عليهم وأثابهم فتحا قريبا\" وهو ما أجرى الله عز وجل على أيديهم من الصلح بينهم وبين أعدائهم وما حصل بذلك من الخير العام والمستمر المتصل بفتح خيبر وفتح مكة ثم فتح سائر البلاد والأقاليم عليهم وما حصل لهم من العز والنصر والرفعة في الدنيا والآخرة."
    },
    {
      "ayah": 19,
      "surah": 48,
      "text": "قال ابن أبي حاتم حدثنا أحمد بن محمد بن يحيى بن سعيد القطان حدثنا عبيدالله بن موسى يعني ابن عبيدة حدثني إياس بن سلمة عن أبيه قال بينما نحن قائلون إذ نادى منادي رسول الله صلى الله عليه وسلم أيها الناس البيعة البيعة نزل روح القدس قال فثرنا إلى رسول الله صلى الله عليه وسلم وهو تحت شجرة سمرة فبايعناه فذلك قول الله تعالى \"لقد رضي الله عن المؤمنين إذ يبايعونك تحت الشجرة\" قال فبايع رسول الله صلى الله عليه وسلم لعثمان رضي الله عنه بإحدى يديه على الأخرى فقال الناس هنيئا لابن عفان يطوف بالبيت ونحن ههنا فقال رسول الله صلى الله عليه وسلم \"لو مكث كذا وكذا سنة ما طاف حتى أطوف\"."
    },
    {
      "ayah": 2,
      "surah": 48,
      "text": "وقال الإمام أحمد حدثنا عبدالرزاق حدثنا معمر عن قتادة عن أنس بن مالك رضي الله عنه قال نزلت على النبي صلى الله عليه وسلم \"ليغفر لك الله ما تقدم من ذنبك وما تأخر\" مرجعه من الحديبية قال النبي صلى الله عليه وسلم \"لقد أنزلت علي الليلة آية أحب إلي مما على الأرض\" ثم قرأها عليهم النبي صلى الله عليه وسلم فقالوا هنيئا مريئا يا نبي الله بين الله عز وجل ما يفعل بك فماذا يفعل بنا؟ فنزلت عليه صلى الله عليه وسلم \"ليدخل المؤمنين والمؤمنات جنات تجري من تحتها الأنهار - حتى بلغ - فوزا عظيما\" أخرجاه فى الصحيحين من رواية قتادة به وقال الإمام أحمد حدثنا إسحاق بن عيسى حدثنا مجمع بن يعقوب قال سمعت أبي يحدث عن عمه عبد الرحمن بن زيد الأنصاري عن عمه مجمع بن حارثة الأنصاري رضي الله عنه وكان أحد القراء الذين قرءوا القرآن قال شهدنا الحديبية فلما أنصرفنا عنها إذا الناس ينفرون الأباعر فقال الناس بعضهم لبعض: ما للناس ؟ قالوا أوحي إلى رسول الله صلى الله عليه وسلم فخرجنا مع الناس نوجف فإذا رسول الله صلى الله عليه وسلم على راحلته عند كراع الغميم فاجتمع الناس عليه فقرأ عليهم \"إنا فتحنا لك فتحا مبينا\" قال: فقال رجل من أصحاب رسول الله صلى الله عليه وسلم أي رسول الله أو فتح هو؟ قال صلى الله عليه وسلم \"أي والذي نفس محمد بيده إنه لفتح\" فقسمت خيبر على أهل الحديبية لم يدخل معهم فيها أحد إلا من شهد الحديبية فقسمها رسول الله صلى الله عليه وسلم ثمانية عشر سهما وكان الجيش ألفا وخمسمائة منهم ثلثمائة فارس أعطى الفارس سهمين وأعطى الراجل سهما ورواه أبو داود في الجهاد عن محمد بن عيسى عن مجمع بن يعقوب به وقال ابن جرير حدثنا محمد بن عبدالله بن بزيع حدثنا أبو يحيى حدثنا شعبة حدثنا جامع بن شداد عن أبي عبدالرحمن بن أبي علقمة قال سمعت عبدالله بن مسعود رضي الله عنه يقول: لما أقبلنا من الحديبية عرسنا فنمنا فلم نستيقظ إلا والشمس قد طلعت فاستيقظنا ورسول الله صلى الله عليه وسلم نائم قال: فقلنا أيقظوه فاستيقظ رسول الله صلى الله عليه وسلم فقال \"افعلوا ما كنتم تفعلون وكذلك يفعل من نام أو نسي\" قال وفقدنا ناقة رسول الله صلى الله عليه وسلم فطلبناها فوجدناها قد تعلق خطامها بشجرة فأتيته بها فركبها فبينا نحن نسير إذ أتاه الوحي قال وكان إذا أتاه الوحي اشتد عليه فلما سري عنه أخبرنا أنه أنزل عليه \"إنا فتحنا لك فتحا مبينا\" وقد رواه أحمد وأبو داود والنسائي من غير وجه عن جامع بن شداد به وقال الإمام أحمد حدثنا عبدالرحمن حدثنا سفيان عن زياد بن علاقة قال سمعت المغيرة بن شعبة يقول: كان النبي صلى الله عليه وسلم يصلي حتى ترم قدماه فقيل له أليس قد غفر الله لك ما تقدم من ذنبك وما تأخر فقال صلى الله عليه وسلم \"أفلا أكون عبدا شكورا؟\" أخرجاه وبقية الجماعة إلا أبا داود من حديث زياد به وقال الإمام أحمد حدثنا هارون بن معروف حدثنا ابن وهب حدثني أبو صخر عن ابن قسيط عن عروة بن الزبير عن عائشة رضي الله عنها قالت كان رسول الله صلى الله عليه وسلم إذا صلى قام حتى تنفطر رجلاه فقالت له عائشة رضي الله عنها يا رسول الله أتصنع هذا وقد غفر لك الله ما تقدم من ذنبك وما تأخر؟ فقال صلى الله عليه وسلم \"يا عائشة أفلا أكون عبدا شكورا\" أخرجه مسلم في الصحيح من رواية عبدالله بن وهب به وقال ابن أبي حاتم حدثنا علي بن الحسين حدثنا عبدالله بن عون الخراز وكان ثقة بمكة حدثنا محمد بن بشر حدثنا مسعر عن قتادة عن أنس قال قام رسول الله صلى الله عليه وسلم حتى تورمت قدماه - أو قال ساقاه - فقيل له أليس قد غفر الله لك ما تقدم من ذنبك وما تأخر؟ قال \"أفلا أكون عبدا شكورا\" غريب من هذا الوجه فقوله \"إنا فتحنا لك فتحا مبينا\" أي بينا ظاهرا والمراد به صلح الحديبية فإنه حصل بسببه خير جزيل وآمن الناس واجتمع بعضهم ببعض وتكلم المؤمن مع الكافر وانتشر العلم النافع والإيمان وقوله تعالى \"ليغفر لك الله ما تقدم من ذنبك وما تأخر\" هذا من خصائصه صلى الله عليه وسلم التي لا يشاركه فيها غيره وليس في حديث صحيح في ثواب الأعمال لغيره غفر له ما تقدم من ذنبه وما تأخر وهذا فيه تشريف عظيم لرسول الله صلى الله عليه وسلم وهو صلى الله عليه وسلم في جميع أموره على الطاعة والبر والاستقامة التي لم ينلها بشر سواه لا من الأولين ولا من الآخرين وهو صلى الله عليه وسلم أكمل البشر على الإطلاق وسيدهم في الدنيا والآخرة ولما كان أطوع خلق الله تعالى وأشدهم تعظيما لأوامره ونواهيه قال حين بركت به الناقة \"حبسها حابس الفيل\" ثم قال صلى الله عليه وسلم \"والذي نفسي بيده لا يسألوني اليوم شيئا يعظمون به حرمات الله إلا أجبتهم إليها\" فلما أطاع الله في ذلك وأجاب إلى الصلح قال الله تعالى له \"إنا فتحنا لك فتحا مبينا ليغفر لك الله ما تقدم من ذنبك وما تأخر ويتم نعمته عليك\" أي في الدنيا والآخرة \"ويهديك صراطا مستقيما\" أي بما يشرعه لك من الشرع العظيم والدين القويم."
    },
    {
      "ayah": 20,
      "surah": 48,
      "text": "قال مجاهد في قوله تعالى \"وعدكم الله مغانم كثيرة تأخذونها\" هي جميع المغانم إلى اليوم \"فعجل لكم هذه\" يعني فتح خيبر وروى العوفي عن ابن عباس رضي الله عنهما \"فعجل لكم هذه\" يعني صلح الحديبية \"وكف أيدي الناس عنكم\" أي لم ينلكم سوء مما كان أعداؤكم أضمروه لكم من المحاربة والقتال وكذلك كف أيدي الناس عنكم الذين خلفتموهم وراء ظهوركم عن عيالكم وحريمكم \"ولتكون آية للمؤمنين\" أي يعتبرون بذلك فإن الله تعالى حافظهم وناصرهم على سائر الأعداء مع قلة عددهم وليعلموا بصنيع الله هذا بهم أنه العالم بعواقب الأمور وأن الخيرة فيما يختاره لعباده المؤمنين وإن كرهوه في الظاهر كما قال عز وجل \"وعسى أن تكرهوا شيئا وهو خير لكم\" \"ويهديكم صراطا مستقيما\" أي بسبب انقيادكم لأمره واتباعكم طاعته وموافقتكم رسوله صلى الله عليه وسلم."
    },
    {
      "ayah": 21,
      "surah": 48,
      "text": "أي وغنيمة أخرى وفتحا آخر معينا لم تكونوا تقدرون عليها قد يسرها الله عليكم وأحاط بها لكم فإنه تعالى يرزق عباده المتقين له من حيث لا يحتسبون وقد اختلف المفسرون في هذه الغنيمة ما المراد بها فقال العوفي عن ابن عباس رضي الله عنهما هي خيبر وهذا على قوله في قوله عز وجل \"فعجل لكم هذه\" إنها صلح الحديبية وقاله الضحاك وابن إسحاق وعبدالرحمن بن زيد بن أسلم وقال قتادة هي مكة واختاره ابن جرير وقال ابن أبي ليلى والحسن البصري هي فارس والروم وقال مجاهد هي كل فتح وغنيمة إلى يوم القيامة وقال أبو داود الطيالسي حدثنا شعبة عن سماك الحنفي عن ابن عباس رضي الله عنهما \"وأخرى لم تقدروا عليها قد أحاط الله بها\" قال هذه الفتوح التي تفتح إلى اليوم."
    },
    {
      "ayah": 22,
      "surah": 48,
      "text": "يقول عز وجل مبشرا لعباده المؤمنين بأنه لو ناجزهم المشركون لنصر الله رسوله وعباده المؤمنين عليهم ولا نهزم جيش الكفر فارا مدبرا لا يجدون وليا ولا نصيرا لأنهم محاربون لله ولرسوله ولحزبه المؤمنين."
    },
    {
      "ayah": 23,
      "surah": 48,
      "text": "ثم قال تبارك وتعالى \"سنة الله التي قد خلت من قبل ولن تجد لسنة الله تبديلا\" أي هذه سنة الله وعادته في خلقه ما تقابل الكفر والإيمان في موطن فيصل إلا نصر الله الإيمان على الكفر فرفع الحق ووضع الباطل كما فعل تعالى يوم بدر بأوليائه المؤمنين نصرهم على أعدائه من المشركين مع قله عدد المسلمين وعددهم وكثرة المشركين وعددهم."
    },
    {
      "ayah": 24,
      "surah": 48,
      "text": "هذا امتنان من الله تعالى على عباده المؤمنين حين كف أيدي المشركين عنهم فلم يصل إليهم منهم سوء وكف أيدي المؤمنين عن المشركين فلم يقاتلوهم عند المسجد الحرام بل صان كلا من الفريقين وأوجد بينهم صلحا فيه خيرة للمؤمنين وعاقبة لهم في الدنيا والآخرة وقد تقدم في حديث سلمة بن الأكوع رضي الله عنه حين جاءوا بأولئك السبعين الأسارى فأوثقوهم بين يدي رسول الله صلى الله عليه وسلم فنظر إليهم فقال \"أرسلوهم يكن لهم بدء الفجور وثناؤه\" فال وفي ذلك أنزل الله عز وجل \"وهو الذي كف أيديهم عنكم وأيديكم عنهم\" الآية وقال الإمام أحمد حدثنا يزيد بن هارون حدثنا حماد عن ثابت عن أنس بن مالك رضي الله عنه قال لما كان يوم الحديبية هبط على رسول الله صلى الله عليه وسلم وأصحابه ثمانون رجلا من أهل مكة بالسلاح من قبل جبل التنعيم يريدون غرة رسول الله صلى الله عليه وسلم فدعا عليهم فأخذوا قال عفان فعفا عنهم ونزلت هذه الآية \"وهو الذي كف أيديهم عنكم وأيديكم عنهم ببطن مكة من بعد أن أظفركم عليهم\" ورواه مسلم وأبو داود في سننه والترمذي والنسائي في التفسير من سننيهما من طرق عن حماد بن سلمة به وقال أحمد أيضا حدثنا زيد بن الحباب حدثنا الحسين بن واقد حدثنا ثابت البناني عن عبدالله بن مغفل المزنى رضي الله عنه قال كنا مع رسول الله صلى الله عليه وسلم في أصل الشجرة التي قال تعالى في القرآن وكان يقع من أغصان تلك الشجرة على ظهر رسول الله صلى الله عليه وسلم وعلي بن أبي طالب رضي الله عنه وسهيل ابن عمرو بين يديه فقال رسول الله صلى الله عليه وسلم لعلي رضي الله عنه \"اكتب بسم الله الرحمن الرحيم\": فأخد سهيل بيده وقال ما نعرف الرحمن الرحيم: اكتب في قضيتنا ما نعرف فقال: \"اكتب باسمك اللهم - وكتب: هذا ما صالح عليه محمد رسول الله أهل مكة \"فأمسك سهيل بن عمرو بيده وقال لقد ظلمناك إن كنت رسوله اكتب في قضيتنا ما نعرف فقال: \"اكتب هذا ما صالح عليه محمد بن عبدالله\" فبينا نحن كذلك إذ خرج علينا ثلاثون شابا عليهم السلاح فثاروا في وجوهنا فدعا عليهم رسول الله صلى الله عليه وسلم فأخذ الله تعالى بأسماعهم فقمنا إليهم فأخذناهم فقال رسول الله صلى الله عليه وسلم: \"هل جئتم في عهد أحد؟ أو هل جعل لكم أحد أمانا\"؟ فقالوا لا فخلى سبيلهم فأنزل الله تعالى \"وهو الذي كف أيديهم عنكم وأيديكم عنهم ببطن مكة من بعد أن أظفركم عليهم\" الآية رواه النسائي من حديث حسين بن واقد به وقال ابن جرير حدثنا ابن حميد حدثنا يعقوب العمي حدثنا جعفر عن ابن أبزى قال لما خرج النبي صلى الله عليه وسلم بالهدي وانتهى إلى ذي الحليفة قال له عمر رضي الله عنه يا نبي الله تدخل على قوم لك حرب بغير سلاح ولا كراع؟ قال فبعث صلى الله عليه وسلم إلى المدينة فلم يدع فيها كراعا ولا سلاحا إلا حمله فلما دنا من مكة منعوه أن يدخل فسار حتى أتى مني فنزل بمنى فأتاه عينه أن عكرمة بن أبي جهل قد خرج عليك في خمسمائة فقال لخالد بن الوليد رضي الله عنه \"يا خالد هذا ابن عمك قد أتاك في الخيل\" فقال خالد رضي الله عنه أنا سيف الله وسيف رسوله فيومئذ سمي سيف الله فقال يا رسول الله ابعثني أين شئت فبعثه على خيل فلقي عكرمة في الشعب فهزمه حتى أدخله حيطان مكة ثم عاد في الثانية فهزمه حتى أدخله حيطان مكة ثم عاد في الثالثة فهزمه حتى أدخله حيطان مكة فأنزل الله تعالى \"وهو الذي كف أيديهم عنكم وأيديكم عنهم ببطن مكة - إلى قوله تعالى - عذابا أليما\" قال فكف الله عز وجل النبي صلى الله عليه وسلم عنهم من بعد أن أظفره عليهم لبقايا من المسلمين كانوا أبقوا فيها كراهية أن تطأهم الخيل ورواه ابن أبي حاتم عن ابن أبزى بنحوه وهذا السياق فيه نظر فإنه لا يجوز أن يكون عام الحديبية لأن خالدا رضي الله عنه لم يكن أسلم بل قد كان طليعة للمشركين يومئذ كما ثبت في الصحيح ولا يجوز أن يكون في عمرة القضاء لأنهم قاضوه على أن يأتي في العام القابل فيعتمر ويقيم بمكة ثلاثه أيام ولما قدم صلى الله عليه وسلم لم يمانعوه ولا حاربوه ولا قاتلوه فإن قيل فيكون يوم الفتح فالجواب ولا يجوز أن يكون يوم الفتح لأنه لم يسق عام الفتح هديا وإنما جاء محاربا مقاتلا في جيش عرمرم فهذا السياق فيه خلل وقد وقع فيه شيء فليتأمل والله أعلم وقال ابن إسحاق: حدثني من لا أتهم عن عكرمة مولى ابن عباس رضي الله عنه قال إن قريشا بعثوا أربعين رجلا منهم أو خمسين وأمروهم أن يطيفوا بعسكر رسول الله صلى الله عليه وسلم ليصيبوا من أصحابه أحدا فأخذوا أخذا فأتي بهم رسول الله صلى الله عليه وسلم فعفا عنهم وخلى سبيلهم وقد كانوا رموا إلى عسكر رسول الله صلى الله عليه وسلم بالحجارة والنبل قال ابن إسحاق وفي ذلك أنزل الله تعالى \"وهو الذي كف أيديهم عنكم وأيديكم عنهم\" الآية وقال قتادة ذكر لنا أن رجلا يقال له ابن زنيم اطلع على الثنية من الحديبية فرماه المشركون بسهم فقتلوه فبعث رسول الله صلى الله عليه وسلم خيلا فأتوه باثني عشر من الكفار فقال لهم \"هل لكم علي عهد؟ هل لكم علي ذمة؟ \"قالوا لا فأرسلهم وأنزل الله تعالى فى ذلك \"وهو الذي كف أيديهم عنكم وأيديكم عنهم\" الآية."
    },
    {
      "ayah": 25,
      "surah": 48,
      "text": "يقول تعالى مخبرا عن الكفار من مشركي العرب من قريش ومن مالأهم على نصرتهم على رسول الله صلى الله عليه وسلم \"هم الذين كفروا\" أي هم الكفار دون غيرهم \"وصدوكم عن المسجد الحرام\" أي وأنتم أحق به وأنتم أهله في نفس الأمر \"والهدي معكوفا أن يبلغ محله\" أي وصدوا الهدي أن يصل إلى محله وهذا من بغيهم وعنادهم وكان الهدي سبعين بدنة كما سيأتي إن شاء الله تعالى وقوله عز وجل \"ولولا رجال مؤمنون ونساء مؤمنات\" أي بين أظهرهم ممن يكتم إيمانه ويخفيه منهم خيفة على أنفسهم من قومهم لكنا سلطانكم عليهم فقتلتموهم وأبدتم خضراءهم ولكن بين أفنائهم من المؤمنين والمؤمنات أقوام لا تعرفونهم حالة القتل ولهذا قال تعالى \"لم تعلموهم أن تطؤهم فتصيبكم منهم معرة\" أي إثم وغرامة \"بغير علم ليدخل الله في رحمته من يشاء\" أي يؤخر عقوبتهم ليخلص من بين أظهرهم المؤمنين وليرجع كثير منهم إلى الإسلام ثم قال تبارك وتعالى \"لو تزيلوا\" أي لو تميز الكفار من المؤمنين الذين بين أظهرهم \"لعذبنا الذين كفروا منهم عذابا أليما\" أي لسلطناكم عليهم فلقتلتموهم قتلا ذريعا قال الحافظ أبو القاسم الطبراني حدثنا أبو الزنباع روح بن الفرج حدثنا عبدالرحمن بن أبي عباد المكي حدثنا عبدالرحمن بن عبدالله بن سعد مولى بني هاشم حدثنا حجر بن خلف قال سمعت عبدالله بن عمرو يقول سمعت جنيد بن سبيع يقول قاتلت رسول الله صلى الله عليه وسلم أول النهار كافرا وقاتلت معه آخر النهار مسلما وفينا نزلت \"ولولا رجال مؤمنون ونساء مؤمنات\" قال كنا تسعة نفر سبعة رجال وامرأتين ثم رواه من طريق أخرى عن محمد بن عباد المكي به وقال فيه عن أبي جمعة جنيد بن سبيع فذكره والصواب أبو جعفر حبيب بن سباع ورواه ابن أبي حاتم من حديث حجر بن خلف به وقال كنا ثلاثة رجال وتسع نسوة وفينا نزلت \"ولولا رجال مؤمنون ونساء مؤمنات\" وقال ابن أبي حاتم حدثنا علي بن الحسين حدثنا محمد بن إسماعيل البخاري حدثنا عبدالله بن عثمان بن جبلة عن أبي حمزة عن عطاء عن سعيد بن جبير عن ابن عباس رضي الله عنهما في قوله تعالى \"لو تزيلوا لعذبنا الذين كفروا منهم عذابا أليما\" يقول لو تزيل الكفار من المؤمنين لعذبهم الله عذابا أليما بقتلهم إياهم."
    },
    {
      "ayah": 26,
      "surah": 48,
      "text": "\"إذ جعل الذين كفروا في قلوبهم الحمية حمية الجاهلية\" وذلك حين أبوا أن يكتبوا بسم الله الرحمن الرحيم وأبوا أن يكتبوا هذا ما قاضى عليه محمد رسول الله \"فأنزل الله سكينته على رسوله وعلى المؤمنين وألزمهم كلمة التقوى\" وهي قول لا إله إلا الله كما قال ابن جرير وعبدالله بن الإمام أحمد حدثنا الحسن بن قزعة أبو علي البصري حدثنا سفيان بن حبيب حدثنا شعبة عن ثور عن أبيه عن الطفيل يعني ابن أبي بن كعب عن أبيه رضي الله عنه أنه سمع رسول الله صلى الله عليه وسلم يقول \"ألزمهم كلمه التقوى\" - قال - لا إله إلا الله\" وكذا رواه الترمذي عن الحسن بن قزعة وقال غريب لا نعرفه إلا من حديثه وسألت أبا زرعة عنه فلم يعرفه إلا من هذا الوجه وقال ابن أبي حاتم حدثنا أحمد بن منصور الرمادي حدثنا عبدالله بن صالح حدثني الليث حدثني عبدالرحمن بن خالد عن ابن شهاب عن سعيد بن المسيب أن أبا هريرة رضي الله عنه أخبره أن رسول الله صلى الله عليه وسلم قال \"أمرت أن أقاتل الناس حتى يقولوا لا إله إلا الله فمن قال لا إله إلا الله فقد عصم مني ماله ونفسه إلا بحقه وحسابه على الله عز وجل\" وأنزل الله عز وجل في كتابه وذكر قوما فقال \"إنهم كانوا إذا قيل لهم لا إله إلا الله يستكبرون\" وقال جل ثناؤه \"وألزمهم كلمة التقوى وكانوا أحق بها وأهلها\" وهي لا إله إلا الله محمد رسول الله فاستكبروا عنها واستكبر عنها المشركون يوم الحديبية فكاتبهم رسول الله صلى الله عليه وسلم على قضية المدة وكذا رواه بهذه الزيادات ابن جرير من حديث الزهري والظاهر أنها مدرجة من كلام الزهري والله أعلم وقال مجاهد كلمة التقوى الإخلاص وقال عطاء بن أبي رباح هي لا إله إلا الله حده لا شريك له له الملك وله الحمد وهو على كل شيء قدير وقال يونس بن بكير عن ابن إسحاق عن الزهري عن عروة عن المسور \"وألزمهم كلمة التقوى\" قال لا إله إلا الله وحده لا شريك له وقال الثوري عن سلمة بن كهيل عن عباية بن ربعي عن علي رضي الله عنه \"وألزمهم كلمة التقوى\" قال لا إله إلا الله والله أكبر وكذا قال ابن عمر رضي الله عنهما وقال علي بن أبي طلحة عن ابن عباس رضي الله عنهما قوله تعالى \"وألزمهم كلمة التقوى\" قال يقول شهادة أن لا إله إلا الله وهي رأس كل تقوى وقال سعيد بن جبير \"وألزمهم كلمة التقوى\" قال لا إله إلا الله والجهاد في سبيله وقال عطاء الخراساني هي لا إله إلا الله محمد رسول الله وقال عبدالله بن المبارك عن معمر عن الزهري \"وألزمهم كلمة التقوى\" قال بسم الله الرحمن الرحيم وقال قتادة \"وألزمهم كلمة التقوى\" قال لا إله إلا الله \"وكانوا أحق بها وأهلها\" كان المسلمون أحق بها وكانوا أهلها \"وكان الله بكل شيء عليما\" أي هو عليم بمن يستحق الخير ممن يستحق الشر وقد قال النسائي حدثنا إبراهيم بن سعيد حدثنا شبابة بن سوار عن أبي رزين عن عبدالله بن العلاء بن زبر عن بشر بن عبيدالله عن أبي إدريس عن أبي بن كعب رضي الله عنه أنه كان يقرأ \"إذ جعل الذين كفروا في قلوبهم الحمية حمية الجاهلية ولو حميتم كما حموا لفسد المسجد الحرام\" فبلغ ذلك عمر رضي الله عنه فأغلظ له فقال إنك لتعلم أني كنت أدخل على رسول الله صلى الله عليه وسلم فيعلمني مما علمه الله تعالى فقال عمر رضي الله عنه بل أنت رجل عندك علم وقرآن فاقرا وعلم مما علمك الله تعالى ورسوله \"وهذا ذكر الأحاديث الواردة في قصة الحديبية وقصة الصلح \" قال الإمام أحمد حدثنا يزيد بن هارون أخبرنا محمد بن إسحاق بن يسار عن الزهري عن عروة بن الزبير عن المسور بن مخرمة ومروان بن الحكم رضي الله عنهما قال: خرج رسول الله صلى الله عليه وسلم يريد زيارة البيت لا يريد قتالا وساق معه الهدي سبعين بدنة وكان الناس سبعمائة رجل فكانت كل بدنة عن عشرة وخرج رسول الله صلى الله عليه وسلم حتى إذا كان بعسفان لقيه بشر بن سفيان الكعبي فقال يا رسول الله هذه قريش قد سمعت بمسيرك فخرجت معها العوذ المطافيل قد لبست جلود النمور يعاهدون الله تعالى أن لا تدخلها عليهم عنوة أبدا وهذا خالد بن الوليد في خيلهم قد قدموه إلى كراع الغميم فقال رسول الله صلى الله عليه وسلم \"يا ويح قريش قد أكلتهم الحرب ماذا عليهم لو خلوا بيني وبين سائر الناس؟ فإن أصابوني كان الذي أرادوا وإن أظهرني الله تعالى دخلوا في الإسلام وهم وافرون وإن لم يفعلوا قاتلوا وبهم قوه فماذا تظن قريش فوالله لا أزال أجاهدهم على الذي بعثني الله تعالى به حتى يظهرني الله عز وجل أو تنفرد هذه السالفة\" ثم أمر الناس فسلكوا ذات اليمين بين ظهري الحمض على طريق تخرجه على ثنيه المرار والحديبية من أسفل مكة قال فسلك بالجيش تلك الطريق فلما رأت خيل قريش قترة الجيش قد خالفوا عن طريقهم ركضوا راجعين إلى قريش فخرج رسول الله حتى إذا سلك ثنية المرار بركت ناقته فقال الناس خلأت فقال رسول الله صلى الله عليه وسلم \"ما خلأت وما ذلك لها بخلق ولكن حبسها حابس الفيل عن مكة والله لا تدعوني قريش اليوم إلى خطة يسألوني فيها صلة الرحم إلا أعطيتهم إياها\" ثم قال صلى الله عليه وسلم للناس \"انزلوا\" قالوا يا رسول الله ما بالوادي من ماء ينزل عليه الناس فأخرج رسول الله سهما من كنانته فأعطاه رجلا من أصحابه فنزل في قليب من تلك القلب فغرزه فيه فجاش بالماء حتى ضرب الناس عنه بعطن فلما اطمأن رسول الله إذا بديل بن ورقاء في رجال من خزاعة فقال لهم كقوله لبشر بن سفيان فرجعوا إلى قريش فقالوا: يا معشر قريش إنكم تعجلون على محمد صلى الله عليه وسلم إن محمدا لم يأت لقتال إنما جاء زائرا لهذا البيت معظما لحقه فاتهموهم قال محمد بن إسحاق قال الزهري وكانت خزاعة عيبة نصح رسول الله صلى الله عليه وسلم مشركها ومسلمها لا يخفون على رسول الله صلى الله عليه وسلم شيئا كان بمكة فقالوا وإن كان إنما جاء لذلك فوالله لا يدخلها أبدا علينا عنوة ولا يتحدث بذلك العرب ثم بعثوا إليه مكرز بن حفص أحد بني عامر بن لؤي فلما رآه رسول الله صلى الله عليه وسلم قال \"هذا رجل غادر\" فلما انتهى إلى رسول الله صلى الله عليه وسلم كلمه رسول الله صلى الله عليه وسلم بنحو مما تكلم به مع أصحابه ثم رجع إلى قريش فأخبرهم بما قال له رسول الله صلى الله عليه وسلم فبعثوا إليه الحليس بن علقمة الكناني وهو يومئذ سيد الأحابيش فلما رآه رسول الله صلى الله عليه وسلم قال \"هذا من قوم يتألهون فابعثوا الهدي\" فلما رأى الهدي يسيل عليه من عرض الوادي في قلائده قد أكل أو باره من طول الحبس عن محله رجع ولم يصل إلى رسول الله صلى الله عليه وسلم إعظاما لما رأى فقال يا معشر قريش لقد رأيت مالا يحل صد الهدي في قلائده قد أكل أوباره من طول الحبس عن محله قالوا اجلس إنما أنت أعرابي لا علم لك فبعثوا إليه عروة بن مسعود الثقفي فقال يا معشر قريش إنى قد رأيت ما يلقى منكم من تبعثون إلى محمد إذا جاءكم من التعنيف وسوء اللفظ وقد عرفتم أنكم إلى والد وأنا ولد وقد سمعت بالذي نابكم فجمعت من أطاعني من قومي ثم جئت حتى آسيتكم بنفسي قالوا صدقت ما أنت عندنا بمتهم فخرج حتى أتي رسول الله صلى الله عليه وسلم فجلس بين يديه فقال يا محمد جمعت أوباش الناس ثم جئت بهم لبيضتك لنقضها إنها قريش قد خرجت معها العوذ المطافيل قد لبسوا جلود النمور يعاهدون الله تعالى أن لا تدخلها عليهم عنوة أبدا وايم الله لكأني بهؤلاء قد انكشفوا عنك غدا قال وأبو بكر رضي الله عنه قاعد خلف رسول الله صلى الله عليه وسلم فقال امصص بظر اللات أنحن ننكشف عنه؟ قال من هذا يا محمد؟ قال صلى الله عليه وسلم \"هذا ابن أبي قحافة\" قال أما والله لولا يد كانت لك عندي لكافأتك بها ولكن هذه بها ثم تناول لحية رسول الله صلى الله عليه وسلم والمغيرة بن شعبة رضي الله عنه واقف على رأس رسول الله صلى الله عليه وسلم بالحديد قال فقرع يده ثم قال أمسك يدك عن لحية رسول الله صلى الله عليه وسلم قبل والله أن لا تصل إليك قال ويحك ما أفظك وأغلظك فتبسم رسول الله صلى الله عليه وسلم قال من هذا يا محمد؟ قال صلى الله عليه وسلم \"هذا ابن أخيك المغيرة بن شعبة\" قال أغدر وهل غسلت سوأتك إلا بالأمس؟ قال فكلمه رسول الله صلى الله عليه وسلم بمثل ما كلم به أصحابه وأخبره أنه لم يأت يريد حربا قال فقام من عند رسول الله صلى الله عليه وسلم وقد رأى ما يصنع به أصحابه لا يتوضأ وضوءا إلا ابتدروه ولا يبصق بصاقا إلا ابتدروه ولا يسقط من شعره شيء إلا أخذوه فرجع إلى قريش فقال يا معشر قريش إنى جئت كسرى في ملكه وجئت قيصر والنجاشي في ملكهما والله ما رأيت ملكا قط مثل محمد صلى الله عليه وسلم في أصحابه ولقد رأيت قوما لا يسلمونه لشيء أبدا فروا رأيكم قال وقد كان رسول الله صلى الله عليه وسلم قبل ذلك بعث خراش بن أمية الخزاعي إلى مكة وحمله على جمل له يقال له الثعلب فلما دخل مكة عقرت به قريش وأرادوا قتل خراش فمنعتهم الأحابيش حتى أتى رسول الله صلى الله عليه وسلم فدعا عمر رضي الله عنه ليبعثه إلى مكة فقال يا رسول الله إنى أخاف قريشا على نفسي وليس بها من بني عدي أحد يمنعني وقد عرفت قريش عداوتي إياها وغلظتي عليها ولكن أدلك على رجل هو أعز مني بها عثمان بن عفان رضي الله عنه قال فدعاه رسول الله صلى الله عليه وسلم فبعثه يخبرهم أنه لم يأت لحرب أحد وإنما جاء زائرا لهذا البيت معظما لحرمته فخرج عثمان رضي الله عنه حتى أتى مكة فلقيه أبان بن سعيد بن العاص فنزل عن دابته وحمله بين يديه أردفه خلفه وأجاره حتى بلغ رسالة رسول الله صلى الله عليه وسلم فانطلق عثمان رضي الله عنه حتى أتى أبا سفيان وعظماء قريش فبلغهم عن رسول الله صلى الله عليه وسلم ما أرسله به فقالوا لعثمان رضي الله عنه إن شئت أن تطوف بالبيت فطف به فقال ما كنت لأفعل حتى يطوف به رسول الله صلى الله عليه وسلم قال واحتبسته قريش عندها قال وبلغ رسول الله صلى الله عليه وسلم أن عثمان رضي الله عنه قد قتل قال محمد فحدثني الزهري أن قريشا بعثوا سهيل بن عمرو وقالوا ائت محمدا فصالحه ولا تلن في صلحه إلا أن يرجع عنا عامه هذا فوالله لا تحدث العرب أنه دخلها علينا عنوة أبدا فأتاه سهيل بن عمرو فلما رآه رسول الله صلى الله عليه وسلم قال \"قد أراد القوم الصلح حين بعثوا هذا الرجل \"فلما انتهى إلى رسول الله صلى الله عليه وسلم تكلما وأطالا الكلام وتراجعا حتى جرى بينهما الصلح فلما التأم الأمر ولم يبق إلا الكتاب وثب عمر بن الخطاب رضي الله عنه فأتى أبا بكر رضي الله عنه فقال يا أبا بكر أو ليس برسول الله؟ أو لسنا بالمسلمين؟ أو ليسوا بالمشركين؟ قال بلى قال فعلام نعطي الدنية في ديننا؟ فقال أبو بكر رضي الله عنه الزم غرزه حيث كان فإني أشهد أنه رسول الله فقال عمر رضي الله عنه وأنا أشهد ثم أتى رسول الله صلى الله عليه وسلم فقال يا رسول الله أولسنا بالمسلمين؟ أو ليسوا بالمشركين؟ قال صلى الله عليه وسلم \"بلى\" قال فعلام نعطي الدنية في ديننا؟ فقال صلى الله عليه وسلم \"أنا عبدالله ورسوله لن أخالف أمره ولن يضيعني\" ثم قال عمر رضي الله عنه ما زلت أصوم وأصلي وأتصدق وأعتق من الذي صنعت مخافة كلامي الذي تكلمت به يومئذ حتى رجوت أن يكون خيرا قال ثم دعا رسول الله صلى الله عليه وسلم علي بن أبي طالب رضي الله عنه فقال اكتب \"بسم الله الرحمن الرحيم\" فقال سهيل لا أعرف هذا ولكن اكتب باسمك اللهم فقال رسول الله صلى الله عليه وسلم \"أكتب باسمك اللهم هذا ما صالح عليه محمد رسول الله\" فقال سهيل بن عمرو لو شهدت أنك رسول الله لم أقاتلك ولكن اكتب هذا ما صالح عليه محمد بن عبدالله وسهيل بن عمرو على وضع الحرب عشر سنين يأمن فيها الناس ويكف بعضهم عن بعض على أنه من أتى رسول الله صلى الله عليه وسلم من أصحابه بغير إذن وليه رده عليه ومن أتى قريشا ممن مع رسول الله صلى الله عليه وسلم لم يردوه عليه وأن بيننا عيبة مكفوفة وأنه لا أسلال ولا أغلال وكان في شرطهم حين كتبوا الكتاب: أنه من أحب أن يدخل في عقد محمد صلى الله عليه وسلم وعهده دخل فيه ومن أحب أن يدخل في عقد قريش وعهدهم دخل فيه فتواثبت خزاعة فقالوا نحن في عقد رسول الله صلى الله عليه وسلم وعهده وتواثبت بنو بكر فقالوا نحن فى عقد قريش وعهدهم وأنك ترجع عنا عامنا هذا فلا تدخل علينا مكة وأنه إذا كان عام قابل خرجنا عنك فتدخلها بأصحابك وأقمت بها ثلاثا معك سلاح الراكب لا تدخلها بغير السيوف في القرب فبينا رسول الله صلى الله عليه وسلم يكتب الكتاب إذ جاءه أبو جندل بن سهيل بن عمرو فى الحديد قد انفلت إلى رسول الله صلى الله عليه وسلم قال وقد كان أصحاب رسول الله صلى الله عليه وسلم خرجوا وهم لا يشكون في الفتح لرؤيا رآها رسول الله صلى الله عليه وسلم فلما رأوا ما رأوا من الصلح والرجوع وما تحمل رسول الله صلى الله عليه وسلم على نفسه دخل الناس من ذلك أمر عظيم حتى كادوا أن يهلكوا فلما رأى سهيل أبا جندل قام إليه فضرب وجهه وقال يا محمد قد تمت القضية بيني وبينك قبل أن يأتيك هذا قال \"صدقت\" فقام إليه فأخذ بتلابيبه قال وصرخ أبو جندل بأعلى صوته يا معشر المسلمين أتردونني إلى أهل الشرك فيفتنوني في ديني؟ قال فزاد الناس شرا إلى ما بهم فقال رسول الله صلى الله عليه وسلم \"يا أبا جندل اصبر واحتسب فإن الله تعالى جاعل لك ولمن معك من المستضعفين فرجا ومخرجا إنا قد عقدنا بيننا وبين القوم صلحا فأعطيناهم على ذلك وأعطونا عليه عهدا وإنا لن نغدر بهم \"قال فوثب إليه عمر بن الخطاب رضي الله عنه فجعل يمشي مع أبي جندل إلى جنبه ويقول اصبر أبا جندل فإنما هم المشركون وإنما دم أحدهم دم كلب قال ويدني قائم السيف منه قال يقول رجوت أن يأخذ السيف فيضرب به أباه قال فضن الرجل بأبيه قال ونفذت القضية فلما فرغا من الكتاب وكان رسول الله صلى الله عليه وسلم يصلي في الحرم وهو مضطرب في الحل قال فقام رسول الله صلى الله عليه وسلم فقال \"يأيها الناس انحروا واحلقوا\" قال فما قام أحد قال ثم عاد صلى الله عليه وسلم بمثلها فما قام رجل ثم عاد صلى الله عليه وسلم بمثلها فما قام رجل فرجع رسول الله صلى الله عليه وسلم فدخل على أم سلمة رضي الله عنها فقال \"يا أم سلمة ما شأن الناس؟ \"قالت يا رسول الله قد دخلهم ما رأيت فلا تكلمن منهم إنسانا واعمد إلى هديك حيث كان فانحره واحلق فلو قد فعلت ذلك فعل الناس ذلك فخرج رسول الله صلى الله عليه وسلم لا يكلم أحدا حتى إذا أتى هديه فنحره ثم جلس فحلق قال فقام الناس ينحرون ويحلقون حتى إذا كان بين مكة والمدينة في وسط الطريق نزلت سورة الفتح هكذا ساقه أحمد من هذا الوجه وهكذا رواه يونس بن بكير وزياد البكائي عن أبي إسحاق بنحوه وقد رواه أيضا عن عبدالرزاق عن معمر عن الزهري به نحوه وخالفه فى أشياء وفيه إغراب وقد رواه البخاري رحمه الله في صحيحه فساقه سياقة حسنة مطولة بزيادات جيدة فقال في كتاب الشروط من صحيحه حدثنا عبدالله بن محمد حدثنا عبدالرزاق أنا معمر أخبرني الزهري أخبرني عروة بن الزبير عن المسور بن مخرمة ومروان بن الحكم يصدق كل واحد منهما حديث صاحبه قالا: خرج رسول الله صلى الله عليه وسلم زمن الحديبية فى بضع عشرة مائة من أصحابه فلما أتى ذا الحليفة قلد الهدي وأشعره وأحرم منها بعمرة وبعث عينا من خزاعة وسار حتى إذا كان بغير الأشطاط أتاه عينه فقال إن قريشا قد جمعوا لك جموعا وقد جمعوا لك الأحابيش وهم مقاتلوك وصادوك ومانعوك فقال صلى الله عليه وسلم \"أشيروا أيها الناس علي أترون أن نميل على عيالهم وذراري هؤلاء الذين يريدون أن يصدونا عن البيت\" وفي لفظ \"ترون أن نميل على ذراري هؤلاء الذين أعانوهم فان يأتونا كان الله قد قطع عنقا من المشركين وإلا تركناهم محزونين\" وفي لفظ \"فإن قعدوا قعدوا موتورين مجهودين محزونين وإن نجو يكن عنقا قطعها الله عز وجل أم ترون أن نؤم البيت فمن صدنا عنه قاتلناه\" فقال أبو بكر رضي الله عنه يا رسول الله خرجت عامدا لهذا البيت لا تريد قتل أحد ولا حربا فتوجه له فمن صدنا عنه قاتلناه وفي لفظ فقال أبو بكر رضي الله عنه الله ورسوله علم إنما جئنا معتمرين ولم نجيء لقتال أحد ولكن من حال بيننا وبين البيت قاتلناه فقال النبي صلى الله عليه وسلم \"فروحوا إذن\" وفي لفظ \"فامضوا على اسم الله تعالى\" حتى إذا كانوا ببعض الطريق قال النبي صلى الله عليه وسلم إن خالد بن الوليد في خيل لقريش طليعة فخذوا ذات اليمين فوالله ما شعر بهم خالد حتى إذا هم بقترة الجيش فانطلق يركض نذيرا لقريش وسار النبي صلى الله عليه وسلم حتى إذا كان بالثنية التي يهبط عليهم منها بركت به راحلته فقال الناس حل حل فألحت فقالوا خلأت القصواء خلأت القصواء فقال النبي صلى الله عليه وسلم \"ما خلأت القصواء وما ذاك لها بخلق ولكن حبسها حابس الفيل - ثم قال صلى الله عليه وسلم - والذي نفسي بيده لا يسألوني خطة يعظمون فيها حرمات الله تعالى إلا أعطيتهم إياها\" ثم زجرها فوثبت فعدل عنهم حتى نزل بأقصى الحديبية على ثمد قليل الماء يتبرضه الناس تبرضا فلم يلبث الناس حتى نزحوه وشكي إلى رسول الله صلى الله عليه وسلم العطش فانتزع صلى الله عليه وسلم من كنانته سهما ثم أمرهم أن يجعلوه فيه فوالله ما زال يجيش لهم بالري حتى صدروا عنه فبينما هم كذلك إذ جاء بديل بن ورقاء الخزاعي في نفر من قومه من خزاعة وكانوا عيبة نصح رسول الله صلى الله عليه وسلم من أهل تهامة فقال إني تركت كعب بن لؤي وعامر بن لؤي نزلوا عدا مياه الحديبية معهم العوذ المطافيل وهم مقاتلوك وصادوك عن البيت فقال النبي صلى الله عليه وسلم \"إنا لم نجيء لقتال أحد ولكن جئنا معتمرين وإن قريشا قد نهكتهم الحرب فأضرت بهم فإن شاءوا ماددتهم مدة ويخلوا بيني وبين الناس فإن أظهر فإن شاءوا أن يدخلوا فيما دخل فيه الناس فعلوا وإلا فقد حموا وإن هم أبوا فوالذي نفسي بيده لأقاتلنهم على أمري هذا حتى تنفرد سالفتي أو لينفذن الله أمره\" قال بديل سأبلغهم ما تقول فانطلق حتى أتى قريشا فقال إنا قد جئنا من عند هذا الرجل وسمعناه يقول قولا فإن شئتم أن نعرضه عليكم فعلنا فقال سفهاؤهم لا حاجة لنا أن تخبرنا عنه بشيء وقال ذوو الرأي منهم هات ما سمعته يقول: قال سمعته يقول كذا وكذا فحدثهم بما قال رسول الله صلى الله عليه وسلم فقام عروة بن مسعود فقال أي قوم ألستم بالوالد؟ قالوا بلى قال أولست بالولد؟ قالوا بلى قال فهل تتهموني؟ قالوا لا قال ألستم تعلمون أني استغفر أهل عكاظ فلما بلحوا علي جئتكم بأهلي وولدي ومن أطاعني؟ قالوا بلى قال فإن هذا قد عرض عليكم خطة رشد فاقبلوها ودوني آته قالوا ائته فأتاه فجعل يكلم النبي صلى الله عليه وسلم فقال النبي صلى الله عليه وسلم له نحوا من قوله لبديل بن ورقاء فقال عروة عند ذلك أي محمد أرأيت إن استأصلت قومك هل سمعت بأحد من العرب اجتاح أصله قبلك؟ وإن تك الأخرى فإني والله لأرى وجوها وإني لأرى أشوابا من الناس خليقا أن يفروا ويدعوك فقال له أبو بكر رضي الله عنه امصص بظر اللات أنحن نفر وندعه؟ قال من ذا؟ قالوا أبو بكر قال أما والذي نفسي بيده لولا يد لك عندي لم أجزك بها لأجبتك قال وجعل يكلم النبي صلى الله عليه وسلم فكلما كلمه أخذ بلحيته صلى الله عليه وسلم والمغيرة بن شعبة رضي الله عنه قائم على رأس النبي صلى الله عليه وسلم ومعه السيف وعليه المغفر وكلما أهوى عروة بيده إلى لحية النبي صلى الله عليه وسلم ضرب يده بنعل السيف وقال أخر يدك عن لحية رسول الله صلى الله عليه وسلم فرفع عروة رأسه وقال من هذا؟ قال المغيرة بن شعبة قال أي غدر ألست أسعى في غدرتك؟ وكان المغيرة بن شعبة رضي الله عنه صحب قوما في الجاهلية فقتلهم وأخذ أموالهم ثم جاء فأسلم فقال النبي صلى الله عليه وسلم \"أما الإسلام فأقبل وأما المال فلست منه في شيء\" ثم إن عروة جعل يرمق أصحاب النبي صلى الله عليه وسلم بعينيه قال فوالله ما تنخم رسول الله صلى الله عليه وسلم نخامة إلا وقعت في كف رجل منهم فدلك بها وجهه وجلده وإذا أمرهم ابتدروا أمره وإذ توضأ كادوا يقتتلون على وضوئه وإذا تكلم خفضوا أصواتهم عنده وما يحدون النظر إليه تعظيما له صلى الله عليه وسلم فرجع عروة إلى أصحابه فقال أي قوم والله لقد وفدت على الملوك ووفدت على كسرى وقيصر والنجاشي والله إن رأيت ملكا قط يعظمه أصحابه ما يعظم أصحاب محمد محمدا والله إن تنخم نخامة إلا وقعت في كف رجل منهم فدلك بها وجهه وجلده وإذا أمرهم ابتدروا أمره وإذا توضأ كادوا يقتتلون على وضوئه وإذا تكلم خفضوا أصواتهم عنده وما يحدون النظر إليه تعظيما له وإنه قد عرض عليكم خطة رشد فاقبلوها فقال رجل منهم من بني كنانة دعوني آته فقالوا ائته فلما أشرف على النبي صلى الله عليه وسلم وأصحابه رضي الله عنهم قال النبي صلى الله عليه وسلم \"هذا فلان وهو من قوم يعظمون البدن فابعثوها له\" فبعثت له واستقبله الناس يلبون فلما رأى ذلك قال سبحان الله ما ينبغي لهؤلاء أن يصدوا عن البيت فلما رجع إلى أصحابه قال رأيت البدن قد قلدت وأشعرت فما أرى أن يصدوا عن البيت فقام رجل منهم يقال له مكرز بن حفص فقال دعوني آته فقالوا ائته فلما أشرف عليهم قال النبي صلى الله عليه وسلم \"هذا مكرز وهو رجل فاجر\" فجعل يكلم النبي صلى الله عليه وسلم فبينما هو يكلمه إذ جاء سهيل بن عمرو وقال معمر أخبرني أيوب عن عكرمة أنه قال لما جاء سهيل بن عمرو قال النبي صلى الله عليه وسلم \"قد سهل لكم من أمركم\" قال معمر قال الزهري في حديثه فجاء سهيل بن عمرو فقال هات أكتب بيننا وبينك كتابا فدعا النبي صلى الله عليه وسلم بعلي رضي الله عنه وقال \"اكتب بسم الله الرحمن الرحيم\" فقال سهيل بن عمرو أما الرحمن فوالله ما أدري ما هو ولكن اكتب باسمك اللهم كما كنت تكتب فقال المسلمون والله لا نكتبها إلا بسم الله الرحمن الرحيم فقال النبي صلى الله عليه وسلم \"اكتب باسمك اللهم - ثم قال - هذا ما قاضى عليه محمد رسول الله\" فقال سهيل والله لو كنا نعلم أنك رسول الله ما صددناك عن البيت ولا قاتلناك ولكن اكتب محمد بن عبدالله فقال له النبي صلى الله عليه وسلم \"والله إني لرسول الله وإن كذبتموني اكتب محمد بن عبدالله\" قال الزهري وذلك لقوله \"والله لا يسألوني خطة يعظمون فيها حرمات الله تعالى إلا أعطيتهم إياها\" فقال له النبي صلى الله عليه وسلم على أن تخلوا بيننا وبين البيت فنطوف به فقال سهيل والله لا تتحدث العرب أنا أخذنا ضغطة ولكن ذلك من العام المقبل فكتب فقال سهيل وعلى أن لا يأتيك منا رجل وإن كان على دينك إلا رددته إلينا فقال المسلمون سبحان الله كيف يرد إلى المشركين وقد جاء مسلما؟ فبينما هم كذلك إذ جاء أبو جندل بن سهيل بن عمرو يرسف في قيوده قد خرج من أسفل مكة حتى رمى بنفسه بين أظهر المسلمين فقال سهيل هذا يا محمد أول من أقاضيك عليه أن ترده إلى فقال النبي صلى الله عليه وسلم \"إنا لم نقض الكتاب بعد\" قال فوالله إذا لا أصالحك على شيء أبدا فقال النبي صلى الله عليه وسلم \"فأجزه لي\" قال ما أنا بمجيز ذلك لك قال \"بلى فافعل\" قال ما أنا بفاعل قال مكرز بلى قد أجزناه لك قال أبو جندل أي معشر المسلمين أرد إلي المشركين وقد جئت مسلما ألا ترون ما قد لقيت؟ وكان قد عذب عذابا شديدا فى الله عز وجل قال عمر رضي الله عنه فأتيت نبي الله صلى الله عليه وسلم فقلت ألست نبي الله حقا؟ قال صلى الله عليه وسلم \"بلى\" قلت ألسنا على الحق وعدونا على الباطل؟ قال صلى الله عليه وسلم \"بلى\" قلت فلم نعطي الدنية في ديننا إذا؟ قال صلى الله عليه وسلم \"إني رسول الله ولست أعصيه وهو ناصري\" قلت أو لست كنت تحدثنا أنا سنأتي البيت ونطوف به قال صلى الله عليه وسلم: \"بلى أفأخبرتك أنا نأتيه العام\" قلت لا قال صلى الله عليه وسلم \"فإنك آتيه ومطوف به\" قال فأتيت أبا بكر فقلت يا أبا بكر أليس هذا نبي الله حقا؟ قال بلى قلت ألسنا على الحق وعدونا على الباطل ؟ قال بلى قلت فلم نعطي الدنية في ديننا إذا؟ قال أيها الرجل إنه رسول الله وليس يعصي ربه وهو ناصره فاستمسك بغرزه فوالله إنه على الحق قلت أو ليس كان يحدثنا أنا سنأتي البيت ونطوف به؟ قال بلى أفأخبرك أنك تأتيه العام؟ قلت لا قال فإنك تأتيه وتطوف به قال الزهري قال عمر رضي الله عنه فعملت لذلك أعمالا قال فلما فرغ من قضية الكتاب قال رسول الله صلى الله عليه وسلم لأصحابه: \"قوموا فانحروا ثم احلقوا\" قال فوالله ما قام منهم رجل حتى قال صلى الله عليه وسلم ذلك ثلاث مرات فلما لم يقم منهم أحد دخل صلى الله عليه وسلم على أم سلمة رضي الله عنها فذكر لها ما لقى من الناس قالت له أم سلمة رضي الله عنها يا نبي الله أتحب ذلك؟ اخرج ثم لا تكلم أحدا منهم كلمة حتى تنحر بدنك وتدعو حالقك فيحلقك فخرج رسول الله صلى الله عليه وسلم فلم يكلم أحدا منهم حتى فعل ذلك نحر بيده ودعا حالقه فحلقه فلما رأوا ذلك قاموا فنحروا وجعل بعضهم يحلق بعضا حتى كاد بعضهم يقتل بعضا غما ثم جاءه نسوة مؤمنات فأنزل الله عز وجل \"يا أيها الذين آمنوا إذا جاءكم المؤمنات مهاجرات\" حتى بلغ \"بعصم الكوافر\" فطلق عمر رضي الله عنه يومئذ امرأتين كانتا له في الشرك فتزوج إحداهما معاوية بن أبي سفيان والأخرى صفوان بن أمية ثم رجع النبي صلى الله عليه وسلم إلى المدينة فجاءه أبو بصير رجل من قريش وهو مسلم فأرسلوا في طلبه رجلين فقالوا العهد الذي جعلت لنا فدفعه إلى الرجلين فخرجا به حتى إذا بلغا ذا الحليفة فنزلوا يأكلون من تمر لهم فقال أبو بصير لأحد الرجلين والله إني لأرى سيفك هذا يا فلان جيدا فاستله الآخر فقال أجل والله إنه لجيد لقد جربت منه ثم جربت فقال أبو بصير أرني أنظر إليه فأمكنه منه فضربه حتى برد وفر الآخر حتى أتى المدينة فدخل المسجد يعدو فقال رسول الله صلى الله عليه وسلم حين رآه \"لقد رأى هذا ذعرا\" فلما انتهى إلى النبي صلى الله عليه وسلم قال قتل والله صاحبي وإني لمقتول فجاء أبو بصير فقال يا رسول الله قد والله أوفى الله ذمتك قد رددتني إليهم ثم نجاني الله تعالى منهم فقال النبي صلى الله عليه وسلم \"ويل أمه مسعر حرب لو كان معه أحد \"فلما سمع ذلك عرف أنه سيرده إليهم فخرج حتى أتى سيف البحر قال وتفلت منهم أبو جندل بن سهيل فلحق بأبي بصير فجعل لا يخرج من قريش رجل قد أسلم إلا لحق بأبي بصير حتى اجتمعت منهم عصابة فوالله ما يسمعون بعير خرجت لقريش إلى الشام إلا اعترضوا لها فقتلوهم وأخذوا أموالهم فأرسلت قريش إلى النبي صلى الله عليه وسلم تناشده الله والرحم لما أرسل إليهم فمن أتاه منهم فهو آمن فأرسل النبي صلى الله عليه وسلم إليهم وأنزل الله عز وجل \"وهو الذي كف أيديهم عنكم وأيديكم عنهم ببطن مكة\" حت بلغ \"حمية الجاهلية\" وكانت حميتهم أنهم لم يقروا أنه رسول الله ولم يقروا ببسم الله الرحمن الرحيم وحالوا بينهم وبين البيت هكذا ساقه البخاري ههنا وقد أخرجه في التفسير وفي عمرة الحديبية وفي الحج وغير ذلك من حديث معمر وسفيان بن عيينة كلاهما عن الزهري به ووقع فى بعض الأماكن عن الزهري عن عروة بن مروان والمسور عن رجال من أصحاب النبي صلى الله عليه وسلم بذلك وهذا أشبه والله أعلم ولم يسقه أبسط من ههنا وبينه وبين سياق ابن إسحاق تباين في مواضع وهناك فوائد ينبغي إضافتها إلى ما هنا ولذلك سقنا تلك الرواية وهذه والله المستعان وعليه التكلان ولا حول ولا قوة إلا بالله العزيز الحكيم وقال البخاري في التفسير حدثنا أحمد بن إسحاق السلمي حدثنا يعلى حدثنا عبدالعزيز بن سياه عن حبيب بن أبي ثابت قال أتيت أبا وائل أسأله فقال كنا بصفين فقال رجل ألم تر إلى الذين يدعون إلى كتاب الله فقال علي بن أبي طالب رضي الله عنه نعم فقال سهل بن حنيف اتهموا أنفسكم فلقد رأيتنا يوم الحديبية يعني الصلح الذي كان بين النبي صلى الله عليه وسلم والمشركين ولو نرى قتالا لقاتلنا فجاء عمر رضي الله عنه فقال ألسنا على الحق وهم على الباطل؟ أليس قتلانا في الجنة وقتلاهم في النار؟ فقال \"بلى\" قال ففيما نعطي الدنية في ديننا ونرجع ولما يحكم الله بيننا؟ فقال صلى الله عليه وسلم \"يا ابن الخطاب إني رسول الله ولن يضيعني الله أبدا\" فرجع متغيظا فلم يصبر حتى جاء أبا بكر رضي الله عنه فقال يا أبا بكر ألسنا على الحق وهم على الباطل؟ فقال يا ابن الخطاب إنه رسول الله ولن يضيعه الله أبدا فنزلت سورة الفتح وقد رواه البخاري أيضا في مواضع أخرى ومسلم والنسائي من طرق آخر عن أبي وائل سفيان بن سلمة عن سهل بن حنيف به وفي بعض ألفاظه يا أيها الناس اتهموا الرأي فلقد رأيتني يوم أبي جندل ولو أقدر على أن أرد على رسول الله صلى الله عليه وسلم أمره لرددته وفي رواية فنزلت سورة الفتح فدعا رسول الله صلى الله عليه وسلم عمر بن الخطاب رضي الله عنه فقرأها عليه وقال الإمام أحمد حدثنا عفان حدثنا حماد عن ثابت عن أنس رضي الله عنه قال: إن قريشا صالحوا النبي صلى الله عليه وسلم وفيهم سهيل بن عمرو فقال النبي صلى الله عليه وسلم لعلي رضي الله عنه \"اكتب بسم الله الرحمن الرحيم\" فقال سهيل لا ندري ما بسم الله الرحمن الرحيم ولكن اكتب باسمك اللهم فقال صلى الله عليه وسلم \"اكتب من محمد رسول الله\" قال لو نعلم أنك رسول الله لاتبعناك ولكن اكتب اسمك واسم أبيك فقال النبي صلى الله عليه وسلم \"اكتب من محمد بن عبدالله\" واشترطوا على النبي صلى الله عليه وسلم أن من جاء منكم لم نرده عليكم ومن جاءكم منا رددتموه علينا فقال يا رسول الله أنكتب هذا؟ قال صلى الله عليه وسلم \"نعم إنه من ذهب منا إليهم فأبعده الله\" رواه مسلم من حديث حماد بن سلمة به وقال أحمد أيضا حدثنا عبد الرحمن بن مهدي عن عكرمة بن عمار قال حدثني سماك عن عبدالله بن عباس رضي الله عنهما قال لما خرجت الحرورية اعتزلوا فقلت لهم إن رسول الله صلى الله عليه وسلم يوم الحديبية صالح المشركين فقال لعلي رضي الله عنه \"اكتب يا علي هذا ما صالح عليه محمد رسول الله \"قالوا لو نعلم أنك رسول الله ما قاتلناك فقال رسول الله صلى الله عليه وسلم \"امح يا علي اللهم إنك تعلم أني رسولك امح يا علي واكتب هذا ما صالح عليه محمد بن عبدالله\" والله لرسول الله خير من علي وقد محا نفسه ولم يكن محوه ذلك يمحوه من النبوة أخرجت من هذه؟ قالوا نعم ورواه أبو داود من حديث عكرمة بن عمار اليمامي بنحوه وروى الإمام أحمد عن يحيى بن آدم عن زهير بن حرب عن محمد بن عبدالرحمن بن أبي ليلى عن الحكم عن مقسم عن ابن عباس رضي الله عنهما قال: نحر رسول الله صلى الله عليه وسلم يوم الحديبية سبعين بدنة فيها جمل لأبي جهل فلما صدت عن البيت حنت كما تحن إلى أولادها."
    },
    {
      "ayah": 27,
      "surah": 48,
      "text": "كان رسول الله صلى الله عليه وسلم قد رأى في المنام أنه دخل مكة وطاف بالبيت فأخبر أصحابه بذلك وهو بالمدينة فلما ساروا عام الحديبية لم يشك جماعة منهم أن هذه الرؤيا تتفسر هذا العام فلما وقع ما وقع من قضية الصلح ورجعوا عامهم ذلك على أن يعودوا من قابل وقع في نفس بعض الصحابة رضي الله عنهم من ذلك شيء حتى سأل عمر بن الخطاب رضي الله عنه في ذلك فقال له فيما قال أفلم تكن تخبرنا أنا سنأتي البيت ونطوف به؟ قال: \"بلى أفأخبرتك أنك تأتيه عامك هذا؟\" قال لا قال النبي صلى الله عليه وسلم \"فإنك آتيه ومطوف به\" وبهذا أجاب الصديق رضي الله عنه أيضا حذو القذة بالقذة ولهذا قال تبارك وتعالى \"لقد صدق الله رسوله الرؤيا بالحق لتدخلن المسجد الحرام إن شاء الله\" هذا لتحقيق الخبر وتوكيده وليس هذا من الاستثناء في شيء وقوله عز وجل \"آمنين\" أي في حال دخولكم وقوله \"محلقين رؤوسكم ومقصرين\" حال مقدرة لأنهم في حال دخولهم لم يكونوا محلقين ومقصرين وإنما كان هذا في ثاني الحال كان منهم من حلق رأسه ومنهم من قصره وثبت في الصحيحين أن رسول الله صلى الله عليه وسلم قال \"رحم الله المحلقين\" قالوا والمقصرين يا رسول الله ؟ قال صلى الله عليه وسلم \"رحم الله المحلقين\" قالوا والمقصرين يا رسول الله؟ قال صلى الله عليه وسلم \"رحم الله المحلقين\" قالوا والمقصرين يا رسول الله؟ قال صلى الله عليه وسلم \"والمقصرين\" في الثالثة أو الرابعة وقوله سبحانه وتعالى: \"لا تخافون\" حال مؤكدة في المعنى فأثبت لهم الأمن حال الدخول ونفى عنهم الخوف حال استقرارهم في البلد لا يخافون من أحد وهذا كان في عمرة القضاء في ذي القعدة سنة سبع فإن النبي صلى الله عليه وسلم لما رجع من الحديبية في ذي القعدة رجع إلى المدينة فأقام بها ذا الحجة والمحرم وخرج في صفر إلى خيبر ففتحها الله عليه بعضها عنوة وبعضها صلحا وهى إقليم عظيم كثير النخل والزروع فاستخدم من فيها من اليهود عليها على الشطر وقسمها بين أهل الحديبية وحدهم ولم يشهدها أحد غيرهم إلا الذين قدموا من الحبشة جعفر بن أبي طالب وأصحابه وأبو موسى الأشعري وأصحابه رضي الله عنهم ولم يغب منهم أحد قال ابن زيد إلا أبا دجانه سماك بن خرشة كما هو مقرر في موضعه ثم رجع إلى المدينة فلما كان في ذي القعدة من سنة سبع خرج صلى الله عليه وسلم إلى مكة معتمرا هو وأهل الحديبية فأحرم من ذي الحليفة وساق معه الهدي قيل كان ستين بدنة فلبى وسار أصحابه يلبون فلما كان صلى الله عليه وسلم قريبا من مر الظهران بعث محمد بن سلمة بالخيل والسلاح أمامه فلما رآه المشركون رعبوا رعبا شديدا وظنوا أن رسول الله صلى الله عليه وسلم يغزوهم وأنه قد نكث العهد الذي بينهم وبينه من وضع القتال عشر سنين فذهبوا فأخبروا أهل مكة فلما جاء رسول الله صلى الله عليه وسلم فنزل بمر الظهران حيث ينظر إلى أنصاب الحرم بعث السلاح من القسي والنبل والرماح إلى بطن يأجج وسار إلى مكة بالسيوف مغمدة في قربها كما شارطهم عليه فلما كان في أثناء الطريق بعثت قريش مكرز بن حفص فقال يا محمد ما عرفناك تنقض العهد فقال صلى الله عليه وسلم \"وما ذاك؟\" قال دخلت علينا بالسلاح والقسي والرماح فقال صلى الله عليه وسلم \"لم يكن ذلك وقد بعثنا به إلى يأجج؟\" فقال بهذا عرفناك بالبر والوفاء وخرجت رؤوس الكفار من مكة لئلا ينظروا إلى رسول الله صلى الله عليه وسلم وإلى أصحابه رضي الله عنهم غيظا وحنقا وأما بقية أهل مكة من الرجال والنساء والوالدان فجلسوا في الطرق وعلى البيوت ينظرون إلى رسول الله صلى الله عليه وسلم وأصحابه فدخلها عليه الصلاة والسلام وبين يديه أصحابه يلبون والهدي قد بعثه إلى ذي طوى وهو راكب ناقته القصواء التي كان راكبها يوم الحديبية وعبدالله بن رواحة الأنصاري آخذ بزمام ناقة رسول الله صلى الله عليه وسلم يقودها وهو يقول: باسم الذي لا دين إلا دينه باسم الذي محمد رسوله خلوا بني الكفار عن سبيله اليوم نضربكم على تأويله كما ضربناكم على تنزيله ضربا يزيل الهام عن مقيله ويذهل الخليل عن خليله قد أنزل الرحمن في تنزيله في صحف تتلى على رسوله بأن خير القتل في سبيله يا رب إنى مؤمن بقيله فهذا مجموع من روايات متفرقة قال يونس بن بكير عن محمد بن إسحاق حدثني عبدالله بن أبي بكر بن حزم قال لما دخل رسول الله صلى الله عليه وسلم مكة في عمرة القضاء دخلها وعبدالله بن رواحة رضي الله عنه آخذ بخطام ناقته صلى الله عليه وسلم وهو يقول: خلوا بني الكفار عن سبيله إني شهيد أنه رسوله خلوا فكل الخير في رسوله يا رب إني مؤمن بقيله نحن قتلناكم على تأويله كما قتلناكم على تنزيله ضربا يزيل الهام عن مقيله ويذهل الخليل عن خليله وقال عبدالرزاق حدثنا معمر عن الزهري عن أنس بن مالك رضي الله عنه قال لما دخل رسول الله صلى الله عليه وسلم مكة في عمرة القضاء مشى عبدالله بن رواحة رضي الله عنه بين يديه وفي رواية وابن رواحة آخذ بغرزه وهو رضي الله عنه يقول: خلوا بني الكفار عن سبيله قد نزل الرحمن في تنزيله بأن خير القتل في سبيله يا رب إني مؤمن بقيله نحن قتلناكم على تأويله كما قتلناكم على تنزيله اليوم نضربكم على تأويله ضربا يزيل الهام عن مقيله ويذهل الخليل عن خليله وقال الإمام أحمد حدثنا محمد بن الصباح حدثنا إسماعيل يعني ابن زكريا عن عبدالله يعني ابن عثمان عن أبي الطفيل عن ابن عباس رضي الله عنهما قال إن رسول الله صلى الله عليه وسلم لما نزل مر الظهران في عمرته بلغ أصحاب رسول الله صلى الله عليه وسلم أن قريشا تقول ما يتباعثون من العجف فقال أصحابه لو انتحرنا من ظهرنا فاكلنا من لحمه وحسونا من مرقه أصبحنا غدا حين ندخل على القوم وبنا جمامة قال صلى الله عليه وسلم لا تفعلوا ولكن اجمعوا لي من أزوادكم فجمعوا له وبسطوا الأنطاع فأكلوا حتى تركوا وحشا كل واحد منهم في جرابه ثم أقبل رسول الله صلى الله عليه وسلم حتى دخل المسجد وقعدت قريش نحو الحجر فاضطجع صلى الله عليه وسلم بردائه ثم قال: لا يرى القوم فيكم غميزة فاستلم الركن ثم رمل حتى إذا تغيب بالركن اليماني مشى إلى الركن الأسود فقالت قريش ما ترضون بالمشي أما إنكم لتنقرون نقر الظباء ففعل ذلك ثلاثة أشواط فكانت سنة قال أبو الطفيل فأخبرني ابن عباس رضي الله عنهما أن رسول الله صلى الله عليه وسلم فعل ذلك في حجة الوداع وقال أحمد أيضا حدثنا يونس بن محمد حدثنا حماد بن زيد حدثنا أيوب عن سعيد بن حبير عن ابن عباس رضي الله عنهما قال قدم رسول الله صلى الله عليه وسلم وأصحابه مكة وقد وهنتهم حمى يثرب ولقوا منها سوءا فقال المشركون إنه يقدم عليكم قوم قد وهنتهم حمى يثرب ولقوا منها شرا وجلس المشركون من الناحية التي تلي الحجر فأطلع الله تعالى نبيه صلى الله عليه وسلم على ما قالوا فأمر رسول الله صلى الله عليه وسلم أصحابه أن يرملوا الأشواط الثلاثة ليرى المشركون جلدهم قال فرملوا ثلاثة أشواط وأمرهم أن يمشوا بين الركنين حيث لا يراهم المشركون ولم يمنع النبي صلى الله عليه وسلم أن يرملوا الأشواط كلها إلا إبقاء عليهم فقال المشركون أهؤلاء الذين زعمتم أن الحمي قد وهنتهم هؤلاء أجلد من كذا وكذا أخرجاه في الصحيحين من حديث حماد بن زيد به وفي لفظ قدم النبي صلى الله عليه وسلم وأصحابه رضي الله عنهم صبيحة رابعة يعني من ذي القعدة فقال المشركون إنه يقدم عليكم وفد وقد وهنتهم حمي يثرب فأمرهم النبي صلى الله عليه وسلم أن يرملوا الأشواط الثلاثة ولم يمنعه أن يأمرهم أن يرملوا الأشواط كلها إلا الإبقاء عليهم قال البخاري وزاد ابن سلمة يعني حماد بن سلمة عن أيوب عن سعيد بن جبير عن ابن عباس رضي الله عنهما قال لما قدم النبي صلى الله عليه وسلم لعامة الذي استأمن قال \"ارملوا\" ليرى المشركين قوتهم والمشركون من قبل قعيقعان وحدثنا محمد حدثنا سفيان بن عيينة عن عمرو بن دينار عن عطاء عن ابن عباس رضي الله عنهما قال إنما سعى النبي صلى الله عليه وسلم بالبيت وبالصفا والمروة ليرى المشركون قوته ورواه في مواضع أخر ومسلم والنسائي من طرق عن سفيان بن عيينة به وقال أيضا حدثنا علي بن عبدالله حدثنا سفيان حدثنا إسماعيل بن أبي خالد أنه سمعا بن أبي أوفى يقول لما اعتمر رسول الله صلى الله عليه وسلم سترناه من غلمان المشركين ومنهم أن يؤذوا رسول الله صلى الله عليه وسلم انفرد به البخاري دون مسلم وقال البخاري أيضا حدثنا محمد بن رافع حدثنا شريح بن النعمان حدثنا فليح وحدثني محمد بن الحسين بن إبراهيم حدثنا أبي حدثنا فليح بن سليمان عن نافع عن ابن عمر رضي الله عنهما قال إن رسول الله صلى الله عليه وسلم خرج معتمرا فحال كفار قريش بينه وبين البيت فنحر هدية وحلق رأسه بالحديبية وقاضاهم على أن يعتمر العام المقبل ولا يحمل سلاحا عليهم إلا سيوفا ولا يقيم بها إلا ما أحبوا فاعتمر صلى الله عليه وسلم من العام المقبل فدخلها كما كان صالحهم فلما أن قام بها ثلاثا أمروه أن يخرج فخرج صلى الله عليه وسلم وهو في صحيح مسلم أيضا وقال البخاري أيضا حدثنا عبيدالله بن موسى عن إسرائيل عن أبي إسحاق عن البراء رضي الله عنه قال اعتمر النبي صلى الله عليه وسلم في ذي القعدة فأبى أهل مكة أن يدعوه يدخل مكة حتى قاضاهم على أن يقيموا بها ثلاثة أيام فلما كتبوا الكتاب كتبوا: هذا ما قاضى عليه محمد رسول الله قالوا لا نقر بهذا ولو نعلم أنك رسول الله ما منعناك شيئا ولكن اكتب محمد بن عبدالله قال صلى الله عليه وسلم \"أنا رسول الله وأنا محمد بن عبدالله\" ثم قال صلى الله عليه وسلم لعلي بن أبي طالب رضي الله عنه \"امح رسول الله\" قال رضي الله عنه لا والله لا أمحوك أبدا فأخذ رسول الله صلى الله عليه وسلم الكتاب وليس يحسن يكتب فكتب \"هذا ما قاضى عليه محمد بن عبدالله لا يدخل مكة بالسلاح إلا بالسيف في القراب وأن لا يخرج من أهلها بأحد أراد أن يتبعه وأن لا يمنع من أصحابه أحدا إن أراد أن يقيم بها\" فلما دخلها ومضى الأجل أتوا عليا فقالوا قل لصاحبك اخرج عنا فقد مضى الأجل فخرج النبي صلى الله عليه وسلم فتبعته ابنة حمزة رضي الله عنه تنادي يا عم يا عم فتناولها علي رضي الله عنه فأخذ بيدها وقال لفاطمة رضي الله عنها: دونك ابنة عمك فحملتها فاختصم فيها علي وزيد وجعفر رضي الله عنهم فقال علي رضي الله عنه أنا أخذتها وهي ابنة عمي وقال جعفر رضي الله عنه ابنة عمي وخالتها تحتي وقال زيد رضي الله عنه ابنة أخي فقضى بها النبي صلى الله عليه وسلم لخالتها وقال \"الخالة بمنزلة الأم\" وقال لعلي رضي الله عنه \"أنت مني وأنا منك\" وقال لجعفر رضي الله عنه \"أشبهت خلقي وخلقي\" وقال صلى الله عليه وسلم لزيد رضي الله عنه \"أنت أخونا ومولانا\" قال علي رضي الله عنه ألا تتزوج ابنة حمزة رضي الله عنه؟ قال صلى الله عليه وسلم \"إنها ابنة أخي من الرضاعة\" تفرد به هذا الوجه وقوله تعالى \"فعلم ما لم تعلموا فجعل من دون ذلك فتحا قريبا\" أي فعلم الله عز وجل من الخيرة والمصلحة في صرفكم عن مكة ودخولكم إليها عامكم ذلك ما لم تعلموا أنتم \"فجعل من دون ذلك\" أي قبل دخولكم الذي وعدتم به فى رؤيا النبي صلى الله عليه وسلم فتحا قريبا وهو الصلح الذي كان بينكم وبين أعدائكم من المشركين."
    },
    {
      "ayah": 28,
      "surah": 48,
      "text": "ثم قال تبارك وتعالى مبشرا للمؤمنين بنصرة الرسول صلى الله عليه وسلم على عدوه وعلى سائر أهل الأرض \"هو الذي أرسل رسوله بالهدى ودين الحق\" أي بالعلم النافع والعمل الصالح فإن الشريعة تشتمل على شيئين علم وعمل فالعلم الشرعي صحيح والعمل الشرعي مقبول فإخباراتها حق وإنشاءاتها عدل \"ليظهره على الدين كله\" أي على أهل جميع الأديان من سائر أهل الأرض من عرب وعجم ومسلمين ومشركين \"وكفى بالله شهيدا\" أي أنه رسوله وهو ناصره والله سبحانه وتعالى أعلم."
    },
    {
      "ayah": 29,
      "surah": 48,
      "text": "يخبر تعالى عن محمد صلى الله عليه وسلم أنه رسوله حقا بلا شك ولا ريب فقال \"محمد رسول الله\" وهذا مبتدأ وخبر وهو مشتمل على كل وصف جميل ثم ثنى بالثناء على أصحابه رضي الله عنهم فقال \"والذين معه أشداء على الكفار رحماء بينهم\" كما قال عز وجل \"فسوف يأتي الله بقوم يحبهم ويحبونه أذلة على المؤمنين أعزة على الكافرين\" وهذه صفة المؤمنين أن يكون أحدهم شديدا عنيفا على الكفار رحيما برا بالأخيار غضوبا عبوسا في وجه الكافر ضحوكا بشوشا في وجه أخيه المؤمن كما قال تعالى \"يا أيها الذين آمنوا قاتلوا الذين يلونكم من الكفار وليجدوا فيكم غلظة\" وقال النبي صلى الله عليه وسلم \"مثل المؤمنين في توادهم وتراحمهم كمثل الجسد الواحد إذا أشتكى منه عضو تداعى له سائر الجسد بالحمى والسهر\" وقال صلى الله عليه وسلم: \"المؤمن للمؤمن كالبنيان يشد بعضه بعضا\" وشبك صلى الله عليه وسلم بين أصابعه: كلا الحديثين في الصحيح وقوله سبحانه وتعالى \"تراهم ركعا سجدا يبتغون فضلا من الله ورضوانا\" وصفهم بكثرة العمل وكثرة الصلاة وهي خير الأعمال ووصفهم بالإخلاص فيها لله عز وجل والاحتساب عند الله تعالى جزيل الثواب وهو الجنة المشتملة على فضل الله عز وجل وهو سعة الرزق عليهم ورضاه تعالى عنهم وهو أكبر من الأول كما قال جل وعلا \"ورضوان من الله أكبر\" وقوله جل جلاله \"سيماهم في وجوههم من أثر السجود\" قال علي بن أبي طلحة عن ابن عباس رضي الله عنهما سيماهم في وجوههم يعني السمت الحسن وقال مجاهد وغير واحد يعني الخشوع والتواضع وقال ابن أبي حاتم حدثنا أبي حدثنا علي بن محمد الطنافسي حدثنا حسين الجعفي عن زائدة عن منصور عن مجاهد \"سيماهم في وجوههم من أثر السجود\" قال الخشوع قلت ما كنت أراه إلا هذا الأثر في الوجه فقال ربما كان بين عيني من هو أقسى قلبا من فرعون وقال السدي الصلاة تحسن وجوههم وقال بعض السلف من كثرت صلاته بالليل حسن وجهه بالنهار وقد أسنده ابن ماجة في سننه عن إسماعيل بن محمد الصالحي عن ثابت بن موسى عن شريك عن الأعمش عن أبي سفيان عن جابر رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم \"من كثرت صلاته بالليل حسن وجهه بالنهار\" والصحيح أنه موقوف وقال بعضهم إن للحسنة نورا في القلب وضياء في الوجه وسعة في الرزق ومحبة في قلوب الناس وقال أمير المؤمنين عثمان رضي الله عنه ما أسر أحد سريرة إلا أبداها الله تعالى على صفحات وجهه وفلتات لسانه والغرض أن الشيء الكامن في النفس يظهر على صفحات الوجه فالمؤمن إذا كانت سريرته صحيحه مع الله تعالى أصلح الله عز وجل ظاهره للناس كما روي عن عمر بن الخطاب رضي الله عنه أنه قال من أصلح سريرته أصلح الله تعالى علانيته وقال أبو القاسم الطبراني حدثنا محمود بن محمد المروزي حدثنا حامد بن آدم المروزي حدثنا الفضل بن موسى عن محمد بن عبيدالله العرزمي عن سلمة بن كهيل عن جندب بن سفيان البجلي رضي الله عنه قال: قال النبي صلى الله عليه وسلم \"ما أسر أحد سريرة إلا ألبسه الله تعالى رداءها إن خيرا فخير وإن شرا فشر\" العرزمي متروك وقال الإمام أحمد حدثنا حسن بن موسى حدثنا ابن لهيعة حدثنا دراج عن أبي الهيثم عن أبي سعيد رضي الله عنه عن رسول الله صلى الله عليه وسلم أنه قال \"لو أن أحدكم يعمل في صخرة صماء ليس لها باب ولا كوة لخرج عمله للناس كائنا ما كان\" وقال الإمام أحمد حدثنا حسن حدثنا زهير حدثنا قابوس بن أبي ظبيان أن أباه حدثه عن ابن عباس رضي الله عنهما عن النبي صلى الله عليه وسلم قال \"إن الهدي الصالح والسمت الصالح والاقتصاد جزء من خمسة وعشرين جزءا من النبوة\" ورواه أبو داود عن عبدالله بن محمد النفيلي عن زهير به فالصحابة رضي الله عنهم خلصت نياتهم وحسنت أعمالهم فكل من نظر إليهم أعجبوه في سمتهم وهديهم وقال مالك رضي الله عنه بلغني أن النصارى كانوا إذا رأوا الصحابة رضي الله عنهم الذين فتحوا الشام يقولون والله لهؤلاء خير من الحواريين فيما بلغنا وصدقوا في ذلك فإن هذه الأمة معظمة في الكتب المتقدمة وأعظمها وأفضلها أصحاب رسول الله صلى الله عليه وسلم وقد نوه الله تبارك وتعالى بذكرهم في الكتب المنزلة والأخبار المتداولة ولهذا قال سبحانه وتعالى ههنا \"ذلك مثلهم في التوراة\" ثم قال \"ومثلهم في الإنجيل كزرع أخرج شطأه\" أي فراخه \"فآزره\" أي شده \"فاستغلظ\" أي شب وطال \"فاستوى على سوقه يعجب الزراع\" أي فكذلك أصحاب رسول الله صلى الله عليه وسلم آزروه وأيدوه ونصروه فهم معه كالشطء مع الزرع \"ليغيظ بهم الكفار\" ومن هذه الآية انتزع الإمام مالك رحمة الله عليه في رواية عنه بتكفير الروافض الذين يبغضون الصحابة رضي الله عنهم قال لأنهم يغيظونهم ومن غاظ الصحابة رضي الله عنهم فهو كافر لهذه الآية ووافقه طائفة من العلماء رضي الله عنهم على ذلك والأحاديث في فضل الصحابة رضي الله عنهم والنهي عن التعرض بمساويهم كثيرة ويكفيهم ثناء الله عليهم ورضاه عنهم ثم قال تبارك وتعالى \"وعد الله الذين آمنوا وعملوا الصالحات منهم\" من هذه لبيان الجنس \"مغفرة\" أي لذنوبهم \"وأجرا عظيما\" أي ثوابا جزيلا ورزقا كريما ووعد الله حق وصدق لا يخلف ولا يبدل وكل من اقتفى أثر الصحابة رضي الله عنهم فهو في حكمهم ولهم الفضل والسبق والكمال الذي لا يلحقهم فيه أحد من هذه الأمة رضي الله عنهم وأرضاهم وجعل جنات الفردوس مأواهم وقد فعل قال مسلم في صحيحه حدثنا يحيى بن يحيى حدثنا أبو معاوية عن الأعمش عن أبي صالح عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم \"لا تسبوا أصحابي فوالذي نفسي بيده لو أن أحدكم أنفق مثل أحد ذهبا ما أدرك مد أحدهم ولا نصيفه\" آخر تفسير سورة الفتح ولله الحمد والمنة."
    },
    {
      "ayah": 3,
      "surah": 48,
      "text": "أي بسبب خضوعك لأمر الله عز وجل يرفعك الله وينصرك على أعدائك كما جاء في الحديث الصحيح \"وما زاد الله عبدا بعفو إلا عزا وما تواضع أحد لله عز وجل إلا رفعه الله تعالى\" وعن عمر بن الخطاب رضي الله عنه أنه قال: ما عاقبت أحدا عصى الله تعالى فيك بمثل أن تطيع الله تبارك وتعالى فيه."
    },
    {
      "ayah": 4,
      "surah": 48,
      "text": "\"هو الذي أنزل السكينة\" أي جعل الطمأنينة قاله ابن عباس رضي الله عنهما وعنه الرحمة وقال قتادة الوقار في قلوب المؤمنين وهم الصحابة رضي الله عنهم يوم الحديبية الذين استجابوا لله ولرسوله وانقادوا لحكم الله ورسوله فلما اطمأنت قلوبهم بذلك واستقرت زادهم إيمانا مع إيمانهم وقد استدل بها البخاري وغيره من الأئمة على تفاضل الإيمان في القلوب ثم ذكر تعالى أنه لو شاء لانتصر من الكافرين فقال سبحانه وتعالى \"ولله جنود السموات والأرض\" أي ولو أرسل عليهم ملكا واحدا لأباد خضراءهم ولكنه تعالى شرع لعباده المومنين الجهاد والقتال لما له في ذلك من الحكمة البالغة والحجة القاطعة والبراهين الدامغة ولهذا قال جلت عظمته \"وكان الله عليما حكيما\"."
    },
    {
      "ayah": 5,
      "surah": 48,
      "text": "قد تقدم حديث أنس رضي الله عنه حين قالوا هنيئا لك يا رسول الله هذا لك فما لنا؟ فأنزل الله تعالى \"ليدخل المؤمنين والمؤمنات جنات تجري من تحتها الأنهار خالدين فيها\" أي ماكثين فيما أبدا \"ويكفر عنهم سيئاتهم\" أي خطاياهم وذنوبهم فلا يعاقبهم عليها بل يعفو ويصفح ويغفر ويستر ويرحم ويشكر \"وكان ذلك عند الله فوزا عظيما\" كقوله جل وعلا \"فمن زحزح عن النار وأدخل الجنة فقد فاز\" الآية."
    },
    {
      "ayah": 6,
      "surah": 48,
      "text": "أي يتهمون الله تعالى في حكمه ويظنون بالرسول صلى الله عليه وسلم وأصحابه رضي الله عنهم أن يقتلوا ويذهبوا بالكلية ولهذا قال تعالى \"عليهم دائرة السوء وغضب الله عليهم ولعنهم\" أي أبعدهم من رحمته \"وأعد لهم جهنم وساءت مصيرا\"."
    },
    {
      "ayah": 7,
      "surah": 48,
      "text": "قال عز وجل مؤكدا لقدرته على الانتقام من الأعداء أعداء الإسلام من الكفرة والمنافقين \"ولله جنود السموات والأرض وكان الله عزيزا حكيما\"."
    },
    {
      "ayah": 8,
      "surah": 48,
      "text": "قال الإمام أحمد حدثنا موسى بن داود حدثنا فليح بن سليمان حدثنا هلال بن علي عن عطاء بن يسار قال لقيت عبدالله بن عمرو بن العاص رضي الله عنهما فقلت أخبرني عن صفة رسول الله صلى الله عليه وسلم في التوراة قال أجل والله إنه لموصوف في التوراة ببعض صفته في القرآن \"يا أيها النبي إنا أرسلناك شاهدا ومبشرا ونذيرا \"وحرزا للأميين فأنت عبدي ورسولي سميتك المتوكل ليس بفظ ولا غليظ ولا سخاب في الأسواق ولا يدفع السيئة بالسيئة ولكن يعفو ويصفح ويغفر ولن يقبضه الله حتى يقيم به الملة العوجاء بأن يقولوا لا إله إلا الله فيفتح بها أعينا عميا وآذانا صما وقلوبا غلفا وقد رواه البخاري في البيوع عن محمد بن سنان عن فليح بن سليمان عن هلال بن علي به ورواه في التفسير عن عبدالله قيل ابن رجاء وقيل ابن صالح عن عبدالعزيز بن أبي سلمة عن هلال عن عطاء بن يسار عن عبدالله بن عمرو به ورواه ابن أبي حاتم عن أبيه عن عبدالله بن رجاء عن عبدالعزيز بن أبي سلمة الماجشون به وقال البخاري في البيوع وقال سعيد عن هلال عن عطاء عن عبدالله بن سلام رضي الله عنه وقال وهب بن منبه إن الله تعالى أوحى إلى نبي من أنبياء بني إسرائيل يقال له شعياء: أن قم في قومك بني إسرائيل فإني منطق لسانك بوحي وأبعث أميا من الأمين أبعثه ليس بفظ ولا غليظ ولا سخاب في الأسواق لو يمر إلى جنب سراج لم يطفئه من سكينته ولو يمشي على القصب لم يسمع من تحت قدميه أبعثه مبشرا ونذيرا لا يقول الخنا أفتح به أعينا كمها وآذانا صما وقلوبا غلفا أسدده لكل أمر جميل وأهب له كل خلق كريم وأجعل السكينة لباسه والبر شعاره والتقوى ضميره والحكمة منطقة والصدق والوفاء طبيعته والعفو والمعروف خلقه والحق شريعته والعدل سيرته والهدى إمامه والإسلام ملته وأحمد اسمه أهدي به بعد الضلال وأعلم به بعد الجهالة وأرفع به بعد الخمالة وأعرف به بعد النكرة وأكثر به بعد القلة وأغني به بعد العيلة وأجمع به بعد الفرقة وأؤلف به بين أمم متفرقة وقلوب مختلفة وأهواء متشتتة وأستنقذ به فئاما من الناس عظيمة من الهلكة وأجعل أمته خير أمة أخرجت للناس يأمرون بالمعروف وينهون عن المنكر موحدين مؤمنين مخلصين مصدقين لما جاءت به رسلي ألهمهم التسبيح والتحميد والثناء والتكبير والتوحيد في مساجدهم ومجالسهم ومضاجعهم ومنقلبهم ومثواهم يصلون لي قياما وقعودا ويقاتلون في سبيل الله صفوفا وزحوفا ويخرجون من ديارهم ابتغاء مرضاتي ألوفا يظهرون الوجوه والأطراف ويشدون الثياب في الأنصاف قربانهم دماؤهم وأنا جيلهم فى صدورهم رهبان بالليل ليوث بالنهار وأجعل في أهل بيته وذريته السابقين والصديقين والشهداء والصالحين أمته من بعده يهدون بالحق وبه يعدلون وأعز من نصرهم وأيد من دعا لهم وأجعل دائرة السوء على من خالفهم أو بغى عليهم أو أراد أن ينتزع شيئا مما في أيديهم أجعلهم ورثة لنبيهم والداعية إلى ربهم يأمرون بالمعروف وينهون عن المنكر ويقيمون الصلاة ويؤتون الزكاة ويوفون بعهدهم أختم بهم الخير الذي بدأته بأولهم ذلك فضلي أؤتيه من أشاء وأنا ذو الفضل العظيم هكذا رواه ابن أبي حاتم عن وهب بن منبه اليماني رحمه الله ثم قال ابن أبي حاتم حدثنا أبي حدثنا عبدالرحمن بن صالح حدثنا عبدالرحمن بن محمد بن عبيد الله القرشي عن شيبان النحوي أخبرني قتادة عن عكرمة عن ابن عباس رضي الله عنهما قال: لما نزلت \"يا أيها النبي إنا أرسلناك شاهدا ومبشرا ونذيرا \"وقد كان أمر عليا ومعاذا رضي الله عنهما أن يسيرا إلى اليمن فقال انطلقا فبشرا ولا تنفرا ويسرا ولا تعسرا إنه قد أنزل علي \"يا أيها النبي إنا أرسلناك شاهدا ومبشرا ونذيرا \"ورواه الطبراني عن محمد بن نصر بن حميد البزار البغدادي عن عبدالرحمن بن صالح الأزدي عن عبدالرحمن بن محمد بن عبيد الله العرزمي بإسناده مثله وقال في آخره فإنه قد أنزل علي يا أيها النبي إنا أرسلناك شاهدا على أمتك ومبشرا بالجنة ونذيرا من النار وداعيا إلى شهادة أن لا إله إلا الله بإذنه وسراجا منيرا بالقرآن فقوله تعالى: \"شاهدا \"أي لله بالوحدانية وأنه لا إله غيره وعلى الناس بأعمالهم يوم القيامة وجئنا بك على هؤلاء شهيدا كقوله: \"لتكونوا شهداء على الناس ويكون الرسول عليكم شهيدا \"وقوله عز وجل \"ومبشرا ونذيرا \"أي بشيرا للمؤمنين بجزيل الثواب ونذيرا للكافرين من وبيل العقاب."
    },
    {
      "ayah": 9,
      "surah": 48,
      "text": "\"لتؤمنوا بالله ورسوله وتعزروه\" قال ابن عباس رضي الله عنهما وغير واحد تعظموه \"وتوقروه\" من التوقير وهو الاحترام والإجلال والإعظام \"وتسبحوه\" أي تسبحون الله \"بكرة وأصيلا\" أي أول النهار وآخره."
    }
  ]
}
