{
  "ayahs": [
    {
      "ayah": 1,
      "surah": 49,
      "text": "هذه آيات أدب الله تعالى بها عباده المؤمنين فيما يعاملون به الرسول صلى الله عليه وسلم من التوقير والاحترام والتبجيل والإعظام فقال تبارك وتعالى \"يا أيها الذين آمنوا لا تقدموا بين يدي الله ورسوله\" أي لا تسرعوا في الأشياء بين يديه أي قبله بل كونوا تبعا فى جميع الأمور حتى يدخل في عموم هذا الأدب الشرعي حديث معاذ رضي الله عنه حيث قال له النبي صلى الله عليه وسلم حين بعثه إلى اليمن \"بم تحكم؟\" قال بكتاب الله تعالى قال صلى الله عليه وسلم \"فإن لم تجد؟\" قال بسنة رسول الله صلى الله عليه وسلم قال صلى الله عليه وسلم \"فإن لم تجد؟\" قال رضي الله عنه أجتهد رأيي فضرب في صدره وقال \"الحمد للّه الذي وفق رسول رسول الله لما يرضي رسول الله صلى الله عليه وسلم\" وقد رواه أحمد وأبو داود والترمذي وابن ماجة فالغرض منه أنه أخر رأيه ونظره واجتهاده إلى ما بعد الكتاب والسنة ولو قدمه قبل البحث عنهما لكان من باب التقديم بين يدي الله ورسوله فقال علي بن أبي طلحة عن ابن عباس رضي الله عنهما \"لا تقدموا بين يدي الله ورسوله\" لا تقولوا خلاف الكتاب والسنة وقال العوفي عنه: نهوا أن يتكلموا بين يدي كلامه وقال مجاهد لا تفتاتوا على رسول الله صلى الله عليه وسلم بشيء حتى يقضي الله تعالى على لسانه وقال الضحاك لا تقضوا أمرا دون الله ورسوله من شرائع دينكم وقال سفيان الثوري \"لا تقدموا بين يدي الله ورسوله\" بقول ولا فعل وقال الحسن البصري \" لا تقدموا بين يدي الله ورسوله\" قال لا تدعوا قبل الإمام وقال قتادة ذكر لنا أن ناسا كانوا يقولون لو أنزل في كذا وكذا لو صح كذا فكره الله تعالى ذلك وتقدم فيه \"واتقوا الله\" أي فيما أمركم به \"إن الله سميع\" أي لأقوالكم \"عليم\" بنياتكم."
    },
    {
      "ayah": 10,
      "surah": 49,
      "text": "أي الجميع إخوة في الدين كما قال رسول الله صلى الله عليه وسلم \"المسلم أخو المسلم لا يظلمه ولا يسلمه\" وفي الصحيح \"والله في عون العبد ما كان العبد في عون أخيه\" وفي الصحيح أيضا \"إذا دعا المسلم لأخيه بظهر الغيب قال الملك آمين ولك بمثله\" والأحاديث في هذا كثيرة وفي الصحيح \"مثل المؤمنين في توادهم وتراحمهم وتواصلهم كمثل الجسد الواحد إذا اشتكى منه عضو تداعى له سائر الجسد بالحمى والسهر\" وفي الصحيح أيضا \"المؤمن للمؤمن كالبنيان يشد بعضه بعضا\" وشبك بين أصابعه صلى الله عليه وسلم وقال أحمد حدثنا أحمد بن الحجاج حدثنا عبدالله أخبرنا مصعب بن ثابت حدثني أبو حازم قال: سمعت سهل بن سعد الساعدي رضي الله عنه يحدث عن رسول الله صلى الله عليه وسلم قال \"إن المؤمن من أهل الإيمان بمنزلة الرأس من الجسد يألم المؤمن لأهل الإيمان كما يألم الجسد لما في الرأس\" تفرد به أحمد ولا بأس بإسناده وقوله تعالى \"فأصلحوا بين أخويكم\" يعني الفئتين المقتتلتين \"واتقوا الله\" أي في جميع أموركم \"لعلكم ترحمون\" وهذا تحقيق منه تعالى للرحمة لمن اتقاه."
    },
    {
      "ayah": 11,
      "surah": 49,
      "text": "ينهى تعالى عن السخرية بالناس وهو احتقارهم والاستهزاء بهم كما ثبت في الصحيح عن رسول الله صلى الله عليه وسلم أنه قال \"الكبر بطر الحق وغمص الناس - ويروى - وغمط الناس\" والمراد من ذلك احتقارهم واستصغارهم وهذا حرام فإنه قد يكون المحتقر أعظم قدرا عند الله تعالى وأحب إليه من الساخر منه المحتقر له ولهذا قال تعالى \"يا أيها الذين آمنوا لا يسخر قوم من قوم عسى أن يكونوا خيرا منهم ولا نساء من نساء عسى أن يكن خيرا منهن\" فنص على نهي الرجال وعطف بنهي النساء وقوله تبارك وتعالى \"ولا تلمزوا أنفسكم\" أي لا تلمزوا الناس والهماز اللماز من الرجال مذموم ملعون كما قال تعالى \"ويل لكل همزة لمزة\" والهمز بالفعل واللمز بالقول كما قال عز وجل \"هماز مشاء بنميم\" أي يحتقر الناس ويهمزهم طاغيا عليهم ويمشي بينهم بالنميمة وهي اللمز بالمقال ولهذا قال ههنا \"ولا تلمزوا أنفسكم\" كما قال \"ولا تقتلوا أنفسكم\" أي لا يقتل بعضكم بعضا قال ابن عباس ومجاهد وسعيد بن جيبر وقتادة ومقاتل بن حيان \"ولا تلمزوا أنفسكم\" أي لا يطعن بعضكم على بعض وقوله تعالى \"ولا تنابزوا بالألقاب\" أي لا تداعوا بالألقاب وهي التي يسوء الشخص سماعها قال الإمام أحمد حدثنا إسماعيل حدثنا داود بن أبي هند عن الشعبي قال حدثني أبو جبيرة بن الضحاك قال فينا نزلت في بني سلمة \"ولا تنابزوا بالألقاب\" قال قدم رسول الله صلى الله عليه وسلم المدينة وليس فينا رجل إلا وله اسمان أو ثلاثة فكان إذا دعا أحدا منهم باسم من تلك الأسماء قالوا يا رسول الله إنه يغضب من هذا فنزلت \"ولا تنابزوا بالألقاب\" ورواه أبو داود عن موسى بن إسماعيل عن وهب عن داود به وقوله جل وعلا \"بئس الاسم الفسوق بعد الإيمان\" أي بئس الصفة والاسم الفسوق وهو التنابز بالألقاب كما كان أهل الجاهلية يتناعتون بعدما دخلتم فى الإسلام وعقلتموه \"ومن له يتب\" أي من هذا \"فأولئك هم الظالمون\"."
    },
    {
      "ayah": 12,
      "surah": 49,
      "text": "يقول تعالى ناهيا عباده المؤمنين عن كثير من الظن وهو التهمة والتخون للأهل والأقارب والناس في غير محله لأن بعض ذلك يكون إثما محضا فليجتنب كثير منه احتياطا وروينا عن أمير المؤمنين عمر بن الخطاب رضي الله عنه أنه قال: ولا تظنن بكلمة خرجت من أخيك المؤمن إلا خيرا وأنت تجد لها في الخير محملا وقال أبو عبدالله ابن ماجة حدثنا أبو القاسم بن أبي ضمرة نصر بن محمد بن سليمان الحمصي حدثنا أبي حدثنا عبدالله بن أبي قيس النضري حدثنا عبدالله بن عمر رضي الله عنهما قال رأيت النبي صلى الله عليه وسلم يطوف بالكعبة ويقول \"ما أطيبك وأطيب ريحك ما أعظمك وأعظم حرمتك والذي نفس محمد بيده لحرمة المؤمن أعظم عند الله تعالى حرمة منك ماله ودمه وأن يظن به إلا خيرا\" تفرد به ابن ماجة من هذا الوجه وقال مالك عن أبي الزناد عن الأعرج عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم \"إياكم والظن فإن الظن أكذب الحديث ولا تجسسوا ولا تحسسوا ولا تنافسوا ولا تحاسدوا ولا تباغضوا ولا تدابروا وكونوا عباد الله إخوانا\" رواه البخاري عن عبدالله بن يوسف ومسلم عن يحيى بن يحيى وأبو داود عن العتبي عن مالك به وقال سفيان بن عيينة عن الزهري عن أنس رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم \"لا تقاطعوا ولا تدابروا ولا تباغضوا ولا تحاسدوا وكونوا عباد الله إخوانا ولا يحل لمسلم أن يهجر أخاه فوق ثلاثة أيام\" رواه مسلم والترمذي وصححه من حديث سفيان بن عيينة به وقال الطبراني حدثنا محمد بن عبدالله القرمطي العدوي حدثنا بكر بن عبد الوهاب المدني حدثنا إسماعيل ابن قيس الأنصاري حدثني عبدالرجمن بن محمد بن أبي الرجال عن أبيه عن جده حارثة بن النعمان رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم \"ثلاث لازمات لأمتي: الطيرة والحسد وسوء الظن\" فقال رجل وما يذهبهن يا رسول الله ممن هن فيه؟ قال صلى الله عليه وسلم \"إذا حسدت فاستغفر الله وإذا ظننت فلا تحقق وإذا تطيرت فامض\" وقال أبو داود حدثنا أبو بكر بن أبي شيبة حدثنا أبو معاوية عن الأعمش عن زيد رضي الله عنه قال أتي ابن مسعود رضي الله عنه برجل فقيل له هذا فلان تقطر لحيته خمرا فقال عبدالله رضي الله عنه إنا قد نهينا عن التجسس ولكن إن يظهر لنا شيء نأخذ به سماه ابن أبي حاتم في روايته الوليد بن عقبة بن أبي معيط وقال الإمام أحمد حدثنا هاشم حدثنا ليث عن إبراهيم بن نشيط الخولاني عن كعب بن علقمة عن أبي الهيثم عن دجين كاتب عقبة قال: قلت لعقبة إن لنا جيرانا يشربون الخمر وأنا داع لهم الشرط فيأخذونهم قال لا تفعل ولكن عظهم وتهددهم قال ففعل فلم ينتهوا قال فجاءه دجين فقال إني قد نهيتهم فلم ينتهوا وإني داع لهم الشرط فتأخذهم فقال له عقبة ويحك لا تفعل فإني سمعت رسول الله صلى الله عليه وسلم يقول\" من ستر عورة مؤمن فكأنما استحيا موءودة من قبرها\" ورواه أبو داود والنسائي من حديث الليث بن سعد به نحوه وقال سفيان الثوري عن راشد بن سعد عن معاوية رضي الله عنه قال سمعت النبي صلى الله عليه وسلم يقول \"إنك إن اتبعت عورات الناس أفسدتهم أو كدت أن تفسدهم\" فقال أبو الدرداء رضي الله عنه كلمة سمعها معاوية رضي الله عنه من رسول الله صلى الله عليه وسلم نفعه الله تعالى بها ورواه أبو داود منفردا به من حديث الثوري به وقال أبو داود أيضا حدثنا سعيد بن عمرو الحضرمي حدثنا إسماعيل بن عياش حدثنا ضمضم بن زرعة عن شريح بن عبيد عن جبير بن نفير وكثير بن مرة وعمرو بن الأسود والمقدام بن معد يكرب وأبي أمامة رضي الله عنهم عن النبي صلى الله عليه وسلم قال \"إن الأمير إذا ابتغى الريبة في الناس أفسدهم\" \"ولا تجسسوا\" أي على بعضكم بعضا والتجسس غالبا يطلق في الشر ومنه الجاسوس وأما التحسس فيكون غالبا في الخير كما قال عز وجل إخبارا عن يعقوب أنه قال \"يا بني اذهبوا فتحسسوا من يوسف وأخيه ولا تيأسوا من روح الله\" وقد يستعمل كل منهما في الشر كما ثبت في الصحيح أن رسول الله صلى الله عليه وسلم قال \"لا تجسسوا ولا تحسسوا ولا تباغضوا ولا تدابروا وكونوا عباد الله إخوانا\" وقال الأوزاعي التجسس البحث عن الشيء والتحسس الاستماع إلى حديث القوم وهم له كارهون أو يتسمع على أبوابهم والتدابر: الصرم رواه ابن أبي حاتم عنه وقوله تعالى \"ولا يغتب بعضكم بعضا\" فيه نهي عن الغيبة وقد فسرها الشارع كما جاء في الحديث الذي رواه أبو داود حدثنا القعنبي حدثنا عبدالعزيز بن محمد عن العلاء عن أبيه عن أبي هريرة قال: قيل يا رسول الله ما الغيبة؟ قال: صلى الله عليه وسلم \"ذكرك أخاك بما يكره\" قيل أفرأيت إن كان في أخي ما أقول؟ قال صلى الله عليه وسلم \"إن كان فيه ما تقول فقد اغتبته وإن لم يكن فيه ما تقول فقد بهته\" ورواه الترمذي عن قتيبة عن الدراوردي به وقال حسن صحيح ورواه ابن جرير عن بندار عن غندر عن شعبة عن العلاء وهكذا قال ابن عمر رضي الله عنهما ومسروق وقتادة وأبو إسحاق ومعاوية بن قرة وقال أبو داود حدثنا مسدد حدثنا يحيى عن سفيان حدثني علي بن الأقمر عن أبي حذيفة عن عائشة رضي الله عنها قالت: قلت للنبي صلى الله عليه وسلم حسبك من صفية كذا وكذا قال غير مسدد تعني قصيرة فقال صلى الله عليه وسلم \"لقد قلت كلمة لو مزجت بماء البحر لمزجته\" قالت وحكيت له إنسانا فقال صلى الله عليه وسلم \"ما أحب أني حكيت إنسانا وأن لي كذا وكذا\" ورواه الترمذي من حديث يحيى القطان وعبدالرجمن بن مهدي ووكيع ثلاثتهم عن سفيان الثوري عن علي بن الأقمر عن أبي حذيفة سلمة بن صهيب الأرحبي عن عائشة رضي الله عنها به وقال حسن صحيح وقال ابن جرير حدثني ابن أبي الشوارب حدثنا عبد الواحد بن زياد حدثنا سليمان الشيباني حدثنا حسان بن المخارق أن امرأة دخلت على عائشة رضي الله عنها فلما قامت لتخرج أشارت عائشة رضي الله عنها بيدها إلى النبي صلى الله عليه وسلم أي أنها قصيرة فقال النبي صلى الله عليه وسلم \"اغتبتيها\" والغيبة محرمة بالإجماع لا يستثنى من ذلك إلا ما رجحت مصلحته كما في الجرح والتعديل والنصيحة كقوله صلى الله عليه وسلم لما استأذن عليه ذلك الرجل الفاجر \"ائذنوا له بئس أخو العشيرة\" وكقوله صلى الله عليه وسلم لفاطمة بنت قيس رضي الله عنها وقد خطبها معاوية وأبو الجهم \"أما معاوية فصعلوك وأما أبو الجهم فلا يضع عصاه عن عاتقه\" وكذا ما جرى مجرى ذلك ثم بقيتها على التحريم الشديد وقد ورد فيها الزجر الأكيد ولهذا شبهها تبارك وتعالى بأكل اللحم من الإنسان الميت كما قال عز وجل \"أيحب أحدكم أن يأكل لحم أخيه ميتا فكرهتموه\" أي كما تكرهون هذا طبعا فاكرهوا ذاك شرعا فإن عقوبته أشد من هذا وهذا من التنفير عنها والتحذير منها كما قال صلى الله عليه وسلم في العائد في هبته \"كالكلب يقيء ثم يرجع في قيئه\" وقد قال \"ليس لنا مثل السوء\" وثبت في الصحاح والحسان والمسانيد من غير وجه أنه صلى الله عليه وسلم قال في خطبة حجة الوداع \"إن دماءكم وأموالكم وأعراضكم عليكم حرام كحرمة يومكم هذا في شهركم هذا في بلدكم هذا\" وقال أبو داود حدثنا واصل ابن عبد الأعلى حدثنا أسباط بن محمد عن هشام بن سعد عن زيد بن أسلم عن أبي صالح عن أبي هريرة قال: قال رسول الله صلى الله عليه وسلم \"كل المسلم على المسلم حرام ماله وعرضه ودمه حسب امرىء من الشر أن يحقر أخاه المسلم\" ورواه الترمذي عن عبيد بن أسباط بن محمد عن أبيه به وقال حسن غريب وحدثنا عثمان بن أبي شيبة حدثنا الأسود بن عامر حدثنا أبو بكر بن عياش عن الأعمش عن سعيد بن عبدالله بن جريج عن أبي برزة السلمي قال: قال رسول الله صلى الله عليه وسلم \"يا معشر من آمن بلسانه ولم يدخل الإيمان قلبه لا تغتابوا المسلمين ولا تتبعوا عوراتهم فإنه من يتبع عوراتهم يتبع الله عورته ومن يتبع الله عورته يفضحه في بيته\" تفرد به أبو داود وقد روى من حديث البراء بن عازب فقال الحافظ أبو يعلى في مسنده حدثنا إبراهيم بن دينار حدثنا مصعب بن سلام عن حمزة بن حبيب الزيات عن أبي إسحاق السبيعي عن البراء بن عازب رضي الله عنه قال خطبنا رسول الله صلى الله عليه وسلم حتى أسمع العواتق في بيوتها أو قال في خدورها فقال \"يا معشر من آمن بلسانه لا تغتابوا المسلمين ولا تتبعوا عوراتهم فإنه من يتبع عورة أخيه يتبع الله عورته ومن يتبع الله عورته يفضحه في جوف بيته\" \"طريق أخرى\" عن ابن عمر قال أبو بكر أحمد بن إبراهيم الإسماعيلى حدثنا عبدالله بن ناجية حدثنا يحيى بن أكثم حدثنا الفضل بن موسى الشيباني عن الحسين بن واقد عن أوفى بن دلهم عن نافع عن ابن عمر أن رسول الله صلى الله عليه وسلم قال \"يا معشر من آمن بلسانه ولم يفض الإيمان إلى قلبه لا تغتابوا المسلمين ولا تتبعوا عوراتهم فإنه من يتبع عورات المسلمين يتبع الله عورته ومن يتبع الله عورته يفضحه ولو في جوف رحله\" قال ونظر ابن عمر يوما إلى الكعبة فقال ما أعظمك وأعظم حرمتك وللمؤمن أعظم حرمة عند الله منك قال أبو داود حدثنا حيوة بن شريح حدثنا قتيبة عن ابن ثوبان عن أبيه عن مكحول عن وقاص بن ربيعة عن المسور أنه حدثه أن النبي صلى الله عليه وسلم قال \"من أكل برجل مسلم أكلة فإن الله يطعمه مثلها في جهنم ومن كسا ثوبا برجل مسلم فإن الله يكسوه مثله في جهنم ومن قام برجل مقام سمعة ورياء فإن الله تعالى يقوم به مقام سمعة ورياء يوم القيامة\" تفرد به أبو داود وحدثنا ابن مصفى حدثنا بقية وأبو المغيرة حدثنا صفوان حدثني راشد بن سعد وعبدالرحمن بن جبير عن أنس بن مالك قال: قال رسول الله صلى الله عليه وسلم: \"لما عرج بي مررت بقوم لهم أظفار من نحاس يخمشون وجوههم وصدورهم قلت من هؤلاء يا جبرائيل؟ قال هؤلاء الذين يأكلون لحوم الناس ويقعون في أعراضهم\" تفرد به أبو داود هكذا رواه الإمام أحمد عن أبي المغيرة عبد القدوس بن الحجاج الشامي به وقال ابن أبي حاتم حدثنا أبي حدثنا أحمد بن عبدة أخبرنا أبو عبدالصمد بن عبدالعزيز العمي أخبرنا أبو هارون العبدي من أبي سعيد الخدري قال: قلنا يا رسول الله حدثنا ما رأيت ليلة أسري بك؟ قال \"ثم انطلق بي إلى خلق من خلق الله كثير رجال ونساء موكل بهم رجال يعمدون إلى عرض جنب أحدهم فيجذون منه الجذة مثل النعل ثم يضعونها في في أحدهم فيقال له كل كما أكلت وهو يجد من أكله الموت يا محمد لو يجد الموت وهو يكره عليه فقلت يا جبرائيل من هؤلاء قال هؤلاء الهمازون اللمازون أصحاب النميمة فيقال أيحب أحدكم أن يأكل لحم أخيه ميتا فكرهتموه وهو يكره على أكل لحمه\" هكذا أورد هذا الحديث وقد سقناه بطوله فى أول تفسير سورة سبحان الله ولله الحمد والمنة وقال أبو داود الطيالسي في مسنده حدثنا الربيع عن يزيد عن أنس أن رسول الله صلى الله عليه وسلم أمر الناس أن يصوموا يوما ولا يفطرن أحد حتى آذن له فصام الناس فلما أمسوا جعل الرجل يجيء إلى رسول الله صلى الله عليه وسلم فيقول ظللت منذ اليوم صائما فئذن لي فأفطر فائذن له ويجيء الرجل فيقول ذلك فيأذن له حتى جاء رجل فقال يا رسول الله إن امرأتين من أهلك ظلتا منذ اليوم صائمتين فائذن لهما فليفطرا فأعرض عنه ثم أعاد فقال رسول الله صلى الله عليه وسلم \"ما صامتا وكيف صام من ظل يأكل من لحوم الناس؟ اذهب فمرهما إن كانتا صائمتين أن يستقيئا\" ففعلتا فقاءت كل واحدة منهما علقة فأتى النبي صلى الله عليه وسلم فأخبره فقال رسول الله \"لو ماتتا وهما فيهما لأكلتهما النار\" إسناد ضعيف ومتن غريب وقد رواه الحافظ البيهقي من حديث يزيد بن هارون حدثنا سليمان التيمي قال سمعت رجلا يحدث في مجلس أبي عثمان النهدي عن عبيدا مولى رسول الله صلى الله عليه وسلم أن امرأتين صامتا على عهد رسول الله صلى الله عليه وسلم وأن رجلا أتى رسول الله من فقال يا رسول الله إن ههنا امرأتين صامتا وإنهما كادتا تموتان من العطش أراه قال بالهاجرة فأعرض عنه أو سكت عنه فقال يا نبي الله إنهما والله قد ماتتا أو كادتا تموتان فقال \"ادعهما\" فجاءتا قال فجىء بقدح أو عس فقال لإحداهما \"قيئي\" فقاءت من قيح ودم وصديد حتى قاءت نصف القدح ثم قال للأخرى \"قيئي\" فقاءت قيحا ودما وصديدا ولحما ودما عبيطا وغيره حتى ملأت القدح ثم قال \"إن هاتين صامتا عما أحل الله تعالى لهما وأفطرتا على ما حرم الله عليهما جلست إحداهما إلى الأخرى فجعلتا تأكلان لحوم الناس\" وهكذا رواه الإمام أحمد عن يزيد بن هارون وابن أبي عدي كلاهما عن سليمان بن صوعان التيمي به مثله أو نحو ثم رواه أيضا من حديث مسدد عن يحيى القطان عن عثمان بن غياث حدثني رجل أظنه في حلقة أبي عثمان عن سعد مولى رسول الله صلى الله عليه وسلم أنهم أمروا بصيام فجاء رجل في نصف النهار فقال يا رسول الله فلانة وفلانة قد بلغتا الجهد فأعرض عنه مرتين أو ثلاثا ثم قال \"ادعهما\" فجاء بعس أو قدح فقال لإحداهما: قيئي فقاءت لحما ودما عبيطا وقيحا وقال للأخرى مثل ذلك ثم قال \"إن هاتين صامتا عما أحل الله لهما وأفطرتا على ما حرم الله عليهما أتت إحداهما للأخرى فلم تزالا تأكلان لحوم الناس حتى امتلأت أجوافهما قيحا\" قال البيهقي كذا قال عن سعد والأول وهو عبيد أصح وقال الحافظ أبو يعلى حدثنا عمرو بن الضحاك بن مخلد حدثنا أبي ثنا أبو عاصم حدثنا ابن جريج أخبرني أبو الزبير عن ابن عمر لأبي هريرة أن ماعزا جاء إلى رسول الله صلى الله عليه وسلم فقال يا رسول الله إني قد زنيت فأعرض عنه حتى قالها أربعا فلما كان في الخامسة قال \"زنيت\" قال نعم قال \"وتدري ما الزنا\" قال نعم أتيت منها حراما ما يأتي الرجل من امرأته حلالا قال \"ما تريد إلى هذا القول\" قال أريد أن تطهرني قال: فقال رسول الله صلى الله عليه وسلم \"أدخلت ذلك منك في ذلك منها كما يغيب الميل في المكحلة والرشا في البئر\" قال نعم يا رسول الله قال فأمر برجمه فرجم فسمع النبي صلى الله عليه وسلم رجلين يقول أحدهما لصاحبه ألم تر إلى هذا الذي ستر الله عليه فلم تدعه نفسه حتى رجم رجم الكلب ثم سار النبي صلى الله عليه وسلم حتى مر بجيفة حمار فقال: أين فلان وفلان \"انزلا فكلا من جيفة هذا الحمار\" قالا غفر الله لك يا رسول الله وهل يؤكل هذا؟ قال صلى الله عليه وسلم \"فما نلتما من أخيكما آنفا أشد أكلا منه والذي نفسي بيده إنه الآن لفي أنهار الجنة ينغمس فيها\" إسناد صحيح وقال الإمام أحمد حدثنا عبدالصمد حدثني أبي حدثنا واصل مولى ابن عيينة حدثني خالد بن عرفطة عن طلحة بن نافع عن جابر بن عبدالله رضي الله عنه قال كنا مع النبي الله فارتفعت ريح جيفة منتنة فقال رسول الله صلى الله عليه وسلم \"أتدرون ما هذه الريح؟ هذه ريح الذين يغتابون الناس؟\" \"طريق أخرى\" قال عبد بن حميد في مسنده حدثنا إبراهيم بن الأشعث حدثنا الفضيل بن عياض عن سليمان عن أبي سفيان وهو طلحة بن نافع عن جابر بن عبدالله رضي الله عنهما قال كنا مع النبي صلى الله عليه وسلم في سفر فهاجت ريح منتنة فقال النبي صلى الله عليه وسلم \"إن نفرا من المنافقين اغتابوا أناسا من المسلمين فلذلك بعثت هذه الريح\" وربما قال \"فلذلك هاجت هذه الريح\" وقال السدي في قوله تعالى \"أيحب أحدكم أن يأكل لحم أخيه ميتا\" زعم أن سلمان الفارسي رضي الله عنه كان مع رجلين من أصحاب النبي صلى الله عليه وسلم في سفر يخدمهما ويخف لهما وينال من طعامهما وأن سلمان رضي الله عنه لما سار الناس ذات يوم وبقي سلمان رضي الله عنه نائما لم يسر معهم فجعل صاحباه يكلماه فلم يجداه فضربا الخباء فقالا ما يريد سلمان أو هذا العبد شيئا غير هذا أن يجيء إلى طعام مقدور وخباء مضروب فلما جاء أرسلاه إلى رسول الله صلى الله عليه وسلم يطلب لهما إداما فانطلق فأتى رسول الله صلى الله عليه وسلم ومعه قدح له فقال يا رسول الله بعثني أصحابى لتؤدمهم إن كان عندك قال صلى الله عليه وسلم \"ما يصنع أصحابك بالأدم؟ قد ائتدموا\" فرجع سلمان رضي الله عنه يخبرهما بقول رسول الله صلى الله عليه وسلم فانطلقا حتى أتيا رسول الله صلى الله عليه وسلم فقالا: والذي بعثك بالحق ما أصبنا طعاما منذ نزلنا قال رسول الله صلى الله عليه وسلم \"إنكما قد ائتدمتما بسلمان بقولكما\" قال ونزلت \"أيحب أحدكم أن يأكل لحم أخيه ميتا\" إنه كان نائما وروى الحافظ الضياء المقدسي في كتابه المختار من طريق حسان بن هلال عن حماد بن سلمة عن ثابت عن أنس بن مالك رضي الله عنه قال كانت العرب تخدم بعضها بعضا في الأسفار وكان مع أبي بكر وعمر رضي الله عنهما رجل يخدمهما فناما فاستيقظا ولم يهيىء لهما طعاما فقالا إن هذا لنؤوم فأيقظاه فقالا له ائت رسول الله صلى الله عليه وسلم فقل له إن أبا بكر وعمر رضي الله عنهما يقرئانك السلام ويستأدمانك فقال صلى الله عليه وسلم \"إنهما قد ائتدما\" فجاءا فقالا يا رسول الله بأي شيء ائتدمنا؟ فقال صلى الله عليه وسلم \"بلحم أخيكما والذي نفسي بيده إني لأرى لحمه بين ثنايكما\" فقالا رضي الله عنهما استغفر لنا يا رسول الله فقال صلى الله عليه وسلم \"مراه فليستغفر لكما\" وقال الحافظ أبو يعلى حدثنا الحكم بن موسى حدثنا محمد بن مسلمة عن محمد بن إسحاق عن عمه موسى بن يسار عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم \"من أكل من لحم أخيه في الدنيا قرب إليه لحمه في الآخرة فيقال له كله ميتا كما أكلته حيا - قال - فيأكله ويكلح ويصيح\" غريب جدا وقوله عز وجل \"واتقوا الله\" أى فيما أمركم به ونهاكم عنه فراقبوه في ذلك واخشوا منه \"إن الله تواب رحيم\" أي تواب على من تاب إليه رحيم لمن رجع إليه واعتمد عليه قال الجمهور من العلماء طريق المغتاب للناس في تربته أن يقلع عن ذلك ويعزم على أن لا يعود وهل يشترط الندم على ما فات؟ فيه نزاع وأن يتحلل من الذي اغتابه وقال آخرون لا يشترط أن يتحلله فإنه إذا أعلمه بذلك ربما تأذى أشد مما إذا لم يعلم بما كان منه فطريقه إذا أن يثني عليه بما فيه في المجالس التي كان يذمه فيها وأن يرد عنه الغيبة بحسبه وطاقته لتكون تلك بتلك كما قال الإمام أحمد حدثنا أحمد بن الحجاج حدثنا عبدالله أخبرنا يحيى بن أيوب عن عبدالله بن سليمان أن إسماعيل بن يحيى المعافري أخبره أن سهل بن معاذ بن أنس الجهني أخبره عن أبيه رضي الله عنه عن النبي صلى الله عليه وسلم قال \"من حمى مؤمنا من منافق يغتابه بعث الله تعالى إليه ملكا يحمي لحمه يوم القيامة من نار جهنم ومن رمى مؤمنا بشيء يريد سبه حبسه الله تعالى على جسر جهنم حتى يخرج مما قال\" وكذا رواه أبو داود من حديث عبدالله وهو ابن المبارك به بنحوه وقال أبو داود أيضا حدثنا إسحاق بن الصباح حدثنا بن أبي مريم أخبرك الليث حدثنى يحيى بن سليم أنه سمع إسماعيل بن بشير يقول سمعت جابر بن عبدالله وأبا طلحة بن سهل الأنصاري رضي الله عنهما يقولان قال رسول الله صلى الله عليه وسلم \"ما من امرىء يخذل امرءا مسلما في موضع تنتهك فيه حرمته وينتقص فيه من عرضه إلا خذله الله تعالى فى مواطن يحب فيها نصرته وما من امرىء ينصر امرأ مسلما في موضع ينتقص فيه من عرضه وينتهك فيه من حرمته إلا نصره الله عز وجل في مواطن يحب فيها نصرته\" تفرد به أبو داود."
    },
    {
      "ayah": 13,
      "surah": 49,
      "text": "يقول تعالى مخبرا للناس أنه خلقهم من نفس واحدة وجعل منها زوجها وهما آدم وحواء وجعلهم شعوبا وهي أعم من القبائل وبعد القبائل مراتب أخر كالفصائل والعشائر والعمائر والأفخاد وغير ذلك وقيل المراد بالشعوب بطون العجم وبالقبائل بطون العرب كما أن الأسباط بطون بني إسرائيل وقد لخصت هذا في مقدمة مفردة جمعتها من كتاب الأشباه لأبي عمر بن عبدالبر ومن كتاب \"القصد والأمم في معرفة أنساب العرب والعجم\" فجميع الناس في الشرف بالنسبة الطينية إلى آدم وحواء عليهما السلام سواء وإنما يتفاضلون بالأمور الدينية وهى طاعة الله تعالى ومتابعة رسوله صلى الله عليه وسلم ولهذا قال تعالى بعد النهي عن الغيبة واحتقار بعض الناس بعضا منبها على تساويهم في البشرية \"يا أيها الناس إنا خلقناكم من ذكر وأنثى وجعلناكم شعوبا وقبائل لتعارفوا\" أي ليحصل التعارف بينهم كل يرجع إلى قبيلته وقال مجاهد في قوله عز وجل \"لتعارفوا\" كما يقال فلان بن فلان من كذا وكذا أي من قبيلة كذا وكذا وقال سفيان الثوري كانت حمير ينتسبون إلى مخاليفها وكانت عرب الحجاز ينتسبون إلى قبائلها وقد قال أبو عيسى الترمذي حدثنا أحمد بن محمد حدثنا عبدالله بن المبارك عن عبدالملك بن عيسى الثقفي عن يزيد مولى المنبعث عن أبي هريرة رضي الله عنه عن النبي صلى الله عليه وسلم قال \"تعلموا من أنسابكم ما تصلون به أرحامكم فإن صلة الرحم محبة في الأهل مثراة في المال منسأة في الأثر\" ثم قال غريب لا نعرفه إلا من هذا الوجه وقوله تعالى \"إن أكرمكم عند الله أتقاكم\" أي إنما تتفاضلون عند الله تعالى بالتقوى لا بالأحساب وقد وردت الأحاديث بذلك عن رسول الله صلى الله عليه وسلم قال البخاري حدثنا محمد بن سلام حدثنا عبدة عن عبيدالله عن سعيد بن أبي سعيد رضي الله عنه عن أبي هريرة قال: سئل رسول الله صلى الله عليه وسلم أي الناس أكرم؟ قال \"أكرمهم عند الله أتقاهم\" قالوا ليس عن هذا نسألك قال \"فأكرم الناس يوسف نبي الله ابن نبي الله ابن نبي الله ابن خليل الله\" قالوا ليس عن هذا نسألك قال \"فعن معادن العرب تسألوني؟\" قالوا نعم قال \"فخياركم في الجاهلية خياركم في الإسلام إذا فقهوا\" وقد رواه البخاري في غير موضع من طرق عن عبدة بن سليمان ورواه النسائي في التفسير من حديث عبيد الله وهو ابن عمر العمري به \"حديث آخر\" قال مسلم رحمه الله حدثنا عمرو الناقد حدثنا كثير بن هشام حدثنا جعفر بن برقان عن يزيد بن الأصم عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم \"إن الله لا ينظر إلى صوركم وأموالكم ولكن ينظر إلى قلوبكم وأعمالكم\" ورواه ابن ماجة عن أحمد بن سنان عن كثير بن هشام به \"حديث آخر\" وقال الإمام أحمد حدثنا وكيع عن أبي هلال عن بكر عن أبي ذر رضي الله عنه قال إن النبي صلى الله عليه وسلم قال له \"انظر فإنك لست بخير من أحمر ولا أسود إلا أن تفضله بتقوى الله\" تفرد به أحمد رحمه الله \"حديث آخر\" وقال الحافظ أبو القاسم الطبراني حدثنا أبو عبيدة عبد الوارث بن إبراهيم العسكري حدثنا عبدالرجمن بن عمرو بن جبلة حدثنا عبيد بن حنين الطائي سمعت محمد بن حبيب بن خراش العصري يحدث عن أبيه رضي الله عنه أنه سمع رسول الله صلى الله عليه وسلم يقول \"المسلمون إخوة لافضل لأحد على أحد إلا بالتقوى\" \"حديث آخر\" قال أبو بكر البزار في مسنده حدثنا أحمد بن يحيى الكوفي حدثنا الحسن بن الحسين حدثنا قيس يعني ابن الربيع عن شبيب بن عرقدة عن المستظل بن حصين عن حذيفة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: \"كلكم بنو آدم وآدم خلق من تراب ولينتهين قوم يفخرون بآبائهم أو ليكونن أهون على الله تعالى من الجعلان\" ثم قال لا نعرفه عن حذيفة إلا من هذا الوجه \"حديث آخر\" قال ابن أبي حاتم حدثنا الربيع بن سليمان حدثنا أسد بن موسى حدثنا يحيى بن زكريا القطان حدثنا موسى بن عبيدة عن عبدالله بن دينار عن ابن عمر رضي الله عنهما قال طاف رسول الله صلى الله عليه وسلم يوم فتح مكة على ناقته القصواء يستلم الأركان بمحجن في يده فما وجد لها مناخا في المسجد حتى نزل صلى الله عليه وسلم على أيدى الرجال فخرج بها إلى بطن المسيل فأنيخت ثم إن رسول الله صلى الله عليه وسلم خطبهم على راحلته فحمد الله تعالى وأثنى عليه بما هو له أهل ثم قال: \"يا أيها الناس إن الله تعالى قد أذهب عنكم عيبة الجاهلية وتعظمها بآبائها فالناس رجلان رجل بر تقي كريم على الله تعالى ورجل فاجر شقي هين على الله تعالى إن الله عز وجل يقول \"يا أيها الناس إنا خلقناكم من ذكر وأثنى وجعلناكم شعوبا وقبائل لتعارفوا إن أكرمكم عند الله أتقاكم إن الله عليم خبير\"- ثم قال صلى الله عليه وسلم - أقول قولي هذا وأستغفر الله لي لكم\" هكذا رواه عبد بن حميد عن أبي عاصم الضحاك عن مخلد عن موسى بن عبيدة به \"حديث آخر\" قال الإمام أحمد حدثنا يحيى بن إسحاق حدثنا ابن لهيعة عن الحارث بن يزيد عن علي بن رباح عن عقبة بن عامر رضي الله عنهما قال: إن رسول الله صلى الله عليه وسلم قال \"إن أنسابكم هذه ليست بمسبة على أحد كلكم بنو آدم طف الصاع لم يملئوه ليس لأحد على أحد فضل إلا بدين وتقوى وكفى بالرجل أن يكون بذيا بخيلا فاحشا\" وقد رواه ابن جرير عن يونس عن ابن وهب عن ابن لهيعة به ولفظه: \"الناس لآدم وحواء طف الصاع لم يملئوه إن الله لا يسألكم عن أحسابكم ولا عن أنسابكم يوم القيامة إن أكرمكم عند الله أتقاكم\" وليس هو في شيء من الكتب الستة من هذا الوجه \"حديث آخر\" قال الإمام أحمد حدثنا أحمد بن عبدالملك حدثنا شريك عن سماك عن عبدالله بن عمرة زوج درة بنت أبي لهب عن درة بنت أبي لهب رضي الله عنها قالت: قام رجل إلى النبي صلى الله عليه وسلم وهو على المنبر فقال يا رسول الله أي الناس خير؟ قال صلى الله عليه وسلم: \"خير الناس أقرأهم وأتقاهم لله عز وجل وآمرهم بالمعروف وأنهاهم عن المنكر وأوصلهم للرحم \" \"حديث آخر\" قال الإمام أحمد حدثنا حسن حدثنا ابن لهيعة حدثنا أبو الأسود عن القاسم بن محمد عن عائشة رضي الله عنها قالت ما أعجب رسول الله صلى الله عليه وسلم شيء من الدنيا ولا أعجبه أحد قط إلا ذو تقى تفرد به أحمد وقوله تعالى \"إن الله عليم خبير\" أي عليم بكم خبير بأموركم فيهدي من يشاء ويضل من يشاء ويرحم من يشاء ويعذب من يشاء ويفضل من يشاء على من يشاء وهوالحكيم العليم الخبير في ذلك كله وقد استدل بهذه الآية الكريمة وهذه الأحاديث الشريفة من ذهب من العلماء إلى أن الكفاءة في النكاح لا تشترط ولا يشترط سوى الدين لقوله تعالى \"إن أكرمكم عند الله أتقاكم\" وذهب الآخرون إلى أدلة أخرى مذكورة في كتب الفقه وقد ذكرنا طرقا من ذلك في \"كتاب الأحكام\" ولله الحمد والمنة وقد روى الطبراني عن عبدالرجمن أنه سمع رجلا من بني هاشم يقول أنا أولى الناس برسول الله صلى الله عليه وسلم فقال غيره أنا أولى به منك ولك منه نسبة."
    },
    {
      "ayah": 14,
      "surah": 49,
      "text": "يقول تعالى منكرا على الأعراب الذين أول ما دخلوا في الإسلام ادعوا لأنفسهم مقام الإيمان ولم يتمكن الإيمان في قلوبهم بعد \"قالت الأعراب آمنا قل لم تؤمنوا ولكن قولوا أسلمنا ولما يدخل الإيمان في قلوبكم\" وقد أستفيد من هذه الآية الكريمة أن الإيمان أخص من الإسلام كما هو مذهب أهل السنة والجماعة ويدل عليه حديث جبريل عليه الصلاة والسلام حين سأل عن الإسلام ثم عن الإيمان ثم عن الإحسان فترقى من الأعم إلى الأخص ثم للأخص منه وقال الإمام أحمد حدثنا عبد الرزاق أخبرنا معمر عن الزهري عن عامر بن سعد بن أبي وقاص عن أبيه رضي الله عنهما قال أعطى رسول الله صلى الله عليه وسلم رجالا ولم يعط رجلا منهم شيئا فقال سعد رضي الله تعالى عنه يا رسول الله أعطيت فلانا وفلانا ولم تعط فلانا شيئا وهو مؤمن فقال النبي صلى الله عليه وسلم \"أو مسلم\" حتى أعادها سعد رضي الله عنه ثلاثا والنبي صلى الله عليه وسلم يقول \"أو مسلم\" ثم قال النبي صلى الله عليه وسلم \"إني لأعطي رجالا وأدع من هو أحب إلي منهم فلم أعطه شيئا مخافة أن يكبوا في النار على وجوههم\" أخرجاه في الصحيحين من حديث الزهري به فقد فرق النبي صلى الله عليه وسلم بين المؤمن والمسلم فدل على أن الإيمان أخص من الإسلام وقد قررنا ذلك بأدلته في أول شرح كتاب الإيمان من صحيح البخاري ولله الحمد والمنة ودل ذلك على أن ذاك الرجل كان مسلما ليس منافقا لأنه تركه من العطاء ووكله إلى ما هو فيه من الإسلام فدل هذا على أن هؤلاء الأعراب المذكورين في هذه الآية ليسوا بمنافقين وإنما هم مسلمون لم يستحكم الإيمان في قلوبهم فادعوا لأنفسهم مقاما أعلى مما وصلوا إليه فأدبوا في ذلك وهذا معنى قول ابن عباس رضي الله عنهما وإبراهيم النخعي وقتادة واختاره ابن جرير وإنما قلنا هذا لأن البخاري رحمه الله ذهب إلى أن هؤلاء كانوا منافقين يظهرون الإيمان وليسوا كذلك وقد روي عن سعيد بن جبير ومجاهد وابن زيد أنهم قالوا في قوله تبارك وتعالى \"ولكن قولوا أسلمنا\" أي استسلمنا خوف القتل والسبي قال مجاهد نزلت فى بني أسد بن خزيمة وقال قتادة نزلت في قوم امتنوا بإيمانهم على رسول الله صلى الله عليه وسلم والصحيح الأول أنهم قوم ادعوا لأنفسهم مقام الإيمان ولم يحصل لهم بعد فأدبوا وأعلموا أن ذلك لم يصلوا إليه بعد ولو كانوا منافقين لعنفوا وفضحوا كما ذكر المنافقون في سورة براءة وإنما قيل لهؤلاء تأديبا \"قل لم تؤمنوا ولكن قولوا أسلمنا ولما يدخل الإيمان في قلوبكم\" أي لم تصلوا إلى حقيقة الإيمان بعد ثم قال تعالى \"وإن تطيعوا الله ورسوله لا يلتكم من أعمالكم شيئا\" أي لا ينقصكم من أجوركم شيئا كقوله عز وجل \"وما ألتناهم من عملهم من شيء\" وقوله تعالى \"إن الله غفور رحيم\" أي لمن تاب إليه وأناب."
    },
    {
      "ayah": 15,
      "surah": 49,
      "text": "\"إنما المؤمنون\" أي إنما المؤمنون الكمل \"الذين آمنوا بالله ورسوله ثم لم يرتابوا\" أي لم يشكوا ولا تزلزلوا بل ثبتوا على حال واحدة وهي التصديق المحض \"وجاهدوا بأموالهم وأنفسهم في سبيل الله\" أي وبذلوا مهجهم ونفائس أموالهم في طاعة الله ورضوانه \"أولئك هم الصادقون\" أي في قولهم إذا قالوا إنهم مؤمنون لا كبعض الأعراب الذين ليس لهم من الإيمان إلا الكلمة الظاهرة وقال الإمام أحمد حدثنا يحيى بن غيلان حدثنا رشدين حدثنا عمرو بن الحارث عن أبي السمح عن أبي الهيثم عن أبي سعيد رضي الله عنه قال إن النبي صلى الله عليه وسلم قال \"المؤمنون في الدنيا على ثلاثة أجزاء: الذين آمنوا بالله ورسوله ثم لم يرتابوا وجاهدوا بأموالهم وأنفسهم في سبيل الله والذي يأمنه الناس على أموالهم وأنفسهم والذي إذا أشرف على طمع تركه لله عز وجل\"."
    },
    {
      "ayah": 16,
      "surah": 49,
      "text": "أي أتخبرونه بما في ضمائركم \"والله يعلم ما في السموات وما في الأرض\" أي لا يخفى عليه مثقال ذرة في الأرض ولا في السماء ولا أصغر من ذلك ولا أكبر \"والله بكل شيء عليم\"."
    },
    {
      "ayah": 17,
      "surah": 49,
      "text": "ثم قال تعالى \" يمنون عليك أن أسلموا قل لا تمنوا علي إسلامكم \" يعني الأعراب الذين يمنون بإسلامهم ومتابعتهم ونصرتهم على الرسول صلى الله عليه وسلم يقول الله تعالى ردا عليهم \"قل لا تمنوا علي إسلامكم\" فإن نفع ذلك إنما يعود عليكم ولله المنة عليكم فيه \"بل الله يمن عليكم أن هداكم للإيمان إن كنتم صادقين\" أي في دعواكم ذلك كما قال النبي صلى الله عليه وسلم للأنصار يوم حنين \"يا معشر الأنصار ألم أجدكم ضلالا فهداكم الله بي؟ وكنتم متفرقين فألفكم الله بي؟ وكنتم عالة فأغناكم الله بي؟\" كلما قال شيئا قالوا: الله ورسوله أمن وقال الحافظ أبو بكر البزار حدثنا إبراهيم بن سعيد الجوهري حدثنا يحيى بن سعيد الأموي عن محمد بن قيس عن أبي عون عن سعيد بن جبير عن ابن عباس رضي الله عنهما قال جاءت بنو أسد إلى رسول الله الله فقالوا يا رسول الله أسلمنا وقاتلتك العرب ولم نقاتلك فقال رسول الله صلى الله عليه وسلم \"إن فقههم قليل وإن الشيطان ينطق على ألسنتهم\" ونزلت هذه الآية \"يمنون عليك أن أسلموا قل لا تمنوا علي إسلامكم بل الله يمن عليكم أن هداكم للإيمان إن كنتم صادقين\"."
    },
    {
      "ayah": 18,
      "surah": 49,
      "text": "كرر الإخبار بعلمه بجميع الكائنات وبصره بأعمال المخلوقات فقال \"إن الله يعلم غيب السماوات والأرض والله بصير بما تعملمون\" آخر تفسير سوره الحجرات ولله الحمد والمنة وبه التوفيق والعصمة."
    },
    {
      "ayah": 2,
      "surah": 49,
      "text": "وقوله تعالى \"يا أيها الذين آمنوا لا ترفعوا أصواتكم فوق صوت النبي\" هذا أدب ثان أدب الله تعالى به المؤمنين أن لا يرفعوا أصواتهم بين يدي النبي صلى الله عليه وسلم فوق صوته وقد روى إنها نزلت في الشيخين أبي بكر وعمر رضي الله عنهما وقال البخاري حدثنا يسرة بن صفوان اللخمي حدثنا نافع بن عمر عن ابن أبي مليكة قال: كاد الخيران أن يهلكا أبو بكر وعمر رضي الله عنهما رفعا أصواتهما عند النبي صلى الله عليه وسلم حين قدم عليه ركب بني تميم فأشار أحدهما بالأقرع بن حابس رضي الله عنه أخي بني مجاشع وأشار الآخر برجل آخر قال نافع لا أحفظ اسمه فقال أبو بكر لعمر رضي الله عنهما ما أردت إلا خلافي قال ما أردت خلافك فارتفعت أصواتهما في ذلك فأنزل الله تعالى \"يا أيها الذين آمنوا لا ترفعوا أصواتكم فوق صوت النبي ولا تجهروا له بالقول كجهر بعضكم لبعض أن تحبط أعمالكم وأنتم لا تشعرون\" قال ابن الزبير رضي الله عنهما فما كان عمر رضي الله عنه يسمع رسول الله صلى الله عليه وسلم بعد هذه الآية حتى يستفهمه ولم يذكر ذلك عن أبيه يعني أبا بكر رضي الله عنه ـ انفرد به دون مسلم ثم قال البخاري حدثنا حسن بن محمد حدثنا حجاج عن ابن جريج حدثني ابن أبي مليكة أن عبدالله بن الزبير رضي الله عنهما أخبره أنه قدم ركب من بني تميم على النبي صلى الله عليه وسلم فقال أبو بكر رضي الله عنه أمر الله القعقاع بن معبد وقال عمر رضي الله عنه بل أمر الأقرع بن حابس فقال أبو بكر رضي الله عنه ما أردت إلا خلافي فقال عمر رضي الله عنه ما أردت خلافك فتماريا حتى ارتفعت أصواتهما فنزلت في ذلك \"يا أيها الذين آمنوا لا تقدموا بين يدي الله ورسوله\" حتى انقضت الآية \"ولو أنهم صبروا حتى تخرج إليهم\" الآية وهكذا رواه ههنا منفردا به أيضا وقال الحافظ أبو بكر البزار في مسنده حدثنا الفضل بن سهل حدثنا إسحاق بن منصور حدثنا حصين بن عمر عن مخارق عن طارق بن شهاب عن أبى بكر الصديق رضي الله عنه قال لما نزلت هذه الآية \"يا أيها الذين آمنوا لا ترفعوا أصواتكم فوق صوت النبي\" قلت يا رسول الله والله لا أكلمك إلا كأخي السرار حصين بن عمر هذا وإن كان ضعيفا لكن قد رويناه من حديث عبدالرحمن بن عوف وأبي هريرة رضي الله عنهما بنحو ذلك والله أعلم وقال البخاري حدثنا علي بن عبدالله حدثنا أزهر بن سعد أخبرنا ابن عون أنبأني موسى بن أنس عن أنس بن مالك رضي الله عنه أن النبي صلى الله عليه وسلم افتقد ثابت بن قيس رضي الله عنه فقال رجل يا رسول الله أنا أعلم لك علمه فأتاه فوجده في بيته منكسا رأسه فقال له ما شأنك؟ فقال شركان يرفع صوته فوق صوت النبي صلى الله عليه وسلم فقد حبط عمله فهو من أهل النار فأتى الرجل النبي صلى الله عليه وسلم فأخبره أنه قال كذا وكذا قال موسى فرجع إليه المرة الآخرة ببشارة عظيمة فقال \"اذهب إليه فقل له إنك لست من أهل النار ولكنك من أهل الجنة\" تفرد به البخاري من هذا الوجه وقال الإمام أحمد حدثنا هاشم حدثنا سليمان بن المغيرة عن ثابت عن أنس بن مالك رضي الله عنه قال لما نزلت هذه الآية \"يا أيها الذين آمنوا لا ترفعوا أصواتكم فوق صوت النبي ـ إلى قوله ـ وأنتم لا تشعرون \" وكان ثابت بن قيس بن الشماس رفيع الصوت فقال أنا الذي كنت أرفع صوتي على رسول الله صلى الله عليه وسلم أنا من أهل النار حبط عملي وجلس في أهله حزينا ففقده رسول الله صلى الله عليه وسلم فانطلق بعض القوم إليه فقالوا له تفقدك رسول الله صلى الله عليه وسلم مالك؟ قال أنا الذي أرفع صوتي فوق صوت النبي صلى الله عليه وسلم وأجهر له بالقول حبط عملي أنا من أهل النار فأتوا النبي صلى الله عليه وسلم فأخبروه بما قال فقال النبي صلى الله عليه وسلم \"لا بل هو من أهل الجنة\" قال أنس رضي الله عنه فكنا نراه يمشي بين أظهرنا ونحن نعلم أنه من أهل الجنة فلما كان يوم اليمامة كان فينا بعض الانكشاف فجاء ثابت بن قيس بن شماس وقد تحنط ولبس كفنه فقال بئسما تعودون أقرانكم فقاتلهم حتى قتل رضي الله عنه وقال مسلم حدثنا أبو بكر بن أبي شيبة حدثنا الحسن بن موسى حدثتا حماد بن سلمة عن ثابت البناني عن أنس بن مالك رضي الله عنه قال لما نزلت هذه الآية \"يا أيها الذبن آمنوا لا ترفعوا أصواتكم فوق صوت النبي\" إلى آخر الآية جلس ثابت رضي الله عنه في بيته قال أنا من أهل النار واحتبس عن النبي صلى الله عليه وسلم فقال النبي صلى الله عليه وسلم لسعد بن معاذ \"يا أبا عمرو ما شأن ثابت أشتكى؟\" فقال سعد رضي الله عنه إنه لجاري وما علمت له بشكوى قال فأتاه سعد رضي الله عنه فذكر له قول رسول الله صلى الله عليه وسلم فقال ثابت رضي الله عنه أنزلت هذه الآية ولقد علمتم أني من أرفعكم صوتا على رسول الله صلى الله عليه وسلم فأنا من أهل النار فذكر ذلك سعد رضي الله عنه للنبي صلى الله عليه وسلم فقال رسول الله صلى الله عليه وسلم \"بل هو من أهل الجنة\" ثم رواه مسلم عن أحمد بن سعيد الدارمي عن حيان بن هلال عن سليمان بن المغيرة به قال ولم يذكر سعد بن معاذ رضي الله عنه وعن قطن ابن بشير عن جعفر بن سليمان عن ثابت عن أنس رضي الله عنه بنحوه وقال ليس فيه ذكر سعد بن معاذ رضي الله عنه حدثني هدبة بن عبد الأعلى الأسدي حدثنا المعتمر بن سليمان سمعت أبى يذكر عن أنس رضي الله عنه قال لما نزلت هذه الآية فاقتص الحديث ولم يذكر سعد بن معاذ رضي الله عنه وزاد: فكنا نراه يمشي بين أظهرنا رجل من أهل الجنة فهذه الطرق الثلاث معللة لرواية حماد بن سلمة فيما تفرد به من ذكر سعد بن معاذ رضي الله عنه والصحيح أن حال نزول هذه الآية لم يكن سعد بن معاذ رضي الله عنه موجودا لأنه كان قد مات بعد بني قريظة بأيام قلائل سنة خمس وهذه الآية نزلت في وفد بني تميم والوفود إنما تواتروا في سنة تسع من الهجرة والله أعلم وقال ابن جرير حدثنا أبو كريب حدثنا زيد بن الحباب حدثنا أبو ثابت بن ثابت بن قيس بن شماس حدثني عمي إسماعيل بن محمد بن ثابت بن قيس بن شماس عن أبيه رضي الله عنه قال لما نزلت هذه الآية \"لا ترفعوا أصواتكم فوق صوت النبي ولا تجهروا له بالقول\" قال قعد ثابت بن قيس رضي الله عنه في الطريق يبكي قال فمر به عاصم بن عدي من بني العجلان فقال ما يبكيك يا ثابت؟ قال هذه الآية أتخوف أن تكون نزلت في وأنا صيت رفيع الصوت قال فمضى عاصم بن عدي رضي الله عنه إلى رسول الله صلى الله عليه وسلم قال وغلبه البكاء فأتى امرأته جميلة ابنة عبدالله بن أبي بن سلول فقال لها إذا دخلت بيت فرشي فشدي على الضبة بمسمار فضربته بمسمار حتى إذا خرج عطفه وقال لا أخرج حتى يتوفاني الله تعالى أو يرضى عني رسول الله صلى الله عليه وسلم قال وأتى عاصم رضي الله عنه رسول الله صلى الله عليه وسلم فأخبره خبره فقال \"اذهب فادعه لي\" فجاء عاصم رضي الله عنه إلى المكان فلم يجده فجاء إلى أهله فوجده في بيت الفرش فقال له إن رسول الله صلى الله عليه وسلم يدعوك فقال اكسر الضبة قال فخرجا فأتيا النبي صلى الله عليه وسلم فقال له رسول الله صلى الله عليه وسلم \"ما يبكيك يا ثابت؟\" فقال رضي الله عنه أنا صيت وأتخوف أن تكون هذه الآية نزلت في \"لا ترفعوا أصواتكم فوق صوت النبي ولا تجهروا له بالقول\" فقال له النبي صلى الله عليه وسلم \"أما ترضى أن تعيش حميدا وتقتل شهيدا وتدخل الجنة؟\" فقال رضيت ببشرى الله تعالى ورسوله صلى الله عليه وسلم ولا أرفع صوتي أبدا على صوت رسول الله صلى الله عليه وسلم قال وأنزل الله تعالى \"إن الذين يغضون أصواتهم عند رسول الله أولئك الذين امتحن الله قلوبهم للتقوى\" الآية وقد ذكر هذه القصة غير واحد من التابعين كذلك فقد نهى الله عز وجل عن رفع الأصوات بحضرة رسول الله صلى الله عليه وسلم وقد روينا عن أمير المؤمنين عمر بن الخطاب رضي الله عنه أنه سمع صوت رجلين في مسجد النبي صلى الله عليه وسلم قد ارتفعت أصواتهما فجاء فقال أتدريان أين أنتما؟ ثم قال من أين أنتما؟ قالا من أهل الطائف فقال لو كنتما من أهل المدينة لأوجعتكما ضربا وقال العلماء يكره رفع الصوت عند قبره صلى الله عليه وسلم كما كان يكره في حياته عليه الصلاة والسلام لأنه محترم حيا وفي قبره صلى الله عليه وسلم دائما ثم نهى عن الجهر له بالقول كما يجهر الرجل لمخاطبه ممن عداه بل يخاطب بسكينة ووقار وتعظيم ولهذا قال تبارك وتعالى \" ولا تجهروا له بالقول كجهر بعضكم لبعض \" كما قال تعالى \"لا تجعلوا دعاء الرسول بينكم كدعاء بعضكم بعضا\" وقوله عز وجل \"أن تحبط أعمالكم وأنتم لا تشعرون\" أي إنما نهيناكم عن رفع الصوت عنده خشية أن يغضب من ذلك فيغضب الله تعالى لغضبه فيحبط عمل من أغضبه وهو لا يدري كما جاء في الصحيح \"إن الرجل ليتكلم بالكلمة من رضوان الله تعالى لا يلقي لها بالا يكتب له بها الجنة وإن الرجل ليتكلم بالكلمة من سخط الله تعالى لا يلقى لها بالا يهوي بها في النار أبعد ما بين السماء والأرض\" ثم ندب الله تعالى إلى خفض الصوت عنده وحث على ذلك وأرشد إليه ورغب فيه فقال."
    },
    {
      "ayah": 3,
      "surah": 49,
      "text": "أي أخلصها لها وجعلها أهلا ومحلا\" لهم مغفرة وأجر غطيم\" وقد قال الإمام أحمد في كتاب الزهد حدثنا عبدالرحمن حدثنا سفيان عن منصور عن مجاهد قال كتب إلى عمر يا أمير المؤمنين رجل لا يشتهي المعصية ولا يعمل بها أفضل أم رجل يشتهي المعصية ولا يعمل بها؟ فكتب عمر رضي الله عنه إن الذين يشتهون المعصية ولا يعملون بها \"أولئك الذين امتحن الله قلوبهم للتقوى لهم مغفرة وأجر عظيم\"."
    },
    {
      "ayah": 4,
      "surah": 49,
      "text": "أنه تبارك وتعالى ذم الذين ينادونه من وراء الحجرات وهي بيوت نسائه كما يصنع أجلاف الأعراب فقال \"أكثرهم لا يعقلون\" وقد ذكر أنها نزلت في الأقرع بن حابس التميمي رضي الله عنه فيما أورده غير واحد قال الإمام أحمد حدثنا عفان حدثنا وهيب حدثنا موسى بن عقبة عن أبي سلمة بن عبدالرجمن عن الأقرع بن حابس رضي الله عنه أنه نادى رسول الله صلى الله عليه وسلم فقال يا محمد يا محمد وفي رواية يا رسول الله فلم يجبه فقال يا رسول الله إن حمدي لزين وإن ذمي لشين فقال \"ذاك الله عز وجل\" ثم أرشد تعالى إلى الأدب في ذلك وقال ابن جرير حدثنا أبو عمار الحسين بن حريث المروزي حدثنا الفضل بن موسى عن الحسين بن واقد عن أبي إسحاق عن البراء في قوله تبارك وتعالى \"إن الذين ينادونك من وراء الحجرات\" قال جاء رجل إلى رسول الله صلى الله عليه وسلم فقال يا محمد إن حمدي زين وذمي شين فقال صلى الله عليه وسلم \"ذاك الله عز وجل\" وهكذا ذكره الحسن البصري وقتادة مرسلا وقال سفيان الثوري عن حبيب بن أبي عمرة قال كان بشر بن غالب ولبيد بن عطارد أو بشر بن عطارد ولبيد بن غالب وهما عند الحجاج جالسان فقال بشر بن غالب للبيد بن عطارد نزلت في قومك بني تميم \"إن الذين ينادونك من وراء الحجرات\" قال فذكرت ذلك لسعيد ابن جبير فقال أما إنه لو علم بآخر الآية أجابه \"يمنون عليك أن أسلموا\" قالوا أسلمنا ولم يقاتلك بنو أسد وقال ابن أبي حاتم حدثنا أبى حدثنا عمرو بن علي الباهلي حدثنا المعتمر بن سليمان قال سمعت داود الطائي يحدث عن أبي مسلم البجلي عن زيد بن أرقم رضي الله عنه قال: اجتمع أناس من العرب فقالوا انطلقوا بنا إلى هذا الرجل فإن يك نبيا فنحن أسعد الناس به وإن يك ملكا نعش بجناحه قال فأتيت رسول الله صلى الله عليه وسلم فأخبرته بما قالوا فجاءوا إلى حجرة النبي صلى الله عليه وسلم فجعلوا ينادونه وهو في حجرته يا محمد يا محمد فأنزل الله تعالى \"إن الذين ينادونك من وراء الحجرات أكثرهم لا يعقلون\" قال فأخذ رسول الله صلى الله عليه وسلم بأذني فمدها فجعل يقول \"لقد صدق الله تعالى قولك يا زيد لقد صدق الله قولك يا زيد\" ورواه ابن جرير عن الحسن بن عرفة عن المعتمر بن سليمان به."
    },
    {
      "ayah": 5,
      "surah": 49,
      "text": "أي لكان لهم في ذلك الخيرة والمصلحة في الدنيا والآخرة ثم قال جل ثناؤه داعيا لهم إلى التوبة والإنابة \"والله غفور رحيم\"."
    },
    {
      "ayah": 6,
      "surah": 49,
      "text": "يأمر تعالى بالتثبت في خبر الفاسق ليحتاط له لئلا يحكم بقوله فيكون في نفس الأمر كاذبا أو مخطئا فيكون الحاكم بقوله قد اقتفى وراءه وقد نهى الله عز وجل عن اتباع سبيل المفسدين ومن هنا امتنع طوائف من العلماء من قبول رواية مجهول الحال لاحتمال فسقه في نفس الأمر وقبلها آخرون لأنا إنما أمرنا بالتثبت عند خبر الفاسق وهذا ليس بمحقق الفسق لأنه مجهول الحال وقد قررنا هذه المسئلة في كتاب العلم من شرح البخاري ولله تعالى الحمد والمنة وقد ذكر كثير من المفسرين أن هذه الآية نزلت في الوليد بن عقبة بن أبي معيط حين بعثه رسول الله صلى الله عليه وسلم على صدقات بني المصطلق وقد روي ذلك من طرق ومن أحسنها ما رواه الإمام أحمد في مسنده من رواية ملك بني المصطلق وهو الحارث بن أبي ضرار والد جويرية بنت الحارث أم المؤمنين رضي الله عنها قال الإمام أحمد حدثنا محمد بن سابق حدثنا عيسى بن دينار حدثني أبي أنه سمع الحارث بن ضرار الخزاعي رضي الله عنه يقول: قدمت على رسول الله صلى الله عليه وسلم فدعاني إلى الإسلام فدخلت فيه وأقررت به ودعاني إلى الزكاة فأقررت بها وقلت يا رسول الله أرجع إليهم فأدعوهم إلى الإسلام وأداء الزكاة فمن استجاب لي جمعت زكاته وترسل إلي يا رسول الله رسولا إبان كذا وكذا ليأتيك بما جمعت من الزكاة فلما جمع الحارث الزكاة ممن استجاب له وبلغ الإبان الذي أراد رسول الله صلى الله عليه وسلم أن يبعث إليه احتبس عليه الرسول ولم يأته وظن الحارث أنه قد حدث فيه سخطة من الله تعالى ورسوله فدعا بسروات قومه فقال لهم إن رسول الله صلى الله عليه وسلم كان وقت لي وقتا يرسل إلي رسوله ليقبض ما كان عندي من الزكاة وليس من رسول الله صلى الله عليه وسلم الخلف ولاأرى حبس رسوله إلا من سخطة فانطلقوا بنا نأتي رسول الله صلى الله عليه وسلم وبعث رسول الله صلى الله عليه وسلم الوليد بن عقبة إلى الحارث ليقبض ما كان عنده مما جمع من الزكاة فلما أن سار الوليد حتى بلغ بعض الطريق فرق أي خاف فرجع حتى أتى رسول الله صلى الله عليه وسلم فقال يا رسول الله إن الحارث قد منعني الزكاة وأراد قتلي فغضب رسول الله صلى الله عليه وسلم وبعث البعث إلى الحارث رضي الله عنه وأقبل الحارث بأصحابه حتى إذا استقبل البعث وفصل عن المدينة لقيهم الحارث فقالوا هذا الحارث فلما غشيهم قال لهم إلى من بعثتم؟ قالوا إليك قال ولم؟ قالوا إن رسول الله صلى الله عليه وسلم بعث إليك الوليد بن عقبة فزعم أنك منعته الزكاة وأردت قتله قال رضي الله عنه لا والذي بعث محمدا صلى الله عليه وسلم بالحق ما رأيته بتة ولا أتاني فلما دخل الحارث على رسول الله صلى الله عليه وسلم قال \"منعت الزكاة وأردت قتل رسولي؟\" قال لا والذي بعثك بالحق ما رأيته ولا أتاني وما أقبلت إلا حين احتبس علي رسول الله صلى الله عليه وسلم خشيت أن يكون كانت سخطة من الله تعالى ورسوله قال فنزلت الحجرات \"يا أيها الذين آمنوا إن جاءكم فاسق بنبأ- إلى قوله - حكيم\" ورواه ابن أبي حاتم عن المنذر بن شاذان التمار عن محمد بن سابق به ورواه الطبراني من حديث محمد بن سابق به غير أنه سماه الحارث بن سرار والصواب أنه الحارث بن ضرار كما تقدم وقال ابن جرير حدثنا أبو كريب حدثنا جعفر بن عون عن موسى بن عبيدة عن ثابت مولى أم سلمة عن أم سلمة رضي الله عنها قالت: بعث رسول الله صلى الله عليه وسلم رجلا في صدقات بني المصطلق بعد الوقيعة فسمع بذلك القوم فتلقوه يعظمون أمر رسول الله صلى الله عليه وسلم قالت فحدثه الشيطان أنهم يريدون قتله قالت فرجع إلى رسول الله صلى الله عليه وسلم فقال إن بني المصطلق قد منعوني صدقاتهم فغضب رسول الله صلى الله عليه وسلم والمسلمون قالت فبلغ القوم رجوعه فأتوا رسول الله صلى الله عليه وسلم فصفوا له حين صلى الظهر فقالوا نعوذ بالله من سخط الله وسخط رسوله بعثت إلينا رجلا مصدقا فسررنا بذلك وقرت به أعيننا ثم إنه رجع من بعض الطريق فخشينا أن يكون ذلك غضبا من الله تعالى ومن رسوله صلى الله عليه وسلم فلم يزالوا يكلمونه حتى جاء بلال رضي الله عنه فأذن بصلاة العصر قالت ونزلت \"يا أيها الذين آمنوا إن جاءكم فاسق بنبإ فتبينوا أن تصيبوا قوما بجهالة فتصبحوا على ما فعلتم نادمين\" وروى ابن جرير أيضا من طريق العوفي عن ابن عباس رضي الله عنهما في هذه الآية قال: كان رسول في الله صلى الله عليه وسلم بعث الوليد بن عقبة بن أبي معيط إلى بني المصطلق ليأخذ منهم الصدقات وأنهم لما أتاهم الخبر فرحوا وخرجوا يتلقون رسول رسول الله صلى الله عليه وسلم وأنه لما حدث الوليد أنهم خرجوا يتلقونه رجع الوليد إلى رسول الله صلى الله عليه وسلم فقال يا رسول الله إن بني المصطلق قد منعوا الصدقة فغضب رسول الله صلى الله عليه وسلم من ذلك غضبا شديدا فبينا هو يحدث نفسه أن يغزوهم إذ أتاه الوفد فقالوا يا رسول الله إنا حدثنا أن رسولك رجع من نصف الطريق وإنا خشينا إنما رده كتاب جاء منك لغضب غضبته علينا وإنا نعوذ بالله من غضبه وغضب رسوله وإن النبي صلى الله عليه وسلم استغشهم وهم بهم فأنزل الله تبارك وتعالى عذرهم في الكتاب فقال \"يا أيها الذين آمنوا إن جاءكم فاسق بنبإ فتبينوا\" إلى آخر الآية وقال مجاهد وقتادة أرسل رسول الله صلى الله عليه وسلم الوليد بن عقبة إلى بني المصطلق ليصدقهم فتلقوه بالصدقة فرجع فقال إن بني المصطلق قد جمعت لك لتقاتلك زاد قتادة وأنهم قد ارتدوا عن الإسلام فبعث رسول الله صلى الله عليه وسلم خالد بن الوليد رضي الله عنه وأمره أن يتثبت ولا يعجل فانطلق حتى أتاهم ليلا فبعث عيونه فلمنا جاءوا اخبروا خالدا رضي الله عنه أنهم مستمسكون بالإسلام وسمعوا أذانهم وصلاتهم فلما أصبحوا أتاهم خالد رضي الله عنه فرأى الذي يعجبه فرجع إلى رسول الله صلى الله عليه وسلم فأخبره الخبر فأنزل الله تعالى هذه الآية قال قتادة فكان رسول الله صلى الله عليه وسلم يقول \"التثبت من الله والعجلة من الشيطان\" وكذا ذكر غير واحد من السلف منهم ابن أبي ليلى ويزيد بن رومان والضحاك ومقاتل بن حيان وغيرهم في هذه الآية أنها نزلت في الوليد بن عقبة والله أعلم."
    },
    {
      "ayah": 7,
      "surah": 49,
      "text": "\"واعلموا أن فيكم رسول الله\" أي اعلموا أن بين أظهركم رسول الله فعظموه ووقروه وتأدبوا معه وانقادوا لأمره فإنه أعلم بمصالحكم وأشفق عليكم منكم ورأيه فيكم أتم من رأيكم لأنفسكم كما قال تبارك وتعالى \"النبي أولى بالمؤمنين من أنفسهم\" ثم بين أن رأيهم سخيف بالنسبة إلى مراعاة مصالحهم فقال \"لو يطيعكم في كثير من الأمر لعنتم\" أي لو أطاعكم في جميع ما تختارونه لأدى ذلك إلى عنتكم وحرجكم كما قال سبحانه وتعالى \"ولو اتبع الحق أهواءهم لفسدت السموات والأرض ومن فيهن بل أتيناهم بذكرهم فهم عن ذكرهم معرضون\" وقوله عز وجل \"ولكن الله حبب إليكم الإيمان وزينه في قلوبكم\" أي حببه إلى نفوسكم وحسنه في قلوبكم قال الإمام أحمد حدثنا بهز حدثنا علي بن مسعدة حدثنا قتادة عن أنس رضي الله عنه قال كان رسول الله صلى الله عليه وسلم يقول \"الإسلام علانية والإيمان في القلب - قال ثم يشير بيده إلى صدره ثلاث مرات ثم يقول - التقوى ههنا التقوى ههنا\" \"وكره إليكم الكفر والفسوق والعصيان\" أي وبغض إليكم الكفر والفسوق وهي الذنوب الكبار والعصيان وهي جميع المعاصي وهذا تدريج لكمال النعمة وقوله تعالى \"أولئك هم الراشدون\" أي المتصفون بهذه الصفة هم الراشدون الذين قد آتاهم الله رشدهم قال الإمام أحمد حدثنا مروان بن معاوية الفزاري حدثنا عبد الواحد بن أيمن المكي عن أبي رفاعة الزرقي عن أبيه قال لما كان يوم أحد وانكفأ المشركون قال رسول الله صلى الله عليه وسلم \"استووا حتى أثني على ربي عز وجل\" فصاروا خلفه صفوفا فقال صلى الله عليه وسلم \"اللهم لك الحمد كله اللهم لا قابض لما بسطت ولا باسط لما قبضت ولا هادي لمن أضللت ولا مضل لمن هديت ولا معطي لما منعت ولا مانع لما أعطيت ولا مقرب لما باعدت ولا مباعد لما قربت اللهم ابسط علينا من بركاتك ورحمتك وفضلك ورزقك اللهم إني أسألك النعيم المقيم الذي لا يحول ولا يزول اللهم إني أسألك النعيم يوم العيلة والأمن يوم الخوف اللهم إنى عائذ بك من شر ما أعطيتنا ومن شر ما منعتنا اللهم حبب إلينا الإيمان وزينه في قلوبنا وكره إلينا الكفر والفسوق والعصيان واجعلنا من الراشدين اللهم توفنا مسلمين وأحينا مسلمين وألحقنا بالصالحين غير خزايا ولا مفتونين اللهم قاتل الكفرة الذين يكذبون رسلك ويصدون عن سبيلك واجعل عليهم رجزك وعذابك اللهم قاتل الكفرة الذين أوتوا الكتاب إله الحق\" ورواه النسائي في اليوم والليلة عن زياد بن أيوب عن مروان بن معاوية عن عبد الواحد بن أيمن عن عبيد بن رفاعة عن أبيه به وفي الحديث المرفوع \"من سرته حسنته وساءته سيئته فهو مؤمن\"."
    },
    {
      "ayah": 8,
      "surah": 49,
      "text": "أي هذا العطاء الذي منحكموه هو فضل منه عليكم ونعمة من لدنه \"والله عليم حكيم\" أي عليم بمن يستحق الهداية ممن يستحق الغواية حكيم في أقواله وأفعاله وشرعه وقدره."
    },
    {
      "ayah": 9,
      "surah": 49,
      "text": "يقول تعالى آمرا بالإصلاح بين الفئتين الباغيتين بعضهم على بعض \"وإن طائفتان من المؤمنين اقتتلوا فأصلحوا بينهما\" فسماهم مؤمنين مع الاقتتال بهذا استدل البخاري وغيره على أنه لا يخرج عن الإيمان بالمعصية وإن عظمت لا كما يقوله الخوارج ومن تابعهم من المعتزلة ونحوهم وهكذا ثبت في صحيح البخاري من حديث الحسن عن أبي بكرة رضي الله عنه قال إن رسول الله صلى الله عليه وسلم خطب يوما ومعه على المنبر الحسن بن علي رضي الله عنهما فجعل ينظر إليه مرة وإلى الناس أخرى ويقول \"إن ابني هذا سيد ولعل الله تعالى أن يصلح به بين فئتين عظيمتين من المسلمين\" فكان كما قال صلى الله عليه وسلم أصلح الله تعالى به بين أهل الشام وأهل العراق بعد الحروب الطويلة والواقعات المهولة وقوله تعالى \" فإن بغت إحداهما على الأخرى فقاتلوا التي تبغي حتى تفيء إلى أمر الله\" أي حتى ترجع إلى أمر الله ورسوله وتسمع للحق وتطيعه كما ثبت في الصحيح عن أنس رضي الله عنه أن رسول الله صلى الله عليه وسلم قال \"انصر أخاك ظالما أو مظلوما\" قلت يا رسول الله هذا نصرته مظلوما فكيف أنصره ظالما؟ قال صلى الله عليه وسلم: \"تمنعه من الظلم فذاك نصرك إياه\" وقال الإمام أحمد حدثنا عارم حدثنا معتمر قال سمعت أبي يحدث أن أنسا رضي الله عنه قال: قيل للنبي صلى الله عليه وسلم لو أتيت عبدالله بن أبي فانطلق إليه النبي صلى الله عليه وسلم وركب حمارا وانطلق المسلمون يمشون وهي أرض سبخة فلما انطلق النبي صلى الله عليه وسلم إليه قال: إليك عني فوالله لقد آذانى ريح حمارك فقال رجل من الأنصار والله لحمار رسول الله صلى الله عليه وسلم أطيب ريحا منك قال فغضب لعبدالله رجال من قومه فغضب لكل واحد منهما أصحابه قال فكان بينهم ضرب بالجريد والأيدي والنعال فبلغنا أنه أنزلت فيهم \"وإن طائفتان من المؤمنين اقتتلوا فأصلحوا بينهما\" ورواه البخاري في الصلح عن مسدد ومسلم في المغازي عن محمد بن عبد الأعلى كلاهما عن المعتمر بن سليمان عن أبيه به نحوه وذكر سعيد بن جبير أن الأوس والخزرج كان بينهما قتال بالسعف والنعال فأنزل الله تعالى هذه الآية فأمر بالصلح بينهما وقال السدي كان رجلا من الأنصار يقال له عمران كانت له امرأة تدعى أم زيد وإن المرأة أرادت أن تزور أهلها فحبسها زوجها وجعلها في علية له لا يدخل عليها أحد من أهلها وإن المرأة بعثت إلى أهلها فجاء قومها وأنزلوها لينطلقوا بها وإن الرجل كان قد خرج فاستعان أهل الرجل فجاء بنو عمه ليحولوا بين المرأة وبين أهلها فتدافعوا واجتلدوا بالنعال فنزلت فيهم هذه الآية فبعث إليهم رسول الله صلى الله عليه وسلم وأصلح بينهم وفاءوا إلى أمر الله تعالى وقوله عز وجل \"فإن فاءت فأصلحوا بينهما بالعدل وأقسطوا إن الله يحب المقسطين\" أي اعدلوا بينهما فيما كان أصاب بعضهم لبعض بالقسط وهو العدل \"إن الله يحب المقسطين\" قال ابن أبي حاتم حدثنا أبو زرعة حدثنا محمد بن أبي بكر المقدمي حدثنا عبد الأعلى عن معمر عن الزهري عن سعيد بن المسيب عن عبدالله بن عمرو رضي الله عنهما قال إن رسول الله صلى الله عليه وسلم قال \"إن المقسطين في الدنيا على منابر من لؤلؤ بين يدي الرحمن عز وجل بما أقسطوا في الدنيا\" ورواه النسائي عن محمد بن المثنى عن عبد الأعلى به وهذا إسناده جيد قوي رجاله على شرط الصحيح وحدثنا محمد بن عبدالله بن يزيد حدثنا سفيان بن عيينة عن عمرو بن دينار عن عمرو بن أوس عن عبدالله بن عمرو رضي الله عنهما عن النبي صلى الله عليه وسلم قال \"المقسطون عند الله تعالى يوم القيامة على منابر من نور على يمين العرش الذين يعدلون في حكمهم وأهاليهم وما ولوا\" ورواه مسلم والنسائي من حديث سفيان بن عيينة به."
    }
  ]
}
