{
  "ayahs": [
    {
      "ayah": 1,
      "surah": 50,
      "text": "سورة ق: هذء السورة هي أول الحزب المفصل على الصحيح وقيل من الحجرات وأما ما يقوله العوام إنه من\"عم\" فلا أصل له ولم يقله أحد من العلماء رضي الله عنهم المعتبرين فيما نعلم والدليل على أن هذه السورة هي أول المفصل ما رواه أبو داود في سننه باب تحزيب القرآن ثم قال حدثنا مسدد حدثنا قراب بن تمام وحدثنا عبدالله بن سعيد أبو سعد الأشج حدثنا أبو خالد ثنا سليمان بن حبان وهذا لفظه عن عبدالله بن عبدالرحمن بن يعلى عن عثمان بن عبدالله بن أوس عن جده قال عبدالله بن سعيد حدثنيه أوس بن حذيفة ثم اتفقا قال قدمنا على رسول الله صلى الله عليه وسلم في وفد ثقيف قال فنزلت الأحلاف على المغيرة بن شعبة رضي الله عنه وأنزل رسول الله صلى الله عليه وسلم بني مالك فى قبة له قال مسدد وكان في الوفد الذين قدموا على رسول الله صلى الله عليه وسلم من ثقيف قال كان رسول الله صلى الله عليه وسلم كل ليلة يأتينا بعد العشاء يحدثنا قال أبو سعيد قائما على رجله حتى يراوح بين رجليه من طول القيام فأكثر ما يحدثنا صلى الله عليه وسلم ما لقي من قومه قريش ثم يقول صلى الله عليه وسلم\" لا أساء وكنا مستضعفين مستذلين- قال مسدد بمكة- فلما خرجنا إلى المدينة كانت الحرب سجالا بيننا وبينهم ندال عليهم ويدالون علينا\" فلما كانت ليلة أبطأ عنا صلى الله عليه وسلم عن الوقت الذي كان يأتينا فيه فقلنا لقد أبطأت علينا الليلة قال صلى الله عليه وسلم\" إنه طرأ علي حزبي من القرآن فكرهت أن أجيء حتى أتمه\" قال أوس سألت أصحاب رسول الله صلى الله عليه وسلم كيف يحزبون القرآن فقالوا ثلاث وخمس وسبع وتسع وإحدى عشرة وثلاث عشرة وحزب المفصل وحده ورواه ابن ماجة عن أبي بكر بن أبي شيبة عن أبي خالد الأحمر به ورواه الإمام أحمد عن عبدالرحمن بن مهدي عن عبدالله بن عبدالرحمن هو ابن يعلى الطائفي به إذا علم هذا فإذا عددت ثمانيا وأربعين سورة فالتي بعدهن سورة ق بيانه ثلاث: البقرة وآل عمران والنساء وخمس: المائدة والأنعام والأعراف والأنفال وبراءة وسبع: يونس وهود ويوسف والرعد وإبراهيم والحجر والنحل وتسع: سبحان والكهف ومريم وطه والأنبياء والحج والمؤمنون والنور والفرقان وإحدى عشرة: الشعراء والنمل والقصص والعنكبوت والروم ولقمان وألم السجدة والأحزاب وسبأ وفاطر ويس وثلاث عشرة: الصافات وص والزمر وغافر وحم السجدة وحم عسق والزخرف والدخان والجاثية والأحقاف والقتال والفتح والحجرات ثم بعد ذلك الحزب المفصل كما قاله الصحابة رضي الله عنهم فتعين أن أوله سورة ق وهو الذي قلناه ولله الحمد والمنة قال الإمام أحمد حدثنا عبدالرحمن بن مهدي حدثنا مالك عن ضمرة بن سعيد عن عبدالله بن عبدالله أن عمر بن الخطاب سأل أبا واقد الليثي ما كان رسول الله صلى الله عليه وسلم يقرأ في العيد؟ قال بقاف واقتربت ورواه مسلم وأهل السنن الأربعة من حديث مالك به وفي رواية لمسلم عن مالك عن ضمرة عن عبدالله عن أبي واقد قال سألني عمر رضي الله عنه فذكره. \" حديث آخر\" وقال أحمد حدثنا يعقوب حدثنا أبي ثنا أبي إسحاق حدثني عبدالله بن محمد بن أبي بكر بن عمرو بن حزم عن يحيى بن عبدالله بن عبدالرحمن بن أسعد بن زرارة عن أم هشام بنت حارثة قالت لقد كان تنورنا وتنور النبي صلى الله عليه وسلم واحدا سنتين أو سنة وبعض سنة وما أخذت\" ق والقرآن المجيد\" إلا على لسان رسول الله صلى الله عليه وسلم كان يقرؤها كل يوم جمعة على المنبر إذا خطب الناس رواه مسلم من حديث ابن إسحاق به وقال أبو داود حدثنا محمد بن بشار حدثنا محمد بن جعفر حدثنا شعبة عن حبيب بن عبدالله بن محمد بن معن عن ابنة الحارث بن النعمان قالت ما حفظت ق إلا من في رسول الله صلى الله عليه وسلم يخطب بها كل جمعة قالت وكان تنورك وتنور رسول الله صلى الله عليه وسلم واحدا وكذا رواه مسلم والنسائي وابن ماجة من حديث شعبة به والقصد أن رسول الله صلى الله عليه وسلم كان يقرأ بهذه السورة في المجامع الكبار كالعيد والجمع لاشتمالها على ابتداء الخلق والبعث والنشور والمعاد والقيام والحساب والجنة والنار والثواب والعقاب والترغيب والترهيب والله أعلم. \"ق\" حرف من حروف الهجاء المذكورة في أوائل السور كقوله تعالى \"ص - ون - والم - وحم - وطس\" ونحو ذلك قاله مجاهد وغيره وقد أسلفنا الكلام عليها في أول سورة البقرة بما أغنى عن إعادته وقد روي عن بعض السلف أنهم قالوا ق جبل محيط بجميع الأرض يقال له جبل قاف وكأن هذا والله أعلم من خرافات بني إسرائيل التي أخذها عنهم بعض الناس لما رأى من جواز الرواية عنهم مما لا يصدق ولا يكذب وعندي أن هذا وأمثاله وأشباهه من اختلاق بعض زنادقتهم يلبسون به على الناس أمر دينهم كما افتري في هذه الأمة مع جلالة قدر علمائها وحفاظها وأئمتها أحاديث عن النبي صلى الله عليه وسلم وما بالعهد من قدم فكيف بأمة بني إسرائيل مع طول المدى وقلة الحفاظ النقاد فيهم وشربهم الخمور وتحريف علمائهم الكلم عن مواضعه وتبديل كتب الله وآياته وإنما أباح الشارع الرواية عنهم في قوله \"وحدثوا عن بني إسرائيل ولا حرج\" فيما قد يجوزه العقل فأما فيما تحيله العقول ويحكم فيه بالبطلان ويغلب على الظنون كذبه فليس من هذا القبيل والله أعلم وقد أكثر كثير من السلف من المفسرين وكذا طائفة كثيرة من الخلف من الحكاية عن كتب أهل الكتاب في تفسير القرآن المجيد وليس بهم احتياج إلى أخبارهم ولله الحمد والمنة حتى إن الإمام أبا محمد عبدالرحمن بن أبي حاتم الرازي رحمه الله عليه أورد ههنا أثرا غريبا لا يصح سنده عن ابن عباس رضي الله عنهما فقال حدثنا أبي قال حدثت عن محمد بن إسماعيل - المخزومي حدثنا ليث بن أبي سليم عن مجاهد عن ابن عباس رضي الله عنهما قال: خلق الله تبارك وتعالى من وراء هذه الأرض بحرا محيطا بها ثم خلق من وراء ذلك البحر جبلا يقال له قاف سماء الدنيا مرفوعة عليه ثم خلق الله تعالى من وراء ذلك الجبل أرضا مثل تلك الأرض سبع مرات ثم خلق من وراء ذلك بحرا محيطا بها ثم خلق من وراء ذلك جبلا يقال له قاف السماء الثانية مرفوعة عليه حتى عد سبع أرضين وسبعة أبحر وسبعة أجبل وسبع سموات قال وذلك قوله تعالى \"والبحر يمده من بعده سبعة أبحر\" فإسناد هذا الأثر فيه انقطاع والذي رواه علي بن أبي طلحة عن ابن عباس رضي الله عنهما في قوله عز وجل \"ق\" هو اسم من أسماء الله عز وجل والذي ثبت عن مجاهد أنه حرف من حروف الهجاء كقوله تعالى \"ص - ن - حم - طس - الم\" ونحو ذلك فهذه تبعد ما تقدم عن ابن عباس رضي الله عنهما وقيل المرد قضي الأمر والله وأن قوله جل ثناؤه \"ق\" دلت على المحذوف من بقية الكلمة كقول الشاعر: قلت لها قفي فقالت ق وفي هذا التفسير نظر لأن الحذف في الكلام إنما يكون إذا دل دليل عليه ومن أين يفهم هذا من ذكر هذا الحرف؟ وقوله تعالى \"والقرآن المجيد\" أي الكريم العظيم الذي \"لا يأتيه الباطل من بين يديه ولا من خلفه تنزيل من حكيم حميد\" واختلفوا في جواب القسم ما هو؟ فحكى ابن جرير عن بعض النحاة أنه قوله تعالى \"قد علمنا ما تنقص الأرض منهم وعندنا كتاب حفيظ\" وفي هذا نظر بل الجواب هو مضمون الكلام بعد القسم وهو إثبات النبوة وإثبات المعاد وتقريره وتحقيقه وإن لم يكن القسم يتلقى لفظا وهذا كثير في أقسام القرآن كما تقدم في قوله \" ص والقرآن ذي الذكر بل الذين كفروا فى عزة وشقاق\"."
    },
    {
      "ayah": 10,
      "surah": 50,
      "text": "أى طوال شاهقات قال ابن عباس رضي الله عنهما ومجاهد وعكرمة والحسن وقتادة والسدي وغيرهم الباسقات الطوال \"لها طلع نضيد\" أي منضود."
    },
    {
      "ayah": 11,
      "surah": 50,
      "text": "أي للخلق \"وأحيينا به بلدة ميتا\" وهي الأرض التي كانت هامدة فلما نزل عليها الماء اهتزت وربت وأنبتت من كل زوح بهيج من أزاهير وغير ذلك مما يحار الطرف في حسنها وذلك بعدما كانت لا نبات بها فأصبحت تهتز خضراء فهذا مثال للبعث بعد الموت والهلاك كذلك يحيى الله الموتى وهذا المشاهد من عظيم قدرته بالحس أعظم مما أنكره الجاحدون للبعث كقوله عز وجل \"لخلق السموات والأرض أكبر من خلق الناس\" وقوله تعالى \"أو لم يروا أن الله الذي خلق السموات والأرض ولم يعي بخلقهن بقادر على أن يحيى الموتى بلى إنه على كل شيء قدير\" وقال سبحانه وتعالى \"ومن آياته أنك نرى الأرض خاشعة فإذا أنزلنا عليها الماء اهتزت وربت إن الذي أحياها لمحيي الموتى إنه على كل شيء قدير\"."
    },
    {
      "ayah": 12,
      "surah": 50,
      "text": "يقول تعالى متهددا لكفار قريش بما أحله بأشباههم ونظرائهم وأمثالهم من المكذبين قبلهم من النقمات والعذاب الأليم في الدنيا كقوم نوح وما عذبهم الله تعالى به من الغرق العام لجميع أهل الأرض وأصحاب الرس وقد تقدمت قصتهم في سورة الفرقان \"وثمود وعاد وفرعون وإخوان لوط\" وهم أمته الذين بعث إليهم من أهل سدوم ومعاملتها من الغور وكيف خسف الله تعالى بهم الأرض وأحال أرضهم بحيرة منتنة خبيثة بكفرهم وطغيانهم ومخالفتهم الحق."
    },
    {
      "ayah": 13,
      "surah": 50,
      "text": "يقول تعالى متهددا لكفار قريش بما أحله بأشباههم ونظرائهم وأمثالهم من المكذبين قبلهم من النقمات والعذاب الأليم في الدنيا كقوم نوح وما عذبهم الله تعالى به من الغرق العام لجميع أهل الأرض وأصحاب الرس وقد تقدمت قصتهم في سورة الفرقان \"وثمود وعاد وفرعون وإخوان لوط\" وهم أمته الذين بعث إليهم من أهل سدوم ومعاملتها من الغور وكيف خسف الله تعالى بهم الأرض وأحال أرضهم بحيرة منتنة خبيثة بكفرهم وطغيانهم ومخالفتهم الحق."
    },
    {
      "ayah": 14,
      "surah": 50,
      "text": "وهم قوم شعيب عليه الصلاة والسلام \"وقوم تبع\" هو اليماني وقد ذكرنا من شأنه في سورة الدخان ما أغنى عن إعادته ههنا ولله الحمد والشكر \"كل كذب الرسل\" أي كل من هذه الأمم وهؤلاء القرون كذب رسولهم ومن كذب رسولا فكأنما كذب جميع الرسل كقوله جل وعلا \"كذبت قوم نوح المرسلين\" وإنما جاءهم رسول واحد فهم في نفس الأمر لو جاءهم جميع الرسل كذبوهم \"فحق وعيد\" أي فحق عليهم ما أوعدهم الله تعالى على التكذيب من العذاب والنكال فليحذر المخاطبون أن يصيبهم ما أصابهم فإنهم قد كذبوا رسولهم كما كذب أولئك."
    },
    {
      "ayah": 15,
      "surah": 50,
      "text": "أي أفأعجزنا ابتداء الخلق حتى هم في شك من الإعادة؟ \"بل هم في لبس من خلق جديد\" والمعنى أن ابتداء الخلق لم يعجزنا والإعادة أسهل منه كما قال عز وجل \"وهو الذي يبدأ الخلق ثم يعيده وهو أهون عليه\" وقال الله جل جلاله \"وضرب لنا مثلا ونسي خلقه قال من يحيى العظام وهي رميم قل يحيها الذي أنشأها أول مرة وهو بكل خلق عليم\" وقد تقدم الصحيح \"يقول الله تعالى يؤذيني ابن آدم يقول لن يعيدني كما بدأني وليس أول الخلق بأهون علي من إعادته\"."
    },
    {
      "ayah": 16,
      "surah": 50,
      "text": "يخبر تعالى عن قدرته على الإنسان بأنه خالقه وعمله محيط بجميع أموره حتى إنه تعالى يعلم ما توسوس به نفوس بني آدم من الخير والشر وقد ثبت في الصحيح عن رسول الله صلى الله عليه وسلم أنه قال \"إن الله تعالى تجاوز لأمتي ما حدثت به أنفسها ما لم تقل أو تعمل\" وقوله عز وجل \"ونحن أقرب إليه من حبل الوريد\" يعني ملائكته تعالى أقرب إلى الإنسان من حبل وريده إليه ومن تأوله على العلم فإنما فر لئلا يلزم حلول أو اتحاد وهما منفيان بالإجماع تعالى الله وتقدس ولكن الله لا يقتضيه فإنه لم يقل وأنا أقرب إليه من حبل الوريد وإنما قال \"ونحن أقرب إليه من حبل الوريد\" كما قال في المحتضر \"ونحن أقرب إليه منكم ولكن لا تبصرون\" يعني ملائكته وكما قال تبارك وتعالى \"إنا نحن نزلنا الذكر وإنا له لحافظون\" فالملائكة نزلت بالذكر وهو القرآن بإذن الله عز وجل وكذلك الملائكة أقرب إلى الإنسان من حبل وريده إليه بإقدار الله جل وعلا لهم على ذلك فللملك لمة من الإنسان كما أن للشيطان لمة وكذلك الشيطان يجري من ابن آدم يجرى الدم كما أخبر بذلك الصادق المصدوق."
    },
    { "ayah": 17, "surah": 50, "text": "يعنى الملكين اللذين يكتبان عمل الإنسان \"عن اليمين وعن الشمال\" أي مترصد." },
    {
      "ayah": 18,
      "surah": 50,
      "text": "\"ما يلفظ \"أي ابن آدم\"من قول\" أي ما يتكلم بكلمة \"إلا لديه رقيب عتيد\" أي إلا ولها من يرقبها معد لذلك يكتبها لا يترك كلمة ولا حركة كما قال تعالى \"وإن عليكم لحافظين كراما كاتبين يعلمون ما تفعلون\" وقد اختلف العلماء هل يكتب الملك كل شيء من الكلام؟ وهو قول الحسن وقتادة أو إنما يكتب ما فيه ثواب وعقاب كما هو قول ابن عباس رضي الله عنهما؟ على قولين وظاهر الآية الأول لعموم قوله تبارك وتعالى \" ما يلفظ من قول إلا لديه رقيب عتيد\" وقد قال الإمام أحمد حدثنا أبو معاوية حدثنا محمد بن عمرو بن علقمة الليثي عن أبيه عن جده علقمة عن بلال بن الحارث المزني رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: \"إن الرجل ليتكلم بالكلمة من رضوان الله تعالى ما يظن أن تبلغ ما بلغت يكتب الله عز وجل له بها رضوانه إلى يوم يلقاه وإن الرجل ليتكلم بالكلمة من سخط الله تعالى ما يظن أن تبلغ ما بلغت يكتب الله تعالى عليه بها سخطه إلى يوم يلقاه\" فكان علقمة يقول كم من كلام قد منعنيه حديث بلال بن الحارث ورواه الترمذي والنسائي وابن ماجة من حديث محمد بن عمرو به وقال الترمذي حسن صحيح وله شاهد في الصحيح وقال الأحنف بن قيس: صاحب اليمين يكتب الخير وهو أمين على صاحب الشمال فإن أصاب العبد خطيئة قال له أمسك فإن استغفر الله تعالى نهاه أن يكتبها وإن أبى كتبها رواه ابن أبي حاتم وقال الحسن البصري وتلا هذه الآية \"عن اليمين وعن الشمال قعيد\" يا ابن ادم بسطت لك صحيفة ووكل بك ملكان كريمان أحدهما عن يمينك الآخر عن شمالك فأما الذي عن يمينك فيحفظ حسناتك وأما الذي عن يسارك فيحفظ سيئاتك فاعمل ما شئت أقلل أو أكثر حتى إذا مت طويت صحيفتك وجعلت في عنقك معك في قبرك حتى تخرج يوم القيامة فعند ذلك يقول تعالى \" وكل إنسان ألزمناه طائره في عنقه ونخرج له يوم القيامة كتابا يلقاه منشورا اقرأ كتابك كفى بنفسك اليوم عليك حسيبا\" ثم يقول عدل والله فيك من جعلك حسيب نفسك وقال علي بن أبي طلحة عن ابن عباس رضي الله عنهما \"ما يلفظ من قول إلا لديه رقيب عتيد\" قال يكتب كل ما تكلم به من خير أو شر حتى إنه ليكتب قوله أكلت شربت ذهبت جئت رأيت حتى إذا كان يوم الخميس عرض قوله وعمله فأقر منه ما كان فيه من خير أو شر وألقى سائره وذلك قوله تعالى \"يمحو الله ما يشاء ويثبت وعنده أم الكتاب\" وذكر عن الإمام أحمد أنه كان يئن في مرضه فبلغه عن طاوس أنه قال يكتب الملك كل شيء حتى الأنين فلم يئن أحمد حتى مات رحمه الله."
    },
    {
      "ayah": 19,
      "surah": 50,
      "text": "يقول عز وجل وجاءت أيها الإنسان سكرة الموت بالحق أي كشفت لك عن اليقين الذي كنت تمتري فيه \" ذلك ما كنت منه تحيد\" أي هذا هو الذي كنت تفر منه قد جاءك فلا محيد ولا مناص ولا فكاك ولا خلاص وقد اختلف المفسرون في المخاطب بقوله \"وجاءت سكرة الموت بالحق ذلك ما كنت منه تحيد\" فالصحيح أن المخاطب بذلك الإنسان من حيث هو وقيل الكافر وقيل غير ذلك وقال أبو بكر بن أبي الدنيا حدثنا إبراهيم بن زياد سبلان اخبرنا عباد بن عباد عن محمد بن عمرو بن علقمة عن أبيه عن جده علقمة بن وقاص قال إن عائشة رضي الله عنها قالت حضرت أبى رضي الله عنه وهو يموت وأنا جالسة عند رأسه فأخذ غشية فتمثلت ببيت من الشعر: من لا يزال دمعه مقنعا فإنه لا بد مرة مدفوق قالت فرفع رضي الله عنه رأسه فقال يا بنية ليس كذلك ولكن كما قال تعالى \"وجاءت سكرة الموت بالحق ذلك ما كنت منه تحيد\" وحدثنا خلف بن هشام حدثنا أبو شهاب الخياط عن إسماعيل بن أبي خالد عن البهي قال لما أن ثقل أبو بكر رضي الله عنه جاءت عائشة رضي الله عنها فتمثلت بهذا البيت لعمرك ما يغني الثراء عن الفتى إذا حشرجت يوما وضاق بها الصدر فكسف عن وجهه وقال رضي الله عنه ليس كذلك ولكن قولي \"وجاءت سكرة الموت بالحق ذلك ما كنت منه تحيد\" وقد أوردت لهذا الأثر طرقا كثيرة في سيرة الصديق رضي الله عنه عند ذكر وفاته وقد ثبت في الصحيح عن النبي صلى الله عليه وسلم أنه لما تغشاه الموت جعل يمسح العرق عن وجهه ويقول \"سبحان الله إن للموت لسكرات\" وفي قوله \"ذلك ما كنت منه تحيد\" قولان \"أحدهما \"أن ما ههنا موصولة أي الذي كنت منه تحيد بمعنى تبتعد وتتناءى وتفر قد حل بك ونزل بساحتك \" والقول الثاني \"أن ما نافية بمعنى ذلك ما كنت تقدر على الفراق منه ولا الحيد عنه وقد قال الطبراني في المعجم الكبير حدثنا مؤمل بن علي الصائغ المكي حدثنا حفص عن ابن عمر الحدي حدثنا معاذ بن محمد الهذلي عن يونس بن عبيد عن الحسن عن سمرة قال: قال رسول الله صلى الله عليه وسلم \"مثل الذي يفر من الموت مثل الثعلب تطلبه الأرض بدين فجاء يسعى حتى إذا أعيا وأسهر دخل جحره وقالت له الأرض يا ثعلب ديني فخرج وله حصاص فلم يزل كذلك حتى تقطعت عنقه ومات\" ومضمون هذا المثل كما لا انفكاك له ولا محيد عن الأرض كذلك الإنسان لا محيد له عن الموت وقوله تبارك وتعالى \"ونفخ في الصور ذلك يوم الوعيد\" قد تقدم الكلام على حديث النفخ في الصور والفزع والصعق والبعث وذلك يوم القيامة وفي الحديث أن رسول الله صلى الله عليه وسلم قال \"كيف أنعم وصاحب هذا القرن قد التقم القرن وحنى جبهته وانتظر أن يؤذن له\" قالوا يا رسول الله كيف نقول؟ قال صلى الله عليه وسلم \"قولوا حسبنا الله ونعم الوكيل\" فقال القوم حسبنا الله ونعم الوكيل."
    },
    {
      "ayah": 2,
      "surah": 50,
      "text": "وقال ههنا \"بل عجبوا أن جاءهم منذر منهم فقال الكافرون هذا شيء عجيب\" أي تعجبوا من إرسال رسول إليهم من البشر كقوله جل جلاله \"أكان للناس عجبا أن أوحينا إلى رجل منهم أن أنذر الناس\" أي وليس هذا بعحيب فإن الله يصطفي من الملائكة رسلا ومن الناس. ثم قال عز وجل مخبرا عنهم في تعجبهم أيضا من المعاد واستبعادهم لوقوعه."
    },
    {
      "ayah": 20,
      "surah": 50,
      "text": "قد تقدم الكلام على حديث النفخ في الصور والفزع والصعق والبعث وذلك يوم القيامة وفي الحديث أن رسول الله صلى الله عليه وسلم قال \"كيف أنعم وصاحب هذا القرن قد التقم القرن وحنى جبهته وانتظر أن يؤذن له\" قالوا يا رسول الله كيف نقول؟ قال صلى الله عليه وسلم \"قولوا حسبنا الله ونعم الوكيل\" فقال القوم حسبنا الله ونعم الوكيل."
    },
    {
      "ayah": 21,
      "surah": 50,
      "text": "\"وجاءت كل نفس معها سائق وشهيد\" أي ملك يسوقه إلى المحشر وملك يشهد عليه بأعماله هذا هو الظاهر من الآية الكريمة. وهو اختيار ابن جرير ثم روى من حديث إسماعيل بن أبى خالد عن يحيى بن رافع مولى لثقيف قال سمعت عثمان بن عفان رضي الله عنه يخطب فقرأ هذه الآية \"وجاءت كل نفس معها سائق وشهيد\" فقال سائق يسوقها إلى الله تعالى وشاهد يشهد عليها بما عملت وكذا قال مجاهد وقتادة وابن زيد وقال مطرف عن أبي جعفر مولى أشجع عن أبي هريرة رضي الله عنه قال السائق الملك والشهيد العمل وكذا قال الضحاك والسدي وقال العوفي عن ابن عباس رضي الله عنهما السائق من الملائكة والشهيد الإنسان نفسه يشهد على نفسه وبه قال الضحاك بن مزاحم."
    },
    {
      "ayah": 22,
      "surah": 50,
      "text": "حكى ابن جرير ثلاثة أقوال في المراد بهذا الخطاب في قوله تعالى \"لقد كنت في غفلة من هذا فكشفنا عنك غطاءك فبصرك اليوم حديد أحدها أن المراد بذلك الكافر رواه علي بن أبي طلحة عن ابن عباس رضي الله عنهما وبه يقول الضحاك بن مزاحم وصالح بن كيسان والثاني أن المراد بذلك كل أحد من بر وفاجر لأن الآخرة بالنسبة إلى الدنيا كاليقظة والدنيا كالمنام وهذا أختيار ابن جري ونقله عن حسين بن عبدالله بن عبيدالله عن عبدالله بن عباس رضي الله عنهما والثالث أن المخاطب بذلك النبي صلى الله عليه وسلم ربه يقول زيد بن أسلم وابنه والمعنى على قولهما لقد كنت في غفلة من هذا القرآن قبل أن يوحى إليك فكشفنا عنك غطاءك بإنزاله إليك فبصرك اليوم حديد والظاهر من السياق خلاف هذا بل الخطاب مع الإنسان من حيث هو والمراد بقوله تعالى \" لقد كنت في غفلة من هذا\" يعني من هذا اليوم \"فكشفنا عنك غطاءك فبصرك اليوم حديد\" أي قوي لأن كل أحد يوم القيامة يكون مستبصرا حتى الكفار في الدنيا يكونون يوم القيامة على الاستقامة لكن لا ينفعهم ذلك قال الله تعالى \"أسمع بهم وأبصر يوم يأتوننا\" وقال عز وجل \"ولو ترى إذ المجرمون ناكسو رءوسهم عند ربهم ربنا أبصرنا وسمعنا فارجعنا نعمل صالحا إنا موقنون\"."
    },
    {
      "ayah": 23,
      "surah": 50,
      "text": "يقول تعالى مخبرا عن الملك الموكل بعمل ابن آدم أنه يشهد عليه يوم القيامة بما فعل ويقول \"هذا ما لدي عتيد\" أي معتد محضر بلا زيادة ولا نقصان وقال مجاهد هذا كلام الملك السائق يقول هذا ابن آدم الذي وكلتني به قد أحضرته وقد اختار ابن جرير أن يعم السائق والشهيد وله اتجاه وقوة فعند ذلك يحكم الله تعالى في الخليفة بالعدل فيقول \"ألقيا في جهنم كل كفار عنيد\" وقد اختلف النحاة في قوله \"ألقيا\" فقال بعضهم هي لغة لبعض العرب يخاطبون المفرد بالتثنية كما روي عن الحجاج أنه كان يقول يا حرسي اضربا عنقه ومما أنشد ابن جرير على هذه قول الشاعر فإن تزجراني يا ابن عفان أنزجر وإن تتركاني أحم عرضا ممنعا وقيل بل هي نون التأكيد سهلت إلى الألف وهذا بعيد لأن هذا إنما يكون في الوقف والظاهر أنها مخاطبة مع السائق والشهيد فالسائق أحضره إلى عرصة الحساب فلما أدى الشهيد عليه أمرهما الله تعالى بإلقائه في نار جهنم وبئس المصير \"ألقيا في جهنم كل كفار عنيد\" أي كثير الكفر والتكذيب بالحق عنيد معارض للحق معارض له بالباطل مع علمه بذلك."
    },
    {
      "ayah": 24,
      "surah": 50,
      "text": "يقول تعالى مخبرا عن الملك الموكل بعمل ابن آدم أنه يشهد عليه يوم القيامة بما فعل ويقول \"هذا ما لدي عتيد\" أي معتد محضر بلا زيادة ولا نقصان وقال مجاهد هذا كلام الملك السائق يقول هذا ابن آدم الذي وكلتني به قد أحضرته وقد اختار ابن جرير أن يعم السائق والشهيد وله اتجاه وقوة فعند ذلك يحكم الله تعالى في الخليفة بالعدل فيقول \"ألقيا في جهنم كل كفار عنيد\" وقد اختلف النحاة في قوله \"ألقيا\" فقال بعضهم هي لغة لبعض العرب يخاطبون المفرد بالتثنية كما روي عن الحجاج أنه كان يقول يا حرسي اضربا عنقه ومما أنشد ابن جرير على هذه قول الشاعر فإن تزجراني يا ابن عفان أنزجر وإن تتركاني أحم عرضا ممنعا وقيل بل هي نون التأكيد سهلت إلى الألف وهذا بعيد لأن هذا إنما يكون في الوقف والظاهر أنها مخاطبة مع السائق والشهيد فالسائق أحضره إلى عرصة الحساب فلما أدى الشهيد عليه أمرهما الله تعالى بإلقائه في نار جهنم وبئس المصير \"ألقيا في جهنم كل كفار عنيد\" أي كثير الكفر والتكذيب بالحق عنيد معارض للحق معارض له بالباطل مع علمه بذلك."
    },
    {
      "ayah": 25,
      "surah": 50,
      "text": "\"مناع للخير\" أي لا يؤدي ما عليه من الحقوق ولا بر فيه ولا صلة ولا صدقة \"معتد\" أي فيما بنفقه ويصرفه يتجاوز فيه الحد. وقال قتادة معتد في منطقه وسيره وأمره \"مريب\" أي شاك في أمره مريب لمن نظر في أمره."
    },
    {
      "ayah": 26,
      "surah": 50,
      "text": "\"الذي جعل مع الله إلها آخر\" أي أسرك بالله فعبد معه غيره \"فألقياه في العذاب الشديد\" وقد تقدم في الحديث \"أن عنقا من النار يبرز للخلائق فينادي بصوت يسمع الخلائق إني وكلت بثلاثة بكل جبار عنيد ومن جعل مع الله إلها آخر وبالمصورين ثم تنطوي عليهم\" قال الإمام أحمد حدثنا معاوية هو ابن هشام حدثنا شيبان عن فراس عن عطية عن أبي سعيد الخدري رضي الله عنه عن النبي صلى الله عليه وسلم أنه قال \"يخرج عنق من النار يتكلم يقول وكلت اليوم بثلاثة بكل جبار عنيد ومن جعل مع الله إلها آخر ومن قتل نفسا بغير نفس فتنطوي عليهم فتقذفهم في غمرات جهنم\"."
    },
    {
      "ayah": 27,
      "surah": 50,
      "text": "\"قال قرينه\" قال ابن عباس رضي الله عنهما ومجاهد وقتادة وغيرهم هو الشيطان الذي وكل به \"ربنا ما أطغيته\" أي يقول عن الإنسان الذي قد وافى القيامة كافرا يتبرأ منه شيطانه فيقول \"ربنا ما أطغيته\" أي ما أضللته \"ولكن كان في ضلال بعيد\" أي بل كان هو في نفسه ضالا قابلا للباطل معاندا للحق كما أخبر سبحانه وتعالى في الآية الأخرى في قوله \"وقال الشيطان لما قضي الأمر إن الله وعدكم وعد الحق ووعدتكم فأخلفتكم وما كان لي عليكم من سلطان إلا أن دعوتكم فاستجبتم لي فلا تلوموني ولوموا أنفسكم ما أنا بمصرخكم وما أنتم بمصرخي إني كفرت بما أشركتموني من قبل إن الظالمين لهم عذاب أليم\"."
    },
    {
      "ayah": 28,
      "surah": 50,
      "text": "وقوله تبارك وتعالى \"قال لا تختصموا لدي\" يقول الرب عز وجل للإنسي وقرينه من الجن وذلك أنهما يختصمان بين يدي الحق تعالى فيقول الإنسي يا رب هذا أضلني عن الذكر بعد إذ جاءني ويقول الشيطان \"ربنا ما أطغيته ولكن كان في ضلال بعيد\" أي عن منهج الحق فيقول الرب عز وجل لهما \"لا تختصموا لدي\" أي عندي \" وقد قدمت إليكم بالوعيد \" أي قد أعذرت إليكم على ألسنة الرسل وأنزلت الكتب وقامت عليكم الحجج والبينات والبراهين."
    },
    {
      "ayah": 29,
      "surah": 50,
      "text": "\" ما يبدل القول لدي\" قال مجاهد يعني قد قضيت ما أنا قاضي \"وما أنا بظلام للعبيد\" أي لست أعذب أحدا بذنب أحد ولكن لا أعذب أحدا إلا بذنبه بعد قيام الحجة عليه."
    },
    {
      "ayah": 3,
      "surah": 50,
      "text": "أي يقولون أئذا متنا وبلينا وتقطعت الأوصال منا وصرنا ترابا كيف يمكن الرجوع بعد ذلك إلى هذه البنية والتركيب؟ \"ذلك رجع بعيد\" أي بعيد الوقوع. والمعنى أنهم يعتقدون استحالته وعدم إمكانه قال الله تعالى رادا عليهم."
    },
    {
      "ayah": 30,
      "surah": 50,
      "text": "يخبر تعالى أنه يقول لجهنم يوم القيامة هل امتلأت؟ وذلك لأنه تبارك وتعالى وعدها أن سيملؤها من الجنة والناس أجمعين فهو سبحانه وتعالى يأمر بمن يأمر به إليها ويلقى وهي تقول هل من مزيد: أي هل بقي شيء تزيدوني؟ هذا هو الظاهر من سياق الآية وعليه تدل الأحاديث قال البخاري عند تفسير هذه الآية: حدثنا عبدالله بن الأسود حدثنا حرمي بن عمارة حدثنا شعبة عن قتادة عن أنس بن مالك رضي الله عنه عن النبي صلى الله عليه وسلم قال \"يلقى في النار وتقول هل من مزيد؟ حتى يضع قدمه فيها فتقول قط قط \": وقال الإمام أحمد حدثنا عبد الوهاب عن سعيد عن قتادة عن أنس رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم \"لا تزال جهنم يلقى فيها وتقول هل من مزيد؟ حتى يضع رب العزة قدمه فيها فينزوي بعضها إلى بعض وتقول قط قط وعزتك وكرمك ولا يزال في الجنة فضل حتى ينشيء الله لها خلقا آخر فيسكنهم الله تعالى في فضول الجنة\" ثم رواه مسلم من حديث قتادة بنحوه ورواه أبان العطار وسليمان التيمي عن قتادة بنحوه \" حديث آخر \"قال البخاري حدثنا محمد بن موسى القطان حدثنا أبو سفيان الحميري سعيد بن يحيى بن مهدي حدثنا عوف عن محمد عن أبي هريرة رضي الله عنه رفعه وأكثر ما كان يوقفه أبو سفيان: \"يقال لجهنم هل امتلأت وتقول هل من مزيد فيضع الرب تبارك وتعالى قدمه عليها فتقول قط قط\" ورواه أبو أيوب وهشام بن حسان عن محمد بن سيرين به \" طريق أخرى \"قال البخاري وحدثنا عبدالله بن محمد حدثنا عبد الرزاق أخبرنا معمر عن همام بن منبه عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم \" تحاجت الجنة والنار فقالت النار أوثرت بالمتكبرين والمتجرين وقالت الجنة مالي لا يدخلني إلا ضعفاء الناس وسقطهم قال الله عز وجل للجنة أنت رحمتي أرحم بك من أشاء من عبادي وقال للنار إنما أنت عذابي أعذب بك من أشاء من عبادي ولكل واحدة منكما ملؤها فأما النار فلا تمتلئ. يضع رجله فيها فتقول قط قط فهنالك تمتلئ وينزوي بعضها إلى بعض ولا يظلم الله عز وجل ممن خلقه أحدا وأما الجنة فإن الله عز وجل ينشيء لها خلقا آخر\" \" حديث آخر\" قال مسلم في صحيحه حدثنا عثمان بن أبي شيبة حدثنا جرير عن الأعمش عن أبي صالح عن أبي سعيد رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم \"احتجت الجنة والنار فقالت النار في الجبارون والمتكبرون وقالت الجنة في ضعفاء الناس ومساكينهم فقضى بينهما فقال للجنة إنما أنت رحمتي أرحمك بك أشاء من عبادي وقال للنار إنما أنت عذابي أعذب بك من أشاء من عبادي ولكل واحدة منكما ملؤها\" انفرد به مسلم دون البخاري من هذا الوجه والله سبحانه وتعالى أعلم: وقد رواه الإمام أحمد من طريق أخرى عن أبي سعيد رضي الله عنه بأبسط من هذا السياق فقال حدثنا حسن وروح قالا حدثنا حماد بن سلمة عن عطاء بن السائب عن عبيدالله بن عبدالله بن عتبة عن أبي سعيد الخدري رضي الله عنه أن رسول الله صلى الله عليه وسلم قال \"افتخرت الجنة والنار فقالت النار يا رب يدخلني الجبابرة والمتكبرون والملوك والأشراف وقالت الجنة أى رب يدخلني الضعفاء والفقراء والمساكين فيقول الله تبارك وتعالى للنار أنت عذابي أصيب بك من أشاء وقال للجنة أنت رحمتي وسعت كل شيء ولكل واحدة منكما ملؤها فيلقى في النار أهلها فتقول هل من مزيد قال ويلقى فيها وتقول هل من مزيد ويلقى فيها وتقول هل من مزيد حتى يأتيها عز وجل فيضع قدمه عليها فتنزوي وتقول قدني قدني وأما الجنة فيبقى فيها ما شاء الله تعالى أن يبقى فينشئ الله سبحانه وتعالى لها خلقا ما يشاء\" \" حديث آخر\" وقال الحافظ أبو يعلى في مسنده حدثنا عقبة بن مكرم حدثنا يونس حدثنا عبد الغفار بن القاسم عن عدي بن ثابت عن زر بن حبيش عن أبي بن كعب رضي الله عنه قال: إن رسول الله صلى الله عليه وسلم قال \"يعرفني الله تعالى نفسه يوم القيامة فأسجد سجدة يرضى بها عني ثم أمدحه مدحة يرضي بها عني ثم يؤذن لي في الكلام ثم تمر أمتي على الصراط مضروب بين ظهراني جهنم فيمرون أسرع من الطرف والسهم وأسرع من أجود الخيل حتى يخرج الرجل منها يحبو وهي الأعمال وجهنم تسأل المزيد حتى يضع فيها قدمه فينزوي بعضها إلى بعض وتقول قط قط وأنا على الحوض\" قيل وما الحوض يا رسول الله؟ قال صلى الله عليه وسلم \"والذي نفسي بيده إن شرابه أبيض من اللبن وأحلى من العسل وأبرد من الثلج وأطيب ريحا من المسك وآنيته أكثر من عدد النجوم لا يشرب منه إنسان فيظمأ أبدا ولا يصرف فيروى أبدا\" وهذا القول هو اختيار ابن جرير. وقد قال ابن أبي حاتم حدثنا أبو سعيد الأشج حدثنا أبو يحيى الحمامي عن نصر الجزار عن عكرمة عن ابن عباس رضي الله عنهما \"يوم نقول لجهنم هل امتلأت وتقول هل من مزيد\" قال ما امتلأت قال تقول وهل في من مكان يزاد في وكذا رواه الحكم بن أبان عن عكرمة \"وتقول هل من مزيد\" وهل فى مدخل واحد قد امتلأت قال الوليد بن مسلم عن زيد بن أبي مريم أنه سمع مجاهدا يقول لا يزال يقذف فيها حتى تقول قد امتلأت فتقول هل في مزيد وعن عبدالرحمن بن زيد بن أسلم نحو هذا فعند هؤلاء أن قوله تعالى \"هل امتلأت\" إنما هو بعدما يضع عليها قدمه فتنزوي وتقول حينئذ هل بقي في مزيد يسع شيئا؟ قال العوفي عن ابن عباس رضي الله عنهما وذلك حين لا يبقى فيها موضع يسع إبرة والله أعلم."
    },
    {
      "ayah": 31,
      "surah": 50,
      "text": "وقوله تعالى \"وأزلفت الجنة للمتقين غير بعيد\" قال قتادة وأبو مالك والسدى \"وأزلفت\" أدنيت وقربت من المتقين \"غير بعيد\" وذلك يوم القيامة وليس ببعيد لأنه واقع لا محالة وكل ما هو آت قريب."
    },
    {
      "ayah": 32,
      "surah": 50,
      "text": "أي رجاع تائب مقلع \"حفيظ\" أي يحفظ العهد فلا ينقضه ولا ينكثه وقال عبيد بن عمر الأواب الحفيظ الذي لا يجلس مجلسا فيقوم حتى يستغفر الله عز وجل \"."
    },
    {
      "ayah": 33,
      "surah": 50,
      "text": "\"من خشي الرحمن بالغيب\" أي من خاف الله في سره حيث لا يراه أحد إلا الله عز وجل كقوله صلى الله عليه وسلم \"ورجل ذكر الله تعالى خاليا ففاضت عيناه\" \"وجاء بقلب منيب\" أي ولقي الله عز وجل يوم القيامة بقلب منيب سليم إليه خاضع لديه."
    },
    {
      "ayah": 34,
      "surah": 50,
      "text": "\"ادخلوها\" أي الجنة \"بسلام\"قال قتادة سلموا من عذاب الله عز وجل وسلم عليهم ملائكة الله وقوله سبحانه وتعالى \"ذلك يوم الخلود\" أى يخلدون في الجنة فلا يموتون أبدا ولا يظعنون أبدا ولا يبغون عنها حولا."
    },
    {
      "ayah": 35,
      "surah": 50,
      "text": "أي مهما اختاروا وجدوا من أي أصناف الملاذ طلبوا أحضر لهم قال ابن أبي حاتم حدثنا أبو زرعة حدثنا عمر بن عثمان حدثنا بقية عن يحيى بن سعيد عن خالد بن معدان عن كثير بن مرة قال من المزيد أن تمر السحابة بأهل الجنه فتقول ماذا تريدون فأمطره لكم؟ فلا يدعون بشيء إلا أمطرتهم قال كثير لئن أشهدني الله تعالى ذلك لأقولن أمطرينا جواري مزينات وفي الحديث عن ابن مسعود رضي الله عنه قال إن رسول الله صلى الله عليه وسلم قال له \"إنك لتشتهي الطير في الجنة فيخر بين يديك مشويا\" وقال الإمام أحمد حدثنا علي بن عبدالله حدثنا معاذ بن هشام حدثني أبي عن عامر الأحول عن أبي بكر الصديق رضي الله عنه عن أبي سعيد الخدري رضي الله عنه قال إن رسول الله صلى الله عليه وسلم قال \"إذا اشتهى المؤمن الولد في الجنة كان حمله وضعه وسنه فى ساعة واحدة\" ورواه الترمذي وابن ماجة عن بندار عن معاذ بن هشام به وقال الترمذي حسن غريب وزاد: كما اشتهى وقوله تعالى \"ولدينا مزيد\" كقوله عز وجل \"للذين أحسنوا الحسنى وزيادة\" وقد تقدم في صحيح مسلم عن صهيب بن سنان الرومي أنها النظر إلى وجه الله الكريم وقد روى البزار وابن أبي حاتم من حديث شريك القاضي عن عثمان بن عمير أبي اليقظان عن أنس بن مالك رضي الله عنه في قوله عز وجل \"ولدينا مزيد\" قال يظهر لهم الرب عز وجل في كل جمعة وقد رواه الإمام أبو عبدالله الشافعي مرفوعا فقال في مسنده أخبرنا إبراهيم بن محمد حدثني موسى بن عبيدة حدثني أبو الأزهر معاوية بن إسحاق بن طلحة عن عبيدالله بن عمر أنه سمع أنس بن مالك رضي الله عنه يقول أتى جبرائيل عليه الصلاة والسلام بمرآة بيضاء فيها نكتة إلى رسول الله صلى الله عليه وسلم فقال رسول الله صلى الله عليه وسلم \"ما هذه؟ \" فقال هذه الجمعة فضلت بها أنت وأمتك فالناس لكم فيها تبع اليهود والنصارى ولكم فيها خير ولكم فيها ساعة لا يوافقها مؤمن يدعو الله تعالى فيها بخير إلا استجيب له وهو عندنا يوم المزيد قال النبي صلى الله عليه وسلم \"يا جبريل وما يوم المزيد؟ \"قال\"إن ربك تبارك وتعالى اتخذ في الفردوس واديا أفيح فيه كثب المسك فإذا كان يوم الجمعة أنزل الله تعالى ما شاء من ملائكته وحوله منابر من نور عليها مقاعد النبيين وحفت تلك المنابر من ذهب مكللة بالياقوت والزبرجد عليها الشهداء والصديقون فجلسوا من ورائهم على تلك الكثب فيقول الله عز وجل أنا ربكم قد صدقتكم وعدي فسلوني أعطكم فيقولون ربنا نسألك رضوانك فيقول قد رضيت عنكم ولكم علي ما تمنيتم ولدي مزيد فهم يحبون يوم الجمعة لما يعطيهم فيه ربهم تبارك وتعالى من الخير وهو اليوم الذي استوى فيه ربكم على العرش وفيه خلق آدم وفيه تقوم الساعة هكذا أورده الإمام الشافعي رحمه الله في كتاب الجمعة من الأم وله طرق عن أنس بن مالك رضي الله عنه وقد أورد ابن جرير هذا الحديث من رواية عثمان بن عمير عن أنس رضي الله عنه بأبسط من هذا وذكر ههنا أثرا مطولا عن أنس بن مالك رضي الله عنه موقوفا وفيه غرائب كثيرة وقال الإمام أحمد حدثنا حسن حدثنا ابن لهيعة حدثنا دراج عن أبي الهيثم عن أبي سعيد رضي الله عنه عن رسول الله صلى الله عليه وسلم قال \"إن الرجل في الجنة ليتكئ في الجنة سبعين سنة قبل أن يتحول ثم تأتيه امرأة تضرب على منكبه فينظر وجهه في خدها أصفى من المرآة وإن أدنى لؤلؤة عليها تضيء ما بين المشرق والمغرب فتسلم عليه فيرد السلام فيسألها من أنت؟ فتقول أنا من المزيد وإنه ليكون عليها سبعون حلة أدناها مثل النعمان من طوبى فينفذها بصره حتى يرى مخ ساقها من وراء ذلك وإن عليها من التيجان إن أدنى لؤلؤة منها لتضيء ما بين المشرق والمغرب\" وهكذا رواه عبدالله بن وهب عن عمرو بن الحارث عن دراج به."
    },
    {
      "ayah": 36,
      "surah": 50,
      "text": "أي كانوا أكثر منهم وأشد قوة وأثاروا الأرض وعمروها أكثر مما عمروها ولهذا قال تعالى ههنا \"فنقبوا فى البلاد هل من محيص\" قال ابن عباس رضي الله عنهما أثروا فيها وقال مجاهد \"فنقبوا في البلاد\" ضربوا في الأرض وقال قتادة فساروا في البلاد أي ساروا فيها يبتغون الأرزاق والمتاجر والمكاسب أكثر مما طفتم أنتم بها ويقال لمن طوف في البلاد نقب فيها وقال امرؤ القيس لقد نقبت في الآفاق حتى رضيت من الغنيمة بالإياب وقوله تعالى \"هل من محيص\" أي هل من مفر كان لهم من قضاء الله وقدره وهل نفعهم ما جمعوه ورد عنهم عذاب الله إذ جاءهم لما كذبوا الرسل فأنتم أيضا لا مفر لكم ولا محيد ولا مناص ولا محيص."
    },
    {
      "ayah": 37,
      "surah": 50,
      "text": "\" أي لعبرة \"لمن كان له قلب\" أي لب يعي به وقال مجاهد عقل \"أو ألقى السمع وهو شهيد\" أي استمع الكلام فوعاه وتعقله وعقله وتفهمه بلبه وقال مجاهد \"أو ألقى السمع\" يعني لا يحدث نفسه في هذا بقلب وقال الضحاك العرب تقول ألقى فلان سمعه إذا استمع بأذنيه وهو شاهد بقلب غير غائب وهكذا قال الثوري وغير واحد."
    },
    {
      "ayah": 38,
      "surah": 50,
      "text": "\" فيه تقرير للمعاد لأن من قدر على خلق السموات والأرض ولم يعي بخلقهن قادر على أن يحيي الموتى بطريق الأولى والأحرى وقال قتادة قالت اليهود - عليهم لعائن الله - خلق الله السموات والأرض في ستة أيام ثم استراح في اليوم السابع وهو يوم السبت وهم يسمونه يوم الراحة فأنزل الله تعالى تكذيبهم فيما قالوه وتأولوه \"وما مسنا من لغوب\" أي من إعياء ولا تعب ولا نصب كما قال تبارك وتعالى في الآية الأخرى \"أو لم يروا أن الله الذي خلق السموات والأرض ولم يعي بخلقهن قادر على أن يحيى الموتى بلى إنه على كل شيء دير \" وكما قال عز وجل \"لخلق السموات والأرض أكبر من خلق الناس\" وقال تعالى \"أأنتم أشد خلقا أم السماء بناها\"."
    },
    {
      "ayah": 39,
      "surah": 50,
      "text": "يعني المكذبين اصبر عليهم واهجرهم هجرا جميلا \"وسبح بحمد ربك قبل طلوع الشمس وقبل الغروب\" وكانت الصلاة المفروضة قبل الإسراء ثنتان قبل طلوع الشمس في وقت الفجر وقبل الغروب في وقت العصر وقيام الليل كان واجبا على النبي صلى الله عليه وسلم وعلى أمته حولا ثم نسخ في حق الأمة وجوبه ثم بعد ذلك نسخ الله تعالى ذلك كله ليلة الإسراء بخمس صلوات ولكن منهن صلاة الصبح والعصر فهما قبل طلوع الشمس وقبل الغروب وقد قال الإمام أحمد حدثنا وكيع حدثنا إسماعيل بن أبي خالد عن قيس بن أبي حازم عن جرير بن عبدالله رضي الله عنهما قال: كنا جلوسا عند النبي صلى الله عليه وسلم فنظر إلى القمر ليلة البدر فقال \"أما إنكم ستعرضون على ربكم فترونه كما ترون هذا القمر لا تضامون فيه فإن استطعتم أن لا تغلبوا على صلاة قبل طلوع الشمس وقبل غروبها فافعلوا\" ثم قرأ \"وسبح محمد ربك قبل طلوع الشمس وقبل الغروب\" ورواه البخاري ومسلم وبقية الجماعة من حديث إسماعيل به."
    },
    {
      "ayah": 4,
      "surah": 50,
      "text": "أي ما تأكل من أجسادهم في البلى نعلم ذلك ولا يخفى علينا أبن تفرقت الأبدان وأين ذهبت وإلى أين صارت \"وعندنا كتاب حفيظ\" أي حافظ لذلك فالعلم شامل والكتاب أيضا فيه كل الأشياء مضبوطة. قال العوفي عن ابن عباس رضي الله عنهما في قوله تعالى \"قد علمنا ما تنقص الأرض منهم\" أي ما تأكل من لحومهم وأبشارهم وعظامهم وأشعارهم كذا قال مجاهد وقتادة والضحاك وغيرهم ثم بين تبارك وتعالى سبب كفرهم وعنادهم واستبعادهم ما ليس ببعيد."
    },
    {
      "ayah": 40,
      "surah": 50,
      "text": "وقوله تعالى \"ومن الليل فسبحه\" أي فصل له كقوله \"ومن الليل فتهجد به نافلة لك عسى أن يبعثك ربك مقاما محمودا\" \"وأدبار السجود\" قال ابن أبي نجيح عن مجاهد عن ابن عباس رضي الله عنهما هو التسبيح بعد الصلاة ويؤيد هذا ما ثبت في الصحيحين عن أبي هريرة رضي الله عنه أنه قال: جاء فقراء المهاجرين فقالوا يا رسول الله ذهب أهل الدثور بالدرجات العلى والنعيم المقيم فقال النبي صلى الله عليه وسلم \"وما ذاك؟ \" قالوا يصلون كما نصلي ويصومون كما نصوم ويتصدقون ولا نتصدق ويعتقون ولا نعتق قال صلى الله عليه وسلم \"أفلا أعلمكم شيء إذا فعلتموه سبقتم من بعدكم ولا يكون أحد أفضل منكم إلا من فعل مثل ما فعلتم؟ تسبحون وتحمدون وتكبرون دبر كل صلاة ثلاثا وثلاثين\" قال فقالوا يا رسول الله سمع إخواننا أهل الأموال بما فعلنا ففعلوا مثله فقال صلى الله عليه وسلم \"ذلك فضل الله يؤتيه من يشاء\" والقول الثاني أن المراد بقوله تعالى \"وأدبار السجود\" هما الركعتان بعد المغرب وروي ذلك عن عمر وعلي وابنه الحسن وابن عباس وأبي هريرة وأبي أمامة رضي الله عنهم وبه يقول مجاهد وعكرمة والشعبي والنخعي والحسن وقتادة وغيرهم قال الإمام أحمد حدثنا وكيع وعبدالرحمن عن سفيان عن أبي إسحاق عن عاصم بن ضمرة عن علي رضي الله عنه قال: كان رسول الله صلى الله عليه وسلم يصلي على أثر كل صلاة مكتوبة ركعتين إلا الفجر والعصر وقال عبدالرحمن دبر كل صلاة ورواه أبو داود والنسائي من حديث سفيان الثوري به زاد النسائي ومطرف عن أبي إسحاق به وقال ابن أبي حاتم حدثنا هارون بن إسحاق الهمداني حدثنا ابن فضيل عن رشدين بن كريب عن أبيه عن ابن عباس رضي الله عنهما قال: بت ليلة عند رسول صلى الله عليه وسلم فصلى ركعتين خفيفتين اللتين قبل الفجر ثم خرج إلى الصلاة فقال \"يا ابن عباس ركعتين قبل صلاة الفجر إدبار النجوم وركعتين بعد المغرب إدبار السجود\" ورواه الترمذي عن هشام الرفاعي عن محمد بن فضيل به وقال غريب لا نعرفه إلا من هذا الوجه وحديث ابن عباس رضي الله عنهما وأنه بات في بيت خالته ميمونة رضي الله عنها وصلى تلك الليلة مع النبي صلى الله عليه وسلم ثلاث عشرة ركعة ثابت في الصحيحين وغيرهما فأما هذه الزيادة فغريبة لا تعرف إلا من هذا الوجه ورشدين بن كريب ضعيف ولعله من كلام ابن عباس رضي الله عنهما موقوفا عليه والله أعلم."
    },
    {
      "ayah": 41,
      "surah": 50,
      "text": "يقول تعالى \"واستمع\" يا محمد \"يوم يناد المناد من مكان قريب\" قال قتادة قال كعب الأحبار يأمر الله تعالى ملكا أن ينادي على صخرة بيت المقدس أيتها العظام البالية والأوصال المتقطعة إن الله تعالى يأمركن أن تجتمعن لفصل القضاء."
    },
    {
      "ayah": 42,
      "surah": 50,
      "text": "يعني النفخة فى الصور التي تأتي بالحق الذي كان أكثرهم فيه يمترون \"ذلك يوم الخروج\" أي من الأجداث."
    },
    {
      "ayah": 43,
      "surah": 50,
      "text": "أي هو الذي يبدأ الخلق ثم يعيده وهو أهون عليه وإليه مصير الخلائق كلهم فيجازي كلا بعمله إن خيرا فخير وإن شرا فشر."
    },
    {
      "ayah": 44,
      "surah": 50,
      "text": "وذلك أن الله عز وجل ينزل مطرا من السماء ينبت أجساد الخلائق كلها في قبورها كما ينبت الحب في الثرى بالماء فإذا تكاملت الأجساد أمر الله تعالى إسرافيل فينفخ في الصور وقد أوعت الأرواح في ثقب في الصور فإذا نفخ إسرافيل فيه خرجت الأرواح تتوهج بين السماء والأرض فيقول الله عز وجل وعزتي وجلالي لترجعن كل روح إلى الجسد الذي كانت تعمره فترجع كل روح إلى جسدها فتدب فيه كما يدب السم في اللديغ وتنشق الأرض عنهم فيقومون إلى موقف الحساب سراعا مبادرين إلى أمر الله عز وجل \"مهطعين إلى الداع يقول الكافرون هذا يوم عسر\" وقال الله تعالى \"يوم يدعوكم فتستجيبون بحمده وتظنون إن لبثتم إلا قليلا\" وفي صحيح مسلم عن أنس رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم \"أنا أول من تنشق عنه الأرض\" وقوله عز وجل \"ذلك حشر علينا يسير\" أي تلك إعادة سهلة علينا يسيرة لدينا كما قال جل جلاله \"وما أمرنا إلا واحدة كلمح بالبصر\" وقال سبحانه وتعالى \"ما خلقكم ولا بعثكم إلا كنفس واحدة إن الله سميع بصير\"."
    },
    {
      "ayah": 45,
      "surah": 50,
      "text": "جل وعلا \"نحن أعلم بما يقولون\" أي نحن علمنا محيط بما يقول لك المشركون من التكذيب فلا يهولنك ذلك كقوله \"ولقد نعلم أنك يضيق صدرك بما يقولون فسبح بحمد ربك وكن من الساجدين واعبد ربك حتى يأتيك اليقين\" وقوله تبارك وتعالى \"وما أنت عليهم بجبار\" أي ولست بالذي تجبر هؤلاء على الهدى وليس ذلك ما كلفت به قال مجاهد وقتادة والضحاك \"وما أنت عليهم بجبار\" أي لا تتجبر عليهم والقول الأول أولى ولو أراد ما قالوه لقال ولا تكن جبارا عليهم وإنما قال \"وما أنت عليهم بجبار\" بمعنى وما أنت بمجبرهم على الإيمان إنما أنت مبلغ. قال الفراء سمعت العرب تقول جر فلان فلانا على كذا بمعنى أجبره ثم قال عز وجل \"فذكر بالقرآن من يخاف وعيد\" أي بلغ أنت رسالة ربك فإنما يتذكر من يخاف الله ووعيده ويرجو وعده كقوله تعالى \"فإنما عليك البلاغ وعلينا الحساب\" وقوله جل جلاله \"فذكر إنما أنت مذكر لست عليهم بمسيطر\" \"ليس عليك هداهم ولكن الله يهدي من يشاء\" \"إنك لا تهدي من أحببت ولكن الله يهدي من يشاء\" ولهذا قال تعالى ههنا \"وما أنت عليهم بجبار فذكر بالقرآن من يخاف وعيد\" كان قتادة يقول اللهم اجعلنا ممن يخاف وعيدك ويرجو موعودك يا باريا رحيم. آخر تفسير سورة ق والحمد لله وحده وحسبنا الله ونعم الوكيل."
    },
    {
      "ayah": 5,
      "surah": 50,
      "text": "أي وهذا حال كل من خرج عن الحق مهما قال بعد ذلك فهو باطل والمريج المختلف المضطرب الملتبس المنكر خلاله كقوله تعالى \"إنكم لفى قول مختلف يؤفك عنه من أفك\"."
    },
    {
      "ayah": 6,
      "surah": 50,
      "text": "يقول تعالى منبها للعباد على قدرته العظيمة التي أظهر بها ما هو أعظم مما تعجبوا مستبعدين لوقوعه \"أفلم ينظروا إلى السماء فوقهم كيف بنيناها وزيناها\" أي بالمصابيح \"وما لها من فروج\" قال مجاهد يعني من شقوق وقال غيره فتوق وقال غيره صدوع والمعنى متقارب كقوله تبارك وتعالى \"الذي خلق سبع سموات طباقا ما ترى في خلق الرحمن من تفاوت فارجع البصر هل ترى من فطور ثم ارجع البصر كرتين ينقلب إليك البصر خاسئا وهو حسير\" أي كليل عن أن يرى عيبا أو نقصا."
    },
    {
      "ayah": 7,
      "surah": 50,
      "text": "أي وسعناها وفرشناها \"وألقينا فيها رواسي\" وهي الجبال لئلا تميد بأهلها وتضطرب فإنها مقرة على تيار الماء المحيط بها من جميع جوانبها \"وأنبتنا فيها من كل زوج بهيج\" أي من جميع الزروع والثمار والنبات والأنواع \"ومن كل شيء خلقنا زوجين لعلكم تذكرون\" وقوله بهيج أي حسن المنظر."
    },
    {
      "ayah": 8,
      "surah": 50,
      "text": "أي ومشاهدة خلق السموات والأرض وما جعل فيهما من الآيات العظيمة تبصرة ودلاله وذكرى لكل عبد منيب أي خاضع خائف وجل رجاع إلى الله عز وجل."
    },
    {
      "ayah": 9,
      "surah": 50,
      "text": "\" أي نافعا \"فأنبتنا به جنات\" أي حدائق من بساتين ونحوها \"وحب الحصيد\" وهو الزرع الذي راد لحبه وادخاره."
    }
  ]
}
