{
  "ayahs": [
    {
      "ayah": 1,
      "surah": 51,
      "text": "قال شعبة بن الحجاج عن سماك عن خالد بن عرعرة أنه سمع علي رضي الله عنه وشعبة أيضا عن القاسم بن أبي بزة عن أبي الطفيل أنه سمع عليا رضي الله عنه وثبت أيضا من غير وجه عن أمير المؤمنين علي بن أبي طالب رضي الله عنه أنه صعد منبر الكوفة فقال: لا تسألوني عن آية في كتاب الله تعالى ولا عن سنة عن رسول الله صلى الله عليه وسلم إلا أنبأتكم بذلك فقام إليه ابن الكواء فقال يا أمير المؤمنين ما معنى قوله تعالى \"والذاريات ذروا\" قال علي رضي الله عنه: الريح."
    },
    {
      "ayah": 10,
      "surah": 51,
      "text": "وقوله تعالي \"قتل الخراصون\" قال مجاهد الكذابون قال وهي مثل التي في عبس \"قتل الإنسان ما أكفره\" والخراصون الذين يقولون لا نبعث ولا يوقنون. وقال علي ابن أبي طلحة عن ابن عباس رضي الله عنهما \"قتل الخراصون\" أي لعن المرتابون. وهكذا كان معاذ رضي الله عنه يقول في خطبته هلك المرتابون وقال قتادة الخراصون أهل الغرة والظنون."
    },
    { "ayah": 11, "surah": 51, "text": "قال ابن عباس رضي الله عنهما وغير واحد في الكفر والشك غافلون لاهون." },
    { "ayah": 12, "surah": 51, "text": "وإنما يقولون هذا تكذيبا وعنادا وشكا واستبعادا." },
    {
      "ayah": 13,
      "surah": 51,
      "text": "قال بن عباس ومجاهد والحسن وغير واحد يفتنون يعذبون قال مجاهد كما يفتن الذهب على النار وقال جماعة آخرون كمجاهد أيضا وعكرمة وإبراهيم النخعي وزيد بن أسلم وسفيان الثوري يفتنون يحرقون."
    },
    {
      "ayah": 14,
      "surah": 51,
      "text": "\"ذوقوا فتنتكم\" قال مجاهد حريقكم وقال غيره عذابكم \"هذا الذي كنتم به تستعجلون\" أي يقال لهم ذلك تقريعا وتوبيخا وتحقيرا وتصغيرا والله أعلم."
    },
    {
      "ayah": 15,
      "surah": 51,
      "text": "يقول تعالى مخبرا عن المتقين لله عز وجل أنهم يوم معادهم يكونون في جنات وعيون بخلاف ما أولئك الأشقياء فيه من العذاب والنكال والحريق والأغلال."
    },
    {
      "ayah": 16,
      "surah": 51,
      "text": "قال ابن جرير أي عاملين بما آتاهم الله من الفرائض \"إنهم كانوا قبل ذلك محسنين\" أي قبل أن يفرض عليهم الفرائض كانوا محسنين في الأعمال أيضا ثم روى عن ابن حميد حدثنا مهران عن سفيان عن أبي عمر عن مسلم البطين عن ابن عباس رضي الله عنهما في قوله تعالى \"آخذين ما آتاهم ربهم\" قال من الفرائض \"إنهم كانوا قبل ذلك محسنين\" قبل الفرائض يعملون وهذا الإسناد ضعيف ولا يصح عن ابن عباس رضي الله عنهما وقد رواه عثمان بن أبي شيبة عن معاوية بن هشام عن سفيان عن أبي عمر البزار عن مسلم البطين عن سعيد بن جبير عن ابن عباس رضي الله عنهما فذكره والذي فسر به ابن جرير فيه نظر لأن قوله تبارك وتعالى \"آخذين\" حال من قوله في جنات وعيون فالمتقون في حال كونهم في الجنات والعيون آخذين ما آتاهم ربهم أي من النعيم والسرور والغبطة وقوله عز وجل \"إنهم كانوا قبل ذلك\" أي في الدار الدنيا \"محسنين\" كقوله جل جلاله \"كلوا واشربوا هنيئا بما أسلفتم في الأيام الخالية\" ثم إنه تعالى بين إحسانهم في العمل فقال جل وعلا."
    },
    {
      "ayah": 17,
      "surah": 51,
      "text": "اختلف المفسرون في ذلك على قولين أحدهما أن ما نافية تقديره كانوا قليلا من الليل لا يهجعونه قال ابن عباس رضي الله عنهما لم تكن تمضي عليهم ليلة إلا يأخذون منها ولو شيئا وقال قتادة عن مطرف بن عبدالله قل ليلة لا تأتي عليهم إلا يصلون فيها لله عز وجل إما من أولها وإما من أوسطها وقال مجاهد قل ما يرقدون ليلة حتى الصباح يتهجدون وكذا قال قتادة وقال أنس بن مالك رضي الله عنه وأبو العالية كانوا يصلون بين المغرب والعشاء. وقال أبو جعفر الباقر كانوا لا ينامون حتى يصلوا العتمة والقول الثاني أن ما مصدرية تقديره كانوا قليلا من الليل هجوعهم ونومهم واختاره ابن جرير وقال الحسن البصري \"كانوا قليلا من الليل ما يهجعون\" كابدوا قيام الليل فلا ينامون من الليل إلا أقله ونشطوا فمدوا إلى السحر حتى كان الاستغفار بسحر وقال قتادة قال الأحنف بن قيس \"كانوا قليلا من الليل ما يهجعون\" كانوا لا ينامون إلا قليلا ثم يقول لست من أهل هذه الآية. وقال الحسن البصري كان الأحنف بن قيس يقول عرضت عملي على عمل أهل الجنة فإذا قوم قد باينونا بونا بعيدا إذا قوم لا نبلغ أعمالهم كانوا قليلا من الليل ما يهجعون وعرضت عملي علي عمل أهل النار فإذا قوم لا خير فيهم مكذبون بكتاب الله وبرسل الله مكذبون بالبعث بعد الموت فقد وجدت من خيرنا منزلة قوما خلطوا عملا صالحا وآخر سيئا. وقال عبدالرحمن بن زيد بن أسلم قال رجل من بني تميم لأبي: يا أبا أسامة صفة لا أجدها فينا ذكر الله تعالى قوما فقال \"كانوا قليلا من الليل ما يهجعون\" ونحن والله قليلا من الليل ما نقوم فقال له أبي رضي الله عنه طوبى لمن رقد إذا نعس واتقى الله إذا استيقظ. وقال عبدالله بن سلام رضي الله عنه لما قدم رسول الله صلى الله عليه وسلم المدينة انجفل الناس إليه فكنت فيمن أنجفل فلما رأيت وجهه صلى الله عليه وسلم عرفت أن وجهه ليس بوجه رجل كذاب فكان أول ما سمعته صلى الله عليه وسلم يقول \"يا أيها الناس أطعموا الطعام وصلوا الأرحام وأفشوا السلام وصلوا بالليل والناس نيام تدخلوا الجنة بسلام\". وقال الإمام أحمد حدثنا حسن بن موسى حدثنا ابن لهيعة حدثني يحيى بن عبدالله عن أبي عبدالرحمن الحبلي عن عبدالله بن عمر رضي الله عنهما قال: إن رسول الله صلى الله عليه وسلم قال \"إن في الجنة غرفا يرى ظاهرها من باطنها وباطنها من ظاهرها\" فقال أبو موسى الأشعري رضي الله عنه لمن هي يا رسول الله؟ قال صلى الله عليه وسلم \"لمن ألان الكلام وأطعم الطعام وبات لله قائما والناس نيام\" وقال معمر في قوله تعالى \"كانوا قليلا من الليل ما يهجعون\" كان الزهري والحسن يقولان كانوا كثيرا من الليل ما يصلون وقال ابن عباس رضي الله عنهما وإبراهيم النخعي \"كانوا قليلا من الليل ما يهجعون\" ما ينامون وقال الضحاك \"إنهم كانوا قبل ذلك محسنين كانوا قليلا\" ثم ابتدأ فقال \"من الليل ما يهجعون وبالأسحار هم يستغفرون\" وهذا القول فيه بعد وتعسف."
    },
    {
      "ayah": 18,
      "surah": 51,
      "text": "وقوله عز وجل \"وبالأسحار هم يستغفرون\" قال مجاهد وغير واحد يصلون وقال آخرون قاموا الليل وأخروا الاستغفار إلى الأسحار كما قال تبارك وتعالى \"والمستغفرين بالأسحار\" فإن كان الاستغفار في صلاة فهو أحسن وقد ثبت في الصحاح وغيرها عن جماعة من الصحابة رضي الله عنهم عن رسول الله صلى الله عليه وسلم أنه قال \"إن الله تعالى ينزل كل ليلة إلى سماء الدنيا حين يبقى ثلث الليل الأخير فيقول هل من تائب فأتوب عليه هل من مستغفر فأغفر له هل من سائل فيعطى سؤله؟ حتى يطلع الفجر\" وقال كثير من المفسرين في قوله تعالى إخبارا عن يعقوب أنه قال لبنيه \"سوف أستغفر لكم ربي\" قالوا أخرهم إلى وقت السحر."
    },
    {
      "ayah": 19,
      "surah": 51,
      "text": "لما وصفهم بالصلاة ثنى بوصفهم بالزكاة والبر والصلة فقال \"وفي أمولهم حق\" أي جزء مقسوم قد أفرزوه للسائل والمحروم. أما السائل فمعروف وهو الذي يبتدئ بالسؤال وله حق كما قال الإمام أحمد حدثنا وكيع وعبدالرحمن قالا حدثنا سفيان عن مصعب بن محمد عن يعلى بن أبي يحيى عن فاطمة بن الحسين عن أبيها الحسين بن علي رضي الله عنهما قال: قال رسول الله صلى الله عليه وسلم \"للسائل حق وإن جاء على فرس\" ورواه أبو داود من حديث سفيان الثوري به. ثم أسنده من وجه آخر عن علي بن أبي طالب رضي الله عنه وروي من حديث الهرماس بن زياد مرفوعا وأما المحروم فقال ابن عباس رضي الله عنهما ومجاهد وهو المحارف الذي ليس له في الإسلام سهم يعني لا سهم له فى بيت المال ولا كسب له ولا حرفة يتقوت منها وقالت أم المؤمنين عائشة رضي الله عنها هو المحارف الذي لا يكاد يتيسر له مكسبه وقال الضحاك هو الذي لا يكون له مال إلا ذهب قضى الله له تعالى ذلك وقال أبو قلابة جاء سيل باليمامة فذهب بمال رجل فقال رجل من الصحابة رضي الله عنهم هذا المحروم وقال ابن عباس رضي الله عنهما أيضا وسعيد بن المسيب وإبراهيم النخعي ونافع مولى ابن عمر رضي الله عنهما وعطاء بن أبي رباح المحروم المحارف وقال قتادة والزهري المحروم الذي لا يسأل الناس شيئا. قال الزهري وقد قال رسول الله صلى الله عليه وسلم \"ليس المسكين بالطواف الذي ترده اللقمة واللقمتان والتمرة والتمرتان ولكن المسكين الذي لا يجد غني يغنيه ولا يفطن له فيتصدق عليه\" وهذا الحديث قد أسنده الشيخان في صحيحيهما من وجه آخر وقال سعيد بن جبير هو الذي يجيء وقد قسم المغنم فيرضخ له. وقال محمد بن إسحاق حدثني بعض أصحابنا قال كنا مع عمر بن عبدالعزيز رضي الله عنه في طريق مكة فجاء كلب فانتزع عمر رضي الله عنه كتف شاة فرمى بها إليه وقال يقولون إنه المحروم وقال الشعبي أعياني أن أعلم ما المحروم واختار ابن جرير أن المحروم الذي لا مال له بأي سبب كان وقد ذهب ماله سواء كان لا يقدر على الكسب أو قد هلك ماله أو نحوه بآفة أو نحوها. وقال الثوري عن قيس بن مسلم عن الحسن بن محمد رضي الله عنه قال إن رسول الله صلى الله عليه وسلم بعث سرية فغنموا فجاءه قوم لم يشهدوا الغنيمة فنزلت هذه الآية \"وفي أموالهم حق للسائل والمحروم\" وهذا يقتضي أن هذه مدينة وليس كذلك بل هي مكية شاملة لما بعدها."
    },
    { "ayah": 2, "surah": 51, "text": "قال علي رضي الله عنه: السحاب." },
    {
      "ayah": 20,
      "surah": 51,
      "text": "أي فيها من الآيات الدالة على عظمة خالقها وقدرته الباهرة مما قد ذرأ فيها من صنوف النبات والحيوانات والمهاد والجبال والقفار والأنهار والبحار واختلاف ألسنة الناس وألوانهم وما جبلوا عليه من الإرادات والقوى وما بينهم من التفاوت في العقول والفهوم والحركات والسعادة والشقاوة وما في تركيبهم من الحكم في وضع كل عضو من أعضائهم في المحل الذي هو محتاج إليه فيه ولهذا قال عز وجل \"وفي أنفسكم أفلا تبصرون\" قال قتادة من تفكر في خلق نفسه عرف أنه إنما خلق ولينت مفاصله للعبادة."
    },
    {
      "ayah": 21,
      "surah": 51,
      "text": "قال عز وجل \"وفي أنفسكم أفلا تبصرون\" قال قتادة من تفكر في خلق نفسه عرف أنه إنما خلق ولينت مفاصله للعبادة."
    },
    {
      "ayah": 22,
      "surah": 51,
      "text": "\"وفي السماء رزقكم\" يعني المطر \"وما توعدون\" يعني الجنة قاله ابن عباس رضي الله عنهما ومجاهد وغير واحد وقال سفيان الثوري قرأ واصل الأحدب هذه الآية \"وفي السماء رزقكم وما توعدون\" فقال ألا أرى رزقي في السماء وأنا أطلبه في الأرض؟ فدخل خربة فمكث ثلاثا لا يصيب شيئا فلما أن كان اليوم الثالث إذا هو بدوخلة من رطب وكان له أخ أحسن نية منه فدخل معه فصارتا دوخلتين فلم يزل ذلك دأبهما حتى فرق بينهما الموت."
    },
    {
      "ayah": 23,
      "surah": 51,
      "text": "وقوله تعالى \"فورب السماء والأرض إنه لحق مثل ما أنكم تنطقون\" يقسم تعالى بنفسه الكريمة أن ما وعدهم به من أمر القيامة والبعث والجزاء كائن محالة وهو حق لا مرية فيه فلا تشكو فيه كما لا تشكوا في نطقكم حين تنطقون وكان معاذ رضي الله عنه إذا حدث بالشيء يقول لصاحبه إن هذا لحق كما أنك ههنا قال مسدد عن ابن أبي عدى عن عوف عن الحسن البصري قال بلغني أن رسول الله صلى الله عليه وسلم قال \"قاتل الله أقواما أقسم لهم ربهم ثم لم يصدقوا\" ورواه ابن جرير عن بندار عن ابن أبي عدي عن عوف عن الحسن فذكره مرسلا."
    },
    {
      "ayah": 24,
      "surah": 51,
      "text": "هذه القصة قد تقدمت في سورة هود والحجر أيضا فقوله \"هل أتاك حديث ضيف إبراهيم المكرمين\" أي الذين أرصد لهم الكرامة وقد ذهب الإمام أحمد وطائفة من العلماء إلى وجوب الضيافة للنزيل وقد وردت السنة بذلك كما هو ظاهر التنزيل."
    },
    {
      "ayah": 25,
      "surah": 51,
      "text": "\" الرفع أقوى وأثبت من النصب فرده أفضل من التسليم ولهذا قال تعالى \"وإذا حييتم بتحية فحيوا بأحسن منها أو ردوها \"فالخليل اختار الأفضل وقوله تعالى \"قوم منكرون\" وذلك أن الملائكة وهم جبريل وميكائيل وإسرافيل قدموا عليه في صورة شبان حسان عليهم مهابة عظيمة ولهذا قال \"قوم منكرون\"."
    },
    {
      "ayah": 26,
      "surah": 51,
      "text": "وقوله عز وجل \"فراغ إلى أهله\" أي انسل خفية في سرعة \"فجاء بعجل سمين\" أي من خيار ماله وفي الآية الأخرى \"فما لبث أن جاء بعجل حنيذ\" أي مشوي على الرضف."
    },
    {
      "ayah": 27,
      "surah": 51,
      "text": "\"فقربه إليهم\" أي أدناه منهم \"قال ألا تأكلون\" تلطف في العبارة وعرض حسن وهذه الآية انتظمت آداب الضيافة فإنه جاء بطعام من حيث لا يشعرون بسرعة ولم يمتن عليهم أولا فقال نأتيكم بطعام بل جاء به بسرعة وخفاء وأتى بأفضل ما وجد من ماله وهو عجل فتي سمين مشوي فقربه إليهم لم يضعه وقال اقتربوا بل وضعه بين أيديهم ولم يأمرهم أمرا يشق على سامعه بصيغة الجزم بل قال \"ألا تأكلون\" على سبيل العرض والتلطف كما يقول القائل اليوم إن رأيت أن تتفضل وتحسن وتتصدق فافعل."
    },
    {
      "ayah": 28,
      "surah": 51,
      "text": "هذا محال على ما تقدم في القصة في السورة الأخرى وهي قوله تعالى \"فلما رأى أيديهم لا تصل إليه نكرهم وأوجس منهم خيفة قالوا لا تخف إنا أرسلنا إلى قوم لوط وامرأته قائمة فضحكت\" أي استبشرت بهلاكهم لتمردهم وعتوهم على الله تعالى فعند ذلك بشرتها الملائكة بإسحاق ومن وراء إسحاق يعقوب\" قالت يا ويلتا أألد وأنا عجوز وهذا بعلي شيخا إن هذا لشيء عجيب قالوا أتعجبين من أمر الله رحمة الله وبركاته عليكم أهل البيت إنه حميد مجيد \" ولهذا قال سبحانه وتعالى ههنا \"وبشروه بغلام عليم\" فالبشارة له هي بشارة لها لأن الولد منهما فكل منهما بشر به."
    },
    {
      "ayah": 29,
      "surah": 51,
      "text": "أي في صرخة عظيمة ورنة قاله ابن عباس رضي الله عنهما ومجاهد وعكرمة وأبو صالح والضحاك وزيد بن أسلم والثوري والسدي وهي قولها \"يا ويلتا\" \"فصكت وجهها\" أي ضربت بيدها على جبينها قاله مجاهد وابن سابط وقال ابن عباس رضي الله عنهما لطمت أي تعجبا كما تتعجب النساء من الأمر الغريب \"وقالت عجوز عقيم\" أي كيف ألد وأنا عجوز وقد كنت في حال الصبا عقيما لا أحبل؟."
    },
    { "ayah": 3, "surah": 51, "text": "قال علي رضي الله عنه: السفن." },
    { "ayah": 30, "surah": 51, "text": "أي عليم بما تستحقون من الكرامة حكيم في أقواله وأفعاله." },
    {
      "ayah": 31,
      "surah": 51,
      "text": "قال الله تعالى مخبرا عن إبراهيم عليه الصلاة والسلام \"فلما ذهب عن إبراهيم الروع وجاءته البشرى يجادلنا في قوم لوط إن إبراهيم لحليم أواه منيب يا إبراهيم أعرض عن هذا إنه قد جاء أمر ربك وإنهم آتيهم عذاب غير مردود\" وقال ههنا \"قال فما خطبكم أيها الرسلون\" أي ما شأنكم وفيم جئتم؟."
    },
    { "ayah": 32, "surah": 51, "text": "يعنون قوم لوط." },
    {
      "ayah": 33,
      "surah": 51,
      "text": "\" لنرسل عليهم حجارة من طين مسومة\" أي معلمة \"عند ربك للمسرفين\" أي مكتتبة عنده بأسمائهم كل حجر عليه اسم صاحبه فقال في سورة العنكبوت\" قال إن فيها لوطا قالوا نحن أعلم بمن فيها لننجينه وأهله إلا امرأته كانت من الغابرين."
    },
    {
      "ayah": 34,
      "surah": 51,
      "text": "\" لنرسل عليهم حجارة من طين مسومة\" أي معلمة \"عند ربك للمسرفين\" أي مكتتبة عنده بأسمائهم كل حجر عليه اسم صاحبه فقال في سورة العنكبوت\" قال إن فيها لوطا قالوا نحن أعلم بمن فيها لننجينه وأهله إلا امرأته كانت من الغابرين."
    },
    {
      "ayah": 35,
      "surah": 51,
      "text": "وقال تعالى ههنا \"فأخرجنا من كان فيها من المؤمنين\" وهم لوط وأهل بيته إلا امرأته."
    },
    {
      "ayah": 36,
      "surah": 51,
      "text": "احتج بهذه من ذهب إلى رأي المعتزل ممن لا يفرق بين مسمى الإيمان والإسلام لأنه أطلق عليهم المؤمنين والمسلمين وهذا الاستدلال ضعيف لأن هؤلاء كانوا قوما مؤمنين وعندنا أن كل مؤمن مسلم لا ينعكس فاتفق الاسمان ههنا لخصوصية الحال ولا يلزم ذلك في كل حال."
    },
    {
      "ayah": 37,
      "surah": 51,
      "text": "أي جعلناها عبرة ما أنزلنا بهم من العذاب والنكال وحجارة السجيل. وجعلنا محلتهم بحيرة منتنة خبيثة ففي ذلك عبرة للمؤمنين \"الذين يخافون العذاب الأليم\"."
    },
    {
      "ayah": 38,
      "surah": 51,
      "text": "يقول تعالى \"وفي موسى إذ أرسلناه إلى فرعون بسلطان مبين\" أي بدليل باهر وحجة قاطعة \"فتولى بركنه\" أي فأعرض فرعون عما جاءه به موسى من الحق المبين استكبارا وعنادا وقال مجاهد تعزز بأصحابه وقال قتادة غلب عدو الله على قومه."
    },
    {
      "ayah": 39,
      "surah": 51,
      "text": "وقال ابن زيد \"فتولى بركنه\" أى بجموعه التي معه ثم قرأ \"لو أن لي بكم قوة أو آوي إلى ركن شديد\" والمعنى الأول قوي كقوله تعالى \"ثاني عطفه ليضل عن سبيل الله\" أي معرض عن الحق مستكبر \"وقال ساحر أو مجنون\" أي لا يخلو أمرك فيما جئتني به من أن تكون ساحرا أو مجنونا."
    },
    {
      "ayah": 4,
      "surah": 51,
      "text": "قال علي رضي الله عنه: الملائكة. وقد روي في ذلك حديث مرفوع فقال الحافظ أبو بكر البزار حدثنا إبراهيم بن هانئ حدثنا سعيد بن سلام العطار حدثنا أبو بكر بن أبي سبرة عن يحيى بن سعيد عن سعيد بن المسيب قال جاء صبيغ التميمي إلى عمر بن الخطاب رضي الله عنه فقال يا أمير المؤمنين أخبرني عن الذاريات ذروا فقال رضي الله عنه هي الرياح ولولا أنى سمعت رسول الله صلى الله عليه وسلم يقوله ما قلته قال: فأخبرني عن المقسمات أمرا قال رضي الله عنه هي الملائكة ولولا أني سمعت رسول الله صلى الله عليه وسلم يقوله ما قلته قال فأخبرني عن الجاريات يسرا قال رضي الله عنه هي السفن ولولا أني سمعت رسول الله صلى الله عليه وسلم يقوله ما قلته ثم أمر بضربه فضرب مائة وجعل في بيت فلما برأ دعا به فضربه مائة أخرى وحمله على قتب وكتب إلى أبي موسى الأشعري رضي الله عنه امنع الناس من مجالسته فلم يزل كذلك حتى أتى أبا موسى رضي الله عنه فحلف بالأيمان المغلظة ما يجد في نفسه مما كان يجد شيئا فكتب في ذلك إلى عمر رضي الله عنه فكتب عمر ما إخاله إلا قد صدق فخل بينه وبين مجالسة الناس قال أبو بكر البزار فأبو بكر بن أبي سبرة لين وسعيد بن سلام ليس من أصحاب الحديث قلت فهذا الحديث ضعيف رفعه وأقرب ما فيه أنه موقوف على عمر رضي الله عنه فإن قصة صبيغ بن عسل مشهورة مع عمر رضي الله عنه وإنما ضربه لأنه ظهر له من أمره فيما يسأل تعنتا وعنادا والله أعلم. وقد ذكر الحافظ ابن عساكر هذه القصة في ترجمة صبيغ مطولة وهكذا فسرها ابن عباس وابن عمر رضي الله عنهم ومجاهد وسعيد بن جبير والحسن وقتادة والسدي وغير واحد ولم يحك ابن جرير وابن أبي حاتم غير ذلك وقد قيل إن المراد بالذاريات الريح كما تقدم وبالحاملات وقرا السحاب كما تقدم لأنها تحمل الماء كما قال زيد بن عمرو بن نفيل: وأسلمت نفسي لمن أسلمت له المـزن تحمل عذبا زلالا فأما الجاريات يسرا فالمشهور عن الجمهور كما تقدم أنها السفن تجري ميسرة في الماء جريا سهلا وقال بعضهم هي النجوم تجري يسرا في أفلاكها ليكون ذلك ترقيا من الأدنى إلى الأعلى إلى ما هو أعلى منه فالرياح فوقها السحاب والنجوم فوق ذلك والمقسمات أمرا الملائكة فوق ذلك تنزل بأوامر الله الشرعية والكونية وهذاة قسم من الله عز جل على وقوع المعاد."
    },
    {
      "ayah": 40,
      "surah": 51,
      "text": "أي ألقيناهم \"في اليم\" وهو البحر \"وهو مليم\" أي وهو ملوم كافر جاحد فاجر معاند."
    },
    {
      "ayah": 41,
      "surah": 51,
      "text": "ثم قال عز وجل \"وفي عاد إذ أرسلنا عليهم الريح العقيم\" أي المفسدة التي لا تنتج شيئا. قاله الضحاك وقتادة وغيرهما."
    },
    {
      "ayah": 42,
      "surah": 51,
      "text": "ولهذا قال تعالى \"ما تذر من شيء أتت عليه\" أي مما تفسده الريح \"إلا جعلته كالرميم\" أي كالشيء الهالك البالي وقد قال ابن أبي حاتم حدثنا أبو عبيدالله ابن أخي ابن وهب حدثنا عمي عبدالله بن وهب حدثني عبدالله يعني ابن عياش الغساني حدثني عبدالله بن سليمان عن دراج عن عيسى بن هلال الصدفي عن عبدالله بن عمرو رضي الله عنهما قال: قال رسول الله صلى الله عليه وسلم \"الريح مسخرة من الثانية - يعني من الأرض الثانية - فلما أراد الله تعالى أن يهلك عادا أمر خازن الريح أن يرسل عليهم ريحا تهلك عادا قال أي رب أرسل عليهم الريح قدر منخر الثور؟ قال له الجبار تبارك وتعالى لا إذا تكفأ الأرض ومن عليها ولكن أرسل عليهم بقدر خاتم فهي التي قال الله عز وجل في كتابه \"ما تذر من شيء أتت عليه إلا جعلته كالرميم\" \"هذا الحديث رفعه منكر والأقرب أن يكون موقوفا على عبدالله بن عمرو رضي الله عنهما من زاملتيه اللتين أصابهما يوم اليرموك والله أعلم قال سعيد بن المسيب وغيره في قوله تعالى \"إذ أرسلنا عليهم الريح العقيم\" قالوا هي الجنوب. وقد ثبت في الصحيح من رواية شعبة عن الحكم عن مجاهد عن ابن عباس رضي الله عنهما قال: قال رسول الله صلى الله عليه وسلم \"نصرت بالصبا وأهلكت عاد بالدبور\"."
    },
    {
      "ayah": 43,
      "surah": 51,
      "text": "قال ابن جرير يعني إلى وقت فناء آجالكم والظاهر أن هذه كقوله تعالى \"وأما ثمود فهديناهم فاستحبوا العمى على الهدى فأخذتهم صاعقة العذاب الهون\" وهكذا قال ههنا \"وفي ثمود إذ قيل لهم تمتعوا حتي حين فعتوا عن أمر ربهم فأخذتهم الصاعقة وهم ينظرون\" وذلك أنهم انتظروا العذاب ثلاثة أيام فجاءهم في صبيحة اليوم الرابع بكرة النهار."
    },
    {
      "ayah": 44,
      "surah": 51,
      "text": "\"وفي ثمود إذ قيل لهم تمتعوا حتى حين\" قال ابن جرير يعني إلى وقت فناء آجالكم والظاهر أن هذه كقوله تعالى \"وأما ثمود فهديناهم فاستحبوا العمى على الهدى فأخذتهم صاعقة العذاب الهون\" وهكذا قال ههنا \"وفي ثمود إذ قيل لهم تمتعوا حتي حين فعتوا عن أمر ربهم فأخذتهم الصاعقة وهم ينظرون\" وذلك أنهم انتظروا العذاب ثلاثة أيام فجاءهم في صبيحة اليوم الرابع بكرة النهار."
    },
    {
      "ayah": 45,
      "surah": 51,
      "text": "أي من هرب ولا نهوض \"وما كانوا منتصرين\" أي ولا يقدرون على أن ينتصروا مما هم فيه."
    },
    {
      "ayah": 46,
      "surah": 51,
      "text": "وقوله عز وجل \"وقوم نوح من قبل\" أي وأهلكنا قوم نوح من قبل هؤلاء \"إنهم كانوا قوما فاسقين\" وكل هذه القصص قد تقدمت مبسوطة في أماكن كثيرة من سور متعددة والله تعالى أعلم."
    },
    {
      "ayah": 47,
      "surah": 51,
      "text": "يقول تعالى منبها على خلق العالم العلوي والسفلي \"والسماء بنيناها\" أي جعلناها سقفا محفوظا رفيعا \"بأيد\" أي بقوة قاله ابن عباس ومجاهد وقتادة والثوري وغير واحد \"وإنا لموسعون\" أي قد وسعنا أرجاءها ورفعناها بغير عمد حتى استقلت كما هي."
    },
    {
      "ayah": 48,
      "surah": 51,
      "text": "\"والأرض فرشناها\" أي جعلناها فراشا للمخلوقات \"فنعم الماهدون\" أي وجعلناها مهدا لأهلها."
    },
    {
      "ayah": 49,
      "surah": 51,
      "text": "\"ومن كل شيء خلقنا زوجين\" أي جميع المخلوقات أزواج سماء وأرض وليل ونهار وشمس وقمر وبر وبحر وضياء وظلام وإيمان وكفر وموت وحياة وشقاء وسعادة وجنة ونار حتى الحيوانات والنباتات ولهذا قال تعالى \"لعلكم تذكرون\" أي لتعلموا أن الخالق واحد لا شريك له."
    },
    { "ayah": 5, "surah": 51, "text": "قال تعالى \"إنما توعدون لصادق\" أي لخبر صدق." },
    { "ayah": 50, "surah": 51, "text": "أي الجئوا إليه واعتمدوا في أموركم عليه \"إني لكم منه نذير مبين\"." },
    { "ayah": 51, "surah": 51, "text": "أي لا تشركوا به شيئا \"إني لكم منه نذير مبين\"." },
    {
      "ayah": 52,
      "surah": 51,
      "text": "يقول تعالى مسليا لنبيه صلى الله عليه وسلم وكما قال لك هؤلاء المشركون قال المكذبون الأولون لرسلهم \"كذلك ما أتى الذين من قبلهم من رسول إلا قالوا ساحر أو مجنون\"."
    },
    {
      "ayah": 53,
      "surah": 51,
      "text": "أي أوصى بعضهم بعضا بهذه المقالة؟ \"بل هم قوم طاغون\" أي لكن هم قوم طغاة تشابهت قلوبهم فقال متأخرهم كما قال متقدمهم."
    },
    { "ayah": 54, "surah": 51, "text": "أى فأعرض عنهم يا محمد \"فما أنت بملوم\" يعني فما نلومك على ذلك." },
    { "ayah": 55, "surah": 51, "text": "\"وذكر فإن الذكرى تنفع المؤمنين\" أي إنما تنتفع بها القلوب المؤمنة." },
    {
      "ayah": 56,
      "surah": 51,
      "text": "أي إنما خلقتهم لآمرهم بعبادتي لا لاحتياجي إليهم وقال علي بن أبي طلحة عن ابن عباس \"إلا ليعبدون\" أي إلا ليقروا بعبادتي طوعا أو كرها وهذا اختيار ابن جرير. وقال ابن جريج إلا ليعرفون وقال الربيع بن أنس \"إلا ليعبدون\" أي إلا للعبادة وقال السدي من العبادة ما ينفع ومنها ما لا ينفع \"ولئن سألتهم من خلق السموات والأرض ليقولن الله\" هذا منهم عبادة وليس ينفعهم مع الشرك. وقال الضحاك: المراد بذلك المؤمنون."
    },
    {
      "ayah": 57,
      "surah": 51,
      "text": "أي إنما خلقتهم لآمرهم بعبادتي لا لاحتياجي إليهم وقال علي بن أبي طلحة عن ابن عباس \"إلا ليعبدون\" أي إلا ليقروا بعبادتي طوعا أو كرها وهذا اختيار ابن جرير. وقال ابن جريج إلا ليعرفون وقال الربيع بن أنس \"إلا ليعبدون\" أي إلا للعبادة وقال السدي من العبادة ما ينفع ومنها ما لا ينفع \"ولئن سألتهم من خلق السموات والأرض ليقولن الله\" هذا منهم عبادة وليس ينفعهم مع الشرك. وقال الضحاك: المراد بذلك المؤمنون."
    },
    {
      "ayah": 58,
      "surah": 51,
      "text": "إن الله هو الرزاق ذو القوة المتين\" قال الإمام أحمد حدثنا يحيى بن آدم وأبو سعيد قالا حدثنا إسرائيل عن أبي إسحاق عن عبدالرحمن بن يزيد عن عبدالله بن مسعود رضي الله عنه قال أقرأني رسول الله صلى الله عليه وسلم \"إني أنا الرزاق ذو القوة المتين \"ورواه أبو داود والترمذي والنسائي من حديث إسرائيل وقال الترمذي حسن صحيح ومعنى الآية أنه تبارك وتعالى خلق العباد ليعبدوه وحده لا شريك له فمن أطاعه جازاه أتم الجزاء ومن عصاه عذبه أشد العذاب وأخبر أنه غير محتاج إليهم بل هم الفقراء إليه في جميع أحوالهم فهو خالقهم ورازقهم قال الإمام أحمد حدثنا محمد بن عبدالله حدثنا عمران - يعني ابن زائدة بن نشيط عن أبيه عن أبي خالد - هو الوالبي - عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم - يعني قال الله تعالى - \"يا ابن آدم تفرغ لعبادتي أملأ صدرك غنى وأسد فقرك وإلا تفعل ملأت صدرك شغلا ولم أسد فقرك \" ورواه الترمذي وابن ماجة من حديث عمران بن زائدة وقال الترمذي حسن غريب. وقد روى الإمام أحمد عن وكيع وأبي معاوية عن الأعمش عن سلام بن شرحبيل سمعت حبة وسواء ابني خالد يقولان: أتينا رسول الله صلى الله عليه وسلم وهو يعمل عملا أو يبني بناء - وقال أبو معاوية يصلح شيئا فأعناه عليه فلما فرغ دعا لنا وقال \"لا تيأسا من الرزق ما تهزهزت رؤوسكما فإن الإنسان تلده أمه أحمر ليس عليه قشرة ثم يعطيه الله ويرزقه\". وقد ورد في بعض الكتب الإلهية: يقول الله تعالى ابن آدم خلقتك لعبادتي فلا تلعب وتكفلت برزقك فلا تتعب فاطلبني تجدني فإن وجدتني وجدت كل شيء وإن فتك فاتك كل شيء وأنا أحب إليك من كل شيء."
    },
    {
      "ayah": 59,
      "surah": 51,
      "text": "أي نصيبا من العذاب \"مثل ذنوب أصحابهم فلا يستعجلون\" أي فلا يستعجلون ذلك فإنه واقع لا محالة."
    },
    { "ayah": 6, "surah": 51, "text": "\"وإن الدين\" وهو الحساب \"لواقع\" أي لكائن لا محالة." },
    { "ayah": 60, "surah": 51, "text": "يعني يوم القيامة. آخر تفسير سورة الذاريات ولله الحمد والمنة." },
    {
      "ayah": 7,
      "surah": 51,
      "text": "قال ابن عباس رضي الله عنهما ذات الجمال والبهاء والحسن والاستواء وكذا قال مجاهد وعكرمة وسعيد بن جبير وأبو مالك وأبو عكرمة والسدي وقتادة وعطية العوفي والربيع بن أنس وغيرهم. وقال الضحاك والمنهال بن عمرو وغيرهما مثل تجعد الماء والرمل والزرع إذا ضربته الريح فينسج بعضه بعضا طرائق طرائق فذلك الحبك قال ابن جرير حدثني يعقوب بن إبراهيم حدثنا ابن علية حدثنا أيوب عن أبي قلابة عن رجل من أصحاب النبي صلى الله عليه وسلم عن رسول الله صلى الله عليه وسلم أنه قال \"إن من ورائكم الكذاب المضل وإن رأسه من ورائه حبكا حبكا\" يعني بالحبك الجعودة وعن أبي صالح \"ذات الحبك\" الشدة وقال خصيف \"ذات الحبك\" ذات الصفافة وقال الحسن بن أبي الحسن البصري \"ذات الحبك\" حبكت بالنجوم. وقال قتادة عن سالم بن أبي عن معدان بن أبي طلحة عن عمرو البكالي عن عبدالله بن عمر رضي الله عنهما \"والسماء ذات الحبك\" يعني السماء السابعة وكأنه والله أعلم أراد بذلك السماء التي فيها الكواكب الثابتة وهي عند كثير من علماء الهيئة في الفلك الثامن الذي فوق السابع والله أعلم. وكل هذه الأقوال ترجع إلى شيء واحد وهو الحسن والبهاء كما قال ابن عباس رضي الله عنهما فإنها من حسنها مرتفعة شفافة صفيقة شديدة البناء متسعة الأرجاء أنيقة البهاء مكللة بالنجوم الثوابت والسيارات موشحة بالشمس والقمر والكواكب الزاهرات."
    },
    {
      "ayah": 8,
      "surah": 51,
      "text": "أي إنكم أيها المشركون المكذبون للرسل لفي قول مختلف مضطرب لا يلتئم ولا يجتمع وقال قتادة إنكم لفي قول مختلف ما بين مصدق بالقرآن ومكذب به."
    },
    {
      "ayah": 9,
      "surah": 51,
      "text": "أي إنما يروج على من هو ضال في نفسه لأنه قول باطل إنما ينقاد له ويضل بسببه ويؤفك عنه من هو مأفوك ضال غمر لا فهم له كما قال تعالى \"فإنكم وما تعبدون ما أنتم عليه بقاتنين إلا من هو صال الجحيم\" قال ابن عباس رضي الله عنهما والسدي \"يؤفك عنه من أفك\" يضل عنه من ضل وقال مجاهد \"يؤفك عنه من أفك\" يؤفن عنه من أفن وقال الحسن البصري يصرف عن هذا القرآن من كذب به."
    }
  ]
}
