{
  "ayahs": [
    {
      "ayah": 1,
      "surah": 52,
      "text": "سورة الطور: قال مالك عن الزهري عن محمد بن جبير بن مطعم عن أبيه سمعت النبي صلى الله عليه وسلم يقرأ فى المغرب بالطور فما سمعت أحدا أحسن صوتا أو قراءة منه أخرجاه من طريق مالك وقال البخاري حدثنا عبدالله بن يوسف أخبرنا مالك عن محمد بن عبدالرحمن بن نوفل عن عروة عن زينب بنت أبي سلمة عن أم سلمة قالت شكوت إلى رسول الله صلى الله عليه وسلم أني أشتكي فقال \"طوفي من وراء الناس وأنت راكبة\" فطفت ورسول الله صلى الله عليه وسلم يصلي إلى جنب البيت يقرأ بالطور وكتاب مسطور. يقسم تعالى بمخلوقاته الدالة على قدرته العظيمة أن عذابه واقع بأعدائه وأنه لا دافع له عنهم فالطور هو الجبل الذي يكون فيه أشجار مثل الذي كلم الله عليه موسى وأرسل منه عيسى وما لم يكن فيه شجر لا يسمى طورا إنما يقال له جبل."
    },
    { "ayah": 10, "surah": 52, "text": "أي تذهب فتصير هباء منبثا وتنسف نسفا." },
    { "ayah": 11, "surah": 52, "text": "أي ويل لهم ذلك اليوم من عذاب الله ونكاله بهم وعقابه لهم." },
    { "ayah": 12, "surah": 52, "text": "أي هم في الدنيا يخوضون في الباطل ويتخذون دينهم هزوا ولعبا." },
    {
      "ayah": 13,
      "surah": 52,
      "text": "\"يوم يدعون\" أي يدفعون ويساقون \"إلى نار جهنم دعا\" وقال مجاهد والشعبي ومحمد بن كعب والضحاك والسدي والثوري يدفعون فيها دفعا."
    },
    { "ayah": 14, "surah": 52, "text": "أي تقول له الزبانية ذلك تقريعا وتوبيخا." },
    {
      "ayah": 15,
      "surah": 52,
      "text": "\"أفسحر هذا أم أنتم لا تبصرون اصلوها\" أي ادخلوها دخول من تغمره من جميع جهاته \"فاصبروا أولا تصبروا سواء عليكم\" أي سواء صبرتم على عذابها ونكالها أم لم تصبروا لا محيد لكم عنها ولا خلاص لكم منها و\"إنما تجزون ما كنتم تعملون\" أي ولا يظلم الله أحدا بل يجازي كلا بعمله."
    },
    {
      "ayah": 16,
      "surah": 52,
      "text": "\"أفسحر هذا أم أنتم لا تبصرون اصلوها\" أي ادخلوها دخول من تغمره من جميع جهاته \"فاصبروا أولا تصبروا سواء عليكم\" أي سواء صبرتم على عذابها ونكالها أم لم تصبروا لا محيد لكم عنها ولا خلاص لكم منها و\"إنما تجزون ما كنتم تعملون\" أي ولا يظلم الله أحدا بل يجازي كلا بعمله."
    },
    {
      "ayah": 17,
      "surah": 52,
      "text": "أخبر الله تعالى عن حال السعداء فقال \"إن المتقين في جنات ونعيم\" وذلك بضد ما أولئك فيه من العذاب والنكال."
    },
    {
      "ayah": 18,
      "surah": 52,
      "text": "\"فاكهين بما آتاهم ربهم\" أي يتفكهون بما آتاهم الله من النعيم من أصناف الملاذ من مآكل ومشارب وملابس ومساكن ومراكب وغير ذلك \"ووقاهم ربهم عذاب الجحيم\" أي وقد نجاهم من عذاب النار وتلك نعمة مستقلة بذاتها على حدتها مع ما أضيف إليها من دخول الجنة التي فيها من السرور مالا عين رأت ولا أذن سمعت ولا خطر على قلب بشر."
    },
    {
      "ayah": 19,
      "surah": 52,
      "text": "كقوله تعالى \"كلوا واشربوا هنيئا بما أسلفتم في الأيام الخالية\" أي هذا بذاك تفضلا منه وإحسانا."
    },
    {
      "ayah": 2,
      "surah": 52,
      "text": "\"وكتاب مسطور\" قيل هو اللوح المحفوظ وقيل الكتب المنزلة المكتوبة التي تقرأ على الناس جهارا."
    },
    {
      "ayah": 20,
      "surah": 52,
      "text": "وقوله تعالى \"متكئين على سرر مصفوفة\" قال الثوري عن حصين عن مجاهد عن ابن عباس السرر في الحجال وقال ابن أبي حاتم حدثنا أبي حدثنا أبو اليمان حدثنا صفوان بن عمرو أنه سمع الهيثم بن مالك الطائي يقول إن رسول الله صلى الله عليه وسلم قال \"إن الرجل ليتكئ المتكأ مقدار أربعين سنة ما يتحول عنه ولا يمله يأتيه ما اشتهت نفسه ولذت عينه\". وحدثنا أبي أخبرنا هدبة بن خالد عن سليمان بن المغيرة عن ثابت قال بلغنا أن الرجل ليتكئ في الجنة سبعين سنة عنده من أزواجه وخدمه وما أعطاه الله من الكرامة والنعيم فإذا حانت منه نظرة فإذا أزواج له لم يكن رآهن قبل ذلك فيقلن قد آن لك أن تجعل لنا منك نصيبا ومعنى \"مصفوفة\" أي وجوه بعضهم إلى بعض كقوله \"على سرر متقابلين\" \"وزوجناهم بحور عين\" أى وجعلنا لهم قرينات صالحات وزوجات حسان من الحور العين وقال مجاهد \"وزوجناهم\" أنكحناهم بحور عين وقد تقدم وصفهم في غير موضع بما أغنى عن إعادته ههنا."
    },
    {
      "ayah": 21,
      "surah": 52,
      "text": "يخبر تعالى عن فضله وكرمه وامتنانه ولطفه بخلقه وإحسانه أن المؤمنين إذا اتبعتهم ذرياتهم في الإيمان يلحقهم بآبائهم في المنزلة وإن لم يبلغوا عملهم لتقر أعين الآباء بالأبناء عندهم في منازلهم فيجمع بينهم على أحسن الوجوه بأن يرفع الناقص العمل بكامل العمل ولا ينقص ذلك من عمله ومنزلته للتساوي بينه وبين ذاك ولهذا قال \"ألحقنا بهم ذريتهم وما ألتناهم من عملهم من شيء\" قال الثوري عن عمرو بن مرة عن سعيد بن جبير عن ابن عباس قال: إن الله ليرفع ذرية المؤمن في درجته وإن كانوا دونه في العمل لتقر بهم عينه ثم قرأ \"والذين آمنوا واتبعتهم ذريتهم بإيمان الحقنا بهم ذريتهم وما ألتناهم من عملهم من شيء\" ورواه ابن جرير وابن أبي حاتم من حديث سفيان الثوري به. وكذا رواه ابن جرير من حديث شعبة عن عمرو بن مرة به ورواه البزاز عن سهل بن بحر عن الحسن بن حماد الوراق عن قيس بن الربيع عن عمرو بن مرة عن سعيد عن ابن عباس مرفوعا فذكره ثم قال وقد رواه الثوري عن عمرو بن مرة عن سعيد بن ابن عباس موقوفا. وقال ابن أبي حاتم حدثنا العباس بن الوليد بن يزيد البيروتي أخبرني محمد بن سعيد أخبرني شيبان أخبرني ليث عن حبيب بن أبي ثابت الأسدي عن سعيد بن جبير عن ابن عباس في قول الله تعالى \"والذين آمنوا واتبعتهم ذريتهم بإيمان ألحقنا بهم ذريتهم\" قال هم ذرية المؤمن يموتون على الإيمان فإن كانت منازل آبائهم أرفع من منازلهم ألحقوا بآبائهم ولم ينقصوا من أعمالهم التي عملوها شيئا. وقال الحافظ الطبراني حدثنا الحسين بن إسحاق التستري حدثنا محمد بن عبد الرحمن بن غزوان حدثنا شريك عن سالم الأفطس عن سعيد بن جبير عن ابن عباس أظنه عن النبي صلى الله عليه وسلم قال \"إذا دخل الرجل الجنة سأل عن أبويه وزوجته وولده فيقال إنهم لم يبلغوا دجتك فيقول يا رب قد عملت لي ولهم فيؤمر بإلحاقهم به\" وقرأ ابن عباس \"والذين آمنوا واتبعتهم ذريتهم بإيمان\" الآية. وقال العوفي عن ابن عباس في هذه الآية يقول والذين أدرك ذريتهم الإيمان فعملوا بطاعتي ألحقتهم بإيمانهم إلى الجنة وأولادهم الصغار تلحق بهم وهذا راجع إلى التفسير الأول فإن ذلك مفسر اصرح من هذا. وهكذا يقول الشعبي وسعيد بن جبير وإبراهيم وقتادة وأبو صالح والربيع بن أنس والضحاك وابن زيد وهو اختيار ابن جرير وقد قال عبدالله بن الإمام أحمد حدثنا عثمان بن أبي شيبة حدثنا محمد بن فضيل عن محمد بن عثمان عن زاذان عن علي قال سألت خديجة النبي صلى الله عليه وسلم عن ولدين ماتا لها في الجاهلية فقال رسول الله صلى الله عليه وسلم \"هما في النار\" فلما رأى الكراهية في وجهها قال \"لو رأيت مكانهما لأبغضتهما\" قالت يا رسول الله فولدي منك قال \"في الجنة\" قال ثم قال رسول الله صلى الله عليه وسلم \"إن المؤمنين وأولادهم فى الجنة وإن المشركين وأولادهم في النار\" ثم قرأ رسول الله صلى الله عليه وسلم \" \"والذين آمنوا واتبعتهم ذريتهم بإيمان\" \" الآية هذا فضله تعالى على الأبناء ببركة عمل الآباء وأما فضله على الآباء ببركة دعاء الأبناء فقد قال الإمام أحمد حدثنا يزيد حدثنا حماد بن سلمة عن عاصم بن أبي النجود عن أبي صالح عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم \"إن الله ليرفع الدرجة للعبد الصالح في الجنة فيقول يا رب أني لي هذه؟ فيقول باستغفار ولدك لك\" إسناده صحيح ولم يخرجوه من هذا الوجه ولكن له شاهد في صحيح مسلم عن أبي هريرة عن رسول الله صلى الله عليه وسلم \"إذا مات ابن آدم انقطع عمله إلا من ثلاث صدقة جارية أو علم ينتفع به أو ولد صالح يدعو له\" وقوله تعالى \"كل امرئ بما كسب رهين\" لما أخبر عن مقام الفضل وهو رفع درجة الذرية إلى منزلة الآباء عن غير عمل يقتضي ذلك أخبر عن مقام العدل وهو أنه لا يؤاخذ أحدا بذنب أحد فقال تعالى \"كل امرئ بما كسب رهين\" أي مرتهن بعمله لا يحمل عليه ذنب غيره من الناس سواء كان أبا أو ابنا كما قال تعالى \"كل نفس بما كسبت رهينة إلا أصحاب اليمين في جنات يتساءلون عن المجرمين."
    },
    {
      "ayah": 22,
      "surah": 52,
      "text": "أي وألحقناهم بفواكه ولحوم من أنواع شتى مما يستطاب ويشتهى. وقوله \"يتنازعون فيها كأسا\" أي تعاطون فيها كأسا أي من الخمر قاله الضحاك \"لا لغو فيها ولا تأثيم\" أي لا يتكلمون فيها بكلام لاغ أي هذيان ولا إثم أي فحش كما يتكلم به الشربة من أهل الدنيا قال ابن عباس: اللغو الباطل والتأثيم الكذب وقال مجاهد لا يستبون ولا يؤثمون وقال قتادة كان ذلك في الدنيا مع الشيطان فنزه الله خمر الآخرة عن قاذورات خمر الدنيا وأذاها كما تقدم فنفى عنها صداع الرأس ووجع البطن وإزالة العقل بالكلية وأخبر أنها لا تحملهم على الكلام السيء الفارغ عن الفائدة المتضمن هذيانا وفحشا وأخبر بحسن منظرها وطيب طعمها ومخبرها فقال \"بيضاء لذة للشاربين لا فيها غول ولا هم عنها ينزفون\" وقال \"لا يصدعون عنها ولا ينزفون\" وقال ههنا \"يتنازعون فيها كأسا لا لغو فيها ولا تأثيم\"."
    },
    {
      "ayah": 23,
      "surah": 52,
      "text": "أي وألحقناهم بفواكه ولحوم من أنواع شتى مما يستطاب ويشتهى. وقوله \"يتنازعون فيها كأسا\" أي تعاطون فيها كأسا أي من الخمر قاله الضحاك \"لا لغو فيها ولا تأثيم\" أي لا يتكلمون فيها بكلام لاغ أي هذيان ولا إثم أي فحش كما يتكلم به الشربة من أهل الدنيا قال ابن عباس: اللغو الباطل والتأثيم الكذب وقال مجاهد لا يستبون ولا يؤثمون وقال قتادة كان ذلك في الدنيا مع الشيطان فنزه الله خمر الآخرة عن قاذورات خمر الدنيا وأذاها كما تقدم فنفى عنها صداع الرأس ووجع البطن وإزالة العقل بالكلية وأخبر أنها لا تحملهم على الكلام السيء الفارغ عن الفائدة المتضمن هذيانا وفحشا وأخبر بحسن منظرها وطيب طعمها ومخبرها فقال \"بيضاء لذة للشاربين لا فيها غول ولا هم عنها ينزفون\" وقال \"لا يصدعون عنها ولا ينزفون\" وقال ههنا \"يتنازعون فيها كأسا لا لغو فيها ولا تأثيم\"."
    },
    {
      "ayah": 24,
      "surah": 52,
      "text": "وقوله تعالى \"ويطوف عليهم غلمان لهم كأنهم لؤلؤ مكنون\" إخبار عن خدمهم وحشمهم في الجنة كأنهم اللؤلؤ الرطب المكنون في حسنهم وبهائم ونظافتهم وحسن ملابسهم كما قال \"ويطوف عليهم ولدان مخلدون بأكواب وأباريق وكأس من معين\"."
    },
    {
      "ayah": 25,
      "surah": 52,
      "text": "أي أقبلوا يتحادثون ويتساءلون عن أعمالهم وأحوالهم في الدنيا وهذا كما يتحدث أهل الشراب على شرابهم إذا أخذ فيهم الشراب بما كان من أمرهم."
    },
    {
      "ayah": 26,
      "surah": 52,
      "text": "أي كنا في الدار الدنيا ونحن بين أهلينا خائفين من ربنا مشفقين من عذابه وعقابه فمن الله علينا ووقانا عذاب السموم أي فتصدق علينا وأجارنا مما نخاف \"إنا كنا من قبل ندعوه\" أي نتضرع إليه فاستجاب لنا وأعطانا سؤالنا \"إنه هو البر الرحيم\"."
    },
    {
      "ayah": 27,
      "surah": 52,
      "text": "وقد ورد في هذا المقام حديث رواه الحافظ أبو بكر البزار فى مسنده فقال حدثنا سلمة بن شبيب حدثنا سعيد بن دينار حدثنا الربيع بن صبيح عن الحسن عن أنس قال: قال رسول الله صلى الله عليه وسلم \"إذا دخل أهل الجنة الجنة اشتاقوا إلى الإخوان فيجيء سرير هذا حتى يحاذي سرير هذا فيتحدثان فيتكئ هذا ويتكئ هذا فيتحدثان بما كان في الدنيا فيقول أحدهما لصاحبه يا فلان تدرى أى يوم غفر الله لنا؟ يوم كنا في موضع كذا وكذا فدعونا الله عز وجل فغفر لنا\" ثم قال البزار لا نعرفه يروى إلا بهذا الإسناد قلت وسعيد بن دينار الدمشقي قال أبو حاتم هو مجهول وشيخه الربيع بن صبيح وقد تكلم فيه غير واحد من جهة حفظه وهو رجل صالح ثقة في نفسه. وقال ابن أبي حاتم حدثنا عمرو بن عبدالله الأودي حدثنا وكيع عن الأعمش عن أبي الضحى عن مسروق عن عائشة أنها قرأت هذه الآية \"فمن الله علينا ووقانا عذاب السموم إنا كنا من قبل ندعوه إنه هو البر الرحيم\" فقالت اللهم من علينا وقنا عذاب السموم إنك أنت البر الرحيم. قيل للأعمش في الصلاة؟ قال نعم."
    },
    {
      "ayah": 28,
      "surah": 52,
      "text": "يقول تعالى آمرا رسوله صلى الله عليه وسلم بأن يبلغ رسالته إلى عباده وأن يذكرهم بما أنزل الله عليه ثم نفى عنه ما يرميه به أهل البهتان والفجور فقال \"فذكر فما أنت بنعمة ربك بكاهن ولا مجنون\" أي لست بحمد الله بكاهن كما تقول الجهلة من كفار قريش والكاهن الذي يأتيه الرئي من الجان بالكلمة يتلقاها من خبر السماء \"ولا مجنون\" وهو الذي يتخبطه الشيطان من المس."
    },
    {
      "ayah": 29,
      "surah": 52,
      "text": "يقول تعالى آمرا رسوله صلى الله عليه وسلم بأن يبلغ رسالته إلى عباده وأن يذكرهم بما أنزل الله عليه ثم نفى عنه ما يرميه به أهل البهتان والفجور فقال \"فذكر فما أنت بنعمة ربك بكاهن ولا مجنون\" أي لست بحمد الله بكاهن كما تقول الجهلة من كفار قريش والكاهن الذي يأتيه الرئي من الجان بالكلمة يتلقاها من خبر السماء \"ولا مجنون\" وهو الذي يتخبطه الشيطان من المس."
    },
    {
      "ayah": 3,
      "surah": 52,
      "text": "ولهذا قال \"في رق منشور والبيت المعمور\" ثبت فى الصحيحين أن رسول الله صلى الله عليه وسلم قال في حديث الإسراء بعد مجاوزته إلى السماء السابعة \"ثم رفع بي إلى البيت المعمور وإذا هو يدخله كل يوم سبعون ألفا لا يعودون إليه آخر ما عليهم\" يعني يتعبدون فيه ويطوفون به كما يطوف أهل الأرض بكعبتهم كذلك ذاك البيت المعمور هو كعبة أهل السماء السابعة ولهذا وجد إبراهيم الخليل عليه الصلاة والسلام مسندا ظهره إلى البيت المعمور لأنه باني الكعبة الأرضية والجزاء من جنس العمل وهو بحيال الكعبة وفي كل سماء بيت يتعبد فيه أهلها ويصلون إليه والذي في السماء الدنيا يقال له بيت العزة والله أعلم. وقال ابن أبي حاتم حدثنا أبي حدثنا هشام بن عمار حدثنا الوليد بن مسلم حدثنا روح بن جناح عن الزهري عن سعيد بن المسيب عن أبي هريرة عن النبي صلى الله عليه وسلم قال \"في السماء السابعة بيت يقال له المعمور بحيال الكعبة وفي السماء الرابعة نهر يقال له الحيوان يدخله جبريل كل يوم فينغمس فيه انغماسة ثم يخرج فينتفض انتفاضة يخر عنه سبعون ألف قطرة يخلق الله في كل قطرة ملكا يؤمرون أن البيت المعمور فيصلون فيه فيفعلون ثم يخرجون فلا يعودون إليه أبدا ويولى عليهم أحدهم يؤمر أن يقف بهم من السماء موقفا يسبحون الله فيه إلى أن تقوم الساعة\" هذا حديث غريب جدا تفرد به روح بن جناح هذا وهو القرشي الأموي مولاهم أبو سعيد الدمشقي وقد أنكر عليه هذا الحديث جماعة من الحفاظ منهم الجوزجاني والعقيلي والحاكم أبو عبدالله النيسابوري وغيرهم قال الحاكم لا أصل له من حديث أبي هريرة ولا سعيد ولا الزهري وقال ابن جرير حدثنا هناد بن السرى حدثنا أبو الأحوص عن سماك بن حرب عن خالد بن عرعرة أن رجلا قال لعلي ما البيت المعمور؟ قال بيت في السماء يقال له الضراح وهو بحيال الكعبة من فوقها حرمته في السماء كحرمة البيت في الأرض يصلي فيه كل يوم سبعون ألفا من الملائكة ثم لا يعودون فيه أبدا وكذا رواه شعبة وسفيان الثوري عن سماك وعندهما أن ابن الكواء هو السائل عن ذلك ثم رواه ابن جرير عن أبي كريب عن طلق بن غنام عن زائدة عن عاصم عن علي بن ربيعة قال سأل ابن الكواء عليا عن البيت المعمور قال مسجد في السماء يقال له الضراح يدخله كل يوم سبعون ألفا من الملائكة ثم لا يعودون فيه أبدا. رواه من حديث أبي الطفيل عن علي بمثله. وقال العوفي عن ابن عباس هو بيت حذاء العرش تعمره الملائكة يصلي فيه كل يوم سبعون ألفا من الملائكة ثم لا يعودون إليه وكذا قال عكرمة ومجاهد وغير واحد من السلف وقال قتادة والربيع بن أنس والسدي ذكر لنا أن رسول الله صلى الله عليه وسلم قال يوما لأصحابه \"هل تدرون ما البيت المعمور؟ \" قالوا الله ورسوله أعلم قال \"فإنه مسجد في السماء بحيال الكعبة لو خر لخر عليها يصلي فيه كل يوم سبعون ألف ملك إذا خرجوا منه لم يعودوا آخر ما عليهم\" وزعم الضحاك أنه يعمره طائفة من الملائكة يقال لهم الجن من قبيلة إبليس فالله أعلم."
    },
    {
      "ayah": 30,
      "surah": 52,
      "text": "ثم قال تعالى منكرا عليهم في قولهم في الرسول صلى الله عليه وسلم \"أم يقولون شاعر نتربص به ريب المنون\" أي قوارع الدهر والمنون الموت يقولون ننتظره ونصبر عليه حتى يأتيه الموت فنستريح منه ومن شأنه."
    },
    {
      "ayah": 31,
      "surah": 52,
      "text": "قال الله تعالى \"قل تربصوا فإني معكم من المتربصين\" أي انتظروا فإني منتظر معكم وستعلمون لمن تكون العاقبة والنصرة فى الدنيا والآخرة. قال محمد بن إسحاق عن عبدالله بن أبي نجيح عن مجاهد عن ابن عباس رضي الله عنهما إن قريشا لما اجتمعوا في دار الندوة في أمر النبي صلى الله عليه وسلم قال قائل منهم احتبسوه في وثاق وتربصوا به ريب المنون حتى يهلك كما هلك من كان قبله من الشعراء زهير والنابغة إنما هو كأحدهم فأنزل الله تعالى ذلك من قولهم \"أم يقولون شاعر نتربص به ريب المنون\"."
    },
    {
      "ayah": 32,
      "surah": 52,
      "text": "ثم قال تعالى \"أم تأمرهم أحلامهم بهذا\" أي عقولهم تأمرهم بهذا الذي يقولونه فيك من الأقاويل الباطلة التي يعلمون في أنفسهم أنها كذب وزور \"أم هم قوم طاغون\" أي ولكن هم قوم طاغون ضلال معاندون فهذا هو الذي يحملهم على ما قالوه فيك."
    },
    {
      "ayah": 33,
      "surah": 52,
      "text": "وقوله تعالى \"أم يقولون تقوله\" أي اختلقه وافتراه من عند نفسه يعنون القرآن قال الله تعالى \"بل لا يؤمنون\" أي كفرهم هو الذي حملهم على هذه المقالة."
    },
    {
      "ayah": 34,
      "surah": 52,
      "text": "أي إن كانوا صادقين في قولهم تقوله وافتراه فليأتوا بمثل ما جاء به محمد صلى الله عليه وسلم من هذا القرآن فإنهم لو اجتمعوا هم وجميع أهل الأرض من الجن والإنس ما جاءوا بمثله ولا بعشر سور من مثله ولا بسورة من مثله."
    },
    {
      "ayah": 35,
      "surah": 52,
      "text": "هذا المقام في إثبات الربوبية وتوحيد الألوهية فقال تعالى \"أم خلقوا من غير شيء أم هم الخالقون\" أي أوجدوا من غير موجد؟ أم هم أوجدوا أنفسهم أي لا هذا ولا هذا بل الله هو الذي خلقهم وأنشأهم بعد أن لم يكونوا شيئا مذكورا. قال البخاري حدثنا الحميدي حدثنا سفيان قال حدثني عن الزهري عن محمد بن جبير بن مطعم عن أبيه قال سمعت النبي صلى الله عليه وسلم يقرأ في المغرب بالطور فلما بلغ هذه الآية \"أم خلقوا من غير شيء أم هم الخالقون أم خلقوا السموات والأرض بل لا يوقنون أم عندهم خزائن ربك أم هم المسيطرون\" كاد قلبي أن يطير وهذا الحديث مخرج في الصحيحين من طرق عن الزهري به وجبير بن مطعم كان قد قدم على النبي صلى الله عليه وسلم بعد وقعة بدر في فداء الأسارى وكان إذ ذاك مشركا فكان سماعه هذه الآية من هذه السورة من جملة ما حمله على الدخول في الإسلام بعد ذلك."
    },
    {
      "ayah": 36,
      "surah": 52,
      "text": "أي أهم خلقوا السموات والأرض؟ وهذا إنكار عليهم في شركهم بالله وهم يعلمون أنه الخالق وحده لا شريك له ولكن عدم إيقانهم هو الذي يحملهم على ذلك."
    },
    {
      "ayah": 37,
      "surah": 52,
      "text": "أي أهم يتصرفون فى الملك وبيدهم مفاتيح الخزائن \"أم هم المصيطرون\" أي المحاسبون للخلائق؟ ليس الأمر كذلك بل الله عز وجل هو المالك المتصرف الفعال لما يريد."
    },
    {
      "ayah": 38,
      "surah": 52,
      "text": "\"أم لهم سلم يستمعون فيه\" أي مرقاة إلى الملإ الأعلى \"فليأت مستمعهم بسلطان مبين\" أي فليأت الذي يستمع لهم بحجة ظاهرة على صحة ما هم فيه من الفعال والمقال أي وليس لهم سبيل إلى ذلك فليسوا على شيء ولا لهم دليل."
    },
    {
      "ayah": 39,
      "surah": 52,
      "text": "ثم قال منكرا عليهم فيما نسبوه إليه من البنات الملائكة إناثا واختيارهم لأنفسهم الذكور على الإناث بحيث إذا بشر أحدهم بالأنثى ظل وجهه مسودا وهو كظيم \"أم له البنات ولكم البنون\" هذا وقد جعلوا الملائكة بنات الله وعبدوهم مع الله."
    },
    {
      "ayah": 4,
      "surah": 52,
      "text": "ولهذا قال \"في رق منشور والبيت المعمور\" ثبت فى الصحيحين أن رسول الله صلى الله عليه وسلم قال في حديث الإسراء بعد مجاوزته إلى السماء السابعة \"ثم رفع بي إلى البيت المعمور وإذا هو يدخله كل يوم سبعون ألفا لا يعودون إليه آخر ما عليهم\" يعني يتعبدون فيه ويطوفون به كما يطوف أهل الأرض بكعبتهم كذلك ذاك البيت المعمور هو كعبة أهل السماء السابعة ولهذا وجد إبراهيم الخليل عليه الصلاة والسلام مسندا ظهره إلى البيت المعمور لأنه باني الكعبة الأرضية والجزاء من جنس العمل وهو بحيال الكعبة وفي كل سماء بيت يتعبد فيه أهلها ويصلون إليه والذي في السماء الدنيا يقال له بيت العزة والله أعلم. وقال ابن أبي حاتم حدثنا أبي حدثنا هشام بن عمار حدثنا الوليد بن مسلم حدثنا روح بن جناح عن الزهري عن سعيد بن المسيب عن أبي هريرة عن النبي صلى الله عليه وسلم قال \"في السماء السابعة بيت يقال له المعمور بحيال الكعبة وفي السماء الرابعة نهر يقال له الحيوان يدخله جبريل كل يوم فينغمس فيه انغماسة ثم يخرج فينتفض انتفاضة يخر عنه سبعون ألف قطرة يخلق الله في كل قطرة ملكا يؤمرون أن البيت المعمور فيصلون فيه فيفعلون ثم يخرجون فلا يعودون إليه أبدا ويولى عليهم أحدهم يؤمر أن يقف بهم من السماء موقفا يسبحون الله فيه إلى أن تقوم الساعة\" هذا حديث غريب جدا تفرد به روح بن جناح هذا وهو القرشي الأموي مولاهم أبو سعيد الدمشقي وقد أنكر عليه هذا الحديث جماعة من الحفاظ منهم الجوزجاني والعقيلي والحاكم أبو عبدالله النيسابوري وغيرهم قال الحاكم لا أصل له من حديث أبي هريرة ولا سعيد ولا الزهري وقال ابن جرير حدثنا هناد بن السرى حدثنا أبو الأحوص عن سماك بن حرب عن خالد بن عرعرة أن رجلا قال لعلي ما البيت المعمور؟ قال بيت في السماء يقال له الضراح وهو بحيال الكعبة من فوقها حرمته في السماء كحرمة البيت في الأرض يصلي فيه كل يوم سبعون ألفا من الملائكة ثم لا يعودون فيه أبدا وكذا رواه شعبة وسفيان الثوري عن سماك وعندهما أن ابن الكواء هو السائل عن ذلك ثم رواه ابن جرير عن أبي كريب عن طلق بن غنام عن زائدة عن عاصم عن علي بن ربيعة قال سأل ابن الكواء عليا عن البيت المعمور قال مسجد في السماء يقال له الضراح يدخله كل يوم سبعون ألفا من الملائكة ثم لا يعودون فيه أبدا. رواه من حديث أبي الطفيل عن علي بمثله. وقال العوفي عن ابن عباس هو بيت حذاء العرش تعمره الملائكة يصلي فيه كل يوم سبعون ألفا من الملائكة ثم لا يعودون إليه وكذا قال عكرمة ومجاهد وغير واحد من السلف وقال قتادة والربيع بن أنس والسدي ذكر لنا أن رسول الله صلى الله عليه وسلم قال يوما لأصحابه \"هل تدرون ما البيت المعمور؟ \" قالوا الله ورسوله أعلم قال \"فإنه مسجد في السماء بحيال الكعبة لو خر لخر عليها يصلي فيه كل يوم سبعون ألف ملك إذا خرجوا منه لم يعودوا آخر ما عليهم\" وزعم الضحاك أنه يعمره طائفة من الملائكة يقال لهم الجن من قبيلة إبليس فالله أعلم."
    },
    {
      "ayah": 40,
      "surah": 52,
      "text": "\"أم تسألهم أجرا\" أي أجرة على إبلاغك إياهم رسالة الله؟ أي لست تسألهم على ذلك شيئا \"فهم من مغرم مثقلون\" أي فهم من أدنى شيء يتبرمون منه ويثقلهم ويشق عليهم\"."
    },
    { "ayah": 41, "surah": 52, "text": "أي ليس الأمر كذلك فإنه لا يعلم أحد من أهل السموات والأرض الغيب إلا الله." },
    {
      "ayah": 42,
      "surah": 52,
      "text": "يقول تعالى أم يريد هؤلاء بقولهم هذا في الرسول وفي الدين غرور الناس وكيد الرسول وأصحابه فكيدهم إنما يرجع وباله على أنفسهم فالذين كفروا هم المكيدون."
    },
    {
      "ayah": 43,
      "surah": 52,
      "text": "وهذا إنكار شديد على المشركين في عبادتهم الأصنام والأنداد مع الله ثم نزه نفسه الكريمة عما يقولون ويفترون ويشركون فقال \"سبحان الله عما يشركون\"."
    },
    {
      "ayah": 44,
      "surah": 52,
      "text": "يقول تعالى مخبرا عن المشركين بالعناد والمكابرة للمحسوس \"وإن يروا كسفا من السماء ساقطا\" أي عليهم يعذبون به لما صدقوا ولما أيقنوا بل يقولون هذا سحاب مركوم أي متراكم وهذا كقوله تعالى \"ولو فتحنا عليهم بابا من السماء فظلوا فيه يعرجون لقالوا إنما سكرت أبصارنا بل نحن قوم مسحورون\"."
    },
    {
      "ayah": 45,
      "surah": 52,
      "text": "وقال الله تعالى \"فذرهم\" أي دعهم يا محمد \"حتى يلاقوا يومهم الذي فيه يصعقون\" وذلك يوم القيامة."
    },
    {
      "ayah": 46,
      "surah": 52,
      "text": "\"يوم لا يغني عنهم كيدهم شيئا\" أي لا ينفعهم كيدهم ولا مكرهم الذي استعملوه في الدنيا لا يجزي عنهم يوم القيامة شيئا \"ولا هم ينصرون\"."
    },
    {
      "ayah": 47,
      "surah": 52,
      "text": "ثم قال تعالى \"وإن للذين ظلموا عذابا دون ذلك\" أي قبل ذلك في الدار الدنيا كقوله تعالى \"ولنذيقنهم من العذاب الأدنى دون العذاب الأكبر لعلهم يرجعون\" ولهذا قال تعالى \"ولكن أكثرهم لا يعلمون\" أي نعذبهم في الدنيا ونبتليهم فيها بالمصائب لعلهم يرجعون وينيبون فلا يفهمون ما يراد بهم بل إذا جلى عنهم مما كانوا فيه عادوا إلى أسوإ ما كانوا عليه كما جاء في بعض الأحاديث \"إن المنافق إذا مرض وعوفي مثله في ذلك كمثل البعير لا يدري فيما عقلوه ولا فيما أرسلوه\" وفي الأثر الإلهي \"كم أعصيك ولا تعاقبني؟ قال الله تعالى يا عبدي كم أعاقبك وأنت لا تدري\"؟."
    },
    {
      "ayah": 48,
      "surah": 52,
      "text": "وقوله تعالى \"واصبر لحكم ربك فإنك بأعيننا\" أي اصبر على أذاهم ولا تبالهم فإنك بمرأى منا وتحت كلاءتنا والله يعصمك من الناس. وقوله تعالى \"وسبح بحمد ربك حين تقوم\" قال الضحاك أي إلى الصلاة: سبحانك اللهم وبحمدك وتبارك اسمك وتعالى جدك ولا إله غيرك. وقد روي مثله عن الربيع بن أنس وعبدالرحمن بن زيد بن أسلم وغيرهما وروى مسلم في صحيحه عن عمر أنه كان يقول هذا في ابتداء الصلاة ورواه أحمد وأهل السنن عن أبي سعيد وغيره عن النبي صلى الله عليه وسلم أنه كان يقول ذلك. وقال أبو الجوزاء \"وسبح بحمد ربك حين تقوم\" أي من نومك من فراشك واختاره ابن جرير ويتأيد هذا القول بما رواه الإمام أحمد حدثنا الوليد بن مسلم حدثنا الأوزاعي حدثني عمير بن هانئ حدثني جنادة بن أبي أمية حدثنا عبادة بن الصامت عن رسول الله صلى الله عليه وسلم قال \"من تعار من الليل فقال لا إله إلا الله وحده لا شريك له له الملك وله الحمد وهو على كل شيء قدير سبحان الله والحمد لله ولا إله إلا الله والله أكبر ولا حول ولا قوة إلا بالله ثم قال رب اغفر لي - أو قال ثم دعا - استجيب له فإن عزم فتوضأ ثم صلى قبلت صلاته\" وأخرجه البخاري في صحيحه وأهل السنن من حديث الوليد بن مسلم به وقال ابن أبي تجيح عن مجاهد \"وسبح بحمد ربك حين تقوم\" قال من كل مجلس وقال الثوري عن أبي إسحاق عن أبي الأحوص \"وسبح بحمد ربك حين تقوم\" قال إذا أراد الرجل أن يقوم من مجلسه قال سبحانك اللهم وبحمدك. وقال ابن أبي حاتم حدثنا أبي حدثنا أبو النضر إسحاق بن إبراهيم الدمشقي حدثنا محمد بن شعيب أخبرني طلحة ابن عمرو الحضرمي عن عطاء بن أبي رباح أنه حدثه عن قول الله تعالى \"وسبح بحمد ربك حين تقوم\" يقول حين تقوم من كل مجلس إن كنت أحسنت ازددت خيرا وإن كنت غير ذلك كان هذا كفارة له وقد قال عبد الرزاق في جامعه أخبرنا معمر عن عبدالكريم الجزري عن أبي عثمان الفقير أن جبريل علم النبي صلى الله عليه وسلم إذا قام من مجلسه أن يقول: سبحانك اللهم وبحمدك أشهد أن لا إله إلا أنت أستغفرك وأتوب إليك. قال معمر وسمعت غيره يقول هذا القول كفارة المجالس وهذا مرسل وقد وردت أحاديث مسندة من طرق يقوي بعضها بعضا بذلك فمن ذلك حديث ابن جريج عن سهيل بن أبي صالح عن أبيه عن أبي هريرة عن النبي صلى الله عليه وسلم أنه قال \"من جلس في مجلس فكثر فيه لغطه فقال قبل أن يقوم من مجلسه سبحانك اللهم وبحمدك أشهد أن لا إله إلا أنت أستغفرك وأتوب إليك إلا غفر له ما كان فى مجلسه ذلك\" رواه الترمذي وهذا لفظه والنسائي في اليوم والليلة من حديث ابن جريج وقال الترمذي حسن صحيح وأخرجه الحاكم في مستدركه وقال إسناده على شرط مسلم إلا أن البخاري علله قلت علله الإمام أحمد والبخاري ومسلم وأبو حاتم وأبو زرعة والدارقطني وغيرهم ونسبوا الوهم فيه إلى ابن جريج على أن أبا داود قد رواه في سننه من طريق غير ابن جريج إلى أبي هريرة رضي الله عنه عن النبي صلى الله عليه وسلم بنحوه ورواه أبو داود واللفظ له والنسائي والحاكم في المستدرك من طريق الحجاج بن دينار عن هاشم عن أبي العالية عن أبي برزة الأسلمي قال كان رسول الله صلى الله عليه وسلم يقول بآخر عمره إذا أراد أن يقوم من المجلس \"سبحانك اللهم وبحمدك أشهد أن لا إله إلا أنت أستغفرك وأتوب إليك\" فقال رجل يا رسول الله إنك لتقول قولا ما كنت تقوله فيما مضى قال \"كفارة لما يكون في المجلس\" وقد روي مرسلا عن أبى العالية فالله أعلم وهكذا رواه النسائي والحاكم من حديث الربيع بن أنس عن أبي العالية عن رافع بن خديج عن النبي صلى الله عليه وسلم مثله سواء وروي مرسلا أيضا فالله أعلم. وكذا رواه أبو داود عن عبدالله بن عمرو أنه قال: كلمات لا يتكلم بهن أحد في مجلسه عند قيامه ثلاث مرات إلا كفر بهن عنه ولا يقولهن في مجلس خير ومجلس ذكر إلا ختم له بهن كما يختم بالخاتم: سبحانك اللهم وبحمدك لا إله إلا أنت أستغفرك وأتوب إليك. وأخرجه الحاكم من حديث أم المؤمنين عائشة وصححه ومن رواية جبير بن مطعم ورواه أبو بكر الإسماعيلي عن أمير المؤمنين عمر بن الخطاب كلهم عن النبي صلى الله عليه وسلم وقد أفردت لذلك جزءا على حدة بذكر طرقه وألفاظه وعلله وما يتعلق بها ولله الحمد والمنة."
    },
    {
      "ayah": 49,
      "surah": 52,
      "text": "وقوله تعالى \"ومن الليل فسبحه\" أي اذكره واعبده بالتلاوة والصلاة في الليل كما قال تعالى \"ومن الليل فتهجد به نافلة لك عسى أن يبعثك ربك مقاما محمودا\". وقوله تعالى \"وإدبار النجوم\" قد تقدم في حديث ابن عباس أنهما الركعتان اللتان قبل صلاة الفجر فإنهما مشروعتان عند إدبار النجوم أي عند جنوحها للغيبوبة. وقد روى ابن سيلان عن أبي هريرة مرفوعا \"لا تدعوهما وإن طردتكم الخيل\" يعني ركعتي الفجر رواه أبو داود ومن هذا الحديث حكي عن بعض أصحاب أحمد القول بوجوبهما وهو ضعيف لحديث \"خمس صلوات في اليوم والليلة\" قال هل علي غيرها قال \"لا إلا أن تطوع\". وقد ثبت في الصحيحين عن عائشة رضي الله عنها قالت لم يكن رسول الله صلى الله عليه وسلم على شيء من النوافل أشد تعاهدا منه على ركعتي الفجر وفي لفظ لمسلم \"ركعتا الفجر خير من الدنيا وما فيها\" آخر تفسير الطور ولله الحمد والمنة."
    },
    {
      "ayah": 5,
      "surah": 52,
      "text": "قال سفيان الثوري وشعبة وأبو الأحوص عن سماك عن خالد بن عرعرة عن علي \"والسقف المرفوع\" يعني السماء قال سفيان ثم تلا \"وجعلنا السماء سقفا محفوظا وهم عن آياتها معرضون\" وكذا قال مجاهد وقتادة والسدي وابن جرير وابن زيد واختاره ابن جرير وقال الربيع بن أنس هو العرش يعني أنه سقف لجميع المخلوقات وله اتجاه وهو مراد مع غيره كما قاله الجمهور."
    },
    {
      "ayah": 6,
      "surah": 52,
      "text": "قال الربيع بن أنس هو الماء الذي تحت العرش الذي ينزل الله منه المطر الذي تحيا به الأجساد في قبورها يوم معادها وقال الجمهور هو هذا البحر واختلف في معنى قوله المسجور فقال بعضهم المراد أنه يوقد يوم القيامة نارا كقوله \"وإذا البحار سجرت\" أي أضرمت فتصير نارا تتأجج محيطة بأهل الموقف ورواه سعيد بن المسيب عن على بن أبي طالب وروي عن ابن عباس وبه يقول سعيد بن جبير ومجاهد وعبدالله بن عبيد بن عمير وغيرهم وقال العلاء بن بدر إنما سمي البحر المسجور لأنه لا يشرب منه ماء ولا يسقى به زرع وكذلك البحار يوم القيامة كذا رواه عنه ابن أبي حاتم وعن سعيد بن جبير \"والبحر المسجور\" يعني المرسل وقال قتادة المسجور المملوء واختاره ابن جرير ووجهه بأنه ليس موقدا اليوم فهو مملوء وقيل المراد به الفارغ قال الأصمعي عن أبي عمرو بن العلاء عن ذي الرمة عن ابن عباس في قوله تعالى \"والبحر المسجور\" قال الفارغ خرجت أمة تستسقي فرجعت فقالت إن الحوض مسجور يعني فارغا. رواه ابن مردويه في مسانيد الشعراء وقيل المراد بالمسجور الممنوع المكفوف عن الأرض لئلا يغمرها فيغرق أهلها. قاله علي بن أبي طلحة عن ابن عباس وبه يقول السدي وغيره وعليه يدل الحديث الذي رواه الإمام أحمد رحمه الله في مسنده فإنه قال حدثنا يزيد حدثنا العوام حدثني شيخ كان مرابطا بالساحل قال لقيت أبا صالح مولى عمر بن الخطاب فقال حدثنا عمر بن الخطاب عن رسول الله صلى الله عليه وسلم قال \"ليس من ليلة إلا والبحر يشرف فيها ثلاث مرات يستأذن الله تعالى أن ينفضح عليهم فيكفه الله عز وجل\" وقال الحافظ أبو بكر الإسماعيلي حدثا الحسن بن سفيان عن إسحاق بن راهويه عن يزيد وهو ابن هارون عن العوام ابن حوشب حدثني شيخ مرابط قال خرجت ليلة لمحرسي لم يخرج أحد من الحرس غيري فأتيت الميناء فصعدت فجعل يخيل إلي أن البحر يشرف يحاذي رؤوس الجبال فعل ذلك مرارا وأنا مستيقظ فلقيت أبا صالح فقال: حدثنا عمر بن الخطاب أن رسول الله صلى الله عليه وسلم قال \"ما من ليلة إلا والبحر يشرف ثلاث مرات يستأذن الله تعالى أن ينفضخ عليهم فيكفه الله عز وجل\" فيه رجل مبهم لم يسم."
    },
    {
      "ayah": 7,
      "surah": 52,
      "text": "وقوله تعالى \"إن عذاب ربك لواقع\" هذا هو المقسم عليه أي لواقع بالكافرين كما قال في الآية الأخرى \"ماله من دافع\" أي ليس له دافع يدفعه عنهم إذا أراد الله بهم ذلك. قال الحافظ أبو بكر بن أبي الدنيا حدثنا أبي حدثنا موسى بن داود عن صالح المري عن جعفر بن زيد العبدي قال خرج عمر يعس المدينة ذات ليلة فمر بدار رجل من المسلمين فوافقه قائما يصلي فوقف يستمع قراءته فقرأ \"والطور- حتى بلغ إن عذاب ربك لواقع ماله من دافع\" قال قسم ورب الكعبة حق فنزل عن حماره واستند إلى حائط فمكث مليا ثم رجع إلى منزله فمكث شهرا يعوده الناس لا يدرون ما مرضه رضى الله عنه وقال الإمام أبو عبيد في فضائل القرآن حدثنا محمد بن صالح حدثنا هشام بن حسان عن الحسن أن عمر قرأ \"إن عذاب ربك لواقع ماله من دافع\" فربا لها ربوة عيد منها عشرين يوما."
    },
    {
      "ayah": 8,
      "surah": 52,
      "text": "هذا هو المقسم عليه أي لواقع بالكافرين كما قال في الآية الأخرى \"ماله من دافع\" أي ليس له دافع يدفعه عنهم إذا أراد الله بهم ذلك. قال الحافظ أبو بكر بن أبي الدنيا حدثنا أبي حدثنا موسى بن داود عن صالح المري عن جعفر بن زيد العبدي قال خرج عمر يعس المدينة ذات ليلة فمر بدار رجل من المسلمين فوافقه قائما يصلي فوقف يستمع قراءته فقرأ \"والطور- حتى بلغ إن عذاب ربك لواقع ماله من دافع\" قال قسم ورب الكعبة حق فنزل عن حماره واستند إلى حائط فمكث مليا ثم رجع إلى منزله فمكث شهرا يعوده الناس لا يدرون ما مرضه رضى الله عنه وقال الإمام أبو عبيد في فضائل القرآن حدثنا محمد بن صالح حدثنا هشام بن حسان عن الحسن أن عمر قرأ \"إن عذاب ربك لواقع ماله من دافع\" فربا لها ربوة عيد منها عشرين يوما."
    },
    {
      "ayah": 9,
      "surah": 52,
      "text": "قال ابن عباس وقتادة: تتحرك تحريكا وعن ابن عباس هو تشققها وقال مجاهد: تدور دورا وقال الضحاك: استدارتها وتحركها لأمر الله وموج بعضها في بعض وهذا اختيار ابن جرير إنه التحرك في استدارة. قال وأنشد أبو عبيدة معمر بن المثنى بيت الأعشى فقال: كأن مشيتها من بيت جارتها مور السحابة لا ريث ولا عجل."
    }
  ]
}
