{
  "ayahs": [
    {
      "ayah": 1,
      "surah": 53,
      "text": "سورة النجم: قال البخاري حدثنا نصر بن علي أخبرني أبو أحمد - يعني الزبيدي - حدثنا إسرائيل عن أبي إسحاق عن الأسود بن يزيد عن عبدالله قال أول سورة أنزلت فيها سجدة والنجم قال فسجد النبي صلى الله عليه وسلم وسجد من خلفه إلا رجلا رأيته أخذ كفا من تراب فسجد عليه فرأيته بعد ذلك قتل كافرا وهو أمية بن خلف. وقد رواه البخاري أيضا في مواضع ومسلم وأبو داود والنسائي من طرق عن أبي إسحاق به وقوله في الممتنع إنه أمية بن خلف في هذه الرواية مشكل فإنه قد جاء من غير هذه الطريق أنه عتبة بن ربيعة. قال الشعبي وغيره: الخالق يقسم بما شاء من خلقه والمخلوق لا ينبغي له أن يقسم إلا بالخالق رواه ابن أبي حاتم. واختلف المفسرون في معنى قوله \"والنجم إذا هوى\" فقال ابن أبي نجيح عن مجاهد يعني بالنجم الثريا إذا سقطت مع الفجر وكذا روي عن ابن عباس وسفيان الثوري واختاره ابن جرير وزعم السدي أنها الزهرة وقال الضحاك \"والنجم إذا هوى\" إذا رمي به الشياطين وهذا القول له اتجاه. وروى الأعمش عن مجاهد في قوله تعالى \"والنجم إذا هوى\" يعني القرآن إذا نزل وهذه الآية كقوله تعالى \"فلا أقسم بمواقع النجوم وإنه لقسم لو تعلمون عظيم إنه لقرآن كريم في كتاب مكنون لا يمسه إلا المطهرون تنزيل من رب العالمين\"."
    },
    {
      "ayah": 10,
      "surah": 53,
      "text": "معناه فأوحى جبريل إلى عبدالله محمد ما أوحى أو فأوحى الله إلى عبده محمد ما أوحى بواسطة جبريل وكلا المعنيين صحيح وقد ذكر عن سعيد بن جبير في قوله تعالى \"فأوحى إلى عبده ما أوحى\" قال أوحى الله إليه: ألم أجدك يتيما - ورفعنا لك ذكرك. وقال غيره أوحى الله إليه أن الجنة محرمة على الأنبياء حتى تدخلها وعلى الأمم حتى تدخلها أمتك."
    },
    {
      "ayah": 11,
      "surah": 53,
      "text": "قال مسلم حدثنا أبو سعيد الأشج حدثنا وكيع حدثنا الأعمش عن زياد بن حصين عن أبي العالية عن ابن عباس \"ما كذب الفؤاد ما رأى\" \"ولقد رآه نزلة أخرى\" قال رآه بفؤاده مرتين وكذا رواه سماك عن عكرمة عن ابن عباس مثله وكذا قال أبو صالح والسدي وغيرهما إنه رآه بفؤاده مرتين وقد خالفه ابن مسعود وغيره وفي رواية عنه أنه أطلق الرؤية وهي محمولة على المقيدة بالفؤاد ومن روى عنه بالبصر فقد أغرب فإنه لا يصح في ذلك شيء عن الصحابة رضي الله عنهم. وقول البغوي في تفسيره وذهب جماعة إلى أنه رآه بعينه وهو قول أنس والحسن وعكرمة فيه نظر والله أعلم وقال الترمذي حدثنا محمد بن عمرو بن المنهال بن صفوان حدثنا يحيى بن كثير العنبري عن سلمة بن جعفر عن الحكم بن أبان عن عكرمة عن ابن عباس قال رأى محمد ربه قلت أليس الله يقول \"لا تدركه الأبصار وهو يدرك الأبصار\" قال ويحك ذاك إذا تجلى بنوره الذي هو نوره وقد رأى ربه مرتين ثم قال حسن غريب وقال أيضا حدثنا ابن أبي عمر حدثنا سفيان عن مجالد عن الشعبي قال لقي ابن عباس كعبا بعرفة فسأله عن شيء فكبر حتى جاوبته الجبال فقال ابن عباس إنا بنو هاشم فقال كعب إن الله قسم رؤيته وكلامه بين محمد وموسى فكلم موسى مرتين ورآه محمد مرتين وقال مسروق دخلت على عاثشة فقلت هل رأى محمد ربه فقالت لقد تكلمت بشيء قف له شعري فقلت رويدا ثم قرأت \"لقد رأى من آيات ربه الكبرى\" فقالت أين يذهب بك إنما هو جبريل من أخبرك أن محمدا رأى ربه أو كتم شيئا مما أمر به أو يعلم الخمس التي قال الله تعالى \"إن الله عنده علم الساعة وينزل الغيث\" فقد أعظم على الله الفرية ولكنه رأى جبريل لم يره في صورته إلا مرتين مرة عند سدرة المنتهى ومرة في أجياد وله ستمائة جناح قد سد الأفق. وقال النسائي حدثنا إسحاق بن إبراهيم حدثنا معاذ بن هشام حدثني أبي عن قتادة عن عكرمة عن ابن عباس قال أتعجبون أن تكون الخلة لإبراهيم والكلام لموسى والرؤية لمحمد عليهم السلام وفي صحيح مسلم عن أبي ذر قال سألت رسول الله صلى الله عليه وسلم هل رأيت ربك؟ فقال \"نور أنى أراه\" وفي رواية \"رأيت نورا\" وقال ابن أبي حاتم حدثنا أبو سعيد الأشج حدثنا أبو خالد عن موسى بن عبيدة عن محمد بن كعب قال: قالوا يا رسول الله رأيت ربك؟ قال \"رأيته بفؤادي مرتين\" ثم قرأ \"ما كذب الفؤاد ما رأى\" ورواه ابن جرير عن ابن حميد عن مهران عن موسى بن عبيدة عن محمد بن كعب عن بعض أصحاب النبي صلى الله عليه وسلم قال: قلنا يا رسول الله هل رأيت ربك؟ قال \"لم أره بعيني ورأيته بفؤادي مرتين\" ثم تلا \"ثم دنا فتدلى \" ثم قال ابن أبي حاتم وحدثنا الحسن بن محمد بن الصباح حدثنا محمد بن عبدالله الأنصاري أخبرني عباد بن منصور قال سألت عكرمة عن قوله \"ما كذب الفؤاد ما رأى\" فقال عكرمة تريد أن أخبرك أنه قد رآه؟ قلت نعم قال قد رآه ثم قد رآه قال فسألت عنه الحسن فقال قد رأى جلاله وعظمته ورداءه. وحدثنا أبي حدثنا محمد بن مجاهد حدثنا أبو عامر العقدي أخبرنا أبو خلدة عن أبي العالية قال سئل رسول الله صلى الله عليه وسلم هل رأيت ربك؟ قال \"رأيت نهرا ورأيت وراء النهر حجابا ورأيت وراء الحجاب نورا لم أر غيره\" وذلك غريب جدا. فأما الحديث الذي رواه الإمام أحمد حدثنا أسود بن عامر حدثنا حماد بن سلمة عن قتادة عن عكرمة عن ابن عباس رضي الله عنهما قال: قال رسول الله صلى الله عليه وسلم \"رأيت ربي عز وجل\" فإنه حديث إسناده على شرط الصحيح لكنه مختصر من حديث المنام كما رواه الإمام أحمد أيضا حدثنا عبدالرزاق حدثنا معمر عن أيوب عن أبي قلابة عن ابن عباس أن رسول الله صلى الله عليه وسلم قال \"أتاني ربي الليلة في أحسن صورة - أحسبه يعني في النوم - فقال يا محمد أتدري فيم يختصم الملأ الأعلى؟ قال: قلت لا فوضع يده بين كتفي حتى وجدت بردها بين ثديي - أو قال نحري - فعلمت ما في السموات وما في الأرض ثم قال يا محمد هل تدري فيم يختصم الملأ الأعلى؟ قال: قلت نعم يختصمون في الكفارات والدرجات قال وما الكفارات؟ قال: قلت المكث في المساجد بعد الصلوات والمشي على الأقدام إلى الجماعات وإبلاغ الوضوء في المكاره من فعل ذلك عاش بخير ومات بخير وكان من خطيئته كيوم ولدته أمه وقال قل يا محمد إذا صليت اللهم أني أسألك فعل الخيرات وترك المنكرات وحب المساكين وإذا أردت بعبادك فتنة أن تقبضني إليك غير مفتون قال والدرجات بذل الطعام وإفشاء السلام والصلاة بالليل والناس نيام\" وقد تقدم في آخر سورة ص عن معاذ نحوه. وقد رواه ابن جرير من وجه آخر عن ابن عباس وفيه سياق آخر وزيادة غريبة فقال حدثني أحمد بن عيسى التميمي حدثنا سليمان بن عمر بن سيار حدثني أبي عن سعيد بن زربي عن عمر بن سليمان عن عطاء عن ابن عباس قال: قال النبي صلى الله عليه وسلم \"رأيت ربي في أحسن صورة فقال لي يا محمد هل تدري فيم يختصم الملأ الأعلى؟ فقلت لا يا رب فوضع يده بين كتفي فوجدت بردها بين ثدي فعلمت ما في السموات والأرض فقلت يا رب في الدرجات والكفارات ونقل الأقدام إلى الجماعات وانتظار الصلاة بعد الصلاة فقلت يا رب إنك اتخذت إبراهيم خليلا وكلمت موسى تكليما وفعلت وفعلت فقال ألم أشرح لك صدرك؟ ألم أضع عنك وزرك؟ ألم أفعل بك ألم أفعل بك؟ قال فأفضى إلي باشياء لم يؤذن لي أن أحدثكموها قال فذاك قوله في كتابه \"ثم دنا فتدلى فكان قاب قوسين أو أدنى فأوحى إلى عبده ما أوحى ما كذب الفؤاد ما رأى\" فجعل نور بصري في فؤادي فنظرت إليه بفؤادي\" إسناده ضعيف."
    },
    {
      "ayah": 12,
      "surah": 53,
      "text": "هذه هي المرة الثانية التي رأى رسول الله صلى الله عليه وسلم فيها جبريل على صورته الي خلقه الله عليها وكانت ليلة الإسراء. وقد قدمنا الأحاديث الواردة في الإسراء بطرقها وألفاظها في أول سورة سبحان بما أغنى عن إعادته ههنا. وتقدم أن ابن عباس رضي الله عنهما كان يثبت الرؤية ليلة الإسراء ويستشهد بهذه الآية وتابعه جماعة من السلف والخلف وقد خالفه جماعات من الصحابة رضي الله عنهم والتابعين وغيرهم. وقال الإمام أحمد حدثنا حسن بن موسى حدثنا حماد بن سلمة عن عاصم بن بهدلة عن زر بن حبيش عن ابن مسعود في هذه الآية \"ولقد رآه نزلة أخرى عند سدرة المنتهى\" قال: قال رسول الله صلى الله عليه وسلم \"رأيت جبريل وله ستمائة جناح ينتثر من ريشه التهاويل من الدر والياقوت\" وهذا إسناد جيد قوي وقال أحمد أيضا حدثنا يحيى بن آدم حدثنا شريك عن جامع بن أبي راشد عن أبي وائل عن عبدالله قال: رأى رسول الله صلى الله عليه وسلم جبريل في صورته وله ستمائة جناح كل جناح منها قد سد الأفق: يسقط من جناحه من التهاويل من الدر والياقوت ما الله به عليم. إسناده حسن أيضا."
    },
    {
      "ayah": 13,
      "surah": 53,
      "text": "وقال الإمام أحمد أيضا حدثنا زيد بن الحباب حدثني حسين حدثني عاصم بن بهدلة قال: سمعت شقيق بن سلمة يقول سمعت ابن مسعود يقول قال رسول الله صلى الله عليه وسلم \"رأيت جبريل على سدرة المنتهى وله ستمائة جناج \"سألت عاصما عن الأجنحة فأبى أن يخبرني قال فأخبرني بعض أصحابه أن الجناح ما بين المشرق والمغرب وهذا أيضا إسناد جيد وقال أحمد حدثنا زيد بن الحباب حدثنا حسين حدثني عاصم بن بهدلة حدثني شقيق بن سلمة قال سمعت ابن مسعود يقول قال رسول الله صلى الله عليه وسلم \"أتاني جبريل عليه السلام في حصر معلق به الدر\" إسناده جيد أيضا. وقال الإمام أحمد حدثنا يحيى عن إسماعيل حدثنا عامر قال أتى مسروق عائشة فقال يا أم المؤمنين هل رأى محمد صلى الله عليه وسلم ربه عز وجل؟ قالت سبحان الله لقد قف شعري لما قلت أين أنت من ثلاث من حدثكهن فقد كذب: من حدثك أن محمدا رأى ربه فقد كذب ثم قرأت \"لا تدركه الأبصار وهو يدرك الأبصار\" \"وما كان لبشر أن يكلمه الله إلا وحيا أو من وراء حجاب\" ومن أخبرك أنه يعلم ما في غد فقد كذب ثم قرأت \"إن الله عنده علم الساعة ومنزل الغيث ويعلم ما في الأرحام\" الآية ومن أخبرك أن محمدا قد كتم فقد كذب ثم قرأت \"يا أيها الرسول بلغ ما أنزل إليك من ربك\" ولكنه رأى جبريل في صورته مرتين. وقال الإمام أحمد أيضا حدثنا محمد بن أبي عدي عن داود عن الشعبي عن مسروق قال كنت عند عائشة فقلت أليس الله يقول \"ولقد رآه بالأفق المبين\" \"ولقد رآه نزلة أخرى\" فقالت أنا أول هذه الأمة سألت رسول الله صلى الله عليه وسلم عنها فقال \"إنما ذاك جبريل\" لم يره في صورته التي خلق عليها إلا مرتين رآه منهبطا من السماء إلى الأرض سادا عظم خلقه ما بين السماء والأرض أخرجاه في الصحيحين من حديث الشعبي به. \"رواية أبي ذر\" قال الإمام أحمد حدثنا عفان حدثنا همام حدثنا قتادة عن عبدالله بن شقيق قال قلت لأبي ذر لو رأيت رسول الله صلى الله عليه وسلم لسألته قال وما كنت تسأله؟ قال كنت أسأله هل رأى ربه عز وجل فقال إني قد سألته فقال \"قد رأيته نورا أنى أراه\" وهكذا وقع في رواية الإمام أحمد وقد أخرجه مسلم من طريقين بلفظين فقال حدثنا أبو بكر بن أبي شيبة حدثنا وكيع عن يزيد بن إبراهيم عن قتادة عن عبدالله بن شقيق عن أبي ذر قال: سألت رسول الله صلى الله عليه وسلم هل رأيت ربك؟ فقال \"نور أنى أراه\" وقال حدثنا محمد بن بشار حدثنا معاذ بن هشام حدثنا أبي عن قتادة عن عبدالله بن شقيق قال: قلت لأبي ذر لو رأيت رسول الله صلى الله عليه وسلم لسألته فقال عن أي شيء كنت تسأله؟ قال كنت أسأله هل رأيت ربك؟ قال أبو ذر قد سألته فقال \"رأيت نورا\" وقد حكى الخلال في علله أن الإمام أحمد سئل عن هذا الحديث فقال ما زلت منكرا له وما أدري ما وجهه؟ وقال ابن أبي حاتم حدثنا أبي حدثنا عمرو بن عون الواسطي أخبرنا هشيم عن منصور عن الحكم عن إبراهيم عن أبيه عن أبي ذر قال: رآه بقلبه ولم يره بعينه وحاول ابن خزيمة أن يدعي انقطاعه بين عبدالله بن شقيق وبين أبي ذر وأما ابن الجوزي فتأوله على أن أبا ذر لعله سأل رسول الله صلى الله عليه وسلم قبل الإسراء فأجابه بما أجابه به ولو سأله بعد الإسراء لأجابه بالإثبات وهذا ضعيف جدا فإن عائشة أم المؤمنين رضي الله عنها قد سألت عن ذلك بعد الإسراء ولم يثبت لها الرؤية ومن قال إنه خاطبها على قدر عقلها أو حاول تخطئتها فيما ذهبت إليه كابن خزيمة في كتاب التوحيد فإنه هو المخطيء والله أعلم. وقال النسائي حدثنا يعقوب بن إبراهيم عن منصور عن الحكم عن يزيد بن شريك عن أبي ذر قال: رأى رسول الله صلى الله عليه وسلم ربه بقلبه ولم يره ببصره. وقد ثبت في صحيح مسلم عن أبي بكر بن أبي شيبة عن علي بن مسهر عن عبدالملك بن أبي سليمان عن عطاء بن أبي رباح عن أبي هريرة رضي الله عنه أنه قال في قوله تعالى \"ولقد رآه نزله أخرى\" قال رأى جبريل عليه السلام وقال مجاهد في قوله \"ولقد رآه نزلة أخرى\" قال رأى رسول الله صلى الله عليه وسلم جبريل في صورته مرتين وكذا قال قتادة والربيع بن أنس وغيرهم."
    },
    {
      "ayah": 14,
      "surah": 53,
      "text": "قوله تعالى \"إذ يغشى السدرة ما يغشى\" قد تقدم في أحاديث الإسراء أنه غشيتها الملائكة مثل الغربان وغشيها نور الرب وغشيها ألوان ما أدري ما هي؟ وقال الإمام أحمد حدثنا مالك بن مغول حدثنا الزبير بن عدي عن طلحة عن مرة عن عبدالله هو ابن مسعود قال لما أسري برسول الله صلى الله عليه وسلم انتهى به إلى سدرة المنتهى وهي في السماء السابعة إليها ينتهي ما يعرج به من الأرض فيقبض منها وإليها ينتهي ما يهبط به من فوقها فيقبض منها \"إذ يغشى السدرة ما يغشى\" قال فراش من ذهب قال وأعطي رسول الله صلى الله عليه وسلم ثلاثا: أعطي الصلوات الخمس وأعطي خواتيم سورة البقرة وغفر لمن لا يشرك بالله شيئا من أمته المقحمات. انفرد به مسلم وقال أبو جعفر الرازي عن الربيع عن أبي العالية عن أبي هريرة أو غيره - شك أبو جعفر - قال: لما أسري برسول الله صلى الله عليه وسلم انتهى إلى السدرة فقيل له إن هذه السدرة فغشيها نور الخلاق وغشيتها الملائكة مثل الغربان حين يقعن على الشجر وقال فكلمه عند ذلك فقال له سل. وقال ابن أبي نجيح عن مجاهد \"إذ يغشى السدرة ما يغشى\" قال كان أغصان السدرة لؤلؤا وياقوتا وزبرجدا فرآها محمد صلى الله عليه وسلم ورأى ربه بقلبه وقال ابن زيد قيل يا رسول الله أي شيء رأيت يغشى تلك السدرة؟ قال \"رأيت يغشاها فراش من ذهب ورأيت على كل ورقة من ورقها ملكا قائما يسبح الله عز وجل."
    },
    { "ayah": 15, "surah": 53, "text": "لا يوجد تفسير لهذه الأية" },
    {
      "ayah": 16,
      "surah": 53,
      "text": "قال ابن عباس رضي الله عنهما ما ذهب يمينا ولا شمالا \"وما طغى\" ما جاوز ما أمر به وهذه صفة عظيمة في الثبات والطاعة فإنه ما فعل إلا ما أمر به ولا سأل فوق ما أعطى وما أحسن ما قال الناظم: رأى جنة المأوى وما فوقها ولو رأى غيره ما قد رآه لتاها."
    },
    {
      "ayah": 17,
      "surah": 53,
      "text": "قال ابن عباس رضي الله عنهما ما ذهب يمينا ولا شمالا \"وما طغى\" ما جاوز ما أمر به وهذه صفة عظيمة في الثبات والطاعة فإنه ما فعل إلا ما أمر به ولا سأل فوق ما أعطى وما أحسن ما قال الناظم: رأى جنة المأوى وما فوقها ولو رأى غيره ما قد رآه لتاها."
    },
    {
      "ayah": 18,
      "surah": 53,
      "text": "قوله تعالى \" لقد رأى من آيات ربه الكبرى\" كقوله \"لنريه من آياتنا الكبرى\" أي الدالة على قدرتنا وعظمتنا وبهاتين الآيتين استدل من ذهب من أهل السنة أن الرؤية تلك الليلة لم تقع لأنه قال \"لقد رأى من آيات ربه الكبرى\" ولو كان رأى ربه لأخبر بذلك ولقال ذلك للناس وقد تقدم تقرير ذلك في سورة سبحان. وقد قال الإمام أحمد حدثنا أبو النضر حدثنا محمد بن طلحة عن الوليد بن قيس عن إسحاق بن أبي الكهتلة قال محمد أظنه عن ابن مسعود أنه قال إن محمدا لم ير جبريل في صورته إلا مرتين أما مرة فإنه سأله أن يريه في صورته فأراه صورته فسد الأفق وأما الأخرى فإنه صعد معه حين صعد به وقوله \"وهو بالأفق الأعلى ثم دنا فتدلى فكان قاب أو أدنى فأوحى إلى عبده ما أوحى\" فلما أخبر جبريل ربه عز وجل عاد في صورته وسجد فقوله \"ولقد رآه نزلة أخرى عند سدرة المنتهى عندها جنة المأوى إذ يغشى السدرة ما يغشى ما زاغ البصر وما طغى لقد رأى من آيات ربه الكبرى\" قال خلق جبريل عليه السلام. وهكذا رواه الإمام أحمد وهو غريب."
    },
    {
      "ayah": 19,
      "surah": 53,
      "text": "يقول تعالى مقرعا للمشركين في عبادتهم الأصنام والأنداد والأوثان واتخاذهم لها البيوت مضاهاة للكعبة التي بناها خليل الرحمن عليه السلام \"أفرأيتم اللات\" وكانت اللات صخرة بيضاء منقوشة وعليها بيت بالطائف له أستار وسدنة وحوله فناء معظم عند أهل الطائف وهم ثقيف ومن تابعها يفتخرون بها على من عداهم من أحياء العرب بعد قريش قال ابن جرير وكانوا قد اشتقوا اسمها من اسم الله فقالوا اللات يعنون مؤنثة منه تعالى الله عن قولهم علوا كبيرا وحكي عن ابن عباس ومجاهد والربيع بن أنس أنهم قرأوا اللات بتشديد التاء وفسروه بأنه كان رجلا يلت للحجيج في الجاهلية السويق فلما مات عكفوا على قبره فعبدوه وقال البخاري حدثنا مسلم هو ابن إبراهيم حدثنا أبو الأشهب حدثنا أبو الجوزاء عن ابن عباس رضي الله عنهما في قوله \"اللات والعزى\" قال كان اللات رجلا يلت السويق سويق الحاج. قال ابن جرير وكذا العزى من العزيز وكانت شجرة عليها بناء وأستار بنخلة وهي بين مكة والطائف وكانت قريش يعظمونها كما قال أبو سفيان يوم أحد لنا العزى ولا عزى لكم فقال رسول الله صلى الله عليه وسلم \"قولوا الله مولانا ولا مولى لكم\" وروى البخاري من حديث الزهري عن حميد بن عبدالرحمن عن أبي هريرة قال: قال رسول الله صلى الله عليه وسلم \"من حلف فقال في حلفه واللات والعزى فليقل لا إله إلا الله ومن قال لصاحبه تعال أقامرك فليتصدق\" فهذا محمول على من سبق لسانه في ذلك كما كانت ألسنتهم قد اعتادته في زمن الجاهلية كما قال النسائي أخبرنا أحمد بن بكار حدثنا عبدالحميد بن محمد قالا حدثنا مخلد حدثنا يونس عن أبيه حدثني مصعب بن سعد بن أبي وقاص عن أبيه قال حلفت باللات والعزى فقال لي أصحابي بئس ما قلت قلت هجرا فأتيت رسول صلى الله عليه وسلم فذكرت ذلك له فقال \"قل لا إله إلا الله وحده لا شريك له له الملك وله الحمد وهو على كل شيء قدير وانفث عن شمالك ثلاثا وتعوذ بالله من الشيطان الرجيم ثم لا تعد\"."
    },
    {
      "ayah": 2,
      "surah": 53,
      "text": "هذا هو المقسم عليه وهو الشهادة للرسول صلى الله عليه وسلم بأنه راشد تابع للحق ليس بضال: وهو الجاهل الذي يسلك على غير طريق بغير علم والغاوي هو العالم بالحق العادل عنه قصدا إلى غيره فنزه الله رسوله وشرعه عن مشابهة أهل الضلال كالنصارى وطرائق اليهود وهي علم الشيء وكتمانه والعمل بخلافه بل هو صلاة الله وسلامه عليه وما بعثه الله به من الشرع العظيم في غاية الاستقامة والاعتدال والسداد."
    },
    {
      "ayah": 20,
      "surah": 53,
      "text": "وأما مناة فكانت بالمشلل عند قديد بين مكة والمدينة وكانت خزاعة والأوس والخزرج في جاهليتها يعظمونها ويهلون منها للحج إلى الكعبة وروى البخاري عن عائشة نحوه وقد كانت بجزيرة العرب وغيرها وطواغيت أخر تعظيمها العرب كتعظيم الكعبة غير هذه الثلاثة التي نص عليها في كتابه العزيز وإنما أفرد هذه بالذكر لأنها اشهر من غيرها. قال ابن إسحاق في السيرة وقد كانت العرب اتخذت مع الكعبة طواغيت وهي بيوت تعظمها كتعظيم الكعبة لها سدنة وحجاب وتهدي لها كما تهدي للكعبة وتطوف بها كطوافها بها وتنحر عندها وهي تعرف فضل الكعبة عليه لأنها كانت قد عرفت أنها بيت إبراهيم عليه السلام ومسجده فكانت لقريش ولبني كنانة العزى بنخلة وكان سدنتها وحجابها بني شيبان من سليم حلفاء بني هاشم قلت بعث إليها رسول الله صلى الله عليه وسلم خالد بن الوليد فهدمها وجعل يقول: يا عزى كفرانك لا سبحانك إني رأيت الله قد أهانك وقال النسائي أخبرنا علي بن المنذر أخبرنا ابن فضيل حدثنا الوليد بن جميع عن أبي الطفيل قال لما فتح رسول الله صلى الله عليه وسلم مكة بعث خالد بن الوليد إلى نخلة وكانت بها العزى فأتاها خالد وكانت على ثلاث سمرات فقطع السمرات وهدم البيت الذي كان عليها ثم أتى النبي صلى الله عليه وسلم فأخبره فقال \"ارجع فإنك لم تصنع شيئا\" فرجع خالد فلما أبصرته السدنة وهم حجبتها أمعنوا في الحيل وهم يقولون يا عزى يا عزى فأتاها خالد فإذا امرأة عريانه ناشرة شعرها تحثو التراب على رأسها فغمسها بالسيف حتى قتلها ثم رجع إلى رسول الله صلى الله عليه وسلم فأخبره فقال \"تلك العزى\" قال ابن إسحاق وكانت اللات لثقيف بالطائف وكان سدنتها وحجابها بنى معتب \"قلت\" وقد بعث إليها رسول الله صلى الله عليه وسلم المغيرة بن شعبة وأبا سفيان صخر بن حرب فهدماها وجعلا مكانها مسجدا بالطائف قال ابن إسحاق وكانت مناة للأوس والخزرج ومن دان بدينهم من أهل يثرب على ساحل البحر من ناحية المشلل بقديد فبعث رسول الله صلى الله عليه وسلم إليها أبا سفيان صخر بن حرب فهدمها ويقال علي بن أبي طالب قال وكانت ذو الخلصة لدوس وخثعم وبجيلة ومن كان ببلادهم من العرب بتبالة \"قلت\" وكان يقال لها الكعبة اليمانية وللكعبة التي بمكة الكعبة الشامية فبعث إليه رسول الله صلى الله عليه وسلم جرير بن عبدالله البجلي فهدمه قال وكانت قيس لطي ومن يليها بجبل طي بين سلمى وأجا قال ابن هشام فحدثني بعض أهل العلم أن رسول الله صلى الله عليه وسلم بعث إليه علي بن أبي طالب فهدمه واصطفى منه سيفين الرسوب والمخزم فنفله إياهما رسول الله صلى الله عليه وسلم فهما سيفا علي قال ابن إسحاق وكان لحمير وأهل اليمن بيت بصنعاء يقال له ريام وذكر أنه كان به كلب أسود وأن الحبرين اللذين ذهبا مع تبع استخرجاه وقتلاه وهدما البيت: قال ابن إسحاق وكانت رضاء بيتا لبني ربيعة بن كعب بن سعد بن زيد مناة بن تميم ولها يقول المستوغر بن ربيعة بن كعب ابن سعد حين هدمها في الإسلام ولقد شددت على رضاء شدة تركتها قفرا بقاع أسمحا قال ابن هشام يقال إنه عاش ثلاثمائة وثلاثين سنة وهو القائل ولقد سئمت من الحياة وطولها وعمرت من عدد السنين مئينا مائة حدتها بعدها مائتان لي وعمرت من عدد الشهور سنينا هل ما بقي إلا كما قد فاتنا يوم يمر وليلة تحدونا قال ابن إسحاق وكان ذو الكعبات لبكر وتغلب ابني وائل وإياد بسنداد وله يقول أعشى بن قيس بن ثعلبة بين الخورنق والسدير وبارق والبيت ذو الكعبات في سنداد ولهذا قال تعالى \"أفرأيتم اللات والعزى ومناة الثالثة الأخرى\"."
    },
    { "ayah": 21, "surah": 53, "text": "أي أتجعلون له ولدا وتجعلون ولده أنثى وتختارون لأنفسكم الذكور." },
    {
      "ayah": 22,
      "surah": 53,
      "text": "أي لو اقتسمتم أنتم ومخلوق مثلكم هذه القسمة لكانت \"قسمة ضيزى\" أي جورا باطلة فكيف تقاسمون ربكم هذه القسمة التي لو كانت بين مخلوقين كانت جورا وسفها."
    },
    {
      "ayah": 23,
      "surah": 53,
      "text": "\"إن هي إلا أسماء سميتموها أنتم وآباؤكم\" أي من تلقاء أنفسكم \"ما أنزل الله بها من سلطان\" أي من حجة \"إن يتبعون إلا الظن وما تهوى الأنفس\" أي ليس له مستند إلا حسن ظنهم بآبائهم الذين سلكوا هذا المسلك الباطل قبلهم وإلا حظ نفوسهم في رياستهم وتعظيم آبائهم الأقدمين \"ولقد جاءهم من ربهم الهدى\" أي ولقد أرسل الله إليهم الرسل بالحق المنير والحجة القاطعة ومع هذا ما اتبعوا ما جاؤهم به ولا انقادوا له."
    },
    {
      "ayah": 24,
      "surah": 53,
      "text": "أي ليس كل من تمنى خيرا حصل له \"ليس بأمانيكم ولا أماني أهل الكتاب\" ما كل من زعم أنه مهتد يكون كما قال ولا كل من ود شيئا يحصل له. قال الإمام أحمد حدثنا إسحاق حدثنا أبو عوانة عن عمر بن أبي سلمة عن أبيه عن أبي هريرة قال: قال رسول الله صلى الله عليه وسلم \"إذا تمنى أحدكم فلينظر ما يتمنى فإنه لا يدري ما يكتب له من أمنيته\" تفرد به أحمد."
    },
    {
      "ayah": 25,
      "surah": 53,
      "text": "أي إنما الأمر كله لله مالك الدنيا والآخرة والمتصرف في الدنيا والآخرة فهو الذي ما شاء كان وما لم يشأ لم يكن."
    },
    {
      "ayah": 26,
      "surah": 53,
      "text": "هذا كقوله \"من ذا الذي يشفع عنده إلا بإذنه\" \"ولا تنفع الشفاعة عنده إلا لمن أذن له\" فإذا كان هذا في حق الملائكة المقربين فكيف ترجون أيها الجاهلون شفاعة هذه الأصنام والأنداد عند الله وهو تعالى لم يشرع عبادتها ولا أذن فيها بل قد نهى عنها على ألسنة جميع رسله وأنزل بالنهي عن ذلك جميع كتبه."
    },
    {
      "ayah": 27,
      "surah": 53,
      "text": "يقول تعالى منكرا على المشركين في تسميتهم الملائكة تسمية الأنثى وجعلهم لها أنها بنات الله تعالى الله عن ذلك كما قال تعالى \"وجعلوا الملائكة الذين هم عباد الرحمن إناثا أشهدوا خلقهم ستكتب شهادتهم ويسئلون\"."
    },
    {
      "ayah": 28,
      "surah": 53,
      "text": "أي ليس لهم علم صحيح بصدق ما قالوه بل هو كذب وزور وافتراء وكفر شنيع \"إن يتبعون إلا الظن وإن الظن لا يغني من الحق شيئا\" أي لا يجدي شيئا ولا يقوم أبدا مقام الحق. وقد ثبت في الصحيح أن رسول الله صلى الله عليه وسلم قال \"إياكم والظن فإن الظن أكذب الحديث\"."
    },
    {
      "ayah": 29,
      "surah": 53,
      "text": "أي أعرض عن الذي أعرض عن الحق واهجره. وقوله \"ولم يرد إلا الحياة الدنيا\" أي وإنما أكثر همه ومبلغ علمه الدنيا فذاك هو غاية ما لا خير فيه."
    },
    { "ayah": 3, "surah": 53, "text": "أي ما يقول قولا عن هوى وغرض." },
    {
      "ayah": 30,
      "surah": 53,
      "text": "أي طلب الدنيا والسعي لها هو غاية ما وصلوا إليه. وقد روى الإمام أحمد عن أم المؤمنين عائشة رضي الله عنها قالت: قال رسول الله صلى الله عليه وسلم \"الدنيا دار من لا دار له ومال من لا مال له ولها يجمع من لا عقل له\" وفي الدعاء المأثور \"اللهم لا تجعل الدنيا أكبر همنا ولا مبلغ علمنا\" وقوله تعالى \"إن ربك هو أعلم بمن ضل عن سبيله وهو أعلم بمن اهتدى\" أي هو الخالق لجميع المخلوقات والعالم بمصالح عباده وهو الذي يهدي من يشاء ويضل من يشاء وذلك كله عن قدرته وعلمه وحكمته وهو العادل الذي لا يجور أبدا لا في شرعه ولا في قدره."
    },
    {
      "ayah": 31,
      "surah": 53,
      "text": "يخبر تعالى أنه مالك السموات والأرض وأنه الغني عما سواه الحاكم في خلقه بالعدل وخلق الخلق بالحق \"ليجزي الذين أساءوا بما عملوا ويجزي الذين أحسنوا بالحسنى\" أي يجازي كلا بعمله إن خيرا فخير وإن شرا فشر."
    },
    {
      "ayah": 32,
      "surah": 53,
      "text": "فسر المحسنين بأنهم الذين يجتنبون كبائر الإثم والفواحش أي لا يتعاطون المحرمات الكبائر وإن وقع منهم بعض الصغائر فإنه يغفر لهم ويستر عليهم كما قال في الآية الأخرى \"إن تجتنبوا كبائر ما تنهون عنه نكفر عنكم سيئاتكم وندخلكم مدخلا كريما\". وقال ههنا \"الذين يجتنبون كبائر الإثم والفواحش إلا اللمم\" وهذا استثناء منقطع لأن اللمم من صغائر الذنوب ومحقرات الأعمال. قال الإمام أحمد حدثنا عبدالرزاق أخبرنا معمر عن ابن طاوس عن أبيه عن ابن عباس قال ما رأيت شيئا أشبه باللمم مما قال أبو هريرة عن النبي صلى الله عليه وسلم قال \"إن الله تعالى كتب على ابن آدم حظه من الزنا أدرك ذلك لا محالة فزنا العين النظر وزنا اللسان النطق والنفس تمني وتشتهي والفرج يصدق ذلك أو يكذبة\" أخرجاه في الصحيحين من حديث عبدالرزاق به وقال ابن جرير حدثنا محمد بن عبدالأعلى أخبرنا ابن ثور حدثنا معمر عن الأعمش عن أبي الضحى أن ابن مسعود قال: زنا العينين النظر وزنا الشفتين التقبيل وزنا اليدين البطش وزنا الرجلين المشي ويصدق ذلك الفرج أو يكذبه فإن تقدم بفرجه كان زانيا وإلا فهو اللمم وكذا قال مسروق والشعبي. وقال عبدالرحمن بن نافع الذي يقال له ابن لبابة الطائفي قال سألت أبا هريرة عن قول الله \"إلا اللمم\" قال القبلة والغمزة والنظرة والمباشرة فإذا مس الختان الختان فقد وجب الغسل وهو الزنا وقال علي بن أبي طلحة عن ابن عباس \"إلا اللمم\" إلا ما سلف وكذا قال زيد بن أسلم. وقال ابن جرير حدثنا ابن المثنى حدثتا محمد بن جعفر حدثنا شعبة عن منصور عن مجاهد أنه قال في هذه الآية \"إلا اللمم\" قال الذي يلم بالذنب ثم يدعه قال الشاعر: إن تغفر اللهم تغفر جما أي عبد لك ما ألما وقال ابن جرير حدثنا ابن حميد حدثنا جرير عن منصور عن مجاهد في قول الله تعالى \"إلا اللمم\" قال الرجل يلم بالذب ثم ينزع عنه قال وكان أهل الجاهلية يطوفون بالبيت وهم يقولون إن تغفر اللهم تغفر جما وأي عبد لك ما ألما وقد رواه ابن جرير وغيره مرفوعا قال ابن جرير حدثني سليمان بن عبدالجبار حدثنا أبو عاصم حدثنا زكريا بن إسحاق عن عمرو بن دينار عن عطاء عن ابن عباس \"الذين يجتنبون كبائر الإثم والفواحش إلا اللمم\" قال هو الرجل يلم بالفاحشة ثم يتوب وقال: قال رسول الله صلى الله عليه وسلم \"إن تغفر اللهم تغفر جما وأي عبد لك ما ألما\" وهكذا رواه الترمذي عن أحمد بن عثمان البصري عن أبي عاصم النبيل ثم قال هذا حديث صحيح حسن غريب لا نعرفه إلا من حديث زكريا بن إسحاق وكذا قال البزار لا نعلمه يروى متصلا إلا من هذا الوجه وساقه ابن أبي حاتم والبغوي من حديث أبي عاصم النبيل وإنما ذكره البغوي في تفسير سورة تنزيل وفي صحته مرفوعا نظر. ثم قال ابن جرير حدثنا محمد بن عبدالله بن بزيع حدثنا يزيد بن زريع حدثنا يونس عن الحسن عن أبي هريرة رضي الله عنه أراه رفعه في \"الذين يجتنبون كبائر الإثم والفواحش إلا اللمم\" قال \"اللمة من الزنا ثم يتوب ولا يعود. واللمم من السرقة ثم يتوب ولا يعود واللمة من شرب الخمر ثم يتوب ولا يعود قال فذلك الإلمام\" وحدثنا ابن بشار حدثنا ابن أبي عدي عن عوف عن الحسن في قول الله تعالى \"الذين يجتنبون كبائر الإثم والفواحش إلا اللمم\" قال اللمم من الزنا أو السرقة أو شرب الخمر ثم لا يعود. وحدثني يعقوب حدثنا ابن علية عن أبي رجاء عن الحسن في قول الله \"الذين يجتنبون كبائر الإثم والفواحش إلا اللمم\" قال كان أصحاب رسول الله صلى الله عليه وسلم يقولون هو الرجل يصيب اللمة من الزنا واللمة من شرب الخمر فيجتنبها ويتوب منها. وقال ابن جرير عن عطاء عن ابن عباس \"إلا اللمم\" يلم بها في الحين قلت الزنا؟ قال الزنا ثم يتوب وقال ابن جرير أيضا حدثنا أبو كريب حدثنا ابن عيينة عن عمرو عن عطاء عن ابن عباس رضي الله عنه قال اللمم الذي يلم المرة. وقال السدي قال أبو صالح سئلت عن اللمم فقلت هو الرجل يصيب الذنب ثم يتوب وأخبرت بذلك ابن عباس فقال لقد أعانك عليها ملك كريم حكاه البغوي. وروى ابن جرير من طريق المثنى بن الصباح وهو ضعيف عن عمرو بن شعيب أن عبدالله بن عمرو قال اللمم ما دون الشرك وقال سفيان الثوري عن جابر الجعفي عن عطاء عن ابن الزبير \"إلا اللمم\" قال ما بين الحدين حد الزنا وعذاب الآخرة وكذا رواه شعبة عن الحكم عن ابن عباس مثله سواء. وقال العوفي عن ابن عباس في قوله \"إلا اللمم\" كل شيء بين الحدين حد الدنيا وحد الآخرة تكفره الصلوات فهو اللمم وهو دون كل موجب فأما حد الدنيا فكل حد فرض الله عقوبته في الدنيا وأما حد الآخرة فكل شيء ختمه الله بالنار وأخر عقوبته إلى الآخرة. وكذا قال عكرمة وقتادة والضحاك وقوله تعالى \"إن ربك واسع المغفرة\" أي رحمته وسعت كل شيء ومغفرته تسع الذنوب كلها لمن تاب منها كقوله تعالى \"قل يا عبادي الذين أسرفوا على أنفسهم لا تقنطوا من رحمة الله إن الله يغفر الذنوب جميعا إنه هو الغفور الرحيم \"وقوله تعالى \"هو أعلم بكم إذ أنشأكم من الأرض\" أي هو بصير بكم عليم بأحوالكم وأفعالكم وأقوالكم التي ستصدر عنكم وتقع منكم حين أنشأ أباكم آدم من الأرض واستخرج ذريته من صلبه أمثال الذر ثم قسمهم فريقين فريقا للجنة وفريقا للسعير وكذا قوله \"وإذ أنتم أجنة في بطون أمهاتكم قد كتب الملك الذي يوكل به رزقه وأجله وعمله وشقي أم سعيد؟ قال مكحول كنا أجنة في بطون أمهاتنا فسقط منا من سقط وكنا فيمن بقي ثم كنا مراضيع فهلك منا من هلك وكنا فيمن بقي ثم صرنا يفعة فهلك منا من هلك وكنا فيمن بقي ثم صرنا شبانا فهلك منا من هلك وكنا فيمن بقي ثم صرنا شيوخا لا أبالك فماذا بعد هذا ننتظر؟ رواه ابن أبي حاتم عنه. وقوله تعالى \"فلا تزكوا أنفسكم\" أي تمدحوها وتشكروها وتمنوا بأعمالكم \"هو أعلم بمن اتقى\" كما قال تعالى \"ألم تر إلى الذين يزكون أنفسهم بل الله يزكي من يشاء ولا يظلمون فتيلا\". وقال مسلم في صحيحه حدثنا عمرو الناقد حدثنا هاشم بن القاسم حدثنا الليث عن يزيد بن أبي حبيب عن محمد بن عمرو بن عطاء قال سميت ابنتي برة فقالت لي زينب بنت أبي سلمة إن رسول الله صلى الله عليه وسلم نهى عن هذا الاسم وسميت برة فقال رسول الله صلى الله عليه وسلم \"لا تزكوا أنفسكم إن الله أعلم بأهل البر منكم\" فقالوا بم نسميها؟ قال \"سموها زينب\" وقد ثبت أيضا في الحديث الذي رواه الإمام أحمد حيث قال حدثنا عفان حدثنا وهيب حدثنا خالد الحذاء عن عبدالرحمن بن أبي بكرة عن أبيه قال مدح رجل رجلا عند النبي صلى الله عليه وسلم فقال رسول الله \"ويلك قطعت عنق صاحبك - مرارا - إذا كان أحدكم مادحا صاحبه لا محالة فليقل أحسب فلانا والله حسيبه ولا أزكي على الله أحدا أحسبه كذا وكذا إن كان يعلم ذلك \" ثم رواه عن غندر عن شعبة عن خالد الحذاء به وكذا رواه البخاري ومسلم وأبو داود وابن ماجة من طرق عن خالد الحذاء به. وقال الإمام أحمد حدثنا وكيع وعبدالرحمن قالا أخبرك سفيان عن منصور عن إبراهيم عن همام بن الحارث قال جاء رجل إلى عثمان فأثنى عليه في وجهه قال فجعل المقداد بن الأسود يحثو في وجهه التراب ويقول أمرنا رسول الله صلى الله عليه وسلم إذا لقينا المداحين أن نحثو في وجوههم التراب ورواه مسلم وأبو داود من حديث الثوري عن منصور به."
    },
    { "ayah": 33, "surah": 53, "text": "يقول تعالى ذاما لمن تولى عن طاعة الله \"فلا صدق ولا صلى ولكن كذب وتولى\"." },
    {
      "ayah": 34,
      "surah": 53,
      "text": "قال ابن عباس أطاع قليلا ثم قطعه وكذا قال مجاهد وسعيد بن جبير وعكرمة وقتادة وغير واحد قال عكرمة وسعيد كمثل القوم إذا كانوا يحفرون بئرا فيجدون في أثناء الحفر صخرة تمنعهم من تمام العمل فيقولون أكدينا ويتركون العمل."
    },
    {
      "ayah": 35,
      "surah": 53,
      "text": "أي أعند هذا الذي قد أمسك يده خشية الإنفاق وقطع معروفه أعنده علم الغيب أنه سينفد ما في يده حتى قد أمسك عن معروفه فهو يرى ذلك عيانا؟ أي ليس الأمر كذلك وإنما أمسك عن الصدقة والمعروف والبر والصلة بخلا وشحا وهلعا. ولهذا جاء في الحديث \"أنفق بلالا ولا تخش من ذي العرش إقلالا\" وقد قال الله تعالى \"وما أنفقتم من شيء فهو يخلفه وهو خير الرازقين\"."
    },
    {
      "ayah": 36,
      "surah": 53,
      "text": "قوله تعالى \"أم لم ينبأ بما في صحف موسى وإبراهيم الذي وفى\" قال سعد بن جبير والثوري أي بلغ جميع ما أمر به وقال ابن عباس \"وفى\" لله بالبلاغ وقال سعيد بن جبير \"وفى\" ما أمر به وقال قتادة \"وفى\" طاعة الله وأدى رسالته الى خلقه وهذا القول هو اختيار ابن جرير وهو يشمل الذي قبله ويشهد له قوله تعالى \"وإذ ابتلى إبراهيم ربه بكلمات فأتمهن قال إنى جاعلك للناس إماما \"فقام بجميع الأوامر وترك جميع النواهي وبلغ الرسالة على التمام والكمال فاستحق بهذا أن يكون للناس إماما يقتدى به في جميع أحواله وأقواله وأفعاله قال الله تعالى \"ثم أوحينا إليك أن اتبع ملة إبراهيم حنيفا وما كان من المشركين\" وقال ابن أبي حاتم حدثنا محمد بن عوف الحمصي حدثنا آدم بن أبي إياس العسقلاني حدثنا حماد بن سلمة حدثنا جعفر بن الزبير عن القاسم عن أبي أمامة قال: تلا رسول الله صلى الله عليه وسلم هذه الآية \"وإبراهيم الذي وفى\"- قال - أتدري ما وفى؟ \" قلت الله ورسوله أعلم قال \"وفى عمل يومه بأربع ركعات من أول النهار\" ورواه ابن جرير من حديث جعفر بن الزبير وهو ضعيف. وقال الترمذي في جامعه حدثنا أبو جعفر السمناني حدثنا أبو مسهر حدثنا إسماعيل بن عياش عن يحيى بن سعد عن خالد بن معدان عن جبير بن نفير عن أبي الدرداء وأبي ذر عن رسول الله صلى الله عليه وسلم عن الله عز وجل أنه قال \"ابن آدم اركع لى أربع ركعات من أول النهار أكفك آخره\" قال ابن أبي حاتم رحمه الله وحدثنا أبي حدثنا الربيع بن سليمان حدثنا أسد بن موسى حدثنا ابن لهيعة حدثنا زبان بن فايد عن سهل بن معاذ بن أنس عن أبيه عن رسول الله صلى الله عليه وسلم أنه قال \"ألا أخبركم لم سمى الله تعالى إبراهيم خليله الذي وفى؟ إنه كان يقول كل ما أصبح وأمسى \"فسبحان الله حين تمسون وحين تصبحون\" حتى ختم الآية.ورواه ابن جرير عن أبي كريب عن رشدين بن سعيد عن زبان به ثم شرع تعالى يبين ما كان أوحاه في صحف إبراهيم وموسى."
    },
    {
      "ayah": 37,
      "surah": 53,
      "text": "أي كل نفس ظلمت نفسها بكفر أو شيء من الذنوب فإنما عليها وزرها لا يحمله عنها أحد كما قال \"وإن تدع مثقلة إلى حملها لا يحمل منه شيء ولو كان ذا قربى\"."
    },
    {
      "ayah": 38,
      "surah": 53,
      "text": "ألا تزر وازرة وزر أخرىأي كل نفس ظلمت نفسها بكفر أو شيء من الذنوب فإنما عليها وزرها لا يحمله عنها أحد كما قال \" وإن تدع مثقلة إلى حملها لا يحمل منه شيء ولو كان ذا قربى\" ."
    },
    {
      "ayah": 39,
      "surah": 53,
      "text": "أي كما لا يحمل عليه وزر غيره كذلك لا يحصل من الأجر إلا ما كسب هو لنفسه ومن وهذه الآية الكريمة استنبط الشافعي رحمه الله ومن اتبعه أن القراءة لا يصل إهداء ثوابها إلى الموتى لأنه ليس من عملهم ولا كسبهم ولهذا لم يندب إليه رسول الله صلى الله عليه وسلم أمته ولا حثهم عليه ولا أرشدهم إليه بنص ولا إيماء ولم ينقل ذلك عن أحد من الصحابة رضي الله عنهم ولو كان خيرا لسبقونا إليه وباب القربات يقتصر فيه على النصوص ولا يتصرف فيه بأنواع الأقيسة والآراء فأما الدعاء والصدقة فذاك مجمع على وصولهما ومنصوص من الشارع عليهما. وأما الحديث الذي رواه مسلم في صحيحه عن أبي هريرة قال: قال رسول الله صلى الله عليه وسلم \"إذا مات الإنسان انقطع عمله إلا من ثلاث: من ولد صالح يدعو له أو صدقة جارية من بعده أو علم ينتفع به\" فهذه الثلاثة في الحقيقة هي من سعيه وكده وعمله كما جاء في الحديث \"إن أطيب ما أكل الرجل من كسبه وإن ولده من كسبه\" والصدقة الجارية كالوقف ونحوه هي من آثار عمله ووقفه وقد قال تعالى \"إنا نحن نحيي الموتى ونكتب ما قدموا وآثارهم\" الآية والعلم الذي نشره في الناس فاقتدى به الناس بعده هو أيضا من سعيه وعمله وثبت في الصحيح \"من دعا إلى هدى كان له من الأجر مثل أجور من اتبعه من غير أن ينقص من أجورهم شيئا\"."
    },
    {
      "ayah": 4,
      "surah": 53,
      "text": "أي إنما يقول ما أمر به يبلغه إلى الناس كاملا موفورا من غير زيادة ولا نقصان كما رواه الإمام أحمد حدثنا يزيد حدثنا جرير بن عثمان عن عبدالرحمن بن ميسرة عن أبي أمامة أنه سمع رسول الله صلى الله عليه وسلم يقول \"ليدخل الجنة بشفاعة رجل ليس بنبي مثل الحيين - أو مثل أحد الحيين - ربيعة ومضر\" فقال رجل يا رسول الله أو ما ربيعة من مضر؟ قال \"إنما أقول ما أقول\" وقال الإمام أحمد حدثنا يحيى بن سعيد عن عبيد الله بن الأخنس أخبرنا الوليد بن عبدالله عن يوسف بن ماهك عن عبدالله بن عمرو قال كنت أكتب كل شيء أسمعه من رسول الله صلى الله عليه وسلم أريد حفظه فنهتني قريش فقالوا إنك تكتب كل شيء تسمعه من رسول الله صلى الله عليه وسلم ورسول الله صلى الله عليه وسلم بشر يتكلم في الغضب فأمسكت عن الكتاب فذكرت ذلك لرسول الله صلى الله عليه وسلم فقال \"اكتب فوالذي نفسي بيده ما خرج مني إلا الحق\" ورواه أبو داود عن مسدد وأبي بكر بن أبي شيبة كلاهما عن يحيى بن سعيد القطان به. وقال الحافظ أبو بكر البزار حدثنا أحمد ابن منصور حدثنا عبدالله بن صالح حدثنا الليث عن ابن عجلان عن زيد بن أسلم عن أبي صالح عن أبي هريرة عن النبي صلى الله عليه وسلم قال \"ما أخبرتكم أنه من عند الله فهو الذي لا شك فيه\" ثم قال لا نعلمه يروى إلا بهذا الإسناد وقال الإمام أحمد حدثنا يونس حدثنا ليث عن محمد بن سعيد بن أبي سعيد عن أبي هريرة عن رسول الله صلى الله عليه وسلم أنه قال \"لا أقول إلا حقا\" قال بعض أصحابه فإنك تداعبنا يا رسول الله؟ قال \"إني لا أقول إلا حقا\"."
    },
    {
      "ayah": 40,
      "surah": 53,
      "text": "أي يوم القيامة كقوله تعالى \"وقل اعملوا فسيرى الله عملكم ورسوله والمؤمنون وستردون إلى عالم الغيب والشهادة فينبئكم بما كنتم تعملون\" أي فيخبركم به ويجزيكم عليه أتم الجزاء إن خيرا فخير وإن شرا فشر."
    },
    { "ayah": 41, "surah": 53, "text": "قال هنا \"ثم يجزاه الجزاء الأوفى\" أي الأوفر." },
    {
      "ayah": 42,
      "surah": 53,
      "text": "أي المعاد يوم القيامة قال ابن أبي حاتم حدثنا أبي حدثنا سويد بن سعيد حدثنا مسلم بن خالد عن عبدالرحمن بن سابط عن عمرو بن ميمون الأودي قال قام فينا معاذ بن جبل فقال يا بني أود إني رسول رسول الله صلى الله عليه وسلم إليكم تعلمون أن المعاد إلى الله إلى الجنة أو إلى النار. وذكر البغوي من رواية أبي جعفر الرازي عن الربيع بن أنس عن أبي العالية عن أبي بن كعب عن النبي صلى الله عليه وسلم في قوله \"وأن إلى ربك المنتهى\" \"قال لا فكرة في الرب\" قال البغوى وهذا مثل ما روي عن أبي هريرة مرفوعا \"تفكروا في الخلق ولا تفكروا في الخالق فإنه لا تحيط به الفكرة\" وكذا أورده وليس بمحفوظ بهذا اللفظ وإنما الذي في الصحيح \"يأتي الشيطان أحدكم فيقول من خلق كذا؟ من خلق كذا؟ حتى يقول من خلق ربك؟ فإذا بلغ أحدكم ذلك فليستعذ بالله ولينته\". والحديث الآخر الذي في السنن \"تفكروا في مخلوقات الله ولا تفكروا في ذات الله فإن الله تعالى خلق ملكا ما بين شحمة أذنه إلى عاتقه مسيرة ثلاثمائة سنة\" أو كما قال."
    },
    { "ayah": 43, "surah": 53, "text": "أي خلق في عباده الضحك والبكاء وسببهما وهما مختلفان." },
    { "ayah": 44, "surah": 53, "text": "\"وأنه هو أمات وأحيا\" كقوله \"الذي خلق الموت والحياة\"." },
    {
      "ayah": 45,
      "surah": 53,
      "text": "\"وأنه خلق الزوجين الذكر والأنثى من نطفة إذا تمنى\" كقوله \"أيحسب الإنسان أن يترك سدى ألم يك نطفة من مني يمنى ثم كان علقة فخلق فسوى فجعل منه الزوجين الذكر والأنثى أليس ذلك بقادر على أن يحيى الموتى\"."
    },
    {
      "ayah": 46,
      "surah": 53,
      "text": "\"وأنه خلق الزوجين الذكر والأنثى من نطفة إذا تمنى\" كقوله \"أيحسب الإنسان أن يترك سدى ألم يك نطفة من مني يمنى ثم كان علقة فخلق فسوى فجعل منه الزوجين الذكر والأنثى أليس ذلك بقادر على أن يحيى الموتى\"."
    },
    { "ayah": 47, "surah": 53, "text": "أي كما خلق البداءة هو قادر على الإعادة وهي النشأة الآخرة يوم القيامة." },
    {
      "ayah": 48,
      "surah": 53,
      "text": "أي ملك عباده المال وجعله لهم قنية مقيما عندهم لا يحتاجون إلى بيعه فهذا تمام النعمة عليهم وعلى هذا يدور كلام كثير من المفسرين منهم أبو صالح وابن جرير وغيرهما وعن مجاهد \"أغنى\" مول \"وأقنى\" أخدم وكذا قال قتادة وقال ابن عباس ومجاهد أيضا \"أغنى\" أعطى \"وأقنى\" رضى وقيل معناه أغنى نفسه وأفقر الخلائق إليه قاله الحضرمي بن لاحق وقيل أغنى من شاء من خلقه وأقنى أي أفقر من شاء منهم قال ابن زيد حكاهما ابن جرير وهما بعيدان من حيث اللفظ."
    },
    {
      "ayah": 49,
      "surah": 53,
      "text": "قال ابن عباس ومجاهد وقتادة وابن زيد وغيرهم هو هذا النجم الوقاد الذي يقال له مرزم الجوزاء كانت طائفة من العرب يعبدونه."
    },
    {
      "ayah": 5,
      "surah": 53,
      "text": "يقول تعالى مخبرا عن عبده ورسوله محمد صلى الله عليه وسلم أنه علمه الذي جاء به إلى الناس \"شديد القوى\" وهو جبريل عليه الصلاة والسلام كما قال تعالى \"إنه لقول رسول كريم ذي قوة عند ذي العرش مكين مطاع ثم أمين\"."
    },
    {
      "ayah": 50,
      "surah": 53,
      "text": "هم قوم هود ويقال لهم عاد بن إرم بن سام بن نوح كما قال تعالى \"ألم تر كيف فعل ربك بعاد إرم ذات العماد التي لم يخلق مثلها في البلاد\" فكانوا من أشد الناس وأقواهم وأعتاهم على الله تعالى وعلى رسوله فأهلكهم الله \"بريح صرصر عاتية سخرها عليهم سبع ليال وثمانية أيام حسوما\" أي متتابعة."
    },
    { "ayah": 51, "surah": 53, "text": "أي دمرهم فلم يبق منهم أحدا." },
    {
      "ayah": 52,
      "surah": 53,
      "text": "\"وقوم نوح من قبل\" أي من قبل هؤلاء \"إنهم كانوا هم أظلم وأطغى\" أي أشد تمردا من الذين من بعدهم."
    },
    {
      "ayah": 53,
      "surah": 53,
      "text": "يعني مدائن قوم لوط قلبها عليهم فجعل عاليها سافلها وأمطر عليهم حجارة من سجيل منضود."
    },
    {
      "ayah": 54,
      "surah": 53,
      "text": "قال فغشاها ما غشى يعني من الحجارة التي أرسلها عليهم \"وأمطرنا عليهم مطرا فساء مطر المنذرين\" قال قتادة كان في مدائن لوط أربعة آلاف ألف إنسان فانضرم عليهم الوادي شيئا من نار ونفط وقطران كفم الأتون. رواه ابن أبي حاتم عن أبيه عن محمد بن وهب بن عطية عن الوليد بن مسلم عن خليد عنه به وهو غريب جدا."
    },
    {
      "ayah": 55,
      "surah": 53,
      "text": "أي ففي أي نعم الله عليك أيها الإنسان تمتري؟ قاله قتادة وقال ابن جريج يا محمد والأول أولى وهو اختيار ابن جرير."
    },
    {
      "ayah": 56,
      "surah": 53,
      "text": "\"هذا نذير\" يعني محمدا صلى الله عليه وسلم \"من النذر الأولى\" أي من جنسهم أرسل كما أرسلوا كما قال تعالى \"قل ما كنت بدعا من الرسل\"."
    },
    { "ayah": 57, "surah": 53, "text": "أي اقتربت القريبة وهي القيامة." },
    {
      "ayah": 58,
      "surah": 53,
      "text": "أي لا يدفعها إذا من دون الله أحد ولا يطلع على علمها سواه والنذير الحذر لما يعاين من الشر الذي يخشى وقوعه فيمن أنذرهم كما قال \"إني نذير لكم بين يدي عذاب شديد\" وفي الحديث \"أنا النذير العريان\" أي الذي أعجله شدة ما عاين من الشر عن أن يلبس عليه شيئا بل بادر إلى إنذار قومه قبل ذلك فجاءهم عريانا مسرعا وهو مناسب لقوله \"أزفت الآزفة\" أي اقتربت القريبة يعني يوم القيامة كما قال في أول السورة التي بعدها \"اقتربت الساعة\" وقال الإمام أحمد حدثنا أنس بن عياض حدثني أبو حاتم لا أعلم إلا عن سهل بن سعد قال: قال رسول الله صلى الله عليه وسلم \"إياكم ومحقرات الذنوب فإنما مثل محقرات الذنوب كمثل قوم نزلوا ببطن واد فجاء ذا بعود وجاء ذا بعود حتى أنضجوا خبزتهم وإن محقرات الذنوب متى يؤخذ بها صاحبها تهلكة\" وقال أبو حازم: قال رسول الله صلى الله عليه وسلم قال أبو نضرة لا أعلم إلا عن سهل بن سعد قال \"مثلي ومثل الساعة كهاتين\" وفرق بين أصبعيه الوسطى والتي تلي الإبهام ثم قال \"مثلي ومثل الساعة كمثل فرسي رهان\" ثم قال \"مثلي ومثل الساعة كمثل رجل بعثه قومه طليعة فلما خشي أن يسبق ألاح بثوبه أتيتم أتيتم\" ثم يقول رسول الله صلى الله عليه وسلم \"أنا ذلك\" وله شواهد من وجوه أخر من صحاح وحسان."
    },
    {
      "ayah": 59,
      "surah": 53,
      "text": "قال تعالى منكرا على المشركين في استماعهم القرآن وإعراضهم عنه وتلهيهم \"تعجبون\" من أن يكون صحيحا."
    },
    {
      "ayah": 6,
      "surah": 53,
      "text": "قال ههنا \"ذو مرة\" أي ذو قوة قاله مجاهد والحسن وابن زيد وقال ابن عباس: ذو منظر حسن وقال قتادة ذو خلق طويل حسن ولا منافاة بين القولين فإن عليه السلام ذو منظر حسن وقوة شديدة وقد ورد في الحديث الصحيح من رواية ابن عمر وأبي هريرة أن النبي صلى الله عليه وسلم قال \"لا تحل الصدقة لغني ولا لذي مره سوي\" وقوله تعالى \"فاستوى\" يعني جبريل عليه السلام قاله الحسن ومجاهد وقتادة والربيع بن أنس."
    },
    {
      "ayah": 60,
      "surah": 53,
      "text": "\"وتضحكون\" منه استهزاء وسخرية \"ولا تبكون\" أي كما يفعل الموقنون به كما أخبر عنهم \"ويخرون للأذقان يبكون ويزيدهم خشوعا\"."
    },
    {
      "ayah": 61,
      "surah": 53,
      "text": "قال سفيان الثوري عن أبيه عن ابن عباس قال: الغناء هي يمانية أسمد لنا غن لنا وكذا قال عكرمة وفي رواية عن ابن عباس \"سامدون\" معرضون وكذا قال مجاهد وعكرمة وقال الحسن غافلون وهو رواية عن أمير المؤمنين علي بن أبي طالب وفي رواية عن ابن عباس تستكبرون وبه يقول السدي ثم قال تعالى آمرا لعباده بالسجود له والعبادة المتابعة لرسوله صلى الله عليه وسلم والتوحيد والإخلاص."
    },
    {
      "ayah": 62,
      "surah": 53,
      "text": "أي فاخضعوا له وأخلصوا ووحدوه قال البخاري حدثنا أبو معمر حدثنا عبدالوارث حدثنا أيوب عن عكرمة عن ابن عباس قال: سجد النبي صلى الله عليه وسلم بالنجم وسجد معه المسلمون والمشركون والجن والإنس. انفرد به دون مسلم وقال الإمام أحمد حدثنا إبراهيم بن خالد حدثنا رباح عن معمر عن ابن طاوس عن عكرمة بن خالد عن جعفر بن المطلب بن أبي وداعة عن أبيه قال: قرأ رسول الله صلى الله عليه وسلم بمكة سورة النجم فسجد وسجد من عنده فرفعت رأسي فأبيت أن أسجد ولم يكن أسلم يومئذ المطلب فكان بعد ذلك لا يسمع أحدا يقرؤها إلا سجد معه. وقد رواه النسائي في الصلاة عن عبدالملك بن عبدالحميد عن أحمد بن حنبل به. آخر تفسير سورة النجم ولله الحمد والمنة."
    },
    {
      "ayah": 7,
      "surah": 53,
      "text": "يعني جبريل استوى في الأفق الأعلى. قاله عكرمة وغير واحد. قال عكرمة: والأفق الأعلى الذي يأتي منه الصبح وقال مجاهد هو مطلع الشمس وقال قتادة هو الذي يأتي منه النهار وكذا قال ابن زيد وغيرهم وقال ابن أبي حاتم حدثنا أبو زرعة حدثنا مصرف بن عمرو اليامي أبو القاسم حدثنا عبدالرحمن بن محمد بن طلحة بن مصرف حدثني أبي عن الوليد هو ابن قيس عن إسحق بن أبي الكهتلة أظنه ذكره عن عبدالله بن مسعود أن رسول الله صلى الله عليه وسلم لم ير جبريل في صورته إلا مرتين أما واحدة فإنه سأله أن يراه في صورته فسد الأفق وأما الثانية فإنه كان معه حيث صعد فذلك قوله \"وهو بالأفق الأعلى\" وقد قال ابن جرير ههنا قولا لم أره لغيره ولا حكاه هو عن أحد وحاصله: أنه ذهب إلى أن المعنى فاستوى أي هذا الشديد القوى ذو المرة هو ومحمد صلى الله عليه وسلم بالأفق الأعلى أي استويا جميعا بالأفق الأعلى وذلك ليلة الإسراء كذا قال ولم يوافقه أحد على ذلك ثم شرع يوجه ما قاله من حيث العربية فقال وهو كقوله \"أئذا كنا ترابا وآباؤنا\" فعطف بالآباء على المكنى في كنا من غير إظهار نحن فكذلك قوله فاستوى وهو قال وذكر الفراء عن بعض العرب أنه أنشده: ألم تر أن النبع يصلب عوده ولايستوي والخروع المتقصف وهذا الذي قاله من جهة العربية متجه ولكن لا يساعده المعنى على ذلك فإن هذه الرؤية لجبريل لم تكن ليلة الإسراء بل قبلها ورسول الله صلى الله عليه وسلم في الأرض."
    },
    {
      "ayah": 8,
      "surah": 53,
      "text": "هبط عليه جبريل عليه السلام وتدلى إليه فاقترب منه وهو على الصورة التي خلقه الله عليها له ستمائة جناح ثم رآه بعد ذلك نزلة أخرى عند سدرة المنتهى يعني ليلة الإسراء وكانت هذه الرؤية الأولى في أوائل البعثة بعدما جاءه جبريل عليه السلام أول مرة فأوحى الله إليه صدر سورة اقرأ ثم فتر الوحي فترة ذهب النبي صلى الله عليه وسلم فيها مرارا ليتردى من رؤوس الجبال فكلما هم بذلك ناداه جبريل من الهواء يا محمد أنت رسول الله حقا وأنا جبريل فيسكن لذلك جأشه وتقر عينه وكلما طال عليه الأمر عاد لمثلها حتى تبدى له جبريل ورسول الله صلى الله عليه وسلم بالأبطح في صورته التي خلقه الله عليها له ستمائة جناح قد سد عظم خلقه الأفق فاقترب منه وأوحى إليه عن الله عز وجل ما أمره به فعرف عند ذلك عظمة الملك الذي جاءه بالرسالة وجلالة قدره وعلو مكانته عند خالقه الذي بعثه إليه فأما الحديث الذي رواه الحافظ أبو بكر البزاز في مسنده حيث قال حدثنا سلمة بن شبيب حدثنا سعيد بن منصور حدثنا الحارث بن عبيد عن أبي عمران الجوني عن أنس بن مالك قال: قال رسول الله صلى الله عليه وسلم \"بينا أنا قاعد إذ جاء جبريل عليه السلام فوكز بين كتفي فقمت إلى شجرة فيها كوكري الطير فقعد في أحدهما وقعدت في الآخر فسمت وارتفعت حتى سدت الخافقين وأنا أقلب طرفي ولو شئت أن أمس السماء لمسست فالتفت إلى جبريل كأنه جلس لاطىء فعرفت فضل علمه بالله علي وفتح لي باب من أبواب السماء ورأيت النور الأعظم وإذا دون الحجاب رفزفة الدر والياقوت وأوحي إلي ما شاء الله أن يوحي\" ثم قال البزار لا يرويه إلا الحارث بن عبيد وكان رجلا مشهورا من أهل البصر \" قلت \" الحارث بن عبيد هذا هو أبو قدامة الأيادي أخرج له مسلم في صحيحه إلا أن ابن معين ضعفه وقال ليس هو بشيء وقال الإمام أحمد مضطرب الحديث وقال أبو حاتم الرازي يكتب حديثه ولا يحتج به وقال ابن حبان كثر وهمه فلا يجوز الاحتجاج به إذا انفرد فهذا الحديث من غرائب رواياته فإن فيه نكارة وغرابة ألفاظ وسياقا عجيبا ولعله منام والله أعلم وقال الإمام أحمد حدثنا حجاج حدثنا شريك عن عاصم عن أبي وائل عن عبدالله أنه قال: رأى رسول الله صلى الله عليه وسلم جبريل في صورته وله ستمائة جناح كل جناح منها قد سد الأفق يسقط من جناحه من التهاويل والدر والياقوت ما الله به عليم. انفرد به أحمد وقال أحمد حدثنا يحيى بن آدم حدثنا أبو بكر بن عياش عن إدريس بن منبه عن وهب بن منبه عن ابن عباس قال: سأل النبي صلى الله عليه وسلم جبريل أن يراه في صورته فقال ادع ربك فدعا ربه عز وجل فطلع عليه سواد من قبل المشرق فجعل يرتفع وينتشر فلما رآه النبي صلى الله عليه وسلم صعق فأتاه فنعشه ومسح البزاق عن شدقه. تفرد به أحمد وقد رواه ابن عساكر في ترجمة عتبة بن أبي لهب من طريق محمد بن إسحاق عن عثمان بن عروة بن الزبير عن أبيه عن هناد بن الأسود قال: كان أبو لهب وابنه عتبة قد تجهزا إلى الشام فتجهزت معهما فقال ابنه عتبة والله لأنطلقن إلى محمد ولآذينه في ربه سبحانه وتعالى فانطلق حتى أتى النبي صلى الله عليه وسلم فقال يا محمد هو يكفر بالذي دنى فتدلى فكان قاب قوسين أو أدنى فقال النبي صلى الله عليه وسلم \"اللهم سلط عليه كلبا من كلابك\" ثم انصرف عنه فرجع إلى أبيه فقال يا بني ما قلت له؟ فذكر له ما قاله فقال فما قال لك قال: قال \"اللهم سلط عليه كلبا من كلابك\" قال يا بني والله ما آمن عليك دعاءه فسرنا حتى نزلنا أبراه وهي في سدة ونزلنا إلى صومعة راهب فقال الراهب يا معشر العرب ما أنزلكم هذه البلاد فإنها يسرح الأسد فيها كما تسرح الغنم فقال لنا أبو لهب: إنكم قد عرفتم كبر سني وحقي وإن هذا الرجل قد دعا على ابني دعوة والله ما آمنها عليه فاجمعوا متاعكم إلى هذه الصومعة وافرشوا لابني عليها ثم افرشوا حولها ففعلنا فجاء الأسد فشم وجوهنا فلما لم يجد ما يريد تقبض فوثب وثبة فإذا هو فوق المتاع فشم وجهه ثم هزمه هزمة ففسخ رأسه فقال أبو لهب قد عرفت أنه لا ينفلت عن دعوة محمد وذكر الحافظ ابن عساكر بسنده إلى هبار بن الأسود رضي الله عنه أن عتبة بن أبي لهب لما خرج في تجارة إلى الشام قال لأهل مكة اعلموا أني كافر بالذي دنا فتدلى فبلغ قوله رسول الله صلى الله عليه وسلم فقال \"سيرسل الله عليه كلبا من كلابه\" قال هبار فكنت معهم فنزلنا بأرض كثيرة الأسد قال فلقد رأيت الأسد جاء فجعل يشم رؤوس القوم واحدا واحدا حتى تخطى إلى عتبة فاقتطع رأسه من بينهم. وذكر ابن إسحاق وغيره في السيرة أن ذلك كان بأرض الزرقاء وقيل بالسراة وأنه خاف ليلتئذ وأنهم جعلوه بينهم وناموا من حوله فجاء الأسد فجعل يزأر ثم تخطاهم إليه فضغم رأسه لعنه الله."
    },
    {
      "ayah": 9,
      "surah": 53,
      "text": "أي فاقترب جبريل إلى محمد لما هبط عليه إلى الأرض حتى كان بينه وبين محمد صلى الله عليه وسلم قاب قوسين أي بقدرهما إذا مدا قاله مجاهد وقتادة. وقد قيل إن المراد بذلك بعد ما بين وتر القوس إلى كبدها. وقوله تعالى \"أو أدنى\" قد تقدم أن هذه الصيغة تستعمل في اللغة لاثبات المخبر عنه ونفي ما زاد عليه كقوله تعالى \"ثم قست قلوبكم من بعد ذلك فهي كالحجارة أو أشد قسوة\" أي ما هي بألين من الحجارة بل هي مثلها أو تزيد عليها في الشدة والقسوة وكذا قوله \"يخشون الناس كخشية الله أو أشد خشية\" وقوله \"وأرسلناه إلى مائة ألف أو يزيدون\" أي ليسوا أقل منها بل هم مائة ألف حقيقة أو يزيدون عليها فهذا تحقيق للمخبر به لا شك ولا تردد فإن هذا ممتنع ههنا وهكذا هذه الآية \"فكان قاب قوسين أو أدنى\" وهذا الذي قلناه من أن هذا المقترب الداني الذي صار بينه وبين محمد صلى الله عليه وسلم إنما هو جبريل عليه السلام وهو قول أم المؤمنين عائشة وابن مسعود وأبي ذر وأبي هريرة كما سنورد أحاديثهم قريبا إن شاء الله تعالى. وروى مسلم في صحيحه عن ابن عباس أنه قال: رأى محمد ربه بفؤاده مرتين فجعل هذه إحداهما وجاء في حديث شريك بن أبي نمر عن أنس في حديث الإسراء ثم دنا الجبار رب العزة فتدلى ولهذا قد تكلم كثير من الناس في متن هذه الرواية وذكروا أشياء فيها من الغرابة فإن صح فهو محمول على وقت آخر وقصة أخرى لا أنها تفسير لهذه الآية فإن هذه كانت ورسول الله صلى الله عليه وسلم في الأرض لا ليلة الإسراء ولهذا قال بعده \"ولقد رآه نزلة أخرى عند سدرة المنتهى\" فهذه هي ليلة الإسراء والأولى كانت في الأرض. وقد قال ابن جرير حدثنا محمد بن عبدالملك بن أبي الشوارب حدثنا عبدالواحد بن زياد حدثنا سليمان الشيباني حدثنا زر بن حبيش قال: قال عبدالله بن مسعود في هذه الآية \"فكان قاب قوسين أو أدنى\" قال: قال رسول الله صلى الله عليه وسلم \"رأيت جبريل له ستمائة جناح\". وقال ابن وهب حدثنا ابن لهيعة عن أبي الأسود عن عروة عن عائشة رضي الله عنها قالت كان أول شأن رسول الله صلى الله عليه وسلم أنه رأى في منامه جبريل بأجياد ثم إنه خرج ليقضي حاجته فصرخ به جبريل يا محمد يا محمد فنظر رسول الله صلى الله عليه وسلم يمينا وشمالا فلم ير أحدا ثلاثا ثم رفع بصره فإذا هو ثاني إحدى رجليه مع الأخرى على أفق السماء فقال يا محمد جبريل جبريل يسكنه فهرب النبي صلى الله عليه وسلم حتى دخل في الناس فنظر فلم ير شيئا ثم خرج من الناس ثم نظر فرآه فدخل في الناس فلم ير شيئا ثم خرج فنظر فرآه فذلك قول الله عز وجل \"والنجم إذا هوى - إلى قوله ثم دنا فتدلى\" يعني جبريل إلى محمد عليهما الصلاة والسلام \"فكاد قاب قوسين أو أدنى\" ويقولون: القاب نصف أصبع وقال بعضهم ذراعين كان بينهما رواه ابن جرير وابن أبي حاتم من حديث ابن وهب به وفي حديث الزهري عن أبي سلمة عن جابر شاهدا لهذا. وروى البخاري عن طلق بن غنام عن زائدة عن الشيباني قال سألت زرا عن قوله \"فكان قاب قوسين أو أدنى فأوحى إلى عبده ما أوحى\" قال حدثنا عبدالله أن محمدا صلى الله عليه وسلم رأى جبريل له ستمائه جناح. وقال ابن جرير حدثني ابن بزيع البغدادي حدثنا إسحاق بن منصور حدثنا إسرائيل عن أبي إسحاق عن عبدالرحمن بن يزيد عن عبدالله \"ما كذب الفؤاد ما رأى\" قال رأى رسول الله صلى الله عليه وسلم جبريل عليه حلتا رفرف قد ملأ ما بين السماء والأرض."
    }
  ]
}
