{
  "ayahs": [
    {
      "ayah": 1,
      "surah": 54,
      "text": "سورة القمر: قد تقدم في حديث أبي واقد أن رسول الله صلى الله عليه وسلم كان يقرأ بقاف واقتربت الساعة في الأضحى والفطر وكان يقرأ بهما في المحافل الكبار لاشتمالهما على ذكر الوعد والوعيد وبدء الخلق وإعادته والتوحيد وإثبات النبوات وغير ذلك من المقاصد العظيمة. يخبر تعالى عن اقتراب الساعة وفراغ الدنيا وانقضائها كما قال تعالى \"أتى أمر الله فلا تستعجلوه\" قال \"اقترب للناس حسابهم وهم في غفلة معرضون\" وقد وردت الأحاديث بذلك قال الحافظ أبو بكر البزار حدثنا محمد بن المثنى وعمرو بن علي قالا حدثنا خلف بن موسى حدثني أبي عن قتادة عن أنس أن رسول الله صلى الله عليه وسلم خطب أصحابه ذات يوم وقد كادت الشمس أن تغرب فلم يبق منها إلا سف يسير فقال \"والذى نفسي بيده ما بقي من الدنيا فيما مضى منها إلا كما بقي من يومكم هذا فيما مضى منه\" وما نرى من الشمس إلا يسيرا \"قلت\" هذا حديث مداره على خلف بن موسى بن خلف العمي عن أبيه وقد ذكره ابن حبان في الثقات وقال ربما أخطأ \"حديث آخر يعضد الذي قبله ويفسره\" قال الإمام أحمد حدثنا الفضل بن دكين حدثنا شريك حدثنا سلمة بن كهيل عن مجاهد عن ابن عمر قال: كنا جلوسا عند النبي صلى الله عليه وسلم والشمس على قعيقعان بعد العصر فقال \"ما أعماركم في أعمار من مضى إلا كما بقي من النهار فيما مضى\" وقال الإمام أحمد حدثنا حسين حدثنا محمد بن مطرف عن أبي حازم عن سهل ابن سعد قال: سمعت رسول الله صلى الله عليه وسلم يقول \"بعثت أنا والساعة هكذا\" وأشار بأصبعيه السبابة والوسطى. أخرجاه من حديث أبي حازم سلمة بن دينار. وقال الإمام أحمد حدثنا محمد بن عبيد أخبرنا الأعمش عن أبي خالد عن وهب السوائي قال: قال رسول الله صلى الله عليه وسلم \"بعثت أنا والساعة كهذه من هذه إن كادت لتسبقني\" وجمع الأعمش بين السبابة والوسطى وقال الإمام أحمد حدثنا أبو المغيرة حدثنا الأوزاعي حدثني إسماعيل بن عبيدالله قال قدم أنس بن مالك على الوليد بن عبدالملك فسأله ماذا سمعت من رسول الله صلى الله عليه وسلم يذكر به الساعة؟ فقال سمعت رسول الله صلى الله عليه وسلم يقول \"أنتم والساعة كهاتين\" تفرد به أحمد رحمه الله وشاهد ذلك أيضا في الصحيح في أسماء رسول الله صلى الله عليه وسلم أنه الحاشر الذي يحشر الناس على قدميه. وقال الإمام أحمد حدثنا بهز بن أسد حدثنا سليمان بن المغيرة حدثنا حميد بن هلال عن خالد بن عمير قال خطب عتبة بن غزوان قال بهز وقال قبل هذه المرة خطبنا رسول الله صلى الله عليه وسلم قال فحمد الله تعالى وأثنى عليه ثم قال \"أما بعد فإن الدنيا قد آذنت بصرم وولت حذاء ولم يبق منها إلا صبابة كصبابة الإناء يتصابها صاحبها وإنكم منتقلون منها إلى دار لا زوال لها فانتقلوا منها بخير ما بحضرتكم\" فإنه قد ذكر لنا أن الحجر يلقى من شفير جهنم فيهوي فيها سبعين عاما ما يدرك لها قعرا والله لتملؤنه أفعجبتم والله لقد ذكر لنا أن ما بين مصراعي الجنة مسيرة أربعين عاما وليأتين عليه يوم وهو كظيظ من الزحام. وذكر تمام الحديث انفرد به مسلم وقال أبو جعفر بن جرير حدثني يعقوب حدثني ابن علية أخبرنا عطاء بن السائب عن أبي عبدالرحمن السلمي قال نزلنا المدائن فكنا منها على فرسخ فجاءت الجمعة فحضر أبي وحضرت معه فخطبنا حذيفة فقال ألا إن الله يقول \"اقتربت الساعة وانشق القمر\" ألا وإن الساعة قد اقتربت ألا وإن القمر قد انشق ألا وإن الدنيا قد آذنت بفراق ألا وإن اليوم المضمار وغدا السباق فقلت لأبي أيستبق الناس غدا؟ فقال يا بني إنك لجاهل إنما هو السباق بالأعمال ثم جاءت الجمعة الأخرى فحضرنا فخطب حذيفة فقال ألا إن الله عز وجل يقول \"اقتربت الساعة وانشق اقمر\" ألا وإن الدنيا قد آذنت بفراق ألا وإن اليوم المضمار وغدا السباق ألا وإن الغاية النار والسابق من سبق إلى الجنة وقوله تعالى \"وانشق القمر\" قد كان هذا في زمان رسول الله صلى الله عليه وسلم كما ورد ذلك في الأحاديث المتواترة بالأسانيد الصحيحة. وقد ثبت في الصحيح عن ابن مسعود أنه قال \"خمس قد مضين الروم والدخان واللزام والبطشة والقمر\" وهذا أمر متفق عليه بين العلماء أي انشقاق القمر قد وقع في زمان النبي صلى الله عليه وسلم وأنه كان إحدى المعجزات الباهرات \"ذكر الأحاديث الواردة في ذلك\" \"رواية أنس بن مالك\" قال الإمام أحمد حدثنا عبد الرزاق حدثنا معمر عن قتادة عن أنس بن مالك قال سأل أهل مكة النبي صلى الله عليه وسلم آية فانشق القمر بمكة مرتين فقال \"اقتربت الساعة وانشق القمر\" ورواه مسلم عن محمد بن رافع عن عبد الرزاق وقال البخاري حدثني عبدالله بن عبد الوهاب حدثنا بشر بن المفضل حدثنا سعيد بن أبي عروبة عن قتادة عن أنس بن مالك أن أهل مكة سألوا رسول الله صلى الله عليه وسلم أن يريهم آية فأراهم القمر شقين حتى رأوا حراء بينهما. وأخرجاه أيضا من حديث يونس بن محمد المؤدب عن شيبان عن قتادة ورواه مسلم أيضا عن حديث أبي داود الطيالسي ويحيى القطان وغيرهما عن شعبة عن قتادة به \"رواية جبير بن مطعم رضي الله عنه\" قال الإمام أحمد حدثنا محمد بن كثير ثنا سليمان بن كثير عن حصين بن عبدالرحمن عن محمد بن جبير بن مطعم عن أبيه قال: انشق القمر على عهد رسول الله صلى الله عليه وسلم فصار فرقتين فرقة على هذا الجبل وفرقة على هذا الجبل فقالوا سحرنا محمد فقالوا إن كان سحرنا فإنه لا يستطيع أن يسحر الناس كلهم تفرد به الإمام أحمد من هذا الوجه وأسنده البيهقي في الدلائل من طريق محمد بن كثير عن أخيه سليمان بن كثير عن حصين بن عبدالرحمن وهكذا رواه ابن جرير من حديث محمد بن فضيل وغيره عن حصين به ورواه البيهقي أيضا من طريق إبراهيم بن طهمان وهشيم كلاهما عن حصين عن جبير بن محمد بن جبير بن مطعم عن أبيه عن جده فذكره \"رواية عبدالله بن عباس رضي الله عنهما قال البخاري حدثنا يحيى بن كثير حدثنا بكر عن جعفر عن عراك بن مالك عن عبيدالله بن عبدالله بن عتبة عن ابن عباس رضي الله عنهما قال: انشق القمر في زمان النبي صلى الله عليه وسلم. ورواه البخاري أيضا ومسلم من حديث بكر بن مضر عن جعفر بن ربيعة عن عراك به مثله. وقال ابن جرير: حدثنا ابن مثنى حدثنا عبد الأعلى حدثنا داود بن أبي هند عن علي بن أبي طلحة عن ابن عباس. قي قوله \"اقتربت الساعة وانشق القمر وإن يروا آية يعرضوا ويقولوا سحر مستمر\" قال قد مضى ذلك كان قبل الهجرة انشق القمر حتى رأوا شقيه. وروى العوفي عن ابن عباس نحو هذا وقال الطبراني حدثنا أحمد بن عمرو البزار حدثنا محمد بن يحيى القطعي حدثنا محمد بن شكر حدثنا ابن جريج عن عمرو بن دينار عن عكرمة عن ابن عباس قال كسف القمر على عهد رسول الله صلى الله عليه وسلم فقالوا سحر القمر فنزلت \"اقتربت الساعة وانشق القمر- إلى قوله - مستمر\" \"رواية عبدالله بن عمر\" قال الحافظ أبو بكر البيهقي أخبرنا أبو عبدالله الحافظ وأبو بكر أحمد بن الحسن القاضي قالا حدثنا أبو العباس الأصم حدثنا العباس بن محمد الدوري حدثنا وهب بن جرير عن شعبة عن الأعمش عن مجاهد عن عبدالله بن عمر في قوله تعالى \"اقتربت الساعة وانشق القمر\" قال وقد كان ذلك على عهد رسول الله صلى الله عليه وسلم انشق فلقتين فلقة من دون الجبل وفلقه من خلف الجبل فقال النبي صلى الله عليه وسلم \"اللهم اشهد\" وهكذا رواه مسلم والترمذي من طرق عن شعبة عن الأعمش عن مجاهد به قال مسلم كرواية مجاهد عن أبي معمر عن ابن مسعود وقال الترمذي حسن صحيح \"رواية عبدالله ابن مسعود\" قال الإمام أحمد حدثنا سفيان عن ابن أبي نجيح عن مجاهد عن أبي معمر عن ابن مسعود قال انشق القمر على عهد رسول الله صلى الله عليه وسلم شقتين حتى نظروا إليه فقال رسول الله صلى الله عليه وسلم \"اشهدوا\" وهكذا رواه البخاري ومسلم من حديث سفيان بن عيينة به وأخرجاه من حديث الأعمش عن إبراهيم عن أبي معمر عبدالله بن سخبرة عن ابن مسعود به وقال ابن جرير حدثني عيسى بن عثمان بن عيسى الرملي حدثنا عمي يحيى بن عيسى عن الأعمش عن إبراهيم عن رجل عن عبدالله قال: كنا مع رسول الله صلى الله عليه وسلم بمنى فانشق القمر فأخذت فرقة خلف الجبل فقال رسول الله صلى الله عليه وسلم \"اشهدوا اشهدوا\" قال البخاري: وقال أبو الضحى عن مسروق عن عبدالله بمكة وقال أبو داود الطيالسي حدثنا أبو عوانة عن المغيرة عن أبي الضحى عن مسروق عن عبدالله بن مسعود قال انشق القمر على عهد رسول الله صلى الله عليه وسلم فقالت قريش هذا سحر ابن أبي كبشة قال فقالوا انظروا ما يأتيكم به السفار فإن محمدا لا يستطيع أن يسحر الناس كلهم قال فجاء السفار فقالوا ذلك وقال البيهقي أخبرنا أبو عبدالله الحافظ أخبرنا أبو العباس محمد بن يعقوب حدثنا العباس بن محمد الدوري حدثنا سعيد ابن سليمان حدثنا هشام حدثنا مغيرة عن أبى الضحى عن مسروق عن عبدالله قال انشق القمر بمكة حتى صار فرقتين فقال كفار قريش أهل مكة هذا سحر سحركم به ابن أبي كبشة انظروا السفار فإن كانوا رأوا ما رأيتم فقد صدق وإن كانوا لم يروا مثل ما رأيتم فهو سحر سحركم به قال فسئل السفار قال وقدموا من كل وجهة فقالوا: رأينا. ورواه ابن جرير من حديث المغيرة به وزاد فأنزل الله عز وجل \"اقتربت الساعة وانشق القمر\". ثم قال ابن جرير حدثني يعقوب بن إبراهيم حدثنا ابن علية أخبرنا أيوب عن محمد هو ابن سيرين قال نبئت أن ابن مسعود رضي الله عنه كان يقول لقد انشق القمر. وقال ابن جرير أيضا حدثني محمد بن عمارة حدثنا عمرو بن حماد حدثنا أسباط عن سماك عن إبراهيم عن الأسود عن عبدالله قال لقد رأيت الجبل من فرج القمر حين انشق. ورواه الإمام أحمد عن مؤمل عن إسرائيل عن سماك عن إبراهيم عن الأسود عن عبدالله قال انشق القمر على عهد رسول الله صلى الله عليه وسلم حتى رأيت الجبل من بين فرجتي القمر وقال ليث عن مجاهد انشق القمر على عهد رسول الله صلى الله عليه وسلم فصار فرقتين فقال النبي صلى الله عليه وسلم لأبي بكر \"اشهد يا أبا بكر\" فقال المشركون سحر القمر حتى انشق."
    },
    { "ayah": 10, "surah": 54, "text": "أي إني ضعيف عن هؤلاء وعن مقاومتهم فانتصر أنت لدينك." },
    {
      "ayah": 11,
      "surah": 54,
      "text": "قال السدي وهو الكثير قال ابن جريج عن ابن عباس \"ففتحنا أبواب السماء بماء منهمر\" كثير لم تمطر السماء قبل ذلك اليوم ولا بعده إلا من السحاب فتحت أبواب السماء بالماء من غير سحاب ذلك اليوم فالتقى الماآن على أمر قد قدر وروى ابن أبي حاتم أن ابن الكواء سأل عليا عن المجرة فقال هي شرج السماء ومنها فتحت السماء بماء منهمر."
    },
    {
      "ayah": 12,
      "surah": 54,
      "text": "أي نبعت جميع أرجاء الأرض حتى التنانير التي هي محال النيران نبعت عيونا \"فالتقى الماء\" أي من السماء والأرض \"على أمر قد قدر\" أى أمر مقدر."
    },
    {
      "ayah": 13,
      "surah": 54,
      "text": "قال ابن عباس وسعيد بن جبير والقرظي وقتادة وابن زيد هي المسامير واختاره ابن جرير قال وواحدها دسار ويقال دسير كما يقال حبيك وحباك والجمع حبك وقال مجاهد الدسر أضلاع السفينة وقال عكرمة والحسن هو صدرها الذي يضرب به الموج وقال الضحاك الدسر طرفاها وأصلها وقال العوفي عن ابن عباس هو كلكلها أي صدرها."
    },
    {
      "ayah": 14,
      "surah": 54,
      "text": "أي بأمرنا بمرأى منا وتحت حفظنا وكلاءتنا \"جزاء لمن كان كفر\" أي جزاء لهم. على كفرهم بالله وانتصارا لنوح عليه السلام."
    },
    {
      "ayah": 15,
      "surah": 54,
      "text": "قال قتادة أبقى الله سفينة نوح حتى أدركها أول هذه الأمة والظاهر أن المراد من ذلك جنس السفن كقوله تعالى \"وآية لهم أنا حملنا ذريتهم في الفلك المشحون وخلقنا لهم من مثله ما يركبون\" وقال تعالى \"إنا لما طغى الماء حملناكم في الجارية لنجعلها لكم تذكرة وتعيها أذن واعية\" ولهذا قال ههنا \"فهل من مدكر\" أي فهل من يتذكر ويتعظ. قال الإمام أحمد حدثنا حجاج حدثنا إسرائيل عن أبي إسحاق عن الأسود عن ابن مسعود قال أقرأني رسول الله صلى الله عليه وسلم \"فهل من مدكر\" وهكذا رواه البخاري حدثنا يحيى حدثنا وكيع عن إسرائيل عن أبي إسحاق عن الأسود بن يزيد عن عبدالله قال قرأت على النبي صلى الله عليه وسلم \"فهل من مدكر\" وقال النبي صلى الله عليه وسلم \"فهل من مدكر\" وروى البخاري أيضا من حديث شعبة عن أبي إسحاق عن الأسود عن عبدالله قال: كان رسول الله صلى الله عليه وسلم يقرأ \"فهل من مدكر\" وقال حدثنا أبو نعيم حدثنا زهير عن أبي إسحاق أنه سمع رجلا سأل الأسود فهل من مذكر أو مدكر قال سمعت عبدالله يقرأ \"فهل من مدكر\" وقال سمعت رسول الله صلى الله عليه وسلم يقرؤها \"فهل من مدكر\"- دالا - وقد أخرج مسلم هذا الحديث وأهل السنن إلا ابن ماجة من حديث أبي إسحاق."
    },
    {
      "ayah": 16,
      "surah": 54,
      "text": "أي كيف كان عذابي لمن كفر بي وكذب رسلي ولم يتعظ بما جاءت به نذري وكيف انتصرت لهم وأخذت لهم بالثأر."
    },
    {
      "ayah": 17,
      "surah": 54,
      "text": "أي سهلنا لفظه ويسرنا معناه لمن أراده ليتذكر الناس كما قال \"كتاب أنزلناه إليك مبارك ليدبروا آياته وليتذكر أولوا الألباب\" وقال تعالى \"فإنما يسرناه بلسانك لتبشر به المتقين وتنذر به قوما لدا\". قال مجاهد \"ولقد يسرنا القرآن للذكر\" يعني هونا قراءته وقال السدي يسرنا تلاوته على الألسن وقال الضحاك عن ابن عباس لولا أن الله يسره على لسان الآدميين ما استطاع أحد من الخلق أن يتكلم بكلام الله عز وجل قلت ومن تيسيره تعالى على الناس تلاوة القرآن ما تقدم عن النبي صلى الله عليه وسلم أنه قال \"إن هذا القرآن أنزل على سبعة أحرف\" وأوردنا الحديث بطرقه وألفاظه بما أغنى عن إعادته ههنا ولله الحمد والمنة وقوله \"فهل من مدكر\" أي فهل من متذكر بهذا القرآن الذي قد يسر الله حفظه ومعناه؟ وقال محمد بن كعب القرظي فهل من منزجر عن المعاصي؟ وقال ابن أبي حاتم حدثنا أبي حدثنا الحسن بن رافع حدثنا ضمرة عن ابن شوذب عن مطر هو الوراق في قوله تعالى \"فهل من مدكر\" هل من طالب علم فيعان عليه وكذا علقه البخاري بصيغة الجزم عن مطر الوراق ورواه ابن جرير وروى عن قتادة مثله."
    },
    { "ayah": 18, "surah": 54, "text": "يقول تعالى مخبرا عن عاد قوم هود إنهم كذبوا رسولهم أيضا كما صنع قوم نوح." },
    {
      "ayah": 19,
      "surah": 54,
      "text": "وأنه تعالى أرسل \"عليهم ريحا صرصرا \" وهي الباردة الشديدة البرد \"فى يوم نحس\" أي عليهم قاله الضحاك وقتادة والسدي \"مستمر\" عليهم نحسه ودماره لأنه يوم اتصل فيه عذابهم الدنيوي بالأخروي."
    },
    {
      "ayah": 2,
      "surah": 54,
      "text": "أي دليلا وحجة وبرهانا \"يعرضوا\" أي لا ينقادوا له بل يعرضون عنه ويتركونه وراء ظهورهم \"ويقولوا سحر مستمر\" أي ويقولون هذا الذي شاهدناه من الحجج سحر سحرنا به ومعنى \"مستمر\" أي ذاهب قاله مجاهد وقتادة وغيرهما أي باطل مضمحل لا دوام له."
    },
    {
      "ayah": 20,
      "surah": 54,
      "text": "وذلك أن الريح كانت تأتي أحدهم فترفعه حتى تغيبه على أم رأسه فيسقط إلى الأرض فتثلغ رأسه فيبقى جثة بلا رأس ولهذا قال \" كأنهم أعجاز نخل فكيف كان عذابي ونذر ولقد يسرنا القرآن للذكر فهل من مدكر\"."
    },
    { "ayah": 21, "surah": 54, "text": "أي فعاقبتهم فكيف كان عقابي لهم على كفرهم بي وتكذيبهم رسولي." },
    {
      "ayah": 22,
      "surah": 54,
      "text": "أي سهلنا لفظه ويسرنا معناه لمن أراده ليتذكر الناس كما قال \"كتاب أنزلناه إليك مبارك ليدبروا آياته وليتذكر أولوا الألباب\" وقال تعالى \"فإنما يسرناه بلسانك لتبشر به المتقين وتنذر به قوما لدا\". قال مجاهد \"ولقد يسرنا القرآن للذكر\" يعني هونا قراءته وقال السدي يسرنا تلاوته على الألسن وقال الضحاك عن ابن عباس لولا أن الله يسره على لسان الآدميين ما استطاع أحد من الخلق أن يتكلم بكلام الله عز وجل قلت ومن تيسيره تعالى على الناس تلاوة القرآن ما تقدم عن النبي صلى الله عليه وسلم أنه قال \"إن هذا القرآن أنزل على سبعة أحرف\" وأوردنا الحديث بطرقه وألفاظه بما أغنى عن إعادته ههنا ولله الحمد والمنة وقوله \"فهل من مدكر\" أي فهل من متذكر بهذا القرآن الذي قد يسر الله حفظه ومعناه؟ وقال محمد بن كعب القرظي فهل من منزجر عن المعاصي؟ وقال ابن أبي حاتم حدثنا أبي حدثنا الحسن بن رافع حدثنا ضمرة عن ابن شوذب عن مطر هو الوراق في قوله تعالى \"فهل من مدكر\" هل من طالب علم فيعان عليه وكذا علقه البخاري بصيغة الجزم عن مطر الوراق ورواه ابن جرير وروى عن قتادة مثله."
    },
    { "ayah": 23, "surah": 54, "text": "هذا إخبار عن ثمود أنهم كذبوا رسولهم صالحا." },
    { "ayah": 24, "surah": 54, "text": "يقولون لقد خبنا وخسرنا إن سلمنا كلنا قيادنا لواحد منا." },
    {
      "ayah": 25,
      "surah": 54,
      "text": "ثم تعجبوا من إلقاء الوحي عليه خاصة من دونهم ثم رموه بالكذب فقالوا \"بل هو كذاب أشر\" أي متجاوز في حد الكذب."
    },
    { "ayah": 26, "surah": 54, "text": "هذا تهديد لهم شديد ووعيد أكيد." },
    {
      "ayah": 27,
      "surah": 54,
      "text": "قال تعالى \"إنا مرسلوا الناقة فتنة لهم\" أي اختبارا لهم أخرج الله تعالى لهم ناقة عظيمة عشراء من صخرة صماء طبق ما سألوا لتكون حجة الله عليهم في تصديق صالح عليه السلام فيما جاءهم به ثم قال تعالى آمرا لعبده ورسوله صالح \"فارتقبهم واصطبر\" أي انتظر ما يؤول إليه أمرهم واصبر عليهم فإن العاقبة لك والنصر في الدنيا والآخرة."
    },
    {
      "ayah": 28,
      "surah": 54,
      "text": "أي يوم لهم ويوم للناقة كقوله \"قال هذه ناقة لها شرب ولكم شرب يوم معلوم\" وقوله تعالى \"كل شرب محتضر\" قال مجاهد إذا غابت حضروا الماء وإذا جاءت حضروا اللبن."
    },
    {
      "ayah": 29,
      "surah": 54,
      "text": "قال المفسرون هو عاقر الناقة واسمه قدار بن سالف وكان أسقى قومه كقوله \"إذ انبعث أشقاها\" \"فتعاطى\" أي حسر."
    },
    {
      "ayah": 3,
      "surah": 54,
      "text": "أي كذبوا بالحق إذ جاءهم واتبعوا ما أمرتهم به آراؤهم وأهواؤهم من جهلهم وسخافة عقلهم وقوله \"وكل أمر مستقر\" قال قتادة معناه أن الخير واقع بأهل الخير والشر واقع بأهل الشر وقال ابن جريج مستقر بأهله وقال مجاهد \"وكل أمر مستقر\" أي يوم القيامة وقال السدي مستقر أي واقع."
    },
    { "ayah": 30, "surah": 54, "text": "أي فعاقبتهم فكيف كان عقابي لهم على كفرهم بي وتكذيبهم رسولي." },
    {
      "ayah": 31,
      "surah": 54,
      "text": "أي فبادوا عن آخرهم لم تبق منهم باقية وخمدوا وهمدوا كما يهمد يبيس الزرع والنبات قاله غير واحد من المفسرين والمحتظر قال السدي هو المرعى بالصحراء حين يبيس ويحترق وتسفيه الريح وقال ابن زيد كانت العرب يجعلون حظارا على الإبل والمواشي من يبيس الشوك فهو المراد من قوله \"كهشيم المحتظر\" وقال سعيد بن جبير هشيم المحتظر هوالتراب المتناثر من الحائط وهذا قول غريب والأول أقوى والله أعلم."
    },
    {
      "ayah": 32,
      "surah": 54,
      "text": "أي سهلنا لفظه ويسرنا معناه لمن أراده ليتذكر الناس كما قال \"كتاب أنزلناه إليك مبارك ليدبروا آياته وليتذكر أولوا الألباب\" وقال تعالى \"فإنما يسرناه بلسانك لتبشر به المتقين وتنذر به قوما لدا\". قال مجاهد \"ولقد يسرنا القرآن للذكر\" يعني هونا قراءته وقال السدي يسرنا تلاوته على الألسن وقال الضحاك عن ابن عباس لولا أن الله يسره على لسان الآدميين ما استطاع أحد من الخلق أن يتكلم بكلام الله عز وجل قلت ومن تيسيره تعالى على الناس تلاوة القرآن ما تقدم عن النبي صلى الله عليه وسلم أنه قال \"إن هذا القرآن أنزل على سبعة أحرف\" وأوردنا الحديث بطرقه وألفاظه بما أغنى عن إعادته ههنا ولله الحمد والمنة وقوله \"فهل من مدكر\" أي فهل من متذكر بهذا القرآن الذي قد يسر الله حفظه ومعناه؟ وقال محمد بن كعب القرظي فهل من منزجر عن المعاصي؟ وقال ابن أبي حاتم حدثنا أبي حدثنا الحسن بن رافع حدثنا ضمرة عن ابن شوذب عن مطر هو الوراق في قوله تعالى \"فهل من مدكر\" هل من طالب علم فيعان عليه وكذا علقه البخاري بصيغة الجزم عن مطر الوراق ورواه ابن جرير وروى عن قتادة مثله."
    },
    {
      "ayah": 33,
      "surah": 54,
      "text": "يقول تعالى مخبرا عن قوم لوط كيف كذبوا رسولهم وخالفوه وارتكبوا المكروه من إتيان الذكور وهي الفاحشة التي لم يسبقهم بها أحد من العالمين ولهذا أهلكهم الله هلاكا لم يهلكه أمة من الأمم فإنه تعالى أمر جبريل بحمل مدائنهم حتى وصل بها إلى عنان السماء ثم قلبها عليها وأرسلها وأتبعت بحجارة من سجيل منضود."
    },
    {
      "ayah": 34,
      "surah": 54,
      "text": "\"إنا أرسلنا عليهم حاصبا\" وهي الحجارة \"إلا آل لوط نجيناهم بسحر\" أي خرجوا من آخر الليل فنجوا مما أصاب قومهم ولم يؤمن بلوط من قومه أحد ولا رجل واحد حتى ولا امرأته أصابها ما أصاب قومها وخرج نبي الله لوط وبنات له من بين أظهرهم سالما لم يمسسه سوء."
    },
    { "ayah": 35, "surah": 54, "text": "لا يوجد تفسير لهذه الأية" },
    {
      "ayah": 36,
      "surah": 54,
      "text": "أي ولقد كان قبل حلول العذاب بهم قد أنذرهم بأس الله وعذابه فما التفتوا إلى ذلك ولا أصغوا إليه بل شكوا فيه وتماروا به."
    },
    {
      "ayah": 37,
      "surah": 54,
      "text": "ذلك ليلة ورد عليه الملائكة جبريل وميكائيل وإسرافيل فى صور شباب مرد حسان محنة من الله بهم فأضافهم لوط \"وبعثت امرأته العجوز السوء إلى قومها فأعلمتهم بأضياف لوط فأقبلوا يهرعون إليه من كل مكان فأغلق لوط دونهم الباب فجعلوا يحاولون كسر الباب وذلك عشية ولوط عليه السلام يدافعهم ويمانعهم دون أضيافه ويقول لهم \"هؤلاء بناتي\" يعني نساءهم \"إن كنتم فاعلين قالوا لقد علمت ما لنا في بناتك من حق\" أي ليس لنا فيهن أرب \"وإنك لتعلم ما نريد\" فلما اشتد الحال وأبوا إلا الدخول خرج عليهم جبريل عليه السلام فضرب أعينهم بطرف جناحه فانطمست أعينهم يقال إنها غارت من وجوههم وقيل إنه لم تبق لهم عيون بالكلية."
    },
    { "ayah": 38, "surah": 54, "text": "فرجعوا على أدبارهم يتحبسون بالحيطان ويتوعدون لوطا \"عليه السلام إلى الصباح." },
    {
      "ayah": 39,
      "surah": 54,
      "text": "أي سهلنا لفظه ويسرنا معناه لمن أراده ليتذكر الناس كما قال \"كتاب أنزلناه إليك مبارك ليدبروا آياته وليتذكر أولوا الألباب\" وقال تعالى \"فإنما يسرناه بلسانك لتبشر به المتقين وتنذر به قوما لدا\". قال مجاهد \"ولقد يسرنا القرآن للذكر\" يعني هونا قراءته وقال السدي يسرنا تلاوته على الألسن وقال الضحاك عن ابن عباس لولا أن الله يسره على لسان الآدميين ما استطاع أحد من الخلق أن يتكلم بكلام الله عز وجل قلت ومن تيسيره تعالى على الناس تلاوة القرآن ما تقدم عن النبي صلى الله عليه وسلم أنه قال \"إن هذا القرآن أنزل على سبعة أحرف\" وأوردنا الحديث بطرقه وألفاظه بما أغنى عن إعادته ههنا ولله الحمد والمنة وقوله \"فهل من مدكر\" أي فهل من متذكر بهذا القرآن الذي قد يسر الله حفظه ومعناه؟ وقال محمد بن كعب القرظي فهل من منزجر عن المعاصي؟ وقال ابن أبي حاتم حدثنا أبي حدثنا الحسن بن رافع حدثنا ضمرة عن ابن شوذب عن مطر هو الوراق في قوله تعالى \"فهل من مدكر\" هل من طالب علم فيعان عليه وكذا علقه البخاري بصيغة الجزم عن مطر الوراق ورواه ابن جرير وروى عن قتادة مثله."
    },
    {
      "ayah": 4,
      "surah": 54,
      "text": "أي من الأخبار عن قصص الأمم المكذبين بالرسل وما حل بهم من العقاب والنكال والعذاب مما يتلى عليهم في هذا القرآن \"ما فيه مزدجر\" أي ما فيه واعظ لهم عن الشرك والتمادي على التكذيب."
    },
    {
      "ayah": 40,
      "surah": 54,
      "text": "يقول تعالى مخبرا عن فرعون وقومه إنهم جاءهم رسول الله موسى وأخوه هارون بالبشارة إن آمنوا والنذارة إن كفروا."
    },
    {
      "ayah": 41,
      "surah": 54,
      "text": "وأيدهما بمعجزات عظيمة وآيات متعددة فكذبوا بها كلها فأخذهم الله أخذ عزيز مقتدر أي فأبادهم الله ولم يبق منهم مخبر ولا عين ولا أثر."
    },
    {
      "ayah": 42,
      "surah": 54,
      "text": "وأيدهما بمعجزات عظيمة وآيات متعددة فكذبوا بها كلها فأخذهم الله أخذ عزيز مقتدر أي فأبادهم الله ولم يبق منهم مخبر ولا عين ولا أثر."
    },
    {
      "ayah": 43,
      "surah": 54,
      "text": "ثم قال تعالى \"أكفاركم\" أي أيها المشركون من كفار قريش \"خير من أولئكم\" يعني من الذين تقدم ذكرهم ممن أهلكوا بسبب تكذيبهم الرسل وكفرهم بالكتب أأنتم خير من أولئكم؟ \"أم لكم براءة في الزبر\" أي أم معكم من الله براءة أن لا ينالكم عذاب ولا نكال؟."
    },
    { "ayah": 44, "surah": 54, "text": "أي يعتقدون أنهم يتناصرون بعضهم بعضا وأن جمعهم يغني عنهم من أرادهم بسوء." },
    {
      "ayah": 45,
      "surah": 54,
      "text": "أي سيتفرق شملهم ويغلبون. قال البخاري حدثنا إسحاق حدثنا خالد عن خالد وقال أيضا حدثنا محمد بن عفان عن وهيب عن خالد عن عكرمة عن ابن عباس أن النبي صلى الله عليه وسلم قال وهو في قبة له يوم بدر \"أنشدك عهدك ووعدك اللهم إن شئت لم تعبد بعد اليوم فى الأرض أبدا \" فأخذ أبو بكر رضي الله عنه بيده وقال حسبك يا رسول الله ألححت على ربك فخرج وهو يثب في الدرع وهو يقول \"سيهزم الجمع ويولون الدبر بل الساعة موعدهم والساعة أدهى وأمر\" وكذا رواه البخاري والنسائي في غير موضع من حديث خالد وهو ابن مهران الحذاء به. وقال ابن أبي حاتم حدثنا أبي حدثنا أبو الربيع الزهراني حدثنا حماد عن أيوب عن عكرمة قال لما نزلت \"سيهزم الجمع ويولون الدبر\" قال عمر أي جمع يهزم؟ أي جمع يغلب؟ قال عمر فلما كان يوم بدر رأيت رسول الله صلى الله عليه وسلم يثب في الدرع وهو يقول \"سيهزم الجمع ويولون الدبر\" فعرفت تأويلها يومئذ."
    },
    {
      "ayah": 46,
      "surah": 54,
      "text": "وقال البخاري حدثنا إبراهيم بن موسى حدثنا هشام بن يوسف أن ابن جريج أخبرهم أخبرني يوسف بن ماهك قال إني عند عائشة أم المؤمنين فقالت نزل على محمد صلى الله عليه وسلم بمكة وإني لجارية ألعب \"بل الساعة موعدهم والساعة أدهى وأمر\" هكذا رواه ههنا مختصرا. ورواه في فضائل القرآن مطولا ولم يخرجه مسلم."
    },
    {
      "ayah": 47,
      "surah": 54,
      "text": "يخبرنا تعالى عن المجرمين أنهم في ضلال عن الحق وسعر مما هم فيه من الشكوك والاضطراب في الآراء وهذا يشمل كل من اتصف بذلك من كافر ومبتدع من سائر الفرق."
    },
    {
      "ayah": 48,
      "surah": 54,
      "text": "أي كما كانوا في سعر وشك وتردد أورثهم ذلك النار وكما كانوا ضلالا يسحبون فيها على وجوههم لا يدرون أين يذهبون ويقال لهم تقريعا وتوبيخا \"ذوقوا مس سقر\"."
    },
    {
      "ayah": 49,
      "surah": 54,
      "text": "وقوله تعالى \"إنا كل شيء خلقناه بقدر\" كقوله \"وخلق كل شيء فقدره تقديرا\" وكقوله تعالى \"سبح اسم ربك الأعلى الذي خلق فسوى والذي قدر فهدى\" أي قدر قدرا وهدى الخلائق إليه ولهذا يستدل بهذه الآية الكريمة أئمة السنة على إثبات قدر الله السابق لخلقه وهو علمه الأشياء قبل كونها وكتابته لها قبل برئها وردوا بهذه الآية وبما شاكلها من الآيات وما ورد في معناها من الأحاديث الثابتات على الفرقة القدرية الذين نبغوا في أواخر عصر الصحابة وقد تكلمنا على هذا المقام مفصلا وما ورد فيه من الأحاديث في شرح كتاب الإيمان من صحيح البخاري رحمه الله ولنذكر ههنا الأحاديث المتعلقة بهذه الآية الكريمة. قال أحمد حدثنا وكيع حدثنا سفيان الثوري عن زياد بن إسماعيل السهمي عن محمد بن عباد بن جعفر عن أبي هريرة قال: جاء مشركوا قريش إلى النبي صلى الله عليه وسلم يخاصمونه في القدر فنزلت \"يوم يسحبون في النار على وجوههم ذوقوا مس سقر إنا كل شيء خلقناه بقدر\" وهكذا رواه مسلم والترمذي وابن ماجة من حديث وكيع عن سفيان الثوري به. وقال البزار حدثنا عمرو بن على حدثنا الضحاك بن مخلد حدثنا يونس بن الحارث عن عمرو بن شعيب عن أبيه عن جده قال ما نزلت هذه الآيات \"إن المجرمين في ضلال وسعر يوم يسحبون في النار على وجوههم ذوقوا مس سقر إنا كل شيء خلقناه بقدر\" إلا في أهل القدر. وقال ابن أبي حاتم حدثنا أبي حدثنا سهل بن صالح الأنطاكي حدثني قرة بن حييب عن كنانة حدثني جرير بن حازم عن سعيد بن عمرو بن جعدة عن ابن زرارة عن أبيه عن النبي صلى الله عليه وسلم أنه تلا هذه الآية \"ذوقوا مس سقر إنا كل شيء خلقناه بقدر\" قال \"نزلت في أناس من أمتي يكونون في آخر الزمان يكذبون بقدر الله\". وحدثنا الحسن بن عرفة حدثنا مروان بن شجاع الجزري عن عبدالملك بن جريج عن عطاء بن أبي رباح قال: أتيت ابن عباس وهو ينزع من زمزم وقد ابتلت أسافل ثيابه فقلت له قد تكلم في القدر فقال أو قد فعلوها؟ قلت نعم قال فوالله ما نزلت هذه الآية إلا فيهم \"ذوقوا مس سقر إنا كل شيء خلقناه بقدر\" أولئك شرار هذه الأمة فلا تعودوا مرضاهم ولا تصلوا على موتاهم إن رأيت أحدا منهم فقأت عينيه بأصبعي هاتين. وقد رواه الإمام أحمد من وجه آخر وفيه مرفوع فقال حدثنا أبو المغيرة حدثنا الأوزاعي عن بعض إخوته عن محمد بن عبيد المكي عن عبدالله بن عباس قال قيل له إن رجلا قدم علينا يكذب بالقدر فقال دلوني عليه وهو أعمى قالوا وما تصنع به يا أبا عباس؟ قال والذي نفسي بيده لئن استمكنت منه لأعضن أنفه حتى أقطعه ولئن وقعت رقبته في يدي لأدقنها فإني سمعت رسول الله صلى الله عليه وسلم يقول \"كأني بنساء بني فهر يطفن بالخزرج تصطفق إلياتهن مشركات هذا أول شرك هذه الأمة والذي نفسي بيده لينتهين بهم سوء رأيهم حتى يخرجوا الله من أن يكون قدر خيرا كما أخرجوه من أن يكون قدر شرا\" ثم رواه أحمد عن أبي المغيرة عن الأوزاعي عن العلاء بن الحجاج عن محمد بن عبيد فذكر مثله لم يخرجوه. وقال الإمام أحمد حدثنا عبدالله بن يزيد حدثنا سعيد عن أبي أيوب حدثني أبو صخر عن نافع قال: كان لابن عمر صديق من أهل الشام يكاتبه فكتب إليه عبدالله بن عمر إنه بلغني أنك تكلمت في شيء من القدر فإياك أن تكتب إلي فإني سمعت رسول الله صلى الله عليه وسلم يقول \"سيكون في أمتي أقوام يكذبون بالقدر\" ورواه أبو داود عن أحمد بن حنبل به. وقال أحمد حدثنا أنس بن عياض حدثنا عمر بن عبدالله مولى غفرة عن عبدالله بن عمر أن رسول الله صلى الله عليه وسلم قال \"لكل أمة مجوس ومجوس أمتي الذين يقولون لا قدر إن مرضوا فلا تعودوهم وإن ماتوا فلا تشهدوهم\" لم يخرجه أحد من أصحاب الكتب الستة من هذا الوجه وقال أحمد حدثنا قتيبة حدثنا رشدين عن أبي صخر حميد بن زياد عن نافع عن ابن عمر قال: سمعت رسول الله صلى الله عليه وسلم يقول \"سيكون في هذه الأمة مسخ ألا وذاك في المكذبين بالقدر والزندقية\" ورواه الترمذي وابن ماجة من حديث أبي صخر حميد بن زياد به وقال الترمذي حسن صحيح غريب. وقال الإمام أحمد حدثنا إسحاق بن الطباع أخبرني مالك عن زياد بن سعد عن عمرو بن مسلم عن طاوس اليماني قال سمعت ابن عمر قال: قال رسول الله صلى الله عليه وسلم \"كل شيء بقدر حتى العجز والكيس\" ورواه مسلم منفردا به من حديث مالك. وفي الحديث الصحيح \"استعن بالله ولا تعجز فإن أصابك أمر فقل قدر الله وما شاء فعل ولا تقل لو إني فعلت لكان كذا فإن لو تفتح عمل الشيطان\". وفي حديث ابن عباس أن رسول الله صلى الله عليه وسلم قال له \"واعلم أن الأمة لو اجتمعوا على أن ينفعوك بشيء لم يكتبه الله لك لم ينفعوك ولو اجتمعوا على أن يضروك بشيء لم يكتبه الله عليك لم يضروك جفت الأقلام وطويت الصحف\" وقال الإمام أحمد حدثنا الحسن بن سوار حدثنا الليث عن معاوية عن أيوب بن زياد حدثني عبادة بن الوليد بن عبادة حدثنى أبي قال دخلت على عبدة وهو مريض أتخايل فيه الموت فقلت يا أبتاه أوصني واجتهد لي فقال أجلسوني فلما أجلسوه قال يا بني إنك لما تطعم الإيمان ولم تبلغ حق حقيقة العلم بالله حتى تؤمن بالقدر خيره وشره قلت يا أبتاه وكيف لي أن أعلم ما خير القدر وشره؟ قال تعلم أن ما أخطأك لم يكن ليصيبك وما أصابك لم يكن ليخطئك يا بني إني سمعت رسول الله صلى الله عليه وسلم يقول \"إن أول ما خلق الله القلم ثم قال له اكتب فجرى في تلك الساعة بما هو كائن إلى يوم القيامة\" يا بني إن مت ولست على ذلك دخلت النار. ورواه الترمذي عن يحيى بن موسى البلخي عن أبي داود الطيالسي عن عبد الواحد بن سليم عن عطاء بن أبي رباح عن الوليد بن عبادة عن أبيه به وقال حسن صحيح غريب. وقال سفيان الثوري عن منصور عن ربعي بن خراش عن رجل عن علي بن أبي طالب قال: قال رسول الله صلى الله عليه وسلم \"لا يؤمن أحد حتى يؤمن بأربع: يشهد أن لا إله إلا الله وأني رسول الله بعثني بالحق ويؤمن بالبعث بعد الموت ويؤمن بالقدر خيره وشره\". وكذا رواه الترمذي من حديث النضر بن شميل عن شعبة عن منصور به ورواه من حديث أبي داود الطيالسي عن شعبة عن منصور عن ربعي عن علي فذكره وقال هذا عندي أصح وكذا رواه ابن ماجة من حديث شريك عن منصور عن ربعي عن علي به وقد ثبت في صحيح مسلم من رواية عبدالله بن وهب وغيره عن أبي هانئ الخولاني عن أبي عبدالرحمن الحبلي عن عبدالله بن عبد عمرو قال: قال رسول الله صلى الله عليه وسلم \"إن الله كتب مقادير الخلق قبل أن يخلق السموات والأرض بخمسين ألف سنة\" زاد ابن وهب \"وكان عرشه على الماء\" ورواه الترمذي وقال حسن صحيح غريب."
    },
    {
      "ayah": 5,
      "surah": 54,
      "text": "أي في هدايته تعالى لمن هداه وإضلاله لمن أضله \"فما تغني النذر\" يعني أي شيء تغني النذر عمن كتب الله عليه الشقاوة وختم على قلبه؟ فمن الذي يهديه من بعد الله؟ وهذه الآية كقوله تعالى \"قل فالله الحجة البالغة فلو شاء لهداكم أجمعين\" وكذا قوله تعالى\" وما تغني الآيات والنذر عن قوم لا يؤمنون\"."
    },
    {
      "ayah": 50,
      "surah": 54,
      "text": "وهو إخبار عن نفوذ مشيئته في خلقه كما أخبر بنفوذ قدره فيهم فقال \"وما أمرنا إلا واحدة\" إنما نأمر بالشيء مرة واحدة لا نحتاج إلى تأكيد بثانية فيكون ذلك الذي نأمر به حاصلا موجودا كلمح البصر لا يتأخر طرفة عين وما أحسن ما قال بعض الشعراء: إذا ما أراد الله أمرا فإنما يقول له كن قولة فيكون"
    },
    {
      "ayah": 51,
      "surah": 54,
      "text": "يعني أمثالكم وسلفكم من الأمم السابقة المكذبين بالرسل \"فهل من مدكر\" أي فهل من متعظ بما أخزى الله أولئك وقدر لهم من العذاب كما قال تعالى \"وحيل بينهم وبين ما يشتهون كما فعل بأشياعهم من قبل\"."
    },
    { "ayah": 52, "surah": 54, "text": "أي مكتوب عليهم في الكتب التي بأيدي الملائكة عليهم السلام." },
    {
      "ayah": 53,
      "surah": 54,
      "text": "أي من أعمالهم \"مستطر\" أي مجموع عليهم ومسطر في صحائفهم لا يغادر صغيرة ولا كبيرة إلا احصاها. وقد قال الإمام أحمد حدثنا أبو عامر حدثنا سعيد بن مسلم ابن بانك سمعت عامر بن عبدالله بن الزبير حدثني عوف بن الحارث وهو ابن أخي عائشة لأمها عن عائشة أن رسول الله صلى الله عليه وسلم كان يقول \"يا عائشة إياك ومحقرات الذنوب فإن لها من الله طالبا\". ورواه النسائي وابن ماجه من طريق سعيد بن مسلم بن ماهك المدني وثقه أحمد وابن معين وأبو حاتم وغيرهم. وقد رواه الحافظ ابن عساكر في ترجمة سعيد بن مسلم هذا من وجه آخر ثم قال سعيد فحدثت بهذا الحديث عامر بن هشام فقال لي ويحك يا سعيد بن مسلم لقد حدثني سليمان بن المغيرة أنه عمل ذنبا فاستصغره فأتاه آت في منامه فقال له يا سليمان: لا تحقرن من الذنوب صغيرا إن الصغير غدا يعود كبيرا إن الصغير ولو تقادم عهده عند الإله مسطرا تسطيرا فازجر هواك عن البطالة لا تكن صعب القياد وشمرن تشميرا إن المحب إذا أحب إلهه طار الفؤاد وألهم التفكيرا فاسأل هدايتك الإله بنية فكفى بربـك هاديا ونصيرا"
    },
    {
      "ayah": 54,
      "surah": 54,
      "text": "أي بعكس ما الأشقياء فيه من الضلال والسعر والسحب في النار على وجوههم مع التوبيخ والتقريع والتهديد."
    },
    {
      "ayah": 55,
      "surah": 54,
      "text": "أي في دار كرامة الله ورضوانه وفضله وامتنانه وجوده وإحسانه \"عند مليك مقتدر\" أي عند الملك العظيم الخالق للأشياء كلها ومقدرها وهو مقتدر على ما يشاء مما يطلبون ويريدون. وقد قال الإمام أحمد حدثنا سفيان عن عمرو بن دينار عن عمرو بن أوس عن عبدالله بن عمرو يبلغ به النبي صلى الله عليه وسلم قال \"المقسطون عند الله على منابر من نور عن يمين الرحمن وكلتا يديه يمين الذين يعدلون في حكمهم وأهليهم وما ولوا\" انفرد بإخراجه مسلم والنسائي من حديث سفيان بن عيينه بإسناده مثله. آخر تفسير سورة اقتربت ولله الحمد والمنة وبه التوفيق والعصمة."
    },
    {
      "ayah": 6,
      "surah": 54,
      "text": "يقول تعالى فتول يا محمد عن هؤلاء الذين إذا رأوا آية يعرضوا ويقولوا هذا سحر مستمر أعرض عنهم وانتظرهم \"يوم يدع الداع إلى شيء نكر\" أي إلى شيء منكر فظيع وهو موقف الحساب وما فيه من البلاء والزلازل والأهوال."
    },
    {
      "ayah": 7,
      "surah": 54,
      "text": "\"خشعا أبصارهم\" أى ذليلة أبصارهم \"يخرجون من الأجداث\" وهي القبور \"كأنهم جراد منتشر\" أي كأنهم فى انتشارهم وسرعة سيرهم إلى موقف الحساب إجابة للداعي جراد منتشر في الآفاق."
    },
    {
      "ayah": 8,
      "surah": 54,
      "text": "أي مسرعين \"إلى الداعي\" لا يخالفون ولا يتأخرون \"يقول الكافرون هذا يوم عسر\" أي يوم شديد الهول عبوس قمطرير \"فذلك يوم عسير على الكافرين غير يسير\"."
    },
    {
      "ayah": 9,
      "surah": 54,
      "text": "يقول تعالى \"كذبت\" قبل قومك يا محمد \"قوم نوح فكذبوا عبدنا\" أي صرحوا له بالتكذيب واتهموه بالجنون \"وقالوا مجنون وازدجر\" قال مجاهد وازدجر أي استطير جنونا وقيل وازدجر أي انتهروه وزجروه وتواعدوه لئن لم تنته يا نوح لتكونن من المرجومين قاله ابن زيد وهذا متوجه حسن."
    }
  ]
}
