{
  "ayahs": [
    {
      "ayah": 1,
      "surah": 55,
      "text": "سورة الرحمن: قال الإمام أحمد حدثنا عفان حدثنا حماد عن عاصم عن زر أن رجلا قال كيف تعرف هذا الحرف من ماء غير آسن أو أسن؟ فقال كل القرآن قد قرأت قال إني لأقرأ المفصل في ركعة واحدة فقال أهذا كهذا الشعر لا أبالك؟ قد علمت قرائن النبي صلى الله عليه وسلم التي كان يقرن قرينتين قرينتين من أول المفصل وكان أول مفصل ابن مسعود \"الرحمن\" وقال أبو عيسى الترمذي: حدثنا عبدالرحمن بن واقد وأبو مسلم السعدي حدثنا الوليد بن مسلم عن زهير بن محمد عن محمد بن المنكدر عن جابر قال خرج رسول الله صلى الله عليه وسلم على أصحابه فقرأ عليهم سورة الرحمن من أولها إلى آخرها فسكتوا فقال \"لقد قرأتها على الجن ليلة الجن فكانوا أحسن مردودا منكم كنت كلما أتيت على قوله \"فبأي آلاء ربكما تكذبان\" قالوا لا بشيء من نعمك ربنا نكذب فلك الحمد\" ثم قال هذا حديث غريب لا نعرفه إلا من حديث الوليد بن مسلم عن زهير بن محمد ثم حكى عن الإمام أحمد أنه كان لا يعرفه ينكر رواية أهل الشام عن زهير بن محمد هذا ورواه الحافظ أبو بكر البزار عن عمرو بن مالك عن الوليد بن مسلم وعن عبدالله بن أحمد بن شبوبه عن هشام بن عمارة كلاهما عن الوليد بن مسلم به ثم قال لا نعرفه يروى إلا من هذا الوجه وقال أبو جعفر بن جرير حدثنا محمد بن عباد بن موسى وعمرو بن مالك البصري قالا حدثنا يحيى بن سليم عن إسماعيل بن أمية عن نافع عن ابن عمر أن رسول الله صلى الله عليه وسلم قرأ سورة الرحمن أو قرئت عنده فقال \"مالي أسمع الجن أحسن جوابا لربها منكم؟ \" قالوا وما ذاك يا رسول الله؟ قال \"ما أتيت على قول الله تعالى \"فبأي آلاء ربكما تكذبان؟\" إلا قالت الجن لا بشيء من نعم ربنا نكذب\" ورواه الحافظ البزار عن عمرو بن مالك به ثم قال لا نعلمه يروى عن النبي صلى الله عليه وسلم إلا من هذا الوجه بهذا الإسناد. يخبر تعالى عن فضله ورحمته بخلقه أنه أنزل على عباده القرآن ويسر حفظه وفهمه على من رحمه فقال تعالى \"الرحمن علم القرآن خلق الإنسان علمه البيان\" قال الحسن يعني النطق وقال الضحاك وقتادة وغيرهما يعني الخير والشر وقول الحسن ههنا أحسن وأقوى لأن السياق في تعليمه تعالى القرآن وهو أداء تلاوته وإنما يكون ذلك بتيسير النطق على الخلق وتسهيل خروج الحروف من مواضعها من الحلق واللسان والشفتين على اختلاف مخارجها وأنواعها."
    },
    {
      "ayah": 10,
      "surah": 55,
      "text": "أي كما رفع السماء وضع الأرض ومهدها وأرساها بالجبال الراسيات الشامخات لتستقر لما على وجهها من الأنام وهم الخلائق المختلفة أنواعهم وأشكالهم وألوانهم وألسنتهم في سائر أقطارها وأرجائها قال ابن عباس ومجاهد وقتادة وابن زيد: الأنام الخلق."
    },
    {
      "ayah": 11,
      "surah": 55,
      "text": "\"فيها فاكهة\" أي مختلفة الألوان والطعوم والروائح \"والنخل ذات الأكمام\" أفرده بالذكر لشرفه ونفعه رطبا ويابسا والأكمام قال ابن جريج عن ابن عباس هي أوعية الطلع وهكذا قال غير واحد من المفسرين وهو الذي يطلع فيه العنقود ثم ينشق عن العنقود فيكون بسرا ثم رطبا ثم ينضج ويتناهى نفعه واستواؤه وقال ابن أبي حاتم ذكر عن عمرو بن علي الصيرفي حدثنا أبو قتيبة حدثنا يونس بن الحارث الطائفي عن الشعبي قال كتب قيصر إلى عمر بن الخطاب أخبرك أن رسلي أتتني من قبلك فزعمت أن قبلكم شجرة ليست بخليقة لشيء من الخير تخرج مثل آذان الحمير ثم ثشقق مثل اللؤلؤ ثم تخضر فتكون مثل الزمرد الأخضر ثم تحمر فتكون كالياقوت الأحمر ثم تينع فتنضج فتكون كأطيب فالوذج أكل ثم تيبس فتكون عصمة للمقيم وزادا للمسافر فإن تكن رسلي صدقتني فلا أرى هذه الشجرة إلا من شجر الجنة فكتب إليه عمر بن الخطاب من عبدالله عمر أمير المؤمنين إلى قيصر ملك الروم أن رسلك قد صدقوك هذه الشجرة عندنا وهي الشجرة التي أنبتها الله على مريم حين نفست بعيسى ابنها فاتق الله ولا تتخذ عيسى إلها من دون الله فإن \"مثل عيسى عند الله كمثل آدم خلقه من تراب ثم قال له كن فيكون الحق من ربك فلا تكن من الممترين\" وقيل الأكمام رفاتها وهو الليف الذي على عنق النخلة وهو قول الحسن وقتادة."
    },
    {
      "ayah": 12,
      "surah": 55,
      "text": "\"والحب ذو العصف والريحان\" قال علي بن أبي طلحة عن ابن عباس يعني التبن. وقال العوفي عن ابن عباس العصف ورق الزرع الأخضر الذي قطع رءوسه فهو يسمى العصف إذا يبس وكذا قال قتادة والضحاك وأبو مالك عصفه تبنه وقال ابن عباس ومجاهد وغير واحد والريحان يعني الورق وقال الحسن هو ريحانكم هذا وقال علي بن أبي طلحة عن ابن عباس والريحان خضر الزرع ومعنى هذا والله أعلم أن الحب كالقمح والشعير ونحوهما له في حال نباته عصف وهو ما على السنبلة وريحان وهو الورق الملتف على ساقها وقيل العصف الورق أول ما ينبت الزرع بقلا والريحان والورق يعني إذا أدجن وانعقد فيه الحب كما قال زيد بن عمرو بن نفيل في قصيدته المشهورة. وقولا له من ينبت الحب في الثرى فيصبح منه البقل يهتز رابيا ويخرج منه حبه فى رؤوســه ففي ذاك آيات لمن كان واعيا"
    },
    {
      "ayah": 13,
      "surah": 55,
      "text": "أي فبأي الآلاء يا معشر الثقلين من الإنس الجن تكذبان؟ قاله مجاهد وغير واحد ويدل عليه السياق بعده أي النعم ظاهرة عليكم وأنتم مغمورون بها لا تستطيعون إنكارها ولا جحودها فنحن نقول كما قالت الجن المؤمنون به اللهم ولا بشيء من آلائك ربنا نكذب فلك الحمد وكان ابن عباس يقول لا بأيها يا رب أي لا نكذب بشيء منها قال الإمام أحمد حدثنا يحيى بن إسحاق حدثنا ابن لهيعة عن أبي الأسود عن عروة عن أسماء بنت أبي بكر قالت سمعت رسول الله صلى الله عليه وسلم وهو يقرأ وهو يصلي نحو الركن قبل أن يصدع بما يؤمر والمشركون يستمعون \"فبأي آلاء ربكما تكذبان\"."
    },
    { "ayah": 14, "surah": 55, "text": "يذكر تعالى خلقه الإنسان من صلصال كالفخار." },
    {
      "ayah": 15,
      "surah": 55,
      "text": "وخلقه الجان من مارج من نار وهو طرف لهبها قاله الضحاك عن ابن عباس وبه عكرمة ومجاهد والحسن وابن زيد وقال العوفي عن ابن عباس من مارج من نار من لهب النار من أحسنها وقال علي بن أبي طلحة عن ابن عباس من مارج من نار من خالص النار وكذا قال عكرمة ومجاهد والضحاك وغيرهم. وقال الإمام أحمد حدثنا عبدالرزاق حدثنا معمر عن الزهري عن عروة عن عائشة قالت: قال رسول الله صلى الله عليه وسلم \"خلقت الملائكة من نور وخلق الجان من مارج من نار وخلق آدم مما وصف لكم\" ورواه مسلم عن محمد بن رافع وعبد بن حميد كلاهما عن عبدالرزاق به."
    },
    {
      "ayah": 16,
      "surah": 55,
      "text": "أي فبأي الآلاء يا معشر الثقلين من الإنس الجن تكذبان؟ قاله مجاهد وغير واحد ويدل عليه السياق بعده أي النعم ظاهرة عليكم وأنتم مغمورون بها لا تستطيعون إنكارها ولا جحودها فنحن نقول كما قالت الجن المؤمنون به اللهم ولا بشيء من آلائك ربنا نكذب فلك الحمد وكان ابن عباس يقول لا بأيها يا رب أي لا نكذب بشيء منها قال الإمام أحمد حدثنا يحيى بن إسحاق حدثنا ابن لهيعة عن أبي الأسود عن عروة عن أسماء بنت أبي بكر قالت سمعت رسول الله صلى الله عليه وسلم وهو يقرأ وهو يصلي نحو الركن قبل أن يصدع بما يؤمر والمشركون يستمعون \"فبأي آلاء ربكما تكذبان\"."
    },
    {
      "ayah": 17,
      "surah": 55,
      "text": "يعني مشرقي الصيف والشتاء ومغربي الصيف والشتاء وقال في الآية الأخرى \"فلا أقسم برب المشارق والمغارب\" وذلك باختلاف مطالع الشمس وتنقلها في كل يوم وبروزها منه إلى الناس وقال في الآية الأخرى \"رب المشرق والمغرب لا إله إلا هو فاتخذ وكيلا\" وهذا المراد منه جنس المشارق والمغارب ولما كان في اختلاف هذه المشارق والمغارب مصالح للخلق من الجن والإنس."
    },
    {
      "ayah": 18,
      "surah": 55,
      "text": "أي فبأي الآلاء يا معشر الثقلين من الإنس الجن تكذبان؟ قاله مجاهد وغير واحد ويدل عليه السياق بعده أي النعم ظاهرة عليكم وأنتم مغمورون بها لا تستطيعون إنكارها ولا جحودها فنحن نقول كما قالت الجن المؤمنون به اللهم ولا بشيء من آلائك ربنا نكذب فلك الحمد وكان ابن عباس يقول لا بأيها يا رب أي لا نكذب بشيء منها قال الإمام أحمد حدثنا يحيى بن إسحاق حدثنا ابن لهيعة عن أبي الأسود عن عروة عن أسماء بنت أبي بكر قالت سمعت رسول الله صلى الله عليه وسلم وهو يقرأ وهو يصلي نحو الركن قبل أن يصدع بما يؤمر والمشركون يستمعون \"فبأي آلاء ربكما تكذبان\"."
    },
    {
      "ayah": 19,
      "surah": 55,
      "text": "قال ابن عباس أي أرسلهما وقوله \"يلتقيان\" قال ابن زيد أي منعهما أن يلتقيا بما جعل بينهما من البرزخ الحاجز الفاصل بينهما والمراد بقوله البحرين الملح والحلو فالحلو هذه الأنهار السارحة بين الناس وقد قدمنا الكلام على ذلك في سورة الفرقان عند قوله تعالى \"وهو الذي مرج البحرين هذا عذب فرات وهذا ملح أجاج وجعل بينهما برزخا وحجرا محجورا\" وقد اختار ابن جرير ههنا ان المراد بالبحرين: بحر السماء وبحر الأرض وهو مروي عن مجاهد وسعيد بن جبير وعطية وابن أبزى قال ابن جرير لأن اللؤلؤ يتولد من ماء السماء وأصداف بحر الأرض وهذا وإن كان هكذا لكن ليس المراد بذلك ما ذهب إليه فإنه لا يساعده اللفظ."
    },
    {
      "ayah": 2,
      "surah": 55,
      "text": "يخبر تعالى عن فضله ورحمته بخلقه أنه أنزل على عباده القرآن ويسر حفظه وفهمه على من رحمه فقال تعالى \"الرحمن علم القرآن خلق الإنسان علمه البيان\" قال الحسن يعني النطق وقال الضحاك وقتادة وغيرهما يعني الخير والشر وقول الحسن ههنا أحسن وأقوى لأن السياق في تعليمه تعالى القرآن وهو أداء تلاوته وإنما يكون ذلك بتيسير النطق على الخلق وتسهيل خروج الحروف من مواضعها من الحلق واللسان والشفتين على اختلاف مخارجها وأنواعها."
    },
    {
      "ayah": 20,
      "surah": 55,
      "text": "أي وجعل بينهما برزخا وهو الحاجز من الأرض لئلا يبغي هذا على هذا وهذا على هذا فيفسد كل واحد منهما الآخر ويزيله عن صفته التي هي مقصودة منه وما بين السماء والأرض لا يسمى برزخا وحجرا محجورا."
    },
    {
      "ayah": 21,
      "surah": 55,
      "text": "أي فبأي الآلاء يا معشر الثقلين من الإنس الجن تكذبان؟ قاله مجاهد وغير واحد ويدل عليه السياق بعده أي النعم ظاهرة عليكم وأنتم مغمورون بها لا تستطيعون إنكارها ولا جحودها فنحن نقول كما قالت الجن المؤمنون به اللهم ولا بشيء من آلائك ربنا نكذب فلك الحمد وكان ابن عباس يقول لا بأيها يا رب أي لا نكذب بشيء منها قال الإمام أحمد حدثنا يحيى بن إسحاق حدثنا ابن لهيعة عن أبي الأسود عن عروة عن أسماء بنت أبي بكر قالت سمعت رسول الله صلى الله عليه وسلم وهو يقرأ وهو يصلي نحو الركن قبل أن يصدع بما يؤمر والمشركون يستمعون \"فبأي آلاء ربكما تكذبان\"."
    },
    {
      "ayah": 22,
      "surah": 55,
      "text": "أي من مجموعهما فإذا وجد ذلك من أحدهما كفى كما قال تعالى \"يا معشر الجن والإنس ألم يأتكم رسل منكم\" والرسل إنما كانوا في الإنس خاصة دون الجن وقد صح هذا الإطلاق. واللؤلؤ معروف. وأما المرجان فقيل هو صغار اللؤلؤ. قاله مجاهد وقتادة وأبو رزين والضحاك وروي عن علي وقيل كباره وجيده حكاه ابن جرير عن بعض السلف ورواه ابن أبي حاتم عن الربيع بن أنس وحكاه السدي عمن حدثه عن ابن عباس وروى مثله عن علي ومجاهد أيضا ومرة الهمداني وقيل هو نوع من الجواهر أحمر اللون. قال السدي عن أبي مالك عن مسروق عن عبدالله قال: المرجان الخرز الأحمر قال السدي وهو الكسد بالفارسية وأما قوله \"ومن كل تأكلون لحما طريا وتستخرجون حلية تلبسونها\" فاللحم من كل من الأجاج والعذب والحلية إنما هي من المالح دون العذب. قال ابن عباس ما سقطت قط قطرة من السماء في البحر فوقعت فى صدفة إلا صار منها لؤلؤة وكذا قال عكرمة وزاد فإذا لم تقع في صدفة نبتت بها عنبرة وروي من غير وجه عن ابن عباس نحوه وقد قال ابن أبي حاتم حدثنا أحمد بن سنان حدثنا عبدالرحمن بن مهدي حدثنا سفيان عن الأعمش عن عبدالله بن عبدالله عن سعيد بن جبير عن ابن عباس قال: إذا أمطرت السماء فتحت الأصداف في البحر أفواهها فما وقع فيها يعني من قطر فهو اللؤلؤ. إسناده صحيح ولما كان اتخاذ هذه الحلية نعمة على أهل الأرض امتن بها عليهم."
    },
    {
      "ayah": 23,
      "surah": 55,
      "text": "أي فبأي الآلاء يا معشر الثقلين من الإنس الجن تكذبان؟ قاله مجاهد وغير واحد ويدل عليه السياق بعده أي النعم ظاهرة عليكم وأنتم مغمورون بها لا تستطيعون إنكارها ولا جحودها فنحن نقول كما قالت الجن المؤمنون به اللهم ولا بشيء من آلائك ربنا نكذب فلك الحمد وكان ابن عباس يقول لا بأيها يا رب أي لا نكذب بشيء منها قال الإمام أحمد حدثنا يحيى بن إسحاق حدثنا ابن لهيعة عن أبي الأسود عن عروة عن أسماء بنت أبي بكر قالت سمعت رسول الله صلى الله عليه وسلم وهو يقرأ وهو يصلي نحو الركن قبل أن يصدع بما يؤمر والمشركون يستمعون \"فبأي آلاء ربكما تكذبان\"."
    },
    {
      "ayah": 24,
      "surah": 55,
      "text": "وقوله تعالى \"وله الجوار المنشآت\" يعني السفن التي تجري \"فى البحر\" قال مجاهد ما رفع قلعه من السفن فهي منشآت وما لم يرفع قلعه فليس بمنشآت وقال قتادة المنشآت يعني المخلوقات وقال غيره المنشئات بكسر الشين يعني البادئات \"كالأعلام\" أي كالجبال في كبرها وما فيها من المتاجر والمكاسب المنقولة من قطر إلى قطر وإقليم إلى إقليم مما فيه صلاح للناس في جلب ما يحتاجون إليه من سائر أنواع البضائع ولهذا قال \"فبأي آلاء ربكما تكذبان\". وقال ابن أبي حاتم حدثنا أبي حدثنا موسى بن إسماعيل حدثنا حماد بن سلمة حدثنا العيزار بن سويد عن عمرة بن سويد قال كنت مع علي بن أبي طالب رضي الله عنه على شاطىء الفرات إذ أقلبت سفينة مرفوع شراعها فبسط علي يديه ثم قال: يقول الله عز وجل \"وله الجوار المنشآت في البحر كالأعلام\" والذي أنشأها تجري في بحوره ما قتلت عثمان ولا مالأت على قتله."
    },
    {
      "ayah": 25,
      "surah": 55,
      "text": "أي فبأي الآلاء يا معشر الثقلين من الإنس الجن تكذبان؟ قاله مجاهد وغير واحد ويدل عليه السياق بعده أي النعم ظاهرة عليكم وأنتم مغمورون بها لا تستطيعون إنكارها ولا جحودها فنحن نقول كما قالت الجن المؤمنون به اللهم ولا بشيء من آلائك ربنا نكذب فلك الحمد وكان ابن عباس يقول لا بأيها يا رب أي لا نكذب بشيء منها قال الإمام أحمد حدثنا يحيى بن إسحاق حدثنا ابن لهيعة عن أبي الأسود عن عروة عن أسماء بنت أبي بكر قالت سمعت رسول الله صلى الله عليه وسلم وهو يقرأ وهو يصلي نحو الركن قبل أن يصدع بما يؤمر والمشركون يستمعون \"فبأي آلاء ربكما تكذبان\"."
    },
    {
      "ayah": 26,
      "surah": 55,
      "text": "يخبر تعالى أن جميع أهل الأرض سيذهبون ويموتون أجمعون وكذلك أهل السماوات إلا من شاء الله ولا يبقى أحد سوى وجهه الكريم فإن الرب تعالى وتقدس لا يموت بل هو الحي الذي لا يموت أبدا قال قتادة أنبأ بما خلق ثم أنبأ أن ذلك كله فان وفي الدعاء المأثور: يا حي يا قيوم يا بديع السموات والأرض يا ذا الجلال والإكرام لا إله إلا أنت برحمتك نستغيث أصلح لنا شأننا كله ولا تكلنا إلى أنفسنا طرفة عين ولا إلى أحد من خلقك وقال الشعبي إذا قرأت \"كل من عليها فان\" فلا تسكت حتى تقرأ \"ويبقى وجه ربك ذو الجلال والإكرام\" وهذه الآية كقوله تعالى \"كل شيء هالك إلا وجهه\" وقد نعت تعالى وجهه الكريم في هذه الآية الكريمة بأنه ذو الجلال والإكرام أي هو أهل أن يجل فلا يعصى وأن يطاع فلا يخالف كقوله تعالى \"واصبر نفسك مع الذين يدعون ربهم بالغداة والعشي يريدون وجهه\" وكقوله إخبارا عن المتصدقين \"إنما نطعمكم لوجه الله\" قال ابن عباس ذو الجلال والإكرام ذو العظمة والكبرياء ولما أخبر تعالى عن تساوي أهل الأرض كلهم في الوفاة وأنهم سيصيرون إلى الدار الآخرة فيحكم فيهم ذو الجلال والإكرام بحكمه العدل قال \"فبأي آلاء ربكما تكذبان\"."
    },
    {
      "ayah": 27,
      "surah": 55,
      "text": "يخبر تعالى أن جميع أهل الأرض سيذهبون ويموتون أجمعون وكذلك أهل السماوات إلا من شاء الله ولا يبقى أحد سوى وجهه الكريم فإن الرب تعالى وتقدس لا يموت بل هو الحي الذي لا يموت أبدا قال قتادة أنبأ بما خلق ثم أنبأ أن ذلك كله فان وفي الدعاء المأثور: يا حي يا قيوم يا بديع السموات والأرض يا ذا الجلال والإكرام لا إله إلا أنت برحمتك نستغيث أصلح لنا شأننا كله ولا تكلنا إلى أنفسنا طرفة عين ولا إلى أحد من خلقك وقال الشعبي إذا قرأت \"كل من عليها فان\" فلا تسكت حتى تقرأ \"ويبقى وجه ربك ذو الجلال والإكرام\" وهذه الآية كقوله تعالى \"كل شيء هالك إلا وجهه\" وقد نعت تعالى وجهه الكريم في هذه الآية الكريمة بأنه ذو الجلال والإكرام أي هو أهل أن يجل فلا يعصى وأن يطاع فلا يخالف كقوله تعالى \"واصبر نفسك مع الذين يدعون ربهم بالغداة والعشي يريدون وجهه\" وكقوله إخبارا عن المتصدقين \"إنما نطعمكم لوجه الله\" قال ابن عباس ذو الجلال والإكرام ذو العظمة والكبرياء ولما أخبر تعالى عن تساوي أهل الأرض كلهم في الوفاة وأنهم سيصيرون إلى الدار الآخرة فيحكم فيهم ذو الجلال والإكرام بحكمه العدل."
    },
    {
      "ayah": 28,
      "surah": 55,
      "text": "أي فبأي الآلاء يا معشر الثقلين من الإنس الجن تكذبان؟ قاله مجاهد وغير واحد ويدل عليه السياق بعده أي النعم ظاهرة عليكم وأنتم مغمورون بها لا تستطيعون إنكارها ولا جحودها فنحن نقول كما قالت الجن المؤمنون به اللهم ولا بشيء من آلائك ربنا نكذب فلك الحمد وكان ابن عباس يقول لا بأيها يا رب أي لا نكذب بشيء منها قال الإمام أحمد حدثنا يحيى بن إسحاق حدثنا ابن لهيعة عن أبي الأسود عن عروة عن أسماء بنت أبي بكر قالت سمعت رسول الله صلى الله عليه وسلم وهو يقرأ وهو يصلي نحو الركن قبل أن يصدع بما يؤمر والمشركون يستمعون \"فبأي آلاء ربكما تكذبان\"."
    },
    {
      "ayah": 29,
      "surah": 55,
      "text": "وهذا إخبار عن غناه عما سواه وافتقار الخلائق إليه في جميع الآنات وأنهم يسألونه بلسان حالهم وقالهم وأنه كل يوم هو في شأن قال الأعمش عن مجاهد عن عبيد بن عمير \"كل يوم هو في شأن\" قال من شأنه أن يجيب داعيا أو يعطي سائلا أو يفك عانيا أو يشفي سقيما. وقال ابن أبي نجيح عن مجاهد قال كل يوم هو يجيب داعيا ويكشف كربا ومجيب مضطرا ويغفر ذنبا وقال قتادة لا يستغني عنه أهل السموات والأرض يحيى حيا ويميت ميتا ويربي صغيرا ويفك أسيرا وهو منتهى حاجات الصالحين وصريخهم ومنتهى شكواهم. وقال ابن أبي حاتم حدثنا أبي حدثنا أبو اليمان الحمصي حدثنا جرير بن عثمان عن سويد بن جبلة هو الفزاري قال إن ربكم كل يوم هو في شأن فيعتق رقابا ويعطي رغابا ويقحم عقابا.وقال ابن جرير حدثني عبدالله بن محمد بن عمرو الغزي حدثني إبراهيم بن محمد بن يوسف الفريابي حدثني عمرو بن بكر السكسكي حدثنا الحارث بن عبدة بن رباح الغساني عن أبيه عن منيب بن عبدالله بن منيب الأزدي عن أبيه قال: تلا رسول الله صلى الله عليه وسلم هذه الآية \"كل يوم هو في شأن\" فقلنا يا رسول الله وما ذاك الشأن؟ قال \"أن يغفر ذنبا ويفرج كربا ويرفع قوما ويضع آخرين\". وقال ابن أبي حاتم حدثنا أبي حدثنا هشام بن عمار وسليمان بن أحمد الواسطي قالا: حدثنا الوزير بن صبيح الثقفي أبو روح الدمشقي والسياق لهشام قال سمعت يونس بن ميسرة بن حلبس يحدث عن أم الدرداء عن النبي صلى الله عليه وسلم قال \"قال الله عز وجل \"كل يوم هو في شأن\" قال من شأنه أن يغفر ذنبا ويفرج كربا ويرفع قوما ويضع آخرين\". وقد رواه ابن عساكر من طرق متعددة عن هشام بن عمار به. ثم ساقه من حديث أبي الوليد بن شجاع عن الوزير بن صبيح قال ورد فيما علقه الوليد بن مسلم عن مطرف عن الشعبي عن ام الدرداء عن أبي الدرداء عن النبي صلى الله عليه وسلم فذكره قال والصحيح الأول يعني إسناده الأول \"قلت\" وقد روي موقوفا كما علقه البخاري بصيغة الجزم فجعله من كلام أبي الدرداء فالله أعلم. وقال البزار حدثنا محمد بن المثنى حدثنا محمد بن الحارث حدثنا محمد بن عبدالرحمن بن البيلماني عن أبيه عن ابن عمر عن النبي صلى الله عليه وسلم \"كل يوم هو في شأن\" قال \"يغفر ذنبا ويكشف كربا\" ثم قال ابن جرير وحدثنا أبو كريب حدثنا عبيدالله بن موسى عن أبي حمزة الثمالي عن سعيد بن جبير عن ابن عباس إن الله خلق لوحا محفوظا من درة بيضاء دفتاه ياقوتة حمراء قلمه نور وكتابه نور وعرضه ما بين السماء والأرض ينظر فيه كل يوم ثلثمائة وستين نظرة يخلق في كل نظرة ويحيى ويميت ويعز ويذل ويفعل ما يشاء."
    },
    {
      "ayah": 3,
      "surah": 55,
      "text": "يخبر تعالى عن فضله ورحمته بخلقه أنه أنزل على عباده القرآن ويسر حفظه وفهمه على من رحمه فقال تعالى \"الرحمن علم القرآن خلق الإنسان علمه البيان\" قال الحسن يعني النطق وقال الضحاك وقتادة وغيرهما يعني الخير والشر وقول الحسن ههنا أحسن وأقوى لأن السياق في تعليمه تعالى القرآن وهو أداء تلاوته وإنما يكون ذلك بتيسير النطق على الخلق وتسهيل خروج الحروف من مواضعها من الحلق واللسان والشفتين على اختلاف مخارجها وأنواعها."
    },
    {
      "ayah": 30,
      "surah": 55,
      "text": "أي فبأي الآلاء يا معشر الثقلين من الإنس الجن تكذبان؟ قاله مجاهد وغير واحد ويدل عليه السياق بعده أي النعم ظاهرة عليكم وأنتم مغمورون بها لا تستطيعون إنكارها ولا جحودها فنحن نقول كما قالت الجن المؤمنون به اللهم ولا بشيء من آلائك ربنا نكذب فلك الحمد وكان ابن عباس يقول لا بأيها يا رب أي لا نكذب بشيء منها قال الإمام أحمد حدثنا يحيى بن إسحاق حدثنا ابن لهيعة عن أبي الأسود عن عروة عن أسماء بنت أبي بكر قالت سمعت رسول الله صلى الله عليه وسلم وهو يقرأ وهو يصلي نحو الركن قبل أن يصدع بما يؤمر والمشركون يستمعون \"فبأي آلاء ربكما تكذبان\"."
    },
    {
      "ayah": 31,
      "surah": 55,
      "text": "قال علي بن أبي طلحة عن ابن عباس في قوله تعالي \"سنفرغ لكم أيها الثقلان\" قال وعيد من الله تعالى للعباد وليس بالله شغل وهو فارغ وكذا قال الضحاك هذا وعيد وقال قتادة قد دنا من الله فراغ لخلقه وقال ابن جريج \"سنفرغ لكم\" أي سنقضي لكم وقال البخاري سنحاسبكم لا يشغله شيء عن شيء وهو معروف في كلام العرب يقال لأتفرغن لك وما به شغل يقول لآخذنك على غرتك. وقوله تعالى \"أيها الثقلان\" الثقلان: الإنس والجن كما جاء في الصحيح \"يسمعه كل شيء إلا الثقلين\" وفي رواية \"إلا الإنس والجن\" وفي حديث الصور \"الثقلان الإنس والجن\"."
    },
    {
      "ayah": 32,
      "surah": 55,
      "text": "أي فبأي الآلاء يا معشر الثقلين من الإنس الجن تكذبان؟ قاله مجاهد وغير واحد ويدل عليه السياق بعده أي النعم ظاهرة عليكم وأنتم مغمورون بها لا تستطيعون إنكارها ولا جحودها فنحن نقول كما قالت الجن المؤمنون به اللهم ولا بشيء من آلائك ربنا نكذب فلك الحمد وكان ابن عباس يقول لا بأيها يا رب أي لا نكذب بشيء منها قال الإمام أحمد حدثنا يحيى بن إسحاق حدثنا ابن لهيعة عن أبي الأسود عن عروة عن أسماء بنت أبي بكر قالت سمعت رسول الله صلى الله عليه وسلم وهو يقرأ وهو يصلي نحو الركن قبل أن يصدع بما يؤمر والمشركون يستمعون \"فبأي آلاء ربكما تكذبان\"."
    },
    {
      "ayah": 33,
      "surah": 55,
      "text": "أي لا تستطيعون هربا من أمر الله وقدره بل هو محيط بكم لا تقدرون على التخلص من حكمه ولا النفوذ عن حكمه فيكم أينما ذهبتم أحيط بكم وهذا في مقام الحشر الملائكة محدقة بالخلائق سبع صفوف من كل جانب فلا يقدر أحد على الذهاب \"إلا بسلطان\" أى إلا بأمر الله \"يقول الإنسان يومئذ أين المفر كلا لا وزر إلى ربك يومئذ المستقر\" وقال تعالى \"والذين كسبوا السيئات جزاء سيئة بمثلها وترهقهم ذلة ما لهم من الله من عاصم كأنما أغشيت وجوههم قطعا من الليل مظلما أولئك أصحاب النار هم فيهـا خالدون\"."
    },
    {
      "ayah": 34,
      "surah": 55,
      "text": "أي فبأي الآلاء يا معشر الثقلين من الإنس الجن تكذبان؟ قاله مجاهد وغير واحد ويدل عليه السياق بعده أي النعم ظاهرة عليكم وأنتم مغمورون بها لا تستطيعون إنكارها ولا جحودها فنحن نقول كما قالت الجن المؤمنون به اللهم ولا بشيء من آلائك ربنا نكذب فلك الحمد وكان ابن عباس يقول لا بأيها يا رب أي لا نكذب بشيء منها قال الإمام أحمد حدثنا يحيى بن إسحاق حدثنا ابن لهيعة عن أبي الأسود عن عروة عن أسماء بنت أبي بكر قالت سمعت رسول الله صلى الله عليه وسلم وهو يقرأ وهو يصلي نحو الركن قبل أن يصدع بما يؤمر والمشركون يستمعون \"فبأي آلاء ربكما تكذبان\"."
    },
    {
      "ayah": 35,
      "surah": 55,
      "text": "قال علي بن أبي طلحة عن ابن عباس الشواظ هو لهب النار وقال سعيد بن جبير عن ابن عباس الشواظ الدخان وقال مجاهد هو اللهب الأخضر المنقطع وقال أبو صالح الشواظ هو اللهب الذي فوق النار ودون الدخان وقال الضحاك \"شواظ من نار\" سيل من نار. وقوله تعالى \"ونحاس\" قال علي بن أبي طلحة عن ابن عباس \"ونحاس\" دخان النار وروي مثله عن أبي صالح وسعيد بن جبير وأبي سنان وقال ابن جرير والعرب تسمي الدخان نحاسا بضم النون وكسرها والقراءة مجمعة على الضم ومن النحاس بمعنى الدخان قول نابغة جعدة: يضيء كضوء سـراج السليط لم يجعل الله فيه نحاسا يعني دخانا هكذا قال. وقد روى الطبراني من طريق جويبر عن الضحاك أن نافع بن الأزرق سأل ابن عباس عن الشواظ فقال هو اللهب الذي لا دخان معه فسأله شاهدا على ذلك من اللغة فأنشده بيت أمية بن أبي الصلت في حسان: ألا من مبلغ حسان عني مغلغلة تدب إلى عكاظ أليس أبوك فينا كان قينا لدى القينات فسلا في الحفاظ يمانيا يظل يشد كيرا وينفخ دائبا لهب الشواظ قال صدقت فما النحاس؟ قال هو الدخان الذي لا لهب له فهل تعرفه العرب؟ قال نعم أما سمعت نابغة بني ذبيان يقول: يضيء كضوء سراج السليط لم يجعل الله فيـه نحاسا؟ وقال مجاهد: النحاس الصفر يذاب فيصب على رؤوسهم وكذا قال قتادة وقال الضحاك ونحاس سيل من نحاس والمعنى على كل قول لو ذهبتم هاربين يوم القيامة لردتكم الملائكة والزبانية بإرسال اللهب من النار والنحاس المذاب عليكم لترجعوا ولهذا قال \"فلا تنتصران فبأي آلاء ربكما تكذبان\"."
    },
    {
      "ayah": 36,
      "surah": 55,
      "text": "أي فبأي الآلاء يا معشر الثقلين من الإنس الجن تكذبان؟ قاله مجاهد وغير واحد ويدل عليه السياق بعده أي النعم ظاهرة عليكم وأنتم مغمورون بها لا تستطيعون إنكارها ولا جحودها فنحن نقول كما قالت الجن المؤمنون به اللهم ولا بشيء من آلائك ربنا نكذب فلك الحمد وكان ابن عباس يقول لا بأيها يا رب أي لا نكذب بشيء منها قال الإمام أحمد حدثنا يحيى بن إسحاق حدثنا ابن لهيعة عن أبي الأسود عن عروة عن أسماء بنت أبي بكر قالت سمعت رسول الله صلى الله عليه وسلم وهو يقرأ وهو يصلي نحو الركن قبل أن يصدع بما يؤمر والمشركون يستمعون \"فبأي آلاء ربكما تكذبان\"."
    },
    {
      "ayah": 37,
      "surah": 55,
      "text": "يقول تعالى \"فإذا انشقت السماء\" يوم القيامة كما دلت عليه هذه الآيات مع ما شاكلها من الآيات الواردة في معناها كقوله تعالى \"وانشقت السماء فهي يومئذ واهية\" وقوله \"ويوم تشقق السماء بالغمام ونزل الملائكة تنزيلا\" وقوله \"إذا السماء انشقت وأذنت لربها وحقت\" وقوله تعالى \"فكانت وردة كالدهان\" أي تذوب كما يذوب الدردي والفضة في السبك وتتلون كما تتلون الأصباغ التي يدهن بها فتارة حمراء وصفراء وزرقاء وخضراء وذلك من شدة الأمر وهول يوم القيامة العظيم. وقد قال الإمام أحمد حدثنا أحمد بن عبدالملك حدثنا عبدالرحمن بن أبي الصهباء حدثنا نافع أبو غالب الباهلي حدثنا أنس بن مالك قال: قال رسول الله صلى الله عليه وسلم \"يبعث الناس يوم القيامة والسماء تطش عليهم\" قال الجوهري الطش المطر الضعيف وقال الضحاك عن ابن عباس في قوله تعالى \"وردة كالدهان\" قال هو الأديم الأحمر وقال أبو كدينة عن قابوس عن أبيه عن ابن عباس \"فكانت وردة كالدهان\" كالفرس الورد وقال العوفي عن ابن عباس تغير لونها. وقال أبو صالح كالبرذون الورد ثم كانت بعد كالدهان وحكى البغوي وغيره أن الفرس الورد تكون في الربيع صفراء وفي الشتاء حمراء فإذا اشتد البرد تغير لونها وقال الحسن البصري تكون ألوانا وقال السدي تكون كلون البغلة الوردة وتكون كالمهل كدردي الزيت وقال مجاهد \"كالدهان\" كألوان الدهان وقال عطاء الخراساني كلون دهن الورد في الصفرة وقال قتادة هي اليوم خضراء ويومئذ لونها إلى الحمرة يوم ذي ألوان وقال أبو الجوزاء في صفاء الدهن وقال ابن جريج تصير السماء كالدهن الذائب وذلك حين يصيبها حر جهنم."
    },
    {
      "ayah": 38,
      "surah": 55,
      "text": "أي فبأي الآلاء يا معشر الثقلين من الإنس الجن تكذبان؟ قاله مجاهد وغير واحد ويدل عليه السياق بعده أي النعم ظاهرة عليكم وأنتم مغمورون بها لا تستطيعون إنكارها ولا جحودها فنحن نقول كما قالت الجن المؤمنون به اللهم ولا بشيء من آلائك ربنا نكذب فلك الحمد وكان ابن عباس يقول لا بأيها يا رب أي لا نكذب بشيء منها قال الإمام أحمد حدثنا يحيى بن إسحاق حدثنا ابن لهيعة عن أبي الأسود عن عروة عن أسماء بنت أبي بكر قالت سمعت رسول الله صلى الله عليه وسلم وهو يقرأ وهو يصلي نحو الركن قبل أن يصدع بما يؤمر والمشركون يستمعون \"فبأي آلاء ربكما تكذبان\"."
    },
    {
      "ayah": 39,
      "surah": 55,
      "text": "وهذه كقوله تعالى \"هذا يوم لا ينطقون ولا يؤذن لهم فيعتذرون\" فهذا في حال وثم في حال يسئل الخلائق عن جميع أعمالهم قال الله تعالى \"فوربك لنسألنهم أجمعين عما كانوا يعملون\" ولهذا قال قتادة \"فيومئذ لا يسئل عن ذنبه إنس ولا جان\" قال قد كانت مسألة ثم ختم على أفواه القوم وتكلمت أيديهم وأرجلهم بما كانوا يعملون وقد قال علي ابن أبي طلحة عن ابن عباس لا يسألهم هل عملتم كذا وكذا لأنه أعلم بذلك منهم ولكن يقول لم عملتم كذا وكذا.فهذا قول ثان. وقال مجاهد فى هذه الآية لا تسأل الملائكة عن المجرمين بل يعرفون بسيماهم وهذا قول ثالث. وكأن هذا بعدما يؤمر بهم إلى النار فذلك الوقت لا يسئلون عن ذنوبهم بل يقادون إليها ويلقون فيها."
    },
    {
      "ayah": 4,
      "surah": 55,
      "text": "يخبر تعالى عن فضله ورحمته بخلقه أنه أنزل على عباده القرآن ويسر حفظه وفهمه على من رحمه فقال تعالى \"الرحمن علم القرآن خلق الإنسان علمه البيان\" قال الحسن يعني النطق وقال الضحاك وقتادة وغيرهما يعني الخير والشر وقول الحسن ههنا أحسن وأقوى لأن السياق في تعليمه تعالى القرآن وهو أداء تلاوته وإنما يكون ذلك بتيسير النطق على الخلق وتسهيل خروج الحروف من مواضعها من الحلق واللسان والشفتين على اختلاف مخارجها وأنواعها."
    },
    {
      "ayah": 40,
      "surah": 55,
      "text": "أي فبأي الآلاء يا معشر الثقلين من الإنس الجن تكذبان؟ قاله مجاهد وغير واحد ويدل عليه السياق بعده أي النعم ظاهرة عليكم وأنتم مغمورون بها لا تستطيعون إنكارها ولا جحودها فنحن نقول كما قالت الجن المؤمنون به اللهم ولا بشيء من آلائك ربنا نكذب فلك الحمد وكان ابن عباس يقول لا بأيها يا رب أي لا نكذب بشيء منها قال الإمام أحمد حدثنا يحيى بن إسحاق حدثنا ابن لهيعة عن أبي الأسود عن عروة عن أسماء بنت أبي بكر قالت سمعت رسول الله صلى الله عليه وسلم وهو يقرأ وهو يصلي نحو الركن قبل أن يصدع بما يؤمر والمشركون يستمعون \"فبأي آلاء ربكما تكذبان\"."
    },
    {
      "ayah": 41,
      "surah": 55,
      "text": "كما قال تعالى \"يعرف المجرمون بسيماهم\" أي بعلامات تظهر عليهم وقال الحسن وقتادة يعرفونهم باسوداد الوجوه وزرقة العيون \"قلت\" وهذا كما يعرف المؤمنون بالغرة والتحجيل من آثار الوضوء. وقوله تعالى \"فيؤخذ بالنواصي والأقدام\" أي يجمع الزبانية ناصيته مع قدميه ويلقونه في النار كذلك وقال الأعمش عن ابن عباس يؤخذ بناصيته وقدميه فيكسر كما يكسر الحطب في التنور وقال الضحاك يجمع بين ناصيته وقدميه في سلسلة من وراء ظهره وقال السدي يجمع بين ناصية الكافر وقدميه فتربط ناصيته بقدمه ويفتل ظهره. وقال ابن أبي حاتم حدثنا أبي حدثنا أبو توبة الربيع بن نافع حدثنا معاوية بن سلام عن أخيه زيد بن سلام أنه سمع أبا سلام يعني جده أخبرني عبدالرحمن حدثني رجل من كندة قال أتيت عائشة فدخلت عليها وبيني وبينها حجاب فقلت حدثك رسول الله صلى الله عليه وسلم أنه يأتي عليه ساعة لا يملك فيها لأحد شفاعة؟ قالت نعم لقد سألته عن هذا وأنا وهو فى شعار واحد قال \"نعم حين يوضع الصراط لا أملك لأحد فيها شفاعة حتى أعلم أين يسلك بي ويوم تبيض وجوه وتسود وجوه حتى أنظر ماذا يفعل بي - أو قال يوحى - وعند الجسر حين يستحد ويستحر\" فقالت وما يستحد وما يستحر؟ قال \"يستحد حتى يكون مثل شفرة السيف ويستحر حتى يكون مثل الجمرة فأما المؤمن فيجوزه لا يضره وأما المنافق فيتعلق حتى إذا بلغ أوسطه خر من قدميه فيهوي بيديه إلى قدميه\" قالت فهل رأيت من يسعى حافيا فتأخذه شوكة حتى تكاد تنفذ قدميه فإنها كذلك يهوي بيده ورأسه إلى قدميه فتضربه الزبانية بخطاف في ناصيته وقدمه فتقذفه في جهنم فيهوي فيها مقدار خمسين عاما قلت ما ثقل الرجل؟ قالت ثقل عشر خلفات سمان فيومئذ يعرف المجرمون بسيماهم فيؤخذ بالنواصي والأقدام. هذا حديث غريب جدا وفيه ألفاط منكر رفعها وفي الإسناد من لم يسم ومثله لا يحتج به والله أعلم."
    },
    {
      "ayah": 42,
      "surah": 55,
      "text": "أي فبأي الآلاء يا معشر الثقلين من الإنس الجن تكذبان؟ قاله مجاهد وغير واحد ويدل عليه السياق بعده أي النعم ظاهرة عليكم وأنتم مغمورون بها لا تستطيعون إنكارها ولا جحودها فنحن نقول كما قالت الجن المؤمنون به اللهم ولا بشيء من آلائك ربنا نكذب فلك الحمد وكان ابن عباس يقول لا بأيها يا رب أي لا نكذب بشيء منها قال الإمام أحمد حدثنا يحيى بن إسحاق حدثنا ابن لهيعة عن أبي الأسود عن عروة عن أسماء بنت أبي بكر قالت سمعت رسول الله صلى الله عليه وسلم وهو يقرأ وهو يصلي نحو الركن قبل أن يصدع بما يؤمر والمشركون يستمعون \"فبأي آلاء ربكما تكذبان\"."
    },
    {
      "ayah": 43,
      "surah": 55,
      "text": "أي هذه النار التي كنتم تكذبون بوجودها ها هي حاضرة تشاهدونها عيانا يقال لهم ذلك تقريعا وتوبيخا وتصغيرا وتحقيرا."
    },
    {
      "ayah": 44,
      "surah": 55,
      "text": "أي تارة يعذبون في الجحيم وتارة يسقون من الحميم وهو الشراب الذي هو كالنحاس المذاب يقطع الأمعاء والأحشاء وهذه كقوله تعالى \"إذ الأغلال في أعناقهم والسلاسل يسحبون فىالحميم ثم في النار يسجرون\" وقوله تعالى \"آن\" أي حار قد بلغ الغاية في الحرارة لا يستطاع من شدة ذلك قال ابن عباس في قوله \"يطوفون بينها وبين حميم آن\" أي قد انتهى غليه واشتد حره وكذا قال مجاهد وسعيد بن جبير والضحاك والحسن والثوري والسدي وقال قتادة قد آن طبخه منذ خلق الله السموات والأرض. وقال محمد بن كعب القرظي يؤخذ العبد فيحرك بناصيته في ذلك الحميم حتى يذوب اللحم ويبقى العظم والعينان في الرأس وهي كالتي يقول الله تعالى \"في الحميم ثم في النار يسجرون\" والحميم الآن يعني الحار وعن القرظي رواية أخرى \"حميم آن\" أي حاضر وهو قول ابن زيد أيضا والحاضر لا ينافي ما روي عن القرظي أولا أنه الحار كقوله تعالى \"تسقى من عين آنية\" أي حاضرة شديدة الحر لا تستطاع وكقوله \"غير ناظرين إناه\" يعني استواءه ونضجه فقوله \"حميم آن\" أي حميم حار جدا. ولما كان معاقبة العصاة المجرمين وتنعيم المتقين من فضله ورحمته وعدله ولطفه بخلقه وكان إنذاره لهم عن عذابه وبأسه مما يزجرهم عما هم فيه من الشرك والمعاصي وغير ذلك قال ممتنا بذلك على بريته."
    },
    {
      "ayah": 45,
      "surah": 55,
      "text": "أي فبأي الآلاء يا معشر الثقلين من الإنس الجن تكذبان؟ قاله مجاهد وغير واحد ويدل عليه السياق بعده أي النعم ظاهرة عليكم وأنتم مغمورون بها لا تستطيعون إنكارها ولا جحودها فنحن نقول كما قالت الجن المؤمنون به اللهم ولا بشيء من آلائك ربنا نكذب فلك الحمد وكان ابن عباس يقول لا بأيها يا رب أي لا نكذب بشيء منها قال الإمام أحمد حدثنا يحيى بن إسحاق حدثنا ابن لهيعة عن أبي الأسود عن عروة عن أسماء بنت أبي بكر قالت سمعت رسول الله صلى الله عليه وسلم وهو يقرأ وهو يصلي نحو الركن قبل أن يصدع بما يؤمر والمشركون يستمعون \"فبأي آلاء ربكما تكذبان\"."
    },
    {
      "ayah": 46,
      "surah": 55,
      "text": "قال ابن شوذب وعطاء الخراساني نزلت هذه الآية \"ولمن خاف مقام ربه جنتان\" في أبي بكر الصديق وقال ابن أبي حاتم حدثنا أبي حدثنا محمد بن مصفى حدثنا بقية عن أبي بكر بن أبي مريم عن عطية بن قيس في قوله تعالى \"ولمن خاف مقام ربه جنتان\" نزلت في الذي قال أحرقوني بالنار لعلي أضل الله قال تاب يوما وليلة بعد أن تكلم بهذا فقبل الله منه وأدخله الجنة والصحيح أن هذه الآية عامة كما قاله ابن عباس وغيره يقول الله تعالى \"ولمن خاف مقام ربه\" بين يدي الله عز وجل يوم القيامة \"ونهى النفس عن الهوى\" ولم يطع ولا آثر الحياة الدنيا وعلم أن الآخرة خير وأبقى فأدى فرائض الله واجتنب محارمه فله يوم القيامة عند ربه جنتان كما قال البخاري رحمه الله حدثنا عبدالله بن أبي الأسود حدثنا عبدالعزيز بن عبدالصمد العمي حدثنا أبو عمران الجوني عن أبي بكر بن عبدالله بن قيس عن أبيه أن رسول الله صلى الله عليه وسلم قال \"جنتان من فضة آنيتهما وما فيهما وجنتان من ذهب آنيتهما وما فيهما وما بين القوم وبين أن ينظروا إلى ربهم عز وجل إلا رداء الكبرياء على وجهه في جنة عدن\" وأخرجه بقية الجماعة إلا أبا داود من حديث عبدالعزيز به. وقال حماد بن سلمة عن ثابت عن أبي بكر بن أبي موسى عن أبيه قال حماد ولا أعلمه إلا قد رفعه في قوله تعالى \"ولمن خاف مقام ربه جنتان\" وفي قوله \"ومن دونهما جنتان\" \"جنتان من ذهب للمقربين وجنتان من ورق لأصحاب اليمين\" وقال ابن جرير حدثنا زكريا بن يحيى بن أبان المقري حدثنا ابن أبي مريم أخبرنا محمد بن جعفر عن محمد بن حرملة عن عطاء بن يسار أخبرني أبو الدرداء أن رسول الله صلى الله عليه وسلم قرأ يوما هذه الآية \"ولمن خاف مقام ربه جنتان\" فقلت وإن زنى وإن سرق؟ فقال \"ولمن خاف مقام ربه جنتان فقلت وإن زنى وإن سرق؟ فقال ولمن خاف مقام ربه جنتان\" فقلت وإن زنى وإن سرق يا رسول الله؟ فقال \"وإن رغم أنف أبي الدرداء\" ورواه النسائي من حديث محمد بن أبي حرملة به ورواه النسائي أيضاً عن مؤمل بن هشام عن إسماعيل عن الجريري عن موسى عن محمد بن سعد بن أبي وقاص عن أبي الدرداء به وقد روي موقوفا على أبي الدرداء وروي عنه أنه قال: إن من خاف مقام ربه ولم يزن ولم يسرق. وهذه الآية عامة في الإنس والجن فهي من أدل دليل على أن الجن يدخلون الجنة إذا آمنوا واتقوا ولهذا امتن الله تعالى على الثقلين بهذا الجزاء فقال \"ولمن خاف مقام ربه جنتان فبأي آلاء ربكما تكذبان\" ومما يتعلق بقوله تعالى \"ولمن خاف مقام ربه جنتان\" ما رواه الترمذي والبغوي من حديث أبي النضر بن هاشم بن القاسم عن أبي عقيل الثقفي عن أبي فروة يزيد بن سنان الرهاوي عن بكر بن فيروز عن أبي هريرة قال: قال رسول الله صلى الله عليه وسلم \"من خاف أدلج ومن أدلج بلغ المنزل ألا إن سلعة الله غالية ألا إن سلعة الله الجنة\" ثم قال الترمذي غريب لا نعرفه إلا من حديث أبي النضر وروى البغوي من حديث علي بن حجر عن إسماعيل بن جعفر عن محمد بن أبي حرملة مولى حويطب بن عبدالعزى عن عطاء بن يسار عن أبي الدرداء أنه سمع رسول الله صلى الله عليه وسلم يقص على المنبر وهو يقول \"ولمن خاف مقام ربه جنتان\" قلت وإن زنى وإن سرق يا رسول الله؟ فقال رسول الله صلى الله عليه وسلم \"ولمن خاف مقام ربه جنتان\" فقلت الثانية وإن زنى وإن سرق يا رسول الله؟ فقال \"ولمن خاف مقام ربه جنتان\" فقلت الثالثة وإن زنى وإن سرق يا رسول الله؟ قال \"وإن رغم أنف أبي الدرداء\"."
    },
    {
      "ayah": 47,
      "surah": 55,
      "text": "أي فبأي الآلاء يا معشر الثقلين من الإنس الجن تكذبان؟ قاله مجاهد وغير واحد ويدل عليه السياق بعده أي النعم ظاهرة عليكم وأنتم مغمورون بها لا تستطيعون إنكارها ولا جحودها فنحن نقول كما قالت الجن المؤمنون به اللهم ولا بشيء من آلائك ربنا نكذب فلك الحمد وكان ابن عباس يقول لا بأيها يا رب أي لا نكذب بشيء منها قال الإمام أحمد حدثنا يحيى بن إسحاق حدثنا ابن لهيعة عن أبي الأسود عن عروة عن أسماء بنت أبي بكر قالت سمعت رسول الله صلى الله عليه وسلم وهو يقرأ وهو يصلي نحو الركن قبل أن يصدع بما يؤمر والمشركون يستمعون \"فبأي آلاء ربكما تكذبان\"."
    },
    {
      "ayah": 48,
      "surah": 55,
      "text": "ثم نعت هاتين الجنتين فقال \"ذواتا أفنان\" أي أغصان نضرة حسنة تحمل من كل ثمرة نضيجه فائقة \"فبأي آلاء ربكما تكذبان\" هكذا قال عطاء الخراساني وجماعة أن الأفنان أغصان الشجر يمس بعضها بعضا وقال ابن أبي حاتم حدثنا أبي حدثنا عمرو بن علي حدثنا مسلم بن قتيبة حدثنا عبدالله بن النعمان سمعت عكرمة يقول ظل الأغصان عل الحيطان ألم تسمع قول الشاعر ما هاج شوقك من هديل حمامة تدعو على فنن الغصون حماما تدعو أبا فرخين صادف طاويا ذا مخلبين من الصقور قطاما وحكى البغوي عن مجاهد وعكرمة والضحاك والكلبي أنه الغصن المستقيم وحدثنا أبو سعيد الأشج حدثنا عبد السلام ابن حرب حدثنا عطاء بن السائب عن سعيد بن جبير عن ابن عباس ذواتا أفنان ذواتا ألوان قال وروي عن سعيد بن جبير والحسن والسدي وخصيف والنضر بن عربي وابن سنان مثل ذلك ومعنى هذا القول أن فيهما فنونا من الملاذ واختاره ابن جرير وقال عطاء كل غصن يجمع فنونا من الفاكهة وقال الربيع بن أنس \"ذواتا أفنان\" واسعتا الفناء وكل هذه الأقوال صحيحة ولا منافاة بينها والله أعلم وقال قتادة ذواتا أفنان يعني بسعتها وفضلها ومزيتها على ما سواها وقال محمد بن إسحاق عن يحيى بن عباد بن عبدالله بن الزبير عن أبيه عن أسماء بنت أبي بكر قالت سمعت رسول الله وذكر سدرة المنتهى فقال \"يسير في ظل الفنن منها الراكب مائة سنة - أو قال - يستظل في ظل الفنن منها مائة راكب فيها فراش الذهب كأن ثمرها القلال\" ورواه الترمذي من حديث يونس بن بكر وقال حماد بن سلمة عن ثابت عن أبي بكر بن أبى موسى عن أبيه قال حماد ولا أعلمه إلا قدر رفعه في قوله \"ولمن خاف مقام ربه جنتان\" وفي قوله \"ومن دونهما جنتان\" قال جنتان من ذهب للمقربين وجنتان من ورق لأصحاب."
    },
    {
      "ayah": 49,
      "surah": 55,
      "text": "أي فبأي الآلاء يا معشر الثقلين من الإنس الجن تكذبان؟ قاله مجاهد وغير واحد ويدل عليه السياق بعده أي النعم ظاهرة عليكم وأنتم مغمورون بها لا تستطيعون إنكارها ولا جحودها فنحن نقول كما قالت الجن المؤمنون به اللهم ولا بشيء من آلائك ربنا نكذب فلك الحمد وكان ابن عباس يقول لا بأيها يا رب أي لا نكذب بشيء منها قال الإمام أحمد حدثنا يحيى بن إسحاق حدثنا ابن لهيعة عن أبي الأسود عن عروة عن أسماء بنت أبي بكر قالت سمعت رسول الله صلى الله عليه وسلم وهو يقرأ وهو يصلي نحو الركن قبل أن يصدع بما يؤمر والمشركون يستمعون \"فبأي آلاء ربكما تكذبان\"."
    },
    {
      "ayah": 5,
      "surah": 55,
      "text": "وقوله تعالى \"الشمس والقمر بحسبان\" أي يجريان متعاقبين بحساب مقنن لا يختلف ولا يضطرب \"لاالشمس ينبغي لها أن تدرك القمر ولاالليل سابق النهار وكل في فلك يسبحون\" وقال تعالى \"فالق الإصباح وجعل الليل سكنا والشمس والقمر حسبانا ذلك تقدير العزيز العليم\" وعن عكرمة أنه قال لو جعل الله نور جميع أبصار الإنس والجن والدواب والطير في عيني عبد ثم كشف حجابا واحدا من سبعين حجابا دون الشمس لما استطاع أن ينظر إليها ونور الشمس جزء من سبعين جزءا من نور الكرسي ونور الكرسي جزء من سبعين جزءا من نور العرش ونور العرش جزء من سبعين جزءا من نور الستر فانظر ماذا أعطى الله عبده من النور في عينيه وقت النظر إلى وجه ربه الكريم عيانا؟ رواه ابن أبي حاتم."
    },
    {
      "ayah": 50,
      "surah": 55,
      "text": "اليمين \"فيهما عينان تجريان\" أي تسرحان لسقي تلك الأشجار والأغصان فتثمر من جميع الألوان \"فبأي آلاء ربكما تكذبان\" قال الحسن البصري إحداهما يقال لها تسنيم والأخرى السلسبيل. وقال عطية إحداهما من ماء غير آسن والأخرى من خمر لذة للشاربين."
    },
    {
      "ayah": 51,
      "surah": 55,
      "text": "أي فبأي الآلاء يا معشر الثقلين من الإنس الجن تكذبان؟ قاله مجاهد وغير واحد ويدل عليه السياق بعده أي النعم ظاهرة عليكم وأنتم مغمورون بها لا تستطيعون إنكارها ولا جحودها فنحن نقول كما قالت الجن المؤمنون به اللهم ولا بشيء من آلائك ربنا نكذب فلك الحمد وكان ابن عباس يقول لا بأيها يا رب أي لا نكذب بشيء منها قال الإمام أحمد حدثنا يحيى بن إسحاق حدثنا ابن لهيعة عن أبي الأسود عن عروة عن أسماء بنت أبي بكر قالت سمعت رسول الله صلى الله عليه وسلم وهو يقرأ وهو يصلي نحو الركن قبل أن يصدع بما يؤمر والمشركون يستمعون \"فبأي آلاء ربكما تكذبان\"."
    },
    {
      "ayah": 52,
      "surah": 55,
      "text": "أي من جميع أنواع الثمار مما يعلمون وخير مما يعلمون ومما لا عين رأت ولا أذن سمعت ولا خطر على قلب بشر \"فبأي آلاء ربكما تكذبان\" قال إبراهيم بن الحكم بن أبان عن أبيه عن عكرمة عن ابن عباس ما في الدنيا ثمرة حلوة ولا مرة إلا وهي في الجنة حتى الحنظل وقال ابن عباس ليس في الدنيا مما في الآخرة إلا الأسماء يعني أن بين ذلك بونا عظيما وفرقا بينا في التفاضل."
    },
    {
      "ayah": 53,
      "surah": 55,
      "text": "أي فبأي الآلاء يا معشر الثقلين من الإنس الجن تكذبان؟ قاله مجاهد وغير واحد ويدل عليه السياق بعده أي النعم ظاهرة عليكم وأنتم مغمورون بها لا تستطيعون إنكارها ولا جحودها فنحن نقول كما قالت الجن المؤمنون به اللهم ولا بشيء من آلائك ربنا نكذب فلك الحمد وكان ابن عباس يقول لا بأيها يا رب أي لا نكذب بشيء منها قال الإمام أحمد حدثنا يحيى بن إسحاق حدثنا ابن لهيعة عن أبي الأسود عن عروة عن أسماء بنت أبي بكر قالت سمعت رسول الله صلى الله عليه وسلم وهو يقرأ وهو يصلي نحو الركن قبل أن يصدع بما يؤمر والمشركون يستمعون \"فبأي آلاء ربكما تكذبان\"."
    },
    {
      "ayah": 54,
      "surah": 55,
      "text": "يقول تعالى \"متكئين\" يعني أهل الجنة والمراد بالاتكاء ههنا الاضطجاع ويقال الجلوس على صفة التربيع \"على فرش بطائنها من إستبرق\" وهو ما غلظ من الديباج قاله عكرمة والضحاك وقتادة وقال أبو عمران الجوني هو الديباج المزين بالذهب فنبه على شرف الظهارة بشرف البطانة فهذا من التنبيه بالأدنى على الأعلى قال أبو إسحاق عن هبيرة بن مريم عن عبدالله بن مسعود قال: هذه البطائن فكيف لو رأيتم الظواهر؟ وقال مالك بن دينار بطائنها من إستبرق وظواهرها من نور وقال سفيان الثوري أو شريك بطائنها من إستبرق وظواهرها من نور جامد وقال القاسم بن محمد بطائنها من استبرق وظواهرها من الرحمة وقال ابن شوذب عن أبي عبدالله الشامي ذكر الله البطائن ولم يذكر الظواهر وعلى الظواهر المحابس ولا يعلم ما تحت المحابس إلا الله تعالى ذكر ذلك كله الإمام ابن أبي حاتم رحمه الله \"وجنى الجنتين دان\" أي ثمرهما قريب إليهم متى شاءوا تناولوه على أي صفة كانوا كما قال تعالى \"قطوفها دانية\" وقال \"ودانية عليهم ظلالها وذللت قطوفها تذليلا\" أي لا تمتنع ممن تناولها بل تنحط إليه من أغصانها."
    },
    {
      "ayah": 55,
      "surah": 55,
      "text": "أي فبأي الآلاء يا معشر الثقلين من الإنس الجن تكذبان؟ قاله مجاهد وغير واحد ويدل عليه السياق بعده أي النعم ظاهرة عليكم وأنتم مغمورون بها لا تستطيعون إنكارها ولا جحودها فنحن نقول كما قالت الجن المؤمنون به اللهم ولا بشيء من آلائك ربنا نكذب فلك الحمد وكان ابن عباس يقول لا بأيها يا رب أي لا نكذب بشيء منها قال الإمام أحمد حدثنا يحيى بن إسحاق حدثنا ابن لهيعة عن أبي الأسود عن عروة عن أسماء بنت أبي بكر قالت سمعت رسول الله صلى الله عليه وسلم وهو يقرأ وهو يصلي نحو الركن قبل أن يصدع بما يؤمر والمشركون يستمعون \"فبأي آلاء ربكما تكذبان\"."
    },
    {
      "ayah": 56,
      "surah": 55,
      "text": "قال بعد ذلك \"فيهن\" أي في الفرش \"قاصرات الطرف\" أي غضيضات عن غير أزواجهن فلا يرين شيئا في الجنة أحسن من أزواجهن قاله ابن عباس وقتادة وعطاء الخراساني وابن زيد وقد ورد أن الواحدة منهن تقول لبعلها والله ما أرى في الجنة شيئا أحسن منك ولا في الجنة شيئا أحب إلي منك فالحمد لله الذي جعلك لي وجعلني لك \"لم يطمثهن إنس قبلهم ولا جان\" أي بل هن أبكار عرب أتراب لم يطأهن أحد قبل أزواجهن من الإنس والجن وهذه أيضا من الأدلة على دخول مؤمني الجن الجنة. قال أرطاة بن المنذر سئل ضمرة بن حبيب هل يدخل الجن الجنة؟ قال نعم وينكحون للجن جنيات وللإنس إنسيات وذلك قوله\"لم يطمثهن إنس قبلهم ولا جان فبأي آلاء ربكما تكذبان\"."
    },
    {
      "ayah": 57,
      "surah": 55,
      "text": "أي فبأي الآلاء يا معشر الثقلين من الإنس الجن تكذبان؟ قاله مجاهد وغير واحد ويدل عليه السياق بعده أي النعم ظاهرة عليكم وأنتم مغمورون بها لا تستطيعون إنكارها ولا جحودها فنحن نقول كما قالت الجن المؤمنون به اللهم ولا بشيء من آلائك ربنا نكذب فلك الحمد وكان ابن عباس يقول لا بأيها يا رب أي لا نكذب بشيء منها قال الإمام أحمد حدثنا يحيى بن إسحاق حدثنا ابن لهيعة عن أبي الأسود عن عروة عن أسماء بنت أبي بكر قالت سمعت رسول الله صلى الله عليه وسلم وهو يقرأ وهو يصلي نحو الركن قبل أن يصدع بما يؤمر والمشركون يستمعون \"فبأي آلاء ربكما تكذبان\"."
    },
    {
      "ayah": 58,
      "surah": 55,
      "text": "ينعتهن للخطاب \"كأنهن الياقوت والمرجان\" قال مجاهد والحسن وابن زيد وغيرهم في صفاء الياقوت وبياض المرجان فجعلوا المرجان ههنا اللؤلؤ. وقال ابن أبي حاتم حدثنا محمد بن حاتم حدثنا عبيد بن حميد عن عطاء بن السائب عن عمرو بن ميمون الأودي عن عبدالله بن مسعود عن النبي صلى الله عليه وسلم قال \"إن المرأة من نساء أهل الجنة ليرى بياض ساقها من وراء سبعين حلة من حرير حتى يرى مخها\" وذلك قول الله تعالى \"كأنهن الياقوت والمرجان\" فأما الياقوت فإنه حجر لو أدخلت فيه سلكا ثم استصفيته لرأيته من ورائه وهكذا رواه الترمذي من حديث عبيدة بن حميد وأبي الأحوص عن عطاء بن السائب به ورواه موقوفا ثم قال وهو أصح. وقال الإمام أحمد حدثنا عفان حدثنا حماد بن سلمة أخبرنا يونس عن محمد بن سيرين عن أبي هريرة عن النبي صلى الله عليه وسلم قال \"للرجل من أهل الجنة زوجتان من الحور العين على كل واحدة سبعون حلة يرى مخ ساقها من وراء الثياب\" تفرد به الإمام أحمد من هذا الوجه وقد روى مسلم حديث إسماعيل بن علية عن أيوب عن محمد بن سيرين قال إما تفاخروا وإما تذكروا الرجال أكثر فى الجنة أم النساء؟ فقال أبو هريرة أو لم يقل أبو القاسم صلى الله عليه وسلم \"إن أول زمرة تدخل الجنة على صورة القمر ليلة البدر والتي تليها على ضوء كوكب دري في السماء لكل امرىء منهم زوجتان اثنتان يرى مخ ساقهما من وراء اللحم وما في الجنة أعزب\" وهذا الحديث مخرج في الصحيحين من حديث همام بن منبه وأبي زرعة عن أبي هريرة رضي الله عنه. وقال الإمام أحمد حدثنا أبو النضر حدثنا محمد بن طلحة عن حميد عن أنس أن رسول الله صلى الله عليه وسلم قال \"لغدوة في سبيل الله أو روحة خير من الدنيا وما فيها ولقاب قوس أحدكم أو موضع قده - يعني سوطه - من الجنة خير من الدنيا وما فيها ولو اطلعت امرأة من نساء أهل الجنة إلى الأرض لملأت ما بينهما ريحا ولطاب ما بينهما ولنصيفها على رأسها خير من الدنيا وما فيها\" ورواه البخاري من حديث أبي إسحاق عن حميد عن أنس بنحوه."
    },
    {
      "ayah": 59,
      "surah": 55,
      "text": "أي فبأي الآلاء يا معشر الثقلين من الإنس الجن تكذبان؟ قاله مجاهد وغير واحد ويدل عليه السياق بعده أي النعم ظاهرة عليكم وأنتم مغمورون بها لا تستطيعون إنكارها ولا جحودها فنحن نقول كما قالت الجن المؤمنون به اللهم ولا بشيء من آلائك ربنا نكذب فلك الحمد وكان ابن عباس يقول لا بأيها يا رب أي لا نكذب بشيء منها قال الإمام أحمد حدثنا يحيى بن إسحاق حدثنا ابن لهيعة عن أبي الأسود عن عروة عن أسماء بنت أبي بكر قالت سمعت رسول الله صلى الله عليه وسلم وهو يقرأ وهو يصلي نحو الركن قبل أن يصدع بما يؤمر والمشركون يستمعون \"فبأي آلاء ربكما تكذبان\"."
    },
    {
      "ayah": 6,
      "surah": 55,
      "text": "قال ابن جرير اختلف المفسرون في معنى قوله والنجم بعد إجماعهم على أن الشجر ما قام على ساق فروى عن ابن أبي طلحة عن ابن عباس رضي الله عنهما قال النجم ما انبسط على وجه الأرض يعني من النبات وكذا قال سعيد بن جبير والسدي وسفيان الثوري وقد اختاره ابن جرير رحمه الله تعالى وقال مجاهد النجم الذي في السماء وكذا قال الحسن وقتادة وهذا القول هو الأظهر والله أعلم لقوله تعالى \"ألم تر أن الله يسجد له من في السموات ومن في الأرض والشمس والقمر والنجوم والجبال والشجر والدواب وكثير من الناس\"."
    },
    {
      "ayah": 60,
      "surah": 55,
      "text": "وقوله تعالى \"هل جزاء الإحسان إلا الإحسان\" أي لا لمن أحسن العمل في الدنيا إلا الإحسان إليه في الآخرة كما قال تعالى \"للذين أحسنوا الحسنى وزيادة\" وقال البغوي حدثنا أبو سعيد الشريحي حدثنا أبو إسحاق الثعلبي أخبرني ابن منجويه حدثنا ابن شيبة حدثنا إسحاق بن إبراهيم بن بهرام حدثنا الحجاج بن يوسف المكتب حدثنا بشر بن الحسين عن الزيبر بن عدي عن أنس بن مالك قال قرأ رسول الله صلى الله عليه وسلم \"هل جزاء الإ حسان إلا الإحسان\" وقال \"هل تدرون ما قال ربكم؟ \" قالوا الله ورسوله أعلم قال \"يقول هل جزاء من أنعمت عليه بالتوحيد إلا الجنة\" ولما كان في الذي ذكر نعم عظيمة لا يقاومها عمل بل مجرد تفضل وامتنان."
    },
    {
      "ayah": 61,
      "surah": 55,
      "text": "أي فبأي الآلاء يا معشر الثقلين من الإنس الجن تكذبان؟ قاله مجاهد وغير واحد ويدل عليه السياق بعده أي النعم ظاهرة عليكم وأنتم مغمورون بها لا تستطيعون إنكارها ولا جحودها فنحن نقول كما قالت الجن المؤمنون به اللهم ولا بشيء من آلائك ربنا نكذب فلك الحمد وكان ابن عباس يقول لا بأيها يا رب أي لا نكذب بشيء منها قال الإمام أحمد حدثنا يحيى بن إسحاق حدثنا ابن لهيعة عن أبي الأسود عن عروة عن أسماء بنت أبي بكر قالت سمعت رسول الله صلى الله عليه وسلم وهو يقرأ وهو يصلي نحو الركن قبل أن يصدع بما يؤمر والمشركون يستمعون \"فبأي آلاء ربكما تكذبان\"."
    },
    {
      "ayah": 62,
      "surah": 55,
      "text": "هاتان الجنتان دون اللتين قبلهما في المرتبة والفضيلة والمنزلة بنص القرآن قال الله تعالى \"ومن دونهما جنتان\" وقد تقدم في الحديث جنتان من ذهب آنيتهما وما فيهما وجنتان من فضة آنيتهما وما فيهما فالأوليان للمقربين والأخريان لأصحاب اليمين وقال أبو موسى: جنتان من ذهب للمقربين وجنتان من فضة لأصحاب اليمين وقال ابن عباس \"ومن دونهما جنتان\" من دونهما في الدرج وقال ابن زيد من دونهما في الفضل. والدليل على شرف الأوليين على الأخريين وجوه \"أحدها\" أنه نعت الأوليين قبل هاتين والتقديم يدل على الاعتناء ثم قال \"ومن دونهما جنتان\" وهذا ظاهر في شرف التقدم وعلوه على الثاني وقال هناك \"ذواتا أفنان\" وهي الأغصان أو الفنون في الملاذ وقال ههنا \"مدهامتان\" أي سوداوان من شدة الري من الماء قال ابن عباس فى قوله \"مدهامتان\" قد اسودتا من الخضرة من شدة الري من الماء وقال ابن أبي حاتم حدثنا أبو سعيد الأشج حدثنا ابن فضيل حدثنا عطاء بن السائب عن سعيد بن جبير عن ابن عباس \"مدهامتان\" قال خضراوان وروى عن أبي أيوب الأنصاري وعبدالله بن الزبير وعبدالله بن أبي أوفى وعكرمة وسعيد بن جبير ومجاهد في إحدى الروايات وعطاء وعطية العوفي والحسن البصري ويحيى بن رافع وسفيان الثوري نحو ذلك. وقال محمد بن كعب \"مدهامتان\" ممتلئتان من الخضرة وقال قتادة خضراوان من الري ناعمتان ولا شك في نضارة الأغصان على الأشجـار المشتبكة بعضها في بعض."
    },
    {
      "ayah": 63,
      "surah": 55,
      "text": "أي فبأي الآلاء يا معشر الثقلين من الإنس الجن تكذبان؟ قاله مجاهد وغير واحد ويدل عليه السياق بعده أي النعم ظاهرة عليكم وأنتم مغمورون بها لا تستطيعون إنكارها ولا جحودها فنحن نقول كما قالت الجن المؤمنون به اللهم ولا بشيء من آلائك ربنا نكذب فلك الحمد وكان ابن عباس يقول لا بأيها يا رب أي لا نكذب بشيء منها قال الإمام أحمد حدثنا يحيى بن إسحاق حدثنا ابن لهيعة عن أبي الأسود عن عروة عن أسماء بنت أبي بكر قالت سمعت رسول الله صلى الله عليه وسلم وهو يقرأ وهو يصلي نحو الركن قبل أن يصدع بما يؤمر والمشركون يستمعون \"فبأي آلاء ربكما تكذبان\"."
    },
    {
      "ayah": 64,
      "surah": 55,
      "text": "أي سوداوان من شدة الري من الماء قال ابن عباس في قوله \"مدهمتان\" قد اسودتا من الخضرة من شدة الري من الماء وقال أبي أبي حاتم حدثنا أبو سعيد الأشجع حدثنا لبن فضيل حدثنا عطاء بن السائب عن سعيد بن جبير عن ابن عباس \"مدهمتان\" قال خضراوان وروي عن أبي أيوب الأنصاري وعبدالله بن الزبير وعبدالله بن أبي أوفى وعكرمة وسعيد بن جبير ومجاهد في إحدى الروايات وعطاء وعطية العوفي والحسن البصري ويحيى بن رافع وسفيان الثوري نحو ذلك. وقال محمد بن كعب \"مدهامتان\" ممتلئتان من الخضرة وقال قتادة خضراوان من الري ناعمتان ولا شك في نضارة الأغصان على الأشجـار المشتبكة بعضها في بعض."
    },
    {
      "ayah": 65,
      "surah": 55,
      "text": "أي فبأي الآلاء يا معشر الثقلين من الإنس الجن تكذبان؟ قاله مجاهد وغير واحد ويدل عليه السياق بعده أي النعم ظاهرة عليكم وأنتم مغمورون بها لا تستطيعون إنكارها ولا جحودها فنحن نقول كما قالت الجن المؤمنون به اللهم ولا بشيء من آلائك ربنا نكذب فلك الحمد وكان ابن عباس يقول لا بأيها يا رب أي لا نكذب بشيء منها قال الإمام أحمد حدثنا يحيى بن إسحاق حدثنا ابن لهيعة عن أبي الأسود عن عروة عن أسماء بنت أبي بكر قالت سمعت رسول الله صلى الله عليه وسلم وهو يقرأ وهو يصلي نحو الركن قبل أن يصدع بما يؤمر والمشركون يستمعون \"فبأي آلاء ربكما تكذبان\"."
    },
    {
      "ayah": 66,
      "surah": 55,
      "text": "أي فياضتان والجري أقوى من النضخ وقال الضحاك \"نضاختان\" أي ممتلئتان ولا تنقطعان."
    },
    {
      "ayah": 67,
      "surah": 55,
      "text": "أي فبأي الآلاء يا معشر الثقلين من الإنس الجن تكذبان؟ قاله مجاهد وغير واحد ويدل عليه السياق بعده أي النعم ظاهرة عليكم وأنتم مغمورون بها لا تستطيعون إنكارها ولا جحودها فنحن نقول كما قالت الجن المؤمنون به اللهم ولا بشيء من آلائك ربنا نكذب فلك الحمد وكان ابن عباس يقول لا بأيها يا رب أي لا نكذب بشيء منها قال الإمام أحمد حدثنا يحيى بن إسحاق حدثنا ابن لهيعة عن أبي الأسود عن عروة عن أسماء بنت أبي بكر قالت سمعت رسول الله صلى الله عليه وسلم وهو يقرأ وهو يصلي نحو الركن قبل أن يصدع بما يؤمر والمشركون يستمعون \"فبأي آلاء ربكما تكذبان\"."
    },
    {
      "ayah": 68,
      "surah": 55,
      "text": "وقال ههنا \"فيهما فاكهة ونخل ورمان\" ولا شك أن الأولى أعم وأكثر في الأفراد والتنويع على فاكهة وهي نكرة في سياق الإثبات لا تعم ولهذا ليس قوله \"ونخل ورمان\" من باب عطف الخاص على العام كما قرره البخاري وغيره وإنما أفرد النخل والرمان بالذكر لشرفهما على غيرهما. قال عبد بن حميد حدثنا يحيى بن عبدالحميد حدثنا حصين بن عمر حدثنا مخارق عن طارق بن سهل عن شهاب عن عمر بن الخطاب قال جاء أناس من اليهود إلى رسول الله صلى الله عليه وسلم فقالوا يا محمد أفي الجنة فاكهة؟ قال \"نعم فيها فاكهة ونخل ورمان\" قالوا أفيأكلون كما يأكلون في الدنيا؟ \"قال نعم وأضعاف\" قالوا فيقضون الحوائج؟ قال \"لا ولكنهم يعرقون ويرشحون فيذهب الله ما في بطونهم من أذى\" وقال ابن أبي حاتم حدثنا أبي حدثنا الفضيل بن دكين حدثنا سفيان عن حماد عن سعيد بن جبير عن ابن عباس قال نخل الجنة سعفها كسوة لأهل الجنة منها مقطعاتهم ومنها حللهم وكربها ذهب أحمر وجذوعها زمرد أخضر وثمرها أحلى من العسل وألين من الزبد وليس له عجم. وحدثنا أبي حدثنا موسى بن إسماعيل حدثنا حماد هو أبن سلمة عن أبي هارون عن أبي سعيد الخدري أن رسول الله صلى الله عليه وسلم قال \"نظرت إلى الجنة فإذا الرمانة من رمانها كالبعير المقتب\"."
    },
    {
      "ayah": 69,
      "surah": 55,
      "text": "أي فبأي الآلاء يا معشر الثقلين من الإنس الجن تكذبان؟ قاله مجاهد وغير واحد ويدل عليه السياق بعده أي النعم ظاهرة عليكم وأنتم مغمورون بها لا تستطيعون إنكارها ولا جحودها فنحن نقول كما قالت الجن المؤمنون به اللهم ولا بشيء من آلائك ربنا نكذب فلك الحمد وكان ابن عباس يقول لا بأيها يا رب أي لا نكذب بشيء منها قال الإمام أحمد حدثنا يحيى بن إسحاق حدثنا ابن لهيعة عن أبي الأسود عن عروة عن أسماء بنت أبي بكر قالت سمعت رسول الله صلى الله عليه وسلم وهو يقرأ وهو يصلي نحو الركن قبل أن يصدع بما يؤمر والمشركون يستمعون \"فبأي آلاء ربكما تكذبان\"."
    },
    {
      "ayah": 7,
      "surah": 55,
      "text": "يعني العدل كما قال تعالى \"لقد أرسلنا رسلنا بالبينات وأنزلنا معهم الكتاب والميزان ليقوم الناس بالقسط\" وهكذا قال ههنا."
    },
    {
      "ayah": 70,
      "surah": 55,
      "text": "المراد خيرات كثيرة حسنة في الجنة قاله قتادة وقيل خيرات جمع خيرة وهي المرأة الصالحة الحسنة الخلق الحسنة الوجه قاله الجمهور وروي مرفوعا عن أم سلمة وفي الحديث الآخر الذي سنورده في سورة الواقعة إن شاء الله تعالى أن الحور العين يغنين: نحن الخيرات الحسان خلقنا لأزواج كرام ولهذا قرأ بعضهم \"فيهن خيرات\" بالتشديد \"حـسان فبأي آلاء ربكما تكذبان\"."
    },
    {
      "ayah": 71,
      "surah": 55,
      "text": "أي فبأي الآلاء يا معشر الثقلين من الإنس الجن تكذبان؟ قاله مجاهد وغير واحد ويدل عليه السياق بعده أي النعم ظاهرة عليكم وأنتم مغمورون بها لا تستطيعون إنكارها ولا جحودها فنحن نقول كما قالت الجن المؤمنون به اللهم ولا بشيء من آلائك ربنا نكذب فلك الحمد وكان ابن عباس يقول لا بأيها يا رب أي لا نكذب بشيء منها قال الإمام أحمد حدثنا يحيى بن إسحاق حدثنا ابن لهيعة عن أبي الأسود عن عروة عن أسماء بنت أبي بكر قالت سمعت رسول الله صلى الله عليه وسلم وهو يقرأ وهو يصلي نحو الركن قبل أن يصدع بما يؤمر والمشركون يستمعون \"فبأي آلاء ربكما تكذبان\"."
    },
    {
      "ayah": 72,
      "surah": 55,
      "text": "ثم قال \"حور مقصورات في الخيام\" وهناك قال \"فيهن قاصرات الطرف\" ولا شك أن التي قد قصرت طرفها بنفسها أفضل ممن قصرت وإن كان الجميع مخدرات: قال ابن أبي حاتم حدثنا عمرو بن عبدالله الأودي حدثنا وكيع عن سفيان عن جابر عن القاسم بن أبي بزة عن أبي عبيدة عن مسروق عن عبدالله بن مسعود قال: إن لكل مسلم خيرة ولكل خيرة خيمة ولكل خيمة أربعة أبواب يدخل عليه كل يوم تحفة وكرامة وهديه لم تكن قبل ذلك لا مرحات ولا طمحات ولا بخرات ولا ذفرات حرر عين كأنهن بيض مكنون وقوله تعالى \"في الخيام\" قال البخاري حدثنا محمد بن المثنى حدثنا عبدالعزيز بن عبدالصمد حدثنا أبو عمران الجوني عن أبي بكر بن عبدالله بن قيس عن أبيه أن رسول الله صلى الله عليه وسلم قال \"إن في الجنة خيمة من لؤلؤة مجوفة عرضها ستون ميلا في كل زاوية منها أهل ما يرون الآخرين يطوف عليهم المؤمنون\" ورواه أيضا من حديث أبي عمران به وقال ثلاثون ميلا وأخرجه مسلم من حديث أبي عمران به ولفظه\" إن للمؤمن في الجنة لخيمة من لؤلؤة واحدة مجوفة طولها ستون ميلا للمؤمن فيها أهل يطوف عليهم المؤمن فلا يرى بعضهم بعضا\" وقال ابن أبي حاتم حدثنا الحسن بن أبي الربيع حدثنا عبدالرزاق أخبرنا معمر عن قتادة أخبرني خليـد العصري عن أبي الدرداء قال الخيمة لؤلؤة واحدة فيها سبعون بابا من در وحدثنا أبي حدثنا عيسى بن أبي فاطمة حدثنا جرير عن هشام عن محمد بن المثنى عن ابن عباس في قوله تعالى \"حور مقصورات في الخيام\" وقال في خيام اللؤلؤ وفي الجنة خيمة واحدة من لؤلؤة واحدة أربع فراسخ عليها أربعة آلاف مصراع من ذهب وقال عبدالله بن وهب أخبرنا عمرو أن دراجا أبا السمح حدثه عن أبي الهيثم عن أبي سعيد عن النبي صلى الله عليه وسلم قال \"أدنى أهل الجنة منزلة الذي له ثمانون ألف خادم واثنتان وسبعون زوجة وتنصب له قبة من لؤلؤ وزبرجد وياقوت كما بين الجابية وصنعاء\" ورواه الترمذي من حديث عمرو بن الحارث به."
    },
    {
      "ayah": 73,
      "surah": 55,
      "text": "أي فبأي الآلاء يا معشر الثقلين من الإنس الجن تكذبان؟ قاله مجاهد وغير واحد ويدل عليه السياق بعده أي النعم ظاهرة عليكم وأنتم مغمورون بها لا تستطيعون إنكارها ولا جحودها فنحن نقول كما قالت الجن المؤمنون به اللهم ولا بشيء من آلائك ربنا نكذب فلك الحمد وكان ابن عباس يقول لا بأيها يا رب أي لا نكذب بشيء منها قال الإمام أحمد حدثنا يحيى بن إسحاق حدثنا ابن لهيعة عن أبي الأسود عن عروة عن أسماء بنت أبي بكر قالت سمعت رسول الله صلى الله عليه وسلم وهو يقرأ وهو يصلي نحو الركن قبل أن يصدع بما يؤمر والمشركون يستمعون \"فبأي آلاء ربكما تكذبان\"."
    },
    {
      "ayah": 74,
      "surah": 55,
      "text": "أي فبأي الآلاء يا معشر الثقلين من الإنس الجن تكذبان؟ قاله مجاهد وغير واحد ويدل عليه السياق بعده أي النعم ظاهرة عليكم وأنتم مغمورون بها لا تستطيعون إنكارها ولا جحودها فنحن نقول كما قالت الجن المؤمنون به اللهم ولا بشيء من آلائك ربنا نكذب فلك الحمد وكان ابن عباس يقول لا بأيها يا رب أي لا نكذب بشيء منها قال الإمام أحمد حدثنا يحيى بن إسحاق حدثنا ابن لهيعة عن أبي الأسود عن عروة عن أسماء بنت أبي بكر قالت سمعت رسول الله صلى الله عليه وسلم وهو يقرأ وهو يصلي نحو الركن قبل أن يصدع بما يؤمر والمشركون يستمعون \"فبأي آلاء ربكما تكذبان\"."
    },
    {
      "ayah": 75,
      "surah": 55,
      "text": "أي فبأي الآلاء يا معشر الثقلين من الإنس الجن تكذبان؟ قاله مجاهد وغير واحد ويدل عليه السياق بعده أي النعم ظاهرة عليكم وأنتم مغمورون بها لا تستطيعون إنكارها ولا جحودها فنحن نقول كما قالت الجن المؤمنون به اللهم ولا بشيء من آلائك ربنا نكذب فلك الحمد وكان ابن عباس يقول لا بأيها يا رب أي لا نكذب بشيء منها قال الإمام أحمد حدثنا يحيى بن إسحاق حدثنا ابن لهيعة عن أبي الأسود عن عروة عن أسماء بنت أبي بكر قالت سمعت رسول الله صلى الله عليه وسلم وهو يقرأ وهو يصلي نحو الركن قبل أن يصدع بما يؤمر والمشركون يستمعون \"فبأي آلاء ربكما تكذبان\"."
    },
    {
      "ayah": 76,
      "surah": 55,
      "text": "وقوله تعالى \"متكئين على رفرف خضر وعبقري حسان\" قال علي بن أبي طلحة عن ابن عباس الرفرف المحابس. وكذا قال مجاهد وعكرمة والحسن وقتادة والضحاك وغيرهم هي المحابس وقال العلاء بن زيد الرفرف على السرير كهيئة المحابس المتدلي وقال عاصم الجحدري \"متكئين على رفرف خضر\" يعني الوسائد وهو قول الحسن البصرى في رواية عنه وقال أبو داود الطيالسي عن شعبة عن أبي بشر عن سعيد بن جبير في قوله تعالى \"متكئين على رفرف خضر\" قال الرفرف رياض الجنة وقوله تعالى \"وعبقري حسان\" قال ابن عباس وقتادة والضحاك والسدي: العبقري الزرابي: وقال سعيد بن جبير هي عتاق الزرابي يعني جيادها وقال مجاهد العبقري الديباج وسئل الحسن البصري عن قوله تعالى \"وعبقري حسان\" فقال هي بسط أهل الجنة لاأبا لكم فاطلبوها وعن الحسن رواية أنها المرافق وقال زيد بن أسلم العبقري أحمر وأصفر وأخضر وسئل العلاء بن زيد عن العبقري فقال البسط أسفل من ذلك. وقال أبو حرزة يعقوب بن مجاهد: العبقري من ثياب أهل الجنة لا يعرفه أحد وقال أبو العالية العبقري الطنافس المحملة إلى الرقة ما هي وقال القيسي كل ثوب موشى عند العرب عبقري وقال أبو عبيدة هو منسوب إلى أرض يعمل بها الوشي وقال الخليل بن أحمد كل شيء نفيس من الرجال وغير ذلك يسمى عند العرب عبقريا ومنه قول النبي صلى الله عليه وسلم في عمر \"فلم أر عبقرياً يفري فريه\" وعلى كل تقدير فصفة مرافق أهل الجنتين الأولتين أرفع وأعلى من هذه الصفة فإنه قد قال هناك \"متكئين على فرش بطائنها من إستبرق\" فنعت بطائن فرشهم وسكت عن ظهائرها اكتفاء بما مدح به البطائن بطريق الأولى والأحرى وتمام الخاتمة أنه قال بعد الصفات المتقدمة \"هل جزاء الإحسان إلا الإحسان\" فوصف أهلها بالإحسان وهو أعلى المراتب والنهايات كما في حديث جبريل لما سأل عن الإسلام ثم الإيمان ثم الإحسان فهذه وجوه عديدة في تفضيل الجنتين الأوليين على هاتين الأخيرتين ونسأل الله الكريم الوهاب أن يجعلنا من أهل الأوليين."
    },
    {
      "ayah": 77,
      "surah": 55,
      "text": "أي فبأي الآلاء يا معشر الثقلين من الإنس الجن تكذبان؟ قاله مجاهد وغير واحد ويدل عليه السياق بعده أي النعم ظاهرة عليكم وأنتم مغمورون بها لا تستطيعون إنكارها ولا جحودها فنحن نقول كما قالت الجن المؤمنون به اللهم ولا بشيء من آلائك ربنا نكذب فلك الحمد وكان ابن عباس يقول لا بأيها يا رب أي لا نكذب بشيء منها قال الإمام أحمد حدثنا يحيى بن إسحاق حدثنا ابن لهيعة عن أبي الأسود عن عروة عن أسماء بنت أبي بكر قالت سمعت رسول الله صلى الله عليه وسلم وهو يقرأ وهو يصلي نحو الركن قبل أن يصدع بما يؤمر والمشركون يستمعون \"فبأي آلاء ربكما تكذبان\"."
    },
    {
      "ayah": 78,
      "surah": 55,
      "text": "ثم قال \"تبارك اسم ربك ذي الجلال والإكرام\" أي هو أهل أن يجل فلا يعصى وأن يكرم فيعبد ويشكر فلا يكفر وأن يذكر فلا ينسى وقال ابن عباس \"ذي الجلال والإكرام\" ذي العظمة والكبرياء وقال الإمام أحمد حدثنا موسى بن داود حدثنا عبدالرحمن بن ثابت بن ثوبان عن عمير بن هانيء عن أبي العذراء عن أبي الدرداء قال: قال رسول الله صلى الله عليه وسلم \"أجلوا الله يغفر لكم\" وفي الحديث الآخر \"إن من إجلال الله إكرام ذي الشيبة المسلم وذي السلطان وحامل القرآن غير الغالي فيه ولا الجافي عنه\" وقال الحافظ أبو يعلى حدثنا أبو يوسف الحربي حدثنا مؤمل بن إسماعيل حدثنا حماد حدثنا حميد الطويل عن أنس أن رسول الله صلى الله عليه وسلم قال \"ألظوا بياذا الجلال والإكرام\" وكذا رواه الترمذي عن محمود بن غيلان عن مؤمل بن إسماعيل عن حماد بن سلمة به ثم قال غلط المؤمل فيه وهو غريب وليس بمحفوظ وإنما يروى هذا عن حماد بن سلمة عن حميد عن الحسن عن النبي صلى الله عليه وسلم. وقد قال الإمام أحمد حدثنا إبراهيم بن إسحاق حدثنا عبدالله بن المبارك عن يحيى بن حسان المقدسي عن ربيعة بن عامر قال: سمعت رسول الله صلى الله عليه وسلم يقول \"ألظوا بذي الجلال والإكرام\" ورواه النسائي من حديث عبدالله بن المبارك به وقال الجوهري ألظ فلان بفلان إذا لزمه وقول ابن مسعود ألظوا بياذا الجلال والإكرام أي الزموا يقال الإلظاظ هو الإلحاح \"قلت\" وكلاهما قريب من الآخر والله أعلم وهو المداومة واللزوم والإلحاح وفي صحيح مسلم والسنن الأربعة من حديث عبدالله بن الحارث عن عائشة قالت: كان رسول الله صلى الله عليه وسلم إذا سلم لا يقعد يعني بعد الصلاة إلا بقدر ما يقول \"اللهم أنت السلام ومنك السلام تباركت وتعاليت يا ذا الجلال والإكرام\". آخر تفسير سورة الرحمن والله الحمد والمنه."
    },
    { "ayah": 8, "surah": 55, "text": "أي خلق السموات والأرض بالحق والعدل لتكون الأشياء كلها بالحق والعدل." },
    {
      "ayah": 9,
      "surah": 55,
      "text": "أي لا تبخسوا الوزن بل زنوا بالحق والقسط كما قال تعالى \"وزنوا بالقسطاس المستقيم\"."
    }
  ]
}
