{
  "ayahs": [
    {
      "ayah": 1,
      "surah": 56,
      "text": "سورة الواقعة: قال أبو إسحاق عن عكرمة عن ابن عباس قال: قال أبو بكر يا رسول الله قد شبت قال \"شيبتني هود والواقعة والمرسلات وعم يتساءلون وإذا الشمس كورت\" رواه الترمذي وقال حسن غريب. قال الحافظ ابن عساكر في ترجمة عبدالله بن مسعود بسنده إلى عمرو بن الربيع بن طارق المصري حدثنا السري بن يحيى الشيباني عن شجاع عن أبي ظبية قال مرض عبدالله مرضه الذي توفي فيه فعاده عثمان بن عفان فقال ما ثشتكي؟ قال ذنوبي قال فما تشتهي؟ قال رحمة ربي قال ألا آمر لك بطبيب؟ قال الطبيب أمرضني قال ألا آمر لك بعطاء؟ قال لا حاجة لي فيه قال يكون لبناتك من بعدك قال أتخشى على بناتي الفقر؟ إني أمرت بناتي يقرأن كل ليلة سورة الواقعة إني سمعت رسول الله صلى الله عليه وسلم يقول \"من قرأ سورة الواقعة كل ليلة لم تصبه فاقة أبدا\" ثم قال ابن عساكر كذا قـال والصواب عن شجاع كما رواه عبدالله بن وهب عن السري. وقال عبدالله بن وهب أخبرني السري بن يحيى أن شجاعا حدثه عن أبي ظبية عن عبدالله بن مسعود قال سمعت رسول الله صلى الله عليه وسلم يقول \"من قرأ سورة الواقعة كل ليلة لم تصبه فاقة أبدا\" فكان أبو ظبية لا يدعها وكذا رواه أبو يعلى عن إسحاق بن إبراهيم عن محمد بن منيب عن السري بن يحيى عن شجاع عن أبي ظبية عن ابن مسعود به. ثم رواه أبو يعلى عن إسحاق بن إبراهيم عن محمد ابن منيب العدني عن السري بن يحيى عن أبي ظبية عن ابن مسعود أن رسول الله صلى الله عليه وسلم قال \"من قرأ سورة الواقعة في كل ليلة لم تصبه فاقة أبدا\" لم يذكر في مسنده شجاعا قال وقد أمرت بناتي أن يقرأنها كل ليلة. وقد رواه ابن عساكر أيضا من حديث حجاج بن نصير وعثمان بن أبي اليمان عن السري بن يحيى عن شجاع عن أبي فاطمة قال مرض عبدالله فأتاه عثمان بن عفان يعوده فذكر الحديث بطوله قال عثمان بن اليمان كان أبو فاطمة هذا مولى لعلي بن أبي طالب. وقال الإمام أحمد حدثنا عبدالرزاق حدثنا إسرائيل ويحيى بن آدم حدثنا إسرائيل عن سماك بن حرب أنه سمع جابر بن سمرة يقول كان رسول الله صلى الله عليه وسلم يصلي الصلوات كنحو من صلاتكم التي تصلون اليوم ولكنه كان يخفف كانت صلاته أخف من صلاتكم وكان يقرأ في الفجر الواقعة ونحوها من السور. الواقعة من أسماء يوم القيامة سميت بذلك لتحقق كونها ووجودها كما قال تعالى \"فيومئذ وقعت الواقعة\"."
    },
    {
      "ayah": 10,
      "surah": 56,
      "text": "عن رسول الله صلى الله عليه وسلم أنه قال \"أتدرون من السابقون إلى ظل يوم القيامة\" قالوا الله ورسوله أعلم قال \"الذين إذا أعطوا الحق قبلوه وإذا سئلوه بذلوه وحكموا للناس كحكمهم لأنفسهم\" وقال محمد بن كعب وأبو حرزة ويعقوب بن مجاهد \"والسابقون السابقون\" الأنبياء عليهم السلام وقال السدي هم أهل عليين وقال ابن أبي نجيح عن مجاهد عن ابن عباس \"والسابقون السابقون\" قال يوشع بن نون سبق إلى موسى ومؤمن آل يس سبق إلى عيسى وعلي بن أبي طالب سبق إلى محمد رسول الله صلى الله عليه وسلم رواه ابن أبي حاتم عن محمد بن هارون الفلاس عن عبدالله بن إسماعيل المدائني البزار عن سفيان بن الضحاك المدائني عن سفيان بن عيينة عن ابن أبي نجيح به. وقال ابن أبي حاتم وذكر عن محمد بن أبي حماد حدثنا مهران عن خارجة عن قرة عن ابن سيرين \"والسابقون السابقون\" الذي صلوا إلى القبلتين. ورواه ابن جرير من حديث خارجة به وقال الحسن وقتادة \"والسابقون السابقون\" أي من كل أمة وقال الأوزاعي عن عثمان بن أبي سودة أنه قرأ هذه الآية \"والسابقون السابقون أولئك المقربون\" ثم قال أولهم رواحا إلى المسجد وأولهم خروجا في سبيل الله وهذه الأقوال كلها صحيحة فإن المراد بالسابقين هم المبادرون إلى فعل الخيرات كما أمروا كما قال تعالى \"وسارعوا إلى مغفرة من ربكم وجنة عرضها السموات والأرض\" وقال تعالى \"سابقوا إلى مغفرة من ربكم وجنة عرضها كعرض السماء والأرض\" فمن سابق في هذه الدنيا وسبق إلى فعل الخير كان في الآخرة من السابقين إلى الكرامة فإن الجزاء من جنس العمل وكما تدين تدان. ولهذا قال تعالى \"أولئك المقربون في جنات النعيم\". وقال ابن أبي حاتم حدثنا أبي حدثنا يحيى بن زكريا الفزاري الرازي حدثنا خارجة بن مصعب عن زيد ابن أسلم عن عطاء بن يسار عن عبدالله بن عمرو قال: قالت الملائكة يا رب جعلت لبني آدم الدنيا فهم يأكلون ويشربون ويتزوجون فاجعل لنا الآخرة فقال لا أفعل فراجعوا ثلاثا فقال لا أجعل من خلقت بيدي كمن قلت له كن فكان. ثم قرأ عبدالله \"والسابقون السابقون أولئك المقربون في جنات النعيم\" وقد روى هذا الأثر الإمام عثمان بن سعيد الدارمي في كتابه الرد على الجهمية ولفظه: فقال الله عز وجل لن أجعل صالح ذرية من خلقت بيدي كمن قلت له كن فيكون."
    },
    {
      "ayah": 11,
      "surah": 56,
      "text": "وقال الإمام أحمد حدثنا محمد بن عبدالله بن المثنى حدثنا البراء الغنوي حدثنا الحسن عن معاذ بن جبل أن رسول الله صلى الله عليه وسلم تلا هذه الآية \"وأصحاب اليمين ما أصحاب اليمين. وأصحاب الشمال ما أصحاب الشمال\" فقبض بيده قبضتين فقال \"هذه للجنة ولا أبالي وهذه للنار ولا أبالي\" وقال الإمام أحمد أيضا حدثنا حسن حدثنا ابن لهيعة حدثنا خالد بن أبي عمران عن القاسم بن محمد عن عائشة عن رسول الله صلى الله عليه وسلم أنه قال \"أتدرون من السابقون إلى ظل يوم القيامة\" قالوا الله ورسوله أعلم قال \"الذين إذا أعطوا الحق قبلوه وإذا سئلوه بذلوه وحكموا للناس كحكمهم لأنفسهم\" وقال محمد بن كعب وأبو حرزة ويعقوب بن مجاهد \"والسابقون السابقون\" الأنبياء عليهم السلام وقال السدي هم أهل عليين وقال ابن أبي نجيح عن مجاهد عن ابن عباس \"والسابقون السابقون\" قال يوشع بن نون سبق إلى موسى ومؤمن آل يس سبق إلى عيسى وعلي بن أبي طالب سبق إلى محمد رسول الله صلى الله عليه وسلم رواه ابن أبي حاتم عن محمد بن هارون الفلاس عن عبدالله بن إسماعيل المدائني البزار عن سفيان بن الضحاك المدائني عن سفيان بن عيينة عن ابن أبي نجيح به. وقال ابن أبي حاتم وذكر عن محمد بن أبي حماد حدثنا مهران عن خارجة عن قرة عن ابن سيرين \"والسابقون السابقون\" الذي صلوا إلى القبلتين. ورواه ابن جرير من حديث خارجة به وقال الحسن وقتادة \"والسابقون السابقون\" أي من كل أمة وقال الأوزاعي عن عثمان بن أبي سودة أنه قرأ هذه الآية \"والسابقون السابقون أولئك المقربون\" ثم قال أولهم رواحا إلى المسجد وأولهم خروجا في سبيل الله وهذه الأقوال كلها صحيحة فإن المراد بالسابقين هم المبادرون إلى فعل الخيرات كما أمروا كما قال تعالى \"وسارعوا إلى مغفرة من ربكم وجنة عرضها السموات والأرض\" وقال تعالى \"سابقوا إلى مغفرة من ربكم وجنة عرضها كعرض السماء والأرض\" فمن سابق في هذه الدنيا وسبق إلى فعل الخير كان في الآخرة من السابقين إلى الكرامة فإن الجزاء من جنس العمل وكما تدين تدان. ولهذا قال تعالى \"أولئك المقربون في جنات النعيم\". وقال ابن أبي حاتم حدثنا أبي حدثنا يحيى بن زكريا الفزاري الرازي حدثنا خارجة بن مصعب عن زيد ابن أسلم عن عطاء بن يسار عن عبدالله بن عمرو قال: قالت الملائكة يا رب جعلت لبني آدم الدنيا فهم يأكلون ويشربون ويتزوجون فاجعل لنا الآخرة فقال لا أفعل فراجعوا ثلاثا فقال لا أجعل من خلقت بيدي كمن قلت له كن فكان. ثم قرأ عبدالله \"والسابقون السابقون أولئك المقربون في جنات النعيم\" وقد روى هذا الأثر الإمام عثمان بن سعيد الدارمي في كتابه الرد على الجهمية ولفظه: فقال الله عز وجل لن أجعل صالح ذرية من خلقت بيدي كمن قلت له كن فيكون."
    },
    {
      "ayah": 12,
      "surah": 56,
      "text": "وقال الإمام أحمد حدثنا محمد بن عبدالله بن المثنى حدثنا البراء الغنوي حدثنا الحسن عن معاذ بن جبل أن رسول الله صلى الله عليه وسلم تلا هذه الآية \"وأصحاب اليمين ما أصحاب اليمين. وأصحاب الشمال ما أصحاب الشمال\" فقبض بيده قبضتين فقال \"هذه للجنة ولا أبالي وهذه للنار ولا أبالي\" وقال الإمام أحمد أيضا حدثنا حسن حدثنا ابن لهيعة حدثنا خالد بن أبي عمران عن القاسم بن محمد عن عائشة عن رسول الله صلى الله عليه وسلم أنه قال \"أتدرون من السابقون إلى ظل يوم القيامة\" قالوا الله ورسوله أعلم قال \"الذين إذا أعطوا الحق قبلوه وإذا سئلوه بذلوه وحكموا للناس كحكمهم لأنفسهم\" وقال محمد بن كعب وأبو حرزة ويعقوب بن مجاهد \"والسابقون السابقون\" الأنبياء عليهم السلام وقال السدي هم أهل عليين وقال ابن أبي نجيح عن مجاهد عن ابن عباس \"والسابقون السابقون\" قال يوشع بن نون سبق إلى موسى ومؤمن آل يس سبق إلى عيسى وعلي بن أبي طالب سبق إلى محمد رسول الله صلى الله عليه وسلم رواه ابن أبي حاتم عن محمد بن هارون الفلاس عن عبدالله بن إسماعيل المدائني البزار عن سفيان بن الضحاك المدائني عن سفيان بن عيينة عن ابن أبي نجيح به. وقال ابن أبي حاتم وذكر عن محمد بن أبي حماد حدثنا مهران عن خارجة عن قرة عن ابن سيرين \"والسابقون السابقون\" الذي صلوا إلى القبلتين. ورواه ابن جرير من حديث خارجة به وقال الحسن وقتادة \"والسابقون السابقون\" أي من كل أمة وقال الأوزاعي عن عثمان بن أبي سودة أنه قرأ هذه الآية \"والسابقون السابقون أولئك المقربون\" ثم قال أولهم رواحا إلى المسجد وأولهم خروجا في سبيل الله وهذه الأقوال كلها صحيحة فإن المراد بالسابقين هم المبادرون إلى فعل الخيرات كما أمروا كما قال تعالى \"وسارعوا إلى مغفرة من ربكم وجنة عرضها السموات والأرض\" وقال تعالى \"سابقوا إلى مغفرة من ربكم وجنة عرضها كعرض السماء والأرض\" فمن سابق في هذه الدنيا وسبق إلى فعل الخير كان في الآخرة من السابقين إلى الكرامة فإن الجزاء من جنس العمل وكما تدين تدان. ولهذا قال تعالى \"أولئك المقربون في جنات النعيم\". وقال ابن أبي حاتم حدثنا أبي حدثنا يحيى بن زكريا الفزاري الرازي حدثنا خارجة بن مصعب عن زيد ابن أسلم عن عطاء بن يسار عن عبدالله بن عمرو قال: قالت الملائكة يا رب جعلت لبني آدم الدنيا فهم يأكلون ويشربون ويتزوجون فاجعل لنا الآخرة فقال لا أفعل فراجعوا ثلاثا فقال لا أجعل من خلقت بيدي كمن قلت له كن فكان. ثم قرأ عبدالله \"والسابقون السابقون أولئك المقربون في جنات النعيم\" وقد روى هذا الأثر الإمام عثمان بن سعيد الدارمي في كتابه الرد على الجهمية ولفظه: فقال الله عز وجل لن أجعل صالح ذرية من خلقت بيدي كمن قلت له كن فيكون."
    },
    {
      "ayah": 13,
      "surah": 56,
      "text": "يقول تعالى مخبرا عن هؤلاء السابقين أنهم ثلة أي جماعة من الأولين وقليل من الآخرين وقد اختلفوا في المراد بقوله الأولين والآخرين فقيل المراد بالأولين الأمم الماضية وبالآخرين هذه الأمة وهذا رواية عن مجاهد والحسن البصري رواها عنهما ابن أبي حاتم وهو اختيار ابن جرير واستأنس بقوله صلى الله عليه وسلم \"نحن الآخرون السابقون يوم القيامة\" ولم يحك غيره ولا عزاه إلى أحد ومما يستأنس به لهذا القول ما رواه الإمام أبو محمد ابن أبي حاتم حدثنا أبي حدثنا محمد بن عيسى بن الطباع حدثنا شريك عن محمد بن عبدالرحمن عن أبيه عن أبي هريرة قال: لما نزلت \"ثلة من الأولين وقليل من الآخرين\" شق ذلك على أصحاب النبي صلى الله عليه وسلم فنزلت \"ثلة من الأولين وثلة من الآخرين\" فقال النبي صلى الله عليه وسلم إني لأرجو أن تكونوا ربع أهل الجنة ثلث أهل الجنة بل أنتم نصف أهل الجنة أو شطر أهل الجنة وتقاسمونهم النصف الثاني ورواه الإمام أحمد عن أسود بن عامر عن شريك عن محمد بياع الملاء عن أبيه عن أبي هريرة فذكره وقد روى من حديث جابر نحو هذا ورواه الحافظ ابن عساكر من طريق هشام بن عمارة حدثنا عبدربه بن صالح عن عروة بن رويم عن جابر بن عبدالله عن النبي صلى الله عليه وسلم لما نزلت \"إذا وقعت الواقعة\" ذكر فيها \"ثلثة الأولين وقليل من الآخرين\" قال عمر يا رسول الله ثلة من الأولين وقليل منا؟ قال فأمسك آخر السورة سنة ثم نزل \"ثلة من الأولين وثلة من الآخرين\" فقال رسول الله صلى الله عليه وسلم يا عمر تعال فاسمع ما قد أنزل الله \"ثلة من الأولين وثلة من الآخرين\" ألا وإن من آدم إلي ثلة وأمتي ثلة ولن نستكمل ثلتنا حتى نستعين بالسودان من رعاة الإبل ممن شهد أن لا إله إلا الله وحده لا شريك له هكذا أورده في ترجمة عروة بن رويم إسنادا ومتنا ولكن في إسناده نظر وقد وردت طرق كثيرة متعددة بقوله صلى الله عليه وسلم إني لأرجو أن تكونوا ربع أهل الجنة\" الحديث بتمامه وهو مفرد في صفة الجنة ولله الحمد والمنة وهذا الذي اختاره ابن جرير ههنا فيه نظر بل هو قول ضعيف لأن هذه الأمة هي خير الأمم بنص القرآن فيبعد أن يكون المقربون في غيرها أكثر منها اللهم إلا أن يقابل مجموع الأمم بهذه الأمة والظاهر أن المقربين من هؤلاء أكثر من سائر الأمم والله أعلم فالقول الثاني في هذا المقام هو الراجح وهو أن يكون المراد بقوله تعالى \"ثلة من الأولين\" أي من صدر هذه الأمة \"وقليل من الآخرين\" أي من هذه الأمة وقال ابن أبي حاتم حدثنا الحسن بن محمد بن الصباح حدثنا عفان حدثنا عبدالله بن أبي بكر المزني سمعت الحسن أتى على هذه الآية \"والسابقون السابقون أولئك المقربون\" فقال أما السابقون فقد مضوا ولكن اللهم اجعلنا من أصحاب اليمين. ثم قال حدثنا أبي حدثنا أبو الوليد حدثنا السري بن يحيى قال قرأ الحسن \"والسابقون السابقون أولئك المقربون في جنات النعيم ثلة من الأولين\" قال ثلة ممن مضى من هذه الأمة وحدثنا أبي حدثنا عبدالعزيز بن المغيرة المنقري حدثنا أبو هلال عن محمد بن سيرين أنه قال في هذه الآية \"ثلة من الأولين وقليل من الآخرين\" قال كانوا يقولون أو يرجون أن يكونوا كلهم من هذه الأمة فهذا قول الحسن وابن سيرين أن الجميع من هذه الأمة ولا شك أن أول كل أما خير من آخرها فيحتمل أن تعم الآية جميع الأمم كل أمة بحسبها ولهذا ثبت في الصحاح وغيرها من غير وجه أن رسول الله صلى الله عليه وسلم قال \"خير القرون قرني ثم الذين يلونهم ثم الذين يلونهم\" الحديث بتمامه. فأما الحديث الذي رواه الإمام أحمد حدثنا عبدالرحمن حدثنا زياد أبو عمر عن الحسن عن عمار بن ياسر قال: قال رسول الله صلى الله عليه وسلم\"مثل أمتي مثل المطر لا يدرى أوله خير أم آخره\" فهذا الحديث بعد الحكم بصحة إسناده محمول على أن الدين كما هو محتاج إلى أول الأمة في إبلاغه إلى من بعدهم كذلك هو محتاج إلى القائمين به في أواخرها وتثبيت الناس على السنة وروايتها وإظهارها والفضل للمتقدم وكذلك الزرع هو محتاج إلى المطر الأول وإلى المطر الثاني ولكن العمدة الكبرى على الأول واحتياج الزرع إليه آكد فإنه لولاه ما نبت في الأرض ولا تعلق أساسه فيها ولهذا قال عليه السلام \"لا تزال طائفة من أمتي ظاهرين على الحق لا يضرهم من خذلهم ولا من خالفهم إلى قيام الساعة\" وفي لفظ \"حتى يأتي أمر الله تعالى وهم كذلك\" والغرض أن هذه الأمة أشرف من سائر الأمم والمقربون فيها أكثر من غيرها وأعلى منزلة لشرف دينها وعظم نبيها ولهذا ثبت بالتواتر عن رسول الله صلى الله عليه وسلم أنه أخبر أن في هذه الأمة سبعين ألفا يدخلون الجنة بغير حساب وفي لفظ \"مع كل ألف سبعون ألفا - وفي آخر- مع كل واحد سبعون ألفا\" وقد قال الحافظ أبو القاسم الطبراني حدثنا هشام بن يزيد الطبراني حدثنا محمد هو ابن اسماعيل بن عياش حدثني أبي حدثني ضمضم يعني ابن زرعة عن شريح هو ابن عبيد عن أبي مالك قال: قال رسول الله صلى الله عليه وسلم \"أما والذي نفسي بيده ليبعثن منكم يوم القيامة مثل الليل الأسود زمرة جميعها يحيطون الأرض تقول الملائكة لما جاء مع محمد صلى الله عليه وسلم أكثر مما جاء مع الأنبياء عليهم السلام\" وحسن أن يذكر ههنا عند قوله تعالى \"ثلة من الأولين وقليل من الآخرين\"الحديث الذي رواه الحافظ أبو بكر البيهقي في دلائل النبوة حيث قال أخبرنا أبو نصر بن قتادة أخبرنا أبو عمرو بن مطر أخبرنا جعفر بن محمد بن المستفاض الفريابي حدثني أبو وهب الوليد بن عبدالملك بن عبدالله بن مسرح الحراني حدثنا سليمان بن عطاء القرشي الحراني عن مسلم بن عبدالله الجني عن عمه أبي مشجعة بن ربعي عن أبي زمل الجهني رضي الله عنه قال كان رسول الله صلى الله عليه وسلم إذا صلى الصبح يقول وهو ثان رجليه \"سبحان الله وبحمده أستغفر الله إن الله كان توابا\" سبعين مرة ثم يقول \"سبعين بسبعمائة لا خير لمن كانت ذنوبه في يوم واحد أكثر من سبعمائة\" ثم يقول ذلك مرتين ثم يستقبل الناس بوجهه وكان رسول الله صلى الله عليه وسلم تعجبه الرؤيا ثم يقول \"هل رأى أحد منكم شيئا؟\" قال أبو زمل فقلت أنا يا رسول الله فقال \"خير تلقاه وشر توقاه وخير لنا وشر على أعدائنا والحمد لله رب العالمين اقصص رؤياك\" فقلت رأيت جميع الناس على طريق رحب سهل لاحب والناس على الجادة منطلقين فبينما هم كذلك إذا أشفى ذلك الطريق على مرج لم تر عيني مثله يرف رفيفا يقطر ماؤه فيه من أنواع الكلأ قال وكانوا بالرعلة الأولى حين أشفوا على المرج كبروا ثم أكبوا رواحلهم في الطريق فلم يظلموه يمينا ولا شمالا قال فكأني أنظر إليهم منطلقين ثم جاءت الرعلة الثانية وهم أكثر منهم أضعافا فلما أشفوا على المرج كبروا ثم أكبوا رواحلهم في الطريق فمنهم المرتع ومنهم الآخذ الضغث ومضوا على ذلك قال ثم قدم عظم الناس فلما أشفوا على المرج كبروا وقالوا هذا خير المنزل كأني أنظر إليهم يميلون يمينا وشمالا فلما رأيت ذلك لزمت الطريق حتى آتي أقصى المرج فإذا أنا بك يا رسول الله على منبر فيه سبع درجات وأنت في أعلاها درجة وإذا عن يمينك رجل آدم شثل أفنى إذا هو تكلم يسمو فيقرع الرجال طولا وإذا عن يسارك رجل ربعة باز كثير خيلان الوجه كأنما حمم شعره بالماء إذا هو تكلم أصغيتم إكراما له وإذا أمام ذلك رجل شيخ أشبه الناس بك خلقا ووجها كلكم تأمونه تريدونه وإذا أمام ذلك ناقة عجفاء شارف وإذا أنت يا رسول الله كأنك تبعثها قال فامتقع لون رسول الله صلى الله عليه وسلم ساعة ثم سري عنه وقال رسول الله صلى الله عليه وسلم \"أما ما رأيت من الطريق السهل الرحب اللاحب فذاك ما حملتكم عليه من الهدى وأنتم عليه وأما المرج الذي رأيت فالدنيا وغدارة عيشها مضيت وأنا وأصحابي لم تتعلق منها بشيء ولم تتعلق منا ولم نردها ولم تردنا ثم جاءت الرعلة الثانية من بعدنا وهم أكثر منا أضعافا فمنهم المرتع ومنهم الآخذ الضغث ونجوا على ذلك ثم جاء عظم الناس فمالوا في المرج يمينا وشمالا فإنا لله وإنا إليه راجعون وأما أنت فمضيت على طريقة صالحة فلن تزال عليها حتى تلقاني وأما المنبر الذي رأيت فيه سبع درجات وأنا في أعلاها درجة فالدنيا سبعة آلاف سنة أنا في آخرها ألفا وأما الرجل الذي رأيت على يميني الآدم الشثل فذلك موسى عليه السلام إذا تكلم يعلو الرجال بفضل كلام الله إياه والذي رأيت عن يساري الباز الربعة الكثير خيلان الوجه كأنما حمم شعره بالماء فذلك عيسى ابن مريم نكرمه لإكرام الله إياه وأما الشيخ الذي رأيت أشبه الناس بي خلقا ووجها فذاك أبونا إبراهيم كلنا نؤمه ونقتدي به وأما الناقة التي رأيت ورأيتني أبعثها فهي الساعة علينا تقوم لا نبي بعدي ولا أمة بعد أمتي\" قال فما سأل رسول الله صلى الله عليه وسلم عن رؤيا بعد هذا إلا أن يجيء الرجل فيحدثه بها متبرعا."
    },
    {
      "ayah": 14,
      "surah": 56,
      "text": "يقول تعالى مخبرا عن هؤلاء السابقين أنهم ثلة أي جماعة من الأولين وقليل من الآخرين وقد اختلفوا في المراد بقوله الأولين والآخرين فقيل المراد بالأولين الأمم الماضية وبالآخرين هذه الأمة وهذا رواية عن مجاهد والحسن البصري رواها عنهما ابن أبي حاتم وهو اختيار ابن جرير واستأنس بقوله صلى الله عليه وسلم \"نحن الآخرون السابقون يوم القيامة\" ولم يحك غيره ولا عزاه إلى أحد ومما يستأنس به لهذا القول ما رواه الإمام أبو محمد ابن أبي حاتم حدثنا أبي حدثنا محمد بن عيسى بن الطباع حدثنا شريك عن محمد بن عبدالرحمن عن أبيه عن أبي هريرة قال: لما نزلت \"ثلة من الأولين وقليل من الآخرين\" شق ذلك على أصحاب النبي صلى الله عليه وسلم فنزلت \"ثلة من الأولين وثلة من الآخرين\" فقال النبي صلى الله عليه وسلم إني لأرجو أن تكونوا ربع أهل الجنة ثلث أهل الجنة بل أنتم نصف أهل الجنة أو شطر أهل الجنة وتقاسمونهم النصف الثاني ورواه الإمام أحمد عن أسود بن عامر عن شريك عن محمد بياع الملاء عن أبيه عن أبي هريرة فذكره وقد روى من حديث جابر نحو هذا ورواه الحافظ ابن عساكر من طريق هشام بن عمارة حدثنا عبدربه بن صالح عن عروة بن رويم عن جابر بن عبدالله عن النبي صلى الله عليه وسلم لما نزلت \"إذا وقعت الواقعة\" ذكر فيها \"ثلثة الأولين وقليل من الآخرين\" قال عمر يا رسول الله ثلة من الأولين وقليل منا؟ قال فأمسك آخر السورة سنة ثم نزل \"ثلة من الأولين وثلة من الآخرين\" فقال رسول الله صلى الله عليه وسلم يا عمر تعال فاسمع ما قد أنزل الله \"ثلة من الأولين وثلة من الآخرين\" ألا وإن من آدم إلي ثلة وأمتي ثلة ولن نستكمل ثلتنا حتى نستعين بالسودان من رعاة الإبل ممن شهد أن لا إله إلا الله وحده لا شريك له هكذا أورده في ترجمة عروة بن رويم إسنادا ومتنا ولكن في إسناده نظر وقد وردت طرق كثيرة متعددة بقوله صلى الله عليه وسلم إني لأرجو أن تكونوا ربع أهل الجنة\" الحديث بتمامه وهو مفرد في صفة الجنة ولله الحمد والمنة وهذا الذي اختاره ابن جرير ههنا فيه نظر بل هو قول ضعيف لأن هذه الأمة هي خير الأمم بنص القرآن فيبعد أن يكون المقربون في غيرها أكثر منها اللهم إلا أن يقابل مجموع الأمم بهذه الأمة والظاهر أن المقربين من هؤلاء أكثر من سائر الأمم والله أعلم فالقول الثاني في هذا المقام هو الراجح وهو أن يكون المراد بقوله تعالى \"ثلة من الأولين\" أي من صدر هذه الأمة \"وقليل من الآخرين\" أي من هذه الأمة وقال ابن أبي حاتم حدثنا الحسن بن محمد بن الصباح حدثنا عفان حدثنا عبدالله بن أبي بكر المزني سمعت الحسن أتى على هذه الآية \"والسابقون السابقون أولئك المقربون\" فقال أما السابقون فقد مضوا ولكن اللهم اجعلنا من أصحاب اليمين. ثم قال حدثنا أبي حدثنا أبو الوليد حدثنا السري بن يحيى قال قرأ الحسن \"والسابقون السابقون أولئك المقربون في جنات النعيم ثلة من الأولين\" قال ثلة ممن مضى من هذه الأمة وحدثنا أبي حدثنا عبدالعزيز بن المغيرة المنقري حدثنا أبو هلال عن محمد بن سيرين أنه قال في هذه الآية \"ثلة من الأولين وقليل من الآخرين\" قال كانوا يقولون أو يرجون أن يكونوا كلهم من هذه الأمة فهذا قول الحسن وابن سيرين أن الجميع من هذه الأمة ولا شك أن أول كل أما خير من آخرها فيحتمل أن تعم الآية جميع الأمم كل أمة بحسبها ولهذا ثبت في الصحاح وغيرها من غير وجه أن رسول الله صلى الله عليه وسلم قال \"خير القرون قرني ثم الذين يلونهم ثم الذين يلونهم\" الحديث بتمامه. فأما الحديث الذي رواه الإمام أحمد حدثنا عبدالرحمن حدثنا زياد أبو عمر عن الحسن عن عمار بن ياسر قال: قال رسول الله صلى الله عليه وسلم\"مثل أمتي مثل المطر لا يدرى أوله خير أم آخره\" فهذا الحديث بعد الحكم بصحة إسناده محمول على أن الدين كما هو محتاج إلى أول الأمة في إبلاغه إلى من بعدهم كذلك هو محتاج إلى القائمين به في أواخرها وتثبيت الناس على السنة وروايتها وإظهارها والفضل للمتقدم وكذلك الزرع هو محتاج إلى المطر الأول وإلى المطر الثاني ولكن العمدة الكبرى على الأول واحتياج الزرع إليه آكد فإنه لولاه ما نبت في الأرض ولا تعلق أساسه فيها ولهذا قال عليه السلام \"لا تزال طائفة من أمتي ظاهرين على الحق لا يضرهم من خذلهم ولا من خالفهم إلى قيام الساعة\" وفي لفظ \"حتى يأتي أمر الله تعالى وهم كذلك\" والغرض أن هذه الأمة أشرف من سائر الأمم والمقربون فيها أكثر من غيرها وأعلى منزلة لشرف دينها وعظم نبيها ولهذا ثبت بالتواتر عن رسول الله صلى الله عليه وسلم أنه أخبر أن في هذه الأمة سبعين ألفا يدخلون الجنة بغير حساب وفي لفظ \"مع كل ألف سبعون ألفا - وفي آخر- مع كل واحد سبعون ألفا\" وقد قال الحافظ أبو القاسم الطبراني حدثنا هشام بن يزيد الطبراني حدثنا محمد هو ابن اسماعيل بن عياش حدثني أبي حدثني ضمضم يعني ابن زرعة عن شريح هو ابن عبيد عن أبي مالك قال: قال رسول الله صلى الله عليه وسلم \"أما والذي نفسي بيده ليبعثن منكم يوم القيامة مثل الليل الأسود زمرة جميعها يحيطون الأرض تقول الملائكة لما جاء مع محمد صلى الله عليه وسلم أكثر مما جاء مع الأنبياء عليهم السلام\" وحسن أن يذكر ههنا عند قوله تعالى \"ثلة من الأولين وقليل من الآخرين\"الحديث الذي رواه الحافظ أبو بكر البيهقي في دلائل النبوة حيث قال أخبرنا أبو نصر بن قتادة أخبرنا أبو عمرو بن مطر أخبرنا جعفر بن محمد بن المستفاض الفريابي حدثني أبو وهب الوليد بن عبدالملك بن عبدالله بن مسرح الحراني حدثنا سليمان بن عطاء القرشي الحراني عن مسلم بن عبدالله الجني عن عمه أبي مشجعة بن ربعي عن أبي زمل الجهني رضي الله عنه قال كان رسول الله صلى الله عليه وسلم إذا صلى الصبح يقول وهو ثان رجليه \"سبحان الله وبحمده أستغفر الله إن الله كان توابا\" سبعين مرة ثم يقول \"سبعين بسبعمائة لا خير لمن كانت ذنوبه في يوم واحد أكثر من سبعمائة\" ثم يقول ذلك مرتين ثم يستقبل الناس بوجهه وكان رسول الله صلى الله عليه وسلم تعجيه الرؤيا ثم يقول \"هل رأى أحد منكم شيئا؟\" قال أبو زمل فقلت أنا يا رسول الله فقال \"خير تلقاه وشر توقاه وخير لنا وشر على أعدائنا والحمد لله رب العالمين اقصص رؤياك\" فقلت رأيت جميع الناس على طريق رحب سهل لاحب والناس على الجادة منطلقين فبينما هم كذلك إذا أشفى ذلك الطريق على مرج لم تر عيني مثله يرف رفيفا يقطر ماؤه فيه من أنواع الكلأ قال وكانوا بالرعلة الأولى حين أشفوا على المرج كبروا ثم أكبوا رواحلهم في الطريق فلم يظلموه يمينا ولا شمالا قال فكأني أنظر إليهم منطلقين ثم جاءت الرعلة الثانية وهم أكثر منهم أضعافا فلما أشفوا على المرج كبروا ثم أكبوا رواحلهم في الطريق فمنهم المرتع ومنهم الآخذ الضغث ومضوا على ذلك قال ثم قدم عظم الناس فلما أشفوا على المرج كبروا وقالوا هذا خير المنزل كأني أنظر إليهم يميلون يمينا وشمالا فلما رأيت ذلك لزمت الطريق حتى آتي أقصى المرج فإذا أنا بك يا رسول الله على منبر فيه سبع درجات وأنت في أعلاها درجة وإذا عن يمينك رجل آدم شثل أفنى إذا هو تكلم يسمو فيقرع الرجال طولا وإذا عن يسارك رجل ربعة باز كثير خيلان الوجه كأنما حمم شعره بالماء إذا هو تكلم أصغيتم إكراما له وإذا أمام ذلك رجل شيخ أشبه الناس بك خلقا ووجها كلكم تأمونه تريدونه وإذا أمام ذلك ناقة عجفاء شارف وإذا أنت يا رسول الله كأنك تبعثها قال فامتقع لون رسول الله صلى الله عليه وسلم ساعة ثم سري عنه وقال رسول الله صلى الله عليه وسلم \"أما ما رأيت من الطريق السهل الرحب اللاحب فذاك ما حملتكم عليه من الهدى وأنتم عليه وأما المرج الذي رأيت فالدنيا وغدارة عيشها مضيت وأنا وأصحابي لم تتعلق منها بشيء ولم تتعلق منا ولم نردها ولم تردنا ثم جاءت الرعلة الثانية من بعدنا وهم أكثر منا أضعافا فمنهم المرتع ومنهم الآخذ الضغث ونجوا على ذلك ثم جاء عظم الناس فمالوا في المرج يمينا وشمالا فإنا لله وإنا إليه راجعون وأما أنت فمضيت على طريقة صالحة فلن تزال عليها حتى تلقاني وأما المنبر الذي رأيت فيه سبع درجات وأنا في أعلاها درجة فالدنيا سبعة آلاف سنة أنا في آخرها ألفا وأما الرجل الذي رأيت على يميني الآدم الشثل فذلك موسى عليه السلام إذا تكلم يعلو الرجال بفضل كلام الله إياه والذي رأيت عن يساري الباز الربعة الكثير خيلان الوجه كأنما حمم شعره بالماء فذلك عيسى ابن مريم نكرمه لإكرام الله إياه وأما الشيخ الذي رأيت أشبه الناس بي خلقا ووجها فذاك أبونا إبراهيم كلنا نؤمه ونقتدي به وأما الناقة التي رأيت ورأيتني أبعثها فهي الساعة علينا تقوم لا نبي بعدي ولا أمة بعد أمتي\" قال فما سأل رسول الله صلى الله عليه وسلم عن رؤيا بعد هذا إلا أن يجييء الرجل فيحدثه بها متبرعا."
    },
    {
      "ayah": 15,
      "surah": 56,
      "text": "وقوله تعالى \"على سرر موضونة\" قال ابن عباس أي مرمولة بالذهب يعني منسوجة به وكذا قال مجاهد وعكرمة وسعيد بن جبير وزيد بن أسلم وقتادة والضحاك وغيره وقال السدي مرمولة بالذهب واللؤلؤ وقال عكرمة مشبكة بالدر والياقوت. وقال ابن جرير ومنه يسمى وضين الناقة الذي تحت بطنها وهو فعيل بمعنى مفعول لأنه مضفور وكذلك السرر في الجنة مضفورة بالذهب واللآلىء."
    },
    {
      "ayah": 16,
      "surah": 56,
      "text": "وقوله تعالي \"متكئين عليها متقابلين\" أي وجوه بعضهم إلى بعض ليس أحد وراء أحد."
    },
    { "ayah": 17, "surah": 56, "text": "أي مخلدون على صفة واحدة لا يكبرون عنها ولا يشيبون ولا يتغيرون." },
    {
      "ayah": 18,
      "surah": 56,
      "text": "أما الأكواب فهي الكيزان التي لا خراطيم لها ولا آذان والأباريق التي جمعت الوصفين والكؤوس الهنابات والجميع من خمر من عين جارية معين ليس من أوعية تنقطع وتفرغ بل من عيون سارحة."
    },
    {
      "ayah": 19,
      "surah": 56,
      "text": "وقوله تعالى \"لا يصدعون عنها ولا ينزفون\" أي لا تصدع رؤوسهم ولا تنزف عقولهم بل هى ثابتة مع الشدة المطربة واللذة الحاصلة وروى الضحاك عن ابن عباس أنه قال في الخمر أربع خصال السكر والصداع والقيء والبول فذكر الله تعالى خمر الجنة ونزهها عن هذه الخصال وقال مجاهد وعكرمة وسعيد بن جبير وعطية وقتادة والسدي \"لا يصدعون عنها\" يقول ليس لهم فيها صداع رأس وقالوا في قوله \"ولا ينزفون\" أي لا تذهب بعقولهم."
    },
    {
      "ayah": 2,
      "surah": 56,
      "text": "وقوله تعالى \"ليس لوقعتها كاذبة\" أي ليس لوقوعها إذا أراد الله كونها صارف يصرفها ولا دافع يدفعها كما قال \"استجيبوا لربكم من قبل أن يأتي يوم لا مرد له من الله\" وقال \"سأل سائل بعذاب واقع للكافرين ليس له دافع\" وقال تعالى \"ويوم يقول كن فيكون قوله الحق وله الملك يوم ينفخ في الصور عالم الغيب والشهادة وهو الحكيم الخبير\" ومعنى \"كاذبة\" كما قال محمد بن كعب لا بد أن تكون وقال قتادة ليس فيها مثنوية ولا ارتداد ولا رجعة قال ابن جرير والكاذبة مصدر كالعاقبة والعافية."
    },
    {
      "ayah": 20,
      "surah": 56,
      "text": "وقوله تعالى \"وفاكهة مما يتخيرون ولحم طير مما يشتهون\" أي ويطوفون عليهم بما يتخيرون من الثمار وهذه الآية دليل على جواز أكل الفاكهة على صفة التخير لها ويدل على ذلك حديث عكراش بن ذؤيب الذي رواه الحافظ أبو يعلى الموصلي رحمه الله في مسنده حدثنا العباس بن الوليد الترسي حدثنا العلاء بن الفضل بن عبدالملك بن أبي سومة حدثنا عبيدالله بن عكراش عن أبيه عكراش بن ذؤيب قال: بعثني مرة في صدقات أموالهم إلى رسول الله صلي الله عليه وسلم فقدمت المدينة فإذا هو جالس بين المهاجرين والأنصار وقدمت عليه بإبل كأنها عروق الأرطي قال \"من الرجل؟\" قلت عكراش بن ذؤيب قال \"ارفع في النسب\" فانتسبت له إلى مرة بن عبيد وهذه صدقة مرة بن عبيد فتبسم رسول الله صلى الله عليه وسلم وقال \"هذه إبل قومي هذه صدقات قومي\" ثم أمر بها أن توسم بميسم إبل الصدقة وتضم إليها ثم أخذ بيدي فانطلقنا إلى منزل أم سلمة فقال \"هل من طعام؟\" فأتينا بحفنة كالقصعة كثيرة الثريد والوذر فجعل يأكل منها فأقبلت أخبط بيدي في جوانبها فقيض رسول الله صلى الله عليه وسلم بيده اليسرى على يدي اليمنى فقال \"يا عكراش كل من موضع واحد فإنه طعام واحد\" ثم أتينا بطبق فيه تمر أو رطب - شك عبيد الله رطبا كان أو تمرا - فجعلت آكل من بين يدي وجالت يد رسول الله صلى الله عليه وسلم في الطبق وقال \"يا عكراش كل من حيث شئت فإنه غير لون واحد ثم أتينا بماء فغسل رسول الله صلى الله عليه وسلم يده ومسح ببلل كفيه وجهه وذراعيه ورأسه ثلاثا ثم قال \"يا عكراش هذا الوضوء مما غيرت النار\" وهكذا رواه الترمذي مطولا وابن ماجه جميعا عن محمد بن بشار عن أبي الهزيل العلاء بن الفضل به وقال الترمذي غريب لا نعرفه إلا من حديثه وقال الإمام أحمد حدثنا بهز بن أسد وعفان وقال الحافظ ابن يعلى حدثنا شيبان قالوا حدثنا سليمان بن المغيرة حدثنا ثابت قال: قال أنس كان رسول الله صلى الله عليه وسلم تعجبه الرؤيا فربما رأى الرجل الرؤيا فسأل عنه إذا لم يكن يعرفه فإذا أثنى عليه معروف كان أعجب لرؤياه إليه فأتته امرأة فقالت يا رسول الله رأيت كأني أتيت فأخرجت من المدينة فأدخلت الجنة فسمعت وجبة انتحبت لها الجنة فنظرت فإذا فلان بن فلان وفلان بن فلان فسمت اثنى عشر رجلا كان النبي صلى الله عليه وسلم قد بعث سرية قبل ذلك فجيء بهم عليهم ثياب طلس تشخب أوداجهم فقيل اذهبوا بهم إلى نهر البيدخ أو البيذخ قال فغمسوا فيه فخرجوا ووجوههم كالقمر ليلة البدر فأتوا بصحفة من ذهب فيها بسر فأكلوا من بسره ما شاءوا فما يقلبونها من وجه إلا أكلوا من الفاكة ما أرادوا وأكلت معهم فجاء البشير من تلك السرية فقال ما كان من رؤيا كذا وكذا فأصيب فلان وفلان حتى عد اثنى عشر رجلا فدعا رسول الله صلى الله عليه وسلم المرأة فقال \"قصي رؤياك\" فقصتها وجعلت تقول فجيء بفلان وفلان كما قال. هذا لفظ أبي يعلى قال الحافظ الضياء وهذا على شرط مسلم وقال الحافظ أبو القاسم الطبراني حدثنا معاذ بن المثني حدثنا علي بن المديني حدثنا ريحان بن سعيد عن عباد بن منصور عن أيوب عن أبي قلابة عن أبي أسماء عن ثوبان قال: قال رسول الله صلى الله عليه وسلم \"إن الرجل إذا نزع ثمرة من الجنة عادت مكانها أخرى\" وقوله تعالى \"ولحم طير مما يشتهون\" قال الإمام أحمد حدثنا سيار بن حاتم حدثنا جعفر بن سليمان الضبعي حدثنا ثابت عن أنس قال: قال رسول الله صلى الله عليه وسلم \"إن طير الجنة كأمثال البخت يرعى في شجر الجنة\" فقال أبو بكر يا رسول الله إن هذه لطير ناعمة فقال \"آكلها أنعم منها - قالها ثلاثا - وإني لأرجو أن تكون ممن يأكل منها\" انفرد به أحمد من هذا الوجه. وروى الحافظ أبو عبدالله المقدسي في كتابه صفة الجنة من حديث إسماعيل بن علي الخطمي عن أحمد بن علي الحيوطي عن عبدالجبار بن عاصم عن عبدالله بن زياد عن زرعة عن نافع عن ابن عمر قال: ذكرت عند النبي صلى الله عليه وسلم طوبي فقال رسول الله صلى الله عليه وسلم \"يا أبا بكر هل بلغك ما طوبي؟\" قال الله ورسوله أعلم قال \"طوبي شجرة في الجنة ما يعلم طولها إلا الله سير الراكب تحت غصن من أغصانها سبعين خريفا ورقها الحلل يقع عليها الطير كأمثال البخت\" فقال أبو بكر يا رسول الله إن هناك لطيرا ناعما؟ قال \"أنعم منه من يأكله وأنت منهم إن شاء الله تعالى\" وقال قتادة في قوله تعالى \"ولحم طير مما يشتهون\" وذكر لنا أن أبا بكر قال يا رسول الله إني أرى طيرها ناعمة كأهلها ناعمون قال \"من يأكلها والله يا أبا بكر أنعم منها وإنها لأمثال البخت وإني لأحتسب على الله أن تأكل منها يا أبا بكر\". وقال أبو بكر بن أبي الدنيا حدثني مجاهد بن موسى حدثنا معن بن عيسى حدثني ابن أخي ابن شهاب عن أبيه عن أنس بن مالك أن رسول الله صلى الله عليه وسلم سئل عن الكوثر فقال \"نهر أعطانيه ربي عز وجل في الجنة أشد بياضا من اللبن وأحلى من العسل فيه طيور أعناقها يعني كأعناق الجزر\" فقال عمر إنها لناعمة قال رسول الله صلى الله عليه وسلم آكلها أنعم منها\" وكذا رواه الترمذي عن عبد بن حميد عن القعنبي عن محمد بن عبدالله بن مسلم بن شهاب عن أبيه عن أنس وقال حسن. وقال ابن أبي حاتم حدثنا أبي حدثنا علي بن محمد الطنافسي حدثنا أبو معاوية عن عبيدالله بن الوليد الرصافي عن عطية العوفي عن أبي سعيد الخدري قال: قال رسول الله صلى الله عليه وسلم \"إن في الجنة لطيرا فيه سبعون ألف ريشة فيقع على صحفة الرجل من أهل الجنة فينتفض فيخرج من كل ريشة يعني لونا أبيض من اللبن وألين من الزبد وأعذب من الشهد ليس منها لون يشيه صاحبه ثم يطير\" هذا حديث غريب جدا والرصافي وشيخه ضعيفان ثم قال ابن أبي حاتم حدثنا أبي حدثنا عبدالله بن صالح كاتب الليث حدثني الليث حدثنا خالد بن يزيد عن سعيد بن أبي هلال عن أبي حازم عن عطاء عن كعب قال: إن طائر الجنة أمثال البخت يأكل من ثمرات الجنه ويشرب من أنهار الجنة فيصطففن له فإذا اشتهى منها شيئا أتى حتى يقع بين يديه فيأكل من خارجه وداخله ثم يطير لم ينقص منه شيء صحيح إلى كعب وقال الحسن بن عرفة حدثنا خلف بن خليفة عن حميد الأعرج عن عبدالله بن الحارث عن عبدالله بن مسعود قال: قال لي رسول الله صلى الله عليه وسلم \"إنك لتنظر إلى الطير في الجنة فتشتهيه فيخر بين يديك مشويا\"."
    },
    {
      "ayah": 21,
      "surah": 56,
      "text": "وقوله تعالى \"وفاكهة مما يتخيرون ولحم طير مما يشتهون\" أي ويطوفون عليهم بما يتخيرون من الثمار وهذه الآية دليل على جواز أكل الفاكهة على صفة التخير لها ويدل على ذلك حديث عكراش بن ذؤيب الذي رواه الحافظ أبو يعلى الموصلي رحمه الله في مسنده حدثنا العباس بن الوليد الترسي حدثنا العلاء بن الفضل بن عبدالملك بن أبي سومة حدثنا عبيدالله بن عكراش عن أبيه عكراش بن ذؤيب قال: بعثني مرة في صدقات أموالهم إلى رسول الله صلي الله عليه وسلم فقدمت المدينة فإذا هو جالس بين المهاجرين والأنصار وقدمت عليه بإبل كأنها عروق الأرطي قال \"من الرجل؟\" قلت عكراش بن ذؤيب قال \"ارفع في النسب\" فانتسبت له إلى مرة بن عبيد وهذه صدقة مرة بن عبيد فتبسم رسول الله صلى الله عليه وسلم وقال \"هذه إبل قومي هذه صدقات قومي\" ثم أمر بها أن توسم بميسم إبل الصدقة وتضم إليها ثم أخذ بيدي فانطلقنا إلى منزل أم سلمة فقال \"هل من طعام؟\" فأتينا بحفنة كالقصعة كثيرة الثريد والوذر فجعل يأكل منها فأقبلت أخبط بيدي في جوانبها فقيض رسول الله صلى الله عليه وسلم بيده اليسرى على يدي اليمنى فقال \"يا عكراش كل من موضع واحد فإنه طعام واحد\" ثم أتينا بطبق فيه تمر أو رطب - شك عبيد الله رطبا كان أو تمرا - فجعلت آكل من بين يدي وجالت يد رسول الله صلى الله عليه وسلم في الطبق وقال \"يا عكراش كل من حيث شئت فإنه غير لون واحد ثم أتينا بماء فغسل رسول الله صلى الله عليه وسلم يده ومسح ببلل كفيه وجهه وذراعيه ورأسه ثلاثا ثم قال \"يا عكراش هذا الوضوء مما غيرت النار\" وهكذا رواه الترمذي مطولا وابن ماجه جميعا عن محمد بن بشار عن أبي الهزيل العلاء بن الفضل به وقال الترمذي غريب لا نعرفه إلا من حديثه وقال الإمام أحمد حدثنا بهز بن أسد وعفان وقال الحافظ ابن يعلى حدثنا شيبان قالوا حدثنا سليمان بن المغيرة حدثنا ثابت قال: قال أنس كان رسول الله صلى الله عليه وسلم تعجبه الرؤيا فربما رأى الرجل الرؤيا فسأل عنه إذا لم يكن يعرفه فإذا أثنى عليه معروف كان أعجب لرؤياه إليه فأتته امرأة فقالت يا رسول الله رأيت كأني أتيت فأخرجت من المدينة فأدخلت الجنة فسمعت وجبة انتحبت لها الجنة فنظرت فإذا فلان بن فلان وفلان بن فلان فسمت اثنى عشر رجلا كان النبي صلى الله عليه وسلم قد بعث سرية قبل ذلك فجيء بهم عليهم ثياب طلس تشخب أوداجهم فقيل اذهبوا بهم إلى نهر البيدخ أو البيذخ قال فغمسوا فيه فخرجوا ووجوههم كالقمر ليلة البدر فأتوا بصحفة من ذهب فيها بسر فأكلوا من بسره ما شاءوا فما يقلبونها من وجه إلا أكلوا من الفاكة ما أرادوا وأكلت معهم فجاء البشير من تلك السرية فقال ما كان من رؤيا كذا وكذا فأصيب فلان وفلان حتى عد اثنى عشر رجلا فدعا رسول الله صلى الله عليه وسلم المرأة فقال \"قصي رؤياك\" فقصتها وجعلت تقول فجيء بفلان وفلان كما قال. هذا لفظ أبي يعلى قال الحافظ الضياء وهذا على شرط مسلم وقال الحافظ أبو القاسم الطبراني حدثنا معاذ بن المثني حدثنا علي بن المديني حدثنا ريحان بن سعيد عن عباد بن منصور عن أيوب عن أبي قلابة عن أبي أسماء عن ثوبان قال: قال رسول الله صلى الله عليه وسلم \"إن الرجل إذا نزع ثمرة من الجنة عادت مكانها أخرى\" وقوله تعالى \"ولحم طير مما يشتهون\" قال الإمام أحمد حدثنا سيار بن حاتم حدثنا جعفر بن سليمان الضبعي حدثنا ثابت عن أنس قال: قال رسول الله صلى الله عليه وسلم \"إن طير الجنة كأمثال البخت يرعى في شجر الجنة\" فقال أبو بكر يا رسول الله إن هذه لطير ناعمة فقال \"آكلها أنعم منها - قالها ثلاثا - وإني لأرجو أن تكون ممن يأكل منها\" انفرد به أحمد من هذا الوجه. وروى الحافظ أبو عبدالله المقدسي في كتابه صفة الجنة من حديث إسماعيل بن علي الخطمي عن أحمد بن علي الحيوطي عن عبدالجبار بن عاصم عن عبدالله بن زياد عن زرعة عن نافع عن ابن عمر قال: ذكرت عند النبي صلى الله عليه وسلم طوبي فقال رسول الله صلى الله عليه وسلم \"يا أبا بكر هل بلغك ما طوبي؟\" قال الله ورسوله أعلم قال \"طوبي شجرة في الجنة ما يعلم طولها إلا الله سير الراكب تحت غصن من أغصانها سبعين خريفا ورقها الحلل يقع عليها الطير كأمثال البخت\" فقال أبو بكر يا رسول الله إن هناك لطيرا ناعما؟ قال \"أنعم منه من يأكله وأنت منهم إن شاء الله تعالى\" وقال قتادة في قوله تعالى \"ولحم طير مما يشتهون\" وذكر لنا أن أبا بكر قال يا رسول الله إني أرى طيرها ناعمة كأهلها ناعمون قال \"من يأكلها والله يا أبا بكر أنعم منها وإنها لأمثال البخت وإني لأحتسب على الله أن تأكل منها يا أبا بكر\". وقال أبو بكر بن أبي الدنيا حدثني مجاهد بن موسى حدثنا معن بن عيسى حدثني ابن أخي ابن شهاب عن أبيه عن أنس بن مالك أن رسول الله صلى الله عليه وسلم سئل عن الكوثر فقال \"نهر أعطانيه ربي عز وجل في الجنة أشد بياضا من اللبن وأحلى من العسل فيه طيور أعناقها يعني كأعناق الجزر\" فقال عمر إنها لناعمة قال رسول الله صلى الله عليه وسلم آكلها أنعم منها\" وكذا رواه الترمذي عن عبد بن حميد عن القعنبي عن محمد بن عبدالله بن مسلم بن شهاب عن أبيه عن أنس وقال حسن. وقال ابن أبي حاتم حدثنا أبي حدثنا علي بن محمد الطنافسي حدثنا أبو معاوية عن عبيدالله بن الوليد الرصافي عن عطية العوفي عن أبي سعيد الخدري قال: قال رسول الله صلى الله عليه وسلم \"إن في الجنة لطيرا فيه سبعون ألف ريشة فيقع على صحفة الرجل من أهل الجنة فينتفض فيخرج من كل ريشة يعني لونا أبيض من اللبن وألين من الزبد وأعذب من الشهد ليس منها لون يشيه صاحبه ثم يطير\" هذا حديث غريب جدا والرصافي وشيخه ضعيفان ثم قال ابن أبي حاتم حدثنا أبي حدثنا عبدالله بن صالح كاتب الليث حدثني الليث حدثنا خالد بن يزيد عن سعيد بن أبي هلال عن أبي حازم عن عطاء عن كعب قال: إن طائر الجنة أمثال البخت يأكل من ثمرات الجنه ويشرب من أنهار الجنة فيصطفن له فإذا اشتهى منها شيئا أتى حتى يقع بين يديه فيأكل من خارجه وداخله ثم يطير لم ينقص منه شيء صحيح إلى كعب وقال الحسن بن عرفة حدثنا خلف بن خليفة عن حميد الأعرج عن عبدالله بن الحارث عن عبدالله بن مسعود قال: قال لي رسول الله صلى الله عليه وسلم \"إنك لتنظر إلى الطير في الجنة فتشتهيه فيخر بين يديك مشويا\"."
    },
    {
      "ayah": 22,
      "surah": 56,
      "text": "وقوله تعالى \"وحور عين كأمثال اللؤلؤ المكنون\" قرأ بعضهم بالرفع وتقديره ولهم فيها حور عين وقراءة الجر تحتمل معنيين أحدهما أن يكون الإعراب على الإتباع بما قبله كقوله \"يطوف عليهم ولدان مخلدون بأكواب وأباريق وكأس من معين لا يصدعون عنها ولا ينزفون وفاكهة مما يتخيرون ولحم طير مما يشتهون وحور عين\" كما قال تعالى \"وامسحوا برؤوسكم وأرجلكم\" وكما قال تعالى \"عليهم ثياب سندس خضر وإستبرق\" والاحتمال الثاني أن يكون مما يطوف به الولدان المخلدون عليهم الحور العين ولكن يكون ذلك في القصور لا بين بعضهم بعضا بل في الخيام يطوف عليهم الخدام بالحور العين والله أعلم. وقوله تعالى \"كأمثال اللؤلؤ المكنون\" أي كأنهن اللؤلؤ الرطب في بياضه وصفائه كما تقدم في سورة الصافات \"كأنهن بيض مكنون\" وقد تقدم في سورة الرحمن وصفهن أيضا ولهذا قال \"جزاء بما كانوا يعملون\" أي هذا الذي اتحفناهم به مجازاة لهم على ما أحسنوا من العمل."
    },
    {
      "ayah": 23,
      "surah": 56,
      "text": "وقوله تعالى \"وحور عين كأمثال اللؤلؤ المكنون\" قرأ بعضهم بالرفع وتقديره ولهم فيها حور عين وقراءة الجر تحتمل معنيين أحدهما أن يكون الإعراب على الإتباع بما قبله كقوله \"يطوف عليهم ولدان مخلدون بأكواب وأباريق وكأس من معين لا يصدعون عنها ولا ينزفون وفاكهة مما يتخيرون ولحم طير مما يشتهون وحور عين\" كما قال تعالى \"وامسحوا برؤوسكم وأرجلكم\" وكما قال تعالى \"عليهم ثياب سندس خضر وإستبرق\" والاحتمال الثاني أن يكون مما يطوف به الولدان المخلدون عليهم الحور العين ولكن يكون ذلك في القصور لا بين بعضهم بعضا بل في الخيام يطوف عليهم الخدام بالحور العين والله أعلم. وقوله تعالى \"كأمثال اللؤلؤ المكنون\" أي كأنهن اللؤلؤ الرطب في بياضه وصفائه كما تقدم في سورة الصافات \"كأنهن بيض مكنون\" وقد تقدم في سورة الرحمن وصفهن أيضا ولهذا قال \"جزاء بما كانوا يعملون\" أي هذا الذي اتحفناهم به مجازاة لهم على ما أحسنوا من العمل."
    },
    {
      "ayah": 24,
      "surah": 56,
      "text": "وقوله تعالى \"وحور عين كأمثال اللؤلؤ المكنون\" قرأ بعضهم بالرفع وتقديره ولهم فيها حور عين وقراءة الجر تحتمل معنيين أحدهما أن يكون الإعراب على الإتباع بما قبله كقوله \"يطوف عليهم ولدان مخلدون بأكواب وأباريق وكأس من معين لا يصدعون عنها ولا ينزفون وفاكهة مما يتخيرون ولحم طير مما يشتهون وحور عين\" كما قال تعالى \"وامسحوا برؤوسكم وأرجلكم\" وكما قال تعالى \"عليهم ثياب سندس خضر وإستبرق\" والاحتمال الثاني أن يكون مما يطوف به الولدان المخلدون عليهم الحور العين ولكن يكون ذلك في القصور لا بين بعضهم بعضا بل في الخيام يطوف عليهم الخدام بالحور العين والله أعلم. وقوله تعالى \"كأمثال اللؤلؤ المكنون\" أي كأنهن اللؤلؤ الرطب في بياضه وصفائه كما تقدم في سورة الصافات \"كأنهن بيض مكنون\" وقد تقدم في سورة الرحمن وصفهن أيضا ولهذا قال \"جزاء بما كانوا يعملون\" أي هذا الذي اتحفناهم به مجازاة لهم على ما أحسنوا من العمل."
    },
    {
      "ayah": 25,
      "surah": 56,
      "text": "قال تعالى \"لا يسمعون فيها لغوا ولا تأثيما إلا قيلا سلاما سلاما\" أي لا يسمعون في الجنة كلاما لاغيا أي عبثا خاليا عن المعنى أو مشتملا على معنى حقير أو ضعيف كما قال \"لا تسمع فيها لاغية\" أي كلمة لاغية \"ولا تأثيما\" أي ولا كلاما فيه قبح \"إلا قيلا سلاما سلاما\" أي إلا التسليم منهم بعضهم على بعض كما قال تعالى \"تحيتهم فيها سلام\" وكلامهم أيضا سالم من اللغو والإثم."
    },
    {
      "ayah": 26,
      "surah": 56,
      "text": "ثم قال تعالى \"لا يسمعون فيها لغوا ولا تأثيما إلا قيلا سلاما سلاما\" أي لا يسمعون في الجنة كلاما لاغيا أي عبثا خاليا عن المعنى أو مشتملا على معنى حقير أو ضعيف كما قال \"لا تسمع فيها لاغية\" أي كلمة لاغية \"ولا تأثيما\" أي ولا كلاما فيه قبح \"إلا قيلا سلاما سلاما\" أي إلا التسليم منهم بعضهم على بعض كما قال تعالى \"تحيتهم فيها سلام\" وكلامهم أيضا سالم من اللغو والإثم."
    },
    {
      "ayah": 27,
      "surah": 56,
      "text": "لما ذكر تعالى مال السابقين وهم المقربون عطف عليهم بذكر أصحاب اليمين وهم الأبرار كما قال ميمون بن مهران أصحاب اليمين منزلتهم دون المقربين فقال \"وأصحاب اليمين ما أصحاب اليمين\" أي شيء أصحاب اليمين وما حالهم وكيف ما لهم."
    },
    {
      "ayah": 28,
      "surah": 56,
      "text": "فقال تعالى \"في سدر مخضود\" قال ابن عباس وعكرمة ومجاهد وأبو الأحوص وقسامة ابن زهير والسفر بن قيس والحسن وقتادة وعبدالله بن كثير والسدي وأبو حرزة وغيرهم هو الذي لا شوك فيه وعن ابن عباس هو الموقر بالثمر وهو رواية عن عكرمة ومجاهد وكذا قال قتادة أيضا كنا نحدث أنه الموفو الذي لا شوك فيه والظاهر أن المراد هذا وهذا فإن سدر الدنيا كثير الشوك قليل الثمر وفي الآخرة العكس من هذا لا شوك فيه وفيه الثمر الكثير الذي قد أثقل أصله كما قال الحافظ أبو بكر أحمد بن سلمان النجار حدثنا عبدالله بن محمد هو البغوي حدثني حمزة بن العباس حدثنا عبدالله بن عثمان حدثنا عبدالله بن المبارك أخبرنا صفوان بن عمرو عن سليم بن عامر قال كان أصحاب رسول الله صلى الله عليه وسلم يقولون: إن الله لينفعنا بالأعراب ومسائلهم قال أقبل أعرابي يوما فقال يا رسول الله ذكر الله في الجنة شجرة تؤذي صاحبها فقال رسول الله صلى الله عليه وسلم \"وما هي؟\" قال السدر فإن له شوكا مؤذيا فقال رسول الله صلى الله عليه وسلم أليس الله تعالى يقول \"في سدر مخضود\" خضد الله شوكه فجعل مكان كل شوكه ثمرة فإنها لتنبت ثمرا تفتق الثمرة منها عن اثنين وسبعين لونا من طعام ما فيها لون يشبه الآخر\". \"طريق آخر\" قال أبو بكر بن أبي داود حدثنا محمد بن المصفي حدثنا محمد بن المبارك حدثني يحيى بن حمزة حدثني ثور بن مزيد حدثني حبيب بن عبيد عن عتبة بن عبدالسلمي قال كنت جالسا مع رسول الله صلي الله عليه وسلم فجاء أعرابي فقال يا رسول الله أسمعك تذكر في الجنة شجرة لا أعلم أكثر شوكا منها يعني الطلح فقال رسول الله صلى الله عليه وسلم \"إن الله يجعل مكان كل شوكة منها ثمرة مثل خصوة التيس الملبود فيها سبعون لونا من الطعام لا يشبه لون الآخر\"."
    },
    {
      "ayah": 29,
      "surah": 56,
      "text": "وقوله \"وطلح منضود\" الطلح شجر عظام يكون بأرض الحجاز من شجر العضاه واحدته طلحة وهو شجر كثير الشوك وأنشد ابن جرير لبعض الحداة بشرها دليلها وقالا غدا ترين الطلح والجبالا وقال مجاهد \"منضود\" أي متراكم الثمر يذكر مالك قريشا لأنهم كانوا يعجبون من وج وظلاله من طلح وسدر وقال السدي منضود مصفود قال ابن عباس يشبه طلح الدنيا ولكن له ثمر أحلى من العسل قال الجوهري والطلح لغة في الطلع \"قلت\" وقد روى ابن أبي حاتم من حديث الحسن بن سعد عن شيخ من همدان قال سمعت عليا يقول هذا الحرف في طلح منضود قال طلع منضود فعلى هذا يكون من صفة السدر فكأنه وصفه بأنه مخضود وهو الذي لا شوك له وأن طلعه منضود وهو كثرة ثمرة والله أعلم. وقال ابن أبي حاتم حدثنا أبو سعيد الأشج حدثنا أبو معاوية عن إدريس عن جعفر بن إياس عن أبي نضرة عن أبي سعيد \"وطلح منضود\" قال الموز قال وروي عن ابن عباس وأبي هريرة والحسن وعكرمة وقسامة بن زهير وقتادة وأبي حزرة مثل ذلك وبه قال مجاهد وابن زيد وزاد فقال أهل اليمن يسمون الموز الطلح ولم يحك ابن جرير غير هذا القول وقوله تعالى \"وظل ممدود\" قال البخاري حدثنا علي بن عبدالله حدثنا سفيان عن أبي الزناد عن الأعرج عن أبي هريرة يبلغ به النبي صلى الله عليه وسلم قال \"إن في الجنة شجرة يسير الراكب في ظلها مائة عام لا يقطعها اقرءوا إن شئتم."
    },
    {
      "ayah": 3,
      "surah": 56,
      "text": "أي تخفض أقواما إلى أسفل سافلين إلى الجحيم وإن كانوا في الدنيا أعزاء وترفع آخرين إلى أعلى عليين إلى النعيم المقيم وإن كانوا في الدنيا وضعاء هكذا قال الحسن وقتادة وغيرهما. وقال ابن أبي حاتم حدثنا أبي حدثنا أبو زيد بن عبد الرحمن بن مصعب المعني حدثنا حميد بن عبدالرحمن الرواسي عن أبيه عن سماك عن عكرمة عن ابن عباس \"خافضة رافعة\" تخفض أقواما وترفع آخرين. وقال عبيد الله العتكي عن عثمان بن سراقة ابن خالة عمر بن الخطاب \"خافضة رافعة\" قال الساعة خفضت أعداء الله إلى النار ورفعت أولياء الله إلى الجنة وقال محمد بن كعب تخفض رجالا كانوا في الدنيا مرتفعين وترفع رجالا كانوا في الدنيا مخفوضين وقال السدي خفضت المتكبرين ورفعت المتواضعين وقال العوفي عن ابن عباس \"خافضة رافعة\" أسمعت القريب والبعيد وقال عكرمة خفضت فأسمعت الأدنى ورفعت فأسمعت الأقصى. وكذا قال الضحاك وقتادة."
    },
    {
      "ayah": 30,
      "surah": 56,
      "text": "\"وظل ممدد\" ورواه مسلم من حديث الأعرج به وقال الإمام أحمد حدثنا شريح حدثنا فليح عن هلال بن علي عن عبدالرحمن بن أبي عمرة عن أبي هريرة قال: قال صلى الله عليه وسلم \"إن في الجنة شجرة يسير الراكب في ظلها مائة عام اقرءوا إن شئتم \"وظل ممدود\" وكذا رواه مسلم من حديث الأعرج به وكذا رواه البخاري عن محمد بن سفيان عن فليح به وكذا رواه عبدالرزاق عن معمر عن همام بن منبه عن أبي هريرة وكذا رواه حماد بن سلمة عن محمد بن زياد عن أبي هريرة والليث بن سعد عن سعيد المقبري عن أبيه عن أبي هريرة وعوف عن ابن سيرين عن أبي هريرة به وقال الإمام أحمد حدثنا محمد بن جعفر وحجاج قالا حدثنا شعبة سمعت أبا الضحاك يحدث عن أبي هريرة عن رسول الله صلى الله عليه وسلم أنه قال \"إن في الجنة شجرة يسير الراكب في ظلها سبعين أو مائة سنة هي شجرة الخلد\" وقال ابن أبي حاتم حدثنا أحمد بن سنان حدثنا يزيد بن هارون عن محمد بن عمرو بن أبي سلمة عن أبي هريرة عن رسول الله صلي الله عليه وسلم قال \"في الجنة شجرة يسير الراكب في ظلها مائة عام ما يقطعها واقرءوا إن شئتم \"وظل ممدود\" إسناده جيد ولم يخرجوه وهكذا رواه ابن جرير عن أبي كريب عن عبدة وعبـد الرحيم والبخاري كلهم عن محمد بن عمرو به وقد رواه الترمذي من حديث عبدالرحيم بن سليمان به وقال ابن جرير حدثنا ابن حميد حدثنا مهران حدثنا إسماعيل بن أبي خالد عن زياد مولى بني مخزوم عن أبي هريرة قال: إن في الجنة لشجرة يسير الراكب في ظلها مائة عام اقرءوا إن شئتم \"وظل ممدود\" \"فبلغ ذلك كعبا فقال صدق والذي أنزل التوراة على موسى والفرقان على محمد لو أن رجلا ركب حقة أو جذعة ثم دار بأعلى تلك الشجرة ما بلغها حتى يسقط هرما إن الله تعالى غرسها بيده ونفخ فيها من روحه لأن أفنائها لمن وراء سور الجنة وما في الجنة نهر إلا وهو يخرج من أصل تلك الشجرة. وقال الحافظ أبو يعلى الموصلي حدثنا محمد بن منهال الضرير حدثنا يزيد بن زريع عن سعد بن أبي عروبة عن قتادة عن أنس عن النبي صلى الله عليه وسلم في قول الله تعالى \"وظل ممدود\" قال \"في الجنة شجرة يسير الراكب في ظلها مائة عام لا يقطعها \" وكذا رواه البخاري عن روح بن عبد المؤمن عن يزيد بن زريع وهكذا رواه أبو داود الطيالسي عن عمران بن داود القطان عن قتادة به وكذا رواه معمر وأبو هلال عن قتادة به وقد أخرج البخاري ومسلم من حديث أبي سعيد وسهل بن سعد عن رسول الله صلى الله عليه وسلم قال \"إن في الجنة شجرة يسير الراكب الجواد المضمر السريع مائة عام يقطعها\" فهذا حديث ثابت عن رسول الله صلي الله عليه وسلم بل متواتر مقطوع بصحته عند أئمة الحديث النقاد لتعدد طرقه وقوة أسانيده وثقة رجاله. وقد قال الإمام أبو جعفر ابن جرير حدثنا أبو كريب حدثنا أبو بكر حدثنا أبو حصين قال: كنا على باب في موضع ومعنا أبو صالح وشقيق يعني الضبي فحدث أبو صالح قال حدثني أبو هريرة قال إن في الجنة شجرة يسير الراكب في ظلها سبعين عاما قال أبو صالح أتكذب أبا هريرة؟ قال ما أكذب أبا هريرة ولكني أكذبك أنت فشق ذلك على القراء يومئذ \"قلت\" فقد أبطل من يكذب بهذا الحديث مع ثبوته وصحته ورفعه إلى رسول الله صلى الله عليه وسلم. وقال الترمذي حدثنا أبو سعيد الأشج حدثنا زياد بن الحسن بن الفرات القزاز عن أبيه عن جده عن أبي حازم عن أبي هريرة فال: قال رسول الله صلى الله عليه وسلم\" ما في الجنة شجرة إلا ساقها من ذهب\" ثم قال حسن غريب. وقال ابن أبي حاتم حدثنا الحسن بن أبي الربيع حدثنا أبو عامر العقدي عن زمعة بن صالح عن سلمة بن وهرام عن عكرمة عن ابن عباس قال الظل الممدود شجرة في الجنة على ساق ظلها قدر ما يسير الراكب في كل نواحيها مائة عام قال فيخرج إليها أهل الجنة أهل الغرف وغيرهم فيتحدثون في ظلها قال فيشتهي بعضهم ويذكر لهو الدنيا فيرسل الله ريحا من الجنة فتحرك تلك الشجرة بكل لهو في الدنيا. هذا أثر غريب وإسناده جيد قوي حسن وقال ابن أبي حاتم حدثنا أبو سعيد الأشج حدثنا ابن يمان حدثنا سفيان حدثنا أبو إسحاق عن عمرو بن ميمون في قوله تعالى \"وظل ممدود\" قال سبعون ألف سنة وكذا رواه ابن جرير عن بندار عن ابن مهدي عن سفيان مثله ثم قال ابن جرير حدثنا ابن حميد حدثنا مهران عن سفيان عن أبي إسحاق عن عمرو بن ميمون وظل ممدود قال خمسمائة ألف سنة وقال ابن أبي حاتم حدثنا أبي حدثنا أبو الوليد الطيالسي حدثنا حصين بن نافع عن الحسن في قوله الله تعالى \"وظل ممدود\" قال في الجنة شجرة يسير الراكب في ظلها مائة سنة لا يقطعها وقال عوف عن الحسن بلغني أن رسول الله صلى الله عليه وسلم قال \"إن في الجنة لشجرة يسير الراكب في ظلها مائة عام لا يقطعها\" رواه ابن جرير وقال شبيب عن عكرمة عن ابن عباس في الجنة شجر لا يحمل يستظل به رواه ابن أبي حاتم وقال الضحاك والسدي وأبو حزرة في قوله تعالى \"وظل ممدود\" لا ينقطع ليس فيها شمس ولا حر مثل قبل طلوع الفجر وقال ابن مسعود الجنة سجسج كما بين طلوع الفجر إلى طلوع الشمس وقد تقدمت الآيات كقوله \"وندخلهم ظلا ظليلا\" وقوله \"أكلها دائم وظلها\" وقوله \"في ظلال وعيون\" إلى غير ذلك من الآيات."
    },
    {
      "ayah": 31,
      "surah": 56,
      "text": "وقوله تعالى \"وماء مسكوب\" قال الثوري يجري في غير أخدود وقد تقدم الكلام عند تفسير قوله تعالى \"فيها أنهار من ماء غير آسن\" الآية بما أغنى عن إعادته ههنا."
    },
    {
      "ayah": 32,
      "surah": 56,
      "text": "وقوله تعالى \"وفاكهة كثيرة لا مقطوعة ولا ممنوعة\" أي وعندهم من الفواكه الكثيرة المتنوعة في الألوان مما لا عين رأت ولا أذن سمعت ولا خطر على قلب بشر كما قال تعالى \"كلما رزقوا منها من ثمرة رزقا قالوا هذا الذي رزقنا من قبل وأتوا به متشابها\" أي يشبه الشكل ولكن الطعم غير الطعم وفي الصحيحين في ذكر سدرة المنتهى \"فإذا ورقها كآذان الفيلة ونبقها مثلا قلال هجر\" وفيهما أيضا من حديث مالك عن زيد عن عطاء بن يسار عن ابن عباس قال خسفت الشمس فصلى رسول الله صلى الله عليه وسلم والناس معه فذكر الصلاة وفيه قالوا يا رسول الله رأيناك تناولت شيئا في مقامك هذا ثم رأيناك تكعكعت قال \"إني رأيت الجنة فتناولت منها عنقودا ولو أخذته لأكلتم منه ما بقيت الدنيا\" وقال الحافظ أبو يعلى حدثنا أبو خيثمة حدثنا عبدالله بن جعفر حدثنا عبيد الله حدثنا أبو عقيل عن جابر قال بينا نحن في صلاة الظهر إذ تقدم رسول الله صلى الله عليه وسلم فتقدمنا معه ثم تناول شيئا ليأخذه ثم تأخر فلما قضى الصلاة قال له أبي بن كعب يا رسول الله صنعت اليوم في الصلاة شيئا ما كنت تصنعه فقال: \"إنه عرضت علي الجنة وما فيها من الزهرة والنضرة فتناولت منها قطقا من عنب لآتيكم به فحيل بيني وبينه ولو أتيتكم به لأكل منه من بين السماء والأرض لا ينقص منه \"وروى مسلم من حديث أبي الزبير عن جابر نحوه. وقال الإمام أحمد حدثنا علي بن بحر حدثنا هشام بن يوسف أخبرنا معمر عن أبي يحيى بن أبي كثير عن عامر. بن زيد البكالي أنه سمع عتبة بن عبد السلمي يقول جاء أعرابي إلى رسول الله صلى الله عليه وسلم فسأله عن الحوض وذكر الجنة ثم قال الأعرابي فيها فاكهـة. قال \"نعم وفيها شجرة تدعى طوبي\" قال فذكر شيئا لا أدري ما هو قال أي شجر أرضنا تشبه؟ قال \"ليست تشبه شيئا من شجر أرضك\" فقال النبي صلى الله عليه وسلم\"أتيت الشام\" قال لا قال \"تشبه شجرة بالشام تدعى الجوزة تنبت على ساق واحد وينفرش أعلاها\" قال ما عظم العنقود؟ قال \"مسيرة شهر للغراب الأبقع لا يفتر\" قال ما عظم أصلها؟ قال \"لو ارتحلت جذعة من إبل أهلك ما أحاطت بأصلها حتى تنكسر ترقوتها هرما\" قال فيها عنب؟ قال \"نعم\" قال فما عظم الحبة؟ قال \"هل ذبح أبوك تيسا من غنمه قط عظيما\" قال نعم قال \"فسلخ إهابه فأعطاه أمك فقال أتخذي لنا منه دلوا\" قال نعم قال الأعرابي فإن تلك الحبة لتشبعني وأهل بيتي؟ قال \"نعم وعامة عشيرتك\" وقوله تعالى \"لا مقطوعة ولا ممنوعة\" أي لا تنقطع شتاء ولا صيفا بل أكلها دائم مستمر أبدا مهما طلبوا وجدوا لا يمتنع عليهم بقدرة الله شيء وقال قتادة لا يمنعهم من تناولها عود ولا شوك ولا بعد وقد تقدم في الحديث: إذا تناول الرجل الثمرة عادت مكانها أخرى. وقوله تعالى \"وفرش مرفوعة\" أي عالية وطيئة ناعمة قال النسائي وأبو عيسى الترمذي حدثنا أبو كريب حدثنا رشدين بن سعد عن عمر بن الحارث عن دراج عن أبي الهيثم عن أبي سعيد عن النبي صلى الله عليه وسلم في قوله تعالى \"وفرش مرفوعة\" قال \"ارتفاعها كما بين السماء والأرض ومسيرة ما بينهما خمسمائة عام\" ثم قال الترمذي هذا حديث حسن غريب لا نعرفه إلا من حديث رشدين بن سعد قال: وقال بعض أهل العلم معنى هذا الحديث ارتفاع الفرش في الدرجات وبعد ما بين الدرجتين كما بين السماء والأرض هكذا قال إنه لا يعرف هذا إلا من رواية رشدين بن سعد وهو المصري وهو ضعيف هكذا رواه أبو جعفر بن جرير عن أبي كريب عن رشدين به. ثم رواه هو وابن أبي حاتم كلاهما عن يونس بن عبد الأعلى عن ابن وهب عن عمر بن الحارث فذكره وكذا رواه ابن أبي حاتم أيضا عن نعيم بن حماد عن ابن وهب وأخرجه الضياء في صفة الجنة من حديث حرملة عن ابن وهب به مثله ورواه الإمام أحمد عن حسن بن موسى عن ابن لهيعة حدثنا دراج فذكره. وقال ابن أبي حاتم أيضا حدثنا أبو سعيد الأشج حدثنا أبو معاوية جويبر عن أبي سهل يعني كثير بن زياد عن الحسن."
    },
    {
      "ayah": 33,
      "surah": 56,
      "text": "وقوله تعالى \"وفاكهة كثيرة لا مقطوعة ولا ممنوعة\" أي وعندهم من الفواكه الكثيرة المتنوعة في الألوان مما لا عين رأت ولا أذن سمعت ولا خطر على قلب بشر كما قال تعالى \"كلما رزقوا منها من ثمرة رزقا قالوا هذا الذي رزقنا من قبل وأتوا به متشابها\" أي يشبه الشكل ولكن الطعم غير الطعم وفي الصحيحين في ذكر سدرة المنتهى \"فإذا ورقها كآذان الفيلة ونبقها مثلا قلال هجر\" وفيهما أيضا من حديث مالك عن زيد عن عطاء بن يسار عن ابن عباس قال خسفت الشمس فصلى رسول الله صلى الله عليه وسلم والناس معه فذكر الصلاة وفيه قالوا يا رسول الله رأيناك تناولت شيئا في مقامك هذا ثم رأيناك تكعكعت قال \"إني رأيت الجنة فتناولت منها عنقودا ولو أخذته لأكلتم منه ما بقيت الدنيا\" وقال الحافظ أبو يعلى حدثنا أبو خيثمة حدثنا عبدالله بن جعفر حدثنا عبيد الله حدثنا أبو عقيل عن جابر قال بينا نحن في صلاة الظهر إذ تقدم رسول الله صلى الله عليه وسلم فتقدمنا معه ثم تناول شيئا ليأخذه ثم تأخر فلما قضى الصلاة قال له أبي بن كعب يا رسول الله صنعت اليوم في الصلاة شيئا ما كنت تصنعه فقال: \"إنه عرضت علي الجنة وما فيها من الزهرة والنضرة فتناولت منها قطقا من عنب لآتيكم به فحيل بيني وبينه ولو أتيتكم به لأكل منه من بين السماء والأرض لا ينقص منه \"وروى مسلم من حديث أبي الزبير عن جابر نحوه. وقال الإمام أحمد حدثنا علي بن بحر حدثنا هشام بن يوسف أخبرنا معمر عن أبي يحيى بن أبي كثير عن عامر. بن زيد البكالي أنه سمع عتبة بن عبد السلمي يقول جاء أعرابي إلى رسول الله صلى الله عليه وسلم فسأله عن الحوض وذكر الجنة ثم قال الأعرابي فيها فاكهـة. قال \"نعم وفيها شجرة تدعى طوبي\" قال فذكر شيئا لا أدري ما هو قال أي شجر أرضنا تشبه؟ قال \"ليست تشبه شيئا من شجر أرضك\" فقال النبي صلى الله عليه وسلم\"أتيت الشام\" قال لا قال \"تشبه شجرة بالشام تدعى الجوزة تنبت على ساق واحد وينفرش أعلاها\" قال ما عظم العنقود؟ قال \"مسيرة شهر للغراب الأبقع لا يفتر\" قال ما عظم أصلها؟ قال \"لو ارتحلت جذعة من إبل أهلك ما أحاطت بأصلها حتى تنكسر ترقوتها هرما\" قال فيها عنب؟ قال \"نعم\" قال فما عظم الحبة؟ قال \"هل ذبح أبوك تيسا من غنمه قط عظيما\" قال نعم قال \"فسلخ إهابه فأعطاه أمك فقال أتخذي لنا منه دلوا\" قال نعم قال الأعرابي فإن تلك الحبة لتشبعني وأهل بيتي؟ قال \"نعم وعامة عشيرتك\" وقوله تعالى \"لا مقطوعة ولا ممنوعة\" أي لا تنقطع شتاء ولا صيفا بل أكلها دائم مستمر أبدا مهما طلبوا وجدوا لا يمتنع عليهم بقدرة الله شيء وقال قتادة لا يمنعهم من تناولها عود ولا شوك ولا بعد وقد تقدم في الحديث: إذا تناول الرجل الثمرة عادت مكانها أخرى. وقوله تعالى \"وفرش مرفوعة\" أي عالية وطيئة ناعمة قال النسائي وأبو عيسى الترمذي حدثنا أبو كريب حدثنا رشدين بن سعد عن عمر بن الحارث عن دراج عن أبي الهيثم عن أبي سعيد عن النبي صلى الله عليه وسلم في قوله تعالى \"وفرش مرفوعة\" قال \"ارتفاعها كما بين السماء والأرض ومسيرة ما بينهما خمسمائة عام\" ثم قال الترمذي هذا حديث حسن غريب لا نعرفه إلا من حديث رشدين بن سعد قال: وقال بعض أهل العلم معنى هذا الحديث ارتفاع الفرش في الدرجات وبعد ما بين الدرجتين كما بين السماء والأرض هكذا قال إنه لا يعرف هذا إلا من رواية رشدين بن سعد وهو المصري وهو ضعيف هكذا رواه أبو جعفر بن جرير عن أبي كريب عن رشدين به. ثم رواه هو وابن أبي حاتم كلاهما عن يونس بن عبد الأعلى عن أبن وهب عن عمر بن الحارث فذكره وكذا رواه ابن أبي حاتم أيضا عن نعيم بن حماد عن ابن وهب وأخرجه الضياء في صفة الجنة من حديث حرملة عن ابن وهب به مثله ورواه الإمام أحمد عن حسن بن موسى عن ابن لهيعة حدثنا دراج فذكره. وقال ابن أبي حاتم أيضا حدثنا أبو سعيد الأشج حدثنا أبو معاوية جويبر عن أبي سهل يعني كثير بن زياد عن الحسن."
    },
    {
      "ayah": 34,
      "surah": 56,
      "text": "\"وفرش مرفوعة\" قال ارتفاع فراش الرجل من أهل الجنة مسيرة ثمانين سنة. وقوله تعالى \"إنا أنشأناهن إنشاء فجعلناهن أبكارا عربا أترابا لأصحاب اليمين\" جرى الضمير على غير مذكور لكن لما دل السياق وهو ذكر الفرش على النساء اللاتي يضاجعن فيها اكتفى بذلك عن ذكرهن وعاد الضمير عليهن كما في قوله تعالى \"إذ عرض عليه بالعشى الصافنات الجياد فقال إني أحببت حب الخير عن ذكر ربي حتى توارت بالحجاب\" يعني الشمس على المشهور من قولي المفسرين."
    },
    {
      "ayah": 35,
      "surah": 56,
      "text": "قال الأخفش في قوله تعالى \"إنا أنشأناهن\" أضمرهن ولم يذكرن قبل ذلك وقال أبو عبيدة ذكرن في قوله تعالى \"وحور عين كأمثال اللؤلؤ المكنون\" فقوله تعالى \"إنا أنشأناهن\" أي أعدناهن في النشأة الأخرى بعدما كن عجائز رمصا صرن أبكارا عربا أي بعد الثيوبة عدن أبكارا عربا متحببات إلى أزواجهن بالحلاوة والظرافة والملاحة وقال بعضهم عربا أي غنجات قال موسى بن عبيدة الربذي عن يزيد الرقاشي عن أنس بن مالك قال: قال رسول الله صلى الله عليه وسلم \"إنا أنشأناهن إنشاء\" - قال - نساء عجائزكن في الدنيا عمشا رمصا\" رواه الترمذي وابن جرير وابن أبي حاتم ثم قال الترمذي غريب وموسى ويزيد ضعيفان وقال ابن أبي حاتم حدثنا محمد بن عوف الحمصي حدثنا آدم يعني ابن أبي إياس حدثنا شيبان عن جابر عن يزيد بن مرة عن سلمة بن يزيد قال سمعت رسول الله صلى الله عليه وسلم يقول في قوله تعالى \"إنا أنشأناهن إنشاء\" يعني \"الثيب والأبكار اللاتي كن في الدنيا\" وقال عبد بن حميد حدثنا مصعب بن المقدام حدثنا المبارك بن فضالة عن الحسن قال أتت عجوز فقالت يا رسول الله ادع الله تعالى أن يدخلني الجنة فقال \"يا أم فلان إن الجنة لا تدخلها عجوز\" قال فولت تبكى قال \"أخبروها أنها لا تدخلها وهي عجوز إن الله تعالى يقول \"إنا أنشأناهن إنشاء فجعلناهن أبكارا \" وهكذا رواه الترمذي في الشمائل عن عبد بن حميد وقال أبو القاسم الطبراني حدثنا بكر بن سهل الدمياطي حدثنا عمرو بن هاشم البيروتي أخبرنا سليمان بن أبي كريمة عن هشام بن حسان عن الحسن عن أمه عن أم سلمة قالت: قلت يا رسول الله أخبرني عن قول الله تعالى \"حور عين\" قال \"حور بيض عين ضخام العيون شفر الحوراء بمنزلة جناح النسر\" قلت أخبرني عن قوله تعالى \"كأمثال اللؤلؤ المكنون\" قال \"صفاؤهن صفاء الدر الذي في الأصداف الذي لم تمسه الأيدي\" قلت أخبرني عن قوله \"فيهن خيرات حسان\" قال خيرات الأخلاق حسان الوجوه\" قلت أخبرني عن قوله \"كأنهن بيض مكنون\" قال \"رقتهن كرقة الجلد الذي رأيت في داخل البيضة مما يلي القشر وهو الغرفيء\" قلت يا رسول الله أخبرني عن قوله \"عربا أترابا\" قال \"هن اللواتي قبضن في الدار الدنيا عجائز رمصا شمطا خلقهن الله بعد الكبر فجعلهن عذارى عربا متعشقات محببات أترابا على ميلاد واحد\" قلت يا رسول الله نساء الدنيا أفضل أم الحور العين قال: \"بل نساء الدنيا أفضل من الحور العين كفضل الظهارة على البطانة\" قلت يا رسول الله وبم ذاك؟ قال \"بصلاتهن وصيامهن وعبادتهن الله عز وجل ألبس الله وجوههن النور وأجسادهن الحرير بيض الألوان خضر الثياب صفر الحلي مجامرهن الدر وأمشاطهن الذهب يقلن نحن الخالدات فلا نموت أبدا ونحن الناعمات فلا نبأس أبدا ونحن المقيمات فلا نظعن أبدا ألا ونحن الراضيات فلا نسخط أبدا طوبي لمن كنا له وكان لنا \"قلت يا رسول الله المرأة منا تتزوج زوجين والثلاثة والأربعة ثم تموت تدخل الجنة ويدخلون معها من يكون زوجها؟ قال \"يا أم سلمة إنها تخير فتختار أحسنهم خلقا فتقول يا رب إن هذا كان أحسن خلقا معي فزوجنيه يا أم سلمة ذهب حسن الخلق بخير الدنيا والآخرة\" وفي حديث الصور الطويل المشهور أن رسول الله يشفع للمؤمنين كلهم في دخول الجنة فيقول الله تعالى قد شفعتك وأذنت لهم في دخولها فكان رسول الله صلى الله عليه وسلم يقول \"والذي بعثني بالحق ما أنتم في الدنيا بأعرف بأزواجكم ومساكنكم من أهل الجنة بأزواجهم ومساكنهم فيدخل الرجل منهم على ثنتين وسبعين زوجة مما ينشىء الله وثنتين من ولد آدم لهما فضل على من أنشأ الله بعبادتهما الله في الدنيا يدخل على الأولى منهما في غرفة من ياقوتة على سرير من ذهب مكلل باللؤلؤ عليه سبعون زوجا من سندس وإستبرق وأنه ليضع يده بين كتفيها ثم ينظر إلى يده من صدرها من وراء ثيابها وجلدها ولحمها وأنه لينظر إلى مخ ساقها كما ينظر أحدكم إلى السلك في قصبة الياقوت كبده لها مرآة يعني وكبدها له مرآة فبينما هو عندها لا يملها ولا تمله ولا يأتيها من مرة إلا وجدها عذراء ما يفتر ذكره ولا يشتكي قبلها إلا أنه لا منى ولا منية فبينما هو كذلك إذ نودى إنا قد عرفنا أنك لا تمل إلا تمل إلا إن لك أزواجا غيرها فيخرج فيأتيهن واحدة واحدة كلما جاء واحدة قالت والله ما في الجنه شيء أحسن منك وما في الجنة شيء أحب إلي منك\" وقال عبدالله بن وهب أخبرني عمرو بن الحارث عن دراج من ابن حجيرة عن أبي هريرة عن رسول الله صلي الله عليه وسلم أنه قال له أنطأ في الجنة؟ قال \"نعم: والذي نفسي بيده دحما دحما فإذا قام عنها رجعت مطهرة بكرا\" وقال الطبراني حدثنا إبراهيم بن جابر الفقيه البغدادي حدثنا محمد بن عبدالملك الدمشقي الواسطي حدثنا معلى بن عبدالرحمن الواسطي حدثنا شريك عن عاصم الأحول عن أبي المتوكل عن أبي سعيد قال: قال رسول الله صلى الله عليه وسلم \"إن أهل الجنة إذا جامعوا نساءهم عدن أبكارا \" وقال أبو داود الطيالسي أخبرنا عمران عن قتادة عن أنس قال: قال رسول الله صلى الله عليه وسلم\"يعطى المؤمن في الجنة قوة كذا وكذا في النساء\" قلت يا رسول الله ويطيق ذلك \"قال يعطى قوة مائة\" ورواه الترمذي من حديث أبي داود وقال صحيح غريب: وروى أبو القاسم الطبراني من حديث حسين بن علي الجعفي عن زائدة عن هشام بن حسان عن محمد بن سيرين عن أبي هريرة قال: قيل يا رسول الله هل نصل إلى نسائنا في الجنة؟ قال \"إن الرجل ليصل في اليوم إلى مائة عذراء\" قال الحافظ أبو عبدالله المقدسي هذا الحديث عندي على شرط الصحيح والله أعلم. وقوله \"عربا\" قال سعيد بن جبير عن ابن عباس يعني متحببات إلى أزواجهن ألم تر إلى الناقة الضبعة هي كذلك وقال الضحاك عن ابن عباس العرب العواشق لأزواجهن وأزواجهن لهن عاشقون وكذا قال عبدالله بن سرجس ومجاهد وعكرمة وأبو العالية ويحيى بن أبي كثير وعطية والحسن وقتادة والضحاك وغيرهم وقال ثور بن يزيد عن عكرمة قال: سئل ابن عباس عن قوله \"عربا\" قال هي الملقة لزوجها وقال شعبة عن سماك عن عكرمة هي الغنجة. وقال الأجلح بن عبدالله عن عكرمة هي المشكلة وقال صالح بن حسان عن عبدالله بن بريدة."
    },
    {
      "ayah": 36,
      "surah": 56,
      "text": "قال الأخفش في قوله تعالى \"إنا أنشأناهن\" أضمرهن ولم يذكرن قبل ذلك وقال أبو عبيدة ذكرن في قوله تعالى \"وحور عين كأمثال اللؤلؤ المكنون\" فقوله تعالى \"إنا أنشأناهن\" أي أعدناهن في النشأة الأخرى بعدما كن عجائز رمصا صرن أبكارا عربا أي بعد الثيوبة عدن أبكارا عربا متحببات إلى أزواجهن بالحلاوة والظرافة والملاحة وقال بعضهم عربا أي غنجات قال موسى بن عبيدة الربذي عن يزيد الرقاشي عن أنس بن مالك قال: قال رسول الله صلى الله عليه وسلم\"إنا أنشأناهن إنشاء\" - قال - نساء عجائزكن في الدنيا عمشا رمصا\" رواه الترمذي وابن جرير وابن أبي حاتم ثم قال الترمذي غريب وموسى ويزيد ضعيفان وقال ابن أبي حاتم حدثنا محمد بن عوف الحمصي حدثنا آدم يعني ابن أبي إياس حدثنا شيبان عن جابر عن يزيد بن مرة عن سلمة بن يزيد قال سمعت رسول الله صلى الله عليه وسلم يقول في قوله تعالى \"إنا أنشأناهن إنشاء\" يعني \"الثيب والأبكار اللاتي كن في الدنيا\" وقال عبد بن حميد حدثنا مصعب بن المقدام حدثنا المبارك بن فضالة عن الحسن قال أتت عجوز فقالت يا رسول الله ادع الله تعالى أن يدخلني الجنة فقال \"يا أم فلان إن الجنة لا تدخلها عجوز\" قال فولت تبكى قال \"أخبروها أنها لا تدخلها وهي عجوز إن الله تعالى يقول \"إنا أنشأناهن إنشاء فجعلناهن أبكارا \" وهكذا رواه الترمذي في الشمائل عن عبد بن حميد وقال أبو القاسم الطبراني حدثنا بكر بن سهل الدمياطي حدثنا عمرو بن هاشم البيروتي أخبرنا سليمان بن أبي كريمة عن هشام بن حسان عن الحسن عن أمه عن أم سلمة قالت: قلت يا رسول الله أخبرني عن قول الله تعالى \"حور عين\" قال \"حور بيض عين ضخام العيون شفر الحوراء بمنزلة جناح النسر\" قلت أخبرني عن قوله تعالى \"كأمثال اللؤلؤ المكنون\" قال \"صفاؤهن صفاء الدر الذي في الأصداف الذي لم تمسه الأيدي\" قلت أخبرني عن قوله \"فيهن خيرات حسان\" قال خيرات الأخلاق حسان الوجوه\" قلت أخبرني عن قوله \"كأنهن بيض مكنون\" قال \"رقتهن كرقة الجلد الذي رأيت في داخل البيضة مما يلي القشر وهو الغرفيء\" قلت يا رسول الله أخبرني عن قوله \"عربا أترابا\" قال \"هن اللواتي قبضن في الدار الدنيا عجائز رمصا شمطا خلقهن الله بعد الكبر فجعلهن عذارى عربا متعشقات محببات أترابا على ميلاد واحد\" قلت يا رسول الله نساء الدنيا أفضل أم الحور العين قال: \"بل نساء الدنيا أفضل من الحور العين كفضل الظهارة على البطانة\" قلت يا رسول الله وبم ذاك؟ قال \"بصلاتهن وصيامهن وعبادتهن الله عز وجل ألبس الله وجوههن النور وأجسادهن الحرير بيض الألوان خضر الثياب صفر الحلي مجامرهن الدر وأمشاطهن الذهب يقلن نحن الخالدات فلا نموت أبدا ونحن الناعمات فلا نبأس أبدا ونحن المقيمات فلا نظعن أبدا ألا ونحن الراضيات فلا نسخط أبدا طوبي لمن كنا له وكان لنا \"قلت يا رسول الله المرأة منا تتزوج زوجين والثلاثة والأربعة ثم تموت تدخل الجنة ويدخلون معها من يكون زوجها؟ قال \" يا أم سلمة إنها تخير فتختار أحسنهم خلقا فتقول يا رب إن هذا كان أحسن خلقا معي فزوجنيه يا أم سلمة ذهب حسن الخلق بخير الدنيا والآخرة\" وفي حديث الصور الطويل المشهور أن رسول الله يشفع للمؤمنين كلهم في دخول الجنة فيقول الله تعالى قد شفعتك وأذنت لهم في دخولها فكان رسول الله صلى الله عليه وسلم يقول \"والذي بعثني بالحق ما أنتم في الدنيا بأعرف بأزواجكم ومساكنكم من أهل الجنة بأزواجهم ومساكنهم فيدخل الرجل منهم على ثنتين وسبعين زوجة مما ينشىء الله وثنتين من ولد آدم لهما فضل على من أنشأ الله بعبادتهما الله في الدنيا يدخل على الأولى منهما في غرفة من ياقوتة على سرير من ذهب مكلل باللؤلؤ عليه سبعون زوجا من سندس وإستبرق وأنه ليضع يده بين كتفيها ثم ينظر إلى يده من صدرها من وراء ثيابها وجلدها ولحمها وأنه لينظر إلى مخ ساقها كما ينظر أحدكم إلى السلك في قصبة الياقوت كبده لها مرآة يعني وكبدها له مرآة فبينما هو عندها لا يملها ولا تمله ولا يأتيها من مرة إلا وجدها عذراء ما يفتر ذكره ولا يشتكي قبلها إلا أنه لا منى ولا منية فبينما هو كذلك إذ نودى إنا قد عرفنا أنك لا تمل إلا تمل إلا إن لك أزواجا غيرها فيخرج فيأتيهن واحدة واحدة كلما جاء واحدة قالت والله ما في الجنه شيء أحسن منك وما في الجنة شيء أحب إلي منك\" وقال عبدالله بن وهب أخبرني عمرو بن الحارث عن دراج من ابن حجيرة عن أبي هريرة عن رسول الله صلي الله عليه وسلم أنه قال له أنطأ في الجنة؟ قال \"نعم: والذي نفسي بيده دحما دحما فإذا قام عنها رجعت مطهرة بكرا\" وقال الطبراني حدثنا إبراهيم بن جابر الفقيه البغدادي حدثنا محمد بن عبدالملك الدمشقي الواسطي حدثنا معلى بن عبدالرحمن الواسطي حدثنا شريك عن عاصم الأحول عن أبي المتوكل عن أبي سعيد قال: قال رسول الله صلى الله عليه وسلم \"إن أهل الجنة إذا جامعوا نساءهم عدن أبكارا \" وقال أبو داود الطيالسي أخبرنا عمران عن قتادة عن أنس قال: قال رسول الله صلى الله عليه وسلم\"يعطى المؤمن في الجنة قوة كذا وكذا في النساء\" قلت يا رسول الله ويطيق ذلك \"قال يعطى قوة مائة\" ورواه الترمذي من حديث أبي داود وقال صحيح غريب: وروى أبو القاسم الطبراني من حديث حسين بن علي الجعفي عن زائدة عن هشام بن حسان عن محمد بن سيرين عن أبي هريرة قال: قيل يا رسول الله هل نصل إلى نسائنا في الجنة؟ قال \"إن الرجل ليصل في اليوم إلى مائة عذراء\" قال الحافظ أبو عبدالله المقدسي هذا الحديث عندي على شرط الصحيح والله أعلم. وقوله \"عربا\" قال سعيد بن جبير عن ابن عباس يعني متحببات إلى أزواجهن ألم تر إلى الناقة الضبعة هي كذلك وقال الضحاك عن ابن عباس العرب العواشق لأزواجهن وأزواجهن لهن عاشقون وكذا قال عبدالله بن سرجس ومجاهد وعكرمة وأبو العالية ويحيى بن أبي كثير وعطية والحسن وقتادة والضحاك وغيرهم وقال ثور بن يزيد عن عكرمة قال: سئل ابن عباس عن قوله \"عربا\" قال هي الملقة لزوجها وقال شعبة عن سماك عن عكرمة هي الغنجة. وقال الأجلح بن عبدالله عن عكرمة هي المشكلة وقال صالح بن حسان عن عبدالله بن بريدة."
    },
    {
      "ayah": 37,
      "surah": 56,
      "text": "في قوله \"عربا\" قال الشكلة بلغة أهل مكة والغنجة بلغة أهل المدينة وقال تميم بن حذلم هي حسن التبعل وقال زيد بن أسلم وابنه عبدالرحمن العرب حسنات الكلام وقال ابن أبي حاتم ذكر عن سهل بن عثمان العسكري حدثنا أبو علي عن جعفر بن محمد عن أبيه عن جده قال: قال رسول الله \"عربا\" - قال - كلامهن عربي\" وقوله \"أترابا\" قال الضحاك عن ابن عباس يعني في سن واحدة ثلاث وثلاثين سنة وقال مجاهد الأتراب المستويات وفي رواية عنه الأمثال وقال عطية الأقران وقال السدي \"أترابا\" أي في الأخلاق المتواخيات بينهن ليس بينهن تباغض ولا تحاسد يعني لا كما كن ضرائر متعاديات وقال ابن أبي حاتم حدثنا أبو سعيد الأشج حدثنا أبو أسامة عن عبدالله بن الكهف عن الحسن ومحمد \"عربا أترابا\" \"قال المستويات الأسنان يأتلفن جميعا ويلعبن جميعا وقد روى أبو عيسى الترمذي عن أحمد بن منيع عن أبي معاوية عن عبدالرحمن بن إسحاق عن النعمان بن سعد عن على رضي الله عنه قال: قال رسول الله صلي الله عليه وسلم\"إن في الجنة لمجتمعا للحور العين يرفعن أصواتا لم تسمع الخلائق بمثلها قال يقلن نحن الخالدات فلا نبيد ونحن الناعمات فلا نبأس ونحن الراضيات فلا نسخط طوبي لمن كان لنا وكنا له\" ثم قال هذا حديث غريب. وقال الحافظ أبو يعلى أخبرنا أبو خيثمة حدثنا إسماعيل بن عمر حدثنا ابن أبي ذئب عن فلان عبدالله بن رافع عن بعض ولد أنس بن مالك عن أنس أن رسول الله صلى الله عليه وسلم قال \"إن الحور العين ليغنين في الجنة يقلن نحن خيرات حسان خبئنا لأزواج كرام\" قلت إسماعيل بن عمر هذا هو أبو المنذر الواسطي أحد الثقات الأثبات. وقد روى هذا الحديث الإمام عبدالرحيم بن إبراهيم الملقب بدحيم عن ابن أبي فديك عن ابن أبي ذئب عن عون بن الخطاب بن عبدالله بن رافع عن ابن لأنس عن أنس قال: قال رسول الله صلى الله عليه وسلم\"إن الحور العين يغنين في الجنة نحن الحور الحسان خلقنا لأزواج كرام \"."
    },
    {
      "ayah": 38,
      "surah": 56,
      "text": "وقوله تعالى \"لأصحاب اليمين\" أي خلقن لأصحاب اليمين أو ادخرن لأصحاب اليمين أو زوجن لأصحاب اليمين والأظهر أنه متعلق بقوله \"إنا أنشأناهن إنشاء فجعلناهن أبكارا عربا أترابا لأصحاب اليمين\" فتقديره أنشأناهن لأصحاب اليمين وهذا توجيه ابن جرير وروي عن أبي سليمان الداراني رحمه الله قال صليت ليلة ثم جلست أدعو وكان البرد شديدا فجعلت أدعو بيد واحدة فأخذتني عيني فنمت فرأيت حوراء لم ير مثلها وهي تقول يا أبا سليمان أتدعو بيد واحدة وأنا أغذى لك في النعيم منذ خمسمائة سنة قلت ويحتمل أن يكون قوله \"لأصحاب اليمين\" متعلقا بما قبله وهو قوله \"أترابا لأصحاب اليمن\" أي في أسنانهم كما جاء في الحديث الذي رواه البخاري ومسلم من حديث جرير عن عمارة بن القعقاع عن أبي زرعة عن أبي هريرة قال: قال رسول الله صلى الله عليه وسلم\"أول زمرة يدخلون الجنة على صورة القمر ليلة البدر والذين يلونهم على ضوء أشد كوكب دري في السماء إضاءة لا يبولون ولا يتغوطون ولا يتفلون ولا يتمخطون. أمشاطهم الذهب ورشحهم المسك ومجامرهم الألوة وأزواجهم الحور العين أخلاقهم على خلق رجل واحد على صورة أبيهم آدم ستون ذراعا في السماء\" وقال الإمام أحمد حدثنا يزيد بن هارون وعفان قالا حدثنا حماد بن سلمة. وروى الطبراني واللفظ له من حديث حماد بن سلمة عن علي بن زيد بن جدعان عن سعيد بن المسيب عن أبي هريرة قال: قال رسول الله صلى الله عليه وسلم \"يدخل أهل الجنة جردا مردا بيضا جعادا مكحلين أبناء ثلاث وثلاثين وهم على خلق آدم ستون ذراعا في عرض سبعة أذرع\". وروى الترمذي من حديث أبي داود الطيالسي عن عمران القطان عن قتادة عن شهر بن حوشب عن عبدالرحمن بن غنم عن معاذ بن جبل أن رسول الله صلى الله عليه وسلم قال \"يدخل أهل الجنة الجنة جردا مردا مكحلين بني ثلاث وثلاثين سنة\" ثم قال حسن غريب وقال ابن وهب أخبرنا عمرو بن الحارث أن دراجا أبا السمح حدثه عن أبي الهيثم عن أبي سعيد قال: قال رسول الله صلى الله عليه وسلم \"من مات من أهل الجنة من صغير أو كبير يردون بني ثلاث وثلاثين في الجنة لا يزيدون عليها أبدا وكذلك أهل النار\" ورواه الترمذي عن سويد بن نصر عن ابن المبارك عن رشدين بن سعد عن عمرو بن الحارث به. وقال أبو بكر بن أبي الدنيا حدثنا القاسم بن هاشم حدثنا صفوان بن صالح حدثنا رواد بن الجراح العسقلاني حدثنا الأوزاعي عن هارون بن ذئاب عن أنس قال: قال رسول الله صلى الله عليه وسلم\"يدخل أهل الجنة الجنة على طول آدم ستين ذراعا بذراع الملك على حسن يوسف وعلى ميلاد عيسى ثلاث وثلاثين سنة وعلى لسان محمد جرد مرد مكحلون\" وقال أبو بكر ابن أبي داود حدثنا محمد بن خالد وعباس بن الوليد قالا حدثنا عمر عن الأوزاعي عن هارون بن ذئاب عن أنس بن مالك قال: قال رسول الله صلى الله عليه وسلم\"يبعث أهل الجنة على صورة آدم في ميلاد عيسى ثلاث وثلاثين جردا مردا مكحلين ثم يذهب بهم إلى شجرة في الجنة فيكسون منها لا تبلى ثيابهم ولا يفنى شبابهم\"."
    },
    {
      "ayah": 39,
      "surah": 56,
      "text": "وقوله تعالى \"ثلة من الأولين وثلة من الآخرين\" أي جماعة من الأولين وجماعة من الآخرين. وقال ابن أبي حاتم حدثنا المنذر بن شاذان حدثنا محمد بن بكار حدثنا سعيد بن بشير عن قتادة عن الحسن عن عمران بن حصين عن عبدالله بن مسعود قال وكان بعضهم يأخذ عن بعض قال أكربنا ذات ليلة عند رسول الله صلى الله عليه وسلم ثم غدونا عليه فقال \"عرضت علي الأنبياء وأتباعها بأممها فيمر علي النبي والنبي في العصابة والنبي في الثلاثة والنبي وليس معه أحد - وتلا قتادة هذه الآية \"أليس منكم رجل رشيد\" قال - حتى مر علي موسى بن عمران في كبكبة من بني إسرائيل قال: قلت ربي من هذا؟ قال هذا أخوك موسى بن عمران ومن تبعه من بني إسرائيل قال: قلت رب فأين أمتي؟ قال انظر عن يمينك في الضراب قال فإذا وجوه الرجال قال: قال أرضيت؟ قلت قد رضيت رب قال انظر إلى الأفق عن يسارك فإذا وجوه الرجال قال أرضيت قلت قد رضيت رب قال فإن مع هؤلاء سبعين ألفا يدخلون الجنة بغير حساب\" قال وأنشأ عكاشة بن محصن من بني أسد قال سعيد وكان بدريا قال يا نبي الله ادع الله أن يجعلني منهم فقال \"اللهم اجعله منهم\" قال انشأ رجل آخر قال يا نبي الله ادع الله أن يجعلني منهم فقال \"سبقك بها عكاشة\" قال: فقال رسول الله صلى الله عليه وسلم \"فإن استطعتم فداكم أبي وأمي أن تكونوا من أصحاب السبعين فافعلوا وإلا فكونوا من أصحاب الضراب وإلا فكونوا من أصحاب الأفق فإني قد رأيت ناسا كثيرا قد ناشبوا أحوالهم - ثم قال -إني لأرجو أن تكونوا ربع أهل الجنة\" فكبرنا ثم قال \"إني لأرجو أن تكونوا ثلث أهل الجنة\" قال فكبرنا قال \"إني لأرجو أن تكونوا نصف أهل الجنة\" قال فكبرنا قال ثم تلا رسول الله صلى الله عليه وسلم هذه الآية \"ثلة من الأولين وثلة من الآخرين\" قال: فقلنا بيننا من هؤلاء السبعون ألفا فقلنا هم الذين ولدوا في الإسلام ولم يشركوا قال فبلغه ذلك فقال \"بل هم الذين لا يكتوون ولا يسترقون ولا يتطيرون وعلى ربهم يتوكلون\" وكذا رواه ابن جرير من طريقين آخرين عن قتادة به نحوه وهذا الحديث له طرق كثيرة من غير هذا الوجه في الصحاح وغيرها قال ابن جرير حدثنا ابن حميد حدثنا مهران حدثنا سفيان عن أبان بن أبي عياش عن سعيد بن جبير عن ابن عباس \"ثلة من الأولين وثلة من الآخرين\" قال: قال رسول الله صلى الله عليه وسلم\"هما جميعا من أمتي\"."
    },
    {
      "ayah": 4,
      "surah": 56,
      "text": "أي حركت تحريكا فاهتزت واضطربت بطولها وعرضها ولهذا قال ابن عباس ومجاهد وقتادة وغير واحد في قوله تعالى \"إذا رجت الأرض رجا\" أي زلزلت زلزالا وقال الربيع بن أنس ترج بما فيها كرج الغربال بما فيه وهذا كقوله تعالى \"إذا زلزلت الأرض زلزالها\" وقال تعالى \"يا أيها الناس اتقوا ربكم إن زلزلة الساعة شيء عظيم\"."
    },
    {
      "ayah": 40,
      "surah": 56,
      "text": "وقوله تعالى \"ثلة من الأولين وثلة من الآخرين\" أي جماعة من الأولين وجماعة من الآخرين. وقال ابن أبي حاتم حدثنا المنذر بن شاذان حدثنا محمد بن بكار حدثنا سعيد بن بشير عن قتادة عن الحسن عن عمران بن حصين عن عبدالله بن مسعود قال وكان بعضهم يأخذ عن بعض قال أكربنا ذات ليلة عند رسول الله صلى الله عليه وسلم ثم غدونا عليه فقال \"عرضت علي الأنبياء وأتباعها بأممها فيمر علي النبي والنبي في العصابة والنبي في الثلاثة والنبي وليس معه أحد - وتلا قتادة هذه الآية \"أليس منكم رجل رشيد\" قال - حتى مر علي موسى بن عمران في كبكبة من بني إسرائيل قال: قلت ربي من هذا؟ قال هذا أخوك موسى بن عمران ومن تبعه من بني إسرائيل قال: قلت رب فأين أمتي؟ قال انظر عن يمينك في الضراب قال فإذا وجوه الرجال قال: قال أرضيت؟ قلت قد رضيت رب قال انظر إلى الأفق عن يسارك فإذا وجوه الرجال قال أرضيت قلت قد رضيت رب قال فإن مع هؤلاء سبعين ألفا يدخلون الجنة بغير حساب\" قال وأنشأ عكاشة بن محصن من بني أسد قال سعيد وكان بدريا قال يا نبي الله ادع الله أن يجعلني منهم فقال \"اللهم اجعله منهم\" قال انشأ رجل آخر قال يا نبي الله ادع الله أن يجعلني منهم فقال \"سبقك بها عكاشة\" قال: فقال رسول الله صلى الله عليه وسلم \"فإن استطعتم فداكم أبي وأمي أن تكونوا من أصحاب السبعين فافعلوا وإلا فكونوا من أصحاب الضراب وإلا فكونوا من أصحاب الأفق فإني قد رأيت ناسا كثيرا قد ناشبوا أحوالهم - ثم قال -إني لأرجو أن تكونوا ربع أهل الجنة\" فكبرنا ثم قال \"إني لأرجو أن تكونوا ثلث أهل الجنة\" قال فكبرنا قال \"إني لأرجو أن تكونوا نصف أهل الجنة\" قال فكبرنا قال ثم تلا رسول الله صلى الله عليه وسلم هذه الآية \"ثلة من الأولين وثلة من الآخرين\" قال: فقلنا بيننا من هؤلاء السبعون ألفا فقلنا هم الذين ولدوا في الإسلام ولم يشركوا قال فبلغه ذلك فقال \"بل هم الذين لا يكتوون ولا يسترقون ولا يتطيرون وعلى ربهم يتوكلون\" وكذا رواه ابن جرير من طريقين آخرين عن قتادة به نحوه وهذا الحديث له طرق كثيرة من غير هذا الوجه في الصحاح وغيرها قال ابن جرير حدثنا ابن حميد حدثنا مهران حدثنا سفيان عن أبان بن أبي عياش عن سعيد بن جبير عن ابن عباس \"ثلة من الأولين وثلة من الآخرين\" قال: قال رسول الله صلى الله عليه وسلم\"هما جميعا من أمتي\"."
    },
    {
      "ayah": 41,
      "surah": 56,
      "text": "لما ذكر تعالى حال أصحاب اليمين عطف عليهم بذكر أصحاب الشمال فقال \"وأصحاب الشمال ما أصحاب الشمال\" أي شيء هم فيه أصحاب الشمال؟."
    },
    { "ayah": 42, "surah": 56, "text": "ثم فسر ذلك فقال \"في سموم\" وهو الهواء الحار \"وحميم\" وهو الماء الحار." },
    {
      "ayah": 43,
      "surah": 56,
      "text": "\"وظل من يحموم\"قال ابن عباس ظل الدخان وكذا قال مجاهد وعكرمة وأبو صالح وقتادة والسدي وغيرهم وهذه كقوله تعالى \"انطلقوا إلى ما كنتم به تكذبون انطلقوا إلى ظل ذي ثلاث شعب لا ظليل ولا يغني من اللهب إنها ترمي بشرر كالقصر كأنه جماله صفر ويل يومئذ للمكذبين\" ولهذا قال \"وظل من يحموم\" وهو الدخان الأسود."
    },
    {
      "ayah": 44,
      "surah": 56,
      "text": "أي ليس طيب الهبوب ولا حسن المنظر كما قال الحسن وقتادة \"ولا كريم\" أي ولا كريم المنظر وقال الضحاك كل شراب ليس بعذب فليس بكريم وقال ابن جرير: العرب تتبع هذه اللفظة في النفي فيقولون هذا الطعام ليس بطيب ولا كريم هذا اللحم ليس بطيب ولا كريم هذا اللحم ليس بسمين ولا كريم وهذه الدار ليست بنظيفة ولا كريمة وكذا رواه ابن جرير من طريقين آخرين عن قتادة به نحوه ثم ذكر تعالى استحقاقهم لذلك."
    },
    {
      "ayah": 45,
      "surah": 56,
      "text": "فقال تعالى \"إنهم كانوا قبل ذلك مترفين\" أي كانوا في الدار الدنيا منعمين مقبلين على لذات أنفسهم لا يلوون على ما جاءتهم به الرسل."
    },
    {
      "ayah": 46,
      "surah": 56,
      "text": "أي يقيمون ولا ينوون توبة \"على الحنث العظيم\"وهو الكفر بالله وجعل الأوثان والأنداد أربابا من دون الله قال ابن عباس الحنث العظيم الشرك. وكذا قال مجاهد وعكرمة والضحاك وقتادة والسدي وغيرهم. وقال الشعبي هو اليمين الغموس."
    },
    { "ayah": 47, "surah": 56, "text": "يعني أنهم يقولون ذلك مكذبين به مستبعدين لوقوعه." },
    {
      "ayah": 48,
      "surah": 56,
      "text": "قال الله تعالى \"قل إن الأولين والآخرين لمجموعـون إلى ميقات يوم معلوم\" أي أخبرهم يا محمد أن الأولين والآخرين من بني آدم سيجمعون إلى عرصات القيامة لا يغادر منهم أحدا كما قال تعالى \"ذلك يوم مجموع له الناس وذلك يوم مشهود وما نؤخره إلا لأجل معدود يوم يأت لا تكلم نفس إلا بإذنه فمنهم شقي وسعيد\"."
    },
    {
      "ayah": 49,
      "surah": 56,
      "text": "قال الله تعالى \"قل إن الأولين والآخرين لمجموعـون إلى ميقات يوم معلوم\" أي أخبرهم يا محمد أن الأولين والآخرين من بني آدم سيجمعون إلى عرصات القيامة لا يغادر منهم أحدا كما قال تعالى \"ذلك يوم مجموع له الناس وذلك يوم مشهود وما نؤخره إلا لأجل معدود يوم يأت لا تكلم نفس إلا بإذنه فمنهم شقي وسعيد\"."
    },
    {
      "ayah": 5,
      "surah": 56,
      "text": "أي فتتت فتا قاله ابن عباس ومجاهد وعكرمة وقتادة وغيرهم وقال ابن زيد صارت الجبال كما قال الله تعالى \"كثيبا مهيلا\"."
    },
    {
      "ayah": 50,
      "surah": 56,
      "text": "قال ههنا \"لمجموعون إلى ميقات يوم معلوم\" أي هو موقت بوقت محدود لا يتقدم ولا يتأخر ولا يزيد ولا ينقص."
    },
    {
      "ayah": 51,
      "surah": 56,
      "text": "\"ثم إنكم أيها الضالون المكذبون لآكلون من شجر من زقوم فمالئون منها البطون\" وذلك أنهم يقبضون ويسجرون حتى يأكلوا من شجر الزقوم حتى يملأوا منها بطونهم."
    },
    {
      "ayah": 52,
      "surah": 56,
      "text": "\"ثم إنكم أيها الضالون المكذبون لآكلون من شجر من زقوم فمالئون منها البطون\" وذلك أنهم يقبضون ويسجرون حتى يأكلوا من شجر الزقوم حتى يملأوا منها بطونهم."
    },
    {
      "ayah": 53,
      "surah": 56,
      "text": "\"ثم إنكم أيها الضالون المكذبون لآكلون من شجر من زقوم فمالئون منها البطون\" وذلك أنهم يقبضون ويسجرون حتى يأكلوا من شجر الزقوم حتى يملأوا منها بطونهم."
    },
    {
      "ayah": 54,
      "surah": 56,
      "text": "\"فشاربون عليه من الحميم فشاربون شرب الهيم\" وهي الإبل العطاش واحدها أهيم والأنثى هيماء ويقال هائم وهائمة قال ابن عباس ومجاهد وسعيد بن جبير وعكرمة الهيم الإبل العطاش الظماء وعن عكرمة أنه قال الهيم الإبل المراض تمص الماء مصا ولا تروى وقال السدي الهيم داء يأخذ الإبل فلا تروى أبدا حتى تموت فكذلك أهل جهنم لا يرون من الحميم أبدا. وعن خالد بن معدان أنه كان يكره أن يشرب شرب الهيم غبة واحدة من غير أن يتنفس ثلاثا."
    },
    {
      "ayah": 55,
      "surah": 56,
      "text": "ثم قال تعالى \"فشاربون عليه من الحميم فشاربون شرب الهيم\" وهي الإبل العطاش واحدها أهيم والأنثى هيماء ويقال هائم وهائمة قال ابن عباس ومجاهد وسعيد بن جبير وعكرمة الهيم الإبل العطاش الظماء وعن عكرمة أنه قال الهيم الإبل المراض تمص الماء مصا ولا تروى وقال السدي الهيم داء يأخذ الإبل فلا تروى أبدا حتى تموت فكذلك أهل جهنم لا يرون من الحميم أبدا. وعن خالد بن معدان أنه كان يكره أن يشرب شرب الهيم غبة واحدة من غير أن يتنفس ثلاثا."
    },
    {
      "ayah": 56,
      "surah": 56,
      "text": "ثم قال تعالى \"هذا نزلهم يوم الدين\" أي هذا الذي وصفنا هو ضيافتهم عند ربهم يوم حسابهم كما قال تعالى في حق المؤمنين \"إن الذين آمنوا وعملوا الصالحات كانت لهم جنات الفردوس نزلا\" أي ضيافة وكرامة."
    },
    {
      "ayah": 57,
      "surah": 56,
      "text": "يقول تعالى مقررا للمعاد ورادا على المكذبين به من أهل الزيغ والإلحاد من الذين قالوا \"أئذا متنا وكنا ترابا وعظاما أئنا لمبعوثون\" وقولهم ذلك صدر منهم على وجه التكذيب والاستبعاد فقال تعالى \"نحن خلقناكم\" أي نحن ابتدأنا خلقكم بعد أن لم تكونوا شيئا مذكورا أفليس الذي قدر على البداءة بقادر على الإعادة بطريق الأولى والأحرى؟ ولهذا قال \"فلولا تصدقون\" أي فهلا تصدقون بالبعث؟."
    },
    {
      "ayah": 58,
      "surah": 56,
      "text": "ثم قال تعالى مستدلا عليهم بقوله \"أفرأيتم ما تمنون أأنتم تخلقونه أم نحن الخالقون\" أي أنتم تقرونه في الأرحام وتخلقونه فيها أم الله الخالق لذلك؟ ثم قال تعالى \"نحن قدرنا بينكم الموت\" أي صرفناه بينكم وقال الضحاك ساوى فيه بين أهل السماء والأرض \"وما نحن بمسبوقين\" أي وما نحن بعاجزين."
    },
    {
      "ayah": 59,
      "surah": 56,
      "text": "ثم قال تعالى مستدلا عليهم بقوله \"أفرأيتم ما تمنون أأنتم تخلقونه أم نحن الخالقون\" أي أنتم تقرونه في الأرحام وتخلقونه فيها أم الله الخالق لذلك؟ ثم قال تعالى \"نحن قدرنا بينكم الموت\" أي صرفناه بينكم وقال الضحاك ساوى فيه بين أهل السماء والأرض \"وما نحن بمسبوقين\" أي وما نحن بعاجزين."
    },
    {
      "ayah": 6,
      "surah": 56,
      "text": "قال أبو إسحاق عن الحارث عن علي رضي الله عنه: هباء منبثا كرهج الغبار يسطع ثم يذهب فلا يبقى منه شيء وقال العوفي عن ابن عباس في قوله \"فكانت هباء منبثا\" الهباء الذي يطير من النار إذا اضطرمت يطير منه الشرر فإذا وقع لم يكن شيئا وقال عكرمة: المنبث الذي قد ذرته الريح وبثته وقال قتادة \"هباء منبثا\" كيبيس الشجر الذي تذروه الرياح. وهذه الآية كأخواتها الدالة على زوال الجبال عن أماكنها يوم القيامة وذهابها وتسييرها ونسفها أي قلعها وصيرورتها كالعهن المنفوش."
    },
    {
      "ayah": 60,
      "surah": 56,
      "text": "ثم قال تعالى مستدلا عليهم بقوله \"أفرأيتم ما تمنون أأنتم تخلقونه أم نحن الخالقون\" أي أنتم تقرونه في الأرحام وتخلقونه فيها أم الله الخالق لذلك؟ ثم قال تعالى \"نحن قدرنا بينكم الموت\" أي صرفناه بينكم وقال الضحاك ساوى فيه بين أهل السماء والأرض \"وما نحن بمسبوقين\" أي وما نحن بعاجزين."
    },
    {
      "ayah": 61,
      "surah": 56,
      "text": "\"على أن نبدل أمثالكم\" أي نغير خلقكم يوم القيامـة \"وننشئكم فيما لا تعلمون\" أي من الصفات والأحـوال."
    },
    {
      "ayah": 62,
      "surah": 56,
      "text": "ثم قال تعالى \"ولقد علمتم النشأة الأولى فلولا تذكرون\" أي قد علمتم أن الله أنشأكم بعد أن لم تكونوا شيئا مذكورا فخلقكم وجعل لكم السمع والأبصار والأفئدة فهلا تتذكرون وتعرفون أن الذي قدر على هذه النشأة وهي البداءة قادر على النشأة الأخرى وهي الإعادة بطريق الأولى والأخرى كما قال تعالى \"وهو الذي يبدأ الخلق ثم يعيده وهو أهون عليه\" وقال تعالى \"أو لا يذكر الإنسان أنا خلقناه من قبل ولم يك شيئا\" \"أو لم ير الإنسان أنا خلقناه من نطفة فإذا هو خصيم مبين وضرب لنا مثلا ونسي خلقه قال من يحيى العظام وهي رميم قل يحييها الذي أنشأها أول مرة وهو بكل خلق عليم\" وقال تعالى \"أيحسب الإنسان أن يترك سدى ألم يك نطفة من مني يمنى ثم كان علقة فخلق فسوى فجعل منه الزوجين الذكر والأنثى أليس ذلك بقادر على أن يحيى الموتى\"."
    },
    { "ayah": 63, "surah": 56, "text": "يقول تعالى \"أفرأيتم ما تحرثون\" وهو شق الأرض وإثارتها والبذر فيها." },
    {
      "ayah": 64,
      "surah": 56,
      "text": "\"أأنتم تزرعونه\" أي تنبتونه في الأرض \"أم نحن الزارعون\" أي بل نحن الذي نقره قراره وننبته في الأرض. قال ابن جرير وقد حدثني أحمد بن الوليد القرشي حدثنا مسلم بن أبي مسلم الجرمي حدثنا مخلد بن الحسين عن هشام عن محمد عن أبي هريرة قال: قال رسول الله صلى الله عليه وسلم \"لا تقولن زرعت ولكن قل حرثت\" قال أبو هريرة ألم تسمع إلى قوله تعالى \"أفرأيتم ما تحرثون أأنتم تزرعونه أم نحن الزارعون\" ورواه البزار عن محمد بن عبدالرحيم عن مسلم الجرمي به. وقال ابن أبي حاتم حدثنا أبي حدثنا موسى بن إسماعيل حدثنا حماد عن عطاء عن أبي عبدالرحمن: لا تقولوا زرعنا ولكن قولوا حرثنا وروى عن حجر المدري أنه كان إذا قرأ \"أأنتم تزرعونه أم نحن الزارعون\" \"وأمثالها يقول بل أنت يا رب."
    },
    {
      "ayah": 65,
      "surah": 56,
      "text": "وقوله تعالى \"لو نشاء لجعلناه حطاما \" أي نحن أنبتناه بلطفنا ورحمتنا وأبقيناه لكم رحمة بكم ولو نشاء لجعلناه حطاما أي لأيبسناه قبل استوائه واستحصاده \"فظلتم تفكهون\"."
    },
    {
      "ayah": 66,
      "surah": 56,
      "text": "ثم فسر ذلك بقوله \"إنا لمغرمون بل نحن محرومون\" أي لو جعلناه حطاما لظللتم تفكهون في المقالة تنوعون كلامكم فتقولون تارة إنا لمغرمون أي لملقون وقال مجاهد وعكرمة إنا لموقع بنا وقال قتادة معذبون وتاره تقولون بل نحن محرومون وقال مجاهد أيضا إنا لمغرمون ملقون للشر أي بل نحن محارفون قاله قتاده أي لا يثبت لنا مال ولا ينتج لنا ربح وقال مجاهد بل نحن محرومون أي مجدودون يعني لاحظ لنا قال ابن عباس ومجاهد \"فظلتم تفكهون\" تعجبون وقال مجاهد أيضا فظلتم تفكهون تفجعون وتحزنون على ما فاتكم من زرعكم وهذا يرجع إلى الأول وهو التعجب من السبب الذي من أجله أصيبوا في مالهم وهذا اختيار ابن جرير. وقال عكرمة فظلتم تفكهون تلاومون وقال الحسن وقتادة والسدي فظلتم مفكهون تندمون ومعناه إما على ما أنفقتم أو على ما أسلفتم من الذنوب قال الكسائي تفكه من الأضداد تقول العرب تفكهت بمعنى تنعمت وتفكهت بمعنى حزنت."
    },
    {
      "ayah": 67,
      "surah": 56,
      "text": "ثم فسر ذلك بقوله \"إنا لمغرمون بل نحن محرومون\" أي لو جعلناه حطاما لظللتم تفكهون في المقالة تنوعون كلامكم فتقولون تارة إنا لمغرمون أي لملقون وقال مجاهد وعكرمة إنا لموقع بنا وقال قتادة معذبون وتاره تقولون بل نحن محرومون وقال مجاهد أيضا إنا لمغرمون ملقون للشر أي بل نحن محارفون قاله قتاده أي لا يثبت لنا مال ولا ينتج لنا ربح وقال مجاهد بل نحن محرومون أي مجدودون يعني لاحظ لنا قال ابن عباس ومجاهد \"فظلتم تفكهون\" تعجبون وقال مجاهد أيضا فظلتم تفكهون تفجعون وتحزنون على ما فاتكم من زرعكم وهذا يرجع إلى الأول وهو التعجب من السبب الذي من أجله أصيبوا في مالهم وهذا اختيار ابن جرير. وقال عكرمة فظلتم تفكهون تلاومون وقال الحسن وقتادة والسدي فظلتم مفكهون تندمون ومعناه إما على ما أنفقتم أو على ما أسلفتم من الذنوب قال الكسائي تفكه من الأضداد تقول العرب تفكهت بمعنى تنعمت وتفكهت بمعنى حزنت."
    },
    {
      "ayah": 68,
      "surah": 56,
      "text": "قال تعالى \"أفرأيتم الماء الذي تشربون أأنتم أنزلتموه من المزن\" يعنى السحاب قاله ابن عباس ومجاهد وغير واحد \"أم نحن المنزلون\" يقول بل نحن المنزلون."
    },
    {
      "ayah": 69,
      "surah": 56,
      "text": "قال تعالى \"أفرأيتم الماء الذي تشربون أأنتم أنزلتموه من المزن\" يعنى السحاب قاله ابن عباس ومجاهد وغير واحد \"أم نحن المنزلون\" يقول بل نحن المنزلون."
    },
    {
      "ayah": 7,
      "surah": 56,
      "text": "أي ينقسم الناس يوم القيامة إلى ثلاثة أصناف: قوم عن يمين العرش وهم الذين خرجوا من شق آدم الأيمن ويؤتون كتبهم بأيمانهم ويؤخذ بهم ذات اليمين قال السدي وهم جمهور أهل الجنة وآخرون عن يسار العرش وهم الذين خرجوا من شق آدم الأيسر ويؤتون كتبهم بشمالهم ويؤخذ بهم ذات الشمال وهم عامة أهل النار- عياذا بالله من صنيعهم - وطائفة سابقون بين يديه عز وجل وهم أخص وأحظى وأقرب من أصحاب اليمين الذين هم سادتهم فيهم الرسل والأنبياء والصديقون والشهداء وهم أقل عددا من أصحاب اليمين لهذا."
    },
    {
      "ayah": 70,
      "surah": 56,
      "text": "\"لو نشاء جعلناه أجاجا\" أي زعاقا مرا لا يصلح لشرب ولا زرع \"فلولا تشكرون\" أي فهلا تشكرون نعمة الله عليكم في إنزاله المطر عليكم عذبا زلالا \"لكم منه شراب ومنه شجر فيه تسيمون ينبت لكم به الزرع والزيتون والنخيل والأعناب ومن كل الثمرات إن في ذلك لآية لقوم يتفكرون\" وقال ابن أبي حاتم حدثنا أبي حدثنا عثمان بن سعيد بن مرة حدثنا فضيل بن مرزوى عن جابر عن أبي جعفر عن النبي صلى الله عليه وسلم أنه كان إذا شرب الماء قال \"الحمد لله الذي سقانا عذبا فراتا برحمته ولم يجعله ملحا أجاجا بذنوبنا\"."
    },
    { "ayah": 71, "surah": 56, "text": "قال \"أفرأيتم النار التي تورون\" أي تقدحون من الزناد وتستخرجونها من أصلها." },
    {
      "ayah": 72,
      "surah": 56,
      "text": "\"أأنتم أنشأتم شجرتها أم نحن المنشئون\" أي بل نحن الذين جعلناها مودعة في موضعها وللعرب شجرتان \"إحداهما\" المرخ \"والأخـرى\" العفار إذا أخذ منهما غصنان أخضران فحك أحدهما بالآخر تناثر من بينهما شرر النار."
    },
    {
      "ayah": 73,
      "surah": 56,
      "text": "وقوله تعالى \"نحن جعلناها تذكرة\" قال مجاهد وقتادة أي تذكر النار الكبرى قال قتادة ذكر لنا أن رسول الله صلى الله عليه وسلم قال \"يا قوم ناركم هذه التي توقدون جزء من سبعين جزأ من نار جهنم\" قالوا يا رسول الله إن كانت لكافية؟ قال \"إنها قد ضربت بالبحر ضربتين أو مرتين حتى يستنفع بها بنو آدم ويدنوا منها\" وهذا الذي أرسله قتادة قد رواه الإمام أحمد في مسنده فقال حدثنا سفيان عن أبي الزناد عن الأعرج عن أبي هريرة عن النبي صلى الله عليه وسلم قال \"إن ناركم هذه جزء من سبعين جزءا من نار جهنم وضربت بالبحر مرتين ولولا ذلك ما جعل الله فيها منفعة لأحد\" وقال الإمام مالك عن أبي الزناد عن الأعرج عن أبي هريرة أن رسول الله صلى الله عليه وسلم قال \"نار بني آدم التي يوقدون جزء من سبعين جزءا من نار جهنم\" فقالوا يا رسول الله إن كانت لكافية فقال \"إنها قد فضلت عليها بتسعة وستين جزءا\" رواه البخاري من حديث مالك ومسلم من حديث أبي الزناد ورواه مسلم من حديث عبدالرزاق عن معمر عن همام عن أبي هريرة به وفي لفظ \"والذي نفسي بيده لقد فضلت عليها بتسعة وستين جزءا كلهن مثل حرها\" وقد قال أبو القاسم الطبراني حدثنا أحمد بن عمرو الخلال حدثنا إبراهيم بن المنذر الحزامي حدثنا معن بن عيسى القزاز عن مالك عن عمه أبي سهل عن أبيه عن أبي هريرة قال: قال رسول الله صلى الله عليه وسلم\"أتدرون ما مثل ناركم هذه من نار جهنم؟ لهي أشد سوادا من ناركم هذه بسبعين ضعفا \" قال الضياء المقدسي وقد رواه أبو مصعب عن مالك ولم يرفعه وهو عندي على شرط الصحيح وقوله تعالى \"ومتاعا للمقوين\" قال ابن عباس ومجاهد وقتادة والضحاك والنضر بن عربي يعني بالمقوين المسافرين واختاره ابن جرير وقال ومنه قولهم أقوت الدار إذا رحل أهلها وقال غيره القي والقواء القفر الخالي البعيد من العمران وقال عبدالرحمن بن زيد بن أسلم المقوي ههنا الجائع وقال ليث ابن أبي سليم عن مجاهد ومتاعا للمقوين للحاضر والمسافر لكل طعام لا يصلحه إلا النار وكذا روى سفيان عن جابر الجعفي عن مجاهد وقال ابن أبي نجيح عن مجاهد قوله للمقوين يعني المستمتعين من الناس أجمعين وكذا ذكر عن عكرمة وهذا التفسير أعم من غيره فإن الحاضر والبادي من غني وفقير الجميع محتاجون إليها للطبخ والاصطلاء والإضاءة وغير ذلك من المنافع ثم من لطف الله تعالى أن أودعها في الأحجار وخالص الحديد بحيث يتمكن المسافر من حمل ذلك في متاعه وبين ثيابه فإذا احتاج إلى ذلك في منزله أخرج زنده وأورى وأوقد ناره فأطبخ بها واصطلى بها واشتوى واستأنس بها وانتفع بها سائر الانتفاعات فلهذا أفرد المسافرون وإن كان ذلك عاما في حق الناس كلهم وقد يستدل له بما رواه الإمام أحمد وأبو داود من حديث أبي خداش حبان بن زيد الشرعي الشامي عن رجل من المهاجرين من قرن أن رسول الله صلى الله عليه وسلم قال \"المسلمون شركاء في ثلاثة النار والكلأ والماء\" وروى ابن ماجه بإسناد جيد عن أبي هريرة قال: قال رسول الله صلى الله عليه وسلم \"ثلات لا يمنعن الماء والكلأ والنار\" وله من حديث ابن عباس مرفوعا مثل هذا وزيادة وثمنه ولكن في إسناده عبدالله بن خراش بن حوشب وهو ضعيف والله أعلم."
    },
    {
      "ayah": 74,
      "surah": 56,
      "text": "وقوله تعالى \"فسبح باسم ربك العظيم\" أي الذي بقدرته خلق هذه الأشياء المختلفة المتضادة الماء الزلال العذب البارد ولو شاء لجعله ملحا أجاجا كالبحار المغرقة وخلق النار المحرقة وجعل ذلك مصلحة للعباد وجعل هذه منفعة لهم في معاش دنياهم وزجرا لهم في المعاد."
    },
    {
      "ayah": 75,
      "surah": 56,
      "text": "قال جويبر عن الضحاك إن الله تعالى لا يقسم بشيء من خلقه ولكنه استفتاح يستفتح به كلامه وهذا القول ضعيف والذي عليه الجمهور أنه قسم من الله تعالى يقسم بما شاء من خلقه وهو دليل على عظمته ثم قال بعض المفسرين لا ههنا زائدة وتقديره أقسم بمواقع النجوم رواه ابن جرير عن سعيد بن جبير ويكون جوابه \"إنه لقرآن كريم\" وقال آخرون ليست لا زائدة لا معنى لها بل يؤتى بها في أول القسم إذا كان مقسما به على منفي كقول عائشة رضي الله عنها: لا والله ما مست يد رسول الله صلى الله عليه وسلم يد امرأة قط وهكذا ههنا تقدير الكلام لا أقسم بمواقع النجوم ليس الأمر كما زعمتم في القرآن أنه سحر أو كهانة بل هو قرآن كريم. وقال ابن جرير وقال بعض أهل العربية معنى قوله \"فلا أقسم\" فليس الأمر كما تقولون ثم استأنف القسم بعد ذلك فقيل أقسم واختلفوا في معنى قوله \"بمواقع النجوم\" فقال حكيم بن جبير عن سعيد بن جبير عن ابن عباس يعني نجوم القرآن فإنه نزل جملة ليلة القدر من السماء العليا إلى السماء الدنيا ثم نزل مفرقا في السنين بعد ثم قرأ ابن عباس هذه الآية وقال الضحاك عن ابن عباس نزل القرآن جملة من عند الله من اللوح المحفوظ إلى السفرة الكرام الكاتبين في السماء الدنيا فنجمته السفرة على جبريل عشرين ليلة ونجمة جبريل على محمد صلى الله عليه وسلم عشرين سنة فهو قوله \"فلا أقسم بمواقع النجوم\" نجوم القرآن وكذا قال عكرمة ومجاهد والسدي وأبو حزرة وقال مجاهد أيضا مواقع النجوم في السماء ويقال مطالعها ومشارقها. وكذا مال الحسن وقتادة وهو اختيار ابن جرير وعن قتادة مواقعها منازلها وعن الحسن أيضا أن المراد بذلك انتثارها يوم القيامة وقال الضحاك \"فلا أقسم بمواقع النجوم\" يعني بذلك الأنواء التي كان أهل الجاهلية إذا أمطروا قالوا مطرنا بنوء كذا وكذا."
    },
    {
      "ayah": 76,
      "surah": 56,
      "text": "وقوله \"وإنه لقسم لو تعلمون عظيم\" أي وإن هذا القسم الذي أقسمت به لقسم عظيم لو تعلمون عظمته لعظمتم المقسم به عليه."
    },
    { "ayah": 77, "surah": 56, "text": "\"إنه لقرآن كريم\" أي إن هذا القرآن الذي نزل على محمد لكتاب عظيم." },
    { "ayah": 78, "surah": 56, "text": "\"في كتاب مكنون\" أي معظم في كتاب معظم محفوظ موقر." },
    {
      "ayah": 79,
      "surah": 56,
      "text": "وقال ابن جرير حدثني موسى بن إسماعيل أخبرنا شريك عن حكيم هو ابن جبير عن سعيد بن جبير عن ابن عباس \"لا يمسه إلا المطهرون\" قال الكتاب الذي في السماء وقال العوفي عن ابن عباس \"لا يمسه إلا المطهرون\" يعني الملائكة وكذا قال أنس ومجاهد وعكرمة وسعيد بن جبير والضحاك وأبو الشعثاء جابر بن زيد وأبو نهيك والسدي وعبدالرحمن بن زيد بن أسلم وغيرهم. وقال ابن جرير حدثنا ابن عبدالأعلى حدثنا ابن ثور حدثنا معمر عن قتادة \"لا يمسه إلا المطهرون\" قال لا يمسه عند الله إلا المطهرون فأما في الدنيا فإنه يمسه المجوسي النجس والمنافق الرجس قال وهي في قراءة ابن مسعود ما يمسه إلا المطهرون وقال أبو العالية \"لا يمسه إلا المطهرون\" ليس أنتم أنتم أصحاب الذنوب وقال ابن زيد زعمت كفار قريش أن هذا القرآن تنزلت به الشياطين فأخبر الله تعالى أنه \"لا يمسه إلا المطهرون\" كما قال تعالى \"وما تنزلت به الشياطين وما ينبغي لهم وما يستطيعون إنهم عن السمع لمعزولون\" وهذا القول قول جيد وهو لا يخرج عن الأقوال التي قبله. وقال الفراء لا يجد طعمه ونفعه إلا من آمن به وقال آخرون \"لا يمسه إلا المطهرون\" أي من الجنابة والحدث قالوا ولفظ الآية خبر ومعناها الطلب قالوا والمراد بالقرآن ههنا المصحف كما روى مسلم عن ابن عمر أن رسول الله صلى الله عليه وسلم نهى أن يسافر بالقرآن إلى أرض العدو مخافة أن يناله العدو. واحتجوا في ذلك بما رواه الإمام مالك في موطئه عن عبدالله بن أبي بكر بن محمد بن عمرو بن حزم أن في الكتاب الذي كتبه رسول الله صلى الله عليه وسلم لعمرو بن حزم \"أن لا يمس القرآن إلا طاهر\" وروى أبو داود في المراسيل من حديث الزهري قال قرأت في صحيفة عند أبي بكر بن محمد بن عمرو بن حزم أن رسول الله صلى الله عليه وسلم قال \"ولا يمس القرآن إلا طاهر\" وهذه وجادة جيدة قد قرأها الزهري وغيره ومثل هذا ينبغي الأخذ به وقد أسنده الدارقطني عن عمرو بن حزم وعبدالله بن عمر عثمان بن أبي العاص وفي إسناد كل منهما نظر والله أعلم."
    },
    {
      "ayah": 8,
      "surah": 56,
      "text": "قال تعالى \"فأصحاب الميمنة ما أصحاب الميمنة وأصحاب المشأمة ما أصحاب المشأمة والسابقون السابقون\" وهكذا قسمهم إلى هذه الأنواع الثلاثة في آخر السورة وقت احتضارهم وهكذا ذكرهم في قوله تعالى \"ثم أورثنا الكتاب الذين اصطفينا من عبادنا فمنهم ظالم لنفسه ومنهم مقتصد ومنهم سابق بالخيرات بإذن الله\" الآية وذلك على أحد القولين في الظالم لنفسه كما تقدم بيانه قال سفيان الثوري عن جابر الجعفي عن مجاهد عن ابن عباس عن قوله \"وكنتم أزواجا ثلاثة\" قال هي التي في سورة الملائكة \"ثم أورثنا الكتاب الذين اصطفينا من عبادنا فمنهم ظالم لنفسه ومنهم مقتصد ومنهم سابق بالخيرات\" وقال ابن جريج عن ابن عباس هذه الأزواج الثلاثة هم المذكورون في آخر السورة وفي سورة الملائكة. وقال يزيد الرقاشي سألت ابن عباس في قوله \"وكنتم أزواجا ثلاثة\" قال أصناقا ثلاثة وقال مجاهد \"وكنتم أزواجا ثلاثه\" يعني فرقا ثلاثة. وقال ميمون بن مهران أفواجا ثلاثة وقال عبيد الله العتكي عن عثمان بن سراقة بن خالة عمر بن الخطاب \"وكنتم أزواجا ثلاثة\" اثنان في الجنة وواحد في النار. وقال ابن أبي حاتم حدثنا أبي حدثنا محمد بن الصباح حدثنا الوليد بن أبي ثور عن سماك عن النعمان بن بشير قال: قال رسول الله صلى الله عليه وسلم \"وإذا النفوس زوجت\" قال: الضرباء كل رجل من كل قوم كانوا يعملون عمله وذلك بأن الله تعالى يقول \"وكنتم أزواجا ثلاثة فأصحاب الميمنة ما أصحاب الميمنة وأصحاب المشأمة ما أصحاب المشأمة والسابقون السابقون\" قال هم الضرباء."
    },
    {
      "ayah": 80,
      "surah": 56,
      "text": "وقوله تعالى \"تنزيل من رب العالمين\" أي هذا القرآن منزل من الله رب العالمين وليس هو كما يقولون إنه سحر أو كهانة أو شعر بل هو الحق الذي لا مرية فيه وليس وراءه حق نافع."
    },
    {
      "ayah": 81,
      "surah": 56,
      "text": "وقوله تعالى \"أفبهذا الحديث أنتم مدهنون\" قال العوفي عن ابن عباس أي مكذبون غير مصدقين. وكذا قال الضحاك وأبو حزرة والسدي وقال مجاهد \"مدهنون\" أي تريدون أن تمالئوهم فيه وتركنوا إليهم."
    },
    {
      "ayah": 82,
      "surah": 56,
      "text": "\"وتجعلون رزقكم أنكم تكذبون\" قال بعضهم معنى وتجعلون رزقكم بمعنى شكركم أنكم تكذبون أي تكذبون بدل الشكر وقد روي عن علي وابن عباس أنهما قرآها \"وتجعلون شكركم أنكم تكذبون\" كما سيأتي وقال ابن جرير وقد ذكر عن الهيثم بن عدي أن من لغة أزدشنوءة ما رزق فلان بمعنى ما شكر فلان. وقال الإمام أحمد حدثنا حسين بن محمد حدثنا إسرائيل عن عبد الأعلى عن أبي عبدالرحمن عن علي رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم \"وتجعلون رزقكم\" يقول - شكركم \"أنكم تكذبون\" تقولون مطرنا بنوء كذا وكذا بنجم كذا وكذا\" وهكذا رواه ابن أبي حاتم عن أبيه عن مخول بن إبراهيم النهدي وابن جرير عن محمد بن المثنى عن عبيدالله بن موسى وعن يعقوب بن إبراهيم عن يحيى ابن أبي بكير ثلاثتهم عن إسرائيل به مرفوعا وكذا رواه الترمذي عن أحمد بن منيع عن حسين بن محمد وهو المروزي به وقال حسن غريب وقد رواه سفيان الثوري عن عبدالأعلى ولم يرفعه. وقال ابن جرير حدثنا محمد بن بشار حدثنا محمد بن جعفر حدثنا شعبة عن أبي بشر عن سعيد بن جبير عن ابن عباس قال: ما مطر قوم قط إلا أصبح بعضهم كافرا يقولون مطرنا بنوء كذا وكذا وقرأ ابن عباس \"وتجعلون شكركم أنكم تكذبون\" وهذا إسناد صحيح إلى ابن عباس وقال مالك في الموطأ عن صالح بن كيسان عن عبيدالله بن عبدالله بن عتبة بن مسعود عن زيد بن خالد الجهني أنه قال: صلى بنا رسول الله صلى الله عليه وسلم صلاة الصبح بالحديبية في أثر سماء كانت من الليل فلما انصرف أقبل على الناس فقال \"هل تدرون ماذا قال ربكم\" قالوا الله ورسوله أعلم قال \"قال أصبح من عبادي مؤمن بي وكافر فأما من قال مطرنا بفضل الله ورحمته فذلك مؤمن بي كافر بالكوكب وأما من قال مطرنا بنوء كذا وكذا فذلك كافر بي مؤمن بالكوكب\" أخرجاه في الصحيحين وأبو داود والنسائي كلهم من حديث مالك به. وقال مسلم حدثنا محمد بن سلمة المرادي وعمرو بن سواد حدثنا عبدالله بن وهب عن عمر بن الحارث أن أبا يونس حدثه عن أبي هريرة عى رسول الله صلى الله عليه وسلم أنه قال \"ما أنزل الله من السماء من بركة إلا أصبح فريق من الناس بها كافرين ينزل الغيث فيقولون بكوكب كذا وكذا\" انفرد به مسلم من هذا الوجه. وقال ابن جرير حدثني يونس أخبرنا سفيان عن محمد بن إسحاق عن محمد بن إبراهيم بن الحارث التيمي عن أبي سلمة عن أبي هريرة أن رسول الله صلى الله عليه وسلم قال \"إن الله ليصبح القوم بالنعمة أو يمسيهم بها فيصبح بها قوم كافرين يقولون مطرنا بنوء كذا وكذا\" قال محمد هو ابن إبراهيم فذكرت هذا الحديث لسعيد بن المسيب فقال ونحن قد سمعنا من أبي هريرة وقد أخبرني من شهد عمر بن الخطاب رضي الله عنه وهو يستسقي فلما استسقى التفت إلى العباس فقال يا عباس يا عم رسول الله كم أبقى من نوء الثريا فقال العلماء يزعمون أنها تعترض في الأفق بعد سقوطها سبعا قال فما مضت سابعة حتى مطروا وهذا محمول على السؤال عن الوقت الذي أجرى الله فيه العادة بإنزال المطر لا أن ذلك النوء مؤثر بنفسه في نزول المطر فإن هذا هو المنهي عن اعتقاده وقد تقدم شيء من هذه الأحاديث عند قوله تعالى \"ما يفتح الله للناس من رحمة فلا ممسك لها\" وقال ابن جرير حدثني يونس أخبرنا سفيان عن إسماعيل بن أمية فيما أحسبه أو غيره أن رسول الله صلى الله عليه وسلم سمع رجلا ومطروا يقول مطرنا ببعض عثانين الأسد فقال \"كذبت بل هو رزق الله\". ثم قال ابن جرير حدثني أبو صالح الصراري حدثنا أبو جابر محمد بن عبدالملك الأودي حدثنا جعفر بن الزبير عن القاسم عن أبي أمامة عن النبي صلي الله عليه وسلم قال \"ما مطر قوم من ليلة إلا أصبح قوم بها كافرين- ثم قال - \"وتجعلون رزقكم أنكم تكذبون\" يقول قائل مطرنا بنجم كذا وكذا\". وفي حديث عن أبي سعيد مرفوعا \"لو قحط الناس سبع سنين ثم مطروا لقالوا مطرنا بنوء المجدع\" وقال مجاهد \"وتجعلون رزقكم أنكم تكذبون\" قال قولهم في الأنواء مطرنا بنوء كذا وبنوء كذا يقول قولوا هو من عند الله وهو رزقه وهكذا قال الضحاك وغير واحد وقال قتادة أما الحسن فكان يقول بئس ما أخذ قوم وأنفسهم لم يرزقوا من كتاب الله إلا التكذيب فمعنى قول الحسن هذا وتجعلون حظكم من كتاب الله أنكم تكذبون به ولهذا قال قبله \"أفبهذا الحديث أنتم مدهنون وتجعلون رزقكم أنكم تكذبون\"."
    },
    {
      "ayah": 83,
      "surah": 56,
      "text": "يقول تعالى \"فلولا إذا بلغت\" أي الروح \"الحلقوم\" أي الحلق وذلك حين الاحتضار كما قال تعالى \"كلا إذا بلغت التراقي وقيل من راق وظن أنه الفراق والتفت الساق بالساق إلى ربك يومئذ المساق\"."
    },
    {
      "ayah": 84,
      "surah": 56,
      "text": "ولهذا قال ههنا \"وأنتم حينئذ تنظرون\" أي إلى المحتضر وما يكابده من سكرات الموت."
    },
    {
      "ayah": 85,
      "surah": 56,
      "text": "\"ونحن أقرب إليه منكم\" أي بملائكتنا \"ولكن لا تبصرون\" أي ولكن لا ترونهم كما قال تعالى في الآية الأخرى \"وهو القاهر فوق عباده ويرسل عليكم حفظة حتى إذا جاء أحدكم الموت توفته رسلنا وهم لا يفرطون ثم ردوا إلى الله مولاهم الحق ألا له الحكم وهو أسرع الحاسبين\"."
    },
    {
      "ayah": 86,
      "surah": 56,
      "text": "وقوله تعالى \"فلولا إن كنتم غير مدينين ترجعونها\" معناه فهلا ترجعون هذه النفس التي قد بلغت الحلقوم إلى مكانها الأول ومقرها من الجسد إن كنتم غير مدينين قال ابن عباس يعني محاسبين وروى عن مجاهد وعكرمة والحسن وقتادة والضحاك والسدي وأبي حزرة مثله. وقال سعيد بن جبير والحسن البصري \"فلولا إن كنتم غير مدينين\" غير مصدقين أنكم تدانون وتبعثون وتجزون فردوا هذه النفس وعن مجاهد \"غير مدينين\" غير موقنين وقال ميمون بن مهران غير معذبين مقهورين."
    },
    {
      "ayah": 87,
      "surah": 56,
      "text": "وقوله تعالى \"فلولا إن كنتم غير مدينين ترجعونها\" معناه فهلا ترجعون هذه النفس التي قد بلغت الحلقوم إلى مكانها الأول ومقرها من الجسد إن كنتم غير مدينين قال ابن عباس يعني محاسبين وروى عن مجاهد وعكرمة والحسن وقتادة والضحاك والسدي وأبي حزرة مثله. وقال سعيد بن جبير والحسن البصري \"فلولا إن كنتم غير مدينين\" غير مصدقين أنكم تدانون وتبعثون وتجزون فردوا هذه النفس وعن مجاهد \"غير مدينين\" غير موقنين وقال ميمون بن مهران غير معذبين مقهورين."
    },
    {
      "ayah": 88,
      "surah": 56,
      "text": "هذه الأحوال الثلاثة هي أحوال الناس عند احتضارهم إما أن يكون من المقربين أو يكون ممن دونهم من أصحاب اليمين وإما أن يكون من المكذبين بالحق الضالين عن الهدى الجاهلين بأمر الله ولهذا قال تعالى \"فأما إن كان\" أي المحتضر \"من المقربين\" وهم الذين فعلوا الواجبات والمستحبات وتركوا المحرمات والمكروهات وبعض المباحات."
    },
    {
      "ayah": 89,
      "surah": 56,
      "text": "أي فلهم روح وريحان وتبشرهم الملائكة بذلك عند الموت كما تقدم في حديث البراء أن ملائكة الرحمة تقول \"أيتها الروح الطيبة في الجسد الطيب كنت تعمرينه اخرجي إلى روح وريحان ورب غير غضبان\" قال علي بن أبي طلحة عن ابن عباس \"فروح\" يقول راحة وريحان يقول مستراحة وكذا قال مجاهد إن الروح الاستراحة وقال أبو حزرة الراحة من الدنيا وقال سعيد بن جبير والسدي الروح الفرح وعن مجاهد \"فروح وريحان\" جنة ورخاء وقال قتادة فروح فرحمة وقال ابن عباس ومجاهد وسعيد بن جبير وريحان ورزق وكل هذه الأقوال متقاربة صحيحة فإن من مات مقربا حصل له جميع ذلك من الرحمة والراحة والاستراحة والفرج والسرور والرزق الحسن \"وجنة نعيم\" وقال أبو العالية لا يفارق أحد من المقربين حتى يؤتي بغصن من ريحان الجنة فيقبض روحه فيه وقال محمد بن كعب لا يموت أحد من الناس حتى يعلم من أهل الجنة هو أم من أهل النار؟ وقد قدمنا أحاديث الاحتضار عند قوله تعالى في سورة إبراهيم \"يثبت الله الذين آمنوا بالقول الثابت\" ولو كتبت ههنا لكان حسنا وأجلها حديث تميم الداري عن النبي صلى الله عليه وسلم يقول \"يقول الله تعالى لملك الموت انطلق إلى فلان فائتني به فإنه قد جربته بالسراء والضراء فوجدته حيث أحب ائتني فلأريحه - قال- فينطلق إليه ملك الموت ومعه خمسمائة من الملائكة معهم أكفان وحنوط من الجنة ومعهم ضبائر الريحان أصل الريحانة واحد وفي رأسها عشرون لونا لكل لون منها ريح سوى ريح صاحبه ومعهم الحرير الأبيض فيه المسك\" وذكر تمام الحديث بطوله كما تقدم وقد وردت أحاديث تتعلق بهذه الآية قال الإمام أحمد حدثنا يونس بن محمد حدثنا هارون عن بديل بن ميسرة عن عبدالله بن شقيق عن عائشة أنها سمعت رسول الله يقرأ \"فروح وريحان\" برفع الراء وكذا رواه أبو داود والترمذي والنسائي من حديث هارون وهو ابن موسى الأعور به. وقال الترمذي لا نعرفه إلا من حديثه وهذه القراءة هي قراءة يعقوب وحده وخالفه الباقون فقرأوا \"فروح وريحان\" بفتح الراء. وقال الإمام أحمد حدثنا حسن حدثنا ابن لهيعة حدثنا أبو الأسود محمد بن عبدالرحمن بن نوفل أنه سمع درة بنت معاذ تحدث عن أم هانىء أنها سألت رسول الله صلى الله عليه وسلم أنتزاور إذا متنا ويرى بعضنا بعضا؟ فقال رسول الله صلى الله عليه وسلم: \"يكون النسم طيرا يعلق بالشجر حتى إذا كان يوم القيامة دخلت كل نفس في جسدها\". هذا الحديث فيه بشارة لكل مؤمن. ومعنى يعلق يأكل ويشهد له بالصحة أيضا ما رواه الإمام أحمد عن الإمام محمد بن إدريس الشافعي عن الإمام مالك بن أنس عن الزهري عن عبدالرحمن بن كعب بن مالك عن أبيه عن رسول الله صلى الله عليه وسلم قال \"إنما نسمة المؤمن طائر يعلق في شجر الجنة حتى يرجعه الله إلى جسده يوم يبعثه\" وهذا إسناد عظيم ومتن قريم وفي الصحيح أن رسول الله صلى الله عليه وسلم قال \"إن أرواح الشهداء في حواصل طيور خضر تسرح في رياض الجنة حيث شاءت ثم تأوي إلى قناديل معلقة بالعرش\" الحديث وقال الإمام أحمد: حدثنا عفان حدثنا همام حدثنا عطاء بن السائب قال كان أول يوم عرفت فيه عبدالرحمن بن أبي ليلى رأيت شيخا أبيض الرأس واللحية على حمار وهو يتبع جنازة فسمعته يقول حدثني فلان بن فلان سمع رسول الله صلى الله عليه وسلم يقول \"من أحب لقاء الله أحب الله لقاءه ومن كره لقاء الله كره الله لقاءه\" قال فأكب القوم يبكون فقال ما يبكيكم؟ فقالوا إنا نكره الموت قال ليس ذاك ولكنه إذا احتضر \"فأما إن كان من المقربين فروح وريحان وجنة نعيم\" فإذا بشر بذلك أحب لقاء الله عز وجل والله عز وجل للقائه أحب \"وأما إن كان من المكذبين الضالين فنزل من حميم وتصلية جحيم\" فإذا بشر بذلك كره لقاء الله والله تعالى للقاءه أكره هكذا رواه الإمام أحمد عن عائشة رضي الله عنهما شاهد لمعناه."
    },
    {
      "ayah": 9,
      "surah": 56,
      "text": "وقال الإمام أحمد حدثنا محمد بن عبدالله بن المثنى حدثنا البراء الغنوي حدثنا الحسن عن معاذ بن جبل أن رسول الله صلى الله عليه وسلم تلا هذه الآية \"وأصحاب اليمين ما أصحاب اليمين. وأصحاب الشمال ما أصحاب الشمال\" فقبض بيده قبضتين فقال \"هذه للجنة ولا أبالي وهذه للنار ولا أبالي\" وقال الإمام أحمد أيضا حدثنا حسن حدثنا ابن لهيعة حدثنا خالد بن أبي عمران عن القاسم بن محمد عن عائشة عن رسول الله صلى الله عليه وسلم أنه قال \"أتدرون من السابقون إلى ظل يوم القيامة\" قالوا الله ورسوله أعلم قال \"الذين إذا أعطوا الحق قبلوه وإذا سئلوه بذلوه وحكموا للناس كحكمهم لأنفسهم\" وقال محمد بن كعب وأبو حرزة ويعقوب بن مجاهد \"والسابقون السابقون\" الأنبياء عليهم السلام وقال السدي هم أهل عليين وقال ابن أبي نجيح عن مجاهد عن ابن عباس \"والسابقون السابقون\" قال يوشع بن نون سبق إلى موسى ومؤمن آل يس سبق إلى عيسى وعلي بن أبي طالب سبق إلى محمد رسول الله صلى الله عليه وسلم رواه ابن أبي حاتم عن محمد بن هارون الفلاس عن عبدالله بن إسماعيل المدائني البزار عن سفيان بن الضحاك المدائني عن سفيان بن عيينة عن ابن أبي نجيح به. وقال ابن أبي حاتم وذكر عن محمد بن أبي حماد حدثنا مهران عن خارجة عن قرة عن ابن سيرين \"والسابقون السابقون\" الذي صلوا إلى القبلتين. ورواه ابن جرير من حديث خارجة به وقال الحسن وقتادة \"والسابقون السابقون\" أي من كل أمة وقال الأوزاعي عن عثمان بن أبي سودة أنه قرأ هذه الآية \"والسابقون السابقون أولئك المقربون\" ثم قال أولهم رواحا إلى المسجد وأولهم خروجا في سبيل الله وهذه الأقوال كلها صحيحة فإن المراد بالسابقين هم المبادرون إلى فعل الخيرات كما أمروا كما قال تعالى \"وسارعوا إلى مغفرة من ربكم وجنة عرضها السموات والأرض\" وقال تعالى \"سابقوا إلى مغفرة من ربكم وجنة عرضها كعرض السماء والأرض\" فمن سابق في هذه الدنيا وسبق إلى فعل الخير كان في الآخرة من السابقين إلى الكرامة فإن الجزاء من جنس العمل وكما تدين تدان. ولهذا قال تعالى \"أولئك المقربون في جنات النعيم\". وقال ابن أبي حاتم حدثنا أبي حدثنا يحيى بن زكريا القزاري الرازي حدثنا خارجة بن مصعب عن زيد ابن أسلم عن عطاء بن يسار عن عبدالله بن عمرو قال: قالت الملائكة يا رب جعلت لبني آدم الدنيا فهم يأكلون ويشربون ويتزوجون فاجعل لنا الآخرة فقال لا أفعل فراجعوا ثلاثا فقال لا أجعل من خلقت بيدي كمن قلت له كن فكان. ثم قرأ عبدالله \"والسابقون السابقون أولئك المقربون في جنات النعيم\" وقد روى هذا الأثر الإمام عثمان بن سعيد الدارمي في كتابه الرد على الجهمية ولفظه: فقال الله عز وجل لن أجعل صالح ذرية من خلقت بيدي كمن قلت له كن فيكون."
    },
    {
      "ayah": 90,
      "surah": 56,
      "text": "وقوله تعالى \"وأما إن كان من أصحاب اليمين\" أي وأما إن كان المحتضر من أصحاب اليمين \"فسلام لك من أصحاب اليمين\" أي تبشرهم الملائكة بذلك تقول لأحدهم سلام لك أي لا بأس عليك أنت إلى سلامة أنت من أصحاب اليمين وقال قتادة وابن زيد: سلم من عذاب الله وسلمت عليه ملائكة الله كما قال عكرمة تسلم عليه الملائكة وتخبره أنه من أصحاب اليمين وهذا معنى حسن ويكون ذلك كقول الله تعالى \"إن الذين قالوا ربنا الله ثم استقاموا تتنزل عليهم الملائكة ألا تخافوا ولا تحزنوا وأبشروا بالجنة التي كنتم توعدون نحن أولياكم في الحياة الدنيا وفي الآخرة ولكم فيها ما تشتهي أنفسكم ولكم فيها ما تدعون نزلا من غفور رحيم\" قال البخاري فسلام لك أي مسلم لك أنك من أصحاب اليمين وألغيت أن وبقي معناها كما تقول أنت مصدق مسافر عن قليل إذا كان قد قال إنى مسافر عن قليل وقد يكون كالدعاء له كقولك سقيا لك من الرجال إن رفعت السلام فهو من الدعاء وقد حكاه ابن جرير هكذا عن بعض أهل العربية ومال إليـه والله أعلم."
    },
    {
      "ayah": 91,
      "surah": 56,
      "text": "وقوله تعالى \"وأما إن كان من أصحاب اليمين\" أي وأما إن كان المحتضر من أصحاب اليمين \"فسلام لك من أصحاب اليمين\" أي تبشرهم الملائكة بذلك تقول لأحدهم سلام لك أي لا بأس عليك أنت إلى سلامة أنت من أصحاب اليمين وقال قتادة وابن زيد: سلم من عذاب الله وسلمت عليه ملائكة الله كما قال عكرمة تسلم عليه الملائكة وتخبره أنه من أصحاب اليمين وهذا معنى حسن ويكون ذلك كقول الله تعالى \"إن الذين قالوا ربنا الله ثم استقاموا تتنزل عليهم الملائكة ألا تخافوا ولا تحزنوا وأبشروا بالجنة التي كنتم توعدون نحن أولياكم في الحياة الدنيا وفي الآخرة ولكم فيها ما تشتهي أنفسكم ولكم فيها ما تدعون نزلا من غفور رحيم\" قال البخاري فسلام لك أي مسلم لك أنك من أصحاب اليمين وألغيت أن وبقي معناها كما تقول أنت مصدق مسافر عن قليل إذا كان قد قال إنى مسافر عن قليل وقد يكون كالدعاء له كقولك سقيا لك من الرجال إن رفعت السلام فهو من الدعاء وقد حكاه ابن جرير هكذا عن بعض أهل العربية ومال إليـه والله أعلم."
    },
    {
      "ayah": 92,
      "surah": 56,
      "text": "وقوله تعالى \"وأما إن كان من المكذبين الضالين فنزل من حميم وتصلية جحيم\" أي وأما إن كان المحتضر من المكذبين بالحق الضالين عن الهدي \"فنزل\" أي فضيافة \"من حميم\" وهو المذاب الذي يصهر به ما في بطونهم والجلود \"وتصلية جحيم\" أي وتقرير له في النار التي تغمره عن جميع جهاته."
    },
    {
      "ayah": 93,
      "surah": 56,
      "text": "وقوله تعالى \"وأما إن كان من المكذبين الضالين فنزل من حميم وتصلية جحيم\" أي وأما إن كان المحتضر من المكذبين بالحق الضالين عن الهدي \"فنزل\" أي فضيافة \"من حميم\" وهو المذاب الذي يصهر به ما في بطونهم والجلود \"وتصلية جحيم\" أي وتقرير له في النار التي تغمره عن جميع جهاته."
    },
    {
      "ayah": 94,
      "surah": 56,
      "text": "وقوله تعالى \"وأما إن كان من المكذبين الضالين فنزل من حميم وتصلية جحيم\" أي وأما إن كان المحتضر من المكذبين بالحق الضالين عن الهدي \"فنزل\" أي فضيافة \"من حميم\" وهو المذاب الذي يصهر به ما في بطونهم والجلود \"وتصلية جحيم\" أي وتقرير له في النار التي تغمره عن جميع جهاته."
    },
    {
      "ayah": 95,
      "surah": 56,
      "text": "قال تعالى \"إن هذا لهو حق اليقين\" أي إن هذا الخبر لهو حق اليقين الذي لا مرية فيه ولا محيد لأحد عنه."
    },
    {
      "ayah": 96,
      "surah": 56,
      "text": "\"فسبح باسم ربك العظيم\" قال الإمام أحمد حدثنا أبو عبد الرحمن حدثنا موسى بن أيوب الغافقي حدثني إياس بن عامر عن عقبة بن عامر الجهني قال لما نزلت على رسول الله صلى الله عليه وسلم \"فسبح باسم ربك العظيم\" قال اجعلوها في ركوعكم ولما نزلت \"سبح اسم ربك الأعلى\" قال رسول الله صلى الله عليه وسلم اجعلوها في سجودكم وكذا رواه أبو داود وابن ماجه من حديث عبدالله بن المبارك عن موسى بن أيوب به وقال روح بن عبادة حدثنا حجاج الصواف عن أبي الصواف عن أبي الزبير عن جابر قال: قال رسول الله صلى الله عليه وسلم من قال سبحان الله العظيم وبحمده غرست له نخلة في الجنة هكدا رواه الترمذي من حديث روح ورواه هو والنسائي أيضا من حديث حماد بن سلمة من حديث أبي الزبير عن جابر عن النبي صلى الله عليه وسلم به وقال الترمذي: حسن غريب لا نعرفة إلا من حديث أبي الزبير وقال البخارى في آخر كتابه حدثنا أحمد بن أشكاب حدثنا محمد بن فضيل حدثنا عمارة بن القعقاع عن أبي زرعه عن أبي هريرة قال: قال رسول الله صلى الله عليه وسلم كلمتان خفيفتان على اللسان ثقيلتان في الميزان حبيبتان إلى الرحمن: سبحان الله وبحمده سبحان الله العظيم ورواه بقية الجماعة إلا أبا داود من حديث محمد بن فضيل بإسناده مثله آخر تفسير سورة الواقعة ولله الحمد والمنة."
    }
  ]
}
