{
  "ayahs": [
    {
      "ayah": 1,
      "surah": 57,
      "text": "سورة الحديد: قال الإمام أحمد حدثنا يزيد بن عبد ربه حدثنا بقية بن الوليد حدثني بجير بن سعد عن خالد بن معدان عن ابن أبي بلال عن عرباض بن سارية أنه حدثهم أن رسول الله صلى الله عليه وسلم كان يقرأ المسبحات قبل أن يرقد وقال \"إن فيهن آية أفضل من ألف آية\" وهكذا رواه أبو داود والترمذي والنسائي من طرق عن بقية به وقال الترمذي حسن غريب ورواه النسائي عن ابن أبي السرح عن ابن وهب عن معاوية بن صالح عن بجير بن سعد عن خالد بن معدان قال كان رسول الله صلى الله عليه وسلم فذكره مرسلا ولم يذكر عبدالله بن أبي بلال ولا العرباض بن سارية والآية المشار إليها في الحديث هي والله أعلم قوله تعالى \"هو الأول والآخر والظاهر والباطن وهو بكل شيء عليم\" كما سيأتي بيانه قريبا إن شاء الله تعالى وبه الثقة وعليه التكلان وهو حسبنا ونعم الوكيل يخبر تعالى أنه يسبح له ما في السماوات والأرض أي من الحيوانات والنباتات كما قال في الآية الأخرى \"تسبح له السموات السبع والأرض ومن فيهن وإن من شيء إلا يسبح بحمده ولكن لا يفقهون تسبيحهم إنه كان حليما غفورا\" وقوله تعالى \"وهو العزيز\" أي الذي قد خضع له كل شيء \"الحكيم\" في خلقه وأمره وشرعه."
    },
    {
      "ayah": 10,
      "surah": 57,
      "text": "فقال \"ومالكم ألا تنفقوا في سبيل الله ولله ميراث السموات والأرض\" أي أنفقوا ولا تخشوا فقرا وإقلالا فإن الذي انفقتم في سبيله هو مالك السماوات والأرض وبيده مقاليدهما وعنده خزائنهما وهو مالك العرش بما حوى وهو القائل \"وما أنفقتم من شىء فهو يخلفه وهو خير الرازقين\" وقال \"ما عندكم ينفذ وما عند الله باق\" فمن توكل على الله أنفق ولم يخش من ذي العرش إقلالا وعلم أن الله سيخلفه عليه وقوله تعالى \"لا يستوى منكم من أنفق من قبل الفتح وقاتل\" أي لا يستوي هذا ومن لم يفعل كفعله وذلك أن قبل فتح مكة كان الحال شديدا فلم يكن يؤمن حينئذ إلا الصديقون وأما بعد الفتح فإنه ظهر الإسلام ظهورا عظيما ودخل الناس في دين الله أفواجا ولهذا قال تعالى \"أولئك أعظم درجة من الذين أنفقوا من بعد وقاتلوا وكلا وعد الله الحسنى\" والجمهور على أن المراد بالفتح ههنا فتح مكة وعن الشعبي وغيره أن المراد بالفتح ههنا صلح الحديبية وقد يستدل لهذا القول بما قال الإمام أحمد حدثنا أحمد بن عبد الملك حدثنا زهير حدثنا حميد الطويل عن أنس قال كان بين خالد بن الوليد وبين عبدالرحمن بن عوف كلام فقال خالد لعبدالرحمن تستطيلون علينا بأيام سبقتمونا بها فبلغنا أن ذلك ذكر للنبي صلى الله عليه وسلم فقال \"دعوا لي أصحابي فوالذي نفسي بيده لو أنفقتم مثل أحد أو مثل الجبال ذهبا ما بلغتم أعمالهم\" ومعلوم أن إسلام خالد بن الوليد المواجه بهذا الخطاب كان بين صلح الحديبية وفتح مكة وكانت هذه المشاجرة بينهما في بني جذيمة الذين بعث إليهم رسول الله صلى الله عليه وسلم خالد بن الوليد بعد الفتح فجعلوا يقولون صبأنا صبأنا فلم يحسنوا أن يقولوا أسلمنا فأمر خالد بقتلهم وقتل من أسر منهم فخالفه عبدالرحمن بن عوف وعبدالله بن عمر وغيرهما فاختصم خالد وعبدالرحمن بسبب ذلك والذي في الصحيح عن رسول الله صلى الله عليه وسلم أنه قال \"لا تسبوا أصحابي فوالذي نفسي بيده لو أنفق أحدكم مثل أحد ذهبا ما بلغ مد أحدهم ولا نصيفه\" وروى ابن جرير وابن أبي حاتم من حديث ابن وهب أخبرنا هشام بن سعد عن زيد بن أسلم عن عطاء بن يسار عن أبي سعيد الخدري أنه قال خرجنا مع رسول الله صلى الله عليه وسلم عام الحديبية حتى إذا كنا بعسفان قال رسول الله صلى الله عليه وسلم \"يوشك أن يأتي قوم تحقرون أعمالكم مع أعمالهم\" فقلنا من هم يا رسول الله أقريش؟ قال \"لا ولكن أهل اليمن هم أرق أفئدة وألين قلوبا\" فقلنا أهم خير منا يا رسول الله؟ قال \"لو كان لأحدهم جبل من ذهب فأنفقه ما أدرك مد أحدكم ولا نصيفه إلا أن هذا فضل ما بيننا وبين الناس \"لا يستوي منكم من أنفق من قبل الفتح وقاتل أولئك أعظم درجة من الذين أنفقوا من بعد وقاتلوا وكلا وعد الله الحسنى والله بما تعلمون خبير\" وهذا الحديث غريب بهذا السياق. والذي في الصحيحين من رواية جماعة عن عطاء بن يسار عن أبي سعيد ذكر الخوارج \"تحقرون صلاتكم مع صلاتهم وصيامكم مع صيامهم يمرقون من الدين كما يمرق السهم من الرمية\" الحديث ولكن روى ابن جرير هذا الحديث من وجه آخر فقال: حدثنى ابن البرقي حدثنا ابن أبي مريم أخبرنا محمد بن جعفر أخبرني زيد بن أسلم عن أبي سعيد التمار عن أبي سعيد الخدري أن رسول الله صلى الله عليه وسلم قال \"يوشك أن يأتي قوم تحقرون أعمالكم مع أعمالهم قلنا من هم يا رسول الله قريش؟ قال لا ولكن أهل اليمن لأنهم أرق أفئدة وألين قلوبا\" وأشار بيده إلى اليمن فقال \"هم أهل اليمن ألا إن الإيمان يمان والحكمة يمانية\" فقلنا يا رسول الله هم خير منا؟ قال: \"والذي نفسي بيده لو كان لأحدهم جبل من ذهب ينفقه ما أدى مد أحدكم ولا نصيفه\" ثم جمع أصابعه ومد خنصره وقال ألا إن هذا فضل ما بيننا وبين الناس \"لا يستوي منكم من أنفق من قبل الفتح وقاتل أولئك أعظم درجة من الذين أنفقوا من بعد وقاتلوا وكلا وعد الله الحسنى والله بما تعملون خبير\" فهذا السياق ليس فيه ذكر الحديبية فإن كان ذلك محفوظا كما تقدم فيحتمل أنه أنزل قبل الفتح إخبارا عما بعده كما في قوله تعالى في سورة المزمل وهي مكية من أوائل ما نزل \"وآخرون يقاتلون فى سبيل الله\" الآية فهي بشارة بما يستقبل وهكذا هذه والله أعلم. وقوله تعالى \"وكلا وعد الله الحسنى\" يعني المنفقين قبل الفتح وبعده كلهم لهم ثواب على ما عملوا وإن كان بينهم تفاوت في تفاضل الجزاء كما قال تعالى \"لا يستوي القاعدون من المؤمنين غير أولي الضرر والمجاهدون فى سبيل الله بأموالهم وأنفسهم فضل الله المجاهدين بأموالهم وأنفسهم على القاعدين درجة وكلا وعد الله الحسنى وفضل الله المجاهدين على القاعدين أجرا عظيما\" وهكذا الحديث الذي في الصحيح \"المؤمن القوي خير وأحب إلى الله من المؤمن الضعيف وفي كل خير\" وإنما نبه بهذا لئلا يهدر جانب الآخر بمدح الأول دون الآخر فيتوهم متوهم ذمه فلهذا عطف بمدح الآخر والثناء عليه مع تفضيل الأول عليه لهذا قال تعالى \"والله بما تعملون خبير\" أي فلخبرته فاوت بين ثواب من أنفق من قبل الفتح وقاتل ومن فعل ذلك بعد ذلك وما ذاك إلا لعلمه بقصد الأول وإخلاصه التام وإنفاقه في حال الجهد والقلة والضيق وفي الحديث \"سبق درهم مائه ألف\" ولا شك عند أهل الإيمان أن الصديق أبا بكر رضي الله عنه له الحظ الأوفر من هذه الآية فإنه سيد من عمل بها من سائر أمم الأنبياء فإنه أنفق ماله كله ابتغاء وجه الله عز وجل ولم يكن لأحد عنده نعمة يجزيه بها. وقد قال أبو محمد الحسين بن مسعود البغوي عند تفسير هذه الآية أخبرنا أحمد بن إبراهيم الشريحي أخبرنا أبو إسحاق أحمد بن محمد بن إبراهيم الثعلبي أخبرنا عبدالله بن حامد بن محمد أخبرنا أحمد بن إسحاق بن أيوب أخبرنا محمد بن يونس حدثنا العلاء بن عمرو الشيباني حدثنا أبو إسحاق الفزاري حدثنا سفيان بن سعيد عن آدم بن علي عن ابن عمر قال كنت عند النبي صلى الله عليه وسلم وعنده أبو بكر الصديق وعليه عباءة قد خلها في صدره بخلال فنزل جبريل فقال مالي أرى أبا بكر عليه عباءة قد خلها في صدره بخلال؟ فقال \"أنفق ماله علي قبل الفتح\" قال فإن الله يقول اقرأ عليه السلام وقل له أراض أنت عني في فقرك هذا أم ساخط؟ فقال رسول الله صلى الله عليه وسلم \"يا أبا بكر إن الله يقرأ عليك السلام ويقول لك أراض أنت عني فى فقرك هذا أم ساخط؟ فقال أبو بكر رضي الله عنه أسخط على ربي عز وجل؟ إنى عن ربي راض\" هذا الحديث ضعيف الإسناد من هذا الوجه والله أعلم."
    },
    {
      "ayah": 11,
      "surah": 57,
      "text": "وقوله تعالى \"من ذا الذي يقرض الله قرضا حسنا\" قال عمر بن الخطاب هو الإنفاق في سبيل الله. وقيل هو النفقة على العيال والصحيح أنه أعم من ذلك فكل من أنفق في سبيل الله بنية خالصة وعزيمة صادقة دخل في عموم هذه الآية ولهذا قال تعالى \"من ذا الذي يقرض الله قرضا حسنا فيضاعفه له\" كما قال في الآية الأخرى \"أضعافا كثيرة\" \" وله أجر كريم\" أي جزاء جميل ورزق باهر وهو الجنة يوم القيامة قال ابن أبي حاتم حدثنا الحسن بن عرفة حدثنا خلف بن خليفة عن حميد الأعرج عن عبدالله بن الحارث عن عبدالله بن مسعود قال: لما نزلت هذه الآية \"من ذا الذي يقرض الله قرضا حسنا فيضاعفه له\" قال أبو الدحداح الأنصاري يا رسول الله وإن الله ليريد منا القرض؟ \"قال نعم يا أبا الدحداح\" قال أرني يدك يا رسول الله قال فناوله يده قال فإني قد أقرضت ربى حائطي وله حائط فيه ستمائة نخلة وأم الدحداح فيه وعيالها قال فجاء أبو الدحداح فناداها يا أم الدحداح قالت لبيك قال اخرجي فقد أقرضته ربي عز وجل. وفي رواية أنها قالت له ربح بيعك يا أبا الدحداح ونقلت منه متاعها وصبيانها وإن رسول الله صلى الله عليه وسلم قال \"كم من عذق رداح في الجنة لأبي الدحداح - وفي لفظ - رب نخلة مدلاة عروقها در وياقوت لأبي الدحداح في الجنة\"."
    },
    {
      "ayah": 12,
      "surah": 57,
      "text": "يقول تعالى مخبرا عن المؤمنين المتصدقين أنهم يوم القيامة يسعى نورهم بين أيديهم في عرصات القيامة بحسب أعمالهم كما قال عبدالله بن مسعود في قوله تعالى \"يسعى نورهم بين أيديهم\" قال على قدر أعمالهم يمرون على الصراط منهم من نوره مثل الجبل ومنهم من نوره مثل النخلة ومنهم من نوره مثل الرجل القائم وأدناهم نورا من نوره في إبهامه يتقد مرة ويطفأ مرة ورواه ابن أبي حاتم وابن جرير وقال قتادة ذكر لنا أن نبي الله صلى الله عليه وسلم كان يقول \"من المؤمنين من يضىء نوره من المدينة إلى عدن أبين وصنعاء فدون ذلك حتى أن من المؤمنين من يضيء نوره موضع قدميه\". وقال سفيان الثوري عن حصين عن مجاهد عن جنادة بن أبي أمية قال إنكم مكتوبون عند الله بأسمائكم وسيماكم وحلاكم ونجواكم ومجالسكم فإذا كان يوم القيامة قيل يا فلان هذا نورك يا فلان لا نور لك وقرأ \"يسعى نورهم بين أيديهم\" وقال الضحاك ليس أحد إلا يعطى نورا يوم القيامة فإذا انتهوا إلى الصراط طفىء نور المنافقين فلما رأى ذلك المؤمنون أشفقوا أن يطفأ نورهم كما طفىء نور المنافقين فقالوا \"ربنا أتمم لنا نورنا\" وقال الحسن \"يسعى نورهم بين أيديهم\" يعني على الصراط.وقد قال ابن أبي حاتم رحمه الله تعالى حدثنا أبو عبيدالله ابن أخي ابن وهب أخبرنا عمي عن يزيد بن أبي حبيب عن سعيد بن مسعود أنه سمع عبدالرحمن بن جبير يحدث أنه سمع أبا الدرداء وأبا ذر يخبران عن النبي صلى الله عليه وسلم قال \"أنا أول من يؤذن له يوم القيامة بالسجود وأول من يؤذن له برفع رأسه فأنظر من بين يدي ومن خلفي وعن يميني وعن شمالي فأعرف أمتي من بين الأمم\" فقال له رجل يا نبي الله كيف تعرف أمتك من بين الأمم ما بين نوح إلى أمتك ؟ فقال \"أعرفهم محجلون من أثر الوضوء ولا يكون لأحد من الأمم غيرهم وأعرفهم يؤتون كتبهم بأيمانهم وأعرفهم بسيماهم في وجوههم وأعرفهم بنورهم يسعى بين أيديهم\". وقوله \"وبأيمانهم\" قال الضحاك: أي وبأيمانهم كتبهم كما قال \"فمن أوتي كتابه بيمينه\" وقوله \"بشراكم اليوم جنات تجري من تحتها الأنهار\" أي يقال لهم بشراكم اليوم جنات أي لكم البشارة بجنات تجري من تحتها الأنهار \"خالدين فيها\" أي ماكثين فيها أبدا \"ذلك هو الفوز العظيم\"."
    },
    {
      "ayah": 13,
      "surah": 57,
      "text": "وهذا إخبار منه تعالى عما يقع يوم القيامة في العرصات من الأهوال المزعجة والزلازل العظيمة والأمور الفظيعة وإنه لا ينجو يومئذ إلا من آمن بالله ورسوله وعمل بما أمر الله به وترك ما عنه زجر. قال ابن أبي حاتم حدثنا أبي حدثنا عبدة بن سليمان حدثنا ابن المبارك حدثنا صفوان بن عمرو حدثني سليم بن عامر قال خرجنا على جنازة في باب دمشق ومعنا أبو أمامة الباهلي فلما صلى على الجنازة وأخذوا في دفنها قال أبو أمامة: أيها الناس إنكم قد أصبحتم وأمسيتم في منزل تقتسمون فيه الحسنات والسيئات. وتوشكون أن تظعنوا منه إلى منزل آخر وهو هذا - يشير إلى القبر- بيت الوحدة وبيت الظلمة وبيت الدود وبيت الضيق إلا ما وسع الله ثم تنتقلون منه إلى مواطن يوم القيامة فإنكم في بعض تلك المواطن حتى يغشى الناس أمر من الله فتبيض وجوه وتسود وجوه ثم تنتقلون منه إلى منزل آخر فيغشى الناس ظلمة شديدة ثم يقسم النور فيعطي المؤمن نورا ويترك الكافر والمنافق فلا يعطيان شيئا وهو المثل الذي ضربه الله تعالى في كتابه فقال \"أو كظلمات في بحر لجي يغشاه موج من فوقه موج من فوقه سحاب ظلمات بعضها فوق بعض إذا أخرج يده لم يكد يراها ومن لم يجعل الله له نورا فماله من نور\" فلا يستضيء الكافر والمنافق بنور المؤمن كما لا يستضيء الأعمى ببصر البصير ويقول المنافقون والمنافقات للذين آمنوا \"انظرونا نقتبس من نوركم قيل ارجعوا وراءكم فالتمسوا نورا\" وهي خدعة الله التي خدع بها المنافقين حيث قال \"يخادعون الله وهو خادعهم\" فيرجعون إلى المكان الذي قسم فيه النور فلا يجدون شيئا فينصرفون إليهم وقد ضرب بينهم \"بسور له باب باطنه فيه الرحمة وظاهره من قبله العذاب\" الآية. يقول سليم بن عامر فما يزال المنافق مغترا حتى يقسم النور ويميز الله بين المنافق والمؤمن ثم قال حدثنا أبي حدثنا يحيى بن عثمان حدثنا ابن حيوة حدثنا أرطأة بن المنذر حدثنا يوسف بن الحجاج عن أبي أمامة قال: يبعث الله ظلمة يوم القيامة فما من مؤمن ولا كافر يرى كفه حتى يبعث الله بالنور إلى المؤمنين بقدر أعمالهم فيتبعهم المنافقون فيقولون انظرونا نقتبس من نوركم. وقال العوفي والضحاك وغيرهما عن أبن عباس بينما الناس في ظلمة إذ بعث الله نورا فلما رأى المؤمنون النور توجهوا نحوه وكان النور دليلا من الله إلى الجنة فلما رأى المنافقون المؤمنين قد انطلقوا اتبعوهم فأظلم الله على المنافقين فقالوا حينئذ \"انظرونا نقتبس من نوركم\" فإنا كنا معكم في الدنيا قال المؤمنون \"ارجعوا وراءكم\" من حيث جئتم من الظلمة فالتمسوا هنالك النور وقال أبو القاسم الطبراني حدثنا الحسن بن عرفة بن علوية العطار حدثنا إسماعيل بن عيسى العطار حدثنا إسحاق بن بشر ابن حذيفة حدثنا ابن جريج عن ابن أبي مليكة عن ابن عباس قال: قال رسول الله صلى الله عليه وسلم\" إن الله تعالى يدعو الناس يوم القيامة بأسمائهم سترا منه على عباده وأما عند الصراط فإن الله يعطي كل مؤمن نورا وكل منافق نورا فإذا استووا على الصراط سلب الله نور المنافقين والمنافقات فقال المنافقون \"انظرونا نقتبس من نوركم\" وقال المؤمنون \"ربنا أتمم لنا نورنا\" فلا يذكر عند ذلك أحد أحدا\" وقوله تعالى \"فضرب بينهم بسور له باب باطنه فيه الرحمة وظاهره من قبله العذاب\" قال الحسن وقتادة هو حائط بين الجنة والنار وقال عبدالرحمن بن زيد بن أسلم هو الذي قال الله تعالى \"وبينهما حجاب\" وهكذا روي عن مجاهد رحمه الله وغير واحد وهو الصحيح \"باطنه فيه الرحمة\" أي الجنة وما فيهـا \"وظاهره من قبله العذاب\" أي النار قاله قتادة وابن زيد وغيرهما. قال ابن جرير وقد قيل إن ذلك السور سور بيت المقدس عند وادي جهنم. ثم قال حدثنا ابن البرقي حدثنا عمرو بن أبي سلمة عن سعيد بن عطية بن قيس عن أبي العوام مؤذن بيت المقدس قال سمعت عبدالله بن عمرو يقول إن السور الذي ذكره الله في القرآن \"فضرب بينهم بسور له باب باطنه فيه الرحمة وظاهره من قبله العذاب\" هو السور الشرقي باطنه المسجد وما يليه وظاهره وادي جهنم ثم روي عن عبادة بن الصامت وكعب الأحبار وعلي بن الحسين وزين العابدين نحو ذلك وهذا محمول منهم على أنهم أرادوا بهذا تقريب المعنى ومثالا لذلك لا أن هذا هو الذي أريد من القرآن هذا الجدار المعين ونفس المسجد وما وراءه من الوادي المعروف بوادي جهنم فإن الجنة في السموات في أعلى عليين والنار في الدركات أسفل سافلين وقول كعب الأحبار إن الباب المذكور في القرآن هو باب الرحمة الذي هو أحد أبواب المسجد فهذا من إسرائيلياته وترهاته وإنما المراد بذلك سور يضرب يوم القيامة ليحجز بين المؤمنين والمنافقين فإذا انتهى إليه المؤمنون دخلوه من بابه فإذا استكملوا دخولهم أغلق الباب وبقي المنافقون من وراءه فى الحيرة والظلمة والعذاب كما كانوا في الدار الدنيا في كفر وجهل وشك وحيرة."
    },
    {
      "ayah": 14,
      "surah": 57,
      "text": "\"ينادونهم ألم نكن معكم\" أى ينادي المنافقون المؤمنين أما كنا معكم في الدار الدنيا نشهد معكم الجمعات ونصلي معكم الجماعات ونقف معكم بعرفات ونحضر معكم الغزوات ونؤدي معكم سائر الواجبات؟ \"قالوا بلى\" أي فأجاب المؤمنون المنافقين قائلين بلى قد كنتم معنا \"ولكنكم فتنتم أنفسكم وتربصتم وارتبتم وغرتكم الأماني\" قال بعض السلف أي فتنتم أنفسكم باللذات والمعاصي والشهوات \"وتربصتم\" أي أخرتم التوبة من وقت إلى وقت. وقال قتادة تربصتم بالحق وأهله \"وارتبتم\" أي بالبعث بعد الموت \"وغرتكم الأماني\" أي قلتم سيغفر لنا وقيل غرتكم الدنيا \"حتى جاء أمر الله\" أي ما زلتم في هذا حتى جاءكم الموت \"وغركم بالله الغرور\" أي الشيطان قال قتادة: كانوا على خدعة من الشيطان والله ما زالوا عليها حتى قذفهم الله في النار. ومعنى هذا الكلام من المؤمنين للمنافقين إنكم كنتم معنا أي بأبدان لا نية لها ولا قلوب معها وإنما كنتم في حيرة وشك فكنتم تراءون الناس ولا تذكرون الله إلا قليلا. قال مجاهد: كان المنافقون مع المؤمنين أحياء يناكحونهم ويغشونهم ويعاشرونهم وكانوا معهم أمواتا ويعطون النور جميعا يوم القيامة ويطفأ النور من المنافقين إذا بلغوا السور ويماز بينهم حينئذ. وهذا القول من المؤمنين لا ينافي قولهم الذي أخبر الله تعالى به عنهم حيث يقول وهو أصدق القائلين \"كل نفس بما كسبت رهينة إلا أصحاب اليمين في جنات يتساءلون عن المجرمين ما سلككم في سقر قالوا لم نك من المصلين ولم نك نطعم المسكين وكنا نخوض مع الخائضين وكنا نكذب بيوم الدين حتى أتانا اليقين\" فهذا إنما خرج منهم على وجه التقريع لهم والتوبيخ ثم قال تعالى \"فما تنفعهم شفاعة الشافعين\" ."
    },
    {
      "ayah": 15,
      "surah": 57,
      "text": "أي لو جاء أحدكم اليوم بملء الأرض ذهبا ومثله معه ليفتدي به من عذاب الله ما قبل منه وقوله تعالى \"مأواكم النار\" أي هي مصيركم وإليها منقلبكم وقوله تعالى\" هي مولاكم\" أي هي أولى بكم من كل منزل على كفركم وارتيابكم وبئس المصير."
    },
    {
      "ayah": 16,
      "surah": 57,
      "text": "يقول تعالى أما آن للمؤمنين أن تخشع قلوبهم لذكر الله أي تلين عند الذكر والموعظة وسماع القرآن فتفهمه وتنقاد له وتسمع له وتطيعه. قال عبدالله بن المبارك حدثنا صالح المري عن قتادة عن ابن عباس أنه قال: إن الله استبطأ قلوب المؤمنين فعاتبهم على رأس ثلاث عشرة من نزول القرآن فقال \"ألم يأن للذين آمنوا أن تخشع قلوبهم لذكر الله\" الآية رواه ابن أبي حاتم عن الحسن بن محمد بن الصباح عن حسين المروزي عن ابن المبارك به. ثم قال هو ومسلم حدثنا يونس بن عبدالأعلى أخبرنا ابن وهب أخبرني عمرو بن الحارث عن سعيد بن أبي هلال يعني الليثي عن عون بن عبدالله عن أبيه عن ابن مسعود رضي الله عنه قال ما كان بين إسلامنا وبين أن عاتبنا الله بهذه الآية \"ألم يأن للذين آمنوا أن تخشع قلوبهم لذكر الله\" الآية إلا أربع سنين كذا رواه مسلم في آخر الكتاب وأخرجه النسائي عند تفسير هذه الآية عن هارون بن سعيد الأيلي عن ابن وهب به. وقد رواه ابن ماجه من حديث موسى بن يعقوب الزمعي عن أبي حازم عن عامر بن عبدالله بن الزبير عن أبيه مثله فجعله من مسند ابن الزبير لكن رواه البزار في مسنده من طريق موسى بن يعقوب عن أبي حازم عن عامر عن ابن الزبير عن ابن مسعود فذكره وقال سفيان الثوري عن المسعودي عن القاسم قال: مل أصحاب رسول الله صلى الله عليه وسلم ملة فقالوا حدثنا يا رسول الله فأنزل الله تعالى \"نحن نقص عليك أحسن القصص\" قال ثم ملوا ملة فقالوا حدثنا يا رسول الله فأنزل الله تعالى \"الله نزل أحسن الحديث\" ثم ملوا ملة فقالوا حدثنا يا رسول الله فأنزل الله تعالى \"ألم يأن للذين آمنوا أن تخشع قلوبهم لذكر الله\" وقال قتادة \"ألم يأن للذين آمنوا أن تخشع قلوبهم لذكر الله\" ذكر لنا أن شداد بن أوس كان يروي عن رسول الله صلى الله عليه وسلم قال \"إن أول ما يرفع من الناس الخشوع\" وقوله تعالى \"ولا يكونوا كالذين أوتوا الكتاب من قبل فطال عليهم الأمد فقست قلوبهم\" نهى الله تعالى المؤمنين أن يتشبهوا بالذين حملوا الكتاب من قبلهم من اليهود والنصارى لما تطاول عليهم الأمد بدلوا كتاب الله الذي بأيديهم واشتروا به ثمنا قليلا ونبذوه وراء ظهورهم وأقبلوا على الآراء المختلفة والأقوال المؤتفكة وقلدوا الرجال في دين الله واتخذوا أحبارهم ورهبانهم أربابا من دون الله فعند ذلك قست قلوبهم فلا يقبلون موعظة ولا تلين قلوبهم بوعد ولا وعيد \"وكثير منهم فاسقون\" أي في الأعمال فقلوبهم فاسدة وأعمالهم باطلة كما قال تعالى \"فبما نقضهم ميثاقهم لعناهم وجعلنا قلوبهم قاسية يحرفون الكلم عن مواضعه ونسوا حظا مما ذكروا به\" أي فسدت قلوبهم فقست وصار من سجيتهم تحريف الكلم عن مواضعه وتركوا الأعمال التي أمروا بها وارتكبوا ما نهوا عنه ولهذا نهى الله المؤمنين أن يتشبهوا بهم في شيء من الأمور الأصلية والفرعية وقد قال ابن أبي حاتم حدثنا أبي حدثنا هشام بن عمار حدثنا شهاب بن خراش حدثنا حجاج بن دينار عن منصور بن المعتمر عن الربيع بن أبي عميلة الفزاري قال حدثنا عبدالله بن مسعود حديث ما سمعت أعجب إلي منه إلا شيئا من كتاب الله أو شيئا قاله النبي صلى الله عليه وسلم قال \"إن بني إسرائيل لما طال عليهم الأمد فقست قلوبهم اخترعوا كتابا من عند أنفسهم استهوته قلوبهم واستحلته ألسنتهم واستلذته وكان الحق يحول بينهم وبين كثير من شهواتهم فقالوا تعالوا ندعوا بني إسرائيل إلى كتابنا هذا فمن تابعنا عليه تركناه ومن كره أن يتابعنا قتلناه ففعلوا ذلك وكان فيهم رجل فقيه فلما رأى ما يصنعون عمد إلى ما يعرف من كتاب الله فكتبه في شيء لطيف ثم أدرجه فجعله في قرن ثم علق ذلك القرن في عنقه فلما أكثروا القتل قال بعضهم لبعض يا هؤلاء إنكم قد أفشيتم القتل في بني إسرائيل فادعوا فلانا فاعرضوا عليه كتابكم فإنه إن تابعكم فسيتابعكم بقية الناس وإن أبى فاقتلوه فدعوا فلانا ذلك الفقيه فقالوا أتؤمن بما في كتابنا هذا؟ قال وما فيه؟ اعرضوه علي فعرضوه عليه إلى آخره ثم قالوا أتؤمن بهذا؟ قال نعم أمنت بما في هذا وأشار بيده إلى القرن فتركوه فلما مات فتشوه فوجدوه معلقا ذلك القرن فوجدوا فيه ما يعرف من كتاب الله فقال بعضهم لبعض يا هؤلاء ما كنا نسمع هذا أصابه فتنة فافترقت بنو إسرائيل على اثنتين وسبعين ملة وخير مللهم ملة أصحاب ذي القرن. قال ابن مسعود وإنكم أوشك بكم إن بقيتم أو بقي من بقى منكم أن تروا أمورا تنكرونها لا تستطيعون لها غيرا فبحسب المرء منكم أن يعلم الله من قلبه أنه لها كاره. وروى أبو جعفر الطبري حدثنا ابن حميد حدثنا جرير عن مغيرة عن أبي معشر عن إبراهيم قال جاء عتريس بن عرقوب إلى ابن مسعود فقال يا أبا عبدالله هلك من لم يأمر بالمعروف وينه عن المنكر فقال عبدالله هلك من لم يعرف قلبه معروفا ولم ينكر قلبه منكرا إن بني إسرائيل لما طال عليهم الأمد وقست قلوبهم اخترعوا كتابا من بين أيديهم وأرجلهم استهوته قلوبهم واستحلته ألسنتهم وقالوا نعرض على بني إسرائيل هذا الكتاب فمن آمن به تركناه ومن كفر به قتلناه قال فجعل رجل منهم كتاب الله في قرن ثم جعل القرن بين ثندوتيه فلما قيل له أتؤمن بهذا؟ قال آمنت به ويومىء إلى القرن بين ثندوتيه ومالي لا أؤمن بهذا الكتاب؟ فمن خير مللهم اليوم ملة صاحب القرن."
    },
    {
      "ayah": 17,
      "surah": 57,
      "text": "فيه إشارة إلى أن الله تعالى يلين القلوب بعد قسوتها ويهدي الحيارى بعد ضلتها ويفرج الكروب بعد شدتها فكما يحيي الأرض الميته المجدبة الهامدة بالغيث الهتان الوابل كذلك يهدي القلوب القاسية ببراهين القرآن والدلائل ويولج إليها النور بعد أن كانت مقفلة لا يصل إليها الواصل فسبحان الهادي لمن يشاء بعد الضلال والمضل لمن أراد بعد الكمال الذي هو لما يشاء فعال وهو الحكيم العدل في جميع الفعال اللطيف الخبير الكبير المتعال."
    },
    {
      "ayah": 18,
      "surah": 57,
      "text": "يخبر تعالى عما يثيب به المصدقين والمصدقات بأموالهم على أهل الحاجة والفقر والمسكنة \"وأقرضوا الله قرضا حسنا\" أي دفعوه بنية خالصة ابتغاء مرضاة الله لا يريدون جزاء ممن أعطوه ولا شكورا ولهذا قال \"يضاعف لهم\" أي يقابل لهم الحسنة بعشر أمثالها ويزاد على ذلك إلى سبعمائة ضعف وفوق ذلك \"ولهم أجر كريم\" أي ثواب جزيل حسن ومرجع صالح ومآب كريم."
    },
    {
      "ayah": 19,
      "surah": 57,
      "text": "وقوله تعالى \"والذين آمنوا بالله ورسله أولئك هم الصديقون\" هذا تمام لجملة وصف المؤمنين بالله ورسله بأنهم صديقون قال العوفي عن ابن عباس في قوله تعالى \"والذين امنوا بالله ورسله أولئك هم الصديقون\" هذه مفصولة \"والشهداء عند ربهم لهم أجرهم ونورهم\" وقال أبو الضحى \"أولئك هم الصديقون\" ثم استأنف الكلام فقال \"والشهداء عند ربهم\" وهكذا قال مسروق والضحاك ومقاتل بن حيان وغيرهم وقال الأعمش عن أبي الضحى عن مسروق عن عبدالله بن مسعود في قوله تعالى \"أولئك هم الصديقون والشهداء عند ربهم\" قال هم ثلاثه أصناف: يعني المصدقين والصديقين والشهداء كما قال تعالى \"ومن يطع الله والرسول فأولئك مع الذين أنعم الله عليهم من النبيين والصديقين والشهداء والصالحين\" ففرق بين الصديقين والشهداء فدل على أنهما صنفان ولا شك أن الصديق أعلى مقاما من الشهيد كما رواه الإمام مالك بن أنس رحمه الله في كتابه الموطأ عن صفوان بن سليم عن عطاء بن يسار عن أبي سعيد الخدري أن رسول الله صلى الله عليه وسلم قال \"إن أهل الجنة ليتراءون أهل الغرف من فوقهم كما تتراءون الكوكب الدري الغابر في الأفق من المشرق أو المغرب لتفاضل ما بينهم\" قال يا رسول الله تلك منازل الأنبياء لا يبلغها غيرهم قال \"بلى والذي نفسي بيده رجال آمنوا بالله وصدقوا المرسلين\" اتفق البخاري ومسلم على إخراجه من حديث مالك به. وقال آخرون بل المراد من قوله تعالى \"أولئك هم الصديقون والشهداء عند ربهم\" فأخبر عن المؤمنين بالله ورسله بأنهم صديقون وشهداء حكاه ابن جرير عن مجاهد ثم قال ابن جرير حدثني صالح بن حرب أبو معمر حدثنا إسماعيل بن يحيى حدثنا ابن عجلان عن زيد بن أسلم عن البراء بن عازب قال: سمعت رسول الله صلى الله عليه وسلم يقول: \"مؤمنوا أمتي شهداء\" قال ثم تلا النبي صلى الله عليه وسلم هذه الآية \"والذين آمنوا بالله ورسله أولئك هم الصديقون والشهداء عند ربهم\" هذا حديث غريب. وقال أبو إسحاق عن عمرو بن ميمون في قوله تعالى \"والذين آمنوا بالله ورسله أولئك هم الصديقون والشهداء عند ربهم لهم أجرهم ونورهم\" قال يجيئون يوم القيامة معا كالأصبعين. وقوله تعالى \"والشهداء عند ربهم\" أي في جنات النعيم كما جاء في الصحيحين إن أرواح الشهداء في حواصل طير خضر تسرح في الجنة حيث شاءت ثم تأوي إلى تلك القناديل فاطلع عليهم ربك اطلاعة فقال ماذا تريدون؟ فقالوا نحب أن تردنا إلى الدار الدنيا فنقاتل فيك فنقتل كما قتلنا أول مرة فقال إني قد قضيت أنهم إليها لا يرجعون\" وقوله تعالى \"لهم أجرهم ونورهم\" أي لهم عند الله أجر جزيل ونور عظيم يسعى بين أيديهم وهم في ذلك يتفاوتون بحسب ما كانوا في الدار الدنيا من الأعمال كما قال الإمام أحمد حدثنا يحيى بن إسحاق حدثنا ابن لهيعة عن عطاء بن دينار عن أبى يزيد الخولاني قال: سمعت فضاله بن عبيد يقول سمعت عمر بن الخطاب يقول سمعت رسول الله صلى الله عليه وسلم يقول \"الشهداء أربعة رجل مؤمن جيد الإيمان لقي العدو فصدق الله فقتل فذاك الذي ينظر الناس إليه هكذا ورفع رأسه حتى سقطت قلنسوة رسول الله صلى الله عليه وسلم وقلنسوة عمر والثاني مؤمن لقي العدو فكأنما يضرب ظهره بشوك الطلح جاءه سهم غرب فقتله فذاك فى الدرجة الثانية والثالث رجل مؤمن خلط عملا صالحا وآخر سيئا لقي العدو فصدق الله حتى قتل فذاك في الدرجة الثالثة والرابع رجل مؤمن أسرف على نفسه إسرافا كثيرا لقي العدو فصدق الله حتى قتل فذاك في الرابعة\" وهكذا رواه علي بن المديني عن أبي داود الطيالسي عن ابن المبارك عن ابن لهيعة وقال هذا إسناد مصري صالح ورواه الترمذي من حديث ابن لهيعة وقال حسن غريب. وقوله تعالى \"والذين كفروا وكذبوا بآياتنا أولئك أصحاب الجحيم\" لما ذكر السعداء ومآلهم عطف بذكر الأشقياء وبين حالهم."
    },
    {
      "ayah": 2,
      "surah": 57,
      "text": "أي هو المالك المتصرف في خلقه فيحيي ويميت ويعطي من يشاء ما يشاء \"وهو على كل شيء قدير\" أي ما شاء كان وما لم يشأ لم يكن."
    },
    {
      "ayah": 20,
      "surah": 57,
      "text": "يقول تعالى موهنا أمر الحياة الدنيا ومحقرا لها \"إنما الحياة الدنيا لعب ولهو وزينة وتفاخر بينكم وتكاثر في الأموال والأولاد\" أي إنما حاصل أمرها عند أهلها هذا كما قال تعالى \"زين للناس حب الشهوات من النساء والبنين والقناطير المقنطرة من الذهب والفضة والخيل المسومة والأنعام والحرث ذلك متاع الحياة الدنيا والله عنده حسن المآب\" ثم ضرب تعالى مثل الحياة الدنيا في أنها زهرة فانية ونعمة زائلة فقال \"كمثل غيث\" وهو المطر الذي يأتي بعد قنوط الناس كما قال تعالى \"وهو الذي ينزل الغيث من بعدما قنطوا\". وقوله تعالى \"أعجب الكفار نباته\" أي يعجب الزراع نبات ذلك الزرع الذي نبت بالغيث وكما يعجب الزراع ذلك كذلك تعجب الحياة الدنيا الكفار فإنهم أحرص شيء عليها وأميل الناس إليها. \"ثم يهيج فتراه مصفرا ثم يكون حطاما\" أي يهيج ذلك الزرع فتراه مصفرا بعدما كان خضرا نضرا ثم يكون بعد ذلك كله حطاما أي يصير يبسا متحطما هكذا الحياة الدنيا تكون أولا شابة ثم تكتهل ثم تكون عجوزا شوهاء والإنسان يكون كذلك في أول عمره وعنفوان شبابه غضا طريا لين الأعطاف بهي المنظر ثم إنه يشرع في الكهولة فتتغير طباعه ويفقد بعض قواه ثم يكبر فيصير شيخا كبيرا ضعيف القوى قليل الحركة يعجزه الشيء اليسير كما قال تعالى \"الله الذي خلقكم من ضعف ثم جعل من بعد ضعف قوة ثم جعل من بعد قوة ضعفا وشيبا يخلق ما يشاء وهو العليم القدير\" ولما كان هذا المثل دالا على زوال الدنيا وانقضائها وفراغها لا محالة وأن الآخرة كائنة لا محالة حذر من أمرها ورغب فيما فيها من الخير فقال \"وفي الآخرة عذاب شديد ومغفرة من الله ورضوان وما الحياة الدنيا إلا متاع الغرور\" أي وليس في الآخرة الآتية القريبة إلا إما هذا وإما هذا: إما عذاب شديد وإما مغفرة من الله ورضوان. وقوله تعالى \"وما الحياة الدنيا إلا متاع الغرور\" أي هي متاع فان غار لمن ركن إليه فإنه يغتر بها وتعجبه حتى يعتقد أن لا دار سواها ولا معاد وراءها وهي حقيرة قليلة بالنسبة إلى الدار الآخرة. قال ابن جرير حدثنا علي بن حرب الموصلي حدثنا المحاربي حدثنا محمد بن عمرو عن أبي سلمة عن أبي هريرة قال: قال رسول الله صلى الله عليه وسلم\" موضع سوط في الجنة خير من الدنيا وما فيها اقرأوا \"وما الحياة الدنيا إلا متاع الغرور\" وهذا الحديث ثابت في الصحيح بدون هذه الزيادة والله أعلم. وقال الإمام أحمد حدثنا ابن نمير ووكيع كلاهما عن الأعمش عن شقيق عن عبدالله قال: قال رسول الله صلى الله عليه وسلم \"للجنة أقرب إلى أحدكم من شراك نعله والنار مثل ذلك\" انفرد بإخراجه البخاري في الرقاق من حديث الثوري عن الأعمش به ففي هذا الحديث دليل على اقتراب الخير والشر من الإنسان وإذا كان الأمر كذلك فلهذا حثه الله تعالى على المبادرة إلى الخيرات من فعل الطاعات وترك المحرمات التي تكفر عنه الذنوب والزلات ويحصل له الثواب والدرجات."
    },
    {
      "ayah": 21,
      "surah": 57,
      "text": "فقال تعالى \"سابقوا إلى مغفرة من ربكم وجنة عرضها كعرض السماء والأرض\" والمراد جنس السماء والأرض كما قال تعالى في الآية الأخرى \"وسارعوا إلى مغفرة من ربكم وجنة عرضها السموات والأرض أعدت للمتقين\" وقال ههنا \"أعدت للذين آمنوا بالله ورسله ذلك فضل الله يؤتيه من يشاء والله ذو الفضل العظيم\" أي هذا الذي أهلهم الله له هو من فضله ومنه عليهم وإحسانه إليهم كما قدمنا في الصحيح أن فقراء المهاجرين قالوا يا رسول الله ذهب أهل الدثور بالأجور والدرجات العلى والنعيم المقيم قال \"وما ذاك ؟\" قالوا يصلون كما نصلي ويصومون كما نصوم ويتصدقون ولا نتصدق ويعتقون ولا نعتق قال \"أفلا أدلكم على شيء إذا فعلتموه سبقتم من بعدكم ولا يكون أحد أفضل منكم إلا من صنع مثل ما صنعتم؟\" تسبحون وتكبرون وتحمدون دبر كل صلاة ثلاثة وثلاثين\" قال فرجعوا فقالوا سمع إخواننا أهل الأموال ما فعلنا ففعلوا مثله فقال رسول الله صلى الله عليه وسلم \"ذلك فضل الله يؤتيه من يشاء\"."
    },
    {
      "ayah": 22,
      "surah": 57,
      "text": "يخبر تعالى عن قدره السابق في خلقه قبل أن يبرأ البرية فقال \"ما أصاب من مصيبة في الأرض ولا في أنفسكم\" أي في الآفاق وفي نفوسكم\" إلا في كتاب من قبل أن نبرأها\" أى من قبل أن نخلق الخليقه ونبرأ النسمة وقال بعضهم\" من قبل أن نبرأها \" عائد على النفوس وقيل عائد على المصيبة والأحسن عوده على الخليقة والبرية لدلالة الكلام عليها. كما قال ابن جرير حدثني يعقوب حدثنا ابن علية عن منصور بن عبدالرحمن قال كنت جالسا مع الحسن فقال رجل سله عن قوله تعالى \"ما أصاب من مصيبة في الأرض ولا في أنفسكم إلا في كتاب من قبل أن نبرأها\" فسألته عنها فقال سبحان الله ومن يشك في هذا؟ كل مصيبة بين السماء والأرض ففي كتاب الله من قبل أن يبرأ النسمة وقال قتادة:\"ما أصاب من مصيبة في الأرض\" قال هي السنون يعني الجدب \"ولا في أنفسكم\" يقول الأوجاع والأمراض قال وبلغنا أنه ليس أحد يصيبه خدش عود ولا نكبة قدم ولا خلجان عرق إلا بذنب وما يعفو الله عنه أكثر. وهذه الآية الكريمة العظيمة من أدل دليل على القدرية نفاة العلم السابق - قبحهم الله - وقال الإمام أحمد حدثنا أبو عبدالرحمن حدثنا حيوة وابن لهيعة قالا أخبرنا أبو هانىء الخولاني أنه سمع أبا عبدالرحمن الحبلي يقول: سمعت عبدالله بن عمرو بن العاص يقول: سمعت رسول الله صلى الله عليه وسلم يقول \"قدر الله المقادير قبل أن يخلق السموات والأرض بخمسين ألف سنة\" ورواه مسلم في صحيحه من حديث عبدالله بن وهب وحيوة بن شريح ونافع بن زيد وثلاثتهم عن أبي هانىء به وزاد ابن وهب \"وكان عرشه على الماء\" ورواه الترمذي وقال حسن صحيح. وقوله تعالى\"إن ذلك على الله يسير\" أي أن علمه تعالى الأشياء قبل كونها وكتابته لها طبق ما يوجد في حينها سهل على الله عز وجل لأنه يعلم ما كان وما يكون وما لم يكن لو كان كيف كان يكون."
    },
    {
      "ayah": 23,
      "surah": 57,
      "text": "وقوله تعالى\" لكيلا تأسوا على ما فاتكم ولا تفرحوا بما آتاكم\" أي أعلمناكم بتقدم علمنا وسبق كتابتنا للأشياء قبل كونها وتقديرنا الكائنات قبل وجودها لتعلموا أن ما أصابكم لم يكن ليخطئكم وما أخطأكم لم يكن ليصيبكم فلا تأسوا على ما فاتكم لأنه لو قدر شيء لكان \"ولا تفرحوا بما آتاكم\" أي جاءكم وتفسير\" آتاكم\" أي أعطاكم وكلاهما متلازم أي لا تفخروا على الناس بما أنعم الله به عليكم فإن ذلك ليس بسعيكم ولا كدكم وإنما هو عن قدر الله ورزقه لكم فلا تتخذوا نعم الله أشرا وبطرا تفخرون بها على الناس ولهذا قال تعالى \"والله لا يحب كل مختال فخور\" أي مختال في نفسه متكبر\" فخور\" أي على غيره وقال عكرمة ليس أحد إلا وهو يفرح ويحزن ولكن اجعلوا الفرح شكرا والحزن صبرا."
    },
    {
      "ayah": 24,
      "surah": 57,
      "text": "وقوله تعالى \"الذين يبخلون ويأمرون الناس بالبخل\" أي يفعلون المنكر ويحضون الناس عليه \"ومن يتول\" أي عن أمر الله وطاعته \"فإن الله هو الغني الحميد\" كما قال موسى عليه السلام \"إن تكفروا أنتم ومن في الأرض جميعا فإن الله لغني حميد\"."
    },
    {
      "ayah": 25,
      "surah": 57,
      "text": "يقول تعالى \"لقد أرسلنا رسلنا بالبينات\" أي بالمعجزات والحجج الباهرات والدلائل القاطعات \"وأنزلنا معهم الكتاب\" وهو النقل الصدق \"والميزان\" وهو العدل قاله مجاهد وقتادة وغيرهما وهو الحق الذي تشهد به العقول الصحيحة المستقيمة المخالفة للآراء السقيمة كما قال تعالى \"أفمن كان على بينة من ربه ويتلوه شاهد منه\" وقال تعالى \"فطرة الله التى فطر الناس عليها\" وقال تعالى \"والسماء رفعها ووضع الميزان\" ولهذا قال في هذه الآية \"ليقوم الناس بالقسط \" أي بالحق والعدل وهو اتباع الرسل فيما أخبروا به وطاعتهم فيما أمروا به فإن الذي جاؤوا به هو الحق الذي ليس وراءه حق كما قال \"وتمت كلمة ربك صدقا وعدلا\" أي صدقا في الإخبار وعدلا في الأوامر والنواهي ولهذا يقول المؤمنون إذا تبؤوا غرف الجنات والمنازل العاليات والسرر المصفوفات \"الحمد لله الذي هدانا لهذا وما كنا لنهتدى لولا أن هدانا الله لقد جاءت رسل ربنا بالحق\" وقوله تعالى \"وأنزلنا الحديد فيه بأس شديد\" أي وجعلنا الحديد رادعا لمن أبى الحق وعانده بعد قيام الحجة عليه ولهذا أقام رسول الله صلى الله عليه وسلم بمكة بعد النبوة ثلاث عشرة سنة توحى إليه السور المكية وكلها جدال مع المشركين وبيان وإيضاح للتوحيد وبينات ودلالات فلما قامت الحجة على من خالف شرع الله الهجرة وأمرهم بالقتال بالسيوف وضرب الرقاب والهام لمن خالف القرآن وكذب به وعانده. وقد روى الإمام أحمد وأبو داود من حديث عبدالرحمن بن ثابت بن ثوبان عن حسان بن عطية عن أبي المنيب الجرشي الشامي عن ابن عمر قال: قال رسول الله صلى الله عليه وسلم\"بعثت بالسيف بين يدي الساعة حتى يعبد الله وحده لا شريك له وجعل رزقي تحت ظل رمحي وجعل الذلة والصغار على من خالف أمري ومن تشبه بقوم فهو منهم\" ولهذا قال تعالى \"فيه بأس شديد\" يعني السلاح كالسيوف والحراب والسنان والنصال والدروع ونحوها \"ومنافع للناس\" أي في معايشهم كالسكة والفأس والقدوم والمنشار والأزميل والمجرفة والآلات التي يستعان بها في الحراثة والحياكة والطبخ والخبز وما لا قوام للناس بدونه وغير ذلك. قال علباء بن أحمد عن عكرمة أن ابن عباس قال: ثلاثة أشياء نزلت مع آدم السندان والكلبتان والميقعة يعني المطرقة. رواه ابن جرير وابن أبي حاتم وقوله تعالى \"وليعلم الله من ينصره ورسله بالغيب\" أي من نيته في حمل السلاح نصرة الله ورسوله \"إن الله قوي عزيز\" أي هو قوي عزيز ينصر من نصره من غير احتياج منه إلى الناس وإنما شرع الجهاد ليبلو بعضكم ببعض."
    },
    {
      "ayah": 26,
      "surah": 57,
      "text": "يخبر تعالى أنه منذ بعث نوحا عليه السلام لم يرسل بعده رسولا ولا نبيا إلا من ذريته وكذلك إبراهيم عليه السلام خليل الرحمن لم ينزل من السماء كتابا ولا أرسل رسولا ولا أوحى إلى بشر من بعده إلا وهو من سلالته كما قال تعالى في الآية الأخرى \"وجعلنا في ذريته النبوة والكتاب\" حتى كان آخر أنبياء بني إسرائيل عيسى ابن مريم الذي بشر من بعده بمحمد صلوات الله وسلامه عليهما."
    },
    {
      "ayah": 27,
      "surah": 57,
      "text": "ولهذا قال تعالى \"ثم قفينا على آثارهم برسلنا وقفينا بعيسى بن مريم وآتيناه الإنجيل\" وهو الكتاب الذي أوحاه الله إليه \"وجعلنا في قلوب الذين اتبعوه\" وهم الحواريون \"رأفة\" أي رقة وهي الخشية \"ورحمة\" بالخلق وقوله \"ورهبانية ابتدعوها\" أي ابتدعتها أمة النصارى \"ما كتبناها عليهم\" أي ما شرعناها وإنما هم التزموها من تلقاء أنفسهم وقوله تعالى \"إلا ابتغاء رضوان الله\" فيه قولان أحدهما أنهم قصدوا بذلك رضوان الله قال سعيد بن جبير وقتادة \"والآخر\" ما كتبنا عليهم ذلك إنما كتبنا عليهم ابتغاء رضوان الله وقوله تعالى \"فما رعوها حق رعايتها\" أي فما قاموا بما التزموه حق القيام وهذا ذم لهم من وجهين \"أحدهما\" الابتداع في دين الله ما لم يأمر به الله \"والثاني\" في عدم قيامهم بما التزموه مما زعموا أنها قربة تقربهم إلى الله عز وجل وقد قال ابن أبي حاتم حدثنا إسحاق بن أبي حمزة أبو يعقوب الرازي حدثنا السري بن عبد ربه حدثنا بكير بن معروف عن مقاتل بن حيان عن القاسم بن عبدالرحمن ابن عبدالله بن مسعود عن أبيه عن جده ابن مسعود قال: قال لي رسول الله صلى الله عليه وسلم \"يا ابن مسعود\" قلت لبيك يا رسول الله قال \"هل علمت أن بني إسرائيل افترقوا على اثنتين وسبعين فرقة؟ لم ينج منها إلا ثلاث فرق قامت بين الملوك والجبابرة بعد عيسى ابن مريم عليه السلام فدعت إلى دين الله ودين عيسى ابن مريم فقاتلت الجبابرة فقتلت فصبرت ونجت ثم قامت طائفة أخرى لم تكن لها قوة بالقتال فقامت بين الملوك والجبابرة فدعوا إلى دين الله ودين عيسى ابن مريم فقتلت وقطعت بالمناشير وحرقت بالنيران فصبرت ونجت ثم قامت طائفة أخرى لم يكن لها قوة بالقتال ولم تطق القيام بالقسط فلحقت بالجبال فتعبدت وترهبت وهم الذين ذكر الله تعالى \"ورهبانبة ابتدعوها ما كتبناها عليهم\" وقد رواه ابن جرير بلفظ آخر من طريق أخر فقال حدثنا يحيى بن أبي طالب حدثنا داود بن المحبر حدثنا الصعق ابن حزن حدثنا عقيل الجعدي عن أبي إسحاق الهمداني عن سويد بن غفلة عن عبدالله بن مسعود قال: قال رسول الله صلى الله عليه وسلم \"اختلف من كان قبلنا على ثلاث وسبعين فرقة نجا منهم ثلاث وهلك سائرهم\" وذكر نحو ما تقدم وفيه \"فآتينا الذين أمنوا منهم أجرهم\" هم الذين آمنوا بي وصدقوني \"وكثير منهم فاسقون\" وهم الذين كذبوني وخالفوني ولا يقدح في هذه المتابعة لحال داود بن المحبر فإنه أحد الوضاعين للحديث ولكن قد أسنده أبو يعلى عن شيبان بن فروخ عن الصعق بن حزن به مثل ذلك فقوي الحديث من هذا الوجه وقال ابن جرير وأبو عبدالرحمن النسائي واللفظ له أخبرنا الحسين بن حريث حدثنا الفضل بن موسى عن سفيان بن سعيد عن عطاء ابن السائب عن سعيد بن جبير عن ابن عباس رضي الله عنهما قال كان ملوك بعد عيسى عليه السلام بدلت التوراة والإنجيل فكان منهم مؤمنون يقرءون التوراة والإنجيل فقيل لملوكهم ما نجد شيئا أشد من شتم يشتموناه هؤلاء إنهم يقرءون \"ومن لم يحكم بما أنزل الله فأولئك هم الكافرون\" هذه الآيات مع ما يعيبوننا به من أعمالنا في قراءتهم فادعهم فليقرأوا كما نقرأ وليؤمنوا كما آمنا فدعاهم فجمعهم وعرض عليهم القتل أو يتركوا قراءة التوراة والإنجيل إلا ما بدلوا منها فقالوا ما تريدون إلى ذلك دعونا فقالت طائفة منهم ابنوا لنا أسطوانة ثم ارفعونا إليها ثم أعطونا شيئا نرفع به طعامنا وشرابنا فلا نرد عليكم وقالت طائفة دعونا نسيح في الأرض ونهيم ونشرب كما يشرب الوحش فإن قدرتم علينا في أرضكم فاقتلونا وقالت طائفة ابنوا لنا دورا في الفيافي ونحتفر الآبار ونحرث البقول فلا نرد عليكم ولا نمر بكم وليس أحد من القبائل إلا له حميم فيهم ففعلوا ذلك فأنزل الله تعالى \"ورهبانية ابتدعوها ما كتبناها عليهم إلا ابتغاء رضوان الله فما رعوها حق رعايتها\" والآخرون قالوا نتعبد كما تعبد فلان ونسيح كما ساح فلان ونتخذ دورا كما اتخذ فلان وهم على شركهم لا علم لهم بإيمان الذين اقتدوا بها فلما بعث الله النبي صلى الله عليه وسلم ولم يبق منهم إلا القليل انحط منهم رجل من صومعته وجاء سائح من سياحته وصاحب الدير من ديره فآمنوا به وصدقوه فقال الله عز وجل \"يا أيها الذين آمنوا اتقوا الله وآمنوا برسوله يؤتكم كفلين من رحمته\" أجرين بإيمانهم بعيسى بن مريم ونصب أنفسهم والتوارة والإنجيل وبإيمانهم بمحمد صلى الله عليه وسلم وتصديقهم قال \" ويجعل لكم نورا تمشون به\" القرآن واتباعهم النبي صلى الله عليه وسلم قال \"لئلا يعلم أهل الكتاب\" الذين يتشبهون بكم \"أن لا يقدرون على شيء من فضل الله وأن الفضل بيد الله يؤتيه من يشاء والله ذو الفضل العظيم\" هذا السياق فيه غرابة وسيأتي تفسير هاتين الآيتين الأخيرتين على غير هذا والله أعلم. وقال الحافظ أبو يعلى الموصلي حدثنا أحمد بن عيسى حدثنا عبدالله بن وهب حدثني سعيد بن عبدالرحمن بن أبي العمياء أن سهل بن أبي أمامة حدثه أنه دخل هو وأبوه على أبي بن مالك بالمدينة زمان عمر بن عبدالعزيز وهو أمير وهو يصلي صلاة خفيفة وقعة كأنها صلاة مسافر أو قريبا منها فلما سلم قال يرحمك الله أرأيت هذه الصلاة المكتوبة أم شيء تنفلته؟ قال إنها المكتوبة وإنها صلاة رسول الله صلى الله عليه وسلم ما أخطأت إلا شيئا سهوت عنه إن رسول الله صلى الله عليه وسلم كان يقول \"لا تشددوا على أنفسكم فيشدد الله عليكم فإن قوما شددوا على أنفسهم فشدد الله عليهم فتلك بقاياهم في الصوامع والديارات رهبانية ابتدعوها ما كتبناها عليهم\" ثم غدوا من الغد فقالوا نركب فننظر ونعتبر قال نعم فركبوا جميعا فإذا هم بديار قفر قد باد أهلها وانقرضوا وفنوا خاوية على عروشها فقالوا أتعرف هذه الديار؟ قال ما أعرفني بها وبأهلها هؤلاء أهل الديار أهلكهم البغي والحسد إن الحسد يطفىء نور الحسنات والبغي يصدق ذلك أو يكذبه والعين تزنى والكف والقدم والجسد واللسان والفرج يصدق ذلك أو يكذبه وقال الإمام أحمد حدثنا معمر حدثنا عبدالله أخبرنا سفيان عن زيد العمي عن أبي إياس عن أنس بن مالك أن النبي صلى الله عليه وسلم قال \"لكل نبي رهبانية ورهبانية هذه الأمة الجهاد في سبيل الله عز وجل\" ورواه الحافظ أبو يعلى عن عبدالله بن محمد بن أسماء عن عبدالله بن المبارك به ولفظه \"لكل أمة رهبانية ورهبانية هذه الأمة الجهاد في سبيل الله\". وقال الإمام أحمد حدثنا حسين - هو ابن محمد- حدثنا عياش يعني إسماعيل عن الحجاج بن هارون الكلاعي وعقيل بن مدرك السلمي عن أبي سعيد الخدري رضي الله عنه أن رجلا جاءه فقال أوصني فقال سألت عما سألت عنه رسول الله صلى الله عليه وسلم من قبلك أوصيك بتقوى الله فإنه رأس كل شيء وعليك بالجهاد فإنه رهبانية الإسلام وعليك بذكر الله وتلاوة القرآن فإنه روحك في السماء وذكرك في الأرض. تفرد به أحمد والله تعالى أعلم."
    },
    {
      "ayah": 28,
      "surah": 57,
      "text": "قد تقدم في رواية النسائي عن ابن عباس أنه حمل هذه الآية على مؤمني أهل الكتاب وأنهم يؤتون أجرهم مرتين كما في الآية التي في القصص وكما في حديث الشعبي عن أبي بردة عن أبيه عن أبي موسى الأشعري قال: قال رسول الله صلى الله عليه وسلم \"ثلاثة يؤتون أجرهم مرتين: رجل من أهل الكتاب آمن بنبيه وآمن بي فله أجران وعبد مملوك أدى حق الله وحق مواليه فله أجران ورجل أدب أمته فأحسن تأديبها ثم أعتقها وتزوجها فله أجران\" أخرجه في الصحيحين ووافق ابن عباس على هذا التفسير الضحاك وعتبة بن أبي حكيم وغيرهما وهو اختيار ابن جرير وقال سعيد بن جبير لما افتخر أهل الكتاب بأنهم يؤتون أجرهم مرتين أنزل الله تعالى عليه هذه الآية في حق هذه الأمة \"يا أيها الذين آمنوا اتقوا الله وآمنوا برسوله يؤتكم كفلين\" أي ضعفين \"من رحمته\" وزادهم \"ويجعل لكم نورا تمشون به\" يعني هدى يتبصر به من العمى والجهالة ويغفر لكم ففضلهم بالنور والمغفرة رواه ابن جرير عنه وهذه الآية كقوله تعالى \"يا أيها الذين أمنوا إن تتقوا الله يجعل لكم فرقانا ويكفر عنكم سيئاتكم ويغفر لكم والله ذو الفضل العظيم\" وقال سعيد بن عبدالعزيز سأل عمر بن الخطاب حبرا من أحبار يهود أفضل ما ضعف لكم حسنة قال كفل ثلاثمائة وخمسين حسنة قال فحمد الله عمر على أنه أعطانا كفلين ثم ذكر سعيد قول الله عز وجل \"يؤتكم كفلين من رحمته\" قال سعيد: والكفلان في الجمعة مثل ذلك رواه ابن جرير ومما يؤيد هذا القول ما رواه الإمام أحمد حدثنا إسماعيل حدثنا أيوب عن نافع عن ابن عمر قال: قال رسول الله صلى الله عليه وسلم \"مثلكم ومثل اليهود والنصارى كمثل رجل استعمل عمالا فقال من يعمل لي من صلاة الصبح إلى نصف النهار على قيراط قيراط؟ ألا فعملت اليهود ثم قال من يعمل لي من صلاة الظهر إلى صلاة العصر على قيراط؟ قيراط ؟ ألا فعملت النصارى ثم قال من يعمل لي من صلاة العصر إلى غروب الشمس على قيراطين قيراطين؟ ألا فأنتم الذين عملتم فغضبت النصارى واليهود وقالوا نحن أكثر عملا وأقل عطاء قال هل ظلمتكم من أجركم شيئا؟ قالوا لا قال فإنما هو فضلي أوتيه من أشاء\" قال أحمد وحدثناه مؤمل عن سفيان عن عبدالله بن دينار عن ابن عمر نحو حديث نافع عنه انفرد بإخراجه البخاري فرواه عن سليمان بن حرب عن حماد عن نافع به وعن قتيبة عن الليث عن نافع بمثله وقال البخاري حدثنا محمد بن العلاء حدثنا أبو أسامة عن يزيد عن أبي بردة عن أبي موسى عن النبي صلى الله عليه وسلم قال\" مثل المسلمين واليهود والنصارى كمثل رجل استعمل قوما يعملون له عملا يوما إلى الليل على أجر معلوم فعملوا إلى نصف النهار فقالوا لا حاجة لنا فى أجرك الذي شرطت لنا وما عملنا باطل فقال لهم لا تفعلوا أكملوا بقية عملكم وخذوا أجركم كاملا فأبوا وتركوا واستأجر آخرين بعدهم فقال أكملوا بقية يومكم ولكم الذي شرطت لهم من الأجر فعملوا حتى إذا كان حين صلوا العصر قالوا ما عملنا باطل ولك الأجر الذي جعلت لنا فيه فقال أكملوا بقية عملكم فإنما بقي من النهار يسيرا فأبوا فاستأجر قوما أن يعملوا له بقية يومهم فعملوا بقية يومهم حتى غابت الشمس فاستكملوا أجر الفريقين كليهما فذلك مثلهم ومثل ما قبلوا من هذا النور\" انفرد به البخاري."
    },
    {
      "ayah": 29,
      "surah": 57,
      "text": "قال الله تعالى \"لئلا يعلم أهل الكتاب ألا يقدرون على شىء من فضل الله\" أي ليتحققوا أنهم لا يقدرون على رد ما أعطاه الله ولا إعطاء ما منع الله \"وأن الفضل بيد الله يؤتيه من يشاء والله ذو الفضل العظيم\" قال ابن جرير \"لئلا يعلم أهل الكتاب\" أي ليعلم وقد ذكر عن ابن مسعود أنه قرأها لكي يعلم وكذا عطاء بن عبدالله وسعيد بن جبير قال ابن جرير: لأن العرب تجعل لا صلة في كل كلام دخل في أوله وآخره جحد غير مصرح فالسابق كقوله \"ما منعك ألا تسجد\" \"وما يشعركم أنها إذا جاءت لا يؤمنون\" بالله \"وحرام على قرية أهلكناها أنهم لا يرجعون\". آخر تفسير سورة الحديد ولله الحمد والمنة."
    },
    {
      "ayah": 3,
      "surah": 57,
      "text": "وهذه الآية هي المشار إليها في حديث عرباض بن سارية أنها أفضل من ألف آية. وقال أبو داود حدثنا عباس بن عبدالعظيم حدثنا النضر بن محمد حدثنا عكرمة- يعني ابن عمار- حدثنا أبو زميل قال سألت ابن عباس فقلت ما شيء أجده في صدري؟ قال ما هو؟ قلت والله لا أتكلم به قال: فقال لي أشيء من شك؟ قال وضحك قال ما نجا من ذلك أحد قال حتى أنزل الله تعالى\"فإن كنت في شك مما أنزلنا إليك فاسأل الذين يقرءون الكتاب من قبلك لقد جاءك الحق من ربك\" الآية قال وقال لي إذا وجدت في نفسك شيئا فقل \"هو الأول والآخر والظاهر والباطن وهو بكل شيء عليم\" وقد اختلفت عبارات المفسرين في هذه الآية وأقوالهم على نحو من بضعة عشر قولا. وقال البخاري قال يحيى: الظاهر على كل شيء علما والباطن على كل شيء علما وقال شيخنا الحافظ المزي يحيى هذا هو ابن زياد الفراء له كتاب سماه معاني القرآن.وقد ورد في ذلك أحاديث فمن ذلك ما قال الإمام أحمد حدثنا خلف بن الوليد حدثنا ابن عياش عن سهيل بن أبي صالح عن أبيه عن أبي هريرة أن رسول الله صلى الله عليه وسلم كان يدعو عند النوم \"اللهم رب السماوات السبع ورب العرش العظيم ربنا ورب كل شيء منزل التوراة والإنجيل والفرقان فالق الحب والنوى لا إله إلا أنت أعوذ بك من شر كل شيء أنت آخذ بناصيته أنت الأول فليس قبلك شيء وأنت الآخر فليس بعدك شيء وأنت الظاهر فليس فوقك شيء وأنت الباطن ليس دونك شيء اقض عنا الدين وأغننا من الفقر\" ورواه مسلم في صحيحه حدثني زهير بن حرب حدثنا جرير عن سهل قال كان أبو صالح يأمرنا إذا أراد أحدنا أن ينام أن يضطجع على شقه الأيمن ثم يقول: اللهم رب السماوات ورب الأرض ورب العرش العظيم ربنا ورب كل شيء فالق الحب والنوى ومنزل التوراة والإنجيل والفرقان أعوذ بك من شر كل ذي شر أنت آخذ بناصيته اللهم أنت الأول فليس قبلك شيء وأنت الآخر فليس بعدك شيء وأنت الظاهر فليس فوقك شيء وأنت الباطن فليس دونك شيء اقض عنا الدين وأغننا من الفقر. وكان يروى ذلك عن أبي هريرة عن النبي صلى الله عليه وسلم وقد روى الحافظ أبو يعلى الموصلي في مسنده عن عائشة أم المؤمنين نحو هذا فقال حدثنا عقبة حدثنا يونس حدثنا السري بن إسماعيل عن الشعبي عن مسروق عن عائشة أنها قالت كان رسول الله صلى الله عليه وسلم يأمر بفراشه فيفرش له مستفبل القبلة فإذا أوى إليه توسد كفه اليمنى ثم همس ما يدرى ما يقول فإذا كان في آخر الليل رفع صوته فقال: \"اللهم رب السماوات السبع ورب العرش العظيم إله كل شيء ومنزل التوراة والإنجيل والفرقان فالق الحب والنوى أعوذ بك من شر كل شيء أنت آخذ بناصيته اللهم أنت الأول الذي ليس قبلك شيء وأنت الآخر الذي ليس بعدك شىء وأنت الظاهر فليس فوقك شيء وأنت الباطن فليس دونك شيء اقض عنا الدين وأغننا من الفقر\". السري بن إسماعيل هذا هو ابن عم الشعبي وهو ضعيف جدا والله أعلم. وقال أبو عيسى الترمذي عند تفسير هذه الآية حدثنا عبد بن حميد وغير واحد المعنى واحد قالوا حدثنا يونس بن محمد حدثنا شيبان بن عبدالرحمن عن قتادة قال حدث الحسن عن أبي هريرة قال بينما نبي الله صلى الله عليه وسلم جالس وأصحابه إذ أتى عليهم سحاب فقال نبي الله صلى الله عليه وسلم \" هل تدرون ما هذا \" قالوا الله ورسوله أعلم قال \"هذا العنان هذه روايا الأرض تسوقه إلى قوم لا يشكرونه ولا يدعونه - ثم قال - هل تدرون ما فوقكم ؟ قالوا الله ورسوله أعلم قال \"فإنها الرفيع سقف محفوظ وموج مكفوف - ثم قال - هل تدرون كم بينكم وبينها ؟ قالوا الله ورسوله أعلم قال بينكم وبينها خمسمائة سنة - ثم قال - هل تدرون ما فوق ذلك ؟ قالوا الله ورسوله أعلم قال \"فإن فوق ذلك سماء بعد ما بينهما مسيرة خمسمائة سنة - حتى عد سبع سماوات - ما بين كل سماءين كما بين السماء والأرض - ثم قال - هل تدرون ما فوق ذلك ؟ قالوا الله ورسوله أعلم؟ قال \"فإن فوق ذلك العرش وبينه وبين السماء مثل بعد ما بين السماءين - ثم قال - هل تدرون ما الذي تحتكم؟ قالوا الله ورسوله أعلم قال \"فإنها الأرض - ثم قال - هل تدرون ما الذي تحت ذلك ؟ قالوا الله ورسوله أعلم قال فإن تحتها أرضا أخرى بينهما مسيرة خمسمائة سنة - حتى عد سبع أرضين - بين كل أرضين مسيرة خمسمائة سنة - ثم قال - والذي نفس محمد بيده لو أنكم دليتم حبلا إلى الأرض السفلى لهبط على الله - ثم قرأ - \"هو الأول والآخر والظاهر والباطن وهو بكل شيء عليم\" ثم قال الترمذي هذا حديث غريب من هذا الوجه ويروى عن أيوب ويونس يعني ابن عبيد وعلي بن زيد قالوا لم يسمع الحسن من أبي هريرة وفسر بعض أهل العلم هذا الحديث فقالوا إنما هبط على علم الله وقدرته وسلطانه وعلم الله وقدرته وسلطانه في كل مكان وهو على العرش كما وصف في كتابه انتهى كلامه وقد روى الإمام أحمد هذا الحديث عن شريح عن الحكم بن عبد الملك عن قتادة عن الحسن عن أبي هريرة عن النبي صلى الله عليه وسلم فذكره وعنده وبعد ما بين الأرضين مسيرة سبعمائة عام وقال \"لو دليتم أحدكم بحبل إلى الأرض السفلى السابعة لهبط علي الله ثم قرأ - \"هو الأول والآخر والظاهر والباطن وهو بكل شيء عليم\" ورواه ابن أبي حاتم والبزار من حديث أبي جعفر الرازي عن قتادة عن الحسن عن أبي هريرة فذكر الحديث ولم يذكر ابن أبي حاتم آخره وهو قوله: \"لو دليتم بحبل\" وإنما قال حتى عد سبع أرضين بين كل أرضين مسيرة خمسمائة عام ثم تلا \"هو الأول والآخر والظاهر والباطن وهو بكل شيء عليم\" وقال البزار لم يروه عن النبي صلى الله عليه وسلم إلا أبو هريرة ورواه ابن جرير عن بشر عن يزيد عن سعيد عن قتادة \"هو الأول والآخر والظاهر والباطن\" ذكر لنا أن نبي الله صلى الله عليه وسلم بينما هو جالس في أصحابه إذ مر عليهم سحاب فقال: هل تدرون ما هذا. وذكر الحديث مثل سياق الترمذي سواء إلا أنه مرسل من هذا الوجه ولعل هذا هو المحفوظ والله أعلم. وقد روي من حديث أبي ذر الغفاري رضي الله عنه وأرضاه رواه البزار في مسنده والبيهقي فى كتاب الأسماء والصفات ولكن في إسناده نظر وفي متنه غرابة ونكارة والله سبحانه وتعالى أعلم. وقال ابن جرير عند قوله تعالى \"ومن الأرض مثلهن\" حدثنا ابن عبدالأعلى حدثنا ابن ثور عن معمر عن قتادة قال التقى أربعة من الملائكة بين السماء والأرض فقال بعضهم لبعض من أين جئت قال أحدهم أرسلني ربي عز وجل من السماء السابعة وتركته ثم قال الآخر أرسلني ربي عز وجل من الأرض السابعة وتركته ثم قال الآخر أرسلني ربي من المشرق وتركته ثم قال الآخر أرسلني ربي من المغرب وتركته ثم وهذا حديث غريب جدا وقد يكون الحديث الأول موقوفا على قتادة كما روي ههنا من قوله والله أعلم."
    },
    {
      "ayah": 4,
      "surah": 57,
      "text": "يخبر تعالى أنه خالق العالم سماواته وأرضه وما بين ذلك في ستة أيام كما أخبر بذلك في غير ما آية من القرآن والستة أيام هي الأحد والأثنين والثلاثاء والأربعاء والخميس والجمعة وفيه اجتمع الخلق كله وفيه خلق آدم عليه السلام واختلفوا في هذه الأيام هل كل يوم منها كهذه الأيام كما هو المتبادر إلى الأذهان أو كل يوم كألف سنة كما نص على ذلك مجاهد والإمام أحمد بن حنبل ويروى ذلك من رواية الضحاك عن ابن عباس فأما يوم السبت فلم يقع فيه خلق لأنه اليوم السابع ومنه سمي السبت وهو القطع فأما الحديث الذي رواه الإمام أحمد في مسنده حيث قال حدثنا حجاج حدثنا ابن جريج أخبرني إسماعيل بن أمية عن أيوب بن خالد عن عبدالله بن رافع مولى أم سلمة عن أبي هريرة قال: أخذ رسول الله صلى الله عليه وسلم بيدي فقال \"خلق الله التربة يوم السبت وخلق الجبال فيها يوم الأحد وخلق الشجر فيها يوم الإثنين وخلق المكروه يوم الثلاثاء وخلق النور يوم الأربعاء وبث فيها الدواب يوم الخميس وخلق آدم بعد العصر يوم الجمعة آخر الخلق في آخر ساعة من ساعات الجمعة فيما بين العصر إلى الليل \". فقد رواه مسلم بن الحجاج في صحيحه والنسائي من غير وجه عن حجاج وهو ابن محمد الأعور عن ابن جريج به وفيه استيعاب الأيام السبعة والله تعالى قد قال\" في ستة أيام\" ولهذا تكلم البخاري وغير واحد من الحفاظ في هذا الحديث وجعلوه من رواية أبي هريرة عن كعب الأحبار ليس مرفوعا والله أعلم. وأما قوله تعالى \"ثم استوى على العرش\" فللناس في هذا المقام مقالات كثيرة جدا ليس هذا موضع بسطها وإنما نسلك في هذا المقام مذهب السلف الصالح مالك والأوزاعي والثوري والليث بن سعد والشافعي وأحمد وإسحاق بن راهوية وغيرهم من أئمة المسلمين قديما وحديثا وهو إمرارها كما جاءت من غير تكييف ولا تشبيه ولا تعطيل والظاهر المتبادر إلى أذهان المشبهين منفي عن الله فإن الله لا يشبهه شيء من خلقه و\"ليس كمثله شيء وهو السميع البصير\" بل الأمر كما قال الأئمة منهم نعيم بن حماد الخزاعي شيخ البخاري قال من شبه الله بخلقه كفر ومن جحد ما وصف الله به نفسه فقد كفر وليس فيما وصف الله به نفسه ولا رسوله تشبيه فمن أثبت لله تعالى ما وردت به الآيات الصريحة والأخبار الصحيحة على الوجه الذي يليق بجلال الله ونفي عن الله تعالى النقائص فقد سلك سبيل الهدى. وقوله تعالى \"يعلم ما يلج في الأرض\" أي يعلم عدد ما يدخل فيها من حب وقطر \"وما يخرج منها\" من نبات وزرع وثمار كما قال تعالى \"وعنده مفاتح الغيب لا يعلمها إلا هو ويعلم ما في البر والبحر وما تسقط من ورقة إلا يعلمها ولا حبة في ظلمات الأرض ولا رطب ولا يابس إلا في كتاب مبين\" وقوله تعالى \"وما ينزل من السماء\" أي من الأمطار والثلوج والبرد والأقدار والأحكام مع الملائكة الكرام وقد تقدم في سورة البقرة أنه ما ينزل من قطرة من السماء إلا ومعها ملك يقررها في المكان الذي يأمر الله به حيث يشاء الله تعالى. وقوله تعالى \"وما يعرج فيها\" أي من الملائكة والأعمال كما جاء في الصحيح \"يرفع إليه عمل الليل قبل النهار وعمل النهار قبل الليل\" وقوله تعالى \"وهو معكم أينما كنتم والله بما تعملون بصير\" أي رقيب عليكم شهيد على أعمالكم حيث كنتم وأينما كنتم من بر أو بحر في ليل أو نهار في البيوت أو في القفار الجميع في علمه على السواء وتحت بصره وسمعه فيسمع كلامكم ويرى مكانكم ويعلم سركم ونجواكم كما قال تعالى \"ألا إنهم يثنون صدورهم ليستخفوا منه ألا حين يستغشون ثيابهم يعلم ما يسرون وما يعلنون إنه عليم بذات الصدور\" وقال تعالى \"سواء منكم من أسر القول ومن جهر به ومن هو مستخف بالليل وسارب بالنهار\" فلا إله غيره ولا رب سواه. وقد ثبت في الصحيح أن رسول الله صلى الله عليه وسلم قال لجبريل لما سأله عن الإحسان \" أن تعبدالله كأنك تراه فإن لم تكن تراه فإنه يراك\" وروى الحافظ أبو بكر الإسماعيلي من حديث نصر بن خزيمة بن جنادة بن محفوظ بن علقمة حدثني أبي عن نصر بن علقمة عن أخيه عن عبدالرحمن بن عامر قال: قال عمر جاء رجل إلى النبي صلى الله عليه وسلم فقال: زودني حكمة أعيش بها فقال: \"استح الله كما تستحي رجلا من صالحي عشيرتك لا يفارقك\" هذا حديث غريب.وروى أبو نعيم من حديث عبدالله بن علوية العامري مرفوعا \"ثلاث من فعلهن فقد طعم الإيمان إن عبدالله وحده وأعطى زكاة ماله طيبة بها نفسه في كل عام ولم يعط الهرمة ولا الرذية ولا الشرطة اللئيمة ولا المريضة ولكن من أوسط أموالكم وزكى نفسه\" وقال رجل يا رسول الله ما تزكية المرء نفسه فقال \"يعلم أن الله معه حيث كان\". وقال نعيم بن حماد رحمه الله حدثنا عثمان بن سعيد بن كثير بن دينار الحمصي عن محمد بن مهاجر عن عروة بن رويم عن عبدالرحمن بن غنم عن عبادة بن الصامت قال: قال رسول الله صلى الله عليه وسلم \"إن أفضل الإيمان أن تعلم أن الله معك حيثما كنت\" غريب. وكان الإمام أحمد رحمه الله تعالى ينشد هذين البيتين: إذا ما خلوت الدهر يوما فلا تقل خلوت ولكن قل عليَّ رقيب ولا تحسبن الله يغفل ساعة ولاأن ما تخفي عليه يغيب."
    },
    {
      "ayah": 5,
      "surah": 57,
      "text": "أي هو المالك للدنيا والآخرة كما قال تعالى\"وإن لنا للآخرة والأولى\" وهو المحمود على ذلك كما قال تعالى \"وهو الله لا إله إلا هو له الحمد في الأولى والآخرة\" وقال تعالى \"الحمد لله الذي له ما في السموات وما في الأرض وله الحمد في الآخرة وهو الحكيم الخبير\" فجميع ما في السماوات والأرض ملك له وأهلهما عبيد أرقاء أذلاء بين يديه كما قال تعالى \"إن كل ما في السماوات والأرض إلا آت الرحمن عبدا لقد أحصاهم وعدهم عدا وكلهم آتيه يوم القيامة فردا\" ولهذا قال \"وإلى الله ترجع الأمور\" أي إليه المرجع يوم القيامة فيحكم في خلقه بما يشاء وهو العادل الذي لا يجور ولا يظلم مثقال ذرة بل إن يكن عمل أحدهم حسنة واحدة يضاعفها إلى عشر أمثالها \"ويؤت من لدنه أجرا عظيما\" كما قال تعالى \"ونضع الموازين القسط ليوم القيامة فلا تظلم نفس شيئا وإن كان مثقال حبة من خردل أتينا بها وكفى بنا حاسبين\"."
    },
    {
      "ayah": 6,
      "surah": 57,
      "text": "أي هو المتصرف في الخلق يقلب الليل والنهار ويقدرهما بحكمته كما يشاء فتارة يطول الليل ويقصر النهار وتارة بالعكس وتارة يتركهما معتدلين وتارة يكون الفصل شتاء ثم ربيعا ثم قيظا ثم خريفا وكل ذلك بحكمته وتقديره لما يريده بخلقه \"وهوعليم بذات الصدور\" أي يعلم السرائر وإن دقت وإن خفيت."
    },
    {
      "ayah": 7,
      "surah": 57,
      "text": "أمر تبارك وتعالى بالإيمان به وبرسوله على الوجه الأكمل والدوام والثبات على ذلك والاستمرار وحث على الإنفاق مما جعلكم مستخلفين فيه أي مما هو معكم على سبيل العارية فإنه قد كان في أيدي من قبلكم ثم صار إليكم فأرشد تعالى إلى استعمال ما استخلفهم فيه من المال في طاعته فإن يفعلوا وإلا حاسبهم عليه وعاقبهم لتركهم الواجبات فيه وقوله تعالى \"مما جعلكم مستخلفين فيه\" فيه إشارة إلى أنه سيكون مخلفا عنك فلعل وارثك أن يطيع الله فيه فيكون أسعد بما أنعم الله به عليك منك أو يعصي الله فتكون قد سعيت في معاونته على الإثم والعدوان. قال الإمام أحمد حدثنا محمد بن جعفر حدثنا شعبة سمعت قتادة يحدث عن مطرف يعني ابن عبدالله بن الشخير عن أبيه قال انتهيت إلى رسول الله صلى الله عليه وسلم وهو يقول \"ألهاكم التكاثر\" يقول ابن آدم مالي مالي وهل لك من مالك إلا ما أكلت فأفنيت أو لبست فأبليت أو تصدقت فأمضيت ؟ ورواه مسلم من حديث شعبة به وزاد \"وما سوى ذلك فذاهب وتاركه للناس\" وقوله تعالى\" فالذين آمنوا منكم وأنفقوا لهم أجر كبير\" ترغيب في الإيمان والإنفاق في الطاعة."
    },
    {
      "ayah": 8,
      "surah": 57,
      "text": "أي وأي شيء يمنعكم من الإيمان والرسول بين أظهركم يدعوكم إلى ذلك ويبين لكم الحجج والبراهين على صحة ما جاءكم به وقد روى في الحديث من طرق في أوائل شرح كتاب الإيمان من صحيح البخاري أن رسول الله صلى الله عليه وسلم قال يوما لأصحابه \"أي المؤمنين أعجب إليكم إيمانا؟ - قالوا الملائكة قال - وما لهم لا يؤمنون وهم عند ربهم قالوا فالأنبياء قال - وما لهم لا يؤمنون والوحي ينزل عليهم - قالوا فنحن قال - وما لكم لا تؤمنون وأنا بين أظهركم ولكن أعجب المؤمنين إيمانا قوم يجيئون بعدكم يجدون صحفا يؤمنون بما فيها\" وقد ذكرنا طرفا من هذه في أول سورة البقرة عند قوله تعالى \"الذين يؤمنون بالغيب\" وقوله تعالى \"وقد أخذ ميثاقكم\" كما قال تعالى \"واذكروا نعمة الله عليكم وميثاقه الذي واثقكم به أذ قلتم سمعنا وأطعنا\" ويعني بذلك بيعة الرسول صلى الله عليه وسلم وزعم ابن جرير أن المراد بذلك الميثاق الذي أخذ عليهم في صلب آدم وهو مذهب مجاهد فالله أعلم."
    },
    {
      "ayah": 9,
      "surah": 57,
      "text": "قوله تعالى \"هو الذي ينزل على عبده آيات بينات\" أي حججا واضحات ودلائل باهرات - وبراهين قاطعات \"ليخرجكم من الظلمات إلى النور\" أي من ظلمات الجهل والكفر والآراء المتضادة إلى نور الهدى واليقين \"وإن الله بكم لرؤوف رحيم\" أي في إنزاله الكتب وإرساله الرسل لهداية الناس وإزاحة العلل وإزالة الشبه ولما أمرهم أولا بالإيمان والإنفاق ثم حثهم على الإيمان وبين أنه قد أزال عنهم موانعه حثهم أيضا على الإنفاق."
    }
  ]
}
