{
  "ayahs": [
    {
      "ayah": 1,
      "surah": 58,
      "text": "قال الإمام أحمد حدثنا أبو معاوية حدثنا الأعمش عن تميم بن سلمة عن عروة عن عائشة قالت: الحمد لله الذي وسع سمعه الأصوات لقد جاءت المجادلة إلى النبي صلى الله عليه وسلم تكلمه وأنا في ناحية البيت ما أسمع ما تقول فأنزل الله عز وجل \"قد سمع الله قول التي تجادلك في زوجها\" إلى آخر الآية وهكذا رواه البخاري في كتاب التوحيد تعليقا فقال وقال الأعمش عن تميم بن سلمة عن عروة عن عائشة فذكره وأخرجه النسائي وابن ماجه وابن أبي حاتم وابن جرير من غير وجه عن الأعمش به وفي رواية لابن أبي حاتم عن الأعمش عن تميم بن سلمة عن عروة عن عائشة أنها قالت: تبارك الذى أوعى سمعه كل شيء إنى لأسمع كلام خولة بنت ثعلبة ويخفى علي بعضه وهي تشتكي زوجها إلى رسول الله وهي تقول يا رسول الله أكل مالي وأفنى شبابي ونثرت له بطني حتى إذا كبرت سني وانقطع ولدي ظاهر مني اللهم إني أشكو إليك قالت فما برحت حتى نزل جبريل بهذه الآية \"قد سمع الله قول التي تجادلك في زوجها\" قالت وزوجها أوس بن الصامت وقال ابن لهيعة عن أبي الأسود عن عروة عن أوس بن الصامت وكان أوس امرءا به لمم فكان إذا أخذه لممه واشتد به يظاهر من امرأته وإذا ذهب لم يقل شيئا فأتت رسول الله صلى الله عليه وسلم تستفتيه في ذلك وتشتكي إلى الله فأنزل الله \"قد سمع الله قول التي تجادلك في زوجها وتشتكي إلى الله\" الآية وهكذا روى هشام بن عروة عن أبيه أن رجلا كان به لمم فذكر مثله. وقال ابن أبي حاتم حدثنا أبي حدثنا موسى بن إسماعيل أبو سلمة حدثنا جرير يعنى أبن حازم قال سمعت أبا يزيد يحدث قال لقيت امرأة عمر يقال لها خولة بنت ثعلبة وهو يسير مع الناس فاستوقفته فوقف لها ودنا منها وأصغى إليها رأسه ووضع يديه على منكبيها حتى قضت حاجتها وانصرفت فقال له رجل يا أمير المؤمنين حبست رجالات قريش على هذه العجوز قال ويحك وتدري من هذه ؟ قال لا قال هذه امرأة سمع الله شكواها من فوق سبع سموات هذه خولة بنت ثعلبة والله لو لم تنصرف عني إلى الليل ما انصرفت عنها حتى تقضي حاجتها إلى أن تحضر صلاة فأصليها ثم أرجع إليها حتى تقضي حاجتها. هذا منقطع بين أبي يزيد وعمر بن الخطاب وقد روي من غير هذا الوجه وقال ابن أبي حاتم أيضا حدثنا المنذر بن شاذان حدثنا يعلى حدثنا زكريا عن عامر قال: المرأة التي جادلت في زوجها خولة بنت الصامت وأمها معاذة التي أنزل الله فيها \"ولا تكرهوا فتياتكم على البغاء إن أردن تحصنا\" صوابه خولة امرأة أوس بن الصامت."
    },
    {
      "ayah": 10,
      "surah": 58,
      "text": "أي إنما النجوى وهي المسارة حيث يتوهم مؤمن بها سوءا \"من الشيطان ليحزن الذين آمنوا\" يعني إنما يصدر هذا من المتناجين عن تسويل الشيطان وتزيينه \"ليحزن الذين آمنوا\" أي ليسوءهم وليس ذلك بضارهم شيئا إلا بإذن الله ومن أحس من ذلك شيئا فليستعذ بالله وليتوكل على الله فإنه لا يضره شيء بإذن الله. وقد وردت السنة بالنهي عن التناجي حيث يكون في ذلك تأذ على مؤمن كما قال الإمام أحمد حدثنا وكيع وأبو معاوية قالا حدثنا الأعمش عن أبي وائل عن عبدالله بن مسعود قال: قال رسول الله صلى الله عليه وسلم \"إذا كنتم ثلاثة فلا يتناجى اثنان دون صاحبهما فإن ذلك يحزنه\" وأخرجاه من حديث الأعمش. وقال عبدالرزاق أخبرنا معمر عن أيوب عن نافع عن ابن عمر قال: قال رسول الله صلى الله عليه وسلم \"إذا كنتم ثلاثة فلا يتناجى اثنان دون الثالث إلا بإذنه فإن ذلك يحزنه\" انفرد بإخراجه مسلم عن أبي الربيع وأبي كامل كلاهما عن حماد بن زيد عن أيوب به."
    },
    {
      "ayah": 11,
      "surah": 58,
      "text": "يقول تعالى مؤدبا عباده المؤمنين وآمرا لهم أن يحسن بعضهم إلى بعض في المجالس \"يا أيها الذين آمنوا إذا قيل لكم تفسحوا في المجالس\" وقريء \"في المجلس\" \"فافسحوا يفسح الله لكم\" وذلك أن الجزاء من جنس العمل كما جاء في الحديث الصحيح \"من بنى لله مسجدا بنى الله له بيتا في الجنة\" وفي الحديث الآخر \"ومن يسر على معسر يسر الله عليه في الدنيا والآخرة والله في عون العبد ما كان العبد في عون أخيه\" ولهذا أشباه كثيرة ولهذا قال تعالى \"فافسحوا يفسح الله لكم\" قال قتادة نزلت هذه الآية في مجالس الذكر وذلك أنهم كانوا إذا رأوا أحدهم مقبلا ضنوا بمجالسهم عند رسول الله صلى الله عليه وسلم فأمرهم الله تعالى أن يفسح بعضهم لبعض. وقال مقاتل بن حيان أنزلت هذه الآية يوم الجمعة وكان رسول الله صلى الله عليه وسلم يومئذ فى الصفة وفى المكان ضيق وكان يكرم أهل بدر من المهاجرين والأنصار فجاء ناس من أهل بدر وقد سبقوا إلى المجالس فقاموا حيال رسول الله صلى الله عليه وسلم فقالوا السلام عليك أيها النبي ورحمة الله وبركاته فرد النبى صلى الله عليه وسلم عليهم ثم سلموا إلى القوم بعد ذلك فردوا عليهم فقاموا على أرجلهم ينتظرون أن يوسع لهم فعرف النبي صلى الله عليه وسلم ما يحملهم على القيام فلم يفسح لهم فشق ذلك على النبي صلى الله عليه وسلم فقال لمن حوله من المهاجرين والأنصار من غير أهل بدر \"قم يا فلان وأنت يا فلان\" فلم يزل يقيمهم بعدة النفر الذين هم قيام بين يديه من المهاجرين والأنصار من أهل بدر فشق ذلك على من أقيم من مجلسه وعرف النبي صلى الله عليه وسلم الكراهة في وجوههم فقال المنافقون ألستم تزعمون أن صاحبكم هذا يعدل بين الناس ؟ والله ما رأيناه قبل عدل على هؤلاء إن قوما أخذوا مجالسهم وأحبوا القرب من نبيهم فاقامهم وأجلس من أبطأ عنه فبلغنا أن رسول الله صلى الله عليه وسلم قال \"رحم الله رجلا يفسح لأخيه\" فجعلوا يقومون بعد ذلك سراعا فيفسح القوم لإخوانهم ونزلت هذه الآية يوم الجمعة. رواه ابن أبي حاتم وقد قال الإمام أحمد والشافعي حدثنا سفيان عن أيوب عن نافع عن ابن عمر أن رسول الله صلى الله عليه وسلم قال \"لا يقيم الرجل الرجل من مجلسه فيجلس فيه ولكن تفسحوا وتوسعوا\" وأخرجاه في الصحيحين من حديث نافع به. وقال الشافعي أخبرنا عبدالمجيد عن ابن جريج قال: قال سليمان بن موسى عن جابر عن عبدالله أن رسول الله صلى الله عليه وسلم قال \"لا يقيمن أحدكم أخاه يوم الجمعة ولكن ليقل افسحوا\" على شرط السنن ولم يخرجوه. وقال الإمام أحمد حدثنا عبدالملك بن عمرو حدثنا فليح عن أيوب عن عبدالرحمن بن صعصعة عن يعقوب بن أبي يعقوب عن أبي هريرة عن النبي صلى الله عليه وسلم قال \"لا يقيم الرجل الرجل من مجلسه ثم يجلس فيه ولكن افسحوا يفسح الله لكم\" ورواه أيضا عن شريح بن يونس ويونس بن محمد المؤدب عن فليح به ولفظه \"لا يقوم الرجل للرجل من مجلسه ولكن افسحوا يفسح الله لكم\" تفرد به أحمد. وقد اختلف الفقهاء في جواز القيام للوارد إذا جاء على أقوال: فمنهم من رخص في ذلك محتجا بحديث \"قوموا إلى سيدكم\" ومنهم من منع من ذلك محتجا بحديث \"من أحب أن يتمثل له الرجال قياما فليتبوأ مقعده من النار\" ومنهم من فصل فقال يجوز عند القدوم من سفر وللحاكم في محل ولايته كما دل عليه قصة سعد بن معاذ فإنه لما استقدمه النبي صلى الله عليه وسلم حاكما في بني قريظة فرآه مقبلا قال للمسلمين \"قوموا إلى سيدكم\" وما ذاك إلا ليكون أنفذ لحكمه والله أعلم. فأما اتخاذه ديدنا فإنه من شعار العجم وقد جاء في السنن أنه لم يكن شخص أحب إليهم من رسول الله صلى الله عليه وسلم وكان إذا جاء لا يقومون له لما يعلمون من كراهته لذلك. وفي الحديث المروي في السنن أن رسول الله صلى الله عليه وسلم كان يجلس حيث انتهى به المجلس ولكن حيث يجلس يكون صدر ذلك المجلس فكان الصحابة رضي الله عنهم يجلسون منه على مراتبهم فالصديق رضي الله عنه يجلسه عن يمينه وعمر عن يساره وبين يديه غالبا عثمان وعلي لأنهما كانا ممن يكتب الوحي وكان يأمرهما بذلك كما رواه مسلم من حديث الأعمش عن عمارة بن عمير عن أبي معمر عن أبي مسعود أن رسول الله صلى الله عليه وسلم كان يقول: \"ليليني منكم أولوا الأحلام والنهى ثم الذين يلونهم ثم الذين يلونهم\" وما ذاك إلا ليعقلوا عنه ما يقوله صلوات الله وسلامه عليه ولهذا أمر أولئك النفر بالقيام ليجلس الذين وردوا من أهل بدر إما لتقصير أولئك في حق البدريين أو ليأخذ البدريون من العلم نصيبهم كما أخذ أولئك قبلهم أو تعليما بتقديم الأفاضل إلى الأمام وقال الإمام أحمد حدثنا وكيع عن الأعمش عن عمارة بن عمير الليثي عن أبي معمر عن أبي مسعود قال كان رسول الله صلى الله عليه وسلم يمسح مناكبنا في الصلاة ويقول \"استووا ولا تختلفوا فتختلف قلوبكم ليليني منكم أولوا الأحلام والنهى ثم الذين يلونهم ثم الذين يلونهم\" قال أبو مسعود فأنتم اليوم أشد اختلافا. وكذا رواه مسلم وأهل السنن إلا الترمذي من طرق عن الأعمش به وإذا كان هذا أمره لهم في الصلاة أن يليه العقلاء منهم والعلماء فبطريق الأولى أن يكون ذلك في غير الصلاة. وروى أبو داود من حديث معاوية بن صالح عن أبي الزاهرية عن كثير بن مرة عن عبدالله بن عمر أن رسول الله صلى الله عليه وسلم قال: \"أقيموا الصفوف وحاذوا بين المناكب وسدوا الخلل ولينوا بأيدي إخوانكم ولا تذروا فرجات للشيطان ومن وصل صفا وصله الله ومن قطع صفا قطعه الله\" ولهذا كان أبى بن كعب سيد القراء إذا انتهى إلى الصف الأول انتزع منه رجلا يكون من أفناد الناس ويدخل هو في الصف المقدم ويحتج بهذا الحديث \"ليليني منكم أولوا الأحلام والنهى\" وأما عبدالله بن عمر فكان لا يجلس في المكان الذي يقوم له صاحبه عنه عملا بمقتضى ما تقدم من روايته الحديث الذي أوردناه ولنقتصر على هذا المقدار من الأنموذج المتعلق بهذه الآية وإلا فبسطه يحتاج إلى غير هذا الموضع وفي الحديث الصحيح\" بينا رسول الله صلى الله عليه وسلم جالس إذ أقبل ثلاثة نفر فأما أحدهم فوجد فرجة في الحلقة فدخل فيها وأما الآخر فجلس وراء الناس وأدبر الثالث ذاهبا فقال رسول الله صلى الله عليه وسلم \"ألا أنبئكم بخبر الثلاثة ؟ أما الأول فآوى إلى الله فآواه الله وأما الثانى فاستحيا فاستحيا الله منه وأما الثالث فأعرض فأعرض الله عنه\" وقال الإمام أحمد حدثنا عتاب بن زياد أخبرنا عبدالله أخبرنا أسامة بن زيد عن عمرو بن شعيب عن أبيه عن عبدالله بن عمرو أن رسول الله صلى الله عليه وسلم قال \"لا يحل لرجل أن يفرق بين اثنين إلا بإذنهما\" ورواه أبو داود والترمذي من حديث أسامة بن زيد الليثي به وحسنه الترمذي وقد روي عن ابن عباس والحسن البصري وغيرهما أنهم قالوا في قوله تعالى \"إذا قيل لكم تفسحوا في المجالس فافسحوا يفسح الله لكم\" يعني في مجالس الحرب قالوا ومعنى قوله \"وإذا قيل انشزوا فانشزوا\" أي انهضوا للقتال وقال قتادة \"وإذا قيل انشزوا فانشزوا\" أي إذا دعيتم إلى خير فأجيبوا وقال مقاتل إذا دعيتم إلى الصلاة فارتفعوا إليها وقال عبدالرحمن بن زيد بن أسلم كانوا إذا كانوا عند النبي صلى الله عليه وسلم في بيته فأرادوا الانصراف أحب كل منهم أن يكون هو آخرهم خروجا من عنده فربما يشق ذلك عليه عليه السلام وقد تكون له الحاجة فأمروا أنهم إذا أمروا بالانصراف أن ينصرفوا كقوله تعالى \"وإن قيل لكم ارجعوا فارجعوا\" وقوله تعالى \"يرفع الله الذين آمنوا منكم والذين أوتوا العلم درجات والله بما تعملون خبير\" أي لا تعتقدوا أنه إذا أفسح أحد منكم لأخيه إذا أقبل أو إذا أمر بالخروج فخرح أن يكون ذلك نقصا في حقه بل هو رفعة ورتبة عند الله والله تعالى لا يضيع ذلك له بل يجزيه بها في الدنيا والآخرة فإن من تواضع لأمر الله رفع الله قدره ونشر ذكره ولهذا قال تعالى \"يرفع الله الذين آمنوا منكم والذين أوتوا العلم درجات والله بما تعملون خبير\" أي خبير بمن يستحق ذلك وبمن لا يستحقه قال الإمام أحمد حدثنا أبو كامل حدثنا إبراهيم حدثنا ابن شهاب عن أبي الطفيل عامر بن واثلة أن نافع بن عبدالحارث لقي عمر بن الخطاب بعسفان وكان عمر استعمله على مكة فقال له عمر من استخلفت على أهل الوادى ؟ قال استخلفت عليهم ابن أبزي رجل من موالينا فقال عمر استخلفت عليهم مولى ؟ فقال يا أمير المؤمنين إنه قارىء لكتاب الله عالم بالفرائض قاص فقال عمر رضي الله عنه أما إن نبيكم صلى الله عليه وسلم قد قال \"إن الله يرفع بهذا الكتاب قوما ويضع به آخرين. وهكذا رواه مسلم من غير وجه عن الزهري به وروي من غير وجه عن عمر بنحوه وقد ذكرت فضل العلم وأهله وما ورد في ذلك من الأحاديث مستقصاة في شرح كتاب العلم من صحيح البخاري ولله الحمد والمنة."
    },
    {
      "ayah": 12,
      "surah": 58,
      "text": "يقول تعالى آمرا عباده المؤمنين إذا أراد أحدهم أن يناجي رسول الله صلى الله عليه وسلم أي يساره فيما بينه وبينه أن يقدم بين يدي ذلك صدقة تطهره وتزكيه وتؤهله لأن يصلح لهذا المقام ولهذا قال تعالى \"ذلك خير لكم وأطهر\" ثم قال تعالى \"فإن لم تجدوا\" أي إلا من عجز عن ذلك لفقره \"فإن الله غفور رحيم\" فما أمر إلا من قدر عليها."
    },
    {
      "ayah": 13,
      "surah": 58,
      "text": "قال تعالى \"أأشفقتم أن تقدموا بين يدي نجواكم صدقات\" أي أخفتم من استمرار هذا الحكم عليكم من وجوب الصدقة قبل مناجاة الرسول \"فإذا لم تفعلوا وتاب الله عليكم فأقيموا الصلاة وآتوا الزكاة وأطيعوا الله ورسوله والله خبير بما تعملون\" فنسخ وجوب ذلك عنهم وقد قيل إنه لم يعمل بهذه الآية قبل نسخها سوى علي بن أبي طالب رضي الله عنه قال ابن أبي نجيح عن مجاهد قال نهوا عن مناجاة النبي صلى الله عليه وسلم حتى يتصدقوا فلم يناجه إلا علي بن أبي طالب قدم دينارا صدقة تصدق به ثم ناجى النبي صلى الله عليه وسلم فسأله عن عشر خصال ثم أنزلت الرخصة وقال ليث بن أبي سليم عن مجاهد قال علي رضي الله عنه: آية في كتاب الله عز وجل لم يعمل بها أحد قبلي ولا يعمل بها أحد بعدي كان عندي دينار فصرفته بعشرة دراهم فكنت إذا ناجيت رسول الله صلى الله عليه وسلم تصدقت بدرهم فنسخت ولم يعمل بها أحد قبلي ولا يعمل بها أحد بعدى ثم تلا هذه الآية \"يا أيها الذين آمنوا إذا ناجيتم الرسول فقدموا بين يدي نجواكم صدقة\" الآية. وقال ابن جرير حدثنا ابن حميد حدثنا مهران عن سفيان عن عثمان بن المغيرة عن سالم بن أبي الجعد عن علي بن علقمة الأنماري عن علي رضي الله عنه قال: قال النبي صلى الله عليه وسلم ما ترى دينار ؟\" قال لا يطيقون قال \"نصف دينار\" قال لا يطيقون قال \"ما ترى ؟\" قال شعيرة فقال له النبي صلى الله عليه وسلم \"إنك لزهيد\" قال فنزلت \"أأشفقتم أن تقدموا بين يدي نجواكم صدقات\" قال علي: في خفف الله عن هذه الأمة. ورواه الترمذي عن سفيان بن وكيع عن يحيى بن آدم عن عبيدالله الأشجعي عن سفيان الثوري عن عثمان بن المغيرة الثقفي عن سالم بن أبي الجعد عن على بن علقمة الأنماري عن علي بن أبي طالب رضي الله عنه قال لما نزلت \"يا أيها الذين آمنوا إذا ناجيتم الرسول فقدموا بين يدي نجواكم صدقة\" إلى آخرها قال لي النبي صلى الله عليه وسلم \"ما ترى دينار ؟\" قال لا يطيقونه وذكره بتمامه مثله. ثم قال هذا حديث حسن غريب إنما نعرفة من هذا الوجه ثم قال ومعنى قوله شعيرة يعني وزن شعيرة من ذهب ورواه أبو يعلى عن أبي بكر بن أبي شيبة عن يحيى بن آدم به. وقال العوفي عن ابن عباس في قوله تعالى \"يا أيها الذين آمنوا إذا ناجيتم الرسول فقدموا بين يدي نجواكم صدقة- إلى - فإن الله غفور رحيم\" كان المسلمون يقدمون بين يدي النجوى صدقة فلما نزلت الزكاه نسخ هذا. وقال علي بن أبي طلحة عن ابن عباس قوله \"فقدموا بين يدي نجواكم صدقة\" وذلك أن المسلمين أكثروا المسائل على رسول الله صلى الله عليه وسلم حتى شقوا عليه فأراد الله أن يخفف عن نبيه عليه السلام فلما قال ذلك جبن كثير من المسلمين وكفوا عن المسئلة فأنزل الله بعد هذا \"أأشفقتم أن تقدموا بين يدي نجواكم صدقات فإذا لم تفعلوا وتاب الله عليكم فأقيموا الصلاة وآتوا الزكاة\" فوسع الله عليهم ولم يضيق. وقال عكرمة والحسن البصري في قوله تعالى \"فقدموا بين يدي نجواكم صدقة\" نسختها الآية التي بعدها \"أأشفقتم أن تقدموا بين يدي نجواكم صدقات\" إلى آخرها. وقال سعيد بن أبي عروبة عن قتاده ومقاتل بن حيان سأل الناس رسول الله صلى الله عليه وسلم حتى أحفوه بالمسألة ففطمهم الله بهذه الآية فكان الرجل منهم إذا كانت له الحاجة إلى نبي الله صلى الله عليه وسلم فلا يستطيع أن يقضيها حتى يقدم بين يديه صدقه فاشتد ذلك عليهم فأنزل الله الرخصة بعد ذلك \"فإن لم تجدوا فإن الله غفور رحيم\" وقال معمر عن قتادة \"إذا ناجيتم الرسول فقدموا بين يدي نجواكم صدقة\" إنها منسوخة ما كانت إلا ساعة من نهار وهكذا روى عبدالرزاق أخبرنا معمر عن أيوب عن مجاهد قال علي: ما عمل بها أحد غيري حتى نسخت وأحسبه قال وما كانت إلا ساعة."
    },
    {
      "ayah": 14,
      "surah": 58,
      "text": "يقول الله تعالى منكرا على المنافقين في موالاتهم الكفار في الباطن وهم في نفس الأمر لا معهم ولا مع المؤمنين كما قال تعالى \"مذبذبين بين ذلك لا إلى هؤلاء ولا إلى هؤلاء ومن يضلل الله فلن تجد له سبيلا\" وقال ههنا \"ألم تر إلى الذين تولوا قوما غضب الله عليهم\" يعني اليهود الذين كان المنافقون يمالئونهم ويوالونهم في الباطن ثم قال تعالى \"ما هم منكم ولا منهم\" أي هؤلاء المنافقون ليسوا في الحقيقة منكم أيها المؤمنون ولا من الذين يوالونهم وهم اليهود ثم قال تعالى \"ويحلفون على الكذب وهم يعلمون\" يعني المنافقين يحلفون على الكذب وهم عالمون بأنهم كاذبون فيما حلفوا وهي اليمين الغموس ولا سيما في مثل حالهم اللعين عياذا بالله منه فإنهم كانوا إذا لقوا الذين آمنوا قالوا آمنا وإذا جاءوا الرسول حلفوا له بالله أنهم مؤمنون وهم في ذلك يعلمون أنهم يكذبون فيما حلفوا به لأنهم لا يعتقدون صدق ما قالوه وإن كان في نفس الأمر مطابقا ولهذا شهد الله بكذبهم في أيمانهم وشهادتهم لذلك."
    },
    {
      "ayah": 15,
      "surah": 58,
      "text": "أي أرصد الله لهم على هذا الصنيع العذاب الأليم على أعمالهم السيئة وهى موالاة الكافرين ونصحهم ومعاداة المؤمنين وغشهم."
    },
    {
      "ayah": 16,
      "surah": 58,
      "text": "أى أظهروا الإيمان وأبطنوا الكفر واتقوا بالأيمان الكاذبة فظن كثير ممن لا يعرف حقيقة أمرهم صدقهم فاغتربهم فحصل بهذا صد عن سبيل الله لبعض الناس \"فلهم عذاب مهين\" أى في مقابلة ما امتهنوا من الحلف باسم الله العظيم في الأيمان الكاذبة الحانثة."
    },
    {
      "ayah": 17,
      "surah": 58,
      "text": "قال تعالى \"لن تغني عنهم أموالهم ولا أولادهم من الله شيئا\" أي لن يدفع ذلك عنهم بأسا إذا جاءهم \"أولئك أصحاب النار هم فيها خالدون\"."
    },
    {
      "ayah": 18,
      "surah": 58,
      "text": "قال تعالى \"يوم يبعثهم الله جميعا\" أي يحشرهم يوم القيامة عن آخرهم فلايغادر منهم أحدا \" فيحلفون له كما يحلفون لكم ويحسبون أنهم على شيء\" أي يحلفون بالله عز وجل أنهم كانوا على الهدى والاستقامة كما كانوا يحلفون للناس في الدنيا لأن من عاش على شيء مات عليه وبعث عليه ويعتقدون أن ذلك ينفعهم عند الله كما كان ينفعهم عند الناس فيجرون عليهم الأحكام الظاهرة ولهذا قال \"ويحسبون أنهم على شىء\" أي حلفهم ذلك لربهم عز وجل. ثم قال منكرا عليهم حسبانهم \"ألا إنهم هم الكاذبون\" فأكد الخبر عنهم بالكذب وقال ابن أبي حاتم حدثنا أبي حدثنا ابن نفيل حدثنا زهير عن سماك بن حرب حدثني سعيد بن جبير أن ابن عباس حدثه أن النبى صلى الله عليه وسلم كان في ظل حجرة من حجره وعنده نفر من المسلمين قد كاد يقلص عنهم الظل قال \"إنه سيأتيكم إنسان ينظر بعيني شيطان فإذا أتاكم فلا تكلموه\" فجاء رجل أزرق فدعاه رسول الله صلى الله عليه وسلم فكلمه فقال \"علام تشتمني أنت وفلان وفلان\" نفر دعاهم بأسمائهم قال فانطلق الرجل فدعاهم فحلفوا له واعتذروا إليه قال فأنزل الله عز وجل \"فيحلفون له كما يحلفون لكم ويحسبون أنهم على شيء ألا إنهم هم الكاذبون\" وهكذا رواه الإمام أحمد من طريقين عن سماك ورواه ابن جرير عن محمد بن المثني عن غندر عن شعبة عن سماك به نحوه وأخرجه أيضا من حديث سفيان الثوري عن سماك بنحوه إسناد جيد ولم يخرجوه وحال هؤلاء كما أخبر الله تعالى عن المشركين حيث يقول \"ثم لم تكن فتنتهم إلا أن قالوا والله ربنا ما كنا مشركين انظر كيف كذبوا على أنفسهم وضل عنهم ما كانوا يفترون\"."
    },
    {
      "ayah": 19,
      "surah": 58,
      "text": "قال تعالى \"استحوذ عليهم الشيطان فأنساهم ذكر الله\" أي استحوذ على قلوبهم الشيطان حتى أنساهم أن يذكروا الله عز وجل وكذلك يصنع بمن استحوذ عليه. ولهذا قال أبو داود حدثنا أحمد بن يونس حدثنا زائدة حدثنا السائب بن حبيش عن معدان بن أبي طلحه اليعمري عن أبي الدرداء قال سمعت رسول الله صلى الله عليه وسلم يقول \"ما من ثلاثة في قرية ولا بدو لا تقام فيهم الصلاة إلا قد استحوذ عليهم الشيطان فعليك بالجماعة فإنما يأكل الذئب القاصية\" قال زائدة قال السائب يعني الصلاة في الجماعة. ثم قال تعالى \"أولئك حزب الشيطان\" يعنى الذين استحوذ عليهم الشيطان فأنساهم ذكر الله. ثم قال تعالى \"ألا إن حزب الشيطان هم الخاسرون\"."
    },
    {
      "ayah": 2,
      "surah": 58,
      "text": "قال الإمام أحمد حدثنا سعد بن إبراهيم ويعقوب قالا حدثنا أبي حدثنا محمد بن إسحاق حدثني معمر بن عبدالله ابن حنظلة عن يوسف بن عبدالله بن سلام عن خويلة بنت ثعلبة قالت في والله وفي أوس بن الصامت أنزل الله صدر سورة المجادلة قالت كنت عنده وكان شيخا كبيرا قد ساء خلقه قالت فدخل علي يوما فراجعته بشيء فغضب فقال أنت علي كظهر أمي قالت ثم خرج فجلس في نادي قومه ساعة ثم دخل علي فإذا هو يريدنى عن نفسي قالت قلت كلا والذي نفس خويلة بيده لا تخلص إلي وقد قلت ما قلت حتى يحكم الله ورسوله فينا بحكمه قالت فواثبني فامتنعت منه فغلبته بما تغلب به المرأة الشيخ الضعيف فألقيته عني قالت ثم خرجت إلى بعض جاراتي فاستعرت منها ثيابا ثم خرجت حتى جئت إلى رسول الله صلى الله عليه وسلم فجلست بين يديه فذكرت له ما لقيت منه وجعلت أشكو إليه ما ألقى من سوء خلقه قالت فجعل رسول الله صلى الله عليه وسلم يقول \"يا خويلة ابن عمك شيخ كبير فاتقي الله فيه\" قالت فوالله ما برحت حتى نزل في قرآن فتغشى رسول الله صلى الله عليه وسلم ما كان يتغشاه ثم سرى عنه فقال لي \"يا خويلة قد أنزل الله فيك وفي صاحبك قرآنا - ثم قرأ علي - \"قد سمع الله قول التي تجادلك في زوجها وتشتكي الله والله يسمع تحاوركما إن الله سميع بصير - إلى قوله تعالى - وللكافرين عذاب أليم\" قالت: فقال لي رسول الله صلى الله عليه وسلم \"مريه فليعتق رقبة\" قالت: فقلت يا رسول الله ما عنده ما يعتق قال \"فليصم شهرين متتابعين\" قالت: فقلت والله إنه لشيخ كبير ماله من صيام قال \"فليطعم ستين مسكينا وسقا من تمر\" قالت: فقلت يا رسول الله ما ذاك عنده قالت: فقال رسول الله صلى الله عليه وسلم \"فإنا سنعينه بفرق من تمر\" قالت: فقلت يا رسول الله وأنا سأعينه بفرق آخر قال \"قد أصبت وأحسنت فاذهبي فتصدقي به عنه ثم استوصي بابن عمك خيرا\" قالت: ففعلت. ورواه أبو داود فى كتاب الطلاق من سننه من طريقين عن محمد بن إسحاق بن يسار به وعنده خولة بنت ثعلبة ويقال لها خوله بنت مالك بن ثعلبة وقد تصغر فيقال خويلة ولا منافاة بين هذه الأقوال فالأمر فيها قريب والله أعلم. هذا هو الصحيح في سبب نزول هذه السورة فأما حديث سلمة بن صخر فليس فيه أنه كان سبب النزول ولكن أمر بما أنزل الله في هذه السورة من العتق أو الصيام أو الإطعام كما قال الإمام أحمد حدثنا يزيد بن هارون أخبرنا محمد بن إسحاق بن يسار عن محمد بن عمرو بن عطاء عن سليمان بن يسار عن سلمة بن صخر الأنصاري قال كنت امرأ قد أوتيت من جماع النساء ما لم يؤت غيري فلما دخل رمضان تظهرت من امرأتي حتى ينسلخ رمضان فرقا من أن أصيب في ليلتي شيئا فأتتابع فى ذلك إلى أن يدركني النهار وأنا لا أقدر أن أنزع فبينما هي تخدمني من الليل إذ تكشف لى منها شيء فوثبت عليها فلما أصبحت غدوت على قومي فأخبرتهم خبري وقلت انطلقوا معي إلى النبي صلى الله عليه وسلم فأخبره بأمري فقالوا لا والله لا نفعل نتخوف أن ينزل فينا أو يقول فينا رسول الله صلى الله عليه وسلم مقالة يبقى علينا عارها ولكن اذهب أنت فاصنع ما بدالك قال فخرجت حتى أتيت النبي صلى الله عليه وسلم فاخبرته خبري فقال لي \"أنت بذاك\" فقلت أنا بذاك فقال \"أنت بذاك\" فقلت أنا بذاك قال \"أنت بذاك\" قلت نعم ها أناذا فأمض في حكم الله عز وجل فإني صابر له قال \"اعتق رقبة\" قال فضربت صفحة رقبتي بيدي وقلت لا والذي بعثك بالحق ما أصبحت أملك غيرها قال \"فصم شهرين متتابعين\" قلت يا رسول الله وهل أصابنى ما أصابني إلا في الصيام قال \"فتصدق\" فقلت والذي بعثك بالحق لقد بتنا ليلتنا هذه وحشا ما لنا عشاء قال \"اذهب إلى صاحب صدقة بني رزيق فقل له فليدفعها إليك فأطعم عنك منها وسقا من تمر ستين مسكينا ثم استعن بسائره عليك وعلى عيالك\" قال فرجعت إلى قومي فقلت وجدت عندكم الضيق وسوء الرأي ووجدت عند رسول الله صلى الله عليه وسلم السعة والبركة قد أمر لي بصدقتكم فادفعوها إلي فدفعوها إلي. وهكذا رواه أبو داود وابن ماجه واختصره الترمذى وحسنه وظاهر السياق أن هذه القصة كانت بعد قصة أوس بن الصامت وزوجته خويلة بنت ثعلبة كما دل عليه سياق تلك وهذه بعد التأمل قال خصيف عن مجاهد عن ابن عباس أول من ظاهر من امرأته أوس بن الصامت أخو عبادة بن الصامت وامرأته خولة بنت ثعلبة بن مالك فلما ظاهر منها خشيت أن يكون ذلك طلاقا فأتت رسول الله صلى الله عليه وسلم فقالت يا رسول الله إن أوسا ظاهر مني وإنا إن افترقنا هلكنا وقد نثرت بطني منه وقدمت صحبته وهي تشكو ذلك وتبكي ولم يكن جاء في ذلك شيء فأنزل الله تعالى \"قد سمع الله قول التي تجادلك في زوجها وتشتكي إلى الله- إلى قوله تعالى - وللكافرين عذاب أليم\" فدعاه رسول الله صلى الله عليه وسلم فقال \"أتقدر على رقبة تعتقها\" قال لا والله يا رسول الله ما أقدر عليها قال فجمع له رسول الله صلى الله عليه وسلم حتى أعتق عتقه ثم راجع أهله. رواه ابن جرير ولهذا ذهب ابن عباس والأكثرون إلى ما قلناه والله أعلم. فقوله تعالى \"الذين يظاهرون منكم من نسائهم\" أصل الظهار مشتق من الظهر وذلك أن الجاهلية كانوا إذا ظاهر أحدهم من امرأته قال لها أنت علي كظهر أمي ثم في الشرع كان الظهار في سائر الأعضاء قياسا على الظهر وكان الظهار عند الجاهلية طلاقا فأرخص الله لهذه الأمة وجعل فيه كفارة ولم يجعله طلاقا كما كانوا يعتمدونه في جاهليتهم هكذا قال غير واحد من السلف قال ابن جرير حدثنا أبو كريب حدثنا عبيدالله بن موسى عن أبي حمزة عن عكرمة عن ابن عباس قال كان الرجل إذا قال لامرأته في الجاهلية أنت علي كظهر أمي حرمت عليه فكان أول من ظاهر في الإسلام أوس وكان تحته ابنة عم له يقال لها خويلة بنت ثعلبة فظاهر منها فأسقط في يديه وقال ما أراك إلا قد حرمت علي وقالت له مثل ذلك قال فانطلقي إلى رسول الله صلى الله عليه وسلم فأتت رسول الله صلى الله عليه وسلم فقال \"يا خويلة أبشري\" قالت خيرا قال فقرأ عليها \"قد سمع الله قول التي تجادلك في زوجها وتشتكى إلى الله والله يسمع تحاوركما - إلى قوله تعالى - والذين يظاهرون من نسائهم ثم يعودون لما قالوا فتحرير رقبة من قبل أن يتماسا\" قالت وأي رقبة لنا والله ما يجد رقبة غيري قال \"فمن لم يجد فصيام شهرين متتابعين\" قالت والله لولا أنه يشرب في اليوم ثلاث مرات لذهب بصره قال \"فمن لم يستطع فإطعام ستين مسكينا\" قالت من أين ما هي إلا أكلة إلي مثلها قال فدعا بشطر وسق ثلاثين صاعا والوسق ستون صاعا فقال: ليطعم ستين مسكينا وليراجعك. وهذا إسناد جيد قوى وسياق غريب وقد روي عن أبي العالية نحو هذا. وقال ابن أبي حاتم حدثنا محمد بن عبدالرحمن الهروي حدثنا على بن العاصم عن داود بن أبي هند عن أبي العالية قال: كانت خولة بنت دليج تحت رجل من الأنصار وكان ضرير البصر فقيرا سيء الخلق وكان طلاق أهل الجاهلية إذا أراد الرجل أن يطلق امرأته قال أنت علي كظهر أمي وكان لها منه عيل أو عيلان فنازعته يوما في شيء فقال أنت علي كظهر أمي فاحتملت عليها ثيابها حتى دخلت على النبي صلى الله عليه وسلم وهو في بيت عائشة وعائشة تغسل شق رأسه فقدمت عليه ومعها عيلها فقالت يا رسول الله إن زوجي ضرير البصر فقير لا شيء له سيء الخلق وإني نازعته في شىء فغضب فقال أنت علي كظهر أمي ولم يرد به الطلاق ولي منه عيل أو عيلان فقال \"ما أعلمك إلا قد حرمت عليه\" فقالت أشكو إلى الله ما نزل بى وأبا صبيتي قالت ودارت عائشة فغسلت شق رأسه الآخر فدارت معها فقالت يا رسول الله زوجي ضرير البصر فقير سيء الخلق وإن لي منه عيلا أو عيلين وإنى نازعته في شيء فغضب وقال أنت علي كظهر أمي ولم يرد به الطلاق قالت فرفع إلي رأسه وقال \"ما أعلمك إلا قد حرمت عليه\" فقالت أشكو إلى الله ما نزل بى وأبا صبيتي ورأت عائشة وجه النبى صلى الله عليه وسلم تغير فقالت لها وراءك وراءك فتنحت فمكث رسول الله صلى الله عليه وسلم فى غشيانه ذلك ما شاء الله فلما انقطع الوحي قال يا عائشة أين المرأة فدعتها فقال لها رسول الله صلى الله عليه وسلم \"اذهبى فأتيني بزوجك\" فانطلقت تسعى فجاءت به فإذا هو كما قالت ضرير البصر فقير سيء الخلق فقال النبي صلى الله عليه وسلم أستعيذ بالله السميع العليم \"بسم الله الرحمن الرحيم قد سمع الله قول التي تجادلك في زوجها - إلى قوله - والذين يظاهرون من نسائهم ثم يعودون لما قالوا\" قال النبي صلى الله عليه وسلم \"أتجد رقبة تعتقها من قبل أن تمسها ؟\" قال لا قال \"أفتستطيع أن تصوم شهرين متتابعين ؟\" قال والذي بعثك بالحق إني إذا لم آكل المرتين والثلات يكاد أن يعشو بصري \"قال أفتستطيع أن تطعم ستين مسكينا ؟\" قال لا إلا أن تعينني قال فأعانه رسول الله صلى الله عليه وسلم فقال \"أطعم ستين مسكينا\" قال وحول الله الطلاق فجعله ظهارا. ورواه ابن جرير عن ابن المثنى عن عبد الأعلى عن داود سمعت أبا العالية فذكر نحوه بأخصر من هذا السياق وقال سعيد بن جبير كان الإيلاء والظهار من طلاق الجاهلية فوقت الله الايلاء أربعه أشهر وجعل في الظهار الكفارة رواه ابن أبي حاتم بنحوه وقد استدل الإمام مالك على أن الكافر لا يدخل في هذه الآية بقوله\"منكم\" فالخطاب للمؤمنين وأجاب الجمهور بأن هذا خرج مخرج الغالب فلا مفهوم له واستدل الجمهور عليه بقوله \"من نسائهم\" على أن الأمة لاظهار منها ولا تدخل في هذا الخطاب وقوله تعالى \"ما هن أمهاتهم إن أمهاتهم إلا اللائي ولدنهم\" أي لا تصير المرأة بقول الرجل أنت علي كأمي أو مثل أمي أو كظهر أمي وما أشبه ذلك لا تصير أمه بذلك إنما أمه التي ولدته ولهذا قال تعالى \"وإنهم ليقولون منكرا من القول وزورا\" أى كلاما فاحشا باطلا \"وإن الله لعفو غفور\" أي عما كان منكم في حال الجاهلية وهكذا أيضا عما خرج من سبق اللسان ولم يقصد إليه المتكلم كما رواه أبو داود أن رسول الله صلى الله عليه وسلم سمع رجلا يقول لامرأته يا أختي فقال \"أختك هي ؟\" فهذا إنكار ولكن لم يحرمها عليه بمجرد ذلك لأنه لم يقصده ولو قصده لحرمت عليه لأنه لا فرق على الصحيح بين الأم وبين غيرها من سائر المحارم من أخت وعمة وخالة وما أشبه ذلك."
    },
    {
      "ayah": 20,
      "surah": 58,
      "text": "يقول تعالى مخبرا عن الكفار المعاندين المحادين لله ورسوله يعني الذين هم في حد والشرع في حد أي مجانبون للحق مشاقون له هم في ناحية والهدى في ناحية \"أولئك في الأذلين\" أي في الأشقياء المبعدين المطرودين عن الصواب الأذلين في الدنيا والآخرة."
    },
    {
      "ayah": 21,
      "surah": 58,
      "text": "\"كتب الله لأغلبن أنا ورسلي\" أي قد حكم وكتب في كتابه الأول وقدره الذي لا يخالف ولا يمانع ولا يبدل بأن النصرة له ولكتابه ورسله وعباده المؤمنين في الدنيا والآخرة \"وأن العاقبة للمتقين\" كما قال تعالى \"إنا لننصر رسلنا والذين آمنوا في الحياة الدنيا ويوم يقوم الأشهاد يوم لا ينفع الظالمين معذرتهم ولهم اللعنة ولهم سوء الدار\" وقال ههنا \"كتب الله لأغلبن أنا ورسلي إن الله قوي عزيز\" أي كتب القوي العزيز أنه الغالب لأعدائه وهذا قدر محكم وأمر مبرم أن العاقبة والنصرة للمؤمنين في الدنيا والآخرة."
    },
    {
      "ayah": 22,
      "surah": 58,
      "text": "ثم قال تعالى \"لا تجد قوما يؤمنون بالله واليوم الآخر يوادون من حاد الله ورسوله ولو كانوا آباءهم أو أبناءهم أو إخوانهم أو عشيرتهم\" أي لا يوادون المحادين ولو كانوا من الأقربين كما قال تعالى \"لا يتخذ المؤمنون الكافرين أولياء من دون المؤمنين ومن يفعل ذلك فليس من الله في شيء إلا أن تتقوا منهم تقاة ويحذركم الله نفسه\" الآية وقال تعالى \"قل إن كان آباؤكم وأبناؤكم وإخوانكم وأزواجكم وعشيرتكم وأموال اقترفتموها وتجارة تخشون كسادها ومساكن ترضونها أحب إليكم من الله ورسوله وجهاد في سبيله فتربصوا حتى يأتي الله بأمره والله لا يهدي القوم الفاسقين\" وقد قال سعيد بن عبدالعزيز وغيره أنزلت هذه الآية \"لا تجد قوما يؤمنون بالله واليوم الآخر\" إلى آخرها في أبي عبيدة عامر بن عبدالله بن الجراح حين قتل أباه يوم بدر ولهذا قال عمر بن الخطاب رضي الله عنه حين جعل الأمر شورى بعده في أولئك الستة ولو كان أبو عبيدة حيا لاستخلفته وقيل في قوله تعالى \"ولو كانوا آباءهم\" نزلت في أبي عبيده قتل أباه يوم بدر \"أو أبناءهم\" في الصديق هم يومئذ بقتل ابنه عبدالرحمن \"أو إخوانهم\" في مصعب بن عمير قتل أخاه عبيد بن عمير يومئذ \"أو عشيرتهم\" في عمر قتل قريبا له يومئذ أيضا وفي حمزة وعلي وعبيدة بن الحارث قتلوا عتبة وشيبة والوليد بن عتبة يومئذ فالله أعلم \"قلت\" ومن هذا القبيل حين استشار رسول الله صلى الله عليه وسلم المسلمين في أسارى بدر فأشار الصديق بأن يفادوا فيكون ما يؤخذ منهم قوة للمسلمين وهم بنو العم والعشيرة ولعل الله تعالى أن يهديهم وقال عمر لا أرى ما رأى يا رسول الله هل تمكنني من فلان قريب لعمر فأقتله وتمكن عليا من عقيل وتمكن فلانا من فلان ليعلم الله أنه ليست في فلوبنا موادة للمشركين القصة بكمالها. وقوله تعالى \"أولئك كتب في قلوبهم الإيمان وأيدهم بروح منه\" أي من اتصف بأنه لا يواد من حاد الله ورسوله ولو كان أباه أو أخاه فهذا ممن كتب الله في قلبه الإيمان أي كتب له السعادة وقررها في قلبه وزين الإيمان في بصيرته قال السدي \"كتب في قلوبهم الإيمان\" جعل في قلوبهم الإيمان وقال ابن عباس \"وأيدهم بروح منه\" أي قواهم. وقوله تعالى \"ويدخلهم جنات تجري من تحتها الأنهار خالدين فيها رضي الله عنهم ورضوا عنه\" كل هذا تقدم تفسيره غير مرة وفي قوله تعالى \"رضي الله عنهم ورضوا عنه\" سر بديع وهو أنه لما سخطوا على القرائب والعشائر في الله تعالى عوضهم الله بالرضا عنهم وأرضاهم عنه بما أعطاهم من النعيم المقيم والفوز العظيم والفضل العميم وقوله تعالى \"أولئك حزب الله ألا إن حزب الله هم المفلحون\" أي هؤلاء حزب الله أي عباد الله وأهل كرامته وقوله تعالى \"ألا إن حزب الله هم المفلحون\" تنويه بفلاحهم وسعادتهم ونصرتهم في الدنيا والآخرة في مقابلة ما ذكر عن أولئك بأنهم حزب الشيطان ثم قال \"ألا إن حزب الشيطان هم الخاسرون\" وقد قال ابن أبي حاتم حدثنا هارون بن حميد الواسطي حدثنا الفضل بن عنبسة عن رجل قد سماه فقال هو عبدالحميد بن سليمان - انقطع من كتابي - عن الذيال بن عباد قال: كتب أبو حازم الأعرج إلى الزهري: اعلم أن الجاه جاهان: جاه يجريه الله تعالى على أيدي أوليائه لأوليائه وأنهم الخامل ذكرهم الخفية شخوصهم ولقد جاءت صفتهم على لسان رسول الله صلى الله عليه وسلم \"إن الله يحب الأخفياء الأتقياء الأبرياء الذين إذا غابوا لم يفتقدوا وإذا حضروا لم يدعوا قلوبهم مصابيح الهدى يخرجون من كل فتنة سوداء مظلمة\" فهؤلاء أولياء الله تعالى الذين قال الله \"أولئك حزب الله ألا إن حزب الله هم المفلحون\" وقال نعيم بن حماد حدثنا محمد بن ثور عن يونس عن الحسن قال: قال رسول الله صلى الله عليه وسلم \"اللهم لا تجعل لفاجر ولا لفاسق عندي يدا ولا نعمة فإنى وجدت فيما أوحيته إلي \"لا تجد قوما يؤمنون بالله واليوم الآخر يوادون من حاد الله ورسوله\" قال سفيان يرون أنها نزلت فيمن يخالط السلطان. رواه أبو أحمد العسكري. آخر تفسير سورة المجادلة ولله الحمد والمنة."
    },
    {
      "ayah": 3,
      "surah": 58,
      "text": "وقوله تعالى \"والذين يظاهرون من نسائهم ثم يعودون لما قالوا\" اختلف السلف والأئمة في المراد بقوله تعالى \"ثم يعودون لما قالوا\" فقال بعض الناس العود هو أن يعود إلى لفظ الظهار فيكرره وهذا القول باطل وهو اختيار ابن حزم وقول داود حكاه أبو عمر بن عبدالبر عن بكير بن الأشج والفراء وفرقة من أهل الكلام وقال الشافعي هو أن يمسكها بعد المظاهرة زمانا يمكنه أن يطلق فيه فلا يطلق وقال أحمد بن حنبل هو أن يعود إلى الجماع أو يعزم عليه فلا تحل له حتى يكفر بهذه الكفارة وقد حكي عن مالك أنه العزم على الجماع أو الإمساك عنه وعنه أنه الجماع وقال أبو حنيفة هو أن يعود إلى الظهار بعد تحريمه ورفع ما كان عليه أمر الجاهلية فمتى ظاهر الرجل من امرأته فقد حرمها تحريما لا يرفعه إلا الكفارة. وإليه ذهب أصحابه والليث بن سعد وقال ابن لهيعه حدثني عطاء عن سعيد بن جبير \"ثم يعودون لما قالوا\" يعني يريدون أن يعودوا في الجماع الذي حرموه على أنفسهم وقال الحسن البصري يعني الغشيان في الفرج وكان لا يرى بأسا أن يغشى فيما دون الفرج قبل أن يكفر وقال علي بن أبي طلحة عن ابن عباس \"من قبل أن يتماسا\" والمس النكاح وكذا قال عطاء والزهري وقتادة ومقاتل بن حيان وقال الزهري ليس له أن يقبلها ولا يمسها حتى يكفر. وقد روى أهل السنن من حديث عكرمة عن ابن عباس أن رجلا قال: يا رسول الله إني ظاهرت من امرأتي فوقعت عليها قبل أن أكفر فقال \"ما حملك على ذلك يرحمك الله\" قال رأيت خلخالها في ضوء القمر قال \"فلا تقربها حتى تفعل ما أمرك الله عز وجل\" وقال الترمذي حسن غريب صحيح. ورواه أبو داود والنسائي من حديث عكرمة مرسلا قال النسائي وهو أولى بالصواب. وقوله تعالى \"فتحرير رقبة\" أى فإعتاق رقبة كاملة من قبل أن يتماسا فهاهنا الرقبة مطلقة غير مقيدة بالإيمان وفي كفارة القتل مقيدة بالإيمان فحمل الشافعي رحمه الله ما أطلق ههنا علي ما قيد هناك لاتحاد الموجب وهو عتق الرقبة واعتضد في ذلك بما رواه عن مالك بسنده عن معاوية بن الحكم السلمي في قصة الجارية السوداء وأن رسول الله صلى الله عليه وسلم قال \"أعتقها فإنها مؤمنه\" وقد رواه أحمد في مسنده ومسلم في صحيحه. وقال الحافظ أبو بكر البزار حدثنا يوسف بن موسى حدثنا عبدالله بن نمير عن إسماعيل بن مسلم بن يسار عن عمرو بن دينار عن طاوس عن ابن عباس قال: أتى رسول الله صلى الله عليه وسلم رجل فقال إني ظاهرت من امرأتي ثم وقعت عليها قبل أن أكفر فقال رسول الله صلى الله عليه وسلم \"ألم يقل الله تعالى \"من قبل أن يتماسا\" قال أعجبتني قال \"أمسك حتى تكفر\" ثم قال البزار لا يروى عن ابن عباس بأحسن من هذا وإسماعيل بن مسلم تكلم فيه وروى عنه جماعة كثيرة من أهل العلم وفيه من الفقه أنه لم يأمره إلا بكفارة واحدة. وقوله تعالى \"ذلكم توعظون به\" أي تزجرون به \"والله بما تعملون خبير\" أي خبير بما يصلحكم عليم بأحوالكم."
    },
    {
      "ayah": 4,
      "surah": 58,
      "text": "قد تقدمت الأحاديث الآمرة بهذا على الترتيب كما ثبت في الصحيحين في قصة الذي جامع امرأته في رمضان \"ذلك لتؤمنوا بالله ورسوله\" أي شرعنا هذا لهذا. وقوله تعالى \"وتلك حدود الله\" أي محارمه فلا تنتهكوها وقوله تعالى \"وللكافرين عذاب أليم\" أي الذين لم يؤمنوا ولا التزموا بأحكام هذه الشريعة لا تعتقدوا أنهم ناجون من البلاء كلا ليس الأمر كما زعموا بل لهم عذاب أليم أي فى الدنيا والآخرة."
    },
    {
      "ayah": 5,
      "surah": 58,
      "text": "يخبر تعالى عمن شاقوا الله ورسوله وعاندوا شرعه \"كبتوا كما كبت الذين من قبلهم\" أي أهينوا ولعنوا وأخزوا كما فعل بمن أشبههم ممن قبلهم \"وقد أنزلنا آيات بينات\" أى واضحات لا يعاندها ولا يخالفها إلا كافر فاجر مكابر \"وللكافرين عذاب مهين\" أي في مقابلة ما استكبروا عن اتباع شرع الله والانقياد له والخضوع لديه."
    },
    {
      "ayah": 6,
      "surah": 58,
      "text": "قال الله تعالى \"يوم يبعثهم الله جميعا\" وذلك يوم القيامة يجمع الله الأولين والآخرين في صعيد واحد \"فينبئهم بما عملوا\" أي فيخبرهم بالذي صنعوا من خير وشر \"أحصاه الله ونسوه\" أي ضبطه الله وحفظه عليهم وهم قد نسوا ما كانوا عملوا \"والله على كل شىء شهيد\" أي لا يغيب عنه شىء ولا يخفى ولا ينسى شيئا."
    },
    {
      "ayah": 7,
      "surah": 58,
      "text": "قال تعالى مخبرا عن إحاطة علمه بخلقه واطلاعه عليهم وسماعه كلامهم ورؤيته مكانهم حيث كانوا وأين كانوا فقال تعالى \"ألم تر أن الله يعلم ما في السموات وما في الأرض ما يكون من نجوى ثلاثه\" أي من سر ثلاثه \"إلا هو رابعهم ولا خمسة إلا هو سادسهم ولا أدنى من ذلك ولا أكثر إلا هو معهم أينما كانوا\" أي مطلع عليهم يسمع كلامهم وسرهم ونجواهم ورسله أيضا مع ذلك تكتب ما يتناجون به مع علم الله وسمعه له كما قال تعالى \"ألم يعلموا أن الله يعلم سرهم ونجواهم وأن الله علام الغيوب\" وقال تعالى \"أم يحسبون أنا لا نسمع سرهم ونجواهم بلى ورسلنا لديهم يكتبون\" ولهذا حكى غير واحد الإجماع على أن المراد بهذه الآية معية علمه تعالى ولا شك في إرادة ذلك ولكن سمعه أيضا مع علمه بهم وبصره نافذ فيهم فهو سبحانه وتعالى مطلع على خلقه لا يغيب عنه من أمورهم شيء ثم قال تعالى \"ثم ينبئهم بما عملوا يوم القيامة إن الله بكل شيء عليم\" وقال الإمام أحمد: افتتح الآية بالعلم واختتمها بالعلم."
    },
    {
      "ayah": 8,
      "surah": 58,
      "text": "قال ابن أبي نجيح عن مجاهد \"ألم تر إلى الذين نهوا عن النجوى ثم يعودون لما نهوا عنه\" قال اليهود وكذا قال مقاتل بن حيان وزاد \"كان بين النبي صلى الله عليه وسلم وبين اليهود موادعة وكانوا إذا مر بهم الرجل من أصحاب النبي صلى الله عليه وسلم جلسوا يتناجون بينهم حتى يظن المؤمن أنهم يتناجون بقتله أو بما يكره المؤمن فإذا رأى المؤمن ذلك خشيهم فترك طريقه عليهم فنهاهم النبي صلى الله عليه وسلم عن النجوى فلم ينتهوا وعادوا إلى النجوى فأنزل الله تعالى \"الم تر إلى الذين نهوا عن النجوى ثم يعودون لما نهوا عنه\" وقال ابن أبي حاتم حدثنا أبي حدثنا إبراهيم بن المنذر الحزامي حدثني سفيان بن حمزة عن كثير عن زيد عن ربيح بن عبدالرحمن بن أبي سعيد الخدري عن أبيه عن جده قال: كنا نتناوب رسول الله صلى الله عليه وسلم نبيت عنده يطرقه من الليل أمر وتبدو له حاجة فلما كانت ذات ليلة كثر أهل النوب والمحتسبون حتى كنا أندية فتحدث فخرج علينا رسول الله صلى الله عليه وسلم فقال \"ما هذه النجوى ؟ ألم تنهوا عن النجوى\" قلنا تبنا إلى الله يا رسول الله إنا كنا في ذكر المسيح فرقا منه فقال \"ألا أخبركم بما هو أخوف عليكم عندي منه؟\" قلنا بلى يا رسول الله ؟ قال \"الشرك الخفى أن يقوم الرجل يعمل لمكان رجل\" هذا إسناد غريب وفيه بعض الضعفاء. وقوله تعالى \"ويتناجون بالإثم والعدوان ومعصية الرسول\" أي يتحدثون فيما بينهم بالإثم وهو ما يختص بهم \"والعدوان\" وهو ما يتعلق بغيرهم ومنه معصية الرسول ومخالفته يصرون عليها ويتواصون بها وقوله تعالى \"وإذا جاؤوك حيوك بما لم يحيك به الله\" قال ابن أبي حاتم حدثنا أبو سعيد الأشج حدثنا ابن نمير عن الأعمش عن مسروق عن عائشة قالت دخل على رسول الله صلى الله عليه وسلم يهود فقالوا السام عليك يا أبا القاسم فقالت عائشة: وعليكم السام قالت: فقال رسول الله صلى الله عليه وسلم \"يا عائشة إن الله لا يحب الفحش ولا التفحش\" قلت ألا تسمعهم يقولون السام عليك\" ؟ فقال رسول الله صلى الله عليه وسلم \"أو ما سمعت أقول وعليكم\" فأنزل الله تعالى \"وإذا جاؤك حيوك بما لم يحيك به الله\" وفي رواية في الصحيح أنها قالت لهم: عليكم السام والذام واللعنة وأن رسول الله صلى الله عليه وسلم قال \"إنه يستجاب لنا فيهم ولا يستجاب لهم فينا\". وقال ابن جرير حدثنا بشر حدثنا يزيد حدثنا سعيد عن قتادة عن أنس بن مالك أن رسول الله صلى الله عليه وسلم بينما هو جالس مع أصحابه إذ أتى عليهم يهودي فسلم عليهم فردوا عليه فقال نبي الله صلى الله عليه وسلم \"هل تدرون ما قال ؟\" قالوا سلم يا رسول الله قال \"بل قال سام عليكم\" أي تسامون دينكم قال رسول الله صلى الله عليه وسلم \"ردوه\" فردوه عليه فقال نبي الله \"أقلت سام عليكم\" قال نعم فقال رسول الله صلى الله عليه وسلم \"إذا سلم عليكم أحد من أهل الكتاب فقولوا عليك\" أي عليك ما قلت وأصل حديث أنس مخرج في الصحيح وهذا الحديث في الصحيح عن عائشة بنحوه وقوله تعالى \"ويقولون في أنفسهم لولا يعذبنا الله بما نقول\" أي يفعلون هذا ويقولون ما يحرفون من الكلام وإيهام السلام وإنما هو شتم في الباطن ومع هذا يقولون في أنفسهم لو كان هذا نبيا لعذبنا الله بما نقول له في الباطن لأن الله يعلم ما نسره فلو كان هذا نبيا حقا لأوشك أن يعاجلنا الله بالعقوبة في الدنيا فقال الله تعالى \"حسبهم جهنم\" أي جهنم كفايتهم في الدار الآخرة \"يصلونها فبئس المصير\" وقال الإمام أحمد حدثنا عبد الصمد حدثنا حماد عن عطاء بن السائب عن أبيه عن عبدالله بن عمر أن اليهود كانوا يقولون لرسول الله صلى الله عليه وسلم سام عليكم ثم يقولون في أنفسهم لولا يعذبنا الله بما نقول ؟ فنزلت هذه الآية \"وإذا جاؤوك حيوك بما لم يحيك به الله ويقولون في أنفسهم لولا يعذبنا الله بما نقول حسبهم جهنم يصلونها فبئس المصير\" إسناد حسن ولم يخرجوه وقال العوفي عن ابن عباس \"وإذا جاءوك حيوك بما لم يحيك به الله\" قال كان المنافقون يقولون لرسول الله صلى الله عليه وسلم إذا حيوه سام عليك قال الله تعالى \"حسبهم جهنم يصلونها فبئس المصير\" ثم قال الله تعالى مؤدبا عباده المؤمنين أن لا يكونوا مثل الكفرة والمنافقين."
    },
    {
      "ayah": 9,
      "surah": 58,
      "text": "قال تعالى \"يا أيها الذين آمنوا إذا تناجيتم فلا تتناجوا بالإثم والعدوان ومعصية الرسول\" أي كما يتناجى به الجهلة من كفرة أهل الكتاب ومن مألاهم على ضلالهم من المنافقين \"وتناجوا بالبر والتقوى واتقوا الله الذي إليه تحشرون\" أي فيخبركم بجميع أعمالكم وأقوالكم التي أحصاها عليكم وسيجزيكم بها. قال الإمام أحمد حدثنا بهز وعفان قالا أخبرنا همام عن قتادة عن صفوان بن محرز قال كنت آخذا بيد ابن عمر إذ عرض له رجل فقال كيف سمعت رسول الله صلى الله عليه وسلم يقول في النجوى يوم القيامة ؟ قال سمعت رسول الله صلى الله عليه وسلم يقول\" إن الله يدني المؤمن فيضع عليه كنفه ويستره من الناس ويقرره بذنوبه ويقول له أتعرف ذنب كذا؟ أتعرف ذنب كذا ؟ أتعرف ذنب كذا ؟ حتى إذا قرره بذنوبه ورأى في نفسه أن قد هلك قال فإني قد سترتها عليك في الدنيا وأنا أغفرها لك اليوم ثم يعطى كتاب حسناته وأما الكفار والمنافقون فيقول الأشهاد \"هؤلاء الذين كذبوا على ربهم ألا لعنة الله على الظالمين\" أخرجاه في الصحيحين من حديث قتادة."
    }
  ]
}
