{
  "ayahs": [
    {
      "ayah": 1,
      "surah": 59,
      "text": "سورة الحشر: \"وكان ابن عباس يقول: سورة بني النضير\" قال سعيد بن منصور حدثنا هشيم عن أبي بشر عن سعيد بن جبير قال: قلت لابن عباس سورة الحشر؟ قال أنزلت في بني النضير ورواه البخاري ومسلم من وجه آخر عن هشيم به ورواه البخاري من حديث أبي عوانه عن أبي بشر عن سعيد بن جبير قال: قلت لابن عباس سورة الحشر؟ قال سورة بنى النضير. +6 يخبر تعالى أن جميع ما في السموات وما في الأرض من شيء يسبح له ويمجده ويقدسه ويصلي له ويوحده كقوله تعالى \"تسبح له السموات السبع والأرض ومن فيهن وإن من شيء إلا يسبح بحمده ولكن لا تفقهون تسبيحهم\" وقوله تعالى \"وهو العزيز\" أي منيع الجناب \"الحكيم\" في قدره وشرعه."
    },
    {
      "ayah": 10,
      "surah": 59,
      "text": "هؤلاء في القسم الثالث ممن يستحق فقراؤهم من مال الفيء وهم المهاجرون ثم الأنصار ثم التابعون لهم بإحسان كما قال في آية براءة \"والسابقون الأولون من المهاجرين والأنصار والذين اتبعوهم بإحسان رضي الله عنهم ورضوا عنه\" فالتابعون لهم بإحسان هم المتبعون لآثارهم الحسنة وأوصافهم الجميلة الداعون لهم في السر والعلانية ولهذا قال تعالى في هذه الآية الكريمة \"والذين جاءوا من بعدهم يقولون\" أي قائلين \"ربنا اغفر لنا ولاخواننا الذين سبقونا بالإيمان ولا تجعل في قلوبنا غلا\" أي بغضا وحسدا \"للذين أمنوا ربنا إنك رؤوف رحيم\" وما أحسن ما استنبط الإمام مالك رحمه الله من هذه الآية الكريمة أن الرافضي الذي يسب الصحابة ليس له في مال الفيء نصيب لعدم اتصافه بما مدح الله به هؤلاء في قولهم \"ربنا اغفر لنا ولإخواننا الذين سبقونا بالإيمان ولا تجعل في قلوبنا غلا للذين آمنوا ربنا إنك رؤوف رحيم\" وقال ابن أبي حاتم حدثنا موسى بن عبدالرحمن المسروقي حدثنا محمد بن بشر حدثنا إسماعيل بن إبراهيم بن مهاجر عن أبيه عن عائشة أنها قالت: أمروا أن يستغفروا لهم فسبوهم ثم قرأت هذه الآية \"والذين جاءوا من بعدهم يقولون ربنا اغفر لنا ولإخواننا الذين سبقونا بالإيمان\" الآية وقال إسماعيل ابن علية عن عبدالملك بن عمير عن مسروق عن عائشة قالت: أمرتم بالاستغفار لأصحاب محمد صلى الله عليه وسلم فسببتموهم سمعت نبيكم صلى الله عليه وسلم يقول: \"لا تذهب هذه الأمة حتى يلعن آخرها أولها\" رواه البغوي وقال أبو داود حدثنا مسدد حدثنا إسماعيل بن إبراهيم حدثنا أيوب عن الزهري قال: قال عمر رضي الله عنه\"وما أفاء الله على رسوله منهم فما أوجفتم عليه من خيل ولا ركاب\" قال الزهري: قال عمر رضي الله عنه: هذه لرسول الله صلى الله عليه وسلم خاصة وقرى عرينه وكذا وكذا مما أفاء الله على رسوله من أهل القرى فلله وللرسول ولذي القربى واليتامى والمساكين وابن السبيل وللفقراء المهاجرين الذين أخرجوا من ديارهم وأموالهم - والذين تبوءوا الدار والإيمان من قبلهم - والذين جاؤوا من بعدهم فاستوعبت هذه الآية الناس فلم يبق أحد من المسلمين إلا له فيها حق - قال أيوب - أو قال حظ إلا بعض من تملكون من أرقائكم. كذا رواه أبو داود وفيه انقطاع وقال ابن جرير حدثنا عبدالأعلى حدثنا أبو ثور عن معمر عن أيوب عن عكرمة بن خالد عن مالك بن أوس بن الحدثان قال قرأ عمر بن الخطاب \"إنما الصدقات للفقراء والمساكين\" حتى بلغ \"عليم حكيم\" ثم قال هذه لهؤلاء ثم قرأ \"واعلموا أنما غنمتم من شيء فإن لله خمسه وللرسول ولذى القربى\" الآية ثم قال هذه لهؤلاء ثم قرأ \"ما أفاء الله على رسوله من أهل القرى فلله وللرسول ولذي القربى\" - حتى بلغ - \"للفقراء\" - \"والذين تبوءوا الدار والإيمان من قبلهم - والذين جاءوك من بعدهم\" ثم قال: استوعبت هذه المسلمين عامة وليس أحد إلا وله فيها حق ثم قال: لئن عشت ليأتين الراعي وهو بسرو حمير نصيبه فيها لم يعرق فيها جبينه."
    },
    {
      "ayah": 11,
      "surah": 59,
      "text": "يخبر تعالى عن المنافقين كعبدالله بن أبي وأضرابه حين بعثوا إلى يهود بني النضير يعدونهم النصر من أنفسهم فقال تعالى \"ألم تر إلى الذين نافقوا يقولون لإخوانهم الذين كفروا من أهل الكتاب لئن أخرجتم لنخرجن معكم ولا نطيع فيكم أحـدا أبدا وإن قوتلتم لننصرنكم\" قال الله تعالى \"والله يشهد إنهم لكاذبون\" أي لكاذبون فيما وعدوهم به إما لأنهم قالوا لهم قولا من نيتهم أن لا يقول لهم به وإما لأنهم لا يقع منهم الذي قالوه."
    },
    {
      "ayah": 12,
      "surah": 59,
      "text": "قال تعالى \"ولئن قوتلوا لا ينصرونهم\" أي لا يقاتلون معهم \"ولئن نصروهم\" أي قاتلوا معهم \" ليولن الأدبار ثم لا ينصرون\" وهذه بشارة مستقلة بنفسها."
    },
    {
      "ayah": 13,
      "surah": 59,
      "text": "قال تعالى \"لأنتم أشد رهبة في صدورهم من الله\" أي يخافون منكم أكثر من خوفهم من الله كقوله تعالى \"إذا فريق منهم يخشون الناس كخشية الله أو أشد خشية\" ولهذا قال تعالى \"ذلك بأنهم قوم لا يفقهون\"."
    },
    {
      "ayah": 14,
      "surah": 59,
      "text": "قال تعالى \"لا يقاتلونكم جميعا إلا في قرى محصنة أو من وراء جدر\" يعني أنهم من جبنهم وهلعهم لا يقدرون على مواجهة جيش الإسلام بالمبارزة والمقاتلة بل إما في حصون أو من وراء جدر محاصرين فيقاتلون للدفع عنهم ضرورة. ثم قال تعالى \"بأسهم بينهم شديد\" أي عداوتهم فيما بينهم شديدة كما قال تعالى \"ويذيق بعضكم بأس بعض\" ولهذا قال تعالى \"تحسبهم جميعا وقلوبهم شتى\" أي تراهم مجتمعين فتحسبهم مؤتلفين وهم مختلفون غاية الاختلاف قال إبراهيم النخعي يعني أهل الكتاب والمنافقين ذلك بأنهم قوم لا يعقلون\"."
    },
    {
      "ayah": 15,
      "surah": 59,
      "text": "قال مجاهد والسدي ومقاتل بن حيان يعني كمثل ما أصاب كفار قريش يوم بدر وقال ابن عباس \"كمثل الذين من قبلهم\" يعني يهود بني قينقاع وكذا قال قتادة ومحمد بن إسحاق وهذا القول أشبه بالصواب فإن يهود بني قينقاع كان رسول الله صلى الله عليه وسلم قد أجلاهم قبل هذا."
    },
    {
      "ayah": 16,
      "surah": 59,
      "text": "يعني مثل هؤلاء اليهود في اغترارهم بالذين وعدوهم النصر من المنافقين وقول المنافقين لهم لئن قوتلتم لننصرنكم ثم لما حقت الحقائق وجد بهم الحصار والقتال تخلوا عنهم وأسلموهم للهلكة مثالهم في هذا كمثل الشيطان إذ سول للإنسان - والعياذ بالله - الكفر فإذا دخل فيما سوله له تبرأ منه وتنصل وقال \"إني أخاف الله رب العالمين\". وقد ذكر بعضهم ههنا قصة لبعض عباد بني إسرائيل هي كالمثال لهذا المثل لا أنها المرادة وحدها بالمثل بل هي منه مع غيرها من الوقائع المشاكلة لها فقال ابن جرير حدثنا خلاد بن أسلم أخبرنا النضر بن شميل أخبرنا شعبة عن أبي إسحاق سمعت عبدالله بن نهيك قال سمعت عليا رضي الله عنه يقول: إن راهبا تعبد ستين سنة وإن الشيطان أراده فأعياه فعمد إلى امرأة فأجنها ولها إخوة فقال لإخوتها عليكم بهذا القس فيداويها قال: فجاءوا بها إليه فداواها وكانت عنده فبينما هو يوما عندها إذ أعجبته فأتاها فحملت فعمد إليها فقتلها فجاء إخوتها فقال الشيطان للراهب أنا صاحبك إنك أعييتني أنا صنعت هذا بك فأطعني أنجك مما صنعت بك فاسجد لي سجدة فسجد فلما سجد له قال إني بريء منك إني أخاف الله رب العالمين فذلك قوله \"كمثل الشيطان إذ قال للإنسان اكفر فلما كفر قال إني بريء منك إني أخاف الله رب العالمين\". وقال ابن جرير حدثني يحيى بن إبراهيم المسعودي حدثنا أبي عن أبيه عن جده عن الأعمش عن عمارة عن عبدالرحمن بن زيد عن عبدالله بن مسعود في هذه الآية \"كمثل الشيطان إذ قال للإنسان اكفر فلما كفر قال إني بريء منك إني أخاف الله رب العالمين\" قال كانت امرأة ترعى الغنم وكان لها أربعة إخوة وكانت تأوي بالليل إلى صومعة راهب قال فنزل الراهب ففجر بها فحملت فأتاه الشيطان فقال له اقتلها ثم ادفنها فإنك رجل مصدق يسمع قولك فقتلها ثم دفنها قال فأتي الشيطان إخوتهـا في المنام فقال لهم إن الراهب صاحب الصومعة فجر بأختكم فلما أحبلها قتلها ثم دفنها في مكان كذا وكذا فلما أصبحوا قال رجل منهم والله لقد رأيت البارحة رؤيا ما أدرى أقصها عليكم أم أترك؟ قالوا لا بل قصها علينا قال فقصها فقال الآخر وأنا والله لقد رأيت ذلك فقال الآخر وأنا والله لقد رأيت ذلك قالوا فوالله ما هذا إلا لشيء قال فانطلقوا فاستعدوا ملكهم على ذلك الراهب فأتوه فأنزلوه ثم انطلقوا به فلقيه الشيطان فقال إني أنا الله الذي أوقعتك في هذا ولن ينجيك منه غيري فاسجد لي سجدة واحدة وأنجيك مما أوقعتك فيه قال فسجد له فلما أتوا به ملكهم تبرأ منه وأخـذ فقتل وكذا روى عن ابن عباس وطاوس ومقاتل بن حيان نحو ذلك واشتهـر عند كثير من الناس أن هذا العابد هو برصيصا فالله أعلم. وهذه القصة مخالفة لقصة جريج العابد فإن جريجا اتهمته امرأة بغي بنفسها وادعت أن حملها منه ورفعت أمرها إلى ولي الأمر فأمر به فأنزل من صومعته وخربت صومعته وهو يقول ما لكم ما لكم؟ قالوا يا عدو الله فعلت بهذه المرأة كذا وكذا فقال جريج اصبروا ثم أخذ ابنها وهو صغير جدا ثم قال يا غلام من أبوك؟ قال أبي الراعي وكانت قد أمكنته من نفسها فحملت منه فلما رأى بنو إسرائيل ذلك عظموه كلهم تعظيما بليغا وقالوا نعيد صومعتك من ذهب قال لا بل أعيدوها من طين كما كانت."
    },
    {
      "ayah": 17,
      "surah": 59,
      "text": "أي فكان عاقبة الآمر بالكفر والفاعل له ومصيرهما إلى نار جهنم خالدين فيها \"وذلك جزاء الظالمين\" أى جزاء كل ظالم."
    },
    {
      "ayah": 18,
      "surah": 59,
      "text": "قال الإمام أحمد حدثنا محمد بن جعفر حدثنا شعبة عن عون بن أبي جحيفة عن المنذر بن جرير عن أبيه قال: كنا عند رسول الله صلى الله عليه وسلم في صدر النهار قال فجاءه قوم حفاة عراة محتابي النمار أو العباء متقلدي السيوف عامتهم من مضر بل كلهم من مضر فتغير وجه رسول الله صلى الله عليه وسلم لما رأى بهم من الفاقة قال فدخل ثم خرج فأمر بلالا فأذن وأقام الصلاة فصلى ثم خطب فقال \"يا أيها الناس اتقوا ربكم الذي خلقكم من نفس واحدة\" إلى آخر الآية وقرأ الآية التي في الحشر \"ولتنظر نفس ما قدمت لغد\" تصدق رجل من ديناره من درهمه من ثوبه من صاع بره من صاع تمره- حتى قال ولو بشق تمرة\" قال فجاء رجل من الأنصار بصرة كادت كفه تعجز عنها بل قد عجزت ثم تتابع الناس حتى رأيت كومين من طعام وثياب حتى رأيت رسول الله صلى الله عليه وسلم يتهلل وجهه كأنه مذهبة فقال رسول الله صلى الله عليه وسلم \"من سن في الإسلام سنة حسنة فله أجرها وأجر من عمل بها بعده من غير أن ينقص من أجورهم شيء ومن سن في الإسلام سنة سيئة كان عليه وزرها ووزر من عمل بها من غير أن ينقص من أوزارهم شيء\" انفرد بإخراجه مسلم من حديث شعبه بإسناده مثله. فقوله تعالى \"يا أيها الذين آمنوا اتقوا الله\" أمر بتقواه وهو يشمل فعل ما به أمر وترك ما عنه زجر. وقوله تعالى \"ولتنظر نفس ما قدمت لغد\" أي حاسبوا أنفسكم قبل أن تحاسبوا وانظروا ماذا ادخرتم لأنفسكم من الأعمال الصالحة ليوم معادكم وعرضكم على ربكم \"واتقوا الله\" تأكيد ثان \"إن الله خبير بما تعملون\" أي اعلموا أنه عالم بجميع أعمالكم وأحوالكم لا تخفى عليه منكم خافية ولا يغيب عنه من أموركم جليل ولا حقير."
    },
    {
      "ayah": 19,
      "surah": 59,
      "text": "أي لا تنسوا ذكر الله تعالى فينسيكم العمل لمصالح أنفسكم التي تنفعكم في معادكم فإن الجزاء من جنس العمل ولهذا قال تعالى \"أولئك هم الفاسقون\" أي الخارجون عن طاعة الله الهالكون يوم القيامة الخاسرون يوم معادهم كما قال تعالى \"يا أيها الذين آمنوا لا تلهكم أموالكم ولا أولادكم عن ذكر الله ومن يفعل ذلك فأولئك هم الخاسرون\" وقال الحافظ أبو القاسم الطبراني حدثنا أحمد بن عبدالوهاب بن نجدة الحوطي حدثنا المغيرة حدثنا جرير بن عثمان عن نعيم بن نمحة قال كان في خطبة أبي بكر الصديق رضي الله عنه: أما تعلمون أنكم تغدون وتروحون لأجل معلوم؟ فمن استطاع أن يقضي الأجل وهو في عمل الله عز وجل فليفعل ولن تنالوا ذلك إلا بالله عز وجل إن قوما جعلوا آجالهم لغيرهم فنهاكم الله عز وجل أن تكونوا أمثالهم \"ولا تكونوا كالذين نسوا الله فأنساهم أنفسهم\" أين من تعرفون من إخوانكم؟ قدموا على ما قدموا في أيام سلفهم وخلوا بالشقوة والسعادة أين الجبارون الأولون الذين بنوا المدائن وحصنوها بالحوائط؟ قد صاروا تحت الصخر والآبار هذا كتاب الله لا تفنى عجائبه فاستضيئوا منه ليوم ظلمة واستضيئوا بسنائه وبيانه إن الله تعالى أثنى على زكريا وأهل بيته فقال تعالى \"إنهم كانوا يسارعون في الخيرات ويدعوننا غبا ورهبا وكانوا لنا خاشعين\" لا خير في قول لا يراد به وجه الله ولا خير في مال لا ينفق في سبيل الله ولا خير فيمن يغلب جهله حلمه ولا خير فيمن يخاف في الله لومة لائم. هذا إسناد جيد ورجاله كلهم ثقات. وشيخ جرير بن عثمان وهو نعيم بن نمحة لا أعرفه بنفي ولا إثبات غير أن أبا داود السجستاني قد حكم بأن شيوخ جرير كلهم ثقات وقد روى لهذه الخطبة شواهد من وجوه أخر والله أعلم."
    },
    {
      "ayah": 2,
      "surah": 59,
      "text": "قوله تعالى \"هو الذي أخرج الذين كفروا من أهل الكتاب\" يعني يهود بني النضير. قاله ابن عباس ومجاهد والزهري وغير واحد كان رسول الله صلى الله عليه وسلم لما قدم المدينة هادنهم وأعطاهم عهدا وذمة على أن لا يقاتلهم ولا يقاتلوه فنقضوا العهد الذي كان بينهم وبينه فأحل الله بهم بأسه الذي لا مرد له وأنزل عليهم قضاءه الذي لا يصد فأجلاهم النبي صلى الله عليه وسلم وأخرجهم من حصونهم الحصينة التي ما طمع فيها المسلمون وظنوا هم أنها مانعتهم من بأس الله فما أغنى عنهم من الله شيئا وجاءهم من الله ما لم يكن ببالهم وسيرهم رسول الله صلى الله عليه وسلم وأجلاهم من المدينة فكان منهم طائفة ذهبوا إلى أذرعات من أعالي الشام وهي أرض المحشر والمنشر ومنهم طائفة ذهبوا إلى خيبر وكان قد أنزلهم منها على أن لهم ما حملت إبلهم فكانوا يخربون ما في بيوتهم من المنقولات التي يمكن أن تحمل معهم ولهذا قال تعالى \"يخربون بيوتهم بأيديهم وأيدي المؤمنين فاعتبروا يا أولي الأبصار\" أي تفكروا في عاقبة من خالف أمر الله وخالف رسوله وكذب كتابه كيف يحل به من بأسه المخزي له في الدنيا مع ما يدخره له في الآخرة من العذاب الأليم قال أبو داود حدثنا محمد بن داود وسفيان حدثنا عبدالرزاق أخبرنا معمر عن الزهري عن عبدالرحمن بن كعب بن مالك عن رجل من أصحاب النبي صلى الله عليه وسلم أن كفار قريش كتبوا إلى ابن أبي ومن كان معه ممن يعبد الأوثان من الأوس والخزرج ورسول الله صلى الله عليه وسلم يومئذ بالمدينة قبل رجعة بدر إنكم أدنيتم صاحبنا وإنا نقسم بالله لنقاتلنه أو لنخرجكم أو لنسيرن إليكم بأجمعنا حتى نقتل مقاتلتكم ونسبي نساءكم فلما بلغ ذلك عبدالله بن أبي ومن كان معه من عبدة الأوثان أجمعوا لقتال النبي صلى الله عليه وسلم فلما بلغ ذلك النبي صلى الله عليه وسلم لقيهم فقال لقد بلغ وعيد قريش منكم المبالغ ما كانت تكيدكم بأكثر مما تريد أن تكيدوا به أنفسكم يريدون أن يقاتلوا أبناءكم وإخوانكم فلما سمعوا ذلك من النبي صلى الله عليه وسلم تفرقوا فبلغ ذلك كفار قريش فكتبت كفار قريش بعد وقعه بدر إلى اليهود إنكم أهل الحلقة والحصون وإنكم لتقاتلن مع صاحبنا أو لنفعلن كذا وكذا ولا يحول بيننا وبين خـدم نسائكم شيء وهو الخلاخيل فلما بلغ كتابهم النبي صلى الله عليه وسلم أيقنت بنو النضير بالغدر فأرسلوا إلى النبي صلى الله عليه وسلم اخرج إلينا في ثلاثين رجلا من أصحابك ليخرج منا ثلاثون حبرا حتى نلتقي بمكان النصف وليسمعوا منك فإن صدقوك وآمنوا بك آمنا بك فلما كان الغد غدا عليهم رسول الله صلى الله عليه وسلم بالكتائب فحصرهم فقال لهم\" إنكم والله لا تؤمنون عندي إلا بعهد تعاهدوني عليه\" فأبوا أن يعطوه عهدا فقاتلهم يومهم ذلك ثم غدا من الغد على بني قريظة بالكتائب وترك بني النضير ودعاهم إلى أن يعاهدوه فعاهدوه فانصرف عنهم وغدا إلى بني النضير بالكتائب فقاتلهم حتى نزلوا على الجلاء فجلت بنو النضير واحتملوا ما أقلت الإبل من أمتعتهم وأبواب بيوتهم وخشبها وكان نخل بني النضير لرسول الله صلى الله عليه وسلم خاصة أعطاه الله إياها وخصه بها فقال تعالى \"وما أفاء الله على رسوله منهم فما أوجفتم عليه من خيل ولا ركاب\" نقول بغير قتال فأعطى النبي صلى الله عليه وسلم أكثرها للمهاجرين قسمها بينهم وقسم منها لرجلين من الأنصار وكانا ذوي حاجة ولم يقسم من الأنصار غيرهما وبقي منها صدقة رسول الله صلى الله عليه وسلم التي في أيدي بني فاطمة ولنذكر ملخص غزوة بني النضير على وجه الاختصار والله المستعان. وكان سبب ذلك فيما ذكره أصحاب المغازي والسير أنه لما قتل أصحاب بئر معونة من أصحاب رسول الله صلى الله عليه وسلم رضي الله عنهم وكانوا سبعين وأفلت منهم عمرو بن أمية الضمري فلما كان في أثناء الطريق راجعا إلى المدينة قتل رجلين من بني عامر وكان معهما عهد من رسول الله صلى الله عليه وسلم وأمان لم يعلم به عمرو فلما رجع أخبر رسول الله صلى الله عليه وسلم فقال له رسول الله صلى الله عليه وسلم \"لقد قتلت رجلين لأدينهما\" وكان بين بني النضير وبني عامر حلف وعهد فخرج رسول الله صلى الله عليه وسلم إلى بني النضير ليستعينهم في دية ذينك الرجلين وكانت منازل بني النضير ظاهر المدينة على أميال منها شرقيها. قال محمد بن إسحاق بن يسار فى كتابه السيرة ثم خرج رسول الله إلى بني النضير يستعينهم فى دية ذينك القتيلين من بني عامر الذين قتلهما عمرو بن أمية الضمري للجوار الذي كان رسول الله صلى الله عليه وسلم عقد لهما فيمـا حدثني يزيد بن رومان وكان بين بني النضير وبني عامر عقد وحلف فلما أتاهم رسول الله صلى الله عليه وسلم يستعينهم في دية ذينك القتيلين قالوا نعم يا أبا القاسم نعينك على ما أحببت مما استعنت بنا عليه ثم خلا بعضهم ببعض فقالوا إنكم لن تجدوا الرجل على مثل حاله هذه - ورسول الله صلى الله عليه وسلم إلى جنب جدار من بيوتهم - فمن رجل يعلو على هذا البيت فيلقي عليه صخره فيريحنا منه؟ فانتدب لذلك عمرو بن جحاش بن كعب أحدهم فقال أنا لذلك فصعد ليلقي عليه صخرة كما قال ورسول الله صلى الله عليه وسلم في نفر من أصحابه فيهم أبو بكر وعمر وعلي رضي الله عنهم فأتى رسول الله صلى الله عليه وسلم الخبر من السماء بما أراد القوم فقام وخرج راجعا إلى المدينة فلما استلبث النبي صلى الله عليه وسلم أصحابه قاموا في طلبه فلقوا رجلا مقبلا من المدينة فسألوه عنه فقال رأيته داخلا المدينة فأقبل أصحاب رسول الله صلى الله عليه وسلم حتى انتهوا إليه فأخبرهم الخبر بما كانت يهود أرادت من الغدر به وأمر رسول الله صلى الله عليه وسلم بالتهيؤ لحربهم والمسير إلهم ثم سار حتى نزل بهم فتحصنوا منه في الحصون فأمر رسول الله صلى الله عليه وسلم بقطع النخل والتحريق فيها فنادوه أن يا محمد قد كنت تنهي عن الفساد في الأرض وتعيبه على من يصنعه فما بال قطع النخل وتحريقها؟ وقد كان رهط من بني عوف بن الخزرج منهم عبدالله بن أبي بن سلول ووديعة بن مالك بن أبي قوقل وسويد وداعس قد بعثوا إلى بني النضير أن اثبتوا وتمنعوا فإنا لن نسلمكم إن قوتلتم قاتلنا معكم وإن خرجتم خرجنا معكم فتربصوا ذلك من نصرهم فلم يفعلوا وقذف في قلوبهم الرعب فسألوا رسول الله صلى الله عليه وسلم أن يجليهم ويكف عن دمائهم على أن لهم ما حملت الإبل من أموالهم إلا الحلقة ففعل فاحتملوا من أموالهم ما استقلت به الإبل فكان الرجل منهم يهدم بيته عن إيجاف بابه فيضعه على ظهر بعيره فينطلق به فخرجوا إلى خيبر ومنهم من سار إلى الشام وخلوا الأموال إلى رسول الله صلى الله عليه وسلم فكانت لرسول الله خاصة يضعها حيث يشاء فقسمها على المهاجرين الأولين دون الأنصار إلا سهل بن حنيف وأبا دجانه سماك بن خرشة ذكرا فقرا فأعطاهما رسول الله صلى الله عليه وسلم قال ولم يسلم من بني النضير إلا رجلان يامين بن عمرو بن كعب عم عمرو بن جحاش وأبو سعد بن وهب أسلما على أموالهما فأحرزاها. قال ابن إسحاق قد حدثني بعض آل يامين أن رسول الله صلى الله عليه وسلم قال ليامين\" ألم تر ما لقيت من ابن عمك وما هم به من شأني\" فجعل يامين بن عمرو لرجل جعلا على أن يقتل عمرو بن جحاش فقتله فيما يزعمون. قال ابن إسحاق ونزل في بني النضر سورة الحشر بأسرها وهكذا روى يونس بن بكير عن ابن إسحاق بنحو ما تقدم فقوله تعالى \"هو الذي أخرج الذين كفروا من أهل الكتاب\" يعني بني النضير \"من ديارهم لأول الحشر\" قال ابن أبي حاتم حدثنا أبي حدثنا ابن أبي عمر حدثنا سفيان عن أبي سعد عن عكرمة عن ابن عباس قال: من شك في أن أرض المحشر ههنا يعني الشام فليقرأ هذه الآية \"هو الذي أخرج الذين كفروا من أهل الكتاب من ديارهم لأول الحشر\" قال لهم رسول الله صلى الله عليه وسلم\"اخرجوا\" قالوا إلى أين؟ قال \"إلى أرض المحشر\" وحدثنا أبو سعيد الأشج حدثنا أبو أسامة عن عوف عن الحسن قال لما أجلى رسول الله صلى الله عليه وسلم بني النضير قال \"هذا أول الحشر وأنا على الأثر\" ورواه ابن جرير عن بندار عن ابن أبي عدي عن عوف عن الحسن به. وقوله تعالى \"ما ظننتم أن يخرجوا\" أي في مدة حصاركم لهم وقصرها وكانت ستة أيام مع شده حصونهم ومنعتها ولهذا قال تعالى \"وظنوا أنهم مانعتهم حصونهم من الله فأتاهم الله من حيث لم يحتسبوا\" أي جاءهم من أمر الله ما لم يكن لهم في بال كما قال تعالى في الآية الأخرى \"قد مكر الذين من قبلهم فاتي الله بنيانهم من القواعد فخر عليهم السقف من فوقهم وأتاهم العذاب من حيث لا يشعرون\" وقوله تعالى \"وقذف في قلوبهم الرعب\" أي الخوف والهلع والجزع وكيف لا يحصل لهم ذلك وقد حاصرهم الذي نصر بالرعب مسيرة شهر صلوات الله وسلامه عليه. وقوله \"يخربون بيوتهم بأيدهم وأيدي المؤمنين\" قد تقدم تفسير ابن إسحاق لذلك وهو نقض ما استحسنوه من سقوفهم وأبوابهم وتحملها على الإبل وكذا قال عروه بن الزبير وعبدالرحمن بن زيد بن أسلم وغير واحد وقال مقاتل بن حيان كان رسول الله صلى الله عليه وسلم يقاتلهم فإذا ظهر على درب أو دار هدم حيطانها ليتسع المكان للقتال وكان اليهود إذا علوا مكانا أو غلبوا على درب أو دار نقبوا من أدبارها ثم حصنوها ودربوها يقول الله تعالى \"فاعتبروا يا أولي الأبصار\"."
    },
    {
      "ayah": 20,
      "surah": 59,
      "text": "أي لا يستوي هؤلاء وهؤلاء في حكم الله تعالى يوم القيامة كما قال تعالى \"أم حسب الذين اجترحوا السيئات أن نجعلهم كالذين آمنوا وعملوا الصالحات سواء محياهم ومماتهم ساء ما يحكمون\" وقال تعالى \"وما يستوي الأعمى والبصير والذين آمنوا وعملوا الصالحات ولا المسيء قليلا ما تتذكرون\" وقال تعالى \"أم نجعل الذين آمنوا وعملوا الصالحات كالمفسدين في الأرض أم نجعل المتقين كالفجار\" في آيات أخر دالات على أن الله تعالى يكرم الأبرار ويهين الفجار ولهذا قال تعالى ههنا \"أصحاب الجنة هم الفائزون\" أي الناجون المسلمون من عذاب الله عز وجل."
    },
    {
      "ayah": 21,
      "surah": 59,
      "text": "يقول تعالى معظما لأمر القرآن ومبينا علو قدره وأنه ينبغي وأن تخشع له القلوب وتتصدع عند سماعه لما فيه من الوعد الحق والوعيد الأكيد \"لو أنزلنا هذا القرآن على جبل لرأيته خاشعا متصدعا من خشية الله\" أي فإذا كان الجبل في غلظته وقساوته لو فهم هذا القرآن فتدبر ما فيه لخشع وتصدق من خوف الله عز وجل فكيف يليق بكم يا أيها البشر أن لا تلين قلوبكم وتخشع وتتصدع من خشية الله وقد فهمتم عن الله أمره وتدبرتم كتابه ولهذا قال تعالى \"وتلك الأمثال نضربها للناس لعلهم يتفكرون\" قال العوفي عن ابن عباس في قوله تعالى \"لو أنزلنا هذا القرآن على جبل لرأيته خاشعا متصدعا\" إلى آخرها يقول لو أني أنزلت هذا القران على جبل حملته إياه لتصدع وخشع من ثقله ومن خشية الله فأمر الله الناس إذا نزل عليهم القرآن أن يأخذوه بالخشية الشديدة والتخشع ثم قال تعالى \"وتلك الأمثال نضربها للناس لعلهم يتفكرون\" وكذا قال قتادة وابن جرير. وقد ثبت في الحديث المتواتر أن رسول الله صلى الله عليه وسلم لما عمل له المنبر وقد كان يوم الخطبة يقف إلى جانب جذع من جذوع المسجد فلما وضع المنبر أول ما وضع وجاء النبي صلى الله عليه وسلم ليخطب فجاوز الجذع إلى نحو المنبر فعند ذلك حن الجـذع وجعل يئن كما يئن الصبي الذي يسكت لما كان يسمع من الذكر والوحي عنده ففي بعض روايات هذا الحديث قال الحسن البصري بعد إيراده فأنتم أحق أن تشتاقوا إلى رسول الله صلى الله عليه وسلم من الجذع وهكذا هذه الآية الكريمة إذا كانت الجبال الصم لو سمعت كلام الله وفهمته لخشعت وتصدعت من خشيته فكيف بكم وقد سمعتم وفهمتم؟ وقد قال تعالى \"ولو أن قرآنا سيرت به الجبال أو قطعت به الأرض أو كلم به الموتى\" الآية وقد تقدم أن معنى ذلك أي لكان هذا القرآن وقد قال تعالى \"وإن من الحجارة لما يتفجر منه الأنهار وإن منها لما يشقق فيخرج منه الماء وإن منها لما يهبط من خشية الله\"."
    },
    {
      "ayah": 22,
      "surah": 59,
      "text": "أخبر تعالى أنه الذي لا إله إلا هو فلا رب غيره ولا إله للوجود سواه وكل ما يعبد من دونه فباطل وأنه \"عالم الغيب والشهادة\" أي يعلم جميع الكائنات المشاهدات لنا والغائبات عنا فلا يخفى عليه شيء في الأرض ولا في السماء من جليل وحقير وصغير وكبير حتى الذر في الظلمات وقوله تعالى \"هو الرحمن الرحيم\" المراد أنه ذو الرحمة الواسعة الشاملة لجميع المخلوقات فهو رحمن الدنيا والآخرة ورحيمهما وقد قال تعالى \"ورحمتي وسعت كل شيء\" وقال تعالى \"كتب ربكم على نفسه الرحمة\" وقال تعالى \"قل بفضل الله وبرحمته فبذلك فليفرحوا هو خير مما يجمعون\"."
    },
    {
      "ayah": 23,
      "surah": 59,
      "text": "قال تعالى \"هو الله الذي لا إله إلا هو الملك\" أى المالك لجميع الأشياء المتصرف فيها بلا ممانعة ولا مدافعة وقوله تعالى \"القدوس\" قال وهب بن منبه أى الطاهر وقال مجاهد وقتادة أي المبارك وقال ابن جريج تقدسة الملائكة الكرام \"السلام\" أي من جميع العيوب والنقائص لكماله في ذاته وصفاته وأفعاله وقوله تعالى \"المؤمن\" قال الضحاك عن ابن عباس أي أمن خلقه من أن يظلمهم وقال قتادة أمن بقوله أنه حق وقال ابن زيد صدق عباده المؤمنين في إيمانهم به. وقوله تعالى \"المهيمن\" قال ابن عباس وغير واحد أي الشاهد على خلقه بأعمالهم بمعنى هو رقيب عليهم كقوله \"والله على كل شيء شهيد\" وقوله \"ثم الله شهيد على ما يفعلون\" وقوله \"أفمن هو قائم على كل نفس بما كسبت\" الآية. وقوله تعالى \"العزيز\" أى الذي قد عز كل شىء فقهره وغلب الأشياء فلا ينال جنابه لعزته وعظمته وجبروته وكبريائه ولهذا قال تعالى \"الجبار المتكبر\" أي الذي لا تليق الجبرية إلا له ولا التكبر إلا لعظمته كما تقدم في الصحيح \"العظمة إزاري والكبرياء ردائي فمن نازعني واحدا منهما عذبته\" وقال قتادة: الجبار الذي جبر خلقه على ما يشاء وقال ابن جرير: الجبار المصلح أمور خلقه المتصرف فيهم بما فيه صلاحهم وقال قتادة المتكبر يعني عن كل سوء ثم قال تعالى \"سبحان الله عما يشركون\"."
    },
    {
      "ayah": 24,
      "surah": 59,
      "text": "قوله تعالى \"هو الله الخالق البارئ المصور\" الخلق التقدير والبرء هو الفري وهو التنفيذ وإبراز ما قدره وقرره إلى الوجود وليس كل من قدر شيئا ورتبه يقدر على تنفيذه وإيجاده سوى الله عز وجل قال الشاعر يمدح آخر: ولأنت تفري ماخلقت وبعض القوم يخلق ثم لا يفري أي أنت تنفذ ما خلقت أي قدرت بخلاف غيرك فإنه لا يستطيع ما يريد فالخلق التقدير والفري التنفيذ ومنه يقال قدر الجلاد ثم فرى أي قطع على ما قدره بحسب ما يريده. وقوله تعالى \"الخالق البارئ المصور\" أي الذي إذا أراد شيئا قال له كن فيكون على الصفة التي يريد الصورة التي يختار كقوله تعالى \"في أي صورة ما شاء ركبك\" ولهذا قال المصور أي الذي ينفذ ما يريد إيجاده على الصفة التي يريدها وقوله تعالى \"له الأسماء الحسنى \"نذكر الحديث المروي في الصحيحين عن أبي هريرة عن رسول الله صلى الله عليه وسلم \"إن لله تعالى تسعة وتسعين اسما مائة إلا واحدا من أحصاها دخل الجنة وهو وتر يحب الوتر\" وتقدم سياق الترمذي وابن ماجه له عن أبي هريرة أيضا وزاد بعد قوله: وهو وتر يحب الوتر واللفظ للترمذي \"هو الله الذي لا إله إلا هو الرحمن الرحيم الملك القدوس السلام المؤمن المهيمن العزيز الجبار المتكبر الخالق البارئ المصور الغفار القهار الوهاب الرزاق الفتاح العليم القابض الباسط الخافض الرافع المعز المذل السميع البصير الحكم العدل اللطيف الخبير الحليم العظيم الغفور الشكور العلي الكبير الحفيظ المقيت الحسيب الجليل الكريم الرقيب المجيب الواسع الحكيم الودود المجيد الباعث الشهيد الحق الوكيل القوي المتين الولي الحميد المحصي المبدئ المعيد المحيي المميت الحي القيوم الواجد الماجد الواحد الصمد القادر المقتدر المقدم المؤخر الأول الآخر الظاهر الباطن الوالي المتعالي البر التواب المنتقم العفو الرؤوف مالك الملك ذو الجلال والإكرام المقسط الجامع الغني المغني المعطي المانع الضار النافع النور الهادي البديع الباقي الوارث الرشيد الصبور\" وقوله تعالى \"يسبح له ما في السموات والأرض\" كقوله تعالى \"تسبح له السموات السبع والأرض ومن فيهن وإن من شيء إلا يسبح بحمده ولكن لا تفقهون تسبيحهم إنه كان حليما غفورا\" وقوله تعالى \"وهو العزيز\" أي فلا يرام جنابه \"الحكيم\" في شرعه وقدره وقد قال الإمام أحمد حدثنا أبو أحمد الزبيري حدثنا خالد يعني ابن طهمان أبو العلاء الخفاف حدثنا نافع بن أبي نافع عن معقل بن يسار عن النبي صلى الله عليه وسلم قال \"من قال حين يصبح ثلات مرات أعوذ بالله السميع العليم من الشيطان الرجيم ثم قرأ ثلاث آيات من آخر سورة الحشر وكل الله به سبعين ألف ملك يصلون عليه حتى يمسي وإن مات في ذلك اليوم مات شهيدا ومن قالها حين يمسي كان بتلك المنزلة\" ورواه الترمذي عن محمود بن غيلان عن أبي أحمد الزبيري به وقال غريب لا نعرفه إلا من هذا الوجه. آخر تفسير سورة الحشر ولله الحمد والمنة."
    },
    {
      "ayah": 3,
      "surah": 59,
      "text": "وقوله \"ولولا أن كتب الله عليهم الجلاء لعذبهم في الدنيا\" أي لولا أن كتب الله عليهم هذا الجلاء وهو النفي من ديارهم وأموالهم لكان لهم عند الله عذاب أخر من القتل والسبي ونحو ذلك قاله الزهري عن عروة والسدي وابن زيد لأن الله قد كتب عليهم أنه سيعذبهم في الدار الدنيا مع ما أعد لهم في الدار الآخرة من العذاب في نار جهنم. قال ابن أبي حاتم حدثنا أبي حدثنا عبدالله بن صالح كاتب الليث حدثني الليث عن عقيل عن ابن شهاب قال أخبرني عروة بن الزبير قال ثم كانت وقعة بني النضير وهم طائفة من اليهود على رأس ستة أشهر من وقعة بدر وكان منزلهم بناحية من المدينة فحاصرهم رسول الله صلى الله عليه وسلم حتى نزلوا من الجلاء وأن لهم ما أقلت الإبل من الأموال والأمتعة إلا الحلقة وهي السلاح فأجلاهم رسول الله صلى الله عليه وسلم قبل الشام قال والجلاء أنه كتب عليهم في آي من التوراة وكانوا من سبط لم يصبهم الجلاء قبل ما سلط عليهم رسول الله صلى الله عليه وسلم وأنزل الله فيهم \"سبح لله ما في السموات وما في الأرض\" إلى قوله \"وليخزي الفاسقين\" وقال عكرمة الجلاء القتل وفي رواية عنه الفناء وقال قتادة الجلاء خروج الناس من البلد إلى البلد وقال الضحاك أجلاهم إلى الشام وأعطى كل ثلاثة بعيرا وسقاء فهدا الجلاء. وقد قال الحافظ أبو بكر البيهقي أخبرنا أبو عبدالله الحافظ أخبرنا أحمد بن كامل القاضي حدثنا محمد بن سعيد العوفي حدثني أبي عن عمي حدثني أبي عن جدي عن ابن عباس قال كان النبي صلى الله عليه وسلم قد حاصرهم حتى بلغ منهم كل مبلغ فأعطوه ما أراد منهم فصالحهم على أن يحقن لهم دمائهم وأن يخرجهم من أرضهم ومن ديارهم وأوطانهم وأن يسيرهم إلى أذرعات الشام وجعل لكل ثلاثة منهم بعيرا وسقاء والجلاء إخراجهم من أرضهم إلى أرض أخرى وروى أيضا من حديث يعقوب بن محمد الزهري عن إبراهيم بن جعفر عن محمود بن محمد بن مسلمة عن أبيه عن جده عن محمد بن مسلمة أن رسول الله صلى الله عليه وسلم بعثه إلى بني النضير وأمره أن يؤجلهم في الجلاء ثلاثة أيام وقوله تعالى \"ولهم في الآخرة عذاب النار\" أي حتم لازم لابد لهم منه."
    },
    {
      "ayah": 4,
      "surah": 59,
      "text": "أي إنما فعل الله بهم ذلك وسلط عليهم رسوله وعباده المؤمنين لأنهم خالفوا الله ورسوله وكذبوا بما أنزله الله على رسله المتقدمين في البشارة بمحمد صلى الله عليه وسلم وهم يعرفون ذلك كما يعرفون أبناءهم ثم قال \"ومن يشاق الله فإن الله شديد العقاب\"."
    },
    {
      "ayah": 5,
      "surah": 59,
      "text": "اللين نوع من التمر وهو جيد. قال أبو عبيدة وهو ما خالف العجوة والبرني من التمر وقال كثيرون من المفسرين اللينة ألوان التمر سوى العجوة. قال ابن جرير هو جميع النخل ونقله عن مجاهد وهو البويرة أيضا وذلك أن رسول الله صلى الله عليه وسلم لما حاصرهم أمر بقطع نخيلهم إهانه لهم وإرهابا وإرعابا لقلوبهم فروى محمد بن إسحاق عن يزيد بن رومان وقتادة ومقاتل بن حيان أنهم قالوا فبعث بنو قريظة يقولون لرسول الله صلى الله عليه وسلم إنك تنهي عن الفساد فما بالك تأمر بقطع الأشجار؟ فأنزل الله هذه الآية الكريمة أي \"ما قطعتم من لينة\" وما تركتم من الأشجار فالجميع بإذنه ومشيئته وقدره ورضـاه وفيه نكاية بالعدو وخزي لهم وإرغام لأنوفهم وقال مجاهد نهى بعض المهاجرين بعضا عن قطع النخل وقالوا إنما هي مغانم المسلمين فنزل القرآن بتصديق من نهى عن قطعه وتحليل من قطعه من الإثم وإنما قطعه وتركه بإذنه وقد روى نحو هذا مرفوعا فقال النسائي أخبرنا الحسن بن محمد بن عفان حدثنا حفص بن غياث حدثنا حبيب بن أبي عمرة عن سعيد بن جبير عن ابن عباس في قوله \"ما قطعتم من لينة أو تركتموها قائمة على أصولها فبإذن الله وليخزي الفاسقين\" قال يستنزلونهم من حصونهم وأمروا بقطع النخل فحاك في صدورهم فقال المسلمون: قطعنا بعضا وتركنا بعضا فلنسألن رسول الله صلى الله عليه وسلم هل لنا فيما قطعنا من أجر؟ وهل علينا فيما تركنا من وزر؟ فأنزل الله \"ما قطعتم من لينة\" وقال الحافظ يعلى في مسنده حدثنا سفيان بن وكيع حدثنا حفص عن ابن جريج عن سليمان بن موسى عن جابر وعن أبي الزبير عن جابر قال رخص لهم في قطع النخل ثم شدد عليهم فأتوا النبي صلى الله عليه وسلم فقالوا يا رسول الله علينا إثم فيما قطعنا أو علينا وزر فيما تركنا؟ فأنزل الله عز وجل \"ما قطعتم من لينة أو تركتموها قائمة على أصولها فبإذن الله\" وقال الإمام أحمد حدثنا عبدالرحمن حدثنا سفيان عن موسى بن عقبة عن نافع عن ابن عمر أن رسول الله صلى الله عليه وسلم قطع نخل بني النضير وحرق وأخرجه صاحبا الصحيح من رواية موسى بن عقبة بنحوه ولفظ البخاري من طريق عبدالرزاق عن ابن جريج عن موسى بن عقبة عن نافع عن ابن عمر قال حاربت النضير وقريظة فأجلى بني النضير وأقر قريظة ومن عليهم حتى حارب قريظة فقتل من رجالهم وسبى وقسم نساءهم وأولادهم وأموالهم بين المسلمين إلا بعضهم لحقوا بالنبي صلى الله عليه وسلم فأمنهم وأسلموا وأجلى يهود المدينة كلهم بني قينقاع وهم رهط عبدالله بن سلام ويهود بني حارثة وكل يهود بالمدينة ولهما أيضا عن قتيبة عن الليث بن سعد عن نافع عن ابن عمر أن رسول الله صلى الله عليه وسلم حرق نخل بني النضير وقطع وهي البويرة فأنزل الله عز وجل فيه \"ما قطعتم من لينة أو تركتموها قائمة على أصولها فبإذن الله وليخزى الفاسقين\". وللبخاري رحمه الله من رواية جويرية بن أسماء عن نافع عن ابن عمر رضي الله عنهما أن رسول الله صلى الله عليه وسلم حرق نخل بني النضير وقطع وهي البويرة ولها يقول حسان بن ثابت رضي الله عنه وهان على سراة بني لؤي حريق بالبويرة مستطير فأجابه أبو سفيان بن الحارث يقول: أدام الله ذلك من صنيع وحرق في نواحيهـا السعير ستعلم أينا منها بنزه وتعلم أي أرضينا نضير كذا رواه البخاري ولم يذكره ابن إسحاق وقال محمد بن إسحاق وقال كعب بن مالك يذكر إجلاء بني النضير وقتل ابن الأشرف لقد خـزيت بغدرتها الحبور كذاك الدهر ذو صرف يدور وذلك أنهـم كفروا برب عظيم أمره أمر كبير وقد أوتوا معا فهما وعلما وجاءهمو من الله النذير نذير صادق أدى كتابا وآيات مبينة تنير فقالوا ما أتيت بأمر صدق وأنت بمنكر منا جدير فقال بلى لقد أديت حقا يصدقني به الفهـم الخبير فمن يتبعه يهد لكل رشد ومن يكفر به يجز الكفور فلما أشربوا غدرا وكفرا وجد بهـم عن الحق النفور أرى الله النبي برأي صدق وكان الله يحكم لا يجور فأيده وسلطه عليهم وكان نصيره نعم النصير فغودر منهمو كعب صريعا فذلت بعد مصرعة النضير على الكفين ثم وقد علته بأيدينا مشهرة ذكور بأمر محمد إذ دس ليلا إلى كعب أخا كعـب يسير فماكره فأنزله بمكر ومحمود أخو ثقـة جسور فتلك بنوا النضير بدار سوء أبادهمو بما اجترمالمبير غداة أتاهمو في الزحف زهوا رسول الله وهو بهم بصير وغسان الحماة موازروه على الأعداء وهو لهم وزير فقال السلم ويحكمو فصدوا وخالف أمرهم كذب وزور فذاقوا غب أمرهمو وبالا لكل ثلاثة منهم بعير وأجلوا عامدين لقينقاع وغودر منهمو نخل ودور قال وكان مما قيل من الأشعار في بني النضير قول ابن القيم العبسي ويقال قالها قيس بن بحر بن طريف قال ابن هشام الأشجعي: اهلي فداء لامريء غير هالك أجلى اليهود بالحسى المزنم يقيلون في حمر العضاه وبدلوا أهيضب عوذا بالودى المكمم فإن يك ظني صادقا بمحمد يروا خيله بين الصلا ويرمرم ش يؤم بها عمرو بن بهثة إنهم عدو وما حي صديق كمجرم عليهن أبطال مساعير في الوغى يهزون أطراف الوشيج المقوم وكل رقيق الشفرتين مهند تورث من أزمان عاد وجرهم فمن مبلغ عني قريشا رسالة فهل بعدهم في المجد من متكرم بأن أخاكم فاعلمن محمدا تليد الندى بين الحجون وزمزم فدينوا له بالحق تحسم أموركم وتسموا من الدنيا إلى كل معظم نبي تلاقته من الله رحمة ولا تسألوه أمر غيب مرجم فقد كان في بدر لعمري عبرة لكم يا قريش والقـليـب الملمم غداة أتى قي الخزرجيه عامدا إليكم مطيعا للعظيم المكرم معانا بروح القدس ينكي عدوه رسولا من الرحمن حقا بمعلم رسولا من الرحمن يتلو كتابه فلما أنار الحق لم يتلعثم أرى أمره يزداد في كل موطن علوا لأمر حمه الله محكم وقد أورد ابن إسحاق رحمه الله ههنا أشعارا كثيرة فيها آداب ومواعظ وحكم وتفاصيل للقصة تركنا باقيها اختصارا واكتفاء بما ذكرناه ولله الحمد والمنة. قال ابن إسحاق كانت وقعة بني النضير بعد وقعة أحد وبعد بئر معونه وحكى البخاري عن الزهري عن عروة أنه قال كانت وقعة بني النضير بعد بدر بستة أشهر."
    },
    {
      "ayah": 6,
      "surah": 59,
      "text": "يقول تعالى مبينا ما الفيء وما صفته وما حكمه فالفيء كل مال أخذ من الكفار من غير قتال ولا إيجاف خيل ولا ركاب كأموال بني النضير هذه فإنها مما لم يوجف المسلمون عليه بخيل ولا ركاب أي لم يقاتلوا الأعداء فيها بالمبارزة والمصاولة بل نزل أولئك من الرعب الذي ألقى الله في قلوبهم من هيبة رسول الله صلى الله عليه وسلم فأفاءه الله على رسوله ولهذا تصرف فيه كما يشاء فرده على المسلمين في وجوه البر والمصالح التي ذكرها الله عز وجل في هذه الآيات فقال تعالى \"وما أفاء الله على رسوله منهم\" أي من بني النضير \"فما أوجفتم عليه من خيل ولا ركاب\" يعني الإبل \"ولكن الله يسلط رسله على من يشاء والله على كل شيء قدير\" أي هو قدير لا يغالب ولا يمانع بل هو القاهر لكل شيء."
    },
    {
      "ayah": 7,
      "surah": 59,
      "text": "قال تعالى \"ما أفاء الله على رسوله من أهل القرى\" أي جميع البلدان التي تفتح هكذا فحكمها حكم أموال بني النضير ولهذا قال تعالى \"فلله وللرسول ولذي القربى واليتامى والمساكين وابن السبيل\" إلى آخرها والتي بعدها فهذه مصارف أموال الفيء ووجوهه. قال الإمام أحمد حدثنا سفيان عن عمرو ومعمر عن الزهري عن مالك بن أوس بن الحدثان عن عمر رضي الله عنه قال: كانت أموال بني النضير مما أفاء الله إلى رسوله مما لم يوجف المسلمون عليه بخيل ولا ركاب فكانت لرسول الله صلى الله عليه وسلم خالصة فكان ينفق على أهله منها نفقة سنته وقال مرة قوت سنته وما بقي جعله في الكراع والسلاح في سبيل الله عز وجل هكذا أخرجه أحمد ههنا مختصرا وقد أخرجه الجماعة في كتبهم إلا ابن ماجه من حديث سفيان عن عمرو بن دينار عن الزهري به وقد رويناه مطولا وقال أبو داود رحمه الله حدثنا الحسن بن على ومحمد بن يحيى بن فارس المعنى واحد قالا حدثنا بشر بن عمرو الزهراني حدثني مالك بن أنس عن ابن شهاب عن مالك بن أوس قال أرسل إلي عمر بن الخطاب رضي الله عنه حين تعالى النهار فجئته فوجدته جالسا على سرير مفضيا إلى رماله فقال حين دخلت عليه: يا مال إنه قد دف أهل أبيات من قومك وقد أمرت فيهم بشيء فاقسم فيهم قلت لو أمرت غيري بذلك فقال خذه فجاءه يرفأ فقال يا أمير المؤمنين هل لك في عثمان بن عفان وعبدالرحمن بن عوف والزبير بن العوام وسعد بن أبي وقاص؟ قال نعم فأذن لهم فدخلوا ثم جاءه يرفأ فقال يا أمير المؤمنين هل لك في العباس وعلي؟ قال نعم فأذن لهما فدخلا فقال العباس يا أمير المؤمنين أقض بيني وبين هذا يعني عليا فقال بعضهم أجل يا أمير المؤمنين اقض بينهما وأرحهما قال مالك بن أوس خيل إلي أنهما قدما أولئك النفر لذلك فقال عمر رضي الله عنه اتئد ثم أقبل على أولئك الرهط فقال: أنشدكم بالله الذي بإذنه تقوم السماء والأرض هل تعلمون أن رسول الله صلى الله عليه وسلم قال \"لا نورث ما تركنا صدقة\" قالوا نعم ثم أقبل على علي والعباس فقال أنشدكما بالله الذي بإذنه تقوم السماء والأرض هل تعلمان أن رسول الله صلى الله عليه وسلم قال \"لا نورث ما تركنا صدقة\" فقالا نعم فقال إن الله خص رسوله بخاصة لم يخص بها أحدا من الناس قال تعالى \"وما أفاء الله على رسوله منهم فما أوجفتم عليه من خيل ولا ركاب ولكن الله يسلط رسله على من يشاء والله على كل شيء قدير\" فكان الله تعالى أفاء إلى رسوله أموال بني النضير فوالله ما استأثر بها عليكم ولا أحرزها دونكم فكان رسول الله صلى الله عليه وسلم يأخذ منها نفقة سنة أو نفقته ونفقة أهله سنة ويجعل ما بقي أسوة المال ثم أقبل على أولئك الرهط فقال: أنشدكم بالله الذي بإذنه تقوم السماء والأرض هل تعلمون ذلك؟ قالوا نعم ثم أقبل على علي والعباس فقال أنشدكما بالله الذي بإذنه تقوم السماء والأرض هل تعلمان ذلك؟ قالا نعم فلما توفي رسول الله صلى الله عليه وسلم قال أبو بكر أنا ولي رسول الله صلى الله عليه وسلم فجئت أنت وهذا إلى أبي بكر تطلب أنت ميراثك عن ابن أخيك ويطلب هذا ميراث امرأته من أبيها فقال أبو بكر رضي الله عنه قال رسول الله صلى الله عليه وسلم \"لا نورث ما تركنا صدقة\" والله يعلم إنه لصادق بار راشد تابع للحق فوليها أبو بكر فلما توفي قلت أنا ولي رسول الله صلى الله عليه وسلم وولي أبو بكر فوليتها ما شاء الله أن أليها فجئت أنت وهذا وأنتما جميع وأمركما واحد فسألتمانيها فقلت إن شئتما فأنا أدفعها إليكما على أن عليكما عهد الله أن تلياها بالذي كان رسول الله صلى الله عليه وسلم يليها فأخذتماها مني على ذلك ثم جئتماني لأقضي بينكما بغير ذلك والله لا أقضي بينكما بغير ذلك حتى تقوم الساعة فإن عجزتما عنها فرداها إلي أخرجوه من حديث الزهري به. قال الإمام أحمد حدثنا عارم وعفان قالا أخبرنا معمر سمعت أبي يقول حدثنا أنس ابن مالك عن رسول الله صلى الله عليه وسلم قال إن الرجل كان يجعل من ماله النخلات أو كما شاء الله حتى فتحت عليه قريظة والنضير قال فجعل يرد بعد ذلك قال وإن أهلي أمروني أن آتي النبي صلى الله عليه وسلم فأسأله الذي كان أهله أعطوه أو بعضه وكان نبي الله صلى الله عليه وسلم قد أعطاه أم أيمن أو كما شاء الله قال فسألت النبي صلى الله عليه وسلم فأعطانيهن فجاءت أم أيمن فجعلت الثوب في عنقي وجعلت تقول كلا والله الذي لا إله إلا هو لا يعطيكهن وقد أعطانيهن أو كما قالت فقال نبي الله \"لك كذا وكذا\" قال: وتقول كلا والله قال ويقول \"لك كذا وكذا\" قال: وتقول كلا والله قال: ويقول \"لك كذا وكذا\" قال حتى أعطاها حسبت أنه قال عشرة أمثاله أو قال قريبا من عشرة أمثاله أو كما قال. رواه البخاري ومسلم من طرق عن معمر به وهذه المصارف المذكورة في هذه الآية هي المصارف المذكورة في خمس الغنيمة وقد قدمنا الكلام عليها في سورة الأنفال بما أغنى عن إعادته ههنا ولله الحمد وقوله تعالى \"كيلا يكون دوله بين الأغنياء منكم\" أي جعلنا هذه المصارف لمال الفيء كيلا يبقى مأكلة يتغلب عليها الأغنياء ويتصرفون فيها بمحض الشهوات والآراء ولا يصرفون منه شيئا إلى الفقراء وقوله تعالى \"وما آتاكم الرسول فخذوه وما نهاكم عنه فانتهوا\" أي مهما أمركم به فافعلوه ومهما نهاكم عنه فاجتنبوه فإنه إنما يأمر بخير وإنما ينهي عن شر قال ابن أبي حائم حدثنا يحيى بن أبي طالب حدثنا عبدالوهاب حدثنا سعيد عن قتادة عن الحسن العوفي عن يحيى بن الجزار عن مسروق قال جاءت امرأة إلى ابن مسعود فقالت بلغني أنك تنهي عن الواشمة والواصلة أشيء وجدته في كتاب الله تعالى أو عن رسول الله صلى الله عليه وسلم؟ قال بلى شيء وجدته في كتاب الله وعن رسول الله صلى الله عليه وسلم قالت والله لقد تصفحت ما بين دفتي المصحف فما وجدت فيه الذي تقول قال فما وجدت \"وما أتاكم الرسول فخذوه وما نهاكم عنه فانتهوا\" قالت بلى قال فإني سمعت رسول الله صلى الله عليه وسلم ينهى عن الواصلة والواشمة والنامصة قالت فلعله في بعض أهلك قال فادخلي فانظري فدخلت فنظرت ثم خرجت قالت ما رأيت بأسا فقال لها أما حفظت وصية العبد الصالح \"وما أريد أن أخالفكم إلى ما أنهاكم عنه\" وقال الإمام أحمد حدثنا عبدالرحمن حدثنا سفيان عن منصور عن علقمة عن عبدالله هو ابن مسعود قال: لعن الله الواشمات والمستوشمات والمتنمصات والمتفلجات للحسن المغيرات خلق الله عز وجل قال فبلغ امرأة من بني أسد في البيت يقال لها أم يعقوب فجاءت إليه فقالت بلغنى أنك قلت كيت وكيت قال ما لى لا ألعن من لعن رسول الله صلى الله عليه وسلم وفي كتاب الله تعالى فقالت إني لأقرأ ما بين لوحيه فما وجدته فقال إن كنت قرأتيه فقد وجدتيه أما قرأت \"وما آتاكم الرسول فخذوه وما نهاكم عنه فانتهوا\" قالت بلى قال فإن رسول الله صلى الله عليه وسلم نهى عنه قالت إني لأظن أهلك يفعلونه قال اذهبي فانظري فذهبت فلم تر من حاجتها شيئا فجاءت فقالت ما رأيت شيئا قال لو كان كذا لم تجامعنا. أخرجاه في الصحيحين من حديث سفيان الثوري وقد ثبت في الصحيحين أيضا عن أبي هريرة أن رسول الله صلى الله عليه وسلم قال \"إذا أمرتكم بأمر فأتوا منه ما استطعتم وما نهيتكم عنه فاجتنبوه\" وقال النسائي أخبرنا أحمد بن سعيد حدثنا يزيد حدثنا منصور بن حيان عن سعيد بن جبير عن عمر وابن عباس أنهما شهدا على رسول الله صلى الله عليه وسلم أنه نهى عن الدباء والحنتم والنقير والمزفت ثم تلا رسول الله صلى الله عليه وسلم \"وما آتاكم الرسول فخذوه وما نهاكم عنه فانتهوا\" وقوله تعالى \"واتقوا الله إن الله شديد العقاب\" أي اتقوه فى امتثال أوامره وترك زواجره فإنه شديد العقاب لمن عصاه وخالف أمره وأباه وارتكب ما عنه زجره ونهاه."
    },
    {
      "ayah": 8,
      "surah": 59,
      "text": "يقول تعالى مبينا حال الفقراء المستحقين لمال الفيء أنهم \"الذين أخرجوا من ديارهم وأموالهم يبتغون فضلا من الله ورضوانا\" أي خرجوا من ديارهم وخالفوا قومهم ابتغاء مرضاة الله ورضوانه \"وينصرون الله ورسوله أولئك هم الصادقون\" أي هؤلاء الذين صدقوا قولهم بفعلهم وهؤلاء هم سادات المهاجرين."
    },
    {
      "ayah": 9,
      "surah": 59,
      "text": "قال تعالى مادحا للأنصار ومبينا فضلهم وشرفهم وكرمهم وعدم حسدهم وإيثارهم مع الحاجة \"والذين تبوءوا الدار والإيمان من قبلهم\" أى سكنوا دار الهجرة من قبل المهاجرين وآمنوا قبل كثير منهم قال عمر: وأوصى الخليفة بعدي بالمهاجرين الأولين أن يعرف لهم حقهم ويحفظ لهم كرامتهم وأوصيه بالأنصار خيرا الذين تبوءوا الدار والإيمان من قبل أن يقبل من محسنهم وأن يعفو عن مسيئهم رواه البخاري ههنا أيضا وقوله تعالى \"يحبون من هاجر إليهم\" أي من كرمهم وشرف أنفسهم يحبون المهاجرين ويواسونهم بأموالهم قال الإمام أحمد حدثنا يزيد حدثنا حميد عن أنس قال: قال المهاجرون يا رسول الله ما رأينا مثل قوم قدمنا عليهم أحسن مواساة في قليل ولا أحسن بذلا في كثير لقد كفونا المؤنة وأشركونا فى المهنأ حتى لقد خشينا أن يذهبوا بالأجر كله قال \"لا ما أثنيتم عليهم ودعوتم الله لهم\" لم أره في الكتب من هذا الوجه. وقال البخاري حدثنا عبدالله بن محمد حدثنا سفيان عن يحيى بن سعيد سمع أنس بن مالك حين خرج معه إلى الوليد قال دعا النبي صلى الله عليه وسلم الأنصار أن يقطع لهم البحرين قالوا لا إلا أن تقطع لإخواننا من المهاجرين مثلها قال \"إما لا فاصبروا حتى تلقوني فإنه سيصيبكم أثرة\" تفرد به البخاري من هذا الوجه قال البخاري حدثنا الحكم بن نافع أخبرنا شعيب حدثنا أبو الزناد عن الأعرج عن أبي هريرة قال: قالت الأنصار اقسم بيننا وبين إخواننا النخيل قال لا قالوا أتكفونا المؤنة ونشرككم في الثمرة قالوا سمعنا وأطعنا تفرد به دون مسلم. \"ولا يجدون في صدورهم حاجة مما أوتوا\" أي ولا يجدون في أنفسهم حسدا للمهاجرين فيما فضلهم الله به من المنزلة والشرف والتقديم في الذكر والرتبة. قال الحسن البصري \"ولا يجدون في صدورهم حاجة\" يعني الحسد \"مما أوتوا\" قال قتادة يعني فيما أعطى إخوانهم. وكذا قال ابن زيد ومما يستدل به على هذا المعني ما رواه الإمام أحمد حيث قال حدثنا عبدالرزاق حدثنا معمر عن الزهرى عن أنس قال: كنا جلوسا مع رسول الله صلى الله عليه وسلم فقال \"يطلع عليكم الآن رجل من أهل الجنة\" فطلع رجل من الأنصار تنطف لحيته من وضوئه قد علق نعليه بيده الشمال فلما كان الغد قال رسول الله صلى الله عليه وسلم مثل ذلك فطلع ذلك الرجل مثل المرة الأولى فلما كان اليوم الثالث قال رسول الله صلى الله عليه وسلم مثل مقالته أيضا فطلع ذلك الرجل على مثل حالته الأولى فلما قام رسول الله صلى الله عليه وسلم تبعه عبدالله بن عمرو بن العاص فقال إني لاحيت أبي فأقسمت أني لا أدخل عليه ثلاثا فإن رأيت أن تؤويني إليك حتى تمضي فعلت قال نعم قال أنس فكان عبدالله يحدث أنه بات معه تلك الليالي الثلاث فلم يره يقوم من الليل شيئا غير أنه إذا تعار تقلب على فراشه ذكر الله وكبر حتى يقوم لصلاة الفجر قال عبدالله غير أني لم أسمعه يقول إلا خيرا فلما مضت الليالي الثلاث وكدت أن أحتقر عمله قلت يا عبدالله لم يكن بيني وبين أبي غضب ولا هجرة ولكن سمعت رسول الله صلى الله عليه وسلم يقول لك ثلاث مرات \"يطلع عليكم الآن رجل من أهل الجنة\" فطلعت أنت الثلاث المرات فأردت أن آوي إليك لأنظر ما عملك فأقتدي به فلم أرك تعمل كبير عمل فما الذي بلغ بك ما قال رسول الله صلى الله عليه وسلم؟ قال ما هو إلا ما رأيت فلم وليت دعانى فقال: ما هو إلا ما رأيت غير أني لا أجد في نفسي لأحد من المسلمين غشا ولا أحسد أحدا على خير أعطاه الله إياه قال عبدالله فهذه التي بلغت بك وهي التي لا تطاق ورواه النسائي في اليوم والليلة عن سويد بن نصر عن ابن المبارك عن معمر به وهذا إسناد صحيح على شرط الصحيحين لكن رواه عقيل وغيره عن الزهري عن رجل عن أنس فالله أعلم. وقال عبدالرحمن بن زيد بن أسلم في قوله تعالى \"ولا يجدون في صدورهم حاجة مما أوتوا\" يعني مما أوتوا المهاجرون قال وتكلم في أموال بني النضير بعض من تكلم في الأنصار فعاتبهم الله في ذلك فقال تعالى \"وما أفاء الله على رسوله منهم فما أوجفتم عليه من خيل ولا ركاب ولكن الله يسلط رسله على من يشاء والله على كل شيء قدير\" قال: وقال رسول الله صلى الله عليه وسلم\"إن إخوانكم قد تركوا الأموال والأولاد وخرجوا إليكم\" فقالوا أموالنا بيننا قطائع فقال رسول الله صلى الله عليه وسلم\"أو غير ذلك\" قالوا وما ذاك يا رسول الله؟ قال \"هم قوم لا يعرفون العمل فتكفونهم وتقاسمونهم الثمر\" فقالوا نعم يا رسول الله. وقوله تعالى \"ويؤثرون على أنفسهم ولو كان بهم خصاصه\" يعني حاجة أي يقدمون المحاويج على حاجة أنفسهم ويبدءون بالناس قبلهم في حال احتياجهم إلى ذلك وقد ثبت في الصحيح عن رسول الله صلى الله عليه وسلم أنه قال \"أفضل الصدقة جهد المقل\" وهذا المقام أعلى من حال الذين وصف الله بقوله تعالى \"ويطعمون الطعام على حبه\" وقوله \"وآتى المال على حبه\" فإن هؤلاء تصدقوا وهم يحبون ما تصدقوا به وقد لا يكون لهم حاجة إليه ولا ضرورة به وهؤلاء آثروا على أنفسهم مع خصاصتهم وحاجتهم إلى ما أنفقوه ومن هذا المقام تصدق الصديق رضي الله عنه بجميع ماله فقال له رسول الله صلى الله عليه وسلم\"ما أبقيت لأهلك؟ فقال رضي الله عنه أبقيت لهم الله ورسوله وهكذا الماء الذي عرض على عكرمة وأصحابه يوم اليرموك فكل منهم يأمر بدفعه إلى صاحبه وهو جريح مثقل أحوج ما يكون إلى الماء فرده الآخر إلى الثالث فما وصل إلى الثالث حتى ماتوا عن آخرهم ولم يشربه أحد منهم رضي الله عنهم وأرضاهم. وقال البخاري حدثنا يعقوب بن إبراهيم بن كثير حدثنا أبو أسامة حدثنا فضيل بن غزوان حدثنا أبو حازم الأشجعي عن أبي هريرة قال: أتى رجل لرسول الله صلى الله عليه وسلم فقال يا رسول الله أصابني الجهد فأرسل إلى نسائه فلم يجد عندهن شيئا فقال النبي صلى الله عليه وسلم \"لا رجل يضيف هذا الليلة رحمه الله\" فقام رجل من الأنصار فقال أنا يا رسول الله فذهب إلى أهله فقال لامرأته هذا ضيف رسول الله صلى الله عليه وسلم لا تدخريه شيئا فقالت والله ما عندي إلا قوت الصبية قال فإذا أراد الصبية العشاء فنوميهم وتعالي فأطفئ السراج ونطوي بطوننا الليلة ففعلت ثم غدا الرجل على رسول الله صلى الله عليه وسلم فقال \"لقد عجب الله عز وجل - أو ضحك - من فلان وفلانه\" وأنزل الله تعالى \"ويؤثرون على أنفسهم ولو كان بهم خصاصة\" وكذا رواه البخاري في موضع آخر ومسلم والنسائي من طرق عن فضيل بن غزوان به وفى رواية لمسلم تسمية هذا الأنصاري بأبي طلحة رضي الله عنه. وقوله تعالى \"ومن يوق شح نفسه فأولئك هم المفلحون\" أي من سلم من الشح فقد أفلح وأنجح قال أحمد حدثنا عبدالرزاق أخبرنا داود بن قيس الفراء عن عبيدالله بن مقسم عن جابر بن عبدالله أن رسول الله صلى الله عليه وسلم قال \"إياكم والظلم فإن الظلم ظلمات يوم القيامة واتقوا الشح فإن الشح أهلك من كان قبلكم حملهم على أن سفكوا دماءهم واستحلوا محارمهم\" انفرد بإخراجه مسلم فرواه عن القعنبي عن داود بن قيس به. وقال الأعمش وشعبة عن عمرو بن مرة عن عبدالله بن الحارث عن زهير بن الأقمر عن عبدالله بن عمرو رضي الله عنهما قال: قال رسول الله صلى الله عليه وسلم\"اتقوا الظلم فإن الظلم ظلمات يوم القيامة واتقوا الفحش فإن الله لا يحب الفحش ولا التفحش وإياكم والشح فإنه أهلك من كان قبلكم أمرهم بالظلم فظلموا وأمرهم بالفجور ففجروا وأمرهم بالقطيعة فقطعوا\" ورواه أحمد وأبو داود من طريق شعبة والنسائي من طريق الأعمش كلاهما عن عمرو بن مرة به وقال الليث عن يزيد بن الهاد عن سهيل بن أبي صالح عن صفوان بن أبي يزيد عن القعقاع بن الجلاح عن أبي هريرة أنه سمع رسول الله صلى الله عليه وسلم يقول: \"لا يجتمع غبار في سبيل الله ودخان جهنم في جوف عبد أبدا ولا يجتمع الشح والإيمان في قلب عبد أبدا\" وقال ابن أبي حاتم ثنا أبي حدثنا عبدة بن سليمان أخبرنا ابن المبارك حدثنا المسعودي عن جامع بن شداد عن الأسود بن هلال قال جاء رجل إلى عبدالله فقال يا أبا عبدالرحمن إني أخاف أن أكون قد هلكت فقال له عبدالله وما ذاك؟ قال سمعت الله يقول \"ومن يوق شح نفسه فأولئك هم المفلحون\" وأنا رجل شحيح لا أكاد أن أخرج من يدي شيئا فقال عبدالله: ليس ذلك بالشح الذي ذكر الله في القرآن إنما الشح الذي ذكر الله في القرآن أن تأكل مال أخيك ظلما ولكن ذاك البخل وبئس الشيء البخل. وقال سفيان الثوري عن طارق بن عبدالرحمن عن سعيد بن جبير عن أبي الهياج الأسـدي قال كنت أطوف بالبيت فرأيت رجلا يقول اللهم قني شح نفسي لا يزيد على ذلك فقلت له فقال إني إذا وقيت شح نفسي لم أسرق ولم أزن ولم أفعل وإذا الرجل عبدالرحمن بن عوف رضي الله عنه رواه ابن جرير وقال ابن جرير حدثني محمد بن إسحق حدثنا سليمان بن عبدالرحمن الدمشقي حدثنا إسماعيل بن عياش حدثنا مجمع بن جارية الأنصاري عن عمه يزيد بن جارية عن أنس بن مالك عن رسول الله صلى الله عليه وسلم قال \"بريء من الشح من أدى الزكاة وقرى الضيف وأعطى في النائبة."
    }
  ]
}
