{
  "ayahs": [
    {
      "ayah": 1,
      "surah": 6,
      "text": "اسورة الأنعام قال العوفي وعكرمة وعطاء عن ابن عباس أنزلت سورة الأنعام بمكة. وقال الطبراني: حدثنا علي بن عبدالعزيز حدثنا حجاج بن منهال حدثنا حماد بن سلمة عن علي بن زيد عن يوسف بن مهران عن ابن عباس قال: نزلت الأنعام بمكة ليلا جملة واحدة حولها سبعون ألف ملك يجأرون حولها بالتسبيح وقال سفيان الثوري عن ليث عن شهر بن حوشب عن أسماء بنت يزيد قالت: نزلت سورة الأنعام على النبي صلى الله عليه وسلم جملة وأنا آخذة بزمام ناقة النبي صلى الله عليه وسلم إن كادت من ثقلها لتكسر عظام الناقة. وقال شريك عن ليث عن شهر عن أسماء قالت: نزلت سورة الأنعام على رسول الله صلى الله عليه وسلم وهو في مسير في زجل من الملائكة وقد طبقوا ما بين السماء والأرض. وقال السدي عن مرة عن عبدالله قال: نزلت سورة الأنعام يشيعها سبعون ألفا من الملائكة وروي نحوه من وجه آخر عن ابن مسعود. وقال الحاكم في مستدركه: حدثنا أبو عبدالله محمد بن يعقوب الحافظ وأبو الفضل الحسن بن يعقوب العدل قالا: حدثنا محمد بن عبدالوهاب العبدي أخبرنا جعفر بن عون حدثنا إسماعيل بن عبدالرحمن السدي حدثنا محمد بن المنكدر عن جابر قال: لما نزلت سورة الأنعام سبح رسول الله صلى الله عليه وسلم ثم قال \"لقد شيع هذه السورة من الملائكة ما سد الأفق\" ثم قال صحيح على شرط مسلم. وقال أبو بكر بن مردوية: حدثنا محمد بن عمر حدثنا إبراهيم بن دستوريه الفارسي حدثنا أبو بكر بن أحمد بن محمد بن سالم حدثنا ابن أبي فديك حدثني عمر بن طلحة الرقاشي عن نافع بن مالك بن أبي سهيل عن أنس بن مالك قال: قال رسول الله صلى الله عليه وسلم \"نزلت سورة الأنعام معها موكب من الملائكة سد ما بين الخافقين لهم زجل بالتسبيح والأرض بهم ترتج\" ورسول الله يقول \"سبحان الله العظيم سبحان الله العظيم\" ثم روى ابن مردوية عن الطبراني عن إبراهيم بن نائلة عن إسماعيل بن عمر عن يوسف بن عطية عن ابن عون عن نافع عن ابن عمر قال: قال رسول الله صلى الله عليه وسلم \"نزلت علي سورة الأنعام جملة واحدة وشيعها سبعون ألفا من الملائكة لهم زجل بالتسبيح والتحميد\". يقول الله تعالى مادحا نفسه الكريمة وحامدا لها على خلقه السموات والأرض قرارا لعباده. وجعل الظلمات والنور منفعة لعباده في ليلهم ونهارهم فجمع لفظ الظلمات ووحد لفظ النور لكونه أشرف كقوله تعالى \"عن اليمين والشمائل\" وكما قال في آخر هذه السورة \"وأن هذا صراطي مستقيما فاتبعوه ولا تتبعوا السبل فتفرق بكم عن سبيله\" ثم قال تعالى \"ثم الذين كفروا بربهم يعدلون\" أي ومع هذا كله كفر به بعض عباده وجعلوا له شريكا وعدلا واتخذوا له صاحبة وولدا تعالى الله عز وجل عن ذلك علوا كبيرا."
    },
    {
      "ayah": 10,
      "surah": 6,
      "text": "هذه تسلية للنبي صلى الله عليه وسلم في تكذيب من كذبه من قومه ووعد له للمؤمنين به بالنصرة والعاقبة الحسنة في الدنيا والآخرة."
    },
    {
      "ayah": 100,
      "surah": 6,
      "text": "هذا رد على المشركين الذين عبدوا مع الله غيره وأشركوا به فى عبادته أن عبدوا الجن فجعلوهم شركاء له في العبادة تعالى الله عن شركهم وكفرهم فإن قيل فكيف عبدت الجن مع أنهم إنما كانوا يعبدون الأصنام؟ فالجواب أنهم ما عبدوها إلا عن طاعة الجن وأمرهم إياهم بذلك كقوله \"إن يدعون من دونه إلا إناثا وإن يدعون إلا شيطانا مريدا لعنه الله وقال لأتخذن من عبادك نصيبا مفروضا ولأضلنهم ولأمنينهم ولآمرنهم فليبتكن آذان الأنعام ولآمرنهم فليغيرن خلق الله ومن يتخذ الشيطان وليا من دون الله فقد خسر خسرانا مبينا يعدهم ويمنيهم وما يعدهم الشيطان إلا غرورا\" وكقوله تعالى \"أفتتخذونه وذريته أولياء من دوني\" الآية. وقال إبراهيم لأبيه \"يا أبت لا تعبد الشيطان إن الشيطان كان للرحمن عصيا\" وكقوله \"ألم أعهد إليكم يا بني آدم أن لا تعبدوا الشيطان إنه لكم عدو مبين وأن اعبدوني هذا صراط مستقيم\" وتقول الملائكة يوم القيامة \"سبحانك أنت ولينا من دونهم بل كانوا يعبدون الجن أكثرهم بهم مؤمنون\" ولهذا قال تعالى \"وجعلوا لله شركاء الجن وخلقهم\" أي وقد خلقهم فهو الخالق وحده لا شريك له فكيف يعبد معه غيره كقول إبراهيم \"أتعبدون ما تنحتون والله خلقكم وما تعملون\" ومعنى الآية. أنه سبحانه وتعالى هو المستقل بالخلق وحده فلهذا يجب أن يفرد بالعبادة وحده لا شريك له وقوله تعالى \"وخرقوا له بنين وبنات بغير علم\" ينبه به تعالى على ضلال من ضل في وصفه تعالى بأن له ولدا كما زعم من قاله من اليهود في عزير ومن قال من النصارى في عيسى ومن قال من مشركي العرب في الملائكة أنها بنات الله. تعالى الله عما يقول الظالمون علوا كبيرا ومعنى خرقوا أي اختلقوا وائتفكوا وتخرصوا وكذبوا كما قاله علماء السلف قال علي بن أبي طلحة وابن عباس وخرقوا يعني تخرصوا وقال العوفي عنه \"وخرقوا له بنين وبنات بغير علم\" قال جعلوا له بنين وبنات وقال مجاهد \"وخرقوا له بنين وبنات\" فال كذبوا. وكذا قال الحسن وقال الضحاك وضعوا وقال السدي قطعوا قال ابن جرير وتأويله إذا وجعلوا لله الجن شركاء في عبادته إياهم وهو المتفرد بخلقهم بغير شريك ولا معين ولا ظهير \"وخرقوا له بنين وبنات بغير علم\" بحقيقة ما يقولون ولكن جهلا بالله وبعظمته فإنه لا ينبغي لمن كان إلها أن يكون له بنون وبنات ولا صاحبة ولا أن يشركه في خلقه شريك ولهذا قال \"سبحانه وتعالى عما يصفون\" أي تقدس وتنزه وتعاظم عما يصفه هؤلاء الجهلة الضالون من الأولاد والأنداد والنظراء والشركاء."
    },
    {
      "ayah": 101,
      "surah": 6,
      "text": "بديع السموات والأرض \"أي مبدعهما وخالقهما ومنشئهما ومحدثهما على غير مثال سبق كما قال مجاهد والسدي ومنه سميت البدعة بدعة لأنه لا نظير لها فيما سلف \"أنى يكون له ولد\" أي كيف يكون له ولد \"ولم تكن له صاحبة\" أي والولد إنما يكون متولدا بين شيئين متناسبين والله تعالى لا يناسبه ولا يشابهه شيء من خلقه لأنه خالق كل شيء فلا صاحبة له ولا ولد كما قال تعالى \"وقالوا اتخذ الرحمن ولدا لقد جئتم شيئا إدا\" إلى قوله \"وكلهم آتيه يوم القيامة فردا\" \"وخلق كل شيء وهو بكل شيء عليم\" فبين تعالى أنه الذي خلق كل شيء وأنه بكل شيء عليم فكيف يكون له صاحبة من خلقه تناسبه وهو الذي لا نظير له فأنى يكون له ولد \"تعالى الله عن ذلك علوا كبيرا\"."
    },
    {
      "ayah": 102,
      "surah": 6,
      "text": "يقول تعالى \"ذلكم الله ربكم\" أي الذي خلق كل شيء ولا ولد له ولا صاحبة \"لا إله إلا هو خالق كل شيء فاعبدوه\" أي فاعبدوه وحده لا شريك له وأقروا له بالوحدانية وأنه لا إله إلا هو وأنه لا ولد له ولا والد ولا صاحبة له ولا نظير ولا عديل \"وهو على كل شيء وكيل\" أي حفيظ ورقيب يدبر كل ما سواه ويرزقهم ويكلأهم بالليل والنهار."
    },
    {
      "ayah": 103,
      "surah": 6,
      "text": "وقوله \"لا تدركه الأبصار\" فيه أقوال للأئمة من السلف. \" أحدها \"لا تدركه في الدنيا وإن كانت تراه في الآخرة كما تواترت به الأخبار عن رسول الله صلى الله عليه وسلم من غير ما طريق ثابت في الصحاح والمسانيد والسنن. كما قال مسروق عن عائشة أنها قالت من زعم أن محمدا أبصر ربه فقد كذب وفي رواية- على الله- فإن الله تعالى قال \"لا تدركه الأبصار وهو يدرك الأبصار\".رواه ابن أبي حاتم من حديث أبي بكر بن عياش عن عاصم بن أبي النجود عن أبي الضحى عن مسروق ورواه غير واحد عن مسروق وثبت في الصحيح وغيره عن عائشة غير وجه وخالفها ابن عباس فعنه إطلاق الرؤية وعنه أنه رآه بفؤاده مرتين والمسألة تذكر في أول سورة النجم إن شاء الله وقال ابن أبي حاتم ذكر محمد بن مسلم حدثنا أحمد بن إبراهيم الدورقي حدثنا يحيى بن معين قال: سمعت إسماعيل بن علية يقول في قول الله \"لا تدركه الأبصار\" قال هذا في الدنيا وذكر أبي عن هشام بن عبد الله أنه قال نحو ذلك. وقال آخرون \"لا تدركه الأبصار\" أي جميعها وهذا مخصص بما ثبت من رؤية المؤمنين له في الدار الآخرة وقال آخرون من المعتزلة بمقتضى ما فهموه من الآية أنه لا يرى في الدنيا ولا في الآخرة فخالفوا أهل السنة والجماعة في ذلك مع ما ارتكبوه من الجهل بما دل عليه كتاب الله وسنة رسوله. أما الكتاب فقوله تعالى \"وجوه يومئذ ناضرة إلى ربها ناظرة\" وقال تعالى عن الكافرين \"كلا إنهم عن ربهم يومئذ لمحجوبون\" قال الإمام الشافعي فدل هذا على أن المؤمنين لا يحجبون عنه تبارك وتعالى. وأما السنة فقد تواترت الأخبار عن أبي سعيد وأبي هريرة وابن وجريج وصهيب وبلال وغير واحد من الصحابة عن النبي صلى الله عليه وسلم من أن المؤمنين يرون الله في الدار الآخرة في العرصات وفي روضات الجنات جعلنا الله تعالى منهم بمنه وكرمه آمين. وقيل المراد بقوله \"لا تدركه الأبصار\" أي العقول رواه ابن أبي حاتم عن علي بن الحسين عن الفلاس عن ابن مهدي عن أبي الحصين يحيى بن الحصين قارئ أهل مكة أنه قال ذلك وهذا غريب جدا وخلاف ظاهر الآية وكأنه اعتقد أن الإدراك في معنى الرؤية والله أعلم. وقال آخرون لا منافاة إثبات الرؤية ونفي الإدراك فإن الإدراك أخص من الرؤية ولا يلزم من نفي الأخص انتفاء الأعم. ثم اختلف هؤلاء في الإدراك المنفي ما هو فقيل معرفة الحقيقة فإن هذا لا يعلمه إلا هو وإن رآه المؤمنون كما أن من رأى القمر فإنه لا يدرك حقيقته وكنهه وماهيته فالعظيم أولى بذلك وله المثل الأعلى. قال ابن عليه في الآية. هذا في الدنيا رواه ابن أبي حاتم. وقال آخرون الإدراك أخص من الرؤية وهو الإحاطة قالوا ولا يلزم من عدم الإحاطة عدم الرؤية كما لا يلزم من إحاطة العلم عدم العلم قال تعالى \"ولا يحيطون به علما\" وفي صحيح مسلم لا أحصي ثناء عليك أنت كما أثنيت على نفسك ولا يلزم منه عدم الثناء فكذلك هذا قال العوفي عن ابن عباس في قوله تعالى \"لا تدركه الأبصار وهو يدرك الأبصار\" قال لا يحيط بصر أحد بالملك وقال ابن أبي حاتم حدثنا أبو زرعة حدثنا عمرو بن حماد بن طلحة القناد حدثنا أسباط عن سماك عن عكرمة أنه قيل له لا تدركه الأبصار قال ألست ترى السماء؟ قال بلى قال فكلها ترى؟ وقال سعيد بن أبي عروبة عن قتادة في الآية \"لا تدركه الأبصار وهو يدرك الأبصار\" وهو أعظم من أن تدركه الأبصار. وقال ابن جرير حدثنا سعد بن عبد الله بن عبد الحكم حدثنا خالد بن عبد الرحمن حدثنا أبو عرفجة عن عطية العوفي في قوله تعالى \"وجوه يومئذ ناضرة إلى ربها ناظرة\" قال هم ينظرون إلى الله لا تحيط أبصارهم به من عظمته وبصره محيط بهم فذلك قوله \"لا تدركه الأبصار وهو يدرك الأبصار\" وورد في تفسير هذه الآية حديث رواه ابن أبي حاتم ههنا فقال حدثنا أبو زرعة حدثنا منجاب بن الحارث السهمي حدثنا بشر بن عمارة عن أبي روق عن عطية العوفي عن أبي سعيد الخدري عن رسول الله صلى الله عليه وآله وسلم في قوله \"لا تدركه الأبصار وهو يدرك الأبصار\" قال \"لو أن الجن والإنس والشياطين والملائكة منذ خلقوا إلى أن فنوا صفوا صفا واحدا ما أحاطوا بالله أبدا\" غريب لا يعرف إلا من هذا الوجه ولم يروه أحد من أصحاب الكتب الستة والله أعلم. وقال آخرون في الآية بما رواه الترمذي في جامعه وابن أبي عاصم في كتاب السنة له وابن أبي حاتم في تفسيره وابن مردوية أيضا والحاكم في مستدركه من حديث الحكم بن أبان قال سمعت عكرمة يقول سمعت ابن عباس يقول رأى محمد ربه تبارك وتعالى فقلت أليس الله يقول \"لا تدركه الأبصار وهو يدرك الأبصار\" الآية فقال لي لا أم لك ذلك نوره الذي هو نوره إذا تجلى بنوره لا يدركه شيء وفي رواية لا يقوم له شيء قال الحاكم صحيح على شرط الشيخين ولم يخرجاه وفي معنى هذا الأثر ما ثبت في الصحيحين من حديث أبي موسى الأشعري رضي الله عنه مرفوعا إن الله لا ينام ولا ينبغي له أن ينام يخفض القسط ويرفعه يرفع إليه عمل النهار قبل الليل وعمل الليل قبل النهار حجابه النور- أو النار - لو كشفه لأحرقت سبحات وجهه ما انتهى إليه بصره من خلقه وفي الكتب المتقدمة إن الله تعالى قال لموسى لما سأل الرؤية: يا موسى إنه لا يراني حي إلا مات ولا يابس إلا تدهده. أي تدعثر وقال تعالى \"فلما تجلى ربه للجبل جعله دكا وخر موسى صعقا فلما أفاق قال سبحانك تبت إليك وأنا أول المؤمنين\" ونفي هذا الأثر الإدراك الخاص لا ينفي الرؤية يوم القيامة يتجلى لعباده المؤمنين كما يشاء فأما جلاله وعظمته على ما هو عليه تعالى وتقدس وتنزه فلا تدركه الأبصار ولهذا كانت أم المؤمنين عائشة رضي الله عنها تثبت الرؤية في الدار الآخرة وتنفيها في الدنيا وتحتج بهذه الآية \"لا تدركه الأبصار وهو يدرك الأبصار\" فالذي نفته الإدراك الذي هو بمعنى رؤية العظمة والجلال على ما هو عليه فإن ذلك غير ممكن للبشر ولا للملائكة ولا لشيء وقوله \"وهو يدرك الأبصار\" أي يحيط بها ويعلمها على ما هي عليه لأنه خلقها كما قال تعالى \"ألا يعلم من خلق وهو اللطيف الخبير\" وقد يكون عبر بالأبصار عن المبصرين كما قال السدي في قوله \"لا تدركه الأبصار وهو يدرك الأبصار\" لا يراه شيء وهو يرى الخلائق وقال أبو العالية في قوله تعالى \"وهو اللطيف الخبير\" قال اللطيف لاستخراجها الخبير بمكانها والله أعلم وهذا كما قال تعالى إخبارا عن لقمان فيما وعظ به ابنه \"يا بني إنها إن تك مثقال حبة من خردل فتكن في صخرة أو في السموات أو في الأرض يأت بها الله إن الله لطيف خبير\"."
    },
    {
      "ayah": 104,
      "surah": 6,
      "text": "البصائر هي البينات والحجج التي اشتمل عليها القرآن وما جاء به الرسول صلى الله عليه وسلم \"فمن أبصر فلنفسه\" كقوله \"فمن اهتدى فإنما يهتدي لنفسه ومن ضل فإنما يضل عليها\" ولهذا قال \"ومن عمي فعليها\" لما ذكر البصائر قال \"ومن عمي فعليها\" أي إنما يعود وباله عليه كقوله \"فإنها لا تعمى الأبصار ولكن تعمى القلوب التي في الصدور\" \"وما أنا عليكم بحفيظ\" أي بحافظ ولا رقيب بل إنما أنا مبلغ والله يهدي من يشاء ويضل من يشاء."
    },
    {
      "ayah": 105,
      "surah": 6,
      "text": "وقوله \"وكذلك نصرف الآيات\" أي وكما فصلنا الآيات في هذه السورة من بيان التوحيد وأنه لا إله إلا هو هكذا نوضح الآيات ونفسرها ونبينها في كل موطن لجهالة الجاهلين وليقول المشركون والكافرون المكذبون دارست يا محمد من قبلك من أهل الكتاب وقارأتهم وتعلمت منهم هكذا قاله ابن عباس ومجاهد وسعيد بن جبير والضحاك وغيرهم. وقال الطبراني حدثنا عبد الله بن أحمد حدثنا أبي حدثنا سفيان بن عيينة عن عمرو بن دينار عن عمرو بن كيسان قال سمعت ابن عباس يقول دارست تلوت خاصمت جادلت وهذا كقوله تعالى إخبارا عن كذبهم وعنادهم \"وقال الذين كفروا إن هذا إلا إفك افتراه وأعانه عليه قوم آخرون فقد جاءوا ظلما وزورا وقالوا أساطير الأولين اكتتبها\" الآية وقال تعالى إخبارا عن زعيمهم وكاذبهم \"إنه فكر وقدر فقتل كيف قدر ثم قتل كيف قدر ثم نظر ثم عبس وبسر ثم أدبر واستكبر فقال إن هذا إلا سحر يؤثر إن هذا إلا قول البشر\" وقوله \"ولنبينه لقوم يعلمون\" أي ولنوضحه لقوم يعلمون الحق فيتبعونه والباطل فيجتنبونه فلله تعالى الحكمة البالغة في إضلال أولئك وبيان الحق لهؤلاء كقوله تعالى \"يضل به كثيرا ويهدي به كثيرا\" الآية وكقوله \"ليجعل ما يلقي الشيطان فتنة للذين في قلوبهم مرض والقاسية قلوبهم وإن الله لهادي الذين آمنوا إلى صراط مستقيم\" وقال تعالى \"وما جعلنا أصحاب النار إلا ملائكة وما جعلنا عدتهم إلا فتنة للذين كفروا ليستيقن الذين أوتوا الكتاب ويزداد الذين آمنوا إيمانا ولا يرتاب الذين أوتوا الكتاب والمؤمنون وليقول الذين في قلوبهم مرض والكافرون ماذا أراد الله بهذا مثلا كذلك يضل الله من يشاء ويهدي من يشاء وما يعلم جنود ربك إلا هو\" وقال \"وننزل من القرآن ما هو شفاء ورحمة للمؤمنين ولا يزيد الظالمين إلا خسارا\" وقال تعالى \"قل هو للذين آمنوا هدى وشفاء والذين لا يؤمنون في آذانهم وقر وهو عليهم عمى أولئك ينادون من مكان بعيد\" إلى غير ذلك من الآيات الدالة على أنه تعالى أنزل القرآن هدى للمتقين وأنه يضل به من يشاء ويهدي به من يشاء ولهذا قال ههنا \"وكذلك نصرف الآيات وليقولوا درست ولنبينه لقوم يعلمون\" وقرأ بعضهم \"وليقولوا درست\" قال التميمي عن ابن عباس درست أي قرأت وتعلمت وكذا قال مجاهد والسدي والضحاك وعبد الرحمن بن زيد بن أسلم وغير واحد وقال عبد الرزاق عن معمر قال الحسن \"وليقولوا درست\" يقول تقادمت وانمحت وقال عبد الرزاق أيضا أنبأنا ابن عيينة عن عمرو بن دينار سمعت ابن الزبير يقول إن صبيانا يقرءون ههنا دارست وإنما درست وقال شعبة حدثنا أبو إسحاق الهمداني قال هي في قراءة ابن مسعود درست يعني بغير ألف بنصب السين ووقف على التاء قال ابن جرير ومعناه انمحت وتقادمت أي أن هذا الذي تتلوه علينا قد مر بنا قديما وتطاولت مدته وقال سعيد بن أبي عروبة عن قتادة أنه قرأها درست أي قرئت وتعلمت وقال معمر عن قتادة درست قرئت وفي حرف ابن مسعود درس وقال أبو عبيد القاسم بن سلام حدثنا حجاج عن هارون قال هي في حرف أبي بن كعب وابن مسعود وليقولوا درس قال يعنون النبي صلى الله عليه وسلم أنه قرأ وهذا غريب فقد روي عن أبي بن كعب خلاف هذا قال أبو بكر بن مردوية حدثنا محمد بن أحمد بن إبراهيم حدثنا الحسن بن ليث حدثنا أبو سلمة حدثنا أحمد بن أبي بزة المكي حدثنا وهب بن زمعة عن أبيه عن حميد الأعرج عن مجاهد عن ابن عباس عن أبي بن كعب قال: أقرأني رسول الله صلى الله عليه وسلم \"وليقولوا درست\".ورواه الحاكم في مستدركه من حديث وهب بن زمعة وقال يعني بجزم السين ونصب التاء ثم قال صحيح الإسناد ولم يخرجاه."
    },
    {
      "ayah": 106,
      "surah": 6,
      "text": "يقول تعالى آمرا لرسوله صلى الله عليه وسلم ولمن اتبع طريقته \"اتبع ما أوحي إليك من ربك\" أي اقتد به واقتف أثره واعمل به فإن ما أوحي إليك من ربك هو الحق الذي لا مرية فيه لأنه لا إله إلا هو \"وأعرض عن المشركين\" أي اعف عنهم واصفح واحتمل أذاهم حتى يفتح الله لك وينصرك ويظفرك عليهم."
    },
    {
      "ayah": 107,
      "surah": 6,
      "text": "واعلم أن لله حكمة في إضلالهم فإنه لو شاء لهدى الناس جميعا ولو شاء لجمعهم على الهدى \"ولو شاء الله ما أشركوا\" أي بل له المشيئة والحكمة فيما يشاؤه ويختاره لا يسأل عما يفعل وهم يسألون وقوله تعالى \"وما جعلناك عليهم حفيظا\" أي حافظا تحفظ أقوالهم وأعمالهم \"وما أنت عليهم بوكيل\" أي موكل على أرزاقهم وأمورهم إن عليك إلا البلاغ كما قال تعالى \"فذكر إنما أنت مذكر لست عليهم بمصيطر\" وقال \"إنما عليك البلاغ وعلينا الحساب\"."
    },
    {
      "ayah": 108,
      "surah": 6,
      "text": "يقول الله تعالى ناهيا لرسوله صلى الله عليه وسلم والمؤمنين عن سب آلهة المشركين وإن كان فيه مصلحة إلا أنه يترتب عليه مفسدة أعظم منها وهي مقابلة المشركين بسب إله المؤمنين وهو \"الله لا إله إلا هو\" كما قال علي بن أبي طلحة عن ابن عباس في هذه الآية قالوا يا محمد لتنتهين عن سبك آلهتنا أو لنهجون ربك فنهاهم الله أن يسبوا أوثانهم \"فيسبوا الله عدوا بغير علم\" وقال عبد الرزاق عن معمر عن قتادة كان المسلمون يسبون أصنام الكفار فيسب الكفار الله عدوا بغير علم فأنزل الله \"ولا تسبوا الذين يدعون من دون الله\" وروى ابن جرير وابن أبى حاتم عن السدي أنه قال في تفسير هذه الآية: لما حضر أبا طالب الموت قالت قريش انطلقوا فلندخل على هذا الرجل فلنأمره أن ينهى عنا ابن أخيه فإنا نستحي أن نقتله بعد موته فتقول العرب كان يمنعهم فلما مات قتلوه فانطلق أبو سفيان وأبو جهل والنضر بن الحرث وأمية وأبي ابنا خلف وعقبة بن أبي معيط وعمرو بن العاص والأسود بن البختري وبعثوا رجلا منهم يقال له المطلب قالوا استأذن لنا على أبي طالب فأتى أبا طالب فقال: هؤلاء مشيخة قومك يريدون الدخول عليك فأذن لهم عليه فدخلوا عليه فقالوا يا أبا طالب أنت كبيرنا وسيدنا وإن محمدا قد آذانا وآذى آلهتنا فنحب أن تدعوه فتنهاه عن ذكر آلهتنا ولندعه وإلهه فدعاه فجاء النبي صلى الله عليه وسلم فقال له أبو طالب هؤلاء قومك وبنو عمك قال رسول الله صلى الله عليه وسلم ما تريدون؟ قالوا نريد أن تدعنا وآلهتنا ولندعك وإلهك فقال النبي صلى الله عليه وسلم أرأيتم إن أعطيتكم هذا هل أنتم معطي كلمة إن تكلمتم بها ملكتم بها العرب ودانت لكم بها العجم وأدت لكم الخراج قال أبو جهل وأبيك لنعطينكها وعشرة أمثالها قالوا فما هي؟ قال: قولوا لا إله إلا الله فأبوا واشمأزوا قال أبو طالب يا ابن أخي قل غيرها. فإن قومك قد فزعوا منها قال يا عم ما أنا بالذي يقول غيرها حتى يأتوا بالشمس فيضعوها في يدي ولو أتوا بالشمس فوضعوها في يدي ما قلت غيرها إرادة أن يؤيسهم فغضبوا وقالوا لتكفن عن شتم آلهتنا أو لنشتمنك ونشتمن من يأمرك فذلك قوله \"فيسبوا الله عدوا بغير علم\" ومن هذا القبيل وهو ترك المصلحة لمفسدة أرجح منها ما جاء في الصحيح أن رسول الله صلى الله عليه وسلم قال ملعون من سب والديه قالوا يا رسول الله وكيف يسب الرجل والديه؟ قال يسب أبا الرجل فيسب أباه ويسب أمه فيسب أمه أو كما قال صلى الله عليه وسلم وقوله \"كذلك زينا لكل أمة عملهم\" أي وكما زينا لهؤلاء القوم حب أصنامهم والمحاماة لها والانتصار كذلك زينا لكل أمة أي من الأمم الخالية على الضلال عملهم الذي كانوا فيه ولله الحجة البالغة والحكمة التامة فيما يشاؤه ويختاره \"ثم إلى ربهم مرجعهم\" أي معادهم ومصيرهم \"فينبئهم بما كانوا يعملون\" أي يجازيهم بأعمالهم إن خيرا فخير وإن شرا فشر."
    },
    {
      "ayah": 109,
      "surah": 6,
      "text": "يقول تعالى إخبارا عن المشركين أنهم أقسموا بالله جهد أيمانهم أي حلفوا أيمانا مؤكدة \"لئن جاءتهم آية\" أي معجزة وخارق \"ليؤمنن بها\" أي ليصدقنها \"قل إنما الآيات عند الله\" أي قل يا محمد لهؤلاء الذين يسألونك الآيات تعنتا وكفرا وعنادا لا على سبيل الهدى والاسترشاد إنما مرجع هذه الآيات إلى الله إن شاء جاءكم بها وإن شاء ترككم قال ابن جرير حدثنا هناد حدثنا يونس بن بكير حدثنا أبو معشر عن محمد بن كعب القرظي قال كلم رسول الله صلى الله عليه وسلم قريش فقالوا يا محمد تخبرنا أن موسى كان معه عصا يضرب بها الحجر فانفجرت منه اثنتا عشرة عينا وتخبرنا أن عيسى كان يحيي الموتى وتخبرنا أن ثمود كانت لهم ناقة فأتنا من الآيات حتى نصدقك فقال رسول الله صلى الله عليه وسلم أي شيء تحبون أن آتيكم به؟ قالوا تجعل لنا الصفا ذهبا فقال لهم فإن فعلت تصدقوني؟ قالوا نعم والله لئن فعلت لنتبعك أجمعون فقام رسول الله صلى الله عليه وسلم يدعو فجاءه جبريل عليه السلام فقال له ما شئت إن شئت أصبح من الصفا ذهبا ولئن أرسل آية فلم يصدقوا عند ذلك ليعذبنهم وإن شئت فاتركهم حتى يتوب تائبهم. فقال رسول الله صلى الله عليه وسلم بل يتوب تائبهم فأنزل الله تعالى \"وأقسموا بالله جهد أيمانهم\" إلى قوله تعالى \"ولكن أكثرهم يجهلون\" وهذا مرسل وله شواهد من وجوه أخر. وقال الله تعالى \"وما منعنا أن نرسل بالآيات إلا أن كذب بها الأولون\" الآية وقوله تعالى \"وما يشعركم أنها إذا جاءت لا يؤمنون\" قيل المخاطب بما يشعركم المشركون وإليه ذهب مجاهد كأنه يقول لهم وما يدريكم بصدقهم في هذه الأيمان التي تقسمون بها وعلى هذا فالقراءة \"إنها إذا جاءت لا يؤمنون\" بكسر أنها على استئناف الخبر عنهم بنفي الإيمان عند مجيء الآيات التي طلبوها وقرأ بعضهم \"أنها إذا جاءت لا تؤمنون\" بالتاء المثناة من فوق وقيل المخاطب بقوله وما يشعركم المؤمنون يقول وما يدريكم أيها المؤمنون وعلى هذا فيجوز في قوله \"أنها\" الكسر كالأول والفتح على أنه معمول يشعركم وعلى هذا فتكون لا في قوله \"أنها إذا جاءت لا يؤمنون\" صلة كقوله \"ما منعك ألا تسجد إذ أمرتك\" وقوله \"وحرام على قرية أهلكناها أنهم لا يرجعون\" أي ما منعك أن تسجد إذ أمرتك وحرام أنهم يرجعون وتقديره في هذه الآية وما يدريكم أيها المؤمنون الذين تودون لهم ذلك حرصا على إيمانهم أنها إذا جاءتهم الآيات يؤمنون قال بعضهم \"أنها\" بمعنى لعلها قال ابن جرير وذكروا أن ذلك كذلك في قراءة أبي بن كعب. قال وقد ذكر عن العرب سماعا اذهب إلى السوق أنك تشتري لنا شيئا بمعنى لعلك تشتري. قال وقد قيل إن قول عدي بن زيد العبادي من هذا: أعاذل ما يدريك أن منيتي إلى ساعة في اليوم أو في ضحى الغد وقد اختار هذا القول ابن جرير وذكر عليه شواهد من أشعار العرب والله أعلم."
    },
    {
      "ayah": 11,
      "surah": 6,
      "text": "أي فكروا في أنفسكم وانظروا ما أحل الله بالقرون الماضية الذين كذبوا رسله وعاندوهم من العذاب والنكال والعقوبة في الدنيا مع ما ادخر لهم من العذاب الأليم في الآخرة وكيف نجى رسله وعباده المؤمنين."
    },
    {
      "ayah": 110,
      "surah": 6,
      "text": "وقوله تعالى \"ونقلب أفئدتهم وأبصارهم كما لم يؤمنوا به أول مرة\" قال العوفي عن ابن عباس في هذه الآية لما جحد المشركون ما أنزل الله لم تثبت قلوبهم على شيء وردت عن كل أمر وقال مجاهد في قوله \"ونقلب أفئدتهم وأبصارهم\" ونحول بينهم وبين الإيمان ولو جاءتهم كل آية فلا يؤمنون كما حلنا بينهم وبين الإيمان أول مرة. وكذا قال عكرمة وعبد الرحمن بن زيد بن أسلم وقال ابن أبي طلحة عن ابن عباس رضي الله عنه أنه قال أخبر الله ما العباد قائلون قبل أن يقولوه وعملهم قبل أن يعملوه وقال \"ولا ينبئك مثل خبير\" جل وعلا وقال \"أن تقول نفس يا حسرتى على ما فرطت في جنب الله - إلى قوله لو أن لي كرة فأكون من المحسنين\" فأخبر الله سبحانه أنهم لو ردوا لم يقدروا على الهدى وقال: \"ولو ردوا لعادوا لما نهوا عنه وإنهم لكاذبون\" وقال تعالى \"ونقلب أفئدتهم وأبصارهم كما لم يؤمنوا به أول مرة\" وقال ولو ردوا إلى الدنيا لحيل بينهم وبين الهدى كما حلنا بينهم وبينه أول مرة وهم في الدنيا وقوله \"ونذرهم\" أي نتركهم \"في طغيانهم\" قال ابن عباس والسدي في كفرهم وقال أبو العالية والربيع بن أنس وقتادة في ضلالهم \"يعمهون\" قال الأعمش يلعبون وقال ابن عباس ومجاهد وأبو العالية والربيع وأبو مالك وغيره في كفرهم يترددون."
    },
    {
      "ayah": 111,
      "surah": 6,
      "text": "يقول تعالى ولو أننا أجبنا سؤال هؤلاء الذين أقسموا بالله جهد أيمانهم لئن جاءتهم آية ليؤمنن بها فنزلنا عليهم الملائكة تخبرهم بالرسالة من الله بتصديق الرسل كما سألوا فقالوا \"أو تأتي بالله والملائكة قبيلا\" وقالوا لن نؤمن لك حتى نؤتى مثل ما أوتي رسل الله \" وقال الذين لا يرجون لقاءنا لولا نزل علينا الملائكة أو نرى ربنا لقد استكبروا في أنفسهم وعتو عتوا كبيرا\" \"وكلمهم الموتى\" أي فأخبروهم بصدق ما جاءتهم به الرسل \"وحشرنا عليهم كل شيء قبلا\" قرأ بعضهم قبلا بكسر القاف وفتح الباء من المقابلة والمعاينة وقرأ آخرون بضمهما قيل معناه من المقابلة والمعاينة أيضا كما رواه علي بن أبي طلحة والعوفي عن ابن عباس وبه قال قتادة وعبد الرحمن بن زيد بن أسلم. وقال مجاهد قبلا أي أفواجا قبيلا قبيلا أي تعرض عليهم كل أمة بعد أمة فيخبرونهم بصدق الرسل فيما جاءوهم به \"ما كانوا ليؤمنوا إلا أن يشاء الله\" أي إن الهداية إليه لا إليهم بل يهدي من يشاء ويضل من يشاء وهو الفعال لما يريد \"لا يسأل عما يفعل وهم يسألون\" لعلمه وحكمته وسلطانه وقهره وغلبته وهذه الآية كقوله تعالى \"إن الذين حقت عليهم كلمة ربك لا يؤمنون ولو جاءتهم كل آية حتى يروا العذاب الأليم\"."
    },
    {
      "ayah": 112,
      "surah": 6,
      "text": "يقول تعالى وكما جعلنا لك يا محمد أعداء يخالفونك ويعادونك ويعانونك جعلنا لكل نبي من قبلك أيضا أعداء فلا يحزنك ذلك كما قال تعالى \"ولقد كذبت رسل من قبلك فصبروا على ما كذبوا وأوذوا\" الآية. وقال تعالى \"ما يقال لك إلا ما قد قيل للرسل من قبلك إن ربك لذو مغفرة وذو عقاب أليم\" وقال تعالى \"وكذلك جعلنا لكل نبي عدوا من المجرمين\" الآية. وقال ورقة بن نوفل لرسول الله صلى الله عليه وسلم إنه لم يأت أحد بمثل ما جئت به إلا عودي وقوله \"شياطين الإنس والجن\" بدل من \"عدوا\" أي لهم أعداء من شياطين الإنس والجن والشيطان كل من خرج عن نظيره بالشر ولا يعادي الرسل إلا الشياطين من هؤلاء وهؤلاء قبحهم الله ولعنهم. قال عبد الرزاق حدثنا معمر عن قتادة في قوله \"شياطين الإنس والجن\" قال من الجن شياطين ومن الإنس شياطين يوحي بعضهم إلى بعض قال قتادة وبلغني أن أبا ذر كان يوما يصلي فقال النبي صلى الله عليه وسلم \"تعوذ يا أبا ذر من شياطين الإنس والجن\" فقال أو إن من الإنس شياطين فقال رسول الله صلى الله عليه وسلم \"نعم\" وهذا منقطع بين قتادة وأبي ذر. وقد روي من وجه آخر عن أبي ذر رضي الله عنه قال ابن جرير حدثنا المثنى حدثنا أبو صالح حدثني معاوية بن صالح أبي عبد الله محمد بن أيوب وغيره من المشيخة عن ابن عائذ عن أبي ذر قال: أتيت رسول الله صلى الله عليه وسلم في مجلس قد أطال فيه الجلوس قال: فقال \"يا أبا ذر هل صليت\" قلت لا يا رسول الله قال \"قم فاركع ركعتين\" قال ثم جئت فجلست إليه فقال \"يا أبا ذر هل تعوذت بالله من شياطين الجن والإنس\" قال: قلت لا يا رسول الله وهل للإنس من شياطين؟ قال: \"نعم هم شر من شياطين الجن\".وهذا أيضا فيه انقطاع وروي متصلا كما قال الإمام أحمد حدثنا وكيع حدثنا المسعودي أنبأنا أبو عمر الدمشقي عن عبيد بن الحسيحاس عن أبي ذر قال: أتيت النبي صلى الله عليه وسلم وهو في المسجد فجلست فقال: \"يا أبا ذر هل صليت؟\". قلت لا قال قم فصل قال فقمت فصليت ثم جلست فقال يا أبا ذر تعوذ بالله من شر شياطين الإنس والجن. قال: قلت يا رسول الله وللإنس شياطين؟ قال نعم وذكر تمام الحديث بطوله. وكذا رواه الحافظ أبو بكر بن مردوية في تفسيره من حديث جعفر بن عون ويعلى بن عبيد وعبيد الله بن موسى ثلاثتهم عن المسعودي به. \" طريق أخرى عن أبي ذر \"قال ابن جرير حدثنا المثنى حدثنا الحجاج حدثنا حماد عن حميد بن هلال حدثني رجل من أهل دمشق عن عوف بن مالك عن أبي ذر أن رسول الله صلى الله عليه وسلم قال يا أبا ذر هل تعوذت بالله من شر شياطين الإنس والجن؟ قال: قلت يا رسول الله هل للإنس من شياطين؟ قال: نعم. \" طريق أخرى للحديث \"قال ابن أبي حاتم حدثنا محمد بن عوف الحمصي حدثنا أبو المغيرة حدثنا معاذ بن رفاعة عن علي بن يزيد عن القاسم عن أبي أمامة قال: قال رسول الله صلى الله عليه وسلم يا أبا ذر تعوذت من شياطين الجن والإنس ؟ قال يا رسول الله وهل للإنس شياطين؟ قال نعم \" شياطين الإنس والجن يوحي بعضهم إلى بعض زخرف القول غرورا وقوله \"يوحي بعضهم إلى بعض زخرف القول غرورا\" فهذه طرق لهذا الحديث ومجموعها يفيد قوته وصحته والله أعلم قال ابن جرير حدثنا ابن وكيع حدثنا أبو نعيم عن شريك عن سعيد بن مسروق عن عكرمة \"شياطين الإنس والجن\" قال ليس من الإنس شياطين ولكن شياطين الجن يوحون إلى شياطين الإنس وشياطين الإنس يوحون إلى شياطين الجن قال وحدثنا الحارث حدثنا عبد العزيز حدثنا إسرائيل عن السدي عن عكرمة في قوله \"يوحي بعضهم إلى بعض زخرف القول غرورا\" قال للإنس شياطين وللجن شياطين فيلقى شيطان الإنس شيطان الجن فيوحي بعضهم إلى بعض زخرف القول غرورا وقال أسباط عن السدي عن عكرمة في قوله \"يوحي بعضهم إلى بعض\" أما شياطين الإنس فالشياطين التي تضل الإنس وشياطين الجن التي تضل الجن يلتقيان فيقول كل واحد منهما لصاحبه إنى أضللت صاحبي بكذا وكذا فأضل أنت صاحبك بكذا وكذا فيعلم بعضهم بعضا ففهم ابن جرير من هذا أن المراد بشياطين الإنس عند عكرمة والسدي الشياطين من الجن الذين يضلون الناس لا أن المراد منه شياطين الإنس منهم ولا شك أن هذا ظاهر من كلام عكرمة وأما كلام السدي فليس مثله في هذا المعنى وهو محتمل. وقد روى ابن أبي حاتم نحو هذا عن ابن عباس من رواية الضحاك عنه قال إن للجن شياطين يضلونهم مثل شياطين الإنس يضلونهم قال فيلتقي شياطين الإنس وشياطين الجن فيقول هذا لهذا أضلله بكذا فهو قوله \"يوحي بعضهم إلى بعض زخرف القول غرورا\" وعلى كل حال فالصحيح ما تقدم من حديث أبي ذر إن للإنس شياطين منهم وشيطان كل شيء ما رده ولهذا جاء في صحيح مسلم عن أبي ذر أن رسول الله صلى الله عليه وسلم قال \"الكلب الأسود شيطان\" ومعناه والله أعلم شيطان في الكلاب وقال ابن جريج قال مجاهد في تفسير هذه الآية: كفار الجن شياطين يوحون إلى شياطين الإنس كفار الإنس زخرف القول غرورا وروى ابن أبي حاتم عن عكرمة قال قدمت على المختار فأكرمني وأنزلني حتى كاد يتعاهد مبيتي بالليل قال: فقال لي اخرج إلى الناس فحدثهم قال: فخرجت فجاء رجل فقال: ما تقول في الوحي فقلت الوحي وحيان قال الله تعالى \"بما أوحينا إليك هذا القرآن\" وقال تعالى \"شياطين الإنس والجن يوحي بعضهم إلى بعض زخرف القول غرورا\" قال فهموا بي أن يأخذوني فقلت لهم: مالكم ذاك إني مفتيكم وضيفكم فتركوني وإنما عرض عكرمة بالمختار وهو ابن أبي عبيد قبحه الله وكان يزعم أنه يأتيه الوحي وقد كانت أخته صفية تحت عبد الله بن عمر وكانت من الصالحات ولما أخبر عبد الله بن عمر أن المختار يزعم أنه يوحى إليه فقال صدق قال الله تعالى \"وإن الشياطين ليوحون إلى أوليائهم\" وقوله تعالى \"يوحى بعضهم إلى بعض زخرف القول غرورا\" أي يلقي بعضهم إلى بعض القول المزين المزخرف وهو المزوق الذي يغتر سامعه من الجهلة بأمره \"ولو شاء ربك ما فعلوه\" أي وذلك كله بقدر الله وقضائه وإرادته ومشيئته أن يكون لكل نبي عدو من هؤلاء \"فذرهم\" أي فدعهم \"وما يفترون\" أي يكذبون أي دع أذاهم وتوكل على الله في عداوتهم فإن الله كافيك وناصرك عليهم."
    },
    {
      "ayah": 113,
      "surah": 6,
      "text": "وقوله تعالى \"ولتصغى إليه\" ولتميل إليه قاله ابن عباس \"أفئدة الذين لا يؤمنون بالآخرة\" أي قلوبهم وعقولهم وأسماعهم وقال السدي: قلوب الكافرين \"وليرضوه\" أي يحبوه ويريدوه وإنما يستجيب لذلك من لا يؤمن بالآخرة كما قال تعالى \"فإنكم وما تعبدون ما أنتم عليه بفاتنين إلا من هو صال الجحيم\" وقال تعالى \"إنكم لفي قول مختلف يؤفك عنه من أفك\" وقوله \"وليقترفوا ما هم مقترفون\" قال علي بن أبي طلحة عن ابن عباس وليكتسبوا ما هم مكتسبون وقال السدي وابن زيد وليعملوا ما هم عاملون."
    },
    {
      "ayah": 114,
      "surah": 6,
      "text": "يقول تعالى لنبيه صلى الله عليه وسلم قل لهؤلاء المشركين بالله الذين يعبدون غيره \"أفغير الله أبتغي حكما\" أي بيني وبينكم \"وهو الذي أنزل إليكم الكتاب مفصلا\" أي مبينا \"والذين آتيناهم الكتاب\" أي من اليهود والنصارى يعلمون أنه منزل من ربك بالحق أي بما عندهم من البشارات بك من الأنبياء المتقدمين \"فلا تكونن من الممترين\" كقوله \"فإن كنت في شك مما أنزلنا إليك فاسأل الذين يقرءون الكتاب من قبلك لقد جاءك الحق من ربك فلا تكونن من الممترين\" وهذا شرط والشرط لا يقتضي وقوعه ولهذا جاء عن رسول الله صلى الله عليه وسلم أنه قال \"لا أشك ولا أسأل\"."
    },
    {
      "ayah": 115,
      "surah": 6,
      "text": "وقوله تعالى \"وتمت كلمة ربك صدقا وعدلا\" قال قتادة: صدقا فيما قال وعدلا فيما حكم يقول صدقا في الأخبار وعدلا في الطلب فكل ما أخبر به فحق لا مرية فيه ولا شك وكل ما أمر به فهو العدل الذي لا عدل سواه وكل ما نهى عنه فباطل فإنه لا ينهى إلا عن مفسدة كما قال تعالى \"يأمرهم بالمعروف وينهاهم عن المنكر\" إلى آخر الآية \"لا مبدل لكلماته\" أي ليس أحد يعقب حكمه تعالى لا فى الدنيا ولا في الآخرة \"وهو السميع\" لأقوال عباده \"العليم\" بحركاتهم وسكناتهم الذي يجازي كل عامل بعمله."
    },
    {
      "ayah": 116,
      "surah": 6,
      "text": "يخبر تعالى عن حال أكثر أهل الأرض من بني آدم أنه الضلال كما قال تعالى \"ولقد ضل قبلهم أكثر الأولين\" وقال تعالى \"وما أكثر الناس ولو حرصت بمؤمنين\" وهم في ضلالهم ليسوا على يقين من أمرهم وإنما هم في ظنون كاذبة وحسبان باطل \"إن يتبعون إلا الظن وإن هم إلا يخرصون\" فإن الخرص هو الحزر ومنه خرص النخل وهو حزر ما عليها من التمر وذلك كله عن قدر الله ومشيئته."
    },
    {
      "ayah": 117,
      "surah": 6,
      "text": "\"هو أعلم من يضل عن سبيله\" فييسره لذلك \"هو أعلم بالمهتدين\" فييسرهم لذلك وكل ميسر لما خلق له."
    },
    {
      "ayah": 118,
      "surah": 6,
      "text": "هذا إباحة من الله لعباده المؤمنين أن يأكلوا من الذبائح ما ذكر عليه اسمه ومفهومه أنه لا يباح ما لم يذكر اسم الله عليه كما كان يستبيحه كفار قريش من أكل الميتات وأكل ما ذبح على النصب وغيرها ثم ندب إلى الأكل مما ذكر اسم الله عليه."
    },
    {
      "ayah": 119,
      "surah": 6,
      "text": "فقال \"وما لكم أن لا تأكلوا مما ذكر اسم الله عليه وقد فصل لكم ما حرم عليكم\" أي قد بين لكم ما حرم عليكم ووضحه وقرأ بعضهم فصل بالتشديد وقرأ آخرون بالتخفيف والكل بمعنى البيان والوضوح \"إلا ما اضطررتم إليه\" أي إلا في حال الاضطرار فإنه يباح لكم ما وجدتم ثم بين تعالى جهالة المشركين في آرائهم الفاسدة من استحلالهم الميتات وما ذكر عليه غير اسم الله تعالى فقال \"وإن كثيرا ليضلون بأهوائهم بغير علم إن ربك هو أعلم بالمعتدين\" أي هو أعلم باعتدائهم وكذبهم وافترائهم."
    },
    {
      "ayah": 12,
      "surah": 6,
      "text": "يخبر تعالى أنه مالك السموات والأرض ومن فيهما وأنه قد كتب على نفسه المقدسة الرحمة كما ثبت في الصحيحين من طريق الأعمش عن أبي صالح عن أبي هريرة رضي الله عنه قال: قال النبي صلى الله عليه وسلم \"إن الله لما خلق الخلق كتب كتابا عنده فوق العرش إن رحمتي تغلب غضبي وقوله \"ليجمعنكم إلى يوم القيامة لا ريب فيه\" هذه اللام هي الموطئة للقسم فأقسم بنفسه الكريمة ليجمعن عباده \"إلى ميقات يوم معلوم\" وهو يوم القيامة الذي لا ريب فيه أي لا شك فيه عند عباده المؤمنين فأما الجاحدون المكذبون فهم في ريبهم يترددون وقال ابن مردوية عن تفسير هذه الآية: حدثنا محمد بن أحمد بن إبراهيم حدثنا عبيد الله بن أحمد بن عقبة حدثنا عباس بن محمد حدثنا حسين بن محمد حدثنا محصن بن عتبة اليماني عن الزبير بن شبيب عن عثمان بن حاضر عن ابن عباس قال: سئل رسول الله صلى الله عليه وسلم عن الوقوف بين يدي رب العالمين هل فيه ماء قال \"والذي نفسي بيده إن فيه لماء إن أولياء الله ليردون حياض الأنبياء ويبعث الله تعالى سبعين ألف ملك في أيديهم عصي من نار يذودون الكفار عن حياض الأنبياء\" هذا حديث غريب. وفي الترمذي \"إن لكل نبي حوضا وأرجو أن أكون أكثرهم واردا\" وقوله \"الذين خسروا أنفسهم\"أي يوم القيامة \" فهم لا يؤمنون\" أي لا يصدقون بالمعاد ولا يخافون شر ذلك اليوم."
    },
    {
      "ayah": 120,
      "surah": 6,
      "text": "قال مجاهد \"وذروا ظاهر الإثم وباطنه\" معصيته في السر والعلانية وفي رواية عنه هو ما ينوى مما هو عامل وقال قتادة \"وذروا ظاهر الإثم وباطنه\" أي سره وعلانيته قليله وكثيره وقال السدي: ظاهره الزنا مع البغايا ذوات الرايات وباطنه الزنا مع الخليلة والصدائق والأخدان وقال عكرمة ظاهره نكاح ذوات المحارم والصحيح أن الآية عامة في ذلك كله وهي كقوله تعالى \"قل إنما حرم ربي الفواحش ما ظهر منها وما بطن\" الآية ولهذا قال تعالى \"إن الذين يكسبون الإثم سيجزون بما كانوا يقترفون\" أي سواء كان ظاهرا أو خفيا فإن الله سيجزيهم عليه قال ابن أبي حاتم: حدثنا الحسن بن عرفة حدثنا عبد الرحمن بن مهدي عن معاوية بن صالح عن عبد الرحمن بن جبير بن نفير عن أبيه عن النواس بن سمعان قال: سألت رسول الله صلى الله عليه وسلم عن الإثم فقال \"الإثم ما حاك في صدرك وكرهت أن يطلع الناس عليه\"."
    },
    {
      "ayah": 121,
      "surah": 6,
      "text": "استدل بهذه الآية الكريمة من ذهب إلى أن الذبيحة لا تحل إذا لم يذكر اسم الله عليها وإن كان الذابح مسلما وقد اختلف الأئمة رحمهم الله في هذه المسألة على ثلاثة أقوال فمنهم من قال لا تحل هذه الذبيحة بهذه الصفة وسواء متروك التسمية عمدا أو سهوا وهو مروي عن ابن عمر ونافع مولاه وعامر الشعبي ومحمد بن سيرين وهو رواية عن الإمام مالك ورواية عن أحمد بن حنبل نصرها طائفة من أصحابه المتقدمين والمتأخرين وهو اختيار أبي ثور وداود الظاهري واختار ذلك أبو الفتوح محمد بن محمد بن علي الطائي من متأخري الشافعية في كتابه الأربعين واحتجوا لمذهبهم هذا بهذه الآية وبقوله في آية الصيد \"فكلوا مما أمسكن عليكم واذكروا اسم الله عليه\" ثم قد أكد في هذه الآية قوله \"وإنه لفسق\" والضمير قيل عائد على الأكل وقيل عائد على الذبح لغير الله وبالأحاديث الواردة في الأمر بالتسمية عند الذبيحة والصيد كحديثي عدي بن حاتم وأبي ثعلبة \"إذا أرسلت كلبك المعلم وذكرت اسم الله عليه فكل ما أمسك عليك\" وهما في الصحيحين وحديث رافع بن خديج ما أنهر الدم وذكر اسم الله عليه فكلوه وهو في الصحيحين أيضا وحديث ابن مسعود أن رسول الله صلى الله عليه وآله وسلم قال للجن لكم كل عظم ذكر اسم الله عليه رواه مسلم وحديث جندب بن سفيان البجلي قال: قال رسول الله صلى الله عليه وسلم من ذبح قبل أن يصلي فليذبح مكانها أخرى ومن لم يكن ذبح حتى صلينا فليذبح باسم الله أخرجاه. وعن عائشة رضي الله عنها أن ناسا قالوا: يا رسول الله إن قوما يأتوننا باللحم لا ندري أذكر اسم الله عليه أم لا؟ قال سموا عليه أنتم وكلوا قال: وكانوا حديثي عهد بالكفر رواه البخاري. ووجه الدلالة أنهم فهموا أن التسمية لا بد منها وخشوا أن لا تكون وجدت من أولئك لحداثة إسلامهم فأمرهم بالاحتياط بالتسمية عند الأكل لتكون كالعوض عن المتروكة عند الذبح إن لم تكن وجدت وأمرهم بإجراء أحكام المسلمين على السداد والله أعلم. والمذهب الثاني في المسألة أنه لا يشترط التسمية بل هي مستحبة فإن تركت عمدا أو نسيانا لا يضر وهذا مذهب الإمام الشافعي رحمه الله وجميع أصحابه ورواية عن الإمام أحمد نقلها عنه حنبل وهو رواية عن الإمام مالك ونص على ذلك أشهب بن عبد العزيز من أصحابه وحكي عن ابن عباس وأبي هريرة وعطاء بن أبي رباح والله أعلم. وحمل الشافعي الآية الكريمة \"ولا تأكلوا مما لم يذكر اسم الله عليه وإنه لفسق\" على ما ذبح لغير الله كقوله تعالى \"أو فسقا أهل لغير الله به\" وقال ابن جريج عن عطاء \"ولا تأكلوا مما لم يذكر اسم الله عليه\" قال: ينهى عن ذبائح كانت تذبحها قريش للأوثان وينهى عن ذبائح المجوس وهذا المسلك الذي طرقه الإمام الشافعي قوي وقد حاول بعض المتأخرين أن يقويه بأن جعل الواو في قوله \"إنه لفسق\" حالية أي: لا تأكلوا مما لم يذكر اسم الله عليه في حال كونه فسقا ولا يكون فسقا حتى يكون قد أهل به لغير الله. ثم ادعى أن هذا متعين ولا يجوز أن تكون الواو عاطفة لأنه يلزم منه عطف جملة إسمية خبرية على جمله فعليه طلبية وهذا ينتقض عليه بقوله \"وإن الشياطين ليوحون إلى أوليائهم\" فإنها عاطفة لا محاولة فإن كانت الواو التي ادعى أنها حالية صحيحة على ما قال امتنع عطف هذه عليها فإن عطفت على الطلبية ورد عليه ما أورد على غيره وإن لم تكن الواو حالية بطل ما قال من أصله والله أعلم وقال ابن أبي حاتم: حدثنا أبي حدثنا يحيى بن المغيرة أنبأنا جرير عن عطاء عن سعيد بن جبير عن ابن عباس في الآية \"ولا تأكلوا مما لم يذكر اسم الله عليه\" قال هي الميتة. ثم رواه عن أبي زرعة عن يحيى بن أبي كثير عن ابن لهيعة عن عطاء وهو ابن السائب به وقد استدل لهذا المذهب بما رواه أبو داود في المراسيل من حديث ثور بن يزيد عن الصلت السدوسي مولى سويد بن ميمون أحد التابعين الذين ذكرهم أبو حاتم بن حبان في كتاب الثقات قال: قال رسول الله صلى الله عليه وسلم ذبيحة المسلم حلال ذكر اسم الله أو لم يذكر إنه إن ذكر لم يذكر إلا اسم الله وهذا مرسل يعضد بما رواه الدارقطني عن ابن عباس أنه قال إذا ذبح المسلم ولم يذكر اسم الله فليأكل فإن المسلم فيه اسم من أسماء الله واحتج البيهقي أيضا بحديث عائشة رضي الله عنها المتقدم أن ناسا قالوا يا رسول الله إن قوما حديثي عهد بجاهلية يأتوننا بلحم لا ندري أذكروا اسم الله عليه أم لا؟ فقال سموا أنتم وكلوا قالوا فلو كان وجود التسمية شرطا لم يرخص لهم إلا مع تحققها والله أعلم. المذهب الثالث في المسألة إن ترك البسملة على الذبيحة نسيانا لم يضر وإن تركها عمدا لم تحل هذا هو المشهور من مذهب الإمام مالك وأحمد بن حنبل وبه يقول أبو حنيفة وأصحابه وإسحق بن راهويه وهو محكي عن علي وابن عباس وسعيد بن المسيب وعطاء وطاوس والحسن البصري وأبي مالك وعبد الرحمن بن أبي ليلى وجعفر بن محمد وربيعة بن أبي عبد الرحمن ونقل الإمام أبو الحسن المرغيناني في كتابه الهداية الإجماع قبل الشافعي على تحريم متروك التسمية عمدا فلهذا قال أبو يوسف والمشايخ لو حكم حاكم بجواز بيعه لم ينفذ لمخالفة الإجماع وهذا الذي قاله غريب جدا وقد تقدم نقل الخلاف عمن قبل الشافعي والله أعلم. وقال الإمام أبو جعفر بن جرير رحمه الله من حرم ذبيحة الناسي فقد خرج من قول جميع الحجة وخالف الخبر الثابت عن رسول الله صلى الله عليه وسلم في ذلك يعني ما رواه الحافظ أبو بكر البيهقي أنبأنا أبو عبد الله الحافظ حدثنا أبو العباس الأصم حدثنا أبو أمية الطرسوسي حدثنا محمد بن يزيد حدثنا معقل بن عبيد الله عن عمرو بن دينار عن عكرمة عن ابن عباس عن النبي صلى الله عليه وسلم قال المسلم يكفيه اسمه إن نسي أن يسمي حين يذبح فليذكر اسم الله وليأكله وهذا الحديث رفعه خطأ أخطأ فيه معقل بن عبيد الله الجزري فإنه وإن كان من رجال مسلم إلا أن سعيد بن منصور وعبد الله بن الزبير الحميدي روياه عن سفيان بن عيينة عن عمرو عن أبي الشعثاء عن عكرمة عن ابن عباس من قوله فزادا في إسناده أبا الشعثاء ووثقاه وهذا أصح نص عليه البيهقي وغيره من الحفاظ ثم نقل ابن جرير وغيره عن الشعبي ومحمد بن سيرين أنهما كرها متروك التسمية نسيانا والسلف يطلقون الكراهية على التحريم كثيرا والله أعلم إلا أن من قاعدة ابن جرير أنه لا يعتبر قول الواحد ولا الاثنين مخالفا لقول الجمهور فيعده إجماعا فليعلم هذا والله الموفق قال ابن جرير: حدثنا ابن وكيع حدثنا أبو أسامة عن جبير بن يزيد قال: سئل الحسن سأله رجل أتيت بطير كذا فمنه ما قد ذبح فذكر اسم الله عليه ومنه ما نسي أن يذكر اسم الله عليه واختلط الطير فقال الحسن كله كله قال وسألت محمد بن سيرين فقال: قال الله \"ولا تأكلوا مما لم يذكر اسم الله عليه\" واحتج لهذا المذهب بالحديث المروي من طرق عند ابن ماجه عن ابن عباس وأبي هريرة وأبي ذر وعقبة بن عامر وعبد الله بن عمرو عن النبي صلى الله عليه وسلم إن الله وضع عن أمتي الخطأ والنسيان وما استكرهوا عليه وفيه نظر والله أعلم وقد روى الحافظ أبو أحمد بن عدي من حديث مروان بن سالم القرقساني عن الأوزاعي عن يحيى بن أبي كثير عن أبي سلمة عن أبي هريرة قال جاء رجل إلى النبي صلى الله عليه وسلم فقال: يا رسول الله أرأيت الرجل منا يذبح وينسى أن يسمي؟ ففال النبي صلى الله عليه وسلم اسم الله على كل مسلم ولكن هذا إسناده ضعيف فإن مروان بن سالم القرقساني أبا عبد الله الشامي ضعيف تكلم فيه غير واحد من الأئمة والله أعلم وقد أفردت هذه المسألة على حدة وذكرت مذهب الأئمة ومأخذهم وأدلتهم ووجه الدلالات والمناقضات والمعارضات والله أعلم. قال ابن جرير: وقد اختلف أهل العلم في هذه الآية هل نسخ من حكمها شيء أم لا؟ فقال بعضهم لم ينسخ منها شيء وهي محكمة فيما عنيت به وعلى هذا قول مجاهد وعامة أهل العلم وروي عن الحسن البصري وعكرمة ما حدثنا به ابن حميد: حدثنا يحيى بن واضح عن الحسين بن واقد عن عكرمة والحسن البصري قالا: قال الله \"فكلوا مما ذكر اسم الله عليه إن كنتم بآياته مؤمنين\" وقال \"ولا تأكلوا مما لم يذكر اسم الله عليه وإنه لفسق\" فنسخ واستثنى من ذلك فقال \"وطعام الذين أوتوا الكتاب حل لكم وطعامكم حل لهم\" وقال ابن أبي حاتم: قرأ علي العباس بن الوليد بن يزيد حدثنا محمد بن سعيد أخبرني النعمان يعني ابن المنذر عن مكحول قال: أنزل الله في القرآن \"ولا تأكلوا مما لم يذكر اسم الله عليه\" ثم نسخها الرب ورحم المسلمين فقال \"اليوم أحل لكم الطيبات وطعام الذين أوتوا الكتاب حل لكم\" فنسخها بذلك وأحل طعام أهل الكتاب ثم قال ابن جرير: والصواب أنه لا تعارض بين حل طعام أهل الكتاب وبين تحريم ما لم يذكر اسم الله عليه وهذا الذي قاله صحيح ومن أطلق من السلف النسخ ههنا فإنما أراد التخصيص والله سبحانه وتعالى أعلم وقوله تعالى \"وإن الشياطين ليوحون إلى أوليائهم ليجادلوكم\" قال ابن أبي حاتم: حدثنا أبو سعيد الأشج حدثنا أبو بكر بن عياش عن أبي إسحاق قال: قال رجل لابن عمر إن المختار يزعم أنه يوحى إليه قال صدق وتلا هذه الآية \"وإن الشياطين ليوحون إلى أوليائهم\" وحدثنا أبي حدثنا أبو حذيفة حدثنا عكرمة بن عمار عن أبي زميل قال: كنت قاعدا عند ابن عباس وحج المختار ابن أبي عبيد فجاءه رجل فقال يا ابن عباس زعم أبو إسحاق أنه أوحي إليه الليلة فقال ابن عباس صدق فنفرت وقلت يقول ابن عباس صدق فقال ابن عباس هما وحيان وحي الله ووحي الشيطان فوحي الله إلى محمد صلى الله عليه وسلم ووحي الشيطان إلى أوليائه ثم قرأ \"وإن الشياطين ليوحون إلى أوليائهم\" وقد تقدم عن عكرمة في قوله \"يوحي بعضهم إلى بعض زخرف القول غرورا\" نحو هذا وقوله \"ليجادلوكم\" قال ابن أبي حاتم: حدثنا أبو سعيد الأشج حدثنا عمران بن عيينة عن عطاء بن السائب عن سعيد بن جبير قال: خاصمت اليهود النبي صلى الله عليه وسلم فقالوا نأكل مما قتلنا ولا نأكل مما قتل الله؟ فأنزل الله \"ولا تأكلوا مما لم يذكر اسم الله عليه وإنه لفسق\" هكذا رواه مرسلا ورواه أبو داود متصلا فقال حدثنا عثمان بن أبي شيبة حدثنا عمران بن عيينة عن عطاء بن السائب عن سعيد بن جبير عن ابن عباس قال جاءت اليهود إلى النبي صلى الله عليه وآله وسلم فقالوا نأكل مما قتلنا ولا نأكل مما قتل الله؟ فأنزل الله \"ولا تأكلوا مما لم يذكر اسم الله عليه\" الآية وكذا رواه ابن جرير عن محمد بن عبد الأعلى وسفيان بن وكيع كلاهما عن عمران بن عيينة به. ورواه البزار عن محمد بن موسى الجرسي عن عمران بن عيينة به وهذا فيه نظر من وجوه ثلاثة \" أحدها \"أن اليهود لا يرون إباحة الميتة حتى يجادلوا \" الثاني \"أن الآية من الأنعام وهي مكية. \" الثالث \"أن هذا الحديث رواه الترمذي عن محمد بن موسى الجرسي عن زياد بن عبد الله البكائي عن عطاء بن السائب عن سعيد بن جبير عن ابن عباس ورواه الترمذي بلفظ: أتى ناس النبي صلى الله عليه وسلم فذكره وقال حسن غريب. وروي عن سعيد بن جبير مرسلا وقال الطبراني: حدثنا علي بن المبارك حدثنا زيد بن المبارك حدثنا موسى بن عبد العزيز حدثنا الحكـم بن أبان عن عكرمة عن ابن عباس قال: لما نزلت \"ولا تأكلوا مما لم يذكر اسم الله عليه\" أرسلت فارس إلى قريش أن خاصموا محمدا وقولوا له فما تذبح أنت بيدك بسكين فهو حلال وما ذبح الله عز وجل بشمشير من ذهب يعني الميتة فهو حرام فنزلت هذه الآية \"وإن الشياطين ليوحون إلى أوليائهم ليجادلوكم وإن أطعتموهم إنكم لمشركون\" أي وإن الشياطين من فارس ليوحون إلى أوليائهم من قريش وقال أبو داود: حدثنا محمد بن كثير أخبرنا إسرائيل حدثنا سماك عن عكرمة عن ابن عباس في قوله \"وإن الشياطين ليوحون إلى أوليائهم\" يقولون ما ذبح الله فلا تأكلوه وما ذبحتم أنتم فكلوه فأنزل الله \"ولا تأكلوا مما لم يذكر اسم الله عليه\" ورواه ابن ماجه وابن أبي حاتم عن عمرو بن عبد الله عن وكيع عن إسرائيل به وهذا إسناد صحيح. ورواه ابن جرير من طرق متعددة عن ابن عباس وليس فيه ذكر اليهود فهذا هو المحفوظ لأن الآية مكية واليهود لا يحبون الميتة. وقال ابن جرير: حدثنا ابن وكيع حدثنا جرير عن عطاء عن سعيد بن جبير عن ابن عباس \"ولا تأكلوا مما لم يذكر اسم الله عليه\" إلى قوله \"ليجادلوكم\" قال: يوحي الشياطين إلى أوليائهم تأكلون مما قتلتم ولا تأكلون مما قتل الله؟ وفي بعض ألفاظه عن ابن عباس أن الذي قتلتم ذكر اسم الله عليه وأن الذي قد مات لم يذكر اسم الله عليه وقال ابن جريج: قال عمرو بن دينار عن عكرمة إن مشركي قريش كاتبوا فارس على الروم وكاتبتهم فارس فكتب فارس إليهم إن محمدا وأصحابه يزعمون أنهم يتبعون أمر الله فما ذبح الله بسكين من ذهب فلا يأكلونه وما ذبحوه هم يأكلونه فكتب بذلك المشركون إلى أصحاب رسول الله صلى الله عليه وسلم فوقع في أنفس ناس من المسلمون من ذلك شيء فأنزل الله \"وإنه لفسق وإن الشياطين ليوحون إلى أوليائهم ليجادلوكم وإن أطعتموهم إنكم لمشركون\" ونزلت \"يوحي بعضهم إلى بعض زخرف القول غرورا\" وقال السدي في تفسير هذه الآية إن المشركين قالوا للمسلمين كيف تزعمون أنكم تتبعون مرضات الله فما قتل الله فلا تأكلونه وما ذبحتم أنتم تأكلونه؟ فقال الله تعالى \"وإن أطعتموهم\" في أكل الميتة \"إنكم لمشركون\" وهكذا قاله مجاهد والضحاك وغير واحد من علماء السلف. وقوله تعالى \"وإن أطعتموهم إنكم لمشركون\" أي حيث عدلتم عن أمر الله لكم وشرعه إلى قول غيره فقدمتم عليه غيره فهذا هو الشرك كقوله تعالى \"اتخذوا أحبارهم ورهبانهم أربابا من دون الله\" الآية. وقد روى الترمذي في تفسيرها عن عدي بن حاتم أنه قال: يا رسول الله ما عبدوهم فقال بلى إنهم أحلوا لهم الحرام وحرموا عليهم الحلال فاتبعوهم فذلك عبادتهم إياهم."
    },
    {
      "ayah": 122,
      "surah": 6,
      "text": "هذا مثل ضربه الله تعالى للمؤمن الذي كان ميتا أي في الضلالة هالكا حائرا فأحياه الله أي أحيا قلبه بالإيمان وهداه له ووفقه لاتباع رسله \"وجعلنا له نورا يمشي به في الناس\" أي يهتدي كيف يسلك وكيف يتصرف به والنور هو القرآن كما رواه العوفي وابن أبي طلحة عن ابن عباس وقال السدي: الإسلام والكل صحيح \"كمن مثله في الظلمات\" أي الجهالات والأهواء والضلالات المتفرفة \"ليس بخارج منها\" أي لا يهتدي إلى منفذ ولا مخلص مما هو فيه وفي مسند الإمام أحمد عن رسول الله صلى الله عليه وسلم أنه قال \"إن الله خلق خلقه في ظلمة ثم رش عليهم من نوره فمن أصابه ذلك النور اهتدى ومن أخطأه ضل\" كما قال تعالى \"الله ولي الذين آمنوا يخرجهم من الظلمات إلى النور والذين كفروا أولياؤهم الطاغوت يخرجونهم من النور إلى الظلمات أولئك أصحاب النار هم فيها خالدون\" وقال تعالى \"أفمن يمشي مكبا على وجهه أهدى أم من يمشي سويا على صراط مستقيم\" وقال تعالى \"مثل الفريقين كالأعمى والأصم والبصير والسميع هل يستويان مثلا أفلا تذكرون\" وقال تعالى \"وما يستوي الأعمى والبصير ولا الظلمات ولا النور ولا الظل ولا الحرور وما يستوي الأحياء ولا الأموات إن الله يسمع من يشاء وما أنت بمسمع من فى القبور إن أنت إلا نذير\" والآيات في هذا كثيرة ووجه المناسبة في ضرب المثلين ههنا بالنور والظلمات ما تقدم في أول السورة \"وجعل الظلمات والنور\" وزعم بعضهم أن المراد بهذا المثل رجلان معينان فقيل عمر بن الخطاب هو الذي كان ميتا فأحياه الله وجعل له نورا يمشي به في الناس وقيل عمار بن ياسر وأما الذي في الظلمات ليس بخارج منها أبو جهل عمرو بن هشام لعنه الله. والصحيح أن الآية عامة يدخل فيها كل مؤمن وكافر. وقوله تعالى \"كذلك زين للكافرين ما كانوا يعملون\" أي حسنا لهم ما كانوا فيه من الجهالة والضلالة قدرا من الله وحكمة بالغة لا إله إلا هو وحده لا شريك له."
    },
    {
      "ayah": 123,
      "surah": 6,
      "text": "يقول تعالى: وكما جعلنا في قريتك يا محمد أكابر من المجرمين ورؤساء ودعاة إلى الكفر والصد عن سبيل الله وإلى مخالفتك وعداوتك كذلك كانت الرسل من قبلك يبتلون بذلك ثم تكون لهم العاقبة كما قال تعالى \"وكذلك جعلنا لكل نبي عدوا من المجرمين\" الآية وقال تعالى \"وإذا أردنا أن نهلك قرية أمرنا مترفيها ففسقوا فيها\" الآية قيل معناه أمرناهم بالطاعة فخالفوا فدمرناهم وقيل أمرناهم أمرا قدريا كما قال ههنا \"ليمكروا فيها\" وقوله تعالى \"أكابر مجرميها ليمكروا فيها\" قال ابن أبي طلحة عن ابن عباس \"أكابر مجرميها ليمكروا فيها\" قال سلطنا شرارهم فعصوا فيها فإذا فعلوا ذلك أهلكناهم بالعذاب. وقال مجاهد وقتادة \"أكابر مجرميها\" عظماؤها قلت: وهكذا قوله تعالى \"وما أرسلنا في قرية من نذير إلا قال مترفوها إنا بما أرسلتم به كافرون وقالوا نحن أكثر أموالا وأولادا وما نحن بمعذبين\" وقال تعالى \"وكذلك ما أرسلنا من قبلك في قرية من نذير إلا قال مترفوها إنا وجدنا آباءنا على أمة وإنا على آثارهم مقتدون\" والمراد بالمكر ههنا دعاؤهم إلى الضلالة بزخرف من المقال والفعال كقوله تعالى إخبارا عن قوم نوح \"ومكروا مكرا كبارا\" وكقوله تعالى \"ولو ترى إذ الظالمون موقوفون عند ربهم يرجع بعضهم إلى بعض القول يقول الذين استضعفوا للذين استكبروا لولا أنتم لكنا مؤمنين قال الذين استكبروا للذين استضعفوا أنحن صددناكم عن الهدى بعد إذ جاءكم بل كنتم مجرمين وقال الذين استضعفوا للذين استكبروا بل مكر الليل والنهار إذ تأمروننا أن نكفر بالله ونجعل له أندادا\" الآية وقال ابن أبي حاتم: حدثنا أبي حدثنا ابن أبي عمر حدثنا سفيان قال: كل مكر في القرآن فهو عمل وقوله تعالى \"وما يمكرون إلا بأنفسهم وما يشعرون\" أي وما يعود وبال مكرهم ذلك وإضلالهم من أضلوه إلا على أنفسهم كما قال تعالى \"وليحملن أثقالهم وأثقالا مع أثقالهم\" وقال \"ومن أوزار الذين يضلونهم بغير علم ألا ساء ما يزرون\"."
    },
    {
      "ayah": 124,
      "surah": 6,
      "text": "وقوله تعالى \"وإذا جاءتهم آية قالوا لن نؤمن حتى نؤتى مثل ما أوتي رسل الله\" أي إذا جاءتهم آية وبرهان وحجة قاطعة قالوا \"لن نؤمن حتى نؤتى مثل ما أوتي رسل الله\" أي حتى تأتينا الملائكة من الله بالرسالة كما تأتي إلى الرسل كقوله جل وعلا \"وقال الذين لا يرجون لقاءنا لولا أنزل علينا الملائكة أو نرى ربنا\" الآية وقوله \"الله أعلم حيث يجعل رسالته\" أي هو أعلم حيث يضع رسالته ومن يصلح لها من خلقه كقوله تعالى \"وقالوا لولا نزل هذا القرآن على رجل من القريتين عظيم أهم يقسمون رحمة ربك\" الآية يعنون لولا نزل هذا القرآن على رجل عظيم كبير جليل مبجل في أعينهم \"من القريتين\" أي من مكة والطائف وذلك أنهم قبحهم الله كانوا يزدرون بالرسول صلوات الله وسلامه عليه بغيا وحسدا وعنادا واستكبارا كقوله تعالى مخبرا عنه \"وإذا رآك الذين كفروا إن يتخذونك إلا هزوا أهذا الذي بعث الله رسولا\" وقال تعالى \"وإذا رأوك إن يتخذونك إلا هزوا أهذا الذي يذكر آلهتكم وهم بذكر الرحمن هم كافرون\" وقال تعالى \"ولقد استهزئ برسل من قبلك فحاق بالذين سخروا منهم ما كانوا به يستهزئون\" هذا وهم معترفون بفضله وشرفه ونسبه وطهارة بيته ومرباه ومنشئه صلى الله وملائكته والمؤمنون عليه حتى أنهم كانوا يسمونه بينهم قبل أن يوحى إليه الأمين \"وقد اعترف بذلك رئيس الكفار أبو سفيان حين سأله هرقل ملك الروم وكيف نسبه فيكم؟ قال هو فينا ذو نسب قال هل كنتم تتهمونه بالكذب قبل أن يقول ما قال؟ قال لا - الحديث بطوله الذي استدل ملك الروم بطهارة صفاته عليه السلام على صدق نبوته وصحة ما جاء به وقال الإمام أحمد: حدثنا محمد بن مصعب حدثنا الأوزاعي عن شداد أبي عمار عن واثلة بن الأسقع رضي الله عنه أن رسول الله صلى الله عليه وآله وسلم قال إن الله اصطفى من ولد إبراهيم إسماعيل واصطفى من بني إسماعيل بني كنانة واصطفى من بنى كنانة قريشا واصطفى من قريش بني هاشم واصطفاني من بني هاثسم انفرد بإخراجه مسلم من حديث الأوزاعي وهو عبد الرحمن بن عمرو إمام أهل الشام به نحوه وفي صحيح البخاري عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم بعثت من خير قرون بني آدم قرنا فقرنا حتى بعثت من القرن الذي كنت فيه وقال الإمام أحمد: حدثنا أبو نعيم عن سفيان عن يزيد بن أبي زياد عن عبد الله بن الحارث بن نوفل عن المطلب بن أبي وداعة قال: قال العباس بلغه صلى الله عليه وسلم بعض ما يقول الناس فصعد المنبر فقال من أنا؟ قالوا: أنت رسول الله فقال أنا محمد بن عبد الله بن عبد المطلب إن الله خلق الخلق فجعلني في خير خلقه وجعلهم فريقين فجعلني في خير فرقة وخلق القبائل فجعلني في خير قبيلة وجعلهم بيوتا فجعلني في خيرهم بيتا; فأنا خيركم بيتا وخيركم نفسا صدق صلوات الله وسلامه عليه وفي الحديث أيضا المروي عن عائشة رضي الله عنها قالت: قال رسول الله صلى الله عليه وسلم قال لي جبريل قلبت الأرض مشارقها ومغاربها فلم أجد رجلا أفضل من محمد وقلبت الأرض مشارقها ومغاربها فلم أجد بني أب أفضل من بني هاشم رواه الحاكم والبيهقى. وقال الإمام أحمد: حدثنا أبو بكر حدثنا عاصم عن زر بن حبيش عن عبد الله بن مسعود قال: إن الله نظر في قلوب العباد فوجد قلب محمد صلى الله عليه وسلم خير قلوب العباد فاصطفاه لنفسه فبعثه برسالته ثم نظر في قلوب العباد بعد قلب محمد صلى الله عليه وسلم فوجد قلوب أصحابه خير قلوب العباد فجعلهم وزراء نبيه يقاتلون على دينه فما رآه المسلمون حسنا فهو عند الله حسن وما رآه المسلمون سيئا فهو عند الله سيء. وقال أحمد: حدثنا شجاع بن الوليد قال: ذكر قابوس بن أبي ظبيان عن أبيه عن سلمان قال: قال لي رسول الله صلى الله عليه وسلم يا سلمان لا تبغضني فتفارق دينك قلت يا رسول الله كيف أبغضك وبك هدانا الله؟ قال تبغض العرب فتبغضني وذكر ابن أبي حاتم في تفسير هذه الآية ذكر عن محمد بن منصور الجواز حدثنا سفيان عن أبي حسين قال: أبصر رجل ابن عباس وهو داخل من باب المسجد فلما نظر إليه راعه فقال من هذا قالوا ابن عباس ابن عم رسول الله صلى الله عليه وسلم فقال \" الله أعلم حيث يجعل رسالته \"; وقوله تعالى \"سيصيب الذين أجرموا صغار عند الله وعذاب شديد\" الآية هذا وعيد شديد من الله وتهديد أكيد لمن تكبر عن اتباع رسله والانقياد لهم فيما جاءوا به فإنه سيصيبه يوم القيامة بين يدي الله صغار وهو الذلة الدائمة كما أنهم استكبروا أعقبهم ذلك ذلا يوم القيامة لما استكبروا في الدنيا كقوله تعالى \"إن الذين يستكبرون عن عبادتي سيدخلون جهنم داخرين\" أي صاغرين ذليلين حقيرين وقوله تعالى \"وعذاب شديد بما كانوا يمكرون\" لما كان المكر غالبا إنما يكون خفيا وهو التلطف في التحيل والخديعة قوبلوا بالعذاب الشديد من الله يوم القيامة جزاء وفاقا \"ولا يظلم ربك أحدا\" كما قال تعالى \"يوم تبلى السرائر\" أي تظهر المستترات والمكنونات والضمائر وجاء في الصحيحين عن رسول الله صلى الله عليه وسلم أنه قال ينصب لكل غادر لواء عند استه يوم القيامة فيقال هذه غدرة فلان بن فلان والحكمة في هذا أنه لما كان الغدر خفيا لا يطلع عليه الناس فيوم القيامة يصير علما منشورا على صاحبه بما فعل."
    },
    {
      "ayah": 125,
      "surah": 6,
      "text": "يقول تعالى: فمن يرد الله أن يهديه يشرح صدره للإسلام أي ييسره له وينشطه ويسهله لذلك فهذه علامات على الخير كقوله تعالى \"أفمن شرح الله صدره للإسلام فهو على نور من ربه\" الآية وقال تعالى \"ولكن الله حبب إليكم الإيمان وزينه في قلوبكم وكره إليكم الكفر والفسوق والعصيان أولئك هم الراشدون\" وقال ابن عباس في قوله \"فمن يرد الله أن يهديه يشرح صدره للإسلام\" يقول تعالى يوسع قلبه للتوحيد والإيمان به وكذا قال أبو مالك وغير واحد وهو ظاهر. وقال عبد الرزاق أخبرنا الثوري عن عمرو بن قيس عن عمرو بن مرة عن أبي جعفر قال: سئل رسول الله صلى الله عليه وسلم أي المؤمنين أكيس؟ قال \"أكثرهم ذكرا للموت وأكثرهم لما بعده استعدادا\" قال: وسئل النبي صلى الله عليه وسلم عن هذه الآية \"فمن يرد الله أن يهديه يشرح صدره للإسلام\" قالوا: كيف يشرح صدره يا رسول الله؟ قال نور يقذف فيه فينشرح له وينفسح قالوا: فهل لذلك من أمارة يعرف بها؟ قال الإنابة إلى دار الخلود والتجافي عن دار الغرور والاستعداد للموت قبل لقاء الموت وقال ابن جرير: حدثنا هناد حدثنا قبيصة عن سفيان يعني الثوري عن عمرو بن مرة عن رجل يكنى أبا جعفر كان يسكن المدائن قال: سئل النبي صلى الله عليه وسلم عن قول الله تعالى \"فمن يرد الله أن يهديه يشرح صدره للإسلام\" فذكر نحو ما تقدم. وقال ابن أبي حاتم: حدثنا أبو سعيد الأشج حدثنا ابن إدريس عن الحسن بن الفرات القزاز عن عمرو بن مرة عن أبي جعفر قال: قال رسول الله صلى الله عليه وسلم \"فمن يرد الله أن يهديه يشرح صدره للإسلام\" قال رسول الله صلى الله عليه وسلم إذا دخل الإيمان القلب انفسح له القلب وانشرح قالوا: يا رسول الله هل لذلك من أمارة؟ قال نعم الإنابة إلى دار الخلود والتجافي عن دار الغرور والاستعداد للموت قبل الموت وقد رواه ابن جرير عن سوار بن عبد الله العنبري حدثنا المعتمر بن سليمان سمعت أبي يحدث عن عبد الله بن مرة عن أبي جعفر فذكره. وقال ابن أبي حاتم: حدثنا أبو سعيد الأشج حدثنا أبو خالد الأحمر عن عمرو بن قيس عن عمرو بن مرة عن عبد الله بن مسعود قال: تلا رسول الله صلى الله عليه وسلم هذه الآية \"فمن يرد الله أن يهديه يشرح صدره للإسلام\" قالوا: يا رسول الله ما هذا الشرح؟ قال نور يقذف في القلب قالوا: يا رسول الله فهل لذلك من أمارة تعرف؟ قال نعم قالوا: وما هي؟ قال: الإنابة إلى دار الخلود والتجافي عن دار الغرور والاستعداد للموت قبل الموت. وقال ابن جرير أيضا: حدثني هلال بن العلاء حدثنا سعيد بن عبد الملك بن وافد حدثنا محمد بن مسلم عن أبي عبد الرحمن عن زيد بن أبي أنيسة عن عمرو بن مرة عن أبي عبيدة بن عبد الله بن مسعود قال: قال رسول الله صلى الله عليه وسلم إذا دخل النور القلب انفسح وانشرح قالوا: فهل لذلك من علامة يعرف بها؟ قال الإنابة إلى دار الخلود والتنحي عن دار الغرور والاستعداد للموت قبل لقاء الموت وقد رواه من وجه آخر عن ابن مسعود متصلا مرفوعا فقال: حدثني ابن سنان القزاز حدثنا محبوب بن الحسن الهاشمي عن يونس عن عبد الرحمن بن عبيد بن عتبة عن عبد الله بن مسعود عن رسول الله صلى الله عليه وسلم قال \"فمن يرد الله أن يهديه يشرح صدره للإسلام\" قالوا: يا رسول الله وكيف يشرح صدره؟ قال يدخل فيه النور فينفسح قالوا: وهل لذلك علامة يا رسول الله؟ قال التجافي عن دار الغرور والإنابة إلى دار الخلود والاستعداد للموت قبل أن ينزل الموت فهذه طرق لهذا الحديث مرسلة ومتصلة يشد بعضها بعضا والله أعلم. وقوله تعالى \"ومن يرد أن يضله يجعل صدره ضيقا حرجا\" قرئ بفتح الضاد وتسكين الياء والأكثرون ضيقا بتشديد الياء وكسرها وهما لغتان كهين وهين وقرأ بعضهم حرجا بفتح الحاء وكسر الراء قيل بمعنى أثم قاله السدي. وقيل بمعنى القراءة الأخرى حرجا بفتح الحاء والراء وهو الذي لا يتسع لشيء من الهدى ولا يخلص إليه شيء ما ينفعه من الإيمان ولا ينفذ فيه وقد سأل عمر بن الخطاب رضي الله عنه رجلا من الأعراب من أهل البادية من مدلج عن الحرجة فقال هي الشجرة تكون بين الأشجار لا تصل إليها راعية ولا وحشية ولا شيء فقال عمر رضي الله عنه: كذلك قلب المنافق لا يصل إليه شيء من الخير. وقال العوفي عن ابن عباس يجعل الله عليه الإسلام ضيقا والإسلام واسع وذلك حين يقول \"ما جعل عليكم في الدين من حرج\" يقول ما جعل عليكم في الإسلام من ضيق وقال مجاهد والسدي: ضيقا حرجا شاكا. وقال عطاء الخراساني ضيقا حرجا أي ليس للخير فيه منفذ وقال ابن المبارك عن ابن جريج ضيقا حرجا بلا إله إلا الله حتى يستطيع أن تدخل قلبه كأنما يصعد في السماء من شدة ذلك عليه. وقال سعيد بن جبير يجعل صدره ضيقا حرجا قال: لا يجد فيه مسلكا إلا صعدا وقال السدي \"كأنما يصعد في السماء\" من ضيق صدره. وقال عطاء الخراساني \"كأنما يصعد فى السماء\" يقول مثله كمثل الذي لا يستطيع أن يصعد إلى السماء. وقال الحكم بن أبان عن عكرمة عن ابن عباس \"كأنما يصعد في السماء\" يقول فكما لا يستطيع ابن آدم أن يبلغ السماء فكذلك لا يستطيع أن يدخل التوحيد والإيمان قلبه حتى يدخله الله في قلبه وقال الأوزاعي \"كأنما يصعد في السماء\" كيف يستطيع من جعل الله صدره ضيقا أن يكون مسلما. وقال الإمام أبو جعفر بن جرير: وهذا مثل ضربه الله لقلب هذا الكافر في شدة ضيقه عن وصول الإيمان إليه يقول فمثله في امتناعه من قبول الإيمان وضيقه عن وصوله إليه مثل امتناعه عن الصعود إلى السماء وعجزه عنه لأنه ليس في وسعه وطاقته وقال في قوله \"كذلك يجعل الله الرجس على الذين لا يؤمنون\" يقول كما يجعل الله صدر من أراد إضلاله ضيقا حرجا كذلك يسلط الله الشيطان عليه وعلى أمثاله ممن أبى الإيمان بالله ورسوله فيغويه ويصده عن سبيل الله وقال ابن أبي طلحة عن ابن عباس: الرجس الشيطان وقال مجاهد: الرجس كل ما لا خير فيه وقال عبد الرحمن بن زيد بن أسلم الرجس العذاب."
    },
    {
      "ayah": 126,
      "surah": 6,
      "text": "لما ذكر تعالى طريق الضالين عن سبيله الصادين عنها نبه على شرف ما أرسل به رسوله من الهدى ودين الحق فقال تعالى \"وهذا صراط ربك مستقيما\" منصوب على الحال أي هذا الدين الذي شرعناه لك يا محمد بما أوحينا إليك هذا القرآن هو صراط الله المستقيم كما تقدم في حديث الحارث عن علي في نعت القرآن: هو صراط الله المستقيم وحبل الله المتين وهو الذكر الحكيم رواه أحمد والترمذي بطوله \"قد فصلنا الآيات\" أي وضحناها وبيناها وفسرناها \"لقوم يذكرون\" أي لمن له فهم ووعي يعقل عن الله ورسوله."
    },
    {
      "ayah": 127,
      "surah": 6,
      "text": "\"لهم دار السلام\" وهى الجنة \"عند ربهم\" أي يوم القيامة وإنما وصف الله الجنة ههنا بدار السلام لسلامتهم فيما سلكوه من الصراط المستقيم المقتفي أثر الأنبياء وطرائقهم فكما سلموا من آفات الاعوجاج أفضوا إلى دار السلام \"وهو وليهم\" أي حافظهم وناصرهم ومؤيدهم \"بما كانوا يعملون\" أي جزاء على أعمالهم الصالحة تولاهم وأثابهم الجنة بمنه وكرمه."
    },
    {
      "ayah": 128,
      "surah": 6,
      "text": "يقول تعالى: واذكر يا محمد فيما تقصه عليهم وتنذرهم به \"ويوم يحشرهم جميعا\" يعني الجن وأولياءهم من الإنس الذين كانوا يعبدونهم في الدنيا ويعوذون بهم ويطيعونهم ويوحي بعضهم إلى بعض زخرف القول غرورا \"يا معشر الجن قد استكثرتم من الإنس\" أي يقول يا معشر الجن وسياق الكلام يدل على المحذوف ومعنى قوله \"قد استكثرتم من الإنس\" أي من إغوائهم وإضلالهم كقوله تعالى \"ألم أعهد إليكم يا بني آدم أن لا تعبدوا الشيطان إنه لكم عدو مبين وأن اعبدوني هذا صراط مستقيم ولقد أضل منكم جبلا كثيرا أفلم تكونوا تعقلون\" وقال علي بن أبي طلحة عن ابن عباس \"يا معشر الجن قد استكثرتم من الإنس\" يعني أضللتم منهم كثيرا وكذا قال مجاهد والحسن وقتادة \"وقال أولياؤهم من الإنس ربنا استمتع بعضنا ببعض\" يعني أن أولياء الجن من الإنس قالوا مجيبين لله تعالى عن ذلك بهذا قال ابن أبي حاتم: حدثنا أبو الأشهب هوذة بن خليفة حدثنا عوف عن الحسن في هذه الآية قال: استكثرتم من أهل النار يوم القيامة فقال أولياؤهم من الإنس ربنا استمتع بعضنا ببعض قال الحسن: وما كان استمتاع بعضهم ببعض إلا أن الجن أمرت وعملت الإنس. وقال محمد بن كعب في قوله \"ربنا استمتع بعضنا ببعض\" قال الصحابة في الدنيا. وقال ابن جريج: كان الرجل في الجاهلية ينزل الأرض فيقول أعوذ بكبير هذا الوادي فذلك استمتاعهما فاعتذروا به يوم القيامة وأما استمتاع الجن بالإنس فإنه كان فيما ذكر ما ينال الجن من الإنس من تعظيمهم إياهم في استعانتهم بهم فيقولون قد سدنا الإنس والجن \"وبلغنا أجلنا الذي أجلت لنا\" قال السدي يعني الموت \"قال النار مثواكم\" أي مأواكم ومنزلكم أنتم وإياهم وأولياؤكم \"خالدين فيها\" أي ماكثين فيها مكثا مخلدا إلا ما شاء الله قال بعضهم يرجع معنى الاستثناء إلى البرزخ وقال بعضهم: هذا رد إلى حدة الدنيا وقيل غير ذلك من الأقوال التي سيأتي تقريرها عند قوله تعالى في سورة هود \"خالدين فيها ما دامت السموات والأرض إلا ما شاء ربك إن ربك فعال لما يريد\" وقد روى ابن جرير وابن أبي حاتم في تفسير هذه الآية من طريق عبد الله بن صالح كاتب الليث: حدثني معاوية بن صالح عن علي بن أبي حاتم بن أبي طلحة عن ابن عباس قال \"النار مثواكم خالدين فيها إلا ما شاء الله إن ربك حكيم عليم\" قال إن هذه الآية آية لا ينبغي لأحد أن يحكم على الله في خلقه ولا ينزلهم جنة ولا نارا."
    },
    {
      "ayah": 129,
      "surah": 6,
      "text": "قال سعيد عن قتادة في تفسيرها إنما يولى الله الناس أعمالهم فالمؤمن ولي المؤمن أين كان وحيث كان والكافر ولي الكافر أينما كان وحيثما كان ليس الإيمان بالتمني ولا بالتحلي واختاره ابن جرير وقال معمر عن قتادة في تفسير الآية يولي الله بعض الظالمين بعضا في النار يتبع بعضهم بعضا وقال: مالك بن دينار قرأت في الزبور إنى أنتقم من المنافقين بالمنافقين ثم أنتقم من المنافقين جميعا وذلك في كتاب الله قول الله تعالى \"وكذلك نولي بعض الظالمين بعضا\" وقال عبد الرحمن بن زيد بن أسلم في قوله \"وكذلك نولي بعض الظالمين بعضا\" قال ظالمي الجن وظالمي الإنس وقرأ \"ومن يعش عن ذكر الرحمن نقيض له شيطانا فهو له قرين\" قال ونسلط ظلمة الجن على ظلمة الإنس. وقد روى الحافظ ابن عساكر في ترجمة عبد الباقي بن أحمد من طريق سعيد بن عبد الجبار الكرابيسي عن حماد بن سلمة عن عاصم عن ذر عن ابن مسعود مرفوعا من أعان ظالما سلطه الله عليه وهذا حديث غريب وقال بعض الشعراء: وما من يد إلا يد الله فوقها ولا ظالم إلا سيبلى بظالم ومعنى الآية الكريمة كما ولينا هؤلاء الخاسرين من الإنس تلك الطائفة التي أغوتهم من الجن كذلك تفعل بالظالمين نسلط بعضهم على بعض ونهلك بعضهم ببعض وننتقم من بعضهم ببعض جزاء على ظلمهم وبغيهم."
    },
    {
      "ayah": 13,
      "surah": 6,
      "text": "ثم قال تعالى \"وله ما سكن في الليل والنهار\" أي كل دابة في السموات والأرض الجميع عباده وخلقه وتحت قهره وتصرفه وتدبيره لا إله إلا هو \"وهو السميع العليم\" أي السميع لأقوال عباده العليم بحركاتهم وضمائرهم وسرائرهم ثم قال تعالى لعبده ورسوله محمد صلى الله عليه وسلم الذي بعثه بالتوحيد العظيم وبالشرع القويم وأمره أن يدعو الناس إلى صراط الله المستقيم."
    },
    {
      "ayah": 130,
      "surah": 6,
      "text": "وهذا أيضا مما يقرع الله به كافري الجن والإنس يوم القيامة حيث يسألهم وهو أعلم هل بلغتهم الرسل رسالاته وهذا استفهام تقرير \"يا معشر الجن والإنس ألم يأتكم رسل منكم\" أي من جملتكم والرسل من الإنس فقط وليس من الجن رسل كما قد نص على ذلك مجاهد وابن جريج وغير واحد من الأئمة من السلف والخلف وقال ابن عباس الرسل من بني آدم ومن الجن نذر. وحكى ابن جرير عن الضحاك بن مزاحم أنه زعم أن في الجن رسلا واحتج بهذه الآية الكريمة وفيه نظر لأنها محتملة وليست بصريحة وهي والله أعلم كقوله \"مرج البحرين يلتقيان بينهما برزخ لا يبغيان فبأي آلاء ربكما تكذبان\" إلى أن قال \"يخرج منهما اللؤلؤ والمرجان\" ومعلوم أن اللؤلؤ والمرجان إنما يستخرجان من الملح لا من الحلو وهذا واضح ولله الحمد وقد ذكر هذا الجواب بعينه ابن جرير والدليل على أن الرسل إنما هم من الإنس قوله تعالى \"إنا أوحينا إليك كما أوحينا إلى نوح والنبيين من بعده - إلى قوله - رسلا مبشرين ومنذرين لئلا يكون للناس على الله حجة بعد الرسل\" وقوله تعالى عن إبراهيم \"وجعلنا في ذريته النبوة والكتاب\" فحصر النبوة والكتاب بعد إبراهيم في ذريته ولم يقل أحد من الناس أن النبوة كانت في الجن قبل إبراهيم الخليل ثم انقطعت عنهم ببعثته وقال تعالى \"وما أرسلنا قبلك من المرسلين إلا أنهمم ليأكلون الطعام ويمشون في الأسواق\" وقال \"وما أرسلنا من قبلك إلا رجالا نوحي إليهم من أهل القرى\" ومعلوم أن الجن تبع للإنس في هذا الباب ولهذا قال تعالى إخبارا عنهم \"وإذ صرفنا إليك نفرا من الجن يستمعون القرآن فلما حضروه قالوا أنصتوا فلما قضي ولوا إلى قومهم منذرين قالوا يا قومنا إنا سمعنا كتابا أنزل من بعد موسى مصدقا لما بين يديه يهدي إلى الحق وإلى طريق مستقيم يا قومنا أجيبوا داعي الله وآمنوا به يغفر لكم من ذنوبكم ويجركم من عذاب أليم ومن لا يجب داعي الله فليس بمعجز في الأرض وليس له من دونه أولياء أولئك في ضلال مبين\" وقد جاء في الحديث الذي رواه الترمذي وغيره أن رسول الله صلى الله عليه وسلم تلا عليهم سورة الرحمن وفيها قوله تعالى \"سنفرغ لكم أيها الثقلان فبأي آلاء ربكما تكذبان\" وقال تعالى في هذه الآية الكريمة \"يا معشر الجن والإنس ألم يأتكم رسل منكم يقصون عليكم آياتي وينذرونكم لقاء يومكم هذا قالوا شهدنا على أنفسنا\" أي أقررنا أن الرسل قد بلغونا رسالاتك وأنذرونا لقاءك وأن هذا اليوم كائن لا محالة وقال تعالى \"وغرتهم الحياة الدنيا\" أي وقد فرطوا في حياتهم الدنيا وهلكوا بتكذيبهم الرسل ومخالفتهم للمعجزات لما اغتروا به من زخرف الحياة الدنيا وزينتها وشهواتها \"وشهدوا على أنفسهم\" أي يوم القيامة \"أنهم كانوا كافرين\" أي في الدنيا بما جاءتهم به الرسل صلوات الله وسلامه عليهم."
    },
    {
      "ayah": 131,
      "surah": 6,
      "text": "يقول تعالى \"ذلك أن لم يكن ربك مهلك القرى بظلم وأهلها غافلون\" أي إنما أعذرنا إلى الثقلين بإرسال الرسل وإنزال الكتب لئلا يؤاخذ أحدا بظلمه وهو لم تبلغه دعوة ولكن أعذرناإلى الأمم وما عذبنا أحدا إلا بعد إرسال الرسل إليهم كما قال تعالى \"وإن من قرية إلا خلا فيها نذير\" وقال تعالى \"ولقد بعثنا في كل أمة رسولا أن اعبدوا الله واجتنبوا الطاغوت\" كقوله \"وما كنا معذبين حتى نبعث رسولا\" وقال تعالى \"كلما ألقي فيها فوج سألهم خزنتها ألم يأتكم نذير قالوا بلى قد جاءنا نذير فكذبنا\" والآيات في هذا كثيرة قال الإمام أبو جعفر بن جرير ويحتمل قوله تعالى \"بظلم\" وجهين: \"أحدهما\" \"ذلك\" من أجل \"أن لم يكن ربك مهلك القرى بظلم\" أهلها بالشرك ونحوه \"وهم غافلون\" يقول إن لم يكن يعاجلهم بالعقوبة حتى يبعث إليهم رسولا ينبههم على حجج الله عليهم وينذرهم عذاب الله يوم معادهم ولم يكن بالذي يؤاخذهم غفلة فيقولوا ما جاءنا من بشير ولا نذير \" والوجه الثاني \"\"ذلك أن لم يكن ربك مهلك القرى بظلم\" يقول لم يكن ربك ليهلكهم دون التنبيه والتذكير بالرسل والآيات والعبر فيظلمهم بذلك والله غير ظلام لعبيده ثم شرع يرجح الوجه الأول ولا شك أنه أقوي والله أعلم."
    },
    {
      "ayah": 132,
      "surah": 6,
      "text": "قال: وقوله تعالى \"ولكل درجات مما عملوا\" أي ولكل عامل من طاعة الله أو معصيته مراتب ومنازل من عمله يبلغه الله إياها ويثيبه بها إن خيرا فخير وإن شرا فشر قلت: ويحتمل أن يعود قوله \"ولكل درجات مما عملوا\" أي من كافري الجن والإنس أي ولكل درجة في النار بحسبه كقوله \"قال لكل ضعف\" وقوله \"الذين كفروا وصدوا عن سبيل الله زدناهم عذابا فوق العذاب بما كانوا يفسدون\" \"وما ربك بغافل عما يعملون\" قال ابن جرير: أي وكل ذلك من عملهم يا محمد بعلم من ربك يحصيها ويثبتها لهم عنده ليجازيهم عليها عند لقائهم إياه ومعادهم إليه."
    },
    {
      "ayah": 133,
      "surah": 6,
      "text": "يقول تعالى \"وربك\" يا محمد \"الغني\" أي عن جميع خلقه من جميع الوجوه وهم الفقراء إليه في جميع أحوالهم \"ذو الرحمة\" أي وهو مع ذلك رحيم بهم كما قال تعالى \"إن الله بالناس لرءوف رحيم\" \"إن يشأ يذهبكم\" أي إذا خالفتم أمره \"ويستخلف من بعدكم ما يشاء\" أي قوم آخرين أي يعملون بطاعته \"كما أنشأكم من ذرية قوم آخرين\" أي هو قادر على ذلك سهل عليه يسير لديه كما أذهب القرون الأولى وأتى بالذي بعدها كذلك هو قادر على إذهاب هؤلاء والإتيان بآخرين كما قال تعالى \"إن يشأ يذهبكم أيها الناس ويأت بآخرين وكان الله على ذلك قديرا\" وقال تعالى \"يا أيها الناس أنتم الفقراء إلى الله والله هو الغني الحميد إن يشأ يذهبكم ويأت بخلق جديد وما ذلك على الله بعزيز\". وقال تعالى \"والله الغني وأنتم الفقراء وإن تتولوا يستبدل قوما غيركم ثم لا يكونوا أمثالكم\" وقال محمد بن إسحاق عن يعقوب بن عتبة قال: سمعت أبان بن عثمان يقول في هذه الآية \"كما أنشأكم من ذرية قوم آخرين\" الذرية الأصل والذرية النسل."
    },
    {
      "ayah": 134,
      "surah": 6,
      "text": "وقوله تعالى \"إن ما توعدون لآت وما أنتم بمعجزين\" أى أخبرهم يا محمد أن الذي يوعدون به من أمر المعاد كائن لا محالة \"وما أنتم بمعجزين\" أي ولا تعجزون الله بل هو قادر على إعادتكم وإن صرتم ترابا رفاتا وعظاما هو قادر لا يعجزه شيء وقال ابن أبي حاتم في تفسيرها: حدثنا أبي حدثنا محمد بن المصفى حدثنا محمد بن حسين عن أبي بكر بن أبي مريم عن عطاء بن أبي رباح عن أبي سعيد الخدري رضي الله عنه عن النبي صلى الله عليه وعلى آله وسلم أنه قال يا بني آدم إن كنتم تعقلون فعدوا أنفسكم من الموتى والذي نفسي بيده إن ما توعدن لآت وما أنتم بمعجزين."
    },
    {
      "ayah": 135,
      "surah": 6,
      "text": "وقوله تعالى \"قل يا قوم اعملوا على مكانتكم إني عامل فسوف تعلمون\" هذا تهديد شديد ووعيد أكيد أي استمروا على طريقتكم وناحيتكم إن كنتم تظنون أنكم على هدى فأنا مستمر على طريقتي ومنهجي كقوله \"وقل للذين لا يؤمنون اعملوا على مكانتكم إنا عاملون وانتظروا إنا منتظرون\" قال علي بن أبي طلحة عن ابن عباس \"على مكانتكم\" ناحيتكم \"فسوف تعلمون من تكون له عاقبة الدار إنه لا يفلح الظالمون\" أي أتكون لي أو لكم وقد أنجز الله موعده لرسوله صلوات الله عليه أي فإنه تعالى مكنه في البلاد وحكمه في نواصي مخالفيه من العباد وفتح له مكة وأظهره على من كذبه من قومه وعاداه وناوأه واستقر أمره على سائر جزيرة العرب وكذلك اليمن والبحرين وكل ذلك في حياته ثم فتحت الأمصار والأقاليم والرساتيق بعد وفاته في أيام خلفائه رضي الله عنهم أجمعين كما قال الله تعالى \"كتب الله لأغلبن أنا ورسلي إن الله قوى عزيز\" وقال \"إنا لننصر رسلنا والذين آمنوا في الحياة الدنيا ويوم يقوم الأشهاد يوم لا ينفع الظالمين معذرتهم ولهم اللعنة ولهم سوء الدار\" وقال تعالى \"ولقد كتبنا في الزبور من بعد الذكر أن الأرض يرثها عبادي الصالحون وقال تعالى إخبارا عن رسله فأوحى إليهم ربهم لنهلكن الظالمين ولنسكننكم الأرض من بعدهم ذلك لمن خاف مقامي وخاف وعيد\" وقال تعالى \"وعد الله الذين آمنوا منكم وعملوا الصالحات ليستخلفنهم في الأرض كما استخلف الذين من قبلهم وليمكنن لهم دينهم الذي ارتضى لهم وليبدلنهم من بعد خوفهم أمنا يعبدونني لا يشركون بي شيئا\" الآية وقد فعل الله ذلك بهذه الأمة المحمدية وله الحمد والمنة أولا وآخرا وظاهرا وباطنا."
    },
    {
      "ayah": 136,
      "surah": 6,
      "text": "هذا ذم وتوبيخ من الله للمشركين الذين ابتدعوا بدعا وكفرا وشركا وجعلوا لله شركاء وجزءا من خلقه وهو خالق كل شيء سبحانه وتعالى ولهذا قال تعالى \"وجعلوا لله مما ذرأ\" أي مما خلق وبرأ \"من الحرث\" أي من الزرع والثمار \"والأنعام نصيبا\" أي جزءا وقسما \"فقالوا هذا لله بزعمهم وهذا لشركائنا\" وقوله \"فما كان لشركائهم فلا يصل إلى الله وما كان لله فهو يصل إلى شركائهم\" قال علي بن أبي طلحة والعوفي عن ابن عباس أنه قال في تفسير هذه الآية: إن أعداء الله كانوا إذا حرثوا حرثا أو كانت لهم ثمرة جعلوا لله منه جزءا وللوثن جزءا فما كان من حرث أو ثمرة أو شيء من نصيب الأوثان حفظوه وأحصوه وإن سقط منه شيء فيما سمي للصمد ردوه إلى ما جعلوه للوثن وإن سبقهم الماء الذي جعلوه للوثن فسقى شيئا جعلوه لله جعلوا ذلك للوثن وإن سقط شيء من الحرث والثمر الذي جعلوه لله فاختلط بالذي جعلوه للوثن قالوا: هذا فقير ولم يردوه إلى ما جعلوه لله وإن سبقهم الماء الذي جعلوه لله فسقى ما سمي للوثن تركوه للوثن وكانوا يحرمون من أموالهم البحيرة والسائبة والوصيلة والحام فيجعلوه للأوثان ويزعمون أنهم يحرمونه قربة لله فقال الله تعالى \"وجعلوا لله مما ذرأ من الحرث والأنعام نصيبا\" الآية وهكذا قال مجاهد وقتادة والسدي وغير واحد وقال عبد الرحمن بن زيد بن أسلم في الآية: كل شيء يجعلونه لله من ذبح يذبحونه لا يأكلونه أبدا حتى يذكروا معه أسماء الآلهة وما كان للآلهة لم يذكروا اسم الله معه وقرأ الآية حتى بلغ \"ساء ما يحكمون\" أي ساء ما يقسمون فإنهم أخطأوا أولا القسم لأن الله تعالى هو رب كل شيء ومليكه وخالقه وله الملك وكل شيء له وفي تصرفه وتحت قدرته ومشيئته لا إله غيره ولا رب سواه ثم لما قسموا فيما زعموا القسمة الفاسدة لم يحفظوها بل جاروا فيها كقوله جل وعلا \"ويجعلون لله البنات سبحانه ولهم ما يشتهون\" وقال تعالى \"وجعلوا له من عباده جزأ إن الإنسان لكفور مبين\" وقال تعالى \"ألكم الذكر و له الأنثى\" وقوله \"تلك إذا قسمة ضيزى\"."
    },
    {
      "ayah": 137,
      "surah": 6,
      "text": "يقول تعالى: وكما زينت الشياطين لهؤلاء أن يجعلوا لله مما ذرا من الحرث والأنعام نصيبا كذلك زينوا لهم قتل أولادهم خشية الإملاق ووأد البنات خشية العار قال علي بن أبي طلحة عن ابن عباس: وكذلك زين لكثير من المشركين قتل أولادهم شركاؤهم زينوا لهم قتل أولادهم. وقال مجاهد: شركاؤهم شياطينهم يأمرونهم أن يئدوا أولادهم خشية العيلة. وقال السدي: أمرتهم الشياطين أن يقتلوا البنات وأما ليردوهم فيهلكوهم وأما ليلبسوا عليهم دينهم أي فيخلطون عليهم دينهم ونحو ذلك قال عبد الرحمن بن زيد بن أسلم وقتادة وهذا كقوله تعالى \"وإذا بشر أحدهم بالأنثى ظل وجهه مسودا وهو كظيم. يتوارى من القوم من سوء ما بشر به\" الآية وكقوله \"وإذا الموءودة سئلت بأي ذنب قتلت\" وقد كانوا أيضا يقتلون الأولاد من الإملاق وهو الفقر أو خشية الإملاق أن يحصل لهم في تلف المال وقد نهاهم عن قتل أولادهم لذلك وإنما كان هذا كله من تزيين الشياطين وشرعهم ذلك قوله تعالى \"ولو شاء الله ما فعلوه\" أي كان هذا واقع بمشيئته تعالى وإرادته واختياره لذلك كونا وله الحكمة التامة في ذلك فلا يسأل عما يفعل وهم يسئلون \"فذرهم وما يفترون\" أي فدعهم واجتنبهم وما هم فيه فسيحكم الله بينك وبينهم."
    },
    {
      "ayah": 138,
      "surah": 6,
      "text": "قال علي بن أبي طلحة عن ابن عباس: الحجر الحرام مما حرموا من الوصيلة وتحريم ما حرموا. وكذلك قال مجاهد والضحاك والسدي وقتادة وعبد الرحمن بن زيد بن أسلم وغيرهما وقال قتادة \"وقالوا هذه أنعام وحرث حجر\" تحريم كان عليهم من الشياطين في أموالهم وتغليظ وتشديد ولم يكن من الله تعالى وقال ابن زيد بن أسلم \"حجر\" إنما احتجروها لآلهتهم; وقال السدي \"لا يطعمها إلا من نشاء بزعمهم\" يقولون حرام أن يطعم إلا من شئنا وهذه الآية الكريمة كقوله تعالى \"قل أرأيتم ما أنزل الله لكم من رزق فجعلتم منه حراما وحلالا قل آلله أذن لكم أم على الله تفترون\" وكقوله تعالى \"ما جعل الله من بحيرة ولا سائبة ولا وصيلة ولا حام ولكن الذين كفروا يفترون على الله الكذب وأكثرهم لا يعقلون\" وقال السدي: أما الأنعام التي حرمت ظهورها فهي البحيرة والسائبة والوصيلة والحام وأما الأنعام التي لا يذكرون اسم الله عليها لا إذا ولدوها ولا إن نحروها. وقال أبو بكر بن عياش عن عاصم بن أبي النجود قال لي أبو وائل: أتدري ما في قوله \"وأنعام حرمت ظهورها وأنعام لا يذكرون اسم الله عليها\" قلت لا قال: هي البحيرة كانوا لا يحجون عليها. وقال مجاهد: كان من إبلهم طائفة لا يذكرون اسم الله عليها ولا في شيء من شأنها لا إن ركبوا ولا إن حلبوا ولا إن حملوا ولا إن نتجوا ولا إن عملوا شيئا \"افتراء عليه\" أي على الله وكذبا منهم في إسنادهم ذلك إلي دين الله وشرعه فإنه لم يأذن لهم في ذلك ولا رضيه منهم \"سيجزيهم بما كانوا يفترون\" أي عليه ويسندون إليه."
    },
    {
      "ayah": 139,
      "surah": 6,
      "text": "قال أبو إسحاق السبيعي عن عبد الله بن أبى الهذيل عن ابن عباس \"وقالوا ما في بطون هذه الأنعام خالصة لذكورنا\" الآية قال اللبن وقال العوفي عن ابن عباس \"وقالوا ما في بطون هذه الأنعام خالصة لذكورنا\" فهو اللبن كانوا يحرمونه على إناثهم ويشربه ذكرانهم وكانت الشاة إذا ولدت ذكرا ذبحوه وكان للرجال دون النساء وإن كانت أنثى تركت فلم تذبح وإن كانت ميتة فهم فيه شركاء فنهى الله عن ذلك. وكذا قال السدي وقال الشعبي: البحيرة لا يأكل من لبنها إلا الرجال وإن مات منها شيء أكله الرجال والنساء. وكذا قال عكرمة وقتادة وعبد الرحمن بن زيد بن أسلم وقال مجاهد في قوله \"وقالوا ما في بطون هذه الأنعام خالصة لذكورنا ومحرم على أزواجنا\" قال هي السائبة والبحيرة وقال أبو العالية ومجاهد وقتادة في قول الله \"سيجزيهم وصفهم\" أي قولهم الكذب في ذلك يعني كقوله تعالى \"ولا تقولوا لما تصف ألسنتكم الكذب. هذا حلال وهذا حرام لتفتروا على الله الكذب إن الذين يفترون على الله الكذب لا يفلحون متاع\" الآية \"إنه حكيم\" أي في أفعاله وأقواله وشرعه وقدره \"عليم\" بأعمال عباده من خير وشر وسيجزيهم عليها أتم الجزاء."
    },
    {
      "ayah": 14,
      "surah": 6,
      "text": "\"قل أغير الله أتخذ وليا فاطر السموات والأرض\" كقوله \"قل أفغير الله تأمروني أعبد أيها الجاهلون\" والمعنى: لا أتخذ وليا إلا الله وحده لا شريك له فإنه فاطر السموات والأرض أي خالقهما ومبدعهما على غير مثال سبق \"وهو يطعم ولا يطعم\" أي وهو الرزاق لخلقه من غير احتياج إليهم كما قال تعالى \"وما خلقت الجن والإنس إلا ليعبدون\" الآية وأقر بعضهم ههنا \"وهو يطعم ولا يطعم\" أي لا يأكل وفي حديث سهيل بن أبي صالح عن أبيه عن أبي هريرة رضي الله عنه قال: دعا رجل من الأنصار من أهل قباء النبي صلى الله عليه وسلم على طعام فانطلقنا معه فلما طعم النبي صلى الله عليه وسلم وغسل يديه قال \"الحمد لله الذي يطعم ولا يطعم ومن علينا فهدانا وأطعمنا وسقانا من الشراب وكسانا من العري وكل بلاء حسن أبلانا الحمد لله غير مودع ربي ولا مكافئ ولا مكفور ولا مستغنى عنه الحمد لله الذي أطعمنا من الطعام وسقانا من الشراب وكسانا من العري وهدانا من الضلال وبصرنا من العمى وفضلنا على كثير ممن خلق تفضيلا الحمد لله رب العالمين\" \"قل إني أمرت أن أكون أول من أسلم\" أي من هذه الأمة."
    },
    {
      "ayah": 140,
      "surah": 6,
      "text": "يقول تعالى: قد خسر الذين فعلوا هذه الأفاعيل في الدنيا والآخرة أما في الدنيا فخسروا أولادهم بقتلهم وضيقوا عليهم في أموالهم فحرموا أشياء ابتدعوها من تلقاء أنفسهم وأما في الآخرة فيصيرون إلى أسوأ المنازل بكذبهم على الله وافترائهم كقوله \"إن الذين يفترون على الله الكذب لا يفلحون متاع في الدنيا ثم إلينا مرجعهم ثم نذيقهم العذاب الشديد بما كانوا يكفرون\" وقال الحافظ أبو بكر بن مردوية في تفسير هذه الآية: حدثنا محمد بن أحمد بن إبراهيم حدثنا محمد بن أيوب حدثنا عبد الرحمن بن المبارك حدثنا أبو عوانة عن أبي بشر عن سعيد بن جبير عن ابن عباس رضي الله عنهما قال: إذا سرك أن تعلم جهل العرب فاقرأ ما فوق الثلاثين والمائة من سورة الأنعام \"قد خسر الذين قتلوا أولادهم سفها بغير علم وحرموا ما رزقهم الله افتراء على الله قد ضلوا وما كانوا مهتدين\" وهكذا رواه البخاري منفردا في كتاب مناقب قريش من صحيحه عن أبي النعمان محمد بن الفضل عارم عن أبي عوانة واسمه الوضاح بن عبد الله اليشكري عن أبي بشر واسمه جعفر بن أبي وحشية عن إياس به."
    },
    {
      "ayah": 141,
      "surah": 6,
      "text": "يقول تعالى مبينا أنه الخالق لكل شيء من الزروع والثمار والأنعام التي تصرف فيها هؤلاء المشركون بآرائهم الفاسدة وقسموها وجزءوها فجعلوا منها حراما وحلالا فقال \"وهو الذي أنشأ جنات معروشات وغير معروشات\" قال علي بن أبي طلحة عن ابن عباس: معروشات مسموكات وفي رواية فالمعروشات ما عرش الناس وغير معروشات ما خرج في البر والجبال من الثمرات وقال عطاء الخراساني عن ابن عباس معروشات ما عرش من الكرم وغير معروشات ما لم يعرش من الكرم وكذا قال السدي وقال ابن جريج: متشابها وغير متشابه قال متشابه في المنظر وغير متشابه في المطعم وقال محمد بن كعب \"كلوا من ثمره إذا أثمر\" قال من رطبه وعنبه وقوله تعالى \"وآتوا حقه يوم حصاده\" قال ابن جرير: قال بعضهم هي الزكاة المفروضة. حدثنا عمرو حدثنا عبد الصمد حدثنا يزيد بن درهم قال: سمعت أنس بن مالك يقول \"وآتوا حقه يوم حصاده\" قال الزكاة المفروضة. وقال علي بن أبي طلحة عن ابن عباس\" وآتوا حقه يوم حصاده\" يعني الزكاة المفروضة يوم يكال ويعلم كيله وكذا قال سعيد بن المسيب وقال العوفي عن ابن عباس \" وآتوا حقه يوم حصاده\" وذلك أن الرجل كان إذا زرع فكان يوم حصاده لم يخرج مما حصد شيئا فقال الله تعالى \"وآتوا حقه يوم حصاده\" وذلك أن يعلم ما كيله وحقه من كل عشرة واحد وما يلقط الناس من سنبله وقد روى الإمام أحمد وأبو داود في سننه من حديث محمد بن إسحاق حدثني محمد بن يحيى بن حبان عن عمه واسع بن حبان عن جابر بن عبد الله أن النبي صلى الله عليه وسلم أمر من كل جاذ عشرة أوسق من التمر بقنو يعلق في المسجد للمساكين وهذا إسناده جيد قوي وقال طاوس وأبو الشعثاء وقتادة والحسن والضحاك وابن جريج هي الزكاة وقال الحسن البصري هي الصدقة من الحب والثمار وكذا فال زيد بن أسلم وقال آخرون هو حق آخر سوى الزكاة وقال أشعث عن محمد بن سيرين ونافع عن ابن عمر في قوله \"وآتوا حقه يوم حصاده\" قال: كانوا يعطون شيئا سوى الزكاة رواه ابن مردوية. وروى عبد الله بن المبارك وغيره عن عبد الملك بن أبي سليمان عن عطاء بن أبي رباح في قوله \"وآتوا حقه يوم حصاده\" قال: يعطي من حضره يومئذ ما تيسر وليس بالزكاة. وقال مجاهد: إذا حضرك المساكين طرحت لهم منه وقال عبد الرزاق عن ابن عيينة عن ابن أبي نجيح عن مجاهد \"وآتوا حقه يوم حصاده\" قال عند الزرع يعطي القبضة وعند الصرام يعطي القبضة ويتركهم فيتبعون آثار الصرام وقال الثوري عن حماد عن إبراهيم النخعي قال: يعطي مثل الضغث وقال ابن المبارك عن شريك عن سالم عن سعيد بن جبير \"وآتوا حقه يوم حصاده\" قال: كان هذا قبل الزكاة للمساكين القبضة والضغث لعلف دابته وفي حديث ابن لهيعة عن دراج عن أبي الهيثم عن أبي سعيد مرفوعا \"وآتوا حقه يوم حصاده\" قال: ما سقط من السنبل رواه ابن مردوية وقال آخرون: هذا شيء كان واجبا ثم نسخه الله بالعشر أو نصف العشر حكاه ابن جرير عن ابن عباس ومحمد بن الحنفية وإبراهيم النخعي والحسن والسدي وعطية العوفي وغيرهم واختاره ابن جرير رحمه الله قلت: وفي تسمية هذا نسخا نظر لأنه فد كان شيئا واجبا في الأصل ثم إن فصل بيانه وبين مقدار المخرج وكميته قالوا وكان هذا في السنة الثانية من الهجرة فالله أعلم وقد ذم الله سبحانه الذين يصرمون ولا يتصدقون كما ذكر عن أصحاب الجنة في سورة \"ن\" \"إذ أقسموا ليصرمنها مصبحين ولا يستثنون فطاف عليها طائف من ربك وهم نائمون فأصبحت كالصريم\" أي كالليل المدلهم سوداء محترقة \"فتنادوا مصبحين أن اغدوا على حرثكم إن كنتم صارمين فانطلقوا وهم يتخافتون أن لا يدخلنها اليوم عليكم مسكين وغدوا على حرد\" أي قوة وجلد وهمة \"قادرين فلما رأوها قالوا إنا لضالون بل نحن محرومون قال أوسطهم ألم أقل لكم لولا تسبحون قالوا سبحان ربنا إنا كنا ظالمين فأقبل بعضهم على بعض يتلاومون قالوا يا ويلنا إنا كنا طاغين عسى ربنا أن يبدلنا خيرا منها إنا إلى ربنا راغبون كذلك العذاب ولعذاب الآخرة أكبر لو كانوا يعلمون\". وقوله تعالى \"ولا تسرفوا إنه لا يحب المسرفين\" قيل معناه لا تسرفوا في الإعطاء فتعطوا فوق المعروف وقال أبو العالية: كانوا يعطون يوم الحصاد شيئا ثم تباروا فيه وأسرفوا فأنزل الله \"ولا تسرفوا\" وقال ابن جريج نزلت في ثابت بن قيس بن شماس جذ نخلا له فقال لا يأتيني اليوم أحد إلا أطعمته فأطعم حتى أمسى وليست له ثمرة فأنزل الله تعالى \"ولا تسرفوا إنه لا يحب المسرفين\" رواه ابن جرير عنه وقال ابن جريج عن عطاء نهوا عن السرف في كل شيء وقال إياس بن معاوية: ما جاوزت به أمر الله فهو سرف وقال السدي في قوله \"ولا تسرفوا\" قال لا تعطوا أموالكم فتقعدوا فقراء. وقال سعيد بن المسيب ومحمد بن كعب في قوله \"ولا تسرفوا\" قال لا تمنعوا الصدقة فتعصوا ربكم ثم اختار ابن جرير قول عطاء أنه نهى عن الإسراف في كل شيء ولا شك أنه صحيح لكن الظاهر والله أعلم من سياق الآية حيث قال تعالى \"كلوا من ثمره إذا أثمر وآتوا حقه يوم حصاده ولا تسرفوا\" أن يكون عائدا على الأكل أي لا تسرفوا في الأكل لما فيه من مضرة العقل والبدن كقوله تعالى \"كلوا واشربوا ولا تسرفوا\" الآية وفي صحيح البخاري تعليقا \"كلوا واشربوا والبسوا من غير إسراف ولا مخيلة\" وهذا من هذا والله أعلم."
    },
    {
      "ayah": 142,
      "surah": 6,
      "text": "وقوله عز وجل \"ومن الأنعام حمولة وفرشا\" أي وأنشأ لكم من الأنعام ما هو حمولة وما هو فرش قيل المراد بالحمولة ما يحمل عليه من الإبل والفرش الصغار منها كما قال الثوري عن أبي إسحاق عن أبي الأحوص عن عبد الله في قوله حمولة ما حمل عليه من الإبل وفرشا الصغار من الإبل رواه الحاكم وقال صحيح الإسناد ولم يخرجاه. وقال ابن عباس: الحمولة هي الكبار والفرش الصغار من الإبل وكذا قال مجاهد. وقال علي بن أبي طلحة عن ابن عباس \"ومن الأنعام حمولة وفرشا\" أما الحمولة فالإبل والخيل والبغال والحمير وكل شيء يحمل عليه وأما الفرش فالغنم واختاره ابن جرير قال: وأحسبه إنما سمي فرشا لدنوه من الأرض وقال الربيع بن أنس والحسن والضحاك وقتادة وغيره: الحمولة الإبل والبقر والفرش الغنم. وقال السدي: أما الحمولة فالإبل وأما الفرش فالفصلان والعجاجيل والغنم وما حمل عليه حمولة. وقال عبد الرحمن بن زيد بن أسلم: الحمولة ما تركبون والفرش ما تأكلون وتحلبون: شاة لا تحمل تأكلون لحمها وتتخذون من صوفها لحافا وفرشا. وهذا الذي قال عبد الرحمن فى تفسير هذه الآية الكريمة حسن يشهد له قوله تعالى \"أو لم يروا أنا خلقنا لهم مما عملت أيدينا أنعاما فهم لها مالكون وذللناها لهم فمنها ركوبهم ومنها يأكلون\" وقال تعالى \" وإن لكم في الأنعام لعبرة نسقيكم مما في بطونه من بين فرث ودم لبنا خالصا سائغا للشاربين\" إلى أن قال \"ومن أصوافها وأوبارها وأشعارها أثاثا ومتاعا إلى حين\" وقال تعالى \"الله الذي جعل لكم الأنعام لتركبوا منها ومنها تأكلون ولكم فيها منافع ولتبلغوا عليها حاجة في صدوركم وعليها وعلى الفلك تحملون ويريكم آياته فأي آيات الله تنكرون\" وقوله تعالى \"كلوا مما رزقكم الله\" أي من الثمار والزروع والأنعام فكلها خلقها الله وجعلها رزقا لكم \"ولا تتبعوا خطوات الشيطان\" أي طريقه وأوامره كما اتبعها المشركون الذين حرموا ما رزقهم الله أي من الثمار والزروع افتراء على الله \"إنه لكم\" أي إن الشيطان أيها الناس لكم \"عدو مبين\" أي مبين ظاهر العداوة كما قال \"إن الشيطان لكم عدو فاتخذوه عدوا إنما يدعو حزبه ليكونوا من أصحاب السعير\" وقال تعالى \"يا بني آدم لا يفتننكم الشيطان كما أخرج أبويكم من الجنة ينزع عنهما لباسهما ليريهما سوآتهما\" الآية وقال تعالى \"أفتتخذونه وذريته أولياء من دوني وهم لكم عدو بئس للظالمين بدلا\" والآيات في هذا كثيرة في القرآن."
    },
    {
      "ayah": 143,
      "surah": 6,
      "text": "هذا بيان لجهل العرب قبل الإسلام فيما كانوا حرموا من الأنعام وجعلوها أجزاء وأنواعا بحيرة وسائبة ووصيلة وحاما وغير ذلك من الأنواع التي ابتدعوها في الأنعام والزروع والثمار فبين تعالى أنه أنشأ جنات معروشات وغير معروشات وأنه أنشأ من الأنعام حمولة وفرشا. ثم بين أصناف الأنعام إلى غنم وهو بياض وهو الضأن وسواد وهو المعز ذكره وأنثاه وإلى إبل ذكورها وإناثها وبقر كذلك وأنه تعالى لم يحرم شيئا من ذلك ولا شيئا من أولادها بل كلها مخلوقة لبني آدم أكلا وركوبا وحمولة وحلبا وغير ذلك من وجوه المنافع كما قال \"وأنزل لكم من الأنعام ثمانية أزواج\" الآية وقوله تعالى \"أما اشتملت عليه أرحام الأنثيين\" رد عليهم في قولهم\" ما في بطون هذه الأنعام خالصة لذكورنا ومحرم على أزواجنا\" الآية وقوله تعالى \"نبئوني بعلم إن كنتم صادقين\" أي أخبروني عن يقين كيف حرم الله عليكم ما زعمتم تحريمه من البحيرة والسائبة والوصيلة والحام ونحو ذلك وقال العوفي عن ابن عباس قوله \"ثمانية أزواج من الضأن اثنين ومن المعز اثنين\" فهذه أربعة أزواج\" قل آلذكرين حرم أم الأنثيين\" يقول لم أحرم شيئا من ذلك \"أما اشتملت عليه أرحام الأنثيين\" يعني هل يشتمل الرحم إلا على ذكر أو أنثى فلم تحرمون بعض وتحلون بعضا؟ \"نبئوني بعلم إن كنتم صادقين\" يقول تعالى: كله حلال."
    },
    {
      "ayah": 144,
      "surah": 6,
      "text": "وقوله تعالى\"أم كنتم شهداء إذ وصاكم الله بهذا\" تهكم بهم فيما ابتدعوه وافتروه على الله من تحريم ما حرموه من ذلك \"فمن أظلم ممن افترى على الله كذبا ليضل الناس بغير علم\" أي لا أجد أظلم منه \"إن الله لا يهدي القوم الظالمين\" وأول من دخل في هذه الآية عمرو بن لحي بن قمعة لأنه أول من غير دين الأنبياء وأول من سيب السوائب ووصل الوصيلة وحمى الحامي كما ثبت ذلك في الصحيح."
    },
    {
      "ayah": 145,
      "surah": 6,
      "text": "يقول تعالى آمرا عبده ورسوله محمدا صلى الله عليه وسلم \"قل\" يا محمد لهؤلاء الذين حرموا ما رزقهم الله افتراء على الله \"لا أجد فيما أوحي إلي محرما على طاعم يطعمه\" أي آكل يأكله قيل معناه لا أجد شيئا مما حرمتم حراما سوى هذه وقيل معناه لا أجد من الحيوانات شيئا حراما سوى هذه فعلى هذا يكون ما ورد من التحريمات بعد هذا في سورة المائدة وفي الأحاديث الواردة رافعا لمفهوم هذه الآية ومن الناس من يسمي هذا نسخا والأكثرون من المتأخرين لا يسمونه نسخا لأنه من باب رفع مباح الأصل والله أعلم وقال العوفي عن ابن عباس \"أو دما مسفوحا\" يعني المهراق وقال عكرمة في قوله \"أو دما مسفوحا\" لولا هذه الآية لتتبع الناس ما في العروق كما تتبعه اليهود وقال حماد عن عمران بن جرير قال: سألت أبا مجلز عن الدم وما يتلطخ من الذبيح من الرأس وعن القدر يرى فيها الحمرة فقال إنما نهى الله عن الدم المسفوح وقال قتادة: حرم من الدماء ما كان مسفوحا فأما اللحم خالطه الدم فلا بأس به وقال ابن جرير: حدثنا المثنى حدثنا حجاج بن منهال حدثنا حماد عن يحيى بن سعيد عن القاسم عن عائشة رضي الله عنها أنها كانت لا ترى بلحوم السباع بأسا والحمرة والدم يكونان على القدر وقرأت هذه الآية صحيح غريب. وقال الحميدي حدثنا سفيان حدثنا عمرو بن دينار قال: قلت لجابر بن عبد الله إنهم يزعمون أن رسول الله صلى الله عليه وسلم نهى عن لحوم الحمر الأهلية زمن خيبر فقال: قد كان يقول ذلك الحكم بن عمرو عن رسول الله صلى الله عليه وسلم ولكن أبى ذلك الحبر يعني ابن عباس وقرأ \"قل لا أجد فيما أوحي إلي محرما على طاعم يطعمه\" الآية وكذا رواه البخاري عن علي بن المديني عن سفيان به وأخرجه أبو داود من حديث ابن جريج عن عمرو بن دينار ورواه الحاكم في مستدركه مع أنه في صحيح البخاري كما رأيت وقال أبو بكر بن مردوية والحاكم في مستدركه: حدثنا محمد بن على بن دحيم حدثنا أحمد بن حازم حدثنا أبو نعيم الفضل بن دكين حدثنا محمد بن شريك عن عمرو بن دينار عن أبي الشعثاء عن ابن عباس قال: كان أهل الجاهلية يأكلون أشياء ويتركون أشياء تقذرا فبعث الله نبيه وأنزل كتابه وأحل حلاله وحرم حرامه فما أحل فهو حلال وما حرم فهو حرام وما سكت عنه فهو عفو وقرأ هذه الآية \"قل لا أجد فيما أوحي إلي محرما على طاعم يطعمه\" الآية وهذا لفظ ابن مردوية ورواه أبو داود منفردا به عن محمد بن داود بن صبيح عن أبي نعيم به وقال الحاكم: هذا حديث صحيح الإسناد ولم يخرجاه وقال الإمام أحمد: حدثنا عفان حدثنا أبو عوانة عن سماك بن حرب عن عكرمة عن ابن عباس قال: ماتت شاة لسودة بنت زمعة فقالت: يا رسول الله ماتت فلانة تعني الشاة قال \"فلم لا أخذتم مسكها\" قالت نأخذ مسك شاة قد ماتت؟ فقال لها رسول الله صلى الله عليه وسلم \"إنما قال الله\" قل لا أجد فيما أوحي إلي محرما على طاعم يطعمه إلا أن يكون ميتة أو دما مسفوحا أو لحم خنزير \"وإنكم لا تطعمونه إن تدبغوه فتنتفعوا به فأرسلت فسلخت مسكها فاتخذت منه قربة حتى تخرقت عندها رواه أحمد ورواه البخاري والنسائي من حديث الشعبي عن عكرمة عن ابن عباس عن سودة بنت زمعة بذلك أو نحوه وقال سعيد بن منصور: حدثنا عبد العزيز بن محمد عن عيسى بن نميلة الفزاري عن أبيه قال: كنت عند ابن عمر فسأله رجل عن أكل القنفذ فقرأ عليه \"قل لا أجد فيما أوحي إلي محرم على طاعم يطعمه\" الآية فقال شيخ عنده: سمعت أبا هريرة يقول: ذكر عند النبي صلى الله عليه وسلم فقال خبيث من الخبائث فقال ابن عمر: إن كان النبي صلى الله عليه وسلم قاله فهو كما قال ورواه أبو داود عن أبي ثور عن سعيد بن منصور به. وقوله تعالى \"فمن اضطر غير باغ ولا عاد\" أي فمن اضطر إلى أكل شيء مما حرم الله في هذه الآية الكريمة وهو غير متلبس ببغي ولا عدوان \"فإن ربك غفور رحيم\" أي غفور له رحيم به وقد تقدم تفسير هذه الآية في سورة البقرة بما فيه كفاية والغرض من سياق هذه الآية الكريمة الرد على المشركين الذين ابتدعوا ما ابتدعوه من تحريم المحرمات على أنفسهم بآرائهم الفاسدة من البحيرة والسائبة والوصيلة والحام ونحو ذلك فأمر رسوله أن يخبرهم أنه لا يجد فيما أوحاه الله إليه أن ذلك محرم وإنما حرم ما ذكر في هذه الآية من الميتة والدم المسفوح ولحم الخنزير وما أهل لغير الله به وما عدا ذلك فلم يحرم وإنما هو عفو مسكوت عنه فكيف تزعمون أنتم أنه حرام ومن أين حرمتموه ولم يحرمه الله؟ وعلى هذا فلا يبقى تحريم أشياء أخر فيما بعد هذا كما جاء النهي عن لحوم الحمر الأهلية ولحوم السباع وكل ذي مخلب من الطير على المشهور من مذاهب العلماء."
    },
    {
      "ayah": 146,
      "surah": 6,
      "text": "قال ابن جرير: يقول تعالى وحرمنا على اليهود كل ذي ظفر وهو البهائم والطير ما لم يكن مشقوق الأصابع كالإبل والنعام والأوز والبط قال علي بن أبي طلحة عن ابن عباس \"وعلى الذين هادوا حرمنا كل ذي ظفر\" وهو البعير والنعامة وكذا قال مجاهد والسدي في رواية وقال سعيد بن جبير: هو الذي ليس منفرج الأصابع. وفي رواية عنه كل متفرق الأصابع ومنه الديك وقال قتادة في قوله \"وعلى الذين هادوا حرمنا كل ذي ظفر\" وكان يقال للبعير والنعامة وأشياء من الطير والحيتان وفي رواية البعير والنعامة وحرم عليهم من الطير البط وشبهه وكل شيء ليس بمشقوق الأصابع وقال ابن جريج عن مجاهد كل ذي ظفر قال النعامة والبعير شقاشقا قلت للقاسم بن أبي بزة وحدثته ما شقاشقا؟ قال: كل ما لا ينفرج من قوائم البهائم قال: وما انفرج أكلته. قال: انفرج قوائم البهائم والعصافير قال فيهود تأكله قال ولم تنفرج قائمة البعير - خفه - ولا خف النعامة ولا قائمة الوز فلا تأكل اليهود الإبل ولا النعامة ولا الوز ولا كل شيء لم تنفرج قائمته ولا تأكل حمار الوحش وقوله تعالى \"ومن البقر والغنم حرمنا عليهم شحومهما\" قال السدي: يعني الثرب وشحم الكليتين وكانت اليهود تقول إنه حرمه إسرائيل فنحن نحرمه. وكذا قال ابن زيد وقال قتادة: الثرب وكل شحم كان كذلك ليس في عظم وقال علي بن أبي طلحة عن ابن عباس \"إلا ما حملت ظهورهما\" يعني ما علق بالظهر من الشحوم وقال السدي وأبو صالح: الألية مما حملت ظهورهما. وقوله تعالى \"أو الحوايا\" قال الإمام أبو جعفر بن جرير: الحوايا جمع واحدها حاوياء. وحاوية وحوية وهو ما تحوي من البطن فاجتمع واستدار وهي بنات اللبن وهي المباعر وتسمى المرابض وفيها الأمعاء. قال ومعنى الكلام: ومن البقر والغنم حرمنا عليهم شحومهما إلا ما حملت ظهورهما وما حملت الحوايا. قال علي بن أبي طلحة عن ابن عباس: أو الحوايا وهي المبعر. وقال مجاهد: الحوايا المبعر والمربض وكذا قال سعيد بن جبير والضحاك وقتادة وأبو مالك والسدي. وقال عبد الرحمن بن زيد بن أسلم وغير واحد: الحوايا المرابض التي تكون فيها الأمعاء تكون وسطها وهي بنات اللبن وهي في كلام العرب تدعى المرابض وقوله تعالى \"أو ما اختلط بعظم\" يعني إلا ما اختلط من الشحوم بعظم فقد أحللناه لهم وقال ابن جريج: شحم الألية ما اختلط بالعصعص فهو حلال وكل شيء في القوائم والجنب والرأس والعين وما اختلط بعظم فهو حلال ونحوه قاله السدي وقوله تعالى \"ذلك جزيناهم ببغيهم\" أي هذا التضييق إنما فعلناه بهم وألزمناهم به مجازاة على بغيهم ومخالفتهم أوامرنا كما قال تعالى \"فبظلم من الذي هادوا حرمنا عليهم طيبات أحلت لهم وبصدهم عن سبيل الله كثيرا\" وقوله \"إنا لصادقون\" أي وإنا لعادلون فيما جزيناهم به وقال ابن جرير: وإنا لصادقون فيما أخبرناك به يا محمد من تحريمنا ذلك عليهم لا كما زعموا من أن إسرائيل هو الذي حرمه على نفسه والله أعلم. وقال عبد الله بن عباس: بلغ عمر بن الخطاب رضي الله عنه أن سمرة باع خمرا فقال: قاتل الله سمرة ألم يعلم أن رسول الله صلى الله عليه وعلى آله وسلم قال لعن الله اليهود حرمت عليهم الشحوم فجملوها فباعوها أخرجاه من حديث سفيان بن عيينة عن عمرو بن دينار عن طاوس عن ابن عباس عن عمر به. وقال الليث: حدثنى يزيد بن أبى حبيب قال: قال عطاء بن أبي رباح سمعت جابر بن عبد الله يقول: سمعت رسول الله صلى الله عليه وعلى آله وسلم يقول عام الفتح إن الله ورسوله حرم بيع الخمر والميتة والخنزير والأصنام فقيل يا رسول الله أرأيت شحوم الميتة فإنها يدهن بها الجلود وتطلى بها السفن ويستصبح بها الناس فقال لا هو حرام ثم قال رسول الله صلى الله عليه وعلى آله وسلم عند ذلك قاتل الله اليهود إن الله لما حرم عليهم شحومها جملوه ثم باعوه وأكلوا ثمنه ورواه الجماعة من طرق عن يزيد بن أبي حميد به وقال الزهري عن سعيد بن المسيب عن أبي هريرة قال: قال رسول الله صلى الله عليه وآله وسلم قاتل الله اليهود حرمت عليهم الشحوم فباعوها وأكلوا ثمنها ورواه البخاري ومسلم جميعا عن عبدان عن ابن المبارك عن يونس عن الزهري به. وقال ابن مردوية: حدثنا محمد بن عبد الله بن إبراهيم حدثنا إسماعيل بن إسحاق حدثنا سليمان بن حرب حدثنا وهب حدثنا خالد الحذاء عن بركة أبي الوليد عن ابن عباس أن رسول الله صلى الله عليه وعلى آله وسلم كان قاعدا خلف المقام فرفع بصره إلى السماء فقال لعن الله اليهود- ثلاثا - إن الله حرم عليهم الشحوم فباعوها وأكلوا ثمنها وإن الله لم يحرم على قوم أكل شيء إلا حرم عليهم ثمنه وقال الإمام أحمد: حدثنا علي بن عاصم أنبأنا خالد الحذاء عن بركة أبي الوليد أنبأنا ابن عباس قال: كان رسول الله صلى الله عليه وعلى آله وسلم قاعدا في المسجد مستقبلا الحجر فنظر إلى السماء فضحك فقال لعن الله اليهود حرمت عليهم الشحوم فباعوها وأكلوا أثمانها وإن الله إذا حرم على قوم أكل شيء حرم عليهم ثمنه ورواه أبو داود من حديث خالد الحذاء وقال الأعمش عن جامع بن شداد عن كلثوم عن أسامة بن زيد قال: دخلنا على رسول الله صلى الله عليه وعلى آله وسلم وهو مريض نعوده فوجدناه نائما قد غطى وجهه ببرد عدني فكشف عن وجهه وقال لعن الله اليهود يحرمون شحوم الغنم ويأكلون أثمانها وفي رواية حرمت عليهم الشحوم فباعوها وأكلوا أثمانها وفي لفظ لأبي داود عن ابن عباس مرفوعا إن الله إذا حرم أكل شيء حرم عليهم ثمنه."
    },
    {
      "ayah": 147,
      "surah": 6,
      "text": "يقول تعالى: فإن كذبك يا محمد مخالفوك من المشركين واليهود ومن شابههم فقل \"ربكم ذو رحمة واسعة\" وهذا ترغيب لهم في ابتغاء رحمة الله الواسعة واتباع رسوله \"ولا يرد بأسه عن القوم المجرمين\" ترهيب لهم في مخالفتهم الرسول خاتم النبيين وكثيرا ما يقرن الله تعالى بين الترغيب والترهيب في القرآن كما قال تعالى في آخر هذه السورة \"وإن ربك سريع العقاب وإنه لغفور رحيم\" وقال \"وإن ربك لذو مغفرة للناس على ظلمهم وإن ربك لشديد العقاب\" وقال تعالى \"نبئ عبادي أني أنا الغفور الرحيم وأن عذابي هو العذاب الأليم\" وقال تعالى \"غافر الذنب وقابل التوب شديد العقاب\" وقال \"إن بطش ربك لشديد إنه هو يبدئ ويعيد وهو الغفور الودود\" والآيات في هذا كثيرة جدا."
    },
    {
      "ayah": 148,
      "surah": 6,
      "text": "هذه مناظرة ذكرها الله تعالى وشبهة تشبث بها المشركون في شركهم وتحريم ما حرموا فإن الله مطلع على ما هم فيه من الشرك والتحريم لما حرموه وهو قادر على تغييره بأن يلهمنا الإيمان ويحول بيننا وبين الكفر فلم يغيره فدل على أنه بمشيئته وإرادته ورضاه منا بذلك ولهذا قالوا \"لو شاء الله ما أشركنا ولا آباؤنا ولا حرمنا من شيء\" كما في قوله تعالى \"وقالوا لو شاء الرحمن ما عبدناهم\" الآية وكذلك الآية التي في النحل مثل هذه سواء قال الله تعالى \"كذلك كذب الذين من قبلهم\" أي بهذه الشبهة ضل من ضل قبل هؤلاء وهي حجة داحضة باطلة لأنها لو كانت صحيحة لما أذاقهم الله بأسه ودمر عليهم وأدال عليهم رسله الكرام وأذاق المشركين من أليم الانتقام \"قل هل عندكم من علم\" أي بأن الله راض عنكم فيما أنتم فيه \"فتخرجوه لنا\" أي فتظهروه لنا وتبينوه وتبرزوه \"إن تتبعون إلا الظن\" أي الوهم والخيال والمراد بالظن ههنا الاعتقاد الفاسد \"وإن أنتم إلا تخرصون\" تكذبون على الله فيما ادعيتموه قال علي بن أبي طلحة عن ابن عباس \"ولو شاء الله ما أشركنا\" وقال \"كذلك كذب الذين من قبلهم\" ثم قال \"ولو شاء الله ما أشركوا\" فإنهم قالوا عبادتنا الآلهة تقربنا إلى الله زلفى فأخبرهم الله أنها لا تقربهم فقوله \"ولو شاء الله ما أشركوا\" يقول تعالى لو شئت لجمعتهم على الهدى أجمعين."
    },
    {
      "ayah": 149,
      "surah": 6,
      "text": "وقوله تعالى \"قل فلله الحجة البالغة فلو شاء لهداكم أجمعين\" يقول تعالى لنبيه صلى الله عليه وسلم \"قل\" لهم يا محمد \"فلله الحجة البالغة\" أي له الحكمة التامة والحجة البالغة في هداية من هدى وإضلال من ضل \"فلو شاء لهداكم أجمعين\" فكل ذلك بقدرته ومشيئته واختياره وهو مع ذلك يرضي عن المؤمنين ويبغض الكافرين كما قال تعالى \"ولو شاء الله لجمعهم على الهدى\" وقال تعالى \"ولو شاء ربك لآمن من في الأرض\" وقوله \"ولو شاء ربك لجعل الناس أمة واحدة ولا يزالون مختلفين إلا من رحم ربك ولذلك خلقهم وتمت كلمة ربك لأملأن جهنم من الجنة والناس أجمعين\" قال الضحاك: لا حجة لأحد عصى الله ولكن الحجة البالغة على عباده."
    },
    { "ayah": 15, "surah": 6, "text": "يعني يوم القيامة." },
    {
      "ayah": 150,
      "surah": 6,
      "text": "وقوله تعالى \"قل هلم شهداءكم\" أي أحضروا شهداءكم \"الذين يشهدون أن الله حرم هذا\" أي هذا الذي حرمتموه وكذبتم وافتريتم على الله فيه \"فإن شهدوا فلا تشهد معهم\" أي لأنهم إنما يشهدون والحالة هذه كذبا وزورا \"ولا تتبع أهواء الذين كذبوا بآياتنا والذين لا يؤمنون بالآخرة وهم بربهم يعدلون\" أي يشركون به ويجعلون له عديلا."
    },
    {
      "ayah": 151,
      "surah": 6,
      "text": "قال داود الأودي عن الشعبي عن علقمة عن ابن مسعود رضي الله عنه قال: من أراد أن ينظر إلى وصية رسول الله صلى الله عليه وسلم التي عليها خاتمه فليقرأ هؤلاء الآيات \"قل تعالوا أتل ما حرم ربكم عليكم ألا تشركوا به شيئا- إلى قوله - لعلكم تتقون\" وقال الحاكم في مستدركه: حدثنا بكر بن محمد الصيرفي عن عروة حدثنا عبد الصمد بن الفضل حدثنا مالك بن إسماعيل المهدي حدثنا إسرائيل عن أبي إسحاق عن عبد الله بن خليفة قال: سمعت ابن عباس يقول في الأنعام آيات محكمات هن أم الكتاب ثم قرأ \"قل تعالوا أتل ما حرم ربكم عليكم\" الآيات ثم قال الحاكم: صحيح الإسناد ولم يخرجاه قلت ورواه زهير وقيس بن الربيع كلاهما عن أبي إسحاق عن عبد الله بن قيس عن ابن عباس به والله أعلم. وروى الحاكم أيضا في مسنده من حديث يزيد بن هارون عن سفيان بن حسين عن الزهري عن أبي إدريس عن عبادة بن الصامت قال: قال رسول الله صلى الله عليه وسلم أيكم يبايعني على ثلاث ثم تلا رسول الله صلى الله عليه وسلم \"قل تعالوا أتل ما حرم ربكم عليكم\" حتى فرغ من الآيات فمن وفى فأجره على الله ومن انتقض منهن شيئا فأدركه الله به في الدنيا كانت عقوبته ومن أخر إلى الآخرة فأمره إلى الله إن شاء عذبه وإن شاء عفا عنه ثم قال صحيح الإسناد ولم يخرجاه وإنما اتفقا على حديث الزهري عن أبي إدريس عن أبي عبادة بايعوني على أن لا تشركوا بالله شيئا الحديث وقد روى سفيان بن حسين كلا الحديثين فلا ينبغي أن ينسب إلى الوهم في أحد الحديثين إذا جمع بينهما والله أعلم. وأما تفسيرها فيقول تعالى لنبيه ورسوله محمد صلى الله عليه وسلم: قل يا محمد لهؤلاء المشركين الذين عبدوا غير الله وحرموا ما رزقهم الله وقتلوا أولادهم وكل ذلك فعلوه بآرائهم وتسويل الشياطين لهم \"قل\" لهم \"تعالوا\" أي هلموا واقبلوا \"أتل ما حرم ربكم عليكم\" أي أقص عليكم وأخبركم بما حرم ربكم عليكم حقا لا تخرصا ولا ظنا بل وحيا منه وأمرا من عنده \"ألا تشركوا به شيئا\" وكأن في الكلام محذوفا دل عليه السياق وتقديره وأوصاكم\"ألا تشركوا شيئا\" ولهذا قال في آخر الآية \"ذلكم وصاكم به لعلكم تعقلون\" وكما قال الشاعر: حج وأوصى بسليمى الأعبدا أن لا ترى ولا تكلم أحدا ولا يزل شرابها مبردا وتقول العرب أمرتك أن لا تقوم وفي الصحيحين من حديث أبي ذر رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم أتاني جبريل فبشرني أنه من مات لا يشرك بالله شيئا من أمتك دخل الجنة قلت وإن زنى وإن سرق؟ قال وإن زنى وإن سرق قلت وإن زنى وإن سرق؟ قال وإن زنى وإن سرق قلت وإن زنى وإن سرق؟ قال وإن زنى وإن سرق وإن شرب الخمر وفي بعض الروايات أن قائل ذلك إنا هو أبو ذر لرسول الله صلى الله عليه وسلم وأنه عليه الصلاة والسلام قال في الثالثة وإن رغم أنف أبي ذر فكان أبو ذر يقول بعد تمام الحديث وإن رغم أنف أبي ذر وفي بعض المسانيد والسنن عن أبي ذر قال: قال رسول الله صلى الله عليه وسلم يقول الله تعالى \" يا ابن آدم إنك ما دعوتني ورجوتني فإني أغفر لك على ما كان منك ولا أبالي ولو أتيتني بقراب الأرض خطيئة أتيتك بقرابها مغفرة ما لم تشرك بي شيئا وإن أخطأت حتى تبلغ خطاياك عنان السماء ثم استغفرتني غفرت لك \"ولهذا شاهد في القرآن قال الله تعالى \"إن الله لا يغفر أن يشرك به ويغفر ما دون ذلك لمن يشاء\" وفي صحيح مسلم عن ابن مسعود من مات لا يشرك بالله شيئا دخل الجنة والآيات والأحاديث في هذا كثيرة جدا وروى ابن مردوية من حديث عبادة وأبي الدرداء لا تشركوا بالله شيئا وإن قطعتم أو صلبتم أو حرقتم وقال ابن أبي حاتم: حدثنا محمد بن عوف الحمصي حدثنا ابن أبي مريم حدثنا نافع بن يزيد حدثني سيار بن عبد الرحمن عن يزيد بن قوذر عن سلمة بن شريح عن عبادة بن الصامت قال: أوصانا رسول الله صلى الله عليه وسلم بسبع خصال ألا تشركوا بالله شيئا وإن حرقتم وقطعتم وصلبتم رواه ابن أبي حاتم وقوله تعالى \"وبالوالدين إحسانا\" أي وأوصاكم وأمركم بالوالدين إحسانا أي أن تحسنوا إليهم كما قال تعالى \"وقضى ربك ألا تعبدوا إلا إياه وبالوالدين إحسانا\" وقرأ بعضهم ووصى ربك ألا تعبدوا إلا إياه وبالوالدين إحسانا أي أحسنوا إليهم والله تعالى كثيرا ما يقرن بين طاعته وبر الوالدين كما قال \"أن اشكر لي ولوالديك إلي المصير وإن جاهداك على أن تشرك بي ما ليس لك به علم فلا تطعهما وصاحبهما في الدنيا معروفا واتبع سبيل من أناب إلي ثم إلي مرجعكم فأنبئكم بما كنتم تعملون\" فأمر بالإحسان إليهما وإن كانا مشركين بحسبهما وقال تعالى \"وإذ أخذنا ميثاق بني إسرائيل لا تعبدون إلا الله وبالوالدين إحسانا\" الآية والآيات في هذا كثيرة وفي الصحيحين عن ابن مسعود رضي الله عنه أنه قال: سألت رسول الله صلى الله عليه وسلم أي العمل أفضل؟ قال الصلاة على وقتها قلت ثم أي؟ قل بر الوالدين قلت ثم أي؟ قال الجهاد في سبيل الله قال ابن مسعود: حدثني بهن رسول الله صلى الله عليه وسلم ولو استزدته لزادني وروى الحافظ أبو بكر بن مردوية بسنده عن أبي الدرداء وعن عبادة بن الصامت كل منهما يقول أوصاني خليلي رسول الله صلى الله عليه وسلم أطع والديك وإن أمراك أن تخرج لهما من الدنيا فافعل ولكن في إسناديهما ضعف والله أعلم. وقوله تعالى \"ولا تقتلوا أولادكم من إملاق نحن نرزقكم وإياهم\" لما أوصى تعالى بالوالدين والأجداد عطف على ذلك الإحسان إلى الأبناء والأحفاد فقال تعالى \"ولا تقتلوا أولادكم من إملاق\" وذلك أنهم كانوا يقتلون أولادهم كما سولت لهم الشياطين ذلك فكانوا يئدون البنات خشية العار وربما قتلوا بعض الذكور خشية الافتقار ولهذا ورد في الصحيحين من حديث عبد الله بن مسعود رضي الله عنه أنه سأل رسول الله صلى الله عليه وآله وسلم أي الذنب أعظم؟ قال أن تجعل لله ندا وهو خلقك قلت ثم أي؟ قال أن تقتل ولدك خشية أن يطعم معك قلت ثم أي؟ قال أن تزاني حليلة جارك ثم تلا رسول الله صلى الله عليه وسلم \"والذين لا يدعون مع الله إلها آخر ولا يقتلون النفس التي حرم الله إلا بالحق ولا يزنون\" الآية وقوله تعالى \"من إملاق\" قال ابن عباس وقتادة والسدي وغيره: هو الفقر أي ولا تقتلوهم من فقركم الحاصل. وقال في سورة الإسراء \"ولا تقتلوا أولادكم خشية إملاق\" أي لا تقتلوهم خوفا من الفقر في الآجل ولهذا قال هناك \"نحن نرزقهم وإياكم\" فبدأ برزقهم للاهتمام بهم أي لا تخافوا من فقركم بسبب رزقهم فهو على الله وأما هنا فلما كان الفقر حاصلا قال \"نحن نرزقكم وإياهم\" لأنه الأهم ههنا والله أعلم وقوله تعالى \"ولا تقربوا الفواحش ما ظهر منها وما بطن\" كقوله تعالى \"قل إنما حرم ربي الفواحش ما ظهر منها وما بطن والإثم والبغي بغير الحق وأن تشركوا بالله ما لم ينزل به سلطانا وأن تقولوا على الله ما لا تعلمون\" وقد تقدم تفسيرها في قوله تعالى \"وذروا ظاهر الإثم وباطنه\" وفي الصحيحين عن ابن مسعود رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم لا أحد أغير من الله من أجل ذلك حرم الفواحش ما ظهر منها وما بطن وقال عبد الملك بن عمير عن وراد عن مولاه المغيرة قال: قال سعد بن عبادة لو رأيت مع امرأتي رجلا لضربته بالسيف غير مصفح فبلغ ذلك رسول الله صلى الله عليه وسلم فقال أتعجبون من غيرة سعد؟ فوالله لأنا أغير من سعد والله أغير مني من أجل ذلك حرم الفواحش ما ظهر منها وما بطن أخرجاه وقال كامل أبو العلاء عن أبي صالح عن أبي هريرة قال: قيل يا رسول الله إنا نغار قال والله إني لأغار والله أغير مني ومن غيرته نهى عن الفواحش رواه ابن مردوية ولم يخرجه أحد من أصحاب الكتب الستة ومر على شرط الترمدي فقد روي بهذا السند أعمار أمتي ما بين الستين إلى السبعين وقوله تعالى \"ولا تقتلوا النفس التي حرم الله إلا بالحق\" وهذا مما نص تبارك وتعالى عن النهي عنه تأكيدا وإلا فهو داخل في النهي عن الفواحش ما ظهر منها وما بطن فقد جاء في الصحيحين عن ابن مسعود رضي الله تعالى عنه قال: قال رسول الله صلى الله عليه وسلم لا يحل دم امرئ مسلم يشهد أن لا إله إلا الله وأنى رسول الله إلا بإحدى ثلاث الثيب الزاني والنفس بالنفس والتارك لدينه المفارق للجماعة وفي لفظ لمسلم والذي لا إله غيره لا يحل دم رجل مسلم وذكره قال الأعمش فحدثت به إبراهيم فحدثني عن الأسود عن عائشة بمثله وروى أبو داود والنسائي عن عائشة رضي الله عنها أن رسول الله صلى الله عليه وسلم قال لا يحل دم امرئ مسلم إلا بإحدى ثلات خصال زان محصن يرجم ورجل قتل متعمدا فيقتل ورجل يخرج من الإسلام وحارب الله ورسوله فيقتل أو يصلب أو ينفى من الأرض وهذا لفظ النسائي. وعن أمير المؤمنين عثمان بن عفان أنه قال وهو محصور: سمعت رسول الله صلى الله عليه وسلم يقول لا يحل دم امرئ مسلم إلا بإحدى ثلاث: رجل كفر بعد إسلامه أو زنى بعد إحصانه أو قتل نفسا بغير نفس فوالله ما زنيت في جاهلية ولا إسلام ولا تمنيت أن لي بديني بدلا منه بعد إذ هداني الله ولا قتلت نفسا فبم تقتلوني؟. رواه الإمام أحمد والترمذي والنسائي وابن ماجه وقال الترمذي هذا حديث حسن وقد جاء النهي والزجر والوعيد في قتل المعاهد وهو المستأمن من أهل الحرب فروى البخاري عن عبد الله بن عمر عن النبي صلى الله عليه وسلم مرفوعا من قتل معاهدا لم يرح رائحة الجنة وإن ريحها ليوجد من مسيرة أربعين عاما وعن أبي هريرة عن النبي صلى الله عليه وسلم قال من قتل معاهدا له ذمة الله وذمة رسوله فقد أخفر بذمة الله فلا يرح رائحة الجنة وإن ريحها ليوجد من مسيرة سبعين خريفا رواه ابن ماجه والترمذي وقال حسن صحيح وقوله \"ذلكم وصاكم به لعلكم تعقلون\" أي هذا مما وصاكم به لعلكم تعقلون عن الله أمره ونهيه."
    },
    {
      "ayah": 152,
      "surah": 6,
      "text": "قال عطاء بن السائب عن سعيد بن جبير عن ابن عباس قال: لما أنزل الله \"ولا تقربوا مال اليتيم إلا بالتي هي أحسن\"و \"إن الذين يأكلون أموال اليتامى ظلما\" الآية فانطلق من كان عنده يتيم فعزل طعامه من طعامه وشرابه من شرابه فجعل يفضل الشيء فيحبس له حتى يأكله ويفسد فاشتد ذلك علهم فذكروا ذلك لرسول الله فأنزل الله \"ويسألونك عن اليتامى قل إصلاح لهم خير وإن تخالطوهم فإخوانكم\" قال: فخلطوا طعامهم بطعامهم وشرابهم بشرابهم رواه أبو داود وقوله تعالى \"حتى يبلغ أشده\" قال الشعبي ومالك وغير واحد من السلف يعني حتى يحتلم. وقال السدي: حتى يبلغ ثلاثين سنة وقيل أربعون سنة وقيل ستون سنة قال وهذا كله بعيد ههنا والله أعلم. وقوله تعالى \"وأوفوا الكيل والميزان بالقسط\" يأمر تعالى بإقامة العدل فى الأخذ والإعطاء كما توعد على تركه في قوله تعالى \"ويل للمطففين الذين إذا اكتالوا على الناس يستوفون وإذا كالوهم أو وزنوهم يخسرون ألا يظن أولئك أنهم مبعوثون ليوم عظيم يوم يقوم الناس لرب العالمين\" وقد أهلك الله أمة من الأمم كانوا يبخسون المكيال والميزان وفي كتاب الجامع لأبي عيسى الترمذي من حديث الحسين بن قيس أبي علي الرحبي عن عكرمة عن ابن عباس رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم لأصحاب الكيل والميزان إنكم وليتم أمرا هلكت فيه الأمم السالفة قبلكم ثم قال لا نعرفه مرفوع إلا من حديث الحسين وهو ضعيف في الحديث. وقد روي بإسناد صحيح عن ابن عباس موقوفا قلت وقد رواه ابن مردوية في تفسيره من حديث شريك عن الأعمش عن سالم بن أبي الجعد عن ابن عباس قال: قال رسول الله صلى الله عليه وسلم إنكم معشر الموالي قد بشركم الله بخصلتين بها هلكت القرون المتقدمة المكيال والميزان وقوله تبارك وتعالى \"لا نكلف نفسا إلا وسعها\" أي من اجتهد في أداء الحق وأخذه فإن أخطأ بعد استفراغ وسعه وبذل جهده فلا حرج عليه. وقد روى ابن مردوية من حديث بقية عن ميسرة بن عبيد عن عمرو بن ميمون بن مهران عن أبيه عن سعيد بن المسيب قال: قال رسول الله صلى الله عليه وسلم في الآية \"وأوفوا الكيل والميزان بالقسط لا نكلف نفسا إلا وسعها\" فقال من أوفي على يده في الكيل والميزان والله يعلم صحة نيته بالوفاء فيهما لم يؤاخذ وذلك تأويل وسعها هذا مرسل غريب وقوله \"وإذا قلتم فاعدلوا ولو كان ذا قربى\" كقوله \"يا أيها الذين آمنوا كونوا قوامين لله شهداء بالقسط\" الآية وكذا التي تشبهها في سورة النساء يأمر تعالى بالعدل في الفعال والمقال على القريب والبعيد والله تعالى يأمر بالعدل لكل أحد في كل وقت وفي كل حال وقوله \"وبعهد الله أوفوا\" قال ابن جرير: يقول وبوصية الله التي أوصاكم بها فأوفوا وإيفاء ذلك أن تطيعوه فيما أمركم ونهاكم وتعملوا بكتابه وسنة رسوله وذلك هو الوفاء بعهد الله \"ذلكم وصاكم به لعلكم تذكرون\" يقول تعالى: هذا أوصاكم به وأمركم به وأكد عليكم فيه \"لعلكم تذكرون\" أي تتعظون وتنتهون مما كنتم فيه قبل هذا وقرأ بعضهم بتشديد الذال وآخرون بتخفيفها."
    },
    {
      "ayah": 153,
      "surah": 6,
      "text": "قال علي بن أبي طلحة عن ابن عباس في قوله \"ولا تتبعوا السبل فتفرق بكم عن سبيله\" وفي قوله \"أن أقيموا الدين ولا تتفرقوا فيه\" ونحو هذا في القرآن قال أمر الله المؤمنين بالجماعة ونهاهم عن الاختلاف والتفرقة وأخبرهم أنه إنما هلك من كان قبلهم بالمراء والخصومات في دين الله ونحو هذا قاله مجاهد وغير واحد وقال الإمام أحمد بن حنبل: حدثنا الأسود بن عامر شاذان حدثنا أبو بكر هو ابن عياش عن عاصم هو ابن أبي النجود عن أبي وائل عن عبد الله هو ابن مسعود رضي الله عنه قال: خط رسول الله صلى الله عليه وسلم خطا بيده ثم قال هذا سبيل الله مستقيما وخط عن يمينه وشماله ثم قال هذه السبل ليس منها سبيل إلا عليه شيطان يدعو إليه ثم قرأ \"وأن هذا صراطي مستقيما فاتبعوه ولا تتبعوا السبل فتفرق بكم عن سبيله\" وكذا رواه الحاكم عن الأصم عن أحمد بن عبد الجبار عن أبي بكر بن عياش به وقال صحيح ولم يخرجاه وهكذا رواه أبو جعفر الرازي وورقاء وعمرو بن أبي قيس عن عاصم عن أبي وائل شقيق بن سلمة عن ابن مسعود مرفوعا به نحوه وكذا رواه يزيد بن هارون ومسدد والنسائي عن يحيى بن حبيب بن عربي وابن حبان من حديث ابن وهب أربعتهم عن حماد بن زيد عن عاصم عن أبي وائل عن ابن مسعود به وكذا رواه ابن جرير عن المثنى عن الحماني عن حماد بن زيد به ورواه الحاكم عن أبي بكر بن إسحاق عن إسماعيل بن إسحاق القاضي عن سليمان بن حرب عن حماد بن زيد به كذلك وقال صحيح ولم يخرجاه وقد روى هذا الحديث النسائي والحاكم من حديث أحمد بن عبد الله بن يونس عن أبي بكر بن عياش عن عاصم عن زر عن عبد الله بن مسعود به مرفوعا وكذا رواه الحافظ أبو بكر بن مردوية من حديث يحيى الحماني عن أبي بكر بن عياش عن عاصم عن زر به فقد صححه الحاكم كما رأيت في الطريقين ولعل هذا الحديث عن عاصم بن أبي النجود عن زر وعن أبي وائل شقيق بن سلمة كلاهما عن ابن مسعود به والله أعلم وقال الحاكم: وشاهد هذا الحديث حديث الشعبي عن جابر من غير وجه معتمد. يشير إلى الحديث الذي قال الإمام أحمد وعبد بن حميد جميعا واللفظ لأحمد حدثنا عبد الله بن محمد وهو أبو بكر بن أبي شيبة أنبأنا أبو خالد الأحمر عن مجاهد عن الشعبي عن جابر قال: كنا جلوسا عند النبي صلى الله عليه وسلم فخط خطا هكذا أمامه فقال هذا سبيل الله وخطين عن يمينه وخطين عن شماله وقال هذه سبل الشيطان ثم وضع يده في الخط الأوسط ثم تلا هذه الآية \"وأن هذا صراطي مستقيما فاتبعوه ولا تتبعوا السبل فتفرق بكم عن سبيله ذلكم وصاكم به لعلكم تتقون\" ورواه أحمد وابن ماجه في كتاب السنة من سننه والبزار عن أبي سعيد عبد الله بن سعيد عن أبي خالد الأحمر به قلت ورواه الحافظ ابن مردوية من طريقين عن أبي سعيد الكندي حدثنا أبو خالد عن مجاهد عن الشعبي عن جابر قال: خط رسول الله صلى الله عليه وسلم خطا وخط عن يمينه خطا وخط عن يساره خطا ووضع يده على الخط الأوسط وتلا هذه الآية \"وأن هذا صراطي مستقيما فاتبعوه\" ولكن العمدة على حديث ابن مسعود مع ما فيه من الاختلاف إن كان مؤثرا وقد روي موقوفا عليه قال ابن جرير: حدثنا محمد بن عبد الأعلى حدثنا محمد بن ثور عن معمر عن أبان بن عثمان أن رجلا قال لابن مسعود ما الصراط المستقيم؟ قال: تركنا محمد صلى الله عليه وسلم في أدناه وطرفه في الجنة وعن يمينه جواد وعن يساره جواد ثم رجال يدعون من مر بهم فمن أخذ في تلك الجواد انتهت به إلى النار ومن أخذ على الصراط انتهى به إلى الجنة. ثم قرأ ابن مسعود \"وأن هذا صراطي مستقيما فاتبعوه ولا تتبعوا السبل فتفرق بكم عن سبيله\" الآية وقال ابن مردوية: حدثنا محمد بن عبد الوهاب حدثنا آدم حدثنا إسماعيل بن عياش حدثنا أبان بن عياش عن مسلم بن أبي عمران عن عبد الله بن عمر سأل عبد الله عن الصراط المستقيم فقال ابن مسعود تركنا محمد فى أدناه وطرفه في الجنة وذكر تمام الحديث كما تقدم والله أعلم. وقد روي من حديث النواس بن سمعان نحوه قال الإمام أحمد حدثني الحسن بن سوار أبو العلاء حدثنا ليث يعني ابن سعد عن معاوية بن صالح أن عبد الرحمن بن جبير بن نفير حدثه عن أبيه عن النواس بن سمعان عن رسول الله صلى الله عليه وسلم قال ضرب الله مثلا صراطا مستقيما وعن جنبي الصراط سوران فيهما أبواب مفتحة وعلى الأبواب ستور مرخاة وعلى باب الصراط داع يقول يا أيها الناس ادخلوا الصراط المستقيم جميعا ولا تفرقوا وداع يدعو من فوق الصراط فإذا أراد الإنسان أن يفتح شيئا من تلك الأبواب قال ويحك لا تفتحه فإنك إن تفتحه تلجه فالصراط الإسلام والسوران حدود الله والأبواب المفتحة محارم الله وذلك الداعي على رأس الصراط كتاب الله والداعي من فوق الصراط واعظ الله في قلب كل مسلم ورواه الترمذي والنسائي عن علي بن حجر زاد النسائي وعمرو بن عثمان كلاهما عن بقية بن الوليد عن يحيى بن سعد عن خالد بن معدان عن جبير بن نفير عن النواس بن سمعان به وقال الترمذي حسن غريب وقوله تعالى \"فاتبعوه ولا تتبعوا السبل\" إنما وحد سبيله لأن الحق واحد ولهذا جمع السبل لتفرقها وتشعبها كما قال تعالى \"الله ولي الذين آمنوا يخرجهم من الظلمات إلى النور والذين كفروا أولياؤهم الطاغوت يخرجونهم من النور إلى الظلمات أولئك أصحاب النار هم فيها خالدون\" وقال ابن أبي حاتم حدثنا أحمد بن سنان الواسطي حدثنا يزيد بن هارون حدثنا سفيان بن حسين عن الزهري عن أبي إدريس الخولاني عن عبادة بن الصامت قال: قال رسول الله صلى الله عليه وسلم أيكم يبايعني على هؤلاء الآيات الثلاث ثم تلا \"قل تعالوا أتل ما حرم ربكم عليكم\" حتى فرغ من ثلاث آيات ثم قال ومن وفى بهن فأجره على الله ومن انتقص منهن شيئا فأدركه الله في الدنيا كانت عقوبته ومن أخره إلى الآخرة كان أمره إلى الله إن شاء أخذه وإن شاء عفا عنه."
    },
    {
      "ayah": 154,
      "surah": 6,
      "text": "قال ابن جرير \"ثم آتينا موسى الكتاب\" تقديره ثم قل يا محمد مخبرا عنا أنا آتينا موسى الكتاب بدلالة قوله \"قل تعالوا أتل ما حرم ربكم عليكم\" قلت وفي هذا نظر و \"ثم\" ههنا إنما هي لعطف الخبر بعد الخبر لا للترتيب ههنا كما قال الشاعر: قل لمن ساد ثم ساد أبوه ثم قد ساد قبل ذلك جده وههنا لما أخبر الله سبحانه عن القرآن بقوله\"وأن هذا صراطي مستقيما فاتبعوه\" عطف بمدح التوراة ورسولها فقال \"ثم آتينا موسى الكتاب\" وكثيرا ما يقرن سبحانه بين ذكر القرآن والتوراة كقوله تعالى \"ومن قبله كتاب موسى إماما ورحمة وهذا كتاب مصدق لسان عربيا\" وقوله أول هذه السورة \"قل من أنزل الكتاب الذي جاء به موسى نورا وهدى للناس تجعلونه قراطيس تبدونها وتخفون كثيرا\" الآية."
    },
    {
      "ayah": 155,
      "surah": 6,
      "text": "وبعدها \"وهذا كتاب أنزلناه مبارك\" الآية. وقال تعالى مخبرا عن المشركين \"فلما جاءهم الحق من عندنا قالوا لولا أوتي مثل ما أوتي موسى\" قال تعالى \"أو لم يكفروا بما أوتي موسى من قبل قالوا سحران تظاهرا وقالوا إنا بكل كافرون\" وقال تعالى مخبرا عن الجن أنهم قالوا \"يا قومنا إنا سمعنا كتابا أنزل من بعد موسى مصدقا لما بين يديه يهدي إلى الحق\" الآية وقوله تعالى \"تماما على الذي أحسن وتفصيلا\" أي آتيناه الكتاب الذي أنزلناه إليه تمام كاملا جامعا لما يحتاج إليه في شريعته كقوله \"وكتبنا له في الألواح من كل شيء\" الآية. وقوله تعالى \"على الذي أحسن\" أى جزاء على إحسانه في العمل وقيامه بأوامرنا وطاعتنا كقوله \"هل جزاء الإحسان إلا الإحسان\" وكقوله \"وإذ ابتلى إبراهيم ربه بكلمات فأتمهن قال إني جاعلك للناس إماما\" وكقوله \"وجعلنا منهم أئمة يهدون بأمرنا لما صبروا و كانوا بآياتنا يوقنون\" وقال أبو جعفر الرازي عن الربيع بن أنس \"ثم آتينا موسى الكتاب تماما على الذي أحسن\" يقول أحسن فيما أعطاه الله وقال قتادة من أحسن في الدنيا تمم له ذلك في الآخرة واختار ابن جرير أن تقديره \"ثم آتينا موسى الكتاب تماما\" على إحسانه فكأنه جعل الذي مصدرية كما قيل في قوله تعالى \"وخضتم كالذي خاضوا\" أي كخوضهم وقال ابن رواحة. وثبت الله ما آتاك من حسن في المرسلين ونصرا كالذي نصروا وقال آخرون الذي ههنا بمعنى الذين قال ابن جرير وذكر عبد الله بن مسعود أنه كان يقرؤها تماما على الذين أحسنوا وقال ابن أبي نجيح عن مجاهد تماما على الذي أحسن قال على المؤمنين والمحسنين وكذا قال أبو عبيدة وقال البغوي المحسنون الأنبياء والمؤمنون. يعني أظهرنا فضله عليهم قلت كقوله تعالى \"قال يا موسى إني اصطفيتك على الناس برسالاتي وبكلامي\" ولا يلزم اصطفاؤه على محمد صلى الله عليه وسلم خاتم الأنبياء والخليل عليهما السلام لأدلة أخرى. قال ابن جرير: وروى أبو عمرو بن العلاء عن يحيى بن يعمر أنه كان يقرؤها تماما على الذي أحسن رفعا بتأويل على الذي هو أحسن ثم قال وهذه قراءة لا أستجيز القراءة بها وإن كان لها في العربية وجه صحيح وقيل معناه تماما على إحسان الله زيادة على ما أحسن إليه حكاه ابن جرير والبغوي ولا منافاة بينه وبين القول الأول وبه جمع ابن جرير كما بيناه ولله الحمد وقوله تعالى \"وتفصيلا لكل شيء وهدى ورحمة\" فيه مدح لكتابه الذي أنزله الله عليه \"لعلهم بلقاء ربهم يؤمنون وهذا كتاب أنزلناه مبارك فاتبعوه واتقوا لعلكم ترحمون\" فيه الدعوة إلى اتباع القرآن يرغب سبحانه عباده في كتابه ويأمرهم بتدبره والعمل به والدعوة إليه ووصفه بالبركة لمن اتبعه وعمل به في الدنيا والآخرة لأنه حبل الله المتين."
    },
    {
      "ayah": 156,
      "surah": 6,
      "text": "قال ابن جرير معناه وهذا كتاب أنزلناه لئلا تقولوا \"إنما أنزل الكتاب على طائفتين من قبلنا\" يعني لينقطع عذركم كقوله تعالى \"ولولا أن تصيبهم مصيبة بما قدمت أيديهم فيقولوا ربنا لولا أرسلت إلينا رسولا فنتبع آياتك\" الآية. وقوله تعالى \"على طائفتين من قبلنا\" قال علي بن أبي طلحة عن ابن عباس هم اليهود والنصارى وكذا قال مجاهد والسدي وقتادة وغير واحد وقوله \"وإن كنا عن دراستهم لغافلين\" أي وما كنا نفهم ما يقولون لأنهم ليسوا بلساننا ونحن في غفلة وشغل مع ذلك عما هم فيه."
    },
    {
      "ayah": 157,
      "surah": 6,
      "text": "وقوله \"أو تقولوا لو أنا أنزل علينا الكتاب لكنا أهدى منهم\" أي وقطعنا تعللكم أن تقولوا لو أنا أنزل علينا ما أنزل عليهم لكنا أهدى منهم فيما أوتوه كقوله \"وأقسموا بالله جهد أيمانهم لئن جاءهم نذير ليكونن أهدى من إحدى الأمم\" الآية. وهكذا قال ههنا \"فقد جاءكم بينة من ربكم وهدى ورحمة\" يقول فقد جاءكم من الله على لسان محمد صلى الله عليه وآله وسلم النبي العربي قرآن عظيم فيه بيان للحلال والحرام وهدى لما في القلوب ورحمة من الله بعباده الذين يتبعونه ويقتفون ما فيه وقوله تعالى \"فمن أظلم ممن كذب بآيات الله وصدف عنها\" أي لم ينتفع بما جاء به الرسول ولا اتبع ما أرسل به ولا ترك غيره بل صدف عن اتباع آيات الله أي صرف الناس وصدهم عن ذلك قاله السدي وعن ابن عباس ومجاهد وقتادة وصدف عنها أعرض عنها وقول السدي ههنا فيه قوة لأنه قال\"فمن أظلم ممن كذب بآيات الله وصدف عنها\" كما تقدم في أول السورة\"وهم ينهون عنه وينأون عنه وإن يهلكون إلا أنفسهم\" وقال تعالى \"الذين كفروا وصدوا عن سبيل الله زدناهم عذابا فوق العذاب\" وقال في هذه الآمة الكريمة \"سنجزي الذين يصدفون عن آياتنا سوء العذاب بما كانوا يصدفون\" وقد يكون المراد فيما قاله ابن عباس ومجاهد وقتادة \"فمن أظلم ممن كذب بآيات الله وصدف عنها\" أي لا آمن بها ولا عمل بها كقوله تعالى \"فلا صدق ولا صلى ولكن كذب وتولى\" وغير ذلك من الآيات الدالة على اشتمال الكافر على التكذيب بقلبه وترك العمل بجوارحه ولكن كلام السدي أقوى وأظهر والله أعلم لأن الله قال \"فمن أظلم ممن كذب بآيات الله وصدف عنها\" كقوله تعالى \"الذين كفروا وصدوا عن سبيل الله زدناهم عذابا فوق العذاب بما كانوا يفسدون\"."
    },
    {
      "ayah": 158,
      "surah": 6,
      "text": "يقول تعالى متوعدا للكافرين به والمخالفين لرسله والمكذبين بآياته والصادين عن سبيله \"هل ينظرون إلا أن تأتيهم الملائكة أو يأتي ربك\" وذلك كائن يوم القيامة \"أو يأتي بعض آيات ربك يوم يأتي بعض آيات ربك لا ينفع نفسا إيمانها\" وذلك قبل يوم القيامة كائن من أمارات الساعة وأشراطها كما قال البخاري في تفسير هذه الآية حدثنا موسى بن إسماعيل حدثنا عبد الواحد حدثنا عمارة حدثنا أبو زرعة عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم\" لا تقوم الساعة حتى تطلع الشمس من مغربها فإذا رآها الناس آمن من عليها فذلك حين لا ينفع نفسا إيمانها لم تكن آمنت من قبل حدثنا إسحاق حدثنا عبد الرزاق حدثنا معمر عن همام بن منبه عن أبي هريرة قال: قال رسول الله صلي الله عليه وعلى آله وسلم لا تقوم الساعة حتى تطلع الشمس من مغربها وفي لفظ فإذا طلعت ورآها الناس آمنوا أجمعون وذلك حين لا ينفع نفسا إيمانها لم تكن آمنت من قبل ثم قرأ هذه الآية. هكذا روي هذا الحديث من هذين الوجهين ومن الوجه الأول أخرجه بقية الجماعة في كتبهم إلا الترمذي من طرق عن عمارة بن القعقاع بن شبرمة عن أبي زرعة بن عمرو بن جرير عن أبي هريرة به. وأما الطريق الثاني فرواه عن إسحاق غير منسوب وقيل هو ابن منصور الكوسج وقيل إسحاق بن نصر والله أعلم وقد رواه مسلم عن محمد بن رافع الجند يسابوري كلاهما عن عبد الرزاق به. وقد ورد هذا الحديث من طرق أخر عن أبى هريرة كما انفرد مسلم بروايته من حديث العلاء بن عبد الرحمن بن يعقوب مولى الحرقة عن أبيه عن أبي هريرة به وقال ابن جرير حدثنا أبو كريب حدثنا ابن فضيل عن أبيه عن أبي حازم عن أبي هريرة قال: قال رسول الله تعالى عليه وآله وسلم ثلاث إذا خرجن \"لا ينفع نفسا إيمانها لم تكن آمنت من قبل أو كسبت في إيمانها خيرا\" طلوع الشمس من مغربها والدجال ودابة الأرض ورواه أحمد عن وكيع عن فضيل بن غزوان عن أبي حازم سلمان عن أبي هريرة به وعنده والدخان. ورواه مسلم عن أبى بكر بن أبي شيبة وزهير بن حرب عن وكيع ورواه هو أيضا والترمذي من غير وجه عن فضيل بن غزوان به. ورواه إسحاق بن عبد الله القروي عن مالك عن أبي الزناد عن الأعرج عن أبي هريرة ولكن لم يخرجه أحد من أصحاب الكتب من هذا الوجه لضعف القروي والله أعلم وقال ابن جرير حدثنا الربيع بن سليمان حدثنا شعيب بن الليث عن أبيه عن جعفر بن ربيعه عن عبد الرحمن بن هرمز الأعرج عن أبي هريرة قال: قال رسول الله صلى الله عليه وعلى آله وسلم لاتقوم الساعة حتى تطلع الشمس من مغربها فإذا طلعت آمن الناس كلهم وذلك حين لا ينفع نفسا إيمانها لم تكن أمنت من قبل الآية ورواه ابن لهيعة عن الأعرج عن أبي هريرة به. ورواه وكيع عن فضيل بن غزوان عن أبي حازم عن أبي هريرة به أخرج هذه الطرق كلها الحافظ أبو بكر بن مردوية في تفسيره وقال ابن جرير حدثنا الحسن بن يحيى أخبرنا عبد الرزاق قال أخبرنا معمر عن أيوب عن ابن سيرين عن أبي هريرة قال:قال رسول الله صلى الله عليه وسلم من تاب قبل أن تطلع الشمس من مغربها قبل منه لم يخرجه أحد من أصحاب الكتب الستة \"حديث آخر\" عن أبي ذر الغفاري في الصحيحين وغيرهما من طرق عن إبراهيم بن يزيد بن شريك التيمي عن أبيه عن أبي ذر جندب بن جنادة رضي الله عنه قال: قال رسول الله صلى الله عليه وعلى آله وسلم أتدري أين تذهب الشمس إذا غربت ؟ قلت لا أدري !قال إنها تنتهي دون العرش فتخر ساجدة ثم تقوم حتى يقال لها ارجعي فيوشك يا أبا ذر أن يقال لها ارجعي من حيث جئت وذلك حين \"لا ينفع نفسا إيمانها لم تكن آمنت من قبل\". \"حديث آخر\" عن حذيفة بن أسيد بن أبي شريحة الغفاري رضي الله عنه قال الإمام أحمد بن حنبل حدثنا سفيان عن فرات عن أبي الطفيل عن حذيفة بن أسد الغفاري قال:أشرف علينا رسول الله صلى الله عليه وسلم من غرفة ونحن نتذاكر الساعة فقال رسول الله صلى الله عليه وسلم لا تقوم الساعة حتى تروا عشر آيات: طلوع الشمس من مغربها والدخان والدابة وخروج يأجوج ومأجوج وخروج عيسى ابن مريم وخروج الدجال وثلاثة خسوف:خسف بالمشرق وخسف بالمغرب وخسف بجزيرة العرب ونار تخرج من قعر عدن تسوق أو تحشر الناس تبيت معهم حيث باتوا وتقيل معهم حيث قالوا.وهكذا رواه مسلم وأهل السنن الأربعة من حديث فرات القزاز عن أبي الطفيل عامر بن واثلة عن حذيفة بن أسيد به. وقال الترمذي حسن صحيح. \"حديث آخر\" عن حذيفة بن اليمان رضي الله عنه قال الثوري عن منصور عن ربعي عن حذيفة قال: سألت رسول الله صلى الله عليه وسلم فقلت يا رسول الله ما أية طلوع الشمس من مغربها ؟ فقال النبي صلى الله عليه وآله وسلم تطول تلك الليلة حتى تكون قدر ليلتين فينتبه الذين كانوا يصلون فيها فيعملون كما كانوا يعملون قبلها والنجوم لا ترى قد غابت مكانها ثم يرقدون ثم يقومون فيصلون ثم يرقدون ثم يقومون تبطل عليهم جنوبهم حتى يتطاول عليهم الليل فيفزع الناس ولا يصبحون فبينما هم ينتظرون طلوع الشمس من مشرقها إذ طلعت من مغربها فإذا رآها الناس آمنوا فلم ينفعهم إيمانهم.رواه ابن مردوية وليس هو في شيء من الكتب الستة من هذا الوجه والله أعلم. \"حديث آخر\" عن أبي سعيد الخدري واسمه سعد بن مالك بن سنان رضي الله عنه وأرضاه قال الإمام أحمد حدثنا وكيع حدثنا ابن أبي ليلى عن عطية العوفي عن أبي سعيد الخدري رضي الله عنه عن النبي صلى الله عليه وسلم يوم يأتي بعض آيات ربك لا ينفع نفسا إيمانها قال طلوع الشمس من مغربها.ورواه الترمذي عن سفيان بن وكيع عن أبيه به وقال غريب. ورواه بعضهم ولم يرفعه وفي حديث طالوت بن عباد عن فضال بن جبير عن أبي امامة صدي بن عجلان قال: قال رسول الله صلى الله عليه وسلم إن أول الآيات طلوع الشمس من مغربها.وفي حديث عاصم بن أبي النجود عن زر بن حبيش عن صفوان بن عسال قال: سمعت رسول الله صلى الله عليه وسلم يقول إن الله فتح بابا قبل المغرب عرضه سبعون عاما للتوبة لا يغلق حتى تطلع الشمس منه.رواه الترمذي وصححه النسائي وابن ماجه من حديث طويل \"حديث آخر\" عن عبد الله بن أبي أوفى قال ابن مردوية حدثنا محمد بن علي بن دحيم حدثنا أحمد بن حازم حدثنا ضرار بن صرد حدثنا ابن فضيل عن سليمان بن زيد عن عبد الله بن أبي أوفى قال: سمعت رسول الله صلى الله عليه وسلم يقول ليأتين على الناس ليلة تعدل ثلاث ليال من لياليكم هذه فإذا كان ذلك يعرفها المتنفلون يقوم أحدهم فيقرأ حزبه ثم ينام ثم يقوم فيقرأ حزبه ثم ينام فبينما هم كذلك إذ صاح الناس بعضهم من بعض فقالوا ما هذا فيفزعون إلى المساجد فإذا هم بالشمس قد طلعت حتى إذا صارت في وسط السماء رجعت وطلعت من مطلعها قال حينئذ لا ينفع نفسا إيمانها.هذا حديث غريب من هذا الوجه وليس هو في شيء من الكتب الستة. \"حديث آخر\" عن عبد الله بن عمرو قال الإمام أحمد حدثنا إسماعيل بن إبراهيم حدثنا أبو حيان عن أبي زرعة عن عمرو بن جرير قال جلس ثلاثه من المسلمين إلى مروان بالمدينة فسمعوه وهو يحدث عن الآيات يقول إن أولها خروج الدجال قال فانصرفوا إلى عبد الله بن عمرو فحدثوه بالذي سمعوه من مروان في الآيات فقال لم يقل مروان شيئا حفظت من رسول الله صلى الله عليه وسلم يقول إن أول الآيات خروجا طلوع الشمس من مغربها وخروج الدابة ضحى فأيتهما كانت قبل صاحبتها فالأخرى على أثرها ثم قال عبد الله وكان يقرأ الكتب وأظن أولها خروجا طلوع الشمس من مغربها وذلك أنها كلما غربت أتت تحت العرش وسجدت واستأذنت في الرجوع فأذن لها في الرجوع حتى إذا بدا الله أن تطلع من مغربها فعلت كما كانت تفعل أتت تحت العرش فسجدت واستأذنت في الرجوع فلم يرد عليها شيء ثم استأذنت في الرجوع فلا يرد عليها شيء حتى إذا ذهب من الليل ما شاء الله أن يذهب وعرفت أنه إذا أذن لها في الرجوع لم تدرك المشرق قالت رب ما أبعد المشرق من لي بالناس حتى إذا صار الأفق كأنه طوق استأذنت في الرجوع فيقال لها من مكانك فاطلعي فطلعت على الناس من مغربها ثم تلا عبد الله هذه الآية \"لا ينفع نفسا إيمانها لم تكن آمنت من قبل\" الآية وأخرجه مسلم في صحيحه وأبو داود وابن ماجه في سننيهما من حديث أبي حيان التيمي واسمه يحيى بن سعيد بن حيان عن أبي زرعة بن عمرو بن جرير به. \"حديث آخر عنه\" قال الطبراني حدثنا أحمد بن يحيى بن خالد بن حيان الرقي حدثنا إسحاق بن إبراهيم بن زريق الحمصي حدثنا عثمان بن سعيد بن كثير بن دينار حدثنا ابن لهيعة عن يحيى بن عبد الله عن أبي عبد الرحمن الحبلي عن عبد الله بن عمرو بن العاص قال: قال النبي صلى الله عليه وسلم إذا طلعت الشمس من مغربها خر إبليس ساجدا ينادي ويجهر إلهي مرني أن أسجد لمن شئت قال فيجتمع إليه زبانيته فيقولون كلهم ما هذا التضرع فيقول إنما سألت ربي أن ينظرني إلى الوقت المعلوم وهذا الوقت المعلوم قال ثم تخرج دابة الأرض من صدع في الصفا قال: فأول خطوة تضعها بأنطاكيا فتأتي إبليس فتلطمه هذا حديث غريب جدا وسنده ضعيف ولعله من الزاملتين اللتين أصابهما عبد الله بن عمرو يوم اليرموك فأما رفعه فمنكر والله أعلم \"حديث آخر\" عن عبد الله بن عمرو وعبد الرحمن بن عوف ومعاوية ابن أبي سفيان رضي الله عنهم أجمعين قال الإمام أحمد حدثنا الحكم بن نافع حدثنا إسماعيل بن عياش عن ضمضم بن زرعة عن شريح بن عبيد يرده إلى مالك بن يخامر عن ابن السعدي أن رسول الله صلى الله عليه وسلم قال لا تنقطع الهجرة مادام العدو يقاتل فقال معاوية وعبد الرحمن بن عوف وعبد الله بن عمرو بن العاص أن رسول الله صلى الله عليه وسلم قال إن الهجرة خصلتان إحداهما تهجر السيئات والأخرى تهاجر إلى الله ورسوله ولا تنقطع ما تقبلت التوبة ولا تزال التوبة تقبل حتى تطلع الشمس من مغربها فإذا طلعت طبع على كل قلب بما فيه وكفى الناس العمل.هذا الحديث حسن الإسناد ولم يخرجه أحد من أصحاب الكتب الستة والله أعلم.\" حديث آخر \"عن ابن مسعود رضي الله عنه قال عوف الأعرابي عن محمد بن سيرين حدثني أبوعبيدة عن ابن مسعود أنه كان يقول ما ذكر من الآيات فقد مضى غير أربع طلوع الشمس من مغربها والدجال ودابة الأرض وخروج يأجوج ومأجوج. قال وكان يقول الآية التي تختم بها الأعمال طلوع الشمس من مغربها ألم تر أن الله يقول \"يوم يأتي بعض آيات ربك\" الآية كلها يعني طلوع الشمس من مغربها. حديث ابن عباس رضي الله عنهما رواه الحافظ أبو بكر بن مردوية في تفسيره من حديث عبد المنعم بن إدريس عن أبيه عن وهب بن منبه عن ابن عباس مرفوعا فذكر حديثا طويلا غريبا منكرا رفعه وفيه أن الشمس والقمر يطلعان يومئذ من المغرب مقرونين وإذا انتصفا السماء رجعا ثم عادا إلى ما كانا عليه. وهو حديث غريب جدا بل منكر بل موضوع إن ادعي أنه مرفوع فأما وقفه على ابن عباس أو وهب بن منبه وهو الأشبه فغير مرفوع والله أعلم وقال سفيان عن منصور عن عامر عن عائشة رضي الله عنها قالت: إذا خرج أول الآيات طرحت وحبست الحفظة وشهدت الأجساد على الأعمال رواه ابن جرير رحمه الله تعالى فقوله تعالى \"لا ينفع نفسا إيمانها لم تكن آمنت من قبل\" أي إذا أنشأ الكافر إيمانا يومئذ لا يقبل منه فأما من كان مؤمنا قبل ذلك فإن كان مصلحا في عمله فهو بخير عظيم وإن لم يكن مصلحا فأحدث توبة حينئذ لم تقبل منه توبته كما دلت عليه الأحاديث المتقدمة وعليه يحمل قوله تعالى \"أو كسبت في إيمانها خيرا\" أي ولا يقبل منها كسب عمل صالح إذا لم يكن عاملا به قبل ذلك وقوله تعالى \"قل انتظروا إنا منتظرون\" تهديد شديد للكافرين ووعيد أكيد لمن سوف بإيمانه وتوبته إلى وقت لا ينفعه ذلك وإنما كان هذا الحكم عند طلوع الشمس من مغربها لاقتراب الساعة وظهور أشراطها كما قال \"فهل ينظرون إلا الساعة أن تأتيهم بغتة فقد جاء أشراطها فأنى لهم إذا جاءتهم ذكراهم\" وقوله تعالى \"فلما رأوا بأسنا قالوا آمنا بالله وحده وكفرنا بما كنا به مشركين فلم يك ينفعهم إيمانهم لما رأوا بأسنا\" الآية."
    },
    {
      "ayah": 159,
      "surah": 6,
      "text": "قال مجاهد وقتادة والضحاك والسدي نزلت هذه الآية في اليهود والنصارى وقال العوفي عن ابن عباس قوله \"إن الذين فرقوا دينهم وكانوا شيعا\" وذلك أن اليهود والنصارى اختلفوا قبل مبعث محمد صلى الله عليه وسلم فتفرقوا فلما بعث محمد صلى الله عليه وسلم أنزل الله عليه \"إن الذين فرقوا دينهم وكانوا شيعا لست منهم في شيء\" الآية وقال ابن جرير حدثني سعيد بن عمر السكوني حدثنا بقية بن الوليد كتب إلى عباد بن كثير حدثني ليث عن طاوس عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم في هذه الآية \"إن الذين فرقوا دينهم وكانوا شيعا لست منهم في شيء\" وليسوا منك هم أهل البدع وأهل الشبهات وأهل الضلالة من هذه الأمة.لكن هذا إسناد لا يصح فإن عباد بن كثير متروك الحديث ولم يختلق هذا الحديث ولكنه وهم في رفعه فإنه رواه سفيان الثوري عن ليث وهو ابن أبي سليم عن طاوس عن أبي هريرة في الآية أنه قال نزلت في هذه الأمة وقال أبو غالب عن أبي أمامة في قوله \"وكانوا شيعا\" قال هم الخوارج وروى عنه مرفوعا ولا يصح وقال شعبة عن مجالد عن الشعبي عن شريح عن عمر رضي الله عنه أن رسول الله صلى الله عليه وسلم قال لعائشة رضي الله عنها \"إن الذين فرقوا دينهم وكانوا شيعا\" قال: هم أصحاب البدع.وهذا رواه ابن مردوية وهو غريب أيضا ولا يصح رفعه والظاهر أن الآية عامة في كل من فارق دين الله وكان مخالفا له فإن الله بعث رسوله بالهدى ودين الحق ليظهره على الدين كله وشرعه واحد لا اختلاف فيه ولا افتراق فمن اختلف فيه وكانوا شيعا أي فرقا كأهل الملل والنحل والأهواء والضلالات فإن الله تعالى قد برأ رسول الله صلى الله عليه وسلم مما هم فيه وهذه الآية كقوله تعالى \"شرع لكم من الدين ما وصى به نوحا والذي أوحينا إليك\" الآية. وفي الحديث نحن معاشر الأنبياء أولاد علات ديننا واحد فهذا هو الصراط المستقيم وهو ما جاءت به الرسل من عبادة الله وحده لا شريك له والتسمك بشريعة الرسول المتأخر وما خالف ذلك فضلالات وجهالات وآراء وأهواء والرسل برءاء منها كما قال الله تعالى \"لست منهم في شيء\" وقوله تعالى \"إنما أمرهم إلى الله ثم ينبئهم بما كانوا يفعلون\" كقوله تعالى \"إن الذين آمنوا والذين هادوا والصابئين والنصارى والمجوس والذين أشركوا إن الله يفصل بينهم يوم القيامة\" الآية. ثم بين لطفه سبحانه في حكمه وعدله يوم القيامة فقال تعالى."
    },
    {
      "ayah": 16,
      "surah": 6,
      "text": "\"من يصرف عنه\" أي العذاب \"يومئذ فقد رحمه\" يعني فقد رحمه الله \"وذلك هو الفوز المبين\" كقوله \"فمن زحزح عن النار وأدخل الجنة فقد فاز\" والفوز حصول الربح ونفي الخسارة."
    },
    {
      "ayah": 160,
      "surah": 6,
      "text": "وهذه الآية الكريمة مفصلة لما أجمل في الآية الأخرى وهي قوله \"من جاء بالحسنة فله خير منها\" وقد وردت الأحاديث مطابقة لهذه الآية كما قال الإمام أحمد بن حنبل رحمه الله حدثنا عفان حدثنا جعفر بن سليمان حدثنا الجعد أبو عثمان عن أبي رجاء العطاردي عن ابن عباس رضي الله عنهما أن رسول الله صلى الله عليه وسلم قال فيما يروي عن ربه تبارك وتعالى إن ربكم عز وجل رحيم من هم بحسنة فلم يعملها كتبت له حسنة فإن عملها كتبت له عشرا إلى سبعمائة إلى أضعاف كثيرة. ومن هم بسيئة فلم يعملها كتبت له حسنة فإن عملها كتبت له واحدة أو يمحوها الله عز وجل ولا يهلك على الله إلا هالك.ورواه البخاري ومسلم والنسائي من حديث الجعد أبي عثمان به. وقال أحمد أيضا حدثنا أبو معاوية حدثنا الأعمش عن المعرور بن سويد عن أبي ذر رضي الله عنه قال: قال رسول الله صلى الله عليه وآله وسلم يقول الله عز وجل من عمل حسنة فله عشر أمثالها وأزيد ومن عمل سيئة فجزاؤها مثلها أو أغفر ومن عمل قراب الأرض خطيئة ثم لقيني لا يشرك بي شيئا جعلت له مثلها مغفرة ومن اقترب إلي شبرا اقتربت إليه ذراعا ومن اقترب إلي ذراعا اقتربت إليه باعا ومن أتاني يمشي أتيته هرولة ورواه مسلم عن أبي كريب عن أبي معاوية وعن أبي بكر بن أبي شيبة عن وكيع عن الأعمش به ورواه ابن ماجه عن علي بن محمد الطنافسي عن وكيع به. وقال الحافظ أبو يعلى الموصلي حدثنا شيبان حدثنا حماد حدثنا ثابت عن أنس بن مالك رضي الله عنه أن رسول الله صلى الله عليه وسلم قال من هم بحسنة فلم يعملها كتبت له حسنة فان عملها كتبت له عشرا ومن هم بسيئة فلم يعملها لم يكتب عليه شيء فإن عملها كتبت عليه سيئة واحدة واعلم أن تارك السيئة الذي لا يعملها على ثلاثة أقسام تارة يتركها لله فهذا تكتب له حسنة على كفه عنها لله تعالى وهذا عمل ونية ولهذا جاء أنه يكتب له حسنة كما جاء في بعض ألفاظ الصحيح فإنما تركها من جرائي أي من أجلي وتارة يتركها نسيانا وذهولا عنها فهذا لا له ولا عليه لأنه لم ينو خيرا ولا فعل شرا وتارة يتركها عجزا وكسلا عنها بعد السعي في أسبابها والتلبس بما يقرب منها فهذا بمنزلة فاعلها كما جاء في الحديث الصحيح عن النبي صلى الله عليه وسلم أنه قال إذا التقى المسلمان بسيفيهما فالقاتل والمقتول في النار قالوا يا رسول الله هذا القاتل فما بال المقتول ؟ قال إنه كان حريصا على قتل صاحبه.وقال الإمام أبو يعلى الموصلي حدثنا مجاهد بن موسى حدثنا علي وحدثنا الحسن بن الصباح وأبو خيثمة قالا حدثنا إسحاق بن سليمان كلاهما عن موسى بن عبيدة عن أبي بكر بن عبيد الله بن أنس عن جده أنس. قال: قال رسول الله صلى الله عليه وسلم من هم بحسنة كتب الله له حسنة فإن عملها كتبت له عشرا ومن هم بسيئة لم تكتب عليه حتى يعملها فإن عملها كتبت عليه سيئة فإن تركها كتبت له حسنة يقول الله تعالى إنما تركها من مخافتي هذا لفظ حديث مجاهد يعني ابن موسى وقال الإمام أحمد حدثنا عبد الرحمن بن مهدي حدثنا شيبان بن عبد الرحمن عن الركين بن الربيع عن أبيه عن عمه فلان بن عميلة عن خريم بن فاتك الأسدي أن النبي صلى الله عليه وسلم قال إن الناس أربعة والأعمال ستة فالناس موسع له في الدنيا والآخرة وموسع له في الدنيا مقتور عليه في الأخرة ومقتور عليه في الدنيا موسع له في الآخرة وشقي في الدنيا والآخرة والأعمال موجبتان ومثل بمثل وعشرة أضعاف وسبعمائة ضعف فالموجبتان من مات مسلما مؤمنا لا يشرك بالله شيئا وجبت له الجنة ومن مات كافرا وجبت له النار ومن هم بحسنة فلم يعملها فعلم الله أنه قد أشعرها قلبه وحرص عليها كتبت له حسنة ومن هم بسيئة لم تكتب عليه ومن عملها كتبت واحدة ولم تضاعف عليه ومن عمل حسنة كانت عليه بعشر أمثالها ومن أنفق نفقة فى سبيل الله عز وجل كانت بسبعمائة ضعف.ورواه الترمذي والنسائي من حديث الركين بن الربيع عن أبيه عن بشير بن عميلة عن خريم بن فاتك به ببعضه والله أعلم وقال ابن أبي حاتم حدثنا أبو زرعة حدثنا عبيد الله بن عمر القواريري حدثنا يزيد بن زريع حدثنا حبيب بن المعلم عن عمرو بن شعيب عن أبيه عن جده عن النبي صلى الله عليه وسلم قال يحضر الجمعة ثلاثة نفر رجل حضرها بلغو فهو حظه منها ورجل حضرها بدعاء فهو رجل دعا الله فإن شاء أعطاه وإن شاء منعه ورجل حضرها بإنصات وسكون ولم يتخط رقبة مسلم ولم يؤذ أحدا فهي كفارة له إلى الجمعة التي تليها وزيادة ثلاثة أيام وذلك لأن الله عز وجل يقول \"من جاء بالحسنة فله عشر أمثالها\" وقال الحافظ أبو القاسم الطبراني حدثنا هاشم بن مرثد حدثنا محمد بن إسماعيل حدثني أبي حدثني ضمضم بن زرعة عن شريح بن عبيد عن أبي مالك الأشعري قال: قال رسول الله صلى الله عليه وسلم الجمعة كفارة لما بينها وبين الجمعة التي تليها وزيادة ثلاثة أيام. وذلك لأن الله تعالى قال \"من جاء بالحسنة فله عشر أمثالها\" وعن أبي ذر رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم من صام ثلاثة أيام من كل شهر فقد صام الدهر كله.رواه الإمام أحمد وهذا لفظه والنسائي وابن ماجه والترمذي وزاد: فأنزل الله تصديق ذلك فى كتابه \"من جاء بالحسنة فله عشر أمثالها\" اليوم بعشرة أيام.ثم قال هذا حديث حسن. وقال ابن مسعود \"من جاء بالحسنة فله عشر أمثالها\" من جاء بلا إله إلا الله ومن جاء بالسيئة يقول بالشرك. وهكذا جاء عن جماعة من السلف رضي الله عنهم أجمعين وقد ورد فيه حديث مرفوع الله أعلم بصحته لكني لم أروه من وجه يثبت والأحاديث و الآثار في هذا كثير جدا وفيما ذكر كفاية إن شاء الله وبه الثقة."
    },
    {
      "ayah": 161,
      "surah": 6,
      "text": "يقول تعالى آمرا نبيه صلى الله عليه وسلم سيد المرسلين أن يخبر بما أنعم به عليه من الهداية إلى صراطه المستقيم الذي لا اعوجاج فيه ولا انحراف \"دينا قيما\" أي قائما ثابتا \"ملة إبراهيم حنيفا وما كان من المشركين\" كقوله \"ومن يرغب عن ملة إبراهيم إلا من سفه نفسه\" وقوله \"وجاهدوا في الله حق جهاده هو اجتباكم وما جعل عليكم في الدين من حرج ملة أبيكم إبراهيم\" وقوله \"إن إبراهيم كان أمة قانتا لله حنيفا ولم يك من المشركين شاكرا لأنعمه اجتباه وهداه إلى صراط مستقيم وآتيناه في الدنيا حسنة وإنه في الآخرة لمن الصالحين ثم أوحينا إليك أن اتبع ملة إبراهيم حنيفا وما كان من المشركين\" وليس يلزم من كونه صلى الله عليه وسلم أمر باتباع ملة إبراهيم الحنيفية أن يكون إبراهيم أكمل منه فيها لأنه عليه السلام قام بها قياما عظيما وأكملت له إكمالا تاما لم يسبقه أحد إلى هذا الكمال ولهذا كان خاتم الأنبياء وسيد ولد آدم على الإطلاق وصاحب المقام المحمود الذي يرغب إليه الخلق حتى الخليل عليه السلام وقد قال ابن مردوية حدثنا محمد بن عبد الله بن حفص حدثنا أحمد بن عصام حدثنا أبو داود الطيالسي حدثنا شعبة أنبأنا سلمة بن كهيل سمعت ذر بن عبد الله الهمداني يحدث عن ابن أبزى عن أبيه قال كان رسول الله صلى الله عليه وسلم إذا أصبح قال أصبحنا على ملة الإسلام وكلمة الإخلاص ودين نبينا محمد وملة أبينا إبراهيم حنيفا وما كان من المشركين وقال الإمام أحمد حدثنا يزيد أخبرنا محمد بن إسحاق عن داود بن الحصين عن عكرمة عن ابن عباس رضي الله عنهما أنه قال: قيل لرسول الله صلى الله عليه وسلم أى الأديان أحب إلى الله تعالى ؟ قال الحنيفية السمحة وقال أحمد أيضا حدثنا سليمان بن داود حدثنا عبد الرحمن بن أبي الزناد عن هشام بن عروة عن أبيه عن عائشة رضي الله عنها قالت: وضع رسول الله صلى الله تعالى عليه وآله وسلم ذقني على منكبه لأنظر إلى زفن الحبشة حتى كنت التي مللت فانصرفت عنه. قال عبد الرحمن عن أبيه قال: قال لي عروة إن عائشة قالت: قال رسول الله صلى الله عليه وسلم يومئذ لتعلم يهود أن فى ديننا فسحة إني أرسلت بحنيفة سمحة أصل الحديث مخرج في الصحيحين والزيادة لها شواهد من طرق عدة وقد استقصيت طرقها في شرح البخاري ولله الحمد والمنة."
    },
    {
      "ayah": 162,
      "surah": 6,
      "text": "وقوله تعالى \"قل إن صلاتي ونسكي ومحياي ومماتي لله رب العالمين\" يأمره تعالى أن يخبر المشركين الذين يعبدون غير الله ويذبحون لغير اسمه أنه مخالف لهم في ذلك فإن صلاته لله ونسكه على اسمه وحده لا شريك له وهذا كقوله تعالى \"فصل لربك وانحر\" أي أخلص له صلاتك وذبحك فإن المشركين كانوا يعبدون الأصنام ويذبحون لها فأمره الله تعالى بمخالفتهم والانحراف عما هم فيه والإقبال بالقصد والنية والعزم على الإخلاص لله تعالى قال مجاهد في قوله \"إن صلاتي ونسكي\" النسك الذبح في الحج والعمرة. وقال الثوري عن السدي عن سعيد بن جبير \"ونسكي\" قال ذبحي. وكذا قال السدي والضحاك وقال ابن أبي حاتم حدثنا محمد بن عوف حدثنا أحمد بن خالد الذهبي حدثنا محمد بن إسحاق عن يزيد بن أبي حبيب عن ابن عباس عن جابر بن عبد الله قال:ضحى رسول الله صلى الله عليه وسلم في يوم عيد النحر بكبشين وقال حين ذبحهما وجهت وجهي للذي فطر السموات والأرض حنيفا وما أنا من المشركين."
    },
    {
      "ayah": 163,
      "surah": 6,
      "text": "إن صلاتي ونسكي ومحياي ومماتي لله رب العالمين لا شريك له وبذلك أمرت وأنا أول المسلمين وقوله عز وجل \"وأنا أول المسلمين\" قال قتادة أي من هذه الأمة وهو كما قال فإن جميع الأنبياء قبله كلهم كانت دعوتهم إلى الإسلام وأصله عبادة الله وحده لا شريك له كما قال \"وما أرسلنا من قبلك من رسول إلا نوحي إليه أنه لا إله إلا أنا فاعبدون\" وقد أخبرنا تعالى عن نوح أنه قال لقومه \"فإن توليتم فما سألتكم من أجر إن أجري إلا على الله وأمرت أن أكون من المسلمين\" وقال تعالى \"ومن يرغب عن ملة إبراهيم إلا من سفه نفسه ولقد اصطفيناه في الدنيا وإنه في الأخرة لمن الصالحين إذ قال له ربه أسلم قال أسلمت لرب العالمين ووصى بها إبراهيم بنيه ويعقوب يا بني إن الله اصطفى لكم الدين فلا تموتن إلا وأنتم مسلمون\" وقال يوسف عليه السلام \"رب قد آتيتني من الملك وعلمتني من تأويل الأحاديث فاطر السموات والأرض أنت وليي في الدنيا والآخرة توفني مسلما وألحقني بالصالحين\" وقال موسى \"يا قوم إن كنتم آمنتم بالله فعليه توكلوا إن كنتم مسلمين فقالوا على الله توكلنا ربنا لا تجعلنا فتنة للقوم الظالمين ونجنا برحمتك من القوم الكافرين\" وقال تعالى \"إنا أنزلنا التوراة فيها هدى ونور يحكم بها النبيون الذين أسلموا للذين هادوا والربانيون والأحبار\" الآية. وقال تعالى \"وإذا أوحيت إلى الحواريين أن آمنوا بي وبرسولي قالوا آمنا واشهد بأننا مسلمون\" فأخبر تعالى أنه بعث رسله بالإسلام ولكنهم متفاوتون فيه بحسب شرائعهم الخاصة التي ينسخ بعضها بعضا إلى أن نسخت بشريعة محمد صلى الله عليه وسلم التي لا تنسخ أبد الآبدين ولا تزال قائمة منصورة وأعلامها منشورة إلى قيام الساعة ولهذا قال عليه السلام نحن معاشر الأنبياء أولاد علات ديننا واحد فإن أولاد العلات هم الأخوة من أب واحد وأمهات شتى فالدين واحد وهو عبادة الله وحده لا شريك له وإن تنوعت الشرائع التي هي بمنزلة الأمهات كما أن إخوة الأخياف عكس هذا بنو الأم الواحدة من آباء شتى والأخوة الأعيان الأشقاء من أب واحد وأم واحدة والله أعلم وقد قال الإمام أحمد حدثنا أبو سعيد حدثنا عبد العزيز بن عبد الله الماجشون حدثنا عبد الله بن الفضل الهاشمي عن الأعواج عن عبيد الله بن أبي رافع عن علي رضي الله عنه أن رسول الله صلى الله عليه وسلم كان أذا كبر استفتح ثم قال وجهت وجهي للذي فطر السموات والأرض حنيفا وما أنا من المشركين إن صلاتي ونسكي ومحياي ومماتي الله رب العالمين ـ إلى آخر الآية ـ \"اللهم أنت الملك لا إله إلا أنت ربي وأنا عبدك ظلمت نفسي واعترفت بذنبي فاغفر لي ذنوبي جميعا لا يغفر الذنوب إلا أنت واهدني لأحسن الأخلاق ولا يهدي لأحسنها إلا أنت واصرف عني سيئها لايصرف عني سيئها إلا أنت. تباركت وتعاليت أستغفرك وأتوب إليك ثم ذكر تمام الحديث فيما يقوله في الركوع والسجود والتشهد وقد رواه مسلم في صحيحه."
    },
    {
      "ayah": 164,
      "surah": 6,
      "text": "يقول تعالى \"قل\" يا محمد لهؤلاء المشركين بالله في إخلاص العبادة له والتوكل عليه \"أغير الله أبغي ربا\" أي أطلب ربا سواه \"وهو رب كل شيء\" يربيني ويحفظني ويكلؤني ويدبر أمري أي لا أتوكل إلا عليه ولا أنيب إلا إليه لأنه رب كل شيء ومليكه وله الخلق والأمر ففي هذه الأية الأمر بإخلاص التوكيل تضمنت التي قبلها إخلاص العباده لله وحده لا شريك له وهذا المعنى يقرن بالآخر كثيرا في القرآن كقوله تعالي مرشدا لعبادة أن يقولوا له \"إياك نعبد وإياك نستعين\" وقوله \"فاعبده وتوكل عليه\" وقوله \"قل هو الرحمن آمنا به وعليه توكلنا\" وقوله \"رب المشرق والمغرب لا إله هو فاتخذه وكيلا\" وأشباه ذلك من الآيات وقوله تعالي \"ولا تكسب كل نفس إلا عليها ولا تزر وازرة وزر أخرى\" إخبار عن الواقع يوم القيامة في جزاء الله تعالي وحكمه وعدله أن النفوس إنما تجازى بأعمالها إن خيرا فخير وإن شرا فشر وأنه لايحمل من خطيئة أحد علي أحد وهذا من عدله تعالى كما قال \"وإن تدع مثقلة إلي حملها لا يحمل منه شيء ولو كان ذا قربي\" وقوله تعالي \"فلا يخاف ظلما ولا هضما\" قال علماء التفسير: أي فلا يظلم بأن يحمل عليه سيئات غيره ولا تهضم بأن ينقص من حسناته وقال تعالى \"كل نفس بما كسبت رهينه إلا أصحاب اليمين\" معناه كل نفس مرتهنة بعملها السيء إلا أصحاب اليمين فإنه قد يعود بركة أعمالهم الصالحة علي ذرياتهم وقراباتهم كما قال في سورة الطور \"والذين آمنوا واتبعتهم ذريتهم بإيمان ألحقنا بهم ذريتهم وما ألتناهم من عملهم من شيء\" أي ألحقنا بهم ذريتهم في المنزلة الرفيعة في الجنة وإن لم يكونوا قد شاركوهم في الأعمال بل في أصل الإيمان وما ألتناهم أي أنقصنا أولئك السادة الرفعاء من أعمالهم شيئا حتى ساويناهم وهؤلاء الذين هم أنقص منهم منزلة بل رفعهم تعالي إلي منزلة الآباء ببركة أعمالهم بفضله ومنته ثم قال \"كل امرئ بما كسبت رهين\" أي من شر وقوله \"ثم إلى ربكم مرجعكم فينبئكم بما كنتم فيه تختلفون\" أي اعملوا علي مكانتكم إنا عاملون علي ما نحن عليه فستعرضون ونعرض عليه وينبئنا وإياكم بأعمالنا وأعمالكم وما كنا نختلف فيه الدار الدنيا كقوله \"قل لاتسألون عما أجرمنا ولا نسأل عما تعملون قل يجمع بيننا ربنا ثم يفتح بيننا بالحق وهو الفتاح العليم\"."
    },
    {
      "ayah": 165,
      "surah": 6,
      "text": "يقول تعالي \"وهو الذي جعلكم خلائف الأرض\" أي جعلكم تعمرونها جيلا بعد جيل وقرنا بعد قرن وخلفا بعد سلف. قاله ابن زيد وغيره كقوله تعالى \"ولو نشاء لجعلنا منكم ملائكة في الأرض يخلفون\" وقوله تعالى \"ويجعلكم خلفاء الأرض\" وقوله \"إني جاعل في الأرض خليفة\" وقوله \"عسى ربكم أن يهلك عدوكم ويستخلفكم في الأرض فينظر كيف تعملون\" وقوله \"ورفع بعضكم فوق بعض درجات\" أي فاوت بينكم في الأرزاق والأخلاق والمحاسن والمساوي والمناظر والأشكال والألوان وله الحكمة في ذلك كقوله تعالى \"نحن قسمنا بينهم معيشتهم في الحياة الدنيا ورفعنا بعضهم فوق بعض درجات ليتخذ بعضهم بعضا سخريا\" وقوله \"انظر كيف فضلنا بعضهم على بعض وللآخرة أكبر درجات وأكبر تفضيلا\" وقوله تعالى \"ليبلوكم فيما آتاكم\" أي ليختبركم في الذي أنعم به عليكم وامتحنكم به ليختبر الغني في غناه ويسأله عن شكره والفقير في فقره ويسأله عن صبره وفي صحيح مسلم من حديث أبي نضرة عن أبي سعيد الخدري رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم إن الدنيا حلوة خضرة وإن الله مستخلفكم فيها فناظر ماذا تعملون فاتقوا الدنيا واتقوا النساء فان أول فتنة بني إسرائيل كانت في النساء وقوله تعالى \"إن ربك سريع العقاب وإنه لغفور رحيم\" ترهيب وترغيب أن حسابه وعقابه سريع فيمن عصاه وخالف رسله \"وإنه لغفور رحيم\" لمن والاه واتبع رسله فيما جاءوا به من خبر وطلب. وقال محمد بن إسحاق ليرحم العباد على ما فيهم.رواه ابن أبي حاتم وكثيرا ما يقرن الله تعالى في القرآن بين هاتين الصفتين كقوله \"وإن ربك لذو مغفرة للناس على ظلمهم و إن ربك لشديد العقاب\" وقوله \"نبئ عبادي أني أنا الغفور الرحيم وأن عذابي هو العذاب الأليم\" إلى غير ذلك من الآيات المشتملة على الترغيب والترهيب فتارة يدعو عباده إليه بالرغبة وصفة الجنة والترغيب فيما لديه وتارة يدعوهم إليه بالرهبة وذكر النار وأنكالها وعذابها والقيامة وأهوالها وتارة بهما لينجع في كل بحسبه جعلنا الله ممن أطاعه فيما أمر وترك ما عنه نهى وزجر وصدقه فيما أخبر إنه قريب مجيب سميع الدعاء جواد كريم وهاب. وقد قال الإمام أحمد حدثنا عبد الرحمن حدثنا زهير عن العلاء عن أبيه عن أبي هريرة مرفوعا أن رسول الله صلى الله عليه وسلم قال لو يعلم المؤمن ما عند الله من العقوبة ما طمع بجنته أحد ولو يعلم الكافر ما عند الله من الرحمة ما قنط أحد من الجنة خلق الله مائة رحمة فوضع واحدة بين خلقه يتراحمون بها وعند الله تسعة وتسعون ورواه الترمذي عن قتيبة عن عبد العزيز الدراوردي عن العلاء به. وقال حسن ورواه مسلم عن يحيي بن يحيى وقتيبة وعلي بن حجر ثلاثتهم عن إسماعيل بن جعفر عن العلاء وعنه أيضا قال: قال رسول الله صلى الله عليه وسلم لما خلق الله الخلق كتب في كتاب فهو عنده فوق العرش إن رحمتي تغلب غضبي وعنه أيضا قال سمعت رسول الله صلى الله عليه وسلم يقول جعل الله الرحمة مائة جزء فأمسك عنده تسعة وتسعين جزءا وأنزل في الأرض جزءا واحدا فمن ذلك الجزء تتراحم الخلائق حتى ترفع الدابة حافرها عن ولدها خشية من أن تصيبه.رواه مسلم. آخر تفسير سورة الأنعام ولله الحمد والمنة."
    },
    {
      "ayah": 17,
      "surah": 6,
      "text": "يقول تعالى مخبرا أنه مالك الضر والنفع وأنه المتصرف في خلقه بما يشاء لا معقب لحكمه ولا راد لقضائه \"وإن يمسسك الله بضر فلا كاشف له إلا هو وإن يمسسك بخير فهو على كل شيء قدير\" كقوله تعالى \"ما يفتح الله للناس من رحمة فلا ممسك لها وما يمسك فلا مرسل له من بعده\" وفي الصحيح أن رسول الله صلى الله عليه وسلم كان يقول \" لا مانع لما أعطيت ولا معطي لما منعت ولا ينفع ذا الجد منك الجد\"."
    },
    {
      "ayah": 18,
      "surah": 6,
      "text": "ولهذا قال تعالى \"وهو القاهر فوق عباده\" أي هو الذي خضعت له الرقاب وذلت له الجبابرة وعنت له الوجوه وقهر كل شيء ودانت له الخلائق وتواضعت لعظمة جلاله وكبريائه وعظمته وعلوه وقدرته على الأشياء واستكانت وتضاءلت بين يديه وتحت قهره وحكمه \"وهو الحكيم\"أي في جميع أفعاله \"الخبير\" بمواضع الأشياء ومحالها فلا يعطي إلا من يستحق ولا يمنع إلا من يستحق."
    },
    {
      "ayah": 19,
      "surah": 6,
      "text": "ثم قال \"قل أي شيء أكبر شهادة\" أي من أعظم الأشياء شهادة \"قل الله شهيد بيني وبينكم\" أي هو العالم بما جئتكم به وما أنتم قائلون لي \"وأوحي إلي هذا القرآن لأنذركم به ومن بلغ\" أي هو نذير لكل من بلغه كقوله تعالى \"ومن يكفر به من الأحزاب فالنار موعده\" قال ابن أبي حاتم: حدثنا أبو سعيد الأشج حدثنا وكيع وأبو أسامة وأبو خالد عن موسى بن عبيدة عن محمد بن كعب في قوله \"ومن بلغ\" من بلغه القرآن فكأنما رأى النبي صلى الله عليه وسلم زاد أبو خالد وكلمه. ورواه ابن جرير من طريق أبي معشر عن محمد بن كعب قال: من بلغه القرآن فقد أبلغه محمد صلى الله عليه وسلم وقال عبدالرزاق عن معمر عن قتادة في قوله تعالى \"لأنذركم به ومن بلغ\" أن رسول الله صلى الله عليه وسلم قال \"بلغوا عن الله فمن بلغته آية من كتاب الله فقد بلغه أمر الله\" وقال الربيع بن أنس حق على من اتبع رسول الله صلى الله عليه وسلم أن يدعو كالذي دعا رسول الله صلى الله عليه وسلم وأن ينذر بالذي أنذر وقوله \"أئنكم لتشهدون\" أيها المشركون أي \"أن مع الله آلهة أخرى قل لا أشهد\" كقوله \"فإن شهدوا فلا تشهد معهم\" \"قل إنما هو إله واحد وإنني بريء مما تشركون\"."
    },
    {
      "ayah": 2,
      "surah": 6,
      "text": "وقوله تعالى \"هو الذي خلقكم من طين\"يعني أباهم آدم الذي هو أصلهم ومنه خرجوا فانتشروا في المشارق والمغارب وقوله \"ثم قضى أجلا وأجل مسمى عنده\" قال سعيد بن جبير عن ابن عباس \"ثم قضى أجلا\" يعني الموت \"وأجل مسمى عنده\" يعني الآخرة وهكذا روي عن مجاهد وعكرمة وسعيد بن جبير والحسن وقتادة والضحاك وزيد بن أسلم وعطية والسدي ومقاتل بن حيان وغيرهم وقول الحسن في رواية عنه \"ثم قضى أجلا\" وهو ما بين أن يخلق إلى أن يموت \"وأجل مسمى عنده\" وهو ما بين أن يموت إلى أن يبعث هو يرجع إلى ما تقدم وهو تقدير الأجل الخاص وهو عمر كل إنسان وتقدير الأجل العام وهو عمر الدنيا بكمالها ثم انتهائها وانقضائها وزوالها وانتقالها والمصير إلى الدار الآخرة وعن ابن عباس ومجاهد \"ثم قضى أجلا\" يعني مدة الدنيا \"وأجل مسمى عنده\" يعني عمر الإنسان إلى حين موته وكأنه مأخوذ من قوله تعالى بعد هذا \"وهو الذي يتوفاكم بالليل ويعلم ما جرحتم بالنهار\" الآية وقال عطية عن ابن عباس \"ثم قضى أجلا\" يعني النوم يقبض فيه الروح ثم يرجع إلى صاحبه عند اليقظة \"وأجل مسمى عنده\" يعني أجل موت الإنسان وهذا قول غريب ومعني قوله \"عنده\" أي لا يعلمه إلا هو كقوله \"إنما علمها عند ربي لا يجليها لوقتها إلا هو\" وكقوله \"يسألونك عن الساعة أيان مرساها فيم أنت من ذكراها إلى ربك منتهاها\" وقوله تعالى \"ثم أنتم تمترون\" قال السدي وغيره: يعني تشكون في أمر الساعة."
    },
    {
      "ayah": 20,
      "surah": 6,
      "text": "ثم قال تعالى مخبرا عن أهل الكتاب أنهم يعرفون هذا الذي جئتهم به كما يعرفون أبناءهم بما عندهم من الأخبار والأنباء عن المرسلين المتقدمين والأنبياء فإن الرسل كلهم بشروا بوجود محمد صلى الله عليه وسلم ونعته وصفتة وبلده ومهاجره وصفة أمته ولهذا قال بعده \"الذين خسروا أنفسهم\" أي خسروا كل الخسارة \"فهم لا يؤمنون\" بهذا الأمر الجلي الظاهر الذي بشرت به الأنبياء ونوهت به في قديم الزمان وحديثه."
    },
    {
      "ayah": 21,
      "surah": 6,
      "text": "ثم قال \"ومن أظلم ممن افترى على الله كذبا أو كذب بآياته\" أي لا أظلم ممن تقول على الله فادعى أن الله أرسله ولم يكن أرسله ثم لا أظلم ممن كذب بآيات الله وحججه وبراهينه ودلالاته \"إنه لا يفلح الظالمون\" أي لا يفلح هذا ولا هذا لا المفتري ولا المكذب."
    },
    {
      "ayah": 22,
      "surah": 6,
      "text": "يقول تعالى مخبرا عن المشركين \"يوم نحشرهم جميعا\" يوم القيامة فيسألهم عن الأصنام والأنداد التي كانوا يعبدونها قائلا لم \"أين شركاؤكم الذين كنتم تزعمون\" كقوله تعالى في سورة القصص \"ويوم يناديهم فيقول أين شركائي الذين كنتم تزعمون\"."
    },
    {
      "ayah": 23,
      "surah": 6,
      "text": "وقوله تعالى \"ثم لم تكن فتنتهم\" أي حجتهم إلا أن قالوا \"والله ربنا ما كنا مشركين\" قال الضحاك عن ابن عباس \"ثم لم تكن فتنتهم\" أي حجتهم. وقال عطاء الخراساني عنه أي معذرتهم. وكذا قال قتادة وقال ابن جريج عن ابن عباس أي قيلهم وكذا قال الضحاك وقال عطاء الخراساني \"ثم لم تكن فتنتهم\" بليتهم حين ابتلوا \" إلا أن قالوا والله ربنا ما كنا مشركين\" وقال ابن جرير: والصواب ثم لم يكن قيلهم عند فتنتنا إياهم اعتذارا عما سلف منهم الشرك بالله \"إلا أن قالوا والله ربنا ما كنا مشركين\" وقال ابن أبي حاتم: حدثنا أبو سعيد الأشج حدثنا أبو يحيى الرازي عن عمرو بن أبي قيس عن مطرف عن المنهال عن سعيد بن جبير عن ابن عباس قال: أتاه رجل فقال يا ابن عباس سمعت الله يقول \"والله ربنا ما كنا مشركين\" قال: أما قوله \"والله ربنا ما كنا مشركين\" فإنهم رأوا أنه لا يدخل الجنة إلا أهل الصلاة فقالوا تعالوا فلنجحد فيجحدون فيختم الله على أفواههم وتشهد أيديهم وأرجلهم ولا يكتمون الله حديثا فهل في قلبك الآن شيء؟ إنه ليس من القرآن شيء إلا ونزل فيه شيء ولكن لا تعلمون وجهه. وقال الضحاك عن ابن عباس: هذه في المنافقين وفيه نظر فإن هذه الآية مكية والمنافقون إنما كانوا بالمدينة والتي نزلت في المنافقين آية المجادلة \"يوم يبعثهم الله جميعا فيحلفون له\"الآية."
    },
    {
      "ayah": 24,
      "surah": 6,
      "text": "وكذا قال في حق هؤلاء \"انظر كيف كذبوا على أنفسهم وضل عنهم ما كانوا يفترون\" كقوله \"ثم قيل لهم أين ما كنتم تشركون من دون الله قالوا ضلوا عنا\" الآية."
    },
    {
      "ayah": 25,
      "surah": 6,
      "text": "وقوله \"ومنهم من يستمع إليك وجعلنا على قلوبهم أكنة أن يفقهوه وفي آذانهم وقرا وإن يروا كل آية لا يؤمنوا بها\" أي يجيئون ليستمعوا قراءتك ولا تجزي عنهم شيئا لأن الله \"جعل على قلوبهم أكنة\" أي أغطية لئلا يفقهوا القرآن \"وفي آذانهم وقرا\" أي صما عن السماع النافع لهم كما قال تعالى ومثل الذين كفروا كمثل الذي ينعق بما لا يسمع إلا دعاء ونداء الآية. وقوله \"وإن يروا كل آية لا يؤمنوا بها\" أي مهما رأوا من الآيات والدلالات والحجج البينات والبراهين لا يؤمنوا بها فلا فهم عندهم ولا إنصاف كقوله تعالى \"ولو علم الله فيهم خيرا لأسمعهم\" الآية وقوله تعالى \"حتى إذا جاءوك يجادلونك\" أي يحاجونك ويناظرونك في الحق بالباطل \"يقول الذين كفروا إن هذا إلا أساطير الأولين\" أي ما هذا الذي جئت به إلا مأخوذ من كتب الأوائل ومنقول عنهم."
    },
    {
      "ayah": 26,
      "surah": 6,
      "text": "وقوله \"وهم ينهون عنه وينأون عنه\" في معنى ينهون عنه قولان \"أحدهما\" أن المراد أنهم ينهون الناس عن اتباع الحق وتصديق الرسول والانقياد للقرآن \"وينأون عنه\" أي ويبعدونهم عنه فيجمعون بين الفعلين القبيحين لا ينتفعون ولا يدعون أحدا ينتفع قال علي بن أبي طلحة عن ابن عباس \"وهم ينهون عنه\" يردون الناس عن محمد صلى الله عليه وسلم أن يؤمنوا به. وقال محمد بن الحنفية: كان كفار قريش لا يأتون النبي صلى الله عليه وسلم وينهون عنه وكذا قال قتادة ومجاهد والضحاك وغير واحد وهذا القول أظهر والله أعلم وهو اختيار ابن جرير. \"والقول الثاني\" رواه سفيان الثوري عن حبيب بن أبي ثابت عمن سمع ابن عباس يقول في قوله \"وهم ينهون عنه\" قال: نزلت في أبي طالب كان ينهى الناس عن النبي صلى الله عليه وسلم أن يؤذى. وكذا قال القاسم بن مخيمرة وحبيب بن أبي ثابت وعطاء بن دينار وغيره أنها نزلت في أبي طالب. وقال سعيد بن أبي هلال: نزلت في عمومة النبي صلى الله عليه وسلم وكانوا عشرة فكانوا أشد الناس معه في العلانية وأشد الناس عليه في السر رواه ابن أبي حاتم وقال محمد بن كعب القرظي \"وهم ينهون\" عنه أي ينهون الناس عن قتله وقوله \"وينأون عنه\" أي يتباعدون منه \"وإن يهلكون إلا أنفسهم وما يشعرون\" أي وما يهلكون بهذا الصنيع ولا يعود وباله إلا عليهم وهم لا يشعرون."
    },
    {
      "ayah": 27,
      "surah": 6,
      "text": "يذكر تعالى حال الكفار إذا وقفوا يوم القيامة على النار وشاهدوا ما فيها من السلاسل والأغلال ورأوا بأعينهم تلك الأمور العظام والأهوال فعند ذلك قالوا \"يا ليتنا نرد ولا نكذب بآيات ربنا ونكون من المؤمنين\" يتمنون أن يردوا إلى الدار الدنيا ليعملوا عملا صالحا ولا يكذبوا بآيات ربهم ويكونوا من المؤمنين."
    },
    {
      "ayah": 28,
      "surah": 6,
      "text": "قال الله تعالى \"بل بدا لهم ما كانوا يخفون من قبل\" أي بل ظهر لهم حينئذ ما كانوا يخفون في أنفسهم من الكفر والتكذيب والمعاندة وإن أنكروها في الدنيا أو في الآخرة كما قال قبله بيسير \"ثم لم تكن فتنتهم إلا أن قالوا والله ربنا ما كنا مشركين انظر كيف كذبوا على أنفسهم\" ويحتمل أنهم ظهر لهم ما كانوا يعلمونه من أنفسهم من صدق ما جاءتهم به الرسل في الدنيا وإن كانوا يظهرون لأتباعهم خلافه كقوله مخبرا عن موسى أنه قال لفرعون \"لقد علمت ما أنزل هؤلاء إلا رب السموات والأرض بصائر\" الآية وقوله تعالى مخبرا عن فرعون وقومه \"وجحدوا بها واستيقنتها أنفسهم ظلما وعلوا\" ويحتمل أن يكون المراد بهؤلاء المنافقين الذين كانوا يظهرون الإيمان للناس ويبطنون الكفر ويكون هذا إخبارا عما يكون يوم القيامة من كلام طائفة من الكفار ولا ينافي هذا كون هذه السورة مكية والنفاق إنما كان من بعض أهل المدينة ومن حولها من الأعراب فقد ذكر الله وقوع النفاق في سورة مكية وهي العنكبوت فقال \"وليعلمن الله الذين آمنوا وليعلمن المنافقين\" وعلى هذا فيكون إخبارا عن قول المنافقين في الدار الآخرة حين يعاينون العذاب فظهر لهم حينئذ غب ما كانوا يبطنون من الكفر والنفاق والشقاق والله أعلم وأما معنى الإضراب في قوله \"بل بدا لهم ما كانوا يخفون من قبل\" فإنهم ما طلبوا العود إلى الدنيا رغبة ومحبة في الإيمان بل خوفا من العذاب الذي عاينوه جزاء ما كانوا عليه من الكفر فسألوا الرجعة إلى الدنيا ليتخلصوا مما شاهدوا من النار ولهذا قال \"ولو ردوا لعادوا لما نهوا عنه وإنهم لكاذبون\" أي في طلبهم الرجعة رغبة ومحبة في الإيمان ثم قال مخبرا عنهم أنهم لو ردوا إلى الدار الدنيا لعادوا لما نهوا عنه من الكفر والمخالفة \"وإنهم لكاذبون\" إي في قولهم يا ليتنا نرد ولا نكذب بآيات ربنا ونكون من المؤمنين."
    },
    {
      "ayah": 29,
      "surah": 6,
      "text": "ثم قال مخبرا عنهم أنهم لو ردوا إلى الدار الدنيا لعادوا لما نهوا عنه من الكفر والمخالفة \"وإنهم لكاذبون\" إي في قولهم يا ليتنا نرد ولا نكذب بآيات ربنا ونكون من المؤمنين أي لعادوا لما نهوا عنه ولقالوا إن هي إلا حياتنا الدنيا أي ما هي إلا هذه الحياة الدنيا لا معاد بعدها ولهذا قال \"وما نحن بمبعوثين\"."
    },
    {
      "ayah": 3,
      "surah": 6,
      "text": "وقوله تعالى \"وهو الله في السموات وفي الأرض يعلم سركم وجهركم\" اختلف مفسرو هذه الآية على أقوال بعد اتفاقهم على إنكار قول الجهمية الأول القائلين تعالى عن قولهم علوا كبيرا بأنه في كل مكان حيث حملوا الآية على ذلك فالأصح من الأقوال أنه المدعو الله في السموات وفى الأرض أي يعبده ويوحده ويقر له بالإلهية من في السموات ومن في الأرض ويسمونه الله ويدعونه رغبا ورهبا إلا من كفر من الجن والإنس وهذه الآية على هذا القول كقوله تعالى \"وهو الذي في السماء إله وفي الأرض إله\" أي هو إله من في السماء وإله من في الأرض وعلى هذا فيكون قوله \"يعلم سركم وجهركم\" خبرا أو حالا. \"والقول الثاني\" أن المراد أنه الله الذي يعلم ما في السموات وما في الأرض من سر وجهر فيكون قوله يعلم متعلقا بقوله \"في السموات وفي الأرض\" تقديره وهو الله يعلم سركم وجهركم في السموات وفي الأرض ويعلم ما تكسبون والقول الثالث أن قوله \"وهو الله في السموات\" وقف تام ثم استأنف الخبر فقال \"وفي الأرض يعلم سركم وجهركم\" وهذا اختيار ابن جرير وقوله \"ويعلم ما تكسبون\" أي جميع أعمالكم خيرها وشرها."
    },
    {
      "ayah": 30,
      "surah": 6,
      "text": "ثم قال \"ولو ترى إذ وقفوا على ربهم\" أي أوقفوا بين يديه قال \"أليس هذا بالحق\" أي أليس هذا المعاد بحق وليس بباطل كما كنتم تظنون \"قالوا بلى وربنا قال فذوقوا العذاب بما كنتم تكفرون\" أي بما كنتم تكذبون به فذوقوا اليوم مسه \"أفسحر هذا أم أنتم لا تبصرون\"."
    },
    {
      "ayah": 31,
      "surah": 6,
      "text": "يقول تعالى مخبرا عن خسارة من كذب بلقائه وعن خيبته إذا جاءته الساعة بغتة وعن ندامته على ما فرط من العمل وما أسلف من قبح الفعل ولهذا قال \"حتى إذا جاءتهم الساعة بغتة قالوا يا حسرتنا على ما فرطنا فيها\" وهذا الضمير يحتمل عوده على الحياة وعلى الأعمال وعلى الدار الآخرة أي في أمرها وقوله \"وهم يحملون أوزارهم على ظهورهم ألا ساء ما يزرون\" أي يحملون وقال قتادة يعملون وقال ابن أبي حاتم: حدثنا أبو سعيد الأشج حدثنا أبو خالد الأحمر عن عمرو بن قيس عن أبي مرزوق قال: يستقبل الكافر أو الفاجر عند خروجه من قبره كأقبح صورة رأيتها وأنتنه ريحا فيقول من أنت فيقول أو ما تعرفني فيقول لا والله إلا إن الله قبح وجهك وأنتن ريحك فيقول أنا عملك الخبيث هكذا كنت في الدنيا خبيث العمل منتنه فطالما ركبتني في الدنيا هلم أركبك فهو قوله \"وهم يحملون أوزارهم على ظهورهم\" الآية وقال أسباط عن السدي أنه قال: ليس من رجل ظالم يدخل قبره إلا جاءه رجل قبيح الوجه أسود اللون منتن الريح وعليه ثياب دنسة حتى يدخل معه قبره فإذا رآه قال: ما أقبح وجهك قال كذلك كان عملك قبيحا قال ما أنتن ريحك قال كذلك كان عملك منتنا قال ما أدنس ثيابك قال فيقول إن عملك كان دنسا قال له من أنت ؟ قال عملك قال فيكون معه في قبره فإذا بعث يوم القيامة قال له: إني كنت أحملك في الدنيا باللذات والشهوات وأنت اليوم تحملني قال فيركب على ظهره فيسوقه حتى يدخله النار; فذلك قوله \"وهم يحملون أوزارهم على ظهورهم ألا ساء ما يزرون\"."
    },
    {
      "ayah": 32,
      "surah": 6,
      "text": "وقوله \"وما الحياة الدنيا إلا لعب ولهو\" أي إنما غالبها كذلك \"وللدار الآخرة خير للذين يتقون أفلا تعقلون\"."
    },
    {
      "ayah": 33,
      "surah": 6,
      "text": "يقول تعالى مسليا لنبيه صلى الله عليه وسلم في تكذيب قومه له ومخالفتهم إياه \"قد نعلم إنه ليحزنك الذي يقولون\" أي قد أحطنا علما بتكذيبهم ولك وحزنك وتأسفك عليهم كقوله \"فلا تذهب نفسك عليهم حسرات\" كما قال تعالى في الآية الأخرى \"لعلك باخع نفسك أن لا يكونوا مؤمنين\" \"فلعلك باخع نفسك على آثارهم إن لم يؤمنوا بهذا الحديث أسفا\" وقوله \"فإنهم لا يكذبونك ولكن الظالمين بآيات الله يجحدون\" أي لا يتهمونك بالكذب في نفس الأمر \"ولكن الظالمين بآيات الله يجحدون\" أي ولكنهم يعاندون الحق ويدفعونه بصدورهم كما قال سفيان الثوري عن أبي إسحاق عن ناجية بن كعب عن علي قال: قال أبو جهل للنبي صلى الله تعالى عليه وآله وسلم: إنا لا نكذبك ولكن نكذب ما جئت به فأنزل الله \"فإنهم لا يكذبونك ولكن الظالمين بآيات الله يجحدون\" رواه الحاكم من طريق إسرائيل عن أبي إسحاق. ثم قال: صحيح على شرط الشيخين ولم يخرجاه. وقال ابن أبي حاتم: حدثنا محمد بن الوزير الواسطي بمكة حدثنا بشر بن المبشر الواسطي عن سلام بن مسكين عن أبي يزيد المدني أن النبي صلى الله عليه وسلم لقي أبا جهل فصافحه قال له رجل ألا أراك تصافح هذا الصابئ؟ فقال والله إني لأعلم إنه لنبي ولكن متى كنا لبني عبد مناف تبعا؟ وتلا أبو يزيد \"فإنهم لا يكذبونك ولكن الظالمين بآيات الله يجحدون\" وقال أبو صالح وقتادة: يعلمون أنك رسول الله و يجحدون; وذكر محمد بن إسحاق عن الزهري في قصة أبي جهل حين جاء يستمع قراءة النبي صلى الله عليه وسلم من الليل هو وأبو سفيان صخر بن حرب والأخنس بن شريق ولا يشعر أحد منهم بالآخر فاستمعوها إلى الصباح فلما هجم الصبح تفرقوا فجمعتهم الطريق فقال كل منهم للآخر ما جاء بك ؟ فذكر له ما جاء به ثم تعاهدوا أن لا يعودوا لما يخافون من علم شباب قريش بهم لئلا يفتتنوا بمجيئهم فلما كانت الليلة الثانية جاء كل منهم ظنا أن صاحبيه لا يجيئان لما سبق من العهود فلما أصبحوا جمعتهم الطريق فتلاوموا ثم تعاهدوا أن لا يعودوا فلما كانت الليلة الثالثة جاءوا أيضا فلما أصبحوا تعاهدوا أن لا يعودوا لمثلها ثم تفرقوا فلما أصبح الأخنس بن شريق أخذ عصاه ثم خرج حتى أتى أبا سفيان بن حرب في بيته فقال: أخبرني يا أبا حنظلة عن رأيك فيما سمعت من محمد قال يا أبا ثعلبة والله لقد سمعت أشياء أعرفها وأعرف ما يراد بها وسمعت أشياء ما عرفت معناها ولا ما يراد بها قال الأخنس: وأنا والذي حلفت به ثم خرج من عنده حتى أتى أبا جهل فدخل عليه في بيته فقال يا أبا الحكم ما رأيك فيما سمعت من محمد؟ قال ماذا سمعت؟ قال تنازعنا نحن وبنو عبد مناف الشرف أطعموا فأطعمنا وحملوا فحملنا وأعطوا فأعطينا حتى إذا تجاثينا على الركب وكنا كفرسي رهان قالوا: منا نبي يأتيه الوحي من السماء فمتى ندرك هذه؟ والله لا نؤمن به أبدا ولا نصدقه قال فقام عنه الأخنس وتركه. وروى ابن جرير من طريق أسباط عن السدي في قوله \"قد نعلم إنه ليحزنك الذي يقولون فإنهم لا يكذبونك ولكن الظالمين بآيات الله يجحدون\" لما كان يوم بدر قال الأخنس بن شريق لبني زهرة: يا بني زهرة إن محمدا ابن أختكم فأنتم أحق من ذب عن ابن أخته فإنه إن كان نبيا لم تقاتلوه اليوم وإن كان كاذبا كنتم أحق من كف عن ابن أخته قفوا حتى ألقى أبا الحكم فإن غلب محمد رجعتم سالمين وإن غلب محمد فإن قومكم لم يصنعوا بكم شيئا - فيومئذ سمى الأخنس وكان اسمه أبي - فالتقى الأخنس بأبي جهل فخلا به فقال يا أبا الحكم أخبرني عن محمد أصادق هو أم كاذب فإنه ليس ههنا من قريش غيري وغيرك يستمع كلامنا؟ فقال أبو جهل ويحك والله إن محمدا لصادق وما كذب محمد قط ولكن إذا ذهبت بنو قصي باللواء والسقاية والحجابة والنبوة فماذا يكون لسائر قريش ؟ فذلك قوله \"فإنهم لا يكذبونك ولكن الظالمين بآيات الله يجحدون\" فآيات الله محمد صلى الله عليه وسلم."
    },
    {
      "ayah": 34,
      "surah": 6,
      "text": "وقوله \"ولقد كذبت رسل من قبلك فصبروا على ما كذبوا وأوذوا حتى أتاهم نصرنا\" هذه تسلية للنبي صلى الله عليه وسلم وتعزية له فيمن كذبه من قومه وأمر له بالصبر كما صبر أولو العزم من الرسل ووعد له بالنصر كما نصروا وبالظفر حتى كانت لهم العاقبة بعدما نالهم من التكذيب من قومهم والأذى البليغ ثم جاءهم النصر في الدنيا كما لهم النصر في الآخرة ولهذا قال \"ولا مبدل لكلمات الله\" أي التي كتبها بالنصر في الدنيا والآخرة لعباده المؤمنين كما قال \"ولقد سبقت كلمتنا لعبادنا المرسلين إنهم لهم المنصورون وإن جندنا لهم الغالبون\" وقال تعالى \"كتب الله لأغلبن أنا ورسلي إن الله قوي عزيز\" وقوله \"ولقد جاءك من نبأ المرسلين\" أي من خبرهم كيف نصروا وأيدوا على من كذبهم من قومهم فلك فيهم أسوة وبهم قدوة."
    },
    {
      "ayah": 35,
      "surah": 6,
      "text": "ثم قال تعالى \"وإن كان كبر عليك إعراضهم\" أي إن كان شق عليك إعراضهم عنك \"فإن استطعت أن تبتغي نفقا في الأرض أو سلما في السماء\" قال علي بن أبي طلحة عن ابن عباس: النفق السرب فتذهب فيه فتأتيهم بآية أو تجعل لك سلما في السماء فتصعد فيه فتأتيهم بآية أفضل مما أتيتهم به فافعل وكذا قال قتادة والسدي وغيرهما; وقوله \"ولو شاء الله لجمعهم على الهدى فلا تكونن من الجاهلين\" كقوله تعالى \"ولو شاء ربك لآمن من في الأرض كلهم جميعا\" الآية قال علي بن أبي طلحة عن ابن عباس في قوله \"ولو شاء الله لجمعهم على الهدى\" قال إن رسول الله صلى الله عليه وسلم كان يحرص أن يؤمن جميع الناس ويتابعوه على الهدى فأخبر الله أنه لا يؤمن إلا من قد سبق له من الله السعادة في الذكر الأول."
    },
    {
      "ayah": 36,
      "surah": 6,
      "text": "وقوله تعالى \"إنما يستجيب الذين يسمعون\" أي إنما يستجيب لدعائك يا محمد من يسمع الكلام ويعيه ويفهمه كقوله \"لينذر من كان حيا ويحق القول على الكافرين\" وقوله \"والموتى يبعثهم الله ثم إليه يرجعون\" يعني بذلك الكفار لأنهم موتى القلوب فشبههم الله بأموات الأجساد فقال \"والموتى يبعثهم الله ثم إليه يرجعون\" وهذا من باب التهكم بهم والازدراء عليهم."
    },
    {
      "ayah": 37,
      "surah": 6,
      "text": "يقول تعالى مخبرا عن المشركين أنهم كانوا يقولون لولا نزل عليه آية من ربه أي خارق على مقتضى ما كانوا يريدون ومما يتعنتون كقولهم \"لن نؤمن لك حتى تفجر لنا من الأرض ينبوعا\" الآيات \"قل إن الله قادر على أن ينزل آية ولكن أكثرهم لا يعلمون\" أي هو تعالى قادر على ذلك ولكن حكمته تعالى تقتضي تأخير ذلك لأنه لو أنزل وفق ما طلبوا ثم لم يؤمنوا لعاجلهم بالعقوبة كما فعل بالأمم السالفة كما قال تعالى \"وما منعنا أن نرسل بالآيات إلا أن كذب بها الأولون وآتينا ثمود الناقة مبصرة فظلموا بها وما نرسل بالآيات إلا تخويفا\" وقال تعالى \"إن نشأ ننزل عليهم من السماء آية فظلت أعناقهم لها خاضعين\"."
    },
    {
      "ayah": 38,
      "surah": 6,
      "text": "وقوله \"وما من دابة في الأرض ولا طائر يطير بجناحيه إلا أمم أمثالكم\" قال مجاهد: أى أصناف مصنفة تعرف بأسمائها. وقال قتادة الطير أمة والإنس أمة والجن أمة وقال السدي \"إلا أمم أمثالكم\" أي خلق أمثالكم. وقوله \"ما فرطنا في الكتاب من شيء\" أي الجميع علمهم عند الله ولا ينسى واحدا من جميعها من رزقه وتدبيره سواء كان بريا أو بحريا كقوله \"وما من دابة في الأرض إلا على الله رزقها ويعلم مستقرها ومستودعها كل في كتاب مبين\" أي مفصح بأسمائها وأعدادها ومظانها وحاصر لحركاتها وسكناتها وقال تعالى \"وكأين من دابة لا تحمل رزقها الله يرزقها وإياكم وهو السميع العليم\" وقد قال الحافظ أبو يعلى: حدثنا محمد بن المثنى حدثنا عبيد بن واقد القيسي أبو عباد حدثني محمد بن عيسى بن كيسان حدثنا محمد بن المنكدر عن جابر بن عبدالله قال: قل الجراد في سنة من سني عمر رضي الله عنه التي ولي فيها فسأل عنه فلم يخبر بشيء فاغتم لذلك فأرسل راكبا إلى كذا وآخر إلى الشام وآخر إلى العراق يسأل هل رؤي من الجراد شيء أم لا؟ قال فأتاه الراكب الذي من قبل اليمن بقبضة من جراد فألقاها بين يديه فلما رآها كبر ثلاثا ثم قال: سمعت رسول الله صلى الله عليه وسلم يقول \"خلق الله عز وجل ألف أمة منها ستمائة في البحر وأربعمائة في البر وأول شيء يهلك من هذه الأمم الجراد فإذا هلكت تتابعت مثل النظام إذا قطع سلكه\". وقوله \"ثم إلى ربهم يحشرون\" قال ابن أبي حاتم: حدثنا أبو سعيد الأشج حدثنا أبو نعيم حدثنا سفيان عن أبيه عن عكرمة عن ابن عباس في قوله \"ثم إلى ربهم يحشرون\" قال حشرها الموت وكذا رواه ابن جرير من طريق إسرائيل عن سعيد بن مسروق عن عكرمة عن ابن عباس قال: موت البهائم حشرها وكذا رواه العوفي عنه. قال ابن أبي حاتم: وروي عن مجاهد والضحاك مثله. \"والقول الثاني\" أن حشرها بعثها يوم القيامة لقوله \"وإذا الوحوش حشرت\" وقال الإمام أحمد: حدثنا محمد بن جعفر حدثنا شعبة عن سليمان عن منذر الثوري عن أشياخ لهم عن أبي ذر أن رسول الله صلى الله عليه وسلم رأى شاتين تنتطحان فقال \"يا أبا ذر هل تدري فيم تنتطحان ؟\" قال لا قال لكن الله يدري وسيقضي بينهما ورواه عبدالرزاق عن معمر عن الأعمش عمن ذكره عن أبي ذر قال: بينا نحن عند رسول الله صلى الله عليه وسلم إذ انتطحت عنزان فقال رسول الله صلى الله عليه وسلم أتدرون فيم انتطحتا؟ قالوا لا ندري قال \"لكن الله يدري وسيقضي بينهما\" رواه ابن جرير ثم رواه من طريق منذر الثوري عن أبي ذر فذكره وزاد قال أ بو ذر ولقد تركنا رسول الله صلى الله عليه وسلم وما يقلب طائر جناحيه في السماء إلا ذكر لنا منه علما وقال عبدالله ابن الإمام أحمد في مسند أبيه حدثني عباس بن محمد وأبو يحيى البزار قالا: حدثنا حجاج بن نصير حدثنا شعبة عن العوام بن مزاحم من بني قيس بن ثعلبة عن أبي عثمان النهدي عن عثمان رضي الله عنه أن النبي صلى الله عليه وسلم قال \"إن الجماء لتقتص من القرناء يوم القيامة\" وقال عبدالرزاق: أخبرنا معمر عن جعفر بن برقان عن يزيد بن الأصم عن أبي هريرة في قوله \"إلا أمم أمثالكم ما فرطنا في الكتاب من شيء ثم إلى ربهم يحشرون\" قال: يحشر الخلق كلهم يوم القيامة البهائم والدواب والطير وكل شيء فيبلغ من عدل الله يومئذ أن يأخذ للجماء من القرناء ثم يقول: كوني ترابا فلذلك يقول الكافر \"يا ليتني كنت ترابا\" وقد روي هذا مرفوعا في حديث الصور."
    },
    {
      "ayah": 39,
      "surah": 6,
      "text": "وقوله \"والذين كذبوا بآياتنا صم وبكم في الظلمات\" أي مثلهم في جهلهم وقلة علمهم وعدم فهمهم كمثل أصم وهو الذي لا يسمع أبكم وهو الذي لا يتكلم وهو مع هذا في ظلمات لا يبصر فكيف يهتدي مثل هذا إلى الطريق أو يخرج مما هو فيه كقوله \"مثلهم كمثل الذي استوقد نارا فلما أضاءت ما حوله ذهب الله بنورهم وتركهم في ظلمات لا يبصرون صم بكم عمي فهم لا يرجعون\" وكما قال تعالى \"أو كظلمات في بحر لجي يغشاه موج من فوقه موج من فوقه سحاب ظلمات بعضها فوق بعض إذا أخرج يده لم يكد يراها ومن لم يجعل الله له نورا فما له من نور\" ولهذا قال \"من يشأ الله يضلله ومن يشأ يجعله على صراط مستقيم\" أي هو المتصرف في خلقه بما يشاء."
    },
    {
      "ayah": 4,
      "surah": 6,
      "text": "يقول تعالى مخبرا عن المشركين المكذبين المعاندين أنهم كلما أتتهم آية أي دلالة ومعجزة وحجة من الدلالات على وحدانية الله وصدق رسله الكرام فإنهم يعرضون عنها فلا ينظرون إليها ولا يبالون بها."
    },
    {
      "ayah": 40,
      "surah": 6,
      "text": "يخبر تعالى أنه الفعال لما يريد المتصرف في خلقه بما يشاء وأنه لا معقب لحكمه ولا يقدر أحد على صرف حكمه عن خلقه بل هو وحده لا شريك له الذي إذا سئل يجيب لمن يشاء ولهذا قال \"قل أرأيتكم إن أتاكم عذاب الله أو أتتكم الساعة\" أي أتاكم هذا أو هذا \"أغير الله تدعون إن كنتم صادقين\" أي لا تدعون غيره لعلمكم أنه لا يقدر أحد على رفع ذلك سواه ولهذا قال \"إن كنتم صادقين\" أي في اتخاذكم آلهة معه."
    },
    {
      "ayah": 41,
      "surah": 6,
      "text": "\"بل إياه تدعون فيكشف ما تدعون إليه إن شاء وتنسون ما تشركون\" أي في وقت الضرورة لا تدعون أحدا سواه وتذهب عنكم أصنامكم وأندادكم كقوله \"وإذا مسكم الضر في البحر ضل من تدعون إلا إياه\" الآية."
    },
    {
      "ayah": 42,
      "surah": 6,
      "text": "وقوله \"ولقد أرسلنا إلى أمم من قبلك فأخذناهم بالبأساء\" يعني الفقر والضيق في العيش \"والضراء\" وهي الأمراض والأسقام والآلام \"لعلهم يتضرعون\" أي يدعون الله ويتضرعون إليه ويخشعون."
    },
    {
      "ayah": 43,
      "surah": 6,
      "text": "قال الله تعالى \"فلولا إذ جاءهم بأسنا تضرعوا\" أي فهلا إذ ابتليناهم بذلك تضرعوا إلينا وتمسكنوا لدينا \"ولكن قست قلوبهم\" أي ما رقت ولا خشعت \"وزين لهم الشيطان ما كانو يعملون\" أي من الشرك والمعاندة والمعاصي \"فلما نسوا ما ذكروا به\" أي أعرضوا عنه وتناسوه وجعلوه وراء ظهورهم \"فتحنا عليهم أبواب كل شيء\" أي فتحنا عليهم أبواب الرزق من كل ما يختارون وهذا استدراج منه تعالى وإملاء لهم عياذا بالله من مكروه ولهذا قال \"حتى إذا فرحوا بما أوتوا\" من الأموال والأولاد والأرزاق \"أخذناهم بغتة\" أي على غفلة \"فإذا هم مبلسون\" أي آيسون من كل خير قال الوالبي عن ابن عباس المبلس الآيس. وقال الحسن البصري من وسع الله عليه فلم ير أنه يمكر به فلا رأي له ومن قتر عليه فلم ير أنه ينظر له فلا رأي له."
    },
    {
      "ayah": 44,
      "surah": 6,
      "text": "ثم قرأ \"فلما نسوا ما ذكروا به فتحنا عليهم أبواب كل شيء حتى إذا فرحوا بما أوتوا أخذناهم بغتة فإذا هم مبلسون\" قال مكر بالقوم ورب الكعبة أعطوا حاجتهم ثم أخذوا رواه ابن أبي حاتم وقال قتادة: بغت القوم أمر الله وما أخذ الله قوما قط إلا عند سكرتهم وغرتهم ونعمتهم فلا تغتروا بالله فإنه لا يغتر بالله إلا القوم الفاسقون رواه ابن أبي حاتم أيضا. وقال مالك عن الزهري \"فتحنا عليهم أبواب كل شيء\" قال أرجاء الدنيا وسترها. وقد قال الإمام أحمد: حدثنا يحيى بن غيلان حدثنا رشدين - يعني ابن سعد أبا الحجاج المهري - عن حرملة بن عمران التجيبي عن عقبة بن مسلم عن عقبة بن عامر عن النبي صلى الله عليه وسلم قال: اذا رأيت الله يعطي العبد من الدنيا على معاصيه ما يحب فإنما هو استدراج ثم تلا رسول الله صلى الله عليه وسلم \"فلما نسوا ما ذكروا به فتحنا عليهم أبواب كل شيء حتى إذا فرحوا بما أوتوا أخذناهم بغتة فإذا هم مبلسون\" ورواه ابن جرير وابن أبي حاتم من حديث حرملة وابن لهيعة عن عقبة بن مسلم عن عقبة بن عامر به. وقال ابن أبي حاتم: حدثنا هشام بن عمار حدثنا عراك بن خالد بن يزيد حدثني أبي عن إبراهيم بن أبي عبلة عن عبادة بن الصامت أن رسول الله صلى الله عليه وسلم كان يقول \"إذا أراد الله بقوم بقاء أو نماء رزقهم القصد والعفاف وإذا أراد الله بقوم اقتطاعا فتح لهم أو فتح عليهم باب خيانة\" \"حتى إذا فرحوا بما أوتوا أخذناهم بغتة فإذا هم مبلسون\".كما قال \"فقطع دابر القوم الذين ظلموا والحمد لله رب العالمين\" ورواه أحمد وغيره."
    },
    { "ayah": 45, "surah": 6, "text": "لا يوجد تفسير لهذه الأية" },
    {
      "ayah": 46,
      "surah": 6,
      "text": "يقول الله تعالى لرسوله صلى الله عليه وسلم قل لهؤلاء المكذبين المعاندين \"أرأيتم إن أخذ الله سمعكم وأبصاركم\" أي سلبكم إياها كما أعطاكموها كما قال تعالى \"هو الذي أنشأكم وجعل لكم السمع والأبصار\" الآية ويحتمل أن يكون هذا عبارة عن منع الانتفاع بهما الانتفاع الشرعي ولهذا قال \"وختم على قلوبكم\" كما قال \"أمن يملك السمع والأبصار\" وقال \"واعلموا أن الله يحول بين المرء وقلبه\" وقوله \"من إله غير الله يأتيكم به\" أي هل أحد غير الله يقدر على رد ذلك إليكم إذا سلبه الله منكم لا يقدر على ذلك أحد سواه ولهذا قال \"انظر كيف نصرف الآيات\" أي نبينها ونوضحها ونفسرها دالة على أنه لا إله إلا الله وأن ما يعبدون من دونه باطل وضلال ثم هم يصدفون أي ثم هم مع هذا البيان يصدفون أي يعرضون عن الحق ويصدون الناس عن اتباعه. قال العوفي عن ابن عباس: يصدفون أي يعدلون. وقال مجاهد وقتادة: يعرضون. وقال السدي: يصدون."
    },
    {
      "ayah": 47,
      "surah": 6,
      "text": "وقوله تعالى \"قل أرأيتكم إن أتاكم عذاب الله بغتة\" أي وأنتم لا تشعرون به حتى بغتكم وفجأكم \"أو جهرة\" أي ظاهرا عيانا \"هل يهلك إلا القوم الظالمون\" أي إنما كان يحيط بالظالمين أنفسهم بالشرك بالله وينجو الذين كانوا يعبدون الله وحده لا شريك له فلا خوف عليهم ولا هم يحزنون كقوله \"الذين آمنوا ولم يلبسوا إيمانهم بظلم\" الآية."
    },
    {
      "ayah": 48,
      "surah": 6,
      "text": "وقوله \"وما نرسل المرسلين إلا مبشرين ومنذرين\" أي مبشرين عباد الله المؤمنين بالخيرات ومنذرين من كفر بالله النقمات والعقوبات ولهذا قال \"فمن آمن وأصلح\" أي فمن آمن قلبه بما جاءوا به وصلح عمله باتباعه إياهم \"فلا خوف عليهم\" أي بالنسبة لما يستقبلونه \"ولا هم يحزنون\" أي بالنسبة إلى ما فاتهم وتركوه وراء ظهورهم من أمر الدنيا وصنيعها الله وليهم فيما خلفوه وحافظهم فيما تركوه."
    },
    {
      "ayah": 49,
      "surah": 6,
      "text": "ثم قال \"والذين كذبوا بآياتنا يمسهم العذاب بما كانوا يفسقون\" أي ينالهم العذاب بما كفروا بما جاءت به الرسل وخرجوا عن أوامر الله وطاعته وارتكبوا من مناهيه ومحارمه وانتهاك حرماته."
    },
    {
      "ayah": 5,
      "surah": 6,
      "text": "وهذا تهديد لهم ووعيد شديد على تكذيبهم بالحق بأنه لا بد أن يأتيهم خبر ما هم فيه من التكذيب وليجدن غبه وليذوقن وباله. ثم قال تعالى واعظا لهم أن يصيبهم من العذاب والنكال الدنيوي ما حل بأشباههم ونظرائهم من القرون السالفة الذين كانوا أشد منهم قوة وأكثر جمعا وأكثر أموالا وأولادا واستعلاء في الأرض وعمارة لها."
    },
    {
      "ayah": 50,
      "surah": 6,
      "text": "يقول الله تعالى لرسوله صلى الله عليه وسلم \"قل لا أقول لكم عندي خزائن الله\" أي لست أملكها ولا أتصرف فيها \"ولا أعلم الغيب\" أي ولا أقول لكم إني أعلم الغيب إنما ذاك من علم الله عز وجل ولا أطلع منه إلا على ما أطلعني عليه ولا أقول لكم إني ملك أي ولا أدعي أني ملك إنما أنا بشر من البشر يوحى إلي من الله عز وجل شرفني بذلك وأنعم علي به ولهذا قال \"إن أتبع إلا ما يوحى إلي\" أي لست أخرج عنه قيد شبر ولا أدنى منه \"قل هل يستوي الأعمى والبصير\" أي هل يستوي من اتبع الحق وهدى إليه ومن ضل عنه فلم ينقد له \"أفلا تتفكرون\" وهذه كقوله تعالى \"أفمن يعلم أنما أنزل إليك من ربك الحق كمن هو أعمى إنما يتذكر أولو الألباب\"."
    },
    {
      "ayah": 51,
      "surah": 6,
      "text": "وقوله \"وأنذر به الذين يخافون أن يحشروا إلى ربهم ليس لهم من دونه ولي ولا شفيع\" أي وأنذر بهذا القرآن يا محمد \"الذين هم من خشية ربهم مشفقون الذين يخشون ربهم ويخافون سوء الحساب\" \"الذين يخافون أن يحشروا إلى ربهم\" أي يوم القيامة \"ليس لهم\" أي يومئذ \"من دونه ولي ولا شفيع\" أي لا قريب لهم ولا شفيع فيهم من عذابه إن أراده بهم \"لعلهم يتقون\" أي أنذر هذا اليوم الذي لا حاكم فيه إلا الله عز وجل \"لعلهم يتقون\" فيعملون في هذه الدار عملا ينجيهم الله به يوم القيامة من عذابه ويضاعف لهم به الجزيل من ثوابه."
    },
    {
      "ayah": 52,
      "surah": 6,
      "text": "وقوله تعالى \"ولا تطرد الذين يدعون ربهم بالغداة والعشي يريدون وجهه\"أي لا تبعد هؤلاء المتصفين بهذه الصفات عنك بل اجعلهم جلساءك وأخصاءك كقوله \"واصبر نفسك مع الذين يدعون ربهم بالغداة والعشي يريدون وجهه ولا تعد عيناك عنهم تريد زينة الحياة الدنيا ولا تطع من أغفلنا قلبه عن ذكرنا واتبع هواه وكان أمره فرطا\" وقوله \"يدعون ربهم\" أي يعبدونه ويسألونه \"بالغداة والعشي\" قال سعيد بن المسيب ومجاهد والحسن وقتادة المراد به الصلاة المكتوبة وهذا كقوله \"وقال ربكم ادعوني أستجب لكم\" أي أتقبل منكم وقوله \"يريدون وجهه\" أي يريدون بذلك العمل وجه الله الكريم وهم مخلصون فيما هم فيه من العبادات والطاعات وقوله \"ما عليك من حسابهم من شيء وما من حسابك عليهم من شيء\" كقول نوح عليه السلام في جواب الذين \"قالوا أنؤمن لك واتبعك الأرذلون قال وما علمي بما كانوا يعملون إن حسابهم إلا على ربي لو تشعرون\" أي إنما حسابهم على الله عز وجل وليس علي من حسابهم من شيء كما أنه ليس عليهم من حسابي من شيء وقوله \"فتطردهم فتكون من الظالمين\" أي إن فعلت هذا والحالة هذه قال الإمام أحمد: حدثنا أسباط هو ابن محمد حدثني أشعث عن كردوس عن ابن مسعود قال: مر الملأ من قريش على رسول الله صلى الله عليه وآله وسلم وعنده خباب وصهيب وبلال وعمار فقالوا: يا محمد أرضيت بهؤلاء ؟ فنزل فيهم القرآن \"وأنذر به الذين يخافون أن يحشروا إلى ربهم\" إلى قوله \"أليس الله بأعلم بالشاكرين\" ورواه ابن جرير من طريق أشعث عن كردوس عن ابن مسعود قال: مر الملأ من قريش برسول الله صلى الله عليه وآله وسلم وعنده صهيب وبلال وعمار وخباب وغيرهم من ضعفاء المسلمين فقالوا: يا محمد أرضيت بهؤلاء من قومك ؟ أهؤلاء الذين من الله عليهم من بينا؟ أنحن نصير تبعا لهؤلاء ؟ اطردهم فلعلك إن طردتهم أن نتبعك فنزلت هذه الآية \"ولا تطرد الذين يدعون ربهم بالغداة والعشي يريدون وجهه - وكذلك فتنا بعضهم ببعض\" إلى آخر الآية وقال ابن أبي حاتم: حدثنا ابن سعيد بن يحيى بن سعيد القطان حدثنا عمرو بن محمد العنقزي حدثنا أسباط بن نصر عن السدي عن أبي سعيد الأزدي - وكان قارئ الأزد - عن أبي الكنود عن خباب في قول الله عز وجل \"لا تطرد الذين يدعون ربهم بالغداة والعشي\" قال جاء الأقرع بن حابس التميمي وعيينة بن حصن الفزاري فوجدوا رسول الله صلى الله عليه وسلم مع صهيب وبلال وعمار وخباب قاعدا في ناس من الضعفاء من المؤمنين فلما رأوهم حول النبي صلى الله عليه وسلم حقروهم في نفر في أصحابه فأتوه فخلوا به وقالوا إنا نريد أن تجعل لنا منك مجلسا تعرف لنا به العرب فضلنا فإن وفود العرب تأتيك فنستحي أن ترانا العرب مع هذه الأعبد فإذا نحن جئناك فأقمهم عنا فإذا نحن فرغنا فاقعد معهم إن شئت قال \"نعم\" قالوا فاكتب لنا عليك كتابا قال فدعا بصحيفة ودعا عليا ليكتب ونحن قعود في ناحية فنزل جبريل فقال \"ولا تطرد الذين يدعون ربهم\" الآية فرمى رسول الله صلى الله عليه وسلم بالصحيفة من يده ثم دعانا فأتيناه ورواه ابن جرير من حديث أسباط به وهذا حديث غريب فإن هذه الآية مكية والأقرع بن حابس وعيينة إنما أسلما بعد الهجرة بدهر وقال سفيان الثوري عن المقدام بن شريح عن أبيه قال: قال سعد نزلت هذه الآية في ستة من أصحاب النبي صلى الله عليه وسلم منهم ابن مسعود قال كنا نستبق إلى رسول الله صلى الله عليه وسلم وندنو منه ونسمع منه فقالت قريش: تدني هؤلاء دوننا فنزلت \"ولا تطرد الذين يدعون ربهم بالغداة والعشي\" رواه الحاكم في مستدركه من طريق سفيان وقال على شرط الشيخين وأخرجه ابن حبان في صحيحه من طريق المقدام بن شريح به."
    },
    {
      "ayah": 53,
      "surah": 6,
      "text": "وقوله \"وكذلك فتنا بعضهم ببعض\" أي ابتلينا واختبرنا وامتحنا بعضهم ببعض \"ليقولوا أهؤلاء من الله عليهم من بيننا\" وذلك أن رسول الله صلى الله عليه وسلم كان غالب من اتبعه في أول بعثته ضعفاء الناس من الرجال والنساء والعبيد والإماء ولم يتبعه من الأشراف إلا قليل كما قال قوم نوح لنوح \"وما نراك اتبعك إلا الذين هم أراذلنا بادي الرأي\" الآية وكما سأل هرقل ملك الروم أبا سفيان حين سأله عن تلك المسائل فقال له: فأشراف الناس يتبعونه أم ضعفاؤهم ؟ فقال: بل ضعفاؤهم. فقال هم أتباع الرسل. والغرض أن مشركي قريش كانوا يسخرون بمن آمن من ضعفائهم ويعذبون من يقدرون عليه منهم وكانوا يقولون أهؤلاء من الله عليهم من بيننا ؟ أي ما كان الله ليهدي هؤلاء إلى الخير لو كان ما صاروا إليه خيرا ويدعنا كقولهم \"لو كان خيرا ما سبقونا إليه\" وكقوله تعالى \"وإذا تتلى عليهم آياتنا بينات قال الذين كفروا للذين آمنوا أي الفريقين خير مقاما وأحسن نديا\" قال الله تعالى في جواب ذلك \"وكم أهلكنا قبلهم من قرن هم أحسن أثاثا ورئيا\" وقال في جوابهم حين قالوا \"أهؤلاء من الله عليهم من بيننا أليس الله بأعلم بالشاكرين\" أي أليس هو أعلم بالشاكرين له بأقوالهم وأفعالهم وضمائرهم فيوفقهم ويهديهم سبل السلام ويخرجهم من الظلمات إلى النور بإذنه ويهديهم إلى صراط مستقيم كما قال تعالى والذين جاهدوا فينا لنهدينهم سبلنا وإن الله لمع المحسنين \"وفي الحديث الصحيح إن الله لا ينظر إلى صوركم ولا إلى ألوانكم ولكن ينظر إلى قلوبكم وأعمالكم\" وقال ابن جرير: حدثنا القاسم حدثنا الحسين عن حجاج عن ابن جريج عن عكرمة في قوله \"وأنذر به الذين يخافون أن يحشروا إلى ربهم\" الآية قال: جاء عتبة بن ربيعة وشيبة بن ربيعة ومطعم بن عدي والحارث بن نوفل وقرظة بن عبد عمرو بن نوفل في أشراف من بني عبد مناف من أهل الكفر إلى أبي طالب فقالوا: يا أبا طالب لو أن ابن أخيك محمدا يطرد عنه موالينا وحلفاءنا فإنما هم عبيدنا وعتقاؤنا كان أعظم في صدورنا وأطوع له عندنا وأدنى لاتباعنا إياه وتصديقنا له قال فأتى أبو طالب النبي صلى الله عليه وسلم فحدثه بذلك فقال عمر بن الخطاب رضي الله عنه: لو فعلت ذلك حتى تنظر ما الذي يريدون وإلى ما يصيرون من قولهم فأنزل الله عز وجل هذه الآية \"وأنذر به الذين يخافون أن يحشروا إلى ربهم\" إلى قوله \"أليس الله بأعلم بالشاكرين\" قال: وكانوا بلالا وعمار بن ياسر وسالما مولى أبي حذيفة وصبيحا مولى أسيد ومن الحلفاء ابن مسعود والمقداد بن عمرو ومسعود بن القارئ وواقد بن عبدالله الحنظلي وعمرو بن عبد عمرو وذو الشمالين ومرثد بن أبي مرثد وأبو مرثد الغنوي حليف حمزة بن عبدالمطلب وأشباههم من الحلفاء فنزلت في أئمة الكفر من قريش والموالي والحلفاء \"وكذلك فتنا بعضهم ببعض ليقولوا أهؤلاء من الله عليهم من بيننا\" الآية فلما نزلت أقبل عمر رضي الله عنه فأتي النبي صلى الله عليه وسلم فاعتذر من مقالته;."
    },
    {
      "ayah": 54,
      "surah": 6,
      "text": "فأنزل الله عز وجل \"وإذا جاءك الذين يؤمنون بآياتنا\" الآية وقوله \"وإذا جاءك الذين يؤمنون بآياتنا فقل سلام عليكم\" أي فأكرمهم برد السلام عليهم وبشرهم برحمة الله الواسعة الشاملة لهم ولهذا قال \"كتب ربكم على نفسه الرحمة\" أي أوجبها على نفسه الكريمة تفضلا منه وإحسانا وامتنانا \"أنه من عمل منكم سوءا بجهالة\" قال بعض السلف كل من عصى الله فهو جاهل وقال معتمر بن سليمان عن الحكم عن أبان عن عكرمة في قوله \"من عمل منكم سوءا بجهالة\" قال الدنيا كلها جهالة رواه ابن أبي حاتم \"ثم تاب من بعده وأصلح\" أي رجع عما كان عليه من المعاصي وأقلع وعزم على أن لا يعود وأصلح العمل في المستقبل \"فأنه غفور رحيم\" قال الإمام أحمد: حدثنا عبدالرزاق حدثنا معمر عن همام بن منبه قال هذا ما حدثنا به أبو هريرة قال: قال رسول الله صلى الله عليه وسلم \"لما قضى الله على الخلق كتب في كتاب فهو عنده فوق العرش إن رحمتي غلبت غضبي\" أخرجاه في الصحيحين وهكذا رواه الأعمش عن أبي صالح عن أبي هريرة ورواه موسى عن عقبة عن الأعرج عن أبي هريرة وكذا رواه الليث وغيره عن محمد بن عجلان عن أبيه عن أبي هريرة عن النبي صلى الله عليه وسلم بذلك وقد روى ابن مردوية من طريق الحكم بن أبان عن عكرمة عن ابن عباس قال: قال رسول الله صلى الله عليه وسلم \"إذا فرغ الله من القضاء بين الخلق أخرج كتابا من تحت العرش إن رحمتي سبقت غضبي وأنا أرحم الراحمين فيقبض قبضة أو قبضتين فيخرج من النار خلقا لم يعملوا خيرا مكتوب بين أعينهم عتقاء الله\" وقال عبدالرزاق: أخبرنا معمر عن عاصم بن سليمان عن أبي عثمان النهدي عن سليمان في قوله كتب ربكم على نفسه الرحمة قال: إنا نجد في التوراة عطفتين إن الله خلق السموات والأرض وخلق مائة رحمة أو جعل مائة رحمة قبل أن يخلق الخلق ثم خلق الخلق فوضع بينهم رحمة واحدة وأمسك عنده تسعا وتسعين رحمة قال فيها يتراحمون وبها يتعاطفون وبها يتباذلون وبها يتزاورون وبها تحن الناقة وبها تبح البقرة وبها تثغو الشاة وبها تتتابع الطير وبها تتتابع الحيتان في البحر فإذا كان يوم القيامة جمع الله تلك الرحمة إلى ما عنده ورحمته أفضل وأوسع وقد روي هذا مرفوعا من وجه آخر وسيأتي كثير من الأحاديث الموافقة لهذه عند قوله \"ورحمتي وسعت كل شيء\" ومما يناسب هذه الآية من الأحاديث أيضا قوله صلى الله عليه وسلم لمعاذ بن جبل \"أتدري ما حق الله على العباد؟ أن يعبدوه ولا يشركوا به شيئا\" ثم قال \"أتدري ما حق العباد على الله إذا هم فعلوا ذلك ؟ أن لا يعذبهم\" وقد رواه الإمام أحمد من طريق كميل بن زياد عن أبي هريرة رضي الله عنه."
    },
    {
      "ayah": 55,
      "surah": 6,
      "text": "يقول تعالى وكما بينا ما تقدم بيانه من الحجج والدلائل على طريق الهداية والرشاد وذم المجادلة والعناد \"كذلك نفصل الآيات\" أي التي يحتاج المخاطبون إلى بيانها \"ولتستبين سبيل المجرمين\" أي ولتظهر طريق المجرمين المخالفين للرسل وقرئ \"ولتستبين سبيل المجرمين\" أي ولتستبين يا محمد أو يا مخاطب سبيل المجرمين."
    },
    { "ayah": 56, "surah": 6, "text": "لا يوجد تفسير لهذه الأية" },
    {
      "ayah": 57,
      "surah": 6,
      "text": "وقوله \"قل إني على بينة من ربي\" أي على بصيرة من شريعة الله التي أوحاها الله إلي \"وكذبتم به\" أي بالحق الذي جاءني من الله \"ما عندي ما تستعجلون به\" أي من العذاب \"إن الحكم إلا لله\" أي إنما يرجع أمر ذلك إلى الله إن شاء عجل لكم ما سألتموه من ذلك وإن شاء أنظركم وأجلكم لما له في ذلك من الحكمة العظيمة ولهذا قال \"يقص الحق وهو خير الفاصلين\" أي وهو خير من فصل القضايا وخير الفاتحين في الحكم بين عباده."
    },
    {
      "ayah": 58,
      "surah": 6,
      "text": "وقوله \"قل لو أن عندي ما تستعجلون به لقضي الأمر بيني وبينكم\" أي لو كان مرجع ذلك إلي لأوقعت لكم ما تستحقونه من ذلك \"والله أعلم بالظالمين\" فإن قيل فما الجمع بين هذه الآية وبين ما ثبت في الصحيحين من طريق ابن وهب عن يونس عن الزهري عن عروة عن عائشة أنها قالت لرسول الله صلى الله عليه وسلم: يا رسول الله هل أتى عليك يوم كان أشد من يوم أحد؟ فقال لقد لقيت من قومك وكان أشد ما لقيت منه يوم العقبة إذ عرضت نفسي على ابن عبد ياليل ابن عبد كلال فلم يجبني إلى ما أردت فانطلقت وأنا مهموم على وجهي فلم أستفق إلا بقرن الثعالب فرفعت رأسي فإذا أنا بسحابة قد ظللتني فنظرت فإذا فيها جبريل عليه السلام فناداني فقال إن الله قد سمع قول قومك لك وما ردوا عليك وقد بعث إليك ملك الجبال لتأمره بما شئت فيهم قال: فناداني ملك الجبال وسلم علي ثم قال يا محمد إن الله قد سمع قول قومك لك وقد بعثني ربك إليك لتأمرني بأمرك فيما شئت إن شئت أطبقت عليهم الأخشبين فقال رسول الله صلى الله عليه وسلم بل أرجو أن يخرج الله من أصلابهم من يعبد الله لا يشرك به شيئا وهذا لفظ مسلم فقد عرض عليه عذابهم واستئصالهم فاستأنى بهم وسأل لهم التأخير لعل الله أن يخرج من أصلابهم من لا يشرك به شيئا فما الجمع بين هذا وبين قوله تعالى في هذه الآية \"قل لو أن عندي ما تستعجلون به لقضي الأمر بيني وبينكم والله أعلم بالظالمين\" فالجواب والله أعلم أن هذه الآية دلت على أنه لو كان إليه وقوع العذاب الذي يطلبونه حال طلبهم له لأوقعه بهم وأما الحديث فليس فيه أنهم سألوه وقوع العذاب بهم بل عرض عليه ملك الجبال أنه إن شاء أطبق عليهم الأخشبين وهما جبلا مكة اللذان يكتنفانها جنوبا وشمالا فلهذا استأنى بهم وسأل الرفق لهم."
    },
    {
      "ayah": 59,
      "surah": 6,
      "text": "وقوله تعالى \"وعنده مفاتح الغيب لا يعلمها إلا هو\" قال البخاري: حدثنا عبدالعزيز بن عبدالله حدثنا إبراهيم بن سعد عن ابن شهاب عن سالم بن عبدالله عن أبيه أن رسول الله صلى الله عليه وسلم قال مفاتح الغيب خمس لا يعلمهن إلا الله \"إن الله عنده علم الساعة وينزل الغيث ويعلم ما في الأرحام وما تدري نفس ماذا تكسب غدا وما تدري نفس بأي أرض تموت إن الله عليم خبير\" وفي حديث عمر أن جبريل حين تبدى له في صورة أعرابي فسأل عن الإيمان والإسلام والإحسان فقال له النبي صلى الله عليه وسلم فيما قال له \"خمس لا يعلمهن إلا الله\" ثم قرأ \"إن الله عنده علم الساعة\" الآية. وقوله \"ويعلم ما في البر والبحر\" أي يحيط علمه الكريم بجميع الموجودات بريها وبحريها لا يخفى عليه من ذلك شيء ولا مثقال ذرة في الأرض ولا في السماء وما أحسن ما قال الصرصري: فلا بخفي عليه الذر إما تراءى للنواظر أو توارى وقوله \"وما تسقط من ورقة إلا يعلمها\" أي ويعلم الحركات حتى من الجمادات فما ظنك بالحيوانات ولا سيما المكلفون منهم من جنهم وإنسهم كما قال تعالى \"يعلم خائنة الأعين وما تخفي الصدور\".وقال ابن أبي حاتم: حدثنا أبي حدثنا الحسن بن الربيع حدثنا أبو الأحوص عن سعيد بن مسروق حدثنا حسان النمري عن ابن عباس في قوله \"وما تسقط من ورقة إلا يعلمها\" قال ما من شجرة في بر ولا بحر إلا وملك موكل بها يكتب ما يسقط منها رواه ابن أبي حاتم وقوله \"ولا حبة في ظلمات الأرض ولا رطب ولا يابس إلا في كتاب مبين\" قال ابن أبي حاتم: حدثنا عبدالله بن محمد بن عبدالرحمن بن المسور الزهري حدثنا مالك بن سعير حدثنا الأعمش عن يزيد بن أبي زياد عن عبدالله بن الحارث قال: ما في الأرض من شجرة ولا مغرز إبرة إلا وعليها ملك موكل يأتي الله بعلمها رطوبتها إذا رطبت ويبوستها إذا يبست وكذا رواه ابن جرير عن أبي الخطاب زياد بن عبدالله الحساني عن مالك بن سعير به. ثم قال ابن أبي حاتم ذكر عن أبي حذيفة حدثنا سفيان عن عمرو بن قيس عن رجل عن سعيد بن جبير عن ابن عباس قال: خلق الله النون وهي الدواة وخلق الألواح فكتب فيها أمر الدنيا حتى ينقضي ما كان من خلق مخلوق أو رزق حلال أو حرام أو عمل بر أو فجور وقرأ هذه الآية \"وما تسقط من ورقة إلا يعلمها\" إلى آخر الآية قال محمد بن إسحاق عن يحيى بن النضر عن أبيه سمعت عبدالله بن عمرو بن العاص يقول إن تحت الأرض الثالثة وفوق الرابعة من الجن ما لو أنهم ظهروا يعني لكم لم تروا معهم نورا على كل زاوية من زوايا الأرض خاتم من خواتيم الله عز وجل على كل خاتم ملك من الملائكة يبعث الله عز وجل إليه في كل يوم ملكا من عنده أن احتفظ بما عندك."
    },
    {
      "ayah": 6,
      "surah": 6,
      "text": "فقال \"ألم يروا كم أهلكنا من قبلهم من قرن مكناهم في الأرض ما لم نمكن لكم\" أي من الأموال والأولاد والأعمار والجاه العريض والسعة والجنود ولهذا قال \"وأرسلنا السماء عليهم مدرارا\" أي شيئا بعد شيء \"وجعلنا الأنهار تجري من تحتهم\" أي كثرنا عليهم أمطار السماء وينابيع الأرض أي استدراجا وإملاء لهم \"فأهلكناهم بذنوبهم\" أي بخطاياهم وسيئاتهم التي اجترموها \"وأنشأنا من بعدهم قرنا آخرين\" أي فذهب الأولون كأمس الذاهب وجعلناهم أحاديث \"وأنشأنا من بعدهم قرنا آخرين\" أي جيلا آخر لنختبرهم فعملوا مثل أعمالهم فأهلكوا كإهلاكهم فاحذروا أيها المخاطبون أن يصيبكم مثل ما أصابهم فما أنتم بأعز على الله منهم والرسول الذي كذبتموه أكرم على الله من رسولهم فأنتم أولى بالعذاب ومعاجلة العقوبة منهم لولا لطفه وإحسانه."
    },
    {
      "ayah": 60,
      "surah": 6,
      "text": "يقول تعالى إنه يتوفى عباده في منامهم بالليل وهذا هو التوفي الأصغر كما قال تعالى \"إذ قال الله يا عيسى إني متوفيك ورافعك إلي\" وقال تعالى \"الله يتوفى الأنفس حين موتها والتي لم تمت في منامها فيمسك التي قضى عليها الموت ويرسل الأخرى إلى أجل مسمى\" فذكر في هذه الآية الوفاتين الكبرى والصغرى وهكذا ذكر في هذا المقام حكم الوفاتين الصغرى ثم الكبرى فقال \"وهو الذي يتوفاكم بالليل ويعلم ما جرحتم بالنهار\" أي ويعلم ما كسبتم من الأعمال بالنهار وهذه جملة معترضة دلت على إحاطة علمه تعالى بخلقه في ليلهم ونهارهم في حال سكونهم وحال حركتهم كما قال \"سواء منكم من أسر القول ومن جهر به ومن هو مستخف بالليل وسارب بالنهار\" وكما قال تعالى \"ومن رحمته جعل لكم الليل والنهار لتسكنوا فيه\" أي في الليل \"ولتبتغوا من فضله\" أي في النهار كما قال \"وجعلنا الليل لباسا وجعلنا النهار معاشا\" ولهذا قال تعالى ههنا \"وهو الذي يتوفاكم بالليل ويعلم ما جرحتم بالنهار\" أي ما كسبتم من الأعمال فيه \"ثم يبعثكم فيه\" أي في النهار قاله مجاهد وقتادة والسدي وقال ابن جريج عن عبدالله بن كثير أي في المنام والأول أظهر وقد روى ابن مردوية بسنده عن الضحاك عن ابن عباس عن النبي صلى الله عليه وسلم قال \"مع كل إنسان ملك إذا نام أخذ نفسه ويرده إليه فإن أذن الله في قبض روحه قبضه وإلا رد إليه\" فذلك قوله \"وهو الذي يتوفاكم بالليل\". وقوله \"ليقضى أجل مسمى\" يعني به أجل كل واحد من الناس \"ثم إليه مرجعكم\" أي يوم القيامة \"ثم ينبئكم\" أي فيخبركم \"بما كنتم تعملون\" أي ويجزيكم على ذلك إن خيرا فخيرا وإن شرا فشرا."
    },
    {
      "ayah": 61,
      "surah": 6,
      "text": "وقوله \"وهو القاهر فوق عباده\" أي وهو الذي قهر كل شيء وخضع لجلاله وعظمته وكبريائه كل شيء \"ويرسل عليكم حفظة\" أي من الملائكة يحفظون بدن الإنسان كقوله \"له معقبات من بين يديه ومن خلفه يحفظونه من أمر الله\" وحفظة يحفظون عمله ويحصونه كقوله \"وإن عليكم لحافظين\" الآية وكقوله \"عن اليمين وعن الشمال قعيد ما يلفظ من قول إلا لديه رقيب عتيد\" وقوله \"إذ يتلقى المتلقيان\" الآية وقوله \"حتى إذا جاء أحدكم الموت\" أي احتضر وحان أجله \"توفته رسلنا\" أي ملائكة موكلون بذلك قال ابن عباس وغير واحد: لملك الموت أعوان من الملائكة يخرجون الروح من الجسد فيقبضها ملك الموت إذا انتهت إلى الحلقوم وسيأتي عند قوله تعالى \"يثبت الله الذين آمنوا بالقول الثابت\" الأحاديث المتعلقة بذلك الشاهدة لهذا المروي عن ابن عباس وغيره بالصحة وقوله \"وهم لا يفرطون\" أي في حفظ روح المتوفى بل يحفظونها وينزلونها حيث شاء الله عز وجل إن كان من الأبرار ففي عليين وإن كان من الفجار ففي سجين عياذا بالله من ذلك."
    },
    {
      "ayah": 62,
      "surah": 6,
      "text": "وقوله \"ثم ردوا إلى الله مولاهم الحق\" قال ابن جرير \"ثم ردوا\" يعني الملائكة \"إلى الله مولاهم الحق\" ونذكر ههنا الحديث الذي رواه الإمام أحمد حيث قال: حدثنا حسين بن محمد حدثنا ابن أبي ذئب عن محمد بن عمرو بن عطاء عن سعيد بن يسار عن أبي هريرة رضي الله عنه عن النبي صلى الله عليه وسلم أنه قال \"إن الميت تحضره الملائكة فإذا كان الرجل الصالح قالوا اخرجي أيتها النفس الطيبة كانت في الجسد الطيب اخرجي حميدة وأبشري بروح وريحان ورب غير غضبان فلا تزال يقال لها ذلك حتى تخرج ثم يعرج بها إلى السماء فيستفتح لها فيقال من هذا فيقال فلان فيقال مرحبا بالنفس الطيبة كانت في الجسد الطيب ادخلي حميدة وأبشري بروح وريحان ورب غير غضبان فلا تزال يقال لها ذلك حتى ينتهى بها إلى السماء التي فيها الله عز وجل وإذا كان الرجل السوء قالوا اخرجي أيتها النفس الخبيثة كانت في الجسد الخبيث اخرجي ذميمة وأبشري بحميم وغساق وآخر من شكله أزواج فلا تزال يقال لها ذلك حتى تخرج ثم يعرج بها إلى السماء فيستفتح لها فيقال من هذا فيقال فلان فيقال لا مرحبا بالنفس الخبيثة كانت في الجسد الخبيث ارجعي ذميمة فإنه لا يفتح لك أبواب السماء فترسل من السماء ثم تصير إلى القبر فيجلس الرجل الصالح فيقال له مثل ما قيل في الحديث الأول ويجلس الرجل السوء فيقال له مثل ما قيل في الحديث الثاني\" وهذا حديث غريب ويحتمل أن يكون المراد بقوله \"ثم ردوا\" يعني الخلائق كلهم إلى الله يوم القيامة فيحكم فيهم بعدله كما قال \"قل إن الأولين والآخرين لمجموعون إلى ميقات يوم معلوم\" وقال \"وحشرناهم فلم نغادر منهم أحدا\" إلى قوله \"ولا يظلم ربك أحدا\" ولهذا قال \"مولاهم الحق ألا له الحكم وهو أسرع الحاسبين\"."
    },
    {
      "ayah": 63,
      "surah": 6,
      "text": "يقول تعالى ممتنا على عباده في إنجائه المضطرين منهم من ظلمات البر والبحر أي الحائرين الواقعين في المهامة البرية وفي اللجج البحرية إذا هاجت الرياح العاصفة فحينئذ يفردون الدعاء له وحده لا شريك له كقوله \"وإذا مسكم الضر في البحر ضل من تدعون إلا إياه\" الآية. وقوله \"هو الذي يسيركم في البر والبحر حتى إذا كنتم في الفلك وجرين بهم بريح طيبة وفرحوا بها جاءتها ريح عاصف وجاءهم الموج من كل مكان وظنوا أنهم أحيط بهم دعوا الله مخلصين له الدين لئن أنجيتنا من هذه لنكونن من الشاكرين\" الآية. وقوله \"أمن يهديكم في ظلمات البر والبحر ومن يرسل الرياح بشرا بين يدي رحمته أإله مع الله تعالى الله عما يشركون\" وقال في هذه الآية الكريمة \"قل من ينجيكم من ظلمات البر والبحر تدعونه تضرعا وخفية\" أي جهرا وسرا \"لئن أنجانا\" أي من هذه الضائقة \"لنكونن من الشاكرين\" أي بعدها."
    },
    {
      "ayah": 64,
      "surah": 6,
      "text": "قال الله \"قل الله ينجيكم منها ومن كل كرب ثم أنتم\" أي بعد ذلك \"تشركون\" أي تدعون معه في حال الرفاهية آلهة أخرى."
    },
    {
      "ayah": 65,
      "surah": 6,
      "text": "وقوله \"قل هو القادر على أن يبعث عليكم عذابا من فوقكم أو من تحت أرجلكم\" لما قال ثم أنتم تشركون عقبه بقوله \"قل هو القادر على أن يبعث عليكم عذابا\" أي بعد إنجائه إياكم كقوله في سورة سبحان \"ربكم الذي يزجي لكم الفلك في البحر لتبتغوا من فضله إنه كان بكم رحيما وإذا مسكم الضر في البحر ضل من تدعون إلا إياه فلما نجاكم إلى البر أعرضتم وكان الإنسان كفورا أفأمنتم أن يخسف بكم جانب البر أو يرسل عليكم حاصبا ثم لا تجدوا لكم وكيلا أم أمنتم أن يعيدكم فيه تارة أخرى فيرسل عليكم قاصفا من الريح فيغرقكم بما كفرتم ثم لا تجدوا لكم علينا به تبيعا\" قال ابن أبي حاتم ذكر عن مسلم بن إبراهيم حدثنا هارون الأعور عن جعفر بن سليمان عن الحسن في قوله \"قل هو القادر على أن يبعث عليكم عذابا من فوقكم أو من تحت أرجلكم\" قال هذه للمشركين. وقال ابن أبي نجيح عن مجاهد في قوله \"قل هو القادر على أن يبعث عليكم عذابا من فوقكم أو من تحت أرجلكم\" لأمة محمد صلى الله عليه وسلم وعفى عنهم ونذكر هنا الأحاديث الواردة في ذلك والآثار وبالله المستعان وعليه التكلان وبه الثقة. قال البخاري رحمه الله تعالى في قوله \"قل هو القادر على أن يبعث عليكم عذابا من فوقكم أو من تحت أرجلكم أو يلبسكم شيعا ويذيق بعضكم بأس بعض انظر كيف نصرف الآيات لعلهم يفقهون\" يلبسكم يخلطكم من الالتباس يلبسوا يخلطوا شيعا فرقا حدثنا أبو النعمان حدثنا حماد بن زيد عن عمرو بن دينار عن جابر بن عبدالله قال لما نزلت هذه الآية \"قل هو القادر علي أن يبعث عليكم عذابا من فوقكم\" قال رسول الله صلى الله عليه وسلم \"أعوذ بوجهك\" \"أو من تحت أرجلكم\" قال \"أعوذ بوجهك\" \"أو يلبسكم شيعا ويذيق بعضكم بأس بعض\" قال رسول الله صلى الله عليه وسلم هذه أهون - أو - أيسر.وهكذا رواه أيضا في كتاب التوحيد عن قتيبة عن حماد به ورواه النسائي أيضا في التفسير عن قتيبة ومحمد بن النضر بن مساور ويحيى بن حبيب بن عدي أربعتهم عن حماد بن زيد به وقد رواه الحميدي في مسنده عن سفيان بن عيينة عن عمرو بن دينار سمع جابرا عن النبي صلى الله عليه وسلم به. ورواه ابن حبان في صحيحه عن أبي يعلى الموصلي عن أبي خيثمة عن سفيان بن عيينة به ورواه ابن جرير في تفسيره عن أحمد بن الوليد القرشي وسعيد بن الربيع وسفيان بن وكيع كلهم عن سفيان بن عيينة به ورواه أبو بكر بن مردوية من حديث آدم بن أبي إياس ويحيى بن عبدالحميد وعاصم بن علي عن سفيان بن عيينة به ورواه سعيد بن منصور عن حماد بن زيد وسفيان بن عيينة كلاهما عن عمرو بن دينار به. \"طريق آخر\" قال الحافظ أبو بكر بن مردوية في تفسيره حدثنا سليمان بن أحمد حدثنا مقدام بن داود حدثنا عبدالله بن يوسف حدثنا عبدالله بن لهيعة عن خالد بن يزيد عن أبي الزبير عن جابر قال لما نزلت \"قل هو القادر على أن يبعث عليكم عذابا من فوقكم\" قال رسول الله صلى الله عليه وسلم \"أعوذ بالله من ذلك أو من تحت أرجلكم\" قال رسول الله صلى الله عليه وسلم \"أعوذ بالله من ذلك\" \"أو يلبسكم شيعا\" قال \"هذا أيسر\" وإن استعاذه لأعاذه. ويتعلق بهذه الآية أحاديث كثيرة. \"أحدها\" قال الإمام أحمد بن حنبل في مسنده حدثنا أبو اليمان حدثنا أبو بكر يعني ابن أبي مريم عن راشد هو ابن سعد المقرائي عن سعد بن أبي وقاص قال سئل رسول الله صلى الله عليه وسلم عن هذه الآية \"قل هو القادر على أن يبعث عليكم عذابا من فوقكم أو من تحت أرجلكم\" فقال \"أما إنها كائنة ولم يأت تأويلها بعد\".وأخرجه الترمذي عن الحسن بن عرفة عن إسماعيل بن عياش عن أبي بكر بن أبي مريم به ثم قال هذا حديث غريب. \"حديث آخر\" قال الإمام أحمد حدثنا يعلى هو ابن عبيد حدثنا عثمان بن حكيم عن عامر بن سعد بن أبي وقاص عن أبيه قال: أقبلنا مع رسول الله صلى الله عليه وسلم حتى مررنا على مسجد بني معاوية فدخل فصلى ركعتين فصلينا معه فناجى ربه عز وجل طويلا ثم قال \"سألت ربي ثلاثا سألته أن لا يهلك أمتي بالغرق فأعطانيها وسألته أن لا يهلك أمتي بالسنة فأعطانيها وسألته أن لا يجعل بأسهم بينهم فمنعنيها\" انفرد بإخراجه مسلم فرواه في كتاب الفتن عن أبي بكر بن أبي شيبة عن محمد بن عبدالله بن نمير كلاهما عن عبدالله بن نمير وعن محمد بن يحيى بن أبي عمرو عن مروان بن معاوية كلاهما عن عثمان بن حكيم به. \"حديث آخر\" قال الإمام أحمد قرأت على عبدالرحمن بن مهدي عن مالك عن عبدالله بن عبدالله بن جابر بن عتيك عن جابر بن عتيك أنه قال جاءنا عبدالله بن عمر في حرة بني معاوية - قرية من قرى الأنصار- فقال لي هل تدري أين صلى رسول الله صلى الله عليه وسلم في مسجدكم هذا؟ فقلت نعم فأشرت إلى ناحية منه فقال هل تدري ما الثلاث التي دعاهن فيه؟ فقلت نعم فقال أخبرني بهن فقلت دعا أن لا يظهر عليهم عدوا من غيرهم ولا يهلكهم بالسنين فأعطيهما ودعا بأن لا يجعل بأسهم بينهم فمنعها قال صدقت فلا يزال الهرج إلى يوم القيامة. ليس هو في شيء من الكتب الستة وإسناده جيد قوي ولله الحمد والمنة. \"حديث آخر\" قال محمد بن إسحاق عن حكيم بن حكيم بن عباد عن خصيف عن عبادة بن حنيف عن علي بن عبدالرحمن أخبرني حذيفة بن اليمان قال خرجت مع رسول الله صلى الله عليه وسلم إلى حرة بني معاوية قال فصلى ثماني ركعات فأطال فيهن ثم التفت إلي فقال \"حبستك يا حذيفة\" قلت الله ورسوله أعلم قال إني سألت الله ثلاثا فأعطاني اثنتين ومنعني واحدة سألته أن لا يسلط على أمتي عدوا من غيرهم فأعطاني وسألته أن لا يهلكهم بغرق فأعطاني وسألته أن لا يجعل بأسهم بينهم فمنعني.رواه ابن مردوية من حديث محمد بن إسحاق \"حديث آخر\" قال الإمام أحمد حدثنا عبيدة بن حميد حدثني سليمان بن الأعمش عن رجاء الأنصاري عن عبدالله بن شداد عن معاذ بن جبل رضي الله عنه قال: أتيت رسول الله صلى الله عليه وسلم فقيل لي خرج قبل قال فجعلت لا أمر بأحد إلا قال مر قبل حتى مررت فوجدته قائما يصلي قال فجئت حتى قمت خلفه فأطال الصلاة فلما قضى صلاته قلت يا رسول الله قد صليت صلاة طويلة فقال رسول الله صلى الله عليه وسلم إني صليت صلاة رغبة ورهبة إني سألت الله عز وجل ثلاثا فأعطاني اثنتين ومنعني واحدة سألته أن لا يهلك أمتي غرقا فأعطاني وسألته أن لا يظهر عليهم عدوا ليس منهم فأعطانيها وسألته أن لا يجعل بأسهم بينهم فردها علي.ورواه ابن ماجه في الفتن عن محمد بن عبدالله بن نمير وعلي بن محمد كلاهما عن أبي معاوية عن الأعمش به. ورواه ابن مردوية من حديث أبي عوانة عن عبدالله بن عمير عن عبدالرحمن بن أبي ليلى عن معاذ بن جبل عن النبي صلى الله عليه وسلم بمثله أو نحوه. \"حديث آخر\" قال الإمام أحمد حدثنا هارون بن معروف حدثنا عبدالله بن وهب أخبرني عمرو بن الحارث عن بكير بن الأشج أن الضحاك بن عبدالله القرشي حدثه عن أنس بن مالك أنه قال رأيت رسول الله صلى الله عليه وسلم في سفر صلى سبحة الضحى ثماني ركعات فلما انصرف قال إني صليت صلاة رغبة ورهبة وسألت ربي ثلاثا فأعطاني اثنتين ومنعني واحدة سألته أن لا يبتلي أمتي بالسنين ففعل وسألته أن لا يظهر عليهم عدوهم ففعل وسألته أن لا يلبسهم شيعا فأبى علي.ورواه النسائي في الصلاة عن محمد بن سلمة عن ابن وهب به. \"حديث آخر\" قال الإمام أحمد حدثنا أبو اليمان أخبرنا شعيب بن أبي حمزة قال: قال الزهري حدثني عبدالله بن عبدالله بن الحارث بن نوفل عن عبدالله بن خباب عن أبيه خباب بن الأرت مولى بني زهرة وكان قد شهد بدرا مع رسول الله صلى الله عليه وسلم أنه قال وافيت رسول الله صلى الله عليه وسلم في ليلة صلاها كلها حتى كان مع الفجر فسلم رسول الله صلى الله عليه وسلم من صلاته فقلت يا رسول الله لقد صليت الليلة صلاة ما رأيتك صليت مثلها فقال رسول الله صلى الله عليه وسلم أجل إنها صلاة رغب ورهب سألت ربي عز وجل فيها ثلاث خصال فأعطاني اثنتين ومنعني واحدة سألت ربي عز وجل أن لا يهلكنا بما أهلك به الأمم قبلنا فأعطانيها وسألت ربي عز وجل أن لا يظهر علينا عدوا من غيرنا فأعطانيها وسألت ربي عز وجل أن لا يلبسنا شيعا فمنعنيها.ورواه النسائي من حديث شعيب بن أبى حمزة به. ومن وجه آخر وابن حبان في صحيحه بإسناديهما عن صالح بن كيسان والترمذي في الفتن من حديث النعمان بن راشد كلاهما عن الزهري به وقال حسن صحيح. \"حديث آخر\" قال أبو جعفر بن جرير في تفسيره حدثني زياد بن عبدالله المزني حدثنا مروان بن معاوية الفزاري حدثنا أبو مالك حدثني نافع بن خالد الخزاعي عن أبيه أن النبي صلى الله عليه وسلم صلى صلاة خفيفة تامة الركوع والسجود فقال قد كانت صلاة رغبة ورهبة سألت الله عز وجل فيها ثلاثا أعطاني اثنتين ومنعني واحدة سألت الله أن لا يصيبكم بعذاب أصاب به من كان قبلكم فأعطانيها وسألت الله أن لا يسلط عليكم عدوا يستبيح بيضتكم فأعطانيها وسألت الله أن لا يلبسكم شيعا ويذيق بعضكم بأس بعض فمنعنيها قال أبو مالك فقلت له أبوك سمع هذا من في رسول الله صلى الله عليه وسلم ؟ فقال نعم سمعته يحدث بها القوم أنه سمعها من في رسول الله صلى الله عليه وسلم \"حديث آخر\" قال الإمام أحمد حدثنا عبدالرزاق قال: قال معمر أخبرني أيوب عن أبي قلابة عن الأشعث الصنعاني عن أبي أسماء الرحبي عن شداد بن أوس أن رسول الله صلى الله عليه وسلم قال إن الله زوى لي الأرض حتى رأيت مشارقها ومغاربها وأن ملك أمتي سيبلغ ما زوي لي منها وإني أعطيت الكنزين الأبيض والأحمر وإني سألت ربي عز وجل أن لا يهلك أمتي بسنة عامة وأن لا يسلط عليهم عدوا فيهلكهم بعامة وأن لا يلبسهم شيعا وأن لا يذيق بعضهم بأس بعض فقال يا محمد إني إذا قضيت قضاء فإنه لا يرد وإني قد أعطيتك لأمتك أن لا أهلكهم بسنة عامة وأن لا أسلط عليهم عدوا ممن سواهم فيهلكهم بعامة حتى يكون بعضهم يهلك بعضا وبعضهم يقتل بعضا وبعضهم يسبي بعضا قال: وقال النبي صلى الله عليه وسلم إني لا أخاف على أمتي إلا الأئمة المضلين فإذا وضع السيف في أمتي لم يرفع عنهم إلى يوم القيامة ليس في شيء من الكتب الستة وإسناده جيد قوي وقد رواه ابن مردوية من حديث حماد بن زيد وعباد بن منصور وقتادة ثلاثتهم عن أيوب عن أبي قلابة عن أبي أسماء عن ثوبان عن رسول الله صلى الله عليه وسلم بنحوه والله أعلم. \"حديث آخر\" قال الحافظ أبو بكر بن مردوية حدثنا عبدالله بن إسماعيل بن إبراهيم الهاشمي وميمون بن إسحاق بن الحسن الحنفي قالا حدثنا أحمد بن عبدالجبار حدثنا محمد بن فضيل عن أبي مالك الأشجعي عن نافع بن خالد الخزاعي عن أبيه قال وكان أبوه من أصحاب رسول الله صلى الله عليه وسلم وكان من أصحاب الشجرة قال كان رسول الله صلى الله عليه وسلم إذا صلى والناس حوله صلى صلاة خفيفة تامة الركوع والسجود قال فجلس يوما فأطال الجلوس حتى أومأ بعضنا إلى بعض أن اسكتوا إنه ينزل عليه فلما فرغ قال له بعض القوم يا رسول الله لقد أطلت الجلوس حتى أومأ بعضنا إلى بعض إنه ينزل عليك قال لا ولكنها كانت صلاة رغبة ورهبة سألت الله فيها ثلاثا فأعطاني اثنتين ومنعني واحدة سألت الله أن لا يعذبكم بعذاب عذب به من كان قبلكم فأعطانيها وسألت الله أن لا يسلط على أمتي عدوا يستبيحها فأعطانيها وسألته أن لا يلبسكم شيعا وأن لا يذيق بعضكم بأس بعض فمنعنيها قال: قلت له أبوك سمعها من رسول الله صلي الله عليه وآله وسلم؟ قال نعم سمعته يقول إنه سمعها من رسول الله صلى الله عليه وآله وسلم عدد أصابعي هذه عشر أصابع. \"حديث أخر\" قال الإمام أحمد حدثنا يونس هو ابن محمد المؤدب حدثنا ليث هو ابن سعد عن أبي وهب الخولاني عن رجل قد سماه عن أبى بصرة الغفاري صاحب رسول الله صلى الله عليه وآله وسلم أن رسول الله صلى الله عليه وسلم قال سألت ربي عز وجل أربعا فأعطاني ثلاثا ومنعني واحدة سألت الله أن لا يجمع أمتي على ضلالة فأعطانيها وسألت الله أن لا يظهر عليهم عدوا من غيرهم فأعطانيها وسألت الله أن لا يهلكهم بالسنين كما أهلك الأمم قبلهم فأعطانيها وسألت الله عز وجل أن لا يلبسهم شيعا وأن لا يذيق بعضهم بأس بعض فمنعنيها لم يخرجه أحد من أصحاب الكتب الستة. \"حديث آخر\" قال الطبراني حدثنا محمد بن عثمان بن أبي شيبة حدثنا منجاب بن الحارث حدثنا أبو حذيفة الثعلبي عن زياد بن علاقة عن جابر بن سمرة السوائي عن علي أن رسول الله صلى الله عليه وأله وسلم قال سألت ربي ثلاث خصال فأعطاني اثنتين ومنعني واحدة فقلت يا رب لا تهلك أمتي جوعا فقال هذه لك قلت يا رب لا تسلط عليهم عدوا من غيرهم يعني أهل الشرك فيجتاحهم قال ذلك لك قلت يا رب لا تجعل بأسهم بينهم فمنعني هذه. \"حديث آخر\" قال الحافظ أبو بكر بن مردوية حدثنا محمد بن أحمد بن إبراهيم عن أحمد بن محمد بن عاصم حدثنا أبو الدرداء المروزي حدثنا إسحاق بن عبدالله بن كيسان حدثني أبي عن عكرمة عن ابن عباس أن رسول الله صلى الله عليه وآله وسلم قال دعوت ربي عز وجل أن يرفع عن أمتي أربعا فرفع الله عنهم اثنتين وأبى على أن يرفع عنهم اثنتين دعوت ربي أن يرفع الرجم من السماء والغرق من الأرض وأن لا يلبسهم شيعا وأن لا يذيق بعضهم بأس بعض فرفع الله عنهم الرجم من السماء والغرق من الأرض وأبى الله أن يرفع اثنتين القتل والهرج.\"طريق أخرى\" عن ابن عباس أيضا قال ابن مردوية حدثنا عبدالله بن محمد بن يزيد حدثني الوليد بن أبان حدثنا جعفر بن منير حدثنا أبو بدر شجاع بن الوليد حدثنا عمرو بن قيس عن رجل عن ابن عباس قال لما نزلت هذه الآية قل هو القادر على أن يبعث عليكم عذابا من فوقكم أو من تحت أرجلكم أو يلبسكم شيعا ويذيق بعضكـم بأس بعض قال فقام النبي صلى الله عليه وسلم فتوضأ ثم قال اللهم لا ترسل على أمتي عذابا من فوقهم ولا من تحت أرجلهم ولا تلبسهم شيعا ولا تذق بعضهم بأس بعض قال فأتاه جبريل فقال يا محمد إن الله قد أجار أمتك أن يرسل عليهم عذابا من فوقهم أو من تحت أرجلهم. \"حديث آخر\" قال ابن مردوية حدثنا أحمد بن محمد بن عبدالله البزار حدثنا عبدالله بن أحمد بن موسى حدثنا أحمد بن محمد بن يحيى بن سعيد حدثنا عمرو بن محمد العنقزي حدثنا أسباط عن السدي عن أبي المنهال عن أبي هريرة عن النبي صلى الله عليه وسلم قال سألت ربي لأمتي أربع خصال فأعطاني ثلاثا ومنعني واحدة سألته أن لا تكفر أمتي صفقة واحدة فأعطانيها وسألته أن لا يعذبهم بما عذب به الأمم قبلهم فأعطانيها وسألته أن لا يظهر عليهم عدوا من غيرهم فأعطانيها وسألته أن لا يجعل بأسهم بينهم فمنعنيها ورواه ابن أبي حاتم عن أبي سعيد بن يحيى بن سعيد القطان عن عمرو بن محمد العنقزي به نحوه. \"طريق آخر\" وقال ابن مردوي حدثنا محمد بن أحمد بن إبراهيم حدثنا محمد بن يحيى حدثنا أبو كريب حدثنا زيد بن الحباب حدثنا كثير بن زيد الليثي المدني حدثني الوليد بن رباح مولى آل أبي ذئاب سمع أبا هريرة يقول: قال النبي صلى الله عليه وسلم سألت ربي ثلاثا فأعطاني اثنتين ومنعني واحدة سألته أن لا يسلط على أمتي عدوا من غيرهم فأعطاني وسألته أن لا يهلكهم بالسنين فأعطاني وسألته أن لايلبسهم شيعا وأن لا يذيق بعضهم بأس بعض فمنعني.ثم رواه ابن مردوية بإسناده عن سعد بن سعيد بن أبي سعيد المقبري عن أبيه عن أبي هريرة عن النبي صلى الله عليه وآله وسلم بنحوه ورواه البزار من طريق عمرو بن أبي سلمة عن أبيه عن أبي هريرة عن النبي صلى الله عليه وسلم بنحوه. ورواه البزار من طريق عمر بن أبي سلمة عن أبيه عن أبي هريرة عن النبي صلى الله عليه وسلم بنحوه. \"أثر آخر\" قال سفيان الثوري عن الربيع بن أنس عن أبي العالية عن أبي بن كعب قال أربع في هذه الأمة قد مضت اثنتان وبقيت اثنتان \"قل هو القادر على أن يبعث عليكم عذابا من فوقكم\" قال الرجم \"أو من تحت أرجلكم\" قال الخسف \"أو يلبسكم شيعا ويذيق بعضكم بأس بعض\" قال سفيان يعني الرجم والخسف وقال أبو جعفر الرازي عن الربيع بن أنس عن أبي العالية عن أبي بن كعب \"قل هو القادر على أن يبعث عليكم عذابا من فوقكم أو من تحت أرجلكم أو يلبسكم شيعا ويذيق بعضكم بأس بعض\" قال فهي أربع خلال منها اثنتان بعد وفاة رسول الله صلى الله عليه وسلم بخمس وعشرين سنة ألبسوا شيعا وذاق بعضهم بأس بعض وبقيت اثنتان لا بد منهما واقعتان الرجم والخسف ورواه أحمد عن وكيع عن أبي جعفر ورواه ابن أبي حاتم وقال ابن أبي حاتم حدثنا المنذر بن شاذان حدثنا أحمد بن إسحاق حدثنا أبو الأشهب عن الحسن في قوله \"قل هو القادر على أن يبعث\" الآية. قال حبست عقوبتها حتى عمل ذنبها فلما عمل ذنبها أرسلت عقوبتها وهكذا قال مجاهد وسعيد بن جبير وأبو مالك والسدي وابن زيد وغير واحد في قوله \"عذابا من فوقكم\" يعني الرجم \"أو من تحت أرجلكم\" يعني الخسف. وهذا هو اختيار ابن جرير ورواه ابن جرير عن يونس عن ابن وهب عن عبدالرحمن بن زيد بن أسلم في قوله \"قل هو القادر على أن يبعث عليكم عذابا من فوقكم أو من تحت أرجلكم\" قال كان عبدالله بن مسعود يصيح وهو في المسجد أو على المنبر يقول ألا أيها الناس إنه قد نزل بكم أن الله يقول \"قل هو القادر على أن يبعث عليكم عذابا من فوقكم\" لو جاءكم عذاب من السماء لم يبق منكم أحدا \"أو من تحت أرجلكم\" لو خسف بكم الأرض أهلككم ولم يبق منكم أحدا \"أو يلبسكم شيعا ويذيق بعضكم بأس بعض\" ألا إنه نزل بكم أسوأ الثلاث. \"قول ثان\" قال ابن جرير وابن أبي حاتم حدثنا يونس بن عبدالأعلى أخبرنا ابن وهب سمعت خلاد بن سليمان يقول سمعت عامر بن عبدالرحمن يقول إن ابن عباس كان يقول في هذه الآية \"قل هو القادر على أن يبعث عليكم عذابا من فوقكم\" فأئمة السوء \"أو من تحت أرجلكم\" فخدم السوء وقال علي بن أبي طلحة عن ابن عباس \"عذاب من فوقكم\" يعني أمراءكم \"أو من تحت أرجلكم\" يعني عبيدكم وسفلتكم وحكى ابن أبي حاتم عن أبي سنان وعمرو بن هانئ نحو ذلك. قال ابن جرير: وهذا القول وإن كان له وجه صحيح لكن الأول أظهر وأقوى وهو كما قال ابن جرير رحمه الله ويشهد له بالصحة قوله تعالى \"أأمنتم من في السماء أن يخسف بكم الأرض فإذا هي تمور أم أمنتم من في السماء أن يرسل عليكم حاصبا فستعلمون كيف نذير\" وفي الحديث \"ليكونن في هذه الأمة قذف وخسف ومسخ\" وذلك مذكور مع نظائره في أمارات الساعة وأشراطها وظهور الآيات قبل يوم القيامة وستأتي في موضعها إن شاء الله تعالى وقوله \"أو يلبسكم شيعا\" يعني يجعلكم ملتبسين شيعا فرقا متخالفين. قال الوالبي عن ابن عباس يعني الأهواء وكذا قال مجاهد وغير واحد وقد ورد في الحديث المروي من طرق عنه صلى الله عليه وسلم أنه قال \"وستفترق هذه الأمة على ثلاث وسبعين فرقة كلها في النار إلا واحدة\".وقوله تعالى \"ويذيق بعضكم بأس بعض\" قال ابن عباس وغير واحد يعني يسلط بعضكم على بعض بالعذاب والقتل. وقوله تعالى \"انظر كيف نصرف الآيات\" أي نبينها ونوضحها مرة ونفسرها \"لعلهم يفقهون\" أي يفهمون ويتدبرون عن الله آياته وحججه وبراهينه. قال زيد بن أسلم لما نزلت \"قل هو القادر على أن يبعث عليكم عذابا من فوقكم\" الآية. قال رسول الله صلى الله عليه وسلم \"لا ترجعوا بعدي كفارا يضرب بعضكم رقاب بعض بالسيف\" قالوا ونحن نشهد أن لا إله إلا الله وأنك رسول الله قال \"نعم\" فقال بعضهم لا يكون هذا أبدا أن يقتل بعضنا بعضا ونحن مسلمون فنزلت \"انظر كيف نصرف الآيات لعلهم يفقهون وكذب به قومك وهو الحق قل لست عليكم بوكيل لكل نبأ مستقر وسوف تعلمون\" رواه ابن أبي حاتم وابن جرير."
    },
    {
      "ayah": 66,
      "surah": 6,
      "text": "يقول تعالى \"وكذب به\" أي بالقرآن الذي جئتهم به والهدى والبيان \"قومك\" يعني قريشا \"وهو الحق\" أي الذي ليس وراءه حق \"قل لست عليكم بوكيل\" أي لست عليكم بحفيظ ولست بموكل بكم كقوله \"وقل الحق من ربكم فمن شاء فليؤمن ومن شاء فليكفر\" أي إنما علي البلاغ وعليكم السمع والطاعة فمن اتبعني سعد في الدنيا والآخرة ومن خالفني فقد شقي في الدنيا والآخرة."
    },
    {
      "ayah": 67,
      "surah": 6,
      "text": "ولهذا قال \"لكل نبأ مستقر\" قال ابن عباس وغير واحد أي لكل نبأ حقيقة أي لكل خبر وقوع ولو بعد حين كما قال \"ولتعلمن نبأه بعد حين\" وقال \"لكل أجل كتاب\" وهذا تهديد ووعيد أكيد ولهذا قال بعده \"وسوف تعلمون\"."
    },
    {
      "ayah": 68,
      "surah": 6,
      "text": "وقوله \"وإذا رأيت الذين يخوضون في آياتنا\" أي بالتكذيب والاستهزاء \"فأعرض عنهم حتى يخوضوا في حديث غيره\" أي حتى يأخذوا في كلام آخر غير ما كانوا فيه من التكذيب \"وإما ينسينك الشيطان\" والمراد بذلك كل فرد من آحاد الأمة أن لا يجلس مع المكذبين الذين يحرفون آيات الله ويضعونها على غير مواضعها فإن جلس أحد معهم ناسيا \"فلا تقعد بعد الذكرى\" بعد التذكر \"مع القوم الظالمين\" ولهذا ورد في الحديث \"رفع عن أمتي الخطأ والنسيان وما استكرهوا عليه\".وقال السدي عن أبي مالك وسعيد بن جبير في قوله \"وإما ينسينك الشيطان\" قال إن نسيت فذكرت \"فلا تقعد\" معهم وكذا قال مقاتل بن حيان وهذه الآية هي المشار إليها في قوله \"وقد نزل عليكم في الكتاب أن إذا سمعتم آيات الله يكفر بها ويستهزأ بها فلا تقعدوا معهم حتى يخوضوا في حديث غيره إنكم إذا مثلهم\" الآية. أي إنكم إذا جلستم معهم وأقررتموهم على ذلك فقد ساويتموهم فيما هم فيه."
    },
    {
      "ayah": 69,
      "surah": 6,
      "text": "وقوله \"وما على الذين يتقون من حسابهم من شيء\" أي إذا تجنبوهم فلم يجلسوا معهم في ذلك فقد برئوا من عهدتهم وتخلصوا من إثمهم قال ابن أبي حاتم حدثنا أبو سعيد الأشج حدثنا عبدالله بن موسى عن إسرائيل عن السدي عن أبي مالك عن سعيد بن جبير. قوله \"وما على الذين يتقون من حسابهم من شيء\" قال ما عليك أن يخوضوا في آيات الله إذا فعلت ذلك أي إذا تجنبتهم وأعرضت عنهم وقال آخرون بل معناه وإن جلسوا معهم فليس عليهم من حسابهم من شيء وزعموا أن هذا منسوخ بآية النساء المدنية وهي قوله \"إنكم إذا مثلهم\" قاله مجاهد والسدي وابن جريج وغيرهم. وعلى قولهم يكون قوله \"ولكن ذكرى لهم لعلهم يتقون\" أي ولكن أمرناكم بالإعراض عنهم حينئذ تذكيرا لهم عما هم فيه لعلهم يتقون ذلك ولا يعودون إليه."
    },
    {
      "ayah": 7,
      "surah": 6,
      "text": "يقول تعالى مخبرا عن المشركين وعنادهم ومكابرتهم للحق ومباهتتهم ومنازعتهم فيه \"ولو نزلنا عليك كتابا في قرطاس فلمسوه بأيديهم\" أي عاينوه ورأوا نزوله وباشروا ذلك لقال \"الذين كفروا إن هذا إلا سحر مبين\" وهذا كما قال تعالى مخبرا عن مكابرتهم للمحسوسات \"ولو فتحنا عليهم بابا من السماء فظلوا فيه يعرجون لقالوا إنما سكرت أبصارنا بل نحن قوم مسحورون\" وكقوله تعالى \"وإن يروا كسفا من السماء ساقطا يقولوا سحاب مركوم\" ."
    },
    {
      "ayah": 70,
      "surah": 6,
      "text": "يقول تعالي \"وذر الذين اتخذوا دينهم لعبا ولهوا وغرتهم الحياة الدنيا\" أي دعهم وأعرض عنهم وأمهلهم قليلا فإنهم صائرون إلى عذاب عظيم ولهذا قال وذكر به أي ذكر الناس بهذا القرآن وحذرهم نقمة الله وعذابه الأليم يوم القيامة وقوله تعالى \"أن تبسل نفس بما كسبت\" أي لئلا تبسل قال الضحاك عن ابن عباس ومجاهد وعكرمة والحسن والسدي تبسل تسلم وقال الوالبى عن ابن عباس تفتضح. وقال قتادة تحبس وقال مرة وابن زيد تؤاخذ. وقال الكلبي تجزى وكل هذه الأقوال والعبارات متقاربة في المعنى وحاصلها الإسلام للهلكة والحبس عن الخير والارتهان عن درك المطلوب كقوله \"كل نفس بما كسبت رهينة إلا أصحاب اليمين\" وقوله \"ليس لها من دون الله ولي ولا شفيع\" أي لا قريب ولا أحد يشفع فيها كقوله \"من قبل أن يأتي يوم لا بيع فيه ولا خلة ولا شفاعة والكافرون هم الظالمون\" وقوله \"وإن تعدل كل عدل لا يؤخذ منها\" أي ولو بذلت كل مبذول ما قبل منها كقوله \"إن الذين كفروا وماتوا وهم كفار فلن يقبل من أحدهم ملء الأرض ذهبا\" الآية. وكذا قال ههنا \"أولئك الذين أبسلوا بما كسبوا لهم شراب من حميم وعذاب أليم بما كانوا يكفرون\"."
    },
    {
      "ayah": 71,
      "surah": 6,
      "text": "قال السدي قال المشركون للمسلمين اتبعوا سبيلنا واتركوا دين محمد فأنزل الله عز وجل \"قل أندعوا من دون الله ما لا ينفعنا ولا يضرنا ونرد على أعقابنا\" أي في الكفر \"بعد إذ هدانا الله\" فيكون مثلنا مثل الذي استهوته الشياطين في الأرض يقول مثلكم إن كفرتم بعد إيمانكم كمثل رجل خرج مع قوم على الطريق فضل الطريق فحيرته الشياطين واستهوته في الأرض وأصحابه على الطريق فجعلوا يدعونه إليهم يقولون ائتنا فإنا على الطريق فأبى أن يأتيهم فذلك مثل من يتبعهم بعد المعرفة بمحمد صلى الله عليه وعلي آله وسلم ومحمد هو الذي يدعو إلى الطريق والطريق هو الإسلام. رواه ابن جرير وقال قتادة \"استهوته الشياطين في الأرض\" أضلته في الأرض يعني استهوته سيرته كقوله \"تهوي إليهم\" وقال علي بن أبي طلحة عن ابن عباس في قوله \"قل أندعوا من دون الله ما لا ينفعنا ولا يضرنا\" الآية. هذا مثل ضربه الله للآلهة ومن يدعو إليها والدعاة الذين يدعون إلى هدى الله عز وجل كمثل رجل ضل عن طريق تائها إذ ناداه مناد يا فلان ابن فلان هلم إلى الطريق وله أصحاب يدعونه يا فلان هلم إلى الطريق فان اتبع الداعي الأول انطلق به حتى يلقيه إلى الهلكة وإن أجاب من يدعوه إلى الهدى اهتدى إلى الطريق وهذه الداعية التي تدعو في البرية من الغيلان يقول مثل من يعبد هذه الآلهة من دون الله فإنه يرى أنه في شيء حتى يأتيه الموت فيستقبل الندامة والهلكة وقوله \"كالذي استهوته الشياطين في الأرض\" هم الغيلان \"يدعونه\" باسمه واسم أبيه وجده فيتبعها وهو يرى أنه في شيء فيصبح وقد رمته في هلكة وربما أكلته أو تلقيه في مضلة من الأرض يهلك فيها عطشا فهذا مثل من أجاب الآلهة التي تعبد من دون الله عز وجل رواه ابن جرير وقال ابن أبي نجيح عن مجاهد \"كالذي استهوته الشياطين في الأرض حيران\"قال رجل حيران يدعوه أصحابه إلى الطريق وذلك مثل من يضل بعد أن هدي وقال العوفي عن ابن عباس قوله \"كالذي استهوته الشياطين في الأرض حيران له أصحاب\" هو الذي لا يستجيب لهدى الله وهو رجل أطاع الشيطان وعمل في الأرض بالمعصية وحاد عن الحق وضل عنه وله أصحاب يدعونه إلى الهدى ويزعمون أن الذي يأمرونه به هدى يقول الله ذلك لأوليائهم من الإنس \"إن الهدى هدى الله\" والضلال ما يدعو إليه الجن. رواه ابن جرير ثم قال وهذا يقتضي أن أصحابه يدعونه إلى الضلال ويزعمون أنه هدى قال: وهذا خلاف ظاهر الآية فإن الله أخبر أنهم يدعونه إلى الهدى فغير جائز أن يكون ضلالا وقد أخبر الله أنه هدى وهو كما قال ابن جرير فإن السياق يقتضي أن هذا الذي استهوته الشياطين في الأرض حيران وهو منصوب على الحال أي في حال حيرته وضلاله وجهله وجه المحجة وله أصحاب على المحجة سائرون فجعلوا يدعونه إليهم وإلى الذهاب معهم على الطريقة المثلى وتقدير الكلام فيأبى عليهم ولا يلتفت إليهم ولو شاء الله لهداه ولرد به إلى الطريق ولهذا قال \"قل إن هدى الله هو الهدى\" كما قال \"ومن يهد الله فما له من مضل\" وقال \"إن تحرص على هداهم فإن الله لا يهدي من يضل وما لهم من ناصرين\" وقوله \"وأمرنا لنسلم لرب العالمين\" أي نخلص له العبادة وحده لا شريك له."
    },
    {
      "ayah": 72,
      "surah": 6,
      "text": "\"وأن أقيموا الصلاة واتقوه\" أي وأمرنا بإقامة الصلاة وبتقواه في جميع الأحوال \"وهو الذي إليه تحشرون\" أي يوم القيامة."
    },
    {
      "ayah": 73,
      "surah": 6,
      "text": "\"وهو الذي خلق السموات والأرض بالحق\" أي بالعدل فهو خالقهما ومالكهما والمدبر لهما ولمن فيهما وقوله \"ويوم يقول كن فيكون\" يعني يوم القيامة الذي يقول الله كن فيكون عن أمره كلمح البصر أو هو أقرب ويوم منصوب إما على العطف على قوله واتقوه وتقديره واتقوا يوم يقول كن فيكونو إما على قوله \"خلق السموات والأرض\" أي وخلق يوم يقول كن فيكون فذكر بدء الخلق وإعادته وهذا مناسبو إما على إضمار فعل تقديره واذكر يوم يقول كن فيكون وقوله \"قوله الحق وله الملك\" جملتان محلهما الجر على أنهما صفتان لرب العالمين وقوله \"ويوم ينفخ في الصور\" يحتمل أن يكون بدلا من قوله \"ويوم يقول كن فبكون يوم ينفخ في الصور\" ويحتمل أن يكون ظرفا لقوله \"وله الملك يوم ينفخ في الصور\" كقوله \"لمن الملك اليوم لله الواحد القهار\" وكقوله \"الملك يومئذ الحق للرحمن وكان يوما على الكافرين عسيرا\" وما أشبه ذلك واختلف المفسرون في قوله \"يوم ينفخ في الصور\" فقال بعضهم المراد بالصور هنا جمع صورة أي يوم ينفخ فيها فتحيا. قال ابن جرير كما يقال سور لسور البلد وهو جمع سورة والصحيح أن المراد بالصور القرن الذي ينفخ فيه إسرافيل عليه السلام قال ابن جرير والصواب عندنا ما تظاهرت به الأخبار عن رسول الله صلى الله عليه وآله وسلم أنه قال إن إسرافيل قد التقم الصور وحنى جبهته ينتظر متى يؤمر فينفخ.رواه مسلم في صحيحه وقال الإمام أحمد حدثنا إسماعيل حدثنا سليمان التيمي عن أسلم العجلي عن بشر بن شغاف عن عبد الله بن عمرو قال: قال أعرابي يا رسول الله ما الصور؟ قال قرن ينفخ فيه. وقد روينا حديث الصور بطوله من طريق الحافظ أيي القاسم الطبراني في كتابه المطولات قال حدثنا أحمد بن الحسن المقري الإيلي حدثنا أبو عاصم النبيل حدثنا إسماعيل بن رافع عن محمد بن زياد عن محمد بن كعب القرظي عن أبي هريرة رضي الله عنه قال: حدثنا رسول الله صلى الله عليه وعلى آله وسلم وهو في طائفة من أصحابه فقال إن الله لما فرغ من خلق السموات والأرض خلق الصور فأعطاه إسرافيل فهو واضعه على فيه شاخصا بصره إلى العرش ينتظر متى يؤمر قلت يا رسول الله صلى الله عليه وسلم وما الصور؟ قال القرن قلت كيف هو؟ قال عظيم والذي بعثني بالحق إن عظم دارة فيه كعرض السموات والأرض ينفخ فيه ثلات نفخات النفخة الأولى نفخة الفزع والثانية نفخة الصعق والثالثة نفخة القيام لرب العالمين يأمر الله تعالى إسرافيل بالنفخة الأولى فيقول انفخ فينفخ نفخة الفزع فيفزع أهل السموات والأرض إلا من شاء الله ويأمره فيطيلها ويديمها ولا يفتر وهى كقول الله \"وما ينظر هؤلاء إلا صيحة واحدة مالها من فواق\" فيسير الله الجبال فتمر مر السحاب فتكون سرابا ثم ترتج الأرض بأهلها رجا فتكون كالسفينة المرمية في البحر تضربها الأمواج تكفأ بأهلها كالقنديل المعلق في العرش ترجرجه الرياح وهو الذي يقول \"يوم ترجف الراجفة تتبعها الرادفة قلوب يومئذ واجفة\" فيميد الناس على ظهرها وتذهل المراضع وتضع الحوامل وتشيب الولدان وتطير الشياطين هاربة من الفزع حتى تأت الأقطار فتأتيها الملائكة فتضرب وجوهها فترجع ويولي الناس مدبرين ما لهم من أمر الله من عاصم ينادي بعضهم بعضا وهو الذي يقول الله تعالى \"يوم التناد\" فبينما هم على ذلك إذ تصدعت الأرض من قطر إلى قطر فرأوا أمرا عظيما لم يروا مثله وأخذهم لذلك من الكرب والهول ما الله به عليم ثم نظروا إلى السماء فإذا هي كالمهل ثم انشقت السماء فانتشرت نجومها وانخسف شمسها وقمرها قال رسول الله صلى الله عليه وعلى آله وسلم الأموات لا يعلمون بشيء من ذلك قال أبو هريرة يا رسول الله من استثنى الله عز وجل حين يقول \"ففزع من في السموات ومن في الأرض إلا من شاء الله\" ؟ قال أولئك الشهداء وإنما يصل الفزع إلى الأحياء وهم أحياء عند ربهم يرزقون وقاهم الله فزع ذلك اليوم وآمنهم منه وهو عذاب الله يبعثه على شرار خلقه - قال - وهو الذي يقول الله عز وجل \"يا أيها الناس اتقوا ربكم إن زلزلة الساعة شيء عظيم يوم ترونها تذهل كل مرضعة عما أرضعت وتضع كل ذات حمل حملها وترى الناس سكارى وما هم بسكارى ولكن عذاب الله شديد\" فيقومون في ذلك العذاب ما شاء الله إلا أنه يطول ثم يأمر الله إسرافيل بنفخة الصعق فينفخ نفخة الصعق فيصعق أهل السموات والأرض إلا من شاء الله فإذا هم قد خمدوا وجاء ملك الموت إلى الجبار عز وجل فيقول يا رب قد مات أهل السموات والأرض إلا من شئت فيقول الله وهو أعلم بمن بقي: فمن بقي؟ فيقول يا رب بقيت أنت الحي الذي لا تموت وبقيت حملة العرش وبقي جبريل وميكائيل وبقيت أنا فيقول الله عز وجل: ليمت جبريل وميكائيل فينطق الله العرش فيقول يا رب يموت جبريل وميكائيل فيقول اسكت فإني كتبت الموت على كل من كان تحت عرشي فيموتان ثم يأتي ملك الموت إلى الجبار فيقول يا رب قد مات جبريل وميكائيل فيقول الله وهو أعلم بمن بقى: فمن بقي؟ فيقول بقيت أنت الحي الذي لا تموت وبقيت حملة عرشك وبقيت أنا فيقول الله لتمت حملة العرش فتموت ويأمر الله العرش فيقبض الصور من إسرافيل ثم يأتي ملك الموت فيقول يا رب قد مات حملة عرشك فيقول الله وهو أعلم بمن بقي: فمن بقي؟ فيقول يا رب بقيت أنت الحي الذي لا تموت وبقيت أنا فيقول الله أنت خلق من خلقي خلقتك لما رأيت فمت فيموت فإذا لم يبق إلا الله الواحد القهار الأحد الصمد الذي لم يلد ولم يولد كان آخرا كما كان أولا طوى السموات والأرض طي السجل للكتب ثم دحاهما ثم يلقفهما ثلاث مرات يقول أنا الجبار أنا الجبار أنا الجبار ثلاثا ثم هتف بصوته \"لمن الملك اليوم\" ثلات مرات فلا يجيبه أحد ثم يقول لنفسه \"لله الواحد القهار\" يقول الله \"يوم تبدل الأرض غير الأرض والسموات\" فيبسطهما ويسطحهما ثم يمدهما مد الأديم العكاظي \"لا ترى فيها عوجا ولا أمتا\" ثم يزجر الله الخلق زجرة واحدة فإذا هم في هذه الأرض المبدلة مثل ما كانوا فيها من الأولى من كان في بطنها كان في بطنها ومن كان على ظهرها كان على ظهرها ثم ينزل الله عليهم ماء من تحت العرش ثم يأمر الله السماء أن تمطر فتمطر أربعين يوما حتى يكون الماء فوقهم اثني عشر ذراعا ثم يأمر الله الأجساد أن تنبت فتنبت كنبات الطراثيث أو كنبات البقل حتى إذا تكاملت أجسادهم فكانت كما كانت قال الله عز وجل ليحي حملة عرشي فيحيون ويأمر الله إسرافيل فيأخذ الصور فيضعه على فيه ثم يقول ليحي جبريل وميكائيل فيحييان ثم يدعو الله بالأرواح فيؤتى بها تتوهج أرواح المسلمين نورا وأرواح الكافرين ظلمة فيقبضها جميعا ثم يلقيها في الصور ثم يأمر الله إسرافيل أن ينفخ نفخة البعث فينفخ نفخة البعث فتخرج الأرواح كأنها النحل قد ملأت ما بين السماء والأرض فيقول وعزتي وجلالي ليرجعن كل روح إلى جسده فتدخل الأرواح في الأرض إلى الأجساد فتدخل في الخياشيم ثم تمشي في الأجساد كما يمشي السم في اللديغ ثم تنشق الأرض عنهم وأنا أول من تنشق الأرض عنه فتخرجون سراعا إلى ربكم تنسلون \"مهطعين إلى الداع يقول الكافرون هذا يوم عسر\" حفاة عراة غلفا غرلا فتقفون موقفا واحدا مقداره سبعون عاما لا ينظر إليكم ولا يقضى بينكم فتبكون حتى تنقطع الدموع ثم تدمعون دما وتعرقون حتى يلجمكم العرق أو يبلغ الأذقان وتقولون من يشفع لنا إلى ربنا فيقضي بيننا فتقولون من أحق بذلك من أبيكم آدم خلقه الله بيده ونفخ فيه من روحه وكلمه قبلا فيأتون آدم فيطلبون ذلك إليه فيأبى ويقول ما أنا بصاحب ذلك فيستقرءون الأنبياء نبيا نبيا كلما جاءوا نبيا أبى عليهم - قال رسول الله صلى الله عليه وسلم - حتى يأتوني فأنطلق إلى الفحص فأخر ساجدا - قال أبو هريرة يا رسول الله وما الفحص؟ قال- قدام العرش حتى يبعث الله إلي ملكا فيأخذ بعضدي ويرفعني فيقول يا محمد فأقول نعم يا رب فيقول الله عز وجل ما شأنك وهو أعلم - فأقول يا رب وعدتني الشفاعة فشفعني في خلقك فاقض بينهم قال الله قد شفعتك أنا آتيكم أقضي بينكم - قال رسول الله صلى الله عليه وسلم - فأرجع فأقف مع الناس فبينما نحن وقوف إذ سمعنا من السماء حسا شديدا فهالنا فينزل أهل السماء الدنيا بمثلي من في الأرض من الجن والإنس حتى إذا دنوا من الأرض أشرقت الأرض بنورهم وأخذوا مصافهم وقلنا لهم أفيكم ربنا؟ قالوا لا وهو آت ثم ينزل أهل السماء الثانية بمثلي من نزل من الملائكة وبمثلي من فيها من الجن والإنس حتى إذا دنوا من الأرض أشرقت الأرض بنورهم وأخذوا مصافهم وقلنا لهم أفيكم ربنا؟ فيقولون لا وهو آت ثم ينزلون على قدر ذلك من التضعيف حتى ينزل الجبار عز وجل في ظلل من الغمام والملائكة فيحمل عرشه يومئذ ثمانية - وهم اليوم أربعة - أقدامهم في تخوم الأرض السفلى والأرض والسموات إلى حجزهم والعرش على مناكبهم لهم زجل في تسبيحهم يقولون سبحان ذي العرش والجبروت سبحان ذي الملك والملكوت سبحان الحي الذي لا يموت سبحان الذي يميت الخلائق ولا يموت سبوح قدوس قدوس قدوس سبحان ربنا الأعلى رب الملائكة والروح سبحان ربنا الأعلى الذي يميت الخلائق ولا يموت فيضع الله كرسيه حيث يشاء من أرضه ثم يهتف بصوته فيقول يا معشر الجن والإنس إني قد أنصت لكم منذ خلقتكم إلى يومكم هذا أسمع قولكم وأبصر أعمالكم فأنصتوا إلي فإنما هي أعمالكم وصحفكم تقرأ عليكم فمن وجد خيرا فليحمد الله ومن وجد غير ذلك فلا يلومن إلا نفسه ثم يأمر الله جهنم فيخرج منها عنق ساطع مظلم ثم يقول \"ألم أعهد إليكم يا بني آدم أن لا تعبدوا الشيطان إنه لكم عدو مبين وأن اعبدوني هذا صراط مستقيم ولقد أضل منكم جبلا كثيرا أفلم تكونوا تعقلون هذه جهنم التي كنتم توعدون\" أو - بها تكذبون - شك أبو عاصم \"وامتازوا اليوم أيها المجرمون\" فيميز الله الناس وتجثو الأمم. يقول الله تعالى \"وترى كل أمة جاثية كل أمة تدعى إلى كتابها اليوم تجزون ما كنتم تعملون\" فيقضي الله عز وجل بين خلقه إلا الثقلين الجن والإنس فيقضي بين الوحوش والبهائم حتى إنه ليقضي للجماء من ذات القرن فإذا فرغ من ذلك فلم تبق تبعة عند واحدة للأخرى قال الله لها كوني ترابا فعند ذلك يقول الكافر \"يا ليتني كنت ترابا\" ثم يقضي الله بين العباد فكان أول ما يقضي فيه الدماء ويأتي كل قتيل في سبيل الله ويأمر الله عز وجل كل من قتل فيحمل رأسه تشخب أوداجه فيقول يا رب فيم قتلني هذا؟ فيقول - وهو أعلم - فيم قتلتهم؟ فيقول قتلتهم لتكون العزة لك فيقول الله له صدقت فيجعل الله وجهه مثل نور الشمس ثم تمر به الملائكة إلى الجنة ثم يأتي كل من قتل على غير ذلك يحمل رأسه وتشخب أوداجه فيقول يا رب فيم قتلني هذا؟ فيقول- وهو أعلم - لم قتلتهم؟ فيقول يا رب قتلتهم لتكون العزة لي فيقول تعست ثم لا تبقى نفس قتلها إلا قتل بها ولا مظلمة ظلمها إلا أخذ بها وكان في مشيئة الله إن شاء عذبه وإن شاء رحمه ثم يقضي الله تعالى بين من بقي من خلقه حتى لا تبقى مظلمة لأحد عند أحد إلا أخذها الله للمظلوم من الظالم حتى إنه ليكلف شائب اللبن بالماء ثم يبيعه أن يخلص اللبن من الماء فإذا فرغ الله من ذلك نادى مناد يسمع الخلائق كلهم: ألا ليلحق كل قوم بآلهتهم وما كانوا يعبدون من دون الله فلا يبقى أحد عبد من دون الله إلا مثلت له آلهته بين يديه ويجعل يومئذ ملك من الملائكة على صورة عزير ويجعل ملك من الملائكة على صورة عيسى ابن مريم ثم يتبع هذا اليهود وهذا النصارى ثم قادتهم آلهتهم إلى النار وهو الذي يقول \"لو كان هؤلاء آلهة ما وردوها وكل فيها خالدون\" فإذا لم يبق إلا المؤمنون فيهم المنافقون جاءهم الله فيما شاء من هيئته فقال: يا أيها الناس ذهب الناس فالحقوا بآلهتكم وما كنتم تعبدون. فيقولون والله ما لنا إله إلا الله وما كنا نعبد غيره فينصرف عنهم وهو الله الذي يأتيهم فيمكث ما شاء الله أن يمكث ثم يأتيهم فيقول: يا أيها الناس ذهب الناس فالحقوا بآلهتكم وما كنتم تعبدون. فيقولون والله ما لنا إله إلا الله وما كنا نعبد غيره فيكشف لهم عن ساقه ويتجلى لهم من عظمته ما يعرفون أنه ربهم فيخرون للأذقان سجدا على وجوههم ويخر كل منافق على قفاه ويجعل الله أصلابهم كصياصي البقر ثم يأذن الله لهم فيرفعون ويضرب الله الصراط بين ظهراني جهنم كحد الشفرة أو كحد السيف عليه كلاليب وخطاطيف وحسك كحسك السعدان دونه جسر دحض مزلة فيمرون كطرف العين أو كلمح البرق أو كمر الريح أو كجياد الخيل أو كجياد الركاب أو كجياد الرجال فناج سالم وناج مخدوش ومكردس على وجهه في جهنم فإذا أفضى أهل الجنة إلى الجنة قالوا من يشفع لنا إلى ربنا فندخل الجنة؟ فيقولون من أحق بذلك من أبيكم آدم عليه السلام خلقه الله بيده ونفخ فيه من روحه وكلمه قبلا فيأتون آدم فيطلب ذلك إليه فيذكر ذنبا ويقول ما أنا بصاحب ذلك ولكن عليكم بنوح فإنه أول رسل الله فيؤتى نوح فيطلب ذلك إليه فيذكر ذنبا ويقول ما أنا بصاحب ذلك ويقول عليكم بإبراهيم فإن الله اتخذه خليلا فيؤتى إبراهيم فيطلب ذلك إليه فيذكر ذنب ويقول ما أنا بصاحب ذلك ويقول عليكم بموسى فإن الله قربه نجيبا وكلمه وأنزل عليه التوراة فيؤتى موسى فيطلب ذلك إليه فيذكر ذنبا ويقول لست بصاحب ذلك ولكن عليكم بروح الله وكلمته عيسى ابن مريم فيؤتى عيسى ابن مريم فيطلب ذلك إليه فيقول ما أنا بصاحبكم ولكن عليكم بمحمد قال رسول الله صلى الله عليه وسلم فيأتوني ولي عند ربي ثلاث شفاعات وعدنيهن فأنطلق فآتى الجنة فآخذ بحلقة الباب فأستفتح فيفتح لي فأحيا ويرحب بي فإذا دخلت الجنة فنظرت إلى ربي خررت ساجدا فيأذن الله لي من تحميده وتمجيده بشيء ما أذن به لأحد من خلقه ثم يقول ارفع رأسك يا محمد واشفع تشفع وسل تعطه فإذا رفعت رأسي يقول الله - وهو أعلم - ما شأنك؟ فأقول يا رب وعدتنى الشفاعة فشفعني في أهل الجنة فيدخلون الجنة فيقول الله قد شفعتك وقد أذنت لهم في دخول الجنة وكان رسول الله صلى الله عليه وسلم يقول والذي نفسي بيده ما أنتم في الدنيا بأعرف بأزواجكم ومساكنكم من أهل الجنة بأزواجهم ومساكنهم فيدخل كل رجل منهم على اثنتين وسبعين زوجة سبعين مما ينشئ الله عز وجل واثنتين آدميتين من ولد آدم لهما فضل على من أنشأ الله لعبادتهما الله في الدنيا فيدخل على الأولى في غرفة من ياقوتة على سرير من ذهب مكلل باللؤلؤ عليها سبعون زوجا من سندس وإستبرق ثم إنه يضع يده بين كتفيها ثم ينظر إلى يده من صدرها ومن وراء ثيابها وجلدها ولحمها وإنه لينظر إلى مخ ساقها كما ينظر أحدكم إلى السلك في قصبة الياقوت كبدها له مرآة وكبده لها مرآة فبينا هو عندها لا يملها ولا تمله ما يأتيها من مرة إلا وجدها عذراء ما يفتر ذكره وما تشتكي قبلها فبينا هو كذلك إذ نودي إنا قد عرفنا أنك لا تمل ولا تمل إلا أنه لا مني ولا منية إلا أن لك أزواجا غيرها فيخرج فيأتيهن واحدة واحدة كلما أتى واحدة قالت له والله ما أرى في الجنة شيئا أحسن منك ولا في الجنة شيء أحب إلي منك. وإذا وقع أهل النار في النار وقع فيها خلق من خلق ربك أوبقتهم أعمالهم فمنهم من تأخذ النار قدميه لا تجاوز ذلك ومنهم من تأخذه إلى أنصاف ساقيه ومنهم من تأخذه إلى ركبتيه ومنهم من تأخذه إلى حقويه ومنهم من تأخذ جسده كله إلا وجهه حرم الله صورته عليها قال رسول الله صلى الله عليه وسلم فأقول يا رب شفعني فيمن وقع في النار من أمتي فيقول أخرجوا من عرفتم فيخرج أولئك حتى لا يبقى منهم أحد ثم يأذن الله في الشفاعة فلا يبقى نبي ولا شهيد إلا شفع فيقول الله أخرجوا من وجدتم في قلبه زنة دينار إيمانا فيخرج أولئك حتى لا يبقى منهم أحد ثم يشفع الله فيقول أخرجوا من وجدتم في قلبه إيمانا ثلثي دينار ثم يقول ثلث دينار ثم يقول ربع دينار ثم يقول قيراطا ثم يقول حبة من خردل فيخرج أولئك حتى لا يبقى منهم أحد وحتى لا يبقى في النار من عمل لله خيرا قط ولا يبقى أحد له شفاعة إلا شفع حتى إن إبليس يتطاول مما يرى من رحمة الله رجاء أن يشفع له. ثم يقول بقيت وأنا أرحم الراحمين فيدخل يده في جهنم فيخرج منها ما لا يحصيه غيره كأنهم حمم فيلقون على نهر يقال له نهر الحيوان فينبتون كما تنبت الحبة في حميل السيل فما يلي الشمس منها أخيضر وما يلي الظل منها أصيفر فينبتون كنبات الطراثيث حتى يكونوا أمثال الذر مكتوب في رقابهم الجهنميون عتقاء الرحمن يعرفهم أهل الجنة بذلك الكتاب ما عملوا خيرا لله قط فيمكثون في الجنة ما شاء الله وذلك الكتاب في رقابهم ثم يقولون ربنا امح عنا هذا الكتاب فيمحوه الله عز وجل عنهم. ثم ذكر بطوله ثم قال هذا حديث مشهور وهو غريب جدا ولبعضه شواهد في الأحاديث المتفرقة وفي بعض ألفاظه نكارة تفرد به إسماعيل بن رافع قاضي أهل المدينة وقد اختلف فيه فمنهم من وثقه ومنهم من ضعفه ونص على نكارة حديثه غير واحد من الأئمة كأحمد بن حنبل وأبي حاتم الرازي وعمرو بن علي الفلاس ومنهم من قال فيه هو متروك وقال ابن عدي أحاديثه كلها فيها نظر إلا أنه يكتب حديثه في جملة الضعفاء قلت وقد اختلف عليه في إسناد هذا الحديث على وجوه كثيرة قد أفردتها في جزء على حدة وأما سياقه فغريب جدا ويقال إنه جمعه من أحاديث كثيرة وجعله سياقا واحدا فأنكر عليه بسبب ذلك وسمعت شيخنا الحافظ أبا الحجاج المزي يقول إنه رأى للوليد بن مسلم مصنفا قد جمعه كالشواهد لبعض مفردات هذا الحديث فالله أعلم."
    },
    {
      "ayah": 74,
      "surah": 6,
      "text": "قال الضحاك عن ابن عباس إن أبا إبراهيم لم يكن اسمه آزر وإنما كان اسمه تارخ رواه ابن أبي حاتم وقال أيضا حدثنا أحمد بن عمرو بن أبي عاصم النبيل حدثنا أبي حدثنا أبو عاصم شبيب حدثنا عكرمة عن ابن عباس في قوله \"وإذ قال إبراهيم لأبيه آزر\" يعني بآزر الصنم وأبو إبراهيم اسمه تارخ وأمه اسمها شاني وامرأته اسمها سارة وأم اسماعيل اسمها هاجر وهي سرية إبراهيم. وهكذا قال غير واحد من علماء النسب أن اسمه تارخ وقال مجاهد والسدي آزر اسم صنم قلت كأنه غلب عليه آزر لخدمته ذلك الصنم فالله أعلم وقال ابن جرير وقال آخرون هو سب وعيب بكلامهم ومعناه معوج ولم يسنده ولا حكاه عن أحد. وقد قال أبن أبي حاتم ذكر عن معتمر بن سليمان سمعت أبي يقرأ \"وإذ قال إبراهيم لأبيه آزر\" قال بلغني أنها أعوج وأنها أشد كلمة قالها إبراهيم عليه السلام ثم قال ابن جرير والصواب أن اسم أبيه آزر ثم أورد على نفسه قول النسابين أن اسمه تارخ ثم أجاب بأنه قد يكون له اسمان كما لكثير من الناس أو يكون أحدهما لقبا وهذا الذي قاله جيد قوي والله أعلم واختلف القراء في أداء قوله تعالى \"وإذ قال إبراهيم لأبيه آزر\" فحكى ابن جرير عن الحسن البصري وأبي يزيد المدني أنهما كانا يقرآن \"وإذ قال إبراهيم لأبيه آزر أتتخذ أصناما آلهة\" معناه يا آزر أتتخذ أصناما آلهة وقرأ الجمهور بالفتح إما على أنه علم أعجمي لا ينصرف وهو بدل من قوله لأبيه أو عطف بيان وهو أشبه وعلى قول من جعله نعتا لا ينصرف أيضا كأحمر وأسود فأما من زعم أنه منصوب لكونه معمولا لقوله \"أتتخذ أصناما\" تقديره يا أبت أتتخذ آزر أصناما آلهة فإنه قول بعيد في اللغة فإن ما بعد حرف الاستفهام لا يعمل فيما قبله لأن له صدر الكلام. كذا قرره ابن جرير وغيره وهو مشهور في قواعد العربية والمقصود أن إبراهيم وعظ أباه في عبادة الأصنام وزجره عنها ونهاه فلم ينته كما قال \"وإذ قال إبراهيم لأبيه آزر أتتخذ أصناما آلهة\" أي أتتأله لصنم تعبده من دون الله \"إني أراك وقومك\" أي السالكين مسلكك \"في ضلال مبين\" أي تائهين لا يهتدون أين يسلكون بل في حيرة وجهل وأمركم في الجهالة والضلال بين واضح لكل ذي عقل سليم. وقال تعالى \"واذكر في الكتاب إبراهيم إنه كان صديقا نبيا إذ قال لأبيه يا أبت لم تعبد ما لا يسمع ولا يبصر ولا يغني عنك شيئا يا أبت إني قد جاءني من العلم ما لم يأتك فاتبعني أهدك صراطا سويا يا أبت لا تعبد الشيطان إن الشيطان كان للرحمن عصيا يا أبت إني أخاف أن يمسك عذاب من الرحمن فتكون للشيطان وليا قال أراغب أنت عن آلهتي يا إبراهيم لئن لم تنته لأرجمنك واهجرني مليا قال سلام عليك سأستغفر لك ربي إنه كان بي حفيا وأعتزلكم وما تدعون من دون الله وأدعو ربي عسى أن لا أكون بدعاء ربي شقيا\" فكان إبراهيم عليه السلام يستغفر لأبيه مدة حياته فلما مات على الشرك وتبين إبراهيم ذلك رجع عن الاستغفار له وتبرأ منه كما قال تعالى \"وما كان استغفار إبراهيم لأبيه إلا عن موعدة وعدها إياه فلما تبين له أنه عدو لله تبرأ منه إن إبرهيم لأواه حليم\" وثبت في الصحيح أن إبراهيم يلقى أباه آزر يوم القيامة فيقول له آزر يا بني اليوم لا أعصيك فيقول إبراهيم أي رب ألم تعدني أنك لا تخزني يوم يبعثون وأي خزي أخزى من أبي الأبعد؟ فيقال يا إبراهيم انظر ما وراءك فإذا هو بذبح متلطخ فيؤخذ بقوائمه فيلقى في النار."
    },
    {
      "ayah": 75,
      "surah": 6,
      "text": "وقوله \"وكذلك نري إبراهيم ملكوت السموات والأرض\" أي نبين له وجه الدلالة في نظره إلى خلقهما على وحدانية الله عز وجل في ملكه وخلقه وأنه لا إله غيره ولا رب سواه كقوله \"قل انظروا ماذا في السموات والأرض\" وقوله \"أو لم ينظروا في ملكوت السموات والأرض\" وقال \"أفلم يروا ما بين أيديهم وما خلفهم من السماء والأرض إن نشأ نخسف بهم الأرض أو نسقط عليهم كسفا من السماء إن في ذلك لآية لكل عبد منيب\" وأما ما حكاه ابن جرير وغيره عن مجاهد وعطاء وسعيد بن جبير والسدي وغيرهم. قالوا واللفظ لمجاهد فرجت له السموات فنظر إلى ما فيهن حتى انتهى بصره إلى العرش وفرجت له الأرضون السبع فنظر إلى ما فيهن وزاد غيره فجعل ينظر إلى العباد على المعاصي ويدعو عليهم فقال الله له إني أرحم بعبادي منك لعلهم أن يتوبوا أو يرجعوا. وروى ابن مردوية في ذلك حديثين مرفوعين عن معاذ وعلي ولكن لا يصح إسنادهما والله أعلم. وروى ابن أبي حاتم من طريق العوفي عن ابن عباس في قوله \"وكذلك نري إبراهيم ملكوت السموات والأرض وليكون من الموقنين\" فإنه تعالى جلى له الأمر سره وعلانيته فلم يخف عليه شيء من أعمال الخلائق فلما جعل يلعن أصحاب الذنوب قال الله إنك لا تسطيع هذا فرده الله كما كان قبل ذلك فيحتمل أن يكون كشف له عن بصره حتى رأى ذلك عيانا ويحتمل أن يكون عن بصيرته حتى شاهده بفؤاده وتحققه وعرفه وعلم ما في ذلك من الحكم الباهرة والدلالات القاطعة كما رواه الإمام أحمد والترمذي وصححه عن معاذ بن جبل في حديث المنام\" أتاني ربي في أحسن صورة فقال يا محمد فيم يختصم الملأ الأعلى؟ فقلت لا أدري يا رب فوضع يده بين كتفي حتى وجدت برد أنامله بين ثدي فتجلى لي كل شيء وعرفت ذلك.وذكر الحديث. وقوله \"وليكون من الموقنين\" قيل الواو زائدة تقديره وكذلك نري إبراهيم ملكوت السموات والأرض ليكون من الموقنين كقوله \"وكذلك نفصل الآيات ولتستبين سبيل المجرمين\" وقيل: بل هي على بابها أي نريه ذلك ليكون عالما وموقنا."
    },
    {
      "ayah": 76,
      "surah": 6,
      "text": "وقوله تعالى \"فلما جن عليه الليل\" أي تغشاه وستره \"رأى كوكبا\" أي نجما \"قال هذا ربي فلما أفل\" أي غاب قال محمد بن إسحاق بن يسار الأفول الذهاب وقال ابن جرير يقال أفل النجم يأفل ويأفل أفولا وأفلا إذا غاب ومنه قول ذي الرمة: مصابيح ليست باللواتي تقودها دياج ولا بالآفلات الزوائل ويقال أين أفلت عنا بمعنى أين غبت عنا: قال \"لا أحب الآفلين\" قال قتادة علم أن ربه دائم لا يزول."
    },
    {
      "ayah": 77,
      "surah": 6,
      "text": "\"فلما رأى القمر بازغا\" أي طالعا قال هذا ربي فلما أفل قال لئن لم يهدني ربي لأكونن من القوم الضالين."
    },
    {
      "ayah": 78,
      "surah": 6,
      "text": "\"فلما رأى الشمس بازغة قال هذا ربي\" أي هذا المنير الطالع ربي \"هذا أكبر\" أي جرما من النجم ومن القمر وأكثر إضاءة \"فلما أفلت\" أي غابت \"قال يا قوم إنى بريء مما تشركون\"."
    },
    {
      "ayah": 79,
      "surah": 6,
      "text": "أي أخلصت ديني وأفردت عبادتي \"للذي فطر السموات والأرض\" أي خلقهما وابتدعهما على غير مثال سبق \"حنيفا\" أي في حال كوني حنيفا أي مائلا عن الشرك إلى التوحيد ولهذا قال \"وما أنا من المشركين\" وقد اختلف المفسرون في هذا المقام هل هو مقام نظر أو مناظرة فروى ابن جرير من طريق علي بن أبي طلحة عن ابن عباس ما يقتضي أنه مقام نظر واختاره ابن جرير مستدلا بقوله \"لئن لم يهدني ربي\" الآية. وقال محمد بن إسحاق قال ذلك حين خرج من السرب الذي ولدته فيه أمه حين تخوفت عليه من نمرود بن كنعان لما كان قد أخبر بوجود مولود يكون ذهاب ملكه على يديه فأمر بقتل الغلمان عامئذ فلما حملت أم إبراهيم به وحان وضعها ذهبت به إلى سرب ظاهر البلد فولدت فيه إبراهيم وتركته هناك وذكر أشياء من خوارق العادات كما ذكرها غيره من المفسرين من السلف والخلف والحق أن إبراهيم عليه الصلاة والسلام كان في هذا المقام مناظرا لقومه مبينا لهم بطلان ما كانوا عليه من عبادة الهياكل والأصنام فبين في المقام الأول مع أبيه خطأهم في عبادة الأصنام الأرضية التي هي على صور الملائكة السماوية ليشفعوا لهم إلى الخالق العظيم الذين هم عند أنفسهم أحقر من أن يعبدوه وإنما يتوسلون إليه بعبادة ملائكته ليشفعوا لهم عنده في الرزق والنصر وغير ذلك مما يحتاجون إليه. وبين في هذا المقام خطأهم وضلالهم في عبادة الهياكل وهي الكواكب السيارة السبعة المتحيرة وهي القمر وعطارد والزهرة والشمس والمريخ والمشترى وزحل وأشدهن إضاءة وأشرفهن عندهم الشمس ثم القمر ثم الزهرة فبين أولا صلوات الله وسلامه عليه أن هذه الزهرة لا تصلح للإلهية فإنها مسخرة مقدرة بسير معين لا تزيغ عنه يمينا ولا شمالا ولا تملك لنفسها تصرفا بل هي جرم من الأجرام خلقها الله منيرة لما له في ذلك من الحكم العظيمة وهي تطلع من المشرق ثم تسير فيما بينه وبين المغرب حتى تغيب عن الأبصار فيه ثم تبدو في الليلة القابلة على هذا المنوال ومثل هذه لا تصلح للإلهية ثم انتقل إلى القمر فبين فيه مثل ما بين في النجم ثم انتقل إلى الشمس كذلك فلما انتفت الإلهية عن هذه الأجرام الثلاثة التي هي أنور ما يقع عليه الأبصار وتحقق ذلك بالدليل القاطع \"قال يا قوم إني بريء مما تشركون\" أي أنا بريء من عبادتهن وموالاتهن فإن كانت آلهة فكيدون بها جميعا ثم لا تنظرون \"إني وجهت وجهي للذي فطر السموات والأرض حنيفا وما أنا من المشركين\" أي إنما أعبد خالق هذه الأشياء ومخترعها ومسخرها ومقدرها ومدبرها الذي بيده ملكوت كل شيء وخالق كل شيء وربه ومليكه وإلهه كما قال تعالى \"إن ربكم الله الذي خلق السموات والأرض في ستة أيام ثم استوى على العرش يغشى الليل النهار يطلبه حثيثا والشمس والقمر والنجوم مسخرات بأمره ألا له الخلق والأمر تبارك الله رب العالمين\" وكيف يجوز أن يكون إبراهيم ناظرا في هذا المقام وهو الذي قال الله في حقه \"ولقد آتينا إبراهيم رشده من قبل وكنا به عالمين إذ قال لأبيه وقومه ما هذه التماثيل التي أنتم لها عاكفون\" الآيات وقال تعالى \"إن إبراهيم كان أمة قانتا لله حنيفا ولم يك من المشركين شاكرا لأنعمه اجتباه وهداه إلى صراط مستقيم وآتيناه في الدنيا حسنة وإنه في الآخرة لمن الصالحين ثم أوحينا إليك أن اتبع ملة إبراهيم حنيفا وما كان من المشركين\" وقال تعالى \"قل إنني هداني ربي إلى صراط مستقيم دينا قيما ملة إبراهيم حنيفا وما كان من المشركين\" وقد ثبت في الصحيحين عن أبي هريرة عن رسول الله صلى الله عليه وسلم أنه قال \"كل مولود يولد على الفطرة\" وفي صحيح مسلم عن عياض بن حماد أن رسول الله صلى الله عليه وسلم قال \"قال الله إني خلقت عبادي حنفاء\".وقال الله في كتابه العزيز \"فطرت الله التي فطر الناس عليها لا تبديل لخلق الله\" وقال تعالى \"وإذ أخذ ربك من بني آدم من ظهورهم ذريتهم وأشهدهم على أنفسهم ألست بربكم قالوا بلى\" ومعناه على أحد القولين كقوله \"فطرت الله التي فطر الناس عليها\" كما سيأتي بيانه فإذا كان هذا في حق سائر الخليقة فكيف يكون إبراهيم الخليل الذي جعله الله أمة قانتا لله حنيفا ولم يك من المشركين ناظرا في هذا المقام بل هو أولى الناس بالفطرة السليمة والسجية المستقيمة بعد رسول الله صلى الله عليه وسلم بلا شك ولا ريب ومما يؤيد أنه كان في هذا المقام مناظرا لقومه فيما كانوا فيه من الشرك لا ناظرا قوله تعالى."
    },
    {
      "ayah": 8,
      "surah": 6,
      "text": "\"وقالوا لولا أنزل عليه ملك\" أي ليكون معه نذيرا قال الله تعالى \"ولو أنزلنا ملكا لقضي الأمر ثم لا ينظرون\" أي لو نزلت الملائكة على ما هم عليه لجاءهم من الله العذاب.كما قال الله تعالى \"ما ننزل الملائكة إلا بالحق وما كانوا إذا منظرين\" وقوله \"يوم يرون الملائكة لا بشرى يومئذ للمجرمين\" الآية."
    },
    {
      "ayah": 80,
      "surah": 6,
      "text": "يقول تعالى مخبرا عن خليله إبراهيم حين جادله قومه فيما ذهب إليه من التوحيد وناظروه بشبه من القول أنه قال \"أتحاجوني في الله وقد هدان\" أي تجادلونني في أمر الله وأنه لا إله إلا هو وقد بصرني وهداني إلى الحق وأنا على بينة منه فكيف ألتفت إلى أقوالكم الفاسدة وشبهكم الباطلة وقوله \"ولا أخاف ما تشركون به إلا أن يشاء ربى شيئا\" أي ومن الدليل على بطلان قولكم فيما ذهبتم إليه أن هذه الآلهة التي تعبدونها لا تؤثر شيئا وأنا لا أخافها ولا أباليها فإن كان لها كيد فكيدوني بها ولا تنظرون بل عاجلوني بذلك. وقوله تعالى \"إلا أن يشاء ربي شيئا\" استثناء منقطع أي لا يضر ولا ينفع إلا الله عز وجل \"وسع ربي كل شئ علما\" أي أحاط علمه بجميع الأشياء فلا يخفى عليه خافية \"أفلا تتذكرون\" أي فيما بينته لكم أفلا تعتبرون أن هذه الآلهة باطلة فتنزجروا عن عبادتها وهذه الحجة نظير ما احتج بها نبي الله هود عليه السلام على قومه عاد فيما قص عنهم في كتابه حيث يقول \"قالوا يا هود ما جئتنا ببينة وما نحن بتاركي آلهتنا عن قولك وما نحن لك بمؤمنين إن نقول إلا اعتراك بعض آلهتنا بسوء قال إني أشهد الله واشهدوا أني بريء مما تشركون من دونه فكيدوني جميعا ثم لا تنظرون إني توكلت على الله ربي وربكم ما من دابة إلا هو آخذ بناصيتها\" الآية."
    },
    {
      "ayah": 81,
      "surah": 6,
      "text": "وقوله \"وكيف أخاف ما أشركتم\" أي كيف أخاف من هذه الأصنام التي تعبدونها من دون الله \"ولا تخافون أنكم أشركتم بالله ما لم ينزل به عليكم سلطانا\" قال ابن عباس وغير واحد من السلف أي حجة وهذا كقوله تعالى \"أم لهم شركاء شرعوا لهم من الدين ما لم يأذن به الله\" وقوله تعالى \"إن هي إلا أسماء سميتموها أنتم وآباؤكم ما أنزل الله بها من سلطان\" وقوله \"فأي الفريقين أحق بالأمن إن كنتم تعلمون\" أي فأي الطائفتين أصوب الذي عبد من بيده الضر والنفع أو الذي عبد من لا يضر ولا ينفع بلا دليل أيهما أحق بالأمن من عذاب الله يوم القيامة لا شريك له."
    },
    {
      "ayah": 82,
      "surah": 6,
      "text": "قال الله تعالى \"الذين آمنوا ولم يلبسوا إيمانهم بظلم أولئك لهم الأمن وهم مهتدون\" أي هؤلاء الذين أخلصوا العبادة لله وحده لا شريك له ولم يشركوا به شيئا هم الآمنون يوم القيامة المهتدون في الدنيا والآخرة. قال البخاري حدثنا محمد بن بشار حدثنا ابن أبي عدي عن شعبة عن سليمان عن إبراهيم عن علقمة عن عبد الله قال لما نزلت \"ولم يلبسوا إيمانهم بظلم\" قال أصحابه وأينا لم يظلم نفسه؟ فنزلت \"إن الشرك لظلم عظيم\" وقال الإمام أحمد حدثنا أبو معاوية حدثنا الأعمش عن إبراهيم عن علقمة عن عبد الله قال لما نزلت هذه الآية \"الذين آمنوا ولم يلبسوا إيمانهم بظلم\" شق ذلك على الناس فقالوا يا رسول الله أينا لم يظلم نفسه؟ قال إنه ليس الذي تعنون ألم تسمعوا ما قال العبد الصالح \"يا بني لا تشرك بالله إن الشرك لظلم عظيم\" إنما هو الشرك. وقال ابن أبي حاتم حدثنا أبو سعيد الأشج حدثنا وكيع وابن إدريس عن الأعمش إبراهيم عن علقمة عن عبد الله قال لما نزلت \"ولم يلبسوا إيمانهم بظلم\" شق ذلك على أصحاب رسول الله صلى الله عليه وسلم قالوا وأينا لم يظلم نفسه؟ فقال رسول الله صلى الله عليه وسلم ليس كما تظنون إنما قال لابنه \"يا بني لا تشرك بالله إن الشرك لظلم عظيم\" وحدثنا عمر بن تغلب النمري حدثنا أبو أحمد حدثنا سفيان عن الأعمش عن إبراهيم عن علقمة عن عبد الله بن مسعود قال لما نزلت هذه الآية شق ذلك على أصحاب رسول الله صلى الله عليه وسلم فنزلت \"إن الشرك لظلم عظيم\".رواه البخاري وفي لفظ قالوا أينا لم يظلم نفسه فقال النبي صلى الله عليه وسلم ليس بالذي تعنون ألم تسمعوا ما قال العبد الصالح \"إن الشرك لظلم عظيم\" إنما هو الشرك ولابن أبي حاتم عن عبد الله مرفوعا قال \"ولم يلبسوا إيمانهم بظلم\" قال بشرك قال وروي عن أبي بكر الصديق وعمر وأبي بن كعب وسلمان وحذيفة وابن عباس وابن عمر وعمرو بن شرحبيل وأبي عبد الرحمن السلمي ومجاهد وعكرمة والنخعي والضحاك وقتادة والسدي وغير واحد نحو ذلك وقال ابن مردوية حدثنا الشافعي حدثنا محمد بن شداد المسمعي حدثنا أبو عاصم حدثنا سفيان الثوري عن الأعمش عن إبراهيم عن علقمة عن عبد الله قال لما نزلت \"الذين آمنوا ولم يلبسوا إيمانهم بظلم\" قال رسول الله صلى الله عليه وسلم قيل لي أنت منهم.وقال الإمام أحمد حدثنا إسحاق بن يوسف حدثنا أبو جناب عن زاذان عن جرير بن عبد الله قال: خرجنا مع رسول الله صلى الله عليه وسلم فلما برزنا من المدينة إذا راكب يوضع نحونا فقال رسول الله صلى الله عليه وسلم: كأن هذا الراكب إياكم يريد فانتهى إلينا الرجل فسلم فرددنا عليه فقال له النبي صلى الله عليه وسلم من أين أقبلت؟ قال من أهلي وولدي وعشيرتي قال فأين تريد؟ قال أريد رسول الله صلى الله عليه وسلم قال فقد أصبته قال يا رسول الله علمني ما الإيمان قال أن تشهد أن لا إله إلا الله وأن محمدا رسول الله وتقيم الصلاة وتؤتي الزكاة وتصوم رمضان وتحج البيت قال قد أقررت. قال ثم إن بعيره دخلت يده في جحر جرذان فهوى بعيره وهوى الرجل فوقع على هامته فمات فقال: رسول الله صلى الله عليه وسلم علي بالرجل فوثب إليه عمار بن ياسر وحذيفة بن اليمان فأقعداه فقالا: يا رسول الله قبض الرجل قال فأعرض عنهما رسول الله صلى الله عليه وسلم ثم قال لهما رسول الله صلى الله عليه وسلم أما رأيتما إعراضي عن الرجل فإنى رأيت ملكين يدسان في فيه من ثمار الجنة فعلمت أنه مات جائعا ثم قال رسول الله صلى الله عليه وسلم هذا من الذين قال الله عز وجل فيهم \"الذين آمنوا ولم يلبسوا إيمانهم بظلم\" الآية ثم قال دونكم أخاكم فاحتملناه إلى الماء فغسلناه وحنطناه وكفناه وحملناه إلى القبر فجاء رسول الله صلى الله عليه وسلم حتى جلس على شفير القبر فقال ألحدوا ولا تشقوا فإن اللحد لنا والشق لغيرنا.ثم رواه أحمد عن أسود بن عامر عن عبد الحميد بن جعفر الفراء عن ثابت عن زاذان عن جرير بن عبد الله فذكر نحوه وقال فيه هذا ممن عمل قليلا وأجر كثيرا; وقال ابن أبى حاتم حدثنا أبي حدثنا يوسف بن موسى القطان حدثنا مهران بن أبي عمر حدثنا علي بن عبد الله عن أبيه عن سعيد بن جبير عن ابن عباس قال: كنا مع رسول الله صلى الله عليه وسلم في مسير ساره إذ عرض له أعرابي فقال يا رسول الله والذي بعثك بالحق لقد خرجت من بلادي وتلادي ومالي لأهتدي بهداك وآخذ من قولك وما بلغتك حتى مالي طعام إلا من خضر الأرض فاعرض علي فعرض عليه رسول الله صلى الله عليه وسلم فقبل فازدحمنا حوله فدخل خف بكره في بيت جردان فتردى الأعرابي فانكسرت عنقه فقال رسول الله صلى الله عليه وسلم صدق والذي بعثني بالحق لقد خرج من بلاده وتلاده وماله ليهتدي بهداي ويأخذ من قولي وما بلغني حتى ماله طعام إلا من خضر الأرض أسمعتم بالذي عمل قليلا وأجر كثيرا؟ هذا منهم أسمعتم بالذين آمنوا ولم يلبسوا إيمانهم بظلم أولئك لهم الأمن وهم مهتدون؟ فإن هذا منهم. وفي لفظ قال هذا عمل قليلا وأجر كثيرا وروى ابن مردوية من حديث محمد بن يعلى الكوفي وكان نزل الري حدثنا زياد بن خيثمة عن أبي داود عن عبد الله بن سخبرة قال: قال رسول الله صلى الله عليه وآله وسلم من أعطي فشكر ومنع فصبر وظلم فاستغفر وظلم فغفر وسكت قال: فقالوا يا رسول الله ماله؟ قال \"أولئك لهم الأمن وهم مهتدون\" وقوله \"وتلك حجتنا آتيناها إبراهيم على قومه\" أي وجهنا حجته عليهم قال مجاهد وغيره يعني بذلك قوله \"وكيف أخاف ما أشركتم ولا تخافون أنكم أشركتم بالله ما لم ينزل به عليكم سلطانا فأي الفريقين أحق بالأمن\" الآية. وقد صدقه الله وحكم له بالأمن والهداية فقال \"الذين آمنوا ولم يلبسوا إيمانهم بظلم أولئك لهم الأمن وهم مهتدون\"."
    },
    {
      "ayah": 83,
      "surah": 6,
      "text": "ثم قال بعد ذلك كله \"وتلك حجتنا آتيناها إبراهيم على قومه نرفع درجات من نشاء\" قرئ بالإضافة وبلا إضافة كما في سورة يوسف وكلاهما قريب في المعنى وقوله \"إن ربك حكيم عليم\" أي حكيم في أقواله وأفعاله عليم أي بمن يهديه ومن يضله وإن قامت عليه الحجج والبراهين كما قال \"إن الذين حقت عليهم كلمة ربك لا يؤمنون ولو جاءتهم كل آية حتى يروا العذاب الأليم\" ولهذا قال ههنا \"إن ربك حكيم عليم\"."
    },
    {
      "ayah": 84,
      "surah": 6,
      "text": "يذكر تعالى أنه وهب لإبراهيم إسحاق بعد أن طعن في السن وأيس هو وامرأته سارة من الولد فجاءته الملائكة وهم ذاهبون إلى قوم لوط فبشروهما بإسحاق فتعجبت المرأة من ذلك وقالت \"يا ويلتى أألد وأنا عجوز وهذا بعلي شيخا إن هذا لشيء عجيب قالوا أتعجبين من أمر الله رحمة الله وبركاته عليكم أهل البيت إنه حميد مجيد\" فبشروهما مع وجوده بنبوته وبأن له نسلا وعقبا كما قال تعالى \"وبشرناه بإسحاق نبيا من الصالحين\" وهذا أكمل في البشارة وأعظم في النعمة. وقال \"فبشرناه بإسحاق ومن وراء إسحاق يعقوب\" أي ويولد لهذا المولود ولد في حياتكما فتقر أعينكما به كما قرت بوالده فإن الفرح بولد الولد شديد لبقاء النسل والعقب ولما كان ولد الشيخ والشيخة قد يتوهم أنه لا يعقب لضعفه وقعت البشارة به وبولده باسم يعقوب الذي فيه اشتقاق العقب والذرية وكان هذا مجازاة لإبراهيم عليه السلام حين اعتزل قومه وتركهم ونزح عنهم وهاجر من بلادهم ذاهبا إلى عبادة الله في الأرض فعوضه الله عز وجل عن قومه وعشيرته بأولاد صالحين من صلبه على دينه لتقر بهم عينه كما قال تعالى \"فلما اعتزلهم وما يعبدون من دون الله وهبنا له إسحاق ويعقوب وكلا جعلنا نبيا\" وقال ههنا \"ووهبنا له إسحاق ويعقوب كلا هدينا\" وقوله \"ونوحا هدينا من قبل\" أي من قبله هديناه كما هديناه ووهبنا له ذرية صالحة وكل منهما له خصوصية عظيمة أما نوح عليه السلام فإن الله تعالى لما أغرق أهل الأرض إلا من آمن به وهم الذين صحبوه في السفينة جعل الله ذريته هم الباقين فالناس كلهم من ذريته وأما الخليل إبراهيم عليه السلام فلم يبعث الله عز وجل بعده نبيا إلا من ذريته كما قال تعالى \"وجعلنا في ذريتهما النبوة والكتاب\" الآية. وقال تعالى \"ولقد أرسلنا نوحا وإبراهيم وجعلنا في ذريتهما النبوة والكتاب\" وقال تعالى \"أولئك الذين أنعم الله عليهم من النبيين من ذرية آدم وممن حملنا مع نوح ومن ذرية إبراهيم وإسرائيل وممن هدينا واجتبينا إذا تتلى عليهم آيات الرحمن خروا سجدا وبكيا\" وقوله في هذه الآية الكريمة \"ومن ذريته\" أي وهدينا من ذريته \"داود وسليمان\" الآية وعود الضمير إلى نوح لأنه أقرب المذكورين ظاهر لا إشكال فيه وهو اختيار ابن جرير. وعوده إلى إبراهيم لأنه الذي سيق الكلام من أجله حسن لكن يشكل عليه لوط فإنه ليس من ذرية إبراهيم بل هو ابن أخيه هاران بن آزر اللهم إلا أن يقال إنه دخل في الذرية تغليبا كما في قوله \"أم كنتم شهداء إذ حضر يعقوب الموت إذ قال لبنيه ما تعبدون من بعدي قالوا: نعبد إلهك وإله آبائك إبراهيم وإسماعيل وإسحاق إلها واحدا ونحن له مسلمون\" فإسماعيل عمه دخل في آبائه تغليبا وكما قال في قوله \"فسجد الملائكة كلهم أجمعون إلا إبليس\" فدخل إبليس في أمر الملائكة بالسجود وذم على المخالفة لأنه كان في تشبه بهم فعومل معاملتهم ودخل معهم تغليبا وإلا فهو كان من الجن وطبيعته من النار والملائكة من النور وفي ذكر عيسى عليه السلام في ذرية إبراهيم أو نوح على القول الآخر دلالة على دخول ولد البنات في ذرية الرجل لأن عيسى عليه السلام إنما ينسب إلى إبراهيم عليه السلام بأمه مريم عليها السلام فإنه لا أب له. قال ابن أبي حاتم حدثنا سهل بن يحيى العسكري حدثنا عبد الرحمن بن صالح حدثنا علي بن عابس عن عبد الله بن عطاء المكي عن أبي حرب بن أبي الأسود قال أرسل الحجاج إلى يحيى بن يعمر فقال بلغني أنك تزعم أن الحسن والحسين من ذرية النبي صلى الله عليه وآله وسلم تجده في كتاب الله - وقد قرأته من أوله إلى آخره فلم أجده؟ قال أليس تقرأ سورة الأنعام \"ومن ذريته داود وسليمان\" حتى بلغ \"ويحيى وعيسى\" قال بلى. قال أليس عيسى من ذرية إبراهيم وليس له أب؟ قال صدقت. فلهذا إذا أوصى الرجل لذريته أو وقف على ذريته أو وهبهم دخل أولاد البنات فيهم فأما إذا أعطى الرجل بنيه أو وقف عليهم فإنه يختص بذلك بنوه لصلبه وبنو بنيه واحتجوا بقول الشاعر العربي: بنونا بنو أبنائنا وبناتنا بنوهن أبناء الرجال الأجانب وقال آخرون: ويدخل بنو البنات فيه أيضا لما ثبت في صحيح البخاري أن رسول الله صلى الله عليه وعلى آله وسلم قال للحسن بن علي إن ابني هذا سيد ولعل الله أن يصلح به بين فئتين عظيمتين من المسلمين فسماه ابنا فدل على دخوله في الأبناء. وقال آخرون: هذا تجوز."
    },
    {
      "ayah": 85,
      "surah": 6,
      "text": "وفي ذكر عيسى عليه السلام في ذرية إبراهيم أو نوح على القول الآخر دلالة على دخول ولد البنات في ذرية الرجل لأن عيسى عليه السلام إنما ينسب إلى إبراهيم عليه السلام بأمه مريم عليها السلام فإنه لا أب له. قال ابن أبي حاتم حدثنا سهل بن يحيى العسكري حدثنا عبد الرحمن بن صالح حدثنا علي بن عابس عن عبد الله بن عطاء المكي عن أبي حرب بن أبي الأسود قال أرسل الحجاج إلى يحيى بن يعمر فقال بلغني أنك تزعم أن الحسن والحسين من ذرية النبي صلى الله عليه وآله وسلم تجده في كتاب الله - وقد فرأته من أوله إلى آخره فلم أجده؟ قال أليس تقرأ سورة الأنعام \"ومن ذريته داود وسليمان\" حتى بلغ \"ويحيى وعيسى\" قال بلى. قال أليس عيسى من ذرية إبراهيم وليس له أب؟ قال صدقت. فلهذا إذا أوصى الرجل لذريته أو وقف على ذريته أو وهبهم دخل أولاد البنات فيهم فأما إذا أعطى الرجل بنيه أو وقف عليهم فإنه يختص بذلك بنوه لصلبه وبنو بنيه واحتجوا بقول الشاعر العربي: بنونا بنو أبنائنا وبناتنا بنوهن أبناء الرجال الأجانب وقال آخرون: ويدخل بنو البنات فيه أيضا لما ثبت في صحيح البخاري أن رسول الله صلى الله عليه وعلى آله وسلم قال للحسن بن علي إن ابني هذا سيد ولعل الله أن يصلح به بين فئتين عظيمتين من المسلمين فسماه ابنا فدل على دخوله في الأبناء. وقال آخرون: هذا تجوز."
    },
    {
      "ayah": 86,
      "surah": 6,
      "text": "وعود الضمير إلى نوح لأنه أقرب المذكورين ظاهر لا إشكال فيه وهو اختيار ابن جرير. وعوده إلى إبراهيم لأنه الذي سيق الكلام من أجله حسن لكن يشكل عليه لوط فإنه ليس من ذرية إبراهيم بل هو ابن أخيه هاران بن آزر اللهم إلا أن يقال إنه دخل في الذرية تغليبا كما في قوله \"أم كنتم شهداء إذ حضر يعقوب الموت إذ قال لبنيه ما تعبدون من بعدي قالوا: نعبد إلهك وإله آبائك إبراهيم وإسماعيل وإسحاق إلها واحدا ونحن له مسلمون\" فإسماعيل عمه دخل في آبائه تغليبا وكما قال في قوله \"فسجد الملائكة كلهم أجمعون إلا إبليس\" فدخل إبليس في أمر الملائكة بالسجود وذم على المخالفة لأنه كان في تشبه بهم فعومل معاملتهم ودخل معهم تغليبا وإلا فهو كان من الجن وطبيعته من النار والملائكة من النور."
    },
    {
      "ayah": 87,
      "surah": 6,
      "text": "وقوله \"ومن آبائهم وذرياتهم وإخوانهم\" ذكر أصولهم وفروعهم وذوي طبقتهم وأن الهداية والاجتباء شملهم كلهم ولهذا قال \"واجتبيناهم وهديناهم إلى صراط مستقيم\"."
    },
    {
      "ayah": 88,
      "surah": 6,
      "text": "ثم قال تعالى \"ذلك هدى الله يهدي به من يشاء من عباده\" أي إنما حصل لهم ذلك بتوفيق الله وهدايته إياهم \"ولو أشركوا لحبط عنهم ما كانوا يعملون\" تشديد لأمر الشرك وتغليظ لشأنه وتعظيم لملابسته كقوله تعالى \"ولقد أوحي إليك وإلى الذين من قبلك لئن أشركت ليحبطن عملك\" الآية وهذا شرط والشرط لا يقتضي جواز الوقوع كقوله \"قل إن كان للرحمن ولد فأنا أول العابدين\" وكقوله \"لو أردنا أن نتخذ لهوا لاتخذناه من لدنا إن كنا فاعلين\" وكقوله \"لو أراد الله أن يتخذ ولدا لاصطفى مما يخلق ما يشاء سبحانه هو الله الواحد القهار\"."
    },
    {
      "ayah": 89,
      "surah": 6,
      "text": "وقوله تعالى \"أولئك الذين آتيناهم الكتاب والحكم والنبوة\" أي أنعمنا عليهم بذلك رحمة للعباد بهم ولطفا منه بالخليقة \"فإن يكفر بها\" أي بالنبوة ويحتمل أن يكون الضمير عائدا على هذه الأشياء الثلاثة الكتاب والحكم والنبوة وقوله \"هؤلاء\" يعني أهل مكة قاله ابن عباس وسعيد بن المسيب والضحاك وقتادة والسدي وغير واحد \"فقد وكلنا بها قوما ليسوا بها بكافرين\" أي إن يكفر بهذه النعم من كفر بها من قريش وغيرهم من سائر أهل الأرض من عرب وعجم ومليين وكتابيين فقد وكلنا بها قوما آخرين أي المهاجرين والأنصار وأتباعهم إلى يوم القيامة \"ليسوا بها بكافرين\" أي لا يجحدون منها شيئا ولا يردون منها حرفا واحدا يؤمنون بجميعها محكمها ومتشابهها جعلنا الله منهم بمنه وكرمه وإحسانه."
    },
    {
      "ayah": 9,
      "surah": 6,
      "text": "أي لو أنزلنا مع الرسول البشري ملكا أي لو بعثنا إلى البشر رسولا ملكيا لكان على هيئة الرجل ليمكنهم مخاطبته والانتفاع بالأخذ عنه ولو كان كذلك لالتبس عليهم الأمر كما هم يلبسون علي أنفسهم في قبول رسالة البشري كقوله تعالى \"قل لو كان في الأرض ملائكة يمشون مطمئنين لنزلنا عليهم من السماء ملكا رسولا\" فمن رحمته تعالى بخلقه أنه يرسل إلى كل صنف من الخلائق رسلا منه ليدعو بعضهم بعضا وليمكن بعضهم أن ينتفع ببعض في المخاطبة والسؤال كما قال تعالى \"لقد من الله على المؤمنين إذ بعث فيهم رسولا من أنفسهم يتلو عليهم آياته ويزكيهم\" الآية قال الضحاك عن ابن عباس في الآية: يقول لو أتاهم ملك ما أتاهم إلا في صورة رجل لأنهم لا يستطيعون النظر إلى الملائكة من النور \"وللبسنا عليهم ما يلبسون\" أي ولخلطنا عليهم ما يخلطون وقال الوالبي عنه: ولشبهنا عليهم."
    },
    {
      "ayah": 90,
      "surah": 6,
      "text": "ثم قال تعالى مخاطبا عبده ورسوله محمدا صلى الله عليه وسلم \"أولئك\" يعني الأنبياء المذكورين مع من أضيف إليهم من الآباء والذرية والإخوان وهم الأشباه \"الذين هدى الله\" أي هم أهل الهدى لا غيرهم \"فبهداهم اقتده\" أي اقتد واتبع وإذا كان هذا أمرا للرسول صلى الله عليه وسلم فأمته تبع له فيما يشرعه ويأمرهم به قال البخاري عند هذه الآية: حدثنا إبراهيم بن موسى أخبرنا هشام أن ابن جريج أخبرهم قال أخبرني سليمان الأحول أن مجاهدا أخبره أنه سأل ابن عباس أفي \"ص\" سجدة فقال نعم ثم تلا \"ووهبنا له إسحاق ويعقوب\" إلى قوله \"فبهداهم اقتده\" ثم قال هو منهم زاد يزيد بن هارون ومحمد بن عبيد وسهيل بن يوسف عن العوام عن مجاهد قلت لابن عباس فقال نبيكم صلى الله عليه وعلى آله وسلم ممن أمر أن يقتدي بهم وقوله تعالى \"قل لا أسألكم عليه أجرا\" أي لا أطلب منكم على إبلاغي إياكم هذا القرآن أجرا أي أجرة ولا أريد منكم شيئا \"إن هو إلا ذكرى للعالمين\" أي يتذكرون به فيرشدوا من العمى إلى الهدى ومن الغي إلى الرشاد ومن الكفر إلى الإيمان."
    },
    {
      "ayah": 91,
      "surah": 6,
      "text": "يقول تعالى وما عظموا الله حق تعظيمه إذ كذبوا رسله إليهم: قال ابن عباس ومجاهد وعبد الله بن كثير نزلت في قريش واختاره ابن جرير وقيل نزلت في طائفة من اليهود. وقيل في فنحاص رجل منهم. وقيل في مالك بن الصيف \"قالوا ما أنزل الله على بشر من شيء\" والأول أصح لأن الآية مكية واليهود لا ينكرون إنزال الكتب من السماء وقريش والعرب قاطبة كانوا ينكرون إرسال محمد صلى الله عليه وسلم لأنه من البشر كما قال \"أكان للناس عجبا أن أوحينا إلى رجل منهم أن أنذر الناس\" وكقوله تعالى \"وما منع الناس أن يؤمنوا إذ جاءهم الهدى إلا أن قالوا أبعث الله بشرا رسولا قل لو كان في الأرض ملائكة يمشون مطمئنين لنزلنا عليهم من السماء ملكا رسولا\" وقال ههنا \"وما قدروا الله حق قدره إذ قالوا ما أنزل الله على بشر من شيء\" قال الله تعالى \"قل من أنزل الكتاب الذي جاء به موسى نورا وهدى للناس\" أي قل يا محمد لهؤلاء المنكرين لإنزال شيء من الكتب من عند الله في جواب سلبهم العام بإثبات قضية جزئية موجبة \"من أنزل الكتاب الذي جاء به موسى\" وهو التوراة التي قد علمتم وكل أحد أن الله قد أنزلها على موسى بن عمران نورا وهدى للناس أي ليستضاء بها في كشف المشكلات ويهتدى بها من ظلم الشبهات وقوله \"تجعلونه قراطيس تبدونها وتخفون كثيرا\" أي تجعلون جملتها قراطيس أي قطعا تكتبونها من الكتاب الأصلي الذي بأيديكم وتحرفون منها ما تحرفون وتبدلون وتتأولون وتقولون هذا من عند الله أي في كتابه المنزل وما هو من عند الله ولهذا قال \"تجعلونه قراطيس تبدونها وتخفون كثيرا\" وقوله تعالى \"وعلمتم ما لم تعلموا أنتم ولا آباؤكم\" أي ومن أنزل القرآن الذي علمكم الله فيه من خبر ما سبق ونبأ ما يأتي ما لم تكونوا تعلمون ذلك لا أنتم ولا آباؤكم وقد قال قتادة: هؤلاء مشركو العرب وقال مجاهد هذه للمسلمين وقوله تعالى \"قل الله\" قال علي بن أبي طلحة عن ابن عباس أي قل الله أنزله وهذا الذي قاله ابن عباس هو المتعين في تفسير هذه الكلمة لا ما قاله بعض المتأخرين من أن معنى \"قل الله\" أي لا يكون خطاب لهم إلا هذه الكلمة كلمة \"الله\" وهذا الذي قاله هذا القائل يكون أمرا بكلمة مفردة من غير تركيب والإتيان بكلمة مفردة لا يفيد في لغة العرب فائدة يحسن السكوت عليها وقوله \"ثم ذرهم في خوضهم يلعبون\" أي ثم دعهم في جهلهم وضلالهم يلعبون حتى يأتيهم من الله اليقين فسوف يعلمون ألهم العاقبة أم لعباد الله المتقين؟."
    },
    {
      "ayah": 92,
      "surah": 6,
      "text": "وقوله \"وهذا كتاب\" يعني القرآن \"أنزلناه مبارك مصدق الذي بين يديه ولتنذر أم القرى\" يعني مكة \"ومن حولها\" من أحياء العرب ومن سائر طوائف بني آدم من عرب وعجم كما قال في الآية الأخرى \"قل يا أيها الناس إني رسول الله إليكم جميعا\" وقال \"لأنذركم به ومن بلغ\" وقال \"ومن يكفر به من الأحزاب فالنار موعده\" وقال تبارك الذي نزل الفرقان على عبده ليكون للعالمين نذيرا\" وقال \"وقل للذين أوتوا الكتاب والأمين أأسلمتم فإن أسلموا فقد اهتدوا وإن تولوا فإنما عليك البلاغ والله بصير بالعباد\" وثبت في الصحيحين أن رسول الله صلى الله عليه وسلم قال \"أعطيت خمسا لم يعطهن أحد من الأنبياء قبلي\" وذكر منهن وكان النبي صلى الله عليه وسلم يبعث إلى قومه خاصة وبعثت إلى الناس عامة ولهذا قال \"والذين يؤمنون بالآخرة يؤمنون به\" أي كل من آمن بالله واليوم الآخر يؤمن بهذا الكتاب المبارك الذي أنزلناه إليك يا محمد وهو القرآن \"وهم على صلاتهم يحافظون\" أي يقومون بما فرض عليهم من أداء الصلوات في أوقاتها."
    },
    {
      "ayah": 93,
      "surah": 6,
      "text": "يقول تعالى \"ومن أظلم ممن افترى على الله كذبا\" أي لا أحد أظلم ممن كذب على الله فجعل له شركاء أو ولدا أو ادعى أن الله أرسله إلى الناس ولم يرسله ولهذا قال تعالى \"أو قال أوحي إلي ولم يوح إليه شيء\" قال عكرمة وقتادة نزلت في مسيلمة الكذاب \"ومن قال سأنزل مثل ما أنزل الله\" أي ومن ادعى أنه يعارض ما جاء من عند الله من الوحي مما يفتريه من القول كقوله تعالى \"وإذا تتلى عليهم آياتنا قالوا قد سمعنا لو نشاء لقلنا مثل هذا\" الآية قال الله تعالى \"ولو ترى إذ الظالمون في غمرات الموت\" أي في سكراته وغمراته وكرباته\"والملائكة باسطو أيديهم\" أي بالضرب كقوله \"لئن بسطت إلي يدك لتقتلني\" الآية. وقوله \"يبسطوا إليكم أيديهم وألسنتهم بالسوء\" الآية وقال الضحاك وأبو صالح باسطو أيديهم أي بالعذاب كقوله \"ولو ترى إذ يتوفى الذين كفروا الملائكة يضربون وجوههم وأدبارهم\" ولهذا قال \"والملائكة باسطو أيديهم\" أي بالضرب لهم حتى تخرج أنفسهم من أجسادهم ولهذا يقولون لهم \"أخرجوا أنفسكم\" وذلك أن الكافر إذا احتضر بشرته الملائكة بالعذاب والنكال والأغلال والسلاسل والجحيم والحميم وغضب الرحمن الرحيم فتفرق روحه في جسده وتعصي وتأبى الخروح فتضربهم الملائكة حتى تخرج أرواحهم من أجسادهم قائلين لهم \"أخرجوا أنفسكم اليوم تجزون عذاب الهون بما كنتم تقولون على الله غير الحق\" الآية. أي اليوم تهانون غاية الإهانة كما كنتم تكذبون على الله وتستكبرون عن اتباع آياته والانقياد لرسله وقد وردت الأحاديث المتواترة في كيفية احتضار المؤمن والكافر عند الموت وهي مقررة عند قوله تعالى \"يثبت الله الذين آمنوا بالقول الثابت في الحياة الدنيا وفي الآخرة\" وقد ذكر ابن مردوية ههنا حديثا مطولا جدا من طريق غريب عن الضحاك عن ابن عباس مرفوعا فالله أعلم."
    },
    {
      "ayah": 94,
      "surah": 6,
      "text": "وقوله \"ولقد جئتمونا فرادى كما خلقناكم أول مرة\" أى يقال لهم يوم معادهم هذا كما قال \"وعرضوا على ربك صفا لقد جئتمونا كما خلقناكم أول مرة\" أي كما بدأناكم أعدناكم وقد كنتم تنكرون ذلك وتستبعدونه فهذا يوم البعث وقوله \"وتركتم ما خولناكم وراء ظهوركم\" أي من النعم والأموال التي اقتنيتموها في الدار الدنيا وراء ظهوركم. وثبت في الصحيح أن رسول الله صلى الله عليه وسلم قال يقول ابن آدم مالي مالي وهل لك من مالك إلا ما أكلت فأفنيت أو لبست فأبليت أو تصدقت فأمضيت وما سوى ذلك فذاهب وتاركه للناس وقال الحسن البصري يؤتى بابن آدم يوم القيامة كأنه بذخ فيقول الله عز وجل أين ما جمعت؟ فقول يا رب جمعته وتركته أوفر ما كان فيقول له يا ابن آدم أين ما قدمت لنفسك؟ فلا يراه قدم شيئا وتلا هذه الآية \"ولقد جئتمونا فرادى كما خلقناكم أول مرة وتركتم ما خولناكم وراء ظهوركم\" الآية رواه ابن أبي حاتم وقوله \"وما نرى معكم شفعاءكم الذين زعمتم أنهم فيكم شركاء\" تقريع لهم وتوبيخ على ما كانوا اخذوا في الدنيا من الأنداد والأصنام والأوثان ظانين أنها تنفعهم في معاشهم ومعادهم إن كان ثم معاد فإذا كان يوم القيامة تقطعت بهم الأسباب وانزاح الضلال وضل عنهم ما كانوا يفترون ويناديهم الرب جل جلاله على رءوس الخلائق. \"أين شركائي الذين كنتم تزعمون\" وقيل لهم \"أين ما كنتم تعبدون من دون الله هل ينصروكم أو ينتصرون\" ولهذا قال ههنا \"وما نرى معكم شفعاءكم الذين زعمتهم أنهم فيكم شركاء\" أي في العبادة لهم فيكم قسط في استحقاق العبادة لهم ثم قال تعالى \"لقد تقطع بينكم\" قرئ بالرفع أي شملكم وبالنصب أي لقد تقطع ما بينكم من الأسباب والوصلات والوسائل \"وضل عنكم\" أي ذهب عنكم \"ما كنتم تزعمون\" من رجاء الأصنام والأنداد كقوله تعالى \"إذ تبرأ الذين اتبعوا من الذين اتبعوا ورأوا العذاب وتقطعت بهم الأسباب وقال الذين اتبعوا لو أن لنا كرة فنتبرأ منهم كما تبرأوا منا كذلك يريهم الله أعمالهم حسرات عليهم وما هم بخارجين من النار\" وقال تعالى \"فإذا نفخ الصور فلا أنساب بينهم يومئذ ولا يتساءلون\" وقال تعالى \"إنما اتخذتم من دون الله أوثانا مودة بينكم في الحياة الدنيا ثم يوم القيامة يكفر بعضكم ببعض ويلعن بعضكم بعضا ومأواكم النار. ومالكم من ناصرين\" وقال \"وقيل ادعوا شركاءكم فدعوهم فلم يستجيبوا لهم\" الآية. وقال \"ويوم نحشرهم جميعا ثم نقول للذين أشركوا\" إلى قوله \"وضل عنهم ما كانوا يفترون\" والآيات في هذا كثيرة جدا."
    },
    {
      "ayah": 95,
      "surah": 6,
      "text": "يخبر تعالى أنه فالق الحب والنوى أي يشقه في الثرى فتنبت منه الزروع على اختلاف أصنافها من الحبوب والثمار على اختلاف ألوانها وأشكالها وطعومها من النوى ولهذا فسر قوله \"فالق الحب والنوى\" بقوله \"يخرج الحي من الميت ويخرج الميت من الحي\" أي يخرج النبات الحي من الحب والنوى الذي هو كالجماد الميت كقوله \"وآية لهم الأرض الميتة احييناها وأخرجنا منها حبا فمنه يأكلون\" إلى قوله \"ومن أنفسهم ومما لا يعلمون\" وقوله \"ومخرج الميت من الحي\" معطوف على \"فالق الحب والنوى\" ثم فسره ثم عطف عليه قوله \"ومخرج الميت من الحي\" وقد عبروا عن هذا وهذا بعبارات كلها متقاربة مؤدية للمعنى فمن قائل يخرج الدجاجة من البيضة وعكسه ومن قائل يخرج الولد الصالح من الفاجر وعكسه وغير ذلك من العبارات التي تنتظمها الآية وتشملها. ثم قال تعالى \"ذلكم الله\" أي فاعل هذا هو الله وحده لا شريك له \"فأنى تؤفكون\" أي كيف تصرفون عن الحق وتعدلون عنه إلى الباطل فتعبدون معه غيره."
    },
    {
      "ayah": 96,
      "surah": 6,
      "text": "وقوله \"فالق الإصباح وجعل الليل سكنا\" أي خالق الضياء والظلام كما قال في أول السورة \"وجعل الظلمات والنور\" أي فهو سبحانه يفلق ظلام الليل عن غرة الصباح فيضيء الوجود ويستنير الأفق ويضمحل الظلام ويذهب الليل بسواده وظلام رواقه ويجيئ النهار بضيائه وإشراقه كقوله \"يغشي الليل النهار يطلبه حثيثا\" فبين تعالى قدرته على خلق الأشياء المتضادة المختلفة الدالة على كمال عظمته وعظيم سلطانه فذكر أنه فالق الإصباح وقابل ذلك بقوله \"وجعل الليل سكنا\" أي ساجيا مظلما لتسكن فيه الأشياء كما قال \"والضحى والليل إذا سجى\" وقال \"والليل إذا يغشى والنهار إذا تجلى\" وقال \"والنهار إذا جلاها والليل إذا يغشاها\" وقال صهيب الرومي رضي الله عنه لامرأته وقد عاتبته في كثرة سهره: إن الله جعل الليل سكنا إلا لصهيب إن صهيبا إذا ذكر الجنة طال شوقه وإذا ذكر النار طار نومه. رواه ابن أبي حاتم. وقوله \"والشمس والقمر حسبانا\" أي يجريان بحساب مقنن مقدر لا يتغير ولا يضطرب بل لكل منهما منازل يسلكها فى الصيف والشتاء فيترتب على ذلك اختلاف الليل والنهار طولا وقصرا كما قال \"هو الذي جعل الشمس ضياء والقمر نورا وقدره منازل\" الآية. وكما قال لا الشمس ينبغي لها أن تدرك القمر ولا الليل سابق النهار وكل في فلك يسبحون وقال \"والشمس والقمر والنجوم مسخرات بأمره\" وقوله \"ذلك تقدير العزيز العليم\" أي الجميع جار بتقدير العزيز الذي لا يمانع ولا يخالف العليم بكل شيء فلا يعزب عن علمه مثقال ذرة في الأرض ولا في السماء وكثيرا ما إذا ذكر الله تعالى خلق الليل والنهار والشمس والقمر يختم الكلام بالعزة والعلم كما ذكر في هذه الآية وكما في قوله \"وآية لهم الليل نسلخ منه النهار فإذا هم مظلمون والشمس تجرى لمستقر لها ذلك تقدير العزيز العليم\" ولما ذكر خلق السموات والأرض وما فيهن في أول سورة حم السجدة قال \"وزينا السماء الدنيا بمصابيح وحفظا ذلك تقدير العزيز العليم\"."
    },
    {
      "ayah": 97,
      "surah": 6,
      "text": "وقوله تعالى \"وهو الذي جعل لكم النجوم لتهتدوا بها في ظلمات البر والبحر\" قال بعض السلف من اعتقد في هذه النجوم غير ثلاث فقد أخطأ وكذب على الله سبحانه. أن الله جعلها زينة للسماء ورجوما للشياطين ويهتدى بها في ظلمات البر والبحر وقوله \"قد فصلنا الآيات\" أي قد بيناها ووضحناها \"لقوم يعلمون\" أي يعقلون ويعرفون الحق ويتجنبون الباطل."
    },
    {
      "ayah": 98,
      "surah": 6,
      "text": "يقول تعالى \"وهو الذي أنشأكم من نفس واحدة\" يعني آدم عليه السلام قال \"يا أيها الناس اتقوا ربكم الذي خلقكم من نفس واحدة وخلق منها زوجها وبث منهما رجالا كثيرا ونساء\" وقوله \"فمستقر ومستودع\" اختلفوا في معنى ذلك فعن ابن مسعود وابن عباس وأبي عبد الرحمن السلمي وقيس بن أبي حازم ومجاهد وعطاء وإبراهيم النخعي والضحاك وقتادة والسدي وعطاء الخراساني وغيرهم \"فمستقر\" أي في الأرحام قالوا أو أكثرهم \"ومستودع\" أي في الأصلاب وعن ابن مسعود وطائفة عكسه وعن ابن مسعود أيضا وطائفة فمستقر في الدنيا ومستودع حيث يموت وقال سعيد بن جبير فمستقر في الأرحام وعلى ظهر الأرض وحيث يموت وقال الحسن البصري المستقر الذي قد مات فاستقر به عمله وعن ابن مسعود ومستودع في الدار الآخرة والقول الأول أظهر والله أعلم وقوله تعالى \"قد فصلنا الآيات لقوم يفقهون\" أى يفهمون ويعون كلام الله ومعناه."
    },
    {
      "ayah": 99,
      "surah": 6,
      "text": "وقوله تعالى \"وهو الذي أنزل من السماء ماء\" أي بقدر مباركا ورزقا للعباد وإحياء وغياثا للخلائق رحمة من الله بخلقه \"فأخرجنا به نبات كل شيء\" كقوله \"وجعلنا من الماء كل شيء\" \"فأخرجنا منه خضرا\" أي زرعا وشجرا أخضر ثم بعد ذلك نخلق فيه الحب والثمر ولهذا قال تعالى \"نخرج منه حبا متراكبا\" أي يركب بعضه بعض كالسنابل ونحوها \"ومن النخل من طلعها قنوان\" أي جمع قنو وهي عذوق الرطب دانية أي قريبة من المتناول كما قال علي بن أبي طلحة الوالبي عن ابن عباس \"قنوان دانية\" يعني بالقنوان الدانية فصار النخل اللاصقة عذوقها بالأرض. رواه ابن جرير قال ابن جرير وأهل الحجاز يقولون قنوان وقيس يقول قنوان قال امرؤ القيس: فآتت أعاليه وآدت أصوله ومال بقنوان من البسر أحمرا قال وتميم يقولون قنيان بالياء قال وهي جمع قنو كما أن صنوان جمع صنو وقوله تعالى \"وجنات من أعناب\" أي ونخرج منه جنات من أعناب وهذا النوعان هما أشرف الثمار عند أهل الحجاز وربما كانا خيار الثمار في الدنيا كما امتن الله بهما على عباده في قوله تعالى \"ومن ثمرات النخيل والأعناب تتخذون منه سكرا ورزقا حسنا\" وكان ذلك قبل تحريم الخمر وقال \"وجعلنا فيها جنات من نخيل وأعناب\" وقوله تعالى \"والزيتون والرمان مشتبها وغير متشابه\"قال قتادة وغيره متشابه في الورق والشكل قريب بعضه من بعض ومتخالف في الثمار شكلا وطعما وطبعا وقوله تعالى \"انظروا إلى ثمره إذا أثمر وينعه\" أي نضجه قاله البراء بن عازب وابن عباس والضحاك وعطاء الخراساني والسدي وقتادة وغيرهم أي فكروا في قدرة خالقه من العدم إلى الوجود بعد أن كان حطبا صار عنبا ورطبا وغير ذلك مما خلق سبحانه وتعالى من الألوان والأشكال والطعوم والروائح كقوله تعالى \"وفي الأرض قطع متجاورات وجنات من أعناب وزرع ونخيل صنوان وغير صنوان يسقى بماء واحد ونفضل بعضها على بعض في الأكل\" الآية. ولهذا قال ههنا \"إن في ذلكم\" أيها الناس \"لآيات\" أي دلالات على كمال قدرة خالق هذه الأشياء وحكمته ورحمته \" لقوم يؤمنون\" أي يصدقون به ويتبعون رسله."
    }
  ]
}
