{
  "ayahs": [
    {
      "ayah": 1,
      "surah": 60,
      "text": "كان سبب نزول صدر هذه السورة الكريمة قصة حاطب بن أبي بلتعة وذلك أن حاطبا هذا كان رجلا من المهاجرين وكان من أهل بدر أيضا وكان له بمكة أولاد ومال ولم يكن من قريش أنفسهم بل كان حليفا لعثمان فلما عزم رسول الله صلى الله عليه وسلم على فتح مكة لما نقض أهلها العهد فأمر النبي صلى الله عليه وسلم المسلمين بالتجهيز لغزوهم وقال \"اللهم عم عليهم خبرنا\" فعمد حاطب هذا فكتب كتابا وبعثه مع امرأة من قريش إلى أهل مكة يعلمهم بما عزم عليه رسول الله صلى الله عليه وسلم من غزوهم ليتخذ بذلك عندهم يدا فأطلع الله تعالى على ذلك رسوله صلى الله عليه وسلم استجابة لدعائه فبعث في أثر المرأة فأخذ الكتاب منها وهذا بين في هذا الحديث المتفق على صحته. قال الإمام أحمد حدثنا سفيان عن عمه أخبرني حسن بن محمد بن علي أخبرني عبدالله بن أبي رافع وقال مرة إن عبيد الله بن أبي رافع أخبره أنه سمع عليا رضي الله عنه يقول: بعثني رسول الله صلى الله عليه وسلم أنا والزبير والمقداد فقال \"انطلقوا حتى تأتوا روضة خاخ فإن بها ظعينة معها كتاب فخذوه منها\" فانطلقنا تعادى بنا خيلنا حتى أتينا الروضة فإذا نحن بالظعينة قلنا أخرجي الكتاب قالت ما معي كتاب قلنا لتخرجن الكتاب أو لتلقين الثياب قال فأخرجت الكتاب من عقاصها فأخذنا الكتاب فأتينا به رسول الله صلى الله عليه وسلم فإذا فيه من حاطب بن أبي بلتعة إلى أناس من المشركين بمكة يخبرهم ببعض أمر رسول الله صلى الله عليه وسلم فقال رسول الله صلى الله عليه وسلم \"يا حاطب ما هذا؟\" قال لا تعجل علي إني كنت امرأ ملصقا في قريش ولم أكن من أنفسهم وكان من معك من المهاجرين لهم قرابات يحمون أهليهم بمكة فأحببت إذ فاتني ذلك من النسب فيهم أن أتخذ فيهم يدا يحمون بها قرابتي وما فعلت ذلك كفرا ولا ارتدادا عن ديني ولا رضا بالكفر بعد الإسلام فقال رسول الله صلى الله عليه وسلم \"إنه صدقكم\" فقال عمر دعني أضرب عنق هذا المنافق فقال رسول الله صلى الله عليه وسلم \"إنه قد شهد بدرا ما يدريك لعل الله اطلع إلى أهل بدر فقال اعملوا ما شئتم فقد غفرت لكم\" وهكذا أخرجه الجماعة إلا ابن ماجه من غير وجه عن سفيان بن عيينة به وزاد البخاري في كتاب المغازي فأنزل الله السورة \"يا أيها الذين آمنوا لا تتخذوا عدوي وعدوكم أولياء\" وقال في كتاب التفسير قال عمرو ونزلت فيه \"يا أيها الذين آمنوا لا تتخذوا عدوي وعدوكم أولياء\" وقال لا أدري الآية في الحديث أو قال عمرو قال البخاري قال علي يعني ابن المديني قيل لسفيان في هذا نزلت \"لا تتخذوا عدوي وعدوكم أولياء\" فقال سفيان هذا في حديث الناس حفظته من عمرو ما تركت منه حرفا ولا أدري أحدا حفظه غيري. وقد أخرجاه في الصحيحين من حديث حصين بن عبدالرحمن عن سعد بن عبيدة عن أبي عبدالرحمن السلمي عن علي قال بعثني رسول الله صلى الله عليه وسلم وأبا مرثد والزبير بن العوام وكلنا فارس وقال \"انطلقوا حتى تأتوا روضة خاخ فإن بها امرأة من المشركين معها كتاب من حاطب بن أبي بلتعة إلى المشركين\" فأدركناها تسير على بعير لها حيث قال رسول الله صلى الله عليه وسلم فقلنا الكتاب؟ فقالت ما معي كتاب فأنخناها فالتمسنا فلم نر كتابا فقلنا ما كذب رسول الله صلى الله عليه وسلم لتخرجن الكتاب أو لنجردك فلما رأت الجد أهوت إلى حجزتها وهي محتجزة بكساء فأخرجنه فانطلقنا بها إلى رسول الله صلى الله عليه وسلم فقال عمر يا رسول الله قد خان الله ورسوله والمؤمنين فدعني فلأضرب عنقه فقال النبى صلى الله عليه وسلم \"ما حملك على ما صنعت؟\" قال حاطب والله ما بي إلا أن أكون مؤمنا بالله ورسوله صلى الله عليه وسلم أردت أن تكون لي عند القوم يد يدفع الله بها عن أهلي ومالي وليس أحد من أصحابك إلا له هناك من عشيرته من يدفع الله به عن أهله وماله فقال \"صدق لا تقولوا له إلا خيرا\" فقال عمر إنه قد خان الله ورسوله والمؤمنين فدعني فلأضرب عنقه فقال \"صدق لا تقولوا له إلا خيرا\" فقال عمر إنه قد خان الله ورسوله والمؤمنين فدعني فلأضرب عنقه فقال \"أليس من أهل بدر؟ - فقال - لعل الله اطلع إلى أهل بدر فقال اعملوا ما شئتم فقد وجبت لكم الجنة - أو - قد غفرت لكم\" فدمعت عينا عمر وقال الله ورسوله أعلم هذا لفظ البخاري في المغازي في غزوة بدر. وقد روي من وجه آخر عن علي قال ابن أبي حاتم حدثنا علي بن الحسن الهسنجاني حدثنا عبيد بن يعيش حدثنا إسحاق بن سليمان الرازي عن أبي سنان هو سعيد بن سنان عن عمرو بن مرة الحملي عن أبي إسحاق البحتري الطائي عن الحارث عن علي لما أراد النبي صلى الله عليه وسلم أن يأتي مكة أسر إلى أناس من أصحابه أنه يريد مكة منهم حاطب بن أبي بلتعة وأفشى في الناس أنه يريد خيبر قال فكتب حاطب بن أبي بلتعة إلى أهل مكة أن رسول الله صلى الله عليه وسلم يريدكم فأخبر رسول الله صلى الله عليه وسلم قال فبعثني رسول الله صلى الله عليه وسلم وأبا مرثد وليس منا رجل إلا وعنده فرس فقال \"ائتوا روضة خاخ فإنكم ستلقون بها امرأة معهال كتاب فخذوه منها\" فانطلقنا حتى رأيناها بالمكان الذي ذكر رسول الله صلى الله عليه وسلم فقلنا لها هات الكتاب فقالت ما معي كتاب فوضعنا متاعها وفتشناها فلم نجده في متاعها فقال أبو مرثد لعله أن لا يكون معها فقلت ما كذب رسول الله صلى الله عليه وسلم ولا كذبنا فقلنا لها لتخرجنه أو لنعرينك فقالت أما تتقون الله؟ ألستم مسلمين؟ فقلنا لتخرجنه أو لنعرينك قال عمرو بن مرة فأخرجته من حجزتها وقال حبيب بن أبي ثابت أخرجته من قبلها فأتينا به رسول الله صلى الله عليه وسلم فإذا الكتاب من حاطب بن أبي بلتعة فقام عمر فقال يا رسول الله خان الله ورسوله فائذن لي فلأضرب عنقه فقال رسول الله صلى الله عليه وسلم \"أليس قد شهد بدرا؟\" قالوا بلى وقال عمر بلى ولكنه قد نكث وظاهر أعداءك عليك فقال رسول الله صلى الله عليه وسلم \"فلعل الله اطلع على أهل بدر فقال اعملوا ما شئتم إني بما تعملون بصير\" ففاضت عينا عمر وقال الله ورسوله أعلم فأرسل رسول الله صلى الله عليه وسلم إلى حاطب فقال \"يا حاطب ما حملك على ما صنعت؟\" فقال يا رسول الله إنى كنت امرأ ملصقا في قريش وكان لي بها مال وأهل ولم يكن من أصحابك أحد إلا وله بمكة من يمنع أهله وماله فكتبت بذلك إليهم ووالله يا رسول الله إني لمؤمن بالله ورسوله فقال رسول الله صلى الله عليه وسلم \"صلى حاطب فلا تقولوا لحاطب إلا خيرا\" قال حبيب بن أبي ثابت فأنزل الله تعالى \"يا أيها الذين آمنوا لا تتخذوا عدوي وعدوكم أولياء تلقون إليهم بالمودة\" الآية وهكذا رواه ابن جرير عن ابن حميد عن مهران عن أبي سنان سعيد بن سنان بإسناده مثله. وقد ذكر ذلك أصحاب المغازي والسير فقال محمد بن إسحاق بن يسار في السيرة حدثني محمد بن جعفر ابن الزبير عن عروة بن الزبير وغيره من علمائنا قال لما أجمع رسول الله صلى الله عليه وسلم المسير إلى مكة كتب حاطب بن أبي بلتعة كتابا إلى قريش يخبرهم بالذي أجمع عليه رسول الله صلى الله عليه وسلم من الأمر في السير إليهم ثم أعطاه امرأة زعم محمد بن جعفر أنها من مزينة وزعم غيره أنها سارة مولاة لبني عبد المطلب وجعل لها جعلا على أن تبلغه لقريش فجعلته في رأسها ثم فتلت عليه قرونها ثم خرجت به وأتى رسول الله صلى الله عليه وسلم الخبر من السماء بما صنع حاطب فبعث علي بن أبي طالب والزبير بن العوام فقال \"أدركا امرأة قد كتب معها حاطب كتابا إلى قريش يحذرهم ما قد أجمعنا له من أمرهم\" فخرجا حتى أدركاها بالحليفة حليفة بني أبي أحمد فاستنزلاها بالحليفة فالتمسا في رحلها فلم يجدا شيئا فقال لها علي بن أبي طالب إني أحلف بالله ما كذب رسول الله وما كذبنا ولتخرجن لنا هذا الكتاب أو لنكشفنك فلما رأت الجد منه قالت أعرض فأعرض فحلت قرون رأسها فاستخرجت الكتاب منها فدفعته إليه فأتى به رسول الله صلى الله عليه وسلم فدعا رسول الله صلى الله عليه وسلم حاطبا فقال \"يا حاطب ما حملك على هذا؟\" فقال يا رسول الله أما والله إني لمؤمن بالله وبرسوله ما غيرت ولا بدلت ولكني كنت امرأ ليس لي في القوم من أهل ولا عشيرة وكان لي بين أظهرهم ولد وأهل فصانعتهم عليهم فقال عمر بن الخطاب يا رسول الله دعني فلأضرب عنقه فإن الرجل قد نافق فقال رسول الله صلى الله عليه وسلم \"وما يدريك يا عمر؟ لعل الله قد اطلع إلى أصحاب بدر يوم بدر فقال اعملوا ما شئتم فقد غفرت لكم\" فأنزل الله عز وجل في حاطب \"يا أيها الذين آمنوا لا تتخذوا عدوي وعدوكم أولياء تلقون إليهم بالمودة - إلى قوله - قد كانت لكم أسوة حسنة في إبراهيم والذين معه إذ قالوا لقومهم إنا برآء منكم ومما تعبدون من دون الله كفرنا بكم وبدا بيننا وبينكم العداوة والبغضاء أبدا حتى تؤمنوا بالله وحده\" إلى آخر القصة وروى معمر عن الزهري عن عروة نحو ذلك وهكذا ذكر مقاتل بن حيان أن هذه الآيات نزلت في حاطب بن أبي بلتعة أنه بعث سارة مولاة بني هاشم وأنه أعطاها عشرة دراهم وأن رسول الله صلى الله عليه وسلم بعث في أثرها عمر بن الخطاب وعلي بن أبي طالب رضي الله عنهما فأدركاها بالجحفة وذكر تمام القصة كنحو ما تقدم وعن السدي قريبا منه وهكذا قال العوفي عن ابن عباس ومجاهد وقتادة وغير واحد أن هذه الآيات نزلت في حاطب بن أبي بلتعة فقوله تعالى \"يا أيها الذين آمنوا لا تتخذوا عدوي وعدوكم أولياء تلقون إليهم بالمودة وقد كفروا بما جاءكم من الحق\" يعني المشركين والكفار الذين هم محاربون لله ولرسوله وللمؤمنين الذين شرع الله عداوتهم ومصارمتهم ونهى أن يتخذوا أولياء وأصدقاء وأخلاء كما قال تعالى \"يا أيها الذين آمنوا لا تتخذوا اليهود والنصارى أولياء بعضهم أولياء بعض ومن يتولهم منكم فإنه منهم\" وهذا تهديد شديد ووعيد أكيد وقال تعالى \"يا أيها الذين آمنوا لا تتخذوا الذين اتخذوا دينكم هزوا ولعبا من الذين أوتوا الكتاب من قبلكم والكفار أولياء واتقوا الله إن كنتم مؤمنين\". وقال تعالى \"يا أيها الذين آمنوا لا تتخذوا الكافرين أولياء من دون المؤمنين أتريدون أن تجعلوا لله عليكم سلطانا مبينا\" وقال تعالى \"لا يتخذ المؤمنون الكافرين أولياء من دون المؤمنين ومن يفعل ذلك فليس من الله في شيء إلا أن تتقوا منهم تقاة ويحذركم الله نفسه\" ولهذا قبل رسول الله صلى الله عليه وسلم عذر حاطب لما ذكر أنه إنما فعل ذلك مصانعة لقريش لأجل ما كان له عندهم من الأموال والأولاد. ويذكر ههنا الحديث الذي رواه الإمام أحمد حدثنا مصعب بن سلام حدثنا الأجلح عن قيس بن أبي مسلم عن ربعي بن حراش سمعت حذيفة يقول: ضرب لنا رسول الله صلى الله عليه وسلم أمثالا: واحدا وثلاثه وخمسة وسبعة وتسعة وأحد عشر قال فضرب لنا منها مثلا وترك سائرها قال \"إن قوما كانوا أهل ضعف ومسكنة قاتلهم أهل تجبر وعداء فأظهر الله أهل الضعف عليهم فعمدوا إلى عدوهم فاستعملوهم وسلطوهم فأسخطوا الله عليهم إلى يوم يلقونه\" وقوله تعالى \"يخرجون الرسول وإياكم\" هذا مع ما قبله من التهييج على عداوتهم وعدم موالاتهم لأنهم أخرجوا الرسول وأصحابه من بين أظهرهم كراهة لما هم عليه من التوحيد وإخلاص العبادة لله وحده ولهذا قال تعالى \"أن تؤمنوا بالله ربكم\" أي لم يكن لكم عندهم ذنب إلا إيمانكم بالله رب العالمين كقوله تعالى \"وما نقموا منهم إلا أن يؤمنوا بالله العزيز الحميد\" وكقوله تعالى \"الذين أخرجوا من ديارهم بغير حق إلا أن يقولوا ربنا الله\". وقوله تعالى \"إن كنتم خرجتم جهادا في سبيلي وابتغاء مرضاتي\" أي إن كنتم كذلك فلا تتخذوهم أولياء إن كنتم خرجتم مجاهدين في سبيلي باغين لمرضاتي عنكم فلا توالوا أعدائي وأعداءكم وقد أخرجوكم من دياركم وأموالكم حنقا عليكم وسخطا لدينكم. وقوله تعالى \"تسرون إليهم بالمودة وأنا أعلم بما أخفيتم وما أعلنتم\" أي تفعلون ذلك وأنا العالم بالسرائر والضمائر والظواهر \"ومن يفعله منكم فقد ضل سواء السبيل."
    },
    {
      "ayah": 10,
      "surah": 60,
      "text": "تقدم في سورة الفتح في ذكر صلح الحديبية الذي وقع بين رسول الله صلى الله عليه وسلم وبين كفار قريش فكان فيه: على أن لا يأتيك منا رجل وإن كان على دينك إلا رددته إلينا وفي رواية على أنه لا يأتيك منا أحد وإن كان على دينك إلا رددته إلينا وهذا قول عروة والضحاك وعبدالرحمن بن زيد والزهري ومقاتل بن حيان والسدي فعلى هذه الرواية تكون هذه الآية مخصصة للسنة وهذا من أحسن أمثلة ذلك وعلى طريقة بعض السلف ناسخة فإن الله عز وجل أمر عباده المؤمنين إذا جاءهم النساء مهاجرات أن يمتحنوهن فإن علموهن مؤمنات فلا يرجعوهن إلى الكفار لا هن حل لهم ولا هم يحلون لهن. وقد ذكرنا في ترجمة عبدالله بن [أبي] أحمد بن جحش من المسند الكبير من طريق أبي بكر بن أبي عاصم عن محمد بن يحيى الذهلي عن يعقوب بن محمد عن عبدالعزيز بن عمران عن مجمع بن يعقوب عن حنين بن أبي أبانة عن عبدالله بن أبي أحمد قال هاجرت أم كلثوم بنت عقبة بن أبي معيط في الهجرة فخرج أخواها عمارة والوليد حتى قدما على رسول الله صلى الله عليه وسلم فكلماه فيها أن يردها إليهما فنقض الله العهد بينه وبين المشركين في النساء خاصة فمنعهم أن يردوهن إلى المشركين وأنزل الله آية الامتحان. قال ابن جرير حدثنا أبو كريب حدثنا يونس بن بكير عن قيس بن الربيع عن الأغر بن الصباح عن خليفة عن حصين عن أبي نصر الأسدي قال سئل ابن عباس كيف كان امتحان رسول الله صلى الله عليه وسلم النساء؟ قال كان يمتحنهن بالله ما خرجت من بغض زوج وبالله ما خرجت رغبة عن أرض إلى أرض وبالله ما خرجت التماس دنيا وبالله ما خرجت إلا حبا لله ولرسوله ثم رواه من وجه آخر عن الأغر بن الصباح به وكذا رواه البزار من طريقه وذكر فيه أن الذي كان يحلفهن عن أمر رسول الله صلى الله عليه وسلم له عمر بن الخطاب رضي الله عنه وقال العوفي عن ابن عباس في قوله تعالى \"يا أيها الذين آمنوا إذا جاءكم المؤمنات مهاجرات فامتحنوهن\" كان امتحانهن أن يشهدن أن لا إله إلا الله وأن محمدا عبده ورسوله وقال مجاهد \"فامتحنوهن\" فاسألوهن عما جاء بهن فإن كان بهن غضب على أزواجهن أو سخطة أو غيره ولم يؤمن فارجعوهن إلى أزواجهن وقال عكرمة يقال لها ما جاء بك إلا حب الله ورسوله وما جاء بك عشق رجل منا ولا فرار من زوجك فذلك قوله \"فامتحنوهن\" وقال قتادة كانت امتحانهن أن يستحلفن بالله ما أخرجكن النشوز وما أخرجكن إلا حب الإسلام وأهله وحرص عليه فإذا قلن ذلك قبل ذلك منهن. وقوله تعالى \"فإن علمتموهن مؤمنات فلا ترجعوهن إلى الكفار\" فيه دلالة على أن الإيمان يمكن الاطلاع عليه يقينا وقوله تعالى \"لا هن حل لهم ولا هم يحلون لهن\" هذه الآية هي التي حرمت المسلمات على المشركين وقد كان جائزا في ابتداء الإسلام أن يتزوج المشرك المؤمنة ولهذا كان أمر أبي العاص بن الربيع زوج ابنة النبي صلى الله عليه وسلم زينب رضي الله عنها وقد كانت مسلمة وهو على دين قومه فلما وقع في الأسارى يوم بدر بعثت امرأته زينب في فدائه بقلادة لها كانت لأمها خديجة فلما رآها رسول الله صلى الله عليه وسلم رق لها رقة شديدة وقال للمسلمين \"إن رأيتم أن تطلقوا لها أسيرها فافعلوا\" ففعلوا فأطلقه رسول الله صلى الله عليه وسلم على أن يبعث ابنته إليه فوفي له بذلك وصدقه فيما وعده وبعثها إلى رسول الله صلى الله عليه وسلم مع زيد بن حارثة رضي الله عنه فأقامت بالمدينة من بعد وقعة بدر وكانت سنة اثنتين إلى أن أسلم زوجها أبو العاص بن الربيع سنة ثمان فردها عليه بالنكاح الأول ولم يحدث لها صداقا كما قال الإمام أحمد حدثنا يعقوب حدثنا أبي حدثنا ابن إسحاق حدثنا داود بن الحصين عن عكرمة عن ابن عباس أن رسول الله صلى الله عليه وسلم رد ابنته زينب على أبي العاص وكانت هجرتها قبل إسلامه بست سنين على النكاح الأول ولم يحدث شهادة ولا صداقا ورواه أبو داود والترمذي وابن ماجه ومنهم من يقول بعد سنتين وهو صحيح لأن إسلامه كان بعد تحريم المسلمات على المشركين بسنتين وقال الترمذي ليس بإسناده بأس ولا نعرف وجه هذا الحديث ولعله جاء من حفظ داود بن الحصين وسمعت عبد بن حميد يقول سمعت يزيد بن هارون يذكر عن ابن إسحاق هذا الحديث وحديث ابن الحجاج يعني ابن أرطاة عن عمرو بن شعيب عن أبيه عن جده أن رسول الله صلى الله عليه وسلم رد ابنته على أبي العاص بن الربيع بمهر جديد ونكاح جديد فقال يزيد حديث ابن عباس أجود إسنادا والعمل على حديث عمرو بن شعيب ثم قلت وقد روى حديث الحجاج ابن أرطاة عن عمرو بن شعيب الإمام أحمد والترمذي وابن ماجه وضعفه الإمام أحمد وغير واحد والله أعلم وأجاب الجمهور عن حديث ابن عباس بأن ذلك كان قضية عين يحتمل أنه لم تنقض عدتها منه لأن الذي عليه الأكثرون أنها متى انقضت العدة ولم يسلم انفسخ نكاحها منه. وقال آخرون بل إذا انقضت العدة هي بالخيار إن شاءت أقامت على النكاح واستمرت وإن شاءت فسخته وذهبت فتزوجت وحملوا عليه حديث ابن عباس والله أعلم وقوله تعالى \"وآتوهم ما أنفقوا\" يعني أزواج المهاجرات من المشركين ادفعوا إليهم الذي غرموه عليهن من الأصدقة قاله ابن عباس ومجاهد وقتادة والزهري وغير واحد وقوله تعالى \"ولا جناح عليكم أن تنكحوهن إذا آتيتموهن أجورهن\" يعني إذا أعطيتموهن أصدقتهن فانكحوهن أي تزوجوهن بشرطه من انقضاء العدة والولي وغير ذلك وقوله تعالى \"ولا تمسكوا بعصم الكوافر\" تحريم من الله عز وجل على عباده المؤمنين نكاح المشركات والاستمرار معهن. وفي الصحيح عن الزهري عن عروة عن المسور ومروان بن الحكم أن رسول الله صلى الله عليه وسلم لما عاهد كفار قريش يوم الحديبية جاءه نساء من المؤمنات فأنزل الله عز وجل \"يا أيها الذين آمنوا إذا جاءكم المؤمنات مهاجرات - إلى قوله - ولا تمسكوا بعصم الكوافر\" فطلق عمر بن الخطاب يومئذ امرأتين تزوج إحداهما معاوية بن أبي سفيان والأخرى صفوان بن أمية. وقال ابن ثور عن معمر عن الزهري: أنزلت هذه الآية على رسول الله صلى الله عليه وسلم وهو بأسفل الحديبية حين صالحهم على أنه من أتاه منهم رده إليهم فلما جاءه النساء نزلت هذه الآية وأمره أن يرد الصداق إلى أزواجهن وحكم على المشركين مثل ذلك إذا جاءتهم امرأة من المسلمين أن يردوا الصداق إلى أزواجهن وقال \"ولا تمسكوا بعصم الكوافر\" وهكذا قال عبدالرحمن بن زيد بن أسلم وقال وإنما حكم الله بينهم بذلك لأجل ما كان بينهم وبينهم من العهد وقال محمد بن إسحاق عن الزهري طلق عمر يومئذ قريبة بنت أبي أمية بن المعيرة فتزوجها معاوية وأم كلثوم بنت عمرو بن جرول الخزاعية وهي أم عبدالله فتزوجها أبو جهم بن حذيفة بن غانم رجل من قومه وهما على شركهما وطلق طلحة بن عبيد الله أروى بنت ربيعة بن الحارث بن عبدالمطلب فتزوجها بعده خالد بن سعيد بن العاص. وقوله تعالى \"واسألوا ما أنفقتم وليسألوا ما أنفقوا\" أي وطالبوا بما أنفقتم على أزواجكم اللاتي يذهبن إلى الكفار إن ذهبن وليطالبوا بما أنفقوا على أزواجهم اللاتي هاجرن إلى المسلمين وقوله \"ذلكم حكم الله يحكم بينكم\" أي في الصلح واستثناء النساء منه والأمر بهذا كله هو حكم الله يحكم به بين خلقه \"والله عليم حكيم\" أي عليم بما يصلح عباده حكيم في ذلك."
    },
    {
      "ayah": 11,
      "surah": 60,
      "text": "ثم قال تعالى \"وإن فاتكم شيء من أزواجكم إلى الكفار فعاقبتم فآتوا الذين ذهبت أزواجهم مثل ما أنفقوا\" قال مجاهد وقتادة هذا في الكفار الذين ليس لهم عهد إذا فرت إليهم امرأة ولم يدفعوا إلى زوجها شيئا فإذا جاءت منهم امرأة لا يدفع إلى زوجها شيء حتى يدفع إلى زوج الذاهبة إليهم مثل نفقته عليها وقال ابن جرير حدثنا يونس حدثنا ابن وهب أخبرني يونس عن الزهري قال أقر المؤمنون بحكم الله فأدوا ما أمروا به من نفقات المشركين التي أنفقوا على نسائهم وأبى المشركون أن يقروا بحكم الله فيما فرض عليهم من أداء نفقات المسلمين فقال الله تعالى للمؤمنين به \"وإن فاتكم شيء من أزواجكم إلى الكفار فعاقبتم فآتوا الذين ذهبت أزواجهم مثل ما أنفقوا واتقوا الله الذي أنتم به مؤمنون\" فلو أنها ذهبت بعد هذه الآية امرأة من أزواج المؤمنين إلى المشركين رد المؤمنون إلى زوجها النفقة التي أنفق عليها من العقب الذي بأيديهم الذي أمروا أن يردوه على المشركين من نفقاتهم التي أنفقوا على أزواجهم اللاتي آمن وهاجرن ثم ردوا إلى المشركين فضلا إن كان بقي لهم والعقب ما كان بقي من صداق نساء الكفار حين آمن وهاجرن وقال العوفي عن ابن عباس في هذه الآية: يعني إن لحقت امرأة رجل من المهاجرين بالكفار أمر له رسول الله صلى الله عليه وسلم أنه يعطى مثل ما أنفق من الغنيمة وهكذا قال مجاهد \"فعاقبتم\" أصبتم غنيمة من قريش أو غيرهم \"فآتوا الذين ذهبت أزواجهم مثل ما أنفقوا\" يعني مهر مثلها. وهكذا قال مسروق وإبراهيم وقتادة ومقاتل والضحاك وسفيان بن حسين والزهري أيضا. وهذا لا ينافي الأول لأنه إذا أمكن الأول فهو الأولى وإلا فمن الغنائم اللاتي تؤخذ من أيدي الكفار وهذا أوسع وهو اختيار ابن جرير ولله الحمد والمنة."
    },
    {
      "ayah": 12,
      "surah": 60,
      "text": "قال البخاري حدثنا يعقوب بن إبراهيم حدثنا ابن أخي ابن شهاب عن عمه قال أخبرني عروة أن عائشة زوج النبي صلى الله عليه وسلم أخبرته أن رسول الله صلى الله عليه وسلم كان يمتحن من هاجر إليه من المؤمنات بهذه الآية \"يا أيها النبي إذا جاءك المؤمنات يبايعنك - إلى قوله - غفور رحيم\" قال عروة قالت عائشة فمن أقر بهذا الشرط من المؤمنات قال لها رسول الله صلى الله عليه وسلم \"قد بايعتك\" كلاما ولا والله ما مست يده يد امرأة في المبايعة قط وما يبايعهن إلا بقوله \"قد بايعتك على ذلك\" هذا لفظ البخاري. وقال الإمام أحمد حدثنا عبدالرحمن بن مهدي حدثنا سفيان عن محمد بن المنكدر عن أميمة بنت رقيقة قالت أتيت رسول الله صلى الله عليه وسلم في نساء لنبايعه فأخذ علينا ما في القرآن أن لا نشرك بالله شيئا الآية وقال \"فيما استطعتن وأطقتن\" قلنا الله ورسوله أرحم بنا من أنفسنا قلنا يا رسول الله ألا تصافحنا؟ قال \"إني لا أصافح النساء إنما قولي لامرأة واحدة قولي لمائة امرأة\" هذا إسناد صحيح وقد رواه الترمذي والنسائي وابن ماجه من حديث سفيان بن عيينة والنسائي أيضا من حديث الثوري ومالك بن أنس كلهم عن محمد بن المنكدر عن أميمة به وقال الترمذي حسن صحيح لا نعرفه إلا من حديث محمد بن المنكدر وقد رواه أحمد أيضا من حديث محمد بن إسحاق عن محمد بن المنكدر وزاد: ولم يصافح منا امرأة وكذا رواه ابن جرير من طريق موسى بن عقبة عن محمد بن المنكدر به ورواه ابن أبي حاتم من حديث أبي جعفر الرازي عن محمد ابن المنكدر حدثتني أميمة بنت رقيقة وكانت أخت خديجة خالة فاطمة من فيها إلي في فذكره وقال الإمام أحمد حدثنا يعقوب حدثنا أبي عن ابن إسحاق حدثني سليط بن أيوب بن الحكم بن سليم عن أمه سلمى بنت قيس وكانت إحدى خالات رسول الله صلى الله عليه وسلم وقد صلت معه القبلتين وكانت إحدى نساء بني عدي بن النجار قالت جئت رسول الله صلى الله عليه وسلم نبايعه في نسوة من الأنصار فلما شرط علينا ألا نشرك بالله شيئا ولا نسرق ولا نزني ولا نقتل أولادنا ولا نأتي ببهتان نفتريه بين أيدينا وأرجلنا ولا نعصيه في معروف قال \"ولا تغششن أزواجكن\" قالت فبايعناه ثم انصرفنا فقلت لامرأة منهن ارجعي فسلي رسول الله صلى الله عليه وسلم: ما غش أزواجنا؟ قال فسألته فقال: \"تأخذ ماله فتحابي به غيره\" وقال الإمام أحمد حدثنا إبراهيم بن أبي العباس حدثنا عبدالرحمن بن عثمان بن إبراهيم بن محمد بن حاطب حدثني أبي عن أمه عائشة بنت قدامة يعني ابن مظعون قالت أنا مع أمي رائطة ابنة سفيان الخزاعية والنبي صلى الله عليه وسلم يبايع النسوة ويقول \"أبايعكن على أن لا تشركن بالله شيئا ولا تسرقن ولا تزنين ولا تقتلن أولادكن ولا تأتين ببهتان تفترينه بين أيديكن وأرجلكن ولا تعصينني في معروف - قلن نعم - فيما استطعتن\" فكن يقلن وأقول معهن وأمي تقول لي أي بنية نعم فكنت أقول كما يقلن وقال البخاري حدثنا أبو معمر حدثنا عبدالوارث حدثنا أيوب عن حفصة بنت سيرين عن أم عطية قالت بايعنا رسول الله صلى الله عليه وسلم فقرأ علينا \"ولا تشركن بالله شيئا\" ونهانا عن النياحة فقبضت امرأة يدها قالت أسعدتني فلانة فأريد أن أجزيها فما قال لها رسول الله صلى الله عليه وسلم شيئا فانطلقت ورجعت فبايعها ورواه مسلم وفي رواية فما وفي منهن امرأة غيرها وغير أم سليم امرأة ملحان وللبخاري عن أم عطية قالت أخذ علينا رسول الله صلى الله عليه وسلم عند البيعة أن لا ننوح فما وفت منا امرأة غير خمس نسوة أم سليم وأم العلاء وابنة أبي سبرة امرأة معاذ وامرأتان أو ابنة أبي سبرة وامرأة معاذ وامرأة أخرى وقد كان رسول الله صلى الله عليه وسلم يتعاهد النساء بهذه البيعة يوم العيد كما قال البخاري حدثنا محمد بن عبدالرحيم حدثنا هارون بن معروف حدثنا عبدالله بن وهب أخبرني ابن جريج أن الحسن بن مسلم أخبره عن طاوس عن ابن عباس قال شهدت الصلاة يوم الفطر مع رسول الله صلى الله عليه وسلم وأبي بكر وعمر وعثمان فكلهم يصليها قبل الخطبة ثم يخطب بعد فنزل نبي الله صلى الله عليه وسلم فكأني أنظر إليه حين يجلس الرجال بيده ثم أقبل يشقهم حتى أتى النساء مع بلال فقال \"يا أيها النبي إذا جاءك المؤمنات يبايعنك على أن لا يشركن بالله شيئا ولا يسرقن ولا يزنين ولا يقتلن أولادهن ولا يأتين ببهتان يفترينه بين أيديهن وأرجلهن ولا يعصينك فى معروف\" حتى فرغ من الآية كلها ثم قال حين فرغ \"أنتن على ذلك؟\" فقالت امرأة واحدة ولم يجبه غيرها نعم يا رسول الله لا يدري حسن من هي قال فتصدقن قال وبسط بلال ثوبه فجعلن يلقين الفتخ والخواتيم في ثوب بلال وقال الإمام أحمد حدثنا خلف بن الوليد حدثنا عباس عن سليمان بن سليم عن عمرو بن شعيب عن أبيه عن جده قال جاءت أميمة بنت رقيقة إلى رسول الله صلى الله عليه وسلم تبايعه على الإسلام فقال \"أبايعك على أن لا تشركي بالله شيئا ولا تسرقي ولا تزني ولا تقتلي ولدك ولا تأتي ببهتان تفترينه بين يديك ورجليك ولا تنوحي ولا تبرجي تبرج الجاهلية الأولى\" وقد قال الإمام أحمد حدثنا سفيان عن الزهري عن أبي إدريس الخولاني عن عبادة بن الصامت قال: كنا عند رسول الله صلى الله عليه وسلم في مجلس فقال \"تبايعوني على أن لا تشركوا بالله شيئا ولا تسرقوا ولا تزنوا ولا تقتلوا أولادكم - قرأ الآية التي أخذت على النساء إذا جاءك المؤمنات - فمن وفي منكم فأجره على الله ومن أصاب من ذلك شيئا فعوقب به فهو كفارة له ومن أصاب من ذلك شيئا فستره الله عليه فهو إلى الله إن شاء غفر له وإن شاء عذبه\" أخرجاه في الصحيحين. وقال محمد بن إسحاق عن يزيد بن أبي حبيب عن مرثد بن عبدالله اليزني عن أبي عبدالله عبدالرحمن بن عسيلة الصنابحي عن عبادة بن الصامت قال: كنت فيمن حضر العقبة الأولى وكنا اثني عشر رجلا فبايعنا رسول الله صلى الله عليه وسلم على بيعة النساء وذلك قبل أن يفرض الحرب على أن لا نشرك بالله شيئا ولا نسرق ولا نزني ولا نقتل أولادنا ولا نأتي ببهتان نفتريه بين أيدينا وأرجلنا ولا نعصيه في معروف وقال \"فإن وفيتم فلكم الجنة\" رواه ابن أبي حاتم وقد روى ابن جرير من طريق العوفي عن ابن عباس أن رسول الله صلى الله عليه وسلم أمر عمر بن الخطاب فقال \"قل لهن إن رسول الله صلى الله عليه وسلم يبايعكن على أن لا تشركن بالله شيئا\" وكانت هند بنت عتبة بن ربيعة التي شقت بطن حمزة متنكرة في النساء فقالت إني إن أتكلم يعرفني وإن عرفني قتلني وإنما تنكرت فرقا من رسول الله صلى الله عليه وسلم فسكت النسوة اللاتي مع هند وأبين أن يتكلمن فقالت هند وهي متنكرة كيف تقبل من النساء شيئا لم تقبله من الرجال؟ فنظر إليها رسول الله صلى الله عليه وسلم وقال لعمر \" قل لهن ولا يسرقن\" قالت هند والله إني لأصيب من أبي سفيان الهنات ما أدري أيحلهن لي أم لا؟ قال أبو سفيان ما أصبت من شيء مضى أو قد بقي فهو لك حلال فضحك رسول الله صلى الله عليه وسلم وعرفها فدعاها فأخذت بيده فعاذت به فقال \"أنت هند\" قالت عفا الله عما سلف فصرف عنها رسول الله صلى الله عليه وسلم فقال \"ولا يزنين\" فقالت يا رسول الله وهل تزني امرأة حرة؟ قال \"لا والله ما تزني الحرة - قال - ولا يقتلن أولادهن\" قالت هند أنت قتلتهم يوم بدر فأنت وهم أبصر قال \"ولا يأتين ببهتان يفترينه بين أيديهن وأرجلهن\" قال \"ولا يعصينك في معروف\" قال منعهن أن ينحن وكان أهل الجاهلية يمزقن الثياب ويخدشن الوجوه ويقطعن الشعور ويدعون بالويل والثبور. وهذا أثر غريب وفي بعضه نكارة والله أعلم فإن أبا سفيان وامرأته لما أسلما لم يكن رسول الله صلى الله عليه وسلم يخيفهما بل أظهر الصفاء والود لهما وكذلك كان الأمر من جانبه عليه السلام لهما. وقال مقاتل بن حيان أنزلت هذه الآية يوم الفتح بايع رسول الله صلى الله عليه وسلم الرجال على الصفاء وعمر بايع النساء يحلفهن عن رسول الله صلى الله عليه وسلم فذكر بقيته كما تقدم وزاد: فلما قال ولا تقتلن أولادكن قالت هند ربيناهم صغارا فقتلتموهم كبارا فضحك عمر بن الخطاب حتى استلقى رواه ابن أبي حاتم. وقال ابن أبي حاتم حدثنا نصر بن علي حدثتني أم عطية بنت سليمان حدثني عمي عن جدي عن عائشة قالت: جاءت هند بنت عتبة إلى رسول الله صلى الله عليه وسلم لتبايعه فنظر إلى يدها فقال \"اذهبي فغيري يدك\" فذهبت فغيرتها بحناء ثم جاءت فقال \"أبايعك على أن لا تشركي بالله شيئا\" فبايعته وفي يدها سواران من ذهب فقالت ما تقول في هذين السوارين فقال \"جمرتين من نار جهنم\". وقال ابن أبي حاتم حدثنا أبو سعيد الأشج حدثنا ابن فضيل عن حصين عن عامر هو الشعبي قال: بايع رسول الله صلى الله عليه وسلم النساء وفي يده ثوب قد وضعه على كفه ثم قال \"ولا تقتلن أولادكن\" فقالت امرأة تقتل آباءهم وتوصينا بأولادهم؟ قال وكان بعد ذلك إذا جاء النساء يبايعنه جمعهن فعرض عليهن فإذا أقررن رجعن فقوله تعالى \"يا أيها النبي إذا جاءك المؤمنات يبايعنك\" أي من جاءك منهن يبايع على هذه الشروط فبايعها على أن لا يشركن بالله شيئا ولا يسرقن أموال الناس الأجانب فأما إذا كان الزوج مقصرا في نفقتها فلها أن تأكل من ماله بالمعروف ما جرت به عادة أمثالها وإن كان من غير علمه عملا بحديث هند بنت عتبة أنها قالت يا رسول الله إن أبا سفيان رجل شحيح لا يعطيني من النفقة ما يكفيني ويكفي بني فهل علي جناح إن أخذت من ماله بغير علمه؟ فقال رسول الله صلى الله عليه وسلم \"خذي من ماله بالمعروف ما يكفيك ويكفي بنيك\" أخرجاه في الصحيحين وقوله تعالى \"ولا يزنين\" كقوله تعالى \"ولا تقربوا الزنا إنه كان فاحشة وساء سبيلا\" وفي حديث سمرة ذكر عقوبة الزناة بالعذاب الأليم في نار الجحيم وقال الإمام أحمد حدثنا عبدالرزاق أخبرنا معمر عن الزهري عن عروة عن عائشة قالت: جاءت فاطمة بنت عتبة تبايع رسول الله صلى الله عليه وسلم فأخذ عليها \"أن لا يشركن بالله شيئا ولا يسرقن ولا يزنين\" الآية قال فوضعت يدها على رأسها حياء فأعجبه ما رأى منها فقال عائشة أقري أيتها المرأة فوالله ما بايعنا إلا على هذا قالت فنعم إذا فبايعها بالآية وقال ابن أبي حاتم حدثنا أبو سعيد الأشج حدثنا ابن فضيل عن حصين عن عامر هو الشعبي قال بايع رسول الله صلى الله عليه وسلم النساء وعلى يده ثوب قد وضعه على كفه ثم قال ولا تقتلن أولادكن فقالت امرأة تقتل آباءهم وتوصي بأولادهم؟ قال وكان بعد ذلك إذا جاءت النساء يبايعنه جمعهن فعرض عليهم فإذا أقررن رجعن وقوله تعالى \"ولا يقتلن أولادهن\" وهذا يشمل قتله بعد وجوده كما كان أهل الجاهلية يقتلون أولادهم خشية الإملاق ويعم قتله وهو جنين كما قد يفعله بعض الجهلة من النساء تطرح نفسها لئلا تحبل إما لغرض فاسد أو ما أشبهه. وقوله تعالى \"ولا يأتين ببهتان يفترينه بين أيديهم وأرجلهن\" قال ابن عباس يعني لا يلحقن بأزواجهن غير أولادهم وكذا قال مقاتل. ويؤيد هذا الحديث الذي رواه أبو داود حدثنا أحمد بن صالح حدثنا ابن وهب حدثنا عمرو يعني ابن الحارث عن ابن الهاد عن عبدالله بن يونس عن سعيد المقبري عن أبي هريرة أنه سمع رسول الله صلى الله عليه وسلم ويقول حين نزلت آية الملاعنة \"أيما امرأة أدخلت على قوم من ليس منهم فليست من الله في شيء ولن يدخلها الله الجنة وأيما رجل جحد ولده وهو ينظر إليه احتجب الله منه وفضحه على رءوس الأولين والآخرين\" وقوله تعالى \"ولا يعصينك في معروف\" يعني فيما أمرتهن به من معروف ونهيتهن عنه من منكر. قال البخاري حدثنا عبدالله بن محمد حدثنا وهب بن جرير حدثنا أبي قال سمعت الزبير عن عكرمة عن ابن عباس في قوله تعالى \"ولا يعصينك في معروف\" قال إنما هو شرط شرطه الله للنساء. وقال ميمون بن مهران لم يجعل الله طاعة لنبيه إلا في المعروف والمعروف طاعة وقال ابن زيد أمر الله بطاعة رسوله وهو خيرة الله من خلقه في المعروف. وقد قال غيره من ابن عباس وأنس بن مالك وسالم بن أبي الجعد وأبي صالح وغير واحد نهاهن يومئذ عن النوح وقد تقدم حديث أم عطية في ذلك أيضا. وقال ابن جرير حدثنا بشر حدثنا يزيد حدثنا سعيد عن قتادة في هذه الآية ذكر لنا أن نبي الله صلى الله عليه وسلم أخذ عليهن النياحة ولا تحدثن الرجال إلا رجلا منكن محرما فقال عبدالرحمن بن عوف يا رسول الله إن لنا أضيافا وإنا نغيب عن نسائنا فقال رسول الله صلى الله عليه وسلم \"ليس أولئك عنيت ليس أولئك عنيت\" وقال ابن أبي حاتم حدثنا أبو زرعة حدثنا إبراهيم بن موسى الفراء أخبرنا ابن أبي زائدة حدثني مبارك عن الحسن قال كان فيما أخذ النبي صلى الله عليه وسلم ألا تحدثن الرجال إلا أن تكون ذات محرم فإن الرجل لا يزال يحدث المرأة حتى يمذي بين فخذيه. وقال ابن جرير حدثنا ابن حميد حدثنا هارون عن عمرو عن عاصم عن ابن سيرين عن أم عطية الأنصارية قالت كان فيما اشترط علينا رسول الله صلى الله عليه وسلم من المعروف حين بايعناه أن لا ننوح فقالت امرأة من بني فلان إن بني فلان أسعدوني فلا حتى أجزيهم فانطلقت فأسعدتهم ثم جاءت فبايعت قالت فما وفي منهن غيرها وغير أم سليم ابنة ملحان أم أنس بن مالك وقد روى البخاري هذا الحديث من طريق حفصة بنت سيرين عن أم عطية نسيبة الأنصارية رضي الله عنها وقد روي نحوه من وجه آخر أيضا قال: حدثنا ابن جرير حدثنا أبو كريب حدثنا أبو نعيم حدثنا عمرو بن فروخ القتات حدثني مصعب بن نوح الأنصاري قال: أدركت عجوزا لنا كانت فيمن بايع رسول الله صلى الله عليه وسلم قالت فأتيته لأبايعه فأخذ علينا فيما أخذ أن لا تنحن فقالت عجوز يا رسول الله إن أناسا قد كانوا أسعدوني على مصائب أصابتني وأنهم قد أصابتهم مصيبة فأنا أريد أسعدهم قال \"فانطلقي فكافئيهم\" فانطلقت فكافأتهم. ثم إنها أتته فبايعته وقال هو المعروف الذي قال الله عز وجل \"ولا يعصينك في معروف\" وقال ابن أبي حاتم حدثنا أحمد بن منصور الرمادي حدثنا الضبي حدثنا الحجاج بن صفوان عن أسيد بن أبي أسيد البزار عن امرأة من المبايعات قالت كان فيما أخذ علينا رسول الله صلى الله عليه وسلم أن لا نعصيه في معروف أن لا نخمش وجها ولا ننشر شعرا ولا نشق جيبا ولا ندعو ويلا وقال ابن جرير حدثنا محمد بن سنان القزاز حدثنا إسحاق بن إدريس حدثنا إسحاق بن عثمان أبو يعقوب حدثني إسماعيل بن عبدالرحمن بن عطية عن جدته أم عطية قالت لما قدم رسول الله صلى الله عليه وسلم جمع نساء الأنصار في بيت ثم أرسل إلينا عمر بن الخطاب رضي الله عنه فقام على الباب وسلم علينا فرددن أو فرددنا عليه السلام ثم قال أنا رسول رسول الله صلى الله عليه وسلم إليكن قالت فقلنا مرحبا برسول الله وبرسول رسول الله فقال تبايعن على أن لا تشركن بالله شيئا ولا تسرقن ولا تزنين قالت فقلنا نعم قالت فمد يده من خارج الباب أو البيت ومددنا أيدينا من داخل البيت ثم قال: اللهم اشهد قالت وأمرنا في العيدين أن نخرج فيه الحيض والعواتق ولا جمعة علينا ونهانا عن اتباع الجنائز قال إسماعيل فسألت جدتي عن قوله تعالى \"ولا يعصينك في معروف\" قالت النياحة. وفي الصحيحين من طريق الأعمش عن عبدالله بن مرة عن مسروق عن عبدالله بن مسعود قال: قال رسول الله صلى الله عليه وسلم \"ليس منا من ضرب الخدود وشق الجيوب ودعا بدعوى الجاهلية\" وفي الصحيحين أيضا عن أبي موسى أن رسول الله صلى الله عليه وسلم برئ من الصالقة والحالقة والشاقة. وقال الحافظ أبو يعلى حدثنا هدبة بن خالد حدثنا أبان بن يزيد حدثنا يحيى بن أبي كثير أن زيدا حدثه أن أبا سلام حدثه أن أبا مالك الأشعري حدثه أن رسول الله صلى الله عليه وسلم قال \"أربع في أمتي من أمر الجاهلية لا يتركونهن: الفخر في الأحساب والطعن في الأنساب والاستسقاء بالنجوم والنياحة على الميت - وقال - النائحة إذا لم تتب قبل موتها تقام يوم القيامة وعليها سربال من قطران ودرع من جرب\" ورواه مسلم في صحيحه منفردا به من حديث أبان بن يزيد العطار به وعن أبي سعيد أن رسول الله صلى الله عليه وسلم لعن النائحة والمستمعة رواه أبو داود. وقال ابن جرير حدثنا أبو كريب حدثنا وكيع عن يزيد مولى الصهباء عن شهر بن حوشب عن أم سلمة عن رسول الله صلى الله عليه وسلم في قوله تعالى \"ولا يعصينك في معروف\" قال \"النوح\" ورواه الترمذي في التفسير عن عبد بن حميد عن أبي نعيم وابن ماجه عن أبي بكر بن أبي شيبة عن وكيع كلاهما عن يزيد بن عبدالله الشيباني مولى الصهباء به وقال الترمذي حسن غريب."
    },
    {
      "ayah": 13,
      "surah": 60,
      "text": "ينهى تبارك وتعالى عن موالاة الكافرين في آخر هذه السورة كما نهى عنها في أولها فقال تعالى \"يا أيها الذين آمنوا لا تتولوا قوما غضب الله عليهم\" يعني اليهود والنصارى وسائر الكفار ممن غضب الله عليه ولعنه واستحق من الله الطرد والإبعاد فكيف توالونهم وتتخذونهم أصدقاء وأخلاء وقد يئسوا من الآخرة أي ثواب الآخرة ونعيمها في حكم الله عز وجل. وقوله تعالى \"كما يئس الكفار من أصحاب القبور\" فيه قولان أحدهما كما يئس الكفار الأحياء من قراباتهم الذين في القبور أن يجتمعوا بهم بعد ذلك لأنهم لا يعتقدون بعثا ولا نشورا فقد انقطع رجاؤهم منهم فيما يعتقدونه. قال العوفي عن ابن عباس \"يا أيها الذين آمنوا لا تتولوا قوما غضب الله عليهم\" إلى آخر السورة يعني من مات من الذين كفروا فقد يئس الأحياء من الذين كفروا أن يرجعوا إليهم أو يبعثهم الله عز وجل وقال الحسن البصري \"كما يئس الكفار من أصحاب القبور\" قال الكفار الأحياء قد يئسوا من الأموات وقال قتادة كما يئس الكفار أن يرجع إليهم أصحاب القبور الذين ماتوا وكذا قال الضحاك رواهن ابن جرير والقول الثاني معناه كما يئس الكفار الذين هم في القبور من كل خير قال الأعمش عن أبي الضحى عن مسروق عن ابن مسعود \"كما يئس الكفار من أصحاب القبور\" قال كما يئس هذا الكافر إذا مات وعاين ثوابه واطلع عليه وهذا قول مجاهد وعكرمة ومقاتل وابن زيد والكلبي ومنصور وهو اختيار ابن جرير رحمه الله. آخر تفسير سورة الممتحنة ولله الحمد والمنة."
    },
    {
      "ayah": 2,
      "surah": 60,
      "text": "\"إن يثقفونكم يكونوا لكم أعداء ويبسطوا إليكم أيديهم وألسنتهم بالسوء\" أي لو قدروا عليكم لما اتقوا فيكم من أذى ينالونكم به بالمقال والفعال \"وودوا لو تكفرون\" أي ويحرصون على أن لا تنالوا خيرا فهم عداوتهم لكم كامنة وظاهرة فكيف توالون مثل هؤلاء؟ وهذا تهييج على عداوتهم أيضا."
    },
    {
      "ayah": 3,
      "surah": 60,
      "text": "وقوله تعالى \"لن تنفعكم أرحامكم ولا أولادكم يوم القيامة يفصل بينكم والله بما تعملون بصير\" أي قراباتكم لا تنفعكم عند الله إذا أراد الله بكم سوءا ونفعهم لا يصل إليكم إذا أرضيتموهم بما يسخط الله ومن وافق أهله على الكفر ليرضيهم فقد خاب وخسر وضل عمله ولا ينفعه عند الله قرابته من أحد ولو كان قريبا إلى نبي من الأنبياء. قال الإمام أحمد حدثنا عفان حدثنا حماد عن ثابت عن أنس أن رجلا قال يا رسول الله أين أبي؟ قال \"في النار\" فلما قفى دعاه فقال \"إن أبي وأباك في النار\" ورواه مسلم وأبو داود من حديث حماد بن سلمة به."
    },
    {
      "ayah": 4,
      "surah": 60,
      "text": "يقول تعالى لعباده المؤمنين الذين أمرهم بمصارمة الكافرين وعداوتهم ومجانبتهم والتبري منهم \"قد كانت لكم أسوة حسنة في إبراهيم والذين معه\" أي وأتباعه الذين آمنوا معه \"إذ قالوا لقومهم إنا برآء منكم\" أي تبرأنا منكم \"ومما تعبدون من دون الله كفرنا بكم\" أي بدينكم وطريقكم \"وبدا بيننا وبينكم العداوة والبغضاء أبدا\" يعني وقد شرعت العداوة والبغضاء من الآن بيننا وبينكم ما دمتم على كفركم فنحن أبدا نتبرأ منكم ونبغضكم \"حتى تؤمنوا بالله وحده\" أي إلى أن توحدوا الله فتعبدوه وحده لا شريك له وتخلعوا ما تعبدون معه من الأوثان والأنداد. وقوله تعالى \"إلا قول إبراهيم لأبيه لأستغفرن لك\" أي لكم في إبراهيم وقومه أسوة حسنة تأسون بها إلا في استغفار إبراهيم لأبيه فإنه إنما كان عن موعدة وعدها إياه فلما تبين له أنه عدو لله تبرأ منه وذلك أن بعض المؤمنين كانوا يدعون لآبائهم الذين ماتوا على الشرك ويستغفرون لهم ويقولون إن إبراهيم كان يستغفر لأبيه فأنزل الله عز وجل \"ما كان للنبي والذين آمنوا أن يستغفروا للمشركين ولو كانوا أولى قربي من بعد ما تبين لهم أنهم أصحاب الجحيم وما كان استغفار إبراهيم لأبيه إلا عن موعدة وعدها إياه فلما تبين له أنه عدو لله تبرأ منه إن إبراهيم لأواه حليم\". وقال تعالى في هذه الآية الكريمة \"قد كانت لكم أسوة حسنة في إبراهيم والذين معه إذ قالوا لقومهم إنا برآء منكم - إلى قوله تعالى - إلا قول إبراهيم لأبيه لأستغفرن لك وما أملك لك من الله شيء\" أي ليس لكم في ذلك أسوة أي في الاستغفار للمشركين هكذا قال ابن عباس ومجاهد وقتادة ومقاتل بن حيان والضحاك وغير واحد. ثم قال تعالى مخبرا عن قول إبراهيم والذين معه حين فارقوا قومهم وتبرؤوا منهم فلجأوا إلى الله وتضرعوا إليه فقالوا \"ربنا عليك توكلنا وإليك أنبنا وإليك المصير\" أي توكلنا عليك في جميع الأمور وسلمنا أمورنا إليك وفوضناها إليك وإليك المصير: أي المعاد في الدار الآخرة."
    },
    {
      "ayah": 5,
      "surah": 60,
      "text": "\"ربنا لا تجعلنا فتنة للذين كفروا\" قال مجاهد: معناه لا تعذبنا بأيديهم ولا بعذاب من عندك فيقولوا لو كان هؤلاء على حق ما أصابهم هذا وكذا قال الضحاك وقال قتادة لا تظهرهم علينا فيفتنونا بذلك يرون أنهم إنما ظهروا علينا لحق هم عليه واختاره ابن جرير وقال علي بن أبي طلحة عن ابن عباس لا تسلطهم علينا فيفتنونا وقوله تعالى \"واغفر لنا ربنا إنك أنت العزيز الحكيم\" أي واستر ذنوبنا عن غيرك واعف عنها فيما بيننا وبينك \"إنك أنت العزيز\" أي الذي لا يضام من لاذ بجنابك \"الحكيم\" في أقوالك وأفعالك وشرعك وقدرك."
    },
    {
      "ayah": 6,
      "surah": 60,
      "text": "ثم قال تعالى \"لقد كان لكم فيهم أسوة حسنة لمن كان يرجو الله واليوم الآخر\" وهذا تأكيد لما تقدم ومستثنى منه ما تقدم أيضا لأن هذه الأسوة المثبتة ههنا هي الأولى بعينها. وقوله تعالى \"لمن كان يرجو الله واليوم الآخر\" تهييج إلى ذلك لكل مؤمن بالله والمعاد وقوله تعالى \"ومن يتول\" أي عما أمر الله به \"فإن الله هو الغني الحميد\" كقوله تعالى \"إن تكفروا أنتم ومن في الأرض جميعا فإن الله لغني حميد\" وقال علي بن أبي طلحة عن ابن عباس الغني الذي قد كمل في غناه وهو الله هذه صفته لا تنبغي إلا له ليس له كفء وليس كمثله شيء سبحان الله الواحد القهار والحميد المستحمد إلى خلقه أي هو المحمود في جميع أقواله وأفعاله لا إله غيره ولا رب سواه."
    },
    {
      "ayah": 7,
      "surah": 60,
      "text": "يقول تعالى لعباده المؤمنين بعد أن أمرهم بعداوة الكافرين \"عسى الله أن يجعل بينكم وبين الذين عاديتم منهم مودة\" أي محبة بعد البغضة ومودة بعد النفرة وألفة بعد الفرقة \"والله قدير\" أي على ما يشاء من الجمع بين الأشياء المتنافرة والمتباينة والمختلفة فيؤلف بين القلوب بعد العداوة والقساوة فتصبح مجتمعة متفقة كما قال تعالى ممتنا على الأنصار \"واذكروا نعمة الله عليكم إذ كنتم أعداء فألف بين قلوبكم فأصبحتم بنعمته إخوانا وكنتم على شقا حفرة من النار فأنقذكم منها\" الآية وكذا قال النبي صلى الله عليه وسلم \"ألم أجدكم ضلالا فهداكم الله بي وكنتم متفرقين فألفكم الله بي؟ \" وقال الله تعالى \"هو الذي أيدك بنصره وبالمؤمنين وألف بين قلوبهم لو أنفقت ما في الأرض جميعا ما ألفت بين قلوبهم ولكن الله ألف بينهم إنه عزيز حكيم\". وفي الحديث \"أحبب حبيبك هونا ما فعسى أن يكون بغيضك يوما ما وأبغض بغيضك هونا ما فعسى أن يكون حبيبك يوما ما\" وقال الشاعر: وقد يجمع الله الشتيتين بعد ما يظنان كل الظن أن لا تلاقيا وقوله تعالى \"والله غفور رحيم\" أي يغفر للكافرين كفرهم إذا تابوا منه وأنابوا إلى ربهم وأسلموا له وهو الغفور الرحيم بكل من تاب إليه من أي ذنب كان. وقد قال مقاتل بن حيان إن هذه الآية نزلت في أبي سفيان صخر بن حرب فإن رسول الله صلى الله عليه وسلم تزوج ابنته فكانت هذه مودة ما بينه وبينه وفي هذا الذي قاله مقاتل نظر فإن رسول الله صلى الله عليه وسلم تزوج بأم حبيبة بنت أبي سفيان قبل الفتح وأبو سفيان إنما أسلم ليلة الفتح بلا خلاف وأحسن من هذا ما رواه ابن أبي حاتم حيث قال قرئ على محمد بن عزيز حدثني سلامة حدثني عقيل حدثني ابن شهاب أن رسول الله صلى الله عليه وسلم استعمل أبا سفيان صخر بن حرب على بعض اليمن فلما قبض رسول الله صلى الله عليه وسلم أقبل فلقي ذا الخمار مرتدا فقاتله فكان أول من قاتل في الردة وجاهد عن الدين قال ابن شهاب وهو ممن أنزل الله فيه \"عسى الله أن يجعل بينكم وبين الذين عاديتم منهم مودة\" الآية. وفي صحيح مسلم عن ابن عباس أن أبا سفيان قال يا رسول الله ثلاث أعطنيهن قال \"نعم\" قال تأمرني أقاتل الكفار كما كنت أقاتل المسلمين قال \"نعم\" قال ومعاوية تجعله كاتبا بين يديك قال \"نعم\" قال وعندي أحسن العرب وأجمله أم حبيبة بنت أبي سفيان أزوجكها - الحديث - وقد تقدم الكلام عليه."
    },
    {
      "ayah": 8,
      "surah": 60,
      "text": "وقوله تعالى \"لا ينهاكم الله عن الذين لم يقاتلونكم في الدين ولم يخرجوكم من دياركم ولم يظاهروا\" أي يعاونوا على إخراجكم أي لا ينهاكم عن الإحسان إلى الكفرة الذين لا يقاتلونكم فى الدين كالنساء والضعفة منهم \"أن تبروهم\" أي تحسنوا إليهم \"وتقسطوا إليهم\" أي تعدلوا \"إن الله يحب المقسطين\". قال الإمام أحمد حدثنا أبو معاوية حدثنا هشام بن عروة عن فاطمة بنت المنذر عن أسماء بنت أبي بكر رضي الله عنهما قالت قدمت أمي وهي مشركة في عهد قريش إذ عاهدوا فأتيت النبي صلى الله عليه وسلم فقلت يا رسول الله إن أمي قدمت وهي راغبة أفأصلها؟ قال \"نعم صلي أمك\" أخرجاه وقال الإمام أحمد حدثنا عارم حدثنا عبدالله بن المبارك حدثنا مصعب بن ثابت حدثنا عامر بن عبدالله بن الزبير عن أبيه قال قدمت قتيلة على ابنتها أسماء بنت أبي بكر بهدايا ضباب وقرظ وسمن وهي مشركة فأبت أسماء أن تقبل هديتها وأن تدخلها بيتها فسألت عائشة النبي صلى الله عليه وسلم فأنزل الله تعالى \"لا ينهاكم الله عن الذين لم يقاتلوكم في الدين\" إلى آخر الأية فأمرها أن تقبل هديتها وأن تدخلها بيتها. وهكذا رواه ابن جرير وابن أبي حاتم من حديث مصعب بن ثابت به وفي رواية لأحمد وابن جرير قتيلة بنت عبدالعزى بن سعد من بني مالك بن حسل وزاد ابن أبي حاتم في المدة التي كانت بين قريش ورسول الله صلى الله عليه وسلم وقال أبو بكر أحمد بن عمرو بن عبدالخالق البزار حدثنا عبدالله بن شبيب حدثنا أبو بكر بن أبي شيبة حدثنا أبو قتادة العدوي عن ابن أخي الزهري عن الزهري عن عروة عن عائشة وأسماء أنهما قالتا قدمت علينا أمنا المدينة وهي مشركة في الهدنة التي كانت بين رسول الله صلى الله عليه وسلم وبين قريش فقلنا يا رسول الله إن أمنا قدمت علينا المدينة وهي راغبة أفنصلها؟ قال \"نعم فصلاها\" ثم قال وهذا الحديث لا نعلمه يروى عن الزهري عن عروة عن عائشة إلا من هذا الوجه \"قلت\" وهو منكر بهذا السياق لأن أم عائشة هي أم رومان وكانت مسلمة مهاجرة وأم أسماء غيرها كما هو مصرح باسمها في هذه الأحاديث المتقدمة والله أعلم وقوله تعالى \"إن الله يحب المقسطين\" قد تقدم تفسير ذلك في سورة الحجرات وأورد الحديث الصحيح \"المقسطون على منابر من نور عن يمين العرش الذين يعدلون في حكمهم وأهاليهم وما ولوا\"."
    },
    {
      "ayah": 9,
      "surah": 60,
      "text": "وقوله تعالى \"إنما ينهاكم الله عن الذين قاتلوكم فى الدين وأخرجوكم من دياركم وظاهروا على إخرجكم أن تولوهم\" أي إنما ينهاكم عن موالاة هؤلاء الذين ناصبوكم وأخرجوكم وعاونوا على إخراجكم ينهاكم الله عز وجل عن موالاتهم ويأمركم بمعاداتهم ثم أكد الوعيد على موالاتهم فقال \"ومن يتولهم فأولئك هم الظالمون\" كقوله تعالى \"يا أيها الذين آمنوا لا تتخذوا اليهود والنصارى أولياء بعضهم أولياء بعض ومن يتولهم منكم فإنه منهم إن الله لا يهدي القوم الظالمين\"."
    }
  ]
}
