{
  "ayahs": [
    {
      "ayah": 1,
      "surah": 61,
      "text": "سورة الصف: قال الإمام أحمد حدثنا يحيى بن آدم حدثنا ابن المبارك عن الأوزاعي عن يحيى بن أبي كثير عن أبي سلمة وعن عطاء بن يسار عن أبي سلمة عن عبدالله بن سلام قال تذاكرنا أيكم يأتي رسول الله صلى الله عليه وسلم فيسأله أي الأعمال أحب إلى الله فلم يقم أحد منا فأرسل رسول الله صلى الله عليه وسلم إلينا رجلا رجلا فجمعنا فقرأ علينا هذه السورة يعني سورة الصف كلها هكذا رواه الإمام أحمد وقال ابن أبي حاتم حدثنا العباس بن الوليد بن مرثد البيروتي قراءة قال أخبرنى أبي سمعت الأوزاعي حدثني يحيى بن أبي كثير حدثني أبو سلمة بن عبدالرحمن حدثني عبدالله بن سلام أن أناسا من أصحاب رسول الله صلى الله عليه وسلم قالوا لو أرسلنا إلى رسول الله نسأله عن أحب الأعمال إلى الله عز وجل فلم يذهب إليه أحد منا وهبنا أن نسأله عن ذلك قال فدعا رسول الله صلى الله عليه وسلم أولئك النفر رجلا رجلا حتى جمعهم ونزلت فيهم هذه السورة سبح لله\" الصف \"قال عبدالله بن سلام فقرأها علينا رسول الله صلى الله عليه وسلم كلها قال أبو سلمة وقرأها علينا عبدالله بن سلام كلها قال يحيى بن أبي كثير وقرأها علينا أبو سلمة كلها قال الأوزاعي وقرأها علينا يحيى بن أبي كثير كلها قال أبي وقرأها علينا الأوزاعي كلها وقد رواه الترمذي عن عبدالله بن عبدالرحمن الدارمي حدثنا محمد بن كثير عن الأوزاعي عن يحيى بن أبي كثير عن أبي سلمة عن عبد الله بن سلام قال: قعدنا نفرا من أصحاب رسول الله صلى الله عليه وسلم فتذاكرنا فقلنا لو نعلم أي الأعمال أحب إلى الله عز وجل لعملناه فأنزل الله تعالى\" سبح لله ما في السموات وما في الأرض وهو العزيز الحيكم يا أيها الذين آمنوا لم تقولون مالا تفعلون \"قال عبدالله بن سلام فقرأها علينا رسول الله صلى الله عليه وسلم قال أبو سلمة فقرأها علينا ابن سلام قال يحيى فقرأها علينا أبو سلمة قال ابن كثير فقرأها علينا الأوزاعي قال عبدالله فقرأها علينا ابن كثير ثم قال الترمذي وقد خولف محمد بن كثير في إسناد هذا الحديث عن الأوزاعي فروى ابن المبارك عن الأوزاعي عن يحيى بن أبي كثير عن هلال بن أبي ميمونه عن عطاء بن يسار عن عبدالله بن سلام أو عن أبي سلمة عن عبدالله بن سلام قلت وهكذا رواه الإمام أحمد عن معمر عن ابن المبارك به قال الترمذي وروى الوليد بن مسلم هذا الحديث عن الأوزاعي نحو رواية محمد بن كثير قلت وكذا رواه الوليد بن يزيد عن الأوزاعي كما رواه ابن كثير قلت وقد أخبرني بهذا الحديث الشيخ المسند أبو العباس أحمد بن أبي طالب الحجار قراءة عليه وأنا أسمع أخبرنا أبو المنجا عبدالله بن عمر بن اللتي أخبرنا أبو الوقت عبد الأول بن عيسى بن شعيب السجزي قال أخبرنا أبو الحسن بن عبدالرحمن بن المظفر بن محمد بن داود الداودي أخبرنا أبو محمد عبدالله بن أحمد بن حمويه السرخسي أخبرنا عيسى بن عمر بن عمران السمرقندى. أخبرنا الإمام الحافظ أبو محمد عبدالله بن عبدالرحمن الدارمي بجميع مسنده أخبرنا محمد بن كثير عن الأوزاعي فذكر بإسناده مثله وتسلسل لنا قراءتها إلى شيخنا أبي العباس الحجار ولم يقرأها لأنه كان أميا وضاق الوقت عن تلقينها إياه ولكن أخبرنى الحافظ الكبير أبو عبدالله محمد بن أحمد بن عثمان رحمه الله الذهبي أخبرنا القاضي تقي الدين بن سليمان بن الشيخ أبي عمرو أخبرنا أبو المنجا بن اللتي فذكره بإسناده وتسلسل لي من طريقه وقرأها علي بكمالها ولله الحمد والمنة. يخبر تعالى أن جميع ما في السموات وما في الأرض من شيء يسبح له ويمجده ويقدسه ويصلي له ويوحده كقوله تعالى \"تسبح له السموات السبع والأرض ومن فيهن وإن من شيء إلا يسبح بحمده ولكن لا تفقهون تسبيحهم\" وقوله تعالى \"وهو العزيز\" أي منيع الجناب \"الحكيم\" في قدره وشرعه."
    },
    {
      "ayah": 10,
      "surah": 61,
      "text": "تقدم في حديث عبدالله بن سلام أن الصحابة رضي الله عنهم أرادوا أن يسألوا رسول الله صلى الله عليه وسلم عن أحب الأعمال إلى الله عز وجل ليفعلوه فأنزل الله تعالى هذه السورة ومن جملتها هذه الآية يا أيها الذين آمنوا هل أدلكم على تجارة تنجيكم من عذاب أليم ثم فسر هذه التجارة العظيمة التي لا تبور والتي هي محصلة للمقصود ومزيلة للمحذور."
    },
    {
      "ayah": 11,
      "surah": 61,
      "text": "فقال تعالى تؤمنون بالله ورسوله وتجاهدون في سبيل الله بأموالكم وأنفسكم ذلكم خير لكم إن كنتم تعلمون أي من تجارة الدنيا والكد لها والتصدي لها وحدها."
    },
    {
      "ayah": 12,
      "surah": 61,
      "text": "ثم قال تعالى يغفر لكم ذنوبكم أي إن فعلتم ما أمرتكم به ودللتكم عليه غفرت لكم الزلات وأدخلتكم الجنات والمساكن الطيبات والدرجات العاليات ولهذا قال تعالى ويدخلكم جنات تجري من تحتها الأنهار ومساكن طيبة في جنات عدن ذلك الفوز العظيم."
    },
    {
      "ayah": 13,
      "surah": 61,
      "text": "ثم قال تعالى وأخرى تحبونها أي وأزيدكم على ذلك زيادة تحبونها وهي نصر من الله وفتح قريب أي إذا قاتلتم في سبيله ونصرتم دينه تكفل الله بنصركم قال الله تعالى \" يا أيها الذين آمنوا إن تنصروا الله ينصركم ويثبت أقدامكم \" وقال تعالى \" ولينصرن الله من ينصره إن الله لقوي عزيز \" وقوله تعالى \" وفتح قريب \" أي عاجل فهذه الزيادة هي خير الدنيا موصول بنعيم الآخرة لمن أطاع الله ورسوله ونصر الله ودينه ولهذا قال تعالى وبشر المؤمنين."
    },
    {
      "ayah": 14,
      "surah": 61,
      "text": "يقول تعالى آمرا عباده المؤمنين أن يكونوا أنصار الله في جميع أحوالهم بأقوالهم وأفعالهم وأنفسهم وأموالهم وأن يستجيبوا لله ولرسوله كما استجاب الحواريون لعيسى حين قال من أنصاري إلى الله أي معيني في الدعوة إلى الله عز وجل؟ قال الحواريون وهم أتباع عيسى عليه السلام نحن أنصار الله أي نحن أنصارك على ما أرسلت به وموازروك على ذلك ولهذا بعثهم دعاة إلى الناس في بلاد الشام في الإسرائيلين واليونانيين وهكذا كان رسول الله صلى الله عليه وسلم يقول في أيام الحج \" من رجل يؤويني حتى أبلغ رسالة ربي؟د فإن قريشا قد منعوني أن أبلغ رسالة ربي \" حتى قيض الله عز وجل له الأوس والخزرج من أهل المدينة فبايعوه ووازروه وشارطوه أن يمنعوه من الأسود والأحمر إن هو هاجر إليهم فلما هاجر إليهم بمن معه من أصحابه وفوا له بما عاهدوا الله عليه ولهذا سماهم الله ورسوله الأنصار وصار ذلك علما عليهم رضي الله عنهم وأرضاهم وقوله تعالى فأمنت طائفة من بني إسرائيل وكفرت طائفة أى لما بلغ عيسى ابن مريم عليه الصلاة والسلام رسالة ربه إلى قومه ووازره من وازره من الحواريين اهتدت طائفة من بني إسرئيل بما جاءهم به وضلت طائفة فخرجت عما جاءهم به وجحدوا نبوته ورموه وأمه بالعظائم وهم اليهود عليهم لعائن الله المتتابعة إلى يوم القيامة وغلت فيه طائفة ممن اتبعه حتى رفعوه فوق ما أعطاه الله من النبوة وافترقوا فرقا وشيعا فمن قائل منهم إنه ابن الله وقائل إنه ثالث ثلاثة: الأب والابن وروح القدس ومن قائل إنه الله وكل هذه الأقوال مفصلة في سورة النساء. وقوله تعالى فأيدنا الذين آمنوا على عدوهم أي نصرناهم على من عاداهم من فرق النصارى فأصبحوا ظاهرين أي عليهم وذلك ببعثة محمد صلى الله عليه وسلم كما قال الإمام أبو جعفر بن جرير رحمه الله حدثني أبو السائب حدثنا أبو معاوية عن الأعمش عن المنهال يعني ابن عمرو عن سعيد بن جبير عن ابن عباس رضي الله عنهما قال: لما أراد الله عز وجل أن يرفع عيسى إلى السماء خرج إلى أصحابه وهم في بيت اثنا عشر رجلا من عين في البيت ورأسه يقطر ماء فقال \" إن منكم من يكفر بي اثنتي عشرة مرة بعد أن آمن بي قال ثم قال أيكم يلقى عليه شبهي فيقتل مكاني ويكون معي في درجتي \" قال فقام شاب من أحدثهم سنا فقال أنا فقال له \" اجلس \" ثم أعاد عليهم فقام الشاب فقال أنا فقال له \" اجلس \" ثم أعاد عليهم فقام الشاب فقال أنا فقال \" نعم أنت ذاك \" قال فألقي عليه شبه عيسى ورفع عيسى عليه السلام من روزنة في البيت إلى السماء قال وجاء الطلب من اليهود فأخذوا شبيهه فقتلوه وصلبوه وكفر به بعضهم أثنتي عشرة مرة بعد أن آمن به فتفرقوا فيه ثلاث فرق فقالت فرقة كان الله فينا ما شاء ثم صعد إلى السماء وهؤلاء اليعقوبية وقالت فرقة كان فينا ابن الله ما شاء الله ثم رفعه إليه وهؤلاء النسطورية وقال فرقة كان فينا عبدالله ورسوله ما شاء الله ثم رفعه الله إليه وهؤلاء المسلمون فتظاهرت الكافرتان على المسلمة فقتلوها فلم يزل الإسلام طامسا حتى بعث الله محمدا صلى الله عليه وسلم فآمنت طائفة من إسرائيل وكفرت طائقة يعني الطائفة التي كفرت من بني إسرائيل في زمن عيسى والطائفة التي آمنت في زمن عيسى فأيدنا الذين آمنوا على عدوهم فأصبحوا ظاهرين بإظهار محمد صلى الله عليه وسلم دينهم على دين الكفار هذا لفظه في كتابه عند تفسير هذه الآية الكريمة وهكذا رواه النسائي عند تفسير هذه الآية من سننه عن أبي كريب عن محمد بن العلاء عن أبى معاوية بمثله سواء فأمة محمد صلى الله عليه وسلم لا يزالون ظاهرين على الحق حتى يأتي أمر الله وهم كذلك وحتى يقاتل آخرهم الدجال مع المسيح عيسى ابن مريم عليه السلام كما وردت بذلك الأحاديث الصحاح والله أعلم آخر تفسير سورة الصف ولله الحمد والمنة."
    },
    {
      "ayah": 2,
      "surah": 61,
      "text": "وقوله تعالى يا أيها الذين آمنوا لم تقولون ما لا تفعلون إنكار على من يعد وعدا أو يقول قولا لا يفي به ولهذا استدل بهذه الآية الكريمة من ذهب من علماء السلف إلى أنه يجب الوفاء بالوعد مطلقا سواء ترتب عليه عزم الموعود أم لا واحتجوا أيضا من السنة بما ثبت في الصحيحين أن رسول الله صلى الله عليه وسلم قال \" آية المنافق ثلاث إذا وعد أخلف وإذا حدث كذب وإذا أؤتمن خان \" وفي الحديث الآخر في الصحيح \" أربع من كن فيه كان منافقا خالصا ومن كانت فيه واحدة منهن كانت فيه خصلة من نفاق حتى يدعها \" فذكر منهن إخلاف الوعد وقد استقصينا الكلام على هذين الحديثين في أول شرح البخاري ولله الحمد والمنة ولهذا أكد الله تعالى هذا الإنكار عليهم."
    },
    {
      "ayah": 3,
      "surah": 61,
      "text": "بقوله تعالى \" كبر مقتا عند الله أن تقولوا ما لا تفعلون \" وقد روى الإمام أحمد وأبو داود عن عبدالله بن عامر بن ربيعة قال: أتانا رسول الله صلى الله عليه وسلم وأنا صبي فذهبت لأخرج لألعب فقالت أمي يا عبدالله تعالى أعطيك فقال لها رسول الله صلى الله عليه وسلم \" وما أردت أن تعطيه؟ \" قالت تمرا فقال \" أما إنك لو لم تفعلي كتبت عليك كذبة \" وذهب الإمام مالك رحمه الله إلى أنه إذا تعلق بالوعد عزم على الموعود وجب الوفاء به كما لو قال لغيره تزوج ولك علي كل يوم كذا فتزوج وجب عليه أن يعطيه ما دام كذلك لأنه تعلق به حق آدمي وهو مبني على المضايقة وذهب الجمهور إلى أنه لا يجب مطلقا وحملوا الآية على أنها نزلت حين تمنوا فريضة الجهاد عليهم فلما فرض نكل عنه بعضهم كقوله تعالى \"ألم تر إلى الذين قيل لهم كفوا أيديكم وأقيموا الصلاة وآتوا الزكاة فلما كتب عليهم القتال إذا فريق منهم يخشون الناس كخشية الله أو أشد خشية وقالوا ربنا لم كتبت علينا القتال لولا أخرتنا إلى أجل قريب قل متاع الدنيا قليل والآخرة خير لمن اتقى ولا تظلمون فتيلا أينما تكونوا يدرككم الموت ولو كنتم في بروج مشيدة \" وقال تعالى \" ويقول الذين آمنوا لولا نزلت سورة فإذا أنزلت سورة محكمة وذكر فيها القتال رأيت الذين في قلوبهم مرض ينظرون إليك نظر المغشي عليه من الموت \" الآية وهكذا هذه الآية معناها كما قال علي بن أبي طلحة عن ابن عباس في قوله تعالى \"يا أيها الذين آمنوا لم تقولون ما لا تفعلون\" قال كان ناس من المؤمنين قبل أن يفرض الجهاد يقولون لوددنا أن الله عز وجل دلنا على أحب الأعمال إليه فنعمل به فأخبر الله نبيه أن أحب ألأعمال إيمان به لا شك فيه وجهاد أهل معصيته الذين خالفوا الإيمان ولم يقروا به فلما نزل الجهاد كره ذلك ناس من المؤمنين وشق عليهم أمره فقال الله سبحانه وتعالى يا أيها الذين آمنوا لم تقولون ما لا تفعلون وهذا اختيار ابن جرير وقال مقاتل بن حيان قال المؤمنون لو نعلم أحب الأعمال إلى الله لعملنا به فدلهم الله على أحب الأعمال إليه فقال \" إن الله يحب الذين يقاتلون في سبيله صفا \" فبين لهم فابتلوا يوم أحد بذلك فولوا عن النبي صلى الله عليه وسلم مدبرين فأنزل الله في ذلك \" يا أيها الذين آمنوا لم تقولون ما لا تفعلون \" وقال: أحبكم إلي من قاتل في سبيلي ومنهم من يقول أنزلت في شأن القتال يقول الرجل قاتلت ولم يقاتل وطعنت ولم يطعن وضربت ولم يضرب وصبرت ولم يصبر وقال قتادة والضحال نزلت توبيخا لقوم كانوا يقولون قتلنا ضربنا طعنا وفعلنا ولم يكونوا فعلوا ذلك وقال ابن زيد نزلت في قوم من المنافقين كانوا يعدون المسلمين النصر ولا يفون لهم بذلك وقال مالك عن زيد بن أسلم لم تقولون ما لا تقعلون قال الجهاد."
    },
    {
      "ayah": 4,
      "surah": 61,
      "text": "وقال ابن أبي نجيح عن مجاهد لم تقولون ما لا تفعلون - إلى قوله - كأنهم بنيان مرصوص فما بين ذلك في نفر من الأنصار فيهم عبدالله بن رواحة قالوا في مجلس لو نعلم أي الأعمال أحب إلى الله لعملنا به حتى نموت فأنزل الله تعالى هذا فيهم فقال عبدالله بن رواحة لا أبرح حبيسا في سبيل الله حتى أموت فقتل شهيدا وقال ابن أبى حاتم حدثنا أبي حدثنا فروة بن أبي المغراء حدثنا علي بن مسهر عن داود بن أبي هند عن أبي حرب بن أبي الأسود الديلي عن أبيه قال بعث أبو موسى إلى قراء أهل البصرة فدخل عليه منهم ثلثمائة رجل كلهم قد قرأ القرآن فقال أنتم قراء أهل البصرة وخيارهم وقال كنا نقرأ سورة كنا نشبهها بأحدى المسبحات فأنسيناها غير أني قد حفظت منها \" يا أيها الذين آمنوا لم تقولون ما لا تفعلون \" فتكتب شهادة في أعنافكم فتسألون عنها يوم القيامة ولهذا قال تعالى \" إن الله يحب الذين يقاتلون في سبيله صفا كأنهم بنيان مرصوص \" فهذا إخبار من الله تعالى بمحبته عباده المؤمنين إذا صفوا مواجهين لأعداء الله في حومة الوغى يقاتلون في سبيل الله من كفر بالله لتكون كلمة الله هي العليا ودينه هو الظاهر العالي على سائر الأديان. وقال الإمام أحمد حدثنا علي بن عبدالله حدثنا هشيم قال مجاهد أخبرنا مجالد عن أبى الوداك عن أبي سعيد الخدري رضي الله عنه قال قال رسول الله صلى الله عليه وسلم \" ثلاثة يضحك الله إليهم: الرجل يقوم من الليل والقوم إذا صفوا للصلاة والقوم إذا صفوا للقتال \" ورواه أبن ماجه من حديث مجالد عن أبي الوداك جبر بن نوف به وقال ابن أبي حاتم حدثنا أبي حدثنا أبو نعيم الفضل بن دكين حدثنا الأسود يعني ابن شيبان حدثني يزيد بن عبدالله بن الشخير قال: قال مطرف كان يبلغني عن أبي ذر حديث كنت أشتهي لقاءه فلقيته فقلت يا أبا ذر كان يبلغني عنك حديث فكنت أشتهي لقاءك فقال لله أبوك فقد لقيت فهات فقلت كان يبلغني عنك أنك تزعم أن رسول الله صلى الله عليه وسلم حدثكم أن الله يبغض ثلاثة ويحب ثلاثة قال أجل فلا إخالني أكذب على خليلى صلى الله عليه وسلم قلت فمن هؤلاء الثلاثة الذين يحبهم الله عز وجل؟ قال رجل غزا في سبيل الله خرج محتسبا مجاهدا فلقي العدو فقتل وأنتم تجدونه في كتاب الله المنزل ثم قرأ \" إن الله يحب الذين يقاتلون في سبيله صفا كأنهم بنيان مرصوص \" وذكر الحديث هكذا أورد هذا الحديث من هذا الوجه بهذا السياق وهذا اللفظ واختصره وقد أخرجه الترمذي والنسائي من حديث شعبة عن منصور بن المعتمر عن ربعي بن حراس عن زيد بن ظبيان عن أبي ذر بأبسط من هذا السياق وأتم وقد أوردناه في موضع آخر ولله الحمد وعن كعب الأحبار أنه قال: يقول الله تعالى لمحمد صلى الله عليه وسلم: عبدي المتوكل المختار ليس بفظ ولا غليظ ولا سخاب في الأسواق ولا يجزي بالسيئة السيئة ولكن يعفو ويغفر مولده بمكة وهجرته بطابة وملكه الشام وأمته الحمادون يحمدون الله على كل حال وفي كل منزلة لهم دوي كدوي النحل في جو السماء بالسحر يوضون أطرافهم ويأتزرون على أنصافهم صفهم في القتال مثل صفهم في الصلاة ثم قرأ \" إن الله يحب الذين يقاتلون في سبيله صفا كأنهم بنيان مرصوص \" رعاة الشمس يصلون الصلاة حيث أدركتهم ولو على ظهر دابة. رواه ابن أبى حاتم وقال سعيد بن جبير في قوله تعالى \" إن الله يحب الذين يقاتلون في سبيله صفا \" قال كان رسول الله صلى الله عليه وسلم لا يقاتل العدو إلا أن يصافهم وهذا تعليم من الله للمؤمنين قال وقوله تعالى \" كأنهم بنيان مرصوص \" أي ملتصق بعضه ببعض من الصف في القتال وقال مقاتل بن حيان ملتصق بعضه ببعض وقال ابن عباس كأنهم بنيان مرصوص مثبت لا يزول ملصق بعضه ببعض. وقال قتادة كأنهم بنيان مرصوص ألم تر إلى صاحب البنيان كيف لا يحب أن يختلف بنيانه؟ فكذلك الله عز وجل لا يحب أن يختلف أمره وأن الله صف المؤمنين في قتالهم وصفهم في صلاتهم فعليكم بأمر الله فإنه عصمة لمن أخذ به. أورد ذلك كله ابن أبي حاتم وقال ابن جرير حدثني سعيد بن عمرو السكوني حدثنا بقية بن الوليد عن أبي بكر بن أبي مريم عن يحيى بن جابر الطائي عن أبي بحرية قال كانوا يكرهون القتال على الخيل ويستحبون القتال على الأرض لقول الله عز وجل \" إن الله يحب الذين يقاتلون في سبيله صفا كأنهم بنيان مرصوص \" قال وكان أبو بحرية يقول: إذا رأيتمونى ألتفت في الصف فجؤا في لحيي."
    },
    {
      "ayah": 5,
      "surah": 61,
      "text": "يقول تعالى مخبرا عن عبده ورسوله وكليمه موسى بن عمران عليه السلام أنه قال لقومه لم تؤذونني وقد تعلمون أنى رسول اله إليكم أي لم توصلون الأذى إلي وأنتم تعلمون صدقي فيما جئتكم به من الرسالة. وفي هذا تسلية لرسول الله صلى الله عليه وسلم فيما أصابه من الكفار من قومه وغيرهم وأمر له بالصبر ولهذا قال \" رحمة الله على موسى: لقد أوذي بأكثر من هذا فصبر \" وفيه نهي للمؤمنين أن ينالوا من النبي صلى الله عليه وسلم أو يوصلوا إليه أذى كما قال تعالى \" يا أيها الذين آمنوا لا تكونوا كالذين آذوا موسى فبرأه الله مما قالوا وكان عند الله وجيها \" وقوله تعالى \" فلما زاغوا أزاغ الله قلوبهم \" أي فلما عدلوا عن اتباع الحق مع علمهم به أزاغ الله قلوبهم عن الهدى وأسكنها الشك والحيرة والخذلان كما قال تعالى \" ونقلب أفئدتهم وأبصارهم كما لم يؤمنوا به أول مرة ونذرهم في طغيانهم يعمهون \" وقال تعالى \" ومن يشاقق الرسول من بعد ما تبين له الهدى ويتبع غير سبيل المؤمنين نوله ما تولى ونصله جهنم وساءت مصيرا \" ولهذا قال تعالى في هذه الآية والله لا يهدي القوم الفاسقين."
    },
    {
      "ayah": 6,
      "surah": 61,
      "text": "وقوله تعالى وإذ قال عيسى ابن مريم يا بني إسرائيل إنى رسول الله إليكم مصدقا لما بين يدي من التوراة ومبشرا برسول يأتي من بعدي اسمه أحمد يعني التوراة قد بشرت بي وأنا مصداق ما أخبرت عنه وأنا مبشر بمن بعدي وهو الرسول النبي الأمي العربي المكي أحمد فعيسى عليه السلام وهو خاتم أنبياء بني إسرائيل وقد قام في ملإ بني إسرائيل مبشرا بمحمد وهو أحمد خاتم الأنبياء والمرسلين الذي لا رسالة بعده ولا نبوة وما أحسن ما أورد البخاري الذي قال فيه حدثنا أبو اليمان حدثنا شعيب عن الزهري قال أخبرني محمد بن جبير بن مطعم عن أبيه قال سمعت رسول الله صلى الله عليه وسلم يقول \" إن لي أسماء أنا محمد وأنا أحمد وأنا الماحي الذي يمحو الله به الكفر وأنا الحاشر الذي يحشر الناس على قدمي وأنا العاقب\" ورواه مسلم من حديث الزهري به نحوه. وقال أبو داود الطيالسى حدثنا المسعودي عن عمرو بن مرة عن أبي عبيدة عن أبي موسى قال سمى لنا رسول الله صلى الله عليه وسلم نفسه أسماء منها ما حفظنا فقال \" أنا محمد وأنا أحمد والحاشر والمقفي ونبي الرحمة والتوبة والملحمة \" ورواه مسلم من حديث الأعمش عن عمرو بن مرة به وقد قال الله تعالى الذين يتبعون الرسول النبي الأمي الذي يجدونه مكتربا عندهم في التوراة والإنجيل الآية وقال تعالى \" وإذا أخذ الله ميثاق النبيين لما آتيتكم من كتاب وحكمة ثم جاءكم رسول مصدق لما معكم لتؤمنن به ولتصرنه قال أأقررتم وأخذتم على ذلكم إصري قالوا أقررنا قال فاشهدوا وأنا معكم من الشاهدين \" قال ابن عباس: ما بعث الله نبيا إلا أخذ عليه العهد لئن بعث محمد وهو حي ليتبعنه وأخذ عليه أن يأخذ على أمته لئن بعث محمد وهم أحياء ليتبعنه وينصرنه وقال محمد بن إسحاق حدثني ثور بن يزيد عن خالد بن معدان عن أصحاب رسول الله صلى الله عليه وسلم أنهم قالوا يا رسول الله أخبرنا عن نفسك قال \" دعوة أبي إبراهيم وبشرى عيسى ورأت أمي حين حملت بي كأنه خرج منها نور أضاءت له قصور بصرى من أرض الشام \" وهذا إسناد جيد وروي له شواهد من وجوه أخر فقال الإمام أحمد حدثنا عبدالرحمن بن مهدي حدثنا معاوية بن صالح عن سعيد بن سويد الكلبي عن عبد الأعلى بن هلال السلمي عن العرباض بن سارية قال: قال رسول الله صلى الله عليه وسلم \"إنى عند الله لخاتم النبيين وإن آدم لمنجدل في طينته وسأنبئكم بأول ذلك دعوة أبي إبراهيم وبشارة عيسى بي ورؤيا أمي التي رأت وكذلك أمهات النبيين يرين \" وقال أحمد أيضا حدثنا أبو النضر حدثنا الفرج بن فضالة حدثنا لقمان بن عامر قال سمعت أبا أمامة قال: قلت يا رسول الله ما كان بدء أمرك؟ قال \" دعوة أبي إبراهيم وبشرى عيسى ورأت أمي أنه يخرج منها نور أضاءت له قصور الشام \". وقال أحمد أيضا حدثنا حسن بن موسى سمعت خديجا أخا زهير بن معاوية عن أبي إسحاق عن عبدالله بن عتبة عن عبدالله بن مسعود قال بعثنا رسول الله صلى الله عليه وسلم إلى النجاشي ونحن نحو من ثمانين رجلا منهم عبدالله بن مسعود وجعفر وعبدالله بن رواحة وعثمان بن مظعون وأبو موسى فأتوا النجاشي وبعثت قريش عمرو بن العاص وعمارة بن الوليد بهدية فلما دخلا على النجاشي سجدا له ثم ابتدراه عن يمينه وعن شماله ثم قالا له إن نفرا من بني عمنا نزلوا أرضك ورغبوا عنا وعن ملتنا قال فأين هم؟ قالا هم في أرضك فابعث إليهم فقال إليهم فقال جعفر أنا خطيبكم اليوم فاتبعوه فسلم ولم يسجد فقالوا له مالك لا تسجد للملك؟ قال إنا لا نسجد إلا لله عز وجل قال وما ذاك؟ قال إن الله بعث إلينا رسوله فأمرنا أن لا نسجد لأحد إلا لله عز وجل وأمرنا بالصلاة والزكاة قال عمرو بن العاص: فإنهم يخالفونك في عيسى ابن مريم قال ما تقولون في عيسى ابن مريم وأمه؟ قال: نقول كما قال الله عز وجل هو كلمة الله وروحه ألقاها إلى العذراء البتول التي لم يمسها بشر ولم يعترضها ولد قال فرفع عودا من الأرض ثم قال يا معشر الحبشة والقسيسين والرهبان والله ما يزيدون على الذي نقول فيه ما يساوي هذا مرحبا بكم وبمن جئتم من عنده أشهد أنه رسول الله وأنه الذي نجد في الإنجيل وأنه الذي بشر به عيسى ابن مريم انزلوا حيث شئتم والله لولا ما أنا فيه من الملك لأتيته حتى أكون أنا أحمل نعليه وأوضئه وأمر بهدية الآخرين فردت إليهما ثم تعجل عبدالله بن مسعود حتى أدرك بدرا وزعم أن النبي صلى الله عليه وسلم استغفر له حين بلغه موته وقد رويت هذه القصة عن جعفر وأم سلمة رضي الله عنهما وموضع ذلك كتاب السيرة والمقصد أن الأنبياء عليهم السلام لم تزل تنعته وتحكيه في كتبها على أممها وتأمرهم باتباعه ونصره وموازرته إذا بعث وكان ما اشتهر الأمر في أهل الأرض على لسان إبراهيم الخليل والد الأنبياء بعده حين دعا لأهل مكة أن يبعث الله فيهم رسولا منهم وكذا على لسان عيسى ابن مريم ولهذا قالوا أخبرنا عن بدء أمرك يعني في الأرض قال \" دعوة أبى إبراهيم وبشارة عيسى ابن مريم ورؤيا أمي التي رأت \" أي ظهر في أهل مكة أثر ذلك والإرهاص فذكره صلوات الله وسلامه عليه. وقوله تعالى فلما جاءهم بالبينات قالوا هذا سحر مبين قال ابن جريج وابن جرير فلما جاءهم أحمد أي المبشر به في الأعصار المتقادمة المنوه بذكره في القرون السالفة لما ظهر أمره وجاء بالبينات قال الكفرة والمخالفون هذا سحر مبين."
    },
    {
      "ayah": 7,
      "surah": 61,
      "text": "يقول تعالى ومن أظلم ممن افترى على الله الكذب وهو يدعى إلى الإسلام أي لا أحد أظلم ممن يفتري الكذب على الله ويجعل له أندادا وشركاء وهو يدعى إلى التوحيد والإخلاص ولهذا قال تعالى والله لا يهدي القوم الظالمين."
    },
    {
      "ayah": 8,
      "surah": 61,
      "text": "ثم قال تعالى يريدون ليطفئوا نور الله بأفواههم أي يحاولون أن يردوا الحق بالباطل ومثلهم في ذلك كمثل من يريد أن يطفىء شعاع الشمس بفيه وكما أن هذا مستحيل كذاك ذلك مستحيل ولهذا قال الله تعالى والله متم نوره ولو كره الكافرون."
    },
    {
      "ayah": 9,
      "surah": 61,
      "text": "ثم قال تعالى \" هو الذي أرسل رسوله بالهدى ودين الحق \" فالهدى هو ما جاء به من الإخبارات الصادقة والإيمان الصحيح والعلم النافع ودين الحق هو الأعمال الصالحة الصحيحة النافعة في الدنيا والآخرة \" ليظهره على الدين كله \" أي على سائر الأديان كما ثبت في الصحيح عن رسول الله صلى الله تعالى عليه وآله وسلم أنه قال \" إن الله زوى لي الأرض مشارقها ومغاربها وسيبلغ ملك أمتي ما زوى لي منها \". وقال الإمام أحمد: حدثنا محمد بن جعفر حدثنا شعبة عن محمد بن أبي يعقوب سمعت شقيق بن حيان يحدث عن مسعود بن قبيصة أوقبيصة بن مسعود يقول: صلى هذا الحي من محارب الصبح فلما صلوا قال شاب منهم: سمعت رسول الله صلى لله تعالى عليه وآله وسلم يقول \" إنه ستفتح لكم مشارق الأرض ومغاربها وإن عمالها في النار إلا من اتقى الله وأدى الأمانة \". وقال الإمام أحمد: حدثنا أبو المغيرة حدثنا صفوان حدثنا سليم بن عامر عن تميم الداري رضي الله عنه قال: سمعت رسول الله صلى الله عليه وسلم يقول \" ليبلغن هذا الأمر ما بلغ الليل والنهار ولا يترك الله بيت مدر ولا وبر إلا أدخله هذا الدين يعز عزيزا ويذل ذليلا عزا يعز الله به الإسلام وذلا يذل الله به الكفر \" فكان تميم الداري يقول: قد عرفت ذلك في أهل بيتي لقد أصاب من أسلم منهم الخير والشرف والعز ولقد أصاب من كان كافرا منهم الذل والصغار والجزية. وقال الإمام أحمد: حدثنا يزيد بن عبد ربه حدثنا الوليد بن مسلم حدثني ابن جابر سمعت سليم بن عامر قال: سمعت المقداد بن الأسود يقول: سمعت رسول الله صلى الله عليه وسلم يقول \" لا يبقى على وجه الأرض بيت مدر ولا وبر إلا دخلته كلمة الإسلام يعز عزيزا يذل ذليلا إما يعزهم الله فيجعلهم من أهلها وإما يذلهم فيدينون لها \" وفي المسند أيضا حدثنا محمد بن أبي عدي عن ابن عون عن ابن سيرين عن أبي حذيفة عن عدي بن حاتم سمعه يقول: دخلت على رسول الله صلى الله عليه وسلم فقال \" يا عدي أسلم تسلم \" فقلت إنى من أهل دين قال \" أنا أعلم بدينك منك \" فقلت أنت أعلم بديني مني؟ قال \" نعم ألست من الركوسية وأنت تأكل مرباع قومك؟ \" قلت بلى ! قال \" فإن هذا لا يحل لك في دينك \" قال فلم يعد أن قالها فتواضعت لها قال \" أما إني أعلم ما الذي يمنعك من الإسلام تقول إنما اتبعه ضعفة الناس ومن لا قوة له وقد رمتهم العرب أتعرف الحيرة؟ \" قلت لم أرها وقد سمعت بها قال \" فوالذي نفسي بيده ليتمن الله هذا الأمر حتى تخرج الظعينة من الحيرة حتى تطوف بالبيت من غير جوار أحد ولتفتحن كنوز كسرى بن هرمز\" قلت كسرى بن هرمز؟ قال \" نعم كسرى بن هرمز وليبذلن المال حتى لا يقبله أحد \" قال عدي: فهذه الظعينة تخرج من الحيرة فتطوف بالبيت من غير جوار أحد ولقد كنت فيمن فتح كنوز كسرى بن هرمز والذي نفسي بيده لتكونن الثالثة لأن رسول الله صلى الله عليه وسلم قد قالها. وقال مسلم: حدثنا أبو معن زيد بن يزيد الرقاشي حدثنا خالد بن الحارث حدثنا عبد الحميد بن جعفر عن الأسود بن العلاء عن أبي سلمة عن عائشة رضي الله عنهما \" قالت: سمعت رسول الله صلى الله عليه وسلم يقول \" لا يذهب الليل والنهار حتى تعبد اللات والعزى \" فقلت يا رسول الله إن كنت لأظن حين أنزل الله عز وجل \" هو الذي أرسل رسوله بالهدى ودين الحق \" الآية أن ذلك تام قال \" إنه سيكون من ذلك ما شاء الله عزوجل ثم يبعث الله ريحا طيبة فيتوفى كل من كان في قلبه مثقال حبة خردل من إيمان فيبقى من لا خير فيه فيرجعون إلى دين آبائهم \"."
    }
  ]
}
