{
  "ayahs": [
    {
      "ayah": 1,
      "surah": 62,
      "text": "سورة الجمعة: عن ابن عباس وأبي هريرة رضي الله عنهما أن رسول الله صلى الله عليه وسلم كان يقرأ في صلاة الجمعة بسورة الجمعة والمنافقين. رواه مسلم في صحيحه. يخبر تعالى أنه يسبح له ما في السموات وما في الأرض أي من جميع المخلوقات ناطقها وجامدها كما قال تعالى \"وإن من شيء إلا يسبح بحمده\" ثم قال تعالى \"الملك القدوس\" أي هو مالك السموات والأرض المتصرف فيها بحكمه وهو المقدس أي المنزه عن النقائص الموصوف بصفات الكمال \"العزيز الحكيم\" أي ذو العزة الحكمة في شرعه وقدره."
    },
    {
      "ayah": 10,
      "surah": 62,
      "text": "وقوله تعالى \"فإذا قضيت الصلاة\" أي فرغ منها \"فانتشروا في الأرض وابتغوا من فضل الله\" لما حجر عليهم في التصرف بعد النداء وأمرهم بالاجتماع أذن لهم بعد الفراغ في الانتشار في الأرض والابتغاء من فضل الله كما كان عراك بن مالك رضي الله عنه إذا صلى الجمعة انصرف فوقف على باب المسجد فقال: اللهم إني أجبت دعوتك وصليت فريضتك وانتشرت كما أمرتني فارزقني من فضلك وأنت خير الرازقين رواه ابن أبي حاتم. وروي عن بعض السلف أنه قال: من باع واشترى في يوم الجمعة بعد الصلاة بارك الله له سبعين مرة لقول الله تعالى \"فإذا قضيت الصلاة فانتشروا في الأرض وابتغوا من فضل الله\". وقوله تعالى \"واذكروا الله كثيرا لعلكم تفلحون\" أي حال بيعكم وشرائكم وأخذكم وإعطائكم اذكروا الله ذكرا كثيرا ولا تشغلكم الدنيا عن الذي ينفعكم في الدار الآخرة ولهذا جاء في الحديث \"من دخل سوقا من الأسواق فقال لا إله إلا الله وحده لا شريك له له الملك وله الحمد وهو على كل شيء قدير كتب الله له ألف ألف حسنة ومحا عنه ألف ألف سيئة\". وقال مجاهد: لا يكون العبد من الذاكرين الله كثيرا حتى يذكر الله قائما وقاعدا ومضطجعا."
    },
    {
      "ayah": 11,
      "surah": 62,
      "text": "يعاتب تبارك وتعالى على ما كان وقع من الانصراف عن الخطبة يوم الجمعة إلى التجارة التي قدمت المدينة يومئذ فقال تعالى \"وإذا رأوا تجارة أو لهوا انفضوا إليها وتركوك قائما\" أي على المنبر تخطب هكذا ذكره غير واحد من التابعين منهم أبو العالية والحسن وزيد بن أسلم وقتادة وزعم مقاتل بن حيان أن التجارة كانت لدحيه بن خليفة قبل أن يسلم وكان معها طبل فانصرفوا إليها وتركوا رسول الله صلى الله عليه وسلم قائما على المنبر إلا القليل منهم وقد صح بذلك الخبر فقال الإمام أحمد حدثنا ابن إدريس عن حصين عن سالم بن أبي الجعد عن جابر قال: قدمت غير مرة المدينة ورسول الله صلى الله عليه وسلم يخطب فخرج الناس وبقي اثنا عشر رجلا فنزلت \"وإذا رأوا تجارة أو لهوا انفضوا إليها\" أخرجاه في الصحيحين من حديث سالم به. وقال الحافظ أبو يعلى حدثنا زكريا بن يحيى حدثنا هشيم عن حصين عن سالم بن أبي الجعد وأبي سفيان عن جابر بن عبدالله قال: بينما النبي صلى الله عليه وسلم يخطب يوم الجمعة فقدمت عير إلى المدينة فابتدرها أصحاب رسول الله صلى الله عليه وسلم حتى لم يبق مع رسول الله صلى الله عليه وسلم إلا اثنا عشر رجلا فقال رسول الله صلى الله عليه وسلم \"والذي نفسي بيده لو تتابعتم حتى لم يبق منكم أحد لسال بكم الوادي نارا\" ونزلت هذه الآية \"وإذا رأوا تجارة أو لهوا انفضوا إليها وتركوك قائما\" وقال كان في الاثني عشر الذين ثبتوا مع رسول الله صلى الله عليه وسلم أبو بكر وعمر رضي الله عنهما وفي قوله تعالى \"تركوك قائما\" دليل على أن الإمام يخطب يوم الجمعة قائما. وقد روى مسلم في صحيحه عن جابر بن سمرة قال: كانت للنبي صلى الله عليه وسلم خطبتان يجلس بينهما يقرأ القرآن ويذكر الناس ولكن ههنا شيء ينبغي أن يعلم هو: إن هذه القصة قد قيل إنها كانت لما كان رسول الله صلى الله عليه وسلم يقدم الصلاة يوم الجمعة على الخطبة كما رواه أبو داود في كتاب المراسيل حدثنا محمود بن خالد عن الوليد أخبرني أبو معاذ بكير ابن معروف أنه سمع مقاتل بن حيان يقول كان رسول الله صلى الله عليه وسلم يصلي يوم الجمعة قبل الخطبة مثل العيدين حتى إذا كان يوم والنبي صلى الله عليه وسلم يخطب وقد صلى الجمعة فدخل رجل فقال إن دحية بن خليفة قد قدم بتجارة يعني فانفضوا ولم يبق معه إلا نفر يسير وقوله تعالى \"قل ما عند الله\" أي الذي عند الله من الثواب في الدار الآخر \"خير من اللهو ومن التجارة والله خير الرازقين\" أي لمن توكل عليه وطلب الرزق في وقته آخر تفسير سورة الجمعة ولله الحمد والمنة وبه التوفيق والعصمة."
    },
    {
      "ayah": 2,
      "surah": 62,
      "text": "وقوله تعالى \"هو الذي بعث في الأميين رسولا منهم\" الأميون هم العرب كما قال تعالى \"وقل للذين أوتوا الكتاب والأميين أأسلمتم فإن أسلموا فقد اهتدوا وإن تولوا فإنما عليك البلاغ والله بصير بالعباد\" وتخصيص الأميين بالذكر لا ينفي من عداهم ولكن المنة عليهم أبلغ وأكثر كما قال تعالى في قوله \"وإنه لذكر لك ولقومك\" وهو ذكر لغيرهم يتذكرون به وكذا قال تعالى \"وأنذر عشيرتك الأقربين\" وهذا وأمثاله لا ينافي قوله تعالى \"قل يا أيها الناس إني رسول الله إليكم جميعا\" وقوله \"لأنذركم به ومن بلغ\" وقوله تعالى إخبارا عن القرآن \"ومن يكفر به من الأحزاب فالنار موعده\" إلى غير ذلك من الآيات الدالة على عموم بعثته صلوات الله وسلامه عليه إلى جميع الخلق أحمرهم وأسودهم وقد قدمنا تفسير ذلك في سورة الأنعام بالآيات والأحاديث الصحيحة ولله الحمد والمنة وهذه الآية هي مصداق إجابة الله لخليله إبراهيم حين دعا لأهل مكة أن يبعث الله فيهم رسولا منهم يتلو عليهم آياته ويزكيهم ويعلمهم الكتاب والحكمة فبعثه الله سبحانه وتعالى وله الحمد والمنة على حين فترة من الرسل وطموس من السبل وقد اشتدت الحاجة إليه وقد مقت الله أهل الأرض عربهم وعجمهم إلا بقايا من أهل الكتاب أى نزرا يسيرا ممن تمسك بما بعث الله به عيسى ابن مريم عليه السلام ولهذا قال تعالى \"هو الذي بعث في الأميين رسولا منهم يتلو عليهم آياته ويزكيهم ويعلمهم الكتاب والحكمة وإن كانوا من قبل لفي ضلال مبين\" وذلك أن العرب كانوا قديما متمسكين بدين إبراهيم الخليل عليه السلام فبدلوه وغيروه وقلبوه وخالفوه واستبدلوا بالتوحيد شركا باليقين شكا وابتدعوا أشياء لم يأذن بها الله وكذلك أهل الكتاب قد بدلوا كتبهم وحرفوها وغيروها وأولوها فبعث الله محمدا صلوات الله وسلامه عليه بشرع عظيم كامل شامل لجميع الخلق فيه هدايتهم والبيان لجميع ما يحتاجون إليه من أمر معاشهم ومعادهم والدعوة لهم إلى ما يقربهم إلى الجنة ورضا الله عنهم والنهي عما يقربهم إلى النار وسخط الله تعالى حاكم وفاصل لجميع الشبهات والشكوك والريب في الأصول والفروع وجمع له تعالى وله الحمد والمنة جميع المحاسن ممن كان قبله وأعطاه ما لم يعط أحدا من الأولين ولا يعطيه أحدا من الآخرين فصلوات الله وسلامه عليه دائما إلى يوم الدين."
    },
    {
      "ayah": 3,
      "surah": 62,
      "text": "وقوله تعالى \"وآخرين منهم لما يلحقوا بهم وهو العزيز الحكيم\" قال الإمام أبو عبدالله البخاري رحمه الله تعالى حدثنا عبدالعزيز بن عبدالله حدثنا سليمان بن بلال عن ثور عن أبي الغيث عن أبي هريرة رضي الله عنه قال: كنا جلوسا عند النبي صلى الله عليه وسلم فأنزلت عليه سورة الجمعة \"وآخرين منهم لما يلحقوا بهم\" قالوا من هم يا رسول الله؟ فلم يراجعهم حتى سئل ثلاثا وفينا سلمان الفارسي فوضع رسول الله صلى الله عليه وسلم يده على سلمان الفارسي ثم قال \"لو كان الإيمان عند الثريا لناله رجال أو رجل من هؤلاء\" ورواه مسلم والترمذي والنسائي وابن أبي حاتم وابن جرير من طرق عن ثور بن يزيد الديلي عن سالم أبي الغيث عن أبي هريرة به ففي هذا الحديث دليل على أن هذه السورة مدنية وعلى عموم بعثته صلى الله عليه وسلم إلى جميع الناس لأنه فسر قوله تعالى \"وآخرين منهم\" بفارس. ولهذا كتب كتبه إلى فارس والروم وغيرهم من الأمم يدعوهم إلى الله عز وجل وإلى اتباع ما جاء به ولهذا قال مجاهد وغير واحد فى قوله تعالى \"وآخرين منهم لما يلحقوا بهم\" قال هم الأعاجم وكل من صدق النبي صلى الله عليه وسلم من غير العرب وقال ابن أبي حاتم حدثنا أبي حدثنا إبراهيم بن العلاء الزبيدي حدثنا الوليد بن مسلم حدثنا أبو محمد عيسى بن موسى عن أبي حازم عن سهل بن سعد الساعدي قال: قال رسول الله صلى الله عليه وسلم \"إن في أصلاب أصلاب أصلاب رجال ونساء من أمتي يدخلون الجنة بغير حساب\" ثم قرأ \"وآخرين منهم لما يلحقوا بهم\" يعني بقيه من بقي من أمة محمد صلى الله عليه وسلم في قوله تعالى \"وهو العزيز الحكيم\" أي ذو العزة والحكمة في شرعه وقدره."
    },
    {
      "ayah": 4,
      "surah": 62,
      "text": "يعني ما أعطاه الله محمدا صلى الله عليه وسلم من النبوة العظيمة وما خص به أمته من بعثته صلى الله عليه وسلم إليهم."
    },
    {
      "ayah": 5,
      "surah": 62,
      "text": "يقول تعالى ذاما لليهود الذين أعطوا التوراة وحملوها للعمل بها ثم لم يعملوا بها مثلهم في ذلك كمثل الحمار يحمل أسفارا أي كمثل الحمار إذا حمل كتبا لا يدري ما فيها فهو يحملها حملا حسيا ولا يدري ما عليه وكذلك هؤلاء في حملهم الكتاب الذي أوتوه حفظوه لفظا ولم يتفهموه. ولا عملوا بمقتضاه بل أولوه وحرفوه وبدلوه فهم أسوأ حالا من الحمير لأن الحمار لا فهم له وهؤلاء لهم فهوم لم يستعملوها ولهذا قال تعالى في الآية الأخرى \"أولئك كالأنعام بل هم أضل أولئك هم الغافلون\" وقال تعالى ههنا \"بئس مثل القوم الذين كذبوا بآيات الله والله لا يهدي القوم الظالمين\". وقال الإمام أحمد رحمه الله حدثنا ابن نمير عن مجالد عن الشعبي عن ابن عباس قال: قال رسول الله صلى الله عليه وسلم \"من تكلم يوم الجمعة والإمام يخطب فهو كمثل الحمار يحمل أسفارا والذي يقول له أنصت ليس له جمعة\"."
    },
    {
      "ayah": 6,
      "surah": 62,
      "text": "أي إن كنتم تزعمون أنكم على هدى وأن محمدا وأصحابه على ضلالة فادعوا بالموت على الضال من الفئتين إن كنتم صادقين أي فيما تزعمونه."
    },
    {
      "ayah": 7,
      "surah": 62,
      "text": "أى بما يعملون لهم من الكفر والظلم والفجور \"والله عليم بالظالمين \"وقد قدمنا الكلام في سورة البقرة على هذه المباهلة لليهود حيث قال تعالى \"قل إن كانت لكم الدار الآخرة عند الله خالصة من دون الناس فتمنوا الموت إن كنتم صادقين ولن يتمنوه أبدا بما قدمت أيديهم والله عليم بالظالمين ولتجدنهم أحرص الناس على حياة ومن الذين أشركوا يود أحدهم لو يعمر ألف سنة وما هو بمزحزحه من العذاب أن يعمر والله بصير بما يعلمون\" وقد أسلفنا الكلام هناك وبينا أن المراد أن يدعو على الضلال من أنفسهم أو خصومهم كما تقدمت مباهلةالنصارى في آل عمران \"فمن حاجك فيه من بعد ما جاءك من العلم فقل تعالوا ندع أبناءنا وأبناءكم ونساءنا ونساءكم وأنفسنا وأنفسكم ثم نبتهل فنجعل لعنة الله على الكاذبين\" ومباهلة المشركين فى سورة مريم \"قل من كان في الضلالة فليمدد له الرحمن مدا\". وقد قال الإمام أحمد حدثنا إسماعيل بن يزيد الزرقي حدثنا أبو يزيد حدثنا فرات عن عبدالكريم بن مالك الجزري عن عكرمة عن ابن عباس قال: قال أبو جهل لعنه الله إن رأيت محمدا عند الكعبة لآتينه حتى أطأ على عنقه قال: فقال رسول الله صلى الله عليه وسلم \"لو فعل لأخذته الملائكة عيانا ولو أن اليهود تمنوا الموت لماتوا ورأوا مقاعدهم من النار ولو خرج الذين يباهلون رسول الله صلى الله عليه وسلم لرجعوا لا يجدون أهلا ولا مالا\" رواه البخاري والترمذي والنسائي من حديث عبدالرزاق عن معمر عن عبدالكريم قال البخاري وتبعه عمرو بن خالد عن عبيدالله بن عمرو عن عبدالكريم ورواه النسائي أيضا عن عبدالرحمن بن عبدالله الحلبي عن عبيدالله بن عمرو الرقي به أتم."
    },
    {
      "ayah": 8,
      "surah": 62,
      "text": "وقوله تعالى \"قل إن الموت الذي تفرون منه فإنه ملاقيكم ثم تردون إلى عالم الغيب والشهادة فينبئكم بما كنتم تعملون\" كقوله تعالى في سورة النساء \"أينما تكونوا يدرككم الموت ولو كنتم في بروج مشيدة\" وفي معجم الطبراني من حديث معاذ محمد بن محمد الهدلي عن يونس عن الحسن عن سمرة مرفوعا \"مثل الذي يفر من الموت كمثل الثعلب تطلبه الأرض بدين فجاء يسعى حتى إذا أعيا وانبهر دخل جحره فقالت له الأرض يا ثعلب ديني فخرج له حصاص فلم يزل كذلك حتى تقطعت عنقه فمات\"."
    },
    {
      "ayah": 9,
      "surah": 62,
      "text": "إنما سميت الجمعة جمعة لأنها مشتقة من الجمع فإن أهل الإسلام يجتمعون فيه في كل أسبوع مرة بالمعابد الكبار وفيه كمل جميع الخلائق فإنه اليوم السادس من الستة التي خلق الله فيها السموات والأرض وفيه خلق آدم وفيه أدخل الجنة وفيه أخرج منها وفيه تقوم الساعة وفيه ساعة لا يوافقها عبد مؤمن يسأل فيها الله خيرا إلا أعطاه إياه كما ثبتت بذلك الأحاديث الصحاح. وقال ابن أبي حاتم حدثنا الحسن بن عرفة حدثنا عبيدة بن حميد عن منصور عن أبي معشر عن إبراهيم عن علقمة عن قرثع الضبي حدثنا سلمان قال: قال أبو القاسم صلى الله عليه وسلم \"يا سلمان ما يوم الجمعة؟ \" قلت الله ورسوله أعلم فقال رسول الله صلى الله عليه وسلم \"يوم الجمعة يوم جمع الله فيه أبواكم - أو أبوكم\" وقد روي عن أبي هريرة من كلامه نحو هذا فالله أعلم وقد كان يقال له في اللغة القديمة يوم العروبة وثبت أن الأمم قبلنا أمروا به فضلوا عنه واختار اليهود يوم السبت الذي لم يقع فيه خلق آدم واختار النصارى يوم الأحد الذي ابتدئ فيه الخلق واختار الله لهذه الأمة يوم الجمعة الذي أكمل الله فيه الخليقة كما أخرجه البخاري ومسلم من حديث عبدالرزاق عن معمر عن همام بن منبه قال هذا ما حدثنا أبو هريرة قال: قال رسول الله صلى الله عليه وسلم \"نحن الآخرون السابقون يوم القيامة بيد أنهم أوتوا الكتاب من قبلنا ثم إن هذا يومهم الذي فرض الله عليهم فاختلفوا فيه فهدانا الله له فالناس لنا فيه تبع اليهود غدا والنصارى بعد غد\" لفظ البخاري وفي لفظ لمسلم \"أضل الله عن الجمعة من كان قبلنا فكان لليهود يوم السبت وكان للنصارى يوم الأحد فجاء الله بنا فهدانا الله ليوم الجمعة فجعل الجمعة والسبت والأحد وكذلك هم تبع لنا يوم القيامة نحن الآخرون من أهل الدنيا والأولون يوم القيامة المقضي بينهم قبل الخلائق\" وقد أمر الله المؤمنين بالاجتماع لعبادته يوم الجمعة فقال تعالى \"يا أيها الذين آمنوا إذا نودي للصلاة من يوم الجمعة فاسعوا إلى ذكر الله\" أي اقصدوا واعمدوا واهتموا في سيركم إليها وليس المراد بالسعي ههنا المشي السريع وإنما هو الاهتمام بها كقوله تعالى \"ومن أراد الآخرة وسعى لها سعيها وهو مؤمن\" وكان عمر بن الخطاب وابن مسعود رضي الله عنهما يقرآنها \"فامضوا إلى ذكر الله\" فأما المشي السريع إلى الصلاة فقد نهي عنه لما أخرجاه في الصحيحين عن أبي هريرة عن النبي صلى الله عليه وسلم قال \"إذا سمعتم الإقامة فامشوا إلى الصلاة وعليكم السكينة والوقار ولا تسرعوا فما أدركتم فصلوا وما فاتكم فأتموا\" لفظ البخاري وعن أبي قتادة قال: بينما نحن نصلي مع النبي صلى الله عليه وسلم إذ سمع جلبة رجال فلما صلى قال \"ما شأنكم\" قالوا استعجلنا إلى الصلاة قال \"فلا تفعلوا! إذا أتيتم الصلاة فامشوا وعليكم السكينه فما أدركتم فصلوا وما فاتكم فأتموا\" أخرجاه وقال عبدالرزاق أخبرنا معمر عن الزهري عن سعيد بن المسيب عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم \"إذا أقيمت الصلاة فلا تأتوها تسعون ولكن ائتوها تمشون وعليكم السكينة والوقار فما أدركتم فصلوا وما فاتكم فأتموا\" رواه الترمذي من حديث عبدالرزاق كذلك وأخرجه من طريق يزيد بن زريع عن معمر عن الزهري عن أبي سلمة عن أبي هريرة بمثله قال الحسن أما والله ما هو بالسعي على الأقدام ولقد نهوا أن يأتوا الصلاة إلا وعليهم السكينة والوقار ولكن بالقلوب والنية والخشوع. وقال قتادة في قوله \"فاسعوا إلى ذكر الله\" يعني أن تسعى بقلبك وعملك وهو المشى إليها وكان يتأول قوله تعالى \"فلما بلغ معه السعي\" أي المشي معه وروي عن محمد بن كعب وزيد بن أسلم وغيرهما نحو ذلك. ويستحب لمن جاء إلى الجمعة أن يغتسل قبل مجيئه إليها لما ثبت في الصحيحين عن ابن عمر أن رسول الله صلى الله عليه وسلم قال \"إذا جاء أحدكم الجمعة فليغتسل\" ولهما عن أبي سعيد رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم \"غسل يوم الجمعة واجب على كل محتلم\" وعن أبي هريرة قال: قال رسول الله صلى الله عليه وسلم \"حق لله على كل مسلم أن يغتسل في كل سبعة أيام يغسل رأسه وجسده\" رواه مسلم وعن جابر رضي الله عنه: قال رسول الله صلى الله عليه وسلم \"على كل رجل مسلم في كل سبعة أيام غسل يوم وهو يوم الجمعة\" رواه أحمد والنسائي وابن حبان. وقال الإمام أحمد حدثنا يحيى بن آدم حدثنا ابن المبارك عن الأوزاعي عن حسان بن عطية عن أبي الأشعث الصنعاني عن أوس بن أوس الثقفي قال: سمعت رسول الله صلى الله عليه وسلم يقول \"من غسل واغتسل يوم الجمعة وبكر وابتكر ومشى ولم يركب ودنا من الإمام واستمع ولم يلغ كان له بكل خطوة أجر سنة صيامها وقيامها\" وهذا الحديث له طرق وألفاظ وقد أخرجه أهل السنن الأربعة وحسنه الترمذي وعن أبي هريرة رضي الله عنه قال: إن رسول الله صلى الله عليه وسلم قال \"من اغتسل يوم الجمعة غسل الجنابة ثم راح في الساعة الأولى فكأنما قرب بدنة ومن راح في الساعة الثانية فكأنما قرب بقرة ومن راح في الساعة الثالثة فكأنما قرب كبشا أقرن ومن راح فى الساعة الرابعة فكأنما قرب دجاجة ومن راح في الساعة الخامسة فكأنما قرب بيضة فإذا خرج الإمام حضرت الملائكة يستمعون الذكر\" أخرجاه. ويستحب له أن يلبس أحسن ثيابه ويتطيب ويتسوك ويتنظف ويتطهر في حديث أبي سعيد المتقدم \"غسل يوم الجمعة واجب على كل محتلم والسواك وأن يمس من طيب أهله\". وقال الإمام أحمد حدثنا يعقوب حدثنا أبي عن محمد بن إسحاق حدثني محمد بن إبراهيم التيمي عن عمران بن أبي يحيى عن عبدالله بن كعب بن مالك عن أبي أيوب الأنصاري سمعت رسول الله صلى الله عليه وسلم يقول \"من اغتسل يوم الجمعة ومس من طيب أهله إن كان عنده ولبس من أحسن ثيابه ثم خرج حتى يأتي المسجد فيركع إن بداله ولم يؤذ أحدا ثم أنصت إذا خرج إمامه حتى يصلي كانت كفارة لما بينها وبين الجمعة الأخرى\". وفي سنن أبي داود وابن ماجه عن عبدالله بن سلام رضي الله عنه أنه سمع رسول الله صلى الله عليه وسلم يقول على المنبر \"ما على أحدكم لو اشترى ثوبين ليوم الجمعة سوى ثوبي مهنته\" وعن عائشة رضي الله عنها أن رسول الله صلى الله عليه وسلم خطب الناس يوم الجمعة فرأى عليهم ثياب النمار فقال \"ما على أحدكم إن وجد سعة أن يتخذ ثوبين لجمعته سوى ثوبي مهنته\" رواه ابن ماجه. وقوله تعالى \"إذا نودي للصلاة من يوم الجمعة\" المراد بهذا النداء هو النداء الثاني الذي كان يفعل بين يدي رسول الله صلى الله عليه وسلم إذا خرج فجلس على المنبر فإنه كان حينئذ يؤذن بين يديه فهذا هو المراد فأما النداء الأول الذى زاده أمير المؤمنين عثمان بن عفان رضي الله عنه فإنما كان هذا لكثرة الناس كما رواه البخاري رحمه الله حيث قال: حدثنا آدم هو ابن أبي إياس حدثنا ابن أبي ذئب عن الزهري عن السائب بن يزيد قال كان النداء يوم الجمعة أوله إذا جلس الإمام على المنبر على عهد رسول الله صلى الله عليه وسلم وأبي بكر وعمر فلما كان عثمان بعد زمن وكثر الناس زاد النداء الثاني على الزوراء يعني يؤذن به على الدار التي تسمى الزوراء وكانت أرفع دار بالمدينة بقرب المسجد. وقال ابن أبي حاتم حدثنا أبي حدثنا أبو نعيم حدثنا إبراهيم حدثنا محمد بن راشد المكحول عن مكحول أن النداء كان في الجمعة مؤذن واحد حين يخرج الإمام ثم تقام الصلاة وذلك النداء الذي يحرم عنده الشراء والبيع إذا نودي به فأمر عثمان رضي الله عنه أن ينادي قبل خروج الإمام حتى يجتمع الناس. وإنما يؤمر بحضور الجمعة الرجال الأحرار دون العبيد والنساء والصبيان ويعذر المسافر. والمريض وقيم المريض وما أشبه ذلك من الأعذار كما هو مقرر في كتب الفروع وقوله تعالى \"وذروا البيع\" أي اسعوا إلى ذكر الله واتركوا البيع إذا نودي للصلاة ولهذا اتفق العلماء رضي الله عنهم على تحريم البيع بعد النداء الثاني واختلفوا هل يصح إذا تعاطاه متعاط أم لا؟ على قولين وظاهر الآية عدم الصحة كما هو مقرر في موضعه والله أعلم. وقوله تعالى \"ذلكم خير لكم إن كنتم تعلمون\" أي ترككم البيع وإقبالكم إلى ذكر الله وإلى الصلاة خير لكم أي في الدنيا والآخرة إن كنتم تعلمون."
    }
  ]
}
