{
  "ayahs": [
    {
      "ayah": 1,
      "surah": 63,
      "text": "يقول تعالى مخبرا عن المنافقين أنهم إنما يتفوهون بالإسلام إذا جاءوا النبي صلى الله عليه وسلم فأما في باطن الأمر فليسوا كذلك بل على الضد من ذلك ولهذا قال تعالى \"إذا جاءك المنافقون قالوا نشهد إنك لرسول الله\" أي إذا حضروا عندك واجهوك بذلك وأظهروا لك ذلك وليس كما يقولون ولهذا اعترض بجملة مخبرة أنه رسول الله فقال \"والله يعلم إنك لرسوله\". ثم قال تعالى \"والله يشهد إن المنافقين لكاذبون\" أي فيما أخبروا به وإن كان مطابقا للخارج لأنهم لم يكونوا يعتقدوا صحة ما يقولون ولا صدقه ولهذا كذبهم بالنسبة إلى اعتقادهم."
    },
    {
      "ayah": 10,
      "surah": 63,
      "text": "فقال \"وأنفقوا مما رزقناكم من قبل أن يأتي أحدكم الموت فيقول رب لولا أخرتني إلى أجل قريب فأصدق وأكن من الصالحين \"فكل مفرط يندم عند الاحتضار ويسأل طول المدة ولو شيئا يسيرا ليستعتب ويستدرك ما فاته وهيهات كان ما كان وأتى ما هو آت وكل بحسب تفريطه أما الكفار فكما قال تعالى \"وأنذر الناس يوم يأتيهم العذاب فيقول الذين ظلموا ربنا أخرنا إلى أجل قريب نجب دعوتك ونتبع الرسل أو لم تكونوا أقسمتم من قبل مالكم من زوال\" وقال تعالى \"حتى إذا جاء أحدهم الموت قال رب ارجعون لعلي أعمل صالحا فيما تركت كلا إنها كلمة هو قائلها ومن ورائهم برزخ إلى يوم يبعثون\"."
    },
    {
      "ayah": 11,
      "surah": 63,
      "text": "ثم قال تعالى ولن يؤخر الله نفسا إذا جاء أجلها والله خبير بما تعلمون أي لا ينظر أحدا بعد حلول أجله وهو أعلم وأخبر بمن يكون صادقا في قوله وسؤاله ممن لو رد لعاد إلى شر مما كان عليه ولهذا قال تعالى \"والله خبير بما تعملون\". وقال أبو عيسى الترمذي حدثنا عبد بن حميد حدثنا جعفر بن عون حدثنا أبو جناب الكلبي عن الضحاك بن مزاحم عن ابن عباس قال: من كان له مال يبلغه حج بيت ربه أو تجب عليه فيه زكاة فلم يفعل سأل الرجعة عند الموت فقال رجل يا ابن عباس اتق الله فإنما يسأل الرجعة الكفار فقال سأتلوا عليك بذلك قرآنا \"يا أيها الذين آمنوا لا تلهكم أموالكم ولا أولادكم عن ذكر الله ومن يفعل ذلك فأولئك هم الخاسرون وأنفقوا مما رزقناكم من قبل أن يأتي أحدكم الموت فيقول رب لولا أخرتني إلى أجل قريب فأصدق وأكن من الصالحين - إلى قوله - والله خبير بما تعملون\" قال فما يوجب الذكاة؟ قال إذا بلغ المال مائتين فصاعدا قال فما يوجب الحج؟ قال الزاد والبعير. ثم قال حدثنا عبد بن حميد حدثنا عبد الرزاق عن الثوري عن يحيى بن أبي حية وهو أبو جناب الكلبي عن الضحاك عن ابن عباس عن النبي صلى الله عليه وسلم بنحوه ثم قال وقد رواه سفيان بن عيينة وغيره عن أبي جناب عن الضحاك عن ابن عباس من قوله وهو أصح وضعف أبو جناب الكلبي \"قلت\" ورواية الضحاك عن ابن عباس فيها انقطاع والله أعلم. وقال ابن أبي حاتم حدثنا أبي حدثنا ابن نفيل حدثنا سليمان بن عطاء عن مسلمة الجهني عن عمه يعني أبا مشجعة بن ربعي عن أبي الدرداء رضي الله عنه قال ذكرنا عند رسول الله صلى الله عليه وسلم الزيادة في العمر فقال \"إن الله لا يؤخر نفسا إذا جاء أجلها وإنما الزيادة في العمر أن يرزق الله العبد ذرية صالحة يدعون له فيلحقه دعاؤهم في قبره\" آخر تفسير سورة المنافقين ولله الحمد والمنة وبه التوفيق والعصمة."
    },
    {
      "ayah": 2,
      "surah": 63,
      "text": "وقوله تعالى اتخذوا أيمانهم جنة فصدوا عن سبيل الله أي اتقوا الناس بالأيمان الكاذبة والحلفان الآثمة ليصدقوا فيما يقولون فاغتر بهم من لا يعرف جلية أمرهم فاعتقدوا أنهم مسلمون فربما اقتدى بهم فيما يفعلون وصدقهم فيما يقولون وهم من شأنهم أنهم كانوا في الباطن لا يألون الإسلام وأهله خبالا فحصل بهذا القدر ضرر كبير على كثير من الناس ولهذا قال تعالى \"فصدوا عن سبيل الله إنهم ساء ما كانوا يعملون\" ولهذا كان الضحاك بن مزاحم يقرؤها \"اتخذوا إيمانهم جنة\" أي تصديقهم الظاهر جنة أي تقية يتقون به القتل والجمهور يقرؤها أيمانهم جمع يمين."
    },
    {
      "ayah": 3,
      "surah": 63,
      "text": "وقوله تعالى \"ذلك بأنهم آمنوا ثم كفروا فطبع على قلوبهم فهم لا يفقهون\" أي إنما قدر عليهم النفاق لرجوعهم عن الإيمان إلى الكفران واستبدالهم الضلالة بالهدى فطبع على قلوبهم فهم لا يفقهون أي فلا يصل إلى قلوبهم هدى ولا يخلص إليها خير فلا تعي ولا تهتدي."
    },
    {
      "ayah": 4,
      "surah": 63,
      "text": "وقوله تعالى \"وإذا رأيتهم تعجبك أجسامهم وإن يقولوا تسمع لقولهم كأنهم خشب مسندة\" أي وكانوا أشكالا حسنة وذوي فصاحة وألسنة وإذا سمعهم السامع يصغي إلى قولهم لبلاغتهم وهم مع ذلك في غاية الضعف والخور والهلع والجزع والجبن ولهذا قال تعالى \"يحسبون كل صيحة عليهم\" أي كلما وقع أمر أو كائنة أو خوف يعتقدون لجبنهم أنه نازل بهم كما قال تعالى \"أشحة عليكم فإذا جاء الخوف رأيتهم ينظرون إليك تدور أعينهم كالذي يغشى عليه من الموت فإذا ذهب الخوف سلقوكم بألسنة حداد أشحة على الخير أولئك لم يؤمنوا فأحبط الله أعمالهم وكان ذلك على الله يسيرا\" فهم جهامات وصور بلا معاني ولهذا قال تعالى \"هم العدو فاحذرهم قاتلهم الله أني يؤفكون\" أي كيف يصرفون عن الهدى إلى الضلالة وقد قال الإمام أحمد حدثنا يزيد حدثنا عبدالملك بن قدامة الجمحي عن إسحاق بن بكير أبي الفرات عن سعيد بن أبي سعيد المقبري عن أبيه عن أبي هريرة رضي الله عنه أن النبي صلى الله عليه وسلم قال \"إن للمنافقين علامات يعرفون بها: تحيتهم لعنة وطعامهم نهبة وغنيمتهم غلول ولا يقربون المساجد إلا هجرا ولا يأتون الصلاة إلا دبرا مستكبرين لا يألفون ولا يؤلفون خشب بالليل صخب بالنهار\" وقال يزيد بن مرة: سخب بالنهار."
    },
    {
      "ayah": 5,
      "surah": 63,
      "text": "يقول تعالى مخبرا عن المنافقين عليهم لعائن الله أنهم \"إذا قيل لهم تعالوا يستغفر لكم رسول الله لووا رؤوسهم\" أي صدوا وأعرضوا عما قيل لهم استكبارا عن ذلك واحتقارا لما قيل لهم ولهذا قال تعالى \"ورأيتهم يصدون وهم مستكبرون."
    },
    {
      "ayah": 6,
      "surah": 63,
      "text": "ثم جازاهم على ذلك فقال تعالى \"سواء عليهم أستغفرت لهم أم لم تستغفر لهم لن يغفر الله لهم إن الله لا يهدي القوم الفاسقين\" كما قال في سورة براءة وقد تقدم الكلام على ذلك وإيراد الأحاديث المروية هناك وقال ابن أبي حاتم حدثنا أبي حدثنا ابن أبي عمر العدني قال: قال سفيان \"لووا رءوسهم\" قال ابن أبي عمر حول سفيان وجهه على يمينه ونظر بعينه شذرا ثم قال هو هذا. وقد ذكر غير واحد من السلف أن هذا السياق كله نزل في عبدالله بن أبي بن سلول كما سنورده قريبا إن شاء الله تعالى وبه الثقة وعليه التكلان. وقد قال محمد بن إسحق في السيرة ولما قدم رسول الله صلى الله عليه وسلم المدينة يعني مرجعه من أحد وكان عبدالله بن أبي بن سلول كما حدثني ابن شهاب الزهري له مقام يقومه كل جمعة لا ينكر شرفا له من نفسه ومن قومه وكان فيهم شريفا إذا جلس النبي صلى الله عليه وسلم يوم الجمعة وهو يخطب الناس قام فقال أيها الناس هذا رسول الله صلى الله عليه وسلم بين أظهركم أكرمكم الله به وأعزكم به فانصروه وعزروه واسمعوا له وأطيعوا ثم يجلس حتى إذا صنع يوم أحد ما صنع يعني مرجعه بثلث الجيش ورجع الناس قام يفعل ذلك كما كان يفعله فأخذ المسلمون بثيابه من نواحيه وقالوا اجلس أي عدو الله لست لذلك بأهل وقد صنعت ما صنعت فخرج يتخطى رقاب الناس وهو يقول: والله لكأنما قلت بجرا أأن قمت أشدد أمره فلقيه رجال من الأنصار بباب المسجد فقالوا ويلك مالك؟ قال قمت أشدد أمره فوثب علي رجال من أصحابه يجذبونني ويعنفونني لكأنما قلت بجرا أأن قمت أشدد أمره قالوا ويلك ارجع يستغفر لك رسول الله صلى الله عليه وسلم قال والله ما أبتغي أن يستغفر لي. وقال قتادة والسدي أنزلت هذه الآية في عبدالله بن أبي وذلك أن غلاما من قرابته انطلق إلى رسول الله صلى الله عليه وسلم فحدثه بحديث عنه وأمر شديد فدعاه رسول الله صلى الله عليه وسلم فإذا هو يحلف بالله ويتبرأ من ذلك وأقبلت الأنصار على ذلك الغلام فلاموه وعزلوه وأنزل الله فيه ما تسمعون وقيل لعدو الله لو أتيت رسول الله فجعل يلوي رأسه أي لست فاعلا. وقال ابن أبي حاتم حدثنا أبي حدثنا أبو الربيع الزهراني حدثنا حماد بن زيد حدثنا أيوب عن سعيد بن جبير أن رسول الله صلى الله عليه وسلم كان إذا نزل منزلا لم يرتحل حتى يصلي فيه فلما كانت غزوة تبوك بلغه أن عبدالله ابن أبي بن سلول قال ليخرجن الأعز منها الأذل فارتحل قبل أن ينزل آخر النهار وقيل لعبدالله بن أبي ائت النبي صلى الله عليه وسلم حتى يستغفر لك فأنزل الله تعالى \"إذا جاءك المنافقون - إلى قوله - وإذا قيل لهم تعالوا يستغفر لكم رسول الله لووا رؤوسهم\" وهذا إسناد صحيح إلى سعيد بن جبير وقوله إن ذلك كان فى غزوة تبوك فيه نظر بل ليس بجيد فإن عبدالله بن أبي بن سلول لم يكن ممن خرج في غزوة تبوك بل رجع بطائفة من الجيش وإنما المشهور عند أصحاب المغازي والسير أن ذلك كان في غزوة المريسيع وهي غزوة بني المصطلق وقال يونس بن بكير عن ابن إسحاق حدثني محمد بن يحي بن حبان وعبدالله بن أبي بكر وعاصم بن عمر بن قتادة في قصة بني المصطلق فبينا رسول الله صلى الله عليه وسلم مقيم هناك اقتتل على الماء جهجاه بن سعيد الغفاري وكان أجيرا لعمر بن الخطاب وسنان بن يزيد قال ابن إسحاق فحدثني محمد بن يحيى بن حبان قال ازدحما على الماء فاقتتلا فقال سنان يا معشر الأنصار وقال الجهجاه يا معشر المهاجرين وزيد بن أرقم ونفر من الأنصار عند عبدالله بن أبي فلما سمعها قال قد ثاورونا في بلادنا والله ما مثلنا وجلابيب قريش هذه إلا كما قال القائل سمن كلبك يأكلك والله لئن رجعنا إلى المدينة ليخرجن الأعز منها الأذل ثم أقبل على من عنده من قومه وقال هذا ما صنعتم بأنفسكم أحللتموهم بلادكم وقاسمتموهم أموالكم أما والله لو كففتم عنهم لتحولوا عنكم في بلادكم إلى غيرها فسمعها زيد ابن أرقم رضي الله عنه فذهب بها إلى رسول الله صلى الله عليه وسلم وهو غليم عنده عمر بن الخطاب رضي الله عنه فأخبره الخبر فقال عمر رضي الله عنه يا رسول الله مر عباد بن بشر فليضرب عنقه فقال رسول الله صلى الله عليه وسلم: \"فكيف إذا تحدث الناس يا عمر أن محمدا يقتل أصحابه؟ لا ولكن ناد يا عمر الرحيل\" فلما بلغ عبدالله بن أبي أن ذلك قد بلغ رسول الله صلى الله عليه وسلم أتاه فاعتذر إليه وحلف بالله ما قال ما قال عليه زيد بن أرقم وكان عند قومه بمكان فقالوا يا رسول الله عسى أن يكون هذا الغلام أوهم ولم يثبت ما قال الرجل وراح رسول الله صلى الله عليه وسلم مهجرا في ساعة كان لا يروح فيها فلقيه أسيد بن الحضير رضي الله عنه فسلم عليه بتحية النبوة ثم قال والله لقد رحت في ساعة منكرة ما كنت تروح فيها فقال رسول الله صلى الله عليه وسلم \"أما بلغك ما قال صاحبك ابن أبي؟ زعم أنه إذا قدم المدينة سيخرج الأعز منها الأذل\" قال فأنت يا رسول الله العزيز وهو الذليل ثم قال ارفق به يا رسول الله فوالله لقد جاء الله بك وإنا لننظم له الخرز لنتوجه فإنه ليرى أن قد سلبته ملكا فسار رسول الله صلى الله عليه وسلم بالناس حتى أمسوا وليلته حتى أصبحوا وصدر يومه حتى اشتد الضحى ثم نزل بالناس ليشغلهم عما كان من الحديث فلم يأمن الناس أن وجدوا مس الأرض فناموا ونزلت سورة المنافقين. وقال الحافظ أبو بكر البيهقى أخبرنا أبو عبدالله الحافظ أخبرنا أبو بكر بن إسحاق أخبرنا بشر بن موسى حدثنا الحميدي حدثنا سفيان حدثنا عمر بن دينار سمعت جابر بن عبدالله يقول كنا مع رسول الله صلى الله عليه وسلم في غزاة فكسع رجل من المهاجرين رجلا من الأنصار فقال الأنصاري يا للأنصار وقال المهاجري يا للمهاجرين فقال رسول الله صلى الله عليه وسلم \"ما بال دعوى الجاهلية؟ دعوها فإنها منتنة\" وقال عبدالله بن أبي بن سلول وقد فعلوها: والله لئن رجعنا إلى المدينة ليخرجن الأعز منها الأذل قال جابر وكان الأنصار بالمدينة أكثر من المهاجرين حين قدم رسول الله صلى الله عليه وسلم ثم كثر المهاجرون بعد ذلك فقال عمر دعني أضرب عنق هذا المنافق فقال النبي صلى الله عليه وسلم \"دعه لا يتحدث الناس أن محمدا يقتل أصحابه\" ورواه الإمام أحمد عن حسن بن محمد المروزي عن سفيان بن عيينة ورواه البخاري عن الحميدي ومسلم عن أبي بكر بن أبي شيبة وغيره عن سفيان به نحوه وقال الإمام أحمد حدثنا محمد بن جعفر حدثنا شعبة عن الحكم عن محمد بن كعب القرظى عن زيد بن أرقم قال كنت مع رسول الله صلى الله عليه وسلم في غزوة تبوك فقال عبدالله بن أبي لئن رجعنا إلى المدينة ليخرجن الأعز منها الأذل قال فأتيت النبي صلى الله عليه وسلم فأخبرته قال فحلف عبدالله بن أبي أنه لم يكن شيء من ذلك قال فلامني قومي وقالوا ما أردت إلى هذا؟ قال فانطلقت فنمت كئيبا حزينا قال فأرسل إلي نبي الله صلى الله عليه وسلم فقال \"إن الله قد أنزل عذرك وصدقك\"."
    },
    {
      "ayah": 7,
      "surah": 63,
      "text": "قال فنزلت هذه الآية \"هم الذين يقولون لا تنفقوا على من عند رسول الله حتى ينفضوا - حتى بلغ - لئن رجعنا إلى المدينة ليخرجن الأعز منها الأذل\" ورواه البخاري عند هذه الآية عن آدم بن أبي إياس عن شعبة ثم قال وقال ابن أبي زائدة عن الأعمش عن عمرو عن ابن أبي ليلى عن زيد عن النبي صلى الله عليه وسلم ورواه الترمذي والنسائي عندها أيضا من حديث شعبة به. \"طريق أخرى عن زيد\" قال الإمام أحمد رحمه الله حدثنا يحيى بن آدم ويحيى بن أبي بكير قالا حدثنا إسرائيل عن أبي إسحاق قال سمعت زيد بن أرقم وقال أبو بكر عن زيد بن أرقم قال خرجت مع عمي في غزاة فسمعت عبدالله بن أبي بن سلول يقول لأصحابه لا تنفقوا على من عند رسول الله ولئن رجعنا إلى المدينة ليخرجن الأعز منها الأذل فذكرت ذلك لعمي فذكره عمى لرسول الله صلى الله عليه وسلم فأرسل إلى رسول الله صلى الله عليه وسلم فحدثته فأرسل إلى عبدالله بن أبي بن سلول وأصحابه فحلفوا بالله ما قالوا فكذبني رسول الله صلى الله عليه وسلم وصدقه فأصابني هم لم يصبني مثله قط وجلست في البيت فقال عمي: ما أردت إلا أن كذبك رسول الله صلى الله عليه وسلم ومقتك؟ قال حتى أنزل الله \"إذا جاءك المنافقون\" قال فبعث إليّ رسول الله صلى الله عليه وسلم فقرأها رسول الله صلى الله عليه وسلم علي ثم قال \"إن الله قد صدقك\" ثم قال أحمد أيضا حدثنا حسن بن موسى حدثنا زهير حدثنا أبو إسحاق أنه سمع زيد بن أرقم يقول خرجنا مع رسول الله صلى الله عليه وسلم في سفر فأصاب الناس شدة وقال عبدالله بن أبي لاصحابه لا تنفقوا على من عند رسول الله حتى ينفضوا من حوله وقال لئن رجعنا إلى المدينة ليخرجن الأعز منها الأذل فأتيت النبي صلى الله عليه وسلم فأخبرته بذلك فأرسل إلى عبدالله بن أبي فسأله فاجتهد يمينه ما فعل فقالوا: كذب زيد يا رسول الله فوقع في نفسي مما قالوا فأنزل الله تصديقي \"إذا جاءك المنافقون\" قال ودعاهم رسول الله صلى الله عليه وسلم ليستغفر لهم فلووا رءوسهم وقد رواه البخاري ومسلم والنسائي من حديث زهير ورواه البخاري أيضا والترمذي من حديث إسرائيل كلاهما عن أبي إسحاق عمرو بن عبدالله السبيعي الهمدانى الكوفي عن زيد به \"طريق أخرى عن زيد\" قال أبو عيسى الترمذي حدثنا عبد بن حميد حدثنا عبيد الله بن موسى عن إسرائيل عن السدى عن أبي سعيد الأزدي قال حدثنا زيد بن أرقم قال غزونا مع رسول الله صلى الله عليه وسلم وكان معنا أناس من الأعراب فكنا نبتدر الماء وكان الأعراب يسبقوننا إليه فسبق أعرابي أصحابه ليملأ الحوض ويجعل حوله حجارة ويجعل النطع عليه حتى يجيء أصحابه قال فأتى رجل من الأنصار الأعرابي فأرخى زمام ناقته لتشرب فأبى أن يدعه فانتزع حجرا فغاض الماء فرفع الاعرابي خشبته فضرب بها رأس الأنصاري فشجه فأتى عبد الله بن أبي رأس المنافقين فأخبره وكان من أصحابه فغضب عبدالله بن أبي ثم قال: لا تنفقوا على من عند رسول الله حتى ينفضوا من حوله يعني الأعراب وكانوا يحضرون رسول الله صلى الله عليه وسلم عند الطعام فقال عبدالله لأصحابه إذا انفضوا من عند محمد فائتوا محمدا بالطعام فليأكل هو ومن معه ثم قال لأصحابه لئن رجعتم إلى المدينة فليخرج الأعز منها الأذل قال زيد وأنا ردف عمي قال فسمعت عبدالله بن أبي يقول ما قال فأخبرت عمي فانطلق فأخبر رسول الله صلى الله عليه وسلم فأرسل إليه رسول الله صلى الله عليه وسلم فحلف وجحد قال فصدقه رسول الله صلى الله عليه وسلم وكذبني قال فجاء إلي عمي فقال ما أردت إلا أن مقتك رسول الله صلى الله عليه وسلم وكذبك المسلمون؟ قال فوقع علي من الغم ما لم يقع على أحد قط قال فبينما أنا أسير مع رسول الله صلى الله عليه وسلم في سفر وقد خفقت برأسي من الهم إذ أتاني رسول الله صلى الله عليه وسلم فعرك أذني وضحك في وجهي فما كان يسرني أن لي بها الخلد في الدنيا ثم إن أبا بكر لحقني وقال ما قال لك رسول الله صلى الله عليه وسلم؟ قلت ما قال شيئا إلا أنه عرك أذني وضحك في وجهي فقال أبشر ثم لحقني عمر فقلت له مثل قولي لأبي بكر فلما أن أصبحنا قرأ رسول الله صلى الله عليه وسلم سورة المنافقين. انفرد بإخراجه الترمذي وقال هذا حديث حسن صحيح. وهكذا رواه الحافظ البيهقي عن الحاكم عن عبيدالله بن موسى به وزاد بعد قوله سورة المنافقين \"إذا جاءك المنافقون قالوا فشهد إنك لرسول الله - حتى بلغ- هم الذين يقولون لا تنفقوا على من عند رسول الله حتى ينفضوا - حتى بلغ - ليخرجن الأعز منها الأذل\". وقد ورى عبدالله بن لهيعة عن أبي الأسود عروة بن الزبير في المغازي وكذا ذكر موسى بن عقبة في مغازيه أيضا هذه القصة بهذا السياق ولكن جعلا الذي بلغ رسول الله صلى الله عليه وسلم كلام عبدالله بن أبي بن سلول إنما هو أوس بن أقرم من بني الحارث بن الخزرج فلعله مبلغ آخر أو تصحيف من جهة السمع والله أعلم. وقد قال ابن أبي حاتم رحمه الله حدثنا محمد عزيز الأيلي حدثنا سلام حدثني عقيل أخبرت محمد بن مسلم أن عروة بن الزبير وعمرو بن ثابت الأنصاري أخبراه أن رسول الله صلى الله عليه وسلم غزا غزوة المريسيع وهي التي هدم رسول الله صلى الله عليه وسلم فيها مناة الطاغية التي كانت بين قفا المشلل وبين البحر فبعث رسول الله صلى الله عليه وسلم خالد بن الوليد فكسر مناة فاقتتل رجلان في غزوة رسول الله صلى الله عليه وسلم تلك أحدهما من المهاجرين والآخر من بهز وهم حلفاء الأنصار فاستعلى الرجل الذي من المهاجرين على البهزي فقال البهزي يا معشر الأنصار فنصره رجال من الأنصار وقال المهاجري يا معشر المهاجرين فنصره رجال من المهاجرين حتى كان بين أولئك الرجال من المهاجرين والرجال من الأنصار شىء من القتال ثم حجز بينهم فانكفأ كل منافق أو رجل في قلبه مرض إلى عبدالله بن أبي بن سلول فقال قد كنت ترجى وتدفع فأصبحت لا تضر ولا تنفع قد تناصرت علينا الجلابيب وكانوا يدعون كل حديث الهجرة الجلابيب."
    },
    {
      "ayah": 8,
      "surah": 63,
      "text": "فقال عبدالله بن أبي عدو الله لئن رجعنا إلى المدينة ليخرجن الأعز منها الأذل قال مالك بن الدخشن وكان من المنافقين ألم أقل لكم لا تنفقوا على من عند رسول الله حتى ينفضوا؟ فسمع بذلك عمر بن الخطاب فأقبل يمشي حتى أتي رسول الله صلى الله عليه وسلم فقال يا رسول الله ائذن لي في هذا الرجل الذي قد أفتن الناس أضرب عنقه يريد عمر عبدالله بن أبي فقال رسول الله صلى الله عليه وسلم لعمر: \"أو قاتله أنت إن أمرتك بقتله؟\" فقال عمر نعم والله لئن أمرتني بقتله لأضربن عنقه فقال رسول الله صلى الله عليه وسلم \"اجلس\" فأقبل أسيد بن حضير وهو أحد الأنصار ثم أحد بني عبد الأشهل حتى أتى رسول الله صلى الله عليه وسلم فقال يا رسول الله ائذن لي في هذا الرجل الذي قد أفتن الناس أضرب عنقه فقال رسول الله صلى الله عليه وسلم \"أو قاتله أنت إن امرتك بقتله؟\" قال نعم والله لئن أمرتني بقتله لأضربن بالسيف تحت قرط أذنيه فقال رسول الله صلى الله عليه وسلم \"اجلس\" ثم قال رسول الله صلى الله عليه وسلم \"آذنوا بالرحيل\" فهجر بالناس فسار يومه وليلته والغد حتى متع النهار ثم نزل ثم هجر بالناس مثلها حتى صبح بالمدينة في ثلاث سارها من قفا المشلل فلما قدم رسول الله صلى الله عليه وسلم المدينة أرسل إلى عمر فدعاه فقال له رسول الله صلى الله عليه وسلم \"أي عمر أكنت قاتله لو أمرتك بقتله؟\" فقال عمر نعم فقال رسول الله صلى الله عليه وسلم \"والله لو قتلته يومئذ لأرغمت أنوف رجال لو أمرتهم اليوم بقتله لقتلوه فيتحدث الناس أني قد وقعت علي أصحابي فأقتلهم صبرا\" وأنزل الله عز وجل \"هم الذين يقولون لا تنفقوا على من عند رسول الله ختى ينفضوا - إلى قوله تعالى - يقولون لئن رجعنا إلى المدينة\" الآية وهذا سياق غريب وفيه أشياء نفيسة لا توجد إلا فيه وقال محمد بن إسحاق بن يسار حدثني عاصم بن عمر بن قتادة أن عبدالله بن عبدالله بن أبي لما بلغه ما كان من أمر أبيه أتى رسول الله صلى الله عليه وسلم فقال يا رسول الله إنه بلغني أنك تريد قتل عبدالله بن أبي فيما بلغك عنه فإن كنت فاعلا فمرني به فأنا أحمل إليك رأسه فوالله لقد علمت الخزرج ما كان لها من رجل أبر بوالده مني إني أخشى أن تأمر به غيري فيقتله فلا تدعني نفسي أنظر إلى قاتل عبدالله بن أبي يمسي في الناس فأقتله فأقتل مؤمنا بكافر فأدخل النار فقال رسول الله صلى الله عليه وسلم \"بل نترفق به ونحسن صحبته ما بقي معنا\" وذكر عكرمة وابن زيد وغيرهما أن الناس لما قفلوا راجعين إلى المدينة وقف عبدالله بن عبدالله هذا على باب المدينة واستل سيفه فجعل الناس يمرون عليه فلما جاء أبوه عبدالله بن أبي قال له ابنه وراءك فقال مالك ويلك؟ فقال والله لا تجوز من ههنا حتى يأذن لك رسول الله صلى الله عليه وسلم فإنه العزيز وأنت الذليل فلما جاء رسول الله صلى الله عليه وسلم وكان إنما يسير ساقة فشكا إليه عبدالله بن أبي ابنه فقال ابنه عبدالله والله يا رسول الله لا يدخلها حتى تأذن له فأذن له رسول الله صلى الله عليه وسلم فقال أما إذا أذن لك رسول الله صلى الله عليه وسلم فجز الآن وقال أبو بكر عبدالله بن الزبير الحميدي في مسنده حدثنا سفيان بن عيينة حدثنا أبو هارون المدني قال: قال عبدالله بن عبدالله ابن أبي بن سلول لأبيه والله لا تدخل المدينة أبدا حتى تقول رسول الله صلى الله عليه وسلم الأعز وأنا الأذل قال وجاء إلى النبي صلى الله عليه وسلم فقال يا رسول الله إنه بلغني أنك تريد أن تقتل أبي فوالذي بعثك بالحق ما تأملت وجهه قط هيبة له لئن شئت أن آتيك برأسه لأتيتك فإني أكره أن أرى قاتل أبي."
    },
    {
      "ayah": 9,
      "surah": 63,
      "text": "يقول تعالى آمرا لعباده المؤمنين بكثرة ذكره وناهيا لهم عن أن تشغلهم الأموال والأولاد عن ذلك ومخبرا لهم بأنه من التهى بمتاع الحياة الدنيا وزينتها عما خلق له من طاعة ربه وذكره فإنه من الخاسرين الذين يخسرون أنفسهم وأهليهم يوم القيامة ثم حثهم على الإنفاق في طاعته."
    }
  ]
}
