{
  "ayahs": [
    {
      "ayah": 1,
      "surah": 64,
      "text": "سورة التغابن: قال الطبراني حدثنا محمد بن محمد بن بكار الدمشقي حدثنا العباس بن الوليد الخلال حدثنا الوليد بن الوليد حدثتا ابن ثوبان عن عطاء بن أبي رباح عن عبدالله بن عمرو رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم \"ما من مولود يولد إلا مكتوب في تشبيك رأسه خمس آيات من سورةالتغابن\" أورده ابن عساكر في ترجمة الوليد بن صالح هو غريب جدا بل منكر. هذه السورة هى آخر المسبحات وقد تقدم الكلام على تسبيح المخلوقات لبارئها ومالكها ولهذا قال تعالى \"له الملك وله الحمد\" أي هو المتصرف في جميع الكائنات المحمود على جميع ما يخلق ويقدر وقوله تعالى \"وهو على كل شيء قدير\" أي مهما أراد كان بلا ممانع ولا مدافع وما لم يشأ لم يكن."
    },
    {
      "ayah": 10,
      "surah": 64,
      "text": "قلت وقد فسر ذلك بقوله تعالى \"ومن يؤمن بالله ويعمل صالحا يكفر عنه سيئاته ويدخله جنات تجري من تحتها الأنهار خالدين فيها أبدا ذلك الفوز العظيم والذين كفروا وكذبوا بآياتنا أولئك أصحاب النار خالدين فيها وبئس المصير\" وقد تقدم تفسير مثل هذه غير مرة."
    },
    {
      "ayah": 11,
      "surah": 64,
      "text": "يقول تعالى مخبرا بما أخبر به في سورة الحديد \"ما أصاب من مصيبة في الأرض ولا في أنفسكم إلا في كتاب من قبل أن نبرأها إن ذلك على الله يسير\" وهكذا قال ههنا \"ما أصاب من مصيبة إلا بإذن الله\" قال ابن عباس بأمر الله يعني عن قدره ومشيئته \"ومن يؤمن بالله يهد قلبه والله بكل شيء عليم\" أي ومن أصابته مصيبة فعلم أنها بقضاء الله وقدره فصبر واحتسب واستسلم لقضاء الله هدى الله قلبه وعوضه عما فاته من الدنيا هدى في قلبه ويقينا صادقا وقد يخلف عليه ما كان أخذ منه أو خيرا منه قال علي بن أبي طلحة عن ابن عباس \"ومن يؤمن بالله يهد قلبه\" يعني يهد قلبه لليقين فيعلم أن ما أصابه لم يكن ليخطئه وما أخطأه لم يكن ليصيبه وقال الأعمش عن أبي ظبيان قال كنا عند علقمة فقرىء عنده هذه الآية \"ومن يؤمن بالله يهد قلبه\" فسئل عن ذلك فقال هو الرجل تصيبه المصيبة فيعلم أنها من عند الله فيرضى ويسلم رواه ابن جرير وابن أبي حاتم في تفسيريهما وقال سعيد بن جبير ومقاتل بن حيان \"ومن يؤمن بالله يهد قلبه\" يعني يسترجع يقول \"إنا لله وإنا إليه راجعون\" وفي الحديث المتفق عليه \"عجبا للمؤمن لا يقضي الله له قضاء إلا كان خيرا له إن أصابته ضراء صبر فكان خيرا له وإن أصابته سراء شكر فكان خيرا له وليس ذلك لأحد إلا للمؤمن\" وقال أحمد حدثنا حسن حدثنا ابن لهيعة حدثنا الحارث بن يزيد عن علي بن رباح أنه سمع جنادة بن أبي أمية يقول سمعت عباده بن الصامت يقول إن رجلا أتي رسول الله صلى الله عليه وسلم فقال يا رسول الله أي العمل أفضل؟ قال \"إيمان بالله وتصديق به وجهاد في سبيل الله\" قال أريد أهون من هذا يا رسول الله؟ قال \"لا تتهم الله في شيء قضى لك به\" لم يخرجوه."
    },
    {
      "ayah": 12,
      "surah": 64,
      "text": "وقوله تعالى \"وأطيعوا الله وأطيعوا الرسول\" أمر بطاعة الله ورسوله فيما شرع وفعل ما به أمر وترك ما عنه نهى وزجر. ثم قال تعالى \"فإن توليتم فإنما على رسولنا البلاغ المبين\" أي إن نكلتم عن العمل فإنما عليه ما حمل من البلاغ وعليكم ما حملتم من السمع والطاعة. قال الزهري من الله الرسالة وعلى الرسول البلاغ وعلينا التسليم."
    },
    {
      "ayah": 13,
      "surah": 64,
      "text": "ثم قال تعالى مخبرا أنه الأحد الصمد الذي لا إله غيره فقال تعالى \"الله لا إله إلا هو وعلى الله فليتوكل المؤمنون\" فالأول خبر عن التوحيد ومعناه معنى الطلب أي وحدوا الإلهية له وأخلصوها لديه وتوكلوا عليه كما قال تعالى \"رب المشرق والمغرب لا إله إلا هو فاتخذه وكيلا\"."
    },
    {
      "ayah": 14,
      "surah": 64,
      "text": "يقول تعالى مخبرا عن الأزواج والأولاد أن منهم من هو عدو الزوج والولد بمعنى أنه يلتهي به عن العمل الصالح كقوله تعالى \"يا أيها الذين آمنوا لا تلهكم أموالكم ولا أولادكم عن ذكر الله ومن يفعل ذلك فأولئك هم الخاسرون\" ولهذا قال تعالى ههنا \"فاحذروهم\" قال ابن زيد يعني على دينكم وقال مجاهد \"إن من أزواجكم وأولادكم عدوا لكم\" قال يحمل الرجل على قطيعة الرحم أو معصية ربه فلا يستطيع الرجل مع حبه إلا أن يطيعه وقال ابن أبي حاتم حدثنا أبي حدثنا محمد بن خلف الصيدلاني حدثنا الفريابي حدثنا إسرائيل حدثنا سماك بن حرب عن عكرمة عن ابن عباس وسأله رجل عن هذه الآية \"يا أيها الذين آمنوا إن من أزواجكم وأولادكم عدوا لكم فاحذروهم\" قال فهؤلاء رجال أسلموا من مكة فأرادوا أن يأتوا رسول الله صلى الله عليه وسلم فأبى أزواجهم وأولادهم أن يدعوهم فلما أتوا رسول الله صلى الله عليه وسلم رأوا الناس قد فقهوا في الدين فهموا أن يعاقبوهم فأنزل الله تعالى هذه الآية \"وإن تعفوا وتصفحوا وتغفروا فإن الله غفور رحيم\" وكذا رواه الترمذي عن محمد بن يحيى عن الفريابي وهو محمد بن يوسف به وقال حسن صحيح ورواه ابن جرير والطبراني من حديث إسرائيل به وروى من طريق العوفي عن ابن عباس نحوه وهكذا قال عكرمة مولاه سواء."
    },
    {
      "ayah": 15,
      "surah": 64,
      "text": "وقوله تعالى \"إنما أموالكم وأولادكم فتنة والله عنده أجر عظيم\" يقول تعالى إنما الأموال والأولاد فتنة أي اختبار وابتلاء من الله تعالى لخلقه ليعلم من يطيعه ممن يعصيه وقوله تعالى \"والله عنده\" أي يوم القيامة \"أجر عظيم\" كما قال تعالى \"زين للناس حب الشهوات من النساء والبنين والقناطير المقنطرة من الذهب والفضة والخيل المسومة والأنعام والحرث ذلك متاع الحياة الدنيا والله عنده حسن المآب\" والتي بعدها وقال الإمام أحمد حدثنا زيد بن الحباب حدثني حسين بن واقد حدثني عبدالله بن بريدة سمعت أبا بريدة يقول كان رسول الله صلى الله عليه وسلم يخطب فجاء الحسن والحسين رضي الله عنهما عليهما قميصان أحمران يمشيان ويعثران فنزل رسول الله صلى الله عليه وسلم من المنبر فحملهما فوضعهما بين يديه ثم قال \"صدق الله ورسوله إنما أموالكم وأولادكم فتنة نظرت إلى هذين الصبيين يمشيان ويعثران فلم أصبر حتى قطعت حديثي ورفعتهما\" ورواه أهل السنن من حديث حسين بن واقد به وقال الترمذي حسن غريب إنما نعرفه من حديثه وقال الإمام أحمد حدثنا شريح بن النعمان حدثنا هشيم أخبرنا مجالد عن الشعبي حدثنا الأشعث بن قيس قال: قدمت على رسول الله صلى الله عليه وسلم في وفد كندة فقال لي \"هل لك من ولد؟\" قلت غلام ولد لي في مخرجي إليك من ابنة حمد ولوددت أن بمكانه سبع القوم فقال \"لا تقولن ذلك فإن فيهم قرة عين وأجرا إذا قبضوا\" ثم قال \"ولئن قلت ذاك إنهم لمجبنة محزنة\" تفرد به أحمد وقال الحافظ أبو بكر البزار حدثنا محمود بن بكر حدثنا أبي عن عيسى عن ابن أبي ليلى عن عطية عن أبي سعيد قال: قال رسول الله صلى الله عليه وسلم \"الولد ثمرة القلوب وإنهم مجبنة محزنة\" ثم قال لا نعرفه إلا بهذا الإسناد وقال الطبراني حدثنا هاشم بن مرثد حدثنا محمد بن إسماعيل بن عياش حدثني أبي حدثني ضمضم بن زرعة عن شريح بن عبيد عن أبي مالك الأشعري أن رسول الله صلى الله عليه وسلم قال \"ليس عدوك الذي إن قتلته كان فوزا لك وإن قتلك دخلت الجنة ولكن الذي لعله عدو لك ولدك الذي خرج من صلبك ثم أعدى عدو لك مالك الذي ملكت يمينك\"."
    },
    {
      "ayah": 16,
      "surah": 64,
      "text": "وقوله تعالى \"فاتقوا الله ما استطعتم\" أي جهدكم وطاقتكم كما ثبت في الصحيحين عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: \"إذا أمرتكم بأمر فائتوا منه ما استطعتم وما نهيتكم عنه فاجتنبوه\" وقد قال بعض المفسرين كما رواه مالك عن زيد بن أسلم إن هذه الآية ناسخة للتي في آل عمران وهي قوله تعالى \"يا أيها الذين آمنوا اتقوا الله حق تقاته ولا تموتن إلا وأنتم مسلمون\" قال ابن أبي حاتم حدثنا أبو زرعة حدثني يحيى بن عبدالله بن بكير حدثني ابن لهيعة حدثني عطاء هو ابن دينار عن سعيد بن جبير في قوله \"اتقوا الله حق تقاته ولا تموتن إلا وأنتم مسلمون\" قال لما نزلت هذه الآية اشتد على القوم العمل فقاموا حتى ورمت عراقيبهم وتقرحت جباههم فأنزل الله تعالى هذه الآية تخفيفا على المسلمين \"فاتقوا الله ما استطعتم\" فنسخت الآية الأولى وروي عن أبي العالية وزيد بن أسلم وقتادة والربيع بن أنس والسدي ومقاتل بن حيان نحو ذلك وقوله تعالى \"واسمعوا وأطيعوا\" أي كونوا منقادين لما يأمركم الله به ورسوله ولا تحيدوا عنه يمنة ولا يسرة ولا تقدموا بين يدي الله ورسوله ولا تتخلفوا عما به أمرتم. ولا تركبوا ما عنه زجرتم وقوله تعالى \"وأنفقوا خيرا لأنفسكم\" أي وابذلوا مما رزقكم الله على الأقارب والفقراء والمساكين وذوي الحاجات وأحسنوا إلى خلق الله كما أحسن الله إليكم يكن خيرا لكم في الدنيا والآخرة وإن لا تفعلوا يكن شرا لكم في الدنيا والآخرة وقوله تعالى \"ومن يوق شح نفسه فأولئك هم المفلحون\" تقدم تفسيره في سورة الحشر وذكر الأحاديث الواردة في معنى هذه الآية بما أغنى عن إعادته ههنا ولله الحمد والمنة."
    },
    {
      "ayah": 17,
      "surah": 64,
      "text": "وقوله تعالى \"إن تقرضوا الله قرضا حسنا يضاعفه لكم ويغفر لكم\" أي مهما أنفقتم من شيء فهو يخلفه ومهما تصدقتم من شيء فعليه جزاؤه ونزل ذلك منزلة القرض له كما ثبت في الصحيحين أن الله تعالى يقول: من يقرض غير ظلوم ولا عديم ولهذا قال تعالى يضاعفه لكم كما تقدم في سورة البقرة \"فيضاعفه له أضعافا كثيرة\" \"ويغفر لكم\" أي ويكفر عنكم السيئات ولهذا قال تعالى \"والله شكور\" أي يجزي على القليل بالكثير \"حليم\" أي يصفح ويغفر ويستر ويتجاوز عن الذنوب والزلات والخطايا والسيئات."
    },
    {
      "ayah": 18,
      "surah": 64,
      "text": "\" عالم الغيب والشهادة \" أي يعلم كل شيء مما يشاهده العباد ومما يغيب عنهم ولا يخفى عليه منه شيء \" العزيز الحكيم \" أي ذو العزة والحكمة في شرعه وقدره."
    },
    {
      "ayah": 2,
      "surah": 64,
      "text": "وقوله تعالى \"هو الذي خلقكم فمنكم كافر ومنكم مؤمن\" أي هو الخالق لكم على هذه الصفة وأراد منكم ذلك فلا بد من وجود مؤمن وكافر وهو البصير بمن يستحق الهداية ممن يستحق الضلال وهو شهيد على أعمال عباده وسيجزيهم بها أتم الجزاء ولهذا قال تعالى والله بما تعملون بصير."
    },
    {
      "ayah": 3,
      "surah": 64,
      "text": "ثم قال تعالى \"خلق السموات والأرض بالحق\" أي بالعدل والحكمة \"وصوركم فأحسن صوركم\" أي أحسن أشكالكم كقوله تعالى \"يا أيها الإنسان ما غرك بربك الذي خلقك فسواك فعدلك في أي صورة ما شاء ركبك\" وكقوله تعالى \"الله الذي جعل لكم الأرض قرارا والسماء بناء وصوركم فأحسن صوركم ورزقكم من الطيبات\" الآية وقوله تعالى \"وإليه المصير\" أي المرجع والمآب."
    },
    {
      "ayah": 4,
      "surah": 64,
      "text": "ثم أخبر تعالى عن علمه بجميع الكائنات السمائية والأرضية والنفسية فقال تعالى \"يعلم ما في السموات والأرض ويعلم ما تسرون وما تعلنون والله عليم بذات الصدور\"."
    },
    {
      "ayah": 5,
      "surah": 64,
      "text": "يقول تعالى مخبرا عن الأمم الماضين وما حل بهم من العذاب والنكال في مخالفة الرسل والتكذيب بالحق فقال تعالى \"ألم يأتكم نبأ الذين كفروا من قبل\" أي خبرهم وما كان من أمرهم \"فذاقوا وبال أمرهم\" أي وخيم تكذيبهم ورديء أفعالهم وهو ما حل بهم في الدنيا من العقوبة والخزي \"ولهم عذاب أليم\" أي في الدار الآخرة مضاف إلى هذا الدنيوي."
    },
    {
      "ayah": 6,
      "surah": 64,
      "text": "ثم علل ذلك فقال \"ذلك بأنه كانت تأتيهم رسلهم بالبينات\" أي بالحجج والدلائل والبراهين \"فقالوا أبشر يهدوننا\" أي استبعدوا أن تكون الرسالة في البشر وأن يكون هداهم على يدي بشر مثلهم \"فكفروا وتولوا\" أي كذبوا بالحق ونكلوا عن العمل \"واستغنى الله\" أي عنهم \"والله غني حميد\"."
    },
    {
      "ayah": 7,
      "surah": 64,
      "text": "يقول تعالى مخبرا عن الكفار والمشركين والملحدين أنهم يزعمون أنهم لا يبعثون \"قل بلى وربي لتبعثن ثم لتنبؤن بما عملتم\" أي لتخبرن بجميع أعمالكم جليلها وحقيرها صغيرها وكبيرها \"وذلك على الله يسير\" أي بعثكم ومجازاتكم وهذه هي الآية الثالثة التي أمر الله رسوله صلى الله عليه وسلم أن يقسم بربه عز وجل على وقوع المعاد ووجوده فالأولى فى سورة يونس \"ويستنبؤنك أحق هو قل إي وربي إنه الحق وما أنتم بمعجزين\" والثانية في سورة سبأ \"وقال الذين كفروا لا تأتينا الساعة قل بلى وربي لتأتينكم\" الآية والثالثة هي هذه \"زعم الذين كفروا أن لن يبعثوا قل بلى وربي لتبعثن ثم لتنبؤن بما عملتم وذلك على الله يسير."
    },
    {
      "ayah": 8,
      "surah": 64,
      "text": "ثم قال تعالى \"فآمنوا بالله ورسوله والنور الذي أنزلنا\" يعني القرآن \"والله بما تعملون خبير\" أي فلا تخفى عليه من أعمالكم خافية."
    },
    {
      "ayah": 9,
      "surah": 64,
      "text": "وقوله تعالى \"يوم يجمعكم ليوم الجمع\" وهو يوم القيامة سمي بذلك لأنه يجمع فيه الأولين والآخرين في صعيد واحد يسمعهم الداعي وينفذهم البصر كما قال تعالى \"ذلك يوم مجموع له الناس وذلك يوم مشهود\" وقال تعالى \"قل إن الأولين والآخرين لمجموعون إلى ميقات يوم معلوم\" وقوله تعالى ذلك يوم \"التغابن\" قال ابن عباس هو أسم من أسماء يوم القيامة وذلك أن أهل الجنة يغبنون أهل النار وكذا قال قتادة ومجاهد وقال مقاتل بن حيان لا غبن أعظم من أن يدخل هؤلاء إلى الجنة ويذهب بأولئك إلى النار."
    }
  ]
}
