{
  "ayahs": [
    {
      "ayah": 1,
      "surah": 65,
      "text": "خوطب النبي صلى الله عليه وسلم أولا تشريفا وتكريما ثم خاطب الأمة تبعا فقال تعالى \"يا أيها النبي إذا طلقتم النساء فطلقوهن لعدتهن\" وقال ابن أبي حاتم ثنا محمد بن ثواب بن سعيد الهباري ثنا أسباط بن محمد عن سعيد عن قتادة عن أنس قال: طلق رسول الله صلى الله عليه وسلم حفصة فأتت أهلها فأنزل الله تعالى \"يا أيها النبي إذا طلقتم النساء فطلقوهن لعدتهن\" فقيل له راجعها فإنها صوامة قوامة وهي من أزواجك ونسائك في الجنة ورواه ابن جرير عن ابن بشار عن عبدالأعلى عن سعيد عن قتادة فذكره مرسلا وقد ورد من غير وجه أن رسول الله صلى الله عليه وسلم طلق حفصة ثم راجعها وقال البخاري ثنا يحيى بن بكير ثنا الليث حدثني عقيل عن ابن شهاب أخبرني سالم أن عبدالله بن عمر أخبره أنه طلق امرأة له وهي حائض فذكر عمر لرسول الله صلى الله عليه وسلم فتغيظ رسول الله صلى الله عليه وسلم منه ثم قال \"ليراجعها ثم يمسكها حتى تطهر ثم تحيض فتطهر فإن بدا له أن يطلقها فليطلقها طاهرا قبل أن يمسها فتلك العدة التي أمر بها الله عز وجل\" هكذا رواه البخاري ههنا وقد رواه في مواضع من كتابه ومسلم ولفظه \"فتلك العدة التي أمر الله أن يطلق لها النساء\" ورواه أصحاب الكتب والمسانيد من طرق متعددة وألفاظ كثيرة وموضع استقصائها كتب الأحكام وأمس لفظ يورد ههنا ما رواه مسلم في صحيحه من طريق ابن جريج أخبرني أبو الزبير أنه سمع عبدالرحمن بن أيمن مولى عزة يسأل ابن عمر وأبو الزبير يسمع: كيف ترى في الرجل طلق امرأته حائضا فقال طلق ابن عمر امرأته حائضا على عهد رسول الله صلى الله عليه وسلم فقال رسول الله صلى الله عليه وسلم \"ليراجعها- فردها وقال - إذا طهرت فليطلق أو يمسك\" قال ابن عمر: وقرأ النبي صلى الله عليه وسلم \"يا أيها النبي إذا طلقتم النساء فطلقوهن لعدتهن وقال الأعمش عن مالك بن الحارث عن عبدالرحمن بن يزيد عن عبدالله في قوله تعالى \"فطلقوهن لعدتهن\" قال الطهر من غير جماع وروي عن ابن عمر وعطاء ومجاهد والحسن وابن سيرين وقتادة وميمون بن مهران ومقاتل بن حيان مثل ذلك وهو رواية عن عكرمة والضحاك وقال علي بن أبي طلحة عن ابن عباس في قوله تعالى \"فطلقوهن لعدتهن\" قال لا يطلقها وهي حائض ولا في طهر قد جامعها فيه ولكن يتركها حتى إذا حاضت وطهرت طلقها تطليقة. وقال عكرمة \"فطلقوهن لعدتهن\" العدة الطهر والقرء الحيضة أن يطلقها حبلى مستبينا حملها ولا يطلقها وقد طاف عليها ولا يدري حبلى هي أم لا. ومن هاهنا أخذ الفقهاء أحكام الطلاق وقسموه إلى طلاق سنة وطلاق بدعة فطلاق السنة أن يطلقها من غير جماع أو حاملا قد استبان حملها والبدعة هو أن يطلقها في حال الحيض أو في طهر قد جامعها فيه ولا يدري أحملت أم لا وطلاق ثالث لا سنة فيه ولا بدعة وهو طلاق الصغيرة والآيسة وغير المدخول بها وتحرير الكلام في ذلك وما يتعلق به مستقصى في كتب الفروع والله سبحانه وتعالى أعلم. وقوله تعالى \"واحصوا العدة\" أي احفظوها واعرفوا ابتداءها وانتهاءها لئلا تطول العدة على المرأة فتمتنع من الأزواج \"واتقوا الله ربكم\" أي في ذلك وقوله تعالى \"لا تخرجوهن من بيوتهن ولا يخرجن\" أي في مدة العدة لها حق السكنى على الزوج ما دامت معتدة منه فليس للرجل أن يخرجها ولا يجوز لها أيضا الخروج لأنها معتقلة لحق الزوج أيضا. وقوله تعالى \"إلا أن يأتين بفاحشة مبينة\" أي لا يخرجن من بيوتهن إلا أن ترتكب المرأة فاحشة مبينة فتخرج من المنزل والفاحشة المبينة تشمل الزنا كما قاله ابن مسعود وابن عباس وسعيد بن المسيب والشعبي والحسن وابن سيرين ومجاهد وعكرمة وسعيد بن جبير وأبو قلابة وأبو صالح والضحاك وزيد بن أسلم وعطاء الخراساني والسدي وسعيد بن أبي هلال وغيرهم وتشمل ما إذا نشزت المرأة أو بذت على أهل الرجل وآذتهم في الكلام والفعال كما قاله أبي بن كعب وابن عباس وعكرمة وغيرهم وقوله تعالى \"وتلك حدود الله\" أي شرائعه ومحارمه \"ومن يتعد حدود الله\" أي يخرج عنها ويتجاوزها إلى غيرها ولا يأتمر بها \"فقد ظلم نفسه\" أي بفعل ذلك. وقوله تعالى \"لا تدري لعل الله يحدث بعد ذلك أمرا\" أي إنما أبقينا المطلقة في منزل الزوج فى مدة العدة لعل الزوج يندم على طلاقها ويخلق الله تعالى في قلبه رجعتها فيكون ذلك أيسر وأسهل. قال الزهري عن عبيدالله بن عبدالله عن فاطمة بنت قيس في قوله تعالى \"لا تدري لعل الله يحدث بعد ذلك أمرا\" قالت هي الرجعة وكذا قال الشعبي وعطاء وقتادة والضحاك ومقاتل بن حيان والثوري ومن ههنا ذهب من ذهب من السلف ومن تابعهم كالإمام أحمد بن حنبل رحمهم الله تعالى إلى أنه لا تجب السكنى للمبتوتة أي المقطوعة وكذا المتوفى عنها زوجها واعتمدوا أيضا على حديث فاطمة بنت قيس الفهرية حين طلقها زوجها أبو عمرو بن حفص آخر ثلاث تطليقات وكان غائبا عنها باليمن فأرسل إليها بذلك فأرسل إليها وكيله بشعير يعني نفقة فتسخطته فقال والله ليس لك علينا نفقة فأتت رسول الله صلى الله عليه وسلم فقال \"ليس لك عليه نفقة\" ولمسلم \"ولا سكنى\" وأمرها أن تعتد في بيت أم شريك ثم قال \"تلك امرأة يغشاها أصحابي اعتدي عند ابن أم مكتوم فإنه رجل أعمى تضعين ثيابك\" الحديث وقد رواه الإمام أحمد من طريق أخرى بلفظ آخر فقال حدثنا يحيى بن سعيد حدثنا مجالد ثنا عامر قال: قدمت المدينة فأتيت فاطمة بنت قيس فحدثتني أن زوجها طلقها على عهد النبي صلى الله عليه وسلم فبعثه رسول الله صلى الله عليه وسلم في سرية قالت فقال لي أخوه أخرجي من الدار فقلت إن لي نفقة وسكنى حتى يحل الأجل قال لا قالت فأتيت رسول الله صلى الله عليه وسلم فقلت: إن فلانا طلقني وأن أخاه أخرجني ومنعني السكنى والنفقة فقال له \"مالك ولابنة آل قيس؟\" قال يا رسول الله إن أخي طلقها ثلاثا جميعا قالت: فقال رسول الله صلى الله عليه وسلم \"انظري يا بنت آل قيس إنما النفقة والسكنى للمرأة على زوجها ما كانت له عليها رجعة فإذا لم يكن له عليها رجعة فلا نفقة ولا سكنى اخرجي فانزلي على فلانة ثم قال إنه يتحدث إليها انزلي على ابن أم مكتوم فإنه أعمى لا يراك\" وذكر تمام الحديث. وقال أبو القاسم الطبراني ثنا أحمد بن عبدالله البزار التستري ثنا إسحاق بن إبراهيم الصواف ثنا بكر بن بكار ثنا سعيد بن يزيد البجلي ثنا عامر الشعبي أنه دخل على فاطمة بنت قيس أخت الضحاك بن قيس القرشي وزوجها أبوعمرو بن حفص بن المغيرة المخزومي فقالت إن أبا عمرو بن حفص أرسل إلي وهو منطلق في جيش إلى اليمن بطلاقي فسألت أولياءه النفقة علي والسكنى فقالوا ما أرسل إلينا في ذلك شيئا ولا أوصانا به فانطلقت إلى رسول الله صلى الله عليه وسلم فقلت يا رسول الله إن أبا عمرو بن حفص أرسل إلي بطلاقي فسألت أولياءه السكنى والنفقة علي فقال أولياؤه لم يرسل إلينا في ذلك بشيء فقال رسول الله صلى الله عليه وسلم \"إنما السكنى والنفقة للمرأة إذا كان لزوجها عليها رجعة فإذا كانت لا تحل له حتى تنكح غيره فلا نفقة لها ولا سكنى\" وكذا رواه النسائي عن أحمد بن يحيى الصوفي عن أبى نعيم الفضل بن دكين عن سعيد بن يزيد وهو الأحمسي البجلي الكوفي قال أبو حاتم الرازي وهو شيخ يروى عنه."
    },
    {
      "ayah": 10,
      "surah": 65,
      "text": "\"فاتقوا الله يا أولي الألباب\" أي الأفهام المستقيمة لا تكونوا مثلهم فيصيبكم ما أصابهم يا أولي الألباب \"الذين آمنوا\" أي صدقوا بالله ورسوله \"قد أنزل الله إليكم ذكرا\" يعني القرآن كقوله تعالى \"إنا نحن نزلنا الذكر وإنا له لحافظون\"."
    },
    {
      "ayah": 11,
      "surah": 65,
      "text": "وقوله تعالى \"رسولا يتلوا عليكم آيات الله مبينات\" قال بعضهم رسولا منصوب على أنه بدل اشتمال وملابسة لأن الرسول هو الذي بلغ الذكر. وقال ابن جرير: الصواب أن الرسول ترجمة عن الذكر يعني تفسير له ولهذا قال تعالى \"رسولا يتلوا عليكم آيات الله مبينات\" أي في حال كونها بينة واضحة جلية \"ليخرج الذين آمنوا وعملوا الصالحات من الظلمات إلى النور\" كقوله تعالى \"كتاب أنزلناه إليك لتخرج الناس من الظلمات إلى النور\" وقال تعالى \"الله ولي الذين آمنوا يخرجهم من الظلمات إلى النور\" أي من ظلمات الكفر والجهل إلى نور الإيمان والعلم وقد سمى الله تعالى الوحي الذي أنزله نورا لما يحصل به من الهدى كما سماه روحا لما يحصل به من حياة القلوب فقال تعالى \"وكذلك أوحينا إليك روحا من أمرنا ما كنت تدري ما الكتاب ولا الإيمان ولكن جعلناه نورا نهدي به من نشاء من عبادنا وإنك لتهدي إلى صراط مستقيم\" وقوله تعالى \"ومن يؤمن بالله ويعمل صالحا يدخله جنات تجري من تحتها الأنهار خالدين فيها أبدا قد أحسن الله له رزقا\" قد تقدم تفسير مثل هذا غير مرة بما أغنى عن إعادته ههنا ولله الحمد والمنة."
    },
    {
      "ayah": 12,
      "surah": 65,
      "text": "يقول تعالى مخبرا عن قدرته التامة وسلطانه العظيم ليكون ذلك باعثا على تعظيم ما شرع من الدين القويم \"الله الذي خلق سبع سموات\" كقوله تعالى إخبارا عن نوح أنه قال لقومه \"ألم تروا كيف خلق الله سبع سموات طباقا\" وقوله تعالى \"تسبح له السموات السبع والأرض ومن فيهن\". وقوله تعالى \"ومن الأرض مثلهن\" أي سبعا أيضا كما ثبت في الصحيحين \"من ظلم قيد شبر من الأرض طوقه من سبع أرضين\" وفي صحيح البخاري \"خسف به إلى سبع أرضين\" وقد ذكرت طرقه وألفاظه وعزوه في أول البداية والنهاية عند ذكر خلق الأرض ولله الحمد والمنة. ومن حمل ذلك على سبعة أقاليم فقد أبعد النجعة وأغرق في النزع وخالف القرآن والحديث بلا مستند وقد تقدم في سورة الحديد عند قوله تعالى \"هو الأول والآخر والظاهر والباطن\" ذكر الأرضين السبع وبعد ما بينهن وكثافة كل واحدة منهن خمسمائة عام وهكذا قال ابن مسعود وغيره وكذا في الحديث الآخر \"ما السموات السبع وما فيهن وما بينهن والأرضون السبع وما فيهن وما بينهن في الكرسي إلا كحلقة ملقاة بأرض فلاة\". وقال ابن جرير ثنا عمرو بن علي ثنا وكيع ثنا الأعمش عن إبراهيم بن مهاجر عن مجاهد عن ابن عباس في قوله تعالى \"سبع سموات ومن الأرض مثلهن\" قال لو حدثتكم بتفسيرها لكفرتم وكفركم تكذيبكم بها وحدثنا ابن حميد ثنا يعقوب بن عبدالله بن سعد القمي الأشعري عن جعفر بن أبي المغيرة الخزاعي عن سعيد بن جبير قال: قال رجل لابن عباس \"الله الذي خلق سبع سموات ومن الأرض مثلهن\" الآية فقال ابن عباس ما يؤمنك إن أخبرتك بها فتكفر. وقال ابن جرير ثنا عمرو بن علي ومحمد بن المثنى قالا ثنا محمد بن جعفر ثنا شعبة عن عمرو بن مرة عن أبي الضحى عن ابن عباس فى هذه الآية \"الله الذي خلق سبع سموات ومن الأرض مثلهن\" قال عمرو قال في كل أرض مثل إبراهيم ونحو ما على الأرض من الخلق. وقال ابن المثنى في حديثه في كل سماء إبراهيم وروى البيهقي في كتاب الأسماء والصفات هذا الأثر عن ابن عباس بأبسط من هذا فقال أنا أبو عبدالله الحافظ ثنا أحمد بن يعقوب ثنا عبيد بن غنام النخعي أنا علي بن حكيم ثنا شريك عن عطاء بن السائب عن أبي الضحى عن ابن عباس قال \"الله الذي خلق سبع سموات ومن الأرض مثلهن\" قال سبع أرضين في كل أرض نبي كنبيكم وآدم كآدم ونوح كنوح وإبراهيم كإبراهيم وعيسى كعيسى. ثم رواه البيهقي من حديث شعبة عن عمرو بن مرة عن أبي الضحى عن ابن عباس في قول الله عز وجل \"الله الذي خلق سبع سموات ومن الأرض مثلهن\" قال في كل أرض نحو إبراهيم عليه السلام ثم قال البيهقي إسناد هذا عن ابن عباس صحيح وهو شاذ بمرة لا أعلم لأبي الضحى عليه متابعا والله أعلم قال الإمام أبو بكر عبدالله بن محمد بن أبي الدنيا القرشي في كتابه التفكر والاعتبار حدثني إسحاق بن حاتم المدائني ثنا يحيى بن سليمان عن عثمان بن أبي دهرس قال بلغني أن رسول الله صلى الله عليه وسلم انتهى إلى أصحابه وهم سكوت لا يتكلمون فقال \"مالكم لا تتكلمون؟\" فقالوا نتفكر في خلق الله عز وجل قال \"فكذلك فافعلوا تفكروا في خلق الله ولا تتفكروا فيه فإن بهذا المغرب أرضا بيضاء نورها بياضها - أو قال بياضها نورها- مسيرة الشمس أربعين يوما بها خلق من خلق الله تعالى لم يعصوا الله طرفة عين قط\" قالوا فأين الشيطان عنهم؟ قال \"ما يدرون خلق الشيطان أم لم يخلق؟\" قالوا أمن ولد آدم؟ قال \"لا يدرون خلق آدم أم لم يخلق؟\" وهذا حديث مرسل وهو منكر جدا وعثمان بن آبي دهرس ذكره ابن أبي حاتم في كتابه فقال روى عن رجل من آل الحكم بن أبي العاص وعنه سفيان بن عيينة ويحيى بن سليم الطائفي وابن المبارك سمعت أبي يقول ذلك. آخر تفسير سورة الطلاق ولله الحمد والمنة."
    },
    {
      "ayah": 2,
      "surah": 65,
      "text": "يقول تعالى فإذا بلغت المعتدات أجلهن أي شارفن على انقضاء العدة وقاربن ذلك ولكن لم تفرغ العدة الكلية فحينئذ إما أن يعزم الزوج على إمساكها وهو رجعتها إلى عصمة نكاحه والاستمرار بها على ما كانت عليه عنده \"بمعروف\" أي محسنا إليها في صحبتها وإما أن يعزم على مفارقتها بمعروف أي من غير مقابحة ولا مشاتمة ولا تعنيف بل يطلقها على وجه جميل وسبيل حسن وقوله تعالى \"وأشهدوا ذوي عدل منكم\" أي على الرجعة إذا عزمتم عليها كما رواه أبو داود وابن ماجه عن عمران بن حصين أنه سئل عن الرجل يطلق المرأة ثم يقع بها ولم يشهد على طلاقها ولا على رجعتها فقال طلقت لغير سنة ورجعت لغير سنة وأشهد على طلاقها وعلى رجعتها ولا تعد وقال ابن جريج كان عطاء يقول \"وأشهدوا ذوي عدل منكم\" قال لا يجوز في نكاح ولا طلاق ولا رجاع إلا شاهدا عدل كما قال الله عز وجل إلا أن يكون من عذر. وقوله تعالى \"ذلكم يوعظ به من كان يؤمن بالله واليوم الآخر\" أي هذا الذي أمرناكم به من الإشهاد وإقامة الشهادة إنما يأتمر به من يؤمن بالله واليوم الآخر وأنه شرع هذا ومن يخاف عقاب الله في الدار الآخرة ومن ههنا ذهب الشافعي في أحد قوليه إلى وجوب الإشهاد في الرجعة كما يجب عنده في ابتداء النكاح وقد قال بهذا طائفة من العلماء ومن قال بهذا يقول إن الرجعة لا تصح إلا بالقول ليقع الإشهاد عليها. وقوله تعالى \"ومن يتق الله يجعل له مخرجا ويرزقه من حيث لا يحتسب\" أي ومن يتق الله فيما أمره به وترك ما نهاه عنه يجعل له من أمره مخرجا ويرزقه من حيث لا يحتسب أى من جهة لا تخطر بباله قال الإمام أحمد حدثنا يزيد أنا كهمس بن الحسن حدثنا أبو السليل عن أبي ذر قال: جعل رسول الله صلى الله عليه وسلم يتلو عليّ هذه الآية \"ومن يتق الله يجعل له مخرجا ويرزقه من حيث لا يحتسب\" حتى فرغ من الآية ثم قال \"يا أبا ذر لو أن الناس كلهم أخذوا بها كفتهم\" وقال فجعل يتلوها ويرددها علي حتى نعست ثم قال \"يا أبا ذر كيف تصنع إذا أخرجت من المدينة؟\" قلت إلى السعة والدعة أنطلق فأكون حمامة من حمام مكة قال \"كيف تصنع إذا خرجت من مكة؟\" قال: قلت إلى السعة والدعة إلى الشام والأرض المقدسة قال \"وكيف تصنع إذا أخرجت من الشام؟ قلت إذا والذي بعثك بالحق أضع سيفى على عاتقي قال \"أو خير من ذلك\" قلت أو خير من ذلك؟ قال \"تسمع وتطيع وإن كان عبدا حبشيا\"."
    },
    {
      "ayah": 3,
      "surah": 65,
      "text": "وقال ابن أبي حاتم ثنا أحمد بن منصور الرمادي ثنا علي بن عبيد ثنا ذكريا عن عامر عن شتير بن شكل قال سمعت عبدالله بن مسعود يقول إن أجمع آية في القرآن \"إن الله يأمر بالعدل والإحسان\" وإن أكبر آية في القرآن فرجا \"ومن يتق الله يجعل له مخرجا\" وفي المسند حدثني مهدي بن جعفر ثنا الوليد بن مسلم عن الحكم بن مصعب عن محمد بن علي بن عبدالله بن عباس عن أبيه عن جده عبدالله بن عباس قال: قال رسول الله صلى الله عليه وسلم \"من أكثر من الاستغفار جعل الله له من كل هم فرجا ومن كل ضيق مخرجا ورزقه من حيث لا يحتسب\". وقال علي بن أبي طلحة عن ابن عباس \"ومن يتق الله يجعل له مخرجا\" يقول ينجيه من كل كرب في الدنيا والآخرة \"ويرزقه من حيث لا يحتسب\" وقال الربيع بن خيثم \"يجعل له مخرجا\" أي من كل شيء ضاق على الناس وقال عكرمة من طلق كما أمره الله يجعل له مخرجا وكذا روى عن ابن عباس والضحاك وقال ابن مسعود ومسروق \"ومن يتق الله يجعل له مخرجا\" يعلم أن الله وإن شاء أعطى وإن شاء منع \"من حيث لا يحتسب\" أي من حيث لا يدري. وقال قتادة \"ومن يتق الله يجعل له مخرجا\" أي من شبهات الأمور والكرب عند الموت \"ويرزقه من حيث لا يحتسب\" من حيث يرجو ولا يأمل وقال السدي \"ومن يتق الله\" يطلق للسنة ويراجع للسنة وزعم أن رجلا من أصحاب رسول الله صلى الله عليه وسلم يقال له عوف بن مالك الأشجعي كان له ابن وأن المشركين أسروه فكان فيهم وكان أبوه يأتي رسول الله صلى الله عليه وسلم فيشكو إليه مكان ابنه وحاله التي هو بها وحاجته فكان رسول الله صلى الله عليه وسلم يأمره بالصبر ويقول له \"إن الله سيجعل لك فرجا\" فلم يلبث بعد ذلك إلا يسيرا أن انفلت ابنه من أيدي العدو فمر بغنم من أغنام العدو فاستاقها فجاء بها إلى أبيه وجاء معه بغنم قد أصابه من المغنم فنزلت فيه هذه الآية \"ومن يتق الله يجعل له مخرجا ويرزقه من حيث لا يحتسب\" رواه ابن جرير وروى أيضا من طريق سالم بن أبي الجعد مرسلا نحوه وقال الإمام أحمد ثنا وكيع ثنا سفيان عن عبدالله بن عيسى عن عبدالله بن أبي الجعد عن ثوبان قال: قال رسول الله صلى الله عليه وسلم \"وإن العبد ليحرم الرزق بالذنب يصيبه ولا يرد القدر إلا الدعاء ولا يزيد في العمر إلا البر\" ورواه النسائي وابن ماجه من حديث سفيان وهو الثوري به وقال محمد بن إسحاق جاء مالك الأشجعي إلى رسول الله صلى الله عليه وسلم فقال له أسرا بني عوف فقال له رسول الله صلى الله عليه وسلم \"أرسل إليه أن رسول الله يأمرك أن تكثر من قول لا حول ولا قوة إلا بالله\" وكانوا قد شدوه بالقد فسقط القد عنه فخرج فإذا هو بناقة لهم فركبها وأقبل فإذا بسرح القوم الذين كانوا قد شدوه فصاح بهم فاتبع أولها آخرها فلم يفجأ أبويه إلا وهو ينادي بالباب فقال أبوه عوف ورب الكعبة فقالت أمه واسوأتاه وعوف كيف يقدم لما هو فيه من القد فاستبقا الباب والخادم فإذا عوف قد ملأ الفناء إبلا فقص على أبيه أمره وأمر الإبل فقال أبوه قفا حتى آتى رسول الله صلى الله عليه وسلم فأسأله عنها فأتى رسول الله صلى الله عليه وسلم فأخبره بخبر عوف وخبر الإبل فقال له رسول الله صلى الله عليه وسلم \"اصنع بها ما أحببت وما كنت صانعا بمالك\" ونزل \"ومن يتق الله يجعل له مخرجا ويرزقه من حيث لا يحتسب\" رواه ابن أبي حاتم. وقال ابن أبي حاتم ثنا علي بن الحسين ثنا محمد بن علي بن الحسن بن سفيان ثنا إبراهيم بن الأشعث ثنا الفضيل بن عياض عن هشام بن الحسن عن عمران بن حصين قال: قال رسول الله \"من انقطع إلى الله كفاه الله كل مؤونة ورزقه من حيث لا يحتسب ومن انقطع إلى الدنيا وكله إليها\". وقوله تعالى \"ومن يتوكل على الله فهو حسبه\" قال الإمام أحمد حدثنا يونس ثنا ليث ثنا قيس بن الحجاج عن حنش الصنعاني عن عبدالله بن عباس أنه حدثه أنه ركب خلف رسول الله صلى الله عليه وسلم يوما فقال له رسول الله صلى الله عليه وسلم \"يا غلام إني معلمك كلمات احفظ الله يحفظك احفظ الله تجده تجاهك وإذا سألت فاسأل الله وإذا استعنت فاستعن بالله واعلم أن الأمة لو اجتمعوا على أن ينفعوك لم ينفعوك إلا بشيء كتبه الله لك ولو اجتمعوا على أن يضروك لم يضروك إلا بشيء قد كتبه الله عليك رفعت الأقلام وجفت الصحف\" وقد رواه الترمذي من حديث الليث بن سعد وابن لهيعة به وقال حسن صحيح وقال الإمام أحمد حدثنا وكيع حدثنا بشير بن سلمان عن سيار أبي الحكم عن طارق بن شهاب عن عبدالله بن مسعود قال: قال رسول الله صلى الله عليه وسلم \"من نزل به حاجة فأنزلها بالناس كان قمنا أن لا تسهل حاجته ومن أنزلها بالله تعالى أتاه الله برزق عاجل أو بموت آجل\" ثم رواه عن عبدالرزاق عن سفيان عن بشير عن سيار أبي حمزة ثم قال وهو الصواب وسيار أبو الحكم لم يحدث عن طارق وقوله تعالى \"إن الله بالغ أمره\" أي منفذ قضاياه وأحكامه في خلقه بما يريده ويشاؤه \"قد جعل الله لكل شيء قدرا\" كقوله تعالى \"وكل شيء عنده بمقدار."
    },
    {
      "ayah": 4,
      "surah": 65,
      "text": "يقول تعالى مبينا لعدة الآيسة وهى التي قد انقطع عنها المحيض لكبرها أنها ثلاثة أشهر عوضا عن الثلاثة قروء في حق من تحيض كما دلت على ذلك آية البقرة وكذا الصغار اللائي لم يبلغن سن الحيض أن عدتهن كعدة الآيسة ثلاثة أشهر ولهذا قال تعالى \"واللائي لم يحضن\" وقوله تعالى \"إن ارتبتم\" فيه قولان \"أحدهما\" وهو قول طائفة من السلف كمجاهد والزهري وابن زيد أي إن رأين دما وشككتم في كونه حيضا أو استحاضه ورتبتم فيه \"والقول الثاني\" أن ارتبتم في حكم عدتهم ولم تعرفوه فهو ثلاث أشهر وهذا مروي عن سعيد بن جبير وهو اختيار ابن جرير وهو أظهر في المعنى واحتج علم بما رواه عن أبي كريب وأبي السائب قالا ثنا ابن إدريس أنا مطرف عن عمرو بن سالم قال: قال أبي بن كعب يا رسول الله إن عددا من عدد النساء لم تذكر في الكتاب: الصغار والكبار وأولات الأحمال قال فأنزل الله عز وجل \"واللائي يئسن من المحيض من نسائكم إن ارتبتم فعدتهن ثلاثة أشهر واللائي لم يحضن وأولات الأحمال أجلهن أن يضعن حملهن\". ورواه ابن أبي حاتم بأبسط من هذا السياق فقال: ثنا أبي ثنا يحيى بن المغيرة أنا جرير عن مطرف عن عمر بن سالم عن أبي بن كعب قال: قلت لرسول الله صلى الله عليه وسلم إن ناسا من أهل المدينة لما أنزلت هذه الآية التي في البقرة في عدة النساء قالوا لقد بقي من عدة النساء ولم يذكرن في القرآن: الصغار والكبار اللائي قد انقطع منهن الحيض وذوات الحمل قال فأنزلت التي في النساء القصرى \"واللائي يئسن من المحيض من نسائكم إن ارتبتم فعدتهن ثلاثة أشهر واللائي لم يحضن\" وقوله تعالى \"وأولات الأحمال أجلهن أن يضعن حملهن\" يقول تعالى ومن كانت حاملا فعدتها بوضعه ولو كان بعد الطلاق أو الموت بفواق ناقة في قول جمهور العلماء من السلف والخلف كما هو نص هذه الآية الكريمة وكما وردت به السنة النبوية وقد روي عن علي وابن عباس رضي الله عنهما أنهما ذهبا في المتوفى عنها زوجها أنها تعتد بأبعد الأجلين من الوضع والأشهر عملا بهذه الآية والتي في سورة البقرة وقال البخاري ثنا سعيد بن حفص ثنا شيبان عن يحيى قال أخبرني أبو سلمة قال: جاء رجل إلى ابن عباس وأبو هريرة جالس فقال أفتني في امرأة ولدت بعد زوجها بأربعين ليلة فقال ابن عباس آخر الأجلين قلت أنا \"وأولات الأحمال أجلهن أن يضعن حملهن\" قال أبو هريرة أنا مع ابن أخي - يعني أبا سلمة- فأرسل ابن عباس غلامه كريبا إلى أم سلمة يسألها قالت: قتل زوج سبيعة الأسلمية وهي حبلى فوضعت بعد موته بأربعين ليلة فخطبت فأنكحها رسول الله صلى الله عليه وسلم وكان أبو السنابل فيمن خطبها هكذا أورد البخاري هذا الحديث ههنا مختصرا وقد رواه هو ومسلم وأصحاب الكتب مطولا من وجوه أخر وقال الإمام أحمد: ثنا حماد بن أسامة أنا هشام عن أبيه عن المسور بن مخرمة أن سبيعة الأسلمية توفي عنها زوجها وهي حامل فلم تمكث إلا ليالي حتى وضعت فلما تعلت من نفاسها خطبت فاستأذنت رسول الله صلى الله عليه وسلم في النكاح فأذن لها أن تنكح فنكحت ورواه البخاري في صحيحه ومسلم وأبو داود والنسائي وابن ماجه من طرق عنها كما قال مسلم بن الحجاج حدثني أبو الطاهر أنا ابن وهب حدثني يونس بن يزيد عن ابن شهاب حدثني عبيدالله بن عبدالله بن عتبة أن أباه كتب إلى عمر بن عبدالله بن الأرقم الزهري يأمره أن يدخل على سبيعة بنت الحارث الأسلمية فيسألها عن حديثها وعما قال لها رسول الله صلى الله عليه وسلم حين استفتته؟ فكتب عمر بن عبدالله يخبره أن سبيعة أخبرته أنها كانت تحت سعد بن خولة وكان ممن شهد بدرا فتوفي عنها في حجة الوداع وهي حامل فلم تنشب أن وضعت حملها بعد وفاته فلما تعلت من نفاسها تجملت للخطاب فدخل عليها أبو السنابل بن بعكك فقال لها مالي أراك متجملة؟ لعلك ترجين النكاح إنك والله ما أنت بناكح حتى تمر عليك أربعة أشهر وعشر. قالت سبيعة فلما قال لي ذلك جمعت علي ثيابي حين أمسيت فأتيت رسول الله صلى الله عليه وسلم فسألته عن ذلك فأفتاني بأني قد حللت حين وضعت حملي وأمرني بالتزويج إن بدا لي هذا لفظ مسلم ورواه البخاري مختصرا ثم قال البخاري بعد روايته الحديث الأول عند هذه الآية: وقال أبو سليمان بن حرب وأبو النعمان ثنا حماد بن زيد عن أيوب عن محمد هو ابن سيرين قال كنت في حلقة فيها عبدالرحمن بن أبي ليلى وكان أصحابه يعظمونه فذكر آخر الأجلين فحدثت بحديث سبيعة بنت الحارث عن عبدالله بن عتبة قال فضمر لي بعض أصحابه وقال محمد ففطنت له فقلت له إني لجريء أن كذب على عبدالله وهو في ناحية الكوفة قال فاستحيا وقال لكن عمه لم يقل ذلك فلقيت أبا عطية مالك بن عامر فسألته فذهب يحدثني بحديث سبيعة فقلت هل سمعت عن عبدالله شيئا؟ فقال كنا عند عبدالله فقال أتجعلون عليها التغليظ ولا تجعلون عليها الرخصة؟ فنزلت سورة النساء القصرى بعد الطولى \"وأولات الأحمال أجلهن أن يضعن حملهن\" ورواه ابن جرير من طريق سفيان بن عيينة وإسماعيل بن علية عن أيوب به مختصرا ورواه النسائي في التفسير عن محمد بن عبدالأعلى عن خالد بن الحارث عن ابن عون عن محمد بن سيرين فذكره وقال ابن جرير: حدثني زكريا بن يحيى بن أبان المصري ثنا سعيد بن أبي مريم ثنا محمد بن جعفر حدثني ابن شبرمة الكوفي عن إبراهيم عن علقمة بن قيس أن عبدالله بن مسعود قال: من شاء لاعنته ما نزلت \"وأولات الأحمال أجلهن أن يضعن حملهن\" إلا بعد آية المتوفى عنها زوجها قال: وإذا وضعت المتوفي عنها زوجها فقد حلت يريد بآية المتوفي عنها \"والذين يتوفون منكم ويذرون أزواجا يتربصن بأنفسهن أربعة أشهر وعشرا\" وقد رواه النسائي من حديث سعيد بن أبي مريم به ثم قال ابن جرير: ثنا أحمد بن منيع ثنا محمد بن عبيد ثنا إسماعيل بن أبي خالد عن الشعبي قال: ذكر عند ابن مسعود آخر الأجلين فقال من شاء قاسمته بالله إن هذه الآية التي في النساء القصرى نزلت بعد الأربعة الأشهر والعشر ثم قال: أجل الحامل أن تضع ما في بطنها. وقال ابن أبي حاتم ثنا أحمد بن سنان الواسطي ثنا عبدالرحمن بن مهدي عن سفيان عن الأعمش عن أبي الضحى عن مسروق قال بلغ ابن مسعود أن عليا رضي الله عنه يقول آخر الأجلين فقال من شاء لاعنته إن التي في النساء القصرى نزلت بعد البقرة \"وأولات الأحمال أجلهن أن يضعن حملهن\" ورواه أبو داود وابن ماجة من حديث أبي معاوية عن الأعمش. وقال عبدالله ابن الإمام أحمد حدثني محمد بن أبي بكر المقدمي أنا عبد الوهاب الثقفي حدثنا المثنى عن عمرو بن شعيب عن أبيه عن عبدالله بن عمرو عن أبي بن كعب قال: قلت للنبي صلى الله عليه وسلم \"وأولات الأحمال أجلهن أن يضعن حملهن\" المطلقة ثلاث أو المتوفى عنها زوجها؟ فقال: هى للمطلقة ثلاث وللمتوفى عنها. هذا حديث غريب جدا بل منكر لأن في إسناده المثنى بن الصباح وهو متروك الحديث بمرة ولكن رواه ابن أبي حاتم بسند آخر فقال حدثنا محمد بن داود السماني ثنا عمرو بن خالد يعني الحراني ثنا ابن لهيعة عن عمرو بن شعيب عن سعيد بن المسيب عن أبي بن كعب أنه لما نزلت هذه الآية قال لرسول الله صلى الله عليه وسلم لا أدري أمشتركة أم مبهمة؟ قال رسول الله صلى الله عليه وسلم \"أية آية\" قال \"أجلهن أن يضعن حملهن\" المتوفى عنها والمطلقة؟ قال: نعم وكذا رواه ابن جرير عن أبي كريب عن موسى بن داود عن ابن لهيعة به ثم رواه عن أبي كريب أيضا عن مالك بن إسماعيل عن ابن عيينة عن عبدالكريم بن أبي المخارق أنه حدث عن أبي بن كعب قال: سألت رسول الله صلى الله عليه وسلم عن \"وأولات الأحمال أجلهن أن يضعن حملهن\" قال: أجل كل حامل أن تضع ما في بطنها عبدالكريم هذا ضعيف ولم يدرك أبيا وقوله تعالى ومن يتق الله يجعل له من أمره يسرا\" أي يسهل له أمره وييسره عليه ويجعل له فرجا قريبا ومخرجا عاجلا."
    },
    {
      "ayah": 5,
      "surah": 65,
      "text": "ثم قال تعالى \"ذلك أمر الله أنزله إليكم أي حكمه وشرعه أنزله إليكم بواسطة رسول الله صلى الله عليه وسلم ومن يتق الله يكفر عنه سيئاته ويعظم له أجرا أي يذهب عنه المحذور ويجزل له الثواب على العمل اليسير."
    },
    {
      "ayah": 6,
      "surah": 65,
      "text": "يقول تعالى آمرا عباده إذا طلق أحدهم المرأة أن يسكنها في منزل حتى تنقضي عدتها فقال \"أسكنوهن من حيث سكنتم\" أي عندكم \"من وجدكم\" قال ابن عباس ومجاهد وغير واحد يعني سعتكم حتى قال قتادة إن لم تجد إلا جنب بيتك فأسكنها فيه وقوله تعالى \"ولا تضاروهن لتضيقوا عليهن\" قال مقاتل بن حيان يعني يضاجرها لتفتدي منه بمالها أو تخرج من مسكنه وقال الثوري عن منصور عن أبي الضحى \"ولا تضاروهن لتضيقوا عليهن\" قال يطلقها فإذا بقي يومان راجعها وقوله تعالى \"وإن كن أولات حمل فأنفقوا عليهن حتى يضعن حملهن\" قال كثير من العلماء منهم ابن عباس وطائفة من السلف وجماعات من الخلف هذه في البائن إن كانت حاملا أنفق عليها حتى تضع حملها قالوا بدليل أن الرجعية تجب نفقتا سواء كانت حاملا أو حائلا وقال آخرون بل السياق كله في الرجعيات وإنما نص على الإنفاق على الحامل وإن كانت رجعية لأن العمل تطول مدته غالبا فاحتيج إلى النص على وجوب الإنفاق إلى الوضع لئلا يتوهم أنه إنما تجب النفقة بمقدار مدة العدة ثم اختلف العلماء هل النفقة لها بواسطة الحمل أم للحمل وحده؟ على قولين منصوصين عن الشافعي وغيره ويتفرع عليها مسائل كثيرة مذكورة في علم الفروع. وقوله تعالى \"فإن أرضعن لكم\" أي إذا وضعن حملهن وهن طوالق فقد بن بانقضاء عدتهن ولها حينئذ أن ترضع الولد ولها أن تمتنع منه ولكن بعد أن تغذيه باللبأ وهو باكورة اللبن الذي لا قوام للمولود غالبا إلا به فإن أرضعت استحقت أجر مثلها ولها أن تعاقد أباه أو وليه على ما ينفقان عليه من أجرة ولهذا قال تعالى \"فإن أرضعن لكم فآتوهن أجورهن\" وقوله تعالى \"وائتمروا بينكم بمعروف\" أي ولتكن أموركم فيما بينكم بالمعروف من غير إضرار ولا مضارة كما قال تعالى في سورة البقرة \"لا تضار والدة بولدها ولا مولود له بولده\" وقوله تعالى \"وإن تعاسرتم فسترضع له أخرى\" أي وإن اختلف الرجل والمرأة فطلبت المرأة في أجرة الرضاع كثيرا ولم يجبها الرجل إلى ذلك أو بذل الرجل قليلا ولم توافقه عليه فليسترضع له غيرها فلو رضيت الأم بما استؤجرت به الأجنبية فهي أحق بولدها."
    },
    {
      "ayah": 7,
      "surah": 65,
      "text": "وقوله تعالى \"لينفق ذو سعة من سعته\" أى لينفق على المولود والده أو وليه بحسب قدرته \"ومن قدر عليه رزقه فلينقق مما آتاه الله لا يكلف الله نفسا إلا ما آتاها\" كقوله تعالى \"لا يكلف الله نفسا إلا وسعها\" روى ابن جرير ثنا ابن حميد ثنا حكام عن أبي سنان قال سأل عمر بن الخطاب عن أبي عبيدة فقيل إنه يلبس الغليظ من الثياب ويأكل أخشن الطعام فبعث إليه بألف دينار وقال للرسول انظر ما يصنع بها إذا هو أخذها؟ فما لبث أن لبس اللين من الثياب وأكل أطيب الطعام فجاءه الرسول فأخبره فقال رحمه الله تعالى تأول هذه الآية \"لينفق ذو سعة من سعته ومن قدر عليه رزقه فلينفق مما آتاه الله\" وقال الحافظ أبو القاسم الطبراني في معجمه الكبير ثنا هاشم بن يزيد الطبراني ثنا محمد بن إسماعيل بن عياش أخبرني أبي أخبرني ضمضم بن زرعة عن شريح بن عبيد بن أبي مالك الأشعري واسمه الحارث قال: قال رسول الله صلى الله عليه وسلم \"ثلاثة نفر كأن لأحدهم عشرة دنانير فتصدق منها بدينار وكان لآخر عشر أواق فتصدق منها بأوقية وكان لآخر مائة أوقية فتصدق منها بعشر أواق - فقال رسول الله صلى الله عليه وسلم هم في الأجر سواء كل قد تصدق بعشر ماله\" قال الله تعالى \"لينفق ذو سعة من سعته\" هذا حديث غريب من هذا الوجه. وقوله تعالى \"سيجعل الله بعد عسر يسرا\" وعد منه تعالى ووعده حق لا يخلفه وهذه كقوله تعالى \"فإن مع العسر يسرا إن مع العسر يسرا\" وقد روى الإمام أحمد حديثا يحسن أن نذكره ههنا فقال حدثنا هاشم بن القاسم ثنا عبد الحميد بن بهرام ثنا شهر بن حوشب قال: قال أبو هريرة بينما رجل وامرأة له في السلف الخالي لا يقدران على شيء فجاء الرجل من سفره فدخل على امرأته جائعا قد أصابته مسغبة شديدة فقال لامرأته عندك شيء؟ قالت نعم أبشر أتانا رزق الله فاستحثها فقال ويحك ابتغي إن كان عندك شيء قالت نعم هنيهة ترجو رحمة الله حتى إذا طال عليه الطول قال ويحك قومي فابتغي إن كان عندك شيء فأتيني به فإني قد بلغت وجهدت فقالت نعم الآن نفتح التنور فلا تعجل فلما أن سكت عنها ساعة وتحينت أن يقول لها قالت من عند نفسها لو قمت فنظرت إلى تنوري فقامت فنظرت إلى تنورها ملآن من جنوب الغنم ورحييها تطحنان فقامت إلى الرحى فنفضتها واستخرجت ما في تنورها من جنوب الغنم قال أبو هريرة فوالذي نفس أبي القاسم بيده هو قول محمد صلى الله عليه وسلم \"لو أخذت ما في رحييها ولم تنفضها لطحنتا إلى يوم القيامة\" وقال في موضع آخر حدثنا أبو عامر حدثنا أبو بكر عن هشام عن محمد وهو ابن سيرين عن أبي هريرة قال دخل رجل على أهله فلما رأى ما بهم من الحاجة خرج إلى البرية فلما رأت امرأته قامت إلى الرحى فوضعتها وإلى التنور فسجرته ثم قالت اللهم ارزقنا فنظرت فإذا الجفنة قد امتلأت قال وذهبت إلى التنور فوجدته ممتلئا قال فرجع الزوج فقال أصبتم بعدي شيئا قالت امرأته نعم من ربنا فأم إلى الرحى فذكر ذلك للنبي صلى الله عليه وسلم فقال النبي صلى الله عليه وسلم \"أما إنه لو لم ترفعها لم تزل تدور إلى يوم القيامة\"."
    },
    {
      "ayah": 8,
      "surah": 65,
      "text": "يقول تعالى متوعدا لمن خالف أمره وكذب رسله وسلك غير ما شرعه ومخبرا عما حل بالأمم السالفة بسبب ذلك فقال تعالى \"وكأين من قرية عتت عن أمر ربها ورسله\" أي تمردت وطغت واستكبرت عن اتباع أمر الله ومتابعة رسله \"فحاسبناها حسابا شديدا وعذبناها عذابا نكرا\" أي منكرا فظيعا."
    },
    {
      "ayah": 9,
      "surah": 65,
      "text": "\"فذاقت وبال امرها\" أي غب مخالفتها وندموا حيث لا ينفعهم الندم \"وكان عاقبة أمرها خسرا أعد الله لهم عذابا شديدا\" أي في الدار الآخرة مع ما عجل لهم من العذاب في الدنيا ثم قال تعالى بعدما قص من خبر هؤلاء."
    }
  ]
}
