{
  "ayahs": [
    {
      "ayah": 1,
      "surah": 66,
      "text": "اختلف في سبب نزول صدر هذه السورة فقيل نزلت في شأن مارية وكان رسول الله صلى الله عليه وسلم قد حرمها فنزل قوله تعالى \"يا أيها النبي لم تحرم ما أحل الله لك تبتغي مرضات أزواجك\" الآية قال أبو عبدالرحمن النسائي أخبرنا إبراهيم بن يونس بن محمد حدثنا أبي حدثنا حماد بن سلمة عن ثابت عن أنس أن رسول الله صلى الله عليه وسلم كانت له أمة يطؤها فلم تزل به عائشة وحفصة حتى حرمها فأنزل الله عز وجل \"يا أيها النبي لم تحرم ما أحل الله لك\" إلى آخر الآية. وقال ابن جرير حدثني ابن عبدالرحيم البرقي حدثنا ابن أبي مريم ثنا أبو غسان حدثني زيد بن أسلم أن رسول الله صلى الله عليه وسلم أصاب أم إبراهيم في بيت بعض نسائه فقالت أي رسول الله في بيتي وعلى فراشي؟ فجعلها عليه حراما قالت أي رسول الله كيف يحرم عليك الحلال؟ فحلف لها بالله لا يصيبها فأنزل الله تعالى \"يا أيها النبي لم تحرم ما أحل الله لك\" قال زيد بن أسلم فقوله أنت علي حرام لغو وهكذا روى عبدالرحمن بن زيد عن أبيه وقال ابن جرير أيضا حدثنا يونس ثنا ابن وهب عن مالك عن زيد بن أسلم قال: قال لها \"أنت علي حرام والله لا أطؤك\" وقال سفيان الثوري بن علية عن داود بن أبي هند عن الشعبي عن مسروق قال آلى رسول الله صلى الله عليه وسلم وحرم فعوتب في التحريم وأمر بالكفارة فى اليمين رواه ابن جرير وكذا روي عن قتادة وغيره عن الشعبي نفسه وكذا قال غير واحد من السلف منهم الضحاك والحسن وقتادة ومقاتل بن حيان وروى العوفي عن ابن عباس قال: قلت لعمر بن الخطاب من المرأتان؟ قال عائشة وحفصة وكان بدء الحديث في شأن أم إبراهيم مارية أصابها النبي صلى الله عليه وسلم في بيت حفصة في نوبتها فوجدت حفصة فقالت يا نبي الله لقد جئت إلي شيئا ما جئت إلى أحد من أزواجك في يومي وفي دوري وعلى فراشي قال \"ألا ترضين أن أحرمها فلا أقربها\" قالت بلى فحرمها وقال لها \"لا تذكري ذلك لأحد\" فذكرته لعائشة فأظهره الله عليه فأنزل الله تعالى \"يا أيها النبي لم تحرم ما أحل الله لك تبتغي مرضات أزواجك\" الآيات كلها فبلغنا أن رسول الله صلى الله عليه وسلم كفر عن يمينه وأصاب جاريته وقال الهيثم بن كليب في مسنده ثنا أبو قلابة عبدالملك بن محمد الرقاشي ثنا مسلم بن إبراهيم ثنا جرير بن حازم عن أيوب عن نافع عن ابن عمر عن عمر قال: قال النبي صلى الله عليه وسلم لحفصة \"لا تخبري أحدا وإن أم إبراهيم علي حرام\" فقالت أتحرم ما أحل الله لك؟ قال \"فوالله لا أقربها\" قال فلم يقربها حتى أخبرت عائشة."
    },
    {
      "ayah": 10,
      "surah": 66,
      "text": "ثم قال تعالى \"ضرب الله مثلا للذين كفروا\" أي في مخالطتهم المسلمين ومعاشرتهم لهم أن ذلك لا يجدي عنهم شيئا ولا ينفعهم عند الله إن لم يكن الإيمان حاصلا في قلوبهم ثم ذكر المثل فقال \"امرأة نوح وامرأة لوط كانتا تحت عبدين من عبادنا صالحين\" أي نبيين رسولين عندهما في صحبتهما ليلا ونهارا يؤاكلانهما ويضاجعانهما ويعاشرانهما أشد العشرة والاختلاط \"فخانتاهما\" أي في الإيمان لم يوافقاهما على الإيمان ولا صدقاهما في الرسالة فلم يجد ذلك كله شيئا ولا دفع عنهما محذورا ولهذا قال تعالى \"فلم يغنيا عنهما من الله شيئا\" أي لكفرهما \"وقيل\" للمرأتين \"ادخلا النار مع الداخلين\" وليس المراد بقوله \"فخانتاهما\" في فاحشة بل في الدين فإن نساء الأنبياء معصومات عن الوقوع في الفاحشة لحرمة الأنبياء كما قدمنا في سورة النور قال سفيان الثوري عن موسى بن أبي عائشة عن سليمان بن قرم سمعت ابن عباس يقول في هذه الآية \"فخانتاهما\" قال ما زنتا أما خيانة أمرأة نوح فكانت تخبر أنه مجنون وأما خيانة امرأة لوط فكانت تدل قومها على أضيافه وقال العوفي عن ابن عباس قال كانت خيانتهما أنهما كانتا على غير دينهما فكانت امرأة نوح تطلع على سر نوح فإذا آمن مع نوح أحدا أخبرت الجبابرة من قوم نوح به وأما امرأة لوط فكانت إذا أضاف لوط أحد أخبرت به أهل المدينة ممن يعمل السوء وقال الضحاك عن ابن عباس ما بغت امرأة نبي قط إنما كانت خيانتهما في الدين وهكذا قال عكرمة وسعيد بن جبير والضحاك وغيرهم وقد استدل بهذه الآية الكريمة بعض العلماء على ضعف الحديث الذي يأثره كثير من الناس: من أكل مع مغفور له غفر له. وهذا الحديث لا أصل له وإنما يروى هذا عن بعض الصالحين انه رأى النبي صلى الله عليه وسلم في المنام فقال يا رسول الله أنت قلت من أكل مع مغفور له غفر له؟ قال: لا ولكني الآن أقوله."
    },
    {
      "ayah": 11,
      "surah": 66,
      "text": "وهذا مثل ضربه الله للمؤمنين أنهم لا تضرهم مخالطة الكافرين إذا كانوا محتاجين إليهم كما قال تعالى \"لا يتخذ المؤمنون الكافرين أولياء من دون المؤمنين ومن يفعل ذلك فليس من الله في شيء إلا أن تتقوا منهم تقاة\" قال قتادة كان فرعون أعتى أهل الأرض وأكفرهم فو الله ما ضر امرأته كفر زوجها حين أطاعت ربها ليعلموا أن الله تعالى حكم عدل لا يؤاخذ أحدا إلا بذنبه. وقال ابن جرير ثنا إسماعيل بن حفص الأيلي ثنا محمد بن جعفر عن سليمان التيمي عن أبي عثمان النهدي عن سليمان قال كانت امرأة فرعون تعذب في الشمس فإذا انصرف عنها أظلتها الملائكة بأجنحتها وكانت ترى بيتها في الجنة ثم رواه عن عبيد بن محمد المحاربي عن أسباط بن محمد عن سليمان التيمي به. ثم قال ابن جرير حدثني يعقوب بن إبراهيم ثنا ابن علية عن هشام الدستوائي ثنا القاسم بن أبي بزة قال: كانت امرأة فرعون تسأل من غلب؟ فيقال غلب موسى وهارون فتقول آمنت برب موسى وهارون فأرسل إليها فرعون فقال انظروا أعظم صخرة تجدونها فإن مضت على قولها فألقوها عليها وإن رجعت عن قولها فهي امرأتي فلما أتوها رفعت بصرها إلى السماء فأبصرت بيتها في الجنة فمضت على قولها وانتزعت روحها وألقيت الصخرة على جسد ليس فيه روح فقولها \"رب ابن لي عندك بيتا في الجنة\" قالت العلماء اختارت الجار قبل الدار وقد ورد شيء من ذلك في حديث مرفوع \"ونجني من فرعون وعمله\" أي خلصني منه فإني أبرأ إليك من عمله \"ونجني من القوم الظالمين\" وهذه المرأة هى آسية بنت مزاحم رضي الله عنها وقال أبو جعفر الرازي عن الربيع بن أنس عن أبي العالية قال كان إيمان امرأة فرعون من قبل إيمان امرأة خازن فرعون وذلك أنها جلست تمشط ابنة فرعون فوقع المشط من يدها فقالت تعس من كفر بالله فقالت لها بنت فرعون ولك رب غير أبي؟ قالت: ربي ورب أبيك ورب كل شيء الله فلطمتها بنت فرعون وضربتها وأخبرت أباها فأرسل إليها فرعون فقال تعبدين ربا غيري قالت نعم ربي وربك ورب كل شيء وإياه أعبد فعذبها فرعون وأوتد لها أوتادا فشد يديها ورجليها وأرسل عليها الحيات فكانت كذلك فأتى عليها يوما فقال لها ما أنت منتهية فقالت له ربي وربك ورب كل شيء الله فقال لها إني ذابح ابنك في فيك إن لم تفعلي فقالت له اقض ما أنت قاض فذبح ابنها في فيها وإن روح ابنها بشرها فقال لها أبشري يا أمه فإن لك عند الله من الثواب كذا وكذا فصبرت ثم أتى عليها فرعون يوما آخر فقال لها مثل ذلك فقالت له مثل ذلك فذبح ابنها الآخر في فيها فبشرها روحه أيضا وقال لها اصبري يا أمه فإن لك عند الله من الثواب كذا وكذا قال وسمعت امرأة فرعون كلام روح ابنها الأكبر ثم الأصغر فآمنت امرأة فرعون وقبض الله روح امرأة خازن فرعون وكشف الغطاء عن ثوابها ومنزلتها وكرامتها في الجنة لامرأة فرعون حتى رأت فازدادت إيمانا ويقينا وتصديقا فأطلع الله فرعون على إيمانها فقال للملأ ما تعلمون من آسية بنت مزاحم؟ فأثنوا عليها فقال لهم إنها تعبد غيري فقالوا له اقتلها فأوتد لها أوتادا فشد يديها ورجليها فدعت آسية ربها فقالت \"رب ابن لي عندك بيتا في الجنة\" فوافق ذلك أن حضرها فرعون فضحكت حين رأت بيتها في الجنة فقال فرعون ألا تعجبون من جنونها؟ إنا نعذبها وهي تضحك فقبض الله روحها في الجنة رضي الله عنها."
    },
    {
      "ayah": 12,
      "surah": 66,
      "text": "وقوله تعالى \"ومريم ابنة عمران التي أحصنت فرجها\" أي حفظته وصانته والإحصان هو العفاف والحرية \"فنفخنا فيه من روحنا\" أي بواسطة الملك وهو جبريل فإن الله بعثه إليها فتمثل لها في صورة بشر سوي وأمره الله تعالى أن ينفخ بفيه في جيب درعها فنزلت النفخة فولجت في فرجها فكان منه الحمل بعيسى عليه السلام ولهذا قال تعالى \"فنفخنا فيه من روحنا وصدقت بكلمات ربها وكتبه\" أي بقدره وشرعه \"وكانت من القانتين\" قال الإمام أحمد ثنا يونس ثنا داود بن أبي الفرات عن علباء عن عكرمة عن ابن عباس قال: خط رسول الله صلى الله عليه وسلم في الأرض أربعة خطوط وقال \"أتدرون ما هذا؟ \" قالوا الله ورسوله أعلم فقال رسول الله صلى الله عليه وسلم \"أفضـل نساء أهل الجنة خديجة بنت خويلد وفاطمة بنت محمد ومريم ابنة عمران وآسية بنت مزاحم امرأة فرعون\" وقد ثبت في الصحيحين من حديث شعبة عن عمرو بن مرة عن مرة الهمداني عن أبي موسى الأشعري عن النبي صلى الله عليه وسلم قال \"كمل من الرجال كثير ولم يكمل من النساء إلا آسية امرأة فرعون ومريم ابنة عمران وخديجة بنت خويلد وإن فضل عائشة على النساء كفضل الثريد على سائر الطعام\" وقد ذكرنا طرق هذه الأحاديث وألفاظهـا والكلام عليها في قصة عيسى ابن مريم عليهما السلام في كتابنا \"البداية والنهاية\" ولله الحمد والمنة وذكرنا ما ورد من الحديث من أنها تكون هي وآسية بنت مزاحم من أزواجه عليه السلام في الجنة عند قوله تعالى \"ثيبات وأبكارا\". آخر تفسير سورة التحريم ولله الحمد والمنة."
    },
    {
      "ayah": 2,
      "surah": 66,
      "text": "قال فأنزل الله تعالى \"قد فرض الله لكم تحلة أيمانكم\" وهذا إسناد صحيح ولم يخرجه أحد من أصحاب الكتب الستة وقد اختاره الحافظ الضياء المقدسي في كتابه المستخرج. وقال ابن جرير أيضا حدثني يعقوب بن إبراهيم ثنا ابن عليه ثنا هشام الدستوائي قال كتب إلي يحيى يحدث عن يعلى بن حكيم عن سعيد بن جبير أن ابن عباس كان يقول في الحرام يمين تكفرها وقال ابن عباس \"لقد كان لكم في رسول الله أسوة حسنة\" يعني أن رسول الله صلى الله عليه وسلم حرم جاريته فقال الله تعالى \"يا أيها النبي لم تحرم ما أحل الله لك - إلى قوله - قد فرض الله لكم تحلة أيمانكم\" فكفر يمينه فصير الحرام يمينا. ورواه البخاري عن معاذ بن فضالة عن هشام هو الدستوائي عن يحيى هو ابن أبي كثير عن ابن حكيم وهو يعلى عن سعيد بن جبير عن ابن عباس في الحرام يمين تكفر وقال ابن عباس \"لقد كان لكم في رسول الله أسوة حسنة\" ورواه مسلم من حديث هشام الدستوائي به وقال النسائي أنا عبدالله بن عبد الصمد بن علي ثنا مخلد بن يزيد ثنا سفيان عن سالم عن سعيد بن جبير عن ابن عباس قال أتاه رجل فقال إني جعلت امرأتي علي حراما قال كذبت ليس عليك بحرام ثم تلا هذه الآية \"يا أيها النبي لم تحرم ما أحل الله لك\" عليك أغلظ الكفارات عتق رقبة تفرد به النسائي من هذا الوجه بهذا اللفظ وقال الطبراني ثنا محمد بن زكريا ثنا عبدالله بن رجاء ثنا إسرائيل عن مسلم عن مجاهد عن ابن عباس في قوله تعالى \"يا أيها النبي لم تحرم ما أحل الله لك\" قال حرم رسول الله صلى الله عليه وسلم سريته ومن ههنا ذهب من ذهب من الفقهاء ممن قال بوجوب الكفارة على من حرم جاريته أو زوجته أو طعاما أو شرابا أو ملبسا أو شيئا من المباحات وهو مذهب الإمام أحمد وطائفة وذهب الشافعي إلى أنه لا تجب الكفارة فيما عدا الزوجة والجارية إذا حرم عينيهما أو أطلق التحريم فيهما في قول فأما إذا نوى بالتحريم طلاق الزوجة أو عتق الأمة نفذ فيهما وقال ابن أبي حاتم حدثني أبو عبدالله الطهراني أنا حفص بن عمر العدني أنا الحكم بن أبان أنا عكرمة عن ابن عباس قال نزلت هذه الآية \"يا أيها النبي لم تحرم ما أحل الله لك\" في المرأة التي وهبت نفسها للنبي صلى الله عليه وسلم وهذا قول غريب. والصحيح أن ذلك كان في تحريمه العسل كما قال البخاري عند هذه الآية ثنا إبراهيم بن موسى أنا هشام بن يوسف عن ابن جريج عن عطاء عن عبيد بن عمير عن عائشة قالت كان النبي صلى الله عليه وسلم يشرب عسلا عند زينب بنت جحش ويمكث عندها فتواطأت أنا وحفصة على أيتنا دخل عليها فلتقل له: أكلت مغافير إني أجد منك ريح مغافير. قال \"لا ولكني كنت أشرب عسلا عند زينب بنت جحش فلن أعود له وقد حلفت لا تخبري بذلك أحدا\" \"تبتغي مرضاة أزواجك\" هكذا أورد هذا الحديث ههنا بهذا اللفظ. وقال في كتاب الأيمان والنذور ثنا الحسن بن محمد ثنا الحجاج عن ابن جريج قال زعم عطاء أنه سمع عبيد بن عمير يقول سمعت عائشة تزعم أن رسول الله صلى الله عليه وسلم كان يمكث عند زينب بنت جحش ويشرب عندها عسلا فتواطأت أنا وحفصة أن أيتنا دخل عليها النبي صلى الله عليه وسلم فلتقل له إني أجد منك ريح مغافير أكلت مغافير فدخل على إحداهما النبي صلى الله عليه وسلم فقالت ذلك له فقال: \"لا بل شربت عسلا عند زينب بنت جحش ولن أعود له\" فنزلت \"يا أيها النبي لم تحرم ما أحل الله لك - إلى قوله تعالى - إن تتوبا إلى الله فقد صغت قلوبكما\" لعائشة وحفصة."
    },
    {
      "ayah": 3,
      "surah": 66,
      "text": "\"وإذ أسر النبي إلى بعض أزواجه حديثا\" لقوله \"بل شربت عسلا\" وقال إبراهيم بن موسى عن هشام \"ولن أعود له وقد حلفت فلا تخبري بذلك أحدا\" وهكذا رواه في كتاب الطلاق بهذا الإسناد ولفظه قريب منه. ثم قال المغافير شبيه بالصمغ يكون في الرمث فيه حلاوة أغفر الرمث إذا ظهر فيه واحدها مغفور ويقال مغافير وهكذا قال الجوهري قال وقد يكون المغفور أيضا للعشر والثمام والسلم والطلح قال والرمث بالكسر مرعى من مراعي الإبل وهو من الحمض قال والعرفط شجر من العظاة ينضح المغفور. وقد روى مسلم هذا الحديث في كتاب الطلاق من صحيحه عن محمد بن حاتم عن حجاج عن ابن جريج أخبرني عطاء عن عبيد بن عمير عن عائشة به ولفظه كما أورده البخاري فى الأيمان والنذور ثم قال البخاري في كتاب الطلاق ثنا فروة بن أبي المغراء ثنا علي بن مسهر عن هشام بن عروة عن أبيه عن عائشة قالت: كان رسول الله صلى الله عليه وسلم يحب الحلوى والعسل وكان إذا انصرف من العصر دخل على نسائه فيدنو من إحداهن فدخل على حفصة بنت عمر فاحتبس أكثر ما كان يحتبس فغرت فسألت عن ذلك فقيل لي أهدت لها امرأة من قومها عكة عسل فسقت النبي صلى الله عليه وسلم منه شربة فقلت أما والله لنحتالن له فقلت لسودة بنت زمعة إنه سيدنو منك فإذا دنا منك فقولي أكلت مغافير فإنه سيقول لك لا فقولي له ما هذه الريح التي أجد فإنه سيقول لك سقتني حفصة شربة عسل فقولي جرست نحله العرفط وسأقول ذلك وقولي له أنت يا صفية ذلك قالت تقول سودة فوالله ما هو إلا أن قام على الباب فأردت أن أناديه بما أمرتني فرقا منك فلما دنا منها قالت له سودة يا رسول الله أكلت مغافير؟ قال \"لا\" قالت فما هذه الريح التي أجد منك؟ قال \"سقتني حفصة شربة عسل\" قالت جرست نحله العرفط فلما دار إلي قلت نحو ذلك فلما دار إلى صفية قالت له مثل ذلك فلما دار إلى حفصة قالت له يا رسول الله ألا أسقيك منه؟ قال \"لا حاجة لي فيه\" قالت تقول سودة والله لقد حرمناه قلت لها اسكتي هذا لفظ البخاري. وقد رواه مسلم عن سويد بن سعيد عن علي بن مسهر به وعن أبي كريب وهارون بن عبدالله والحسن بن بشر ثلاثتهم عن أبي أسامة حماد بن أسامة عن هشام بن عروة به وعنده: قالت وكان رسول الله صلى الله عليه وسلم يشتد عليه أن يوجد منه الريح يعني الريح الخبيثة ولهذا قلن له أكلت مغافير لأن ريحها فيه شيء فلما قال \"بل شربت عسلا\" قلن جرست نحله العرفط أي رعت نحله شجر العرفط الذي صمغه المغافير فلهذا ظهر ريحه في العسل الذي شربته قال الجوهري جرست النحل العرفط تجرس إذا أكلته ومنه قيل للنحل جوارس قال الشاعر تظل على الثمراء منها جوارس وقال الجرس والجرس الصوت الخفي ويقال سمعت جرس الطير إذا سمعت صوت مناقيرها على شيء تأكله وفي الحديث \"فيسمعون جرس طير الجنة\" قال الأصمعي كنت في مجلس شعبة قال فيسمعون جرش طير الجنة بالشين فقلت جرس فنظر إلي فقال: خذوها عنه فإنه أعلم بهذا منا. والغرض أن هذا السياق فيه أن حفصة هي الساقية للعسل وهو من طريق هشام بن عروة عن أبيه عن خالته عن عائشة وفي طريق ابن جريج عن عطاء عن عبيد بن عمير عن عائشة أن زينب بنت جحش هي التي سقته العسل وأن عائشة وحفصة تواطأتا وتظاهرتا عليه فالله أعلم. وقد يقال أنهما واقعتان ولا بعد في ذلك إلا أن كونهما سببا لنزول هذه الآية فيه نظر والله أعلم. ومما يدل على أن عائشة وحفصة رضي الله عنهما هما المتظاهرتان الحديث الذي رواه الإمام أحمد في مسنده حيث قال ثنا عبدالرزاق أنا معمر عن الزهري عن عبيدالله بن عبدالله بن أبي ثور عن ابن عباس قال: لم أزل حريصا على أن أسأل عمر عن المرأتين من أزواج النبي صلى الله عليه وسلم اللتين."
    },
    {
      "ayah": 4,
      "surah": 66,
      "text": "قال الله تعالى \"إن تتوبا إلى الله فقد صغت قلوبكما\" حتى حج عمر وحججت معه فلما كان ببعض الطريق عدل عمر وعدلت معه بالإداوة فتبرز ثم أتاني فسكبت على يديه فتوضأ فقلت يا أمير المؤمنين من المرأتان من أزواج النبي صلى الله عليه وسلم اللتان قال الله تعالى \"إن تتوبا إلى الله فقد صغت قلوبكما\" فقال عمر: واعجبا لك يا ابن عباس قال الزهري: كره والله ما سأله عنه ولم يكتمه قال هي عائشة وحفصة قال ثم أخذ يسوق الحديث قال: كنا معشر قريش قوما نغلب النساء فلما قدمنا المدينة وجدنا قوما تغلبهم نساؤهم فطفق نساؤنا يتعلمن من نسائهم: قال وكان منزلي في دار أمية بن زيد بالعوالي قال فغضبت يوما على امرأتي فإذا هي تراجعني فأنكرت أن تراجعني فقالت ما تنكر أن أراجعك؟ فوالله إن أزواج رسول الله صلى الله عليه وسلم ليراجعنه وتهجره إحداهن اليوم إلى الليل قال فانطلقت فدخلت على حفصة فقلت أتراجعين رسول الله صلى الله عليه وسلم؟ قالت نعم. قلت: وتهجره إحد اليوم إلى الليل؟ قالت نعم قلت قد خاب من فعل ذلك منكن وخسر أفتأمن إحداكن أن يغضب الله عليها لغضب رسوله فإذا هي قد هلكت لا تراجعي رسول الله صلى الله عليه وسلم ولا تسأليه شيئا وسليني من مالي ما بدالك ولا يغرنك إن كانت جارتك هي أوسم - أي أجمل - وأحب إلى رسول الله صلى الله عليه وسلم منك يريد عائشة قال - وكان لي جار من الأنصار وكنا نتناوب النزول إلى رسول الله صلى الله عليه وسلم ينزل يوما وأنزل يوما فيأتيني بخبر الوحي وغيره وآتيه بمثل ذلك وقال وكنا نتحدث أن غسان تنعل الخيل لتغزونا فنزل صاحبي يوما ثم أتى عشاء فضرب بابي ثم ناداني فخرجت إليه فقال حدث أمر عظيم فقلت وما ذاك أجاءت غسان؟ قال لا بل أعظم من ذلك وأطول طلق رسول الله صلى الله عليه وسلم نساءه فقلت قد خابت حفصة وخسرت قد كنت أظن هذا كائنا حتى إذا صليت الصبح شددت علي ثيابي ثم نزلت فدخلت على حفصة وهي تبكي فقلت أطلقكن رسول الله صلى الله عليه وسلم؟ فقالت لا أدري هو هذا معتزل في هذه المشربة فأتيت غلاما له أسود فقلت استأذن لعمر فدخل الغلام ثم خرج إلي فقال له فصمت فانطلقت حتى أتيت المنبر فإذا عنده رهط جلوس يبكي بعضهم فجلست عنده قليلا ثم غلبني ما أجد فأتيت الغلام فقلت: استأذن لعمر فدخل ثم خرج إلي فقال قد ذكرتك له فصمت فخرجت فجلست إلى المنبر ثم غلبني ما أجد فأتيت الغلام فقلت استأذن لعمر فدخل ثم خرج إلي فقال: قد ذكرتك له فصمت فوليت مدبرا فإذا الغلام يدعوني فقال ادخل قد أذن لك فدخلت فسلمت على رسول الله صلى الله عليه وسلم فإذا هو متكئ على رمال حصير- قال الإمام أحمد: وحدثناه يعقوب في حديث صالح قال رمال حصير - وقد أثر في جنبه فقلت: أطلقت يا رسول الله نساءك؟ فرفع رأسه إلي وقال \"لا\" فقلت الله أكبر ولو رأيتنا يا رسول الله وكنا معشر قريش قوما نغلب النساء فلما قدمنا المدينة وجدنا قوما تغلبهم نساؤهم فطفق نساؤنا يتعلمن من نسائهم فغضبت علي امرأتي يوما فإذا هي تراجعني فأنكرت أن تراجعني فقالت ما تنكر أن أراجعك؟ فوالله إن أزواج النبي صلى الله عليه وسلم ليراجعنه وتهجره إحداهن اليوم إلى الليل فقلت قد خاب من فعل ذلك منكن وخسرت أفتأمن إحداكن أن يغضب الله عليها لغضب رسوله فإذا هي قد هلكت فتبسم رسول الله صلى الله عليه وسلم فقلت يا رسول الله قد دخلت على حفصة فقلت لا يغرنك إن كانت جارتك هي أوسم أو أحب إلى رسول الله صلى الله عليه وسلم منك فتبسم أخرى فقلت أستأنس يا رسول الله؟ قال \"نعم\" فجلست فرفعت رأسي في البيت فوالله ما رأيت في البيت شيئا يرد البصر إلا أهب مقامة فقلت أدع الله يا رسول الله أن يوسع على أمتك فقد وسع على فارس والروم وهم لا يعبدون الله فاستوى جالسا وقال \"أفي شك أنت يا ابن الخطاب؟ أولئك قوم عجلت لهم طيباتهم في الحياة الدنيا\" فقلت استغفر لي يا رسول الله وكان أقسم أن لا يدخل عليهن شهرا من شدة موجدته عليهن حتى عاتبه الله عز وجل وقد رواه البخاري ومسلم والترمذي والنسائي من طرق عن الزهري به وأخرجه الشيخان من حديث يحيى بن سعيد الأنصاري عن سعيد بن جبير عن ابن عباس قال: مكثت سنة أريد أن أسأل عمر بن الخطاب عن آية فما أستطيع أن أسأله هيبة له حتى خرج حاجا فخرجت معه فلما رجعنا وكنا ببعض الطريق عدل إلى الأراك لحاجة له قال فوقفت حتى فرغ ثم سرت معه فقلت يا أمير المؤمنين من اللتان تظاهرتا على النبي صلى الله عليه وسلم؟ هذا لفظ البخاري ولمسلم من المرأتان اللتان قال الله تعالى \"وإن تظاهرا عليه\" قال عائشة وحفصة ثم ساق الحديث بطوله ومنهم من اختصره. وقال مسلم أيضا حدثني زهير بن حرب حدثنا عمر بن يونس الحنفي ثنا عكرمة بن عمار عن سماك بن الوليد أبي زميل حدثني عبدالله بن عباس حدثني عمر بن الخطاب قال: لما اعتزل نبي الله صلى الله عليه وسلم نساءه دخلت المسجد فإذا الناس ينكتون بالحصى ويقولون طلق رسول الله صلى الله عليه وسلم نساءه وذلك قبل أن يؤمر بالحجاب فقلت لأعلمن ذلك اليوم فذكر الحديث في دخوله على عائشة وحفصة ووعظه إياهما إلى أن قال فدخلت فإذا أنا برباح غلام رسول الله صلى الله عليه وسلم على أسكفة المشربة فناديت فقلت يا رباح استأذن لي على رسول الله صلى الله عليه وسلم فذكر نحو ما تقدم - إلى أن قال - فقلت يا رسول الله ما يشق عليك من أمر النساء فإن كنت طلقتهن فإن الله معك وملائكته وجبريل وميكال وأنا وأبو بكر والمؤمنون معك وقلما تكلمت - وأحمد الله - بكلام إلا رجوت أن يكون الله يصدق قولي."
    },
    {
      "ayah": 5,
      "surah": 66,
      "text": "فنزلت هذه الآية آية التخيير \"عسى ربه إن طلقكن أن يبدله أزواجا خيرا منكن - وإن تظاهرا عليه فإن الله هو مولاه وجبريل وصالح المؤمنين والملائكة بعد ذلك ظهير\" فقلت أطلقتهن؟ قال \"لا\" فقمت على باب المسجد فناديت بأعلى صوتي لم يطلق نساءه ونزلت هذه الآية \"وإذا جاءهم أمر من الأمن أو الخوف أذاعوا به ولو ردوه إلى الرسول وإلى أولي الأمر منهم لعلمه الذين يستنبطونه منهم\" فكنت أنا استنبطت ذلك الأمر وكذا قال سعيد بن جبير وعكرمة ومقاتل بن حيان والضحاك وغيرهم \"وصالح المؤمنين\" أبو بكر وعمر زاد الحسن البصري وعثمان قال ليث بن أبي سليم عن مجاهد \"وصالح المؤمنين\" قال علي بن أبي طالب وقال ابن أبي حاتم حدثنا علي بن الحسين ثنا محمد بن أبي عمر ثنا محمد بن جعفر بن محمد بن الحسين قال أخبرني رجل ثقة يرفعه إلى علي قال: قال رسول الله صلى الله عليه وسلم في قوله تعالى \"وصالح المؤمنين\" قال \"هو علي بن أبي طالب\" إسناده ضعيف وهو منكر جدا وقال البخاري ثنا عمرو بن عون ثنا هشيم عن حميد عن أنس قال: قال عمر اجتمع نساء النبي صلى الله عليه وسلم في الغيرة عليه فقلت لهن \"عسى ربه إن طلقكن أن يبدله أزواجا خيرا منكن\" فنزلت هذه الآية وقد تقدم أنه وافق القرآن في أماكن منها في نزول الحجاب ومنها في أسارى بدر ومنها قوله لو اتخذت من مقام إبراهيم مصلى فأنزل الله تعالى \"واتخذوا من مقام إبراهيم مصلى\" وقال ابن أبي حاتم ثنا أبي حدثنا الأنصاري ثنا حميد عن أنس قال: قال عمر بن الخطاب بلغني شيء كان بين أمهات المؤمنين وبين النبي صلى الله عليه وسلم فاستقريتهن أقول لتكفن عن رسول الله صلى الله عليه وسلم أو ليبدلنه الله أزواجا خيرا منكن حتى أتيت على آخر أمهات المؤمنين فقالت: يا عمر أما في رسول الله ما يعظ نساءه حتى تعظهن؟. فأمسكت فأنزل الله عز وجل \"عسى ربه إن طلقكن أن يبدله أزواجا خيرا منكن مسلمات مؤمنات قانتات تائبات عابدات سائحات ثيبات وأبكارا\" وهذه المرأة التي ردته عما كان فيه من وعظ النساء هي أم سلمة كما ثبت ذلك في صحيح البخاري وقال الطبراني ثنا إبراهيم بن نائلة الأصبهاني ثنا إسماعيل البجلي ثنا أبو عوانة عن أبي سنان عن الضحاك عن ابن عباس في قوله \"وإذ أسر النبي إلى بعض أزواجه حديثا\" قال دخلت حفصة على النبي صلى الله عليه وسلم في بيتها وهو يطأ مارية فقال لها رسول الله صلى الله عليه وسلم \"لا تخبري عائشة حتى أبشرك ببشارة إن أباك يلي الأمر من بعد أبي بكر إذا أنا مت\" فذهبت حفصة فأخبرت عائشة فقالت عائشة لرسول الله صلى الله عليه وسلم من أنبأك هذا؟ قال \"نبأني العليم الخبير\" فقالت عائشة لا أنظر إليك حتى تحرم مارية فحرمها فأنزل الله تعالى \"يا أيها النبي لم تحرم\" إسناده فيه نظر وقد تبين مما أوردناه تفسير هذه الآيات الكريمات ومعنى قوله \"مسلمات مؤمنات قانتات تائبات عابدات\" ظاهر وقوله تعالى \"سائحات\" أي صائمات قاله أبو هريرة وعائشة وابن عباس وعكرمة ومجاهد وسعيد بن جبير وعطاء ومحمد بن كعب القرظي وأبو عبدالرحمن السلمي وأبو مالك وإبراهيم النخعي والحسن وقتادة والضحاك والربيع بن أنس والسدي وغيرهم. وتقدم فيه حديث مرفوع عند قوله \"السائحون\" في سورة براءة ولفظه \"سياحة هذه الأمة الصيام\" وقال زيد بن أسلم وابنه عبدالرحمن \"سائحات\" أي مهاجرات وتلا عبدالرحمن \"السائحون\" أي المهاجرون والقول الأول أولى والله أعلم. وقوله تعالى \"ثيبات وأبكارا\" أي منهن ثيبات ومنهن أبكارا ليكون ذلك أشهى إلى النفس فإن التنوع يبسط النفس ولهذا قال \"ثيبات وأبكارا\" وقال أبو القاسم الطبراني في معجمه الكبير ثنا أبو بكر بن صدقة ثنا محمد بن محمد بن مرزوق ثنا عبدالله بن أبي أمية ثنا عبدالقدوس عن صالح بن حيان عن ابن بريدة عن أبيه \"ثيبات وأبكارا\" قال وعد الله نبيه صلى الله عليه وسلم في هذه الآية أن يزوجه فالثيب آسية امرأة فرعون وبالأبكار مريم بنت عمران. وذكر الحافظ ابن عساكر فى ترجمة مريم عليها السلام من طريق سويد بن سعيد ثنا محمد بن صالح بن عمر عن الضحاك ومجاهد عن ابن عمر قال: جاء جبريل إلى رسول الله صلى الله عليه وسلم فمرت خديجة فقال إن الله يقرئها السلام ويبشرها ببيت في الجنة من قصب بعيد من اللهب لا نصب فيه ولا صخب من لؤلؤة جوفاء بين بيت مريم بنت عمران وبيت آسية بنت مزاحم. ومن حديث أبي بكر الهذلي عن عكرمة عن ابن عباس أن النبي صلى الله عليه وسلم دخل على خديجة وهي في الموت فقال \"يا خديجة إذا لقيت ضرائرك فأقرئيهن مني السلام\" فقالت يا رسول الله وهل تزوجت قبلي؟ قال \"لا ولكن الله زوجني مريم بنت عمران وآسية امرأة فرعون وكلثم أخت موسى\" ضعيف أيضا وقال أبو يعلى ثنا إبراهيم بن عرعرة ثنا عبدالنور بن عبدالله ثنا يوسف بن شعيب عن أبي أمامة قال: قال رسول الله صلى الله عليه وسلم \"أعلمت أن الله زوجني في الجنة مريم بنت عمران وكلثم أخت موسى وآسية امرأة فرعون؟\" فقلت هنيئا لك يا رسول الله وهذا أيضا ضعيف وروى مرسلا عن ابن أبي داود."
    },
    {
      "ayah": 6,
      "surah": 66,
      "text": "قال سفيان الثوري عن منصور عن رجل عن علي رضي الله عنه في قوله تعالى \"قوا أنفسكم وأهليكم نارا\" يقول أدبوهم وعلموهم وقال علي بن أبي طلحة عن ابن عباس \"قوا أنفسكم وأهليكم نارا\" يقول اعملوا بطاعة الله واتقوا معاصي الله وأمروا أهليكم بالذكر ينجيكم الله من النار. وقال مجاهد \"قوا أنفسكم وأهليكم نارا\" قال اتقوا الله وأوصوا أهليكم بتقوى الله وقال قتادة تأمرهم بطاعة الله وتنهاهم عن معصية الله وأن تقوم عليهم بأمر الله وتأمرهم به وتساعدهم عليه فإذا رأيت لله معصية قذعتهم عنها وزجرتهم عنها وهكذا قال الضحاك ومقاتل حق المسلم أن يعلم أهله من قرابته وإمائه وعبيده ما فرض الله عليهم وما نهاهم الله عنه. وفي معنى هذه الآية الحديث الذي رواه أحمد وأبو داود والترمذي من حديث عبدالملك بن الربيع بن سبرة عن أبيه عن جده قال: قال رسول الله صلى الله عليه وسلم \"مروا الصبي بالصلاة إذا بلغ سبع سنين فإذا بلغ عشر سنين فاضربوه عليها\" هذا لفظ أبي داود وقال الترمذي هذا حديث حسن وروى أبو داود من حديث عمرو بن شعيب عن أبيه عن جده عن رسول الله صلى الله عليه وسلم مثل ذلك قال الفقهاء وهكذا في الصوم ليكون ذلك تمرينا له على العبادة لكي يبلغ وهو مستمر علي العبادة والطاعة ومجانبة المعاصي وترك المنكر والله الموفق. وقوله تعالى \"وقودها الناس والحجارة\" وقودها أي حطبها الذي يلقي فيه جثث بني آدم \"والحجارة\" قيل المراد بها الأصنام التي تعبد لقوله تعالى \"إنكم وما تعبدون من دون الله حصب جهنم\" وقال ابن مسعود ومجاهد وأبو جعفر الباقر والسدي هي حجارة من كبريت زاد مجاهد: أنتن من الجيفة وروى ذلك ابن أبي حاتم رحمه الله قال ثنا أبي ثنا عبدالرحمن بن سنان المنقري ثنا عبدالعزيز - يعني ابن أبي داود - قال بلغني أن رسول الله صلى الله عليه وسلم تلا هذه الآية \"يا أيها الذين آمنوا قوا أنفسكم وأهليكم نارا وقودها الناس والحجارة\" وعنده بعض أصحابه وفيهم شيخ فقال الشيخ يا رسول الله حجارة جهنم كحجارة الدنيا؟ فقال النبي صلي الله عليه وسلم \"والذي نفسي بيده لصخرة من صخر جهنم أعظم من جبال الدنيا كلها\" قال فوقع الشيخ مغشيا عليه فوضع النبي صلى الله عليه وسلم يده على فؤاده فإذا هو حي فناداه قال \"يا شيخ قل لا إله إلا الله\" فقالها فبشره بالجنة قال: فقال أصحابه يا رسول الله أمن بيننا؟ قال \"نعم يقول الله تعالى \"ذلك لمن خاف مقامي وخاف وعيد\" هذا حديث مرسل غريب وقوله تعالى \"عليها ملائكة غلاظ شداد\" أي طباعهم غليظة قد نزعت من قلوبهم الرحمة بالكافرين بالله \"شداد\" أي تركيبهم في غاية الشدة والكثافة والمنظر المزعج كما قال ابن أبي حاتم ثنا أبي ثنا سلمة بن شبيب ثنا إبراهيم بن الحكم بن أبان ثنا أبي عن عكرمة أنه قال إذا وصل أول أهل النار إلى النار وجدوا على الباب أربعمائة ألف من خزنة جهنم سود وجوههم كالحة أنيابهم قد نزع الله من قلوبهم الرحمة ليس في قلب واحد منهم مثقال ذرة من الرحمة لو طير الطير من منكب أحدهم لطار شهرين قبل أن يبلغ منكبه الآخر ثم يجدون على الباب التسعة عشر عرض صدر أحدهم سبعون خريفا ثم يهوون من باب إلى باب خمسمائة سنة ثم يجدون على كل باب منها مثل ما وجدوا على الباب الأول حتى ينتهوا إلى آخرها وقوله \"لا يعصون الله ما أمرهم ويفعلون ما يؤمرون\" أي مهما أمرهم به تعالى يبادروا إليه لا يتأخرون عنه طرفة عين وهم قادرون على فعله ليس بهم عجز عنه. وهؤلاء هم الزبانية - عياذا بالله منهم."
    },
    {
      "ayah": 7,
      "surah": 66,
      "text": "وقوله \"يا أيها الذين كفروا لا تعتذروا اليوم إنما تجزون ما كنتم تعملون\" أي يقال للكفرة يوم القيامة لا تعتذروا فإنه لا يقبل منكم ولا تجزون إلا ما كنتم تعلمون وإنما تجزون اليوم بأعمالكم."
    },
    {
      "ayah": 8,
      "surah": 66,
      "text": "ثم قال تعالى \"يا أيها الذين آمنوا توبوا إلى الله توبة نصوحا\" أي توبة صادقة جازمة تمحو ما قبلها من السيئات وتلم شعث التائب وتجمعه وتكفه عما كان يتعاطاه من الدناءات. قال ابن جرير ثنا ابن مثنى ثنا محمد ثنا شعبة عن سماك بن حرب سمعت النعمان بن بشير يخطب سمعت عمر بن الخطاب رضي الله عنه يقول \"يا أيها الذين آمنوا توبوا إلى الله توبة نصوحا\" قال يذنب الذنب ثم لا يرجع فيه وقال الثوري عن سماك عن النعمان عن عمر قال التوبة النصوح أن يتوب من الذنب ثم لا يعود فيه أو لا يريد أن يعود فيه وقال أبو الأحوص وغيره عن سماك عن النعمان سئل عمر عن التوبة النصوح فقال: أن يتوب الرجل من العمل السيء ثم لا يعود إليه أبدا. وقال الأعمش عن أبي إسحاق عن أبي الأحوص عن عبدالله \"توبة نصوحا\" قال يتوب ثم لا يعود. وقد روي هذا مرفوعا فقال الإمام أحمد ثنا علي بن عاصم عن إبراهيم الهجري عن أبي الأحوص عن عبدالله بن مسعود قال: قال رسول الله صلى الله عليه وسلم \"التوبة من الذنب أن يتوب منه ثم لا يعود فيه\" تفرد به أحمد من طريق إبراهيم بن مسلم الهجري وهو ضعيف والموقوف أصح والله أعلم. ولهذا قال العلماء: التوبة النصوح هو أن يقلع عن الذنب في الحاضر ويندم على ما سلف منه في الماضي ويعزم على أن لا يفعل في المستقبل ثم إن كان الحق لآدمي رده إليه بطريقه. قال الإمام أحمد ثنا سفيان عن عبدالكريم أخبرني زياد بن أبي مريم عن عبدالله بن مغفل قال دخلت مع أبي على عبدالله بن مسعود فقال أنت سمعت النبي صلى الله عليه وسلم يقول \"الندم توبة؟\" قال نعم وقال مرة نعم سمعته يقول \"الندم توبة\" ورواه ابن ماجه عن هشام بن عمار عن سفيان بن عيينة عن عبدالكريم وهو ابن مالك الجزري به وقال ابن أبي حاتم ثنا الحسن بن عرفة حدثني الوليد بن بكير أبو جناب عن عبدالله بن محمد العبدي عن أبي سنان البصري عن أبي قلابة عن زر بن حبيش عن أبي بن كعب قال: قيل لنا أشياء تكون في آخر هذه الأمة عند اقتراب الساعة. منها نكاح الرجل امرأته أو أمته في دبرها وذلك مما حرم الله ورسوله ويمقت الله عليه ورسوله ومنها نكاح الرجل الرجل وذلك مما حرم الله ورسوله ويمقت الله عليه ورسوله ومنها نكاح المرأة المرأة وذلك مما حرم الله ورسوله ويمقت الله عليه ورسوله وليس لهؤلاء صلاة ما أقاموا على هذا حتى يتوبوا إلى الله توبة نصوحا قال زر: فقلت لأبي بن كعب فما التوبة النصوح؟ فقال سألت رسول الله صلى الله عليه وسلم عن ذلك فقال \"هو الندم على الذنب حين يفرط منك فتستغفر الله بندامتك منه عند الحاضر ثم لا تعود إليه أبدا\". وقال ابن أبي حاتم ثنا أبي ثنا عمرو بن علي ثنا عباد بن عمرو ثنا أبو عمرو بن العلاء سمعت الحسن يقول: التوبة النصوح أن تبغض الذنب كما أحببته وتستغفر منه إذا ذكرته فأما إذا جزم بالتوبة وصمم عليها فإنها تجب ما قبلها من الخطيئات كما ثبت في الصحيح: \"الإسلام يجب ما قبله والتوبة تجب ما قبلها\". وهل من شرط التوبة النصوح الاستمرار على ذلك إلى الممات - كما تقدم في الحديث وفي الأثر- ثم لا يعود فيه أبدا. أو يكفي العزم على أن لا يعود فى تكفير الماضي بحيث لو وقع منه ذلك الذنب بعد ذلك لا يكون ذلك ضارا في تكفير ما تقدم لعموم قوله عليه السلام: \"التوبة تجب ما قبلها\"؟ وللأول أن يحتج بما ثبت في الصحيح أيضا \"من أحسن في الإسلام لم يؤاخذ بما عمل في الجاهلية ومن أساء في الإسلام اخذ بالأول والآخر\" فإذا كان هذا في الإسلام الذي هو أقوى من التوبة فالتوبة بطريق الأولى والله أعلم. وقوله تعالى \"عسى ربكم أن يكفر عنكم سيئاتكم ويدخلكم جنات تجري من تحتها الأنهار\" وعسى من الله موجبة \"يوم لا يخزي الله النبي والذين آمنوا معه\" أي ولا يخزيهم معه يعني يوم القيامة \"نورهم يسعى بين أيديهم وبأيمانهم\" كما تقدم في سورة الحديد \"يقولون ربنا أتمم لنا نورنا واغفر لنا إنك على كل شيء قدير\" قال مجاهد والضحاك والحسن البصري وغيرهم هذا يقوله المؤمنون حين يرون يوم القيامة نور المنافقين قد طفئ. وقال الإمام أحمد حدثنا إبراهيم بن إسحاق الطالقاني حدثنا ابن المبارك عن يحيى بن حسان عن رجل من بني كنانة قال: صليت خلف رسول الله صلى الله عليه وسلم عام الفتح فسمتعه يقول \"اللهم لا تخزني يوم القيامة\" وقال محمد بن نصر المروزي حدثنا محمد بن مقاتل المروزي حدثنا ابن المبارك أنا ابن لهيعة حدثني يزيد بن حبيب عن عبد الرحمن بن جبير بن نفير أنه سمع أبا ذر وأبا الدرداء قالا: قال رسول الله صلى الله عليه وسلم \"أنا أول من يؤذن له في السجود يوم القيامة وأول من يؤذن له برفع رأسه فأنظر بين يدي فأعرف أمتي من بين الأمم وأنظر عن يميني فأعرف أمتي من بين الأمم وأنظر عن شمالي فأعرف أمتي من بين الأمم\" فقال رجل يا رسول الله وكيف تعرف أمتك من بين الأمم؟ قال \"غر محجلون من آثار الطهور ولا يكون أحد من الأمم كذلك غيرهم وأعرفهم يؤتون كتبهم بأيمانهم وأعرفهم بسيماهم فى وجوههم من أثر السجود وأعرفهم بنورهم يسعى بين أيديهم\"."
    },
    {
      "ayah": 9,
      "surah": 66,
      "text": "يقول تعالى آمرا رسوله صلى الله عليه وسلم بجهاد الكفار والمنافقين هؤلاء بالسلاح والقتال وهؤلاء بإقامة الحدود عليهم \"واغلظ عليهم\" أي في الدنيا \"ومأواهم جهنم وبئس المصير\" أى في الآخرة."
    }
  ]
}
