{
  "ayahs": [
    {
      "ayah": 1,
      "surah": 67,
      "text": "سورة الملك: قال الإمام أحمد حدثنا حجاج بن محمد وابن جعفر قالا حدثنا شعبة عن قتادة عن عياش الجشمي عن أبي هريرة عن رسول الله صلى الله عليه وسلم قال \"إن سورة في القرآن ثلاثين آية شفعت لصاحبها حتى غفر له: تبارك الذي بيده الملك\" ورواه أهل السنن الأربعة من حديث شعبة به وقال الترمذي هذا حديث حسن وقد روى الحافظ ابن عساكر في تاريخه في ترجمة أحمد بن نصر بن زياد أبي عبدالله القرشي النيسابوري المقري الزاهد الفقيه أحد الثقات الذين روى عنهم البخاري ومسلم ولكن في غير الصحيحين وروى عنه الترمذي وابن ماجه وابن خزيمة وعليه تفقه في مذهب أبي عبيد بن حربوية وخلق سواهم ساق بسنده من حديثه عن فرات بن السائب عن الزهري عن أنس بن مالك قال: قال رسول الله صلى الله عليه وسلم \"إن رجلا ممن كان قبلكم مات وليس معه شيء من كتاب الله إلا تبارك فلما وضع في حفرته أتاه الملك فثارت السورة في وجهه فقال لها إنك من كتاب الله وأنا أكره مساءتك وإني لا أملك لك ولا له ولا لنفسي ضرا ولا نفعا فإن أردت هذا به فانطلقي إلى الرب تبارك وتعالى فاشفعي له فتنطلق إلى الرب فتقول يا رب إن فلانا عمد إلي من بين كتابك فتعلمني وتلاني أفتحرقه أنت بالنار وتعذبه وأنا في جوفه؟ فإن كنت فاعلا ذاك به فامحني من كتابك فيقول ألا أراك غضبت؟ فتقول وحق لي أن أغضب فيقول اذهبي فقد وهبته لك وشفعتك فيه - قال - فتجيء فتزجر الملك فيخرج خاسف البال لم يحل منه بشيء - قال - فتجيء فتضع فاها على فيه فتقول مرحبا بهذا الفم فربما تلاني ومرحبا بهذا الصدر فربما وعاني ومرحبا بهاتين القدمين فربما قامتا بي وتؤنسه في قبره مخافة الوحشة عليه\" قال فلما حدث بهذا رسول الله صلى الله عليه وسلم لم يبق صغير ولا كبير ولا حر ولا عبد إلا تعلمها وسماها رسول الله صلى الله عليه وسلم المنجية. \"قلت\" وهذا حديث منكر جدا وفرات بن السائب هذا ضعفه الإمام أحمد ويحيى بن معين والبخاري وأبو حاتم والدارقطني وغير واحد وقد ذكره ابن عساكر من وجه آخر عن الزهري من قوله مختصرا وروى البيهقي في كتاب إثبات عذاب القبر عن ابن مسعود موقوفا ومرفوعا ما يشهد لهذا وقد كتبناه في كتاب الجنائز \"من الأحكام الكبرى\" ولله الحمد والمنة وقد روى الطبراني والحافظ الضياء المقدسي من طريق سلام بن مسكين عن ثابت عن أنس قال: قال رسول الله صلى الله عليه وسلم \"سورة في القرآن خاصمت عن صاحبها حتى أدخلته الجنة: تبارك الذي بيده الملك\" وقال الترمذي حدثنا محمد بن عبدالملك بن أبي الشوارب حدثنا يحيى بن عمرو بن مالك النكري عن أبيه عن أبي الجوزاء عن ابن عباس قال: ضرب بعض أصحاب النبي صلى الله عليه وسلم خباءه على قبر وهو لا يحسب أنه قبر فإذا قبر إنسان يقرأ سورة الملك حتى ختمها فأتى النبي صلى الله عليه وسلم فقال يا رسول الله ضربت خبائي على قبر وأنا لا أحسب أنه قبر فإذا إنسان يقرأ سورة الملك: تبارك حتى ختمها فقال رسول الله صلى الله عليه وسلم \"هي المانعة هى المنجية تنجيه من عذاب القبر\" ثم قال هذا حديث غريب من هذا الوجه وفي الباب عن أبي هريرة ثم روى الترمذي أيضا من طريق ليث بن أبي سليم عن أبي الزبير عن جابر أن رسول الله صلى الله عليه وسلم كان لا ينام حتى يقرأ الم تنزيل وتبارك الذي بيده الملك وقال ليث عن طاوس يفضلان كل سورة في القرآن بسبعين حسنة. وقال الطبراني حدثنا محمد بن الحسن بن عجلان الأصبهاني حدثنا سلمة بن شبيب حدثنا إبراهيم بن الحكم بن أبان عن أبيه عن عكرمة عن ابن عباس قال: قال رسول الله صلى الله عليه وسلم \"لوددت أنها في قلب كل إنسان من أمتي\" يعني تبارك الذي بيده الملك هذا حديث غريب وإبراهيم ضعيف وقد تقدم مثله في سورة يس وقد روى هذا الحديث عبد بن حميد في مسنده بأبسط من هذا فقال حدثنا إبراهيم بن الحكم عن أبيه عن عكرمة عن ابن عباس أنه قال لرجل ألا أتحفك بحديث تفرح به؟ قال بلى قال اقرأ تبارك الذي بيده الملك وعلمها أهلك وجميع ولدك وصبيان بيتك وجيرانك فإنها المنجية والمجادلة تجادل أو تخاصم يوم القيامة عند ربها لقارئها وتطلب له أن ينجيه من عذاب النار وينجي بها صاحبها من عذاب القبر قال رسول الله صلى الله عليه وسلم \"لوددت أنها في قلب كل إنسان من أمتي\". يمجد تعالى نفسه الكريمة ويخبر أنه بيده الملك أي هو المتصرف في جميع المخلوقات بما يشاء لا معقب لحكمه ولا يسأل عما يفعل لقهره وحكمته وعدله ولهذا قال تعالى \"وهو على كل شيء قدير\"."
    },
    {
      "ayah": 10,
      "surah": 67,
      "text": "فقالوا \"لو كنا نسمع أو نعقل ما كنا في أصحاب السعير\" أي لو كانت لنا عقول ننتفع بها أو نسمع ما أنزله الله من الحق لما كنا على ما كنا عليه من الكفر بالله والاغترار به ولكن لم يكن لنا فهم نعي به ما جاءت به الرسل ولا كان لنا عقل يرشدنا إلى اتباعهم."
    },
    {
      "ayah": 11,
      "surah": 67,
      "text": "قال الله تعالى \"فاعترفوا بذنبهم فسحقا لأصحاب السعير\". قال الإمام أحمد حدثنا محمد بن جعفر حدثنا شعبة عن عمرو بن مرة عن أبي البحتري الطائي قال أخبرني من سمعه من رسول الله صلى الله عليه وسلم أنه قال \"لن يهلك الناس حتى يعذروا من أنفسهم\" وفي حديث آخر \"لا يدخل أحد النار إلا وهو يعلم أن النار أولى به من الجنة\"."
    },
    {
      "ayah": 12,
      "surah": 67,
      "text": "يقول تعالى مخبرا عمن يخاف مقام ربه فيما بينه وبينه إذا كان غائبا عن الناس فينكف عن المعاصي ويقوم بالطاعات حيث لا يراه أحد إلا الله تعالى بأنه له مغفرة وأجر كبير أي تكفر عنه ذنوبه ويجازى بالثواب الجزيل كما ثبت في الصحيحين \"سبعة يظلهم الله تعالى في ظل عرشه يوم لا ظل إلا ظله\" فذكر منهم رجلا دعته امرأة ذات منصب وجمال فقال إني أخاف الله ورجلا تصدق بصدقة فأخفاها حتى لا تعلم شماله ما تنفق يمينه. وقال الحافظ أبو بكر البزار في مسنده حدثنا طالوت بن عباد حدثنا الحارث بن عبيد عن ثابت عن أنس قال: قالوا يا رسول الله إنا نكون عندك على حال فإذا فارقناك كنا على غيره قال \"كيف أنتم وربكم؟\" قالوا الله ربنا في السر والعلانية قال \"ليس ذلكم النفاق\" لم يروه عن ثابت إلا الحارث بن عبيد فيما نعلمه."
    },
    {
      "ayah": 13,
      "surah": 67,
      "text": "ثم قال تعالى منبها على أنه مطلع على الضمائر والسرائر \"وأسروا قولكم أو اجهروا به إنه عليم بذات الصدور\" أي بما يخطر في القلوب."
    },
    {
      "ayah": 14,
      "surah": 67,
      "text": "\"ألا يعلم من خلق\" أي ألا يعلم الخالق؟ وقيل معناه ألا يعلم الله مخلوقه؟ والأول أولى لقوله \"وهو اللطيف الخبير\". ثم ذكر نعمته على خلقه في تسخيره لهم الأرض وتذليله إياها لهم بأن جعلها قارة ساكنة لا تميد ولا تضطرب بما جعل فيها من الجبال وأنبع فيها من العيون وسلك فيها من السبل وهيأ فيها من المنافع ومواضع الزروع والثمار."
    },
    {
      "ayah": 15,
      "surah": 67,
      "text": "قال تعالى \"هو الذي جعل لكم الأرض ذلولا فامشوا في مناكبها\" أي فسافروا حيث شئتم من أقطارها وترددوا في أقاليمها وأرجائها في أنواع المكاسب والتجارات واعلموا أن سعيكم لا يجدي عليكم شيئا إلا أن ييسره الله لكم ولهذا قال تعالى \"وكلوا من رزقه\" فالسعي في السبب لا ينافي التوكل كما قال الإمام أحمد حدثنا أبو عبدالرحمن حدثنا حيوة أخبرني بكر بن عمرو أنه سمع عبدالله بن هبيرة يقول إنه سمع أبا سهم الحبشاني يقول إنه سمع عمر بن الخطاب يقول إنه سمع رسول الله صلى الله عليه وسلم يقول \"لو أنكم تتوكلون على الله حق توكله لرزقكم كما يرزق الطير تغدو خماصا وتروح بطانا\" رواه الترمذي والنسائي وابن ماجه من حديث ابن هبيرة وقال الترمذي حسن صحيح فأثبت لها رواحا وغدوا لطلب الرزق مع توكلها على الله عز وجل وهو المسخر المسير المسبب \"وإليه النشور\" أي المرجع يوم القيامة قال ابن عباس ومجاهد والسدي وقتادة: مناكبها أطرافها وفجاجها ونواحيها وقال ابن عباس وقتادة أيضا مناكبها الجبال وقال ابن أبي حاتم حدثنا أبي حدثنا عمرو بن حكام الأزدي حدثنا شعبة عن قتادة عن يونس بن جبير عن بشير بن كعب أنه قرأ هذه الآية \"فامشوا في مناكبها\" فقال لأم ولد له: إن علمت ما مناكبها فأنت عتيقة فقالت هي الجبال فسأل أبا الدرداء فقال هي الجبال."
    },
    {
      "ayah": 16,
      "surah": 67,
      "text": "وهذا أيضا من لطفه ورحمته بخلقه أنه قادر على تعذيبهم بسبب كفر بعضهم به و عبادتهم معه غيره وهو مع هذا يحلم ويصفح ويؤجل ولا يعجل كما قال تعالى \"ولو يؤاخذ الله الناس بما كسبوا ما ترك على ظهرها من دابة ولكن يؤخرهم إلى أجل مسمى فإذا جاء أجلهم فإن الله كان بعباده بصيرا\" وقال ههنا \"أأمنتم من في السماء أن يخسف بكم الأرض فإذا هي تمور\" أي تذهب وتجيء وتضطرب."
    },
    {
      "ayah": 17,
      "surah": 67,
      "text": "\"أم أمنتم من في السماء أن يرسل عليكم حاصبا\" أي ريحا فيها حصباء تدمغكم كما قال تعالى \"أفأمنتم أن يخسف بكم جانب البر أو يرسل عليكم حاصبا ثم لا تجدوا لكم وكيلا\" وهكذا توعدهم ههنا بقوله \"فستعلمون كيف نذير\" أي كيف يكون إنذاري وعاقبة من تخلف عنه وكذب به."
    },
    {
      "ayah": 18,
      "surah": 67,
      "text": "ثم قال تعالى \"ولقد كذب الذين من قبلهم\" أي من الأمم السالفة والقرون الخالية \"فكيف كان نكير\" أي فكيف كان إنكاري عليهم ومعاقبتي لهم؟ أي عظيما شديدا أليما."
    },
    {
      "ayah": 19,
      "surah": 67,
      "text": "ثم قال تعالى \"أولم يروا إلى الطير فوقهم صافات ويقبضن\" أي تارة يصففن أجنحتهن في الهواء وتارة تجمع جناحا وتنشر جناحا \"ما يمسكهن\" أي في الجو \"إلا الرحمن\" أي بما سخر لهن من الهواء من رحمته ولطفه \"إنه بكل شيء بصير\" أي بما يصلح كل شيء من مخلوقاته وهذه كقوله تعالى \"أو لم يروا إلى الطير مسخرات في جو السماء ما يمسكهن إلا الله إن في ذلك لآيات لقوم يؤمنون\"."
    },
    {
      "ayah": 2,
      "surah": 67,
      "text": "قال تعالى \"الذي خلق الموت والحياة\" واستدل بهذه الآية من قال إن الموت أمر وجودي لأنه مخلوق ومعنى الآية أنه أوجد الخلائق من العدم \"ليبلوهم\" أي يختبرهم \"أيهم أحسن عملا\" كما قال تعالى \"كيف تكفرون بالله وكنتم أمواتا فأحياكم\" فسمى الحال الأول وهو العدم موتا وسمى هذه النشأة حياة ولهذا قال تعالى \"ثم يميتكم ثم يحييكم\" وقال ابن أبي حاتم حدثنا أبو زرعة حدثنا صفوان حدثنا الوليد حدثنا خليد عن قتادة في قوله تعالى \"الذي خلق الموت والحياة\" قال كان رسول الله صلى الله عليه وسلم يقول: \"إن الله أذل بني آدم بالموت وجعل الدنيا دار حياة ثم دار موت وجعل الآخرة دار جزاء ثم دار بقاء\".. ورواه معمر عن قتادة وقوله تعالى \"ليبلوكم أيكم أحسن عملا\" أي خير عملا كما قال محمد بن عجلان ولم يقل أكثر عملا ثم قال تعالى \"وهو العزيز الغفور\" أي هو العزيز العظيم المنيع الجناب وهو مع ذلك غفور لمن تاب إليه وأناب بعدما عصاه وخالف أمره وإن كان تعالى عزيزا هو مع ذلك يغفر ويرحم ويصفح ويتجاوز."
    },
    {
      "ayah": 20,
      "surah": 67,
      "text": "يقول تعالى للمشركين الذين عبدوا معه غيره يبتغون عندهم نصرا ورزقا منكرا عليهم فيما اعتقدوه ومخبرا لهم أنه لا يحصل لهم ما أملوه فقال تعالى \"أمن هذا الذي هو جند لكم ينصركم من دون الرحمن\" أي ليس لكم من دونه من ولي ولا واق ولا ناصر لكم غيره ولهذا قال تعالى \"إن الكافرون إلا في غرور\"."
    },
    {
      "ayah": 21,
      "surah": 67,
      "text": "ثم قال تعالى \"أمن هذا الذي يرزقكم إن أمسك رزقه\" أي من هذا الذي إذا قطع الله عنكم رزقه يرزقكم بعده؟ أي لا أحد يعطي ويمنع ويخلق ويرزق وينصر إلا الله عز وجل وحده لا شريك له أي وهم يعلمون ذلك ومع هذا يعبدون غيره ولهذا قال تعالى \" بل لجوا\" أي استمروا في طغيانهم وإفكهم وضلالهم \"في عتو ونفور\" أي في معاندة واستكبار ونفور على إدبارهم عن الحق لا يسمعون له ولا يتبعونه."
    },
    {
      "ayah": 22,
      "surah": 67,
      "text": "وهذا مثل ضربه الله للمؤمن والكافر فالكافر مثله فيما هو فيه كمثل من يمشي منكبا على وجهه أي يمشي منحنيا لا مستويا على وجهه أي لا يدري أين يسلك ولا كيف يذهب بل تائه حائر ضال أهذا أهدى \"أمن يمشي سويا\" أي منتصب القامة \"على صراط مستقيم\" أي على طريق واضح بين وهو في نفسه مستقيم وطريقه مستقيمة؟ هذا مثلهم في الدنيا وكذلك يكونون في الآخرة فالمؤمن يحشر يمشي سويا على صراط مستقيم مفض به إلى الجنة الفيحاء وأما الكافر فإنه يحشر يمشي على وجهه إلى نار جهنم \"احشروا الذين ظلموا وأزواجهم وما كانوا يعبدون من دون الله فاهدوهم إلى صراط الجحيم\" الآيات أزواجهم أشباههم. قال الإمام أحمد رحمه الله حدثنا ابن نمير حدثنا إسماعيل عن نفيع قال سمعت أنس بن مالك يقول قيل يا رسول الله كيف يحشر الناس على وجوههم؟ فقال \"أليس الذي أمشاهم على أرجلهم قادر على أن يمشيهم على وجوههم؟\" وهذا الحديث مخرج في الصحيحين من طريق."
    },
    {
      "ayah": 23,
      "surah": 67,
      "text": "وقوله تعالى \"قل هو الذي أنشأكم\" أي ابتدأ خلقكم بعد أن لم تكونوا شيئا مذكورا \"وجعل لكم السمع والأبصار والأفئدة\" أي العقول والإدراك \"قليلا ما تشكرون\" أي قلما تستعملون هذه القوى التي أنعم الله بها عليكم في طاعته وامتثال أوامره وترك زواجره."
    },
    {
      "ayah": 24,
      "surah": 67,
      "text": "\"قل هو الذي ذرأكم في الأرض\" أي بثكم ونشركم في أقطار الأرض وأرجائها مع اختلاف ألسنتكم في لغاتكم وألوانكم وحلاكم وأشكالكم وصوركم \"وإليه تحشرون\" أي تجمعون بعد هذا التفرق والشتات يجمعكم كما فرقكم ويعيدكم كما بدأكم. ثم قال تعالى مخبرا عن الكفار المنكرين للمعاد المستبعدين وقوعه."
    },
    { "ayah": 25, "surah": 67, "text": "أي متى يقع هذا الذي تخبرنا بكونه من الاجتماع بعد هذا التفرق." },
    {
      "ayah": 26,
      "surah": 67,
      "text": "\"قل إنما العلم عند الله\" أي لا يعلم وقت ذلك على التعيين إلا الله عز وجل لكنه أمرني أن أخبركم أن هذا كائن وواقع لا محالة فاحذروه \"وإنما أنا نذير مبين\" أي وإنما علي البلاغ وقد أديته إليكم."
    },
    {
      "ayah": 27,
      "surah": 67,
      "text": "قال الله تعالى \"فلما رأوه زلفة سيئت وجوه الذين كفروا\" أي لما قامت القيامة وشاهدها الكفار ورأوا أن الأمر كان قريبا لأن كل ما هو آت آت وإن طال زمنه فلما وقع ما كذبوا به ساءهم ذلك لما يعلمون ما لهم هناك من الشر أي فأحاط بهم ذلك وجاءهم من أمر الله ما لم يكن لهم في بال ولا حساب \"وبدا لهم من الله ما لم يكونوا يحتسبون وبدا لهم سيئات ما عملوا وحاق بهم ما كانوا به يستهزئون\" ولهذا يقال لهم على وجه التقريع والتوبيخ \"هذا الذي كنتم به تدعون\" أي تستعجلون."
    },
    {
      "ayah": 28,
      "surah": 67,
      "text": "يقول تعالى \"قل\" يا محمد لهؤلاء المشركين بالله الجاحدين لنعمه \"أرأيتم إن أهلكني الله ومن معي أو رحمنا فمن يجير الكافرين من عذاب أليم\" أي خلصوا أنفسكم فإنه لا منقذ لكم من الله إلا التوبة والإنابة والرجوع إلى دينه ولا ينفعكم وقوع ما تتمنون لنا من العذاب والنكال فسواء عذبنا الله أو رحمنا فلا مناص لكم من نكاله وعذابه الأليم الواقع بكم."
    },
    {
      "ayah": 29,
      "surah": 67,
      "text": "ثم قال تعالى \"قل هو الرحمن آمنا به وعليه توكلنا\" أي آمنا برب العالمين الرحمن الرحيم وعليه توكلنا في جميع أمورنا كما قال تعالى \"فاعبده وتوكل عليه\" ولهذا قال تعالى \"فستعلمون من هو في ضلال مبين\" أي منا ومنكم ولمن تكون العاقبة في الدنيا والآخرة."
    },
    {
      "ayah": 3,
      "surah": 67,
      "text": "ثم قال تعالى \"الذي خلق سبع سماوات طباقا\" أي طبقة بعد طبقة وهل هن متواصلات بمعنى أنهن علويات بعضهم على بعض أو متفاصلات بينهن خلاء؟ فيه قولان أصحهما الثاني كما دل ذلك حديث الإسراء وغيره وقوله تعالى \"ما ترى في خلق الرحمن من تفاوت\" أي بل هو مصطحب مستو ليس فيه اختلاف ولا تنافر ولا مخافة ولا نقص ولا عيب ولا خلل ولهذا قال تعالى \"فارجع البصر هل ترى من فطور\" أي انظر إلى السماء هل ترى فيها عيبا أو نقصا أو خللا أو فطورا قال ابن عباس ومجاهد والضحاك والثوري وغيرهم في قوله تعالى \"فارجع البصر هل ترى من فطور\" أي شقوق وعن السدي \"هل ترى من فطور\" أي من خروق وقال ابن عباس في رواية \"من فطور\" أي من وهاء وقال قتادة \"هل ترى من فطور\" أي هل ترى خللا يا ابن آدم؟."
    },
    {
      "ayah": 30,
      "surah": 67,
      "text": "ثم قال تعالى إظهارا للرحمة في خلقه \"قل أرأيتم إن أصبح ماؤكم غورا\" أي ذاهبا في الأرض إلى أسفل فلا ينال بالفؤوس الحداد ولا السواعد الشداد والغائر عكس النابع ولهذا قال تعالى \"فمن يأتيكم بماء معين\" أي نابع سائح جار على وجه الأرض أي لا يقدر على ذلك إلا الله عز وجل فمن فضله وكرمه أن أنبع لكم المياه وأجراها في سائر أقطار الأرض بحسب ما يحتاج العباد إليه من القلة والكثرة فلله الحمد والمنة آخر تفسير سورة الملك ولله الحمد."
    },
    {
      "ayah": 4,
      "surah": 67,
      "text": "وقوله تعالى \"ثم ارجع البصر كرتين\" قال قتاده مرتين \"ينقلب إليك البصر خاسئا\" قال ابن عباس ذليلا وقال مجاهد وقتادة صاغرا \"وهو حسير\" قال ابن عباس يعني وهو كليل وقال مجاهد وقتادة والسدي: الحسير المنقطع من الأعياء ومعنى الآية إنك لو كررت البصر مهما كررت لانقلب إليك أي لرجع إليك البصر \"خاسئا\" عن أن يرى عيبا أو خللا \"وهو حسير\" أي كليل قد انقطع من الإعياء من كثرة التكرر ولا يرى نقصا."
    },
    {
      "ayah": 5,
      "surah": 67,
      "text": "ولما نفى عنها في خلقها النقص بين كمالها وزينتها فقال \"ولقد زينا السماء الدنيا بمصابيح\" وهي الكواكب التي وضعت فيها من السيارات والثوابت وقوله تعالى \"وجعلناها رجوما للشياطين\" عاد الضمير في قوله وجعلناها على جنس المصابيح لا على عينها لأنه لا يرمي بالكواكب التي في السماء بل بشهب من دونها وقد تكون مستمدة منها والله أعلم وقوله تعالى \"وأعتدنا لهم عذاب السعير\" أي جعلنا للشياطين هذا الخزي في الدنيا وأعتدنا لهم عذاب السعير في الأخرى كما قال تعالى في أول الصافات \"إنا زينا السماء الدنيا بزينة الكواكب وحفظا من كل شيطان مارد لا يسمعون إلى الملأ الأعلى ويقذفون من كل جانب دحورا ولهم عذاب واصب إلا من خطف الخطفة فأتبعه شهاب ثاقب\" قال قتادة إنما خلقت هذه النجوم لثلاث خصال خلقها الله زينة للسماء ورجوما للشياطين وعلامات يهتدى بها فمن تأول فيها غير ذلك فقد قال برأيه وأخطأ حظه وأضاع نصيبه وتكلف ما لا علم له به رواه ابن جرير وابن أبي حاتم."
    },
    {
      "ayah": 6,
      "surah": 67,
      "text": "يقول تعالى \"و\" أعتدنا \"للذين كفروا بربهم عذاب جهنم وبئس المصير\" أي بئس المال والمنقلب."
    },
    {
      "ayah": 7,
      "surah": 67,
      "text": "\"إذا ألقوا فيها سمعوا لها شهيقا\" قال ابن جرير يعني الصياح \"وهي تفور\" قال الثوري تغلي بهم كما يغلي الحب القليل في الماء الكثير."
    },
    {
      "ayah": 8,
      "surah": 67,
      "text": "وقوله تعالى \"تكاد تميز من الغيظ\" أي يكاد ينفصل بعضها من بعض من شدة غيظها عليهم وحنقها بهم \"كلما ألقي فيها فوج سألهم خزنتها ألم يأتكم نذير\"."
    },
    {
      "ayah": 9,
      "surah": 67,
      "text": "يذكر تعالى عدله في خلقه وأنه لا يعذب أحدا إلا بعد قيام الحجة عليه وإرسال الرسول إليه كما قال تعالى \"وما كنا معذبين حتى نبعث رسولا\" وقال تعالى \"حتى إذا جاءوها فتحت أبوابها وقال لهم خزنتها ألم يأتكم رسل منكم يتلون عليكم آيات ربكم وينذرونكم لقاء يومكم هذا قالوا بلى ولكن حقت كلمة العذاب على الكافرين\" وهكذا عادوا على أنفسهم بالملامة وندموا حيث لا تنفعهم الندامة."
    }
  ]
}
