{
  "ayahs": [
    {
      "ayah": 1,
      "surah": 68,
      "text": "قد تقدم الكلام على حروف الهجاء في أول سورة البقرة وأن قوله تعالى \"ن\" كقوله \"ص - ق\" ونحو ذلك من الحروف المقطعة في أوائل السور وتحرير القول في ذلك بما أغنى عن إعادته ههنا وقيل المراد بقوله \"ن\" حوت عظيم على تيار الماء العظيم المحيط وهو حامل للأرضين السبع كما قال الإمام أبو جعفر بن جرير حدثنا ابن بشار حدثنا يحيى حدثنا سفيان هو الثوري حدثنا سليمان هو الأعمش عن أبي ظبيان عن ابن عباس قال: أول ما خلق الله القلم قال اكتب قال وماذا اكتب؟ قال اكتب القدر فجرى بما يكون من ذلك اليوم إلى قيام الساعة ثم خلق النون ورفع بخار الماء ففتقت منه السماء وبسطت الأرض على ظهر النون فاضطرب النون فمادت الأرض فأثبتت بالجبال فإنها لتفخر على الأرض وكذا رواه ابن أبي حاتم من أحمد بن سنان عن أبي معاوية عن الأعمش به وهكذا رواه شعبة ومحمد بن فضيل ووكيع عن الأعمش به وزاد شعبة في روايته ثم قرأ \"ن والقلم وما يسطرون\" ووقد رواه شريك عن الأعمش عن أبي ظبيان أو مجاهد عن ابن عباس فذكر نحوه ورواه معمر عن الأمش أن ابن عباس قال فذكره ثم قرأ \"ن والقلم وما يسطرون\" ثم قال ابن جرير حدثنا ابن حميد حدثنا جرير عن عطاء عن أبي الضحى عن ابن عباس قال: إن أول شيء خلق ربي عز وجل القلم ثم قال له اكتب فكتب ما هو كائن إلى أن تقوم الساعة ثم خلق النون فوق الماء ثم كبس الأرض عليه. وقد روى الطبراني ذلك مرفوعا فقال حدثنا أبو حبيب زيد بن المهدي المروزي حدثنا سعيد بن يعقوب الطالقاني حدثنا مؤمل بن إسماعيل حدثنا حماد بن زيد عن عطاء بن السائب عن أبي الضحى مسلم بن صبيح عن ابن عباس قال: قال رسول الله صلى الله عليه وآله وسلم \"إن أول ما خلق الله القلم والحوت قال للقلم اكتب قال ما أكتب؟ قال كل شيء كائن إلى يوم القيامة\" ثم قرأ \"ن والقلم وما يسطرون\" فالنون الحوت والقلم القلم \"حديث آخر\" في ذلك رواه ابن عساكر عن أبي عبدالله مولى بني أمية عن أبي صالح عن أبي هريرة سمعت رسول الله صلى الله عليه وسلم يقول \" إن أول شيء خلقه الله القلم ثم خلق النون وهي الدواة ثم قال له اكتب قال وما أكتب؟ قال اكتب ما يكون - أو - ما هو كان من عمل أو رزق أو أثر أو أجل فكتب ذلك إلى يوم القيامة فذلك قوله \"ن والقلم وما يسطرون\" ثم ختم على القلم فلم يتكلم إلى يوم القيامة ثم خلق العقل وقال وعزتي لأكملنك فيمن أحببت ولأنقصنك ممن أبغضت. وقال ابن أبي نجيح أن إبراهيم بن أبي بكر أخبره عن مجاهد قال: كان يقال النون الحوت العظيم الذي تحت الأرض السابعة وقد ذكر البغوي رحمه الله وجماعة من المفسرين أن على ظهر هذا الحوت صخرة سمكها كغلظ السموات والأرض وعلى ظهرها ثور له أربعون ألف قرن وعلى متنه الأرضون السبع وما فيهن وما بينهن والله أعلم ومن العجيب أن بعضهم حمل على هذا المعنى الحديث الذي رواه الإمام أحمد حدثنا إسماعيل حدثنا حميد عن أنس أن عبدالله بن سلام بلغه مقدم رسول الله صلى الله عليه وسلم المدينة فأتاه فسأله عن أشياء قال إني سائلك عن أشياء لا يعلمها إلا نبي قال ما أول أشراط الساعة؟ وما أول طعام يأكله أهل الجنة؟ وما بال الولد ينزع إلى أبيه؟ وما بال الوله ينزع إلى أمه؟ قال \"أخبرني بهن جبريل آنفا\" قال ابن سلام فذاك عدو اليهود من الملائكة قال \"أما أول أشراط الساعة فنار تحشرهم من المشرق إلى المغرب وأول طعام يأكله أهل الجنة زيادة كبد الحوت وأما الولد فإذا سبق ماء الرجل ماء المرأة نزع الولد وإذا سبق ماء المرأة ماء الرجل نزعت\" ورواه البخاري من طرق عن حميد ورواه مسلم أيضا وله من حديث ثوبان مولى رسول الله صلى الله عليه وسلم نحو هذا. وفي صحيح مسلم من حديث أبي أسماء الرحبي عن ثوبان أن حبرا سأل رسول الله صلى الله عليه وسلم عن مسائل فكان منها أن قال فما تحفتهم يعني أهل الجنة حين يدخلون الجنة قال \"زيادة كبد الحوت\" فال فما غذاؤهم على أثرها قال \"ينحر لهم ثور الجنة الذي كان يأكل من أطرافها\" قال فما شرابهم عليه؟ قال \"من عين فيها تسمى سلسبيلا\" وقيل المراد بقوله \"ن\" لوح من نور. قال ابن جرير حدثنا الحسن بن شبيب المكتب حدثنا محمد بن زياد الجزري عن فرات بن أبي الفرات عن معاوية بن قرة عن أبيه قال: قال رسول الله صلى الله عليه وسلم \"ن والقلم وما يسطرون\" لوج من نور وقلم من نور يجري بما هو كائن إلى يوم القيامة\" وهذا مرسل غريب وقال ابن جريج أخبرت أن ذلك القلم من نور طوله مائة عام وقيل المراد بقوله \"ن\" دواة والقلم قال ابن جرير حدثنا عبد الأعلى حدثنا أبو ثور عن معمر عن الحسن وقتادة في قوله \"ن\" قالا هي الدواة وقد روي في هذا حديث مرفوع غريب جدا فقال ابن أبي حاتم حدثنا أبي حدثنا هشام بن خالد حدثنا الحسن بن يحيى حدثنا أبو عبدالله مولى بني أمية عن أبي صالح عن أبي هريرة قال سمعت رسول الله صلى الله عليه وسلم يقول \"خلق الله النون وهي الدواة\" وقال ابن جرير حدثنا ابن حميد حدثنا يعقوب حدثنا أخي عيسى بن عبدالله حدثنا ثابت الثمالي عن ابن عباس قال: إن الله خلق النون وهي الدواة وخلق القلم فقال اكتب قال وما أكتب قال اكتب ما هو كائن إلى يوم القيامة من عمل معمول به بر أو فجور أو رزق مقسوم حلال أو حرام ثم ألزم كل شيء من ذلك شأنه: دخوله في الدنيا ومقامه فيها كم وخروجه منها كيف ثم جعل على العباد حفظة وللكتاب خزانا فالحفظة ينسخون كل يوم من الخزان عمل ذلك اليوم فإذا فنى الرزق وانقطع الأثر وانقضى الأجل أتت الحفظة الخزنة يطلبون عمل ذلك اليوم فتقول لهم الخزنة ما نجد لصاحبكم عندنا شيئا فترجع الحفظة فيجدونهم قد ماتوا قال فقال ابن عباس ألستم قوما عربا تسمعون الحفظة يقولون \"إنا كنا نستنسخ ما كنتم تعملون\" وهل يكون الاستنساخ إلا من أصل وقوله تعالى \"والقلم\" الظاهر أنه جنس القلم الذي يكتب به كقوله \"اقرأ وربك الأكرم الذي علم بالقلم علم الإنسان ما لم يعلم\" فهو قسم منه تعالى وتنبيه لخلقه على ما أنعم به عليهم من تعليم الكتابة التي بها تنال العلوم ولهذا قال \"وما يسطرون\" قال ابن عباس ومجاهد وقتادة يعني وما يكتبون وقال أبو الضحى عن ابن عباس وما يسطرون أي وما يعملون وقال السدي وما يسطرون يعني الملائكة وما تكتب من أعمال العباد وقال آخرون بل المراد ههنا بالقلم الذي أجراه الله بالقدر حين كتب مقادير الخلائق قبل أن يخلق السموات والأرضين بخمسين ألف عام وأوردوا في ذلك الأحاديث الواردة في ذكر القلم فقال ابن أبي حاتم حدثنا أبو سعيد يحيى بن سعيد القطان ويونس بن حبيب قالا حدثنا أبو داود الطيالسي حدثنا عبدالواحد بن سليم السلمي عن عطاء هو ابن أبي رباح حدثني الوليد بن عبادة بن الصامت قال دعاني أبي حين حضره الموت فقال إني سمعت رسول الله صلى الله عليه وسلم يقول \"إن أول ما خلق الله القلم فقال له اكتب قال يا رب وما أكتب؟ قال اكتب القدر وما هو كائن إلى الأبد\" وهذا الحديث قد رواه الإمام أحمد من طرق عن الوليد بن عبادة عن أبيه به وأخرجه الترمذي من حديث أبي داود الطيالسي به وقال حسن صحيح غريب ورواه أبو داود في كتاب السنة من سننه عن جعفر بن مسافر عن يحيى بن حسان عن ابن رباح عن إبراهيم بن أبي عبلة عن أبي حفصة واسمه حبيش بن شريح الحبشي الشابي عن عبادة فذكره وقال ابن جرير حدثنا محمد بن عبدالله الطوسي حدثنا علي بن الحسن بن شقيق أنبأنا عبدالله بن المبارك حدثنا رباح بن زيد عن عمر بن حبيب عن القاسم بن أبي بزة عن سعيد بن جبير عن ابن عباس أنه كان يحدث أن رسول الله صلى الله عليه وسلم قال \"إن أول شيء خلقه الله القلم فأمره فكتب كل شيء\" غريب من هذا الوجه ولم يخرجوه وقال ابن أبي نجيح عن مجاهد والقلم يعني الذي كتب به الذكر وقوله تعالى \"وما يسطرون\" أي يكتبون كما تقدم."
    },
    {
      "ayah": 10,
      "surah": 68,
      "text": "وذلك أن الكاذب لضعفه ومهانته إنما يتقي بأيمانه الكاذبة التي يجترئ بها على أسماء الله تعالى واستعمالها في كل وقت في غير محلها قال ابن عباس المهين الكاذب وقال مجاهد هو الضعيف القلب قال الحسن كل حلاف مكابر مهين ضعيف."
    },
    {
      "ayah": 11,
      "surah": 68,
      "text": "وقوله تعالى \"هماز\" قال ابن عباس وقتادة يعني الاغتياب \"مشاء بنميم\" يعني الذي يمشي بين الناس ويحرش بينهم وينقل الحديث لفساد ذات البين وهي الحالقة وقد ثبت في الصحيحين من حديث مجاهد عن طاوس عن ابن عباس قال: مر رسول الله صلى الله عليه وسلم بقبرين فقال \"إنهما ليعذبان وما يعذبان في كبير أما أحدهما فكان لا يستتر من البول وأما الآخر فكان يمشي بالنميمة\" الحديث وأخرجه بقية الجماعة في كتبهم من طرق عن مجاهد به وقال الإمام أحمد حدثنا أبو معاوية حدثنا الأعمش عن إبراهيم عن همام أن حذيفة قال سمعت رسول الله صلى الله عليه وسلم يقول: \"لا يدخل الجنة قتات\" رواه الجماعة إلا ابن ماجه من طرق عن إبراهيم به وحدثنا عبدالرزاق حدثنا الثوري عن منصور عن إبراهيم عن همام عن حذيفة قال سمعت رسول الله صلى الله عليه وسلم يقول \"لا يدخل الجنة قتات\" يعني نماما وحدثنا يحيى بن سعيد القطان حدثنا أبو سعيد الأحول عن الأعمش حدثني إبراهيم منذ نحو ستين سنة عن همام بن الحارث قال مر رجل على حذيفة فقيل إن هذا يرفع الحديث إلى الأمراء فقال سمعت رسول الله صلى الله عليه وسلم يقول أو قال: قال رسول الله صلى الله عليه وسلم \"لا يدخل الجنة قتات\" وقال أحمد حدثنا هشام حدثنا مهدي عن واصل الأحدب عن أبي وائل قال بلغ حذيفة عن رجل أنه ينم الحديث فقال سمعت رسول الله صلى الله عليه وسلم قال \"لا يدخل الجنة نمام\" وقال الإمام أحمد حدثنا عبد الرزاق أنبأنا معمر عن ابن خثيم عن شهر بن حوشب عن أسماء بنت يزيد بن السكن أن النبي صلى الله عليه وسلم قال \"ألا أخبركم بخياركم؟\" قالوا بلى يا رسول الله قال \"الذين إذا رءواه ذكر الله عز وجل\" ثم قال \"ألا أخبركم بشراركم المشاءون بالنميمة المفسدون بين الأحبة والباغون للبرآء العنت\" ورواه ابن ماجه عن سويد بن سعيد عن يحيى بن سليم عن ابن خثيم به وقال الإمام أحمد حدثنا سفيان عن ابن أبي حسين عن شهر بن حوشب عن عبدالرحمن بن غنم يبلغ به النبي صلى الله عليه وسلم \"خيار عباد الله الذين إذا رءوا ذكر الله وشرار عباد الله المشاءون بالنميمة المفرقون بين الأحبة الباغون للبرآء العنت\"."
    },
    {
      "ayah": 12,
      "surah": 68,
      "text": "أي يمنع ما عليه وما لديه من الخير \"معتد\" في تناول ما أحل الله له يتجاوز فيها الحد المشروع \"أثيم\" أي يتناول المحرمات."
    },
    {
      "ayah": 13,
      "surah": 68,
      "text": "أما العتل فهو الفظ الغليظ الصحيح الجموع المنوع وقال الإمام أحمد حدثنا وكيع وعبدالرحمن عن سفيان عن سعيد بن خالد عن حارثة بن وهب قال: قال رسول الله صلى الله عليه وسلم \"ألا أنبئكم بأهل الجنة كل ضعيف متضعف لو أقسم على الله لأبره ألا أنبئكم باهل النار كل عتل جواظ مستكبر\" وقال وكيع \"كل جواظ جعظري مستكبر\" أخرجاه في الصحيحين بقية الجماعة إلا أبا داود من حديث سفيان الثوري وشعبة كلاهما عن سعيد بن خالد به وقال الإمام أحمد أيضا حدثنا أبو عبدالرحمن حدثنا موسى بن علي قال سمعت أبي يحدث عن عبدالله بن عمرو بن العاص أن النبي صلى الله عليه وسلم قال عند ذكر أهل النار \"كل جعظري جواظ مستكبر جماع مناع\" تفرد به أحمد قال أهل اللغة الجعظري الفظ الغليظ والجواظ الجموع المنوع وقال الإمام أحمد حدثنا وكيع حدثنا عبدالحميد عن شهر بن حوشب عن عبدالرحمن بن غنم قال سئل رسول الله صلى الله عليه وسلم عن العتل الزنيم فقال \"هو الشديد الخلق المصحح الأكول الشروب الواجد للطعام والشراب الظلوم للناس رحيب الجوف\" وبهذا الإسناد قال رسول الله صلى الله عليه وسلم \"لا يدخل الجنة الجواظ الجعظري العتل الزنيم\" وقد أرسله أيضا غير واحد من التابعين. وقال ابن جرير حدثنا ابن عبدالأعلى حدثنا أبو ثور عن معمر عن زيد بن أسلم قال: قال رسول الله صلى الله عليه وسلم \"تبكي السماء من عبد أصح الله جسمه وأرحب جوفه وأعطاه من الدنيا هضما فكان للناس ظلوما قال فذلك العتل الزنيم\" وهكذا رواه ابن أبي حاتم من طريقين مرسلين ونص عليه غير واحد من السلف منهم مجاهد وعكرمة والحسن وقتادة وغيرهم أن العتل هو المصحح الخلق الشديد القوي في المأكل والمشرب والمنكح وغير ذلك وأما الزنيم فقال البخاري حدثنا محمود حدثنا عبيدالله عن إسرائيل عن أبي حصين عن مجاهد عن ابن عباس \"عتل بعد ذلك زنيم\" قال رجل من قريش له زنمة مثل زنمة الشاة ومعنى هذا أنه كان مشهورا بالسوء كشهرة الشاة ذات الزنمة من بين أخواتها وإنما الزنيم في لغة العرب هو الدعي في القول قاله ابن جرير وغير واحد من الأئمة قال ومنه قول حسان بن ثابت يعني يذم بعض كفار قريش وأنت زنيم نيط في آل هاشم كما نيط خلف الراكب القدح الفرد وقال آخر: زنيم ليس يعرف من أبوه بغي الأم ذو حسب لئيم وقال ابن أبي حاتم حدثنا عمار بن خالد الواسطي حدثنا أسباط عن هشام عن عكرمة عن ابن عباس في قوله \"زنيم\" قال الدعي الفاحش اللئيم ثم قال ابن عباس زنيم تداعاه الرجال زيادة كما زيد في عرض الأديم الأكارع وقال العوفي عن ابن عباس: الزنيم الدعي ويقال الزنيم رجل كانت به زنمة يعرف بها ويقال هو الأخنس بن شريق الثقفي حليف بني زهرة وزعم أناس من بني زهرة أن الزنيم الأسود بن عبد يغوث الزهري وليس به وقال ابن أبي نجيح عن مجاهد عن ابن عباس أنه زعم أن الزنيم الملحق النسب. وقال ابن أبي حاتم حدثني يونس حدثنا ابن وهب حدثني سليمان بن بلال عن عبدالرحمن بن حرملة عن سعيد بن المسيب أنه سمعه يقول في هذه الآية \"عتل بعد ذلك زنيم\" قال سعيد هو الملصق بالقوم ليس منهم وقال ابن أبي حاتم حدثنا أبو سعيد الأشج حدثنا عقبة بن خالد عن عامر بن قدامة قال سئل عكرمة عن الزنيم قال هو ولد الزنا وقال الحكم بن أبان عن عكرمة في قوله تعالى \"عتل بعد ذلك زنيم\" قال يعرف المؤمن من الكافر مثل الشاة الزنماء والزنماء من الشياه التي في عنقها هنتان معلقتان في حلقها وقال الثوري عن جابر عن الحسن عن سعيد بن جبير قال الزنيم الذي يعرف بالشر كما تعرف الشاة بزنمتها والزنيم الملصق. رواه ابن جرير وروى أيضا من طريق داود بن أبي هند عن عكرمة عن ابن عباس أنه قال في الزنيم: نعت فلم يعرف حتى قيل زنيم. قال وكانت له زنمة في عنقه يعرف بها قال وقال آخرون كان دعيا. وقال ابن جرير حدثنا أبو كريب حدثنا ابن إدريس عن أبيه عن أصحاب التفسير قالوا هو الذي تكون له زنمة مثل زنمة الشاة وقال الضحاك كانت له زنمة في أصل أذنه ويقال هو اللئيم الملصق في النسب وقال أبو إسحق عن سعيد بن جبير عن ابن عباس هو المريب الذي يعرف بالشر وقال مجاهد الزنيم الذي يعرف بهذا الوصف كما تعرف الشاة وقال أبو رزين الزنيم علامة الكفر وقال عكرمة الزنيم الذي يعرف باللؤم كما تعرف الشاة بزنمتها والأقوال في هذا كثيرة وترجع إلى ما قلناه وهو أن الزنيم هو المشهور بالشر الذي يعرف به من بين الناس وغالبا يكون دعيا وله زنا فإنه في الغالب يتسلط الشيطان عليه ما لا يتسلط على غيره كما جاء في الحديث \"لا يدخل الجنة ولد زنا\" وفي الحديث الآخر \"ولد الزنا شر الثلاثة إذا عمل بعمل أبويه\"."
    },
    { "ayah": 14, "surah": 68, "text": "يقول تعالى هذا مقابلة ما أنعم الله عليه من المال والبنين." },
    {
      "ayah": 15,
      "surah": 68,
      "text": "كفر بآيات الله عز وجل وأعرض عنها وزعم أنها كذب مأخوذ من أساطير الأولين كقوله تعالى \"ذرني ومن خلقت وحيدا وجعلت له مالا ممدودا وبنين شهودا ومهدت له تمهيدا ثم يطمع أن أزيد كلا إنه كان لأياتنا عنيدا سأرهقه صعودا إنه فكر وقدر فقتل كيف قدر ثم قتل كيف قدر ثم نظر ثم عبس وبسر ثم أدبر واستكبر فقال إن هذا إلا سحر يؤثر إن هذا إلا قول البشر سأصليه سقر وما أدراك ما سقر لا تبقي ولا تذر لواحة للبشر عليها تسعة عشر\"."
    },
    {
      "ayah": 16,
      "surah": 68,
      "text": "قال ابن جرير سنبين أمره بيانا واضحا حتى يعرفوه ولا يخفى عليهم كما لا تخفى عليهم السمة على الخراطيم وهكذا قال قتادة \"سنسمه على الخرطوم\" شين لا يفارقه آخر ما عليه وفي رواية عنه سيما على أنفه وكذا قال السدي وقال العوفي عن ابن عباس \"سنسمه على الخرطوم\" يقاتل يوم بدر فيخطم بالسيف في القتال وقال آخرون \"سنسمه\" سمة أهل النار يعني نسود وجهه يوم القيامة وعبر عن الوجه بالخرطوم حكى ذلك كله أبو جعفر ابن جرير ومال إلى أنه لا مانع من اجتماع الجميع عليه في الدنيا والآخرة وهو متجه وقد قال ابن أبي حاتم في سورة \"عم يتساءلون\" حدثنا أبي حدثنا أبو صالح كاتب الليث حدثني الليث حدثني خالد بن سعيد عن عبدالملك بن عبدالله عن عيسى بن هلال الصدفي عن عبدالله بن عمرو عن رسول الله صلى الله عليه وسلم أنه قال \"إن العبد يكتب مؤمنا أحقابا ثم أحقابا ثم يموت والله عليه ساخط وإن العبد يكتب كافرا أحقابا ثم أحقابا ثم يموت والله عليه راض ومن مات همازا لمازا ملقبا للناس كان علامته يوم القيامة أن يسمه الله على الخرطوم من كلا الشفتين\"."
    },
    {
      "ayah": 17,
      "surah": 68,
      "text": "هذا مثل ضربه الله تعالى لكفار قريش فيما أهدى إليهم من الرحمة العظيمة وأعطاهم من النعمة الجسيمة وهو بعثة محمد صلى الله عليه وسلم إليهم فقابلوه بالتكذيب والرد والمحاربة ولهذا قال تعالى \"إنا بلوناهم\" أي اختبرناهم \"كما بلونا أصحاب الجنة\" وهي البستان المشتمل على أنواع الثمار والفواكه \"إذ أقسموا ليصر منها مصبحين\" أي حلفوا فيما بينهم ليجذن ثمرها ليلا لئلا يعلم بهم فقير ولا سائل ليتوفر ثمرها عليهم ولا يتصدقوا منه بشيء."
    },
    { "ayah": 18, "surah": 68, "text": "أي فيما حلفوا به." },
    {
      "ayah": 19,
      "surah": 68,
      "text": "ولهذا حنثهم الله في أيمانهم فقال تعالى \"فطاف عليها طائف من ربك وهم نائمون\" أي أصابتها آفة سماوية."
    },
    {
      "ayah": 2,
      "surah": 68,
      "text": "أي لست ولله الحمد بمجنون كما يقوله الجهلة من قومك المكذبون بما جئتهم به من الهدى والحق المبين فنسبوك فيه إلى الجنون."
    },
    {
      "ayah": 20,
      "surah": 68,
      "text": "قال ابن عباس أي كالليل الأسود وقال الثوري والسدي مثل الزرع إذا حصد أي هشيما يبسا. وقال ابن أبي حاتم ذكر عن أحمد بن الصباح أنبأنا بشر بن زاذان عن عمر بن صبيح عن ليث بن أبي سليم عن عبدالرحمن بن سابط عن ابن مسعود قال: قال رسول الله صلى الله عليه وسلم \"إياكم والمعاصي إن العبد ليذنب الذنب فيحرم به رزقا قد كان هيء له\" ثم تلا رسول الله صلى الله عليه وسلم \"فطاف عليها طائف من ربك وهم نائمون فأصبحت كالصريم\" قد حرموا خير جنتهم بذنبهم."
    },
    { "ayah": 21, "surah": 68, "text": "أي لما كان وقت الصبح نادى بعضهم بعضا ليذهبوا إلى الجذاذ أي القطع." },
    { "ayah": 22, "surah": 68, "text": "أي تريدون الصرام." },
    {
      "ayah": 23,
      "surah": 68,
      "text": "قال مجاهد: كان حرثهم عنبا \"فانطلقوا وهم يتخافتون\" أي يتناجون فيما بينهم بحيث لا يسمعون أحدا كلامهم. ثم فسر الله سبحانه وتعالى عالم السر والنجوى ما كانوا يتخافتون به."
    },
    {
      "ayah": 24,
      "surah": 68,
      "text": "فقال تعالى \"فانطلقوا وهم يتخافتون أن لا يدخلنها اليوم عليكم مسكين\" أي يقول بعضهم لبعض لا تمكنوا اليوم فقيرا يدخلها عليكم."
    },
    {
      "ayah": 25,
      "surah": 68,
      "text": "أي على قصد وقدرة فى أنفسهم ويظنون أنهم تمكنوا من مرادهم. قال معناه ابن عباس وغيره. والحرد القصد. حرد يحرد (بالكسر) حردا قصد. تقول: حردت حردك; أي قصدت قصدك. ومنه قول الراجز: أقبل سيل جاء من عند الله يحرد حرد الجنة المغلة أنشده النحاس: قد جاء سيل جاء من أمر الله يحرد حرد الجنة المغلة قال البرد: المغلة ذات الغلة. وقال غيره: المغلة التي يجري الماء في غللها أي في أصولها. ومنه تغللت بالغالية. ومنه تغليت, أبدل من اللام ياء. ومن قال تغلفت فمعناه عنده جعلتها غلافا. وقال قتادة ومجاهد: \"على حرد\" أي على جد. الحسن: على حاجة وفاقة. وقال أبو عبيدة والقتيبي: على حرد على منع; من قولهم حاردت الإبل حرادا أي قلت ألبانها. والحرود من النوق القليلة الدر. وحاردت السنة قل مطرها وخيرها. وقال السدي وسفيان: \"على حرد\" على غضب. والحرد الغضب. قال أبو نصر أحمد بن حاتم صاحب الأصمعي: وهو مخفف; وأنشد شعرا: إذا جياد الخيل جاءت تردي مملوءة من غضب وحرد وقال ابن السكيت: وقد يحرك; تقول منه: حرد (بالكسر) حردا, فهو حارد وحردان. ومنه قيل: أسد حارد, وليوث حوارد. وقيل: \"على حرد\" على انفراد. يقال: حرد يحرد حرودا; أي تنحى عن قومه ونزل منفردا ولم يخالطهم. وقال أبو زيد: رجل حريد من قوم حرداء. وقد حرد يحرد حرودا; إذا ترك قومه وتحول عنهم. وكوكب حريد; أي معتزل عن الكواكب. قال الأصمعي: رجل حريد; أي فريد وحيد. قال والمنحرد المنفرد في لغة هذيل. وأنشد لأبي ذؤيب: كأنه كوكب في الجو منحرد ورواه أبو عمرو بالجيم, وفسره: منفرد. قال: وهو سهيل. وقال الأزهري: حرد اسم قريتهم. السدي: اسم جنتهم; وفيه لغتان: حرد وحرد. وقرأ العامة بالإسكان. وقرأ أبو العالية وابن السميقع بالفتح; وهما لغتان. ومعنى \"قادرين\" قد قدروا أموهم وبنوا عليه; قاله الفراء. وقال قتادة: قادرين على جنتهم عند أنفسهم. وقال الشعبي: \"قادرين\" يعني على المساكين. وقيل: معناه من الوجود; أي منعوا وهم واجدون."
    },
    {
      "ayah": 26,
      "surah": 68,
      "text": "أي لما رأوها محترقة لا شيء فيها قد صارت كالليل الأسود ينظرون إليها كالرماد, أنكروها وشكوا فيها. وقال بعضهم لبعض: \"إنا لضالون\" أي ضللنا الطريق إلى جنتنا; قاله قتادة. وقيل: أي إنا لضالون عن الصواب في غدونا وعلى نية منع المساكين; فلذلك عوقبنا."
    },
    {
      "ayah": 27,
      "surah": 68,
      "text": "أي حرمنا جنتنا بما صنعنا. روى أسباط عن ابن مسعود قال: قال رسول الله صلي الله عليه وسلم: (إياكم والمعاصي إن العبد ليذنب الذنب فيحرم به رزقا كان هيء له - ثم تلا - \"فطاف عليها طائف من ربك\" [القلم: 19]) الآيتين."
    },
    { "ayah": 28, "surah": 68, "text": "أي أمثلهم وأعدلهم وأعقلهم." },
    {
      "ayah": 29,
      "surah": 68,
      "text": "اعترفوا بالمعصية ونزهوا الله عن أن يكون ظالما فيما فعل. قال ابن عباس في قولهم: \"سبحان ربنا\" أي نستغفر الله من ذنبنا."
    },
    {
      "ayah": 3,
      "surah": 68,
      "text": "أي بل إن لك الأجر العظيم والثواب الجزيل الذي لا ينقطع ولا يبيد على إبلاغك رسالة ربك إلى الخلق وصبرك على أذاهم ومعنى غير ممنون أي غير مقطوع كقوله \"عطاء غير مجذوذ\" \"فلهم أجر غير ممنون\" أي غير مقطوع عنهم وقال مجاهد غير ممنون أي غير محسوب وهو يرجع إلى ما قلناه."
    },
    { "ayah": 30, "surah": 68, "text": "أي يلوم هذا هذا في القسم ومنع المساكين, ويقول: بل أنت أشرت علينا بهذا." },
    {
      "ayah": 31,
      "surah": 68,
      "text": "أي عاصين بمنع حق الفقراء وترك الاستثناء. وقال ابن كيسان: طغينا نعم الله فلم نشكرها كما شكرها آباؤنا من قبل."
    },
    {
      "ayah": 32,
      "surah": 68,
      "text": "تعاقدوا وقالوا: إن أبدلنا الله خيرا منها لنصنعن كما صنعت آباؤنا; فدعوا الله وتضرعوا فأبدلهم الله من ليلتهم ما هو خير منها, وأمر جبريل أن يقتلع تلك الجنة المحترقة فيجعلها بزغر من أرض الشام, ويأخذ من الشام جنة فيجعلها مكانها. وقال ابن مسعود: إن القوم أخلصوا وعرف الله منهم صدقهم فأبدلهم جنة يقال لها الحيوان, فيها عنب يحمل البغل منها عنقودا واحدا. وقال اليماني أبو خالد: دخلت تلك الجنة فرأيت كل عنقود منها كالرجل الأسود القائم. وقال الحسن: قول أهل الجنة"
    },
    {
      "ayah": 33,
      "surah": 68,
      "text": "أي عذاب الدنيا وهلاك الأموال; عن ابن زيد. وقيل: إن هذا وعظ لأهل مكة بالرجوع إلى الله لما ابتلاهم بالجدب لدعاء النبي صلي الله عليه وسلم, أي كفعلنا بهم نفعل بمن تعدى حدودنا في الدنيا"
    },
    {
      "ayah": 34,
      "surah": 68,
      "text": "تقدم القول فيه; أي إن للمتقين في الآخرة جنات ليس فيها إلا التنعم الخالص, لا يشوبه ما ينغصه كما يشوب جنات الدنيا. وكان صناديد قريش يرون وفور حظهم من الدنيا وقلة حظوظ المسلمين منها; فإذا سمعوا بحديث الآخرة وما وعد الله المؤمنين قالوا: إن صح أنا نبعث كما يزعم محمد ومن معه لم يكن حالنا وحالهم إلا مثل ما هي في الدنيا, وإلا لم يزيدوا علينا ولم يفضلونا, وأقصى أمرهم أن يساوونا."
    },
    {
      "ayah": 35,
      "surah": 68,
      "text": "أي كالكفار. وقال ابن عباس وغيره: قالت كفار مكة: إنا نعطى في الآخرة خيرا مما تعطون; فنزلت \"أفنجعل المسلمين كالمجرمين\"."
    },
    {
      "ayah": 36,
      "surah": 68,
      "text": "هذا الحكم الأعوج; كأن أمر الجزاء مفوض إليكم حتى تحكموا فيه بما شئتم أن لكم من الخير ما للمسلمين."
    },
    { "ayah": 37, "surah": 68, "text": "أي لكم كتاب تجدون فيه المطيع كالعاصي." },
    {
      "ayah": 38,
      "surah": 68,
      "text": "تختارون وتشتهون. والمعنى: أن لكم (بالفتح) ولكنه كسر لدخول اللام; تقول علمت أنك عاقل (بالفتح), وعلمت إنك لعاقل (بالكسر). فالعامل في \"إن لكم فيه لما تخيرون\" \"تدرسون\" في المعنى. ومنعت اللام من فتح \"إن\". وقيل: تم الكلام عند قوله: \"تدرسون\" ثم ابتدأ فقال: \"إن لكم قيه لما تخيرون\" أي إن لكم في هذا الكتاب إذا ما تخيرون; أي ليس لكم ذلك. والكناية في \"فيه\" الأولى والثانية راجعة إلى الكتاب."
    },
    { "ayah": 39, "surah": 68, "text": "أي عهود ومواثيق." },
    {
      "ayah": 4,
      "surah": 68,
      "text": "وقوله تعالى \"وإنك لعلى خلق عظيم\" قال العوفي عن ابن عباس وإنك لعلى دين عظيم وهو الإسلام وكذلك قال مجاهد وأبو مالك والسدي والربيع بن أنس وكذا قال الضحاك وابن زيد. وقال عطية لعلى أدب عظيم وقال معمر عن قتادة سئلت عائشة عن خلق رسول الله صلى الله عليه وسلم قالت: كان خلقه القرآن تقول كما هو في القرآن.وقال سعيد بن أبي عروبة عن قتادة قوله \"وإنك لعلى خلق عظيم\" ذكر لنا أن سعيد بن هشام سأل عائشة عن خلق رسول الله صلى الله عليه وسلم فقالت ألست تقرأ القرآن؟ قال بلى قالت فإن خلق رسول الله صلى الله عليه وسلم كان القرآن. وقال عبدالرزاق عن معمر عن قتادة عن زرارة بن أوفى عن سعد بن هشام قال سألت عائشة فقلت أخبريني يا أم المؤمنين عن خلق رسول الله صلى الله عليه وسلم فقالت أتقرأ القرآن؟ فقلت نعم فقالت كان خلقه القرآن هذا مختصر من حديث طويل وقد رواه الإمام مسلم في صحيحه من حديث قتادة بطوله وسيأتي في سورة المزمل إن شاء الله تعالى وبه الثقة. وقال الإمام أحمد حدثنا إسماعيل حدثنا يونس عن الحسن قال سألت عائشة عن خلق رسول الله صلى الله عليه وسلم فقالت كان خلقه القرآن. وقال الإمام أحمد حدثنا أسود حدثنا شريك عن قيس بن وهب عن رجل من بني سواد قال سألت عائشة عن خلق رسول الله صلى الله عليه وسلم فقالت أما تقرأ القرآن؟ \"وإنك لعلى خلق عظيم\" قال: قلت حدثيني عن ذاك قالت صنعت له طعاما وصنعت له حفصة طعاما فقالت لجاريتي اذهبي فإن جاءت هي بالطعام فوضعته قبل فاطرحي الطعام قالت: فجاءت بالطعام قالت فألقت الجارية فوقعت القصعة فانكسرت وكان نطع قالت فجمعه رسول الله صلى الله عليه وسلم وقال \"اقتصوا - أو اقتضى شك أسود - ظرفا مكان ظرفك\" قالت فما قال شيئا. وقال ابن جرير حدثنا عبيد بن آدم بن أبي إياس حدثنا أبي حدثنا المبارك بن فضالة عن الحسن عن سعد بن هشام قال أتيت عائشة أم المؤمنين رضي الله عنها فقلت لها أخبريني بخلق النبي صلى الله عليه وسلم فقالت: كان خلقه القرآن أما تقرأ \"وإنك لعل خلق عظيم\" وقد روى أبو داود والنسائي من حديث الحسن نحوه وقال ابن جرير حدثني يونس أنبأنا ابن وهب أخبرني معاوية بن صالح عن أبي الزاهرية عن جبير بن نفير قال حججت فدخلت على عائشة رضي الله عنها فسألتها عن خلق رسول الله صلى الله عليه وسلم فقالت كان خلق رسول الله صلى الله عليه وسلم القرآن وهكذا رواه أحمد عن عبدالرحمن بن مهدي. رواه النسائي في التفسير عن إسحاق بن منصور عن عبدالرحمن بن مهدي عن معاوية بن صالح به. ومعنى هذا أنه عليه الصلاة والسلام صار امتثال القرآن أمرا ونهيا سجية له وخلقا تطبعه وترك طبعه الجبلي فمهما أمره القرآن فعله ومهما نهاه عنه تركه هذا مع ما جبله الله عليه من الخلق العظيم من الحياء والكرم والشجاعة والصفح والحلم وكل خلق جميل كما ثبت في الصحيحين عن أنس قال: خدمت رسول الله صلى الله عليه وسلم عشر سنين فما قال لي أف قط ولا قال لشيء فعلته لم فعلته؟ ولا لشيء لم أفعله ألا فعلته وكان صلى الله عليه وسلم أحسن الناس خلقا ولا مسست خزا ولا حريرا ولا شيئا كان ألين من كف رسول الله صلى الله عليه وسلم ولا شممت مسكا ولا عطرا كان أطيب من عرق رسول الله صلى الله عليه وسلم. وقال البخاري حدثنا إسحاق بن منصور حدثنا إبراهيم بن يونس عن أبيه عن أبي إسحاق قال سمعت البراء يقول: كان رسول الله صلى الله عليه وسلم أحسن الناس وجها وأحسن الناس خلقا ليس بالطويل ولا بالقصير. والأحاديث في هذا كثيرة ولأبي عيسى الترمذي في هذا كتاب الشمائل قال الإمام أحمد حدثنا عبدالرزاق حدثنا معمر عن الزهري عن عروة عن عائشة قالت: ما ضرب رسول الله صلى الله عليه وسلم بيده خادما له قط ولا ضرب امرأة ولا ضرب بيده شيء قط إلا أن يجاهد في سبيل الله ولا خير بين شيئين قط إلا كان أحبهما إليه أيسرهما حتى يكون إثما فإذا كان إثما كان أبعد الناس من الإثم ولا انتقم لنفسه من شيء يؤتى إليه إلا أن تنتهك حرمات الله فيكون هو ينتقم لله عز وجل. وقال الإمام أحمد حدثنا سعيد بن منصور حدثنا عبد العزيز بن محمد عن محمد بن عجلان عن القعقاع بن حكيم عن أبي صالح عن أبي هريرة قال: قال رسول الله صلى الله عليه وسلم \"إنما بعثت لأتمم صالح الأخلاق\" تفرد به."
    },
    {
      "ayah": 40,
      "surah": 68,
      "text": "أي سل يا محمد هؤلاء المتقولين علي: أيهم كفيل بما تقدم ذكره. وهو أن لهم من الخير ما للمسلمين. والزعيم: الكفيل والضمين; قال ابن عباس وقتادة. وقال ابن كيسان: الزعيم هنا القائم بالحجة والدعوى. وقال الحسن: الزعيم الرسول."
    },
    { "ayah": 41, "surah": 68, "text": "أي ألهمزه والميم صلة. \"شركاء\" أي شهداء." },
    {
      "ayah": 42,
      "surah": 68,
      "text": "يجوز أن يكون العامل في \"يوم\" \"فليأتوا\" أي فليأتوا بشركائهم يوم يكشف عن ساق ليشفع الشركاء لهم. ويجوز أن ينتصب بإضمار فعل, أي اذكر يوم يكشف عن ساق; فيوقف على \"صادقين\" ولا يوقف عليه على التقدير الأول. وقرئ \"يوم نكشف\" بالنون. \"وقرأ\" ابن عباس \"يوم تكشف عن ساق\" بتاء مسمى الفاعل; أي تكشف الشدة أو القيامة. عن ساقها; كقولهم: شمرت الحرب عن ساقها. قال الشاعر: فتى الحرب إن عضت به الحرب عضها وإن شمرت عن ساقها الحرب شمرا وقال الراجز: قد كشفت عن ساقها فشدوا وجدت الحرب بكم فجدوا وقال آخر: عجبت من نفسي ومن إشفاقها ومن طراد الطير عن أرزاقها في سنة قد كشفت عن ساقها حمراء تبري اللحم عن عراقها وقال آخر: كشفت لهم عن ساقها وبدا من الشر الصراح وعن ابن عباس أيضا والحسن وأبي العالية \"تكشف\" بتاء غير مسمى الفاعل. وهذه القراءة راجعة إلى معنى \"يكشف\" وكأنه قال: يوم تكشف القيامة عن شدة. وقرئ \"يوم تكشف\" بالتاء المضمومة وكسر الشين; من أكشف إذا دخل في الكشف. ومنه: أكشف الرجل فهو مكشف; إذا انقلبت شفته العليا. وذكر ابن المبارك قال: أخبرنا أسامة بن زيد عن عكرمة عن ابن عباس في قوله تعالى: \"يوم يكشف عن ساق\" قال: عن كرب وشدة. أخبرنا ابن جريج عن مجاهد قال: شدة الأمر وجده. وقال مجاهد: قال ابن عباس هي أشد ساعة في يوم القيامة. وقال أبو عبيدة: إذا اشتد الحرب والأمر قيل: كشف الأمر عن ساقه. والأصل فيه أن من وقع في شيء يحتاج فيه إلى الجد شمر عن ساقه; فاستعير الساق والكشف عنها في موضع الشدة. وقيل: ساق الشيء أصله الذي به قوامه; كساق الشجرة وساق الإنسان. أي يوم يكشف عن أصل الأمر فتظهر حقائق الأمور وأصلها. وقيل: يكشف عن ساق جهنم. وقيل: عن ساق العرش. وقيل: يريد وقت أقتراب الأجل وضعف البدن; أي يكشف المريض عن ساقه ليبصر ضعفه, ويدعوه المؤذن إلى الصلاة فلا يمكنه أن يقوم ويخرج. فأما ما روي أن الله يكشف عن ساقه فإنه عز وجل يتعالى عن الأعضاء والتبعيض وأن يكشف ويتغطى. ومعناه أن يكشف عن العظيم من أمره. وقيل: يكشف عن نوره عز وجل. وروى أبو موسى عن النبي صلي الله عليه وسلم في قوله تعالى: \"عن ساق\" قال: (يكشف عن نور عظيم يخرون له سجدا). وقال أبو الليث السمرقندي في تفسيره: حدثنا الخليل بن أحمد قال حدثنا ابن منيع قال حدثنا هدبة قال حدثنا حماد ابن سلمة عن عدي بن زيد عن عمارة القرشي عن أبي بردة عن أبي موسى قال حدثني أبي قال: سمعت رسول الله صلي الله عليه وسلم يقول: (إذا كان يوم القيامة مثل لكل قوم ما كانوا يعبدون في الدنيا فيذهب كل قوم إلى ما كانوا يعبدون ويبقى أهل التوحد فيقال لهم ما تنتظرون وقد ذهب الناس فيقولون إن لنا ربا كنا نعبده في الدنيا ولم نره - قال - وتعرفونه إذا رأيتموه فيقولون نعم فيقال فكيف تعرفونه ولم تروه قالوا إنه لا شبيه له فيكشف لهم الحجاب فينظرون إلى الله تعالى فيخرون له سجدا وتبقى أقوام ظهورهم مثل صياصي البقر فينظرون إلى الله تعالى فيريدون السجود فلا يستطيعون فذلك قوله تعالى: \"يوم يكشف عن ساق ويدعون إلى السجود فلا يستطيعون\" فيقول الله تعالى عبادي أرفعوا رءوسكم فقد جعلت بدل كل رجل منكم رجلا من اليهود والنصارى في النار). قال أبو بردة: فحدثت بهذا الحديث عمر بن عبد العزيز فقال: الله الذي لا إله إلا هو لقد حدثك أبوك بهذا الحديث؟ فحلف له ثلاثة أيمان; فقال عمر: ما سمعت في أهل التوحيد حديثا هو أحب إلي من هذا. وقال قيس بن السكن: حدث عبدالله بن مسعود عند عمر بن الخطاب فقال: إذا كان يوم القيامة قام الناس لرب العالمين أربعين عاما شاخصة أبصارهم إلى السماء, حفاة عراة يلجمهم العرق, فلا يكلمهم الله ولا ينظر إليهم أربعين عاما, ثم ينادي مناد: أيها الناس, أليس عدلا من ربكم الذي خلقكم وصوركم وأماتكم وأحياكم ثم عبدتم غيره أن يولي كل قوم ما تولوا؟ قالوا: نعم. قال: فيرفع لكل قوم ما كانوا يعبدون من دون الله فيتبعونها حتى تقذفهم في النار, فيبقى المسلمون والمنافقون فيقال لهم: ألا تذهبون قد ذهب الناس؟ فيقولون حتى يأتينا ربنا; فيقال لهم: أو تعرفونه؟ فيقولون: إن اعترف لنا عرفناه. قال فعند ذلك يكشف عن ساق ويتجلى لهم فيخر من كان يعبده مخلصا ساجدا, ويبقى المنافقون لا يستطيعون كأن في ظهورهم السفافيد, فيذهب بهم إلى النار, ويدخل هؤلاء الجنة; فذلك قوله تعالى: \"ويدعون إلى السجود فلا يستطيعون\"."
    },
    { "ayah": 43, "surah": 68, "text": "أي ذليلة متواضعة; ونصبها على الحال." },
    { "ayah": 44, "surah": 68, "text": "أي دعني." },
    {
      "ayah": 45,
      "surah": 68,
      "text": "أي أمهلهم وأطيل لهم المدة. والملاوة: المدة من الدهر. وأملى الله له أي أطال له. والملوان: الليل والنهار. وقيل: \"وأملي لهم\" أي لا أعاجلهم بالموت; والمعنى واحد. وقد مضى في \"الأعراف\" بيان هذا."
    },
    {
      "ayah": 46,
      "surah": 68,
      "text": "عاد الكلام إلى ما تقدم من قوله تعالى: \"أم لهم شركاء\" [القلم: 41]. أي أم تلتمس منهم ثوابا على ما تدعوهم إليه من الإيمان بالله؟ فهم من غرامة ذلك مثقلون لما يشق عليهم من بذل المال; أي ليس عليهم كلفة, بل يستولون بمتابعتك على خزائن الأرض ويصلون إلى جنات النعيم."
    },
    { "ayah": 47, "surah": 68, "text": "أي علم ما غاب عنهم." },
    {
      "ayah": 48,
      "surah": 68,
      "text": "أي لقضاء ربك. والحكم هنا القضاء. وقيل: فأصبر على ما حكم به عليك ربك من تبليغ الرسالة. وقال ابن بحر: فأصبر لنصر ربك. قال قتادة: أي لا تعجل ولا تغاضب فلا بد من نصرك. وقيل: إنه منسوخ بآية السيف."
    },
    {
      "ayah": 49,
      "surah": 68,
      "text": "قراءة العامة \"تداركه\". وقرأ ابن هرمز والحسن \"تداركه\" بتشديد الدال; وهو مضارع أدغمت التاء منه في الدال. وهو على تقدير حكاية الحال; كأنه قال: لولا أن كان يقال فيه تتداركه نعمة. ابن عباس وابن مسعود: \"تداركته\" وهو خلاف المرسوم. و\"تداركه\" فعل ماض مذكر حمل على معنى النعمة; لأن تأنيث النعمة غير حقيقي. و\"تداركته\" على لفظها. واختلف في معنى النعمة هنا; فقيل النبوة; قال الضحاك. وقيل عبادته إلتي سلفت; قاله ابن جبير. وقيل: نداؤه \"لا إله إلا أنت سبحانك إني كنت من الظالمين\" [الأنبياء: 87]; قاله ابن زيد. وقيل: نعمة الله عليه إخراجه من بطن الحوت; قال ابن بحر. وقيل: أي رحمة من ربه; فرحمه وتاب عليه."
    },
    {
      "ayah": 5,
      "surah": 68,
      "text": "أي فستعلم يا محمد وسيعلم مخالفوك ومكذبوك من المفتون الضال منك ومنهم وهذا كقوله تعالى \"سيعلمون غدا من الكذاب الأشر\" وكقوله تعالى \"وإنا أو إياكم لعلى هدى أو في ضلال مبين\" قال ابن جريج قال ابن عباس في هذه الآية ستعلم ويعلمون يوم القيامة."
    },
    {
      "ayah": 50,
      "surah": 68,
      "text": "أي اصطفاه وأختاره. \"فجعله من الصالحين\" قال ابن عباس: رد الله إليه الوحي, وشفعه في نفسه وفي قومه, وقبل توبته, وجعله من الصالحين بأن أرسله إلى مائة ألف أو يزيدون."
    },
    {
      "ayah": 51,
      "surah": 68,
      "text": "\"إن\" هي المخففة من الثقيلة. \"ليزلقونك\" أي يعتانونك. أخبر بشدة عداوتهم النبي صلي الله عليه وسلم, وأرادوا أن يصيبوه بالعين فنظر إليه قوم من قريش وقالوا: ما رأينا مثله ولا مثل حججه. وقيل: كانت العين في بني أسد, حتى إن البقرة السمينة أو الناقة السمينة تمر بأحدهم فيعاينها ثم يقول: يا جارية, خذي المكتل والدرهم فأتينا بلحم هذه الناقة, فما تبرح حتى تقع للموت فتنحر. وقال الكلبي: كان رجل من العرب يمكث لا يأكل شيئا يومين أو ثلاثة, ثم يرفع جانب الخباء فتمر به الإبل أو الغنم فيقول: لم أر كاليوم إبلا ولا غنما أحسن من هذه فما تذهب إلا قليلا حتى تسقط منها طائفة هالكة. فسأل الكفار هذا الرجل أن يصيب لهم النبي صلي الله عليه وسلم بالعين فأجابهم; فلما مر النبي صلي الله عليه ويلم أنشد: قد كان قومك يحسبونك سيدا وإخال أنك سيد معيون فعصم الله نبيه صلي الله عليه وسلم ونزلت: \"وإن يكاد الذين كفروا ليزلقونك\". وذكر نحوه الماوردي. وأن العرب كانت إذا أراد أحدهم أن يصيب أحدا - يعني في نفسه وماله - تجوع ثلاثة أيام, ثم يتعرض لنفسه وماله فيقول: تالله ما رأيت أقوى منه ولا أشجع ولا أكثر منه ولا أحسن; فيصيبه بعينه فيهلك هو ومال; فأنزل الله تعالى هذه الآية. قال القشيري: وفي هذا نظر; لأن الإصابة بالعين إنما تكون مع الاستحسان والإعجاب لا مع الكراهية والبغض; ولهذا قال:"
    },
    {
      "ayah": 52,
      "surah": 68,
      "text": "أي وما القرآن إلا ذكر للعالمين. وقيل: أي وما محمد إلا ذكر للعالمين يتذكرون به. وقيل: معناه شرف; أي القرآن. كما قال تعالى: \"وإنه لذكر لك ولقومك\" [الزخرف: 44] والنبي صلي الله عليه وسلم شرف للعالمين أيضا. شرفوا باتباعه والإيمان به صلى الله عليه وسلم."
    },
    {
      "ayah": 6,
      "surah": 68,
      "text": "وقال العوفي عن ابن عباس \"بأيكم المفتون\" أي المجنون وكذا قال مجاهد وغيره وقال قتادة وغيره \"بأيكم المفتون\" أي أولى بالشيطان ومعنى المفتون ظاهر أي الذي قد افتتن عن الحق وضل عنه وإنما دخلت الباء في قوله بأيكم لتدل على تضمين الفعل في قوله \"فستبصر ويبصرون\" وتقديره فستعلم ويعملون أو فستخبر ويخبرون بأيكم المفتون والله أعلم."
    },
    { "ayah": 7, "surah": 68, "text": "أي هو يعلم تعالى أي الفريقين منكم ومنهم هو المهتدي ويعلم الحزب الضال عن الحق." },
    {
      "ayah": 8,
      "surah": 68,
      "text": "يقول تعالى كما أنعمنا عليك وأعطيناك الشرع المستقيم والخلق العظيم \"فلا تطع المكذبين \"."
    },
    {
      "ayah": 9,
      "surah": 68,
      "text": "\"ودوا لو تدهن فيدهنون\" قال ابن عباس لو ترخص لهم فيرخصون.وقال مجاهد \"ودوا لو تدهن\" تركن إلى آلهتم وتترك ما أنت عليه من الحق."
    }
  ]
}
