{
  "ayahs": [
    {
      "ayah": 1,
      "surah": 69,
      "text": "روى أبو الزاهرية عن أبي هريرة قال: قال رسول الله صلي الله عليه وسلم: (من قرأ إحدى عشرة آية من سورة الحاقة أجير من فتنة الدجال. ومن قرأها كانت له نورا يوم القيامة من فوق رأسه إلى قدمه). \"الحاقة\" يريد القيامة; سميت بذلك لأن الأمور تحق فيها"
    },
    {
      "ayah": 10,
      "surah": 69,
      "text": "قال الكلبي: هو موسى. وقيل: هو لوط لأنه أقرب. وقيل: عنى موسى ولوطا عليهما السلام; كما قال تعالى: \"فقولا إنا رسول رب العالمين\" [الشعراء: 16]. وقيل: \"رسول\" بمعنى رسالة. وقد يعبر عن الرسالة بالرسول; قال الشاعر: لقد كذب الواشون ما بحت عندهم بسر ولا أرسلتهم برسول"
    },
    {
      "ayah": 11,
      "surah": 69,
      "text": "أي أرتفع وعلا. وقال علي رضي الله عنه: طغى على خزانه من الملائكة غضبا لربه فلم يقدروا على حبسه. قال قتادة: زاد على كل شيء خمسة عشر ذراعا. وقال ابن عباس: طغى الماء زمن نوح على خزانه فكثر عليهم فلم يدروا كم خرج. وليس من الماء قطرة تنزل قبله ولا بعده إلا بكيل معلوم غير ذلك اليوم. وقد مضى هذا مرفوعا أول السورة. والمقصود من قصص هذه الأمم وذكر ما حل بهم من العذاب: زجر هذه الأمة عن الاقتداء بهم في معصية الرسول. ثم من عليهم بأن جعلهم ذرية من نجا من الغرق بقوله:"
    },
    {
      "ayah": 12,
      "surah": 69,
      "text": "يعني سفينة نوح عليه الصلاة والسلام. جعلها الله تذكرة وعظة لهذه الأمة حتى أدركها أوائلهم; في قول قتادة. قال ابن جريج: كانت ألواحها على الجودي. والمعنى: أبقيت لكم تلك الخشبات حتى تذكروا ما حل بقوم نوح, وإنجاء الله آباءكم; وكم من سفينة هلكت وصارت ترابا ولم يبق منها شيء. وقيل: لنجعل تلك الفعلة من إغراق قوم نوح وإنجاء من آمن معه موعظة لكم; ولهذا قال الله تعالى:"
    },
    {
      "ayah": 13,
      "surah": 69,
      "text": "قال ابن عباس: هي النفخة الأولى لقيام الساعة, فلم يبق أحد إلا مات. وجاز تذكير \"نفخ\" لأن تأنيث النفخة غير حقيقي. وقيل: إن هذه النفخة هي الأخيرة. وقال: \"نفخة واحدة\" أي لا تثنى. قال الأخفش: ووقع الفعل على النفخة إذ لم يكن قبلها اسم مرفوع فقيل: نفخة. ويجوز \"نفخة\" نصبا على المصدر. وبها قرأ أبو السمال. أو يقال: أقتصر على الإخبار عن الفعل كما تقول: ضرب ضربا. وقال الزجاج: \"في الصور\" يقوم مقام ما لم يسم فاعله."
    },
    { "ayah": 14, "surah": 69, "text": "قراءة العامة بتخفيف الميم; أي رفعت من أماكنها." },
    { "ayah": 15, "surah": 69, "text": "أي قامت القيامة." },
    {
      "ayah": 16,
      "surah": 69,
      "text": "أي أنصدعت وتفطرت. وقيل: تنشق لنزول ما فيها من الملائكة; دليله قوله تعالى: \"ويوم تشقق السماء بالغمام ونزل الملائكة تنزيلا\" [الفرقان: 25] وقد تقدم."
    },
    { "ayah": 17, "surah": 69, "text": "يعني الملائكة; اسم للجنس." },
    {
      "ayah": 18,
      "surah": 69,
      "text": "أي, على الله; دليله: \"وعرضوا على ربك صفا\" وليس ذلك عرضا يعلم به ما لم يكن عالما به, بل معناه الحساب وتقرير الأعمال عليهم للمجازاة. وروى الحسن عن أبي هريرة قال: قال رسول الله صلي الله عليه وسلم: (يعرض الناس يوم القيامة ثلاث عرضات فأما عرضتان فجدال ومعاذير وأما الثالثة فعند ذلك تطير الصحف في الأيدي فآخذ بيمينه وآخذ بشماله). خرجه الترمذي قال: ولا يصح من قبل أن الحسن لم يسمع من أبي هريرة."
    },
    {
      "ayah": 19,
      "surah": 69,
      "text": "إعطاء الكتاب باليمين دليل على النجاة. وقال ابن عباس: أول من يعطى كتابه بيمينه من هذه الأمة عمر بن الخطاب, وله شعاع كشعاع الشمس. قيل له: فأين أبو بكر؟ فقال هيهات هيهات! زفته الملائكة إلى الجنة. ذكره الثعلبي. وقد ذكرناه مرفوعا من حديث زيد بن ثابت بلفظه ومعناه في كتاب \"التذكرة\". والحمد لله. \"فيقول هاؤم اقرءوا كتابيه\" أي يقول ذلك ثقة بالإسلام وسرورا بنجاته; لأن اليمين عند العرب من دلائل الفرح, والشمال من دلائل الغم. قال الشاعر: أبيني أفي يمنى يديك جعلتني فأفرح أم صيرتني في شمالك ومعنى: \"هاؤم\" تعالوا; قاله ابن زيد. وقال مقاتل: هلم. وقيل: أي خذوا; ومنه الخبر في الربا (إلا هاء وهاء) أي يقول كل واحد لصاحبه: خذ. قال ابن السكيت والكسائي: العرب تقول هاء يا رجل اقرأ, وللاثنين هاؤما يا رجلان, وهاؤم يا رجال, وللمرة هاء (بكسر الهمزة) وهاؤما وهاؤمن. والأصل هاكم فأبدلت الهمزة من الكاف; قال القتيبي. وقيل: إن \"هاؤم\" كلمة وضعت لإجابة الداعي عند النشاط والفرح. روي أن رسول الله صلي الله عليه وسلم ناداه أعرابي بصوت عال فأجابه النبي صلي الله عليه وسلم \"هاؤم\" يطول صوته. \"وكتابيه\" منصوب ب \"هاؤم\" عند الكوفيين. وعند البصريين ب \"اقرءوا\" لأنه أقرب العاملين. والأصل \"كتابي\" فأدخلت الهاء لتبين فتحة الياء, وكان الهاء للوقف, وكذلك في أخواته: \"حسابيه\", وماليه, وسلطانيه\" وفي القارعة \"ماهيه\". وقراءة العامة بالهاء فيهن في الوقف والوصل معا; لأنهن وقعن في المصحف بالهاء فلا تترك. وأختار أبو عبيد أن يتعمد الوقف عليها ليوافق اللغة في إلحاق الهاء في السكت ويوافق الخط. وقرأ ابن محيصن ومجاهد وحميد ويعقوب بحذف الهاء في الوصل وإثباتها في الوقف فيهن جمع. ووافقهم حمزة في \"ماليه وسلطانيه\", و\"ماهيه\" في القارعة. وجملة هذه الحروف سبعة. وأختار أبو حاتم قراءة يعقوب ومن معه إتباعا للغة. ومن قرأهن في الوصل بالهاء فهو على نية الوقف."
    },
    {
      "ayah": 2,
      "surah": 69,
      "text": "يريد القيامة; سميت بذلك لأن الأمور تحق فيها; قاله الطبري. كأنه جعلها من باب \"ليل نائم\". وقيل: سميت حاقة لأنها تكون من غير شك. وقيل: سميت بذلك لأنها أحقت لأقوام الجنة, وأحقت لأقوام النار. وقيل: سميت بذلك لأن فيها يصير كل إنسان حقيقا بجزاء عمله. وقال الأزهري: يقال حاققته فحققته أحقه; أي غالبته فغلبته. فالقيامة حاقة لأنها تحق كل محاق في دين الله بالباطل; أي كل مخاصم. وفي الصحاح: وحاقه أي خاصمه وادعى كل واحد منهما الحق; فإذا غلبه قيل حقه. ويقال للرجل إذا خاصم في صغار الأشياء: إنه لنزق الحقاق. ويقال: مال فيه حق ولا حقاق; أي خصومة. والتحاق التخاصم. والاحتقاق: الاختصام. والحاقة والحقة والحق ثلاث لغات بمعنى. وقال الكسائي والمورج: الحاقة يوم الحق. وتقول العرب: لما عرف الحقة مني هرب. والحاقة الأولى رفع بالابتداء, والخبر المبتدأ الثاني وخبره وهو \"ما الحاقة\" لأن معناها ما هي. واللفظ استفهام, معناه التعظيم والتفخيم لشأنها; كما تقول: زيد ما زيد على التعظيم لشأنه."
    },
    {
      "ayah": 20,
      "surah": 69,
      "text": "أي أيقنت وعلمت, عن ابن عباس وغيره. وقيل: أي إني ظننت أن يؤاخذني الله بسيئاتي عذبني فقد تفضل علي بعفوه ولم يؤاخذني بها. قال الضحاك: كل ظن في القرآن من المؤمن فهو يقين. ومن الكافر فهو شك. وقال مجاهد: ظن الآخرة يقين, وظن الدنيا شك. وقال الحسن في هذ الآية: إن المؤمن أحسن الظن بربه فأحسن العمل وإن المنافق أساء الظن بربه فأساء العمل."
    },
    {
      "ayah": 21,
      "surah": 69,
      "text": "أي في عيش يرضاه لا مكروه فيه. وقال أبو عبيدة والفراء: \"راضية\" أي مرضية; كقولك: ماء دافق; أي مدفوق. وقيل: ذات رضا; أي يرضى بها صاحبها. مثل لابن وتامر; أي صاحب اللبن والتمر. وفي الصحيح عن النبي صلي الله عليه وسلم (أنهم يعيشون فلا يموتون أبدا ويصحون فلا يمرضون أبدا وينعمون فلا يرون بؤسا أبدا ويشبون فلا يهرمون أبدا)."
    },
    { "ayah": 22, "surah": 69, "text": "أي عظيمة في النفوس." },
    {
      "ayah": 23,
      "surah": 69,
      "text": "أي قريبة التناول, يتناولها القائم والقاعد والمضطجع على ما يأتي بيانه في سورة \"الإنسان\". والقطوف جمع قطف (بكسر القاف) وهو ما يقطف من الثمار. والقطف (بالفتح) المصدر. والقطاف (بالفتح والكسر) وقت القطف."
    },
    { "ayah": 24, "surah": 69, "text": "أي يقال لهم ذلك." },
    {
      "ayah": 25,
      "surah": 69,
      "text": "وإذا كان الرجل رأسا في الشر, يدعو إليه ويأمر به فيكثر تبعه عليه, نودي باسمه واسم أبيه فيتقدم إلى حسابه, فيخرج له كتاب أسود بخط أسود في باطنه الحسنات وفي ظاهره السيئات, فيبدأ بالحسنات فيقرأها ويظن أنه سينجو, فإذا بلغ آخر الكتاب وجد فيه \"هذه حسناتك وقد ردت عليك\" فيسود وجهه ويعلوه الحزن ويقنط من الخير, ثم يقلب كتابه فيقرأ سيئاته فلا يزداد إلا حزنا, ولا يزداد وجهه إلا سوادا, فإذا بلغ آخر الكتاب وجد فيه \"هذه سيئاتك وقد ضوعفت عليك\" أي يضاعف عليه العذاب. ليس المعنى أنه يزاد عليه ما لم يعمل - قال - فيعظم للنار وتزرق عيناه ويسود وجهه, ويكسى سرابيل القطران ويقال له: انطلق إلى أصحابك وأخبرهم أن لكل إنسان منهم مثل هذا; ينطلق وهو يقول: \"يا ليتني لم أوت كتابيه."
    },
    {
      "ayah": 26,
      "surah": 69,
      "text": "وإذا كان الرجل رأسا في الشر, يدعو إليه ويأمر به فيكثر تبعه عليه, نودي باسمه واسم أبيه فيتقدم إلى حسابه, فيخرج له كتاب أسود بخط أسود في باطنه الحسنات وفي ظاهره السيئات, فيبدأ بالحسنات فيقرأها ويظن أنه سينجو, فإذا بلغ آخر الكتاب وجد فيه \"هذه حسناتك وقد ردت عليك\" فيسود وجهه ويعلوه الحزن ويقنط من الخير, ثم يقلب كتابه فيقرأ سيئاته فلا يزداد إلا حزنا, ولا يزداد وجهه إلا سوادا, فإذا بلغ آخر الكتاب وجد فيه \"هذه سيئاتك وقد ضوعفت عليك\" أي يضاعف عليه العذاب. ليس المعنى أنه يزاد عليه ما لم يعمل - قال - فيعظم للنار وتزرق عيناه ويسود وجهه, ويكسى سرابيل القطران ويقال له: انطلق إلى أصحابك وأخبرهم أن لكل إنسان منهم مثل هذا; ينطلق وهو يقول: \"يا ليتني لم أوت كتابيه."
    },
    { "ayah": 27, "surah": 69, "text": "يتمنى الموت." },
    { "ayah": 28, "surah": 69, "text": "يعني سلطانيه في الدنيا الذي هو الملك" },
    {
      "ayah": 29,
      "surah": 69,
      "text": "تفسير ابن عباس: هلكت عنه حجتي. وهو قول مجاهد وعكرمة والسدي والضحاك. وقال ابن زيد: يعني سلطانيه في الدنيا الذي هو الملك. وكان هذا الرجل مطاعا في أصحابه; قال الله تعالى"
    },
    {
      "ayah": 3,
      "surah": 69,
      "text": "استفهام أيضا; أي أي شيء أعلمك ما ذلك اليوم. والنبي صلي الله عليه وسلم كان عالما بالقيامة ولكن بالصفة فقيل تفخيما لشأنها: وما أدراك ما هى; كأنك لست تعلمها إذ لم تعاينها. وقال يحيى بن سلام: بلغني أن كل شيء في القرآن \"وما أدراك\" فقد أدراه إياه وعلمه. وكل شيء قال: \"وما يدريك\" فهو مما لم يعلمه. وقال سفيان بن عيينة: كل شيء قال فيه: \"وما إدراك\" فأنه أخبر به, وكل شيء قال فيه: \"وما يدريك\" فإنه لم يخبر به."
    },
    {
      "ayah": 30,
      "surah": 69,
      "text": "قيل: يبتدره مائة ألف ملك ثم تجمع يده إلى عنقه وهو قوله عز وجل: \"فغلوه\" أي شدوه بالأغلال"
    },
    { "ayah": 31, "surah": 69, "text": "أي اجعلوه يصلى الجحيم" },
    {
      "ayah": 32,
      "surah": 69,
      "text": "الله أعلم بأي ذراع, قاله الحسن. وقال ابن عباس: سبعون ذراعا بذراع الملك. وقال نوف: كل ذراع سبعون باعا, وكل باع أبعد ما بينك وبين مكة. وكان في رحبة الكوفة. وقال مقاتل: لو أن حلقة منها وضعت على ذروة جبل لذاب كما يذوب الرصاص. وقال كعب: إن حلقة من السلسلة التي قال الله تعالى ذرعها سبعون ذراعا -أن حلقة منها - مثل جميع حديد الدنيا."
    },
    {
      "ayah": 33,
      "surah": 69,
      "text": "قال الشاعر: أكفرا بعد رد الموت عني وبعد عطائك المائة الرتاعا أراد بعد إعطائك. فبين أنه عذب على ترك الإطعام وعلى الأم بالبخل, كما عذب بسبب الكفر. والحض: التحريض والحث. وأصل \"طعام\" أن يكون منصوبا بالمصدر المقدر. والطعام عبارة عن العين, وأضيف للمسكين للملابسة التي بينهما. ومن أعمل الطعام كما يعمل الإطعام فموضع المسكين نصب. والتقدير على إطعام المطعم المسكين; فحذف الفاعل وأضيف المصدر إلى المفعول."
    },
    {
      "ayah": 34,
      "surah": 69,
      "text": "أي على الإطعام, كما يوضع العطاء موضع الإعطاء. قال الشاعر: أكفرا بعد رد الموت عني وبعد عطائك المائة الرتاعا أراد بعد إعطائك. فبين أنه عذب على ترك الإطعام وعلى الأم بالبخل, كما عذب بسبب الكفر. والحض: التحريض والحث. وأصل \"طعام\" أن يكون منصوبا بالمصدر المقدر. والطعام عبارة عن العين, وأضيف للمسكين للملابسة التي بينهما. ومن أعمل الطعام كما يعمل الإطعام فموضع المسكين نصب. والتقدير على إطعام المطعم المسكين; فحذف الفاعل وأضيف المصدر إلى المفعول."
    },
    {
      "ayah": 35,
      "surah": 69,
      "text": "خبر \"ليس\" قوله: \"له\" ولا يكون الخبر قوله: \"ها هنا\" لأن المعنى يصير: ليس ها هنا طعام إلا من غسلين, ولا يصح ذلك; لأن ثم طعاما غيره. و \"ها هنا\" متعلق بما في \"له\" من معنى الفعل. والحميم ها هنا القريب. أي ليس له قريب يرق له ويدفع عنه. وهو مأخوذ من الحميم وهو الماء الحار; كأنه الصديق الذي يرق ويحترق قلبه له. والغسلين فعلين من الغسل; فكأنه ينغسل من أبدانهم, وهو صديد أهل النار السائل من جروحهم وفروجهم; عن ابن عباس. وقال الضحاك والربيع بن أنس: هو شجر يأكله أهل النار. والغسل (بالكسر): ما يغسل به الرأس من خطمي وغيره. الأخفش: ومنه الغسلين, وهو ما أنغسل من لحوم أهل النار ودمائهم. وزيد فيه الياء والنون كما زيد في عفرين. وقال قتادة: هو شر الطعام وأبشعه. ابن زيد: لا يعلم ما هو ولا الزقوم. وقال في موضع آخر: \"ليس لهم طعام إلا من ضريع\" [الغاشية: 6] يجوز أن يكون الضريع من الغسلين. وقيل: في الكلام تقديم وتأخير; والمعنى فليس له اليوم ها هنا حميم إلا من غسلين. وقيل: في الكلام تقديم وتأخير; والمعنى فليس له اليوم ها هنا حميم إلا من عسلين; ويكون الماء الحار."
    },
    { "ayah": 36, "surah": 69, "text": "\"ولا طعام\" أي وليس لهم طعام ينتفعون به." },
    {
      "ayah": 37,
      "surah": 69,
      "text": "أي المذنبون. وقال ابن عباس: يعني المشركين. وقرئ \"الخاطيون\" بإبدال الهمزة ياء, و\"الخاطون\" بطرحها. وعن ابن عباس: ما الخاطون كلنا نخطو. وروى أبو الأسود الدؤلي: ما الخاطون؟ إنما هو الخاطئون. ما الصابون إنما هو الصابئون. ويجوز أن يراد الذي يتخطون الحق إلى الباطل ويتعدون حدود الله عز وجل."
    },
    { "ayah": 38, "surah": 69, "text": "المعنى أقسم بالأشياء كلها ما ترون منها" },
    {
      "ayah": 39,
      "surah": 69,
      "text": "وما لا ترون. و\"لا\" صلة. وقيل: هو رد لكلام سبق; أي ليس الأمر كما يقوله المشركون. وقال مقاتل: سبب ذلك أن الوليد بن المغيرة قال: إن محمدا ساحر. وقال أبو جهل: شاعر. وقال عقبة: كاهن; فقال الله عز وجل: \"فلا أقسم\" أي أقسم. وقيل: \"لا\" ها هنا نفي للقسم, أي لا يحتاج في هذا إلى قسم لوضوح الحق في ذلك, وعلى هذا فجوابه كجواب القسم."
    },
    {
      "ayah": 4,
      "surah": 69,
      "text": "ذكر من كذب بالقيامة. والقارعة القيامة; سميت بذلك لأنها تقرع الناس بأهوالها. يقال: أصابتهم قوارع الدهر; أي أهواله وشدائده. ونعوذ بالله من قوارع فلان ولواذعه وقوارص لسانه; جمع قارصة وهي الكلمة المؤذية. وقوارع القرآن: الآيات التي يقرؤها الإنسان إذا فزع من الجن أو الإنس, نحو آية الكرسي; كأنها تقرع الشيطان. وقيل: القارعة مأخوذة من القرعة في رفع قوم وحط آخرين; قاله المبرد. وقيل: عنى بالقارعة العذاب الذي نزل بهم في الدنيا; وكان نبيهم يخوفهم بذلك فيكذبونه. وثمود قوم صالح; وكانت منازلهم بالحجر فيما بين الشام والحجاز. قال محمد بن إسحاق: وهو وادي القرى; وكانوا عربا. وأما عاد فقوم هود; وكانت منازلهم بالأحقاف. والأحقاف: الرمل بين عمان إلى حضر موت واليمن كله; وكانوا عربا ذوي خلق وبسطة; ذكره محمد بن إسحاق. وقد تقدم."
    },
    { "ayah": 40, "surah": 69, "text": "يعني القرآن" },
    { "ayah": 41, "surah": 69, "text": "لأنه مباين لصنوف الشعر كلها." },
    {
      "ayah": 42,
      "surah": 69,
      "text": "لأنه ورد بسب الشياطين وشتمهم فلا ينزلون شيئا على من يسبهم. و\"ما\" زائدة في قوله: \"قليلا ما تؤمنون\""
    },
    { "ayah": 43, "surah": 69, "text": "أي هو تنزيل." },
    {
      "ayah": 44,
      "surah": 69,
      "text": "\"تقول\" أي تكلف وأتى بقول من قبل نفسه. وقرئ \"ولو تقول\" على البناء للمفعول."
    },
    {
      "ayah": 45,
      "surah": 69,
      "text": "أى بالقوة والقدرة, أي لأخذناه بالقوة. و\"من\" صلة زائدة. وعبر عن القوة والقدرة باليمين لأن قوة كل شيء في ميامنه, قاله القتبي. وهو معنى قول ابن عباس ومجاهد. ومنه قول الشماخ: إذا ما راية رفعت لمجد تلقاها عرابة باليمين أي بالقوة. عرابة أسم رجل من الأنصار من الأوس. وقال آخر: ولما رأيت الشمس أشرق نورها تناولت منها حاجتي بيميني وقال السدي والحكم: \"باليمين\" بالحق. قال: تلقاها عرابة باليمين أي بالاستحقاق. وقال الحسن: لقطعنا يده اليمين. وقيل: المعنى لقبضنا بيمينه عن التصرف; قاله نفطويه. وقال أبو جعفر الطبري: إن هذا الكلام خرج مخرج الإذلال على عادة الناس في الأخذ بيد من يعاقب. كما يقول السلطان لمن يريد هوانه: خذوا يديه. أي لأمرنا بالأخذ بيده وبالغنا في عقابه."
    },
    {
      "ayah": 46,
      "surah": 69,
      "text": "يعني نياط القلب; أي لأهلكناه. وهو عرق يتعلق به القلب إذا أنقطع مات صاحبه; قال ابن عباس وأكثر الناس. قال: إذا بلغتني وحملت رحلي عرابة فأشرقي بدم الوتين وقال مجاهد: هو حبل القلب الذي في الظهر وهو النخاع; فإذا انقطع بطلت القوى ومات صاحبه. والموتون الذي قطع وتينه. وقال محمد بن كعب: إنه القلب ومراقه وما يليه. قال الكلبي: إنه عرق بين العلباء والحلقوم. والعلباء: عصب العنق. وهما علباوان بينهما ينبت العرق. وقال عكرمة: إن الوتين إذا قطع لا إن جاع عرف, ولا إن شبع عرف."
    },
    {
      "ayah": 47,
      "surah": 69,
      "text": "\"ما\" نفي و\"أحد\" في معنى الجمع, فلذلك نعته بالجمع; أي فما منكم قوم يحجزون عنه كقوله تعالى: \"لا نفرق بين أحد من رسله\" [البقرة: 285] هذا جمع, لأن \"بين\" لا تقع إلا على اثنين فما زاد. قال النبي صلي الله عليه وسلم: (لم تحل الغنائم لأحد سود الرءوس قبلكم). لفظه واحد ومعناه الجمع. و\"من\" زائدة. والحجز: المنع. و\"حاجزين\" يجوز أن يكون صفة لأحد على المعنى كما ذكرنا; فيكون في موضع جر. والخبر \"منكم\". ويجوز أن يكون منصوبا على أنه خبر و\"منكم\" ملغى, ويكون متعلقا \"بحاجزين\". ولا يمنع الفصل به من انتصاب الخبر في هذا; كما لم يمتنع الفصل به في \"إن فيك زيدا راغب\"."
    },
    { "ayah": 48, "surah": 69, "text": "يعني القرآن" },
    { "ayah": 49, "surah": 69, "text": "قال الربيع: بالقرآن." },
    {
      "ayah": 5,
      "surah": 69,
      "text": "فيه إضمار; أي بالفعلة الطاغية. وقال قتادة: أي بالصيحة الطاغية; أي المجاوزة للحد; أي لحد الصيحات من الهول. كما قال: \"إنا أرسلنا عليهم صيحة واحدة فكانوا كهشيم المحتظر\" [القمر: 31]. والطغيان: مجاوزة الحد; ومنه: \"إنا لما طغى الماء\" [الحاقة: 11] أي جاوز الحد. وقال الكلبي: بالطاغية بالصاعقة. وقال مجاهد: بالذنوب. وقال الحسن: بالطغيان; فهي مصدر كالكاذبة والعاقبة والعافية. أي أهلكوا بطغيانهم وكفرهم. وقيل: إن الطاغية عاقر الناقة; قاله ابن زيد. أي أهلكوا بما أقدم عليه طاغيتهم من عقر الناقة, وكان واحدا, وإنما هلك الجميع لأنهم رضوا بفعله ومالئوه. وقيل له طاغية كما يقال: فلان راوية الشعر, وداهية وعلامة ونسابة."
    },
    {
      "ayah": 50,
      "surah": 69,
      "text": "يعني التكذيب. والحسرة: الندامة. وقيل: أي وإن القرآن لحسرة على الكافرين يوم القيامة إذا رأوا ثواب من آمن به. وقيل: هي حسرتهم في الدنيا حين لم يقدروا على معارضته عند تحديهم أن يأتوا بسورة مثله."
    },
    {
      "ayah": 51,
      "surah": 69,
      "text": "يعني أن القرآن العظيم تنزيل من الله عزو جل; فهو لحق اليقين. وقيل: أي حقا يقينا ليكونن ذلك حسرة عليهم يوم القيامة. فعلى هذا \"وإنه لحسرة\" أي لتحسر; فهو مصدر بمعنى التحسر, فيجوز تذكيره. وقال ابن عباس: إنما هو كقولك: لعين اليقين ومحض اليقين. ولو كان اليقين نعتا لم يجز أن يضاف إليه; كما لا تقول: هذا رجل الظريف. وقيل: أضافه إلى نفسه لاختلاف اللفظين."
    },
    { "ayah": 52, "surah": 69, "text": "أي فصل لربك; قال ابن عباس. وقيل: أي نزه الله عن السوء والنقائص." },
    {
      "ayah": 6,
      "surah": 69,
      "text": "قوله تعالى: \"وأما عاد فأهلكوا بريح صرصر\" أي باردة تحرق ببردها كإحراق النار; مأخوذ من الصر وهو البرد; قال الضحاك. وقيل: إنها الشديدة الصوت. وقال مجاهد: الشديدة السموم. \"عاتية\" أي عتت على خزانها فلم تطعهم, ولم يطيقوها من شدة هبوبا; غضبت لغضب الله. وقيل: عتت على عاد فقهرتهم. روى سفيان الثوري عن موسى بن المسيب عن شهر بن حوشب عن بن عباس قال: قال رسول الله صلي الله عليه وسلم: (ما أرسل الله من نسمة من ريح إلا بمكيال ولا قطرة من ماء إلا بمكيال إلا يوم عاد ويوم نوح فإن الماء يوم نوح طغى على الخزان فلم يكن لهم عليه. سبيل - ثم قرأ - \"إنا لما طغى الماء حملناكم في الجارية\" والريح لما كان يوم عاد عتت على الخزان فلم يكن لهم عليها سبيل - ثم قرأ - \"بريح صرصر عاتية\")."
    },
    {
      "ayah": 7,
      "surah": 69,
      "text": "أي أرسلها وسلطها عليهم. والتسخير: استعمال الشيء بالاقتدار. أي متتابعة لا تفر ولا تنقطع; عن ابن عباس وابن مسعود وغيرهما. قال الفراء: الحسوم التباع, من حسم الداء إذا كوي صاحبه, لأنه يكوى بالمكواة ثم يتابع ذلك عليه. قال عبد العزيز بن زرارة الكلابي: ففرق بين بينهم زمان تتابع فيه أعوام حسوم وقال المبرد: هو من قولك حسمت الشيء إذا قطعته وفصلته عن غيره. وقيل: الحسم الاستئصال. ويقال للسيف حسام; لأنه يحسم العدو عما يريده من بلوغ عداوته. وقال الشاعر: حسام إذا قمت معتضدا به كفى العود منه البدء ليس بمعضد والمعنى أنها حسمتهم, أي قطعتهم وأذهبتهم. فهي القاطعة بعذاب الاستئصال. قال ابن زيد: حسمتهم فلم تبق منهم أحدا. وعنه أنها حسمت الليالي والأيام حتى استوعبتها. لأنها بدأت طلوع الشمس من أول يوم وانقطعت غروب الشمس من آخر يوم. وقال الليث: الحسوم الشؤم. ويقال: هذه ليالي الحسوم, أي تحسم الخير عن أهلها, وقال في الصحاح. وقال عكرمة والربيع بن أنس: مشائيم, دليله قوله تعالى: \"في أيام نحسات\" [فصلت: 16]. عطية العوفي: \"حسوما\" أي حسمت الخير عن أهلها. وأختلف في أولها, فقيل: غداة يوم الأحد, قاله السدي. وقيل: غداة يوم الجمعة, قال الربيع بن أنس. وقيل: غداة يوم الأربعاء, قاله يحيى بن سلام ووهب بن منبه. قال وهب: وهذه الأيام هي التي تسميها العرب أيام العجوز, ذات برد وريح شديدة, وكان أولها يوم الأربعاء وأخرها يوم الأربعاء; ونسبت إلى العجوز لأن عجوزا من عاد دخلت سربا فتبعتها الريح فقتلتها في اليوم الثامن. وقيل: سميت أيام العجوز لأنها وقعت في عجز الشتاء. وهي في آذار من أشهر السريانيين. ولها أسام مشهورة, وفيها يقول الشاعر وهو ابن أحمر: كسع الشتاء بسبعة غبر أيام شهلتنا من الشهر فإذا انقضت أيامها ومضت صن وصنبر مع الوبر وبآمر وأخيه مؤتمر ومعلل وبمطفئ الجمر ذهب الشتاء موليا عجلا وأتتك واقدة من النجر و\"حسوما\" نصب على الحال. وقيل على المصدر. قال الزجاج: أي تحسمهم حسوما أي تفنيهم, وهو مصدر مؤكد. ويجوز أن يكون مفعولا له; أي سخرها عليهم هذه المدة للاستئصال; أي لقطعهم واستئصالهم. ويجوز أن يكون جمع حاسم. وقرأ السدي \"حسوما\" بالفتح, حالا من الريح; أي سخرها عليهم مستأصلة."
    },
    {
      "ayah": 8,
      "surah": 69,
      "text": "أي من فرقة باقية أو نفس باقية. وقيل: من بقية. وقيل: من بقاء. فاعلة بمعنى المصدر; نحو العاقبة والعافية. ويجوز أن يكون أسما; أي هل تجد لهم أحدا باقيا. وقال ابن جريج: كانوا سبع ليال وثمانية أيام أحياء في عذاب الله من الريح, فلما أمسوا في اليوم الثامن ماتوا, فاحتملتهم الريح فألقتهم في البحر ذلك قوله عز وجل: \"فهل ترى لهم من باقية\", وقوله عز وجل: \"فأصبحوا\" لا يرى إلا مساكنهم\" [الأحقاف: 25]."
    },
    {
      "ayah": 9,
      "surah": 69,
      "text": "قرأ أبو عمرو والكسائي \"ومن قبله\" بكسر القاف وفتح الباء; أي ومن معه وتبعه من جنوده. واختاره أبو عبيد وأبو حاتم اعتبارا بقراءة عبدالله وأبي \"ومن معه\". وقرأ أبو موسى الأشعري \"ومن تلقاءه\". الباقون \"قبله\" بفتح القاف وسكون الباء; أي ومن تقدمه من القرون الخالية والأمم الماضية."
    }
  ]
}
