{
  "ayahs": [
    {
      "ayah": 1,
      "surah": 70,
      "text": "سورة المعارج وهي مكية باتفاق. وهي أربع وأربعون آية قرأ نافع وابن عامر \"سال سايل\" بغير همزة. الباقون بالهمز. فمن همز فهو من السؤال. والباء يجوز أن تكون زائدة, ويجوز أن تكون بمعنى عن. والسؤال بمعنى الدعاء; أي دعا داع بعذاب; عن ابن عباس وغيره. يقال: دعا على فلان بالويل, ودعا عليه بالعذاب. ويقال: دعوت زيدا; أي ألتمست إحضاره. أي التمس ملتمس عذابا للكافرين; وهو واقع بهم لا محالة يوم القيامة. وعلى هذا فالباء زائدة; كقوله تعالى: \"تنبت بالدهن\" [المؤمنون: 20], وقوله. \"وهزي إليك بجذع النخلة\" [مريم: 25] فهي تأكيد. أي سأل سائل عذابا واقعا."
    },
    {
      "ayah": 10,
      "surah": 70,
      "text": "أي عن شأنه لشغل كل إنسان بنفسه, قال قتادة. كما قال تعالى: \"لكل امرئ منهم يومئذ شأن يغنيه\" [عبس: 37]. وقيل: لا يسأل حميم عن حميم, فحذف الجار ووصل الفعل. وقراءة العامة \"يسأل\" بفتح الياء. وقرأ شيبة والبزي عن عاصم \"ولا يسأل بالضم على ما لم يسم فاعله, أي لا يسأل حميم عن حميمه ولا ذو قرابة عن قرابته, بل كل إنسان يسأل عن عمله. نظيره: \"كل نفس بما كسبت رهينة\" [المدثر: 38]."
    },
    {
      "ayah": 11,
      "surah": 70,
      "text": "أي يرونهم. وليس في القيامة مخلوق إلا وهو نصب عين صاحبه من الجن والإنس. فيبصر الرجل أباه وأخاه وقرابته وعشيرته ولا يسأله ولا يكلمه; لاشتغالهم بأنفسهم. وقال ابن عباس: يتعارفون ساعة ثم لا يتعارفون بعد تلك الساعة. وفي بعض الأخبار: أن أهل القيامة يفرون من المعارف مخافة المظالم. وقال ابن عباس أيضا: \"يبصرونهم\" يبصر بعضهم بعضا فيتعارفون ثم يفر بعضهم من بعض. فالضمير في \"يبصرونهم\" على هذا للكفار, والميم للأقرباء. وقال مجاهد: المعنى يبصر الله المؤمنين الكفار في يوم القيامة; فالضمير في يبصرونهم\" للمؤمنين, والهاء والميم للكفار. ابن زيد: المعنى يبصر الله الكفار في النار الذين أضلوهم في الدنيا; فالضمير في \"يبصرونهم\" للتابعين, والهاء والميم للمتبوعين. وقيل: إنه يبصر المظلوم ظالمه والمقتول قاتله. وقيل: \"يبصرونهم\" يرجع إلى الملائكة; أي يعرفون أحوال الناس فيسوقون كل فريق إلى ما يليق بهم. وتم الكلام عند قول: \"يبصرونهم\". ثم قال:"
    },
    { "ayah": 12, "surah": 70, "text": "زوجته وعشيرته." },
    { "ayah": 13, "surah": 70, "text": "أي عشيرته." },
    { "ayah": 14, "surah": 70, "text": "أي ويود لو فدي بهم لافتدى" },
    {
      "ayah": 15,
      "surah": 70,
      "text": "تقدم القول في \"كلا\" وأنها تكون بمعنى حقا, وبمعنى لا. وهي هنا تحتمل الأمرين; فإذا كانت بمعنى حقا كان تمام الكلام \"ينجيه\". وإذا كانت بمعنى لا كان تمام الكلام عليها; أي ليس ينجيه من عذاب الله الافتداء ثم قال:"
    },
    {
      "ayah": 16,
      "surah": 70,
      "text": "قرأ أبو جعفر وشيبة ونافع وعاصم في رواية أبي بكر عنه والأعمش وأبو عمرو وحمزة والكسائي \"نزاعة\" بالرفع. وروى أبو عمرو عن عاصم \"نزاعة\" بالنصب. فمن رفع فله خمسة أوجه: أحدها أن تجعل \"لظى\" خبر \"إن\" وترفع \"نزاعة\" بإضمار هي; فمن هذا الوجه يحسن الوقف على \"لظى\". والوجه الثاني أن تكون \"لظى\" و\"نزاعة\" خبران لإن. كما تقول إنه خلق مخاصم. والوجه الثالث أن تكون \"نزاعة\" بدلا من \"لظى\" و\"لظى\" خبر \"إن\". والوجه الرابع أن يكون \"لظى\" بدلا من أسم \"إن\" و\"نزاعة\" خبر \"إن\". والمعنى: أن القصة والخبر لظى نزاعة للشوى ومن نصب \"نزاعة\" حسن له أن يقف على \"لظى\" وينصب \"نزاعة\" على القطع من \"لظى\" إذ كانت نكرة متصلة بمعرفة. ويجوز نصبها على الحال المؤكدة; كما قال: \"وهو الحق مصدقا\" [البقرة: 91]. ويجوز أن تنصب على معنى أنها تتلظى نزاعة; أي في حال نزعها للشوى. والعامل فيها ما دل عليه الكلام من معنى التلظي. ويجوز أن يكون حالا; على أنه حال للمكذبين بخبرها. ويجوز نصبها عل القطع; كما تقول: مررت بزيد العاقل الفاضل. فهذه خمسة أوجه للنصب أيضا. والشوى. جمع شواة وهي جلدة الرأس. قال الأعشى: قالت قتيلة ماله قد جللت شيبا شواته وقال آخر: لأصبحت هدتك الحوادث هدة لها فشواة الرأس باد قتيرها القتير: الشيب. وفي الصحاح: \"والشوى: جمع شواة وهي جلدة الرأس\". والشوى: اليدان والرجلان والرأس من الآدميين, وكل ما ليس مقتلا. يقال: رماه فأشواه إذا لم يصب المقتل. قال الهذلي: فإن من القول التي لا شوى لها إذا زل عن ظهر اللسان انفلاتها يقول: إن من القول كلمة لا تشوي ولكن تقتل. قال الأعشى: قالت قتيلة ماله قد جللت شيبا شواته قال أبو عبيد: أنشدها أبو الخطاب الأخفش أبا عمرو بن العلاء فقال له: \"صحفت! إنما هو سراته; أي نواحيه فسكت أبو الخطاب ثم قال لنا: بل هو صحف, إنما هو شواته\". وشوى الفرس: قوائمه; لأنه يقال: عبل الشوى, ولا يكون هذا للرأس; لأنهم وصفوا الخيل بإسالة الخدين وعتق الوجه وهو رقته. والشوى: رذال المال. والشوى: هو الشيء الهين اليسير. وقال ثابت البناني والحسن: \"نزاعة للشوى\" أي لمكارم وجهه. أبو العالية: لمحاسن وجهه. قتادة: لمكارم خلقته وأطرافه. وقال الضحاك: تفري اللحم والجلد عن العظم حتى لا تترك منه شيئا. وقال الكسائي: هي المفاصل. وقال بعض الأئمة: هي القوائم والجلود. قال أمرؤ القيس: سليم الشظى عبل الشوى شنج النسا له حجبات مشرفات على الفال وقال أبو صالح: أطراف اليدين والرجلين. قال الشاعر: إذا نظرت عرفت الفخر منها وعينيها ولم تعرف شواها يعني أطرافها. وقال الحسن أيضا: الشوى الهام."
    },
    {
      "ayah": 17,
      "surah": 70,
      "text": "أي تدعو لظى من أدبر في الدنيا عن طاعة الله وتولى عن الإيمان. ودعاؤها أن تقول: إلي يا مشرك, إلي يا كافر. وقال ابن عباس: تدعو الكافرين والمنافقين بأسمائهم بلسان فصيح: إلي يا كافر, إلي يا منافق; ثم تلتقطهم كما يلتقط الطير الحب. وقال ثعلب: \"تدعو\" أي تهلك. تقول العرب: دعاك الله; أي أهلكك الله. وقال الخليل: إنه ليس كالدعاء \"تعالوا\" ولكن دعوتها إياهم تمكنها من تعذيبهم. وقيل: الداعي خزنة جهنم; أضيف دعاؤهم إليها. وقيل هو ضرب مثل; أي إن مصير من أدبر وتولى إليها; فكأنها الداعية لهم. ومثله قول الشاعر: ولقد هبطنا الواديين فواديا يدعو الأنيس به العضيض الأبكم العضيض الأبكم: الذباب. وهو لا يدعو وإنما طنينه نبه عليه فدعا إليه. قلت: القول الأول هو الحقيقة; حسب ما تقدم بيانه بآي القرآن والأخبار الصحيحة. القشيري: ودعاء لظى بخلق الحياة فيها حين تدعو, وخوارق العادة غدا كثيرة."
    },
    {
      "ayah": 18,
      "surah": 70,
      "text": "أي جمع المال فجعله في وعائه ومنع منه حق الله تعالى; فكان جموعا منوعا. قال الحكم: كان عبد الله بن عكيم لا يربط كيسه ويقول سمعت الله يقول: \"وجمع فأوعى\"."
    },
    {
      "ayah": 19,
      "surah": 70,
      "text": "يعني الكافر; عن الضحاك. والهلع في اللغة: أشد الحرص وأسوأ الجزع وأفحشه. وكذلك قال قتادة ومجاهد وغيرهما. وقد هلع (بالكسر) يهلع فهو هليع وهلوع; على التكثير. والمعنى أنه لا يصبر على خير ولا شر حتى يفعل فيهما ما لا ينبغي. عكرمة: هو الضجور. الضحاك: هو الذي لا يشبع. والمنوع: هو الذي إذا أصاب المال منع منه حق الله تعالى. وقال ابن كيسان: خلق الله الإنسان يحب ما يسره ويرضيه, ويهرب مما يكرهه ويسخطه, ثم تعبده الله بإنفاق ما يحب والصبر على ما يكره. وقال أبو عبيدة: الهلوع هو الذي إذا مسه الخير لم يشكر, وإذا مسه الضر لم يصبر; قاله ثعلب. وقال ثعلب أيضا: قد فسر الله الهلوع,"
    },
    {
      "ayah": 2,
      "surah": 70,
      "text": "أي على الكافرين. وهو النضر بن الحارث حيث قال: \"اللهم إن كان هذا هو الحق من عندك فأمطر علينا حجارة من السماء أو ائتنا بعذاب أليم\" [الأنفال: 32] فنزل سؤاله, وقتل يوم بدر صبرا هو وعقبة بن أبي معيط; لم يقتل صبرا غيرهما; قاله ابن عباس ومجاهد. وقيل: إن السائل هنا هو الحارث بن النعمان الفهري. وذلك أنه لما بلغه قول النبي صلي الله عليه وسلم في علي رضي الله عنه: (من كنت مولاه فعلي مولاه) ركب ناقته فجاء حتى أناخ راحلته بالأبطح ثم قال: يا محمد, أمرتنا عن الله أن نشهد أن لا إله إلا الله وأنك رسول الله فقبلناه منك, وأن نصلي خمسا فقبلناه منك, ونزكي أموالنا فقبلناه منك, وأن نصوم شهر رمضان في كل عام فقبلناه منك, وأن نحج فقبلناه منك, ثم لم ترض بهذا حتى فضلت ابن عمك علينا! أفهذا شيء منك أم من الله؟! فقال النبي صلي الله عليه وسلم: (والله الذي لا إله إلا هو ما هو إلا من الله) فولى الحارث وهو يقول: اللهم إن كان ما يقول محمد حقا فأمطر علينا حجارة من السماء أو ائتنا بعذاب أليم. فوالله ما وصل إلى ناقته حتى رماه الله بحجر فوقع على دماغه فخرج من دبره فقتله; فنزلت: \"سأل سائل بعذاب واقع\" الآية. وقيل: إن السائل هنا أبو جهل وهو القائل لذلك, قال الربيع. وقيل: إنه قول جماعة من كفار قريش. وقيل: هو نوح عليه السلام سأل العذاب على الكافرين. وقيل: هو رسول الله صلي الله عليه وسلم أي دعا عليه السلام بالعقاب وطلب أن يوقعه الله بالكفار; وهو واقع بهم لا محالة. وأمتد الكلام إلى قوله تعالى: \"فاصبر صبرا جميلا\" [المعارج: 5] أي لا تستعجل فإنه قريب. وإذا كانت الباء بمعنى عن - وهو قول قتادة - فكأن سائلا سأل عن العذاب بمن يقع أو متى يقع. قال الله تعالى: \"فاسأل به خبيرا\" [الفرقان: 59] أي سل عنه. وقال علقمة: فإن تسألوني بالنساء فإنني بصير بأدواء النساء طبيب أي عن النساء. ويقال: خرجنا نسأل عن فلان وبفلان. فالمعنى سألوا بمن يقع العذاب ولمن يكون فقال الله: \"للكافرين\". قال أبو علي وغيره: وإذا كان من السؤال فأصله أن يتعدى إلى مفعولين ويجوز الاقتصار على أحدهما. وإذا اقتصر على أحدهما جاز أن يتعدى إليه بحرف جر; فيكون التقدير سأل سائل النبي صلي الله عليه وسلم أو المسلمين بعذاب أو عن عذاب. ومن قرأ بغير همز فله وجهان: أحدهما: أنه لغة في السؤال وهي لغة قريش; تقول العرب: سال يسال; مثل نال ينال وخاف يخاف. والثاني: أن يكون من السيلان; ويؤيده قراءة ابن عباس \"سال سيل\". قال عبد الرحمن بن زيد: سال واد من أودية جهنم يقال له: سائل; وقول زيد بن ثابت. قال الثعلبي: والأول أحسن; كقول الأعشى في تخفيف الهمزة: سالتاني الطلاق إذ رأتاني قل مالي قد جئتماني بنكر وفي الصحاح: قال الأخفش: يقال خرجنا نسأل عن فلان وبفلان. وقد تخفف همزته فيقال: سال يسال. وقال: ومرهق سال إمتاعا بأصدته لم يستعن وحوامي الموت تغشاه المرهق: الذي أدرك ليقتل. والأصدة بالضم: قميص صغير يلبس تحت الثوب. المهدوي: من قرأ \"سال\" جاز أن يكون خفف الهمزة بإبدالها ألفا, وهو البدل على غير قياس. وجاز أن تكون الألف منقلبة عن واو على لغة من قال: سلت أسال; كخفت أخاف. النحاس: حكى سيبويه سلت أسال; مثل خفت أخاف; بمعنى سألت. وأنشد: سالت هذيل رسول الله فاحشة ضلت هذيل بما سالت ولم تصب ويقال: هما يتساولان. المهدوي: وجاز أن تكون مبدلة من ياء, من سال يسيل. ويكون سايل واديا في جهنم; فهمزة سايل على القول الأول أصلية, وعلى الثاني بدل من واو, وعلى الثالث بدل من ياء. القشيري: وسائل مهموز; لأنه إن كان من سأل بالهمز فهو مهموز, وإن كان من غير الهمز كان مهموزا أيضا; نحو قائل وخائف; لأن العين اعتل في الفعل واعتل في اسم الفاعل أيضا. ولم يكن الاعتلال بالحذف لخوف الالتباس, فكان بالقلب إلى الهمزة, ولك تخفيف الهمزة حتى تكون بين بين. \"واقع\" أي يقع بالكفار بين أنه من الله ذي المعارج."
    },
    { "ayah": 20, "surah": 70, "text": "وهو الذي إذا ناله الشر أظهر شدة الجزع" },
    {
      "ayah": 21,
      "surah": 70,
      "text": "وإذا ناله الخير بخل به ومنعه الناس. وقال النبي صلي الله عليه وسلم: (شر ما أعطي العبد شح هالع وجبن خالع). والعرب تقول: ناقة هلواعة وهلواع; إذا كانت سريعة السير خفيفة. قال: صكاء ذعلبة إذا استدبرتها حرج إذا استقبلتها هلواع الذعلب والذعلبة الناقة السريعة. و\"جزوعا\" و\"منوعا\" نعتان لهلوع. على أن ينوي بهما التقديم قبل \"إذا\". وقيل: هو خبر كان مضمرة."
    },
    {
      "ayah": 22,
      "surah": 70,
      "text": "دل على أن ما قبله في الكفار; فالإنسان اسم جنس بدليل الاستثناء الذي يعقبه كقوله تعالى: \"إن الإنسان لفي خسر. إلا الذين آمنوا\" [العصر:2-3]. النخعي: المراد بالمصلين الذي يؤدون الصلاة المكتوبة. ابن مسعود: الذين يصلونها لوقتها, فأما تركها فكفر. وقيل: هم الصحابة. وقيل: هم المؤمنون عامة, فإنهم يغلبون فرط الجزع بثقتهم بربهم ويقينهم."
    },
    {
      "ayah": 23,
      "surah": 70,
      "text": "أي على مواقيتها. وقال عقبة بن عامر: هم الذين إذا صلوا لم يلتفتوا يمينا ولا شمالا. والدائم الساكن, ومنه: نهي عن البول فى الماء الدائم, أي الساكن. وقال ابن جريج والحسن: هم الذين يكثرون فعل التطوع منها."
    },
    {
      "ayah": 24,
      "surah": 70,
      "text": "يريد الزكاة المفروضة, قاله قتادة وابن سيرين. وقال مجاهد: سوى الزكاة. وقال علي بن أبي طلحة عن ابن عباس: صلة رحم وحمل كل. والأول أصح; لأنه وصف الحق بأنه معلوم, وسوى الزكاة ليس بمعلوم, إنما هو على قدر الحاجة, وذلك يقل ويكثر."
    },
    {
      "ayah": 25,
      "surah": 70,
      "text": "\" للسائل والمحروم\" السائل الذي يسأل الناس لفاقته; قاله ابن عباس وسعيد بن المسيب وغيرهما. \"والمحروم\" الذي حرم المال. واختلف في تعيينه; فقال ابن عباس وسعيد بن المسيب وغيرهما: المحروم المحارف الذي ليس له في الإسلام سهم. وقالت عائشة رضي الله عنها: المحروم المحارف الذي لا يتيسر له مكسبه; يقال: رجل محارف بفتح الراء أي محدود محروم, وهو خلاف قولك مبارك. وقد حورف كسب فلان إذا شدد عليه في معاشه كأنه ميل برزقه عنه. وقال قتادة والزهري: المحروم المتعفف الذي لا يسأل الناس شيئا ولا يعلم بحاجته. وقال الحسن ومحمد ابن الحنفية: المحروم الذي يجيء بعد الغنيمة وليس له فيها سهم. روي أن النبي صلى الله عليه وسلم بعث سرية فأصابوا وغنموا فجاء قوم بعد ما فرغوا فنزلت هذه الآية \"وفي أموالهم\". وقال عكرمة: المحروم الذي لا يبقى له مال. وقال زيد بن أسلم: هو الذي أصيب ثمره أو زرعه أونسل ماشيته. وقال القرظي: المحروم الذي أصابته الجائحة ثم قرأ \"إن لمغرمون. بل نحن محرومون\" نظيره في قصة أصحاب الجنة حيث قالوا: \"بل نحن محرومون\" [القلم: 27] وقال أبو قلابة: كان رجل من أهل اليمامة له مال فجاء سيل فذهب بماله, فقال رجل من أصحابه: هذا المحروم فأقسموا له. وقيل: إنه الذي يطلب الدنيا وتدبر عنه. وهو يروى عن ابن عباس أيضا. وقال عبد الرحمن بن حميد: المحروم المملوك. وقيل: إنه الكلب; روي أن عمر بن عبد العزيز كان في طريق مكة, فجاء كلب فانتزع عمر رحمه الله كتف شاة فرمى بها إليه وقال: يقولون إنه المحروم. وقيل: إنه من وجبت نفقته بالفقر من ذوي الأنساب; لأنه قد حرم كسب نفسه حتى وجبت نفقته في مال غيره. وروى ابن وهب عن مالك: أنه الذي يحرم الرزق, وهذا قول حسن; لأنه يعم جميع الأقوال. وقال الشعبي: لي اليوم سبعون سنة منذ أحتلمت أسأل عن المحروم فما أنا اليوم بأعلم مني فيه يومئذ. رواه شعبة عن عاصم الأحول عن الشعبي. وأصله في اللغة الممنوع; من الحرمان وهو المنع. علقمة: ومطعم الغنم يوم الغنم مطعمه أنى توجه والمحروم محروم وعن أنس أن النبي صلى الله عليه وسلم قال: (ويل للأغنياء من الفقراء يوم القيامة يقولون ربنا ظلمونا حقوقنا التي فرضت لنا عليهم فيقول الله تعالى وعزتي وجلالي لأقربنكم ولأبعدنهم) ثم تلا رسول الله صلى الله عليه وسلم \"وفي أموالهم حق للسائل والمحروم\" ذكره الثعلبي."
    },
    { "ayah": 26, "surah": 70, "text": "أي بيوم الجزاء وهو يوم القيامة. وقد مضى في سورة \"الفاتحة\" القول فيه." },
    { "ayah": 27, "surah": 70, "text": "أي خائفون." },
    {
      "ayah": 28,
      "surah": 70,
      "text": "قال ابن عباس: لمن أشرك أو كذب أنبياءه. وقيل: لا يأمنه أحد, بل الواجب على كل أحد أن يخافه ويشفق منه."
    },
    {
      "ayah": 29,
      "surah": 70,
      "text": "قال ابن العربي: \"من غريب القرآن أن هذه الآيات العشر عامة في الرجال والنساء, كسائر ألفاظ القرآن التي هي محتملة لهم فإنها عامة فيهم, إلا قول \"والذين هم لفروجهم حافظون\" فإنما خاطب بها الرجال خاصة دون الزوجات, \"إلا على أزواجهم أو ما ملكت أيمانهم\" وإنما عرف حفظ المرأة فرجها من أدلة أخرى كآيات الإحصان عموما وخصوصا وغير ذلك من الأدلة. قلت: وعلى هذا التأويل في الآية فلا يحل لامرأة أن يطأها من تملكه إجماعا من العلماء; لأنها غير داخلة في الآية, ولكنها لو أعتقته بعد ملكها له جاز له أن يتزوجها كما يجوز لغيره عند الجمهور. وروي عن عبيد الله بن عبدالله بن عتبة والشعبي والنخعي أنها لو أعتقته حين ملكته كانا على نكاحهما. قال أبو عمر: ولا يقل هذا أحد من فقهاء الأمصار; لأن تملكها عندهم يبطل النكاح بينهما, وليس ذلك بطلاق وإنا هو فسخ للنكاح; وأنها لو أعتقته بعد ملكها له لم يراجعها إلا بنكاح جديد ولو كانت في عدة منه. الخامسة: قال محمد بن الحكم: سمعت حرملة بن عبدالعزيز قال: سألت مالكا عن الرجل يجلد عميرة, فتلا هذه الآية \"والذين هم لفروجهم حافظون\" - إلى قوله - \"العادون\". وهذا لأنهم يكنون عن الذكر بعميرة; وفيه يقول الشاعر: إذا حللت بواد لا أنيس به فاجلد عميرة لا داء ولا حرج ويسميه أهل العراق الاستمناء, وهو استفعال من المني. وأحمد بن حنبل على ورعه يجوزه, ويحتج بأنه إخراج فضلة من البدن فجاز عند الحاجة; أصله القصد والحجامة. وعامة العلماء على تحريمه. وقال بعض العلماء: إنه كالفاعل بنفسه, وهي معصية أحدثها الشيطان وأجراها بين الناس حتى صارت قيلة, ويا ليتها لم تقل; ولو قام الدليل على جوازها لكان ذو المروءة يعرض عنها لدناءتها. فإن قيل: إنها خير من نكاح الأمة; قلنا: نكاح الأمة ولو كانت كافرة على مذهب بعض العلماء خير من هذا, وإن كان قد قال به قائل أيضا, ولكن الاستمناء ضعيف في الدليل أو بالرجل الدنيء فكيف بالرجل الكبير."
    },
    {
      "ayah": 3,
      "surah": 70,
      "text": "نزل الله تعالى: \"سأل سائل بعذاب واقع\" فقال لمن هو؟ فقال للكافرين; فاللام في الكافرين متعلقة \"بواقع\". وقال الفراء: التقدير بعذاب للكافرين واقع; فالواقع من نعت العذاب واللام دخلت للعذاب لا للواقع, أي هذا العذاب للكافرين في الآخرة لا يدفعه عنهم أحد. وقيل إن اللام بمعنى على, والمعنى: واقع على الكافرين. وروي أنها في قراءة أبي كذلك. وقيل: بمعنى عن; أي ليس له دافع عن الكافرين من الله. أي ذلك العذاب من الله ذي المعارج أي ذي العلو والدرجات الفواضل والنعم; قاله ابن عباس وقتادة فالمعارج مراتب إنعامه على الخلق وقيل ذي العظمة والعلاء وقال مجاهد: هي معارج السماء. وقيل: هي معارج الملائكة; لأن الملائكة تعرج إلى السماء فوصف نفسه بذلك. وقيل: المعارج الغرف; أي إنه ذو الغرف, أي جعل لأوليائه في الجنة غرفا. وقرأ عبدالله \"ذي المعاريج\" بالياء. يقال: معرج ومعراج ومعارج ومعاريج; مثل مفتاح ومفاتيح. والمعارج الدرجات; ومنه: \"ومعارج عليها يظهرون\" [الزخرف: 33]."
    },
    { "ayah": 30, "surah": 70, "text": "قال الفراء: أي من أزواجهم اللاتي أحل الله لهم لا يجاوزون." },
    {
      "ayah": 31,
      "surah": 70,
      "text": "فسمى من نكح ما لا يحل عاديا وأوجب عليه الحد لعدوانه, واللائط عاد قرآنا ولغة, بدليل قوله تعالى: \"بل أنتم قوم عادون\" [الشعراء: 166] وكما تقدم في \"الأعراف\"; فوجب أن يقام الحد عليهم, وهذا ظاهر لا غبار عليه. فلت: فيه نظر, ما لم يكن جاهلا أو متأولا, وإن كان الإجماع منعقدا على أن قوله تعالى: \"والذين هم لفروجهم حافظون إلا على أزواجهم أو ما ملكت أيمانهم فإنهم غير ملومين\" خص به الرجال دون النساء; فقد روى معمر عن قتادة قال: تسررت امرأة غلامها; فذكر ذلك لعمر فسألها: ما حملك على ذلك؟ قالت: كنت أراه يحل لي ملك يميني كما يحل للرجل المرأة بملك اليمين; فاستشار عمر في رجمها أصحاب رسول الله صلى الله عليه وسلم فقالوا: تأولت كتاب الله عز وجل على غير تأويله, لا رجم عليها. فقال عمر: لا جرم! والله لا أحلك لحر بعده أبدا. عاقبها ط لك ودرأ الحد عنها, وأم العبد ألا يقربها. وعن أبي بكر بن عبدالله أنه سمع أباه يقول: أنا حضرت عمر ابن عبدالعزيز جاءته امرأة بغلام لها وضيء فقالت: إني استسررته فمنعني بنو عمي عن ذلك, وإنما أنا بمنزلة الرجل تكون له الوليدة فيطؤها; فإنه عني بني عمي; فقال عمر: أتزوجت قبله؟ قالت نعم; قال: أما والله لولا منزلتك من الجهالة لرجمتك بالحجارة; ولكن اذهبوا به فبيعوه إلى من يخرج به إلى غير بلدها. و \"وراء\" بممنى سوى, وهو مفعول ب \"ابتغى\" أي من طلب سوى الأزواج والولائد المملوكة له. وقال الزجاج: أي فمن ابتغى ما بعد ذلك; فمفعول الابتغاء محذوف, و \"وراء\" ظرف. و \"ذلك\" يشار به إلى كل مذكور مؤنثا كان أو مذكرا. \"فأولئك هم العادون\" أي المجاوزون الحد; من عدا أي جاوز الحد وجازه."
    },
    {
      "ayah": 32,
      "surah": 70,
      "text": "قرأ الجمهور \"لأماناتهم\" بالجمع. وابن كثير بالإفراد. والأمانة والعهد يجمع كل ما يحمله الإنسان من أمر دينه ودنياه قولا فعلا. وهذا يعم معاشرة الناس والمواعيد وغير ذلك; وغاية ذلك حفظه والقيام به. والأمانة أعم من العهد, وكل عهد فهو أمانة فيما تقدم فيه قول أو فعل أو معتقد."
    },
    {
      "ayah": 33,
      "surah": 70,
      "text": "على من كانت عليه من قريب أو بعيد, يقومون بها عند الحاكم ولا يكتمونها ولا يغيرونها. وقد مضى القول في الشهادة وأحكامها في سورة \"البقرة\". وقال ابن عباس: \"بشهاداتهم\" أن الله واحد لا شريك له وأن محمدا عبده ورسوله. وقرئ \"لأمانتهم\" على التوحيد. وهي قراءة ابن كثير وابن محيصن. فالأمانة اسم جنس, فيدخل فيها أمانات الدين, فإن الشرائع أمانات ائتمن الله عليها عباده. ويدخل فيها أمانات الناس من الودائع; وقد مضى هذا كله مستوفى في سورة \"النساء\". وقرأ عباس الدوري عن أبي عمرو ويعقوب \"بشهاداتهم\" جمعا. الباقون \"بشهادتهم\" على التوحيد, لأنها تؤدي عن الجمع. والمصدر قد يفرد وإن أضيف إلى جمع, كقوله تعالى: \"إن أنكر الأصوات لصوت الحمير\". [لقمان: 19] وقال الفراء: ويدل على أنها \"بشهادتهم\" توحيدا قوله تعالى: \"وأقيموا الشهادة لله\" [الطلاق: 2]."
    },
    {
      "ayah": 34,
      "surah": 70,
      "text": "قال قتادة: على وضوئها وركوعها وسجودها. وقال ابن جريج: التطوع. وقد مضى فى سورة \"المؤمنون\". فالدوام خلاف المحافظة. فدوامهم عليها أن يحافظوا على أدائها لا يخلون بها ولا يشتغلون عنها بشيء من الشواغل, ومحافظتهم عليها أن يراعوا إسباغ الوضوء لها ومواقيتها, ويقيموا أركانها, ويكملوها بسننها وآدابها, ويجفظوها من الإحباط باقتراب المأثم. فالدوام يرجع إلى نفس الصلوات والمحافظة إلى أحوالها."
    },
    { "ayah": 35, "surah": 70, "text": "أي أكرمهم الله فيها بأنواع الكرامات." },
    {
      "ayah": 36,
      "surah": 70,
      "text": "قال الأخفش: مسرعين. قال: بمكة أهلها ولقد أراهم إليه مهطعين إلى السماع والمعنى: ما بالهم يسرعون إليك ويجلسون حواليك ولا يعملون بما تأمرهم. وقيل: أي ما بالهم مسرعين في التكذيب لك. وقيل: أي ما بال الذين كفروا يسرعون إلى السماع منك ليعيبوك ويستهزئوا بك. وقال عطية: مهطعين: معرضين. الكلبي: ناظرين إليك تعجبا. وقال قتادة: عامدين. والمعنى متقارب; أي ما بالهم مسرعين عليك, مادين أعناقهم, مدمني النظر إليك. وذلك من نظر العدو. وهو منصوب على الحال. نزلت في جمع من المنافقين المستهزئين, كانوا يحضرونه - عليه السلام - ولا يؤمنون به. و\"قبلك\" أي نحوك."
    },
    {
      "ayah": 37,
      "surah": 70,
      "text": "أي عن يمين النبي صلي الله عليه وسلم وشماله حلقا حلقا وجماعات. والعزين: جماعات في تفرقة, قاله أبو عبيدة. ومنه حديث النبي صلي الله عليه وسلم أنه خرج على أصحابه فرأهم حلقا فقال: (مالي أراكم عزين ألا تصفون كما تصف الملائكة عند ربها - قالوا: وكيف تصف الملائكة عند ربها؟ قال: يتمون الصفوف الأول ويتراصون في الصف) خرجه مسلم وغيره. وقال الشاعر: ترانا عنده والليل داج على أبوابه حلقا عزينا أي متفرقين. وقال الراعي: أخليفة الرحمن إن عشيرتي أمسى سراتهم إليك عزينا أي متفرقين. وقال آخر: كأن الجماجم من وقعها خناطيل يهوين شتى عزينا أي متفرقين. وقال آخر: فلما أن أتين على أضاخ ضرحن حصاه أشتاتا عزينا وقال الكميت: ونحن وجندل باغ تركنا كتائب جندل شتى عزينا وقال عنترة: وقرن قد تركت لذي ولي عليه الطير كالعصب العزين وواحد عزين عزة, جمع بالواو والنون ليكون ذلك عوضا مما حذف منها. وأصلها عزهة, فاعتلت كما اعتلت سنة فيمن جعل أصلها سنهة. وقيل: أصلها عزوة, من عزاه يعزوه إذا أضافه إلى غيره. فكل واحد من الجماعات مضافة إلى الأخرى, والمحذوف منها الواو. وفي الصحاح: \"والعزة الفرقة من الناس, والهاء عوض من الياء, والجمع عزى - على فعل - وعزون وعزون أيضا بالضم, ولم يقولوا عزات كما قالوا ثبات\". قال الأصمعي: يقال في الدار عزون, أي أصناف من الناس. و \"عن اليمين وعن الشمال\" متعلق \"بمهطعين\" ويجوز أن يتعلق \"بعزين\" على حد قولك: أخذته عن زيد."
    },
    {
      "ayah": 38,
      "surah": 70,
      "text": "قال المفسرون: كان المشركون يجتمعون حول النبي صلي الله عليه وسلم ويستمعون كلامه فيكذبونه ويكذبون عليه, ويستهزئون بأصحابه ويقولون: لئن دخل هؤلاء الجنة لندخلنها قبلهم, ولئن أعطوا منها شيئا لنعطين أكثر منه; فنزلت: \"أيطعم\" الآية. وقيل: كان المستهزئون خمسة أرهط. وقرأ الحسن طلحة بن مصرف والأعرج \"أن يدخل\" بفتح الياء وضم الخاء مسمى الفاعل. ورواه المفضل عن عاصم. الباقون \"أن يدخل\" على الفعل المجهول."
    },
    { "ayah": 39, "surah": 70, "text": "لا يدخلونها." },
    {
      "ayah": 4,
      "surah": 70,
      "text": "أي تصعد في المعارج التي جعلها الله لهم. وقرأ ابن مسعود وأصحابه والسلمي والكسائي \"يعرج\" بالياء على إرادة الجمع; ولقوله: اذكروا الملائكة ولا تؤنثوهم. وقرأ الباقون بالتاء على إرادة الجماعة. \"والروح\" جبريل عليه السلام; قال ابن عباس. دليله قوله تعالى: \"نزل به الروح الأمين\" [الشعراء: 193]. وقيل: هو ملك آخر عظيم الخلقة. وقال أبو صالح: إنه خلق من خلق الله كهيئة الناس وليس بالناس. قال قبيصة بن ذؤيب: إنه روح الميت حين يقبض. \"إليه\" أي إلى المكان الذي هو محلهم وهو في السماء; لأنها محل بره وكرامته. وقيل: هو كقول إبراهيم \"إني ذاهب إلى ربي\" [الصافات: 99]. أي إلى الموضع الذي أمرني به. وقيل:"
    },
    { "ayah": 40, "surah": 70, "text": "أي أقسم. و\"لا\" صلة." },
    { "ayah": 41, "surah": 70, "text": "يقول: نقدر على إهلاكهم والذهاب بهم والمجيء بخير منهم في الفضل والطوع والمال." },
    {
      "ayah": 42,
      "surah": 70,
      "text": "أي اتركهم يخوضوا في باطلهم ويلعبوا في دنياهم; على جهة الوعيد. واشتغل أنت بما أمرت به ولا يعظمن عليك شركهم; فإن لهم يوما يلقون فيه ما وعدوا. وقرأ ابن محيصن ومجاهد وحميد \"حتى يلقوا يومهم الذي يوعدون\". وهذه الآية منسوخة بآية السيف."
    },
    {
      "ayah": 43,
      "surah": 70,
      "text": "\"يوم\" بدل من \"يومهم\" الذي قبله, وقراءة العامة \"يخرجون\" بفتح الياء وضم الراء على أنه مسمى الفاعل. وقرأ السلمي والمغيرة والأعشى عن عاصم \"يخرجون\" بضم الياء وفتح الراء على الفعل المجهول. والأجداث: القبور; وأحدها جدث. وقد مضى في سورة \"يس\". \"سراعا\" حين يسمعون الصيحة الآخرة إلى إجابة الداعي; وهو نصب على الحال \"كأنهم إلى نصب يوفضون\" قراءة العامة بفتح النون وجزم الصاد. وقرأ ابن عامر وحفص بضم النون والصاد. وقرأ عمرو بن ميمون وأبو رجاء وغيرهما بضم النون وإسكان الصاد. والنصب والنصب لغتان مثل الضعف, والضعف. الجوهري: والنصب ما نصب فعبد من دون الله, وكذلك النصب بالضم; وقد يحرك. قال الأعشى: وذا النصب المنصوب لا تنسكنه لعافية والله ربك فاعبدا أراد \"فأعبدن\" فوقف بالألف; كما تقول: رأيت زيدا. والجمع الأنصاب. وقوله: \"وذا النصب\" بمعنى إياك وذا النصب. والنصب الشر والبلاء; ومنه قوله تعالى: \"أني مسني الشيطان بنصب وعذاب\" [ص: 41]. وقال الأخفش والفراء: النصب جمع النصب مثل رهن ورهن, والأنصاب جمع نصب; فهو جمع الجمع. وقيل: النصب والأنصاب واحد. وقيل: النصب جمع نصاب, هو حجر أو صنم يذبح عليه; ومنه قوله تعالى: \"وما ذبح على النصب\" [المائدة: 3]. وقد قيل: نصب ونصب ونصب معنى واحد; كما قيل عمر وعمر وعمر. ذكره النحاس. قال ابن عباس: \"إلى نصب\" إلى غاية, وهي التي تنصب إليها بصرك. وقال الكلبي: إلى شيء منصوب; علم أو راية. وقال الحسن: كانوا يبتدرون إذا طلعت الشمس إلى نصبهم التي كانوا يعبدونها من دون الله لا يلوي أولهم على آخرهم."
    },
    { "ayah": 44, "surah": 70, "text": "أي ذليلة خاضعة, لا يرفعونها لما يتوقعونه من عذاب الله." },
    {
      "ayah": 5,
      "surah": 70,
      "text": "أي على أذى قومك. والصبر الجميل: هو الذي لا جزع فيه ولا شكوى لغير الله. وقيل: هو أن يكون صاحب المصيبة في القوم لا يدرى من هو. والمعنى متقارب. وقال ابن زيد: هي منسوخة بآية السيف."
    },
    { "ayah": 6, "surah": 70, "text": "يريد أهل مكة يرون العذاب بالنار بعيدا; أي غير كائن." },
    {
      "ayah": 7,
      "surah": 70,
      "text": "لأن ما هو آت فهو قريب. وقال الأعمش: يرون البعث بعيدا لأنهم لا يؤمنون به كأنهم يستبعدونه على جهة الإحالة. كما تقول لمن تناظره: هذا بعيد لا يكون وقيل: أي يرون هذا اليوم بعيدا \"ونراه\" أي نعلمه; لأن الرؤية إنما تتعلق بالموجود. وهو كقولك: الشافعي يرى في هذه المسألة كذا وكذا."
    },
    {
      "ayah": 8,
      "surah": 70,
      "text": "العامل في \"يوم\" \"واقع\"; تقديره يقع بهم العذاب يوم. وقيل: \"نراه\" أو \"يبصرونهم\" أو يكون بدلا من قريب. والمهل: دردي الزيت وعكره; في قول ابن عباس وغيره. وقال ابن مسعود: ما أذيب من الرصاص والنحاس والفضة. وقال مجاهد: \"كالمهل\" كقيح من دم وصديد. وقد مضى في سورة \"الدخان\", و \"الكهف\" القول فيه."
    },
    {
      "ayah": 9,
      "surah": 70,
      "text": "أي كالصوف المصبوغ. ولا يقال للصوف عهن إلا أن يكون مصبوغا. وقال الحسن: \"وتكون الجبال كالعهن\" وهو الصوف الأحمر, وهو أضعف الصوف. ومنه قول زهير: كأن فتات العهن في كل منزل نزلن به حب الفنا لم يحطم الفتات القطع. والعهن الصوف الأحمر; واحده عهنة. وقيل: العهن الصوف ذو الألوان; فشبه الجبال به في تلونها ألوانا. والمعنى: أنها تلين بعد الشدة, وتتفرق بعد الاجتماع. وقيل: أول ما تتغير الجبال تصير رملا مهيلا, ثم عهنا منفوشا, ثم هباء منبثا."
    }
  ]
}
