{
  "ayahs": [
    {
      "ayah": 1,
      "surah": 71,
      "text": "قد مضى القول في \"الأعراف\" أن نوحا عليه السلام أول رسول أرسل. ورواه قتادة عن ابن عباس عن النبي صلي الله عليه وسلم قال: (أول رسول أرسل نوح وأرسل إلى جميع أهل الأرض). فلذلك لما كفروا أغرق الله أهل الأرض جميعا. وهو نوح بن لامك بن متوشلخ بن أخنوخ وهو إدريس بن يرد بن مهلايل بن أنوش بن قينان بن شيث بن آدم عليه السلام. قال وهب: كلهم مؤمنون. أرسل إلى قومه وهو ابن خمسين سنة. وقال ابن عباس: ابن أربعين سنة. وقال عبدالله بن شداد: بعث وهو ابن ثلاثمائة وخمسين سنة. وقد مضى في سورة \"العنكبوت\" القول فيه. والحمد لله. أي بأن أنذر قومك; فموضع \"أن\" نصب بإسقاط الخافض. وقيل: موضعها جر لقوة خدمتها مع \"أن\". ويجوز \"أن\" بمعنى المفسرة فلا يكون لها موضع من الإعراب; لأن في الإرسال معنى الأمر, فلا حاجة إلى إضمار الباء. وقراءة عبدالله \"انذر قومك\" بغير \"أن\" بمعنى قلنا له أنذر قومك. وقد تقدم معنى الإنذار في أول \"البقرة\". النار في الآخرة. وقال الكلبي: هو ما نزل عليهم من الطوفان. وقيل: أي أنذرهم العذاب الأليم على الجملة إن لم يؤمنوا. فكان يدعو قومه وينذرهم فلا يرى منهم مجيبا; وكانوا يضربونه حتى يغشى عليه فيقول (رب أغفر لقومي فإنهم لا يعلمون). وقد مضى هذا مستوفى في سورة \"العنكبوت\" والحمد لله."
    },
    {
      "ayah": 10,
      "surah": 71,
      "text": "أي سلوه المغفرة من ذنوبكم السالفة بإخلاص الإيمان. وهذا منه ترغيب في التوبة. وقد روى حذيفة بن اليمان عن النبي صلي الله عليه وسلم أنه قال: (الاستغفار ممحاة للذنوب). وقال الفضيل: يقول العبد أستغفر الله; وتفسيرها أقلني."
    },
    {
      "ayah": 11,
      "surah": 71,
      "text": "أي يرسل ماء السماء; ففيه إضمار. وقيل: السماء المطر; أي يرسل المطر. قال الشاعر: إذا سقط السماء بأرض قوم رعيناه وإن كانوا غضـابا و\"مدرارا\" ذا غيث كثير. وجزم \"يرسل\" جوابا للأمر. وقال مقاتل: لما كذبوا نوحا زمانا طويلا حبس الله عنهم المطر, وأعقم أرحام نسائهم أربعين سنة; فهلكت مواشيهم وزروعهم, فصاروا إلى نوح عليه السلام واستغاثوا به. فقال \"أستغفروا ربكم إنه كان غفارا\" أي لم يزل كذلك لمن أناب إليه. ثم قال ترغيبا في الإيمان: \"يرسل السماء عليكم مدرارا. ويمددكم بأموال وبنين ويجعل لهم جنات ويجعل لكم أنهارا\". قال قتادة: علم نبي الله صلي الله عليه وسلم أنهم أهل حرص على الدنيا فقال: (هلموا إلى طاعة الله فإن في طاعة الله درك الدنيا والآخرة). الثالثة: في هذه الآية والتي في \"هود\" دليل على أن الاستغفار يستنزل به الرزق والأمطار. قال الشعبي: خرج عمر يستسقي فلم يزد على الاستغفار حتى رجع, فأمطروا فقالوا: ما رأيناك استسقيت؟ فقال: لقد طلبت المطر بمجاديح السماء التي يستنزل بها المطر; ثم قرأ: \"استغفروا ربكم إنه كان غفارا. يرسل السماء عليكم مدرارا\". وقال الأوزاعي: خرج الناس يستسقون, فقام فيهم بلال بن سعد فحمد الله وأثنى عليه, ثم قال: اللهم إنا سمعناك تقول: \"ما على المحسنين من سبيل\" التوبة: 91] وقد أقررنا بالإساءة, فهل تكون مغفرتك إلا لمثلنا؟! اللهم اغفر لنا وأرحمنا واسقنا! فرفع يديه ورفعوا أيديهم فسقوا. وقال ابن صبيح: شكا رجل إلى الحسن الجدوبة فقال له: استغفر الله. وشكا آخر إليه الفقر فقال له: استغفر الله. وقال له آخر. ادع الله أن يرزقني ولدا; فقال له: استغفر الله. وشكا إليه آخر جفاف بستانه; فقال له: استغفر الله. فقلنا له في ذلك؟ فقال: ما قلت من عندي شيئا; إن الله تعالى يقول في سورة \"نوح\": \"استغفروا ربكم إنه كان غفارا. يرسل السماء عليكم مدرارا."
    },
    {
      "ayah": 12,
      "surah": 71,
      "text": "وقد مضى في سورة \"آل عمران\" كيفية الاستغفار, وإن ذلك يكون عن إخلاص وإقلاع من الذنوب. وهو الأصل في الإجابة."
    },
    {
      "ayah": 13,
      "surah": 71,
      "text": "قيل: الرجاء هنا بمعنى الخوف; أي مالكم لا تخافون لله عظمة وقدرة على أحدكم بالعقوبة. أي أي عذر لكم في ترك الخوف من الله. وقال سعيد بن جبير وأبو العالية وعطاء بن أبي رباح: ما لكم لا ترجون لله ثوابا ولا تخافون له عقابا. وقال سعيد بن جبير عن ابن عباس: مالكم لا تخشون لله عقابا وترجون منه ثوابا. وقال الوالبي والعوفي عنه: مالكم لا تعلمون لله عظمة. وقال ابن عباس أيضا ومجاهد: مالكم لا ترون لله عظمة. وعن مجاهد والضحاك: مالكم لا تبالون لله عظمة. قال قطرب: هذه لغة حجازية. وهذيل وخزاعة ومضر يقولون: لم أرج: لم أبال. والوقار: العظمة. والتوقير: التعظيم. وقال قتادة: مالكم لا ترجون لله عاقبة; كأن المعنى مالكم لا ترجون لله عاقبة الإيمان. وقال ابن كيسان: مالكم لا ترجون في عبادة الله وطاعته أن يثيبكم على توقيركم خيرا. وقال ابن زيد: مالكم لا تؤدون لله طاعة. وقال الحسن: مالكم لا تعرفون لله حقا ولا تشكرون له نعمة. وقيل: مالكم لا توحدون الله; لأن من عظمه فقد وحده. وقيل: إن الوقار الثبات لله عز وجل; ومنه قوله تعالى: \"وقرن في بيوتكن\" [الأحزاب: 33] أي اثبتن. ومعناه مالكم لا تثبتون وحدانية الله تعالى وأنه إلهكم لا إله لكم سواه; قال ابن بحر. ثم دلهم على ذلك فقال:"
    },
    {
      "ayah": 14,
      "surah": 71,
      "text": "أي جعل لكم في أنفسكم آية تدل على توحيده. قال ابن عباس: \"أطوارا\" يعني نطفة ثم علقة ثم مضغة; أي طورا بعد طور إلى تمام الخلق, كما ذكر فى سورة \"المؤمنون\". والطور في اللغة: المرة; أي من فعل هذا وقدر عليه فهو أحق أن تعظموه. وقيل: \"أطوارا\" صبيانا, ثم شبابا, ثم شيوخا وضعفاء, ثم أقوياء. وقيل: أطوارا أي أنواعا: صحيحا وسقيما, وبصيرا وضريرا, وغنيا وفقيرا. وقيل: إن \"أطوارا\" أختلافهم في الأخلاق والأفعال."
    },
    {
      "ayah": 15,
      "surah": 71,
      "text": "ذكر لهم دليلا آخر; أي ألم تعلموا أن الذي قدر على هذا, فهو الذي يجب أن يعبد ومعنى \"طباقا\" بعضها فوق بعض, كل سماء مطبقة على الأخرى كالقباب; قاله ابن عباس والسدي. وقال الحسن: خلق الله سبع سموات طباقا على سبع أرضين, بين كل أرض وأرض, وسماء وسماء خلق وأمر. وقوله: \"ألم تروا\" على جهة الإخبار لا المعاينة; كما تقول: ألم ترني كيف صنعت بفلان كذا. وطباقا\" نصب على أنه مصدر; أي مطابقة طباقا. أو حال بمعنى ذات طباق; فحذف ذات وأقام طباقا مقامه."
    },
    {
      "ayah": 16,
      "surah": 71,
      "text": "أي في سماء الدنيا; كما يقال: أتاني بنو تميم وأتيت بني تميم والمراد بعضهم; قاله الأخفش. قال ابن كيسان: إذا كان في إحداهن فهو فيهن. وقال قطرب: \"فيهن\" بمعنى معهن; وقاله الكلبي. أي خلق الشمس والقمر مع خلق السموات والأرض. وقال جلة أهل اللغة في قول امرئ القيس: وهل ينعمن من كان أخر عهده ثلاثين شهرا في ثلاثة أحوال \"في\" بمعنى مع. النحاس: وسألت أبا الحسن بن كيسان عن هذه الآية فقال: جواب النحويين أنه إذا جعله في إحداهن فقد جعله فيهن; كما تقول: أعطني الثياب المعلمة وإن كنت إنما أعلمت أحدها. وجواب آخر: أنه يروى أن وجه القمر إلى السماء, وإذا كان إلى داخلها فهو متصل بالسموات, ومعنى \"نورا\" أي لأهل الأرض; قاله السدي. وقال عطاء: نورا لأهل السماء والأرض. وقال ابن عباس وابن عمر: وجهه يضيء لأهل الأرض وظهره يضيء لأهل السماء. يعني مصباحا لأهل الأرض ليتوصلوا إلى التصرف لمعايشهم. وفي إضاءتها لأهل السماء القولان الأولان حكاه الماوردي. وحكى القشيري عن ابن عباس أن الشمس وجهها في السموات وقفاها في الأرض. وقيل: على العكس. وقيل لعبد الله بن عمر: ما بال الشمس تقلينا أحيانا وتبرد علينا أحيانا؟ فقال: إنها في الصيف في السماء الرابعة, وفي الشتاء في السماء السابعة عند عرش الرحمن; ولو كانت في السماء الدنيا لما قام لها شيء."
    },
    {
      "ayah": 17,
      "surah": 71,
      "text": "يعني آدم عليه السلام خلقه من أديم الأرض كلها; قاله ابن جريج. وقد مضى في سورة \"الأنعام والبقرة\" بيان ذلك. وقال خالد بن معدان: خلق الإنسان من طين; فإنما تلين القلوب في الشتاء. و\"نباتا\" مصدر على غير المصدر; لأن مصدره أنبت إنباتا, فجعل الاسم الذي هو النبات في موضع المصدر. وقد مضى بيانه في سورة \"آل عمران\" وغيرها. وقيل: هو مصدر محمول على المعنى; لأن معنى: \"أنبتكم\" جعلكم تنبتون نباتا; قال الخليل والزجاج. وقيل: أي أنبت لكم من الأرض النبات. \"فنباتا\" على هذا نصب على المصدر الصريح. والأول أظهر. وقال ابن جريج: أنبتهم في الأرض بالكبر بعد الصغر وبالطول بعد القصر."
    },
    { "ayah": 18, "surah": 71, "text": "أي عند موتكم بالدفن. بالنشور للبعث يوم القيامة." },
    { "ayah": 19, "surah": 71, "text": "أي مبسوطة." },
    { "ayah": 2, "surah": 71, "text": "أي مخوف. أي مظهر لكم بلسانكم الذي تعرفونه." },
    {
      "ayah": 20,
      "surah": 71,
      "text": "السبل: الطرق. والفجاج جمع فج, وهو الطريق الواسعة; قاله الفراء. وقيل: الفج المسلك بين الجبلين. وقد مضى في سورة \"الأنبياء والحج\"."
    },
    {
      "ayah": 21,
      "surah": 71,
      "text": "شكاهم إلى الله تعالى, وأنهم عصوه ولم يتبعوه فيما أمرهم به من الإيمان. وقال أهل التفسير: لبث فيهم ألف سنة إلا خمسين عاما داعيا لهم وهم على كفرهم وعصيانهم. قال ابن عباس: رجا نوح عليه السلام الأبناء بعد الآباء; فيأتي بهم الولد بعد الولد حتى بلغوا سبع قرون, ثم دعا عليهم بعد الإياس منهم, وعاش بعد الطوفان ستين عاما حتى كثر الناس وفشوا. قال الحسن: كان قوم نوح يزرعون في الشهر مرتين; حكاه الماوردي. \"واتبعوا من لم يزده ماله وولده إلا خسارا\" يعني كبراءهم وأغنياءهم الذين لم يزدهم كفرهم وأموالهم وأولادهم إلا ضلالا في الدنيا وهلاكا في الآخرة. وقرأ أهل المدنية والشام وعاصم \"وولده\" بفتح الواو واللام. الباقون \"ولده\" بضم الواو وسكون اللام وهي لغة في الولد. ويجوز أن يكون جمعا للولد, كالفلك فإنه واحد وجمع. وقد تقدم."
    },
    {
      "ayah": 22,
      "surah": 71,
      "text": "أي كبيرا عظيما. يقال: كبير وكبار وكبار, مثل عجيب وعجاب وعجاب بمعنى, ومثله طويل وطوال وطوال. يقال: رجل حسن وحسان, وجميل وجمال, وقراء للقارئ, ووضاء للوضيء. وأنشد ابن السكيت: بيضاء تصطاد القلوب وتستبي بالسحن قلب المسلم القراء وقال آخر: والمرء يلحقه بفتيان الندى خلق الكريم وليس بالوضاء وقال المبرد: \"كبارا\" (بالتشديد) للمبالغة. وقرأ ابن محيصن وحميد ومجاهد \"كبارا\" بالتخفيف. وأختلف في مكرهم ما هو؟ فقيل: تحريشهم سفلتهم على قتل نوح. وقيل: هو تعزيرهم الناس بما أوتوا من الدنيا والولد; حتى قالت الضعفة: لولا أنهم على الحق لما أوتوا هذه النعم. وقال الكلبي: هو ما جحلوه لله من الصاحبة والولد. وقيل: مكرهم كفرهم. وقال مقاتل: هو قول كبرائهم لأتباعهم: \"لا تذرن ألهتكم ولا تذرن ودا ولا سواعا ولا يغوث ويعوق ونسرا\"."
    },
    {
      "ayah": 23,
      "surah": 71,
      "text": "قال ابن عباس وغيره: هي أصنام وصور, كان قوم نوح يعبدونها ثم عبدتها العرب وهذا قول الجمهور. وقيل: إنها للعرب لم يعبدها غيرهم. وكانت أكبر أصنامهم وأعظمها عندهم; فلذلك خصوها بالذكر بعد قوله تعالى: \"لا تذرن آلهتكم\". ويكون معنى الكلام كما قال قوم نوح لأتباعهم: \"لا تذرن ألهتكم\" قالت العرب لأولادهم وقومهم: لا تذرن ودا ولا سواعا ولا يغوث ويعوق ونسرا; ثم عاد بالذكر بعد ذلك إلى قوم نوح عليه السلام. وعلى القول الأول, الكلام كله منسوق في قوم نوح. وقال عروة بن الزبير وغيره: اشتكى آدم عليه السلام وعنده بنوه: ود, وسواع, ويغوث, ويعوق, ونسر. وكان ود أكبرهم وأبرهم به. قال محمد بن كعب: كان لآدم عليه السلام خمس بنين: ود وسواع ويغوث ويعوق ونسر; وكانوا عبادا فمات واحد منهم فحزنوا عليه; فقال الشيطان: أنا أصور لكم مثله إذا نظرتم إليه ذكرتموه. قالوا: أفعل. فصوره في المسجد من صفر ورصاص. ثم مات آخر, فصوره حتى ماتوا كلهم فصورهم. وتنقصت الأشياء كما تتنقص اليوم إلى أن تركوا عبادة الله تعالى بعد حين. فقال لهم الشيطان: مالكم لا تعبدون شيئا؟ قالوا: وما نعبد؟ قال: آلهتكم وآلهة آبائكم, ألا ترون في مصلاكم. فعبدوها من دون الله; حتى بعث الله نوحا فقالوا: {لا تذرن آلهتكم ولا تذرن ودا ولا سواعا\" الآية. وقال محمد بن كعب أيضا ومحمد بن قيس: بل كانوا قوما صالحين بين آدم ونوح, وكان لهم تبع يقتدون بهم, فلما ماتوا زين لهم إبليس أن يصوروا صورهم ليتذكروا بها اجتهادهم, وليتسلوا بالنظر إليها; فصورهم. فلما ماتوا هم وجاء آخرون قالوا: ليت شعرنا هذه الصور ما كان آباؤنا يصنعون بها؟ فجاءهم الشيطان فقال: كان آباؤكم يعبدونها فترحمهم وتسقيهم المطر. فعبدوها فابتدئ عبادة الأوثان من ذلك الوقت. قلت: وبهذا المعنى فسر ما جاء في صحيح مسلم من حديث عائشة: أن أم حبيبة وأم سلمة ذكرتا كنيسة رأينها بالحبشة تسمى مارية, فيها تصاوير لرسول الله صلي الله عليه وسلم; فقال رسول الله صلي الله عليه وسلم: (إن أولئك إذا كان فيهم الرجل الصالح فمات بنوا على قبره مسجدا وصوروا فيه تلك الصور أولئك شرار الخلق عند الله يوم القيامة). وذكر الثعلبي عن ابن عباس قال: هذه الأصنام أسماء رجال صالحين من قوم نوح; فلما هلكوا أوحى الشيطان إلى قومهم أن أنصبوا في مجالسهم التي كانوا يجلسون فيها أنصابا وسموها بأسمائهم تذكروهم بها; ففعلوا, فلم تعبد حتى إذا هلك أولئك ونسخ العلم عبدت من دون الله. وذكر أيضا عن ابن عباس: أن نوحا عليه السلام, كان يحرس جسد آدم عليه السلام على جبل بالهند, فيمنع الكافرين أن يطوفوا بقبره; فقال لهم الشيطان: إن هؤلاء يفخرون عليكم ويزعمون أنهم بنو آدم دونكم, وإنما هو جسد, وأنا أصور لكم مثله تطوفون به; فصور لهم هذه الأصنام الخمسة وحملهم على عبادتها. فلما كان أيام الطوفان دفنها الطين والتراب والماء; فلم تزل مدفونة حتى أخرجها الشيطان لمشركي العرب. قال الماوردي: فأما ود فهو أول صنم معبود, سمي ودا لودهم له; وكان بعد قوم نوح لكلب بدومة الجندل; في قول ابن عباس وعطاء ومقاتل. وفيه يقول شاعرهم: حياك ود فإنا لا يحل لنا لهو النساء وإن الدين قد عزما وأما سواع فكان لهذيل بساحل البحر; في قولهم. وأما يغوث فكان لغطيف من مراد بالجوف من سبأ; في قول قتادة. وقال المهدوي. لمراد ثم لغطفان. الثعلبي: وأخذت أعلى وأنعم - وهما من طيء - وأهل جرش من مذحج يغوث فذهبوا به إلى مراد فعبدوه زمانا. ثم إن بني ناجية أرادوا نزعه من أعلى وأنعم, ففروا به إلى الحصين أخي بن الحارث بن كعب من خزاعة. وقال أبو عثمان النهدي: رأيت يغوث وكان من رصاص, وكانوا يحملونه على جمل أحرد, ويسيرون معه ولا يهيجونه حتى يكون هو الذي يبرك, فإذا برك نزلوا وقالوا: قد رضي لكم المنزل; فيضربون عليه بناء ينزلون حوله. وأما يعوق فكان لهمدان ببلخع; في قول عكرمة وقتادة وعطاء. ذكره الماوردي. وقال الثعلبي: وأما يعوق فكان لكهلان من سبأ, ثم توارثه بنوه; الأكبر فالأكبر حتى صار إلى همدان. وفيه يقول مالك بن نمط الهمداني: يريش الله في الدنيا ويبري ولا يبري يعوق ولا يريش وأما نسر فكان لذي الكلاع من حمير; في قول قتادة, ونحوه عن مقاتل. وقال الواقدي: كان ود على صورة رجل, وسواع على صورة امرأة, ويغوث على صورة أسد, ويعوق على صورة فرس, ونسر على صورة نسر من الطير; فالله أعلم. وقرأ نافع \"ولا تذرن ودا\" بضم الواو. وفتحها الباقون. قال الليث: ود (بفتح الواو) صنم كان لقوم نوح. وود (بالضم) صنم لقريش; وبه سمي عمرو بن ود. وفي الصحاح: والود (بالفتح) الوتد في لغة أهل, نجد; كأنهم سكنوا التاء وأدغموها في الدال. والود في قول أمرئ القيس: تظهر الود إذا ما أشجذت وتواريه إذا ما تعتكر قال ابن دريد: هو اسم جبل: وود صنم كان لقوم نوح عليه السلام ثم صار لكلب وكان بدومة الجندل; ومنه سموه عبد ود وقال: \"لا تذرن آلهتكم\" ثم قال: \"ولا تذرون ودا ولا سواعا\" الآية. خصها بالذكر; لقوله تعالى: \"وإذ أخذنا من النبيين ميثاقهم ومنك ومن نوح\" [الأحزاب: 7]."
    },
    {
      "ayah": 24,
      "surah": 71,
      "text": "هذا من قول نوح; أي أضل كبراؤهم كثيرا من أتباعهم; فهو عطف على قوله: \"ومكروا مكرا كبارا\". وقيل: إن الأصنام \"أضلوا كثيرا\" أي ضل بسببها كثير; نظيره قول إبراهيم: \"رب إنهن أضللن كثيرا من الناس\" [إبراهيم: 36] فأجرى عليهم وصف ما يعقل; لاعتقاد الكفار فيهم ذلك. أي عذابا; قاله ابن بحر. وأستشهد بقوله تعالى: \"إن المجرمين في ضلال وسعر\" [القمر: 47]. وقيل إلا خسرانا. وقيل إلا فتنة بالمال والولد. وهو محتمل."
    },
    {
      "ayah": 25,
      "surah": 71,
      "text": "\"ما\" صلة مؤكدة; والمعنى من خطاياهم وقال الفراء: المعنى من أجل خطاياهم; فأدت \"ما\" هذا المعنى. قال: و\"ما\" تدل على المجازاة. وقراءة أبي عمرو \"خطاياهم\" على جمع التكسير; الواحدة خطية. وكان الأصل في الجمع خطائي على فعائل; فلما أجتمعت الهمزتان قلبت الثانية ياء, لأن قبلها كسرة ثم أستثقلت والجمع ثقيل, وهو معتل مع ذلك; فقلبت الياء ألفا ثم قلبت الهمزة الأولى ياء لخفائها بين الألفين. الباقون \"خطيئاتهم\" على جمع السلامة. قال أبو عمرو: قوم كفروا ألف سنة فلم يكن لهم إلا خطيات; يريد أن الخطايا أكثر من الخطيات. وقال قوم: خطايا وخطيات واحد; جمعان مستعملان في الكثرة والقلة; واستدلوا بقوله تعالى: \"ما نفدت كلمات الله\" [لقمان: 27] وقال الشاعر: لنا الجفنات الغر يلمعن بالضحى وأسيافنا يقطرن من نجدة دما وقرئ \"خطيئاتهم\" و\"خطياتهم\" بقلب الهمزة ياء وإدغامها. وعن الجحدري وعمرو بن عبيد والأعمش وأبي حيوة وأشهب العقيلي \"خطيئتهم\" على التوحيد, والمراد الشرك. أي بعد إغراقهم. قال القشيري: وهذا يدل على عذاب القبر. ومنكروه يقولون: صاروا مستحقين دخول النار, أو عرض عليهم أماكنهم من النار; كما قال تعالى: \"النار يعرضون عليها غدوا وعشيا\" [غافر: 46]. وقيل: أشاروا إلى ما فى الخبر من قوله: (البحر نار فن نار). وروى أبو روق عن الضحاك في قوله تعالى: \"أغرقوا فأدخلوا نارا\" قال: يعني عذبوا بالنار في الدنيا مع الغرق في الدنيا في حالة واحدة; كانوا يغرقون في جانب ويحترقون في الماء من جانب. ذكره الثعلبي قال: أنشدنا أبو القاسم الحبيبي قال أنشدنا أبو سعيد أحمد بن محمد بن رميح قال أنشدني أبو بكر بن الأنباري: الخلق مجتمع طورا ومفترق والحادثات فنون ذات أطوار لا تعجبن لأضداد إن أجتمعت فالله يجمع بين الماء والنار أي من يدفع عنهم العذاب."
    },
    {
      "ayah": 26,
      "surah": 71,
      "text": "الأولى: دعا عليهم حين يئس من أتباعهم إياه. وقال قتادة: دعا عليهم بعد أن أوحى الله إليه: \"أنه لن يؤمن من قومك إلا من قد آمن\" [هود: 36] فأجاب الله دعوته وأغرق أمته; وهذا كقول النبي صلي الله عليه وسلم: (اللهم منزل الكتاب سريع الحساب وهازم الأحزاب أهزمهم وزلزلهم). وقيل: سبب دعائه أن رجلا من قومه حمل ولدا صغيرا على كتفه فمر بنوح فقال: (احذر هذا فإنه يضلك). فقال: يا أبت أنزلني; فأنزله فرماه فشجه; فحينئذ غضب ودعا عليهم. وقال محمد بن كعب ومقاتل والربيع وعطية وابن زيد: إنما قال هذا حينما أخرج الله كل مؤمن من أصلابهم وأرحام نسائهم. وأعقم أرحام النساء وأصلاب الرجال قبل العذاب بسبعين سنة. وقيل: بأربعين. قال قتادة: ولم يكن فيهم صبي وقت العذاب. وقال الحسن وأبو العالية: لو أهلك الله أطفالهم معهم كان عذابا من الله لهم وعدلا فيهم; ولكن الله أهلك أطفالهم وذريتهم بغير عذاب, ثم أهلكهم بالعذاب; بدليل قوله تعالى: \"وقوم نوح لما كذبوا الرسل أغرقناهم\" [الفرقان: 37]. الثانية: قال ابن العربي: \"دعا نوح على الكافرين أجمعين, ودعا النبي صلي الله عليه وسلم على من تحزب على المؤمنين وألب عليهم. وكان هذا أصلا في الدعاء على الكافرين في الجملة, فأما كافر معين لم تعلم خاتمته فلا يدعى عليه; لأن مآله عندنا مجهول, وربما كان عند الله معلوم الخاتمة بالسعادة. وإنما خص النبي صلي الله عليه وسلم بالدعاء عتبة وشيبة وأصحابهما; لعلمه بمآلهم وما كشف له من الغطاء عن حالهم. والله أعلم\". قلت: قد مضت هذه المسألة مجودة في سورة \"البقرة\" والحمد لله. الثالثة: قال ابن العربي: \"إن قيل لم جعل نوح دعوته على قومه سببا لتوقفه عن طلب الشفاعة للخلق من الله في الآخرة؟ قلنا قال الناس في ذلك وجهان: أحدهما: أن تلك الدعوة نشأت عن غضب وقسوة; والشفاعة تكون عن رضا ورقة, فخاف أن يعاتب ويقال: دعوت على الكفار بالأمس وتشفع لهم اليوم. الثاني: أنه دعا غضبا بغير نص ولا إذن صريح في ذلك; فخاف الدرك فيه يوم القيامة; كما قال موسى عليه السلام: (إني قتلت نفسا لم أومر بقتلها). قال: وبهذا أقول\". قلت: وإن كان لم يؤمر بالدعاء نصا فقد قيل له: \"أنه لن يؤمن من قومك إلا من قد آمن\" [هود: 36]. فأعلم عواقبهم فدعا عليهم بالهلاك; كما دعا نبينا صلي الله عليه وسلم على شيبة وعتبة ونظرائهم فقال: (اللهم عليك بهم) لما أعلم عواقبهم; وعلى هذا يكون فيه معنى الأم بالدعاء. والله أعلم. أي من يسكن الديار; قاله السدي. وأصله ديوار على فيعال من دار يدور; فقلبت الواو ياء وأدغمت إحداهما في الأخرى. مثل القيام; أصله قيوام. ولو كان فعالا لكان دوارا. وقال القتبي: أصله من الدار; أي نازل بالدار. يقال: ما بالدار ديار; أي أحد. وقيل: الديار صاحب الدار."
    },
    {
      "ayah": 27,
      "surah": 71,
      "text": "إنك إن تذرهم يضلوا عبادك ولا يلدوا إلا فاجرا كفاراوقوله تعالى \" إنك إن تذرهم يضلوا عبادك\" أي إنك إن أبقيت منهم أحدا أضلوا عبادك أي الذين تخلقهم بعدهم \" ولا يلدوا إلا فاجرا كفارا\" أي فاجرا في الأعمال كافر القلب وذلك لخبرته بهم ومكثه بين أظهرهم ألف سنة إلا خمسين عاما."
    },
    {
      "ayah": 28,
      "surah": 71,
      "text": "دعا لنفسه ولوالديه وكانا مؤمنين. وهما: لمك بن متوشلخ وشمخى بنت أنوش; ذكره القشيري والثعلبي. وحكى الماوردي في أسم أمه منجل. وقال سعيد بن جبير: أراد بوالديه أباه وجده. وقرأ سعيد بن جبير \"لوالدي\" بكسر الدال على الواحد. قال الكلبي: كان بينه وبين آدم عشرة آباء كلهم مؤمنون. وقال ابن عباس: لم يكفر لنوح والد فيما بينه وبين آدم عليهما السلام. أى مسجدي ومصلاي مصليا صدقا بالله. وكان إنما يدخل بيوت الأنبياء من آمن منهم فجعل المسجد سببا للدعاء بالغفرة. وقد قال النبي. صلي الله عليه وسلم: (الملائكة تصلي على أحدكم ما دام في مجلسه الذي صلي فيه ما لم يحدث فيه تقول اللهم أغفر له اللهم أرحمه) الحديث. وقد تقدم. وهذا قول ابن عباس: \"بيتي\" مسجدي; حكاه الثعلبي وقاله الضحاك. وعن ابن عباس أيضا: أي ولمن دخل ديني; فالبيت بمعنى الدين; حكاه القشيري وقاله جويبر. وعن ابن عباس أيضا: يعني صديقي الداخل إلى منزلي; حكاه الماوردي. وقيل: أراد داري. وقيل سفينتي. عامة إلى يوم القيامة; قال الضحاك. وقال الكلبي: من أمة محمد صلي الله عليه وسلم. وقيل: من قومه; والأول أظهر. أي الكافرين. إلا هلاكا; فهي عامة في كل كافر ومشرك. وقيل: أراد مشركي قومه. والتبار: الهلاك. وقيل: الخسران; حكاهما السدي. ومنه قوله تعالى: \"إن هؤلاء متبر ما هم فيه\" [الأعراف: 139]. وقيل: التبار الدمار; والمعنى واحد. والله أعلم بذلك. وهو الموفق للصواب."
    },
    {
      "ayah": 3,
      "surah": 71,
      "text": "و\"أن\" المفسرة على ما تقدم في \"أن أنذر\". \"اعبدوا\" أي وحدوا. واتقوا: خافوا. أي فيما آمركم به, فإني رسول الله إليكم."
    },
    {
      "ayah": 4,
      "surah": 71,
      "text": "جزم \"يغفر\" بجواب الأمر. و\"من\" صلة زائدة. ومعنى الكلام يغفر لكم ذنوبكم, قاله السدي. وقيل: لا يصح كونها زائدة; لأن \"من\" لا تزاد في الواجب, وإنما هي هنا للتبعيض, وهو بعض الذنوب, وهو ما لا يتعلق بحقوق المخلوقين. وقيل: هي لبيان الجنس. وفيه بعد, إذ لم يتقدم جنس يليق به. وقال زيد بن أسلم: المعنى يخرجكم من ذنوبكم. ابن شجرة: المعنى يغفر لكم من ذنوبكم ما استغفرتموه منها قال ابن عباس: أي ينسئ في أعماركم. ومعناه أن الله تعالى كان قضى قبل خلقهم أنهم إن آمنوا بارك في أعمارهم, وإن لم يؤمنوا عوجلوا بالعذاب. وقال مقاتل: يؤخركم إلى منتهى آجالكم في عافية; فلا يعاقبكم بالقحط وغيره. فالمعنى على هذا يؤخركم من العقوبات (الشدائد إلى آجالكم. وقال: الزجاج أي يؤخركم عن العذاب فتموتوا غير موتة المستأصلين بالعذاب. وعلى هذا قيل: \"أجل مسمى\" عندكم تعرفونه, لا يميتكم غرقا ولا حرقا ولا قتلا; ذكره الفراء. وعلى القول الأول \"أجل مسمى\" عند الله. أي إذا جاء الموت لا يؤخر بعذاب كان أو بغير عذاب. وأضاف الأجل إليه سبحانه لأنه الذي أثبته. وقد يضاف إلى القوم, كقوله تعالى: \"فإذا جاء أجلهم\" [النحل: 61] لأنه مضروب لهم. و بمعنى \"إن\" أي إن كنتم تعلمون. وقال الحسن: معناه لو كنتم تعلمون لعلمتم أن أجل الله إذا جاءكم لم يؤخر."
    },
    { "ayah": 5, "surah": 71, "text": "أي سرا وجهرا. وقيل: أي واصلت الدعاء." },
    {
      "ayah": 6,
      "surah": 71,
      "text": "أي تباعدا من الإيمان. وقراءة العامة بفتح الياء من \"دعائي\" وأسكنها الكوفيون ويعقوب والدوري عن أبي عمرو."
    },
    {
      "ayah": 7,
      "surah": 71,
      "text": "أي إلى سبب المغفرة, وهي الإيمان بك والطاعة لك. لئلا يسمعوا دعائي أي غطوا بها وجوههم لئلا يروه. وقال ابن عباس: جعلوا ثيابهم على رءوسهم لئلا يسمعوا كلامه. فاستغشاء الثياب إذا زيادة في سد الآذان حتى لا يسمعوا, أو لتنكيرهم أنفسهم حتى يسكت أو ليعرفوه إعراضهم عنه. وقيل: هو كناية عن العداوة. يقال: لبس لي فلان ثياب العداوة. أي على الكفر فلم يتوبوا. عن قبول الحق; لأنهم قالوا: \"أنؤمن لك واتبعك الأرذلون\" [الشعراء: 111]. تفخيم."
    },
    {
      "ayah": 8,
      "surah": 71,
      "text": "أي مظهرا لهم الدعوة. وهو منصوب \"بدعوتهم\" نصب المصدر; لأن الدعاء أحد نوعيه الجهار, فنصب به نصب القرفصاء بقعد; لكونها أحد أنواع القعود, أو لأنه أراد \"بدعوتهم\" جاهرتهم. ويجوز أن يكون صفة لمصدر دعا; أي دعاء جهارا; أي مجاهرا به. ويكون مصدرا في موضع الحال; أي دعوتهم مجاهرا لهم بالدعوة."
    },
    {
      "ayah": 9,
      "surah": 71,
      "text": "أي لم أبق مجهودا. وقال مجاهد: معنى أعلنت: صحت, \"وأسررت لهم إسرارا\". بالدعاء عن بعضهم من بعض. وقيل: \"أسررت لهم\" أتيتهم في منازلهم. وكل هذا من نوح عليه السلام مبالغة في الدعاء لهم, وتلطف في الاستدعاء. وفتح الياء من \"إني أعلنت لهم\" الحرميون وأبو عمرو. وأسكن الباقون."
    }
  ]
}
