{
  "ayahs": [
    {
      "ayah": 1,
      "surah": 72,
      "text": "يقول تعالى آمرا رسوله صلى الله عليه وسلم أن يخبر قومه أن الجن استمعوا القرآن فآمنوا به وصدقوه وانقادوا له فقال تعالى \"قل أوحى إلي أنه استمع نفر من الجن فقالوا إنا سمعنا قرآنا عجبا."
    },
    {
      "ayah": 10,
      "surah": 72,
      "text": "أي ما ندري هذا الأمر الذي قد حدث في السماء لا ندري أشر أريد بمن في الأرض أم أراد بهم ربهم رشدا وهذا من أدبهم في العبارة حيث أسندوا الشر إلى غير فاعل والخير أضافوه إلى الله عز وجل وقد ورد في الصحيح \"الشر ليس إليك\" وقد كانت الكواكب يرمى بها قبل ذلك ولكن ليس بكثير بل في الأحيان بعد الأحيان كما في حديث العباس بينما نحن جلوس مع رسول الله صلى الله عليه وسلم إذ رمى بنجم فاستنار فقال \"ما كنتم تقولون في هذا؟ فقلنا كنا نقول يولد عظيم يموت عظيم فقال \"ليس كذلك ولكن الله إذا قضى الأمر في السماء\" وذكر تمام الحديث وفد أوردناه في سورة سبأ بتمامه وهذا هو السبب الذي حملهم على تطلب السبب في ذلك فأخذوا يضربون مشارق الأرض ومغاربها فوجدوا رسول الله صلى الله عليه وسلم يقرأ بأصحابه في الصلاة فعرفوا أن هذا هو الذي حفظت من أجله السماء فآمن من آمن منهم وتمرد في طغيانه من بقي كما تقدم حديث ابن عباس في ذلك عند قوله في سورة الأحقاف \"وإذ صرفنا إليك نفرا من الجن يستمعون القرآن\" الآية ولا شك أنه لما حدث هذا الأمر وهو كثرة الشهب في السماء والرمي بها هال ذلك الإنس والجن وانزعجوا له وارتاعوا لذلك وظنوا أن ذلك لخراب العالم كما قال السدي لم تكن السماء تحرس إلا أن يكون في الأرض نبي أو دين لله ظاهر فكانت الشياطين قبل محمد صلى الله عليه وسلم قد اتخذت المقاعد في السماء الدنيا يستمعون ما يحدث في السماء من أمر فلما بعث الله محمدا صلى الله عليه وسلم نبيا رسولا رجموا ليلة من الليالي ففزع لذلك أهل الطائف فقالوا هلك أهل السماء لما رأوا من شدة النار في السماء واختلاف الشهب فجعلوا يعتقون أرقاءهم ويسيبون مواشيهم فقال لهم عبد يا ليل بن عمرو بن عمير: ويحكم يا معشر أهل الطائف أمسكوا عن أموالكم وانظروا إلى معالم النجوم فإن رأيتموها مستقرة في أمكنتها فلم يهلك أهل السماء إنما هذا من أجل ابن أبي كبشة يعني محمدا صلى الله عليه وسلم وإن نظرتم فلم تروها فقد هلك أهل السماء فنظروا فرأوها فكفوا عن أموالهم وفزعت الشياطين في تلك الليلة فأتوا إبليس فحدثوه بالذي كان من أمرهم فقال ائتوني من كل أرض بقبضة من تراب أشمها فأتوه فشم فقال صاحبكم بمكة فبعث سبعة نفر من جن نصيبين فقدموا مكة فوجدوا نبي الله صلى الله عليه وسلم قائما يصلي في المسجد الحرام يقرأ القرآن فدنوا منه حرصا على القرآن حتى كادت كلاكلهم تصيبه ثم أسلموا فأنزل الله تعالى أمرهم على رسوله صلى الله عليه وسلم وقد ذكرنا هذا الفصل مستقصى في أول البعث من \"كتاب السيرة\" المطول والله أعلم ولله الحمد والمنة."
    },
    {
      "ayah": 11,
      "surah": 72,
      "text": "يقول تعالى مخبرا عن الجن أنهم قالوا مخبرين عن أنفسهم \"وأنا منا الصالحون ومنا دون ذلك\" أي غير ذلك \"كنا طرائق قددا\" أي طرائق متعددة مختلفة وآراء متفرقة قال ابن عباس ومجاهد وغير واحد \"كنا طرائق قددا\" أي منا المؤمن ومنا الكافر وقال أحمد بن سليمان النجاد في أماليه حدثنا الحسن بن أسلم بن سهل بحشل حدثنا علي بن سليمان هو أبو الشعثاء الحضرمي شيخ مسلم حدثنا أبو معاوية قال سمعت الأعمش يقول تروح إلينا جني فقلت له ما أحب الطعام إليكم؟ فقال الأرز قال فأتيناهم به فجعلت أرى اللقم ترفع ولا أرى أحدا فقلت فيكم من هذه الأهواء التي فينا؟ قال نعم فقلت فما الرافضة فيكم؟ قال شرنا. عرضت هذا الإسناد على شيخنا الحافظ أبي الحجاج المزي فقال هذا إسناد صحيح إلى الأعمش. ذكر الحافظ ابن عساكر في ترجمة العباس بن أحمد الدمشقي قال سمعت بعض الجن وأنا في منزل لي بالليل ينشد قلوب براها الحب حتى تعلقت مذاهبها في كل غرب وشارق تهيم بحب الله والله ربها معلقة بالله دون الخلائق."
    },
    {
      "ayah": 12,
      "surah": 72,
      "text": "أي نعلم أن قدرة الله حاكمة علينا وأنا لا نعجزه في الأرض ولو أمعنا في الهرب فإنه علينا قادر لا يعجزه أحد منا."
    },
    {
      "ayah": 13,
      "surah": 72,
      "text": "\"وأنا لما سمعنا الهدى آمنا به\" يفتخرون بذلك وهو مفخر لهم وشرف رفيع وصفة حسنة وقولهم \"فمن يؤمن بربه فلا يخاف بخسا ولا رهقا\" قال ابن عباس وقتادة وغيرهما فلا يخاف أن ينقص من حسناته أو يحمل عليه غير سيئاته كما قال تعالى \"فلا يخاف ظلما ولا هضما\"."
    },
    {
      "ayah": 14,
      "surah": 72,
      "text": "\"وأنا منا المسلمون ومنا القاسطون\" أي منا المسلم ومنا القاسط وهو الجائر عن الحق الناكب عنه بخلاف المقسط فإنه العادل \"فمن أسلم فأولئك تحروا رشدا\" أي طلبوا لأنفسهم النجاة."
    },
    { "ayah": 15, "surah": 72, "text": "أي وقود تسعر بهم." },
    {
      "ayah": 16,
      "surah": 72,
      "text": "اختلف المفسرون في معنى هذا على قولين \"أحدهما\" وأن لو استقام القاسطون على طريقة الإسلام وعدلوا إليها واستمروا عليها \"لأسقيناهم ماء غدقا\" أي كثيرا والمراد بذلك سعة الرزق كقوله تعالى \"ولو أنهم أقاموا التوراة والإنجيل وما أنزل إليهم من ربهم لأكلوا من فوقهم ومن تحت أرجلهم\" وكقوله تعالى \"ولو أن أهل القرى آمنوا واتقوا لفتحنا عليهم بركات من السماء والأرض\"."
    },
    {
      "ayah": 17,
      "surah": 72,
      "text": "قوله \"لنفتنهم فيه\" أي لنختبرهم كما قال مالك عن زيد بن أسلم لنفتنهم لنبتليهم من يستمر على الهداية ممن يرتد إلى الغواية \"ذكر من قال بهذا القول\" قال العوفي عن ابن عباس \"وأن لو استقاموا على الطريقة\" يعني بالإستقامة الطاعة وقال مجاهد \"وأن لو استقاموا على الطريقة\" قال الإسلام وكذا قال سعيد بن جبير وسعيد بن المسيب وعطاء والسدي ومحمد بن كعب القرظي وقال قتادة \"وأن لو استقاموا على الطريقة\" يقول لو آمنوا كلهم لأوسعنا عليهم من الدنيا وقال مجاهد \"وأن لو استقاموا على الطريقة\" أي طريقة الحق وكذا قال الضحاك واستشهد على ذلك بالآيتين اللتين ذكرناهما وكل هؤلاء أو أكثرهم قالوا في قوله \"لنفتنهم فيه\" أي لنبتليهم به. وقال مقاتل نزلت في كفار قريش حين منعوا المطر سبع سنين. \"والقول الثاني\" \"وأن لو استقاموا على الطريقة\" الضلالة \"لأسقيناهم ماء غدقا\" أي لأوسعنا عليهم الرزق استدراجا كما قال تعالى\" فلما نسوا ما ذكروا به فتحنا عليهم أبواب كل شيء حتى إذا فرحوا بما أوتوا أخذناهم بغتة فإذا هم مبلسون\" وكقوله \"أيحسبون أنما نمدهم به من مال وبنين نسارع لهم في الخيرات بل لا يشعرون\" وهذا قول أبي مجلز لاحق بن حميد فإنه قال في قوله تعالى \"وأن لو استقاموا على الطريقة\" أي طريقة الضلالة رواه ابن جرير وابن أبي حاتم وحكاه البغوي عن الربيع بن أنس وزيد بن أسلم والكلبي وابن كيسان وله اتجاه وتأييد بقوله لنفتنهم فيه. وقوله تعالى \"ومن يعرض عن ذكر ربه يسلكه عذابا صعدا\" أي عذابا مشقا شديدا موجعا مؤلما قال ابن عباس ومجاهد وعكرمة وقتادة وابن زيد \"عذابا صعدا\" أي مشقة لا راحة معها وعن ابن عباس جبل في جهنم وعن سعيد بن جبير بئر فيها."
    },
    {
      "ayah": 18,
      "surah": 72,
      "text": "يقول تعالى آمرا عباده أن يوحدوه في محال عبادته ولا يدعى معه أحد ولا يشرك به كما قال قتادة في قوله تعالى \"وأن المساجد لله فلا تدعوا مع الله أحدا\" قال كانت اليهود والنصارى إذا دخلوا كنائسهم وبيعهم أشركوا بالله فأمر الله نبيه صلى الله عليه وسلم أن يوحدوه وحده وقال ابن أبي حاتم ذكر علي بن الحسين حدثنا إسماعيل بن بنت السدي أخبرنا رجل سماه عن السدي عن أبي مالك أو أبي صالح عن ابن عباس في قوله \"وأن المساجد لله فلا تدعوا مع الله أحدا\" قال لم يكن يوم نزلت هذه الآية في الأرض مسجد إلا المسجد الحرام ومسجد إيليا بيت المقدس وقال الأعمش قالت الجن يا رسول الله ائذن لنا فنشهد معك الصلوات في مسجدك فأنزل الله تعالى \"وأن المساجد لله فلا تدعوا مع الله أحدا\" يقول صلوا لا تخالطوا الناس. وقال ابن جرير حدثنا ابن حميد حدثنا مهران حدثنا سفيان عن إسماعيل بن أبن خالد عن محمود عن سعيد بن جبير \"وأن المساجد لله فلا تدعوا مع الله أحدا\" قال: قالت الجن للنبي صلى الله عليه وسلم كيف لنا أن نأتي المسجد ونحن ناءون؟ أي بعيدون عنك وكيف نشهد الصلاة ونحن ناءون عنك؟ فنزلت \"وأن المساجد للّه فلا تدعوا مع الله أحدا\" وقال سفيان عن خصيف عن عكرمة نزلت في المساجد كلها وقال سعيد بن جبير نزلت في أعضاء السجود أي هي لله فلا تسجدوا بها لغيره وذكروا عند هذا القول الحديث الصحيح من رواية عبدالله بن طاوس عن أبيه عن ابن عباس رضي الله عنهما قال: قال رسول الله صلى الله عليه وسلم \"أمرت أن أسجد على سبعة أعظم على الجبهة - أشار بيده إلى أنفه - واليدين والركبتين وأطراف القدمين\"."
    },
    {
      "ayah": 19,
      "surah": 72,
      "text": "قال العوفي عن ابن عباس يقول لما سمعوا النبي صلى الله عليه وسلم يتلو القرآن كادوا يركبونه من الحرص لما سمعوه يتلو القرآن ودنوا منه فلم يعلم بهم حتى أتاه الرسول فجعل يقرئه \"قل أوحي إلي أنه استمع نفر من الجن\" يستمعون القرآن هذا قول وهو مروي عن الزبير بن العوام رضي الله عنه وقال ابن جرير حدثني محمد بن معمر حدثنا ابن هشام عن أبي عوانه عن أبي بشر عن سعيد بن جبير عن ابن عباس قال: قال الجن لقومهم \"لما قام عبدالله يدعوه كادوا يكونون عليه لبدا\" قال لما رأوه يصلي وأصحابه يركعون بركوعه ويسجدون بسجوده قال عجبوا من طواعية أصحابه له قال فقالوا لقومهم \"لما قام عبدالله يدعوه كادوا يكونون عليه لبدا\" وهذا قول ثان وهو مروي عن سعيد بن جبير أيضا وقال الحسن لما قام رسول الله صلى الله عليه وسلم يقول لا إله إلا الله ويدعو الناس إلى ربهم كادت العرب تلبد عليه جميعا وقال قتادة في قوله \"وأنه لما قام عبدالله يدعوه كادوا يكونون عليه لبدا\" قال تلبدت الإنس والجن على هذا الأمر ليطفئوه فأبى الله إلا أن ينصره ويمضيه ويظهره على من ناوأه."
    },
    {
      "ayah": 2,
      "surah": 72,
      "text": "\"يهدي إلى الرشد\" أي يهدي إلى السداد والنجاح \"فآمنا به ولن نشرك بربنا أحدا\" وهذا المقام شبيه بقوله تعالى \"وإذ صرفنا إليك نفرا من الجن يستمعون القرآن\" وقد قدمنا الأحاديث الواردة في ذلك بما أغنى عن إعادته ههنا."
    },
    {
      "ayah": 20,
      "surah": 72,
      "text": "هذا قول ثالث وهو مروي عن ابن عباس ومجاهد وسعيد بن جبير وقول ابن زيد وهو اختيار ابن جرير وهو الأظهر لقوله بعده \"قل إنما أدعو ربي ولا أشرك به أحدا\" أي قال لهم الرسول لما آذوه وخالفوه وكذبوه وتظاهروا عليه ليبطلوا ما جاء به من الحق واجتمعوا على عدوانه \"إنما أدعو ربي\" أي إنما أعبد ربي وحده لا شريك له وأستجير به وأتوكل عليه \"ولا أشرك به أحدا\"."
    },
    {
      "ayah": 21,
      "surah": 72,
      "text": "أي إنما أنا بشر مثلكم يوحى إلي وعبد من عباد الله ليس إلي من الأمر شيئا في هدايتكم ولا غوايتكم بل المرجع في ذلك كله إلى الله عز وجل."
    },
    {
      "ayah": 22,
      "surah": 72,
      "text": "أخبر عن نفسه أيضا أنه لا يجيره من الله أحد أي لو عصيته فإنه لا يقدر أحد على إنقاذي من عذابه \"ولن أجد من دونه ملتحدا\" قال مجاهد وقتادة والسدي لا ملجأ وقال قتادة أيضا \"قل إني لن يجيرني من الله أحد ولن أجد من دونه ملتحدا\" أي لا نصير ولا ملجأ وفي رواية لا ولي ولا موئل."
    },
    {
      "ayah": 23,
      "surah": 72,
      "text": "قوله تعالى \"إلا بلاغا من الله ورسالاته\" قال بعضهم هو مستثنى من قوله \"قل إني لا أملك لكم ضرا ولا رشدا.. إلا بلاغا\" ويحتمل أن يكون استثناء من قوله \"لن يجيرني من الله أحد\" أي لا يجيرني منه ويخلصني إلا إبلاغي الرسالة التي أوجب أدائها علي كما قال تعالى \"يا أيها الرسول بلغ ما أنزل إليك من ربك وإن لم تفعل فما بلغت رسالته والله يعصمك من الناس\". وقوله تعالى \"ومن يعص الله ورسول فإن له نار جهنم خالدين فيها أبدا\" أي أنا أبلغكم رسالة الله فمن يعص بعد ذلك فله جزاء على ذلك نار جهنم خالدين فيها أبدا أي لا محيد لهم عنها ولا خروج لهم منها."
    },
    {
      "ayah": 24,
      "surah": 72,
      "text": "أي حتى إذا رأى هؤلاء المشركين من الجن والإنس ما يوعدون يوم القيامة فسيعلمون يومئذ من أضعف ناصرا وأفل عددا هم أم المؤمنون الموحدون للّه تعالى؟ أي بل المشركون لا ناصر وهم بالكلية وهم أقل عددا من جنود الله عز وجل."
    },
    {
      "ayah": 25,
      "surah": 72,
      "text": "يقول تعالى آمرا رسوله صلى الله عليه وسلم أن يقول للناس إنه لا علم له بوقت الساعة ولا يدري أقريب وقتها أم بعيد \"قل إن أدرى أقريب ما توعدون أم يجعل له ربي أمدا\" أي مدة طويلة وفي هذه الآية الكريمة دليل على أن الحديث الذي يتداوله كثير من الجهلة من أنه عليه الصلاة والسلام لا يؤلف تحت الأرض كذب لا أصل له ولم نره في شيء من الكتب وقد كان صلى الله عليه وسلم يسئل عن وقت الساعة فلا يجيب عنها ولما تبدى له جبريل في صورة أعرابي كان قيما سأله أن قال يا محمد فأخبرني عن الساعة؟ قال \"ما المسئول عنها بأعلم من السائل\" ولما ناداه ذلك الأعرابي بصوت جهوري فقال يا محمد متى الساعة؟ \"ويحك إنها كائنة فما أعددت لها؟\" قال أما إني لم أعد لها كثير صلاة ولا صيام ولكني أحب الله ورسوله قال \"فأنت مع من أحببت\" قال أنس فما فرح المسلمون بشيء فرحهم بهذا الحديث وقال ابن أبي حاتم حدثنا أبي حدثنا محمد بن مضاء حدثنا محمد بن جبير حدثني أبو بكر بن أبي مريم عن عطاء بن أبي رباح عن أبي سعيد الخدري عن النبي صلى الله عليه وسلم قال \"يا بني آدم إن كنتم تعقلون فعدوا أنفسكم من الموتى والذي نفسي بيده إنما توعدون لآت\" وقد قال أبو داود في آخر كتاب الملاحم حدثنا موسى بن سهل حدثنا حجاج بن إبراهيم حدثنا ابن وهب حدثني معاوية بن صالح عن عبدالرحمن بن جبير عن أبيه عن أبي ثعلبة الخشني قال: قال رسول الله صلى الله عليه وسلم \"لن تعجز الله هذه الأمة من نصف يوم\" قيل لسعد بن أبي وقاص عن النبي صلى الله عليه وسلم أنه قال \"إني لأرجو أن لا تعجز أمتي عند ربها أن يؤخرهم نصف يوم\" قيل لسعد وكم نصف يوم؟ قال \"خمسمائة عام\" انفرد به أبو داود."
    },
    {
      "ayah": 26,
      "surah": 72,
      "text": "هذه كقوله تعالى \"ولا يحيطون بشيء من علمه إلا بما شاء\" وهكذا قال ههنا إنه يعلم الغيب والشهادة وأنه لا يطلع أحد من خلقه على شيء من علمه إلا مما أطلعه تعالى عليه ولهذا قال \"عالم الغيب فلا يظهر على غيبه أحدا."
    },
    {
      "ayah": 27,
      "surah": 72,
      "text": "\"إلا من ارتضى من رسول\" وهذا يعم الرسول الملكي والبشري ثم قال تعالى \"فإنه يسلك من بين يديه ومن خلفه رصدا\" أي يخصه بمزيد معقبات من الملائكة يحفظونه من أمر الله ويساندونه على ما معه من وحي الله."
    },
    {
      "ayah": 28,
      "surah": 72,
      "text": "وقد اختلف المفسرون في الضمير الذي في قوله\"ليعلم\" إلى من يعود؟ فقيل إنه عائد إلى النبي صلى الله عليه وسلم. قال ابن جرير حدثنا ابن حميد حدثنا يعقوب القمي عن جعفر عن سعيد بن جبير في قوله \"عالم الغيب فلا يظهر على غيبه أحدا إلا من ارتضى من رسول فإنه يسلك من بين يديه ومن خلفه رصدا\" قال أربعة حفظة من الملائكة مع جبريل \"ليعلم\" محمد صلى الله عليه وسلم \"أن قد أبلغوا رسالات ربهم وأحاط بما لديهم وأحصى كل شيء عددا\" ورواه ابن أبي حاتم من حديث يعقوب القمي به وهكذا رواه الضحاك والسدي ويزيد بن أبي حبيب وقال عبدالرزاق عن معمر عن قتادة \"ليعلم أن قد أبلغوا رسالات ربهم\" قال ليعلم نبي الله أن الرسل قد بلغت عن الله وأن الملائكة حفظتها ودفعت عنها وكذا رواه سعيد بن أبي عروبة عن قتادة واختاره ابن جرير وقيل غير ذلك كما رواه العوفي عن ابن عباس في قوله \"إلا من ارتضى من رسول فإنه يسلك من بين يديه ومن خلفه رصدا\" قال هي معقبات من الملائكة يحفظون النبي صلى الله عليه وسلم من الشيطان حتى يتبين الذين أرسل إليهم وذلك حين يقول ليعلم أهل الشرك أن قد أبلغوا رسالات ربهم وكذا قال ابن أبي نجيح عن مجاهد \"ليعلم أن قد أبلغوا رسالات ربهم\" قال ليعلم من كذب الرسل أن قد أبلغوا رسالات ربهم وفي هذا نظر وقال البغوي قرأ يعقوب \"ليعلم\" بالضم ليعلم الناس أن الرسل قد بلغوا ويحتمل أن يكون الضمير عائد إلى الله عز وجل وهو قول حكاه ابن الجوزي في زاد المسير ويكون المعنى في ذلك أنه يحفظ رسله بملائكته ليتمكنوا من أداء رسالاته ويحفظ ما ينزله إليهم من الوحي ليعلم أن قد أبلغوا رسالات ربهم ويكون ذلك كقوله تعالى\" وما جعلنا القبلة التي كنت عليها إلا لنعلم من يتبع الرسول ممن ينقلب على عقبيه\" وكقوله تعالى وليعلمن الله الذين آمنوا وليعلمن المنافقين\" إلى أمثال ذلك من العلم بأنه تعالى يعلم الأشياء قبل كونها قطعا لا محالة ولهذا قال بعد هذا \"وأحاط بما لديهم وأحصى كل شيء عددا. آخر تفسير سورة الجن ولله الحمد والمنة."
    },
    {
      "ayah": 3,
      "surah": 72,
      "text": "قوله تعالى \"وأنه تعالى جد ربنا\" قال علي بن أبي طلحة عن ابن عباس في قوله تعالى \"جد ربنا\" أي فعله وأمره وقدرته وقال الضحاك عن ابن عباس جد الله آلاؤه وقدرته ونعمته على خلقه وروي عن مجاهد وعكرمة جلال ربنا وقال قتادة تعالى جلاله وعظمته وأمره وقال السدي تعالى أمر ربنا وعن أبي الدرداء ومجاهد أيضا وابن جريج تعالى ذكره وقال سعيد بن جبير \"تعالى جد ربنا\" أي تعالى ربنا فأما ما رواه ابن أبي حاتم حدثنا محمد بن عبدالله بن يزيد الكوفي حدثنا سفيان عن عمرو عن عطاء عن ابن عباس قال: الجد أب ولو علمت الجن أن في الإنس جدا ما قالوا تعالى جد ربنا فهذا إسناد جيد ولكن لست أفهم ما معنى هذا الكلام ولعله قد سقط شيء والله أعلم. وقوله تعالى \"ما اتخذ صاحبة ولا ولدا\" أي تعالى عن اتخاذ الصاحبة والأولاد أي قالت الجن تنزه الرب جل جلاله حين أسلموا وآمنوا بالقرآن عن اتخاذ الصاحبة والولد."
    },
    {
      "ayah": 4,
      "surah": 72,
      "text": "قال مجاهد وعكرمة وقتادة والسدي \"سفيهنا\" يعنون إبليس \"شطط\" قال السدي عن أبي مالك \"شطط\" أي جورا. وقال ابن زيد أي ظلما كبيرا ويحتمل أن يكون المراد بقولهم سفيهنا اسم جنس لكل من زعم أن لله صاحبة أو ولدا ولهذا قالوا \"وأنه كان يقول سفيهنا\" أي قبل إسلامه \"على الله شططا\" أي باطلا وزورا."
    },
    {
      "ayah": 5,
      "surah": 72,
      "text": "أي ما حسبنا أن الإنس والجن يتمالؤن على الكذب على الله تعالى في نسبة الصاحبة والولد إليه فلما سمعنا هذا القرآن وآمنا به علمنا أنهم كانوا يكذبون على الله في ذلك."
    },
    {
      "ayah": 6,
      "surah": 72,
      "text": "أي كنا نرى أن لنا فضلا على الإنس لأنهم كانوا يعوذون بنا إذا نزلوا واديا أو مكانا موحشا من البراري وغيرها كما كانت عادة العرب في جاهليتها يعوذون بعظيم ذلك المكان من الجان أن يصيبهم بشيء يسوءهم كما كان أحدهم يدخل بلاد أعدائه في جوار رجل كبير وذمامه وخفارته فلما رأت الجن أن الإنس يعوذون بهم من خوفهم منهم زادوهم رهقا أي خوفا وإرهابا وذعرا حتى بقوا أشد منهم مخافة وأكثر تعوذا بهم كما قال قتادة \"فزادوهم رهقا\" أي إثما وازدادت الجن عليهم بذلك جراءة وقال الثوري عن منصور عن إبراهيم \"فزادوهم رهقا\" أي ازدادت الجن عليهم جرأة وقال السدي: كان الرجل يخرج بأهله فيأتي الأرض فينزلها فيقول: أعوذ بسيد هذا الوادي من الجن أن أضر أنا فيه أو مالي أو ولدي أو ماشيتي قال قتادة: فإذا عاذ بهم من دون الله رهقتهم الجن الأذى عند ذلك وقال ابن أبي حاتم حدثنا أبو سعيد بن يحيى بن سعيد القطان حدثنا وهب بن جرير حدثنا أبي حدثنا الزبير بن الخريت عن عكرمة قال كان الجن يفرقون من الإنس كما يفرق الإنس منهم أو أشد فكان الإنس إذا نزلوا واديا هرب الجن فيقول سيد القوم نعوذ بسيد أهل هذا الوادي فقال الجن نراهم يفرقون منا كما نفرق منهم فدنوا من الإنس فأصابوهم بالخبل والجنون فذلك قول الله عز وجل \"وأنه كان رجال من الإنس يعوذون برجال من الجن فزادوهم رهقا\" أي إثما وقال أبو العالية والربيع وزيد بن أسلم \"رهقا\" أي خوفا. وقال العوفي عن ابن عباس \"فزادوهم رهقا\" أي إثما وكذا قال قتادة: وقال مجاهد زاد الكفار طغيانا وقال ابن أبي حاتم حدثنا أبي حدثنا فروة بن المغراء الكندي حدثنا القاسم بن مالك - يعني المزني - عن عبد الرحمن بن إسحاق عن أبيه عن كردم بن أبي السائب الأنصاري قال خرجت مع أبي من المدينة في حاجة وذلك أول ما ذكر رسول الله صلى الله عليه وسلم بمكة فآوانا المبيت إلى راعي غنم فلما انتصف الليل جاء ذئب فأخذ حملا من الغنم فوثب الراعي فقال يا عامر الوادي جارك فنادى مناد لا نراه يقول يا سرحان أرسله فأتى الحمل يشتد حتى دخل في الغنم لم تصبه كدمة وأنزل الله تعالى على رسوله بمكة \"وأنه كان رجال من الإنس يعوذون برجال من الجن فزادوهم رهقا\" ثم قال وروي عن عبيد بن عمير ومجاهد وأبي العالية والحسن وسعيد بن جبير وإبراهيم النخعي نحوه. وقد يكون هذا الذئب الذي أخذ الحمل وهو ولد الشاة وكان جنيا حتى يرهب الأنسي ويخاف منه ثم رده عليه لما استجار به ليضله ويهينه ويخرجه عن دينه والله تعالى أعلم."
    },
    { "ayah": 7, "surah": 72, "text": "أي لن يبعث الله بعد هذه المدة رسولا. قاله الكلبي وابن جرير." },
    {
      "ayah": 8,
      "surah": 72,
      "text": "يخبر تعالى عن الجن حين بعث الله رسوله محمدا صلى الله عليه وسلم وأنزل عليه القرآن وكان من حفظه له أن السماء ملئت حرسا شديد وحفظت من سائر أرجائها."
    },
    {
      "ayah": 9,
      "surah": 72,
      "text": "طردت الشياطين عن مقاعدها التي كانت تقعد فيها قبل ذلك لئلا يسترقوا شيئا من القرآن فيلقوه على ألسنة الكهنة فيلتبس الأمر ويختلط ولا يدرى من الصادق وهذا من لطف الله تعالى بخلقه ورحمته بعباده وحفظه لكتابه العزيز ولهذا قال الجن \"وأنا لمسنا السماء فوجدناها ملئت حرسا شديدا وشهبا وأنا كنا نقعد منها مقاعد للسمع فمن يستمع الآن يجد له شهابا رصدا\" أي من يروم أن يسترق السمع اليوم يجد له شهابا مرصدا لم لا يتخطاه ولا يتعداه بل يمحقه ويهلكه."
    }
  ]
}
