{
  "ayahs": [
    {
      "ayah": 1,
      "surah": 73,
      "text": "سورة المزمل: قال الحافظ أبو بكر أحمد بن عمرو بن عبدالخالق البزار حدثنا محمد بن موسى القطان الواسطي حدثنا معلى بن عبدالرحمن حدثنا شريك عن عبدالله بن محمد بن عقيل عن جابر قال: اجتمعت قريش في دار الندوة فقالوا سموا هذا الرجل اسما يصد الناس عنه فقالوا كاهن قالوا ليس بكاهن قالوا مجنون قالوا ليس بمجنون قالوا ساحر قالوا ليس بساحر فتفرق المشركون على ذلك فبلغ ذلك النبي صلى الله عليه وسلم؟ فتزمل في ثيابه وتدثر فيها فأتاه جبريل عليه السلام فقال \"يا أيها المزمل\" \"يا أيها المدثر\" ثم قال البزار: معلى بن عبدالرحمن قد حدث عنه جماعة من أهل العلم واحتملوا حديثه لكن تفرد بأحاديث لا يتابع عليها. يأمر تعالى رسوله صلى الله عليه وسلم أن يترك التزمل وهو التغطي في الليل ابن عباس والضحاك والسدي \"يا أيها المزمل\" يعني يا أيها النائم. وقال قتادة: المزمل في ثيابه وقال إبراهيم النخعي: نزلت وهو متزمل بقطيفة. وقال شبيب بن بشر عن عكرمة عن ابن عباس \"يا أيها المزمل\" قال يا محمد زملت القرآن."
    },
    {
      "ayah": 10,
      "surah": 73,
      "text": "يقول تعالى آمرا رسوله صلى الله عليه وسلم بالصبر على ما يقوله من كذبه من سفهاء قومه وأن يهجرهم هجرا جميلا وهو الذي لا عتاب معه."
    },
    {
      "ayah": 11,
      "surah": 73,
      "text": "ثم قال له متهددا لكفار قومه ومتوعدا وهو العظيم الذي لا يقوم لغضبه شيء. \"وذرني والمكذبين أولي النعمة\" أي دعني والمكذبين المترفين أصحاب الأموال فإنهم على الطاعة أقدر من غيرهم وهم يطالبون من الحقوق بما ليس عند غيرهم \"ومهلهم قليلا\" أي رويدا كما قال تعالى \"نمتعهم قليلا ثم نضطرهم إلى عذاب غليظ."
    },
    {
      "ayah": 12,
      "surah": 73,
      "text": "وهي القيود قاله ابن عباس وعكرمة وطاوس ومحمد بن كعب وعبدالله بن بريدة وأبو عمران الجوني وأبو مجلز والضحاك وحماد بن أبي سلمان وقتادة وطعاما السدي وابن المبارك والثوري وغير واحد \"وجحيما\" وهي السعير المضطرمة."
    },
    { "ayah": 13, "surah": 73, "text": "قال ابن عباس ينشب في الحلق فلا يدخل ولا يخرج." },
    {
      "ayah": 14,
      "surah": 73,
      "text": "\"يوم ترجف الأرض والجبال\" أي تزلزل \"وكانت الجبال كثيبا مهيلا\" أي تصير ككثبان الرمل بعد ما كانت حجارة صماء ثم إنها تنسف نسفا فلا يبقى منها شيء إلا ذهب حتى تصير الأرض قاعا صفصفا لا ترى فيها عوجا أي واديا ولا أمتا أي رابية ومعناه لا شيء ينخفض ولا شيء يرتفع."
    },
    {
      "ayah": 15,
      "surah": 73,
      "text": "ثم قال تعالى مخاطبا لكفار قريش والمراد سائر الناس \"إنا ارسلنا إليكم رسولا شاهدا عليكم\" أي بأعمالكم \"كما أرسلنا إلى فرعون رسولا\"."
    },
    {
      "ayah": 16,
      "surah": 73,
      "text": "قال ابن عباس ومجاهد وقتادة والسدى والثوري \"أخذا وبيلا\" أي شديدا أي فاحذروا أنتم أن تكذبوا هذا الرسول فيصيبكم ما أصاب فرعون حيث أخذه الله أخذ عزيز مقتدر كما قال تعالى \"فأخذه الله نكال الآخرة والأولى\" وأنتم أولى بالهلاك والدمار إن كذبتم رسولكم لأن رسولكم أشرف وأعظم من موسى بن عمران ويروى عن ابن عباس ومجاهد."
    },
    {
      "ayah": 17,
      "surah": 73,
      "text": "يحتمل أن يكون يوما معمولا لتتقون كما حكاه ابن جرير عن قراءة ابن مسعود فكيف تخافون أيها الناس يوما يجعل الولدان شيبا إن كفرتم بالله ولم تصدقوا به؟ ويحتمل أن يكون معمولا لكفرتم فعلى الأول كيف يحصل لكم أمان من يوم هذا الفزع العظيم إن كفرتم وعلى الثاني كيف يحصل لكم تقوى إن كفرتم يوم القيامة وجحدتموه وكلاهما معنى حسن ولكن الأول أولى والله أعلم. ومعنى قوله \"يوما يجعل الولدان شيبا\" أى من شدة أهواله وزلازله وبلابله وذلك حين يقول الله تعالى لآدم ابعث بعث النار فيقول من كم؟ فيقول من كل ألف تسعمائة وتسعة وتسعون إلى النار وواحد إلى الجنة. قال الطبراني حدثنا يحيى بن أيوب العلاف حدثنا سعيد بن أبي مريم حدثنا نافع بن يزيد حدثنا عثمان بن عطاء الخراساني عن أبيه عن عكرمة عن ابن عباس أن رسول الله صلى الله عليه وسلم قرأ \"يوما يجعل الولدان شيبا\" قال \"ذلك يوم القيامة وذلك يوم يقول الله لآدم قم فابعث من ذريتك بعثا إلى النار قال من كم يا رب؟ قال من كل ألف تسعمائة وتسعة وتسعون وينجو واحد\" فاشتد ذلك على المسلمين وعرف ذلك رسول الله صلى الله عليه وسلم ثم قال حين أبصر ذلك في وجوههم \"إن بني آدم كثير وإن يأجوج ومأجوج من ولد آدم وإنه لا يموت منهم رجل حتى ينتشر لصلبه ألف رجل ففيهم وفي أشباهم جنة لكم\" هذا حديث غريب وقد تقدم في أول سورة الحج ذكر هذه الأحاديث."
    },
    {
      "ayah": 18,
      "surah": 73,
      "text": "قال الحسن وقتادة أي بسببه من شدته وهوله ومنهم من يعيد الضمير على الله تعالى وروي عن ابن عباس ومجاهد وليس بقوي لأنه لم يجر له ذكر ههنا قوله تعالى \"كان وعده مفعولا\" أي كان وعد هذا اليوم مفعولا أي واقعا لا محاله وكائنا لا محيد عنه."
    },
    {
      "ayah": 19,
      "surah": 73,
      "text": "يقول تعالى \"إن هذه\" أي السورة \"تذكرة\" أي يتذكر بها أولوا الألباب ولهذا قال تعالى \"فمن شاء اتخذ إلى ربه سبيلا\" أي ممن شاء الله تعالى هدايته كما قيده في السورة الأخرى \"وما تشاؤون إلا أن يشاء الله إن الله كان عليما حكيما\"."
    },
    {
      "ayah": 2,
      "surah": 73,
      "text": "أن ينهض إلى القيام لربه عز وجل كما قال تعالى \"تتجافى جنوبهم عن المضاجع يدعون ربهم خوفا وطمعا ومما رزقناهم ينفقون\" وكذلك كان صلى الله عليه وسلم ممتثلا ما أمره الله تعالى به من قيام الليل وقد كان واجبا عليه وحده كما قال تعالى. \"ومن الليل فتهجد به نافلة لك عسى أن يبعثك ربك مقاما محمودا\" وههنا بين له مقدار ما يقوم فقال تعالى \" قم الليل إلا قليلا\"."
    },
    {
      "ayah": 20,
      "surah": 73,
      "text": "ثم قال تعالى \"إن ربك يعلم أنك تقوم أدنى من ثلثي الليل ونصفه وثلثه وطائفة من الذين معك\" أي تارة هكذا وتارة هكذا وذلك كله من غير قصد منكم ولكن لا تقدرون على المواظبة على ما أمركم به من قيام الليل لأنه يشق عليكم ولهذا قال \"والله يقدر الليل والنهار\" أي تارة يعتدلان وتارة يأخذ هذا من هذا وهذا من هذا \"علم أن لن تحصوه أي الفرض الذي أوجبه عليكم \"فاقرءوا ما تيسر من القرآن\" أى من غير تحديد بوقت أي ولكن قوموا من الليل ما تيسر وعبر عن الصلاة بالقراءة كما قال في سورة سبحان \"ولا تجهر بصلاتك\" أي بقراءتك \"ولا تخافت بها\" وقد استدل أصحاب الإمام أبي حنيفة رحمه الله بهذه الآية وهي قوله \"فاقرءوا ما تيسر من القرآن\" على أنه لا يجب تعين قراءة الفاتحة في الصلاة بل لو قرأ بها أو بغيرها من القرآن ولو بآية أجزأه واعتضدوا بحديث المسيء صلاته الذي في الصحيحين \"ثم اقرأ ما تيسر معك من القرآن\" وقد أجابهم الجمهور بحديث عبادة بن الصامت وهو فى الصحيحين أيضا ان رسول الله قال \"لا صلاة لمن لم يقرأ بفاتحة الكتاب\" وفي صحيح مسلم عن أبي هريرة أن رسول الله صلى الله عليه وسلم قال \"كل صلاة لا يقرأ فيها بأم القرآن فهي خداج فهى خداج فهي خداج غير تمام\" وفي صحيح ابن خزيمة عن أبي هريرة مرفوعا \"لا تجزئ صلاة من لما يقرأ بأم القرآن\".وقوله تعالى \"علم أن سيكون منكم مرضى وآخرون يضربون في الأرض يبتغون من فضل الله وآخرون يقاتلون في سبيل الله\" أي علم أن سيكون من هذه الأمة ذوو أعذار في ترك قيام الليل من مرضى لا يستطيعون ذلك ومسافرين في الأرض يبتغون من فضل الله في المكاسب والمتاجر وآخرين مشغولين بما هو الأهم في حقهم من الغزو فى سبيل الله وهذه الآية بل السورة كلها مكية ولم يكن القتال شرع بعد فهي من أكبر دلائل النبوة لأنه من باب الإخبار بالمغيبات المستقبلة ولهذا قال تعالى \"فاقرءوا ما تيسر منه\" أي قوموا بما تيسر عليكم منه قال ابن جرير حدثنا يعقوب حدثنا ابن علية عن أبي رجاء محمد قال: قلت للحسن يا أبا سعيد ما تقول فى رجل قد استظهر القرآن كله عن ظهر قلبه ولا يقوم به إنما يصلي المكتوبة؟ قال يتوسد القرآن لعن الله ذاك قال الله تعالى للعبد الصالح \"وإنه لذو علم لما علمناه\" \"وعلمتم ما لم تعلموا أنتم ولا آباؤكم\" قلت يا أبا سعيد قال الله تعالى \"فاقرءوا ما تيسر من القرآن\" قال نعم ولو خمس آيات وهذا ظاهر من مذهب الحسن البصري أنه كان يرى حقا واجبا على حملة القرآن أن يقوموا ولو بشيء منه في الليل ولهذا جاء في الحديث أن رسول الله صلى الله عليه وسلم سئل عن رجل نام حتى أصبح فقال \"ذاك رجل بال الشيطان في أذنه\" فقيل معناه نام عن المكتوبة وقيل عن قيام الليل. وفي السنن \"أوتروا يا أهل القرآن\" وفي الحديث الآخر \"من لم يوتر فليس منا\" وأغرب من هذا ما حكي عن أبي بكر بن عبدالعزيز من الحنابلة من إيجابه قيام شهر رمضان فالله أعلم. وقال الطبراني: حدثنا أحمد بن سعيد فرقد الحدرد حدثنا أبو أحمد محمد بن يوسف الزبيدى حدثنا عبدالرحمن عن محمد بن عبدالله بن طاوس من ولد طاوس عن أبيه عن طاوس عن ابن عباس عن صلى الله عليه وسلم \"فاقرءوا ما تيسر منه\" قال \"مائه آية\" وهذا حديث غريب جدا لم أره إلا في معجم الطبراني رحمه الله تعالى. وقوله تعالى \"وأقيموا الصلاة وآتوا الزكاة\" أي أقيموا صلاتكم الواجبة عليكم وآتوا الزكاة المفروضة وهذا يدل لمن قال إن فرض الزكاة نزل بمكة لكن مقادير النصب والمخرج لم تبين إلا بالمدينة والله أعلم وقد قال ابن عباس وعكرمة ومجاهد والحسن وقتادة وغير واحد من السلف إن هذه الآية نسخت الذي كان الله قد أوجبه على المسلمين أولا من قيام الليل واختلفوا في المدة التي بينهما على أقوال كما تقدم وقد ثبت في الصحيحين أن رسول الله صلى الله عليه وسلم قال لذلك الرجل \"خمس صلوات في اليوم والليلة\" قال هل علي غيرها؟ قال \"لا إلا أن تطوع\" وقوله تعالى \"وأقرضوا الله قرضا حسنا\" يعني من الصدقات فإن الله يجازي على ذلك أحسن الجزاء وأوفره كما قال تعالى \"من ذا الذي يقرض الله قرضا حسنا فيضاعفه له أضعافا كثيرة\" وقوله تعالى \"وما تقدموا لأنفسكم من خير تجدوه عند الله هو خيرا وأعظم أجرا\" أى جميع ما تقدموه بين أيديكم فهو لكم حاصل وهو خير مما أبقيتموه لأنفسكم في الدنيا قال الحافظ أبو يعلي الموصلي حدثنا أبو خيثمة حدثنا جرير عن الأعمش عن إبراهيم عن الحارث بن سويد قال: قال عبدالله قال رسول الله صلى الله عليه وسلم \"أيكم ماله أحب إليه من مال وارثه؟\" قالوا يا رسول الله ما منا من أحد إلا ماله أحب إليه من مال وارثه قال \"اعلموا ما تقولون\" قالوا ما نعلم إلا ذلك يا رسول الله قال \"إنما مال أحدكم ما قدم ومال وارثه ما أخر\" ورواه البخاري من حديث حفص بن غياث والنسائي من طريق أبي معاوية كلاهما عن الأعمش به. ثم قال تعالى \"واستغفروا الله إن الله غفور رحيم\" أى أكثروا من ذكره واستغفاره في أموركم كلها فإنه غفور رحيم لمن استغفره. آخر تفسير سورة المزمل ولله الحمد والمنة."
    },
    {
      "ayah": 3,
      "surah": 73,
      "text": "وقوله تعالى \"نصفه\" بدل من الليل \"أو أنقص منه قليلا أو زد عليه\" أي أمرناك أن تقوم نصف الليل بزيادة قليلة أو نقصان قليل لا حرج عليك في ذلك."
    },
    {
      "ayah": 4,
      "surah": 73,
      "text": "وقوله تعالى \"ورتل القرآن ترتيلا\" أي اقرأه على تمهل فإنه يكون عونا على فهم القرآن وتدبره وكذلك كان يقرأ صلوات الله وسلامه عليه: قالت عائشه رضي الله عنها: كان يقرأ السورة فيرتلها حتى تكون أطول من أطول منها. وفي صحيح البخاري عن أنس أنه سئل عن قراءة رسول الله صلى الله عليه وسلم فقال كانت مدا ثم قرأ \"بسم الله الرحمن الرحيم\" يمد بسم الله ويمد الرحمن ويمد الرحيم وقال ابن جريج عن ابن أبي مليكة عن أم سلمة رضي الله عنها أنها سئلت عن قراءة رسول الله صلى الله عليه وسلم فقالت كان يقطع قراءته آية آية \"بسم الله الرحمن الرحيم الحمد لله رب العالمين الرحمن الرحيم مالك يوم الدين\" رواه أحمد وأبو داود والترمذي. وقال الإمام أحمد حدثنا عبدالرحمن عن سفيان عن عاصم عن ذر عن عبدالله بن عمرو عن النبي صلى الله عليه وسلم قال: \"يقال لقارئ القرآن اقرأ وارق ورتل كما كنت ترتل في الدنيا فإن منزلتك عند آخر آية تقرؤها\" ورواه أبو داود والترمذي والنسائي من حديث سفيان الثوري به وقال الترمذي حسن صحيح وقد قدمنا في أول التفسير الأحاديث الدالة على استحباب الترتيل وتحسين الصوت بالقراءة كما جاء في الحديث \"زينوا القرآن بأصواتكم\" و \"ليس منا من لم يتغن بالقرآن\" و \"لقد أوتي هذا مزمارا من مزامير آل داود\" يعني أبا موسى فقال أبو موسى لو كنت اعلم أنك كنت تسمع قراءتي لحبرته لك تحبيرا وعن ابن مسعود أنه قال لا تنثروه نثر الرمل ولا تهذوه هذ الشعر قفوا عند عجائبه وحركوا به القلوب ولا يكن هم أحدكم آخر السورة رواه البغوي وقال البخاري حدثنا آدم حدثنا شعبة حدثنا عمرو بن مرة سمعت أبا وائل قال: جاء رجل إلى ابن مسعود فقال: قرأت المفصل الليلة في ركعة. فقال هذا كهذ الشعر لقد عرفت النظائر التي كان رسول الله صلى الله عليه وسلم يقرن بينهن فذكر عشرين سورة من المفصل سورتين في ركعة."
    },
    {
      "ayah": 5,
      "surah": 73,
      "text": "قال الحسن وقتادة أي العمل به وقيل ثقيل وقت نزوله من عظمته كما قال زيد بن ثابت رضي الله عنه أنزل على رسول الله صلى الله عليه وسلم وفخذه على فخذي فكادت ترض فخذي. وقال الإمام أحمد حدثنا قتيبة حدثنا ابن لهيعة عن يزيد بن أبي حبيب عن عمرو بن الوليد عن عبدالله بن عمرو قال سألت النبي صلى الله عليه وسلم فقلت يا رسول الله هل تحس بالوحي فقال رسول الله صلى الله عليه وسلم \"أسمع صلاصل ثم أسكت عند ذلك فما من مرة يوحى إلى إلا ظننت أن نفسي تقبض\" تفرد به أحمد. وفي صحيح البخاري عن عبدالله بن يوسف عن مالك عن هشام عن أبيه عن عائشة أن الحارث بن هشام سأل رسول الله صلى الله عليه وسلم كيف يأتيك الوحي؟ فقال \"أحيانا يأتيني في مثل صلصلة الجرس وهو أشده علي فيفصم عني وقد وعيت عنه ما قال وأحيانا يتمثل لي رجلا فيكلمني فأعي ما يقول\" قالت عائشة ولقد رأيته ينزل عليه الوحي صلى الله عليه وسلم في اليوم الشديد البرد فيفصم عنه وجبينه ليتفصد عرقا هذا لفظه. وقال الإمام أحمد حدثنا سليمان بن داود أخبرنا عبدالرحمن عن هشام بن عروة عن أبيه عن عاثشة قالت: إن كان ليوحى إلى رسول الله صلى الله عليه وسلم وهو على راحلته فتضرب بجرانها وقال ابن جرير حدثنا ابن عبدالأعلى حدثنا ابن ثور عن معمر عن هشام بن عروة عن أبيه أن النبي صلى الله عليه وسلم كان إذا أوحي إليه وهو على ناقته وضعت جرانها فما تستطيع أن تحرك حتى يسرى عنه وهذا مرسل الجران هو باطن العنق واختار ابن جرير أنه ثقيل من الوجهين معا كما قال عبدالرحمن بن زيد بن أسلم كما ثقل في الدنيا ثقل يوم القيامة في الموازين."
    },
    {
      "ayah": 6,
      "surah": 73,
      "text": "قال أبو إسحاق عن سعيد بن جبير عن ابن عباس نشأ قام بالحبشية وقال عمر وابن عباس وابن الزبير الليل كله ناشئة وكذا قال مجاهد وغير واحد يقال نشأ: إذا قام من الليل وفي رواية عن مجاهد بعد العشاء وكذا قال أبو مجلز وقتادة وسالم وأبو حازم ومحمد بن المنكدر والغرض أن ناشئة الليل هى ساعاته وأوقاته وكل ساعة منه تسمى ناشئة وهي الآنات والمقصود أن قيام الليل هو أشد مواطأة بين القلب واللسان وأجمع على التلاوة ولهذا قال تعالى \"هي أشد وطأ وأقوم قيلا\" أي أجمع للخاطر في أداء القراءة وتفهمها من قيام النهار لأنه وقت انتشار الناس ولغط الأصوات وأوقات المعاش. وقال الحافظ أبو يعلى الموصلي حدثنا إبراهيم بن سعيد الجوهري حدثنا أبو أسامة حدثنا الأعمش أن أنس بن مالك قرأ هذه الآية \"إن ناشئة الليل هي أشد وطأ وأصوب قيلا\" فقال له رجل إنما نقرؤها \"وأقوم قيلا\" فقال له إن أصوب وأقوم وأهيأ وأشباه هذا واحد."
    },
    {
      "ayah": 7,
      "surah": 73,
      "text": "قال ابن عباس وعكرمة وعطاء بن أبي مسلم الفراغ والنوم وقال أبو العالية ومجاهد وأبن مالك والضحاك والحسن وقتادة والربيع بن أنس وسفيان الثوري فراغا طويلا وقال قتادة فراغا وبغية ومتقلبا وقال السدي \"سبحا طويلا\" تطوعا كثيرا وقال عبدالرحمن بن زيد بن أسلم في قوله تعالى \"إن لك في النهار سبحا طويلا\" قال لحوائجك فأفرغ لدينك الليل قال وهذا حين كانت صلاة الليل فريضة ثم إن الله تبارك وتعالى من على عباده فخففها ووضعها وقرأ \"قم الليل إلا قليلا\" إلى آخر الآية ثم قال \"إن ربك يعلم أنك تقوم أدنى من ثلثي الليل ونصفه - حتى بلغ - فاقرءوا ما تيسر منه\" وقال تعالى \"ومن الليل فتهجد به نافلة لك عسى أن يبعثك ربى مقاما محمودا\" وهذا الذي قاله كما قاله والدليل عليه ما رواه الإمام أحمد في مسنده حيث قال حدثنا يحيى حدثنا سعيد هو ابن أبي عروبه عن قتادة عن زرارة بن أوفى عن سعيد بن هشام أنه طلق امرأته ثم ارتحل الى المدينة ليبيع عقارا له بها ويجعله في الكراع والسلاح ثم يجاهد الروم حتى يموت فلقي رهطا من قومه فحدثوه أن رهطا من قومه ستة أرادوا ذلك على عهد رسول الله صلى الله عليه وسلم فقال \"أليس لكم في أسوة حسنة؟\" فنهاهم عن ذلك فأشهدهم على رجعتها ثم رجع إلينا فأخبرنا أنه أتى ابن عباس فسأله عن الوتر فقال ألا أنبئك بأعلم أهل الأرض بوتر رسول الله صلى الله عليه وسلم؟ قال نعم قال أئت عائشة فسلها ثم ارجع إلي فأخبرني بردها عليك قال فأتيت على حكيم بن أفلح فاستلحقته إليها فقال ما أنا بقاربها إني نهيتها أن تقول في هاتين الشيعتين شيئا فأبت فيهما إلا مضيا فأقسمت عليه فجاء معي فدخلنا عليها فقالت حكيم وعرفته قال نعم قالت من هذا معك؟ قال سعيد بن هشام قالت من هشام؟ قال ابن عامر قال فترحمت عليه وقالت نعم المرء كان عامر قلت يا أم المؤمنين أنبئيني عن خلق رسول صلى الله عليه وسلم؟ قالت ألست تقرأ القرآن قلت بلى قالت فإن خلق رسول الله صلى الله عليه وسلم كان القرآن فهممت أن أقوم ثم بدا لى قيام رسول الله صلى الله عليه وسلم قلت يا أم المؤمنين أنبئيني عن قيام رسول الله قالت ألست تقرأ هذه السورة \"يا أيها المزمل\" قلت بلى قالت فإن الله افترض قيام الليل في أول هذه السورة فقام رسول الله صلى الله عليه وسلم وأصحابه حولا حتى انتفخت أقدامهم وأمسك الله خاتمتها في السماء اثني عشر شهرا ثم أنزل الله التخفيف في آخر هذه السورة فصار قيام الليل تطوعا من بعد فريضة فهممت أن أقوم ثم بدا لي وتر رسول الله صلى الله عليه وسلم فقلت يا أم المؤمنين أنبئيني عن وتر رسول الله صلى الله عليه وسلم قالت كنا نعد له سواكه وطهوره فيبعثه الله لما شاء أن يبعثه من الليل فيتسوك ثم يتوضأ ثم يصلي ركعات لا يجلس فيهن إلا عند الثامنة فيجلس ويذكر ربه تعالى ويدعو ثم ينهض وما يسلم ثم يقوم ليصلي التاسعة ثم يقعد فيذكر الله وحده ثم يدعوه ثم يسلم تسليما يسمعنا ثم يصلي ركعتين وهو جالس بعدما يسلم فتلك إحدى عشرة ركعة يا بني فلما أسن رسول الله صلى الله عليه وسلم وأخذه اللحم أوتر بسبع ثم صلى ركعتين وهو جالس بعدما يسلم فتلك تسع يا بني وكان رسول الله صلى الله عليه وسلم إذا صلى من النهار ثنتي عشرة ركعة ولا أعلم نبي الله صلى الله عليه وسلم قرأ القرآن كله في ليلة حتى أصبح ولا صام شهرا كاملا غير رمضان فأتيت ابن عباس فحدثته بحديثها فقال صدقت أما لو كنت أدخل عليها لأتيتها حتى تشافهني مشافهة هكذا رواه الإمام أحمد بتمامه وقد أخرجه مسلم في صحيحه من حديث قتادة بنحوه. \"طريق أخرى عن عائشة في هذا المعنى\" قال ابن جرير حدثنا ابن وكيع حدثنا زيد بن الحباب وحدثنا ابن حميد حدثنا مهران قالا جميعا واللفظ لابن وكيع عن موسى بن عبيدة حدثني محمد بن طحلاء عن أبي سلمة عن عائشة قالت: كنت أجعل لرسول الله صلى الله عليه وسلم حصيرا يصلى عليه من الليل فتسامع الناس به فاجتمعوا فخرج كالمغضب وكان بهم رحيما فخشي أن يكتب عليهم قيام الليل فقال \"أيها الناس اكلفوا من الأعمال ما تطيقون فإن الله لا يمل من الثواب حتى تملوا من العمل وخير الأعمال ما ديم عليه\" ونزل القرآن \"يا أيها المزمل قم الليل إلا قليلا نصفه أو انقص منه قليلا أو زد عليه\" حتى كان الرجل يربط الحبل ويتعلق فمكثوا بذلك ثمانية أشهر فرأى الله ما يبتغون من رضوانه فرحمهم فردهم إلى الفريضة وترك قيام الليل ورواه ابن أبي حاتم من طريق موسى بن عبيدة الربذي وهو ضعيف والحديث في الصحيح بدون زيادة نزول هذه السورة وهذا السياق قد يوهم أن نزول هذه السورة بالمدينة وليس كذلك وإنما هي مكية وقوله في هذا السياق إن بين نزول أولها وآخرها ثمانية أشهر غريب فقد تقدم في رواية أحمد أنه كان بينهما سنة وقال ابن أبي حاتم حدثنا أبو سعيد الأشج حدثنا أبو أسامة عن مسعر عن سماك الحنفي سمعت ابن عباس يقول: أول ما نزل أول المزمل كانوا يقومون نحوا من قيامهم في شهر رمضان وكان بين أولها وآخرها قريب من سنة وهكذا رواه ابن جرير عن أبي كريب عن أبي أسامة به وقال الثوري ومحمد بن بشر العبدي كلاهما عن مسعر عن سماك عن ابن عباس كان بينهما سنة وروى ابن جرير عن أبي كريب عن وكيع عن إسرائيل عن سماك عن عكرمة عن ابن عاس مثله وقال ابن جرير حدثنا ابن حميد حدثنا مهران عن سفيان عن قيس بن وهب عن أبي عبدالرحمن قال لما نزلت \"يا أيها المزمل\" قاموا حولا حتى ورمت أقدامهم وسوقهم حتى نزلت \"فاقرءوا ما تيسر منه\" قال فاستراح الناس وكذا قال الحسن البصري والسدي. وقال ابن أبي حاتم حدثنا أبو زرعة حدثنا عبيدالله بن عمر القواريري حدثنا معاذ بن هشام حدثنا أبي عن قتادة عن زرارة بن أوفى عن سعيد بن هشام قال: فقلت يعني لعائشة أخبرينا عن قيام رسول الله صلى الله عليه وسلم قالت ألست تقرأ \"يا أيها المزمل\" قلت بلى قالت فإنها كانت قيام رسول الله صلى الله عليه وسلم وأصحابه حتى انتفخت أقدامهم وحبس آخرها في السماء ستة عشر شهرا ثم نزل وقال معمر عن قتادة \"قم الليل إلا قليلا\" قاموا حولا أو حولين حتى انتفخت سوقهم وأقدامهم فأنزل الله تخفيفها بعد في آخر السورة وقال ابن جرير حدثنا ابن حميد حدثنا يعقوب القمي عن جعفر عن سعيد هو ابن جبير قال: لما أنزل الله تعالى على نبيه صلى الله عليه وسلم \"يا أيها المزمل\" قال مكث النبي صلى الله عليه وسلم على هذه الحال عشر سنين يقوم الليل كما أمره وكانت طائفة من أصحابه يقومون معه فأنزل الله تعالى عليه بعد عشر سنين \"إن ربك يعلم أنك تقوم أدنى من ثلثي الليل ونصفه وثلثه وطائفة من الذين معك - إلى قوله تعالى - وأقيموا الصلاة\" فخفف الله تعالى عنهم بعد عشر سنين ورواه ابن أبي حاتم عن أبيه عن عمرو بن رافع عن يعقوب القمي به وقال علي بن أبي طلحة عن ابن عباس في قوله تعالى \"قم الليل إلا قليلا نصفه أو انقص منه قليلا\" فشق ذلك على المؤمنين ثم خفف الله تعالى عنهم ورحمهم فأنزل بعد هذا \"علم أن سيكون منكم مرضى وآخرون يضربون في الأرض يبتغون من فضل الله\" إلى قوله تعالى \"فاقرءوا ما تيسر منه\" فوسع الله تعالى وله الحمد ولم يضيق."
    },
    {
      "ayah": 8,
      "surah": 73,
      "text": "أي أكثر من ذكره وانقطع إليه وتفرغ لعبادته إذا فرغت من أشغالك وما تحتاج إليه من أمور دنياك كما قال تعالى \"فإذا فرغت فانصب\" أي إذا فرغت من أشغالك فانصب في طاعته وعبادته لتكون فارغ البال قاله ابن زيد بمعناه أو قريب منه وقال ابن عباس ومجاهد وأبو صالح وعطية والضحاك والسدي \"وتبتل إليه تبتيلا\" أي أخلص له العبادة وقال الحسن اجتهد وأبتل إليه نفسك. وقال ابن جرير يقال للعابد متبتل ومنه الحديث المروي نهى عن التبتل يعني الانقطاع إلى العبادة وترك التزوج."
    },
    {
      "ayah": 9,
      "surah": 73,
      "text": "أي هو المالك المتصرف في المشارق والمغارب لا إله إلا هو وكما أفردته بالعبادة فأفرده بالتوكل فاتخذه وكيلا كما قال تعالى في الآية الأخرى \"فاعبده وتوكل عليه\" وكقوله \"إياك نعبد وإياك نستعين\" وآيات كثيرة في هذا المعنى فيها الأمر بإفراد العبادة والطاعة لله وتخصيصه بالتوكل عليه."
    }
  ]
}
