{
  "ayahs": [
    {
      "ayah": 1,
      "surah": 74,
      "text": "ثبت في صحيح البخاري من حديث يحيى بن أبي كثير عن أبي سلمة عن جابر أنه كان يقول أول شيء نزل من القرآن \"يا أيها المدثر\" وخالفه الجمهور فذهبوا إلى أن أول القرآن نزولا قوله تعالى \"اقرأ باسم ربك الذي خلق\" كما سيأتى ذلك هناك إن شاء الله تعالى قال البخاري حدثنا يحيى حدثنا وكيع عن علي بن المبارك عن يحيى بن أبي كثير قال: سألت أبا سلمة بن عبدالرحمن عن أول ما نزل من القرآن فقال \"يا أيها المدثر\" قلت يقولون \"اقرأ باسم ربك الذي خلق\" فقال أبو سلمة سألت جابر بن عبدالله عن ذلك وقلت له مثل ما قلت لي فقال جابر لا أحدثك إلا ما حدثنا رسول الله صلى الله عليه وسلم قال \"جاورت بحراء فلما قضيت جواري هبطت فنوديت فنظرت عن يميني فلم أر شيئا ونظرت عن شمالي فلم أر شيئا ونظرت أمامي فلم أر شيئا ونظرت خلفي فلم أر شيئا فرفعت رأسي فرأيت شيئا فأتيت خديجة فقلت دثروني وصبوا علي ماء باردا - قال - فدثروني وصبوا علي ماء باردا\" قال فنزلت \"يا أيها المدثر قم فأنذر وربك فكبر\" هكذا ساقه من هذا الوجه. وقد رواه مسلم من طريق عقيل عن ابن شهاب عن أبى سلمة قال أخبرني جابر بن عبدالله أنه سمع رسول الله صلى الله عليه وسلم يحدث عن فترة الوحي فقال في حديثه \"فبينا أنا أمشي إذ سمعت صوتا من السماء فرفعت بصري قبل السماء فإذا الملك الذي جاءني بحراء قاعد على كرسي بين السماء والأرض فجئثت منه حتى هربت إلى الأرض فجئت إلى أهلى فقلت زملوني زملوني فزملوني فأنزل الله تعالى \"يا أيها المدثر قم فأنذر- إلى- فاهجر\" - قال أبو سلمة والرجز الأوثان - ثم حمي الوحي وتتابع هذا لفظ البخاري وهذا السياق هو المحفوظ وهو يقتضي أنه قد نزل الوحي قبل هذا لقوله \"فإذا الملك الذي كان بحراء\" وهو جبريل حين أتاه بقوله \"اقرأ باسم ربك الذي خلق خلق الإنسان من علق اقرأ وربك الأكرم الذي علم بالقلم علم الإنسان ما لم يعلم\" ثم إنه حصل بعد هذا فترة ثم نزل الملك بعد هذا. ووجه الجمع أن أول شيء نزل بعد فترة الوحي هذه السورة كما قال الإمام أحمد حدثنا حجاج حدثنا ليث حدثنا عقيل عن ابن شهاب قال سمعت أبا سلمة بن عبدالرحمن يقول أخبرني جابر بن عبدالله أنه سمع رسول الله صلى الله عليه وسلم يقول \"ثم فتر الوحي عني فترة فبينا أنا أمشي سمعت صوتا من السماء فرفعت بصري قبل السماء فإذا الملك الذي جاءني قاعد على كرسي بين السماء والأرض فجئثت منه فرقا حتى هويت إلى الأرض فجئت أهلي فقلت لهم زملوني زملوني فزملوني فأنزل الله تعالى \"يا أيها المدثر قم فأنذر وربك فكبر وثيابك فطهر والرجز فاهجر\" ثم حمي الوحي وتتابع\" اخرجاه من حديث الزهري به وقال الطبراني حدثنا محمد بن علي بن شعيب السمسار حدثنا الحسن بن بشر البجلي حدثنا المعافى بن عمران عن إبراهيم بن يزيد سمعت ابن أبي مليكة يقول سمعت ابن عباس يقول إن الوليد بن المغيرة صنع لقريش طعاما فلما أكلوا منه قال ما تقولون في هذا الرجل؟ فقال بعضهم ساحر وقال بعضهم ليس بساحر وقال بعضهم كاهن وقال بعضهم ليس بكاهن وقال بعضهم شاعر وقال بعضهم ليس بشاعر وقال بعضهم بل سحر يؤثر فأجمع رأيهم على أنه سحر يؤثر فبلغ ذلك النبي صلى الله عليه وسلم فحزن وقنع رأسه وتدثر فأنزل الله تعالى \"يا أيها المدثر قم فأنذر وربك فكبر وثيابك فطهر والرجز فاهجر ولا تمنن تستكثر ولربك فاصبر\"."
    },
    {
      "ayah": 10,
      "surah": 74,
      "text": "أي غير سهل عليهم كما قال تعالى \"يقول الكافرون هذا يوم عسر\".وقد روينا عن زرارة بن أوفى قاضي البصرة أنه صلى بهم الصبح فقرأ هذه السورة فلما وصل إلى قوله تعالى \"فإذا نقر في الناقور فذلك يومئذ يوم عسير على الكافرين غير يسير\" شهق شهقة ثم خر ميتا رحمه الله تعالى."
    },
    {
      "ayah": 11,
      "surah": 74,
      "text": "يقول تعالى متوعدا لهذا الخبيث الذي أنعم الله عليه بنعم الدنيا فكفر بأنعم الله وبدلها كفرا وقابلها بالجحود بآيات الله والافتراء عليها وجعلها من قول البشر وقد عدد الله عليه نعمه حيث قال تعالى \"ذرني ومن خلقت وحيدا\" أي خرج من بطن أمه وحده لا مال له ولا ولد ثم رزقه الله تعالى."
    },
    {
      "ayah": 12,
      "surah": 74,
      "text": "أي واسعا كثيرا قيل ألف دينار وقيل مائة ألف دينار وقيل أرضا يستغلها وقيل غير ذلك."
    },
    {
      "ayah": 13,
      "surah": 74,
      "text": "قال مجاهد لا يغيبون أي حضورا عنده لا يسافرون بالتجارات بل مواليهم وأجراؤهم يتولون ذلك عنهم وهم قعود عند أبيهم يتمتع بهم ويتملى بهم وكانوا فيما ذكره السدي وأبو مالك وعاصم بن عمر بن قتادة ثلاثة عشر وقال ابن عباس ومجاهد كانوا عشرة وهذا أبلغ في النعمة وهو إقامتهم عنده."
    },
    { "ayah": 14, "surah": 74, "text": "أي مكنته من صنوف المال والأثاث وغير ذلك." },
    { "ayah": 15, "surah": 74, "text": "لا يوجد تفسير لهذه الأية" },
    { "ayah": 16, "surah": 74, "text": "أي معاندا وهو الكفر على نعمه بعد العلم." },
    {
      "ayah": 17,
      "surah": 74,
      "text": "أي إنما أرهقناه صعودا أي قربناه من العذاب الشاق لبعده عن الإيمان قال الإمام أحمد حدثنا حسن حدثنا ابن لهيعة عن دراج عن أبي الهيثم عن أبي سعيد عن رسول الله صلى الله عليه وسلم \"ويل واد في جهنم يهوى فيه الكافر أربعين خريفا قبل أن يبلغ قعره والصعود جبل من نار يتصعد فيه الكافر سبعين خريفا ثم يهوي به كذلك فيه أبدا\" وقد رواه الترمذي عن عبد بن حميد عن الحسن بن موسى الأشيب به ثم قال غريب لا نعرفه إلا من حديث ابن لهيعة عن دراج كذا قال وقد رواه ابن جرير عن يونس عن عبدالله بن وهب عن عمرو بن الحارث عن دراج وفيه غرابة ونكارة وقال ابن أبي حاتم حدثنا أبو زرعة وعلي بن عبدالرحمن المعروف بعلان المقري قال حدثنا منجاب أخبرنا شريك عن عمار الدهني عن عطية العوفي عن أبي سعيد عن النبي صلى الله عليه وسلم \"سأرهقه صعودا\" قال \"هو جبل في النار من نار يكلف أن يصعده فإذا وضع يده ذابت وإذا رفعها عادت فإذا وضع رجله ذابت وإذا رفعها عادت\" ورواه البزار وابن جريج من حديث شريك به وقال قتادة عن ابن عباس صعودا صخرة في جهنم يسحب عليها الكافر على وجهه وقال السدي صعودا صخرة ملساء في جهنم يكلف أن يصعدها وقال مجاهد \"سأرهقه صعودا\" أي مشقة من العذاب وقال قتادة عذابا لا راحة فيه واختاره ابن جرير."
    },
    {
      "ayah": 18,
      "surah": 74,
      "text": "\"وقدر\" أي تروى ماذا يقول في القرآن حين سئل عن القرآن ففكر ماذا يختلق من المقال."
    },
    { "ayah": 19, "surah": 74, "text": "دعاء عليه." },
    { "ayah": 2, "surah": 74, "text": "أى شمر عن ساق الغزم وأنذر الناس وبهذا حصل الإرسال كما حصل بالأول النبوة." },
    { "ayah": 20, "surah": 74, "text": "دعاء عليه." },
    { "ayah": 21, "surah": 74, "text": "أي أعاد النظرة والتروي." },
    {
      "ayah": 22,
      "surah": 74,
      "text": "\"ثم عبس\" أي قبض بين عينيه وقطب \"وبسر\" أي كلح وكره ومنه قول توبة بن حمير الشاعر: وقد رابني منها صدود رأيته وإعراضها عن حاجتي وبسورها."
    },
    { "ayah": 23, "surah": 74, "text": "أي صرف عن الحق ورجع القهقرى مستكبرا عن الانقياد للقرآن." },
    { "ayah": 24, "surah": 74, "text": "أي هذا سحر ينقله محمد عن غيره عمن قبله ويحكيه عنهم." },
    {
      "ayah": 25,
      "surah": 74,
      "text": "أي ليس بكلام الله وهذا المذكور في هذا السياق هو الوليد بن المغيرة المخزومي أحد رؤساء قريش لعنه الله وكان من خبره في هذا ما رواه العوفي عن ابن عباس قال دخل الوليد بن المغيرة على أبي بكر بن أبي قحافة فسأله عن القرآن فلما أخبره خرج على قريش فقال يا عجبا لما يقول ابن أبي كبشة فوالله ما هو بشعر ولا بسحر ولا بهذي من الجنون وإن قوله لمن كلام الله فلما سمع بذلك النفر من قريش ائتمروا وقالوا والله لئن صبأ الوليد لتصبوا قريش فلما سمع بذلك أبو جهل بن هشام قال أنا والله أكفيكم شأنه فانطلق حتى دخل عليه بيته فقال للوليد ألم تر إلى قومك قد جمعوا لك الصدقة؟ فقال ألست أكثرهم مالا وولدا؟ فقال له أبو جهل يتحدثون أنك إنما تدخل على ابن أبي قحافة لتصيب من طعامه فقال الوليد أقد تحدث به عشيرتي؟ فلا والله لا أقرب ابن أبي قحافة ولا عمر ولا ابن أبي كبشة وما قوله إلا سحر يؤثر فأنزل الله على رسوله صلى الله عليه وسلم \"ذرني ومن خلقت وحيدا- إلى قوله- لا تبقي ولا تذر\" وقال قتادة: زعموا أنه قال والله لقد نظرت فيما قال الرجل فإذا هو ليس بشعر وإن له لحلاوة وإن عليه لطلاوة وإنه ليعلو وما يعلى عليه وما أشك أنه سحر فأنزل الله \"فقتل كيف قدر\" الآية \"ثم عبس وبسر\" قبض ما بين عينيه وكلح وقال ابن جرير حدثنا ابن عبدالأعلى حدثنا محمد بن ثور عن معمر عن عبادة بن منصور عن عكرمة أن الوليد بن المغيرة جاء إلى النبي صلى الله عليه وسلم فقرأ عليه القرآن فكأنه رق له فبلغ ذلك أبا جهل بن هشام فأتاه فقال أي عم إن قومك يريدون أن يجمعوا لك مالا قال لم؟ قال يعطونكه فإنك أتيت محمدا تتعرض لما قبله قال قد علمت قريش أني أكثرها مالا قال: فقل فيه قولا يعلم قومك أنك منكر لما قال وأنك كاره له قال فماذا أقول فيه؟ فوالله ما منكم رجل أعلم بالأشعار مني ولا أعلم برجزه ولا بقصيده ولا بأشعار الجن والله ما يشبه الذي يقوله شيئا من هذا والله إن لقوله الذي يقوله لحلاوة وإنه ليحطم ما تحته وإنه ليعلو وما يعلى وقال والله لا يرضي قومك حتى تقول فيه قال فدعني حتى أفكر فيه فلما فكر قال: إن هذا إلا سحر يؤثره عن غيره فنزلت \"ذرني ومن خلقت وحيدا- حتى بلغ- تسعة عشر\" وقد ذكر محمد بن إسحاق وغير واحد نحوا من هذا. وقد زعم السدي أنهم لما اجتمعوا في دار الندوة ليجمعوا رأيهم على قول يقولونه فيه قبل أن يقدم عليهم وفود العرب للحج ليصدوهم عنه فقال قائلون شاعر وقال آخرون ساحر وقال آخرون كاهن وقال آخرون مجنون كما قال تعالى \"انظر كيف ضربوا لك الأمثال فضلوا فلا يستطيعون سبيلا\" كل هذا والوليد يفكر فيما يقوله فيه ففكر وقدر ونظر وعبس وبسر فقال إن هذا إلا سحر يؤثر إن هذا إلا قول البشر."
    },
    { "ayah": 26, "surah": 74, "text": "أي سأغمره فيها من جميع جهاته." },
    { "ayah": 27, "surah": 74, "text": "وهذا تهويل لأمرها وتفخيم." },
    {
      "ayah": 28,
      "surah": 74,
      "text": "أى تأكل لحومهم وعروقهم وعصبهم وجلودهم ثم تبدل غير ذلك وهم في ذلك لا يموتون ولا يحيون قاله ابن بريدة وأبو سنان وغيرهما."
    },
    {
      "ayah": 29,
      "surah": 74,
      "text": "قال مجاهد أي للجلد. وقال أبو رزين: تلفح الجلد لفحة فتدعه أسود من الليل وقال زيد بن أسلم: تلوح أجسادهم عليها. وقال قتادة \"لواحة للبشر\" أي حراقة للجلد وقال ابن عباس: تحرق بشرة الإنسان."
    },
    { "ayah": 3, "surah": 74, "text": "أي عظم." },
    {
      "ayah": 30,
      "surah": 74,
      "text": "أي من مقدمي الزبانبة عظيم خلقهم غليظ خلقهم وقد قال ابن أبي حاتم حدثنا أبو زرعة حدثنا إبراهيم بن موسى حدثنا ابن أبي زائدة أخبرني حارث عن عامر عن البراء في قوله تعالى \"عليها تسعة عشر\" قال إن رهطا من اليهود سألوا رجلا من أصحاب رسول الله صلى الله عليه وسلم عن خزنة جهنم فقال الله ورسوله أعلم فجاء رجل فأخبر النبي صلى الله عليه وسلم فأنزل الله تعالى عليه ساعتئذ \"عليها تسعة عشر\" فأخبر أصحابه وقال \"ادعهم أما إنى سائلهم عن تربة الجنة إن أتوني أما إنها درمكة بيضاء\" فجاءوه فسألوه عن خزنة جهنم فأهوي بأصابع كفيه مرتين وأمسك الإبهام في الثانية ثم قال \"أخبروني عن تربة الجنة\" فقالوا أخبرهم يا ابن سلام فقال كأنها خبزة بيضاء فقال رسول الله صلى الله عليه وسلم \"أما إن الخبز إنما يكون من الدرمك\" هكذا وقع عند ابن أبي حاتم عن البراء والمشهور عن جابر بن عبدالله كما قال الحافظ أبو بكر البزار في مسنده حدثنا منده حدثنا أحمد بن عبيدة أخبرنا سفيان ويحيى بن حكيم حدثنا سفيان عن مجالد عن الشعبي عن جابر بن عبدالله رضي الله عنه قال جاء رجل إلى النبي صلى الله عليه وسلم فقال يا محمد غلب أصحابك اليوم فقال \"بأي شيء\" قال سألتهم يهود هل أعلمكم نبيكم عدة خزنة أهل النار؟ قالوا لا نعلم حتى نسأل نبينا صلى الله عليه وسلم قال رسول الله صلى الله عليه وسلم \"أفغلب قوم يسئلون عما لا يعلمون فقالوا لا نعلم حتى نسأل نبينا صلى الله عليه وسلم؟ على بأعداء الله لكنهم قد سألوا نبيهم أن يريهم الله جهرة\" فأرسل إليهم فدعاهم قالوا يا أبا القاسم كم عدة خزنه أهل النار؟ قال \"هكذا\" وطبق كفيه ثم طبق كفيه مرتين وعقد واحدة وقال لأصحابه \"إن سئلتم عن تربة الجنة فهي الدرمك\" فلما سألوه فأخبرهم بعدة خزنة أهل النار قال لهم رسول الله صلى الله عليه وسلم \"ما تربة الجنة\" فنظر بعضهم إلى بعض فقالوا خبزة يا أبا القاسم فقال \"الخبز من الدرمك\" وهكذا رواه الترمذي عند هذه الآية عن ابن أبي عمر عن سفيان به وقال هو والبزار لا يعرف إلا من حديث مجالد وقد رواه الإمام أحمد عن علي بن المديني عن سفيان بنقص الدرمك فقط."
    },
    {
      "ayah": 31,
      "surah": 74,
      "text": "يقول تعالى \"وما جعلنا أصحاب النار\" أي خزانها \"إلا ملائكة\" أي زبانية غلاظا شدادا وذلك رد على مشركي قريش حين ذكروا عدد الخزنة فقال أبو جهل يا معشر قريش أما يستطيع كل عشرة منكم لواحد منهم فتغلبونهم؟ فقال الله تعالى \"وما جعلنا أصحاب النار إلا ملائكة\" أي شديدي الخلق لا يقاومون ولا يغالبون وقد قيل إن أبا الأشدين واسمه كلدة بن أسيد بن خلف قال يا معشر قريش اكفوني منهم اثنين وأنا أكفيكم منهم سبعة عشر إعجابا منه بنفسه وكان قد بلغ من القوة فيما يزعمون أنه كان يقف على جلد البقرة ويجاذبه عشرة لينزعوه من تحت قدميه فيتمزق الجلد ولا يتزحزح عنه قال السهيلي وهو الذي دعا رسول الله صلى الله عليه وسلم إلى مصارعته وقال إن صرعتني آمنت بك فصرعه صلى الله عليه وسلم مرارا فلم يؤمن قال وقد نسب ابن إسحاق خبر المصارعة إلى ركانة بن عبد يزيد بن هاشم بن المطلب \"قلت\" ولا منافاة بين ما ذكراه والله أعلم. وقوله تعالى \"وما جعلنا عدتهم إلا فتنة للذين كفروا\" أي إنما ذكرنا عدتهم أنهم تسعة عشر اختبارا منا للناس \"ليستيقن الذين أوتوا الكتاب\" أي يعلمون أن هذا الرسول حق فإنه نطق بمطابقة ما بأيديهم من الكتب السماوية المنزلة على الأنبياء قبله وقوله تعالى \"ويزداد الذين آمنوا إيمانا\" أي إلى إيمانهم بما يشهدون من صدق إخبار نبيهم محمد صلى الله عليه وسلم \"ولا يرتاب الذين أوتوا الكتاب والمؤمنون وليقول الذين في قلوبهم مرض\" أي من المنافقين \"والكافرون ماذا أراد الله بهذا مثلا\" أي يقولون ما الحكمة فى ذكر هذا ههنا؟ قال الله تعالى \"كذلك يضل الله من يشاء ويهدي من يشاء\" أي من مثل هذا وأشباهه يتأكد الإيمان في قلوب أقوام ويتزلزل عند آخرين وله الحكمة البالغة والحجة الدامغة وقوله تعالى \"وما يعلم جنود ربك إلا هو\" أي ما يعلم عددهم وكثرتهم إلا هو تعالى لئلا يتوهم متوهم أنهم تسعة عشر فقط كما قد قاله طائفة من أهل الضلالة والجهالة ومن الفلاسفة اليونانيين ومن شايعهم من الملتين الذين سمعوا هذه الآية فأرادوا تنزيلها على العقول العشرة والنفوس التسعة التي اخترعوا دعواها وعجزوا عن إقامة الدلالة على مقتضاها فأفهموا صدر هذه الآية وقد كفروا بآخرها وهو قوله \"وما يعلم جنود ربك إلا هو\" وقد ثبت في حديث الإسراء المروي في الصحيحين وغيرهما عن رسول الله صلى الله عليه وسلم أنه قال في صفة البيت المعمور الذي في السماء السابعة \"فإذا هو يدخله في كل يوم سبعون ألف ملك لا يعودون إليه آخر ما عليهم\". وقال الإمام أحمد حدثنا أسود حدثنا إسرائيل عن إبراهيم بن مهاجر عن مجاهد عن مورق عن أبي ذر قال: قال رسول الله صلى الله عليه وسلم \"إني أرى ما لا ترون وأسمع ما لا تسمعون أطت السماء وحق لها أن تئط ما فيها موضع أصبع إلا عليه ملك ساجد لو علمتم ما أعلم لضحكتم قليلا ولبكيتم كثيرا ولا تلذذتم بالنساء على الفرشات ولخرجتم إلى الصعدات تجأرون إلى الله تعالى\" فقال أبو ذر والله لوددت أنى شجرة تعضد ورواه الترمذي وابن ماجه من حديث إسرائيل وقال الترمذي حديث حسن غريب ويروى عن أبي ذر موقوفا. قال الحافظ أبو القاسم الطبراني حدثنا حسين بن عرفة المصري حدثنا عروة بن مروان الرقي حدثنا عبيدالله بن عمرو عن عبدالكريم بن مالك عن عطاء بن أبي رباح عن جابر بن عبدالله قال: قال رسول الله صلى الله عليه وسلم \"ما في السموات السبع موضع قدم ولا شبر ولا كف إلا وفيه ملك قائم أو ملك ساجد أو ملك راكع فإذا كان يوم القيامة قالوا جميعا سبحانك ما عبدناك حق عبادتك إلا أنا لم نشرك بك شيئا\". وقال محمد بن نصر المروزي في كتاب الصلاة حدثنا عمرو بن زرارة أخبرنا عبدالوهاب عن عطاء عن سعيد عن قتادة عن صفوان بن محرز عن حكيم بن حزام قال بينما رسول الله صلى الله عليه وسلم مع أصحابه إذ قال لهم \"هل تسمعون ما أسمع؟\" قالوا ما نسمع من شيء فقال رسول الله صلى الله عليه وسلم \"أسمع أطيط السماء وما تلام أن تئط ما فيها موضع شبر إلا وعليه ملك راكع أو ساجد\". وقال أيضا حدثنا محمد بن عبدالله بن قهذاذ حدثنا أبو معاذ الفضل بن خالد النحوي حدثنا عبيد بن سليمان الباهلي سمعت الضحاك بن مزاحم يحدث عن مسروق بن الأجدع عن عائشة أنها قالت: قال رسول الله صلى الله عليه وسلم \"ما في السماء الدنيا موضع قدم إلا وعليه ملك ساجد أو قائم\" وذلك قول الملائكة \"وما منا إلا له مقام معلوم وإنا لنحن الصافون وإنا لنحن المسبحون\" وهذا مرفوع غريب جدا ثم رواه عن محمود بن آدم عن أبي معاوية عن الأعمش عن أبي الضحى عن مسروق عن ابن مسعود أنه قال: إن من السموات سماء ما فيها موضع شبر إلا وعليه جبهة ملك أو قدماه قائم ثم قرأ \"وإنا لنحن الصافون وإنا لنحن المسبحون\" ثم قال حدثنا أحمد بن سيار حدثنا أبو جعفر محمد بن خالد الدمشقي المعروف بابن أمه حدثنا المغيرة بن عمر بن عطية من بني عمرو بن عوف حدثني سليمان بن أيوب عن سالم بن عوف حدثني عطاء بن زيد بن مسعود من بني الحكم حدثني سليمان بن عمرو بن الربيع من بني سالم حدثني عبدالرحمن بن العلاء من بني ساعدة عن أبيه العلاء بن سعد وقد شهد الفتح وما بعده أن النبي صلى الله عليه وسلم قال يوما لجلسائه \"هل تسمعون ما أسمع؟\" قالوا وما تسمع يا رسول الله ؟ قال \"أطت السماء وحق لها أن تئط إنه ليس فيها موضع قدم إلا وعليه ملك قائم أو راكع أو ساجد وقالت الملائكة \"وإنا لنحن الصافون وإنا لنحن المسبحون\" وهذا إسناد غريب جدا ثم قال حدثنا إسحاق بن محمد بن إسماعيل الفروي حدثنا عبدالملك بن قدامة عن عبدالرحمن عن عبدالله بن دينار عن أبيه عن عبدالله بن عمر أن عمر جاء والصلاة قائمة ونفر ثلاثة جلوس أحدهم أبو جحش الليثي فقال قوموا فصلوا مع رسول الله صلى الله عليه وسلم فقام اثنان وأبى أبو جحش أن يقوم وقال لا أقوم حتى يأتي رجل هو أقوى مني ذراعين وأشد مني بطشا فيصرعني ثم يدس وجهي في التراب قال عمر فصرعته ودسست وجهه فى التراب فأتى عثمان بن عفان فحجزني عنه فخرج عمر مغضبا حتى انتهى إلى رسول الله صلى الله عليه وسلم فقال \"ما رأيك يا أبا حفص؟\" فذكر له ما كان منه فقال رسول الله صلى الله عليه وسلم \"إن رضي عمر رحمه والله على ذلك لوددت أنك جئتني برأس الخبيث\" فقام عمر فوجه نحوه فلما أبعد ناداه فقال \"اجلس حتى أخبرك بغناء الرب تبارك وتعالى عن صلاة ابن جحش وإن لله تعالى في السماء الدنيا ملائكة خشوع لا يرفعون رءوسهم حتى تقوم الساعة فإذا قامت رفعوا رءوسهم ثم قالوا ربنا ما عبدناك حق عبادتك وإن لله في السماء الثانية ملائكة سجود لا يرفعون رءوسهم حتى تقوم الساعة فإذا قامت الساعة رفعوا رءوسهم وقالوا سبحانك ربنا ما عبدناك حق عبادتك\" فقال له عمر وما يقولون يا رسول الله ؟ فقال \"أما أهل السماء الدنيا فيقولن سبحان ذي الملك والملكوت وأما أهل السماء الثانية فيقولون سبحان ذي العزة والجبروت. وأما أهل السماء الثالثة فيقولون سبحان الحي الذي لا يموت فقلها يا عمر في صلاتك فقال عمر يا رسول الله فكيف بالذي كنت علمتني وأمرتني أن أقوله في صلاتي؟ فقال \"قل هذا مرة وهذا مرة\" وكان الذي أمره به أن يقوله \"أعوذ بعفوك من عقابك وأعوذ برضاك من سخطك وأعوذ بك منك جل وجهك\" هذا حديث غريب جدا بل منكر نكارة شديدة وإسحاق المروزي روى عنه البخاري وذكره ابن حبان في الثقات وضعفه أبو داود والنسائي والعقيلي والدارقطني وقال أبو حاتم الرازي كان صدوقا إلا أنه ذهب بصره فربما لقن وكتبه صحيحة وقال مرة هو مضطرب وشيخه عبدالملك بن قدامة أبو قتادة الجمحي تكلم فيه أيضا والعجب من الإمام محمد بن نصر كيف رواه ولم يتكلم عليه ولا عرف بحاله ولا تعرض لضعف بعض رجاله غير أنه رواه من وجه آخر عن سعيد بن جبير مرسلا بنحوه ومن طريق أخرى عن الحسن البصري مرسلا قريبا منه ثم قال محمد بن نصر حدثنا محمد بن عبدالله بن قهذاذ أخبرنا النضر اخبرنا عباد بن منصور قال سمعت عدي بن أرطاة وهو يخطبنا على منبر المدائن قال سمعت رجلا من أصحاب النبي صلى الله عليه وسلم عن رسول الله صلى الله عليه وسلم قال \"إن لله تعالى ملائكة ترعد فرائصهم من خيفته ما منهم ملك تقطر منه دمعة من عينه إلا وقعت على ملك يصلى وأن منهم ملائكة سجودا منذ خلق الله السموات والأرض لم يرفعوا رءوسهم ولا يرفعونها إلى يوم القيامة وإن منهم ملائكة ركوعا لم يرفعوا رؤسهم منذ خلق الله السموات والأرض ولا يرفعونها إلى يوم القيامة فإذا رفعوا رءوسهم نظروا إلى وجه الله عز وجل قالوا سبحانك ما عبدناك حق عبادتك\" وهذا إسناد لا بأس به وقوله تعالى \"وما هى إلا ذكرى للبشر\" قال مجاهد وغير واحد \"وما هي\" أي النار التي وصفت \"إلا ذكرى للبشر\"."
    },
    { "ayah": 32, "surah": 74, "text": "لا يوجد تفسير لهذه الأية" },
    { "ayah": 33, "surah": 74, "text": "أي ولى." },
    { "ayah": 34, "surah": 74, "text": "أي أشرق." },
    {
      "ayah": 35,
      "surah": 74,
      "text": "أي العظائم يعني النار. قاله ابن عباس ومجاهد وقتادة والضحاك وغير واحد من السلف."
    },
    { "ayah": 36, "surah": 74, "text": "أي لمن شاء أن يقبل النذارة ويهتدي للحق." },
    { "ayah": 37, "surah": 74, "text": "أي لمن شاء أن يقبل النذارة ويهتدي للحق أو يتأخر عنها ويولي دبرها." },
    { "ayah": 38, "surah": 74, "text": "أي معتقلة بعملها يوم القيامة قاله ابن عباس وغيره." },
    {
      "ayah": 39,
      "surah": 74,
      "text": "\"إلا أصحاب اليمين\" فإنهم \"في جنات يتساءلون عن المجرمين\" أي يسألون المجرمين وهم في الغرفات وأولئك في الدركات."
    },
    {
      "ayah": 4,
      "surah": 74,
      "text": "قال الأجلح الكندي عن عكرمة عن ابن عباس أنه أتاه رجل فسأله عن هذه الآية \"وثيابك فطهر\" قال لا تلبسها على معصية ولا على غدرة ثم قال أما سمعت قول غيلان بن سلمة الثقفى: فإني بحمد الله لا ثوب فاجر لبست ولا من غدرة أتقنع وقال ابن جريج عن عطاء عن ابن عباس في هذه الآية \"وثيابك فطهر\" قال في كلام العرب نقي الثياب وفي رواية بهذا الإسناد فطهر من الذنوب وكذا قال إبراهيم الشعبي وعطاء وقال الثوري عن رجل عن عطاء عن ابن عباس في هذه الآية \"وثيابك فطهر\" قال من الإثم وكذا قال إبراهيم النخعي وقال مجاهد \"وثيابك فطهر\" قال نفسك ليس ثيابه وفي رواية عنه \"وثيابك فطهر\" أى عملك فأصلح وكذا قال أبو رزين وقال في رواية أخرى \"وثيابك فطهر\" أى لست بكاهن ولا ساحر فأعرض عما قالوا وقال قتادة \"وثيابك فطهر\" أي طهرها من المعاصي وكانت العرب تسمي الرجل إذا نكث ولم يف بعهد الله إنه لدنس الثياب وإذا وفى وأصلح إنه لمطهر الثياب وقال عكرمة والضحاك لا تلبسها على معصية وقال الشاعر: إذا المرء لم يدنس من اللؤم عرضه فكل رداء يرتديه جميل وقال العوفي عن ابن عباس \"وثيابك فطهر\" يعني لا تكن ثيابك التي تلبس من مكسب غير طائب ويقال لا تلبس ثيابك على معصية وقال محمد بن سيرين \"وثيابك فطهر\" أي غسلها بالماء وقال ابن زيد كان المشركون لا يتطهرون فأمره الله أن يتطهر وأن يطهر ثيابه وهذا القول اختاره ابن جرير وقد تشمل الآية جميع ذلك مع طهارة القلب فإن العرب تطلق الثياب عليه كما قال امرؤ القيس: أفاطم مهلا بعض هذا التدلل وإن كنت قد أزمعت هجري فأجملي وإن تك قد ساءتك مني خليقة فسلي ثيابي من ثيابك تنسل وقال سعيد بن جبير \"وثيابك فطهر\" وقلبك ونيتك فطهر وقال محمد بن كعب القرظي والحسن البصري وخلقك فحسن."
    },
    {
      "ayah": 40,
      "surah": 74,
      "text": "\"إلا أصحاب اليمين\" فإنهم \"في جنات يتساءلون عن المجرمين\" أي يسألون المجرمين وهم في الغرفات وأولئك في الدركات."
    },
    {
      "ayah": 41,
      "surah": 74,
      "text": "\"إلا أصحاب اليمين\" فإنهم \"في جنات يتساءلون عن المجرمين\" أي يسألون المجرمين وهم في الغرفات وأولئك في الدركات."
    },
    {
      "ayah": 42,
      "surah": 74,
      "text": "قائلين لهم \"ما سلككم فى سقر قالوا لم نك من المصلين ولم نك نطعم المسكين\" أي ما عبدنا ربنا ولا أحسنا إلى خلقه من جنسنا."
    },
    { "ayah": 43, "surah": 74, "text": "أي ما عبدنا ربنا." },
    { "ayah": 44, "surah": 74, "text": "ولا أحسنا إلى خلقه من جنسنا." },
    { "ayah": 45, "surah": 74, "text": "أي نتكلم فيما لا نعلم وقال قتادة: كلما غوى غاو غوينا معه." },
    { "ayah": 46, "surah": 74, "text": "لا يوجد تفسير لهذه الأية" },
    {
      "ayah": 47,
      "surah": 74,
      "text": "يعني الموت كقوله تعالى \"واعبد ربك حتى يأتيك اليقين\" وقال رسول الله صلى الله عليه وسلم \"أما هو- يعني عثمان بن مظعون - فقد جاءه اليقين من ربه\"."
    },
    {
      "ayah": 48,
      "surah": 74,
      "text": "أي من كان متصفا بمثل هذه الصفات فإنه لا تنفعه يوم القيامة شفاعة شافع لأن الشفاعة إنما تنجع إذا كان المحل قابلا فأما من وافى الله كافرا يوم القيامة فإنه له النار لا محالة خالدا فيها."
    },
    { "ayah": 49, "surah": 74, "text": "أي فما لهؤلاء الكفرة الذين قبلك مما تدعوهم إليه وتذكرهم به معرضين." },
    {
      "ayah": 5,
      "surah": 74,
      "text": "قال علي بن أبي طلحة عن ابن عباس والرجز وهو الأصنام فاهجر وكذا قال مجاهد وعكرمة وقتادة والزهري وابن زيد إنها الأوثان وقال إبراهيم والضحاك \"والرجز فاهجر\" أي اترك المعصية وعلى كل تقدير فلا يلزم تلبسه بشيء من ذلك كقوله تعالى \"يا أيها النبي اتق الله ولا تطع الكافرين والمنافقين\" \"وقال موسى لأخيه هارون اخلفني في قومي وأصلح ولا تتبع سبيل المفسدين\"."
    },
    { "ayah": 50, "surah": 74, "text": "أي كأنهم في نفارهم عن الحق وإعراضهم عنه حمر من حمر الوحش." },
    {
      "ayah": 51,
      "surah": 74,
      "text": "أي كأنهم في نفارهم عن الحق وإعراضهم عنه حمر من حمر الوحش إذا فرت ممن يريد صيدها من أسد قاله أبو هريرة وابن عباس في رواية عنه وزيد بن أسلم وابنه عبدالرحمن أو رام وهو رواية عن ابن عباس وهو قول الجمهور. وقال حماد بن سلمة عن علي بن زيد عن يوسف بن ماهك عن ابن عباس الأسد بالعربية ويقال له بالحبشية قسورة وبالفارسية شير وبالنبطية أوبا."
    },
    {
      "ayah": 52,
      "surah": 74,
      "text": "أي بل يريد كل واحد من هؤلاء المشركين أن ينزل عليه كتاب كما أنزل الله على النبي صلى الله عليه وسلم قاله مجاهد وغيره كقوله تعالى \"وإذا جاءتهم آية قالوا لن نؤمن حتى نؤتى مثل ما أوتي رسل الله الله أعلم حيث يجعل رسالته\" وفي رواية عن قتادة يريدون أن يؤتوا براءة بغير عمل."
    },
    { "ayah": 53, "surah": 74, "text": "أي إنما أفسدهم عدم إيمانهم بها وتكذيبهم بوقوعها." },
    { "ayah": 54, "surah": 74, "text": "أي حقا إن القرآن تذكرة." },
    {
      "ayah": 55,
      "surah": 74,
      "text": "\"فمن شاء ذكره وما يذكرون إلا أن يشاء الله\" كقوله \"وما تشاءون إلا أن يشاء الله\" وقوله تعالى \"هو أهل التقوى وأهل المغفرة\" أي هو أهل أن يخاف منه وهو أهل أن يغفر ذنب من تاب إليه وأناب. قاله قتادة. وقال الإمام أحمد حدثنا زيد بن الحباب أخبرني سهيل أخو حمزة حدثنا ثابت البناني عن أنس بن مالك رضي الله عنه قال قرأ رسول الله صلى الله عليه وسلم هذه الآية \"هو أهل التقوى وأهل المغفرة\" وقال \"قال ربكم أنا أهل أن أتقى فلا يجعل معي إله فمن اتقى أن يجعل معي إلها كان أهلا أن أغفر له\" ورواه الترمذي وابن ماجه من حديث زيد بن الحباب والنسائي من حديث المعافى بن عمران كلاهما عن سهيل بن عبدالله القطيعي به وقال الترمذي حسن غريب وسهيل ليس بالقوي ورواه ابن أبي حاتم عن أبيه عن هدبة بن خالد عن سهيل به وهكذا رواه أبو يعلى والبزار والبغوي وغيرهم من حديث سهيل القطيعي به. آخر تفسير سوره المدثر ولله الحمد والمنة."
    },
    {
      "ayah": 56,
      "surah": 74,
      "text": "وما يذكرون إلا أن يشاء الله هو أهل التقوى وأهل المغفرة\" فمن شاء ذكره وما يذكرون إلا أن يشاء الله \" كقوله \" وما تشاءون إلا أن يشاء الله \" وقوله تعالى \" هو أهل التقوى وأهل المغفرة\" أي هو أهل أن يخاف منه وهو أهل أن يغفر ذنب من تاب إليه وأناب . قاله قتادة . وقال الإمام أحمد حدثنا زيد بن الحباب أخبرني سهيل أخو حمزة حدثنا ثابت البناني عن أنس بن مالك رضي الله عنه قال قرأ رسول الله صلى الله عليه وسلم هذه الآية \" هو أهل التقوى وأهل المغفرة \" وقال\" قال ربكم أنا أهل أن أتقى فلا يجعل معي إله فمن اتقى أن يجعل معي إلها كان أهلا أن أغفر له \" ورواه الترمذي وابن ماجه من حديث زيد بن الحباب والنسائي من حديث المعافى بن عمران كلاهما عن سهيل بن عبد الله القطيعي به وقال الترمذي حسن غريب وسهيل ليس بالقوي ورواه ابن أبي حاتم عن أبيه عن هدبة بن خالد عن سهيل به وهكذا رواه أبو يعلى والبزار والبغوي وغيرهم من حديث سهيل القطيعي به . آخر تفسير سوره المدثر ولله الحمد والمنة ."
    },
    {
      "ayah": 6,
      "surah": 74,
      "text": "قال ابن عباس لا تعط العطية تلتمس أكثر منها وكذا قال عكرمة ومجاهد وعطاء وطاوس وأبو الأحوص وإبراهيم النخعي والضحاك وقتادة والسدي وغيرهم وروي عن ابن مسعود أنه قرأ \"ولا تمنن أن تستكثر\" وقال الحسن البصري لا تمنن بعملك على ربك تستكثره وكذا قال الربيع بن أنس واختاره ابن جرير وقال خصيف عن مجاهد في قوله تعالى \"ولا تمنن تستكثر\" قال لا تضعف أن تستكثر من الخير قال تمنن في كلام العرب تضعف وقال ابن زيد: لا تمنن بالنبوة على الناس تستكثرهم بها تأخذ عليه عوضا من الدنيا فهذه أربعة أقوال والأظهر القول الأول والله أعلم."
    },
    {
      "ayah": 7,
      "surah": 74,
      "text": "أي اجعل صبرك على أذاهم لوجه ربك عز وجل قاله مجاهد وقال إبراهيم النخعي اصبر عطيتك لله عز وجل."
    },
    {
      "ayah": 8,
      "surah": 74,
      "text": "قال ابن عباس ومجاهد والشعبي وزيد بن أسلم والحسن وقتادة والضحاك والربيع بن أنس والسدي وابن زيد \"الناقور\" الصور قال مجاهد وهو كهيئة القرن وقال ابن أبي حاتم حدثنا أبو سعيد الأشج حدثنا أسباط بن محمد عن مطرف عن عطية العوفي عن ابن عباس \"فإذا نقر في الناقور\" فقال: قال رسول الله صلى الله عليه وسلم \"كيف أنعم وصاحب القرن قد التقم القرن وحنى جبهته ينتظر متى يؤمر فينفخ\" فقال أصحاب رسول الله صلى الله عليه وسلم فما تأمرنا يا رسول الله؟ قال \"قولوا حسبنا الله ونعم الوكيل على الله توكلنا\" وهكذا رواه الإمام أحمد عن أسباط به ورواه ابن جرير عن أبى كريب عن ابن فضيل وأسباط كلاهما عن مطرف به ورواه من طريق أخرى عن العوفي عن ابن عباس به."
    },
    { "ayah": 9, "surah": 74, "text": "أي شديد." }
  ]
}
