{
  "ayahs": [
    {
      "ayah": 1,
      "surah": 75,
      "text": "قد تقدم غير مرة أن المقسم عليه إذا كان منتفيا جاز الإتيان بلا قبل القسم لتأكيدا النفي والمقسم عليه ههنا هو إثبات المعاد والرد على ما يزعمه الجهلة من العباد ومن عدم بعث الأجساد ولهذا قال تعالى \"لا أقسم بيوم القيامة ولا أقسم بالنفس اللوامة\" قال الحسن أقسم بيوم القيامة ولم يقسم بالنفس اللوامة وقال قتادة بل أقسم بهما جميعا هكذا حكاه ابن أبي حاتم وقد حكى ابن جرير عن الحسن والأعرج أنهما قرءا \"لأقسم بيوم القيامة\" وهذا يوجه قول الحسن لأنه أثبت القسم بيوم القيامة ونفي القسم بالنفس اللوامة والصحيح أنه أقسم بهما جميعا معا كما قاله قتادة رحمه الله وهو المروي عن ابن عباس وسعيد بن جبير واختاره ابن جرير فأما يوم القيامة فمعروف وأما النفس اللوامة فقال قرة بن خالد عن الحسن البصري في هذه الآية أن المؤمن والله ما نراه إلا يلوم نفسه: ما أردت بكلمتي ما أردت بأكلتي ما أردت بحديث نفسي. وإن الفاجر يمضي قدما ما يعاتب نفسه."
    },
    {
      "ayah": 10,
      "surah": 75,
      "text": "أي إذا عاين ابن آدم هذه الأهوال يوم القيامة حينئذ يريد أن يفر ويقول أين المفر أي هل من ملجإ أو موئل."
    },
    {
      "ayah": 11,
      "surah": 75,
      "text": "قال ابن مسعود وابن عباس وسعيد بن جبير وغير واحد من السلف أي لا نجاة وهذه الآية كقوله تعالى \"ما لكم من ملجأ يومئذ وما لكم من نكير\" أي ليس لكم مكان تتنكرون فيه وكذا قال ههنا \"لا وزر\" أي ليس لكم مكان تعتصمون فيه."
    },
    { "ayah": 12, "surah": 75, "text": "أي المرجع والمصير." },
    {
      "ayah": 13,
      "surah": 75,
      "text": "أي يخبر بجميع أعماله قديمها وحديثها أولها وآخرها صغيرها وكبيرها كما قال تعالى \"ووجدوا ما عملوا حاضرا ولا يظلم ربك أحدا\"."
    },
    {
      "ayah": 14,
      "surah": 75,
      "text": "\"بل الإنسان على نفسه بصيرة ولو ألقى معاذيره\" أي هو شهيد على نفسه عالم بما فعله ولو اعتذر وأنكر كما قال تعالى \"اقرأ كتابك كفى بنفسك اليوم عليك حسيبا\" وقال علي بن أبي طلحة عن ابن عباس \"بل الإنسان على نفسه بصيرة\" يقول سمعه وبصره ويديه ورجليه وجوارحه وقال قتادة شاهد على نفسه وفي رواية قال إذا شئت والله رأيته بصيرا بعيوب الناس وذنوبهم غافلا عن ذنوبه وكان يقال إن في الإنجيل مكتوبا يا أبن آدم تبصر القذاة في عين أخيك وتترك الجذع في عينك لا تبصره؟."
    },
    {
      "ayah": 15,
      "surah": 75,
      "text": "وقال مجاهد \"ولو ألقى معاذيره\" ولو جادل عنها فهو بصير عليها وقال قتادة \"ولو ألقى معاذيره\" ولو اعتذر يومئذ بباطل لا يقبل منه وقال السدى \"ولو ألقى معاذيره\" حجته وكذا قال ابن زيد والحسن البصري وغيرهم واختاره ابن جرير وقال قتادة عن زرارة عن ابن عباس \"ولو ألقى معاذيره\" يقول لو ألقى بهتانه وقال الضحاك ولو ألقى ستوره وأهل اليمن يسمون الستر العذار والصحيح قول مجاهد وأصحابه كقوله تعالى \"ثم لم تكن فتنتهم إلا أن قالوا والله ربنا ما كنا مشركين\" وكقوله تعالى \"يوم يبعثهم الله جميعا فيحلفون له كما يحلفون لكم ويحسبون أنهم على شيء ألا إنهم هم الكاذبون\" وقال العوفي عن ابن عباس \"ولو ألقى معاذيره\" هى الإعتذار ألم تسمع أنه قال \"لا ينفع الظالمين معذرتهم\" وقال \"وألقوا إلى الله يومئذ السلم ما كنا نعمل من سوء\" وقولهم \"والله ربنا ما كنا مشركين\"."
    },
    {
      "ayah": 16,
      "surah": 75,
      "text": "هذا تعليم من الله عز وجل لرسوله صلى الله عليه وسلم في كيفية تلقيه الوحي من الملك فإنه كان يبادر إلى أخذه ويسابق الملك في قراءته فأمره الله عز وجل إذا جاءه الملك بالوحي أن يستمع له وتكفل الله له أن يجمعه في صدره وأن ييسره لأدائه على الوجه الذي ألقاه إليه وأن يبينه له ويفسره ويوضحه فالحالة الأولى جمعه في صدره والثانية تلاوته والثالثة تفسيره وإيضاح معناه ولهذا قال تعالى \"لا تحرك به لسانك لتعجل به\" أي بالقرآن كما قال تعالى \"ولا تعجل بالقرآن من قبل أن يقضى إليك وحيه وقل رب زدني علما\"."
    },
    { "ayah": 17, "surah": 75, "text": "أي في صدرك وقرآنه أي أن تقرأه." },
    {
      "ayah": 18,
      "surah": 75,
      "text": "\"فإذا قرأناه\" أي إذا تلاه عليك الملك عن الله تعالى \"فاتبع قرآنه\" أي فاستمع له ثم اقرأه كما أقرأك."
    },
    {
      "ayah": 19,
      "surah": 75,
      "text": "أي بعد حفظه وتلاوته نبينه لك ونوضحه ونلهمك معناه على ما أردنا وشرعنا قال الإمام أحمد حدثنا عبدالرحمن عن أبي عوانة عن موسى بن أبي عائشة عن سعيد بن جبير عن ابن عباس قال كان رسول الله صلى الله عليه وسلم يعالج من التنزيل شدة فكان يحرك شفتيه قال فقال لى ابن عباس أنا أحرك شفتي كما كان رسول الله صلى الله عليه وسلم يحرك شفتيه وقال لي سيعد وأنا أحرك شفتي كما رأيت ابن عباس يحرك شفتيه فأنزل الله عز وجل \"لا تحرك به لسانك لتعجل به إن علينا جمعه وقرآنه\" قال جمعه في صدرك ثم تقرأه \"فإذا قرأناه فاتبع قرآنه\" أي فاستمع له وأنصت \"ثم إن علينا بيانه\" فكان بعد ذلك إذا انطلق جبريل قرأه كما أقرأه. وقد رواه البخاري ومسلم من غير وجه عن موسى بن أبي عائشة به ولفظ البخاري فكان إذا أتاه جبريل أطرق فإذا ذهب قرأه كما وعده الله عز وجل وقال ابن أبي حاتم حدثنا أبو سعيد الأشج حدثنا أبو يحيى التيمي حدثنا موسى بن أبي عائشة عن سعيد بن جبير عن ابن عباس قال: كان رسول الله صلى الله عليه وسلم إذا أنزل عليه الوحي يلقى منه شدة وكان إذا نزل عليه عرف في تحريكه شفتيه يتلقى أوله ويحرك به شفتيه خشية أن ينسى أوله قبل أن يفرغ من آخره فأنزل الله تعالى \"لا تحرك به لسانك لتعجل به\" وهكذا قال الشعبي والحسن البصري وقتادة ومجاهد والضحاك وغير واحد إن هذه الآية نزلت في ذلك وقد روى ابن جرير من طريق العوفي عن ابن عباس \"لا تحرك به لسانك لتعجل به\" قال كان لا يفتر من القراءة مخافة أن ينساه فقال الله تعالى \"لا تحرك به لسانك لتعجل به إن علينا جمعه\" أن نجمعه لك \"وقرآنه\" أن نقرئك فلا تنسى وقال ابن عباس وعطية العوفي \"ثم إن علينا بيانه\" تبيين حلاله وحرامه وكذا قال قتادة."
    },
    {
      "ayah": 2,
      "surah": 75,
      "text": "وقال جوبير بلغنا عن الحسن أنه قال في قوله \"ولا أقسم بالنفس اللوامة\" قال ليس أحد من أهل السموات والأرضين إلا يلوم نفسه يوم القيامة وقال ابن أبي حاتم حدثنا أبي حدثنا عبدالله بن صالح بن مسلم عن إسرائيل عن سماك أنه سأل عكرمة عن قوله صلى الله عليه وسلم \"ولا أقسم بالنفس اللوامة\" قال يلوم على الخير والشر لو فعلت كذا وكذا ورواه ابن جرير عن أبي كريب عن وكيع عن إسرائيل به. وقال ابن جرير حدثنا محمد بن بشار حدثنا سفيان عن ابن جريج عن الحسن بن مسلم عن سعيد بن جبير في قوله \"ولا أقسم بالنفس اللوامة\" قال تلوم على الخير والشر ثم رواه من وجه آخر عن سعيد أنه سأل ابن عباس عن ذلك فقال هي النفس اللئوم وقال على ابن أبى نجيح عن مجاهد تندم على ما فات وتلوم عليه وقال علي بن أبي طلحة عن ابن عباس اللوامة المذمومة وقال قتادة \"اللوامة\" الفاجرة قال ابن جرير وكل هذه الأقوال متقاربة المعنى الأشبه بظاهر التنزيل أنها التي تلوم صاحبها على الخير والشر وتندم على ما فات."
    },
    {
      "ayah": 20,
      "surah": 75,
      "text": "أي إنما يحملهم على التكذيب بيوم القيامة ومخالفة ما أنزله الله عز وجل على رسوله صلى الله عليه وسلم من الوحي الحق والقرآن العظيم."
    },
    { "ayah": 21, "surah": 75, "text": "إنهم إنما همتهم إلى الدار الدنيا العاجلة وهم لاهون متشاغلون عن الآخرة." },
    { "ayah": 22, "surah": 75, "text": "من النضارة أي حسنة بهية مشرقة مسرورة." },
    {
      "ayah": 23,
      "surah": 75,
      "text": "أي تراه عيانا كما رواه البخاري رحمه الله تعالى في صحيحه \"إنكم سترون ربكم عيانا\" وقد ثبتت رؤية المؤمنين لله عز وجل في الدار الآخرة في الأحاديث الصحاح من طرق متواترة عند أئمة الحديث لا يمكن دفعها ولا منعها لحديث أبي سعيد وأبي هريرة وهما في الصحيحين أن ناسا قالوا يا رسول الله هل نرى ربنا يوم القيامة؟ فقال \"هل تضارون في رؤية الشمس والقمر ليس دونهما سحاب؟\" قالوا لا قال \"فإنكم ترون ربكم كذلك\". وفي الصحيحين عن جرير قال نظر رسول الله صلى الله عليه وسلم إلى القمر ليلة البدر فقال \"إنكم ترون ربكم كما ترون هذا القمر فإن استطعتم أن لا تغلبوا على صلاة قبل طلوع الشمس ولا قبل غروبها فافعلوا\" وفي الصحيحين عن أبي موسى قال: قال رسول الله صلى الله عليه وسلم \"جنتان من ذهب آنيتهما وما فيهما وجنتان من فضة آنيتهما وما فيهما وما بين القوم وبين أن ينظروا إلى الله عز وجل إلا رداء الكبرياء على وجهه في جنة عدن\". وفي أفراد مسلم عن صهيب عن النبي صلى الله عليه وسلم قال \"إذا دخل أهل الجنة الجنة قال: يقول الله تعالى: تريدون شيئا أزيدكم؟ فيقولون: ألم تبيض وجوهنا؟ ألم تدخلنا الجنة وتنجينا من النار؟ قال فيكشف الحجاب فما أعطوا شيئا أحب إليهم من النظر إلى ربهم وهي الزيادة\" ثم تلا هذه الآية للذين أحسنوا الحسنى وزيادة\". وفي أفراد مسلم عن جابر في حديثه \"إن الله يتجلى للمؤمنين يضحك\" يعني في عرصات القيامة ففي هذه الأحاديث أن المؤمنين ينظرون إلى ربهم عز وجل في العرصات وفي روضات الجنات وقال الإمام أحمد حدثنا أبو معاوية حدثنا عبدالملك بن أبحر حدثنا يزيد بن أبي فاختة عن ابن عمر قال: قال رسول الله صلى الله عليه وسلم \"إن أدنى أهل الجنة منزلة لينظر فى ملكه ألفي سنة يرى أقصاه كما يرى أدناه ينظر إلى أزواجه وخدمه وإن أفضلهم منزلة لينظر إلى وجه الله كل يوم مرتين\" ورواه الترمذي عن عبد بن حميد عن شبابة عن إسرائيل عن نوير قال سمعت ابن عمر فذكره قال: ورواه عبدالملك بن أبحر عن نوير عن مجاهد عن ابن عمر وكذلك رواه النوري عن نوير عن مجاهد عن ابن عمرو لم يرفعه ولولا خشية الإطالة لأوردنا الأحاديث بطرقها وألفاظها من الصحاح والحسان والمسانيد والسنن ولكن ذكرنا ذلك مفرقا في مواضع من هذا التفسير وبالله التوفيق وهذا بحمد الله مجمع عليه بين الصحابة والتابعين وسلف هذه الأمة كما هو متفق عليه بين أئمة الإسلام وهداة الأنام ومن تأول ذلك بأن المراد بإلى مفرد الآلاء وهي النعم كما قال الثوري عن منصور عن مجاهد \"إلى ربها ناظرة\" قال تنتظر الثواب من ربها رواه ابن جرير من غير وجه عن مجاهد وكذا قال أبو صالح أيضا فقد أبعد هذا الناظر النجعة وأبطل فيما ذهب إليه وأين هو من قوله تعالى \"كلا إنهم عن ربهم يومئذ لمحجوبون\" قال الشافعي رحمه الله تعالى: ما حجب الفجار إلا وقد علم أن الأبرار يرونه عز وجل ثم قد تواترت الأخبار عن رسول الله صلى الله عليه وسلم بما دل عليه سياق الآية الكريمة وهي قوله تعالى \"إلى ربها ناظرة\" قال ابن جرير حدثنا محمد بن إسماعيل البخاري حدثنا آدم حدثنا المبارك عن الحسن \"وجوه يومئذ ناضرة\" قال حسنة \"إلى ربها ناظرة\" قال تنظر إلى الخالق وحق لها أن تنضر وهي تنظر إلى الخالق."
    },
    {
      "ayah": 24,
      "surah": 75,
      "text": "هذه وجوه الفجار تكون يوم القيامة باسرة قال قتادة كالحة وقال السدي تغير ألوانها وقال ابن زيد \"باسرة\" أي عابسة."
    },
    {
      "ayah": 25,
      "surah": 75,
      "text": "\"تظن\" أي تستيقن \"أن يفعل بها فاقرة\" قال مجاهد داهية وقال قتادة شر وقال السدي تستيقن أنها هالكة وقال ابن زيد تظن أن ستدخل النار وهذا المقام كفوله تعالى \"يوم تبيض وجوه وتسود وجوه\" وكقوله تعالى \"وجوه يومئذ مسفرة ضاحكة مستبشرة ووجوه يومئذ عليها غبرة ترهقها قترة أولئك هم الكفرة الفجرة\" وكقوله تعالى \"وجوه يومئذ خاشعة عاملة ناصبة تصلى نارا حامية - إلى قوله - وجوه يومئذ ناعمة لسعيها راضية في جنة عالية\" في أشباه ذلك من الآيات والسياقات."
    },
    {
      "ayah": 26,
      "surah": 75,
      "text": "يخبر تعالى عن حالة الإحتضار وما عندها من الأهوال - ثبتنا الله هنالك بالقول الثابت - فقال تعالى \"كلا إذا بلغت التراقي\" إن جعلنا كلا رداعة فمعناها لست يا ابن آدم هناك تكذب بما أخبرت به بل صار ذلك عندك عيانا وإن جعلناها بمعنى حقا فظاهر أي حقا إذا بلغت التراقي أي انتزعت روحك من جسدك وبلغت تراقيك والتراقي جمع ترقوة وهي العظام التي بين ثغرة النحر والعاتق كقوله تعالى \"فلولا إذا بلغت الحلقوم وأنتم حينئذ تنظرون ونحن أقرب إليه منكم ولكن لا تبصرون فلولا إن كنتم غير مدينين ترجعونها إن كنتم صادقين\" وهكذا قال ههنا \"كلا إذا بلغت التراقي\" ويذكر ههنا حديث بشر بن حجاج الذي تقدم في سورة يس والتراقي جمع ترقوة وهي قريبة من الحلقوم."
    },
    {
      "ayah": 27,
      "surah": 75,
      "text": "\"وقيل من راق\" قال عكرمة عن ابن عباس أي من راق يرقي وكذا قال أبو قلابة \"وقيل من راق\" أي من طبيب شاف وكذا قال قتادة والضحاك وابن زيد. وقال ابن أبي حاتم حدثنا أبي حدثنا نصر بن على حدثنا روح بن المسيب أبو رجاء الكلبي حدثنا عمرو بن مالك عن أبي الجوزاء عن ابن عباس \"وقيل من راق\" قال: قيل من يرقى بروحه ملائكة الرحمة أم ملائكة العذاب؟ فعلى هذا يكون من كلام الملائكة."
    },
    { "ayah": 28, "surah": 75, "text": "لا يوجد تفسير لهذه الأية" },
    {
      "ayah": 29,
      "surah": 75,
      "text": "و عن ابن عباس فى قوله \"والتفت الساق بالساق\" قال التفت عليه الدنيا والآخرة وكذا قال على بن أبي طلحة عن ابن عباس \"والتفت الساق بالساق\" يقول آخر يوم في الدنيا أول يوم من أيام الآخرة فتلتقي الشدة بالشدة إلا من رحمه الله وقال عكرمة \"والتفت الساق بالساق\" الأمر العظيم بالأمر العظيم وقال مجاهد بلاء ببلاء وقال الحسن البصري في قوله تعالى \"والتفت الساق بالساق\" هما ساقاك إذا التفتا وفي رواية عنه ماتت رجلاه فلم تحملاه وقد كان عليها جوالا وكذا قال السدي عن أبي مالك وفي رواية عن الحسن: هو لفهما في الكفن وقال الضحاك \"والتفت الساق بالساق\" اجتمع عليه أمران: الناس يجهزون جسده والملائكة يجهزون روحه."
    },
    { "ayah": 3, "surah": 75, "text": "أي يوم القيامة أيظن أنا لا نقدر على إعادة عظامه وجمعها من أماكنها المتفرقة." },
    {
      "ayah": 30,
      "surah": 75,
      "text": "أى المرجع والمآب وذلك أن الروح ترفع إلى السموات فيقول الله عز وجل ردوا عبدي إلى الأرض فإني منها خلقتهم وفيها أعيدهم ومنها أخرجهم تارة أخرى كما ورد فى حديث البراء الطويل وقد قال الله تعالى \"وهو القاهر فوق عباده ويرسل عليكم حفظة حتى إذا جاء أحدكم الموت توفته رسلنا وهم لا يفرطون ثم ردوا إلى الله مولاهم الحق ألاله الحكم وهو أسرع الحاسبين\"."
    },
    {
      "ayah": 31,
      "surah": 75,
      "text": "هذا إخبار عن الكافر الذي كان في الدار الدنيا مكذبا للحق بقلبه متوليا عن العمل بقالبه فلا خير فيه باطنا ولا ظاهرا ولهذا قال تعالى \"فلا صدق ولا صلى ولكن كذب وتولى\"."
    },
    {
      "ayah": 32,
      "surah": 75,
      "text": "هذا إخبار عن الكافر الذي كان في الدار الدنيا مكذبا للحق بقلبه متوليا عن العمل بقالبه فلا خير فيه باطنا ولا ظاهرا ولهذا قال تعالى \"فلا صدق ولا صلى ولكن كذب وتولى\"."
    },
    {
      "ayah": 33,
      "surah": 75,
      "text": "أي جذلانا أشرا بطرا كسلانا لا همة له ولا عمل كما قال تعالى \"وإذا انقلبوا إلى أهلهم انقلبوا فكهين\" وقال تعالى \"إنه كان في أهله مسرورا إنه ظن أن لن يحور - أي يرجع - بلى إن ربه كان به بصيرا\" قال الضحاك عن ابن عباس \"ثم ذهب إلى أهله يتمطى\" أي يختال وقال قتادة وزيد بن أسلم يتبختر."
    },
    {
      "ayah": 34,
      "surah": 75,
      "text": "وهذا تهديد ووعيد أكيد من الله تعالى للكافر به المتبخر في مشيه أي يحق لك أن تمشي هكذا وقد كفرت بخالقك وبارئك كما يقال في المثل هذا على سبيل التهكم والتهديد كقوله تعالى \"ذق إنك أنت العزيز الكريم\" وقد قال ابن أبي حاتم حدثنا أحمد بن سنان الواسطي حدثنا عبدالرحمن يعني ابن مهدي عن إسرائيل عن موسى بن أبي عائشة قال سألت سعيد بن جبير قلت \"أولى لك فأولى ثم أولى لك فأولى\" قال: قاله النبي صلى الله عليه وسلم لأبي جهل ثم نزل به القرآن."
    },
    {
      "ayah": 35,
      "surah": 75,
      "text": "وهذا تهديد ووعيد أكيد من الله تعالى للكافر به المتبخر في مشيه أي يحق لك أن تمشي هكذا وقد كفرت بخالقك وبارئك كما يقال في المثل هذا على سبيل التهكم والتهديد كقوله تعالى \"ذق إنك أنت العزيز الكريم\" وكقوله تعالى \"كلوا وتمتعوا قليلا إنكم مجرمون\" وكقوله تعالى \"فاعبدوا ما شئتم من دونه\" وكقوله جل جلاله \"اعملوا ما شئتم\" إلى غير ذلك وقد قال ابن أبي حاتم حدثنا أحمد بن سنان الواسطي حدثنا عبدالرحمن يعني ابن مهدي عن إسرائيل عن موسى بن أبي عائشة قال سألت سعيد بن جبير قلت \"أولى لك فأولى ثم أولى لك فأولى\" قال: قاله النبي صلى الله عليه وسلم لأبي جهل ثم نزل به القرآن وقال أبو عبدالرحمن النسائي حدثنا يعقوب بن إبراهيم حدثنا أبو النعمان حدثنا أبو عوانه وحدثنا أبو داود حدثنا محمد بن سليمان حدثنا أبو عوانه عن موسى بن أبي عائشة عن سعيد بن جبير قال: قلت لابن عباس \"أولى لك فأولى ثم أولى لك فأولى\"؟ قال: قاله رسول الله صلى الله عليه وسلم لأبي جهل ثم أنزله الله عز وجل قال ابن أبي حاتم وحدثنا أبي حدثنا هشام بن خالد حدثنا شعيب عن إسحاق حدثنا سعيد عن قتادة قوله \"أولى لى فأولى ثم أولى لك فأولى\" وعيد على أثر وعيد كما تسمعون وزعموا أن عدو الله أبا جهل أخذ نبي الله صلى الله عليه وسلم بمجامع ثيابه ثم قال \"أولى لك فأولى ثم أولى لك فأولى\" فقال عدو الله أبو جهل أتوعدني يا محمد؟ والله لا تستطيع أنت ولا ربك شيئا وإني لأعز من مشى بين جبليها."
    },
    {
      "ayah": 36,
      "surah": 75,
      "text": "قال السدي يعني لا يبعث وقال مجاهد والشافعي وعبدالرحمن بن زيد بن أسلم يعني لا يؤمر ولا ينهى والظاهر أن الآية تعم الحالين أي ليس يترك في هذه الدنيا مهملا لا يؤمر ولا ينهى ولا يترك في قبره سدى لا يبعث بل هو مأمور منهي في الدنيا محشور إلى الله في الدار الآخرة والمقصود هنا إثبات المعاد والرد على من أنكره من أهل الزيغ والجهل والعناد."
    },
    {
      "ayah": 37,
      "surah": 75,
      "text": "ولهذا قال تعالى مستدلا على الإعادة بالبداءة \"ألم يك نطفة من منى يمنى\" أي أما كان الإنسان نطفة ضعيفة من ماء مهين يمنى: يراق من الأصلاب في الأرحام؟."
    },
    {
      "ayah": 38,
      "surah": 75,
      "text": "أي فصار علقة ثم مضغة ثم شكل ونفخ فيه الروح فصار خلقا آخر سويا سليم الأعضاء ذكرا أو أنثى بإذن الله وتقديره؟."
    },
    {
      "ayah": 39,
      "surah": 75,
      "text": "فصار خلقا آخر سويا سليم الأعضاء ذكرا أو أنثى بإذن الله وتقديره ولهذا قال تعالى \"فجعل منه الزوجين الذكر والأنثى\"."
    },
    {
      "ayah": 4,
      "surah": 75,
      "text": "قال سعيد بن جبير والعوفي عن ابن عباس أن نجعله خفا أو حافرا وكذا قال مجاهد وعكرمة والحسن وقتادة والضحاك وابن جرير ووجهه ابن جرير بأنه تعالى لو شاء لجعل ذلك في الدنيا والظاهر من الآية أن قوله تعالى \"قادرين\" حال من قوله تعالى \"نجمع\" أي أيظن الإنسان أنا لا نجمع عظامه؟ بلى سنجمعها قادرين على أن نسوي بنانه أي قدرتنا صالحة لجمعها ولو شئنا لبعثناه أزيد مما كان فتجعل بنانه وهي أطراف أصابعه مستوية وهذا معنى قول ابن قتيبة والزجاج."
    },
    {
      "ayah": 40,
      "surah": 75,
      "text": "قال ابن أبي حاتم حدثنا الحسن بن محمد بن الصباح حدثنا شبابة عن شعبة عن موسى بن أبي عائشة عن آخر أنه كان فوق سطح يقرأ ويرفع صوته بالقرآن فإذا قرأ \"أليس ذلك بقادر على أن يحيى الموتى\" قال سبحانك اللهم فبلى فسئل عن ذلك فقال سمعت رسول الله صلى الله عليه وسلم يقول ذلك وقال أبو داود رحمه الله حدثنا محمد بن المثني حدثنا محمد بن جعفر حدثنا شعبة عن موسى بن أبي عائشة قال كان رجل يصلي فوق بيته فكان إذا قرأ \"أليس ذلك بقادر على أن يحيى الموتى\" قال سبحانك فبلى فسألوه عن ذلك فقال سمعته من رسول الله صلى الله عليه وسلم تفرد به أبو داود ولم يسم هذا الصحابي ولا يضر ذلك وقال أبو داود أيضا حدثنا عبدالله بن محمد الزهري حدثنا سفيان حدثني إسماعيل بن أمية سمعت أعرابيا يقول سمعت أبا هريرة يقول قال رسول الله صلى الله عليه وسلم \"من قرأ منكم بالتين والزيتون فانتهى إلى آخرها \"أليس الله بأحكم الحاكمين\" فليقل بلى وأنا على ذلك من الشاهدين ومن قرأ \"لا أقسم بيوم القيامة\" فانتهى إلى قوله \"أليس ذلك بقادر على أن يحيى الموتى\" فليقل بلى ومن قرأ \"والمرسلات\" فبلغ \"فبأي حديث بعده يؤمنون\" فليقل آمنا بالله\" ورواه أحمد عن سفيان بن عيينة ورواه الترمذي عن ابن أبي عمر عن سفيان بن عيينة به وقد رواه شعبة عن إسماعيل بن أمية قال: قلت له من حدثك؟ قال رجل صدق عن أبي هريرة وقال ابن جرير حدثنا بشر حدثنا يزيد حدثنا سعيد عن قتادة قوله تعالى \"أليس ذلك بقادر على أن يحيى الموتى\" ذكر لنا أن رسول الله صلى الله عليه وسلم كان إذا قرأها قال \"سبحانك وبلى\" ثم قال ابن أبي حاتم حدثنا أحمد بن سنان الواسطي حدثنا أبو أحمد الزبيري حدثنا سفيان عن أبي إسحاق عن مسلم البطين عن سعيد بن جبير عن ابن عباس أنه مر بهذه الآية \"أليس ذلك بقادر على أن يحيى الموتى\" قال سبحانك فبلى. آخر تفسير سورة القيامة ولله الحمد والمنة."
    },
    {
      "ayah": 5,
      "surah": 75,
      "text": "قال سعيد عن ابن عباس يعني يمضي قدما وقال العوفي عن ابن عباس \"ليفجر أمامه\" يعني الأمل يقول الإنسان أعمل ثم أتوب قبل يوم القيامة ويقال هو الكفر بالحق بين يدي القيامة. وقال مجاهد \"ليفجر أمامه\" ليمضي أمامه راكبا رأسه. وقال الحسن لا يلقى ابن آدم إلا تنزع نفسه إلى معصية الله قدما قدما إلا من عصمه الله تعالى وروي عن عكرمة وسعيد بن جبير والضحاك والسدي وغير واحد من السلف هو الذي يعجل الذنوب ويسوف التوبة وقال علي بن أبي طلحة عن ابن عباس هو الكافر يكذب بيوم الحساب."
    },
    {
      "ayah": 6,
      "surah": 75,
      "text": "أي يقول متى يكون يوم القيامة وإنما سؤاله سؤال استبعاد لوقوعه وتكذيب لوجوده كما قال تعالى \"ويقولون متى هذا الوعد إن كنتم صادقين قل لكم ميعاد يوم لا تستأخرون عنه ساعة ولا تستقدمون\"."
    },
    {
      "ayah": 7,
      "surah": 75,
      "text": "قرأ أبو عمرو بن العلاء برق بكسر الراء أي حال وهذا الذي قاله شبيه بقوله تعالى \"لا يرتد إليهم طرفهم\" أي بل ينظرون من الفزع هكذا وهكذا لا يستقر لهم بصر على شيء من شدة الرعب وقرأ آخرون برق بالفتح وهو قريب في المعنى من الأول. والمقصود أن الأبصار تنبهر يوم القيامة وتخشع وتحار وتذل من شدة الأهوال ومن عظم ما تشاهده يوم القيامة من الأمور."
    },
    { "ayah": 8, "surah": 75, "text": "أي ذهب ضوءه." },
    {
      "ayah": 9,
      "surah": 75,
      "text": "قال مجاهد كورا وقرأ ابن زيد عند تفسير هذه الآية \"إذا الشمس كورت وإذا النجوم انكدرت\" وروى عن ابن مسعود أنه قرأ \"وجمع بين الشمس والقمر\"."
    }
  ]
}
