{
  "ayahs": [
    {
      "ayah": 1,
      "surah": 76,
      "text": "سورة الإنسان: قد تقدم في صحيح مسلم عن ابن عباس أن رسول الله صلى الله عليه وسلم كان يقرأ في صلاة الصبح يوم الجمعة \"الم تنزيل\" السجدة و\"هل أتى على الإنسان\" وقال عبدالله بن وهب أخبرنا ابن زيد أن رسول الله صلى الله عليه وسلم وسلم قرأ هذه السورة \"هل أتى على الإنسان حين من الدهر\" وقد أنزلت عليه وعنده رجل أسود فلما بلغ صفة الجنان زفر زفرة فخرجت نفسه فقال رسول الله صلى الله عليه وسلم \"أخرج نفس صاحبكم - أو قال أخيكم - الشوق إلى الجنة\" مرسل غريب يقول تعالى مخبرا عن الإنسان أنه أوجده بعد أن لم يكن شيئا يذكر لحقارته وضعفه فقال تعالى \"هل أتى على الإنسان حين من الدهر لم يكن شيئا مذكورا."
    },
    {
      "ayah": 10,
      "surah": 76,
      "text": "أي إنما نفعل هذا لعل الله أن يرحمنا ويتلقانا بلطفه في اليوم العبوس القمطرير. قال علي بن أبي طلحة عن ابن عباس عبوسا ضيقا قمطريرا طويلا وقال عكرمة وغيره عنه في قوله \"يوما عبوسا قمطريرا\" قال يعبس الكافر يومئذ حتى يسيل من بين عينيه عرق مثل القطران وقال مجاهد \"عبوسا\" العابس الشفتين \"قمطريرا\" قال يقبض الوجه بالبسور وقال سعيد بن جبير وقتادة تعبس فيه الوجوه من الهول قمطريرا تقليص الجبين وما بين العينين من الهول وقال ابن زيد العبوس الشر والقمطرير الشديد وأوضح العبارات وأجلاها وأحلاها وأعلاها وأولاها قول ابن عباس رضي الله عنه. قال ابن جرير والقمطرير هو الشديد يقال هو يوم قمطرير ويوم قماطر ويوم عصيب وعصبصب وقد اقمطر اليوم يقمطر اقمطرارا وذلك أشد الأيام وأطولها في البلاء والشدة ومنه قول بعضهم: بني عمنا هل تذكرون بلاءنا عليكم إذا ما كان يوم قماطر"
    },
    {
      "ayah": 11,
      "surah": 76,
      "text": "وهذا من باب التجانس البليغ \"فوقاهم الله شر ذلك اليوم\" أي آمنهم بما خافوا منه \"ولقاهم نضرة\" أي في وجوههم \"وسرورا\" أي في قلوبهم. قاله الحسن البصري وقتادة وأبو العالية والربيع بن أنس وهذه كقوله تعالى \"وجوه يومئذ مسفرة ضاحكة مستبشرة\" وذلك أن القلب إذا سر استنار الوجه قال كعب بن مالك في حديثه الطويل وكان رسول الله صلى الله عليه وسلم إذا سر استنار وجهه حتى كأنه فلقة قمر وقالت عائشة رضي الله عنها دخل لي رسول الله صلى الله عليه وسلم مسرورا تبرق أسارير وجهه الحديث."
    },
    {
      "ayah": 12,
      "surah": 76,
      "text": "أي بسبب صبرهم أعطاهم ونولهم وبوأهم جنة وحريرا أي منزلا رحبا وعيشا رغدا ولباسا حسنا وروى الحافظ ابن عساكر في ترجمة هشام بن سليمان الداراني قال قرئ على أبي سليمان الداراني سورة \"هل أتى على الإنسان\" فلما بلغ القارئ إلى قوله تعالى \"وجزاهم بما صبروا جنة وحريرا\" قال بما صبروا على ترك الشهوات في الدنيا ثم أنشد يقول: كم قتيل لشهوة وأسير أف من مشتهي خلاف الجميل شهوات الإنسان تورثه الذل وتلقيه في البلاء الطويل."
    },
    {
      "ayah": 13,
      "surah": 76,
      "text": "يخبر تعالى عن أهل الجنة وما هم فيه من النعيم المقيم وما أسبغ عليهم من الفضل العميم فقال تعالى \"متكئين فيها على الأرائك\" وقد تقدم الكلام على ذلك في سورة الصافات وذكر الخلاف في الإتكاء هل هو الاضطجاع أو الترفق أو التربع أو التمكن في الجلوس وأن الأرائك هى السرر تحت الحجال وقوله تعالى \"لا يرون فيها شمسا ولا زمهريرا\" أي ليس عندهم حر مزعج ولا برد مؤلم بل هي مزاج واحد دائم سرمدي لا يبغون عنها حولا."
    },
    {
      "ayah": 14,
      "surah": 76,
      "text": "\"ودانية عليهم ظلالها\" أي قريبة إليهم أغصانها \"وذللت قطوفها تذليلا\" أي متى تعاطاه دنا القطف إليه وتدلى من أعلى غصنه كأنه سامع طائع كما قال تعالى في الآية الأخرى \"وجنى الجنتين دان\" وقال جل وعلا \"قطوفها دانية\" وقال مجاهد \"وذللت قطوفها تذليلا\" إن قام ارتفعت معه بقدر وإن قعد تذللت له حتى ينالها وإن اضطجع تذللت له حتى ينالها فذلك قوله تعالى \"تذليلا\" وقال قتادة لا يرد أيديهم عنها شوك ولا بعد وقال مجاهد أرض الجنة من ورق وترابها المسك وأصول شجرها من ذهب وفضة وأفنانها من اللؤلؤ الرطب والزبرجد والياقوت والورق والثمر بين ذلك فمن أكل منها قائما لم تؤذه ومن أكل منها قاعدا لم تؤذه ومن أكل منها مضطجعا لم تؤذه."
    },
    {
      "ayah": 15,
      "surah": 76,
      "text": "أي يطوف عليهم الخدم بأواني الطعام وهي من فضة وأكواب الشراب وهي الكيزان التي لا عرى لها ولا خراطيم \"قوارير\" منصوب بخبر كان أي كانت قوارير."
    },
    {
      "ayah": 16,
      "surah": 76,
      "text": "\"قواريرا\" منصوب إما على البدلية أو تمييز لأنه بينه بقوله جل وعلا \"قوارير من فضة\" قال ابن عباس ومجاهد والحسن البصري وغير واحد بياض الفضة في صفاء الزجاج والقوارير لا تكون إلا من زجاج فهذه الأكواب هي من فضة وهي مع هذا شفافة يرى ما في باطنها من ظاهرها وهذا مما لا نظير له في الدنيا قال ابن المبارك عن إسماعيل عن رجل عن ابن عباس: ليس في الجنة شيء إلا قد أعطيتم في الدنيا شبهه إلا قوارير من فضة. رواه ابن أبي حاتم. وقوله تعالى \"قدروها تقديرا\" أي على قدر ريهم لا تزيد عنه ولا تنقص بل هي معدة لذلك مقدرة بحسب ري صاحبها هذا معنى قول ابن عباس ومجاهد وسعيد بن جبير وأبي صالح وقتادة وابن أبزى وعبدالله بن عبيدالله بن عمير وقتادة والشعبي وابن زيد وقاله ابن جرير وغير واحد وهذا أبلغ في الإعتناء والشرف والكرامة وقال العوفي عن ابن عباس \"قدروها تقديرا\" قدرت للكف وهكذا قال الربيع بن أنس وقال الضحاك على قدر كف الخادم وهذا لا ينافي القول الأول فإنها مقدرة في القدر والري."
    },
    {
      "ayah": 17,
      "surah": 76,
      "text": "أي ويسقون يعني الأبرار أيضا في هذه الأكواب \"كأسا\" أي خمرا \"كان مزاجها زنجبيلا\" فتارة يمزج لهم الشراب بالكافور وهو بارد وتارة بالزنجبيل وهو حار ليعتدل الأمر وهؤلاء يمزج لهم من هذا تارة ومن هذا تارة وأما المقربون فإنهم يشربون من كل منهما صرفا كما قاله قتادة وغير واحد."
    },
    {
      "ayah": 18,
      "surah": 76,
      "text": "وقد تقدم قوله جل وعلا \"عينا يشرب بها عباد الله\" وقال ههنا \"عينا فيها تسمى سلسبيلا\" أي الزنجبيل عين في الجنة تسمى سلسبيلا قال عكرمة: اسم عين في الجنة وقال مجاهد سميت بذلك لسلاسة مسيلها وحدة جريها وقال قتادة عين فيها تسمى سلسبيلا عين سلسة مستقيد ماؤها وحكى ابن جرير عن بعضهم أنها سميت بذلك لسلاستها في الحلق واختار هو أنها تعم ذلك كله وهو كما قال."
    },
    {
      "ayah": 19,
      "surah": 76,
      "text": "أي يطوف على أهل الجنة للخدمة ولدان من ولدان الجنة \"مخلدون\" أي على حالة واحدة مخلدون عليها لا يتغيرون عنها لا تزيد أعمارهم عن تلك السن ومن فسرهم بأنهم مخرصون في آذانهم الأقرطة فإنما عبر عن المعنى بذلك لأن الصغير هو الذي يليق له ذلك دون الكبير \"إذا رأيتهم حسبتهم لؤلؤا منثورا\" أي إذا رأيتهم في انتشارهم في قضاء حوائج السادة وكثرتهم وصباحة وجوههم وحسن ألوانهم وثيابهم وحليهم حسبتهم لؤلؤا منثورا ولا يكون في التشبيه أحسن من هذا ولا في المنظر أحسن من اللؤلؤ المنثور على المكان الحسن قال قتاده عن أبي أيوب عن عبدالله بن عمرو: ما من أهل الجنة من أحد إلا يسعى عليه ألف خادم كل خادم على عمل ما عليه صاحبه."
    },
    {
      "ayah": 2,
      "surah": 76,
      "text": "\"أمشاج\" أي أخلاط والمشج والمشيج الشيء المختلط بعضه في بعض قال ابن عباس في قوله تعالى \"من نطفة أمشاج\" يعني ماء الرجل وماء المرأة إذا اجتمعا واختلطا ثم ينتقل بعد من طور إلى طور وحال إلى حال ولون إلى لون وهكذا قال عكرمة ومجاهد والحسن والربيع بن أنس الأمشاج هو اختلاط ماء الرجل بماء المرأة وقوله تعالى \"نبتليه\" أي نختبره كقوله جل جلاله \"ليبلوكم أيكم أحسن عملا\" \"فجعلناه سميعا بصيرا\" أي جعلنا له سمعا وبصرا يتمكن بهما من الطاعة والمعصية."
    },
    {
      "ayah": 20,
      "surah": 76,
      "text": "وإذا رأيت يا محمد \"ثم\" أي هناك يعني في الجنة ونعيمها وسعتها وارتفاعها وما فيها من الحبرة والسرور \"رأيت نعيما وملكا كبيرا\" أي مملكة لله هناك عظمة وسلطانا باهرا وثبت في الصحيح أن الله تعالى يقول لآخر أهل النار خروجا منها وآخر أهل الجنة دخولا إليها: إن لك مثل الدنيا وعشرة أمثالها وقد قدمنا في الحديث المروي من طريق ثوير بن أبي فاختة عن ابن عمر قال: قال رسول الله صلى الله عليه وسلم \"إن أدنى أهل الجنة منزلة لمن ينظر في ملكه مسيرة ألف سنة ينظر إلى أقصاه كما ينظر إلى أدناه\" فإذا كان هذا عطاؤه تعالى لأدنى من يكون في الجنة فما ظنك بما هو أعلى منزلة وأحظى عنده تعالى وقد روى الطبراني ههنا حديثا غريبا جدا فقال حدثنا علي بن عبدالعزيز حدثنا محمد بن عمار الموصلي حدثنا عقبة بن سالم عن أيوب بن عتبة عن عطاء عن ابن عمر قال جاء رجل من الحبشة إلى رسول الله صلى الله عليه وسلم فقال له رسول الله صلى الله عليه وسلم \"سل واستفهم\" فقال يا رسول الله فضلتم علينا بالصور والألوان والنبوة أفرأيت إن آمنت بما آمنت به وعملت بما عملت به إني لكائن معك في الجنة قال \"نعم والذي نفسي بيده إنه ليرى بياض الأسود في الجنة من مسيرة ألف عام\" ثم قال رسول الله صلى الله عليه وسلم \"من قال لا إله إلا الله كان له بها عهد عند الله ومن قال سبحان الله وبحمده كتب له مائة ألف حسنة وأربعة وعشرون ألف حسنة\" فقال رجل كيف نهلك بعد هذا يا رسول الله؟ فقال رسول الله صلى الله عليه وسلم \"إن الرجل ليأتي يوم القيامة بالعمل لو وضع على جبل لأثقله فتقوم النعمة أو نعم الله فتكاد تستنفذ ذلك كله إلا أن يتغمده الله برحمته\" ونزلت هذه السورة \"هل أتى على الإنسان حين من الدهر - إلى قوله - ملكا كبيرا\" فقال الحبشي وإن عيني لترى ما ترى عيناك في الجنة قال \"نعم\" فاستبكى حتى فاضت نفسه قال ابن عمر ولقد رأيت رسول الله صلى الله عليه وسلم يدليه في حفرته بيده."
    },
    {
      "ayah": 21,
      "surah": 76,
      "text": "\"عاليهم ثياب سندس خضر وإستبرق\" أي لباس أهل الجنة فيها الحرير ومنه سندس وهو رفيع الحرير كالقمصان ونحوها مما يلي أبدانهم والإستبرق منه ما فيه بريق ولمعان وهو مما يلي الظاهر كما هو المعهود في اللباس \"وحلوا أساور من فضة\" وهذه صفة الأبرار وأما المقربون فكما قال تعالى \"يحلون فيها من أساور من ذهب ولؤلؤا ولباسهم فيها حرير\" ولما ذكر تعالى زينة الظاهر بالحرير والحلي قال بعده \"وسقاهم ربهم شرابا طهورا\" أي طهر بواطنهم من الحسد والحقد والغل والأذى وسائر الأخلاق الرديئة كما روينا عن أمير المؤمنين علي بن أبي طالب رضي الله عنه أنه قال: إذا انتهى أهل الجنة إلى باب الجنة وجدوا هنالك عينين فكأنما ألهموا ذلك فشربوا من إحداهما فأذهب الله ما في بطونهم من أذى ثم اغتسلوا من الأخرى فجرت عليهم نضرة النعيم فأخبر سبحانه وتعالى بحالهم الظاهر وجمالهم الباطن."
    },
    {
      "ayah": 22,
      "surah": 76,
      "text": "أي يقال لهم ذلك تكريما لهم وإحسانا إليهم كما قال تعالى \"كلوا واشربوا هنيئا بما أسلفتم في الأيام الخالية\" وكقوله تعالى \"ونودوا أن تلكم الجنة أورثتموها بما كنتم تعملون\" وقوله تعالى \"وكان سعيكم مشكورا\" أي جزاكم الله تعالى على القليل بالكثير."
    },
    {
      "ayah": 23,
      "surah": 76,
      "text": "يمتن الله على رسوله صلى الله عليه وسلم بما أنزله عليه من القرآن العظيم تنزيلا."
    },
    {
      "ayah": 24,
      "surah": 76,
      "text": "\"فاصبر لحكم ربك\" أي كما أكرمك بما أنزل عليك فاصبر على قضائه وقدره واعلم أنه سيدبرك بحسن تدبيره \"ولا تطع منهم آثما أو كفورا\" أي لا تطع الكافرين والمنافقين إن أرادوا صدك عما أنزل إليك بل بلغ ما أنزل إليك من ربك وتوكل على الله فإن الله يعصمك من الناس فالآثم هو الفاجر في أفعاله والكفور هو الكافر قلبه."
    },
    { "ayah": 25, "surah": 76, "text": "\" بكرة وأصيلا\" أي أول النهار وآخره." },
    {
      "ayah": 26,
      "surah": 76,
      "text": "\"ومن الليل فاسجد له وسبحه ليلا طويلا\" كقوله تعالى \"ومن الليل فتهجد به نافلة لك عسى أن يبعثك ربك مقاما محمودا\" وكقوله تعالى \"يا أيها المزمل قم الليل إلا قليلا نصفه أو انقص منه قليلا أو زد عليه ورتل القرآن ترتيلا\"."
    },
    {
      "ayah": 27,
      "surah": 76,
      "text": "ثم قال تعالى منكرا على الكفار ومن أشبههم في حب الدنيا والإقبال عليها والانصباب إليها وترك الدار الآخرة وراء ظهورهم: \"إن هؤلاء يحبون العاجلة ويذرون وراءهم يوما ثقيلا\" يعني يوم القيامة."
    },
    {
      "ayah": 28,
      "surah": 76,
      "text": "\"نحن خلقناهم وشددنا أسرهم\" قال ابن عباس ومجاهد وغير واحد يعني خلقهم \"وإذا شئنا بدلنا أمثالهم تبديلا\" أي وإذا شئنا بعثناهم يوم القيامة وبدلناهم فأعدناهم خلقا جديدا وهذا استدلال بالبداءة على الرجعة وقال ابن زيد وابن جرير \"وإذا شئنا بدلنا أمثالهم تبديلا\" أي وإذا شئنا أتينا بقوم آخرين غيرهم كقوله تعالى \"إن يشأ يذهبكم أيها الناس ويأت بآخرين وكان الله على ذلك قديرا\" وكقوله تعالى \"إن يشأ يذهبكم ويأت بخلق جديد وما ذلك على الله بعزيز\"."
    },
    {
      "ayah": 29,
      "surah": 76,
      "text": "\"إن هذه تذكرة\" يعني هذه السورة تذكرة \"فمن شاء اتخذ إلى ربه سبيلا\" أي طريقا ومسلكا أي من شاء اهتدى بالقرآن كقوله تعالى \"وماذا عليهم لو آمنوا بالله واليوم الآخر\" الآية."
    },
    {
      "ayah": 3,
      "surah": 76,
      "text": "أي بيناه له ووضحناه وبصرناه به كقوله جل وعلا \"وأما ثمود فهديناهم فاستحبوا العمى على الهدى\" وكقوله جل وعلا \"وهديناه النجدين\" أي بينا له طريق الخير وطريق الشر وهذا قول عكرمة وعطية وابن زيد ومجاهد في المشهور عنه والجمهور وروي عن مجاهد وأبي صالح والضحاك والسدي أنهم قالوا في قوله تعالى \"إنا هديناه السبيل\" يعني خروجه من الرحم وهذا قول غريب والصحيح المشهور الأول وقوله تعالى \"إما شاكرا وإما كفورا\" منصوب على الحال من الهاء في قوله \"إنا هديناه السبيل\" تقديره فهو في ذلك إما شقي وإما سعيد كما جاء في الحديث الذي رواه مسلم عن أبي مالك الأشعري قال: قال رسول الله صلى الله عليه وسلم \"كل الناس يغدو فبائع نفسه فموبقها أو معتقها\" وقال الإمام أحمد حدثنا عبدالرزاق حدثنا معمر عن ابن خثيم عن عبدالرحمن بن سابط عن جابر بن عبدالله أن النبي صلى الله عليه وسلم قال لكعب بن عجرة \"أعاذك الله من إمارة السفهاء\" قال وما إمارة السفهاء؟ قال \"أمراء يكونون من بعدي لا يهتدون بهداي ولا يستنون بسنتي فمن صدقهم بكذبهم وأعانهم عل ظلمهم فأولئك ليسوا مني ولست منهم ولا يردون على حوضي ومن لم يصدقهم بكذبهم ولم يعنهم على ظلمهم فأولئك مني وأنا منهم وسيردون علي حوضي يا كعب ابن عجرة: الصوم جنة والصدقة تطفيء الخطيئة والصلاة قربات - أو قال برهان - يا كعب بن عجرة: إنه لا يدخل الجنة لحم نبت من سحت النار أولى به يا كعب: الناس غاديان فمبتاع نفسه فمعتقها وبائع نفسه فموبقها\" ورواه عن عفان بن وهيب عن عبدالله بن خثيم به وقد تقدم في سورة الروم عند قوله جل جلاله \"فطرة الله التي فطر الناس عليها\" من رواية جابر بن عبدالله رضي الله تعالى عنه قال: قال رسول الله صلى الله عليه وسلم \"كل مولود يولد على الفطرة حتى يعرب عنه لسانه إما شاكرا وإما كفورا\" وقال الإمام أحمد حدثنا أبو عامر حدثنا عبدالله بن جعفر عن عثمان بن محمد عن المقبري عن أبي هريرة رضي الله عنه عن النبي صلى الله عليه وسلم قال \"ما من خارج يخرج إلا ببابه رايتان: راية بيد ملك وراية بيد شيطان فإن خرج لما يحب الله اتبعه الملك برايته فلم يزل تحت راية الملك حتى يرجع إلى بيته وإن خرج لما يسخط الله اتبعه الشيطان برايته فلم يزل تحت راية الشيطان حتى يرجع إلى بيته\"."
    },
    {
      "ayah": 30,
      "surah": 76,
      "text": "أي لا يقدر أحد أن يهدي نفسه ولا يدخل في الإيمان ولا يجر لنفسه نفعا \"إلا أن يشاء الله إن الله كان عليما حكيما\" أي عليم بمن يستحق الهداية فييسرها له ويقيض له أسبابها ومن يستحق الغواية فيصرفه عن الهدى وله الحكمة البالغة والحجة الدامغة ولهذا قال تعالى \"إن الله كان عليما حكيما\"."
    },
    {
      "ayah": 31,
      "surah": 76,
      "text": "أي يهدي من يشاء ويضل من يشاء فمن يهده فلا مضل له ومن يضلل فلا هادي له آخر تفسير سورة الإنسان ولله الحمد والمنة."
    },
    {
      "ayah": 4,
      "surah": 76,
      "text": "يخبر تعالى عما أرصده للكافرين من خلقه به من السلاسل والأغلال والسعير وهو اللهب والحريق في نار جهنم كما قال تعالى \"إذ الأغلال في أعناقهم والسلاسل يسحبون في الحميم ثم في النار يسجرون\" ولما ذكر ما أعده لهؤلاء الأشقياء من السعير."
    },
    {
      "ayah": 5,
      "surah": 76,
      "text": "وقد علم ما في الكافور من التبريد والرائحة الطيبة مع ما يضاف إلى ذلك من اللذاذة في الجنة قال الحسن برد الكافور في طيب الزنجبيل."
    },
    {
      "ayah": 6,
      "surah": 76,
      "text": "أي هذا الذي مزج لهؤلاء الأبرار من الكافور هو عين يشرب بها المقربون من عباد الله صرفا بلا مزج ويروون بها ولهذا ضمن يشرب معنى يروى حتى عداه بالباء ونصب عينا على التمييز قال بعضهم هذا الشراب في طيبه كالكافور وقال بعضهم هو من عين كافور وقال بعضهم يجوز أن يكون منصوبا بيشرب حكى هذه الأقوال الثلاثة ابن جرير. وقوله تعالى \"يفجرونها تفجيرا\" أي يتصرفون فيها حيث شاءوا وأين شاءوا من قصورهم ودورهم ومجالسهم ومحالهم والتفجير هو الإنباع كما قال تعالى \"وقالوا لن نؤمن لك حتى تفجر لنا من الأرض ينبوعا\" وقال \"وفجرنا خلالهما نهرا\". وقال مجاهد \"يفجرونها تفجيرا\" يقودونها حيث شاءوا وكذا قال عكرمة وقتادة وقال الثوري يصرفونها حيث شاءوا."
    },
    {
      "ayah": 7,
      "surah": 76,
      "text": "أي يتعبدون لله فيما أوجبه عليهم من فعل الطاعات الواجبة بأصل الشرع وما أوجبوه على أنفسهم بطريق النذر قال الإمام مالك عن طلحة بن عبدالملك الأيلي عن القاسم بن مالك عن عائشة رضي الله عنها أن رسول الله صلى الله عليه وسلم قال \"من نذر أن يطيع الله فليطعه ومن نذر أن يعصي الله فلا يعصه\" رواه البخاري من حديث مالك. ويتركون المحرمات التي نهاهم عنها خيفة من سوء الحساب يوم المعاد وهو اليوم الذي شره مستطير أي منتشر عام على الناس إلا من رحم الله قال ابن عباس فاشيا وقال قتادة استطار والله شر ذلك اليوم حتى ملأ السموات والأرض قال ابن جرير: ومنه قولهم استطار الصدع في الزجاجة واستطال ومنه قول الأعشى: فبانت وقد أسأت في الفؤاد صدعا على نأيها مستطيرا يعني ممتدا فاشيا."
    },
    {
      "ayah": 8,
      "surah": 76,
      "text": "\"على حبه\" قيل على حب الله تعالى وجعلوا الضمير عائدا إلى الله عز وجل لدلالة السياق عليه والأظهر أن الضمير عائد على الطعام أي ويطعمون الطعام في حال محبتهم وشهوتهم له قاله مجاهد ومقاتل واختاره ابن جرير كقوله تعالى \"وآتى المال على حبه\" وكقوله تعالى \"لن تنالوا البر حتى تنفقوا مما تحبون\". وروى البيهقي من طريق الأعمش عن نافع قال: مرض ابن عمر فاشتهى عنبا أول ما جاء العنب فأرسلت صفية يعني امرأته فاشترت عنقودا بدرهم فاتبع الرسول سائل فلما دخل به قال السائل: السائل فقال ابن عمر: أعطوه إياه فأعطوه إياه فأرسلت بدرهم آخر فاشترت عنقودا فاتبع الرسول السائل فلما دخل قال السائل: السائل فقال ابن عمر: أعطوه إياه فأعطوه إياه فأرسلت صفية إلى السائل فقال والله إن عدت لا تصيب منه خيرا أبدا ثم أرسلت بدرهم آخر فاشترت به. وفي الصحيح \"أفضل الصدقة أن تصدق وأنت صحيح شحيح تأمل الغنى وتخشى الفقر\" أي في حال محبتك للمال وحرصك عليه وحاجتك إليه ولهذا قال تعالى \"ويطعمون الطعام على حبه مسكينا ويتيما وأسيرا\" أما المسكين واليتيم فقد تقدم بيانهما وصفتهما وأما الأسير فقال سعيد بن جبير والحسن والضحاك: الأسير من أهل القبلة وقال ابن عباس كان أسراؤهم يومئذ مشركين ويشهد لهذا أن رسول الله صلى الله عليه وسلم أمر أصحابه يوم بدر أن يكرموا الأسارى فكانوا يقدمونهم على أنفسهم عند الغداء وقال عكرمة هم العبيد واختاره ابن جرير لعموم الآية للمسلم والمشرك وهكذا قال سعيد بن جبير وعطاء والحسن وقتادة وقد وصى رسول الله صلى الله عليه وسلم بالإحسان إلى الأرقاء في غير ما حديث حتى أنه كان آخر ما أوصى أن جعل يقول \"الصلاة وما ملكت أيمانكم\" قال مجاهد هو المحبوس أي يطعمون الطعام لهؤلاء وهم يشتهونه ويحبونه."
    },
    {
      "ayah": 9,
      "surah": 76,
      "text": "\"إنما نطعمكم لوجه الله\" أي رجاء ثواب الله ورضاه \"لا نريد منكم جزاء ولا شكورا\" أي لا نطلب منكم مجازاة تكافئوننا بها ولا أن تشكرونا عند الناس قال مجاهد وسعيد بن جبير أما والله ما قالوه بألسنتهم ولكن علم الله به من قلوبهم فأثنى عليهم به ليرغب في ذلك راغب."
    }
  ]
}
