{
  "ayahs": [
    {
      "ayah": 1,
      "surah": 77,
      "text": "سورة المرسلات: قال البخاري ثنا أحمد ثنا عمر بن حفص بن غياث ثنا الأعمش حدثني إبراهيم عن الأسود عن عبدالله - هو ابن مسعود قال: بينما نحن مع رسول الله صلى الله عليه وسلم في غار بمنى إذ نزلت عليه والمرسلات فإنه ليتلوها وإني لأتلقاها من فيه وإن فاه لرطب بها إذ وثبت علينا حية فقال النبي صلى الله عليه وسلم \"اقتلوها\" فابتدرناها فذهبت فقال النبي صلى الله عليه وسلم \"وقيت شركم كما وقيتم شرها\" وأخرجه مسلم أيضا من طريق الأعمش وقال الإمام أحمد ثنا سفيان بن عيينة عن الزهري عن عبيدالله عن ابن عباس عن أمه أنها سمعت النبي صلى الله عليه وسلم يقرأ في المغرب بالمرسلات عرفا وفي رواية مالك عن الزهري عن عبيد الله عن ابن عباس أن أم الفضل سمعته يقرأ \"والمرسلات عرفا\" فقال يا بني أذكرتني بقراءتك هذه السورة إنها لآخر ما سمعت من رسول الله صلى الله عليه وسلم يقرأ بها في المغرب أخرجاه في الصحيحين من طريق مالك به. قال ابن أبي حاتم ثنا أبي ثنا زكريا بن سهل المروزي ثنا علي بن الحسن بن شقيق أنا الحسين بن واقد ثنا الأعمش عن أبي صالح عن أبي هريرة \"والمرسلات عرفا\" قال الملائكة وروي عن مسروق وأبي الضحى ومجاهد في إحدى الروايات والسدي والربيع بن أنس مثل ذلك وروى عن أبي صالح أنه قال هي الرسل وفي رواية عنه أنها الملائكة وهكذا قال أبو صالح في العاصفات والناشرات والفارقات والملقيات أنها الملائكة وقال الثوري عن سلمة بن كهيل عن مسلم البطين عن أبي العبيدين قال سألت ابن مسعود عن المرسلات عرفا قال الريح وكذا قال ابن عباس ومجاهد وقتادة وأبو صالح في رواية عنه وتوقف ابن جرير في \"والمرسلات عرفا\" هل هي الملائكة إذا أرسلت بالعرف أو كعرف الفرس يتبع بعضهم بعضا أو هي الرياح إذا هبت شيئا فشيئا؟ وقطع بأن العاصفات عصفا الرياح كما قاله ابن مسعود ومن تابعه وممن قال ذلك في العاصفات عصفا أيضا علي بن أبي طالب والسدي وتوقف في الناشرات نشرا هل هي الملائكة أو الريح كما تقدم وعن أبي صالح: أن الناشرات نشرا هي المطر. والأظهر أن المرسلات هي الرياح كما قال تعالى \"وأرسلنا الرياح لواقح\" وقال تعالى \"وهو الذي يرسل الرياح بشرا بين يدي رحمته\" وهكذا العاصفات هى الرياح يقال عصفت الرياح إذا هبت بتصويت."
    },
    {
      "ayah": 10,
      "surah": 77,
      "text": "أي ذهب بها فلا يبقى لها عين ولا أثر كقوله تعالى \"ويسألونك عن الجبال فقل ينسفها ربي نسفا\" الآية وقال تعالى \"ويوم نسير الجبال وترى الأرض بارزة وحشرناهم فلم نغادر منهم أحدا."
    },
    {
      "ayah": 11,
      "surah": 77,
      "text": "قال العوفي عن ابن عباس جمعت. وقال ابن زيد وهذه كقوله تعالى \"يوم يجمع الله الرسل\" وقال مجاهد \"أقتت\" أجلت وقال الثوري عن منصور عن إبراهيم \"أقتت\" أوعدت وكأنه يجعلها كقوله تعالى \"وأشرقت الأرض بنور ربها ووضع الكتاب وجيء بالنبيين والشهداء وقضي بينهم بالحق وهم لا يظلمون\"."
    },
    {
      "ayah": 12,
      "surah": 77,
      "text": "يقول تعالى لأي يوم أجلت الرسل وأرجئ أمرها حتى تقوم الساعة كما قال تعالى \"فلا تحسبن الله مخلف وعده رسله إن الله عزيز ذو انتقام يوم تبدل الأرض غير الأرض والسموات وبرزوا للّه الواحد القهار\" وهو يوم الفصل كما قال تعالى \"ليوم الفصل\"."
    },
    {
      "ayah": 13,
      "surah": 77,
      "text": "يقول تعالى لأي يوم أجلت الرسل وأرجئ أمرها حتى تقوم الساعة كما قال تعالى \"فلا تحسبن الله مخلف وعده رسله إن الله عزيز ذو انتقام يوم تبدل الأرض غير الأرض والسموات وبرزوا للّه الواحد القهار\" وهو يوم الفصل كما قال تعالى \"ليوم الفصل\"."
    },
    {
      "ayah": 14,
      "surah": 77,
      "text": "يقول تعالى لأي يوم أجلت الرسل وأرجئ أمرها حتى تقوم الساعة كما قال تعالى \"فلا تحسبن الله مخلف وعده رسله إن الله عزيز ذو انتقام يوم تبدل الأرض غير الأرض والسموات وبرزوا للّه الواحد القهار\" وهو يوم الفصل كما قال تعالى \"ليوم الفصل\"."
    },
    {
      "ayah": 15,
      "surah": 77,
      "text": "أي ويل لمن تأمل هذه المخلوقات الدالة على عظمة خالقها ثم بعد هذا يستمر على تكذيبه وكفره."
    },
    { "ayah": 16, "surah": 77, "text": "يعني من المكذبين للرسل المخالفين لما جاءوهم به." },
    { "ayah": 17, "surah": 77, "text": "أي ممن أشبههم." },
    { "ayah": 18, "surah": 77, "text": "لا يوجد تفسير لهذه الأية" },
    {
      "ayah": 19,
      "surah": 77,
      "text": "أي ويل لمن تأمل هذه المخلوقات الدالة على عظمة خالقها ثم بعد هذا يستمر على تكذيبه وكفره."
    },
    { "ayah": 2, "surah": 77, "text": "هى الرياح يقال عصفت الرياح إذا هبت بتصويت." },
    {
      "ayah": 20,
      "surah": 77,
      "text": "أي ضعيف حقير بالنسبة إلى قدرة البارئ عز وجل كما تقدم في سورة يس في حديث بشر بن جحاش \"ابن آدم أنى تعجزني وقد خلقتك من مثل هذه؟\"."
    },
    {
      "ayah": 21,
      "surah": 77,
      "text": "يعني جمعناه في الرحم وهو قرار الماء من الرجل والمرأة والرحم معد لذلك حافظ لما أودع فيه من الماء."
    },
    { "ayah": 22, "surah": 77, "text": "إلى مدة معينة من ستة أشهر أو تسعة أشهر." },
    { "ayah": 23, "surah": 77, "text": "لا يوجد تفسير لهذه الأية" },
    {
      "ayah": 24,
      "surah": 77,
      "text": "أي ويل لمن تأمل هذه المخلوقات الدالة على عظمة خالقها ثم بعد هذا يستمر على تكذيبه وكفره."
    },
    {
      "ayah": 25,
      "surah": 77,
      "text": "قال ابن عباس كفاتا كنا وقال مجاهد يكفت الميت فلا يرى منه شيء وقال الشعبي بطنها لأمواتكم وظهرها لأحيائكم."
    },
    {
      "ayah": 26,
      "surah": 77,
      "text": "وقال مجاهد يكفت الميت فلا يرى منه شيء وقال الشعبي بطنها لأمواتكم وظهرها لأحيائكم."
    },
    {
      "ayah": 27,
      "surah": 77,
      "text": "يعني الجبال رسى بها الأرض لئلا تميد وتضطرب \"وأسقيناكم ماء فراتا\" أي عذبا زلالا من السحاب أو مما أنبعه من عيون الأرض."
    },
    {
      "ayah": 28,
      "surah": 77,
      "text": "أي ويل لمن تأمل هذه المخلوقات الدالة على عظمة خالقها ثم بعد هذا يستمر على تكذيبه وكفره."
    },
    {
      "ayah": 29,
      "surah": 77,
      "text": "يقول تعالى مخبرا عن الكفار المكذبين بالمعاد والجزاء والجنة والنار أنهم يقال لهم يوم القيامة \"انطلقوا إلى ما كنتم به تكذبون \"."
    },
    { "ayah": 3, "surah": 77, "text": "هي الرياح التي تنشر السحاب في آفاق السماء كما يشاء الرب عز وجل." },
    { "ayah": 30, "surah": 77, "text": "يعني لهب النار إذا ارتفع وصعد معه دخان فمن شدته وقوته أن له ثلاث شعب." },
    {
      "ayah": 31,
      "surah": 77,
      "text": "أي ظل الدخان المقابل للهب لا ظليل هو في نفسه ولا يغني من اللهب يعني ولا يقيهم حر اللهب."
    },
    {
      "ayah": 32,
      "surah": 77,
      "text": "أي يتطاير الشرر من لهبها كالقصر قال ابن مسعود كالحصون وقال ابن عباس ومجاهد وقتادة ومالك عن زيد بن أسلم وغيرهم يعني أصول الشجر."
    },
    {
      "ayah": 33,
      "surah": 77,
      "text": "أي كالإبل السود قاله مجاهد والحسن وقتادة والضحاك واختاره ابن جرير وعن ابن عباس ومجاهد وسعيد بن جبير \"جمالة صفر\" يعني حبال السفن وعنه أعنى ابن عباس \"جمالة صفر\" قطع نحاس وقال البخاري ثنا عمرو بن علي ثنا يحيى أنا سفيان عن عبدالرحمن بن عابس قال سمعت ابن عباس رضي الله عنهما \"إنها ترمي بشرر كالقصر\" قال كنا نعمد إلى الخشبة ثلاثة أذرع وفوق ذلك فنرفعه للبناء فنسميه القصر \"كأنه جمالة صفر\" حبال السفن تجمع حتى تكون كأوساط الرجال."
    },
    {
      "ayah": 34,
      "surah": 77,
      "text": "أي ويل لمن تأمل هذه المخلوقات الدالة على عظمة خالقها ثم بعد هذا يستمر على تكذيبه وكفره."
    },
    { "ayah": 35, "surah": 77, "text": "أي لا يتكلمون." },
    {
      "ayah": 36,
      "surah": 77,
      "text": "أي لا يقدرون على الكلام ولا يؤذن لهم فيه ليعتذروا بل قد قامت عليهم الحجة ووقع القول عليهم بما ظلموا فهم لا ينطقون وعرصات القيامة حالات والرب تعالى يخبر عن هذه الحالة تارة وعن هذه الحالة تارة ليدل على شدة الأهوال والزلازل يومئذ."
    },
    {
      "ayah": 37,
      "surah": 77,
      "text": "أي ويل لمن تأمل هذه المخلوقات الدالة على عظمة خالقها ثم بعد هذا يستمر على تكذيبه وكفره."
    },
    {
      "ayah": 38,
      "surah": 77,
      "text": "وهذه مخاطبة من الخالق تعالى لعباده يقول لهم \"هذا يوم الفصل جمعناكم والأولين\" يعني أنه جمعهم بقدرته في صعيد واحد يسمعهم الداعي وينفذهم البصر."
    },
    {
      "ayah": 39,
      "surah": 77,
      "text": "تهديد شديد ووعيد أكيد أي إن قدرتم على أن تتخلصوا من قبضتي وتنجوا من حكمي فافعلوا فإنكم لا تقدرون على ذلك كما قال \"يا معشر الجن والإنس إن استطعتم أن تنفذوا من أقطار السموات والأرض فانفذوا لا تنفذون إلا بسلطان\" وقد قال تعالى \"ولا تضرونه شيئا\" وفي الحديث \"يا عبادي إنكم لن تبلغوا نفعي فتنفعوني ولن تبلغوا ضري فتضروني\". وقد قال ابن أبي حاتم: ثنا علي بن المنذر الطريفي الأودي ثنا محمد بن فضيل ثنا حصين بن عبدالرحمن عن حسان بن أبي المخارق عن أبي عبدالله الجدلي قال: أتيت بيت المقدس فإذا عبادة بن الصامت وعبدالله بن عمرو وكعب الأحبار يتحدثون فى بيت المقدس فقال عبادة: إذا كان يوم القيامة جمع الله الأولين والآخرين في صعيد واحد ينفذهم ويسمعهم الداعي ويقول الله \"هذا يوم الفصل جمعناكم والأولين فإن كان لكم كيد فكيدون\" اليوم لا ينجو مني جبار عنيد ولا شيطان مريد فقال عبدالله بن عمرو فإنا نحدث يومئذ أنها تخرج عنق من النار فتنطلق حتى إذا كانت بين ظهراني الناس نادت: أيها الناس إني بعثت إلى ثلاثة أنا أعرف بهم من الأب بولده ومن الأخ بأخيه لا يغيبهم عني وزر ولا تخفيهم عني خافية الذي جعل مع الله إلها آخر وكل جبار عنيد وكل شيطان مريد فتنطوي عليهم فتقذف بهم في النار قبل الحساب بأربعين سنة."
    },
    {
      "ayah": 4,
      "surah": 77,
      "text": "يعني الملائكة قاله ابن مسعود وابن عباس ومسروق ومجاهد وقتادة والربيع بن أنس والسدي والثوري ولا خلاف ههنا فإنها تنزل بأمر الله على الرسل تفرق بين الحق والباطل الهدى والغي والحلال والحرام."
    },
    {
      "ayah": 40,
      "surah": 77,
      "text": "أي ويل لمن تأمل هذه المخلوقات الدالة على عظمة خالقها ثم بعد هذا يستمر على تكذيبه وكفره."
    },
    {
      "ayah": 41,
      "surah": 77,
      "text": "يقول تعالى مخبرا عن عباده المتقين الذين عبدوه بأداء الواجبات وترك المحرمات إنهم يوم القيامة يكونون في جنات وعيون أي بخلاف ما أولئك الأشقياء فيه من ظل اليحموم وهو الدخان الأسود المنتن."
    },
    { "ayah": 42, "surah": 77, "text": "أي من سائر أنواع الثمار مهما طلبوا وجدوا." },
    { "ayah": 43, "surah": 77, "text": "يقال لهم ذلك على سبيل الإحسان إليهم." },
    { "ayah": 44, "surah": 77, "text": "خبرا مستأنفا أي هذا جزاؤنا لمن أحسن العمل." },
    {
      "ayah": 45,
      "surah": 77,
      "text": "أي ويل لمن تأمل هذه المخلوقات الدالة على عظمة خالقها ثم بعد هذا يستمر على تكذيبه وكفره."
    },
    { "ayah": 46, "surah": 77, "text": "أي مدة قليلة قريبة قصيرة أي ثم تساقون إلى نار جهنم التي تقدم ذكرها." },
    {
      "ayah": 47,
      "surah": 77,
      "text": "أي ويل لمن تأمل هذه المخلوقات الدالة على عظمة خالقها ثم بعد هذا يستمر على تكذيبه وكفره."
    },
    {
      "ayah": 48,
      "surah": 77,
      "text": "أي إذا أمر هؤلاء الجهلة من الكفار أن يكونوا من المصلين مع الجماعة امتنعوا من ذلك واستكبروا عنه."
    },
    {
      "ayah": 49,
      "surah": 77,
      "text": "أي ويل لمن تأمل هذه المخلوقات الدالة على عظمة خالقها ثم بعد هذا يستمر على تكذيبه وكفره."
    },
    {
      "ayah": 5,
      "surah": 77,
      "text": "يعني الملائكة قاله ابن مسعود وابن عباس ومسروق ومجاهد وقتادة والربيع بن أنس والسدي والثوري ولا خلاف ههنا فإنها تنزل بأمر الله على الرسل وتلقي إليهم وحيا."
    },
    {
      "ayah": 50,
      "surah": 77,
      "text": "أي إذا لم يؤمنوا بهذا القرآن فبأي كلام يؤمنون به؟ كقوله تعالى \"فبأي حديث بعد الله وآياته يؤمنون\" قال ابن أبي حاتم ثنا ابن أبي عمر ثنا سفيان عن إسماعيل بن أمية سمعت رجلا أعرابيا بدويا يقول سمعت أبا هريرة يرويه إذا قرأ \"والمرسلات عرفا\" فقرأ \"فبأي حديث بعده يؤمنون\" فليقل آمنت بالله وبما أنزل وقد تقدم هذا الحديث في سورة القيامة."
    },
    {
      "ayah": 6,
      "surah": 77,
      "text": "يعني الملائكة قاله ابن مسعود وابن عباس ومسروق ومجاهد وقتادة والربيع بن أنس والسدي والثوري ولا خلاف ههنا فإنها تلقي إلى الرسل وحيا فيه إعذار إلى الخلق وإنذار لهم عقاب الله إن خالفوا أمره."
    },
    {
      "ayah": 7,
      "surah": 77,
      "text": "هذا هو المقسم عليه بهذه الأقسام أي ما وعدتم به من قيام الساعة والنفخ في الصور وبعث الأجساد وجمع الأولين والآخرين في صعيد واحد ومجازاة كل عامل بعمله إن خيرا فخير وإن شرا فشر إن هذا كله لواقع أي لكائن لا محالة."
    },
    {
      "ayah": 8,
      "surah": 77,
      "text": "أي ذهب ضوءها كقوله تعالى \"وإذا النجوم انكدرت\" وكقوله تعالى \"وإذا الكواكب انتثرت\"."
    },
    { "ayah": 9, "surah": 77, "text": "أي انفطرت وانشقت وتدلت أرجاؤها ووهت أطرافها." }
  ]
}
