{
  "ayahs": [
    {
      "ayah": 1,
      "surah": 78,
      "text": "يقول تعالى منكرا على المشركين في تساؤلهم عن يوم القيامة إنكارا لوقوعها \"عم يتساءلون\" أي عن أي شيء يتساءلون من أمر القيامة."
    },
    {
      "ayah": 10,
      "surah": 78,
      "text": "أي يغشي الناس ظلامه وسواده كما قال \"والليل إذا يغشاها\" وقال الشاعر: فلما لبسن الليل أو حين نصبت له من حذا آذانها وهو جانح وقال قتادة في قوله تعالى \"وجعلنا الليل لباسا\" أي سكنا."
    },
    {
      "ayah": 11,
      "surah": 78,
      "text": "أي جعلناه مشرقا نيرا مضيئا ليتمكن الناس من التصرف فيه والذهاب والمجيء للمعاش والتكسب والتجارات وغير ذلك."
    },
    {
      "ayah": 12,
      "surah": 78,
      "text": "يعني السموات السبع في اتساعها وارتفاعها وإحكامها وإتقانها وتزيينها بالكواكب الثوابت والسيارات."
    },
    { "ayah": 13, "surah": 78, "text": "يعني الشمس المنيرة على جميع العالم التي يتوهج ضوءها لأهل الأرض كلهم." },
    {
      "ayah": 14,
      "surah": 78,
      "text": "قال العوفي عن ابن عباس: المعصرات الريح وقال ابن أبي حاتم ثنا أبو سعيد ثنا أبو داود الحفري عن سفيان عن الأعمش عن المنهال عن سعيد بن جبير عن ابن عباس \"وأنزلنا من المعصرات\" قال الرياح وكذا قال عكرمة ومجاهد وقتادة ومقاتل والكلبي وزيد بن أسلم وابنه عبدالرحمن أنها الرياح ومعنى هذا القول أنها تستدر المطر من السحاب وقال علي بن أبي طلحة عن ابن عباس من المعصرات أي من السحاب وكذا قال عكرمة أيضا وأبو العالية والضحاك والحسن والربيع بن أنس والثوري واختاره ابن جرير وقال الفراء هي السحاب التي تتحلب بالمطر ولم تمطر بعد كما يقال امرأة معصر إذا دنا حيضها ولم تحض وعن الحسن وقتادة من المعصرات يعني السموات وهذا قول غريب والأظهر أن المراد بالمعصرات السحاب كما قال تعالى\"الله الذي يرسل الرياح فتثير سحابا فيبسطه في السماء كيف يشاء ويجعله كسفا فترى الودق يخرج من خلاله\" أي من بينه وقوله جل وعلا \"ماء ثجاجا\" قال مجاهد وقتادة والربيع بن أنس ثجاجا منصبا وقال الثوري متتابعا وقال ابن زيد كثيرا وقال ابن جرير ولا يعرف في كلام العرب في صفة الكثرة الثج وإنما الثج الصب المتتابع ومنه قول النبي صلى الله عليه وسلم \"أفضل الحج العج والثج\" يعني صب دماء البدن هكذا قال قلت: وفي حديث المستحاضة حين قال لها رسول الله صلى الله عليه وسلم \"أنعت لك الكرسف\" يعني أن تحتشي بالقطن فقالت يا رسول الله هو أكثر من ذلك إنما أثج ثجا وهذا فيه دلالة على استعمال الثج في الصب المتتابع الكثير والله أعلم."
    },
    {
      "ayah": 15,
      "surah": 78,
      "text": "أي لنخرج بهذا الماء الكثير الطيب النافع المبارك \"حبا\" يدخر للأناسي والأنعام \"ونباتا\" أي خضرا يؤكل رطبا."
    },
    {
      "ayah": 16,
      "surah": 78,
      "text": "أي بساتين وحدائق من ثمرات متنوعة وألوان مختلفة وطعوم وروائح متفاوتة وإن كان ذلك في بقعة واحدة من الأرض مجتمعا ولهذا قال وجنات ألفافا قال ابن عباس وغيره ألفافا مجتمعة وهذه كقوله تعالى \"وفي الأرض قطع متجاورات وجنات من أعناب وزرع ونخيل صنوان وغير صنوان يسقى بماء واحد ونفضل بعضها على بعض في الأكل إن في ذلك لآيات لقوم يعقلون\"."
    },
    {
      "ayah": 17,
      "surah": 78,
      "text": "يخبر تعالى عن يوم الفصل وهو يوم القيامة أنه مؤقت بأجل معدود لا يزاد عليه ولا ينقص منه ولا يعلم وقته على التعيين إلا الله عز وجل كما قال تعالى \"وما نؤخره إلا لأجل معدود\"."
    },
    {
      "ayah": 18,
      "surah": 78,
      "text": "قال مجاهد زمرا زمرا قال ابن جرير يعني تأتي كل أمة مع رسولها كقوله تعالى \"يوم ندعو كل أناس بإمامهم\" وقال البخاري \"يوم ينفخ في الصور فتأتون أفواجا\" حدثنا محمد حدثنا أبو معاوية عن الأعمش عن أبي صالح عن أبي هريرة قال: قال رسول الله صلى الله عليه وسلم \"ما بين النفختين أربعون\" قالوا أربعون يوما؟ قال \"أبيت\" قال أربعون شهرا؟ قال \"أبيت\" قالوا أربعون سنة؟ قال \"أبيت\" قال \"ثم ينزل الله من السماء ماء فينبتون كما ينبت البقل ليس من الإنسان شيء إلا يبلى إلا عظما واحدا وهو عجب الذنب ومنه يركب الخلق يوم القيامة\"."
    },
    { "ayah": 19, "surah": 78, "text": "أي طرقا ومسالك لنزول الملائكة." },
    {
      "ayah": 2,
      "surah": 78,
      "text": "يقول تعالى منكرا على المشركين في تساؤلهم عن يوم القيامة إنكارا لوقوعها \"عم يتساءلون\" أي عن أي شيء يتساءلون من أمر القيامة."
    },
    {
      "ayah": 20,
      "surah": 78,
      "text": "كقوله تعالى \"وترى الجبال تحسبها جامدة وهي تمر مر السحاب\" وكقوله تعالى \"وتكون الجبال كالعهن المنفوش\" وقال ههنا \"فكانت سرابا\" أي يخيل إلى الناظر أنها شيء وليست بشيء بعد هذا تذهب بالكلية فلا عين ولا أثر كما قال تعالى \" ويسألونك عن الجبال فقل ينسفها ربي نسفا فيذرها قاعا صفصفا لا ترى فيها عوجا ولا أمتا\" وقال تعالى ويوم نسير الجبال وترى الأرض بارزة."
    },
    {
      "ayah": 21,
      "surah": 78,
      "text": "أي مرصدة معدة وقال الحسن وقتادة في قوله تعالى \"إن جهنم كانت مرصادا\" يعني أنه لا يدخل أحد الجنة حتى يجتاز بالنار فإن كان معه جواز نجا وإلا احتبس وقال سفيان الثوري عليها ثلات قناطر."
    },
    {
      "ayah": 22,
      "surah": 78,
      "text": "\"للطاغين\" وهم المردة العصاة المخالفون للرسل \"مآبا\" أي مرجعا ومتقلبا ومصيرا ونزلا."
    },
    {
      "ayah": 23,
      "surah": 78,
      "text": "أي ماكثين فيها أحقابا وهي جمع حقب وهو المدة من الزمان وقد اختلفوا في مقداره فقال ابن جرير عن ابن حميد عن مهران عن سفيان الثوري عن عمار الدهني عن سالم بن أبي الجعد قال: قال علي بن أبي طالب لهلال الهجري ما تجدون الحقب في كتاب الله المنزل؟ قال نجده ثمانين سنة كل سنة اثنا عشر شهرا كل شهر ثلاثون يوما كل يوم ألف سنة وهكذا روي عن أبي هريرة وعبدالله بن عمرو وابن عباس وسعيد بن جبير وعمرو بن ميمون والحسن وقتادة والربيع بن أنس والضحاك وعن الحسن والسدي أيضا سبعون سنة كذلك وعن عبدالله بن عمرو: الحقب أربعون سنة كل يوم منها كألف سنة مما تعدون رواهما ابن أبي حاتم وقال بشير بن كعب ذكر لي أن الحقب الواحد ثلثمائة سنة كل سنة اثني عشر شهرا كل سنة ثلثمائة وستون يوما كل يوم منها كألف سنة رواه ابن جرير وابن أبي حاتم ثم قال ابن أبي حاتم ذكر عن عمرو بن علي بن أبي بكر الأسعدي حدثنا مروان بن معاوية الفزاري عن جعفر بن الزبير عن القاسم عن أبي أمامة عن النبي صلى الله عليه وسلم في قوله تعالى \"لابثين فيها أحقابا\" قال فالحقب شهر الشهر ثلاثون يوما والسنة اثنا عشر شهرا والسنة ثلثمائة وستون يوما كل يوم منها ألف سنة مما تعدون فالحقب ثلاثون ألف ألف سنة وهذا حديث منكر جدا والقاسم هو والراوي عنه وهو جعفر بن الزبير كلاهما متروك وقال البزار حدثنا محمد بن مرداس حدثنا سليمان بن مسلم أبو العلاء قال: سألت سليمان التيمي هل يخرج من النار أحد؟ فقال حدثني نافع عن ابن عمر عن النبي صلى الله عليه وسلم أنه قال \"والله لا يخرج من النار أحد حتى يمكث فيها أحقابا قال والحقب بضع وثمانون سنة كل سنة ثلثمائة وستون يوما مما تعدون ثم قال سليمان بن مسلم بصري مشهور وقال السدي \"لابثين فيها أحقابا\" سبعمائة حقبة كل حقب سبعون سنة كل سنة ثلثمائة وستون يوما كل يوم كألف سنة مما تعدون وقد قال مقاتل بن حيان أن هذه الآية منسوخة بقوله تعالى \"فذوقوا فلن نزيدكم إلا عذابا\" وقال خالد بن معدان هذه الآية وقوله تعالى \"إلا ما شاء ربك\" في أهل التوحيد رواهما ابن جرير ثم قال ويحتمل أن يكون قوله تعالى \"لابثين فيها أحقابا\" متعلقا بقوله تعالى \"لا يذوقون فيها بردا ولا شرابا\" ثم يحدث الله لهم بعد ذلك عذابا من شكل آخر ونوع آخر ثم قال والصحيح أنها لا انقضاء لها كما قال قتادة والربيع بن أنس وقد قال قبل ذلك حدثني محمد بن عبدالرحيم البرقي حدثنا عمرو بن أبي سلمة عن زهير عن سالم سمعت الحسن يسأل عن قوله تعالى \"لابثين فيها أحقابا\" قال أما الأحقاب فليس لها عدة إلا الخلود في النار ولكن ذكروا أن الحقب سبعون سنة كل يوم منها كألف سنة مما تعدون وقال سعيد عن قتادة قال الله تعالى \"لابثين فيها أحقابا\" وهو ما لا انقطاع له وكلما مضى حقب جاء حقب بعده وقال الربيع بن أنس \"لابثين فيها أحقابا\" لا يعلم عدة هذه الأحقاب إلا الله عز وجل وذكر لنا أن الحقب الواحد ثمانون سنة والسنة ثلثمائة وستون يوما كل يوم كألف سنة مما تعدون رواهما أيضا ابن جرير."
    },
    { "ayah": 24, "surah": 78, "text": "أي لا يجدون في جهنم بردا لقلوبهم ولا شرابا طيبا يتغذون به." },
    {
      "ayah": 25,
      "surah": 78,
      "text": "قال أبو العالية استثنى من البرد الحميم ومن الشراب الغساق وكذا قال الربيع بن أنس فأما الحميم فهو الحار الذي قد انتهى حره وحموه والغساق هو ما اجتمع من صديد أهل النار وعرقهم ودموعهم وجروحهم فهو بارد لا يستطاع من برده ولا يواجه من نتنه - أجارنا الله من ذلك بمنه وكرمه: قال ابن جرير وقيل المراد بقوله \"لا يذوقون فيها بردا\" يعني النوم كما قال الكندي: بردت مراشفها علي فصدني عنها وعن قبلاتها البرد يعني بالبرد النعاس والنوم هكذا ذكره ولم يعزه إلى أحد وقد رواه ابن أبي حاتم من طريق السدي عن مرة الطيب ونقله عن مجاهد أيضا وحكاه البغوي عن أبي عبيدة والكسائي أيضا وقال كعب الأحبار: غساق عين في جهنم يسيل إليها حمة كل ذات حمة من حية وعقرب وغير ذلك فيستنقع فيؤتي بالآدمي فيغمس فيها غمسة واحدة فيخرج وقد سقط جلده ولحمه عن العظام ويتعلق جلده ولحمه في كعبيه وعقبيه ويجر لحمه كله كما يجر الرجل ثوبه رواه ابن أبي حاتم."
    },
    {
      "ayah": 26,
      "surah": 78,
      "text": "أي هذا الذي صاروا إليه من هذه العقوبة وفق أعمالهم الفاسدة التي كانوا يعملونها في الدنيا قاله مجاهد وقتادة وغير واحد."
    },
    { "ayah": 27, "surah": 78, "text": "أي لم يكونوا يعتقدون أن ثم دارا يجازون فيها ويحاسبون." },
    {
      "ayah": 28,
      "surah": 78,
      "text": "أي وكانوا يكذبون بحجج الله ودلائله على خلقه التي أنزلها على رسوله صلى الله عليه وسلم فيقابلونها بالتكذيب والمعاندة وقوله \"كذابا\" أي تكذيبا وهو مصدر من غير الفعل قالوا وقد سمع أعرابي يستفتي الفراء على المروة: الحلق أحب إليك أو القصار؟ وأنشد بعضهم: لقد طال ما ثبطتني عن صحابتي وعن حوج قصارها من شقائيا."
    },
    {
      "ayah": 29,
      "surah": 78,
      "text": "أي وقد علمنا أعمال العباد كلهم وكتبناهم عليهم وسنجزيهم على ذلك إن خيرا فخير وإن شرا فشر."
    },
    {
      "ayah": 3,
      "surah": 78,
      "text": "وهو النبأ العظيم يعني الخبر الهائل المفظع الباهر قال قتادة وابن زيد النبأ العظيم البعث بعد الموت وقال مجاهد هو القرآن."
    },
    {
      "ayah": 30,
      "surah": 78,
      "text": "أي يقال لأهل النار ذوقوا ما أنتم فيه فلن نزيدكم إلا عذابا من جنسه وآخر من شكله أزواج قال قتادة عن أبي أيوب الأزدي عن عبدالله بن عمرو قال لم ينزل على أهل النار آية أشد من هذه الآية \"فذوقوا فلن نزيدكم إلا عذابا\" قال فهم في مزيد من العذاب أبدا وقال ابن أبي حاتم حدثنا محمد بن محمد بن مصعب الصوري حدثنا خالد بن عبدالرحمن حدثنا جسر بن فرقد عن الحسن قال سألت أبا برزة الأسلمي عن أشد آية في كتاب الله على أهل النار قال سمعت رسول الله صلى الله عليه وسلم قرأ \"فذوقوا فلن نزيدكم إلا عذابا\" قال \"هلك القوم بمعاصيهم الله عز وجل\" جسر بن فرقد ضعيف الحديث بالكلية."
    },
    {
      "ayah": 31,
      "surah": 78,
      "text": "يقول تعالى مخبرا عن السعداء وما أعد لهم تعالى من الكرامة والنعيم المقيم فقال تعالى \"إن للمتقين مفازا\" قال ابن عباس والضحاك متنزها وقال مجاهد وقتادة: فازوا فنجوا من النار الأظهر هنا قول ابن عباس."
    },
    { "ayah": 32, "surah": 78, "text": "\"حدائق\" والحدائق البساتين من النخيل وغيرها." },
    {
      "ayah": 33,
      "surah": 78,
      "text": "أي وحورا كواعب قال ابن عباس ومجاهد وغير واحد \"كواعب\" أي نواهد يعنون أن ثديهن نواهد لم يتدلين لأنهن أبكار عرب أتراب أي في سن واحد كما تقدم بيانه في سورة الواقعة قال ابن أبي حاتم حدثنا عبدالله بن أحمد بن عبدالرحمن الدستكي حدثني أبي عن أبي سفيان عبدالرحمن بن عبدالله بن تيم حدثنا عطية بن سليمان أبو الغيث عن أبي عبدالرحمن القاسم بن أبي القاسم الدمشقي عن أبي أمامة أنه سمعه يحدث عن النبي صلى الله عليه وسلم أنه قال \"إن قمص أهل الجنة لتبدو من رضوان الله وإن السحابة لتمر بهم فتناديهم يا أهل الجنة ماذا تريدون أن أمطركم؟ حتى إنها لتمطرهم الكواعب الأتراب\"."
    },
    {
      "ayah": 34,
      "surah": 78,
      "text": "قال ابن عباس مملوءة متتابعة وقال عكرمة صافية وقال مجاهد والحسن وقتادة وابن زيد \"دهاقا\" الملأى المترعة وقال مجاهد وسعيد بن جبير هي المتتابعة."
    },
    {
      "ayah": 35,
      "surah": 78,
      "text": "\" كقوله \"لا لغو فيها ولا تأثيم\" أي ليس فيها كلام لاغ عار عن الفائدة ولا إثم كذب بل هى دار السلام وكل ما فيها سالم من النقص."
    },
    {
      "ayah": 36,
      "surah": 78,
      "text": "أي هذا الذي ذكرناه جازاهم الله به وأعطاهموه بفضله ومنه وإحسانه ورحمته عطاء حسابا أي كافيا وافيا سالما كثيرا تقول العرب أعطاني فأحسبني أي كفاني ومنه حسبي الله أي الله كافي."
    },
    {
      "ayah": 37,
      "surah": 78,
      "text": "يخبر تعالى عن عظمته وجلاله وأنه رب السموات والأرض وما فيهما وما بينهما وأنه الرحمن الذي شملت رحمته كل شيء وقوله تعالى \"لا يملكون منه خطابا\" أي لا يقدر أحد على ابتداء مخاطبته إلا بإذنه كقوله تعالى \"من ذا الذي يشفع عنده إلا بإذنه\" وكقوله تعالى \"يوم يأت لا تكلم نفس إلا بإذنه\"."
    },
    {
      "ayah": 38,
      "surah": 78,
      "text": "قوله تعالى \"يوم يقوم الروح والملائكة صفا لا يتكلمون\" اختلف المفسرون في المراد بالروح ههنا ما هو؟ على أقوال \"أحدها\" ما رواه العوفي عن ابن عباس أنهم أرواح بني آدم \"الثاني\" هم بنو أدم قاله الحسن وقتادة وقال قتادة هذا مما كان ابن عباس يكتمه \"الثالث\" أنهم خلق من خلق الله على صور بني آدم وليسوا ملائكة ولا بشر وهم يأكلون ويشربون قاله ابن عباس ومجاهد وأبو صالح والأعمش \"الرابع\" هو جبريل قاله الشعبي وسعيد بن جبير والضحاك ويستشهد لهذا القول بقوله عز وجل \"نزل به الروح الأمين على قلبك لتكون من المنذرين\" وقال مقاتل بن حيان الروح هو أشرف الملائكة وأقرب إلى الرب عز وجل وصاحب الوحي \"الخامس\" أنه القرآن قاله ابن زيد كقوله \"وكذلك أوحينا إليك روحا من أمرنا\" الآية \"والسادس\" أنه ملك من الملائكة بقدر جميع المخلوقات قال علي بن أبي طلحة عن ابن عباس قوله \"يوم يقوم الروح\" قال هو ملك عظيم من أعظم الملائكة خلقا وقال ابن جرير حدثني محمد بن خلف العسقلاني حدثنا رواد بن الجراح عن أبي حمزة عن الشعبي عن علقمة عن ابن مسعود قال الروح في السماء الرابعة هو أعظم من السموات ومن الجبال ومن الملائكة يسبح كل يوم اثنى عشر ألف تسبيحة يخلق الله تعالى من كل تسبيحة ملكا من الملائكة يجيء يوم القيامة صفا وحده وهذا قول غريب جدا وقد قال الطبراني حدثنا محمد بن عبدالله بن عوس المصري حدثنا وهب الله بن روق بن هبيرة حدثنا بشر بن بكر حدثنا الأوزاعي حدثني عطاء عن عبدالله بن عباس سمعت رسول الله صلى الله عليه وسلم يقول \"إن لله ملكا لو قيل له التقم السموات السبع والأرضين بلقمة واحدة لفعل تسبيحه سبحانك حيث كنت\" وهذا حديث غريب جدا وفي رفعه نظر وقد يكون موقوفا على ابن عباس ويكون مما تلقاه من الإسرائيليات والله أعلم وتوقف ابن جرير فلم يقطع بواحد من هذه الأقوال كلها والأشبه عنده والله أعلم أنهم بنو آدم قوله تعالى \"إلا من أذن له الرحمن\" كقوله \"يوم يأت لا تكلم نفس إلا بإذنه\" وكما ثبت في الصحيح \"ولا يتكلم يومئذ إلا \" الرسل\" وقوله تعالى \"وقال صوابا\" أي حقا ومن الحق لا إله إلا الله كما قاله أبو صالح وعكرمة."
    },
    {
      "ayah": 39,
      "surah": 78,
      "text": "\"ذلك اليوم الحق\" أي الكائن لا محالة \"فمن شاء اتخذ إلى ربه مآبا\" أي مرجعا وطريقا يهتدي إليه ومنهجا يمر به عليه."
    },
    { "ayah": 4, "surah": 78, "text": "يعني الناس فيه على قولين مؤمن به وكافر." },
    {
      "ayah": 40,
      "surah": 78,
      "text": "\"إنا أنذرناكم عذابا قريبا\" يعني يوم القيامة لتأكد وقوعه صار قريبا لأن كل ما هو آت آت \"يوم ينظر المرء ما قدمت يداه\" يعرض عليه جميع أعماله خيرها وشرها قديمها وحديثها كقوله تعالى \"ووجدوا ما عملوا حاضرا\" وكقوله تعالى \"ينبأ الإنسان يومئذ بما قدم وأخر\" \"ويقول الكافر يا ليتني كنت ترابا\" أي يود الكافر يومئذ أنه كان في الدار الدنيا ترابا ولم يكن خلق ولا خرج إلي الوجود وذلك حين عاين عذاب الله ونظر إلى أعماله الفاسدة قد سطرت عليه بأيدي الملائكة السفرة الكرام البررة وقيل إنما يود ذلك حين يحكم الله بين الحيوانات التي كانت في الدنيا فيفصل بينها بحكمه العدل الذي لا يجور حتى إنه ليقتص للشاة الجماء من القرناء فإذا فرغ من الحكم بينها قال لها كوني ترابا فتصير ترابا فعند ذلك يقول الكافر \"يا ليتني كنت ترابا\" أي كنت حيوانا فأرجع إلى التراب وقد ورد معنى هذا في حديث الصور المشهور وورد فيه آثار عن أبي هريرة وعبدالله بن عمرو وغيرهما آخر تفسير سورة النبأ ولله الحمد والمنة وبه التوفيق والعصمة."
    },
    { "ayah": 5, "surah": 78, "text": "وهذا تهديد شديد ووعيد أكيد." },
    {
      "ayah": 6,
      "surah": 78,
      "text": "شرع تبارك وتعالى يبين قدرته العظيمة على خلق الأشياء الغريبة والأمور العجيبة الدالة على قدرته على ما يشاء من أمر المعاد وغيره فقال ألم نجعل الأرض مهادا أي ممهدة للخلائق ذلولا لهم قارة ساكنة ثابتة."
    },
    { "ayah": 7, "surah": 78, "text": "أي جعلها لها أوتادا أرساها بها وثبتها وقررها حتى سكنت ولم تضطرب بمن عليها." },
    {
      "ayah": 8,
      "surah": 78,
      "text": "يعني ذكرا وأنثى يتمتع كل منهما بالآخر ويحصل التناسل بذلك كقوله \"ومن آياته أن خلق لكم من أنفسكم أزواجا لتسكنوا إليها وجعل بينكم مودة ورحمة\"."
    },
    {
      "ayah": 9,
      "surah": 78,
      "text": "أي قاطعا للحركة لراحة الأبدان فإن الاعضاء والجوارح تكل من كثرة الحركة في الإنتشار بالنهار في المعاش فإذا جاء الليل وسكن سكنت الحركات فاستراحت فحصل النوم الذي فيه راحة البدن والروح معا."
    }
  ]
}
