{
  "ayahs": [
    {
      "ayah": 1,
      "surah": 79,
      "text": "قال ابن مسعود وابن عباس ومسروق وسعيد بن جبير وأبو صالح وأبو الضحى والسدي \"والنازعات غرقا\" الملائكة يعنون حين تنزع أرواح بني آدم فمنهم من تأخذ روحه بعسر فتغرق في نزعها ومنهم من تأخذ روحه بسهولة وكأنما حلته من نشاط وهو قوله \"والناشطات نشطا\" قاله ابن عباس وعن ابن عباس \"والنازعات\" هي أنفس الكفار تنزع ثم تنشط ثم تغرق في النار. رواه ابن أبي حاتم وقال مجاهد \"والنازعات غرقا\" الموت وقال الحسن وقتادة \"والنازعات غرقا والناشطات نشطا\" هي النجوم وقال عطاء بن أبي رباح في قوله تعالى والنازعات والناشطات هي القسي في القتال والصحيح الأول وعليه الأكثرون."
    },
    {
      "ayah": 10,
      "surah": 79,
      "text": "يعني مشركي قريش ومن قال بقولهم في إنكار المعاد يستبعدون وقوع البعث بعد المصير إلى الحافرة وهي القبور قاله مجاهد وبعد تمزق أجسادهم وتفتت عظامهم ونخورها وعن ابن عباس ومحمد بن كعب وعكرمة وسعيد بن جبير وأبي مالك والسدي وقتادة الحافرة النار وما أكثر أسمائها هي النار والجحيم وسقر وجهنم والهاوية والحافرة ولظى والحطمة."
    },
    {
      "ayah": 11,
      "surah": 79,
      "text": "وقرئ ناخرة وقال ابن عباس ومجاهد وقتادة أي بالية قال ابن عباس وهو العظم إذا بلي ودخلت الريح فيه."
    },
    { "ayah": 12, "surah": 79, "text": "فقال محمد بن كعب قالت قريش لئن أحيانا الله بعد أن نموت لنخسرن." },
    {
      "ayah": 13,
      "surah": 79,
      "text": "أي فإنما هو أمر من الله لا مثنوية فيه ولا تأكيد فإذا الناس قيام ينظرون وهو أن يأمر الله تعالى إسرافيل فينفخ في الصور نفخة البعث فإذا الأولون والآخرون قيام بين يدي الرب عز وجل ينظرون كما قال تعالى \"يوم يدعوكم فتستجيبون بحمده وتظنون إن لبثتم إلا قليلا\" وقال تعالى \"وما أمرنا إلا واحدة كلمح بالبصر\" وقال تعالى \"وما أمر الساعة إلا كلمح البصر أو هو أقرب\" قال مجاهد \"فإنما هي زجرة واحدة صيحة\" واحدة وقال إبراهيم التيمي أشد ما يكون الرب عز وجل غضبا على خلقه يوم يبعثهم وقال الحسن البصري زجرة من الغضب وقال أبو مالك والربيع بن أنس زجرة واحدة هي النفخة الآخرة."
    },
    {
      "ayah": 14,
      "surah": 79,
      "text": "قال ابن عباس الساهرة الأرض كلها وكذا قال سعيد بن جبير وقتادة وأبو صالح وقال عكرمة والحسن والضحاك وابن زيد الساهرة وجه الأرض وقال مجاهد كانوا بأسفلها فأخرجوا إلى أعلاها قال والساهرة المكان المستوي وقال الثوري الساهرة أرض الشام وقال عثمان بن أبي العاتكة الساهرة أرض بيت المقدس.وقال وهب بن منبه الساهرة جبل إلى جانب بيت المقدس.وقال قتادة أيضا الساهرة جهنم وهذه الأقوال كلها غريبة والصحيح أنها الأرض وجهها الأعلى وقال ابن أبي حاتم حدثنا علي بن الحسين حدثنا حرز بن المبارك الشيخ الصالح حدثنا بشر بن السري حدثنا مصعب بن ثابت عن أبي حازم عن سهل بن سعد الساعدي \"فإذا هم بالساهرة\" قال أرض بيضاء عفراء خالية كالخبزة النقي وقال الربيع بن أنس \"فإذا هم بالساهرة\" يقول الله عز وجل \"يوم تبدل الأرض غير الأرض والسموات وبرزوا لله الواحد القهار\" ويقول تعالى \"ويسألونك عن الجبال فقل ينسفها ربي نسفا فيذرها قاعا صفصفا لا ترى فيها عوجا ولا أمتا\" وقال تعالى \"ويوم نسير الجبال وترى الأرض بارزة\" وبرزت الأرض التي عليها الجبال وهي لا تعد من هذه الأرض وهي أرض لم يعمل عليها خطيئة ولم يهرق عليها دم."
    },
    {
      "ayah": 15,
      "surah": 79,
      "text": "يخبر تعالى رسوله محمدا صلى الله عليه وسلم عن عبده ورسوله موسى عليه السلام أنه ابتعثه إلى فرعون وأيده الله بالمعجزات ومع هذا استمر على كفره وطغيانه حتى أخذه الله أخذ عزيز مقتدر وكذلك عاقبة من خالفك وكذب بما جئت به ولهذا قال في آخر القصة \"إن في ذلك لعبرة لمن يخشى\" فقوله تعالى \"هل أتاك حديث موسى\" أي هل سمعت بخبره."
    },
    {
      "ayah": 16,
      "surah": 79,
      "text": "\"إذ ناداه ربه\" أي كلمه نداء \"بالواد المقدس\" أي المطهر \"طوى\" وهو اسم الوادي على الصحيح كما تقدم في سورة طه."
    },
    { "ayah": 17, "surah": 79, "text": "أي تجرد وتمرد وعتى." },
    { "ayah": 18, "surah": 79, "text": "أي قل له هل لك أن تجيب إلى طريقة ومسلك تزكى به وتسلم وتطيع." },
    {
      "ayah": 19,
      "surah": 79,
      "text": "وأهديك إلى ربك أي أدلك إلى عبادة ربك فتخشى أي فيصير قلبك خاضعا له مطيعا خاشعا بعدما كان قاسيا خبيثا بعيدا من الخير."
    },
    {
      "ayah": 2,
      "surah": 79,
      "text": "قال ابن مسعود وابن عباس ومسروق وسعيد بن جبير وأبو صالح وأبو الضحى والسدي \"والنازعات غرقا\" الملائكة يعنون حين تنزع أرواح بني آدم فمنهم من تأخذ روحه بعسر فتغرق في نزعها ومنهم من تأخذ روحه بسهولة وكأنما حلته من نشاط وهو قوله \"والناشطات نشطا\" قاله ابن عباس وعن ابن عباس \"والنازعات\" هي أنفس الكفار تنزع ثم تنشط ثم تغرق في النار. رواه ابن أبي حاتم وقال مجاهد \"والنازعات غرقا\" الموت وقال الحسن وقتادة \"والنازعات غرقا والناشطات نشطا\" هي النجوم وقال عطاء بن أبي رباح في قوله تعالى والنازعات والناشطات هي القسي في القتال والصحيح الأول وعليه الأكثرون."
    },
    {
      "ayah": 20,
      "surah": 79,
      "text": "يعني فأظهر له موسى مع هذه الدعوة الحق حجة قوية ودليلا واضحا على صدق ما جاءه به من عند الله."
    },
    {
      "ayah": 21,
      "surah": 79,
      "text": "أي فكذب بالحق وخالف ما أمره به من الطاعة وحاصله أنه كفر قلبه فلم ينفعل لموسى بباطنه ولا بظاهره وعلمه بأن ما جاء به حق لا يلزم منه أنه مؤمن به لأن المعرفة علم القلب والإيمان عمله وهو الإنقياد للحق والخضوع له."
    },
    {
      "ayah": 22,
      "surah": 79,
      "text": "أي في مقابلة الحق بالباطل وهو جمعه السحرة ليقابلوا ما جاء به موسى من المعجزات الباهرات."
    },
    { "ayah": 23, "surah": 79, "text": "أي في قومه." },
    {
      "ayah": 24,
      "surah": 79,
      "text": "قال ابن عباس ومجاهد وهذه الكلمة قالها فرعون بعد قوله ما علمت لكم من إله غيري بأربعين سنة."
    },
    {
      "ayah": 25,
      "surah": 79,
      "text": "أي انتقم الله منه انتقاما جعله به عبرة ونكالا لأمثاله من المتمردين في الدنيا \"ويوم القيامة بئس الرفد المرفود\" كما قال تعالى \"وجعلناهم أئمة يدعون إلى النار ويوم القيامة لا ينصرون\" وهذا هو الصحيح في معنى الآية أن المراد بقوله \"نكال الآخرة والأولى\" أي الدنيا والآخرة وقيل المراد بذلك كلمتيه الأولى والثانية وقيل كفره وعصيانه والصحيح الذي لا شك فيه الأول."
    },
    { "ayah": 26, "surah": 79, "text": "أي لمن يتعظ وينزجر." },
    {
      "ayah": 27,
      "surah": 79,
      "text": "يقول تعالى محتجا على منكري البعث في إعادة الخلق بعد بدئه \"أأنتم\" أيها الناس \"أشد خلقا أم السماء\" يعني بل السماء أشد خلقا منكم كما قال تعالى \"لخلق السموات والأرض أكبر من خلق الناس\" وقال تعالى \"أوليس الذي خلق السموات والأرض بقادر على أن يخلق مثلهم بلى وهو الخلاق العليم\"وقوله تعالى \"بناها\"فسره بقوله\"رفع سمكها فسواها\"."
    },
    {
      "ayah": 28,
      "surah": 79,
      "text": "أي جعلها عالية البناء بعيدة الفناء مستوية الأرجاء مكللة بالكواكب في الليلة الظلماء."
    },
    {
      "ayah": 29,
      "surah": 79,
      "text": "أي جعل ليلها مظلما أسود حالكا ونهارها مضيئا مشرقا نيرا واضحا قال ابن عباس \"أغطش ليلها\" أظلمه وكذا قال مجاهد وعكرمة وسعيد بن جبير وجماعة كثيرون \"وأخرج ضحاها\" أي أنار نهارها."
    },
    {
      "ayah": 3,
      "surah": 79,
      "text": "فقال ابن مسعود هي الملائكة وروي عن علي ومجاهد وسعيد بن جبير وأبي صالح مثل ذلك وعن مجاهد \"والسابحات سبحا\" الموت وقال قتادة هي النجوم وقال عطاء بن أبي رباح هي السفن."
    },
    {
      "ayah": 30,
      "surah": 79,
      "text": "قال ابن أبي حاتم حدثنا أبي حدثنا عبدالله بن جعفر الرقي حدثنا عبيد الله يعني ابن عمر عن زيد بن أبي أنيسة عن المنهال بن عمرو عن سعيد بن جبير عن ابن عباس \"دحاها\" ودحيها أن أخرج منها الماء والمرعى وشقق فيها الأنهار وجعل فيها الجبال والرمال والسبل والآكام فذلك قوله \"والأرض بعد ذلك دحاها\" وقد تقدم في سورة حم السجدة أن الأرض خلقت قبل خلق السماء ولكن إنما دحيت بعد خلق السماء بمعنى أنه أخرج ما كان فيها بالقوة إلى الفعل وهذا معنى قول ابن عباس وغير واحد واختاره ابن جرير."
    },
    {
      "ayah": 31,
      "surah": 79,
      "text": "قال ابن أبي حاتم حدثنا أبي حدثنا عبدالله بن جعفر الرقي حدثنا عبيد الله يعني ابن عمر عن زيد بن أبي أنيسة عن المنهال بن عمرو عن سعيد بن جبير عن ابن عباس \"دحاها\" ودحيها أن أخرج منها الماء والمرعى وشقق فيها الأنهار وجعل فيها الجبال والرمال والسبل والآكام فذلك قوله \"والأرض بعد ذلك دحاها\" وقد تقدم تقرير ذلك هنالك."
    },
    {
      "ayah": 32,
      "surah": 79,
      "text": "أي قررها وأثبتها وأكدها في أماكنها وهو الحكيم العليم الرءوف بخلقه الرحيم وقال الإمام أحمد حدثنا يزيد بن هارون أخبرنا العوام بن حوشب عن سليمان بن أبي سليمان عن أنس بن مالك عن النبي صلى الله عليه وسلم قال \"لما خلق الله الأرض جعلت تميد فخلق الجبال فألقاها عليها فاستقرت فتعجبت الملائكة من خلق الجبال فقالت يا رب فهل من خلقك شيء أشد من الجبال؟ قال نعم: الحديد قالت يا رب فهل من خلقك شيء أشد من الحديد؟ قال نعم: النار قالت: يا رب فهل من خلقك أشد من النار؟ قال نعم; الماء قال يا رب فهل من خلقك شيء أشد من الماء؟ قال نعم: الريح قالت يا رب فهل من خلقك شيء أشد من الريح؟ قال نعم: ابن آدم يتصدق بيمينه يخفيها عن شماله\" وقال أبو جعفر بن جرير حدثنا ابن حميد حدثنا جرير عن عطاء عن أبي عبدالرحمن السلمي عن علي قال: لما خلق الله الأرض قمصت وقالت تخلق علي آدم وذريته يلقون علي نتنهم ويعلون علي بالخطايا؟ فأرساها الله بالجبال فمنها ما ترون ومنها ما لا ترون وكان أول قرار الأرض كلحم الجزور إذا نحر يختلج لحمه. غريب جدا."
    },
    {
      "ayah": 33,
      "surah": 79,
      "text": "أي دحا الأرض فأنبع عيونها وأظهر مكنونها وأجرى أنهارها وأنبت زروعها وأشجارها وثمارها وثبت جبالها لتستقر بأهلها ويقر قرارها كل ذلك متاعا لخلقه ولما يحتاجون إليه من الأنعام التي يأكلونها ويركبونها مدة احتياجهم إليها في هذه الدار إلى أن ينتهي الأمد وينقضي الأجل."
    },
    {
      "ayah": 34,
      "surah": 79,
      "text": "وهو يوم القيامة قاله ابن عباس سميت بذلك لأنها تطم على كل آمر هائل مفظع كما قال تعالى \"والساعة أدهى وأمر\"."
    },
    {
      "ayah": 35,
      "surah": 79,
      "text": "أي حينئذ يتذكر ابن آدم جميع عمله خيره وشره كما قال تعالى \"يومئذ يتذكر الإنسان وأنى له الذكرى\"."
    },
    { "ayah": 36, "surah": 79, "text": "أي أظهرت للناظرين فرآها الناس عيانا." },
    { "ayah": 37, "surah": 79, "text": "أي تمرد وعتى." },
    { "ayah": 38, "surah": 79, "text": "أي قدمها على أمر دينه وأخراه." },
    { "ayah": 39, "surah": 79, "text": "أي فإن مصيره إلى الجحيم وإن مطعمه من الزقوم ومشربه من الحميم." },
    {
      "ayah": 4,
      "surah": 79,
      "text": "روي عن علي ومسروق ومجاهد وأبي صالح والحسن البصري يعني الملائكة قال الحسن سبقت إلى الإيمان والتصديق به وعن مجاهد الموت وقال قتادة هي النجوم وقال عطاء هي الخيل في سبيل الله."
    },
    {
      "ayah": 40,
      "surah": 79,
      "text": "أي خاف القيام بين يدي الله عز وجل وخاف حكم الله فيه ونهى نفسه عن هواها وردها إلى طاعة مولاها."
    },
    { "ayah": 41, "surah": 79, "text": "أي منقلبه ومصيره ومرجعه إلى الجنة الفيحاء." },
    {
      "ayah": 42,
      "surah": 79,
      "text": "أي ليس علمها إليك ولا إلى أحد من الخلق بل مردها ومرجعها إلى الله عز وجل فهو الذي يعلم وقتها على التعيين \"ثقلت في السموات والأرض لا تأتيكم إلا بغتة يسألونك كأنك حفي عنها قل إنما علمها عند الله\" وقال ههنا \"إلى ربك منتهاها\" ولهذا لما سأل جبريل رسول الله صلى الله عليه وسلم عن وقت الساعة قال \"ما المسئول عنها بأعلم من السائل\"."
    },
    {
      "ayah": 43,
      "surah": 79,
      "text": "ثم قال تعالى \"يسألونك عن الساعة أيان مرساها فيم أنت من ذكراها إلى ربك منتهاها\" أي ليس علمها إليك ولا إلى أحد من الخلق بل مردها ومرجعها إلى الله عز وجل فهو الذي يعلم وقتها على التعيين \"ثقلت في السموات والأرض لا تأتيكم إلا بغتة يسألونك كأنك حفي عنها قل إنما علمها عند الله\" وقال ههنا \"إلى ربك منتهاها\" ولهذا لما سأل جبريل رسول الله صلى الله عليه وسلم عن وقت الساعة قال \"ما المسئول عنها بأعلم من السائل\"."
    },
    {
      "ayah": 44,
      "surah": 79,
      "text": "ثم قال تعالى \"يسألونك عن الساعة أيان مرساها فيم أنت من ذكراها إلى ربك منتهاها\" أي ليس علمها إليك ولا إلى أحد من الخلق بل مردها ومرجعها إلى الله عز وجل فهو الذي يعلم وقتها على التعيين \"ثقلت في السموات والأرض لا تأتيكم إلا بغتة يسألونك كأنك حفي عنها قل إنما علمها عند الله\" وقال ههنا \"إلى ربك منتهاها\" ولهذا لما سأل جبريل رسول الله صلى الله عليه وسلم عن وقت الساعة قال \"ما المسئول عنها بأعلم من السائل\"."
    },
    {
      "ayah": 45,
      "surah": 79,
      "text": "أي إنما بعثتك لتنذر الناس وتحذرهم من بأس الله وعذابه فمن خشي الله وخاف مقامه ووعيده أتبعك فأفلح وأنجح والخيبة والخسار على من كذبك وخالفك."
    },
    {
      "ayah": 46,
      "surah": 79,
      "text": "أي إذا قاموا من قبورهم إلى المحشر يستقصرون مدة الحياة الدنيا حتى كأنها عندهم كانت عشية من يوم أو ضحى من يوم وقال جويبر عن الضحاك عن ابن عباس \"كأنهم يوم يرونها لم يلبثوا إلا عشية أو ضحاها\" أما عشية فما بين الظهر إلى غروب الشمس أو ضحاها ما بين طلوع الشمس إلى نصف النهار وقال قتادة: وقت الدنيا في أعين القوم حين عاينوا الآخرة. آخر تفسير سورة النازعات ولله الحمد والمنة."
    },
    {
      "ayah": 5,
      "surah": 79,
      "text": "قال علي ومجاهد وعطاء وأبو صالح والحسن وقتادة والربيع بن أنس والسدي هي الملائكة زاد الحسن تدبر الأمر من السماء إلى الأرض يعني بأمر ربها عز وجل ولم يختلفوا في هذا ولم يقطع ابن جرير بالمراد في شيء من ذلك إلا أنه حكى في المدبرات أمرا أنها الملائكة ولا أثبت ولا نفى."
    },
    {
      "ayah": 6,
      "surah": 79,
      "text": "قال ابن عباس هما النفختان الأولى والثانية وهكذا قال مجاهد. والحسن وقتادة والضحاك وغير واحد وعن مجاهد أما الأولى وهي قوله جل وعلا. \"يوم ترجف الراجفة\" فكقوله جلت عظمته \"يوم ترجف الأرض والجبال\" والثانية وهي الرادفة فهي كقوله \"وحملت الأرض والجبال فدكتا دكة واحدة\" وقد قال الإمام أحمد حدثنا وكيع حدثنا سفيان عن عبدالله بن محمد بن عقيل عن ابن الطفيل بن أبي بن كعب عن أبيه قال: قال رسول الله صلى الله عليه وسلم \"جاءت الراجفة تتبعها الرادفة جاء الموت بما فيه\" فقال رجل يا رسول الله أرأيت إن جعلت صلاتي كلها عليك؟ قال \"إذا يكفيك الله ما أهمك من دنياك وآخرتك\" وقد روى الترمذي وابن جرير وابن أبي حاتم من حديث سفيان الثوري بإسناده مثله ولفظ الترمذي وابن أبي حاتم كان رسول الله صلى الله عليه وسلم إذا ذهب ثلث الليل قام فقال: \"يا أيها الناس اذكروا الله جاءت الراجفة تتبعها الرادفة جاء الموت بما فيه\"."
    },
    {
      "ayah": 7,
      "surah": 79,
      "text": "قال ابن عباس هما النفختان الأولى والثانية وهكذا قال مجاهد. والحسن وقتادة والضحاك وغير واحد وعن مجاهد أما الأولى وهي قوله جل وعلا. \"يوم ترجف الراجفة\" فكقوله جلت عظمته \"يوم ترجف الأرض والجبال\" والثانية وهي الرادفة فهي كقوله \"وحملت الأرض والجبال فدكتا دكة واحدة\" وقد قال الإمام أحمد حدثنا وكيع حدثنا سفيان عن عبدالله بن محمد بن عقيل عن ابن الطفيل بن أبي بن كعب عن أبيه قال: قال رسول الله صلى الله عليه وسلم \"جاءت الراجفة تتبعها الرادفة جاء الموت بما فيه\" فقال رجل يا رسول الله أرأيت إن جعلت صلاتي كلها عليك؟ قال \"إذا يكفيك الله ما أهمك من دنياك وآخرتك\" وقد روى الترمذي وابن جرير وابن أبي حاتم من حديث سفيان الثوري بإسناده مثله ولفظ الترمذي وابن أبي حاتم كان رسول الله صلى الله عليه وسلم إذا ذهب ثلث الليل قام فقال: \"يا أيها الناس اذكروا الله جاءت الراجفة تتبعها الرادفة جاء الموت بما فيه\"."
    },
    { "ayah": 8, "surah": 79, "text": "قال ابن عباس يعني خائفة وكذا قال مجاهد وقتادة." },
    {
      "ayah": 9,
      "surah": 79,
      "text": "أي أبصار أصحابها وإنما أضيف إليها للملابسة أي ذليلة حقيرة مما عاينت من الأهوال."
    }
  ]
}
