{
  "ayahs": [
    {
      "ayah": 1,
      "surah": 8,
      "text": "سورة الأنفال: وهي مدنية آياتها سبعون وست آيات كلماتها ألف كلمة وستمائة كلمة وإحدى وثلاثون كلمة حروفها خمسة آلاف ومائتان وأربعة وتسعون حرفا والله أعلم. قال البخاري: قال ابن عباس الأنفال المغانم حدثنا محمد بن عبدالرحيم حدثنا سعيد بن سليمان أخبرنا هشيم أخبرنا أبو بشر عن سعيد بن جبير قال: قلت لابن عباس رضي الله عنهما سورة الأنفال قال نزلت في بدر أما ما علقه عن ابن عباس فكذلك رواه علي بن أبي طلحة عن ابن عباس أنه قال: الأنفال الغنائم كانت لرسول الله صلي الله عليه وسلم خالصة ليس لأحد منها شيء وكذا قال مجاهد وعكرمة وعطاء والضحاك وقتادة وعطاء الخراساني ومقاتل بن حيان وعبدالرحمن بن زيد بن أسلم وغير واحد أنها المغانم وقال الكلبي عن أبي صالح عن ابن عباس أنه قال: الأنفال الغنائم قال فيها لبيد: إن تقوى ربنا خير نفل وبإذن الله ريثي وعجل وقال ابن جرير: حدثني يونس أخبرنا ابن وهب أخبرني مالك بن أنس عن ابن شهاب عن القاسم بن محمد قال: سمعت رجلا يسأل ابن عباس عن الأنفال فقال ابن عباس رضي الله عنهما: الفرس من النفل والسلب من النفل. ثم عاد لمسألته فقال ابن عباس ذلك أيضا. ثم قال الرجل: الأنفال التي قال الله في كتابه ما هي؟ قال القاسم: فلم يزل يسأله حتى كاد يحرجه فقال ابن عباس: أتدرون ما مثل هذا مثل صبيغ الذي ضربه عمر بن الخطاب. وقال عبدالرزاق أخبرنا معمر عن الزهري عن القاسم بن محمد قال: قال ابن عباس: كان عمر بن الخطاب رضي الله عنه إذا سئل عن شيء قال لا آمرك ولا أنهاك ثم قال ابن عباس: والله ما بعث الله نبيه صلي الله عليه وسلم إلا زاجرا آمرا محللا محرما. قال القاسم: فسلط على ابن عباس رجل فسأله عن الأنفال فقال ابن عباس: كان الرجل ينفل فرس الرجل وسلاحه فأعاد عليه الرجل فقال له مثل ذلك ثم عاد عليه حتى أغضبه فقال ابن عباس: أتدرون ما مثل هذا؟ مثل صبيغ الذي ضربه عمر بن الخطاب حتى سالت الدماء على عقبيه أو على رجليه فقال الرجل: أما أنت فقد انتقم الله لعمر منك. وهذا إسناد صحيح إلى ابن عباس أنه فسر النفل بما ينفله الإمام لبعض الأشخاص من سلب أو نحوه بعد قسم أصل المغنم وهو المتبادر إلى فهم كثير من الفقهاء من لفظ النفل والله أعلم. وقال ابن أبي نجيح عن مجاهد: إنهم سألوا رسول الله صلي الله عليه وسلم عن الخمس بعد الأربعة من الأخماس فنزل \"يسألونك عن الأنفال\" وقال ابن مسعود ومسروق لا نفل يوم الزحف إنما النفل قبل التقاء الصفوف رواه ابن أبي حاتم عنهما وقال ابن المبارك وغير واحد عن عبدالملك بن أبي سليمان عن عطاء بن أبي رباح في الآية \"يسألونك عن الأنفال\" قال يسألونك فيما شذ من المشركين إلى المسلمين في غير قتال من دابة أو عبد أو أمة أو متاع فهو نفل للنبي صلى الله عليه وسلم يصنع به ما يشاء وهذا يقتضي أنه فسر الأنفال بالفيء وهو ما أخذ من الكفار من غير قتال. قال ابن جرير وقال آخرون: هي أنفال السرايا. حدثني الحارث حدثنا عبدالعزيز حدثنا علي بن صالح بن حيي قال: بلغني في قوله تعالى \"يسألونك عن الأنفال\" قال السرايا ومعنى هذا ما ينفله الإمام لبعض السرايا زيادة على قسمهم مع بقية الجيش. وقد صرح بذلك الشعبي. واختار ابن جرير أنها الزيادة على القسم. ويشهد لذلك ما ورد في سبب نزول الآية وهو ما رواه الإمام أحمد حيث قال: حدثنا أبو معاوية حدثنا أبو إسحق الشيباني عن محمد بن عبيد الله الثقفي عن سعد بن أبي وقاص قال: لما كان يوم بدر وقتل أخي عمير قتلت سعيد بن العاص وأخذت سيفه وكان يسمى ذا الكتيفة فأتيت به النبي صلي الله عليه وسلم فقال \"اذهب فاطرحه في القبض\" قال فرجعت وبي ما لا يعلمه إلا الله من قتل أخي وأخذ سلبي قال فما جاوزت إلا يسيرا حتى نزلت سورة الأنفال فقال لي رسول الله صلى الله عليه وسلم \"اذهب فخذ سلبك\" وقال الإمام أحمد أيضا: حدثنا أسود بن عامر أخبرنا أبو بكر عن عاصم بن أبي النجود عن مصعب بن سعد عن سعد بن مالك قال: قلت يا رسول الله قد شفاني الله اليوم من المشركين فهب لي هذا السيف فقال \"إن هذا السيف لا لك ولا لي ضعه\" قال فوضعته ثم رجعت فقلت عسى أن يعطي هذا السيف من لا يبلي بلائي قال فإذا رجل يدعوني من ورائي قال قلت قد أنزل الله في شيئا؟ قال كنت سألتني السيف وليس هو لي وإنه قد وهب لي فهو لك قال وأنزل الله هذه الآية \"يسألونك عن الأنفال قل الأنفال لله والرسول\" ورواه أبو داود الترمذي والنسائي من طرق عن أبي بكر بن عياش به وقال الترمذي حسن صحيح وهكذا رواه أبو داود الطيالسي أخبرنا شعبة أخبرنا سماك بن حرب قال: سمعت مصعب بن سعد يحدث عن سعد قال: نزلت في أربع آيات أصبت سيفا يوم بدر فأتيت النبي صلى الله عليه وسلم فقلت نفلنيه فقال \"ضعه من حيث أخذته\" مرتين ثم عاودته فقال النبي صلى الله عليه وسلم \"ضعه من حيث أخذته\" فنزلت هذه الآية \"يسألونك عن الأنفال\" الآية وتمام الحديث في نزول \"ووصينا الإنسان بوالديه حسنا\" وقوله تعالى \"إنما الخمر والميسر\" وآية الوصية وقد رواه مسلم في صحيحه من حديث شعبة به وقال محمد بن إسحق حدثني عبدالله بن أبي بكر عن بعض بني ساعدة قال: سمعت أبا أسيد مالك بن ربيعة يقول: أصبت سيف ابن عائذ يوم بدر وكان السيف يدعى بالمرزبان فلما أمر رسول الله صلى الله عليه وسلم الناس أن يردوا ما في أيديهم من النفل أقبلت به فألقيته في النفل وكان رسول الله صلى الله عليه وسلم لا يمنع شيئا يسأله فرآه الأرقم بن أبي الأرقم المخزومي فسأله رسول الله صلى الله عليه وسلم فأعطاه إياه ورواه ابن جرير من وجه آخر. \"سبب آخر في نزول الآية\" وقال الإمام أحمد: حدثنا محمد بن سلمة عن ابن إسحق عن عبدالرحمن عن سليمان بن موسى عن مكحول عن أبي أمامة قال: سألت عبادة عن الأنفال فقال: فينا أصحاب بدر نزلت حين أختلفنا في النفل وساءت فيه أخلاقنا فانتزعه الله من أيدينا وجعله إلى رسول الله صلى الله عليه وسلم فقسمه رسول الله صلى الله عليه وسلم بين المسلين عن بواء يقول عن سواء. وقال الإمام أحمد أيضا: حدثنا أبو معاوية بن عمر أخبرنا أبو إسحاق عن عبدالرحمن بن الحارث بن عبدالله بن عياش بن أبي ربيعة عن سليمان بن موسى عن أبي سلامة عن أبي أمامة عن عبادة بن الصامت قال: خرجنا مع رسول الله صلى الله عليه وسلم فشهدت معه بدرا فالتقى الناس فهزم الله تعالى العدو فانطلقت طائفة في آثارهم يهزمون ويقتلون وأقبلت طائفة على العسكر يحوزونه ويجمعونه وأحدقت طائفة برسول الله صلى الله عليه وسلم لا يصيب العدو منه غرة حتى إذا كان الليل وفاء الناس بعضهم إلى بعض قال الذين جمعوا الغنائم نحن حويناها فليس لأحد فيها نصيب وقال الذين خرجوا في طلب العدو لستم بأحق به منا نحن منعنا عنه العدو وهزمناهم وقال الذين أحدقوا برسول الله صلى الله عليه وسلم خفنا أن يصيب العدو منه غرة فاشتغلنا به فنزلت \"يسألونك عن الأنفال قل الأنفال لله والرسول فاتقوا الله وأصلحوا ذات بينكم\" فقسمها رسول الله صلى الله عليه وسلم بين المسلمين وكان رسول الله صلى الله عليه وسلم إذا أغار في أرض العدو نفل الربع فإذا أقبل راجعا نفل الثلث وكان يكره الأنفال ورواه الترمذي وابن ماجه من حديث سفيان الثوري عن عبدالرحمن بن الحارث به نحوه قال الترمذي هذا حديث صحيح ورواه ابن حبان في صحيحه والحاكم في مستدركه من حديث عبدالرحمن بن الحارث وقال الحاكم: صحيح الإسناد على شرط مسلم ولم يخرجاه. وروى أبو داود والنسائي وابن جرير وابن مردويه واللفظ له وابن حبان والحاكم من طرق عن داود بن أبي هند عن عكرمة عن ابن عباس قال: لما كان يوم بدر قال رسول الله صلى الله عليه وسلم \"من صنع كذا وكذا فله كذا وكذا\" فتسارع في ذلك شبان القوم وبقي الشيوخ تحت الرايات فلما كانت المغانم جاءوا يطلبون الذي جعل لهم فقال الشيوخ لا تستأثروا علينا فإنا كنا ردءا لكم لو انكشفتم لفئتم إلينا. فتنازعوا فأنزل الله تعالى \"يسألونك عن الأنفال\" - إلى قوله - \"وأطيعوا الله ورسوله إن كنتم مؤمنين\" وقال الثوري عن الكلبي عن أبي صالح عن ابن عباس قال: لما كان يوم بدر قال رسول الله صلى الله عليه وسلم \"من قتل قتيلا فله كذا وكذا ومن أتى بأسير فله كذا وكذا\" فجاء أبو اليسر بأسيرين فقال يا رسول الله صلى الله عليك أنت وعدتنا فقام سعد بن عبادة فقال: يا رسول الله إنك لو أعطيت هؤلاء لم يبق لأصحابك شيء وإنه لم يمنعنا من هذا زهادة في الأجر ولا جبن عن العدو وإنما قمنا هذا المقام محافظة عليك مخافة أن يأتوك من ورائك فتشاجروا ونزل القرآن \"يسألونك عن الأنفال قل الأنفال لله والرسول\" قال: ونزل القرآن \"وأعلموا أنما غنمتم من شيء فأن لله خمسه\" إلى آخر الآية وقال الإمام أبو عبيد الله القاسم بن سلام رحمه الله في كتاب الأموال الشرعية وبيان جهاتها ومصارفها: أما الأنفال فهي الغنائم وكل نيل ناله المسلمون من أموال أهل الحرب فكانت الأنفال الأولى لرسول الله صلى الله عليه وسلم يقول الله تعالى \"يسألونك عن الأنفال قل الأنفال لله والرسول\" فقسمها يوم بدر على ما أراه الله من غير أن يخمسها على ما ذكرناه في حديث سعد ثم نزلت بعد ذلك آية الخمس فنسخت الأولى قلت هكذا روى علي بن أبي طلحة عن ابن عباس سواء وبه قال مجاهد وعكرمة والسدي وقال ابن زيد ليست منسوخة بل هي محكمة قـال أبو عبيد وفي ذلك آثار والأنفال أصلها جماع الغنائم إلا أن الخمس منها مخصوص لأهله على ما نزل به الكتاب وجرت به السنة ومعنى الأنفال في كلام العرب كل إحسان فعله فاعل تفضلا من غير أن يجب ذلك عليه فذلك النفل الذي أحله الله للمؤمنين من أموال عدوهم وإنما هو شيء خصهم الله به تطولا منه عليهم بعد أن كانت المغانم محرمة على الأمم قبلهم فنفلها الله تعالى هذه الأمة فهذا أصل النفل قلت شاهد هذا ما في الصحيحين عن جابر رضي الله عنه \"أن رسول الله صلى الله عليه وسلم قال \"أعطيت خمسا لم يعطهن أحد قبلي - فذكر الحديث إلى أن قال - وأحلت لي الغنائم ولم تحل لأحد قبلي\" وذكر تمام الحديث ثم قال أبو عبيد: ولهذا سمي ما جعل الإمام للمقاتلة نفلا وهو تفضيله بعض الجيش على بعض بشيء سوى سهامهم يفعل ذلك بهم على قدر الغناء عن الإسلام والنكاية في العدو وفي النفل الذي ينفله الإمام سنن أربع لكل واحدة منهن موضع غير موضع الأخرى \"فإحداهن\" في النفل لا خمس فيه وذلك السلب. \"والثانية\" النفل الذي يكون من الغنيمة بعد إخراج الخمس وهو أن يوجه الإمام السرايا في أرض الحرب فتأتي بالغنائم فيكون للسرية مما جاءت به الربع أو الثلث بعد الخمس \"والثالثة\" في النفل من الخمس نفسه وهو أن تحاز الغنيمة كلها ثم تخمس فإذا صار الخمس في يدي الإمام نفل منه على قدر ما يرى. \"والرابعة\" في النفل في جملة الغنيمة قبل أن يخمس منها شيء وهو أن يعطي الأدلاء ورعاة الماشية والسواق لها وفي كل ذلك أختلاف. قال الربيع: قال الشافعي الأنفال أن لا يخرج من رأس الغنيمة قبل الخمس شيء غير السلب. قال أبو عبيد: والوجه الثاني من النقل هو شيء زيدوه غير الذي كان لهم وذلك من خمس النبي صلى الله عليه وسلم فإن له خمس الخمس من كل غنيمة فينبغي للإمام أن يجتهد فإذا كثر العدو واشتدت شوكتهم وقل من بإزائه من المسلمين نفل منه اتباعا لسنة رسول الله صلى الله عليه وسلم وإذا لم يكن ذلك لم ينفل. \"والوجه الثالث\" من النفل إذا بعث الإمام سرية أو جيشا فقال لهم قبل اللقاء من غنم شيئا فهو له بعد الخمس فهو لهم على شرط الإمام لأنهم على ذلك غزوا وبه رضوا. أنتهى كلامه. وفيما تقدم من كلامه وهو قوله: إن غنائم بدر لم تخمس نظر ويرد عليه حديث علي بن أبي طالب في شارفيه اللذين حصلا له من الخمس يوم بدر وقد بينت ذلك في كتاب السيرة بيانا شافيا ولله الحمد والمنة. وقوله تعالى \"فاتقوا الله وأصلحوا ذات بينكم\" أي واتقوا الله في أموركم وأصلحوا فيما بينكم ولا تظالموا ولا تخاصموا ولا تشاجروا فما آتاكم الله من الهدى والعلم خير مما تختصمون بسببه \"وأطيعوا الله ورسوله\" أي في قسمه بينكم على ما أراده الله فإنه إنما يقسمه كما أمره الله من العدل والإنصاف وقال ابن عباس هذا تحريج من الله ورسوله أن يتقوا ويصلحوا ذات بينهم وكذا قال مجاهد وقال السدي \"فاتقوا الله وأصلحوا ذات بينكم\" أي لا تستبوا. ولنذكر ههنا حديثا أورده الحافظ أبو يعلى أحمد بن علي بن المثنى الموصلي رحمه الله في مسنده فإنه قال: حدثنا مجاهد بن موسى حدثنا عبدالله بن بكير حدثنا عباد بن شيبة الحبطي عن سعيد بن أنس عن أنس رضي الله عنه \"قال: بينا رسول الله صلى الله عليه وسلم جالس إذ رأيناه ضحك حتى بدت ثناياه فقال عمر: ما أضحكك يا رسول. الله بأبي أنت وأمي؟ فقال:\"رجلان من أمتي جثيا بين يدي رب العزة تبارك وتعالى فقال أحدهما: يا رب خذ لي مظلمتي من أخي. قال الله تعالى:أعط أخاك مظلمته قال: يا رب لم يبق من حسناتي شيء قال: رب فليحمل عني أوزاري قال: ففاضت عينا رسول الله صلى الله عليه وسلم بالبكاء ثم قال:إن ذلك ليوم عظيم يوم يحتاج الناس إلى من يتحمل عنهم من أوزارهم فقال الله تعالى للطالب:أرفع بصرك وانظر في الجنان فرفع رأسه فقال: يا رب أرى مدائن من فضة وقصورا من ذهب مكللة باللؤلؤ. لأي نبي هذا؟ لأي صديق هذا؟ لأي شهيد هذا؟ قال هذا لمن أعطى ثمنه قال يا رب ومن يملك ثمنه؟ قال أنت تملكه قال ماذا يا رب؟ قال تعفو عن أخيك قال يا رب فإنى قد عفوت عنه قال الله تعالى خذ بيد أخيك فادخلا الجنة\". ثم قال رسول الله صلى الله عليه وسلم \"فاتقوا الله وأصلحوا ذات بينكم فإن الله تعالى يصلح بين المؤمنين يوم القيامة\"."
    },
    {
      "ayah": 10,
      "surah": 8,
      "text": "وقوله تعالى \"وما جعله الله إلا بشرى\" الآية. أي وما جعل الله بعث الملائكة وإعلامه إياكم بهم إلا بشرى \"ولتطمئن به قلوبكم\" وإلا فهو تعالى قادر على نصركم على أعدائكم ولتطمئن به قلوبكم وما النصر إلا من عند الله أي بدون ذلك ولهذا قال \"وما النصر إلا من عند الله\" كما قال تعالى \"فإذا لقيتم الذين كفروا فضرب الرقاب حتى إذا أثخنتموهم فشدوا الوثاق فإما منا بعد وإما فداءا حتى تضع الحرب أوزارها ذلك ولو يشاء الله لانتصر منهم ولكن ليبلو بعضكم ببعض والذين قتلوا في سبيل الله فلن يضل أعمالهم سيهديهم ويصلح بالهم ويدخلهم الجنة عرفها لهم\" وقال تعالى \"وتلك الأيام نداولها بين الناس وليعلم الله الذين آمنوا ويتخذ منكم شهداء والله لا يحب الظالمين وليمحص الله الذين آمنوا ويمحق الكافرين\" فهذه حكم شرع الله جهاد الكفار بأيدي المؤمنين لأجلها وقد كان تعالى إنما يعاقب الأمم السالفة المكذبة للأنبياء بالقوارع التي تعم تلك الأمم المكذبة كما أهلك قوم نوح بالطوفان وعادا الأولى بالدبور وثمود بالصيحة وقوم لوط بالخسف والقلب وحجارة السجيل وقوم شعيب بيوم الظلة فلما بعث الله تعالى موسى وأهلك عدوه فرعون وقومه بالغرق في اليم ثم أنزل على موسى التوراة شرع فيها قتال الكفار واستمر الحكم في بقية الشرائع بعده على ذلك كما قال تعالى \"ولقد آتينا موسى الكتاب من بعد ما أهلكنا القرون الأولى بصائر\" وقتل المؤمنين للكافرين أشد إهانة للكافرين وأشفى لصدور المؤمنين كما قال تعالى للمؤمنين من هذه الأمة \"قاتلوهم يعذبهم الله بأيديكم ويخزهم وينصركم عليهم ويشف صدور قوم مؤمنين\" ولهذا كان قتل صناديد قريش بأيدي أعدائهم الذين ينظرون إليهم بأعين ازدرائهم أنكى لهم وأشفى لصدور حزب الإيمان فقتل أبي جهل في معركة القتال وحومة الوغى أشد إهانة له من موته على فراشه بقارعة أو صاعقة أو نحو ذلك كما مات أبو لهب لعنه الله بالعدسة بحيث لم يقربه أحد من أقاربه وإنما غسلوه بالماء قذفا من بعيد ورجموه حتى دفنوه ولهذا قال تعالى \"إن الله عزيز\" أي له العزة ولرسوله وللمؤمنين بهما في الدنيا والآخرة كقوله تعالى \"إنا لننصر رسلنا والذين آمنوا في الحياة الدنيا ويوم يقوم الأشهاد\".\"حكيم\": فيما شرعه من قتال الكفار مع القدرة على دمارهم وإهلاكهم بحوله وقوته سبحانه وتعالى."
    },
    {
      "ayah": 11,
      "surah": 8,
      "text": "يذكرهم الله تعالى بما أنعم به عليهم من إلقائه النعاس عليهم أمانا أمنهم به من خوفهم الذي حصل لهم من كثرة عدوهم وقلة عددهم وكذلك فعل تعالى بهم يوم أحد كما قال تعالى \"ثم أنزل عليكم من بعد الغم أمنة نعاسا يغشى طائفة منكم وطائفة قد أهمتهم أنفسهم\" الآية. قال أبو طلحة: كنت ممن أصابه النعاس يوم أحد ولقد سقط السيف من يدي مرارا يسقط وآخذه ويسقط وآخذه ولقد نظرت إليهم يميدون وهم تحت الحجف. وقال الحافظ أبو يعلى حدثنا زهير حدثنا ابن مهدي عن شعبة عن أبي إسحق عن حارثة بن مضرب عن علي رضي الله عنه قال: ما كان فينا فارس يوم بدر غير المقداد ولقد رأيتنا وما فينا إلا نائم إلا رسول الله صلى الله عليه وسلم يصلي تحت شجرة ويبكي حتى أصبح. وقال سفيان الثوري عن عاصم عن أبي رزين عن عبدالله بن مسعود رضي الله عنه أنه قال: النعاس في القتال أمنة من الله وفي الصلاة من الشيطان وقال قتادة: النعاس في الرأس والنوم في القلب قلت أما النعاس فقد أصابهم يوم أحد وأمر ذلك مشهور جدا وأما الآية الشريفة إنما هي في سياق قصة بدر وهي دالة على وقوع ذلك أيضا وكأن ذلك كائن للمؤمنين عند شدة البأس لتكون قلوبهم آمنة مطمئنة بنصر الله وهذا من فضل الله ورحمته بهم ونعمته عليهم وكما قال تعالى \"فإن مع العسر يسرا إن مع العسر يسرا\" ولهذا جاء في الصحيح أن رسول الله صلى الله عليه وسلم لما كان يوم بدر في العريش مع الصديق رضي الله عنه وهما يدعوان أخذت رسول الله صلى الله عليه وسلم سنة من النوم ثم استيقظ مبتسما فقال \"أبشر يا أبا بكر هذا جبريل على ثناياه النقع\" ثم خرج من باب العريش وهو يتلو قوله تعالى \"سيهزم الجمع ويولون الدبر\" وقوله \"وينزل عليكم من السماء ماء\" قال علي بن أبي طلحة عن ابن عباس قال: نزل النبي صلى الله عليه وسلم حين سار إلى بدر والمشركون بينهم وبين الماء رملة دعصة وأصاب المسلمين ضعف شديد وألقى الشيطان في قلوبهم الغيظ يوسوس بينهم تزعمون أنكم أولياء الله تعالى وفيكم رسوله وقد غلبكم المشركون على الماء وأنتم تصلون مجنبين فأمطر الله عليهم مطرا شديدا فشرب المسلمون وتطهروا وأذهب الله عنهم رجس الشيطان وثبت الرمل حين أصابه المطر ومشى الناس عليه والدواب فساروا إلى القوم وأمد الله نبيه صلى الله عليه وسلم والمؤمنين بألف من الملائكة فكان جبريل في خمسمائة مُجَنِّبَةٍ وميكائيل في خمسمائة مجنبة. وكذا قال العوفي عن ابن عباس: إن المشركين من قريش لما خرجوا لينصروا العير وليقاتلوا عنها نزلوا على الماء يوم بدر فغلبوا المؤمنين عليه فأصاب المؤمنين الظمأ فجعلوا يصلون مجنبين محدثين حتى تعاطوا ذلك في صدورهم فأنزل الله من السماء ماء حتى سال الوادي فشرب المؤمنون وملؤا الأسقية وسقوا الركاب واغتسلوا من الجنابة فجعل الله في ذلك طهورا وثبت به الأقدام وذلك أنه كانت بينهم وبين القوم رملة فبعث الله المطر عليها فضربها حثى اشتدت وثبتت عليها الأقدام. ونحو ذلك روى عن قتادة والضحاك والسدي وقد روى عن سعيد بن المسيب والشعبي والزهري وعبدالرحمن بن زيد بن أسلم أنه طَشٌّ أصابهم يوم بدر. والمعروف أن رسول الله صلى الله عليه وسلم لما سار إلى بدر نزل على أدنى ماء هناك أي أول ماء وجده فتقدم إليه الحباب بن المنذر فقال: يا رسول الله هذا المنزل الذي نزلته منزلة أنزلك الله إياه فليس لنا أن نجاوزه أو منزل نزلته للحرب والمكيدة؟ فقال \"بل منزل نزلته للحرب والمكيدة\" فقال يا رسول الله إن هذا ليس بمنزل ولكن سر بنا حتى ننزل على أدنى ماء يلي القوم ونغور ما وراءه من القلب ونستقي الحياض فيكون لنا ماء وليس لهم ماء فسار رسول الله صلى الله عليه وسلم ففعل كذلك وفي مغازي الأموي أن الحباب لما قال ذلك نزل ملك من السماء وجبريل جالس عند رسول الله صلى الله عليه وسلم فقال ذلك الملك: يا محمد إن ربك يقرئك السلام ويقول لك إن الرأي ما أشار به الحباب بن المنذر فالتفت رسول الله صلى الله عليه وسلم إلى جبريل عليه السلام فقال \"هل تعرف هذا؟ \" فنظر إليه فقال: ما كل الملائكة أعرفهم وإنه ملك وليس بشيطان. وأحسن ما في هذا ما رواه الإمام محمد بن إسحق بن يسار صاحب المغازي رحمه الله حدثني يزيد بن رومان عن عروة بن الزبير قال: بعث الله السماء وكان الوادي دهسا فأصاب رسول الله صلى الله عليه وسلم وأصحابه ما لبد لهم الأرض ولم يمنعهم من المسير وأصاب قريشا ما لم يقدروا على أن يرحلوا معه وقال مجاهد: أنزل الله عليهم المطر قبل النعاس فأطفأ بالمطر الغبار وتلبدت به الأرض وطابت نفوسهم وثبتت به أقدامهم وقال ابن جرير: حدثنا هارون بن إسحق حدثنا مصعب بن المقدام حدثنا إسرائيل حدثنا أبو إسحق عن جارية عن علي رضي الله عنه قال: أصابنا من الليل طَشٌّ من المطر يعني الليلة التي كانت في صبيحتها وقعة بدر فانطلقنا تحت الشجر والحجف نستظل تحتها من المطر وبات رسول الله صلى الله عليه وسلم وحرض على القتال. وقوله \"ليطهركم به\" أي من حدث أصغر أو أكبر وهو تطهير الظاهر \"ويذهب عنكم رجز الشيطان\" أي من وسوسة أو خاطر سيء وهو تطهير الباطن كما قال تعالى في حق أهل الجنة \"عاليهم ثياب سندس خضر وإستبرق وحلوا أساور من فضة\" فهذا زينة الظاهر \"وسقاهم ربهم شرابا طهورا\" أي مطهرا لما كان من غل أو حسد أو تباغض وهو زينة الباطن وطهارته \"وليربط على قلوبكم\" أي بالصبر والإقدام على مجالدة الأعداء وهو شجاعة الباطن \"ويثبت به الأقدام\" وهو شجاعة الظاهر والله أعلم."
    },
    {
      "ayah": 12,
      "surah": 8,
      "text": "وقوله \"إذ يوحي ربك إلى الملائكة أني معكم فثبتوا الذين آمنوا\" وهذه نعمة خفية أظهرها الله تعالى لهم ليشكروه عليها وهو أنه تعالى وتقدس وتبارك وتمجد أوحى إلى الملائكة الذين أنزلهم لنصر نبيه ودينه وحزبه المؤمنين يوحي إليهم فيما بينه وبينهم أن يثبِّتوا الذين آمنوا قال ابن إسحق: وآزروهم وقال غيره: قاتلوا معهم وقيل كثروا سوادهم وقيل كان ذلك بأن الملك كان يأتي الرجل من أصحاب النبي صلى الله عليه وآله وسلم فيقول سمعت هؤلاء القوم يعني المشركين يقولون والله لئن حملوا علينا لننكشفن فيحدث المسلمون بعضهم بعضا بذلك فتقوى أنفسهم حكاه ابن جرير وهذا لفظه بحروفه وقوله \"سألقي في قلوب الذين كفروا الرعب\" أي ثبتوا أنتم المؤمنين وقووا أنفسهم على أعدائهم عن أمري لكم بذلك سألقي الرعب والذلة والصغار على من خالف أمري وكذب رسولي \"فاضربوا فوق الأعناق واضربوا منهم كل بنان\" أي اضربوا الهام ففلقوها واحتزوا الرقاب فقطعوها وقطعوا الأطراف منهم وهي أيديهم وأرجلهم وقد أختلف المفسرون في معنى \"فوق الأعناق\" فقيل معناه اضربوا الرءوس قاله عكرمة وقيل معناه أي على الأعناق وهي الرقاب قاله الضحاك وعطية العوفي ويشهد لهذا المعنى أن الله تعالى أرشد المؤمنين إلى هذا في قوله تعالى \"فاذا لقيتم الذين كفروا فضرب الرقاب حتى إذا أثخنتموهم فشدوا الوثاق \"وقال وكيع عن المسعودي عن القاسم قال: قال النبي صلى الله عليه وسلم \"إني لم أبعث لأعذب بعذاب الله إنما بعثت لضرب الرقاب وشد الوثاق\" واختار ابن جرير أنها قد تدل على ضرب الرقاب وفلق الهام قلت وفي مغازي الأموي أن رسول الله صلى الله عليه وسلم جعل يمر بين القتلى يوم بدر فيقول \"يفلق هاما\" فيقول أبو بكر: من رجال أعزة علينا وهم كانوا أعق وأظلما فيبتدئ رسول الله صلى الله عليه وسلم بأول البيت ويستطعم أبا بكر رضي الله عنه إنشاد آخره لأنه كان لا يحسن إنشاد الشعر كما قال تعالى \"وما علمناه الشعر وما ينبغي له\" وقال الربيع بن أنس: كان الناس يوم بدر يعرفون قتلى الملائكة ممن قتلوهم بضرب فوق الأعناق وعلى البنان مثل سمة النار قد أحرق به وقوله \"واضربوا منهم كل بنان\" قال ابن جرير معناه واضربوا من عدوكم أيها المؤمنون كل طرف ومفصل من أطراف أيديهم وأرجلهم والبنان جمع بنانة كما قال الشاعر: ألا ليتني قطعت مني بنانة ولاقيته في البيت يقظان حاذرا وقال علي بن أبي طلحة عن ابن عباس \"واضربوا منهم كل بنان\" يعني بالبنان الأطراف وكذا قال الضحاك وابن جرير وقال السدي البنان الأطراف ويقال كل مفصل وقال عكرمة وعطية العوفي والضحاك في رواية أخرى كل مفصل وقال الأوزاعي في قوله تعالى \"واضربوا منهم كل بنان\" قال اضرب منه الوجه والعين وارمه بشهاب من نار فإذا أخذته حرم ذلك كله عليك وقال العوفي عن ابن عباس فذكر قصة بدر إلى أن قال: فقال أبو جهل لا تقتلوهم قتلا ولكن خذوهم أخذا حتى تعرفوهم الذي صنعوا من طعنهم في دينكم ورغبتهم عن اللات والعزى فأوحى الله إلى الملائكة \"أني معكم فثبتوا الذين آمنوا سألقي في قلوب الذين كفروا الرعب فاضربوا فوق الأعناق واضربوا منهم كل بنان\" الآية. فقتل أبو جهل لعنه الله في تسعة وستين رجلا وأسر عقبة بن أبي معيط فقتل صبرا فوفى ذلك سبعين يعني قتيلا."
    },
    {
      "ayah": 13,
      "surah": 8,
      "text": "قال تعالى \"ذلك بأنهم شاقوا الله ورسوله\" أي خالفوهما فساروا في شق وتركوا الشرع والإيمان به واتباعه في شق ومأخوذ أيضا من شق العصا وهو جعلها فرقتين \"ومن يشاقق الله ورسوله فإن الله شديد العقاب\" أي هو الطالب الغالب لمن خالفه وناوأه لا يفوته شيء ولا يقوم لغضبه شيء تبارك وتعالى لا إله غيره ولا رب سواه."
    },
    {
      "ayah": 14,
      "surah": 8,
      "text": "\"ذلكم فذوقوه وأن للكافرين عذاب النار\" هذا خطاب للكفار أي ذوقوا هذا العذاب والنكال في الدنيا واعلموا أيضا أن للكافرين عذاب النار في الآخرة."
    },
    {
      "ayah": 15,
      "surah": 8,
      "text": "يقول تعالى متوعدا على الفرار من الزحف بالنار لمن فعل ذلك \"يا أيها الذين آمنوا إذا لقيتم الذين كفروا زحفا\" أي تقاربتم منهم ودنوتم إليهم \"فلا تولوهم الأدبار\" أي تفروا وتتركوا أصحابكم."
    },
    {
      "ayah": 16,
      "surah": 8,
      "text": "أي يفر بين يدي قِرنه مكيدة ليريه أنه قد خاف منه فيتبعه ثم يكر عليه فيقتله فلا بأس عليه في ذلك نص عليه سعيد بن جبير والسدي وقال الضحاك أن يتقدم عن أصحابه ليرى غِرة من العدو فيصيبها \"أو متحيزا إلى فئة\" أي فر من ههنا إلى فئة أخرى من المسلمين يعاونهم ويعاونونه فيجوز له ذلك حتى لو كان في سرية ففر إلى أميره أو إلى الإمام الأعظم دخل في هذه الرخصة قال الإمام أحمد: حدثنا حسن حدثنا زهير حدثنا يزيد بن أبي زياد عن عبدالرحمن بن أبي ليلى عن عبدالله بن عمر رضي الله عنهما قال كنت في سرية من سرايا رسول الله صلى الله عليه وسلم فحاص الناس حيصة فكنت فيمن حاص فقلنا كيف نصنع وقد فررنا من الزحف وبؤنا بالغضب؟ ثم قلنا لو دخلنا المدينة ثم بتنا ثم قلنا لو عرضنا أنفسنا على رسول الله صلى الله عليه وسلم فإن كانت لنا توبة وإلا ذهبنا فأتيناه قبل صلاة الغداة فخرج فقال \"من القوم؟ \" فقلنا: نحن الفرارون. فقال \"لا بل أنتم العكارون أنا فئتكم وأنا فئة المسلمين\" قال فأتيناه حتى قبلنا يده وهكذا رواه أبو داود والترمذي وابن ماجه من طرق عن يزيد بن أبي زياد وقال الترمذي حسن لا نعرفه إلا من حديث ابن أبي زياد. ورواه ابن أبي حاتم من حديث يزيد بن أبي زياد به وزاد في آخره وقرأ رسول الله صلى الله عليه وسلم هذه الآية \"أو متحيزا إلى فئة\" قال أهل العلم معنى قوله \"العكارون\" أي العرافون وكذلك قال عمر بن الخطاب رضي الله عنه في أبي عبيدة لما قتل على الجسر بأرض فارس لكثرة الجيش من ناحية المجوس فقال عمر: لو تحيز إلي لكنت له فئة هكذا رواه محمد بن سيرين عن عمر وفي رواية أبي عثمان النهدي عن عمر قال لما قتل أبو عبيدة قال عمر أيها الناس أنا فئتكم وقال مجاهد قال عمر أنا فئة كل مسلم وقال عبدالملك بن عمير عن عمر: أيها الناس لا تغرنكم هذه الآية فإنما كانت يوم بدر وأنا فئة لكل مسلم وقال ابن أبي حاتم حدثنا أبي حدثنا حسان بن عبدالله المصري حدثنا خلاد بن سليمان الحضرمي حدثنا نافع أنه سأل ابن عمر قلت: إنا قوم لا نثبت عند قتال عدونا ولا ندري من الفئة؟! إمامنا أو عسكرنا! فقال:إن الفئة رسول الله صلي الله عليه وسلم فقلت إن الله يقول \"إذا لقيتم الذين كفروا زحفا\" الآية فقال:إنما أنزلت هذه الآية في يوم بدر لا قبلها ولا بعدها وقال الضحاك في قوله \"أو متحيزا إلى فئة\" المتحيز: الفار إلى النبي وأصحابه وكذلك من فر اليوم إلى أميره أو أصحابه فأما إن كان الفرار لا عن سبب من هذه الأسباب فإنه حرام وكبيرة من الكبائر لما رواه البخاري ومسلم في الصحيحين عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم \"اجتنبوا السبع الموبقات\" قيل يا رسول الله وما هن؟ قال \"الشرك بالله والسحر وقتل النفس التي حرم الله إلا بالحق وأكل الربا وأكل مال اليتيم والتولي يوم الزحف وقذف المحصنات الغافلات المؤمنات\" وله شواهد من وجوه أخر ولهذا قال تعالى \"فقد باء\" أي رجع \"بغضب من الله ومأواه\" أي مصيره ومنقلبه يوم ميعاده \"جهنم وبئس المصير\". وقال الإمام أحمد حدثنا زكريا بن عدي حدثنا عبدالله بن عمر الرقي عن زيد بن أبي أنيسة حدثنا جبلة بن سحيم عن أبي المثنى العبدي سمعت السدوسي يعني ابن الخصاصية وهو بشير بن معبد قال أتيت النبي صلى الله عليه وسلم لأبايعه فاشترط علي شهادة أن لا إله إلا الله وأن محمدا عبده ورسوله وأن أقيم الصلاة وأن أؤدي الزكاة وأن أحج حجة الإسلام وأن أصوم شهر رمضان وأن أجاهد في سبيل الله. فقلت يا رسول الله أما اثنتان فوالله لا أطيقهما: الجهاد فإنهم زعموا أن من ولى الدبر فقد باء بغضب من الله فأخاف إن حضرت ذلك خشعت نفسي وكرهت الموت والصدقة فوالله مالي إلا غنيمة وعشر ذودهن رسل أهلي وحمولتهم فقبض رسول الله صلى الله عليه وسلم يده قال \"فلا جهاد ولا صدقة فبم تدخل الجنة إذًا؟ \" قلت يا رسول الله أنا أبايعك فبايعته عليهن كلهن هذا حديث غريب من هذا الوجه ولم يخرجوه في الكتب الستة. وقال الحافظ أبو القاسم الطبراني حدثنا أحمد بن محمد بن يحيى بن حمزة حدثنا إسحق بن إبراهيم أبو النضر حدثنا يزيد بن ربيعة حدثنا أبو الأشعث عن ثوبان مرفوعا عن النبي صلى الله عليه وسلم قال \"ثلاثة لا ينفع معهن عمل: الشرك بالله وعقوق الوالدين والفرار من الزحف\" وهذا أيضا حديث غريب جدا وقال الطبراني أيضا حدثنا العباس بن مقاتل الأسفاطي حدثنا موسى بن إسماعيل حدثنا حفص بن عمر السني حدثني عمرو بن مرة قال سمعت بلال بن يسار بن زيد مولى رسول الله صلى الله عليه وسلم قال سمعت أبي يحدث عن جدي قال: قال رسول الله صلى الله عليه وسلم \"من قال أستغفر الله الذي لا إله إلا هو وأتوب إليه غُفر له وإن كان قد فر من الزحف\". وهكذا رواه أبو داود عن موسى بن إسماعيل به وأخرجه الترمذي عن البخاري عن موسى بن إسماعيل به وقال غريب لا نعرفه إلا من هذا الوجه قلت ولا يُعرف لزيد مولى النبي صلى الله عليه وسلم عنه سواه وقد ذهب ذاهبون إلى أن الفرار إنما كان حراما على الصحابة لأنه كان فرض عين عليهم وقيل على الأنصار خاصة لأنهم بايعوا على السمع والطاعة في المنشط والمكره وقيل المراد بهذه الآية أهل بدر خاصة يروى هذا عن عمر وابن عمر وابن عباس وأبي هريرة وأبي سعيد وأبي نضرة ونافع مولى ابن عمر وسعيد بن جبير والحسن البصري وعكرمة وقتادة والضحاك وغيرهم وحجتهم في هذا أنه لم تكن عصابة لها شوكة يفيئون إليها إلا عصابتهم تلك كما قال النبي صلى الله عليه وسلم \"اللهم إن تهلك هذه العصابة لا تعبد في الأرض\" ولهذا قال عبدالله بن المبارك عن مبارك بن فضالة عن الحسن في قوله \"ومن يولهم يومئذ دبره\" قال ذلك يوم بدر فأما اليوم فإن انحاز إلى فئة أو مصر أحسبه قال فلا بأس عليه وقال ابن المبارك أيضا عن ابن لهيعة حدثني يزيد بن أبي حبيب قال أوجب الله تعالى لمن فر يوم بدر النار قال \"ومن يولهم يومئذ دبره إلا متحرفا لقتال أو متحيزا إلى فئة فقد باء بغضب من الله\" فلما كان يوم أحد بعد ذلك قال \"إن الذين تولوا منكم يوم التقى الجمعان \" - إلى قوله - \"ولقد عفا الله عنهم\" ثم كان يوم حنين بعد ذلك بسبع سنين قال \"ثم وليتم مدبرين ثم أنزل الله سكينته على رسوله وعلى المؤمنين وأنزل جنودا لم تروها وعذب الذين كفروا وذلك جزاء الكافري ثم يتوب الله من بعد ذلك على من يشاء\" وفي سنن أبي داود والنسائي ومستدرك الحاكم وتفسير ابن جرير وابن مردويه من حديث داود بن أبي هند عن أبي نضرة عن أبي سعيد أنه قال في هذه الآية \"ومن يولهم يومئذ دبره\" إنما أنزلت في أهل بدر وهذا كله لا ينفي أن يكون الفرار من الزحف حراما على غير أهل بدر وإن كان سبب نزول الآية فيهم كما دل عليه حديث أبي هريرة المتقدم من أن الفرار من الزحف من الموبقات كما هو مذهب الجماهير والله أعلم."
    },
    {
      "ayah": 17,
      "surah": 8,
      "text": "يبين تعالى أنه خالق أفعال العباد وأنه المحمود على جميع ما صدر منهم من خير لأنه هو الذي وفقهم لذلك وأعانهم ولهذا قال \"فلم تقتلوهم ولكن الله قتلهم\" أي ليس بحولكم وقوتكم قتلتم أعداءكم مع كثرة عددهم وقلة عددكم أي بل هو الذي أظفركم عليهم كما قال \"ولقد نصركم الله ببدر وأنتم أذلة\" الآية وقال تعالى \"لقد نصركم الله في مواطن كثيرة ويوم حنين إذ أعجبتكم كثرتكم فلم تغن عنكم شيئا وضاقت عليكم الأرض بما رحبت ثم وليتم مدبرين\" يعلم تبارك وتعالى أن النصر ليس على كثرة العدد ولا بلبس اللأمة والعدد وإنما النصر من عنده تعالى كما قال تعالى \"كم من فئة قليلة غلبت فئة كثيرة بإذن الله والله مع الصابرين\" ثم قال تعالى لنبيه صلى الله عليه وسلم أيضا في شأن القبضة من التراب التي حصب بها وجوه الكافرين يوم بدر حين خرج من العريش بعد دعائه وتضرعه واستكانته فرماهم بها وقال \"شاهت الوجوه\" ثم أمر أصحابه أن يصدقوا الحملة إثرها ففعلوا فأوصل الله تلك الحصباء إلى أعين المشركين فلم يبق أحد منهم إلا ناله منها ما شغله عن حاله ولهذا قال تعالى \"وما رميت إذ رميت ولكن الله رمى\" أي هو الذي بلغ ذلك إليهم وكبتهم بها لا أنت. قال علي بن أبي طلحة عن ابن عباس رفع رسول الله صلى الله عليه وسلم يديه يعني يوم بدر فقال \"يا رب إن تهلك هذه العصابة فلن تعبد في الأرض أبدأ\" فقال له جبريل خذ قبضة من التراب فارم بها في وجوههم فأخذ قبضة من التراب فرمى بها في وجوههم فما من المشركين أحد إلا أصاب عينيه ومنخريه وفمه تراب من تلك القبضة فولوا مدبرين وقال السدي قال رسول الله صلى الله عليه وسلم لعلي رضي الله عنه يوم بدر \"أعطني حصبا من الأرض\" فناوله حصبا عليه تراب فرمى به في وجوه القوم فلم يبق مشرك إلا دخل في عينيه من ذلك التراب شيء ثم ردفهم المؤمنون يقتلونهم ويأسرونهم وأنزل الله \"فلم تقتلوهم ولكن الله قتلهم وما رميت إذ رميت ولكن الله رمى\" وقال أبو معشر المدني عن محمد بن قيس ومحمد بن كعب القرظي قالا: لما دنا القوم بعضهم من بعض أخذ رسول الله صلى الله عليه وسلم قبضة من تراب فرمى بها في وجوه القوم وقال \"شاهت الوجوه\" فدخلت في أعينهم كلهم وأقبل أصحاب رسول الله صلى الله عليه وسلم يقتلونهم ويأسرونهم وكانت هزيمتهم في رمية رسول الله صلى الله عليه وسلم فأنزل الله \"وما رميت إذ رميت ولكن الله رمى\" وقال عبدالرحمن بن زيد بن أسلم \"وما رميت إذ رميت ولكن الله رمى\" قال هذا يوم بدر أخذ رسول الله صلى الله عليه وسلم ثلاث حصبات فرمى بحصبات ميمنة القوم وحصبات في ميسرة القوم وحصبات بين أظهرهم وقال \"شاهت الوجوه\" فانهزموا وقد روى في هذه القصة عن عروة عن مجاهد وعكرمة وقتادة وغير واحد من الأئمة أنها نزلت في رمية النبي صلى الله عليه وسلم يوم بدر وإن كان قد فعل ذلك يوم حنين أيضا وقال أبو جعفر بن جرير: حدثنا أحمد بن منصور حدثنا يعقوب بن محمد حدثنا عبدالعزيز بن عمران حدثنا موسى بن يعقوب بن عبدالله بن ربيعة عن يزيد بن عبدالله عن أبي بكر بن سليمان بن أبي خيثمة عن حكيم بن حزام قال: لما كان يوم بدر سمعنا صوتا وقع من السماء كأنه صوت حصاة وقعت في طست ورمى رسول الله صلى الله عليه وسلم تلك الرمية فانهزمنا. غريب من هذا الوجه وههنا قولان آخران غريبان جدا. \"أحدهما\" قال ابن جرير حدثنا محمد بن عوف الطائي حدثنا أبو المغيرة حدثنا صفوان بن عمرو حدثنا عبدالرحمن بن جبير أن رسول الله صلى الله عليه وسلم يوم ابن أبي الحقيق بخيبر دعا بقوس فأتي بقوس طويلة وقال \"جيئوني بقوس غيرها\" فجاءوه بقوس كبداء فرمى النبي صلى الله عليه وسلم الحصن فأقبل السهم يهوي حتى قتل ابن أبي الحقيق وهو في فراشه فأنزل الله عز وجل \"وما رميت إذ رميت ولكن الله رمى\" وهذا غريب وإسناده جيد إلى عبدالرحمن بن جبير بن نفير ولعله اشتبه عليه أو أنه أراد أن الآية تعم هذا كله وإلا فسياق الآية في سورة الأنفال في قصة بدر لا محالة وهذا مما لا يخفى على أئمة العلم والله أعلم. \"والثاني\" روى ابن جرير أيضا والحاكم في مستدركه بإسناد صحيح إلى سعيد بن المسيب والزهري أنهما قالا: أنزلت في رمية النبي صلى الله عليه وسلم يوم أحد أبي بن خلف بالحربة وهو في لأمته فخدشه في ترقوته فجعل يتدأدأ عن فرسه مرارا حتى كانت وفاته بعد أيام قاسى فيها العذاب الأليم موصولا بعذاب البرزخ المتصل بعذاب الآخرة وهذا القول عن هذين الإمامين غريب أيضا جدا ولعلهما أرادا أن الآية تتناوله بعمومها لا أنها نزلت فيه خاصة كما تقدم والله أعلم. وقال محمد بن إسحق حدثني محمد بن جعفر بن الزبير عن عروة بن الزبير في قوله \"وليبلي المؤمنين منه بلاء حسنا\" أي ليعرف المؤمنين نعمته عليهم من إظهارهم على عدوهم مع كثرة عدوهم وقلة عددهم ليعرفوا بذلك حقه ويشكروا بذلك نعمته وهكذا فسره ابن جرير أيضا وفي الحديث \"وكل بلاء حسن أبلانا\" وقوله \"إن الله سميع عليم\" أي سميع الدعاء عليم بمن يستحق النصر والغلب."
    },
    {
      "ayah": 18,
      "surah": 8,
      "text": "وقوله \"ذلكم وأن الله موهن كيد الكافرين\" هذه بشارة أخرى مع ما حصل من النصر أنه أعلمهم تعالى بأنه مضعف كيد الكافرين فيما يستقبل مصغر أمرهم وأنهم كل ما لهم في تبار ودمار ولله الحمد والمنة."
    },
    {
      "ayah": 19,
      "surah": 8,
      "text": "يقول تعالى للكفار \"إن تستفتحوا\" أي تستنصروا وتستقضوا الله وتستحكموه أن يفصل بينكم وبين أعدائكم المؤمنين فقد جاءكم ما سألتم كما قال محمد بن إسحق وغيره عن الزهري عن عبدالله بن ثعلبة بن صعير أن أبا جهل قال يوم بدر: اللهم أينا كان أقطع للرحم وآتانا بما لا يعرف فأحنه الغداة. وكان استفتاحا منه فنزلت \"إن تستفتحوا فقد جاءكم الفتح\" إلى آخر الآية. وقال الإمام أحمد حدثنا يزيد يعني ابن هارون أخبرنا محمد بن إسحق حدثني الزهري عن عبدالله بن ثعلبة أن أبا جهل قال حين التقى القوم اللهم أقطعنا للرحم وآتانا بما لا نعرفه فأحنه الغداة. فكان المستفتح وأخرجه النسائي في التفسير من حديث صالح بن كيسان عن الزهري به وكذا رواه الحاكم في مستدركه من طريق الزهري به وقال صحيح على شرط الشيخين ولم يخرجاه وروى نحو هذا عن ابن عباس ومجاهد والضحاك وقتادة ويزيد بن رومان وغير واحد وقال السدي كان المشركون حين خرجوا من مكة إلى بدر أخذوا بأستار الكعبة فاستنصروا الله وقالوا اللهم انصر أعلى الجندين وأكرم الفئتين وخير القبيلتين فقال الله \"إن تستفتحوا فقد جاءكم الفتح\" يقول قد نصرت ما قلتم وهو محمد صلى الله عليه وسلم وقال عبدالرحمن بن زيد بن أسلم هو قوله تعالى إخبارا عنهم \"وإذ قالوا اللهم إن كان هذا هو الحق من عندك\" الآية وقوله \"وإن تنتهوا\" أي عما أنتم فيه من الكفر بالله والتكذيب لرسوله \"فهو خير لكم\" أي في الدنيا والآخرة وقوله تعالى \"وإن تعودوا نعد\" كقوله \"وإن عدتم عدنا\" معناه وإن عدتم إلى ما كنتم فيه من الكفر والضلالة نعد لكم بمثل هذه الواقعة. وقال السدي \"وإن تعودوا\" أي إلى الاستفتاح \"نعد\" أي إلى الفتح لمحمد صلى الله عليه وسلم والنصر له وتظفيره على أعدائه والأول أقوى \"ولن تغني عنكم فئتكم شيئا ولو كثرت\" أي ولو جمعتم من الجموع ما عسى أن تجمعوا فإن من كان الله معه فلا غالب له \"إن الله مع المؤمنين\" وهم الحزب النبوي والجناب المصطفوي."
    },
    {
      "ayah": 2,
      "surah": 8,
      "text": "قال علي بن أبي طلحة عن ابن عباس في قوله \"إنما المؤمنون الذين إذا ذكر الله وجلت قلوبهم \" قال: المنافقون لا يدخل قلوبهم شيء من ذكر الله عند أداء فرائضه ولا يؤمنون بشيء من آيات الله ولا يتوكلون ولا يصلون إذا غابوا ولا يؤدون زكاة أموالهم فأخبر الله تعالى أنهم ليسوا بمؤمنين ثم وصف الله المؤمنين فقال \"إنما المؤمنون الذين إذا ذكر الله وجلت قلوبهم\" فأدوا فرائضه \"وإذا تليت عليهم آياته زادتهم إيمانا\" يقول زادتهم تصديقا \"وعلى ربهم يتوكلون\" يقول لا يرجون غيره وقال مجاهد \"وجلت قلوبهم\" فرقت أي فزعت وخافت وكذا قال السدي وغير واحد وهذه صفة المؤمن حق المؤمن الذي إذا ذكر الله وجل قلبه أي خاف منه ففعل أوامره وترك زواجره كقوله تعالى \"والذين إذا فعلوا فاحشة أو ظلموا أنفسهم ذكروا الله فاستغفروا لذنوبهم ومن يغفر الذنوب إلا الله ولم يصروا على ما فعلوا وهم يعلمون\" وكقوله تعالى \"وأما من خاف مقام ربه ونهى النفس عن الهوى فإن الجنة هي المأوى\" ولهذا قال سفيان الثوري: سمعت السدي يقول في قوله تعالى \"إنما المؤمنون الذين إذا ذكر الله وجلت قلوبهم\" قال:هو الرجل يريد أن يظلم أو قال يهم بمعصية فيقال له اتق الله فيجل قلبه وقال الثوري أيضا عن عبدالله بن عثمان بن خثيم عن شهر بن حوشب عن أم الدرداء في قوله \"إنما المؤمنون الذين إذا ذكر الله وجلت قلوبهم\" قال الوجل في القلب كاحتراق السعفة أما تجد له قشعريرة؟ قال: بلى قالت:إذا وجدت ذلك فادع الله عند ذلك فإن الدعاء يذهب ذلك وقوله \"وإذا تليت عليهم آياته زادتهم إيمانا\" كقوله \"وإذا ما أنزلت سورة فمنهم من يقول أيكم زادته هذه إيمانا فأما الذين آمنوا فزادتهم إيمانا وهم يستبشرون\" وقد استدل البخاري وغيره من الأئمة بهذه الآية وأشباهها على زيادة الإيمان وتفاضله في القلوب كما هو مذهب جمهور الأمة بل قد حكى الإجماع عليه غير واحد من الأئمة كالشافعي وأحمد بن حنبل وأبي عبيد كما بينا ذلك مستقصى في أول شرح البخاري ولله الحمد والمنة \"وعلى ربهم يتوكلون\" أي لا يرجون سواه ولا يقصدون إلا إياه ولا يلوذون إلا بجنابه ولا يطلبون الحوائج إلا منه ولا يرغبون إلا إليه ويعلمون أنه ما شاء كان وما لم يشأ لم يكن وأنه المتصرف في الملك وحده لا شريك له ولا معقب لحكمه وهو سريع الحساب ولهذا قال سعيد بن جبير التوكل عل الله جماع الإيمان."
    },
    {
      "ayah": 20,
      "surah": 8,
      "text": "يأمر تعالى عباده المؤمنين بطاعته وطاعة رسوله ويزجرهم عن مخالفته والتشبه بالكافرين به المعاندين له ولهذا قال \"ولا تولوا عنه\" أي تتركوا طاعته وامتثال أوامره وترك زواجره \"وأنتم تسمعون\" أي بعد ما علمتم ما دعاكم إليه."
    },
    {
      "ayah": 21,
      "surah": 8,
      "text": "\"قيل المراد المشركون وأختاره ابن جرير وقال ابن إسحق هم المنافقون فإنهم يظهرون أنهم قد سمعوا واستجابوا وليسوا كذلك."
    },
    {
      "ayah": 22,
      "surah": 8,
      "text": "ثم أخبر تعالى أن هذا الضرب من بني آدم شر الخلق والخليقة فقال:\"إن شر الدواب عند الله الصم\" أي عن سماع الحق \"البكم\" عن فهمه ولهذا قال \"الذين لا يعقلون\" فهؤلاء شر البرية لأن كل دابة مما سواهم مطيعة لله فيما خلقها له وهؤلاء خلقوا للعبادة فكفروا ولهذا شبههم بالأنعام في قوله \"ومثل الذين كفروا كمثل الذي ينعق بما لا يسمع إلا دعاء ونداء\" الآية وقال في الآية الأخرى \"أولئك كالأنعام بل هم أضل أولئك هم الغافلون\" وقيل المراد بهؤلاء المذكورين نفر من بني عبدالدار من قريش. روي عن ابن عباس ومجاهد واختاره ابن جرير. وقال محمد بن إسحق هم `المنافقون. قلت ولا منافاة بين المشركين والمنافقين في هذا لأن كلا منهم مسلوب الفهم الصحيح والقصد إلى العمل الصالح."
    },
    {
      "ayah": 23,
      "surah": 8,
      "text": "ثم أخبر تعالى بأنهم لا فهم لهم صحيح ولا قصد لهم صحيح لو فرض أن لهم فهما فقال \"ولو علم الله فيهم خيرا لأسمعهم\" أي لأفهمهم وتقدير الكلام \"و\" لكن لا خير فيهم فلم يُفْهِمْهُمْ لأنه يعلم أنه \"لو أسمعهم\" أي أفهمهم \"لتولوا\" عن ذلك قصدا وعنادا بعد فهمهم ذلك \"وهم معرضون\" عنه."
    },
    {
      "ayah": 24,
      "surah": 8,
      "text": "قال البخاري \"استجيبوا\" أجيبوا \"لما يحييكم\" لما يصلحكم. حدثني إسحق حدثنا روح حدثنا شعبة. عن خبيب بن عبدالرحمن قال: سمعت حفص بن عاصم يحدث عن أبي سعد بن المعلى رضي الله عنه قال كنت أصلي فمر بي النبي صلى الله عليه وسلم فدعاني فلم آته حتى صليت ثم أتيته فقال \"ما منعك أن تأتيني؟ ألم يقل الله \"يا أيها الذين آمنوا استجيبوا لله وللرسول إذا دعاكم لما يحييكم\" - ثم قال - لأعلمنك أعظم سورة في القرآن قبل أن أخرج\" فذهب رسول الله صلى الله عليه وسلم ليخرج فذكرت له. وقال معاذ: حدثنا شعبة عن خبيب بن عبدالرحمن سمع حفص بن عاصم سمع أبا سعيد رجلا من أصحاب النبي صلى الله عليه وسلم بهذا وقال \"الحمد لله رب العالمين\" هي السبع المثاني. هذا لفظه بحروفه وقد تقدم الكلام على هذا الحديث بذكر طرقه في أول تفسير الفاتحة. وقال مجاهد في قوله \"لما يحييكم\" قال للحق وقال قتادة \"لما يحييكم\" قال هو هذا القرآن فيه النجاة والبقاء والحياة وقال السدي \"لما يحييكم\" ففي الإسلام إحياؤهم بعد موتهم بالكفر وقال محمد بن إسحق عن محمد بن جعفر بن الزبير عن عروة بن الزبير \"يا أيها الذين آمنوا استجيبوا لله وللرسول إذا دعاكم لما يحييكم\" أي للحرب التي أعزكم الله تعالى بها بعد الذل وقواكم بها بعد الضعف ومنعكم من عدوكم بعد القهر منهم لكم وقوله تعالى \"واعلموا أن الله يحول بين المرء وقلبه\" قال ابن عباس يحول بين المؤمن وبين الكفر وبين الكافر وبين الإيمان رواه الحاكم في مستدركه موقوفا وقال صحيح ولم يخرجاه ورواه ابن مردويه من وجه آخر مرفوعا ولا يصح لضعف إسناده والموقوف أصح وكذا قال مجاهد وسعيد وعكرمة والضحاك وأبو صالح وعطية ومقاتل بن حيان والسدي وفي رواية عن مجاهد في قوله \"يحول بين المرء وقلبه\" أي حتى يتركه لا يعقل وقال السدي يحول بين الإنسان وقلبه فلا يستطيع أن يؤمن ولا يكفر إلا بإذنه. وقال قتادة هو كقوله \"ونحن أقرب إليه من حبل الوريد\". وقد وردت الأحاديث عن رسول الله صلى الله عليه وسلم بما يناسب هذه الآية وقال الإمام أحمد حدثنا أبو معاوية عن الأعمش عن أبي سفيان عن أنس بن مالك رضي الله عنه قال كان النبي صلى الله عليه وسلم يكثر أن يقول \"يا مقلب القلوب ثبت قلبي على دينك\" قال فقلنا يا رسول الله آمنا بك وبما جئت به فهل تخاف علينا؟ قال \"نعم إن القلوب بين أصبعين من أصابع الله تعالى يقلبها\". وهكذا رواه الترمذي في كتاب القدر من جامعه عن هناد بن السري عن أبي معاوية محمد بن حازم الضرير عن الأعمش واسمه سليمان بن مهران عن أبي سفيان واسمه طلحة بن نافع عن أنس ثم قال حسن. وهكذا روى عن غير واحد عن الأعمش ورواه بعضهم عنه عن أبي سفيان عن جابر عن النبي صلى الله عليه وسلم وحديث أبي سفيان عن أنس أصح. \"حديث آخر\" وقال الإمام أحمد في مسنده حدثنا عبد بن حميد حدثنا عبدالملك بن عمرو حدثنا شعبة عن الحكم عن ابن أبي ليلى عن بلال رضي الله عنه أن النبي صلى الله عليه وسلم كان يدعو \"يا مقلب القلوب ثبت قلبي على دينك\" هذا حديث جيد الإسناد إلا أن فيه انقطاعا وهو مع ذلك على شرط أهل السنن ولم يخرجوه. \"حديث آخر\" قال الإمام أحمد حدثنا الوليد بن مسلم قال: سمعت ابن جابر يقول: حدثني بشر بن عبيد الله الحضرمي أنه سمع أبا إدريس الخولاني يقول سمعت النواس بن سمعان الكلابي رضي الله عنه يقول سمعت النبي صلى الله عليه وسلم يقول \"ما من قلب إلا وهو بين أصبعين من أصابع الرحمن رب العالمين إذا شاء أن يقيمه أقامه وإذا شاء أن يزيغه أزاغه\" وكان يقول \"يا مقلب القلوب ثبت قلبي على دينك\" قال \"والميزان بيد الرحمن يخفضه ويرفعه\". وهكذا رواه النسائي وابن ماجه من حديث عبدالرحمن بن يزيد بن جابر فذكر مثله. \"حديث آخر\" قال الإمام أحمد حدثنا يونس حدثنا حماد ابن زيد عن المعلى بن زياد عن الحسن أن عائشة قالت: دعوات كان رسول الله صلى الله عليه وسلم يدعو بها \"يا مقلب القلوب ثبت قلبي على دينك\" قالت فقلت يا رسول الله إنك تكثر أن تدعو بهذا الدعاء فقال \"إن قلب الآدمي بين أصبعين من أصابع الله فإذا شاء أزاغه وإذا شاء أقامه\". \"حديث آخر\" قال الإمام أحمد حدثنا هاشم حدثنا عبدالحميد حدثني شهر سمعت أم سلمة تحدث أن رسول الله صلى الله عليه وسلم كان يكثر في دعائه أن يقول \"اللهم مقلب القلوب ثبت قلبي على دينك\" قالت: فقلت يا رسول الله أوَ إن القلوب لتقلب؟ قال \"نعم ما خلق الله من بشر من بني آدم إلا أن قلبه بين أصبعين من أصابع الله عز وجل فإن شاء أقامه وإن شاء أزاغه فنسأل الله ربنا أن لا يزيغ قلوبنا بعد إذ هدانا ونسأله أن يهب لنا من لدنه رحمة إنه هو الوهاب\" قالت: فقلت يا رسول الله ألا تعلمني دعوة أدعو بها لنفسي؟ قال \"بلى قولي اللهم رب النبي محمد اغفر لي ذنبي وأذهب غيظ قلبي وأجرني من مضلات الفتن ما أحييتني\". \"حديث آخر\" قال الإمام أحمد حدثنا أبو عبدالرحمن حدثنا حيوة أخبرني أبو هانئ أنه سمع أبا عبدالرحمن الحبلي أنه سمع عبدالله بن عمرو أنه سمع رسول الله صلى الله عليه وسلم يقول \"إن قلوب بني آدم بين أصبعين من أصابع الرحمن كقلب واحد يصرفها كيف شاء\". ثم قال رسول الله صلى الله عليه وسلم \"اللهم مصرف القلوب صرف قلوبنا إلى طاعتك\" انفرد بإخراجه مسلم عن البخاري فرواه مع النسائي من حديث حيوة بن شريح المصري به."
    },
    {
      "ayah": 25,
      "surah": 8,
      "text": "يحذر تعالى عباده المؤمنين فتنة أي اختبارا ومحنة يعم بها المسيء وغيره لا يخص بها أهل المعاصي ولا من باشر الذنب بل يعمها لم تدفع وترفع كما قال الإمام أحمد: حدثنا أبو سعيد مولى بني هاشم حدثنا شداد بن سعيد حدثنا غيلان بن جرير عن مطرف قال: قلنا للزبير يا أبا عبدالله ما جاء بكم! ضيعتم الخليفة الذي قتل ثم جئتم تطلبون دمه؟ فقال الزبير رضي الله عنه: إنا قرأنا على عهد رسول الله صلى الله عليه وسلم وأبي بكر وعمر وعثمان رضي الله عنهم \"واتقوا فتنة لا تصيبن الذين ظلموا منكم خاصة\" لم نكن نحسب أنَّا أهلها حتى وقعت منا حيث وقعت وقد رواه البزار من حديث مطرف عن الزبير وقال: لا نعرف مطرفا روي عن الزبير غير هذا الحديث وقد روى النسائي من حديث جرير بن حازم عن الحسن عن الزبير نحو هذا وقد روى ابن جرير حدثني الحارث حدثنا عبدالعزيز حدثنا مبارك بن فضالة عن الحسن. قال: قال الزبير لقد خوفنا يعني قوله تعالى \"واتقوا فتنة لا تصيبن الذين ظلموا منكم خاصة \"ونحن مع رسول الله صلى الله عليه وسلم وما ظننا أنا خصصنا بها خاصة وكذا رواه حميد عن الحسن عن الزبير رضي الله عنه وقال داود بن أبي هند عن الحسن في هذه الآية قال نزلت في علي وعمار وطلحة والزبير رضي الله عنهم وقال سفيان الثوري عن الصلت بن دينار عن عقبة بن صهبان سمعت الزبير يقول: لقد قرأت هذه الآية زمانا وما أرانا من أهلها فإذا نحن المعنيون بها \"واتقوا فتنة لا تصيبن الذين ظلموا منكم خاصة واعلموا أن الله شديد العقاب\". وقد روي من غير وجه عن الزبير بن العوام وقال السدي: نزلت في أهل بدر خاصة فأصابتهم يوم الجمل فاقتتلوا وقال علي بن أبي طلحة عن ابن عباس في قوله تعالى \"واتقوا فتنة لا تصيبن الذين ظلموا منكم خاصة\" يعني أصحاب النبي صلى الله عليه وسلم خاصة. وقال في رواية له عن ابن عباس في تفسير هذه الآية: أمر الله المؤمنين أن لا يقروا المنكر بين ظهرانيهم فيعمهم الله بالعذاب وهذا تفسير حسن جدا ولهذا قال مجاهد في قوله تعالى \"واتقوا فتنة لا تصيبن الذين ظلموا منكم خاصة\" هي أيضا لكم وكذا قال الضحاك ويزيد بن أبي حبيب وغير واحد وقال ابن مسعود ما منكم من أحد إلا وهو مشتمل على فتنة إن الله تعالى يقول \"إنما أموالكم وأولادكم فتنة\" فأيكم أستعاذ فليستعذ بالله من مضلات الفتن رواه ابن جرير والقول بأن هذا التحذير يعم الصحابة وغيرهم وإن كان الخطاب معهم هو الصحيح ويدل عليه الأحاديث الواردة في التحذير من الفتن ولذلك كتاب مستقل يوضح فيه إن شاء الله تعالى كما فعله الأئمة وأفردوه بالتصنيف ومن أخص ما يذكر ههنا ما رواه الإمام أحمد حيث قال: حدثنا أحمد بن الحجاج أخبرنا عبدالله يعني ابن المبارك أنبأنا سيف بن أبي سليمان سمعت عدي بن عدي الكندي يقول: حدثني مولى لنا أنه سمع جدي يعني عدي بن عميرة يقول: سمعت رسول الله صلى الله عليه وسلم يقول \"إن الله عز وجل لا يعذب العامة بعمل الخاصة حتى يروا المنكر بين ظهرانيهم وهم قادرون على أن ينكروه فلا ينكروه فإذا فعلوا ذلك عذب الله الخاصة والعامة\" فيه رجل متهم ولم يخرجوه في الكتب الستة ولا واحد منهم والله أعلم. \"حديث أخر\" قال الإمام أحمد حدثنا سليمان الهاشمي حدثنا إسماعيل يعني ابن جعفر أخبرني عمرو بن أبي عمر عن عبدالله بن عبدالرحمن الأشهل عن حذيفة بن اليمان أن رسول الله صلى الله عليه وسلم قال \"والذي نفسي بيده لتأمرن بالمعروف ولتنهن عن المنكر أو ليوشكن الله أن يبعث عليكم عقابا من عنده ثم لتدعنه فلا يستجيب لكم\". ورواه عن أبي سعيد عن إسماعيل بن جعفر وقال \"أو ليبعثن الله عليكم قوما ثم تدعونه فلا يستجيب لكم\". وقال الإمام أحمد: حدثنا عبدالله بن نمير قال حدثنا زر بن حبيب الجهني حدثني أبو الرقاد قال: خرجت مع مولاي فدفعت إلى حذيفة وهو يقول: إن كان الرجل ليتكلم بالكلمة على عهد رسول الله صلى الله عليه وسلم فيصير منافقا وإني لأسمعها من أحدكم في المقعد الواحد أربع مرات لتأمرن بالمعروف ولتنهن عن المنكر ولتحاضن على الخير أو ليسحتكم الله جميعا بعذاب أو ليؤمرن عليكم شراركم ثم يدعو خياركم فلا يستجاب لهم. \"حديث آخر\" قال الإمام أحمد أيضا: حدثنا يحيى بن سعيد عن زكريا حدثنا عامر رضي الله عنه قال: سمعت النعمان بن بشير رضي الله عنه يخطب يقول - وأومأ بأصبعيه إلى أذنه يقول: مثل القائم على حدود الله والواقع فيها والمداهن فيها كمثل قوم ركبوا سفينة فأصاب بعضهم أسفلها وأوعرها وشرها وأصاب بعضهم أعلاها فكان الذين في أسفلها إذا استقوا الماء مروا على من فوقهم فآذوهم فقالوا لو خرقنا في نصيبنا خرقا فاستقينا منه ولم نؤذ من فوقنا فإن تركوهم وأمرهم هلكوا جميعا وإن أخذوا على أيديهم نجوا جميعا. انفرد بإخراجه البخاري دون مسلم فرواه في الشركة والشهادات والترمذي في الفتن من غير وجه عن سليمان بن مهران الأعمش عن عامر بن شراحيل الشعبي به. \"حديث آخر\" قال الإمام أحمد حدثنا حسين حدثنا خلف بن خليفة عن ليث عن علقمة بن مرثد عن المعرور بن سويد عن أم سلمة زوح النبي صلى الله عليه وسلم قالت سمعت رسول الله صلى الله عليه وسلم يقول \"إذا ظهرت المعاصي في أمتي عمهم الله بعذاب من عنده\" فقلت يا رسول الله أما فيهم أناس صالحون؟ قال \"بلى\" قالت فكيف يصنع أولئك؟ قال \"يصيبهم ما أصاب الناس ثم يصيرون إلى مغفرة من الله ورضوان\". \"حديث آخر\" قال الإمام أحمد حدثنا حجاج بن محمد حدثنا شريك عن أبي إسحق عن المنذر بن جرير عن أبيه قال: قال رسول الله صلى الله عليه وسلم \"ما من قوم يعملون بالمعاصي وفيهم رجل أعز منهم وأمنع لا يغيره إلا عمهم الله بعقاب أو أصابهم العقاب\". ورواه أبو داود عن مسدد عن أبي الأحوص عن أبي إسحق به. وقال الإمام أحمد أيضا حدثنا محمد بن جعفر حدثنا شعبة سمعت أبا إسحق يحدث عن عبيد الله بن جرير عن أبيه أن رسول الله صلى الله عليه وسلم قال \"ما من قوم يعمل فيهم بالمعاصي هم أعز وأكثر ممن يعملون ثم لم يغيروه إلا عمهم الله بعقاب\". ثم رواه أيضا عن وكيع عن إسرائيل وعن عبدالرزاق عن معمر وعن أسود عن شريك ويونس كلهم عن أبي إسحق السبيعي به وأخرجه ابن ماجه عن علي بن محمد عن وكيع به وقال الإمام أحمد حدثنا سفيان حدثنا جامع بن أبي راشد عن منذر عن الحسن بن محمد عن امرأته عن عائشة تبلغ به النبي صلى الله عليه وسلم \"إذا ظهر السوء في الأرض أنزل الله بأهل الأرض بأسه\" فقلت وفيهم أهل طاعة الله؟ قال \"نعم ثم يصيرون إلى رحمة الله\"."
    },
    {
      "ayah": 26,
      "surah": 8,
      "text": "ينبه تعالى عباده المؤمنين على نعمه عليهم وإحسانه إليهم حيث كانوا قليلين فكثرهم ومستضعفين خائفين فقواهم ونصرهم وفقراء عالة فرزقهم من الطيبات واستشكرهم فأطاعوه وامتثلوا جميع ما أمرهم. وهذا كان حال المؤمنين حال مقامهم بمكة قليلين مستخفين مضطهدين يخافون أن يتخطفهم الناس من سائر بلاد الله من مشرك ومجوسي ورومي كلهم أعداء لهم لقلتهم وعدم قوتهم فلم يزل ذلك دأبهم حتى أذن الله لهم في الهجرة إلى المدينة فآواهم إليها وقيض لهم أهلها آووا ونصروا يوم بدر وغيره وواسوا بأموالهم وبذلوا مهجهم في طاعة الله وطاعة رسوله صلى الله عليه وسلم قال قتادة بن دعامة السدوسي رحمه الله في قوله تعالى \"واذكروا إذ أنتم قليل مستضعفون في الأرض\" قال كان هذا الحي من العرب أذل الناس ذلا وأشقاه عيشا وأوجه بطونا وأعراه جلودا وأبينه ضلالا من عاش منهم عاش شقيا ومن مات منهم ردى في النار يؤكلون ولا يأكلون والله ما نعلم قبيلا من حاضر أهل الأرض يومئذ كانوا أشر منزلا منهم حتى جاء الله بالإسلام فمكن به في البلاد ووسع به في الرزق وجعلهم به ملوكا على رقاب الناس وبالإسلام أعطى الله ما رأيتم فاشكروا الله على نعمه فإن ربكم منعم يحب الشكر وأهل الشكر في مزيد من الله."
    },
    {
      "ayah": 27,
      "surah": 8,
      "text": "قال عبدالرزاق بن أبي قتادة والزهري أنزلت في أبي لبابة بن عبدالمنذر حين بعثه رسول الله صلى الله عليه وسلم إلى بني قريظة لينزلوا على حكم رسول الله صلى الله عليه وسلم فاستشاروه في ذلك فأشار عليهم بذلك وأشار بيده إلى حلقه أي إنه الذبح ثم فطن أبو لبابة ورأى أنه قد خان الله ورسوله فحلف لا يذوق ذواقا حتى يموت أو يتوب الله عليه وانطلق إلى مسجد المدينة فربط نفسه في سارية منه فمكث كذلك تسعة أيام حتى كان يخر مغشيا عليه من الجهد حتى أنزل الله توبته على رسوله فجاء الناس يبشرونه بتوبة الله عليه وأرادوا أن يحلوه من السارية فحلف لا يحله منها إلا رسول الله صلى الله عليه وسلم بيده فحله فقال يا رسول الله: إني كنت نذرت أن أنخلع من مالي صدقة فقال \"يجزيك الثلث أن تصدق به\". وقال ابن جرير حدثني الحارث حدثنا عبدالعزيز حدثنا يونس بن الحارث الطائفي حدثنا محمد بن عبدالله بن عون الثقفي عن المغيرة بن شعبة قال نزلت هذه الآية في قتل عثمان رضي الله عنه \"يا أيها الذين آمنوا لا تخونوا الله والرسول\" الآية. وقال ابن جرير أيضا حدثنا القاسم بن بشر بن معروف حدثنا شبابة بن سوار حدثنا محمد بن المحرم قال لقيت عطاء بن أبي رباح فحدثني قال حدثني جابر بن عبدالله أن أبا سفيان خرج من مكة فأتى جبريل رسول الله صلى الله عليه وسلم فقال إن أبا سفيان بمكان كذا وكذا فقال رسول الله صلى الله عليه وسلم \"إن أبا سفيان في موضع كذا وكذا فاخرجوا إليه واكتموا\" فكتب رجل من المنافقين إليه إن محمدا يريدكم فخذوا حذركم فأنزل الله عز وجل \"لا تخونوا الله والرسول وتخونوا أماناتكم\" الآية هذا حديث غريب جدا وفي سنده وسياقه نظر. وفي الصحيحين قصة حاطب بن أبي بلتعة أنه كتب إلى قريش يعلمهم بقصد رسول الله صلى الله عليه وسلم إياهم عام الفتح فأطلع الله رسوله على ذلك فبعث في أثر الكتاب فاسترجعه واستحضر حاطبا فأقر بما صنع وفيها فقام عمر بن الخطاب فقال يا رسول الله: ألا أضرب عنقه فإنه قد خان الله ورسوله والمؤمنين؟ فقال \"دعه فإنه قد شهد بدرا وما يدريك لعل الله اطلع على أهل بدر فقال اعملوا ما شئتم فقد غفرت لكم\" قلت والصحيح أن الآية عامة وإن صح أنها وردت على سبب خاص فالأخذ بعموم اللفظ لا بخصوص السبب عند الجماهير من العلماء. والخيانة تعم الذنوب الصغار والكبار اللازمة والمتعدية. وقال علي بن أبي طلحة عن ابن عباس \"وتخونوا أماناتكم\" الأمانة الأعمال التي ائتمن الله عليها العباد يعني الفريضة يقول \"لا تخونوا\" لا تنقضوها وقال في رواية \"لا تخونوا الله والرسول\" يقول بترك سنته وارتكاب معصيته. وقال محمد بن إسحق حدثني محمد بن جعفر بن الزبير عن عروة بن الزبير في هذه الآية أي لا تظهروا له من الحق ما يرضى به منكم ثم تخالفوه في السر إلى غيره فإن ذلك هلاك لأماناتكم وخيانة لأنفسكم. وقال السدي: إذا خانوا الله والرسول فقد خانوا أماناتهم. وقال أيضا كانوا يسمعون من النبي صلى الله عليه وسلم الحديث فيفشونه حتى يبلغ المشركين وقال عبدالرحمن بن زيد نهاكم أن تخونوا الله والرسول كما صنع المنافقون."
    },
    {
      "ayah": 28,
      "surah": 8,
      "text": "وقوله \"واعلموا أنما أموالكم وأولادكم فتنة\" أي اختبار وامتحان منه لكم إذ أعطاكموها ليعلم أتشكرونه عليها وتطيعونه فيها أو تشتغلون بها عنه وتعتاضون بها منه كما قال تعالى \"إنما أموالكم وأولادكم فتنة والله عنده أجر عظيم\" وقال \"ونبلوكم بالشر والخير فتنة\" وقال تعالى \"يا أيها الذين آمنوا لا تلهكم أموالكم ولا أولادكم عن ذكر الله ومن يفعل ذلك فأولئك هم الخاسرون\" وقال تعالى \"يا أيها الذين آمنوا إن من أزواجكم وأولادكم عدوا لكم فاحذروهم\" الآية وقوله \"وأن الله عنده أجر عظيم\" أي ثوابه وعطاؤه وجناته خير لكم من الأموال والأولاد فإنه قد يوجد منهم عدو وأكثرهم لا يغني عنك شيئا والله سبحانه هو المتصرف المالك للدنيا والآخرة ولديه الثواب الجزيل يوم القيامة. وفي الأثر يقول الله تعالى \"يا ابن آدم اطلبني تجدني فإن وجدتني وجدت كل شيء وإن فتك فاتك كل شيء وأنا أحب إليك من كل شيء\" وفي الصحيح عن رسول الله صلى الله عليه وسلم أنه قال \"ثلاث من كن فيه وجد حلاوة الإيمان: من كان الله ورسوله أحب إليه مما سواهما ومن كان يحب المرء لا يحبه إلا لله ومن كان أن يلقى في النار أحب إليه من أن يرجع إلى الكفر بعد إذ أنقذه الله منه\". بل حب رسول الله صلى الله عليه وسلم مقدم على الأولاد والأموال والنفوس كما ثبت في الصحيح أنه صلى الله عليه وسلم قال \"والذي نفسي بيده لا يؤمن أحدكم حتى أكون أحب إليه من نفسه وأهله وماله والناس أجمعين\"."
    },
    {
      "ayah": 29,
      "surah": 8,
      "text": "قال ابن عباس والسدي ومجاهد وعكرمة والضحاك وقتادة ومقاتل بن حيان وغير واحد \"فرقانا\" مخرجا زاد مجاهد في الدنيا والآخرة وفي رواية عن ابن عباس \"فرقانا\" نجاة وفي رواية عنه نصرا وقال محمد بن إسحق \"فرقانا\" أي فصلا بين الحق والباطل وهذا التفسير من ابن إسحق أعم مما تقدم وهو يستلزم ذلك كله فإن من اتقى الله بفعل أوامره وترك زواجره وفق لمعرفة الحق من الباطل فكان ذلك سبب نصره ونجاته ومخرجه من أمور الدنيا وسعادته يوم القيامة وتكفير ذنوبه وهو محوها وغفرها سترها عن الناس وسببا لنيل ثواب الله الجزيل كقوله تعالى \"يا أيها الذين آمنوا اتقوا الله وآمنوا برسوله يؤتكم كفلين من رحمته ويجعل لكم نورا تمشون به ويغفر لكم والله غفور رحيم\"."
    },
    {
      "ayah": 3,
      "surah": 8,
      "text": "وقوله \"الذين يقيمون الصلاة ومما رزقناهم ينفقون\" ينبه تعالى بذلك على أعمالهم بعد ما ذكر اعتقادهم وهذه الأعمال تشمل أنواع الخير كلها وهو إقامة الصلاة وهو حق الله تعالى وقال قتادة: إقامة الصلاة المحافظة على مواقيتها ووضوئها وركوعها وسجودها وقال مقاتل بن حيان:إقامتها المحافظة على مواقيتها وإسباغ الطهور فيها وتمام ركوعها وسجودها وتلاوة القرآن فيها والتشهد والصلاة على النبي صلى الله عليه وسلم هذا إقامتها والإنفاق مما رزقهم الله يشمل إخراج الزكاة وسائر الحقوق للعبادة من واجب ومستحب. والخلق كلهم عيال الله فأحبهم إلى الله أنفعهم لخلقه. قال قتادة في قوله \"ومما رزقناهم ينفقون\" فأنفقوا مما رزقكم الله فإنما هذه الأموال عوارى وودائع عندك يا ابن آدم أوشكت أن تفارقها."
    },
    {
      "ayah": 30,
      "surah": 8,
      "text": "قال ابن عباس ومجاهد وقتادة \"ليثبتوك\" ليقيدوك وقال عطاء وابن زيد: ليحبسوك وقال السدي الإثبات هو الحبس والوثاق وهذا يشمل ما قاله هؤلاء وهؤلاء وهو مجمع الأقوال وهو الغالب من صنيع من أراد غيره بسوء وقال سنيد عن حجاج عن ابن جريج قال عطاء سمعت عبيد بن عمير يقول: لما ائتمروا بالنبي صلى الله عليه وسلم ليثبتوه أو يقتلوه أو يخرجوه قال له عمه أبو طالب:هل تدري ما ائتمروا بك؟ قال: \"يريدون أن يسجنوني أو يقتلوني أو يخرجوني\". فقال: من أخبرك بهذا؟ قال: \"ربي\" قال: نِعْم الرب ربك استوص به خيرا قال \"أنا أستوصي به؟ بل هو يستوصي بي\" وقال أبو جعفر ابن جرير حدثني محمد بن إسماعيل المصري المعروف بالوساوسي أخبرنا عبدالحميد بن أبي داود عن ابن جريج عن عطاء عن عبيد بن عمير عن المطلب بن أبي وداعة أن أبا طالب قال لرسول الله صلى الله عليه وسلم ما يأتمر بك قومك؟ قال \"يريدون أن يسجنوني أو يقتلوني أو يخرجرني\" فقال من أخبرك بهذا؟ قال \"ربي\" قال نعم الرب ربك فاستوص به خيرا قال \"أنا أستوصي به؟ بل هو يستوصي بي\" قال فنزلت \"وإذ يمكر بك الذين كفروا ليثبتوك أو يقتلوك أو يخرجوك\" الآية. وذكر أبي طالب في هذا غريب جدا بل منكر لأن هذه الآية مدنية ثم إن هذه القصة واجتماع قريش على هذا الإئتمار والمشاورة على الإثبات أو النفي أو القتل إنما كان ليلة الهجرة وكان ذلك بعد موت أبي طالب بنحو من ثلاث سنين لما تمكنوا منه واجترءوا عليه بسبب موت عمه أبي طالب الذي كان يحوطه وينصره ويقوم باعبائه والدليل على صحة ما قلنا ما روى الإمام محمد بن إسحق بن يسار صاحب المغازي عن عبدالله بن أبي نجيح عن مجاهد عن ابن عباس قال: وحدثني الكلبي عن باذان مولى أم هانئ عن ابن عباس أن نفرا من قريش من أشراف كل قبيلة اجتمعوا ليدخلوا دار الندوة فاعترضهم إبليس في صورة شيخ جليل فلما رأوه قالوا له من أنت؟ قال شيخ من أهل نجد سمعت أنكم أجتمعتم فأردت أن أحضركم ولن يعدمكم رأيي ونصحي: قالوا أجل ادخل فدخل معهم فقال انظروا في شأن هذا الرجل والله ليوشكن أن يواثبكم في أمركم بأمره فقال قائل منهم أحبسوه في وثاق ثم تربصوا به ريب المنون حتى يهلك كما هلك من كان قبله من الشعراء زهير والنابغة إنما هو كأحدهم قال فصرخ عدو الله الشيخ النجدي فقال والله ما هذا لكم برأي والله ليخرجنه ربه من محبسه إلى أصحابه فليوشكن أن يثبوا عليه حتى يأخذوه من أيديكم فيمنعوه منكم فما آمن عليكم أن يخرجوكم من بلادكم. قالوا صدق الشيخ فانظروا في غير هذا. قال قائل منهم أخرجوه من بين أظهركم فتستريحوا منه فإنه إذا خرج لن يضركم ما صنع وأين وقع إذا غاب عنكم أذاه واسترحتم وكان أمره في غيركم. فقال الشيخ النجدي والله ما هذا لكم برأي ألم تروا حلاوة قوله وطلاقة لسانه وأخذ القلوب ما تسمع من حديثه؟ والله لئن فعلتم ثم استعرض العرب ليجتمعن عليه ثم ليأتين إليكم حتى يخرجكم من بلادكم ويقتل أشرافكم. قالوا صدق والله فانظروا رأيا غير هذا قال: فقال أبو جهل لعنه الله: والله لأشيرن عليكم برأي ما أراكم أبصرتموه بعد لا أرى غيره قالوا وما هو؟ قال تأخذون من كل قبيلة غلاما شابا وسطا نهدا ثم يعطى كل غلام منهم سيفا صارما ثم يضربونه ضربة رجل واحد فإذا قتلوه تفرق دمه في القبائل كلها فما أظن هذا الحي من بني هاشم يقوون على حرب قريش كلها فإنهم إذا رأوا ذلك قبلوا العقل واسترحنا وقطعنا عنا أذاه قال: فقال الشيخ النجدي هذا والله الرأي القول ما قال الفتى لا أرى غيره قال فتفرقوا على ذلك وهم مجمعون له فأتى جبريل النبي صلى الله عليه وسلم فأمره أن لا يبيت في مضجعه الذي كان يبيت فيه وأخبره بمكر القوم فلم يبت رسول الله صلى الله عليه وسلم في بيته تلك الليلة وأذن الله له عند ذلك بالخروج وأنزل الله عليه بعد قدومه المدينة الأنفال يذكر نعمه عليه وبلاءه عنده \"وإذ يمكر بك الذين كفروا ليثبتوك أو يقتلوك أو يخرجوك ويمكرون ويمكر الله والله خير الماكرين\" وأنزل في قولهم تربصوا به ريب المنون حتى يهلك كما هلك من كان قبله من الشعراء \"أم يقولون شاعر نتربص به ريب المنون\" فكان ذلك اليوم يسمى يوم الزحمة للذي اجتمعوا عليه من الرأي وعن السدي نحو هذا السياق وأنزل الله في إرادتهم إخراجه قوله تعالى \"وإن كادوا ليستفزونك من الأرض ليخرجوك منها وإذًا لا يلبثون خلافك إلا قليلا\" وكذا روى العوفي عن ابن عباس وروى عن مجاهد وعروة بن الزبير وموسى بن عقبة وقتادة ومقسم وغير واحد نحو ذلك وقال يونس بن بكير عن ابن إسحق فأقام رسول الله صلى الله عليه وسلم ينتظر أمر الله حتى إذا اجتمعت قريش فمكرت به وأرادوا به ما أرادوا أتاه جبريل عليه السلام فأمره أن لا يبيت في مكانه الذي كان يبيت فيه فدعا رسول الله صلى الله عليه وسلم علي بن أبي طالب فأمره أن يبيت على فراشه ويستجي ببرد له أخضر ففعل ثم خرج رسول الله صلى الله عليه وسلم على القوم وهم على بابه وخرج معه بحفنة من تراب فجعل يذرها على رءوسهم وأخذ الله بأبصارهم عن نبيه محمد صلى الله عليه وسلم وهو يقرأ \"يس والقرآن الحكيم\" - إلى قوله -\" فأغشيناهم فهم لا يبصرون\" وقال الحافظ أبو بكر البيهقي: روي عن عكرمة ما يؤكد هذا وقد روى ابن حبان في صحيحه والحاكم في مستدركه من حديث عبدالله بن عثمان بن خثيم عن سعيد بن جبير عن ابن عباس قال دخلت فاطمة على رسول الله صلى الله عليه وسلم وهي تبكي فقال \"ما يبكيك يا بنية؟ \" قالت يا أبت ومالي لا أبكي وهؤلاء الملأ من قريش في الحجر يتعاهدون باللات والعزى ومناة الثالثة الأخرى لو قد رأوك لقاموا إليك فيقتلونك وليس منهم إلا من قد عرف نصيبه من دمك فقال \"يا بنية ائتني بوضوء\" فتوضأ رسول الله صلى الله عليه وسلم ثم خرج إلى المسجد فلما رأوه قالوا ها هو ذا فطأطئوا رءوسهم وسقطت رقابهم بين أيديهم فلم يرفعوا أبصارهم فتناول رسول الله صلى الله عليه وسلم قبضة من تراب فحصبهم بها وقال \"شاهت الوجوه\". فما أصاب رجلا منهم حصاة من حصياته إلا قتل يوم بدر كافرا ثم قال الحاكم صحيح على شرط مسلم ولم يخرجاه ولا أعرف له علة. وقال الإمام أحمد حدثنا عبدالرزاق أخبرنا معمر أخبرني عثمان الجريري عن مقسم مولى ابن عباس أخبره ابن عباس في قوله \"وإذ يمكر بك\" الآية قال تشاورت قريش ليلة بمكة فقال بعضهم إذا أصبح فأثبِتوه بالوثاق يريدون النبي صلى الله عليه وسلم وقال بعضهم بل اقتلوه وقال بعضهم بل أخرجوه فأطلع الله نبيه صلى الله عليه وسلم على ذلك فبات علي رضي الله عنه على فراش رسول الله صلى الله عليه وسلم وخرج النبي صلى الله عليه وسلم حتى لحق بالغار وبات المشركون يحرسون عليا يحسبونه النبي صلى الله عليه وسلم فلما أصبحوا ثاروا إليه فلما رأوا عليا رد الله تعالى مكرهم فقالوا أين صاحبك هذا؟ قال لا أدري فاقتصوا أثره فلما بلغوا الجبل اختلط عليهم فصعدوا في الجبل فمروا بالغار فرأوا على بابه نسج العنكبوت فقالوا لو دخل ههنا لم يكن نسج العنكبوت على بابه فمكث فيه ثلاث ليال وقال محمد بن إسحق عن محمد بن جعفر بن الزبير عن عروة بن الزبير في قوله \"ويمكرون ويمكر الله والله خير الماكرين\" أي فمكرتُ بهم بكيدي المتين حتى خلصتُك منهم."
    },
    {
      "ayah": 31,
      "surah": 8,
      "text": "يخبر تعالى عن كفر قريش وعتوهم وتمردهم وعنادهم ودعواهم الباطل عند سماع آياته إذا تتلى عليهم أنهم يقولون \"قد سمعنا لو نشاء لقلنا مثل هذا\" وهذا منهم قول بلا فعل وإلا فقد تُحُدُّوا غير ما مرة أن يأتوا بسورة من مثله فلا يجدون إلى ذلك سبيلا وإنما هذا القول منهم يَغُرُّون به أنفسهم ومن تبعهم على باطلهم وقد قيل إن القائل لذلك هو النضر بن الحارث لعنه الله كما قد نص على ذلك سعيد بن جبير والسدي وابن جريج وغيرهم. فإنه لعنه الله كان قد ذهب إلى بلاد فارس وتعلم من أخبار ملوكهم رستم واسفنديار ولما قدم وجد رسول الله صلى الله عليه وسلم قد بعثه الله وهو يتلو على الناس القرآن فكان عليه الصلاة والسلام إذا قام من مجلس جلس فيه النضر فحدثهم من أخبار أولئك ثم يقول بالله أينا أحسن قصصا أنا أو محمد؟ ولهذا لما أمكن الله تعالى منه يوم بدر ووقع في الأسارى أمر رسول الله صلى الله عليه وسلم أن تضرب رقبته صبرا بين يديه ففعل ذلك ولله الحمد وكان الذي أسره المقداد بن الأسود رضي الله عنه كما قال ابن جرير حدثنا محمد بن بشار حدثنا محمد بن جعفر حدثنا شعبة عن أبي بشر عن سعيد بن جبير قال: قتل النبي صلى الله عليه وسلم يوم بدر صبرا عقبة بن أبي معيط وطعيمة بن عدي والنضر بن الحارث وكان المقداد أسر النضر فلما أمر بقتله قال المقداد يا رسول الله أسيري فقال رسول الله صلى الله عليه وسلم \"إنه كان يقول في كتاب الله عز وجل ما يقول\" فأمر رسول الله صلى الله عليه وسلم بقتله فقال المقداد هذا الذي أردت قال وفيه أنزلت هذه الآية \"وإذا تتلى عليهم آياتنا قالوا قد سمعنا لو نشاء لقلنا مثل هذا إن هذا إلا أساطير الأولين\". وكذا رواه هشيم عن أبي بشر جعفر بن أبي دحية عن سعيد بن جبير أنه قال المطعم بن عدي بدل طعيمة وهو غلط لأن المطعم بن عدي لم يكن حيا يوم بدر ولهذا قال رسول الله صلى الله عليه وسلم يومئذ لو كان المطعم بن عدي حيا ثم سألني في هؤلاء النتنى لوهبتهم له يعني الأسارى لأنه كان قد أجار رسول الله صلى الله عليه وسلم يوم رجع من الطائف ومعنى \"أساطير الأولين\" وهو جمع أسطورة أي كتبهم اقتبسها فهو يتعلم منها ويتلوها على الناس وهذا هو الكذب البحت كما أخبر الله عنهم في الآية الأخرى \"وقالوا أساطير الأولين اكتتبها فهي تملى عليه بكرة وأصيلا قل أنزله الذي يعلم السر في السموات والأرض إنه كان غفورا رحيما\" أي لمن تاب إليه وأناب فإنه يتقبل منه ويصفح عنه."
    },
    {
      "ayah": 32,
      "surah": 8,
      "text": "وقوله \"وإذ قالوا اللهم إن كان هذا هو الحق من عندك فأمطر علينا حجارة من السماء أو ائتنا بعذاب أليم\" هذا من كثرة جهلهم وشدة تكذيبهم وعنادهم وعتوهم وهذا مما عيبوا به وكان الأولى لهم أن يقولوا اللهم إن كان هذا هو الحق من عندك فاهدنا له ووفقنا لاتباعه ولكن استفتحوا على أنفسهم واستعجلوا العذاب وتقديم العقوبة كقوله تعالى \"ويستعجلونك بالعذاب ولولا أجل مسمى لجاءهم العذاب وليأتينهم بغتة وهم لا يشعرون\" \"وقالوا ربنا عجل لنا قطنا قبل يوم الحساب\" وقوله \"سأل سائل بعذاب واقع للكافرين ليس له دافع من الله ذي المعارج\" وكذلك قال الجهلة من الأمم السالفة كما قال قوم شعيب له \"فأسقط علينا كسفا من السماء إن كنت من الصادقين\" وقال هؤلاء \"اللهم إن كان هذا هو الحق من عندك فأمطر علينا حجارة من السماء أو ائتنا بعذاب أليم\" قال شعبة عن عبدالحميد صاحب الزيادي عن أنس بن مالك قال أبو جهل بن هشام قال \"اللهم إن كان هذا هو الحق من عندك فأمطر علينا حجارة من السماء أو ائتنا بعذاب أليم\" فنزلت \"وما كان الله ليعذبهم وأنت فيهم وما كان الله معذبهم وهم يستغفرون\" رواه البخاري عن أحمد ومحمد بن النضر كلاهما عن عبيد الله بن معاذ عن أبيه عن شعبة به وأحمد هذا هو أحمد بن النضر بن عبدالوهاب قاله الحاكم أبو أحمد والحاكم أبو عبدالله النيسابوري والله أعلم. وقال الأعمش عن رجل عن سعيد بن جبير عن ابن عباس في قوله \"وإذ قالوا اللهم إن كان هذا هو الحق من عندك فأمطر علينا حجارة من السماء أو ائتنا بعذاب أليم\" قال هو النضر بن الحارث بن كلدة قال: فأنزل الله \"سأل سائل بعذاب واقع للكافرين ليس له دافع\" وكذا قال مجاهد وعطاء وسعيد بن جبير والسدي إنه النضر بن الحارث زاد عطاء فقال الله تعالى \"وقالوا ربنا عجل لنا قطنا قبل يوم الحساب\" وقال \"ولقد جئتمونا فرادى كما خلقناكم أول مرة\" وقال \"سأل سائل بعذاب واقع للكافرين\" قال عطاء ولقد أنزل الله فيه بضع عشرة آية من كتاب الله عز وجل وقال ابن مردويه: حدثنا محمد بن إبراهيم حدثنا الحسن بن أحمد بن الليث حدثنا أبو غسان حدثنا أبو نميلة حدثنا الحسين عن ابن بريدة عن أبيه قال: رأيت عمرو بن العاص واقفا يوم أحد على فرس وهو يقول: اللهم إن كان ما يقول محمد حقا فاخسف بي وبفرسي. وقال قتادة في قوله \"وإذ قالوا اللهم إن كان هذا هو الحق من عندك\" الآية. قال: قال ذلك سفهة هذه الأمة وجهلتها فعاد الله بعائدته ورحمته على سفهة هذه الأمة وجهلتها."
    },
    {
      "ayah": 33,
      "surah": 8,
      "text": "وقوله تعالى \"وما كان الله ليعذبهم وأنت فيهم وما كان الله معذبهم وهم يستغفرون\" قال ابن أبي حاتم حدثنا أبي حدثنا أبو حذيفة موسى بن مسعود حدثنا عكرمة بن عمار عن أبي زميل سماك الحنفي عن ابن عباس قال كان المشركون يطوفون بالبيت ويقولون لبيك اللهم لبيك لبيك لا شريك لك. فيقول النبي صلى الله عليه وسلم \"قد قد\" ويقولون: لبيك اللهم لبيك لبيك لا شريك لك إلا شريكا هو لك تملكه وما ملك. ويقولون غفرانك غفرانك فأنزل الله \"وما كان الله ليعذبهم وأنت فيهم\" الآية. قال ابن عباس كان فيهم أمانان النبي صلى الله عليه وسلم والاستغفار فذهب النبي صلى الله عليه وسلم وبقي الاستغفار. وقال ابن جرير حدثني الحارث حدثني عبدالعزيز حدثنا أبو معشر عن يزيد بن رومان ومحمد بن قيس قالا: قالت قريش بعضها لبعض محمد أكرمه الله من بيننا \"اللهم إن كان هذا هو الحق من عندك\" الآية. فلما أمسوا ندموا على ما قالوا فقالوا غفرانك اللهم فأنزل الله \"وما كان الله معذبهم \"- إلى قوله -\" ولكن أكثرهم لا يعلمون\" وقال علي بن أبي طلحة عن ابن عباس \"وما كان الله ليعذبهم وأنت فيهم\" يقول ما كان الله ليعذب قوما وأنبياؤهم بين أظهرهم حتى يخرجهم ثم قال \"وما كان الله معذبهم وهم يستغفرون\" يقول وفيهم من قد سبق له من الله الدخول في الإيمان وهو الاستغفار يستغفرون يعني يصلون يعني بهذا أهل مكة وروى عن مجاهد وعكرمة وعطية العوفي وسعيد بن جبير والسدي نحو ذلك وقال الضحاك وأبو مالك \"وما كان الله معذبهم وهم يستغفرون\" يعني المؤمنين الذين كانوا بمكة وقال ابن أبي حاتم حدثنا أبي حدثنا عبدالغفار بن داود حدثنا النضر بن عدي قال: قال ابن عباس إن الله جعل في هذه الأمة أمانين لا يزالون معصومين مجارين من قوارع العذاب ما داما بين أظهرهم فأمان قبضه الله إليه وأمان بقي فيكم قوله \"وما كان الله ليعذبهم وأنت فيهم وما كان الله معذبهم وهم يستغفرون\" وقال أبو صالح عبدالغفار حدثني بعض أصحابنا أن النضر بن عدي حدثه هذا الحديث عن مجاهد عن ابن عباس وروى ابن مردويه وابن جرير عن أبي موسى الأشعري نحوا من هذا وكذا روى عن قتادة وأبي العلاء النحوي المقرئ وقال الترمذي حدثنا سفيان بن وكيع حدثنا ابن نمير عن إسماعيل بن إبراهيم بن مهاجر عن عباد بن يوسف عن أبي بردة بن أبي موسى عن أبيه قال: قال رسول الله صلى الله عليه وسلم \"أنزل الله علىَّ أمانين لأمتي \"وما كان الله ليعذبهم وأنت فيهم وما كان الله معذبهم وهم يستغفرون\" فإذا مضيت تركت فيهم الاستغفار إلى يوم القيامة\". ويشهد لهذا ما رواه الإمام أحمد في مسنده والحاكم في مستدركه من حديث عبدالله بن وهب أخبرني عمرو بن الحارث عن دراج عن أبي الهيثم عن أبي سعيد أن رسول الله صلى الله عليه وسلم قال \"إن الشيطان قال وعزتك يا رب لا أبرح أغوي عبادك ما دامت أرواحهم في أجسادهم فقال الرب وعزتي وجلالي لا أزال أغفر لهم ما استغفروني\". ثم قال الحاكم صحيح الإسناد ولم يخرجاه وقال الإمام أحمد حدثنا معاوية بن عمرو حدثنا راشد هو ابن سعد حدثني معاوية بن سعد التجيبي عمن حدثه عن فضالة بن عبيد عن النبي صلى الله عليه وسلم أنه قال \"العبد آمن من عذاب الله ما استغفر الله عز وجل\"."
    },
    {
      "ayah": 34,
      "surah": 8,
      "text": "يخبر تعالى أنهم أهل لأن يعذبهم ولكن لم يوقع ذلك بهم لبركة مقام الرسول صلى الله عليه وسلم بين أظهرهم ولهذا لما خرج من بين أظهرهم أوقع الله بهم بأسه يوم بدر فقتل صناديدهم وأسر سراتهم وأرشدهم تعالى إلى الاستغفار من الذنوب التي هم متلبسون بها من الشرك والفساد وقال قتادة والسدي وغيرهما لم يكن القوم يستغفرون ولو كانوا يستغفرون لما عذبوا واختاره ابن جرير فلولا ما كان بين أظهرهم من المستضعفين من المؤمنين المستغفرين لوقع بهم البأس الذي لا يرد ولكن دفع عنهم بسبب أولئك كما قال تعالى في يوم الحديبية \"الذين كفروا وصدوكم عن المسجد الحرام والهدي معكوفا أن يبلغ محله ولولا رجال مؤمنون ونساء مؤمنات لم تعلموهم أن تطئوهم فتصيبكم منهم معرة بغير علم ليدخل الله في رحمته من يشاء لو تزيلوا لعذبنا الذين كفروا منهم عذابا أليما\". قال ابن جرير: حدثنا ابن حميد حدثنا يعقوب عن جعفر بن أبي المغيرة عن ابن أبزى قال كان النبي صلى الله عليه وسلم بمكة فأنزل الله \"وما كان الله ليعذبهم وأنت فيهم\" قال فخرج النبي صلى الله عليه وسلم إلى المدينة فأنزل الله \"وما كان الله معذبهم وهم يستغفرون\" قال وكان أولئك البقية من المسلمين الذين بقوا فيها مستضعفين يعني بمكة \"يستغفرون\" فلما خرجوا أنزل الله \"وما لهم أن لا يعذبهم الله وهم يصدون عن المسجد الحرام وما كانوا أولياءه\" قال فأذن الله في فتح مكة فهو العذاب الذي وعدهم وروى عن ابن عباس وأبي مالك والضحاك وغير واحد نحو هذا وقد قيل إن هذه الآية ناسخة لقوله تعالى \"وما كان الله معذبهم وهم يستغفرون\" على أن يكون المراد صدور الاستغفار منهم أنفسهم قال ابن جرير: حدثنا ابن حميد ثنا يحيى بن واضح عن الحسين بن واقد عن يزيد النحوي عن عكرمة والحسن البصري قالا: قال في الأنفال \"وما كان الله ليعذبهم وأنت فيهم وما كان الله معذبهم وهم يستغفرون\" فنسختها الآية التي تليها \"وما لهم ألا يعذبهم الله\" - إلى قوله -\" فذوقوا العذاب بما كنتم تكفرون\" فقاتلوا بمكة فأصابهم فيها الجوع والضر وكذا رواه ابن أبي حاتم من حديث أبي نميلة يحيى بن واضح. وقال ابن أبي حاتم حدثنا الحسن بن محمد بن الصباح حدثنا حجاج بن محمد عن ابن جريج وعثمان بن عطاء عن عطاء عن ابن عباس \"وما كان الله معذبهم وهم يستغفرون\" ثم أستثنى أهل الشرك فقال \"وما لهم ألا يعذبهم الله وهم يصدون عن المسجد الحرام\" وقوله \"وما لهم ألا يعذبهم الله وهم يصدون عن المسجد الحرام وما كانوا أولياءه إن أولياؤه إلا المتقون ولكن أكثرهم لا يعلمون\" أي وكيف لا يعذبهم الله وهم يصدون عن المسجد الحرام أي الذي بمكة يصدون المؤمنين الذين هم أهله عن الصلاة فيه والطواف به ولهذا قال \"وما كانوا أولياءه إن أولياؤه إلا المتقون\" أي هم ليسوا أهل المسجد الحرام وإنما أهله النبي صلى الله عليه وسلم وأصحابه كما قال تعالى \"ما كان للمشركين أن يعمروا مساجد الله شاهدين على أنفسهم بالكفر أولئك حبطت أعمالهم وفي النار هم خالدون إنما يعمر مساجد الله من آمن بالله واليوم الآخر وأقام الصلاة وآتى الزكاة ولم يخش إلا الله فعسى أولئك أن يكونوا من المهتدين\" وقال تعالى \"وصد عن سبيل الله وكفر به والمسجد الحرام وإخراج أهله منه أكبر عند الله\" الآية. وقال الحافظ أبو بكر بن مردويه في تفسير هذه الآية: حدثنا سليمان بن أحمد هو الطبراني حدثنا جعفر بن إلياس بن صدقة المصري حدثنا نعيم بن حماد حدثنا نوح بن أبي مريم عن يحيى بن سعيد الأنصاري عن أنس بن مالك رضي الله عنه قال: سئل رسول الله صلى الله عليه وسلم من أولياؤك.؟ قال \"كل تقي\" وتلا رسول الله صلى الله عليه وسلم \"إن أولياؤه إلا المتقون\". وقال الحاكم في مستدركه: حدثنا أبو بكر الشافعي حدثنا إسحق بن الحسن حدثنا أبو حذيفة حدثنا سفيان عن عبد الله بن خيثم عن إسماعيل بن عبيد بن رفاعة عن أبيه عن جده قال: جمع رسول الله صلى الله عليه وسلم قريشا فقال \"هل فيكم من غيركم؟ \" فقالوا فينا ابن أختنا وفينا حليفنا وفينا مولانا فقال \"حليفنا منا وابن أختنا منا ومولانا منا إنَّ أوليائي منكم المتقون\" ثم قال هذا صحيح ولم يخرجاه وقال عروة والسدي ومحمد بن إسحق في قوله تعالى \"إن أولياؤه إلا المتقون\" قال هم محمد صلى الله عليه وسلم وأصحابه رضي الله عنهم. وقال مجاهد هم المجاهدون من كانوا وحيث كانوا ثم ذكر تعالى ما كانوا يعتمدونه عند المسجد الحرام وما كانوا يعاملونه به."
    },
    {
      "ayah": 35,
      "surah": 8,
      "text": "فقال \"وما كان صلاتهم عند البيت إلا مكاء وتصدية\" قال عبدالله بن عمرو وابن عباس ومجاهد وعكرمة وسعيد بن جبير وأبو رجاء العطاردي ومحمد بن كعب القرظي وحجر بن عنبس ونبيط بن شريط وقتادة وعبدالرحمن بن زيد بن أسلم: هو الصفير وزاد مجاهد وكانوا يدخلون أصابعهم في أفواههم وقال السدي المكاء الصفير على نحو طير أبيض يقال له المكاء ويكون بأرض الحجاز \"وتصدية\" قال ابن أبي حاتم: حدثنا أبو خلاد سليمان بن خلاد حدثنا يونس بن محمد المؤدب حدثنا يعقوب يعني ابن عبدالله الأشعري حدثنا جعفر بن المغيرة عن سعيد بن جبير عن ابن عباس في قوله \"وما كان صلاتهم عند البيت إلا مكاء وتصدية\" قال كانت قريش تطوف بالبيت عراة تصفر وتصفق والمكاء الصفير والتصدية التصفيق. وهكذا روى علي بن أبي طلحة والعوفي عن ابن عباس وكذا روى عن ابن عمر ومجاهد ومحمد بن كعب وأبي سلمة بن عبدالرحمن والضحاك وقتادة وعطية العوفي وحجر بن عنبس وابن أبزى نحو هذا وقال ابن جرير: حدثنا ابن بشار حدثنا أبو عامر حدثنا قرة عن عطية عن ابن عمر في قوله \"وما كان صلاتهم عند البيت إلى مكاء وتصدية\" قال المكاء التصفير والتصدية التصفيق قال قرة وحكى لنا عطية فعل ابن عمر فصفر ابن عمر وأمال خده وصفق بيديه وعن ابن عمر أيضا أنه قال إنهم كانوا يضعون خدودهم على الأرض ويصفقون ويصفرون رواه ابن أبي حاتم في تفسيره بسنده عنه وقال عكرمة: كانوا يطوفون بالبيت على الشمال قال مجاهد وإنما كانوا يصنعون ذلك ليخلطوا بذلك على النبي صلى الله عليه وسلم صلاته وقال الزهري يستهزئون بالمؤمنين وعن سعيد بن جبير وعبدالرحمن بن زيد \"وتصدية\" قال صدهم الناس عن سبيل الله عز وجل. قوله \"فذوقوا العذاب بما كنتم تكفرون\" قال الضحاك وابن جريج ومحمد بن إسحق هو ما أصابهم يوم بدر من القتل والسبي واختاره ابن جرير ولم يحك غيره وقال ابن أبي حاتم حدثنا أبي حدثنا ابن أبي عمر حدثنا سفيان عن ابن أبي نجيح عن مجاهد قال عذاب أهل الإقرار بالسيف وعذاب أهل التكذيب بالصيحة والزلزلة."
    },
    {
      "ayah": 36,
      "surah": 8,
      "text": "قال محمد بن إسحق حدثني الزهري ومحمد بن يحيى بن حبان وعاصم بن عمر بن قتادة والحصين بن عبدالرحمن بن عمرو بن سعيد بن معاذ قالوا لما أصيبت قريش يوم بدر ورجع فلُّهم إلى مكة ورجع أبو سفيان بعيره مشى عبدالله بن أبي ربيعة وعكرمة بن أبي جهل وصفوان بن أمية في رجال من قريش أصيب آباؤهم وأبناؤهم وإخوانهم ببدر فكلموا أبا سفيان بن حرب ومن كانت له في تلك العير من قريش تجارة فقالوا يا معشر قريش إن محمدا قد وتركم وقتل خياركم فأعينونا بهذا المال على حربه لعلنا أن ندرك منه ثأرا بمن أصيب منا ففعلوا قال ففيهم كما ذكر عن ابن عباس أنزل الله عز وجل \"إن الذين كفروا ينفقون أموالهم\" - إلى قوله -\" هم الخاسرون\" وكذا روى عن مجاهد وسعيد بن جبير والحكم بن عيينة وقتادة والسدي وابن أبزى أنها نزلت في أبي سفيان ونفقتِه الأموال في أحد لقتال رسول الله صلى الله عليه وسلم وقال الضحاك: نزلت في أهل بدر وعلى كل تقدير فهي عامة وإن كان سبب نزولها خاصا فقد أخبر تعالى أن الكفار ينفقون أموالهم ليصدوا عن اتباع طريق الحق فسيفعلون ذلك ثم تذهب أموالهم ثم تكون عليهم حسرة أي ندامة حيث لم تجد شيئا لأنهم أرادوا إطفاء نور الله وظهور كلمتهم على كلمة الحق والله متم نوره ولو كره الكافرون وناصر دينه ومعلن كلمته ومظهر دينه على كل دين فهذا الخزي لهم في الدنيا ولهم في الآخرة عذاب النار فمن عاش منهم رأى بعينه وسمع بأذنه ما يسوءه ومن قتل منهم أو مات فإلى الخزي الأبدي والعذاب السرمدي ولهذا قال \"فسينفقونها ثم تكون عليهم حسرة ثم يغلبون والذين كفروا إلى جهنم يحشرون\" وقوله تعالى \"ليميز الله الخبيث من الطيب\" قال علي بن أبي طلحة عن ابن عباس في قوله \"ليميز الله الخبيث من الطيب\" فيميز أهل السعادة من أهل الشقاء وقال السدي يميز المؤمن من الكافر وهذا يحتمل أن يكون هذا التمييز في الآخرة كقوله \"ثم نقول للذين أشركوا مكانكم أنتم وشركاؤكم فزيلنا بينهم\" الآية وقوله \"ويوم تقوم الساعة يومئذ يتفرقون\" وقال في الآية الأخرى \"يومئذ يصدعون\" وقال تعالى \"وامتازوا اليوم أيها المجرمون\" ويحتمل أن يكون هذا التمييز في الدنيا بما يظهر من أعمالهم للمؤمنين وتكون اللام معللة لما جعل الله للكافرين من مال ينفقونه في الصد عن سبيل الله أي إنما أقدرناهم علي ذلك."
    },
    {
      "ayah": 37,
      "surah": 8,
      "text": "\"ليميز الله الخبيث من الطيب\" أي من يطيعه بقتال أعدائه الكافرين أو يعصيه بالنكول عن ذلك كقوله \"وما أصابكم يوم التقى الجمعان فبإذن الله وليعلم المؤمنين وليعلم الذين نافقوا وقيل لهم تعالوا قاتلوا في سبيل الله أو ادفعوا قالوا لو نعلم قتالا لاتبعناكم\" الآية. وقال تعالى \"ما كان الله ليذر المؤمنين على ما أنتم عليه حتى يميز الخبيث من الطيب وما كان الله ليطلعكم على الغيب\" الآية. وقال تعالى \"أم حسبتم أن تدخلوا الجنة ولما يعلم الله الذين جاهدوا منكم ويعلم الصابرين\" ونظيرتها في براءة أيضا فمعنى الآية على هذا إنما ابتليناكم بالكفار يقاتلونكم وأقدرناهم على إنفاق الأموال وبذلها في ذلك \"ليميز الله الخبيث من الطيب ويجعل الخبيث بعضه على بعض فيركمه\" أي يجمعه كله وهو جمع الشيء بعضه على بعض كما قال تعالى في السحاب \"ثم يجعله ركاما\" أي متراكما متراكبا \"فيجعله في جهنم أولئك هم الخاسرون\" أي هؤلاء هم الخاسرون في الدنيا والآخرة."
    },
    {
      "ayah": 38,
      "surah": 8,
      "text": "يقول تعالى لنبيه صلى الله عليه وعلى آله وسلم \"قل للذين كفروا إن ينتهوا\" أي عما هم فيه من الكفر والمشاقة والعناد ويدخلوا في الإسلام والطاعة والإنابة يغفر لهم ما قد سلف أي من كفرهم وذنوبهم. وخطاياهم كما جاء في الصحيح من حديث أبي وائل عن ابن مسعود رضي الله عنه أن رسول الله صلى الله عليه وسلم قال \"من أحسن في الإسلام لم يؤاخذ بما عمل في الجاهلية ومن أساء في الإسلام أخذ بالأول والآخر\". وفي الصحيح أيضا أن رسول الله صلى الله عليه وسلم قال \"الإسلام يجب ما قبله والتوبة تجب ما كان قبلها\" وقوله \"وإن يعودوا\" أي يستمروا على ما هم فيه \"فقد مضت سنة الأولين\" أي فقد مضت سنتنا في الأولين أنهم إذا كذبوا واستمروا على عنادهم أنا نعاجلهم بالعذاب والعقوبة. قال مجاهد في قوله \"فقد مضت سنة الأولين\" أي في قريش يوم بدر وغيرها من الأمم. وقال السدي ومحمد بن إسحق أي يوم بدر."
    },
    {
      "ayah": 39,
      "surah": 8,
      "text": "وقوله تعالى \"وقاتلوهم حتى لا تكون فتنة ويكون الدين كله لله\" قال البخاري حدثنا الحسن بن عبدالعزيز حدثنا عبدالله بن يحيى حدثنا حيوة بن شريح عن بكر بن عمر عن بكير عن نافع عن ابن عمر أن رجلا جاء فقال: يا أبا عبدالرحمن ألا تصنع ما ذكر الله في كتابه \"وإن طائفتان من المؤمنين اقتتلوا\" الآية. فما يمنعك أن لا تقاتل كما ذكر الله في كتابه؟ فقال: يا ابن أخي أُعَيَّرُ بهذه الآية ولا أقاتل أحب إلي من أن أُعَيَّرُ بالآية التي يقول الله عز وجل \"ومن يقتل مؤمنا متعمدا\" إلى آخر الآية قال: فإن الله تعالى يقول \"وقاتلوهم حتى لا تكون فتنة\" قال ابن عمر قد فعلنا على عهد رسول الله صلى الله عليه وسلم إذ كان الإسلام قليلا وكان الرجل يفتن في دينه إما أن يقتلوه وإما أن يوثقوه ومتى كثر الإسلام فلم تكن فتنة فلما رأى أنه لا يوافقه فيما يريد قال: فما قولكم في علي وعثمان؟ قال ابن عمر أما قولي في علي وعثمان أما عثمان فكان الله قد عفا عنه وكرهتم أن يعفو الله عنه وأما علي فابن عم رسول الله صلى الله عليه وسلم وختنه وأشار بيده وهذه ابنته أو بنته حيث ترون وحدثنا أحمد بن يونس حدثنا زهير حدثنا بيان أن ابن وبرة حدثه قال حدثني سعيد بن جبير قال: خرج علينا أو إلينا ابن عمر رضي الله عنهما فقال: كيف ترى في قتال الفتنة؟ فقال: وهل تدري ما الفتنة؟ كان محمد صلى الله عليه وسلم يقاتل المشركين وكان الدخول عليهم فتنة وليس بقتالكم على الملك. هذا كله سياق البخاري رحمه الله تعالى وقال عبيد الله عن نافع عن ابن عمر أنه أتاه رجلان في فتنة ابن الزبير فقالا: إن الناس قد صنعوا ما ترى وأنت ابن عمر بن الخطاب وأنت صاحب رسول الله صلى الله عليه وسلم فما يمنعك أن تخرج؟ قال يمنعني أن الله حرم علي دم أخي المسلم. قالوا أولم يقل الله \"وقاتلوهم حتى لا تكون فتنة ويكون الدين كله لله\" قال قد قاتلنا حتى لم تكن فتنة وكان الدين كله لله وأنتم تريدون أن تقاتلوا حتى تكون فتنة ويكون الدين لغير الله وكذا روى حماد بن سلمة عن علي بن زيد عن أيوب بن عبدالله اللخمي قال كنت عند عبدالله بن عمر رضي الله عنهما فأتاه رجل فقال إن الله يقول \"وقاتلوهم حتى لا تكون فتنة ويكون الدين كله لله\" قال قد قاتلنا حتى لم تكن فتنة وأنتم تريدون أن تقاتلوا حتى تكون فتنة ويكون الدين لغير الله. وكذا رواه حماد بن سلمة فقال ابن عمر قاتلت أنا وأصحابي حتى كان الدين كله لله وذهب الشرك ولم تكن فتنة ولكنك وأصحابك تقاتلون حتى تكون فتنة ويكون الدين لغير الله رواهما ابن مردويه. وقال أبو عوانة عن الأعمش عن إبراهيم التيمي عن أبيه قال: قال ذو البطين يعني أسامة بن زيد لا أقاتل رجلا يقول لا إله إلا الله أبدا. فقال سعد بن مالك وأنا والله لا أقاتل رجلا يقول لا إله إلا الله أبدا فقال رجل ألم يقل الله \" وقاتلوهم حتى لا تكون فتنة ويكون الدين كله لله\" فقالا قد قاتلنا حتى لم تكن فتنة وكان الدين كله لله. رواه ابن مردويه وقال الضحاك عن ابن عباس \"وقاتلوهم حتى لا تكون فتنة\" يعني لا يكون شرك وكذا قال أبو العالية ومجاهد والحسن وقتادة والربيع عن أنس والسدي ومقاتل بن حيان وزيد بن أسلم. وقال محمد بن إسحق بلغني عن الزهري عن عروة بن الزبير وغيره من علمائنا حتى لا تكون فتنة حتى لا يفتن مسلم عن دينه. وقوله \"ويكون الدين كله لله\" قال الضحاك عن ابن عباس في هذه الآية قال يخلص التوحيد لله وقال الحسن وقتادة وابن جريج \"ويكون الدين كله لله\" أن يقال لا إله إلا الله وقال محمد بن إسحق ويكون التوحيد خالصا لله ليس فيه شرك ويخلع ما دونه من الأنداد. وقال عبدالرحمن بن زيد بن أسلم \"ويكون الدين كله لله\" لا يكون مع دينكم كفر ويشهد لهذا ما ثبت في الصحيحين عن رسول الله صلى الله عليه وسلم أنه قال \"أمرت أن أقاتل الناس حتى يقولوا لا إله إلا الله فإذا قالوها عصموا مني دماءهم وأموالهم إلا بحقها وحسابهم على الله عز وجل\". وفيهما عن أبي موسى الأشعري قال سئل رسول الله صلى الله عليه وسلم عن الرجل يقاتل شجاعة ويقاتل حمية ويقاتل رياء أي ذلك في سبيل الله عز وجل؟ فقال \"من قاتل لتكون كلمة الله هي العليا فهو في سبيل الله عز وجل\". وقوله \"فإن انتهوا\" أي بقتالكم عما هم فيه من الكفر فكفوا عنه وإن لم تعلموا بواطنهم \"فإن الله بما يعملون بصير\" كقوله \"فإن تابوا وأقاموا الصلاة وآتوا الزكاة فخلوا سبيلهم\" الآية. وفي الآية الأخرى \"فإخوانكم في الدين\" وقال \"وقاتلوهم حتى لا تكون فتنة ويكون الدين كله لله فإن انتهوا فلا عدوان إلا على الظالمين\" وفي.الصحيح أن رسول الله صلى الله عليه وسلم قال لأسامة لما علا ذلك الرجل بالسيف فقال لا إله إلا الله فضربه فقتله فذكر ذلك لرسول الله صلى الله عليه وسلم فقال لأسامة \"أقتلته بعد ما قال لا إله إلا الله؟ وكيف تصنع بلا إله إلا الله يوم القيامة؟ \" فقال يا رسول الله إنما قالها تعوذا قال \"هلا شققت عن قلبه؟ \" وجعل يقول ويكرر عليه\" من لك بلا إله إلا الله يوم القيامة؟ \" قال أسامة حتى تمنيت أن لم أكن أسلمت إلا يومئذ."
    },
    {
      "ayah": 4,
      "surah": 8,
      "text": "وقوله \"أولئك هم المؤمنون حقا\" أي المتصفون بهذه الصفات هم المؤمنون حق الإيمان. وقال الحافظ أبو القاسم الطبراني حدثنا محمد بن عبدالله الحضرمي حدثنا أبو كريب حدثنا زيد بن الحباب حدثنا ابن لهيعة عن خالد بن يزيد السكسكي عن سعيد بن أبي هلال عن محمد بن أبي الجهم عن الحارث بن مالك الأنصاري أنه مر برسول الله صلى الله عليه وسلم فقال له \"كيف أصبحت يا حارث؟ \" قال: أصبحت مؤمنا حقا قال \"انظر ما تقول فإن لكل شيء حقيقة فما حقيقة إيمانك؟ \" فقال: عزفت نفسي عن الدنيا فأسهرت ليلى وأظمأت نهاري وكأني أنظر إلى عرش ربي بارزا وكأني أنظر إلى أهل الجنة يتزاورون فيها وكأني أنظر إلى أهل النار يتضاغون فيها فقال:\"يا حارث عرفت فالزم\" ثلاثا. وقال عمرو بن مرة في قوله تعالى \"أولئك هم المؤمنون حقا\" إنما أنزل القرآن بلسان العرب كقولك فلان سيد حقا وفي القوم سادة. وفلان تاجر حقا وفي القوم تجار. وفلان شاعر حقا وفي القوم شعراء. وقوله \"لهم درجات عند ربهم\" أي منازل ومقامات ودرجات في الجنات كما قال تعالى \"هم درجات عند الله والله بصير بما يعملون\". \"ومغفرة\" أي يغفر لهم السيئات ويشكر لهم الحسنات. وقال الضحاك في قوله \"لهم درجات عند ربهم\" أهل الجنة بعضهم فوق بعض فيرى الذي هو فوق فضله على الذي هو أسفل منه ولا يرى الذي هو أسفل منه أنه فضل عليه أحد ولهذا جاء في الصحيحين أن رسول الله صلى الله عليه وسلم قال \"إن أهل عليين ليراهم من أسفل منهم كما ترون الكوكب الغابر في أفق من آفاق السماء\". قالوا يا رسول الله تلك منازل الأنبياء لا ينالها غيرهم فقال \"بلى والذي نفسي بيده لرجال آمنوا بالله وصدقوا المرسلين\" وفي الحديث الآخر الذي رواه الإمام أحمد وأهل السنن من حديث ابن أبي عطية عن أبي سعيد قال: قال رسول الله صلى الله عليه وسلم \"إن أهل الجنة ليتراءون أهل الدرجات العلى كما تراءون الكوكب الغابر في أفق السماء وإن أبا بكر وعمر منهم وأنعما\"."
    },
    {
      "ayah": 40,
      "surah": 8,
      "text": "وقوله \"وإن تولوا فاعلموا أن الله مولاكم نعم المولى ونعم النصير\" أي وإن استمروا على خلافكم ومحاربتكم فاعلموا أن الله مولاكم وسيدكم وناصركم على أعدائكم فنعم المولى ونعم النصير. وقال محمد بن جرير حدثني عبدالوارث بن عبدالصمد حدثنا أبي حدثنا أبان العطار حدثنا هشام بن عروة عن عروة أن عبدالملك بن مروان كتب إليه يسأله عن أشياء فكتب إليه عروة: سلام عليك فإني أحمد إليك الله الذي لا إله إلا هو. أما بعد فإنك كتبت إلي تسألني عن مخرج رسول الله صلى الله عليه وسلم من مكة وسأخبرك به ولا حول ولا قوة إلا بالله كان من شأن خروج رسول الله صلى الله عليه وسلم من مكة أن الله أعطاه النبوة فنعم النبي ونعم السيد ونعم العشيرة فجزاه الله خيرا وعرفنا وجهه في الجنة وأحيانا على ملته وأماتنا وبعثنا عليهـا وأنه لما دعا قومه لما بعثه الله به من الهدى والنور الذي أنزل عليه لم يبعدوا منه أول ما دعاهم إليه وكانوا يسمعون له حتى إذا ذكر طواغيتهم وقدم ناس من الطائف من قريش لهم أموال أنكر ذلك عليه ناس واشتدوا عليه وكرهوا ما قال وأغروا به من أطاعهم فانعطف عنه عامة الناس فتركوه إلا من حفظه الله منهم وهم قليل فمكث بذلك ما قدر الله أن يمكث ثم ائتمرت رءوسهم بأن يفتنوا من اتبعه عن دين الله من أبنائهم وإخوانهم وقبائلهم فكانت فتنة شديدة الزلزال فافتتن من افتتن وعصم الله من شاء منهم فلما فعل ذلك بالمسلمين أمرهم رسول الله صلى الله عليه وسلم أن يخرجوا إلى أرض الحبشة وكان بالحبشة ملك صالح يقال له النجاشي لا يظلم أحد بأرضه وكان يثنى عليه مع ذلك وكانت أرض الحبشة متجرا لقريش يتجرون فيها وكانت مساكن لتجارهم يجدون فيها رفاغا من الرزق وأمنا ومتجرا حسنا فأمرهم بها النبي صلى الله عليه وسلم فذهب إليها عامتهم لما قهروا بمكة وخافوا عليهم الفتن ومكث هو فلم يبرح فمكث بذلك سنوات يشتدون على من أسلم منهم ثم إنه فشا الإسلام فيها ودخل فيه رجال من أشرافهم ومنعتهم فلما رأوا ذلك استرخوا استرخاءة عن رسول الله صلى الله عليه وسلم وعن أصحابه وكانت الفتنة الأولى هي التي أخرجت من خرج من أصحاب رسول الله صلى الله عليه وسلم قبل أرض الحبشة مخافتها وفرارا مما كانوا فيه من الفتن والزلزال فلما استرخى عنهم ودخل في الإسلام من دخل منهم تحدث باسترخائهم عنهم فبلغ من كان بأرض الحبشة من أصحاب رسول الله صلى الله عليه وسلم أنه قد استرخى عمن كان منهم بمكة وأنهم لا يفتنون فرجعوا إلى مكة وكادوا يأمنون بهـا وجعلوا يزدادون ويكثرون وأنه أسلم من الأنصار بالمدينة ناس كثير وفشا الإسلام بالمدينة وطفق أهل المدينة يأتون رسول الله صلى الله عليه وسلم بمكة فلما رأت قريش ذلك تآمروا على أن يفتنوهم ويشتدوا فأخذوهم فحرصوا على أن يفتنوهم فأصابهم جهـد شديد فكانت الفتنة الآخرة فكانت فتنتان فتنة أخرجت من خرج منهم إلى أرض الحبشة حين أمرهم النبي صلى الله عليه وسلم بها وأذن لهم في الخروج إليها وفتنة لما رجعوا ورأوا من يأتيهم من أهل المدينة ثم إنه جاء رسول الله صلى الله عليه وسلم من المدينة سبعون نقيبا رءوس الذين أسلموا فوافوه بالحج فبايعوه بالعقبة وأعطوه عهودهم ومواثيقهم على أنا منك وأنت منا وعلى أن من جاء من أصحابك أو جئتنا فإنا نمنعك مما نمنع منه أنفسنا فاشتدت عليهم قريش عند ذلك فأمر رسول الله صلى الله عليه وسلم أصحابه أن يخرجوا إلى المدينة وهي الفتنة الآخرة التي أخرج فيها رسول الله صلى الله عليه وسلم أصحابه وخرج هو. وهي التي أنزل الله عز وجل فيها \"وقاتلوهم حتى لا تكون فتنة ويكون الدين كله لله\" ثم رواه عن يونس بن عبدالأعلى عن ابن وهب عن عبدالرحمن بن أبي الزناد عن أبيه عن عروة بن الزبير أنه كتب إلى الوليد يعني ابن عبدالملك بن مروان بهذا فذكر مثله وهذا صحيح إلى عروة رحمه الله."
    },
    {
      "ayah": 41,
      "surah": 8,
      "text": "يبين تعالى تفصيل ما شرعه مخصصا لهذه الأمة الشريفة من بين سائر الأمم المتقدمة بإحلال الغنائم. والغنيمة هي المال المأخوذ من الكفار بإيجاف الخيل والركاب والفيء ما أخذ منهم بغير ذلك كالأموال التي يصالحون عليها أو يتوفون عنها ولا وارث لهم والجزية والخراج ونحو ذلك هذا مذهب الإمام الشافعي في طائفة من علماء السلف والخلف ومن العلماء من يطلق الفيء على ما تطلق عليه الغنيمة وبالعكس أيضا ولهذا ذهب قتادة إلى أن هذه الآية ناسخة لآية الحشر \"ما أفاء الله على رسوله من أهل القرى فلله وللرسول ولذي القربى\" الآية. قال فنسخت آية الأنفال تلك وجعلت الغنائم أربعة أخماس للمجاهدين وخمسا منها لهؤلاء المذكورين وهذ الذي قاله بعيد لأن هذه الآية نزلت بعد وقعة بدر وتلك نزلت في بني النضير ولا خلاف بين علماء السير والمغازي قاطبة أن بني النضير بعد بدر وهذا أمر لا يشك فيه ولا يرتاب فمن يفرق بين معنى الفيء والغنيمة يقول تلك نزلت في أموال الفيء وهذه في الغنائم ومن يجعل أمر الغنائم والفيء راجعا إلى رأى الإمام يقول لا منافاة بين آية الحشر وبين التخميس إذا رآه الإمام والله أعلم. فقوله تعالى \"واعلموا أنما غنمتم من شيء فإن لله خمسه\" توكيد لتخميس كل قليل وكثير حتى الخيط والمخيط قال الله تعالى \"ومن يغلل يأت بما غل يوم القيامة ثم توفى كل نفس ما كسبت وهم لا يظلمون\" وقوله \"فإن لله خمسه وللرسول\" اختلف المفسرون ههنا فقال بعضهم لله نصيب من الخمس يجعل في الكعبة قال أبو جعفر الرازي عن الربيع عن أبي العالية الرياحي: قال كان رسول الله صلى الله عليه وسلم يؤتى بالغنيمة فيخمسها على خمسة تكون أربعة أخماس لمن شهدها ثم يأخذ الخمس فيضرب بيده فيه فيأخذ منه الذي قبض كفه فيجعله للكعبة وهو سهم الله ثم يقسم ما بقي على خمسة أسهم فيكون سهم للرسول وسهم لذوي القربى وسهم لليتامى وسهم للمساكين وسهم لابن السبيل. وقال آخرون ذكر الله ههنا استفتاح كلام للتبرك وسهم لرسوله عليه السلام قال الضحاك عن ابن عباس رضي الله عنهما كان رسول الله صلى الله عليه وسلم إذا بعث سرية فغنموا خمس الغنيمة فضرب ذلك الخمس في خمسة ثم قرأ \"واعلموا أنما غنمتم من شيء فأن لله خمسه وللرسول\" \"فأن لله خمسه\" مفتاح كلام \"لله ما في السموات وما في الأرض\" فجعل سهم الله وسهم الرسول صلى الله عليه وسلم واحدا وهكذا قال إبراهيم النخعي والحسن بن محمد بن الحنفية والحسن البصري والشعبي وعطاء بن أبي رباح وعبدالله بن بريدة وقتادة ومغيرة وغير واحد أن سهم الله ورسوله واحد ويؤيد هذا ما رواه الإمام الحافظ أبو بكر البيهقي بإسناد صحيح عن عبدالله بن شقيق عن رجل قال أتيت النبي صلى الله عليه وسلم وهو بوادي القرى وهو يعرض فرسا فقلت: يا رسول الله ما تقول في الغنيمة؟ فقال \"لله خمسها وأربعة أخماسها للجيش\" قلت فما أحد أولى به من أحد؟ قال \"لا ولا السهم تستخرجه من جيبك ليس أنت أحق به من أخيك المسلم\". وقال ابن جرير: حدثنا عمران بن موسى حدثنا عبدالوارث حدثنا أبان عن الحسن قال أوصى الحسن بالخمس من ماله وقال ألا أرضى من مالي بما رضي الله لنفسه ثم اختلف قائلو هذا القول فروى علي بن أبي طلحة عن ابن عباس قال: كانت الغنيمة تخمس على خمسة أخماس فأربعة منها بين من قاتل عليها وخمس واحد يقسم على أربعة أخماس فربع لله وللرسول صلى الله عليه وسلم فما كان لله وللرسول فهو لقرابة النبي صلى الله عليه وسلم ولم يأخذ النبي صلى الله عليه وسلم من الخمس شيئا. وقال ابن أبي حاتم حدثنا أبي حدثنا أبو معمر المنقري حدثنا عبدالوارث بن سعيد عن حسين المعلم عن عبدالله بن بريدة في قوله \"واعلموا أنما غنمتم من شيء فأن لله خمسـه وللرسول\" قال الذي لله فلنبيه والذي للرسول لأزواجه وقال عبدالملك بن أبي سليمان عن عطاء بن أبي رباح قال خمس الله والرسول واحد يحمل منه ويصنع فيه ما شاء يعني النبي صلى الله عليه وسلم وهذا أعم وأشمل وهو أنه صلى الله عليه وسلم يتصرف في الخمس الذي جعله الله بما شاء ويرده في أمته كيف شاء ويشهد لهذا ما رواه الإمام أحمد حيث قال: حدثنا إسحق بن عيسى حدثنا إسماعيل بن عياش عن أبي بكر بن عبدالله بن أبي مريم عن أبي سلام الأعرج عن المقدام بن معديكرب الكندي أنه جلس مع عبادة بن الصامت وأبي الدرداء والحارث بن معاوية الكندي رضي الله عنهم فتذاكروا حديث رسول الله صلى الله عليه وسلم فقال أبو الدرداء لعبادة يا عبادة كلمات رسول الله صلى الله عليه وسلم في غزوة كذا وكذا في شأن الأخماس فقال عبادة إن رسول الله صلى الله عليه وسلم صلى بهم في غزوة إلى بعير من المغنم فلما سلم قام رسول الله صلى الله عليه وسلم فتناول وبرة بين أنملتيه فقال \"إن هذه من غنائمكم وإنه ليس لي فيها إلا نصيبي معكم الخمس والخمس مردود عليكم فأدوا الخيط والمخيط وأكبر من ذلك وأصغر ولا تغلوا فإن الغلول عار ونار على أصحابه في الدنيا والآخرة وجاهدوا الناس في الله القريب والبعيد ولا تبالوا في الله لومة لائم وأقيموا حدود الله في السفر والحضر وجاهدوا في الله فإن الجهاد باب من أبواب الجنة عظيم ينجي الله به من الهم والغم\". هذا حديث حسن عظيم ولم أره في شيء من الكتب الستة من هذا الوجه ولكن روى الإمام أحمد أيضا وأبو داود والنسائي من حديث عمرو بن شعيب عن أبيه عن جده عبدالله بن عمرو عن رسول الله صلى الله عليه وسلم نحوه في قصة الخمس والنهي عن الغلول. وعن عمرو بن عنبسة أن رسول الله صلى الله عليه وسلم صلى بهم إلى بعير من المغنم فلما سلم أخذ وبرة من هذا البعير ثم قال \"ولا يحل لي من غنائمكم مثل هذه إلا الخمس والخمس مردود عليكم\". رواه أبو داود والنسائي وقد كان للنبي صلى الله عليه وسلم من الغنائم شيء يصطفيه لنفسه عبد أو أمة أو فرس أو سيف أو نحو ذلك كما نص عليه محمد بن سيرين وعامر الشعبي وتبعهمـا على ذلك أكثر العلماء. وروى الإمام أحمد والترمذي وحسنه عن ابن عباس أن رسول الله صلى الله عليه وسلم تنفل سيفه ذا الفقار يوم بدر وهو الذي رأى فيه الرؤيا يوم أحد وعن عائشة رضي الله عنها قالت: كانت صفية من الصفي رواه أبو داود في سننه وروى أيضا بإسناده والنسائي أيضا عن يزيد بن عبدالله قال: كنا بالمربد إذ دخل رجل معه قطعة أديم فقرأناها فإذا فيها \"من محمد رسول الله إلى بني زهير بن قيس إنكم إن شهدتم أن لا إله إلا الله وأن محمدا رسول الله وأقمتم الصلاة وآتيتم الزكاة وأديتم الخمس من المغنم وسهم النبي صلى الله عليه وسلم وسهم الصفي أنتم آمنون بأمان الله ورسوله\" فقلنا من كتب هذا؟ فقال رسول الله صلى الله عليه وسلم. فهذه أحاديث جيدة تدل على تقرير هذا وثبوته ولهذا جعل ذلك كثيرون من الخصائص له صلوات الله وسلامه عليه وقال آخرون: إن الخمس يتصرف فيه الإمام بالمصلحة للمسلمين كما يتصرف في مال الفيء وقال شيخنا الإمام العلامة ابن تيمية رحمه الله وهذا قول مالك وأكثر السلف وهو أصح الأقوال. فإذا ثبت هذا وعلم فقد اختلف أيضا في الذي كان يناله عليه السلام من الخمس ماذا يصنع به من بعده فقال قائلون يكون لمن يلي الأمر من بعده روي هذا عن أبي بكر وعلي وقتادة وجماعة. وجاء فيه حديث مرفوع وقال آخرون يصرف في مصالح المسلمين وقال آخرون بل هو مردود على بقية الأصناف ذوي القربى واليتامى والمساكين وابن السبيل اختاره ابن جرير وقال آخرون بل سهم النبي صلى الله عليه وسلم وسهم ذوي القربى مردودان على اليتامى والمساكين وابن السبيل قال ابن جرير وذلك قول جماعة من أهل العراق وقيل إن الخمس جميعه لذوي القربى كما رواه ابن جرير حدثنا الحارث حدثنا عبدالعزيز حدثنا عبدالغفار حدثنا المنهال بن عمرو سألت عبدالله بن محمد بن علي وعلي بن الحسين عن الخمس فقالا: هو لنا فقلت لعلي فإن الله يقول \"واليتامى والمساكين وابن السبيل\" فقالا يتامانا ومساكيننا وقال سفيان الثوري وأبو نعيم وأبو أسامة عن قيس بن مسلم سألت الحسن بن محمد بن الحنفية رحمه الله تعالى عن قول الله تعالى \"واعلموا أنما غنمتم من شيء فأن لله خمسه وللرسول\" فقال هذا مفتاح كلام الله الدنيا والآخرة ثم اختلف الناس في هذين السهمين بعد وفاة رسول الله صلى الله تعالى عليه وآله وسلم فقال قائلون سهم النبي صلى الله تعالى عليه وآله وسلم تسليما للخليفة من بعده وقال آخرون لقرابة النبي صلى الله تعالى عليه وعلى آله وسلم وقال آخرون سهم القرابة لقرابة الخليفة واجتمع رأيهم أن يجعلوا هذين السهمين في الخيل والعدة في سبيل الله فكانا على ذلك في خلافة أبي بكر وعمر رضي الله عنهما قال الأعمش عن إبراهيم كان أبو بكر وعمر يجعلان سهم النبي صلى الله عليه وسلم في الكراع والسلاح فقلت لإبراهيم ما كان علي فيه؟ قال: كان أشدهم فيه. وهذا قول طائفة كثيرة من العلماء رحمهم الله وأما سهم ذوي القربى فإنه يصرف إلى بني هاشم وبني المطلب لأن بني المطلب وازروا بني هاشم في الجاهلية وفي أول الإسلام ودخلوا معهم في الشعب غضبا لرسول الله صلى الله عليه وسلم وحماية له مسلمهم طاعة لله ولرسوله وكافرهم حمية للعشيرة وأنفة وطاعة لأبي طالب عم رسول الله صلى الله عليه وسلم وأما بنو عبد شمس وبنو نوفل وإن كانوا بني عمهم فلم يوافقوهم علي ذلك بل حاربوهم ونابذوهم ومالئوا بطون قريش على حرب الرسول ولهذا كان ذم أبي طالب لهم في قصيدته اللامية أشد من غيرهم لشدة قربهم ولهذا يقول في أثناء قصيدته: جزى الله عنا عبد شمس ونوفلا عقوبة شر عاجل غير آجــــل بميزان قسط لا يخيس شعيـــرة له شاهد من نفسه غيـر عائل لقد سفهت أحلام قوم تبدلــوا بني خلف قيضا بنا والعياطل ونحن الصميم من ذؤابة هــاشم وآل قصي في الخطوب الأوائل وقال جبير بن مطعم بن عدي بن نوفل مشيت أنا وعثمان بن عفان يعني ابن أبي العاص بن أمية بن عبد شمس إلى رسول الله صلى الله عليه وسلم فقلنا يا رسول الله أعطيت بني المطلب من خمس خيبر وتركتنا ونحن وهم منك بمنزلة واحدة فقال \"إنما بنو هاشم وبنو المطلب شيء واحد\". رواه مسلم وفي بعض روايات هذا الحديث \"إنهم لم يفارقونا في جاهلية ولا إسلام\". وهذا قول جمهور العلماء أنهم بنو هاشم وبنو المطلب قال ابن جرير وقال آخرون هم بنو هاشم ثم روى عن خصيف عن مجاهد قال: علم الله أن في بني هاشم فقراء فجعل لهم الخمس مكان الصدقة وفي رواية عنه قال هم قرابة رسول الله صلى الله عليه وسلم الذين لا تحل لهم الصدقة ثم روى عن علي بن الحسن نحو ذلك قال ابن جرير وقال آخرون بل هم قريش كلها حدثني يونس بن عبدالأعلى حدثني عبدالله بن نافع عن أبي معشر عن سعيد المقبري قال: كتب نجدة إلى عبدالله بن عباس يسأله عن ذوي القربى فكتب إليه ابن عباس كنا نقول: إنا هم فأبى علينا ذلك قومنا وقالوا قريش كلها ذوو قربى وهذا الحديث صحيح رواه مسلم وأبو داود والترمذي والنسائي من حديث سعيد المقبري عن يزيد بن هرمز أن نجدة كتب إلى ابن عباس يسأله عن ذوي القربى فذكره إلى قوله فأبى ذلك علينا قومنا والزيادة من أفراد أبي معشر نجيح بن عبدالرحمن المدني وفيه ضعف وقال ابن أبي حاتم حدثنا أبي حدثنا ابن مهدي المصيصي حدثنا المعتمر بن سليمان عن أبيه عن حنش عن عكرمة عن ابن عباس قال: قال رسول الله صلى الله عليه وسلم \"رغبت لكم عن غسالة الأيدي لأن لكم من خمس الخمس ما يغنيكم أو يكفيكم\". هذا حديث حسن الإسناد وإبراهيم بن مهدي هذا وثقه أبو حاتم وقال يحيى بن معين يأتي بمناكير والله أعلم وقوله \"واليتامى\" أي أيتام المسلمين واختلف العلماء هل يختص بالأيتام الفقراء أو يعم الأغنياء والفقراء؟ على قولين والمساكين هم المحاويج الذين لا يجدون ما يسد خلتهم ومسكنهم \"وابن السبيل\" هو المسافر أو المريد للسفر إلى مسافة تقصر فيها الصلاة وليس له ما ينفقه في سفره ذلك وسيأتي تفسير ذلك في آية الصدقات من سورة براءة إن شاء الله تعالى وبه الثقة وعليه التكلان. وقوله \"إن كنتم آمنتم بالله وما أنزلنا على عبدنا\" أي امتثلوا ما شرعنا لكم من الخمس في الغنائم إن كنتم تؤمنون بالله واليوم الآخر وما أنزلنا على رسوله. ولهذا جاء في الصحيحين من حديث عبدالله بن عباس في حديث وفد عبدالقيس أن رسول الله صلى الله عليه وسلم قال لهم \"وآمركم بأربع وأنهاكم عن أربع. آمركم بالإيمان بالله - ثم قال - هل تدرون ما الإيمان بالله؟ شهادة أن لا إله إلا الله وأن محمدا رسول الله وإقام الصلاة وإيتاء الزكاة وأن تؤدوا الخمس من المغنم\". الحديث بطوله فجعل أداء الخمس من جملة الإيمان وقد بوب البخاري على ذلك في كتاب الإيمان من صحيحه فقال \"باب أداء الخمس من الإيمان\" ثم أورد حديث ابن عباس هذا وقد بسطنا الكلام عليه في شرح البخاري ولله الحمد والمنة وقال مقاتل بن حيان \"وما أنزلنا على عبدنا يوم الفرقان\" أي في القسمة وقوله \"يوم الفرقان يوم التقى الجمعان والله على كل شيء قدير\" ينبه تعالى على نعمته وإحسانه إلى خلقه بما فرق به بين الحق والباطل ببدر ويسمى الفرقان لأن الله أعلى فيه كلمة الإيمان على كلمة الباطل وأظهـر دينه ونصر نبيه وحزبه قال علي بن أبي طلحة والعوفي عن ابن عباس: يوم الفرقان يوم بدر فرق الله فيه بين الحق والباطل رواه الحاكم. وكذا قال مجاهد ومقسم وعبيد الله بن عبدالله والضحاك وقتادة ومقاتل بن حيان وغير واحد أنه يوم بدر وقال عبدالرزاق عن معمر عن الزهري عن عروة بن الزبير في قوله \"يوم الفرقان\" يوم فرق الله بين الحق والباطل وهو يوم بدر وهو أول مشهد شهده رسول الله صلى الله عليه وسلم وكان رأس المشركين عتبة بن ربيعة فالتقوا يوم الجمعة لتسع عشرة أو سبع عشرة مضت من رمضان وأصحاب رسول الله صلى الله عليه وسلم يومئذ ثلثمائة وبضعة عشـر رجلا والمشركون بين الألف والتسعمائة فهزم الله المشركين وقتل منهم زيادة على السبعين وأسر منهم مثل ذلك وقد روى الحاكم في مستدركه من حديث الأعمش عن إبراهيم عن الأسود عن ابن مسعود قال في ليلة القدر: تحروها لأحدى عشرة يبقين فإن في صبيحتها يوم بدر. وقال على شرطهما وروى مثله عن عبدالله بن الزبير أيضا من حديث جعفر بن برقان عن رجل عنه وقال ابن جرير حدثنا ابن حميد حدثنا يحيى بن واضح حدثنا يحيى بن يعقوب أبو طالب عن ابن عون عن محمد بن عبـدالله الثقفي عن أبي عبدالرحمن السلمي قال: قال الحسن بن علي كانت ليلة الفرقان يوم التقى الجمعان لسبع عشرة من رمضان إسناد جيد قوى ورواه ابن مردويه عن أبي عبدالرحمن عبدالله بن حبيب عن علي قال: كانت ليلة الفرقان ليلة التقى الجمعان في صبيحتها ليلة الجمعة لسبع عشر مضت من شهر رمضان وهو الصحيح عند أهل المغازي والسير وقال يزيد بن أبي حبيب إمام أهل الديار المصرية في زمانه: كان يوم بدر يوم الاثنين ولم يتابع على هذا وقول الجمهور مقدم عليه والله أعلم."
    },
    {
      "ayah": 42,
      "surah": 8,
      "text": "يقول تعالى مخبرا عن يوم الفرقان \"إذ أنتم بالعدوة الدنيا\" أي إذ أنتم نزول بعدوة الوادي الدنيا القريبة إلى المدينة \"وهم\" أي المشركون نزول \"بالعدوة القصوى\" أي البعيدة من المدينة إلى ناحية مكة\" والركب أي العير الذي فيه أبو سفيان بما معه من التجارة \"أسفل منكم\" أي مما يلي سيف البحر \"ولو تواعدتم أي أنتم والمشركون إلى مكان لاختلفتم في الميعاد\" قال محمد بن إسحق وحدثني يحيى بن عباد بن عبدالله بن الزبير عن أبيه في هذه الآية قال ولو كان ذلك عن ميعاد منكم ومنهم ثم بلغكم كثرة عددهم وقلة عددكم ما لقيتموهم \"ولكن ليقضي الله أمرا كان مفعولا\" أي ليقضي الله ما أراد بقدرته من إعزاز الإسلام وأهله وإذلال الشرك وأهله من غير ملأ منكم ففعل ما أراد من ذلك بلطفه وفي حديث كعب بن مالك قال إنما خـرج رسول الله صلى الله عليه وسلم والمسلمون يريدون عير قريش حتى جمع الله بينهم وبين عدوهم على غير ميعاد وقال ابن جرير حدثني يعقوب حدثني بن علية عن ابن عون عن عمير بن إسحق قال: أقبل أبو سفيان في الركب من الشام وخرج أبو جهل ليمنعه من رسول الله صلى الله عليه وسلم وأصحابه فالتقوا ببدر ولا يشعر هؤلاء بهؤلاء ولا هؤلاء بهؤلاء حتى التقى السقاة ونهد الناس بعضهم لبعض وقال محمد بن إسحق في السيرة: ومضى رسول الله صلى الله عليه وسلم على وجهه ذلك حتى إذا كان قريبا من الصفراء بعث بسبس بن عمرو وعدي بن أبي الزغباء الجهنين يلتمسان الخبر عن أبي سفيان فانطلقا حتى إذا وردا بدرا فأناخا بعيريهما إلى تل من البطحاء فاستقيا في شن لهما من الماء فسمعا جاريتين يختصمان تقول إحداهما لصاحبتها اقضيني حقي وتقول الأخرى إنما تأتي العير غدا أو بعد غد فأقضيك حقك فخلص بينهما مجدي بن عمرو وقال صدقت فسمع بذلك بسبس وعدي فجلسا على بعيريهما حتى أتيا رسول الله صلى الله عليه وسلم فأخبراه الخبر وأقبل أبو سفيان حين وليا وقد حذر فتقدم أمام عيره وقال لمجدي بن عمرو هل أحسست على هذا الماء من أحد تنكره؟ فقال لا والله إلا أني قد رأيت راكبين أناخا إلى هذا التل فاستقيا من شن لهما ثم انطلقا فجاء أبو سفيان إلى مناخ بعيريهما فأخذ من أبعارهما ففته فإذا فيه النوى فقال هذه والله علائف يثرب ثم رجع سريعا فضرب وجه عيره فانطلق بها فساحل حتى إذا رأى أنه قد أحرز عيره إلى قريش فقال: إن الله قد نجى عيركم وأموالكم ورجالكم فارجعوا فقال أبو جهل والله لا نرجع حتى نأتي بدرا. وكانت بدر سوقا من أسواق العرب. فنقيم بها ثلاثا فنطعم بها الطعام وننحر بها الجزر ونسقي بها الخمر وتعزف علينا القيان وتسمع بنا العرب وبمسيرنا فلا يزالون يهابوننا بعدها أبدا. فقال الأخنس بن شريق: يا معشر بني زهرة إن الله قد أنجى أموالكم ونجى صاحبكم فارجعوا فرجعت بنو زهرة فلم يشهدوها ولا بنو عدي. قال محمد بن إسحق وحدثني يزيد بن رومان عن عروة بن الزبير قال: وبعث رسول الله صلى الله عليه وسلم حين دنا من بدر علي بن أبي طالب وسعد بن أبي وقاص والزبير بن العوام في نفر من أصحابه يتجسسون له الخبر فأصابوا سقاة لقريش غلاما لبني سعيد بن العاص وغلاما لبني الحجاج فأتوا بهما رسول الله صلى الله عليه وآله وسلم فوجدوه يصلي فجعل أصحاب رسول الله صلى الله عليه وسلم يسألونهما لمن أنتما؟ فيقولان نحن سقاة لقريش بعثونا نسقيهم من الماء فكره القوم خبرهما ورجوا أن يكونا لأبي سفيان فضربوهما فلما أزلقوهما قالا نحن لأبي سفيان فتركوهما وركع رسول الله صلى الله عليه وسلم وسجد سجدتين ثم سلم وقال \"إذا صدقاكم ضربتموهما وإذا كذباكم تركتموهما صدقا والله إنهما لقريش أخبراني عن قريش \"قالا هم وراء هذا الكثيب الذي ترى بالعدوة القصوى والكثيب العقنقل فقال لهما رسول الله صلى الله عليه وسلم \"كم القوم؟\" قالا كثير قال \"ما عدتهم؟ \" قالا ما ندري قال \"كم ينحرون كل يوم؟ \" قالا يوما تسعا ويوما عشرا قال رسول الله صلى الله عليه وسلم \"القوم ما بين التسعمائة إلى الألف\" ثم قال لهما \"فمن فيهم من أشراف قريش؟ \" قالا عتبة بن ربيعة وشيبة بن ربيعة وأبو البختري بن هشام وحكيم بن حزام ونوفل بن خويلد والحارث بن عامر بن نوفل وطعيمة بن عدي بن نوفل والنضر بن الحارث وزمعة بن الأسود وأبو جهل بن هشام وأمية بن خلف ونبيه ومنبه ابنا الحجاج وسهيل بن عمرو وعمرو بن عبد ود فأقبل رسول الله صلى الله تعالى عليه وآله وسلم على الناس فقال \"هذه مكة قد ألقت إليكم أفلاذ كبدها\" قال محمد بن إسحق رحمه الله تعالى وحدثني عبدالله بن أبي بكر بن حزم أن سعد بن معاذ قال لرسول الله صلى الله تعالى عليه وآله وسلم لما التقى الناس يوم بدر يا رسول الله ألا نبني لك عريشا تكون فيه وننيخ إليك ركائبك ونلقى عدونا فإن أظفرنا الله عليهم وأعزنا فذاك ما نحن وإن تكن الأخـرى فتجلس على ركائبك وتلحق بمن وراءنا من قومنا فقد والله تخلف عنك أقوام ما نحن بأشد لك حبا منهم لو علموا أنك تلقى حربا ما تخلفوا عنك ويؤازرونك وينصرونك. فأثنى عليه رسول الله صلى الله عليه وسلم خيرا ودعا له به فبنى له عريش فكان فيه رسول الله صلى الله عليه وسلم وأبو بكر ما معهما غيرهما. قال ابن إسحق وارتحلت قريش حين أصبحت فلما أقبلت ورآها رسول الله صلى الله عليه وسلم تصوب من العقنقل وهو الكثيب الذي جاءوا منه إلى الوادي فقال \"اللهم هذه قريش قد أقبلت بخيلائها وفخرها تحادك وتكذب رسولك اللهم أحنهم الغداة\" وقوله \"ليهلك من هلك عن بينة ويحيى من حي عن بينة\" قال محمد بن إسحق أي ليكفر من كفر بعد الحجة لما رأى من الآية والعبرة ويؤمن من آمن على مثل ذلك وهذا تفسير جيد. وبسط ذلك أنه تعالى يقول إنما جمعكم مع عدوكم في مكان واحد على غير ميعاد لينصركم عليهم ويرفع كلمة الحق على الباطل ليصير الأمر ظاهرا والحجة قاطعة والبراهين ساطعة ولا يبقى لأحد حجة ولا شبهة فحينئذ يهلك من هلك أي يستمر في الكفر من استمر فيه على بصيرة من أمره إنه مبطل لقيام الحجة عليه \"ويحيى من حي\" أي يؤمن من آمن \"عن بينة\" أي حجة وبصيرة والإيمان هو حياة القلوب قال الله تعالى \"أو من كان ميتا فأحييناه وجعلنا له نورا يمشي به في الناس\" وقالت عائشة في قصة الأفك فهلك في من هلك أي قال فيها ما قال من البهتان والإفك وقوله \"وإن الله لسميع\" أي لدعائكم وتضرعكم واستغاثتكم به \"عليم\" أي بكم وأنكم تستحقون النصر على أعدائكم الكفرة المعاندين."
    },
    {
      "ayah": 43,
      "surah": 8,
      "text": "قال مجاهد أراهم الله إياه في منامه قليلا وأخبر النبي صلى الله عليه وسلم أصحابه بذلك فكان تثبيتا لهم وكذا قال ابن إسحق وغير واحد وحكى ابن جرير عن بعضهم أنه رآهم بعينه التي ينام بها وقد روى ابن أبي حاتم حدثنا أبي حدثنا يوسف بن موسى حدثنا أبو قتيبة عن سهل السراج عن الحسن في قوله \"إذ يريكهم الله في منامك قليلا\" قال بعينك وهذا القول غريب وقد صرح بالمنام ههنا فلا حاجة إلى التأويل الذي لا دليل عليه وقوله \"ولو أراكهم كثيرا لفشلتم\" أي لجبنتم عنهم واختلفتم فيما بينكم \"ولكن الله سلم\" أي من ذلك بأن أراكهم قليلا \"إنه عليم بذات الصدور\" أي بما تجنه الضمائر وتنطوي عليه الأحشاء \"يعلم خائنة الأعين وما تخفي الصدور\"."
    },
    {
      "ayah": 44,
      "surah": 8,
      "text": "وقوله \"وإذ يريكموهم إذ التقيتم في أعينكم قليلا\" وهذا أيضا من لطفه تعالى بهم إذ أراهم إياهم قليلا في رأي العين فيجرءوهم عليهم ويطمعهم فيهم قال أبو إسحق السبيعي عن أبي عبيدة عن عبدالله بن مسعود رضي الله عنه قال لقد قللوا في أعيينا يوم بدر حتى قلت لرجل إلى جنبي تراهم سبعين؟ قال لا بل هم مائة حتى أخذنا رجلا منهم فسألناه فقال كنا ألفا. رواه ابن أبي حاتم وابن جرير وقوله \"ويقللكم في أعينهم\" قال ابن أبي حاتم حدثنا أبي حدثنا سليمان بن حرب حدثنا حماد بن زيد عن الزبير بن الحارث عن عكرمة \"وإذ يريكموهم إذ التقيتم\" الآية. قال حضض بعضهم على بعض إسناد صحيح وقال محمد بن إسحق حدثني يحيى بن عباد بن عبدالله بن الزبير. عن أبيه في قوله تعالى \"ليقضي الله أمرا كان مفعولا\" أي ليلقي بينهم الحرب للنقمة ممن أراد الانتقام منه والإنعام على من أراد تمام النعمة عليه من أهل ولايته ومعنى هذا أنه تعالى أغرى كلا من الفريقين بالآخر وقلله في عينه ليطمع فيه وذلك عند المواجهة فلما التحم القتال وأيد الله المؤمنين بألف من الملائكة مردفين بقي حزب الكفار يرى حزب الإيمان ضعفيه كما قال تعالى \"قد كان لكم آية في فئتين التقتا فئة تقاتل في سبيل الله وأخرى كافرة يرونهم مثليهم رأى العين والله يؤيد بنصره من يشاء إن في ذلك لعبرة لأولى الأبصار\" وهذا هو الجمع بين هاتين الآيتين فإن كلا منهما حق وصدق ولله الحمد والمنة."
    },
    {
      "ayah": 45,
      "surah": 8,
      "text": "هذا تعليم من الله لعباده المؤمنين آداب اللقاء وطريق الشجاعة عند مواجهة الأعداء فقال \"يا أيها الذين آمنوا إذا لقيتم فئة فاثبتوا\" ثبت في الصحيحين عن عبدالله بن أبي أوفى أن رسول الله صلى الله عليه وسلم انتظر في بعض أيامه التي لقى فيها العدو حتى إذا مالت الشمس قام فيهم فقال \"يا أيها الناس لا تتمنوا لقاء العدو واسألوا الله العافية فإذا لقيتموهم فاصبروا واعلموا أن الجنة تحت ظلال السيوف\" ثم قام النبي صلى الله عليه وسلم وقال \"اللهم منزل الكتاب ومجري السحاب وهازم الأحزاب اهزمهم وانصرنا عليهم وقال عبدالرزاق عن سفيان الثوري عن عبدالرحمن بن زياد عن عبدالله بن يزيد عن عبدالله بن عمرو قال: قال رسول الله صلى الله عليه وسلم \"لا تتمنوا لقاء العدو واسألوا الله العافية فإذا لقيتموهم فاثبتوا واذكروا الله فإن صخبوا وصاحوا فعليكم بالصمت\". وقال الحافظ أبو القاسم الطبراني حدثنا إبراهيم بن هاشم البغوي حدثنا أمية بن بسطام حدثنا معتمر بن سليمان حدثنا ثابت بن زيد عن رجل عن زيد بن أرقم عن النبي صلى الله عليه وسلم مرفوعا قال \"إن الله يحب الصمت عند ثلاث عند تلاوة القـرآن وعند الزحف وعند الجنازة\". وفي الحديث الآخر المرفوع يقول الله تعالى \"إن عبدي كل عبدي الذي يذكرني وهو مناجز قرنه\" أي لا يشغله ذلك الحال عن ذكري ودعائي واستعانتي. وقال سعيد بن أبي عروبه عن قتادة في هذه الآية قال افترض الله ذكره عند أشغل ما يكون عند الضرب بالسيوف. وقال ابن أبي حاتم حدثنا أبي حدثنا عبدة بن سليمان حدثنا ابن المبارك عن ابن جريج عن عطاء: قال وجب الإنصات وذكر الله عند الزحف ثم تلا هذه الآية قلت يجهرون بالذكر؟ قال نعم وقال أيضا قرأ على يونس بن عبدالأعلى أنبأنا ابن وهب أخبرني عبدالله بن عبدالله بن عباس عن يزيد بن فوذر عن كعب الأحبار قال ما من شيء أحب إلى الله تعالى من قراءة القرآن والذكر ولولا ذلك ما أمر الناس بالصلاة في القتال ألا ترون أنه أمر الناس بالذكر عند القتال فقال \"يا أيهـا الذين آمنوا إذا لقيتم فئة فاثبتوا واذكروا الله كثيرا لعلكم تفلحون\" قال الشاعر: ذكرتك والخطى يخطر بيننا وقد نهلت فينا المثقفة السمر وقال عنترة: ولقد ذكرتك والرماح نواهل مني وبيض الهند تقطر من دمي فأمر تعالى بالثبات عند قتال الأعداء والصبر على مبارزتهم فلا يفروا ولا ينكلوا ولا يجبنوا وأن يذكروا الله في تلك الحال ولا ينسوه بل يستعينوا به ويتوكلوا عليه ويسألوه النصر على أعدائهم."
    },
    {
      "ayah": 46,
      "surah": 8,
      "text": "أمرهم أن يطيعوا الله ورسوله في حالهم ذلك فما أمرهم الله تعالى به ائتمروا. وما نهاهم عنه انزجروا ولا يتنازعوا فيما بينهم أيضا فيختلفوا فيكون سببا لتخاذلهم وفشلهم \"وتذهب ريحكم\" أي قوتكم وحدتكم وما كنتم فيه من الإقبال \"واصبروا إن الله مع الصابرين\" وقد كان للصحابة رضي الله عنهم في باب الشجاعة والإئتمار بما أمرهم الله ورسوله به وامتثال ما أرشدهم إليه ما لم يكن لأحد من الأمم والقرون قبلهم ولا يكون لأحد ممن بعدهم فإنهم ببركة الرسول صلى الله عليه وآله وسلم وطاعته فيما أمرهم فتحوا القلوب والأقاليم شرقا وغربا في المدة اليسيرة مع قلة عددهم بالنسبة إلى جيوش سائر الأقاليم من الروم والفرس والترك والصقالية والبربر والحبوش وأصناف السودان والقبط وطوائف بني آدم. قهروا الجميع حتى علت كلمة الله وظهر دينه على سائر الأديان وامتدت الممالك الإسلامية في مشارق الأرض ومغاربها في أقل من ثلاثين سنة فرضي الله عنهم وأرضاهم أجمعين وحشرنا في زمرتهم إنه كريم وهاب."
    },
    {
      "ayah": 47,
      "surah": 8,
      "text": "يقول تعالى بعد أمره المؤمنين بالإخلاص في القتال في سبيله وكثرة ذكره ناهيا لهم عن التشبه بالمشركين في خروجهم من ديارهم بطرا أي دفعا للحق \"ورئاء الناس\" وهو المفاخرة والتكبر عليهم كما قال أبو جهل لما قيل له إن العير قد نجا فارجعوا فقال لا والله لا نرجع حتى نرد ماء بدر وننحر الجزر ونشرب الخمر وتعزف علينا القيان وتتحدث العرب بمكاننا فيها يومنا أبدا فانعكس ذلك عليه أجمع لأنهم لما وردوا ماء بدر وردوا به الحمام وركموا في أطواء بدر مهانين أذلاء صغرة أشقياء في عذاب سرمدي أبدي ولهذا قال \"والله بما يعملون محيط \" أي عالم بما جاءوا به وله ولهذا جازاهم عليه شر الجزاء لهم. قال ابن عباس ومجاهد وقتادة والضحاك والسدي في قوله تعالى \"ولا تكونوا كالذين خرجوا من ديارهم بطرا ورئاء الناس\" قالوا هم المشركون الذين قاتلوا رسول الله صلي الله عليه وسلم يوم بدر. وقال محمد بن كعب لما خرجت قريش من مكة إلى بدر خرجوا بالقيان والدفوف فأنزل الله \"ولا تكونوا كالذين خرجوا من ديارهم بطرا ورئاء الناس ويصدون عن سبيل الله والله بما يعملون محيط \"."
    },
    {
      "ayah": 48,
      "surah": 8,
      "text": "وقوله تعالى \"وإذ زين لهم الشيطان أعمالهم وقال لا غالب لكم اليوم من الناس وإني جار لكم\" الآية حسن لهم لعنه الله ما جاءوا له وما هموا به وأطمعهم أنه لا غالب لهم اليوم من الناس ونفى عنهم الخشية من أن يؤتوا في ديارهم من عدوهم بني بكر فقال إني جار لكم وذلك أنه تبدى لهم في صورة سراقة بن مالك بن جعشم سيد بني مدلج كبير تلك الناحية وكل ذلك منه كما قال تعالى عنه \"يعدهم ويمنيهم وما يعدهم الشيطان إلا غرورا\" قال ابن جريج قال ابن عباس في هذه الآية لما كان يوم بدر سار إبليس برايته وجنوده مع المشركين وألقى في قلوب المشركين أن أحدا لن يغلبكم وإني جار لكم فلما التقوا ونظر الشيطان إلى إمداد الملائكة \"نكص على عقبيه\" قال رجع مدبرا وقال \"إني أرى ما لا ترون\" الآية. وقال علي بن أبي طلحة عن ابن عباس قال جاء إبليس يوم بدر في جند من الشياطين معه رايته في صورة رجل من مدلج في صورة سراقة بن مالك بن جعشم فقال الشيطان للمشركين لا غالب لكم اليوم من الناس وإني جار لكم فلما اصطف الناس أخذ رسول الله صلى الله عليه وسلم قبضة من التراب فرمى بها في وجوه المشركين فولوا مدبرين وأقبل جبريل عليه السلام إلى إبليس فلما رآه وكانت يده في يد رجل من المشركين انتزع يده ثم ولى مدبرا وشيعته فقال الرجل يا سراقة أتزعم أنك لنا جار فقال: إني أرى ما لا ترون إني أخاف الله والله شديد العقاب وذلك حين رأى الملائكة وقال محمد بن إسحق حدثني الكلبي عن أبي صالح عن ابن عباس أن إبليس خرج مع قريش في صورة سراقة بن مالك بن جعشم فلما حضر القتال ورأى الملائكة نكص على عقبيه وقال إني بريء منكم فتشبث به الحارث بن هشام فنخر في وجهه فخر صعقا فقيل له ويلك يا سراقة على هذه الحال تخذلنا وتبرأ منا فقال إني بريء منكم إني أرى ما لا ترون إني أخاف الله والله شديد العقاب. وقال محمد بن عمر الواقدي أخبر عمر بن عقبة عن شعبة مولى ابن عباس عن ابن عباس قال لما تواقف الناس أغمي على رسول الله صلى الله عليه وسلم ساعة ثم كشف عنه فبشر الناس بجبريل في جند من الملائكة ميمنة الناس وميكائيل في جند آخر ميسرة الناس وإسرافيل في جند آخر ألف وإبليس قد تصور في صورة سراقة بن مالك بن جعشم المدلجي يدبر المشركين ويخبرهم أنه لا غالب لهم اليوم من الناس فلما أبصر عدو الله الملائكة نكص على عقبيه وقال إني بريء منكم إني أرى ما لا ترون فتشبث به الحارث بن هشام وهو يرى أنه سراقة لما سمع من كلامه فضرب في صدر الحارث فسقط الحارث وانطلق إبليس لا يرى حتى سقط في البحر ورفع ثوبه وقال يا رب موعدك الذي وعدتني. وفي الطبراني عن رفاعة بن رافع قريب من هذا السياق وأبسط منه ذكرناه في السيرة وقال محمد بن إسحق حدثني يزيد بن رومان عن عروة بن الزبير قال: لما أجمعت قريش المسير ذكرت الذي بينها وبين بني بكر من الحرب فكاد ذلك أن يثنيهم فتبدى لهم إبليس في صوة سراقة بن مالك بن جعشم المدلجي وكان من أشراف بني كنانة فقال أنا جار لكم أن تأتيكم كنانة بشيء تكرهونه فخرجوا سراعا قال محمد بن إسحق فذكر لي أنهم كانوا يرونه في كل منزل في صورة سراقة بن مالك لا ينكرونه حتى إذا كان يوم بدر والتقى الجمعان كان الذي رآه حين نكص الحارث بن هشام أو عمير بن وهب فقال أين سراقة؟ أين وميل عدو الله فذهب قال فأوردهم ثم أسلمهم قال ونظر عدو الله إلى جنود الله قد أيد الله بهم رسوله والمؤمنين فنكص على عقبيه وقال إني بريء منكم إني أرى ما لا ترون وصدق عدو الله. وقال إني أخاف الله والله شديد العقاب وهكذا روى عن السدي والضحاك والحسن البصري ومحمد بن كعب القرظي وغيرهم رحمهم الله وقال قتادة وذكر لنا أنه رأى جبريل عليه السلام تنزل معه الملائكة فعلم عدو الله أنه لا يدان له بالملائكة فقال إني أرى ما لا ترون إني أخاف الله وكذب عدو الله. والله ما به مخافة الله ولكن علم أنه لا قوة له ولا منعة وتلك عادة عدو الله لمن أطاعه واستقاد له حتى إذا التقى الحق والباطل أسلمهم شر مسلم وتبرأ منهم عند ذلك قلت يعني بعادته لمن أطاعه قوله تعالى \"كمثل الشيطان إذ قال للإنسان اكفر فلما كفر قال إني بريء منك إني أخاف الله رب العالمين\" وقوله تعالى \"وقال الشيطان لما قضي الأمر إن الله وعدكم وعد الحق ووعدتكم فأخلفتكم وما كان لي عليكم من سلطان إلا أن دعوتكم فاستجبتم لي فلا تلوموني ولوموا أنفسكم ما أنا بمصرخكم وما أنتم بمصرخي إني كفرت بما أشركتمون من قبل إن الظالمين لهم عذاب أليم\" وقال يونس بن بكير عن محمد بن إسحق حدثني عبدالله بن أبي بكر بن عمرو بن حزم عن بعض بني ساعدة قال: سمعت أبا أسيد مالك بن ربيعة بعدما كف بصره يقول: لو كنت معكم الآن ببدر ومعي بصري لأخبرتكم بالشعب الذي خرجت منه الملائكة لا أشك ولا أتمارى فلما نزلت الملائكة ورآها إبليس وأوحى الله إليهم أني معكم فثبتوا الذين آمنوا وتثبيتهم أن الملائكة كانت تأتي الرجل في صورة الرجل يعرفه فيقول له أبشر فإنهم ليسوا بشيء والله معكم فكروا عليهم فلما رأى إبليس الملائكة نكص على عقبيه وقال إني بريء منكم إني أرى ما لا ترون وهو في صورة سراقة وأقبل أبو جهل يحضض أصحابه ويقول لا يهولنكم خذلان سراقة إياكم فإنه كان على موعد من محمد وأصحابه. ثم قال واللات والعزى لا نرجع حتى نقرن محمدا وأصحابه في الحبال فلا تقتلوهم وخذوهم أخذا وهذا من أبي جهل لعنه الله كقول فرعون للسحرة لما أسلموا \"إن هذا لمكر مكرتموه في المدينة لتخرجوا منها أهلها\" وكقوله \"إنه لكبيركم الذي علمكم السحر\" وهو من باب البهت والافتراء ولهذا كان أبو جهل فرعون هذه الأمة. وقال مالك بن أنس عن إبراهيم بن أبي علية عن طلحة بن عبيد الله بن كريز أن رسول الله صلى الله عليه وسلم قال \"ما رأى إبليس يوما هو فيه أصغر ولا أحقر ولا أدحر ولا أغيظ من يوم عرفة وذلك مما يرى من نزول الرحمة والعفو عن الذنوب إلا ما رأى يوم بدر\". قالوا يا رسول الله وما رأى يوم بدر؟ قال \"أما إنه رأى جبريل عليه السلام يزغ الملائكة\". وهذا مرسل من هذا الوجه."
    },
    {
      "ayah": 49,
      "surah": 8,
      "text": "وقوله \"إذ يقول المنافقون والذين في قلوبهم مرض غر هؤلاء دينهم\" قال علي بن أبي طلحة عن ابن عباس في هذه الآية لما دنا القوم بعضهم من بعض قلل الله المسلمين في أعين المشركين وقلل المشركين في أعين المسلمين فقال المشركون غر هؤلاء دينهم وإنما قالوا ذلك من قلتهم في أعينهم فظنوا أنهم سيهزمونهم لا يشكون في ذلك فقال الله \"ومن يتوكل على الله فإن الله عزيز حكيم\" وقال قتادة: رأوا عصابة من المؤمنين تشددت لأمر الله وذكر لنا أن أبا جهل عدو الله لما أشرف على محمد صلى الله عليه وسلم وأصحابه قال: والله لا يعبد الله بعد اليوم - قسوة وعتوا. وقال ابن جريج في قوله \"إذ يقول المنافقون والذين في قلوبهم مرض\" هم قوم كانوا من المنافقين بمكة قالوه يوم بدر وقال عامر الشعبي كان ناس من أهل مكة قد تكلموا بالإسلام فخرجوا مع المشركين يوم بدر فلما رأوا قلة المسلمين قالوا غر هؤلاء دينهم. وقال مجاهد في قوله عز وجل \"إذ يقول المنافقون والذين في قلوبهم مرض غر هؤلاء دينهم\" قال فئة من قريش قيس بن الوليد بن المغيرة وأبو قيس بن الفاكه بن المغيرة والحارث بن زمعة بن الأسود بن المطلب وعلي بن أمية بن خلف والعاص بن منبه بن الحجاج خرجوا مع قريش من مكة وهم على الارتياب فحبسهم ارتيابهم فلما رأوا قلة أصحاب رسول الله صلى الله عليه وسلم قالوا غر هؤلاء دينهم حتى قدموا على ما قدموا عليه مع قلة عددهم وكثرة عدوهم وكذا قال محمد بن إسحق بن يسار سواء. وقال ابن جرير حدثنا محمد بن عبدالأعلى حدثنا محمد بن ثور عن معمر عن الحسن في هذه الآية. قال هم قوم لم يشهدوا القتال يوم بدر فسموا منافقين قال معمر وقال بعضهم هم قوم كانوا أقروا بالإسلام وهم بمكة فخرجوا مع المشركين يوم بدر فلما رأوا قلة المسلمين قالوا غر هؤلاء دينهم وقوله \"ومن يتوكل على الله\" أي يعتمد على جنابه \"فإن الله عزيز\" أي لا يضام من التجأ إليه فإن الله عزيز منيع الجناب عظيم السلطان \"حكيم\" في أفعاله لا يضعها إلا في مواضعها فينصر من يستحق النصر ويخذل من هو أهل لذلك."
    },
    {
      "ayah": 5,
      "surah": 8,
      "text": "قال الإمام أبو جعفر الطبري. اختلف المفسرون في السبب الجالب لهذه الكاف في قوله \"كما أخرجك ربك\" فقال بعضهم شبه به في الصلاح للمؤمنين اتقاؤهم ربهم وإصلاحهم ذات بينهم طاعتهم لله ورسوله ثم روى عن عكرمة نحو هذا ومعنى هذا أن الله تعالى يقول كما أنكم لما أختلفتم في المغانم وتشاححتم فيها فانتزعها الله منكم وجعلها إلى قسمه وقسم رسوله صلى الله عليه وسلم فقسمها على العدل والتسوية فكان هذا هو المصلحة التامة لكم وكذلك لما كرهتم الخروج إلى الأعداء من قتال ذات الشوكة وهم النفير الذين خرجوا لنصر دينهم وإحراز عيرهم فكان عاقبة كراهتكم للقتال بأن قدره لكم وجمع به بينكم وبين عدوكم على غير ميعاد رشدا وهدى ونصرا وفتحا كما قال تعالى \"كتب عليكم القتال وهو كره لكم وعسى أن تكرهوا شيئا وهو خير لكم وعسى أن تحبوا شيئا وهو شر لكم والله يعلم وأنتم لا تعلمون\". قال ابن جرير وقال آخرون معنى ذلك \"كما أخرجك ربك من بيتك بالحق\" على كره من فريق من المؤمنين كذلك هم كارهون للقتال فهم يجادلونك فيه بعدما تبين لهم. ثم روى عن مجاهد نحوه أنه قال \"كما أخرجك ربك\" قال كذلك يجادلونك في الحق وقال السدي أنزل الله في خروجه إلى بدر ومجادلتهم إياه فقال \"كما أخرجك ربك من بيتك بالحق وإن فريقا من المؤمنين لكارهون\" لطلب المشركين \"يجادلونك في الحق بعدما تبين\" وقال بعضهم يسألونك عن الأنفال مجادلة كما جادلوك يوم بدر فقالوا أخرجتنا للعير ولم تعلمنا قتالا فنستعد له. قلت:رسول الله صلى الله عليه وسلم إنما خرج من المدينة طالبا لعير أبي سفيان التي بلغه خبرها أنها صادرة من الشام فيها أموال جزيلة لقريش فاستنهض رسول الله صلى الله عليه وسلم المسلمين من خف منهم فخرج في ثلثمائة وبضعة عشر رجلا وطلب نحو الساحل من على طريق بدر وعلم أبو سفيان بخروج رسول الله صلى الله عليه وسلم في طلبه فبعث ضمضم بن عمرو نذيرا إلى أهل مكة فنهضوا في قريب من ألف مقنع ما بين التسعمائة إلى الألف وتيامن أبو سفيان بالعير إلى سيف البحر فنجا وجاء النفير فوردوا ماء بدر وجمع الله بين المسلمين والكافرين على غير ميعاد لما يريد الله تعالى من إعلاء كلمة المسلمين ونصرهم على عدوهم والتفرقة بين الحق والباطل كما سيأتي بيانه والغرض أن رسول الله صلى الله عليه وسلم لما بلغه خروج النفير أوحى الله إليه يعده إحدى الطائفتين إما العير وإما النفير ورغب كثير من المسلمين إلى العير لأنه كسب بلا قتال كما قال تعالى \"وتودون أن غير ذات الشوكة تكون لكم ويريد الله أن يحق الحق بكلماته ويقطع دابر الكافرين\" قال الحافظ أبو بكر بن مردويه في تفسيره حدثنا سليمان بن أحمد الطبراني حدثنا بكر بن سهل حدثنا عبدالله بن يوسف حدثنا ابن لهيعة عن يزيد بن أبي حبيب عن أسلم أبي عمران حدثه أنه سمع أبا أيوب الأنصاري يقول: قال رسول الله صلى الله عليه وسلم ونحن بالمدينة: \"وإني أخبرت عن عير أبي سفيان أنها مقبلة فهل لكم أن نخرج قبل هذه العير لعل الله أن يغنمناها؟ \" فقلنا نعم فخرج وخرجنا فلما سرنا يوما أو يومين قال لنا:\"ما ترون في قتال القوم إنهم قد أخبروا بخروجكم؟ \" فقلنا لا والله ما لنا طاقة بقتال العدو ولكنا أردنا العير ثم قال:\"ما ترون في قتال القوم؟ \" فقلنا مثل ذلك فقال المقداد بن عمرو إذًا لا نقول لك يا رسول الله كما قال قوم موسى لموسى:\"فاذهب أنت وربك فقاتلا إنا ههنا قاعدون\" قال فتمنينا معشر الأنصار أن لو قلنا كما قال المقداد أحب إلينا من أن يكون لنا مال عظيم قال فأنزل الله على رسوله صلى الله عليه وسلم \"كما أخرجك ربك من بيتك بالحق وإن فريقا من المؤمنين لكارهون\" وذكر تمام الحديث. ورواه ابن أبي حاتم من حديث ابن لهيعة بنحوه. وروى ابن مردويه أيضا من حديث محمد بن عمرو بن علقمة بن أبي وقاص الليثي عن أبيه عن جده رضي الله عنه قال خرج رسول الله صلى الله تعالى عليه وعلى آله وسلم إلى بدر حتى إذا كان بالروحاء خطب الناس فقال:\"كيف ترون؟ \" فقال أبو بكر رضي الله تعالى عنه: يا رسول الله بلغنا أنهم بمكان كذا وكذا قال: ثم خطب الناس فقال:\"كيف ترون ؟ \" فقال عمر مثل قول أبي بكر ثم خطب الناس فقال:\"كيف ترون ؟ \" فقال سعد بن معاذ يا رسول الله إيانا تريد؟ فوالذي أكرمك وأنزل عليك الكتاب ما سلكتُها قط ولا لي بها علم ولئن سرت حتى تأتي برك الغماد من ذي يمن لنسيرن معك ولا نكون كالذين قالوا لموسى \"فاذهب أنت وربك فقاتلا إنا ههنا قاعدون\" ولكن أذهب أنت وربك فقاتلا إنا معكما مقاتلون ولعلك أن تكون خرجت لأمر وأحدث الله إليك غيره فانظر الذي أحدث الله إليك فامض له فصل حبال من شئت واقطع حبال من شئت وعاد من شئت وسالم من شئت وخذ من أموالنا ما شئت فنزل القرآن على قول سعد:\"كما أخرجك ربك من بيتك بالحق وإن فريقا من المؤمنين لكارهون\" الآيات وقال العوفي عن ابن عباس لما شاور النبي صلى الله عليه وسلم في لقاء العدو وقال له سعد بن عبادة ما قال وذلك يوم بدر أمر الناس أن يتهيئوا للقتال وأمرهم بالشوكة فكره ذلك أهل الإيمان فأنزل الله:\"كما أخرجك ربك من بيتك بالحق وإن فريقا من المؤمنين لكارهون يجادلونك في الحق بعد ما تبين كأنما يساقون إلى الموت وهم ينظرون."
    },
    {
      "ayah": 50,
      "surah": 8,
      "text": "يقول تعالى ولو عاينت يا محمد حال توفي الملائكة أرواح الكفار لرأيت أمرا عظيما هائلا فظيعا منكرا \"إذ يضربون وجوههم وأدبارهم ويقولون لهم ذوقوا عذاب الحريق\" قال ابن جريج عن مجاهد \"أدبارهم\" أستاههم قال يوم بدر قال ابن جريج قال ابن عباس إذا أقبل المشركون بوجوههم إلى المسـلمين ضربوا وجوههم بالسيوف وإذا ولوا أدركتهم الملائكة يضربون أدبارهم وقال ابن أبي نجيح عن مجاهد في قوله \"إذ يتوفى الذين كفروا الملائكة يضربون وجوههم وأدبارهم\" يوم بدر وقال وكيع عن سفيان الثوري عن أبي هاشم إسماعيل بن كثير عن مجاهد وعن شعبة عن يعلى بن مسلم عن سعيد بن جبير يضربون وجوههم وأدبارهم قال وأستاههم ولكن الله يكنى وكذا قال عمر مولى عفرة. وعن الحسن البصري قال: قال رجل يا رسول الله: إني رأيت بظهر أبي جهل مثل الشوك قال \"ذاك ضرب الملائكة\". رواه ابن جرير وهو مرسل وهذا السياق وإن كان سببه وقعة بدر ولكنه عام في حق كل كافر ولهذا لم يخصصه تعالى بأهل بدر بل قال تعالى \"ولو ترى إذ يتوفى الذين كفروا الملائكة يضربون وجوههم وأدبارهم\" وفي سورة القتال مثلها وتقدم في سورة الأنعام قوله تعالى \"ولو ترى إذ المجرمون في غمرات الموت والملائكة باسطوا أيديهم أخرجوا أنفسكم\" أي باسـطوا أيديهم بالضرب فيهم بأمر ربهم إذ استصعبت أنفسهم وامتنعت من الخروج من الأجساد أن تخرج قهرا وذلك إذا بشروهم بالعذاب والغضب من الله كما في حديث البراء أن ملك الموت إذا جاء الكافر عند احتضاره في تلك الصورة المنكرة يقول: اخرجي أيتها النفس الخبيثة إلى سموم وحميم وظل من يحموم فتفرق في بدنه فيستخرجونها من جسده كما يخرج السفود من الصوف المبلول فتخرج معها العروق والعصب ولهذا أخبر تعالى أن الملائكة تقول لهم ذوقوا عذاب الحريق."
    },
    {
      "ayah": 51,
      "surah": 8,
      "text": "وقوله تعالى \"ذلك بما قدمت أيديكم\" أي هذا الجزاء بسبب ما عملتم من الأعمال السيئة في حياتكم الدنيا جازاكم الله بها هذا الجزاء \"وأن الله ليس بظلام للعبيد\" أي لا يظلم أحدا من خلقه بل هو الحكم العدل الذي لا يجور تبارك وتعالى وتقدس وتنزه الغني الحميد ولهذا جاء في الحديث الصحيح عن مسلم رحمه الله من رواية أبي ذر رضي الله عنه عن رسول الله صلى الله عليه وسلم إن الله تعالى يقول: يا عبادي إني حرمت الظلم على نفسي وجعلته بينكم محرما فلا تظالموا يا عبادي إنما هي أعمالكم أحصيها لكم فمن وجد خيرا فليحمد الله ومن وجد غير ذلك فلا يلومن إلا نفسه\". ولهذا قال تعالى."
    },
    {
      "ayah": 52,
      "surah": 8,
      "text": "قوله تعالى:\"كدأب أل فرعون والذين من قبلهم كفروا بأيات الله فأخذهم الله بذنوبهم إن الله قوي شديد العقاب \" يقول تعالى فعل هؤلاء من المشركين المكذبين بما أرسلت به يا محمد كما فعل الأمم المكذبة قبلهم ففعلنا بهم ما هو دأبنا أي عادتنا وسنتنا في أمثالهم من المكذبين من آل فرعون ومن قبلهم من الأمم المكذبة بالرسل الكافرين بآيات الله \"فأخذهم الله بذنوبهم\" أي بسبب ذنوبهم أهلكهم وأخذهم أخذ عزيز مقتدر \"إن الله قوي شديد العقاب\" أي لا يغلبه غالب ولا يفوته هارب."
    },
    {
      "ayah": 53,
      "surah": 8,
      "text": "يخبر تعالى عن تمام عدله وقسطه في حكمه بأنه تعالى لا يغير نعمة أنعمها على أحد إلا بسبب ذنب ارتكبه كقوله تعالى \"إن الله لا يغير ما بقوم حتى يغيروا ما بأنفسهم وإذا أراد الله بقوم سوءا فلا مرد له وما لهم من دونه من وال\"."
    },
    {
      "ayah": 54,
      "surah": 8,
      "text": "وقوله \"كدأب آل فرعون\" أي كصنعه بآل فرعون وأمثالهم حين كذبوا بآياته أهلكهم بسبب ذنوبهم وسلبهم تلك النعم التي أسداها إليهم من جنات وعيون وزروع وكنوز ومقام كريم ونعمة كانوا فيها فاكهين وما ظلمهم الله في ذلك بل كانوا هم الظالمين."
    },
    { "ayah": 55, "surah": 8, "text": "أخبر تعالى أن شر ما دب على وجه الأرض هم الذين كفروا فهم لا يؤمنون." },
    {
      "ayah": 56,
      "surah": 8,
      "text": "الذين كلما عاهدوا عهدا نقضوه وكلما أكدوه بالأيمان نكثوه \"وهم لا يتقون\" أي لا يخافون من الله في شيء ارتكبوه من الآثام."
    },
    {
      "ayah": 57,
      "surah": 8,
      "text": "\"فإما تثقفنهم في الحرب\" أي تغلبهم وتظفر بهم في حرب \"فشرد بهم من خلفهم\" أي نكل بهم. قاله ابن عباس والحسن البصري والضحاك والسدي وعطاء الخراساني وابن عيينة ومعناه غلظ عقوبتهم وأثخنهم قتلا ليخاف من سواهم من الأعداء من العرب وغيرهم ويصيروا لهم عبرة \"لعلهم يذكرون\" وقال السدي يقول لعلهم يحذرون أن ينكثوا فيصنع بهم مثل ذلك."
    },
    {
      "ayah": 58,
      "surah": 8,
      "text": "يقول تعالى لنبيه صلى الله عليه وسلم \"وإما تخافن من قوم\" قد عاهدتهم \"خيانة\" أي نقضا لما بينك وبينهم من المواثيق والعهود \"فانبذ إليهم\" أي عهدهم \"على سواء\" أي أعلمهم بأنك قد نقضت عهدهم حتى يبقى علمك وعلمهم بأنك حرب لهم وهم حرب لك وأنه لا عهد بينك وبينهم على السواء أي تستوي أنت وهم في ذلك قال الراجز. فاضرب وجوه الغدر للأعداء حتى يجيبوك إلى السواء وعن الوليد بن مسلم أنه قال في قوله تعالى \"فانبذ إليهم على سواء\" أي على مهل \"إن الله لا يحب الخائنين\" أي حتى ولو في حق الكفار لا يحبها أيضا. قال الإمام أحمد حدثنا محمد بن جعفر حدثنا شعبة عن أبي الفيض عن سليم بن عامر قال: كان معاوية يسير في أرض الروم وكان بينه وبينهم أمد فأراد أن يدنو منهم فإذا انقضى الأمد غزاهم فإذا شيخ على دابة يقول: الله أكبر الله أكبر وفاء لا غدرا إن رسول الله صلى الله عليه وسلم قال \"ومن كان بينه وبين قوم عهد فلا يحلن عقدة ولا يشدها حتى ينقضي أمدها أو ينبذ إليهم على سواء\" قال فبلغ ذلك معاوية فرجع فإذا بالشيخ عمرو بن عنبسة رضي الله عنه وهذا الحديث رواه أبو داود الطيالسي عن شعبة وأخرجه أبو داود والترمذي والنسائي وابن حبان في صحيحه من طرق عن شعبة به. وقال الترمذي حسن صحيح. وقال الإمام أحمد أيضا حدثنا محمد بن عبدالله الزبيري حدثنا إسرائيل عن عطاء بن السائب عن أبي البختري عن سلمان يعني الفارسي رضي الله عنه أنه انتهى إلى حصن أو مدينة فقال لأصحابه دعوني أدعوهم كما رأيت رسول الله صلى الله عليه وسلم يدعوهم فقال إنما كنت رجلا منكم فهداني الله عز وجل للإسلام فان أسلمتم فلكم ما لنا وعليكم ما علينا وإن أبيتم فأدوا الجزية وأنتم صاغرون وإن أبيتم نابذناكم على سواء \"إن الله لا يحب الخائنين\" يفعل ذلك بهم ثلاثة أيام فلما كان اليوم الرابع غدا الناس إليها ففتحوها بعون الله."
    },
    {
      "ayah": 59,
      "surah": 8,
      "text": "يقول تعالى لنبيه صلى الله عليه وسلم \"ولا تحسبن\" يا محمد \"الذين كفروا سبقوا\" أي فاتونا فلا نقدر عليهم بل هم تحت قهر قدرتنا وفي قبضة مشيئتنا فلا يعجزوننا كقوله تعالى \"أم حسب الذين يعملون السيئات أن يسبقونا ساء ما يحكمون\" أي يظنون. وقوله \"ولا تحسبن الذين كفروا معجزين في الأرض ومأواهم النار ولبئس المصير\" وقوله تعالى \"لا يغرنك تقلب الذين كفروا في البلاد متاع قليل ثم مأواهم جهنم وبئس المهاد\" ثم أمر تعالى بإعداد آلات الحرب لمقاتلتهم حسب الطاقة والإمكان والاستطاعة."
    },
    {
      "ayah": 6,
      "surah": 8,
      "text": "\" وقال مجاهد يجادلونك في الحق: في القتال وقال محمد بن إسحق:\"يجادلونك في الحق\" أي كراهية للقاء المشركين وإنكارا لمسير قريش حين ذكروا له وقال السدي:\"يجادلونك في الحق بعد ما تبين\" أي بعد ما تبين لهم أنك لا تفعل إلا ما أمرك الله به. قال ابن جرير وقال آخرون عنى بذلك المشركين حدثنا يونس أنبأنا ابن وهب قال: قال ابن زيد في قوله تعالى \"يجادلونك في الحق بعد ما تبين كأنما يساقون إلى الموت وهم ينظرون\" قال هؤلاء المشركين جادلوه في الحق كأنما يساقون إلى الموت حين يدعون إلى الإسلام وهم ينظرون. قال وليس هذا من صفة الآخرين هذه صفة مبتدأة لأهل الكفر. ثم قال ابن جرير ولا معنى لما قاله لأن الذي قبل قوله \"يجادلونك في الحق\" خبر عن أهل الإيمان والذي يتلوه خبر عنهم. والصواب قول ابن عباس وابن إسحق أنه خبر عن المؤمنين وهذا الذي نصره ابن جرير هو الحق وهو الذي يدل عليه سياق الكلام والله أعلم."
    },
    {
      "ayah": 60,
      "surah": 8,
      "text": "فقال \"وأعدوا لهم ما استطعتم\" أي مهما أمكنكم \"من قوة ومن رباط الخيل\" قال الإمام أحمد: حدثنا هارون بن معروف حدثنا ابن وهب أخبرني عمرو بن الحارث عن أبي علي ثمامة بن شفي أخي عقبة بن عامر أنه سمع عقبة بن عامر يقول: سمعت رسول الله صلى الله عليه وسلم يقول وهو على المنبر \" \"وأعدوا لهم ما استطعتم من قوة\" ألا إن القوة الرمي ألا إن القوة الرمي\" رواه مسلم عن هرون بن معروف وأبو داود عن سعيد بن منصور وابن ماجه عن يونس بن عبدالأعلى ثلاثتهم عن عبدالله بن وهب به.ولهذا الحديث طرق أخر عن عقبة بن عامر منها ما رواه الترمذي من حديث صالح بن كيسان عن رجل عنه وروى الإمام أحمد وأهل السنن عنه قال: قال رسول الله صلى الله عليه وسلم \"ارموا واركبوا وأن ترموا خير من أن تركبوا\" وقال الإمام مالك عن زيد بن أسلم عن أبي صالح السمان عن أبي هريرة رضي الله عنه أن رسول الله صلى الله عليه وسلم قال \"الخيل لثلاثة: لرجل أجر ولرجل ستر وعلى رجل وزر فأما الذي له أجر فرجل ربطها في سبيل الله فأطال بها في مرج أو روضة فما أصابت في طيلها ذلك من المرج أو الروضة كانت له حسنات ولو أنها قطعت طيلها فاستنت شرفا أو شرفين كانت آثارها وأرواثها حسنات له ولو أنها مرت بنهر فشربت منه ولم يرد أن يسقي به كان ذلك حسنات له فهي لذلك الرجل أجر ورجل ربطها تغنيا وتعففا ولم ينس حق الله في رقابها ولا ظهورها فهي له ستر ورجل ربطها فخرا ورياء ونواء فهي على ذلك وزر\" وسئل رسول الله صلى الله عليه وسلم عن الحمر فقال \"ما أنزل الله على فيها شيئا إلا هذه الآية الجامعة الفاذة \"فمن يعمل مثقال ذرة خيرا يره ومن يعمل مثقال ذرة شرا يره\" رواه البخاري وهذا لفظه ومسلم كلاهما من حديث مالك وقال الإمام أحمد: حدثنا حجاج أخبرنا شريك عن الركين بن الربيع عن القاسم بن حسان عن عبدالله بن مسعود عن النبي صلى الله عليه وسلم قال \"الخيل ثلاثة: ففرس للرحمن وفرس للشيطان وفرس للإنسان فأما فرس الرحمن فالذي يربط في سبيل الله فعلفه وروثه وبوله - وذكر ما شاء الله - وأما فرس الشيطان فالذي يقامر أو يراهن عليها وأما فرس الإنسان فالفرس يربطها الإنسان يلتمس بطنها فهي له ستر من الفقر\" وقد ذهب أكثر العلماء إلى أن الرمي أفضل من ركوب الخيل وذهب الإمام مالك إلى أن الركوب أفضل من الرمي وقول الجمهور أقوى للحديث والله أعلم. وقال الإمام أحمد: حدثنا حجاج وهشام قالا حدثنا ليث حدثني يزيد بن أبي حبيب عن ابن شماسة أن معاوية بن خديج مر على أبي ذر وهو قائم عند فرس له فسأله ما تعاني من فرسك هذا؟ فقال إني أظن أن هذا الفرس قد استجيب له دعوته. قال وما دعاء بهيمة من البهائم؟ قال والذي نفسي بيده ما من فرس إلا وهو يدعو كل سحر فيقول: اللهم أنت خولتني عبدا من عبادك وجعلت رزقي بيده فاجعلني أحب إليه من أهله وماله وولده. قال وحدثنا يحيى بن سعيد عن عبدالحميد بن أبي جعفر حدثني يزيد بن أبي حبيب عن سويد بن قيس عن معاوية بن خديج عن أبي ذر رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم \"إنه ليس من فرس عربي إلا يؤذن له مع كل فجر يدعو بدعوتين يقول اللهم إنك خولتني من خولتني من بني آدم فاجعلني من أحب أهله وماله إليه - أو - أحب أهله وماله إليه\". رواه النسائي عن عمرو بن علي الفلاس عن يحيى القطان به. وقال أبو القاسم الطبراني حدثنا الحسين بن إسحق التستري حدثنا هشام بن عمار حدثنا يحيى بن حمزة حدثنا المطعم بن المقدام الصنعاني عن الحسن بن أبي الحسن أنه قال لابن الحنظلية يعني سهلا حدثنا حديثا سمعته من رسول الله صلى الله عليه وآله وسلم فقال سمعت رسول الله صلى الله عليه وآله وسلم يقول \" الخيل معقود في نواصيها الخير إلى يوم القيامة وأهلها معانون عليها ومن ربط فرسا في سبيل الله كانت النفقة عليها كالماد يده بالصدقة لا يقبضها\" والأحاديث الواردة في فضل ارتباط الخيل كثيرة. وفي صحيح البخاري عن عروة ابن أبي الجعد البارقي أن رسول الله صلى الله عليه وسلم قال \"الخيل معقود في نواصيها الخير إلى يوم القيامة الأجر والمغنم\". وقوله \"ترهبون\" أي تخوفون \"به عدو الله وعدوكم\" أي من الكفار \"وآخرين من دونهم\" قال مجاهد يعني بني قريظة وقال السدي: فارس وقال سفيان الثوري قال ابن يمان هم الشياطين التي في الدور وقد ورد حديث بمثل ذلك. قال ابن أبي حاتم حدثنا أبو عتبة أحمد بن الفرج الحمصي حدثنا أبو حيوة يعني شريح بن زيد المقري حدثنا سعيد بن سنان عن ابن غريب يعني يزيد بن عبدالله بن غريب عن أبيه عن جده أن رسول الله صلى الله عليه وسلم كان يقول في قول الله تعالى \"وآخرين من دونهم لا تعلمونهم\" قال هم الجن. ورواه الطبراني عن إبراهيم بن دحيم عن أبيه عن محمد بن شعيب عن سنان بن سعيد بن سنان عن يزيد بن عبدالله بن غريب به وزاد: قال رسول الله صلى الله عليه وسلم \"لا يخبل بيت فيه عتيق من الخيل\". وهذا الحديث منكر لا يصح إسناده ولا متنه وقال مقاتل بن حيان وعبدالرحمن بن زيد بن أسلم هم المنافقون وهذا أشبه الأقوال ويشهد له قوله تعالى \"وممن حولكم من الأعراب منافقون ومن أهل المدينة مردوا على النفاق لا تعلمهم نحن نعلمهم\" وقوله \"وما تنفقوا من شيء في سبيل الله يوف إليكم وأنتم لا تظلمون\" أي مهما أنفقتم في الجهاد فإنه يوفى إليكم على التمام والكمال ولهذا جاء في الحديث الذي رواه أبو داود أن الدرهم يضاعف ثوابه في سبيل الله إلى سبعمائة ضعف كما تقدم في قوله تعالى \"مثل الذين ينفقون أموالهم في سبيل الله كمثل حبة أنبتت سبع سنابل في كل سنبلة مائة حبة والله يضاعف لمن يشاء والله واسع عليم\" وقال ابن أبي حاتم حدثنا أحمد بن القاسم بن عطية حدثنا أحمد بن عبدالرحمن الدشتكي حدثنا أبي عن أبيه حدثنا الأشعث بن إسحق عن جعفر بن سعيد بن جبير عن ابن عباس عن النبي صلى الله عليه وسلم أنه كان يأمر أن لا يتصدق إلا على أهل الإسلام حتى نزلت \"وما تنفقوا من شيء في سبيل الله يوف إليكم\" فأمر بالصدقة بعدها على كل من سألك من كل دين وهذا أيضا غريب."
    },
    {
      "ayah": 61,
      "surah": 8,
      "text": "يقول تعالى إذا خفت من قوم خيانة فانبذ إليهم عهدهم على سواء فإن استمروا على حربك ومنابذتك فقاتلهم \"وإن جنحوا\" أي مالوا \"للسلم\" أي المسالمة والمصالحة والمهادنة \"فاجنح لها\" أي فمل إليها واقبل منهم ذلك ولهذا لما طلب المشركون عام الحديبية الصلح ووضع الحرب بينهم وبين رسول الله صلى الله عليه وآله وسلم تسع سنين أجابهم إلى ذلك مع ما اشترطوا من الشروط الأخر. وقال عبدالله بن الإمام أحمد حدثنا محمد بن أبي بكر المقدمي حدثني فضيل بن سليمان يعني النميري حدثنا محمد بن أبي يحيى عن إياس بن عمرو الأسلمي عن علي بن أبي طالب رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم \"إنه سيكون اختلاف أو أمر فإن استطعت أن يكون السلم فافعل\" وقال لمجاهد نزلت في بني قريظة وهذا فيه نظر لأن السياق كله في وقعة بدر وذكرها مكتنف لهذا كله وقال ابن عباس ومجاهد وزيد بن أسلم وعطاء الخراساني وعكرمة والحسن وقتادة: إن هذه الآية منسوخة بآية السيف في براءة \"قاتلوا الذين لا يؤمنون بالله ولا باليوم الآخر\" الآية. وفيه نظر أيضا لأن آية براءة فيها الأمر بقتالهم إذا أمكن ذلك فأما إن كان العدو كثيفا فإنه يجوز مهادنتهم كما دلت عليه هذه الآية الكريمة وكما فعل النبي صلى الله عليه وسلم يوم الحديبية فلا منافاة ولا نسخ ولا تخصيص والله أعلم. وقوله \"وتوكل على الله\" أي صالحهم وتوكل على الله فإن الله كافيك وناصرك."
    },
    {
      "ayah": 62,
      "surah": 8,
      "text": "ولو كانوا يريدون بالصلح خديعة ليتقوا ويستعدوا \"فإن حسبك الله\" أي كافيك وحده ثم ذكر نعمته عليه مما أيده به من المؤمنين المهاجرين والأنصار فقال \"هو الذي أيدك بنصره وبالمؤمنين وألف بين قلوبهم\" أي جمعها على الإيمان بك وعلى طاعتك ومناصرتك ومؤازرتك."
    },
    {
      "ayah": 63,
      "surah": 8,
      "text": "قوله: \"لو أنفقت ما في الأرض جميعا ما ألفت بين قلوبهم\" أي لما كان بينهم من العداوة والبغضاء فإن الأنصار كانت بينهم حروب كثيرة في الجاهلية بين الأوس والخزرج وأمور يلزم منها التسلسل في الشر حتى قطع الله ذلك بنور الإيمان كما قال تعالى \"واذكروا نعمة الله عليكم إذ كنتم أعداء فألف بين قلوبكم فأصبحتم بنعمته إخوانا وكنتم على شفا حفرة من النار فأنقذكم منها كذلك يبين الله لكم آياته لعلكم تهتدون\" وفي الصحيحين أن رسول الله صلى الله عليه وسلم لما خطب الأنصار في شأن غنائم حنين قال لهم \"يا معشر الأنصار ألم أجدكم ضلالا فهداكم الله بي وعالة فأغناكم الله بي وكنتم متفرقين فألفكم الله بي\" كلما قال شيئا قالوا الله ورسوله أَمَنُّ ولهذا قال تعالى \"ولكن الله ألف بينهم إنه عزيز حكيم\" أي عزيز الجناب فلا يخيب رجاء من توكل عليه حكيم في أفعاله وأحكامه وقال الحافظ أبو بكر البيهقي أخبرنا أبو عبيد الله الحافظ أنبأنا علي بن بشر الصيرفي القزويني في منزلنا أنبأنا أبو عبدالله محمد بن الحسين القنديلي الاسترباذي حدثنا أبو إسحق إبراهيم بن محمد بن النعمان الصفار حدثنا ميمون بن الحكم حدثنا بكر بن الشرود عن محمد بن مسلم الطائفي عن إبراهيم بن ميسرة عن طاوس عن ابن عباس قال قرابة الرحم تقطع ومنه النعمة تكفر ولم ير مثل تقارب القلوب يقول الله تعالى \"لو أنفقت ما في الأرض جميعا ما ألفت بين قلوبهم\" وذلك موجود في الشعر: إذا بت ذو قربى إليك بزلة فغشك واستغنى فليس بذي رحم ولكن ذا القربى الذي إن دعوته أجاب وإن يرمي العدو الذي ترمي قال ومن ذلك قول القائل: ولقد صحبت الناس ثم سبرتهم وبلوت ما وصلوا من الأسباب فإذا القرابة لا تقرب قاطعا وإذا المودة أقرب الأسباب قال البيهقي لا أدري هذا موصول بكلام ابن عباس أو هو من قول من دونه من الرواة وقال أبو إسحق السبيعي عن أبي الأحوص عن عبدالله بن مسعود رضي الله عنه سمعه يقول \"لو أنفقت ما في الأرض جميعا ما ألفت بين قلوبهم\" الآية. قال هم المتحابون في الله. وفي رواية نزلت في المتحابين في الله. رواه النسائي والحاكم في مستدركه وقال صحيح وقال عبدالرازق أخبرنا معمر عن ابن طاوس عن أبيه عن ابن عباس قال: إن الرحم لتقطع وإن النعمة لتكفر وإن الله إذا قارب بين القلوب لم يزحزحها شيء ثم قرأ \"لو أنفقت ما في الأرض جميعا ما ألفت بين قلوبهم\". رواه الحاكم أيضا وقال أبو عمر والأوزاعي حدثني عبدة بن أبي لبابة عن مجاهد ولقيته فأخذ بيدي فقال: إذا التقى المتحابان في الله فأخذ أحدهما بيد صاحبه وضحك إليه تحاتت خطاياهما كما تحات ورق الشجر. قال عبدة فقلت له إن هذا ليسير فقال: لا تقل ذلك فإن الله يقول \"لو أنفقت ما في الأرض جميعا ما ألفت بين قلوبهم\" قال عبدة فعرفت أنه أفقه مني وقال ابن جرير حدثنا أبو كريب حدثنا ابن يمان عن إبراهيم الجزري عن الوليد بن أبي مغيث عن مجاهد قال إذا التقى المسلمان فتصافحا غفر لهما قال: قلت لمجاهد بمصافحة يغفر لهما؟ قال مجاهد أما سمعته يقول \"لو أنفقت ما في الأرض جميعا ما ألفت بين قلوبهم ولكن الله ألف بينهم\" فقال الوليد لمجاهد أنت أعلم مني وكذا روى طلحة بن مصرف عن مجاهد وقال ابن عون عن عمير بن إسحق قال: كنا نتحدث أن أول ما يرفع من الناس الألفة وقال الحافظ أبو القاسم سليمان بن أحمد الطبراني رحمه الله حدثنا الحسين بن إسحق التستري حدثنا عبدالله بن عمر القواريري حدثنا سالم بن غيلان سمعت جعدا أبا عثمان حدثني أبو عثمان النهدي عن سلمان الفارسي أن رسول الله صلى الله عليه وآله وسلم قال \"إن المسلم إذا لقي أخاه المسلم فأخذ بيده تحاتت عنهما ذنوبهمـا كما تحات الورق عن الشجرة اليابسة في يوم ريح عاصف وإلا غفر لهما ذنوبهما ولو كانت مثل زبد البحار\"."
    },
    {
      "ayah": 64,
      "surah": 8,
      "text": "يحرض تعالى نبيه صلى الله عليه وسلم والمؤمنين على القتال ومناجزة الأعداء ومبارزة الأقران ويخبرهم أنه حسبهم أي كافيهم وناصرهم ومؤيدهم على عدوهم وإن كثرت أعدادهم وترادفت أمدادهم ولو قل عدد المؤمنين. قال ابن أبي حاتم حدثنا أحمد بن عثمان بن حكيم حدثنا عبيد الله بن موسى أنبأنا سفيان عن ابن شوذب عن الشعبي في قوله \"يا أيها النبي حسبك الله ومن اتبعك من المؤمنين\" قال حسبك الله وحسب من شهد معك قال وروي عن عطاء الخراساني وعبدالرحمن بن زيد مثله."
    },
    {
      "ayah": 65,
      "surah": 8,
      "text": "ولهذا قال \"يا أيها النبي حرض المؤمنين على القتال\" أي حثهم أو مرهم عليه ولهذا كان رسول الله صلى الله عليه وسلم يحرض على القتال عند صفهم ومواجهـة العدو كما قال لأصحابه يوم بدر حين أقبل المشركون في عددهم وعدتهم \"قوموا إلى جنة عرضها السموات والأرض\". فقال عمير بن الحمام عرضها السموات والأرض؟ فقال رسول الله صلى الله عليه وسلم \"نعم\" فقال بخ بخ فقال \"ما يحملك على قولك بخ بخ؟ \" قال رجاء أن أكون من أهلها قال \"فإنك من أهلها\" فتقدم الرجل فكسر جفن سيفه وأخرج تمرات فجعل يأكل منهن ثم ألقى بقيتهن من يده وقال: لئن أنا حييت حتى آكلهن إنها لحياة طويلة ثم تقدم فقاتل حتى قتل رضي الله عنه وقد روي عن سعيد بن المسيب وسعيد بن جبير أن هذه الآية نزلت حين أسلم عمر بن الخطاب وكمل به الأربعون وفي هذا نظر لأن هذه الآية مدنية وإسلام عمر كان بمكة بعد الهجرة إلى أرض الحبشة وقبل الهجرة إلى المدينة والله أعلم. ثم قال تعالى مبشرا للمؤمنين وآمرا \"إن يكن منكم عشرون صابرون يغلبوا مائتين وإن يكن منكم مائة يغلبوا ألفا من الذين كفروا\" كل واحد بعشرة ثم نسخ هذا الأمر وبقيت البشارة. قال عبدالله بن المبارك حدثنا جرير بن حازم حدثني الزبير بن الحريث عن عكرمة عن ابن عباس قال: لما نزلت \"إن يكن منكم عشرون صابرون يغلبوا مائتين\" شق ذلك على المسلمين حتى فرض الله عليهم أن لا يفر واحد من عشرة ثم جاء التخفيف."
    },
    {
      "ayah": 66,
      "surah": 8,
      "text": "فقال \"الآن خفف الله عنكم\" إلى قوله \"يغلبوا مائتين\" قال خفف الله عنهم من العدة ونقص من الصبر بقدر ما خفف عنهم. وروى البخاري من حديث ابن المبارك نحوه. وقال سعيد بن منصور حدثنا سفيان عن عمرو بن دينار عن ابن عباس في هذه الآية قال: كتب عليهم أن لا يفر عشرون من مائتين ثم خفف الله عنهم فقال \"الآن خفف الله عنكم وعلم أن فيكم ضعفا\" فلا ينبغي لمائة أن يفروا من مائتين وروى البخاري عن علي بن عبدالله عن سفيان به نحوه وقال محمد بن إسحق حدثني ابن أبي نجيح عن عطاء عن ابن عباس قال لما نزلت هذه الآية ثقلت على المسلمين وأعظموا أن يقاتل عشرون مائتين ومائة ألف فخفف الله عنهم فنسخها بالآية الأخرى فقال \"الآن خفف الله عنكم وعلم أن فيكم ضعفا\" الآية. فكانوا إذا كانوا على الشطر من عدوهم لم يسغ لهم أن يفروا من عدوهم وإذا كانوا دون ذلك لم يجب عليهم قتالهم وجازلهم أن يتحوزوا عنهم وروى علي بن أبي طلحة والعوفي عن ابن عباس نحو ذلك قال ابن أبي حاتم وروى عن مجاهد وعطاء وعكرمة والحسن وزيد بن أسلم وعطاء الخراساني والضحاك وغيرهم نحو ذلك وروى الحافظ أبو بكر بن مردويه من حديث المسيب بن شريك عن ابن عون عن نافع عن ابن عمر رضي الله عنهما في قوله \"إن يكن منكم عشرون صابرون يغلبوا مائتين\" قال نزلت فينا أصحاب محمد صلى الله عليه وسلم وروى الحاكم في مستدركه من حديث أبي عمرو بن العلاء عن نافع عن ابن عمر أن رسول الله صلى الله عليه وسلم قرأ \"الآن خفف الله عنكم وعلم أن فيكم ضعفا\" رفع ثم قال صحيح الإسناد ولم يخرجاه."
    },
    {
      "ayah": 67,
      "surah": 8,
      "text": "قال الإمام أحمد حدثنا علي بن هاشم عن حميد عن أنس رضي الله عنه قال استشار النبي صلى الله عليه وسلم الناس في الأسارى يوم بدر فقال \"إن الله قد أمكنكم منهم\" فقام عمر بن الخطاب فقال يا رسول الله اضرب أعناقهم فأعرض عنه النبي صلى الله عليه وسلم ثم عاد رسول الله صلى الله عليه وسلم فقال \" ياأيها الناس إن الله قد. أمكنكم منهم وإنما هم إخوانكم بالأمس\" فقام عمر فقال: يارسول الله اضرب أعناقهم فأعرض عنه النبي صلى الله عليه وسلم فقال للناس مثل ذلك فقام أبو بكر الصديق رضي الله عنه فقال يا رسول الله نرى أن تعفو عنهم وأن تقبل منهم الفداء قال فذهب عن وجه رسول الله صلى الله عليه وسلم ما كان فيه من الغم فعفا عنهم وقبل منهم الفداء."
    },
    {
      "ayah": 68,
      "surah": 8,
      "text": "قال وأنزل الله عز وجل \"لولا كتاب من الله سبق لمسكم فيما أخذتم عذاب عظيم\" وقد سبق في أول السورة حديث ابن عباس في صحيح مسلم بنحو ذلك وقال الأعمش عن عمر بن مرة عن أبي عبيدة عن عبدالله قال لما كان يوم بدر قال رسول الله صلى الله عليه وسلم \"ما تقولون في هؤلاء الأسارى؟ \" فقال أبو بكر يا رسول الله قومك وأهلك استبقهم واستتبهم لعل الله أن يتوب عليهم وقال عمر يا رسول الله كذبوك وأخرجوك فقدمهم فاضرب أعناقهم وقال عبدالله بن رواحة يا رسول الله أنت في واد كثير الحطب فأضرم الوادي عليهم نارا ثم ألقهم فيه قال فسكت رسول الله صلى الله عليه وسلم فلم يرد عليهم شيئا ثم قام فدخل فقال: ناس يأخذ بقول أبي بكر وقال ناس:يأخذ بقول عمر وقال ناس: يأخذ بقول عبدالله بن رواحة ثم خرج عليهم رسول الله صلى الله عليه وسلم فقال: \"إن الله ليلين قلوب رجال حتى تكون ألين من اللبن وإن الله ليشدد قلوب رجال فيه حتى تكون أشد من الحجارة وإن مثلك يا أبا بكر كمثل إبراهيم عليه السلام قال \"فمن تبعني فأنه مني ومن عصاني فإنك غفور رحيم\" وإن مثلك يا أبا بكر كمثل عيسى عليه السلام قال \"إن تعذبهم فإنهم عبادك وإن تغفر لهم فإنك أنت العزيز الحكيم\" وإن مثلك يا عمر كمثل موسى عليه السلام قال \"ربنا اطمس على أموالهم واشدد على قلوبهم فلا يؤمنوا حتى يروا العذاب الأليم\" وإن مثلك يا عمر كمثل نوح عليه السلام قال \"رب لا تذر على الأرض من الكافرين ديارا\" أنتم عالة فلا ينفكن أحد منهم إلا بفداء أو ضربة عنق\" قال ابن مسعود قلت: يا رسول الله إلا سهيل بن بيضاء فإنه يذكر الإسلام فسكت رسول الله صلى الله عليه وسلم فما رأيتني في يوم أخوف من أن تقع علي حجارة من السماء مني في ذلك اليوم حتى قال رسول الله صلى الله عليه وسلم \"إلا سهيل بن بيضاء\" فأنزل الله عز وجل \"ما كان لنبي أن يكون له أسرى\" إلى آخر الآية. رواه الإمام أحمد والترمذي من حديث أبي معاوية عن الأعمش به والحاكم في مستدركه وقال صحيح الإسناد ولم يخرجاه وروى الحافظ أبو بكر بن مردويه عن عبدالله بن عمر وأبو هريرة رضي الله عنهما عن النبي صلى الله عليه وسلم نحوه. وفي الباب عن أبي أيوب الأنصاري وروى ابن مردويه أيضا واللفظ له والحاكم في مستدركه من حديث عبيد الله بن موسى حدثنا إسرائيل عن إبراهيم بن مهاجر عن مجاهد عن ابن عمر قال لما أسر الأسارى يوم بدر أسر العباس فيمن أسر أسره رجل من الأنصار قال وقد أوعدته الأنصار أن يقاتلوه فبلغ ذلك النبي صلى الله عليه وسلم فقال رسول الله صلى الله عليه وسلم \"إني لم أنم الليلة من أجل عمي العباس وقد زعمت الأنصار أنهم قاتلوه\". فقال له عمر أفآتهم فقال \"نعم\" فأتى عمر الأنصار فقال لهم أرسلوا العباس فقالوا لا والله لا نرسله فقال لهم عمر فإن كان لرسول الله صلى الله عليه وسلم رضى قالوا فإن كان لرسول الله صلى الله عليه وسلم رضى فخذه فأخذه عمر فلما صار في يده قال له يا عباس أسلم فوالله لئن تسلم أحب إلي من أن يسلم الخطاب وما ذاك إلا لما رأيت رسول الله صلى الله عليه وسلم يعجبه إسلامك قال واستشار رسول الله صلى الله عليه وسلم أبا بكر فيهم فقال أبو بكر عشيرتك فأرسلهم فاستشار عمر فقال اقتلهم ففاداهم رسول الله صلى الله عليه وسلم فأنزل الله \"ما كان لنبي أن يكون له أسرى\" الآية. قال الحاكم صحيح الإسناد ولم يخرجاه وقال سفيان الثوري عن هشام بن حسان عن محمد بن سيرين عن عبيدة عن علي رضي الله عنه قال جاء جبريل إلى النبي صلى الله عليه وسلم يوم بدر فقال خير أصحابك في الأسارى إن شاءوا الفداء وإن شاءوا القتل على أن يقتل عاما مقبلا منهم مثلهم قالوا الفداء ويقتل منا رواه الترمذي والنسائي وابن حبان في صحيحها من حديث الثوري به وهذا حديث غريب جدا وقال ابن عون عن عبيدة عن علي قال: قال رسول الله صلى الله عليه وسلم في أسارى يوم بدر \"إن شئتم قتلتموهم وإن شئتم فاديتموه واستمتعتم بالفداء واستشهد منكم بعدتهم\" قال فكان آخر السبعين ثابت بن قيس قتل يوم اليمامة رضي الله عنه ومنهم من روى هذا الحديث عن عبيدة مرسلا فالله أعلم. وقال محمد بن إسحق عن ابن أبي نجيح عن عطاء عن ابن عباس \"ما كان لنبي أن يكون له أسرى\" فقرأ حتى بلغ \"عذاب عظيم\". قال غنائم بدر قبل أن يحلها لهم يقول لولا أني لا أعذب من عصاني حتى أتقدم إليه لمسكم فيما أخذتم عذاب عظيم. وكذا روى ابن أبي نجيح عن مجاهد وقال الأعمش سبق منه أن لا يعذب أحدا شهد بدرا وروى نحوه عن سعد بن أبي وقاص وسعيد بن جبير وعطاء وقال شعبة عن أبي هاشم عن مجاهد \"لولا كتاب من الله سبق\" أي لهم بالمغفرة ونحوه عن سفيان الثوري رحمه الله وقال علي بن أبي طلحة عن ابن عباس في قوله \"لولا كتاب من الله سبق\" يعني في أم الكتاب الأول أن المغانم والأسارى حلال لكم \"لمسكم فيما أخذتم\" من الأسارى \"عذاب عظيم\"."
    },
    {
      "ayah": 69,
      "surah": 8,
      "text": "قال الله تعالى \"فكلوا ما غنمتم حلالا طيبا\" الآية. وكذا روى العوفي عن ابن عباس وروى مثله عن أبي هريرة وابن مسعود وسعيد بن جبير وعطاء والحسن البصري وقتادة والأعمش أيضا أن المراد \"لولا كتاب من الله سبق\" لهذه الأمة بإحلال الغنائم وهو اختيار ابن جرير رحمه الله ويستشهد لهذا القول بما أخرجاه في الصحيحين عن جابر بن عبدالله رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم \"أعطيت خمسا لم يعطهن أحد من الأنبياء قبلي نصرت بالرعب مسيرة شهر وجعلت لي الأرض مسجدا وطهورا وأحلت لي الغنائم ولم تحل لأحد قبلي وأعطيت الشفاعة وكان النبي يبعث إلى قومه وبعثت إلى الناس عامة\" وقال الأعمش عن أبي صالح عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم \"لم تحل الغنائم لسود الرءوس غيرنا\" ولهذا قال تعالى \"فكلوا مما غنمتم حلالا طيبا\" الآية. فعند ذلك أخذوا من الأسارى الفداء وقد روى الإمام أبو داود في سننه حدثنا عبدالرحمن بن المبارك العبسي حدثنا سفيان بن حبيب حدثنا شعبة عن أبي العنبس عن أبي الشعثاء عن ابن عباس أن رسول الله صلى الله عليه وسلم جعل فداء أهل الجاهلية يوم بدر أربعمائة وقد استمر الحكم في الأسرى عند جمهور العلماء أن الإمام مخير فيهم إن شاء قتل كما فعل ببني قريظة وإن شاء فادى بمال كما فعل بأسرى بدر أو بمن أسر من المسلمين كما فعل رسول الله صلى الله عليه وسلم في تلك الجارية وابنتها اللتين كانتا في سبي سلمة بن الأكوع حيث ردهما وأخذ في مقابلتهما من المسلمين الذين كانوا عند المشركين وإن شاء استرق من أسر. هذا مذهب الإمام الشافعي وطائفة من العلماء وفي المسألة خلاف آخر بين الأئمة مقرر في موضعه من كتب الفقه."
    },
    {
      "ayah": 7,
      "surah": 8,
      "text": "وقال الإمام أحمد رحمه الله حدثنا يحيى بن بكير وعبدالرزاق قالا: حدثنا إسرائيل عن سماك عن عكرمة عن ابن عباس قال: قيل لرسول الله صلى الله عليه وسلم حين فرغ من بدر عليك بالعير ليس دونها شيء فناداه العباس بن عبدالمطلب قال عبدالرزاق وهو أسير في وثاقه إنه لا يصلح لك. قال ولم؟ قال لأن الله عز وجل إنما وعدك إحدى الطائفتين وقد أعطاك الله ما وعدك إسناد جيد ولم يخرجه ومعنى قوله تعالى \"وتودون أن غير ذات الشوكة تكون لكم \" أي يحبون أن الطائفة التي لا حد لها ولا منعة ولا قتال تكون لهم وهي العير \"ويريد الله أن يحق الحق بكلماته \"أي هو يريد أن يجمع بينكم وبين الطائفة التي لها الشوكة والقتال ليظفركم بهم وينصركم عليهم. ويظهر دينه ويرفع كلمة الإسلام ويجعله غالبا على الأديان وهو أعلم بعواقب الأمور وهو الذي يدبركم بحسن تدبيره وإن كان العباد يحبون خلاف ذلك فيما يظهر لهم كقوله تعالى \"كتب عليكم القتال وهو كره لكم وعسى أن تكرهوا شيئا وهو خير لكم وعسى أن تحبوا شيئا وهو شر لكم\" وقال محمد بن إسحق رحمه الله حدثني محمد بن مسلم الزهري وعاصم بن عمر بن قتادة وعبدالله بن أبي بكر ويزيد بن رومان عن عروة بن الزبير وغيرهم من علمائنا عن عبدالله بن عباس كل قد حدثني بعض هذا الحديث فاجتمع حديثهم فيما سقت من حديث بدر قالوا لما سمع رسول الله صلى الله عليه وسلم بأبي سفيان مقبلا من الشام ندب المسلمين إليهم. وقال هذه عير قريش فيها أموالهم فاخرجوا إليها لعل الله أن ينفلكموها فانتدب الناس فخف بعضهم وثقل بعضهم وذلك أنهم لم يظنوا أن رسول الله صلى الله عليه وسلم يلقى حربا وكان أبو سفيان قد أستنفر حين دنا من الحجاز يتجسس الأخبار. ويسأل من لقي من الركبان تخوفا على أمر الناس حتى أصاب خبرا من بعض الركبان أن محمدا قد استنفر أصحابه لك ولعيرك فحذر عند ذلك فاستأجر ضمضم بن عمرو الغفاري فبعثه إلى أهل مكة وأمره أن يأتي قريشا فيستنفرهم إلى أموالهم ويخبرهم أن محمدا قد عرض لها في أصحابه فخرج ضمضم بن عمرو سريعا إلى مكة وخرج رسول الله صلى الله عليه وسلم في أصحابه حتى بلغ واديا يقال له ذفران فخرج منه حتى إذا كان ببعضه نزل وأتاه الخبر عن قريش بمسيرهم ليمنعوا عيرهم فاستشار رسول الله صلى الله عليه وسلم الناس وأخبرهم عن قريش فقام أبو بكر رضي الله عنه فقال فأحسن. ثم قام عمر رضي الله عنه فقال فأحسن. ثم قام المقداد بن عمرو فقال يا رسول الله أمض لما أمرك الله به فنحن معك والله لا نقول لك كما قالت بنو إسرائيل لموسى \"فاذهب أنت وربك فقاتلا إنا ههنا قاعدون\" ولكن اذهب أنت وربك فقاتلا إنا معكما مقاتلون فوالذي بعثك بالحق لو سرت بنا إلى برك الغماد - يعني مدينة الحبشة - لجالدنا معك من دونه حتى تبلغه فقال له رسول الله صلى الله عليه وعلى آله وسلم خيرا ودعا له بخير ثم قال رسول الله صلى الله عليه وسلم:\"أشيروا علي أيها الناس\" وإنما يريد الأنصار وذلك أنهم كانوا عدد الناس وذلك أنهم حين بايعوه بالعقبة قالوا يا رسول الله إنا برآء من ذمامك حتى تصل إلى دارنا فإذا وصلت إلينا فأنت في ذمامنا نمنعك مما نمنع منه أبناءنا ونساءنا وكان رسول الله صلى الله عليه وسلم يتخوف أن لا تكون الأنصار ترى عليها نصرته إلا ممن دهمه بالمدينة من عدوه وأن ليس عليهم أن يسير بهم إلى عدو من بلادهم فلما قال رسول الله صلى الله عليه وسلم ذلك قال له سعد بن معاذ والله لكأنك تريدنا يا رسول الله؟ قال: \"أجل\" فقال: فقد آمنا بك وصدقناك وشهدنا أن ما جئت به هو الحق وأعطيناك على ذلك عهودنا ومواثيقنا على السمع والطاعة فامض يا رسول الله لما أمرك الله فوالذي بعثك بالحق إن استعرضت بنا هذا البحر فخضته لخضناه معك ما يتخلف منا رجل واحد وما نكره أن تلقى بنا عدونا غدا إنا لصبر عند الحرب صدق عند اللقاء ولعل الله يريك منا ما تقر به عينك فسر بنا على بركة الله فسر رسول الله صلى الله عليه وسلم بقول سعد ونشطه ذلك ثم قال:\"سيروا على بركة الله وأبشروا فإن الله قد وعدني إحدى الطائفتين والله لكأني الآن أنظر إلى مصارع القوم\" وروى العوفي عن ابن عباس نحو هذا وكذلك قال السدي وقتادة وعبدالرحمن بن زيد بن أسلم وغير واحد من علماء السلف والخلف اختصرنا أقوالهم اكتفاء بسياق محمد بن إسحق."
    },
    {
      "ayah": 70,
      "surah": 8,
      "text": "قال محمد بن إسحق: حدثني العباس بن عبدالله بن مغفل عن بعض أهله عن عبدالله بن عباس رضي الله عنهما أن رسول الله صلى الله عليه وسلم قال يوم بدر \"إني عرفت أن أناسا من بني هاشم وغيرهم قد أخرجوا كرها لا حاجة لهم بقتالنا فمن لقى منكم أحدا منهم - أي من بني هاشم فلا يقتله ومن لقي أبا البختري بن هشام فلا يقتله ومن لقي العباس بن عبدالمطلب فلا يقتله فإنه إنما أخرج مستكرها\" فقال أبو حذيفة بن عتبة أنقتل آباءنا وأبناءنا وإخواننا وعشائرنا ونترك العباس والله لئن لقيته لألجمنه بالسيف فبلغت رسول الله صلى الله عليه وسلم فقال لعمر بن الخطاب \"يا أبا حفص - قال عمر والله إنه لأول يوم كناني فيه رسول الله صلى الله عليه وسلم \"أبا حفص\" - أيضرب وجه عم رسول الله صلى الله عليه وسلم بالسيف؟ \" فقال عمر: يا رسول الله ائذن لي فأضرب عنقه فوالله لقد نافق فكان أبو حذيفة يقول بعد ذلك والله ما آمن من تلك الكلمة التي قلت ولا أزال منها خائفا إلا أن يكفرها الله تعالى عني بشهادة فقتل يوم اليمامة شهيدا رضي الله عنه. وبه عن ابن عباس قال: لما أمسى رسول الله صلى الله عليه وسلم يوم بدر والأسارى محبوسون بالوثاق بات رسول الله صلى الله عليه وسلم ساهرا أول الليل فقال له أصحابه يا رسول الله مالك لا تنام؟ وقد أسر العباس رجل من الأنصار فقال رسول الله صلى الله عليه وسلم \"سمعت أنين عمي العباس في وثاقه فأطلقوه\" فسكت فنام رسول الله صلى الله عليه وسلم قال محمد بن إسحق وكان أكثر الأسارى يوم بدر فداء العباس ابن عبدالمطلب وذلك أنه كان رجلا موسرا فافتدى نفسه بمائة أوقية ذهبا وفي صحيح البخاري من حديث موسى بن عقبة قال ابن شهاب: حدثنا أنس بن مالك أن رجالا من الأنصار قالوا يا رسول الله ائذن لنا فلنترك لابن أختنا عباس فداءه. قال \"لا والله لا تذرون منه درهما\" وقال يونس بن بكير عن محمد بن إسحق عن يزيد بن رومان عن عروة عن الزهري عن جماعة سماهم قالوا: بعثت قريش إلى رسول الله صلى الله عليه وسلم في فداء أسراهم ففدى كل قوم أسيرهم بما رضوا وقال العباس: يا رسول الله قد كنت مسلما فقال رسول الله صلى الله عليه وسلم \"الله أعلم بإسلامك فإن يكن كما تقول فإن الله يجزيك وأما ظاهرك فقد كان علينا فافتد نفسك وابني أخيك نوفل بن الحارث بن عبدالمطلب وعقيل بن أبي طالب بن عبدالله وحليفك عتبة بن عمرو أخي بني الحارث بن فهر\" قال ما ذاك عندي يا رسول الله قال \"فأين المال الذي دفنته أنت وأم الفضل؟ فقلت لها إن أصبت في سفري هذا فهذا المال الذي دفنته لبني الفضل وعبدالله وقثم\" قال والله يا رسول الله إني لأعلم أنك رسول الله إن هذا لشيء ما علمه أحد غيري وغير أم الفضل فاحسب لي يا رسول الله ما أصبتم مني عشرين أوقية من مال كان معي فقال رسول الله صلى الله عليه وسلم \"لا: ذاك شيء أعطانا الله تعالى منك\" ففدى نفسه وابني أخويه وحليفه فأنزل الله عز وجل \"يا أيها النبي قل لمن في أيديكم من الأسرى أن يعلم الله في قلوبكم خيرا يؤتكم خيرا مما أخذ منكم ويغفر لكم والله غفور رحيم\" قال العباس: فأعطاني الله مكان العشرين الأوقية في الإسلام عشرين عبدا كلهم في يده مال يضرب به مع ما أرجوا من مغفرة الله عز وجل وقد روى ابن إسحق أيضا عن ابن أبي نجيح عن عطاء عن ابن عباس في هذه الآية بنحو مما تقدم. وقال أبو جعفر بن جرير: حدثنا ابن وكيع حدثنا ابن إدريس عن ابن أبي نجيح عن مجاهد عن ابن عباس قال: قال العباس فيَّ نزلت \"ما كان لنبي أن يكون له أسرى حتى يثخن في الأرض\" فأخبرت النبي صلى الله عليه وسلم بإسلامي وسألته أن يحاسبني بالعشرين الأوقية التي أخذت مني فأبى فأبدلني الله بها عشرين عبدا كلهم تاجر مالي في يده وقال ابن إسحق أيضا حدثني الكلبي عن أبي صالح عن ابن عباس رضي الله عنهما عن جابر بن عبدالله ابن رباب قال: كان العباس بن عبدالمطلب يقول في نزلت والله حين ذكرت لرسول الله صلى الله عليه وسلم إسلامي ثم ذكر نحو الحديث الذي قبله. وقال ابن جريج عن عطاء الخراساني عن ابن عباس \"يا أيها النبي قل لمن في أيديكم من الأسرى\" عباس وأصحابه قال: قالوا للنبي صلى الله عليه وسلم آمنا بما جئت ونشهد أنك رسول الله لننصحن لك على قومنا. فأنزل الله \"إن يعلم الله في قلوبكم خيرا يؤتكم خيرا مما أخذ منكم \"إيمانا وتصديقا يخلف لكم خيرا مما أخذ منكم\" ويغفر لكم\" الشرك الذي كنتم عليه. قال فكان العباس يقول: ما أحب أن هذه الآية لم تنزل فينا وإن لي الدنيا فقد قال \"يؤتكم خيرا مما أخذ منكم\" فقد أعطاني خيرا مما أخذ مني مائة ضعف وقال \"ويغفر لكم\" وأرجو أن يكون قد غفر لي وقال علي بن أبي طلحة عن ابن عباس في هذة الآية: كان العباس أسرا يوم بدر فافتدى نفسه بأربعين أوقية من ذهب فقال العباس حين قرئت هذه الآية لقد أعطاني الله عز وجل خصلتين ما أحب أن لي بهما الدنيا: أني أسرت يوم بدر ففديت نفسي بأربعين أوقية فآتاني أربعين عبدا وإني لأرجو المغفرة التي وعدنا الله عز وجل. فقال قتادة في تفسير هذه الآية: ذكر لنا أن رسول الله صلى الله عليه وسلم لما قدم عليه مال البحرين ثمانون ألفا وقد توضأ لصلاة الظهر فما أعطى يومئذ شاكيا ولا حرم سائلا وما صلى يومئذ حتى فرقه فأمر العباس أن يأخذ منه ويحتثي فكان العباس يقول: هذا خير مما أخذ منا وأرجو المغفرة وقال يعقوب بن سفيان: حدثنا عمرو بن عاصم حدثنا سليمان بن المغيرة عن حميد بن هلال قال: بعث ابن الحضرمي إلى رسول الله صلى الله عليه وسلم من البحرين ثمانين ألفا ما أتاه مال أكثر منه لا قبل ولا بعد. قال فنثرت على حصير ونودي بالصلاة. قال وجاء رسول الله صلى الله عليه وسلم فمثل قائما على المال وجاء أهل المسجد فما كان يومئذ عدد ولا وزن ما كان إلا فيضا وجاء العباس بن عبدالمطلب فحثا في خميصة عليه وذهب يقوم فلم يستطع قال فرفع رأسه إلى رسول الله صلى الله عليه وسلم فقال: يا رسول الله ارفع علي. قال فتبسم رسول الله صلى الله عليه وسلم حتى خرج ضاحكه أو نابه وقال له \"أعد من المال طائفة وقم بما تطيق\" قال ففعل وجعل العباس يقول: وهو منطلق أمَّا إحدى اللتين وعدنا الله فقد أنجزنا وما ندري ما يصنع في الأخرى \"يا أيها النبي قل لمن في أيديكـم من الأسرى\" الآية ثم قال هذا خير مما أخذ منا وما أدري ما يصنع الله في الأخرى فما زال رسول الله صلى الله عليه وسلم ماثلا على ذلك المال حتى ما بقي منه درهم وما بعث إلى أهله بدرهم ثم أتى الصلاة فصلى. \"حديث آخر في ذلك\" قال الحافظ أبو بكر البيهقي: أنبأنا أبو عبدالله الحافظ أخبرني أبو الطيب محمد بن محمد بن عبدالله السعيدي حدثنا محمد بن عصام حدثنا حفص بن عبدالله حدثنا إبراهيم بن طهمان عن عبدالعزيز بن صهيب عن أنس بن مالك قال: أتي رسول الله صلى الله عليه وسلم بمال من البحرين فقال \"انثروه في مسجدي\" قال وكان أكثر مال أتي به رسول الله صلى الله عليه وسلم فخرج إلى الصلاة ولم يلتفت إليه فلما قضى الصلاة جاء فجلس إليه فما كان يرى أحدا إلا أعطاه إذ جاءه العباس فقال يا رسول الله أعطني فإني فاديت نفسي وفاديت عقيلا فقال له رسول الله صلى الله عليه وسلم \"خذ\" فحثا في ثوبه ثم ذهب يقله فلم يستطع فقال مر بعضهم يرفعه إليَّ قال \"لا\" قال فارفعه أنت علي قال \"لا\" فنثر منه ثم احتمله على كاهله ثم انطلق فما زال رسول الله صلى الله عليه وسلم يتبعه بصره حتى خفي عنه عجبا من حرصه فما قام رسول الله صلى الله عليه وسلم وثم منها درهم وقد رواه البخاري في مواضع من صحيحه تعليقا بصيغة الجزم يقول: وقال إبراهيم بن طهمان ويسوقه وفي بعض السياقات أتم من هذا."
    },
    {
      "ayah": 71,
      "surah": 8,
      "text": "وقوله \"وإن يريدوا خيانتك فقد خانوا الله من قبل\" أي \"وإن يريدوا خيانتك\" فيما أظهروا لك من الأقوال \"فقد خانوا الله من قبل\" أي من قبل بدر بالكفر به \"فأمكن منهم\" أي بالأسارى يوم بدر \"والله عليم حكيم\" أي عليم بفعله حكيم فيه قال قتادة: نزلت في عبدالله بن سعد بن أبي سرح الكاتب حين ارتد ولحق بالمشركين وقال ابن جريج عن عطاء الخراساني عن ابن عباس: نزلت في عباس وأصحابه حين قالوا لننصحن لك على قومنا وفسرها السدي على العموم وهو أشمل وأظهر والله أعلم."
    },
    {
      "ayah": 72,
      "surah": 8,
      "text": "ذكر تعالى أصناف المؤمنين وقسمهم إلى مهاجرين خرجوا من ديارهم وأموالهم وجاءوا لنصر الله ورسوله وإقامة دينه وبذلوا أموالهم وأنفسهم في ذلك وإلى أنصار وهم المسلمون من أهل المدينة إذ ذاك آووا إخوانهم المهاجرين في منازلهم وواسوهم في أموالهم ونصروا الله ورسوله بالقتال معهم فهؤلاء \"بعضهم أولياء بعض\" أي كل منهم أحق بالآخر من كل وأحد ولهذا آخى رسول الله صلى الله عليه وسلم بين المهاجرين والأنصار كل اثنين أخوان فكانوا يتوارثون بذلك إرثا مقدما على القرابة حتى نسخ الله تعالى ذلك بالمواريث. ثبت ذلك في صحيح البخاري عن ابن عباس ورواه العوفي وعلي بن أبي طلحة عنه وقال مجاهد وعكرمة والحسن وقتادة وغير واحد. قال الإمام أحمد: حدثنا وكيع عن شريك عن عاصم عن أبي وائل عن جرير وهو ابن عبدالله البجلي رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم \"المهاجرون والأنصار بعضهم أولياء بعض والطلقاء من قريش والعتقاء من ثقيف بعضهم أولياء بعض إلى يوم القيامة\" تفرد به أحمد. وقال الحافظ أبو يعلى: حدثنا سفيان حدثنا عكرمة يعني ابن إبراهيم الأزدي حدثنا عاصم عن شقيق عن ابن مسعود قال: سمعت رسول الله صلى الله عليه وسلم يقول \"المهاجرون والأنصار والطلقاء من قريش والعتقاء من ثقيف بعضهم أولياء بعض في الدنيا والآخرة\" هكذا رواه في مسند عبدالله بن مسعود. وقد أثنى الله ورسوله على المهاجرين والأنصار في غير ما آية في كتابه فقال \"والسابقون الأولون من المهاجرين والأنصار والذين اتبعوهم بإحسان رضي الله عنهم ورضوا عنه وأعد لهم جنات تجري من تحتها الأنهار\" الآية وقال \"لقد تاب الله على النبي والمهاجرين والأنصار الذين اتبعوه في ساعة العسرة\" الآية وقال تعالى \"للفقراء المهاجرين الذين أخرجوا من ديارهم وأموالهم يبتغون فضلا من الله ورضوانا وينصرون الله ورسوله أولئك هم الصادقون والذين تبوءوا الدار والإيمان من قبلهم يحبون من هاجر إليهم ولا يجدون في صدورهم حاجة مما أوتوا ويؤثرون على أنفسهم ولو كان بهم خصاصة\" الآية وأحسن ما قيل في قوله \"ولا يجدون في صدورهم حاجة مما أوتوا\" أي لا يحسدونهم على فضل ما أعطاهم الله على هجرتهم فإن ظاهر الآيات تقديم المهاجرين على الأنصار وهذا أمر مجمع عليه بين العلماء لا يختلفون في ذلك ولهذا قال الإمام أبو بكر أحمد بن عمرو بن عبدالخالق البزار في مسنده: حدثنا محمد بن معمر حدثنا مسلم بن إبراهيم حدثنا حماد بن سلمة عن علي بن زيد عن سعيد بن المسيب عن حذيفة قال: خيرني رسول الله صلى الله عليه وسلم بين الهجرة والنصرة فاخترت الهجرة ثم قال لا نعرفه إلا من هذا الوجه وقوله تعالى \"والذين آمنوا ولم يهاجروا ما لكم من ولايتهم\" قرأ حمزة ولايتهم بالكسر والباقون بالفتح وهما واحد كالدلالة والدلالة \"من شيء حتى يهاجروا\" هذا هو الصنف الثالث من المؤمنين وهم الذين آمنوا ولم يهاجروا بل أقاموا في بواديهم فهؤلاء ليس لهم في المغانم نصيب ولا في خمسها إلا ما حضروا فيه القتال. كما قال أحمد: حدثنا وكيع حدثنا سفيان عن علقمة بن مرثد عن سليمان بن بريدة عن أبيه عن يزيد بن الخصيب الأسلمي رضي الله عنه قال: كان رسول الله صلى الله عليه وسلم إذا بعث أميرا على سرية أو جيش أوصاه في خاصة نفسه بتقوى الله وبمن معه من المسلمين خيرا وقال \"اغزوا باسم الله في سبيل الله قاتلوا من كفر بالله إذا لقيت عدوكم من المشركين فادعهم إلى إحدى ثلاث خصال - أو خلال - فأيتهن ما أجابوك إليها فاقبل منهم وكف عنهم ادعهم إلى الإسلام فإن أجابوك فاقبل منهم وكف عنهم ثم ادعهم إلى التحول من دارهم إلى دار المهاجرين وأعلمهم إن فعلوا ذلك أن لهم ما للمهاجرين وأن عليهم ما على المهاجرين فإن أبوا واختاروا دارهم فأعلمهم أنهم يكونون كأعراب المسلمين يجري عليهم حكم الله الذي يجري على المؤمنين ولا يكون لهم في الفيء والغنيمة نصيب إلا أن يجاهدوا مع المسلمين فإن هم أبوا فادعهم إلى إعطاء الجزية. فإن أجابوا فاقبل منهم وكف عنهم فإن أبوا فاستعن بالله وقاتلهم\" انفرد به مسلم وعنده زيادات أخر وقوله \"وإن استنصركم في الدين فعليكم النصر\" الآية يقول تعالى وإن استنصركم هؤلاء الأعراب الذين لم يهاجروا في قتال ديني على عدو لهم فانصروهم فإنه واجب عليكم نصرهم لأنهم إخوانكم في الدين إلا أن يستنصروكم على قوم من الكفار بينكم وبينهم ميثاق أي مهادنة إلى مدة فلا تخفروا ذمتكم ولا تنقضوا أيمانكم مع الذين عاهدتم وهذا مروي عن ابن عباس رضي الله عنه."
    },
    {
      "ayah": 73,
      "surah": 8,
      "text": "لما ذكر تعالى أن المؤمنين بعضهم أولياء بعض قطع الموالاة بينهم وبين الكفار كما قال الحاكم في مستدركه: حدثنا محمد بن صالح بن هانئ حدثنا أبو سعيد يحيى بن منصور الهروي حدثنا محمد بن أبان حدثنا محمد بن يزيد وسفيان بن حسين عن الزهري عن علي بن الحسين عن عمرو بن عثمان عن أسامة عن النبي صلى الله عليه وسلم قال \"لا يتوارث أهل ملتين ولا يرث مسلم كافرا ولا كافر مسلما ثم - قرأ - \"والذين كفروا بعضهم أولياء بعض إلا تفعلوه تكن فتنة في الأرض وفساد كبير\" ثم قال الحاكم صحيح الإسناد ولم يخرجاه. قلت الحديث في الصحيحين من رواية أسامة بن زيد قال: قال رسول الله صلى الله عليه وسلم \"لا يرث المسلم الكافر ولا الكافر المسلم\" وفي المسند والسنن من حديث عمرو بن شعيب عن أبيه عن جده قال: قال رسول الله صلى الله عليه وسلم \"لا يتوارث أهل ملتين شتى\" وقال الترمذي حسن صحيح وقال أبو جعفر بن جرير حدثنا محمد عن معمر عن الزهري أن رسول الله صلى الله عليه وسلم أخذ على رجل دخل في الإسلام فقال \"تقيم الصلاة وتؤتي الزكاة وتحج البيت وتصوم رمضان وإنك لا ترى نار مشرك إلا وأنت له حرب\" وهذا مرسل من هذا الوجه وقد روي متصلا من وجه آخر عن رسول الله صلى الله عليه وسلم أنه قال \"أنا بريء من كل مسلم بين ظهراني المشركين\" ثم قال \"لا يتراءى ناراهما\" وقال أبو داود في آخر كتاب الجهاد حدثنا محمد بن داود بن سفيان أخبرني يحيى بن حسان أنبأنا سليمان بن موسى أبو داود حدثنا جعفر بن سعيد بن سمرة بن جندب عن سمرة بن جندب: أما بعد قال رسول الله صلى الله عليه وسلم \"من جامع المشرك وسكن معه فإنه مثله\" وذكر الحافظ أبو بكر بن مردويه من حديث حاتم بن إسماعيل عن عبدالله بن هرمز عن محمد وسعيد ابني عبيد عن أبي حاتم المزني قال: قال رسول الله صلى الله عليه وسلم \"إذا أتاكم من ترضون دينه وخلقه فأنكحوه إلا تفعلوه تكن فتنة في الأرض وفساد عريض\" قالوا يا رسول الله وإن كان فيه قال \"إذا أتاكم من ترضون دينه وخلقه فأنكحوه\" ثلاث مرات وأخرجه أبو داود والترمذي من حديث حاتم بن إسماعيل به بنحوه ثم روى من حديث عبدالحميد بن سليمان عن ابن عجلان عن أبي وثيمة النضري عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم \"إذا أتاكم من ترضون خلقه ودينه فزوجوه إلا تفعلوه تكن فتنة في الأرض وفساد عريض\" ومعنى قوله \"إلا تفعلوه تكن فتنة في الأرض وفساد كبير\" أي إن لم تجانبوا المشركين وتوالوا المؤمنين وإلا وقعت فتنة في الناس وهو التباس. الأمر واختلاط المؤمنين بالكافرين فيقع بين الناس فساد منتشر عريض طويل."
    },
    {
      "ayah": 74,
      "surah": 8,
      "text": "لما ذكر تعالى حكم المؤمنين في الدنيا عطف بذكر مالهم في الآخرة فأخبر عنهم بحقيقة الإيمان كما تقدم في أول السورة وأنه سبحانه سيجازيهم بالمغفرة والصفح عن الذنوب إن كانت وبالرزق الكريم وهو الحسن الكثير الطيب الشريف دائم مستمر أبدا لا ينقطع ولا ينقضي ولا يسأم ولا يمل لحسنه وتنوعه. ثم ذكر أن الأتباع لهم في الدنيا على ما كانوا عليه من الإيمان والعمل الصالح فهم معهم في الآخرة كما قال \"والسابقون الأولون\" الآية وقال \"والذين جاءوا من بعدهم\" الآية. وفي الحديث المتفق عليه بل المتواتر من طرق صحيحة عن رسول الله صلى الله عليه وسلم أنه قال \"المرء مع من أحب\" وفي الحديث الآخر \"من أحب قوما فهو منهم\" وفي رواية\"حشر معهم\". وقال الإمام أحمد: حدثنا وكيع عن شريك عن عاصم عن أبي وائل عن جرير قال: قال رسول الله صلى الله عليه وسلم \"المهاجرون والأنصار بعضهم أولياء لبعض والطلقاء من قريش والعتقاء من ثقيف بعضهم أولياء بعض إلى يوم القيامة\" قال شريك فحدثنا الأعمش عن تميم بن سلمة عن عبدالرحمن بن هلال عن جرير عن النبي صلى الله عليه وسلم مثله تفرد به أحمد من هذين الوجهين."
    },
    {
      "ayah": 75,
      "surah": 8,
      "text": "وأما قوله تعالى \"وأولوا الأرحام بعضهم أولى ببعض في كتاب الله\" أي في حكم الله وليس المراد بقوله \"وأولوا الأرحام\" خصوصية ما يطلقه علماء الفرائض على القرابة الذي لا فرض لهم ولا هم عصبة بل يدلون بوارث كالخالة والخال والعمة وأولاد البنات وأولاد الأخوات ونحوهم كما قد يزعمه بعضهم ويحتج بالآية ويعتقد ذلك صريحا في المسألة بل الحق أن الآية عامة تشمل جميع القرابات كما نص عليه ابن عباس ومجاهد وعكرمة والحسن وقتادة وغير واحد على أنها ناسخة للإرث بالحلف والإخاء اللذين كانوا يتوارثون بهما أولا وعلى هذا فتشمل ذوي الأرحام بالاسم الخاص ومن لم يورثهم يحتج بأدلة من أقواها حديث \"إن الله قد أعطى كل ذي حق حقه فلا وصية لوارث\" قالوا فلو كان ذا حق لكان ذا فرض في كتاب الله مسمى فلما لم يكن كذلك لم يكن وارثا والله أعلم. آخر تفسير سورة الأنفال ولله الحمد والمنة وعليه التكلان وهو حسبنا ونعم الوكيل."
    },
    { "ayah": 8, "surah": 8, "text": "لا يوجد تفسير لهذه الأية" },
    {
      "ayah": 9,
      "surah": 8,
      "text": "قال الإمام أحمد: حدثنا أبو نوح قراد حدثنا عكرمة بن عمار حدثنا سماك الحنفي أبو زميل حدثني ابن عباس حدثني عمر بن الخطاب رضي الله عنه قال: لما كان يوم بدر نظر النبي صلى الله عليه وسلم إلى أصحابه وهم ثلثمائة ونيف ونظر إلى المشركين فإذا هم ألف وزيادة فاستقبل النبي صلى الله عليه وسلم القبلة وعليه رداؤه وإزاره ثم قال \"اللهم أنجز لي ما وعدتني اللهم إن تهلك هذه العصابة من أهل الإسلام فلا تعبد في الأرض أبدا\" قال فما زال يستغيث ربه ويدعوه حتى سقط رداؤه عن منكبيه فأتاه أبو بكر فأخذ رداءه فرداه ثم التزمه من ورائه ثم قال: يا نبي الله كفاك مناشدتك ربك فإنه سينجز لك ما وعدك فأنزل الله عز وجل \"إذ تستغيثون ربكم فاستجاب لكم أنى ممدكم بألف من الملائكة مردفين\" فلما كان يومئذ التقوا فهزم الله المشركين فقتل منهم سبعون رجلا وأسر منهم سبعون رجلا. واستشار رسول الله صلى الله عليه وسلم أبا بكر وعمر وعليا فقال أبو بكر: يا رسول الله هؤلاء بنو العم والعشيرة والإخوان وإني أرى أن تأخذ منهم الفدية فيكون ما أخذناه منهم قوة لنا على الكفار وعسى أن يهديهم الله فيكونوا لنا عضدا فقال رسول الله صلى الله عليه وسلم \"ما ترى يا ابن الخطاب ؟\" قال: قلت والله ما أرى ما رأى أبو بكر ولكني أرى أن تمكني من فلان قريب لعمر فأضرب عنقه وتمكن عليا من عقيل فيضرب عنقه وتمكن حمزة من فلان أخيه فيضرب عنقه حتى يعلم الله أن ليس في قلوبنا هوادة للمشركين هؤلاء صناديدهم وأئمتهم وقادتهم. فهوى رسول الله صلى الله عليه وسلم ما قال أبو بكر ولم يهو ما قلت وأخذ منهم الفداء فلما كان من الغد قال عمر: فغدوت إلى النبي صلى الله عليه وسلم وأبي بكر وهما يبكيان فقلت: ما يبكيك أنت وصاحبك؟ فإن وجدت بكاء بكيت وإن لم أجد بكاء تباكيت لبكائكما. قال النبي صلى الله عليه وسلم \"للذي عرض على أصحابك من أخذهم الفداء لقد عرض على عذابكم أدنى من هذه الشجرة\" لشجرة قريبة من النبي صلى الله عليه وسلم وأنزل الله عز وجل \"ما كان لنبي أن يكون له أسرى حتى يثخن في الأرض\" - إلى قوله - \"فكلوا مما غنمتم حلالا طيبا\" فأحل لهم الغنائم. فلما كان يوم أحد من العام المقبل عوقبوا بما صنعوا يوم بدر من أخذهم الفداء فقتل منهم سبعون وفر أصحاب النبي صلى الله عليه وسلم عن النبي صلى الله عليه وسلم وكسرت رباعيته وهشمت البيضة على رأسه وسال الدم على وجهه فأنزل الله \"أو لما أصابتكم مصيبة قد أصبتم مثليها قلتم أنى هذا قل هو من عند أنفسكم إن الله على كل شيء قدير\" بأخذكم الفداء. ورواه مسلم وأبو داود والترمذي وابن جرير وابن مردويه من طرق عن عكرمة بن عمار به وصححه علي بن المديني والترمذي وقالا لا يعرف إلا من حديث عكرمة بن عمار اليماني وهكذا روى علي بن أبي طلحة والعوفي عن ابن عباس أن هذه الآية الكريمة قوله \"إذ تستغيثون ربكم\" في دعاء النبي صلى الله عليه وسلم وكذا قال يزيد بن تبيع والسدي وابن جريج وقال أبو بكر بن عياش عن أبي حصين عن أبي صالح قال: لما كان يوم بدر جعل النبي صلى الله عليه وسلم يناشد ربه أشد المناشدة يدعو فأتاه عمر بن الخطاب رضي الله عنه فقال يا رسول الله: بعض مناشدتك فوالله ليفين الله لك بما وعدك قال البخاري في كتاب المغازي باب قول الله تعالى \"إذ تستغيثون ربكم فاستجاب لكم\" - إلى قوله - \" فإن الله شديد العقاب\" حدثنا أبو نعيم حدثنا إسرائيل عن مخارق عن طارق بن شهاب قال سمعت ابن مسعود يقول شهدت من المقداد بن الأسود مشهدا لأن أكون صاحبه أحب إلي مما عدل به أتى النبي صلى الله عليه وسلم وهو يدعو على المشركين فقال: لا نقول كما قال قوم موسى \"فاذهب أنت وربك فقاتلا\" ولكنا نقاتل عن يمينك وعن شمالك وبين يديك وخلفك فرأيت النبي صلى الله عليه وسلم أشرق وجهه وسره يعني قوله. حدثني محمد بن عبدالله بن حوشب حدثنا عبدالوهاب حدثنا خالد الحذاء عن عكرمة عن ابن عباس قال: قال النبي صلى الله عليه وسلم يوم بدر \"اللهم أنشدك عهدك ووعدك اللهم إن شئت لم تعبد\" فأخذ أبو بكر بيده فقال: حسبك فخرج وهو يقول \"سيهزم الجمع ويولون الدبر\". ورواه النسائي عن بندار عن عبدالوهاب عن عبدالمجيد الثقفي وقوله تعالى \"بألف من الملائكة مردفين\" أي يردف بعضهم بعضا كما قال هارون بن هبيرة عن ابن عباس \"مردفين\" متتابعين ويحتمل أن المراد \"مردفين\" لكم أي نجدة لكم كما قال العوفي عن ابن عباس \"مردفين\" يقول المدد كما تقول أنت للرجل زده كذا وكذا. وهكذا قال مجاهد وابن كثير القارئ وابن زيد \"مردفين\" ممدين وقال أبو كدينة عن قابوس عن أبيه عن ابن عباس \"يمددكم ربكم بألف من الملائكة مردفين\" قال وراء كل ملك ملك. وفي رواية بهذا الإسناد \"مردفين\" قال:بعضهم على أثر بعض وكذا قال أبو ظبيان والضحاك وقتادة وقال ابن جرير حدثني المثنى حدثنا إسحق حدثنا يعقوب بن محمد الزهري حدثني عبدالعزيز بن عمران عن الربعي عن أبي الحويرث عن محمد بن جبير عن علي رضي الله عنه قال: نزل جبريل في ألف من الملائكة عن ميمنة النبي صلى الله عليه وسلم وفيها أبو بكر ونزل ميكائيل في ألف من الملائكة عن ميسرة النبي صلى الله عليه وسلم وأنا في الميسرة. وهذا يقتضي إن صح إسناده أن الألف مردفة بمثلها ولهذا قرأ بعضهم \"مردَفين\" بفتح الدال والله أعلم. والمشهور ما رواه علي بن أبي طلحة عن ابن عباس قال: وأمد الله نبيه صلى الله عليه وسلم والمؤمنين بألف من الملائكة فكان جبريل في خمسمائة من الملائكة مُجَنِّبَةٍ وميكائيل في خمسمائة مجنبة. وروى الإمام أبو جعفر ابن جرير ومسلم من حديث عكرمة بن عمار عن أبي زميل سماك بن وليد الحنفي عن ابن عباس عن عمر الحديث المتقدم ثم قال أبو زميل: حدثني ابن عباس قال: بينا رجل من المسلمين يشتد في أثر رجل من المشركين أمامه إذ سمع ضربة بالسوط فوقه وصوت الفارس يقول أقدم حيزوم إذ نظر إلى المشرك أمامه فخر مستلقيا قال فنظر إليه فإذا هو قد حطم وشق وجهه كضربة السوط فاخضر ذلك أجمع فجاء الأنصاري فحدث بذلك رسول الله صلى الله عليه وسلم قال صدقت ذلك من مدد السماء الثالثة فقتلوا يومئذ سبعين وأسروا سبعين وقال البخاري: \"باب شهود الملائكة بدرا\". حدثنا إسحق بن إبراهيم حدثنا جرير عن يحيى بن سعيد عن معاذ بن رفاعة بن رافع الزرقي عن أبيه وكان أبوه من أهل بدر قال جاء جبريل إلى النبي صلى الله عليه وسلم فقال: ما تعدون أهل بدر فيكم؟ قال: \"من أفضل المسلمين\" أو كلمة نحوها قال: \"وكذلك من شهد بدرا من الملائكة\" انفرد بإخراجه البخاري. وقد رواه الطبراني في المعجم الكبير من حديث رافع بن خديج وهو خطأ والصواب رواية البخاري والله أعلم. وفي الصحيحين أن رسول الله صلى الله عليه وسلم قال لعمر لما شاوره في قتل حاطب بن أبي بلتعة \"إنه قد شهد بدرا وما يدريك لعل الله قد اطلع على أهل بدر فقال اعملوا ما شئتم فقد غفرت لكم\"."
    }
  ]
}
