{
  "ayahs": [
    {
      "ayah": 1,
      "surah": 80,
      "text": "ذكر غير واحد من المفسرين أن رسول الله صلى الله عليه وسلم كان يوما يخاطب بعض عظماء قريش وقد طمع في إسلامه فبينما هو يخاطبه ويناجيه إذ أقبل ابن أم مكتوم وكان ممن أسلم قديما فجعل يسأل رسول الله صلى الله عليه وسلم من شيء ويلح عليه وود النبي صلى الله عليه وسلم أن لو كف ساعته تلك ليتمكن من مخاطبة ذلك الرجل طمعا ورغبة في هدايته وعبس في وجه ابن أم مكتوم وأعرض عنه وأقبل على الآخر فأنزل الله تعالى\" عبس وتولى\"."
    },
    {
      "ayah": 10,
      "surah": 80,
      "text": "أي تتشاغل ومن ههنا أمر الله تعالى رسوله صلى الله عليه وسلم أن لا يخص بالإنذار أحدا بل يساوي فيه بين الشريف والضعيف والفقير والغني والسادة والعبيد والرجال والنساء والصغار والكبار ثم الله تعالى يهدي من يشاء إلى صراط مستقيم وله الحكمة البالغة والحجة الدامغة. قال الحافظ أبو يعلى في مسنده حدثنا محمد بن مهدي حدثنا عبد الرزاق أخبرنا معمر عن قتادة عن أنس رضي الله عنه في قوله تعالي\"عبس وتولى\" جاء ابن أم مكتوم إلى النبي صلى الله عليه وسلم وهو يكلم أبي بن خلف فأعرض عنه فأنزل الله عز وجل\"عبس وتولى أن جاءه الأعمى\" فكان النبي صلى الله عليه وسلم بعد ذلك يكرمه. قال قتادة وأخبرني أنس بن مالك قال: رأيته يوم القادسية وعليه درع ومعه راية سوداء يعني ابن أم مكتوم. وقال أبو يعلي وابن جرير حدثنا سعيد بن يحيي بن سعيد الأموي حدثني أبي قال هذا ما عرضنا على هشام بن عروة عن أبيه عن عائشة قالت أنزلت\"عبس وتولى\" في ابن أم مكتوم الأعمى أتى إلى رسول الله صلى الله عليه وسلم فجعل يقول أرشدني قالت وعند رسول الله صلى الله عليه وسلم رجل من عظماء المشركين قالت فجعل النبي صلى الله عليه وسلم يعرض عنه ويقبل على الآخر ويقول\"أترى بما أقول بأسا؟\" فيقول لا ففي هذا أنزلت\"عبس وتولى\". وقد روى الترمذي هذا الحديث عن سعيد بن يحيي الأموي بإسناده مثله ثم قال وقد رواه بعضهم عن هشام بن عروة عن أبيه قال أنزلت\"عبس وتولى\" في ابن أم مكتوم ولم يذكر فيه عن عائشه \"قلت\" كذلك هو في الموطأ. ثم روي ابن جرير وابن أبي حاتم أيضا من طريق العوفي عن ابن عباس - قوله \"عبس وتولي أن جاءه الأعمي\" قال بينا رسول الله صلى الله عليه وسلم يناجي عتبة بن ربيعة وأبا جهل بن هشام والعباس بن عبد المطلب وكان يتصدى لهم كثيرا ويحرص عليهم أن يؤمنوا فأقبل إليه رجل أعمى يقال له عبدالله بن أم مكتوم يمشي وهو يناجيهم فجعل عبدالله يستقرئ النبي صلى الله عليه وسلم آية من القرآن وقال يا رسول الله علمني مما علمك الله فأعرض عنه رسول الله صلى الله عليه وسلم وعبس في وجهه وتولي وكره كلامه وأقبل على الآخرين فلما قضي رسول الله صلى الله عليه وسلم نجواه وأخذ ينقلب إلي أهله أمسك الله بعض بصره وخفق برأسه ثم أنزل الله تعالى \"عبس وتولى أن جاءه الأعمى وما يدريك لعله يزكي أو يذكر فتنفعه الذكرى\" فلما نزل فيه ما نزل أكرمه رسول الله صلى الله عليه وسلم وكلمه وقال له رسول الله صلى الله عليه وسلم \"ما حاجتك؟ هل تريد من شيء؟ - وإذا ذهب من عنده قال - هل لك حاجة فى شيء؟\" وذلك لما أنزل الله تعالى \"أما من استغني فأنت له تصدى وما عليك ألا يزكي\" فيه غرابة ونكارة وقد تكلم في إسناده. وقال ابن أبي حاتم حدثنا أحمد بن منصور الرمادي حدثنا عبدالله بن صالح حدثنا الليث حدثنا يونس عن ابن شهاب قال: قال سالم بن عبدالله عن عبدالله بن عمر يقول سمعت رسول الله صلى الله عليه وسلم يقول \"إن بلالا يؤذن بليل فكلوا واشربوا حتي تسمعوا أذان ابن أم مكتوم\" وهو الأعمى الذي أنزل الله تعالى فيه \"عبس وتولى أن جاءه الأعمى\" وكان يؤذن مع بلال قال سالم وكان رجلا ضريرا البصر فلم يك يؤذن حتى يقول له الناس حين ينظرون إلى بزوغ الفجر أذن. وهكذا ذكر عروة بن الزبير ومجاهد وأبو مالك وقتادة والضحاك وابن زيد وغير واحد من السلف والخلف أنها نزلت في ابن أم مكتوم والمشهور أن اسمه عبدالله ويقال عمرو والله أعلم."
    },
    {
      "ayah": 11,
      "surah": 80,
      "text": "أى هذه السورة أو الوصية بالمساواة بين الناس في إبلاغ العلم بين شريفهم ووضيعهم وقال قتادة والسدي \"كلا إنها تذكرة\" يعني القرآن."
    },
    {
      "ayah": 12,
      "surah": 80,
      "text": "أي فمن شاء ذكر الله تعالى في جميع أموره ويحتمل عود الضمير إلي الوحي لدلالة الكلام عليه."
    },
    {
      "ayah": 13,
      "surah": 80,
      "text": "أي هذه السورة أو العظة وكلاهما متلازم بل جميع القرآن في صحف مكرمة أى معظمة موقرة."
    },
    { "ayah": 14, "surah": 80, "text": "\"مرفوعة\" أي عالية القدر \"مطهرة\" أي من الدنس والزيادة والنقص." },
    {
      "ayah": 15,
      "surah": 80,
      "text": "قوله تعالى \"بأيدي سفرة\" قال ابن عباس ومجاهد والضحاك وابن زيد هي الملائكة وقال وهب بن منبه هم أصحاب محمد صلى الله عليه وسلم وقال قتادة هم القراء وقال ابن جريج عن ابن عباس السفرة بالنبطية القراء وقال ابن جرير: والصحيح أن السفرة الملائكة والسفرة يعني بين الله تعالى وبين خلقه ومنه يقال: السفير الذى يسعى بين الناس في الصلح والخير كما قال الشاعر: وما أدع السفارة بين قومي وما أمشي بغش إن مشيت وقال البخاري سفرة: الملائكة سفرت أصلحت بينهم وجعلت الملائكة إذا نزلت بوحي الله تعالي وتأديته كالسفير الذي يصلح بين القوم."
    },
    {
      "ayah": 16,
      "surah": 80,
      "text": "أي خلقهم كريم حسن شريف وأخلاقهم وأفعالهم بارة طاهرة كاملة ومن ههنا ينبغي لحامل القرآن أن يكون في أفعاله وأقواله على السداد والرشاد. قال الإمام أحمد حدثنا إسماعيل حدثنا هشام عن قتادة عن زرارة بن أوفى عن سعد بن هشام عن أبيه عن عائشة رضي الله عنها قالت: قال رسول الله صلى الله عليه وسلم \"الذي يقرأ القرآن وهو ماهر به مع السفرة الكرام البررة والذي يقرءوه وهو عليه شاق له أجران\" أخرجه الجماعة من طريق قتادة به."
    },
    {
      "ayah": 17,
      "surah": 80,
      "text": "يقول تعالى ذاما لمن أنكر البعث والنشور من بنى آدم \"قتل الإنسان ما أكفره\" قال الضحاك عن ابن عباس \"قتل الإنسان\" لعن الإنسان وكذا قال أبو مالك وهذا الجنس الإنسان المكذب لكثرة تكذيبه بلا مستند بل بمجرد الاستبعاد وعدم العلم قال ابن جريج \"ما أكفره\" أي ما أشد كفره وقال ابن جرير ويحتمل أن يكون المراد أي شيء جعله كافرا أي ما حمله على التكذيب بالمعاد وقد حكاه البغوي عن مقاتل والكلبي وقال قتادة \"ما أكفره\" ما ألعنه."
    },
    { "ayah": 18, "surah": 80, "text": "ثم بين تعالى له كيف خلقه من الشيء الحقير." },
    { "ayah": 19, "surah": 80, "text": "أي قدر أجله ورزقه وعمله وشقي أو سعيد." },
    {
      "ayah": 2,
      "surah": 80,
      "text": "ذكر غير واحد من المفسرين أن رسول الله صلى الله عليه وسلم كان يوما يخاطب بعض عظماء قريش وقد طمع في إسلامه فبينما هو يخاطبه ويناجيه إذ أقبل ابن أم مكتوم وكان ممن أسلم قديما فجعل يسأل رسول الله صلى الله عليه وسلم من شيء ويلح عليه وود النبي صلى الله عليه وسلم أن لو كف ساعته تلك ليتمكن من مخاطبة ذلك الرجل طمعا ورغبه في هدايته وعبس في وجه ابن أم مكتوم وأعرض عنه وأقبل عل الآخر فأنزل الله تعالى\" عبس وتولى أن جاءه الأعمى \"."
    },
    {
      "ayah": 20,
      "surah": 80,
      "text": "قال العوفي عن ابن عباس ثم يسر عليه خروجه من بطن أمه وكذا قال عكرمة والضحاك وأبو صالح وقتادة والسدي واختاره ابن جرير وقال مجاهد هذه كقوله تعالى \"إنا هديناه السبيل إما شاكرا وإما كفورا\" أي بيناه له وأوضحناه وسهلنا عليه عمله وكذا قال الحسن وابن زيد وهذا هو الأرجح والله أعلم."
    },
    {
      "ayah": 21,
      "surah": 80,
      "text": "أي أنه بعد خلقه له أماته فأقبره أي جعله ذا قبر والعرب تقول قبرت الرجل إذا ولي ذلك منه وأقبره الله وعضبت قرن الثور وأعضبه الله وبترت ذنب البعير وأبتره الله وطردت عني فلانا وأطرده الله أي جعله طريدا قال الأعشى: لو أسندت ميتا إلى صدرها عاش ولم ينقل إلى قابر."
    },
    {
      "ayah": 22,
      "surah": 80,
      "text": "أي بعثه يعد موته ويقال البعث والنشور \"ومن آياته أن خلقكم من تراب ثم إذا أنتم بشر تنتشرون\" \"وانظر إلى العظام كيف ننشزها ثم نكسوها لحما\". وقال ابن أبي حاتم حدثنا أبي حدثنا أصبغ بن الفرج أخبرنا ابن وهب أخبرني عمرو بن الحارث أن دراجا أبا السمح أخبره عن أبي الهيثم عن أبي سعيد عن النبي صلى الله عليه وسلم قال \"يأكل التراب كل شيء من الإنسان إلا عجب ذنبه\" قيل وما هو يا رسول الله؟ قال \"مثل حبة خردل منه تنشئون\" وهذا الحديث ثابت في الصحيحين من رواية الأعمش عن أبي صالح عن أبي هريرة بدون هذه الزيادة ولفظه \"كل ابن آدم يبلى إلا عجب الذنب منه خلق وفيه يركب\"."
    },
    {
      "ayah": 23,
      "surah": 80,
      "text": "قال ابن جرير يقول جل ثناؤه كلا ليس الأمر بقول هذا الإنسان الكافر من أنه قد أدى حق الله عليه في نفسه وماله \"لما يقض ما أمره\" يقول لم يؤد ما فرض عليه عز وجل من الفرائض لربه عز وجل. ثم روى هو وابن أبي حاتم من طريق ابن أبي نجيح عن مجاهد قوله تعالى \"كلا لم يقض ما أمره\" قال لا يقضي أحدا أبدا كل ما افترض عليه. وحكاه البغوي عن الحسن البصري بنحو من هذا ولم أجد للمتقدمين فيه كلاما سوي هذا والذي يقع لي في معني ذلك والله أعلم أن المعنى \"ثم إذا شاء أنشره\" أي بعثه \"كلا لم يقض ما أمره\" أي لا يفعله الآن حتي تنقضي المدة ويفرغ القدر من بني آدم ممن كتب الله أن سيوجد منهم ويخرج إلي الدنيا وقد أمر به تعالي كونا وقدرا فإذا تناهى ذلك عند الله أنشر الله الخلائق وأعادهم كما بدأهم وقد روى ابن أبي حاتم عن وهب بن منبه قال: قال عزير عليه السلام قال الملك الذي جاءني فإن القبور هي بطن الأرض وإن الأرض هي أم الخلق فإذا خلق الله ما أراد أن يخلق وتمت هذه القبور التي مد الله لها انقطعت الدنيا ومات من عليها ولفظت الأرض ما في جوفها وأخرجت القبور ما فيها وهذا شبيه بما قلنا من معني الآية والله سبحانه وتعالى أعلم."
    },
    {
      "ayah": 24,
      "surah": 80,
      "text": "فيه امتنان وفيه استدلال بإحياء النبات من الأرض الهامدة على إحياء الأجسام بعدما كانت عظاما بالية وترابا متمزقا."
    },
    { "ayah": 25, "surah": 80, "text": "أي أنزلناه من السماء علي الأرض." },
    {
      "ayah": 26,
      "surah": 80,
      "text": "أي أسكناه فيها فيدخل في تخومها وتخلل في أجزاء الحب المودع فيها فنبت وارتفع وظهر علي وجه الأرض."
    },
    { "ayah": 27, "surah": 80, "text": "فالحب كل ما يذكر من الحبوب." },
    {
      "ayah": 28,
      "surah": 80,
      "text": "والعنب معروف والقضب هو الفصفصة التي تأكلها الدواب رطبة ويقال لها القت أيضا قال ذلك ابن عباس وقتادة والضحاك والسدي وقال الحسن البصري القضب العلف."
    },
    {
      "ayah": 29,
      "surah": 80,
      "text": "\"وزيتونا\" وهو معروف وهو أدم وعصيره أدم ويستصبح به ويدهن به \"ونخلا\" يؤكل بلحا بسرا ورطبا وتمرا ونيئا ومطبوخا ويعتصر منه رب وخل."
    },
    { "ayah": 3, "surah": 80, "text": "أي يحصل له زكاة وطهارة في نفسه." },
    {
      "ayah": 30,
      "surah": 80,
      "text": "أي بساتين قال الحسن وقتادة غلبا نخل غلاظ كرام وقال ابن عباس ومجاهد كل ما التف واجتمع وقال أيضا غلبا الشجر الذي يستظل به وقال علي بن أبي طلحة عن ابن عباس \"وحدائق غلبا\" أي طوال وقال عكرمة غلبا أي غلاظ الأوساط وفي رواية غلاظ الرقاب ألم تر إلى الرجل إذا كان غليظ الرقبة قيل والله إنه لأغلب؟ رواه ابن أبي حاتم وانشد ابن جرير للفرزدق: عوى فأثأر أغلب ضيعميا فويل ابن المراعة ما استثار."
    },
    {
      "ayah": 31,
      "surah": 80,
      "text": "أما الفاكهة فكل ما يتفكه به من الثمار قال ابن عباس الفاكهة كل ما أكل رطبا والأب ما أنبتت الأرض مما يأكله الدواب ولا يأكله الناس وفي رواية عنه هو الحشيش للبهائم وقال مجاهد وسعيد بن جبير وأبو مالك: الأب الكلأ وعن مجاهد والحسن وقتادة وابن زيد: الأب للبهائم كالفاكهة لبني آدم وعن عطاء كل شيء نبت على وجه الأرض فهو أب وقال الضحاك كل شيء أنبتته الأرض سوى الفاكهة فهو الأب. وقال ابن إدريس عن عاصم بن كليب عن أبيه عن ابن عباس: الأب نبت الأرض مما تأكله الدواب ولا تأكله الناس ورواه ابن جرير من ثلاث طرق عن ابن إدريس ثم قال حدثنا أبو كريب وأبو السائب قالا حدثنا ابن إدريس حدثنا عبدالملك عن سعيد بن جبير قال عد ابن عباس وقال: الأب ما أنبتت الأرض للأنعام وهذا لفظ حديث أبي كريب وقال أبو السائب في حديثه ما أنبتت الأرض مما يأكل الناس وتأكل الأنعام وقال العوفي عن ابن عباس: الأب الكلأ والمرعي وكذا قال مجاهد والحسن وقتادة وابن زيد وغير واحد وقال أبو عبيد القاسم بن سلام حدثنا محمد بن زيد حدثنا العوام بن حوشب عن إبراهيم التيمي قال سئل أبو بكر الصديق رضي الله عنه عن قوله تعالى \"وفاكهة وأبا\" فقال: أي سماء تظلني وأي أرض تقلني إن قلت في كتاب الله ما لا أعلم وهذا منقطع بين إبراهيم التيمي والصديق رضي الله عنه. فأما ما رواه ابن جرير حيث قال: حدثنا ابن بشار حدثنا ابن أبي عدي حدثنا حميد عن أنس قال: قرأ عمر بن الخطاب رضي الله عنه \"عبس وتولى\" فلما أتي على هذه الآية \"وفاكهة وأبا\" قال قد عرفنا الفاكهة فما الأب؟ فقال لعمرك يا ابن الخطاب إن هذا لهو التكلف: فهو إسناد صحيح وقد رواه غير واحد عن أنس به وهذا محمول على أنه أراد أن يعرف شكله وجنسه وعينه وإلا فهو وكل من قرأ هذه الآية يعلم أنه من نبات الأرض لقوله \"فأنبتنا فيها حبا وعنبا وقضبا وزيتونا ونخلا وحدائق غلبا وفاكهة وأبا\"."
    },
    { "ayah": 32, "surah": 80, "text": "أي عيشة لكم ولأنعامكم في هذه الدار إلى يوم القيامة." },
    {
      "ayah": 33,
      "surah": 80,
      "text": "قال ابن عباس: الصاخة اسم من أسماء يوم القيامة عظمه الله وحذره عباده. قال ابن جرير لعله اسم للنفخة في الصور وقال البغوي: الصاخة يعني صيحة يوم القيامة سميت بذلك لأنها تصخ الأسماع أي تبالغ في إسماعها حتى تكاد تصمها."
    },
    { "ayah": 34, "surah": 80, "text": "أي يراه ويفر منه ويبتعد منه لأن الهول عظيم والخطب جليل." },
    {
      "ayah": 35,
      "surah": 80,
      "text": "قال وإن الرجل لقي ابنه فيتعلق به فيقول يا بني أي والد كنت لك؟ فيثني بخير فيقول له يا بني إني احتجت إلي مثقال ذرة من حسناتك لعلي أنجو بها مما ترى فيقول ولده: يا أبت ما أيسر ما طلبت ولكنى أتخوف مثل الذي تتخوف فلا أستطيع أن أعطيك شيئا يقول الله تعالى \"يوم يفر المرء من أخيه وأمه وأبيه وصاحبته وبنيه\" وفي الحديث الصحيح في أمر الشفاعة أنه إذا طلب إلى كل من أولي العزم أن يشفع عند الله في الخلائق يقول نفسي نفسي لا أسألك اليوم إلا نفسي حتى إن عيسى ابن مريم يقول لا أسأله اليوم إلا نفسي لا أسأله مريم التي ولدتني ولهذا قال تعالى \"يوم يفر المرء من أخيه وأمه وأبيه وصاحبته وبنيه\"."
    },
    {
      "ayah": 36,
      "surah": 80,
      "text": "قال عكرمة: يلقى الرجل زوجته فيقول لها يا هذه أي بعل كنت لك؟ فتقول نعم البعل كنت وتثني بخير ما استطاعت فيقول لها فإني أطلب إليك اليوم حسنة واحدة تهبيها لي لعلي أنجو مما ترين فتقول له أيسر ما طلبت ولكني لا أطيق أن أعطيك شيئا أتخوف مثل الذي تخاف قال قتادة الأحب فالأحب والأقرب فالأقرب من هول ذلك اليوم."
    },
    {
      "ayah": 37,
      "surah": 80,
      "text": "أي هو فى شغل شاغل عن غيره قال ابن أبي حاتم حدثنا محمد بن عمار بن الحارث حدثنا الوليد بن صالح حدثنا ثابت أبو زيد العباداني عن هلال بن خباب عن سعيد بن جبير عن ابن عباس قال: قال رسول الله صلى الله عليه وسلم \"تحشرون حفاة عراة مشاة غرلا\" قال: فقالت زوجته يا رسول الله ننظر أو يرى بعضنا عورة بعض؟ قال \" لكل امرئ منهم يومئذ شأن يغنيه\" أو قال: ما أشغله عن النظر\". وقد رواه النسائي منفردا به عن أبي داود عن عارم عن ثابت بن يزيد وهو ابن زيد الأحول البصري أحد الثقات عن هلال بن خباب عن سعيد بن جبير عن ابن عباس به. وقد رواه الترمذي عن عبدالله بن حميد عن محمد بن الفضل عن ثابت بن زيد عن هلال بن خباب عن عكرمة عن ابن عباس عن النبي صلى الله عليه وسلم قال \"تحشرون حفاة عراة غرلا\" فقالت امرأة أيبصر أو يرى بعضنا عورة بعض؟ قال \"يا فلانه لكل \"امرئ منهم يومئذ شأن يغنيه\" ثم قال الترمذي وهذا حديث حسن صحيح وقد روي من غير وجه عن ابن عباس رضي الله عنهما وقال النسائي أخبرني عمرو بن عثمان حدثنا بقية حدثنا الزبيدي أخبرني الزهري عن عروة عن عائشة أن رسول الله صلى الله عليه وسلم قال \"يبعث الناس يوم القيامة حفاة عراة غرلا\" فقالت عائشة: يا رسول الله فكيف بالعورات ؟ فقال \"لكل امرئ منهم يومئذ شأن يغنيه\" انفرد به النسائي من هذا الوجه ثم قال ابن أبي حاتم أيضا حدثنا أبي أزهر بن حاتم حدثنا الفضل ابن موسي عن عائذ بن شريح عن أنس بن مالك قال سألت عائشة رسول الله صلى الله عليه وسلم فقالت يا رسول الله بأبي أنت وأمي إني سائلتك عن حديث فتخبرني أنت به قال \"إن كان عندي منه علم\" قالت يا نبي الله كيف يحشر الرجال؟ قال \"حفاة عراة\" ثم انتظرت ساعة فقالت: يا رسول الله كيف يحشر النساء؟ قال \"كذلك حفاة عراة\" قالت واسوأتاه من يوم القيامة قال \"وعن أي ذلك تسألين إنه قد نزل علي آية لا يضرك كان عليك ثياب أو لا يكون\" قالت أية آية هي يا نبي الله؟ قال \"لكل امرئ منهم يومئذ شأن يغنيه\" وقال البغوي في تفسيره أخبرنا أحمد بن إبراهيم الشريحي أنا أحمد بن محمد بن إبراهيم الثعلبي أخبرني الحسين بن محمد بن عبدالله حدثنا عبدالله بن عبدالرحمن حدثنا محمد بن عبدالعزيز حدثنا ابن أبي أويس حدثنا أبي عن محمد بن ابن أبي عياش عن عطاء بن يسار عن سودة زوج النبي صلى الله عليه وسلم قالت: قال رسول الله صلى الله عليه وسلم \"يبعث الناس حفاة عراة غرلا قد ألجمهم العرق وبلغ شحوم الآذان\" فقلت يا رسول الله واسوأتاه ينظر بعضنا إلي بعض؟ فقال \"قد شغل الناس \"لكل امرئ منهم يومئذ شأن يغنيه\" هذا حديث غريب من هذا الوجه جدا وهكذا رواه ابن جرير عن أبي عمار الحسين بن حريث المروزي عن الفضل بن موسي به ولكن قال أبو حاتم الرازي عائذ بن شريح ضعيف في حديثه ضعف."
    },
    { "ayah": 38, "surah": 80, "text": "أي يكون الناس هنالك فريقين وجوه مسفرة أي مستنيرة." },
    {
      "ayah": 39,
      "surah": 80,
      "text": "أي مسرورة فرحة من السرور في قلوبهم قد ظهر البشر على وجوههم وهؤلاء هم أهل الجنة."
    },
    { "ayah": 4, "surah": 80, "text": "أي يحصل له اتعاظ وانزجار عن المحارم." },
    {
      "ayah": 40,
      "surah": 80,
      "text": "أي يعلوها وتغشاها قترة أي سواد قال ابن أبي حاتم حدثنا أبي حدثنا سهل بن عثمان العسكري حدثنا أبو على محمد مولي جعفر بن محمد عن جعفر بن محمد عن أبيه عن جده قال: قال رسول الله صلى الله عليه وسلم \"يلجم الكافر العرق ثم تقع الغبرة على وجوههم\" قال فهو قوله تعالى \"ووجوه يومئذ عليها غبرة\"."
    },
    { "ayah": 41, "surah": 80, "text": "وقال ابن عباس \" ترهقها قترة \" أي يغشاها سواد الوجوه." },
    {
      "ayah": 42,
      "surah": 80,
      "text": "أي الكفرة قلوبهم الفجرة في أعمالهم كما قال تعالى \"ولا يلدوا إلا فاجرا كفارا\". آخر تفسير سورة عبس ولله الحمد والمنة."
    },
    { "ayah": 5, "surah": 80, "text": "أي أما الغني." },
    { "ayah": 6, "surah": 80, "text": "فأنت تتعرض له لعله يهتدي." },
    { "ayah": 7, "surah": 80, "text": "أي ما أنت بمطالب به إذا لم يحصل له زكاة." },
    { "ayah": 8, "surah": 80, "text": "أي يقصدك ويؤمك." },
    { "ayah": 9, "surah": 80, "text": "ليهتدي بما تقول له." }
  ]
}
