{
  "ayahs": [
    {
      "ayah": 1,
      "surah": 81,
      "text": "سورة التكوير: قال الإمام أحمد حدثنا عبدالرزاق أخبرنا عبدالله بن بحير القاص أن عبدالرحمن بن يزيد الصنعاني أخبره أنه سمع ابن عمر يقول: قال رسول الله صلى الله عليه وسلم \"من سره أن ينظر إلى يوم القيامة كأنه رأي عين فليقرأ \"إذا الشمس كورت\" \"وإذا السماء انفطرت\" \"وإذا السماء انشقت\" وهكذا رواه الترمذي عن العباس بن عبدالعظيم العنبري عن عبدالرزاق به. قال علي بن أبي طلحة عن ابن عباس \"إذا الشمس كورت\" يعني أظلمت وقال العوفي عنه: ذهبت وقال مجاهد اضمحلت وذهبت وكذا قال الضحاك وقال قتادة ذهب ضوءها وقال سعيد بن جبير كورت غورت وقال الربيع بن خثيم كورت يعني رمي بها وقال أبو صالح كورت ألقيت وعنه أيضا نكست وقال زيد بن أسلم تقع في الأرض قال ابن جرير والصواب من القول عندنا في ذلك أن التكوير جمع الشيء بعضه على بعض ومنه تكوير العمامة وجمع الثياب بعضها إلى بعض فمعنى قوله تعالى \"كورت\" جمع بعضها إلى بعض ثم لفت فرمي بها وإذا فعل بها ذلك ذهب ضوءها وقال ابن أبي حاتم حدثنا أبو سعيد الأشج وعمرو بن عبدالله الأودي حدثنا أبو أسامة عن مجالد عن شيخ من بجيلة عن ابن عباس \"إذا الشمس كورت\" قال يكور الله الشمس والقمر والنجوم يوم القيامة في البحر ويبعث الله ريحا دبورا فتضرمها نارا وكذا قال عامر الشعبي ثم قال ابن أبي حاتم حدثنا أبي حدثنا أبو صالح حدثني معاوية بن صالح عن ابن يزيد بن أبي مريم عن أبيه أن رسول الله صلى الله عليه وسلم قال في قول الله \"إذا الشمس كورت\" قال \"كورت فى جهنم\" وقال الحافظ أبو يعلى في مسنده حدثنا موسى بن محمد بن حبان حدثنا درست بن زياد حدثنا يزيد الرقاشي حـدثنا أنس قال: قال رسول الله صلى الله عليه وسلم \"الشمس والقمر ثوران عقيران في النار\". هذا حديث ضعيف لأن يزيد الرقاشي ضعيف والذي رواه البخاري في الصحيح بدون هذه الزيادة ثم قال البخاري حدثنا مسدد حدثنا عبدالعزيز بن المختار حدثنا عبدالله الداناج حدثني أبو سلمة بن عبد الرحمن عن أبي هريرة عن النبي صلى الله عليه وسلم \"الشمس والقمر يكوران يوم القيامة\" انفرد به البخاري وهذا لفظه وإنما أخرجه في كتاب بدء الخلق وكان جديرا أن يذكره ههنا أو يكرره كما هي عادته في أمثاله وقد رواه البزار فجود إيراده فقال حدثنا إبراهيم بن زياد البغدادي حدثنا يونس بن محمد حدثنا عبدالعزيز بن المختار عن عبدالله الداناج قال سمعت أبا سلمة بن عبدالرحمن بن خالد بن عبدالله القسري في هذا المسجد مسجد الكوفة وجاء الحسن فجلس إليه فحدث قال حدثنا أبو هريرة أن رسول الله صلى الله عليه وسلم قال \"إن الشمس والقمر ثوران في النار عقيران يوم القيامة\" فقال الحسن وما ذنبهما؟ فقال أحدثك عن رسول الله صلى الله عليه وسلم وتقول أحسبه قال وما ذنبهما ثم قال لا يروى عن أبي هريرة إلا من هذا الوجه ولم يرو عبدالله الداناج عن أبي سلمة سوي هذا الحديث."
    },
    {
      "ayah": 10,
      "surah": 81,
      "text": "قال الضحاك أعطي كل إنسان صحيفته بيمينه أو بشماله وقال قتادة يا ابن آدم تملي فيها ثم تطوى ثم تنشر عليك يوم القيامة فلينظر رجل ماذا يملي في صحيفته."
    },
    { "ayah": 11, "surah": 81, "text": "قال مجاهد اجتذبت وقال السدي كشفت وقال الضحاك تنكشط فتذهب." },
    { "ayah": 12, "surah": 81, "text": "قال السدي أحميت وقال قتادة أوقدت قال وإنما يسعرها غضب الله وخطايا بني آدم." },
    { "ayah": 13, "surah": 81, "text": "قال الضحاك وأبو مالك وقتادة والربيع بن خيثم أي قربت إلى أهلها." },
    {
      "ayah": 14,
      "surah": 81,
      "text": "هذا هو الجواب أي إذا وقعت هذه الأمور حينئذ تعلم كل نفس ما عملت وأحضر ذلك لها كما قال تعالى \"يوم تجد كل نفس ما عملت من خير محضرا وما عملت من سوء تود لو أن بينها وبينه أمدا بعيدا\" وقال تعالى \"ينبأ الإنسان يومئذ بما قدم وأخر\" وقال ابن أبي حاتم حدثنا أبي حدثنا عبدة حدثنا ابن المبارك حدثنا محمد بن مطرف عن زيد بن أسلم عن أبيه قال لما نزلت \"إذا الشمس كورت\" قال عمر لما بلغ \"علمت نفس ما أحضرت\" قال لهذا أجرى الحديث."
    },
    {
      "ayah": 15,
      "surah": 81,
      "text": "روى مسلم في صحيحه والنسائي في تفسيره عند هذه الآية من حديث مسعر بن كدام عن الوليد بن سريع عن عمرو بن حريث قال: صليت خلف النبي صلى الله عليه وسلم الصبح فسمعته يقرأ \"فلا أقسم بالخنس الجوار الكنس والليل إذا عسعس والصبح إذا تنفس\" ورواه النسائي عن بندار عن غندر عن شعبة عن الحجاج بن عاصم عن أبي الأسود عن عمرو بن حريث به نحوه قال ابن أبي حاتم وابن جرير من طريق الثوري عن أبي إسحاق عن رجل من مراد عن علي \"فلا أقسم بالخنس الجوار الكنس\" قال هي النجوم تخنس بالنهار وتظهر بالليل وقال ابن جرير حدثنا ابن المثنى حدثنا محمد بن جعفر حدثنا شعبة عن سماك بن حرب سمعت خالد بن عرعرة سمعت عليا وسئل عن \"لا أقسم بالخنس الجوار الكنس\" فقال هي النجوم تخنس بالنهار وتكنس بالليل وحدثنا أبو كريب حدثنا وكيع عن إسرائيل عن سماك عن خالد عن علي قال هي النجوم وهذا إسناد جيد صحيح إلى خالد بن عرعرة وهو السهمي الكوفي قال أبو حاتم الرازي روي عن علي وروى عنه سماك والقاسم بن عوف الشيباني ولم يذكر فيه جرحا ولا تعديلا فالله أعلم. وروى يونس عن أبي إسحاق عن الحارث عن علي أنها النجوم رواه ابن أبي حاتم وكذا روي عن ابن عباس ومجاهد والحسن وقتادة والسدي وغيرهم أنها النجوم وقال ابن جرير حدثنا محمد بن بشار حدثنا هوذة بن خليفة حدثنا عوف عن بكر بن عبدالله فى وقوله تعالى \"فلا أقسم بالخنس الجوار الكنس\" قال هي النجوم الدراري التي تجري تستقبل المشرق وقال بعض الأئمة إنما قيل للنجوم الخنس أي في حال طلوعها ثم هي جوار في فلكها وفي حال غيبوبتها يقال لها كنس من قول العرب أوى الظبي إلى كناسه إذا تغيب فيه وقال الأعمش عن إبراهيم قال: قال عبدالله \"فلا أقسم بالخنس\" قال بقر الوحش وكذا قال الثوري عن أبي إسحاق عن أبي ميسرة عن عبدالله \"فلا أقسم بالخنس الجوار الكنس\" ما هي يا عمرو؟ قلت البقر قال وأنا أرى ذلك وكذا روى يونس عن أبي إسحاق عن أبيه وقال أبو داود الطيالسي عن عمرو عن أبيه عن سعيد بن جبير عن ابن عباس \"الجوار الكنس\" قال البقر تكنس إلى الظل وكذا قال سعيد بن جبير وقال العوفي عن ابن عباس هي الظباء وكذا قال سعيد أيضا ومجاهد والضحاك وقال أبو الشعثاء جابر بن زيد هي الظباء والبقر وقال ابن جرير حدثنا يعقوب حدثنا هشيم أخبرنا مغيرة عن إبراهيم ومجاهد أنهما تذاكرا هذه الآية \"فلا أقسم بالخنس الجوار الكنس\" فقال إبراهيم لمجاهد قل فيها بما سمعت قال: فقال مجاهد كنا نسمع فيها شيئا وناس يقولون إنها النجوم قال: فقال إبراهيم قل فيها بما سمعت قال: فقال مجاهد كنا نسمع أنها بقر الوحش حين تكنس في حجرتها قال: فقال إبراهيم إنهم يكذبون على علي هذا كما رووا عن علي أنه ضمن الأسفل الأعلى والأعلى الأسفل وتوقف ابن جرير في المراد بقوله \"الخنس الجوار الكنس\" هل هو النجوم أو الظباء وبقر الوحش قال ويحتمل أن يكون الجميع مرادا."
    },
    {
      "ayah": 16,
      "surah": 81,
      "text": "روى مسلم في صحيحه والنسائي في تفسيره عند هذه الآية من حديث مسعر بن كدام عن الوليد بن سريع عن عمرو بن حريث قال: صليت خلف النبي صلى الله عليه وسلم الصبح فسمعته يقرأ \"فلا أقسم بالخنس الجوار الكنس والليل إذا عسعس والصبح إذا تنفس\" ورواه النسائي عن بندار عن غندر عن شعبة عن الحجاج بن عاصم عن أبي الأسود عن عمرو بن حريث به نحوه قال ابن أبي حاتم وابن جرير من طريق الثوري عن أبي إسحاق عن رجل من مراد عن علي \"فلا أقسم بالخنس الجوار الكنس\" قال هي النجوم تخنس بالنهار وتظهر بالليل وقال ابن جرير حدثنا ابن المثنى حدثنا محمد بن جعفر حدثنا شعبة عن سماك بن حرب سمعت خالد بن عرعرة سمعت عليا وسئل عن \"لا أقسم بالخنس الجوار الكنس\" فقال هي النجوم تخنس بالنهار وتكنس بالليل وحدثنا أبو كريب حدثنا وكيع عن إسرائيل عن سماك عن خالد عن علي قال هي النجوم وهذا إسناد جيد صحيح إلى خالد بن عرعرة وهو السهمي الكوفي قال أبو حاتم الرازي روي عن علي وروى عنه سماك والقاسم بن عوف الشيباني ولم يذكر فيه جرحا ولا تعديلا فالله أعلم. وروى يونس عن أبي إسحاق عن الحارث عن علي أنها النجوم رواه ابن أبي حاتم وكذا روي عن ابن عباس ومجاهد والحسن وقتادة والسدي وغيرهم أنها النجوم وقال ابن جرير حدثنا محمد بن بشار حدثنا هوذة بن خليفة حدثنا عوف عن بكر بن عبدالله فى وقوله تعالى \"فلا أقسم بالخنس الجوار الكنس\" قال هي النجوم الدراري التي تجري تستقبل المشرق وقال بعض الأئمة إنما قيل للنجوم الخنس أي في حال طلوعها ثم هي جوار في فلكها وفي حال غيبوبتها يقال لها كنس من قول العرب أوى الظبي إلى كناسه إذا تغيب فيه وقال الأعمش عن إبراهيم قال: قال عبدالله \"فلا أقسم بالخنس\" قال بقر الوحش وكذا قال الثوري عن أبي إسحاق عن أبي ميسرة عن عبدالله \"فلا أقسم بالخنس الجوار الكنس\" ما هي يا عمرو؟ قلت البقر قال وأنا أرى ذلك وكذا روى يونس عن أبي إسحاق عن أبيه وقال أبو داود الطيالسي عن عمرو عن أبيه عن سعيد بن جبير عن ابن عباس \"الجوار الكنس\" قال البقر تكنس إلى الظل وكذا قال سعيد بن جبير وقال العوفي عن ابن عباس هي الظباء وكذا قال سعيد أيضا ومجاهد والضحاك وقال أبو الشعثاء جابر بن زيد هي الظباء والبقر وقال ابن جرير حدثنا يعقوب حدثنا هشيم أخبرنا مغيرة عن إبراهيم ومجاهد أنهما تذاكرا هذه الآية \"فلا أقسم بالخنس الجوار الكنس\" فقال إبراهيم لمجاهد قل فيها بما سمعت قال: فقال مجاهد كنا نسمع فيها شيئا وناس يقولون إنها النجوم قال: فقال إبراهيم قل فيها بما سمعت قال: فقال مجاهد كنا نسمع أنها بقر الوحش حين تكنس في حجرتها قال: فقال إبراهيم إنهم يكذبون على علي هذا كما رووا عن علي أنه ضمن الأسفل الأعلى والأعلى الأسفل وتوقف ابن جرير في المراد بقوله \"الخنس الجوار الكنس\" هل هو النجوم أو الظباء وبقر الوحش قال ويحتمل أن يكون الجميع مرادا."
    },
    {
      "ayah": 17,
      "surah": 81,
      "text": "فيه قولان \"أحدهما\" إقباله بظلامه قال مجاهد أظلم وقال سعيد ابن جبير إذا نشأ وقال الحسن البصري إذا غشي الناس وكذا قال عطية العوفي وقال علي بن أبي طلحة والعوفي عن ابن عباس \"إذا عسعس\" إذا أدبر وكذا قال مجاهد وقتادة والضحاك وكذا قال زيد بن أسلم وابنه عبدالرحمن \"إذا عسعس\" أي إذا ذهب فتولى وقال أبو داود الطيالسي حدثنا شعبة عن عمرو بن مرة عن أبي البحتري سمع أبا عبدالرحمن السلمي قال: خرج علينا علي رضي الله عنه حين ثوب المثوب بصلاة الصبح فقال: أين السائلون عن الوتر \"والليل إذا عسعس والصبح إذا تنفس\" هذا حين أدبر حسن وقد اختار ابن جرير أن المراد بقوله \"إذا عسعس\" إذا أدبر قال لقوله \"والصبح إذا تنفس\" أي أضاء واستشهد بقول الشاعر أيضا: حتي إذا الصبح له تنفسـا وانجاب عنها ليلها وعسعسا أي أدبر وعندي أن المراد بقوله \"إذا عسعس\" إذا أقبل وإن كان يصح استعماله في الأدبار أيضا لكن الإقبال ههنا أنسب كأنه أقسم بالليل وظلامه إذا أقبل وبالفجر وضيائه إذا أشرق كما قال تعالى \"والليل إذا يغشي والنهار إذا تجلى\" وقال تعالى \"والضحي والليل إذا سجي\" وقال تعالى \"فالق الإصباح وجعل الليل سكنا\" وغير ذلك من الآيات وقال كثير من علماء الأصول إن لفظة عسعس تستعمل في الإقبال والإدبار على وجه الاشتراك فعلى هذا يصح أن يراد كل منهما والله أعلم. قال ابن جرير وكان بعض أهل المعرفة بكلام العرب يزعم أن عسعس دنا من أوله وأظلم وقال الفراء كان أبو البلاد النحوي ينشد بيتا: عسعس حتى لو يشا أدنى كان له من ضوئه مقبس يريد لو يشاء إذ دنا أدغم الذال في الدال قال الفراء وكانوا يزعمون أن هذا البيت مصنوع."
    },
    {
      "ayah": 18,
      "surah": 81,
      "text": "قال الضحاك إذا طلع وقال قتادة إذا أضاء وأقبل وقال سعيد بن جبير إذا نشأ وهو المروي عن علي رضي الله عنه وقال ابن جرير يعني ضوء النهار إذا أقبل وتبين."
    },
    {
      "ayah": 19,
      "surah": 81,
      "text": "يعني إن هذا القرآن لتبليغ رسول كريم أي ملك شريف حسن الخلق بهي المنظر وهو جبريل عليه الصلاة والسلام قاله ابن عباس والشعبي وميمون بن مهران والحسن وقتادة والربيع بن أنس والضحاك وغيرهم."
    },
    {
      "ayah": 2,
      "surah": 81,
      "text": "وقوله تعالي \"وإذا النجوم انكدرت\" أي انتثرت كما قال تعالي \"وإذا الكواكب انتثرت\" وأصل الانكدار الانصباب. قال الربيع بن أنس عن أبي العالية عن أبي بن كعب قال: ست آيات قبل يوم القيامة بينا الناس في أسواقهم إذ ذهب ضوء الشمس فبينما هم كذلك إذ تناثرت النجوم فبينما هم كذلك إذ وقعت الجبال على وجه الأرض فتحركت واضطربت واختلطت ففزعت الجن إلى الإنس والإنس إلى الجن واختلطت الدواب والطير والوحوش فماجوا بعضهم في بعض \"وإذا الوحوش حشرت\" قال اختلطت \"وإذا العشار عطلت\" قال أهملها أهلها \"وإذا البحار سجرت\" قال: قالت الجن نحن نأتيكم بالخبر قال فانطلقوا إلى البحر فإذا هو نار تتأجج قال فبينما هم كذلك إذ تصدعت الأرض صدعة واحدة إلى الأرض السابعة السفلى وإلى السماء السابعة العليا قال فبينما هم كذلك إذ جاءتهم الريح فأماتتهم. رواه ابن جرير هذا لفظه وابن أبي حاتم ببعضه وهكذا قال مجاهد والربيع بن خيثم والحسن البصري وأبو صالح وحماد بن أبي سليمان والضحاك في قوله جل وعلا \"وإذا النجوم انكدرت\" أي تناثرت وقال علي بن أبي طلحة عن ابن عباس \"وإذا النجوم انكدرت\" أي تغيرت. وقال يزيد بن أبي مريم عن النبي صلى الله عليه وسلم \"وإذا النجوم انكدرت\" قال \"انكدرت في جهنم وكل من عبد من دون الله فهو في جهنم إلا ما كان من عيسى وأمه ولو رضيا أن يعبدا لدخلاها\" رواه ابن أبي حاتم بالإسناد المتقدم."
    },
    {
      "ayah": 20,
      "surah": 81,
      "text": "\"ذي قوة\" كقوله تعالى \"علمه شديد القوى ذو مرة\" أي شديد الخلق شديد البطش والفعل \"عند ذي العرش مكين\" أي له مكانة عند الله عز وجل ومنزلة رفيعة قال أبو صالح في قوله تعالى \"عند ذي العرش مكين\" قال جبريل يدخل في سبعين حجابا من نور بغير إذن."
    },
    {
      "ayah": 21,
      "surah": 81,
      "text": "\"مطاع ثم\" أي له وجاهة وهو مسموع القول مطاع في الملإ الأعلى قال قتادة \"مطاع ثم\" أي في السموات يعني ليس من أفناد الملائكة بل هو من السادة والأشراف معتنى به انتخب لهذه الرسالة العظيمة. وقوله تعالى \"أمين\" صفة لجبريل بالأمانة وهذا عظيم جدا أن الرب عز وجل يزكي عبده ورسوله الملكي جبريل كما زكى عبده ورسوله البشري محمدا صلى الله عليه وسلم بقوله تعالى \"وما صاحبكم بمجنون\"."
    },
    {
      "ayah": 22,
      "surah": 81,
      "text": "قال الشعبي وميمون بن مهران وأبو صالح ومن تقدم ذكرهم المراد بقوله \"وما صاحبكم بمجنون\" يعني محمدا صلى الله عليه وسلم."
    },
    {
      "ayah": 23,
      "surah": 81,
      "text": "يعني ولقد رأى محمد جبريل الذي يأتيه بالرسالة عن الله عز وجل على الصورة التي خلقه الله عليها له ستمائة جناح \"بالأفق المبين\" أي البين وهي الرؤية الأولى التي كانت بالبطحاء وهي المذكورة في قوله \"علمه شديد القوى ذو مرة فاستوى وهو بالأفق الأعلى ثم دنا فتدلى فكان قاب قوسين أو أدنى فأوحى إلى عبده ما أوحي\" كما تقدم تفسير ذلك وتقريره والدليل عليه أن المراد بذلك جبريل عليه السلام. والظاهر والله أعلم أن هذه السورة نزلت قبل ليلة الإسراء لأنه لم يذكر فيها إلا هذه الرؤية وهى الأولى وأما الثانية وهي المذكورة في قوله تعالى \"ولقد رآه نزلة أخرى عند سدرة المنتهى عندها جنة المأوى إذ يغشى السدرة ما يغشى\" فتلك إنما ذكرت في سورة النجم وقد نزلت بعد سورة الإسراء."
    },
    {
      "ayah": 24,
      "surah": 81,
      "text": "أي وما محمد على ما أنزله الله إليه بظنين أي بمتهم ومنهم من قرأ ذلك بالضاد أي ببخيل بل يبذله لكل أحد. قال سفيان بن عيينية ظنين وضنين سواء أي ما هو بكاذب وما هو بفاجر. والظنين المتهم والضنين البخيل. وقال قتادة كان القرآن غيبا فأنزله الله على محمد فما ضن به على الناس بل نشره وبلغه وبذله لكل من أراده. وهذا قال عكرمة وابن زيد وغير واحد واختار ابن جرير قراءه الضاد \"قلت\" وكلاهما متواتر ومعناه صحيح كما تقدم."
    },
    {
      "ayah": 25,
      "surah": 81,
      "text": "أي وما هذا القرآن بقول شيطان رجيم أي لا يقدر على حمله ولا يريده ولا ينبغي له كما قال تعالى \"وما تنزلت به الشياطين وما ينبغي لهم وما يستطيعون إنهم عن السمع لمعزولون\"."
    },
    {
      "ayah": 26,
      "surah": 81,
      "text": "أي فأين تذهب عقولكم في تكذيبكم بهذا القرآن مع ظهوره ووضوحه وبيان كونه حقا من عند الله عز وجل كما قال الصديق رضي الله عنه لوفد بني حنيفة حين قدموا مسلمين وأمرهم فتلوا عليه شيئا من قرآن مسيلمة الكذاب الذي هو في غاية الهذيان والركاكة فقال: ويحكم أين تذهب عقولكم؟ والله إن هذا الكلام لم يخرج من إل أي من إله وقال قتادة \"فأين تذهبون\" أي عن كتاب الله وعن طاعته."
    },
    { "ayah": 27, "surah": 81, "text": "أي هذا القرآن ذكر لجميع الناس يتذكرون به ويتعظون." },
    {
      "ayah": 28,
      "surah": 81,
      "text": "أي من أراد الهداية فعليه بهذا القرآن فإنه منجاة له وهداية ولا هداية فيما سواه."
    },
    {
      "ayah": 29,
      "surah": 81,
      "text": "أي ليست المشيئة موكولة إليكم فمن شاء اهتدى ومن شاء ضل بل ذلك كله تابع لمشيئة الله تعالى رب العالمين. قال سفيان الثوري عن سعيد بن عبدالعزيز عن سليمان بن موسى: لما نزلت هذه الآية \"لمن شاء منكم أن يستقيم\" قال أبو جهل: الأمر إلينا إن شئنا استقمنا وإن شئنا لم نستقم فأنزل الله تعالى وما تشاءون إلا أن يشاء الله رب العالمين. آخر تفسير سورة التكوير ولله الحمد والمنة."
    },
    { "ayah": 3, "surah": 81, "text": "أي زالت عن أماكنها ونسفت فتركت الأرض قاعا صفصفا." },
    {
      "ayah": 4,
      "surah": 81,
      "text": "قال عكرمة ومجاهد: عشار الإبل قال مجاهد عطلت تركت وسيبت وقال أبي بن كعب والضحاك أهملها أهلها وقال الربيع بن خيثم لم تحلب ولم تصر تخلي عنها أربابها وقال الضحاك تركت لا راعي لها والمعنى في هذا كله متقارب والمقصود أن العشار من الإبل وهي خيارها والحوامل منها التي قد وصلت في حملها إلى الشهر العاشر - واحدتها عشراء ولا يزال ذلك اسمها حتى تضع - قد أشغل الناس عنها وعن كفالتها والانتفاع بها بعدما كانوا أرغب شيء فيها بما دهمهم من الأمر العظيم المفظع الهائل وهو أمر يوم القيامة وانعقاد أسبابها ووقوع مقدماتها وقيل: بل يكون ذلك يوم القيامة يراها أصحابها كذلك لا سبيل لهم إليها وقد قيل في العشار إنها السحاب تعطل عن المسير بين السماء والأرض لخراب الدنيا وقيل إنها الأرض التي تعشر وقيل إنها الديار التي كانت تسكن تعطلت لذهاب أهلها. حكى هذه الأقوال كلها الإمام أبو عبدالله القرطبي في كتابه التذكرة ورجح أنها الإبل وعزاه إلى أكثر الناس \"قلت\" لا يعرف عن السلف والأئمة سواه والله أعلم."
    },
    {
      "ayah": 5,
      "surah": 81,
      "text": "أي جمعت كما قال تعالى \"وما من دابة في الأرض ولا طائر يطير بجناحيه إلا أمم أمثالكم ما فرطنا في الكتاب من شيء ثم إلى ربهم يحشرون\" قال ابن عباس يحشر كل شيء حتى الذباب رواه ابن أبي حاتم وكذا قال الربيع بن خيثم والسدي وغير واحد وكذا قال قتادة في تفسير هذه الآية إن هذه الخلائق موافية فيقضي الله فيها ما يشاء وقال عكرمة حشرها موتها وقال ابن جرير حدثني علي بن مسلم الطوسي حدثنا عباد بن العوام حدثنا حصين عن عكرمة عن ابن عباس في قوله \"وإذا الوحوش حشرت\" قال حشر البهائم موتها وحشر كل شيء الموت غير الجن والإنس فإنهما يوقفان يوم القيامة حدثنا أبو كريب حدثنا وكيع عن سفيان عن أبيه عن أبي يعلى عن الربيع بن خيثم \"وإذا الوحوش حشرت\" قال أتى عليها أمر الله قال سفيان قال أبي فذكرته لعكرمة فقال: قال ابن عباس حشرها موتها وقد تقدم عن أبي بن كعب أنه قال \"وإذا الوحوش حشرت\" اختلطت قال ابن جرير والأولى قول من قال حشرت جمعت قال الله تعالى \"والطير محشورة\" أي مجموعة."
    },
    {
      "ayah": 6,
      "surah": 81,
      "text": "قال ابن جرير حدثنا يعقوب حدثنا ابن علية عن داود عن سعيد بن المسيب قال: قال علي رضي الله عنه لرجل من اليهود أين جهنم؟ قال البحر فقال ما أراه إلا صادقا والبحر المسجور وإذا البحار سجرت وقال ابن عباس وغير واحد يرسل الله عليها الرياح الدبور فتسعرها وتصير نارا تأجج وقد تقدم الكلام على ذلك عند قوله تعالى \"والبحر المسجور\" وقال ابن أبي حاتم حدثنا علي بن الحسين بن الجنيد حدثنا أبو طاهر حدثني عبدالجبار بن سليمان أبو سليمان النفاط - شيخ صالح يشبه مالك بن أنس - عن معاوية بن سعيد قال إن هذا البحر بركة - يعني بحر الروم - وسط الأرض والأنهار كلها تصب فيه والبحر الكبير يصب فيه وأسفله آبار مطبقة بالنحاس فإذا كان يوم القيامة أسجر وهذا أثر غريب عجيب وفي سنن أبي داود \"لا يركب البحر إلا حاج أو معتمر أو غاز فإن تحت البحر نارا وتحت النار بحرا\" الحديث وقد تقدم الكلام عليه في سورة فاطر. وقال مجاهد والحسن بن مسلم: سجرت أوقدت وقال الحسن: يبست وقال الضحاك وقتادة: غاض ماؤها فذهب فلم يبق فيها قطرة وقال الضحاك أيضا سجرت فجرت وقال السدي فتحت وصيرت وقال الربيع بن خيثم سجرت فاضت."
    },
    {
      "ayah": 7,
      "surah": 81,
      "text": "أي جمع كل شكل إلى نظيره كقوله تعالى \"احشروا الذين ظلموا وأزواجهم\" وقال ابن أبي حاتم حدثنا أبي حدثنا محمد بن الصباح البزار حدثنا الوليد بن أبي ثور عن سماك عن النعمان بن بشير أنه قال: قال رسول الله صلى الله عليه وسلم \"وإذا النفوس زوجت\" قال: الضرباء كل رجل مع كل قوم كانوا يعملون عمله\" وذلك بأن الله عز وجل يقول \"وكنتم أزواجا ثلاثة فأصحاب الميمنة ما أصحاب الميمنة وأصحاب المشأمة ما أصحاب المشأمة والسابقون السابقون\" قال هم الضرباء. ثم رواه ابن أبي حاتم من طرق أخر عن سماك بن حرب عن النعمان بن بشير أن عمر بن الخطاب خطب الناس فقرأ \"وإذا النفوس زوجت\" فقال تزوجها أن تؤلف كل شيعة إلى شيعتهم وفي رواية هما الرجلان يعملان العمل فيدخلان به الجنة أو النار وفي رواية عن النعمان قال سئل عمر عن قوله تعالى \"وإذا النفوس زوجت\" قال: يقرن بين الرجل الصالح مع الرجل الصالح ويقرن بين الرجل السوء مع الرجل السوء في النار فذلك تزويج الأنفس. وفي رواية عن النعمان أن عمر قال للناس: ما تقولون في تفسير هذه الآية \"وإذا النفوس زوجت\" ؟ فسكتوا. قال ولكن أعلمه هو الرجل يزوج نظيره من أهل الجنة والرجل يزوج نظيره من أهل النار ثم قرأ \"احشروا الذين ظلموا وأزواجهم\" وقال العوفي عن ابن عباس في قوله تعالى \"وإذا النفوس زوجت\" قال ذلك حين يكون الناس أزواجا ثلاثة وقال ابن أبي نجيح عن مجاهد \"وإذا النفوس زوجت\" قال الأمثال من الناس جمع بينهم وكذا قال الربيع بن خيثم والحسن وقتادة واختاره ابن جرير وهو الصحيح. \"قول آخر\" في قوله تعالى \"وإذا النفوس زوجت\" قال ابن أبي حاتم حدثنا علي بن الحسين بن الجنيد حدثنا أحمد بن عبدالرحمن حدثني أبي عن أبيه عن أشعث بن سرار عن جعفر عن سعيد بن جبير عن ابن عباس قال: يسيل واد من أصل العرش من ماء فيما بين الصيحتين ومقدار ما بينهما أربعون عاما فينبت منه كل خلق بلي من الإنسان أو طير أو دابة ولو مر عليهم مار قد عرفهم قبل ذلك لعرفهم على وجه الأرض قد نبتوا ثم ترسل الأرواح فتزوج الأجساد فذلك قوله تعالى \"وإذا النفوس زوجت\" وكذا قال أبو العالية وعكرمة وسعيد بن جبير والشعبي والحسن البصري أيضا في قوله تعالى \"وإذا النفوس زوجت\" أي زوجت بالأبدان. وقيل زوج المؤمنون بالحور العين وزوج الكافرون بالشياطين. حكاه القرطبي في التذكرة."
    },
    {
      "ayah": 8,
      "surah": 81,
      "text": "هكذا قراءة الجمهور سئلت. والموءودة: هي التي كان أهل الجاهلية يدسونها في التراب كراهية وقال علي بن أبي طلحة عن ابن عباس \"وإذا الموءودة سئلت\" أي سألت. وكذا قال أبو الضحى سألت أي طالبت بدمها. وعن السدي وقتادة مثله وقد وردت أحاديث تتعلق بالموءودة فقال الإمام أحمد حدثنا عبدالله بن يزيد حدثنا سعيد بن أبي أيوب حدثني أبو الأسود وهو محمد بن عبدالرحمن بن نوفل عن عروة عن عائشة عن جذامة بنت وهب أخت عكاشة قالت: حضرت رسول الله صلى الله عليه وسلم في ناس وهو يقول \"لقد هممت أن أنهي عن الغيلة فنظرت في الروم وفارس فإذا هم يغيلون أولادهم ولا يضر أولادهم ذلك شيئا\". ثم سألوه عن العزل فقال رسول الله صلى الله عليه وسلم \"ذلك الوأد الخفي وهو الموءودة سئلت\" ورواه مسلم من حديث أبي عبدالرحمن المقري وهو عبدالله بن يزيد عن سعيد بن أبي أيوب. ورواه أيضا ابن ماجه عن أبي بكر بن أبي شيبة عن يحيي بن إسحاق السيلحيني عن يحيي بن أيوب ورواه مسلم أيضا وأبو داود والترمذي والنسائي من حديث مالك بن أنس ثلاثتهم عن أبي الأسود به. وقال الإمام أحمد حدثنا ابن أبي عدي عن داود بن أبي هند عن الشعبي عن علقمة عن سلمة بن يزيد الجعفي قال: انطلقت أنا وأخي إلى رسول الله صلى الله عليه وسلم فقلنا يا رسول الله إن أمنا مليكة كانت تصل الرحم وتقرى الضيف وتفعل هلكت في الجاهلية فهل ذلك نافعها شيئا؟ قال \"لا\" قلنا فإنها كانت وأدت أختا لنا في الجاهلية فهل ذلك نافعها شيئا قال \"الوائدة والموءودة في النار إلا أن يدرك الوائدة الإسلام فيعفو الله عنها\" ورواه النسائي من حديث داود بن أبي هند به. وقال ابن أبي حاتم حدثنا أحمد بن سنان الواسطي حدثنا أبو أحمد الزبيري حدثنا إسرائيل عن أبي إسحاق عن علقمة وأبي الأحوص عن ابن مسعود قال: قال رسول الله صلى الله عليه وسلم \"الوائدة والموءودة في النار\" وقال أحمد أيضا: حدثنا إسحاق الأزرق أخبرنا عوف حدثتني خنساء ابنة معاوية الصريمية عن عمها قال: قلت يا رسول الله من في الجنة؟ قال \"النبي في الجنة والشهيد في الجنة والمولود في الجنة والموءودة في الجنة\" وقال ابن أبي حاتم حدثنا أبي حدثنا مسلم بن إبراهيم حدثنا قره قال سمعت الحسن يقول: قيل يا رسول الله من في الجنة؟ قال \"الموءودة في الجنة\" هذا حديث مرسل من مراسيل الحسن ومنهم من قبله. وقال ابن أبي حاتم حدثني أبو عبدالله الطهراني حدثنا حفص بن عمر العدني حدثنا الحكم بن أبان عن عكرمة قال: قال ابن عباس أطفال المشركين في الجنة فمن زعم أنهم في النار فقد كذب يقول الله تعالى \"وإذا الموءودة سئلت بأي ذنب قتلت\" قال ابن عباس هي المدفونة وقال عبدالرزاق أخبرنا إسرائيل عن سماك بن حرب عن النعمان بن بشير عن عمر بن الخطاب في قوله تعالى \"وإذا الموءودة سئلت\" قال جاء قيس بن عاصم إلى رسول الله صلى الله عليه وسلم فقال يا رسول الله إني وأدت بنات لي في الجاهلية قال \"أعتق عن كل واحدة منهن رقبة\" قال يا رسول الله إني صاحب إبل قال \"فانحر عن كل واحدة منهن بدنة\" قال الحافظ أبو بكر البزار خولف فيه عبدالرزاق ولم يكتبه إلا عن الحسين بن مهدي عنه وقد رواه ابن أبي حاتم فقال أخبرنا أبو عبدالله الطهراني فيما كتب إلي قال حدثنا عبدالرزاق فذكره بإسناده مثله إلا أنه قال: وأدت ثمان بنات لي في الجاهلية وقال في آخره \"فأهد إن شئت عن كل واحدة بدنة\" ثم قال حدثنا أبي حدثنا عبدالله بن رجاء حدثنا قيس بن الربيع عن الأغر بن الصباح عن خليفة بن حصين قال قدم قيس بن عاصم على رسول الله صلى الله عليه وسلم فقال يا رسول الله إني وأدت اثنتي عشرة ابنة لي في الجاهلية أو ثلاث عشرة قال \"أعتق عددهن نسما\" قال فأعتق عددهن نسما فلما كان في العام المقبل جاء بمائة ناقة فقال يا رسول الله هذه صدقة قومي على أثر ما صنعت بالمسلمين قال علي بن أبي طالب فكنا نريحها ونسميها القيسية."
    },
    {
      "ayah": 9,
      "surah": 81,
      "text": "فيوم القيامة تسئل الموءودة على أي ذنب قتلت ليكون ذلك تهديدا لقاتلها فإنه إذا سئل المظلوم فما ظن الظالم إذا ؟."
    }
  ]
}
