{
  "ayahs": [
    {
      "ayah": 1,
      "surah": 82,
      "text": "سورة الانفطار: قال النسائي أخبرنا محمد بن قدامة حدثنا جرير عن الأعمش عن محارب بن دثار عن جابر قال: قام معاذ فصلى العشاء الآخرة فطول فقال النبي صلى الله عليه وسلم \"أفتان أنت يا معاذ؟ أين كنت عن سبح اسم ربك الأعلى والضحى وإذا السماء انفطرت ؟\" وأصل الحديث مخرج فى الصحيحين ولكن ذكر \"إذا السماء انفطرت\" في أفراد النسائي. وقد تقدم من رواية عبدالله بن عمر عن النبي صلى الله عليه وسلم قال \"من سره أن ينظر إلى القيامة رأي عين فليقرأ \"إذا الشمس كورت \"و \"إذا السماء انفطرت\" و \"إذا السماء انشقت\". أي انشقت كما قال تعالى \"السماء منفطر به\"."
    },
    {
      "ayah": 10,
      "surah": 82,
      "text": "يعني وإن عليكم لملائكة حفظة كراما فلا تقابلوهم بالقبائح فإنهم يكتبون عليكم جميع أعمالكم."
    },
    {
      "ayah": 11,
      "surah": 82,
      "text": "قال ابن أبي حاتم حدثنا أبي حدثنا علي بن محمد الطنافسي حدثنا وكيع حدثنا سفيان ومسعر عن علقمة بن مرثد عن مجاهد قال: قال رسول الله صلى الله عليه وسلم \"أكرموا الكرام الكاتبين الذين لا يفارقونكم إلا عند إحدى حالتين الجنابة والغائط فإذا اغتسل أحدكم فليستتر بجرم حائط أو ببعيره أو ليستره أخوه\". وقد رواه الحافظ أبو بكر البزار فوصله بلفظ آخر فقال حدثنا محمد بن عفان بن كرامة حدثنا عبيدالله بن موسى عن حفص بن سليمان عن علقمة بن مرثد عن مجاهد عن ابن عباس قال: قال رسول الله صلى الله عليه وسلم \"إن الله ينهاكم عن التعري فاستحيوا من ملائكة الله الذين معكم الكرام الكاتبين الذين لا يفارقونكم إلا عند إحدى ثلاث حالات: الغائط والجنابة والغسل فإذا اغتسل أحدكم بالعراء فليستتر بثوبه أو بجرم حائط أو ببعيره\" ثم قال حفص بن سليمان لين الحديث وقد روي عنه واحتمل حديثه. وقال الحافظ أبو بكر البزار حدثنا زياد بن أيوب حدثنا ميسرة بن إسماعيل الحلبي حدثنا تمام بن نجيح عن الحسن يعني البصري عن أنس قال: قال رسول الله صلى الله عليه وسلم \"ما من حافظين يرفعان إلى الله عز وجل ما حفظا في يوم فيرى في أول الصحيفة وفي آخرها استغفارا إلا قال الله تعالى قد غفرت لعبدي ما بين طرفي الصحيفة\" ثم قال تفرد به تمام بن نجيح وهو صالح الحديث \"قلت\" وثقه ابن معين وضعفه البخاري وأبو زرعة وابن أبي حاتم والنسائي وابن عدي ورماه ابن حبان بالوضع وقال الإمام أحمد لا أعرف حقيقة أمره."
    },
    {
      "ayah": 12,
      "surah": 82,
      "text": "وقال الحافظ أبو بكر البزار حدثنا إسحاق بن سليمان البغدادي المعروف بالفلوسي حدثنا بيان بن حمران حدثنا سلام عن منصور بن زاذان عن محمد بن سيرين عن أبي هريرة قال: قال رسول الله صلى الله عليه وسلم \"إن لله ملائكة يعرفون بني آدم - وأحسبه قال: ويعرفون أعمالهم - فإذا نظروا إلى عبد يعمل بطاعة الله وذكروه بينهم وسموه وقالوا أفلح الليلة فلان وإذا نظروا إلى عبد يعمل بمعصية الله وذكروه بينهم وسموه وقالوا هلك الليلة فلان\" ثم قال البزار سلام هذا أحسبه سلام المدائني وهو لين الحديث."
    },
    {
      "ayah": 13,
      "surah": 82,
      "text": "يخبر تعالى عما يصير الأبرار إليه من النعيم وهم الذين أطاعوا الله عز وجل ولم يقابلوه بالمعاصي وقد روى ابن عساكر في ترجمة موسى بن محمد عن هشام بن عمار عن عيسى بن يونس بن أبي إسحاق عن عبيدالله عن محارب عن ابن عمر عن النبي صلى الله عليه وسلم قال \"إنما سماهم الله الأبرار لأنهم بروا الآباء والأبناء\"."
    },
    { "ayah": 14, "surah": 82, "text": "ثم ذكر ما يصير إليه الفجار من الجحيم والعذاب المقيم." },
    { "ayah": 15, "surah": 82, "text": "أي يوم الحساب والجزاء والقيامة." },
    {
      "ayah": 16,
      "surah": 82,
      "text": "أي لا يغيبون عن العذاب ساعة واحدة ولا يخفف عنهم من عذابها ولا يجابون إلى ما يسألون من الموت أو الراحة ولو يوما واحدا."
    },
    { "ayah": 17, "surah": 82, "text": "تعظيم لشأن يوم القيامة." },
    { "ayah": 18, "surah": 82, "text": "ثم أكده بقوله تعالى \"ثم ما أدراك ما يوم الدين\"." },
    {
      "ayah": 19,
      "surah": 82,
      "text": "ثم فسره بقوله \"يوم لا تملك نفس لنفس شيئا\" أي لا يقدر أحد على نفع أحد ولا خلاصه مما هو فيه إلا أن يأذن الله لمن يشاء ويرضي ونذكر ههنا حديث \"يا بني هاشم أنقذوا أنفسكم من النار لا أملك لكم من الله شيئا\" وقد تقدم في آخر تفسير سورة الشعراء ولهذا قال \"والأمر يومئذ لله\" كقوله \"لمن الملك اليوم لله الواحد القهار\" وكقوله \"الملك يومئذ الحق للرحمن\" وكقوله \"مالك يوم الدين قال قتادة \"يوم لا تملك نفس لنفس شيئا والأمر يومئذ لله\" والأمر والله اليوم لله ولكنه لا ينازعه فيه يومئذ أحد. آخر تفسير سورة الانفطار ولله الحمد والمنة وبه التوفيق والعصمة."
    },
    { "ayah": 2, "surah": 82, "text": "أي تساقطت." },
    {
      "ayah": 3,
      "surah": 82,
      "text": "قال علي بن أبي طلحة عن ابن عباس فجر الله بعضهم في بعض. وقال الحسن فجر الله بعضها في بعض فذهب ماؤها وقال قتادة اختلط عذبها بمالحها وقال الكلبي ملئت."
    },
    { "ayah": 4, "surah": 82, "text": "أي إذا كان هذا حصل هذا." },
    { "ayah": 5, "surah": 82, "text": "أي إذا كان هذا حصل هذا." },
    {
      "ayah": 6,
      "surah": 82,
      "text": "هذا تهديد لا كما يتوهمه بعض الناس من أنه إرشاد إلى الجواب حيث قال الكريم حتى يقول قائلهم غره كرمه بل المعنى في هذه الآية ما غرك يا ابن آدم بربك الكريم أي العظيم حتى أقدمت على معصيته وقابلته بما لا يليق؟ كما جاء في الحديث: \"يقول الله تعالى يوم القيامة يا ابن آدم ما غرك بي؟ يا ابن آدم ماذا أجبت المرسلين؟\" قال ابن أبي حاتم حدثنا ابن أبي عمر حدثنا سفيان أن عمر سمع رجلا يقرأ \"يا أيها الإنسان ما غرك بربك الكريم\" فقال عمر الجهل. وقال أيضا حدثنا عمر بن شيبة حدثنا أبو خلف حدثنا يحيى البكاء سمعت ابن عمر يقول وقرأ هذه الآية \"يا أيها الإنسان ما غرك بربك الكريم\" قال ابن عمر: غره والله جهله قال: وروي عن ابن عباس والربيع بن خيثم والحسن مثل ذلك. وقال قتادة ما غرك بربك الكريم شيء ما غر ابن آدم غير هذا العدو الشيطان. وقال الفضيل بن عياض لو قال لي ما غرك بي لقلت ستورك المرخاة. وقال أبو بكر الوراق لو قال لي ما غرك بربك الكريم لقلت غرني كرم الكريم. وقال بعض أهل الإشارة إنما قال بربك الكريم دون سائر أسمائه وصفاته كأنه لقنه الإجابة وهذا الذي تخيله هذا القائل ليس بطائل لأنه إنما أتى باسمه الكريم لينبه على أنه لا ينبغي أن يقابل الكريم بالأفعال القبيحة وأعمال الفجور. وقد حكي البغوي عن الكلبي ومقاتل أنهما قالا نزلت هذه الآية في الأسود بن شريق ضرب النبي صلى الله عليه وسلم ولم يعاقب في الحالة الراهنة فأنزل الله تعالى \"ما غرك بربك الكريم\"؟."
    },
    {
      "ayah": 7,
      "surah": 82,
      "text": "أي ما غرك بالرب الكريم الذي خلقك فسواك فعدلك أي جعلك سويا مستقيما معتدل القامة منتصبها في أحسن الهيئات والأشكال؟ قال الإمام أحمد حدثنا أبو المغيرة حدثنا جرير حدثني عبدالرحمن بن ميسرة عن جبير بن نفير عن بشر بن جحاش القرشي أن رسول الله صلى الله عليه وسلم بصق يوما في كفه فوضع عليها أصبعه ثم قال: \"قال الله عز وجل: يا ابن آدم أني تعجزني وقد خلقتك من مثل هذه؟ حتي إذا سويتك وعدلتك مشيت بين بردين وللأرض منك وئيد فجمعت ومنعت حتي إذا بلغت التراقي قلت أتصدق وأنى أوان الصدقة؟\" وكذا رواه ابن ماجه عن أبي بكر بن أبي شيبة عن يزيد بن هارون عن جرير بن عثمان به قال شيخنا الحافظ أبو الحجاج المزي وتابعه يحيى بن حمزة عن ثور بن يزيد عن عبدالرحمن بن ميسرة."
    },
    {
      "ayah": 8,
      "surah": 82,
      "text": "قال مجاهد في أي شبه أب أو أم أو خال أو عم. وقال ابن جرير حدثني محمد بن سنان الفزاري حدثنا مطهر بن الهيثم حدثنا موسى بن علي بن رباح حدثني أبي عن جدي أن رسول الله صلى الله عليه وسلم قال له \"وما ولد لك\" قال يا رسول الله ما عسى أن يولد لي إما غلام وإما جارية قال \"فمن يشبه\" قال يا رسول الله من عسى أن يشبه إما أباه وإما أمه فقال النبي صلى الله عليه وسلم عندها \"مه لا تقولن هكذا إن النطفة إذا استقرت في الرحم أحضرها الله تعالى كل نسب بينها وبين آدم؟ أما قرأت هذه الآية في كتاب الله تعالى \"في أي صورة ما شاء ركبك\"؟ قال شكلك. وهكذا رواه ابن أبي حاتم والطبراني من حديث مطهر بن الهيثم به وهذا الحديث لو صح لكان فيصلا في هذه الآية ولكن إسناده ليس بالثابت لأن مطهر بن الهيثم قال فيه أبو سعيد بن يونس كان متروك الحديث وقال ابن حبان: يروى عن موسى بن علي وغيره مالا يشبه حديث الإثبات ولكن في الصحيحين عن أبي هريرة أن رجلا قال يا رسول الله إن امرأتي ولدت غلاما أسود قال \"هل لك من إبل؟\" قال نعم قال \"فما ألوانها؟\" قال حمر قال \"فهل فيها من أورق\" قال نعم قال \"فأنى أتاها ذلك؟\" قال عسى أن يكون نزعه عرق\" قال \"هذا عسى أن يكون نزعة عرق وقد قال عكرمة في قوله تعالى \"في أي صورة ما شاء ركبك\" إن شاء في صورة قرد وإن شاء في صورة خنزير وكذا قال أبو صالح في أي صورة ما شاء ركبك إن شاء فى صورة كلب وإن شاء في صورة حمار وإن شاء في صورة خنزير وقال قتادة في أي صورة ما شاء ركبك قال قادر والله ربنا على ذلك ومعني هذا القول عند هؤلاء أن الله عز وجل قادر على خلق النطفة على شكل قبيح من الحيوانات المنكرة الخلق ولكن بقدرته ولطفه وحلمه يخلقه على شكل حسن مستقيم معتدل تام حسن المنظر والهيئة."
    },
    {
      "ayah": 9,
      "surah": 82,
      "text": "أي إنما يحملكم على مواجهة الكريم ومقابلته بالمعاصي تكذيب في قلوبكم بالمعاد والجزاء والحساب."
    }
  ]
}
