{
  "ayahs": [
    {
      "ayah": 1,
      "surah": 83,
      "text": "قال النسائي وابن ماجه أخبرنا محمد بن عقيل زاد ابن ماجه وعبدالرحمن بن بشر قالا: حدثنا علي بن الحسين بن واقد حدثني أبي عن يزيد وهو ابن أبي سعيد النحوي مولى قريش عن عكرمة عن ابن عباس قال: لما قدم النبي صلى الله عليه وسلم المدينة كانوا من أخبث الناس كيلا فأنزل الله تعالى \"ويل للمطففين\" فحسنوا الكيل بعد ذلك وقال ابن أبي حاتم حدثنا جعفر بن النضر بن حماد حدثنا محمد بن عبيد عن الأعمش عن عمرو بن مرة عن عبدالله بن الحارث عن هلال بن طلق قال بينما أنا أسير مع ابن عمر فقلت من أحسن الناس هيئة وأوفاهم كيلا أهل مكة وأهل المدينة قال حق لهم أما سمعت الله تعالى يقول\" ويل للمطففين\" وقال ابن جرير حدثنا أبو السائب حدثنا ابن فضيل عن ضرار عن عبدالله المكتب عن رجل عن عبدالله قال: قال له رجل يا أبا عبدالرحمن إن أهل المدينة ليوفون الكيل قال وما يمنعهم أن يوفوا الكيل وقد قال الله تعالى \"ويل للمطففين - حتى بلغ - يوم يقوم الناس لرب العالمين\" والمراد بالتطفيف ههنا البخس في المكيال والميزان إما بالازدياد إن اقتضى من الناس وإما بالنقصان إن قضاهم."
    },
    {
      "ayah": 10,
      "surah": 83,
      "text": "أي إذا صاروا يوم القيامة إلى ما أوعدهم الله من السجن والعذاب المهين وقد تقدم الكلام على قوله ويل بما أغني عن إعادته وأن المراد من ذلك الهلاك والدمار كما يقال ويل لفلان وكما جاء في المسند والسنن من رواية بهز بن حكيم بن معاوية بن حيدة عن أبيه عن جده قال: قال رسول الله صلى الله عليه وسلم \"ويل للذي يحدث فيكذب ليضحك الناس ويل له ويل له\"."
    },
    { "ayah": 11, "surah": 83, "text": "أي لا يصدقون بوقوعه ولا يعتقدون كونه ويستبعدون أمره." },
    {
      "ayah": 12,
      "surah": 83,
      "text": "أي معتد في أفعاله من تعاطي الحرام والمجاوزة في تناول المباح والأثيم في أقواله إن حدث كذب وإن وعد أخلف وإن خاصم فجر."
    },
    {
      "ayah": 13,
      "surah": 83,
      "text": "أي إذا سمع كلام الله تعالى من الرسول يكذب به ويظن به ظن السوء فيعتقد أنه مفتعل مجموع من كتب الأوائل كما قال تعالى \"وإذا قيل لهم ماذا أنزل ربكم قالوا أساطير الأولين\" وقال تعالى \"وقالوا أساطير الأولين اكتتبها فهي تملى عليه بكرة وأصيلا\"."
    },
    {
      "ayah": 14,
      "surah": 83,
      "text": "أي ليس الأمر كما زعموا ولا كما قالوا إن هذا القرآن أساطير الأولين بل هو كلام الله ووحيه وتنزيله على رسوله صلى الله عليه وسلم وإنما حجب قلوبهم عن الإيمان به ما عليها من الرين الذي قد لبس قلوبهم من كثرة الذنوب والخطايا ولهذا قال تعالى \"كلا بل ران على قلوبهم ما كانوا يكسبون\" والرين يعتري قلوب الكافرين والغيم للأبرار والغين للمقربين وقد روى ابن جرير والترمذي والنسائي وابن ماجه من طرق عن محمد بن عجلان عن القعقاع بن حكيم عن أبي صالح عن أبي هريرة عن النبي صلى الله عليه وسلم قال \"إن العبد إذا أذنب ذنبا كانت نكتة سوداء في قلبه فإن تاب منها صقل قلبه وإن زاد زادت\" فذلك قول الله تعالى \"كلا بل ران على قلوبهم ما كانوا يكسبون\" وقال الترمذي حسن صحيح ولفظ النسائي \"إن العبد إذا أخطأ خطيئة نكت فى قلبه نكتة سوداء فإن هو نزع واستغفر وتاب صقل قلبه فإن عاد زيد فيها حتى تعلو قلبه فهو الران الذي قال الله تعالى \"كلا بل ران على قلوبهم ما كانوا يكسبون\". وقال أحمد حدثنا صفوان بن عيسى أخبرنا ابن عجلان عن القعقاع بن حكيم عن أبي صالح عن أبي هريرة قال: قال رسول الله صلى الله عليه وسلم \"إن المؤمن إذا أذنب كانت نكتة سوداء في قلبه فإن تاب ونزع واستغفر صقل قلبه فإن زاد زادت حتي تعلو قلبه وذاك الران الذي ذكر الله في القرآن \"كلا بل ران قلوبهم ما كانوا يكسبون\" وقال الحسن البصري هو الذنب على الذنب حتى يعمى القلب فيموت وكذا قال مجاهد بن جبير وقتادة وابن زيد وغيرهم."
    },
    {
      "ayah": 15,
      "surah": 83,
      "text": "أي لهم يوم القيامة منزل ونزل سجين ثم هم يوم القيامة مع ذلك محجوبون عن رؤية ربهم وخالقهم قال الإمام أبو عبدالله الشافعي: وفي هذه الآية دليل على أن المؤمنين يرونه عز وجل يومئذ وهذا الذي قاله الإمام الشافعي رحمه الله في غاية الحسن وهو استدلال بمفهوم هذه الآية: كما دل عليه منطوق قوله تعالى \"وجوه يومئذ ناضرة إلى ربها ناظرة\" وكما دلت على ذلك الأحاديث الصحاح المتواترة في رؤية المؤمنين ربهم عز وجل في الدار الآخرة رؤية بالأبصار فى عرصات القيامة وفي روضات الجنان الفاخرة. وقد قال ابن جرير حدثنا أبو معمر المقري حدثنا عبدالوارث بن سعيد عن عمرو بن عبيد عن الحسن في قوله تعالى \"كلا إنهم عن ربهم يومئذ لمحجوبون\" قال يكشف الحجاب فينظر إليه المؤمنون والكافرون ثم يحجب عنه الكافرون وينظر إليه المؤمنون كل يوم غدوة وعشية أو كلاما هذا معناه."
    },
    { "ayah": 16, "surah": 83, "text": "أي ثم هم مع هذا الحرمان عن رؤية الرحمن من أهل النيران." },
    { "ayah": 17, "surah": 83, "text": "أي يقال لهم ذلك على وجه التقريع والتوبيخ والتصغير والتحقير." },
    {
      "ayah": 18,
      "surah": 83,
      "text": "وهم بخلاف الفجار لفي عليين أي مصيرهم إلي عليين وهو بخلاف سجين.قال الأعمش عن شمر بن عطية عن هلال بن يساف قال سأل ابن عباس كعبا وأنا حاضر عن سجين قال هي الأرض السابعة وفيها أرواح الكفار وسأله عن عليين فقال هي السماء السابعة وفيها أرواح المؤمنين وهكذا قال غير واحد إنها السماء السابعة وقال علي بن أبي طلحة عن ابن عباس في قوله \"كلا إن كتاب الأبرار لفي عليين\" يعني الجنة. وفي رواية العوفي عنه أعمالهم في السماء عند الله وكذا قال الضحاك وقال قتادة عليون ساق العرش اليمنى وقال غيره عليون عند سدرة المنتهى والظاهر أن عليين مأخوذ من العلو وكلما علا الشيء وارتفع عظم واتسع."
    },
    { "ayah": 19, "surah": 83, "text": "ولهذا قال تعالى معظما أمره ومفخما شأنه \"وما أدراك ما عليون\"." },
    {
      "ayah": 2,
      "surah": 83,
      "text": "بقوله تعالى \"الذين إذا اكتالوا على الناس\" أى من الناس \"يستوفون\" أي يأخذون حقهم بالوافي والزائد."
    },
    { "ayah": 20, "surah": 83, "text": "هم الملائكة قاله قتادة وقال العوفي عن ابن عباس يشهده من كل سماء مقربوها." },
    { "ayah": 21, "surah": 83, "text": "أي يوم القيامة هم في نعيم مقيم وجنات فيها فضل عميم." },
    { "ayah": 22, "surah": 83, "text": "أي يوم القيامة هم في نعيم مقيم وجنات فيها فضل عميم." },
    {
      "ayah": 23,
      "surah": 83,
      "text": "وهي السرر تحت الحجال ينظرون قيل معناه ينظرون في ملكهم وما أعطاهم الله من الخير والفضل الذي لا ينقضي ولا يبيد وقيل معناه \"على الأرائك ينظرون\" إلى الله عز وجل وهذا مقابل لما وصف به أولئك الفجار\" كلا إنهم عن ربهم يومئذ لمحجوبون\" فذكر عن هؤلاء أنهم يبيحون النظر إلى الله عز وجل وهم على سررهم وفرشهم كما تقدم في حديث ابن عمر \"إن أدنى أهل الجنة منزلة لمن ينظر في ملكه مسيرة ألفي سنة يرى أقصاه كما يرى أدناه وإن أعلاهم لمن ينظر إلى الله عز وجل في اليوم مرتين\"."
    },
    {
      "ayah": 24,
      "surah": 83,
      "text": "أي تعرف إذا نظرت إليهم في وجوههم نضرة النعيم أي صفة الترافة والحشمة والسرور والدعة والرياسة مما هم فيه من النعيم العظيم."
    },
    {
      "ayah": 25,
      "surah": 83,
      "text": "أي يسقون من خمر من الجنة والرحيق من أسماء الخمر قاله ابن مسعود وابن عباس ومجاهد والحسن وقتادة وابن زيد قال الإمام أحمد حدثنا حسن حدثنا زهير عن سعد أبي المحاصر الطائي عن عطية بن سعد العوفي عن أبي سعيد الخدري أراه قد رفعه إلى النبي صلى الله عليه وسلم قال \"أيما مؤمن سقى مؤمنا شربة ماء على ظمإ سقاه الله تعالى يوم القيامة من الرحيق المختوم وأيما مؤمن أطعم مؤمنا على جوع أطعمه الله من ثمار الجنة وأيما مؤمن كسا مؤمنا ثوبا على عري كساه الله من خضر الجنة\"."
    },
    {
      "ayah": 26,
      "surah": 83,
      "text": "وقال ابن مسعود في قوله \"ختامه مسك\" أي خلطه مسك وقال العوفي عن ابن عباس طيب الله لهم الخمر فكان آخر شيء جعل فيها مسك ختم بمسك وكذا قال قتادة والضحاك وقال إبراهيم والحسن ختامه مسك أي عاقبته مسك وقال ابن جرير حدثنا ابن حميد حدثنا يحيى بن واضح حدثنا أبو حمزة عن جابر عن عبدالرحمن بن سابط عن أبي الدرداء \"ختامه مسك\" قال شراب أبيض مثل الفضة يختمون به شرابهم ولو أن رجلا من أهل الدنيا أدخل أصبعه فيه ثم أخرجها لم يبق ذو روح إلا وجد طيبها. وقال ابن أبي نجيح عن مجاهد \"ختامه مسك\" قال طيبه مسك. وقوله تعالى \"وفي ذلك فليتنافس المتنافسون\" أي وفي مثل هذه الحال فليتفاخر المتفاخرون وليتباهى ويكاثر ويستبق إلى مثله المستبقون كقوله تعالى \"لمثل هذا فليعمل العاملون\"."
    },
    {
      "ayah": 27,
      "surah": 83,
      "text": "أي ومزاج هذا الرحيق الموصوف من تسنيم أي من شراب يقال له تسنيم وهو أشرف شراب أهل الجنة وأعلاه قاله أبو صالح والضحاك."
    },
    {
      "ayah": 28,
      "surah": 83,
      "text": "أي يشربها المقربون صرفا وتمزج لأصحاب اليمين مزجا قاله ابن مسعود وابن عباس ومسروق وقتادة وغيرهم."
    },
    {
      "ayah": 29,
      "surah": 83,
      "text": "يخبر تعالى عن المجرمين أنهم كانوا في الدار الدنيا يضحكون من المؤمنين أي يستهزئون بهم ويحتقرونهم."
    },
    {
      "ayah": 3,
      "surah": 83,
      "text": "أى ينقصون والأحسن أن يجعل كالوا ووزنوا متعديا ويكون هم في محل نصب ومنهم من يجعلها ضميرا مؤكدا للمستتر فى قوله كالوا ووزنوا ويحذف المفعول لدلالة الكلام عليه وكلاهما متقارب وقد أمر الله تعالى بالوفاء في الكيل والميزان فقال تعالى \"وأوفوا الكيل إذا كلتم وزنوا بالقسطاس المستقيم ذلك خير وأحسن تأويلا\" وقال تعالى \"وأوفوا الكيل والميزان بالقسط لا نكلف نفسا إلا وسعها\" وقال تعالى \"وأقيموا الوزن بالقسط ولا تخسروا الميزان\" وأهلك الله قوم شعيب ودمرهم على ما كانوا يبخسون الناس في الميزان والمكيال."
    },
    { "ayah": 30, "surah": 83, "text": "وإذا مروا بالمؤمنين يتغامزون عليهم أي محتقرين لهم." },
    {
      "ayah": 31,
      "surah": 83,
      "text": "أي وإذا انقلب أى رجع هؤلاء المجرمون إلى منازلهم انقلبوا إليها فكهين أي مهما طلبوا وجدوا ومع هذا ما شكروا نعمة الله عليهم بل اشتغلوا بالقوم المؤمنين يحقرونهم ويحسدونهم."
    },
    { "ayah": 32, "surah": 83, "text": "أي لكونهم على غير دينهم." },
    {
      "ayah": 33,
      "surah": 83,
      "text": "أي وما بعث هؤلاء المجرمون حافظين على هؤلاء المؤمنين ما يصدر منهم من أعمالهم وأقوالهم ولا كلفوا بهم؟ فلم اشتغلوا بهم وجعلوهم نصب أعينهم كما قال تعالى \"اخسئوا فيها ولا تكلمون إنه كان فريق من عبادي يقولون ربنا آمنا فاغفر لنا وارحمنا وأنت خير الراحمين فاتخذتموهم سخريا حتى أنسوكم ذكري وكنتم منهم تضحكون إني جزيتهم اليوم بما صبروا أنهم هم الفائزون\"."
    },
    {
      "ayah": 34,
      "surah": 83,
      "text": "\"فاليوم\" يعني يوم القيامة \"الذين آمنوا من الكفار يضحكون\" أي في مقابلة ما ضحك بهم أولئك."
    },
    {
      "ayah": 35,
      "surah": 83,
      "text": "أي إلى الله عز وجل في مقابلة من زعم فيهم أنهم ضالون وليسوا بضالين بل هم من أولياء الله المقربين ينظرون إلى ربهم في دار كرامته."
    },
    {
      "ayah": 36,
      "surah": 83,
      "text": "أي هل جوزي الكفار على ما كانوا يقابلون به المؤمنين من الاستهزاء والتنقيص أم لا؟ يعني قد جوزوا أوفر الجزاء وأتمه وأكمله. آخر تفسير سورة المطففين ولله الحمد والمنة."
    },
    { "ayah": 4, "surah": 83, "text": "أي أما يخاف أولئك من البعث والقيام بين يدي من يعلم السرائر والضمائر." },
    { "ayah": 5, "surah": 83, "text": "في يوم عظيم الهول كثير الفزع جليل الخطب من خسر فيه أدخل نارا حامية؟." },
    {
      "ayah": 6,
      "surah": 83,
      "text": "أي يقومون حفاة عراة غرلا فى موقف صعب حرج ضيق ضنك على المجرم ويغشاهم من أمر الله تعالى ما تعجز القوى والحواس عنه. قال الإمام مالك عن نافع عن ابن عمر أن النبي صلى الله عليه وسلم قال \"يوم يقوم الناس لرب العالمين\" حتي يغيب أحدهم في رشحه إلى أنصاف أذنيه\" رواه البخاري من حديث مالك وعبدالله بن عون كلاهما عن نافع به ورواه مسلم من الطريقين أيضا وكذلك رواه أيوب بن يحيى وصالح بن كيسان وعبدالله وعبيدالله ابنا عمر ومحمد بن إسحاق عن نافع عن ابن عمر به ولفظ الإمام أحمد حدثنا يزيد أخبرنا ابن إسحاق عن نافع عن ابن عمر سمعت رسول الله صلى الله عليه وسلم يقول \"يوم يقوم الناس لرب العالمين لعظمة الرحمن عز وجل يوم القيامة حتى إن العرق ليلجم الرجال إلى أنصاف آذانهم\" \"حديث آخر\" قال الإمام أحمد حدثنا إبراهيم بن إسحاق حدثنا ابن المبارك عن عبدالرحمن بن يزيد بن جابر حدثني سليم بن عامر حدثني المقداد يعني ابن الأسود الكندي قال سمعت رسول الله صلى الله عليه وسلم يقول \"إذا كان يوم القيامة أدنيت الشمس من العباد حتى تكون قدر ميل أو ميلين - قال - فتصهرهم الشمس فيكونون في العرق كقدر أعمالهم منهم من يأخذه إلى عقبيه ومنهم من يأخذه إلى ركبتيه ومنهم من يأخذه إلى حقويه ومنهم من يلجمه إلجاما\" رواه مسلم عن الحكم بن موسى عن يحيى بن حمزة والترمذي عن سويد عن ابن المبارك كلاهما عن ابن جابر به. \"حديث آخر\" قال الإمام أحمد حدثنا الحسن بن سوار حدثنا الليث بن سعد عن معاوية بن صالح أن أبا عبدالرحمن حدثه عن أبي أمامة أن رسول الله صلى الله عليه وسلم قال \"تدنو الشمس يوم القيامة عل قدر ميل ويزاد في حرها كذا وكذا تغلي منها الهوام كما تغلي القدور يعرقون فيها على قدر خطاياهم منهم من يبلغ إلى كعبيه ومنهم من يبلغ إلى ساقيه ومنهم من يبلغ إلى وسطه ومنهم من يلجمه العرق\" انفرد به أحمد. \"حديث آخر\" قال الإمام أحمد حدثنا حسن حدثنا ابن لهيعة حدثنا أبو عشانة حيي بن مؤمن أنه سمع عقبة بن عامر يقول سمعت رسول صلى الله عليه وسلم يقول \"تدنو الشمس من الأرض فيعرق الناس فمن الناس من يبلغ عرقه عقبيه ومنهم من يبلغ إلى نصف الساق ومنهم من يبلغ إلى ركبتيه ومنهم من يبلغ العجز ومنهم من يبلغ الخاصرة ومنهم من يبلغ منكبيه ومنهم من يبلغ وسط فيه - وأشار بيده فألجمها فاه رأيت رسول الله صلى الله عليه وسلم يشير بيده هكذا - ومنهم من يغطيه عرقه\" وضرب بيده إشارة انفرد به أحمد وفي حديث أنهم يقومون سبعين سنة لا يتكلمون وقيل يقومون ثلثمائة سنة وقيل يقومون أربعين ألف سنة ويقضى بينهم في مقدار عشرة آلاف سنة كما في صحيح مسلم عن أبي هريرة مرفوعا \"في يوم كان مقداره خمسين ألف سنة\" وقد قال ابن أبي حاتم حدثنا أبي حدثنا أبو عون الزيادي أخبرنا عبدالسلام بن عجلان سمعت أبا يزيد المدني عن أبي هريرة قال: قال رسول الله صلى الله عليه وسلم لبشير الغفاري \"كيف أنت صانع في يوم يقوم الناس فيه ثلثمائة سنة لرب العالمين من أيام الدنيا لا يأتيهم فيه خبر من السماء ولا يؤمر فيهم بأمر؟\" قال بشير: المستعان الله قال \"فإذا أويت إلى فراشك فتعوذ بالله من كرب يوم القيامة وسوء الحساب\" ورواه ابن جرير من طريق عبدالسلام به. وفي سنن أبي داود أن رسول الله صلى الله عليه وسلم كان يتعوذ بالله من ضيق المقام يوم القيامة. وعن ابن مسعود يقومون أربعين سنة رافعي رءوسهم إلى السماء لا يكلمهم أحد قد ألجم العرق برهم وفاجرهم وعن ابن عمر: يقومون مائة سنة رواهما ابن جرير. وفي سنن أبي داود والنسائي وابن ماجه من حديث زيد بن الحباب عن معاوية بن صالح عن أزهر بن سعيد الحرازي عن عاصم بن حميد عن عائشة أن رسول الله صلى الله عليه وسلم كان يفتتح قيام الليل يكبر عشرا ويحمد عشرا ويسبح عشرا ويستغفر عشرا ويقول \"اللهم اغفر لي واهدني وارزقني وعافني\" ويتعوذ من ضيق المقام يوم القيامة."
    },
    {
      "ayah": 7,
      "surah": 83,
      "text": "يقول تعالى حقا\" إن كتاب الفجار لفي سجين\"أي أن مصيرهم ومأواهم لفي سجين فعيل من السجن وهو الضيق كما يقال فسيق وشريب وخمير وسكير ونحو ذلك."
    },
    {
      "ayah": 8,
      "surah": 83,
      "text": "ولهذا عظم أمره فقال تعالى:وما أدراك ما سجين\" أي هو أمر عظيم وسجن مقيم وعذاب أليم ثم قد قال قائلون: هي تحت الأرض السابعة وقد تقدم في حديث البراء بن عازب في حديثه الطويل: يقول الله عز وجل في روح الكفار اكتبوا كتابه في سجين. وسجين هي تحت الأرض السابعة وقيل صخرة تحت السابعة خضراء وقيل بئر في جهنم وقد روى ابن جرير في ذلك حديثا غريبا منكرا لا يصح فقال: حدثنا إسحاق بن وهب الواسطي حدثنا مسعود بن موسى بن مسكان الواسطي حدثنا نصر بن خزيمة الواسطي عن شعيب بن صفوان عن محمد بن كعب القرظي عن أبي هريرة عن النبي صلى الله عليه وسلم قال \"الفلق جب في جهنم مغطى وأما سجين فمفتوح\" والصحيح أن سجينا مأخوذا من السجن وهو الضيق فإن المخلوقات كل ما تسافل منها ضاق وكل ما تعالى منها اتسع فإن الأفلاك السبعة كل واحد منها أوسع وأعلى من الذي دونه وكذلك الأرضون كل واحدة أوسع من التي دونها حتى ينتهي السفول المطلق والمحل الأضيق إلى المركز في وسط الأرض السابعة ولما كان مصير الفجار إلى جهنم وهي أسفل السافلين كما قال تعالى \"ثم رددناه أسفل سافلين إلا الذين آمنوا وعملوا الصالحات\" وقال ههنا \"كلا إن كتاب الفجار لفي سجين وما أدراك ما سجين\" وهو يجمع الضيق والسفول كما قال تعالى \"وإذا ألقوا منها مكانا ضيقا مقرنين دعوا هنالك ثبورا\"."
    },
    {
      "ayah": 9,
      "surah": 83,
      "text": "ليس تفسيرا لقوله \"وما أدراك ما سجين\" وإنما هو تفسير لما كتب لهم من المصير إلى سجين أي مرقوم مكتوب مفروغ منه لا يزاد فيه أحد ولا ينقص منه أحد. قاله محمد بن كعب القرظي."
    }
  ]
}
