{
  "ayahs": [
    {
      "ayah": 1,
      "surah": 84,
      "text": "سورة الانشقاق: قال مالك عن عبدالله بن يزيد عن أبي سلمة أن أبا هريرة قرأ بهم \"إذا السماء انشقت\" فسجد فيها فلما انصرف أخبرهم أن رسول الله صلى الله عليه وسلم سجد فيها رواه مسلم والنسائي من طريق مالك به. وقال البخاري حدثنا أبو النعمان حدثنا معتمر عن أبيه عن بكر عن أبي رافع قال صليت مع أبي هريرة العتمة فقرأ \"إذا السماء انشقت\" فسجد فقلت له فقال سجدت خلف أبي القاسم صلى الله عليه وسلم فلا أزال أسجد بها حتى ألقاه ورواه أيضا عن مسدد عن معتمر به ثم رواه عن مسدد عن يزيد بن زريع عن التيمي عن بكر عن أبي رافع فذكره وأخرج مسلم وأبو داود والنسائي من طرق عن سليمان بن طرخان التيمي به وقد رواه مسلم وأهل السنن من حديث سفيان بن عيينة زاد النسائي وسفيان الثوري كلاهما عن أيوب بن موسى عن عطاء بن ميناء عن أبي هريرة قال سجدنا مع رسول الله صلى الله عليه وسلم في \"إذا السماء انشقت\" و \"اقرأ باسم ربك الذي خلق\" وذلك يوم القيامة."
    },
    { "ayah": 10, "surah": 84, "text": "أي بشماله من وراء ظهره تثنى يده إلى ورائه ويعطي كتابه بها كذلك." },
    { "ayah": 11, "surah": 84, "text": "أي خسارا وهلاكا." },
    { "ayah": 12, "surah": 84, "text": "ناراً" },
    {
      "ayah": 13,
      "surah": 84,
      "text": "أي فرحا لا يفكر في العواقب ولا يخاف مما أمامه فأعقبه ذلك الفرح اليسير الحزن الطويل."
    },
    {
      "ayah": 14,
      "surah": 84,
      "text": "أي كان يعتقد أنه لا يرجع إلى الله ولا يعيده بعد موته قاله ابن عباس وقتادة وغيرهما والحور هو الرجوع."
    },
    {
      "ayah": 15,
      "surah": 84,
      "text": "يعني بلى سيعيده الله كما بدأه ويجازيه على أعماله خيرها وشرها فإنه كان به بصيرا أي عليما خبيرا."
    },
    {
      "ayah": 16,
      "surah": 84,
      "text": "روي عن علي وابن عباس وعبادة بن الصامت وأبي هريرة وشداد بن أوس وابن عمر ومحمد بن علي بن الحسين ومكحول وبكر بن عبدالله المزني وبكير بن الأشج ومالك وابن أبي ذئب وعبدالعزيز بن أبي سلمة الماجشون أنهم قالوا الشفق الحمرة وقال عبدالرزاق عن معمر عن ابن خثيم عن ابن لبيبة عن أبي هريرة قال الشفق البياض فالشفق هو حمرة الأفق إما قبل طلوع الشمس كما قاله مجاهد وإما بعد غروبها كما هو معروف عند أهل اللغة قال الخليل بن أحمد: الشفق الحمرة من غروب الشمس إلى وقت العشاء الآخرة فإذا ذهب قيل غاب الشفق. وقال الجوهري: الشفق بقية ضوء الشمس وحمرتها في أول الليل إلى قريب من العتمة وكذا قال عكرمة الشفق الذي يكون بين المغرب والعشاء وفي صحيح مسلم عن عبدالله بن عمرو عن رسول الله صلى الله عليه وسلم أنه قال \"وقت المغرب ما لم يغب الشفق\" ففي هذا كله دليل على أن الشفق هو كما قاله الجوهري والخليل. ولكن صح عن مجاهد أنه قال في هذه الآية \"فلا أقسم بالشفق\" هو النهار كله وفى رواية عنه أيضا أنه قال الشفق الشمس رواهما ابن أبي حاتم."
    },
    {
      "ayah": 17,
      "surah": 84,
      "text": "أي جمع كأنه أقسم بالضياء والظلام وقال ابن جرير: أقسم الله بالنهار مدبرا وبالليل مقبلا. وقال ابن جرير وقال آخرون الشفق أسم للحمرة والبياض وقالوا هو من الأضداد. قال ابن عباس ومجاهد والحسن وقتادة \"وما وسق\" وما جمع قال قتادة وما جمع من نجم ودابة واستشهد ابن عباس بقول الشاعر: مستوسقات لو يجدن سائقا وقد قال عكرمة \"والليل وما وسق\" يقول ما ساق من ظلمة إذا كان الليل ذهب كل شيء إلى مأواه."
    },
    {
      "ayah": 18,
      "surah": 84,
      "text": "قال ابن عباس إذا اجتمع واستوى وكذا قال عكرمة ومجاهد وسعيد بن جبير ومسروق وأبو صالح والضحاك وابن زيد \"والقمر إذا اتسق\" إذا استوى. وقال الحسن إذا اجتمع إذا امتلأ وقال قتادة إذا استدار ومعنى كلامهم أنه إذا تكامل نوره وأبدر جعله مقابلا لليل وما وسق."
    },
    {
      "ayah": 19,
      "surah": 84,
      "text": "قال البخاري أخبرنا سعيد بن النضر أخبرنا هشيم أخبرنا أبو بشر عن مجاهد قال: قال ابن عباس \"لتركبن طبقا عن طبق\" حالا بعد حال قال هذا نبيكم صلى الله عليه وسلم وهكذا رواه البخاري بهذا اللفظ وهو محتمل أن يكون ابن عباس أسند هذا التفسير عن النبي صلى الله عليه وسلم كأنه قال سمعت هذا من نبيكم صلى الله عليه وسلم فيكون قوله نبيكم مرفوعا على الفاعلية من قال وهو الأظهر والله أعلم كما قال أنس: لا يأتي عام إلا والذي بعده شر منه سمعته من نبيكم صلى الله عليه وسلم. وقال ابن جرير حدثني يعقوب بن إبراهيم حدثنا هشيم أخبرنا أبو بشر عن مجاهد أن ابن عباس كان يقول \"لتركبن طبقا عن طبق\" قال يعني نبيكم صلى الله عليه وسلم يقول حالا بعد حال وهذا لفظه وقال علي ابن أبي طلحة عن ابن عباس \"طبقا عن طبق\" حالا بعد حال وكذا قال عكرمة ومرة والطيب ومجاهد والحسن والضحاك ومسروق وأبو صالح ويحتمل أن يكون المراد \"لتركبن طبقا عن طبق\" حالا بعد حال قال هذا يعني المراد بهذا نبيكم صلى الله عليه وسلم فيكون مرفوعا على أن هذا ونبيكم يكونان مبتدأ وخبرا والله أعلم ولعل هذا قد يكون هو المتبادر إلى كثير من الرواة كما قال أبو داود الطيالسي وغندر حدثنا شعبة عن أبي بشر عن سعيد بن جبير عن ابن عباس \"لتركبن طبقا عن طبق\" قال محمد صلى الله عليه وسلم ويؤيد هذا المعنى قراءة عمر وابن مسعود وابن عباس وعامة أهل مكة والكوفة لتركبن بفتح التاء والباء. وقال ابن أبي حاتم حدثنا أبو سعيد الأشج حدثنا أبو أسامة عن إسماعيل عن الشعبي \"لتركبن طبقا عن طبق\" قال لتركبن يا محمد سماء بعد سماء. وهكذا روي عن ابن مسعود ومسروق وأبي العالية \"طبقا عن طبق\" سماء بعد سماء \"قلت\" يعنون ليلة الإسراء؟ وقال أبو إسحاق والسدي عن رجل عن ابن عباس \"طبقا عن طبق\" منزلا على منزل وكذا رواه العوفي عن ابن عباس مثله وزاد ويقال أمرا بعد أمر وحالا بعد حال. وقال السدي نفسه \"لتركبن طبقا عن طبق\" أعمال من قبلكم منزلا بعد منزل \"قلت\" كأنه أراد معنى الحديث الصحيح: \"لتركبن سنن من كان قبلكم حذو القذة بالقذة حتى لو دخلوا جحر ضب لدخلتموه\" قالوا يا رسول الله: اليهود والنصارى ؟ قال \"فمن؟\" وهذا محتمل. وقال ابن أبي حاتم حدثنا أبي حدثنا هشام بن عمار حدثنا صدقة حدثنا ابن جابر أنه سمع مكحولا يقول في قول الله \"لتركبن طبقا عن طبق\" قال في كل عشرين سنة تحدثون أمرا لم تكونوا عليه وقال الأعمش حدثنا إبراهيم قال: قال عبدالله \"لتركبن طبقا عن طبق\" قال السماء تتشقق ثم تحمر ثم تكون لونا بعد لون وقال الثوري عن قيس بن وهب عن مرة عن ابن مسعود \"لتركبن طبقا عن طبق\" قال: السماء مرة كالدهان ومرة تنشق وروى البزار من طريق جابر الجعفي عن الشعبي عن علقمة عن عبدالله بن مسعود \"لتركبن طبقا عن طبق\" يا محمد يعني حالا بعد حال ثم قال ورواه جابر عن مجاهد عن ابن عباس وقال سعيد بن جبير \"لتركبن طبقا عن طبق\" قال قوم كانوا في الدنيا خسيس أمرهم فارتفعوا فى الآخرة وآخرون كانوا أشرافا في الدنيا فاتضعوا في الآخرة وقال عكرمة \"طبقا عن طبق\" حالا بعد حال فطيما بعدما كان رضيعا وشيخا بعدما كان شابا وقال الحسن البصري: \"طبقا عن طبق\" يقول حالا بعد حال رخاء بعد شدة وشدة بعد رخاء وغنى بعد فقر وفقرا بعد غنى وصحة بعد سقم وسقما بعد صحة وقال ابن أبي حاتم ذكر عن عبدالله بن زاهر حدثني أبي عن عمرو بن شمر عن جابر هو الجعفي عن محمد بن علي عن جابر بن عبدالله قال: سمعت رسول الله صلى الله عليه وسلم يقول \"إن ابن آدم لفي غفلة مما خلق له إن الله تعالى إذا أراد خلقه قال للملك اكتب رزقه. اكتب أجله. اكتب أثره. اكتب شقيا أو سعيدا. ثم يرتفع ذلك الملك ويبعث الله إليه ملكا آخر فيحفظه حتى يدرك ثم يرتفع ذلك الملك ثم يوكل الله به ملكين يكتبان حسناته وسيئاته فإذا حضره الموت ارتفع ذانك الملكان وجاءه ملك الموت فقبض روحه فإذا دخل قبره رد الروح في جسده ثم ارتفع ملك الموت وجاءه ملكا القبر فامتحناه ثم يرتفعان فإذا قامت الساعة انحط عليه ملك الحسنات وملك السيئات فانتشطا كتابا معقودا في عنقه ثم حضرا معه واحدا سائقا وآخر شهيدا ثم قال الله تعالى \"لقد كنت في غفلة من هذا\" قال رسول الله صلى الله عليه وسلم \"لتركبن طبقا عن طبق\" قال حالا بعد حال ثم قال النبي صلى الله عليه وسلم \"إن قدامكم لأمرا عظيما لا تقدرونه فاستعينوا بالله العظيم\" هذا حديث منكر وإسناده فيه ضعفاء ولكن معناه صحيح والله سبحانه وتعالى أعلم. ثم قال ابن جرير بعدما حكى أقوال الناس في هذه الآية من القراء والمفسرين: والصواب من التأويل قول من قال لتركبن أنت يا محمد حالا بعد حال وأمرا بعد أمر من الشدائد والمراد بذلك وإن كان الخطاب موجها إلى رسول الله صلى الله عليه وسلم جميع الناس وأنهم يلقون من شدائد يوم القيامة وأحواله أهوالا."
    },
    {
      "ayah": 2,
      "surah": 84,
      "text": "\"وأذنت لربها\" أي استمعت لربها وأطاعت أمره فيما أمرها به من الانشقاق وذلك يوم القيامة \"وحقت\" أي وحق لها أن تطيع أمره لأنه العظيم الذي لا يمانع ولا يغالب بل قد قهر كل شيء وذل له كل شيء."
    },
    { "ayah": 20, "surah": 84, "text": "أي فماذا يمنعهم من الإيمان بالله ورسوله واليوم." },
    {
      "ayah": 21,
      "surah": 84,
      "text": "وما لهم إذا قرئت عليهم آيات الله وكلامه وهو هذا القرآن لا يسجدون إعظاما وإكراما واحتراما؟."
    },
    { "ayah": 22, "surah": 84, "text": "أي من سجيتهم التكذيب والعناد والمخالفة للحق." },
    { "ayah": 23, "surah": 84, "text": "قال مجاهد وقتادة يكتمون في صدورهم." },
    { "ayah": 24, "surah": 84, "text": "أي فأخبرهم يا محمد بأن الله عز وجل قد أعد لهم عذابا أليما." },
    {
      "ayah": 25,
      "surah": 84,
      "text": "هذا استثناء منقطع يعني لكن الذين آمنوا أي بقلوبهم وعملوا الصالحات أي بجوارحهم لهم أجر أي في الدار الآخرة غير ممنون قال ابن عباس غير منقوص وقال مجاهد والضحاك غير محسوب وحاصل قولهما أنه غير مقطوع كما قال تعالى \"عطاء غير مجذوذ\" وقال السدي قال بعضهم غير ممنون غير منقوص وقال بعضهم غير ممنون عليهم وهذا القول الأخير عن بعضهم قد أنكره غير واحد فإن الله عز وجل له المنة على أهل الجنة في كل حال وآن ولحظة وإنما دخلوها بفضله ورحمته لا بأعمالهم فله عليهم المنة دائما سرمدا والحمد لله وحده أبدا ولهذا يلهمون تسبيحه وتحميده كما يلهمون النفس وآخر دعواهم أن الحمد لله رب العالمين. آخر تفسير سورة الانشقاق ولله الحمد والمنة."
    },
    {
      "ayah": 3,
      "surah": 84,
      "text": "أي بسطت وفرشت ووسعت قال ابن جرير حدثنا ابن عبدالأعلى حدثنا ابن ثور عن معمر عن الزهري عن علي بن الحسين أن النبي صلى الله عليه وسلم قال \"إذا كان يوم القيامة مد الله الأرض مد الأديم حتى لا يكون لبشر من الناس إلا موضع قدميه فأكون أول من يدعى وجبريل عن يمين الرحمن والله ما رآه قبلها فأقول يا رب إن هذا أخبرني أنك أرسلته إلي فيقول الله عز وجل صدق ثم أشفع فأقول يا رب عبادك عبدوك في أطراف الأرض - قال - وهو المقام المحمود\"."
    },
    { "ayah": 4, "surah": 84, "text": "أي ألقت ما في بطنها من الأموات وتخلت منهم قاله مجاهد وسعيد وقتادة." },
    { "ayah": 5, "surah": 84, "text": "أي استمعت لربها وأطاعت أمره فيما أمرها به." },
    {
      "ayah": 6,
      "surah": 84,
      "text": "أي إنك ساع إلى ربك سعيا وعامل عملا\"فملاقيه\" ثم إنك ستلقى ما عملت من خير أو شر. ويشهد لذلك ما رواه أبو داود الطيالسي عن الحسن بن أبي جعفر عن أبي الزبير عن جابر قال: قال رسول الله صلى الله عليه وسلم \"قال جبريل يا محمد عش ما شئت فإنك ميت وأحبب من شئت فإنك مفارقه وأعمل ما شئت فإنك ملاقيه\" ومن الناس من يعيد الضمير على قوله ربك أي فملاق ربك ومعناه فيجازيك بعملك ويكافئك على سعيك وعلى هذا فكلا القولين متلازم قال العوفي عن ابن عباس \"يا أيها الإنسان إنك كادح إلى ربك كدحا\" يقول تعمل عملا تلقى الله به خيرا كان أو شرا. وقال قتادة \"يا أيها الإنسان إنك كادح إلى ربك كدحا\" إن كدحك يا ابن آدم لضعيف فمن استطاع أن يكون كدحه في طاعة الله فليفعل ولا قوة إلا بالله."
    },
    { "ayah": 7, "surah": 84, "text": "فَأَمَّا مَنْ أُوتِيَ كِتَابَهُ بِيَمِينِهِ" },
    {
      "ayah": 8,
      "surah": 84,
      "text": "أي سهلا بلا تعسير أي لا يحقق عليه جميع دقائق أعماله فإن من حوسب كذلك هلك لا محالة. وقال الإمام أحمد: حدثنا إسماعيل أخبرنا أيوب عن عبدالله بن أبي مليكة عن عائشة رضي الله عنها قالت: قال رسول الله صلى الله عليه وسلم \"من نوقش الحساب عذب\" قالت: فقلت: أفليس قال الله تعالى \"فسوف يحاسب حسابا يسيرا\" قال \"ليس ذاك بالحساب ولكن ذلك العرض من نوقش الحساب يوم القيامة عذب\" وهكذا رواه البخاري ومسلم والترمذي والنسائي وابن جرير من حديث أيوب السختياني به وقال ابن جرير حدثنا ابن وكيع حدثنا روح بن عبادة حدثنا أبو عامر الخزاز عن ابن أبي مليكه عن عائشة رضي الله عنها قالت: قال رسول الله صلى الله عليه وسلم \"إنه ليس أحد يحاسب يوم القيامة إلا معذبا\" فقلت أليس الله يقول \"فسوف يحاسب حسابا يسيرا\" قال \"ذاك العرض إنه من نوقش الحساب عذب\" وقال بيده على أصبعه كأنه ينكت وقد رواه أيضا عن عمرو بن علي عن ابن أبي عدي عن أبي يونس القشيري عن ابن أبي مليكة عن القاسم عن عائشة فذكر الحديث أخرجاه من طريق أبي يونس القشيري واسمه حاتم بن أبي صغيرة به قال ابن جرير: حدثنا نصر بن علي الجهضمي حدثنا مسلم عن الحريش بن الخريت أخي الزبير عن ابن أبي مليكة عن عائشة قالت: من نوقش الحساب - أو من حوسب - عذب. قال ثم قالت إنما الحساب اليسير عرض على الله تعالى وهو يراهم وقال أحمد حدثنا إسماعيل حدثنا محمد بن إسحاق حدثني عبدالواحد بن حمزة بن عبدالله بن الزبير عن عباد بن عبدالله بن الزبير عن عائشة قالت: سمعت رسول الله يقول في بعض صلاته \"اللهم حاسبني حسابا يسيرا\" فلما انصرف قلت يا رسول الله ما الحساب اليسير؟ قال \"أن ينظر في كتابه فيتجاوز له عنه إنه من نوقش الحساب يا عائشة يومئذ هلك\" صحيح على شرط مسلم."
    },
    {
      "ayah": 9,
      "surah": 84,
      "text": "أي ويرجع إلى أهله في الجنة قاله قتادة والضحاك: مسرورا أي فرحا مغتبطا بما أعطاه الله عز وجل. وقد روى الطبراني عن ثوبان مولى رسول الله صلى الله عليه وسلم أنه قال إنكم تعملون أعمالا لا تعرف ويوشك الغائب أن يثوب إلى أهله فمسرور أو مكظوم."
    }
  ]
}
