{
  "ayahs": [
    {
      "ayah": 1,
      "surah": 85,
      "text": "سورة البروج: قال الإمام أحمد حدثنا عبدالصمد حدثنا زريق بن أبي سلمة حدثنا أبو المهزم عن أبي هريرة أن رسول الله صلى الله عليه وسلم كان يقرأ في العشاء الآخرة ب \"السماء ذات البروج\" \"والسماء والطارق\". وقال أحمد حدثنا أبو سعيد مولى بني هاشم حدثنا حماد بن عباد السدوسي سمعت أبا المهزم يحدث عن أبي هريرة أن رسول الله صلى الله عليه وسلم أمر أن يقرأ بالسموات في العشاء تفرد به أحمد. يقسم تعالى بالسماء وبروجها وهي النجوم العظام كما تقدم بيان ذلك في قوله تعالى \"تبارك الذي جعل في السماء بروجا وجعل فيها سراجا وقمرا منيرا\" قال ابن عباس ومجاهد والضحاك والحسن وقتادة والسدي: البروج النجوم وعن مجاهد أيضا البروج التي فيها الحرس وقال يحيى بن رافع: البروج قصور في السماء. وقال المنهال بن عمرو \"والسماء ذات البروج\" الخلق الحسن واختار ابن جرير أنها منازل الشمس والقمر وهي اثنا عشر برجا تسير الشمس فى كل واحد منها شهرا ويسير القمر في كل واحد منها يومين وثلثا فذلك ثمانية وعشرون منزلة ويستتر ليلتين."
    },
    {
      "ayah": 10,
      "surah": 85,
      "text": "أي حرقوا قاله ابن عباس ومجاهد وقتادة والضحاك وابن أبزى \"ثم لم يتوبوا\" أى لم يقلعوا عما فعلوا ويندموا على ما أسلفوا \"فلهم عذاب جهنم ولهم عذاب الحريق\" وذلك أن الجزاء من جنس العمل قال الحسن البصري انظروا إلى هذا الكرم والجود قتلوا أولياءه وهو يدعوهم إلى التوبة والمغفرة."
    },
    {
      "ayah": 11,
      "surah": 85,
      "text": "يخبر تعالى عن عباده المؤمنين أن لهم جنات تجري من تحتها الأنهار خالدين فيها بخلاف ما أعـد لأعدائه من الحريق والجحيم ولهذا قال \"ذلك الفوز الكبير\"."
    },
    {
      "ayah": 12,
      "surah": 85,
      "text": "أي إن بطشه وانتقامه من أعدائه الذين كذبوا رسله وخالفوا أمره لشديد عظيم قوي فإنه تعالى ذو القوة المتين الذي ما شاء كان كما يشاء في مثل لمح البصر أو هو أقرب."
    },
    { "ayah": 13, "surah": 85, "text": "أي من قوته وقدرته التامة يبدئ الخلق ويعيده كما بدأه بلا ممانع ولا مدافع." },
    {
      "ayah": 14,
      "surah": 85,
      "text": "أي يغفر ذنب من تاب إليه وخضع لديه ولو كان الذنب من أي شيء كان والودود قال ابن عباس وغيره هو الحبيب."
    },
    {
      "ayah": 15,
      "surah": 85,
      "text": "أي صاحب العرش العظيم العالي على جميع الخلائق والمجيد فيه قراءتان الرفع على أنه صفة للرب عز وجل والجر على أنه صفة للعرش وكلاهما معنى صحيح."
    },
    {
      "ayah": 16,
      "surah": 85,
      "text": "أي مهما أراد فعله لا معقب لحكمه ولا يسئل عما يفعل لعظمته وقهره وحكمته وعدله كما روينا عن أبي بكر الصديق أنه قيل له وهو في مرض الموت هل نظر إليك الطبيب؟ قال نعم. قالوا فما قال لك؟ قال: قال لي إني فعال لما أريد."
    },
    {
      "ayah": 17,
      "surah": 85,
      "text": "أي هل بلغك ما أحل الله بهم من البأس وأنزل عليهم من النقمة التي لم يردها عنهم أحد؟ وهذا تقرير لقوله تعالى \"إن بطش ربك لشديد\" أي إذا أخذ الظالم أخذه أخذا أليما شديدا أخذ عزيز مقتدر قال ابن أبي حاتم حدثنا أبي حدثنا علي بن محمد الطنافسي حدثنا أبو بكر بن عياش عن أبي إسحاق عن عمرو بن ميمون قال مر النبي صلى الله عليه وسلم على امرأة تقرأ \"هل أتاك حديث الجنود\" فقام يستمع فقال \"نعم قد جاءني\"."
    },
    {
      "ayah": 18,
      "surah": 85,
      "text": "أي هل بلغك ما أحل الله بهم من البأس وأنزل عليهم من النقمة التي لم يردها عنهم أحد؟ وهذا تقرير لقوله تعالى \"إن بطش ربك لشديد\" أي إذا أخذ الظالم أخذه أخذا أليما شديدا أخذ عزيز مقتدر قال ابن أبي حاتم حدثنا أبي حدثنا علي بن محمد الطنافسي حدثنا أبو بكر بن عياش عن أبي إسحاق عن عمرو بن ميمون قال مر النبي صلى الله عليه وسلم على امرأة تقرأ \"هل أتاك حديث الجنود\" فقام يستمع فقال \"نعم قد جاءني\"."
    },
    { "ayah": 19, "surah": 85, "text": "أي هم في شك وريب وكفر وعناد." },
    {
      "ayah": 2,
      "surah": 85,
      "text": "اختلف المفسرون في ذلك. وقد قال ابن أبي حاتم حدثنا عبدالله بن محمد بن عمرو الغزي حدثنا عبيدالله يعني ابن موسى حدثنا موسى ابن عبيده عن أيوب بن خالد بن صفوان بن أوس الأنصاري عن عبدالله بن رافع عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم \" \"واليوم الموعود\" يوم القيامة وشاهد: يوم الجمعة وما طلعت شمس ولا غربت على يوم أفضل من يوم الجمعة وفيه ساعة لا يوافقها عبد مسلم يسأل الله فيها خيرا إلا أعطاه إياه ولا يستعيذ فيها من شر إلا أعاذه ومشهود: يوم عرفة\" وهكذا روى هذا الحديث ابن خزيمة من طرق عن موسى بن عبيدة الربذي وهو ضعيف الحديث. وقد روي موقوفا على أبي هريرة وهو أشبه وقال الإمام أحمد حدثنا محمد حدثنا شعبة سمعت علي بن زيد ويونس بن عبيد يحدثان عن عمار مولى بني هاشم عن أبي هريرة أما علي: فرفعه إلى النبي صلى الله عليه وسلم وأما يونس فلم يعد أبا هريرة أنه قال في هذه الآية: وشاهد ومشهود قال يعني الشاهد يوم الجمعة ويوم مشهود يوم القيامة وقال أحمد أيضا حدثنا محمد بن جعفر حدثنا شعبة عن يونس سمعت عمارا مولى بني هاشم يحدث عن أبي هريرة أنه قال في هذه الآية \"وشاهد ومشهود\" قال الشاهد يوم الجمعة والمشهود يوم عرفة والموعود يوم القيامة وقد روى عن أبي هريرة أنه قال اليوم الموعود يوم القيامة وكذلك قال الحسن وقتادة وابن زيد ولم أرهم يختلفون في ذلك ولله الحمد ثم قال ابن جرير حدثنا محمد بن عوف حدثنا محمد بن إسماعيل بن عياش حدثني أبي حدثنا ضمضم ابن زرعة عن شريح بن عبيد عن أبي مالك الأشعري قال: قال رسول الله صلى الله عليه وسلم \"اليوم الموعود يوم القيامة وإن الشاهد يوم الجمعة وإن المشهود يوم عرفة ويوم الجمعة ذخره الله لنا\" ثم قال ابن جرير حدثنا سهل بن موسى الرازي حدثنا ابن أبي فديك عن ابن حرملة عن سعيد بن المسيب أنه قال: قال رسول الله صلى الله عليه وسلم \"إن سيد الأيام يوم الجمعة وهو الشاهد والمشهود يوم عرفة\" وهذا مرسل من مراسيل سعيد بن المسيب ثم قال ابن جرير حدثنا أبو كريب حدثنا وكيع عن شعبة عن علي بن زيد عن يوسف المكي عن ابن عباس قال: الشاهد هو محمد صلى الله عليه وسلم والمشهود يوم القيامة ثم قرأ \"ذلك يوم مجموع له الناس وذلك يوم مشهود\" وحدثنا ابن حميد حدثنا جرير عن مغيرة عن شباك قال سأل رجل الحسن بن علي عن \"وشاهد ومشهود\" قال سألت أحدا قبلي؟ قال نعم سألت ابن عمر وابن الزبير فقالا يوم الذبح ويوم الجمعة فقال لا ولكن الشاهد محمد صلى الله عليه وسلم ثم قرأ \"فكيف إذا جئنا من كل أمة بشهيد وجئنا بك على هؤلاء شهيدا\" والمشهود يوم القيامة ثم قرأ \"ذلك يوم مجموع له الناس وذلك يوم مشهود\" وهكذا قال الحسن البصري وقال سفيان الثوري عن ابن حرملة عن سعيد بن المسيب ومشهود يوم القيامة وقال مجاهد وعكرمة وعن الضحاك الشاهد ابن آدم والمشهود يوم القيامة عن عكرمة أيضا الشاهد محمد صلى الله عليه وسلم والمشهود يوم الجمعة وقال علي بن أبي طلحة عن ابن عباس الشاهد الله والمشهود يوم القيامة وقال ابن أبي حاتم حدثنا أبي حدثنا أبو نعيم الفضل بن دكين حدثنا سفيان عن أبي يحيى القتات عن مجاهد عن ابن عباس \"وشاهد ومشهود\" قال الشاهد الإنسان والمشهود يوم الجمعة هكذا رواه ابن أبي حاتم. وقال ابن جرير حدثنا ابن حميد حدثنا مهران عن سفيان عن ابن أبي نجيح عن مجاهد عن ابن عباس \"وشاهد ومشهود\" الشاهد يوم عرفة والمشهود يوم القيامة وبه عن سفيان الثوري عن مغيرة عن إبراهيم قال يوم الذبح ويوم عرفة يعني الشاهد والمشهود قال ابن جرير وقال آخرون المشهود يوم الجمعة ورووا في ذلك ما حدثنا أحمد بن عبدالرحمن حدثني عمي عبدالله بن وهب أخبرني عمرو بن الحارث عن سعيد بن أبي هلال عن زيد بن أيمن عن عبادة بن نسي عن أبي الدرداء قال: قال رسول الله صلى الله عليه وسلم \"أكثروا علي من الصلاة يوم الجمعة فإنه يوم مشهود تشهده الملائكة\" وعن سعيد بن جبير الشاهد الله وتلا \"وكفى بالله شهيدا\" والمشهود نحن حكاه البغوي وقال: الأكثرون على أن الشاهد يوم الجمعة والمشهود يوم عرفة."
    },
    { "ayah": 20, "surah": 85, "text": "أي هو قادر عليهم قاهر لا يفوتونه ولا يعجزونه." },
    { "ayah": 21, "surah": 85, "text": "أي عظيم كريم." },
    {
      "ayah": 22,
      "surah": 85,
      "text": "أي هو في الملإ الأعلى محفوظ من الزيادة والنقص والتحريف والتبديل. قال ابن جرير حدثنا عمرو بن علي حدثنا قرة بن سليمان حدثنا حرب بن شريح حدثنا عبدالعزيز بن صهيب عن أنس بن مالك في قوله تعالى \"بل هو قرآن مجيد في لوح محفوظ\" قال إن اللوح المحفوظ الذي ذكر الله\" بل هو قرآن مجيد في لوح محفوظ\" في جبهة إسرافيل. وقال ابن أبي حاتم حدثنا أبي حدثنا أبو صالح ثنا معاوية بن صالح أن أبا الأعبس هو عبدالرحمن بن سلمان قال: ما من شيء قضى الله: القرآن فما قبله وما بعده إلا وهو في اللوح المحفوظ واللوح المحفوظ بين عيني إسرافيل لا يؤذن له بالنظر فيه وقال الحسن البصري إن هذا القرآن المجيد عندالله في لوح محفوظ ينزل منه ما يشاء على من يشاء من خلقه وقد روى البغوي من طريق إسحاق بن بشر أخبرني مقاتل وابن جريج عن مجاهد عن ابن عباس قال إن في صدر اللوح لا إله إلا الله وحده دينه الإسلام ومحمد عبده ورسوله فمن آمن بالله وصدق بوعده واتبع رسله أدخله الجنة قال واللوح لوح من درة بيضاء طوله ما بين السماء والأرض وعرضه ما بين المشرق والمغرب وحافتاه من الدر والياقوت ودفتاه ياقوتة حمراء وقلمه نور وكلامه معقود بالعرش وأصله في حجر ملك وقال مقاتل: اللوح المحفوظ عن يمين العرش وقال الطبراني حدثنا محمد ابن عثمان بن أبي شيبة حدثنا منجاب بن الحارث حدثنا إبراهيم بن يوسف حدثنا زياد بن عبدالله عن ليث عن عبد الملك بن سعيد بن جبير عن أبيه عن ابن عباس أن رسول الله صلى الله عليه وسلم قال \"إن الله تعالى خلق لوحا محفوظا من درة بيضاء صفحاتها من ياقوتة حمراء قلمه نور وكتابه نور لله فيه في كل يوم ستون وثلاثمائة لحظة يخلق ويرزق ويميت ويحيي ويعز ويذل ويفعل ما يشاء\". آخر تفسير سورة البروج. ولله الحمد والمنة."
    },
    {
      "ayah": 3,
      "surah": 85,
      "text": "اختلف المفسرون في ذلك. وقد قال ابن أبي حاتم حدثنا عبدالله بن محمد بن عمرو الغزي حدثنا عبيدالله يعني ابن موسى حدثنا موسى ابن عبيده عن أيوب بن خالد بن صفوان بن أوس الأنصاري عن عبدالله بن رافع عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم \" \"واليوم الموعود\" يوم القيامة وشاهد: يوم الجمعة وما طلعت شمس ولا غربت على يوم أفضل من يوم الجمعة وفيه ساعة لا يوافقها عبد مسلم يسأل الله فيها خيرا إلا أعطاه إياه ولا يستعيذ فيها من شر إلا أعاذه ومشهود: يوم عرفة\" وهكذا روى هذا الحديث ابن خزيمة من طرق عن موسى بن عبيدة الربذي وهو ضعيف الحديث. وقد روي موقوفا على أبي هريرة وهو أشبه وقال الإمام أحمد حدثنا محمد حدثنا شعبة سمعت علي بن زيد ويونس بن عبيد يحدثان عن عمار مولى بني هاشم عن أبي هريرة أما علي: فرفعه إلى النبي صلى الله عليه وسلم وأما يونس فلم يعد أبا هريرة أنه قال في هذه الآية: وشاهد ومشهود قال يعني الشاهد يوم الجمعة ويوم مشهود يوم القيامة وقال أحمد أيضا حدثنا محمد بن جعفر حدثنا شعبة عن يونس سمعت عمارا مولى بني هاشم يحدث عن أبي هريرة أنه قال في هذه الآية \"وشاهد ومشهود\" قال الشاهد يوم الجمعة والمشهود يوم عرفة والموعود يوم القيامة وقد روى عن أبي هريرة أنه قال اليوم الموعود يوم القيامة وكذلك قال الحسن وقتادة وابن زيد ولم أرهم يختلفون في ذلك ولله الحمد ثم قال ابن جرير حدثنا محمد بن عوف حدثنا محمد بن إسماعيل بن عياش حدثني أبي حدثنا ضمضم ابن زرعة عن شريح بن عبيد عن أبي مالك الأشعري قال: قال رسول الله صلى الله عليه وسلم \"اليوم الموعود يوم القيامة وإن الشاهد يوم الجمعة وإن المشهود يوم عرفة ويوم الجمعة ذخره الله لنا\" ثم قال ابن جرير حدثنا سهل بن موسى الرازي حدثنا ابن أبي فديك عن ابن حرملة عن سعيد بن المسيب أنه قال: قال رسول الله صلى الله عليه وسلم \"إن سيد الأيام يوم الجمعة وهو الشاهد والمشهود يوم عرفة\" وهذا مرسل من مراسيل سعيد بن المسيب ثم قال ابن جرير حدثنا أبو كريب حدثنا وكيع عن شعبة عن علي بن زيد عن يوسف المكي عن ابن عباس قال: الشاهد هو محمد صلى الله عليه وسلم والمشهود يوم القيامة ثم قرأ \"ذلك يوم مجموع له الناس وذلك يوم مشهود\" وحدثنا ابن حميد حدثنا جرير عن مغيرة عن شباك قال سأل رجل الحسن بن علي عن \"وشاهد ومشهود\" قال سألت أحدا قبلي؟ قال نعم سألت ابن عمر وابن الزبير فقالا يوم الذبح ويوم الجمعة فقال لا ولكن الشاهد محمد صلى الله عليه وسلم ثم قرأ \"فكيف إذا جئنا من كل أمة بشهيد وجئنا بك على هؤلاء شهيدا\" والمشهود يوم القيامة ثم قرأ \"ذلك يوم مجموع له الناس وذلك يوم مشهود\" وهكذا قال الحسن البصري وقال سفيان الثوري عن ابن حرملة عن سعيد بن المسيب ومشهود يوم القيامة وقال مجاهد وعكرمة وعن الضحاك الشاهد ابن آدم والمشهود يوم القيامة عن عكرمة أيضا الشاهد محمد صلى الله عليه وسلم والمشهود يوم الجمعة وقال علي بن أبي طلحة عن ابن عباس الشاهد الله والمشهود يوم القيامة وقال ابن أبي حاتم حدثنا أبي حدثنا أبو نعيم الفضل بن دكين حدثنا سفيان عن أبي يحيى القتات عن مجاهد عن ابن عباس \"وشاهد ومشهود\" قال الشاهد الإنسان والمشهود يوم الجمعة هكذا رواه ابن أبي حاتم. وقال ابن جرير حدثنا ابن حميد حدثنا مهران عن سفيان عن ابن أبي نجيح عن مجاهد عن ابن عباس \"وشاهد ومشهود\" الشاهد يوم عرفة والمشهود يوم القيامة وبه عن سفيان الثوري عن مغيرة عن إبراهيم قال يوم الذبح ويوم عرفة يعني الشاهد والمشهود قال ابن جرير وقال آخرون المشهود يوم الجمعة ورووا في ذلك ما حدثنا أحمد بن عبدالرحمن حدثني عمي عبدالله بن وهب أخبرني عمرو بن الحارث عن سعيد بن أبي هلال عن زيد بن أيمن عن عبادة بن نسي عن أبي الدرداء قال: قال رسول الله صلى الله عليه وسلم \"أكثروا علي من الصلاة يوم الجمعة فإنه يوم مشهود تشهده الملائكة\" وعن سعيد بن جبير الشاهد الله وتلا \"وكفى بالله شهيدا\" والمشهود نحن حكاه البغوي وقال: الأكثرون على أن الشاهد يوم الجمعة والمشهود يوم عرفة."
    },
    {
      "ayah": 4,
      "surah": 85,
      "text": "أي لعن أصحاب الأخدود وجمعه أخاديد وهي الحفر في الأرض وهذا خبر عن قوم من الكفار عمدوا إلى من عندهم من المؤمنين بالله عز وجل فقهروهم وأرادوهم أن يرجعوا عن دينهم فأبوا عليهم."
    },
    {
      "ayah": 5,
      "surah": 85,
      "text": "فحفروا لهم في الأرض أخدودا وأججوا فيه نارا وأعدوا لها وقودا يسعرونها به ثم أرادوهم فلم يقبلوا منهم فقذفوهم فيها."
    },
    { "ayah": 6, "surah": 85, "text": "أي مشاهدون لما يفعل بأولئك المؤمنين." },
    {
      "ayah": 7,
      "surah": 85,
      "text": "أي وما كان لهم عندهم من ذنب إلا إيمانهم بالله العزيز الذي لا يضام من لاذ بجنابه المنيع الحميد في جميع أقواله وأفعاله وشرعه وقدره وإن كان قد قدر على عباده هؤلاء هذا الذي وقع بهم بأيدي الكفار به فهو العزيز الحميد وإن خفي سبب ذلك على كثير من الناس."
    },
    {
      "ayah": 8,
      "surah": 85,
      "text": "أي وما كان لهم عندهم من ذنب إلا إيمانهم بالله العزيز الذي لا يضام من لاذ بجنابه المنيع الحميد في جميع أقواله وأفعاله وشرعه وقدره وإن كان قد قدر على عباده هؤلاء هذا الذي وقع بهم بأيدي الكفار به فهو العزيز الحميد وإن خفي سبب ذلك على كثير من الناس."
    },
    {
      "ayah": 9,
      "surah": 85,
      "text": "ثم قال تعالى \"الذي له ملك السموات والأرض\" من تمام الصفة إنه المالك لجميع السموات والأرض وما فيهما وما بينهما \"والله على كل شيء شهيد\" أي لا يغيب عنه شيء في جميع السموات والأرض ولا تخفى عليه خافية وقد اختلف أهل التفسير في أهل هذه القصة من هم؟ فعن علي أنهم أهل فارس حين أراد ملكهم تحليل تزويج المحارم فامتنع عليهم علماؤهم فعمد إلى حفر أخدود فقذف فيه من أنكر عليه منهم واستمر فيهم تحليل المحارم إلى اليوم. وعنه أنهم كانوا قوما باليمن اقتتل مؤمنوهم ومشركوهم فغلب مؤمنوهم على كفارهم ثم اقتتلوا فغلب الكفار المؤمنين فخدوا لهم الأخاديد وأحرقوهم فيها وعنه أنهم كانوا من أهل الحبشة واحدهم حبشي وقال العوفي عن ابن عباس \"قتل أصحاب الأخدود النار ذات الوقود\" قال ناس من بني إسرائيل خدوا أخدودا فى الأرض ثم أوقدوا فيه نارا ثم أقاموا على ذلك الأخدود رجالا ونساء فعرضوا عليها وزعموا أنه دانيال وأصحابه وهكذا قال الضحاك بن مزاحم وقيل غير ذلك وقد قال الإمام أحمد حدثنا عفان حدثنا حماد بن سلمة عن ثابت عن عبدالرحمن بن أبي ليلى عن صهيب أن رسول الله صلى الله عليه وسلم قال \"كان فيمن كان قبلكم ملك وكان له ساحر فلما كبر الساحر قال للملك إني قد كبر سني وحضر أجلي فادفع إلي غلاما لأعلمه السحر فدفع إليه غلاما كان يعلمه السحر وكان بين الساحر وبين الملك راهب فأتى الغلام على الراهب فسمع من كلامه فأعجبه نحوه وكلامه وكان إذا أتى الساحر ضربه وقال ما حبسك وإذا أتى أهله ضربوه وقالوا ما حبسك فشكا ذلك إلى الراهب فقال إذا أراد الساحر أن يضربك فقل حبسني أهلي وإذا أراد أهلك أن يضربوك فقل حبسني الساحر قال فبينما هو ذات يوم إذ أتى على دابة فظيعة عظيمة قد حبست الناس فلا يستطيعون أن يجوزوا فقال اليوم أعلم أمر الراهب أحب إلى الله أم أمر الساحر قال فأخذ حجرا فقال اللهم إن كان أمر الراهب أحب إليك وأرضى من الساحر فاقتل هذه الدابة حتى يجوز الناس ورماها فقتلها ومضى الناس فأخبر الراهب بذلك فقال أي بني أنت أفضل مني وإنك ستبتلى فإن ابتليت فلا تدل علي فكان الغلام يبرئ الأكمة والأبرص وسائر الأدواء ويشفيهم وكان للملك جليس فعمي فسمع به فأتاه بهدايا كثيرة فقال اشفني ولك ما ههنا أجمع فقال ما أنا أشفي أحدا إنما يشفي الله عز وجل فإن آمنت به دعوت الله فشفاك فآمن فدعا الله فشفاه. ثم أتى الملك فجلس منه نحو ما كان يجلس فقال له الملك يا فلان من رد عليك بصرك؟ فقال ربي فقال أنا؟ قال لا ربي وربك الله قال ولك رب غيري؟ قال نعم ربي وربك الله فلم يزل يعذبه حتى دل على الغلام فبعث إليه فقال أي بني بلغ من سحرك أن تبريء الأكمه والأبرص وهذه الأدواء؟ قال ما أشفي أحدا إنما يشفي الله عز وجل قال أنا؟ قال لا. قال أولك رب غيري؟ قال ربي وربك الله فأخذه أيضا بالعذاب فلم يزل به حتى دل على الراهب فأتى بالراهب فقال ارجع عن دينك فأبى فوضع المنشار في مفرق رأسه حتى وقع شقاه وقال للأعمى ارجع عن دينك فأبى فوضع المنشار في مفرق رأسه حتى وقع شقاه إلى الأرض. وقال للغلام ارجع عن دينك فأبى فبعث به مع نفر إلى جبل كذا وكذا وقال إذا بلغتم ذروته فإن رجع عن دينه وإلا فدهدهوه فذهبوا به فلما علوا به الجبل قال: اللهم اكفنيهم بما شئت فرجف بهم الجبل فدهدهوا أجمعون وجاء الغلام يتلمس حتى دخل على الملك فقال ما فعل أصحابك؟ فقال كفانيهم الله تعالى فبعث به مع نفر في قرقور فقال إذا لججتم به البحر فإن رجع عن دينه وإلا فغرقوه في البحر فلججوا به البحر فقال الغلام اللهم اكفنيهم بما شئت فغرقوا أجمعون وجاء الغلام حتى دخل على الملك فقال ما فعل أصحابك؟ فقال كفانيهم الله تعالى. ثم قال للملك: إنك لست بقاتلي حتى تفعل ما آمرك به فإن أنت فعلت ما آمرك به قتلتني وإلا فإنك لا تستطيع قتلي قال وما هو؟ قال تجمع الناس في صعيد واحد ثم تصلبني على جذع وتأخذ سهما من كنانتي ثم قل بسم الله رب الغلام فإنك إذا فعلت ذلك قتلتني. ففعل ووضع السهم في كبد قوسه ثم رماه وقال بسم الله رب الغلام فوقع السهم في صدغه فوضع الغلام يده على موضع السهم ومات فقال الناس آمنا برب الغلام. فقيل للملك أرأيت ما كنت تحذر؟ فقد والله نزل بك قد آمن الناس كلهم فأمر بأفواه السكك فخدت فيها الأخاديد وأضرمت فيها النيران وقال من رجع عن دينه فدعوه وإلا فأقحموه فيها قال فكانوا يتعادون فيها ويتدافعون فجاءت امرأة بابن لها ترضعه فكأنها تقاعست أن تقع في النار فقال الصبي اصبري يا أماه فإنك على الحق. وهكذا رواه مسلم في آخر الصحيح عن هدبة بن خالد عن حماد بن سلمة به نحوه ورواه النسائي عن أحمد بن سلمان عن عثمان عن حماد بن سلمة ومن طريق حماد بن زيد كلاهما عن ثابت به واختصروا أوله وقد جوده الإمام أبو عيسى الترمذي فرواه في تفسير هذه السورة عن محمود بن غيلان وعبد بن حميد - المعنى واحد - قالا أخبرنا عبدالرزاق عن معمر عن ثابت البناني عن عبدالرحمن بن أبي ليلى عن صهيب قال: كان رسول الله صلى الله عليه وسلم إذا صلى العصر همس والهمس في بعض قولهم تحريك شفتيه كأنه يتكلم فقيل له إنك يا رسول الله إذا صليت العصر همست قال \"إن نبيا من الأنبياء كان أعجب بأمته فقال من يقوم لهؤلاء فأوحى الله إليه أن خيرهم بين أن أنتقم منهم وبين أن أسلط عليهم عدوهم فاختاروا النقمة فسلط الله عليهم الموت فمات منهم في يوم سبعون ألفا\" قال وكان إذا حدث بهذا الحديث حدث بهذا الحديث الآخر قال: كان ملك من الملوك وكان لذلك الملك كاهن يتكهن له فقال الكاهن انظروا لي غلاما فهما أو قال فطنا لقنا فأعلمه علمي هذا فذكر القصة بتمامها وقال في آخره يقول الله عز وجل \"قتل أصحاب الأخدود النار ذات الوقود - حتى بلغ - العزيز الحميد\" قال فأما الغلام فإنه دفن فيذكر أنه أخرج في زمان عمر بن الخطاب وأصبعه على صدغه كما وضعها حين قتل ثم قال الترمذي حسن غريب. وهذا السياق ليس فيه صراحة أن سياق هذه القصة من كلام النبي صلى الله عليه وسلم قال شيخنا الحافظ أبوالحجاج المزي: فيحتمل أن يكون من كلام صهيب الرومي فإنه كان عنده علم من أخبار النصارى والله أعلم. وقد أورد محمد بن إسحاق بن يسار هذه القصة في السيرة بسياق آخر فيها مخالفة لما تقدم فقال حدثني يزيد بن زياد عن محمد بن كعب القرظي وحدثني أيضا بعض أهل نجران عن أهلها أن أهل نجران كانوا أهل شرك يعبدون الأوثان وكان في قرية من قراها قريبا من نجران - ونجران هي القرية العظمى التي إليها جماع أهل تلك البلاد - ساحر يعلم غلمان أهل نجران السحر فلما نزلها فيمون ولم يسموه لي بالاسم الذي سماه ابن منبه قالوا نزلها رجل فابتنى خيمة بين نجران وبين تلك القرية التي فيها الساحر وجعل أهل نجران يرسلون غلمانهم إلى ذلك الساحر يعلمهم السحر فبعث التامر ابنه عبدالله بن التامر مع غلمان أهل نجران فكان إذا مر بصاحب الخيمة أعجبه ما يرى من عبادته وصلاته فجعل يجلس إليه ويسمع منه حتى أسلم فوحد الله وعبده وجعل يسأله عن شرائع الإسلام حتى إذا فقه فيه جعل يسأله عن الاسم الأعظم وكان يعلمه فكتبه إياه وقال له يا ابن أخي إنك لن تحمله أخشى ضعفك عنه والتامر أبو عبدالله لا يظن إلا أن ابنه يختلف إلى الساحر كما يختلف الغلمان فلما رأى عبدالله أن صاحبه قد ضن به عنه وتخوف ضعفه فيه عمد إلى أقداح فجمعها ثم لم يبق لله اسما يعلمه إلا كتبه في قدح لكل اسم قدح حتى إذا أحصاها أوقد نارا ثم جعل يقذفها فيها قدحا قدحا حتى إذا مر بالاسم الأعظم قذف فيها بقدحه فوثب القدح حتى خرج منها لم يضره شيء فأخذه ثم أتى به صاحبه فأخبره أنه قد علم الاسم الأعظم الذي قد كتبه فقال وما هو؟ قال هو كذا وكذا قال وكيف علمته؟ فأخبره بما صنع فقال أي ابن أخي قد أصبته فأمسك على نفسك وما أظن أن تفعل فجعل عبدالله بن التامر إذا دخل نجران لم يلق أحدا به ضر إلا قال له يا عبدالله أتوحد الله وتدخل في ديني وأدعوا الله لك فيعافيك مما أنت فيه من البلاء؟ فيقول نعم فيوحد الله ويسلم فيدعو الله له فيشفى حتى لم يبق بنجران أحد به ضر إلا أتاه فاتبعه على أمره ودعا له فعوفي حتى رفع شأنه إلى ملك نجران فدعاه فقال له أفسدت علي أهل قريتي وخالفت ديني ودين آبائي لأمثلن بك قال لا تقدر على ذلك قال فجعل يرسل به إلى الجبل الطويل فيطرح على رأسه فيقع إلى الأرض ما به بأس وجعل يبعث به إلى مياه بنجران بحور لا يلقى فيها شيء إلا هلك فيلقى به فيها فيخرج ليس به بأس فلما غلبه قال له عبدالله بن التامر إنك والله لا تقدر على قتلي حتى تؤمن بما آمنت به وتوحد الله فإنك إن فعلت سلطت علي فقتلتني قال فوحد الله ذلك الملك وشهد شهادة عبدالله بن التامر ثم ضربه بعصا في يده فشجه شجة غير كبيرة فقتله وهلك الملك مكانه واستجمع أهل نجران على دين عبدالله بن التامر وكان على ما جاء به عيسى ابن مريم عليه السلام من الإنجيل وحكمه ثم أصابهم ما أصاب أهل دينهم من الأحداث فمن هنالك كان أصل دين النصرانية بنجران. قال ابن إسحاق فهذا حديث محمد بن كعب القرظي وبعض أهل نجران عن عبدالله بن التامر فالله أعلم أي ذلك كان قال فسار إليهم ذو نواس بجنده فدعاهم إلى اليهودية وخيرهم بين ذلك أو القتل فاختاروا القتل فخد الأخدود فحرق بالنار وقتل بالسيف ومثل بهم حتى قتل منهم قريبا من عشرين ألفا ففي ذي نواس وجنده أنزل الله عز وجل على رسوله صلى الله عليه وسلم \"قتل أصحاب الأخدود النار ذات الوقود إذ هم عليها قعود وهم على ما يفعلون بالمؤمنين شهود وما نقموا منهم إلا أن يؤمنوا بالله العزيز الحميد الذي له ملك السموات والأرض والله على كل شيء شهيد\" هكذا ذكر محمد بن إسحاق في السيرة أن الذي قتل أصحاب الأخدود هو ذو نواس واسمه زرعة ويسمى في زمان مملكته بيوسف وهو ابن بيان أسعد أبي كريب وهو تبع الذي غزا المدينة وكسى الكعبة واستصحب معه حبرين من يهود المدينة فكان تهود من تهود من أهل اليمن على يديهما كما ذكره ابن إسحاق مبسوطا فقتل ذو نواس في غداة واحدة في الأخدود عشرين ألفا ولم ينج منهم سوى رجل واحد يقال له دوس ذو ثعلبان ذهب فارسا وطردوا وراءه فلم يقدروا عليه فذهب إلى قيصر ملك الشام فكتب إلى النجاشي ملك الحبشة فأرسل معه جيشا من نصارى الحبشة يقدمهم أرياط وأبرهة فاستنقذوا اليمن من أيدي اليهود وذهب ذو نواس هاربا فلجج في البحر فغرق واستمر ملك الحبشة في أيدي النصارى سبعين سنة ثم استنقذه سيف بن ذي يزن الحميري من أيدي النصارى لما استجاش بكسرى ملك الفرس فأرسل معه من في السجون فكانوا قريبا من سبعمائة ففتح بهم اليمن ورجع الملك إلى حمير وسنذكر طرفا من ذلك إن شاء الله في تفسير سورة \"ألم تر كيف فعل ربك بأصحاب الفيل\" وقال ابن إسحاق وحدثني عبدالله بن أبي بكر بن محمد بن عمرو بن حزم أنه حدث أن رجلا من أهل نجران كان في زمان عمر بن الخطاب حفر خربة من خرب نجران لبعض حاجته فوجد عبدالله بن التامر تحت دفن فيها قاعدا واضعا يده على ضربة في رأسه ممسكا عليها بيده فإذا أخذت يده عنها تنبعث دما وإذا أرسلت يده ردت عليها فأمسكت دمها وفي يده خاتم مكتوب فيه ربي الله فكتب فيه إلى عمر بن الخطاب يخبره بأمره فكتب عمر إليهم أن أقروه على حاله وردوا عليه الذي كان عليه ففعلوا. وقد قال أبو بكر عبدالله بن محمد بن أبي الدنيا رحمه الله حدثنا أبو بلال الأشعري حدثنا إبراهيم بن محمد عن عبدالله بن جعفر بن أبي طالب حدثني بعض أهل العلم أن أبا موسى لما افتتح أصبهان وجد حائطا من حيطان المدينة قد سقط فبناه فسقط ثم بناه فسقط فقيل له إن تحته رجلا صالحا فحفر الأساس فوجد فيه رجلا قائما معه سيف فيه مكتوب أنا الحارث بن مضاض نقمت على أصحاب الأخدود فاستخرجه أبو موسى وبنى الحائط فثبت \"قلت\" هو الحارث بن مضاض بن عمرو بن مضاض بن عمرو الجرهمي أحد ملوك جرهم الذين ولوا أمر الكعبة بعد ولد ثابت بن إسماعيل بن إبراهيم وولد الحارث هذا هو عمرو بن الحارث بن مضاض هو آخر ملوك جرهم بمكة لما أخرجتهم خزاعة وأجلوهم إلى اليمن وهو القائل في شعره الذي قال ابن هشام إنه أول شعر قالته العرب: كأن لم يكن بين الحجون إلى الصفا أنيس ولم يسمر بمكة سامر بلى نحن كنا أهلها فأبادنا صروف الليالي والجدود العواثر وهذا يقتضي أن هذه القصة كانت قديما بعد زمان إسماعيل عليه السلام بقرب من خمسمائة سنة أو نحوها وما ذكره ابن إسحاق يقتضي أن قصتهم كانت في زمان الفترة التي بين عيسى ومحمد عليهما من الله السلام وهو أشبه والله أعلم وقد يحتمل أن ذلك قد وقع في العالم كثيرا كما قال ابن أبي حاتم حدثنا أبي حدثنا أبو اليمان أخبرنا صفوان عن عبدالرحمن بن جبير قال كانت الأخدود في اليمن زمان تبع وفي القسطنطينية زمان قسطنطين حين صرف النصارى قبلتهم عن دين المسيح والتوحيد فاتخذا أتونا وألقي فيه النصارى الذين كانوا على دين المسيح والتوحيد وفي العراق فى أرض بابل بختنصر الذي صنع الصنم وأمر الناس أن يسجدوا له فامتنع دانيال وصاحباه عزريا وميشائيل فأوقد لهم أتونا وألقى فيه الحطب والنار ثم ألقاهما فيه فجعلها الله تعالى عليهما بردا وسلاما وأنقذهما منها وألقى فيها الذين بغوا عليه وهم تسعة رهط فأكلتهم النار وقال أسباط عن السدي في قوله تعالى \"قتل أصحاب الأخدود\" قال كانت الأخدود ثلاثة: خد بالعراق وخد بالشام وخد باليمن. رواه ابن أبي حاتم وعن مقاتل قال كانت الأخدود ثلاثة: واحدة بنجران باليمن والأخرى بالشام والأخر بفارس حرقوا بالنار أما التي بالشام فهو انطنايوس الرومي وأما التي بفارس فهو بختنصر وأما التي بأرض العرب فهو يوسف ذو نواس فأما التي بفارس والشام فلم ينزل الله تعالى فيهم قرآنا وأنزل في التي كانت بنجران وقال ابن أبي حاتم حدثنا أبي حدثنا أحمد بن عبدالرحمن الدشتكي حدثنا عبدالله بن أبي جعفر عن أبيه عن الربيع هو ابن أنس في قوله تعالى \"قتل أصحاب الأخدود\" قال سمعنا أنهم كانوا قوما فى زمان الفترة فلما رأوا ما وقع في الناس من الفتنة والشر وصاروا أحزابا كل حزب بما لديهم فرحون اعتزلوا إلى قرية سكنوها وأقاموا على عبادة الله مخلصين له الدين حنفاء ويقيموا الصلاة ويؤتوا الزكاة فكان هذا أمرهم حتى سمع بهم جبار من الجبارين وحدث حديثهم فأرسل إليهم فأمرهم أن يعبدوا الأوثان التي اتخذوا وأنهم أبوا عليه كلهم وقالوا لا نعبد إلا الله وحده لا شريك له فقال لهم إن لم تعبدوا هذه الآلهة التي عبدت فإني قاتلكم فأبوا عليه فخد أخدوا من نار وقال لهم الجبار وقفهم عليها اختاروا هذه أو الذي نحن فيه فقالوا هذه أحب إلينا وفيهم نساء وذرية ففزعت الذرية فقالوا لهم أي آباؤهم لا نار من بعد اليوم فوقعوا فيها فقبضت أرواحهم من قبل أن يمسهم حرها وخرجت النار من مكانها فأحاطت بالجبارين فأحرقهم الله بها ففي ذلك أنزل الله عز وجل \"قتل أصحاب الأخدود النار ذات الوقود إذ هم عليها قعود وهم على ما يفعلون بالمؤمنين شهود وما نقموا منهم إلا أن يؤمنوا بالله العزيز الحميد الذي له ملك السموات والأرض والله على كل شيء شهيد\" ورواه ابن جرير حدثت عن عمار عن عبدالله بن أبي جعفر به نحوه."
    }
  ]
}
