{
  "ayahs": [
    {
      "ayah": 1,
      "surah": 86,
      "text": "سورة الطارق: قال عبدالله بن الإمام أحمد حدثنا أبي حدثنا عبدالله بن محمد قال عبدالله وسمعته أنا منه حدثنا مروان بن معاوية الفزاري عن عبدالله بن عبدالرحمن الطائفي عن عبدالرحمن بن خالد بن أبي جبل العدواني عن أبيه أنه أبصر رسول الله صلى الله عليه وسلم في مشرق ثقيف وهو قائم على قوس أو عصى حين أتاهم يبتغي عندهم النصر فسمعته يقول \"والسماء والطارق\" حتى ختمها قال فوعيتها فى الجاهلية وأنا مشرك ثم قرأتها في الإسلام قال فدعتني ثقيف فقالوا ماذا سمعت من هذا الرجل؟ فقرأتها عليهم فقال من معهم من قريش نحن أعلم بصاحبنا لو كنا نعلم ما يقول حقا لاتبعناه. وقال النسائي حدثنا عمرو بن منصور حدثنا أبو نعيم عن مسعر عن محارب بن دثار عن جابر قال: صلى معاذ المغرب فقرأ البقرة والنساء فقال النبي صلى الله عليه وسلم \"أفتان أنت يا معاذ ؟ ما كان يكفيك أن تقرأ بالسماء والطارق والشمس وضحاها ونحوها؟\" يقسم تبارك وتعالى بالسماء وما جعل فيها من الكواكب النيرة ولهذا قال تعالى \"والسماء والطارق\"."
    },
    {
      "ayah": 10,
      "surah": 86,
      "text": "وقوله تعالى \"فما له\" أي الإنسان يوم القيامة \"من قوة\" أي في نفسه \"ولا ناصر\" أي من خارج منه أي لا يقدر على أن ينقذ نفسه من عذاب الله ولا يستطيع له أحد ذلك."
    },
    {
      "ayah": 11,
      "surah": 86,
      "text": "قال ابن عباس: الرجع المطر وعنه هو السحاب فيه المطر وعنه \"والسماء ذات الرجع\" تمطر ثم تمطر وقال قتادة ترجع رزق العباد كل عام ولولا ذلك لهلكوا وهلكت مواشيهم وقال ابن زيد ترجع نجومها وشمسها وقمرها يأتين من ههنا."
    },
    {
      "ayah": 12,
      "surah": 86,
      "text": "قال ابن عباس هو انصداعها عن النبات وكذا قال سعيد بن جبير وعكرمة وأبو مالك والضحاك والحسن وقتادة والسدي وغير واحد."
    },
    { "ayah": 13, "surah": 86, "text": "قال ابن عباس حق وكذا قال قتادة وقال آخر حكم عدل." },
    { "ayah": 14, "surah": 86, "text": "أي بل هو جد حق." },
    { "ayah": 15, "surah": 86, "text": "أي يمكرون بالناس في دعوتهم إلى خلاف القرآن." },
    { "ayah": 16, "surah": 86, "text": "لا يوجد تفسير لهذه الأية" },
    {
      "ayah": 17,
      "surah": 86,
      "text": "أي أنظرهم ولا تستعجل لهم \"أمهلهم رويدا\" أي قليلا أي وسترى ماذا أحل بهم من العذاب والنكال والعقوبة والهلاك كما قال تعالى \"نمتعهم قليلا ثم نضطرهم إلى عذاب غليظ\". آخر تفسير سورة الطارق. ولله الحمد والمنة."
    },
    {
      "ayah": 2,
      "surah": 86,
      "text": "قال قتادة وغيره إنما سمي النجم طارقا لأنه إنما يرى بالليل ويختفي بالنهار ويؤيده ما جاء في الحديث الصحيح نهى أن يطرق الرجل أهله طروقا أي يأتيهم فجأة بالليل وفي الحديث الآخر المشتمل على الدعاء \"إلا طارقا يطرق بخير يا رحمن\"."
    },
    {
      "ayah": 3,
      "surah": 86,
      "text": "وقوله تعالى \"الثاقب\" قال ابن عباس المضيء وقال السدي يثقب الشياطين إذا أرسل عليها وقال عكرمة هو مضيء ومحرق للشيطان."
    },
    {
      "ayah": 4,
      "surah": 86,
      "text": "أي كل نفس عليها من الله حافظ يحرسها من الآفات كما قال تعالى \"له معقبات من بين يديه ومن خلفه يحفظونه من أمر الله\"."
    },
    {
      "ayah": 5,
      "surah": 86,
      "text": "تنبيه للإنسان على ضعف أصله الذي خلق منه وإرشاد له إلى الاعتراف بالمعاد لأن من قدر على البداءة فهو قادر على الإعادة بطريق الأولى كما قال تعالى \"وهو الذي يبدأ الخلق ثم يعيده وهو أهون عليه\"."
    },
    { "ayah": 6, "surah": 86, "text": "يعني المني يخرج دفقا من الرجل ومن المرأة فيتولد منهما الولد بإذن الله عز وجل." },
    {
      "ayah": 7,
      "surah": 86,
      "text": "يعني صلب الرجل وترائب المرأة وهو صدرها. وقال شبيب بن بشر عن عكرمة عن ابن عباس \"يخرج من بين الصلب والترائب\" صلب الرجل وترائب المرأة أصفر رقيق لا يكون الولد إلا منهما وكذا قال سعيد بن جبير وعكرمة وقتادة والسدي وغيرهم وقال ابن أبي حاتم حدثنا أبو سعيد الأشج حدثنا أبوأسامة عن مسعر سمعت الحكم ذكر عن ابن عباس \"يخرج من بين الصلب والترائب\" قال هذه الترائب ووضع يده على صدره. وقال الضحاك وعطية عن ابن عباس تريبة المرأة موضع القلادة وكذا قال عكرمة وسعيد بن جبير. قال علي بن أبي طلحة عن ابن عباس الترائب بين ثدييها وعن مجاهد: الترائب ما بين المنكبين إلى الصدر وعنه أيضا الترائب أسفل من التراقي وقال سفيان الثوري: فوق الثديين وعن سعيد بن جبير الترائب أربعة أضلاع من هذا الجانب الأسفل وعن الضحاك الترائب بين الثديين والرجلين والعينين وقال الليث بن سعد عن معمر بن أبي جبيبة المدني أنه بلغه في قول الله عز وجل \"يخرج من بين الصلب والترائب\" قال وهو عصارة القلب من هناك يكون الولد وعن قتادة \"يخرج من بين الصلب والترائب\" من بين صلبه ونحره."
    },
    {
      "ayah": 8,
      "surah": 86,
      "text": "فيه قولان \"أحدهما\" على رجع هذا الماء الدافق إلى مقره الذي خرج منه لقادر على ذلك قاله مجاهد وعكرمة وغيرهما \"والقول الثاني\" إنه على رجع هذا الإنسان المخلوق من ماء دافق أي إعادته وبعثه إلى الدار الآخرة لقادر لأن من قدر على البداءة قدر على الإعادة وقد ذكر الله عز وجل هذا الدليل في القرآن في غير ما موضع وهذا القول قال به الضحاك واختاره ابن جرير."
    },
    {
      "ayah": 9,
      "surah": 86,
      "text": "أي يوم القيامة تبلى فيه السرائر أي تظهر وتبدو ويبقى السر علانية والمكنون مشهورا وقد ثبت في الصحيحين عن ابن عمر أن رسول الله صلى الله عليه وسلم قال \"يرفع لكل غادر لواء عند استه يقال هذه غدرة فلان بن فلان\"."
    }
  ]
}
