{
  "ayahs": [
    {
      "ayah": 1,
      "surah": 87,
      "text": "سورة الأعلي: الدليل على ذلك ما رواه البخاري حدثنا عبدان أخبرني أبي عن شعبة عن أبي إسحاق عن البراء بن عازب قال أول من قدم علينا من أصحاب النبي صلى الله عليه وسلم مصعب بن عمير وابن أم مكتوم فجعلا يقرئاننا القرآن ثم جاء عمار وبلال وسعد ثم جاء عمر بن الخطاب في عشرين ثم جاء النبي صلى الله عليه وسلم فما رأيت أهل المدينة فرحوا بشيء فرحهم به حتى رأيت الولائد والصبيان يقولون هذا رسول الله صلى الله عليه وسلم قد جاء فما جاء حتى قرأت سبح اسم ربك الأعلى في سور مثلها. وقال الإمام أحمد حدثنا وكيع حدثنا إسرائيل عن ثوير بن أبي فاخته عن أبيه عن علي رضي الله عنه قال: كان رسول الله صلى الله عليه وسلم يحب هذه السورة سبح اسم ربك الأعلى تفرد به أحمد وثبت في الصحيحين أن رسول الله صلى الله عليه وسلم قال لمعاذ \"هلا صليت ب\"سبح اسم ربك الأعلى والشمس وضحاها والليل إذا يغشي\" \".وقال الإمام أحمد حدثنا سفيان عن إبراهيم بن محمد بن المنتشر عن أبيه عن حبيب بن سالم عن أبيه عن النعمان بن بشير أن رسول الله صلى الله عليه وسلم قرأ في العيدين ب\"سبح اسم ربك الأعلي\" و\"هل أتاك حديث الغاشية\" وإن وافق يوم الجمعة قرأهما جميعا. هكذا وقع في مسند الإمام أحمد إسناد هذا الحديث وقد رواه مسلم في صحيحه وأبو داود والترمذي والنسائي من حديث أبو عوانه وجرير وشعبة ثلاثتهم عن محمد بن المنتشر عن أبيه عن حبيب بن سالم عن النعمان بن بشير به قال الترمذي وكذا رواه الثوري ومسعر عن إبراهيم قال ورواه سفيان بن عيينه عن إبراهيم عن أبيه عن حبيب بن سالم عن أبيه عن النعمان ولا يعرف لحبيب رواية عن أبيه وقد رواه ابن ماجه عن محمد بن الصباح عن سفيان بن عيينة عن إبراهيم بن المنتشر عن أبيه عن حبيب بن سالم عن النعمان به كما رواه الجماعة فالله أعلم ولفظ مسلم وأهل السنن كان يقرأ في العيدين ويوم الجمعة ب\"سبح اسم رب الأعلى\" و\"هل أتاك حديث الغاشية\" وربما اجتمعا في يوم واحد فقرأهما. وقد روى الإمام أحمد في مسنده من حديث أبي بن كعب وعبدالله بن عباس وعبدالرحمن بن أبزى وعائشة أم المؤمنين أن رسول الله صلى الله عليه وسلم كان يقرأ في الوتر ب\"سبح اسم ربك الأعلى\" و\"قل يا أيها الكافرون\" و\"قل هو الله أحد\" زادت عائشة والمعوذتين. وهكذا روي هذا الحديث من طريق جابر وأبي أمامة صدي بن عجلان وعبدالله بن مسعود وعمران بن حصين وعلي ابن أبي طالب رضي الله عنهم ولولا خشية الإطالة لأوردنا ما تيسر لنا من أسانيد ذلك ومتونه ولكن في الإرشاد بهذا الاختصار كفاية والله أعلم. قال الإمام أحمد حدثنا أبو عبدالرحمن حدثنا موسى يعني ابن أيوب الغافقي حدثنا عمي إياس بن عامر سمعت عقبة بن عامر الجهني لما نزلت \"فسبح باسم ربك العظيم\" قال لنا رسول الله صلى الله عليه وسلم \"اجعلوها في ركوعكم\" فلما نزلت \"سبح اسم ربك الأعلى\" قال \"اجعلوها في سجودكم\" ورواه أبو داود وابن ماجه من حديث ابن المبارك عن موسى بن أيوب به. وقال الإمام أحمد حدثنا وكيع حدثنا إسرائيل عن أبي إسحاق عن مسلم البطين عن سعيد بن جبير عن ابن عباس أن رسول الله صلى الله عليه وسلم كان إذا \"قرأ سبح اسم ربك الأعلى\" قال \"سبحان ربي الأعلى\" وهكذا رواه أبو داود عن زهير بن حرب عن وكيع به قال وخولف فيه وكيع رواه أبو وكيع وشعبة عن أبي إسحاق عن سعيد عن ابن عباس موقوفا وقال الثوري عن السدي عن عبد خير قال سمعت عليا قرأ \"سبح اسم ربك الأعلى\" فقال سبحان ربي الأعلى. وقال ابن جرير حدثنا ابن حميد حدثنا حكام عن عنبسة عن أبي إسحاق الهمداني أن ابن عباس كان إذا قرأ \"سبح اسم ربك الأعلى\" يقول سبحان ربي الأعلى وإذا قرأ \"لا أقسم بيوم القيامة\" فأتى على آخرها \"أليس ذلك بقادر على أن يحيي الموتى\" يقول سبحانك وبلى وقال قتادة \"سبح اسم ربك الأعلى\" ذكر لنا أن نبي الله صلى الله عليه وسلم كان إذا قرأها قال سبحان ربي الأعلى."
    },
    { "ayah": 10, "surah": 87, "text": "أي سيتعظ بما تبلغه يا محمد من قلبه يخشى الله ويعلم أنه ملاقيه." },
    { "ayah": 11, "surah": 87, "text": "لا يوجد تفسير لهذه الأية" },
    { "ayah": 12, "surah": 87, "text": "لا يوجد تفسير لهذه الأية" },
    {
      "ayah": 13,
      "surah": 87,
      "text": "أي لا يموت فيستريح ولا يحيي حياة تنفعه بل هي مضرة عليه لأن بسببها يشعر ما يعاقب به من أليم العذاب وأنواع النكال. قال الإمام أحمد حدثنا ابن أبي عدي عن سليمان يعني التيمي عن أبي نضرة عن أبي سعيد قال: قال رسول الله صلى الله عليه وسلم \"أما أهل النار الذين هم أهلها لا يموتون ولا يحيون وأما أناس يريد الله بهم الرحمة فيميتهم في النار فيدخل عليهم الشفعاء فيأخذ الرجل الضبارة فينبتهم - أو قال - ينبتون في نهر الحيا - أو قال الحياة أو قال الحيوان أو قال نهر الجنة - فينبتون نبات الحبة في حميل السيل\" قال وقال النبي صلى الله عليه وسلم \"أما ترون الشجرة تكون خضراء ثم تكون صفراء ثم تكون خضراء ؟ \" قال: فقال بعضهم كأن النبي صلى الله عليه وسلم كان بالبادية. وقال أحمد أيضا حدثنا إسماعيل حدثنا سعيد بن يزيد عن أبي نضرة عن أبي سعيد الخدري قال: قال رسول الله صلى الله عليه وسلم \"أما أهل النار الذين هم أهلها فإنهم لا يموتون فيها ولا يحيون ولكن أناس - أو كما قال - تصيبهم النار بذنوبهم - أو قال بخطاياهم فيميتهم إماتة حتى إذا صاروا فحما أذن في الشفاعة فجيء بهم ضبائر ضبائر فبثوا على أنهار الجنة فيقال يا أهل الجنة أفيضوا عليهم فينبتون نبات الحبة تكون في حميل السيل\" قال: فقال رجل من القوم حينئذ كأن رسول الله صلى الله عليه وسلم كان بالبادية ورواه مسلم من حديث بشر بن المفضل وشعبة كلاهما عن أبي سلمة سعيد بن يزيد به مثله ورواه أحمد أيضا عن يزيد عن سعيد بن إياس الجريري عن أبي نضرة عن أبي سعيد عن النبي صلى الله عليه وسلم قال \"إن أهل النار الذين لا يريد الله إخراجهم لا يموتون فيها ولا يحيون وأن أهل النار الذين يريد الله إخراجهم يميتهم فيها إماته حتى يصيروا فحما ثم يخرجون ضبائر فيلقون على أنهار الجنة فيرش عليهم من أنهار الجنة فينبتون كما تنبت الحبة فى حميل السيل\". وقد قال الله تعالي إخبارا عن أهل النار ونادوا يا مالك ليقض علينا ربك قال إنكم ماكثون وقال تعالي\"لا يقضى عليهم فيموتوا ولا يخفف عنهم من عذابها\" إلى غير ذلك من الآيات في هذا المعنى."
    },
    {
      "ayah": 14,
      "surah": 87,
      "text": "أي طهر نفسه من الأخلاق الرذيلة وتابع ما أنزل الله على الرسول صلى الله عليه وسلم."
    },
    {
      "ayah": 15,
      "surah": 87,
      "text": "أى أقام الصلاة فى أوقاتها ابتغاء رضوان الله وطاعة لأمر الله وامتثالا لشرع الله. وقد قال الحافظ أبو بكر البزار حدثنا عباد بن أحمد العزرمي حدثنا عمي محمد بن عبدالرحمن عن أبيه عن عطاء بن السائب عن عبدالرحمن بن سابط عن جابر بن عبدالله عن النبي صلى الله عليه وسلم قال قد أفلح من تزكى قال \"من شهد أن لا إله إلا الله وخلع الأنداد وشهد أني رسول الله\" \"وذكر اسم ربه فصلى\" قال \"هي الصلوات الخمس والمحافظة عليها والاهتمام بها\" ثم قال لا يروي عن جابر إلا من هذا الوجه وكذا قال ابن عباس إن المراد بذلك الصلوات الخمس واختاره ابن جرير. وقال ابن جرير حدثني عمرو بن عبدالحميد الأيلي حدثنا مروان بن معاوية عن أبي خلدة قال دخلت على أبي العالية فقال لي إذا غدوت غدا إلى العيد فمر بي قال فمررت به فقال هل طعمت شيئا؟ قلت نعم قال أفضت على نفسك من الماء؟ قلت نعم قال فأخبرني ما فعلت زكاتك؟ قلت قد وجهتها قال إنما أردتك لهذه ثم قرأ \"قد أفلح من تزكى وذكر اسم ربه فصلى\" وقال إن أهل المدينة لا يرون صدقة أفضل منها ومن سقاية الماء \"قلت\" وقد روينا عن أمير المؤمنين عمر بن عبدالعزيز أنه كان يأمر الناس بإخراج صدقة الفطر ويتلو هذه الآية \"قد أفلح من تزكي وذكر اسم ربه فصلى\" وقال أبو الأحوص إذا أتي أحدكم سائل وهو يريد الصلاة فليقدم بين يدي صلاته زكاته فإن الله تعالى يقول \"قد أفلح من تزكى وذكر اسم ربه فصلى\" وقال قتادة في هذه الآية \"قد أفلح من تزكى وذكر اسم ربه فصلى\" زكي ماله وأرضى خالقه."
    },
    {
      "ayah": 16,
      "surah": 87,
      "text": "أي تقدمونها علي أمر الآخرة وتبدونها على ما فيه نفعكم وصلاحكم في معاشكم ومعادكم."
    },
    {
      "ayah": 17,
      "surah": 87,
      "text": "أي ثواب الله في الدار الآخرة خير من الدنيا وأبقى فإن الدنيا دانية فانية والآخرة شريفة باقية فكيف يؤثر عاقل ما يفني على ما يبقى ويهتم بما يزول عنه قريبا ويترك الاهتمام بدار البقاء والخلد. قال الإمام أحمد حدثنا حسين بن محمد حدثنا دويد عن أبي إسحاق عن عروة عن عائشة قالت: قال رسول الله صلى الله عليه وسلم \"الدنيا دار من لا دار له ومال من لا مال له ولها يجمع من لا عقل له\" وقال ابن جرير حدثنا ابن حميد حدثنا يحيي بن واضح حدثنا أبو حمزة عن عطاء عن عرفجة الثقفي قال: استقرأت ابن مسعود \"سبح اسم ربك الأعلى\" - فلما بلغ - \"بل تؤثرون الحياة الدنيا\" ترك القراءة وأقبل على أصحابه وقال آثرنا الدنيا على الآخرة فسكت القوم فقال آثرنا الدنيا لأنا رأينا زينتها ونساءها وطعامها وشرابها وزويت عنا الآخرة فاخترنا هذا العاجل وتركنا الآجل. وهذا منه على وجه التواضع والهضم أو هو إخبار عن الجنس من حيث هو والله أعلم. وقد قال الإمام أحمد حدثنا سليمان بن داود الهاشمي حدثنا إسماعيل بن جعفر أخبرني عمرو بن أبي عمر وعن المطلب بن عبدالله عن أبي موسى الأشعري أن رسول الله صلى الله عليه وسلم قال \"من أحب دنياه أضر بآخرته ومن أحب آخرته أضر بدنياه فآثروا ما يبقى على ما يفنى\" تفرد به أحمد. وقد رواه أيضا عن أبي سلمة الخزاعي عن الدراوردي عن عمرو بن أبي عمرو به مثله سواء."
    },
    {
      "ayah": 18,
      "surah": 87,
      "text": "يقول تعالى: {قد أفلح من تزكى} أي طهر نفسه من الأخلاق الرذيلة، واتبع ما أنزل اللّه على الرسول صلوات اللّه وسلامه عليه، {وذكر اسم ربه فصلى} أي أقام الصلاة في أوقاتها ابتغاء رضوان اللّه وامتثالاً لشرع اللّه، روي عن جابر بن عبد اللّه يرفعه {قد أفلح من تزكى} قال: من شهد أن لا إله إلا اللّه، وخلع الأنداد، وشهد أني رسول اللّه {وذكر اسم ربه فصلى} قال: (هي الصلوات الخمس والمحافظة عليها والاهتمام بها) \"\"أخرجه الحافظ البزار\"\". وكذا قال ابن عباس أن المراد بذلك الصلوات الخمس، واختاره ابن جرير، وعن عمر بن عبد العزيز أنه كان يأمر الناس بإخراج صدقة الفطر، ويتلو هذه الآية: {قد أفلح من تزكى. وذكر اسم ربه فصلى}، وقال قتادة في هذه الآية: {قد أفلح من تزكى. وذكر اسم ربه فصلى} زكى ماله وأرضى خالقه، ثم قال تعالى: {بل تؤثرون الحياة الدنيا} أي تقدمونها على أمر الآخرة، وتبدّونها على ما فيه نفعكم وصلاحكم في معاشكم ومعادكم، {والآخرة خير وأبقى} أي ثواب اللّه في الدار الآخرة، خير من الدنيا وأبقى، فإن الدنيا دانية فانية، والآخرة شريفة باقية، فكيف يؤثر عاقل ما يفنى على ما يبقى، ويهتم بما يزول عنه قريباً ويترك الاهتمام بدار البقاء والخلد؟ وقد قال رسول اللّه صلى اللّه عليه وسلم:(الدنيا دار من لا دار له، ومال من لا مال له، ولها يجمع من لا عقل له) \"\"أخرجه أحمد عن عائشة مرفوعاً\"\" عن عجرفة الثقفي قال: استقرأت ابن مسعود: {سبح اسم ربك الأعلى} فلما بلغ {بل تؤثرون الحياة الدنيا} ترك القراءة وأقبل على أصحابه وقال: آثرنا الدنيا على الآخرة، فسكت القوم، فقال: آثرنا الدنيا لأنا رأينا زينتها ونساءها وطعامها وشرابها، وزويت عنا الآخرة، فاخترنا هذا العاجل وتركنا الآجل، وهذا منه على وجه التواضع والهضم، وفي الحديث: (من أحب دنياه أضر بآخرته، ومن أحب آخرته أضر بدنياه فآثروا ما يبقى على ما يفنى) \"\"أخرجه أحمد عن أبي موسى الأشعري مرفوعاً\"\"، وقوله تعالى: {إن هذا لفي الصحف الأولى. صحف ابراهيم وموسى} كقوله في سورة النجم: {أم لم ينبأ بما في صحف موسى وإبراهيم الذي وفى. ألا تزر وازرة وزر أُخْرَى. وأن ليس للإنسان إلا ما سعى. وأن سعيه سوف يرى. ثم يجزاه الجزاء الأوفى. وأن إلى ربك المنتهى} الآيات إلى آخرهن؛ وهكذا قال عكرمة في قوله تعالى: {إن هذا لفي الصحف الأولى. صحف إبراهيم وموسى} يقول: الآيات التي في {سبح اسم ربك الأعلى}، وقال أبو العالية: قصة هذه السورة في الصحف الأولى، واختار ابن جرير أن المراد بقوله: {إنّ هذا} إشارة إلى قوله: {قد أفلح من تزكى. وذكر اسم ربه فصلى. بل تؤثرون الحياة الدنيا. والآخرة خير وأبقى}، ثم قال تعالى: {إن هذا} أي مضمون الكلام {لفي الصحف الأولى. صحف إبراهيم وموسى} وهذا الذي اختاره حسن قوي، وقد روي عن قتادة وابن زيد نحوه، واللّه أعلم."
    },
    {
      "ayah": 19,
      "surah": 87,
      "text": "وقوله تعالى إن هذا لفي الصحف الأولى صحف إبراهيم وموسى قال الحافظ أو بكر البزار حدثنا نصر بن علي حدثنا معتمر بن سليمان عن أبيه عن عطاء بن السائب عن عكرمة عن ابن عباس قال لما نزلت إن هذا لفي الصحف الأولى صحف إبراهيم وموسى قال النبي صلى الله عليه وسلم \"كان كل هذا - أو كان هذا - فى صحف إبراهيم وموسى\" ثم قال لا نعلم أسند الثقات عن عطاء بن السائب عن عكرمة عن ابن عباس غير هذا وحديثا آخر رواه مثل هذا وقال النسائي أخبرنا زكريا بن يحيي أخبرنا نصر بن علي حدثنا المعتمر بن سليمان عن أبيه عن عطاء بن السائب عن عكرمة عن ابن عباس قال لما نزلت سبح اسم ربك الأعلى قال كلها في صحف إبراهيم وموسى ولما نزلت وإبراهيم الذي وفى قال وفى إبراهيم ألا تزر وازرة وزر أخرى يعني أن هذه الآية كقوله تعالى في سورة النجم أم لم ينبأ بما في صحف موسى وإبراهيم الذي وفى ألا تزر وازرة وزر أخرى وأن ليس للأنسان إلا ما سعى وأن سعيه سوف يرى ثم يجزاه الجزاء الأوفى وأن إلى ربك المنتهى الآيات إلي آخرهن. وهكذا قال عكرمة فيما رواه ابن جرير عن ابن حميد عن مهران عن سفيان الثوري عن أبيه عن عكرمة في قوله تعالى \"إن هذا لفي الصحف الأولى صحف إبراهيم وموسى\" يقول الآيات التي في \"سبح اسم ربك الأعلى\" وقال أبو العالية قصة هذه السورة في الصحف الأولى واختار ابن جرير أن المراد بقوله \"إن هذا\" إشارة إلى قوله\"قد أفلح من تزكى وذكر اسم ربه فصلى بل تؤثرون الحياة الدنيا والآخرة خير وأبقى\" ثم قال تعالي \"إن هذا\" أي مضمون هذا الكلام \"لفي الصحف الأولى صحف إبراهيم وموسى\" وهذا الذي اختاره حسن قوي وقد روي عن قتادة وابن زيد نحوه والله أعلم آخر تفسير سورة سبح. ولله الحمد والمنة وبه التوفيق والعصمة."
    },
    { "ayah": 2, "surah": 87, "text": "أي خلق الخليقة وسوى كل مخلوق في أحسن الهيئات." },
    {
      "ayah": 3,
      "surah": 87,
      "text": "قال مجاهد هدى الإنسان للشقاوة والسعادة وهدى الأنعام لمراتعها. وهذه الآية كقوله تعالى إخبارا عن موسى أنه قال لفرعون \"ربنا الذي أعطي كل شيء خلقه ثم هدى\" أي قدر قدرا وهدى الخلائق إليه كما ثبت في صحيح مسلم عن عبدالله بن عمرو أن رسول الله صلى الله عليه وسلم قال \"إن الله قدر مقادير الخلائق قبل أن يخلق السموات والأرض بخمسين ألف سنة وكان عرشه على الماء\"."
    },
    { "ayah": 4, "surah": 87, "text": "أي من جميع صنوف النباتات والزروع." },
    {
      "ayah": 5,
      "surah": 87,
      "text": "قال ابن عباس هشيما متغيرا وعن مجاهد وقتادة وابن زيد نحوه. قال ابن جرير وكان بعض أهل العلم بكلام العرب يرى أن ذلك من المؤخر الذي معناه التقديم وأن معني الكلام والذي أخرج المرعى أحوى: أي أخضر إلى السواد فجعله غثاء بعد ذلك ثم قال ابن جرير وهذا وإن كان محتملا إلا أنه غير صواب لمخالفته أقوال أهل التأويل."
    },
    {
      "ayah": 6,
      "surah": 87,
      "text": "وقوله تعالى\" سنقرئك\" أي يا محمد\" فلا تنسي\" وهذا إخبار من الله تعالى ووعد منه له بأنه سيقرئه قراءة لا ينساها."
    },
    {
      "ayah": 7,
      "surah": 87,
      "text": "\"إلا ما شاء الله\" وهذا اختيار ابن جرير وقال قتادة كان رسول الله صلى الله عليه وسلم لا ينسى شيئا إلا ما شاء الله وقيل المراد بقوله فلا تنسى طلب وجعل معني الاستثناء على هذا ما يقع من النسخ أي لا تنسى ما نقرئك إلا ما يشاء الله رفعه فلا عليك أن تتركه. وقوله تعالى \"إنه يعلم الجهر وما يخفى\" أي يعلم ما يجهر به العباد وما يخفونه من أقوالهم وأفعالهم لا يخفى عليه من ذلك شيء."
    },
    {
      "ayah": 8,
      "surah": 87,
      "text": "أي نسهل عليك أفعال الخير وأقواله ونشرع لك شرعا سهلا سمحا مستقيما عدلا لا اعوجاج فيه ولا حرج ولا عسر."
    },
    {
      "ayah": 9,
      "surah": 87,
      "text": "أي ذكر حيث تنفع التذكرة ومن ههنا يؤخذ الأدب في نشر العلم فلا يضعه عند غير أهله كما قال أمير المؤمنين علي ما أنت بمحدث قوما حديثا لا تبلغه عقولهم إلا كان فتنة لبعضهم وقال حدث الناس بما يعرفون أتحبون أن يكذب الله ورسوله؟."
    }
  ]
}
