{
  "ayahs": [
    {
      "ayah": 1,
      "surah": 88,
      "text": "سورة الغاشية: قد تقدم عن النعمان بن بشير أن رسول الله صلى الله عليه وسلم كان يقرأ بسبح اسم ربك الأعلى والغاشية في صلاة العيد ويوم الجمعة. وقال الإمام مالك عن ضمرة بن سعيد عن عبيدالله بن عبدالله أن الضحاك بن قيس سأل النعمان بن بشير بم كان رسول الله صلى الله عليه وسلم يقرأ في الجمعة مع سورة الجمعة؟ قال: هل أتاك حديث الغاشية.ورواه أبو داود عن القعنبي والنسائي عن قتيبة كلاهما عن مالك به ورواه مسلم وابن ماجه من حديث سفيان بن عيينة عن ضمرة بن سعيد به. الغاشية من أسماء يوم القيامة. قاله ابن عباس وقتادة وابن زيد لأنها تغشي الناس وتعمهم وقد قال ابن أبي حاتم حدثنا أبي حدثنا علي بن محمد الطنافسي حدثنا أبو بكر بن عياش عن أبي إسحاق عن عمرو بن ميمون قال: مر النبي صلى الله عليه وسلم على امرأة تقرأ\" هل أتاك حديث الغاشية\" فقام يستمع ويقول \"نعم قد جاءني\"."
    },
    { "ayah": 10, "surah": 88, "text": "أي رفيعة بهية في الغرفات آمنون." },
    {
      "ayah": 11,
      "surah": 88,
      "text": "أي لا تسمع في الجنة التي هم فيها كلمة لغو كما قال تعالى \"لا يسمعون فيها لغوا إلا سلاما\" وقال تعالى \"لا لغو فيها ولا تأثيم\" وقال تعالى \"لا يسمعون فيها لغوا ولا تأثيما إلا قيلا سلاما سلاما\"."
    },
    {
      "ayah": 12,
      "surah": 88,
      "text": "سارحة وهذه نكرة في سياق الإثبات وليس المراد بها عينا واحدة وإنما هذا جنس يعني فيها عيون جاريات. قال ابن أبي حاتم قرئ على الربيع بن سليمان حدثنا أسد بن موسى حدثنا ابن ثوبان عن عطاء بن قرة عن عبيدالله بن ضمرة عن أبي هريرة قال: قال رسول الله صلى الله عليه وسلم \"أنهار الجنة تفجر من تحت تلال - أو من تحت جبال - المسك\"."
    },
    {
      "ayah": 13,
      "surah": 88,
      "text": "أي عالية ناعمة كثيرة الفرش مرتفعة السمك عليها الحور العين قالوا فإذا أراد ولي الله أن يجلس على تلك السرر العالية تواضعت له."
    },
    { "ayah": 14, "surah": 88, "text": "يعني أواني الشرب معدة مرصدة لمن أرادها من أربابها." },
    {
      "ayah": 15,
      "surah": 88,
      "text": "قال ابن عباس النمارق الوسائد وكذا قال عكرمة وقتادة والضحاك والسدى والثوري وغيرهم."
    },
    {
      "ayah": 16,
      "surah": 88,
      "text": "قال ابن عباس الزرابي البسط وكذا قال الضحاك وغير واحد ومعنى مبثوثة أي ههنا وههنا لمن أراد الجلوس عليها ونذكر ههنا هذا الحديث الذي رواه أبو بكر بن أبي داود حدثنا عمرو بن عثمان حدثنا أبي عن محمد بن مهاجر عن الضحاك المعافري عن سليمان بن موسى حدثني كريب أنه سمع أسامة بن زيد يقول: قال رسول الله صلى الله عليه وسلم \"ألا هل من مشمر للجنة فإن الجنة لا خطر لها ورب الكعبة نور يتلألأ وريحانة تهتز وقصر مشيد ونهر مطرد وثمرة نضيجة وزوجة حسناء جميلة وحلل كثيرة ومقام في أبد في دار سليمة وفاكهة وخضرة وحبرة ونعمة في محلة عالية بهية؟ \"قالوا نعم يا رسول الله نحن المشمرون لها قال \"قولوا إن شاء الله\" قال القوم إن شاء الله ورواه ابن ماجه عن العباس بن عثمان الدمشقي عن الوليد بن مسلم بن محمد بن مهاجر به."
    },
    {
      "ayah": 17,
      "surah": 88,
      "text": "يقول تعالى آمرأ عباده بالنظر في مخلوقاته الدالة على قدرته وعظمته\" أفلا ينظرون إلى الإبل كيف خلقت\" فإنها خلق عجيب وتركيبها غريب فإنها في غاية القوة والشدة وهي مع ذلك تلين للحمل الثقيل وتنقاد للقائد الضعيف وتؤكل وينتفع بوبرها ويشرب لبنها ونبهوا بذلك لأن العرب غالب دوابهم كانت الإبل وكان شريح القاضي يقول اخرجوا بنا حتى ننظر إلى الإبل كيف خلقت؟."
    },
    {
      "ayah": 18,
      "surah": 88,
      "text": "أي كيف رفعها الله عز وجل عن الأرض هذا الرفع العظيم كما قال تعالى\" أفلم ينظروا إلى السماء فوقهم كيف بنيناها وزيناها وما لها من فروج\"."
    },
    {
      "ayah": 19,
      "surah": 88,
      "text": "أي جعلت منصوبة فإنها ثابتة راسية لئلا تميد الأرض بأهلها وجعل فيها ما جعل من المنافع والمعادن."
    },
    { "ayah": 2, "surah": 88, "text": "أي ذليلة قاله قتادة وقال ابن عباس تخشع ولا ينفعها عملها." },
    {
      "ayah": 20,
      "surah": 88,
      "text": "أي كيف بسطت ومدت ومهدت ؟ فنبه البدوي على الاستدلال بما يشاهده من بعيره الذي هو راكب عليه والسماء التي فوق رأسه والجبل الذي تجاهه والأرض التي تحته على قدرة خالق ذلك وصانعه وأنه الرب العظيم الخالق المالك المتصرف وانه الإله الذي لا يستحق العبادة سواه وهكذا أقسم ضمام في سؤاله على رسول الله صلى الله عليه وسلم كما رواه الإمام أحمد حيث قال حدثنا هاشم بن القاسم حدثنا سليمان بن المغيرة عن ثابت عن أنس قال: كنا نهينا أن نسأل رسول الله صلى الله عليه وسلم عن شيء فكان يعجبنا أن يجيء الرجل من أهل البادية العاقل فيسأله ونحن نسمع فجاء رجل من أهل البادية فقال يا محمد إنه أتانا رسولك فزعم لنا أنك تزعم أن الله أرسلك قال \"صدق\" قال فمن خلق السماء ؟ قال \"الله\" قال فمن خلق الأرض ؟ قال \"الله\" قال فمن نصب هذه الجبال وجعل فيها ما جعل ؟ قال \"الله\" قال فبالذي خلق السماء والأرض ونصب هذه الجبال آلله أرسلك ؟ قال \"نعم\" قال وزعم رسولك أن علينا خمس صلوات في يومنا وليلتنا ؟ قال \"صدق\" قال فبالذي أرسلك آلله أمرك بهذا؟ قال \"نعم\" قال وزعم رسولك أن علينا زكاة في أموالنا؟ قال \"صدق\" قال فبالذي أرسلك آلله أمرك بهذا؟ قال \"نعم\" قال وزعم رسولك أن علينا حج البيت من استطاع إليه سبيلا قال \"صدق\" قال ثم ولى فقال والذي بعثك بالحق لا أزيد عليهن شيئا ولا أنقص منهن شيئا فقال النبي صلى الله عليه وسلم \"إن صدق ليدخلن الجنة\" وقد رواه مسلم عن عمرو الناقد عن أبي النضر هاشم بن القاسم به وعلقه البخاري ورواه الترمذي والنسائي من حديث سليمان بن المغيرة به. ورواه الإمام أحمد والبخاري وأبو داود والنسائي وابن ماجه من حديث الليث بن سعد عن سعيد المقبري عن شريك بن عبدالله بن أبي نمر عن أنس به بطوله وقال في آخره وأنا ضمام بن ثعلبة أخو بني سعد بن بكر وقال الحافظ أبو يعلى حدثنا إسحاق حدثنا عبدالله بن جعفر حدثني عبدالله بن دينار عن ابن عمر قال: كان رسول الله صلى الله عليه وسلم كثيرا ما كان يحدث عن امرأة في الجاهلية على رأس جبل معها ابن صغير لها ترعى غنما فقال لها ابنها يا أمه من خلقك ؟ قالت الله قال فمن خلق أبي: قالت الله قال فمن خلقني قالت الله قال فمن خلق السماء ؟ قالت الله قال فمن خلق الأرض ؟ قالت الله قال فمن خلق الجبل ؟ قالت الله قال فمن خلق هذه الغنم ؟ قالت الله قال فإني لأسمع لله شأنا وألقى نفسه من الجبل فتقطع قال ابن عمر كان رسول الله صلى الله عليه وسلم كثيرا ما يحدثنا هذا. قال ابن دينار كان ابن عمر كثيرا ما يحدثنا هذا في إسناده ضعف وعبدالله بن جعفر هذا هو المديني ضعفه ولده الإمام علي بن المديني وغيره."
    },
    { "ayah": 21, "surah": 88, "text": "أي فذكر يا محمد الناس بما أرسلت به إليهم فإنما عليك البلاغ وعلينا الحساب." },
    {
      "ayah": 22,
      "surah": 88,
      "text": "قال ابن عباس ومجاهد وغيرهما لست عليهم بجبار أي لست تخلق الإيمان في قلوبهم وقال ابن زيد لست بالذي تكرههم على الإيمان قال الإمام أحمد حدثنا وكيع عن سفيان عن أبي الزبير عن جابر قال: قال رسول الله صلى الله عليه وسلم \"أمرت أن أقاتل الناس حتى يقولوا لا إله إلا الله فإذا قالوها عصموا مني دماءهم وأموالهم إلا بحقها وحسابهم على الله عز وجل\" ثم قرأ \"فذكر إنما أنت مذكر لست عليهم بمصيطر\" وهكذا رواه مسلم في كتاب الإيمان والترمذي والنسائي في كتاب التفسير من سننيهما من حديث سفيان بن سعيد الثوري به بهذه الزيادة وهذا الحديث مخرج في الصحيحين من رواية أبي هريرة بدون ذكر هذه الآية."
    },
    {
      "ayah": 23,
      "surah": 88,
      "text": "أي تولى عن العمل بأركانه وكفر بالحق بجنانه ولسانه وهذه كقوله تعالى \"فلا صدق ولا صلى ولكن كذب وتولى\"."
    },
    {
      "ayah": 24,
      "surah": 88,
      "text": "قال الإمام أحمد حدثنا قتيبة حدثنا ليث عن سعيد بن أبي هلال عن علي بن خالد أن أبا أمامة الباهلي مر على خالد بن يزيد بن معاوية فسأله عن ألين كلمة سمعها من رسول الله صلى الله عليه وسلم فقال سمعت رسول الله صلى الله عليه وسلم يقول \"ألا كلكم يدخل الجنة إلا من شرد على الله شراد البعير على أهله\" تفرد بإخراجه الإمام أحمد وعلي بن خالد هذا ذكره ابن أبي حاتم عن أبيه ولم يزد على ما ههنا."
    },
    {
      "ayah": 25,
      "surah": 88,
      "text": "روى عن أبي أمامة وعنه سعيد بن أبي هلال وقوله تعالى\"إن إلينا إيابهم\" أي مرجعهم ومنقلبهم."
    },
    {
      "ayah": 26,
      "surah": 88,
      "text": "أي نحن نحاسبهم على أعمالهم ونجازيهم بها إن خيرا فخير وإن شرا فشر. آخر تفسير سورة الغاشية.ولله الحمد والمنة."
    },
    {
      "ayah": 3,
      "surah": 88,
      "text": "أي قد عملت عملا كثيرا ونصبت فيه وصليت يوم القيامة نارا حامية. قال الحافظ أبو بكر البرقاني حدثنا إبراهيم بن محمد المزكى حدثنا محمد بن إسحاق السراج حدثنا هارون بن عبدالله حدثنا سيار حدثنا جعفر قال سمعت أبا عمران الجوني يقول مر عمر بن الخطاب رضي الله تعالى عنه بدير راهب قال فناداه يا راهب فأشرف قال فجعل عمر ينظر إليه ويبكي فقيل له يا أمير المؤمنين ما يبكيك من هذا؟ قال ذكرت قول الله عز وجل في كتابه\" عاملة ناصبة تصلى نارا حامية\" فذاك الذي أبكاني. وقال البخاري قال ابن عباس\" عاملة ناصبة\" النصاري وعن عكرمة والسدي عاملة في الدنيا بالمعاصي ناصبة في النار بالعذاب والإهلاك."
    },
    { "ayah": 4, "surah": 88, "text": "قال ابن عباس والحسن وقتادة\" تصلى نارا حامية\" أي حارة شديدة الحر." },
    { "ayah": 5, "surah": 88, "text": "أي قد انتهى حرها وغليانها قاله ابن عباس ومجاهد والحسن والسدي." },
    {
      "ayah": 6,
      "surah": 88,
      "text": "قال علي بن أبي طلحة عن ابن عباس شجر من النار وقال سعيد بن جبير هو الزقوم وعنه أنها الحجارة وقال ابن عباس مجاهد وعكرمة وأبو الجوزاء وقتادة هو الشرق قال قتادة: قريش تسميه في الربيع الشبرق وفي الصيف الضريع قال عكرمة وهو شجرة ذات شوك لاطئة بالأرض. وقال البخاري قال مجاهد الضريع نبت يقال له الشبرق يسميه أهل الحجاز الضريع إذا يبس وهو سم وقال معمر عن قتادة ليس لهم طعام إلا من ضريع هو الشبرق إذا يبس سمي الضريع وقال سعيد عن قتادة ليس لهم طعام إلا من ضريع من شر الطعام وأبشعه وأخبثه."
    },
    { "ayah": 7, "surah": 88, "text": "يعني لا يحصل به مقصود ولا يندفع به محذور." },
    {
      "ayah": 8,
      "surah": 88,
      "text": "لما ذكر حال الأشقياء ثنى بذكر السعداء فقال \"وجوه يومئذ\" أي يوم القيامة \"ناعمة\" أي يعرف النعيم فيها وإنما حصل لها ذلك بسعيها."
    },
    { "ayah": 9, "surah": 88, "text": "وقال سفيان لسعيها راضية قد رضيت عملها." }
  ]
}
