{
  "ayahs": [
    {
      "ayah": 1,
      "surah": 89,
      "text": "سورة الفجر: قال النسائي أنا عبدالوهاب بن الحكم أخبرني يحيى بن سعيد عن سليمان عن محارب بن دثار وأبي صالح عن جابر قال صلى معاذ صلاة فجاء رجل فصلى معه فطول فصلى في ناحية المسجد ثم انصرف فبلغ ذلك معاذا فقال منافق فذكر ذلك لرسول الله صلى الله عليه وسلم فسأل الفتى فقال يا رسول الله جئت أصلي معه فطول علي فانصرفت وصليت في ناحية المسجد فعلفت ناقتي فقال رسول الله صلى الله عليه وسلم \"أفتان يا معاذ ؟ أين أنت من سبح اسم ربك الأعلى والشمس وضحاها والفجر والليل إذا يغشى \". أما الفجر فمعروف وهو الصبح قاله علي وابن عباس وعكرمة ومجاهد والسدي وعن مسروق ومحمد بن كعب المراد به فجر يوم النحر خاصة وهو خاتمه الليالي العشر وقيل المراد بذلك الصلاة التي تفعل عنده كما قاله عكرمة وقيل المراد به جميع النهار وهو رواية عن ابن عباس."
    },
    {
      "ayah": 10,
      "surah": 89,
      "text": "قال العوفي عن ابن عباس \"الأوتاد\" الجنود الذين يشدون له أمره ويقال كان فرعون يوتد أيديهم وأرجلهم في أوتاد من حديد يعلقهم بها وكذا قال مجاهد كان يوتد الناس بالأوتاد وهكذا قال سعيد بن جبير والحسن والسدي قال السدي كان يربط الرجل في كل قائمة من قوائمة في وتد ثم يرسل عليه صخرة عظيمة فيشدخه وقال قتادة بلغنا أنه كان له مظال وملاعب يلعب له تحتها من أوتاد وحبال وقال ثابت البناني عن أبي رافع قيل لفرعون ذي الأوتاد لأنه ضرب لامرأته أربعة أوتاد ثم جعل على ظهرها رحى عظيمة حتى ماتت."
    },
    { "ayah": 11, "surah": 89, "text": "أي تمردوا وعتوا." },
    { "ayah": 12, "surah": 89, "text": "عاثوا في الأرض بالإفساد والأذية للناس." },
    { "ayah": 13, "surah": 89, "text": "أي أنزل عليهم رجزا من السماء وأحل بهم عقوبة لا يردها عن القوم المجرمين." },
    {
      "ayah": 14,
      "surah": 89,
      "text": "قال ابن عباس يسمع ويرى يعني يرصد خلقه فيما يعملون ويجازى كلا بسعيه في الدنيا والأخرة وسيعرض الخلائق كلهم عليه فيحكم فيهم بعدله ويقابل كلا بما يستحقه وهو المنزه عن الظلم والجور وقد ذكر ابن أبي حاتم ههنا حديثا غريبا جدا وفي إسناده نظر وفي صحته قال حدثنا أبي حدثنا أحمد بن أبي الحواري حدثنا يونس الحذاء عن أبي حمزة البيساني عن معاذ بن جبل قال: قال رسول الله صلى الله عليه وسلم \"يا معاذ إن المؤمن لدى الحق أسير يا معاذ إن المؤمن لا يسكن روعه ولا يأمن اضطرابه حتى يخلف جسر جهنم خلف ظهره يا معاذ إن المؤمن قيده القرآن عن كثير من شهواته وعن أن يهلك فيها هو بإذن الله عز وجل فالقرآن دليله والخوف محجته والشوق مطيته والصلاة كهفه والصوم جنته. والصدقة فكاكه والصدق أميره والحياء وزيره وربه عز وجل من وراء ذلك كله \"بالمرصاد\" قال ابن أبي حاتم يونس الحذاء وأبو حمزة مجهولان وأبو حمزة عن معاذ مرسل ولو كان عن أبي حمزة لكان حسنا أي لو كان من كلامه لكان حسنا ثم قال ابن أبي حاتم حدثنا أبي حدثنا صفوان بن صالح حدثنا الوليد بن مسلم عن صفوان بن عمرو عن أيفع عن ابن عبدالكلاعي أنه سمعه وهو يعظ الناس يقول إن لجهنم سبع قناطر قال والصراط عليهن قال فيحبس الخلائق عند القنطرة الأولى فيقول \"قفوهم إنهم مسؤلون\" قال فيحاسبون على الصلاة ويسئلون عنها قال فيهلك فيها من هلك وينجو من نجا فإذا بلغوا القنطرة الثانيه حوسبوا على الأمانة كيف أدوها وكيف خانوها قال فيهلك من هلك وينجو من نجا فإذا بلغوا القنطرة الثالثة سئلوا عن الرحم كيف وصلوها وكيف قطعوها قال فيهلك من هلك وينجو من نجا قال والرحم يومئذ متدلية إلى الهوى في جهنم تقول اللهم من وصلني فصله ومن قطعني فاقطعه قال وهي التي يقول الله عز وجل \"إن ربك لبالمرصاد\" هكذا أورد هذا الأثر ولم يذكر تمامه."
    },
    {
      "ayah": 15,
      "surah": 89,
      "text": "يقول تعالى منكرا على الإنسان في اعتقاده إذا وسع الله تعالى عليه في الرزق ليختبره في ذلك فيعتقد أن ذلك من الله إكرام له وليس كذلك بل هو ابتلاء وامتحان كما قال تعالى \"أيحسبون إنما نمدهم به من مال وبنين نسارع لهم في الخيرات بل لا يشعرون\"."
    },
    {
      "ayah": 16,
      "surah": 89,
      "text": "وكذلك في الجانب الآخر إذا ابتلاه وامتحنه وضيق عليه في الرزق يعتقد أن ذلك من الله إهانةله."
    },
    {
      "ayah": 17,
      "surah": 89,
      "text": "\"كلا\" أي ليس الأمر كما زعم لا في هذا ولا في هذا فإن الله تعالى يعطي المال من يحب ومن لا يحب ويضيق على من يحب ومن لا يحب وإنما المدار في ذلك على طاعة الله في كل من الحالين إذا كان غنيا بأن يشكر الله على ذلك وإذا كان فقيرا بأن يصبر وقوله تعالى \"بل لا تكرمون اليتيم\" فيه أمر بالإكرام له كما جاء فى الحديث الذي رواه عبدالله بن المبارك عن سعيد بن أيوب عن يحيى بن سليمان عن يزيد بن أبي غيات عن أبي هريرة عن النبي صلى الله عليه وسلم \"خير بيت في المسلمين بيت فيه يتيم يحسن إليه وشر بيت في المسلمين بيت فيه يتيم يساء إليه - ثم قال بأصبعه -أنا وكافل اليتيم في الجنة هكذا\". وقال أبو داود حدثنا محمد بن الصباح بن سفيان أخبرنا عبدالعزيز يعني أبن أبي حازم حدثني ابي عن سهل يعني ابن سعيد أن رسول الله صلى الله عليه وسلم قال \"أنا وكافل اليتيم كهاتين في الجنة\" وقرن بين أصبعية الوسطي والتي تلي الإبهام."
    },
    { "ayah": 18, "surah": 89, "text": "يعني لا يأمرون بالإحسان إلى الفقراء والمساكين ويحث بعضهم على بعض في ذلك." },
    {
      "ayah": 19,
      "surah": 89,
      "text": "\"تأكلون التراث\" يعني الميراث \"أكلا لما\" أي من أي جهة حصل لهم من حلال أو حرام."
    },
    {
      "ayah": 2,
      "surah": 89,
      "text": "والليالي العشر المراد بها عشر ذي الحجة كما قاله ابن عباس وابن الزبير ومجاهد وغير واحد من السلف والخلف. وقد ثبت في صحيح البخاري عن ابن عباس مرفوعا \"ما من أيام العمل الصالح أحب إلى الله فيهن من هذه الأيام\" يعني عشر ذي الحجة قالوا ولا الجهاد في سبيل الله؟ قال \"ولا الجهاد في سبيل الله إلا رجلا خرج بنفسه وماله ثم لم يرجع من ذلك بشيء\" وقيل المراد بذلك العشر الأول من المحرم حكاه أبو جعفر بن جرير ولم يعزه إلى أحد وقد روى أبو كدينة عن قابوس بن أبي ظبيان عن أبيه عن ابن عباس. وليال عشر قال هو العشر الأول من رمضان والصحيح القول الأول. قال الإمام أحمد حدثنا زيد بن الحباب حدثنا عياش بن عقبة حدثني خير بن نعيم عن أبي الزبير عن جابر عن النبي صلى الله عليه وسلم قال \"إن العشر عشر الأضحى والوتر يوم عرفة والشفع يوم النحر\" ورواه النسائي عن محمد بن رافع وعبدة بن عبدالله وكل منهما عن زيد بن الحباب به. ورواه ابن جرير وابن أبي حاتم من حديث زيد بن الحباب به وهذا إسناد رجاله لا بأس بهم وعندي أن المتن في رفعه نكارة والله أعلم."
    },
    { "ayah": 20, "surah": 89, "text": "أي كثيرا زاد بعضهم فاحشا." },
    {
      "ayah": 21,
      "surah": 89,
      "text": "يخبر تعالى عما يقع يوم القيامة من الأهوال العظيمة فقال تعالى \"كلا\" أي حقا\"إذا دكت الأرض دكا دكا\" أي وطئت ومهدت وسويت الجبال وقام الخلائق من قبورهم لربهم."
    },
    {
      "ayah": 22,
      "surah": 89,
      "text": "\"وجاء ربك\" يعني لفصل القضاء بين خلقه وذلك بعدما يستشفعون إليه بسيد ولد آدم على الإطلاق محمد صلى الله عليه وسلم بعدما يسألون أولي العزم من الرسل واحدا بعد واحد فكلهم يقول لست بصاحب ذاكم حتى تنتهي النوبة إلى محمد صلى الله عليه وسلم فيقول \"أنا لها أنا لها\" فيذهب فيشفع عند الله تعالى في أن يأتي لفصل القضاء فيشفعه الله تعالى في ذلك وهي أول الشفاعات وهي المقام المحمود كما تقدم بيانه في سورة سبحان فيجيء الرب تبارك وتعالى لفصل القضاء كما يشاء والملائكة يجيئون بين يديه صفوفا صفوفا."
    },
    {
      "ayah": 23,
      "surah": 89,
      "text": "وقوله تعالى\"وجيء يومئذ بجهنم\"قال الإمام مسلم بن الحجاج في صحيحه حدثنا عمر بن حفص بن غياث حدثنا أبي عن العلاء بن خالد الكاهلي عن شقيق عن عبدالله هو ابن مسعود قال: قال رسول الله صلى الله عليه وسلم \"يؤتي بجهنم يومئذ لها سبعون ألف زمام مع كل زمام سبعون ألف ملك يجرونها\" وهكذا رواه الترمذي عن عبدالله بن عبدالرحمن الدارمي عن عمر بن حفص به ورواه أيضا عن عبد بن حميد عن أبي عامر عن سفيان الثوري عن العلاء بن خالد عن شقيق بن سلمة وهو أبو وائل عن عبدالله بن مسعود قوله ولم يرفعه وكذا رواه ابن جرير عن الحسن بن عرفة عن مروان بن معاوية الفزاري عن العلاء بن خالد عن شقيق عن عبدالله قوله وقوله تعالى \"يومئذ يتذكر الإنسان\" أي عمله وما كان أسلفه في قديم دهره وحديثه \"وأنى له الذكرى\" أى وكيف تنفعه الذكرى؟."
    },
    {
      "ayah": 24,
      "surah": 89,
      "text": "يعني يندم على ما كان سلف منه من المعاصي إن كان عاصيا ويود لو كان ازداد من الطاعات إن كان طائعا كما قال الإمام أحمد بن حنبل حدثنا علي بن إسحاق حدثنا عبدالله يعني ابن المبارك حدثنا ثور بن يزيد عن خالد بن معدان عن جبير بن نفير عن محمد بن عمرة وكان من أصحاب رسول الله صلى الله عليه وسلم قال: لو أن عبدا خر على وجهه من يوم ولد إلى أن يموت في طاعة الله لحقره يوم القيامة ولود أنه رد إلى لدنيا كيما يزداد من الأجر والثواب."
    },
    { "ayah": 25, "surah": 89, "text": "أي ليس أحد أشد عذابا من تعذيب الله من عصاه." },
    {
      "ayah": 26,
      "surah": 89,
      "text": "أحد أي وليس أحد أشد قبضا ووثقا من الزبانية لمن كفر بربهم عز وجل وهذا في حق المجرمين من الخلائق والظالمين."
    },
    { "ayah": 27, "surah": 89, "text": "وهي الساكنة الثابتة الدائرة مع الحق." },
    {
      "ayah": 28,
      "surah": 89,
      "text": "أي إلى جواره وثوابه وما أعد لعباده في جنته راضية أي في نفسها مرضية أي قد رضيت عن الله ورضي عنها وأرضاها."
    },
    { "ayah": 29, "surah": 89, "text": "أي في جملتهم." },
    {
      "ayah": 3,
      "surah": 89,
      "text": "قد تقدم في هذا الحديث أن الوتر يوم عرفة لكونه التاسع وأن الشفع يوم النحر لكونه العاشر وقاله ابن عباس وعكرمة والضحاك أيضا \"قول ثان\" وقال ابن أبي حاتم حدثنا أبو سعيد الأشج حدثني عقبة بن خالد عن واصل بن السائب قال سألت عطاء عن قوله تعالى \"والشفع والوتر\" قلت صلاتنا وترنا هذا ؟ قال لا ولكن الشفع يوم عرفة والوتر ليلة الأضحى \"قول ثالث\" قاله ابن أبي حاتم حدثنا محمد بن عامر بن إبراهيم الأصبهاني حدثني أبي عن النعمان يعني ابن عبدالسلام عن أبي سعيد بن عوف حدثني بمكة قال سمعت عبدالله بن الزبير يخطب الناس فقام إليه رجل فقال يا أمير المؤمنين أخبرني عن\"الشفع والوتر\" فقال\"الشفع\" قول الله تعالى \"فمن تعجل في يومين فلا إثم عليه\"\"والوتر\" قوله تعالى\" ومن تأخر فلا إثم عليه\" وقال ابن جريج أخبرني محمد بن المرتفع أنه سمع ابن الزبير يقول\"الشفع\" أوسط أيام التشريق\"والوتر\" آخر أيام التشريق. وفي الصحيحين من رواية أبي هريرة عن رسول الله صلى الله عليه وسلم \"إن لله تسعة وتسعين إسما مائة إلا واحدا من أحصاها دخل الجنة وهو وتر يحب الوتر\" \"قول رابع\" قال الحسن البصري وزيد بن أسلم الخلق كلهم شفع ووتر أقسم تعالى بخلقه وهو رواية عن مجاهد والمشهور عنه الأول وقال العوفي عن ابن عباس\"والشفع والوتر\" قال الله وتر واحد وأنتم شفع ويقال الشفع صلاة الغداة والوتر صلاة المغرب. \"قول خامس\" قال ابن أبي حاتم حدثنا أبو سعيد الأشج حدثنا عبيدالله بن موسى عن إسرائيل عن أبي يحيى عن مجاهد\"والشفع والوتر\" قال الشفع الزوج والوتر الله عز وجل وقال أبو عبدالله عن مجاهد: الله الوتر وخلقه الشفع الذكر والأنثى وقال ابن أبي نجيح عن مجاهد قوله \"والشفع والوتر\" كل شيء خلقه الله شفع السماء والأرض والبر والبحر والجن والإنس والشمس والقمر ونحو هذا ونحا مجاهد في هذا ما ذكروه في قوله تعالى \"ومن كل شيء خلقنا زوجين لعلكم تذكرون\" أي لتعلموا أن خالق الأزواج واحد \"قول سادس\" قال قتادة عن الحسن\"والشفع والوتر\" هو العدد منه شفع ومنه وتر. \"قول سابع في الآية الكريمة\" رواه ابن أبي حاتم وابن جرير من طريق ابن جريج ثم قال ابن جرير وروي عن النبي صلى الله عليه وسلم خبر يؤيد القول الذي ذكرنا عن ابن الزبير حدثني عبدالله بن أبي زياد القطواني حدثنا زيد بن الحباب أخبرني عياش بن عقبة حدثني خير بن نعيم عن أبي الزبير عن جابر أن رسول الله قال \"الشفع\"اليومان \"والوتر\" اليوم الثالث\" هكذا ورد هذا الخبر بهذا اللفظ وهو مخالف لما تقدم من اللفظ في رواية أحمد والنسائي وابن أبي حاتم وما رواه هو أيضا والله أعلم. قال أبو العالية والربيع بن أنس وغيرهما هي الصلاة منها شفع كالرباعية والثنائية ومنها وتر كالمغرب فإنها ثلاث وهي وتر النهار وكذلك صلاة الوتر في آخر التهجد من الليل. وقد قال عبدالرزاق عن معمر عن قتادة عن عمران بن حصين \"والشفع والوتر\" قال هي الصلاة المكتوبة منها شفع ومنها وتر وهذا منقطع وموقوف ولفظه خاص بالمكتوبة وقد روي متصلا مرفوعا إلى النبي صلى الله عليه وسلم ولفظه عام. قال الإمام أحمد حدثنا أبو داود هو الطيالسي حدثنا همام عن قتادة عن عمران بن عصام أن شيخا حدثه من أهل البصرة عن عمران بن حصين أن رسول الله صلى الله عليه وسلم سئل عن\"الشفع والوتر\" فقال \"هي الصلاة بعضها شفع وبعضها وتر\"هكذا وقع في المسند وكذا رواه ابن جرير عن بندار عن عفان وعن أبي كريب عن عبيدالله بن موسى كلاهما عن همام وهو ابن يحيى عن قتادة عن عمران بن عصام عن شيخ عن عمران بن حصين وكذا رواه أبو عيسى الترمذي عن عمرو بن على عن ابن مهدي وأبي داود كلاهما عن همام عن قتادة عن عمران بن عصام عن رجل من أهل البصرة عن عمران بن حصين به ثم قال غريب لا نعرفه إلا من حديث قتادة وقد رواه خالد بن قيس أيضا عن قتادة وقد روي عن عمران بن عصام عن عمران نفسه والله أعلم \"قلت\" ورواه ابن أبي حاتم حدثنا أحمد بن سنان الواسطي حدثنا يزيد بن هارون أخبرنا همام عن قتادة عن عمران بن عصام الضبعي شيخ من أهل البصرة عن عمران بن حصين عن النبي صلى الله عليه وسلم فذكره هكذا رأيته في تفسيره فجعل الشيخ البصري هو عمران بن عصام. وهكذا رواه ابن جرير أخبرنا نصر بن علي حدثني أبي حدثني خالد بن قيس عن قتادة عن عمران بن عصام عن عمران بن حصين عن النبي صلى الله عليه وسلم في\"الشفع والوتر\" قال \"هي الصلاة منها شفع ومنها وتر\"فأسقط ذكر الشيخ المبهم وتفرد به عمران بن عصام الضبعي أبو عمارة البصري إمام مسجد بني ضبيعة وهو والد أبي جمرة نصر بن عمران الضبعي روى عنه قتادة وابنه أبو جمرة والمثنى بن سعيد وأبو التياح يزيد بن حميد وذكره ابن حبان في كتاب الثقات وذكره خليفة بن خياط في التابعين من أهل البصرة وكان شريفا نبيلا حظيا عند الحجاج بن يوسف ثم قتله يوم الراوية سنة ثنتين وثمانين لخروجه مع ابن الأشعث وليس له عند الترمذي سوى هذا الحديث الواحد وعندي أن وقفه على عمران بن حصين أشبه والله أعلم. ولم يجزم ابن جرير بشيء من هذه الأقوال في\"الشفع والوتر\"."
    },
    {
      "ayah": 30,
      "surah": 89,
      "text": "وهذا يقال لها عند الاحتضار وفي يوم القيامة أيضا كما أن الملائكة يبشرون المؤمن عند احتضاره وعند قيامه من قبره فكذلك ههنا. ثم اختلف المفسرون فيمن نزلت هذه الآية فروى الضحاك عن ابن عباس نزلت في عثمان بن عفان وعن بريدة بن الحصيب نزلت فى حمزة بن عبدالمطب قال عوفي عن ابن عباس يقال للأرواح المطمئنة يوم القيامة \"يا أيتها النفس المطمئنة إرجعي إلى ربك\" يعني صاحبك وهو بدنها الذي كانت لعمره في الدنيا راضية مرضية. وروي عنه أنه كان يقرؤها فادخلي في عبادي وادخلي جنتي وكذا قال عكرمة والكلبي واختاره ابن جرير وهو غريب والظاهر الأول لقوله تعالى \"ثم ردوا إلى الله مولاهم الحق\" \"وأن مردنا إلى الله\" أي إلى حكمه والوقوف بين يديه. وقال ابن أبي حاتم حدثنا علي بن الحسين حدثنا أحمد بن عبدالرحمن بن عبدالله الدشتكي حدثني أبي عن أبيه عن أشعث عن جعفر عن سعيد بن جبير عن ابن عباس في قوله تعالى \"يا أيتها النفس المطمئنة ارجعي إلى ربك راضية مرضية\" قال نزلت وأبو بكر جالس فقال يا رسول الله ما أحسن هذا فقال \"أما إنه سيقال لك هذا\" ثم قال حدثنا أبو سعيد الأشج حدثنا ابن يمان عن أشعث عن سعيد بن جبير قال: قرأت عند النبي صلى الله عليه وسلم \"يا أيتها النفس المطمئنة ارجعي إلى ربك راضية مرضية\" فقال أبو بكر رضي الله عنه إن هذا لحسن فقال له النبي صلى الله عليه وسلم \"أما إن الملك سيقول لك هذا عند الموت\" كذا رواه ابن جرير عن أبي كريب عن ابن يمان به وهذا مرسل حسن. ثم قال ابن أبي حاتم وحدثنا الحسن بن عرفة حدثنا مروان بن شجاع الجزري عن سالم الأفطس عن سعيد بن جبير قال: مات ابن عباس بالطائف فجاء طير لم ير على خلقته فدخل نعشه ثم لم ير خارجا منه فلما دفن تليت هذه الآية على شفير القبر لا يدرى من تلاها\"يا أيتها النفس المطمئنة ارجعي إلى ربك راضية مرضية فادخلي في عبادي وادخلي جنتي\"ورواه الطبراني عن عبدالله بن أحمد عن أبيه عن مروان بن شجاع عن سالم بن عجلان الأفطس به فذكره. وقد ذكر الحافظ محمد بن المنذر الهروي المعروف بشكر في كتاب العجائب بسنده عن قباث بن رزين أبي هاشم قال: أسرت فى بلاد الروم فجمعنا الملك وعرض علينا دينه على أن من امتنع ضربت عنقه فارتد ثلاثة وجاء الرابع فامتنع فضربت عنقه وألقي رأسه في نهر هناك فرسب في الماء ثم طفا على وجه الماء ونظر إلى أولئك الثلاثة فقال يا فلان ويا فلان ويا فلان يناديهم بأسمائهم قال الله تعالى في كتابه\"يا أيتها النفس المطمئنة ارجعي إلى ربك راضية مرضية فادخلي في عبادي وادخلى جنتي\"ثم غاص في الماء. قال فكادت النصارى أن يسلموا ووقع سرير الملك ورجع أولئك الثلاثة إلى الإسلام قال وجاء الفداء من عند الخليفة أبي جعفر المنصور فخلصنا. وروى الحافظ ابن عساكر في ترجمة رواحة بنت أبي عمرو الأوزاعي عن أبيها حدثني سليمان بن حبيب المحاربي حدثني أبو أمامة أن رسول الله صلى الله عليه وسلم قال لرجل \"قل اللهم إني أسألك نفسا بك مطمئنة تؤمن بلقائك وترضي بقضائك وتقنع بعطائك \" ثم روى عن أبي سليمان بن وبر أنه قال حديث رواحة هذا واحد أمه. آخر تفسير سورة الفجر. ولله الحمد والمنة."
    },
    {
      "ayah": 4,
      "surah": 89,
      "text": "قال العوفي عن ابن عباس أي إذا ذهب وقال عبدالله بن الزبير\"والليل إذا يسر\" حتى يذهب بعضه بعضا وقال مجاهد وأبو العالية وقتاة ومالك عن زيد بن أسلم وابن زيد\"والليل إذا يسر\" إذا سار وهذا يمكن حمله على ما قال ابن عباس أي ذهب ويحتمل أن يكون المراد إذا سار أي أقبل وقد يقال إن هذا أنسب لأنه في مقابلة قوله\"والفجر\"فإن\"الفجر\" هو إقبال النهار وإدبار الليل فإذا حمل قوله\"والليل إذا يسر\" على إقباله كان قسما بإقبال الليل وإدبار النهار وبالعكس كقوله\" والليل إذا عسعس والصبح إذا تنفس\"وكذا قال الضحاك\"والليل إذا يسر\" أي يجري وقال عكرمة\"والليل إذا يسر\" يعني ليلة جمع ليلة المزدلفة. رواه ابن جرير وابن أبي حاتم. ثم قال ابن أبي حاتم حدثنا أحمد بن عصام حدثنا أبو عامر عن كثير بن عبدالله بن عمرو قال سمعت محمد بن كعب القرظي يقول في قول\"والليل إذا يسر\" قال أسر يا سار ولا تبيتن إلا بجمع."
    },
    {
      "ayah": 5,
      "surah": 89,
      "text": "أي لذي عقل ولب ودين وحجى وإنما سمي العقل حجرا لأنه يمنع الإنسان من تعاطي مالا يليق به من الأفعال والأقوال ومنه حجر البيت لأنه يمنع الطائف من اللصوق بجداره الشامي ومنه حجر اليمامة وحجر الحاكم على فلان إذا منعه التصرف \"ويقولون حجرا محجورا\" كل هذا من قبيل واحد ومعني متقارب وهذا القسم هو بأوقات العبادة وبنفس العبادة من حج وصلاة وغير ذلك من أنواع القرب التي يتقرب بها إليه عباده المتقون المطيعون له الخائفون منه المتواضعون لديه الخاشعون لوجهه الكريم."
    },
    {
      "ayah": 6,
      "surah": 89,
      "text": "وهؤلاء كانوا متمردين عتاة جبارين خارجين عن طاعته مكذبين لرسله جاحدين لكتبه فذكر تعالى كيف أهلكهم ودمرهم وجعلهم أحاديث وعبرا فقال \"ألم تر كيف فعل ربك بعاد إرم ذات العماد\" وهؤلاء عاد الأولى وهم ولد عاد بن إرم بن عوص بن سام بن نوح. قاله ابن إسحاق وهم الذين بعث الله فيهم رسوله هودا فكذبوه وخالفوه فأنجاه الله من بين أظهرهم ومن آمن معه منهم وأهلكهم\"بريح صرصر عاتية سخرها عليهم سبع ليال وثمانية أيام حسوما فترى القوم فيها صرعي كأنهم أعجاز نخل خاوية فهل ترى لهم من باقية\"وقد ذكر الله قصتهم في القرآن في غير ما موضع ليعتبر بمصرعهم المؤمنون."
    },
    {
      "ayah": 7,
      "surah": 89,
      "text": "عطف بيان زيادة تعريف بهم وقوله تعالى\"ذات العماد\" لأنهم كانوا يسكنون بيوت الشعر التي ترفع بالأعمدة الشداد وقد كانوا أشد الناس في زمانهم خلقة وأقواهم بطشا ولهذا ذكرهم هود بتلك النعمة وأرشدهم إلى أن يستعملوها فى طاعة ربهم الذي خلقهم فقال \"واذكروا إذا جعلكم خلفاء من بعد قوم نوح وزادكم في الخلق بسطة فاذكروا آلاء الله ولا تعثوا في الأرض مفسدين\"وقال تعالى \"فأما عاد فاستكبروا في الأرض بغير الحق وقالوا من أشد منا قوة أولم يروا أن الله الذى خلقهم هو أشد منهم قوة\"."
    },
    {
      "ayah": 8,
      "surah": 89,
      "text": "أى القبيلة التي لم يخلق مثلها في بلادهم لقوتهم وشدتهم وعظم تركيبهم قال مجاهد إرم أمة قديمة يعني عادا الأولى قال قتادة بن دعامة والسدي إن إرم بيت مملكة عاد وهذا قول حسن جيد قوى وقال مجاهد وقتادة والكلبي في قوله \"ذات العماد\" كانوا أهل عمد لا يقيمون وقال العوفي عن ابن عباس إنما قيل لهم ذات العماد لطولهم. واختار الأول ابن جرير ورد الثاني فأصاب وقوله تعالى \"التي لم يخلق مثلها في البلاد\" أعاد ابن زيد الضمير على العماد لارتفاعها وقال بنوا عمدا بالأحقاف لم يخلق مثلها في البلاد وأما قتادة وابن جرير فأعاد الضمير على القبيلة أي لم يخلق مثل تلك القبيلة في البلاد يعني في زمانهم وهذا القول هو الصواب وقول ابن زيد ومن ذهب مذهبه ضعيف لأنه لو كان المراد ذلك لقال التي لم يعمل مثلها في البلاد وإنما قال\"لم يخلق مثلها في البلاد\" وقال ابن أبي حاتم حدثنا أبي حدثنا أبو صالح كاتب الليث حدثنا معاوية بن صالح عمن حدثه عن المقدام عن النبي صلى الله عليه وسلم أنه ذكر\" إرم ذات العماد\" فقال كان الرجل منهم يأتي على الصخرة فيحملها على الحي فيهلكهم\"ثم قال ابن أبي حاتم حدثنا علي بن الحسين حدثنا أبو الطاهر حدثنا أنس بن عياض عن ثور بن زيد الديلي قال قرأت كتابا قد سمى حيث قرأه أنا شداد بن عاد وأنا الذي رفعت العماد وأنا الذي شددت بذراعي نظر واحد وأنا الذي كنزت كنزا على سبعة أذرع لا يخرجه إلا أمة محمد صلى الله عليه وسلم \"قلت\" فعلى كل قول سواء كانت العماد أبنية بنوها أو أعمدة بيوتهم للبدو أو سلاحا يقاتلون به أو طول الواحد منهم فهم قبيلة وأمة من الأمم وهم المذكورون في القرآن في غير ما موضع المقرونون بثمود كما ههنا والله أعلم. ومن زعم أن المراد بقوله\"إرم ذات العماد\" مدينة إما دمشق كما روي عن سعيد بن المسيب وعكرمة أو إسكندرية كما روي عن القرظي أو غيرهما ففيه نظر فإنه كيف يلتئم الكلام على هذا\"ألم تر كيف فعل ربك بعاد إرم ذات العماد\" إن جعل ذلك بدلا أو عطف بيان؟ فإنه لا يتسق الكلام حينئذ ثم المراد إنما هو الإخبار عن إهلاك القبيلة المسماة بعاد وما أحل الله بهم من بأسه الذي لا يرد لا أن المراد الإخبار عن مدينة أو إقليم. وإنما نبهت على ذلك لئلا يغتر بكثير مما ذكره جماعة من المفسرين عند هذه الآية من ذكر مدينة يقال لها \"إرم ذات العماد\" مبنية بلبن الذهب والفضة قصورها ودورها وبساتينها وإن حصباءها لآلىء وجواهر وترابها بنادق المسك وأنهارها سارحة وثمارها ساقطة ودورها لا أنيس بها وسورها وأبوابها تصفر ليس بها داع ولا مجيب وإنها تنتقل فتارة تكون بأرض الشام وتارة باليمن وتارة بالعراق وتارة بغير ذلك من البلاد فإن هذا كله من خرافات الإسرائليين من وضع بعض زنادقتهم ليختبروا بذلك عقول الجهلة من الناس أن تصدقهم في جميع ذلك. وذكر الثعلبي وغيره أن رجلا من الأعراب وهو عبدالله بن قلابة في زمان معاوية ذهب في طلب أباعر له شردت فبينما هو يتيه في ابتغائها إذ اطلع على مدينة عظيمة لها سور وأبواب فدخلها فوجد فيها قريبا مما ذكرناه من صفات المدينة الذهبية التي تقدم ذكرها وأنه رجع فأخبر الناس فذهبوا معه إلى المكان الذي قال فلم يروا شيئا. وقد ذكر ابن أبي حاتم قصة\"إرم ذات العماد\" ههنا مطولة جدا فهذه الحكاية ليس يصح إسنادها ولو صح إلى ذلك الأعرابي فقد يكون اختلق ذلك أو أنه أصابه نوع من الهوس والخبال فاعتقد أن ذلك له حقيقة في الخارج وليس كذلك وهذا مما يقطع بعدم صحته وهذا قريب مما يخبر به كثير من الجهلة والطامعين والمتحيلين من وجود مطالب تحت الأرض فيها قناطير الذهب والفضة وألوان الجواهر واليواقيت واللآلئ والإكسير الكبير لكن عليها موانع تمنع من الوصول إليها والأخذ منها فيحتالون على أموال الأغنياء والضعفة والسفهاء فيأكلونها بالباطل في صرفها في بخاخير وعقاقير ونحو ذلك من الهذيانات ويطنزون بهم والذي يجزم به أن في الأرض دفائن جاهلية وإسلامية وكنوزا كثيرة من ظفر بشيء منها أمكنه تحويله فأما على الصفة التي زعموها فكذب وافتراء وبهت ولم يصح في ذلك شيء مما يقولون إلا عن نقلهم أو نقل من أخذ عنهم والله سبحانه وتعالى الهادي للصواب. وقول ابن جرير يحتمل أن يكون المراد بقوله\"إرم ذات العماد\" قبيلة أو بلدة كانت عاد تسكنها فلذلك لم تصرف. فيه نظر لأن المراد من السياق إنما هو الإخبار عن القبيلة."
    },
    {
      "ayah": 9,
      "surah": 89,
      "text": "يعني يقطعون الصخر بالوادي قال ابن عباس ينحتونها ويخرقونها وكذا قال مجاهد وقتادة والضحاك وابن زيد ومنه يقال مجتابي النمار إذا خرقوها واجتاب الثوب إذا فتحه ومنه الجيب أيضا وقال الله تعالى \"وتنحتون من الجبال بيوتا فارهين\" وأنشد ابن جرير وابن أبي حاتم ههنا قول الشاعر: ألا كل شيء ما خلا الله بائد كما باد حي من شنيف ومارد هم ضربوا في كل صماء صعدة بأيد شداد أيدات السواعد وقال ابن إسحاق كانوا عربا وكان منزلهم بوادي القرى وقد ذكرنا قصة عاد مستقصاة في سورة الأعراف بما أغني عن إعادته."
    }
  ]
}
