{
  "ayahs": [
    {
      "ayah": 1,
      "surah": 9,
      "text": "هذه السورة الكريمة من أواخر ما نزل على رسول الله صلى الله عليه وسلم كما قال البخاري حدثنا أبو الوليد حدثنا شعبة عن أبي إسحق قال: سمعت البراء يقول آخر آية نزلت \" يستفتونك قل الله يفتيكم في الكلالة \" وآخر سورة نزلت براءة وإنما لم يبسمل في أولها لأن الصحابة لم يكتبوا البسملة في أولها في المصحف الإمام بل اقتدوا في ذلك بأمير المؤمنين عثمان بن عفان رضي الله عنه وأرضاه. كما قال الترمذي: حدثنا محمد بن بشار حدثنا يحيى بن سعيد ومحمد بن أبي جعفر وابن عدي وسهيل بن يوسف قالوا: حدثنا عوف عن أبي جميلة أخبرني يزيد الفارسي أخبرني ابن عباس قال: قلت لعثمان ابن عفان ما حملكم أن عمدتم إلى الأنفال وهي من المثاني وإلى براءة وهي من المئين وقرنتم بينهما ولم تكتبوا بينهما سطر بسم الله الرحمن الرحيم ووضعتموها في السبع الطول ما حملكم على ذلك فقال عثمان: كان رسول الله صلى الله عليه وسلم مما يأتي عليه الزمان وهو ينزل عليه السور ذوات العدد فكان إذا نزل عليه الشيء دعا بعض من كان يكتب فيقول ضعوا هذه الآية في السورة التي يذكر فيها كذا وكذا وكانت الأنفال من أول ما نزل بالمدينة وكانت براءة من آخر ما نزل من القرآن وكانت قصتها شبيهة بقصتها وخشيت أنها منها وقبض رسول الله صلى الله عليه وسلم ولم يبين لنا أنها منها فمن أجل ذلك قرنت بينهما ولم أكتب بينهما سطر بسم الله الرحمن الرحيم ووضعتها في السبع الطول. وكذا رواه الإمام أحمد وأبو داود والنسائي وابن حبان في صحيحه والحاكم في مستدركه من طرق أخر عن عوف الأعرابي به وقال الحاكم صحيح الأسناد ولم يخرجاه وأول هذه السورة الكريمة نزل على رسول الله صلى الله عليه وسلم لما رجع من غزوة تبوك وهم بالحج ثم ذكر أن المشركين يحضرون عامهم هذا الموسم على عادتهم في ذلك وأنهم يطوفون بالبيت عراة فكره مخالطتهم وبعث أبا بكر الصديق رضي الله عنه أميرا على الحج تلك السنة ليقيم للناس مناسكهم ويعلم المشركين أن لا يحجوا بعد عامهم هذا وأن ينادي في الناس \" براءة من الله ورسوله \" فلما قفل أتبعه بعلي بن أبي طالب ليكون مبلغا عن رسوله صلى الله عليه وسلم لكونه عصبة له كما سيأتي بيانه فقوله تعالى \" براءة من الله ورسوله \" أي هذه براءة أي تبرؤ من الله ورسوله \" إلى الذين عاهدتم من المشركين\"."
    },
    {
      "ayah": 10,
      "surah": 9,
      "text": "\" إنهم ساء ما كانوا يعلمون لا يرقبون في مؤمن إلا ولا ذمة \" ولا راقبوا فيهم إلا ولا ذمة قال علي بن أبي طلحة وعكرمة والعوفي عن ابن عباس: الآل القرابة والذمة العهد وكذا قال الضحاك والسدي كما قال تميم بن مقبل: أفسد الناس خلوف خلفوا قطعوا الإل وأعراق الرحم وقال حسان بن ثابت رضي الله عنه: وجدناهم كاذبا إليهم وذو الإل والعهد لا يكذب وقال ابن أبي نجيح عن مجاهد لا يرقبون في مؤمن إلا: قال إلال الله ; وفي رواية لا يرقبون الله ولا غيره وقال ابن جرير: حدثني يعقوب حدثنا ابن علية عن سليمان عن أبي مجلز في قوله تعالى \" لا يرقبون في مؤمن إلا ولا ذمة \" مثل قوله جبريل ميكائيل إسرافيل كأنه يقول لا يرقبون الله والقول الأول أظهر وأشهر وعليه الأكثر. وعن مجاهد أيضا الإل العهد. وقال قتادة الإل الحلف."
    },
    {
      "ayah": 100,
      "surah": 9,
      "text": "يخبر تعالى عن السابقين من المهاجرين والأنصار والتابعين لهم بإحسان ورضاهم عنه بما أعد لهم من جنات النعيم المقيم; قال الشعبي: السابقون الأولون من المهاجرون والأنصار من أدرك بيعة الرضوان عام الحديبية وقال أبو موسى الأشعري وسعيد بن المسيب ومحمد بن سرين والحسن وقتادة هم الذين صلوا إلى القبلتين مع رسول الله صلى الله عليه وسلم صلى الله عليه وسلم وقال محمد بن كعب القرظي. مر عمر بن الخطاب برجل يقرأ هذه الأية \" والسابقون الأولون من المهاجرين والأنصار \" فأخذ عمر بيده فقال: من أقرأك هذا؟ فقال أبي بن كعب. فقال لا تفارقني حتى أذهب بك إليه فلما جاءه قال عمر أنت أقرأت هذا هذه الأية هكذا؟ قال نعم. قال: وسمعتها من رسول الله صلى الله عليه وسلم ؟ قال نعم. قال لقد كنت أرى أنا رفعنا رفعة لا يبلغها أحد بعدنا. فقال أبي تصديق هذه الأية في أول سورة الجمعة \" وآخرين منهم لما يلحقوا بهم وهو العزيز الحكيم \" وفي سورة الحشر \" والذين جاءوا من بعدهم \" الأية وفي الأنفال \" والذين آمنوا وهاجروا وجاهدوا معكم \" الآية ورواه ابن جرير قال وذكر عن الحسن البصري أنه كان يقرءوها برفع الأنصار عطفا علي والسابقون الأولون فقد أخبر الله العظيم أنه قد رضي عن السابقين الأولين من الهاجرين والأنصار والذين اتبعوهم بإحسان فيا ويل من أبغضهم أو سبهم أو أبغض أو سب بعضهم ولا سيما سيد الصحابة بعد الرسول وخيرهم وأفضلهم أعني الصديق الأكبر والخليفة الأعظم أبا بكر بن أبي قحافة رضي الله عنه فإن الطائفة المخذولة من الرافضة يعادون أفضل الصحابة ويبغضونهم ويسبونهم. عياذا بالله من ذلك وهذا يدل على أن عقولهم معكوسة وقلوبهم منكوسة فأين هؤلاء من الإيمان بالقرآن إذ يسبون من رضي الله عنهم؟ وأما أهل السنة فإنهم يترضون عمن رضي الله عنه فيسبون من سبه الله ورسوله ويوالون من يوالي الله ويعادون من يعادي الله وهم متبعون لا مبتدعون ويقتدون ولا يبتدون ولهذا هم حزب الله المفلحون وعباده المؤمنون."
    },
    {
      "ayah": 101,
      "surah": 9,
      "text": "يخبر تعالى رسوله صلوات الله وسلامه عليه أن في أحياء العرب ممن حول المدينة منافقون وفي أهل المدينة أيضا منافقون \" مردوا على النفاق \" أي مرنوا واستمروا عليه ومنه يقال شيطان مريد ومارد ويقال تمرد فلان على الله أي عتا وتجبر وقوله \" لا تعلمهم نحن نعلمهم \" لا ينافي قوله تعالى \" ولو نشاء لأريناكم فلعرفتم بسيماهم ولتعرفهم في لحن القول \" لأن هدا من باب التوسم فيهم بصفات يعرفون بها لا أنه يعرف جميع من عنده من أهل النفاق والريب على التعيين وقد كان يعلم أن في بعض من يخالطه من أهل المدينة نفاقا وإن كان يراه صباحا ومساء وشاهد هذا بالصحة ما رواه الإمام أحمد في مسنده حيث قال حدثنا محمد بن جعفر حدثنا شعبة عن النعمان بن سالم عن رجل عن جبير بن مطعم رضي الله عنه قال: قلت يا رسول الله صلى الله عليه وسلم إنهم يزعمون أنه ليس لنا أجر بمكة فقال \" لتأتينكم أجوركم ولو كنتم في حجر ثعلب \" وأصغى إلى رسول الله صلى الله عليه وسلم برأسه فقال \" إن في أصحابي منافقين \" ومعناه أنه قد يبوح بعض المنافقين والمرجفين من الكلام بما لا صحة له ومن مثلهم صدر هذا الكلام الذي سمعه جبير بن مطعم وتقدم في تفسير قوله \" وهموا بما لم ينالوا \" أنه صلى الله عليه وسلم أعلم حذيفة بأعيان أربعة عشر أو خمسة عشر منافقا وهذا تخصيص لا يقتضي أنه اطلع على أسمائهم وأعيانهم كلهم والله أعلم وروى الحافظ ابن عساكر في ترجمة أبي عمر البيروتي من طريق هشام بن عمار حدثنا صدقة بن خالد حدثنا بن جابر حدثني شيخ ببيروت يكنى أبا عمر أظنه حدثني عن أبي الدرداء أن رجلا يقال له حرملة أتى النبي صلى الله عليه وآله وسلم فقال: الإيمان ههنا وأشار بيده إلى لسانه. والنفاق ههنا وأشار بيده إلى قلبه ولم يذكر الله إلا قليلا فقال رسول الله صلى الله عليه وسلم صلى الله عليه وسلم \" اللهم اجعل له لسانا ذاكرا وقلبا شاكرا وارزقه حبي وحب من يحبني وصير أمره إلى خير\". فقال يا رسول الله: إنه كان لي أصحاب من المنافقين وكنت رأسا فيهم أفلا آتيك بهم؟ قال \" من أتانا استغفرنا له ومن أصر فالله أولى به ولا تخرقن على أحد سترا \". قال وكذا رواه أبو أحمد الحاكم عن أبي بكر الباغندي عن هشام ابن عمار به وقال عبدالرزاق أخبرنا معمر عن قتادة في هذه الآية أنه قال ما بال أقوام يتكلفون علم الناس فلان في الجنة وفلان في النار فإذا سألت أحدهم عن نفسه قال لا أدري لعمري أنت بنصيبك أعلم منك بأحوال الناس ولقد تكلفت شيئا ما تكلفه الأنبياء قبلك قال في الله نوح عليه السلام \" وما علمي بما كانوا يعملون \" وقال نبي الله شعيب عليه السلام \" بقية الله خير لكم إن كنتم مؤمنين وما أنا عليكم بحفيظ \" وقال الله تعالى لنبيه صلى الله عليه وآله وسلم \" لا تعلمهم نحن نعلمهم \" وقال السدي عن أبي مالك عن ابن عباس في هذه الآية قال: قام رسول الله صلى الله عليه وسلم خطيبا يوم الجمعة فقال \" اخرج يا فلان إنك منافق واخرج يا فلان فإنك منافق \" فأخرج من المسجد ناسا منهم فضحهم فجاء عمر وهم يخرجون من المسجد فاختبأ منهم حياء أنه لم يشهد الجمعة وظن أن الناس قد انصرفوا واختبئوا هم من عمر ظنوا أنه قد علم بأمرهم فجاء عمر فدخل المسجد فإذا الناس لم يصلوا فقال له رجل من المسلمين أبشر يا عمر قد فضح الله المنافقين اليوم; قال ابن عباس فهذا العذاب الأول حين أخرجهم من المسجد والعذاب الثاني عذاب القبر وكذا قال الثوري عن السدي عن أبي مالك نحو هذا وقال مجاهد في قوله \" سنعذبهم مرتين \" \" يعني القتل والسبي وقال في رواية بالجوع وعذاب القبر ثم يردون إلى عذاب عظيم وقال ابن جريج عذاب الدنيا وعذاب القبر ثم يردون إلى عذاب عظيم النار وقال الحسن البصري عذاب في الدنيا وعذاب في القبر وقال عبدالرحمن بن زيد: أما عذاب في الدنيا فالأموال والأولاد وقرأ قوله تعالى \" فلا تعجبك أموالهم ولا أولادهم إنما يريد الله ليعذبهم بها في الحياة الدنيا \" فهذه المصائب لهم عذاب وهي للمؤمنين أجر وعذاب في الآخرة في النار \" ثم يردون إلى عذاب عظيم \" قال النار وقال محمد بن إسحق \" سنعذبهم مرتين \" قال هو فيما بلغني ما هم فيه من أمر الإسلام وما يدخل عليهم من غيظ ذلك على غير حسبة ثم عذابهم في القبور إذا صاروا إليها ثم العذاب العظيم الذي يردون إليه عذاب الآخرة والخلد فيه وقال سعيد عن قتادة في قوله \" سنعذبهم مرتين \" عذاب الدنيا وعذاب القبر \" ثم يردون إلى عذاب عظيم \" وذكر لنا أن نبي الله صلى الله عليه وسلم أسر إلى حذيفة باثني عشر رجلا من المنافقين فقال ستة منهم تكفيهم الدبيلة سراج من نار جهنم يأخذ في كتف أحدهم حتى يفضي إلى صدره وستة يموتون موتا. وذكر لنا أن عمر بن الخطاب رضي الله عنه كان إذا مات رجل ممن يرى أنه منهم نظر إلى حذيفة فإن صلى عليه وإلا تركه; وذكر لنا أن عمر قال لحذيفة أنشدك الله أمنهم أنا؟ قال لا ولا أومن منها أحدا بعدك."
    },
    {
      "ayah": 102,
      "surah": 9,
      "text": "لما بين تعالى حال المنافقين المتخلفين عن الغزاة رغبة عنها وتكذيبا وشكا شرع في بيان حال المذنبين الذين تأخروا عن الجهاد كسلا وميلا إلى الراحة مع إيمانهم وتصديقهم بالحق فقال \" وآخرون اعترفوا بذنوبهم \" أي أقروا بها واعترفوا فيما بينهم وبين ربهم ولهم أعمال أخر صالحة خلطوا هذه بتلك فهؤلاء تحت عفو الله وغفرانه وهذه الآية وإن كانت نزلت في أناس معينين إلا أنها عامة في كل المذنبين الخطائين المخلطين المتلوثين; وقد قال مجاهد إنها نزلت في أبي لبابة لما قال لبني قريظة إنه الذبح وأشار بيه إلى حلقه وقال ابن عباس \" وآخرون \" نزلت في أبي لبابة وجماعة من أصحابه تخلفوا عن رسول الله صلى الله عليه وسلم صلى الله عليه وسلم في غزوة تبوك فقال بعضهم أبو لبابة وخمسة معه وقيل وسبعة معه وقيل وتسعة معه; فلما رجع رسول الله صلى الله عليه وسلم صلى الله عليه وسلم من غزوته ربطوا أنفسهم بسواري المسجد وحلفوا لا يحلهم إلا رسول الله صلى الله عليه وسلم فلما أنزل الله هذه الآية \" وآخرون اعترفوا بذنوبهم \" أطلقهم رسول الله صلى الله عليه وسلم وعفا عنهم وقال البخاري حدثنا مؤمل بن هشام حدثنا إسماعيل بن إبراهيم حدثنا عوف حدثنا أبو رجاء حدثنا سمرة بن جندب قال: قال رسول الله صلى الله عليه وسلم لنا \" أتاني الليلة آتيان فابتعثاني فانتهيا بي إلى مدينة مبنية بلبن ذهب ولبن فضة فتلقانا رجال شطر من خلقهم كأحسن ما أنت راء وشطر كأقبح ما أنت راء قالا لهم اذهبوا فقعوا في ذلك النهر فوقعوا فيه ثم رجعوا إلينا قد ذهب ذلك السوء عنهم فصاروا في أحسن صورة قالا لي هذه جنة عدن وهذا منزلك قالا وأما القوم الذين كانوا شطر منهم حسن وشطر منهم قبيح فإنهم خلطوا عملا صالحا وآخر سيئا تجاوز الله عنهم \". هكذا رواه البخاري مختصرا في تفسير هذه الآية."
    },
    {
      "ayah": 103,
      "surah": 9,
      "text": "أمر تعالى رسوله صلى الله عليه وسلم بأن يأخذ من أموالهم صدقة يطهرهم ويزكهم بها وهذا عام وإن أعاد بعضهم الضمير في أموالهم إلى الذين اعترفوا بذنوبهم وخلطوا عملا صالحا وآخر سيئا ولهذا اعتقد بعض مانعي الزكاة من أحياء العرب أن دفع الزكاة إلى الإمام لا يكون وإنما كان هذا خاصا بالرسول صلى الله عليه وسلم ولهذا احتجوا بقوله تعالى \" خذ من أموالهم صدقة \" الآية وقد رد عليهم هذا التأويل والفهم الفاسد أبو بكر الصديق وسائر الصحابة وقاتلوهم حتى أدوا الزكاة إلى الخليفة كما كانوا يؤدونها إلى رسول الله صلى الله عليه وسلم حتى قال الصديق: والله لو منعوني عناقا - وفي رواية عقالا- كانوا يؤدونه إلى رسول الله صلى الله عليه وسلم صلى الله عليه وسلم لأقاتلنهم على منعه; وقوله \" وصل عليهم \" أي ادع لهم واستغفر لهم كما رواه مسلم في صحيحه عن عبدالله بن أبي أوفى قال: كان النبي صلى الله عليه وسلم إذا أتي بصدقة قوم صلى عليهم فأتاه أبي بصدقته فقال \" اللهم صل على آل أبي أوفى \". وفي الحديث الآخر أن امرأة قالت يا رسول الله صلى الله عليه وسلم صل علي وعلى زوجي فقال \" صلى الله عليك وعلى زوجك \" وقوله \" إن صلاتك سكن لهم \" قرأ بعضهم صلواتك على الجمع وآخرون قرءوا إن صلاتك على الإفراد \" سكن لهم \" قال ابن عباس رحمة لهم وقال قتادة وقار وقوله \" والله سميع \" أي لدعائك \" عليم \" أي بمن يستحق ذلك منك ومن هو أهل له قال الإمام أحمد حدثنا وكيع حدثنا أبو العميس عن أبي بكر بن عمرو بن عتبة عن ابن لحذيفة عن أبيه أن النبي صلى الله عليه وسلم كان إذا دعا لرجل أصابته وأصابت ولده وولد ولده ثم رواه عن أبي نعيم عن مسعر عن أبي بكر بن عمرو بن عتبة عن ابن لحذيفة قال مسعر وقد ذكره مرة عن حذيفة إن صلاة النبي صلى الله عليه وسلم لتدرك الرجل وولده وولد ولده."
    },
    {
      "ayah": 104,
      "surah": 9,
      "text": "وقوله \" ألم يعلموا أن الله هو يقبل التوبة عن عباده ويأخذ الصدقات \" هذا تهييج إلى التوبة والصدقة اللتين كل منهما يحط الذنوب ويمحصها ويمحقها وأخبر تعالى أن كل من تاب إليه تاب عليه ومن تصدق بصدقة من كسب حلال فإن الله تعالى يتقبلها بيمينه فيربيها لصابحها حتى تصير التمرة مثل أحد كما جاء بذلك الحديث عن رسول الله صلى الله عليه وسلم صلى الله عليه وسلم كما قال الثوري ووكيع كلاهما عن عباد بن منصور عن القاسم بن محمد أنه سمع أبا هريرة يقول: قال رسول الله صلى الله عليه وسلم صلى الله عليه وسلم \" إن الله يقبل الصدقة ويأخذها بيمينه فيربيها لأحدكم كما يربي أحدكم مهره حتى إن اللقمة لتكون مثل أحد \" وتصديق ذلك في كتاب الله عز وجل \" ألم يعلموا أن الله هو يقبل التوبة عن عباده ويأخذ الصدقات \" وقوله \" يمحق الله الربا ويربي الصدقات \" وقال الثوري والأعمش كلاهما عن عبدالله بن السائب عن عبدالله بن أبي قتادة قال: قال عبدالله بن مسعود رضي الله عنه إن الصدقة تقع في يد الله عز وجل قبل أن تقع في يد السائل ثم قرأ هذه الآية \" ألم يعلموا أن الله هو يقبل التوبة عن عباده ويأخذ الصدقات \". وقد روى ابن عساكر في تاريخه في ترجمة عبدالله بن الشاعر السكسكي الدمشقي وأصله حمصي وكان أحد الفقهاء روى عن معاوية وغيره وحكى عنه حوشب بن سيف السكسكي الحمصي قال غزا الناس في زمان معاوية رضي الله عنه وعليهم عبدالرحمن بن خالد بن الوليد فغل رجل من المسلمين مائة دينار رومية. فلما قفل الجيش ندم وأتى الأمير فأبى أن يقبلها منه وقال: قد تفرق الناس ولن أقبلها منك حتى تأتي الله بها يوم القيامة فجعل الرجل يأتي الصحابة فيقولون له مثل ذلك فلما قدم دمشق ذهب إلى معاوية ليقبلها منه فأبى عليه فخرج من عنده وهو يبكي ويسترجع فمر بعبدالله ابن الشاعر السكسكي فقال له ما يبكيك؟ فذكر له أمره فقال له أو مطيعي أنت؟ فقال نعم فقال اذهب إلى معاوية فقل له اقبل مني خمسك فادفع إليه عشرين دينارا وانظر إلى الثمانين الباقية فتصدق بها عن ذلك الجيش فإن الله يقبل التوبة عن عباده وهو أعلم بأسمائهم ومكانهم ففعل الرجل فقال معاوية رضي الله عنه لأن أكون أفتيته بها أحب إلي من كل شيء أملكه أحسن الرجل."
    },
    {
      "ayah": 105,
      "surah": 9,
      "text": "قال مجاهد: هذا وعيد يعني من الله تعالى للمخالفين أوامره بأن أعمالهم ستعرض عليه تبارك وتعالى وعلى الرسول صلى الله عليه وسلم وعلى المؤمنين وهذا كائن لا محالة يوم القيامة كما قال \" يومئذ تعرضون لا تخفى منكم خافية \" وقال تعالى \" يوم تبلى السرائر \" وقال \" وحصل ما في الصدور \" وقد يظهر الله تعالى ذلك للناس في الدنيا كما قال الإمام أحمد; حدثنا حسن بن موسى حدثنا ابن لهيعة حدثنا دراج عن أبي الهيثم عن أبي سعيد مرفوعا عن رسول الله صلى الله عليه وآله وسلم أنه قال \" لو أن أحدكم يعمل في صخرة صماء ليس لها باب ولا كوة لأخرج الله عمله للناس كائنا ما كان \" وقد ورد: أن أعمال الأحياء تعرض على الأموات من الأقرباء والعشائر في البرزخ كما قال أبو داود الطيالسي: حدثنا الصلت بن دينار عن الحسن عن جابر بن عبدالله قال: قال رسول الله صلى الله عليه وآله وسلم \" إن أعمالكم تعرض على أقربائكم وعشائركم في قبورهم فإن كان خيرا استبشروا به وإن كان غير ذلك قالوا: اللهم ألهمهم أن يعملوا بطاعتك \" وقال الإمام أحمد أنبانا عبدالرزاق عن سفيان عمن سمع أنسا يقول: فال النبي صلى الله عليه وسلم \" إن أعمالكم تعرض على أقاربكم وعشائركم من الأموات فإن كان خيرا استبشروا به وأن كان غير ذلك قالوا \" اللهم لا تمتهم حتى تهديهم كما هديتنا \" وقال البخاري: قالت عائشة رضي الله عنها \" إذا أعجبك حسن عمل امرئ مسلم فقل \" اعملوا فسيرى الله عملكم ورسوله والمؤمنون \" وقد ورد في الحديث شيبة بهذا قال الإمام أحمد: حدثنا يزيد حدثنا حميد عن أنس أن رسول الله صلى الله عليه وسلم صلى الله عليه وآله وسلم قال \" لا عليكم أن تعجبوا بأحد حتى تنظروا بم يختم له فإن العامل يعمل زمانا من عمره أو برهة من دهره بعمل صالح لو مات عليه دخل الجنة ثم يتحول فيعمل عملا سيئا وإن العبد ليعمل البرهة من دهره بعمل سيء لو مات عليه دخل النار ثم يتحول فيعمل عملا صالحا وإذا أراد الله بعبده خيرا استعمله قبل موته \" قالوا يا رسول الله وكيف يستعمله؟ قال \" يوفقه لعمل صالح ثم يقبضه عليه \" تفرد به الإمام أحمد من هذا الوجه."
    },
    {
      "ayah": 106,
      "surah": 9,
      "text": "قال ابن عباس ومجاهد وعكرمة والضحاك وغير واحد: هم الثلاثة الذين خلفوا أي عن التوبة وهم مرارة بن الربيع وكعب بن مالك وهلال بن أمية قعدوا عن غزوة تبوك في جملة من قعد كسلا وميلا إلى الدعة والحفظ وطيب الثمار والظلال لا شكا ونفاقا فكانت منهم طائفة ربطوا أنفسهم بالسواري كما فعل أبو لبابة وأصحابه وطائفة لم يفعلوا ذلك وهم هؤلاء الثلاثة المذكورون فنزلت توبة أولئك قبل هؤلاء وأرجى هؤلاء عن التوبة حتى نزلت الآية الآتية وهي قوله \" لقد تاب الله على النبي والمهاجرين والأنصار \" الآية \" وعلى الثلاثة الذين خلفوا حتى إذا ضاقت عليهم الأرض بما رحبت \" الآية كما سيأتي في حديث كعب بن مالك وقوله \" إما يعذبهم وإما يتوب عليهم \" أي هم تحت عفو الله إن شاء فعل بهم هذا وإن شاء فعل بهم ذاك ولكن رحمته تغلب غضبه \" والله عليم حكيم \" أي عليم بمن يستحق العفو \" ممن يستحق العفو حكيم في أفعاله وأقواله لا إله إلا هو ولا رب سواه."
    },
    {
      "ayah": 107,
      "surah": 9,
      "text": "سبب نزول هذه الآيات الكريمات أنه كان بالمدينة قبل مقدم رسول الله صلى الله عليه وسلم صلى الله عليه وسلم إليها رجل من الخزرج يقال له أبو عامر الراهب وكان قد تنصر في الجاهلية وقرأ علم أهل الكتاب وكان فيه عبادة في الجاهلية وله شرف في الخزرج كبير فلما قدم رسول الله صلى الله عليه وسلم مهاجرا إلى المدينة واجتمع المسلمون عليه وصارت للإسلام كلمة عالية وأظهرهم الله يوم بدر شرق اللعين أبو عامر بريقه وبارز بالعداوة وظاهر بها وخرج فارا إلى كفار مكة من مشركي قريش يمالئهم على حرب رسول الله صلى الله عليه وسلم فاجتمعوا بمن وافقهم من أحياء العرب وقدموا عام أحد فكان من أمر المسلمين ما كان وامتحنهم الله عز وجل وكانت العاقبة للمتقين وكان هذا الفاسق قد حفر حفائر فيما بين الصفين فوقع في إحداهن رسول الله صلى الله عليه وسلم صلى الله عليه وسلم وأصيب ذلك اليوم فجرح وجهه وكسرت رباعيته اليمنى السفلى وشج رأسه صلوات الله وسلامه عليه وتقدم أبو عامر في أول المبارزة إلى قومه من الأنصار فخاطبهم واستمالهم إلى نصره وموافقته فلما عرفوا كلامه قالوا: لا أنعم الله بك عينا يا فاسق يا عدو الله ونالوا منه وسبوه فرجع وهو يقول: والله لقد أصاب قومي بعدي شر; وكان رسول الله صلى الله عليه وسلم قد دعاه إلى الله قبل فراره وقرأ عليه من القرآن فأبى أن يسلم وتمرد; فدعا عليه رسول الله صلى الله عليه وسلم صلى الله عليه وسلم أن يموت بعيدا طريدا فنالته هذه الدعوة; وذلك أنه لما فرغ الناس من أحد ورأى أمر الرسول صلى الله عليه وسلم في ارتفاع وظهور ذهب إلى هرقل ملك الروم يستنصره على النبي صلى الله عليه وسلم فوعده ومناه وأقام عنده وكتب إلى جماعة من قومه من الأنصار من أهل النفاق والريب يعدهم ويمنيهم أنه سيقدم بجيش يقاتل به رسول الله صلى الله عليه وسلم ويغلبه ويرده عما هو فيه; وأمرهم أن يتخذوا له معقلا يقدم عليهم فيه من يقدم من عنده لأداء كتبه ويكون مرصدا له إذا قدم عليهم بعد ذلك; فشرعوا في بناء مسجد مجاور لمسجد قباء فبنوه وأحكموه وفرغوا منه قبل خروج رسول الله صلى الله عليه وسلم إلى تبوك وجاءوا فسألوا رسول الله صلى الله عليه وسلم صلى الله عليه وسلم أن يأتي إليهم فيصلي في مسجدهم ليحتجوا بصلاته فيه على تقريره وإثباته وذكروا أنهم إنما بنوه للضعفاء منهم وأهل العلة في الليلة الشاتية فعصمه الله من الصلاة فيه فقال \" إنا على سفر ولكن إذا رجعنا إن شاء الله \" فلما قفل عليه السلام راجعا إلى المدينة من تبوك ولم يبق بينه وبينها إلا يوم أو بعض اليوم نزل عليه جبريل بخبر مسجد الضرار وما اعتمده بانوه من الكفر والتفريق بين جماعة المؤمنين في مسجدهم مسجد قباء الذي أسس في أول يوم على التقوى. فبعث رسول الله صلى الله عليه وسلم صلى الله عليه وسلم إلى ذلك المسجد من هدمه قبل مقدمه المدينة كما قال علي بن أبي طلحة عن ابن عباس في الآية هم أناس من الأنصار بنوا مسجدا فقال لهم أبو عامر ابنوا مسجدا واستعدوا بما استطعتم من قوة ومن سلاح فإني ذاهب إلى قيصر ملك الروم فأتي بجند من الروم وأخرج محمدا وأصحابه فلما فرغوا من مسجدهم أتوا النبي صلى الله عليه وسلم فقالوا له قد فرغنا من بناء مسجدنا فنحب أن تصلي فيه وتدعو لنا بالبركة فأنزل الله عز وجل \" لا تقم فيه أبدا \" إلى قوله \" الظالمين \" وكذا روي عن سعيد بن جبير ومجاهد وعروة بن الزبير وقتادة وغير واحد من العلماء وقال محمد بن إسحاق بن يسار عن الزهري ويزيد بن رومان وعبدالله بن أبي بكر وعاصم بن عمرو بن قتادة وغيرهم قالوا: أقبل رسول الله صلى الله عليه وسلم يعني من تبوك حتى نزل بذي أوان بلد بينه وبين المدينة ساعة من نهار وكان أصحاب مسجد الضرار قد كانوا أتوه وهو يتجهز إلى تبوك فقالوا يا رسول الله إنا قد بنينا مسجدا لذي العلة والحاجة والليلة المطيرة والليلة الشاتية وإنا نحب أن تأتينا فتصلي لنا فيه فقال \" إني على جناح سفر وحال شغل \" أو كما قال رسول الله صلى الله عليه \" ولو قد قدمنا إن شاء الله تعالى أتيناكم فصلينا لكم فيه \" فلما نزل بذي أوان أتاه خبر المسجد فدعا رسول الله صلى الله عليه مالك بن الدخشم أخا بني سالم بن عوف ومعن بن عدي أو أخاه عامر بن عدي أخا بني عجلان فقال \" انطلقا إلى هذا المسجد الظالم أهله فاهدماه وحرقاه \" فخرجا سريعين حتى أتيا بني سالم بن عوف وهم رهط مالك بن الدخشم. فقال مالك لمعن انظرني حتى أخرج إليك بنار من أهلي فدخل أهله فأخذ سعفا من النخل فأشعل فيه نارا ثم خرجا يشتدان حتى دخلا المسجد وفيه أهله فحرقاه وهدماه وتفرقوا عنه ونزل فيهم من القرآن ما نزل \" والذين اتخذوا مسجدا ضرارا وكفرا \" إلى آخر القصة وكان الذين بنوه اثني عشر رجلا: خذام بن خالد من بني عبد بن زيد أحد بني عمرو بن عوف ومن داره أخرج مسجد الشقاق وثعلبة بن حاطب من بني عبيد وموالي بني أمية بن زيد ومعتب بن قشير من بني ضيعة بن زيد وأبو حبيبة بن الأزعر من بني ضبيعة بن زيد وعباد بن حنيف أخو سهل بن حنيف من بني عمرو بن عوف وحارثة بن عامر وابناه مجمع بن حارثة وزيد بن حارثة ونبتل الحارث وهم من بني ضبيعة ومخرح وهم من بني ضبيعة وبجاد بن عمران وهو من بني ضبيعة ووديعة بن ثابت وموالي بني أمية رهط أبي لبابة بن عبد المنذر. وقوله \" وليحلفن \" أي الذين بنوه \" إن أردنا إلا الحسنى \" أي ما أردنا ببنيانه إلا خيرا ورفقا بالناس قال الله تعالى \" والله يشهد إنهم لكاذبون \" أي فيما قصدوا وفيما نووا وإنما بنوه ضرارا لمسجد قباء وكفرا بالله وتفريقا بين المؤمنين وإرصادا لمن حارب الله ورسوله من قبل وهو أبو عامر الفاسق الذي يقال له الراهب لعنه الله."
    },
    {
      "ayah": 108,
      "surah": 9,
      "text": "وقوله \" لا تقم فيه أبدا \" نهي له صلى الله عليه وآله وسلم والأمة تبع له في ذلك عن أن يقوم فيه أي يصلي أبدا. ثم حثه على الصلاة بمسجد قباء الذي أسس من أول يوم بنائه على التقوى وهي طاعة الله وطاعة رسوله وجمعا لكلمة المؤمنين ومعقلا وموئلا للإسلام وأهله ولهذا قال تعالى \" لمسجد أسس على التقوى من أول يوم أحق أن تقوم فيه \" والسياق إنما هو في معرض مسجد قباء ولهذا جاء في الحديث الصحيح أن رسول الله صلى الله عليه وآله وسلم قال \" صلاة في مسجد قباء كعمرة \" وفي الصحيح أن رسول الله صلى الله عليه وآله وسلم كان يزور مسجد قباء راكبا وماشيا وفي الحديث أن رسول الله صلى الله عليه وسلم لما بناه وأسسه أول قدومه ونزوله على بني عمرو بن عوف كان جبريل هو الذي عين له جهة القبلة فالله أعلم. وقال أبو داود: حدثنا محمد بن العلاء حدثنا معاوية بن هشام عن يونس بن الحارث عن إبراهيم بن أبي ميمونة عن أبي صالح عن أبي هريرة رضي الله عنه عن النبي صلى الله عليه وآله وسلم قال \" نزلت هذه الآية في أهل قباء \" فيه رجال يحبون أن يتطهروا \" قال كانوا يستنجون بالماء فنزلت فيهم هذه الآية. رواه الترمذي وابن ماجه من حديث يونس بن الحارث وهو ضعيف وقال الترمذي غريب من هذا الوجه وقال الطبراني: حدثنا الحسن بن علي العمري حدثنا محمد بن حميد الرازي حدثنا سلمة بن الفضل عن محمد بن إسحاق عن الأعمش عن مجاهد عن ابن عباس قال: لما نزلت هذه الآية \" فيه رجال يحبون أن يتطهروا \" بعث رسول الله صلى الله عليه وسلم إلى عويمر بن ساعدة فقال \" ما هذا الطهور الذي أثنى الله عليكم \"؟ فقال يا رسول الله ما خرج منا رجل ولا امرأة من الغائط إلا وغسل فرجه أو قال مقعدته فقال النبي صلى الله عليه وسلم \" هو هذا \" وقال الإمام أحمد: حدثنا حسن بن محمد حدثنا أبو أويس حدثنا شرحبيل عن عويم بن ساعدة الأنصاري أنه حدثه أن النبي صلى الله عليه وسلم أتاهم في مسجد قباء فقال \" إن الله تعالى قد أحسن عليكم الثناء في الطهور في قصة مسجدكم فما هذا الطهور الذي تطهرون به؟ \" فقالوا والله يا رسول الله ما نعلم شيئا إلا أنه كان لنا جيران من اليهود فكانوا يغسلون أدبارهم من الغائط فغسلنا كما غسلوا ورواه ابن خزيمة في صحيحه وقال هشيم عن عبد الحميد المدني عن إبراهيم بن المعلي الأنصاري أن رسول الله صلى الله عليه قال لعويم بن ساعدة \" ما هذا الذي أثنى الله عليكم: \" فيه رجال يحبون أن يتطهروا \"؟ \" الآية قالوا يا رسول الله إنا نغسل الأدبار بالماء وقال ابن جرير: حدثني محمد بن عمارة الأسدي حدثنا محمد بن سعد عن إبراهيم بن محمد عن شرحبيل بن سعد قال: سمعت خزيمة بن ثابت يقول: نزلت هذه الآية \" فيه رجال يحبون أن يتطهروا والله يحب المطهرين \" قال كانوا يغسلون أدبارهم من الغائط. \" حديث آخر \"قال الإمام أحمد بن حنبل: حدثنا يحيى بن آدم حدثنا مالك يعني ابن مغول سمعت سيارا أبا الحكم عن شهر بن حوشب عن محمد بن عبدالله بن سلام قال: لقد قدم رسول الله صلى الله عليه وآله وسلم يعني قباء فقال \" إن الله عز وجل قد أثنى عليكم في الطهور خيرا أفلا تخبروني؟ \" يعني قوله \" فيه رجال يحبون أن يتطهروا \" فقالوا يا رسول الله إنا نجده مكتوبا علينا في التوراة الاستنجاء بالماء. وقد صرح جماعة من السلف بأنه مسجد قباء رواه علي بن أبي طلحة عن ابن عباس ورواه عبدالرزاق عن معمر عن الزهري عن عروة بن الزبير وقاله عطية العوفي وعبدالرحمن بن زيد بن أسلم والشعبي والحسن البصري ونقله البغوي عن سعيد بن جبير وقتادة وقد ورد في الحديث الصحيح أن مسجد رسول الله الذي في جوف المدينة هو المسجد الذي أسس على التقوى وهذا صحيح. ولا منافاة بين الآية وبين هذا لأنه إذا كان مسجد قباء قد أسس على التقوى من أول يوم فمسجد رسول الله صلى الله عليه وسلم بطريق الأولى والأحرى ولهذا قال الإمام أحمد بن حنبل في مسنده: حدثنا أبو نعيم حدثنا عبدالله بن عامر الأسلمي عن عمران بن أبي أنس عن سهل بن سعد عن أبي بن كعب أن النبي صلى الله عليه وسلم قال \" المسجد الذي أسس على التقوى مسجدي هذا \" تفرد به أحمد. \" حديث آخر \"قال الإمام أحمد: حدثنا وكيع حدثنا ربيعة بن عثمان التيمي عن عمران بن أبي أنس عن سهل بن سعد الساعدي قال: اختلف رجلان على عهد رسول الله صلى الله عليه وسلم في المسجد الذي أسس على التقوى فقال أحدهما هو مسجد رسول الله صلى الله عليه وسلم وقال الآخر هو مسجد قباء فأتيا النبي صلى الله عليه وسلم فسألاه فقال \" هو مسجدي هذا \" تفرد به أحمد أيضا. \" حديث آخر \"قال الإمام أحمد: حدثنا موسى بن داود حدثنا ليث عن عمران بن أبي أنس عن سعيد بن أبي سعيد الخدري قال: تمارى رجلان في المسجد الذي أسس على التقوى من أول يوم فقال أحدهما هو مسجد فباء وقال الآخر هو مسجد رسول الله صلى الله عليه وسلم فقال رسول الله صلى الله عليه وسلم صلى الله عليه وسلم \" هو مسجدي هذا \" تفرد به أحمد. \" طريق أخرى \"قال الإمام أحمد: حدثنا إسحاق بن عيسى حدثنا ليث حدثني عمران بن أبي أنس عن ابن أبي سعيد عن أبيه أنه قال: تمارى رجلان في المسجد الذي أسس على التقوى من أول يوم فقال أحدهما هو مسجد قباء وقال الآخر هو مسجد رسول الله صلى الله عليه وسلم قال رسول الله صلى الله عليه وسلم \" هو مسجدي \" وكذا رواه الترمذي والنسائي عن قتيبة عن الليث وصححه الترمذي ورواه مسلم كما سيأتي. \" طريق أخرى \"قال الإمام أحمد: حدثنا يحيى عن أنيس بن أبي يحيى حدثني أبي قال سمعت أبا سعيد الخدري قال: اختلف رجلان رجل من بني خدرة ورجل من بني عمرو بن عوف في المسجد الذي أسس على التقوى فقال الخدري هو مسجد رسول الله صلى الله عليه وسلم وقال العمري هو مسجد قباء فأتيا رسول الله صلى الله عليه وسلم فسألاه عن ذلك فقال \" هو هذا المسجد \" لمسجد رسول الله صلى الله عليه وسلم وقال في ذلك يعني مسجد قباء. \" طريق أخرى \"قال الإمام أحمد: حدثنا يحيى عن أنيس قال أبو جعفر بن جرير: حدثنا ابن بشار حدثنا يحيى بن سعيد حدثنا حميد الخراط المدني سألت أبا سلمة بن عبدالرحمن بن أبي سعيد فقلت كيف سمعت أباك يقول في المسجد الذي أسس على التقوى؟ فقال إني أتيت رسول الله صلى الله عليه وسلم فدخلت عليه في بيت لبعض نسائه فقلت: يا رسول الله أين المسجد الذي أسس على التقوى؟ قال فأخذ كفا من حصباء فضرب به الأرض ثم قال \" هو مسجدكم هذا \" ثم قال سمعت أباك يذكره رواه مسلم منفردا به عن محمد بن حاتم عن يحيى بن سعيد به ورواه عن أبي بكر بن أبي شيبة وغيره عن حاتم بن إسماعيل عن حميد الخراط به وقد قال بأنه مسجد النبي صلى الله عليه وسلم جماعة من السلف والخلف وهو مروي عن عمر بن الخطاب وابنه عبدالله وزيد بن ثابت وسعيد بن المسيب واختاره ابن جرير وقوله \" لمسجد أسس على التقوى من أول يوم أحق أن تقوم فيه فيه رجال يحبون أن يتطهروا والله يحب المطهرين \" دليل على استحباب الصلاة في المساجد القديمة المؤسسة من أول بنائها على عبادة الله وحده لا شريك له وعلى استحباب الصلاة مع الجماعة الصالحين والعباد العاملين المحافظين على إسباغ الوضوء والتنزه عن ملابسة القاذورات. وقد قال الإمام أحمد: حدثنا محمد بن جعفر عن شعبة عن عبد الملك بن عمير سمعت شبيبا أبا روح يحدث عن رجل من أصحاب رسول الله صلى الله عليه وسلم أن رسول الله صلى الله عليه وسلم صلى بهم الصبح فقرأ الروم فيها فأوهم فلما انصرف قال \" إنه يلبس علينا القرآن إن أقواما منكم يصلون معنا لا يحسنون الوضوء فمن شهد الصلاة معنا فليحسن الوضوء \" ثم رواه من طريقين آخرين عن عبد الملك بن عمير عن شبيب أبي روح من ذي الكلاع أنه صلى مع النبي صلى الله عليه وسلم فذكره فدل هذا على أن إكمال الطهارة يسهل القيام في العباد ويعين على إتمامها وإكمالها والقيام بمشروعاتها وقال أبو العالية في قوله تعالى \" والله يحب المطهرين \" إن الطهور بالماء لحسن ولكنهم المطهرون من الذنوب وقال الأعمش التوبة من الذنوب والتطهر من الشرك وقد ورد في الحديث المروي من طرق في السنن وغيرها أن رسول الله صلى الله عليه وسلم قال لأهل قباء \" قد أثنى الله عليكم في الطهور فماذا تصنعون؟ \" فقالوا نستنجي بالماء وقد قال الحافظ أبو بكر البزار حدثنا عبدالله بن شبيب حدثنا أحمد بن محمد بن عبد العزيز قال: وجدته في كتاب أبي عن الزهري عن عبيد الله بن عبدالله عن ابن عباس قال: نزلت هذه الآية في أهل قباء \" فيه رجال يحبون أن يتطهروا والله يحب المطهرين \" فسألهم رسول الله صلى الله عليه وسلم فقالوا إنا نتبع الحجارة بالماء. رواه البزار ثم قال تفرد به محمد بن عبد العزيز عن الزهري ولم يرو عنه سوى ابنه \" قلت \"وإنما ذكرته بهذا اللفظ لأنه مشهور بين الفقهاء ولم يعرفه كثير من المحدثين المتأخرين أوكلهم والله أعلم."
    },
    {
      "ayah": 109,
      "surah": 9,
      "text": "يقول تعالى لا يستوي من أسس بنيانه على تقوى من الله ورضوان ومن بني مسجدا ضرارا وكفرا وتفريقا بين المؤمنين وإرصادا لمن حارب الله ورسوله من قبل فإنما يبني هؤلاء بنيانهم على شفا جرف هار أي طرف حفيرة مثالة \" في نار جهنم والله لا يهدي القوم الظالمين \" أي لا يصلح عمل المفسدين قال جابر بن عبدالله رأيت المسجد الذي بنى ضرارا يخرج منه الدخان على عهد رسول الله صلى الله عليه وسلم وقال ابن جريج ذكر لنا أن رجالا حقروا فوجدوا الدخان الذي يخرج منه وكذا قال قتادة وقال خلف بن ياسين الكوفي رأيت مسجد المنافقين الذي ذكره الله تعالى في القرآن وفيه جحر يخرج منه الدخان وهو اليوم مزبلة رواه ابن جرير رحمه الله."
    },
    {
      "ayah": 11,
      "surah": 9,
      "text": "وكذا الآية التي بعدها \" فإن تابوا وأقاموا الصلاة \" إلى آخرها تقدمت وقال الحافظ أبو بكر البزار: حدثنا محمد بن المثنى حدثنا يحيى بن أبي بكر حدثنا أبو جعفر الرازي حدثنا الربيع بن أنس قال: سمعت أنس بن مالك يقول قال رسول الله صلى الله عليه وسلم من فارق الدنيا على الإخلاص لله وعبادته لا يشرك به وأقام الصلاة وآتى الزكاة فارقها والله عنه راض \"وهو دين الله الذي جاءت به الرسل وبلغوه عن ربهم قبل هرج الأحاديث واختلاف الأهواء وتصديق ذلك في كتاب الله \" فإن تابوا \" يقول فإن جعلوا الأوثان وعبادتها \" وأقاموا الصلاة وآتوا الزكاة فخلوا سبيلهم \" وقال في آية أخرى \" فإن تابوا وأقاموا الصلاة وآتوا الزكاة فإخوانكم في الدين \" ثم قال البزار: آخر الحديث عندي والله أعلم فارقها وهو عنه راض وباقيه عندي من كلام الربيع بن أنس."
    },
    {
      "ayah": 110,
      "surah": 9,
      "text": "وقوله تعالى \" لا يزال بنيانهم الذي بنوا ريبة في قلوبهم \" أي شكا ونفاقا بسبب إقدامهم على هذا الصنيع الشنيع أورثهم نفاقا في قلوبهم كما أشرب عابدو العجل حبه وقوله \" إلا أن تقطع قلوبهم \" أي بموتهم. قال ابن عباس ومجاهد وقتادة وزيد بن أسلم والسدي وحبيب بن أبي ثابت والضحاك وعبدالرحمن بن زيد بن أسلم وغير واحد من علماء السلف \" والله عليم \" أي بأعمال خلقه \" حكيم \" في مجازتهم عنها من خير وشر."
    },
    {
      "ayah": 111,
      "surah": 9,
      "text": "يخبر تعالى أنه عاوض من عباده المؤمنين عن أنفسهم وأموالهم إذ بذلوها في سبيله بالجنة وهذا من فضله وكرمه وإحسانه فإنه قبل العوض عما يملكه بما تفضل به على عبيده المطيعين له. ولهذا قال الحسن البصري وقتادة: بايعهم والله فأغلى ثمنهم. وقال شمر بن عطية ما من مسلم إلا وللّه عز وجل في عنقه بيعة وفي بها أو مات عليها ثم تلا هذه الآية. ولهذا يقال من حمل في سبيل الله بايع الله أي قبل هذا العقد ووفى به. وقال محمد بن كعب القرظي وغيره قال عبدالله بن رواحة رضي الله عنه لرسول الله صلى الله عليه وسلم يعني ليلة العقبة اشترط لربك ولنفسك ما شئت فقال \" أشترط لربي أن تعبدوه ولا تشركوا به شيئا وأشترط لنفسي أن تمنعوني مما تمنعون منه أنفسكم وأموالكم \" قالوا: فما لنا إذا فعلنا ذلك؟ قال \" الجنة \" قالوا ربح البيع لا نقيل ولا نستقيل فنزلت \" إن الله اشترى من المؤمنين أنفسهم \" الآية وقوله \" يقاتلون في سبيل الله فيقتلون ويقتلون \" أي سواء قتلوا أو قتلوا أو اجتمع لهم هذا وهذا فقد وجبت لهم الجنة. ولهذا جاء في الصحيحين \" وتكفل الله لمن خرج في سبيله لا يخرجه إلا جهاد في سبيلي وتصديق برسلي بأن توفاه أن يدخله الجنة أو يرجعه إلى منزله الذي خرج منه نائلا ما نال من أجر أو غنيمة \" وقوله \" وعدا عليه حقا في التوراة والإنجيل والقرآن \" تأكيد لهذا الوعد وإخبار بأنه قد كتبه على نفسه الكريمة وأنزله على رسله في كتبه الكبار وهي التوراة المنزلة على موسى والإنجيل المنزل على عيسى والقرآن المنزل على محمد صلوات الله وسلامه عليهم أجمعين. وقوله \" ومن أوفى بعده من الله \" فإنه لا يخلف الميعاد. هذا كقوله \" ومن أصدق من الله حديثا \" ومن أصدق من الله قليلا \" ولهذا قال \" فاستبشروا ببيعكم الذي بايعتم به وذلك هو الفوز العظيم \" أي فليستبشر من قام بمقتضى هذا العقد ووفى بهذا العهد بالفوز العظيم والنعيم المقيم."
    },
    {
      "ayah": 112,
      "surah": 9,
      "text": "هذا نعت المؤمنين الذين اشترى الله منهم أنفسهم وأموالهم بهذه الصفات الجميلة والخلال الجليلة \" التائبون \" من الذنوب كلها التاركون للفواحش \" العابدون \" أي القائمون بعبادة ربهم محافظين عليها وهي الأقوال والأفعال. فمن أخص الأقوال الحمد فلهذا قال \" الحامدون \" ومن أفضل الأعمال الصيام وهو ترك الملاذ من الطعام والشراب والجماع وهو المراد بالسياحة ههنا ولهذا قال \" السائحون \" كما وصف أزواج النبي صلى الله عليه وسلم بذلك في قوله تعالى \" سائحات \" أي صائمات وكذا الركوع والسجود وهما عبارة عن الصلاة ولهذا قال \" الراكعون الساجدون \" وهم مع ذلك ينفعون خلق الله ويرشدونهم إلى طاعة الله بأمرهم بالمعروف ونهيهم عن المنكر مع العلم بما ينبغي فعله ويجب تركه وهو حفظ حدود الله في تحليله وتحريمه علما وعملا فقاموا بعبادة الحق ونصح الخلق ولهذا قال \" وبشر المؤمنين \" لأن الإيمان يشمل هذا كله والسعادة كل السعادة لمن اتصف به. \" بيان أن المراد بالسياحة الصيام \"قال سفيان الثوري عن عاصم عن ذر عن عبدالله بن مسعود قال \" السائحون \" الصائمون وكذا روي عن سعيد بن جبير والعوفي عن ابن عباس وقال علي بن أبي طلحة عن ابن عباس كل ما ذكر الله في القرآن السياحة هم الصائمون وكذا قال الضحاك رحمه الله وقال ابن جرير: حدثنا أحمد بن إسحاق حدثنا أبو أحمد حدثنا إبراهيم بن يزيد عن الوليد بن عبدالله عن عائشة رضي الله عنهما قالت: سياحة هذه الأمة الصيام وهكذا قال مجاهد وسعيد بن جبير وعطاء وعبدالرحمن السلمي والضحاك بن مزاحم وسفيان بن عينة وغيرهم أن المراد بالسائحين الصائمون وقال الحسن البصري \" السائحون \" الصائمون شهر رمضان وفال أبو عمرو العبدي \" السائحون \" الذين يديمون الصيام من المؤمنين وقد ورد في حديث مرفوع نحو هذا وقال ابن جرير: حدثني محمد بن عبدالله بن بزيع حدثنا حكيم بن حزام حدثنا سليمان عن أبي صالح عن أبي هريرة قال: قال رسول الله صلى الله عليه وسلم \" السائحون هم الصائمون \" وهذا الموقوف أصح وقال أيضا: حدثني يونس عن ابن وهب عن عمر بن الحارث عن عمرو بن دينار عن عبيد بن عمير قال: سئل النبي صلى الله عليه وسلم عن السائحين فقال \" هم الصائمون \" وهذا مرسل جيد وهذا أصح الأقوال وأشهرها; وجاء ما يدل على أن السياحة الجهاد وهو ما روى أبو داود في سننه من حديث أبي أمامة أن رجلا قال: يا رسول الله ائذن لي في السياحة فقال النبي صلى الله عليه وسلم \" سياحة أمتي الجهاد في سبيل الله \" وقال ابن المبارك عن ابن لهيعة. أخبرني عمارة بن غزية إن السياحة ذكرت عند رسول الله صلى الله عليه وسلم فقال رسول الله صلى الله عليه وسلم \" أبدلنا الله بذلك الجهاد في سبيل الله والتكبير على كل شرف \" وعن عكرمة أنه قال: ثم طلبة العلم وقال عبدالرحمن بن زيد بن أسلم: هم المهاجرون. رواهما ابن أبي حاتم وليس المراد من السياحة ما قد يفهمه بعض من يتعبد بمجرد السياحة في الأرض والتفرد في شواهق الجبال والكهوف والبراري فإن هذا ليس بمشروع إلا في أيام الفتن والزلازل في الدين كما ثبت في صحيح البخاري عن أبي سعيد الخدري أن رسول الله صلى الله عليه وسلم قال \" يوشك أن يكون خير مال الرجل غنم يتبع بها شعف الجبال ومواقع القطر يفر بدينه من الفتن \" وقال العوفي وعلي بن أبي طلحة عن ابن عباس في قوله \" والحافظون لحدود الله \" قال القائمون بطاعة الله وكذا قال الحسن البصري وعنه رواية \" الحافظون لحدود الله \" قال لفرائض الله وفي رواية القائمون على أمر الله."
    },
    {
      "ayah": 113,
      "surah": 9,
      "text": "قال الإمام أحمد: حدثنا عبدالرزاق حدثنا معمر عن الزهري عن ابن المسيب عن أبيه قال لما حضرت أبا طالب الوفاة دخل عليه النبي صلى الله عليه وسلم وعنده أبو جهل وعبدالله بن أبي أمية فقال \" أي عم قل لا إله إلا الله كلمة أحاج لك بها عند الله عز وجل \". فقال أبو جهل وعبدالله بن أبي أمية يا أبا طالب أترغب عن ملة عبد المطلب؟ فقال أنا على ملة عبد المطلب فقال النبي صلى الله عليه وسلم \" لأستغفرن لك ما لم أنه عنك \" فنزلت \" ما كان للنبي والذين آمنوا أن يستغفروا للمشركين ولو كانوا أولي قربى من بعد ما تبين لهم أنهم أصحاب الجحيم \" قال ونزلت فيه \" إنك لا تهدي من أحببت ولكن الله يهدي من يشاء \" أخرجاه. وقال الإمام أحمد حدثنا يحيى بن آدم أخبرنا سفيان عن أبي إسحاق عن أبي الخليل عن علي رضي الله عنه قال: سمعت رجلا يستغفر لأبويه وهما مشركان فقلت أيستغفر الرجل لأبويه وهما مشركان؟ فقال أو لم يستغفر إبراهيم لأبيه؟. فذكرت ذلك للنبي صلى الله عليه وسلم فنزلت \" ما كان للنبي والذين آمنوا أن يستغفروا للمشركين \" الآية. قال لما مات فلا أدري قاله سفيان أو قاله إسرائيل أو هو في الحديث لما مات \" قلت \"هذا ثابت عن مجاهد أنه قال: لما مات. وقال الإمام أحمد: حدثنا الحسن بن موسى حدثنا زهير حدثنا زبيد بن الحارث اليامي عن محارب بن دثار عن ابن بريدة عن أبيه قال كنا مع النبي صلى الله عليه وسلم ونحن في سفر فنزل بنا ونحن قريب من ألف راكب فصلى ركعتين ثم أقبل علينا بوجهه وعيناه تذرفان فقام إليه عمر بن الخطاب وفداه بالأب والأم وقال: يا رسول الله ما لك؟ قال \" إني سألت ربي عز وجل في الاستغفار لأمي فلم يأذن لي فدمعت عيناي رحمة لها من النار وإني كنت نهيتكم عن ثلاث: نهيتكم عن زيارة القبور فزوروها لتذكركم زيارتها خيرا ونهيتكم عن لحوم الأضاحي بعد ثلاث فكلوا وأمسكوا ما شئتم ونهيتكم عن الأشربة في الأوعية فاشربوا في أي وعاء شئتم ولا تشربوا مسكرا \". وروى ابن جرير من حديث علقمة بن مرثد عن سليمان بن بريدة عن أبيه أن النبي صلى الله عليه وسلم لما قدم مكة أتى رسم قبر فجلس إليه فجعل يخاطب ثم قام مستعبرا فقلنا يا رسول الله إنا رأينا ما صنعت. قال \" إنى استأذنت ربي في زيارة قبر أمي فأذن لي واستأذنته في الاستغفار لها فلم يأذن لي \" فما رئي باكيا أكثر من يومئذ. وقال ابن أبي حاتم في تفسيره حدثنا أبي حدثنا خالد بن خداش حدثنا عبدالله بن وهب عن ابن جريج عن أيوب بن هانيء عن مسروق عن عبدالله بن مسعود قال: خرج رسول الله صلى الله عليه وسلم يوما إلى المقابر فاتبعناه فجاء حتى جلس إلى قبر منها فناجاه طويلا ثم بكى فبكينا لبكائه ثم قام فقام إليه عمر بن الخطاب فدعاه ثم دعانا فقال \" ما أبكاكم؟ \" فقلنا بكينا لبكائك. قال \" إن القبر الذي جلست عنده قبر آمنة وإني استأذنت ربي في زيارتها فأذن لي \" ثم أورده من وجه آخر ثم ذكر من حديث ابن مسعود قريبا. وفيه \" وإني استأذنت ربي في الدعاء لها فلم يأذن لي وأنزل علي \" ما كان للنبي والذين آمنوا \" الآية. فأخذني ما يأخذ الولد للوالد. وكنت نهيتكم عن زيارة القبور فزوروها فإنها تذكر الآخرة \" \" حديث أخر \"في معناه قال الطبراني: حدثنا محمد بن علي المروزي حدثنا أبو الدرداء عبد العزيز بن منيب حدثنا إسحاق بن عبدالله بن كيسان عن أبيه عن عكرمة عن ابن عباس أن رسول الله صلى الله عليه وسلم لما قفل من غزوة تبوك واعتمر فلما هبط من ثنية عسفان أمر أصحابه أن \" استندوا إلى العقبة حتى أرجع إليكم \" فذهب فنزل على قبر أمه فناجى ربه طويلا ثم إنه بكى فاشتد بكاؤه وبكى هؤلاء لبكائه وقالوا ما بكى نبي الله بهذا المكان إلا وقد أحدث الله في أمته شيئا لا تطيقه فلما بكى هؤلاء قام فرجع إليهم فقال \" ما يبكيكم؟ \" قالوا يا نبي الله بكينا لبكائك فقلنا لعله أحدث في أمتك شيء لا تطيقه قال \" لا وقد كان بعضه ولكن نزلت على قبر أمي فسألت الله أن يأذن لي في شفاعتها يوم القيامة فأبى الله أن يأذن لي فرحمتها وهي أمي فبكيت ثم جاءني جبريل فقال \" وما كان استغفار إبراهيم لأبيه إلا عن موعدة وعدها إياه فلما تبين له أنه عدو للّه تبرأ منه \" فتبرأ أنت من أمك كما تبرأ إبراهيم من أبيه فرحمتها وهي أمي ودعوت ربي أن يرفع عن أمتي أربعا فرفع عنهم اثنتين وأبى أن يرفع عنهم اثنتين: دعوت ربي أن يرفع عنهم الرجم من السماء والغرق من الأرض وأن لا يلبسهم شيعا وأن لا يذيق بعضهم بأس بعض فرفع الله عنهم الرجم من السماء والغرق من الأرض وأبى الله أن يرفع عنهم القتل والهرج \" وإنما عدل إلى قبر أمه لأنها كانت مدفونة تحت كداء وكانت عسفان لهم وهذا حديث غريب وسياق عجيب وأغرب منه وأشد نكارة ما رواه الخطيب البغدادي في كتاب السابق واللاحق بسند مجهول عن عائشة في حديث فيه قصة أن الله أحيا أمه فأمنت ثم عادت وكذلك ما رواه السهيلي في الروض بسند فيه جماعة مجهولون: أن الله أحيا له أباه وأمه فأمنا به. وقد قال الحافظ ابن دحية في هذا الاستدلال بما حاصله أن هذه حياة جديدة كما رجعت الشمس بعد غيبوبتها وصلى علي العصر قال الطحاوي وهو حديث ثابت يعني حديث الشمس قال القرطبي فليس إحياؤهما يمتنع عقلا ولا شرعا قال وقد سمعت أن الله أحيا عمه أبا طالب فآمن به \" قلت \"وهذا كله متوقف على صحة الحديث فإذا صح فلا مانع منه والله أعلم. وقال العوفي عن ابن عباس في قوله \" ما كان للنبي والذين آمنوا أن يستغفروا للمشركين \" الآية. أن النبي صلى الله عليه وسلم أراد أن يستغفر لأمه فنهاه الله عز وجل عن ذلك فقال \" إن إبراهيم خليل الله صلى الله عليه وسلم قد استغفر لأبيه \" فأنزل الله \" وما كان استغفار إبراهيم لأبيه إلا عن موعدة وعدها إياه \" الآية وقال علي بن أبي طلحة عن ابن عباس في هذه الآية: كانوا يستغفرون لهم حتى نزلت هذه الآية فأمسكوا عن الاستغفار لأمواتهم ولم ينهوا أن يستغفروا للأحياء حتى يموتوا ثم أنزل الله \" وما كان استغفار إبراهيم لأبيه \" الآية. وقال قتادة في الآية ذكر لنا أن رجالا من أصحاب النبي صلى الله عليه وآله وسلم قالوا يا نبي الله إن من آبائنا من كان يحسن الجوار ويصل الأرحام ويفك العاني ويوفي بالذمم أفلا نستغفر لهم؟ قال: فقال النبي صلى الله عليه وسلم \" بل والله إنى لأستغفر لأبي كما استغفر إبراهيم لأبيه \". فأنزل الله \" ما كان للنبي والذين آمنوا أن يستغفروا للمشركين \" حتى بلغ قوله \" الجحيم \" ثم عذر الله تعالى إبراهيم عليه السلام فقال \" وما كان استغفار إبراهيم لأبيه \" الآية. قال وذكر لنا أن نبي الله صلى الله عليه وآله وسلم قال \" قد أوحى الله إلي كلمات فدخلن في أذني ووقرن في قلبي: أمرت أن لا أستغفر لمن مات مشركا ومن أعطى فضل ماله فهو خير له ومن أمسك فهو شر له ولا يلوم الله علي كفاف \". وقال الثوري عن الشيباني عن سعيد بن جبير عن ابن عباس قال: مات رجل يهودي وله ابن مسلم فلم يخرج معه فذكر ذلك لابن عباس فقال فكان ينبغي له أن يمشي منه ويدفنه ويدعوا بالصلاح ما دام حيا فإذا مات وكله إلى شأنه ثم قال \" وما كان استغفار إبراهيم لأبيه\" - إلى قوله -\" تبرأ منه \" لم يدع. وشهد له بالصحة ما رواه أبو داود وغيره عن علي رضي الله عنه لما مات أبو طالب قلت يا رسول الله إن عمك الشيخ الضال قد مات قال \" اذهب فواره ولا تحدثن شيئا حتى تأتيني \" فذكر تمام الحديث وروي أنه صلى الله عليه وسلم لما مرت به جنازة عمه أبي طالب قال \" وصلتك رحم يا عم \" وقال عطاء بن أبي رباح: ما كنت لأدع الصلاة على أحد من أهل القبلة ولو كانت حبشية حبلى من الزنا لأني لم أسمع الله حجب الصلاة إلا عن المشركين يقول الله عز وجل \" ما كان للنبي والذين آمنوا أن يستغفروا للمشركين \" الآية. وروى ابن جرير عن ابن وكيع عن أبيه عن عصمة بن وامل عن أبيه قال: سمعت أبا هريرة يقول رحم الله رجلا استغفر لأبي هريرة ولأمه قلت ولأبيه قال لا. قال إن أبي مات مشركا وقوله \" فلما تبين له أنه عدو للّه تبرأ منه \" قال ابن عباس ما زال إبراهيم يستغفر لأبيه حتى مات فلما تبين له أنه عدو للّه تبرأ منه. وفي رواية لما مات تبين له أنه عدو للّه وكذا قال مجاهد والضحاك وقتادة وغيرهم رحمهم الله وقال عبيد بن عمير وسعيد بن جبير أنه يتبرأ منه يوم القيامة حين يلقى أباه وعلى وجه أبيه القترة والغبرة فيقول يا إبراهيم إني كنت أعصيك وإني اليوم لا أعصيك فيقول أي رب ألم تعدني أن لا تخزني يوم يبعثون؟ فأي خزي أخزي من أبي الأبعد؟ فيقال انظر إلى ما وراءك فإذا هو بذيخ متلطخ أي: قد مسخ ضبعا ثم يسحب بقوائمه ويلقى في النار. وقوله \" إن إبراهيم الأواه حليم \" قال سفيان الثوري وغير واحد عن عاصم بن بهدلة عن زرين حبيش عن عبدالله بن مسعود أنه قال الأواه الدعاء. وكذا روي من غير وجه عن ابن مسعود وقال ابن جرير حدثني المثنى حدثنا الحجاج بن منهال حدثني عبد الحميد بن بهرام حدثنا شهر بن حوشب عن عبدالله بن شداد بن الهاد قال بينما النبي صلى الله عليه وسلم جالس قال رجل يا رسول الله ما الأواه؟ قال \" المتضرع \" قال \" إن إبراهيم لأواه حليم \". ورواه ابن أبي حاتم من حديث ابن المبارك عن عبد الحميد بن بهرام به ولفظه قال الأواه المتضرع الدعاء وقال الثوري عن سلمة بن كهيل عن مسلم البطين عن أبي الغدير أنه سأل ابن مسعود عن الأواه فقال هو الرحيم وبه قال مجاهد وأبو ميسرة عمر بن شرحبيل والحسن البصري وقتادة وغيرهما إنه أي الرحيم أي بعباد الله وقال ابن المبارك عن خالد عن عكرمة عن ابن عباس قال الأواه الموقن بلسان الحبشة وكذا قال العوفي عن ابن عباس أنه الموقن وكذا قال مجاهد والضحاك وقال علي بن أبي طلحة ومجاهد عن ابن عباس الأواه المؤمن زاد علي بن أبي طلحة عنه هو المؤمن التواب وقال العوفي عنه هو المؤمن بلسان الحبشة وكذا قال ابن جريج هو المؤمن بلسان الحبشة. وقال الإمام أحمد حدثنا موسى حدثنا ابن لهيعة عن الحارث بن يزيد عن علي بن رباح عن عقبة بن عامر أن رسول الله صلى الله عليه وسلم قال لرجل يقال له ذو النجادين \" إنه أواه \" وذلك أنه رجل كان إذا ذكر الله في القرآن رفع صوته بالدعاء ورواه ابن جرير وقال سعيد بن جبير والشعبي الأواه المسبح وقال ابن وهب عن معاوية بن صالح عن أبي الزاهرية عن جبير بن نفير عن أبي الدرداء رضي الله عنه قال: المحافظ على سبحة الضحى الأواه وقال شفي ابن ماتع عن أبي أيوب الأواه الذي إذا ذكر خطاياه استغفر منها وعن مجاهد الأواه الحفيظ الوجل يذنب الذنب سرا ثم يتوب منه سرا ذكر ذلك كله ابن أبي حاتم رحمه الله.وقال ابن جرير حدثنا ابن وكيع حدثنا المحاربي عن حجاج عن الحكيم عن الحسن بن مسلم بن بيان أن رجلا كان يكثر ذكر الله ويسبح فذكر ذلك للنبي صلى الله عليه وسلم فقال \" إنه أواه \" وقال أيضا حدثنا أبو كريب حدثنا ابن هانيء حدثنا المنهال بن خليفة عن حجاج بن أرطاة عن عطاء عن ابن عباس أن النبي صلى الله عليه وسلم دفن ميتا فقال \" رحمك الله إن كنت لأواها \" يعني تلاء للقرآن وقال شعبة عن أبي يونس الباهلي قال سمعت رجلا بمكة وكان أصله روميا وكان قاصا يحدث عن أبي ذر قال: كان رجل يطوف بالبيت الحرام ويقول في دعائه أوه أوه فذكر ذلك للنبي صلى الله عليه وسلم فقال \" إنه أواه \" قال فخرجت ذات ليلة فإذا رسول الله صلى الله عليه وسلم يدفن ذلك الرجل ليلا ومعه المصباح. هذا حديث غريب رواه ابن جريج. وروى عن كعب الأحبار أنه قال: سمعت \" إن إبراهيم لأواه \" قال كان إذا ذكر النار قال أوه من النار وقال ابن جرير عن ابن عباس \" إن إبراهيم لأواه \" قال فقيه. قال الإمام أبو جعفر بن جرير وأولى الأقوال قول من قال إنه الدعاء وهو المناسب للسياق وذلك أن الله تعالى لما ذكر أن إبراهيم إنما استغفر لأبيه عن موعدة وعدها إياها وقد كان إبراهيم كثير الدعاء حليما عمن ظلمه وأناله مكروها ولهذا استغفر لأبيه مع شدة أذاه له في قوله \" أراغب أنت عن آلهتي يا إبراهيم لئن لم تنته لأرجمنك واهجرني مليا قال سلام عليك سأستغفر لك ربي إنه كان ربي حفيا \" فحلم عنه مع أذاه له ودعا له واستغفر ولهذا قال تعالى \" إن إبراهيم لأواه حليم\"."
    },
    {
      "ayah": 114,
      "surah": 9,
      "text": "قال الإمام أحمد: حدثنا عبدالرزاق حدثنا معمر عن الزهري عن ابن المسيب عن أبيه قال لما حضرت أبا طالب الوفاة دخل عليه النبي صلى الله عليه وسلم وعنده أبو جهل وعبدالله بن أبي أمية فقال \" أي عم قل لا إله إلا الله كلمة أحاج لك بها عند الله عز وجل \". فقال أبو جهل وعبدالله بن أبي أمية يا أبا طالب أترغب عن ملة عبد المطلب؟ فقال أنا على ملة عبد المطلب فقال النبي صلى الله عليه وسلم \" لأستغفرن لك ما لم أنه عنك \" فنزلت \" ما كان للنبي والذين آمنوا أن يستغفروا للمشركين ولو كانوا أولي قربى من بعد ما تبين لهم أنهم أصحاب الجحيم \" قال ونزلت فيه \" إنك لا تهدي من أحببت ولكن الله يهدي من يشاء \" أخرجاه. وقال الإمام أحمد حدثنا يحيى بن آدم أخبرنا سفيان عن أبي إسحاق عن أبي الخليل عن علي رضي الله عنه قال: سمعت رجلا يستغفر لأبويه وهما مشركان فقلت أيستغفر الرجل لأبويه وهما مشركان؟ فقال أو لم يستغفر إبراهيم لأبيه؟. فذكرت ذلك للنبي صلى الله عليه وسلم فنزلت \" ما كان للنبي والذين آمنوا أن يستغفروا للمشركين \" الآية. قال لما مات فلا أدري قاله سفيان أو قاله إسرائيل أو هو في الحديث لما مات \" قلت \"هذا ثابت عن مجاهد أنه قال: لما مات. وقال الإمام أحمد: حدثنا الحسن بن موسى حدثنا زهير حدثنا زبيد بن الحارث اليامي عن محارب بن دثار عن ابن بريدة عن أبيه قال كنا مع النبي صلى الله عليه وسلم ونحن في سفر فنزل بنا ونحن قريب من ألف راكب فصلى ركعتين ثم أقبل علينا بوجهه وعيناه تذرفان فقام إليه عمر بن الخطاب وفداه بالأب والأم وقال: يا رسول الله مالك؟ قال \" إني سألت ربي عز وجل في الاستغفار لأمي فلم يأذن لي فدمعت عيتاي رحمة لها من النار وإني كنت نهيتكم عن ثلاث: نهيتكم عن زيارة القبور فزوروها لتذكركم زيارتها خيرا ونهيتكم عن لحوم الأضاحي بعد ثلاث فكلوا وأمسكوا ما شئتم ونهيتكم عن الأشربة في الأوعية فاشربوا في أي وعاء شئتم ولا تشربوا مسكرا \". وروى ابن جرير من حديث علقمة بن مرثد عن سليمان بن بريدة عن أبيه أن النبي صلى الله عليه وسلم لما قدم مكة أتى رسم قبر فجلس إليه فجعل يخاطب ثم قام مستعبرا فقلنا يا رسول الله صلى الله عليه وسلم إنا رأينا ما صنعت. قال \" إنى استأذنت ربي في زيارة قبر أمي فأذن لي واستأذنته في الاستغفار لها فلم يأذن لي \" فما رئي باكيا أكثر من يومئذ. وقال ابن أبي حاتم في تفسيره حدثنا أبي حدثنا خالد بن خداش حدثنا عبدالله بن وهب عن ابن جريج عن أيوب بن هانيء عن مسروق عن عبدالله بن مسعود قال: خرج رسول الله صلى الله عليه وسلم يوما إلى المقابر فاتبعناه فجاء حتى جلس إلى قبر منها فناجاه طويلا ثم بكى فبكينا لبكائه ثم قام فقام إليه عمر بن الخطاب فدعاه ثم دعانا فقال \" ما أبكاكم؟ \" فقلنا بكينا لبكائك. قال \" إن القبر الذي جلست عنده قبر آمنة وإني استأذنت ربي في زيارتها فأذن لي \" ثم أورده من وجه آخر ثم ذكر من حديث ابن مسعود قريبا. وفيه \" وإني استأذنت ربي في الدعاء لها فلم يأذن لي وأنزل علي \" ما كان للنبي والذين آمنوا \" الآية. فأخذني ما يأخذ الولد للوالد. وكنت نهيتكم عن زيارة القبور فزوروها فإنها تذكر الآخرة \" \" حديث أخر \"في معناه قال الطبراني: حدثنا محمد بن علي المروزي حدثنا أبو الدرداء عبد العزيز بن منيب حدثنا إسحاق بن عبدالله بن كيسان عن أبيه عن عكرمة عن ابن عباس أن رسول الله صلى الله عليه وسلم لما قفل من غزوة تبوك واعتمر فلما هبط من ثنية عسفان أمر أصحابه أن \" استندوا إلى العقبة حتى أرجع إليكم \" فذهب فنزل على قبر أمه فناجى ربه طويلا ثم إنه بكى فاشتد بكاؤه وبكى هؤلاء لبكائه وقالوا ما بكى نبي الله بهذا المكان إلا وقد أحدث الله في أمته شيئا لا تطيقه فلما بكى هؤلاء قام فرجع إليهم فقال \" ما يبكيكم؟ \" قالوا يا نبي الله بكينا لبكائك فقلنا لعله أحدث في أمتك شيء لا تطيقه قال \" لا وقد كان بعضه ولكن نزلت على قبر أمي فسألت الله أن يأذن لي في شفاعتها يوم القيامة فأبى الله أن يأذن لي فرحمتها وهي أمي فبكيت ثم جاءني جبريل فقال \" وما كان استغفار إبراهيم لأبيه إلا عن موعدة وعدها إياه فلما تبين له أنه عدو للّه تبرأ منه \" فتبرأ أنت من أمك كما تبرأ إبراهيم من أبيه فرحمتها وهي أمي ودعوت ربي أن يرفع عن أمتي أربعا فرفع عنهم اثنتين وأبى أن يرفع عنهم اثنتين: دعوت ربي أن يرفع عنهم الرجم من السماء والغرق من الأرض وأن لا يلبسهم شيعا وأن لا يذيق بعضهم بأس بعض فرفع الله عنهم الرجم من السماء والغرق من الأرض وأبى الله أن يرفع عنهم القتل والهرج \" وإنما عدل إلى قبر أمه لأنها كانت مدفونة تحت كداء وكانت عسفان لهم وهذا حديث غريب وسياق عجيب وأغرب منه وأشد نكارة ما رواه الخطيب البغدادي في كتاب السابق واللاحق بسند مجهول عن عائشة في حديث فيه قصة أن الله أحيا أمه فأمنت ثم عادت وكذلك ما رواه السهيلي في الروض بسند فيه جماعة مجهولون: إن الله أحيا له أباه وأمه فأمنا به. وقد قال الحافظ ابن دحية في هذا الاستدلال بما حاصله أن هذه حياة جديدة كما رجعت الشمس بعد غيبوبتها وصلى علي العصر قال الطحاوي وهو حديث ثابت يعني حديث الشمس قال القرطبي فليس إحياؤهما يمتنع عقلا ولا شرعا قال وقد سمعت أن الله أحيا عمه أبا طالب فأمن به \" قلت \"وهذا كله متوقف على صحة الحديث فإذا صح فلا مانع منه والله أعلم. وقال العوفي عن ابن عباس في قوله \" ما كان للنبي والذين آمنوا أن يستغفروا للمشركين \" الآية. أن النبي صلى الله عليه وسلم أراد أن يستغفر لأمه فنهاه الله عز وجل عن ذلك فقال \" إن إبراهيم خليل الله صلى الله عليه وسلم قد استغفر لأبيه \" فأنزل الله \" وما كان استغفار إبراهيم لأبيه إلا عن موعدة وعدها إياه \" الآية وقال علي بن أبي طلحة عن ابن عباس في هذه الآية: كانوا يستغفرون لهم حتى نزلت هذه الآية فأمسكوا عن الاستغفار لأمواتهم ولم ينهوا أن يستغفروا للأحياء حتى يموتوا ثم أنزل الله \" وما كان استغفار إبراهيم لأبيه \" الآية. وقال قتادة في الآية ذكر لنا أن رجالا من أصحاب النبي صلى الله عليه وآله وسلم قالوا يا نبي الله إن من آبائنا من كان يحسن الجوار ويصل الأرحام ويفك العاني ويوفي بالذمم أفلا نستغفر لهم؟ قال: فقال النبي صلى الله عليه وسلم \" بل والله إنى لأستغفر لأبي كما استغفر إبراهيم لأبيه \". فأنزل الله \" ما كان للنبي والذين آمنوا أن يستغفروا للمشركين \" حتى بلغ قوله \" الجحيم \" ثم عذر الله تعالى إبراهيم عليه السلام فقال \" وما كان استغفار إبراهيم لأبيه \" الآية. قال وذكر لنا أن نبي الله صلى الله عليه وآله وسلم قال \" قد أوحى الله إلي كلمات فدخلن في أذني ووقرن في قلبي: أمرت أن لا أستغفر لمن مات مشركا ومن أعطى فضل ما له فهو خير له ومن أمسك فهو شر له ولا يلوم الله علي كفاف \". وقال الثوري عن الشيباني عن سعيد بن جبير عن ابن عباس قال: مات رجل يهودي وله ابن مسلم فلم يخرج معه فذكر ذلك لابن عباس فقال فكان ينبغي له أن يمشي منه ويدفنه ويدعوا بالصلاح ما دام حيا فإذا مات وكله إلى شأنه ثم قال \" وما كان استغفار إبراهيم لأبيه - إلى قوله - تبرأ منه \" لم يدع. وشهد له بالصحة ما رواه أبو داود وغيره عن علي رضي الله عنه لما مات أبو طالب قلت يا رسول الله صلى الله عليه وسلم إن عمك الشيخ الضال قد مات قال \" اذهب فواره ولا تحدثن شيئا حتى تأتيني \" فذكر تمام الحديث وروي أنه صلى الله عليه وسلم لما مرت به جنازة عمه أبي طالب قال \" وصلتك رحم يا عم \" وقال عطاء بن أبي رباح: ما كنت لأدع الصلاة على أحد من أهل القبلة ولو كانت حبشية حبلى من الزنا لأني لم أسمع الله حجب الصلاة إلا عن المشركين يقول الله عز وجل \" ما كان للنبي والذين آمنوا أن يستغفروا للمشركين \" الآية. وروى ابن جرير عن ابن وكيع عن أبيه عن عصمة بن وامل عن أبيه قال: سمعت أبا هريرة يقول رحم الله رجلا استغفر لأبي هريرة ولأمه قلت ولأبيه قال لا. قال إن أبي مات مشركا وقوله \" فلما تبين له أنه عدو للّه تبرأ منه \" قال ابن عباس ما زال إبراهيم يستغفر لأبيه حتى مات فلما تبين له أنه عدو للّه تبرأ منه. وفي رواية لما مات تبين له أله عدو للّه وكذا قال مجاهد والضحاك وقتادة وغيرهم رحمهم الله وقال عبيد بن عمير وسعيد بن جبير إنه يتبرأ منه يوم القيامة حين يلقى أباه وعلى وجه أبيه القترة والغبرة فيقول يا إبراهيم إني كنت أعصيك وإني اليوم لا أعصيك فيقول أي رب ألم تعدني أن لا تخزني يوم يبعثون؟ فأي خزي أخزي من أبي الأبعد؟ فيقال انظر إلى ما وراءك فإذا هو بذيخ متلطخ أي: قد مسخ ضبعا ثم يسحب بقوائمه ويلقى في النار. وقوله \" إن إبراهيم الأواه حليم \" قال سفيان الثوري وغير واحد عن عاصم بن بهدلة عن زرين حبيش عن عبدالله بن مسعود أنه قال الأواه الدعاء. وكذا روى من غير وجه عن ابن مسعود وقال ابن جرير حدثني المثنى حدثنا الحجاج بن منهال حدثني عبد الحميد بن بهرام حدثنا شهر بن حوشب عن عبدالله بن شداد بن الهاد قال بينما النبي صلى الله عليه وسلم جالس قال رجل يا رسول الله صلى الله عليه وسلم ما الأواه؟ قال \" المتضرع \" قال \" إن إبراهيم لأواه حليم \". ورواه ابن أبي حاتم من حديث ابن المبارك عن عبد الحميد بن بهرام به ولفظه قال الأواه المتضرع الدعاء وقال الثوري عن سلمة بن كهيل عن مسلم البطين عن أبي الغدير أنه سأل ابن مسعود عن الأواه فقال هو الرحيم وبه قال مجاهد وأبو ميسرة عمر بن شرحبيل والحسن البصري وقتادة وغيرهما إنه أي الرحيم أي بعباد الله وقال ابن المبارك عن خالد عن عكرمة عن ابن عباس قال الأواه الموقن بلسان الحبشة وكذا قال العوفي عن ابن عباس أنه الموقن وكذا قال مجاهد والضحاك وقال علي بن أبي طلحة ومجاهد عن ابن عباس الأواه المؤمن زاد علي بن أبي طلحة عنه هو المؤمن التواب وقال العوفي عنه هو المؤمن بلسان الحبشة وكذا قال ابن جريج هو المؤمن بلسان الحبشة. وقال الإمام أحمد حدثنا موسى حدثنا ابن لهيعة عن الحارث بن يزيد عن علي بن رباح عن عقبة بن عامر أن رسول الله صلى الله عليه وسلم قال لرجل يقال له ذو النجادين \" إنه أواه \" وذلك أنه رجل كان إذا ذكر الله في القرآن رفع صوته بالدعاء ورواه ابن جرير وقال سعيد بن جبير والشعبي الأواه المسبح وقال ابن وهب عن معاوية بن صالح عن أبي الزاهرية عن جبير بن نفير عن أبي الدرداء رضي الله عنه قال: المحافظ على سبحة الضحى الأواه وقال شفي ابن ماتع عن أبي أيوب الأواه الذي إذا ذكر خطاياه استغفر منها وعن مجاهد الأواه الحفيظ الوجل يذنب الذنب سرا ثم يتوب منه سرا ذكر ذلك كله ابن أبي حاتم رحمه الله.وقال ابن جرير حدثنا ابن وكيع حدثنا المحاربي عن حجاج عن الحكيم عن الحسن بن مسلم بن بيان أن رجلا كان يكثر ذكر الله ويسبح فذكر ذلك للنبي صلى الله عليه وسلم فقال \" إنه أواه \" وقال أيضا حدثنا أبو كريب حدثنا ابن هانيء حدثنا المنهال بن خليفة عن حجاج بن أرطاة عن عطاء عن ابن عباس أن النبي صلى الله عليه وسلم دفن ميتا فقال \" رحمك الله إن كنت لأواها \" يعني تلاء للقرآن وقال شعبة عن أبي يونس الباهلي قال سمعت رجلا بمكة وكان أصله روميا وكان قاصا يحدث عن أبي ذر قال: كان رجل يطوف بالبيت الحرام ويقول في دعائه أوه أوه فذكر ذلك للنبي صلى الله عليه وسلم فقال \" إنه أواه \" قال فخرجت ذات ليلة فإذا رسول الله صلى الله عليه وسلم يدفن ذلك الرجل ليلا ومعه المصباح. هذا حديث غريب رواه ابن جريج. وروى عن كعب الأحبار أنه قال: سمعت \" إن إبراهيم لأواه \" قال كان إذا ذكر النار قال أوه من النار وقال ابن جرير عن ابن عباس \" إن إبراهيم لأواه \" قال فقيه. قال الإمام أبو جعفر بن جرير وأولى الأقوال قول من قال إنه الدعاء وهو المناسب للسياق وذلك أن الله تعالى لما ذكر أن إبراهيم إنما استغفر لأبيه عن موعدة وعدها إياها وقد كان إبراهيم كثير الدعاء حليما عمن ظلمه وأناله مكروها ولهذا استغفر لأبيه مع شدة أذاه له في قوله \" أراغب أنت عن آلهتي يا إبراهيم لئن لم تنته لأرجمنك واهجرني مليا قال سلام عليك سأستغفر لك ربي إنه كان ربي حفيا \" فحلم عنه مع أذاه له ودعا له واستغفر ولهذا قال تعالى \" إن إبراهيم لأواه حليم\"."
    },
    {
      "ayah": 115,
      "surah": 9,
      "text": "يقول تعالى مخبرا عن نفسه الكريمة وحكمه العادل إنه لا يضل قوما إلا بعد إبلاغ الرسالة إليهم حتى يكونوا قد قامت عليهم الحجة كما قال تعالى \" فأما ثمود فهديناهم \" الآية وقال مجاهد في قوله تعالى \" وما كان الله ليضل قوما بعد إذ هداهم \" الآية. قال بيان اللّه عز وجل للمؤمنين في ترك الاستغفار للمشركين خاصة وفي بيانه لهم في معصيته وطاعته عامة فافعلوا أو ذروا: وقال ابن جرير يقول الله تعالى وما كان الله ليقضي عليكم في استغفاركم لموتاكم المشركين بالضلال بعد إذ رزقكم الهداية ووفقكم للإيمان به وبرسوله حتى يتقدم إليكم بالنهي عنه فتتركوا فأما قبل أن يبين لكم كراهة ذلك بالنهي عنه فلم تضيعوا نهيه إلى ما نهاكم عنه فإنه لا يحكم عليكم بالضلال فإن الطاعة والمعصية إنما يكونان من المأمور والمنهي وأما من لم يؤمر ولم ينه فغير كائن مطيعا أو عاصيا فيما لم يؤمر به ولم ينه عنه;."
    },
    {
      "ayah": 116,
      "surah": 9,
      "text": "وقوله تعالى \" إن الله له ملك السموات والأرض يحي ويميت وما لكم من دون الله من ولي ولا نصير \" قال ابن جرير هذا تحريض من الله تعالى لعباده المؤمنين في قتال المشركين وملوك الكفر وأنهم يثقوا بنصر الله مالك السموات والأرض ولم يرهبوا من أعدائه فإنه لا ولي لهم من دون الله ولا نصير لهم سواه وقال ابن أبي حاتم حدثنا علي بن أبي دلامة البغدادي حدثنا عبد الوهاب بن عطاء حدثنا سعيد عن قتادة عن صفوان بن محرز عن حكيم بن حزام قال بينا رسول الله صلى الله عليه وسلم بين أصحابه إذ قال لهم \" هل تسمعون ما أسمع؟ \" قالوا ما نسمع من شيء فقال رسول الله صلى الله عليه وسلم \" إنى لأسمع أطيط السماء وما تلام أن تئط ما فيها من موضع شبر إلا وعليه ملك ساجد أو قائم \" وقال كعب الأحبار ما من موضع خرمة إبرة من الأرض إلا وملك موكل بها يرفع علم ذلك إلى الله وإن ملائكة السماء لأكثر من عدد التراب وإن حملة العرش ما بين كعب أحدهم إلى مخه مسيرة مائة عام."
    },
    {
      "ayah": 117,
      "surah": 9,
      "text": "قال مجاهد وغير واحد نزلت هذه الآية في غزوة تبوك وذلك أنهم خرجوا إليها في شدة من الأمر في سنة مجدبة وحر شديد وعسر من الزاد والماء; قال قتادة خرجوا إلى الشام عام تبوك في لهبان الحر على ما يعلم الله من الجهد ما أصابهم فيها جهد شديد حتى لقد ذكر لنا أن الرجلين كانا يشقان التمرة بينهما وكان النفر يتداولون التمرة بينهم يمصها هذا ثم يشرب عليها ثم يمصها هذا ثم يشرب عليها فتاب الله عليهم وأقفلهم من غزوتهم; وقال ابن جرير حدثني يونس بن عبد الأعلى أخبرنا ابن وهب أخبرني عمرو بن الحارث عن سعيد بن أبي هلال عن عتبة بن أبي عتبة عن نافع بن جبير بن مطعم عن عبدالله بن عباس أنه قيل لعمر بن الخطاب في شأن العسرة فقال عمر بن الخطاب خرجنا مع رسول الله صلى الله عليه وسلم إلى تبوك في قيظ شديد فنزلنا منزلا فأصابنا فيه عطش حتى ظننا أن رقابنا ستنقطع وحتى إن كان الرجل ليذهب يلتمس الماء فلا يرجع حتى يظن أن رقبته ستقطع وحتى إن الرجل لينحر بعيره فيعصر فرثه فيشربه ويجعل ما بقي على كبده فقال أبو بكر الصديق يا رسول الله صلى الله عليه وسلم إن الله عز وجل قد عودك في الدعاء خيرا فادع لنا فقال \" تحب ذلك؟ \" قال نعم فرفع يديه فلم يرجعهما حتى سالت السماء فأهطلت ثم سكنت فملئوا ما معهم ثم ذهبنا ننظر فلم نجدها جاوزت العسكر وقال ابن جرير في قوله \" لقد تاب الله على النبي والمهاجرين والأنصار الذين اتبعوه في ساعة العسرة \" أي من النفقة والطهر والزاد والماء \" من بعد ما كاد يزيغ قلوب فريق منهم \" أي عن الحق ويشك في دين الرسول صلى الله عليه وسلم ويرتاب للذي نالهم من المشقة والشدة في سفرهم وغزوهم \" ثم تاب عليهم \" يقول ثم رزقهم الإنابة \" إلى ربهم والرجوع إلى الثبات على دينه \" إنه بهم رءوف رحيم \"."
    },
    {
      "ayah": 118,
      "surah": 9,
      "text": "قال الإمام أحمد حدثنا يعقوب بن إبراهيم حدثنا ابن أخي الزهري محمد بن عبدالله عن عمه محمد بن مسلم الزهري أخبرني عبدالرحمن بن عبدالله بن كعب بن مالك أن عبيد الله بن كعب بن مالك وكان قائد كعب من بنيه حين عمي قال: سمعت كعب بن مالك يحدث حديثه حين تخلف عن رسول الله صلى الله عليه وسلم في غزوة تبوك فقال كعب بن مالك لم أتخلف عن رسول الله صلى الله عليه وسلم في غزاة غزاها قط إلا في غزاة تبوك غير أني كنت تخلفت في غزاة بدر ولم يعاتب أحدا تخلف عنها وإنما خرج رسول الله صلى الله عليه وسلم يريد عير قريش حتى جمع الله بينهم وبين عدوهم على غير ميعاد ولقد شهدت مع رسول الله صلى الله عليه وسلم ليلة العقبة حين تواثقنا على الإسلام وما أحب أن لي بها مشهد بدر وإن كانت بدر أذكر في الناس منها وأشهر وكان من خبري حين تخلفت عن رسول الله صلى الله عليه وسلم في غزوة تبوك أني لم أكن قط أقوى ولا أيسر مني حين تخلفت عنه في تلك الغزاة والله ما جمعت قبلها راحلتين قط حتى جمعتهما في تلك الغزاة وكان رسول الله صلى الله عليه وسلم قلما يريد غزوة يغزوها إلا ورى بغيرها حتى كانت تلك الغزوة فغزاها رسول الله صلى الله عليه وسلم في حر شديد واستقبل سفرا بعيدا ومفاوز وعدوا كثيرا فخلى للمسلمين أمرهم ليتأهبوا أهبة عدوهم فأخبرهم وجهه الذي يريد والمسلمون مع رسول الله صلى الله عليه وسلم كثير لا يجمعهم كتاب حافظ - يريد الديوان - قال كعب: فقلَّ رجل يريد أن يتغيب إلا ظن أن ذلك سيخفى عليه ما لم ينزل فيه وحي من الله عز وجل وغزا رسول الله صلى الله عليه وسلم تلك الغزاة حين طابت الثمار والظلال وأنا إليها أصغر فتجهز إليها رسول الله صلى الله عليه وسلم والمؤمنون معه فطفقت أغدو لكي أتجهز معهم فأرجع ولم أقض من جهازي شيئا فأقول لنفسي أنا قادر على ذلك إذا أردت فلم يزل ذلك يتمادى بي حتى استمر بالناس الجد فأصبح رسول الله صلى الله عليه وسلم غاديا والمسلمون معه ولم أقض من جهازي شيئا وقلت أتجهز بعد يوم أو يومين ثم ألحقه فغدوت بعدما صلوا لأتجهز فرجعت ولم أقض من جهازي شيئا ثم غدوت فرجعت ولم أقض شيئا فلم يزل ذلك يتمادى بي حتى أسرعوا وتفارط الغزو فهممت أن ارتحل فألحقهم وليت أني فعلت ثم لم يقدر ذلك لي فطفقت إذا خرجت في الناس بعد رسول الله صلى الله عليه وسلم يحزنني أنى لا أرى إلا رجلا مغموصا عليه في النفاق أو رجلا ممن عذره الله عز وجل ولم يذكرني رسول الله صلى الله عليه وسلم حتى بلغ تبوك فقال وهو جالس في القوم بتبوك \" ما فعل كعب بن مالك؟ \" فقال رجل من بني سلمة حبسه يا رسول الله صلى الله عليه وسلم برده والنظر في عطفيه فقال معاذ بن جبل: بئسما قلت والله يا رسول الله ما علمنا عليه إلا خيرا. فسكت رسول الله صلى الله عليه وسلم. قال كعب بن مالك فلما بلغني أن رسول الله صلى الله عليه وسلم قد توجه قافلا من تبوك حضر بثي وطفقت أتذكر الكذب وأقول بماذا أخرج من سخطه غدا وأستعين على ذلك بكل ذي رأي من أهلي فلما قيل إن رسول الله صلى الله عليه وسلم قد أظل قادما زاح عني الباطل وعرفت أني لم أنج منه بشيء أبدا فأجمعت صدقه فأصبح رسول الله صلى الله عليه وسلم وكان إذا قدم من سفر بدأ بالمسجد فصلى ركعتين ثم جلس للناس فلما فعل ذلك جاءه المتخلفون \"وطفقوا يعتذرون إليه ويحلفون له وكانوا بضعة وثمانين رجلا فيقبل منهم رسول الله صلى الله عليه وسلم علانيتهم ويستغفر لهم ويكل سرائرهم إلى الله تعالى حتى جئت فلما سلمت عليه تبسم تبسم المغضب ثم قال لي \" تعال \" فجئت أمشي حتى جلست بين يديه فقال لي \" ما خلفك ألم تكن قد اشتريت ظهرا؟ \" فقلت يا رسول الله إني لو جلست عند غيرك من أهل الدنيا لرأيت أن أخرج من سخطه بعذر لقد أعطيت جدلا ولكني والله لقد علمت لئن حدثتك اليوم بحديث كذب ترضى به عني ليوشكن الله أن يسخطك علي ولئن حدثتك بصدق تجد علي فيه إني لأرجو عقبى ذلك من الله عز وجل والله ما كان لي عذر والله ما كنت قط أفرغ ولا أيسر مني حين تخلفت عنك قال: فقال رسول الله صلى الله عليه وسلم \" أما هذا فقد صدق فقم حتى يقضي الله فيك \" فقمت وقام إلي رجال من بني سلمة واتبعوني فقالوا لي والله ما علمناك كنت أذنبت ذنبا قبل هذا ولقد عجزت إلا أن تكون اعتذرت إلى رسول الله صلى الله عليه وسلم بما اعتذر به المتخلفون فقد كان كافيك من ذنبك استغفار رسول الله صلى الله عليه وسلم لك. قال فوالله ما زالوا يؤنبوني حتى أردت أن أرجع فأكذب نفسي قال ثم قلت لهم هل لقي معي هذا أحد؟ قالوا نعم لقيه معك رجلان قالا مثل ما قلت وقيل لهما مثل ما قيل لك فقلت فمن هما؟ قالوا مرارة بن الربيع العامري وهلال بن أمية الواقفي فذكروا لي رجلين صالحين قد شهدا بدرا لي فيهما أسوة قال فمضيت حين ذكروهما لي فقال ونهى رسول الله صلى الله عليه وسلم المسلمين عن كلامنا أيها الثلاثة من بين من تخلف عنه فاجتنبنا الناس وتغيروا لنا حتى تنكرت لي في نفسي الأرض فما هي بالأرض التي كنت أعرف فلبثنا على ذلك خمسين ليلة فأما صاحباي فاستكانا وقعدا في بيوتهما يبكيان وأما أنا فكنت أشد القوم وأجلدهم فكنت أشهد الصلاة مع المسلمين وأطوف بالأسواق فلا يكلمني أحد وآتي رسول الله صلى الله عليه وسلم وهو في مجلسه بعد الصلاة فأسلم وأقول في نفسي أحرك شفتيه برد السلام علي أم لا؟ ثم أصلي قريبا منه وأسارقه النظر فإذا أقبلت على صلاتي نظر إلي فإذا التفت نحوه أعرض عني; حتى إذا طال علي ذلك من هجر المسلمين مشيت حتى تسورت حائط أبي قتادة وهو ابن عمي وأحب الناس إلي فسلمت عليه فوالله ما رد علي السلام فقلت له يا أبا قتادة أنشدك الله هل تعلم أني أحب الله ورسوله قال فسكت قال فعدت له فنشدته فسكت فعدت له فنشدته فسكت فقال الله ورسوله أعلم. قال ففاضت عيناي وتوليت حتى تسورت الجدار فبينا أنا أمشي بسوق المدينة إذا أنا بنبطي من أنباط الشام ممن قدم بطعام يبيعه بالمدينة يقول من يدل على كعب بن مالك قال فطفق الناس يشيرون له إلي حتى جاء فدفع إلي كتابا من ملك غسان وكنت كاتبا فإذا فيه: أما بعد فقد بلغنا أن صاحبك قد جفاك وأن الله لم يجعلك في دار هوان ولا مضيعة فالْحَقْ بنا نواسك. قال: فقلت حين قرأته وهذا أيضا من البلاء قال فتيممت به التنور فسجرته به حتى إذا مضت أربعون ليلة من الخمسين إذا برسول رسول الله صلى الله عليه وسلم يأتيني يقول يأمرك رسول الله صلى الله عليه وسلم أن تعتزل امرأتك قال: فقلت أطلقها أم ماذا أفعل؟ فقال: بل اعتزلها ولا تقربها قال وأرسل إلى صاحبي بمثل ذلك قال: فقلت لامرأتي الحقي بأهلك فكوني عندهم حتى يقضي الله في هذا الأمر ما يشاء قال فجاءت امرأة هلال بن أمية رسول الله صلى الله عليه وسلم فقالت يا رسول الله إن هلالا شيخ ضعيف ليس له خادم فهل تكره أن أخدمه؟ قال \" لا ولكن لا يقربك \" قالت وإنه والله ما به من حركة إلى شيء وإنه والله ما زال يبكي منذ كان من أمره ما كان إلى يومه هذا قال: فقال لي بعض أهلي لو استأذنت رسول الله صلى الله عليه وسلم في امرأتك فقد أذن لامرأة هلال بن أمية أن تخدمه قال: فقلت والله لا أستأذن فيها رسول الله صلى الله عليه وسلم وما أدري ما يقول فيها رسول الله صلى الله عليه وسلم إذا استأذنته وأنا رجل شاب قال فلبثنا عشر ليال فكمل لنا خمسون ليلة من حين نهى عن كلامنا قال ثم صليت صلاة الصبح صباح خمسين ليلة على ظهر بيت من بيوتنا فبينا أنا جالس على الحال التي ذكر الله تعالى منا قد ضاقت علي نفسي وضاقت علي الأرض بما رحبت سمعت صارخا أوفى على جبل سلع يقول بأعلى صوته: أبشر يا كعب بن مالك قال فخررت ساجدا وعرفت أن قد جاء الفرج من الله عز وجل بالتوبة علينا فأذن رسول الله صلى الله عليه وسلم بتوبة الله علينا حين صلى الفجر ذهب الناس يبشروننا وذهب قبل صاحبي مبشرون وركض إلي رجل فرسا وسعى ساع من أسلم وأوفى على الجبل فكان الصوت أسرع من الفرس فلما جاءني الذي سمعت صوته يبشرني نزعت له ثوبي فكسوتهما إياه ببشارته له والله ما أملك يومئذ غيرهما واستعرت ثوبين فلبستهما وانطلقت أؤم رسول الله صلى الله عليه وسلم وتلقاني الناس فوجا فوجا يهنوني بتوبة الله يقولون ليهنك توبة الله عليك حتى دخلت المسجد فإذا رسول الله صلى الله عليه وسلم جالس في المسجد والناس حوله فقام إلي طلحة بن عبدالله يهرول حتى صافحني وهنأني والله ما قام إلي رجل من المهاجرين غيره قال فكان كعب لا ينساها لطلحة قال كعب: فلما سلمت على رسول الله صلى الله عليه وسلم قال وهو يبرق وجهه من السرور \" أبشر بخير يوم مر عليك منذ ولدتك أمك \" قال: قلت أمن عندك يا رسول الله أم من عند الله؟ قال \" لا بل من عند الله \" قال وكان رسول الله صلى الله عليه وسلم إذا سر استنار وجهه حتى كأنه قطعة قمر حتى يعرف ذلك منه فلما جلست بين يديه قلت يا رسول الله إن من توبتي أن أنخلع من مالي صدقة إلى الله وإلى رسوله قال \" أمسك عليك بعض مالك فهو خير لك \". قال فقلت فإني أمسك سهمي الذي بخيبر وقلت يا رسول الله إنما نجاني الله بالصدق وإن من توبتي أن لا أحدث إلا صدقا ما بقيت قال فوالله ما أعلم أحدا من المسلمين أبلاه الله من الصدق في الحديث منذ ذكرت ذلك لرسول الله صلى الله عليه وسلم أحسن مما أبلاني الله تعالى والله ما تعمدت كذبة منذ قلت ذلك لرسول الله صلى الله عليه وسلم إلى يومي هذا وإني لأرجو أن يحفظني الله عز وجل فيما بقي. \" قال \"وأنزل الله تعالى \" لقد تاب الله على النبي والمهاجرين والأنصار الذين اتبعوه في ساعة العسرة من بعد ما كاد يزيغ قلوب فريق منهم ثم تاب عليهم إنه بهم رءوف رحيم وعلى الثلاثة الذين خلفوا حتى إذا ضاقت عليهم الأرض بما رحبت وضاقت عليهم أنفسهم وظنوا أن لا ملجأ من الله إلا إليه ثم تاب عليهم ليتوبوا إن الله هو التواب الرحيم يا أيها الذين آمنوا اتقوا الله وكونوا مع الصادقين \" إلى آخر الأيات. قال كعب فوالله ما أنعم الله علي من نعمة قط بعد أن هداني للإسلام أعظم في نفسي من صدقي رسول الله صلى الله عليه وسلم يومئذ أن لا أكون كذبته فأهلك كما هلك الذين كذبوه فإن الله تعالى قال للذين كذبوه حين أنزل الوحي شر ما قال لأحد فقال الله تعالى \" سيحلفون بالله لكم إذا انقلبتم إليهم لتعرضوا عنهم فأعرضوا عنهم إنهم رجس ومأواهم جهنم جزاء بما كانوا يكسبون يحلفون لكم لترضوا عنهم فإن ترضوا عنهم فإن الله لا يرضى عن القوم الفاسقين \" قال وكنا أيها الثلاثة الذين خلفنا عن أمر أولئك الذين قبل منهم رسول الله صلى الله عليه وسلم حين حلفوا فبايعهم واستغفر لهم وأرجأ رسول الله صلى الله عليه وسلم أمرنا حتى قضى الله فيه فلذلك قال الله عز وجل \" وعلى الثلاثة الذين خلفوا \" وليس تخليفه إيانا وإرجاءوه أمرنا الذي ذكر مما خلفنا بتخليفنا عن الغزو وإنما هو عمن حلف له واعتذر إليه فقبل منه. هذا حديث صحيح ثابت متفق على صحته رواه صاحبا الصحيح البخاري ومسلم من حديث الزهري بنحوه فقد تضمن هذا الحديث تفسير هذه الآية الكريمة بأحسن الوجوه وأبسطها وكذا روي عن غير واحد من السلف في تفسيرها كما رواه الأعمش عن أبي سفيان عن جابر بن عبدالله في قوله تعالى \" وعلى الثلاثة الذين خلفوا \" قال هم كعب بن مالك وهلال بن أمية ومرارة بن الربيع وكلهم من الأنصار وكذا قال مجاهد والضحاك وقتادة والسدي وغير واحد وكلهم قال مرارة بن ربيعة وكذا في مسلم بن ربيعة في بعض نسخه وفي بعضها مرارة بن الربيع وفي رواية عن الضحاك مرارة بن الربيع كما وقع في الصحيحين وهو الصواب وقوله فسموا رجلين شهدا بدرا قيل إنه خطأ من الزهري فإنه لا يعرف شهود واحد من هؤلاء الثلاثة بدرا والله أعلم. ولما ذكر تعالى ما فرج به عن هؤلاء الثلاثة من الضيق والكرب من هجر المسلمين إياهم نحوا من خمسين ليلة بأيامها وضاقت عليهم أنفسهم وضاقت عليهم الأرض بما رحبت أي مع سعتها فسددت عليهم المسالك والمذاهب فلا يهتدون ما يصنعون فصبروا لأمر الله واستكانوا لأمر الله وثبتوا حتى فرج الله عنهم بسبب صدقهم رسول الله صلى الله عليه وآله وسلم في تخلفهم وأنه كان عن غير عذر فعوقبوا على ذلك هذه المدة ثم تاب الله عليهم فكان عاقبة صدقهم خيرا لهم وتوبة عليهم."
    },
    {
      "ayah": 119,
      "surah": 9,
      "text": "ولهذا قال \" يا أيها الذين آمنوا اتقوا الله وكونوا مع الصادقين \" أي اصدقوا والزموا الصدق تكونوا من أهله وتنجوا من المهالك ويجعل لكم فرجا من أموركم ومخرجا وقد قال الإمام أحمد: حدثنا أبو معاوية حدثنا الأعمش عن شقيق عن عبدالله هو ابن مسعود رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم \" عليكم بالصدق فإن الصدق يهدي إلى البر وإن البر يهدي إلى الجنة ولا يزال الرجل يصدق ويتحرى الصدق حتى يكتب عند الله صديقا وإياكم والكذب فإن الكذب يهدي إلى الفجور وإن الفجور يهدي إلى النار ولا يزال الرجل يكذب ويتحرى الكذب حتى يكتب عند الله كذابا \" أخرجاه في الصحيحين وقال شعبة عن عمرو بن مرة سمع أبا عبيدة يحدث عن عبدالله بن مسعود رضي الله عنه أنه قال: الكذب لا يصلح منه جد ولا هزل اقرأوا إن شئتم \" يا أيها الذين آمنوا اتقوا الله وكونوا مع الصادقين \" هكذا قرأها ثم قال: فهل تجدون لأحد فيه رخصة؟ وعن عبدالله بن عمر في قوله \" اتقوا الله وكونوا مع الصادقين \" قال مع محمد صلى الله عليه وسلم وأصحابه وقال الضحاك مع أبي بكر وعمر وأصحابهما وقال الحسن البصري إن أردت أن تكون مع الصادقين فعليك بالزهد في الدنيا والكف عن أهل الملة."
    },
    {
      "ayah": 12,
      "surah": 9,
      "text": "يقول تعالى \" وإن نكث \" هؤلاء المشركين الذين عاهدتموهم على مدة معينة أيمانهم أي عهودهم ومواثيقهم \" وطعنوا في دينكم \" أي عابوه وانتقصوه ومن ههنا أخذ قتل من سب الرسول صلوات الله وسلامه عليه أو من طعن في دين الإسلام أو ذكره بنقص ولهذا قال: \" فقاتلوا أئمة الكفر إنهم لا إيمان لهم لعلهم ينتهون \" أي يرجعون عما هم فيه من الكفر والعناد والضلال وقد قال قتادة وغيره: أئمة الكفر كأبي جهل وعتبة وشيبة وأمية بن خلف وعدد رجالا وعن مصعب بن سعد بن أبي وقاص قال: مر سعيد بن أبي وقاص برجل من الخوارج فقال الخارجي: هذا من أئمة الكفر فقال سعد: كذبت بل أنا قاتلت أئمة الكفر رواه ابن مردويه وقال الأعمش عن زيد بن وهب عن حذيفة أنه قال: ما قوتل أهل هذه الآية بعد وروى عن علي بن أبي طالب رضي الله عنه مثله والصحيح أن الآية عامة وإن كان سبب نزولها مشركي قريش فهي عامة لهم ولغيرهم والله أعلم وقال الوليد بن مسلم: حدثنا صفوان بن عمرو عن عبدالرحمن بن جبير بن نفير أنه كان في عهد أبي بكر رضي الله عنه إلى الناس حين وجههم إلى الشام قال إنكم ستجدون قوما مجوفة رءوسهم فاضربوا معاقد الشيطان منهم بالسيوف فوالله لأن أقتل رجلا منهم أحب إلي من أن أقتل سبعين من غيرهم وذلك بأن الله يقول \" فقاتلوا أئمة الكفر \" رواه ابن أبي حاتم."
    },
    {
      "ayah": 120,
      "surah": 9,
      "text": "يعاتب تبارك وتعالى المتخلفين عن رسول الله صلى الله عليه وسلم في غزوة تبوك من أهل المدينة ومن حولها من أحياء العرب ورغبتهم بأنفسهم عن مواساته فيما حصل له من المشقة فإنهم نقصوا أنفسهم من الأجر لأنهم \" لا يصيبهم ظمأ \" وهو العطش \" ولا نصب \" وهو التعب \" ولا مخمصة \" وهي المجاعة \" ولا يطئون موطئا يغيظ الكفار \" أي ينزلون منزلا يرهب عدوهم \" ولا ينالون \" منه ظفرا وغلبة عليه \" إلا كتب لهم \" بهذه الأعمال التي ليست داخلة تحت قدرهم وإنما هي ناشئة عن أفعالهم أعمالا صالحة وثوابا جزيلا \" إن الله لا يضيع أجر المحسنين كقوله \" إنا لانضيع أجر من أحسن عملا \"."
    },
    {
      "ayah": 121,
      "surah": 9,
      "text": "يقول تعالى: ولا ينفق هؤلاء الغزاة في سبيل الله \" نفقة صغيرة ولا كبيرة \" أي قليلا ولا كثيرا \" ولا يقطعون واديا \" أي في السير إلى الأعداء \" إلا كتب لهم \" ولم يقل ههنا به لأن هذه أفعال صادرة عنهم ولهذا قال \" ليجزيهم الله أحسن ما كانوا يعملون \" وقد حصل لأمير المؤمنين عثمان بن عفان رضي الله عنه من هذه الآية الكريمة حظ وافر ونصيب عظيم وذلك أنه أنفق في هذه الغزوة النفقات الجليلة والأموال الجزيلة كما قال عبدالله بن الإمام أحمد: حدثنا أبو موسى الغنوي حدثنا عبدالصمد بن عبدالوارث حدثني سليمان بن المغيرة حدثني الوليد بن أبي هاشم عن فرقد بن أبي طلحة عن عبدالرحمن بن حباب السلمي قال: خطب رسول الله صلى الله عليه وسلم فحث على جيش العسرة فقال عثمان بن عفان رضي الله عنه عليَّ مائة بعير بأحلاسها وأقتابها قال: ثم حث فقال عثمان عليَّ مائه بعير أخرى بأحلاسها وأقتابها قال ثم نزل مرقاة من المنبر ثم حث فقال عثمان بن عفان علىَّ مائة أخرى بأحلاسها وأقتابها. قال فرأيت رسول الله صلى الله عليه وسلم قال بيده هكذا يحركها. وأخرج عبدالصمد يده كالمتعجب \" ما على عثمان ما عمل بعد هذا \" وقال عبدالله أيضا حدثنا هارون بن معروف حدثنا ضمرة حدثنا عبدالله بن شوذب عن عبدالله بن القاسم عن كثير مولى عبدالرحمن بن سمرة عن عبدالرحمن بن سمرة قال: جاء عثمان رضي الله عنه إلى النبي صلى الله عليه وسلم بألف دينار في ثوبه حتى جهز النبي صلى الله عليه وسلم جيش العسرة قال فصبها في حجر النبي صلى الله عليه وسلم فرأيت النبي صلى الله عليه وآله وسلم يقلبها بيده ويقول \" ما ضر ابن عفان ما عمل بعد اليوم \" يرددها مرارا وقال قتادة في قوله تعالى \" ولا يقطعون واديا إلا كتب لهم \" الآية ما ازداد قوم في سبيل الله بعدا من أهليهم إلا ازدادوا قربا من الله."
    },
    {
      "ayah": 122,
      "surah": 9,
      "text": "هذا بيان من الله تعالى لما أراد من نفير الأحياء مع الرسول صلى الله عليه وسلم في غزوة تبوك فإنه قد ذهبت طائفة من السلف إلى أنه كان يجب النفير على كل مسلم إذا خرج رسول الله صلى الله عليه وسلم ولهذا قال تعالى \" انقروا خفافا وثقالا \" وقال \" ما كان لأهل المدينة ومن حولهم من الأعراب \" الآية قال فنسخ ذلك بهذه الآية وقد يقال إن هذا بيان لمراده تعالى من نفير الأحياء كلها وشرذمة من كل قبيلة إن لم يخرجوا كلهم ليتفقه الخارجون مع الرسول بما ينزل من الوحي عليه وينذروا قومهم إذا رجعوا إليهم بما كان من أمر العدو فيجتمع لهم الأمران في هذا النفير المعين وبعده صلى الله عليه وسلم تكون الطائفة النافرة من الحي إما للتفقه وإما للجهاد فإنه فرض كفاية على الأحياء وقال علي بن أبي طلحة عن ابن عباس في الآية \" وما كان المؤمنون لينفروا كافة \" يقول ما كان المؤمنون لينفروا جميعا ويتركوا النبي صلى الله عليه وسلم وحده \" فلولا نفر من كل فرقة منهم طائفة \" يعني عصبة يعني السرايا ولا يسيروا إلا بإذنه فإذا رجعت السرايا وقد أنزل بعدهم قرآن تعلمه القاعدون مع النبي صلى الله عليه وسلم وقالوا إن الله قد أنزل على نبيكم قرآنا وقد تعلمناه فتمكث السرايا ليتعلمون ما أنزل الله على نبيهم بعدهم ويبعث سرايا أخرى فذلك قوله \" ليتفقهوا في الدين \" يقول ليتعلموا ما أنزل الله على نبيهم وليعلموا السرايا إذا رجعت إليهم \" لعلهم يحذرون \" وقال مجاهد نزلت هذه الآية في أناس من أصحاب النبي صلى الله عليه وسلم خرجوا في البوادي فأصابوا من الناس معروفا ومن الخصب ما ينتفعون به ودعوا من وجدوا من الناس إلى الهدى فقال الناس لهم ما نراكم إلا وقد تركتم أصحابكم وجئتمونا لوجدوا في أنفسهم من ذلك تحرجا وأقبلوا من البادية كلهم حتى دخلوا على النبي صلى الله عليه وسلم فقال الله عز وجل \" فلولا نفر من كل فرقة منهم طائفة \" يبغون الخير \" ليتفقهوا في الدين \" وليستمعوا ما في الناس وما أنزل الله فعذرهم \" ولينذروا قومهم \" الناس كلهم إذا رجعوا إليهم \" لعلهم يحذرون \" وقال قتادة في الأية هذا إذا بعث رسول الله صلى الله عليه وسلم الجيوش أمرهم الله أن يغزو بنبيه صلى الله عليه وسلم وتقيم طائفة مع رسول الله صلى الله عليه وسلم تتفقه في الدين وتنطلق طائفة تدعو قومها وتحذرهم وقائع الله فيمن خلا قبلهم وقال الضحاك: كان رسول الله صلى الله عليه وسلم إذا غزا بنفسه لم يحل لأحد من المسلمين أن يتخلف عنه إلا أهل الأعذار وكان إذا قام وأسرى السرايا لم يحل لهم أن ينطلقوا إلا بإذنه وكان الرجل إذا أسرى فنزل بعده قرآن وتلاه نبي الله صلى الله عليه وسلم على أصحابه القاعدين معه فإذا رجعت السرية قال لهم الذين أقاموا مع رسول الله صلى الله عليه وسلم إن الله أنزل بعدكم على نبيه قرآنا فيقرئونهم ويفقهونهم في الدين وهو قوله \" وما كان المؤمنون لينفروا كافة \" يقول إذا قام رسول الله صلى الله عليه وسلم \" فلولا نفر من كل فرقة منهم طائفة \" يعني بذلك أنه لا ينبغي للمسلمين أن ينفروا جميعا ونبي الله صلى الله عليه وسلم قاعد; ولكن إذا قعد نبي الله فسرت السرايا وقعد معه معظم الناس. وقال علي بن أبي طلحة أيضا عن ابن عباس في الآية قوله \" وما كان المؤمنون لينفروا كافة \" إنها ليست في الجهاد ولكن لما دعا رسول الله صلى الله عليه وسلم على مضر بالسنين أجدبت بلادهم وكانت القبيلة منهم تقبل بأسرها حتى يحلوا بالمدينة من الجهد ويعتلوا بالإسلام وهم كاذبون فضيقوا على أصحاب رسول الله صلى الله عليه وسلم وأجهدوهم فأنزل الله تعالى يخبر رسوله أنهم ليسوا مؤمنين فردهم رسول الله إلى عشائرهم وحذر قومهم أن يفعلوا فعلهم فذلك قوله \" ولينذروا قومهم إذا رجعوا إليهم \" الآية وقال العوفي عن ابن عباس في هذه الآية: كان ينطلق من كل حي من العرب عصابة فيأتون النبي صلى الله عليه وسلم فيسألونه عما يريدون من أمر دينهم ويتفقهون في دينهم ويقولون للنبي صلى الله عليه وسلم ما تأمرنا أن نفعله؟ وأخبرنا بما نأمر به عشائرنا إذا قدمنا عليهم قال: فيأمرهم نبي الله صلى الله عليه وسلم بطاعة الله وطاعة رسوله ويبعثهم إلى قومهم بالصلاة والزكاة وكانوا إذا أتوا قومهم قالوا إن من أسلم فهو منا وينذرونهم حتى إن الرجل ليفارق أباه وأمه وكان النبي صلى الله عليه وسلم يخبرهم وينذرهم قومهم فإذا رجعوا إليهم يدعونهم إلى الإسلام وينذرونهم النار ويبشرونهم بالجنة; وقال عكرمة لما نزلت هذه الآية \" إلا تنفروا يعذبكم عذابا أليما \" \" وما كان لأهل المدينة \" الآية قال المنافقون هلك أصحاب البدو الذين تخلفوا عن محمد ولم ينفروا معه وقد كان ناس من أصحاب النبي صلى الله عليه وسلم خرجوا إلى البدو إلى قومهم يفقهونهم فأنزل الله عز وجل \" وما كان المؤمنون لينفروا كافة \" الآية ونزلت \" والذين يحاجون في الله من بعد ما استجيب له حجتهم داحضة عند ربهم وعليهم غضب ولهم عذاب شديد \" وقال الحسن البصري في الآية: ليتفقه الذين خرجوا بما يريهم الله من الظهور على المشركين والنصرة وينذروا قومهم إذا رجعوا إليهم."
    },
    {
      "ayah": 123,
      "surah": 9,
      "text": "أمر الله تعالى المؤمنين أن يقاتلوا الكفار أولا فأولا الأقرب فالأقرب إلى حوزة الإسلام ولهذا بدأ رسول الله صلى الله عليه وسلم بقتال المشركين في جزيرة العرب فلما فرغ منهم وفتح الله عليه مكة والمدينة والطائف واليمن واليمامة وهجر وخيبر وحضرموت وغير ذلك من أقاليم جزيرة العرب ودخل الناس من سائر أحياء العرب في دين الله أفواجا شرع في قتال أهل الكتاب فتجهز لغزو الروم الذين هم أقرب الناس إلى جزيرة العرب وأولى الناس بالدعوة إلى الإسلام لأنهم أهل الكتاب فبلغ تبوك ثم رجع لأجل جهد الناس وجدب البلاد وضيق الحال وذلك سنة تسع من هجرته عليه السلام. ثم اشتغل في السنة العاشرة بحجة الوداع ثم عاجلته المنية صلوات الله وسلامه عليه بعد حجته بأحد وثمانين يوما فاختاره الله لما عنده وقام بالأمر بعده وزيره وصديقه وخليفته أبو بكر الصديق رضي الله عنه وقد مال الدين ميلة كاد أن ينجفل فثبته الله تعالى به فوطد القواعد وثبت الدعائم ورد شارد الدين وهو راغم ورد أهل الردة إلى الإسلام وأخذ الزكاة ممن منعها من الطغاة وبين الحق لمن جهله. وأدى عن الرسول ما حمله ثم شرع في تجهيز الجيوش الإسلامية إلى الروم عبدة الصلبان وإلى الفرس عبدة النيران ففتح الله ببركة سفارته البلاد وأرغم أنف كسرى وقيصر ومن أطاعهما من العباد وأنفق كنوزهما في سبيل الله كما أخبر بذلك رسول الله وكان تمام الأمر على يدي وصيه من بعده وولى عهده الفاروق الأواب شهيد المحراب أبي حفص عمر بن الخطاب رضي الله عنه فأرغم الله به أنوف الكفرة الملحدين وقمع الطغاة والمنافقين واستولى على الممالك شرقا وغربا. وحملت إليه خزائن الأموال من سائر الأقاليم بعدا وقربا. ففرقها على الوجه الشرعي والسبيل المرضي. ثم لما مات شهيدا. وقد عاش حميدا أجمع الصحابة من المهاجرين والأنصار على خلافة أمير المؤمنين عثمان بن عفان رضي الله عنه شهيد الدار فكسى الإسلام رياسة حلة سابغة وامتدت الدعوة في سائر الأقاليم على رقاب العباد حجة الله البالغة. فظهر الإسلام في مشارق الأرض ومغاربها وعلت كلمة الله وظهر دينه وبلغت الملة الحنيفية من أعداء الله غاية مآربها وكلما علوا أمة انتقلوا إلى من بعدهم ثم الذين يلونهم من العتاة الفجار امتثالا لقوله تعالى \" يا أيها الذين آمنوا قاتلوا الذين يلونكم من الكفار \" وقوله تعالى \" وليجدوا فيكم غلظة \" أي وليجد الكفار منكم غلظة عليهم في قتالكم لهم فإن المؤمن الكامل هو الذي يكون رفيقا لأخيه المؤمن غليظا على عدوه الكافر كقوله تعالى \" فسوف يأتي الله بقوم يحبهم ويحبونه أذلة على المؤمنين أعزة غلى الكافرين \" فقوله تعالى \" محمد رسول الله والذين معه أشداء على الكفار رحماء بينهم \" وقال تعالى \" يا أيها النبي جاهد الكفار والمنافقين واغلظ عليهم \" وفي الحديث أن رسول الله صلى الله عليه وسلم قال \" أنا الضحوك القتال \" يعني أنه ضحوك في وجه وليه قتال لهامة عدوه وقوله \" واعلموا أن الله مع المتقين \" أي قاتلوا الكفار وتوكلوا على الله واعلموا أن الله معكم إذا اتقيتموه وأطعتموه وهكذا الأمر لما كانت القرون الثلاثة الذين هم خير هذه الأمة في غاية الاستقامة والقيام بطاعة الله تعالى لم يزالوا ظاهرين على عدوهم. ولم تزل الفتوحات كثيرة ولم تزل الأعداء في سفال وخسار ثم لما وقعت الفتن والأهواء والاختلافات بين الملوك طمع الأعداء في أطراف البلاد وتقدموا إليها فلم يمانعوا لشغل الملوك بعضهم ببعض ثم تقدموا إلى حوزة الإسلام فأخذوا من الأطراف بلدانا كثيرة ثم لم يزالوا حتى استحوذوا على كثير من بلاد الإسلام وللّه الأمر من قبل ومن بعد; فكلما قام ملك من ملوك الإسلام وأطاع أوامر الله وتوكل على الله فتح الله عليه من البلاد واسترجع من الأعداء بحسبه وبقدر ما فيه من ولاية الله والله المسئول المأمول أن يمكن المسلمين من نواصي أعدائه الكافرين وأن يعلي كلمتهم في سائر الأقاليم إنه جواد كريم."
    },
    {
      "ayah": 124,
      "surah": 9,
      "text": "يقول تعالى \" وإذا ما أنزلت سورة \" فمن المنافقين \" من يقول أيكم زادته هذة إيمانا \" أي يقول بعضهم لبعض أيكم زادته هذه السورة إيمانا قال الله تعالى \" فأما الذين آمنوا فزادتهم إيمانا وهم يستبشرون \" وهذه الآية من أكبر الدلائل على أن الإيمان يزيد وينقص كما هو مذهب أكثر السلف والخلف من أئمة العلماء. بل قد حكى غير واحد الإجماع على ذلك."
    },
    {
      "ayah": 125,
      "surah": 9,
      "text": "وقد بسطت الكلام على هذه المسألة في أول شرح البخاري رحمه الله \" وأما الذين في قلوبهم مرض فزادتهم رجسا إلى رجسهم \" أي زادتهم شكا إلى شكهم وريبا إلى ريبهم كما قال تعالى \" وننزل من القرآن ما هو شفاء \" الآية وقوله \" قل هو للذين آمنوا هدى وشفاء والذين لا يؤمنون في آذانهم وقر وهو عليهم عمى أولئك ينادون من مكان بعيد \" وهذا من جملة شقائهم أن ما يهدي القلوب يكون سببا لضلالهم ودمارهم كما أن سيء المزاج لو غذي بما غذي به لا يزيده إلا خبالا ونقصا."
    },
    {
      "ayah": 126,
      "surah": 9,
      "text": "يقول تعالى أَوَ لا يرى هؤلاء المنافقون \" أنهم يفتنون \" أي يختبرون \" في كل عام مرة أو مرتين ثم لا يتوبون ولا هم يذكرون \" أي لا يتوبون من ذنوبهم السالفة ولا هم يذكرون فيما يستقبل من أحوالهم قال مجاهد: يختبرون بالسنة والجوع. وقال قتادة: بالغزو في السنة مرة أو مرتين. وقال شريك عن جابر عن الجعفي عن أبي الضحى عن حذيقة في قوله \" أو لا يرون أنكم يفتنون في كل عام مرة أو مرتين \" قال كنا نسمع في كل عام كذبة أو كذبتين فيضل بها فئام من الناس كثير رواه ابن جرير. وفي الحديث عن أنس: لا يزداد الأمر إلا شدة ولا يزداد الناس إلا شحا وما من عام إلا والذي بعده شر منه. سمعته من نبيكم صلى الله عليه وسلم."
    },
    {
      "ayah": 127,
      "surah": 9,
      "text": "وقوله \" وإذا ما أنزلت سورة نظر بعضهم إلى بعض هل يراكم من أحد ثم انصرفوا صرف الله قلوبهم بأنهم قوم لا يفقهون \" هذا أيضا إخبار عن المنافقين أنهم إذا أنزلت سورة على رسول الله صلى الله عليه وسلم \" نظر بعضهم إلى بعض \" أي تلفتوا \" هل يراكم من أحد ثم انصرفوا \" أي تولوا عن الحق وانصرفوا عنه وهذا حالهم في الدنيا لا يثبتون عند الحق ولا يقبلونه ولا يفهمونه كقوله تعالى \" فما لهم عن التذكرة معرضين كأنهم حمر مستنفرة فرت من قسورة \" وقوله تعالى \" فما للذين كفروا قبلك مهطعين عن اليمين وعن الشمال عزين \" أي ما لهؤلاء القوم يتفللون عنك يمينا وشمالا هروبا من الحق وذهابا إلى الباطل وقوله \" ثم انصرفوا صرف الله قلوبهم \" كقوله \" فلما زاغوا أزاغ الله قلوبهم بأنهم فوم لا يفقهون \" أي لا يفهمون عن الله خطابه ولا يقصدون لفهمه ولا يريدونه بل هم في شغل عنه ونفور منه فلهذا صاروا إلى ما صاروا إليه."
    },
    {
      "ayah": 128,
      "surah": 9,
      "text": "يقول تعالى ممتنا على المؤمنين بما أرسل إليهم رسولا من أنفسهم أي من جنسهم وعلى لغتهم كما قال إبراهيم عليه السلام \" ربنا وابعث فيهم رسولا منهم \" وقال تعالى \" لقد من الله على المؤمنين إذ بعث فيهم رسولا من أنفسهم \" وقال تعالى \" لقد جاءكم رسول من أنفسكم \" أي منكم وبلغتكم كما قال جعفر بن أبي طالب رضي الله عنه للنجاشي والمغيرة بن شعبة لرسول كسرى: إن الله بعث فينا رسولا منا نعرف نسبه وصفته ومدخله ومخرجه وصدقه وأمانته وذكر الحديث. وقال سفيان بن عيينة عن جعفر بن محمد عن أبيه في قوله تعالى \" لقد جاءكم رسول من أنفسكم \" قال لم يصبه شيء من ولادة الجاهلية وقال صلى الله عليه وسلم \" خرجت من نكاح ولم أخرج من سفاح \" وقد وصل هذا من وجه آخر كما قال الحافظ أبو محمد الحسن بن عبدالرحمن الرامهرمزي في كتابه الفاصل بين الراوي والواعي. حدثنا ابن أحمد يوسف بن هارون بن زياد حدثنا ابن أبي عمر حدثنا محمد بن جعفر بن محمد قال: أشهد على أبي لحدثني عن أبيه عن جده عن علي قال: قال رسول الله صلى الله عليه وسلم \" خرجت من نكاح ولم أخرج من سفاح من لدن آدم إلى أن ولدني أبي وأمي لم يمسني من سفاح الجاهلية شيء \" وقوله تعالى \" عزيز عليه ما عنتم \" أي يعز عليه الشيء الذي يعنت أمته ويشق عليها ولهذا جاء في الحديث المروي من طرق عنه أنه قال \" بعثت بالحنيفية السمحة \" وفي الصحيح \" إن الدين يسر \" وشريعته كلها سهلة سمحة كاملة يسيرة على من يسرها الله تعالى عليه \" حريص عليكم \" أي على هدايتكم ووصول النفع الدنيوي والأخروي إليكم وقال الطبراني: حدثنا محمد بن عبدالله الحضرمي حدثنا محمد بن عبدالله بن يزيد المقري حدثنا سفيان بن عيينة عن قطن عن أبي الطفيل عن أبي ذر قال: تركنا رسول الله صلى الله عليه وسلم وما طائر يقلب جناحيه في الهواء إلا وهو يذكر لنا منه علما قال وقال رسول الله صلى الله عليه وسلم \" ما بقي شيء يقرب من الجنة ويباعد من النار إلا وقد بين لكم \" وقال الإمام أحمد: حدثنا قطن حدثنا المسعودي عن الحسن بن سعيد عن عبدة الهذلي عن عبدالله بن مسعود قال: قال رسول الله صلى الله عليه وسلم \" إن الله لم يحرم حرمة إلا وقد علم أنه سيطلعها منكم مطلع ألا وإني آخذ بحجزكم أن تهافتوا في النار كتهافت الفراش أو الذباب \" وقال الإمام أحمد: حدثنا حسن بن موسى حدثنا حماد بن سلمة عن علي بن زيد بن جدعان عن يوسف بن مهران عن ابن عباس أن رسول الله صلى الله عليه وسلم أتاه ملكان فيما يرى النائم فقعد أحدهما عند رجليه والآخر عند رأسه. فقال الذي عند رجليه للذي عند رأسه اضرب مثل هذا ومثل أمته فقال: إن مثله ومثل أمته كمثل قوم سفر انتهوا إلى رأس مفازة ولم يكن معهم من الزاد ما يقطعون به المفازة ولا ما يرجعون به فبينما هم كذلك إذ أتاهم رجل في حلة حبرة فقال: أرأيتم إن وردت بكم رياضا معشبة وحياضا رواة تتبعوني؟ فقالوا نعم قال فانطلق بهم فأوردهم رياضا معشبة وحياضا رواء فأكلوا وشربوا وسمنوا فقال لهم: ألم ألفكم على تلك الحال فجعلتم لي إن وردت بكم رياضا معشبة وحياضا رواء أن تتبعوني؟ فقالوا بلى فقال: فإن بين أيديكم رياضا هي أعشب من هذه وحياضا هي أروى من هذه فاتبعوني فقالت طائفة بلى صدق والله لنتبعنه وقالت طائفة قد رضينا بهذا نقيم عليه. وقال البزار حدثنا سلمة بن شبيب وأحمد بن منصور قالا: حدثنا إبراهيم بن الحكم بن أبان حدثنا أبي عن عكرمة عن أبي هريرة رضي الله عنه أن أعرابيا جاء إلى رسول الله صلى الله عليه وسلم يستعينه في شيء قال عكرمة: أراه قال في دم فأعطاه رسول الله صلى الله عليه وسلم شيئا ثم قال \" أحسنت إليك؟ \" قال الأعرابي لا ولا أجملت فغضب بعض المسلمين وهموا أن يقوموا إليه فأشار رسول الله صلى الله عليه وسلم إليهم أن كفوا فلما قام رسول الله صلى الله عليه وسلم وبلغ إلى منزله دعا الأعرابي إلى البيت فقال \" إنما جئتنا تسألنا فأعطيناك فقلت ما قلت \" فزاده رسول الله صلى الله عليه وسلم شيئا وقال \" أحسنت إليك؟ \" فقال الأعرابي نعم فجزاك الله من أهل وعشيرة خيرا. قال النبي صلى الله عليه وسلم \" إنك جئتنا فسألتنا فأعطيناك فقلت ما قلت وفي أنفس أصحابي عليك من ذلك شيء فإذا جئت فقل بين أيديهم ما قلت بين يدي حتى يذهب عن صدورهم \" فقال نعم. فلما جاء الأعرابي قال رسول الله صلى الله عليه وسلم \" إن صاحبكم كان جاءك فسألنا فأعطيناه فقال ما قال وإنا قد دعوناه فأعطيناه فزعم أنه قد رضي كذلك يا أعرابي؟ \" فقال الأعرابي: نعم فجزاك الله من أهل وعشيرة خيرا. فقال النبي صلى الله عليه وسلم \" إن مثلي ومثل هذا الأعرابي كمثل رجل كانت له ناقة فشردت عليه فاتبعها الناس فلم يزيدوها إلا نفورا. فقال لهم صاحب الناقة خلوا بيني وبين ناقتي فأنا أرفق بها وأنا أعلم بها فتوجه إليها وأخذ لها من قشام الأرض ودعاها حتى جاءت واستجابت وشد عليها رحلها وإني لو أطعتكم حيث قال ما قال لدخل النار \" رواه البزار ثم قال لا نعلمه يروى إلا من هذا الوجه \" قلت \"وهو ضعيف بحال إبراهيم بن الحكم بن أبان والله أعلم وقوله \" بالمؤمنين رءوف رحيم \" كقوله \" واخفض جناحك لمن اتبعك من المؤمنين فإن عصوك فقل إني بريء مما تعملون وتوكل على العزيز \" الرحيم \"."
    },
    {
      "ayah": 129,
      "surah": 9,
      "text": "وهكذا أمره تعالى في هذه الآية الكريمة وهي قوله تعالى \" فإن تولوا \" أي تولوا عما جئتهم به من الشريعة العظيمة المطهرة الكاملة الشاملة \" فقل حسبي الله لا إله إلا هو \" أي الله كافي لا إله إلا هو عليه توكلت كما قال تعالى \" رب المشرق والمغرب لا إله إلا هو فاتخذه وكيلا \" \" وهو رب العرش العظيم \" أي هو مالك كل شيء وخالقه لأنه رب العرش العظيم الذي هو سقف المخلوقات وجميع الخلائق من السموات والأرضين وما فيهما وما بينهما تحت العرش مقهورون بقدرة الله تعالى وعلمه محيط بكل شيء وقدره نافذ في كل شيء وهو على كل شيء وكيل قال الإمام أحمد: حدثنا محمد بن أبي حدثنا بشر بن عمر حدثنا شعبة عن علي بن زيد عن يوسف بن مهران عن ابن عباس رضي الله عنهما عن أبي بن كعب قال: آخر آية نزلت من القرآن هذه الآية \" لقد جاءكم رسول من أنفسكم \" إلى آخر السورة. وقال عبدالله بن الإمام أحمد: حدثنا روح حدثنا عبد المؤمن حدثنا عمر بن شقيق حدثنا أبو جعفر الرازي عن الربيع بن أنس عن أبي العالية عن أبي بن كعب رضي الله عنهم أنهم جمعوا القرآن في مصاحف في خلافة أبي بكر رضي الله عنه فكان رجال يكتبون ويملي عليهم أبي بن كعب فلما انتهوا إلى هذه الآية من سورة براءة \" ثم انصرفوا صرف الله قلوبهم \" الآية فظنوا أن هذا آخر ما نزل من القرآن فقال لهم أبي بن كعب إن رسول الله صلى الله عليه وسلم أقرأني بعدها آيتين \" لقد جاءكم رسول من أنفسكم \" إلى آخر السورة قال هذا آخر ما نزل من القرآن فختم بما فتح به بالله الذي لا إله إلا هو وهو قول الله تعالى \" وما أرسلنا من قبلك من رسول إلا نوحي إليه أنه لا إله إلا أنا فاعبدون \" وهذا غريب أيضا وقال أحمد: حدثنا علي بن بحر حدثنا علي بن محمد بن سلمة عن محمد بن إسحق عن يحيى بن عباد عن أبيه عباد بن الزبير رضي الله عنه قال أتى الحارث بن خزيمة بهاتين الآيتين من آخر براءة \" لقد جاءكم رسول من أنفسكم \" إلى عبدالله بن عمر بن الخطاب فقال من معك على هذا؟ قال لا أدري والله إني لأشهد لسمعتها من رسول الله صلى الله عليه وآله وسلم ووعيتها وحفظتها فقال عمر: وأنا أشهد لسمعتها من رسول الله صلى الله عليه وسلم ثم قال: لو كانت ثلاث آيات لجعلتها سورة على حدة فانظروا سورة من القرآن فضعوها فيها فوضعوها في آخر براءة وقد تقدم الكلام أن عمر بن الخطاب هو الذي أشار على أبي بكر الصديق رضي الله عنهما بجمع القرآن فأمر زيد بن ثابت فجمعه وكان عمر يحضرهم وهم يكتبون ذلك. وفي الصحيح أن زيدا قال فوجدت آخر سورة براءة مع خزيمة بن ثابت أو أبي خزيمة وقد قدمنا أن جماعة من الصحابة تذكروا ذلك عند رسول الله صلى الله عليه وسلم كما قال خزيمة بن ثابت حين ابتدأهم بها والله أعلم. وقد روى أبو داود عن يزيد بن محمد عن عبدالرزاق بن عمر - وقال كان من ثقات المسلمين من المتعبدين - عن مدرك بن سعد قال يزيد شيخ ثقة عن يونس بن ميسرة عن أم الدرداء عن أبي الدرداء قال: \" من قال إذا أصبح وإذا أمسى حسبي الله لا إله إلا هو عليه توكلت وهو رب العرش العظيم سبع مرات إلا كفاه الله ما أهمة \"; وقد رواه ابن عساكر في ترجمة عبدالرزاق عن عمر هذا من رواية أبى زرعة الدمشقي عنه عن أبي سعد مدرك بن أبي سعد الفزاري عن يونس بن ميسرة بن حلبس عن أم الدرداء سمعت أبا الدرداء يقول \" ما من عبد يقول حسبي الله لا إله إلا هو عليه توكلت وهو رب العرش العظيم سبع مرات صادقا كان بها أو كاذبا إلا كفاه الله ما أهمه \" وهذه زيادة غريبة ثم رواه في ترجمة عبدالرزاق أبي محمد عن أحمد بن عبدالله بن عبدالرزاق عن جده عبدالرزاق بن عمر بسنده فرفعه فذكر مثله بالزيادة وهذا منكر والله أعلم. آخر تفسير سورة براءة ولله الحمد والمنة."
    },
    {
      "ayah": 13,
      "surah": 9,
      "text": "وهذا أيضا تهييج وتحضيض وإغراء على قتال المشركين الناكثين بأيمانهم الذين هموا بإخراج الرسول من مكة كما قال تعالى \" وإذ يمكر بك الذين كفروا ليثبتوك أو يقتلوك أو يخرجوك ويمكرون ويمكر الله والله خير الماكرين \" وقال تعالى \" يخرجون الرسول وإياكم أن تؤمنوا بالله ربكم \" الآية وقال تعالى وإن كادوا ليستفزونك من الأرض ليخرجوك منها \" الآية وقوله \" وهم بدؤكم أول مرة \" قيل المراد بذلك يوم بدر حين خرجا لنصر عيرهم فلما نجت وعلموا بذلك استمروا على وجههم طلبا للقتال بغيا وتكبرا كما تقدم بسط ذلك وقيل المراد نقضهم العهد وقتالهم مع حلفائهم بني بكر لخذاعة أحلاف رسول الله صلى الله عليه وسلم حتى سار إليهم رسول الله صلى الله عليه وسلم عام الفتح وكان ماكان والله أعلم ولله الحمد والمنة. وقوله \" أتخشونهم فالله أحق أن تخشوه إن كنتم مؤمنين \" يقول تعالى لا تخشوهم واخشون فأنا أهل أن يخشى العباد من سطوتي وعقوبتي فبيدي الأمر وما شئت كان وما لم أشأ لم يكن ثم قال تعالى عزيمة على المؤمنين وبيانا لحكمته فيما شرع لهم من الجهاد مع قدرته على إهلاك الأعداء بأمر من عنده."
    },
    {
      "ayah": 14,
      "surah": 9,
      "text": "\" قاتلوهم يعذبهم الله بأيديكم ويخزهم وينصركم عليهم ويشف صدور قوم مؤمنين \" وهذا عام في المؤمنين كلهم وقال مجاهد وعكرمة والسدي في هذه الآية \" ويشف صدور قوم مؤمنين \" يعني خزاعة."
    },
    {
      "ayah": 15,
      "surah": 9,
      "text": "وأعاد الضمير في قوله \" ويذهب غيظ قلوبهم \" عليهم أيضا. وقد ذكر ابن عساكر في ترجمة مؤذن لعمر بن عبد العزيز رضي الله عنه عن مسلم بن يسار عن عائشة رضي الله عنهما أن رسول الله صلى الله عليه وسلم كان إذا غضبت أخذ بأنفها وقال \" يا عويش قولي اللهم رب النبي محمد اغفر ذنبي وأذهب غيظ قلبي وأجرني من مضلات الفتن \" ساقه من طريق أبي أحمد الحاكم عن الباغندي عن هشام بن عمار حدثنا عبدالرحمن بن أبي الجوزاء عنه \" ويتوب الله على من يشاء \" أي من عباده \" والله عليم \" أي بما يصلح عباده \" حكيم \" في أفعاله وأقواله الكونية والشرعية فيفعل ما يشاء. ويحكم ما يريد وهو العادل الحاكم الذي لا يجور أبدا ولا يضيع مثقال ذرة من خير وشـر بل يجازي عليه في الدنيا والآخرة."
    },
    {
      "ayah": 16,
      "surah": 9,
      "text": "يقول تعالى: \" أم حسبتم \" أيها المؤمنين أن نترككم مهملين لا نختبركم بأمور يظهر فيها أهل العزم الصادق من الكاذب ولهذا قال \" ولما يعلم الله الذين جاهدوا منكم ولم يتخذوا من دون الله ولا رسوله ولا المؤمنين وليجة \" أي بطانة ودخيلة بل هم في الظاهر والباطن على النصح لله ولرسوله فاكتفى بأحد القسمين عن الآخر كما قال الشاعر: وما أدري إذا يممت أرضا أريد الخير أيهما يليني وقد قال الله تعالى في الآية الأخرى \" الم أحسب الناس أن يتركوا أن يقولوا آمنا وهم لا يفتنون؟ ولقد فتنا الذين من قبلهم فليعلمن الله الذين صدقوا وليعلمن الكاذبين \" وقال تعالى \" أم حسبتم أن تدخلوا الجنة؟ الآية وقال تعالى \" ما كان الله ليذر المؤمنين على ما أنتم عليه \" الآية والحاصل أنه تعالى لما شرع لعباده الجهاد بين أن له فيه حكمة وهو اختبار عبيده من يطيعه ممن يعصيه وهو تعالى العالم بما كان وما يكون وما لم يكن لو كان كيف كان يكون فيعلم الشيء قبل كونه ومع كونه على ما هو عليه لا إله إلا هو ولا رب سواه ولا راد لما قدره وأمضاه."
    },
    {
      "ayah": 17,
      "surah": 9,
      "text": "يقول تعالى: ما ينبغي للمشركين بالله أن يعمروا مساجد الله التي بنيت على اسمه وحده لا شريك له ومن قرأ مسجد الله فأراد به المسجد الحرام أشرف المساجد في الأرض الذي بني من أول يوم على عبادة الله وحده لا شريك له وأسسه خليل الرحمن هذا وهم شاهدون على أنفسهم بالكفر أي بحالهم. وقال لهم كما قال السدي: لو سألت النصراني ما دينك؟ لقال نصراني ولو سألت اليهودي ما دينك لقال يهودي والصابئي لقال صابئ والمشرك لقال مشرك \" أولئك حبطت أعمالهم \" أي بشركهم \" وفي النار هم خالدون \" وقال تعالى \" ومالهم ألا يعذبهم الله وهم يصدون عن المسجد الحرام وما كانوا أولياؤه إن أولياؤه إلا المتقون ولكن أكثرهم لا يعلمون \"."
    },
    {
      "ayah": 18,
      "surah": 9,
      "text": "ولهذا قال تعالى \" إنما يعمر مساجد الله من آمن بالله واليوم الآخر \" فشهد تعالى بالإيمان لعمار المساجد كما قال الإمام أحمد: حدثنا شريح حدثنا ابن وهب عن عمرو بن الحارث أن دراجا أبا السمح حدثه عن أبي الهيثم عن أبي سعيد الخدري أن رسول الله صلى الله عليه وسلم قال \" إذا رأيتم الرجل يعتاد المسجد فاشهدوا له بالإيمان \"قال تعالى \" إنما يعمر مساجد الله من آمن بالله واليوم الآخر \" ورواه الترمذي وابن مردويه والحاكم في مستدركه من حديث عبدالله بن وهب به. وقال عبدالرحمن بن حميد في مسنده حدثنا يونس بن محمد حدثنا صالح المري عن ثابت البناني عن ميمون بن سيارة وجعفر بن زيد عن أنس ابن مالك قال: قال رسول الله صلى الله عليه وسلم \" إنما عمار المساجد هم أهل الله \"ورواه الحافظ أبو بكر البزار عن عبد الواحد بن غياث عن صالح بن بشير المري عن ثابت عن أنس قال: قال رسول الله صلى الله عليه وسلم إنما عمار المساجد هم أهل الله. ثم قال: لا نعلم رواه عن ثابت غير صالح وقد روى الدارقطني في الأفراد من طريق حكامة بنت عثمان بن دينار عن أبيها عن أخيه مالك بن دينار عن أنس مرفوعا \" إذا أراد الله بقوم عاهة نظر إلى أهل المساجد فصرف عنهم \"ثم قال غريب وروى الحافظ البهائي في المستقصى عن أبيه بسنده إلى أبي أميه الطرسوسي حدثنا منصور بن صفير حدثنا صالح المري عن ثابت عن أنس مرفوعا يقول الله: وعزتي وجلالي إني لأهم بأهل الأرض عذابا فإذا نظرت إلى عمار بيوتي وإلى المتحابين في وإلى المستغفرين بالأسحار صرفت ذلك عنهم ثم قال ابن عساكر: حديث غريب وقال الإمام أحمد حدثنا روح حدثنا سعيد عن قتادة حدثنا العلاء بن زياد عن معاذ بن جبل أن النبي صلى الله عليه وسلم قال \" إن الشيطان ذئب الإنسان كذئب الغنم يأخذ الشاة القاصية والناحية فإياكم والشعاب وعليكم بالجماعة والعامة والمسجد وقال عبدالرازق عن معمر عن أبي إسحق عن عمرو بن ميمون الأودي قال: أدركت أصحاب محمد صلى الله عليه وسلم وهم يقولون إن المساجد بيوت الله في الأرض وإنه حق على الله أن يكرم من زاره فيها وقال المسعودي عن حبيب بن أبي ثابت وعدي بن ثابت عن سعيد بن جبير عن ابن عباس رضي الله عنهما قال: من سمع النداء بالصلاة ثم لم يجب ولم يأت المسجد ويصلي فلا صلاة له وقد عصى الله ورسوله قال الله تعالى \" إنما يعمر مساجد الله من آمن بالله واليوم الآخر \" الآية رواه ابن مردويه. وقد روى مرفوعا من وجه آخر وله شواهد من وجوه آخر ليس هذا موضع بسطها. وقوله \" وأقام الصلاة \" أي التي هي أكبر عبادات البدن \" وآتى الزكاة \" أي التي هي أفضل الأعمال المتعدية إلى بر الخلائق وقوله \" ولم يخش إلا الله \" أي ولم يخف إلا من الله تعالى ولم يخش سواه \" فعسى أولئك أن يكونوا من المهتدين \" قال ابن أبي طلحة عن ابن عباس في قوله \" إنما يعمر مساجد الله من آمن بالله واليوم الآخر \" يقول من وحد الله وآمن باليوم الآخر يقول من آمن بما أنزل الله \" وأقام الصلاة \" يعني الصلوات الخمس \" ولم يخش إلا الله \" يقول لم يعبد إلا الله ثم قال \" فعسى أولئك أن يكونوا من المهتدين \" يقول تعالى إن أولئك هم المفلحون كقوله لنبيه صلى الله عليه وسلم \" عسى أن يبعثك ربك مقاما محمودا \" وهي الشفاعة وكل عسى في القرآن فهي واجبة وقال محمد بن إسحق بن يسار رحمه الله: وعسى من حق الله."
    },
    {
      "ayah": 19,
      "surah": 9,
      "text": "قال العوفي في تفسيره عن ابن عباس في تفسيره هذه الآية قال: إن المشركين قالوا عمارة بيت الله وقيام على السقاية خير ممن آمن وجاهد وكانوا يفخرون بالحرم ويستكبرون به من أجل أنهم أهله وعماره فذكر الله استكبارهم وإعراضهم فقال لأهل الحرم من المشركين \" قد كانت آياتي تتلى عليكم فكنتم على أعقابكم تنكصون مستكبرين به سامرا تهجرون \" يعني أنهم كانوا يستكبرون بالحرم قال \" به سامرا \" كانوا يسمرون به ويهجرون القرآن والنبي صلى الله عليه وسلم فخير الله الإيمان والجهاد مع النبي صلى الله عليه وسلم على عمارة المشركين البيت وقيامهم على السقاية ولم يكن ينفعهم عند الله مع الشرك به وإن كانوا يعمرون بيته ويحرمون به. قال الله تعالى \" لا يستوون عند الله والله لا يهدي القوم الظالمين \" يعني الذين زعموا أنهم أهل العمارة فسماهم الله ظالمين بشركهم فلم تغن عنهم العمارة شيئا. وقال علي بن أبي طلحة عن ابن عباس في تفسير هذه الآية قال: قد نزلت في العباس بن عبد المطلب حين أسر ببدر قال لئن كنتم سبقتمونا بالإسلام والهجرة والجهاد لقد كنا نعمر المسجد الحرام نسقي ونفك العاني قال الله عز وجل \" أجعلتم سقاية الحاج\" - إلى قوله -\" والله لا يهدي القوم الظالمين \" يعني أن ذلك كله كان في الشرك ولا أقبل ما كان في الشرك وقال الضحاك بن مزاحم أقبل المسلمون على العباس وأصحابه الذين أسروا يوم بدر يعيرونهم بالشرك فقال العباس أما والله لقد كنا نعمر المسجد الحرام ونفك العاني ونحجب البيت ونسقي الحاج فأنزل الله \" أجعلتم سقاية الحاج \" الآية. وقال عبدالرزاق: أخبرنا ابن عيينة عن إسماعيل عن الشعبي قال: نزلت في علي والعباس رضي الله عنهما بما تكلما في ذلك. وقال ابن جرير: حدثنا يونس أخبرنا ابن وهب أخبرني ابن لهيعة عن أبي صخر قال: سمعت محمد بن كعب القرظي يقول: افتخر طلحة بن شيبة من بني عبد الدار وعباس بن عبد المطلب وعلي بن أبي طالب فقال طلحة أنا صاحب البيت معي مفتاحه ولو أشاء بت فيه وقال العباس أنا صاحب السقاية والقائم عليها ولو أشاء بت في المسجد فقال علي رضي الله عنه ما أدري ما تقولان لقد صليت إلى القبلة ستة أشهر قبل الناس وأنا صاحب الجهاد فأنزل الله عز وجل \" أجعلتم سقاية الحاج \" الآية كلها وهكذا قال السدي إلا أنه قال: افتخر علي والعباس وشيبة بن عثمان وذكر نحوه وقال عبدالرزاق: أخبرنا معمر عن عمرو عن الحسن قال: نزلت في علي وعباس وشيبة تكلموا في ذلك فقال العباس ما أراني إلا أني تارك سقايتنا فقال رسول الله صلى الله عليه وسلم \" أقيموا على سقايتكم فإن لكم فيها خيرا \" ورواه محمد بن ثور عن معمر عن الحسن فذكر نحوه وقد ورد في تفسير هذه الآية حديث مرفوع فلابد من ذكره هنا قال عبدالرزاق أخبرنا معمر عن يحيى بن أبي كثير عن النعمان بن بشير رضي الله عنه أن رجلا قال: ما أبالي أن لا أعمل عملا بعد الإسلام إلا أن أسقي الحاج. وقال آخر: ما أبالي أن لا أعمل عملا بعد الإسلام إلا أن أعمر المسجد الحرام. وقال آخر: الجهاد في سبيل الله أفضل مما قلتم. فزجرهم عمر رضي الله عنه. وقال: لا ترفعوا أصواتكم عند منبر رسول الله صلى الله عليه وسلم وذلك يوم الجمعة ولكن إذا صلينا الجمعة دخلنا على النبي صلى الله عليه وسلم فسألناه. فنزلت \" أجعلتم سقاية الحاج وعمارة المسجد الحرام\" - إلى قوله -\"لا يستوون عند الله \". \" طريق أخرى \"قال الوليد بن مسلم: حدثتي معاوية بن سلام عن جده أبي سلام الأسود عن النعمان بن بشير الأنصاري قال: كنت عند منبر رسول الله صلى الله عليه وسلم في نفر من أصحابه فقال رجل منهم: ما أبالي أن لا أعمل لله عملا بعد الإسلام إلا أن أسقي الحاج. وقال آخر: بل عمارة المسجد الحرام. وقال آخر: بل الجهاد في سبيل الله خير مما قلتم فزجره عمر بن الخطاب رضي الله عنه وقال: لا ترفعوا أصواتكم عند منبر رسول الله صلى الله عليه وسلم وذلك يوم الجمعة ولكن إذا صليت الجمعة دخلت على رسول الله صلى الله عليه وسلم فاستفتيته فيما اختلفتم فيه. قال ففعل فأنزل الله عز وجل \" أجعلتم سقاية الحاج وعمارة المسجد الحرام\" - إلى قوله -\" والله لا يهدي القوم الظالمين \" ورواه مسلم في صحيحه وأبو داود وابن جرير وهذا لفظه وابن مردويه وابن أبي حاتم في تفاسيرهم وابن حبان في صحيحه."
    },
    {
      "ayah": 2,
      "surah": 9,
      "text": "\"فسيحوا في الأرض أربعة أشهر \" اختلف المفسرون ههنا اختلافا كثيرا فقال قائلون هذه الآية لذوي العهود المطلقة غير المؤقتة أو من له عهد دون أربعة أشهر فيكمل له أربعة أشهر فأما من كان له عهد مؤقت فأجله إلى مدته مهما كان لقوله تعالى \" فأتموا إليهم عهدهم إلى مدتهم \" الآية ولما سيأتي في الحديث ومن كان بينه وبين رسول الله صلى الله عليه وسلم عهد فعهده إلى مدته وهذا أحسن الأقوال وأقواها وقد اختاره ابن جرير رحمه الله وروي عن الكلبي ومحمد بن كعب القرظي وغير واحد. وقال علي بن أبي طلحة عن ابن عباس في قوله \" براءة من الله ورسوله إلى الذين عاهدتم من المشركين فسيحوا في الأرض أربعة أشهر \" الأية قال حد الله للذين عاهدوا رسوله أربعة أشهر يسيحون في الأرض حيث شاءوا وأجل أجل من ليس له عهـد انسلاخ الأشهر الحرم من يوم النحر إلى سلخ المحرم فذلك خمسون ليلة فأمر الله نبيه إذا انسلخ المحرم أن يضع السيف فيمن لم يكن بينه وبينه عهد يقتلهم حتى يدخلوا في الإسلام وأمر بمن كان له عهد إذا انسلخ أربعة أشهر من يوم النحر إلى عشر خلون من ربيع الآخر أن يضع فيهم السيف أيضا حتى يدخلوا في الإسلام وقال أبو معشر المدنى: حدثنا محمد بن كـعب القرظي وغيره قالوا: بعث رسول الله صلى الله عليه وسلم أبا بكر أميرا على الموسم سنة تسع وبعث علي بن أبي طالب بثلاثين آية أو أربعين آية من براءة فقرأها على الناس يؤجل المشركين أربعة أشهر يسيحون في الأرض فقرأها عليهم يوم عرفة أجلهم عشرين من ذي الحجة والمحرم وصفر وشهر ربيع الأول وعشرا من ربيع الآخر وقرأها عليهم في منازلهم وقال \" لا يحجن بعد عامنا هذا مشرك ولا يطوفن بالبيت عريان \"وقال ابن أبي نجيح عن مجاهد \" براءة من الله ورسوله \" إلى أهل العهد خزاعة ومدلج ومن كان له عهـد أو غيرهم فقفل رسول الله صلى الله عليه وسلم من تبوك حين فرغ فأراد رسول الله صلى الله عليه وسلم الحج ثم قال \" إنما يحضر المشركون فيطوفون عراة فلا أحب أن أحج حتى لا يكون ذلك \" فأرسل أبا بكر وعليا رضي الله عنهما فطافا بالناس في ذي المجاز وبأمكنتهم التي كانوا يتابعون بها وبالمواسم كلها فأذنوا أصحاب العهد بأن يوئقتوا أربعة أشهر فهي الأشهر المتواليات عشرون من ذي الحجة إلى عشر يخلون من ربيع الآخر ثم لا عهد لهم وآذن الناس كلهم بالقتال إلا أن يؤمنوا وهكذا روي عن السدي وقتادة وقال الزهري: كان ابتداء التأجيل من شوال وآخره سلخ المحرم وهذا القول غريب وكيف يحاسبون بمدة لم يبلغهم حكمها وإنما ظهر لهم أمرها يوم النحر حين نادى أصحاب رسول الله صلى الله عليه وسلم بذلك ولهذا قال تعالى:."
    },
    {
      "ayah": 20,
      "surah": 9,
      "text": "قال العوفي في تفسيره عن ابن عباس في تفسيره هذه الآية قال: إن المشركين قالوا عمارة بيت الله وقيام على السقاية خير ممن آمن وجاهد وكانوا يفخرون بالحرم ويستكبرون به من أجل أنهم أهله وعماره فذكر الله استكبارهم وإعراضهم فقال لأهل الحرم من المشركين \" قد كانت آياتي تتلى عليكم فكنتم على أعقابكم تنكصون مستكبرين به سامرا تهجرون \" يعني أنهم كانوا يستكبرون بالحرم قال \" به سامرا \" كانوا يسمرون به ويهجرون القرآن والنبي صلى الله عليه وسلم فخير الله الإيمان والجهاد مع النبي صلى الله عليه وسلم على عمارة المشركين البيت وقيامهم على السقاية ولم يكن ينفعهم عند الله مع الشرك به وإن كانوا يعمرون بيته ويحرمون به. قال الله تعالى \" لا يستوون عند الله والله لا يهدي القوم الظالمين \" يعني الذين زعموا أنهم أهل العمارة فسماهم الله ظالمين بشركهم فلم تغن عنهم العمارة شيئا. وقال علي بن أبي طلحة عن ابن عباس في تفسير هذه الآية قال: قد نزلت في العباس بن عبد المطلب حين أسر ببدر قال لئن كنتم سبقتمونا بالإسلام والهجرة والجهاد لقد كنا نعمر المسجد الحرام نسقي ونفك العاني قال الله عز وجل \" أجعلتم سقاية الحاج - إلى قوله - والله لا يهدي القوم الظالمين \" يعني أن ذلك كله كان في الشرك ولا أقبل ما كان في الشرك وقال الضحاك بن مزاحم أقبل المسلمون على العباس وأصحابه الذين أسروا يوم بدر يعيرونهم بالشرك فقال العباس أما والله لقد كنا نعمر المسجد الحرام ونفك العاني ونحجب البيت ونسقي الحاج فأنزل الله \" أجعلتم سقاية الحاج \" الآية. وقال عبدالرزاق: أخبرنا ابن عيينة عن إسماعيل عن الشعبي قال: نزلت في علي والعباس رضي الله عنهما بما تكلما في ذلك. وقال ابن جرير: حدثنا يونس أخبرنا ابن وهب أخبرني ابن لهيعة عن أبي صخر قال: سمعت محمد بن كعب القرظي يقول: افتخر طلحة بن شيبة من بني عبد الدار وعباس بن عبد المطلب وعلي بن أبي طالب فقال طلحة أنا صاحب البيت معي مفتاحه ولو أشاء بت فيه وقال العباس أنا صاحب السقاية والقائم عليها ولو أشاء بت في المسجد فقال علي رضي الله عنه ما أدري ما تقولان لقد صليت إلى القبلة ستة أشهر قبل الناس وأنا صاحب الجهاد فأنزل الله عز وجل \" أجعلتم سقاية الحاج \" الآية كلها وهكذا قال السدي إلا أنه قال: افتخر علي والعباس وشيبة بن عثمان وذكر نحوه وقال عبدالرزاق: أخبرنا معمر عن عمرو عن الحسن قال: نزلت في علي وعباس وشيبة تكلموا في ذلك فقال العباس ما أراني إلا أني تارك سقايتنا فقال رسول الله صلى الله عليه وسلم \" أقيموا على سقايتكم فإن لكم فيها خيرا \" ورواه محمد بن ثور عن معمر عن الحسن فذكر نحوه وقد ورد في تفسير هذه الآية حديث مرفوع فلابد من ذكره هنا قال عبدالرزاق أخبرنا معمر عن يحيى بن أبي كثير عن النعمان بن بشير رضي الله عنه أن رجلا قال: ما أبالي أن لا أعمل عملا بعد الإسلام إلا أن أسقي الحاج. وقال آخر: ما أبالي أن لا أعمل عملا بعد الإسلام إلا أن أعمر المسجد الحرام. وقال آخر: الجهاد في سبيل الله أفضل مما قلتم. فزجرهم عمر رضي الله عنه. وقال: لا ترفعوا أصواتكم عند منبر رسول الله صلى الله عليه وسلم وذلك يوم الجمعة ولكن إذا صلينا الجمعة دخلنا على النبي صلى الله عليه وسلم فسألناه. فنزلت \" أجعلتم سقاية الحاج وعمارة المسجد الحرام - إلى قوله -لا يستوون عند الله \". \" طريق أخرى \"قال الوليد بن مسلم: حدثتي معاوية بن سلام عن جده أبي سلام الأسود عن النعمان بن بشير الأنصاري قال: كنت عند منبر رسول الله صلى الله عليه وسلم في نفر من أصحابه فقال رجل منهم: ما أبالي أن لا أعمل لله عملا بعد الإسلام إلا أن أسقي الحاج. وقال آخر: بل عمارة المسجد الحرام. وقال آخر: بل الجهاد في سبيل الله خير مما قلتم فزجره عمر بن الخطاب رضي الله عنه وقال: لا ترفعوا أصواتكم عند منبر رسول الله صلى الله عليه وسلم وذلك يوم الجمعة ولكن إذا صليت الجمعة دخلت على رسول الله صلى الله عليه وسلم فاستفتيته فيما اختلفتم فيه. قال ففعل فأنزل الله عز وجل \" أجعلتم سقاية الحاج وعمارة المسجد الحرام - إلى قوله - والله لا يهدي القوم الظالمين \" ورواه مسلم في صحيحه وأبو داود وابن جرير وهذا لفظه وابن مردويه وابن أبي حاتم في تفاسيرهم وابن حبان في صحيحه."
    },
    {
      "ayah": 21,
      "surah": 9,
      "text": "قال العوفي في تفسيره عن ابن عباس في تفسيره هذه الآية قال: إن المشركين قالوا عمارة بيت الله وقيام على السقاية خير ممن آمن وجاهد وكانوا يفخرون بالحرم ويستكبرون به من أجل أنهم أهله وعماره فذكر الله استكبارهم وإعراضهم فقال لأهل الحرم من المشركين \" قد كانت آياتي تتلى عليكم فكنتم على أعقابكم تنكصون مستكبرين به سامرا تهجرون \" يعني أنهم كانوا يستكبرون بالحرم قال \" به سامرا \" كانوا يسمرون به ويهجرون القرآن والنبي صلى الله عليه وسلم فخير الله الإيمان والجهاد مع النبي صلى الله عليه وسلم على عمارة المشركين البيت وقيامهم على السقاية ولم يكن ينفعهم عند الله مع الشرك به وإن كانوا يعمرون بيته ويحرمون به. قال الله تعالى \" لا يستوون عند الله والله لا يهدي القوم الظالمين \" يعني الذين زعموا أنهم أهل العمارة فسماهم الله ظالمين بشركهم فلم تغن عنهم العمارة شيئا. وقال علي بن أبي طلحة عن ابن عباس في تفسير هذه الآية قال: قد نزلت في العباس بن عبد المطلب حين أسر ببدر قال لئن كنتم سبقتمونا بالإسلام والهجرة والجهاد لقد كنا نعمر المسجد الحرام نسقي ونفك العاني قال الله عز وجل \" أجعلتم سقاية الحاج - إلى قوله - والله لا يهدي القوم الظالمين \" يعني أن ذلك كله كان في الشرك ولا أقبل ما كان في الشرك وقال الضحاك بن مزاحم أقبل المسلمون على العباس وأصحابه الذين أسروا يوم بدر يعيرونهم بالشرك فقال العباس أما والله لقد كنا نعمر المسجد الحرام ونفك العاني ونحجب البيت ونسقي الحاج فأنزل الله \" أجعلتم سقاية الحاج \" الآية. وقال عبدالرزاق: أخبرنا ابن عيينة عن إسماعيل عن الشعبي قال: نزلت في علي والعباس رضي الله عنهما بما تكلما في ذلك. وقال ابن جرير: حدثنا يونس أخبرنا ابن وهب أخبرني ابن لهيعة عن أبي صخر قال: سمعت محمد بن كعب القرظي يقول: افتخر طلحة بن شيبة من بني عبد الدار وعباس بن عبد المطلب وعلي بن أبي طالب فقال طلحة أنا صاحب البيت معي مفتاحه ولو أشاء بت فيه وقال العباس أنا صاحب السقاية والقائم عليها ولو أشاء بت في المسجد فقال علي رضي الله عنه ما أدري ما تقولان لقد صليت إلى القبلة ستة أشهر قبل الناس وأنا صاحب الجهاد فأنزل الله عز وجل \" أجعلتم سقاية الحاج \" الآية كلها وهكذا قال السدي إلا أنه قال: افتخر علي والعباس وشيبة بن عثمان وذكر نحوه وقال عبدالرزاق: أخبرنا معمر عن عمرو عن الحسن قال: نزلت في علي وعباس وشيبة تكلموا في ذلك فقال العباس ما أراني إلا أني تارك سقايتنا فقال رسول الله صلى الله عليه وسلم \" أقيموا على سقايتكم فإن لكم فيها خيرا \" ورواه محمد بن ثور عن معمر عن الحسن فذكر نحوه وقد ورد في تفسير هذه الآية حديث مرفوع فلابد من ذكره هنا قال عبدالرزاق أخبرنا معمر عن يحيى بن أبي كثير عن النعمان بن بشير رضي الله عنه أن رجلا قال: ما أبالي أن لا أعمل عملا بعد الإسلام إلا أن أسقي الحاج. وقال آخر: ما أبالي أن لا أعمل عملا بعد الإسلام إلا أن أعمر المسجد الحرام. وقال آخر: الجهاد في سبيل الله أفضل مما قلتم. فزجرهم عمر رضي الله عنه. وقال: لا ترفعوا أصواتكم عند منبر رسول الله صلى الله عليه وسلم وذلك يوم الجمعة ولكن إذا صلينا الجمعة دخلنا على النبي صلى الله عليه وسلم فسألناه. فنزلت \" أجعلتم سقاية الحاج وعمارة المسجد الحرام - إلى قوله -لا يستوون عند الله \". \" طريق أخرى \"قال الوليد بن مسلم: حدثتي معاوية بن سلام عن جده أبي سلام الأسود عن النعمان بن بشير الأنصاري قال: كنت عند منبر رسول الله صلى الله عليه وسلم في نفر من أصحابه فقال رجل منهم: ما أبالي أن لا أعمل لله عملا بعد الإسلام إلا أن أسقي الحاج. وقال آخر: بل عمارة المسجد الحرام. وقال آخر: بل الجهاد في سبيل الله خير مما قلتم فزجره عمر بن الخطاب رضي الله عنه وقال: لا ترفعوا أصواتكم عند منبر رسول الله صلى الله عليه وسلم وذلك يوم الجمعة ولكن إذا صليت الجمعة دخلت على رسول الله صلى الله عليه وسلم فاستفتيته فيما اختلفتم فيه. قال ففعل فأنزل الله عز وجل \" أجعلتم سقاية الحاج وعمارة المسجد الحرام - إلى قوله - والله لا يهدي القوم الظالمين \" ورواه مسلم في صحيحه وأبو داود وابن جرير وهذا لفظه وابن مردويه وابن أبي حاتم في تفاسيرهم وابن حبان في صحيحه."
    },
    {
      "ayah": 22,
      "surah": 9,
      "text": "قال العوفي في تفسيره عن ابن عباس في تفسيره هذه الآية قال: إن المشركين قالوا عمارة بيت الله وقيام على السقاية خير ممن آمن وجاهد وكانوا يفخرون بالحرم ويستكبرون به من أجل أنهم أهله وعماره فذكر الله استكبارهم وإعراضهم فقال لأهل الحرم من المشركين \" قد كانت آياتي تتلى عليكم فكنتم على أعقابكم تنكصون مستكبرين به سامرا تهجرون \" يعني أنهم كانوا يستكبرون بالحرم قال \" به سامرا \" كانوا يسمرون به ويهجرون القرآن والنبي صلى الله عليه وسلم فخير الله الإيمان والجهاد مع النبي صلى الله عليه وسلم على عمارة المشركين البيت وقيامهم على السقاية ولم يكن ينفعهم عند الله مع الشرك به وإن كانوا يعمرون بيته ويحرمون به. قال الله تعالى \" لا يستوون عند الله والله لا يهدي القوم الظالمين \" يعني الذين زعموا أنهم أهل العمارة فسماهم الله ظالمين بشركهم فلم تغن عنهم العمارة شيئا. وقال علي بن أبي طلحة عن ابن عباس في تفسير هذه الآية قال: قد نزلت في العباس بن عبد المطلب حين أسر ببدر قال لئن كنتم سبقتمونا بالإسلام والهجرة والجهاد لقد كنا نعمر المسجد الحرام نسقي ونفك العاني قال الله عز وجل \" أجعلتم سقاية الحاج - إلى قوله - والله لا يهدي القوم الظالمين \" يعني أن ذلك كله كان في الشرك ولا أقبل ما كان في الشرك وقال الضحاك بن مزاحم أقبل المسلمون على العباس وأصحابه الذين أسروا يوم بدر يعيرونهم بالشرك فقال العباس أما والله لقد كنا نعمر المسجد الحرام ونفك العاني ونحجب البيت ونسقي الحاج فأنزل الله \" أجعلتم سقاية الحاج \" الآية. وقال عبدالرزاق: أخبرنا ابن عيينة عن إسماعيل عن الشعبي قال: نزلت في علي والعباس رضي الله عنهما بما تكلما في ذلك. وقال ابن جرير: حدثنا يونس أخبرنا ابن وهب أخبرني ابن لهيعة عن أبي صخر قال: سمعت محمد بن كعب القرظي يقول: افتخر طلحة بن شيبة من بني عبد الدار وعباس بن عبد المطلب وعلي بن أبي طالب فقال طلحة أنا صاحب البيت معي مفتاحه ولو أشاء بت فيه وقال العباس أنا صاحب السقاية والقائم عليها ولو أشاء بت في المسجد فقال علي رضي الله عنه ما أدري ما تقولان لقد صليت إلى القبلة ستة أشهر قبل الناس وأنا صاحب الجهاد فأنزل الله عز وجل \" أجعلتم سقاية الحاج \" الآية كلها وهكذا قال السدي إلا أنه قال: افتخر علي والعباس وشيبة بن عثمان وذكر نحوه وقال عبدالرزاق: أخبرنا معمر عن عمرو عن الحسن قال: نزلت في علي وعباس وشيبة تكلموا في ذلك فقال العباس ما أراني إلا أني تارك سقايتنا فقال رسول الله صلى الله عليه وسلم \" أقيموا على سقايتكم فإن لكم فيها خيرا \" ورواه محمد بن ثور عن معمر عن الحسن فذكر نحوه وقد ورد في تفسير هذه الآية حديث مرفوع فلابد من ذكره هنا قال عبدالرزاق أخبرنا معمر عن يحيى بن أبي كثير عن النعمان بن بشير رضي الله عنه أن رجلا قال: ما أبالي أن لا أعمل عملا بعد الإسلام إلا أن أسقي الحاج. وقال آخر: ما أبالي أن لا أعمل عملا بعد الإسلام إلا أن أعمر المسجد الحرام. وقال آخر: الجهاد في سبيل الله أفضل مما قلتم. فزجرهم عمر رضي الله عنه. وقال: لا ترفعوا أصواتكم عند منبر رسول الله صلى الله عليه وسلم وذلك يوم الجمعة ولكن إذا صلينا الجمعة دخلنا على النبي صلى الله عليه وسلم فسألناه. فنزلت \" أجعلتم سقاية الحاج وعمارة المسجد الحرام - إلى قوله -لا يستوون عند الله \". \" طريق أخرى \"قال الوليد بن مسلم: حدثتي معاوية بن سلام عن جده أبي سلام الأسود عن النعمان بن بشير الأنصاري قال: كنت عند منبر رسول الله صلى الله عليه وسلم في نفر من أصحابه فقال رجل منهم: ما أبالي أن لا أعمل لله عملا بعد الإسلام إلا أن أسقي الحاج. وقال آخر: بل عمارة المسجد الحرام. وقال آخر: بل الجهاد في سبيل الله خير مما قلتم فزجره عمر بن الخطاب رضي الله عنه وقال: لا ترفعوا أصواتكم عند منبر رسول الله صلى الله عليه وسلم وذلك يوم الجمعة ولكن إذا صليت الجمعة دخلت على رسول الله صلى الله عليه وسلم فاستفتيته فيما اختلفتم فيه. قال ففعل فأنزل الله عز وجل \" أجعلتم سقاية الحاج وعمارة المسجد الحرام - إلى قوله - والله لا يهدي القوم الظالمين \" ورواه مسلم في صحيحه وأبو داود وابن جرير وهذا لفظه وابن مردويه وابن أبي حاتم في تفاسيرهم وابن حبان في صحيحه."
    },
    {
      "ayah": 23,
      "surah": 9,
      "text": "أمر الله تعالى بمباينة الكفار وإن كانوا آباء أو أبناء ونهى عن موالاتهم إن استحبوا أي اختاروا الكفر على الإيمان وتوعد على ذلك كقوله تعالى \" لا تجد قوما يؤمنون بالله واليوم الآخر يوادون من حاد الله ورسوله ولو كانوا آباءهم أو أبناءهم أو إخوانهم أو عشيرتهم أولئك كتب في قلوبهم الإيمان وأيدهم بروح منه ويدخلهم جنات تجري من تحتها الأنهار \" الآية. وروى الحافظ البيهقي من حديث عبدالله بن شوذب قال: جعل أبي أبو عبيدة بن الجراح ينعت له الآلهة يوم بدر وجعل أبو عبيدة يحيد عنه فلما أكثر الجراح قصده ابنه أبو عبيدة فقتله فأنزل الله فيه هذه الآية \" لا تجد قوما يؤمنون بالله واليوم الآخر يوادون من حاد الله ورسوله \" الآية."
    },
    {
      "ayah": 24,
      "surah": 9,
      "text": "ثم أمر تعالى رسوله أن يتوعد من آثر أهله وقرابته وعشيرته على الله ورسوله وجهاد في سبيله فقال \" وتجارة تخشون كسادها ومساكن ترضونها \" أي تحبونها لطيبها وحسنها أي إن كانت هذه الأشياء \" أحب إليكم من الله ورسوله وجهاد في سبيله فتربصوا\" أي فانتظروا ماذا يحل بكم من عقابه ونكاله بكم. ولهذا قال \" حتى يأتي الله بأمره والله لا يهدي القوم الفاسقين \" وقال الإمام أحمد: حدثنا قتيبة بن سعيد حدثنا ابن لهيعة عن زهرة بن معبد عن جده قال: كنا مع رسول الله صلى الله عليه وسلم وهو آخذ بيد عمر بن الخطاب فقال: والله يا رسول الله لأنت أحب إلي من كل شيء إلا من نفسي فقال رسول الله صلى الله عليه وسلم \" لا يؤمن أحدكم حتى أكون أحب إليه من نفسه \"فقال عمر: فأنت الآن والله أحب إلى من نفسي فقال رسول الله صلى الله عليه وسلم \" الآن يا عمر \"انفرد بإخراجه البخاري فرواه عن يحيى بن سليمان عن ابن وهب عن حيوة بن شريح عن أبي عقيل زهرة بن معبد أنه سمع جده عبدالله بن هشام عن النبي صلى الله عليه وسلم بهذا وقد ثبت في الصحيح عنه صلى الله عليه وسلم أنه قال: والذي نفسي بيده لا يؤمن أحدكم حتى أكون أحب إليه من والده وولده والناس أجمعين \" وروى الإمام أحمد وأبو داود واللفظ له من حديث أبي عبدالرحمن الخراساني عن عطاء الخراساني عن نافع عن ابن عمر قال: سمعت رسول الله صلى الله عليه وسلم يقول \" إذا تبايعتم بالعينة وأخذتم بأذناب البقر ورضيتم بالزرع وتركتم الجهاد سلط الله عليكم زلالا ينزعه حتى ترجعوا إلى دينكم \"وروى الإمام أحمد أيضا عن يزيد بن هارون عن أبي حباب عن شهر بن حوشب أنه سمع عبدالله ابن عمر عن رسول الله صلى الله عليه وسلم وهذا شاهد للذي قبله والله أعلم."
    },
    {
      "ayah": 25,
      "surah": 9,
      "text": "قال ابن جريج عن مجاهد: هذه أول آية نزلت من براءة يذكر تعالى للمؤمنين فضله عليهم وإحسانه لديهم في نصره إياهم في مواطن كثيرة من غزواتهم مع رسوله وأن ذلك من عنده تعالى وبتأييده وتقديره لا بعددهم ولا بعدتهم ونبههم على أن النصر من عنده سواء قل الجمع أو كثر فإن يوم حنين أعجبتهم كثرتهم ومع هذا ما أجدى ذلك عنهم شيئا فولوا مدبرين إلا القليل منهم مع رسول الله صلى الله عليه وسلم ثم أنزل نصره وتأييده على رسوله وعلى المؤمنين الذين معه كما سنبينه إن شاء الله تعالى مفصلا ليعلمهم أن النصر من عنده تعالى وحده وبأمداده وإن قل الجمع فكم من فئة قليلة غلبت فئة كثيرة بإذن الله والله مع الصابرين. وقد قال الإمام أحمد: حدثنا وهب بن جرير حدثنا أبي سمعت يونس يحدث عن الزهري عن عبيد الله عن ابن عباس قال: قال رسول الله صلى الله عليه وسلم \" خير الصحابة أربعة وخير السرايا أربعمائة وخير الجيوش أربعة آلاف ولن تغلب اثنا عشر ألفا من قلة \" وهكذا رواه أبو داود والترمذي ثم قال: هذا حديث حسن غريب جدا لا يسنده أحد غير جرير بن حازم وإنما روي عن الزهري عن النبي صلى الله عليه وسلم مرسلا. وقد رواه ابن ماجه والبيهقي وغيره عن أكثم بن الجون عن رسول الله صلى الله عليه وسلم بنحوه والله أعلم. وقد كانت وقعة حنين بعد فتح مكة في شوال سنة ثمان من الهجرة. وذلك لما فرغ صلى الله عليه وسلم من فتح مكة وتمهدت أمورها وأسلم عامة أهلها وأطلقهم رسول الله صلى الله عليه وسلم فبلغه أن هوازن جمعوا له ليقاتلوه وأن أميرهم مالك بن عوف النضري ومعه ثقيف بكمالها وبنو جشم وبنو سعد بن بكر وأوزاع من بني هلال وهم قليل وناس من بني عمرو بن عامر وعون بن عامر وقد أقبلوا ومعهم النساء والولدان والشاء والنعم وجاءوا بقضهم وقضيضهم فخرج إليهم رسول الله صلى الله عليه وسلم في جيشه الذي جاء معه للفتح وهو عشرة آلاف من المهاجرين والأنصار وقبائل العرب ومعه الذين أسلموا من أهل مكة وهم الطلقاء في ألفين فسار بهم إلى العدو فالتقوا بواد بين مكة والطائف يقال له حنين فكانت فيه الوقعة في أول النهار في غلس الصبح انحدروا في الوادي وقد كمنت فيه هوازن فلما تواجهوا لم يشعر المسلمون إلا بهم قد بادروهم ورشقوا بالنبال وأصلتوا السيوف وحملوا حملة رجل واحد كما أمرهم ملكهم فعند ذلك ولى المسلمون مدبرين كما قال الله عز وجل وثبت رسول الله صلى الله عليه وسلم وهو راكب يومئذ بغلته الشهباء يسوقها إلى نحر العدو والعباس عمه آخذ بركابها الأيمن وأبـو سفيان بن الحارث بن عبد المطلب آخذ بركابها الأيسر يثقلانها لئلا تسرع السير وهو ينوه باسمه عليه الصلاة والسلام ويدعو المسلمين إلى الرجعة ويقول \" إلي عباد الله إلي أنا رسول الله \" ويقول في تلك الحال \" أنا النبي لا كذب أنا ابن عبد المطلب \" وثبت معه من أصحابه قريب من مائة ومنهم من قال ثمانون فمنهم أبو بكر وعمر رضي الله عنهما والعباس وعلي والفضل بن عباس وأبو سفيان بن الحارث وأيمن بن أم أيمن وأسامة بن زيد وغيرهم رضي الله عنهم ثم أمر صلى الله عليه وسلم عمه العباس وكان جهير الصوت أن ينادي بأعلى صوته: يا أصحاب الشجرة يعني شجرة بيعة الرضوان التي بايعه المسلمون من المهاجرين والأنصار تحتها على أن لا يفروا عنه فجعل ينادي بهم يا أصحاب السمرة ويقول تارة: يا أصحاب سورة البقرة فجعلوا يقولون يا لبيك يا لبيك وانعطف الناس فتراجعوا إلى رسول الله صلى الله عليه وسلم حتى إن الرجل منهم إذا لم يطاوعه بعيره على الرجوع لبس درعه ثم انحدر عنه وأرسله ورجع بنفسه إلى رسول الله صلى الله عليه وسلم فلما اجتمعت شرذمة منهم عند رسول الله صلى الله عليه وسلم أمرهم عليه السلام أن يصدقوا الحملة وأخذ قبضة من التراب بعد ما دعا ربه واستنصره وقال \" اللهم أنجز لي ما وعدتني \" ثم رمى القوم بها فما بقي إنسان منهم إلا أصابه منها في عينيه وفمه ما شغله عن القتال ثم انهزموا فاتبع المسلمون أقفاءهم يقتلون ويأسرون وما تراجع بقية الناس إلا والأسرى مجندلة بين يدي رسول الله صلى الله عليه وآله وسلم وقال الإمام أحمد: حدثنا عفان حدثنا حماد بن سلمة أخبرنا يعلى بن عطاء عن عبيد الله بن سيار عن أبي همام عن أبي عبدالرحمن الفهري واسمه يزيد بن أسيد ويقال يزيد بن أنيس ويقال كرز قال: كنت مع رسول الله صلى الله عليه وسلم في غزوة حنين فسرنا في يوم قائظ شديد الحر فنزلنا تحت ظلال الشجر فلما زالت الشمس لبست لأمتي وركبت فرسي فانطلقت إلى رسول الله صلى الله عليه وسلم وهو في فسطاطه فقلت: السلام عليك يا رسول الله ورحمة الله وبركاته حان الرواح؟ فقال \"أجل\" فقال \"يا بلال\" فثار من تحت سمرة كأن ظلها ظل طائر فقال: لبيك وسعديك وأنا فداؤك فقال \" أسرج لي فرسي \" فأخرج سرجا دفتاه من ليف ليس فيهما أشر ولا بطر قال فأسرع فركب وركبنا فصاففناهم عشيتنا وليلتنا فتشامت الخيلان فولى المسلمون مدبرين كما قال الله تعالى \" ثم وليتم مدبرين \" فقال رسول الله صلى الله عليه وسلم \" يا عباد الله أنا عبد الله ورسوله \"ثم قال: يا معشر المهاجرين أنا عبدالله ورسوله \"قال: ثم اقتحم عن فرسه فأخذ كفا من تراب فأخبرني الذي كان أدنى إليه مني أنه ضرب به وجوههم وقال \" شاهدت الوجوه \"فهزمهم الله تعالى. قال يعلي بن عطاء: فحدثني أبناؤهم عن آبائهم أنهم قالوا لم يبق منا أحد إلا امتلأت عيناه وفمه ترابا وسمعنا صلصلة بين السماء والأرض كإمرار الحديد على الطست الجديد وهكذا رواه الحافظ البيهقي في دلائل النبوة من حديث أبي داود الطيالسي عن حماد بن سلمة به وقال محمد بن إسحاق حدثني عاصم بن عمر بن قتادة عن عبدالرحمن بن جابر عن أبيه عن عبدالله قال: فخرج مالك بن عوف بمن معه إلى حنين فسبق رسول الله صلى الله عليه وسلم فأعدوا وتهيئوا في مضايق الوادي وأحنائه وأقبل رسول الله صلى الله عليه وآله وسلم وأصحابه حتى انحط بهم الوادي في عماية الصبح فلما انحط الناس ثارت في وجوههم الخيل فشدت عليهم وانكفأ الناس منهزمين لا يقبل أحد على أحد وانحاز رسول الله صلى الله عليه وآله وسلم ذات اليمين يقول \" أيها الناس هلموا إلي أنا رسول الله أنا محمد بن عبدالله \"فلا شيء وركبت الإبل بعضها بعضا فلما رأى رسول الله صلى الله عليه وآله وسلم أمر الناس قال يا عباس اصرخ يا معشر الأنصار يا أصحاب السمرة \" فأجابوه لبيك لبيك فجعل الرجل يذهب ليعطف بعيره فلا يقدر على ذلك فيقذف درعه في عنقه ويأخذ سيفه وقوسه ثم يؤم الصوت حتى اجتمع إلى رسول الله صلى الله عليه وسلم منهم مائة فاستعرض الناس فاقتتلوا وكانت الدعوة أول ما كانت بالأنصار ثم جعلت آخرا بالخزرج وكانوا صبراء عند الحرب وأشرف رسول الله صلى الله عليه وسلم ملقون فقتل الله منهم من قتل وانهزم منهم من انهزم وأفاء الله على رسوله أموالهم وأبناءهم وفي الصحيحين من حديث شعبة عن أبي إسحاق عن البراء بن عازب رضي الله عنهما أن رجلا قال له: يا أبا عمارة أفررتم عن رسول الله صلى الله عليه وسلم يوم حنين؟ فقال لكن رسول الله صلى الله عليه وسلم لم يفر إن هوازن كانوا قوما رماة فلما لقيناهم وحملنا عليهم انهزموا فأقبل الناس على الغنائم فاستقبلونا بالسهام فانهزم الناس فلقد رأيت رسول الله صلى الله عليه وسلم وأبو سفيان بن الحارث آخذ بلجام بغلته البيضاء وهو يقول \" أنا النبي لا كذب أنا ابن عبد المطلب \"قلت: وهذا في غاية ما يكون من الشجاعة التامة أنه في مثل هذا اليوم في حومة الوغي وقد انكشف عنه جيشه وهو مع هذا على بغلة وليست سريعة الجري ولا تصلح لفر ولا لكر ولا لهرب وهو مع هذا أيضا يركضها إلى وجوههم وينوه باسمه ليعرفه من لم يعرفه صلوات الله وسلامه عليه دائما إلى يوم الدين وما هذا كله إلا ثقة بالله وتوكلا عليه وعلما منه بأنه سينصره ويتم ما أرسله به ويظهر دينه على سائر الأديان."
    },
    {
      "ayah": 26,
      "surah": 9,
      "text": "ولهذا قال تعالى \" ثم أنزل الله سكينته على رسوله \" أي طمأنينته وثباته على رسوله \" وعلى المؤمنين \" أي الذين معه \" وأنزل جنودا لم تروها \" وهم الملائكة كما قال الإمام أبو جعفر بن جرير: حدثني الحسن بن عرفة قال: حدثني المعتمر بن سليمان عن عوف هو ابن أبي جميلة الأعرابي قال: سمعت عبدالرحمن مولى ابن برثن حدثني رجل كان مع المشركين يوم حنين قال: لما التقينا نحن وأصحاب رسول الله صلى الله عليه وآله وسلم يوم حنين لم يقوموا لنا حلب شاة قال فلما كشفناهم جعلنا نسوقهم في آثارهم حتى انتهينا إلى أصحاب البغلة البيضاء فإذا هو رسول الله صلى الله عليه وسلم قال: فتلقانا عنده رجال بيض حسان الوجوه فقال لنا: شاهت الوجوه ارجعوا. قال فانهزمنا وركبوا أكتافنا فكانت إياها وقال الحافظ أبو بكر البيهقي أنبأنا أبو عبدالله الحافظ حدثني محمد بن أحمد بن بالويه حدثنا إسحاق بن الحسن الحرمي حدثنا عفان بن مسلم حدثنا عبد الواحد بن زياد حدثنا ابن حصيرة حدثنا القاسم بن عبدالرحمن عن أبيه قال: قال ابن مسعود رضي الله عنه كنت مع رسول الله صلى الله عليه وسلم يوم حنين فولى عنه الناس وبقيت معه في ثمانين رجلا من المهاجرين والأنصار قدمنا ولم نولهم الدبر وهم الذين أنزل الله عليهم السكينة قال ورسول الله صلى الله عليه وسلم على بغلته البيضاء يمضي قدما فحادت بغلته فمال عن السرج فقلت: ارتفع رفعك الله قال \" ناولني كفا من التراب \" فناولته قال فضرب به وجوههم فامتلأت أعينهم ترابا قال \" أين المهاجرون والأنصار؟ \" قلت: هم هناك قال \" اهتف بهم \" فهتفت فجاءوا وسيوفهم بأيمانهم كأنها الشهب وولى المشركون أدبارهم وروه الإمام أحمد في مسنده عن عفان به نحوه وقال الوليد بن مسلم: حدثني عبدالله بن المبارك عن أبي بكر الهزلي عن عكرمة مولى ابن عباس عن شيبة بن عثمان قال: لما رأيت رسول الله صلى الله عليه وسلم يوم حنين قد عري ذكرت أبي وعمي وقتل علي وحمزة إياهما فقلت اليوم أدرك ثأري منه قال فذهبت لأجيئه عن يمينه فإذا أنا بالعباس بن عبد المطلب قائما عليه درع بيضاء كأنها فضة يكشف عنها العجاج فقلت: عمه ولن يخذله قال فجئته عن يساره فإذا أنا بأبي سفيان بن الحارث بن عبد المطلب فقلت: ابن عمه ولن يخذله فجئته من خلفه فلم يبق إلا أن أسوره سورة بالسيف إذ رفع لي شواط من نار بيني وبينه كأنه برق فخفت أن يخمشني فوضعت يدي على بصري ومشيت القهقرى فالتفت رسول الله صلى الله عليه وسلم وقال \" يا شيبة يا شيبة ادن مني اللهم أذهب عنه الشيطان \" قال: فرفعت إليه بصري ولهو أحب إلي من سمعي وبصري فقال \" يا شيبة قاتل الكفار\" رواه البيهقي من حديث الوليد فذكره ثم روي من حديث أيوب بن جابر عن صدقة بن سعيد عن مصعب بن شيبة عن أبيه قال: خرجت مع رسول الله صلى الله عليه وسلم يوم حنين والله ما أخرجني إسلام ولا معرفة به ولكنني أبيت أن تظهر هوازن على قريش فقلت وأنا واقف معه: يا رسول الله إنى أرى خيلا بلقاء فقال \" يا شيبة إنه لا يراها إلا كافر \" فضرب بيده على صدري ثم قال \"اللهم اهد شيبة\" ثم ضربها الثانية ثم قال\"اللهم اهد شيبة \" ثم ضربها الثالثة ثم قال\" اللهم اهد شيبة \" قال فوالله ما رفع يده عن صدري في الثالثة حتى ما كان أحد من خلق الله أحب إلى منه وذكر تمام الحديث في التقاء الناس وانهزام المسلمين ونداء العباس واستنصار رسول الله صلى الله عليه وسلم حتى هزم الله تعالى المشركين قال محمد بن إسحاق: حدثني أبي إسحاق بن يسار عمن حدثه عن جبير بن مطعم رضي الله عنه قال: إنا لمع رسول الله صلى الله عليه وسلم يوم حنين والناس يقتتلون إذ نظرت إلى مثل البجاد الأسود يهوي من السماء حتى وقع بيننا وبين القوم فإذا نمل منثور قد ملأ الوادي فلم يكن إلا هزيمة قوم فما كنا نشك أنها الملائكة وقال سعيد بن السائب بن يسار عن أبيه قال: سمعت يزيد بن عامر السوائي وكان شهد حنينا مع المشركين ثم أسلم بعد فكنا نسأله عن الرعب الذي ألقى الله في قلوب المشركين يوم حنين فكان يأخذ الحصاة فيرمي بها في الطست فيطن فيقول كنا نجد في أجوافنا مثل هذا وقد تقدم له شاهد من حديث الفهري يزيد بن أسيد فالله أعلم وفي صحيح مسلم عن محمد بن رافع عن عبدالرزاق أنبأنا معمر عن همام قال: هذا ما حدثنا أبو هريرة أن رسول الله صلى الله عليه وسلم قال \" نصرت بالرعب وأوتيت جوامع الكلم \" ولهذا قال تعالى \" ثم أنزل الله سكينته على رسوله وعلى المؤمنين وأنزل جنودا لم تراها وعذب الذين كفروا وذلك جزاء الكافرين \"."
    },
    {
      "ayah": 27,
      "surah": 9,
      "text": "وقوله \" ثم يتوب الله من بعد ذلك على من يشاء والله غفور رحيم \" قد تاب الله على بقية هوازن فأسلموا وقدموا عليه مسلمين ولحقوه وقد قارب مكة عند الجعرانة وذلك بعد الوقعة بقريب من عشرين يوما فعند ذلك خيرهم بين سبيهم وبين أموالهم فاختاروا سبيهم وكانوا ستة آلاف أسير ما بين صبي وامرأة فرده عليهم وقسم الأموال بين الغانمين ونفل أناسا من الطلقاء ليتألف قلوبهم على الإسلام فأعطاهم مائة من الإبل وكان من جملة من أعطى ماله مالك بن عوف النضري واستعمله على قومه كما كان فامتدحه بقصيدته التي يقول فيها: ما إن رأيت ولاسمعت بمثله في الناس كلهم بمثل محمد أوفى وأعطى للجزيل إذا اجتدى ومتى يشأ يخبرك عما في غد وإذا الكتيبة عردت أنيابها بالسمهري وضرب كل مهند فكأنه ليث على أشباله وسط المباءة خادر في مرصد"
    },
    {
      "ayah": 28,
      "surah": 9,
      "text": "أمر تعالى عباده المؤمنين الظاهرين دينا وذاتا بنفي المشركين الذين هم نجس دينا عن المسجد الحرام وأن لا يقربوه بعد نزول هذه الآية وكان نزولها في سنة تسع ولهذا بعث رسول الله صلى الله عليه وسلم عليا صحبة أبي بكر رضي الله عنهما عامئذ وأمره أن ينادي من المشركين: أن لا يحج بعد هذا العام مشرك ولا يطوف بالبيت عريان فأتم الله ذلك وحكم به شرعا وقدرا.وقال عبدالرازق أخبرنا ابن جريج أخبرني أبو الزبير أنه سمع جابر بن عبدالله يقول في قوله تعالى \" إنما المشركون نجس فلا يقربوا المسجد الحرام بعد عامهم هذا \" إلا أن يكون عبدا أو أحدا من أهل الذمة. وقد روي مرفوعا من وجه آخر فقال الإمام أحمد: حدثنا حسن حدثنا شريك عن الأشعث يعني ابن سوار عن الحسن عن جابر قال: قال رسول الله صلى الله عليه وسلم لا يدخل مسجدنا بعد عامنا هذا مشرك إلا أهل العهد وخدمهم \"تفرد به الإمام أحمد مرفوعا والموقوف أصح إسنادا وقال الإمام أبو عمر والأوزاعي: كتب عمر بن عبد العزيز رضي الله عنه أن امنعوا اليهود والنصارى من دخول مساجد المسلمين وأتبع نهيه قول الله تعالى \" إنما المشركون نجس \" وقال عطاء: الحرم كله مسجد لقوله تعالى \" فلا يقربوا المسجد الحرام بعد يومهم هذا \" ودلت هذه الآية الكريمة على نجاسة المشرك كما ورد في الصحيح \" المؤمن لا ينجس \" وأما نجاسة بدنه فالجمهور على أنه ليس بنجس البدن والذات لأن الله تعالى أحل طعام أهل الكتاب وذهب بعض الظاهرية إلى نجاسة أبدانهم وقال أشعث عن الحسن: من صافحهم فليتوضأ رواه ابن جرير وقوله \" إن خفتم عيلة فسوف يغنيكم الله من فضله \" قال محمد بن إسحاق: وذلك أن الناس قالوا: لتقطعن عنا الأسواق ولتهلكن التجارة وليذهبن عنا ما كنا نصيب فيها من المرافق فأنزل الله \" وإن خفتم عيلة فسوف يغنيكم الله من فضله \" من وجه غير ذلك \" إن شاء \" إلى قوله \" وهم صاغرون \" أي هذا عوض ما تخوفتم من قطع تلك الأسواق فعوضهم الله مما قطع أمر الشرك ما أعطاهم من أعناق أهل الكتاب من الجزية وهكذا روى عن ابن عباس ومجاهد وعكرمة وسعيد بن جبير وقتادة والضحاك وغيرهم \" إن الله عليم \" أي بما يصلحكم \" حكيم \" أي فيما يأمر به وينهى عنه لأنه الكامل في أفعاله وأقواله العادل في خلقه وأمره تبارك وتعالى ولهذا عوضهم عن تلك المكاسب بأموال الجزية التي يأخذونها من أهل الذمة."
    },
    {
      "ayah": 29,
      "surah": 9,
      "text": "وقوله تعالى \" قاتلوا الذين لا يؤمنون بالله ولا باليوم الآخر ولا يحرمون ما حرم الله ورسوله ولا يدينون دين الحق من الذين أوتوا الكتاب حتى يعطوا الجزية عن يد وهم صاغرون \" فهم في نفس الأمر لما كفروا بمحمد صلى الله عليه وسلم لم يبق لهم إيمان صحيح بأحد الرسل ولا بما جاءوا به وإنما يتبعون آراءهم وأهواءهم وآباءهم فيما هم فيه لا لأنه شرع الله ودينه لأنهم لو كانوا مؤمنين بما بأيديهم إيمانا صحيحا لقادهم ذلك إلى الإيمان بمحمد صلى الله عليه وسلم لأن جميع الأنبياء بشروا به وأمروا باتباعه فلما جاء كفروا به وهو أشرف الرسل علم أنهم ليسوا متمسكين بشرع الأنبياء الأقدمين لأنه من الله. بل لحظوظهم وأهوائهم فلهذا لا ينفعهم إيمانهم ببقية الأنبياء وقد كفروا بسيدهم وأفضلهم وخاتمهم وأكملهم. ولهذا قال \" قاتلوا الذين لا يؤمنون بالله واليوم الآخر ولا يحرمون ما حرم الله ورسوله ولا يدينون دين الحق من الذين أوتوا الكتاب \" وهذه الآية الكريمة أول الأمر بقتال أهل الكتاب بعد ما تمهدت أمور المشركين ودخل الناس في دين الله أفواجا واستقامت جزيرة العرب أمر الله رسوله بقتال أهل الكتابين اليهود والنصارى وكان ذلك في سنة تسع ولهذا تجهز رسول الله صلى الله عليه وسلم لقتال الروم ودعا الناس إلى ذلك وأظهره لهم وبعث إلى إحياء العرب حول المدينة فندبهم فأوعبوا معه واجتمع من المقاتلة نحو من ثلاثين ألفا وتخلف بعض الناس من أهل المدينة ومن حولها من المنافقين وغيرهم وكان ذلك في عام جدب ووقت قيظ وحر وخرج رسول الله صلى الله عليه وسلم يريد الشام لقتال الروم فبلغ تبوك فنزل بها وأقام بها قريبا من عشرين يوما ثم استخار الله في الرجوع فرجع عامه ذلك لضيق الحال وضعف الناس كما سيأتي بيانه بعد إن شاء الله تعالى. وقد استدل بهـذه الآية الكريمة من يرى أنه لا تؤخذ الجزية إلا من أهل الكتاب أو من أشباههم كالمجوس كما صح فيهم الحديث أن رسول الله صلى الله عليه وسلم أخذها من مجوس هجر وهذا مذهب الشافعي وأحمد في المشهور عنه وقال أبو حنيفة رحمه الله: بل تؤخذ من جميع الأعاجم سواء كانوا من أهل الكتاب أو من المشركين ولا تؤخذ من العرب إلا من أهل الكتاب. وقال الإمام مالك: بل يجوز أن تضرب الجزية على جميع الكفار من كتابي ومجوسي ووثني وغير ذلك ولمأخذ هذه المذاهب وذكر أدلتها مكان غير هذا والله أعلم. وقوله \" حتى يعطوا الجزية \" أي إن لم يسلموا \" عن يد \" أي عن قهر لهم وغلبة \" وهم صاغرون \" أي ذليلون حقيرون مهانون فلهذا لا يجوز إعزاز أهل الذمة ولا رفعهم على المسلمين بل هم أذلاء صغرة أشقياء كما جاء في صحيح مسلم عن أبي هريرة رضي الله عنه أن النبي صلى الله عليه وسلم قال \" لا تبدءوا اليهود والنصارى بالسلام وإذا لقيتم أحدهم في طريق فاضطروهم إلى أضيقه \" ولهذا اشترط عليهم. أمير المؤمنين عمر بن الخطاب رضي الله عنه تلك الشروط المعروفة في إذلالهم وتصغيرهم وتحقيرهم وذلك مما رواه الأئمة الحفاظ من رواية عبدالرحمن بن غنم الأشعري قال: كتبت لعمر بن الخطاب رضي الله عنه حين صالح نصارى من أهل الشام بسم الله الرحمن الرحيم هذا كتاب لعبدالله عمر أمير المؤمنين من نصارى مدينة كذا وكذا إنكم لما قدمتم علينا سألناكم الأمان لأنفسنا وذرارينا وأموالنا وأهل ملتنا وشرطنا لكم على أنفسنا أن لا نحدث في مدينتنا ولا فيما حولها ديرا ولا كنيسة ولا قلاية ولا صومعة راهب ولا نجدد ما خرب منها ولا نحيي منها ماكان خططا للمسلمين وأن لا نمنع كنائسنا أن ينزلها أحد من المسلمين في ليل ولا نهار وأن نوسع أبوابها للمارة وابن السبيل وأن ننزل من رأينا من المسلمين ثلاثة أيام نطعمهم ولا نئوي في كنائسنا ولا منازلنا جاسوسا ولا نكتم غشا للمسلمين ولا نعلم أولادنا القرآن ولا نظهر شركا ولا ندعو إليه أحدا ولا نمنع أحدا من ذوي قرابتنا الدخول في الإسلام إن أرادوه وأن نوقر المسلمين وأن نقوم لهم من مجالسنا إن أرادوا الجلوس ولا نتشبه بهم في شيء من ملابسهم في قلنسوة ولا عمامة ولا نعلين ولا فرق شعر ولا نتكلم بكلامهم ولا نكتني بكناهم ولا نركب السروج ولا نتقلد السيوف ولا نتخذ شيئا من السلاح ولا نحمله معنا ولا ننقش خواتيمنا بالعربية ولا نبيع الخمور وأن نجز مقاديم رءوسنا وأن نلزم زينا حيثما كنا وأن نشد الزنانير على أوساطنا وأن لا نظهر الصليب على كنائسنا وأن لا نظهر صلبنا ولا كتبنا في شيء من طرق المسلمين ولا أسواقهم ولا نضرب نواقيسنا في كنائسنا إلا ضربا خفيفا وأن لا نرفع أصواتنا بالقراءة في كنائسنا في شيء في حضرة المسلمين ولا نخرج شعانين ولا بعوثا ولا نرفع أصواتنا مع موتانا ولا نظهـر النيران معهم في شيء من طرق المسلمين ولا أسواقهم ولا نجاورهم بموتانا ولا نتخذ من الرقيق ما جرى عليه سهام المسلمين وأن نرشد المسلمين ولا نطلع عليهم في منازلهم. قال فلما أتيت عمر بالكتاب زاد فيه ولا نضرب أحدا من المسلمين شرطنا لكم ذلك على أنفسنا وأهل ملتنا وقبلنا عليه الأمان فإن نحن خالفنا في شيء مما شرطناه لكم ووظفنا على أنفسنا فلا ذمة لنا وقد حل لكم منا ما يحل من أهل المعاندة والشقاق."
    },
    {
      "ayah": 3,
      "surah": 9,
      "text": "يقول تعالى وإعلام \" من الله ورسوله\" وتقدم وإنذار إلى الناس \" يوم الحج الأكبر \" وهو يوم النحر الذي هو أفضل أيام المناسك وأظهرها وأكبرها جميعا \" أن الله بريء من المشركين ورسوله \" أي بريء منهم أيضا ثم دعاهم إلى التوبة إليه فقال \" فإن تبتم \" أي مما أنتم فيه من الشرك والضلال \" فهو خير لكم وإن توليتم \" أي استمررتم على ما أنتم عليه \" فاعلموا أنكم غير معجزي الله \" بل هو قادر عليكم وأنتم في قبضته وتحت قهره ومشيئته \" وبشر الذين كفروا بعذاب أليم \" أي في الدنيا بالخزي والنكال وفي الآخرة بالمقامع والأغلال. قال البخاري رحمه الله: حدثنا عبدالله بن يوسف حدثنا الليث حدثني عقيل عن ابن شهاب قال: أخبرني حميد بن عبدالرحمن أن أبا هريرة قال: بعثني أبو بكر رضي الله عنه في تلك الحجة في المؤذنين الذين بعثهم يوم النحر يؤذنون بمنى أن لا يحج بعد العام مشرك ولا يطوفن بالبيت عريان. قال حميد: ثم أردف النبي صلى الله عليه وسلم بعلي بن أبي طالب فأمره أن يؤذن ببراءة. قال أبو هريرة: فأذن معنا علي في أهل منى يوم النحر ببراءة وأن لا يحج بعد هذا العام مشرك ولا يطوف بالبيت عريان ورواه البخاري أيضا: حدثنا أبو اليمان أخبرنا شعيب عن الزهري أخبرني حميد بن عبدالرحمن أن أبا هريرة قال: بعثني أبو بكر فيمن يؤذن يوم النحر بمنى ألا يحج بعد العام مشرك ولا يطوف بالبيت عريان. ويوم الحج الأكبر يوم النحر وإنما قيل الأكبر من أجل قول الناس الحج الأصغر فنبذ أبو بكر إلى الناس في ذلك العام فلم يحج عام حجة الوداع الذي حج فيه رسول الله صلى الله عليه وسلم مشرك. هذا لفظ البخاري في كتاب الجهاد. وقال عبدالرزاق عن معمر عن الزهري عن ابن المسيب عن أبي هريرة رضي الله عنه في قوله \" براءة من الله ورسوله \" قال لما كان النبي صلى الله عليه وسلم زمن حنين اعتمر من الجعرانة ثم أمَّر أبا بكر على ذلك الحجة قال معمر: قال الزهري: وكان أبو هريرة يحدث أن أبا بكر أمر أبو هريرة أن يؤذن ببراءة في حجة أبي بكر. قال أبو هريرة ثم أتبعنا النبي صلى الله عليه وسلم عليا وأمره أن يؤذن ببراءة وأبو بكر على الموسم كما هو أو قال على هيئته وهذا السياق فيه غرابة من جهة أن أمير الحج كان سنة عمرة الجعرانة إنما هو عتاب بن أسيد فأما أبو بكر إنما كان أميرا سنة تسع. وقال الإمام أحمد: حدثنا محمد بن جعفر حدثنا شعبة عن مغيرة عن الشعبي عن محرز بن أبي هريرة عن أبيه قال: كنت مع علي بن أبي طالب بعثه رسول الله صلى الله عليه وسلم إلى أهل مكة ببراءة فقال \" ما كنتم تنادون؟ \"قال كنا ننادي أنه لا يدخل الجنة إلا نفس مؤمنة ولا يطوف بالبيت عريان ومن كان بينه وبين رسول الله صلى الله عليه وسلم عهد فإن أجله أو مدته إلى أربعة أشهر فإذا مضت الأربعة أشهر فإن الله بريء من المشركون ورسوله ولا يحج هذا البيت بعد عامنا هذا مشرك قال: فكنت أنادي حتى صحل صوتي. وقال الشعبي: حدثني محرز بن أبي هريرة عن أبيه قال: كنت مع علي بن أبي طالب رضي الله عنه حين بعثه النبي صلى الله عليه وسلم ينادي فكان إذا صحل ناديت فقلت بأي شيء كنتم تنادون؟ قال بأربع لا يطوف بالبيت عريان ومن كان له عهد عند رسول الله صلى الله عليه وسلم فعهده إلى مدته ولا يدخل الجنة إلا نفس مؤمنة ولا يحج بعد عامنا هذا مشرك. رواه ابن جرير من غير وجه عن الشعبي ورواه شعبة عن مغيرة عن الشعبي به إلا أنه قال: ومن كان بينه وبين رسول الله صلى الله عليه وسلم عهد فعهده إلى أربعة أشهر وذكر تمام الحديث قال ابن جرير: حدثنا عفان حدثنا حماد عن سماك عن أنس بن مالك رضي الله عنه أن رسول الله صلى الله عليه وسلم بعثه ببراءة مع أبي بكر فلما بلغ ذا الحليفة قال \" لا يبلغها إلا أنا أو رجل من أهل بيتي \"فبعث بها مع علي بن أبي طالب رضي الله عنه ورواه الترمذي في التفسير عن بندار عن عفان وعبد الصمد كلاهما عن حماد بن سلمة ثم قال: حسن غريب من حديث أنس رضي الله عنه وقال عبدالله بن أحمد بن حنبل: حدثنا محمد بن سليمان حدثنا لوين حدثنا محمد بن جابر عن سماك عن حنش عن علي رضي الله عنه قال: لما نزلت عشر آيات من براءة على النبي صلى الله عليه وسلم دعا النبي صلى الله عليه وآله وسلم أبا بكر فبعثه بها ليقرأها على أهل مكة ثم دعاني فقال: أدرك أبا بكر فحيثما لحقته فخذ الكتاب منه فاذهب إلى أهل مكة فاقرأه عليهم \"فلحقته بالجحفة فأخذت الكتاب منه ورجع أبو بكر إلى النبي صلى الله عليه وسلم فقال يا رسول الله نزل في شيء؟ فقال: لا ولكن جبريل جاءني فقال لن يؤدي عنك إلا أنت أو رجل منك هذا إسناد فيه ضعف وليس المراد أن أبا بكر رضي الله عنه رجع من فوره بل بعد قضائه للمناسك التي أمره عليها رسول الله صلى الله عليه وسلم كما جاء مبينا في الرواية الأخرى وقال عبدالله أيضا حدثني أبو بكر حدثنا عمرو بن حماد عن أسباط بن نصر عن سماك عن حنش عن علي رضي الله عنه أن رسول الله صلى الله عليه وسلم حين بعثه ببراءة قال: يا نبي الله إني لست باللسن ولا بالخطيب قال: لابد لي أن أذهب بها أنا أو تذهب بها أنت قال: فإن كان ولابد فسأذهب بها أنا قال: انطلق فإن الله يثبت لسانك ويهدي قلبك قال ثم وضع يده على فيه. وقال الإمام أحمد حدثنا سفيان عن أبي إسحق عن زيد بن يثيغ رجل من همدان: سألنا عليا بأي شيء بعثت؟ يعني يوم بعثه النبي صلى الله عليه وسلم مع أبي بكر في الحجة قال: بعثت بأربع: لا يدخل الجنة إلا نفس مؤمنة ولا يطوف بالبيت عريان ومن كان بينه وبين النبي صلى الله عليه وسلم عهد فعهده إلى مدته ولا يحج المشركون بعد عامهم هذا ورواه الترمذي عن قلابة عن سفيان بن عيينة وقال حسن صحيح كذا قال. ورواه شعبة عن أبي إسحق فقال زيد بن أثيل وَهِمَ فيه ورواه الثوري عن أبي إسحق عن بعض أصحابه عن علي رضي الله عنه وقال ابن جرير حدثنا ابن وكيع حدثنا أبو أسامة عن ذكريا عن أبي إسحق عن يزيد بن يثيغ عن علي قال: بعثني رسول الله صلى الله عليه وسلم حين أنزلت براءة بأربع: أن لا يطوف بالبيت عريان ولا يقرب المسجد الحرام مشرك بعد عامهم هذا ومن كان بينه وبين رسول الله صلى الله عليه وسلم عهد فهو إلى مدته ولا يدخل الجنة إلا نفس مؤمنة ثم رواه ابن جرير عن محمد بن عبد الأعلى عن ابن ثور عن معمر عن أبي إسحق عن الحارث عن علي قال: أمرت بأربع فذكره وقال إسرائيل عن أبي إسحق عن زيد بن يثيغ قال: نزلت براءة فبعث رسول الله صلى الله عليه وسلم أبا بكر ثم أرسل عليا فأخذها فلما رجع أبو بكر قال: نزل فيَّ شيء؟ قال \" لا ولكن أمرت أن أبلغها أنا أو رجل من أهل بيتي \" فانطلق إلى أهل مكة فقام فيهم بأربع: لا يدخل مكة مشرك بعد عامة هذا ولا يطوف بالبيت عريان ولا يدخل الجنة إلا نفس مسلمة ومن كان بينه وبين رسول الله صلى الله عليه وسلم عهد فعهده إلى مدته وقال محمد بن إسحق عن حكيم بن حكيم بن عباد بن حنيف عن أبي جعفر محمد بن علي بن الحسين بن علي قال: لما نزلت براءة على رسول الله صلى الله عليه وسلم وقد كان بعث أبا بكر ليقيم الحج للناس فقيل يا رسول الله: لو بعثت إلى أبي بكر فقال \" لا يؤدي عني إلا رجل من أهل بيتي \" ثم دعا عليا فقال \" اذهب بهذه القصة من سورة براءة وأذن في الناس يوم النحر ذا اجتمعوا بمنى أنه لا يدخل الجنة كافر ولا يحج بعد العام مشرك ولا يطوف بالبيت عريان ومن كان له عهد عند رسول الله صلى الله عليه وسلم فهو له إلى مدته \" فخرج عليا رضي الله عنه على ناقة رسول الله صلى الله عليه وسلم العضباء حتى أدرك أبا بكر في الطريق فلما رآه أبو بكر قال: أمير أو مأمور؟ فقال بل مأمور ثم مضيا فأقام أبو بكر للناس الحج إذ ذاك في تلك السنة على منازلهم من الحج التي كانوا عليها في الجاهلية حتى إذا كان يوم النحر قام علي بن أبي طالب فأذن في الناس بالذي أمره رسول الله صلى الله عليه وسلم فقال: يا أيها الناس إنه لا يدخل الجنة كافر \" ولا يحج بعد العام مشرك ولا يطوف بالبيت عريان ومن كان له عهد عند رسول الله صلى الله عليه وسلم فهو إلى مدته \". فلم يحج بعد ذلك العام مشرك ولم يطف بالبيت عريان ثم قدما على رسول الله صلى الله عليه وسلم فكان هذا من براءة فيمن كان من أهل الشرك من أهل العهد العام وأهل المدة إلى الأجل المسمى. وقال ابن جرير: حدثنا محمد بن عبدالله بن عبد الحكم أخبرنا أبو زرعة وعبدالله بن راشد أخبرنا حيوة بن شريح أخبرنا ابن صخر أنه سمع أبا معاوية البجلي من أهل الكوفة يقول: سمعت أبا الصهباء البكري وهو يقول: سألت عليا عن يوم الحج الأكبر فقال: إن رسول الله صلى الله عليه وسلم بعث أبا بكر بن أبي قحافة يقيم للناس الحج وبعثني معه بأربعين أية من براءة حتى أتى عرفة فخطب الناس يوم عرفة فلما قضى خطبته التفت إلي فقال: قم يا علي فأد رسالة رسول الله صلى الله عليه وسلم فقمت فقرأت عليهم أربعين آية من براءة ثم صدرنا فأتينا منى فرميت الجمرة ونحرت البدنة ثم حلقت رأسي وعلمت أن أهل الجمع لم يكونوا كلهم حضروا خطبة أبي بكر يوم عرفة فطفت أتتبع بها الفساطيط أقرأها عليهم فمن ثم أخال حسبتم أنه يوم النحر ألا وهو يوم عرفة وقال عبدالرزاق عن معمر عن أبي إسحق: سألت أبا جحيفة عن يوم الحج الأكبر قال: يوم عرفة فقلت أمن عندك أم من أصحاب محمد صلى الله عليه وسلم؟ قال كل في ذلك. وقال عبدالرزاق أيضا عن ابن جريج عن عطاء قال: يوم الحج الأكبر يوم عرفة. وقال عمرو بن الوليد السهمي حدثنا شهاب بن عباد البصري عن أبيه قال: سمعت عمر بن الخطاب يقول: هذا يوم عرفة هذا يوم الحج الأكبر فلا يصومنه أحد. قال: فحججت بعد أبي فأتيت المدينة فسألت عن أفضل أهلها فقالوا سعيد بن المسيب فأتيته فقلت إنى سألت عن أفضل المدينة فقالوا سعيد بن المسيب فأخبرني عن صوم يوم عرفة فقال: أخبرك عمن هو أفضل مني مائة ضعف عمر أو ابن عمر كان ينهى عن صومه ويقول يوم الحج الأكبر رواه ابن جرير وابن أبي حاتم وهكذا روي عن ابن عباس وعبدالله بن الزبير ومجاهد وعكرمة وطاوس أنهم قالوا: يوم عرفة هو يوم الحج الأكبر وقد ورد فيه حديث مرسل رواه ابن جريج أخبرت عن محمد بن قيس عن ابن مخرمة أن رسول الله صلى الله عليه وسلم خطب يوم عرفة. فقال \" هذا يوم الحج الأكبر \" وروي من وجه آخر عن ابن جريج عن محمد بن قيس عن المسور بن مخرمة عن رسول الله صلى الله عليه وسلم أنه خطبهم بعرفات فحمد الله وأثنى عليه ثم قال \" أما بعد فإن هذا يوم الحج الأكبر \". والقول الثاني: أنه يوم النحر. قال هشيم عن إسماعيل بن أبي خالد عن الشعبي عن علي رضي الله عنه قال: يوم الحج الأكبر يوم النحر وقال أبو إسحق السبيعي عن الحارث الأعور سألت عليا رضي الله عنه عن يوم الحج الأكبر فقال: هو يوم النحر وقال شعبة عن الحكم سمعت يحيى بن الجزار يحدث عن علي رضي الله عنه أنه خرج يوم النحر على بغلة بيضاء يريد الجبانة فجاء رجل فأخذ بلجام دابته فسأله عن الحج الأكبر فقال: هو يومك هذا خل سبيلها وقال عبدالرازق عن سفيان عن شعبة عن عبد الملك بن عمير عن عبدالله بن أبي أوفى أنه قال: يوم الحج الأكبر يوم النحر وروى شعبة وغيره عن عبد الملك بن عمير به نحوه وهكذا رواه هشيم وغيره عن الشيباني عن عبدالله ابن أبي أوفى وقال الأعمش عن عبدالله بن سنان قال: خطبنا المغيرة بن شعبة يوم الأضحى على بعير فقال: هذا يوم الأضحى وهذا يوم النحر وهذا يوم الحج الأكبر وقال حماد بن سلمة عن سماك بن جبير وعبدالله بن شداد بن الهاد ونافع بن جبير بن مطعم والشعبي وإبراهيم النخعي ومجاهد وعكرمة وأبي جعفر الباقر والزهري وعبدالرحمن بن زيد بن أسلم أنهم قالوا: يوم الحج الأكبر هو يوم النحر واختاره ابن جرير وقد تقدم الحديث عن أبي هريرة في صحيح البخاري أن أبا بكر بعثهم يوم النحر يؤذنون بمنى وقد ورد في ذلك أحاديث أخر كما قال الإمام أبو جعفر بن جرير: حدثني سهل بن محمد الحساني حدثنا أبو جابر الحرثي حدثنا هشام بن الغازي الجرشي عن نفاع عن ابن عمر قال: وقف رسول الله صلى الله عليه وسلم يوم النحر عند الجمرات في حجة الوداع فقال هذا يوم الحج الأكبر وهكذا رواه ابن أبي حاتم وابن مردويه من حديث ابن جابر واسمه محمد ابن عبد الملك به ورواه ابن مردويه أيضا من حديث الوليد بن مسلم عن هشام ابن الغازي به ثم رواه من حديث سعيد بن عبد العزيز عن نافع به. وقال شعبة عن عمرو بن مرة الهمداني عن رجل من أصحاب النبي صلى الله عليه وسلم قال: قام فينا رسول الله صلى الله عليه وسلم على ناقة حمراء مخضرمة فقال: أتدرون أي يوم يومكم هذا؟ قالوا يوم النحر قال: صدقتم يوم الحج الأكبر. وقال ابن جرير حدثنا أحمد بن المقدام حدثنا يزيد بن زريع حدثنا ابن عون عن محمد بن سيرين عن عبدالرحمن بن أبي بكرة عن أبيه قال: لما كان ذلك اليوم قعد رسول الله صلى الله عليه وسلم على بعير له وأخذ الناس بخطامه أو زمامة فقال أي يوم هذا؟ قال فسكتنا حتى ظننا أنه سيسميه سوى اسمه فقال: أليس هذا يوم الحج الأكبر؟ وهذا إسناد صحيح وأصله مخرج في الصحيح. وقال أبو الأحوص عن شبيب عن عروة عن سليمان بن عمرو بن الأحوص عن أبيه قال: سمعت رسول الله صلى الله عليه وسلم في حجة الوداع فقال: أي يوم هذا \u003c فقالوا اليوم الحج الأكبر وعن سعيد بن المسيب أنه قال: يوم الحج الأكبر اليوم الثاني من يوم النحر رواه ابن أبي حاتم وقال مجاهد أيضا يوم الحج الأكبر أيام الحج كلها وكذا قال أبو عبيدة قال سفيان: يوم الحج ويوم الجمل ويوم صفين أي أيامه كلها. وقال سهل السراج سئل الحسن البصري عن يوم الحج الأكبر فقال: ما لكم وللحج الأكبر؟ ذاك عام حج فيه أبو بكر الذي استخلفه رسول الله صلى الله عليه وسلم فحج الناس رواه ابن أبي حاتم وقال ابن جرير: حدثنا ابن وكيع حدثنا أبو أسامة عن ابن عون سألت محمدا يعني ابن سيرين عن يوم الحج الأكبر فقال كان يوما وافق فيه حج رسول الله صلى الله عليه وسلم وحج أهل الوبر."
    },
    {
      "ayah": 30,
      "surah": 9,
      "text": "وهذا إغراء من الله تعالى للمؤمنين على قتال الكفار من اليهود والنصارى لمقالتهم هذه المقالة الشنيعة والفرية على الله تعالى فأما اليهود فقالوا في العزير أنه ابن الله تعالى الله عن ذلك علوا كبيرا وذكر السدي وغيره أن الشبهة التي حصلت لهم في ذلك أن العمالقة لما غلبت على بني إسرائيل فقتلوا علماءهم وسبوا كبارهم بقي العزيز يبكي على بني إسرائيل وذهاب العلم منهم حتى سقطت جفون عينيه فبينما هو ذات يوم إذ مر على جبانة وإذا امرأة تبكي عند قبر وهي تقول وامطعماه واكاسياه فقال لها: ويحك من كان يطعمك قبل هذا؟ قالت الله قال: فإن الله حي لا يموت قالت: يا عزيز فمن كان يعلم العلماء قبل بني إسرائيل؟ قال: الله قالت: فلم تبكي عليهم؟ فعرف أنه شيء قد وعظ به ثم قيل له اذهب إلى نهر كذا فاغتسل منه وصل هناك ركعتين فإنك ستلقى هناك شيخا فما أطعمك فكله فذهب ففعل ما أمر به فإذا الشيخ فقال له: افتح فمك ففتح فمه فألقى فيه شيئا كهيئة الجرة العظيمة ثلاث مرات فرجع عزير وهو من أعلم الناس بالتوراة فقال يا بني إسرائيل قد جئتكم بالتوراة فقال يا عزير ما كنت كذابا فعمد فربط على إصبع من أصابعه قلما وكتب التوراة بإصبعه كلها فلما تراجع الناس من عدوهم ورجع العلماء أخبروا بشأن عزير فاستخرجوا النسخ التي كانوا أودعوها في الجبال وقابلوه بها فوجدوا ما جاء به صحيحا فقال بعض جهلتهم إنما صنع هذا لأنه ابن الله وأما ضلال النصارى في المسيح فظاهر. ولهذا كذَّب الله سبحانه الطائفتين فقال \" ذلك قولهم بأفواههم \" أي لا مستند لهم فيما ادعوه سوى افترائهم واختلافهم \"يضاهئون \" أي يشابهون \" قول الذين كفروا من قبل \" أي من قبلهم من الأمم ضلوا كما ضل هؤلاء \"قاتلهم الله\" وقال ابن عباس: لعنهم الله \" أني يؤفكون \" أي كيف يضلون عن الحق وهو ظاهر ويعدلون إلى الباطل؟."
    },
    {
      "ayah": 31,
      "surah": 9,
      "text": "وقوله \" اتخذوا أحبارهم ورهبانهم أربابا من دون الله والمسيح ابن مريم \" روى الإمام أحمد والترمذي وابن جرير من طرق عن عدي بن حاتم رضي الله عنه أنه لما بلغته دعوة رسول الله صلى الله عليه وسلم فر إلى الشام وكان قد تنصر في الجاهلية فأسرت أخته وجماعة من قومه ثم مَنَّ رسول الله صلى الله عليه وسلم على أخته وأعتقها فرجعت إلى أخيها فرغبته في الإسلام وفي القدوم على رسول الله صلى الله عليه وسلم فتقدم عدي إلى المدينة وكان رئيسا في قومه طيئ وأبوه حاتم الطائي المشهور بالكرم فتحدث الناس بقدومه فدخل على رسول الله صلى الله عليه وآله وسلم وفي عنق عدي صليب من فضة وهو يقرأ هذه الآية \" اتخذوا أحبارهم ورهبانهم أربابا من دون الله \" قال: فقلت إنهم لم يعبدوهم فقال \" بلى إنهم حرموا عليهم الحلال وأحلوا لهم الحرام فاتبعوهم فذلك عبادتهم إياهم \"وقال رسول الله صلى الله عليه وسلم \" يا عدي ما تقول؟ أيضرك أن يقال الله أكبر؟ فهل تعلم شيئا أكبر من الله؟ ما يضرك أيضرك أن يقال لا إله إلا الله فهل تعلم إلها غير الله؟ ثم دعاه إلى الإسلام فأسلم وشهد شهادة الحق قال: فلقد رأيت وجهه استبشر ثم قال \" إن اليهود مغضوب عليهم والنصارى ضالون \"وهكذا قال حذيفة بن اليمان وعبدالله بن عباس وغيرهما في تفسير \" اتخذوا أحبارهم ورهبانهم أربابا من دون الله \" أنهم اتبعوهم فيما حللوا وحرموا وقال السدي استنصحوا الرجال ونبذوا كتاب الله وراء ظهورهم ولهذا قال تعالى \" وما أمروا إلا ليعبدوا إلها واحدا \" أي الذي إذا حرم الشيء فهو الحرام وما حلله فهو الحلال وما شرعه اتبع وما حكم به نفذ \" لا إله إلا هو ولا رب سواه."
    },
    {
      "ayah": 32,
      "surah": 9,
      "text": "يقول تعالى يريد هؤلاء الكفار من المشركين وأهل الكتاب \" أن يطفئوا نور الله \" أي ما بعث به رسول الله صلى الله عليه وسلم من الهدى ودين الحق بمجرد جدالهم وافترائهم فمثلهم في ذلك كمثل من يريد أن يطفئ شعاع الشمس أو نور القمر بنفخه وهذا لا سبيل إليه فكذلك ما أرسل به رسول الله صلى الله عليه وسلم لابد أن يتم ويظهر ولهذا قال تعالى مقابلا لهم فيما راموه وأرادوه \" ويأبى الله إلا أن يتم نوره ولو كره الكافرون \" والكافر هو الذي يستر الشيء ويغطيه ومنه سمى الليل كافرا لأنه يستر الأشياء والزارع كافرا لأنه يغطى الحب في الأرض كما قال \" يعجب الكفار نباته\"."
    },
    {
      "ayah": 33,
      "surah": 9,
      "text": "ثم قال تعالى \" هو الذي أرسل رسوله بالهدى ودين الحق \" فالهدى هو ما جاء به من الإخبارات الصادقة والإيمان الصحيح والعلم النافع ودين الحق هو الأعمال الصالحة الصحيحة النافعة في الدنيا والآخرة \" ليظهره على الدين كله \" أي على سائر الأديان كما ثبت في الصحيح عن رسول الله صلى الله تعالى عليه وآله وسلم أنه قال \" إن الله زوى لي الأرض مشارقها ومغاربها وسيبلغ ملك أمتي ما زوى لي منها \". وقال الإمام أحمد: حدثنا محمد بن جعفر حدثنا شعبة عن محمد بن أبي يعقوب سمعت شقيق بن حيان يحدث عن مسعود بن قبيصة أوقبيصة بن مسعود يقول: صلى هذا الحي من محارب الصبح فلما صلوا قال شاب منهم: سمعت رسول الله صلى لله تعالى عليه وآله وسلم يقول \" إنه ستفتح لكم مشارق الأرض ومغاربها وإن عمالها في النار إلا من اتقى الله وأدى الأمانة \". وقال الإمام أحمد: حدثنا أبو المغيرة حدثنا صفوان حدثنا سليم بن عامر عن تميم الداري رضي الله عنه قال: سمعت رسول الله صلى الله عليه وسلم يقول \" ليبلغن هذا الأمر ما بلغ الليل والنهار ولا يترك الله بيت مدر ولا وبر إلا أدخله هذا الدين يعز عزيزا ويذل ذليلا عزا يعز الله به الإسلام وذلا يذل الله به الكفر \" فكان تميم الداري يقول: قد عرفت ذلك في أهل بيتي لقد أصاب من أسلم منهم الخير والشرف والعز ولقد أصاب من كان كافرا منهم الذل والصغار والجزية. وقال الإمام أحمد: حدثنا يزيد بن عبد ربه حدثنا الوليد بن مسلم حدثني ابن جابر سمعت سليم بن عامر قال: سمعت المقداد بن الأسود يقول: سمعت رسول الله صلى الله عليه وسلم يقول \" لا يبقى على وجه الأرض بيت مدر ولا وبر إلا دخلته كلمة الإسلام يعز عزيزا ويذل ذليلا إما يعزهم الله فيجعلهم من أهلها وإما يذلهم فيدينون لها \" وفي المسند أيضا حدثنا محمد بن أبي عدي عن ابن عون عن ابن سيرين عن أبي حذيفة عن عدي بن حاتم سمعه يقول: دخلت على رسول الله صلى الله عليه وسلم فقال \" يا عدي أسلم تسلم \" فقلت إنى من أهل دين قال \" أنا أعلم بدينك منك \" فقلت أنت أعلم بديني مني؟ قال \" نعم ألست من الركوسية وأنت تأكل مرباع قومك؟ \" قلت بلى ! قال \" فإن هذا لا يحل لك في دينك \" قال فلم يعد أن قالها فتواضعت لها قال \" أما إني أعلم ما الذي يمنعك من الإسلام تقول إنما اتبعه ضعفة الناس ومن لا قوة له وقد رمتهم العرب أتعرف الحيرة؟ \" قلت لم أرها وقد سمعت بها قال \" فوالذي نفسي بيده ليتمن الله هذا الأمر حتى تخرج الظعينة من الحيرة حتى تطوف بالبيت من غير جوار أحد ولتفتحن كنوز كسرى بن هرمز\" قلت كسرى بن هرمز؟ قال \" نعم كسرى بن هرمز وليبذلن المال حتى لا يقبله أحد \" قال عدي: فهذه الظعينة تخرج من الحيرة فتطوف بالبيت من غير جوار أحد ولقد كنت فيمن فتح كنوز كسرى بن هرمز والذي نفسي بيده لتكونن الثالثة لأن رسول الله صلى الله عليه وسلم قد قالها. وقال مسلم: حدثنا أبو معن زيد بن يزيد الرقاشي حدثنا خالد بن الحارث حدثنا عبد الحميد بن جعفر عن الأسود بن العلاء عن أبي سلمة عن عائشة رضي الله عنهما \" قالت: سمعت رسول الله صلى الله عليه وسلم يقول \" لا يذهب الليل والنهار حتى تعبد اللات والعزى \" فقلت يا رسول الله إن كنت لأظن حين أنزل الله عز وجل \" هو الذي أرسل رسوله بالهدى ودين الحق \" الآية أن ذلك تام قال \" إنه سيكون من ذلك ما شاء الله عز وجل ثم يبعث الله ريحا طيبة فيتوفى كل من كان في قلبه مثقال حبة خردل من إيمان فيبقى من لا خير فيه فيرجعون إلى دين آبائهم \"."
    },
    {
      "ayah": 34,
      "surah": 9,
      "text": "قال السدي الأحبار من اليهود والرهبان من النصارى وهو كما قال فإن الأحبار هم علماء اليهود كما قال تعالى \" لولا ينهاهم الربانيون والأحبار عن قولهم الإثم وأكلهم السحت \" والرهبان عباد النصارى والقسيسون علماؤهم كما قال تعالى \" ذلك بأن منهم قسيسين ورهبانا \" والمقصود التحذير من علماء السوء وعباد الضلال كما قال سفيان بن عيينة: من فسد من علمائنا كان فيه شبه من اليهود ومن فسد من عبادنا كان فيه شبه من النصارى وفي الحديث الصحيح \" لتركبن سنن من كان قبلكم حذو القذة بالقذة \"قالوا اليهود والنصارى؟ قال فمن؟ وفي رواية فارس والروم قال \" فمن الناس إلا هؤلاء؟ \"والحاصل التحذير من التشبه بهم في أقوالهم وأحوالهم ولهذا قال تعالى \" ليأكلون أموال الناس بالباطل ويصدون عن سبيل الله \" وذلك أنهم يأكلون الدنيا بالدين ومناصبهم ورياستهم في الناس يأكلون أموالهم بذلك كما كان لأحبار اليهود على أهل الجاهلية شرف ولهم عندهم خرج وهدايا وضرائب تجيء إليهم فلما بعث الله رسوله صلى الله عليه وسلم استمروا على ضلالهم وكفرهم وعنادهم طمعا منهم أن تبقى لهم تلك الرياسات فأطفأها الله بنور النبوة وسلبهم إياها وعوضهم والذل الصغار وباءوا بغضب من الله تعالى وقوله تعالى \" ويصدون عن سبيل الله \" أي وهم مع أكلهم الحرام يصدون الناس عن اتباع الحق ويلبسون الحق بالباطل ويظهرون لمن اتبعهم من الجهلة أنهم يدعونه إلى الخير وليسوا كما يزعمون بل هم دعاة إلى النار ويوم القيامة لا ينصرون وقوله \" والذين يكنزون الذهب والفضة ولا ينفقونها في سبيل الله \" الآية هؤلاء هم القسم الثالث من رءوس الناس فإن الناس عالة على العلماء وعلى العباد وعلى أرباب الأموال فإذا فسدت أحوال هؤلاء فسدت أحوال الناس كما قال ابن المبارك. وهل أفسد الدين إلا الملوك وأحبار سوء ورهبانها وأما الكنز فقال مالك عن عبدالله بن دينار عن ابن عمر: هو المال الذي لا تؤدى زكاته وروى الثوري وغيره عن عبيد الله عن نافع عن ابن عمر قال: ما أدى زكاته فليس بكنز وإن كان تحت سبع أرضين وما كان ظاهرا لا تؤدى زكاته فهو كنز وقد روي هذا عن ابن عباس وجابر وأبي هريرة موقوفا ومرفوعا وقال عمر بن الخطاب نحوه أيما مال أديت زكاته فليس بكنز وإن كان مدفونا في الأرض وأيما مال لم تؤد زكاته فهو كنز يكوى به صاحبه وإن كان على وجه الأرض. وروى البخاري من حديث الزهري عن خالد بن أسلم قال: خرجنا مع عبدالله بن عمر قال: هذا قبل أن تنزل الزكاة فلما نزلت جعلها الله طهرة للأموال وكذا قال عمر بن عبد العزيز وعراك ابن مالك نسخها قوله تعالى \" خذ من أموالهم صدقة \" الآية. وقال سعيد بن محمد بن زياد عن أبي أمامة أنه قال: حلية السيوف من الكنز. ما أحدثكم إلا ما سمعت من رسول الله صلى الله عليه وسلم وقال الثوري عن أبي حصين عن أبي الضحى عن جعدة بن هبيرة عن علي رضي الله عنه قال: أربعة آلاف فما دونها نفقة فما كان أكثر من ذلك فهو كنز وهذا غريب. وقد جاء في مدح التقلل من الذهب والفضة وذم التكثر منها أحاديث كثيرة ولنورد منها هنا طرفا يدل على الباقي قال عبدالرازق: أخبرنا الثوري أخبرني أبو حصين عن أبي الضحى عن جعدة بن هبيرة عن علي رضي الله عنه في قوله \" والذين يكنزون الذهب والفضة \" الآية قال النبي صلى الله عليه وسلم \" تبا للذهب تبا للفضة \"يقولها ثلاثا قال فشق ذلك على أصحاب رسول الله صلى الله عليه وسلم وقالوا فأي مال نتخذ؟ فقال عمر رضي الله عنه أنا أعلم لكم ذلك فقال: يا رسول الله إن أصحابك قد شق عليهم وقالوا فأي المال نتخذ قال \" لسانا ذاكرا وقلبا شاكرا وزوجة تعين أحدكم على دينه \". \" حديث آخر \"قال الإمام أحمد: حدثنا عبدالله ابن عمرو بن مرة عن أبي محمد بن جعفر حدثنا شعبة حدثني سالم بن عبدالله أخبرنا عبدالله بن أبي الهذيل حدثني صاحب لي أن رسول الله صلى الله عليه وآله وسلم قال \" تبا للذهب والفضة \"قال وحدثني صاحبي أنه انطلق مع عمر بن الخطاب فقال: يا رسول الله قولك \" تبا للذهب والفضة \"ماذا ندخر؟ قال رسول الله صلى الله عليه وسلم\" لسانا ذاكرا وقلبا شاكرا وزوجة تعين على الآخرة \". \" حديث آخر \"قال الإمام أحمد: حدثنا وكيع حدثنا عبدالله بن عمرو بن مرة عن أبيه عن سالم بن أبي الجعد عن ثوبان قال: لما نزل في الذهب والفضة ما نزل قالوا فأي المال نتخذ؟ قال عمر فأنا أعلم لكـم ذلك. فأوضع على بعير فأدركه وأنا في أثره فقال: يا رسول الله أي المال نتخذ؟ قال \" قلبا شاكرا ولسانا ذاكرا وزوجة تعين أحدكم على أمر الآخرة \" ورواه الترمذي وابن ماجه من غير وجه عن سالم بن أبي الجعد. وقال الترمذي حسن وحكى عن البخاري أن سالما لم يسمعه من ثوبان قلت: ولهذا رواه بعضهم عنه مرسلا والله أعلم. \" حديث آخر \"قال ابن أبي حاتم: حدثنا أبي حدثنا حميد بن مالك حدثنا يحيى بن يعلى المحاربي حدثنا أبي حدثنا غيلان بن جامع المحاربي عن عثمان بن أبي اليقظان عن جعفر بن أبي إياس عن مجاهد عن ابن عباس قال: لما نزلت هذه الآية \" والذين يكنزون الذهب والفضة \" الآية كبر ذلك على المسلمين وقالوا ما يستطيع أحد منا يدع لولده ما لا يبقى بعده فقال عمر: أنا أفرج عنكم فانطلق عمر واتبعه ثوبان فأتى النبي صلى الله عليه وسلم فقال: يا نبي الله إنه قد كبر على أصحابك هذه الآية. فقال رسول الله صلى الله عليه وآله وسلم \" إن الله لم يفرض الزكاة إلا ليطيب بها ما بقي من أموالكم وإنما فرض المـواريث من أموال تبقى بعدكم \" قال فكبر عمر ثم قال له النبي صلى الله عليه وسلم \" ألا أخبرك بخير ما يكنز المرء المرأة الصالحة التي إذا نظر إليها سرته وإذا أمرها أطاعته وإذا غاب عنها حفظته \" ورواه أبو داود والحاكم في مستدركه وابن مردويه من حديث يحيى بن يعلى به وقال الحاكم صحيح على شرطهما ولم يخرجاه. \" حديث آخر \"قال الإمام أحمد: حدثنا روح حدثنا الأوزاعي عن حسان بن عطية قال: كان شداد بن أوس رضي الله عنه في سفر فنزل منزلا فقال لغلامه ائتنا بالسفرة نعبث بها فأنكرت عليه فقال ما تكلمت بكلمة منذ أسلمت إلا وأنا أخطمها وأزمها غير كلمتي هذه فلا تحفظوها علي واحفظوا ما أقول لكم: سمعت رسول الله صلى الله عليه وسلم يقول \" إذا كنز الناس الذهب والفضة فاكنزوا هؤلاء الكلمات اللهم إنى أسألك الثبات في الأمر والعزيمة على الرشد وأسألك شكر نعمتك وأسألك حسن عبادتك وأسألك قلبا سليما وأسألك لسانا صادقا وأسألك من خير ما تعلم وأعوذ بك من شر ما تعلم وأستغفرك لما تعلم إنك أنت علام الغيوب \"."
    },
    {
      "ayah": 35,
      "surah": 9,
      "text": "قوله تعالى \" يوم يحمى عليها في نار جهنم فتكوى بها جباههم وجنوبهم وظهورهم هذا ما كنزتم لأنفسكم فذوقوا ما كنتم تكنزون \" أي يقال لهم هذا الكلام تبكيتا وتقريعا وتهكما كما في قوله \" ثم صبوا فوق رأسه من عذاب الحميم ذق إنك أنت العزيز الكريم \" أي هذا بذاك وهذا الذي كنتم تكنزون لأنفسكم ولهذا يقال من أحب شيئا وقدمه على طاعة الله عذب به وهؤلاء لما كان جمع هذه الأموال آثر عندهم من رضا الله عندهم عذبوا بها كما كان أبو لهب لعنه الله جاهدا في عداوة رسول الله صلى الله عليه وسلم وامرأته تعينه في ذلك كانت يوم القيامة عونا على عذابه أيضا في جيدها أي عنقها حبل من مسد أي تجمع من الحطب في النار وتلقي عليه ليكون ذلك أبلغ في عذابه ممن هو أشفق عليه في الدنيا كما أن هذه الأموال لما كانت أعز الأموال على أربابها كانت أضر الأشياء عليهم في الدار الآخرة فيحمى عليها في نار جهنم وناهيك بحرها فتكوى بها جباههم وجنوبهم وظهورهم. قال سفيان عن الأعمش عن عبدالله بن عمر بن مرة عن مسروق عن عبدالله بن مسعود: والذي لا إله غيره لا يكوى عبد يكنز فيمس دينار دينارا ولا درهم درهما ولكن يوسع جلده فيوضع كل دينار ودرهم على حدته وقد رواه ابن مردويه عن أبي هريرة مرفوعا ولا يصح رفعه والله أعلم. وقال عبدالرزاق: أخبرنا معمر عن ابن طاوس عن أبيه قال بلغني أن الكنز يتحول يوم القيامة شجاعا يتبع صاحبه وهو يفر منه ويقول: أنا كنزك لا يدرك منه شيئا إلا أخذه. وقال الإمام أبو جعفر بن جرير: حدثنا بشر حدثنا يزيد حدثنا سعيد عن قتادة عن سالم بن أبي الجعد عن معدان بن أبي طلحة عن ثوبان أن رسول الله صلى الله عليه وسلم كان يقول \" من ترك بعده كنزا مثل له يوم القيامة شجاعا أقرع له زبيبتان يتبعه ويقول ويلك ما أنت؟ فيقول أنا كنزك الذي تركته بعدك ولا يزال يتبعه حتى يلقمه يده فيقضمها ثم يتبعها سائر جسده ورواه ابن حبان في صحيحه من حديث يزيد عن سعيد به. وأصل هذا الحديث في الصحيحين من رواية أبي الزناد عن الأعرج عن أبي هريرة رضي الله عنه قال: ما من رجل لا يؤدي زكاة ماله إلا جعل له يوم القيامة صفائح من نار فيكوى بها جنبه وجبهته وظهره في يوم كان مقداره خمسين ألف سنة حتى يقضى بين العباد ثم يرى سبيله إما إلى الجنة وإما إلى النار وذكر تمام الحديث وقال البخاري في تفسير هذه الآية حدثنا قتيبة بن سعيد حدثنا جرير عن حصين عن زيد بن وهب قال: مررت على أبي ذر بالربذة فقلت: ما أنزلك بهذه الأرض؟ قال: كنا بالشام فقرأت \" والذين يكنزون الذهب والفضة ولا ينفقونها في سبيل الله فبشرهم بعذاب أليم \" فقال معاوية: ما هذه فينا ما هذه إلا في أهل الكتاب قال: قلت إنها لفينا وفيهم. ورواه ابن جرير من حديث عبيد بن القاسم عن حصين عن زيد بن وهب عن أبي ذر رضي الله عنه فذكره وزاد فارتفع في ذلك بيني وبينه القول فكتب إلى عثمان يشكوني فكتب إلي عثمان أن أقبل إليه قال فأقبلت إليه فلما قدمت المدينة ركبني الناس كأنهم لم يروني قبل يومئذ فشكوت ذلك إلى عثمان فقال لي: تنح قريبا قلت والله ما أدع ما كنت أقول \" قلت \"كان من مذهب أبي ذر رضي الله عنه تحريم ادخار ما زاد على نفقة العيال وكان يفتي بذلك ويحثهم عليه ويأمرهم به ويغلظ في خلافه فنهاه معاوية فلم ينته فخشى أن يضر بالناس في هذا فكتب يشكوه إلى أمير المؤمنين عثمان وأن يأخذه إليه فاستقدمه عثمان إلى المدينة وأنزله بالزبدة وحده وبها مات رضي الله عنه في خلافة عثمان وقد اختبره معاوية رضي الله عنه وهو عنده هل يوافق عمله قوله فبعث إليه بألف دينار ففرقها من يومه ثم بعث إليه الذي أتاه بها فقال أن معاوية إنما بعثني إلى غيرك فأخطأت فهات الذهب فقال ويحك إنها خرجت ولكن إذا جاء مالي حاسبناك به وهكذا روى على بن أبي طلحة عن ابن عباس أنها عامة وقال السدي هي في أهل القبلة وقال الأحنف بن قيس قدمت المدينة فبينما أنا في حلقة فيها ملأ من قريش إذ جاء رجل أخشن الثياب أخشن الجسد أخشن الوجه فقام عليهم فقال: بشر الكنازين برضف يحمى عليه في نار جهنم فيوضع على حلمة ثدي أحدهم حتى يخرج من نغض كتفه ويوضع على نغض كتفه حتى يخرج من حلمة ثديه يتزلزل قال فوضع القوم رءوسهم فما رأيت أحدا منهم رجع إليه شيئا قال فأدبر فاتبعته حتى جلس إلى سارية فقلت ما رأيت هؤلاء إلا كرهوا ما قلت لهم فقال إن هؤلاء لا يعلمون شيئا. وفي الصحيح أن رسول الله صلى الله عليه وسلم قال لأبي ذر \" ما يسرني أن عندي مثل أحد ذهبا يمر علي ثلاثة أيام وعندي منه شيئا إلا دينار أرصده لدين \"فهذا والله أعلم هو الذي حدا بأبي ذر على القول بهذا. وقال الإمام أحمد: حدثنا عفان حدثنا همام حدثنا قتادة عن سعيد بن أبي الحسن عن عبدالله بن الصامت رضي الله عنه أنه كان مع أبي ذر فخرج عطاؤه ومعه جارية فجعلت تقضي حوائجه ففصلت معها سبعة فأمرها أن تشتري به فلوسا. قال قلت لو ادخرته لحاجة بيوتك وللضيف ينزل بك قال إن خليلي عهد إلي أن أيما ذهب أو فضة أوكئ عليه فهو جمر على صاحبه حتى يفرغه في سبيل الله عز وجل ورواه عن يزيد عن همام به وزاد إفراغا. وقال الحافظ ابن عساكر بسنده إلى أبي بكر الشبلي في ترجمته عن محمد بن مهدي: حدثنا عمرو بن أبي سلمة عن صدقة بن عبدالله عن طلحة بن زيد عن أبي فروة الرهاوي عن عطاء عن أبي سعيد رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم الق الله فقيرا ولا تلقه غنيا \"قال: يا رسول الله كيف لي بذلك؟ قال \" ما سألت فلا تمنع وما رزقت فلا تخبئ \"قال: يا رسول الله كيف لي بذلك؟ قال رسول الله صلى الله عليه وسلم هو ذاك وإلا فالنار \"إسناده ضعيف وقال الإمام أحمد: حدثنا عفان حدثنا جعفر بن سليمان حدثنا عيينة عن يزيد بن الصرم قال: سمعت عليا رضي الله عنه يقول: مات رجل من أهل الصفة وترك دينارين أو درهمين فقال رسول الله صلى الله عليه وإله وسلم \" كيتان صلوا على صاحبكم \"وقد روى هذا من طرق أخر وقال قتادة عن شهر بن حوشب عن أبي أمامة صدى بن عجلان قال مات رجل من أهل الصفة فوجد في مئزره دينار فقال رسول الله صلى الله عليه وسلم \" كية \" ثم توفي رجل آخر فوجد في مئزره ديناران فقال رسول الله صلى الله عليه وسلم \" كيتان \" وقال ابن أبي حاتم: حدثنا أبي حدثنا أبو النضر إسحاق بن إبراهيم الفراديسي حدثنا معاوية بن يحيى الأطرابلسي حدثني أرطاة حـدثنا أبو عامر الهوزني سمعت ثوبان مولى رسول الله صلى الله عليه وسلم قال \" ما من رجل يموت وعنده أحمر أو أبيض إلا جعل الله بكل قيراط صفحة من نار يكوى بها من قدمه إلى ذقنه \" وقال الحافظ أبو يعلى: حدثنا محمد بن خداش حدثنا سيف بن محمد الثوري حدثنا الأعمش عن أبي صالح عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم \"لا يوضع الدينار على الدينار ; ولا الدرهم على الدرهم ولكن يوسع جلده فيكوى بها جباههم وجنوبهم وظهورهم هذا ما كنزتم لأنفسكم فذوقوا ما كنتم تكنزون\" سيف هذا كذاب متروك."
    },
    {
      "ayah": 36,
      "surah": 9,
      "text": "قال الإمام أحمد: حدثنا إسماعيل أخبرنا أيوب أخبرنا محمد بن سيرين عن أبي بكرة أن النبي صلى الله عليه وسلم خطب في حجته فقال \" ألا إن الزمان قد استدار كهيئته يوم خلق الله السموات والأرض السنة اثنا عشر شهرا منها أربعة حرم ثلاثة متواليات ذو القعدة وذو الحجة والمحرم ورجب مضر الذي بين جمادي وشعبان \" ثم قال \" أي يوم هذا؟ \" قلنا الله ورسوله أعلم فسكت حتى ظننا أنه سيسميه بغير اسمه قال \" أليس يوم النحر؟ \" قلنا بلى ثم قال \" أي شهر هذا؟ \" قلنا الله ورسوله أعلم فسكت حتى ظننا أنه سيسميه بغير اسمه قال \" أليس ذا الحجة؟ \" قلنا بلى ثم قال \" أي بلد هذا.؟ \" قلنا الله ورسوله أعلم فسكت حتى ظننا أنه سيسميه بغير اسمه قال \" أليست البلدة؟ \" قلنا بلى قال \" فإن دماءكم وأموالكم - وأحسبه قال - وأعراضكم عليكم حرام كحرمة يومكم هذا في شهركم هدا في بلدكم هذا. وستلقون ربكم فيسألكم عن أعمالكم ألا لا ترجعوا بعدي ضلالا يضرب بعضكم رقاب بعض ألا هل بلغت؟ ألا ليبلغ الشاهد منكم الغائب فلعل من يبلغه يكون أوعى له من بعض من سمعه\" رواه البخاري في التفسير وغيره. ومسلم من حديث أيوب عن محمد وهو ابن سيرين عن عبدالرحمن بن أبي بكرة عن أبيه به وقد قال ابن جرير: حدثنا معمر حدثنا روح حدثنا أشعث عن محمد بن سيرين عن أبي هريرة قال: قال رسول الله صلى الله عليه وسلم \" إن الزمان قد استدار كهيئته يوم خلق الله السموات والأرض وإن عدة الشهور عند الله اثنا عشر شهرا في كتاب الله يوم خلق السموات والأرض منها أربعة حرم ثلاثة متواليات - ذو القعدة وذو الحجة والمحرم - ورجب مضر الذي بين جمادى وشعبان \" ورواه البزار عن محمد بن معمر به. ثم قال لا يروى عن أبي هريرة إلا من هذا الوجه وقد رواه ابن عون وقرة عن ابن سيرين عن عبدالرحمن بن أبي بكرة عن أبيه وقال ابن جرير أيضا: حدثني موسى بن عبدالرحمن المسروقي حدثنا زيد بن حباب حدثنا موسى بن عبيدة الربذي حدثني صدقة بن يسار عن ابن عمر قال: خطب رسول الله صلى الله عليه وسلم في حجة الوداع بمنى في أوسط أيام التشريق فقال \" أيها الناس إن الزمان قد استدار فهو اليوم كهيئته يوم خلق الله السموات والأرض وإن عدة الشهور عند الله اثنا عشر شهرا منها أربعة حرم أولهن رجب مضر بين جمادى وشعبان وذو القعدة وذو الحجة والمحرم \" وروى ابن مردوية من حديث موسى بن عبيدة عن عبدالله بن دينار عن ابن عمر مثله أو نحوه وقال حماد بن سلمة حدثني علي بن زيد عن أبي حمزة الرقاشي عن عمه وكانت له صحبة قال: كنت آخذا بزمام ناقة رسول الله صلى الله عليه وسلم في أوسط أيام التشريق أذود الناس عنه فقال رسول الله صلى الله عليه وسلم \" ألا إن الزمان قد استدار كهيئه يوم خلق الله السموات والأرض وإن عدة الشهور عند الله اثنا عشر شهرا في كتاب الله يوم خلق السموات والأرض منها أربعة حرم فلا تظلموا فيهن أنفسكم \" وقال سعيد بن منصور حدثنا أبو معاوية عن الكلبي عن أبي صالح عن ابن باس في قوله \" منها أربعة حرم \" قال محرم ورجب وذو القعدة وذو الحجة وقوله صلى الله عليه وسلم في الحديث \" إن الزمان قد استدار كهيئته يوم خلق الله السموات والأرض \"تقرير منه صلوات الله وسلامه عليه وتثبيت للأمر على ما جعله الله في أول الأمر من غير تقديم ولا تأخير ولا زيادة ولا نقص ولا نسيء ولا تبديل كما قال في تحريم مكة \" إن هذا البلد حرمه الله يوم خلق السموات والأرض فهو حرام بحرمه الله تعالى إلى يوم القيامة وهكذا قال ههنا \" إن الزمان قد استدار كهيئته يوم خلق الله السموات والأرض \"أي الأمر اليوم شرعا كما ابتدع الله ذلك في كتابه يوم خلق السموات والأرضش وقد قال بعض المفسرين والمتكلمين على هذا الحديث إن المراد بقوله \" قد استدار كهيئته يوم خلق الله السموات والأرض \"أنه اتفق أن حج رسول الله صلى الله عليه وسلم في تلك السنة في ذي الحجة وأن العرب قد كانت نسأت النسيء يحجون في كثير من السنين بل أكثرها في غير ذي الحجة وزعموا أن حجة التصديق في سنة تسع كانت في ذي القعدة وفي هذا نظر كما سنبينه إذا تكلمنا عن النسيء وأغرب منه ما رواه الطبراني عن بعض السلف في جملة حديث أنه اتفق حج المسلمين واليهود والنصارى في يوم واحد وهو يوم النحر عام حجة الوداع والله أعلم. \" فصل \"ذكر الشيخ علم الدين السخاوي في جزء جمعه سماه \" المشهور في أسماء الأيام والشهور \"أن المحرم سمي بذلك لكونه شهرا محرما وعندي أنه سمي بذلك تأكيدا لتحريمه لأن العرب كانت تتقلب به فتحله عاما وتحرمه عاما قال ويجمع على محرمات ومحارم ومحاريم وصفر سمي بذلك لخلو بيوتهم منهم حين يخرجون للقتال والأسفار يقال صفر المكان إذا خلا ويجمع على أصفار كجمل وأجمال وشهر ربيع الأول سمي بذلك لارتباعهم فيه والارتباع الإقامة في عمارة الربع ويجمع على أربعاء كنصيب وأنصباء وعلى أربعة كرغيف وأرغفة وربيع الآخر كالأول وجمادي سمي بذلك لجمود الماء فيه قال: وكانت الشهور في حسابهم لا تدور وفي هذا نظر إذ كانت شهورهم منوطة بالأهلة فلابد من دورانها فلعلهم سموه بذلك أول ما سمي عند جمود الماء في البرد كما قال الشاعر: وليلة من جمادي ذات أندية لا يبصر العبد في ظلمائها الطنبا لا ينبح الكلب فيها غير واحدة حتى يلف على خرطومه الذنبــــــا ويجمع على جماديات كحبارى وحباريات وقد يذكر ويؤنث فيقال جمادي الأولى والأول وجمادي الآخر والآخرة ورجب من الترجيب وهو التعظيم ويجمع على أرجاب ورجاب ورجبات وشعبان من تشعب القبائل وتفرقها للغارة ويجمع على شعابين وشعابات ورمضان من شدة الرمضاء وهو الحر يقال رمضت الفصال إذا عطشت ويجمع على رمضانات ورماضين وأرمضة قال: وقول من قال أنه اسم من أسماء الله خطأ لا يعرج عليه ولا يلتفت إليه قلت: قد ورد في حديث ولكنه ضعيف وبينته في أول كتاب الصيام وشوال من شالت الإبل بأذنابها للطراق قال: ويجمع على شواول وشواويل وشوالات لقعدة بفتح القاف - قلت وكسرها - لقعودهم فيه عن القتال والترحال ويجمع على ذوات القعدة الحجة بكسر الحاء - قلت وفتحها - سمي بذلك لإيقاعهم الحج فيه ويجمع على ذوات الحجة أسماء الأيام أولها ألاحد ويجمع على آحاد وأوحاد ووحود ثم يوم الإثنين ويجمع على أثانين الثلاثاء يمد ويذكر ويؤنث ويجمع على ثلاثاوات وأثالث ثم الاربعاء بالمد ويجمع على أربعاوات وأرابيع والخميس يجمع على أخمسة وأخامس ثم الجمعة بضم الميم وإسكانها وفتحها أيضا ويجمع على جمع وجماعات السبت مأخوذ من السبت وهو القطع لانتهاء العدد عنده وكانت العرب تسمى الأيام أول ثم أهون ثم جبار ثم دبار ثم مؤنس ثم العروبة ثم شيار قال الشاعر: من العرب العرباء العاربة المتقدمين: أرجى أن أعيش وإن يومي بأول أو بأهون أو جبار أو التالي دبار فإن أفته فمؤنس أو عروبة أو شيار وقوله تعالى \" منها أربعة حرم \" فهذا مما كانت العرب أيضا في الجاهلية تحرمه وهو الذي كان عليه جمهورهم إلا طائفة منهم يقال لهم البسل كانوا يحرمون من السنة ثمانية أشهر تعمقا وتشديدا وأما قوله \" ثلاثة متواليات ذو القعدة وذو الحجة والمحرم ورجب مضر الذي بين جمادى وشعبان \" فإنما أضافه إلى مضر ليبين صحة قولهم في رجب أنه الشهر الذي بين جمادى وشعبان لا كما تظنه ربيعة من أن رجب المحرم هو الشهر الذي بين شعبان وشوال وهو رمضان اليوم فبين صلى الله عليه وسلم أنه رجب مضر لا رجب ربيعة وإنما كانت الأشهر المحرمة أربعة ثلاثة سرد وواحد فرد لأجل أداء مناسك الحج والعمرة فحرم قبل أشهر الحج شهرا وهو ذو القعدة لأنهم يقعدون فيه عن القتال وحرم شهر ذي الحجة لأنهم يوقعون فيه الحج ويشتغلون بأداء المناسك وحرم بعده شهرا آخر وهو المحرم ليرجعوا فيه إلى أقصى بلادهم آمنين وحرم رجب في وسط الحول لأجل زيارة البيت والاعتمار به لمن يقدم إليه من أقصى جزيرة العرب فيزوره ثم يعود إلى وطنه فيه آمنا وقوله \" ذلك الدين القيم \" أي هذا هو الشرع المستقيم من امتثال أمر الله فيما جعل من الأشهر الحرم والحذو بها على ما سبق من كتاب الله الأول قال تعالى \" فلا تظلموا فيهن أنفسكم \" أي في هذه الأشهر المحرمة لأنها آكد وأبلغ في الإثم من غيرها كما أن المعاصي في البلد الحرام تضاعف لقوله تعالى\" ومن يرد فيه بإلحاد بظلم نذقه من عذاب أليم \" وكذا الشهر الحرام تغلظ فيه الآثام ولهذا تغلظ فيه الدية في مذهب الشافعي وطائفة كثيرة من العلماء وكذا في حق من قتل في الحرم أو قتل ذا محرم وقال حماد بن سلمة عن علي بن زيد عن يوسف بن مهران عن ابن عباس في قوله \" فلا تظلموا فيهن أنفسكم \" قال في الشهور كلها وقال علي بن أبي طلحة عن ابن عباس قوله \" إن عدة الشهور عند الله \" الآية فلا تظلموا فيهن أنفسكم في كلهن ثم اختص من ذلك أربعة أشهر فجعلهن حراما وعظم حرماتهن وجعل الذنب فيهن أعظم والعمل الصالح والأجر أعظم وقال قتادة في قوله \" فلا تظلمـوا فيهن أنفسكم \" إن الظلم في الأشهر الحرم أعظم خطيئة ووزرا من الظلم فيما سواها. وإن كان الظلم على كل حال عظيما ولكن الله يعظم من أمره ما يشاء وقال: إن الله اصطفى صفايا من خلقه اصطفى من الملائكة رسلا ومن الناس رسلا واصطفى من الكلام ذكره واصطفى من الأرض المساجد واصطفى من الشهور رمضان والأشهر الحرم واصطفى من الأيام يوم الجمعة واصطفى من الليالي ليلة القدر فعظموا ما عظم الله. فإنما تعظيم الأمور بما عظمها الله به عند أهل الفهم وأهل العقل وقال الثوري عن قيس بن مسلم عن الحسن عن محمد بن الحنفية بأن لا تحرموهن كحرمتهن وقال محمد بن إسحاق \" فلا تظلموا فيهن أنفسكم \" أي لا تجعلوا حراما حلالا ولا حلالها حراما كما فعل أهل الشرك فإنما النسيء الذي كانوا يصنعون من ذلك زيادة في الكفر \" يضل به الذين كفروا \" الآية وهذا القول اختيار ابن جرير. وقوله \" وقاتلوا المشركين كافة \" أي جميعكم \" كما يقاتلونكم كافة \" أي جميعهم \" واعلموا أن الله مع المتقين \" وقد اختلف العلماء في تحريم ابتداء القتال في الشهر الحرام هل هو منسوخ أو محكم على قولين \" أحدهما \"وهو الأشهر أنه منسوخ لأنه تعالى قال ههنا \" فلا تظلموا فيهن أنفسكم \" وأمر بقتال المشركين وظاهر السياق مشعر بأنه أمر بذلك أمرا عاما ولو كان محرما في الشهر الحرام لأوشك أن يقيده بانسلاخها ولأن رسول الله صلى الله عليه وسلم حاصر أهل الطائف في شهر حرام وهو ذو القعدة كما ثبت في الصحيحين أنه خرج إلى هوازن في شوال فلما كسرهم واستفاء أموالهم ورجع فلهم لجئوا إلى الطائف فعمد إلى الطائف فحاصرهم أربعين يوما وانصرف ولم يفتحها فثبت أنه حاصر في الشهر الحرام والقول الآخر أن ابتداء القتال في الشهر الحرام حرام وأنه لم ينسخ تحريم الشهر الحرام لقوله تعالى \" يا أيها الذين آمنوا لا تحلوا شعائر الله ولا الشهر الحرام \" وقال \" الشهر الحرام بالشهر الحرام والحرمات قصاص فمن اعتدى عليكم فاعتدوا عليه بمثل ما اعتدى عليكم \" الآية وقال \" فإذا انسلخ الأشهر الحرم فاقتلوا المشركين \" الآية وقد تقدم أنها الأربعة المقررة في كل سنة لا أشهر التسيير على أحد القولين. وأما قوله تعالى \" وقاتلوا المشركين كافة كما يقاتلونكم كافة \" فيحتمل أنه منقطع عما قبله وأنه حكم مستأنف ويكون من باب التهييج والتحضيض أي كما يجتمعون لحربكم إذا حاربوكم فاجتمعوا أنتم أيضا لهم إذا حاربتموهم وقاتلوهم بنظير ما يفعلون ويحتمل أنه أذن للمؤمنين بقتال المشركين في الشهر الحرام إذا كانت البداءة منهم كما قال تعالى \" الشهر الحرام بالشهر الحرام والحرمات قصاص \" وقال تعالى \" ولا تقاتلوهم عند المسجد الحرام حتى يقاتلوكم فيه فإن قاتلوكم فاقتلوهم \" الآية. وهكذا الجواب عن حصار رسول الله صلى الله عليه وسلم أهل الطائف واستصحابه الحصار إلى أن دخل الشهر الحرام فإنه من تتمة قتال هوازن وأحلافها من ثقيف فإنهم هم الذين ابتدءوا القتال وجمعوا الرجال ودعوا إلى الحرب والنزال فعندما قصدهم رسول الله صلى الله عليه وسلم كما تقدم فلما تحصنوا بالطائف ذهب إليهم لينزلهم من حصونهم فنالوا من المسلمين وقتلوا جماعة واستمر الحصار بالمجانيق وغيرها قريبا من أربعين يوما وكان ابتداؤه في شهر حلال ودخل الشهر الحرام فاستمر فيه أياما ثم قفل عنهم لأنه يغتفر في الدوام ما لا يغتفر في الابتداء وهذا أمر مقرر وله نظائر كثيرة والله أعلم ولنذكر الأحاديث الواردة في ذلك. وقد حررنا ذلك في السيرة والله أعلم."
    },
    {
      "ayah": 37,
      "surah": 9,
      "text": "هذا مما ذم الله تعالى به المشركين من تصرفهم في شرع الله بآرائهم الفاسدة وتغييرهم أحكام الله بأهوائهم الباردة وتحليلهم ما حرم الله وتحريمهم ما أحل الله فإنهم كان فيهم من القوة الغضبية والشهامية ما استطاعوا به مدة الأشهر الثلاثة في التحريم المانع لهم من قضاء أوطارهم من قتال أعدائهم فكانوا قد أحدثوا قبل الإسلام بمدة تحليل المحرم فأخروه إلى صفر فيحلون الشهر الحرام ويحرمون الشهر الحلال ليواطئوا عدة ما حرم الله الأشهر الأربعة كما قال شاعرهم وهو عمير بن قيس المعروف بجذل الطعان: لقد علمت معد بأن قومي كرام الناس أن لهم كراما ألسنا الناسئين على معد شهور الحل نجعلها حراما فأي الناس لم ندرك بوتر وأي الناس لم نعلك لجاما وقال علي بن أبي طلحة عن ابن عباس في قوله \" إنما النسيء زيادة في الكفر \" قال النسيء: أن جنادة بن عوف بن أمية الكناني كان يوافي الموسم في كل عام وكان يكنى أبا ثمامة فينادي ألا إن أبا ثمامة لا يجاب ولا يعاب ألا وإن صفر العام الأول العام حلال فيحله للناس فيحرم صفرا عاما ويحرم المحرم عاما فذلك قول الله \" إنما النسيء زيادة في الكفر \" يقول يتركون المحرم عاما وعاما يحرمونه وروى العوفي عن ابن عباس نحوه وقال ليث بن أبي سليم عن مجاهد: كان رجل من بني كنانة يأتي كل عام إلى الموسم على حمار له فيقول أيها الناس: إني لا أعاب ولا أجاب ولا مرد لما أقول إنا قد حرمنا المحرم وأخرنا صفر. ثم يجيء العام المقبل بعده فيقول مثل مقالته ويقول إنا قد حرمنا صفر وأخرنا المحرم فهو قوله \" ليواطئوا عدة ما حرم الله \" قال: يعني الأربعة فيحلوا ما حرم الله بتأخير هذا الشهر الحرام وروى عن أبي وائل والضحاك وقتادة نحو هذا وقال عبدالرحمن بن زيد بن أسلم في قوله \" إنما النسيء زيادة في الكفر \" الآية. قال هذا رجل من بني كنانة يقال له القلمس وكان في الجاهلية لا يغير بعضهم على بعض في الشهر الحرام يلقى الرجل قاتل أبيه ولا يمد إليه يده فلما كان هو قالوا اخرجوا بنا قالوا له هذ المحرم قال ننسئه العام هما العام صفران فإذا كان العام القابل قضينا جعلناهما محرمين قال ففعل ذلك فلما كان عام قابل قال لا تغزوا في صفر حرموه مع المحرم هما محرمان فهذه صفة غريبة في النسيء وفيها نظر لأنهم في عام إنما يحرمون على هذا ثلاثة أشهـر فقط وفي العام الذي يليه يحرمون خمسة أشهر فأين هذا من قوله تعالى \" يحلونه عاما ويحرمونه عاما ليواطئوا عدة ما حرم الله \" وقد روي عن مجاهد صفة أخرى غريبة أيضا فقال عبدالرزاق: أنا معمر عن أبي نجيح عن مجاهد في قوله تعالى \" إنما النسيء زيادة في الكفر \" الآية قال فرض الله عز وجل الحج في ذي الحجة قال: وكان المشركون يسمون ذا الحجة المحرم وصفر وربيع وربيع وجمادى وجمادى ورجب وشعبان ورمضان وشوالا وذا القعدة وذا الحجة يحجون فيه مرة أخرى ثم يسكتون عن المحرم ولا يذكرونه ثم يعودون فيسمون صفرا ثم يسمون رجب جمادى الآخر ثم يسمون شعبان رمضان ثم يسمون شوالا رمضان ثم يسمون ذا القعدة شوالا ثم يسمون ذا الحجة ذا القعدة ثم يسمون المحرم ذا الحجة فيحجون فيه واسمه عندهم ذو الحجة ثم عادوا بمثل هذه الصفة فكانوا يحجون في كل شهر عامين حتى إذا وافق حجة أبي بكر الآخر من العامين في ذي القعدة ثم حج النبي صلى الله عليه وسلم حجته التي حج فوافق ذا الحجة فذلك حين يقول النبي صلى الله عليه وسلم في خطبته \" إن الزمان قد استدار كهيئته يوم خلق الله السموات والأرض \" وهذا الذي قاله مجاهد فيه نظر أيضا وكيف تصح حجة أبي بكر وقد وقعت في ذي القعدة وأنى هذا؟ وقد قال الله تعالى \" وأذان من الله ورسوله إلى الناس يوم الحج الأكبر أن الله بريء من المشركين ورسوله \" الآية وإنما نودي به في حجة أبي بكر فلو لم تكن في ذي الحجة لما قال تعالى \" يوم الحج الأكبر \" ولا يلزم من فعلهم النسيء هذا الذي ذكره من دوران السنة عليهم وحجهم في كل شهر عامين فإن النسيء حاصل بدون هذا فإنهم لما كانوا يحلون شهر المحرم عاما يحرمون عوضه صفرا وبعده ربيع وربيع إلى آخر السنة بحالها على نظامها وعدتها وأسماء شهورها ثم في السنة الثانية يحرمون المحرم ويتركونه على تحريمه وبعده صفر وربيع وربيع إلى آخرها \" فيحلونه عاما ويحرمونه عاما ليواطئوا عدة ما حرم الله فيحلوا ما حرم الله \" أي في تحريم أربعة أشهر من السنة إلا أنهم تارة يقدمون تحريم الشهر الثالث من الثلاثة المتوالية وهو المحرم وتارة ينسئونه إلى صفر أي يؤخرونه وقد قدمنا الكلام على قوله صلى الله عليه وسلم \" إن الزمان قد استدار \" الحديث أي إن الأمر في عدة الشهور وتحريم ما هو محرم منها على ما سبق في كتاب الله من العدد والتوالي لا كما تعتمده جهلة العرب من فصلهم تحريم بعضها بالنسيء عن بعض والله أعلم وقال ابن أبي حاتم: حدثنا صالح بن بشر بن سلمة الطبراني حدثنا مكي بن إبراهيم حدثنا موسى بن عبيدة عن عبدالله بن دينار عن ابن عمر أنه قال: وقف رسول الله صلى الله عليه وسلم بالعقبة اجتمع إليه من شاء الله من المسـلمين فحمد الله وأثنى عليه بما هو له أهل ثم قال \" وإنما النسيء من الشيطان زيادة في الكفر يضل به الذين كفروا يحلونه عاما ويحرمونه عاما \" فكانوا يحرمون المحرم عاما ويستحلون صفر ويستحلون المحرم وهو النسيء\" وقد تكلم الإمام محمد بن إسحاق على هذا في كتاب السيرة كلاما جيدا مفيدا حسنا فقال: كان أول من نسأ الشهور على العرب فأحل منها ما حرم الله وحرم منها ما أحل الله عز وجل القلمس وهو حذيفة بن عبد فقيم بن عدي بن عامر بن ثعلبة بن الحارث بن مالك بن كنانة بن خزيمة بن مدركة بن إلياس بن مضر بن نزار بن معد بن عدنان ثم قام بعده على ذلك ابنه عباد ثم من بعد عباد ابنه قلع بن عباد ثم ابنه أمية بن قلع ثم ابنه عوف بن أمية ثم ابنه أبو ثمامة جنادة بن عوف وكان آخرهم وعليه قام الإسلام فكانت العرب إذا فرغت من حجها اجتمعت إليه فقام فيهم خطيبا فحرم رجبا وذا القعدة وذا الحجة ويحل المحرم عاما ويجعل مكانه صفر ويحرمه عاما ليواطئوا عدة ما حرم الله فيحل ما حرم الله يعني ويحرم ما أحل الله. والله أعلم."
    },
    {
      "ayah": 38,
      "surah": 9,
      "text": "هذا شروع في عتاب من تخلف عن رسول الله صلى الله عليه وسلم في غزوة تبوك حين طابت الثمار والظلال في شدة الحر وحمارة القيظ فقال تعالى \" يا أيها الذين آمنوا مالكم إذا قيل لكم انفروا في سبيل الله \" أي إذا دعيتم إلى الجهاد في سبيل الله \" اثاقلتم في الأرض \" أي تكاسلتم وملتم إلى المقام في الدعة والخفض وطيب الثمار \" أرضيتم بالحياة الدنيا من الآخرة \" أي ما لكم فعلتم هكذا رضا منكم بالدنيا بدلا من الآخرة ثم زهد تبارك وتعالى في الدنيا. ورغب في الآخرة فقال \" فما متاع الحياة الدنيا في الآخرة إلا قليا \" كما قال الإمام أحمد: حدثنا وكيع ويحيى بن سعيد قالا: حدثنا إسماعيل بن أبي خالد عن قيس عن المستورد أخي بني فهر قال: قال رسول الله صلى الله عليه وسلم \" ما الدنيا في الآخرة إلا كما يجعل أحدكم أصبعه هذه في اليم فلينظر بما ترجع؟ وأشار بالسبابة انفرد بإخراجه مسلم. وروى ابن أبي حاتم حدثنا بشر بن مسلم بن عبد الحميد الحمصي بحمص حدثنا الربيع ابن روح حدثنا محمد بن خالد الوهبى حدثنا زياد يعني الجصاص عن أبي عثمان قال: قات يا أبا هريرة سمعت من إخواني بالبصرة أنك تقول سمعت نبي الله صلى الله عليه وسلم يقول \" إن الله يجزي بالحسنة ألف ألف حسنه \" قال أبو هريرة: بل سمعت رسول الله صلى الله عليه وسلم يقول \" إن الله يجزي بالجسنة ألفي ألف حسنة \"ثم تلا هذه الآية \" فما متاع الحياة الدنيا في الآخرة إلا قليل \" فالدنيا ما مضى منها وما بقى منها عند الله قليل. وقال الثوري عن الأعمش في الآية \" فما متاع الحياة الدنيا في الآخرة إلا قليل \" قال كزاد الراكب وقال عبد العزيز بن أبي حازم عن أبيه لما حضرت عبد العزيز بن مروان الوفاة قال: ائتوني بكفني الذي أكفن فيه أنظر إليه فلما وضع بين يديه نظر إليه فقال: أما لي من كبير ما أخلف من الدنيا إلا هذا؟ ثم ولى ظهره فبكى وهو يقول أف لك من دار إن كان كثير لقليل وإن كان قليلك لقصير وإن كنا منك لفي غرور."
    },
    {
      "ayah": 39,
      "surah": 9,
      "text": "ثم توعد تعالى من ترك الجهاد فقال \" إلا تنفروا يعذبكم عذابا أليما \" قال ابن عباس: استنفر رسول الله صلى الله عليه وسلم حيا من العرب فتثاقلوا عنه فأمسك الله عنهم القطر فكان عذابهم \" ويستبدل قوما غيركم \" أي لنصرة نبيه وإقامة دينه كما قال تعالى \" وإن تتولوا يستبدل قوما غيركم ثم لا يكونوا أمثالكم \" \" ولا تضروه شيئا \" أي ولا تضروا الله شيئا بتوليكم عن الجهاد ونكولكم وتثاقلكم عنه \" والله على كل شيء قدير \" أي قادر على الانتصار من الأعداء بدونكم وقد قيل إن هذه الآية وقوله \" انفروا خفافا وثقالا \" وقوله \" وما كان لأهل المدينة ومن حولهم من الأعراب أن يتخلفوا عن رسول الله \" أنهن منسوخات بقوله تعالى \" وما كانوا المؤمنين لينفروا كافة فلولا نفر من كل فرقة منهم طائفة \" روى هذا عن ابن عباس وعكرمة والحسن وزيد بن أسلم ورده ابن جرير وقال إنما هذا فيمن دعاهم رسول الله صلى الله عليه وسلم إلى الجهاد فتعين عليهم ذلك فلو تركوه لعوقبوا عليه وهذا له اتجاه والله سبحانه وتعالى أعلم بالصواب."
    },
    {
      "ayah": 4,
      "surah": 9,
      "text": "هذا استثناء من ضرب مدة التأجيل بأربعة أشهر لمن له عهد مطلق ليس بمؤقت فأجله أربعة أشهر يسيح فيه الأرض يذهب فيها لينجو بنفسه حيث شاء إلا من له عهد مؤقت فأجله إلى مدته المضروبة التي عوهد عليها وقد تقدمت الأحاديث ومن كان له عهد مع رسول الله صلى الله عليه وسلم فعهده إلى مدته وذلك بشرط أن لا ينقض المعاهد عهده ولم يظاهر على المسلمين أحدا أي يمالئ عليهم من سواهم فهذا الذي يوفى له بذمته وعهده إلى مدته. ولهذا حرض تعالى على الوفاء بذلك فقال \" إن الله يحب المتقين \" أي الموفين بعهدهم."
    },
    {
      "ayah": 40,
      "surah": 9,
      "text": "يقول تعالى \" إلا تنصروه \" أي تنصروا رسوله فإن الله ناصره ومؤيده وكافيه وحافظه كما تولى نصره \" إذ أخرجه الذين كفروا ثاني اثنين \" أي عام الهجرة لما هم المشركين بقتله أو حبسه أو نفيه فخرج منهم هاربا صحبه صديقه وصاحبه أبو بكر بن أبي قحافة فلجأ إلى غار ثور ثلاثة أيام ليرجع الطلب الذين خرجوا في آثارهم ثم يسيروا نحو المدينة فجعل أبو بكر رضي الله عنه يجزع أن يطلع عليهم فيخلص إلى الرسول عليه الصلاة والسلام منهم أذي فجعل النبي صلى الله عليه وسلم يسكنه ويثبته ويقول \" يا أبا بكر ما ظنك باثنين الله ثالثهما \"كما قال الإمام أحمد حدثنا عفان حدثنا همام أنبأنا ثابت عن أنس أن أبا بكر حدثه قال: قلت للنبي صلى الله عليه وسلم ونحن في الغار لو أن أحدهم نظر إلى قدميه لأبصرنا تحت قدميه قال: فقال \" يا أبا بكر ما ظنك باثنين الله ثالثهما \" أخرجاه في الصحيحين ولهذا قال تعالى \" فأنزل الله سكينته عليه \" أي تأييده ونصره عليه أي على الرسول صلى الله عليه وسلم في أشهر القولين وقيل على أبي بكر وروي عن ابن عباس وغيره قالوا: لأن الرسول صلى الله عليه وسلم لم تزل معه سكينة وهذا لا ينافي تجدد سكينة خاصة بتلك الحال ولهذا قال \" وأيده بجنود لم تروها \" أي الملائكة \" وجعل كلمة الذين كفروا السفلى وكلمة الله هي العليا \" قال ابن عباس: يعني بكلمة الذين كفروا الشرك وكلمة الله هي لا إله إلا الله. وفي الصحيحين عن أبي موسى الأشعري رضي الله عنه قال: سئل رسول الله صلى الله عليه وسلم عن الرجل يقاتل شجاعة ويقاتل حمية ويقاتل رياء أي ذلك في سبيل الله؟ فقال \" من قاتل لتكون كلمة الله هي العليا فهو في سبيل الله \" وقوله \" والله عزيز \" أي في انتقامه وانتصاره منيع الجناب لا يضام من لاذ ببابه واحتمى بالتمسك بخطابه \" حكيم \" في أقواله وأفعاله."
    },
    {
      "ayah": 41,
      "surah": 9,
      "text": "قال سفيان الثوري عن أبيه عن أبي الضحى مسلم بن صبيح: هذه الآية \" انفروا خفافا وثقالا \" أول ما نزل من سورة براءة وقال معتمر بن سليمان عن أبيه قال: زعم حضرمي أنه ذكر له أن ناسا كانوا عسى أن يكون أحدهم عليا وكبيرا فيقول إنى لا آثم فأنزل الله \" انفروا خفافا وثقالا \" الآية أمر الله تعالى بالنفير العام مع رسول الله صلى الله عليه وآله وسلم عام غزوة تبوك لقتال أعداء الله من الروم الكفرة من أهل الكتاب وحتم على المؤمنين في الخروج معه على كل حال في المنشط والمكره والعسر واليسر فقال \" انفروا خفافا وثقالا \" وقال علي بن زيد عن أنس عن أبي طلحة: كهولا وشبانا ما سمع الله عذر أحد ثم خرج إلى الشام فقاتل حتى قتل وفي رواية قرأ أبو طلحة سورة براءة فأتى على هذه الآية \" انفروا خفافا وثقالا وجاهدوا بأموالكم وأنفسكم في سبيل الله \" فقال: أرى ربنا استنفرنا شيوخا وشبانا جهزوني يا بني فقال بنوه: يرحمك الله قد غزوت مع رسول الله صلى الله عليه وآله وسلم حتى مات ومع أبي بكر حتى مات ومع عمر حتى مات فنحن نغزو عنك فأبى فركب البحر فمات فلم يجدوا له جزيرة يدفنوه فيها إلا بعد تسعة أيام فلم يتغير فدفنوه فيها وهكذا روي عن ابن عباس وعكرمة وأبي صالح والحسن البصري وسهيل بن عطية ومقاتل بن حيان والشعبي وزيد بن أسلم أنهم قالوا في تفسير هذه الآية \" انفروا خفافا وثقالا \" كهولا وشبانا. وكذا قال عكرمة والضحاك ومقاتل بن حيان وغير واحد وقال مجاهد: شبانا وشيوخا وأغنياء ومساكين وكذا قال أبو صالح وغيره قال الحكم بن عتيبة: مشاغيل وغير مشاغيل وقال العوفي عن ابن عباس في قوله تعالى \" انفروا خفافا وثقالا \" يقول انفروا نشاطا وغير نشاط وكذا قال قتادة وقال ابن أبي نجيح عن مجاهد \" انفروا خفافا وثقالا \" قالوا: فإن فينا الثقيل وذو الحاجة والضيعة والشغل والمتيسر به أمره فأنزل الله وأبى أن يعذرهم دون أن ينفروا \" خفافا وثقالا \" أي على ما كان منهم. وقال الحسن بن أبي الحسن البصري أيضا في العسر واليسر وهذا كله من مقتضيات العموم في الآية وهذا اختيار ابن جرير. وقال الإمام أبو عمرو الأوزاعي: إذا كان النفير إلى دروب الروم نفر الناس إليها خفافا وركبانا وإذا كان النفير إلى هذه السواحل نفروا إليها خفافا وثقالا وركبانا ومشاة وهذا تفصيل في المسألة وقد روي عن ابن عباس ومحمد بن كعب وعطاء الخراساني وغيرهم أن هذه الآية منسوخة بقوله تعالى \" فلولا نفر من كل فرقة منهم طائفة \" وسيأتي الكلام على ذلك إن شاء الله وقال السدي قوله \" انفروا خفافا وثقالا \" يقول غنيا وفقيرا وقويا وضعيفا فجاءه رجل يومئذ زعموا أنه المقداد وكان عظيما سمينا فشكى إليه وسأله أن يأذن له فأبى فنزلت يومئذ \" انفروا خفافا وثقالا\" فلما نزلت هذه الآية اشتد على الناش فنسخها الله تعالى \" ليس على الضعفاء ولا على المرضى ولا على الذين لا يجدون ما ينفقون حرج إذا نصحوا لله ورسوله \" وقال ابن جرير: حدثني يعقوب حدثنا ابن علية حدثنا أيوب عن محمد قال: شهد أبو أيوب مع رسول الله صلى الله عليه وسلم بدرا ثم لم يتخلف عن غزاة للمسلمين إلا عاما واحدا قال وكان أبو أيوب يقول: قال الله تعالى \" انفروا خفافا وثقالا فلا أجدني إلا خفيفا أو ثقيلا وقال ابن جرير: حدثني سعيد بن عمر السكوني حدثنا بقية حدثنا جرير حدثني عبدالرحمن بن ميسرة حدثني أبو راشد الحراني قال: وافيت المقدام بن الأسود فارس رسول الله صلى الله عليه وإله وسلم جاسا على تابوت من توابيت الصيارفة بحمص وقد فصل عنها من عظمه يريد الغزو فقلت له قد أعذر الله إليك فقال أتت علينا سورة البعوث \" انفروا خفافا وثقالا \" وقال ابن جرير: حدثني حيان بن زيد الشرعي قال: نفرنا مع صفوان بن عمرو وكان واليا على حمص قبل الأفسوس إلى الجراجمة فرأيت شيخا كبيرا هما قد سقط حاجباه على عينيه من أهل دمشق على راحلته فيمن أغار فأقبلت إليه فقلت يا عم لقد أعذر الله إليك قال: فرفع حاجبيه فقال يا بن أخي استنفرنا الله خفافا وثقالا ألا إنه من يحبه الله يبتليه ثم يعيده الله فيبقيه وإنما يبتلي الله من عبادة من شكر وصبر وذكر ولم يعبد إلا الله عز وجل. ثم رغب تعالى في النفقة في سبيله وبذل المهج في مرضاته ومرضاة رسوله فقال \" وجاهدوا بأموالكم وأنفسكم في سبيل الله ذلكم خير لكم إن كنتم تعلمون \" أي هذا خير لكم في الدنيا والآخرة لأنكم تغرمون في النفقة قليلا فيغنمكم الله أموال عدوكم في الدنيا مع ما يدخر لكم من الكرامة في الآخرة كما قال النبي صلى الله عليه وسلم \" تكفل الله للمجاهد في سبيله إن توفاه أن يدخله الجنة أو يرده إلى منزله بما نال من أجر أو غنيمة \" ولهذا قال تعالى \" كتب عليكم القتال وهو كره لكم وعسى أن تكرهوا شيئا وهو خير لكم وعسى أن تحبوا شيئا وهو شر لكم والله يعلم وأنتم لا تعلمون \" ومن هذا القبيل ما رواه الإمام أحمد: حدثنا محمد بن أبي عدي عن حميد عن أنس عن رسول الله صلى الله عليه وإله وسلم قال لرجل \" \" أسلم \"قال أجدني كارها قال أسلم ولو كنت كارها \"."
    },
    {
      "ayah": 42,
      "surah": 9,
      "text": "يقول تعالى موبخا للذين تخلفوا عن النبي صلى الله عليه وسلم في غزوة تبوك وقعدوا بعد ما استأذنوه في ذلك مظهرين أنهم ذوو أعذار ولم يكونوا كذلك فقال \" لو كان عرضا قريبا \" قال ابن عباس: غنيمة قريبة \" وسفرا قاصدا \" أي قريبا أيضا \" لاتبعوك أي لكانوا جاءوا معك لذلك ولكن بعدت عليهم الشقة أي المسافة إلى الشام وسيحلفون بالله أي لكم إذا رجعتم إليهم لو استطعنا لخرجنا معكم أي لو لم يكن لنا أعذار لخرجنا معكم قال الله تعالى يهلكون أنفسهم والله يعلم إنهم لكاذبون."
    },
    {
      "ayah": 43,
      "surah": 9,
      "text": "قال ابن أبي حاتم: حدثنا أبي حدثنا أبو حصين بن سليمان الرازي حدثنا سفيان بن عيينة عن مسعر عن عون قال: هل سمعتم بمعاتبة أحسن من هذا؟ نداء بالعفو قبل المعاتبة فقال عفا الله عنك لم أذنت لهم وكذا قال مورق العجلي وغيره وقال قتادة: عاتبه كما تسمعون ثم أنزل التي في سورة النور فرخص له في أن يأذن لهم إن شاء فقال \" فإذا أستأذنوك لبعض شأنهم فائذن لمن شئت منهم \" الآية. وكذا روي عن عطاء الخراساني وقال مجاهد نزلت هذه الآية في أناس قالوا استأذنوا رسول الله صلى الله عليه وسلم فإن أذن لكم فاقعدوا وإن لم يأذن لكم فاقعدوا ولهذا قال تعالى \" حتى يتبين لك الذين صدقوا \" أي في إبداء الأعذار \" وتعلم الكاذبين \"."
    },
    {
      "ayah": 44,
      "surah": 9,
      "text": "يقول تعالى هلا تركتهم لما استأذنوك فلم تأذن لأحد منهم في القعود لتعلم الصادق منهم في إظهار طاعتك من الكاذب فإنهم قد كانوا مصرين على القعود عن الغزو وإن لم تأذن لهم فيه. ولهذا أخبر تعالى أنه لا يستأذنه في القعود عن الغزو أحد يؤمن بالله ورسوله فقال \" لا يستأذنك \" أي في القعود عن الغزو \". الذين يؤمنون بالله واليوم الآخر أن يجاهدوا بأموالهم وأنفسهم \" لأنهم يرون الجهاد قربة ولما ندبهم إليه بادروا وامتثلوا \"."
    },
    {
      "ayah": 45,
      "surah": 9,
      "text": "إنما يستأذنك \" أي في القعود ممن لا عذر له \" الذين لا يؤمنون بالله واليوم الآخر \" أي لا يرجون ثواب الله في الدار الآخرة على أعمالهم \" وارتابت قلوبهم \" أي شكت في صحة ما جئتهم به \" فهم في ريبهم يترددون \" أي يتحيرون يقدمون رجلا ويؤخرون أخرى وليست لهم قدم ثابتة في شيء فهم قوم حيارى هلكى لا إلى هؤلاء ولا إلى هؤلاء ومن يضلل الله فلن تجد له سبيلا."
    },
    {
      "ayah": 46,
      "surah": 9,
      "text": "يقول تعالى \" ولو أرادوا الخروج \" أي معك إلى الغزو \" لأعدوا له عدة \" أي لكانوا تأهبوا له \" ولكن كره الله انبعاثهم \" أي أبغض أن يخرجوا معكم قدرا \" فثبطهم \" أي أخرهم \" وقيل اقعدوا مع القاعدين \" أي قدرا ثم بين تعالى وجه كراهيته لخروجهم مع المؤمنين."
    },
    {
      "ayah": 47,
      "surah": 9,
      "text": "فقال \" لو خرجوا فيكم ما زادوكم إلا خبالا \" أي لأنهم جبناء مخذولون \" ولأوضعوا خلالكم يبغونكم الفتنة \" أي ولأسرعوا السير والمشي بينكم بالنميمة والبغضاء والفتنة \" وفيكم سماعون لهم \" أي مطيعون لهم ومستحسنون لحديثهم وكلامهم يستنصحونهم وإن كانوا لا يعلمون حالهم فيؤدي إلى وقوع شر بين المؤمنين وفساد كبير. وقال مجاهد وزيد بن أسلم وابن جرير \" وفيكم سماعون. لهم \" أي عيون يسمعون لهم الأخبار وينقلونها إليهم. وهذا لا يبقى له اختصاص بخروجهم معهم بل هذا عام في جميع الأحوال والمعنى الأول أظهر في المناسبة بالسياق وإليه ذهب قتادة وغيره من المفسرين. وقال محمد بن إسحاق كان الذين استأذنوا فيما بلغني من ذوي الشرف منهم عبدالله بن أبي بن سلول والجد بن قيس وكانوا أشرافا في قومهم فثبطهم الله لعلمه بهم أن يخرجوا معه فيفسدوا عليه جنده وكان في جند\" قوم أهل محبة لهم وطاعة فيما يدعونهم إليه لشرفهم فيهم فقال \" وفيكم سماعون لهم \" ثم أخبر تعالى عن تمام علمه فقال \" والله عليم بالظالمين \" فأخبر بأنه يعلم ما كان وما يكون وما لم يكن لو كان كيف كان يكون ولهذا قال تعالى \" لو خرجوا فيكم ما زادوكم إلا خبالا \" فأخبر عن حالهم كيف يكون لو خرجوا ومع هذا ما خرجوا كما قال تعالى \" ولو ردوا لعادوا لما نهوا عنه وإنهم لكاذبون \" وقال تعالى \" ولو علم الله فيهم خيرا لأسمعهم ولو أسمعهم لتولوا وهم معرضون \" وقال تعالى \" ولو أنا كتبنا عليهم أن اقتلوا أنفسكم أو اخرجوا من دياركم ما فعلوه إلا قليل منهم ولو أنهم فعلوا ما يوعظون به لكان خيرا لهم وأشد تثبيتا وإذا لآتيناهم من لدنا أجرا عظيما ولهديناهم صراطا مستقيما \" والآيات في هذا كثيرة."
    },
    {
      "ayah": 48,
      "surah": 9,
      "text": "يقول تعالى محرضا لنبيه عليه السلام على المنافقين \" لقد ابتغوا الفتنة من قبل وقلبوا لك الأمور \" أي لقد أعملوا فكرهو وأجالوا آراءهم في كيدك وكيد أصحابك وخذلان دينك وإخماده مدة طويلة وذلك أول مقدم النبي صلى الله عليه وسلم المدينة رمته العرب عن قوس واحدة وحاربته يهود المدينة ومنافقوها فلما نصره الله يوم بدر وأعلى كلمته قال عبدالله بن أبي وأصحابه هذا أمر قد توجه فدخلوا في الإسلام ظاهرا ثم كلما أعز الله الإسلام وأهله غاظهم ذلك وساءهم ولهذا قال تعالى حتى جاء الحق وظهر أمر الله وهم كارهون."
    },
    {
      "ayah": 49,
      "surah": 9,
      "text": "يقول تعالى: ومن المنافقين من يقول لك يا محمد ائذن لي في القعود ولا تفتني بالخروج معك بسبب الجواري من نساء الروم قال الله تعالى ألا في الفتنة سقطوا أي قد سقطوا في الفتنة بقولهم هذا كما قال محمد بن إسحاق عن الزهري ويزيد بن رومان وعبدالله بن أبي بكر وعاصم بن قتادة وغيرهم قالوا: قال رسول الله صلى الله عليه وإله وسلم ذات يوم وهو في جهازه للجد بن قيس أخي بني سلمة هل لك يا جد العام في جلاد بني الأصفر؟ فقال يا رسول الله أو تأذن لي ولا تفتني فوالله لقد عرفت قومي ما رجل أشد عجبا بالنساء مني وإني أخشى إن رأيت نساء بني الأصفر أن لا أصبر عنهن فأعرض عنه رسول الله صلى الله عليه وسلم وقال قد أذنت لك ففي الجد بن قيس نزلت هذه ومنهم من يقول ائذن لي ولا تفتني الآية أي إن كان إنما يخشى من نساء بني الأصفر وليس ذلك به فما سقط فيه من الفتنة بتخلفه عن رسول الله صلى الله عليه وسلم والرغبة بنفسه عن نفسه أعظم وهكذا روي عن ابن عباس ومجاهد وغير واحد أنها نزلت في الجد بن قيس وقد كان الجد بن قيس هذا من أشراف بني سلمة. وفي الصحيح أن رسول الله صلى الله عليه وسلم قال لهم من سيدكم يا بني سلمة؟ قالوا الجد بن قيس على أنا نبخله. فقال رسول الله صلى الله عليه وسلم وأي دواء أدوأ من البخل ! ولكن سيدكم الفتى الجعد الأبيض بشر بن البراء بن معرور وقوله تعالى \"وإن جهنم لمحيطة بالكافرين\" أي لا محيد لهم عنها ولا محيص ولا مهرب."
    },
    {
      "ayah": 5,
      "surah": 9,
      "text": "اختلف المفسرون في المراد بالأشهر الحـرم ههنا ما هي فذهب ابن جرير إلى أنها المذكورة في قوله تعالى \" منها أربعة حرم ذلك الدين القيم فلا تظلموا فيهن أنفسكـم \" الآية قاله أبو جعفر الباقر ولكن قال ابن جرير: آخر الأشهر الحرم في حقهم المحرم وهذا الذي ذهب إليه حكاه علي بن أبي طلحة عن ابن عباس وإليه ذهب الضحاك أيضا وفيه نظر والذي يظهر من حيث السياق ما ذهب إليه ابن عباس في رواية العوفي عنه وبه قال مجاهد وعمرو بن شعيب ومحمد بن إسحاق وقتادة والسدي وعبدالرحمن بن زيد بن أسلم أن المراد بها أشهر التسيير الأربعة المنصوص عليها بقوله \" فسيحوا في الأرض أربعة أشهر \" ثم قال \" فإذا انسلخ الأشهر الحرم \" أي إذا انقضت الأشهر الأربعة التي حرمنا عليكم فيها قتالهم وأجلناهم فيها فحيثما وجدتموهم فاقتلوهم لأن عود العهد على مذكور أولى من مقدر ثم إن الأشهر الأربعة المحرمة سيأتي بيان حكمها في آية أخرى بعد في هذه السورة الكريمة وقوله \" فاقتلوا المشركين حيث وجدتموهم \" أي من الأرض وهذا عام والمشهور تخصيصه بتحريم القتال في الحرم بقوله \" ولا تقاتلوهم عند المسجد الحرام حتى يقاتلوكم فيه فإن قاتلوكم فاقتلوهم \" وقوله \" وخذوهم \" أي وأْسروهم إن شئتم قتلا وإن شئتم أسرا وقوله \" واحصروهم واقعدوا لهم كل مرصد \" أي لا تكتفوا بمجرد وجدانكم لهم. بل اقصدوهم بالحصار في معاقلهم وحصونهم والرصد في طرقهم ومسالكهم حتى تضيقوا عليهم الواسع وتضطروهم إلى القتل أو الإسلام ولهذا قال \" فإن تابوا وأقاموا الصلاة وآتوا الزكاة فخلوا سبيلهم إن الله غفور رحيم \" ولهذا اعتمد الصديق رضي الله عنه في قتال مانعي الزكاة على هذه الآية الكريمة وأمثالها حيث حرمت قتالهم بشرط هذه الأفعال وهي الدخول في الإسلام والقيام بأداء واجباته ونبه بأعلاها على أدناها فإن أشرف أركان الإسلام بعد الشهادتين الصلاة التي هي حق الله عز وجل وبعدها أداء الزكاة التي هي نفع متعد إلى الفقراء والمحاويج وهي أشرف الأفعال المتعلقة بالمخلوقين ولهذا كثيرا ما يقرن الله بين الصلاة والزكاة وقد جاء في الصحيحين عن ابن عمر رضي الله عنهما عن رسول الله صلى الله عليه وسلم أنه قال \" أمرت أن أقاتل الناس حتى يشهدوا أن لا إله إلا الله وأن محمدا رسول الله ويقيموا الصلاة ويؤتوا الزكاة \" الحديث وقال أبو إسحاق عن أبي عبيدة عن عبدالله بن مسعود رضي الله عنه قال: أمرتم بإقام الصلاة وإيتاء الزكاة ومن لم يزك فلا صلاة له. وقال عبدالرحمن بن زيد بن أسلم أبى الله أن يقبل الصلاة إلا بالزكاة وقال يرحم الله أبا بكر ما كان أفقهه. وقال الإمام أحمد: حدثنا علي بن إسحاق أنبأنا عبدالله بن المبارك أنبأنا حميد الطويل عن أنس أن رسول الله صلى الله عليه وسلم قال \" أمرت أن أقاتل الناس حتى يشهدوا أن لا إله إلا الله وأن محمدا رسول الله ; فإذا شهـدوا أن لا إله إلا الله وأن محمدا رسول الله واستقبلوا قبلتنا وأكلوا ذبيحتنا وصلوا صلاتنا ; فقد حرمت علينا دماؤهم وأموالهم إلا بحقها ; لهم ما للمسلمين وعليهم ما عليهم \" ورواه البخاري في صحيحه وأهل السنن إلا ابن ماجه من حديث عبدالله بن المبارك به. وقال الإمام أبو جعفر بن جرير حدثنا عبد الأعلى بن واصل الأسدي حدثنا عبيد الله بن موسى أخبرنا أبو جعفر الرازي عن الربيع بن أنس قال: قال رسول الله صلى الله عليه وسلم \" من فارق الدنيا على الإخلاص لله وحده وعبادته لا يشرك به شيئا فارقها والله عنه راض \" قال وقال أنس: هو دين الله الذي جاءت به الرسل وبلغوه عن ربهم قبل هرج الأحاديث واختلاف الأهواء وتصديق ذلك في كتاب الله في آخر ما أنزل قال الله تعالى \" فإن تابوا وأقاموا الصلاة وآتوا الزكاة فخلوا سبيلهم \" قال: توبتهم خلع الأوثان وعبادة ربهم وإقام الصلاة وإيتاء الزكاة ثم قال في آية أخرى \" فإن تابوا أقاموا الصلاة وآتوا الزكاة فإخوانكم في الدين \" ورواه ابن مردويه ورواه محمد بن نصر المروذي في كتاب الصلاة له. حدثنا إسحق بن إبراهيم أنبأنا حكام بن سلمة حدثنا أبو جعفر الرازي به سواء وهذه الآية الكريمة هي آية السيف التي قال فيها الضحاك بن مزاحم أنها نسخت كل عهد بين النبي صلى الله عليه وسلم وبين أحد من المشركين وكل عقد وكل مدة وقال العوفي عن ابن عباس في هذه الآية: لم يبق لأحد من المشركين عهد ولا ذمة منذ نزلت براءة وانسلاخ الأشهر الحرم ومدة من كان له عهد من المشركين قبل أن تنزل براءة أربعة أشهر من يوم أذن ببراءة إلى عشر من أول شهر ربيع الآخر وقال علي بن أبي طلحة عن ابن عباس في هذه الآية قال: أمره الله تعالى أن يضع السيف فيمن عاهد إن لم يدخلوا في الإسلام ونقض ما كان سمي لهم من العقد والميثاق وأذهب الشرط الأول وقال ابن أبي حاتم حدثنا أبي حدثنا إسحق بن موسى الأنصاري قال: قال سفيان بن عيينة قال علي بن أبي طالب: بعث النبي صلى الله عليه وسلم بأربعة أسياف سيف في المشركين من العرب قال الله تعالى \" فاقتلوا المشركين حيث وجدتموهم \" هكذا رواه مختصرا وأظن أن السيف الثاني هو قتال أهل الكتاب لقوله تعالى \" قاتلوا الذين لا يؤمنون بالله ولا باليوم الآخر ولا يحرمون ما حرم الله ورسوله ولا يدينون دين الحق من الذين أوتوا الكتاب حتى يعطوا الجزية عن يد وهم صاغرون \" \" والسيف الثالث \"قتال المنافقين في قوله \" يا أيها النبي جاهد الكفار والمنافقين \" الآية. \" والرابع \"قتال الباغين في قوله \" وإن طائفتان من المؤمنين اقتتلوا فأصلحوا بينهما فإن بغت إحداهما عن الأخرى فقاتلوا التي تبغي حتى تفيء إلى أمر الله \" ثم اختلف المفسرون في آية السيف هذه فقال الضحاك والسدي هي منسوخة بقوله تعالى \" فإما منا بعد وإما فداء \" وقال قتادة بالعكس."
    },
    {
      "ayah": 50,
      "surah": 9,
      "text": "يعلم تبارك وتعالى نبيه صلى الله عليه وسلم بعداوة هؤلاء له لأنه مهما أصابه من حسنة أي فتح ونصر وظفر على الأعداء مما يسره ويسر أصحابه ساءهم ذلك وإن تصبك مصيبة يقولوا قد أخذنا أمرنا من قبل أي قد احترزنا من متابعته من قبل هذا ويتولوا وهم فرحون."
    },
    {
      "ayah": 51,
      "surah": 9,
      "text": "فأرشد الله تعالى رسول الله صلى الله عليه وسلم إلى جوابهم في عداوتهم هذه التامة فقال قل أي: لهم لن يصيبنا إلا ما كتب الله لنا أي نحن تحت مشيئته وقدره وهو مولانا أي سيدنا وملجؤنا وعلى الله فليتوكل المؤمنون أي ونحن متوكلون عليه وهو حسبنا ونعم الوكيل."
    },
    {
      "ayah": 52,
      "surah": 9,
      "text": "يقول تعالى قل لهم يا محمد قل هل تربصون بنا أي تنتظرون بنا إلا إحدى الحسنيين شهادة أو ظفر بكم قاله ابن عباس ومجاهد وقتادة وغيرهم ونحن نتربص بكم أي ننتظر بكم أن يصيبكم الله بعذاب من عنده أو بأيدينا أي ننتظر بكم هذا أو هذا إما أن يصيبكم الله بعذاب من عنده أو بأيدينا بسبي أو قتل \" فتربصوا إنا معكم متربصون \"."
    },
    {
      "ayah": 53,
      "surah": 9,
      "text": "وقوله تعالى \" قل أنفقوا طوعا أو كرها \" أي مهما أنفقتم من نفقة طائعين أو مكرهين \" لن يتقبل منكم إنكم كنتم قوما فاسقين \"."
    },
    {
      "ayah": 54,
      "surah": 9,
      "text": "ثم أخبر تعالى عن سبب ذلك وهو أنهم لا يتقبل منهم لأنهم كفروا بالله وبرسوله أي والأعمال إنما تصح بالإيمان \" ولا يأتون الصلاة إلا وهم كسالى \" أي ليس لهم قدم صحيح ولا همة في العمل \" ولا ينفقون \" نفقة \" إلا وهم كارهون \" وقد أخبر الصادق المصدوق صلى الله عليه وسلم \" أن الله لا يمل حتى تملوا وأن الله طيب لا يقبل إلا طيبا \" فلهذا لا يقبل الله من هؤلاء نفقة ولا عملا لأنه إنما يتقبل من المتقين."
    },
    {
      "ayah": 55,
      "surah": 9,
      "text": "يقول تعالى لرسوله صلى الله عليه وسلم \" فلا تعجبك أموالهم ولا أولادهم \" كما قال تعالى \" ولا تمدن عينيك إلى ما متعنا به أزواجا منهم زهرة الحياة الدنيا لنفتنهم فيه ورزق ربك خير وأبقى \" وقال \" أيحسبون أن ما نمدهم به من مال وبنين نسارع لهم في الخيرات بل لا يشعرون \" وقوله \" إنما يريد الله ليعذبهم بها في الحياة الدنيا \" قال الحسن البصري بزكاتها والنفقة منها في سبيل الله وقال قتادة هذا من المقدم والمؤخر تقديره: فلا تعجبك أموالهم ولا أولادهم في الحياة الدنيا إنما يريد الله ليعذبهم بها في الآخرة. واختار ابن جرير قول الحسن وهو القول القوي الحسن. وقوله \" وتزهق أنفسهم وهم كافرون \" أي ويريد أن يميتهم حين يميتهم على الكفر ليكون ذلك أنكى لهم وأشد لعذابهم. عياذا بالله من ذلك وهذا يكون من باب الاستدراج لهم فيما هم فيه."
    },
    {
      "ayah": 56,
      "surah": 9,
      "text": "يخبر الله تعالى نبيه صلى الله عليه وسلم عن جزعهم وفزعهم وفرقهم وهلعهم أنهم \" يحلفون بالله إنهم لمنكم \" يمينا مؤكدة \" وما هم منكم \" أي في نفس الأمر \" ولكنهم قوم يفرقون \" أي فهو الذي حملهم على الحلف."
    },
    {
      "ayah": 57,
      "surah": 9,
      "text": "\" لو يجدون ملجأ \" أي حصنا يتحصنون به وحرزا يتحرزون به \" أو مغارات \" وهي التي في الجبال \" أو مدخلا \" وهو السرب في الأرض والنفق قال ذلك في الثلاثة ابن عباس ومجاهد وقتادة \" لولوا إليه وهم يجمحون \" أي يسرعون في ذهابهم عنكم لأنهم إنما يخالطونكم كرها لا محبة وودوا أنهم لا يخالطونكم ولكن للضروة أحكام ولهذا لا يزالون في هم وحزن وغم لأن الإسلام وأهله لا يزال في عز ونصر ورفعة فلهذا كلما سر المسلمون ساءهم ذلك فهم يودون أن لا يخالطوا المؤمنين ولهذا قال \"لو يجدون ملجأ أو مغارات أو مدخلا لولوا إليه وهم يجمحون\"."
    },
    {
      "ayah": 58,
      "surah": 9,
      "text": "يقول تعالى \" ومنهم \" أي ومن المنافقين \" من يلمزك \" أي يعيب عليك \" في \" قسم \" الصدقات \" إذا فرقتها ويتهمك في ذلك وهم المتهمون المأبونون وهم مع هذا لا ينكرون للدين وإنما ينكرون لحظ أنفسهم ولهذا \" إن أعطوا \" من الزكاة \" رضوا وإن لم يعطوا منها إذا هم يسخرون \" أي يغضبون لأنفسهم. قال ابن جريج: أخبرني داود بن أبي عاصم قال: أتي النبي صلى الله عليه وسلم بصدقة فقسمها ههنا وههنا حتى ذهبت قال ووراءه رجل من الأنصار فقال ما هذا بالعدل فنزلت هذه الآية وقال قتادة في قوله \" ومنهم من يلمزك في الصدقات \" يقول ومنهم من يطعن عليك في الصدقات وذكر لنا أن رجلا من أهل البادية حديث عهد بأعرابية أتى النبي صلى الله عليه وسلم وهو يقسم ذهبا وفضة فقال يا محمد والله لئن كان الله أمرك أن تعدل ما عدلت فقال نبي الله صلى الله عليه وسلم \" ويلك فمن ذا الذي يعدل عليك بعدي؟\"ثم قال نبي الله احذروا هذا وأشباهه فإن في أمتي أشباه هذا يقرءون القرآن لا يجاوز تراقيهم فإذا خرجوا فاقتلوهم ثم إذا خرجوا فاقتلوهم ثم إذا خرجوا فاقتلوهم وذكر لنا أن نبي الله صلى الله عليه وسلم كان يقول والذي نفسي بيده ما أعطيكم شيئا ولا أمنعكموه إنما أنا خازن وهذا الذي ذكره قتادة يشبه ما رواه الشيخان من حديث الزهري عن أبي سلمة عن أبي سعيد في قصة ذي الخويصرة واسمه حرقوص لما اعترض على النبي صلى الله عليه وسلم حين قسم غنائم حنين فقال له اعدل فإنك لم تعدل فقال لقد خبت وخسرت إن لم أكن أعدل ثم قال رسول الله صلى الله عليه وإله وسلم وقد رآه مقفيا إنه يخرج من ضئضئي هذا قوم يحقر أحدكم صلاته مع صلاتهم وصيامه مع صيامهم يمرقون من الدين مروق السهم من الرمية فأينما لقيتموهم فاقتلوهم فإنهم شر قتلى تحت أديم السماء وذكر بقية الحديث ثم قال تعالى منبها لهم على ما هو خير لهم من ذلك."
    },
    {
      "ayah": 59,
      "surah": 9,
      "text": "فقال \" ولو أنهم رضوا ما آتاهم الله ورسوله وقالوا حسبنا الله سيؤتينا الله من فضله ورسوله إنا إلى الله راغبون \" فتضمنت هذه الآية الكريمة أدبا عظيما وسرا شريفا حيث جعل الرضا بما آتاه الله ورسوله والتوكل على الله وحده وهو قوله \" وقالوا حسبنا الله \" وكذلك الرغبة إلى الله وحده في التوفيق لطاعة الرسول صلى الله عليه وسلم وامتثال أوامره وترك زواجره وتصديق أخباره والاقتفاء بآثاره."
    },
    {
      "ayah": 6,
      "surah": 9,
      "text": "يقول تعالى لنبيه صلوات الله وسلامه عليه \" وإن أحد من المشركين \" الذين أمرتك بقتالهم وأحللت لك استباحة نفوسهم وأموالهم \" استجارك \" أي استأمنك فأجبه إلى طلبته حتى يسمع كلام الله أي القرآن تقرءوه عليه وتذكر له شيئا من أمر الدين تقيم به عليه حجة الله \" ثم أبلغه مأمنه \" أي وهو آمن مستمر الأمان حتى يرجع إلى بلاده وداره ومأمنه \" ذلك بأنهم قوم لا يعلمون \" أي إنما شرعنا أمان مثل هؤلاء ليعلموا دين الله وتنتشر دعوة الله في عباده وقال ابن أبي نجيح عن مجاهد في تفسير هذه الآية قال: إنسان يأتيك ليسمع ما تقول وما أُنزل عليك فهو آمن حتى يأتيك فتسمعه كلام الله وحتى يبلغ مأمنه حيث جاء ومن هذا كان رسول الله صلى الله عليه وسلم يعطي الأمان لمن جاءه مسترشدا أو في رسالة كما جاء يوم الحديبية جماعة من الرسل من قريش منهم عروة بن مسعود ومكرز بن حفص وسهيل بن عمرو وغيرهم واحدا بعد واحد يترددون في القضية بينه وبين المشركين فرأوا من إعظام المسلمين رسول الله صلى الله عليه وسلم ما بهرهم وما لم يشاهدوه عند ملك ولا قيصر فرجعوا إلى قومهم وأخبروهم بذلك وكان ذلك وأمثاله من أكبر أسباب هداية أكثرهم ولهذا أيضا لما قدم رسول مسيلمة الكذاب على رسول الله صلى الله عليه وسلم قال له أتشهد أن مسيلمة رسول الله؟ قال نعم. فقال رسول الله صلى الله عليه وسلم لولا أن الرسل لا تقتل لضربت عنقك. وقد قيض الله له ضرب العنق في إمارة ابن مسعود على الكوفة وكان يقال له ابن النواحة ظهر عنه في زمان ابن مسعود أنه يشهد لمسيلمة بالرسالة فأرسل إليه ابن مسعود فقال له إنك الآن لست في رسالة وأمر به فضربت عنقه لا رحمه الله ولعنه والغرض أن من قدم من دار الحرب إلى دار الإسلام في أداء رسالة أو تجارة أو طلب صلح أو مهادنة أو حمل جزية أو نحو ذلك من الأسباب وطلب من الإمام أو نائبه أمانا أعطي أمانا مادام مترددا في دار الإسلام ويجوز أن يمكن من إقامة أربعة أشهر وفيما بين ذلك فيما زاد على أربعة أشهر ونقص عن سنة قولان عن الإمام الشافعي وغيره من العلماء رحمهم الله."
    },
    {
      "ayah": 60,
      "surah": 9,
      "text": "لما ذكر تعالى اعتراض المنافقين الجهلة على النبي صلى الله عليه وسلم ولمزهم إياه في قسم الصدقات بين تعالى أنه هو الذي قسمها وبين حكمها وتولى أمرها بنفسه ولم يكل قسمها إلى أحد غيره فجزأها لهؤلاء المذكورين كما رواه الإمام أبو داود في سننه من حديث عبدالرحمن بن زياد بن أنعم وفيه ضعف عن زياد بن نعيم عن زياد بن الحارث الصدائي رضي الله عنه قال: أتيت النبي صلى الله عليه وسلم فبايعته فأتى رجل فقال أعطني من الصدقة فقال له إن الله لم يرض بحكم نبي ولا غيره في الصدقات حتى حكم فيها هو فجزأها ثمانية أصناف فإن كنت من تلك الأجزاء أعطيتك وقد اختلف العلماء في هذه الأصناف الثمانية هل يجب استيعاب الدفع لها أو إلى ما أمكن منها؟ على قولين أحدهما أنه يجب ذلك وهو قول الشافعي وجماعة والثاني أنه لا يجب استيعابها بل يجوز الدفع إلى واحد منها ويعطي جميع الصدقة مع وجود الباقين وهو قول مالك وجماعة من السلف والخلف منهم عمر وحذيفة وابن عباس وأبو العالية وسعيد بن جبير وميمون بن مهران قال ابن جرير وهو قول عامة أهل العلم وعلى هذا فإنما ذكرت الأنصاف ههنا لبيان المصرف لا لوجوب استيعابها ولوجوه الحجاج والمآخذ مكان غير هذا والله أعلم. وإنما قدم الفقراء ههنا على البقية لأنهم أحوج من غيرهم على المشهور ولشدة فاقتهم وحاجتهم وعن أبي حنيفة أن المسكين أسوأ حالا من الفقير وهو كما قال أحمد وقال ابن جرير: حدثني يعقوب حدثنا ابن علية أنبأنا ابن عون عن محمد قال: قال عمر رضي الله عنه الفقير ليس بالذي لا مال له ولكن الفقير الأخلق الكسب قال ابن عليه الأخلق المحارف عندنا والجمهور على خلافه وروى عن ابن عباس ومجاهد والحسن البصري وابن زيد واختار ابن جرير وغير واحد أن الفقير هو المتعفف الذي لا يسأل الناس شيئا والمسكين هو الذي يسأل ويطوف ويتبع الناس وقال قتادة الفقير من به زمانة والمسكين الصحيح الجسم وقال الثوري عن منصور عن إبراهيم هم فقراء المهاجرين قال سفيان الثوري يعني ولا يعطي الأعراب منها شيئا وكذا روى عن سعيد بن جبير وسعيد بن عبدالرحمن ابن أبزي وقال عكرمة لا تقولوا لفقراء المسلمين مساكين إنما المساكين أهل الكتاب ولنذكر أحاديث تتعلق بكل الأصناف الثمانية فأما الفقراء فعن ابن عمر قال: قال رسول الله صلى الله عليه وسلم لا تحل الصدقة لغني ولا لذي مرة سوى رواه أحمد وأبو داود والترمذي ولأحمد أيضا والنسائي وابن ماجه عن أبي هريرة مثله وعن عبيد الله بن عدي بن الخيار أن رجلين أخبراه أنهما أتيا النبي صلى الله عليه وسلم يسألانه من الصدقة فقلب فيهما البصر فرآهما جلدين فقال \" إن شئتما أعطيتكما ولا حظ فيها لغني ولا لقوي مكتسب \" رواه أحمد وأبو داود والنسائي بإسناد جيد قوي وقال ابن أبي حاتم في كتاب الجرح والتعديل: أبو بكر العبسي قال: قرأ رضي الله عنه \" إنما الصدقات للفقراء \" قال هم أهل الكتاب روى عنه عمر بن نافع سمعت أبي يقول ذلك \" قلت \"وهذا قول غريب جدا بتقدير صحة الإسناد فإن أبا بكر هذا وإن لم ينعى أبو حاتم على جهالته لكنه في حكم المجهول وأما المساكين فعن أبي هريرة رضي الله عنه أن رسول الله صلى الله عليه وسلم قال \" ليس المسكين بهذا الطواف الذي يطوف على الناس فترده اللقمة واللقمتان والتمرة والتمرتان \" قالوا فما المسكين يا رسول الله؟ قال الذي لا يجد غنى يغنيه ولا يفطن له فيتصدق عليه ولا يسأل الناس شيئا \" رواه الشيخان. وأما العاملون عليها فهم الجباة والسعاة يستحقون منها قسطا على ذلك ولا يجوز أن يكونوا من أقرباء رسول الله صلى الله عليه وسلم الذين تحرم عليهم الصدقة لما ثبت في صحيح مسلم عن عبد المطلب بن ربيعة بن الحارث أنه أنطلق هو والفضل بن العباس يسألان رسول الله صلى الله عليه وسلم ليستعملهما على الصدقة فقال \" إن الصدقة لا تحل لمحمد ولا لآل محمد إنما هي أوساخ الناس \". وأما المؤلفة قلوبهم فأقسام: منهم من يعطى ليسلم كما أعطى النبي صلى الله عليه وآله وسلم صفوان بن أمية من غنائم حنين وقد كان شهدها مشركا قال فلم يزل يعطيني حتى سار أحب الناس إلي بعد أن كان أبغض الناس إلي كما قال الإمام أحمد: حدثنا زكريا بن عدي أنا ابن المبارك عن يونس عن الزهري عن سعيد بن المسيب عن صفوان بن أمية قال: أعطاني رسول الله صلى الله عليه وسلم يوم حنين وإنه لأبغض الناس إلي فما زال يعطيني حتى إنه لأحب الناس إلي ورواه مسلم والترمذي من حديث يونس عن الزهري به ومنهم من يعطى ليحسن إسلامه ويثبت قلبه كما أعطى يوم حنين أيضا جماعة من صناديد الطلقاء وأشرافهم مائة من الإبل مائة من الإبل وقال \" إنى لأعطي الرجل وغيرُه أحب إلي منه خشية أن يكبه الله على وجهه في نار جهنم \". وفي الصحيحين عن أبي سعيد أن عليا بعث إلى النبي صلى الله عليه وآله وسلم بذهبية في تربتها من اليمين فقسمها بين أربعة نفر: الأقرع بن حابس وعينة بن بدر وعلقمة بن علاثة وزيد الخير وقال \" أتألفهم \" ومنهم من يعطى لما يرجى من إسلام نظرائه ومنهـا من يعطى ليجبي الصدقات ممن يليه أو ليدفع عن حوزة المسلمين الضرر من أطراف البلاد ومحل تفصيل هذا في كتب الفروع والله أعلم. وهل تعطى المؤلفة على الإسلام بعد النبي صلى الله عليه وسلم؟ فيه خلاف فروي عن عمر وعامر والشعبي وجماعة أنهم لا يعطون بعده لأن الله قد أعز الإسلام وأهله ومكن لهم في البلاد وأذل لهم رقاب العباد. وقال آخرون بل يعطون لأنه عليه الصلاة والسلام قد أعطاهم بعد فتح مكة وكسر هوازن وهذا أمر قد يحتاج إليه فصرف إليهم. وأما الرقاب فروي عن الحسن البصري ومقاتل بن حيان وعمر بن عبد العزيز وسعيد بن جبير والنخعي والزهري وابن زيد أنهم المكاتبون وروي عن أبي موسى الأشعري نحوه وهو قول الشافعي والليث رضي الله عنهما. وقال ابن عباس والحسن لا بأس أن تعتق الرقبة من الزكاة وهو مذهب أحمد ومالك وإسحاق أي أن الرقاب أعم من أن يعطي المكاتب أو يشتري رقبة فيعتقها استقلالا وقد ورد في ثواب الإعتاق وفك الرقبة أحاديث كثيرة وأن الله يعتق بكل عضو منها عضوا من معتقها حتى الفرج بالفرج وما ذاك إلا لأن الجزاء من جنس العمل \" وما تجزون إلا ما كنتم تعملون \" وعن أبي هريرة رضي الله عنه أن النبي صلى الله عليه وسلم قال \" ثلاثة حق على الله عونهم: الغازي في سبيل الله والمكاتب الذي يريد الأداء والناكح الذي يريد العفاف \" رواه الإمام أحمد وأهل السنن إلا أبا داود وفي المسند عن البراء بن عازب قال: جاء رجل فقال يا رسول الله دلني على عمل يقربني من الجنة ويباعدني من النار فقال \" أعتق النسمة وفك الرقبة \" فقال: يا رسول الله أوليسا واحدا؟ قال \" لا عتق النسمة أن تفرد بعتقها وفك الرقبة أن تعين في ثمنها \" وأما الغارمون فهم أقسام فمنهم من تحمل حمالة أو ضمن دينا فلزمه فأجحف بماله أو غرم في أداء دينه أو في معصية ثم تاب فهؤلاء يدفع إليهم والأصل في هذا الباب حديث قبصة بن مخارق الهلالي قال: تحملت حمالة فأتيت رسول الله صلى الله عليه وسلم أسأله فيها فقال أقم حتى تأتينا الصدقة فنأمر لك بها قال ثم قال يا قبيصة إن المسألة لا تحل إلا لأحد ثلاثة رجل تحمل حمالة فحلت له المسألة حتى يصيبها ثم يمسك ورجل أصابته جائحة اجتاحت ماله فحلت له المسألة حتى يصيب قواما من عيش أو قال سدادا من عيش ورجل أصابته فاقة حتى يقوم ثلاثة من ذوي الحجا من قرابة قومه فيقولون لقد أصابت فلانا فاقة فحلت له المسألة حتى يصيب قواما من عيش أو قال سدادا من عيش فما سواهن من المسألة سحت يأكلها صاحبها سحتا رواه مسلم وعن أبي سعيد قال أصيب رجل في عهد رسول الله صلى الله عليه وآله وسلم في ثمار ابتاعها فكثر دينه فقال النبي صلى الله عليه وسلم تصدقوا عليه فتصدق الناس عليه فلم يبلغ ذلك وفاء دينه فقال النبي صلى الله عليه وسلم لغرمائه خذوا ما وجدتم وليس لكم إلا ذلك رواه مسلم وقال الإمام أحمد حدثنا عبد الصمد أنبأنا صدقة بن موسى عن أبي عمران الجوني عن قيس بن يزيد عن قاضي المصرين عن عبدالرحمن بن أبي بكر قال: قال رسول الله صلى الله عليه وسلم يدعو الله بصاحب الدين يوم القيامة حتى يوقف بين يديه فيقول: يا بن آدم فيم أخذت هذا الدين وفيم ضيعت حقوق الناس؟ فيقول يا رب أنت أعلم أني أخذته فلم آكل ولم أشرب ولم أضيع ولكن أتى على يدي إما حرق وإما سرق وإما وضيعة فيقول الله. صدق عبدي أنا أحق من قضى عنك اليوم فيدعو الله بشيء فيضعه في كفة ميزانه فترجح حسناته على سيئاته فيدخل الجنة بفضل الله ورحمته وأما في سبيل الله فمنهم الغزاة الذين لاحق لهم في الديوان وعند الإمام أحمد والحسن وإسحاق والحج في سبيل الله للحديث وكذلك ابن السبيل وهو المسافر المجتاز في بلد ليس معه شيء يستعين به على سفره فيعطى من الصدقات ما يكفيه إلى بلده وإن كان له مال وهكذا الحكم فيمن أراد إنشاء سفر من بلده وليس معه شيء فيعطى من مال الزكاة كفايته في ذهابه وإيابه والدليل على ذلك الآية وما رواه أبو داود وابن ماجه من حديث معمر عن زيد بن أسلم عن عطاء بن يسار عن أبي سعيد رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم لا تحل الصدقة لغني إلا لخمسة: العامل عليها أو رجل اشتراها بماله أو غارم أو غاز في سبيل الله أو مسكين تصدق عليه منها فأهدى لغني وقد رواه السفيانان عن زيد بن أسلم عن عطاء مرسلا ولأبي داود عن عطية العوفي عن أبي سعيد الخدري قال: قال رسول الله صلى الله عليه وسلم لا تحل الصدقة لغني إلا في سبيل الله وابن السبيل أو جار فقير فيهدي لك أو يدعوك وقوله فريضة من الله أي حكما مقدرا بتقدير الله وفرضه وقسمه والله عليم حكيم أي عليم بظواهر الأمور وبواطنها وبمصالح عباده حكيم فيما يقوله ويفعله ويشرعه ويحكم به لا إله إلا هو ولا رب سواه."
    },
    {
      "ayah": 61,
      "surah": 9,
      "text": "يقول تعالى ومن المنافقين قوم يؤذون النبي صلى الله عليه وسلم بالكلام فيه ويقولون هو أذن أي من قال له شيئا صدقه فينا ومن حدثه صدقه فإذا جئناه وحلفنا له صدقنا روي معناه عن ابن عباس ومجاهد وقتادة قال الله تعالى قل أذن خير لكم أي هو أذن خير يعرف الصادق من الكاذب يؤمن بالله ويؤمن للمؤمنين أي ويصدق المؤمنين ورحمة للذين آمنوا منكم وهو حجة على الكافرين ولهذا قال تعالى:\" والذين يؤذون رسول الله لهم عذاب اليم\"."
    },
    {
      "ayah": 62,
      "surah": 9,
      "text": "قال قتادة في قوله تعالى يحلفون بالله لكم ليرضوكم. الآية قال ذكر لنا أن رجلا من المنافقين قال والله إن هؤلاء لخيارنا وأشرافنا وإن كان ما يقول محمد حقا لهم شر من الحمير. قال: فسمعها رجل من المسلمين فقال: والله إن ما يقول محمد لحق ولأنت أشر من الحمار. قال فسعى بهل الرجل إلى النبي صلى الله عليه وسلم فأخبره فأرسل إلى الرجل فدعاه فقال \" ما حملك على الذي قلت؟ \" فجعل يلتعن ويحلف بالله ما قال ذلك وجعل الرجل المسلم يقول: اللهم صدِّق الصامت وكذِّب الكاذب فأنزل الله الآية."
    },
    {
      "ayah": 63,
      "surah": 9,
      "text": "وقوله تعالى \" ألم يعلموا أنه من يحادد الله ورسوله \" الآية أي ألم يتحققوا ويعلموا أنه من حاد الله عز وجل أي شاقه وحاربه وخالفه وكان في حد والله ورسوله في حد \" فأن له نار جهنم خالدا فيها \" أي مهانا معذبا و\" ذلك الخزي العظيم \" أي وهذا هو الذل العظيم والشقاء الكبير."
    },
    {
      "ayah": 64,
      "surah": 9,
      "text": "قال مجاهد: يقولون القول بينهم ثم يقولون عسى الله أن لا يفشي علينا سرنا هذا وهذه الآية شبيهة بقوله تعالى \" وإذا جاءوك حيوك بما لم يحيك به الله ويقولون في أنفسهم لولا يعذبنا الله بما نقول حسبهم جهنم يصلونها فبئس المصير \" وقال في هذه الآية \" قل استهزءوا إن الله مخرج ما تحذرون \" أي إن الله سينزل على رسوله ما يفضحكم به ويبين له أمركم كقوله تعالى \" أم حسب الذين في قلوبهم مرض أن لن يخرج الله أضغانهم\" -إلى قوله -\" ولتعرفنهم في لحن القول \" الآية ولهذا قال قتادة كانت تسمى هذه السورة الفاضحة فاضحة المنافقين."
    },
    {
      "ayah": 65,
      "surah": 9,
      "text": "قال أبو معشر المدني عن محمد بن كعب القرظي وغيره قالوا: قال رجل من المنافقين ما أرى قراءنا هؤلاء إلا أرغبنا بطونا وأكذبنا ألسنة وأجبننا عند اللقاء. فرفع ذلك إلى رسول الله صلى الله عليه وسلم وقد ارتحل وركب ناقته فقال يا رسول الله إنما كنا نخوض ونلعب. فقال \" أبالله وآياته ورسوله كنتم تستهزئون\" - إلى قوله -\" كانوا مجرمين \" وإن رجليه لتسفعان الحجارة وما يلتفت إليه رسول الله صلى الله عليه وسلم وهو متعلق بسيف رسول الله صلى الله عليه وآله وسلم. وقال عبدالله بن وهب: أخبرني هشام بن سعد عن زيد بن أسلم عن عبدالله بن عمر قال: قال رجل في غزوة تبوك في مجلس: ما رأيت مثل قرائنا هؤلاء أرغب بطونا لا أكذب ألسنا ولا أجبن عند اللقاء. فقال رجـل في المسجد: كذبت ولكنك منافق لأخبرن رسول الله صلى الله عليه وسلم. فبلغ ذلك رسول الله صلى الله عليه وسلم ونزل القرآن فقال عبدالله بن عمر أنا رأيته متعلقا بحقب ناقة رسول الله صلى الله عليه وسلم تنكبه الحجارة وهو يقول يا رسول الله إنما كنا نخوض ونلعب ورسول الله صلى الله عليه وآله وسلم يقول \" أبالله وآياته ورسوله كنتم تستهزئون \" الآية. وقد رواه الليث عن هشام بن سعد بنحو من هذا. وقال ابن إسحاق وقد كان جماعة من المنافقين منهم وديعة بن ثابت أخو بني أمية بن زيد بن عمرو بن عوف ورجل من أشجع حليف لبني سلمة يقال له مخشي بن حمير يسيرون مع رسول الله صلى الله عليه وسلم وهو منطلق إلى تبوك فقال بعضهم لبعض أتحسبون جلاد بني الأصفر كقتال العرب بعضهم بعضا والله لكأنا بكم غدا مقرنين في الحبال إرجافا وترهيبا للمؤمنين فقال مخشي بن حمير والله لوددت أن أقاضي على أن يضرب كل رجل منا مائة جلدة وإننا نغلب أن ينزل فينا قرآن لمقالتكم هذه وقال رسول الله صلى الله عليه وسلم فيما بلغني لعمار بن ياسر \" أدرك القوم فإنهم قد احترقوا فاسألهم عما قالوا فإن أنكروا فقل بلى قلتم كذا وكذا \" فانطلق إليهم عمار فقال ذلك لهم فأتوا رسول الله صلى الله عليه وسلم يعتذرون إليه فقال وديعة بن ثابت ورسول الله صلى الله عليه وسلم واقف على راحلته فجعل يقول وهو آخذ بحقبها: يا رسول الله إنما كنا نخوض ونلعب فقال مخشي بن حمير يا رسول الله قعد بي اسمي واسم أبي فكان الذي عفا عنه في هذه الآية مخشي بن حمير فتسمى عبدالرحمن وسأل الله أن يقتل شهيدا لا يعلم بمكانه فقتل يوم اليمامة ولم يوجد له أثر وقال قتادة ولئن سألتهم ليقولن إنما كنا نخوض ونلعب قال فبينما النبي صلى الله عليه وآله وسلم في غزوة تبوك وركب من المنافقين يسيرون بين يديه فقالوا يظن هذا أن يفتح قصور الروم وحصونها هيهات هيهات فأطلع الله نبيه صلى الله عليه وآله وسلم على ما قالوا فقال علي بهؤلاء النفر فدعاهم فقال قلتم كذا وكذا فحلفوا ماكنا إلا نخوض ونلعب وقال عكرمة في تفسير هذا الآية كان رجل ممن إن شاء الله عفا عنه يقول اللهم إني أسمع آية أنا أعنى بها تقشعر الجلود وتجب منها القلوب اللهم فاجعل وفاتي قتلا في سبيلك لا يقول أحد أنا غسلت أنا كفنت أنا دفنت قال فأصيب يوم اليمامة فما من أحد من المسلمين إلا وقد وجد غيره."
    },
    {
      "ayah": 66,
      "surah": 9,
      "text": "وقوله \" لا تعتذروا قد كفرتم بعد إيمانكم \" أي بهذا المقال الذي استهزأتم به إن نعف عن طائفة منكم نعذب طائفة أي لا يعفى عن جميعكم ولا بد من عذاب بعضكم بأنهم كانوا مجرمين أي مجرمين بهذه المقالة الفاجرة الخاطئة."
    },
    {
      "ayah": 67,
      "surah": 9,
      "text": "يقول تعالى منكرا على المنافقين الذين هم على خلاف صفات المؤمنين ولما كان المؤمنون يأمرون بالمعروف وينهون عن المنكر كان هؤلاء يأمرون بالمنكر وينهون عن المعروف ويقبضون أيديهم أي على الإنفاق في سبيل الله \"نسوا الله\" أي نسوا ذكر الله\" فنسيهم \"أي عاملهم معاملة من نسيهم كقوله تعالى\"فاليوم ننساكم كما نسيتم لقاء يومكم هذا\" \" إن المنافقين هم الفاسقين\" أي الخارجون من طريق الحق الداخلون في طريق الضلالة."
    },
    {
      "ayah": 68,
      "surah": 9,
      "text": "وقوله وعد الله المنافقين والمنافقات والكفار نار جهنم أي على هذا الصنيع الذي ذكر عنهم خادين فيها أي ماكثين فيها مخلدين هم الكفار هي حسبهم أي كفايتهم في العذاب ولعنهم الله أي طردهم أو بعدهم ولهم عذاب مقيم."
    },
    {
      "ayah": 69,
      "surah": 9,
      "text": "يقول تعالى أصاب هؤلاء من عذاب الله تعالى في الدنيا والآخرة كما أصاب من قبلهم وقوله بخلاقهم قال الحسن بأيديهم وقوله\" وخضتم كالذي خاضوا\" أي في الكذب والباطل أولئك حبطت أعمالهم أي بطلت مساعيهم فلا ثواب لهم عليها لأنها فاسدة في الدنيا والآخرة وأولئك هم الخاسرون لأنهم لم يحصل لهم عليها ثواب قال ابن جرير عن عمرو بن عطاء عن عكرمة عن ابن عباس في قوله كالذين من قبلكم الآية قال ابن عباس ما أشبه الليلة بالبارحة\" كالذين من قبلكم\" هؤلاء بنو إسرائيل شبهنا بهم لا أعلم إلا أنه قال والذي نفسي بيده لتتبعنهم حتى لو دخل الرجل منهم جحر ضب لدخلتموه قال ابن جريج وأخبرني زياد بن سعد عن محمد بن زياد بن مهاجر عن سعيد بن أبي سعيد المقبري عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم والذي نفسي بيده لتتبعن سنن الذين من قبلكم شبرا بشبر وذراعا بذراع وباعا بباع حتى لو دخلوا جحر ضب لدخلتموه قالوا ومن هم يا رسول الله؟ أهل الكتاب قال فمن؟ وهكذا رواه أبو معشر عن أبي سعيد المقبري عن أبي هريرة عن النبي صلى الله عليه وسلم فذكره وزاد قال أبو هريرة اقرءوا إن شئتم القرآن\" كالذين من قبلكم\"الآية. قال أبو هريرة: الخلاق: الدين \" وخضتم كالذي خاضوا \" قالوا يا رسول الله كما صنعت فارس والروم؟ قال فهل الناس إلا هم؟ وهذا الحديث له شاهد في الصحيح."
    },
    {
      "ayah": 7,
      "surah": 9,
      "text": "بين تعالى حكمته في البراءة من المشركين ونظرته إياهم أربعة أشهر ثم بعد ذلك السيف المرهف أين ثقفوا فقال تعالى \" كيف يكون للمشركين عهد \" أي أمان ويتركون فيما هم فيه وهم مشركون بالله كافرون به وبرسوله \" إلا الذين عاهدتم عند المسجد الحرام \" يعني يوم الحديبية كما قال تعالى \" هم الذين كفروا وصدوكم عن المسجد الحرام والهدى معكوفا أن يبلغ محله \" الآية \" فما استقاموا لكم فاستقيموا لهم \" أي مهما تمسكوا بما عاقدتموهم عليه وعاهدتموهم من ترك الحرب بينكم وبينهم عشر سنين \" فاستقيموا لهم إن الله يحب المتقين \" وقد فعل رسول الله صلى الله عليه وسلم ذلك والمسلمون. استمر العقد والهدنة مع أهل مكة من ذي القعدة في سنة ست إلى أن نقضت قريش العهد ومالئوا حلفاءهم وهم بنو بكر على خزاعة أحلاف رسول الله صلى الله عليه وسلم فقتلوهم معهم في الحرام أيضا فعند ذلك غزاهم رسول الله صلى الله عليه وسلم في رمضان سنة ثمان ففتح الله عليه البلد الحرام ومكنه من نواصيهم ولله الحمد والمنة فأطلق من أسلم منهم بعد القهر والغلبة عليهم فسموا الطلقاء وكانوا قريبا من ألفين ومن استمر على كفره وفر من رسول الله صلى الله عليه وسلم بعث إليه بالأمان والتسيير في الأرض أربعة أشهر يذهب حيث شاء ومنهم صفوان بن أمية وعكرمة بن أبي جهل وغيرهما ثم هداهم الله بعد ذلك إلى الإسلام التام والله المحمود على جميع ما يقدره ويفعله."
    },
    {
      "ayah": 70,
      "surah": 9,
      "text": "يقول تعالى واعظا لهؤلاء المنافقين المكـذبين للرسل \" ألم يأتهم نبأ الذين من قبلهم \" أي ألم تخبروا خبر من كان قبلكم من الأمم المكذبة للرسل \" قوم نوح \" وما أصابهم من الغرق العام لجميع أهل الأرض إلا من آمن بعبده ورسوله نوح عليه السلام \" وعاد \" كيف أهلكوا بالريح العقيم لما كذبوا هودا عليه السلام \" وثمود \" كيف أخذتهم الصيحة لما كذبوا صالحا عليه السلام وعقروا الناقة \" وقوم إبراهيم \" كيف نصره الله عليهم وأيده بالمعجزات الظاهرة عليهم وأهلك ملكهم نمرود بن كنعان بن كوش الكنعاني لعنه الله \" وأصحاب مدين \" وهم قوم شعيب عليه السلام وكيف أصابتهم الرجفة وعذاب يوم الظلة \" والمؤتفكات \" قوم لوط وقد كانوا يسكنون في مدائن وقال في الآية الأخرى \" والمؤتفكة أهوى \" أي الأمة المؤتفكة وقيل أم قراهم وهي سدوم والغرض أن الله تعالى أهلكهم عن آخرهم بتكذيبهم نبي الله صلى الله عليه وسلم لوطا عليه السلام وإتيانهم الفاحشة التي لم يسبقهم بها أحد من العالمين \" أتتهم رسلهم بالبينات \" أي بالحجج والدلائل القاطعات \" فما كان الله ليظلمهم \" أي بإهلاكه إياهم لأنه أقام عليهم الحجة بإرسال الرسل وإزاحة العلل \" ولكن كانوا أنفسهم يظلمون \" أي بتكذيبهم الرسل ومخالفتهم الحق فصاروا إلى ما صاروا إليه من العذاب والدمار."
    },
    {
      "ayah": 71,
      "surah": 9,
      "text": "لما ذكر تعالى صفات المنافقين الذميمة عطف بذكر صفات المؤمنين المحمودة فقال \" والمؤمنون والمؤمنات بعضهم أولياء بعض \" أي يتناصرون ويتعاضدون كما جاء في الصحيح \" المؤمن للمؤمن كالبنيان يشد بعضه بعضا \" وشبك بين أصابعه وفي الصحيح أيضا \" مثل المؤمنين في توادهم وتراحمهم كمثل الجسد الواحد. إذا اشتكى منه عضو تداعى له سائر الجسد بالحمى والسهر \" وقوله \" يأمرون بالمعروف وينهون عن المنكر \" كقوله تعالى \" ولتكن منكم أمة يدعون إلى الخير ويأمرون بالمعروف وينهون عن المنكر \" الآية. وقوله \" ويقيمون الصلاة ويؤتون الزكاة \" أي يطيعون الله ويحسنون إلى خلقه \" ويطيعون الله ورسوله \" أي فيما أمر وترك ما عنه زجر \" أولئك سيرحمهم الله \" من اتصف بهـذه الصفات \" إن الله عزيز \" أي يعز من أطاعه فإن العزة لله ولرسوله وللمؤمنين \" حكيم \" في قسمته هذه الصفات لهؤلاء وتخصيصه المنافقين بصفاتهم المتقدمة فإن له الحكمة في جميع ما يفعله تبارك وتعالى."
    },
    {
      "ayah": 72,
      "surah": 9,
      "text": "يخبر تعالى بما أعده للمؤمنين به والمؤمنات من الخيرات والنعيم المقيم في \" جنات تجري من تحتها الأنهار خالدين فيها \" أي ماكثين فيها أبدا \" ومساكن طيبة \" أي حسنة البناء طيبة القرار كما جاء في الصحيحين من حديث أبي عمران الجوني عن أبي بكر بن أبي موسى عبدالله بن قيس الأشعري عن أبيه قال: قال رسول الله صلى الله عليه وسلم جنتان من ذهب آنيتهما وما فيهما وجنتان من فضة وآنيتهما وما فيهما وما بين القوم وبين أن ينظروا إلى ربهم إلا رداء الكبرياء على وجهه في جنة عدن وبه قال: قال رسول الله صلى الله عليه وسلم إن للمؤمن في الجنة لخيمة من لؤلؤة واحدة مجوفة طولها ستون ميلا في السماء للمؤمن فيها أهلون يطوف عليهم لا يرى بعضهم بعضا أخرجاه في الصحيحين وفيهما أيضا عن أبي هريرة قال: قال رسول الله صلى الله عليه وسلم من آمن بالله ورسوله وأقام الصلاة وصام رمضان فإن حقا على الله أن يدخله الجنة هاجر في سبيل الله أو حبس في أرضه التي ولد فيها قالوا يا رسول الله أفلا نخبر الناس؟ قال إن في الجنة مائة درجة أعدها الله للمجاهدين في سبيله بين كل درجتين كما بين السماء والأرض فإذا سألتم الله فاسألوه الفردوس فإنه أعلى الجنة وأوسط الجنة ومنه تفجر أنهار الجنة وفوقه عرش الرحمن وعند الطبراني والترمذي وابن ماجه من رواية زيد بن أسلم عن عطاء عن يسار عن معاذ بن جبل رضي الله عنه سمعت رسول الله صلى الله عليه وسلم يقول فذكر مثله وللترمذي عن عبادة بن الصامت مثله وعن أبي حازم عن سهل بن سعد قال: قال رسول الله صلى الله عليه وسلم إن أهل الجنة ليتراءون الغرفة في الجنة كما ترون الكوكب في السماء أخرجاه في الصحيحين ثم ليعلم أن أعلى منزلة في الجنة مكان يقال له الوسيلة لقربه من العرش وهو مسكن رسول الله صلى الله عليه وسلم من الجنة كما قال الإمام أحمد: حدثنا عبدالرازق أخبرنا سفيان عن ليث عن كعب عن أبي هريرة أن رسول الله صلى الله عليه وسلم قال إذا صليتم علي فسلوا الله لي الوسيلة قيل يا رسول الله ما الوسيلة؟ فقال: أعلى درجة في الجنة لا ينالها إلا رجل واحد وأجو أن أكون أنا هو. وفي صحيح مسلم من حديث كعب بن علقمة عن عبدالرحمن بن جبير عن عبدالله بن عمرو بن العاص أنه سمع النبي صلى الله عليه وسلم يقول إذا سمعتم المؤذن فقولوا مثل ما يقول ثم صلوا علي فإنه من صلى علي صلاة واحدة صلى الله عليه بها عشرا ثم سلوا لي الوسيلة فإنها منزلة من الجنة لا تنبغي إلا لعبد من عباد الله وأرجو أن أكون هو فمن سأل الله لي الوسيلة حلت عليه الشفاعة يوم القيامة وقال الحافظ أبو القاسم الطبراني حدثنا أحمد بن علي الأباري حدثنا الوليد بن عبد الملك الحراني حدثنا موسى بن أعين عن ابن أبي ذئب عن محمد بن عمرو بن عطاء عن ابن عباس قال: قال رسول الله صلى الله عليه وسلم سلوا الله لي الوسيلة فإنه لم يسألها لي عبد في الدنيا إلا كنت له شهيدا أو شفيعا يوم القيامة رواه الطبراني وفي مسند الإمام أحمد من حديث سعد بن مجاهد الطائي عن أبي المدله عن أبي هريرة رضي الله عنه قال: قلنا يا رسول الله حدثنا عن الحنة ما بناؤها؟ قال لبنة ذهب ولبنة فضة وملاطها المسك وحصباؤها اللؤلؤ والياقوت وترابها الزعفران من يدخلها ينعم لا ييأس ويخلد لا يموت لا تبلى ثيابه ولا يفنى شبابه وروى عن ابن عمر مرفوعا نحوه وعن الترمذي من حديث عبدالرحمن بن إسحاق عن النعمان بن سعد عن علي رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم إن في الجنة لغرفا يرى ظاهرها من باطنها وباطنها من ظاهرها. فقام أعرابي فقال يا رسول الله لمن هي؟ فقال لمن طيب الكلام وأطعم الطعام وأدام الصيام وصلى بالليل والناس نيام ثم قال حديث غريب رواه الطبراني من حديث عبدالله بن عمرو الأشعري فالله أعلم وعن أسامة بن زيد قال: قال رسول الله صلى الله عليه وسلم ألا هل من مشمر إلى الجنة؟ فإن الجنة لا حظر لها هي ورب الكعبة نورا يتلألأ وريحانة تهتز وقصر مشيد ونهر مطرد وثمرة نضيجة وزوجة حسناء جميلة وحلل كثيرة ومقام في أبد في دار سليمة وفاكهة وخضرة وحبرة ونعمة في محلة علية بهية قالوا نعم يا رسول الله نحن المشمرون لها قال قولوا إن شاء الله فقال القوم إن شاء الله رواه ابن ماجه وقوله تعالى \"ورضوان من الله أكبر\" أي رضا الله عنهم أكبر وأجل وأعظم مما هم فيه من النعيم كما قال الإمام مالك رحمه الله عن زيد بن أسلم عن عطاء بن يسار عن أبي سعيد الخدري رضي الله عنه أن رسول الله صلى الله عليه وسلم قال إن الله عز وجل يقول لأهل الجنة يا أهل الجنة فيقولون لبيك ربنا وسعديك والخير في يدك فيقول هل رضيتم؟ فيقولون وما لنا لا نرضى يا رب وقد أعطيتنا ما لم تعط أحدا من خلقك فيقول ألا أعطيكم أفضل من ذلك؟ فيقولون يا رب وأي شيء أفضل من ذلك؟ فيقول أحل عليكم رضواني فلا أسخط عليكم بعده أبدا \". أخرجاه من حديث مالك وقال أبو عبدالله الحسين بن إسماعيل المحاملي حدثنا الفضل الرجائي حدثنا الفريابي عن سفيان عن محمد بن المنكدر عن جابر بن عبدالله قال: قال رسول الله صلى الله عليه وسلم \" إذا دخل أهل الجنة الجنة قال الله عز وجل هل تشتهون شيئا فأزيدكم؟ قالوا يا ربنا ما خير مما أعطيتنا؟ قال رضواني أكبر \". ورواه البزار في مسنده من حديث الثوري وقال الحافظ الضياء المقدسي في كتابه صفة الجنة هذا عندي على شرط الصحيح والله أعلم."
    },
    {
      "ayah": 73,
      "surah": 9,
      "text": "أمر تعالى رسوله صلى الله عليه وسلم بجهاد الكفار والمنافقين والغلظة عليهم كما أمره بأن يخفض جناحه لمن اتبعه من المؤمنين وأخبره أن مصير الكفار والمنافقين إلى النار في الدار الآخرة وقد تقدم عن أمير المؤمنين علي بن أبي طالب أنه قال: بعث رسول الله صلى الله عليه وسلم بأربعة أسياف: سيف للمشركين \" فإذا انسلخ الأشهر الحرم فاقتلوا المشركين \" وسيف لكفار أهل الكتاب \" قاتلوا الذين لا يؤمنون بالله ولا باليوم الآخر ولا يحرمون ما حرم الله ورسوله ولا يدينون دين الحق من الذين أوتوا الكتاب حتى يعطوا الجزية عن يد وهم صاغرون \" وسيف للمنافقين \" جاهد الكفار والمنافقين \" وسيف للبغاة \" فقاتلوا التي تبغي حتى تفيء إلى أمر الله \" وهذا يقتضي أنهم يجاهدون بالسيوف إذا أظهروا النفاق وهو اختيار ابن جرير وقال ابن مسعود في قوله \" جاهد الكفار والمنافقين \" قال بيده فإن لم يستطع فليكفهر في وجهه. وقال ابن عباس أمره الله تعالى بجهاد الكفار بالسيف والمنافقين باللسان وأذهب الرفق عنهم ; وقال الضحاك جاهد الكفار بالسيف واغلظ على المنافقين بالكلام وهو مجاهدتهم ; وعن مقاتل والربيع مثله: وقال الحسن وقتادة ومجاهد: مجاهدتهم إقامة الحدود عليهم وقد يقال إنه لا منافاة بين هذه الأقوال لأنه تارة يؤاخذهم بهذا وتارة بهذا بحسب الأحوال والله أعلم."
    },
    {
      "ayah": 74,
      "surah": 9,
      "text": "وقوله \" يحلفون بالله ما قالوا ولقد قالوا كلمة الكفر وكفروا بعد إسلامهم \" قال قتادة نزلت في عبدالله بن أبي وذلك أنه اقتتل رجلان جهني وأنصاري فعلا الجهني على الأنصاري فقال عبدالله للأنصار ألا تنصروا أخاكم؟ والله ما مثلنا ومثل محمد إلا كما قال القائل: سمن كلبك يأكلك وقال: لئن رجعنا إلى المدينة ليخرجن الأعز منها الأذل. فسعى بها رجل من المسلمين إلى النبي صلى الله عليه وسلم فأرسل إليه فسأله فجعل يحلف بالله ما قاله فأنزل الله فيه هذه الآية وروى إسماعيل بن إبراهيم بن عقبة عن عمه موسى بن عقبة قال فحدثني عبدالله بن الفضل أنه سمع أنس بن مالك رضي الله عنه يقول حزنت على من أصيب بالحرة من قومي فكتب إلي زيد بن أرقم وبلغه شدة حزني يذكر أنه سمع رسول الله صلى الله عليه وسلم يقول \" اللهم اغفر للأنصار ولأبناء الأنصار \" وشك ابن الفضل في أبناء أبناء الأنصار قال ابن الفضل فسأل أنس بعض من كان عنده عن زيد بن أرقم فقال هو الذي يقول له رسول الله صلى الله عليه وسلم \" أوفى الله له بإذنه \". قال وذلك حين سمع رجلا من المنافقين يقول ورسول الله صلى الله عليه وسلم يخطب لئن كان صادقا فنحن شر من الحمير فقال زيد بن أرقم فهـو والله صادق ولأنت شر من الحمار. ثم رفع ذلك إلى رسول الله صلى الله عليه وسلم فجحده القائل فأنزل الله هذه الآية تصديقا لزيد يعني قوله \" يحلفون بالله ما قالوا \" الآية. رواه البخاري في صحيحه عن إسماعيل بن أبي أويس عن إسماعيل بن إبراهيم بن عقبة - إلى قوله - هذا الذي أوفى الله له بإذنه ولعل ما بعده من قول موسى بن عقبة. وقد رواه محمد بن فليح عن موسى بن عقبة بإسناده ثم قال: قال ابن شهاب فذكر ما بعده عن موسى عن ابن شهاب والمشهور في هذه القصة أنها كانت في غزوة بني المصطلق فلعل الراوي وهم في ذكر الآية وأراد أن يذكر غيرها فذكرها والله أعلم قال الأموي في مغازيه: حدثنا محمد بن إسحاق عن الزهري عن عبدالرحمن بن عبدالله بن كعب بن مالك عن أبيه عن جده قال لما قدم رسول الله صلى الله عليه وسلم أخذني قومي فقالوا إنك امرؤ شاعر فإن شئت أن تعتذر إلى رسول الله صلى الله عليه وسلم ببعض العلة ثم يكون ذنبا تستغفر الله منه وذكر الحديث بطوله إلى أن قال وكان ممن تخلف من المنافقين ونزل فيه القرآن منهم ممن كان مع النبي صلى الله عليه وسلم الجلاس بن سويد بن الصامت وكان على أم عمير بن سعد وكان عمير في حجره فلما نزل القرآن وذكرهم الله بما ذكر مما أنزل في المنافقين قال الجلاس والله لئن كان هذا الرجل صادقا فيما يقول لنحن شر من الحمير فسمعها عمير بن سعد فقال والله يا جلاس إنك لأحب الناس إلي وأحسنهم عندي بلاء وأعزهم علي من الأخرى فمشى إلى رسول الله صلى الله عليه وسلم فذكر له ما قال الجلاس فلما بلغ ذلك الجلاس خرج حتى أتى النبي صلى الله عليه وسلم فحلف بالله ما قال ما قال عمير بن سعد ولقد كذب علي: فأنزل الله عز وجل فيه يحلفون بالله ما قالوا ولقد قالوا كلمة الكفر وكفروا بعد إسلامهم إلى آخر الآية. فوقفه رسول الله صلى الله عليه وسلم عليها فزعموا أن الجلاس تاب فحسنت توبته ونزع فأحسن النزوع. هكذا جاء هذا مدرجا في الحديث متصلا به وكأنه والله أعلم من كلام ابن إسحاق نفسه لا كلام كعب بن مالك وقال عروة بن الزبير نزلت هذه الآية في الجلاس بن سويد بن الصامت أقبل هو وابن امرأته مصعب من قباء فقال الجلاس إن كان ما جاء به محمد حقا فنحن أشر من حمرنا هذه التي نحن عليها فقال مصعب أما والله يا عدو الله لأخبرن رسول الله صلى الله عليه وسلم بما قلت فأتيت النبي صلى الله عليه وسلم وخفت أن ينزل في القرآن أو تصيبني قارعة أو أن أخلط بخطيئة فقلت يا رسول الله أقبلت أنا والجلاس من قباء فقال كذا وكذا ولولا مخافة أن أخلط بخطيئة أو تصيبني قارعة ما أخبرتك. قال فدعا الجلاس فقال يا جلاس أقلت الذي قاله مصعب؟ فحلف فأنزل الله يحلفون بالله ما قالوا الآية. وقال محمد بن إسحق كان الذي قال تلك المقالة فيما بلغني الجلاس بن سويد بن الصامت فرفعها عليه رجل كان في حجره يقال له عمير بن سعد فأنكرها فحلف بالله ما قالها فلما نزل فيه القرآن تاب ونزع وحسنت توبته فيما بلغني وقال الإمام أبو جعفر بن جرير حدثني أيوب بن إسحق بن إبراهيم حدثنا عبدالله بن رجاء حدثنا إسرائيل عن سماك عن سعيد بن جبير عن ابن عباس قال كان رسول الله صلى الله عليه وسلم جالسا في ظل شجرة فقال إنه سيأتيكم إنسان فينظر إليكم بعيني الشيطان فإذا جاء فلا تكلموه. فلم يلبثوا أن طلع رجل أزرق فدعاه رسول الله صلى الله عليه وسلم فقال علام تشتمني أنت وأصحابك؟ فانطلق الرجل فجاء بأصحابه فحلفوا بالله ما قالوا حتى تجاوز عنهم فأنزل الله عز وجل يحلفون بالله ما قالوا الآية.\" وقوله وهموا بما لم ينالوا\" قيل أنزلت في الجلاس بن سويد وذلك أنه هم بقتل ابن امرأته حين قال لا خبرن رسول الله صلى الله عليه وسلم وقيل في عبدالله بن أبي هم بقتل رسول الله صلى الله عليه وسلم وقال السدي نزلت في أناس أرادوا أن يتوجوا عبدالله بن أبي وإن لم يرض رسول الله صلى الله عليه وسلم وقد ورد أن نفرا من المنافقين هموا بالفتك بالنبي صلى الله عليه وسلم وهو في غزوة تبوك في بعض تلك الليالي في حال السير وكانوا بضعة عشر رجلا قال الضحاك ففيهم نزلت هذه الآية وذلك بين فيما رواه الحافظ أبو بكر البيهقي في كتاب دلائل النبوة من حديث محمد بن إسحاق عن الأعمش عن عمرو بن مرة عن أبي البختري عن حذيفة بن اليمان رضي الله عنه قال كنت آخذا بخطام ناقة رسول الله صلى الله عليه وسلم أقود به وعمار يسوق الناقة أو أنا أسوقه وعمار يقوده حتى إذا كنا بالعقبة فإذا أنا باثني عشر راكبا قد اعترضوه فيها قال فأنبهت رسول الله صلى الله عليه وسلم بهم فصرخ بهم فولوا مدبرين فقال لنا رسول الله هل عرفتم القوم؟ قلنا لا يا رسول الله قد كانوا متلثمين ولكنا قد عرفنا الركاب قال هؤلاء المنافقون إلى يوم القيامة وهل تدرون ما أرادوا؟ قلنا لا قال أرادوا أن يزاحموا رسول الله صلى الله عليه وسلم في العقبة فيلقوه منها قلنا يا رسول الله أفلا نبعث إلى عشائرهم حتى يبعث إليك كل قوم براس صاحبهم ؟ قال لا أكره أن تتحدث العرب بينها أن محمدا قاتل بقوم حتى إذا أظهره الله بهم أقبل عليهم يقتلهم - ثم قال- اللهم ارمهم بالدبيلة \" قلنا يا رسول الله وما الدبيلة؟ قال \" شهاب من نار يقع على نياط قلب أحدهم فيهلك \". وقال الإمام أحمد رحمه الله حدثنا يزيد أخبرنا الوليد بن عبدالله بن جميع عن أبي الطفيل قال لما أقبل رسول الله صلى الله عليه وسلم من غزوة تبوك أمر مناديا فنادى: إن رسول الله صلى الله عليه وسلم أخذ العقبة فلا يأخذها أحد فبينما رسول الله صلى الله عليه وسلم يقوده حذيفة ويسوقه عمار إذ أقبل رهط متلثمون على الرواحل فغشوا عمارا وهو يسوق برسول الله صلى الله عليه وسلم فأقبل عمار رضي الله عنه يضرب وجوه الرواحل فقال رسول الله لحذيفة\" قد قد\" حتى هبط رسول الله صلى الله عليه وسلم فلما هبط نزل ورجع عمار فقال يا عمار\"هل عرفت القوم؟ \" فقال لقد عرفت عامة الرواحل والقوم متلثمون قال \" هل تدري ما أرادوا؟ \" قال الله ورسوله أعلم قال \" أرادوا أن ينفروا برسول الله صلى الله عليه وسلم راحلته فيطرحوه \". قال فسأل عمار رجلا من أصحاب رسول الله صلى الله عليه وسلم فقال نشدتك بالله كم تعلم كان أصحاب العقبة؟ قال أربعة عشر رجلا فقال إن كنت منهم فقد كانوا خمسة عشر قال فعد رسول الله صلى الله عليه وسلم منهم ثلاثة قالوا والله ما سمعنا منادي رسول الله صلى الله عليه وسلم وما علمنا ما أراد القوم فقال عمار أشهد أن الاثني عشر الباقين حرب لله ولرسوله في الحياة الدنيا ويوم يقوم الأشهاد وهكذا روى ابن لهيعة عن أبي الأسود عن عروة بن الزبير نحو هذا وأن رسول الله صلى الله عليه وسلم أمر أن يمشي الناس في بطن الوادي وصعد هو وحذيفة وعمار العقبة فتبعهم هؤلاء النفر الأرذلون وهم متلثمون فأرادوا سلوك العقبة فأطلع الله على مرادهم رسول الله صلى الله عليه وسلم فأمر حذيفة فرجع إليهم فضرب وجوه رواحلهم ففزعوا ورجعوا مقبوحين وأعلم رسول الله صلى الله عليه وسلم حذيفة وعمارا بأسمائهم وما كانوا هموا به من الفتك به صلوات الله وسلامه عليه وأمرهما أن يكتما عليهم وكذا روى يونس بن بكير عن ابن إسحاق إلا أنه سمى جماعة منهم فالله أعلم. وكذا قد حكى في معجم الطبراني قاله البيهقي ويشهد لهذه القصة بالصحة ما رواه مسلم حدثنا زهير بن حرب حدثنا أبو أحمد الكوفي حدثنا الوليد بن جميع حدثنا أبو الطفيل قال: كان بين رجل من أهل العقبة وبين حذيفة بعض ما يكون بين الناس فقال أنشدكم بالله كم كان أصحاب العقبة؟ قال: فقال له القوم أخبره إذ سألك فقال كنا نخبر أنهم أربعة عشر فإن كنت منهم فقد كان القوم خمسة عشر وأشهد بالله أن اثني عشر منهم حرب لله ولرسوله في الحياة الدنيا ويوم يقوم الأشهاد وعذر ثلاثة قالوا ما سمعنا منادي رسول الله صلى الله عليه وسلم ولا علمنا بما أراد القوم وقد كان في حرة يمشي فقال \"إن الماء قليل فلا يسبقني إليه أحد\" فوجد قوما قد سبقوه فلعنهم يومئذ وما رواه مسلم أيضا من حديث قتادة عن أبي نضرة عن قيس بن عباد عن عمار بن ياسر قال: أخبرني حذيفة عن النبي صلى الله عليه وسلم أنه قال \" في أصحابي اثنا عشر منافقا لا يدخلون الجنة ولا يجدون ريحها حتى يلج الجمل في سم الخياط: ثمانية منهم تكفيكهم الدبيلة سراج من نار تظهر بين أكتافهم حتى ينجم في صدورهم \". ولهذا كان حذيفة يقال له صاحب السر الذي لا يعلمه غيره أي من تعيين جماعة من المنافقين وهم هؤلاء قد أطلعه عليهم رسول الله صلى الله عليه وسلم دون غيره والله أعلم. وقد ترجم الطبراني في مسند حذيفة تسمية أصحاب العقبة ثم روى عن علي بن عبد العزيز عن الزبير بن بكار أنه قال: هم معتب بن قشير ووديعة بن ثابت وجد بن عبدالله بن نبتل بن الحارث من بني عمرو بن عوف والحارث بن يزيد الطائي وأوس بن قيظي والحارث بن سويد وسعد بن زرارة وقيس بن فهد وسويد بن داعس بني الحبلي وقيس بن عمرو بن سهل وزيد بن اللصيت وسلالة بن الحمام وهما من بني قينقاع أظهروا الإسلام. وقوله تعالى \" وما نقموا إلا أن أغناهم الله ورسوله من فضله \" أي وما للرسول عندهم ذنب إلا أن الله أغناهم ببركته ويمن سعادته ولو تمت عليهم السعادة لهداهم الله لما جاء به كما قال صلى الله عليه وسلم للأنصار ألم أجدكم ضلالا فهداكم الله بي؟ وكنتم متفرقين فألفكم الله بي وعالة فأغناكم الله بي \" كلما قال شيئا قالوا الله ورسوله أمن. وهذه الصيغة تقال حيث لا ذنب كقوله \" وما نقموا منهم إلا أن يؤمنوا بالله \" الآية وقوله عليه السلام ما ينقم ابن جميل إلا أن كان فقيرا فأغناه الله \" ثم دعاهم الله تبارك وتعالى إلى التوبة فقال \" فإن يتوبوا يك خيرا لهم وإن يتولوا يعذبهم الله عذابا أليما في الدنيا والآخرة \" أي وإن يستمروا على طريقهم يعذبهم الله عذابا أليما في الدنيا أي بالقتل والهم والغم والآخرة أي بالعذاب والنكال والهوان والصغار \" وما لهم في الأرض من ولي ولا نصير\" أي ليس لهم أحد يسعدهم ولا ينجدهم لا يحصل لهم خيرا ولا يدفع عنهم شرا."
    },
    {
      "ayah": 75,
      "surah": 9,
      "text": "يقول تعالى ومن المنافقين من أعطى الله عهده وميثاقه لئن أغناه من فضله ليصدقن من ماله وليكونن من الصالحين فما وفى بما قال ولا صدق فيما ادعى فأعقبهم هذا الصنيع نفاقا سكن في قلوبهم إلى يوم يلقوا الله عز وجل يوم القيامة. عياذا بالله من ذلك. وقد ذكر كثير من المفسرين منهم ابن عباس والحسن البصري أن سبب نزول هذه الآية الكريمة في ثعلبة بن حاطب والأنصاري وقد ورد فيه حديث رواه ابن جرير ههنا وابن أبي حاتم من حديث معن بن رفاعة عن علي بن زيد عن أبي عبدالرحمن القاسم بن عبدالرحمن مولى عبدالرحمن بن يزيد بن معاوية عن أبي أمامة الباهلي عن ثعلبة بن حاطب الأنصاري أنه قال لرسول الله صلى الله عليه وسلم ادع الله أن يرزقني مالا قال فقال رسول الله صلى الله عليه وسلم ويحك يا ثعلبة قليل تؤدي شكره خير من كثير لا تطيقه قال ثم قال مرة أخرى فقال أما ترضى أن تكون مثل نبي الله؟ فوالذي نفسي بيده لو شئتُ أن تسير الجبال معي ذهبا وفضة لسارت. قال والذي بعثك بالحق لئن دعوت الله فرزقني مالا لأعطين كل ذي حق حقه فقال رسول الله صلى الله عليه وسلم اللهم ارزق ثعلبة مالا قال فاتخذ غنما فنمت كما ينمى الدود فضاقت عليه المدينة فتنحى عنها فنزل واديا من أوديتها حتى جعل يصلي الظهر والعصر في جماعة ويترك ما سواهما ثم نمت وكثرت فتنحى حتى ترك الصلوات إلا الجمعة وهي تنمي كما ينمى الدود حتى ترك الجمعة فطفق يتلقى الركبان يوم الجمعة ليسألهم عن الأخبار فقال رسول الله صلى الله عليه وسلم ما فعل ثعلبة؟ فقالوا يا رسول الله اتخذ غنما فضاقت عليه المدينة فأخبروه بأمره فقال: يا ويح ثعلبة يا ويح ثعلبة يا ويح ثعلبة وأنزل الله جل ثناؤه\" خذ من أموالهم صدقة\" الآية. ونزلت فرائض الصدقة فبعث رسول الله صلى الله عليه وسلم رجلين على الصدقة من المسلمين رجلا من جهينة ورجلا من سليم وكتب لهما كيف يأخذان الصدقة من المسلمين وقال لهما مرا بثعلبة وبفلان رجل من بني سليم فخذا صدقاتهما فخرجا حتى أتيا ثعلبة فسألاه الصدقة وأقرآه كتاب رسول الله صلى الله عليه وسلم فقال: ما هذه إلا جزية ما هذه إلا أخت الجزية ما أدري ما هذا؟ انطلقا حتى تفرغا ثم عودا إلي فانطلقا وسمع بهما السلمي فنظر إلى خيار أسنان إبله فعزلها للصدقة ثم استقبلهما بها فلما رأوها قالوا ما يجب عليك هذا وما نريد أن نأخذ هذا منك فقال بلى فخذوها فإن نفسي بذلك طيبة وإنما هي له فأخذاها منه ومرا على الناس فأخذا الصدقات ثم رجعا إلى ثعلبة فقال: أروني كتابكما فقرأه فقال ما هذه إلا جزية ما هذه إلا أخت الجزية انطلقا حتى أرى رأيي فانطلقا حتى أتيا النبي صلى الله عليه وسلم فلما رآهما قال يا ويح ثعلبة قبل أن يكلمهما ودعا للسلمي بالبركة فأخبراه بالذي صنع ثعلبة والذي صنع السلمى فأنزل الله عز وجل\" ومنهم من عاهد الله لئن آتانا من فضله لنصدقن\" الآية. قال وعند رسول الله صلى الله عليه وسلم رجل من أقارب ثعلبة فسمع ذلك فخرج حتى أتاه فقال: ويحك يا ثعلبة قد أنزل الله فيك كذا وكذا فخرج ثعلبة حتى أتى النبي صلى الله عليه وسلم فسأله أن يقبل منه صدقته فقال إن الله منعني أن أقبل منك صدقتك فجعل يحسو على رأسه التراب فقال له رسول الله صلى الله عليه وسلم هذا عملك قد أمرتك فلم تطعني. فلما أبى رسول الله صلى الله عليه وآله وسلم أن يقبض صدقته رجع إلى منزله فقُبِضَ رسول الله صلى الله عليه وآله وسلم ولم يقبل منه شيئا ثم أتى أبا بكر رضي الله عنه حين استُخلف فقال قد علمت منزلتي من رسول الله وموضعي من الأنصار فاقبل صدقتي فقال أبو بكر لم يقبلها منك رسول الله صلى الله عليه وسلم وأبى أن يقبلها فقُبِض أبو بكر ولم يقبلها. فلما ولى عمر رضي الله عنه أتاه فقال: يا أمير المؤمنين اقبل صدقتي فقال لم يقبلها رسول الله صلى الله عليه وسلم ولا أبو بكر وأنا أقبلها منك؟ فقُبِض ولم يقبلها فلما ولي عثمان رضي الله عنه أتاه فقال: اقبل صدقتي فقال لم يقبلها رسول الله صلى الله عليه وسلم ولا أبو بكر ولا عمر وأنا أقبلها منك؟ فلم يقبلها منه فهلك ثعلبة في خلافة عثمان."
    },
    {
      "ayah": 76,
      "surah": 9,
      "text": "يقول تعالى ومن المنافقين من أعطى الله عهده وميثاقه لئن أغناه من فضله ليصدقن من ماله وليكونن من الصالحين فما وفى بما قال ولا صدق فيما ادعى فأعقبهم هذا الصنيع نفاقا سكن في قلوبهم إلى يوم يلقوا الله عز وجل يوم القيامة. عياذا بالله من ذلك وقد ذكر كثير من المفسرين منهم ابن عباس والحسن البصري أن سبب نزول هذه الآية الكريمة في ثعلبة بن حاطب والأنصاري وقد ورد فيه حديث رواه ابن جرير ههنا وابن أبي حاتم من حديث معان بن رفاعة عن علي بن زيد عن أبي عبدالرحمن القاسم بن عبدالرحمن مولى عبدالرحمن بن يزيد بن معاوية عن أبي أمامة الباهلي عن ثعلبة بن حاطب الأنصاري أنه قال لرسول الله صلى الله عليه وسلم ادع الله أن يرزقني مالا قال فقال رسول الله صلى الله عليه وسلم ويحك يا ثعلبة قليل تؤدي شكره خير من كثير لا تطيقه قال ثم قال مرة أخرى فقال أما ترضى أن تكون مثل نبي الله؟ فوالذي نفسي بيده لو شئت أن تسير الجبال معي ذهبا وفضة لسارت. قال والذي بعثك بالحق لئن دعوت الله فرزقني مالا لأعطين كل ذي حق حقه فقال رسول الله صلى الله عليه وسلم اللهم ارزق ثعلبة مالا قال فاتخذ غنما فنمت كما ينمى الدود فضاقت عليه المدينة فتنحى عنها فنزل واديا من أوديتها حتى جعل يصلي الظهر والعصر في جماعة ويترك ما سواهما ثم نمت وكثرت فتنحى حتى ترك الصلوات إلا الجمعة وهي تنمي كما ينمى الدود حتى ترك الجمعة فطفق يتلقى الركبان يوم الجمعة ليسألهم عن الأخبار فقال رسول الله صلى الله عليه وسلم ما فعل ثعلبة؟ فقالوا يا رسول الله اتخذ غنما فضاقت عليه المدينة فأخبروه بأمره فقال يا ويح ثعلبة يا ويح ثعلبة يا ويح ثعلبة وأنزل الله جل ثناؤه خذ من أموالهم صدقة. الآية. ونزلت فرائض الصدقة فبعث رسول الله صلى الله عليه وسلم رجلين على الصدقة من المسلمين رجلا من جهينة ورجلا من سليم وكتب لهما كيف يأخذان الصدقة من المسلمين وقال لهما مرا بثعلبة وبفلان رجل من بني سليم فخذا صدقاتهما فخرجا حتى أتيا ثعلبة فسألاه الصدقة وأقرآه كتاب رسول الله صلى الله عليه وسلم فقال: ما هذه إلا جزية ما هذه إلا أخت الجزية ما أدري ما هذا؟ انطلقا حتى تفرغا ثم عودا إلي فانطلقا وسمع بهما السلمي فنظر إلى خيار أسنان إبله فعزلها للصدقة ثم استقبلهما بها فلما رأوها قالوا ما يجب عليك هذا وما نريد أن نأخذ هذا منك فقال بلى فخذوها فإن نفسي بذلك طيبة وإنما هي له فأخذاها منه ومرا على الناس فأخذا الصدقات ثم رجعا إلى ثعلبة فقال: أروني كتابكما فقرأه فقال ما هذه إلا جزية ما هذه إلا أخت الجزية انطلقا حتى أرى رأيي فانطلقا حتى أتيا النبي صلى الله عليه وسلم فلما رآهما قال يا ويح ثعلبة قبل أن يكلمهما ودعا للسلمى بالبركة فأخبراه بالذي صنع ثعلبة والذي صنع السلمى فأنزل الله عز وجل ومنهم من عاهد الله لئن آتانا من فضله لنصدقن. الآية. قال وعند رسول الله صلى الله عليه وسلم رجل من أقارب ثعلبة فسمع ذلك فخرج حتى أتاه فقال: ويحك يا ثعلبة قد أنزل الله فيك كذا وكذا فخرج ثعلبة حتى أتى النبي صلى الله عليه وسلم فسأله أن يقبل منه صدقته فقال إن الله منعني أن أقبل منك صدقتك فجعل يحسو على رأسه التراب فقال له رسول الله صلى الله عليه وسلم هذا عملك قد أمرتك فلم تطعني. فلما أبى رسول الله صلى الله عليه وإله وسلم أن يقبض صدقته رجع إلى منزله فقبض رسول الله صلى الله عليه وإله وسلم ولم يقبل منه شيئا ثم أتى أبا بكر رضي الله عنه حين استخلف فقال قد علمت منزلتي من رسول الله وموضعي من الأنصار فاقبل صدقتي فقال أبو بكر لم يقبلها منك رسول الله صلى الله عليه وسلم وأبى أن يقبلها فقبض أبو بكر ولم يقبلها. فلما ولى عمر رضي الله عنه أتاه فقال: يا أمير المؤمنين اقبل صدقتي فقال لم يقبلها رسول الله صلى الله عليه وسلم ولا أبو بكر وأنا أقبلها منك؟ فقبض ولم يقبلها فلما ولي عثمان رضي الله عنه أتاه فقال: اقبل صدقتي فقال لم يقبلها رسول الله صلى الله عليه وسلم ولا أبو بكر ولا عمر وأنا أقبلها منك؟ فلم يقبلها منه فهلك ثعلبة في خلافة عثمان."
    },
    {
      "ayah": 77,
      "surah": 9,
      "text": "وقوله تعالى \" بما أخلفوا الله ما وعدوه \" الآية. أي أعقبهم النفاق في قلوبهم بسبب إخلافهم الوعد وكذبهم كما في الصحيحين عن رسول الله صلى الله عليه وسلم أنه قال \" آية المنافق ثلاث: إذا حدث كذب وإذا وعد أخلف وإذا ائتمن خان \" وله شواهد كثيرة والله أعلم."
    },
    {
      "ayah": 78,
      "surah": 9,
      "text": "وقوله \" ألم يعلموا أن الله يعلم سرهم ونجواهم الآية. يخبر تعالى أنه يعلم السر وأخفى وأنه أعلم بضمائرهم وإن أظهروا أنه إن حصل لهم أموال تصدقوا منها وشكروا عليها فإن الله أعلم بهم من أنفسهم لأنه تعالى علام الغيوب أي يعلم كل غيب وشهادة وكل سر ونجوى ويعلم ما ظهر وما بطن."
    },
    {
      "ayah": 79,
      "surah": 9,
      "text": "وهذا أيضا من صفات المنافقين لا يسلم أحد من عيبهم ولمن هم في جميع الأحوال حتى ولا المتصدقون يسلمون منهم إن جاء أحد منهم بمال جزيل قالوا هذا مراء وإن جاء بشيء يسير قالوا إن الله لغني عن صدقة هذا. كما روى البخاري حدثنا عبيد الله بن سعيد حدثنا أبو النعمان البصري حدثنا شعبة عن سليمان عن أبي وائل عن أبي مسعود رضي الله عنه قال: لما نزلت آية الصدقة كنا نحامل على ظهورنا فجاء رجل فتصدق بشيء كثير فقالوا مرائي وجاء رجل فتصدق بصاع فقالوا إن الله لغني عن صدقة هذا. فنزلت \" الذين يلمزون المطوعين \" الآية. وفي رواه مسلم أيضا في صحيحه من حديث شعبة به وقال الإمام أحمد حدثنا يزيد الجريري عن أبي السليل قال: وقف علينا رجل في مجلسنا بالبقيع فقال: حدثني أبي أو عمي أنه رأى رسول الله صلى الله عليه وسلم بالبقيع وهو يقول من يتصدق بصدقة أشهد له بها يوم القيامة \" قال فحللت من عمامتي لوثا أو لوثين وأنا أريد أن أتصدق بهما فأدركني ما يدرك ابن آدم فعقدت علىَّ عمامتي. فجاء رجل لم أر بالبقيع رجلا أشد منه سوادا ولا أصغر منه ولا أذم ببعير ساقه لم أر بالبقيع ناقة أحسن منها. فقال يا رسول الله أصدقة؟ قال \" نعم \" قال دونك هذه الناقة قال فلمزه رجل فقال هذا يتصدق بهذه والله لهي خير منه. قال فسمعها رسول الله صلى الله عليه وسلم فقال \" كذبت بل هو خير منك ومنها \" ثلاث مرات ثم قال \" ويل لأصحاب المئين من الإبل \" ثلاثا قالوا إلا من يا رسول الله؟ قال \" إلا من قال بالمال هكذا وهكذا \" وجمع بين كفيه عن يمينه وعن شماله ثم قال \" قد أفلح المزهد المجهد \" ثلاثا. المزهد في العيش المجهد في العبادة وقال علي بن أبي طلحة عن ابن عباس في هذه الآية قال جاء عبدالرحمن بن عوف بأربعين أوقية من ذهب إلى رسول الله صلى الله عليه وسلم وجاءه رجل من الأنصار بصاع من طعام فقال بعض المنافقين والله ما جاء عبدالرحمن بما جاء به إلا رياء وقالوا إن الله ورسوله لغنيان عن هذا الصاع. وقال العوفي عن ابن عباس إن رسول الله خرج إلى الناس يوما فنادى فيهم أن اجمعوا صدقاتكم فجمع الناس صدقاتهم ثم جاء رجل من آخرهم بصاع من تمر فقال يا رسول الله هذا صاع من تمر بت ليلتي أجر بالجرير الماء حتى نلت صاعين من تمر فأمسكت أحدهما وأتيتك بالآخر فأمره رسول الله صلى الله عليه وسلم أن ينثره في الصدقات فسخر منه رجال وقالوا إن الله ورسوله لغنيان عن هذا وما يصنعون بصاعك من شيء ثم إن عبدالرحمن بن عوف قال لرسول الله صلى الله عليه وسلم هل بقي أحد من أهل الصدقات؟ فقال له رسول الله صلى الله عليه وسلم\" لم يبق أحد غيرك \" فقال له عبدالرحمن بن عوف فإن عندي مائة أوقية من الذهب في الصدقات فقال له عمر بن الخطاب رضي الله عنه أمجنون أنت؟ قال ليس بي جنون قال أفعلت ما فعلت؟ قال نعم مالي ثمانية آلاف أما أربعة آلاف فأقرضها ربي وأما أربعة آلاف فلي فقال له رسول الله صلى الله عليه وسلم \" بارك الله لك فيما أمسكت وفيما أعطيت\" ولمزه المنافقون فقالوا والله ما أعطى عبدالرحمن عطيته إلا رياء وهم كاذبون إنما كان به متطوعا فأنزل الله عز وجل عذره وعذر صاحبه المسكين الذي جاء بالصاع من التمر فقال تعالى في كتابه\" الذين يلمزون المطوعين من المؤمنين في الصدقات\" الآية. وهكذا روى عن مجاهد وغير واحد وقال ابن إسحق كان من المطوعين من المؤمنين في الصدقات عبد عبدالرحمن بن عوف تصدق بأربعة آلاف درهم وعاصم بن عدي أخو بني العجلان وذلك أن رسول الله صلى الله عليه وسلم رغب في الصدقة وحض عليها فقال عبدالرحمن بن عوف فتصدق بأربعة آلاف وقام عاصم بن عدي وتصدق بمائة وسق من تمر فلمزوهما وقالوا ما هذا إلا رياء وكان الذي تصدق بجهده أبو عقيل أخو بني أنيف الأراشي حليف بن عمرو بن عوف أتى بصاع من تمر فأفرغه في الصدقة فتضاحكوا به فقالوا إن الله لغني عن صاع أبي عقيل وقال الحافظ أبو بكر البزار حدثنا طالوت بن عباد حدثنا أبو عونة عن عمرو بن أبي سلمة عن أبيه عن أبي هريرة قال: قال رسول الله صلى الله عليه وسلم تصدقوا فإني أريد أن أبعث بعثا قال فجاء عبدالرحمن بن عوف فقال يا رسول الله عندي أربعة آلاف ألفين أقرضهما ربي وألفين لعيالي فقال رسول الله صلى الله عليه وسلم بارك الله فيك فيما أعطيت وبارك لك فيما أمسكت وبات رجل من الأنصار فأصاب صاعين من تمر فقال يا رسول الله أصبت صاعين من تمر صاع أقرضه لربي وصاع لعيالي قال فلمزه المنافقون وقالوا ما أعطوا الذي أعطى ابن عوف إلا رياء وقالوا ألم يكن الله ورسوله غنيين عن صاع هذا؟ فأنزل الله\" الذين يلمزون المطوعين من المؤمنين في الصدقات والذين لا يجدون إلا جهدهم فيسخرون منهم\" الآية. ثم رواه عن أبي كامل عن أبي عوانة عن عمرو بن أبي سلمة عن أبيه مرسلا قال قال ولم يسنده أحد إلا طالوت وقال الإمام أبو جعفر بن جرير حدثنا ابن وكيع حدثنا زيد بن الحباب عن موسى عن عبيد حدثني خالد بن يسار عن ابن أبي عقيل عن أبيه قال بت أجر الجرير على ظهري على صاعين من تمر فانقلبت بأحدهما إلى أهلي يتبلغون به وجئت بالآخر أتقرب إلى رسول الله صلى الله عليه وإله وسلم فأتيته فأخبرته فقال انثره في الصدقة قال فسخر القوم وقالوا لقد كان الله غنيا عن صدقة هذا المسكين فأنزل الله الذين يلمزون المطوعين. الآيتين. وكذا رواه الطبراني من حديث زيد بن الحباب به وقال اسم أبي عقيل حباب ويقال عبدالرحمن بن عبدالله بن ثعلبة وقوله فيسخرون منهم سخر الله منهم هذا من باب المقابلة على صنيعهم واستهزائهم بالمؤمنين لأن الجزاء من جنس العمل فعاملهم معاملة من سخر منهم انتصارا للمؤمنين في الدنيا وأعد للمنافقين في الآخرة عذابا أليما لأن الجزاء من جنس العمل."
    },
    {
      "ayah": 8,
      "surah": 9,
      "text": "يقول تعالى محرضا للمؤمنين على معاداتهم والتبري منهم ومبينا أنهم لا يستحقون أن يكون لهم عهد لشركهم بالله تعالى وكفرهم برسول الله صلى الله عليه وسلم ولأنهم لو ظهروا على المسلمين وأديلوا عليهم لم يبقوا ولم يذروا ولا راقبوا فيهم إلّاً ولا ذمة قال علي بن أبي طلحة وعكرمة والعوفي عن ابن عباس: الآل القرابة والذمة العهد وكذا قال الضحاك والسدي كما قال تميم بن مقبل: أفسد الناس خلوف خلفوا قطعوا الإل وأعراق الرحم وقال حسان بن ثابت رضي الله عنه: وجدناهم كاذبا إليهم وذو الإل والعهد لا يكذب وقال ابن أبي نجيح عن مجاهد لا يرقبون في مؤمن إلّاً: قال إلا الله ; وفي رواية لا يرقبون الله ولا غيره وقال ابن جرير: حدثني يعقوب حدثنا ابن علية عن سليمان عن أبي مجلز في قوله تعالى \" لا يرقبون في مؤمن إلا ولا ذمة \" مثل قوله جبريل ميكائيل إسرافيل كأنه يقول لا يرقبون الله والقول الأول أظهر وأشهر وعليه الأكثر. وعن مجاهد أيضا الإل العهد. وقال قتادة الإل الحلف."
    },
    {
      "ayah": 80,
      "surah": 9,
      "text": "يخبر تعالى نبيه صلى الله عليه وسلم بأن هؤلاء المنافقين ليسوا أهلا للاستغفار وأنه لو استغفر لهم سبعين مرة فلن يغفر الله لهم وقد قيل إن السبعين إنما ذكرت حسما لمادة الاستغفار لهم لأن العرب في أساليب كلاهما تذكر السبعين في مبالغة كلامها ولا تريد التحديد بها ولا أن يكون ما زاد عليها بخلافها وقيل بل لها مفهوم كما روى العوفي عن ابن عباس أن رسول الله صلى الله عليه وسلم قال: لما نزلت هذه الآية أسمع ربي قد رخص لي فيهم فوالله لأستغفرن لهم أكثر من سبعين مرة لعل الله أن يغفر لهم فقال الله من شدة غضبه\" سواء عليهم استغفرت لهم أم لم تستغفر لهم\" الآية وقال الشعبي لما ثقل عبدالله بن أبي انطلق ابنه إلى النبي صلى الله عليه وسلم فقال إن أبي قد احتضر وأحب أن تحضره وتصلي عليه فقال له النبي صلى الله عليه وسلم ما اسمك قال الحباب بن عبدالله قال بل أنت عبدالله بن عبدالله إن الحباب اسم شيطان فانطلق معه حتى شهده وألبسه قميصه وهو عرق وصلى عليه فقيل له أتصلي عليه؟ فقال: إن الله قال إن تستغفر لهم سبعين مرة ولأستغفرن لهم سبعين وسبعين وسبعين وكذا روي عن عروة بن الزبير ومجاهد بن جبير وقتادة بن دعامة وروه ابن جرير بأسانيده."
    },
    {
      "ayah": 81,
      "surah": 9,
      "text": "يقول تعالى ذاما للمنافقين المتخلفين عن صحابة رسول الله صلى الله عليه وسلم في غزوة تبوك وفرحوا بقعودهم بعد خروجه \" وكرهوا أن يجاهدوا \" معه \" بأموالهم وأنفسهم في سبيل الله وقالوا \" أي بعضهم لبعض \" لا تنفروا في الحر \" وذلك أن الخروج في غزوة تبوك كان في شدة الحر عند طيب الظلال والثمار فلهذا قالوا \" لا تنفروا في الحر \" قال الله تعالى لرسوله صلى الله عليه وسلم \" قل \" لهم \" نار جهنم \" التي تصيرون إليها بمخالفتكم \" أشد حرا \" مما فررتم منه من الحر بل أشد حرا من النار كما قال الإمام مالك عن أبي الزناد عن الأعرج عن أبي هريرة أن رسول الله صلى الله عليه وسلم قال. \" نار بني آدم التي توقدونها جزء من سبعين جزءا من نار جهنم \" فقالوا يا رسول الله إن كانت لكافية فقال \" فضلت عليها بتسعة وستين جزءا \" أخرجاه في الصحيحين من حديث مالك به وقال الإمام أحمد حدثنا سفيان عن أبي الزناد عن الأعرج عن أبي هريرة عن النبي صلى الله عليه وسلم قال \" إن ناركم هذه جزء من سبعين جزءا من نار جهنم وضربت في البحر مرتين ولولا ذلك ما جعل الله فيها منفعة لأحد \". وهذا أيضا إسناده صحيح وقد روى الإمام أبو عيسى الترمذي وابن ماجه عن ابن عباس الدوري وعن يحيى بن أبي بكير عن شريك عن عاصم عن أبي صالح عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم \" أوقد الله على النار ألف سنة حتى احمرت ثم أوقد عليها ألف سنة حتى ابيضت ثم أوقد عليها ألف سنة حتى اسودت فهي سوداء كالليل المظلم \" ثم قال الترمذي لا أعلم أحدا رفعه غير يحيى. كذا قال وقد رواه الحافظ أبو بكر بن مردويه عن إبراهيم بن محمد عن محمد بن الحسين بن مكرم عن عبيد الله بن سعيد عن عمه عن شريك وهو ابن عبدالله النخعي به وروى أيضا ابن مردويه من رواية مبارك بن فضالة عن ثابت عن أنس قال تلا رسول الله صلى الله عليه وسلم \" نارا وقودها الناس والحجارة \" قال \" أوقد عليها ألف عام حتى ابيضت وألف عام حتى احمرت وألف عام حتى اسودت فهي سوداء كالليل لا يضيء لهيبها \". وروى الحافظ أبو القاسم الطبراني من حديث تمام بن نجيح وقد اختلف فيه عن الحسن عن أنس رفعه \" لو أن شرارة بالمشرق - أي من نار جهنم - لوجد حرها من بالمغرب \". وروى الحافظ أبو يعلي عن إسحاق بن أبي إسرائيل عن أبي عبيدة الحداد عن هشام بن حسان عن محمد بن شبيب عن جعفر بن أبي وحشية عن سعيد بن جبير عن أبي هريرة قال: قال رسول الله صلى الله عليه وسلم \" لو كان في هذا المسجد مائة ألف أو يزيدون وفيهم رجل من أهل النار فتنفس فأصابهم نفسه لاحترق المسجد ومن فيه \" غريب. وقال الأعمش عن أبي إسحاق عن النعمان بن بشير قال: قال رسول الله صلى الله عليه وسلم \" إن أهون أهل النار عذابا يوم القيامة لمن له نعلان وشراكان من نار جهنم يغلي منهما دماغه كما يغلي المرجل لا يرى أن أحدا من أهل النار أشد عذابا منه وإنه أهونهم عذابا \". أخرجاه في الصحيحين من حديث الأعمش وقال مسلم أيضا حدثنا أبو بكر بن أبي شيبة حدثنا يحيى بن أبي كثير حدثنا زهير بن محمد عن سهيل بن أبي صالح عن النعمان بن أبي عياش عن أبي سعيد الخدري أن رسول الله صلى الله عليه وسلم قال \" إن أدنى أهل النار عذابا يوم القيامة ينتعل بنعلين من نار يغلي دماغه من حرارة نعليه \" وقال الإمام أحمد حدثنا يحيى عن ابن عجلان سمعت أبي عن أبي هريرة عن النبي صلى الله عليه وسلم قال \" إن أدنى أهل النار عذابا رجل يجعل له نعلان يغلي منهما دماغه \" وهذا إسناد جيد قوي رجاله على شرط مسلم والله أعلم والأحاديث والآثار النبوية في هذا كثيرة وقال الله تعالى في كتابه العزيز \" كلا إنها لظى نزاعة للشوى \" وقال تعالى \" يصب من فوق رءوسهم الحميم يصهر به ما في بطونهم والجلود ولهم مقامع من حديد كلما أرادوا أن يخرجوا منها من غم أعيدوا فيها وذوقوا عذاب الحريق \" وقال تعالى \" إن الذين كفروا بآياتنا سوف نصليهم نارا كما نضجت جلودهم بدلناهم جلودا غيرها ليذوقوا العذاب \" وقال تعالى في هذه الآية الكريمة \" قل نار جهنم أشد حرا لو كانوا يفقهون \" أي لو أنهم يفقهون ويفقهون لنفروا مع الرسول في سبيل الله في الحر ليتقوا به من حر جهنم الذي هو أضعاف هذا ولكنهم كما قال الآخر: كالمستجير من الرمضاء بالنار وقال الآخر: عمرك بالحمـــــــية أفنيـــته خوفا من البارد والحار كان أولى لك أن تتقـــــــــي من المعاصي حذر النــار"
    },
    {
      "ayah": 82,
      "surah": 9,
      "text": "ثم قال تعالى جل جلاله متوعدا هؤلاء المنافقين على صنيعهم هذا فليضحكوا قليلا. الآية قال ابن أبي طلحة عن ابن عباس الدنيا قليل فليضحكوا فيها ما شاءوا فإذا انقطعت الدنيا وصاروا إلى الله عز وجل استأنفوا بكاء لا ينقطع أبدا وكذا قال أبو رزين والحسن وقتادة والربيع بن خثيم وعون العقيلي وزيد بن أسلم وقال الحافظ أبو يعلي الموصلي حدثنا عبدالله بن عبد الصمد بن أبي خداش حدثنا محمد بن جبير عن ابن المبارك عن عمران بن زيد حدثنا يزيد الرقاشي عن أنس بن مالك قال سمعت رسول الله صلى الله عليه وسلم يقول: يا أيها الناس ابكوا فإن لم تبكوا فتباكوا فإن أهل النار يبكون حتى تسيل دموعهم في وجوههم كأنها جداول حتى تنقطع الدموع فتسيل الدماء فتقرح العيون فلو أن سفنا أزجيت فيها لجرت. ورواه ابن ماجه من حديث الأعمش عن يزيد الرقاشي به وقال الحافظ أبو بكر بن عبدالله بن محمد بن أبي الدنيا حدثنا محمد بن العباس حدثنا حماد الجزري عن زيد بن رفيع رفعه قال. إن أهل النار إذا دخلوا النار بكوا الدموع زمانا ثم بكوا القيح زمانا قال فتقول لهم الخزنة يا معشر الأشقياء تركتم البكاء في الدار المرحوم فيها أهلها في الدنيا هل تجدون اليوم من تستغيثون به؟ قال فيرفعون أصواتهم يا أهل الجنة يا معشر الآباء والأمهات والأولاد خرجنا من القبور عطاشا وكنا طول الموقف عطاشا ونحن اليوم عطاش فأفيضوا علينا من الماء أو مما رزقكم الله. فيدعون أربعين سنة لا يجيبهم ثم يجيبهم إنكم ماكثون فييأسون من كل خير."
    },
    {
      "ayah": 83,
      "surah": 9,
      "text": "يقول تعالى آمرا لرسوله عليه الصلاة والسلام \"فإن رجعك الله\" أي ردك الله من غزوتك هذه إلى طائفة منهم قال قتادة: ذُكر لنا أنهم كانوا اثنى عشر رجلا فاستأذنوك للخروج أي معك إلى غزوة أخرى فقل لن تخرجوا معي أبدا ولن تقاتلوا معي عدوا أي تعزيزا لهم وعقوبة ثم علل ذلك بقوله إنكم رضيتم بالقعود أول مرة وهذا كقوله تعالى ونقلب أفئدتهم وأبصارهم كما لم يؤمنوا به أول مرة. الآية. فإن جزاء السيئة بعدها كما أن ثواب الحسنة الحسنة بعدها كقوله في عمرة الحديبية سيقول المخلفون إذا انطلقتم إلى مغانم لتأخذوها. الآية وقوله تعالى فاقعدوا مع الخالفين قال ابن عباس أي الرجال الذين تخلفوا عن الغزاة وقال قتادة فاقعدوا مع الخالفين أي مع النساء قال ابن جرير وهذا لا يستقيم لأن جمع النساء لا يكون بالياء والنون ولو أريد النساء لقال فاقعدوا مع الخوالف أو الخالفات ورجح قول ابن عباس رضي الله عنهما."
    },
    {
      "ayah": 84,
      "surah": 9,
      "text": "أمر الله تعالى رسوله صلى الله عليه وسلم أن يبرأ من المنافقين وأن لا يصلي على أحد منهم إذا مات وأن لا يقوم على قبره ليستغفر له أو يدعو له لأنهم كفروا بالله ورسوله وماتوا عليه وهذا حكم عام في كل من عرف نفاقه وإن كان سبب نزول الآية في عبدالله بن أبي بن سلول رأس المنافقين كما قال البخاري: حدثنا عبيد بن إسماعيل عن أبي أسامة عن عبيد الله عن نافع عن ابن عمر قال: لما توفي عبدالله بن أبي جاء ابنه عبدالله ابن عبدالله إلى رسول الله صلى الله عليه وسلم فسأله أن يعطيه قميصه يكفن فيه أباه فأعطاه ثم سأله أن يصلي عليه فقام رسول الله صلى الله عليه وسلم ليصلي عليه فقام عمر فأخذ بثوب رسول الله صلى الله عليه وسلم فقال يا رسول الله تصلي عليه وقد نهاك ربك أن تصلي عليه؟ فقال رسول الله صلى الله عليه وسلم \" إنما خيرني الله فقال \" استغفر لهم أو لا تستغفر لهم إن تستغفر لهم سبعين مرة فلن يغفر الله لهم \" وسأزيده على السبعين \" قال إنه منافق. قال فصلى عليه رسول الله صلى الله عليه وسلم فأنزل الله عز وجل آية \" ولا تصل على أحد منهم مات أبدا ولا تقم على قبره \" وكذا رواه مسلم عن أبي بكر بن أبي شيبة عن أبي أسامة حماد بن أسامة به. ثم رواه البخاري عن إبراهيم بن المنذر عن أنس بن عياض عن عبيد الله وهو ابن عمر العمري به. وقال فصلى عليه وصلينا معه وأنزل الله \" ولا تصل على أحد منهم مات أبدا \" الآية. وهكذا رواه الإمام أحمد عن يحيى بن سعيد القطان عن عبيد الله به وقد روى من حديث عمر بن الخطاب نفسه أيضا بنحو من هذا فقال الإمام أحمد: حدثنا يعقوب حدثنا أبي عن ابن إسحاق حدثني الزهري عن عبيد الله بن عبدالله عن ابن عباس قال سمعت عمر بن الخطاب رضي الله عنه يقول: لما توفي عبدالله بن أبي دعي رسول الله صلى الله عليه وسلم للصلاة عليه فقام إليه فلما وقف عليه يريد الصلاة تحولت حتى قمت في صدره فقلت يا رسول الله أعلى عدو الله عبدالله بن أبي القائل يوم كذا وكذا وكذا - يعدد أيامه -؟ قال ورسول الله صلى الله عليه وسلم يتبسم حتى إذا أكثرت عليه قال\" أخر عني يا عمر إني خيرت فاخترت قد قيل لي \" استغفر لهم \" الآية. لو أعلم أنى لو زدت على السبعين غفر له لزدت \" قال ثم صلى عليه: ومشى معه وقام على قبره حتى فرغ منه قال فعجبت من جرأتي على رسول الله صلى الله عليه وسلم الله ورسوله أعلم. قال فوالله ما كان إلا يسيرا حتى نزلت هاتان الآيتان \" ولا تصل على أحد منهم مات أبدا \" الآية. فما صلى رسول الله صلى الله عليه وسلم بعده على منافق ولا قام على قبره حتى قبضه الله عز وجل وهكذا رواه الترمذي في التفسير من حديث محمد بن إسحاق عن الزهري به وقال حسن صحيح ورواه البخاري عن يحيى بن بكير عن الليث عن عقيل عن الزهري به فذكر مثله وقال \" أخر عني يا عمر \" فلما أكثرت عليه قال \" إنى خيرت فاخترت ولو أعلم أنى إن زدت على السبعين غفر له لزدت عليها \" قال فصلى عليه رسول الله صلى الله عليه وسلم ثم انصرف لم يلبث إلا يسيرا حتى نزلت الآيتان من براءة \" ولا تصل على أحد منهم مات أبدا ولا تقم على قبره \" الآية. فعجبت بعد من جرأتي على رسول الله صلى الله عليه وسلم ورسول الله صلى الله عليه وسلم أعلم. وقال الإمام أحمد: حدثنا محمد بن عبيد حدثنا عبد الملك عن أبي الزبير عن جابر قال: لما مات عبدالله بن أبي أتى ابنه النبي صلى الله عليه وسلم فقال يا رسول الله إنك إن لم تأته لم نزل نعير بهذا فأتاه النبي صلى الله عليه وسلم فوجده قد أدخل في حفرته فقال \" أفلا قبل أن تدخلوه؟ \" فأخرج من حفرته وتفل عليه من ريقه من قرنه إلى قدمه وألبسه قميصه ; ورواه النسائي عن أبي داود الحراني عن يعلى بن عبيد عن عبد الملك وهو ابن أبي سليمان به وقال البخاري حدثنا عبدالله بن عثمان أخبرنا ابن عيينة عن عمرو سمع جابر بن عبدالله قال: أتى النبي صلى الله عليه وسلم عبدالله بن أبي بعد ما أدخل في قبره فأمر به فأخرج ووضع على ركبتيه ونفث عليه من ريقه وألبسه قميصه والله أعلم. وقد رواه أيضا في غير موضع مسلم والنسائي من غير وجه عن سفيان بن عيينة به وقال الإمام أبو بكر أحمد بن عمرو بن عبد الخالق البزار في مسنده حدثنا عمرو بن علي حدثنا يحيى حدثنا مجالد حدثنا عامر حدثنا جابر ح وحدثنا يوسف بن موسى حدثنا عبدالرحمن بن مغراء الدوسي حدثنا مجالد عن الشعبي عن جابر قال لما مات رأس المنافقين - قال يحيى بن سعيد بالمدينة - فأوصى أن يصلي عليه النبي صلى الله عليه وسلم فجاء ابنه إلى النبي صلى الله عليه وسلم فقال إن أبي أوصى أن يكفن بقميصك - وهذا الكلام في حديث عبدالرحمن بن مغراء قال يحيى في حديثه - فصلى عليه وألبسه قميصه فأنزل الله تعالى \" ولا تصل على أحد منهم مات أبدا ولا تقم على قبره \" - وزاد عبدالرحمن -: وخلع النبي صلى الله عليه وسلم قميصه فأعطاه إياه ومشى فصلى عليه وقام على قبره فأتاه جبريل عليه السلام لما ولى قال \" ولا تصل على أحد منهم مات أبدا ولا تقم على قبره \" وإسناده لا بأس به وما قبله شاهد له. وقال الإمام أبو جعفر الطبري حدثنا أحمد بن إسحاق حدثنا أبو أحمد حدثنا حماد بن سلمة عن يزيد الرقاشي عن أنس أن رسول الله صلى الله عليه وسلم أراد أن يصلي على عبدالله بن أبي فأخذ جبريل بثوبه وقال ولا تصل على أحد منهم مات أبدا ولا تقم على قبره. ورواه الحافظ أبو يعلي في مسنده من حديث يزيد الرقاشي وهو ضعيف وقال قتادة أرسل عبدالله ابن أبي إلى رسول الله صلى الله عليه وسلم وهو مريض فلما دخل عليه قال له النبي صلى الله عليه وسلم أهلكك حب يهود قال يا رسول الله إنما أرسلت إليك لتستغفر لي ولم أرسل إليك أتؤنبني ثم سأله عبدالله أن يعطيه قميصه يكفن فيه أباه فأعطاه إياه وصلى عليه وقام على قبره فأنزل الله عز وجل ولا تصل على أحد منهم مات أبدا. الآية. وقد ذكر بعض السلف أنما كساه قميصه لأن عبدالله ابن أبي لما قدم العباس طلب له قميص فلم يوجد على تفصيله إلا ثوب عبدالله بن أبي لأنه كان ضخما طويلا ففعل ذلك به رسول الله صلى الله عليه وسلم مكافأة له فالله أعلم ولهذا كان رسول الله صلى الله عليه وسلم بعد نزول هذه الآية الكريمة عليه لا يصلي على أحد من المنافقين ولا يقوم على قبره كما قال الإمام أحمد حدثنا يعقوب حدثنا أبي عن أبيه حدثني عبدالله بن أبي قتادة عن أبيه قال: كان رسول الله صلى الله عليه وسلم إذا دعا إلى جنازة سأل عنها فإن اثنى عليها خيرا قام فصلى عليها وإن كان غير ذلك قال لأهلها شأنكم بها ولم يصل عليها وكان عمر بن الخطاب لا يصلي على جنازة من جهل حاله حتى يصلى عليها حذيفة بن اليمان لأنه كان يعلم أعيان المنافقين قد أخبره بهم رسول الله صلى الله عليه وسلم ولهذا كان يقال له صاحب السر الذي لا يعلمه غيره أي من الصحابة وقال أبو عبيد في كتاب الغريب في حديث عمر أنه أراد أن يصلى على جنازة رجل فمرزه حذيفة كأنه أراد أن يصده عن الصلاة عليها ثم حكى عن بعضهم أن المرز بلغه أهل اليمامة هو القرص بأطراف الأصابع ولما نهى الله عز وجل عن الصلاة على المنافقين والقيام على قبورهم للاستغفار لهم كان هذا الصنيع من أكبر القربات في حق المؤمنين فشرع ذلك وفي فعله الأجر الجزيل كما ثبت في الصحاح وغيرها من حديث أبي هريرة رضي الله عنه أن رسول الله صلى الله عليه وسلم قال من شهد الجنازة حتى يصلي عليها فله قيراط ومن شهدها حتى تدفن فله قيراطان قيل وما القيراطان؟ قال أصغرهما مثل أحد وأما القيام عند قبر المؤمن إذا مات فروى أبو داود حدثنا إبراهيم بن موسى الرازي أخبرنا هشام عن عبدالله بن بحير عن هانئ وهو أبو سعيد البريري مولى عثمان ابن عفان عن عثمان رضي الله عنه قال: كان رسول الله صلى الله عليه وسلم إذا فرغ من دفن الميت وقف عليه وقال استغفروا لأخيكم واسألوا له التثبيت فإنه الآن يسأل. انفرد بإخراجه أبو داود رحمه الله."
    },
    {
      "ayah": 85,
      "surah": 9,
      "text": "يقول تعالى لرسوله صلى الله عليه وسلم \" فلا تعجبك أموالهم ولا أولادهم \" كما قال تعالى \" ولا تمدن عينيك إلى ما متعنا به أزواجا منهم زهرة الحياة الدنيا لنفتنهم فيه ورزق ربك خير وأبقى \" وقال \" أيحسبون أن ما نمدهم به من مال وبنين نسارع لهم في الخيرات بل لا يشعرون \" وقوله \" إنما يريد الله ليعذبهم بها في الحياة الدنيا \" قال الحسن البصري بزكاتها والنفقة منها في سبيل الله وقال قتادة هذا من المقدم والمؤخر تقديره: فلا تعجبك أموالهم ولا أولادهم في الحياة الدنيا إنما يريد الله ليعذبهم بها في الآخرة. واختار ابن جرير قول الحسن وهو القول القوي الحسن. وقوله \" وتزهق أنفسهم وهم كافرون \" أي ويريد أن يميتهم حين يميتهم على الكفر ليكون ذلك أنكى لهم وأشد لعذابهم. عياذا بالله من ذلك وهذا يكون من باب الاستدراج لهم فيما هم فيه."
    },
    {
      "ayah": 86,
      "surah": 9,
      "text": "يقول تعالى منكرا وذاما للمتخلفين عن الجهاد الناكلين عنه مع القدرة عليه ووجود السعة والطول واستأذنوا الرسول في القعود وقالوا ذرنا نكن مع القاعدين. ورضوا لأنفسهم بالعار والقعود في البلد مع النساء وهن الخوالف بعد خروج الجيش فإذا وقع الحرب كانوا أجبن الناس وإذا كان أمن كانوا أكثر الناس كلاما كما قال تعالى عنهم في الآية الأخرى\" فإذا جاء الخوف رأيتهم ينظرون إليك تدور أعينهم كالذي يغشى عليه من الموت فإذا ذهب الخوف سلقوكم بألسنة حداد\". أي علت ألسنتهم بالكلام الحد القوي في الأمن وفي الحرب أجبن شيء وكما قال الشاعر: في السلم أعيار أجفا وغلظة وفي الحرب أشباه النساء الفوارك؟ وقال تعالى في الآية الأخرى \" ويقول الذين آمنوا لولا نزلت سورة فإذا أنزلت سورة محكمة وذكر فيها القتال رأيت الذين في قلوبهم مرض ينظرون إليك نظر المغشي عليه من الموت فأولى لهم طاعة وقول معروف فإذا عزم الأمر فلو صدقوا الله لكان خيرا لهم \" الآية."
    },
    {
      "ayah": 87,
      "surah": 9,
      "text": "وقوله \" وطُبع على قلوبهم \" أي بسبب نكولهم عن الجهاد والخروج مع الرسول في سبيل الله \" فهم لا يفقهـون \" أي لا يفهمون ما فيه صلاح لهم فيفعلوه ولا ما فيه مضرة لهم فيجتنبوه."
    },
    {
      "ayah": 88,
      "surah": 9,
      "text": "لما ذكر تعالى ذنب المنافقين وبين ثناءه على المؤمنين وما لهم في آخرتهم فقال \" لكن الرسول والذين آمنوا معه جاهدوا \" إلى آخر الآيتين من بيان حالهم ومآلهم وقال \" وأولئك لهم الخيرات \" أي في الدار الآخرة في جنات الفردوس والدرجات العلى."
    },
    {
      "ayah": 89,
      "surah": 9,
      "text": "لما ذكر تعالى ذنب المنافقين وبين ثناءه على المؤمنين وما لهم في آخرتهم فقال \" لكن الرسول والذين آمنوا معه جاهدوا \" إلى آخر الآيتين من بيان حالهم ومآلهم وقال \" وأولئك لهم الخيرات \" أي في الدار الآخرة في جنات الفردوس والدرجات العلى."
    },
    {
      "ayah": 9,
      "surah": 9,
      "text": "يقول تعالى ذما للمشركين وحثا للمؤمنين على قتالهم \" اشتروا بآيات الله ثمنا قليلا \" يعني أنهم اعتاضوا عن اتباع آيات الله بما التهوا به من أمور الدنيا الخسيسة \" فصدوا عن سبيله \" أي منعوا المؤمنين من من اتباع الحق."
    },
    {
      "ayah": 90,
      "surah": 9,
      "text": "ثم بين تعالى حال ذوي الأعذار في ترك الجهاد الذين جاءوا رسول الله صلى الله عليه وسلم يعتذرون إليه ويبينون له ما هم فيه من الضعف وعدم القدرة على الخروج وهم من أحياء العرب ممن حول المدينة. قال الضحاك عن ابن عباس إنه كان يقرأ \" وجاء المعذرون \" بالتخفيف ويقول هم أهل العذر وكذا روى ابن عيينة عن حميد عن مجاهد سواء قال ابن إسحاق وبلغني أنهم نفر من بني غفار خفاف بن إيماء بن رخصة وهذا القول هو الأظهر في معنى الآية لأنه قال بعد هذا \" وقعد الذين كذبوا الله ورسوله \" أي \" لم يأتوا فيعتذروا وقال ابن جريج عن مجاهد \" وجاء المعذرون من الأعراب \" قال نفر من بني غفار جاءوا فاعتذروا فلم يعذرهم الله وكذا قال الحسن وقتادة ومحمد بن إسحاق والقول الأول أظهر والله أعلم لما قدمنا من قوله بعده \" وقعد الذين كذبوا الله ورسوله \" أي وقعد آخرون من الأعراب عن المجيء للاعتذار ثم أوعدهم بالعذاب الأليم فقال \" سيصيب الذين كفروا منهم عذاب أليم \"."
    },
    {
      "ayah": 91,
      "surah": 9,
      "text": "ثم بين تعالى الأعذار التي لا حرج على من قعد معها عن القتال فذكر منها ما هو لازم للشخص لا ينفك عنه وهو الضعف في التركيب الذي لا يستطيع معه الجلاد في الجهاد ومنه العمى والعرج ونحوهما ولهذا بدأ به \" ومنها ما هو عارض بسبب مرض عَنَّ له في بدنه شغله عن الخروج في سبيل الله أو بسبب فقره لا يقدر على التجهيز للحرب فليس على هؤلاء حرج إذا قعدوا ونصحوا في حال قعودهم ولم يرجفوا بالناس ولم يثبطوهم وهم محسنون في حالهم هذا ولهـذا قال \" ما على المحسنين من سبيل والله غفور رحيم \". وقال سفيان الثوري عن عبد العزيز بن رفيع عن أبي ثمامة رضي الله عنه قال: قال الحواريون يا روح الله أخبرنا عن الناصح لله؟ قال: الذي يؤثر حق الله على حق الناس وإذا حدث له أمران أو بدا له أمر الدنيا وأمر الآخرة بدأ بالذي للآخرة ثم تفرغ للذي للدنيا وقال الأوزاعي خرج الناس إلى الاستسقاء فقام فيهم بلال بن سعد فحمد الله وأثنى عليه ثم قال: يا معشر من حضر: ألستم مقرين بالإساءة؟ قالوا اللهم نعم اللهم أنا نسمعك تقول ما على المحسنين من سبيل اللهم وقد أقررنا بالإساءة فاغفر لنا وارحمنا واسقنا ورفع يديه ورفعوا أيديهم فسقوا وقال قتادة نزلت هذه الآية في عائذ بن عمرو المزني حدثنا ابن أبي حاتم حدثنا أبي حدثنا هشام بن عبيد الله الرازي حدثنا ابن جابر عن ابن فروة عن عبدالرحمن بن أبي ليلى عن زيد بن ثابت قال: كنت أكتب لرسول الله صلى الله عليه وسلم فكنت أكتب براءة فإني لواضع القلم على أذني إذ أمرنا بالقتال فجعل رسول الله صلى الله عليه وسلم ينظر ما ينزل عليه إذا جاء أعمى فقال كيف بي يا رسول الله وأنا أعمى؟ فنزلت ليس على الضعفاء. الآية. وقال العوفي عن ابن عباس في هذه الآية وذلك أن رسول الله صلى الله عليه وسلم أمر الناس أن ينبعثوا غازين معه فجاءته عصابة من أصحابه فيهم عبدالله ابن مغفل بن مقرن المزني فقالوا يا رسول الله أحملنا فقال لهم والله لا أجد ما أحملكم عليه فتولوا وهم يبكون وعز عليهم أن يجلسوا عند الجهاد ولا يجدون نفقة ولا محملا. فلما رأى الله حرصهم على محبته ومحبة رسوله أنزل عذرهم في كتابه وقال\" ليس على الضعفاء\" إلى قوله فهم لا يعلمون وقال مجاهد في قوله \"ولا على الذين إذا ما أتوك لتحملهم\" نزلت في بني مكرم من مزينة وقال محمد بن كعب كانوا سبعة نفر من بني عمرو بن عوف سالم بن عوف ومن بني واقف حرمي بن عمرو ومن بني مازن بن النجار عبدالرحمن بن كعب ويكنى أبا ليلى ومن بنى المعلى فضل الله ومن بني سلمة عمرو بن عتبة وعبدالله ابن عمرو والمزني وقال محمد بن إسحاق في سياق غزوة تبوك ثم إن رجالا من المسلمين أتوا رسول الله صلى الله عليه وسلم وهم البكاؤون وهم سبعة نفر من الأنصار وغيرهم من بني عمرو بن عوف سالم بن عمير وعلية بن زيد أخو بني حارثة وأبو ليلى عبدالرحمن بن كعب أخو بني مازن بن النجار وعمرو بن الحمام بن الجموح أخو بني سلمة وعبدالله بن المغفل المزني وبعض الناس يقول بل هو عبدالله ابن عمرو المزني وحرمي بن عبدالله أخو بني واقف وعياض بن سارية الفزاري فاستحملوا رسول الله صلى الله عليه وسلم وكانوا أهل حاجة فقال لا أجد ما أحملكم عليه تولوا وأعينهم تفيض من الدمع حزنا إلا يجدوا ما ينفقون وقال ابن أبي حاتم حدثنا عمرو بن الأودي حدثنا وكيع عن الربيع عن الحسن قال: قال رسول الله صلى الله عليه وسلم لقد خلفتم بالمدينة أقواما ما أنفقتم من نفقة ولا قطعتم واديا ولا نلتم من عدو نيلا وقد شركوكم في الأجر. ثم قرأ\" ولا على الذين إذا ما أتوك لتحملهم قلت لا أجد ما أحملكم عليه\" الآية. وأصل الحديث في الصحيحين من حديث أنس أن رسول الله صلى الله عليه وسلم قال إن بالمدينة أقواما ما قطعتم واديا ولا سرتم سيرا إلا وهم معكم قالوا وهم بالمدينة؟ قال نعم حسبهم العذر وقال الإمام أحمد حدثنا وكيع حدثنا الأعمش عن أبي سفيان عن جابر قال: قال رسول الله صلى الله عليه وسلم لقد خلفتم بالمدينة رجالا ما قطعتم واديا ولا سلكتم طريقا إلا شركوكم في الأجر حبسهم المرض. ورواه مسلم وابن ماجه من طرق عن الأعمش به."
    },
    {
      "ayah": 92,
      "surah": 9,
      "text": "ثم بين تعالى الأعذار التي لا حرج على من قعد معها عن القتال فذكر منها ما هو لازم للشخص لا ينفك عنه وهو الضعف في التركيب الذي لا يستطيع معه الجلاد في الجهاد ومنه العمى والعرج ونحوهما ولهذا بدأ به \" ومنها ما هو عارض بسبب مرض عَنَّ له في بدنه شغله عن الخروج في سبيل الله أو بسبب فقره لا يقدر على التجهيز للحرب فليس على هؤلاء حرج إذا قعدوا ونصحوا في حال قعودهم ولم يرجفوا بالناس ولم يثبطوهم وهم محسنون في حالهم هذا ولهـذا قال \" ما على المحسنين من سبيل والله غفور رحيم \". وقال سفيان الثوري عن عبد العزيز بن رفيع عن أبي ثمامة رضي الله عنه قال: قال الحواريون يا روح الله أخبرنا عن الناصح لله؟ قال: الذي يؤثر حق الله على حق الناس وإذا حدث له أمران أو بدا له أمر الدنيا وأمر الآخرة بدأ بالذي للآخرة ثم تفرغ للذي للدنيا وقال الأوزاعي خرج الناس إلى الاستسقاء فقام فيهم بلال بن سعد فحمد الله وأثنى عليه ثم قال: يا معشر من حضر: ألستم مقرين بالإساءة؟ قالوا اللهم نعم اللهم أنا نسمعك تقول ما على المحسنين من سبيل اللهم وقد أقررنا بالإساءة فاغفر لنا وارحمنا واسقنا ورفع يديه ورفعوا أيديهم فسقوا وقال قتادة نزلت هذه الآية في عائذ بن عمرو المزني حدثنا ابن أبي حاتم حدثنا أبي حدثنا هشام بن عبيد الله الرازي حدثنا ابن جابر عن ابن فروة عن عبدالرحمن بن أبي ليلى عن زيد بن ثابت قال: كنت أكتب لرسول الله صلى الله عليه وسلم فكنت أكتب براءة فإني لواضع القلم على أذني إذ أمرنا بالقتال فجعل رسول الله صلى الله عليه وسلم ينظر ما ينزل عليه إذا جاء أعمى فقال كيف بي يا رسول الله وأنا أعمى؟ فنزلت ليس على الضعفاء. الآية. وقال العوفي عن ابن عباس في هذه الآية وذلك أن رسول الله صلى الله عليه وسلم أمر الناس أن ينبعثوا غازين معه فجاءته عصابة من أصحابه فيهم عبدالله ابن مغفل بن مقرن المزني فقالوا يا رسول الله أحملنا فقال لهم والله لا أجد ما أحملكم عليه فتولوا وهم يبكون وعز عليهم أن يجلسوا عند الجهاد ولا يجدون نفقة ولا محملا. فلما رأى الله حرصهم على محبته ومحبة رسوله أنزل عذرهم في كتابه وقال\" ليس على الضعفاء\" إلى قوله فهم لا يعلمون وقال مجاهد في قوله \"ولا على الذين إذا ما أتوك لتحملهم\" نزلت في بني مكرم من مزينة وقال محمد بن كعب كانوا سبعة نفر من بني عمرو بن عوف سالم بن عوف ومن بني واقف حرمي بن عمرو ومن بني مازن بن النجار عبدالرحمن بن كعب ويكنى أبا ليلى ومن بنى المعلى فضل الله ومن بني سلمة عمرو بن عتبة وعبدالله ابن عمرو والمزني وقال محمد بن إسحاق في سياق غزوة تبوك ثم إن رجالا من المسلمين أتوا رسول الله صلى الله عليه وسلم وهم البكاؤون وهم سبعة نفر من الأنصار وغيرهم من بني عمرو بن عوف سالم بن عمير وعلية بن زيد أخو بني حارثة وأبو ليلى عبدالرحمن بن كعب أخو بني مازن بن النجار وعمرو بن الحمام بن الجموح أخو بني سلمة وعبدالله بن المغفل المزني وبعض الناس يقول بل هو عبدالله ابن عمرو المزني وحرمي بن عبدالله أخو بني واقف وعياض بن سارية الفزاري فاستحملوا رسول الله صلى الله عليه وسلم وكانوا أهل حاجة فقال لا أجد ما أحملكم عليه تولوا وأعينهم تفيض من الدمع حزنا إلا يجدوا ما ينفقون وقال ابن أبي حاتم حدثنا عمرو بن الأودي حدثنا وكيع عن الربيع عن الحسن قال: قال رسول الله صلى الله عليه وسلم لقد خلفتم بالمدينة أقواما ما أنفقتم من نفقة ولا قطعتم واديا ولا نلتم من عدو نيلا وقد شركوكم في الأجر. ثم قرأ\" ولا على الذين إذا ما أتوك لتحملهم قلت لا أجد ما أحملكم عليه\" الآية. وأصل الحديث في الصحيحين من حديث أنس أن رسول الله صلى الله عليه وسلم قال إن بالمدينة أقواما ما قطعتم واديا ولا سرتم سيرا إلا وهم معكم قالوا وهم بالمدينة؟ قال نعم حسبهم العذر وقال الإمام أحمد حدثنا وكيع حدثنا الأعمش عن أبي سفيان عن جابر قال: قال رسول الله صلى الله عليه وسلم لقد خلفتم بالمدينة رجالا ما قطعتم واديا ولا سلكتم طريقا إلا شركوكم في الأجر حبسهم المرض. ورواه مسلم وابن ماجه من طرق عن الأعمش به."
    },
    {
      "ayah": 93,
      "surah": 9,
      "text": "ثم رد تعالى الملامة على الذين يستأذنون في القعود وهم أغنياء وأنبهم في رضاهم بأن يكونوا مع النساء الخوالف في الرحال وطبع الله على قلوبهم فهم لا يعلمون."
    },
    {
      "ayah": 94,
      "surah": 9,
      "text": "أخبر تعالى عن المنافقين بأنهم إذا رجعوا إلى المدينة أنهم يعتذرون إليهم \" قل لا تعتذروا لن نؤمن لكم \" أي لن نصدقكم \" قد نبأنا الله من أخباركم \" أي قد أعلمنا الله أحوالكم \" وسيرى الله عملكم ورسوله \" أي سيظهر أعمالكم للناس في الدنيا \" ثم تردون إلى عالم الغيب والشهادة فينبئكم بما كنتم تعملون \" أي فيخبركم بأعمالكم خيرها وشرها ويجزيكم عليها."
    },
    {
      "ayah": 95,
      "surah": 9,
      "text": "ثم أخبر عنهم أنهم يحلفون لكم معتذرين لتعرضوا عنهم فلا تؤنبوهم فأعرضوا عنهم احتقارا لهم إنهم رجس أي خبث نجس بواطنهم واعتقاداتهم ومأواهم في آخرتهم جهنم جزاء بما كانوا يكسبون أي من الآثام والخطايا."
    },
    {
      "ayah": 96,
      "surah": 9,
      "text": "وأخبر أنهم إن رضوا عنهم بحلفهم لهم \" فإن الله لا يرضى عن القوم الفاسقين \" أي الخارجين عن طاعة الله وطاعة رسوله فإن الفسق هو الخروج ومنه سميت الفأرة فويسقة لخروجها من جحرها للإفساد ويقال فسقت الرطبة إذا خرجت من أكمامها."
    },
    {
      "ayah": 97,
      "surah": 9,
      "text": "أخبر تعالى أن في الأعراب كفارا ومنافقين ومؤمنين وأن كفرهم ونفاقهم أعظم من غيرهم وأشد وأجدر أي أحرى أن لا يعلموا حدود ما أنزل الله على رسوله كما قال الأعمش عن إبراهيم قال: جلس أعرابي إلى زيد بن صوحان وهو يحدث أصحابه وكانت يده قد أصيبت يوم \"نهاوند\" فقال الأعرابي والله إن حديثك ليعجبني وإن يدك لتريبني فقال زيد ما يريبك من يدي إنها الشمال؟ فقال الأعرابي والله ما أدري اليمين يقطعون أو الشمال فقال زيد بن صوحان صدق الله \" الأعراب أشد كفرا ونفاقا وأجدر أن لا يعلمـوا حدود ما أنزل الله على رسوله \". وقال الإمام أحمد حدثنا عبدالرحمن بن مهدي حدثنا سفيان عن أبي موسى عن وهب بن منبه عن ابن عباس عن رسول الله صلى الله عليه وسلم قال \" من سكن البادية جفا ومن اتبع الصيد غفل ومن أتى السلطان افتتن \". ورواه أبو داود والترمذي والنسائي من طرق عن سفيان الثوري به وقال الترمذي حسن غريب لا نعرفه إلا من حديث الثوري ولما كانت الغلظة والجفاء في أهل البوادي لم يبعث الله منهم رسولا وإنما كانت البعثة من أهل القرى كما قال تعالى \" وما أرسلنا من قبلك إلا رجالا نوحي إليهم من أهل القرى \" ولما أهدى ذلك الأعرابي تلك الهدية لرسول الله صلى الله عليه وسلم فرد عليه أضعافها حتى رضي قال \" لقد هممت أن لا أقبل هدية إلا من قرشي أو ثقفي أو أنصاري أو دوسي \". لأن هؤلاء كانوا يسكنون المدن مكة والطائف والمدينة واليمن فهم ألطف أخلاقا من الأعراب لما في طباع الأعراب من الجفاء. \" حديث الأعرابي في تقبيل الولد \"قال حديث مسلم حدثنا أبو بكر بن أبي شيبة وأبو كريب قالا حدثنا أبو أسامة وابن نمير عن هشام عن أبيه عن عائشة قالت: قدم ناس من الأعراب على رسول الله صلى الله عليه وسلم فقالوا: أتقبلون صبيانكم؟ قالوا نعم قالوا لكنا والله ما نقبل فقال رسول الله صلى الله عليه وسلم \" وأملك إن كان الله نزع منكم الرحمة\" وقال ابن نمير \" من قلبك الرحمة \". وقوله \" والله عليم حكيم \" أي عليم بمن يستحق أن يعلمه الإيمان والعلم حكيم فيما قسم بين عباده من العلم والجهل والإيمان والكفر والنفاق \"لا يسئل عما يفعل\" لعلمه وحكمته."
    },
    {
      "ayah": 98,
      "surah": 9,
      "text": "وأخبر تعالى أن منهم \" من يتخذ ما ينفق \" أي في سبيل الله \" مغرما \" أي غرامة وخسارة \" ويتربص بكم الدوائر \" أي ينتظر بكم الحوادث والآفات \" عليهم دائرة السوء \" أي هي منعكسة عليهم والسوء دائر عليهم \" والله سميع عليم \" أي سميع لدعاء عباده عليم بمن يستحق النصر ممن يستحق الخذلان."
    },
    {
      "ayah": 99,
      "surah": 9,
      "text": "وقوله \" ومن الأعراب من يؤمن بالله واليوم الآخر ويتخذ ما ينفق قربات عند الله وصلوات الرسول \" هذا هو القسم الممدوح من الأعراب وهم الذين يتخذون ما ينفقون في سبيل الله قربة يتقربون بها عند الله ويبتغون دعاء الرسول لهم \" ألا إنها قربة لهم \" أي ألا إن ذلك حاصل لهم \" سيدخلهم الله في رحمته إن الله غفور رحيم \"."
    }
  ]
}
