{
  "ayahs": [
    {
      "ayah": 1,
      "surah": 90,
      "text": "هذا قسم من الله تبارك وتعالي بمكة أم القرى في حال كون الساكن فيها حلالا لينبه على عظمة قدرها في حال إحرام أهلها قال خصيف عن مجاهد \"لا أقسم بهذا البلد\" لا رد عليهم أقسم بهذا البلد وقال شبيب بن بشر عن عكرمة عن ابن عباس \"لا أقسم بهذا البلد\" يعني مكة."
    },
    {
      "ayah": 10,
      "surah": 90,
      "text": "الطريقين قال سفيان الثورى عن عاصم عن زر عن عبدالله هو ابن مسعود \"وهديناه النجدين\" قال الخير والشر وكذا روي عن علي وابن عباس ومجاهد وعكرمة وأبي وائل وأبي صالح ومحمد بن كعب والضحاك وعطاء الخراساني في آخرين وقال ابن وهب أخبرني ابن لهيعة عن يزيد بن أبي حبيب عن سنان بن سعد عن أنس بن مالك قال: قال رسول الله صلى الله عليه وسلم \"هما نجدان فما جعل نجد الشر أحب إليكم من نجد الخير\" تفرد به سنان بن سعد ويقال سعد بن سنان وقد وثقه ابن معين وقال الإمام أحمد والنسائي والجوزجاني منكر الحديث وقال أحمد تركت حديثه لاضطرابه وروى خمسة عشر حديثا منكرة كلها ما أعرف منها حديثا واحدًا يشبه حديثه حديث الحسن - يعني البصري - لا يشبه حديث أنس وقال ابن جرير حدثني يعقوب حدثنا بن علية عن أبي رجاء قال سمعت الحسن يقول \"وهديناه النجدين\" قال ذكر لنا أن نبي الله صلى الله عليه وسلم كان يقول \"يا أيها الناس إنهما النجدان نجد الخير ونجد الشر فما جعل نجد الشر أحب إليكم من نجد الخير\" وكذا رواه حبيب بن الشهيد ومعمر ويونس بن عبيد وأبو وهب عن الحسن مرسلا وهكذا أرسله قتادة. وقال ابن أبي حاتم حدثنا أحمد بن عصام الأنصاري حدثنا أبو أحمد الزبيري حدثنا عيسى بن عفان عن أبيه عن ابن عباس في قوله تعالى \"وهديناه النجدين\" قال الثديين وروى عن الربيع بن خيثم وقتادة وأبي حازم مثل ذلك ورواه ابن جرير عن أبي كريب عن وكيع عن عيسى بن عفان به ثم قال والصواب القول الأول ونظير هذه الآية قوله تعالى \"إنا خلقنا الإنسان من نطفة أمشاج نبتليه فجعلناه سميعا بصيرا إنا هديناه السبيل إما شاكرا وإما كفورا\"."
    },
    {
      "ayah": 11,
      "surah": 90,
      "text": "قال ابن جرير حدثني عمر بن إسماعيل بن مجالد حدثنا عبدالله بن إدريس عن أبيه عن أبي عطية عن ابن عمر في قوله تعالى \"فلا اقتحم\" أي دخل \"العقبة\" قال جبل في جهنم وقال كعب الأحبار \"فلا اقتحم العقبة\" هو سبعون درجة في جهنم وقال الحسن البصري \"فلا اقتحم العقبة\" قال عقبة في جهنم وقال قتادة إنها عقبة قحمة شديدة فاقتحموها."
    },
    { "ayah": 12, "surah": 90, "text": "وقال قتادة \"وما أدراك ما العقبة\". ثم أخبر تعالى عن اقتحامها." },
    {
      "ayah": 13,
      "surah": 90,
      "text": "فقال \"فك رقبة أو إطعام\" وقال ابن زيد \"فلا اقتحم العقبة\" أي أفلا سلك الطريق التي فيها النجاة والخير ثم بينها فقال تعالى \"وما أدراك ما العقبة فك رقبة أو إطعام\" قرئ فك رقبة بالإضافة وقرئ على أنه فعل وفيه ضمير الفاعل والرقبة مفعولة وكلتا القراءتين معناهما متقارب. قال الإمام أحمد حدثنا علي بن إبراهيم حدثنا عبدالله يعني ابن سعيد بن أبي هند عن إسماعيل بن أبي حكيم مولى آل الزبير عن سعد بن مرجانة أنه سمع أبا هريرة يقول: قال رسول الله صلى الله عليه وسلم \"من أعتق رقبة مؤمنة أعتق الله بكل إرب - أي عضو - منها إربا منه من النار حتى إنه ليعتق باليد اليد وبالرجل الرجل وبالفرج الفرج\" فقال علي بن الحسين أنت سمعت هذا من أبي هريرة؟ فقال سعيد نعم فقال علي بن الحسين لغلام له أفره غلمانه ادع مطرفا فلما قام بين يديه قال اذهب فأنت حر لوجه الله وقد رواه البخاري ومسلم والترمذي والنسائي من طرق عن سعيد بن مرجانة به وعند مسلم أن هذا الغلام الذي أعتقه علي بن الحسين زين العابدين كان قد أعطي فيه عشرة آلاف درهم وقال قتادة عن سالم بن أبي الجعد عن معدان بن أبي طلحة عن أبي نجيح قال سمع رسول الله صلى الله عليه وسلم يقول: \"أيما مسلم أعتق رجلا مسلما فإن الله جاعل وفاء كل عظم من عظامه عظما من عظامه محررا من النار وأيما امرأة اعتقت امرأة مسلمة فإن الله جاعل وفاء كل عظم من عظامها عظما من عظامها من النار\" رواه ابن جرير هكذا وأبو نجيح هذا هو عمر بن عبسة السلمي رضي الله عنه قال الإمام أحمد حدثنا حيوة بن شريح حدثنا بقية حدثني بجير بن سعد عن خالد بن معدان عن كثير بن مرة عن عمرو بن عبسة أنه حدثهم أن النبي صلى الله عليه وسلم قال \"من بنى مسجدا ليذكر الله فيه بنى الله له بيتا في الجنة ومن أعتق نفسا مسلمة كانت فديته من جهنم ومن شاب شيبة فى الإسلام كانت له نورا يوم القيامة\" \"طريق أخرى\" قال أحمد حدثنا الحكم بن نافع حدثنا جرير عن سليم بن عامر أن شرحبيل بن السمط قال لعمرو بن عبسة حدثنا حديثا ليس فيه تزيد ولا نسيان قال عمرو سمعت رسول الله صلى الله عليه وسلم يقول \"من أعتق رقبة مسلم كانت فكاكه من النار عضوا بعضو ومن شاب شيبة في سبيل الله كانت له نورا يوم القيامة ومن رمى بسهم فبلغ فأصاب أو أخطأ كان كمعتق رقبة من بني إسماعيل\" وروى أبو داود والنسائي بعضه \"طريق أخرى\" قال أحمد حدثنا هاشم بن القاسم حدثنا الفرج حدثنا لقمان عن أبي أمامة عن عمرو بن عبسة قال: قلت له حدثنا حديثا سمعته من رسول الله صلى الله عليه وسلم ليس فيه انتقاض ولا وهم قال سمعته يقول \"من ولد له ثلاثة أولاد في الإسلام فماتوا قبل أن يبلغوا الحنث أدخله الله الجنة بفضل رحمته إياهم ومن شاب شيبة في سبيل الله كانت له نورا يوم القيامة ومن رمى بسهم في سبيل الله بلغ به العدو أصاب أو أخطأ كان له عتق رقبة ومن أعتق رقبة مؤمنة أعتق الله بكل عضو منه عضوا منه من النار ومن أنفق زوجين في سبيل الله فإن للجنة ثمانية أبواب يدخله الله من أي باب شاء منها\" وهذه أسانيد قوية ولله الحمد. \"حديث آخر\" قال أبو داود حدثنا عيسى بن محمد الرملي حدثنا ضمرة عن ابن أبي عبلة عن العريف بن عياش الديلمي قال أتينا واثلة بن الأسقع فقلنا له حدثنا حديثا ليس فيه زيادة ولا نقصان فغضب وقال إن أحدكم ليقرأ ومصحفه معلق في بيته فيزيد وينقص قلنا إنما أردنا حديثا سمعته من رسول الله صلى الله عليه وسلم قال: أتينا رسول الله صلى الله عليه وسلم في صاحب لنا قد أوجب يعني النار بالقتل فقال \"أعتقوا عنه يعتق الله بكل عضو منه عضوا من النار\" وكذا رواه النسائي من حديث إبراهيم بن أبي عبلة عن العريف بن عياش الديملي عن واثلة به. \"حديث آخر\" قال أحمد حدثنا عبدالصمد حدثنا هشام عن قتادة عن قيس الجذامي عن عقبة بن عامر الجهني أن رسول الله صلى الله عليه وسلم قال \"من أعتق رقبة مسلمة فهو فداؤه من النار\" وحدثنا عبد الوهاب الخفاف عن سعيد عن قتادة قال: ذكر لنا أن قيسا الجذامي حدث عن عقبة بن عامر أن رسول الله صلى الله عليه وسلم قال \"من أعتق رقبة مؤمنة فهي فكاكه من النار\" تفرد به أحمد من هذا الوجه. \"حديث آخر\" قال الإمام أحمد حدثنا يحيى بن آدم وأبو أحمد قالا حدثنا عيسى بن عبدالرحمن البجلي من بني بجيلة من بني سليم عن طلحة بن مصرف عن عبدالرحمن بن عوسجة عن البراء بن عازب قال: جاء أعرابي إلى رسول الله صلى الله عليه وسلم فقال يا رسول الله علمني عملا يدخلني الجنة فقال \"لئن كنت أقصرت الخطبة لقد أعرضت المسألة أعتق النسمة وفك الرقبة\" فقال يا رسول الله أو ليستا بواحدة؟ قال \"لا إن عتق النسمة أن تنفرد بعتقها وفك الرقبة أن تعين في عتقها والمنحة الوكوف والفيء على ذي الرحم الظالم فإن لم تطق ذلك فأطعم الجائع واسق الظمآن وأمر بالمعروف وانه عن المنكر فإن لم تطق ذلك فكف لسانك إلا من الخير\"."
    },
    {
      "ayah": 14,
      "surah": 90,
      "text": "قوله تعالى \"أو إطعام في يوم ذي مسغبة\" قال ابن عباس ذي مجاعة وكذا قال عكرمة ومجاهد والضحاك وقتادة وغير واحد والسغب هو الجوع وقال إبراهيم النخعي في يوم الطعام فيه عزيز وقال قتادة في يوم مشتهى فيه الطعام."
    },
    {
      "ayah": 15,
      "surah": 90,
      "text": "قوله تعالى \"يتيما\" أي أطعم في مثل هذا اليوم يتيما \"ذا مقربة\" أي إذا قرابة منه قاله ابن عباس وعكرمة والحسن والضحاك والسدي كما جاء في الحديث الذي رواه الإمام أحمد حدثنا يزيد أخبرنا هشام عن حفصة بنت سيرين عن سلمان بن عامر قال سمعت رسول الله صلى الله عليه وسلم يقول \"الصدقة على المسكين صدقة وعلى ذي الرحم اثنتان صدقة وصلة\" وقد رواه الترمذي والنسائي وهذا إسناد صحيح."
    },
    {
      "ayah": 16,
      "surah": 90,
      "text": "وقوله تعالى \"أو مسكينا ذا متربة\" أي فقيرا مدقعا لاصقا بالتراب وهو الدقعاء أيضا قال ابن عباس ذا متربة هو المطروح في الطريق الذي لا بيت له ولا شيء يقيه من التراب وفي رواية هو الذي لصق بالدقعاء من الفقر والحاجة ليس له شيء وفي رواية عنه هو البعيد التربة قال ابن أبي حاتم يعني الغريب عن وطنه وقال عكرمة هو الفقير المديون المحتاج وقال سعيد بن جبير هو الذي لا أحد له وقال ابن عباس وسعيد وقتادة ومقاتل بن حيان هو ذو العيال وكل هذه قريبة المعنى."
    },
    {
      "ayah": 17,
      "surah": 90,
      "text": "وقوله تعالى \"ثم كان من الذين آمنوا\" أي ثم هو مع هذه الأوصاف الجميلة الطاهرة مؤمن بقلبه محتسب ثواب ذلك عند الله عز وجل كما قال تعالى \"ومن أراد الآخرة وسعى لها سعيها وهو مؤمن فأولئك كان سعيهم مشكورا\" وقال تعالى \"من عمل صالحا من ذكر أو أنثى وهو مؤمن\" الآية وقوله تعالى \"وتواصوا بالصبر وتواصوا بالمرحمة\" أي كان من المؤمنين العاملين صالحا المتواصين بالصبر على أذى الناس وعلى الرحمة بهم كما جاء في الحديث الشريف \"الراحمون يرحمهم الرحمن ارحموا من في الأرضى يرحمكم من في السماء\" وفي الحديث الآخر \"لا يرحم الله من لا يرحم الناس\" وقال أبو داود حدثنا أبو بكر بن أبي شيبة حدثنا سفيان عن ابن أبي نجيح عن ابن عامر عن عبدالله بن عمرو يرويه قال: من لم يرحم صغيرنا ويعرف حق كبيرنا فليس منا."
    },
    { "ayah": 18, "surah": 90, "text": "قوله تعالى \"أولئك أصحاب الميمنة\" أى المتصفون بهذه الصفات من أصحاب اليمين." },
    { "ayah": 19, "surah": 90, "text": "قال \"والذين كفروا بآياتنا هم أصحاب المشئمة\" أى أصحاب الشمال." },
    {
      "ayah": 2,
      "surah": 90,
      "text": "قال أنت يا محمد يحل لك أن تقاتل به وكذا روي عن سعيد بن جبير وأبي صالح وعطية والضحاك وقتادة والسدي وابن زيد وقال مجاهد ما أصبت فيه فهو حلال لك وقال قتادة \"وأنت حل بهذا البلد\" قال أن به من غير حرج ولا إثم وقال الحسن البصري أحلها الله له ساعة من نهار وهذا المعني الذي قالوه قد ورد به الحديث المتفق على صحته \"إن هذا البلد حرمه الله يوم خلق السموات والأرض فهو حرام بحرمة الله إلى يوم القيامة لا يعضد شجره ولا يختلى خلاه وإنما أحلت لي ساعة من نهار وقد عادت حرمتها اليوم كحرمتها بالأمس ألا فليبلغ الشاهد الغائب\" وفي لفظ آخر \"فإن أحد ترخص بقتال رسول الله فقولوا إن الله أذن لرسوله ولم يأذن لكم\"."
    },
    {
      "ayah": 20,
      "surah": 90,
      "text": "أي مطبقة عليهم فلا محيد لهم عنها ولا خروج لهم منها. قال أبو هريرة وابن عباس وعكرمة وسعيد بن جبير ومجاهد ومحمد بن كعب القرظي وعطية العوفي والحسن وقتادة والسدي \"مؤصدة\" أي مطبقة. قال ابن عباس مغلقة الأبواب وقال مجاهد أصد الباب بلغة قريش أي أغلقه وسيأتي في ذلك حديث في سورة \"ويل لكل همزة لمزة\". وقال الضحاك \"مؤصدة\" حيط لا باب له. وقال قتادة \"مؤصدة\" مطبقة لا ضوء فيها ولا فرج ولا خروج منها آخر الأبد. وقال أبو عمران الجوني إذا كان يوم القيامة أمر الله بكل جبار وكل شيطان وكل من كان يخاف الناس في الدنيا شره فأوثقوا بالحديد ثم أمر بهم إلى جهنم ثم أوصدوها عليهم أي أطبقوها قال فلا والله لا تستقر أقدامهم على قرار أبدا ولا والله لا ينظرون فيها إلى أديم سماء أبدا ولا والله لا تلتقي جفون أعينهم على غمض نوم أبدا. ولا والله لا يذوقون فيها بارد شراب أبدا رواه ابن أبي حاتم. آخر تفسير سورة البلد ولله الحمد والمنة."
    },
    {
      "ayah": 3,
      "surah": 90,
      "text": "وقوله تعالى \"ووالد وما ولد\" قال ابن جرير حدثنا أبو كريب حدثنا ابن عطية عن شريك عن خصيف عن عكرمة عن ابن عباس في قوله تعالى \"ووالد وما ولد\" الوالد الذي يلد وما ولد العاقر الذي لا يولد له ورواه ابن أبي حاتم من حديث شريك وهو ابن عبدالله القاضي به وقال عكرمة الوالد العاقر وما ولد الذي يلد. رواه ابن أبي حاتم وقال مجاهد وأبو صالح وقتادة والضحاك وسفيان الثوري وسعيد بن جبير والسدي والحسن البصري وخصيف وشرحبيل بن سعد وغيرهم يعني بالوالد آدم وما ولد ولده وهذا الذي ذهب إليه مجاهد وأصحابه حسن قوي لأنه تعالى لما أقسم بأم القرى وهي أم المساكن أقسم بعده بالساكن وهو آدم أبو البشر وولده وقال أبو عمران الجوني هو إبراهيم وذريته رواه ابن جرير وابن أبي حاتم واختار ابن جرير أنه عام في كل والد وولده وهو محتمل أيضا وقوله تعالى \"لقد خلقنا الإنسان فى كبد\" روي عن ابن مسعود وابن عباس وعكرمة ومجاهد النخعي وخيثمة والضحاك وغيرهم يعني منتصبا زاد ابن عباس في رواية عنه منتصبا في بطن أمه والكبد الاستواء والاستقامة ومعنى هذا القول لقد خلقناه سويا مستقيما كقوله تعالى \"يا أيها الإنسان ما غرك بربك الكريم الذي خلقك فسواك فعدلك في أي صورة ما شاء ركبك\"."
    },
    {
      "ayah": 4,
      "surah": 90,
      "text": "قوله تعالى \"لقد خلقنا الإنسان في كبد\" وقال ابن أبي نجيح وجريج وعطاء عن ابن عباس في كبد قال في شدة خلق ألم تر إليه وذكر مولده ونبات أسنانه وقال مجاهد \"في كبد\" نطفة ثم علقة ثم مضغة يتكبد في الخلق قال مجاهد وهو كقوله تعالى \"حملته أمه كرها ووضعته كرها\" وأرضعته كرها ومعيشته كره فهو يكابد ذلك وقال سعيد بن جبير \"لقد خلقنا الإنسان في كبد\" في شدة وطلب معيشة وقال عكرمة في شدة وطول وقال قتادة في مشقة. وقال ابن أبي حاتم حدثنا أحمد بن عصام حدثنا أبو عاصم أخبرنا عبدالحميد بن جعفر سمعت محمد بن علي أبا جعفر الباقر سأل رجلا من الأنصار عن قول الله تعالي \"لقد خلقنا الإنسان في كبد\" قال في قيامه واعتداله فلم ينكر عليه أبو جعفر وروى من طريق أبي مودود سمعت الحسن قرا هذه الآية \"لقد خلقنا الإنسان في كبد\" قال يكابد أمرا من أمر الدنيا وأمرا من أمر الآخرة وفي رواية يكابد مضايق الدنيا وشدائد الآخرة وقال ابن زيد \"لقد خلقنا الإنسان في كبد\" قال آدم خلق في السماء فسمي ذلك الكبد واختار ابن جرير أن المراد بذلك مكابدة الأمور ومشاقها."
    },
    {
      "ayah": 5,
      "surah": 90,
      "text": "قوله تعالى \"أيحسب أن لن يقدر عليه أحد\" قال الحسن البصري يعني \"أيحسب أن لن يقدر عليه أحد\" يأخذ ماله وقال قتادة \"أيحسب أن لن يقدر عليه أحد\" قال أبن آدم يظن أن لن يسأل عن هذا المال من أين اكتسبه وأين أنفقه؟ وقال السدي \"أيحسب أن لن يقدر عليه أحد\" قال الله عز وجل."
    },
    {
      "ayah": 6,
      "surah": 90,
      "text": "قوله تعالى \"يقول أهلكت مالا لبدا\" أي يقول ابن آدم أنفقت مالا لبدا أي كثيرا قاله مجاهد والحسن وقتادة والسدي وغيرهم."
    },
    { "ayah": 7, "surah": 90, "text": "قال مجاهد أي أيحسب أن لم يره الله عز وجل وكذا قال غيره من السلف." },
    {
      "ayah": 8,
      "surah": 90,
      "text": "أى يبصر بهما فانظر بعينيك إلى ما أحللت لك وإن رأيت ما حرمت عليك فأطبق عليهما غطاءهما."
    },
    {
      "ayah": 9,
      "surah": 90,
      "text": "\"ولسانا\" أي ينطق به فيعبر عما في ضميره \"وشفتين\" يستعين بهما على الكلام وأكل الطعام وجمالا لوجهه وفمه. وقد روى الحافظ ابن عساكر في ترجمة أبي الربيع الدمشقي عن مكحول قال: قال النبي صلى الله عليه وسلم \"يقول الله تعالى: يا ابن آدم قد أنعمت عليك نعما عظاما لا تحصي عددها ولا تطيق شكرها وإن مما أنعمت عليك أن جعلت لك عينين تنظر بهما وجعلت لهما غطاء فانظر بعينيك إلي ما أحللت لك وإن رأيت ما حرمت عليك فأطبق عليهما غطاءهما وجعلت لك لسانا وجعلت له غلافا فانطق بما أمرتك وأحللت لك فإن عرض علي ما حرمت عليك فأغلق عليك لسانك وجعلت لك فرجا وجعلت لك سترا فأصب بفرجك ما أحللت لك فإن عرض عليك ما حرمت عليك فأرخ عليك سترك ابن آدم إنك لا تحمل سخطي ولا تطيق انتقامي\"."
    }
  ]
}
