{
  "ayahs": [
    {
      "ayah": 1,
      "surah": 91,
      "text": "سورة الشمس: تقدم حديث جابر الذي في الصحيحين أن رسول الله صلى الله عليه وسلم قال لمعاذ \"هلا صليت ب \"سبح اسم ربك الأعلى\" \"والشمس وضحاها\" \"والليل إذا يغشى\" ؟\". قال مجاهد \"والشمس وضحاها\" أي وضوئها وقال قتادة \"وضحاها\" النهار كله. قال ابن جرير والصواب أن يقال أقسم الله بالشمس ونهارها لأن ضوء الشمس الظاهرة هو النهار."
    },
    {
      "ayah": 10,
      "surah": 91,
      "text": "\"وقد خاب من دساها\" أي دسسها أي أخملها ووضع منها بخذلانه إياها عن الهدى حتى ركب المعاصي وترك طاعة الله عز وجل وقد يحتمل أن يكون المعنى قد أفلح من زكى الله نفسه وقد خاب من دسى الله نفسه كما قال العوفي وعلي بن أبي طلحة عن ابن عباس وقال ابن أبي حاتم حدثنا أبي حدثنا أبو زرعة قالا حدثنا سهل بن عثمان حدثنا أبو مالك يعني عمرو بن الحارث عن عمرو بن هشام عن جويبر عن الضحاك عن ابن عباس قال: سمعت رسول الله صلى الله عليه وسلم يقول فى قول الله عز وجل \"قد أفلح من زكاها\" قال النبي صلى الله عليه وسلم \"أفلحت نفس زكاها الله عز وجل\" ورواه ابن أبي حاتم من حديث مالك به وجويبر هذا هو ابن سعيد متروك الحديث والضحاك لم يلق ابن عباس وقال الطبراني حدثنا يحيى بن عثمان بن صالح حدثنا أبي حدثنا ابن لهيعة عن عمرو بن دينار عن ابن عباس قال: كان رسول الله صلى الله عليه وسلم إذا مر بهذه الآية \"ونفس وما سواها فألهمها فجورها وتقواها\" وقف ثم قال \"اللهم آت نفسي تقواها أنت وليها ومولاها وخير من زكاها\" \"حديث آخر\" قال ابن أبي حاتم حدثنا أبو زرعة حدثنا يعقوب بن حميد المدني حدثنا عبدالله بن عبدالله الأموي حدثنا معن بن محمد الغفاري عن حنظلة بن علي الأسلمي عن أبي هريرة قال سمعت رسول الله صلى الله عليه وسلم يقرأ \"فألهمها فجورها وتقواها\" قال اللهم آت نفسي تقواها وزكها أنت خير من زكاها أنت وليها ومولاها لم يخرجه من هذا الوجه وقال الإمام أحمد حدثنا وكيع عن نافع عن ابن عمر عن صالح بن سعيد عن عائشة أنها فقدت النبي صلى الله عليه وسلم من مضجعه فلمسته بيدها فوقعت عليه وهو ساجد وهو يقول \"رب أعط نفسي تقواها وزكها أنت خير من زكاها أنت وليها ومولاها\" تفرد به. \"حديث آخر\" وقال الإمام أحمد حدثنا عفان حدثنا عبدالواحد بن زياد حدثنا عاصم الأحول عن عبدالله بن الحارث عن زيد بن أرقم قال كان رسول الله يقول \"اللهم إني أعوذ بك من العجز والكسل والهرم والجبن والبخل وعذاب القبر اللهم آت نفسي تقواها وزكها أنت خير من زكاها أنت وليها ومولاها اللهم إني أعوذ بك من قلب لا يخشع ومن نفس لا تشبع وعلم لا ينفع ودعوة لا يستجاب لها\" قال زيد كان رسول الله صلى الله عليه وسلم يعلمناهن ونحن نعلمكموهن رواه مسلم من حديث أبي معاوية عن عاصم الأحول عن عبدالله بن الحارث وأبي عثمان النهدي عن زيد بن أرقم به."
    },
    {
      "ayah": 11,
      "surah": 91,
      "text": "يخبر تعالى عن ثمود أنهم كذبوا رسولهم بسبب ما كانوا عليه من الطغيان والبغي وقال محمد بن كعب \"بطغواها\" أي بأجمعها والأول أولى قاله مجاهد وقتادة وغيرهما فأعقبهم ذلك تكذيبا في قلوبهم بما جاءهم به رسولهم عليه الصلاة والسلام من الهدى واليقين."
    },
    {
      "ayah": 12,
      "surah": 91,
      "text": "\"إذ انبعث أشقاها\" أي أشقى القبيلة وهو قدار بن سالف عاقر الناقة وهو أحيمر ثمود وهو الذي قال الله تعالى \"فنادوا صاحبهم فتعاطى فعقر\" الآية وكان هذا الرجل عزيزا فيهم شريفا في قومه نسيبا رئيسا مطاعا كما قال الإمام أحمد حدثنا ابن نمير حدثنا هشام عن أبيه عن عبدالله بن زمعة قال خطب رسول الله صلى الله عليه وسلم فذكر الناقة وذكر الذي عقرها فقال \"إذ انبعث أشقاها\" انبعث لها رجل عارم عزيز منيع في رهطه مثل أبي زمعة\" ورواه البخاري في التفسير ومسلم في صفة النار والترمذي والنسائي في التفسير من سننيهما وكذا ابن جرير وابن أبي حاتم عن هشام بن عروة به. وقال ابن أبي حاتم حدثنا أبو زرعة حدثنا إبراهيم بن موسى حدثني عيسى بن يونس حدثنا محمد بن إسحاق حدثني يزيد بن محمد بن خثيم عن محمد بن كعب القرظي عن محمد بن خثيم بن أبي مرثد عن عمار بن ياسر قال: قال رسول الله صلى الله عليه وسلم لعلي \"ألا أحدثك بأشقى الناس ؟\" قال بلى قال \"رجلان أحيمر ثمود الذي عقر الناقة والذي يضربك يا علي على هذا - يعني قرنه - حتى تبتل منه هذه\" يعني لحيته."
    },
    {
      "ayah": 13,
      "surah": 91,
      "text": "قوله تعالى \"فقال لهم رسول الله\" يعني صالحا عليه السلام \"ناقة الله\" أي احذروا ناقة الله أن تمسوها بسوء \"وسقياها\" أي لا تعتدوا عليها في سقياها فإن لها شرب يوم ولكم شرب يوم معلوم."
    },
    {
      "ayah": 14,
      "surah": 91,
      "text": "قال الله تعالى \"فكذبوه فعقروها\" أي كذبوه فيما جاءهم به فأعقبهم ذلك أن عقروا الناقة التي أخرجها الله من الصخرة آية لهم وحجة عليهم \"فدمدم عليهم ربهم بذنبهم\" أي غضب عليه فدمر عليهم \"فسواها\" أي فجعل العقوبة نازلة عليهم على السواء قال قتادة بلغنا أن أحيمر ثمود لم يعقر الناقة حتى بايعه صغيرهم وكبيرهم وذكرهم وأنثاهم فلما اشترك القوم عقرها دمدم الله عليهم بذنبهم فسواها."
    },
    {
      "ayah": 15,
      "surah": 91,
      "text": "قوله تعالى \"ولا يخاف\" وقرئ فلا يخاف \"عقباها\" قال ابن عباس لا يخاف الله من أحد تبعة وكذا قال مجاهد. والحسن وبكر بن عبدالله المزني وغيرهم وقل الضحاك والسدي ولا يخاف عقباها أي لم يخف الذي عقرها عاقبة ما صنع والقول الأول أولى لدلالة السياق عليه والله أعلم. آخر تفسير سورة الشمس وضحاها ولله الحمد والمنة."
    },
    {
      "ayah": 2,
      "surah": 91,
      "text": "\"والقمر إذا تلاها\" قال مجاهد تبعها. وقال العوفي عن ابن عباس \"والقمر إذا تلاها\" قال يتلو النهار وقال قتادة إذا تلاها ليلة الهلال إذا سقطت الشمس رئي الهلال وقال ابن زيد هو يتلوها في النصف الأول من الشهر ثم هي تتلوه وهو يتقدمها في النصف الأخير من الشهر. وقال مالك عن زيد بن أسلم إذا تلاها ليلة القدر."
    },
    {
      "ayah": 3,
      "surah": 91,
      "text": "قوله تعالى \"والنهار إذا جلاها\" قال مجاهد أضاء وقال قتادة \"والنهار إذا جلاها\" إذا غشيها النهار وقال ابن جرير: وكان بعض أهل العربية يتأول ذلك بمعنى والنهار إذا جلا الظلمة لدلالة الكلام عليها \"قلت\" ولو أن هذا القائل تأول ذلك بمعنى \"والنهار إذا جلاها\" أي البسيطة لكان أولى ولصح تأويله."
    },
    {
      "ayah": 4,
      "surah": 91,
      "text": "قوله تعالى \"والليل إذا يغشاها\" فكان أجود وأقوى والله أعلم. ولهذا قال مجاهد \"والنهار إذا جلاها\" إنه كقوله تعالى \"والنهار إذا تجلى\" وأما ابن جرير فاختار عود الضمير في ذلك كله على الشمس لجريان ذكرها وقالوا في قوله تعالى \"والليل إذا يغشاها\" يعني إذا يغشى الشمس حين تغيب فتظلم الآفاق. وقال بقية بن الوليد عن صفوان حدثني يزيد بن ذي حمامة قال: إذا جاء الليل قال الرب جل جلاله غشي عبادي خلقي العظيم فالليل يهابه والذي خلقه أحق أن يهاب. رواه ابن أبي حاتم."
    },
    {
      "ayah": 5,
      "surah": 91,
      "text": "قوله تعالى \"والسماء وما بناها\" يحتمل أن تكون ما ههنا مصدرية بمعنى والسماء وبنائها وهو قول قتادة ويحتمل أن تكون بمعنى من يعني والسماء وبانيها وهو قول مجاهد وكلاهما متلازم والبناء هو الرفع كقوله تعالى \"والسماء بنيناها بأيد - أي بقوة - وإنا لموسعون والأرض فرشناها فنعم الماهدون\"."
    },
    {
      "ayah": 6,
      "surah": 91,
      "text": "قوله تعالى \"والأرض وما طحاها\" قال مجاهد: طحاها دحاها. قال العوفي عن ابن عباس \"وما طحاها\" أي خلق فيها وقال علي بن أبي طلحة عن ابن عباس طحاها قسمها. وقال مجاهد وقتادة والضحاك والسدي والثوري وابن صالح وابن زيد \"طحاها\" بسطها وهذا أشهر الأقوال وعليه الأكثر من المفسرين وهو المعروف عند أهل اللغة. قال الجوهري طحوته مثل دحوته أي بسطته."
    },
    {
      "ayah": 7,
      "surah": 91,
      "text": "وقوله تعالى \"ونفس وما سواها\" أي خلقها سوية مستقيمة على الفطرة القويمة كما قال تعالى \"فأقم وجهك للدين حنيفا فطرة الله التي فطر الناس عليها لا تبديل لخلق الله\" وقال رسول الله صلى الله عليه وسلم \"كل مولود يولد على الفطرة فأبواه يهودانه أو ينصرانه أو يمجسانه كما تولد البهيمة بهيمة جمعاء هل تحسون فيها من جدعاء؟\" أخرجاه من رواية أبي هريرة وفي صحيح مسلم من رواية عياض بن حماد المجاشعي عن رسول الله صلى الله عليه وسلم قال \"يقول الله عز وجل إني خلقت عبادي حنفاء فجاءتهم الشياطين فاجتالتهم عن دينهم\"."
    },
    {
      "ayah": 8,
      "surah": 91,
      "text": "قوله تعالى \" فألهمها فجورها وتقواها\" أي فأرشدها إلى فجورها وتقواها أي بين لها وهداها إلى ما قدر لها قال ابن عباس \"فألهمها فجورها وتقواها\" بين لها الخير والشر وكذا قال مجاهد وقتادة والضحاك والثوري. وقال سعيد بن جبير ألهمها الخير والشر وقال ابن زيد: جعل فيها فجورها وتقواها وقال ابن جرير حدثنا ابن خالد حدثنا صفوان بن عيسى وأبو عاصم النبيل قالا حدثنا عزرة بن ثابت حدثني يحيى بن عقيل عن يحيى بن يعمر عن أبي الأسود الديلي قال: قال لي عمران بن حصين أرأيت ما يعمل الناس فيه ويتكادحون فيه أشيء قضي عليهم ومضى عليهم من قدر قد سبق أو فيما يستقبلون مما أتاهم به نبيهم صلى الله عليه وسلم وأكدت عليهم الحجة؟ قلت بل شيء قضي عليهم قال فهل يكون ذلك ظلما؟ قال ففزعت منه فزعا شديدا قال: قلت له ليس شيء إلا وهو خلقه وملك يده لا يسئل عما يفعل وهم يسئلون قال سددك الله إنما سألتك لأخبر عقلك أن رجلا من مزينة أو جهينة أتى رسول الله صلى الله عليه وسلم فقال يا رسول الله أرأيت ما يعمل الناس فيه ويتكادحون أشيء قضي عليهم ومضى عليهم من قدر قد سبق أم شيء مما يستقبلون مما أتاهم به نبيهم صلى الله عليه وسلم وأكدت به عليهم الحجة؟ قال \"بل شيء قد قضي عليهم\" قال ففيم نعمل؟ قال \"من كان الله خلقه لإحدى المنزلتين يهيئه لها وتصديق ذلك في كتاب الله تعالى \"ونفس وما سواها فألهمها فجورها وتقواها\" رواه أحمد ومسلم من حديث عزرة بن ثابت به."
    },
    {
      "ayah": 9,
      "surah": 91,
      "text": "قوله تعالى \"قد أفلح من زكاها\" يحتمل أن يكون المعنى قد أفلح من زكى نفسه أي بطاعة الله كما قال قتادة وطهرها من الأخلاق الدنيئة والرذائل ويروى نحوه عن مجاهد وعكرمة وسعيد بن جبير وكقوله تعالى \"قد أفلح من تزكى وذكر اسم ربه فصلى\"."
    }
  ]
}
