{
  "ayahs": [
    {
      "ayah": 1,
      "surah": 92,
      "text": "سورة الليل: تقدم قوله عليه الصلاة والسلام لمعاذ \"فهلا صليت بسبح اسم ربك الأعلى والشمس وضحاها والليل إذا يغشى\" قال الإمام أحمد حدثنا يزيد بن هارون حدثنا شعبة عن المغيرة عن إبراهيم عن علقمة أنه قدم الشام فدخل مسجد دمشق فصلى فيه ركعتين وقال: اللهم ارزقني جليسا صالحا. قال فجلس إلى أبي الدرداء فقال له أبو الدرداء ممن أنت؟ قال من أهل الكوفة قال كيف سمعت ابن أم عبد يقرأ \"والليل إذا يغشى والنهار إذا تجلى\" قال علقمة \"والذكر والأنثى\" فقال أبو الدرداء لقد سمعتها من رسول الله صلى الله عليه وسلم فما زال هؤلاء حتى شككوني ثم قال ألم يكن فيكم صاحب السواد وصاحب السر الذي لا يعلمه أحد غيره والذي أجير من الشيطان على لسان محمد صلى الله عليه وسلم وقد رواه البخاري ههنا ومسلم من طريق الأعمش عن إبراهيم قال قدم أصحاب عبدالله على أبي الدرداء فطلبهم فوجدهم فقال أيكم يقرأ على قراءة عبدالله؟ قالوا كلنا قال أيكم أحفظ؟ فأشاروا إلى علقمة فقال كيف سمعته يقرأ \"والليل إذا يغشى\" قال \"والذكر والأنثى\" قال أشهد أني سمعت رسول الله صلى الله عليه وسلم يقرأ هكذا وهؤلاء يريدون أن أقرأ \"وما خلق الذكر والأنثى\" والله لا أتابعهم هذا لفظ البخاري."
    },
    {
      "ayah": 10,
      "surah": 92,
      "text": "\"فسنيسره للعسرى\" أي لطريق الشر كما قال تعالى \"ونقلب أفئدتهم وأبصارهم كما لم يؤمنوا به أول مرة ونذرهم في طغيانهم يعمهون\" والآيات في هذا المعنى كثيرة دالة على أن الله عز وجل يجازي من قصد الخير بالتوفيق له ومن قصد الشر بالخذلان وكل ذلك بقدر مقدر والأحاديث الدالة على هذا المعنى كثيرة \"رواية أبي بكر الصديق رضي الله عنه\" قال الإمام أحمد حدثنا علي بن عياش حدثني العطاف بن خالد حدثني رجل من أهل البصرة عن طلحة بن عبدالله بن عبدالرحمن بن أبي بكر الصديق عن أبيه قال سمعت أبي يذكر أن أباه سمع أبا بكر وهو يقول: قلت لرسول الله صلى الله عليه وسلم يا رسول الله أنعمل على ما فرغ منه أو على أمر مؤتنف؟ قال \"بل على أمر قد فرغ منه\" قال ففيم العمل يا رسول الله؟ قال \"كل ميسر لما خلق له\" \"رواية علي رضي الله عنه\" قال البخاري حدثنا أبو نعيم حدثنا سفيان عن الأعمش عن سعيد بن عبيدة عن أبي عبدالرحمن السلمي عن علي بن أبي طالب رضي الله عنه قال: كنا مع رسول الله صلى الله عليه وسلم في بقيع الغرقد في جنازة فقال \"ما منكم من أحد إلا وقد كتب مقعده من الجنة ومقعده من النار\" فقالوا يا رسول الله أفلا نتكل؟ فقال \"اعملوا فكل ميسر لما خلق له\" ثم قرأ \"فأما من أعطى واتقى وصدق بالحسنى فسنيسره لليسرى - إلى قوله - للعسرى\" وكذا رواه من طريق شعبة ووكيع عن الأعمش بنحوه. ثم رواه عن عثمان بن أبي شيبة عن جرير عن منصور عن سعيد بن عبيدة عن أبي عبدالرحمن عن علي بن أبي طالب رضي الله عنه قال: كنا في جنازة في بقيع الغرقد فأتى رسول الله صلى الله عليه وسلم فقعد وقعدنا حوله ومعه مخصرة فنكس فجعل ينكت بمخصرته ثم قال \"ما منكم من أحد - أو ما من نفس منفوسة - إلا كتب مكانها من الجنة والنار وإلا قد كتبت شقية أو سعيدة\" فقال رجل يا رسول الله أفلا نتكل على كتابنا وندع العمل؟ فمن كان منا من أهل السعادة فسيصير إلى أهل السعادة ومن كان منا من أهل الشقاء فسيصير إلى أهل الشقاء؟ فقال \"أما أهل السعادة فييسرون لعمل أهل السعادة وأما أهل الشقاء فييسرون إلى عمل أهل الشقاء\" ثم قرأ \"فأما من أعطى واتقى وصدق بالحسنى فسنيسره لليسرى وأما من بخل واستغنى وكذب بالحسنى فسنيسره للعسرى\" وقد أخرجه بقية الجماعة من طرق عن سعيد بن عبيدة به \"رواية عبدالله بن عمر\" قال الإمام أحمد حدثنا عبدالرحمن حدثنا شعبة عن عاصم بن عبيد الله قال سمعت سالم بن عبدالله يحدث عن ابن عمر قال: قال عمر يا رسول الله أرأيت ما نعمل فيه أفي أمر قد فرغ أو مبتدأ أو مبتدع؟ قال \"فيما قد فرغ منه فاعمل يا ابن الخطاب فإن كلا ميسر أما من كان من أهل السعادة فإنه يعمل للسعادة وأما من كان من أهل الشقاء فإنه يعمل للشقاء\" ورواه الترمذي في القدر عن بندار عن ابن مهدي به وقال حسن صحيح \"حديث آخر من رواية جابر\" قال ابن جرير حدثني يونس أخبرنا ابن وهب أخبرني عمرو بن الحارث عن أبي الزبير عن جابر بن عبدالله أنه قال: يا رسول الله أنعمل لأمر قد فرغ منه أو لأمر نستأنفه؟ فقال \"لأمر قد فرغ منه\" فقال سراقة ففيم العمل إذا؟ فقال رسول الله صلى الله عليه وسلم \"كل عامل ميسر لعمله\" ورواه مسلم عن أبي الطاهر عن ابن وهب به \"حديث آخر\" قال ابن جرير حدثني يونس حدثنا سفيان عن عمرو بن دينار عن طلق بن حبيب عن بشير بن كعب العدوي قال: سأل غلامان شابان النبي صلى الله عليه وسلم فقالا يا رسول الله أنعمل فيما جفت به الأقلام وجرت به المقادير أو في شيء يستأنف؟ فقال \"بل فيما جفت به الأقلام وجرت به المقادير\" قالا ففيم العمل إذا؟ قال \"اعملوا فكل عامل ميسر لعمله الذي خلق له\" قالا نجد ونعمل \"رواية أبي الدرداء\" قال الإمام أحمد حدثنا هشيم بن خارجة حدثنا أبو الربيع سليمان بن عتبة السلمي عن يونس بن ميسرة بن حلبس عن أبي إدريس عن أبي الدرداء قال: قالوا يا رسول الله أرأيت ما نعمل أمر قد فرغ منه أم شيء نستأنفه؟ قال \"بل أمر قد فرغ منه\" فقالوا فكيف بالعمل يا رسول الله؟ قال \"كل امرئ مهيأ لما خلق له\" تفرد به أحمد من هذا الوجه \"حديث آخر\" قال ابن جرير حدثني الحسن بن سلمة بن أبي كبشة حدثنا عبدالملك بن عمرو حدثنا عباد بن راشد عن قتادة حدثني خليد العصري عن أبي الدرداء قال: قال رسول الله صلى الله عليه وسلم \"ما من يوم غربت فيه شمسه إلا وبجنبتيها ملكان يناديان يسمعهما خلق الله كلهم إلا الثقلين: اللهم أعط منفقا خلفا وأعط ممسكا تلفا\" وأنزل الله في ذلك القرآن \"فأما من أعطى واتقى وصدق بالحسنى فسنيسره لليسرى وأما من بخل واستغنى وكذب بالحسنى فسنيسره للعسرى\" ورواه ابن أبي حاتم عن أبيه عن ابن أبي كبشة بإسناده مثله \"حديث آخر\" قال ابن أبي حاتم حدثني أبو عبدالله الطهراني حدثنا حفص بن عمر العدني حدثنا الحكم بن أبان عن عكرمة عن ابن عباس أن رجلا كان له نخيل ومنها نخلة فرعها في دار رجل صالح فقير ذي عيال فإذا جاء الرجل فدخل داره فيأخذ التمرة من نخلته فتسقط التمرة فيأخذها صبيان الرجل الفقير فينزل من نخلته فينزع الثمرة من أيديهم وإن أدخل أحدهم التمرة في فمه أدخل أصبعه في حلق الغلام ونزع التمرة من حلقه فشكا ذلك الرجل إلى النبي صلى الله عليه وسلم وأخبره بما هو فيه من صاحب النخلة فقال له النبي صلى الله عليه وسلم \"اذهب\" ولقي النبي صلى الله عليه وسلم صاحب النخلة فقال له \"أعطني نخلتك التي فرعها في دار فلان ولك بها نخلة في الجنة\" فقال له لقد أعطيتك ولكن يعجبني ثمرها وإن لي لنخلا كثيرا ما فيها نخلة أعجب إلى ثمره من ثمرها فذهب النبي صلى الله عليه وسلم فتبعه رجل كان يسمع الكلام من رسول الله صلى الله عليه وسلم ومن صاحب النخلة فقال الرجل يا رسول الله إن أنا أخذت النخلة فصارت لي النخلة فأعطيتك إياها أتعطيني ما أعطيته بها نخلة في الجنة؟ قال \"نعم\" ثم إن الرجل لقي صاحب النخلة ولكلاهما نخل فقال له أخبرك أن محمدا أعطاني بنخلتي المائلة في دار فلان نخلة في الجنة فقلت له قد أعطيت ولكني يعجبني ثمرها فسكت عنه الرجل فقال له أراك إذا بعتها قال لا إلا أن أعطى بها شيئا ولا أظنني أعطاه قال وما مناك؟ قال أربعون نخلة فقال الرجل لقد جئت بأمر عظيم نخلتك تطلب بها أربعين نخلة؟ ثم سكتا وأنشأ في كلام آخر ثم قال أنا أعطيتك أربعين نخلة فقال أشهد لي إن كنت صادق فأمر بأناس فدعاهم فقال اشهدوا أني قد أعطيته من نخلي أربعين نخلة بنخلته التي فرعها في دار فلان بن فلان ثم قال ما تقول فقال صاحب النخلة قد رضيت ثم قال بعد ليس بيني وبينك بيع لم نفترق فقال له قد أقالك الله ولست بأحمق حين أعطيتك أربعين نخلة بنخلتك المائلة فقال صاحب النخلة قد رضيت على أن تعطيني الأربعين على ما أريد قال تعطنيها على ساق ثم مكث ساعة ثم قال هي لك على ساق وأوقف له شهودا وعد له أربعين نخلة على ساق فتفرقا فذهب الرجل إلى رسول الله صلى الله عليه وسلم فقال يا رسول الله إن النخلة المائلة في دار فلان قد صارت لي فهي لك فذهب رسول الله صلى الله عليه وسلم إلى الرجل صاحب الدار فقال له \"النخلة لك ولعيالك\" قال عكرمة قال ابن عباس فأنزل الله عز وجل \"والليل إذا يغشى - إلى قوله - فأما من أعطى واتقى وصدق بالحسنى فسنيسره لليسرى وأما من بخل واستغنى وكذب بالحسنى فسنيسره للعسرى\" إلى آخرالسورة هكذا رواه ابن أبي حاتم وهو حديث غريب جدا. قال ابن جرير وذكر أن هذه الآية نزلت في أبي بكر الصديق رضي الله عنه حدثنا هارون بن إدريس الأصم حدثنا عبدالرحمن بن محمد المحاربي حدثنا محمد بن إسحاق عن محمد بن عبدالله بن محمد بن عبدالرحمن بن أبي بكر الصديق رضي الله عنه عن عامر بن عبدالله بن الزبير قال كان أبو بكر رضي الله عنه يعتق على الإسلام بمكة فكان يعتق عجائز ونساء إذا أسلمن فقال له أبوه أي بني أراك تعتق أناسا ضعفاء فلو أنك تعتق رجالا جلداء يقومون معك ويمنعونك ويدفعون عنك فقال أي أبت إنما أريد - أظنه قال - ما عند الله قال فحدثني بعض أهل بيتي أن هذه الأية أنزلت فيه \"فأما من أعطى واتقى وصدق بالحسنى فسنيسره لليسرى."
    },
    {
      "ayah": 11,
      "surah": 92,
      "text": "وقوله تعالى \"وما يغني عنه ماله إذا تردى\" قال مجاهد: أي إذا مات وقال أبو صالح ومالك عن زيد بن أسلم إذا تردى في النار."
    },
    {
      "ayah": 12,
      "surah": 92,
      "text": "قال قتادة \"إن علينا للهدى\" أي نبين الحلال والحرام وقال غيره: من سلك طريق الهدى وصل إلى الله وجعله كقوله تعالى \"وعلى الله قصد السبيل\" حكاه ابن جرير."
    },
    { "ayah": 13, "surah": 92, "text": "قوله تعالى \"إن لنا للآخرة والأولى\" أي الجميع ملكنا وأنا المتصرف فيهما." },
    {
      "ayah": 14,
      "surah": 92,
      "text": "قوله تعالى \"فأنذرتكم نارا تلظى\" قال مجاهد أي توهج. قال الإمام أحمد حدثنا محمد بن جعفر حدثنا شعبة عن سماك بن حرب سمعت النعمان بن بشير يخطب يقول سمعت رسول الله صلى الله عليه وسلم يخطب يقول \"أنذرتكم النار\" حتى لو أن رجلا كان بالسوق لسمعه من مقامي هذا قال حتى وقعت خميصة كانت على عاتقه عند رجليه وقال الإمام أحمد حدثنا محمد بن جعفر حدثني شعبة حدثني أبو إسحاق سمعت النعمان بن بشير يخطب يقول سمعت رسول الله صلى الله عليه وسلم يقول \"إن أهون أهل النار عذابا يوم القيامة رجل توضع في أخمص قدميه جمرتان يغلي منهما دماغه\" رواه البخاري وقال مسلم حدثنا أبو بكر بن أبي شيبة حدثنا أبو أسامة عن الأعمش عن أبي إسحاق عن النعمان بن بشير قال: قال رسول الله صلى الله عليه وسلم\" إن أهون أهل النار عذابا من له نعلان وشراكان من نار يغلي منهما دماغه كما يغلي المرجل ما يرى أن أجدا أشد منه عذابا وإنه لأهونهم عذابا\"."
    },
    {
      "ayah": 15,
      "surah": 92,
      "text": "قوله تعالى \"لا يصلاها إلا الأشقى\" أي لا يدخلها دخولا يحيط به من جميع جوانبه إلا الأشقى."
    },
    {
      "ayah": 16,
      "surah": 92,
      "text": "قال \"الذي كذب\" أي بقلبه \"وتولى\" أي عن العمل بجوارحه وأركانه. قال الإمام أحمد حدثنا حسن بن موسى حدثنا ابن لهيعة حدثنا عبدالله بن سعيد المقبري عن أبي هريرة قال: قال رسول الله صلى الله عليه وسلم \"لا يدخل النار إلا شقي\" قيل ومن الشقي قال \"الذي لا يعمل بطاعة ولا يترك لله معصية\". وقال الإمام أحمد حدثنا يونس وشريح قالا حدثنا فليح عن هلال بن علي عن عطاء بن يسار عن أبي هريرة قال: قال رسول الله صلى الله عليه وسلم \"كل أمتي تدخل الجنة يوم القيامة إلا من أبي\" قالوا من يأبى يا رسول الله؟ قال \"من أطاعني دخل الجنة ومن عصاني فقد أبى\" ورواه البخاري عن محمد بن سنان عن فليح به."
    },
    { "ayah": 17, "surah": 92, "text": "قوله تعالى \"وسيجنبها الأتقى\" أي وسيزحزح عن النار التقي الأتقى." },
    {
      "ayah": 18,
      "surah": 92,
      "text": "قوله \"الذي يؤتى ماله يتزكى\" أي يصرف ماله في طاعة ربه ليزكي نفسه وماله وما وهبه الله من دين ودنيا."
    },
    {
      "ayah": 19,
      "surah": 92,
      "text": "\"وما لأحد عنده من نعمة تجزى\" أي ليس بذله ماله في مكافأة من أسدى إليه معروفا فهو يعطي في مقابلة ذلك وإنما دفعه ذلك."
    },
    { "ayah": 2, "surah": 92, "text": "أي بضيائه وإشراقه." },
    {
      "ayah": 20,
      "surah": 92,
      "text": "\"ابتغاء وجه ربه الأعلى\" أي طمعا في أن يحصل له رؤيته في الدار الآخرة في روضات الجنات."
    },
    {
      "ayah": 21,
      "surah": 92,
      "text": "قال الله تعالى \"ولسوف يرضي\" أي ولسوف يرضى من اتصف بهذه الصفات وقد ذكر غير واحد من المفسرين أن هذه الآيات نزلت في أبي بكر الصديق رضي الله عنه حتى إن بعضهم حكى الإجماع من المفسرين على ذلك ولا شك أنه داخل فيها وأولى الأمة بعمومها فإن لفظها لفظ العموم وهو قوله تعالى \"وسيجنبها الأتقى الذي يؤتى ماله يتزكى وما لأحد عنده من نعمة تجزى\" ولكنه مقدم الأمة وسابقهم في جميع هذه الأوصاف وسائر الأوصاف الحميدة فإنه كان صديقا تقيا كريما جوادا بذالا لأمواله في طاعة مولاه ونصرة رسول الله صلى الله عليه وسلم فكم من دراهم ودنانير بذلها ابتغاء وجه ربه الكريم ولم يكن لأحد من الناس عنده منة يحتاج إلى أن يكافئه بها ولكن كان فضله وإحسانه على السادات والرؤساء من سائر القبائل ولهذا قال له عروة بن مسعود وهو سيد ثقيف يوم صلح الحديبية أما والله لولا يد لك عندي لم أجزك بها لأجبتك وكان الصديق قد أغلظ له في المقاله فإذا كان هذا حاله مع سادات العرب ورؤساء القبائل فكيف بمن عداهم؟ ولهذا قال تعالى \"وما لأحمد عنده من نعمة تجزى إلا ابتغاء وجه ربه الأعلى ولسوف يرضى\". وفي الصحيحين أن رسول الله صلى الله عليه وسلم قال \"من أنفق زوجين في سبيل الله دعته خزنة الجنة يا عبدالله هذا خير\" فقال أبو بكر يا رسول الله ما على من يدعى منها ضرورة فهل يدعى منها كلها أحد؟ قال \"نعم وأرجو أن تكون منهم\" آخر تفسير سورة الليل ولله الحمد والمنة."
    },
    {
      "ayah": 3,
      "surah": 92,
      "text": "وهكذا قرأ ذلك ابن مسعود وأبو الدرداء ورفعه أبو الدرداء وأما الجمهور فقرءوا ذلك كما هو المثبت في المصحف الإمام العثماني في سائر الآفاق \"وما خلق الذكر والأنثى\" فأقسم تعالى بالليل إذا يغشى أي إذا غشي الخليقة بظلامه \"والنهار إذا تجلى\" أي بضيائه وإشراقه \"وما خلق الذكر والأنثى\" كقوله تعالى \"وخلقناكم أزواجا\" وكقوله \"ومن كل شيء خلقنا زوجين\" ولما كان القسم بهذه الأشياء المتضادة كان المقسم عليه أيضا متضادا."
    },
    {
      "ayah": 4,
      "surah": 92,
      "text": "قال تعالى \"إن سعيكم لشتى\" أي أعمال العباد التي اكتسبوها متضادة أيضا. ومتخالفة فمن فاعل خيرا ومن فاعل شرا."
    },
    { "ayah": 5, "surah": 92, "text": "\"فأما من أعطى واتقى\" أي أعطى ما أمر بإخراجه واتقى الله في أموره." },
    {
      "ayah": 6,
      "surah": 92,
      "text": "\"وصدق بالحسنى\" أي بالمجازاة على ذلك قاله قتادة وقال خصيف بالثواب وقال ابن عباس ومجاهد وعكرمة وأبو صالح وزيد بن أسلم \"وصدق بالحسنى\" أي بالخلف وقال أبو عبدالرحمن السلمي والضحاك \"وصدق بالحسنى\" أي بلا إله إلا الله وفي رواية عن عكرمة \"وصدق بالحسنى\" أي بما أنعم الله عليه وفي رواية زيد بن أسلم \"وصدق بالحسنى\" قال الصلاة والزكاة والصوم وقال مرة وصدقة الفطر وقال ابن أبي حاتم حدثنا أبو زرعة حدثنا صفوان بن صالح الدمشقي حدثنا الوليد بن مسلم حدثنا زهير بن محمد حدثني من سمع أبا العالية الرياحي يحدث عن أبي بن كعب قال: سألت رسول الله صلى الله عليه وسلم عن الحسنى: قال \"الحسنى الجنة\"."
    },
    {
      "ayah": 7,
      "surah": 92,
      "text": "قوله تعالى \"فسنيسره لليسرى\" قال ابن عباس يعني للخير وقال زيد بن أسلم يعني الجنة وقال بعض السلف من ثواب الحسنة بعدها. ومن جاء السيئة السيئة بعدها."
    },
    {
      "ayah": 8,
      "surah": 92,
      "text": "قال تعالى \"وأما من بخل\" أي بما عنده \"واستغنى\" قال عكرمة عن ابن عباس أي بخل بماله واستغنى عن ربه عز وجل."
    },
    { "ayah": 9, "surah": 92, "text": "\"وكذب بالحسنى\" أي بالجزاء في الدار الآخرة." }
  ]
}
