{
  "ayahs": [
    {
      "ayah": 1,
      "surah": 93,
      "text": "سورة الضحى: روينا من طريق أبي الحسن أحمد بن محمد بن عبدالله بن أبي بزة المقري قال: قرأت على عكرمة بن سليمان وأخبرني أنه قرأ على إسماعيل بن قسطنطين وشبل بن عباد فلما بلغت والضحى قالا لي كبر حتى تختم مع خاتمة كل سورة فإنا قرأنا على ابن كثير فأمرنا بذلك وأخبرنا أنه قرأ على مجاهد فأمره بذلك. وأخبره مجاهد أنه قرأ على ابن عباس فأمره بذلك وأخبره ابن عباس أنه قرأ على أبي بن كعب فأمره بذلك وأخبره أبي أنه قرأ على رسول الله فأمره بذلك فهذه سنة تفرد بها أبو الحسن أحمد بن محمد بن عبدالله البزي من ولد القاسم بن أبي بزة وكان إماما في القراءات. فأما في الحديث فقد ضعف أبو حاتم الرازي وقال لا أحدث عنه وكذلك أبو جعفر العقيلي قال هو منكر الحديث لكن حكى الشيخ شهاب الدين أبو شامة في شرح الشاطبية عن الشافعي أنه سمع رجلا يكبر هذا التكبير في الصلاة فقال: أحسنت وأصبت السنة وهذا يقتضي صحة هذا الحديث. ثم اختلف القراء في موضع هذا التكبير وكيفيته فقال بعضهم يكبر من آخر \"والليل إذا يغشى\" وقال آخرون من آخر والضحى وكيفية التكبير عند بعضهم أن يقول الله أكبر ويقتصر ومنهم من يقول الله أكبر لا إله إلا الله والله أكبر. وذكر القراء في مناسبة التكبير من أول سورة الضحى أنه لما تأخر الوحي عن رسول الله صلى الله عليه وسلم وفتر تلك المدة ثم جاءه الملك فأوحى إليه \"والضحى والليل إذا سجى\" السورة بتمامها كبر فرحا سرورا ولم يرو ذلك بإسناد يحكم عليه بصحة لا ضعف فالله أعلم. قال الإمام أحمد حدثنا أبو نعيم حدثنا سفيان عن الأسود بن قيس قال سمعت جندبا يقول: اشتكى النبي صلى الله عليه وسلم فلم يقم ليلة أو ليلتين فأت امرأة فقالت يا محمد ما أرى شطانك إلا قد تركك فأنزل الله عز وجل \"والضحى والليل إذا سجى ما ودعك ربك وما قلى\" رواه البخاري ومسلم والترمذي والنسائي وابن أبي حاتم وابن جرير من طرق عن الأسود بن قيس عن جندب هو ابن عبدالله البجلي ثم العلفي به وفي رواية سفيان بن عيينة عن الأسود بن قيس سمع جندبا قال: أبطأ جبريل على رسول الله صلى الله عليه وسلم فقال المشركون ودع محمدا ربه فأنزل الله تعالى \"والضحى والليل إذا سجى ما ودعك ربك وما قلى\"."
    },
    {
      "ayah": 10,
      "surah": 93,
      "text": "\"وأما السائل فلا تنهر\" أي وكما كنت ضالا فهداك الله فلا تنهر السائل في العلم المسترشد قال ابن إسحاق \"وأما السائل فلا تنهر\" أي فلا تكن جبارا ولا متكبرا ولا فحاشا ولا فظا على الضعفاء من عباد الله وقال قتادة يعني رد المسكين برحمة ولين."
    },
    {
      "ayah": 11,
      "surah": 93,
      "text": "\"وأما بنعمة ربك فحدث\" أي وكما كنت عائلا فقيرا فأغناك الله فحدث بنعمة الله عليك كما جاء في الدعاء المأثور النبوي \"واجعلنا شاكرين لنعمتك مثنين بها عليك قابليها وأتمها علينا\" قال ابن جرير حدثنا يعقوب حدثنا ابن علية حدثنا سعيد بن إياس الجريري عن أبي نضرة قال كان المسلمون يرون أن من شكر النعم أن يحدث بها. وقال عبدالله بن الإمام أحمد حدثنا منصور بن أبي مزاح حدثنا الجراح بن فليح عن أبي عبدالرحمن عن الشعبي عن النعمان بن بشير قال: قال رسول الله صلى الله عليه وسلم على المنبر \"من لم يشكر القليل لم يشكر الكثير ومن لم يشكر الناس لم يشكر الله والتحدث بنعمة الله شكر وتركها كفر والجماعة رحمة والفرقة عذاب\" وإسناده ضعيف وفي الصحيحين عن أنس أن المهاجرين قالوا يا رسول الله صلى الله عليه وسلم ذهب الأنصار بالأجر كله ال لا ما دعوتم الله لهم وأثنيتم عليهم\". وقال أبو داود حدثنا مسلم بن إبراهيم حدثنا البيع بن مسلم عن محمد بن زياد عن أبي هريرة عن النبي صلى الله عليه وسلم قال \"لا يشكر الله من لا يشكر الناس\" ورواه الترمذي عن أحمد بن محمد عن ابن المبارك عن الربيع بن مسلم وقال صحيح. وقال أبو داود حدثنا عبدالله بن الجراح حدثنا جرير عن الأعمش عن أبي سفيان عن جابر عن النبي صلى الله عليه وسلم قال \"من أبلى بلاء فذكره فقد شكره ومن كتمه فقد كفره\" تفرد به أبو داود. وقال أبو داود حدثنا مسدد حدثنا بشر حدثنا عمارة بن غزية حدثى رجل من قومي عن جابر بن عبدالله قال: قال رسول الله صلى الله عليه وسلم \"من أعطي عطاء فوجد فليجز به فإن لم يجد فليثن به فمن أثنى به فقد شكره ومن كتمه فقد كفره\" قال أبو داود: ورواه يحيى بن أيوب عن عمارة بن غزية عن شرحبيل عن جبر كرهوه فلم يسموه تفرد به أبو داود وقال مجاهد يعني النبوة التي أعطاك ربك وفي رواية عنه القرآن وقال ليث عن رجل عن الحسن بن علي \"وأما بنعمة ربك فحدث\" قال ما عملت من خير فحدث إخوانك وقال محمد بن إسحاق ما جاءك من الله من نعمة وكرامة من النبوة فحدث بها واذكرها وادع إليها قال فجعل رسول الله صلى الله عليه وسلم يذكر ما أنعم الله به عليه من النبوة سرا إلى من يطمئن إليه من أهله وافترضت عليه الصلاة فصلى. آخر تفسير سورة الضحى ولله الحمد والمنة."
    },
    {
      "ayah": 2,
      "surah": 93,
      "text": "وقال ابن ابي حاتم حدثنا أبو سعيد الأشج وعمرو بن عبدالله الأودي قالا حدثنا أبو أسامة حدثني سفيان حدثني الأوسد بن قيس أنه سمع جندبا يقول رمي رسول الله صلى الله عليه وسلم بحجر في أصبعه فقال: \"هل أنت إلا أصبع دميت وفي سبيل الله ما لقيت؟ \" قال فمكث ليلتين أو ثلاثا لا يقوم فقالت له امرأة ما أرى شيطانك إلا قد تركك فنزلت \"والضحى والليل إذا سجى ما ودعك ربك وما قلى\" والسياق لأبي سعيد قيل إن هذه المرأة هي أم جميل امرأة أبي لهب. وذكر أن أصبعيه عليه وسلم دميت وقوله هذا الكلام الذي اتفق أنه موزون ثابت في الصحيحين ولكن الغريب ههنا جعله سببا لتركه القيام ونزول هذه السورة. فأما ما رواه ابن جرير حدثنا ابن أبي الشوارب حدثنا عبدالواحد بن زياد حدثنا سليمان الشيباني عن عبدالله بن شداد أن خديجة قالت للنبي صلى الله عليه وسلم ما أرى بك إلا قد قلاك فأنزل الله \"والضحى والليل إذا سجى ما ودعك ربك وما قلى\" وقال أيضا حدثنا أبو كريب حدثنا وكيع عن هشام بن عروة عن أبيه قال: أبطأ جبريل على النبي صلى الله عليه وسلم فجزع جزعا شديدا فقالت خديجة إني أرى ربك قد قلاك مما نرى من جزعك قال فنزلت \"والضحى والليل إذا سجى ما ودعك ربك وما قلى\" إلى آخرها فإنه حديث مرسل من هذين الوجهين ولعل ذكر خديجة ليس محفوظ أو قالته على وجه التأسف والتحزن والله أعلم."
    },
    {
      "ayah": 3,
      "surah": 93,
      "text": "وقد ذكر بعض السلف منهم ابن إسحاق أن هذه السورة هي التي أوحاها جبريل إلى رسول الله صلى الله عليه وسلم حين تبدى له في صورته التى خلقه الله عليها ودنا إليه وتدلى منهبطا عليه وهو بالأبطح \"فأوحى إلى عبده ما أوحى\" قال: قال له هذه السورة \"والضحى والليل إذا سجى\" قال العوفي عن ابن عباس: لما نزل على رسول الله صلى الله عليه وسلم القرآن أبطأ عنه جبريل أياما فتغير بذلك فقال المشركون ودعه ربه وقلاه فأنزل الله \"ما ودعك ربك وما قلى\" وهذا قسم منه تعالى بالضحى وما جعل فيه من الضياء \"والليل إذا سجى\" أي سكن فأظلم وأدلهم قاله مجاهد وقتادة والضحاك وابن زيد وغيرهم وذلك دليل ظاهر على قدرة خالق هذا وهذا كما قال تعالى \"والليل إذا يغشى والنهار إذا تجلى \"وقال تعالى \"فالق الإصباح وجعل الليل سكنا والشمس والقمر حسبانا ذلك تقدير العزيز العليم\". وقوله تعالى \"ما ودعك ربك\" أي ما تركك \"وما قلى\" أي وما أبغضك."
    },
    {
      "ayah": 4,
      "surah": 93,
      "text": "\"وللآخرة خير لك من الأولى\" وللدار الآخرة خير لك من هذه الدار ولهذا كان رسول الله صلى الله عليه وسلم أزهد الناس في الدنيا وأعظمهم لها إطراحا كما هو معلوم بالضرورة من سيرته ولما خير\" عليه السلام في آخر عمره بين الخلد في الدنيا إلى آخرها ثم الجنة وبين الصيرورة إلى الله عز وجل اختار ما عند الله على هذه الدنيا الدنية قال الإمام أحمد حدثنا يزيد حدثنا المسعودي عن عمرو بن مرة عن إبراهيم النخعي عن علقمة عن عبدالله هو ابن مسعود قال: اضطجع رسول الله صلى الله عليه وسلم على حصير فأثر في جنبه فلما استيقظ جعلت أمسح جنبه وقلت يا رسول الله صلى الله عليه وسلم ألا آذنتنا حتى نبسط لك على الحصير شيئا فقال رسول الله صلى الله عليه وسلم \"ما لي وللدنيا إنما مثلي ومثل الدنيا كراكب ظل تحت شجرة ثم راح وتركها\" ورواه الترمذي وابن ماجه من حديث المسعودي به وقال الترمذي حسن صحيح."
    },
    {
      "ayah": 5,
      "surah": 93,
      "text": "وقوله تعالى \"ولسوف يعطيك ربك فترضى\" أي في الدار الآخرة يعطيه حتى يرضيه في أمته وفيما أعده له من الكرامة ومن جملته نهر الكوثر الذي حافتاه قباب اللؤلؤ المجوف وطينه مسك أذفر كما سيأتي. وقال الإمام أبو عمر الأوزاعي عن إسماعيل بن عبدالله بن أبي المهاجر المخزومي عن علي بن عبدالله بن عباس عن أبيه قال: عرض على رسول الله صلى الله عليه وسلم ما هو مفتوح على أمته من بعده كنزا كنزا سر بذلك فأنزل الله \"ولسوف يعطيك ربك فترضى\" فأعطاه في الجنة ألف ألف قصر في كل قصر ما ينبغي له من الأزواج والخدم رواه ابن جرير وابن أبي حاتم من طريقه وهذا إسناد صحيح إلى ابن عباس ومثل هذا ما يقال إلا عن توقيف وقال السدي عن ابن عباس من رضاء محمد صلى الله عليه وسلم أن لا يدخل أحد من أهل بيته النار رواه ابن جرير وابن أبي حاتم وقال الحسن يعني بذلك الشفاعة وهكذا قال أبو جعفر الباقر وقال أبو بكر بن أبي شيبة حدثنا معاوية بن هشام عن علي بن صالح عن يزيد بن أبي زياد عن إبراهيم عن علقمة عن عبدالله قال: قال رسول الله صلى الله عليه وسلم \"إنا أهل بيت اختار الله لنا الآخرة على الدنيا ولسوف يعطيك ربك فترضى\"."
    },
    {
      "ayah": 6,
      "surah": 93,
      "text": "\"ألم جدك يتيما فآوى\" وذلك أن أباه توفي وهو حمل في بطن أمه وقيل بعد أن ولد عليه السلام ثم توفيت أمه آمنة بنت وهب وله من العمر ست سنين ثم كان في كفالة جده عبدالمطلب إلى أن توفي وله من العمر ثمان سنين كفله عمه أبو طالب ثم لم يزل يحوطه وينصره ويرفع من قدره ويوقره ويكف عنه أذى قومه بعد أن ابتعثه الله على رأس أربعين سنة من عمره هذا وأبو طالب على دين قومه من عبادة الأوثان وكل ذلك بقدر الله وحسن تدبيره إلى أن توفي أبو طالب قبل الهجرة بقليل فأقدم عليه سفهاء قريش وجهالهم فاختار الله له الهجرة من بي أظهرهم إلى بلد الأنصار من الأوس والخزرج كما أجرى الله سنته على الوجه الأتم الأكمل فلما وصل إليهم آووه ونصروه وحاطوه وقاتلوا بين يديه رضي الله عنهم أجمعين وكل هذا من حفظ الله له وكلاءته وعنايته به."
    },
    {
      "ayah": 7,
      "surah": 93,
      "text": "وقوله تعالى \"ووجدك ضالا فهدى\" كقوله \"وكذلك أوحينا إليك روحا من أمرك ما كنت تدري ما الكتاب ولا الإيمان ولكن جعلناه نورا نهدي به من نشاء من عبادنا\" الآية ومنهم من قال إن المراد بهذا أن النبي صلى الله عليه وسلم ضل في شعاب مكة وهو صغير ثم رجع وقيل إنه ضل وهو مع عمه في طريق الشام وكان راكبا ناقة في الليل فجاء إبليس فعدل بها عن الطريق فجاء جبرئيل فنفخ إبليس نفخة ذهب منها إلى الحبشة ثم عدل بالراحلة إلى الطريق حكاهما البغوى."
    },
    {
      "ayah": 8,
      "surah": 93,
      "text": "وقوله تعالى \"ووجدك عائلا فأغنى\" أي كنت فقيرا ذا عيال فأغناك الله عمن سواه فجمع له بين مقامي الفقير الصابر والغني الشاكر صلى الله عليه وسلم وقال قتادة في قوله \"ألم يجدك يتيما فآوى ووجدك ضالا فهدى ووجدك عائلا فأغنى\" قال كانت هذه منازل رسول الله صلى الله عليه وسلم قبل أن يبعثه الله عز وجل. رواه ابن جرير وابن أبي حاتم وفي الصحيحين من طريق عبدالرزاق عن معمر عن همام بن منبه قال هذا ما حدثنا أبو هريرة قال: قال رسول الله صلى الله عليه وسلم \"ليس الغنى عن كثرة العرض ولكن الغنى غنى النفس\" وفي صحيح مسلم عن عبدالله بن عمرو قال: قال رسول الله صلى الله عليه وسلم \"قد أفلح من أسلم ورزق كفافا وقنعه الله بما آتاه\"."
    },
    {
      "ayah": 9,
      "surah": 93,
      "text": "ثم قال تعالى \"فأما اليتيم فلا تقهر\" أي كما كنت يتيما فآواك الله فلا تقهر اليتيم أي لا تذله وتنهره وتهنه ولكن أحسن إليه وتلطف به قال قتادة كن لليتيم كالأب الرحيم."
    }
  ]
}
