{
  "ayahs": [
    {
      "ayah": 1,
      "surah": 94,
      "text": "يقول تعالى \"ألم نشرح لك صدرك\" يعني أما شرحنا لك صدرك أي نورناه وجعلناه فسيحا رحيبا واسعا كقوله \"فمن يرد الله أن يهديه يشرح صدره للإسلام\" وكما شرح الله صدره كذلك جعل شرعه فسيحا واسعا سهلا لا حرج فيه ولا إصر ولا ضيق. وقيل المراد بقوله \"ألم نشرح لك صدرك\" شرح صدره ليلة الإسراء كما تقدم من رواية مالك بن صعصعه وقد أورده الترمذي ههنا وهذا إن كان واقعا ليلة الإسراء كما رواه مالك بن صعصعة ولكن لا منافاة فإن من جملة شرح صدره الذي فعل بصدره ليلة الإسراء وما نشأ عنه من الشرح المعنوي أيضا فالله أعلم. قال عبدالله بن الإمام أحمد حدثني محمد بن عبدالرحيم أبو يحيى الفزاز حدثنا يونس بن محمد حدثنا معاذ ابن محمد بن أبي بن كعب حدثني أبو محمد بن معاذ عن محمد عن أبي بن كعب أن أبا هريرة كان جريئا على أن يسأل رسول الله صلى الله عليه وسلم عن أشياء لا يسأله عنها غيره فقال يا رسول الله صلى الله عليه وسلم صلى الله عليه وسلم ما أول ما رأيت من أمر النبوة؟ فاستوى رسول الله صلى الله عليه وسلم جالسا وقال \"لقد سألت يا أبا هريرة إني في الصحراء ابن عشر سنين وأشهر وإذا بكلام فوق رأسي وإذا رجل يقول لرجل أهو هو؟ فاستقبلاني بوجوه لم أرها قط وأرواح لم أجدها من خلق قط وثياب لم أرها على أحد قط فأقبلا إلي يمشيان حتى أخذ كل واحد منهما بعضدي لا أجد لأحدهما مسا فقال أحدهما لصاحبه أضجعه فأضجعاني بلا قصر ولا هصر فقال أحدهما لصاحبه افلق صدره فهوى أحدهما إلى صدري ففلقه فيما أرى بلا دم ولا وجع فقال له أخرج الغل والحسد فأخرج شيئا كهيئة العلقة ثم نبذها فطرحها فقال له أدخل الرأفة والرحمة فإذا مثل الذي أخرج شبه الفضة ثم هز إبهام رجلي اليمنى فقال أعد واسلم فرجعت بها أعدو رقة على الصغير ورحمة للكبير\"."
    },
    { "ayah": 2, "surah": 94, "text": "بمعنى \"ليغفر لك الله ما تقدم من ذنبك وما تأخر\"." },
    {
      "ayah": 3,
      "surah": 94,
      "text": "الإنقاض الصوت وقال غير واحد من السلف في قوله \"الذي أنقض ظهرك\" أي أثقلك حمله."
    },
    {
      "ayah": 4,
      "surah": 94,
      "text": "قال مجاهد لا أذكر إلا ذكرت معي أشهد أن لا إله إلا الله وأشهد أن محمدا رسول الله وقال قتادة رفع الله ذكره في الدنيا والآخرة فليس خطيب ولا متشهد ولا صاحب صلاة إلا ينادي بها أشهد أن لا إله إلا الله وأن محمدا رسول الله صلى الله عليه وسلم وقال ابن جرير حدثني يونس أخبرنا ابن وهب أخبرنا عمرو بن الحارث عن دراج عن أبي الهيثم عن أبي سعيد عن رسول الله صلى الله عليه وسلم أنه قال \"أتاني جبريل فقال إن ربي وربك يقول كيف رفعت ذكرك؟ قال الله أعلم قال إذا ذكرت ذكرت معي\" وكذا رواه ابن أبي حاتم عن يونس عن عبد الأعلى به ورواه أبو يعلى من طريق ابن لهيعة عن دراج وقال ابن أبي حاتم حدثنا زرعة حدثنا أبو عمر الحوضي حدثنا حماد بن زيد حدثنا عطاء بن السائب عن سعيد بن جبير عن ابن عباس قال: قال رسول الله صلى الله عليه وسلم \"سألت ربي مسألة وددت أنى لم أسأله قلت قد كان قبلي أنبياء منهم من سخرت له الريح ومنهم من يحيى الموتى قال: يا محمد ألم أجدك يتيما فآويتك؟ ألم أرفع لك ذكرك؟ قلت بلى يا رب\" وقال أبو نعيم في دلائل النبوة حدثنا أبو أحمد الغطريفي حدثنا موسى بن سهل الجويني حدثنا أحمد بن القاسم بن بهزان الهيتي حدثنا نصر بن حماد عن عثمان بن عطاء عن الزهري عن أنس قال قال رسول الله صلى الله عليه وسلم \"لما فرغت مما أمرني به من أمر السموات والأرض قلت يا رب إنه لم يكن نبي قبلي إلا وقد كرمته جعلت إبراهيم خليلا وموسى كليما وسخرت لداود الجبال ولسليمان الريح والشياطين وأحييت لعيسى الموتى فما جعلت لي؟ قال أو ليس قد أعطيتك ظاهر أفضل من ذلك كله؟ إني لا أذكر إلا ذكرت معي وجعلت صدور أمتك أناجيل يقرءون القرآن ظاهرا ولم أعطها أمة وأعطيتك كنزا من كنوز عرشي لا حول ولا قوة إلا بالله العلي العظيم\" وحكى البغوي عن ابن عباس ومجاهد أن المراد بذلك الأذان يعني ذكره فيه وأورد من شعر حسان بن ثابت. أغر عليه للنبوة خاتم من الله من نور يلوح ويشهد وضم الإله اسم النبي إلى اسمه إذا قال في الخمس المؤذن أشهد وشق له من اسمه ليجله فذو العرش محمود وهذا محمد وقال آخرون: رفع الله ذكره في الأولين والآخرين ونوه به حين أخذ ميثاق على النبيين أن يؤمنوا به وأن يأمروا أممهم بالإيمان به ثم شهر ذكره فى أمته فلا يذكر الله إلا ذكر معه وما أحسن ما قال الصرصري رحمه الله: لا يصح الأذان في الفرض إلا باسمه العذب في الفم المرصي وقال أيضا: ألم تر أنا لا يصح أذاننا ولا فرضنا إن لم نكرره فيهما."
    },
    {
      "ayah": 5,
      "surah": 94,
      "text": "وقوله تعالى \"فإن مع العسر يسرا إن مع العسر يسرا\" أخبر تعالى أن مع العسر يوجد اليسر ثم أكد هذا الخبر. قال ابن أبي حاتم حدثنا أبو زرعة حدثنا محمود بن غيلان حدثنا حميد بن حماد بن أبي خوار أبو الجهم حدثنا عائذ بن شريح قال سمعت أنس بن مالك يقول: كان النبي صلى الله عليه وسلم جالسا وحياله حجر فقال \" لو جاء العسر فدخل هذا الحجر لجاء اليسر حتى يدخل عليه فيخرجه\" فأنزل الله عز وجل \"فإن مع العسر يسرا إن مع العسر يسرا\" ورواه أبو بكر البزار في مسنده عن محمد بن معمر عن حميد بن حماد به ولفظه \"لو جاء العسر حتى يدخل هذا الحجر لجاء اليسر حتى يخرجه ثم قال \"فإن مع العسر يسرا إن مع العسر يسرا\" ثم قال البزار لا نعلم رواه عن أنس إلا عائذ بن شريح \"قلت\" وقد قال فيه أبو حاتم الرازي فى حديثه ضعف ولكن رواه شعبة عن معاوية بن قرة عن رجل عن عبدالله بن مسعود موقوفا وقال ابن أبي حاتم حدثنا الحسن بن محمد بن الصباح حدثنا أبو قطن حدثنا المبارك بن فضالة عن الحسن قال كانوا يقولون لا يغلب عسر واحد يسرين اثنين. وقال ابن جرير حدثنا ابن عبدالأعلى حدثنا ابن ثور عن معمر عن الحسن قال: خرج النبي صلى الله عليه وسلم يوما مسرورا فرحا وهو يضحك وهو يقول \"لن يغلب عسر يسرين لن يغلب عسر يسرين \"فإن مع العسر يسرا إن مع العسر يسرا\" وكذا رواه من حديث عوف الأعرابي ويونس بن عبيد عن الحسن مرسلا وقال سعيد عن قتادة ذكر لنا أن رسول الله صلى الله عليه وسلم بشر أصحابه بهذه الآية. فقال \"لن يغلب عسر يسرين\" ومعنى هذا أن العسر معرف في الحالين فهو مفرد واليسر منكر فتعدد ولهذا قال \"لن يغلب عسر يسرين\" يعني قوله \"فإن مع العسر يسرا إن مع العسر يسرا\" فالعسر الأول عين الثاني واليسر تعدد. وقال الحسن بن سفيان حدثنا يزيد بن صالح حدثنا خارجة عن عباد بن كثير عن أبي الزناد عن أبي صالح عن أبي هريرة أن رسول الله صلى الله عليه وسلم قال \"أنزل المعونة من السماء على قدر المؤنة ونزل الصبر عل قدر المصيبة\" ومما يروى عن الشافعي أنه قال: صبرا جميلا ما أقرب الفرجا من راقب الله في الأمور نجا من صدق الله لم ينله أذى ومن رجاه يكون حيث رجا وقال ابن دريد أنشدني أبو حاتم السجستاني: إذا اشتملت على اليأس القلوب وضاق لما به الصدر الرحيب وأوطأت المكاره واطمأنت وأرست في أماكنها الخطوب ولم تر لانكشاف الضر وجها ولا أغنى بحيلته الأريب أتاك على قنوط منك غوث يمن به اللطيف المستجيب وكل الحادثات إذا تناهت فموصول بها الفرج القريب وقال آخر ولرب نازلة يضيق بها الفتى ذرعا وعند الله منها المخرج كملت فلما استحكمت حلقاتها فرجت وكان يظنها لا تفرج."
    },
    {
      "ayah": 6,
      "surah": 94,
      "text": "إن مع العسر يسراوقوله تعالى \" فإن مع العسر يسرا إن مع العسر يسرا \" أخبر تعالى أن مع العسر يوجد اليسر ثم أكد هذا الخبر . قال ابن أبي حاتم حدثنا أبو زرعة حدثنا محمود بن غيلان حدثنا حميد بن حماد بن أبي خوار أبو الجهم حدثنا عائذ بن شريح قال سمعت أنس بن مالك يقول : كان النبي صلى الله عليه وسلم جالسا وحياله حجر فقال \" لو جاء العسر فدخل هذا الحجر لجاء اليسر حتى يدخل عليه فيخرجه \" فأنزل الله عز وجل \" فإن مع العسر يسرا إن مع العسر يسرا\" ورواه أبو بكر البزار في مسنده عن محمد بن معمر عن حميد بن حماد به ولفظه \" لو جاء العسر حتى يدخل هذا الحجر لجاء اليسر حتى يخرجه ثم قال \" فإن مع العسر يسرا إن مع العسر يسرا\" ثم قال البزار لا نعلم رواه عن أنس إلا عائذ بن شريح \" قلت \" وقد قال فيه أبو حاتم الرازي في حديثه ضعف ولكن رواه شعبة عن معاوية بن قرة عن رجل عن عبد الله بن مسعود موقوفا وقال ابن أبي حاتم حدثنا الحسن بن محمد بن الصباح حدثنا أبو قطن حدثنا المبارك بن فضالة عن الحسن قال كانوا يقولون لا يغلب عسر واحد يسرين اثنين. وقال ابن جرير حدثنا ابن عبد الأعلى حدثنا ابن ثور عن معمر عن الحسن قال : خرج النبي صلى الله عليه وسلم يوما مسرورا فرحا وهو يضحك وهو يقول \" لن يغلب عسر يسرين لن يغلب عسر يسرين\" فإن مع العسر يسرا إن مع العسر يسرا \" وكذا رواه من حديث عوف الأعرابي ويونس بن عبيد عن الحسن مرسلا وقال سعيد عن قتادة ذكر لنا أن رسول الله صلى الله عليه وسلم بشر أصحابه بهذه الآية . فقال \" لن يغلب عسر يسرين \" ومعنى هذا أن العسر معرف في الحالين فهو مفرد واليسر منكر فتعدد ولهذا قال \" لن يغلب عسر يسرين\" يعني قوله \" فإن مع العسر يسرا إن مع العسر يسرا \" فالعسر الأول عين الثاني واليسر تعدد. وقال الحسن بن سفيان حدثنا يزيد بن صالح حدثنا خارجة عن عباد بن كثير عن أبي الزناد عن أبي صالح عن أبي هريرة أن رسول الله صلى الله عليه وسلم قال \" أنزل المعونة من السماء على قدر المؤنة ونزل الصبر على قدر المصيبة \" ومما يروى عن الشافعي أنه قال : صبرا جميلا ما أقرب الفرجا من راقب الله في الأمور نجا من صدق الله لم ينله أذى ومن رجاه يكون حيث رجا وقال ابن دريد أنشدني أبو حاتم السجستاني : إذا اشتملت على اليأس القلوب وضاق لما به الصدر الرحيب وأوطأت المكاره واطمأنت وأرست في أماكنها الخطوب ولم تر لانكشاف الضر وجها ولا أغنى بحيلته الأريب أتاك على قنوط منك غوث يمن به اللطيف المستجيب وكل الحادثات إذا تناهت فموصول بها الفرج القريب وقال آخر ولرب نازلة يضيق بها الفتى ذرعا وعند الله منها المخرج كملت فلما استحكمت حلقاتها فرجت وكان يظنها لا تفرج ."
    },
    {
      "ayah": 7,
      "surah": 94,
      "text": "وقوله تعالى \"فإذا فرغت فانصب وإلى ربك فارغب\" أي إذا فرغت من أمور الدنيا وأشغالها وقطعت علائقها فانصب إلى العبادة وقم إليها نشيطا فارغ البال وأخلص لربك النية والرغبة ومن هذا القبيل قوله صلى الله عليه وسلم في الحديث المتفق على صحته \"لا صلاة بحضرة طعام ولا وهو يدافعه الأخبثان\" وقوله صلى الله عليه وسلم \"إذا أقيمت الصلاة وحضر العشاء فابدءوا بالعشاء\" قال مجاهد في هذه الآية إذا فرغت من أمر الدنيا فقمت إلى الصلاة فانصب لربك وفي رواية عنه إذا قمت إلى الصلاة فانصب في حاجتك وعن ابن مسعود إذا فرغت من الفرائض فانصب في قيام الليل. وعن ابن عياض نحوه وفي رواية عن ابن مسعود \"فانصب وإلى ربك فارغب\" بعد فراغك من الصلاة وأنت جالس وقال علي بن أبي طلحة عن ابن عباس فإذا فرغت فانصب يعني في الدعاء وقال زيد بن أسلم والضحاك \"فإذا فرغت\" أي من الجهاد \"فانصب\" أي في العبادة."
    },
    {
      "ayah": 8,
      "surah": 94,
      "text": "قال الثوري اجعل نيتك ورغبتك إلى الله عز وجل. آخر تفسير سورة ألم نشرح ولله الحمد والمنة."
    }
  ]
}
