{
  "ayahs": [
    {
      "ayah": 1,
      "surah": 95,
      "text": "سورة التين: قال مالك وشعبة عن عدي بن ثابت عن البراء بن عازب: كان النبي صلى الله عليه وسلم يقرأ في سفره في إحدى الركعتين بالتين والزيتون فما سمعت أحدا أحسن صوتا أو قراءة منه أخرج الجماعة في كتبهم. اختلف المفسرون ههنا على أقوال كثيرة فقيل المراد بالتين مسجد دمشق وقيل هي نفسها وقيل الجبل الذي عندها وقال القرطبي هو مسجد أصحاب الكهف وروى العوفي عن ابن عباس أنه مسجد نوح الذي على الجودي وقال مجاهد هو تينكم هذا \"والزيتون\" قال كعب الأحبار وقتادة وابن زيد وغيرهم هو مسجد بيت المقدس وقال مجاهد وعكرمة هو هذا الزيتون الذي تعصرون."
    },
    { "ayah": 2, "surah": 95, "text": "قال كعب الأحبار وغير واحد هو الجبل الذي كلم الله عليه موسى عليه السلام." },
    {
      "ayah": 3,
      "surah": 95,
      "text": "يعني مكة قاله ابن عباس ومجاهد وعكرمة والحسن وإبراهيم النخعي وابن زيد وكعب الأحبار ولا خلاف في ذلك. وقال بعض الأئمة هذه محال ثلاثة بعث الله في كل واحد منها نبيا مرسلا من أولي العزم أصحاب الشرائع الكبار \"فالأول\" محلة التين والزيتون وهي بيت المقدس التي بعث الله فيها عيسى ابن مريم عليه السلام \"والثاني\" طور سنين وهو طور سيناء الذي كلم الله عليه موسى بن عمران \"والثالث\" مكة وهو البلد الأمين الذي من دخله كان آمنا وهو الذي أرسل فيه محمدا صلى الله عليه وسلم قالوا وفي آخر التوراة ذكر هذه الأماكن الثلاثة: جاء الله من طور سيناء - يعني الذي كلم الله عليه موسى بن عمران - وأشرق من ساعير - يعني بيت المقدس الذي بعث الله منه عيسى - واستعلن من جبال فاران - يعني جبال مكة التي أرسل الله منها محمدا صلى الله عليه وسلم فذكرهم مخبرا عنهم على الترتيب الوجودي بحسب ترتيبهم الزمان ولهذا أقسم بالأشرف ثم الأشرف منه ثم بالأشرف منهما."
    },
    {
      "ayah": 4,
      "surah": 95,
      "text": "هذا هو المقسم عليه وهو أنه تعالى خلق الإنسان في أحسن صورة وشكل منتصب القامة سوى الأعضاء حسنها."
    },
    {
      "ayah": 5,
      "surah": 95,
      "text": "أي إلى النار قاله مجاهد وأبو العالي والحسن وابن زيد وغيرهم ثم بعد هذا الحسن والنضارة مصيرهم إلى النار إن لم يطع الله ويتبع الرسل. وقال بعضهم \" ثم رددناه أسفل سافلين \"أي إلى أرذل العمر روي هذا عن ابن عباس وعكرمة وحتى قال عكرمة من جمع القرآن لم يرد إلى أرذل العمر واختار ذلك ابن جرير ولو كان هذا هو المراد لما حسن استثناء المؤمنين من ذلك لأن الهرم قد يصيب بعضهم وإنما المراد ما ذكرناه كقوله تعالى \"والعصر إن الإنسان لفي خسر إلا الذين آمنوا وعملوا الصالحات\"."
    },
    {
      "ayah": 6,
      "surah": 95,
      "text": "\"إلا الذين آمنوا وعملوا الصالحات\" فاستثنى من جنس الإنسان عن الخسران الذين آمنوا بقلوبهم وعملوا الصالحات بجوارحهم \"فلهم أجر غير ممنون\" أي غير مقطوع."
    },
    {
      "ayah": 7,
      "surah": 95,
      "text": "وقوله تعالى\"فما يكذبك\"أي يا ابن آدم \"بعد بالدين\" أي بالجزاء في المعاد ولقد علمت البداءة وعرفت أن من قدر على البداءة فهو قادر على الرجعة بطريق الأولى فأي شئ يحملك على التكذيب بالمعاد وقد عرفت هذا؟ قال ابن أبي حاتم حدثنا أحمد بن سنان حدثنا عبدالرحمن عن سفيان عن منصور قال: قلت لمجاهد \"فما يكذبك بعد بالدين\" عني به النبي صلى الله عليه وسلم؟ قال: معاذ الله عني به الإنسان وهكذا قال عكرمة وغيره."
    },
    {
      "ayah": 8,
      "surah": 95,
      "text": "\" أي أما هو أحكم الحاكمين الذي لا يجور ولا يظلم أحدا ومن عدله أن يقيم القيامة فينتصف للمظلوم في الدنيا ممن ظلمه. وقد قدمنا في حديث أبي هريرة مرفوعا \"فإذا قرأ أحدكم والتين والزيتون فأتى على آخرها \"أليس الله بأحكم الحاكمين\" فليقل: بلى وأنا على ذلك من الشاهدين\". آخر تفسير سورة التين والزيتون ولله الحمد والمنة."
    }
  ]
}
