{
  "ayahs": [
    {
      "ayah": 1,
      "surah": 96,
      "text": "قال الإمام أحمد حدثنا عبدالرزاق حدثنا معمر عن الزهري عن عروة عن عائشة قالت: أول ما بدئ به رسول الله صلى الله عليه وسلم من الوحي الرؤيا الصادقة في النوم فكان لا يرى رؤيا إلا جاءت مثل فلق الصبح ثم حبب إليه الخلاء فكان يأتي حراء فيتحنث فيه - وهو التعبد - الليالي ذوات العدد ويتزود لذلك ثم يرجع إلى خديجة فيتزود لمثلها حتى فجأه الوحي وهو في غار حراء فجاءه الملك فيه فقال اقرأ قال رسول الله صلى الله عليه وسلم \"فقلت ما أنا بقاريء - قال - فأخذني فغطنى حتى بلغ مني الجهد ثم أرسلني فقال اقرأ فقلت ما أنا بقارئ فغطني الثانية حتى بلغ مني الجهد ثم أرسلني فقال اقرأ فقلت ما أنا بقارئ فغطني الثالثة حتى بلغ مني الجهد ثم أرسلني فقال \"اقرأ باسم ربك الذي خلق - حتى بلغ - ما لم يعلم\" قال فرجع بها ترجف بوادره حتى دخل على خديجة فقال \"زملوني زملونى\" فزملوه حتى ذهب عنه الروع فقال يا خديجة \"مالي؟\" وأخبرها الخبر وقال \"قد خشيت على نفسي\" فقالت له كلا أبشر فوالله لا يخزيك الله أبدا إنك لتصل الرحم وتصدق الحديث وتحمل الكل وتقري الضيف وتعين على نوائب الحق ثم انطلقت به خديجة حتى أتت به ورقة بن نوفل بن أسد بن عبدالعزى بن قصي وهو ابن عم خديجة أخي أبيها وكان امرأ قد تنصر في الجاهلية وكان يكتب الكتاب العربي وكتب بالعربية من الإنجيل ما شاء الله أن يكتب وكان شيخ كبيرا قد عمي فقالت خديجة أي ابن عم اسمع من ابن أخيك فقال ورقة ابن أخي ما ترى؟ فأخبره رسول الله صلى الله عليه وسلم بما رأى فقال ورقة هذا الناموس الذي أنزل على موسى ليتنى فيها جذعا ليتني أكون حيا حين يخرجك قومك فقال رسول الله صلى الله عليه وسلم \"أو مخرجي هم؟\" فقال ورقة: نعم لم يأت رجل قط بما جئت به إلا عودي وإن يدركني يومك أنصرك نصرا مؤزرا. ثم لم ينشب ورقة أن توفي وفتر الوحي فترة حتى حزن رسول الله صلى الله عليه وسلم فيما بلغنا حزنا غدا منه مرارا كي يتردى من رءوس شواهق الجبال فكلما أوفى بذروة جبل لكي يلقى نفسه منه تبدى له جبريل فقال يا محمد إنك رسول الله حقا فيسكن بذلك جأشه وتقر نفسه فيرجع فإذا طالت عليه فترة الوحي غدا لمثل ذلك فإذا أوفى بذروة الجبل تبدى له جبريل فقال له مثل ذلك. وهذا الحديث مخرج في الصحيحين من حديث الزهري وقد تكلمنا على هذا الحديث من جهة سنده ومتنه ومعانيه في أول شرحنا للبخاري مستقصى فمن أراده فهو هناك محرر ولله الحمد والمنة فأول شيء نزل من القرآن هذه الآيات الكريمات المباركات وهن أول رحمة رحم الله بها العباد وأول نعمة أنعم الله بها عليهم."
    },
    {
      "ayah": 10,
      "surah": 96,
      "text": "نزلت في أبي جهل لعنه الله توعد النبي صلى الله عليه وسلم على الصلاة عند البيت فوعظه تعالى بالتي هي أحسن أولا."
    },
    { "ayah": 11, "surah": 96, "text": "أي فما ظنك إن كان هذا الذي تنهاه على الطريق المستقيمة في فعله." },
    { "ayah": 12, "surah": 96, "text": "بقوله وأنت تزجره وتتوعده على صلاته." },
    { "ayah": 13, "surah": 96, "text": "لا يوجد تفسير لهذه الأية" },
    {
      "ayah": 14,
      "surah": 96,
      "text": "ولهذا قال \"ألم يعلم بأن الله يرى\" أي أما علم هذا الناهي لهذا المهتدي أن الله يراه ويسمع كلامه وسيجازيه على فعله أتم الجزاء."
    },
    {
      "ayah": 15,
      "surah": 96,
      "text": "ثم قال تعالى متوعدا ومتهددا \"كلا لئن لم ينته\" أي لئن لم يرجع عما هو فيه من الشقاق والعناد \"لنسفعا بالناصية\" أي لنسمنها سوادا يوم القيامة."
    },
    {
      "ayah": 16,
      "surah": 96,
      "text": "ثم قال \"ناصية كاذبة خاطئة\" يعني ناصية أبي جهل كاذبة في مقالها خاطئة في أفعالها."
    },
    { "ayah": 17, "surah": 96, "text": "\"فليدع ناديه\" أي قومه وعشيرته أي ليدعهم يستنصر بهم." },
    {
      "ayah": 18,
      "surah": 96,
      "text": "\"سندع الزبانية\" وهم ملائكة العذاب حتى يعلم من يغلب أحزبنا أو حزبه؟ قال البخاري حدثنا يحيى حدثنا عبدالرزاق عن معمر عن عبدالكريم الجزري عن عكرمة عن ابن عباس قال: قال أبو جهل لئن رأيت محمدا يصلي عند الكعبة لأطأن على عنقه فبلغ النبي صلى الله عليه وسلم فقال \"لئن فعل لأخذته الملائكة\" ثم قال تابعه عمرو بن خالد عن عبيدالله يعني ابن عمرو عن عبدالكريم. وكذا رواه الترمذي والنسائي في تفسيرهما من طريق عبدالرزاق به وهكذا رواه ابن جرير عن أبي كريب عن زكريا بن عدي عن عبيدالله بن عمرو به. وروى أحمد والترمذي والنسائي وابن جرير وهذا لفظه من طريق داود بن أبي هند عن عكرمة عن ابن عباس قال: كان رسول الله صلى الله عليه وسلم يصلي عند المقام فمر به أبو جهل بن هشام فقال يا محمد ألم أنهك عن هذا؟ وتوعده فأغلظ له رسول الله صلى الله عليه وسلم وانتهره فقال يا محمد بأي شيء تهددني؟ أما والله إنى لأكثر هذا الوادي ناديا فأنزل الله \"فليدع ناديه سندع الزبانية\" وقال ابن عباس: لو دعا ناديه لأخذته ملائكة العذاب من ساعته وقال الترمذي حسن صحيح. وقال الإمام أحمد أيضا حدثنا إسماعيل بن يزيد أبو يزيد حدثنا فرات عن عبدالكريم عن عكرمة عن ابن عباس قال: قال أبو جهل لئن رأيت رسول الله يصلي عند الكعبة لآتينه حتى أطأ على عنقه قال: فقال \"لو فعل لأخذته الملائكة عيانا ولو أن اليهود تمنوا الموت لماتوا ورأوا مقاعدهم من النار ولو خرح الذين يباهلون رسول الله صلى الله عليه وسلم لرجعوا لا يجدون مالا ولا أهلا\". وقال ابن جرير أيضا حدثنا ابن حميد حدثنا يحيى بن واضح أخبرنا يونس بن أبي إسحاق عن الوليد بن العيزار عن ابن عباس قال: قال أبو جهل لئن عاد محمد يصلى عند المقام لأقتلنه فأنزل الله عز وجل \"اقرأ باسم ربك الذي خلق\" حتى بلغ هذه الآية \"لنسفعا بالناصية ناصية كاذبة خاطئة فليدع ناديه سندع الزبانيه\" فجاء النبي صلى الله عليه وسلم فصلى فقيل ما يمنعك؟ قال قد اسود ما بيني وبينه من الكتائب قال ابن عباس والله لو تحرك لأخذته الملائكة والناس ينظرون إليه. وقال ابن جرير حدثنا ابن عبدالأعلى حدثنا المعتمر عن أبيه حدثنا نعيم بن أبي هند عن أبي حازم عن أبي هريرة قال: قال أبو جهل هل يعفر محمد وجهه بين أظهركم؟ قالوا نعم قال: فقال واللات والعزى لئن رأيته يصلي كذلك لأطأن على رقبته ولأعفرن وجهه في التراب فأتى رسول الله صلى الله عليه وسلم وهو يصلي ليطأ عل رقبته قال فما فجأهم منه إلا وهو ينكص على عقبيه ويتقي بيديه قال: فقيل له مالك؟ فقال إن بيني وبينه خندقا من نار وهولا وأجنحة قال: فقال رسول الله صلى الله عليه وسلم \"لو دنا مني لاختطفته الملائكة عضوا عضوا\" قال وأنزل الله لا أدري في حديث أبي هريرة أم لا \"كلا إن الإنسان ليطغى\" إلى آخر السورة وقد رواه أحمد بن حنبل ومسلم والنسائي وابن أبي حاتم من حديث معتمر بن سليمان به."
    },
    {
      "ayah": 19,
      "surah": 96,
      "text": "وقوله تعالى \"كلا لا تطعه\" يعني يا محمد لا تطعه فيما ينهاك عنه من المداومة على العبادة وكثرتها وصل حيث شئت ولا تباله فإن الله حافظك وناصرك وهو يعصمك من الناس \"واسجد واقترب\" كما ثبت فى الصحيح عند مسلم من طريق عبدالله بن وهب عن عمرو بن الحارث عن عمارة بن غزية عن سمي عن أبي صالح عن أبي هريرة أن رسول الله صلى الله عليه وسلم قال \"أقرب ما يكون العبد من ربه وهو ساجد فأكثروا الدعاء\" وتقدم أيضا أن رسول الله صلى الله عليه وسلم كان يسجد في \"إذا السماء انشقت\" و \"اقرأ باسم ربك الذي خلق\". آخر تفسير سورة اقرأ ولله الحمد والمنة وبه التوفيق والعصمة."
    },
    { "ayah": 2, "surah": 96, "text": "التنبيه على خلق الإنسان من علقة." },
    {
      "ayah": 3,
      "surah": 96,
      "text": "أن من كرمه تعالى أن علم الإنسان ما لم يعلم فشرفه وكرمه بالعلم وهو القدر الذي امتاز به أبو البرية آدم على الملائكة والعلم تارة يكون في الأذهان وتارة يكون في اللسان وتارة يكون في الكتابة بالبنان ذهني ولفظي ورسمي. والرسمي يستلزمهما من غير عكس فلهذا قال \"اقرأ وربك الأكرم الذي علم بالقلم علم الإنسان ما لم يعلم\"."
    },
    {
      "ayah": 4,
      "surah": 96,
      "text": "وفي الأثر قيدوا العلم بالكتابة وفيه أيضا من عمل بما علم ورثه الله علم ما لم يكن يعلم."
    },
    {
      "ayah": 5,
      "surah": 96,
      "text": "كرمه تعالى أن علم الإنسان ما لم يعلم فشرفه وكرمه بالعلم وهو القدر الذي امتاز به أبو البرية آدم على الملائكة والعلم تارة يكون في الأذهان وتارة يكون في اللسان وتارة يكون في الكتابة بالبنان ذهني ولفظي ورسمي. والرسمي يستلزمهما من غير عكس فلهذا قال \"اقرأ وربك الأكرم الذي علم بالقلم علم الإنسان ما لم يعلم\" وفي الأثر قيدوا العلم بالكتابة وفيه أيضا من عمل بما علم ورثه الله علم ما لم يكن يعلم."
    },
    { "ayah": 6, "surah": 96, "text": "يخبر تعالى عن الإنسان أنه ذو فرح وأشر وبطر وطغيان." },
    { "ayah": 7, "surah": 96, "text": "إذا رأى نفسه قد استغنى وكثر ماله ثم تهدده وتوعده ووعظه." },
    {
      "ayah": 8,
      "surah": 96,
      "text": "فقال \"إن إلى ربك الرجعى\" أي إلى الله المصير والمرجع وسيحاسبك على مالك من أين جمعته وفيم صرفته. قال ابن أبي حاتم حدثنا زيد بن إسماعيل الصائغ حدثنا جعفر بن عون حدثنا أبو عميس عن عون قال: قال عبدالله: منهومان لا يشبعان صاحب العلم وصاحب الدنيا ولا يستويان فأما صاحب العلم فيزداد رضى الرحمن وأما صاحب الدنيا فيتمادى فى الطغيان قال ثم قرأ عبدالله \"إن الإنسان ليطغى أن رآه استغنى\" وقال للآخر \"إنما يخشى الله من عباده العلماء\" وقد روي هذا مرفوعا إلى رسول الله صلى الله عليه وسلم \"منهومان لا يشبعان طالب علم وطالب دنيا\"."
    },
    {
      "ayah": 9,
      "surah": 96,
      "text": "نزلت في أبي جهل لعنه الله توعد النبي صلى الله عليه وسلم على الصلاة عند البيت فوعظه تعالى بالتي هي أحسن أولا."
    }
  ]
}
