{
  "ayahs": [
    {
      "ayah": 1,
      "surah": 97,
      "text": "يخبر تعالى أنه أنزل القرآن ليلة القدر وهي الليلة المباركة التي قال الله عز وجل \"إنا أنزلناه في ليلة مباركة\" وهي ليلة القدر وهي من شهر رمضان كما قال تعالى \"شهر رمضان الذي أنزل فيه القرآن\" قال ابن عباس وغيره أنزل الله القرآن جملة واحدة من اللوح المحفوظ إلى بيت العزة من السماء الدنيا ثم نزل مفصلا بحسب الوقائع في ثلاث وعشرين سنة على رسول الله صلى الله عليه وسلم ثم قال تعالى معظما لشأن ليلة القدر التي اختصها بإنزال القرآن العظيم فيها."
    },
    {
      "ayah": 2,
      "surah": 97,
      "text": "قال تعالى معظما لشأن ليلة القدر الذي اختصها بإنزال القرآن العظيم فيها فقال وما أدراك ما ليلة القدر."
    },
    {
      "ayah": 3,
      "surah": 97,
      "text": "فإذا هي ألف شهر لا تزيد يوما ولا تنقص. ثم قال الترمذي هذا حديث غريب لا نعرفه إلا من هذا الوجه من حديث القاسم بن الفضل وقد قيل عن القاسم بن الفضل عن يوسف بن مازن والقاسم بن الفضل الحداني هو ثقة وثقه يحيى القطان وعبدالرحمن بن مهدي قال وشيخه يوسف بن سعد ويقال يوسف بن مازن رجل مجهول ولا يعرف هذا الحديث على هذا اللفظ إلا من هذا الوجه وقد روى هذا الحديث الحاكم في مستدركه من طريق القاسم بن الفضل عن يوسف بن مازن به وقول الترمذي إن يوسف هذا مجهول فيه نظر فإنه قد روى عنه جماعة منهم حماد بن سلمة وخالد الحذاء ويونس بن عبيد وفال فيه يحيى بن معين هو مشهور وفي رواية عن ابن معين هو ثقة ورواه ابن جرير من طريق القاسم بن الفضل عن يوسف بن مازن كذا قال وقد يقتضي اضطرابا في هذا الحديث والله أعلم. ثم هذا الحديث على كل تقدير منكر جدا قال شيخنا الإمام الحافظ الحجة أبو الحجاج المزي هو حديث منكر \"قلت\" وقول القاسم بن الفضل الحداني أنه حسب مدة بني أمية فوجدها ألف شهر لا تزيد يوما ولا تنقص ليس بصحيح فإن معاوية بن أبي سفيان رضي الله عنه استقل بالملك حين سلم إليه الحسن بن علي الإمرة سنة أربعين واجتمعت البيعة لمعاوية سمي ذلك عام الجماعة ثم استمروا فيها متتابعين بالشام وغيرها لم تخرج عنهم إلا مدة دولة عبدالله بن الزبير في الحرمين والأهواز وبعض البلاد قريبا من تسع سنين لكن لم تزل يدهم عن الإمرة بالكلية بل عن بعض البلاد إلى أن استلبهم بنو العباس الخلافة في سنة اثنتين وثلاثين ومائة فيكون مجموع مدتهم اثنتين وتسعين سنة وذلك أزيد من ألف شهر فإن الألف شهر عبارة عن ثلات وثمانين سنة وأربعة أشهر وكأن القاسم بن الفضل أسقط من مدتهم أيام ابن الزبير وعلي هذا فيقارب ما قاله الصحة في الحساب والله أعلم. ومما يدل على ضعف هذا الحديث أنه سيق لذم بني أمية ولو أريد ذلك لم يكن بهذا السياق فإن تفضيل ليلة القدر على أيامهم لا يدل على ذم أيامهم فإن ليلة القدر شريفة جدا والسورة الكريمة إنما جاءت لمدح ليلة القدر فيكف تمدح بتفضيلها على أيام بني أمية التي هي مذمومة بمقتضى هذا الحديث وهل هذا إلا كما قال القائل: ألم تر أن السيف ينقص قدره إذا قيل إن السيف أمضى من العصا وقال آخر: إذا أنت فضلت إمرءا ذا براعة على ناقص كان المديح من النقص ثم الذي يفهم الآية أن الألف شهر المذكورة في الآية هي أيام بني أمية والسورة مكية فكيف يحال على ألف شهر هي دولة بني أمية ولا يدل عليها لفظ الآية ولا معناها والمنبر إنما صنع بالمدينة بعد مدة من الهجرة فهذا كله مما يدل على ضعف الحديث ونكارته والله أعلم. وقال ابن أبي حاتم حدثنا أبو زرعة حدثنا إبراهيم بن موسى أخبرنا مسلم يعني ابن خالد عن ابن أبي نجيح عن مجاهد أن النبي صلى الله عليه وسلم ذكر رجلا من بني إسرائيل لبس السلاح في سبيل الله ألف شهر قال فعجب المسلمون من ذلك قال فأنزل الله عز وجل \"إنا أنزلناه في ليلة القدر وما أدراك ما ليلة القدر ليلة القدر خير من ألف شهر\" التي لبس ذلك الرجل السلاح في سبيل الله ألف شهر. وقال ابن جرير حدثنا ابن حميد حدثنا حكام بن مسلم عن المثنى بن الصباح عن مجاهد قال كان في بني إسرائيل رجل يقوم الليل حتى يصبح ثم يجاهد العدو بالنهار حتى يمسي ففعل ذلك ألف شهر فأنزل الله هذه الآية \"ليلة القدر خير من ألف شهر\" قيام تلك الليلة خير من عمل ذلك الرجل. وقال ابن أبي حاتم أخبرنا يونس أخبرنا ابن وهب حدثني مسلمة بن علي عن علي بن عروة قال: ذكر رسول الله صلى الله عليه وسلم يوما أربعة من بني إسرائيل عبدوا الله ثمانين عاما لم يعصوه طرفة عين فذكر أيوب وزكريا وحزقيل بن العجوز ويوشع بن نون قال فعجب أصحاب رسول الله صلى الله عليه وسلم من ذلك فأتاه جبريل فقال يا محمد عجبت أمتك من عبادة هؤلاء النفر ثمانين سنة لم يعصوه طرفة عين فقد أنزل الله خيرا من ذلك فقرأ عليه \"إنا أنزلناه في ليلة القدر وما أدراك ما ليلة القدر ليلة القدر خير من ألف شهر\" هذا أفضل مما عجبت انت وأمتك قال فسر بذلك رسول الله صلى الله عليه وسلم والناس معه. وقال سفيان الثوري بلغني عن مجاهد ليلة القدر خير من ألف شهر قال عملها وصيامها وقيامها خير من ألف شهر رواه ابن جرير. وقال ابن أبي حاتم حدثنا أبو زرعة حدثنا إبراهيم بن موسى اخبرنا ابن أبي زائدة عن ابن جريج عن مجاهد ليلة القدر خير من ألف شهر ليس في تلك الشهور ليلة القدر وهكذا قال قتادة بن دعامة والشافعي وغير واحد وقال عمرو بن قيس الملائي عمل فيها خير من عمل ألف شهر وهذا القول بأنها أفضل من عبادة ألف شهر ليس فيها ليلة القدر هو اختيار ابن جرير وهو الصواب لا ما عداه وهو كقوله صلى الله عليه وسلم \"رباط ليلة في سبيل الله من ألف ليلة فيما سواه من المنازل\" رواه أحمد وكما جاء في قاصد الجمعة بهيئة حسنة ونية صالحة أنه له عمل سنة أجر صيامها وقيامها إلى غير ذلك من المعاني المشابهة لذلك وقال الإمام أحمد حدثنا إسماعيل بن إبراهيم حدثنا أيوب عن أبي قلابة عن أبي هريرة رضي الله عنه قال: لما حضر رمضان قال رسول الله صلى الله عليه وسلم \"قد جاءكم شهر رمضان شهر مبارك افترض الله عليكم صيامه تفتح فيه أبواب الجنة وتغلق فيه أبواب الجحيم وتغل فيه الشياطين فيه ليلة خير من ألف شهر من حرم خيرها فقد حرم\" ورواه النسائي من حديث أيوب به ولما كانت ليلة القدر تعدل عبادتها عبادة ألف شهر ثبت في الصحيحين عن أبي هريرة أن رسول الله صلى الله عليه وسلم قال \"من قام ليلة القدر إيمانا واحتسابا غفر له ما تقدم من ذنبه\"."
    },
    {
      "ayah": 4,
      "surah": 97,
      "text": "وقوله تعالى \"تنزل الملائكة والروح فيها بإذن ربهم من كل أمر\" أي يكثر تنزل الملائكة في هذه الليلة لكثرة بركتها والملائكه يتنزلون مع تنزل البركة والرحمة كما يتنزلون عند تلاوة القرآن ويحيطون بحلق الذكر ويضعون أجنحتهم لطالب العلم بصدق تعظيما له وأما الروح فقيل المراد به ههنا جبريل عليه السلام فيكون من باب عطف الخاص على العام وقيل هم ضرب من الملائكة كما تقدم في سورة النبأ والله أعلم. وقوله تعالى \"من كل أمر\" قال مجاهد سلام هي من كل أمر وقال سعيد بن منصور حدثنا عيسى بن يونس حدثنا الأعمش عن مجاهد فى قوله \"سلام هي\" قال هي سالمة لا يستطيع الشيطان أن يعمل فيها سوءا أو يعمل فيها أذى وقال قتادة وغيره تقتضى فيها الأمور وتقدر الآجال والأرزاق كما قال تعالى \"فيها يفرق كل أمر حكيم\"."
    },
    {
      "ayah": 5,
      "surah": 97,
      "text": "قال تسليم الملائكة ليلة القدر على أهل المساجد حتى يطلع الفجر وروى ابن جرير عن ابن عباس أنه كان يقرأ \"من كل امريء سلام هي حتى مطلع الفجر\" وروى البيهقي في كتابه فضائل الأوقات عن علي أثرا غريبا في نزول الملائكة ومرورهم على المصلين ليلة القدر وحصول البركة للمصلين. وروى ابن أبي حاتم عن كعب الأحبار أثرا غريبا عجيبا مطولا جدا في تنزل الملائكة من سدرة المنتهى صحبة جبريل عليه السلام إلى الأرض ودعائهم للمؤمنين والمؤمنات. وقال أبو داود الطيالسي حدثنا عمران يعني القطان عن قتادة عن أبي ميمونة عن أبي هريرة أن رسول الله صلى الله عليه وسلم قال في ليلة القدر \"إنها ليلة سابعة أو تاسعة وعشرين وإن الملائكة تلك الليلة في الأرض أكثر عدد الحصى\". وقال الأعمش عن المنهال عن عبدالرحمن بن أبي ليلى في قوله \"من كل أمر سلام\" قال لا يحدث فيها أمر. وقال قتادة وابن زيد في قوله \"سلام هي\" يعني هي خير كلها ليس فيها شر إلى مطلع الفجر ويؤيد هذا المعنى ما رواه الإمام أحمد حدثنا حيوة بن شريح حدثنا بقية حدثني بجير بن سعد عن خالد بن معدان عن عبادة بن الصامت أن رسول الله صلى الله عليه وسلم قال \"ليلة القدر في العشر البواقي من قامهن ابتغاء حسبتهن فإن الله يغفر له ما تقدم من ذنبه وما تأخر وهي ليلة وتر تسع أو سبع أو خامسة أو ثالثة أو آخر ليلة\" وقال رسول الله صلى الله عليه وسلم \"إن أمارة ليلة القدر أنها صافية بلجة كأن فيها قمرا ساطعا ساكنة ساجية لا برد فيها ولا حر ولا يحل لكوكب يرمى به حتى يصبح وإن أمارتها أن الشمس صبيحتها تخرج مستوية ليس لها شعاع مثل القمر ليلة البدر ولا يحل للشيطان أن يخرج معها يومئذ\" وهذا إسناد حسن وفي المتن غرابة وفي بعض ألفاظه نكارة وقال أبو داود الطيالسي حدثنا زمعة عن سلمة بن وهرام عن عكرمة عن ابن عباس أن رسول الله صلى الله عليه وسلم قال في ليلة القدر \"ليلة سمحة طلقة لا حارة ولا باردة وتصبح شمس صبيحتها ضعيفة حمراء\" وروى ابن أبي عاصم النبيل بإسناده عن جابر بن عبدالله أن رسول الله صلى الله عليه وسلم قال \"إني رأيت ليلة القدر فأنسيتها وهي في العشر الأواخر من لياليها طلقة بلجة لا حارة ولا باردة كأن فيها قمرا لا يخرج شيطانها حتى يضيء فجرها\" \"فصل\" اختلف العلماء هل كانت ليلة القدر في الأمم السالفة أو هي من خصائص هذه الأمة؟ على قولين وقال أبو مصعب أحمد بن أبي بكر الزهري حدثنا مالك أنه بلغه أن رسول الله صلى الله عليه وسلم أري أعمار الناس قبله أو ما شاء الله من ذلك فكأنه تقاصر أعمار أمته أن لا يبلغوا من العمل الذي بلغ غيرهم في طول العمر فأعطاه الله ليلة القدر خير من ألف شهر. وقد أسند من وجه آخر وهذا الذي قاله مالك يقتضي تخصيص هذه الأمة بليلة القدر وقد نقله صاحب العدة أحد أئمة الشافعية عن جمهور العلماء فالله أعلم. وحكى الخطابي عليه الإجماع ونقله الراضي جازما به عن المذهب والذي دل عليه الحديث أنها كانت في الأمم الماضين كما هي فى أمتنا. قال الإمام أحمد بن حنبل حدثنا يحيى بن سعيد عن عكرمة بن عمار حدثني أبو زميل سماك الحنفي حدثني مالك بن مرثد بن عبدالله حدثني مرثد قال سأل أبا ذر قلت كيف سألت رسول الله صلى الله عليه وسلم عن ليلة القدر؟ قال أنا كنت أسأل الناس عنها قلت يا رسول الله أخبرني عن ليلة القدر أفي رمضان هي أو في غيره؟ قال \"بل هي فى رمضان\" قلت تكون مع الأنبياء ما كانوا فإذا قبضوا رفعت أم هي إلى يوم القيامة؟ قال \"بل هي إلى يوم القيامة\" قلت في أي رمضان هي قال \"التمسوها في العشر الأول والعشر الأخر\" ثم حدث رسول الله صلى الله عليه وسلم وحدث ثم اهتبلت غفلته قلت في أي العشرين هي؟ قال \"ابتغوها في العشر الأواخر لا تسألني عن شيء بعدها\" ثم حدث رسول الله صلى الله عليه وسلم ثم اهتبلت غفلته فقلت يا رسول الله أقسمت علي بحقي عليك لما أخبرتني في أي العشر هي؟ فغضب علي غضبا لم يغضب مثله منذ صحبته وقال \"التمسوها في السبع الأواخر لا تسألني عن شيء بعدها\" ورواه النسائي عن الفلاس عن يحيى بن سعيد القطان به ففيه دلالة على ما ذكرناه وفيه أنها تكون باقية إلى يوم القيامة في كل سنة بعد النبي صلى الله عليه وسلم لا كما زعمه بعض طوائف الشيعة من رفعها بالكلية على ما فهموه من الحديث الذي سنورده بعد من قوله عليه السلام \"فرفعت وعسى أن يكون خيرا لكم\" لأن المراد رفع علم وقتها عينا. وفيه دلالة وعلى أن ليلة القدر يختص وقوعها بشهر رمضان من بين سائر الشهور لا كما روى عن ابن مسعود ومن تابعه من علماء أهل الكوفة من أنها توجد في جميع السنة وترتجى في جميع الشهور على السواء. وقد ترجم أبو داود في سننه على هذا فقال \"باب بيان أن ليلة القدر في كل رمضان\" حدثنا حميد بن زنجويه النسائي أخبرنا سعيد وابن أبي مريم حدثنا محمد بن أبي جعفر بن أبي كثير حدثني موسى بن عقبة عن أبي إسحاق عن سعيد بن جبير عن عبدالله بن عمر قال: سئل رسول الله صلى الله عليه وسلم وأنا أسمع عن ليلة القدر فقال \"هي في كل رمضان\" وهذا إسناد رجاله ثقات إلا أن أبا داود قال رواه شعبة وسفيان عن أبي إسحاق فأوقفاه وقد حكي عن أبي حنيفة رحمه الله رواية أنها ترتجى في كل شهر رمضان وهو وجه حكاه الغزالي واستغربه الرافعي جدا. \"فصل\" ثم قد قيل إنها تكون في أول ليلة من شهر رمضان يحكى هذا عن أبي رزين وقيل إنها تقع ليلة سبع عشرة وروى فيه أبو داود حديثا مرفوعا عن ابن مسعود وروي موقوفا عليه وعلى زيد بن أرقم وعثمان بن أبي العاص وهو قول عن محمد بن إدريس الشافعي ويحكى عن الحسن البصري وجهوه بأنها ليلة بدر وكانت ليلة جمعة هي السابعة عشر من شهر رمضان وفي صبيحتها كانت وقعة بدر وهو اليوم الذي قال الله تعالى فيه \"يوم الفرقان\" وقيل ليلة تسع عشرة يحكى عن علي وابن مسعود أيضا رضي الله عنهما. وقيل ليلة إحدى وعشرين لحديث أبي سعيد الخدري قال: اعتكف رسول الله صلى الله عليه وسلم في العشر الأول من رمضان واعتكفنا معه فأتاه جبريل فقال إن الذي تطلب أمامك فاعتكف العشر الأوسط فاعتكفنا معه فأتاه جبريل فقال الذي تطلب أمامك ثم قام النبي صلى الله عليه وسلم خطيبا صبيحة عشرين من رمضان فقال \"من كان اعتكف معي فليرجع فإني رأيت ليلة القدر وإني أنسيتها وإنها في العشر الأواخر وفي وتر وإني رأيت كأني أسجد في طين وماء\" وكان سقف المسجد جريدا من النخل وما نرى في السماء شيئا فجاءت قزعة فمطرنا فصلى بنا النبي صلى الله عليه وسلم حتى رأيت أثر الطين والماء علي جبهة رسول الله صلى الله عليه وسلم تصديق رؤياه وفي لفظ من صبح إحدى وعشرين أخرجاه في الصحيحين قال الشافعي وهذا الحديث أصح الروايات وقيل ليلة ثلاث وعشرين لحديث عبدالله بن أنيس في صحيح مسلم وهو قريب السياق من رواية أبي سعيد فالله أعلم. وقيل ليلة أربع وعشرين. قال أبو داود الطيالسي حدثنا حماد بن سلمة عن الجريري عن أبي نضرة عن أبي سعيد أن رسول الله صلى الله عليه وسلم قال \"ليلة القدر أربع وعشرين\" إسناد رجاله ثقات. وقال أحمد حدثنا موسى بن داود حدثنا ابن حبيب عن يزيد بن أبي حبيب عن أبي الخير عن الصنابحي عن بلال قال: قال رسول الله صلى الله عليه وسلم \"ليلة القدر ليلة أربع وعشرين\" ابن لهيعة ضعيف وقد خالفه ما رواه البخاري عن أصبغ عن ابن وهب عن عمرو بن الحارث بن يزيد بن أبي حبيب عن أبي الخير عن أبي عبدالله الصنابحي قال أخبرني بلال مؤذن رسول الله صلى الله عليه وسلم أنها أولى السبع من العشر الأواخر فهذا الموقوف أصح والله أعلم. وهكذا روي عن ابن مسعود وابن عباس وجابر والحسن وقتادة وعبدالله بن وهب أنها ليلة أربع وعشرين وقد تقدم في سورة البقرة حديث واثلة بن الأسقع مرفوعا \"إن القرآن أنزل ليلة أربع وعشرين\" وقيل تكون ليلة خمس وعشرين لما رواه البخاري عن عبدالله بن عباس أن رسول الله صلى الله عليه وسلم قال \"التمسوها في العشر الأواخر من رمضان في تاسعة تبقى في سابعة تبقى في خامسة تبقى\" فسره كثيرون بليالي الأوتار وهو أظهر وأشهر وحمله آخرون على الأشفاع كما رواه مسلم عن أبي سعيد أنه حمله على ذلك والله أعلم وقيل إنها تكون ليلة سبع وعشرين لما رواه مسلم في صحيحه عن أبي بن كعب عن رسول الله صلى الله عليه وسلم أنها ليلة سبع وعشرين. قال الإمام أحمد حدثنا سفيان سمعت عبدة وعاصما عن زر سألت أبي بن كعب قلت أبا المنذر إن أخاك ابن مسعود يقول من يقم الحول يصب ليلة القدر قال يرحمه الله لقد علم أنها في شهر رمضان وأنها ليلة سبع وعشرين ثم حلف قلت وكيف تعلمون ذلك؟ قال بالعلامة أو بالآية التي أخبرنا بها تطلع ذلك اليوم لا شعاع لها يعني الشمس وقد رواه مسلم من طريق سفيان بن عيينة وشعبة والأوزاعي عن عبدة عن زر عن أبي فذكره وفيه فقال والله الذي لا إله إلا هو إنها لفي رمضان يحلف ما يستثني ووالله إني لأعلم أي ليلة القدر هي التي أمرنا رسول الله صلى الله عليه وسلم بقيامها هي ليلة سبع وعشرين. \"وأمارتها أن تطلع الشمس في صبيحتها بيضاء لا شعاع لها وفي الباب عن معاوية وابن عمر وابن عباس وغيرهم عن رسول الله صلى الله عليه وسلم أنها ليلة سبع وعشرين وهو قول طائفة من السلف وهو الجادة من مذهب الإمام أحمد بن حنبل رحمه الله وهو رواية عن أبي حنيفة أيضا. وقد حكي عن بعض السلف أنه حاول استخراج كونها ليلة سبع وعشرين من القرآن من قوله \"هي\" لأنها الكلمة السابعة والعشرون من السورة فالله أعلم. وقد قال الحافظ أبو القاسم الطبراني حدثنا إسحاق بن إبراهيم الدبري أخبرنا عبدالرزاق أخبرنا معمر عن قتادة وعاصم أنهما سمعا عكرمة يقول قال ابن عباس دعا عمر بن الخطاب اصحاب محمد صلى الله عليه وسلم فسألهم عن ليلة القدر فأجمعوا أنها في العشر الأواخر قال ابن عباس فقلت لعمر إني لأعلم - أو إني لأظن - أي ليلة القدر هي فقال عمر: وأي ليلة هي؟ فقلت سابعة تمضي - أو سابعة - تبقى - من العشر الأواخر فقال عمر من أين علمت ذلك قال ابن عباس فقلت خلق الله سبع سموات وسبع أرضين وسبعة أيام وإن الشهر يدور على سبع وخلق الإنسان من سبع ويأكل من سبع ويسـجد على سبع والطواف بالبيت سبع ورمي الجمار سبع لأشياء ذكرها فقال عمر لقد فطنت لأمر ما فطنا له وكان قتادة يزيد عن ابن عباس في قوله ويأكل من سبع قال هو قول الله تعالى \"فأنبتنا فيها حبا وعنبا\" الآية وهذا إسناد جيد قوي ومتن غريب جدا فالله أعلم وقيل إنها تكون ليلة تسع وعشرين. وقال الإمام أحمد بن حنبل حدثنا أبو سعيد مولى بني هاشم حدثنا سعيد بن سلمة حدثنا عبدالله بن محمد بن عقيل عن عمر بن عبدالرحمن عن عبادة بن الصامت أنه سأل رسول الله صلى الله عليه وسلم عن ليلة القدر فقال رسول الله صلى الله عليه وسلم \"في رمضان فالتمسوها في العشر الأواخر فإنها في وتر إحدى وعشرين أو ثلاث وعشرين أو خمس وعشرين أو سبع وعشرين أو تسع وعشرين أو في آخر ليلة\" وقال الإمام أحمد حدثنا سليمان بن داود وهو أبو داود الطيالسي حدثنا عمران القطان عن قتادة عن أبي ميمونة عن أبي هريرة أن رسول الله صلى الله عليه وسلم قال في ليلة القدر \"إنها في ليلة سابعة أو تاسعة وعشرين إن الملائكة تلك الليلة في الأرض أكثر من عدد الحصى\" تفرد به أحمد وإسناده لا بأس به وقيل إنها تكون في آخر ليلة لما تقدم من هذا الحديث آنفا ولما رواه الترمذي والنسائي من حديث عيينة بن عبدالرحمن عن أبيه عن أبي بكرة أن رسول الله صلى الله عليه وسلم قال \"في تسع يبقين أو سبع يبقين أو خمس يبقين أو ثلاث أو آخر ليلة\" يعني التمسوا ليلة القدر وقال الترمذي حسن صحيح وفي المسند من طريق أبي سلمة عن أبي هريرة عن النبي صلى الله عليه وسلم في ليلة القدر \"إنها آخر ليلة\" \"فصل\" قال الشافعي في هذه الروايات: صدرت من النبي صلى الله عليه وسلم جوابا للسائل إذ قيل له أنلتمس ليلة القدر فى الليلة الفلانية؟ يقول \"نعم\" وإنما ليلة القدر ليلة معينة لا تنتقل. نقله الترمذي عنه بمعناه وروي عن أبي قلابة أنه قال: ليلة القدر تنتقل في العشر الأواخر وهذا الذي حكاه عن أبي قلابة نص عليه مالك والثوري وأحمد بن حنبل وإسحاق بن راهويه وأبو ثور والمزني وأبو بكر بن خزيمة وغيرهم وهو محكي عن الشافعي نقله القاضي عنه وهو الأشبه والله أعلم. وقد يستأنس لهذا القول بما ثبت في الصحيحين عن عبدالله بن عمر أن رجالا من أصحاب النبي صلى الله عليه وسلم أروا ليلة القدر في المنام في السبع الأواخر من رمضان فقال رسول الله صلى الله عليه وسلم \"أرى رؤياكم قد تواطأت في السبع الأواخر فمن كان متحريها فليتحرها في السبع الأواخر\" وفيهما أيضا عن عائشة رضي الله عنها أن رسول الله صلى الله عليه وسلم قال \"تحروا ليلة القدر في الوتر من العشر الأواخر من رمضان\". ولفظه للبخاري ويحتج للشافعي أنها لا تنتقل وأنها معينة من الشهر بما رواه البخاري في صحيحه عن عبادة بن الصامت قال: خرج رسول الله صلى الله عليه وسلم ليخبرنا بليلة القدر فتلاحى رجلان من المسلمين فقال: \"خرجت لأخبركم بليلة القدر فتلاحى فلان وفلان فرفعت وعسى أن يكون خير لكم فالتمسوها في التاسعة والسابعة والخامسة\" وجه الدلالة منه أنها لو لم تكن معينة مستمرة التعيين لما حصل لهم العلم بعينها في كل سنة إذ لو كانت تنتقل لما علموا تعيينها إلا ذلك العام فقط اللهم إلا أن يقال إنه إنما خرج ليعلمهم بها تلك السنة فقط وقوله \"فتلاحى فلان وفلان فرفعت\" فيه استئناس لما يقال إن المماراة تقطع الفائدة والعلم النافع كما جاء في الحديث \"إن العبد ليحرم الرزق بالذنب يصيبه\" وقوله \"فرفعت\" أي رفع علم تعيينها لكم لا أنها رفعت بالكلية من الوجود كما يقوله جهلة الشيعة لأنه قد قال بعد هذا \"فالتمسوها في التاسعة والسابعة والخامسة\" وقوله \"وعسى أن يكون خيرا لكم\" يعني عدم تعيينها لكم فإنها إذا كانت مبهمة اجتهد طلابها في ابتغائها في جميع محال رجائها فكان أكثر للعبادة بخلاف ما إذا علموا عينها فإنها كانت الهمم تتقاصر على قيامها فقط وإنما اقتضت الحكمة إيهامها لتعمم العبادة جميع الشهر في ابتغائها ويكون الاجتهاد في العشر الأخير أكثر ولهذا كان رسول الله صلى الله عليه وسلم يعتكف العشر الأواخر من رمضان حتى توفاه الله عز وجل ثم اعتكف أزواجه من بعده. أخرجاه من حديث عائشة ولهما عن ابن عمر كان رسول الله صلى الله عليه وسلم يعتكف العشر الأواخر من رمضان وقالت عائشة: كان رسول الله صلى الله عليه وسلم إذا دخل العشر أحيا الليل وأيقظ أهله وشد المئزر أخرجاه ولمسلم عنها: كان رسول الله صلى الله عليه وسلم يجتهد في العشر ما لا يجتهد في غيره وهذا معنى قولها وشد المئزر وقيل المراد بذلك اعتزال النساء ويحتمل أن يكون كناية عن الأمرين لما رواه الإمام أحمد حدثنا شريح حدثنا أبو معشر عن هشام بن عروة عن أبيه عن عائشة قالت: كان رسول الله صلى الله عليه وسلم إذا بقي عشر من رمضان شد مئزره واعتزل نساءه انفرد به أحمد. وقد حكي عن مالك رحمه الله أن جميع ليالي العشر في تطلب ليلة القدر على السواء لا يترجح منها ليلة على أخرى رأيته في شرح الرافعي رحمه الله والمستحب الإكثار من الدعاء في جميع الأوقات وفي شهر رمضان أكثر وفي العشر الأخير منه ثم في أوتاره أكثر. والمستحب أن يكثر من هذا الدعاء: اللهم إنك عفو تحب العفو فاعف عني لما رواه الإمام أحمد حدثنا يزيد هو بن هارون حدثنا الجوهري وهو سعيد بن إياس عن عبدالله بن بريدة أن عائشة قالت: يا رسول الله إن وافقت ليلة القدر فما أدعو؟ قال \"قولي اللهم إنك عفو تحب العفو فاعف عني\". وقد رواه الترمذي والنسائي وابن ماجه من طريق كهمس بن الحسن عن عبدالله بن بريدة عن عائشة قالت: قلت يا رسول الله أرأيت إن علمت أي ليلة ليلة القدر ما أقول فيها؟ قال \"قولي اللهم إنك عفو تحب العفو فاعف عني\" وهذا لفظ الترمذي ثم قال هذا حديث حسن صحيح وأخرجه الحاكم في مستدركه وقال صحيح على شرط الشيخين ورواه النسائي أيضا من طريق سفيان الثوري عن علقمة بن مرثد عن سليمان بن بريدة عن عائشة قالت: قلت يا رسول الله أرأيت إن وافقت ليلة القدر ما أقول فيها؟ قال \"قولي اللهم إنك عفو تحب العفو فاعف عني\" \"ذكر أثر غريب ونبأ عجيب يتعلق بليلة القدر\" رواه الإمام أبو محمد بن أبي حاتم عند تفسير هذه السورة الكريمة فقال حدثنا أبي حدثنا عبدالله بن أبي زياد القطواني حدثنا سيار بن حاتم حدثنا موسى بن سعيد يعني الراسبي عن هلال بن أبي جبلة عن أبي عبدالسلام عن أبيه عن كعب أنه قال: إن سدرة المنتهى على حد السماء السابعة مما يلي الجنة فهي على حد هواء الدنيا وهواء الآخرة علوها في الجنة وعروقها وأغصانها من تحت الكرسي فيها ملائكة لا يعلم عدتهم إلا الله عز وجل يعبدون الله عز وجل على أغصانها في كل موضع شعرة منها ملك ومقام جبريل عليه السلام في وسطها فينادي الله جبريل أن ينزل في كل ليلة القدر مع الملائكة الذين يسكنون سدرة المنتهى وليس فيهم ملك إلا قد أعطي الرأفة والرحمة للمؤمنين فينزلون على جبريل في ليلة القدر حين تغرب الشمس فلا تبقى بقعة في ليلة القدر إلا وعليها ملك إما ساجد وإما قائم يدعو للمؤمنين والمؤمنات إلا أن تكون كنيسة أو بيعة أو بيت نار أو وثن أو بعض أماكنكم التي تطرحون فيها الخبث أو بيت فيه سكران أو بيت فيه مسكر أو بيت فيه وثن منصوب أو بيت فيه جرس معلق أو مبولة أو مكان فيه كساحة البيت فلا يزالون ليلتهم تلك يدعون للمؤمنين والمؤمنات وجبريل لا يدع أحدا من المؤمنين إلا صافحه وعلامة ذلك من اقشعر جلده ورق قلبه ودمعت عيناه فإن ذلك من مصافحة جبريل. وذكر كعب أن من قال في ليلة القدر: لا إله إلا الله ثلاث مرات غفر الله له بواحدة ونجا من النار بواحدة وأدخله الجنة بواحدة فقلنا لكعب الأحبار يا أبا إسحاق صادقا فقال كعب الأحبار وهل يقول لا إله إلا الله في ليلة القدر إلا كل صادق والذي نفسي بيده أن ليلة القدر لتثقل على الكافر والمنافق حتى كأنها على ظهره جبل فلا تزال الملائكة هكذا حتى يطلع الفجر فأول من يصعد جبريل حتى يكون في وجه الأفق الأعلى من الشمس فيبسط جناحيه وله جناحان أخضران لا ينشرهما إلا في تلك الساعة فتصير الشمس لا شعاع لها ثم يدعو ملكا ملكا فيصعد فيجتمع نور الملائكة ونور جناحي جبريل فلا تزال الشمس يومها ذلك متحيرة فيقيم جبريل ومن معه بين الأرض وبين السماء الدنيا يومهم ذلك في دعاء ورحمة واستغفار للمؤمنين والمؤمنات ولمن صام رمضان إيمانا واحتسابا ودعاء لمن حدث نفسه إن عاش إلى قابل صام رمضان لله فإذا أمسوا دخلوا إلى السماء الدنيا فيجلسون حلقا حلقا فتجتمع إليهم ملائكة سماء الدنيا فيسألونهم عن رجل رجل وعن امرأة امرأة فيحدثونهم حتى يقولوا ما فعل فلان وكيف وجدتموه العام؟ فيقولون وجدنا فلانا عام أول في هذه الليلة متعبدا ووجدناه العام مبتدعا ووجدنا فلانا مبتدعا ووجدناه العام عابدا قال فيكفون عن الاستغفار لذلك ويقبلون على الاستغفار لهذا ويقولن وجدنا فلانا وفلانا يذكران الله ووجدنا فلانا راكعا وفلانا ساجدا ووجدناه تاليا لكتاب الله قال فهم كذلك يومهم وليلتهم حتى يصعدون إلى السماء الثانية ففي كل سماء يوم وليلة حتى ينتهوا مكانهم من سدرة المنتهى فتقول لهم سدرة المنتهى يا سكاني حدثوني عن الناس وسموهم لي فإن لي عليكم حقا وإني أحب من أحب الله فذكر كعب الأحبار أنهم يعدون لها ويحكون لها الرجل والمرأة بأسمائهم وأسماء آبائهم ثم تقبل الجنة على السدرة فتقول أخبريني بما أخبرك سكانك من الملائكة فتخبرها قال: فتقول الجنة رحمة الله على فلان ورحمة الله على فلانة اللهم عجلهم إلي فيبلغ جبريل مكانه قبلهم فيلهمه الله فيقول وجدت فلانا ساجدا فاغفر له فيغفر له فيسمع جبريل جميع حملة العرش فيقولون رحمة الله على فلان ورحمة الله على فلانة ومغفرته لفلان ويقول يا رب وجدت فلانا الذي وجدته عام أول على السنة والعبادة ووجدته العام قد أحدث حدثا وتولى عما أمر به فيقول الله: يا جبريل إن تاب فأعتبني قبل أن يموت بثلاث ساعات غفرت له فيقول جبريل لك الحمد إلهي أنت أرحم من جميع خلقك وأنت أرحم بعبادك من عبادك بأنفسهم قال فيرتج العرش وما حوله والحجب والسموات ومن فيهن تقول الحمد لله الرحيم الحمد لله الرحيم قال وذكر كعب أنه من صام رمضان وهو يحدث نفسه إذا أفطر رمضان أن لا يعصي الله دخل الجنة بغير مسئلة ولا حساب. آخر تفسير سورة ليلة القدر ولله الحمد والمنة."
    }
  ]
}
