{
  "ayahs": [
    {
      "ayah": 1,
      "surah": 98,
      "text": "سورة البينة: قال الإمام أحمد حدثنا عفان حدثنا حماد هو ابن سلمة أخبرنا علي هو ابن زيد عن عمار بن أبي عمار قال سمعت أبا حبة البدري وهو مالك بن عمرو بن ثابت الأنصاري قال: لما نزلت \" لم يكن الذين كفروا من أهل الكتاب \" إلى آخرها قال جبريل يا رسول الله إن ربك يأمرك أن تقرئها أبيا فقال النبي صلى الله عليه وسلم لأبي \" إن جبريل أمرنى أن أقرئك هذه السورة \" قال أُبي وقد ذكرت ثم يا رسول الله صلى الله عليه وسلم؟ قال \" نعم \" قال فبكى أبي \"حديث آخر\" وقال الإمام أحمد حثنا محمد بن جعفر حدثنا شعبة سمعت قتادة يحدث أن أنس بن مالك قال: قال رسول الله صلى الله عليه وسلم لأبي ابن كعب \"إن الله أمرنى أن أقرأ عليك\" لم يكن الذين كفروا من أهل الكتاب \" قال وسمانى لك؟ قال \" نعم \" فبكى ورواه البخارى ومسلم والترمذي والنسائي من حديث شعبة به. \"حديث آخر\" قال الإمام أحمد حدثنا مؤمل حدثنا سفيان حدثنا أسلم المنقري عن عبد الله بن عبد الرحمن بن بزي عن أبيه عن أبي بن كعب قال: قال لي رسول الله صلى الله عليه وسلم \" إنى أمرت أن أقرأ عليك سورة كذا وكذا \" قلت يا رسول الله وقد ذكرت هناك؟ قال \"نعم\" فقلت له يا أبا المنذر ففرحت بذلك؟ قال وما يمنعنى والله يقول \" قل بفضل الله وبرحمته فبذلك فليفرحوا هو خير مما يجمعون \" قال مؤمل قلت لسفيان القراءة في الحديث؟ قال نعم. تفرد به من هذا الوجه \"طريق أخرى\" قال أحمد حدثنا محمد بن جعفر وحجاج قالا حدثنا شعبة عن عاصم بن بهدلة عن زر بن حبيش عن أبي بن كعب قال: إن رسول الله صلى الله عليه وسلم قال لي \" إن الله أمرني أقرأ عليك القرآن - قال فقرأ - \" لم يكن الذين كفروا من أهل الكتاب \" قال فقرأ فيها - ولو أن ابن آدم سأل واديا من مال فأعطيه لسأل ثانيا ولو سأل ثانيا فأعطيه لسأل ثالثا ولا يملأ جوف ابن آدم إلا التراب ويتوب الله على من تاب وإن ذات الدين عند الله الحنيفية غير المشركة ولا اليهودية ولا النصرانية ومن يفعل خيرا فلن يكفره \" ورواه الترمذي من حديث أبي داود الطيالسي عن شعبة به وقال حسن صحيح \"طريق أخرى\" قال الحافظ أبو القاسم الطبراني حدثنا أحمد بن خليد الحلبى حدثنا محمد بن عيسى الطباع حدثنا معاذ بن محمد بن معاذ بن أبي بن كعب عن أبيه عن جده عن أبي بن كعب قال: قال رسول الله صلى الله عليه وسلم \" يا أبا المنذر إنى أمرت أن أعرض عليك القرآن \" قال بالله آمنت وعلى يدك أسلمت ومنك تعلم قال فرد النبي صلى الله عليه وسلم القول قال: فقال يا رسول الله وذكرت هناك؟ قال: نعم باسمك ونسبك في الملإ الأعلى \" قال فاقرأ إذا يا رسول الله صلى الله عليه وسلم هذا غريب من هذا الوجه والثابت ما تقدم وإنما قرأ عليه النبي صلى الله عليه وسلم هذه السورة تثبيتا له وزيادة لإيمانه فإنه كما رواه أحمد والنسائي من طريق أنس عنه ورواه أحمد وأبو داود من حديث سليمان بن صرد عنه ورواه أحمد عن عفان عن حماد عن حميد عن أنس عن عبادة بن الصامت عنه ورواه أحمد ومسلم وأبو داود والنسائي من حديث إسماعيل بن أبي خالد عن عبد الله بن عيسى عن عبد الرحمن بن أبي ليلى عنه - كان قد أنكر على إنسان وهو عبد الله بن مسعود قراءة شيء من القرآن على خلاف ما أقرأه رسول الله صلى الله عليه وسلم فرفعه إلى النبى صلى الله عليه وسلم فاستقرأهما وقال لكل منهم \" أصبت \" قال أبي فأخذني من الشك ولا إذ كنت في الجاهلية فضرب رسول الله صلى الله عليه وسلم في صدره فال أبي ففضت عرقا وكأنما أنظر إلى الله فرقا وأخبره رسول الله صلى الله عليه وسلم أن جبريل أتاه فقال: إن الله يأمرك أن تقرئ أمتك القرآن على حرف فقلت أسأل الله معافاته ومغفرته فقال على حرفين فلم يزل حتى قال إن الله يأمرك أن تقرىء أمتك القرآن على سبعة أحرف كما قدمنا ذكر هذا الحديت بطرقه ولفظه في أول التفسير فلما نزلت هذه السورة الكريمة وفيها \" رسول من الله يتلو صحفا مطهرة ما كتب قيمة \" قرأها عليه رسول الله صلى الله عليه وسلم قراءة إبلاغ وتثبيت وإنذار لا قراءة تعلم واستذكار والله أعلم. وهذا كما أن عمر بن الخطاب لما سأل رسول الله صلى الله عليه وسلم يوم الحديبية عن الأسئلة وكان فيما قال أو لم تكن تخبرنا أنا سنأتي البيت ونطوف به: قال \" بلى أفأخبرتك أنك تأتيه عامك هذا قال لا قال \" فإنك آتيه ومطوف به \". فلما رجعوا من الحديبية وأنزل الله على النبي سورة الفتح دعا عمر بن الخطاب فقرأها عليه وفيها قوله \" لقد صدق الله رسوله الرؤيا بالحق لتدخلن المسجد الحرام إن شاء الله آمنين \" الآية كما تقدم. وروى الحافظ أبو نعيم في كتابه أسماء الصحابة من طريق محمد بن إسماعيل الجعفري المدني حدثنا عبد الله بن سلمة بن أسلم عن ابن شهاب عن إسماعيل بن أبى حكيم المزنى حدثني فضيل سمعت رسول الله صلى الله عليه وسلم يقول \" إن الله ليسمع قراء \" لم يكن الذين كفروا \" فيقول أبشر عبدي فوعزتي لأمكنن لك في الجنة حتى ترضى \" حديث غريب جدا. وقد رواه الحافظ أبو موسى المديني وابن الأثير من طريق الزهري عن إسماعيل بن أبي كلثم عن مطر المزنى - أو المدنى - عن النبي صلى الله عليه وسلم \" إن الله يسمع قراء \" لم يكن الذين كفروا \" ويقول أبشر عبدي فوعزتي لا أنساك على حال من أحوال الدنيا والآخرة ولأمكنن لك في الجنة حتى ترضى \". أما أهل الكتاب فهم اليهود والنصارى والمشركون عبدة الأوثان والنيران من العرب ومن العجم وقال مجاهد لم يكونوا \"منفكين\" يعني منتهين حتى يتبين لهم الحق وهكذا قال قتادة \"حتى تأتيهم البينة\" أي هذا القرآن ولهذا قال تعالى \"لم يكن الذين كفروا من أهل الكتاب والمشركين منفكين حتى تأتيهم البينة\"."
    },
    {
      "ayah": 2,
      "surah": 98,
      "text": "ثم فسر البينة بقوله \"رسول من الله يتلوا صحف مطهرة\" يعني محمدا وما يتلوه من القرآن العظيم الذي هو مكتتب في الملأ الأعلى في صحف مطهرة كقوله \" في صحف مكرمة مرفوعة مطهرة بأيدي سفرة كرام بررة\"."
    },
    {
      "ayah": 3,
      "surah": 98,
      "text": "وقوله تعالى \"فيها كتب قيمة\" قال ابن جرير أى في الصحف المطهرة كتب من كتب الله قيمة عادلة مستقيمة ليس فيها خطأ لأنها من عند الله عز وجل قال قتادة \"رسول من الله يتلوا صحفا مطهرة\" يذكر القرآن بأحسن الذكر وثني عليه بأن الثناء وقال ابن زيد \"فيها كتب قيمة \" مستقيمة معتدلة."
    },
    {
      "ayah": 4,
      "surah": 98,
      "text": "وقوله تعالى \"وما تفرق الذين أوتوا الكتاب إلا من بعدما جاءتهم البينة \" كقوله \"ولا تكونوا كالذين تفرقوا واختلفوا من بعدما جاءهم البينات وأولئك لهم عذاب عظيم\" يعني بذلك أهل الكتب المنزلة على الأمم قبلنا بعدما أقام الله عليهم الحجج والبينات تفرقوا واختلقوا فى الذي أراده الله من كتبهم واختلفوا اختلافا كثيرا كما جاء في الحديث المروي من طرق \"إن اليهود اختلفوا على إحدى وسبعين فرقة وإن النصارى اختلفوا على ثنتين وسبعين فرقة وستفترق هذه الأمة على ثلاث وسبعين فرقة كلها في النار إلا واحدة \" قالوا: ومن هم يا رسول الله صلى الله عليه وسلم؟ قال \"ما أنا عليه وأصحابي\"."
    },
    {
      "ayah": 5,
      "surah": 98,
      "text": "وقوله تعالى \" وما أمروا إلا ليعبدوا الله مخلصين له الدين \" كقوله \" وما أرسلنا من قبلك من رسول إلا نوحي إليه أنه لا إله إلا أنا فاعبدون \" ولهذا قال \" حنفاء \" أي متحنفين عن الشرك إلى التوحيد كقوله \" ولقد بعثنا في كل أمة رسولا أن أعبدوا الله واجتنبوا الطاغوت \" وقد تقدم تقرير الحنيف في سورة الأنعام بما أغنى عن إعادته ههنا \" ويقيموا الصلاة \" وهي أشرف عبادات البدن \" ويؤتوا الزكاة \" وهي الإحسان إلى الفقراء والمحاويج \" وذلك دين القيمة \" أي الملة القائمة العادلة أو الأمة المستقيمة المعتدلة. وقد استدل كثير من الأئمة كالزهري والشافعي بهذه الآية الكريمة على أن الأعمال داخلة في الايمان ولهذا قال \" وما أمروا إلا ليعبدوا الله مخلصين له الدين حنفاء ويقيموا الصلاة ويؤتوا الزكاة وذلك دين القيمة\"."
    },
    {
      "ayah": 6,
      "surah": 98,
      "text": "يخبر تعالى عن مآل الفجار من كفرة أهل الكتاب والمشركين المخالفين لكتب الله المنزلة وأنبياء الله المرسلة أنهم يوم القيامة في نار جهنم خالدين فيها أي ماكثين لا يحولون عنها ولا يزولون \" أولئك هم شر البرية \" أي شر الخليقة التي برأها الله وذرأها."
    },
    {
      "ayah": 7,
      "surah": 98,
      "text": "ثم أخبر تعالى عن الأبرار الذين آمنوا بقلوبهم وعملوا الصالحات بأبدانهم بأنهم خير البرية وقد استدل بهذه الآية أبو هريرة وطائفة من العلماء على تفضيل المؤمنين من البرية على الملائكة لقوله \"أولئك هم خير البرية\"."
    },
    {
      "ayah": 8,
      "surah": 98,
      "text": "ثم قال تعالى \"جزاؤهم عن ربهم\" أي يوم القيامة \" جنات عدن تجري من تحتها الأنهار خالدين فيها أبدا \" أي بلا انفصال ولا انقضاء لا فراغ \"رضي الله عنهم ورضوا عنه\" ومقام رضاه عنهم أعلى مما أوتوه من النعيم المقيم \" ورضوا عنه \" فيما منحهم من الفضل العميم. وقوله تعالى \" ذلك لمن خشي ربه \" أي هذا الجزاء حاصل لمن خشي الله واتقاه حق تقواه وعبده كأنه يراه وعلم أنه إن لم يره فإنه يراه. وقال الإمام أحمد حدثنا إسحاق بن عيسى حدثنا أبو معشر عن أبي وهب مولى أبي هريرة عن أبي هريرة قال: قال رسول الله صلى الله عليه وسلم \" ألا أخبركم بخير البرية؟ \" قالوا بلى يا رسول الله صلى الله عليه وسلم قال \" رجل أخذ بنان فرسه في سبيل الله كلما كانت هيعة استوى عليه. ألا أخبركم بخير البرية؟ \" قالوا بلى يا رسول الله صلى الله عليه وسلم قال\" رجل في ثلة من غنمه يقيم الصلاة ويؤتي الزكاة. ألا أخبركم بخير البرية؟ \" قالو بلى قال \" الذي يسأل بالله ولا يعطي به \". آخر تفسير سورة لم يكن ولله الحمد والمنة."
    }
  ]
}
