{
  "ayahs": [
    {
      "ayah": 1,
      "surah": 99,
      "text": "سورة الزلزلة:: وقال الترمذي حدثنا محمد بن موسى الجويني البصري حدثنا الحسن بن مسلم العجلي حدثنا ثابت قال الإمام أحمد حدثنا أبو عبدالرحمن حدثنا سعيد حدثنا عياش بن عباس عن عيسى بن هلال الصدفي عن عبدالله بن عمرو قال: أتى رجل إلى رسول الله صلى الله عليه وسلم فقال أقرئني يا رسول الله صلى الله عليه وسلم قال له اقرأ ثلاثا من ذوات الراء\" فقال له الرجل كبر سني واشتد قلبي وغلظ لسانى. قال \"فاقرأ من ذوات حم\" فقال مثل مقالته الأولى فقال \"اقرأ ثلاثا من المسبحات\" فقال مثل مقالته فقال الرجل ولكن أقرئني يا رسول الله صلى الله عليه وسلم سورة جامعة فأقرأه\" إذا زلزلت الأرض زلزالها \"حتى إذا فرغ منها قال الرجل والذي بعثك بالحق نبيا لا أزيد عليها أبدا ثم أدبر الرجل فقال رسول الله صلى الله عليه وسلم \"أفلح الرويجل أفلح الرويجل - ثم قال- علي به - فجاءه فقال له - أمرت بيوم الأضحى جعله الله عيدا لهذه الأمة\"فقال له الرجل أرأيت إن لم أجد إلا منيحة أنثى فأضحي بها؟ قال لا ولكنك تأخذ من شعرك وتقلم أظفارك وتقص شاربك وتحلق عانتك فذاك تمام أضحينك عند الله عز وجل\" وأخرجه أبو داود والنسائي من حديث أبي عبدالرحمن المقري به. وقال الترمذي حدثنا محمد بن موسى الجهني البصري حدثنا الحسن بن مسلم بن صال العجلي حدثنا ثابت البناني عن أنس قال: قال رسول الله صلى الله عليه وسلم \"من قرأ \"فإذا زلزلت\" عدلت له بنصف القرآن\" ثم قال هذا حديث غريب لا نعرفه إلا من حديث الحسن بن مسلم وقد رواه البزار عن محمد بن موسى الجويني عن الحسن بن مسلم عن ثابت عن أنس قال: قال رسول الله صلى الله عليه وسلم \"قل هو الله أحد تعدل ثلث القرآن وإذا زلزلت تعدل ربع القرآن\"هذا لفظه وقال الترمذي أيضا حدثنا علي بن حجر حدثنا يزيد بن هارون حدثنا يمان بن المغيرة العنزي حدثنا عطاء عن ابن عباس قال: قال رسول الله صلى الله عليه وسلم \"إذا زلزلت تعدل نصف القرآن وقل هو الله أحد تعدل ثلث القرآن وقل يا أيها الكافرون تعدل ربع القرآن\" ثم قال غريب لا نعرفه إلا من حديث يمان بن المغيرة. وقال أيضا حدثنا عقبة بن مكرم العمي البصري حدثني ابن أبي فديك أخبرني سلمة بن وردان عن أنس بن مالك أن رسول الله صلى الله عليه وسلم قال لرجل من أصحابه \"هل تزوجت يا فلان\" قال لا والله يا رسول الله صلى الله عليه وسلم ولا عندي ما أتزوج؟ قال \"أليس معك قل هو الله أحد؟ - قال بلى قال - ثلث القرآن - قال أليس معك إذا جاء نصر الله والفتح؟ - قال بلى قال ربع القرآن - قال - أليس معك قل يا أيها الكافرون؟ - قال بلى قال - ربع القرآن - قال - أليس معك إذا زلزلت الأرض - قال بلى قال - ربع القرآن تزوج\" ثم قال هذا حديث حسن تفرد بهن ثلاثتهن لم يروهن غيره من أصحاب الكتب. قال ابن عباس أى تحركت من أسفلها."
    },
    {
      "ayah": 2,
      "surah": 99,
      "text": "يعني ألقت ما فيها من الموتى قاله غير واحد من السلف وهذه كقوله تعالى \"يا أيها الناس اتقوا ربكم إن زلزلة الساعة شيء عظيم وكقوله \"وكقوله\"وإذا الأرض مدت وألقت ما فيها وتخلت\" وقال مسلم في صحيحه حدثنا واصل بن عبد الأعلى حدثنا محمد بن فضيل عن أبيه عن أبي حازم عن أبي هريرة قال: قال رسول الله صلى الله عليه وسلم \"تلقي الأرض أفلاذ كبدها أمثال الأسطوان من الذهب والفضة فيجيء القاتل فيقول في هذا قتلت ويجيئ القاطع فيقول في هذا قطعت رحمي ويجئ السارق فيقول في هذا قطعت يدي ثم يدعونه فلا يأخذون منه شيئا\"."
    },
    {
      "ayah": 3,
      "surah": 99,
      "text": "أي استنكر أمرها بعدما كانت قارة ساكنة ثابتة وهو مستقر على ظهرها أي تقلبت الحال فصارت متحركة مضطربة قد جاءها من أمر الله تعالى ما قد أعده لها من الزلزال الذي لا محيد لها عنه ثم ألقت ما في بطنها من الأموات من الأولين والآخرين وحينئذ استنكر الناس أمرها وتبدل الأرض غير الأرض والسموات وبرزوا لله الواحد القهار."
    },
    {
      "ayah": 4,
      "surah": 99,
      "text": "أي تحدث بما عمل العاملون على ظهرها. وقال الإمام أحمد حدثنا إبراهيم حدثنا ابن المبارك وقال الترمذي وأبو عبدالرحمن النسائي واللفظ له حدثنا سويد بن نصر أخبرنا عبدالله هو ابن المبارك عن سعيد بن أبي أيوب عن يحيى بن أبي سليمان عن سعيد المقبري عن أبي هريرة قال: قرأ رسول الله صلى الله عليه وسلم هذه الآية \"يومئذ تحدث أخبارها\" قال \"أتدرون ما أخبارها؟\" قالوا الله ورسوله أعلم. قال \"فإن أخبارها\" أن تشهد على كل عبد أو أمة بما عمل على ظهرها أن تقول عمل كذا وكذا يوم كذا فهذه أخبارها\" ثم قال الترمذي هذا حديث حسن صحيح غريب وفي معجم الطبراني من حديث ابن لهيعة حدثني الحارث بن يزيد سمع ربيعة الحدسي أن رسول الله صلى الله عليه وسلم قال \"تحفظوا من الأرض فإنها أمكم وإنه ليس من أحد عامل عليها خيرا أو شرا إلا وهي مخبرة\"."
    },
    {
      "ayah": 5,
      "surah": 99,
      "text": "قال البخاري أوحى لها وأوعى إليها ووحى لها ووحى إليها واحد وكذا قال ابن عباس أوحى لها أي أوحى إليها والظاهر أن هذا مضمن بمعنى أذن لها. وقال شبيب بن بشر عن عكرمة عن ابن عباس \"يومئذ تحدث أخبارها\" قال: قال لها ربها قولي فقالت وقال مجاهد أوحى لها أي أمرها وقال القرطبي أمرها أن تنسق عنهم."
    },
    {
      "ayah": 6,
      "surah": 99,
      "text": "أي يرجعون عن موقف الحساب أشتاتا أي أنواع وأصنافا ما بين شقي وسعيد مأمور به إلى الجنة ومأمور به إلى النار وقال ابن جريج: يتصدعون أشتاتا فلا يجتمعون آخر ما عليهم وقال السدي أشتاتا فرقا. وقوله تعالى \"ليروا أعمالهم\" أي ليعملوا ويجازوا بما عملوه في الدنيا من خير وشر."
    },
    {
      "ayah": 7,
      "surah": 99,
      "text": "قال البخاري حدثنا إسماعيل بن عبدالله حدثني مالك عن زيد بن أسلم عن أبي صالح السمان عن أبي هريرة أن رسول الله صلى الله عليه وسلم قال \"الخيل لثلاثة: لرجل أجر ولرجل ستر وعلى رجل وزر فأما الذي له أجر فرجل ربطها في سبيل الله فأطال طيلها في مرج أو روضة فما أصابت في طيلها ذلك في المرج والروضة كان له حسنات ولو أنها قطعت طيلها فاستنت شرفا أو شرفين كان آثارها وأرواثها حسنات له ولو أنها مرت بنهر فشربت منه ولم يرد أن تسقي به كان ذلك حسنات له وهي لذلك الرجل أجر. ورجل ربطها تغنيا وتعففا ولم ينس حق الله في رقابها ولا ظهورها فهي له ستر ورجل ربطها فخرا ورياء ونواء فهي على ذلك وزر\" فسئل رسول الله صلى الله عليه وسلم عن الحمر فقال \"ما أنزل الله شيئا إلا هذه الآية الفاذة الجامعة \"فمن يعمل مثقال ذرة خيرا يره ومن يعمل مثقال ذرة شرا يره\" ورواه مسلم من حديث زيد بن أسلم به. وقال الإمام أحمد حدثنا يزيد بن هارون أخبرنا جرير بن حازم حدثنا الحسن عن صعصعة بن معاوية عم الفرزدق أنه أتى النبي صلى الله عليه وسلم فقرأ عليه \"فمن يعمل مثقال ذرة خيرا يره ومن يعمل مثقال ذرة شرا يره\" قال: حسبي لا أبالي أن لا أسمع غيرها. وهكذا رواه النسائي في التفسير عن إبراهيم بن محمد بن يونس المؤدب عن أبيه عن جرير بن حازم عن الحسن البصري قال حدثنا صعصعة عم الفرزدق فذكره. وفي صحيح البخاري عن عدي مرفوعا \"اتقوا النار ولو بشق تمرة ولو بكلمة طيبة\" وله أيضا في الصحيح \"لا تحقرن من المعروف شيئا ولو أن سرغ من دلوك في إناء المستسقى ولو أن تلقى أخاك ووجهك إليه منبسط \" وفي الصحيح أيضا \"يا معشر نساء المؤمنات لا تحقرن جارة لجارتها ولو فرسن شاة \"يعني ظلفها وفي الحديث الآخر \"ردوا السائل ولو بظلف محرق\" وقال الإمام أحمد: حدثنا محمد بن عبدالله الأنصاري حدثنا كثير بن زيد عن المطلب بن عبدالله عن عائشة أن رسول الله قال \"يا عائشة استتري من النار ولو بشق تمرة فإنها تسد من الجائع مسدها من الشبعان\" تفرد به أحمد. وروي عن عائشة أنها تصدقت بعنبة وقالت كم فيها من مثقال ذرة. وقال الإمام أحمد: حدثنا أبو عامر حدثنا سعيد بن مسلم سمعت عامر بن عبدالله بن الزبير حدثني عوف بن الحارث بن الطفيل أن عائشة أخبرته أن النبي صلى الله عليه وسلم كان يقول \"يا عائشة إياك ومحقرات الذنوب فإن لها من الله طالبا\" ورواه النسائي وابن ماجه من حديث سعيد بن مسلم بن بانك به وقال ابن جريج حدثني أبو الخطاب الحسانى حدثنا الهيثم بن الربيع حدثنا سماك بن عطية عن أيوب عن أبي قلابة عن أنس قال: كان أبو بكر يأكل مع النبي صلى الله عليه وسلم فنزلت هذه الآية \"فمن يعمل مثقال ذرة خيرا يره ومن يعمل مثقال ذرة شرا يره\" فرفع أبو بكر يده وقال يا رسول الله صلى الله عليه وسلم إني أجزى بما عملت من مثقال ذرة من شر فقال \" يا أبا بكر ما رأيت في الدنيا مما تكره فبمثاقيل ذر الشر ويدخر الله لك مثاقيل ذر الخير حتى توفاه يوم القيامة \" ورواه ابن أبي حاتم عن أبيه عن أبي الخطاب به. ثم قال ابن جرير حدثنا ابن بشار حدثنا عبد الوهاب حدثنا أيوب قال في كتاب أبي قلابة عن أبي إدريس أن أبا بكر كان يأكل مع النبي صلى اليه وسلم فذكره ورواه أيضا عن يعقوب عن ابن عليه عن أيوب عن أبي قلابة أن أبا بكر وذكره \"طريق أخرى\" قال ابن جرير حدثني يونس بن عبد الأعلى أخبرنا ابن وهب أخبرني دحي بن عبدالله عن أبي عبدالرحمن الحبلي عن عبدالله بن عمرو بن العاص أنه قال: لما نزلت \" إذا زلزلت الأرض زلزالها \" وأبو بكر الصديق رضي الله عنه قاعد فبكى حين أنزلت فقال له رسول الله صلى الله عليه وسلم: \" ما يبكيك يا أبا بكر\" قال: يبكيني هذه السورة فقال له رسول الله صلى الله عليه وسلم: \" لولا أنكم تخطئون وتذنبون فيغفر الله لكم لخلق الله أما يخطئون ويذنبون فيغفر لهم \" \"حديث آخر\" قال ابن أبي حاتم حدثنا أبو زرعة وعلي بن عبدالرحمن بن المغيرة المعروف بعلان المصري قالا حدثنا عمرو بن خالد الحراني حدثنا ابن لهيعة أخبرني هشام بن سعد عن زيد بن أسلم عن عطاء بن يسار عن أبي سعيد الخدري قال: لما أنزلت \" فمن يعمل مثقال ذرة خيرا يره ومن يعمل مثقال ذرة شرا يره \" قلت يا رسول الله إنيد لراء عملي؟ قال \" نعم \" قلت تلك الكبار الكبار؟ قال \" نعم \" قلت الصغار الصغار؟ قال \" نعم \" قلت واثكل أمي قال \" أبشر يا أبا سعيد فإن الحسنة بعشر أمثالها - يعني إلى سبعمائة ضعف - ويضاعف الله لمن يشاء والسيئة بمثلها أو بعفو الله ولن ينجو أحد منكم بعمله \" قلت ولا أنت يا رسول الله صلى الله عليه وسلم؟ قال \" ولا أنا إلا أن يتغمدني الله منه برحمة \" قال أبو زرعة لم يرو هذا غير ابن لهيعة: وقال ابن أبي حاتم حدثنا أبو زرعة حدثنا يحيى بن عبدالله بن بكر حدثنى ابن لهيعة حدثني عطاء بن دينار عن سعيد بن جبير في قول الله تعالى \" فمن يعمل مثقال ذرة خيرا يره ومن يعمل مثقال ذرة شرا يره \" وذلك لما نزلت هذه الآية \" ويطعمون الطعام على حبه مسكينا ويتيما وأسيرا \" كان المسلمون يرون أنهم لا يؤجرون على الشيء القليل إذا أعطوه فيجئ المسكين إلى أبوابهم فيستقلون أن يعطوه التمرة والكسرة والجوزة ونحو ذلك فيردونه ويقولون ما هذا بشيء إنما نؤجر على ما نعطي ونحن نحبه وكان آخرون يرون أنهم لا يلامون على الذنب اليسير: الكذبة والنظرة والغيبة وأشباه ذلك يقولون إنما وعد الله النار على الكبائر فرغبهم في القليل من الخير أن يعملوه فإنه يوشك أن يكثر وحذرهم اليسير من الشر فإنه يوشك أن يكثر فنزلت \" فمن يعمل مثقال ذرة \" يعني وزن أصغر النمل \" خيرا يره \" يعني في كتابه ويسره ذلك قال يكتب لكل بر وفاجر وبكل سيئة سيئة واحدة وبكل حسنة عشر حسنات فإذا كان يوم القيامة ضاعف الله حسنات المؤمنين أيضا بكل واحد عشرا ويمحو عنه بكل حسنة عشر سيئات فمن زادت حسناته على سيئاته مثقال ذرة دخل الجنة وقال الإمام أحمد حدثنا سليمان بن داود حدثنا عمران عن قتادة عن عبد ربه عن أبي عياض عن عبدالله بن مسعود أن رسول الله قال \" إياكم ومحقرات الذنوب فإنهن يجتمعن على الرجل حتى يهلكنه \" وإن رسول الله صلى الله عليه وسلم ضرب لهن مثلا كمثل قوم نزلوا أرض فلاة فحضر صنيع القوم فجعل الرجل منطلق يجيء بالعود والرجل يجيء بالعود حتى جمعوا سوادا وأججوا نارا وأنضجوا ما قذفوا فيها. آخر تفسير سورة إذا زلزلت ولله الحمد والمنة."
    },
    {
      "ayah": 8,
      "surah": 99,
      "text": "قال البخاري حدثنا إسماعيل بن عبدالله حدثني مالك عن زيد بن أسلم عن أبي صالح السمان عن أبي هريرة أن رسول الله صلى الله عليه وسلم قال \"الخيل لثلاثة: لرجل أجر ولرجل ستر وعلى رجل وزر فأما الذي له أجر فرجل ربطها في سبيل الله فأطال طيلها في مرج أو روضة فما أصابت في طيلها ذلك في المرج والروضة كان له حسنات ولو أنها قطعت طيلها فاستنت شرفا أو شرفين كان آثارها وأرواثها حسنات له ولو أنها مرت بنهر فشربت منه ولم يرد أن تسقي به كان ذلك حسنات له وهي لذلك الرجل أجر. ورجل ربطها تغنيا وتعففا ولم ينس حق الله في رقابها ولا ظهورها فهي له ستر ورجل ربطها فخرا ورياء ونواء فهي على ذلك وزر\" فسئل رسول الله صلى الله عليه وسلم عن الحمر فقال \"ما أنزل الله شيئا إلا هذه الآية الفاذة الجامعة \"فمن يعمل مثقال ذرة خيرا يره ومن يعمل مثقال ذرة شرا يره\" ورواه مسلم من حديث زيد بن أسلم به. وقال الإمام أحمد حدثنا يزيد بن هارون أخبرنا جرير بن حازم حدثنا الحسن عن صعصعة بن معاوية عم الفرزدق أنه أتى النبي صلى الله عليه وسلم فقرأ عليه \"فمن يعمل مثقال ذرة خيرا يره ومن يعمل مثقال ذرة شرا يره\" قال: حسبي لا أبالي أن لا أسمع غيرها. وهكذا رواه النسائي في التفسير عن إبراهيم بن محمد بن يونس المؤدب عن أبيه عن جرير بن حازم عن الحسن البصري قال حدثنا صعصعة عم الفرزدق فذكره. وفي صحيح البخاري عن عدي مرفوعا \"اتقوا النار ولو بشق تمرة ولو بكلمة طيبة\" وله أيضا في الصحيح \"لا تحقرن من المعروف شيئا ولو أن سرغ من دلوك في إناء المستسقى ولو أن تلقى أخاك ووجهك إليه منبسط \" وفي الصحيح أيضا \"يا معشر نساء المؤمنات لا تحقرن جارة لجارتها ولو فرسن شاة \"يعني ظلفها وفي الحديث الآخر \"ردوا السائل ولو بظلف محرق\" وقال الإمام أحمد: حدثنا محمد بن عبدالله الأنصاري حدثنا كثير بن زيد عن المطلب بن عبدالله عن عائشة أن رسول الله قال \"يا عائشة استتري من النار ولو بشق تمرة فإنها تسد من الجائع مسدها من الشبعان\" تفرد به أحمد. وروي عن عائشة أنها تصدقت بعنبة وقالت كم فيها من مثقال ذرة. وقال الإمام أحمد: حدثنا أبو عامر حدثنا سعيد بن مسلم سمعت عامر بن عبدالله بن الزبير حدثني عوف بن الحارث بن الطفيل أن عائشة أخبرته أن النبي صلى الله عليه وسلم كان يقول \"يا عائشة إياك ومحقرات الذنوب فإن لها من الله طالبا\" ورواه النسائي وابن ماجه من حديث سعيد بن مسلم بن بانك به وقال ابن جريج حدثني أبو الخطاب الحسانى حدثنا الهيثم بن الربيع حدثنا سماك بن عطية عن أيوب عن أبي قلابة عن أنس قال: كان أبو بكر يأكل مع النبي صلى الله عليه وسلم فنزلت هذه الآية \"فمن يعمل مثقال ذرة خيرا يره ومن يعمل مثقال ذرة شرا يره\" فرفع أبو بكر يده وقال يا رسول الله صلى الله عليه وسلم إني أجزى بما عملت من مثقال ذرة من شر فقال \" يا أبا بكر ما رأيت في الدنيا مما تكره فبمثاقيل ذر الشر ويدخر الله لك مثاقيل ذر الخير حتى توفاه يوم القيامة \" ورواه ابن أبي حاتم عن أبيه عن أبي الخطاب به. ثم قال ابن جرير حدثنا ابن بشار حدثنا عبد الوهاب حدثنا أيوب قال في كتاب أبي قلابة عن أبي إدريس أن أبا بكر كان يأكل مع النبي صلى اليه وسلم فذكره ورواه أيضا عن يعقوب عن ابن عليه عن أيوب عن أبي قلابة أن أبا بكر وذكره \"طريق أخرى\" قال ابن جرير حدثني يونس بن عبد الأعلى أخبرنا ابن وهب أخبرني دحي بن عبدالله عن أبي عبدالرحمن الحبلي عن عبدالله بن عمرو بن العاص أنه قال: لما نزلت \" إذا زلزلت الأرض زلزالها \" وأبو بكر الصديق رضي الله عنه قاعد فبكى حين أنزلت فقال له رسول الله صلى الله عليه وسلم: \" ما يبكيك يا أبا بكر\" قال: يبكيني هذه السورة فقال له رسول الله صلى الله عليه وسلم: \" لولا أنكم تخطئون وتذنبون فيغفر الله لكم لخلق الله أما يخطئون ويذنبون فيغفر لهم \" \"حديث آخر\" قال ابن أبي حاتم حدثنا أبو زرعة وعلي بن عبدالرحمن بن المغيرة المعروف بعلان المصري قالا حدثنا عمرو بن خالد الحراني حدثنا ابن لهيعة أخبرني هشام بن سعد عن زيد بن أسلم عن عطاء بن يسار عن أبي سعيد الخدري قال: لما أنزلت \" فمن يعمل مثقال ذرة خيرا يره ومن يعمل مثقال ذرة شرا يره \" قلت يا رسول الله إنيد لراء عملي؟ قال \" نعم \" فلت تلك الكبار الكبار؟ قال \" نعم \" قلت الصغار الصغار؟ قال \" نعم \" قلت واثكل أمي قال \" أبشر يا أبا سعيد فإن الحسنة بعشر أمثالها - يعني إلى سبعمائة ضعف - ويضاعف الله لمن يشاء والسيئة بمثلها أو بعفو الله ولن ينجو أحد منكم بعمله \" قلت ولا أنت يا رسول الله صلى الله عليه وسلم؟ قال \" ولا أنا إلا أن يتغمدني الله منه برحمة \" قال أبو زرعة لم يرو هذا غير ابن لهيعة: وقال ابن أبي حاتم حدثنا أبو زرعة حدثنا يحيى بن عبدالله بن بكر حدثنى ابن لهيعة حدثني عطاء بن دينار عن سعيد بن جبير في قول الله تعالى \" فمن يعمل مثقال ذرة خيرا يره ومن يعمل مثقال ذرة شرا يره \" وذلك لما نزلت هذه الآية \" ويطعمون الطعام على حبه مسكينا ويتيما وأسيرا \" كان المسلمون يرون أنهم لا يؤجرون على الشيء القليل إذا أعطوه فيجئ المسكين إلى أبوابهم فيستقلون أن يعطوه التمرة والكسرة والجوزة ونحو ذلك فيردونه ويقولون ما هذا بشيء إنما نؤجر على ما نعطي ونحن نحبه وكان آخرون يرون أنهم لا يلامون على الذنب اليسير: الكذبة والنظرة والغيبة وأشباه ذلك يقولون إنما وعد الله النار على الكبائر فرغبهم في القليل من الخير أن يعملوه فإنه يوشك أن يكثر وحذرهم اليسير من الشر فإنه يوشك أن يكثر فنزلت \" فمن يعمل مثقال ذرة \" يعني وزن أصغر النمل \" خيرا يره \" يعني في كتابه ويسره ذلك قال يكتب لكل بر وفاجر وبكل سيئة سيئة واحدة وبكل حسنة عشر حسنات فإذا كان يوم القيامة ضاعف الله حسنات المؤمنين أيضا بكل واحد عشرا ويمحو عنه بكل حسنة عشر سيئات فمن زادت حسناته على سيئاته مثقال ذرة دخل الجنة وقال الإمام أحمد حدثنا سليمان بن داود حدثنا عمران عن قتادة عن عبد ربه عن أبي عياض عن عبدالله بن مسعود أن رسول الله قال \" إياكم ومحقرات الذنوب فإنهن يجتمعن على الرجل حتى يهلكنه \" وإن رسول الله صلى الله عليه وسلم ضرب لهن مثلا كمثل قوم نزلوا أرض فلاة فحضر صنيع القوم فجعل الرجل منطلق يجيء بالعود والرجل يجيء بالعود حتى جمعوا سوادا وأججوا نارا وأنضجوا ما قذفوا فيها. آخر تفسير سورة إذا زلزلت ولله الحمد والمنة."
    }
  ]
}
