[
    {
        "rakam": 1,
        "ayah": "كهيعص",
        "content": ""
    },
    {
        "rakam": 2,
        "ayah": "ذِكْرُ رَحْمَةِ رَبِّكَ عَبْدَهُ زَكَرِيَّا",
        "content": ""
    },
    {
        "rakam": 3,
        "ayah": "إِذْ نَادَى رَبَّهُ نِدَاء خَفِيّاً",
        "content": ""
    },
    {
        "rakam": 4,
        "ayah": "قَالَ رَبِّ إِنِّي وَهَنَ الْعَظْمُ مِنِّي وَاشْتَعَلَ الرَّأْسُ شَيْباً وَلَمْ أَكُن بِدُعَائِكَ رَبِّ شَقِيّاً",
        "content": ""
    },
    {
        "rakam": 5,
        "ayah": "وَإِنِّي خِفْتُ الْمَوَالِيَ مِن وَرَائِي وَكَانَتِ امْرَأَتِي عَاقِراً فَهَبْ لِي مِن لَّدُنكَ وَلِيّاً",
        "content": ""
    },
    {
        "rakam": 6,
        "ayah": "يَرِثُنِي وَيَرِثُ مِنْ آلِ يَعْقُوبَ وَاجْعَلْهُ رَبِّ رَضِيّاً",
        "content": ""
    },
    {
        "rakam": 7,
        "ayah": "يَا زَكَرِيَّا إِنَّا نُبَشِّرُكَ بِغُلَامٍ اسْمُهُ يَحْيَى لَمْ نَجْعَل لَّهُ مِن قَبْلُ سَمِيّاً",
        "content": ""
    },
    {
        "rakam": 8,
        "ayah": "قَالَ رَبِّ أَنَّى يَكُونُ لِي غُلَامٌ وَكَانَتِ امْرَأَتِي عَاقِراً وَقَدْ بَلَغْتُ مِنَ الْكِبَرِ عِتِيّاً",
        "content": ""
    },
    {
        "rakam": 9,
        "ayah": "قَالَ كَذَلِكَ قَالَ رَبُّكَ هُوَ عَلَيَّ هَيِّنٌ وَقَدْ خَلَقْتُكَ مِن قَبْلُ وَلَمْ تَكُ شَيْئاً",
        "content": ""
    },
    {
        "rakam": 10,
        "ayah": "قَالَ رَبِّ اجْعَل لِّي آيَةً قَالَ آيَتُكَ أَلَّا تُكَلِّمَ النَّاسَ ثَلَاثَ لَيَالٍ سَوِيّاً",
        "content": ""
    },
    {
        "rakam": 11,
        "ayah": "فَخَرَجَ عَلَى قَوْمِهِ مِنَ الْمِحْرَابِ فَأَوْحَى إِلَيْهِمْ أَن سَبِّحُوا بُكْرَةً وَعَشِيّاً",
        "content": ""
    },
    {
        "rakam": 12,
        "ayah": "يَا يَحْيَى خُذِ الْكِتَابَ بِقُوَّةٍ وَآتَيْنَاهُ الْحُكْمَ صَبِيّاً",
        "content": ""
    },
    {
        "rakam": 13,
        "ayah": "وَحَنَاناً مِّن لَّدُنَّا وَزَكَاةً وَكَانَ تَقِيّاً",
        "content": ""
    },
    {
        "rakam": 14,
        "ayah": "وَبَرّاً بِوَالِدَيْهِ وَلَمْ يَكُن جَبَّاراً عَصِيّاً",
        "content": ""
    },
    {
        "rakam": 15,
        "ayah": "وَسَلَامٌ عَلَيْهِ يَوْمَ وُلِدَ وَيَوْمَ يَمُوتُ وَيَوْمَ يُبْعَثُ حَيّاً",
        "content": ""
    },
    {
        "rakam": 16,
        "ayah": "وَاذْكُرْ فِي الْكِتَابِ مَرْيَمَ إِذِ انتَبَذَتْ مِنْ أَهْلِهَا مَكَاناً شَرْقِيّاً",
        "content": ""
    },
    {
        "rakam": 17,
        "ayah": "فَاتَّخَذَتْ مِن دُونِهِمْ حِجَاباً فَأَرْسَلْنَا إِلَيْهَا رُوحَنَا فَتَمَثَّلَ لَهَا بَشَراً سَوِيّاً",
        "content": ""
    },
    {
        "rakam": 18,
        "ayah": "قَالَتْ إِنِّي أَعُوذُ بِالرَّحْمَن مِنكَ إِن كُنتَ تَقِيّاً",
        "content": ""
    },
    {
        "rakam": 19,
        "ayah": "قَالَ إِنَّمَا أَنَا رَسُولُ رَبِّكِ لِأَهَبَ لَكِ غُلَاماً زَكِيّاً",
        "content": ""
    },
    {
        "rakam": 20,
        "ayah": "قَالَتْ أَنَّى يَكُونُ لِي غُلَامٌ وَلَمْ يَمْسَسْنِي بَشَرٌ وَلَمْ أَكُ بَغِيّاً",
        "content": ""
    },
    {
        "rakam": 21,
        "ayah": "قَالَ كَذَلِكِ قَالَ رَبُّكِ هُوَ عَلَيَّ هَيِّنٌ وَلِنَجْعَلَهُ آيَةً لِلنَّاسِ وَرَحْمَةً مِّنَّا وَكَانَ أَمْراً مَّقْضِيّاً",
        "content": ""
    },
    {
        "rakam": 22,
        "ayah": "فَحَمَلَتْهُ فَانتَبَذَتْ بِهِ مَكَاناً قَصِيّاً",
        "content": ""
    },
    {
        "rakam": 23,
        "ayah": "فَأَجَاءهَا الْمَخَاضُ إِلَى جِذْعِ النَّخْلَةِ قَالَتْ يَا لَيْتَنِي مِتُّ قَبْلَ هَذَا وَكُنتُ نَسْياً مَّنسِيّاً",
        "content": ""
    },
    {
        "rakam": 24,
        "ayah": "فَنَادَاهَا مِن تَحْتِهَا أَلَّا تَحْزَنِي قَدْ جَعَلَ رَبُّكِ تَحْتَكِ سَرِيّاً",
        "content": ""
    },
    {
        "rakam": 25,
        "ayah": "وَهُزِّي إِلَيْكِ بِجِذْعِ النَّخْلَةِ تُسَاقِطْ عَلَيْكِ رُطَباً جَنِيّاً",
        "content": ""
    },
    {
        "rakam": 26,
        "ayah": "فَكُلِي وَاشْرَبِي وَقَرِّي عَيْناً فَإِمَّا تَرَيِنَّ مِنَ الْبَشَرِ أَحَداً فَقُولِي إِنِّي نَذَرْتُ لِلرَّحْمَنِ صَوْماً فَلَنْ أُكَلِّمَ الْيَوْمَ إِنسِيّاً",
        "content": ""
    },
    {
        "rakam": 27,
        "ayah": "فَأَتَتْ بِهِ قَوْمَهَا تَحْمِلُهُ قَالُوا يَا مَرْيَمُ لَقَدْ جِئْتِ شَيْئاً فَرِيّاً",
        "content": ""
    },
    {
        "rakam": 28,
        "ayah": "يَا أُخْتَ هَارُونَ مَا كَانَ أَبُوكِ امْرَأَ سَوْءٍ وَمَا كَانَتْ أُمُّكِ بَغِيّاً",
        "content": ""
    },
    {
        "rakam": 29,
        "ayah": "فَأَشَارَتْ إِلَيْهِ قَالُوا كَيْفَ نُكَلِّمُ مَن كَانَ فِي الْمَهْدِ صَبِيّاً",
        "content": ""
    },
    {
        "rakam": 30,
        "ayah": "قَالَ إِنِّي عَبْدُ اللَّهِ آتَانِيَ الْكِتَابَ وَجَعَلَنِي نَبِيّاً",
        "content": ""
    },
    {
        "rakam": 31,
        "ayah": "وَجَعَلَنِي مُبَارَكاً أَيْنَ مَا كُنتُ وَأَوْصَانِي بِالصَّلَاةِ وَالزَّكَاةِ مَا دُمْتُ حَيّاً",
        "content": ""
    },
    {
        "rakam": 32,
        "ayah": "وَبَرّاً بِوَالِدَتِي وَلَمْ يَجْعَلْنِي جَبَّاراً شَقِيّاً",
        "content": ""
    },
    {
        "rakam": 33,
        "ayah": "وَالسَّلَامُ عَلَيَّ يَوْمَ وُلِدتُّ وَيَوْمَ أَمُوتُ وَيَوْمَ أُبْعَثُ حَيّاً",
        "content": ""
    },
    {
        "rakam": 34,
        "ayah": "ذَلِكَ عِيسَى ابْنُ مَرْيَمَ قَوْلَ الْحَقِّ الَّذِي فِيهِ يَمْتَرُونَ",
        "content": ""
    },
    {
        "rakam": 35,
        "ayah": "مَا كَانَ لِلَّهِ أَن يَتَّخِذَ مِن وَلَدٍ سُبْحَانَهُ إِذَا قَضَى أَمْراً فَإِنَّمَا يَقُولُ لَهُ كُن فَيَكُونُ",
        "content": ""
    },
    {
        "rakam": 36,
        "ayah": "وَإِنَّ اللَّهَ رَبِّي وَرَبُّكُمْ فَاعْبُدُوهُ هَذَا صِرَاطٌ مُّسْتَقِيمٌ",
        "content": ""
    },
    {
        "rakam": 37,
        "ayah": "فَاخْتَلَفَ الْأَحْزَابُ مِن بَيْنِهِمْ فَوَيْلٌ لِّلَّذِينَ كَفَرُوا مِن مَّشْهَدِ يَوْمٍ عَظِيمٍ",
        "content": ""
    },
    {
        "rakam": 38,
        "ayah": "أَسْمِعْ بِهِمْ وَأَبْصِرْ يَوْمَ يَأْتُونَنَا لَكِنِ الظَّالِمُونَ الْيَوْمَ فِي ضَلَالٍ مُّبِينٍ",
        "content": ""
    },
    {
        "rakam": 39,
        "ayah": "وَأَنذِرْهُمْ يَوْمَ الْحَسْرَةِ إِذْ قُضِيَ الْأَمْرُ وَهُمْ فِي غَفْلَةٍ وَهُمْ لَا يُؤْمِنُونَ",
        "content": ""
    },
    {
        "rakam": 40,
        "ayah": "إِنَّا نَحْنُ نَرِثُ الْأَرْضَ وَمَنْ عَلَيْهَا وَإِلَيْنَا يُرْجَعُونَ",
        "content": ""
    },
    {
        "rakam": 41,
        "ayah": "وَاذْكُرْ فِي الْكِتَابِ إِبْرَاهِيمَ إِنَّهُ كَانَ صِدِّيقاً نَّبِيّاً",
        "content": ""
    },
    {
        "rakam": 42,
        "ayah": "إِذْ قَالَ لِأَبِيهِ يَا أَبَتِ لِمَ تَعْبُدُ مَا لَا يَسْمَعُ وَلَا يُبْصِرُ وَلَا يُغْنِي عَنكَ شَيْئاً",
        "content": ""
    },
    {
        "rakam": 43,
        "ayah": "يَا أَبَتِ إِنِّي قَدْ جَاءنِي مِنَ الْعِلْمِ مَا لَمْ يَأْتِكَ فَاتَّبِعْنِي أَهْدِكَ صِرَاطاً سَوِيّاً",
        "content": ""
    },
    {
        "rakam": 44,
        "ayah": "يَا أَبَتِ لَا تَعْبُدِ الشَّيْطَانَ إِنَّ الشَّيْطَانَ كَانَ لِلرَّحْمَنِ عَصِيّاً",
        "content": ""
    },
    {
        "rakam": 45,
        "ayah": "يَا أَبَتِ إِنِّي أَخَافُ أَن يَمَسَّكَ عَذَابٌ مِّنَ الرَّحْمَن فَتَكُونَ لِلشَّيْطَانِ وَلِيّاً",
        "content": ""
    },
    {
        "rakam": 46,
        "ayah": "قَالَ أَرَاغِبٌ أَنتَ عَنْ آلِهَتِي يَا إِبْراهِيمُ لَئِن لَّمْ تَنتَهِ لَأَرْجُمَنَّكَ وَاهْجُرْنِي مَلِيّاً",
        "content": ""
    },
    {
        "rakam": 47,
        "ayah": "قَالَ سَلَامٌ عَلَيْكَ سَأَسْتَغْفِرُ لَكَ رَبِّي إِنَّهُ كَانَ بِي حَفِيّاً",
        "content": ""
    },
    {
        "rakam": 48,
        "ayah": "وَأَعْتَزِلُكُمْ وَمَا تَدْعُونَ مِن دُونِ اللَّهِ وَأَدْعُو رَبِّي عَسَى أَلَّا أَكُونَ بِدُعَاء رَبِّي شَقِيّاً",
        "content": ""
    },
    {
        "rakam": 49,
        "ayah": "فَلَمَّا اعْتَزَلَهُمْ وَمَا يَعْبُدُونَ مِن دُونِ اللَّهِ وَهَبْنَا لَهُ إِسْحَاقَ وَيَعْقُوبَ وَكُلّاً جَعَلْنَا نَبِيّاً",
        "content": ""
    },
    {
        "rakam": 50,
        "ayah": "وَوَهَبْنَا لَهُم مِّن رَّحْمَتِنَا وَجَعَلْنَا لَهُمْ لِسَانَ صِدْقٍ عَلِيّاً",
        "content": ""
    },
    {
        "rakam": 51,
        "ayah": "وَاذْكُرْ فِي الْكِتَابِ مُوسَى إِنَّهُ كَانَ مُخْلَصاً وَكَانَ رَسُولاً نَّبِيّاً",
        "content": ""
    },
    {
        "rakam": 52,
        "ayah": "وَنَادَيْنَاهُ مِن جَانِبِ الطُّورِ الْأَيْمَنِ وَقَرَّبْنَاهُ نَجِيّاً",
        "content": ""
    },
    {
        "rakam": 53,
        "ayah": "وَوَهَبْنَا لَهُ مِن رَّحْمَتِنَا أَخَاهُ هَارُونَ نَبِيّاً",
        "content": ""
    },
    {
        "rakam": 54,
        "ayah": "وَاذْكُرْ فِي الْكِتَابِ إِسْمَاعِيلَ إِنَّهُ كَانَ صَادِقَ الْوَعْدِ وَكَانَ رَسُولاً نَّبِيّاً",
        "content": ""
    },
    {
        "rakam": 55,
        "ayah": "وَكَانَ يَأْمُرُ أَهْلَهُ بِالصَّلَاةِ وَالزَّكَاةِ وَكَانَ عِندَ رَبِّهِ مَرْضِيّاً",
        "content": ""
    },
    {
        "rakam": 56,
        "ayah": "وَاذْكُرْ فِي الْكِتَابِ إِدْرِيسَ إِنَّهُ كَانَ صِدِّيقاً نَّبِيّاً",
        "content": ""
    },
    {
        "rakam": 57,
        "ayah": "وَرَفَعْنَاهُ مَكَاناً عَلِيّاً",
        "content": ""
    },
    {
        "rakam": 58,
        "ayah": "أُوْلَئِكَ الَّذِينَ أَنْعَمَ اللَّهُ عَلَيْهِم مِّنَ النَّبِيِّينَ مِن ذُرِّيَّةِ آدَمَ وَمِمَّنْ حَمَلْنَا مَعَ نُوحٍ وَمِن ذُرِّيَّةِ إِبْرَاهِيمَ وَإِسْرَائِيلَ وَمِمَّنْ هَدَيْنَا وَاجْتَبَيْنَا إِذَا تُتْلَى عَلَيْهِمْ آيَاتُ الرَّحْمَن خَرُّوا سُجَّداً وَبُكِيّاً",
        "content": ""
    },
    {
        "rakam": 59,
        "ayah": "فَخَلَفَ مِن بَعْدِهِمْ خَلْفٌ أَضَاعُوا الصَّلَاةَ وَاتَّبَعُوا الشَّهَوَاتِ فَسَوْفَ يَلْقَوْنَ غَيّاً",
        "content": ""
    },
    {
        "rakam": 60,
        "ayah": "إِلَّا مَن تَابَ وَآمَنَ وَعَمِلَ صَالِحاً فَأُوْلَئِكَ يَدْخُلُونَ الْجَنَّةَ وَلَا يُظْلَمُونَ شَيْئاً",
        "content": ""
    },
    {
        "rakam": 61,
        "ayah": "جَنَّاتِ عَدْنٍ الَّتِي وَعَدَ الرَّحْمَنُ عِبَادَهُ بِالْغَيْبِ إِنَّهُ كَانَ وَعْدُهُ مَأْتِيّاً",
        "content": ""
    },
    {
        "rakam": 62,
        "ayah": "لَا يَسْمَعُونَ فِيهَا لَغْواً إِلَّا سَلَاماً وَلَهُمْ رِزْقُهُمْ فِيهَا بُكْرَةً وَعَشِيّاً",
        "content": ""
    },
    {
        "rakam": 63,
        "ayah": "تِلْكَ الْجَنَّةُ الَّتِي نُورِثُ مِنْ عِبَادِنَا مَن كَانَ تَقِيّاً",
        "content": ""
    },
    {
        "rakam": 64,
        "ayah": "وَمَا نَتَنَزَّلُ إِلَّا بِأَمْرِ رَبِّكَ لَهُ مَا بَيْنَ أَيْدِينَا وَمَا خَلْفَنَا وَمَا بَيْنَ ذَلِكَ وَمَا كَانَ رَبُّكَ نَسِيّاً",
        "content": ""
    },
    {
        "rakam": 65,
        "ayah": "رَبُّ السَّمَاوَاتِ وَالْأَرْضِ وَمَا بَيْنَهُمَا فَاعْبُدْهُ وَاصْطَبِرْ لِعِبَادَتِهِ هَلْ تَعْلَمُ لَهُ سَمِيّاً",
        "content": ""
    },
    {
        "rakam": 66,
        "ayah": "وَيَقُولُ الْإِنسَانُ أَئِذَا مَا مِتُّ لَسَوْفَ أُخْرَجُ حَيّاً",
        "content": ""
    },
    {
        "rakam": 67,
        "ayah": "أَوَلَا يَذْكُرُ الْإِنسَانُ أَنَّا خَلَقْنَاهُ مِن قَبْلُ وَلَمْ يَكُ شَيْئاً",
        "content": ""
    },
    {
        "rakam": 68,
        "ayah": "فَوَرَبِّكَ لَنَحْشُرَنَّهُمْ وَالشَّيَاطِينَ ثُمَّ لَنُحْضِرَنَّهُمْ حَوْلَ جَهَنَّمَ جِثِيّاً",
        "content": ""
    },
    {
        "rakam": 69,
        "ayah": "ثُمَّ لَنَنزِعَنَّ مِن كُلِّ شِيعَةٍ أَيُّهُمْ أَشَدُّ عَلَى الرَّحْمَنِ عِتِيّاً",
        "content": ""
    },
    {
        "rakam": 70,
        "ayah": "ثُمَّ لَنَحْنُ أَعْلَمُ بِالَّذِينَ هُمْ أَوْلَى بِهَا صِلِيّاً",
        "content": ""
    },
    {
        "rakam": 71,
        "ayah": "وَإِن مِّنكُمْ إِلَّا وَارِدُهَا كَانَ عَلَى رَبِّكَ حَتْماً مَّقْضِيّاً",
        "content": ""
    },
    {
        "rakam": 72,
        "ayah": "ثُمَّ نُنَجِّي الَّذِينَ اتَّقَوا وَّنَذَرُ الظَّالِمِينَ فِيهَا جِثِيّاً",
        "content": ""
    },
    {
        "rakam": 73,
        "ayah": "وَإِذَا تُتْلَى عَلَيْهِمْ آيَاتُنَا بَيِّنَاتٍ قَالَ الَّذِينَ كَفَرُوا لِلَّذِينَ آمَنُوا أَيُّ الْفَرِيقَيْنِ خَيْرٌ مَّقَاماً وَأَحْسَنُ نَدِيّاً",
        "content": ""
    },
    {
        "rakam": 74,
        "ayah": "وَكَمْ أَهْلَكْنَا قَبْلَهُم مِّن قَرْنٍ هُمْ أَحْسَنُ أَثَاثاً وَرِئْياً",
        "content": ""
    },
    {
        "rakam": 75,
        "ayah": "قُلْ مَن كَانَ فِي الضَّلَالَةِ فَلْيَمْدُدْ لَهُ الرَّحْمَنُ مَدّاً حَتَّى إِذَا رَأَوْا مَا يُوعَدُونَ إِمَّا الْعَذَابَ وَإِمَّا السَّاعَةَ فَسَيَعْلَمُونَ مَنْ هُوَ شَرٌّ مَّكَاناً وَأَضْعَفُ جُنداً",
        "content": ""
    },
    {
        "rakam": 76,
        "ayah": "وَيَزِيدُ اللَّهُ الَّذِينَ اهْتَدَوْا هُدًى وَالْبَاقِيَاتُ الصَّالِحَاتُ خَيْرٌ عِندَ رَبِّكَ ثَوَاباً وَخَيْرٌ مَّرَدّاً",
        "content": ""
    },
    {
        "rakam": 77,
        "ayah": "أَفَرَأَيْتَ الَّذِي كَفَرَ بِآيَاتِنَا وَقَالَ لَأُوتَيَنَّ مَالاً وَوَلَداً",
        "content": ""
    },
    {
        "rakam": 78,
        "ayah": "أَاطَّلَعَ الْغَيْبَ أَمِ اتَّخَذَ عِندَ الرَّحْمَنِ عَهْداً",
        "content": ""
    },
    {
        "rakam": 79,
        "ayah": "كَلَّا سَنَكْتُبُ مَا يَقُولُ وَنَمُدُّ لَهُ مِنَ الْعَذَابِ مَدّاً",
        "content": ""
    },
    {
        "rakam": 80,
        "ayah": "وَنَرِثُهُ مَا يَقُولُ وَيَأْتِينَا فَرْداً",
        "content": ""
    },
    {
        "rakam": 81,
        "ayah": "وَاتَّخَذُوا مِن دُونِ اللَّهِ آلِهَةً لِّيَكُونُوا لَهُمْ عِزّاً",
        "content": ""
    },
    {
        "rakam": 82,
        "ayah": "كَلَّا سَيَكْفُرُونَ بِعِبَادَتِهِمْ وَيَكُونُونَ عَلَيْهِمْ ضِدّاً",
        "content": ""
    },
    {
        "rakam": 83,
        "ayah": "أَلَمْ تَرَ أَنَّا أَرْسَلْنَا الشَّيَاطِينَ عَلَى الْكَافِرِينَ تَؤُزُّهُمْ أَزّاً",
        "content": ""
    },
    {
        "rakam": 84,
        "ayah": "فَلَا تَعْجَلْ عَلَيْهِمْ إِنَّمَا نَعُدُّ لَهُمْ عَدّاً",
        "content": ""
    },
    {
        "rakam": 85,
        "ayah": "يَوْمَ نَحْشُرُ الْمُتَّقِينَ إِلَى الرَّحْمَنِ وَفْداً",
        "content": ""
    },
    {
        "rakam": 86,
        "ayah": "وَنَسُوقُ الْمُجْرِمِينَ إِلَى جَهَنَّمَ وِرْداً",
        "content": ""
    },
    {
        "rakam": 87,
        "ayah": "لَا يَمْلِكُونَ الشَّفَاعَةَ إِلَّا مَنِ اتَّخَذَ عِندَ الرَّحْمَنِ عَهْداً",
        "content": ""
    },
    {
        "rakam": 88,
        "ayah": "وَقَالُوا اتَّخَذَ الرَّحْمَنُ وَلَداً",
        "content": ""
    },
    {
        "rakam": 89,
        "ayah": "لَقَدْ جِئْتُمْ شَيْئاً إِدّاً",
        "content": ""
    },
    {
        "rakam": 90,
        "ayah": "تَكَادُ السَّمَاوَاتُ يَتَفَطَّرْنَ مِنْهُ وَتَنشَقُّ الْأَرْضُ وَتَخِرُّ الْجِبَالُ هَدّاً",
        "content": ""
    },
    {
        "rakam": 91,
        "ayah": "أَن دَعَوْا لِلرَّحْمَنِ وَلَداً",
        "content": ""
    },
    {
        "rakam": 92,
        "ayah": "وَمَا يَنبَغِي لِلرَّحْمَنِ أَن يَتَّخِذَ وَلَداً",
        "content": ""
    },
    {
        "rakam": 93,
        "ayah": "إِن كُلُّ مَن فِي السَّمَاوَاتِ وَالْأَرْضِ إِلَّا آتِي الرَّحْمَنِ عَبْداً",
        "content": ""
    },
    {
        "rakam": 94,
        "ayah": "لَقَدْ أَحْصَاهُمْ وَعَدَّهُمْ عَدّاً",
        "content": ""
    },
    {
        "rakam": 95,
        "ayah": "وَكُلُّهُمْ آتِيهِ يَوْمَ الْقِيَامَةِ فَرْداً",
        "content": ""
    },
    {
        "rakam": 96,
        "ayah": "إِنَّ الَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحَاتِ سَيَجْعَلُ لَهُمُ الرَّحْمَنُ وُدّاً",
        "content": ""
    },
    {
        "rakam": 97,
        "ayah": "فَإِنَّمَا يَسَّرْنَاهُ بِلِسَانِكَ لِتُبَشِّرَ بِهِ الْمُتَّقِينَ وَتُنذِرَ بِهِ قَوْماً لُّدّاً",
        "content": ""
    },
    {
        "rakam": 98,
        "ayah": "وَكَمْ أَهْلَكْنَا قَبْلَهُم مِّن قَرْنٍ هَلْ تُحِسُّ مِنْهُم مِّنْ أَحَدٍ أَوْ تَسْمَعُ لَهُمْ رِكْزاً",
        "content": ""
    }
]