[
    {
        "UNK0": "سورة الفاتحة مكية وآياتها سبع نزلت بعد المدثر"
    },
    {
        "UNK0": "سورة البقرة",
        "1": "صفات المؤمنين وجزاء المتقين",
        "6": "صفات الكافرين",
        "8": "صفات المنافقين -١ -",
        "11": "صفات المنافقين -٢ -",
        "14": "صفات المنافقين -٣ -",
        "17": "إيراد الأمثال للمنافقين",
        "21": "الأمر بعبادة الله وحده والأسباب الموجبة لها",
        "23": "تحدي الجاحدين بالإتيان بمثل أقصر سورة من القرآن",
        "25": "جزاء المؤمنين العاملين",
        "26": "فائدة ضرب الأمثال للناس في القرآن",
        "28": "مظاهر قدرة الله بخلق الإنسان وإماتته وخلق الأرض والسماء",
        "30": "استخلاف الإنسان في الأرض وتعليمه اللغات",
        "34": "التكريم الإلهي السامي لآدم بسجود الملائكة له",
        "35": "آدم وحواء في الجنة وموقف الشيطان منهما",
        "40": "ما طلب من بني إسرائيل",
        "44": "نماذج من سوء أخلاق اليهود",
        "49": "نعم الله تعالى العشر على اليهود",
        "55": "تتمة النعم العشر على بني إسرائيل",
        "61": "مطامع اليهود وبعض جرائمهم وعقوباتهم",
        "62": "عاقبة المؤمنين بنحو عام",
        "63": "بعض جرائم اليهود وعقابهم",
        "67": "قصة ذبح البقرة",
        "74": "قسوة قلوب اليهود",
        "75": "استبعاد إيمان اليهود",
        "79": "تحريف أحبار اليهود وافتراءاتهم",
        "83": "مخالفة اليهود المواثيق",
        "84": "بعض حالات مخالفة اليهود الميثاق",
        "87": "موقف اليهود من الرسل والكتب المنزلة",
        "90": "كفرهم بما أنزل الله وقتلهم الأنبياء",
        "92": "تكذيب ادعائهم الإيمان بالتوراة",
        "94": "حرص اليهود على الحياة",
        "97": "موقف اليهود من جبريل والملائكة والرسل",
        "99": "كفرهم بالقرآن ونقضهم العهود",
        "102": "اشتغال اليهود بالسحر والشعوذة والطلاسم",
        "104": "أدب الخطاب مع النبي صلى الله عليه وسلم ومصدر الاختصاص بالرسالة",
        "106": "إثبات نسخ الأحكام الشرعية",
        "109": "موقف أهل الكتاب من المؤمنين وكيفية الرد عليه",
        "111": "رأي كل فريق من اليهود والنصارى في الآخر",
        "114": "ظلم مانع الصلاة في المساجد، وصحة الصلاة في أي مكان",
        "116": "افتراءات أهل الكتاب والمشركين بنسبة الولد لله والمطالبة بتكليمه الناس",
        "119": "التحذير من اتباع اليهود والنصارى",
        "122": "تذكير بالنعمة وتخويف من الآخرة",
        "124": "اختبار إبراهيم عليه السلام وخصائص البيت الحرام وفضائل مكة",
        "127": "بناء البيت الحرام ودعاء إبراهيم وإسماعيل",
        "130": "سفاه من يرغب عن ملة إبراهيم",
        "133": "إبطال دعوى اليهود أنهم على دين إبراهيم ويعقوب",
        "138": "صبغة الإيمان وأثره في النفوس والعبودية لله تعالى",
        "142": "التمهيد لتحويل القبلة",
        "144": "تحويل القبلة",
        "148": "الاختلاف في القبلة وأسباب تحويلها",
        "153": "الصبر على البلاء",
        "158": "السعي بين الصفا والمروة وجزاء كتمان آيات الله",
        "163": "وحدانية الإله ورحمته ومظاهر قدرته",
        "165": "حال المشركين مع آلهتهم",
        "168": "تحليل الطيبات ومنشأ تحريم المحرمات",
        "172": "الحلال والحرام من المآكل",
        "174": "كتمان أهل الكتاب ما أنزل الله",
        "177": "مظاهر البر الحقيقي",
        "178": "مشروعية القصاص وحكمته",
        "180": "الوصية الواجبة",
        "183": "فرضية الصيام",
        "186": "أحكام الصيام",
        "188": "أكل الأموال بالباطل",
        "189": "التوقيت بالشهر القمري وحقيقة البر",
        "190": "قواعد القتال في سبيل الله",
        "196": "أحكام الحج والعمرة",
        "198": "تتمة أحكام الحج",
        "204": "الناس إما منافقون أو مخلصون",
        "208": "الدعوة إلى قبول الإسلام واتباع أحكامه وجزاء المخالف",
        "213": "الحاجة إلى الرسل وما يلاقونه مع المؤمنين في دعوتهم",
        "215": "مقدار نفقة التطوع ومصرفها",
        "216": "فرضية القتال وإباحته في الأشهر الحرام",
        "219": "المرحلة الثانية من مراحل تحريم الخمر وحرمة القمار",
        "220": "الولاية على مال اليتيم",
        "221": "زواج المسلم بالمشركة",
        "222": "الحيض وأحكامه",
        "224": "الحلف بالله ويمين اللغو",
        "226": "حكم الإيلاء",
        "228": "عدة المطلقة وحقوق النساء",
        "229": "عدد الطلاق وما يترتب عليه من أحكام",
        "231": "واجب الرجل في معاملة المطلقة وولاية التزويج",
        "233": "الاسترضاع بأجر ومدة الرضاع ونفقة الأولاد وأحكام أخرى",
        "234": "عدة المتوفى عنها زوجها",
        "235": "خطبة المتوفى عنها زوجها تعريضا ووقت العقد",
        "236": "المطلقة قبل الدخول ومتعتها أو وجوب نصف المهر لها",
        "238": "الحفاظ‍ على الصلاة",
        "240": "وصية الحول للمتوفى عنها زوجها ومتعة كل مطلقة",
        "243": "موت الأمم بالجبن والبخل وحياتها بالشجاعة والإنفاق",
        "246": "قصة النبي صمويل والملك طالوت وترك بني إسرائيل الجهاد",
        "248": "إثبات ملك طالوت واختباره الأتباع وانهزام الفئة الكثيرة أمام الفئة القليلة",
        "253": "درجات الرسل وأحوال الناس في اتباعهم",
        "254": "الأمر بالإنفاق في سبيل الخير",
        "255": "آية الكرسي",
        "256": "منع الإكراه على الدين والله هو الهادي إلى الإيمان",
        "258": "قصة النمروذ الملك",
        "259": "قصة العزير وحماره",
        "260": "حب الاستطلاع عند إبراهيم عليه السلام",
        "261": "ثواب الإنفاق في سبيل الله وآدابه",
        "265": "الإنفاق لمرضاة الله والإنفاق لغير وجه الله",
        "267": "إنفاق الطيب من الأموال لا الخبيث",
        "268": "تخويف الشيطان من الفقر والفهم الصحيح للقرآن",
        "270": "صدقة السر وصدقة العلن",
        "272": "مستحقو الصدقات",
        "275": "الربا وأضراره على الفرد والجماعة",
        "282": "آية الدين وآية الرهن توثيق الدين المؤجل بالكتابة أو الشهادة أو الرهن",
        "284": "لله ملك السموات والأرض وإحاطة علمه بكل شيء ومحاسبة العباد على أفعالهم ونواياهم",
        "285": "الإيمان برسالات الرسل والتكليف بالطاقة"
    },
    {
        "UNK0": "سورة آل عمران",
        "1": "إثبات التوحيد وإنزال الكتاب",
        "7": "المحكم والمتشابه في القرآن",
        "10": "عاقبة الكفار المغرورين بالمال والولد ومثال ذلك",
        "14": "محبة الشهوات في الدنيا",
        "15": "الجنات التي هي خير من الدنيا ومفاتنها",
        "18": "الشهادة بوحدانية الله وقيامه بالعدل ونوع الدين المقبول عند الله",
        "21": "جزاء قتل الأنبياء",
        "23": "إعراض أهل الكتاب عن حكم الله",
        "26": "دلائل قدرة الله وعظمته وتصرفه في خلقه والتفويض إليه",
        "28": "موالاة الكافرين والتحذير من الآخرة",
        "31": "محبة الله باتباع الرسول وطاعته",
        "33": "اصطفاء الأنبياء وقصة نذر امرأة عمران ما في بطنها لعبادة الله",
        "38": "قصة زكريا ويحيى (دعاء زكريا وطلبه الولد الصالح وإنجاب يحيى)",
        "42": "قصة مريم",
        "45": "قصة عيسى عليه السلام",
        "52": "عيسى مع قومه المؤمنين والكفار",
        "59": "الرد على من زعم ألوهية عيسى والمباهلة",
        "64": "الدعوة إلى توحيد الله وعبادته وملة إبراهيم",
        "69": "محاولة بعض أهل الكتاب إضلال المسلمين والتلاعب بالدين والعصبية الدينية",
        "75": "أداء الأمانة والوفاء بالعهد عند بعض أهل الكتاب",
        "78": "من أكاذيب اليهود",
        "79": "افتراء أهل الكتاب على الأنبياء",
        "81": "ميثاق الأنبياء بتصديق بعضهم بعضا وأمرهم بالإيمان",
        "84": "الإيمان بكل الأنبياء وقبول دين الإسلام",
        "86": "أنواع الكفار من حيث التوبة",
        "92": "نوع النفقة المبرورة وجزاء الإنفاق",
        "93": "الرد على اليهود في تحريم بعض الأطعمة",
        "96": "منزلة البيت الحرام وفرضية الحج",
        "98": "إصرار أهل الكتاب على الكفر وصدهم عن سبيل الله",
        "100": "توجيه المؤمنين إلى الحفاظ‍ على الشخصية والاعتصام بالقرآن والإسلام",
        "104": "الأمر بالمعروف والنهي عن المنكر وتأكيد النهي عن التفرق",
        "110": "سبب خيرية الأمة الإسلامية وضرب الذلة والمسكنة على اليهود",
        "113": "الفئة المؤمنة من أهل الكتاب والثواب على أعمالهم",
        "116": "ضياع أعمال الكافرين يوم القيامة",
        "118": "الثقة بالكفار واطلاعهم على الأسرار وموقفهم الثابت من المؤمنين",
        "121": "غزوة أحد تنظيم الجيش الإسلامي والتذكير بالنصر في غزوة بدر",
        "130": "إرشادات للمؤمنين بفعل الخيرات وترك المنكرات وجزاء الطائعين والعصاة",
        "137": "عاقبة المكذبين والمتقين وتوفير العزة للمؤمنين بالجهاد",
        "142": "عتاب لبعض أهل أحد بقدسية الجهاد وضرورة الثبات على المبدأ وتذكير بأن الموت بإذن الله",
        "149": "التحذير من طاعة الكافرين",
        "152": "أسباب انهزام المسلمين في أحد وتفرقهم بعد وعدهم بالنصر",
        "156": "تحذير المؤمنين من أقوال المنافقين وترغيبهم في الجهاد وبيان فضله",
        "159": "معاملة النبي صلى الله عليه وسلم لأصحابه بالرفق والعفو والمشاورة والوعد بالنصر",
        "161": "عدالة النبي صلى الله عليه وسلم في قسمة الغنائم ومهامه في إصلاح أمته",
        "165": "بعض أخطاء المؤمنين في غزوة أحد وبعض قبائح المنافقين",
        "169": "منزلة الشهداء المجاهدين في سبيل الله",
        "176": "إزالة الحزن من قلب النبي صلى الله عليه وسلم بعد أحد ومناقشة الكفار والبخلاء وتمييز الخبيث من الطيب",
        "181": "بعض قبائح اليهود من نسبة الفقر إلى الله وتكذيبهم النبي صلى الله عليه وسلم",
        "185": "الموت مصير كل نفس والثواب يوم القيامة والابتلاء في الدنيا",
        "187": "أخذ الميثاق على أهل الكتاب بالبيان للناس ومحبتهم المدح بغير موجب",
        "190": "توجيه النفوس نحو التفكر في خلق السموات والأرض وجزاء العاملين ذكورا وإناثا",
        "196": "الكافرون والأتقياء ومؤمنو أهل الكتاب وجزاء كل"
    },
    {
        "UNK0": "سورة النساء",
        "1": "وحدة الأصل الإنساني ووحدة الزوجين ورابطة الأسرة",
        "2": "إيتاء اليتامى أموالهم وتحريم أكلها",
        "3": "إباحة تعدد الزوجات إلى أربع ووجوب إيتاء المهر",
        "5": "الحجر على السفهاء والصغار ونحوهم وعدم تسليم المال إليهم إلا بالرشد",
        "7": "حقوق الورثة في التركة وحقوق المحتاجين والأيتام والقرابة غير الوارثين",
        "11": "آيات المواريث",
        "13": "حدود الله تعالى",
        "15": "جزاء الفاحشة في مبدأ التشريع",
        "17": "حالة قبول التوبة ووقتها",
        "19": "معاملة النساء في الإسلام تحريم إرث النساء كرها والعضل عن الزواج وأخذ شيء من المهور كرها والمعاشرة بالمعروف",
        "22": "المحارم من النساء",
        "24": "حرمة الزواج بالمتزوجات وإباحة الزواج بغير المحارم بشرط‍ المهر",
        "25": "شروط‍ الزواج بالأمة وعقوبة فاحشتها",
        "26": "أسباب الأحكام الشرعية السابقة",
        "29": "تحريم أكل المال بالباطل ومنع الاعتداء وإباحة التعامل بالتراضي",
        "31": "جزاء اجتناب الكبائر",
        "32": "النهي عن التمني (الحسد) وسؤال الله تعالى من فضله",
        "33": "إعطاء كل وارث حقه من التركة",
        "34": "قوامة الرجال على النساء وطرق تسوية النزاع بين الزوجين",
        "36": "أخلاق القرآن عبادة الله وحده والإحسان للوالدين والأقارب والجيران والتحذير من الإنفاق رياء",
        "40": "الترغيب في امتثال الأوامر والتحذير من المخالفة والعصيان",
        "43": "تحريم الصلاة حال السكر وكون التيمم عند فقد الماء",
        "44": "أعمال اليهود وتصرفاتهم",
        "47": "أمر أهل الكتاب بالإيمان بالقرآن وتهديدهم باللعنة",
        "48": "ما يغفره الله تعالى وما لا يغفره",
        "49": "نماذج أخرى من أعمال أهل الكتاب والجزاء عليها",
        "56": "عقاب الكافرين وثواب المؤمنين",
        "58": "منهاج الحكم الإسلامي أداء الأمانات والحقوق إلى أهلها والحكم بالعدل وإطاعة الله والرسول وولاة الأمور",
        "60": "مزاعم المنافقين ومواقفهم",
        "64": "فرضية طاعة الرسول صلى الله عليه وسلم",
        "66": "حب الوطن والتزام أوامر الله والرسول",
        "69": "جزاء طاعة الله والرسول",
        "71": "قواعد القتال في الإسلام",
        "77": "أحوال الناس حين فرضية القتال",
        "80": "طاعة الرسول طاعة لله وتدبر القرآن وكونه من عند الله",
        "83": "إذاعة الأخبار من غير اعتماد على مصدر صحيح",
        "84": "التحريض على الجهاد",
        "85": "الشفاعة الحسنة ورد التحية وإثبات البعث والتوحيد",
        "88": "أوصاف المنافقين ومراوغتهم ومحاولتهم تكفير المسلمين وكيفية معاملتهم",
        "92": "جزاء القتل الخطأ والقتل العمد",
        "94": "الحرص على السلام والتثبت في الأحكام",
        "95": "التفاضل بين المجاهدين والقاعدين عن الجهاد",
        "97": "هجرة المستضعفين",
        "101": "قصر الصلاة في السفر وصلاة الخوف",
        "104": "الحث على القتال بعدم التفكير في الآلام وانتظار إحدى الحسنيين",
        "105": "القضاء بالحق والعدل المطلق",
        "114": "حالات النجوى الخيرة وعقاب معاداة الرسول واتباع غير سبيل المؤمنين (الإجماع)",
        "116": "الشرك وعاقبته والشيطان وشروره وجزاء الإيمان والعمل الصالح",
        "123": "استحقاق الجنة ليس بالأماني والعبرة في الجزاء بالعمل شرا أو خيرا",
        "127": "رعاية اليتامى والصلح بين الزوجين بسبب النشوز والعدل بين النساء",
        "131": "لله حقيقة الملك في الكون وكمال القدرة والمشيئة وثواب الدنيا والآخرة للمجاهد",
        "135": "العدل في القضاء والشهادة بحق والإيمان بالله والرسول والكتب السماوية",
        "137": "صفات المنافقين وجزاؤهم ومواقفهم من المؤمنين",
        "142": "مواقف أخرى للمنافقين وعقابهم والنهي عن موالاة الكافرين",
        "148": "الجهر بالسوء والعفو عنه وإبداء الخير وإخفاؤه",
        "150": "الكفر والإيمان وجزاء كل",
        "153": "مواقف اليهود المتعنتة",
        "160": "عاقبة ظلم اليهود وأخذهم الربا وثواب المؤمنين منهم",
        "163": "وحدة الوحي للرسل وحكمة إرسالهم",
        "167": "ضلال الكافرين وجزاؤهم ودعوة الناس إلى الإيمان بالرسول صلى الله عليه وسلم",
        "171": "المسيح عيسى ابن مريم في القرآن",
        "174": "دعوة الناس إلى الإيمان بالنور المبين (القرآن)",
        "176": "ميراث الكلالة أو ميراث الإخوة والأخوات لأب وأم أو لأب"
    },
    {
        "UNK0": "سورة المائدة",
        "1": "الوفاء بالعقود ومنع الاعتداء والتعاون على الخير وتعظيم شعائر الله",
        "3": "المطعومات المحرمات وإكمال الدين والضرورة",
        "4": "المطعومات الحلال والزواج بالكتابيات",
        "6": "فرضية الوضوء والغسل من الجنابة والتيمم وذكر نعمة الله",
        "8": "الشهادة بالقسط‍ والحكم بالعدل ووعد المؤمنين ووعيد الكافرين والتذكير بنعمة الله",
        "12": "نقض اليهود والنصارى الميثاق",
        "15": "مقاصد القرآن",
        "17": "الرد على معتقدات اليهود والنصارى",
        "20": "تذكير موسى قومه بنعمة الله ومطالبتهم بدخول الأرض المقدسة وموقفهم الرافض",
        "27": "قصة قابيل وهابيل وأول جريمة قتل في الدنيا",
        "33": "حد الحرابة أو حكم قطاع الطرق",
        "35": "التقوى والجهاد أساس الفلاح في الآخرة والدنيا كلها لا تصلح فداء للكفار",
        "38": "حد السرقة",
        "41": "مسارعة المنافقين واليهود إلى الكفر وموقف اليهود من أحكام التوراة",
        "44": "التوراة هدى ونور وتشريع القصاص فيها وإلزام النصارى بالحكم بها",
        "48": "الحكم بشريعة القرآن",
        "51": "موالاة اليهود والنصارى",
        "54": "المرتدون ومعاداتهم المسلمين",
        "57": "النهي عن موالاة الكفار وأسبابه",
        "64": "من أقبح أقوال اليهود وإلقاء العداوة والبغضاء بينهم وجزاء إيمان أهل الكتاب",
        "67": "أمر الرسول بتبليغ الوحي وعصمته من الناس ودعوة أهل الكتاب للإيمان برسالته",
        "70": "تكذيب اليهود رسلهم وقتلهم إياهم",
        "72": "تأليه المسيح عند المسيحيين مع أنه مجرد بشر رسول",
        "76": "مناقشة النصارى في تأليه عيسى ومطالبة أهل الكتاب بعدم الغلو في الدين ولعنة بني إسرائيل لعدم النهي عن المنكر",
        "82": "علاقة اليهود والنصارى بالمؤمنين عداوة اليهود وإيمان القساوسة والرهبان",
        "87": "إباحة الطيبات",
        "89": "اليمين اللغو واليمين المنعقدة وكفارتها",
        "90": "تحريم الخمر والميسر والأنصاب والأزلام",
        "94": "الصيد في حالة الإحرام وجزاء صيد البر",
        "97": "مكانة البيت الحرام والشهر الحرام وشأن الهدي والقلائد",
        "98": "الترهيب من عقاب الله والترغيب بفعل الطيب",
        "101": "النهي عن كثرة السؤال فيما لم ينزل به وحي",
        "103": "ما حرمه الجاهليون من الماشية والإبل",
        "105": "التفويض إلى الله تعالى بعد الأمر بالمعروف والنهي عن المنكر",
        "106": "الشهادة على الوصية حين الموت",
        "109": "سؤال الرسل يوم القيامة عن أثر دعوتهم",
        "110": "التذكير بمعجزات عيسى عليه السلام",
        "112": "إنزال المائدة على بني إسرائيل بطلب الحواريين",
        "116": "تبرئة عيسى من مزاعم النصارى ألوهيته وألوهية أمه"
    },
    {
        "UNK0": "سورة الأنعام",
        "1": "أدلة وجود الله ووحدانيته والبعث",
        "4": "سبب كفر الناس بآيات ربهم وإنذارهم بالعقاب",
        "7": "عناد الكفار والرد على طلبهم بإنزال كتاب أو إرسال ملك",
        "10": "عاقبة المستهزئين والمكذبين",
        "12": "أدلة أخرى لإثبات الوحدانية والبعث",
        "17": "قدرة الله على كشف الضر وشهادة الله للنبي صلى الله عليه وسلم بالصدق ومجادلة المشركين في تعدد الآلهة",
        "20": "معرفة أهل الكتاب النبي صلى الله عليه وسلم والافتراء على الله وتبرؤ المشركين من الشرك في الآخرة",
        "25": "مواقف من عناد المشركين حول القرآن الكريم",
        "27": "حال المشركين أمام النار أو كيفية هلاكهم",
        "30": "حال المشركين أمام ربهم في الآخرة وحقيقة الدنيا",
        "33": "حزن النبي صلى الله عليه وسلم لإعراض قومه وبيان تكذيب الرسل المتقدمين",
        "36": "رفض المشركين دعوة النبي صلى الله عليه وسلم ومطالبتهم بتنزيل آية",
        "38": "كمال علم الله وتمام قدرته وعدم التفريط‍ بشيء في القرآن",
        "40": "اللجوء إلى الله وحده في الشدائد",
        "46": "من أدلة القدرة الإلهية والوحدانية ومهام الرسل المرسلين",
        "50": "انحصار مصدر علم النبي صلى الله عليه وسلم بالوحي ومهمته في الإنذار وطرد الضعفاء",
        "54": "بعض أحوال رحمة الله تعالى",
        "56": "حسم الجدل بين النبي صلى الله عليه وسلم وبين المشركين",
        "59": "كمال علم الله تعالى وقهره العباد",
        "63": "القدرة الإلهية على الإنجاء من الظلمات",
        "65": "القدرة الإلهية على تعذيب العصاة",
        "68": "الإعراض عن مجالس المستهزئين بالقرآن وعذابهم",
        "71": "مزايا الإيمان بالله ومخازي الشرك",
        "74": "الجدال بين إبراهيم عليه السلام وبين آزر وسبب ترك الشرك",
        "80": "المحاجة بين إبراهيم وقومه",
        "84": "إبراهيم أبو الأنبياء وخصائص رسالاتهم والاقتداء بهديهم",
        "91": "إثبات النبوة وإنزال الكتب على الأنبياء ومهمة القرآن",
        "93": "افتراء الكذب على الله وعقابه",
        "95": "قدرة الله الباهرة في الكون",
        "100": "المزاعم المنسوبة إلى الله (الجن والولد والصاحبة) وكونه لا تدركه الأبصار",
        "104": "مبصرات الوحي وقدرة الله على منع الشرك",
        "108": "النهي عن سب الأصنام والأوثان",
        "111": "من مظاهر تعنت المشركين والإياس من إيمانهم",
        "114": "القرآن الكريم دليل صدق رسالة النبي صلى الله عليه وسلم",
        "116": "ضلالات المشركين والمنع من أكل ذبائحهم",
        "122": "مثل المؤمن المهتدي والكافر الضال",
        "124": "تعنت المشركين ومطالبتهم بالنبوة",
        "125": "سنة الله في المستعدين للإيمان وغير المستعدين وجزاء الفريقين بعد بيان الحق ومنهجه",
        "129": "تولية الظلمة على بعضهم وتقريع الكافرين على عدم إيمانهم",
        "133": "التهديد بعذاب الاستئصال والإنذار بعذاب القيامة",
        "136": "شريعة الجاهلية في الزروع والثمار والأنعام وقتل الأولاد",
        "141": "الأدلة الواضحة على قدرة الله تعالى",
        "145": "المطعوم المحرم على المسلمين والمحرم على اليهود",
        "148": "نسبة المشركين الشرك والتحريم إلى الله تعالى وإقامة الحجة عليهم",
        "151": "المحرمات العشر أو الوصايا العشر",
        "154": "السبب في إنزال التوراة والقرآن",
        "158": "إنذار أخير للكفار بسوء العذاب",
        "159": "عاقبة الاختلاف في الدين",
        "160": "جزاء الحسنة والسيئة",
        "161": "اتباع ملة إبراهيم في التوحيد والعبادة والتبعة الشخصية",
        "165": "الاستخلاف في الأرض"
    },
    {
        "UNK0": "سورة الأعراف",
        "1": "اتباع القرآن الكريم",
        "4": "عاقبة تكذيب الرسل في الدنيا",
        "6": "عاقبة الكفر في الآخرة والحساب الدقيق على الأعمال",
        "10": "كثرة نعم الله على عباده",
        "11": "تكريم البشرية بالسجود لآدم وإغواء الشيطان وطرده من الجنة",
        "19": "قصة آدم في الجنة وخروجه منها",
        "26": "توفير حوائج الدنيا لبني آدم وتحذيرهم من فتنة الشيطان",
        "28": "تشريع المشركين تقليد الآباء وتشريع الله الوحي إلى رسوله",
        "31": "إباحة الزينة والطيبات من المآكل والمشارب",
        "33": "أصول المحرمات على الناس",
        "34": "أجل كل أمة وفرد",
        "35": "ما خوطبت به كل أمة على لسان رسولها وإنذار المكذبين بآيات الله",
        "37": "عاقبة الكذب ومشهد دخول الكفار إلى النار",
        "40": "جزاء الكافرين",
        "42": "جزاء المؤمنين المتقين",
        "44": "محاورة بين أهل الجنة وبين أهل النار والأعراف",
        "48": "المناظرة بين أصحاب الأعراف وأصحاب النار",
        "50": "ما يقوله أهل النار لأهل الجنة أو استغاثة أهل النار بأهل الجنة لإمدادهم بالطعام والشراب",
        "52": "فضل القرآن على البشر وحال المكذبين يوم القيامة بإظهار الندم وطلب الشفاعة",
        "54": "إثبات الربوبية والألوهية لله بالخلق والأمر",
        "55": "مشروعية الدعاء وآدابه وتحريم الإفساد في الأرض",
        "57": "إنزال المطر وإخراج النبات ودلالتهما على القدرة الإلهية وإثبات البعث",
        "59": "قصة نوح عليه السلام",
        "65": "قصة هود عليه السلام",
        "73": "قصة صالح عليه السلام",
        "80": "قصة لوط‍ عليه السلام",
        "85": "قصة شعيب عليه السلام",
        "88": "بقية قصة شعيب مع قومه محاورته الملأ وعقابهم بالزلزلة",
        "94": "سنة الله في التضييق والتوسعة قبل إهلاك الأمم",
        "96": "الترغيب بالإيمان لزيادة الخير والترهيب من الكفر بالعذاب المبكر",
        "101": "العبرة من قصص أهل القرى",
        "103": "قصة موسى عليه السلام مع فرعون والملأ من قومه",
        "117": "إيمان السحرة برب العالمين",
        "123": "تهديد فرعون للسحرة وإصرارهم على الإيمان بالله",
        "127": "تمالؤ فرعون وملئه على موسى وقومه ونصيحة موسى لقومه وحوارهم معه",
        "130": "أنواع عذاب الدنيا بآل فرعون",
        "134": "اللجوء إلى موسى لرفع العذاب ونقض العهد وإغراق فرعون وقومه",
        "137": "وراثة بني إسرائيل أرض مصر والشام بعد الفراعنة والعمالقة",
        "138": "جحود بني إسرائيل نعم الله عليهم",
        "142": "مناجاة موسى لربه أو مكالمة موسى ربه وطلبه رؤية الله وإنزال التوراة عليه",
        "146": "عقوبة التكبر والكفر بصرف المتكبرين عن فهم أدلة العظمة الإلهية",
        "148": "قصة اتخاذ السامري العجل",
        "150": "غضب موسى وتعنيفه هارون لاتخاذ العجل إلها",
        "152": "جزاء الظالمين باتخاذ العجل وقبول توبة التائبين",
        "154": "نهاية قصة اتخاذ العجل إلها",
        "155": "اختيار موسى سبعين رجلا لميقات الكلام والرؤية ومناجاته ربه",
        "156": "بقية دعاء موسى عند مشاهدة الرجفة وربط‍ الإيمان برسالته برسالة النبي صلى الله عليه وآله وسلم",
        "158": "عموم الرسالة الإسلامية",
        "159": "اتباع الحق لدى بعض قوم موسى ونعم الله على بني إسرائيل في صحراء التيه",
        "161": "أمر بني إسرائيل بسكنى القرية (بيت المقدس)",
        "163": "حيلة اليهود على صيد الأسماك يوم السبت وعقاب المخالفين",
        "167": "رفع الجبل فوق اليهود وإذلالهم إلى يوم القيامة وتفريقهم في الأرض واستثناء الصالحين",
        "172": "الميثاق العام المأخوذ على بني آدم",
        "175": "قصة بلعم بن باعوراء وأمثاله الضالين المكذبين",
        "178": "أسباب الهداية والضلالة",
        "180": "أسماء الله الحسنى",
        "181": "المهتدون والمكذبون من أمة الدعوة الإسلامية",
        "187": "علم الساعة عند الله",
        "188": "الأمور كلها بيد الله وحده وعلم الغيب مختص بالله تعالى وحقيقة الرسالة",
        "189": "التذكير بالنشأة الأولى والأمر بالتوحيد واتباع القرآن والنهي عن الشرك",
        "194": "واقع الأصنام والأوثان المعبودة",
        "199": "أصول الأخلاق الاجتماعية ومقاومة الشيطان",
        "203": "اتباع النبي صلى الله عليه وآله وسلم الوحي الإلهي وخصائص القرآن",
        "204": "الاستماع للقرآن وطريقة الذكر"
    },
    {
        "UNK0": "سورة الأنفال",
        "1": "السؤال عن حكم قسمة الغنائم وبيان أوصاف المؤمنين",
        "5": "كراهية بعض المؤمنين قتال قريش في بدر",
        "9": "الإمداد بالملائكة في معركة بدر وإلقاء النعاس وإنزال المطر",
        "15": "الفرار من الزحف والنصر من عند الله",
        "20": "الأمر بطاعة الله والرسول والتحذير من المخالفة",
        "24": "الاستجابة لما فيه الحياة الأبدية",
        "27": "خيانة الله والرسول وخيانة الأمانة",
        "29": "تقوى الله وفضلها",
        "30": "ألوان الكيد والمؤامرة من المشركين على النبي صلى الله عليه وآله وسلم",
        "32": "طلب المشركين الإتيان بالعذاب ومنع تعذيبهم إكراما للنبي صلى الله عليه وآله وسلم وأوضاع صلاتهم عند البيت الحرام",
        "36": "إهدار ثواب الإنفاق للصد عن سبيل الله",
        "38": "المغفرة للكفار إذا أسلموا وقتالهم إذا لم يسلموا لمنع الفتنة في الدين",
        "41": "كيفية قسمة الغنائم",
        "42": "تكثير المؤمنين ببدر في أعين المشركين وتقليل المشركين في أعين المؤمنين",
        "45": "ذكر الله والثبات أمام العدو والطاعة وعدم التنازع",
        "48": "تبرؤ الشيطان من الكفار وقت أزمة بدر وحين تهكم المنافقين بالمؤمنين",
        "50": "إهلاك الكفار المشركين لسوء أعمالهم كإهلاك آل فرعون",
        "55": "معاملة من نقض العهد ومن ظهرت منه بوادر النقض",
        "60": "الإعداد الحربي لقتال الأعداء بحسب الطاقة والاستطاعة",
        "61": "إيثار السلام وتوحيد الأمة وتحريضها على القتال",
        "67": "شرط‍ اتخاذ الأسرى وقبول الفداء منهم وإباحة الانتفاع به",
        "72": "أصناف المؤمنين في عهد النبي صلى الله عليه وآله وسلم بمقتضى الإيمان والهجرة"
    },
    {
        "UNK0": "سورة التوبة",
        "1": "نقض عهود المشركين وإعلان الحرب عليهم والبراءة منهم",
        "5": "فرضية قتال مشركي العرب في أي مكان وجدوا",
        "6": "مشروعية الأمان",
        "7": "أسباب البراءة من عهود المشركين وقتالهم",
        "11": "مصير المشركين إما التوبة وإما القتال",
        "13": "التحريض على قتال المشركين الناكثين أيمانهم وعهودهم",
        "16": "اختبار المسلمين واتخاذ البطانة",
        "17": "عمارة المساجد",
        "19": "فضل الإيمان بالله واليوم الآخر والجهاد في سبيل الله",
        "23": "ولاية الآباء والإخوان الكافرين وتفضيل الإيمان والجهاد على ثمانية أشياء",
        "25": "نصر المؤمنين في مواطن كثيرة",
        "28": "تحريم دخول المسجد الحرام على المشركين",
        "29": "قتال أهل الكتاب",
        "30": "عقيدة أهل الكتاب (اليهود والنصارى)",
        "34": "سيرة الأحبار والرهبان في معاملاتهم مع الناس",
        "36": "عدد الشهور في حكم الله وقتال المشركين كافة وتحريم النسيء",
        "38": "التحريض على الجهاد والتحذير من تركه ومعجزة الغار في الهجرة",
        "41": "النفر للجهاد في سبيل الله",
        "42": "تخلف المنافقين عن غزوة تبوك وقضية الإذن لهم",
        "46": "الدليل على تخلف المنافقين بغير عذر وخطر خروجهم للقتال",
        "49": "انتحال المنافقين أعذارا أخرى للتخلف عن غزوة تبوك وفرحهم عند السيئة التي تصيب المؤمنين وترحهم عند الحسنة",
        "53": "إحباط‍ ثواب المنافقين على نفقاتهم وصلواتهم وتعذيبهم في الدنيا والآخرة",
        "56": "حلف المنافقين الأيمان الكاذبة وانتهازهم الفرصة للطعن بالنبي صلى الله عليه وآله وسلم",
        "60": "مصارف الزكاة الثمانية",
        "61": "إيذاء المنافقين النبي صلى الله عليه وآله وسلم وتصحيح مفاهيمهم",
        "62": "بيان أحوال المنافقين الذين تخلفوا عن غزوة تبوك الإقدام على اليمين الكاذبة، وتخوفهم من نزول القرآن فاضحا لهم، واستهزاؤهم بآيات الله",
        "67": "أوصاف المنافقين وجزاؤهم الأخروي",
        "71": "أوصاف المؤمنين وجزاؤهم الأخروي",
        "73": "جهاد الكفار والمنافقين وأسبابه",
        "75": "كذب المنافقين وإخلافهم العهد والوعد قصة ثعلبة بن حاطب المزعومة",
        "79": "طعن المنافقين بالمؤمنين وعدم المغفرة لهم",
        "81": "فرح المنافقين المتخلفين عن الجهاد في غزوة تبوك",
        "83": "منع المنافقين من الجهاد والمنع من الصلاة على موتاهم والتحذير من الاغترار بأموالهم وأولادهم",
        "86": "استئذان زعماء المنافقين للتخلف عن الجهاد وإقدام المؤمنين عليه",
        "90": "نفاق الأعراب واستئذانهم للتخلف عن الجهاد",
        "91": "أصحاب الأعذار المقبولة لعدم الجهاد",
        "93": "مؤاخذة المتخلفين الأغنياء بغير عذر",
        "94": "اعتذار المنافقين المتخلفين عن غزوة تبوك وحلفهم الأيمان الكاذبة",
        "97": "كفر الأعراب ونفاقهم وإيمانهم",
        "100": "أصناف الناس في المدينة وما حولها",
        "103": "أخذ الصدقة وقبول التوبة والأمر بالعمل الصالح",
        "106": "الثلاثة الذين خلفوا عن التوبة عليهم",
        "107": "مسجد الضرار (مسجد المنافقين) ومسجد التقوى (مسجد قباء)",
        "111": "صفات المؤمنين الصادقين الكمل وهم المجاهدون التائبون العابدون",
        "113": "الاستغفار للمشركين وشرط‍ المؤاخذة (العقاب) على الذنوب",
        "117": "التوبة على أهل تبوك وعلى الثلاثة المخلفين والصدق",
        "120": "فرضية الجهاد على أهل المدينة والأعراب وثوابه",
        "122": "الجهاد فرض كفاية وطلب العلم فريضة",
        "123": "السياسة الحربية في قتال الكفار",
        "124": "موقف المنافقين من سور القرآن",
        "128": "صفات الرسول صلى الله عليه وسلم ذات الصلة بأمته"
    },
    {
        "UNK0": "سورة يونس عليه السلام",
        "1": "قضية إنزال الوحي إلى النبي صلى الله عليه وسلم",
        "3": "الله خالق السموات والأرض وعلى الخلق عبادته",
        "4": "إثبات البعث والجزاء",
        "5": "إثبات القدرة الإلهية في الكون بالشمس والقمر واختلاف الليل والنهار",
        "7": "المؤمنون والكافرون وجزاء كل",
        "11": "استعجال الإنسان الخير دائما والشر حال الغضب",
        "13": "سنة الله في إهلاك الأمم الظالمة الكافرة واستخلاف خلائف بعدهم",
        "15": "مطالبة المشركين بقرآن آخر أو بتبديل بعض آياته",
        "18": "عبادة الأصنام وادعاء شفاعتها",
        "19": "الأصل في الناس جميعا كونهم على الدين الحق",
        "20": "طلب المشركين إنزال آية كونية",
        "21": "عادة الكفار المكر واللجاج والعناد وعدم الإنصاف",
        "24": "مثل الحياة الدنيا في سرعة زوالها وفنائها",
        "25": "الترغيب في الجنة ووصف حال المحسنين والمسيئين في الآخرة",
        "28": "حشر الخلائق وتبرؤ الشركاء من المشركين ومن عبادتهم",
        "31": "إثبات التوحيد بثبوت الربوبية لدى المشركين",
        "34": "إثبات البعث",
        "37": "القرآن كلام الله وتحدي العرب به",
        "40": "انقسام المشركين إلى فريقين حول الإيمان بالقرآن والنبي",
        "45": "زوال الدنيا سريع",
        "46": "تعذيب المشركين في الدنيا والآخرة",
        "57": "مقاصد القرآن الكريم",
        "59": "الإنكار على المشركين بالتحليل والتحريم للأنعام",
        "61": "إحاطة علم الله تعالى بجميع شؤون العباد وأعمالهم وبكل الكائنات",
        "62": "أولياء الله-أوصافهم وجزاؤهم",
        "65": "العزة والملك لله تعالى وفائدة جعله الليل والنهار",
        "68": "الإشراك بنسبة الولد لله تعالى",
        "71": "قصة نوح عليه السلام مع قومه",
        "74": "عادة الأمم في تكذيب الأنبياء",
        "75S": "قصة موسى عليه السلام مع فرعون",
        "75": "١ - الحوار بين موسى وفرعون",
        "79": "٢ - إحضار فرعون السحرة لمقاومة دعوة موسى",
        "83": "٣ - إيمان طائفة من بني إسرائيل بدعوة موسى",
        "88": "٤ - دعاء موسى على فرعون وملئه",
        "90": "٥ - إغراق فرعون وجنوده وإنجاء بني إسرائيل",
        "94": "تأكيد صدق القرآن فيما قال ووعد وأوعد",
        "98": "قصة يونس عليه السلام مع قومه",
        "101": "فرضية النظر والتفكير وإنذار المهملين",
        "104": "إخلاص العبادة لله تعالى ونبذ الشرك",
        "108": "الإسلام دين الحق ووجوب اتباعه"
    },
    {
        "UNK0": "سورة هود عليه السلام",
        "1": "إحكام القرآن ودعوته إلى عبادة الله والتوبة إليه والإيمان بالبعث",
        "5": "إعراض الكفار عن الحق",
        "6": "فضل الله وعلمه وقدرته",
        "8": "موقف الإنسان المؤمن والكافر عند النعمة والنقمة",
        "12": "مطالبة مشركي مكة بإنزال كنز أو مجيء ملك مع النبي صلى الله عليه وسلم وتحديهم بالقرآن",
        "15": "من أراد الدنيا وحدها حرم نعيم الآخرة",
        "17": "من كان يريد الآخرة",
        "18": "الكافرون والمؤمنون وجزاء أعمال كل منهم",
        "25": "قصة نوح عليه السلام",
        "32": "استعجال قوم نوح العذاب ويأسه منهم",
        "36": "نهي نوح عن الاغتمام بهلاك قومه وأمره بصنع السفينة",
        "42": "انتهاء الطوفان ونجاة السفينة وهلاك ابن نوح مع استشفاع أبيه",
        "48": "العبرة من قصة نوح عليه السلام",
        "50": "قصة هود عليه السلام",
        "61": "قصة صالح عليه السلام",
        "69": "قصة إبراهيم عليه السلام -بشارته بإسحاق ويعقوب-",
        "77": "قصة لوط‍ عليه السلام مع قومه",
        "84": "قصة شعيب عليه السلام",
        "96": "قصة موسى عليه السلام مع فرعون وملئه",
        "100": "العبرة من قصص الأمم الظالمة في الدنيا",
        "103": "العبرة في قصص القرآن بجزاء الآخرة",
        "110": "التذكير بعاقبة الاختلاف في التوراة",
        "112": "الاستقامة على أوامر الله تعالى",
        "114": "الأمر بالصلاة والصبر",
        "116": "سبب إهلاك القرى والأمم السالفة",
        "120": "الفائدة العملية من قصص الأنبياء والأمر بالعبادة والتوكل على الله تعالى"
    },
    {
        "UNK0": "سورة يوسف عليه السلام",
        "1": "عربية القرآن ومنزلة القصص القرآني",
        "4": "الفصل الأول من قصة يوسف عليه السلام رؤيا يوسف وتعبير يعقوب الرؤيا",
        "7S": "الفصل الثاني من قصة يوسف يوسف وإخوته",
        "7": "١ - اتفاقهم على إلقائه في البئر",
        "11": "٢ - تنفيذ إخوة يوسف مؤامرتهم وتدليسهم الأمر على أبيهم",
        "19S": "الفصل الثالث من قصة يوسف نجاة يوسف وإكرامه في بيت العزيز",
        "19": "١ - تعلق يوسف بالدلو ومسيره مع السيارة",
        "21": "٢ - يوسف عند ملك مصر وإيتاؤه النبوة",
        "23": "الفصل الرابع من قصة يوسف يوسف وامرأة العزيز",
        "30": "الفصل الخامس من قصة يوسف انتشار الخبر بين نسوة المدينة ومؤامرة امرأة العزيز بهن وتقرير سجن يوسف",
        "36": "الفصل السادس من قصة يوسف يوسف في السجن ودعوته إلى الدين الحق",
        "41S": "الفصل السابع من قصة يوسف",
        "41": "١ - تأويل يوسف رؤيا صاحبيه في السجن ووصيته للناجي منهما",
        "43": "٢ - تأويل يوسف رؤيا الملك",
        "50S": "الفصل الثامن من قصة يوسف",
        "50": "١ - طلب الملك رؤية يوسف والأمر بإخراجه من السجن وامتناعه من الخروج حتى تثبت براءته",
        "53": "٢ - النفس الأمارة بالسوء",
        "54": "الفصل التاسع من قصة يوسف يوسف في رئاسة الحكم ووزارة المالية",
        "58": "الفصل العاشر من قصة يوسف أولاد يعقوب يشترون القمح من أخيهم يوسف ومطالبته إياهم بإحضار أخيهم",
        "63": "الفصل الحادي عشر من قصة يوسف مفاوضة إخوة يوسف أباهم لإرسال أخيهم بنيامين معهم في المرة القادمة",
        "67": "الفصل الثاني عشر من قصة يوسف وصية يعقوب لأولاده بالدخول إلى مصر من أبواب متفرقة",
        "69": "الفصل الثالث عشر من قصة يوسف معرفة يوسف أخاه بنيامين واتخاذه التدابير لإبقائه لديه",
        "77": "الفصل الرابع عشر من قصة يوسف نقاش حاد بين أولاد يعقوب وبين يوسف وبين أبيهم حول السرقة المزعومة",
        "88": "الفصل الخامس عشر من قصة يوسف تعرف أولاد يعقوب على يوسف في المرة الثالثة واعترافهم بخطئهم وعفوه عنهم",
        "94": "الفصل السادس عشر من قصة يوسف إخبار يعقوب بريح يوسف وتأييده ببشارة البشير",
        "99": "الفصل السابع عشر من قصة يوسف لقاء أسرة يعقوب عليه السلام في مصر",
        "101": "الفصل الثامن عشر من قصة يوسف دعاء جامع يتضمن تحدث يوسف بنعم الله عليه وطلبه من ربه حسن الخاتمة",
        "102": "الفصل التاسع عشر من قصة يوسف إثبات نبوة محمد صلى الله عليه وسلم الإخبار عن المغيبات والإعراض عن التأمل في الآيات ودعوة النبي إلى التوحيد",
        "109": "الفصل العشرون من قصة يوسف العبرة من القصص القرآني"
    },
    {
        "UNK0": "سورة الرعد",
        "1": "القرآن حق",
        "2": "بعض مظاهر قدرة الله في السموات والأرض",
        "5": "إنكار المشركين البعث واستعجالهم العذاب ومطالبتهم بإنزال آية مادية على النبي صلى الله عليه وسلم",
        "8": "بعض مظاهر علم الله المحيط‍ بكل شيء",
        "12": "مظاهر ألوهية الله وربوبيته وقدرته",
        "16": "وحدانية الله ومثل المؤمن والمشرك تجاه الوحدانية",
        "17": "مثل الحق والباطل ومآل السعداء والأشقياء",
        "20": "أوصاف أولي الألباب السعداء وجزاؤهم",
        "25": "صفات الأشقياء وجزاؤهم",
        "26": "الرزق على الله والآيات بيد الله والهداية من الله لمن آمن بالله",
        "30": "محمد صاحب الرسالة والرسول وبيان عظمة القرآن وقدرة الله الشاملة",
        "35": "صفة الجنة وموقف أهل الكتاب من نبوة النبي صلى الله عليه وسلم وشبهات المشركين حولها",
        "40": "مهمة الرسول تبليغ الشريعة والله شاهد له ومحاسب وحاكم بين العباد ومحبط‍ مكر الكفار"
    },
    {
        "UNK0": "سورة إبراهيم عليه السلام",
        "1": "الغاية من إنزال القرآن وذم الكافرين وكون الرسول بلسان قومه",
        "5": "مهمة الرسول موسى عليه السلام ونصائحه لقومه",
        "9": "بعض أخبار الرسل السابقين مع أممهم",
        "13": "تهديد الكفار لرسلهم بالطرد أو الردة والوحي بأن العاقبة للأنبياء",
        "19": "دليل وحدانية الله ووجوده وقدرته على معاد الأبدان",
        "21": "الحوار بين الأشقياء يوم العذاب والمناظرة بين الشيطان وأتباعه وظفر السعداء بالجنة",
        "24": "مثال الكلمة الطيبة من السعداء ومثال الكلمة الخبيثة من الأشقياء",
        "28": "كفران النعمة واتخاذ الأنداد وتهديد الكافرين بالتمتع بنعيم الدنيا وأمر المؤمنين بإقامة الصلاة والإنفاق",
        "32": "أدلة وجود الله والتوحيد في الكون والأنفس",
        "35": "دعاء إبراهيم عليه السلام مستقبل البيت الحرام",
        "42": "ما يدل على وجود القيامة وأوصافها أو تأخير عذاب القيامة وأحوال المعذبين وتبدل السموات والأرض"
    },
    {
        "UNK0": "سورة الحجر",
        "1": "وصف القرآن وتهديد الكافرين والعصاة",
        "6": "بعض مقالات المشركين في النبي صلى الله عليه وسلم والرد القاطع عليها",
        "16": "بعض مظاهر قدرة الله تعالى من خلق السموات والأرض وإرسال الرياح لواقح والإحياء والإماتة والعلم الشامل والحشر",
        "26": "بدء خلق الإنسان وأمر الملائكة بالسجود له وإباء إبليس وعداؤه البشر",
        "45": "جزاء المتقين يوم القيامة",
        "49": "المغفرة والعذاب",
        "51": "قصة ضيف إبراهيم وإخبارهم بإهلاك قوم لوط‍",
        "78": "قصة أصحاب الأيكة (قوم شعيب) وأصحاب الحجر (ثمود)",
        "87": "أفضال الله تعالى على نبيه المصطفى صلى الله عليه وسلم"
    },
    {
        "UNK0": "سورة النحل",
        "1": "إثبات البعث والوحي",
        "3": "أدلة وجود الله ووحدانيته",
        "10": "أدلة أخرى لإثبات الألوهية والوحدانية",
        "17": "خواص الألوهية الخلق وعلم السر والعلن والحياة الأبدية",
        "24": "صفات المستكبرين إنكار المشركين الوحي المنزل والنبوة وجزاؤهم",
        "30": "صفات المتقين إيمان المتقين بالوحي المنزل وجزاؤهم",
        "33": "تهديد المشركين على تماديهم في الباطل",
        "35": "احتجاج الكفار بالقدر وإنكارهم البعث وتشابه مهمة الرسل",
        "41": "جزاء المهاجرين وبشرية الرسل ومهمة النبي صلى الله عليه وسلم في بيان القرآن، وتهديد الكافرين",
        "51": "مناقشة عقائد المشركين وأعمالهم القبيحة",
        "63": "عادة الأمم في تكذيب الرسل ومهمة النبي في تبيان القرآن وجعله هدى ورحمة",
        "65": "من دلائل القدرة الإلهية والتوحيد ومظاهر النعم على الناس",
        "70": "بعض عجائب أحوال الناس الدالة على قدرة الله وتوحيده",
        "75": "مثلان للأصنام والأوثان",
        "77": "علم الله الغيب وخلقه الإنسان والطير",
        "80": "بعض دلائل التوحيد وأنواع النعم والفضل الإلهي",
        "84": "وعيد المشركين وأحوالهم يوم القيامة بعث الشاهد عليهم وعلى المؤمنين وعدم تخفيف العذاب ومضاعفته عليهم وتكذيب المعبودات لهم",
        "90": "أجمع آية في القرآن للخير والشر والوفاء بالعهد والهداية والإضلال",
        "97": "أجمع آية للرجال والنساء في الترغيب بالعمل الصالح",
        "98": "ما يتعلق بالقرآن الاستعاذة والنسخ وعربية القرآن",
        "106": "المرتدون عن الإسلام والمهاجرون بعد ما فتنوا",
        "112": "عاقبة كفران النعم في الدنيا",
        "114": "الحلال الطيب والحرام الخبيث من المأكولات",
        "120": "إبراهيم عليه السلام واتباع ملته وتعظيم اليهود السبت",
        "125": "أسس الدعوة إلى الدين وجعل العقاب بالمثل والصبر على المصاب"
    },
    {
        "UNK0": "سورة الإسراء",
        "1": "الإسراء وإنزال التوراة على موسى",
        "4": "أحوال بني إسرائيل في التاريخ",
        "9": "أهداف القرآن الكريم",
        "12": "التذكير بنعم الله في الدنيا ودلائل القدرة الإلهية",
        "18": "جزاء من أراد الدنيا ومن أراد الآخرة",
        "22": "أصول تنظيم المجتمع المسلم التوحيد أساس الإيمان وترابط‍ الأسرة المسلمة دعامة المجتمع",
        "31": "أصول أخرى لنظام المجتمع الإسلامي",
        "40": "تقريع على نسبة الولد والشريك إلى الله تعالى",
        "45": "حماية النبي صلى الله عليه وسلم من أذى المشركين إذا قرأ القرآن",
        "49": "إنكار المشركين البعث والرد عليهم",
        "53": "مجادلة المخالفين باللين وبالتي هي أحسن",
        "56": "تفنيد آخر لشبهات المشركين",
        "61": "قصة آدم مع إبليس-أمر الملائكة بالسجود",
        "66": "بعض نعم الله تعالى على الإنسان",
        "71": "أحوال الناس مع قادتهم يوم القيامة",
        "73": "محاولة المشركين فتنة النبي صلى الله عليه وآله وسلم وطرده من مكة",
        "78": "أوامر وتوجيهات وتعليمات للنبي صلى الله عليه وآله وسلم",
        "86": "إعجاز القرآن",
        "90": "اقتراح المشركين إنزال إحدى آيات ست",
        "94": "من شبهات المشركين بشرية الرسل وإنكار البعث",
        "101": "الآيات التسع لموسى عليه السلام وصفة إنزال القرآن",
        "110": "دعاء الله بالأسماء الحسنى"
    },
    {
        "UNK0": "سورة الكهف",
        "1": "كيفية الحمد والثناء على الله تعالى ومهام القرآن العظيم",
        "9": "قصة أصحاب الكهف",
        "27": "توجيهات للنبي صلى الله عليه وآله وسلم وللمؤمنين تلاوة القرآن والصبر على مجالسة الفقراء وإظهار كون الحق من عند الله",
        "32": "صاحب الجنتين مثل الغني المغتر بماله والفقير المعتز بعقيدته",
        "45": "مثل الحياة الدنيا",
        "47": "تسيير الجبال والحشر وعرض صحائف الأعمال يوم القيامة",
        "50": "قصة السجود لآدم عليه السلام",
        "54": "بيان القرآن ومهمة الرسل وظلم المعرض عن الإيمان وسبب تأخير العذاب لموعد معين",
        "60": "قصة موسى عليه السلام مع الخضر",
        "75": "تتمة قصة موسى مع الخضر",
        "83": "قصة ذي القرنين ويأجوج ومأجوج",
        "100": "جزاء الكفار",
        "107": "جزاء المؤمنين وسعة معلومات الله وتوحيده"
    },
    {
        "UNK0": "سورة مريم",
        "1": "دعاء زكريا عليه السلام طالبا الولد وبشارته بيحيى",
        "12": "إيتاء يحيى عليه السلام النبوة والحكم صبيا",
        "16S": "قصة مريم",
        "16": "١ - حملها بعيسى عليه السلام",
        "23": "٢ - ولادة عيسى وما اقترن بها",
        "27": "٣ - نبوة عيسى ونطقه وهو طفل في المهد",
        "34": "٤ - اختلاف النصارى في شأن عيسى",
        "41": "قصة إبراهيم عليه السلام أو مناقشته لأبيه في عبادة الأصنام",
        "51": "قصة موسى عليه السلام",
        "54": "قصة إسماعيل عليه السلام",
        "56": "قصة إدريس عليه السلام",
        "58": "جملة صفات الأنبياء عليهم السلام",
        "59": "صفات خلف الأنبياء وجزاؤهم وصفات التائبين ومستحقي الجنة",
        "64": "تنزل الوحي بأمر الله تعالى",
        "66": "شبهة المشركين في إنكار البعث",
        "73": "شبهة أخرى للمشركين بحسن الحال في الدنيا",
        "77": "مقالة المشركين في البعث والحشر استهزاء وطعنا",
        "81": "الرد على عباد الأصنام بصيرورتهم لهم أعداء واتخاذهم الشياطين أولياء",
        "88": "الرد على من نسب الولد إلى الله تعالى",
        "96": "محبة المؤمنين وتيسير الذكر المبين وإهلاك المجرمين"
    },
    {
        "UNK0": "سورة طه",
        "1": "القرآن سبب السعادة",
        "9S": "قصة موسى عليه السلام",
        "9": "١ - تكليم ربه إياه (أو مناجاة موسى) وابتداء الوحي إليه في الوادي المقدس",
        "17": "٢ - انقلاب عصا موسى حية (المعجزة الأولى)",
        "22": "٣ - اليد البيضاء (المعجزة الثانية)",
        "36": "٤ - نعم الله الثمان على موسى قبل النبوة",
        "42": "٥ - التوجيهات لموسى وهارون في دعوة فرعون",
        "49": "٦ - الحوار بين فرعون وموسى حول الربوبية",
        "56": "٧ - اتهام موسى بالسحر",
        "60": "٨ - جمع فرعون السحرة وتحذير موسى لهم",
        "65": "٩ - المبارزة بين موسى والسحرة وإعلان إيمانهم بالله تعالى",
        "77": "١٠ - إغراق فرعون وجنوده في البحر ونعم الله على بني إسرائيل",
        "83": "١١ - تكليم الله موسى في الميقات وفتنة السامري بصناعة العجل إلها",
        "90": "١٢ - معاتبة موسى لهارون على تأليه العجل وإلقائه في البحر وتوحيد الإله الحق",
        "99": "العبرة من القصص القرآني وجزاء المعرض عن القرآن",
        "105": "أحوال الأرض والجبال والناس يوم القيامة",
        "113": "عربية القرآن ووعيده وعدم التعجل بقراءته قبل إتمام الوحي",
        "115": "قصة آدم في الجنة وإخراجه منها وإلزامه بالهداية الربانية",
        "128": "الاعتبار بهلاك الأمم الماضية والصبر على أذى المشركين وعدم الالتفات إلى متعهم وأمر الأهل بالصلاة",
        "133": "اقتراح المشركين الإتيان بمعجزة أو إرسال رسول وتهديدهم بمآل المستقبل"
    },
    {
        "UNK0": "سورة الأنبياء",
        "1": "غفلة الناس عن الحساب يوم القيامة ودليل ذلك",
        "7": "بشرية الرسل وإنجاز الوعد لهم وجعل القرآن عظة",
        "11": "الإنذار بعذاب الاستئصال والتذكير بعجائب الخلق",
        "21": "توبيخ المشركين وإثبات الوحدانية",
        "30": "توبيخ آخر للمشركين على عدم تدبر آيات الكون الدالة على وجود الإله الواحد",
        "34": "موت جميع الخلائق ومجيء القيامة أو عذاب النار بغتة",
        "42": "حراسة الله وحفظه للإنسان وعدل الحساب",
        "48": "القصة الأولى-قصة موسى عليه السلام مقارنة بين خصائص التوراة وخصائص القرآن",
        "51S": "القصة الثانية-قصة إبراهيم عليه السلام",
        "51": "١ - إنكار عبادة الأصنام والدعوة إلى توحيد الله تعالى",
        "59": "٢ - النقاش الحاد بين إبراهيم وقومه بعد كارثة تكسير الأصنام",
        "66": "٣ - الانتصار الساحق لإبراهيم-نجاته من النار",
        "71": "٤ - نعم أخرى على إبراهيم وإنجاؤه مع لوط‍ إلى الأرض المباركة",
        "74": "القصة الثالثة-قصة لوط‍ عليه السلام",
        "76": "القصة الرابعة-قصة نوح عليه السلام",
        "78": "القصة الخامسة-قصة داود وسليمان عليهما السلام",
        "83": "القصة السادسة-قصة أيوب عليه السلام",
        "85": "القصة السابعة-قصة إسماعيل وإدريس وذي الكفل عليهم السلام",
        "87": "القصة الثامنة-قصة يونس عليه السلام",
        "89": "القصة التاسعة والعاشرة-قصة زكريا ويحيى عليهما السلام مع قصة مريم",
        "92": "وحدة الرسالات السماوية والسنة الإلهية",
        "98": "أحوال الكافرين والمؤمنين في الآخرة وحال السماء فيها",
        "107": "نبي الرحمة المهداة"
    },
    {
        "UNK0": "سورة الحج",
        "1": "الأمر بتقوى الله تعالى",
        "5": "الاستدلال بخلق الإنسان والنبات على البعث",
        "8": "أحوال الناس الجدال بالباطل والإيمان المضطرب وجزاء المؤمنين الصالحين",
        "15": "حال اليائس من نصرة الرسول وإنزال الآيات البينات",
        "17": "الفصل الإلهي بين الأمم وخضوع كل ما في الكون لعزة الله",
        "19": "جزاء الكافرين والمؤمنين",
        "25": "المنع من المسجد الحرام",
        "26": "تعيين مكان البيت الحرام والأمر بالحج إليه",
        "30": "تعظيم حرمات الله وشعائره",
        "36": "التسمية عند ذبح البدن والأكل والإطعام منها",
        "38": "دفاع الله عن المؤمنين وأسباب مشروعية القتال",
        "42": "الاعتبار بهلاك الأمم السابقة",
        "49": "تحديد مهمة النبي صلى الله عليه وسلم",
        "52": "إحكام الوحي وصونه عن الشياطين قصة الغرانيق",
        "58": "وعده الكريم بالنصر والجنة للمهاجرين المقاتلين دفاعا عن النفس",
        "61": "من دلائل قدرة الله تعالى",
        "67": "لكل أمة شريعة ومنهاج ملائمان",
        "71": "بعض أباطيل المشركين وتحديهم بخلق ذبابة",
        "77": "أوامر التشريع والأحكام"
    },
    {
        "UNK0": "سورة المؤمنون",
        "1": "خصال المؤمنين",
        "12S": "من أدلة وجود الله وقدرته",
        "12": "١ - خلق الإنسان",
        "17": "٢ - خلق السموات وإنزال الأمطار وتسخير الأنعام",
        "23": "القصة الأولى-قصة نوح عليه السلام",
        "31": "القصة الثانية-قصة هود عليه السلام",
        "42": "القصة الثالثة-قصص صالح ولوط‍ وشعيب وغيرهم عليهم السلام",
        "45": "القصة الرابعة-قصة موسى وهارون عليهما السلام",
        "50": "القصة الخامسة-قصة عيسى وأمه مريم عليهما السلام",
        "51": "مبادئ التشريع في الحياة",
        "57": "صفات المسارعين في الخيرات",
        "63": "إنكار أعمال الكفار ومشركي قريش وأسبابها",
        "78": "نعم الله العظمى على عباده",
        "81": "إنكار المشركين البعث وإثباته بالأدلة القاطعة",
        "91": "نفي الولد والشريك لله تعالى",
        "93": "إرشادات إلى النبي صلى الله عليه وسلم",
        "99": "تمني الإنسان عند الموت الرجوع إلى الدنيا ليعمل صالحا",
        "101": "موازين النجاة في حساب الآخرة",
        "112": "التنبيه على قصر مدة اللبث في الدنيا وعقاب المشركين ورحمة المؤمنين"
    },
    {
        "UNK0": "سورة النور",
        "1": "ميزة سورة النور",
        "2": "الحكم الأول والثاني حد الزنى وحكم الزناة",
        "4": "الحكم الثالث حد القذف",
        "6": "الحكم الرابع حكم اللعان أو قذف الرجل زوجته",
        "11": "الحكم الخامس قصة الإفك",
        "23": "جزاء القذفة الأخروي في قصة الإفك",
        "27": "الحكم السادس الاستئذان لدخول البيوت وآدابه",
        "30": "الحكم السابع حكم النظر والحجاب",
        "32": "الحكم الثامن والتاسع والعاشر زواج الأحرار ومكاتبة الأرقاء والإكراه على الزنى",
        "35": "الله منور السموات والأرض بدلائل الإيمان وغيرها",
        "36": "المؤمنون المهتدون بنور الله تعالى",
        "39": "حال الكافرين في الدنيا وخسرانهم في الآخرة",
        "41": "الأدلة الكونية على وجود الله وتوحيده",
        "47": "البقاء على الضلال والنفاق بالرغم من البيان الشافي",
        "51": "الطاعة والامتثال عند المؤمنين",
        "55": "أصول دولة الإيمان",
        "58": "الحكم الحادي عشر والثاني عشر والثالث عشر حالات الاستئذان في داخل الأسرة وتخفيف الثياب الظاهرة عن العجائز",
        "61": "إباحة الأكل من بيوت معينة دون إذن",
        "62": "الاستئذان عند الخروج وأدب خطاب النبي صلى الله عليه وسلم والتحذير من مخالفة أمره"
    },
    {
        "UNK0": "سورة الفرقان",
        "1": "إنزال القرآن ووحدانية الله تعالى",
        "4": "مطاعن المشركين في القرآن",
        "7": "طعن المشركين في النبي المنزل عليه القرآن",
        "11": "إنكار المشركين يوم القيامة وحالهم فيه ومقارنتهم بأهل الجنة",
        "17": "أحوال الكفار مع معبوداتهم يوم القيامة",
        "20": "بشرية الرسل",
        "21": "طلب المشركين إنزال الملائكة عليهم أو رؤية الله والإخبار بإحباط‍ أعمالهم",
        "25": "رهبة يوم القيامة وهوله",
        "30": "هجر الكفار القرآن ومطالبتهم بإنزاله جملة واحدة",
        "35": "قصص بعض الأنبياء وعقوبات مكذبيهم",
        "41": "استهزاء المشركين بالنبي صلى الله عليه وسلم وتسمية دعوته إضلالا",
        "45": "أدلة خمسة على وجود الله وتوحيده",
        "55": "جهل المشركين في عبادة الأوثان وتوجيه النبي وسبب جعل العبادة للرحمن",
        "63": "صفات عباد الرحمن"
    },
    {
        "UNK0": "سورة الشعراء",
        "1": "تكذيب المشركين بالقرآن وإنذارهم وإثبات وحدانية الله",
        "10S": "القصة الأولى قصة موسى وهارون عليهما السلام مع فرعون وقومه",
        "10": "١ - امتنان فرعون على موسى بتربيته",
        "23": "٢ - الجدل بين موسى وفرعون في إثبات وجود الله",
        "32": "٣ - معجزة موسى عليه السلام ووصف فرعون لها بالسحر",
        "38": "٤ - إيمان السحرة بالله في المبارزة الحاسمة في مشهد عظيم",
        "52": "٥ - نجاة موسى وقومه وإغراق فرعون وجنده",
        "69S": "القصة الثانية قصة إبراهيم عليه السلام",
        "69": "١ - التنديد بعبادة الأصنام وبيان صفات الرب المستحق للعبادة",
        "83": "٢ - دعاء إبراهيم عليه السلام دعاء المخلصين الأوابين",
        "90": "٣ - أوصاف يوم القيامة وثواب الله وعقابه وندم المشركين على ضلالهم",
        "105": "القصة الثالثة قصة نوح عليه السلام مع قومه",
        "123": "القصة الرابعة قصة هود عليه السلام مع قومه",
        "141": "القصة الخامسة قصة صالح عليه السلام مع قومه",
        "160": "القصة السادسة قصة لوط‍ عليه السلام مع قومه",
        "176": "القصة السابعة قصة شعيب عليه السلام مع قومه",
        "192": "إنزال القرآن من عند الله لإنذار المشركين وبشارة المؤمنين",
        "213": "آداب الداعية وواجباته",
        "221": "الرد على افتراء المشركين بأن النبي كاهن أو شاعر"
    },
    {
        "UNK0": "سورة النمل",
        "1": "رسالة القرآن",
        "7": "القصة الأولى قصة موسى عليه السلام بالوادي المقدس",
        "15S": "القصة الثانية قصة داود وسليمان عليهما السلام",
        "15": "١ - نعم الله الجليلة عليهما",
        "20": "٢ - قصة الهدهد مع سليمان عليه السلام",
        "29": "٣ - جواب بلقيس على كتاب سليمان عليه السلام",
        "38": "٤ - إسلام بلقيس وولاؤها وزيارتها لسليمان عليه السلام",
        "45": "القصة الثالثة قصة صالح عليه السلام مع قومه",
        "54": "القصة الرابعة قصة لوط‍ عليه السلام مع قومه",
        "56": "تتمة قصة لوط‍ عليه السلام",
        "59": "أدلة الوحدانية والقدرة الإلهية",
        "65": "لا يعلم الغيب إلا الله",
        "67": "إنكار المشركين البعث",
        "76": "إثبات نبوة محمد صلى الله عليه وسلم بالقرآن الكريم",
        "82S": "من أمارات القيامة ومقدماتها",
        "82": "١ - إخراج دابة الأرض وحشر الظالمين المكذبين بآيات الله ورسله أمام ربهم",
        "87": "٢ - النفخ في الصور وتسيير الجبال",
        "91": "الاشتغال بعبادة الله وحمده وتلاوة القرآن"
    },
    {
        "UNK0": "سورة القصص",
        "1S": "قصة موسى عليه السلام",
        "1": "١ - نصرة المستضعفين",
        "7": "٢ - إلقاء موسى في اليم بعد ولادته وإرضاعه والبشارة بنبوته",
        "15": "٣ - قتل المصري خطأ وخروجه من مصر",
        "22": "٤ - ذهاب موسى عليه السلام إلى أرض مدين وزواجه بابنة شعيب عليه السلام",
        "29": "٥ - عودة موسى عليه السلام إلى مصر ونبوته",
        "33": "٦ - نبوة هارون وتكذيب فرعون",
        "38": "٧ - محاجة فرعون في ربوبية الله تعالى وعاقبة عناده مع قومه",
        "44": "الحاجة إلى إرسال الرسل وبعثة محمد صلى الله عليه وسلم",
        "48": "تكذيب أهل مكة بالقرآن وبرسالة النبي صلى الله عليه وسلم.",
        "52": "إيمان طوائف من أهل الكتاب بالقرآن",
        "56": "الرد على شبهات المشركين",
        "62": "تقريع المشركين يوم القيامة بأسئلة ثلاثة",
        "68": "صاحب الحق المطلق في الاختيار المستحق للحمد والعبادة",
        "71": "أدلة العظمة والسلطان الإلهي وتأكيد تقريع المشركين",
        "76S": "قصة قارون",
        "76": "١ - بغيه على قوم موسى واغتراره بماله",
        "79": "٢ - بعض مظاهر بغي قارون وكبريائه",
        "83": "٣ - محل الجزاء ومقداره والعبرة من قصة قارون",
        "85": "قصص النبي صلى الله عليه وسلم وأصحابه مع قومه"
    },
    {
        "UNK0": "سورة العنكبوت",
        "1": "اختبار الناس وجزاؤهم",
        "8": "صلابة المكلفين ومظاهر فتنة المؤمنين وتهديد الكافرين والمنافقين",
        "14": "قصة نوح عليه السلام مع قومه",
        "16S": "قصة إبراهيم عليه السلام مع قومه",
        "16": "١ - الأدلة على الأصول الثلاثة: الوحدانية والرسالة والبعث",
        "24": "٢ - جواب قوم إبراهيم له وإيمان لوط‍ به وتعداد النعم عليه",
        "28": "قصة لوط‍ عليه السلام مع قومه",
        "36": "قصص شعيب وهود وصالح وموسى عليهم السلام مع أقوامهم",
        "41": "تشبيه حال عبدة الأصنام بحال العنكبوت",
        "44": "فائدة خلق السموات والأرض وتلاوة القرآن وإقامة الصلاة",
        "46": "طريقة إرشاد أهل الكتاب",
        "50": "بعض مطالب المشركين التعجيزية الإتيان بمعجزات حسية واستعجال بالعذاب",
        "56": "الأمر بالهجرة عند تعذر إقامة الشعائر الدينية",
        "61": "اعتراف المشركين بالإله الخالق الرازق المحيي",
        "64": "بيان حال الدنيا واضطراب أوضاع الكفار فيها"
    },
    {
        "UNK0": "سورة الروم",
        "1": "الإخبار بالغيب في المستقبل",
        "8": "الحث على التفكر في المخلوقات الدالة على وجود الله ووحدانيته",
        "11": "إثبات الإعادة والحشر وبيان ما يكون وقت الرجوع إلى الله",
        "17": "تنزيه الله تعالى وحمده في جميع الأحوال",
        "20": "بعض أدلة الوحدانية والقدرة والحشر",
        "28": "إثبات الوحدانية من واقع البشر",
        "30": "الأمر باتباع الإسلام دين الفطرة والتوحيد",
        "33": "سوء حال بعض الناس بالرجوع إلى الله أحيانا ثم الشرك والنكول",
        "38": "الترغيب بالنفقة وأنواع العطاء وضمان الرزق وإثبات الحشر والتوحيد",
        "41": "جزاء المفسدين والكافرين وجزاء المؤمنين",
        "46": "الاستدلال بالرياح والأمطار على قدرة الله وتوحيده",
        "52": "تسلية النبي صلى الله عليه وسلم عما يلقاه من الإعراض عن دعوته",
        "54": "أطوار حياة الإنسان",
        "55": "أحوال البعث ومقارنتها بأحوال الدنيا",
        "58": "مهمة القرآن في بيان أدلة العقيدة وأمر النبي بالصبر على الأذى والدعوة"
    },
    {
        "UNK0": "سورة لقمان",
        "1": "خصائص القرآن وأوصاف المؤمنين به",
        "6": "إعراض الكافرين عن القرآن وإقبال المؤمنين عليه",
        "10": "الاستدلال بخلق السموات والأرض على وحدانية الله وإبطال الشرك",
        "12": "قصة لقمان الحكيم ووصيته لابنه",
        "20": "توبيخ المشركين على الشرك مع مشاهدة دلائل التوحيد",
        "22": "سلامة منهج المؤمن وسوء طريقة الكافر",
        "25": "إثبات وجود الله وسعة علمه وشمول قدرته على البعث وكل شيء",
        "33": "الأمر بتقوى الله وبيان مفاتح الغيب"
    },
    {
        "UNK0": "سورة السجدة",
        "1": "إثبات النبوة (الرسالة)",
        "4": "دلائل التوحيد والقدرة الإلهية",
        "10": "إثبات البعث وحال الكفار يوم القيامة",
        "15": "صفة المؤمنين في الدنيا وجزاؤهم عند ربهم في الآخرة",
        "18": "جزاء المؤمنين وجزاء الفاسقين",
        "23": "عقد الصلة بين الرسالتين إنزال التوراة على موسى عليه السلام وموقف اليهود منها",
        "26": "تأكيد ثبوت التوحيد والقدرة والحشر"
    },
    {
        "UNK0": "سورة الأحزاب",
        "1": "الأمر بتقوى الله واتباع الوحي والتوكل على الله",
        "4": "تعدد القلب والظهار والتبني",
        "6": "مكانة النبي صلى الله عليه وسلم ومهمته وتشريع الميراث بقرابة الرحم",
        "9": "غزوة الأحزاب أو الخندق وبني قريظة",
        "28": "تخيير زوجات النبي صلى الله عليه وسلم بين الدنيا والآخرة ومقدار ثوابهن وعقابهن",
        "31": "خصائص أهل بيت النبوة",
        "35": "المساواة بين الرجال والنساء في ثواب الآخرة",
        "36": "قصة زيد بن حارثة وزينب بنت جحش رضي الله عنهما",
        "41": "تعظيم الله تعالى وإجلاله بالأذكار والتسابيح الكثيرة",
        "45": "مهام دعوة النبي صلى الله عليه وسلم",
        "50": "النساء اللاتي أحل الله زواجهن بالنبي صلى الله عليه وسلم",
        "53": "آداب دخول البيت النبوي وحجاب نساء النبي صلى الله عليه وسلم",
        "56": "تعظيم النبي صلى الله عليه وسلم وجزاء إيذائه وإيذاء المؤمنين",
        "59": "آية جلباب النساء لستر العورة",
        "60": "تهديد المنافقين وجزاؤهم",
        "63": "توعد الكفار بقرب الساعة وبيان نوع جزائهم",
        "69": "تحريم الإيذاء الذي لا يؤدي إلى الكفر والأمر بالتقوى",
        "72": "أمانة التكاليف وأثرها في تصنيف المكلفين"
    },
    {
        "UNK0": "سورة سبأ",
        "1": "صفات الملك والقدرة والعلم لله تعالى",
        "3": "إنكار الكفار الساعة وموقف الناس من آيات الله وجزاؤهم",
        "7": "استبعاد الكفار قيام الساعة واستهزاؤهم بالرسول صلى الله عليه وسلم والاستدلال على البعث",
        "10": "نعم الله على داود عليه السلام",
        "12": "نعم الله على سليمان عليه السلام",
        "15": "قصة سبأ وسيل العرم",
        "22": "إبطال شفاعة آلهة المشركين",
        "24": "إقرار المشركين بأن الله هو الرازق وإعلامهم بالحاكم ووقت الحكم",
        "31": "إنكار المشركين القرآن والحوار يوم القيامة بين الضالين والمضلين",
        "34": "تسلية النبي صلى الله عليه وسلم ظاهرة الكفر بين المترفين واعتدادهم بالأموال والأولاد",
        "40": "تقريع الكفار يوم القيامة أمام معبوداتهم",
        "43": "أسباب تعذيب الكفار",
        "51": "تهديد الكفار بشديد العقاب وإيمانهم حين معاينة العذاب"
    },
    {
        "UNK0": "سورة فاطر",
        "1": "بعض أدلة القدرة الإلهية والتذكير بنعم الله وإثبات التوحيد والرسالة",
        "5": "تقرير الحشر والتحذير من الشيطان وجزاء الكافرين والمؤمنين",
        "9": "من دلائل القدرة الإلهية لإثبات البعث",
        "12": "من دلائل الوحدانية والقدرة الإلهية",
        "15": "سبب العبادة والمسؤولية الشخصية وانتفاع العابدين بالإنذار",
        "19": "مثل المؤمن والكافر وإرسال الرسل في الأمم",
        "27": "العلوم العملية الطبيعية دليل آخر على وحدانية الله وقدرته وحال العلماء أمام مشاهد الكون",
        "31": "تصديق القرآن لما تقدمه وأنواع ورثته وجزاء المؤمنين",
        "36": "جزاء الكافرين وأحوالهم في النار وتهديدهم على كفرهم",
        "40": "مناقشة المشركين في عبادة الأوثان وإنكار التوحيد",
        "42": "إنكار المشركين الرسالة النبوية وتهديدهم بالإهلاك"
    },
    {
        "UNK0": "سورة يس",
        "1": "القرآن والرسول والمرسل إليهم",
        "13": "قصة أصحاب القرية-أنطاكية",
        "28": "تتمة قصة أصحاب القرية -تعذيب مكذبي الرسل-",
        "33": "أدلة القدرة الإلهية على البعث وغيره",
        "45": "موقف الكفار من تقوى الله وآيات الله والشفقة على خلق الله",
        "48": "إنكار الكفار يوم البعث وبيان أنه حق لا شك فيه",
        "55": "جزاء المحسنين",
        "59": "جزاء المجرمين",
        "69": "إثبات وجود الله ووحدانيته وبيان خواص الرسالة",
        "77": "إثبات البعث"
    },
    {
        "UNK0": "سورة الصافات",
        "1": "إعلان وحدانية الله",
        "6": "تزيين السماء بالكواكب",
        "11": "إثبات المعاد-الحشر والنشر والقيامة",
        "22": "مسئولية المشركين في الآخرة وأسبابها",
        "38": "جزاء الكافرين وجزاء المؤمنين المخلصين",
        "62": "جزاء الظالمين وأنواع العذاب في جهنم",
        "75": "قصة نوح عليه السلام",
        "83S": "قصة إبراهيم عليه السلام",
        "83": "١ - تحطيم الأصنام",
        "102": "٢ - قصة الذبيح",
        "114": "قصة موسى وهارون عليهما السلام",
        "123": "قصة إلياس عليه السلام",
        "133": "قصة لوط‍ عليه السلام",
        "139": "قصة يونس عليه السلام",
        "149": "تفنيد عقائد المشركين",
        "171": "نصر جند الله تعالى"
    },
    {
        "UNK0": "سورة ص",
        "1": "مناقشة المشركين في عقائدهم",
        "12": "إنذار الكفار بحال الأمم المكذبة قبلهم",
        "17": "قصة داود عليه السلام",
        "27": "إثبات البعث والثواب والعقاب وبيان فضل القرآن",
        "30": "قصة سليمان عليه السلام",
        "41": "قصة أيوب عليه السلام",
        "45": "قصة إبراهيم وذريته عليهم السلام -إبراهيم وإسحاق ويعقوب وإسماعيل واليسع وذي الكفل-",
        "55": "عقاب الطاغين الأشقياء",
        "65": "بعض أدلة صدق النبي ص",
        "71": "قصة آدم عليه السلام",
        "86": "حال الداعي وحال الدعوة ومعجزة القرآن"
    },
    {
        "UNK0": "سورة الزمر",
        "1": "مصدر القرآن والأمر بالعبادة الخالصة لله تعالى",
        "5": "من أدلة التوحيد وكمال القدرة وكمال الاستغناء",
        "8": "تناقض الكفار واستقامة المؤمنين",
        "10": "نصائح للمؤمنين في العبادة ووعدهم ووعيد عبدة الأصنام",
        "21": "حال الدنيا",
        "22": "الهداية للإسلام",
        "27": "عربية القرآن وضرب الأمثال فيه",
        "32": "وعيد المكذبين ووعد المصدقين",
        "38": "تزييف طريقة عبدة الأصنام وتهديدهم",
        "41": "مظاهر القدرة التامة والعلم الكامل لله عز وجل",
        "49": "دعاء الإنسان عند الضر وجحوده عند النعمة وإعلامه بأن الرزق بيد الله",
        "53": "مغفرة الذنوب بالتوبة وإخلاص العمل",
        "60": "حال المشركين المكذبين وحال المتقين يوم القيامة",
        "62": "دلائل الألوهية والتوحيد",
        "68": "نفختا الصور والفصل في الخصومات وإيفاء كل واحد حقه",
        "71": "أحوال أهل العقاب وأهل الثواب"
    },
    {
        "UNK0": "سورة غافر أو: المؤمن",
        "1": "مصدر تنزيل القرآن وحال المجادلين في آياته",
        "7": "محبة الملائكة حملة العرش للمؤمنين ونصرتهم",
        "10": "اعتراف الكفار بذنوبهم وباستحقاقهم العقاب الأخروي والتذكير بقدرة الله وفضله",
        "18": "أوصاف أخرى هائلة رهيبة ليوم القيامة",
        "23S": "قصة موسى عليه السلام مع فرعون وهامان",
        "23": "١ - تعذيب بني إسرائيل والتهديد بقتل موسى",
        "28": "٢ - قصة مؤمن آل فرعون ودفاعه عن موسى عليه السلام",
        "36": "٣ - بحث فرعون عن إله موسى استهزاء به وإنكارا لرسالته",
        "38": "٤ - متابعة الرجل المؤمن نصحه لقومه",
        "47": "المناظرة بين الرؤساء والأتباع في النار",
        "51": "نصر الرسل على أعدائهم في الدنيا والآخرة",
        "57": "من دلائل وجود الله وقدرته وحكمته",
        "66": "النهي عن عبادة غير الله وسبب النهي",
        "69": "جزاء المجادلين بالباطل في آيات الله",
        "77": "الصبر والنصر",
        "79": "دلائل أخرى كثيرة على وجود الله ووحدانيته",
        "82": "تهديد المكذبين المجادلين في آيات الله وتركهم الشرك حين رؤية العذاب"
    },
    {
        "UNK0": "سورة فصلت أو: السجدة",
        "1": "القرآن الكريم وإعراض المشركين عنه وبشرية الرسول ص",
        "9": "دليل وجود الله تعالى وكمال قدرته وحكمته",
        "13": "تهديد المشركين بمثل صاعقة عاد وثمود",
        "19": "كيفية عقوبة الكفار في الآخرة",
        "26": "الصد عن سماع القرآن الكريم",
        "30": "ما وعد الله به أهل الاستقامة",
        "33": "الدعوة إلى الله تعالى وآداب الدعاة",
        "37": "الأدلة الدالة على وجود الله وتوحيده وقدرته وحكمته",
        "40": "تهديد الملحدين في آيات الله تعالى وتنزيه القرآن العظيم عن الطعن فيه",
        "44": "التأكيد على عروبة القرآن الكريم",
        "47": "اختصاص علم الساعة بالله تعالى وانتهاء أسطورة الشرك فيها",
        "49": "تبدل أحوال الإنسان وتغير أطواره",
        "52": "ضرورة التأمل في الآيات والأنفس"
    },
    {
        "UNK0": "سورة الشورى",
        "1": "إنزال الوحي وعظمة الله ورقابته أحوال المشركين",
        "7": "مقاصد الوحي الإلهي",
        "13": "وحدة الأديان في أصولها",
        "15": "الأمر بالدعوة والاستقامة على المتفق عليه ودحض حجة المجادلين فيه",
        "20": "حتمية الجزاء للمؤمنين والظالمين وقبول التوبة",
        "27": "من مظاهر حكمة الله في خلقه وآياته على قدرته",
        "37": "صفات المؤمنين الكمل أهل الجنة",
        "44": "أحوال الكفار أمام النار",
        "47": "الاستجابة لنداء الله مالك السموات والأرض",
        "51": "أنواع الوحي"
    },
    {
        "UNK0": "سورة الزخرف",
        "1": "القرآن كلام الله بلغة العرب وعقاب المستهزئين بالأنبياء",
        "9": "من مصنوعات الله تعالى وصفاته",
        "15": "عبادة المشركين الملائكة",
        "26": "الرد على تقليد الآباء، واختيار الأنبياء وبيان حال الدنيا",
        "36": "حال المعرض عن ذكر الله وتثبيت النبي صلى الله عليه وسلم على دعوته",
        "46": "العبرة من قصة موسى عليه السلام وفرعون",
        "57": "العبرة من قصة عيسى عليه السلام",
        "67": "ألوان نعيم المتقين أهل الجنة",
        "74": "عذاب أهل النار وأسبابه",
        "81": "تنزيه الله سبحانه عن الولد والشريك"
    },
    {
        "UNK0": "سورة الدخان",
        "1": "إنزال القرآن في ليلة القدر المباركة وصفات منزله",
        "10": "تهديد المشركين بالعذاب",
        "17": "ضرورة الاعتبار بقوم فرعون وإنجاء بني إسرائيل",
        "34": "إنكار المشركين البعث وإثباته لهم",
        "40": "أهوال يوم القيامة التي يتعرض لها الكفار والعصاة",
        "51": "ما يلقاه المتقون من ألوان النعيم في الجنان"
    },
    {
        "UNK0": "سورة الجاثية",
        "1": "مصدر القرآن وإثبات الخالق ووحدانيته",
        "7": "وعيد المكذبين بآيات الله وجزاؤهم",
        "12": "من نعم الله تعالى على عباده",
        "16": "نعم الدين وإنزال الشرائع",
        "21": "الفارق بين المحسنين والمسيئين في المحيا والممات",
        "24": "الدهرية وإنكار البعث وأهوال القيامة",
        "30": "جزاء المؤمنين المطيعين وجزاء الكافرين العصاة"
    },
    {
        "UNK0": "سورة الأحقاف",
        "1": "إثبات وجود الله تعالى ووحدانيته ووقوع الحشر والرد على عبدة الأوثان",
        "7": "شبهات المشركين حول الوحي والنبوة والقرآن -١ -",
        "11": "شبهات أخرى للكفار -٢ -",
        "15S": "الوصية ببر الوالدين",
        "15": "١ - وصف الولد البار بوالديه",
        "17": "٢ - وصف الولد العاق لوالديه منكر البعث",
        "21": "قصة هود عليه السلام مع قومه عاد",
        "29": "إيمان الجن بالقرآن",
        "33": "إثبات البعث والأمر بالصبر"
    },
    {
        "UNK0": "سورة محمد عليه الصلاة والسلام",
        "1": "بيان الفرق بين الكفار والمؤمنين",
        "4": "أحكام القتال والأسرى والقتلى في سبيل الله ونصرة الإسلام",
        "10": "النظر في آثار الأمم السابقة والتأمل في أحوال المؤمنين والكافرين",
        "15": "صفة نعيم الجنة وعذاب النار",
        "16S": "أوصاف المنافقين والمؤمنين",
        "16": "١ - حال المنافقين والمهتدين عند استماع آيات العقيدة",
        "20": "٢ - حال المنافقين والمؤمنين عند نزول الآيات العملية",
        "24": "٣ - حال المنافقين بعد ردتهم وعند قبض أرواحهم والتذكير بحكمة الجهاد",
        "32": "حال بعض كفار أهل الكتاب وبعض المؤمنين في الدنيا والآخرة",
        "36": "تأكيد الحث على الجهاد بالتزهيد في الدنيا"
    },
    {
        "UNK0": "سورة الفتح",
        "1": "فضائل صلح الحديبية على النبي صلى الله عليه وسلم",
        "4": "آثار صلح الحديبية في المؤمنين والمنافقين والمشركين",
        "8": "وظائف النبي صلى الله عليه وسلم وفائدة بعثته ومعنى بيعته في الحديبية",
        "11": "أحوال المتخلفين عن الحديبية",
        "18": "جزاء أهل بيعة الرضوان",
        "20": "مغانم وفتوحات ونعم كثيرة أخرى للمؤمنين",
        "25": "ذم المشركين وحكمة المصالحة يوم الحديبية",
        "27": "تصديق رؤيا الرسول صلى الله عليه وسلم عام الفتح",
        "29": "أوصاف الرسول صلى الله عليه وسلم والمرسل إليهم"
    },
    {
        "UNK0": "سورة الحجرات",
        "1": "طاعة الله تعالى والرسول صلى الله عليه وسلم والتأدب في خطاب النبي صلى الله عليه وسلم",
        "6S": "الآداب العامة",
        "6": "١ - وجوب التثبت من الأخبار",
        "9": "٢ - وسائل فض المنازعات الداخلية حكم البغاة",
        "11": "٣ - آداب المؤمن مع المؤمن ومع الناس كافة",
        "14": "أصول الإيمان الصحيح"
    },
    {
        "UNK0": "سورة ق",
        "1": "إنكار المشركين البعث والرد عليهم",
        "12": "التذكير بحال المكذبين الأولين",
        "16": "تقرير خلق الإنسان وعلم الله بأحواله",
        "23": "الحوار بين الكافر وقرينه الشيطان يوم القيامة.",
        "31": "حال المتقين",
        "36": "تهديد منكري البعث وإثباته لهم مرة أخرى وأوامر للرسول صلى الله عليه وسلم"
    },
    {
        "UNK0": "سورة الذاريات",
        "1": "القسم على وقوع البعث",
        "15": "جزاء المتقين وأوصافهم",
        "24": "قصة ضيف إبراهيم ومهمتهم في إهلاك قوم لوط‍",
        "38": "قصص أنبياء آخرين مع أقوامهم",
        "47": "إثبات وحدانية الله وعظيم قدرته",
        "52": "تهديد المشركين بالعذاب لتكذيب النبي صلى الله عليه وسلم"
    },
    {
        "UNK0": "سورة الطور",
        "1": "وقوع القيامة وإثبات العذاب في اليوم الموعود",
        "17": "جزاء المتقين ونعم الله عليهم يوم القيامة",
        "29": "متابعة التذكير والموعظة بالرغم من المكائد",
        "35": "إثبات الخالق وتوحيده بالأنفس والآفاق",
        "44": "الإعراض عن الكفار لمكابرتهم في المحسوسات"
    },
    {
        "UNK0": "سورة النجم",
        "1": "إثبات النبوة وظاهرة الوحي",
        "19": "منع الإشراك وبيان عدم فائدة الأصنام",
        "27": "توبيخ المشركين لتسميتهم الملائكة بنات الله",
        "31": "جزاء المسيئين والمحسنين وأوصاف المحسنين",
        "33": "توبيخ بعض كبار المشركين الأغنياء لإعراضه عن اتباع الحق وتذكيره بما في صحف إبراهيم وموسى",
        "55": "الاتعاظ‍ بالقرآن وبرسالة الرسول والتحذير من أهوال القيامة"
    },
    {
        "UNK0": "سورة القمر",
        "1": "انشقاق القمر وموقف المشركين منه",
        "9S": "إعادة قصص الأمم الخالية المكذبة للرسل",
        "9": "١ - قصة قوم نوح عليه السلام",
        "18": "٢ - قصة عاد قوم هود عليه السلام",
        "23": "٣ - قصة ثمود قوم صالح عليه السلام",
        "33": "٤ - قصة قوم لوط‍ عليه السلام",
        "41": "٥ - قصة آل فرعون",
        "43": "توبيخ المشركين من كفار قريش وبيان جزاء المجرمين والمتقين"
    },
    {
        "UNK0": "سورة الرحمن جل ذكره",
        "1S": "أعظم النعم الإلهية الدنيوية والأخروية",
        "1": "١ - نعمة القرآن والأشياء الكونية والأرضية",
        "14": "٢ - توضيح أحوال بعض النعم",
        "26": "فناء النعم والكون كله وبقاء الله تعالى",
        "31": "الجزاء والثواب على الأعمال في الآخرة",
        "37": "تصدع السماء وأحوال المجرمين يوم القيامة",
        "46S": "أنواع نعم الله على المتقين في الآخرة",
        "46": "١ - وصف الجنات",
        "62": "٢ - وصف آخر للجنات"
    },
    {
        "UNK0": "سورة الواقعة",
        "1": "قيام القيامة وأصناف الناس",
        "13": "أنواع نعيم السابقين",
        "27": "أنواع نعيم أصحاب اليمين",
        "41": "أنواع عذاب أهل الشمال في الآخرة",
        "57": "أدلة الألوهية وإثبات القدرة على البعث والجزاء",
        "75": "إثبات النبوة وصدق القرآن وتوبيخ المشركين على اعتقادهم"
    },
    {
        "UNK0": "سورة الحديد",
        "1": "التسبيح لله في جميع الأوقات وأسبابه",
        "7": "بعض التكاليف الدينية الحث على الإيمان بالله تعالى ورسوله صلى الله عليه وسلم وعلى الإنفاق",
        "13": "حال المنافقين يوم القيامة",
        "16": "خشية الله وجزاء المتصدقين والمؤمنين وجزاء الكافرين",
        "20": "حال الدنيا والحث على عمل الآخرة",
        "22": "تعلق المصائب بالقضاء والقدر وجناية البخلاء على أنفسهم",
        "25S": "الغاية من بعثة الرسل",
        "25": "١ - دستور المجتمع الإسلامي ونظام الحكم",
        "26": "٢ - وحدة الشرائع في أصولها وصلة الإسلام بما قبله"
    },
    {
        "UNK0": "سورة المجادلة",
        "1": "الظهار وكفارته",
        "5": "وعيد الذين يعادون الله تعالى والرسول صلى الله عليه وسلم",
        "8": "عقاب المتناجين بالسوء وآداب المناجاة في القرآن",
        "11": "أدب المجالسة في الإسلام",
        "12": "الصدقة قبل مناجاة الرسول صلى الله عليه وسلم",
        "14": "حال المنافقين الذين يوالون غير المؤمنين",
        "20": "جزاء المعادين لله تعالى والرسول صلى الله عليه وسلم والوعد بنصر المؤمنين وتحريم موالاة الأعداء"
    },
    {
        "UNK0": "سورة الحشر",
        "1": "إجلاء يهود بني النضير",
        "6": "حكم الفيء",
        "11": "تواطؤ المنافقين واليهود وجزاؤهم",
        "18": "الأمر بالتقوى والعمل للآخرة",
        "21": "مكانة القرآن وعظمة منزله ذي الأسماء الحسنى"
    },
    {
        "UNK0": "سورة الممتحنة",
        "1": "النهي عن موالاة الكفار",
        "4": "التأسي بإبراهيم عليه السلام والذين آمنوا معه",
        "8": "علاقة المسلمين بغيرهم",
        "10": "حكم المهاجرات من دار الكفر إلى دار الإسلام",
        "12": "مبايعة النبي صلى الله عليه وسلم المهاجرات (بيعة النساء)"
    },
    {
        "UNK0": "سورة الصف",
        "1": "الدعوة إلى القتال في سبيل الله صفا واحدا",
        "5": "التذكير بقصة موسى وعيسى عليهما السلام مع بني إسرائيل",
        "10": "التجارة الرابحة"
    },
    {
        "UNK0": "سورة الجمعة",
        "1": "خصائص النبي صلى الله عليه وسلم بالنسبة للعرب والناس كافة",
        "5": "حال اليهود مع التوراة وتمني الموت",
        "9": "فرضية صلاة الجمعة وإباحة العمل بعدها"
    },
    {
        "UNK0": "سورة المنافقون",
        "1": "أقبح أوصاف المنافقين في ميزان الشرع",
        "5": "أدلة إثبات كذب المنافقين ونفاقهم",
        "9": "تحذير المؤمنين من أخلاق المنافقين وأمرهم بالإنفاق في سبيل الخير"
    },
    {
        "UNK0": "سورة التغابن",
        "1": "مظاهر قدرة الله تعالى",
        "5": "إنكار المشركين الألوهية والنبوة والبعث",
        "8": "المطالبة بالإيمان والتحذير من أهوال القيامة",
        "11": "كل شيء بقضاء وقدر",
        "14": "التحذير من فتنة الأزواج والأولاد والأموال والأمر بالتقوى والإنفاق"
    },
    {
        "UNK0": "سورة الطلاق",
        "1": "أحكام الطلاق والعدة وثمرة التقوى والتوكل",
        "4": "عدة اليائسة والصغيرة",
        "6": "السكنى والنفقة للمعتدة وأجر الرضاع",
        "8": "وعيد المخالفين ووعد الطائعين والتذكير بقدرة الله"
    },
    {
        "UNK0": "سورة التحريم",
        "1": "بعض أحوال نساء النبي صلى الله عليه وسلم",
        "6": "الوقاية من النار والتوبة النصوح وجهاد الكفار",
        "10": "أمثلة من النساء المؤمنات والكافرات"
    },
    {
        "UNK0": "سورة الملك، أو: تبارك",
        "1": "بعض أدلة القدرة الإلهية",
        "6": "تعذيب الكفار العصاة",
        "12": "وعد المؤمنين بالمغفرة وتهديد الكافرين مرة أخرى",
        "16": "أنواع من الوعيد والتهديد والعبرة بالأمم السابقة",
        "20": "توبيخ المشركين على عبادة الأصنام وإثبات قدرة الله واختصاصه بعلم البعث",
        "28": "دعاء كفار مكة على النبي صلى الله عليه وسلم والمؤمنين بالهلاك"
    },
    {
        "UNK0": "سورة القلم",
        "1": "كمال الدين والخلق عند النبي صلى الله عليه وسلم",
        "8": "الأخلاق الذميمة عند الكفار",
        "17": "قصة أصحاب الجنة",
        "34": "جزاء المتقين وإنكار التسوية بين المطيع والعاصي",
        "44": "تخويف الكفار من قدرة الله تعالى وأمر النبي صلى الله عليه وسلم بالصبر والتذكير العالمي بالقرآن"
    },
    {
        "UNK0": "سورة الحاقة",
        "1": "تعظيم يوم القيامة وإهلاك المكذبين به",
        "13": "بعض أهوال القيامة",
        "19": "حال الأبرار الناجين بعد الحساب",
        "25": "حال الأشقياء يوم القيامة",
        "38": "تعظيم القرآن وإثبات نزوله بالوحي"
    },
    {
        "UNK0": "سورة المعارج",
        "1": "تهديد المشركين بعذاب القيامة وتأكيد وقوعه",
        "19": "الخصال العشر التي تعالج طبع الإنسان",
        "36": "أحوال الكفار المكذبين بالرسول صلى الله عليه وسلم في الدنيا والآخرة"
    },
    {
        "UNK0": "سورة نوح عليه السلام",
        "1": "إرسال نوح عليه السلام إلى قومه",
        "5": "مناجاة نوح ربه وشكواه إليه",
        "21": "أنواع من قبائح قوم نوح وأقوالهم وأفعالهم"
    },
    {
        "UNK0": "سورة الجن",
        "1": "إيمان الجن بالقرآن وبالله تعالى",
        "8": "حكاية أشياء أخرى عن الجن",
        "18": "أنواع أخرى من الموحى به إلى النبي صلى الله عليه وسلم وبيان أصول رسالته",
        "25": "علم تعيين الساعة مختص بالله عالم الغيب"
    },
    {
        "UNK0": "سورة المزمل",
        "1": "إرشاد النبي صلى الله عليه وسلم في بدء الدعوة",
        "11": "تهديد الكفار وتوعدهم",
        "19": "تذكير وإرشاد بأنواع الهداية"
    },
    {
        "UNK0": "سورة المدثر",
        "1": "إرشادات للنبي صلى الله عليه وسلم في بدء الدعوة",
        "11": "تهديد زعماء الشرك",
        "31": "الحكمة في اختيار عدد خزنة جهنم التسعة عشر",
        "38": "الحوار بين أصحاب اليمين وبين المجرمين"
    },
    {
        "UNK0": "سورة القيامة",
        "1": "إثبات البعث والمعاد وعلائمه",
        "16": "حرص النبي صلى الله عليه وسلم على حفظ‍ القرآن وحال الناس في الآخرة",
        "26": "تفريط‍ الكافر في الدنيا وإثبات البعث"
    },
    {
        "UNK0": "سورة الإنسان، أو: الدهر",
        "1": "خلق الله الإنسان وهدايته السبيل",
        "4": "جزاء الكفار والأبرار يوم القيامة",
        "13": "مساكن أهل الجنة وأشربتهم وخدمهم وألبستهم",
        "23": "أحوال الطائعين والمتمردين المشركين في الدنيا"
    },
    {
        "UNK0": "سورة المرسلات",
        "1": "وقوع يوم القيامة حتما ووقته وعلاماته",
        "16": "تخويف الكفار وتحذيرهم من الكفر",
        "29": "أنواع ثلاثة أخرى من وجوه تخويف الكفار كيفية عذابهم في الآخرة",
        "41": "الأنواع الباقية من تهديد الكفار وتعذيبهم"
    },
    {
        "UNK0": "سورة النبأ، أو: عم",
        "1": "الإخبار عن البعث وأدلة إثباته",
        "17": "أوصاف يوم القيامة وأماراته ونوع عذابه",
        "31": "أحوال السعداء",
        "37": "عظمة الله ورحمته وتأكيد وقوع يوم القيامة وتهديد الكافرين المعاندين"
    },
    {
        "UNK0": "سورة النازعات",
        "1": "الحلف على وقوع البعث وأحوال المشركين فيه والرد على إنكارهم إياه",
        "15": "التهديد بقصة موسى عليه السلام مع فرعون",
        "27": "إثبات البعث بخلق السموات والأرض والجبال",
        "34": "جزاء فريقي الناس في الآخرة وتفويض علم الساعة لله تعالى وقصر مدة الدنيا"
    },
    {
        "UNK0": "سورة عبس",
        "1": "المساواة في الإسلام",
        "11": "القرآن موعظة وتذكرة ونعم الله في نفس الإنسان",
        "24": "نعم الله فيما يحتاج إليه الإنسان",
        "33": "أهوال القيامة"
    },
    {
        "UNK0": "سورة التكوير",
        "1": "أحوال القيامة وأهوالها",
        "15": "الحلف لإثبات صدق الوحي القرآني ونبوة الرسول صلى الله عليه وسلم"
    },
    {
        "UNK0": "سورة الانفطار",
        "1": "أمارات القيامة والجزاء على العمل وتوبيخ الإنسان على جحود النعم",
        "9": "علة الجحود وكتابة الملائكة وانقسام الناس فريقين"
    },
    {
        "UNK0": "سورة المطففين",
        "1": "وعيد المطففين",
        "7": "ديوان الشر وقصة الفجار",
        "18": "ديوان الخير وقصة الأبرار",
        "29": "سوء معاملة الكفار للمؤمنين في الدنيا ومقابلتهم بالمثل في الآخرة"
    },
    {
        "UNK0": "سورة الانشقاق",
        "1": "أهوال يوم القيامة وانقسام الناس فريقين",
        "16": "تأكيد وقوع القيامة وما يتبعها من الأهوال"
    },
    {
        "UNK0": "سورة البروج",
        "1": "القسم بأشياء عظام على لعنة أصحاب الأخدود",
        "10": "عقاب الكفار وثواب المؤمنين",
        "12": "كمال القدرة الإلهية لتأكيد الوعد والوعيد والاعتبار بإهلاك الأمم الكافرة السالفة"
    },
    {
        "UNK0": "سورة الطارق",
        "1": "القسم على أن لكل نفس حافظا من الملائكة يراقبها وإثبات إمكان البعث",
        "11": "القسم على صدق القرآن والرسالة وتهديد الكائدين لهما"
    },
    {
        "UNK0": "سورة الأعلى",
        "1": "تنزيه الله تعالى وقدرته وتحفيظه القرآن لنبيه",
        "9": "التذكير وتزكية النفس والعمل للآخرة"
    },
    {
        "UNK0": "سورة الغاشية",
        "1": "هول القيامة وأحوال أهل النار",
        "8": "أحوال المؤمنين المخلصين أهل الجنة",
        "17": "إثبات قدرة الله تعالى على البعث وغيره والتذكير بأدلة ذلك"
    },
    {
        "UNK0": "سورة الفجر",
        "1": "حتمية عذاب الكفار وجزاء بعضهم في الدنيا",
        "15": "توبيخ الإنسان على قلة اهتمامه بالآخرة وفرط‍ تماديه في الدنيا",
        "21": "حال الإنسان الحريص على الدنيا والمترفع عنها يوم القيامة"
    },
    {
        "UNK0": "سورة البلد",
        "1": "ابتلاء الإنسان بالتعب واغتراره بقوته وماله",
        "8": "مبدأ الاختيار وطريق النجاة في الآخرة"
    },
    {
        "UNK0": "سورة الشمس",
        "1": "جزاء إصلاح النفس وإهمالها",
        "11": "العظة بقصة ثمود"
    },
    {
        "UNK0": "سورة الليل",
        "1": "اختلاف مسعى الناس",
        "12": "قد أعذر من أنذر"
    },
    {
        "UNK0": "سورة الضحى",
        "1": "نعم الله تعالى على النبي محمد صلى الله عليه وسلم"
    },
    {
        "UNK0": "الشرح، أو: الانشراح",
        "1": "نعم الله على نبيه وما أمره به"
    },
    {
        "UNK0": "سورة التين"
    },
    {
        "UNK0": "سورة العلق",
        "1": "الحكمة في خلق الإنسان وتعليمه القراءة والكتابة",
        "9": "صور أخرى من الطغيان وتهديد الطغاة ووعيدهم"
    },
    {
        "UNK0": "سورة القدر",
        "1": "بدء نزول القرآن وفضائل ليلة القدر"
    },
    {
        "UNK0": "سورة البينة",
        "1": "لا تكليف بلا بيان ولا عقوبة دون إنذار",
        "6": "وعيد الكفار ووعد الأبرار وجزاء الفريقين"
    },
    {
        "UNK0": "سورة الزلزلة",
        "1": "أمارة القيامة والجزاء على الخير والشر"
    },
    {
        "UNK0": "سورة العاديات",
        "1": "جحود النعم والبخل لحب الخير وإهمال الاستعداد للآخرة"
    },
    {
        "UNK0": "سورة القارعة",
        "1": "أهوال القيامة وأماراتها وميزان الحساب فيها"
    },
    {
        "UNK0": "سورة التكاثر",
        "1": "التفاخر في الدنيا والسؤال عن الأعمال"
    },
    {
        "UNK0": "سورة العصر",
        "1": "رسالة الحياة أو حال المؤمن والكافر"
    },
    {
        "UNK0": "سورة الهمزة",
        "1": "الطعان العياب للناس وجزاؤه"
    },
    {
        "UNK0": "سورة الفيل",
        "1": "قصة أصحاب الفيل"
    },
    {
        "UNK0": "سورة قريش",
        "1": "التذكير بنعم الله على قريش"
    },
    {
        "UNK0": "سورة الماعون",
        "1": "الكافر المنكر الجزاء الأخروي والمنافق المرائي بعمله وعقاب كل منهما"
    },
    {
        "UNK0": "سورة الكوثر"
    },
    {
        "UNK0": "سورة الكافرون",
        "1": "سورة البراءة من الشرك والكفر وأعمال المشركين"
    },
    {
        "UNK0": "سورة النصر",
        "1": "فتح مكة"
    },
    {
        "UNK0": "سورة المسد، أو: اللهب",
        "1": "جزاء أبي لهب وامرأته"
    },
    {
        "UNK0": "سورة الإخلاص",
        "1": "سورة التوحيد والتنزيه لله عز وجل"
    },
    {
        "UNK0": "سورة الفلق",
        "1": "الاستعاذة من شر المخلوقات"
    },
    {
        "UNK0": "سورة الناس",
        "1": "الاستعاذة من شر الشياطين"
    }
]